{
    "moves": {
        "1. e4 e5 2. d4": "This is the Center Game. I've been playing a fair bit of the Danish Gambit recently (which continues 2...exd4 3.c3) and it's become a favorite of mine over some of the more common responses to 1...e5, especially in blitz. The general theory: White gives up a pawn or two in the center, in exchange for open lines and accelerated development.",
        "2... Qf6": "?! This overly-aggressive move receives a (?!) instead of a (?) only because it's blitz, and the format favors early attacks and violent traps. Of course, in any other format (or against a level-headed opponent), this move is simply inferior, as it brings the Queen out far too early, takes away the King Knight's best spot, and doesn't really threaten anything specific.",
        "3. Nf3": "The logical response. White develops naturally.",
        "3... Bb4+": "Black attempts to develop with tempo, but this is easy to repel and simply gives me a free move to shore up my center.",
        "4. c3": "I kick the Bishop and reinforce d4. My Queen Knight will probably be developing to d2 anyway.",
        "4... exd4": "? Black hands over his Bishop for no obvious reason.",
        "5. Bg5": "No reason to capture yet; this move allows White to develop his own Bishop with tempo.",
        "5... Qg6": "To at least gain a pawn for his lost Bishop.",
        "6. cxb4 Qxe4+ 7. Be2": "White has a Bishop for two pawns and is significantly ahead in development already. Black has a passed d-pawn, but it is indefensible and has no prospects--in fact, my *missing* pawns are greater benefits for me, because they provide beautiful open lines through the center.",
        "7... f6": "? Kicking the Bishop, but weakening the kingside and again denying the f6 square to his own Knight. Better was 7...d5.",
        "8. Bh4": "This Bishop wants to land on the h2-b8 diagonal.",
        "8... Nh6": "The Knight finally develops, but it has little to do at the moment. Probably it will head for f5 at some point in the future, but that would have been better accomplished by 8...Ne7.",
        "9. O-O": "White gets his King out of the center, brings his Rook into the game, and unpins the Bishop at e2 so it can be transferred to d3 or c4.",
        "9... Ng4": "? Black seems to be trying to mate me with as few pieces as possible. Unfortunately for him, Q+N is not sufficient against all my kingside defenders. Further, this move (A) delays development, and (B) delays castling--with his King and Queen sharing the open e-file, castling should be first on Black's mind right now. This was Black's last free move: now, my lead in development (five active pieces against Black's two) allows me to take the initiative and start making threats to which Black must respond. It's been nine moves; let's see how well each side is prepared.",
        "10. Bc4": "I move to deny Black his castle (thanks to the frivolous f-pawn move). Black would love to reply with 10...d5 to kick my Bishop and open up a line for his own, but he can't do it, because I'm threatening to win his Queen with Re1.",
        "10... Qf4": "The BQ runs away, with a cursory threat at h2. Better was to admit his mistake and play 10...Qg6.",
        "11. Bg3": "I take the opportunity to relocate my Bishop right where I want it, and boot the BQ off to some less useful square. The initiative remains firmly in my hand as I use the overextended Black Queen for target practice.",
        "11... Qh6": "Black continues to glare at h2, but it is very well defended. His threats are empty. In the meantime, I have a full contingent of pieces headed for the Black King.",
        "12. Re1+ Kf8": "A check, and the Black King sidles out of the line of fire, but now he can't move at all.",
        "13. Nxd4": "This capture serves several purposes: I now threaten to jump in on e6 or f5 with my Knight, as well as defending c6 if Black tries to develop his own Knight. In addition, the move reveals an attack on Black's defenseless Ng4. Once again, Black must respond to my threats instead of making his own plans.",
        "13... Qg5": "It looks like Black is beginning to see the severity of his situation. He moves to defend g4 and f5. I think 13...Qg6 was better, though, to defend e8.",
        "14. Qe2": "I can keep the threats coming all day. This time it's Qe7# or Qe8# (once again thanks to my Bc4 doing an admirable job of locking down the Black King). Neither 14...d4 nor 14...Qg6 is sufficient to meet both threats.",
        "14... Ne5": "I think this is the best Black has to offer, but it's not good enough.",
        "15. f4": "The Knight is pinned by the threat of mate, so it must allow itself to be captured... opening the f-file for my use in the process. Not only that, but Black must *still* respond to this move, since I'm also jabbing at his Queen.",
        "15... Qg6": "The BQ gets out of the way and defends f7 and d8. As I've said, I think she belonged here from some time ago, trying to shore up all these weak light squares.",
        "16. fxe5": "White's positional advantage is absolutely overwhelming. I now threaten 17.exf6 Qxf6 18.Rf1, with mate to follow: 18...Qxf1+ 19.Qxf1+ Kmoves 20.Qf7+ and so on. If 18...gxf6?? 19.Qe7# seals the deal immediately.",
        "16... fxe5": "? Probably Black's best shot was 16...f5. Opening the f-file like this only invites disaster (and if White is allowed to take on f6, things are just as bad).",
        "17. Rf1+": "White switches to the new open file before recapturing on e5--to retain his checking power and an irresistible initiative.",
        "17... Ke7": "Forced into the line of fire.",
        "18. Qxe5+": "King exposed, only the Queen around to defend him, Black is finished.",
        "18... Qe6": "Or 18...Kd8 19.Bh4+ with mate to follow. Black's Queen interposes bravely, but she cannot save the day.",
        "19. Qxg7+": "There's no need to take the Queen: White has a more important target in his sights.",
        "19... Kd8": "Or 19...Qf7 20.Qxf7+ Kd8 21.Bh4#",
        "20. Qxh8+": "The material gain is obviously irrelevant: what matters is that the back rank belongs to me, now. It's mate in one.",
        "20... Qe8": "Or 20...Ke7 21.Qf8#. Black's Queen tries to sacrifice herself one last time.",
        "21. Bh4#": "And that's all she wrote. Try as she might, Black's lone Queen simply could not keep up with all the threats that the coordinated White forces were able to deliver. Meanwhile, the final position shows just how little Black bothered to develop. This game is a pretty clear example of how clean, basic development can triumph over wild and ill-prepared attacks. I hope you enjoyed it!"
    },
    "url": "https://gameknot.com/annotation.pl/nonstop-threats?gm=52240",
    "gameName": "Nonstop Threats",
    "players": "bwaa  vs. NN ",
    "opening": "Centre game (C21)"
}