{
    "moves": {
        "1. e4": "I was going up against a stronger player so as the game unfolded I figured I'd make moves that I wouldn't normally make.  Obviously, the reason is because I thought I wasn't going to win.  Lame psychology, I know.  But, it is what it is.",
        "1... c5 2. f4": "I play the sicilian against my chess enemy cdf555(who is much better than I am).  He always plays the kings gambit against my sicilian, so....",
        "2... e5": "as black, my response to 2.f4 is 2...g3 against cdf555",
        "3. Nf3 exf4 4. Bc4": "The kings gambit is a lightning game. For one pawn, white gets a tremendous lead in development.",
        "4... g5": "Over the years of being absolutely crushed by cdf555 with his kings gambit, I've begun to hate open games.  I'm getting out of my comfort zone here, cause there are diagonals and files opening up all over the place.",
        "5. O-O": "my light squared bishop, I believe is a problem.  My opponent never did get rid of it though.  Also, notice how long it takes for him to move his queen pawn.",
        "5... Nc6 6. b3 Bg7 7. Nc3 a6": "This move prevents knight from going to b5 and then onto d6.",
        "8. Rb1": "To fianchetto my dark squared bishop",
        "8... h6": "even now, 8...b5 will knock my bishop off its perch.  I have to admit, I can't find a reason for 8...h6.  Is it to free the queen for an attack on c3?",
        "9. e5": "This is where I get frisky.  I'll be down two pawns, but soon, my opponent will have one developed piece and it will be pinned for a while",
        "9... Nxe5 10. Nxe5 Bxe5 11. Re1": "This is the position I was referring.  One piece developed and it is stuck for awhile",
        "11... d6 12. Bb2": "I thought about attacking c5 with 12.b4, but 4 moves down it didn't seem to pan out in my favor.  12.b4 cxb4 13. rxb4 qa5...  Opponent Pieces being developed while they are focusing on my c3 knight.",
        "12... Ne7 13. Nd5": "want to keep the bishop pinned.  If 13...Bxb2, then white sees problems with 14.Rxe7",
        "13... Nxd5 14. Bxd5 O-O 15. Bxe5 dxe5 16. Rxe5": "Got a pawn back, and I have two pieces in the center that seem to take away a lot of moves for black.",
        "16... Kg7 17. c4 f6 18. Re1": "His kings light squares are open.  He shouldn't feel too scared about this, since he has a light squared bishop.  But, if i were black, I would feel better if white's light squared bishop were not there.",
        "18... Rb8 19. d4 Bf5": "This is not a bad move, I guess.  It does get his light squared bishop into that forest of dark squared pawns, but it also pushes my rook up allowing me to double them up.",
        "20. Rb2 cxd4 21. Qxd4 Re8 22. Rbe2 Rxe2 23. Rxe2": "I have a well placed bishop, my rook owns the only open file.  He has a lot of kingside pawns, and he is a pawn up.  But, still I feel I am doing ok here.",
        "23... Qc7 24. Qb2": "Obviously, my plan is to get my queen to a3 and rook to e7 for the ultimate fork.  But, who doesn't know what I'm trying to do?",
        "24... b5 25. Qa3 Qa7+": "Nice.  Look out for tragic pins.  26.kf1  Bd3",
        "26. Kh1 b4 27. Qc1": "Now looking to get my queen behind the rook",
        "27... Qc5 28. Qe1 g4 29. Re7+ Kg6 30. Bf7+ Kg5 31. Be8 h5 32. Qe2": "My next plan is to focus on that g4 pawn.  That thing cannot move.",
        "32... h4": "I'm still trying to find out why this was played.  I think he should've gone on with the plan he starts his next move.",
        "33. h3 Qd4 34. hxg4": "From here on out, things are pretty forced as far as I can see.",
        "34... Bd3 35. Qe6 Rxe8 36. Rxe8 Bg6 37. Rg8 Kh6": "If 37...Qf1 38.Kh2  if 38...Qxg4 39.RxBch",
        "38. Rh8+ Kg5 39. Qd5+ Qxd5 40. cxd5 Kxg4 41. d6 Bf5 42. Rg8+ Kh5 43. Rg7 Kh6 44. Ra7 Kg6 45. d7": ""
    },
    "url": "https://gameknot.com/annotation.pl/noonan?gm=28193",
    "gameName": "noonan",
    "players": "doolie (1657) vs. jomini (1762)",
    "opening": "Sicilian (B21), Grand Prix attack"
}