{
    "moves": {
        "1. e4 e6": "This was no surprise, although I'd never seen Andy faced with 1.e4 I did find some of his d4 games online and he tries to steer them into French Defence lines. I did manage to do a little prep on the KIA ahead of this game. As I play the French myself, I don't like to go into main lines as white.\n",
        "2. d3 d5 3. Nd2 Nf6 4. Ngf3 Nc6": "This threw me as the normal move here would be ...c5 and this wasn't what I was expecting.\nAlternative variation: 4... c5 \n",
        "5. g3 dxe4": "I wasn't happy to see this move, it's not something I know anything about and I don't usually enjoy playing exchange variations.\n",
        "6. dxe4 e5": "The point of ...dxe4, my bishop is now going to look very silly on g2 however, if I just continue my development and formulate a plan later on. I can't be getting worked up about things like this.\n",
        "7. Bg2 Bc5 8. O-O O-O 9. c3": "Taking squares away preventing the knight from coming to d4.\n",
        "9... a5": "Securing c5 for his bishop.\n",
        "10. Qc2": "Overprotecting e4 and allowing the knight to move if required.\n",
        "10... Qe7 11. Nc4": "Not an outpost but can re-route to e3 where it will be looking at d5 and f5. From c4 we are also activating the dark squared bishop and also gives white the opportunity to make use of the open file.\n",
        "11... b6": "Threatening ...Ba6 and pinning the Knight to the Rook.\n",
        "12. Rd1": "Just side-stepping black's threat whilst grabbing the open file. White is controlling quite a lot of central squares right now.\nAlternative variation: [I also considered this, which might have been better.] 12. Ne3 [It also prevents ...Ng4 though I'm not overly convinced that ...Ng4 is as good as black thought it was.]\n",
        "12... Ng4": "Pouncing on the fact that white has left f2 undefended with Rd1. I didn't see this as a threat though.\n",
        "13. Ne3": "The best move and there's absolutely nothing wrong with this.\n",
        "13... Nxe3 14. Bxe3 Bxe3 15. fxe3": "I'm not sure whether black simply thought my doubled isolated pawns were a weakness here. To be honest, I was happy with this position as I can only see this pawn structure as a strength. The pawns are controlling some important squares, d4, d5, f4 and f5 and because they aren't on an open file, they cannot be targeted either.\n",
        "15... Ba6": "My bishop on g2 will later be able to come to f1 and trade with black so the earlier concerns about this piece will no longer exist and the queen can help along the 2nd rank if the Queen ever looks draughty.\n",
        "16. Rd2": "Preparing to bring the last piece into the game and control the open file.\n",
        "16... Rad8": "Black doesn't have much choice here, he can't just allow me to grab the file.\n",
        "17. Rad1 h6": "I wasn't sure what this was, maybe just a waiting move as I had a critical decision to make here.\n",
        "18. Rd2xd8 Rxd8 19. Rxd8+ Qxd8": "Again, I don't see the isolated pawns as a weakness. Even in an endgame I was confident that I could hold it. I just need to ensure that if I do enter a K&P endgame, I don't allow black to create an outside passed pawn.\n",
        "20. Qd2 Qd3": "Interesting, black's trying to get some minor piece activity but it wouldn't have made any difference really if he's just taken the Queen.\nAlternative variation: 20... Qxd2 21. Nxd2 Bd3 [The only difference with this variation is that black is a move behind. He's attacking the pawn after it's already been defended.]\n",
        "21. Qxd3 Bxd3 22. Nd2 Nd8": "Planning to re-route in order to target the e4 pawn. It's already defended twice so I wasn't concerned about this. Of course black's minor pieces are active and mine are passive but as I'm out-graded by over 20 points, I would be happy to just close off all entry points and take a draw here.\n",
        "23. g4": "Here I was thinking about the K&P ending and wanted to ensure that the h-pawn couldn't potentially become a runner.\n",
        "23... Ne6 24. Kf2": "Thinking about bringing the king in for defensive duties in order for a minor piece to activate.\n",
        "24... Nc5 25. b3": "Just taking more squares away from pieces.\n",
        "25... f6 26. h4 Kf7 27. Kf3 Ke7 28. Bf1 Bxf1 29. Nxf1": "Here I offered a draw Andy said he would think about it.\nAfter a few minutes thought Andy said he will play on a little more and played the following move\n",
        "29... Nd3 30. Nd2 Nc1 31. a3": "Now all the entry points are covered and everything is defended.\n",
        "31... Ke6": "Andy then said he couldn't make any progress and offered me a draw. I accepted as I was of the same opinion. If anything, I thought maybe black was a little better but even my isolated doubled pawns weren't a disadvantage at this stage.\n"
    },
    "url": "https://gameknot.com/annotation.pl/norman-ellis-open-roundhay-parichial-hall?gm=65674",
    "gameName": "Norman Ellis Open, Roundhay Parichial Hall",
    "players": "Ibbitson, Anthony (141) vs. Bagley, Andy (165)",
    "opening": "French (C00), Reversed Philidor formation"
}