{
    "moves": {
        "1. d4 d5 2. c4": "The game starts off with a Queen's Gambit...\n",
        "2... e6": "Declined. This seems counter-intuitive, blocking in my light-square bishop, but it's solid (there was another game where I played Bf5, intending to play e6 next move. I paid heavily for it - the annotation of that particular game will come soon)  I would also consider Nf6 some time\n",
        "3. Nf3 Nc6 4. g3": "White prepares a kingside fianchetto, but according to GK analysis (which had labelled all moves as 'book' so far) , this is an inaccuracy that gives Black a .53 advantage. GK gives 4.Nc3 Nf6 as equal in the position.\n",
        "4... Bd7": "making room for queenside castling (though I never do so in the game)\n",
        "5. Bg2": "logical\n",
        "5... Nf6": "there is nothing wrong with this move, but if I were to reach this position again, I would like to try something different; Qe7, 0-0-0. g6, Bg7 and Nf6, if I get the chance. The resulting game for Black would be less cramped than the position he finds himself in soon.\n",
        "6. O-O Bb4": "? I played this move a little too quickly, and was immediately dissatisfied with it. It seemed good at the time, the bishop acting a little like a sniper zooming in on White's position, but it gets driven back too easily. The GK analyser gives dxc4 as preferable (and it does make sense now, since the bishop can't recapture anymore)\n",
        "7. a3": "?! What I feared, but White missed the more powerful c5!, where the bishop would then be trapped and captured. Here, Black can keep the diagonal with; 7...Ba5 8.b4 Nxb4 [8...Bb5 9.c5] 9.axb4 Bxb4, but I didn't like the look of that position\n",
        "7... Be7": "This is where I began to feel cramped. I would prefer to be White in this position, but the GK analyser gives this position as equal (well, .08 advantage to White, but that doesn't really make any difference)\n",
        "8. Nc3 dxc4": "I decide that it's safe now to take the pawn (Black doesn't really have much else at the moment) but this is promptly met by...\n",
        "9. e4": "! White gains the classical centre... but apparently, it is now a .45 advantage to Black. How strange....\n",
        "9... h6": "? (personally, I give myself this) This was the start of a very silly plan, and afterwards I dismissed it immediately. The plan was a kingside pawn storm, but that is hazardous for my king, for sure! 0-0 would be better [and in fact, it would have saved me a LOT of heartache! You'll see what I mean :)]\n",
        "10. Qe2": "targeting Black's c4 pawn. However, when White played this move, it gave me notice of an interesting feature in White's position...\n",
        "10... Na5": "Not only defending the pawn on b3, but also beginning an inevitable journey to the knight outpost on b3, where it will be difficult to budge.\n",
        "11. Ne5": "putting a second attacker on the c4 pawn - of course, Black needs to do something about that. But first...\n",
        "11... Nb3": "A zwischenzug! [what a weird name!] White needs to save his rook first!\n",
        "12. Rb1": "The better of the two choices\n",
        "12... b5": "Now that the c-pawn had become so important for the knight, I had no worries with playing this move. True, it does invoke weaknesses in Black's queenside position, but right now Black plans to castle kingside... I was wondering whether White would try 13.Nxc4 bxc4 14.Qxc4, but it turns out....\n",
        "13. Nxf7": "that White had a different sacrificial idea altogether! From here, I saw the line up to move 17, where I thought that I had a refutation idea to White's idea... [you know, I;ll take the opportunity now to tell you all something that I really hate about GK's analysing system - you play a move like this, it looks pretty, it works wonderfully... then along comes GK analysis, saying that it was an 'inaccuracy/mistake!' Here, GK gives 'inaccuracy,' although it ends up being 0.48 in Black's favour - still anyone's game!]\n",
        "13... Kxf7 14. e5": "The point of the sacrifice - White attacks both the knight and the rook on a1 ( a consequence of Black's 12...b5)\n",
        "14... Nd5": "?! Black does see that there are two pieces on the square that the knight had just leapt on, but like I said, I thought that I could weather the storm. Gameknot labels this a mistake, and instead prefers 14...c6, giving back the piece to loosen the pressure on the black position. (… c6 14. exf6 Bxf6 15. Be4 h5 16. Be3 Nxd4 17. Qd2 Qb6 18. Rbd1 e5 19. f4 Bg4 20. fxe5 Bxd1 21. Qxd1)\n",
        "15. Nxd5 exd5": "The most natural move, and again GK calls it a mistake. The line it suggests is 15...Nxd4, whick I had considered, in fact. However, I had dismissed it because I didn't like the position of the knight. The analysis, however, finds a way around that ( Nxd4 15. Qd1 Bc6 16. Qxd4 Bxd5 17. Rd1 c6 18. Qf4+ Kg8 19. Qg4 Qd7 20. Be4 Qc7 21. Bxd5 exd5)\n",
        "16. Bxd5+": "The envisioned position...\n",
        "16... Be6": "? and a miscalculation - Ke8 would have been best, I believe. Now...\n",
        "17. Qf3+": "! it's not just an exchange anymore - the rook is now won!\n",
        "17... Ke8": "?? ohh boy, did the analysis not like this move - from -1.45 to -7.14! (… Ke8 17. Bc6+ Bd7 18. e6 Bf6 19. exd7+ Kf8 20. Bxa8 Qxd7 21. Bc6 Qd8 22. Bxb5 Nxd4 23. Qb7 Nxb5 24. Qxb5) By the looks of things, Bf6 was Black's best try here\n",
        "18. Bxe6": "By taking the bishop instead of the rook, White creates a powerful mating threat on f7. Again...\n",
        "18... Rf8": "The most natural looking move in this position also loses! (the best line gives 6.88 for White - I guess this was more of a 'mercy killing' than anything!)\n",
        "19. Qh5+": "Mate in 3. (Qc6+ also works)\n",
        "19... Rf7": "...g6 drags it out, but there isn't much point in that really...\n",
        "20. Qxf7#": "game over! White's sac created a pretty sharp position in the game, and one slip from Black (as you can see from the change in GK analysis' score) sent everything crashing down! (and I felt that White might have been winning for some parts of the game, even though Gameknot put the game as equal before the sac) Still, I do like these kind of games, just 'cause it makes things interesting! good game :)\n"
    },
    "url": "https://gameknot.com/annotation.pl/not-my-sac-this-time?gm=31661",
    "gameName": "Not my sac, this time!",
    "players": "excile (1638) vs. x-machine (1504)",
    "opening": "QGD Slav (D30)"
}