{
    "moves": {
        "1. c4": "At this time something like 90% of my games as White began with this move, Correspondence or OTB.  However, it was surprising how often it would transpose into King's Indians or Moroczy Bind Sicilians.  Not that I minded ...",
        "1... c5": "The Symmetrical English has the reputation for being dull and drawish.  My experience never really supported this view.",
        "2. Nc3": "Not the only, but it looks like a logical continuaton.  2.Nf3 is also a popular method, often preferred as less likely to lead to \"dull symmetry\".",
        "2... Nf6": "Possibly the most usual reply, though 2...Nc6 is not uncommon.",
        "3. Nf3": "3.e4 is also playable here.",
        "3... d5": "The most active line for Black.  3...b6 or 3...e6 are playable alternatives.",
        "4. cxd5": "Practically forced.  Black's d-pawn can not be allowed to advance.",
        "4... Nxd5 5. e4": "Forces the Black knight to make a third move.  5.g3 and 5.e3 are more restrained and less loosening of White's position, but the text move is hard to pass up!",
        "5... Nb4": "Planning to disrupt White's king.  It leads to interesting complications, but is the expediture of tempi by Black worth the inconvenience caused to White?  We'll see.  Safer, by the way, is 5...Nxc3 6.bxc3 g6, when White can choose between 7.d4, transposing into a Grunfeld, or (better) 7.Bb5ch ..., 8.0-0.",
        "6. Bc4": "A logical move that anticipates Black's next...   6.d4 exd4 7.Nxd4?? runs into 7...Qxd4! ",
        "6... Nd3+": "The \"point\".  White loses his castling rights, leaving the rook hard to activate.  For all that, White's development otherwise proves quite rapid in the sequel.  However, 6...e6, say, is less good: 7.0-0 Nc6 8.d3 Nd4 9.Nxd4 cxd4 10.Ne2 a6 11.Ng3 Bd6 12.Qg4 with, according to Nimzovitch, advantage to White. *** Another line, 6...Be6 has been tried, but after 7.Bxe6 fxe6 etc, Black found his KB hard to activate in Golombek-Dijkstra, Leeuwarden,1947. ",
        "7. Ke2": "Driving the knight away from d3 before retiring to f1.",
        "7... Nf4+": "Black could also play 7...Nxc1ch, though it is hard to give up a knight with its 5th move for a unmoved bishop that has no mobility at all!To continue: 8.Rxc1 a6 (8...e6? 9.d4 cxd4 10.Bb5ch Nc6 11.Qxd4 Qxd4 12.Nxd4 Bd7 13.Rhd1 Rc8 14.Nxc6 bxc6 15.Ba4 Bb4 16.Rd4 Bc5 17.Rc4 Bb6 18.e5 f5 19.Nb5)  9.d4 cxd4 10.Qxd4 Qxd4 11.Nxd4 when White has a big lead in development with the king conveniently placed in the centre.",
        "8. Kf1 Nc6": "Deviating from 8...Ne6 played in the  Suba vs Sax game, and in Averbakh-Bondarevsky, Moscow, 1946: 9.Ne5 Qd4 10.Qa4ch Bd7 11.Nxd7 Qxd7 12.Bxe6 fxe6 13.Qxd7ch Kxd7 14.d3 e5 15.Be3 e6 16.Ke2 ...",
        "9. d4": "Gambiting a pawn for rapid development.  Much preferable to 9.d3, say.",
        "9... cxd4": "The alternative here is 9...Ng6, though it gives up a pawn: 10.dxc5 Qxd1ch 11.Nxd1 Bg4 12.Be3 e6 13.Nc3 etc.  White won't mind exchanges on f3 as he will be left with an extra pawn constituting his Q-side majority, and the B-pair into the bargain.",
        "10. Bxf4 dxc3 11. Qb3": "Naturally, exchanges on d8 come into consideration: 11.Qxd8 Nxd8 12.bxc3 when White has a big lead in development.",
        "11... e6": "Had Black played instead 11...Be6, White would be happy to double his pawns on the e-file, threatening e4-e5 with a serious bind on Black's K-side.",
        "12. Rd1": "Possibly the simple 12.Qxc3 is more circumspect, but I always liked playing on the edge...",
        "12... Qf6": "This move seemed to beckon on White's attack...",
        "13. Bg5 Qg6": "Forced.",
        "14. Bb5": "Threatens an immediate mate.  This is easily enough stopped, but White has now a fearsome attack.",
        "14... f6 15. Qxc3": "Not really a sac, as after 15...fxg5 16.Bxc6ch Ke7 is merely an exchange (Black won't want to recapture 16...bxc6 17.Qxc6ch Ke7 18.Qxa8 Ba6ch 14.Kg1 When Black is the exchange plus pawn down, and still has to activate half his remaining pieces). After16...Ke7 17.Qc5ch Kf7 (17...Kf6 18.Qd4ch) 18.Ne5ch Kf6 19.Qd4 Qh5 (the sole escape square for the queen as 19...Qh6 20.Ng4ch wins) 20.Ng6ch! Kf7 (20...Kxg6 21.Be8ch) 21.Nxh8ch etc",
        "15... Qxe4": "Un unexpected counterattack hoping, perhaps, to disrupt White's attack, and to hang on until he can make use of his central majority.  I expected here 15...Bd7, here, after which Black gets a playable game: 16.Qd3 Rd8 17.Bxc6 bxc6 18.Be3... Omission of this useful move here or next move imposes a huge strain on Black's available defensive resources.",
        "16. Bxf6": "(!) With a nasty threat: 17.Rd8ch Kf7 18.Ng5ch, picking up the queen on e4.  Accepting the offer leads to 16...gxf6 17.Qxf6 when Black has to let go his h8-rook on account of the threat 18.Rd8#.",
        "16... Qb4": "(?) The last chance for ...Bd7, but White retains a big edge: e.g. 16...Bd7 17.Bxg7 Rg8 18.Bxf8 Rxf8 19.Qg7 (threatening d7 from an unexpected angle) 19...Rd8 (19...Rf7?? 20.Qxf7ch) 20.Bxc6 bxc6 21.Ne5 ... *** After the text, Black is lost.",
        "17. Rd8+": "(!) Not the only method, but since this move has been threatening for some time, without Black doing anything direct against it, I hardly looked at any alternatives.  Besides, the text is more spectacular than the prosaic 17.Bxc6ch!",
        "17... Kf7": "Forced.  The king hunt begins...",
        "18. Ng5+ Kg6": "White had to calculate the likely consequences of 18...Kg8 here: 19.Qxb4 Nxb4 20.Be7! Bd7 21.Rxa8 Bxb5ch 22.Kg1 g6 23.Bxf8! etc.",
        "19. Bd3+ Kh5": "19...Kh6 doesn't help: 20.Nf7ch Kh5 21.g4ch etc.",
        "20. g4+": "(!?) Sufficient, but not as decisive as 20.h3! which threatens g4ch followed by Nf7# or Nc3# depending on Black's reply.  Black's only defensive try seems to be 20...Nxd8 (guarding f7) 21.Bxd8 (renewing the threat) 21...e5 (guarding g4) 22.Qxe5 (threatening Nf7ch or Ne6ch as well as g4ch), when Black has no defence.   ",
        "20... Kh4": "20...Kxg4 got axed by 21.Be2ch Kf5 22.Qf3ch Qf4 (22...Kg6 23.Bd3ch Kh6 24.Nf7#) 23.Bd4ch Kxf6 24.Qxf4ch Ke7 25.Qc7ch Kf6 26.Qf7ch Kxg5 (26...Ke5 27.Nf3#) 27.Rg1ch Kh6 (or ...Kh4) 28.Qf4ch and mate next move.***\n20...Qxg4 21.Be2 and the queen's a goner: 21...Qxe2 22.Kxe2 Nxd8 23.Bxd8 etc.",
        "21. Bf5": "(!)  White has 3 pieces \"en prise\", the queens are up for exchanges, and it is Black's move... White wins.",
        "21... gxf6": "Trying to create an escape square at g5.  ",
        "22. Nf3+ Kh3": "Black actually resigned at this point, but I'll here append the forced mate...",
        "23. Ng1+": "An unusual finish: White completes the mating net by undeveloping the knight.",
        "23... Kh4 24. Qxf6#": "Checkmate!  Half of Black's pieces never saw action.\nOne of my better efforts in an otherwise mediocre performance in the tourney overall (about the middle of the bottom half, as I recall).  "
    },
    "url": "https://gameknot.com/annotation.pl/not-quite-a-miniature?gm=7527",
    "gameName": "Not quite a miniature...",
    "players": "I.A.Dowman (-) vs. M.Kopytko (-)",
    "opening": "English (A34), symmetrical, three knights system"
}