{
    "moves": {
        "1. e4": "The opening is a Sicilian Najdorf, so annotations will come later.",
        "1... c5 2. Nf3 d6 3. d4 cxd4 4. Nxd4 Nf6 5. Nc3 a6 6. Be3 Ng4 7. Bg5 h6 8. Bh4 g5 9. Bg3 Bg7 10. Be2 h5": "Black decides to expand on the kingside.",
        "11. Bxg4 Bxg4 12. f3 Bd7 13. Bf2 Nc6 14. O-O e6 15. Nxc6 Bxc6 16. Bd4": "Black has two bishops, so White is attempting to force a trade of minor pieces. But Topalov knew that what was most important here were squares on the d-file. 16...e5 would weaken the d5-square. This is why he played...",
        "16... Be5": "(!) Doubled pawns for Black would dominate the d-file, benficial to him.",
        "17. Qd2 Qf6": "White now didn't choose 18.Rad1 Bxd4+ or 18...Qf4 19.Qxf4 gxf4 since this endgame is weaker.",
        "18. Bxe5 dxe5": "(!) White's rooks can't be opened up any more. Black has all trgets covered, whereas White has weaknesses.",
        "19. a4": "(?) Here, 19.Qd6! Would provoke 19...Rd8 20.Qc5... Meaning Black's king needs to find a safe square AND connect rooks. This would cause temporary disarray for Black.",
        "19... O-O 20. b3 Rfd8 21. Qe3 Qf4": "(!)",
        "22. Qxf4 gxf4": "(!) White can regroup his knight with Nc3-a2-b4. However he hs targets at g2 and f3, which could falter soon with ...f5",
        "23. Rfd1 h4 24. Rxd8+ Rxd8 25. Rd1 Rc8": "(!) Topalov keeps his rook to attack g2 and c2.",
        "26. Rd2 Kf8 27. Nd1 Ke7 28. Nf2 f5": "(!)",
        "29. Kf1 fxe4 30. fxe4 a5": "(!) Short's pawns cannot move.",
        "31. Ke2 Be8": "(!) Black's bishop can join the attack. One variation is 32.c4 Bh5+ 33.Kf1 Rd8 34.Rxd8 Kxd8 35.Nd3 Bd1! If 33.Ke1... Then 33...Rd8 34.Rxd8 Kxd8 35.Nd3 Bg6. ",
        "32. Kd1 Bh5+ 33. Kc1 Rg8 34. Nd3 h3": "The rest is simple",
        "35. gxh3 Rg1+ 36. Kb2 Bf3 37. Nxe5 Bxe4 38. Rf2 Kf6 39. Nc4 Kg5": "The h-pawns are fodder for Black's pieces.",
        "40. h4+": "40...Kxh4?? 41.Rxf4+... +/-",
        "40... Kg4 41. h5 f3 42. h6 Kf4 43. Nd2 Rg6 44. h7 Rh6 45. h8=Q Rxh8": "Topalov wins after a beautiful display of positional prowess."
    },
    "url": "https://gameknot.com/annotation.pl/novgorod-1997?gm=55968",
    "gameName": "Novgorod 1997",
    "players": "Nigel Short  vs. Veselin Topalov ",
    "opening": "Sicilian (B90), Najdorf, Byrne (English) attack"
}