{
    "moves": {
        "1. d4 d5 2. Bf4 a6": "A waste of tempo. This is because my opponent doesn't know yet if I have intention to go for that square. It's not bad, it's premature. Black still has the chance not to play it. This kind of profilactic move has to have a well structured plan behind it to be accettable. It depends on the position, but now nothing justifys it. ",
        "3. Nf3 h6": "This has a meaning: to kick my dsb. Not a great goal, since it can go to g3, but still a goal. ",
        "4. h3": "This is because I'm not in a hurry, and I plan to play g4 when possible (my opponent likely doesn't expect that at this early stage of the game), so I want to retire my dsb on h2. A strong player will model his play around this . ",
        "4... Bf5": "Finally. He mimicks my bishop's plan. It is believed that this bishop's influence on the opponen't field is strong, but it can be managed very well if you know the right plan behind it. ",
        "5. g4": "Black helped me to play g4. ",
        "5... Be4": "True this is one of the moves black has in this position. ",
        "6. Nbd2": "...and this is my way to respond to it. The idea is NOT to play NxB, dxN, and then I won't have a good square for my knight. The idea is to move the R - losing this castling right, that I don't want. ",
        "6... Bh7": "Black retires, giving the g4 loss of tempo a meaning. He allowed g4 in order to have his lsb solidly planted on h7. Like me in a move. ",
        "7. e3": "...except that, not being forced to play it, I can just omit it, and win another tempo for developement. This seemengly passive move is ok. ",
        "7... Nc6": "Black misses the chance to play c5 for several moves, which is not very good for him. But it`s early to say that. Black, essentially, foresee a queenside castling. ",
        "8. c3": "The jump of the black N to b4 must be avoided. Otherwise, the strenght of the lsb would be deadly on c2 or d3. More than a check fork is threatened, I tell by experience. ",
        "8... e6": "Black plays ok. No need to go for g5... seemingly. In fact, blakc must (but only experience can tell it). ",
        "9. h4": "This kind of moves make the opponent think. Mind: all this attack line can be effectively countered by black... he didn't make any mistake, nor is his position particularly weak... but he still has to manage it and defend accurately. ",
        "9... Be7": "Both rooks are currently undefended, so all the trick is that once the h file gets cleared, black can throw his lsb to c2, threatening the WQ. After QxB, RxR guarantees black the exchange and the advantage. So, sensibly, black reinforces g5 in order to avoid white to go there because of this tactic. But this tactics works as long as white falls in it, and I won't. ",
        "10. g5 hxg5 11. Nxg5": "This is the right piece to take with, and not the bishop. My plan is to bring my Q to h5. So, if I have the B there, black can't perform the natural f6 due to Qh5+, with some worries (wherer if justified or not) for the black King. For black, best here is Nf6, to accept NxB in order to win the h4 pawn. White would have to find another way to go on with the attack. ",
        "11... Bxg5 12. Bxg5 Nge7": "Much better that f6, of course. But my Q has her highway. ",
        "13. Qh5": "When playing moves like this, white has to be very aware about a queen trapping or an easy-kicking. If g6 - the natural move - , would Qh6 be safe?",
        "13... O-O": "Black goes out of the pin on the bishop (please note that by not being possible any bishop check, the WQ is safe up there. White transformed a trick into a pin. But this is not the good way, since the g column is half-open in white's favour. ",
        "14. Rg1 g6": "The natural one, but now it has a flaw:",
        "15. Bf6": "g6 is pinned, and the K blocked, and the N pinned, and no piece can easily kick my lsb, and... a lot of problems black is suddenly in. ",
        "15... Qd6": "Unpinning the N. Not bad. ",
        "16. Nf3": "Bringing the other N in. It is not all that dangerous, yet. Ng5 allows gxQ, and no mate in sight. Ne5 will just cause an exchange. ",
        "16... Nf5": "Also good. This N controls h6, adds a defender to g7... ",
        "17. Bd3": "Threatening to exchange that N. Probably not the best, but I have time to play Qg5, so why would I do that now? ",
        "17... Nce7": "The other knight makes useless my BxN plan. I can castle and bring in the other R, but this will be really slow. ",
        "18. Ne5": "Adding pressure to g6. At this poing, both players are well aware that the game will be decided by a sacrifice on g6. All is around how and when. ",
        "18... c5": "Too late, but what else? The BK can't leave without allowing QxB (even if Rf8 is moved to e8, say). ",
        "19. Bxf5": "? exB would leave my dsb threatened, and after it defends with d5, Qe6, and black is not any worse than now. ",
        "19... Nxf5": "...but black followed the script, and left g6 undefended... from a sac!",
        "20. Nxg6": "Correctly, now black sees BxN, RxB+, fxR, Qxg6+ and mate.",
        "20... cxd4": "Black accepts, very correctly, NxRf8, RxR. In return, he will start worring white with that d4 pawn. If white waits too much, black would cause problems. But the end is nearer than he thinks. ",
        "21. Ne7#": "THIS is a kind of checkmate in one that could easily be missed. None of the two checks is mate in itself, but the combination of both. That's all, I hope you enjoyed the annotation a got some useful insight about which are the implications of the moves you and your opponent make during a game. My assessements can be wrong, but the idea is to show less-experienced players some ways of thinking that can be of some use. And, of course, how important is to attack, even breaking the \"holy principles\". :-)"
    },
    "url": "https://gameknot.com/annotation.pl/novices-errors?gm=56865",
    "gameName": "Novice's errors",
    "players": "damalfi  vs. Player1100 ",
    "opening": "Queen's pawn, Mason variation (D00)"
}