{
    "moves": {
        "1. e4": "Pretty standard opening.  You know how it goes.",
        "1... e5 2. Nf3 Nc6 3. Nc3": "This was a little unusual.  I more commonly see either Bc4 (usually leading to the Italian Game, or sometimes the 2 knights defense) or Bb5 (the Ruy Lopez).  Black's most popular responses are Nf6 and Bc5, although crazier responses like f5 might be effective against some.",
        "3... Nf6": "I don't like the positions arising for black after Bc5, so I went with Nf6.",
        "4. d4": "The scotch four knights!  I know I've seen this before somewhere... Morphy used this to destroy Paulsen with the black pieces.  http://www.chessgames.com/perl/chessgame?gid=1259998",
        "4... exd4": "I decide to play a little differently.  My idea is to pin the Nc3, castle kingside, and aim my pieces at his kingside.  I may end up with doubled pawns on the queenside, but that shouldn't be as important as my attack!",
        "5. Nxd4": "As expected.  NxN followed by QxN doesn't look promising for black, as white will control too much space.",
        "5... Bb4": "Pinning the knight, as planned.",
        "6. Nxc6": "Giving me the doubled pawns, and a choice of how to do it.",
        "6... bxc6": "Far superior to dxc6, as that allows white to get the queens off; if white can make it to an endgame, my doubled pawns will prove a weakness!",
        "7. Bd3": "Simple, standard development, plus this protects the e4 pawn, which could have been taken otherwise.  (Note that, for example, 7. Bc4 Nxe4 8. Qe2 Qe7 9. f3 can be met by a knight retreat, while 9. Bd2 can be met with 9. ...Bxc3, leaving black up a pawn.)",
        "7... O-O": "Not allowing any thoughts of a pin down the e-file anyway.",
        "8. O-O": "Likewise, and breaking the pin on the c3 knight.",
        "8... d5": "An aggressive move, gaining space for black, while also offering to undouble his pawns, opening the c8 bishop's route to the kingside, and staking a claim to the center.  All this is book so far.",
        "9. Bg5": "This is an unusual (but not unsound) move; but I've definitely got to do something about this pin.  e5, if played here instead, would be met by Ng4, but now if white plays e5 unimpeded, my knight is in for a world of hurt!",
        "9... h6": "I thought this was the best way to break the pin, although 9. ...Bxc3 10. bxc3 dxe4 would have been another way to do it.",
        "10. Bxf6": "?!  A surprise from white -- I had expected Bh4, provoking further weaknesses in black's kingside.  As it is, I'm happy to get such a good square for my queen, and to win the two bishops so easily!",
        "10... Qxf6": "Natch.",
        "11. Na4": "? This move by white, threatening nothing and moving the knight far away from the center, gives black a clear plan of attack.  Aim the bishops at the kingside, connect the rooks, lift one onto either the 5th or 6th rank, and try for a mate on the kingside.",
        "11... Bd7": "Connecting the rooks and allowing the possibility to double down the e-file or b-file.",
        "12. Qe2": "?! White doesn't realize the danger that's coming.  I thought Qf3 was best here, trying to exchange the queens, where black doesn't have much to attack with but is better heading into an endgame.",
        "12... Rfe8": "Unfortunately, white's last move also put his queen onto the half-open e-file.  White's queen probably isn't too happy about black's move here, either.",
        "13. c3": "I assume this was the point behind 11. Na4, but who does this really help?  White's Na4 now has nowhere to retreat to if black plays c5, and kicking the bishop out of b4 just invites it to harass... white's king!",
        "13... Bd6": "The best square for the bishop.  White must now address the threats of dxe4 and c5.",
        "14. Qc2": "At least this gets the queen out of the way and protects the a4 knight.  White can play dxe4, but there is a better move...",
        "14... Qh4": "!  A very good in-between move; threatening mate on h2 and pretty much forcing white to weaken his kingside by moving a kingside pawn.",
        "15. h3": "I had expected g3, and had even gone so far as to prepare a (not forced) line, 15. g3 Qh5 16. Be2 Qe5 17. Rf-e1 Bh3 18. exd5 Qxd5 19. f3 Bc5  20. Nxc5 Qxc5  21. Kh1 Qf2 22. Rg1 Rxe2, and black wins.\n\nInstead, black has to come up with another line.",
        "15... dxe4": "This is a good way to go, as it forces the Bd3 to move, and allows a rook lift to the kingside.",
        "16. Bc4": "Preventing the rook from using e6, and also pinning the f7 pawn.  This move also has the drawback of allowing e3 to discover an attack on the bishop, which proves an important tactic in some lines.",
        "16... Re5": "If Re6 is out, Re5 will have to do.  Rg5 and Rh5 both look threatening for black.",
        "17. Rae1": "I don't know whether this is the wrong rook or not, but it's definitely the right square, as it prevents the Re5 from moving for the time being.",
        "17... Rae8": "But the response is easy to find.  Let's take stock now; black has two bishops, two rooks, and a queen all actively ready to attack white's king.  White has two rooks boxing the king's escape route, a knight off-side (that at least prevents Bc5), and a queen and bishop a long way from the defense of the white king.  \n\nWhere did he go wrong?  I'm going to blame the faulty plan of white's 10th-13th moves, which allowed black to build up the attack he has now.\n\nNow, it's up to white to do something to try to stop black's attack!",
        "18. Re3": "Probably the best move in the position, as it prevents the e-pawn from advancing, and also prevents black from playing Bxh3, winning.",
        "18... Rg5": "Renewing the threat of Bxh3, as after Rxh3, black plays Qxh3, and white cannot recapture due to the pin on the g2 pawn.",
        "19. Kh1": "The white king runs for his life, but there is nowhere to hide for long!",
        "19... Bf4": "!  This move forces the action, and black had to work out that no matter what white does, there's no defense against the attack.\n\nIf 19. g3, Qxh3 wins; if 19. Rxe4, Rxe4 20. Qxe4 Rxg2! wins (after 21. Qxg2 Bxh3), and if 19. Bxf7 , Kxf7 is just fine for black.",
        "20. Rxe4": "I'm excited now, because 20. Rxe4 Rxe4 21. Qxe4 Rxg2! is so pretty...",
        "20... Rxe4 21. Qd3": "Ah!  And now white realizes that Qxe4 loses, but now he's just down a rook for nothing.\n\nAt this point, I decided that the best way to win was to just get white's pieces off the board...",
        "21... Rxc4": "And this move seals the win, as Qxc4 is met by Bxh3, winning the house, and Qxd7 is met by Rxa4, winning another piece.\n\nWhite resigns (0-1), and it goes to show that doubled pawns are only a weakness if you get to exploit it -- more space and better development are often worth doubled pawns!  Hope you enjoyed it.\n\n -- Ethan"
    },
    "url": "https://gameknot.com/annotation.pl/now-whos-the-dean?gm=11308",
    "gameName": "Now who's the dean?!",
    "players": "yodean (1590) vs. ethansiegel (1741)",
    "opening": "Four knights (C47), Scotch, 4...exd4"
}