{
    "moves": {
        "1. d4": "This was my first ever \"official\" OTB game. There were plenty of signs around my neck telling everbody I was a beginner - I kept forgetting to hit the clock after my moves, would often need to look at my opponents notation because I hadn't recorded the last few moves etc... It maybe wasn't the highest quality game, but I'm sure it has some instructive value it it somewhere. ",
        "1... d5 2. c4 e6": "Nothing unexpected yet. I would have preferred QGA lines, but understand that it is becoming less and less played. ",
        "3. Nc3 Nf6 4. Nf3": "All book so far.",
        "4... Nbd7 5. e3": "Bolstering the d pawn and opening a line for the LSB. 5.Bg5 or 5.Bf4 seem like alternatives to prevent the DSB from being impeded, and may be better. ",
        "5... Be7 6. Be2": "Some time after I played this move I wondered if Bd3 may have been better. I think after this move may have been the first time I remembered to hit the clock!",
        "6... O-O 7. O-O": "At this point the game seems to be fairly balanced. It was about here where I thought I would have preferred White's LSB to be sitting at d3. ",
        "7... b6 8. Qc2": "Looking down a nice diagonal into the kingside, supporting a possible e4 (not ready yet). If that bishop had have been at d3 the e4 would seem better. Enough said about the bishop!",
        "8... Bb7": "A nice diagonal for black. Threatening 9... dxc4 (if 10.Bxd4 then ...Bxf3 11.gxf3 and white's king is not looking very secure). ",
        "9. Ne5": "Avoiding the previously mentioned line. I think the exchange here is fine. ",
        "9... Nxe5 10. dxe5": "Pawns are doubled, but there is a half open d file waiting for a rook to be anchored to it. ",
        "10... Ne4": "I considered exchanging off the other pair of knights here, but thought that Black's position would have an advantage. ",
        "11. Bd3": "I'd be interested to know if stronger players would have considered this move. Looking through the knight at e4 to take the h pawn with check. Black can avoid this, but his position doest look as sound after 12.Nxe4 dxe4 13.Bxe4 Bxe4 14.Qxe4 etc (not to mention the pawn that would be dropped) to be honest, this is the first time in the game where I have actually had a plan other than \"develop your pieces and try not to blunder\". ",
        "11... Nxc3 12. Bxh7+": "As planned",
        "12... Kh8 13. bxc3": "White's pawn structure is looking quite weak with doubled pawns on the e file and an isolated pawn on the c file (the doubled pawn is destined to be squashed in short order), but there is some compensation in the somewhat aggressive position white has.  ",
        "13... g6": "I saw this option at move 11, but didn't think that black would go for it, as it is a clear draw opportunity for white. I thought my opponent would have expected to despatch this \"newbie\", not draw after about 15 minutes! ",
        "14. Bxg6 fxg6 15. Qxg6": "A menacing spot for the Queen next to a very exposed looking King... Black can't play 15...Rg8 because of 16.Qh6#",
        "15... dxc4": "At this point I considered the perpetual check, but I still wanted to play chess - besides I gave myself a good chance of chalking up a win on my first outing. ",
        "16. e4": "Aiming the bishop at the h6 square.",
        "16... Qd3": "I had expected my opponent to play something defensive here. It is too soon for white to play Bh6 though, as ...Rg8 leaves white with an awkward situation - no way to defend e4, a bishop and a rook staring down at g2. ",
        "17. Qh5+": "Manouvering the Queen to g4 to support Rd1",
        "17... Kg7 18. Qg4+ Kh8 19. f3": "The losing move. At the time I decided against 19.Rd1 as I saw that black could exchange queens with ...Qxe4. I think almost any other move would have been better than this one. ",
        "19... Bc5+": "I saw this move coming before I hit the clock. In the space of about one and a half seconds I saw my opponent go from a nervous, head down kind of attitude to something akin to an excited puppy. ",
        "20. Be3": "Forced. If 20. Rf2 then ...Qd1# or if 20.Kh1 ...Qxf1#",
        "20... Bxe3+ 21. Kh1": "Forced again",
        "21... Rad8": "Preventing Rd1 (either one) which would either return the material to white or allow a powerful (probably winning) rook on the 7th rank. This move instead ties both of the white rooks to the back rank. ",
        "22. Qh5+": "Looking to find a draw somewhere, or at least harras my opponent into making a mistake. The perpetual check available earlier isn't an option anymore because of Black's e3 bishop.",
        "22... Kg8 23. Qg6+ Kh8 24. Qh5+ Kg7 25. Qg4+ Kh7 26. Qh3+ Bh6 27. Qxe6": "No checks available here. It seems a pipe dream to promote a pawn, but what else? ",
        "27... Bxe4 28. Qe7+": "Continuing the barrage - my opponent was looking a bit worried at this point I wondered if he might lose his cool and offer me a draw...",
        "28... Kg6 29. Qe6+ Kh7": "Forced back to the 7th. If 29...Kh5 then 30.Qg4# or if 29...Kg5 30.h4+ and it's mate in one. ",
        "30. Qe7+ Bg7 31. Qh4+ Kg8": "A draw seems impossible if I exchange my queen off, but I could see no better chance to draw than to reduce some of the meterial deficit.",
        "32. Qxe4 Qxe4 33. fxe4": "4 passed pawns (ok 3 as soon as black eats one of them) just maybe there is a chance???",
        "33... Rxf1+": "Simplifying, to place more weight on the advantage. ",
        "34. Rxf1 Bxe5 35. h4": "c3 is not defensible, due to the back rank mate. If white has any chance to salvage something here, it must surely be by promoting. ",
        "35... Bxc3 36. g3": "Supporting h4. if g4 then black replies with Rd4, winning at least a pawn. ",
        "36... Be5 37. Kg2": "Defrends g3 and more flexible than Kh2. ",
        "37... c3 38. Rf2": "The final nail in the coffin. ",
        "38... Rd2": "And that is how my first OTB club game panned out. I won't be toppling too many GM's just yet, but it all must start somewhere... Thanks for reading, all comments/feedback welcome. "
    },
    "url": "https://gameknot.com/annotation.pl/nzcf-club-game?gm=39180",
    "gameName": "NZCF Club Game",
    "players": "S. Holdaway (unrated) vs. C. Wang ",
    "opening": "QGD (D37), 4.Nf3"
}