{
    "moves": {
        "1. e4": "Sorry folks, I just couldn't resist the title (my apologies to Tim Blake Nelson, John Turturro, and George Clooney). Here is recent game vs. one of the newest members of my team, adui. Since it was our first contest I had no idea what to expect. Midway through, I pick up a pawn - then foolishly blunder away the small advantage I had. I don't think either side will win any FIDE titles for our play, but the resulting endgame was quite interesting, as the game concluded with a smothered mate (something not commonly seen). Many thanks to my new teammate for the game, and I hope you enjoy:)",
        "1... c5": "Yes, that's right - Mr. Scandanavian is branching out. I've been getting in some good work with the Sicilian as of late, so I deploy it.",
        "2. d4": "A little early methinks, but very playable.",
        "2... cxd4 3. Qxd4 a6": "?! This move was made strictly for it's experimentation value. I've gotten burned a few times recently with the line 3...Nc6 4. Bb5, and I wanted to see if I could diffuse that potential position. Yes, I know it's slow and doesn't develop, but like I said it was an experiment.",
        "4. Bc4": "White jumps on the center with a hit on the weak f7 square, and probably hopes for 4...b5 5. Bd5 Nc6 6. BxN dxN 7. QxQ KxQ and black loses the castling priveledge.",
        "4... Nc6": "Chasing the queen and developing.",
        "5. Qe3": "?! Obviously the queen had to move, but I don't like Qe3 as it hinders the scope of white's dark squared bishop.",
        "5... Nf6": "Catching up in development and intending 0-0 at some point (notice that a future 0-0-0 puts the king on a half open file, and should probably be avoided).",
        "6. Nf3 e6": "IMHO, this move signals black's intent for a very defensive set up.",
        "7. O-O b5": "?! Another somewhat questionable play on my part. Like I said, I was in a defensive frame of mind so I wanted to establish a solid position for my pawns. 7...Be7 was probably better.",
        "8. Be2": "I remember thinking that white has somewhat declined the offer to be the aggressor. I was expecting 8. Bb3.",
        "8... Bb7 9. Nc3 Rc8": "Rook to half open file (the c file ends up being a big area of interest throughout the rest of the game).",
        "10. a4": "?! hmmmm....while white does have a pawn advantage on the queenside, this was probably a little premature as it leads to....",
        "10... b4": "! Fairly obvious, but powerful all the same. White must retreat to d1 or a2, and both of those options are retreating moves to ineffectual squares.",
        "11. Nd1 Be7 12. c3": "!? White pushes back with an aggressive thrust to undermine black's ideas on the queenside.",
        "12... bxc3": "? Bad idea on my part. I thought about 12...a5 but was scared of 13. Bb5. Why? I'm not sure....I kind of lost my way during this portion of the game. I guess I had stubbornly made up my mind to play safe and think only of defense against this new opponent. I have successfully psyched MYSELF out!",
        "13. Nxc3 O-O 14. e5": "! Bingo.......nice pawn push.",
        "14... Ne8": "All of a sudden I realize that my position is looking really weak.",
        "15. Ne4": "?! I liked 15. Rb1 better there.",
        "15... d5": "Time to take my medicine. My cramped position must expand, and I'll just have to deal with the consequences.",
        "16. Nc5": "? An outright blunder. My teammate gives me the very unexpected gift of a free pawn after......",
        "16... Bxc5 17. Qxc5 Nxe5": "Ahhhh, now that's better. Finally a little breathing room.  White can't take my Ne5 because of the discovered attack on his queen.",
        "18. Qb4": "Threatening QxB.",
        "18... Nxf3+": "! I give myself the exclam because I get to trade a knight from an awkward square for a knight from a strong square and also put my opponents bishop on a less than optimal square. ",
        "19. Bxf3 Rc7": "A rook lift to protect the vulnerable bishop on b7.",
        "20. b3": "Giving white another option for his dark squared bishop.",
        "20... Qc8 21. Ba3": "Threatening mate on f8.",
        "21... Nf6": "Practically forced.",
        "22. Qa5": "I remember thinking that my opponent's queen looked horrible on that square. I get the idea of attacking his b pawn........",
        "22... Rc3 23. Bxf8": "YIKES!!!! I totally overlooked the real reason of adui's 22nd move. ARGH!!!!!",
        "23... Kxf8 24. Rfe1": "?! I guess adui felt guilty about that last little skirmish (or did he just miss it?). I get the chance to pick up the b pawn I was so all-fired up to grab.",
        "24... Rxb3 25. Rac1": "Strong - white wrenches the c file from me.",
        "25... Qb8 26. Bd1": "After a period of inactivity, white's light squared bishop gets back in the game with an attack on the Rb3.",
        "26... Rb2": "Rooks on the enemy's 2nd (or 7th) rank are pretty strong. Black starts trying to come up with a plan to attack the vulnerable f2 square.",
        "27. Bf3": "?! Back to f6? I didn't understand that move. I expected 27. Re7 RxR 28. BxR with white having a pretty good position.",
        "27... Qd6": "I really wanted to play Qa7 with a nasty attack on f2, but the threat of a back row mate was looming large.",
        "28. Qc3": "! Doubling up on the c file and hitting my Rb2.",
        "28... Qb6": "As my back row is not so weak anymore, I continue my assault on f2 while protecting my rook.",
        "29. Qa3+ Ke8 30. Be2": "? This bishop has been riding the short bus all game. I totally did not get this move.",
        "30... Ne4": "Since my rook was cut off from f2 by my opponent's last, I go after it another way.",
        "31. a5": "? Evidently, adui missed the threat.",
        "31... Qxf2+ 32. Kh1 Rxe2": "Now threatening mate on g2.",
        "33. Reg1": "Forced.",
        "33... Qf6": "Threatening the smothered mate!",
        "34. Rc7": "My opponent later told me he never saw the smothered mate looming and was intending to threaten my Bb7 - which could be very nasty as it protects c8, and if black didn't have mate in 1 white was in business.",
        "34... Nf2#": "O SMOTHER (where art thou?) A nice looking mate! Many thanks to adui for the game, and thanks for playing along at home:) - Thomas"
    },
    "url": "https://gameknot.com/annotation.pl/o-smother-where-art-thou?gm=7773",
    "gameName": "O SMOTHER (where art thou?)",
    "players": "adui (1241) vs. tag1153 (1412)",
    "opening": "Sicilian (B21), Andreaschek gambit"
}