{
    "moves": {
        "1. e4": "In this game I face off with an opponent with a rating greater than 200 over mine.  Goal is to hang in there.  I like playing black with my odd version of a Sicilian Defense.  ",
        "1... c5 2. Nf3 g6 3. c3 Bg7 4. d4 cxd4 5. cxd4 e6": "This is where I vary from a main line.  I look to place a N at e7; top players make me pay for this.  ",
        "6. Be2 Ne7": "There's the N-K2.  ",
        "7. O-O O-O 8. Be3 d5": "This move, P-Q4, has to be made at some point. ",
        "9. Nbd2 Nbc6 10. Rb1 a6 11. a3 b5 12. b4 Bb7 13. e5": "White locks up the middle with this P move somewhat cramping Black. ",
        "13... Rc8 14. Qb3 Nf5 15. Rfc1 f6 16. Qb2 fxe5 17. dxe5": "I had to do something to the middle; this pawn exchange is a bit helpful.  White kind of has an isolated pawn and I've two linked middle pawns. ",
        "17... Nxe3 18. fxe3 Qb6": "Am confronting White Queen, while giving an eye to the King side.",
        "19. Rc5 h6 20. Kh1 Rf7 21. Rbc1": "Doubled rooks - danger.  ",
        "21... Qd8 22. e4 d4 23. Qb3": "Shooting at a weak pawn, but does White really want to make an early invasion?",
        "23... Qe7 24. Qc2": "Loading pressure on the N at c6. ",
        "24... Qd7": "I'm just sort of holding on. ",
        "25. Nh4": "This N move cut off a good counter I found.  The Black bishop has a great shot and trap at the rook on c5 - but this takes away the f8.  I found it too late. ",
        "25... g5 26. Ng6": "My neat trap is gone. ",
        "26... Na7 27. Bh5 Rxc5 28. Qxc5 Nc8": "Almost forced, attemping to stop the surprise attack on my rook. ",
        "29. Nf3 Ne7 30. Nxd4 Nxg6 31. Bxg6": "I'm trying to just relieve pressure.",
        "31... Rf8": "White has me treading water trying to stay in the game.  But his aggressiveness causes a slight oversight, losing a piece. ",
        "32. Qd6 Qxd6 33. exd6 Bxd4": "White left the N hanging getting me back in the game.  but I have to stop the advance pawn. ",
        "34. h3 Be5": "There's the first shot at the advanced pawn...",
        "35. Rd1": "a parry...",
        "35... Rd8": "There's the second shot at the adv pawn... ",
        "36. d7": "A dodge...",
        "36... Kf8": "bringing up the reserves...",
        "37. Be8": "a second parry... ",
        "37... Bc6": "Back to 'two shots'...",
        "38. Kg1 Ke7": "There's the third shot on the advanced pawn; Black has to give it up.  And that Bishop is a bit far from home. ",
        "39. Kf2 Bxd7 40. Bh5": "The pawn falls, and the bishop retreats. ",
        "40... Be8 41. Rxd8 Kxd8": "The rooks come off - this is okay for White, it enhances my piece advantage. ",
        "42. Be2 Bc6 43. Ke3 Kd7 44. g4 Bb2 45. a4 Kd6 46. Bd3": "At this point I am hoping just to make my advantage count, make Black swap off his bishop and thence resign. ",
        "46... Ke5 47. axb5 Bxb5": "White sees the nuetralization of the bishop and sees The End. "
    },
    "url": "https://gameknot.com/annotation.pl/oakland-tourney-ten?gm=33025",
    "gameName": "Oakland Tourney 'Ten",
    "players": "hoochicoochiman (1658) vs. quanah4 (1443)",
    "opening": "Sicilian (B27), Hungarian variation"
}