{
    "moves": {
        "1. e4 f6": "1. ......... f6 - an unusual opening - this is called Barnes' Defense.  This is very similar to Damiano's Defense, but this opening is not as easy to exploit as it first seems.",
        "2. d4 g6 3. c4 Nh6 4. Nc3 Nf7 5. f4": "5. f4 - I spent the last few moves establishing a huge pawn centre, similar to the 4 pawns attack against the Robatsch or Pirc Defense and developing my knight to c3, supporting the e pawn.  I will play my knight to f3, while black plays his bishop to g7 and then castles which is perfectly in line with the Pirc or Robatsch.  The Pirc Defense btw is d6 and the Robatsch Defense is g6 which is a very hypermodern way for black to defend against white's first move, e5.",
        "5... Bg7 6. Nf3 O-O 7. Bd3 c6 8. Bd2 d6 9. Qc2 e6 10. O-O": "10. 0-0 - My development is now complete and white has his queenside pieces on the home squares - how can I exploit this.  Black develops his knight to a6 to prevent blocking in his bishop on c8 by moving to d7.  I then make one prophylactic pawn move to a3 before committing myself to a plan which at first does not seem to work, but this time I do not give up.",
        "10... Na6 11. a3 Nc7 12. f5": "12. f5!? - this is the moment when I commit myself to the attack.  I anticipated exchanging off both black's e and g pawns and opening him up.  But black has other ideas.",
        "12... exf5 13. exf5 g5": "13. ........ g5 - it seems my plan has come to a dead end with this move.  I felt so despondent that it took me another two days to make a move - thankfully I had a 15 day time control to play with!  I finally decided to play b4 - a move which would release Glenda from protecting it and should the Wicked Witch of the West land a check on b6 then I would not lose the b pawn.  This move also expands on the queenside.",
        "14. b4 Bd7": "14. ........... Bd7 - develops his queenside at last but black is rather cramped.  I now decide to move my queen knight away from the queenside and move it towards the kingside where I will then make a somewhat risky move.",
        "15. Ne2 d5 16. c5": "16. c5 - I decided not to take on d5 because the pawn on c5 now exerts a cramping influence on black's game.  The Wicked Witch of the West cannot get to b6.  She moves to c8 to try and pile up on the f pawn but I am not fazed by this, the pawn is adquately protected.  I continue with my plan.",
        "16... Qc8 17. Ng3 Nh6 18. h4": "18. h4!? - this is the risky move, at the risk of opening up my own castled position I try and open up my opponent's.  Because my opponent's pieces are so hemmed in I think the risk is well worth taking. ",
        "18... Nf7 19. Rae1": "19.  I develop my final piece, the queen rook to e1, this controls the e file and might act as a cut off for the black king should my mating attack really get going.  ",
        "19... Re8 20. hxg5 fxg5 21. Nh5": "21. Nh5 - now the mating attack really gets going.  Nxg7 will really expose the black king.  But my opponent plays Bh6?? allowing an exchange-winning knight fork on f6.",
        "21... Bh6 22. Nf6+ Kg7 23. Nxe8+ Nxe8 24. Ne5": "24. Ne5 - now that I am ahead in material it is to my advantage to clear some wood from the board.  Black decides to take the knight and I have a decision to make on what unit to retake.",
        "24... Nxe5 25. dxe5": "25. dxe5 - pawn, I choose you!  Just look at those passers!  Black is really going to be hemmed in.  Strange that for once it is my opponent that is passive.  Usually it is me that ends up in a bad position in the middlegame and has to fight it out.  This is most refreshing!",
        "25... Nc7 26. e6 Nxe6 27. fxe6 Bxe6": "27. ............ Bxe6 - saves his bishop after another series of exchange but allows mate in three.",
        "28. Bc3+": "28. Bc3  - I set up d4, Bxd4 , Kg8, Bxh7# or simply Kg8, Bxh7# as conditional moves.  Black chooses the latter and mate is delivered on h7 with the bishop.  Usually I deliver mate with either the queen or the castle so a bishop mate is pretty good.",
        "28... Kg8 29. Bxh7#": ""
    },
    "url": "https://gameknot.com/annotation.pl/old-matey-strikes-part-1?gm=17072",
    "gameName": "Old Matey Strikes - Part 1",
    "players": "jstevens1 (1679) vs. NN (1470)",
    "opening": "Fried fox defence (B00)"
}