{
    "moves": {
        "1. e4": "This is a very crazy game and one I've learned quite a bit from looking at.  Each side seem to be on a knifes edge toward the middle and I'm still not sure black didn't have something brilliant though I haven't found anything.  Lets start with the usual e4.",
        "1... c5 2. Nf3 d6 3. d4 cxd4 4. Nxd4 Nf6 5. Nc3 a6": "The Najdorf Sicilian an opening I've seen many times in my chess career seeing as I play the open Sicilian quite a bit.  Here I play a move that I'm never quite sure is sound, but looks playable enough.",
        "6. f4": "black still has the option of e5 seeing as neither black nor white wants to exchange on e5 right away.",
        "6... e5 7. Nf3": "The point of the early f5 being I want to strike in the center and put pressure on the e5 point black will tend to try to undermine the e4 point, and control the d5 square.",
        "7... Nbd7 8. Bc4 Be7 9. Nd5": "?! not sure I like this move so much any more looks to lose a pawn on e4 but white may be able to win it back.",
        "9... Nxe4 10. Qe2": "Threating the knight.  Black has a few options here the best I feel is to play Ndf6 then an exchange would occur Nxf6 Nxf6 fxe5 dxe5 Nxe5 O-O O-O Black would seem to have initiative and Bf6 would take control of the dark square diagonal.",
        "10... Nef6 11. fxe5 dxe5 12. Nxe5": "The position I saw a few moves ago white has a very strong position with one big flaw his king is rather airy.  ",
        "12... O-O 13. O-O Bc5+": "Planing to try to win the knight with Re8 though I have plans for that.",
        "14. Kh1 Re8": "? this is a mistake looks like a perfectly good move though doesn't it.",
        "15. Nxf6+": "!",
        "15... gxf6": "Nxf6 results in a similar position, though possibly slightly better after Bxf7+ Kf8 Bxe8 Qxe8 and white must deal with the pin on the white knight. ",
        "16. Bxf7+ Kh8": "Kf8  Bh6+ Ke7 Bxe8 and white is not bad off. Kg7 Qg4+ Kh8 Bh6 leads to a good game for white.",
        "17. Ng6+": "The key move allowing white to complete the idea.",
        "17... hxg6 18. Qxe8+": "Gaining the exchange.  Also possible was Bxe8 but I figure why not trade down since I have the chance.",
        "18... Qxe8 19. Bxe8 Kg7 20. Bd2": "?? traps the bishop on e8 better is Bxd7.",
        "20... Ne5 21. Bc3 Bf5": "? Black allows white to give back the exchange leaving white okay positionally.",
        "22. Rxf5 gxf5 23. Bh5": "Still up a pawn.",
        "23... Ng4": "The bishop must be traded for Rh8 would not be very comfortable for white.",
        "24. Bxg4 fxg4 25. Re1": "? this positional error could have ended white for good black has the very strong g3!! and forces h3 for hxg3 Rh8# and h3 black finishes up with Rd8 and now the rook is locked down as well.",
        "25... Rd8 26. g3": "Every so happy to get the right move out.  White had nothing to fear from g3 Re8 Re1.",
        "26... Rh8 27. Kg2 Kg6 28. Re6": "gaining an attacking position this allows white to free up his king from the defense of the h2 pawn.",
        "28... Rf8 29. h3 Kf5": "a move I didn't see though forcing the white rook back.",
        "30. Re2 gxh3+ 31. Kxh3 Bd6": "Attacking the g3 pawn but opens up the white rook to keep the black rook in to passivity.",
        "32. Rf2+ Ke6 33. g4": "gets the pawn out of the bishops scope.",
        "33... Rh8+ 34. Kg2 Be5": "not sure this is best for black seeing as all trades would seem to favor white.",
        "35. Bxe5 fxe5 36. Re2": "restraining the pawn and the black king for the moment.",
        "36... Re8 37. c4": "keeps the black king out of the position I plan to play b3 and move my king to the e4 square trying to gain some kind of initiative.",
        "37... b5": "? this positional error allows with to use his rook to defend every pawn at once with little worry.  cxb5 axb5 a3 and the white rook can come to b4 keeping the rains on black.  Not to mention it trades down pawns.",
        "38. cxb5 axb5 39. a3 Ra8 40. Kf3": "moving the king closer to e5 pawn.",
        "40... Ra4": "? white gains a tempo with Re4.",
        "41. Re4 Kd5": "final trades black cannot win defend both weaknesses.",
        "42. Rxa4 bxa4 43. Ke3": "I play this move to force black to decide on Kc4 or Ke6 both are losing.",
        "43... Ke6 44. Ke4": "Black Resigns."
    },
    "url": "https://gameknot.com/annotation.pl/on-edge?gm=36756",
    "gameName": "On edge.",
    "players": "yoshark (1534) vs. ryckman (1590)",
    "opening": "Sicilian (B93), Najdorf, 6.f4"
}