{
    "moves": {
        "1. Nf3": "Reti pening, ",
        "1... d5 2. g3 Bf5 3. Bg2 e6 4. d3 c5 5. Nc3 Qc7 6. e4 dxe4 7. dxe4 Bg4 8. Bf4 e5 9. Nxe5": "vendi la dama! I sold my queen!",
        "9... Bxd1 10. Ng6": "ya nervioso! caballo g6 para asegurar torre! pero el constante ataque de las negras me llevo a la defensa total. nervous knight to g6 in order to get rock on h8, but black's attack put me on guard board!.",
        "10... Bd6 11. Nd5 Qa5+": "CHECK !",
        "12. Bd2": "defiendo y ataco! ",
        "12... Qb5 13. Bf1": "ataco! pero b2 es indefenso! b2 is defenseless",
        "13... Qxb2": "Black's Queen takes b2",
        "14. Rxd1": "Rock takes d1, respiro! pero no detiene el ataque! Rock takes d1 dosen't stop the black's attack.",
        "14... Qxc2 15. Nxh8": "I take H8, in order to raise my moral.",
        "15... Qxe4+": "CHECK",
        "16. Ne3 Qxh1": "obviously I most resign! but I thought that= because he was very concentrated in his attack some defensive point won't be attended ! which I'll take advantage of it!",
        "17. Bc3": "even I'm practically death I'm still making move! but those moves are not in vain, those move are making my way to checkmate him! Bishop to C3 is Open D line for my Rock and threaten G7.",
        "17... f6": "Black F6 offensively. I could take D6, but",
        "18. Nf5": "I chose Knight F6 to threaten D6 and G7! but",
        "18... Qe4+": "CHECK, then Knight E3 ",
        "19. Ne3 Be5": "Here the D Line is open! now I need my F1 Bishop! to check!",
        "20. Bd3": "threaten his Queen will give me the poticion I wanted which is C4, to check and mate with Rock, but Black first have to takes C3 and check me! ",
        "20... Bxc3+": "There you go! E2 ",
        "21. Ke2 Qa4": "Now the expected C4.",
        "22. Bc4": "defending A2 and ready to make my move!! and Black lose the Game by moving Knight to E7.",
        "22... Ne7": "Ofcourse other player maybe play diferente! Knight to d7 or Alfil to D4, but the Speed of the game and maybe the considerable Victory for Black obstruct him for making a better move! So Knight to E7, My Game!!",
        "23. Bf7+": "Check > King F8",
        "23... Kf8": "as I say D line is open, Rock to D8 Check!",
        "24. Rd8+": "Now the ( Queen ) one who has been cleaning my table have to come and give oneself up!",
        "24... Qe8": "Rock E8 Checkmate",
        "25. Rxe8#": "CHECKMATE!.. of course many mistakes, (was my second year in chess) but the goal in Chess is to Win and if is possible on checkmate! this game took place in instantchess.com where I spend sometime, playing various instructive and educative game! place where I learnt a lot! You can see it in Youtube http://www.youtube.com/watch?v=Zt2zmuYpMXk Thanks for watching."
    },
    "url": "https://gameknot.com/annotation.pl/on-instantchess-com-club?gm=26416",
    "gameName": "on instantchess.com Club",
    "players": "derlis (1623) vs. Alexandr Tretyakov (1554)",
    "opening": "Reti (A07), King's Indian attack (Barcza system)"
}