{
    "moves": {
        "1. e4 c5 2. f4 d6 3. Nf3 Nc6 4. d3 Nf6 5. Be3 g6 6. c3 Bg7 7. Nbd2 b5 8. Be2 O-O 9. Nf1 Rb8 10. h3 Qc7 11. g4 b4": "Nu gaat de partij op scherp! Met name zwart heeft al flink wat bedenktijd verbruikt, bijna 3 kwartier!\n",
        "12. Rc1 bxc3 13. bxc3 Qa5 14. Rc2 Be6": "Blijft druk op de kwetsbare randpion houden.\n",
        "15. Qd2 Rb1+ 16. Kf2 Ra1": "Te vroeg? Waarschijnlijk is eerst Tfb8 beter. De pion op a2 is toch voor wit niet meer te houden en kan ook later ingerekend worden.",
        "17. Ng3 Rxa2 18. d4 cxd4 19. cxd4 Qxd2 20. Rxd2 Rxd2 21. Nxd2 d5": "d5 ?? Op de een of andere manier moet zwart de vork op d5 pareren. deze zet is echter zeker niet goed.De vraag is ook: is de afruil van de vorige zetten wel zo goed voor zwart. Het lijkt voor de hand te liggen gezien de pion voorsprong.  Maar de alternatieven voor d5 , bv Ld7 of Lc8 verliest zwart de pion op a7 na het witte d5 en deze leveren ook zeker geen gewonnen stelling op. Herman wikkeld deze stelling echter heel mooi af.\n",
        "22. e5 Ne8": "Met Pd7 zet ik mijn eigen loper op e6 klem.\n",
        "23. f5 Bc8": "Lc8 ? Ld7 of eerst gf5 zijn waarschijnlijk beter, e6 is voor wit nl niet mogelijk.\n",
        "24. Rc1 Bb7 25. Nb3 Nc7 26. Na5 Nxa5 27. Rxc7 gxf5 28. Nxf5 e6 29. Nd6 f6": "f6 ??! een kamikazezet die minimaal een stuk kost, maar wit moet wel oppassen. Het alternatief is Lc6 of a8 met verlies van pion a7.\n",
        "30. Nxb7 fxe5+ 31. Kg2 exd4": "exd4? Dit is fout, achteraf. Eerst had Pxb7 gemoeten om het stuk terug te pakken. Na Txb7 volgen allerlei andere verwikkelingen, maar nu verlies zwart wel erg veel materiaal. De toren en de 2 pionnen kunnen niet tegen het loperpaar en het paard op.\n",
        "32. Rxg7+ Kxg7 33. Bxd4+ Kf7 34. Nxa5 Ra8 35. Ba6 Ke7 36. Bb7 Rg8 37. Bxa7 Kd6 38. Be3 e5 39. Nb3 e4 40. Nd4 Ke5 41. Kg3 Rf8 42. Nf5 Rf7": "zwart geeft op, de toren gaat verloren 1-0.\ncommentaar Jan Brinkman.\n"
    },
    "url": "https://gameknot.com/annotation.pl/onderlinge-comp-gesp-13-12-2013-ronde-12?gm=53057",
    "gameName": "onderlinge comp. gesp 13-12-2013 ronde 12",
    "players": "Herman Beks  vs. Jan Brinkman ",
    "opening": "Sicilian (B21), Grand Prix attack"
}