{
    "moves": {
        "1. e4": "I had the white pieces and I started with e4,",
        "1... c5": "c5; Sicilian defense,",
        "2. Nc3": "knight to c3; closed Sicilian,",
        "2... Nc6": "knight to c6,",
        "3. f4": "And f4; signifying the grand prix attack.",
        "3... g6": "g6; Sicilian dragon,",
        "4. Nf3": "knight to f3,",
        "4... Bg7": "bisshop to g7,",
        "5. Bb5": "bisshop to b5; white is ready to castle king's side,",
        "5... Nd4": "knight to d4; attacking the bishop,",
        "6. a4": "a4; defending the bishop,",
        "6... Nxb5": "knight takes bishop,",
        "7. axb5": "and pawn takes bishop; opening the a-file for rook.",
        "7... e6": "e6; preparing d5,",
        "8. O-O": "white castled king's side,",
        "8... b6": "b6; to devellope the bishop,",
        "9. d4": "d4; opening the line for the bishop, more popular move in the grand prix attack is f5, sacrificing the pawn,",
        "9... cxd4": "pawn takes pawn,",
        "10. Nxd4": "knight takes pawn, and now this looks more like a open Sicilian.",
        "10... Bb7": "Bishop to b7; devellopement with tempo on the e4 pawn,",
        "11. e5": "e5; preventing knight to f6 and blocking the view of the dark squared bishop,",
        "11... Ne7": "knight to e7; black is ready to castle king's side too,",
        "12. Qe2": "queen to e2,",
        "12... d6": "d6; opening files, but the king is still in the centre, perhaps castling was better.",
        "13. Rd1": "Rook to d1; patiently waiting for the d-file to open,",
        "13... d5": "d5; smothering the centre and blocking the sight of his light squared bishop, weak move, note how both black bishops are now develloped on the long diagonals, but still standing passively.",
        "14. Be3": "Bishop to e3; connecting the rooks and starting to manouvre the bishop over to the king's side,",
        "14... Qc7": "queen to c7,",
        "15. Bf2": "bishop to f2,",
        "15... O-O": "black castles king's sode aswel,",
        "16. Bh4": "bishop to h4; the dark squared bishop is now on a very active diagonal,",
        "16... Nf5": "knight to f5; attacking the bishop,",
        "17. Nxf5": "knight takes knight,",
        "17... gxf5": "pawn takes knight,",
        "18. Ra4": "rook to a4; preparing to double the rooks on the a-file,",
        "18... Rfe8": "rook to e8,",
        "19. Rda1": "rook from d to a1; the rooks are aiming at a7.",
        "19... Bc8": "Bishop back to c8; discovered defense on a7,",
        "20. Bf6": "bishop to f6; removing an important defender of the king,",
        "20... Bxf6": "bishop takes bishop,",
        "21. exf6": "pawn takes bishop; taking control of g7,",
        "21... Kh8": "king to h8; allowing rook to g8, occupying the open file,",
        "22. Nxd5": "knight takes d5 pawn; abusing the pin and attacking the queen,",
        "22... Qc5+": "queen to c5; check, forking knight and pawn",
        "23. Ne3": "knight to e3; eying the f5 pawn, abusing the same pin,",
        "23... Bd7": "bishop to d7; unpinnimg the e6 pawn, attacking the b5 pawn,",
        "24. Ra4xa7": "rook takes a7 pawn,",
        "24... Rxa7": "rook takes rook,",
        "25. Rxa7": "rook takes rook; attacking the bishop.",
        "25... Bxb5": "bishop takes the b5 pawn; attacking the queen,",
        "26. Qd2": "queen to d2,",
        "26... Rf8": "rook to f8; defending the f7 pawn,",
        "27. b4": "b5; attacking the queen, unpinning the knight,",
        "27... Qc6": "queen to c6, and in this position white made a move, and four moves later black resigned, can you see the winning move for white in this position?",
        "28. c4": "Pawn to c4; sacrificing the pawn,",
        "28... Bxc4": "bishop takes pawn; what else?",
        "29. Rxf7": "And now rook takes pawn; threatening rook takes rook, checkmate, but black can not capture the rook, because of the seemingly innocent pawn sacrifice the deflected the bishop from the diagonal with the queen. If now rook takes rook, then queen to d8 and it will soon be mate.",
        "29... Rg8": "Rook to g8; queen and rook are now aiming at g2 pawn, white must be careful.",
        "30. Qd1": "Queen to d1; preparing a mating attack, but black suspects nothing...",
        "30... e5": "pawn to e5; discovered attack on the rook and threatening pawn takes f4, kicking the only defender of the g2 pawn. Is white lost now?... By far not; in this position white made a move, and black resigned! Can you spot the 'killer move' that white made?",
        "31. Rxh7+": "Rook takes h7 pawn; check! And black resigned due to this continuation:",
        "31... Kxh7": "King takes rook; what else?",
        "32. Qh5#": "Queen to h5; checkmate! What do you think about this game? Please feel free to leave a comment and goodbye for now."
    },
    "url": "https://gameknot.com/annotation.pl/one-step-ahead?gm=49568",
    "gameName": "One step ahead",
    "players": "davydavidsson (1700) vs. sixty-four (1738)",
    "opening": "Sicilian (B23), Grand Prix attack, Schofman variation"
}