{
    "moves": {
        "1. e4": "Hi everyone!\n\nAnd now is the second of the two successful mating attacks.  Funnily enough, Joe did not make any obvious errors in this game such as leaving pieces en prise.  He, did, however, leave himself on for a decisive bishop for pawn sac from Fou Lenoir which created a denouement and a denuding!  This led to resignation on the grounds of unavoidable mate. So, how did this happen?  Well, let's start with a Sicilian Naijdorf/Byrne Attack!",
        "1... c5 2. Nf3 d6 3. d4 cxd4 4. Nxd4": "4. Nxd4 - all standard Sicilian moves.",
        "4... Nf6 5. f3 Nc6 6. Nc3 a6": "6. ..... a6 - this move characterises the Naijdorf.  A credible alternative to this move is g6 which leads to the Sicilian Dragon.  However, I am quite OK with the Naijdorf and I choose the db option which steers me into the Naijdorf/Byrne Attack.",
        "7. Be3 Bd7 8. g4": "8. g4 - the first pawn push towards my kingside attack.  Is Joe gonna go kingside?  We shall see.",
        "8... e5 9. Nb3 Be7": "9. ..... Be7 - perfectly plausible and natural developing moves.",
        "10. Qd2 O-O 11. h4": "11. h4 - so he does go kingside.  Time for a Freddy style assault on his pos then!",
        "11... Qc7 12. h5 Kh8 13. g5": "13. g5 - the pawn storm gathers pace and Joe's f6 knight is en prise.  I think Joe ought to have played b5 on the previous turn.  However, I have not yet committed Henry to the queenside yet, so I thought it would be sensible to get my attack rolling first before I do put Henry there so if Joe does start up something there I will now be ahead of the game.",
        "13... Ne8 14. O-O-O f6 15. g6 h6": "15. ..... h6 - Joe dare not play PxP due to PxP disc. ch.  Joe defends by moving his h pawn up but now I have a sacrifice planned which will lead to #3 if accepted.",
        "16. Bxh6 Kg8": "16. ..... Kg8 - aha - so Joe sees the threatened mate!  Well done, Joe!  Sadly for him, my attack is gonna be just that little bit too strong.",
        "17. Bc4+ Kh8 18. Be3": "18. Be3 - preparing h6.",
        "18... f5 19. h6": "19. h6 - which I now play.",
        "19... gxh6 20. Bxh6": "20. Bxh6.  Here Joe resigns on the grounds of Unavoidable Mate.  A deadly discovered check, Bxf8+ is threatened next move.  Joe has no good answers to it and he acknowledged this fact in his resignation note.  I just hope I can post a few more mating attacks on this board before my rating finally drops below 1900.  Kind regards - Joanne"
    },
    "url": "https://gameknot.com/annotation.pl/one-successful-mating-attack-part-2?gm=49911",
    "gameName": "One Successful Mating Attack Part 2",
    "players": "jstevens1 (1915) vs. jkarp (1148)",
    "opening": "Sicilian (B54), Prins (Moscow) variation"
}