{
    "moves": {
        "1. e4": "This was an online fast game I played a couple days ago. I have the Black pieces",
        "1... Nf6": "I don't like playing sicilian in short games because I tend to think a lot. Short timed games probably aren't good for my chess.\r\nAlekhine defense entices White's pawns to move forward so they will become attackable. ",
        "2. Nc3": "White decides not to overextend his position more and develop a piece instead",
        "2... d5": "I can open up the centre for easy equality.\r\nCould someone give their opinion on if they think this position is equal? Now looking I think maybe I was slightly better, but surely this is still book.",
        "3. exd5": "If 3.e5, then 3...Nfd7 is fine for me because 4.d4 c5! turns into a French-type position but where I haven't played the blocking e6 move. If 5.dxc5 then I can go into French with 5...e6 since I will win back a pawn and exchanging a central pawn for flank one usually isn't good.",
        "3... Nxd5": "Baker likes to play Bg4 here but I don't study his crazy gambit openings",
        "4. Nge2": "A passive move by White. Taking the knight was probably his best option. Or Ne4 is interesting",
        "4... Nc6": "Since White blocked his diagonal, I need not fear Bb5, and also if Nxd5 Qxd5 Nc3 Qe5  and I shouldn't have any problems with development I can fianchetto KB",
        "5. g3": "This move weakens the light squares, and the previous knight move also weakened the light squares...........so.............",
        "5... Bg4": "I annoyingly place my bishop here threatening to ruin White's kingside castling chances and pinning the knight",
        "6. Bg2": "Best move",
        "6... Nd4": "This was my tricky move. All my tactics are revolved around the weak light squares. Both my knights are invinsible. I also have a direct threat of Nxc3 dxc3 Bxe2.",
        "7. Bxd5": "White takes my invinsible knight, which is a mistake, as his light squares are incredibly weak.",
        "7... Qxd5": "I love taking advantage of weak squares. Nxd5 results in Nf3  Kf1 Bh3#\r\nAlways consider which squares you are weakening when you make pawn moves. White has advanced the g and e-pawns, making f3 especially weak.",
        "8. O-O": "I was hoping White would fall for my mating trick, but I knew I still had an advantage due to my incredible grip on the light squares..... maybe even a a forced mate. White's only ways to get out of mate were d3 or f3, but I still win material.",
        "8... Nf3+": "The only check to keep the initiative",
        "9. Kh1": "If Kg2 then Nh4   Kg1 Qg2#.            ",
        "9... Ng5+": "White realizes castling into his weak squares was a terrible idea. White may have thought he was safe since any check would leave my queen hanging, but he doesn't have time to take my queen because I have Bf3  Kg1 Nh3# exploiting the weaknesses on h3, g2, and f3.",
        "10. f3": "If Kg1 then Nh3#, so White tries to hang on as long as possible, but it's clear I have won.",
        "10... Bxf3+": "Now White is mated because Kg1 Nh3#, and White's continuation also got him mated",
        "11. Rxf3 Qxf3+ 12. Kg1 Nh3#": "Because of the simple g-pawn advance, I have posts on h3 and f3 for my pieces to attack White. I only advanced one pawn, and it didn't create any major weaknesses."
    },
    "url": "https://gameknot.com/annotation.pl/online-g-10-tournament?gm=7053",
    "gameName": "Online G/10 Tournament",
    "players": "fretamoza (1623) vs. byakuugan3 (1802)",
    "opening": "Alekhine's defence (B02), Scandinavian variation"
}