{
    "moves": {
        "1. e4": "I was White in this game in an online tournament. I carefully maneuvered an attack against Black's frozen position, after sacrificing a piece.",
        "1... e5": "1...c5 is the most common move against e4, because it leads to complicated imbalanced play, while 1...e5 simply matches me in the centre, while I have the tempo.",
        "2. f4": "I play King's Gambit a lot in short time control games. Although I never play it in longer games or correspondence games since the opening is considered unsound, meaning Black should be able to recover from his underdeveloped position, and hold onto his extra pawn.",
        "2... exf4": "Black chooses to accept the pawn. If he doesn't want it, he can play Bc5.",
        "3. Nf3": "3.Bc4 was the sharpest move, but to play it, you have to know the Qh4  Kf1 variation, and I also want to preserve the option of developing my bishop to c4 or d3. Knights before Bishops.",
        "3... Nc6": "I consider this a terrible move. MUCH better moves are Nf6, g5, Be7, or even simply d6.",
        "4. d4": "Now I have more compensation for the pawn than I should have, since Nc6 was a pointless move.",
        "4... Nf6": "This position is totally winning for Black since he's up a pawn, but it's hard for Black to win accurately since this was a fast timed game, and it's easier for me to find good moves than it is for Black.",
        "5. Nc3": "I considered d5, but it leads to an incredibly boring position. I want to defend my central pawns where they control much of the centre.",
        "5... Bb4": "This isn't much of a threat, since I can simply defend while developing a piece. Pins are usually stronger on g4 and g5, than they are on b4 and b5.",
        "6. Bd3 O-O": "Nh5 would've held the pawn effectively, but if Black doesn't make accurate moves, he may get crushed, especially since this is a fast paced game. Giving me back the pawn immediately is safer, but leaves me with a lead in development.",
        "7. Bxf4 Bxc3+": "Black is strengthening my pawn structure by letting me pull a flank pawn toward the centre.",
        "8. bxc3 d6": "Although my position seems a lot superior, Black's position seems solid, so it may take a sacrifice to kill Black's position.",
        "9. Ng5": "Bg5 is probably accurate here, but I made this odd looking move because I intend to sacrifice.",
        "9... h6 10. O-O": "I offered Black my knight since my knight isn't very important, and Black's defensive h-pawn is.",
        "10... hxg5": "Accepting the sacrifice I think is bad.",
        "11. Bxg5": "For compensation for the piece, I have frozen Black's position. All my pieces can join in the attack against Black, while Black's position can hardly breathe.",
        "11... Nb8": "Black actually played Re8 in this position, but I don't want to redo my entire annotation just because of one mistake in analysis. Black played Re8 before Nb8. Black's knight does nothing on c6, so he wants to redevelop it to d7 to defend his helpless pinned knight.",
        "12. Qe1": "Threatening e5.",
        "12... Re8": "This stopped e5 for now (on move 11), but I don't want to complicate the game playing e5",
        "13. Qh4": "Playing e5 only complicates the game. I am much more comfortable placing my pieces in strong attacking positions, while Black's position is still frozen.",
        "13... Nbd7": "All Black can do is defend.",
        "14. Rf3": "Since Nbd7 blocks Black's bishop, I can threaten to play Rh3!! totally crushing.",
        "14... Nf8": "This stops the crushing Rh3, while bringing another defender to Black's king.",
        "15. Bxf6": "I weaken Black's kingside pawn structure, further exposing Black's king to attack.",
        "15... gxf6 16. Raf1": "I do not want to waste a move taking a free pawn, when I'm still down a knight.\nBlack can try to complicate things with f5, but I have Rg3  Ng6 QxQ RxQ exf5 totally winning for White.",
        "16... Ng6": "Black wants me to take on f6, so that he can trade queens and end my attack.",
        "17. Qh6": "Now Black's king cannot escape the kingside, and I must carefully maneuver to finish off Black, without screwing up my attack.",
        "17... Re7": "This move predefends f7 against moves like Rxf6, while also threatening to play Qf8, which ends my attack.",
        "18. Rf3xf6": "Now if Qf8?? I have Rxg6!!",
        "18... c5": "Black is desperate for counterplay.",
        "19. e5": "If Black takes e5 or d4, then I have Bxg6!",
        "19... Nf8": "Black has defended all my tactical threats here, but I have one crushing move.",
        "20. Rf1f3": "This threatens Rg3  in which Black will have to play Ng6, still allowing Bxg6.\nAlthough I could take on d6, it would only stall my attack, and I don't need to worry about free pawns, since my goal is to mate Black's king. Notice how all my pieces are well coordinated in attacking Black, while Black's pieces are undeveloped, or struggling to defend.",
        "20... Bg4": "I think this is the only move Black has.",
        "21. Rg3": "Now I'm totally winning, since Black cannot properly block the g-file, and his king still cannot escape. All the result of my sacrifice which froze Black's position.",
        "21... Qd7": "I almost played h3 in this position, when I realized I had a much quicker way to win.",
        "22. e6": "This pawn push cuts off the queen's diagonal to the bishop, so Black will lose a lot of material or get mated.",
        "22... fxe6": "Black clears the 7th rank to defend with Rg7, since 22...Rxe6 leads to 23.Rxg4  Ng6 24.Bxg6 and Black will get mated, like if 24...Rxf6 then 25.Bh7   Kh8  26.Bg8  Qh7  27.Qxh7#\nOr if 24...fxg6 then 25.Rxg6  Qg7 26.Qxg7#",
        "23. Rxg4+ Rg7 24. Rxf8+": "Now Black can resign because of this last finishing tactic.\nIf Kxf8, then Qh8  is crushing with all sorts of tactics.",
        "24... Rxf8": "Black takes back with the rook, but I still have a tactically crushing move.",
        "25. Qh7+": "Black resigned."
    },
    "url": "https://gameknot.com/annotation.pl/online-g-10-tournament?gm=4350",
    "gameName": "Online G/10 tournament",
    "players": "bakerbaker (1776) vs. fathermcgree (1565)",
    "opening": "King's knight's gambit (C34)"
}