{
    "moves": {
        "1. e4": "In this game, my opponent plays very strong in the opening and made a blunder in a winning position. He (or she) initiates the game with the king pawn.",
        "1... e5": "I played 1 ... e5. My experience with the sicilian was like a wave, with up and down moments. ",
        "2. Nf3 Nc6 3. Bc4": "The italian opening! ",
        "3... Nf6": "My favourite move, Entering in the 2 knight defence.",
        "4. Ng5": "This move gives a pawn up to white, but black takes the initiative. I feeling more fear to 4 d4 move, where white takes the initiative. Of course, 4 d3 is the quiet variation ",
        "4... d5": "This is not the only move, but 4 ... Bc5 is so hard to play without study",
        "5. exd5": "The reasonable move. The variation 5 Bxd5 Nxd5 6 exd5 Qxg5 leads to black advantage",
        "5... Nd4": "Fritz variation. I don't study very well this system. But in blitz games I have good results. Black has alternatives. 5 ... Na5 is the traditional move and 5 ... b5 is possible. 5 ... Nxd5 leads to Fegatello attack.",
        "6. c3": "Normal reaction. 6 d6 Qxd6 7 Bxf7+ (No 7 Nxf7 Qc6 8 Nxh8 Qxg2 9 Rf1 Qe4+ and black wins)  Ke7 gives a good game to black. My opponent and me plays another game with this variation.",
        "6... b5": "Removes the unwished bishop of c4",
        "7. cxd4": "My rival choices for the exchange... I expected 7 Bf1 Nxd5 with a messy position",
        "7... bxc4 8. dxe5 Nxd5 9. Ne4": "Ok, Now, black is a pawn dow. Now, I can play 9 ... Nb6 and consolidates the c4-pawn. But, I choice to castle.",
        "9... Be7 10. Qa4+ Bd7 11. Qxc4": "Now, white is 2 pawn up. I don't worry about that in this position. Black has a better development ",
        "11... Nb6 12. Qc3": "Strange election for my rival. But I don't see the next move :). I expected Qe2",
        "12... c5": "This a blunder. I play against d4 square. But, I must seize the white king position with Bb5!. I saw this move but discard it. ",
        "13. e6": "A punch in the face! Ok, now, white is winning. In this line, I saw 13 ... Bxe6 14 Qxg7 Rf8 15 Qxh7 Qd3 looking the white king. For my luck, I changed the idea :)",
        "13... Bxe6 14. Qxg7 Rf8 15. Qxh7 Qd4": "If 15 ... Qd3 16 Nf6+ :). Now, I threat the queen with Rh8",
        "16. Ng3": "Well, white has 3 pawns up. I need generates a attack.",
        "16... O-O-O": "The last black piece enter in the game. I can play 16 ... Bc4 but 17 Qe4 looks strong. So, I castle. Of course, the black king is not safe behind a pawn barrier. But white pieces aren't available  to attack right now",
        "17. O-O": "Now, 17 Qe4 gives me 17 ... Qd7 with Bd5 threat. White castles",
        "17... Rfh8": "Seing the h2-pawn. ",
        "18. Qe4": "The only move, Qh4 was a strong threat. ",
        "18... Qf6": "Of course, Black can't exchange queens.",
        "19. Nc3": "The second white knight enters in the game",
        "19... Rd4": "This move was directed to h4 square. But... white has another options",
        "20. Qc6+ Kb8 21. Nb5": "A nice threat, the rook must retreat and the light square bishop is pinned. ",
        "21... Rd7": "Black is tied! Now, I expected 22 d4 opening lines for the bishop. ",
        "22. Ne4": "This is a blunder. My opponent gives me the chance to unpinning the lsb and the queen is trapped. He (or she) plays a very good game at this point.",
        "22... Qh4": "A mating threat",
        "23. h3": "If 23 Re1 Qxh2+ 24 Kf1 Bc4+ 25 d3 Bxd3+ 26 Re2 Qh1++. Else, 23 Rd1 Qxh2+ 24 Kf1 Qh1+ 25 Ke2 Bg4+ 26 f3 Qxg2+ 27 Nf2 Bh4 and black wins. Now, this move stops the mate threat but ...",
        "23... Bd5": "Queen is trapped. Ok, I don't see a better option 23 ... Bxh3 24 g3 (I think this move stop the thread) Qh5 with big advantage for black. Stockfish finds in miliseconds this sequence.",
        "24. Qxd7": "The best option.",
        "24... Nxd7": "In only a material evaluation, black has +1 point. But the activity of pieces is determining",
        "25. Ng3": "The attacked knight retreats. I hope 25 Nec3 Bxg2, but my rival choice is better. ",
        "25... Bxg2": "A intuitive sacrifice. Stockfish agrees but I don't calculates anything.",
        "26. Kxg2 Qxh3+ 27. Kf3 f5": "Stockfish says than 27 ... Ne5+ was better. I want cover the squares near of the king",
        "28. Re1 Bg5": "Similar idea here. Qg4+ was better",
        "29. b3": "29 Ke2 was the only option for delay the checkmate, says the engine. It's a hard position for white, the black game is in a roll.",
        "29... Qg4+ 30. Kg2 f4": "Pretty combination of mate, but esay to find",
        "31. Re4 f3+ 32. Kf1 Rh1+ 33. Nxh1 Qg2+ 34. Ke1 Qg1#": "I hope I have written in an understandable and correct way. As I mentioned, the corrections to both my play and my English will be welcome."
    },
    "url": "https://gameknot.com/annotation.pl/only-a-game?gm=66032",
    "gameName": "Only a game",
    "players": "rueck (1396) vs. sogtulakk (1702)",
    "opening": "two knights defence (C57), Fritz, Gruber variation"
}