{
    "moves": {
        "1. e4": "Hi everyone!\r\n\r\nI will set out the following lyrics to the tune of Only Five Minutes More.  My rendition goes as follows:-\r\n\r\nOnly one little pawn, just one little pawn\r\nbut that little pawn is gonna be \r\na mighty queen\r\nforever more\r\n\r\nand that queen, just that one mighty queen,\r\nshe is gonna sooner or later\r\nto nail your king!\r\n",
        "1... c5": "1. ...... c5 - well, that was how the game ended but we go back to the present with Bob playing his trusty Sicilian Defense.",
        "2. b3": "2. b3 - as the game is unrated I decided to try an unusual line here - this is intended to counter a possible fianchetto of Bob's dsb on the a1-h8 diagonal.",
        "2... d6 3. Bb2": "3. Bb2 - Fou Lenoir occupies that diagonal as planned.",
        "3... e6 4. Nf3 Nd7 5. d4 cxd4 6. Nxd4": "6. Nxd4 - the traditional Scicilian pawn trade on d4 ensues.",
        "6... a6 7. c4 Ngf6 8. Nc3 Qc7 9. Bd3": "9. Bd3 - steady development.",
        "9... Ne5 10. Bc2 Be7 11. Nf3 Nxf3+ 12. Qxf3": "12. Qxf3 - knight trade.",
        "12... O-O 13. O-O b6 14. Qd3": "14. Qd3 - Glenda eyes up the h7 square longingly.  Unfortunately there is a black knight.  e5 will not do as I will simply drop the pawn to dxe5.",
        "14... Bb7 15. Rfe1 Rac8 16. Re3 Qc6": "16. ....... Qc6?? - both players have been playing fairly faultlessly until now.  I am planning a kingside attack and at the same time trying to prevent Henry copping Old Matey on the g2 square - I see real danger in the line up of the Wicked Witch and her partner in crime the lsb on that a8-h1 diagonal.  Gameknot identified this move as a blunder and this sparks off a series of blunders and mistakes on both sides.  Blunder: +3.13 » … Qc6 16. Nd5 Bd8 17. Bxf6 gxf6 18. e5 f5 19. exd6 Qc5 20. d7 Rc6 21. Rg3+ Kh8 22. Qc3+ f6\r\nBest: -0.01 » … Ng4 16. Rh3 Ne5 17. Qe2 Bg5 18. Rd1 h6 19. a3 Bf4 20. Rh4 Bg5 21. Rh3\r\n",
        "17. Rg3": "17. Rg3?? Blunder: +0.37 » 17. Rg3 g6 18. Qf3 Nd7 19. Qe3 Nf6 20. Rd1 b5 21. e5 dxe5 22. cxb5 axb5 23. Qxe5 Rfd8 24. Rxd8+ Bxd8\r\nBest: +4.15 » 17. Nd5 Bd8 18. Bxf6 Bxf6 19. e5 g6 20. Nxf6+ Kg7 21. Nh5+ Kh8 22. Nf4 Rfd8 23. exd6 Qxd6 24. Qxd6 Rxd6 25. Rd1 Rxd1+ 26. Bxd1",
        "17... Rfd8 18. Re1": "18. Re1 - Blunder: +0.27 » 18. Re1 Qc7 19. Qe2 h5 20. Rd1 h4 21. Rg5 g6 22. Qe3 e5 23. a4 Qc5 24. Qxc5 Rxc5\r\nBest: +3.56 » 18. Nd5 Kf8 19. Rxg7 e5 20. Qe3 Qc5 21. Qh6 Bxd5 22. exd5 Ke8 23. Bf5 Rb8 24. Bxh7 Nxh7 25. Qxh7\r\n\r\nHmm, I never considered 18. Nd5 as I thought I was just giving away a piece for a pawn for nothing.  I still need to brush up on my sacrificial techniques.",
        "18... Nh5": "18. ...... Nh5 - now comes a mistake on Bob's part - he tries to harass my rook but here is gameknot's take on this:- Mistake: +2.06 » … Nh5 18. Nd5 Kf8 19. Bxg7+ Ke8 20. Nxe7 Kxe7 21. Rg5 Rg8 22. Bh6 Rxg5 23. Bxg5+ f6 24. Be3 Rg8\r\nBest: +0.27 » … Qc7 18. Qe2 h5 19. Rd1 g6 20. a4 Ng4 21. h3 Nf6 22. Qe3 h4 23. Rg5 Bc6\r\n",
        "19. Rf3": "19. Rf3 - Gameknot seems really keen on that Nd5 move as you will see:- Mistake: +0.30 » 19. Rf3 Qc7 20. Rd1 Nf6 21. Qe2 h5 22. Rg3 Ng4 23. h3 Nf6 24. a4 h4 25. Rg5 g6\r\nBest: +2.66 » 19. Nd5 Kf8 20. Bxg7+ Nxg7 21. Nxe7 Kxe7 22. Rxg7 Rg8 23. Rxh7 Rh8 24. Rxh8 Rxh8 25. Qd4 e5 26. Qd5 Qxd5 27. cxd5\r\n",
        "19... Nf6": "19. ...... Nf6 - and the computer seems to prefer Qc7 for black .... Mistake: +2.04 » … Nf6 19. Nd5 Kf8 20. Bxf6 Bxf6 21. Nxf6 gxf6 22. Qc3 e5 23. Rxf6 Kg7 24. Qf3 Qd7\r\nBest: +0.30 » … Qc7 19. Rd1 Nf6 20. Qe2 h5 21. Rg3 Ng4 22. h3 Nf6 23. a4 h4 24. Rg5 g6\r\n",
        "20. Rh3": "20. Rh3 - again Nd5 is the preferred move:- Mistake: +0.17 » 20. Rh3 Kf8 21. Qd2 Rc7 22. Bd3 Rdc8 23. a3 h5 24. Rg3 Ng4 25. Ne2 Bf6 26. Bxf6 Nxf6\r\nBest: +2.47 » 20. Nd5 Kf8 21. Bxf6 Bxf6 22. Nxf6 gxf6 23. Qe3 Ke8 24. Qh6 Qc5 25. Qxf6 Qh5 26. Rd1 Rc5 27. Qh8+ Kd7",
        "20... e5": "20. ..... e5?! - this move does finally \"allow\" the move Nd5 and gameknot classes this move as an inaccuracy as follows:- Inaccuracy: +0.97 » … e5 20. Nd5 Re8 21. Ba3 Rcd8 22. Qd2 Bc8 23. Rg3 Nxd5 24. exd5 Qb7 25. f4 Bf6\r\nBest: +0.21 » … Kf8 20. a3 Rc7 21. Qf1 Rdc8 22. Bd3 g5 23. e5 dxe5 24. Rxe5 g4 25. Rh6 Qd6\r\n",
        "21. Nd5": "21. Nd5 - and I play it and gameknot is happy with it!",
        "21... Rd7 22. Nxf6+": "22. Nxf6+ - but here we are, back in boo boo land!  Gameknot calls this move a mistake as follows:- Mistake: +0.67 » 22. Nxf6+ Bxf6 23. Qf3 Bg5 24. Bc1 Bxc1 25. Rxc1 h6 26. Qh5 b5 27. Rg3 Kh8 28. Bd3 Qc5 29. Rd1\r\nBest: +1.72 » 22. Qf3 h6 23. Rg3 Kf8 24. Bc1 Nxd5 25. exd5 Qc7 26. Qg4 g5 27. Bf5 Rdd8 28. Bxc8 Rxc8\r\n",
        "22... Bxf6 23. Ree3": "23. Ree3?! - I try to carry on with my plan of a kingside mating attack but gameknot calls this move an inaccuracy! Inaccuracy: -0.03 » 23. Ree3 Bg5 24. Re1 b5 25. Qg3 h6 26. Qg4 bxc4 27. Rc3 d5 28. exd5 Qxd5 29. Bf5 Qd2 30. Rxe5 Qxb2 31. Bxd7 Qxc3 32. Bxc8 Qxe5 33. Bxb7\r\nBest: +0.70 » 23. Qf3 Bg5 24. Qh5 h6 25. Bc1 Bxc1 26. Rxc1 Re7 27. Rd1 Re6 28. Rf3 Rg6 29. a4 Qc5 30. Kh1",
        "23... Re8 24. Reg3 Re6": "24. ...... Re6 - and another inaccuracy:- Inaccuracy: +1.31 » … Re6 24. Qf3 Qc5 25. a3 b5 26. Qf5 bxc4 27. Rxh7 Qa5 28. Rc3 cxb3 29. Qh3 Bh4 30. Qxh4 bxc2 31. Rxc2\r\nBest: +0.37 » … g6 24. Qd2 Bg7 25. Bc3 Qc5 26. a4 a5 27. Rf3 f6 28. Qe2 Rc7 29. Rd3 h6 30. Rd1\r\n",
        "25. Bd1": "25. Bd1? - tempting, sooo tempting to try and sneak a skewer on Bob on the h3-c8 diagonal here.  Gameknot calls this move a mistake however. Mistake: -0.15 » 25. Bd1 Qxe4 26. Bg4 Qe1+ 27. Qf1 Qxf1+ 28. Kxf1 Rd8 29. Bxe6 fxe6 30. Re3 Be7 31. a4 Rf8 32. Re2 e4 33. Bd4\r\nBest: +1.27 » 25. Qf3 Qc5 26. a3 b5 27. Qf5 bxc4 28. Rxh7 Qa5 29. b4 Qc7 30. Ba4 Rde7 31. Bc3 g6 32. Rh6\r\n",
        "25... Rd8 26. Bc2 b5": "26. ...... b5 - Bob now tries something with his queenside pawns.  Gameknot calls this an inaccuracy: +0.60 » … b5 26. cxb5 axb5 27. Qd2 Rc8 28. Bd3 Kh8 29. a3 Qc5 30. a4 b4 31. Bc4 Bxe4 32. Bxe6 fxe6\r\nBest: -0.01 » … Rd7\r\n\r\nStrange, no further info beyond 26. ..... Rd7 from the computer.",
        "27. cxb5 axb5 28. Qe2 g6 29. Rgc3": "29. Rc3 - I do not like the presence of the Wicked Witch of the West on the c column so I decided to force her off it!",
        "29... Qa6 30. Bb1": "30. Bb1 - the pawn on a2 must be defended.",
        "30... b4 31. Qxa6 Bxa6": "31. ..... Bxa6 - a forced queen trade to avoid dropping the rook on c3.",
        "32. Rc6": "32. Rc6?! - trying to attack myself down the queenside but this move is an Inaccuracy: -1.54 » 32. Rc6 d5 33. Rxe6 dxe4 34. Re8+ Rxe8 35. Re3 Rd8 36. Re1 Bd3 37. Bxd3 Rxd3 38. f4 exf3 e.p. 39. Bxe5 Rd2 40. gxf3 Bxe5 41. Rxe5 Rxa2\r\nBest: -0.80 » 32. Rc1 d5 33. exd5 Rxd5 34. Re1 Bg5 35. Be4 Ra5 36. Bb1 Rd6 37. Kh1 f6 38. Bc1 Bxc1 39. Rxc1 Rc5 40. Bc2\r\n",
        "32... Bc8": "32. ...... Bc8? - and black responds with a mistake as he retreats the bishop to its home square.  Mistake: -0.01 » … Bc8 32. Rf3 Kg7 33. Bd3 d5 34. exd5 Bb7 35. Rxe6 fxe6 36. Re3 Bxd5 37. Bxe5 Bxe5 38. Rxe5 Bxb3 39. axb3 Rxd3\r\nBest: -1.93 » … d5 32. Rxe6 dxe4 33. Re8+ Rxe8 34. Re3 Rd8 35. Re1 Bb7 36. Bc1 Be7 37. Be3 f5 38. Rc1 Kf7 39. Bg5 h5 40. Bxe7 Kxe7",
        "33. Rd3": "33. Rd3?! - I respond with a mutual inacuracy - this is meant to put pressure on d6.  Inaccuracy: -0.68 » 33. Rd3 Bb7 34. Rc4 Ba6 35. Rxb4 Bxd3 36. Bxd3 d5 37. exd5 Rxd5 38. Bc2 Rc6 39. Rc4 Rxc4 40. bxc4\r\nBest: -0.01 » 33. Rf3 Kg7 34. Bd3 d5 35. exd5 Bb7 36. Rxe6 fxe6 37. Re3 Bxd5 38. Bxe5 Bxe5 39. Rxe5 Bxb3 40. axb3 Rxd3\r\n",
        "33... Bb7 34. Rb6 Bxe4": "34. ..... Bxe4 - oh dear, I am temporarily a pawn down, but I will get it back over the next few moves.",
        "35. Rd1 Bxb1 36. Rxb1": "36. Rxb1 - bishop trade.",
        "36... Ra8 37. Ra1 d5 38. Rxb4": "38. Rxb4 - my rook coralls the b4 pawn and now material equality has been restored but I feel here that black has a positional edge.",
        "38... d4 39. Rc4": "39. Rc4 - I must try and prevent a rook occupying the c column.  If that were to happen I dread to think what would happen if a black rook landed on c2.  Where on earth would Fou Lenoir go for starters?",
        "39... Rd6 40. Kf1": "40. Kf1 - can Henry help contain this central pawn onslaught?  We shall see.",
        "40... e4 41. Ke1 Re8 42. Rac1": "42. ..... Rac1? - I try and put pressure on the c column but gameknot calls this a Mistake: -1.13 » 42. Rac1 d3 43. Bc3 e3 44. fxe3 Rxe3+ 45. Kd1 Re2 46. Rc8+ Bd8 47. Bb4 Rd7 48. a4 Rxg2 49. Ba5 Rg1+ 50. Be1\r\nBest: -0.12 » 42. b4 e3 43. fxe3 Rxe3+ 44. Kf2 Re8 45. Kf3 d3 46. Bxf6 Rxf6+ 47. Rf4 Rxf4+ 48. Kxf4 Re2 49. b5 Rxg2 50. Ke4\r\n",
        "42... e3": "42. ..... e3 - luckily Bob makes a mistake and I think that it is here that Bob allows me yet again to land a knockout punch on the ropes! Mistake: -0.17 » … e3 42. Rc8 Bd8 43. fxe3 dxe3 44. b4 f5 45. a4 f4 46. Rc8c2 Re4 47. Bc3 Bf6 48. Bxf6 Rxf6\r\nBest: -1.19 » … d3 42. Bc3 e3 43. Rd1 e2 44. Rd2 Bxc3 45. Rxc3 Red8 46. a4 Kg7 47. a5 Kf6 48. Rc7 Ra6\r\n",
        "43. Rc4c8 Rde6": "43.  .......Rde6 - this move triggers a rook trade and gameknot had this to say about it:- Inaccuracy: +0.56 » … Rde6 43. Rxe8+ Rxe8 44. Rd1 exf2+ 45. Kxf2 Rc8 46. Bxd4 Bxd4+ 47. Rxd4 Rc2+ 48. Kg3 Rxa2 49. Kf3 Rb2 50. b4 Kg7\r\nBest: -0.03 » … Bd8 43. fxe3 dxe3 44. a4 Ba5+ 45. Ke2 Rd2+ 46. Kf3 Rf2+ 47. Kg3 Bd8 48. Bd4 Rd2 49. Bc3 Rd7 50. Kf3\r\n",
        "44. Rxe8+ Rxe8 45. fxe3 Rxe3+": "45. ...... Rxe3+ - at least I have gotten rid of that centre pawn menace as only one of those monsters remains.",
        "46. Kf2 Re8 47. Ba1 Kg7 48. a4 d3": "48. ....... d3?! - this pawn push is injudicious as this pawn is soon gonna drop off.  Gameknot called it an Inaccuracy: +1.47 » … d3 48. Bxf6+ Kxf6 49. Rd1 Re2+ 50. Kf3 Ra2 51. Rxd3 h5 52. Rc3 g5 53. Rc6+ Ke7 54. Rh6 Rb2 55. Rxh5 Rxb3+ 56. Ke4\r\nBest: +0.76 » … Re3 48. Rb1 Be5 49. a5 Rd3 50. Ke2 Re3+ 51. Kd2 f6 52. g3 Rf3 53. b4 Ra3 54. Rc1 h6\r\n\r\nIn the best line my queenside passers are stymied by black's rook.  Although there are no more further mistakes, my advantage accumulates steadily over the next 20 moves until it becomes a winning one. ",
        "49. Bxf6+ Kxf6": "49. ...... Kxf6 - both dark square bishops have been traded and my plan is to round up that advanced d pawn.",
        "50. Rd1 Rd8 51. Ke3 Ke5 52. Rxd3": "52. Rxd3 - mission accomplished.",
        "52... Rb8 53. Kd2": "53. Kd2 - after Bob declines a rook trade, wisely so as I am a pawn up, Henry goes to the queenside to try and support my connected passers and guide them to Glendadom.",
        "53... Rb7 54. Kc2 Ke4 55. Rc3 f5 56. Kb2": "56. Kb2 - Hmm, I carried out my plan but I am getting a little worried about Bob's kingside pawn majority, I just hope he does not manage to squeeze out a passer there!",
        "56... g5 57. a5": "57. a5 - passed pawns must be pushed.",
        "57... Rb5 58. a6 Ra5": "58. ..... Ra5 - I anticipated this move.  Now I did some calculating and worked out that the h2 pawn, looking so innocuous on that square would spell Checkmate for Bob.  The gist is - the rooks will be forced off the board.  Bob's king would be diverted to the queenside to eat up my pawns, in the meantime Henry would go over to the kingside and eat some nice tasty black p(r)awns and there would remain the h pawn.  Here we go .....",
        "59. Rc4+ Kd5 60. Ra4 Rxa4 61. bxa4": "61. bxa4 - remembering the K & P ending loss against Near-Master Dynamic Dave I did analyse this trade very carefully, but I do have reason to feel happy with this kind of K & P ending!",
        "61... Kc6 62. g3": "62. g3! - I thought that this move was essential to prevent Bob from forming a pawn chain extending from h6 to f4 and getting a kingside passer should Henry go for the h6 pawn.  The computer gives my score here as +1.83 so at the very least it is an OK move.\r\n\r\n \r\n \r\n",
        "62... Kb6 63. Kc3 Kxa6 64. Kd4": "64. Kd4 - onward goes Henry, towards those black footmen as planned.",
        "64... f4 65. gxf4 gxf4 66. Ke4": "66. Ke4 - the f pawn is well and truly doomed.",
        "66... f3 67. Kxf3": "67. Kxf3 - Bob tries to gain a tempo by luring Henry down the board.  But alas for him, it will not wash!",
        "67... Ka5 68. h4 Kxa4": "68. ..... Kxa4 - I was half-expecting h4 here but I think I can still win from there.",
        "69. Kg4": "69. Kg4!! - I think this move is the killer.  Henry will move onto the h file and head straight for the pawn on h7 and eat it.  He will then have enough time to step onto g7 and escort the h4 pawn safely to Glendadom where he will have a very tearful reunion with his wife before they round up Bob's king.  However, Henry was denied this reunion by Bob waving the white flag on move 71 (my positional score was +13.44 - resignation justified) so Henry had to be content with his footman to accompany him on his long victory march home rather than Glenda - but at least he survives to fight another battle - hope you have had a good read folks - bye for now - Joanne  ",
        "69... Kb5 70. Kh5 Kc6 71. Kh6": ""
    },
    "url": "https://gameknot.com/annotation.pl/only-one-little-pawn-just-one-little-pawn?gm=31592",
    "gameName": "Only One Little Pawn, Just One Little Pawn",
    "players": "jstevens1 (1842) vs. rjacobs (1457)",
    "opening": "Sicilian defence (B20)"
}