{
    "moves": {
        "1. d4 Nf6 2. c4 e6 3. Nc3 Bb4 4. Nf3 O-O": "Si bien es perfectamente jugable, tal vez intecalar 4.., c5 darías más opciones a las negras. El orden elegido por el campeón de Arica fue empleado con asiduidad en el match Kaspárov-Kárpov.",
        "5. g3 c5 6. Bg2 Ne4 7. Qd3 Qa5": "Las negras aprovechan su leve ventaja de desarrollo para acosar al caballo de \"c3\". En varias lineas las blancas se quedan con peón de menos, Alfredo se decide por la aparentemente única opción: simplificar.",
        "8. Qxe4 Bxc3+ 9. Kf1": "¿Esto era necesario? La alternativa era 9 Ad2, donde habría que evaluar la \"eterna\" clavada del caballo. Las negras arden por abrir lineas. d5 se ve como una posibilidad grata, así como Cc6, colocando énfasis en el abandono de las casillas negras por el corcel de las blancas.",
        "9... Bxd4": "¡Me pican las manos por sacrificar algo! Veamos: 9.., d5; 10 cd, ed; 11 Dd5, Td8 con idea de Ad4 y luego tomar de torre... el tema del mate en octava tal vez no se logre, pero en dos jugadas ¡todas las piezas negras juegan! Bueno, sigamos con la partida.",
        "10. Nxd4 cxd4 11. Qxd4 Nc6 12. Qe4": "El tema es que ahora la dama queda tocada si se sacrifica un peón..",
        "12... Rd8 13. Qc2 d5 14. cxd5 exd5": "Ok, pareja de alfiles y peón aislado, pero me sigue preocupando el tema del rey en el centro. Además, siento que la dama blanca no se quedará tranquila en la columna C",
        "15. Bd2 Qb5": "Echándole un ojo a \"e2\"",
        "16. a4": "Los enredos favorecerán al bando mejor desarrollado, tal vez es tiempo de mejorar la ubicación del rey, pero la posición no es del todo tranquila, Ag4 y Tc8 son algunas ideas bastante claras para las negras.",
        "16... Nd4 17. axb5": "Ansioso tal vez, Alfredo no duda en cambiar las damas haciendo caso al viejo adagio que el peón aislado es más débil en el final. ",
        "17... Nxc2 18. Rc1": "¡Genial! ahora tenemos la columna C, pero el caballo se mostrará bien activo.",
        "18... Nd4": "Interesante parece 18.., Af5 Si 19 e4, de4; 20 Tc2, e3 y el peón en séptima es respetable. El caballo de todas maneras tiene una misión importante en b3, además ataca al débil \"b5\"",
        "19. Rc5": "Un descuido que pudo haberle costado el punto más pronto de lo que ocurrió al blanco. La posición no es del todo clara, pero todo parece estar en la jugada 18 Tc1, la torre se presta actualmente para todos los caprichos del corcel negro.",
        "19... Be6": "Un descuido que pudo haberle costado el punto más pronto de lo que ocurrió al blanco. La posición no es del todo clara, pero todo parece estar en la jugada 18 Tc1, la torre se presta actualmente para todos los caprichos del corcel negro. 19.., Cb3! Si 20 Td5, Td5; 21 Ad5, Cd2; 22 Re1, Af5 el rey blanco sigue siendo tema. 19.., Tc2 pierde después 20.., Af5; 21 e4, de4; 22 Ae3, Td1; 23 Re2, Ag4. ",
        "20. e3 Nb3 21. Rc2 Rac8": "Nuevamente, Af5 era la jugada",
        "22. Rxc8 Nxd2+": "22.., Tc8 se encontraba con Ac3.",
        "23. Ke2 Rxc8 24. Kxd2 Rc5 25. Rd1 Rxb5 26. Kc3 a5": "Le pone zapatillas al peón ",
        "27. Rd2 a4 28. e4 Rb3+ 29. Kc2 g6 30. exd5 Bf5+ 31. Kc1 a3": ""
    },
    "url": "https://gameknot.com/annotation.pl/open-arica-2009?gm=26533",
    "gameName": "Open Arica 2009",
    "players": "Mondaca, Alfredo  vs. Rivera, Ignacio ",
    "opening": "Nimzo-Indian (E21), three knights variation"
}