{
    "moves": {
        "1. d4 Nf6 2. Nc3 g6 3. e4 d6 4. Nf3 Bg7": "I'm playing it like a KID with the key difference of nc3 instead of c4. That means white's bishop has more flexibility, so I'm waiting to see whether it goes to e2, d3, c4 or b5 to decide on my set up...I could go c6, Bg4 nd7 etc or 0-0 c5 and play it like a benoni.",
        "5. Bc4 O-O": "I considered b4 to mix it up. Nxb4 then nxe4 and black is better, so Bxb5+ c6 Be2 and black can get developed in peace with some open files. Probably not enough compensation though, so I'm playing safe with 0-0. Nxe4 didn't look good at all due to Bxf7+ kxf7 nxe4. Now if white goes for e5 before castling I should be safe enough and be able to threaten his uncastled king in some lines.\n",
        "6. Be3 Ng4": "Going for the bishop pair. If Bf4 e5 works out ok, and Bg5 h6 is ok too I think. With the bishop pair I'll be looking to open up the game and exhange a knight.",
        "7. Qd2 Nxe3 8. Qxe3 Bg4": "Not wanting to lose the bishop pair, but I want to threaten Bxf3 qxf3 Bxd4 or Bxf3 gxf3 nc6, which creates some tangible weaknesses for white, or maybe after gxf3 c5 opening up the centre",
        "9. O-O-O c6": "Opens up channels for the queen, and stops e5 due to e5 d5. This makes things more difficult for the knight on b8, but I'm going to have to expand on the queenside, so maybe it'll be ok.",
        "10. h3 Bxf3": "I decided to give up the bishop pair for a few reasons: There aren't many good squares for the light-squared bishop...Be6 Bxe6 fxe6 e5 looks awful for me. Bd7 blocks the knight and doesn't have a clear future, and Bc8 would waste time and encourage f4 or g4 with an attack for white. Also, afterBxf3 I can gain development time with b5. If Qxf3 then I have ideas with qb6 attacking d4. I think gxf3 should be considered for white, opening the g file and looking to play f4, f5.",
        "11. Qxf3 b5": "Gaining space for development with tempo. I'm looking to attack the queenside before he can get things going on the kingside.",
        "12. Bd3 Bxd4": "Bd3 appears to be a mistake. It leaves d4 hanging and I don't think white can protect it tactically because things like Bxb5 lose to the intermediate move Bxc3, winning a piece. It may have been an oversight by white. I was expecting Bb3 keeping the bishop in the attacking and defensive position, after which I would have played a5 either before or after qb6 attacking d4.",
        "13. Be2 Bg7": "Getting the bishop back to safety. I prefer this to e5, which cuts the bishop off from the kingside and potentially leaving a hole on the dark squares there. Qb6 was an option instead, threatening f2, but I don't want to open up the game before I get my knight out. I have ideas of playing b4 then if na4 qa5, forcing b3, leaving the dark squares completely vulnerable.",
        "14. g4 b4": "g4 was overly ambitious I think. White needs several moves to loosen up the kingside and b4, qa5 is a real threat. White might have looked at nxb5 cxb5 e5, opening an attack on the rook while black is undeveloped. I don't think it would work though, as after nd7 exd6 rxd6 black can unpin and should be fine.",
        "15. Na4 Qa5": "Nb1 was probably better, to meet qa5 with Bc4. Now the dark squares need desperate protection.",
        "16. b3 Nd7": "Keeping it simple. If instead qe5 h4 qa1+ doesn't get anywhere, and I can't see any result from the Bh6+ check. Now there are lots of threats, including nb6 where nxb6 axb6 looks unstoppable and there'll still be an attack after kb1 nxa4 bxa4 qxa4. Very hard to defend now for white. ",
        "17. Kb1 Nb6": "If nxb6 axb6 opens the a-file with strong attack. If the knight doesn't move, then nxa4 bxa4 qxa4 is coming. I'm threatening qe5 in a lot of lines.",
        "18. Nb2 Qe5": "Now any knight move is met by qa1++. kc1 leads to severe loss of material. It looks like c3 is the only move. After c3 bxc3 nd3 c2+ it looks like I have a strong attack. Kxc2 loses to qb2++ and kc1 qa1+ kd2 cxd1=q is winning.",
        "19. c3 bxc3 20. Kc2 cxb2 21. Rdb1 a5": "white gave up a piece to stop the attack. Best plan must be to open files and increase pressure. Qc5 was also possible...but may as well bring the other pieces in.",
        "22. a4 Qc5+": "Thought it best to play the check, as I noticed that if Kd3 Qc3 is mate, and if kd2 Bh6 Kd3 Bc1 looks very good. If Kd1 immediately then Bh6 looks winning too."
    },
    "url": "https://gameknot.com/annotation.pl/open-game-with-commentary?gm=43340",
    "gameName": "Open game with commentary?",
    "players": "rooiphil (1443) vs. jayestom (1812)",
    "opening": "Queen's pawn game (A45)"
}