{
    "moves": {
        "1. d4": "This game was part of a Semi-Slav thematic; for the starting position see black's 4th move. ",
        "1... d5 2. c4 c6 3. Nc3 Nf6 4. Nf3 e6": "This was actually the starting position.",
        "5. e3": "White opts for e3 rather than Bg5, leading as usual to the Meran Variation.",
        "5... Nbd7 6. Bd3 dxc4 7. Bxc4 b5": "The Meran Variation. Black uses this \"lunge\" to gain time to reorganize his queen's wing. The Meran is one of the most heavily analyzed openings, and this game follows main line theory until about move 16.",
        "8. Bd3 Bb7 9. O-O": "A choice point: white could opt for the ultra-aggressive e4, or the very quiet a3. The text move is currently the \"main line\".",
        "9... a6 10. e4 c5 11. d5 Qc7": "11 ...c4 is more usual here, but the text transposes a few moves later. The queen goes to c7 to inhibit e5.",
        "12. dxe6": "As I intended to play this pawn exchange, I decided to force it now. Bc2 is considered more flexible.",
        "12... fxe6 13. Bc2": "A prophylactic against tactics on the d-file.",
        "13... c4": "Transposing back to the main line. Black frees c5 for his knight.",
        "14. Nd4": "Another choice point: Ng5 is a popular alternative, often leading to a delicate endgame. Given that my opponent was more highly rated, I preferred the tactical possibilities offered by Nd4.",
        "14... Nc5 15. Be3 O-O-O": "Black very often castles long in this variation, and the main theme of the next part of the game is white's attempts to exploit this.",
        "16. Qe2 e5": "A popular move, preventing white playing e5 to harrass black's knight.",
        "17. Nf3 Ne6": "Threatening ...Nd4 (Gelfand-Akopian 1996).",
        "18. Nd5": "The first deviation from theory; white reacts aggressively to black's threat. Moving one of the rooks to d1 is more usual. The attacking idea here is based on a game by Krasenkov, though the present game does not follow it at all closely.",
        "18... Nxd5 19. exd5 Nf4 20. Bxf4": "Not entirely nice, but better than a black knight outpost on d3.",
        "20... exf4 21. a4": "Natural, but possibly not the best move order; Rfd1 might have been better. White intends to sacrifice the exchange on d5, and  might then have done so under more favourable circumstances.",
        "21... Bxd5": "I had thought that ...b4 was almost forced here. Instead Black takes the d5 pawn, allowing the opening of the a-file.",
        "22. axb5 axb5 23. Rfd1": "White prepares the exchange sacrifice, intending to control the long light-squared diagonal with his bishop. ",
        "23... Qc5": "Now however black is able to overprotect the bishop and recapture with the queen, though I am not sure that black actually expected the exchange sacrifice. Ways of avoiding it: (A) Bc6 or Bb7, in both cases allowing the white queen to e6; (B) Nxf3, where white achieves his objective for free.",
        "24. Rxd5": "The exchange sacrifice at last, and we're off.",
        "24... Qxd5 25. Be4": "Taking control of the light squared diagonal as planned.",
        "25... Qc5": "A good defensive post for the queen, as shown by subsequent play.",
        "26. Ne5": "With several threats, also allowing the queen to come to g4 and attack down the \"other\" light diagonal.",
        "26... Bd6": "Black offers the exchange back, under danger of a mating attack, e.g. Ne8 Qg4  and wins.",
        "27. Nc6": "Intending to weave a mating net by Ra7 and then strike with bishop or queen on the c8-h3 diagonal.\n\n27 Qg4  followed by 28 Qxg7( ) looks dangerous; however black can block the 7th rank with Be7, and then follows for example 29  Nf7 Rhg8, 30 Nxd8 Rxg7, 31 Ne6  and white has no advantage. \n",
        "27... Rhe8": "A very strong defensive move, forcing white to keep his rook on the back rank and threatening Qxc6. ",
        "28. Qf3": "I wanted to play 28 Ra6 here, threatening 29 Nxd8. Then if Rxd8, 30 Rc6  wins the major exchange. However after the immediate Ra6 I was worried about Qg5 followed by f3 with threats of mate on g2 or c1.  28 Qg4  still does not succeed in my opinion: ...Kc7, 29 Ra7  (or Qxg7)  Kb6. The problem is that black can still block the 7th rank with Be7, at the same time threatening back rank mate. 28 Ra8  was still possible; then for example ...Kc7,  29 Ra7 Kb6, 30 Qe1 b4, 31 Qa1; or 28 ...Kd7, 29 Qg4 .",
        "28... Kc7 29. Ra6": "A careless move, made very quickly. I had seen this in analysis but forgotten about it. Cashing in by Nxd8 would likely have led to an endgame draw, with white still having the better tactical chances if the major pieces remained on the board.",
        "29... Rda8": "The end of white's attack, and now he is in trouble.",
        "30. Rxa8": "Ng8 or Nb4 looked interesting, but do not work.",
        "30... Rxa8 31. g3 Ra6": "Another strong move. The knight is the main platform of my attack,  but there is no way to extricate it.",
        "32. Qc3": "Probably best, using the long dark diagonal while the knight is still preventing Be5.",
        "32... Rxc6 33. Qxg7+ Kb6 34. Bxc6 Kxc6 35. Qxh7": "This loses, abandoning the defence of the g-pawn. On the other hand, black can easily force the queen off the long diagonal, winning the b-pawn. The text is a (flawed) attempt to make counterplay on the light squares, defending th g-pawn indirectly.  Returning the queen to c3 seems equally inadequate, e.g. 35 ...Bd5 and white must abandon either b2 or g3.",
        "35... fxg3 36. Qe4+": "Hoping to provoke the bishop in to g6 and win it with a fork.",
        "36... Kb6 37. hxg3 Bxg3": "Black goes for it, but at this point I realized that I had overlooked the variation Qg6  Qd6!, Qxg3 Qxg3, fg b4, Kf1 (the g-pawn is not fast enough) c3, bc b3! and white's king cannot reach the b-pawn.",
        "38. Qg6+": "Just to show what I had intended, but I resigned immediately.  :-("
    },
    "url": "https://gameknot.com/annotation.pl/orangutans-mini-tournament?gm=4285",
    "gameName": "orangutan's mini-tournament",
    "players": "orangutan (1727) vs. profdaum (1893)",
    "opening": "QGD Slav defence, Alekhine variation (D10)"
}