{
    "moves": {
        "1. e4": "I did some post-annotation 2 1/2 years afterward.  Glad I saved my original notes.  It's a sharp opening.",
        "1... e6 2. d4 c5 3. Nf3 cxd4 4. Nxd4 Qc7 5. Nb5": "Great idea.  Two-and-a-half years later I'm also looking at c4 but computer much prefers the text move as being good for initiative and tactics.  I still think c4 is a strong positional alternative.",
        "5... Qe5 6. Nb1c3 Nc6": "I might have played ...a6 with great initiative.  He does eventually play it.  Sharp opening for sure.  Computer keeps wanting me to get my Q out and play f4 as well.",
        "7. Be3 a6 8. Nd4 Nf6": "Computer shows the difficult-to-see 8...Bb4 9.a3 Bxc3 10.bxc3 Qxe4 with material advantage.  Also love how the computer loves attacking the centre because ...d5 starts showing up as an option.  It's a theme I need to watch for more often because I tend to favour positional play.  Presently I control 5 vs his 8.",
        "9. f3 Be7 10. Nxc6 bxc6 11. Be2 O-O 12. Bd4": "I wonder how impulsive that was because I just moved it twice in a row when O-O would have completed the short term plan.  And watch how it gets chased back to then add up to 3 moves in very short order.  My old notes don't provide any insight to this or my subsequent questionable move. 13.b3?  Centre 6 vs 6.",
        "12... Qc7 13. b3 c5 14. Bf2 Bb7 15. Na4 d5 16. exd5 Rfd8": "! neat idea.  Didn't see that coming.  17.Qd3? is bizarre.  If he would have replied with ...Rxd5 I would have looked pretty silly.  Centre 4 vs 7.",
        "17. Qd3 exd5 18. Qc3 Rac8 19. O-O Nd7 20. Qe3": "I guess I never saw Bg3!  He's also had a small resource in ...Bd6 for a while.  He will eventually play something like that.  Tempo is very important here... as usual.",
        "20... Bf6 21. Rac1 Rde8 22. Qd2 Be5 23. g3 d4 24. c3 dxc3 25. Nxc3 Nb6 26. Rcd1": "?  How do you protect against 26...Bxc3 now?  He put an extra move in there that pretty much gets him the same advantage.  Computer is really Jonesing for Ne4 to attack the c-pawn.  +0.61.  I never recover from this.",
        "26... Rcd8 27. Qc2": "Original note \"does he see ...Nd5 ...Ne3.  Jasper style!\"",
        "27... Bxc3 28. Rxd8 Qxd8 29. Rd1 Bd4": "...Qf6 is also good.  I should have seen those options.  I'm lost.",
        "30. Kg2": "Original note \"back there again\".  Not a good move according to computer but there's no great offensive opportunity.  In hindsight, Rd3 would have avoided the pending triple fork (Q,K,R).",
        "30... Qf6 31. Bxd4 cxd4 32. Rf1": "Original note \"and again\"",
        "32... Nd5": "!!  White resigns 0-1.  Final position around -12.1"
    },
    "url": "https://gameknot.com/annotation.pl/osmanankets-mini-tournament-iii?gm=58144",
    "gameName": "osmananket's mini-tournament III",
    "players": "e4newman (1478) vs. bilou06 (1864)",
    "opening": "French defence (C00)"
}