{
    "moves": {
        "1. e4": "Here I took an early draw, after just 19 moves.",
        "1... c5": "So I play my Sicilian.",
        "2. Nf3": "The most common move.",
        "2... Nc6": "I have been playing this for the last 20 years or so, although at one time I did play d6.",
        "3. Bb5": "An interesting alternative to d4.",
        "3... e6": "Preparing to develop my other knight to e7.",
        "4. O-O": "He develops.",
        "4... Nge7": "I continue with my plan.",
        "5. c3": "He prepares d2-d4.",
        "5... a6": "I hit the bishop",
        "6. Ba4": "It runs.",
        "6... b5": "I hit it again.",
        "7. Bc2": "He runs again. I now had a long think, and eventually played.",
        "7... d5": "I can't allow him an uncontested d4-e4 centre.",
        "8. a4": "He plays on the queen side, threatening an exchange on b5 followed by taking my rook.",
        "8... Bb7": "So I protect my rook. b4 is an alternative.",
        "9. axb5": "He takes.",
        "9... axb5": "I take back.",
        "10. Rxa8": "He takes.",
        "10... Qxa8": "I take back this way. In my opening databases, I can only find a couple of games where black recaptures with the bishop, and none where the queen takes back. Taking back with the queen seems OK to me. Have you any thoughts dear reader?",
        "11. d4": "So he gets his centre.",
        "11... cxd4": "I take",
        "12. cxd4": "He takes back. I had another long think. I was very tempted to play Nb4 here, gaining the two bishops, but I eventually concluded that after 13. e4 the position is closed and the knights are probably better than the bishops. Any views dear reader?",
        "12... dxe4": "So I played this instead.",
        "13. Bxe4": "He takes back.",
        "13... Nb4": "I was hoping for a nice isolated queen pawn position, where his isolated pawn on d4 is securely blocked by a knight on d5, back up with a knight on b4.",
        "14. Bxb7": "He takes.",
        "14... Qxb7": "I take back.",
        "15. Qe2": "He hits my pawn on b5.",
        "15... Ned5": "I carry on with my plan.",
        "16. Na3": "He attacks it again.",
        "16... Nc7": "I protect it again.",
        "17. Bf4": "He attacks my defender.",
        "17... Nbd5": "So I protect it again.",
        "18. Be5": "Played to induce my next move, which is a slight weakening. I did think very seriously here about taking on a3 and then castling, but I was a bit afraid of him developing something on the kingside with something like moving his Nf3 followed by Qg4. I seriously looked at sacrificing the pawn on g7, and play 18....Be7 19. Bxg7 Rg8 and try and generate something down the g file, backed up with my queen on b7 bearing down on g2, but I couldn't see anything concrete as after 20. Be5, Nf4 is prevented.",
        "18... f6": "So I play this.",
        "19. Bxc7": "He takes.",
        "19... Nxc7": "I recapture and offer a draw, which is accepted.\n\nMany thanks for reading. Please leave a comment or two, and rate it on the star rating system."
    },
    "url": "https://gameknot.com/annotation.pl/oswestry-a-v-church-stretton-a?gm=61911",
    "gameName": "Oswestry A v Church Stretton A",
    "players": "Charles L Higgie (ECF166) vs. David Hodge (ECF144)",
    "opening": "Sicilian (B30), Nimzovich-Rossolimo attack (without ...d6)"
}