{
    "moves": {
        "1. e4": "First game of mine that I have annotated for several months - the last game of mine that I have annotated was played on 9th October last year.",
        "1... g6": "So it starts out as a so-called Modern Defence, although it has been around for well over 100 years, for instance it  features in William Steinitz vs. Augustus Mongredien 1863 in which black was defeated in 22 moves. https://www.chess.com/article/view/the-modern-defense-a-history",
        "2. d4": "So I take the centre.",
        "2... Bg7": "He completes the fianchetto",
        "3. Nc3": "I opt for the Modern proper, rather than invite a transposition to the King's Indian Defence with 3. c4.",
        "3... d6": "The usual move in this position.",
        "4. Be3": "I am planning a Pseudo-Samisch attack if he continues with the usual moves - 4.....Nf6 5. f3 0-0 6. Qd2 planning 0-0-0 to launch a King's-side Pawn storm with moves like g2-g4 and h2-h4. Black must try to keep this storm under control while hitting back in the centre or on the Queen's-side. Called the Pseudo-Samisch attack, it is similiar to the Samisch set-up against the King's Indian Defence.  https://en.wikipedia.org/wiki/King%27s_Indian_Defence,_S%C3%A4misch_Variation",
        "4... a6": "But he deviates from the usual. At the time I thought this move rather a waste of time, and was surprised to find out afterwards that this is in fact the most commonly played move on a couple of the opening database I use. ",
        "5. Bd3": "I played this, as on c4 the bishop will be hit with tempo with b7-b5. I discovered later that this is rather unusual, and 5. Qd2 immediately was more popular.",
        "5... Nd7": "Black at last develops a knight!",
        "6. Qd2": "And I continue with my plan.",
        "6... h6": "This move very much surprised me, and at the time I considered it to be a weak move, as for instance, 7. 0-0-0 Nf6 8. f3 and he can't castle immediately due to his h pawn being under attack. 6....b5 is the most common move, and scores well for black.",
        "7. O-O-O": "I continue with my plan.",
        "7... b5": "and he immediately strikes on the queen-side.",
        "8. f4": "I swtich from my idea of playing f3. I was thinking that he has made loads of pawn moves, and not developed his pieces very well, not prepared to castle, so I need to be thinking in terms of preparing to open up the centre and get at his king, maybe play e4-e5 at some stage.",
        "8... c5": "Yet another pawn move! He needs to develop with Ng-f6.",
        "9. dxc5": "I take. Now 9....Nxc5 is met with 10. Bxc5 dxc5 11. Bxb5+ and wins.",
        "9... dxc5": "So this is more or less forced.",
        "10. e5": "And I play the central thrust. Can you see what I am threatening? Stop and find it before reading on.",
        "10... e6": "Although this was played after 20 minute's thought, he still didn't seem to see what I am threatening, and he lets me carry out my threat. At the time I was interested in the variation 10...Bb7 11. Nxb5 axb5 12. Bxb5 Bc8 13. Bxc5 Rxa2 and although I have only two pawns for the piece, black seems very tied up. I though 10.....Qa5 was black's best move. Fritz seems to think the best line for both sides is 10....Bb7 11. Be4 Bxe4 12. Nxe4 f5 13. e6 Nf8 14. Qe2 fxe4 15. Rxd8+ Rxd8 with plus 3 for white.",
        "11. Be4": "So I carry on with my plan",
        "11... Rb8": "The rook is forced to move.",
        "12. Bxc5": "And I take the pawn. But as well as winnng a pawn, black now has got some very weak dark squares. Again, stop and see what white is threatening.",
        "12... Ne7": "Although this drops the exchange, Fritz give this as the best move.",
        "13. Ba7": "And although Fritz doesn't give this as the best move, it wins the exchange. White has a dream position - materially up and better development.",
        "13... Qc7": "Rb7 is the best move for black according to Fritz, where, according to Fritz white should decline the exchange and play 14. Bf2. 13....Rb7 is what I expected and I planed to play 14. Bxb7.",
        "14. Bxb8": "Interestingly, Fritz now agrees with taking the exchange.",
        "14... Qxb8": "And black recaptures.",
        "15. Qd6": "I attempt to exchange queens. Fritz prefers simple development with 15. Nf3 with white up 4.24.",
        "15... Qa7": "Fritz prefers 15....Qxd6, although being material down, one can't blame black to not exchanging.",
        "16. Nf3": "I finally develop the knight.",
        "16... Qe3+": "He throws in the check. Find white's best move.",
        "17. Qd2": "I panic about losing the f pawn. Better is 17. Rd2 and if Qxf4 then 18. Bc6 wins the knight.",
        "17... Qb6": "He retreats again.",
        "18. Qd4": "I offer the queen exchange again.",
        "18... Qa5": "and he declines, threatening b5-b4.",
        "19. Nd2": "With the idea of meeting b5-b4 with Nb3 or Nc4.",
        "19... f6": "This seems wrong. Black should take the opportunity to castle.",
        "20. Qd6": "Attacking e6.",
        "20... Kf7": "Protecting e6.",
        "21. Rhf1": "Developing my last piece and enabling 21....fxe5 with fxe5+",
        "21... Nf5": "Attacking my queen.",
        "22. Bxf5": "So I take.",
        "22... gxf5": "He takes back. OK find white's best move.",
        "23. Nd5": "Did you find it? Of course, if exd5 then e5-e6+ wins at least a piece back. Fritz gives the best defence as 23....Ne5 24. fxe5 exd5 25. Qxd5+ with plus 5.14 to white.",
        "23... Bf8": "He counter attacks my queen. At the time I thought, wrongly, that this was the best move. ",
        "24. Qc6": "Virtually the only move! I am now attacking Bc8 so....",
        "24... Bg7": "Fritz prefers Qd8 but it is pretty hopeless.",
        "25. Nb3": "Fritz likes this move, hoping to draw the queen out of play with 25.....Qxa2?? 26. Nc3 and his queen has run out of squares.",
        "25... Nb8": "He tries to counter-attack my queen. Fritz gives this as the best move, although black is now down 6.88 according to the silicon monster, so it is becoming increasingly academic.",
        "26. Qc5": "I renew threats to come in at e7.",
        "26... Qd8": "So his queen runs back.",
        "27. exf6": "Fritz prefers 27. Qa7+ but this is good enough.",
        "27... Bxf6": "He takes.",
        "28. Nxf6": "I take back, discovering an attack on his queen.",
        "28... Qxf6": "He takes back.",
        "29. Qc7+": "I throw in a check. Black is parting with more material, so he resigned. Many thanks for reading, please leave a comment or two and rate it on the star system to let me know how I am doing! Until next time dear reader!"
    },
    "url": "https://gameknot.com/annotation.pl/oswestry-a-v-ludlow-a?gm=64022",
    "gameName": "Oswestry A v Ludlow A",
    "players": "CharlesLHiggie (ECF176) vs. Joe Watson (ECF170)",
    "opening": "Robatsch (modern) defence (B06)"
}