{
    "moves": {
        "1. d4": "In this game, early on I sacrifice bishop for pawn. He declines leaving me a clear pawn up. He complicates by sacrificing bishop for three pawns, but as he is a pawn down anyway, that mean just 2 pawns for the minor piece. He play the freeing move e6-e5 too early and is blown away in just 26 moves.",
        "1... Nf6": "Apologies for this act of self-indulgence. I have many games I could have annotated, wins, draws and loses, but many have been long games recently.",
        "2. c4": "A note about the time control - it should have been 85 minutes each plus an incremental, but at least one of the clocks was set wrong, without the incremental. As a result our board 3 lost in a winning position, and we lost the match 3-2.",
        "2... e6": "A note about my opponent. I asked him if he was related to Richard Eales. He said something like \"yes how do you know my brother?\" I replied, I meant the chess player Richard Eales, author of a book on the Alexhine Defence. http://www.chessgames.com/player/richard_g_eales.html and https://www.abebooks.co.uk/9780713403664/Alekhines-Defence-Contemporary-Chess-Openings-0713403667/plp",
        "3. Nc3": "So back to the game. At this point I was rather expecting 3...Bb4 and a Nimzo-Indian Defence.",
        "3... d5": "But he reverts to a Queens Gambit Declined.",
        "4. Bg5": "I usually play this, although Nf3 and e3 are also popular.",
        "4... Nbd7": "Common, although also Be7",
        "5. e3": "So if he takes on c4 I can take back immediately with the Bishop on f1.",
        "5... c6": "Into a Slav pawn structure.",
        "6. Nf3": "Usual development.",
        "6... Qa5": "And he opts for the Cambridge Springs Variation. The first recorded use of the Cambridge Springs was by Emanuel Lasker in 1892. The name derives from a 1904 tournament in Cambridge Springs, Pennsylvania in which the defense was used several times. Practitioners of the opening have included Efim Bogoljubov, Vasily Smyslov, Garry Kasparov, and Magnus Carlsen.\n\nThe line remains popular among amateurs because there are several traps White must avoid. For example, 7.Nd2 Bb4 8.Qc2 0-0 9.Bd3?? dxc4! (threatening ...Qxg5) 10.Bxf6 cxd3! (a zwischenzug) 11.Qxd3 Nxf6 and Black has won a piece. https://en.wikipedia.org/wiki/Queen%27s_Gambit_Declined,_Cambridge_Springs_Defense",
        "7. Bxf6": "So I avoid all traps.",
        "7... Nxf6": "He takes back.",
        "8. a3": "I avoid him pinning my Nc3.",
        "8... Be7": "Reasonable development, and played successfully in this position before, although I personally like Bd6 so if the bishop is hit by c4-c5 it can drop back to c7 or b8 to support e6-e5.",
        "9. b4": "Attacking the queen. All this has been seen before.",
        "9... Qd8": "But in the games on my opening databases with this line black has played Qc7, and Qc7 seems a better move to me, as in due course the Qc7 will support e6-e5.",
        "10. c5": "Clamping down on the queen side.",
        "10... O-O": "Sensible development.",
        "11. Bd3": "I did consider 11. Ne5, but eventually came to the conclusion that it was premature.",
        "11... Re8": "With the idea of Bf8 in due course.",
        "12. Ne5": "Now the knight jumps in.",
        "12... Nd7": "This is a mistake! He needed to continue with his plan of Bf8 first. What would you play here dear reader?",
        "13. Bxh7+": "Did you find this move? What would you play if black takes the bishop?",
        "13... Kf8": "If 13....Kxh7 (which is better than the move played, and at least makes a fight of it) Fritz gives the obvious 14. Qh5+ as only level. Sure white can force a draw immediately, with 14. Qh5+ Kg8 15. Qf7+ and then checking again on h5, but white should be looking for more. Or white can pick up a third pawn for the bishop with 16. Qxe6 but that allows black to develop the Bc8 and it is only equal. White needs to be looking for more. 14. Qh5+ Kg8 15. Nf7 is again only equal after 15....Nf6! So after 13....Kxh7 the only way for advantage is 14. Nxf7! Qc7 (forced) 15. Qh5+ Kg8 16. Nh6+ gxh6 17. Qxe8+ Nf8 and white has rook and two pawns for knight and bishop - a slight material advantage, but an advantage none the less, compared to the other lines which do NOT lead to any advantage for white. \n",
        "14. Nxd7+": "Played after a long think, I decided just to play on a clear pawn up with no compensation for black. Fritz prefers 14. Qh5",
        "14... Bxd7": "Surprisingly to my mind, Fritz prefer the recapture by the queen. I assume Fritz was planning b6, a5 and Bh6.",
        "15. Bd3": "Fritz also prefer to drop the bishop back to c2. ",
        "15... Bf6": "An excellent move, threat e6-e5",
        "16. f4": "White of course has to prevent this.",
        "16... g5": "Fritz prefers Bc8. I am not sure why.",
        "17. g3": "A quickly played move and a bad mistake. I should have played Ne2 or 0-0 here.",
        "17... gxf4": "He of course takes.",
        "18. gxf4": "I take back.",
        "18... Bxd4": "I missed this move.",
        "19. exd4": "I take.",
        "19... Qh4+": "He checks.",
        "20. Kd2": "My king runs.",
        "20... Qxf4+": "He checks again.",
        "21. Kc2": "King runs again.",
        "21... Qxd4": "So he gets three pawns for the bishop, but as he was a pawn down to start he now has two pawns for the knight. It is still advantage white.",
        "22. Rf1": "With the threat of 23. Rxf7+ Kxf7 24. Bg6+ Kxg6 25. Qxd4 winning for white. Fritz prefers Qh5. Not sure why.",
        "22... e5": "This prevents my threat, by protecting his queen, but is a massive mistake. f7 cannot be defended now. 22.....Qh4 was better.",
        "23. Qh5": "Attacking f7",
        "23... Be6": "The only way to protect it. Find white's best move! https://gameknot.com/chess-puzzle.pl?pz=215655",
        "24. Bg6": "But now there is no defence. If 24..... Re7? 25. Qh8 mate! However the best move for white was 24. Rxf7! and mate in 4.",
        "24... e4": "Perhaps dreams of a check or two starting with Qd3+",
        "25. Bxf7": "I take here. ",
        "25... Ke7": "Trying to run.",
        "26. Bxe6": "Now if he takes the bishop it is mate in two. https://gameknot.com/chess-puzzle.pl?pz=215657\nBlack resigned at this point."
    },
    "url": "https://gameknot.com/annotation.pl/oswestry-a-v-shrewsbury-b-shropshre-league?gm=65739",
    "gameName": "Oswestry A v Shrewsbury B Shropshre League",
    "players": "Charles L Higgie (ECF 173) vs. Ted Eales (ECF143)",
    "opening": "Nimzo-Indian defence (E20)"
}