{
    "moves": {
        "1. e4 e5 2. Nf3 Nf6": "Not surprised with this move, as I've seen before.  Personally, I would've played the Siclian, but where she is, I'm not surprised at Mary's decision to play 2...Nf6  What I had anticipated, however, was 2...Nc6, in which case, I'd respond with the Ruy Lopez.",
        "3. Nc3": "Instead of exchanging on e4 and e5, I play this.  The idea being, as ION pointed out, is that 3.Nxe5, Nxe4 would lose tempo for white, which is something that I wasn't going to allow.",
        "3... d6": "I anticipated 3...Nc6, but I'm not surprised with this move, as she has played the Philidor against me, as noted in our last training session.",
        "4. d4": "Of course, I know how to respond to that.",
        "4... Nc6": "Now, she plays what I mentioned.",
        "5. Bb5": "Therefore, I treat it like the Ruy Lopez because this is what I'm most accustomed to.",
        "5... a6": "?! I anticipated this, but I call it an inaccuracy.  I kept this in mind and realized that if I force can exchange which is going to happen, her Q is not on the white square.  Therefore, Mary winds up with doubled pawns.  Doing this will put her at a small disadavantage early.  That's because, in general, doubled pawns are something you don't want, unless it's a passer, you're ahead, or you win a B pair, etc.  But, otherwise, they're known to cause damage.",
        "6. Bxc6+ bxc6 7. Bg5": "Instead, of castling right away, I decide to take advantage by pinning her other N.  In fact, I said, pins are very nasty.  But, unlike before, there is a small problem which we'll see on her next move.  Having said that, best was 7.0-0, getting my K to safety, at once.",
        "7... h6 8. Bh4": "This is a move that I calculated.  Now, I predicted that this would happen.  I also took into consideration, 8...g5, 9.Bg3 and asked myself if this loses anything.  When calculating lines, I didn't think so since my B is not locked on g3.  That's true, but this is where I miscalculate because after that black gets a nasty attack on my N with 9...g4  Having said that, although it didn't appear, that was a mistake on my part, as it should cost white a pawn.",
        "8... g5 9. Bg3 g4 10. Nd2": "This time, it's crammed, and the reason this should lose a pawn is that the move played also blocks in my Q so that should she find the right move, I can't recapture.  I looked at and had considered 10.Nh4?? asking myself if it's good.  After further consideration, I realized that this is a terrible blunder because after 10...Nh7 or 10...Nd7 my N isn't only attacked, but there are no escapes.  So, no matter where I'll go, she'll win a piece which is something that I couldn't allow, espeically since I'm coaching her.",
        "10... h5": "I told Mary that best was 10...exd4! winning my d pawn.",
        "11. Nb3": "But, since she missed that opportunity, I wasn't going to give her another chance to take.  So, I was, instead, going to protect it, and now the N is in a better position.",
        "11... a5": "She wants to win my N.",
        "12. dxe5": "The real reason behind this move was to win a pawn or take away castling rights.  The idea being was that if 12...dxe5?!, 13.Qxd8+, Kxd8, and while material level is even, I'd have a slight advantage since black would lose castling rights.  In fact, Mary knew this plan and asked, \"Joe, you like to play without Queens?\"  The only reason I didn't answer her was that, if I said yes, she know the plan and it'd help her find the best move which as I learned, with students, you don't want to give them the benefit of the doubt.",
        "12... a4": "However, Mary sees what I'm really up to and goes for my N.  That's of no big deal, for when she takes, I take back, and things are still even.",
        "13. exf6 axb3 14. cxb3": "I had a very tough time deciding between this capture, or 14.axb3  The reason I played this was because I thought I was protecting e4, thus, remaining a pawn ahead.  The idea being is that I had anticipated 14...Ra5, followed by 15...Re5  Now, I also looked my over DSB, as he couldn't go there.  But, if she could, now if 14...Ra5, 15.Qe7 so that if 15...Re5 she can't take.  But, what I overlooked  is that she will win back my pawn, on f6.  However, everything is still even and has become quite interesting.",
        "14... Qxf6 15. O-O": "?? Ok, do you remember what C++ said in his last annotation?  \"11. O-O?? would be a bad mistake. If your Gameknot rating is below 1500, try to figure out why 11. O-O would be a blunder.\"  So, I accurately commented by saying, Yes. In my case, that's especially important since I've gone wrong by trying to caste prematurely. In this case, white would wind up with an exposed K, should he castle. So, if 11.0-0, 11...Bxh2+ 12.Kxh2, Ng4+ 13.Kg3, g5 14.Bxg5, hxg5  Only to find out that I got the correct because on the next move he said, \"If 11. O-O?, then 11...Bxh2+! 12. Kxh2 Ng4+ followed by ...Qxh4. This knight often comes into c4 after white plays b4.\"  Well, I just made the same blunder.  As it turns out, this move should lose a piece, with best play.  I'm very that I made this flaw against someone that I'm training.  The idea is that you don't show lienency and make errors like this, as it's quite bad for learning purposes.  In this case, unusual circumstances call for unusual measure, so best was 15.h4, gxh3 e.p 16.gxh3, Bxh3, and while I don't like losing a pawn or having my K wide open and exposed, it's better then hanging a piece, like this.",
        "15... h4 16. e5": "Knowing that, I'm already trying to figure a way out of this.  The one thing that I kept in mind was GM games.  Now, I always thought that when someone attacks a piece, they're opponent reattacks, but just for the sake of gaining of tempo.  And, there were a lot of variations that mentioned it, which I played through.  However, I now know why this happens.  The reason why after one attacks, the opponent reattacks is, although, it appears so, there is no escape square.  So, if you didn't go after something more valuable that player would lose a piece, and there'd be no way out of it.  Having learned that, and now, making the connection, I'm going to reattack, but it will be after her Q.  In fact, I told her something based on what Jack has emphasized repeadetly, until it became second nature, which I, eventually, told my students.  That is, you have to find a way out of trouble, and she agreed by nodding her head.",
        "16... dxe5": "As anticipated.",
        "17. Ne4": "But, since my B is under fire, I will, like before, reattack her Q.  That's because, anything else loses my DSB, without compensation.",
        "17... Qe7 18. Qc2": "Now, that she's defended her Q, I think about what else to do, in this position, as my B is still hanging.  I realize that I can't reattack her Q, again.  So, I come up with a different.  No, I don't play this just because it attacks a pawn, for if that were the case, she'd be able to take my B, which is worth more then a pawn.  Instead, I remebered what GM Damian which is that one should create a threat that's difficult to drive off.  This is one of those times, for black must do something to not only protect c6 but prevent what's bound to come.  It's worth noting that for to come up with this, I had to remember, and visualize the kind of position that you'd see from the Domino Defense, where you give up a piece to win a R.  The same thing could be said here because I'm giving something up, at this point, and if and when she should take, there will be consequences.  But, I also remembered what GM Susan Polgar said about combos that you give something away, for something else worth more, which will often give you the advantage.",
        "18... hxg3": "?? An outright blunder.  ",
        "19. Qxc6+": "Mary: Poor Rooky Rook.  Joe: That's where, \"To take is a mistake.\"  Mary: Yeah.  Joe: Better was 18...Bb7, 18...Bd7 or 18...Rh6  Best was 18...c5, in this position.  The idea behind all of that was so that I could not grab the c pawn and cause trouble.  But, I made a small mistake because, when I said that, I forgot that 18...Bb7 was an illegal move.",
        "19... Qd7 20. Qxa8": "As noted, I was thinking in terms of the Domino Defense, plus the idea was pinning her B because doing this sort of thing early is usually of bad omen.  But, best was 20.Nf6+ winning the Q for my N due to a nasty fork.  This time, I didn't simply overlook it, as usual, but rather miscalculated.  And, that was due to my game against vesper2, which you saw in my last annotation.  In that game, the Q was forked, but the K was not involved, so it was between Q+R, and the Q could get away there.  Well, I thought along a similar line, but this time, my N and her Q in a different diagonal, so it does work.  Therefore, the fork, this time, would be between K+Q, so if I had played that move, Mary would've had to lose her Q.",
        "20... gxh2+": "Not at all surprised to see her play this, as Mary is doing anything for counterplay.",
        "21. Kh1": "Forced.",
        "21... f5": "?? I understand why she played this with the idea of trying to gain tempo with the threat.  This, unfortunately, is another blunder.    In fact, I forgot to record this, but I think I told her that better was 21...Bg7, 21...Be7, or 21...Rh6  All of these moves protect the area.  So, with this error, I won't same mistake that I made before.",
        "22. Nf6+": "She said, \"Oh, I've lost my Queen.  Oh, man\"",
        "22... Ke7 23. Nxd7 Bxd7": "Now, something very interesting has happened.  Mary asked me what an en-pessant capture was.  So, Jack and I told her.  In fact, I gave her a good example since, for a long while, I had trouble understanding.  Therefore, the example was, suppose that I played f4.  Now, you'd be able to capture with ...gxf3, and since you can capture horizontally, this is an en-pessant capture.  Then, Jack explained it a little better that if the pawn is far enough down, yet, I'd advance it two squares horizontally, only once can the capture be made horizontally to stop the pawn from advancing further down.  That capture is called en-pessant.",
        "24. Qa5": "I almost played 24.Qb7, but with that move, Mary would be able to defend her c pawn, after 24...c6.  This, however, is a fork between c7 and e5.  Therefore, black must now lose a pawn, one way or another.",
        "24... Kd6": "?? With this move, forget about a pawn.  Instead, I remember about tactics, and will use them to win, another piece.  Having said that, I calculate the next few moves and, therefore, knew how to respond.  I am not sure what the best move, but what I know is as someone once said when commenting one of my annotations, \"Almost anything is better then this move.\"",
        "25. Rad1+ Kc6 26. Qd5+ Kb6 27. Qxd7": "Mary: I have no way to protect.  Joe: True, but you're still in the game.  I think, that if I told her the problem with what happened, she'd resigned.  That's because in the game, what I implied by telling her that she's still in the game is not to resign, yet.  The idea being is that it's not over, til it's over.  And, as Judit Polgar would say, \"Fight til the end\", which is what it all boils down to.  Afterall, you never really know what'll happen until the end, so by staying in, I feel that there's more for Mary to learn.  And, it goes along with the Supplemental Talking the Talk rules that you don't resign until you see an inevitable mating sequence.",
        "27... Bd6": "? I think the idea was to add another defender to the K.  But, no matter where she went, black would've lost another pawn.  I, initially thought there was a way, but that move would've been a blunder, as we'll see shortly.",
        "28. Qxf5 Rh5": "?? Blunder that I overlooked shortly.  Believe it or not, Mary said, \"the pawn is a goner, though.\"  At first, I agreed with that and nodded.  But, I was very wrong, this time around.  With that being said, best was 28...Rh4",
        "29. g3": "I wouldn't have made this inaccuracy, at all, as there was something much worse that I could've done.  That was, 29.Qxh6  First, I was a little worried about the pawn taking back, but I reversed the colors.  The real reason this happened is that Mary and I were suddenly put on the spot and became very distracted when Jack made a comment.  In it, he asked, \"You're still playing this game?\"  That implied that she should resign, and this is a frequent but whenever someone suddenly gets involved, distractions happen soon after.  In fact, I've seen plenty of examples with Jack, where he gets distracted at something going on, and then makes mistakes.  It's even happened against his students.  And, in fact, it resulted in his first lost against me.  Sure, I was winning, as I had already won his R, but then he gave an example of why a move was a mistake.  But, then, he got distracted, played the wrong move, which enabled me to take his other R.  As a result of being down 2 R's without compensation, Jack resigned.  So, the idea is that when you get distracted, you often move a little too quickly, and therefore, don't find the best move or make a mistake.  That, however, isn't good and something should be done, the only question is what and how to deal with sudden distraction like this.  I think the best way is to pause and take a little longer before moving, as per what Ken said when I made a different mistake earlier against the same opponent, and forgot to grab her N, as opposed to, a pawn.",
        "29... Rh8": "Mary: It sort of doesn't matter.  I realize that she's right because one way or another, however, I will grab that pawn.",
        "30. Qxg4 Ra8": "Trying to grab my a pawn.",
        "31. a4": "Normally, I wouldn't fuss about that, but instead, respond with 31.Kxh2, so that, if she takes, I take back.  But, in this case, I need that pawn as it is a passer.  So, I have to try to avoid losing my advantages, as per what was outlined in my last annotation.  I am also starting to think along the lines of what happened between charleshiggie and brigadecommander, where you had a Q, yet, a different pawn promoted, so that, each side, had two Q's.  Well, that obviously isn't going to occur here, as there won't be 4 Q's like there was in that game.  But, if played right, the possibility of 2 Q's exist where I'd promote, yet, still remain with a Q.",
        "31... Ra5": "To prevent my a pawn from advancing further.  I wasn't going to do so, right away, but it wouldn't be too far away.  In fact, my plan was to play 32.Rd5, and that would be followed by a5.  For now, however, this move stops that.",
        "32. Kxh2": "But, it does not stop me from winning another pawn.  In fact, I said, 31...Ra5? was a mistake because it lost a pawn.  Best was 31...Rh8",
        "32... Rc5": "Trying to grab my b pawn since the plan is 33...Rc2.  But, by playing this, I can do something quite nasty.",
        "33. Qb4+ Kc6": "Best was 33...Ka6 to prevent my next move.",
        "34. a5": "As now, I should be able to promote with best play.",
        "34... Rc2": "Still trying to win my c2 pawn.  However, there is a discover attack which I'm bound to miss.  I thought that if she takes my c pawn, I'd promote once and for all.",
        "35. a6": "?? So, in anticipation of that, I continue advancing.  But, this is a terrible blunder that shouldn't have been overlooked.  Either way, black was going to get back a pawn, and the plan behind 34.a5 was to win back my Q.  By playing this, I have allowed this which cost me my advantage, to a large extent.  Not only that, but I could've continued advancing and promoted, so with that being said, best was 35.Qa5  But, with this move, the Q is doomed.  And, now black has a possiblity of drawing, or even winning the game.  That makes me upset that I, subconsciously, gave her back the advantage.  ",
        "35... Bxb4 36. a7": "So, I think about what to do.  But, this is another error, and black can surely now get back what she lost.  The question which has been very difficult is the when to.  In this context, when do tactics apply the most since I know that 99% of chess is tactics.  I realize that it's here, and as ION said in my last game against the same student, it's all in my head.  In it, he said, \"It's all there in your head - it just needs sorting and prioritising. I would suggest you should play 'tactics first' and positional second. Most players develop that way - there is a kind of exhilaration seeing how the pieces and pawns interact to achieve certain ends, or prevent the opponent achieving his aims, that appeals to young players. I know it did me! Keep the position guidelines in mind, of course, but for the time being, subordinate them to tactical and material considerations. As your strength (rating) improves, then is the time to reconsider your game plan.\"  Therefore, best was 36.Rh1, allowing that pawn to promote because as Jack has made me do for homework and Susan Polgar have emphasized, in an endgame, the idea is always that a R should be behind the passed pawn.  This would've allowed a promotion.  Had I remembered all of that, I would have played Rh1.",
        "36... Kb7": "Which should stop the pawn from promoting because even if 37.Rh1, she has 37...Bc5",
        "37. Rd5": "Figuring out what to do, since I can't over after the B, I go right after the pawn that's protecting her B.",
        "37... Rc5": "?? So, I said, a blunder that I almost missed.  I was worried that if I told her anymore, I'd give her too much coaching, and then she either resign now or would make a worse mistake that would allow mate.  The idea is that you can only teach so much without going overboard.  Knowing that I went overboard with vasper2, I wasn't going to do it again here, so I didn't say anymore.  But, best was 37...Kxa8, and even if and when 39.Rxe5, I lose the opportunity to promote and the game should end in a draw.  But, with this move, I won't miss the tactic that I overlooked earlier.  In other words, I will play 38.Ra1 ",
        "38. Ra1 Ra5": "Instead, of taking she plays this.  Mary kept in mind that if 38...Rxd5, I'd promote right away with 39.a8=Q+  But, it's too little too late.  That's because not only do I exchange R's, but after that, I win a piece back, and no matter what black plays after that, I will promote.  Therefore, all hope is gone.",
        "39. Rdxa5 Bxa5 40. Rxa5 Kb6 41. a8=Q": "Mary said, \"Yeah, you've got it.  I'm done, it's over.\"  And, she resigned.  This time, I agreed with her and resignation is no longer premature.  That's because I have an inevitable mating sequence.  At first, I looked at 41.Qa7+, Kc6 (forced) and I'd still mate, but it'd take longer without an immediate mate.  But, shortly after there is one move that forces, mate which I would've played right away, had she not resigned.  And, there is no way out as the K can't move, and in order to delay mate, black would have to get out of danger with her monarch.  With that being said, I would've played 42.Qa6# had she stayed in, so I agreed that it was safe to resign.  I also base things on what Jack's input since he, as we know, is a legend due to how many students he's trained.  In it, he said to Mary, \"How many times must I tell you to castle?  You've got to castle.\"  Then, I looked at it, and realized that he isn't completely correct.  The reason being is that black could not castle because her pieces blocked that from happening.  But, why did this happen?  It is because black did not complete her development and payed the price.  So, what I said was yes, and developing your pieces is important.  For example, early in the game, I noticed that you were pushing pawns, when the time could've been used to develop your pieces.  Jack agreed by nodding his head.  What I was implying overlyes some of what he said, that in the opening it is important to develop, castle and control the center.  When Mary failed to do that, there were consequences.  With that being said, the overall moral to this story is, \"Openings must be used with the greatest care.  What you do in the opening will affect you in the midgame; what you do in the midgame will affect you in the endgame; what you do in the endgame will affect the final results\"  This is a perfect example because failing to open properly took it's toll which became very notiecable in the end."
    },
    "url": "https://gameknot.com/annotation.pl/otb-coaching-game?gm=59511",
    "gameName": "OTB Coaching Game",
    "players": "Joe (1268 ELO) vs. Mary ",
    "opening": "Petrov three knights game (C42)"
}