{
    "moves": {
        "1. e4": "I start with my usual.",
        "1... c5": "Jack: Siciliano.  Joe: I like it!  Jack: You like it?  Let's see how it goes?  When he said that, Jack might of thought that he was taking me off guard since it appears like something different.  I say that because even though this mentor taught me the defense, he hasn't played it in a while.  So, my guess is that by saying it, Jack's reminding me of how intense openings can be.  However, I am very used to it, as that is the main defense that I play.  So, for now, everything is not only standard, but it's what I'm most used to.",
        "2. Nf3 d6 3. d4 cxd4 4. Nxd4 Nf6 5. Nc3 e5": "That is, until now as 5...a6 is the most common move, in this position.  The idea being to, as we know, prevent 6.Nb5 or 6.Bb5+.  But, this move is just as effective, and this, in reality, where I'm reminded of how intense openings can be.  It used to be, even after my second training game with Ken, that I went wrong by not knowing what to do when someone played something against me that I'm not used to.  That was, especially in the opening when entering unfamiliar territory.  Yes, the second training game with Ken was very helpful as he is also a good coach.  However, unlike what you'd think, it did not solve the problem.  Overtime, I learned, even though it might not be the right attitude to just expect the unexpected.  I learned that if I'm prepared for anything expect to be surprised, unfamiliar openings or moves will not take me off guard.  Therefore, I'd know how to handle.  For example, the Spanish opening starts off with 1.e4 e5 2.Nf3 Nc6 3.Bb5.  However, we can see a similar setup in the Sicilian.  For example, Jack and other's have also played 5...Nc6.  This used to take me off guard and, back in the day, caused me to go wrong.  However, I calmly play 6.Bb5 as that gets me back into familiar territory.  When, it does not work in that position, I find something similar to make it work.  But, the idea is to just stay calm and collected and pretend that it's yoga.  That is how I adjust to something I'm not used to.  It's the analogy that I have created to compare yoga to chess when getting into something that intense.  The journey is to yoga as the position is to chess.  Just like with yoga that takes you on the journey, in chess, every position is different.  Some intense.  But, we don't fight or run away from it (which is what the Fight or Flight Syndrome is.)  Instead, we accept it for what it is and learn to adjust.",
        "6. Nf3": "With that being said, I just go back to where the N originally was.  This is also just like Yoga.  It would be like you're supposed to do the balance.  But, you lose it.  How do you handle it?  Well, you don't struggle to keep the foot up.  Instead, you just put the foot on the floor.  And, when you're in standing facing dog and lunge, you don't struggle to get the foot on the mat.  Instead, if it doesn't make it on it's own, you help it to get there with your hand.  Well, the same thing here.  I wanted to do a lot with the N.  But, I couldn't find any squares.  The only thing I thought might be logical was 6.Nf5 but am not ready to exchange.  Therefore, I just returned the N to where it originally was.  And, it's worth noting that the loss of tempo here is of no concern to me.",
        "6... Bg4": "The downside is the pin.  Of course, I'm used to seeing it.",
        "7. Bg5": "I did consider 7.Be2, but I felt that if Jack could pin, it was safe for me to pin, as well.  When he breaks it...",
        "7... Be7 8. Be2": "I break it, as well.",
        "8... Nc6": "Not surprisingly, Jack develops.",
        "9. Bb5": "So, I directly pin.  Worth noting that even though I'm calm and collected, the one thing that doesn't work is becoming too happy about the position, as I remember with Ken combined with other games.  There was one where being too happy lost the game, at once, as that's when I let my guard down.",
        "9... O-O": "As anticipated, Jack castles.",
        "10. O-O": "But, so do I.",
        "10... Nd4": "Attacking my B.  But, given that my N is pinned, Jack will force an exchange.",
        "11. Be2": "This was played to prevent the loss of material.  Not only was the B attacked, but on top of being pinned, my Nf3 had 2 attackers against only 1 defender.  So, I defended again to match the equation.  However, my original play was 11.Nd5?? which would've been a disaster.  And, that's where the coaching began.  Jack: 11.Nd5?? loses immediately.  I then told him that there was a variation where I'd capture material.  And, he said, \"Even if you were to capture, I'd get a piece without compensation. ",
        "11... Nxe2+ 12. Qxe2 a6": "This is where Jack prevents 13.Nb5.",
        "13. Qd3": "Doesn't bother me the least bit, as I break the pin.  The only downside is that Jack exchanges before I'm ready.  As I like where my Nf3 was placed.  But, my guess is that Jack didn't want me to do anything else with the N which is why he took.  Despite not being ready, I also kept in mind that he may exchange, with which, I take back with the Q and maintain a strong position.",
        "13... Bxf3 14. Qxf3 Rc8": "The idea is keeping my other N tied down.  The idea is, in general, if I move it, the c pawn will fall.  In fact, that's what Jack mentions while coaching me, which we'll see soon.  Not knowing what else to do it, unlike a couple of moves earlier, I am now ready to exchange.  So, I go for it.  In part, I didn't know what else to do.  And, in general, when I'm not sure, the way to not be taken off guard is going by what my instincts tell me without giving it a lot of consideration.  The reason is because thinking about me too much has also generated the Fight or Flight mechanism, in the past, which is also where I'd go wrong.  In fact, that's one reason that it took me a long while to surpass beginner status, let alone, where I am today.    That's why I give the absolute threshold (just enough) consideration to ask myself the chances that it will work.  But, if it is possible, I do it.  More often then not, it's exchanging, as I feel more comfortable doing so.  As for me, it is about getting rid of my opponents pieces, especially when they look strong.  But, that's especially in this context as I was going by GM Susan Polgar's general advice to exchange N for B.  Well, that's exactly what happened here. ",
        "15. Bxf6 Bxf6 16. Rac1": "As that gives me enough time to defend the c pawn again.  However, this move was also possible.  But, as noted, I exchanged because it looked beneficial, since we're talking about N for B.  If it was the B, instead, I would not have done that.  Before this move, my original play was, once again 16.Nd5 with the same idea.  This time, it was being that one of my pieces wasn't en-prise.   This is where, like with Ken, Mr. Stockel gets into my thought process and coaches me.  Jack: Why did I play 14...Rc8  Joe: I'm not sure because my Nc3 is protected.  Jack: It's because I knew that you would play Nd5 with which your c2 pawn is unprotected.  So, it's up to you.  Well, that led me to making the right choice because it is certainly not worth a pawn.  With stronger players, it's generally not a piece, but rather, a pawn that makes or breaks the game as this mentor has emphasized.  Therefore, I play this, to allow my Nc3 to move since it is now defended again.",
        "16... Bg5": "However, I overlooked this move, as the c pawn was attacked.  So, in this case, it was almost counterproductive for getting rid of the half pinned.  Nonetheless, I will find a way around this, sooner or later.  ",
        "17. Rcd1": "First, I protect.",
        "17... Qf6": "Once Jack plays this, I exchange Q's.  In this context, however, I would've declined.  But, the idea behind it is that in the aftermath, I am going to win a pawn.  That is the most important thing on my mind because it was too often that I have missed the opportunity to win material against my coach.  The reason being is because of what Ken mentioned in a previous annotation.  As it turns out, I have trusted Jack too much to make good moves which is how I've overlooked his bad moves.  However, that's why I remember not to trust my opponent.  And, by not doing it here I catch his error and take advantage with this variation that will leave me a pawn up.",
        "18. Qxf6 Bxf6 19. Rxd6 Be7": "Not surprisingly, Jack attacks my R.",
        "20. Rd7": "So, I counterattack.",
        "20... Bb4": "Trying to put pressure on me.  It does work a little, but there is not enough to change my next move, as I am not willing to exchange here.  That's because of what I noted earlier being that now, it's my N for his B.",
        "21. Nd5": "Thus, I attack.  When Jack defends...",
        "21... a5 22. a3": "I attack again.  We will get into the same territory.  My goal is to get Jack's B off of the a3-f8 diagonal.  As then, I'd be able to fork with Ne7+ and win a R for N.  Jack doesn't allow that.  And, one of those variations involves exchanging a lot of pawns, btw.",
        "22... Bc5 23. b4 axb4 24. axb4 Bxb4": "?? But, Jack made a terrible mistake by capturing that pawn.  As now, even if I could do it the fork isn't necessary, when I can get a piece for free.  Seeing the bad move, I immediately take his B on b4 to leave him a piece down, without anything in return.  As now, he'll really have to struggle.  But, being confident and expecting the unexpected is what help me to seize this opportunity as I have missed these kinds of opportunities too often.",
        "25. Nxb4 b5": "As I was threatening to win another pawn, Jack protected it.",
        "26. Rfd1": "I wasn't sure of what to do, so I doubled up here based on Jack's advice to do that.  But, I think that better was 26.Nd5  The reason I didn't play that first was if I was to double up a move later the N would interfere with that.  However, it would also threaten 27.Ne7+ which would make it difficult to drive off.  Jack probably would've found the threat and responded.  But, that alone, would've been more pressure against his forces.",
        "26... f6": "I am not sure why Jack played this as mate was not immediately threatened.",
        "27. Rd1d5": "So, seeing that the pawn is blocked, I attack b5.",
        "27... Rcb8": "Not surprisingly, Jack protects.",
        "28. Nc6": "And, that's when I attack his R.  Not surprisingly, he defends.",
        "28... Rba8": "But, it is an odd way.  This is Hope Chess.  Being a piece down, he is giving me another pawn.  What's bad is that I also considered 29.Rxb5?? which would lost immediately, in which case, the Hope would've worked.  And, it would become a WTW chess game where I got mated.  But, I saw what's going on, as I went wrong in a similar way with a team game.  I believe he gave me a pawn with the same type of threat.  By, overlooking his had two Rooks against one in a back rank.  So, when he captured, I resigned because recaptured is forced, with which, he would've mated me at once.  Knowing that, combined with comments from bhidragon about those basic threats, I figured out what Jack wants, and I put a stop to it.  However, that was not before considering 29.Ne7+ which is effective.  But, I asked myself the question about mobility.  Like if I could free my N, and then make a threat of my own.  I didn't see it any, and I wouldn't be able to do anything with right away.  For after Jack would get out of check, this threat would remain.  So, the move after is what I decided to play right away.  As GM Susan Polgar put it, I opened up a window to stop the threat.",
        "29. g3 h6": "With which, he also opens up a window.  And, that's when I make a similar threat of my own.  But, I don't use the N as it just check and Jack gets out.  So, there's not much in the way of mobility.  However, by threatening with the R, instead, there is a great deal of mobility and it will be difficult for Jack to drive off the threat that's coming which at the time, I thought would be impossible.",
        "30. Re7": "So, this is where it starts.  As I am threatening what I play next.  But, then would continue with something 32.Rxg7+ Kh8 33.Rh7+ Kg8 34.Rg7# which is mate.  ",
        "30... Kh7": "This move doesn't appear to change anything, but it does.  As my threat is the same.  But, what I forgot is that Jack can and will defend with his 31st move which means that, not surprisingly, he saw this coming.  ",
        "31. Rdd7 Rfg8 32. Ref7": "What's worth noting is that even though I'm no longer threatening checkmate, I have both of my Rooks on the seventh rank.  That is known to be very powerful.",
        "32... Raf8": "Jack's idea is to exchange.  Well, being a piece up, I don't hesitate to liquidate.  Even when exchanging doesn't work, the only time that I do just because it's possible occurs when I'm ahead.  As it is about liquidating.",
        "33. Rxf8 Rxf8 34. Rd8": "With that being said, I try to exchange again.",
        "34... Rf7": "But, just like with Ken, Jack refuses.",
        "35. Rb8": "Therefore, I decide to attack his pawn.",
        "35... Rc7": "And, Jack attacks my N.",
        "36. Nb4": "So, I defend by leaving his pawn attacked.",
        "36... Rc4": "And, Jack attacks again.  But, like we saw earlier, I'm not concerned because this is a mistake.  As now, I will take his passed pawn.  When Mr. Stockel recaptures.",
        "37. Rxb5 Rxe4 38. f3": "I decide that enough is enough and go after his R.  Just as good and worth considering was 38.c3 to push the passed pawn.  The reason I say this is because what was played is the only move that I considered.   One thing to remember is even if no blunder is made, just like what Ken said, more then one move should be considered.  My idea was as noted earlier, not to overthink things.  But, as chesskingdom64 has said, \"There is always more then one to do something.\"",
        "38... Rc4": "On the contrary, I might be just as good that I consider that here because this move would leave it attack.  By having my passed pawn on c2, it's protected by my Nb4.",
        "39. Kf2": "Thus, I plan to and will centralize the K.  With that being said, this was played to get the King into action.  The plan is to add another defender to my c pawn so that I can safely push my passed pawn.",
        "39... Kg6": "I'm not exactly sure why Jack played this, but I think that he has the same idea in mind.",
        "40. Ke3": "But, my K is now centralized.",
        "40... Kf5": "I anticipated this move.  But, Jack said, \"Ok.  Let's try this.\"  The next move that I have in mind is what I play next.  Since it looks good because of this will establish a nice pawn chain.  And, given that I'm still a piece up, nothing else came into consideration here.  As similar to my game with teardrop34, I'm still asking myself if, as opposed to, why a move is good.  This is something that still needs work, as Jeremy mentioned.",
        "41. g4+ Kg5": "I also anticipated him playing this.  So, there was a variation that I was studying with 40...Kf5 which led to me checking on g4.  But, that is my next move, which was the plan.  As now, not only is the R attacked, but more importantly, my passed pawn is protected again by my K.  And, that leaves it free to maneuvere.  So, I was, specifically, thinking about mobility here.",
        "42. Kd3 Rd4+": "And, this check does not bother me.",
        "43. Ke3": "Better might have been 43.Kc3, with the idea being 44.Kb3  But, I didn't want to block the path of my passed pawn.  However, having the K on b3, would allow that pawn to break through even quicker.  This time, I did consider, but once again, the idea was to not overthink.  Unlike before, however, that was an incorrect assessment because it would not be overthinking.  Instead, it would be looking at other variations.",
        "43... Rc4": "As now, my c2 pawn is blocked again.  In other words, it's still protected but only if I keep where it is.  So, it's confined which I don't like.",
        "44. Rb7": "Therefore, I go right after his g7 pawn.",
        "44... g6": "And, Jack defends.  Of course, I kept that in mind and thought that he'd protect.  That is because of a different variation that becomes a reality on my next move.",
        "45. Kd3": "As my passer is, once again, free to maneuver.",
        "45... Rd4+": "Similar to what we saw on Jack's 42nd move, I had also anticipated this being played.",
        "46. Kc3": "So, I bring the K to where it should've been several moves earlier.  As my c pawn will soon become free to move.",
        "46... Rf4": "So, Jack targets my f pawn.",
        "47. Kb2": "But, that does not bother me.  In fact, I give him back the pawn because my focus is on the passed pawn.  Once again, the idea is mobility since my plan is to promote here.",
        "47... Rxf3 48. c4": "Of course, I know what Jack is about to do.  However, I have no problem with him getting another pawn.  As I will continue to push my passed pawn.  And, on top of it, I'll use my K along with it.  Thinking like this is how I won against ftvmini.  And, at the time, his rating was about 500 points north of my rating which made for an interesting game, especially since I was down a piece early.  I am keeping all of that in mind here.",
        "48... Rf2+ 49. Kc3 Rxh2 50. c5": "As this will, again, allow my K to move up, along with, my pawn.  But, this, however, is where I'm starting to go wrong because of where Jack's R is placed.",
        "50... Kh4": "Jack's original play was 50...Rh3+  But, he deemed that as a blunder since that would allow what I play next.  And, as you'll see, it should wait a move.",
        "51. Kc4": "As now, Jack can and will do something with my passed pawn.  So, best was 51.c6.  It also comes to show where move order is important since that's what I play next.  However, this give Jack to stop that pawn and pull a swindle.  Had I just advanced the pawn right away, I would've been able to promote, as I would get the pawn to 8th rank before Jack would have the chance to get his R to the 8th rank.",
        "51... Rd2": "His original play was play 51...e4? with the idea of promoting.  But, Jack said that it was unplayable because of my original response being 52.Kd4 which wins that pawn and the game.",
        "52. c6": "So, I respond by pushing that pawn.  Even though I got the move order wrong, it is not too late to promote that pawn. ",
        "52... Rd8 53. Rd7": "?! My idea was liquidating since I am ahead.  However, better would've been 53.c7  Even stronger was 53.Kc5 which guarantees the promotion.  As afterwards, there's so much I can do with it, whilst supporting that pawn.  And, black would be helpless against that.  The bad part is that it didn't come into consideration.  But, K against the pawn like that is a known win.  With that being said, this is the move that throws away the win.  The important thing to remember is what role the K plays in the endgame.  I know but underestimate the amount of power the monarch contains at that phase.  ",
        "53... Rc8": "Trying to stop that pawn.",
        "54. c7": "So, I push again.  Of course, I overlooked his next move.  But, it is worth it for a promotion.",
        "54... Kxg4 55. Nc6": "? But, this is the move that throws away the win.  What I didn't consider was 55.Na6  And, that would've forced Jack to give up his R for a pawn to prevent the promotion.  But, black is busted after that move.  By playing this, he can and will keep that pawn block.  The win isn't over yet, but the chances are very slim as I have lost all of my advantage with this move.",
        "55... h5": "Pushing his pawn and trying to promote.",
        "56. Ne7": "So, I put a stop to that.  And, it appears that Jack has lost a R for a pawn, but this is a draw.  Surely, a N+R+K is a win against just the K.  But, it's very difficult to win, though.  In contrast, those extra pawns make that win impossible.",
        "56... Rxc7+ 57. Rxc7 h4": "As now, Jack is trying to promote one of the pawns.",
        "58. Nxg6": "And, I try to stop that by taking here.  When Jack advances again...",
        "58... h3 59. Rh7": "I get my R involved to stop that pawn from promoting.",
        "59... Kg3": "Doing what he can do, Jack supports that pawn.",
        "60. Rh4": "So, I try to intimidate my coach by making him think that the pawn is in danger.",
        "60... h2": "And, it works.  The plan behind is to go after his f6 pawn which starts with my next move.",
        "61. Kd3": "But, I was thinking about Ke4-f5 which is why I played this, as opposed to, 61.Kd5  The other idea was to do something, in case, Jack is to promote.",
        "61... Kg2": "As I anticipated this move since that pawn is supported.",
        "62. Rg4+": "So, I check here.",
        "62... Kf2": "And, this is how Jack gets out of it.  But, right after that combined with me being out of time (as I must get ready for work) we both agreed on a draw.  In the aftermath, we studied the variations together, and it turns out that this is, certainly, a draw.  If it had continued, I would've gone after Jack's pawn again with 63.Rh4.  Likewise, he would've defended again with 63...Kg2.  So, I'd recheck with 64.Rg4+.  And, those moves would repeat themselves and become a draw by repetition.  But, Jack said that the other way to draw would be if I did not go back and forth.  Therefore, it's what else would happen after 63.Rh4 Kg2.  In this case, 64.Nxe5 fxe5 65.Rxh2 Kxh2 66.Ke4 which allows 67.Kxe5  After which, it is a dead position which is also a draw as we're only left with the K's.  And, there was 2 games that I drawed with a dead position.  This happened before joining this website.  So, the summary is that Jack said that I went wrong by moving too quickly in the beginning which is why he allowed me to draw this game.  I agree with my coach, but he, as usual, he is not completely accurate.  Where I agree was the urge to play Nd5 too early.  The first one was 11.Nd5?? which would have left me a piece down.  And, the second instance was 16.Nd5 which would've lost a pawn.  So, he is correct in that sense.  But, what Jack did not point out was where I also went wrong.  In this case, it was 53.Rd7?  I would've had a win with 53.Kd5! as the K supports the pawn.  It also has to do with mobility since the K and passed pawn would work together to force the promotion.  Thus, while I need to take a little longer due to the opening, my assessment on mobility needs work.  I have gotten better at thinking more about it.  But, when to apply it is still shaky.  As I didn't think about it in the place where it was needed the most.  So, the real moral of this story is that mobility is one of the most important aspects in chess.  And, where to apply it is critical.  What I have learned from this game is that it's needed more in the endgame then any other phases of the game."
    },
    "url": "https://gameknot.com/annotation.pl/otb-mentoring-game?gm=63147",
    "gameName": "OTB Mentoring Game",
    "players": "Joe (1296) vs. Jack ",
    "opening": "Sicilian (B56), Venice attack"
}