{
    "moves": {
        "1. e4": "The usual.",
        "1... e5 2. Nf3 d6": "Everything was what I thought, until she played the Philidor's Defense.  I anticipated her usual, 2...Nc6, after which, I'd answer with the Ruy Lopez.",
        "3. d4": "Therefore, I stick to mainlines, in response, to this move.",
        "3... f6": "But, she, however, does not.  The most common move is 3...exd4, after which, white answers with 4.Nxd4  Because this did not happen, I take.  But, I was not going to say anything because it's not necessarily an inaccuracy.  In order for me to do so, as per ION's advice, it has to be an inaccurate or a mistake.  One thought that came to mind, however, is something that a more experienced would not have even considered, interestingly enough.  With that being said, 4.Nxe5?? also came into consideration with the idea being what you'd see if the Domiano's Defense.  But, then I recalculated, and with two pawns on both sides, that sac would not work since 4...dxe5  Therefore, I just take with my d4, immeidately. ",
        "4. dxe5 Nc6": "At first, I was going to tell her that this is a mistake.  But, I looked and realized that she can take back.  And, as noted, until it can be proven to be an error, I won't say anything because the idea is still the same of making sure that the student gets the correct information.  The only problem is that she did get the wrong info here because I forgot to count who's ahead, behind the point value.  Had this been calculated more carefully, I would've realized that she lost a pawn.  When she takes back, it appears even but 5.exd6 is +2, as opposed to, +1.  This is where the calculation was faulty.",
        "5. exd6": "The real reason for playing this, as opposed to 5.exf6 was to eliminate the doubled pawns.  I wasn't sure, if they were a liablility here.  But, when in doubt, I infer that they are since I always see Jack doing that.  However, I recently learned something in TA's thread.  Based on that, I've come to the decision that this was, indeed, the best move.  He said that the one thing you don't want is doubled pawns right in the center, as they often become problematic in the mid and endgames.  By playing this, I eliminated this.  However, had I played the other capture, and she took back, it would still be gone, but that would be by exploiting the weaker pawn.  So, I feel more comfortable with the move played.",
        "5... Bxd6 6. Bb5": "Meanwhile, I waist no time in pinning Mary's Knight.  But, it's not done just for the thrills of it.  I know that she'll break it with her next move (which is the most common method.)  And, in doing so, I'll be able to castle, right after which is the real plan behind this pin.",
        "6... Bd7 7. O-O Na5": "In general, a Knight on the rim is grim.  But, as per advise by bhidragon I'm slowly using the chess quotes less then less.  It will probably take years before they stop, all together.  This appeared to lose something, but there actually has to be proof of an error, before I say anything.  The idea is that it's still better to not do enough, then to coach too much, as per what archduke_piccolo.  When I look further, it does not, as Mary can still defend.",
        "8. Bxd7+": "Meanwhile, I decide to liquidate bishops, due to being ahead.  Now, I recently learned from TA that this isn't always a good idea just because you're ahead.  But, against players that aren't as strong, that's when they generally apply.",
        "8... Qxd7 9. Bd2": "The other logic behind the exchange is that, while Mary doesn't lose anything, it allowed this move.  Even though it gets defended, this move gains a tempo for white.",
        "9... b6 10. Nc3": "Although I lose chess terms, for the reasons noted earlier, it absolutely works here since I use that time to complete my development.  Although it's important to get out of the comfort zone, I also bear in mind what elyhim of, \"Stick with what you know.\"  The only problem with this is that it is where I got into the bad habit of digging into those chess terms to guide my play, when the more important idea is seeing the overall picture based on the story that the board is revealing.",
        "10... Ne7": "Meanwhile, Mary gets ready to castle.  She completes her development, and that gives her options on which side to castle.",
        "11. Nd5": "In the meantime, I deploy my Nc3 to a better outpost, as per Susan Polgar's advise, in terms of, strategy.",
        "11... Nec6": "I was trying to figure which Knight Mary moved since I originally recorded it as 11...Nc6  But, I remembered that one of them remained on the rim for a long while, so this is how it was played.",
        "12. Re1": "Meanwhile, I centralize my Rook.  And part of the plan is bringing the Queen right in front of it since that's what a lot of Masters and GM's play these days.  My take on this is to study what they do, as per Jack Stockel's advise.",
        "12... O-O-O": "I was shocked to see this move.  I thought that Mary would castle short, but she did it on the opposite wing.",
        "13. Qe2": "As noted earlier, I bring my Queen in front of the Rook.",
        "13... Nd4": "?? But, this is where the coaching begins.  I know that the idea was gaining tempo, but this time, she missed the overall picture.  However, it starts off with her.  I was going to mention straight away that this is a blunder because of the next move.  As anticipated, however, she says something.  Normally, I'd just point it out straight here, but OTB is different then regular.  Therefore, the idea is doing things the right things by teaching after the mistake and response is made.  The idea being is that, if I do too much, Jack Stockel will get involved, and that would completely mess up the position.  In doing so, I would not be able to annotate this game, as per what happened in a different training session with this same student.",
        "14. Nxd4": "Mary: Didn't see it.  Joe: It's important to look at everything on the board.  If I could do more without worrying too much about Jack involvements, I would.  But, there are limits.  Were this on GK, I would've done much more and, most likely, would've given Homework.",
        "14... c5": "Trying to win back a piece.",
        "15. Qa6+": "Which I prevent.",
        "15... Qb7": "As anitcipated.  So, I liquidate Queens to increase my edge.  However, this happened before Joe's advice, and I wish it were afterwards.  He said that you shouldn't liquidate Queens just because you're a minor piece up.  Instead, it should wait until you're, at least, a Rook ahead.  And, usually it's more like a Rook and minor piece.  In addition, I thought that exchanging was forced because anything else appeared to lose N or Q.  I overlooked, however, my e4.  But, even so, aside from Joe's advise, I don't much wrong with this.  Next time, however, I might hold off on the Queen exchange because of what was presented in The Deeper Chess Theory Club.",
        "16. Qxb7+ Kxb7 17. Ne6": "Knowing the advantage, I decide to fork her g7 and Rd8.",
        "17... Rd7": "As anticipated.",
        "18. Bf4": "I am interested in seeing how Mary responds to this threat.",
        "18... g5": "? This time, however, I continued my coaching.  I know that Mary wants to avoid further liquidation with what I won, but it's better then losing an extra pawn.  So, I said that better was to exchange.  And, she nodded.  By, exchange, I was alluding to 18...Bxf4, and then I'd follow up with 19.Ndxf4. ",
        "19. Nxf6 Kc6": "?? I'm not sure why she played this.  But, best was 19...Bxf4, after which I could still back.  By playing this, I'll win her Rook for N.  Now, I was going to say something, but ION told me not to be overcritical when you're winning.  Plus, I was once again, worried about Jack's involvement.  In addition, I was calculating ways that she might be able to get it back.  But, in the end, after the game ends, I tie everything in, including this mistake and an overall moral since she overlooked my next move.",
        "20. Nxd7 Kxd7 21. Bxd6": "I almost played 21.Nxg5, but this is the move that would've won back material.  And, that was also one of the reasons I didn't say anything, right away, about 19...Kc6??  Play it wrong, and she wins back a piece for pawn.  I couldn't allow that because if I'm not at the best, she isn't going to learn.  The idea is to teach chess in it's most difficult form.",
        "21... Kxe6 22. Rad1": "I could've retreated my Bd6 but decide to centralize my other Rook.  Part of the long term plan, btw, is to double up since it's generally a good idea.",
        "22... Nc6": "Now, she bring her N out of the rim.  And, knowing that it moved, this where I also figured out that 11...Nec6 was played, as opposed to, 11...Nac6  That's because in OTB chess all of that calculation is important to get the accurate recording on how it was played.",
        "23. Rd5": "Continuing my plan to double up.",
        "23... Rd8": "Trying to alleviate pressure on the d file.  But, this, however, does not help since I will double up, at once.",
        "24. Red1 Nd4": "Trying to block in one of the Rooks.",
        "25. c3": "But, my answer to this is a one move attack, to remove the guard, as per what I learned from GM Susan Polgar in the, \"Tactics for Chess Champions\" book.",
        "25... Ne2+": "?? Mary: At least, I can say check.  Joe: Yes, but you lose a Knight.  Mary: But, it felt good.  Without much more I can give, as per what ION said, there's no more advice for now.  Although the move is a blunder, I don't see any good move for Mary, at this point.",
        "26. Kf1": "26.Kh1 was also an option because Jack previously said to bring the monarch in the corner.  But, this is where I think of what bhidragon said in terms of the story that the board reveals.  That's because the overall picture is that this is the move that wins the Knight because wherever it goes, I take.  And, that's also the significance removing the guard since this actually does that in such a way that black can't avoid the further loss of material.",
        "26... Nf4 27. Bxf4 gxf4": "?? Mary thought that she won back a piece.  But, this, however, is the move I kept in mind because by playing this...",
        "28. Rd5xd8": "I get her other Rook for free.  After this capture, we discussed what to do.  Mary asked me if resignation was safe.  Normally, I'd say no since I teach my students to stay in until mate can be forced.  But, I kept in mind what Jack Stockel once outlined, and that was combined with what reversion and kenneth_fiore_3 said which is that it's safe.  So, I said yes by telling her that this is a resignable position.  After this game, we played another, which I'll annotate.  Didn't do as well and that game timed out since we ran out of time.  But, after the first one, I tied in all of Mary's mistake, including 19...Kc6??  But, it was about what boiled down those mistakes and general moral, which is how I teach chess.  And, I used what cplusplus11 outlined which was also mentioned in my third training session with reachforgoals and one of her annotations, as well as, in a couple of Edna's annotations.  In it, I told her that the lesson to be learned from this game is looking out for all threats made by your opponent.  I also outlined something based on her thought process from 25.Ne2+ based reachforgoals mistake which I saw in one of her recent annotations.  It was, don't just check for the thrills of it.  I'm sure that if Mary can remember these lessons, she will improve her play. "
    },
    "url": "https://gameknot.com/annotation.pl/otb-coaching-game?gm=61179",
    "gameName": "OTB Coaching Game",
    "players": "Joe (1350) vs. Mariann ",
    "opening": "Philidor's defence (C41)"
}