{
    "moves": {
        "1. d4": "Right now, Mr. Stockel is wants to play the Queen's Gambit, and I will accept it.",
        "1... d5 2. c4 dxc4": "This is why.  I thought that I could keep this pawn.  Why?  I believed, that I would play b5, after he played e3 to win that pawn.  Afterall, that is how I lost a team game, against id=albinim.  In that game, however, I was white, and after 2...dxc4, 3...b5 had been played.  Therefore, it became very similar to the Benko Gambit.  ",
        "3. a4": "However, he responded with this move, and told me that 3.a4 is what prevents from keeping that extra pawn.  Later on, I tried to play similar, in order to keep that pawn, but he said that it was no use.  Why?  That pawn, was gone anyhow, so it is best to just let it go.  Afterall, the Queen's Gambit is a very well known opening and many Grandmasters play this.",
        "3... Nc6": "Now, I asked him the following question.  Since you are getting that pawn anyway, should I bring out my Knight.  Afterall, this is what I would normally play, during the Queens Gambit, if the opponent tries to win back the pawn, after stopping it, with 3...b5.  He said that this move is still best, as it develops.",
        "4. e3": "Now, he told me, that if I had been able to keep the pawn, he would have played Nf3 for development, and to put on the b file.  However, this move will knock my c4 pawn, off the board.  This way, everything is even, given that I won the pawn earlier.  So, like most Queen Gambits Accepted, this is also not a true gambit.",
        "4... Nf6": "I spoke to Jack before playing this move, and he said that it was ok.  Of course, I also could developed my LSB, if I had wanted to castle Queenside.  However, he told me that it is generally safer to castle Kingside, then Queenside, as castling Queenside, often leaves the King exposed.",
        "5. Bxc4 g6": "From here on in, I cannot remember what exactly was played, but I know that some of these positions are going to be very similar to what we reviewed.  In the meantime, my goal is to fianchetto the DSB, so that I can castle Kingside, and Jack does not see anything wrong with this.",
        "6. Nf3": "In fact, his goal is the same as my goal, in this position.",
        "6... Bg7": "Now, he and I are both going to castle, on the next move.",
        "7. O-O O-O 8. Nc3": "So, he wants to kick my f6 Knight, but his DSB is blocked by my e3 pawn.  That is why it is generally a bad idea to block in your own pieces, according to Mr. Stockel, and I agree with this assessment.  However, \"There is always an exception to everything\", as id=chesskingdom64 would say, and this is one of them.  Note: In the Queens Gambit, e3 is often played.  Instead, he is going to develop his other Knight.  Right now, he wants to get the DSB, so that he can complete his development.",
        "8... Nb4": "As noted earlier, I cannot remember the exact positions, after he wins the Queen.  However, I think that this gets played, because I want to bring the LSB on f5, so that his DSB gets attacked.  According to Jack Stockel, this is my first mistake because I am bringing my Knight and position, in a place, where he can cram it.  In other words, this leaves my position vulnerable.",
        "9. Bd2": "Therefore, he decides to take advantage by continuing development, while I wasted some of that on 8...Nb4.  Afterall, he has said, \"Think about things\", and to think before you make a move.  Because there are negative consequences, to the mistakes.",
        "9... Nd3": "?? Because his DSB is placed directly in front of the Queen, I see nothing wrong with this move.  Afterall, I am trying to win his b2 Knight, but, like most games, I am not thinking ahead.  According to Mr. Stockel, this move will eventually loose the game.  Note: He is thinking about 10 steps ahead.  He shows me where this will happen.  First, he is going to win the Knight, after 10.Bxd3, and this is a move that I had overlooked.  Note: this game took place, about a year ago.  And, it happened before my annotation about overlooking moves.  In addition, he will have a strong bishop pair, and that is just the beginning.",
        "10. Bxd3 Bg4": "Now, I figure that I am going to correct some of my blunders by pinning his f3 Knight.  According to my coach, however, this is just a waste of time, as that pin can easily be broken with 11.Be2, so this is just a nuisance pin.",
        "11. Be2 Nd5": "In my opinion, that Knight has caused a lot of problems, so I just want to exchange.  However, he told me that this is another mistake because I am behind, and when you are down in material, you generally do not want to exchange, as most are just even exchanges.  So, he will exchange as this benefits his position.  Note: Right now, he is saying, \"Thing about things\".  ",
        "12. Nxd5 Qxd5 13. Qc2": "In this position, he is finishing development, and that is all he wants.  However, he wants a lot more then that.  ",
        "13... Rfd8": "So, I figured that I would give my Queen support.  However, it does not need protection because it is not hanging.  At the time, I did not realize it, so he showed what will happen in this position?  What are his intentions?",
        "14. Bc4": "Because my Queen is in a vulnerable position, he decides to attack, in the worst way, and I cannot take because his Queen is protected by the LSB.  This is what he had planned since 13.Qc2, but I did not see through because I was only thinking move by move.",
        "14... Qd6": "I don't want to go the distance, so I only retreat my Queen by one square, but this is a blunder.  Instead, why not 14...Qd7, or 14...Qc6.  They certainly would have been better then this move because he is going to take advantage of this error, with 15.Qe4, and I can't defend 15...f5, as that would be an illegal move.  At this point, I am thinking about resigning, but Mr. Stockel said, \"Don't give up right away\".  In fact, he, at one point, told me that I always want to resign.  In addition, a loosing does not necessarily mean that a game is lost.  For example, after the blunder, your opponent might make a mistake that will enable you to win or get a draw.",
        "15. Qe4 Bd7": "So, I am now forced to retreat my DSB, while he comes up with plans to win this game. ",
        "16. Ng5": "So he decides to move his Knight.  What would have happened, if he had left it there?  I would have attacked it with 16...Bg4, so that would force him to undevelop his Knight, if he was to keep it safe.  He saw through that and was not going to allow that.  I had a different idea, however.  What was it?  In addition, I do not know the other half because he has other plans, as we will find out, later on.",
        "16... Qb6": "Because I lost a Knight, earlier, I try to get something back.  Therefore, I decide to attack his b2 pawn.  However, that does not bother him because he will defend it with 17.b4.  That, however, will give him another edge.  Why?  My queen will be close to trapped, and in a very vulnerable position, after 17.b4",
        "17. b4 Qd6": "Now, the game is lost for white.  At first he did not see it, but Jack Stockel does something that I do not see.  In this position, what is he going to do?",
        "18. Bxf7+": "This is it.  He decides to place me in check, with this move.  Now, my King is exposed, and mate is almost inevitable.  After this move, he accepted resignation, by saying, \"Now you can resign\".  He said that I went wrong, when I blundered my Knight.  In other words, 9...Nd3?? was the decisive mistake.  After that, I weakened my position, and had allowed him to expose my King, like this.  Therefore, this was planned, ever since I made that mistake.  He actually showed me how he had planned that far ahead.  As he would say, \"It's not so easy\".  Once again, I do not remember the exact positions, after the beginning, because I was at a small table, so there was not enough room to take notes. However, this is related and similar to the position, after the Queen's Gambit.  This is also where he taught me that small details make a huge difference, in a chess game."
    },
    "url": "https://gameknot.com/annotation.pl/otb-coaching-game?gm=47795",
    "gameName": "OTB Coaching Game",
    "players": "Jack (about 1800 USCF) vs. Joe (???)",
    "opening": "Queen's gambit accepted (D20)"
}