{
    "moves": {
        "1. e4": "Not wanting to experiment with what I'm not used to, I stick to 1.e4.",
        "1... f6": "?! Loyd, however, responds with this move.  It's dubious and inaccurate because that f pawn is at risk.  Not to mention that he could've used that time to advance his central pawn or develop a piece.  ",
        "2. Nf3": "So, I go right ahead of it by developing in the way that I'm used to since this is characteristic when you take into account the Spanish Opening and Open Sicilian.  Better, however, might have been 2.e5 as that puts his weakest pawn at risk.  We either get rid of it by exchanging which would put him at a disadvantage.  Or, Loyd advances it which makes his position difficult.",
        "2... Nc6": "Loyd now develops.",
        "3. Nc3": "And, I continue with mine.",
        "3... e5": "Maybe, Loyd thought that I was planning to play 4.e5 and, was thus, going to stop it.  But, I cannot without losing a pawn, and should I take back, then he gets a piece.  ",
        "4. Bc4": "Figuring that his last move was a waste of time, I continue with my development.  ",
        "4... Nh6": "?! So does he, but it's right on the rim.  Now, I feel that Loyd is playing poorly and figure that I have an advantage.",
        "5. Bb5": "So, I plan to exchange his N for B because of what is about to follow.  I am analyzing a variation where exchanging is going to make it possible.  Sure enough, that variation is going to become a reality because I'm treating it, as though, Loyd played the Domiano Defense since he played 1...f6.",
        "5... Bc5": "Continuing with his development.  But, now I follow up on my plan.  For, once I exchange, I take on e5, and that is followed by a check, just like with what I mentioned being 1.e4, e5 2.Nf3, f6 3.Nxe5, fxe5, and then 4.Qh5+  ",
        "6. Bxc6 bxc6 7. Nxe5 Bd4": "Instead of taking back, however, he played this.  But, my next move is still going to be the same with the idea of exposing his K.  In fact, the K exposure was my long term plan behind exchanging on c6.",
        "8. Qh5+ g6": "Calculating this move but forgetting about my Ne5 attacked.  In this case, however, it means little if anything to me because I just take on h6.  That way, when he takes my Ne5, I haven't lost anything and, although not, as strong as, before, I still feel that I've got an advantage.",
        "9. Qxh6 Bxe5 10. Qg7": "And, that's because of this move.  As now, he must defend his Rook.",
        "10... Rf8": "With this being his only option.  After which...",
        "11. d3": "I open up a line for my other Bishop.  The idea is adding an offender to his Rf8.",
        "11... Qe7": "Which, not to my surprise, Loyd stops.  That's when I use that time to liquidate Queens due to being a pawn up.  I also could've played 12.Qh6, but I don't where that could get me.  Unlike before, I exchange since it's possible.  Normally, I'd follow Ken's advice due to being told not to.  The difference between this and a regular game is time management.  Where there more time, I would've brought my Queen to h6 because of that pawn.  But, when you don't have much time, you've got to do what you think is best based on instinct.  And, my next move came to mind.  After the exchange, I then use that time to castle since this was planned which brought me to that second variation.",
        "12. Qxe7+ Kxe7 13. O-O Kf7": "At first, I wasn't sure, but after further analysis, I determined that he played this.",
        "14. Bh6": "And, I take advantage of my opportunity to attack his Rook.",
        "14... Re8": "Which Loyd defends.",
        "15. Rad1": "But, the plan behind that attack was to centralize one of my Rooks since it is one of the things that I enjoy doing, anyhow.  That's because I learned from elyhim that centralizing a Rook is a way to maintain center control.",
        "15... Rb8": "Afterwhich, he attacks my b2.",
        "16. d4": "So, I counterattack his Be5.  The idea is that I play this move, as though, it were the Spanish Opening.  That's because I learned from reversion that, \"the c2-d4 plan\" which is c2-c3 followed by d2-d4 is a theme.  As the idea is tempo gain by attacking the bishop.  Therefore, I'm applying that same concept but through a different opening.",
        "16... Bd6": "Which Loyd protects.  Afterwhich, I protect my b pawn.",
        "17. b3 Bb4": "But, what I didn't realize is that Loyd will equalize since I'm going to lose a different pawn.  That's because Loyd has removed the guard since my Nc2 was the only thing that was protecting my e4.  Now, that I'm forced to remove it from that square, black will take go for it by nabbing that pawn.",
        "18. Ne2 Rxe4 19. Rfe1": "?? My idea behind a good time was centralizing my other Rook.  But, this is a blunder as Loyd could win my Re1 for his Bb4 with the immediate 19...Bxe1.",
        "19... Ba6": "! But, this move is even stronger, as now, he's going to, at the very, least win a piece without compensation of any sort.  It wasn't here but right after I resigned.  That is, once I had played 20.Ng3  Loyd didn't even have the chance to respond as I threw in the towel.  Just before that, Jack analyzed it and figured it out.  However, with the time crunch, Loyd said that he would've missed this opportunity because he was about to play 20...c5 which I understand.  As I made this blunder due to us almost being out of time.  After analysis, Jack, Loyd, and I all played through variations.  I resigned because of what I thought would've occurred which Jack showed that Loyd could do with an overwhelming advantage.  Given that 20.Ng3 was played, it could've continued with 20...Bxe1, 21.Rxe1, Rxe1, and white is down to a Rook without compensation.  In fact, those moves are check, so we all of us overlooked a mate that follows after which is the same, but 21.Rxe1, 21...Rxe1+ 22.Nf1 (forced) 22...Rxf1# which is more of a reason that I'm down a Rook after 20...Bxe1 since I cannot take back.  Therefore, there would've been nothing else to get out of the game.  As noted, the reason I said could've, as opposed to, would've is that, Loyd had 20...c5 in mind and told me that he would have missed that move due to the same factor that led to my downfall.  But, I did not miss it after seeing the blunders that were made.  When we were saying goodbye to each other (so about 10 minutes after this game) Jack said that next week, he didn't want to me to play against Loyd again since we're both good player.  Instead, he either wanted me or him to play against Mariann, and Jack Stockel would play against the other player.  There's no definite since things change, but it's tentative.  If, however, it becomes a reality, and I'm paired with Mariann, I'll coach her.  But, what I'm hoping for is to be paired up against Jack Stockel for another training game since I miss the, one on one, coaching with him."
    },
    "url": "https://gameknot.com/annotation.pl/otb-game-3?gm=61509",
    "gameName": "OTB Game 3",
    "players": "Joe (1356) vs. Loyd ",
    "opening": "Barnes defence (B00)"
}