{
    "moves": {
        "1. c4": "Of course, after sitting out, Jack told me that I had to play in a tournament game on Friday.  I didn't have a problem with that since my schedule is back to normal now.  So, he gave me 2 choices which was that I either play against Tom or Carl.  However, he recommended that I play against Carl since I played against him during the first game.  And, since I was white, if I were to play him, I'd be black, this time.  Mind you, that Jack is the one keeping score, and it's a very small score book.  As he isn't recording moves, but just keeping track of who won how many games, so the, overall, score to, eventually, determine the champion of the tournament.  Thus, playing against Carl makes it easier for him.  But, had he not suggested it, I would've played against this opponent for the same reason, as it just makes more sense, to me.  Also, I did get upset when he, again, mentioned that I keep losing just because of notes.  However, I recently learned that he was just joking, after I told him that I play better, as before, I lost in only 5 or 10 minutes, myself.  With that being said, he starts with the English Opening.",
        "1... e5": "Of course, I'm used to it.  First, although I had her on ignore, fiercequeen, at the time, annotated games with the English Opening, with which, I already knew that this was the most common response and actually saw that.  But, before that, charleshiggie annotated a game where I believe his opponent played the English Opening.  And, that's where I learned that this was the most common response since it's like the Sicilian Defense but in reverse with 1.e4 c5  That's why the English Opening is also called the Reversed Sicilian especially since 1...e5 is to be expected.",
        "2. e4": "In addition, this was a conditional move which I was expecting to see.  As this is a standard response to 1...e5  And, the reason it's conditional is because I was thinking to myself that if he plays this, I'll develop with 2...Nf6 which is what winds up happening, especially since e4 will be attacked.",
        "2... Nf6 3. d3": "?! But, I was surprised to see Carl defend this way.  In fact, I find this to be an inaccuracy since this will limit the mobility of his Bf1.  As it now covers one less square.  Most common here is to defend with 3.Nc3 which develops.  But, with that, I'm preparing to make my next move.",
        "3... Nc6": "And, it's by continuing with my development.",
        "4. Nf3": "Meanwhile, Carl starts developing.",
        "4... Bb4+": "And, I decide to place him in check right away.  Part of the reason is that it develops another piece in an aggressive way.  Sure, I'll be forced to retreat after his next move, to avoid exchanging, but it's worth it as I'm not forced to undevelop.",
        "5. Bd2 Be7": "Instead, I go back here to prevent Carl from being able to pin my Nf6, as he's done that kind of thing before.",
        "6. Bc3": "Thus, he attacks e5 again.",
        "6... d6": "?! And, I defend again.  But, slightly better was 6...Bd6 as this, severely, limits the mobility of my Be7.  As now, it only covers one square, but before this move it covered 5 squares which is something that I didn't take into account with this move.",
        "7. Nh4": "? But, this is a mistake that's going to cost Carl on a piece.  In fact, I don't know why he played this, as at first, I thought that he was going for an attack on his Q with 17...Bg4?  But, then, I figured out that this is unplayable because of my Nf6.  So, for a while, I was wondering what to do.  Then, I figured it out due to an oversight that I made with nuntar.  As he was playing Hope Chess in hopes that I'd play the move that I did which would give him a way.  But, I overlooked the same opportunity which was taking because of what would happen if he were to take back.  It would be liquidation while a pawn down.  And, before that, I considered and almost played 7.Bg4?! to harass the Q, but my game with Michael changed everything here.  Keeping that in mind, I combined what happened with commentary from ION, since I annotated that game, I then realized that this opportunity still exists.  And, I could use that masked battery against my opponent.  Therefore, I took on e4, knowing that I'd win pawn.  As I'm ready to grab to h4, once he recaptures.",
        "7... Nxe4 8. dxe4 Bxh4 9. g3": "Going for counterplay, Carl attacks with this fianchetto.  ",
        "9... Bf6": "Of course, I was ready to defend.  I also could've played 9...Be7  But, with this move, my B covers 4 squares, as opposed to, one.",
        "10. Bg2": "Completing his fianchetto and preparing to castle.  In fact, that's what he'll do, once I castle, myself.",
        "10... O-O 11. O-O Be6": "And, with that I complete my development, by targeting c4.",
        "12. Na3": "Not surprisingly, Carl protects, but better, I believe was 12.Nd7 since the N is on the rim.  However, this move gives his Q more mobility.  And, for that reason, this is also what I would've played, as white.",
        "12... Nd4": "But, I'm getting ready to exchange since I'm ahead.",
        "13. Nb5": "?? Carl tries to put a stop to that by playing this.  But, this loses, as he forgot that c4 is now en-prise.  And, when taking will also result in a B fork between his Nb5 and Rf1.  While that's obvious, I almost overlooked it.  Of course, I was going to play 13.Bxc4 just because it wins another pawn, but after seeing what I have, I realized that I can get a lot more which is about to happen.  Let's face it, black is now lost, if white doesn't blunder since that happened in a previous game.  But, with him moving fast, I won't allow it since I'm taking my time.  As before, I didn't spend enough time analyzing the position.",
        "13... Bxc4": "It was right here that I realized it.  As before finding out that this was a fork, I considered attacking his Nb5 with 13...c6 to also mobilize my Q.",
        "14. Nxd4": "I figured that Carl would try to defend the R with 14.Re1??, but this, however, was the right choice.  For had he played that, rather then 14...Bxf1, which is what I played, I would've played 14...Bxb5, leaving him a piece and pawn down.  But, even so, Carl isn't going to have enough compensation for lost material, this time around as I'm going to follow up with a series of liquidations here.",
        "14... Bxf1 15. Bxf1 exd4 16. Bxd4 Bxd4 17. Qxd4 c5": "And, then, I go on the attack, knowing how difficult it's become for Carl.",
        "18. Qd5": "Targeting b7 of course.",
        "18... Qb6": "I generally respond with something like 18...b6, and more often, it was something like 18...Rac8  But, then, I followed Susan Polgar's advice which was also Ken's from a famous chess quote, \"When you see a good move, look for something better.\"  Of course, the other two are good, but I thought that this was the best candidate move since I'm also attacking b2.",
        "19. b3": "I'm not surprised to see Carl defend.",
        "19... Rad8": "And, that's when I decide to centralize one of my R's as it's another way of maintaining center control, as elyhim noted in one of his more recent annotations.",
        "20. Bd3": "Completing his development, but my thought there was that it's too little too late.  Of course, I shouldn't be thinking like that as that can lead to becoming overly confident which is a good way to lose a game in a winning position.  In fact, that was also my thought process against anitam when I played the wrong move against her in a won position.",
        "20... Qb4": "But, with the thought process, I play this, as I'm going for an attack on his Ra1.  Will it work?",
        "21. Qf5": "?? It shouldn't have, but with this move, it'll do more then just work.  I know why Carl played, as this is Hope Chess.  The reason being is that he's hoping I'll make a mistake; which if that happens, he'll be able win a hopelessly lost game, with a checkmate.  That's generally the way to go when you're lost like this, but I feel that it was premature here as he might have been able to try something else since it's a minor piece, such as something like 21.a3 which would force me to think.  But, even after 21...Qc3, white has ways out.  But, with this blunder, that move will now fork and force him to lose significant material.",
        "21... Qc3 22. e5": "Threatening mate at once.  I thought about what to do, and almost played 22...Qxd3??  At the time, I didn't realize that would've allow him to pull a swindle since I would've lost my Q which is really bad.  With that being said, I didn't refrain from this for the best reason at all.  The only reason for my decision not to take on d3 is because if I take the R, he's in check which leaves me more then a R up.  And, on top of it, I can still stop the threat which will happen.  Had 22...Qxa1+ not been an intermediate check, I would've gone wrong since it would've lead to me capturing on d3, instead.  As that was the only other thing I had considered, as bad as, it sounds.",
        "22... Qxa1+ 23. Kg2 g6": "Like I said, after taking, I knew that I could stop the threat.  What I like about the only move is that it's, aggressive since Carl is forced to lose another tempo which gives me more opportunities.",
        "24. Qf6 Qd4": "And, I use that opportunity to fork his Bd3+e5 pawn, knowing that I'm bound to win more material.",
        "25. Bc4 Qe4+": "I could've taken on e5 right away but was interested in where this check.  I had anticipated him blocking with 26.e3?, but then, I'd, of course, check on c2 to win his a2 pawn.  But, once Carl makes his next move, then I'll capture on e5, at once.",
        "26. Kf1 Qxe5 27. Qf3": "I know why Carl played this as he avoids liquidation.  I wouldn't have done this since I'm going to fork and get his a2 pawn.  But, I forgot about 29.Qxb7 which prevents me from winning another free pawn, for now.",
        "27... Qa1+ 28. Kg2 Qxa2 29. Qxb7 Qd2": "I allow Carl to take here.  As I thought that after 30.Qxa7 d5 the only way for Carl to protect his B was by moving it in a passive square.  So, with 30...Bf1.  I also thought about, trying to promote my d pawn after retreating to f1.  Then, I looked at the time, of how much we had.  I was down to about 20, at that point, but he had 44 minutes.  And, I was down to 20 minutes, at that point.  First, even if I wasn't low on time, promoting might, in general lead to stalemate with what I had.  Second, I'd probably lose on time, if I focused on that since it takes me about 15-20 minutes to force a win afterwards. ",
        "30. Qxa7 d5 31. Bb5": "But, I overlooked this move.  However, this was a good time to overlook something because it took my focus away from promoting.  That's a good thing because of the thing I mentioned, and believe it or not, the time was also what did it.  I knew what would happen, so then, I focused on something else.  I'm now thinking about how I can confine Carl's K to the corner where he won't get out which I mentioned in some of Erika's annotations, as well as, during one of Eric's annotations.  The idea is that when you're ahead like this, one should focus on using what he or she has to force the win.  ",
        "31... Qb4": "So, I started with this move since it forks.  It's not effective, but once Carl protects with 32.Ba4, I'll deliver a series of checks, until white has no way out.  As I realized that this was the way to confine his K to the corner here.",
        "32. Ba4 Qe4+ 33. f3 Qe2+ 34. Kh3 Qf1+ 35. Kg4 f5+ 36. Kg5 Qxf3": "I didn't take to win the pawn, but rather to force a checkmate.  As now, no matter what Carl does, mate is now forced.  And, Carl knew that but was determined to try one more thing which will result in the same thing.",
        "37. Kh4 Qg4#": "After this game, we analyzed a little which is typical after a tournament.  Carl said that once he let a pawn go, it was game over.  By that, he was alluding to 7.Nh4?  I agreed then because that's how I thought as after you lose material back, there's no way out.  That, however, was only the start but not where he went wrong.  His decisive mistake was 13.Nb5 which allowed me to capture a pawn and fork his R+N, from which, there was no out.  I adjusted to taking note which also means that I was not going to miscalculate, as I did during my first annotation of these tournaments.  Instead, I was going to pause, a little, take my time, and find the best follow ups to prevent Carl from getting counterplay and having the slightest chance of a swindle.  BTW, it's back to normal because Master Nathan wasn't there which forced Jack to play against Ted.  When it was over, Coach Stockel asked how we did for this game because he needs to know for score keeping.  And, when I told him that I won this game, he said that it's now become interesting.  The reason being is that it was my first game that I won for the tournament after losing the previous two.  But, the cornerstone, which was before Carl's decisive mistake was by remembering where I went wrong against nuntar.  As I kept the masked battery in mind which I used to my advantage, and that was followed by, remembering that I had a powerful fork (which I almost overlooked) after his losing move."
    },
    "url": "https://gameknot.com/annotation.pl/otb-tournament-game-4?gm=66020",
    "gameName": "OTB Tournament Game 4",
    "players": "Carl  vs. Joe ",
    "opening": "English opening (A20)"
}