{
    "moves": {
        "1. e4": "I start of with my usual.",
        "1... Nf6": "And, he plays the Reti defense which threatens to win a pawn.",
        "2. Nc3": "So, defend, whilst, develop.",
        "2... e5": "This could transpose into the Four Knights opening since I will play 3.Nf3.  That, however, would happen, if he played 3...Nc6",
        "3. Nf3 Bb4": "But, it does not since this is what's played, instead.  Not giving it a lot of thought, I take.  In this context, I forgot to calculate more then one variation which is a big no no.  It looks like white is going to win a pawn, but that was due to me forgetting about 4.Nxe5, after which, a piece and pawn is exchanged.  However, it's not a bad position yet, since those doubled pawns are of no real asset to white, yet.  In other words, I'm not worried about them, yet, based on what TA outlined with doubled pawns in the beginning.  ",
        "4. Nxe5 Bxc3 5. bxc3 Nxe4 6. Bd3": "? Not knowing exactly what to do here, I attack his N.  What I didn't realize is that, it's a mistake as he should win a pawn, and it blocks a center pawn needed to control the center.  I say that because of what will occur later on.  Best was 6.Qe2 to pin his Ne4. ",
        "6... Nxf2 7. Qf3": "Realizing that my Rook was en-prise and not thinking hard about what to do (because of the time crunch), on top of, not being able to castle and being a pawn down, I play a move that's unsound and easy to drive off.  It's actually similar to a cheapo tactic but for coaching purposes since I don't want the game timing out, either.  And, yes, as Ken noted with one of Jeff's annotations, \"Shutting down a kibitzer\" it's very easy to drive off.  But, this, unlike other games with the time crunch, is where I use TA's strategies from his blitz Q sac (where Joe gives up his Q by the second or third move and wins) to test Perry and see if he finds the best.  In other words, it's another example of where I use Joe's method to teach chess.  What he plays is what I thought he'd do, but this is where I coach since his next move is going to cost him the game.",
        "7... Nxh1": "?? As Perry takes the Rook which I don't need, afterall.  And, he asked, \"what is your plan now?\"  In other words, he was implying that my last move was a blunder but the approach was wrong because of what follows which is why I gave him this.  So, I said, I figured that you'd take the Rook.  Then, I play my next move which is mate.",
        "8. Qxf7#": "Then, he said, \"I shouldn't have asked.\"  But, this is where I explained where he went wrong.  I told him that I gave that Rook for a reason.  In this case, my Knight and Queen worked well together to deliver the mate.  He said, \"Oh, I see that.\"  Then, I said that taking is what allowed me to do it.  Better was to protect with your Queen.  By that, I meant that best was 7...Qe7, as now, my N is pinned, which compromises my position, instead.  Even if 7...Qe7, 8.Kxf2, he can still take back with 8...Qxe5.  Not only doesn't he lose anything, but I remain a pawn down.  So, I explained that the lesson to be learned is, \"to take is a mistake\".  Therefore, it's not a good idea to take something just because you can.  Instead, ask yourself what danger allies ahead, and if I could mate afterwards, like this.  As sometimes, there is a very good reason for giving something away, like an immediate mate or win of material.      "
    },
    "url": "https://gameknot.com/annotation.pl/otb-coaching-game?gm=61624",
    "gameName": "OTB Coaching Game",
    "players": "Joe (1333) vs. Perry ",
    "opening": "Alekhine's defence (B02), Scandinavian variation"
}