{
    "moves": {
        "1. e4": "I start with my normal.",
        "1... e5": "As does Tom.",
        "2. Nf3 d6": "But, this is where he deviates from his usual.  As Tom's main move is 2...Nf6 with which I play the Guaco Piano.  But, he changed things up, presumably, to take me off guard.  But, I know how to respond the Philidor's Defense, quite well.",
        "3. d4 f6": "?! Instead of exchanging right away with 3...dxe4 which is the main move, he played this.  The problem is that I can and will take advantage of this starting with my next move.  ",
        "4. dxe5": "What I kept in mind is that if Tom played 4...fxe5 then it could and would become something just the Domaino's Defense, as I'd answer with 5.Nxe5 to prepare for 6.Qh5+ should he recapture.",
        "4... dxe5": "For a short while, I was wondering what to do and thinking about it.  But, then, I remembered GM Susan Polgar's lecture about taking someones right to castle away from them.  Her example was when you exchange Q's, and it occurred in this identical position.  As it started with the Philidor's Defense and with 3...f6 right afterwards.  Susan noted that revoking their castling rights gives you the advantage.  ",
        "5. Qxd8+ Kxd8 6. Bc4": "With that being said, I take advantage of the fact that he can't castle by continuing my development to prepare for castling.  And, I'm already feeling happy about my position because of this.  Of course, I still have to be cautious and not become overly confident or underestimate Tom because of my game against anitam which, believe it or not, I keep in mind for this game.",
        "6... Nh6": "Wanting to develop his N and not in a place where it's mobility is limited like on e7.  But, what I'm keeping is that a N on the rim is my dim.  And, by playing I feel that my advantage has increased a little more.  In fact, I could even double his pawns by exchanging on h6.  But, I decided against 7.Bxh6 because I'm not ready to exchange, just yet since it's still even, in terms of, material.  So, I'm very picky about when to exchange based on my lesson with Ken.  Thus, I go right into things by castling which was the logic behind my last move.",
        "7. O-O Bd6": "Continuing with his development.  But, I was asking myself if Tom had a weakness, and I realized that it was the same B since I can now pin it which I'll do.",
        "8. Rd1 Nd7": "Unpinning it.",
        "9. Be6": "?! But, this is where I get a little carried away.  As my focus was trying to keep a pin of some sort on him, even if, it was only a half pin.  But, Tom's next move is where I get into a little bit of trouble as I'm gonna be forced to exchange his Bad Bishop for my Good Bishop to avoid loss of material.  Of course, I moved a little too fast here since I was thinking that this was the very first move that occurred to me.  In fact, the only other move that I had taken into consideration was 9.Bb5, but Tom wouldn't have hesitated to block that with 9...c6 or 9...a6",
        "9... Nc5 10. Bxc8 Rxc8 11. Nc3": "Knowing that my e4 pawn was still en-prise, I protected this way to keep his Bd6 pinned.  And, it pays off because of something that's about to happen.",
        "11... c6": "?? And, it's right here.  I know why he played this, and his instincts were correct that if he didn't, I would've answered with 12.Nb5 which hits a7.  And, after 12...a6, I wouldn't hesitate to play 13.Nxd6 exchanging and winning a pawn.  But, this is a lot worse, as at first, I was thinking that I was in trouble and didn't know what to do.  Then, I realized that Tom left his B en-prise, since it was protected before this move.  In return, that allows me to win a free piece which is going to happen on my next move.",
        "12. Rxd6+ Kc7 13. Rd1 g5": "Preventing liquidation, for now, since my intention was, in fact, 14.Bxh6.",
        "14. Be3": "So, I switch my focus to the other N since it's also on a dark square.  But, it's more then just that, as I knew that Tom would protect.  And, when he does, that's when I take advantage of being ahead by liquidating.",
        "14... b6 15. Bxc5 bxc5 16. Na4": "And, that's when I go after his pawn which will also fall, sooner or later.",
        "16... g4": "But, Tom does what he can for counterplay by going after my Nf3.  He's hoping that I'll blunder which would allow him to equalize.  Unfortunately, other examples like this have happened before, but not before.  So, I protect, first, and as with my games against Ken, I'm interested in how Tom will handle 17.Nd2.",
        "17. Nd2 f5": "As he could've tried with 17...Kd6, but I would've answered with 18.Nb3+ and after he gets out of check, then I'd take on c5.  But, with this move, I'll do so, at once, and when he takes, I'll recapture in such a way that my crammed N will become centralized and on an even stronger square then my Na4.",
        "18. Nxc5 fxe4 19. Ndxe4 Nf5": "Bringing his N to a better square, but it no longer matters because of what happens.  And, it's something that I kept in mind during a game that I should've won against anitam but lost with this blunder.  And, the very first thing I remembered was ION's note which is also why I captured with 19.Ndxe4, as opposed to, 19.Ncxe4.  Well, the reason was to use the R, but it would've been for the wrong reason.  But, having said that, capturing with 19.Ndxe4 also led to me playing the right move.",
        "20. Rd7+": "That's because one move is where I went wrong against anitam and lost.  But, had I promoted, right then and there, I would've had her in check with the Knight behind it; as opposed to bringing the N back which enabled her to promote and, at least, drawn a lost game.  And, I saw how the right move would have won.  The same could be said here, but instead of it being a Q, it was a R, but it'll do the same thing that I should've done in the other game, as I converted the equation since it adds up to the same thing.",
        "20... Kb6 21. Rb7+ Ka5 22. Rxa7+ Kb6 23. Ra6+": "And, now, I'm going for mate, but it wasn't clear cut how, knowing that he could answer with 23...Kc7  Had Tom played that, I would've had a difficult figuring out what to do.  But, with this move, it's very easy.",
        "23... Kb5 24. a4+ Kc4": "And, had Tom played 24...Kb4, which is what I had anticipated, I would've answered with 25.c3+  But, my next move does the same thing.",
        "25. b3+ Kd5 26. Rd1+ Nd4": "Since Tom's N is pinned, I considered and had almost played 27.c3!  As that would've won a piece for pawn.  It took me a minute or two to figure out that 27.c4# is mate since his K has nowhere to escape.  And, upon that, I played it right away.",
        "27. c4#": "Upon winning this game, Jack asked me how much time and if Tom moved too quick.  I said yes, since he had 42 minutes left.  But, I looked at my time and realized that it wasn't way too much, when you consider that I had almost as much.  Of course, Jack complimented me again by saying that I was improving.  To an extent, he's right, but I don't know by how much.  And, I don't want to sound too pompous because with Ted not being in the tournament, Jack, generally doesn't look at our game or the final position.  Instead, he only goes by who won or lost.  A month or two prior when I lost and didn't have a lot of time left, he implied that I was making too many mistakes and not learning from them.  When, I told him that I didn't have much time left, and thus, taking my time, he said that it was good that I was doing that.  But, I still shouldn't be losing that many games.  For me winning isn't everything, and I always learn with ION.  Upon saying that I improved, Jack also told me that he didn't understand Tom since my opponent takes his time against stronger opposition, but he rushes in a tourney.  I could relate to that with the oversight that costed him a piece.  Nonetheless, I appreciate the compliment from my coach."
    },
    "url": "https://gameknot.com/annotation.pl/otb-tournament-game-1?gm=66591",
    "gameName": "OTB Tournament Game 1",
    "players": "Joe  vs. Tom ",
    "opening": "Philidor's defence (C41)"
}