{
    "moves": {
        "1. e4": "Like me, this is also how Perry opens.  So, I stick to my usual.",
        "1... c5 2. Bc4": "Until he plays this.  But, I felt that Perry's goal was to 3.Nf3, and then followed by 4.Bb5 or 4.Nb5",
        "2... a6": "So, I put a stop to that.",
        "3. Nf3": "Continuing with his development.",
        "3... d6": "And, I play it, as though, it were a transposition of the mainlines.",
        "4. Nc3": "Meanwhile, Perry develops another piece.",
        "4... Bg4": "And, I start developing by pinning his Nf3.",
        "5. d4": "I was a little surprised to see this played.  As white, I would've broken the pin with 5.Be2.  By playing this, I've got no problem exchanging here because his Queen is forced to come out early.  After which, I can cause damage.",
        "5... cxd4 6. Qxd4 Bxf3": "So, why did I exchange here?  That is the question.  Normally, I would not and am usually not ready.  But, the reason I did it here was to make it unsafe for Perry to castle immediately.  Castling short means that his King will become exposed since he must be double up his pawns near where one castles.  In addition, after he takes back, I will use the opportunity to harass his Queen.",
        "7. gxf3 Nc6 8. Qd5": "As anticipated, he is targeting my f pawn.  Although 9.Qxf7+ is not mate, black would wind up in rough shape because the weakest pawn is removed from the board.  In the process, my K would wind up vulnerable to exposure.  So, I asked myself what to do here.  I wanted to continue to punish his Queen with 8...Nf6, but it won't cut the mustard this time.  However, I found another way to harass it.",
        "8... e6": "And, it's with this move.",
        "9. Qh5 Nb4": "As now, I threaten the N fork.  Of course, I'm not surprised that he stops it.  I knew that the Rook can easily by protected, but his c2 pawn is trouble.",
        "10. Rb1": "? But, this is the wrong way to protect it.  Best for white would've been 10.Bb3  By playing this, I will harass his Queen again, before taking on c2 with check, as planned.",
        "10... Nf6 11. Qh3 Nxc2+ 12. Kd1": "I anticipated this move.",
        "12... Qc7": "Instead of retreating, I hit his Bishop.  This is a time where my aim is to exchange pieces since, at the time, I thought it was liquidation due to being a pawn up.  Now, if it were completely even, I would've just retreated.  But, in this case, it is the wrong decision because I overlooked a move which gets the pawn back.  Therefore, thinking about the liquidation was the wrong approach, and as with my second game against Ted last week, combined with previous games, this is not the right choice since I could have used my Nc2 later on.  What it means is that I have to give things more thought before I decide that it's liquidation.  That's especially because my resignation against teardrop34 was premature as I thought that my Queen was trapped.  But, there is one move that would've saved it.  Which means that even though I've improved on it, there's a still lot more room for improvement with being patient.",
        "13. Bxe6 fxe6 14. Kxc2 g6": "? Knowing that this wasn't the right choice, I fianchetto because I like those nice long diagonal's for my Bishop.  However, this is a blunder.  That pawn was protecting my Nf6.  By playing this I should've lost a pawn  Afterwhich, I'd be in trouble.  However, he will get the opportunity to win my pawn, anyhow. ",
        "15. Bg5": "Trying to put pressure on my Nf6.  But, best was 15.Qxe6.  Of course, that opportunity remains, and Perry is going to play that.",
        "15... Bg7": "And, the idea behind was more then just completing the fianchetto.  Taking on e6 no longer wins a piece.",
        "16. Qxe6+ Qe7": "The reason for interposing with my Queen is because if I was to use my King, it would not be possible for me to castle.  So, I'd like to keep that option open.",
        "17. Qc4": "Not surprisingly, Perry refuses the exchanges which is not what I had in mind.  Instead I accomplished my goal which is that in order to decline, Perry must run back.  Afterwhich, I reattack.",
        "17... b5 18. Qc6+": "But, I had overlooked this.  As now, I must get out with the K in order to avoid losing my Rook.",
        "18... Kf7": "Perry: hmm, that's pretty good.  Joe: I was in a lot of trouble and trying to figure out what to do.  Perry: Let's see what happens here. ",
        "19. Nd5": "Which is when Perry decides to harass my Queen.  But, I am not bothered by this.  However, I am not ready to exchange yet, but realize that there is no way out of it.  In the process, I feel that I'm in a little bit of trouble since I could use my Nf6 later on.",
        "19... Qe5": "Rather then take, I try to delay what's coming, but it's no use.  It is now that I just being what to do to get out of the situation.  But, I don't have to wait too long, though.",
        "20. Nxf6 Qxg5 21. Qd7+": "I don't like this situation because exchanging benefits white, as noted, earlier.  And, there is no way to avoid it.",
        "21... Kxf6 22. Qxd6+ Kf7 23. Rhd1": "Perry centralizes his Rook behind the Queen which is generally a good strategy.",
        "23... Rac8+": "Since I'm trying the man, as opposed to, the board as ION puts it, I decide to throw in a check, in which, the next move was anticipated.",
        "24. Kb3 Qf6": "The only thing that I don't mind exchanging is Perry's Queen because that's what's making his pieces stronger then my pieces.  If I can do that, all of the problems that I had after being forced exchange before will end.  So, I am seeing what can be done to take off his Queen.",
        "25. Qd7+": "Of course, he declines with this check.",
        "25... Qe7": "So, I offer the exchange of Queens again.",
        "26. Qd5+": "And, Perry tries to decline again.",
        "26... Qe6": "But, this time, I got the lucky break by tricking Perry since his Queen is pinned.  Now, he will be forced to exchanged, after which, I can strengthen my Bg7.",
        "27. Kb4 Qxd5 28. exd5 Rc4+": "After which, I use my pawns and Rook to deliver this check.  And, when he gets out, I deliver another check with my Rook.  As now, I feel confident that I might be able to win the game.  Of course, I am not going to underestimate him because, if you do that, it can turn a won game into a loss.",
        "29. Ka5 Ra4+ 30. Kb6 Bd4+": "As now, I use my Bishop to check him.  And, the more this happens, the happier I feel about my position.  That's also because I'm keeping in mind that he can't take my B without losing the R.  ",
        "31. Kc6 Rd8": "As now, I target his pawn.",
        "32. Rbc1": "? Going for a nasty check since he can move the K and then check with Rc7+.  But, Perry overlooks what's coming next, as now, I'm going to even out the game by taking his pawn on b2. ",
        "32... Bxb2 33. Kb6": "?? I'm not sure why Perry played this, but much better was to get the Rook out of harm's way.  And, with it, not earlier, but right now is where I know for a fact that I can win this game.  And, that starts with my next move when I take on c1.",
        "33... Bxc1": "Perry: Oops, I made a mistake.  Joe: Yes, you did.  Perry: After having had played 32.Kb7, I knew that this was going to come.",
        "34. Rxc1 Rxd5 35. Rc7+": "Doing what he can for counterplay, Perry checks here.",
        "35... Ke6": "? I miscalculated and had Ghost Vision here.  I thought that this was white's Rook on d5, in which, he would not have been able to take on h7.  With that being said, best was 35...Kg8.",
        "36. Rxh7 Rd2": "But, after taking, I go after one of his pawns, knowing that one will fall since one of them is confined to f2, and one is lost because of my Ra4 due the high level of mobility with my position.",
        "37. Rh6": "Doing what he can, Perry, ties to stop my pawn.",
        "37... Kf5": "And, I get my King into action.",
        "38. h4": "Doing what he can to stop that pawn from advancing, Perry plays this.  But, I grab his a pawn first.",
        "38... Rdxa2 39. h5": "Still trying to stop me.  I could exchange it with the Rook.  But, I thought why exchange, if there's a possibility of getting this for free.",
        "39... Kg5": "So, I attacked his Rook.",
        "40. Rh7 gxh5": "This is where I decide to take, though since my K stops him from taking back.  And, his other pawns are of no concern to me because I can and will stop them, as well.",
        "41. f4+": "Doing what he can for counterplay, Perry throws in this check.",
        "41... Kg6": "And, I attack his Rook.  Once he retreats, I'll take another pawn.",
        "42. Rd7 Rxf4 43. Rd6+": "Still does what he can.  So, I get out, by adding a defender to one of my passed pawns.",
        "43... Kg5 44. Rd7": "Perry plans to deliver check.  It'll happen, but not before I push another passed pawn.",
        "44... b4 45. Rg7+ Kf5": "So, I move right behind the Rook.",
        "46. Rh7": "And, he attacks, so I exchange again.",
        "46... Rfxf2 47. Rxh5+ Kg4": "As in the process, his Rook is attacked.  ",
        "48. Rh6 b3": "This is where I finally realized that even if Perry can get his down, there's no way to stop a promotion, as the pawn is too dangerous.  But, I just wanted to be careful because if I kept pushing with his Rook, there was a possibility of him getting all of my passed pawns which the idea is avoiding.  But, now that he doesn't have pawns left over, I'm confident about promoting, at the very least.  However, that is not before it takes a different turn for the better.",
        "49. Rg6+ Kf5": "As I attack his Rook again.",
        "50. Ka7": "Up until this move, it was exactly how this game was played.  But, in the game, Perry moved his Rook somewhere.  What I had recorded was 50.Rxa6 which isn't playable.  Right after the variation, white resigned for the same reason.",
        "50... Kxg6": "That's because in the unplayable variation, after 50.Rxa6 came 50...Rxa6 and then 51.Kxa6  In this line, I had exchanged a pawn and a Rook for his remaining Rook.  Right after which, he resigned because there was nothing left.  So, instead of trying to get it exact I decided to make it look like he blundered the other Rook, as that, more or less, results in the same thing.  As black does get the remaining Rook leaving white with nothing.  Perry: I think I should resign.  Joe: I agree.  The idea being is that in the game just like with the diagram, my next move would be the same which is 51...b2.  After which, I'd promote the b pawn with no way for Perry to stop it."
    },
    "url": "https://gameknot.com/annotation.pl/otb-chess-game?gm=62462",
    "gameName": "OTB Chess Game",
    "players": "Perry  vs. Joe (1316)",
    "opening": "Sicilian defence (B20)"
}