{
    "moves": {
        "1. e4": "As usual, I open with the King's Pawn Opening.",
        "1... c5": "And, he generally responds with the Siclian.  My coach has said that this is the most common defense.",
        "2. Nf3": "Like always, this is going to be an Open Sicilian.",
        "2... d6 3. d4 cxd4 4. Nxd4 Nf6 5. Nc3 a6 6. Bd3": "Until recently, I responded with 6.Bc4, pinning f7 as noted in my last annotation.  However, Master elyhim said, \"Current theory favors to wait until black commits to e5 before playing this move. Because now balck can simply play ...e6 with no problems\", in his comment.\r\n",
        "6... g6": "So, he is getting ready to fianchetto his DSB.  I'm not sure, if this is the right choice.  On the one hand, as mentioned before, I am a little disappointed with this move because I have been told not to fianchetto, unless it is abolutely needed to develop.  On the other hand, this might be the only way for Jack to develop his bishop, without cramming it.  If he played 6...e6, then ...Be7 would be the only move for that piece, after which blacks position does not appear as strong.",
        "7. Bg5": "That, however, does not bother me because I simply attack his N in order to castle on move 8.  Note: After this game, I learned an important lesson by watching a video from GM Judit Polgar.  It happened after her win against world champion, Aronian, when she surpassed Bobby Fisher's rating, believe it or not.  And, this is something that some of the commentators and I have disagreed on for a while.  But, what she said, supports my theory.  What is that?  In chess, you want to, \"complete development by castling\", and that's what I'm determined to do.",
        "7... Bg7": "In the meantime, he Fianchetto's, as I mentioned on his last move. ",
        "8. O-O": "And, as noted on my last move, I castle.  In addition, I am more developed which gives me an edge, at the moment.  In fact, my coach said, \"Oh, I better get my pieces out.\"",
        "8... Nbd7": "So, my opponent starts by bringing out his N.  This is not a bad move, but if I were black, I would have played 8...Nc6, instead, because this move blocks his LSB so that he'll have to waist time in order to get it out.  ",
        "9. Qf3": "?! Because most of my pieces are active, I decide to bring my Queen out.  BTW, I am not attempting cheapos, so what is my plan?  Simple, I want to connect my Rooks and complete development.  Now, in a different annotation, bwaa said, \"As cdeburca said and as others have said repeatedly in other annotations, having your Rooks connected is not necessary to control the center.\"  I disagree with this assessment.  In her game against Anand, Judit had to connect her Rooks in order for that to happen.  However, this is my first inaccuracy and waste of time because of where I place my Q.  In this position, best was either 9.Qe2 or 9.Qd2.  With this move, however, he will attack my piece with 9...Ne5 which will ultimately lose tempii.",
        "9... Ne5 10. Qe2 Qb6": "After my retreat, he decides to hit my N and b2 pawn.  However, Jack told me that this was not his best move, but 10...Qa5 was.  ",
        "11. Nb3": "That's probably because if I had then attacked his Q, he would simply win material or threaten mate.  But, I do not remember the exact reason.  In addition, I also forgot how he would do this.  I actually wanted to protect with 11.b3??, but that loses a Knight.  In the game, I was a little pessimistic due to distractions, as mentioned in the Intro.  So, I told him that I had no choice but to a lose a pawn or piece.  Then, he asked, \"What's wrong with this move?\"  I looked at the board and I said nothing.  In other words, I figured out that this is best as it protects all of the above.",
        "11... Bg4": "In the meantime, he decides to reattack my Q.",
        "12. Qd2": "But, that is not a problem, this time.",
        "12... Be6": "But, he also retreats a piece.  That's because my opponent knows that if he leaves his B out anylonger, I will eventually win it after 13.f3.",
        "13. Rae1": "Therefore, I decide to play this move as it brings my Rooks together.  Note: It's not necessary, but this is generally what you want to do.  BTW, this is what GM Judit also did in her game.",
        "13... Bxb3": "In the meantime, he decides to take my N, but that does not bother as I will simply recapture.  Therefore, it will just become an even exchange.",
        "14. axb3 Rc8": "At this point, he decides to move his a Rook here.  Why?  It puts pressure on the c file.",
        "15. Be3": "In the meantime, I bring my DSB back to attack his Q and strengthen my bishop pair.  I believe that if he can put pressure on my c file, I can put pressure on Glenda.  In other words, \"Two can play that game\", as they say.",
        "15... Qc7": "But, Mr. Stockel will have none of that.  Instead, he will increase the pressure.",
        "16. Bd4": "That, however, is not a problem because I strengthen my bishop pair even more.",
        "16... Nxd3": "So, he does not waste time to take my LSB.",
        "17. Qxd3": "Now, I had the option of taking back with my c pawn or Q.  I was originally going, however, to capture with the pawn.  Mr. Stockel said that it is not a great idea.  Why?  Taking with the pawn loses coordination and a pawn, due to my doubled pawns.  He said that with doubled pawns, coordination and details are even more important, which is why you usually want to avoid doubling your pawns.  For me, I don't necessarily agree with this because if I took back with the pawn, I could probably win more material.  In this case, I actually agree with cdeburca that there is more to chess then just doubled pawns.  But, with Jack, I can only go by what he lays out since this opponent is my coach.",
        "17... O-O": "After my last move, he castles Kingside.  Now, no one is ahead or behind in development because both sides are completely developed.  After this move, the game is paused for about an hour as Tom, the other member, shows the game while we analyze it.  And, what he teaches is very important.  He played an interesting game, and his opponent does not develop properly.  In fact, he brings out his Queen by something like move 4 or 5, before most of his other pieces are developed.   He also blows away his chance to castle, until it's too late.  In fact, he gives away a piece by castling Queenside.  Why?  This opponent knows the player, so he wants to throw Tom off guard.  But, that plan backfires.  However, the game is nowhere near over.  Tom makes a mistake that could have ended the game in a draw, as opposed to, a win.  Because he underestimates his opponent.  Ok, remember when I showed everyone my game against amnita, and that I lost a winning positon by underestimating her?  The same thing could have happened here.  As it turns out, that moral of, being careful in a winning position is derived from the facts.  Those facts are based on what Jack Stockel and GM Judith Polgar have said.  That is, \"It's not so easy\".  Positions are a lot harder then they look, and you must be cautious because if you don't handle things carefully, you can lose even if you have winning advantage.",
        "18. Rec1": "When the game resumes, my goal is to take pressure off of the c file.  This move does that.",
        "18... Qb6": "Because Jack is distracted, he decides to attack my B, but I fail on multiple occasions to take it for the exact same reason.  In fact, it is also a reason why Jack lost to Tom.  That's significant because in the past, Mr. Stockel has not been able to finish a game against the other member since Tom has to leave a little early.  And, they are usually left with an interesting position.  Not this time, his coaching also distracted him from that game, as well.  ",
        "19. Nd5": "So, I am hoping for an exchange which will happen, but best was actually 19.Bxb6 because of what I just mentioned.  That move, might have won, but it's difficult to say.  Here's the thing, winning the Q does not=an automatic win.  In that, it's another example of where you must be careful with overconfidence.",
        "19... Nxd5": "And, I am thinking about what to do next in order to avoid falling behind.  Why?  If 19.exd5, I am a piece down after 19...Bxd4 because if then 20.Qxd4, 20...Qxd4.  That is something that I am not going to allow.  However, the immediate 20.Bxb6 was still feasible.  Instead, I play something that just might end the game in a draw, 20.Bxg7.  We then exchange for the next two moves, until everything is even.",
        "20. Bxg7 Kxg7 21. Qxd5 e6": "After the exchanges, he decides to attack my Q.",
        "22. Qd4+": "?? But, that does not bother me because I just place him in check.  However, I missed the fact that this is actually a horrible move that should have lost the Q.  This is what's meant when I say that we both overlooked important details.",
        "22... e5": "Instead, he reattacks my Q.  Now, I miss an opportunity to take it.  Instead, I embed my Q with the e and d pawns.  In other words, I respond with 23.Qd5, in order to put pressure on the d file.",
        "23. Qd5 Qc6": "And, white decides to attack my Q because Mr. Stockel wants to exchange.  I am determined to give that to him but not before I advance my c pawn.  Why?  To connect my c and b3 pawns.  ",
        "24. c4 Qxd5 25. cxd5": "I also could have taken with my e pawn, but I like this move better.  Why?  I played this in order to exchange one of our Rooks.  Since no one is ahead, I can't go wrong by exchanging material.",
        "25... Rxc1 26. Rxc1 Ra8": "If I were black, I would have played 26...Rb8, as it defends at least one square.  With 27.Rc7, I will attack two squares and pin his f7 pawn, in this position. ",
        "27. Rc7 b5": "? So, he advances his b pawn, but that does not matter because his f7 pawn remains pinned.  In fact, this move is a mistake.  Why?  He loses a pawn momentarily.",
        "28. Rc6": "It starts with this move.  Afterall, he cannot defend d6 and a6, in this position.",
        "28... a5": "So, he chooses the a file.  This mean that his d pawn is gone on my next move.",
        "29. Rxd6 a4": "In this position, black is hoping to exchange.  This time, however, I will not accept it immediately, but that will change shortly.  Here's the thing, if 30.bxa4, 30...Rxa4 and black has a passed pawn.  That is something that I am not going to allow because one passed pawn is often enough to win.  It almost falls into the same category as having an extra pawn or blundering away a pawn.  Therefore, I decide to play 30.b4 to prevent this feasibility.",
        "30. b4 a3": "He, however, still wants to exchange.  Because I prevented the passed pawn, I will now accept theexchange on a3, especially since I'm still ahead.  ",
        "31. bxa3 Rxa3 32. g3": "At this point, I was thinking and had, at one point, played 32.Rb5.  Why?  Because I wanted another pawn.  But, this is where, \"It's not so easy\".  There was a mate threat that I had missed until my coach said something.  He asked, \"can you see the threat\"?  At first, I didn't see it, but then I spotted and told him.  I said that if I captured, you would get a back rank mate on a1.  So, I told him that this is my only move, and he said, \"That's right.\"",
        "32... Ra4": "Either way, I know that I cannot defend b4, so everything will be even again.  Therefore, I am going to bring my K out.  When I defend against mate like this, I generally activate the King.",
        "33. Kg2 Rxb4 34. f3": "After he takes, I decide to connect my pawns, in an attempt to promote.  Of course, that's never going to happen, but this is a very interesting position.",
        "34... Rb1": "But, he also intends to promote which is why I played this.  Note: Rooks generally protect pawns, when it comes to promotions.  I learned that from this same opponent, a few months ago.  I think this happened in December of 2011 but am not completely sure.",
        "35. Rb6": "In addition, I also learned that a R right on top of a P generally prevents a promotion.",
        "35... Kf8": "I do not know why he played this.",
        "36. d6": "But, I am still determined to promote.",
        "36... Ke8": "And, he is just as determined to prevent that.",
        "37. Rb7": "At this point, I still want to make a Q, but in a very interesting way.  As chesskingdom64 once annotated, a R on the seventh rank can be very powerful.  I now see why, and I kept that in mind before moving here.  Unlike before, when I play 37.d8+, it will no longer be feasible for black to respond with 38...exd7 because of this move.  Therefore, he'll have to move his K very carefully to prevent a promotion.  Note: I also know that he will not allow a promotion, so why do I play this?  Like my game against youthanasia, where I actually played poorly, I am trying to make my opponent think.  My main goal is to give him another run for his money.  I already did this in a different game, and I am trying to make history repeat itself, eventhough it's in a different way. ",
        "37... b4": "In the meantime, he still wants to promote, but I will not allow that.  Instead, I am going to place him in check, as noted on 37.Rb7.  I also could check him with 38.Re7+, but I don't like that as well because there is not as much pressure on the K.  BTW, before I played this, I asked Jack if 38.d7+ or 38.Re7+ was better, and he said, \"it dosen't make a difference.\"  In this position, I am trying to put as much pressure on the K as possible.  That way, he really has to exercise his mind.  Note: This is all for cognitive reasons because psychology plays an essential role in chess.  If he really feels the pressure, I will certainly come out stronger, in the end.  Afterall, this is something that gives me optimisum in my games.",
        "38. d7+ Kd8": "In this position, his only other option was 38...Ke7, but then I promote right after 39.Rb8.  So, I basically achieved my goal, of making him think real hard about the position.  Note: He did take some time to come up with this move.",
        "39. f4": "If I can't promote, I will simply force an exchange especially since I am not behind.",
        "39... exf4 40. gxf4 b3": "He still wants a promotion.",
        "41. f5": "I, on the other hand, either want to promote or force another exchange.  As it turns out, the exchange will occur momentarily.",
        "41... b2": "And, he continues to aim for a Q.  That, however, is almost irrelevant because my R is on the same file to prevent that.  ",
        "42. fxg6": "In the meantime, I decide take advantage by forcing another exchange.",
        "42... hxg6 43. e5": "So, my new goal is to connect two pawns.  Why?  If I am successful, a promotion becomes inevitable.  Of course, I will not achieve my goal because of his f7 pawn, but let's say that pawn was not there.  What would happen?  Two pawns would be right next to each other, and he would not be able to take any of the pawns as I would place him in check with Rb8+.  Then, his only moves would be ...Kc7 or ...Ke7.  After which, I just play d8=Q.",
        "43... Ke7": "Therefore, he cannot not allow that, so this move is his only alternative.  That's exactly what I mean when I talk about placing him other pressure.  Afterall, white has placed a lot of restrictions on black.",
        "44. h4": "After he protects, I want my K to become a little more active.  Afterall, this is now an endgame, and the K is a very powerful weapon, during that phase.  As we will see momentarily, however, it also happens to be the best move, in this position.",
        "44... Kd8": "According to my opponent, this is his only option, as I am about to explain.",
        "45. Kh2": "This is why.  In this position, I was thinking about and had originally played 45.Kf2??.  However, Jack pointed out that it loses because of 45...Kh1.  After which, there is nothing that white can do to prevent black from promoting.  In fact, this is one way that this opponent tested me.  He asked me what the only move was for white and this is it.  He then pointed out why.  As it turns out, any other move loses for white.  In addition, blacks only option is 45...Ke7, so any other move also loses for black.  Therefore, Mr. Stockel explained that Kh1 and Kg2 just repeat themselves.  And, ...Ke7, followed by ...Kc8 also reiterates, so it becomes a draw by repetition.  Overall, there is a lot to learn from this game, but the main moral is simple.  And, it is based on what this coach explained to me while we were packing up and getting ready to leave.  So, what was it?  As we know, you generally have to take enough time and think about all of the moves and positions.  Well, that is more important, critical, and essential in an endgame.  This is why a position is not as easy as it might appear.  You might think to yourself something like, oh I have a winning edge because I am ahead.  But, in reality, you have to be careful, or you could lose that advantage very quickly and even turn a win into a loss which would waist a good game for nothing.  During an endgame, one mistake often makes the difference between a win and loss.  Later on, Jack showed me a different endgame just before we left.  It also proved that you must be very cautious.  The game had ended in a draw, but like this game, any other move from white or black would have been a losing blunder."
    },
    "url": "https://gameknot.com/annotation.pl/otb-wtw-coaching-game-end-games?gm=49566",
    "gameName": "OTB WTW Coaching Game-End Games",
    "players": "Joe (1157 ELO) vs. Jack Stockel (1800 USCF)",
    "opening": "Sicilian (B90), Najdorf"
}