{
    "moves": {
        "1. e4": "I start off normally, as does black.",
        "1... e5 2. Nf3 d6": "But, Tom plays something different which I have seen before, The Philidor's Defense.",
        "3. d4": "So, I chose the, natural, response.  And, it stays in book, until the 5th move.",
        "3... Nf6 4. dxe5 Nxe4 5. Qe2": "As it's almost noon, and being concerned that the Senior Center will kick everyone out of the club before we can finish the game, I decide to do something different.  I break the general opening guidelines by getting my Q out early.  Now when studying these openings, Jack emphasized that pieces need to be developed.  In fact, I went wrong against him by failing to do that, even though, the Q was not early.  My goal here is to trick Tom into making a mistake by not advancing his d pawn.  If I can capture on d6, the pin will be right there.  I generally don't go for tricks but was concerned about adjourning early.  This usually isn't an issue since I generally have to be out by noon, due to the work schedule.  However, I was off on Friday since I got called the day prior.  And, I'd rather lose a game and play poorly then not be able to finish it.  But, I now know for next time that the Senior Center does not kick anyone out, if they're late.  Were it not for that, I would've continued developing with 5.Bd3.  ",
        "5... d5": "Of course, Tom does not fall for it and protects. ",
        "6. Qd1": "So, I pull back to the original square.  Of course, my concentration goes back on development.  But, it's kind of late for that now because of Tom's next move.  I felt that it was inaccurate since I hit, but he has a surprise waiting for me.",
        "6... Bb4+ 7. c3 Bc5": "And, it's with this move since Tom threatens to fork and win a R.  Jack showed a similar example on the same square with the Guaco Piano, as after 1.e4 e5 2.Nf3 Nc6 3.Bc4 Be7 is best to prevent advancing the d pawn, followed by Ng5 which would lead to the same type of fork.  Keeping that in mind, Tom makes the threat.  This leaves my K, somewhat exposed, because of what's about to happen. ",
        "8. Be3": "As this is my only option, and when Tom takes, the only way to protect is remove the weakest pawn on the chess board which, already, gives black an advantage.  This is another reason as to why developing earlier and not bringing the Q out early was better.  What will hope, as noted earlier, is that one can stay late without being forced to adjourn.  That is, if I'm off that day.",
        "8... Bxe3 9. fxe3 Bg4": "Tom takes advantage of my weakness by pinning.  I thought about what to do here.",
        "10. h3": "I had considered breaking the pin in a more calm matter with 10.Be2.  But, the only reason I'd do this is because Coach Stockel said that it's usually better to break the pin with the B.  On the other hand, kenneth_fiore_3 said that I needed to give more thought then just that.  For a while, I hadn't, until other commentators said that it's generally better to do it in a more aggressive way.  After careful consideration, I thought that doing it more aggressively was better to gain two tempii.  10.Be2 wouldn't have done it since Tom could just leave his B on g4.  Was it worth it, though?  I think not, and do believe that breaking it more passively was better here.  As this is bound to give Tom a space advantage.  It will further weaken my K side since I use the other pawn, after 10...Bh5.  That wasn't just tempo but getting a pawn chain which was meaningless.  Thus, I should've given that more thought, as well.",
        "10... Bh5 11. g4 Ng3": "As I thought that 11...Bg6, and that was the only thing that came to mind.  But, I missed this move.  Although the fork is not that effective, the long term results make it so.  As now, I'm bound to have two bad pawn on the h file, and my K will be even more exposed.  Plus, it will take me even longer to continue developing my pieces, thus, increasing Tom's space advantage even further.",
        "12. Rg1 Nxf1 13. gxh5": "? I could've taken the N, but I know that it's usually better to take the B.  In fact, I mentioned to Jack GM Susan Polgar emphasized that I shouldn't exchange my B for N without a good reason.  And, he said that new studies now show that N's are still worth 3 points, but the B is 3.5 points.  That's the first thing I kept in mind here, but once again, didn't think about it even more.  And, I should've given that more thought since Tom is going to win a pawn now.  Thus, 13.Rxf1 was the way to go.",
        "13... Nxe3 14. Qe2": "Knowing what I've done, I go right after Tom's N.",
        "14... Nf5 15. e6": "And, I go for something crazy, knowing that he can't capture.  My plan here is 16.Ne5, followed by 17.exf7+ with a dangerous threat against black.",
        "15... f6": "But, Tom puts a stop to that.",
        "16. Rg4": "So, I start a different which is going after Tom's Nf5.",
        "16... Nc6": "Not surprisingly, Tom completes his development.",
        "17. Rf4": "So, I go right after Tom's N.  The idea isn't winning it, but rather, that he's forced to retreat which would allow me to win back a pawn.  But, Tom puts a stop to that with his next move.  When that happens, I complete my development, once and for all.",
        "17... Nfe7 18. Nbd2 Qd6": "Going after my R, which I'm about to protect.",
        "19. Rg4 Nf5": "Tom was going after my K since he might be trying to build his army with both his N's and Q.  I saw a similar pattern with bhidragon, along with other games.  In fact, there was even one with Susan Polgar.  The idea is building an army of attacking forces against it.",
        "20. Nh4": "So, I attempt to stop it by trying to exchange N's.  Ken said that you shouldn't exchange without a good reason.  But, he also showed me how he won his first game against me by not exchanging.  That's the first thing I kept in mind here, since Tom has just a much pressure.  Like before, I try to trick him into making a bad choice and exchanging which would be in my favor.  Thus, it is now Hope Chess.  But, it's at the wrong time since this gives him what he wants which is an overwhelming amount of pressure against the monarch.",
        "20... Ng3": "At first, I didn't think so since my first thought was that this is a terrible blunder which allows me to win his N.  But, that's not so, due to his Q.  And, I'm not going to lose a R for N, either.",
        "21. Qg2": "? So, I respond by attacking his N a second time.  But, this is a mistake that will allow Tom to win another pawn.  Much better was 21.Qe3.",
        "21... Qxe6+ 22. Kf2": "It was a little noisy on and off but not too bad, until now.  Had it been a little quieter, I would've answered with 22.Kd1 to prevent a check.  ",
        "22... Ne4+ 23. Kf3": "This is where the noise starts to get overwhelming and does not end.  But, according to Master Nathan A Resika it loses right away.  Best was, of course, 23.Nxe4.  And, I didn't refuse to play it to avoid liquidation either.  In fact, that's what I thought I had done since it was notated.  But, what's to come here is exactly how it happened.  And, from that, I discovered that I overlooked it.  Usually, I wonder why, and it takes time to figure out.  But, from what I explained above, it was, indeed, the noise.  What's more is that Nathan Resika commented in the end of the game.  I thought he said failing to take the R was where I lost.  But, Tom didn't have a R en-prise.  What Nathan was alluding to was the N on this move.  If I didn't have the distraction, nothing else would've come into consideration, besides 23.Nxe4  Now, I generally won't disagree with a Master, but Nathan was wrong here.  Failing to take is not where I go wrong, at all.  The next move is where it happened.  However, the reason was probably noise because it does not go away, as the staff are preparing the room for others.   ",
        "23... Ng5+ 24. Kf4": "?? Having said that, this is where it happens.  There were only 3 options.  The other 2 were 24.Kg3 or 24.Kf2.   Either one would've kept me in the game, but this leads to an immediate mate.",
        "24... Qe5#": "I thought that Tom's best move was 24...Qe4+??, with which, I was prepared to exchange Q's.  But, that move would've lost for black since I can take with the N.  However, this is the only time where Nathan comments during the game, and he tells Tom to look at my intentions and weaknesses.  And, that's what helped black to find this mate."
    },
    "url": "https://gameknot.com/annotation.pl/otb-game-2?gm=65251",
    "gameName": "OTB Game 2",
    "players": "Joe (1319) vs. Tom Walsh ",
    "opening": "Philidor (C41), Nimzovich, Sokolsky variation"
}