{
    "moves": {
        "1. e4": "I start off with my usual.  But, I am still not sure how Carl is going to respond.  As Ken told me, that can be problematic.  Just like with my second training game with kenneth_fiore_3, the idea is that openings can be intense.  If you don't know the proper follow up, you can get yourself in trouble.  Well, that happened in my second game against him in the previous game (which I did not annotate since the position became too corrupt.)  But, now knowing how to handle it costed me the game.  It did not cause me to blunder material in our first game during the tournament but certainly created some problems.  However, I'm about to get in trouble again, and like the week prior, it won't be so easy to get out of.",
        "1... Nc6": "As I know about the KID, and other openings, like reti and Dunst.  But, this is similar to 1...Nf6.  As not only don't I know what this defense is, either, but I don't know how to handle it.  In fact, although I have little experience against 1...Nf6, I don't have any with the move played which, in it of itself, presents a problem.  So, I'm already seeing how intense they can become with this move, since I can tell that Carl, in contrast, has a lot of experience.  It was later that I learned that 1...Nc6 is his main response after last Friday during a tournament, with which, he won on time since I timed out.  But, that was also caused by not knowing what to do or handling a situation.",
        "2. Bb5": "With that being said, I follow my instinct.  I decide to treat this like a Spanish Opening since that starts with 1.e4 e5 2.Nf3 Nc6 3.Bb5.  The problem, though, is what was discussed in the Chess Problems Lovers Club being that I just memorize it.  Not understanding isn't so good, either because I don't know what else is to follow.  So, I have to be ready for anything and everything.  That's my model when I get into unfamiliar territory.",
        "2... a6": "Of course, black also responds with 4...a6, and I've learned that, in general, you're best off to exchange right away.  Therefore, like I said before, I'm still treating it like a Spanish Opening.  As I have a ready answer when Carl recaptures, and that's to continue my development, at once and see where we go from there.",
        "3. Bxc6 bxc6 4. Nf3 Bb7": "The only thing that would hold me back from castling is 4...d5 since Carl would be threatening to win a pawn.  But, I castle with anything else since I like to do this early.",
        "5. O-O c5": "Contrary to before, Carl is now threatening the pawn.  ",
        "6. Nc3": "Of course, I also could've defended in other ways including with 6.Re1, but I decided not to.  The idea being is the understanding v memory.  As I remember what happens in the Ruy Lopez.  But, what I understand is that after the Berlin Defense being 3...Nf6, white can castle because if 4...Nxe4, white regains the pawn back with 5.Re1.  But, that's basically what you call a not real gambit since you give it up and regain it.  That is not the case here, so the wrong concept would be applied.  Although bringing the R to e1 works and centralizes a R, I'd rather protect by developing another piece, first.  That is why this was the only other move that came into consideration.  And, I thought that it was a better candidate move.",
        "6... d5": "Carl is threatening to win a pawn.  It doesn't look that way since my original thought was not to worry about 7...dxe4 as then, everything looks level after 8.Nxe4??.  That would be so, if I had centralized my R, instead.  But, without anything on the e file, after 8...Bxe4, I'm a piece and pawn down.",
        "7. exd5": "?! So, I took, as I thought that this was my only option.  But, my thought process is wrong, as I did not think things through here.  The other alternative was to continue advancing with 7.e5.  And, that would've been better, as now, I'm forced into a plathora of exchanges.  And, the truth is that I'm not ready to exchange pieces, yet.  ",
        "7... Bxd5 8. Nxd5 Qxd5 9. d3": "Being that Carl took advantage of me and still remaining in some unfamiliar territory, I now try to take advantage.  The idea is harrassing Carl's Q for tempo gain, similar to what I see in the Ruy Lopez, after 1.e4 e5 2.Nf3 Nc6 3.Bb5, and after 4...Bc5, white plays 5.c3 with the idea being 6.d4 to harrass the B.  There's no minor piece, but the idea is the same, as I want to gain tempo here. ",
        "9... e6": "Once Carl played this, I decided to delay my plan in order to complete my development.",
        "10. Bf4 Bd6": "But, now that he is threatening a piece, I will, once and for all, follow through on my plan with the next move, which in this case, turns it into the d2-c4 plan.  So, as noted above, it's like the c2-d4 plan in the Spanish Opening.",
        "11. c4 Qc6 12. Be3": "And, I do not protect by exchanging because my Be3 is better then his Bd6 since it has more mobility.",
        "12... Nf6": "And, Carl goes right for it by completing his development.",
        "13. Re1": "Contrary to earlier, I decide to centralize my R with the idea of bringing the Q behind it which, in general, is a good idea.",
        "13... O-O": "I'm not surprised to see Carl castling.",
        "14. Qe2": "But, not sure what to do, I follow through on my plan.  I also weigh it in with what kenneth_fiore_3 told me since that would not be a valid reason to exchange.  But, what Ken said is that in a situation like that, you're better off connecting both rooks by getting the Q out.",
        "14... Rfe8": "Similar to what I did, Carl also centralizes his R.",
        "15. Bg5": "So, I threaten to exchange.  The only reason for doing so would be to damage his K side pawn structures. ",
        "15... Nd7": "But, Carl is just as cautious with that, and thus, refuses.",
        "16. Rad1": "So, I centralize my other R.",
        "16... h6": "So, he attacks my B.",
        "17. Be3": "The beautiful thing is that my B covered 8 squares, so I used the process of elimination on where to retreat.  For example, advancing it up would lose the B.  And, I was not going to play 17.Bf4?? which loses it.  I also wasn't going to play 17.Bh4 as that loses a tempo since his response would be 17...g5  And, I wasn't going to play 17.Bc1 since that undevelops.  So, the only other move that I could consider was 17.Bd2.  But, after careful consideration, I decided not to play that as that would limit the mobility of my Rd1.  And, as I learned from coaching with Jack Stockel, it's not a good idea to limit the mobility of your own pieces.  So, I felt that this was my best move.",
        "17... a5": "I believe that Carl played this to increase the mobility of his R.  ",
        "18. d4": "But, I, however, am trying to break through with this move.  My thinking is that if Carl doesn't exchange, I have 19.d5  Not only do I get a good pawn chain, but his Q would be under siege which would gain another tempo.",
        "18... Rab8": "This move, however, temporarely stops me from doing that since I thought that b2 is attacked.",
        "19. b3": "Rather then use the R, I advanced.  The idea being is that I want my rook in the center since 20.d5 will leave the Q attacked.",
        "19... Nf6": "Carl, however, prepares for the attack.  I should've seen it coming.",
        "20. d5": "? But, this falls under pattern recognition, as well.  As I said earlier, this appeared to gain tempo.  But, I missed the big picture when Carl 19...Nf6  As I figured that exchanging pawns benefited me for that reason.  However, that move was a short range tactic which I did not see, and missing is going to lose a pawn, when all is said and done.",
        "20... exd5 21. cxd5 Nxd5 22. Qd3": "?! Of course, I don't want to liquidate, but if I move my B, Carl will exchange my R.  Well, I'd rather liquidate the piece that's worth less.  But, what I did not consider was mobility which is very important and shows that I still need work on it.  Similar to what Ken previously said, you don't just base things on point value.  Unfortunately, that's what I based it on and didn't consider how mobile my Be3.  After thinking about it now, I've concluded that my Be3 was worth more, in this position.  Better was 22.Bd2, or 22.Bc1.  Of those 2 candidate moves, I think that 22.Bd2 since I could use that to recapture, if black were to play ...Rxe1+.  But, this inaccuracy increases Carl's advantage for the same reason that fiercequeen mentioned in her most recent annotation, when she and discussed about mobility.",
        "22... Nxe3 23. Rxe3 Rbd8": "! In addition, Carl could've liquidated further with 23...Rxe3.  But, this move is better, as he is threatening something terrible which I, unfortunately, overlooked.  But, that is going to cost me the game, as we're about to see.  ",
        "24. Rde1": "?? I was fixated on doubling up my rooks since Jack has previously told me that it is a good idea.  But, this was Flip Coin Chess.  So, I was given three definitions by cplusplus11.  Two of them are Hope Chess and Real Chess.  But, the other is Flip Coin Chess, and that occurs when you move too quickly and don't give something enough thought or calculation.  With that being said, I forgot the important lesson that bhidragon emphasized in our rated game with each other when I got my Q out of play by fixating on advancing the c pawn to allow ...Nc6.  As that was little, yet, I spent all of my time focusing on doubling up the R's.  Instead, just like that game, I should've focused on what's coming.  With that being said this loses.  Although it isn't instant, it's still going to cost me the game because we're talking about being the equivalent to a piece down without compensation.  Instead, I really should've focused on moving my Q because this discover attack is how Carl is going to win material.  ",
        "24... Bxh2+ 25. Kxh2 Rxd3 26. Re3xe8+": "Despite that, I'm not ready to resign, yet.  I normally would've, but I have a forcing move which I thought would end in a draw.",
        "26... Kh7 27. Ne5": "?? But, I was wrong.  The idea behind this move is that it's a fork.  So, I thought that Carl had to protect his Q, with which, I'd take a R.  From then, it would almost be a forced draw because it's a Q against both R's.  Now, deeper_insight mentioned that this is a known way to draw which I later annotated, in what is the longest game that I have annotated.  Knowing that, I tried the same thing here.  But, I forgot that this causes an intereference which is an important piece being blocked in by your own piece.  My Re8 was protected by my Re1, but this removes the defender.  Consequently, he is going to win more then my R.  And, that goes with what Ken told me which is that, \"one blunder often leads to another.\"  ",
        "27... Qxe8": "As mentioned earlier, it's more then the R.  Even if I defended my pinned N with 28.f4, Carl has 28...Rd4 or 28...Qf6 which will pick up a pawn and then some.  I think that Carl would play 28...Rd4 because after 29...Rxf4, he is then free to take my N.  Knowing how far behind I am, combined with, the fact that it's only going to get worse, I resigned here because there is nothing else to get out of the game.  I think the main lessons to be learned from this game is to be prepared for openings, as well as, to look at everything that's occurring on the board.  Another way of putting it is to study the position which is also noted in a couple of clubs.  It's also not to play Flip Coin Chess at any time which is making a move without giving any thought behind it as that led to the final blunder."
    },
    "url": "https://gameknot.com/annotation.pl/otb-game-2-back-with-a-vengeance?gm=64012",
    "gameName": "OTB Game 2-\"Back with a Vengeance\"",
    "players": "Joe (1326) vs. Carl ",
    "opening": "KP (B00), Nimzovich defence"
}