{
    "moves": {
        "1. e4 e5": "As I see with players at the chess club.  I mean, not just Jack, but all the members except for Tom, whenever I open with the King's Pawn Opening, they answer with the King's Pawn Game.",
        "2. Nf3 Nf6": "Although more common is 2...Nc6, which would result in the Ruy Lopez, I don't have a problem. But, this is where the consultation.  Therefore, Mary said, \"Wait a minute.  What the heck?\"  So, I said, there was nothing wrong with this move.",
        "3. Nc3": "I also considered exchanging on the e square.  The reason I didn't is because of what ION noted in a previous annotation against Jack that even though it's, technically, even, 3.Nxe5, Nxe4 gives black tempo.  Losing time so early would give the opponent a slight advantage, and my goal is to make it difficult for her, until Jack comes.  So, with that being said, I made the decision to defend e4, at once, as now, the threat is back.  Now it's important to note that I am coaching her, so if Jack wasn't there, things would be different, and I'd be tougher.  With the main coach, I often go wrong and Jack helps her find the way to exploit my mistakes.  So, I end up losing, but that's allright because this is how she and I learn, which is what I actually care about.  It is what we used to have, or what you sometimes see in an annotation.  So, in other words, you do give advice and teach, but then Jack looks it over to ascertain that I'm giving the correct information, and when I'm wrong, he asks what is wrong and finds a better move, that would often show why I'm wrong.",
        "3... d6": "?! I forgot to mention, as at the time, I viewed is a good move since it develops a central pawn.  The problem is that I don't analyze quiet as carefully in OTB chess, and therefore, miss an important detail.  And, had I not, would've pointed this out, but this is an inaccuracy because the leaves her with a bad bishop.  Instead, I would've played 3...Bc5, and then this would be played.  But, with this move...",
        "4. d4": "I will treat it, as if, we were in the French or Caro Kann Defense.  The idea being in an opening is that when black advances a pawn one square forward, you respond by playing d4.  Now, it is as ION has said which is that, if it works, in that position, you play what you're most comfortable with.  This is something that Susan Polgar implied, when she said that you don't try to memorize moves in an opening, but rather, play what you're comfortable with.  And, yes, as archduke_piccolo has said, the only thing to be weary of are the small changes which could invalidate my thought process.  But, I asked myself if there was a change which would result in negative consequences.  When I determined that it wouldn't, that's when the decision was made to move here. \n",
        "4... Nbd7": "?! I was surprised to see Mary play this.  So, this was the first time where I correct her, and yes, this is where I learned from that certain someone that I moved on.  And, the only reason I dare mention is the fact that it's important to apply what you've learned and use it towards your games, as shamash puts it.  In fact, that is the main reason that I have now reached my highest rating and think I'm still improving.  On that note, I said to Mary, the only problem is that the Knight is crammed is on d7.  A better square is on c5, and she agreed by nodding her head.   (When I said c5, what I really meant was c6 so I gave the wrong info there by reversing my colors which is why I abhor that.)  The reason I stated this is that, in applying what I learned, as noted, in a game, I remember quite well, I made a mistake that forced me to place in on the second rank as white; which is, the same as, the seventh rank for black.  Then, I made another which forced the other N on the same rank which gave him much better center control.  From then on, things went quickly downhill, as I was now going to face ruinous loss of material or get mated. ",
        "5. Bb5": "Seeing the weakness she left herself, I decide to exploit it with this pin.  The idea being is the fact that she will now have to waist tempo to get her LSB into place.  I also kept in mind that she has a bad bishop.  So, between those two factors I realize that my center is better controlled as of the moment and I'm ahead in development.  Therefore, I have a slight advantage, for now.  ",
        "5... c6": "I am not, however, surprised to her play this.  Yes, I knew that Mary would want to break the pin.",
        "6. Bd3": "I also looked at 6.Ba6, but unlike what I've done before, this is where small changes would've invalidated what I had in mind.  That's because black could, and most likely, would answer with the immediate 6...b5  I was worried about the loss of a piece, though, I realize that 7.Bb3 would've kept it safe.  But, I don't like the placement, as well, as, here.  The idea being is that I have protection.  ",
        "6... exd4": "This is where the consultation really begins, as now, the three parties are discussing the move.  Jack: What's wrong with taking the pawn.  Mary: I'm going to lose pieces.  Joe: With this capture, you don't.",
        "7. Nxd4": "The obvious response.",
        "7... Nc5": "Joe: But, this moves the same piece twice, as opposed to, developing another piece.  Mary said something.  Jack: Develop your pieces.  This time, I could not notate everything, in terms of, game chat, as there was just too much.  I believe it was something like I'm in trouble.  So, he said, \"That's ok, just make the right move.\"  And, I nodd. ",
        "8. O-O": "As usual, I like to castle, ASAP.  That is, when it's safe to do so.",
        "8... Bg4": "Developing another piece and going after my Q.",
        "9. f3": "Thinking about what to do, I reattack with the idea that, when she retreats, I will pin her N on f6, by developing my final piece.",
        "9... Bh5 10. Bg5 h6": "Jack actually got the letter wrong and reversed the squares, and I didn't catch it until now.  In it, he said, \"Your best move was 10...Bg7.  And, now, you're in trouble.\"  Joe: I was going to say that.  Although, I realize now since I'm looking at more closely that what he should've said was that best was 10...Be7, but I think Mary understands that because the idea was that the pin should've been broken with the DSB, as opposed to, attacking with a flank pawn.",
        "11. Bxf6": "I was evaluating on whether to take the B, or retreat, which is most common.  Normally, I'd retreat, but given that I'm doing a little coaching with Mary, I want to see what she's going to do later on, since I don't fully know what she's up to, as it's been a while since I've played against her.  Had I known what was to follow later on, I would've retreated.",
        "11... Qxf6": "Jack: You must take back.  Mary: Taking with the Queen leaves me better developed.  And, although I didn't say anything, I agree.  Although it isn't development, per say, I think her K will be safer, when she decides to castle.  Normally, I would know for sure, except that id=tactical-abyss said that having two pawns opened around the K doesn't, necessarily make it unsafe.  It all depends on the position.  But, I am not sure what would've happened here, that is, had she played 11...gxf5, but I like this move a lot better.",
        "12. Re1": "?? The reason for this move is that I have previously learned that one way you control the center is by bringing the R on a center square.  But, in this position, it is an absolute blunder that now puts me a disadvantage because of what's about to occur.  With that being said, this is also why I should've retreated, as opposed to, exchanging her B for my N.  Had I don't that, her next move wouldn't have been feasible because my DSB would've prevented her Q from coming to f6.",
        "12... Qxd4+": "At this point, the consultation ends, for the most part.  As, now, I Jack is focusing on his game against Perry which, believe it or not, he also loses against his student with one mistake which he thought was a win.  And, she is doing so well, that I won't give much advice from here on because it's not good to overteach.  So, we're heading towards the end of it.  Mary: I can put you in check.  Joe: Yes, and you've won a piece.  I said that with a smile on my face, as I'm impressed with her play as she has become better.  And, as ION noted, she is starting to get used to tactics, as we will see later on.",
        "13. Kh1": "So, I had two choices to move the K.  It was either on f1 or here.  The reason I decided to play 13.Kh1 is because what I learned from Jack, last week.  That part of K safety is that, on certain occasions, you have to move your K to the corner to prevent threats as that's part of K safety.  Although it's not immediate, a threat could allume, as I've seen in positions similar to this.",
        "13... Nxd3": "Jack: You're ahead, just trade.  Mary: Then I lose.  Jack: Listen to your teacher.  And, I agree, as this how I've always felt by saying that he's the best.  She nodded.  Now, had Jack not said that, Mary I forget what move she would make.  But, it would've been something which I believe would've gotten her into trouble, possibly losing the advantage as black must be careful here.",
        "14. cxd3": "Although I don't enjoy liquidating when behind, there's no choice.  For, had I not taken, she would've won another piece, putting me in bigger trouble.",
        "14... Be7": "Preparing to castle.",
        "15. g4": "Without much to lose since I'm a piece down and lost an exchange, thenafter (as she got to liquidate) I decide that, although it opens up my K, I'm going by what TA said.  That moving the pawn and opening it up near the K isn't always a bad thing and won't necessarily expose it.  So, I decide to follow a technique that ION used against Ron, when he was losing and things were looking worse.  He just got aggressive, and when Ron made one mistake, it was over.  Well, I'm trying to do the same thing for.  In this case, it's just getting aggressive knowing as I'm doing anything for counterplay.  I'm pretty sure that I'm going to lose not just due to being a piece down, but for the reason outlined earlier.  So, my goal is to make things difficult for Mary so that she has a difficult time defeating me.  Putting up a tough fight is also a way for her to learn.",
        "15... Bg6": "Forced.",
        "16. f4": "Now, I really am doing things for the thrills and giggles of attacking the B.  But, it's the reason I mentioned a move ago.  That is making things difficult for her.",
        "16... Bh4": "She reattacks.  But, I am not surprised to see this and eliminate the threat.  Nontheless, she's becoming good at this game and showing progress which is something I like.  And, although I have coached her before, the main reason is really because of Jack, as first, he's why I have improved.  And, the fact is that he's worked with her much more.  In fact, he coaches her most of the time, I'd say 9 out of 10 times, and that 10% where he does is with the consulation games, like this; where I coach, and he helps her defeat me with advise. ",
        "17. Rf1 O-O": "Mary: Since Jack has emphasized the importance, I better castle.  And, I agree by nodding my head.  And, while I didn't record it, he said, \"It's never to late to castle.\"",
        "18. f5": "But, as noted, this is where my plan of 16.f4 becomes a reality.  She really starts to think about how to get out of this, which is what I want.  The idea being that you become better by thinking and struggling, and it's worth noting that it's also how I've improved and a little of what it takes for me to come up with my own variations.  Since I want her becoming familiar with the same concept, I decide to give her the equivalent of homework by putting her in this situation.  It is part of getting her to become familiar with those forcing moves, which is also the cornerstone to thinking like a GM which is what I learned by Susan Polgar during the e-mail course.  With that being said, while thinking about it, Jack helps by saying, \"You only have one move.  Make the wrong one, and you're in trouble.\"  I nodd because what he's really implying is that, if Mary doesn't find the response, I will recompensate (equalize), and from there, will have the intiative.",
        "18... Bh7": "When Mary played this, I told her that she made the right move.",
        "19. Rb1": "The idea here is to prevent my b pawn from getting attacked, should she play ...Qb6",
        "19... d5": "I am not sure why Mary wants to exchange Mary.  But, I think her long term goals is to promote.",
        "20. Ne2": "Wanting her to really think and do Homework, I decide to attack her Q.  Remember: I am doing anything, even with move that I generally wouldn't play.  So, in this case, I will do something just to attack something because Mary is a student, and as noted, I still want to learn.  So, thinking about the position is a way to do that.",
        "20... Qe3": "But, it was easier for her to find a way out then I had anticipated.  ",
        "21. exd5": "?? With that being said, I do take a pawn.  But, this is a blunder because of her next move.  And, I am so hyperfocused on helping Mary learn, that I don't see her plan which is bound to become deadly.  In doing so, however, I did achieve my goal.  If I did care about winning, I wouldn't have, but she does really think on moves when she was in trouble which is what I really wanted.",
        "21... Bf2": "! But, when I implied that this was a blunder by saying that better was to take with 21...cxd5  The reality, however, is that she found the best move, as at the very least, I'd be forced to lose another piece, without compensation.",
        "22. dxc6": "This was anything but Real Chess.  There was a small element of Hope Chess with a slight amount of greed.  For the most part, so 95% of it was Flip Coin Chess.  I didn't do it just to win another pawn, though that was 5% of the reason.  However, the main reason was that now I was thinking in long terms of how I'd promote with the d pawn.  So, what I was anticipating was that she'd take back with 22...bxc6, and then I would keep advancing my d pawn with Q behind since that's the passer.  The idea behind it was that I was thinking, from studying some of those other endgames, how to promote.  I realized that I'd never be able to keep that second Q, but then, I would recompensate and get a R.  But, I didn't take enough time to analyze the immeidate threat which is why it was Flip Coin Chess.  Therefore, this was a terrible oversight, as I overlooked what's about to happen.  Instead, I had to move my N to prevent that, after which, she would take and, now, I'd be down by the equivalent to a piece and two pawns, without compensation.",
        "22... Qf3#": "So, after I told her why the last move was a mistake, which was wrong, she said, \"But, what about this?\"  I analyzed it seeing that I was in check.  And, I realized that there is no way out.  Therefore, I said, yes, that's checkmate, and Mary was surprised and happy that she did so well.  After this game, Jack and I were also both impressed with Mary's play, and we agree that she is becoming a strong player.  This makes us proud of her because it shows how much she is learning from the training sessions, which accomplishes his and my goals.  Right after this game, Mary and I played another game with me as black which I didn't notate, but this time, I won.  The idea was the same where I coached and Jack gave advice, so it was another consultation game.  But, seeing how much better Mary has become, I wasn't going to be a Mr. nice guy, this time around.  Yet, Jack pointed out a blunder I made which allowed her to win a piece early.  However, I recompensated by winning three pawns, in return.  Afterwards, she made a mistake and allowed me to win a piece.  Shortly after that, we had to put everything because it was already noon, so Mary and I had to leave.  As a result, it was assumed that I won due to the advantage that I had.  "
    },
    "url": "https://gameknot.com/annotation.pl/otb-consultation-game?gm=59998",
    "gameName": "OTB Consultation Game",
    "players": "Joe (1320) vs. Mary ",
    "opening": "Petrov three knights game (C42)"
}