{
    "moves": {
        "1. e4": "Like me, this is also Mariann's favorite opening.",
        "1... c5": "But, my favorite defense is the Sicilian.  In fact, that game with Jack was just the most common of this defense since I was black, which is unusual for a start.  What happened was that the board was set up different, so in order to have the positions accurate for annotations, it had to start off on the right, since sometimes they reverse colors, where white's pawns are on the seventh rank with the pieces on the eighth rank.  And, with black, yes, the board has been set so that the pawns were on the second rank, and pieces were on the first rank.",
        "2. Nf3": "At first, Marriann played 2.f3  Now, I wasn't going to say anything because archduke_piccolo said that there's nothing wrong with this move.  But, this move happened, about a second or two before Tom arrived.  Wanting the new student to learn, Jack said that best is 2.Nf3 and to play it.  Despite not saying word, I nodded when he said that.  The idea being that, with the Sicilian, this move is most studied by Masters and Grandmasters which is what Jack wants.  In fact, that's why he also told me to stop opening with 1.Nf3 (which I used to do.)  In reality, there's nothing wrong with it, but GM's study 1.e4, and 1.d4 the most since they involve more theory.  And, he felt that this student would learn better with main lines which I can see why because tactical-abyss noted that, until you reach a 1400+ rating, it's better not to deviate from main lines.  But, right after this, the student is now watching Jack's game with Tom.  For the most part, it's all main line until...",
        "2... d6 3. d4 cxd4 4. Nxd4 a6": "Here, as this should've waited a move later.  When different things happen, this is when I also get mixed up in the theory department since it's anything but normal.  I just need to adjust quicker.  Most common was 4...Nf6, hitting e4. And, after 5.Nc3, then comes 5...a6 Had I payed better attention, my Ng1 would've come into, immeidately.",
        "5. c3": "?! But, I guess that Mariann was also distracted.  Not only does this push pawns, as opposed to, develop, but now her Nb1 is blocked.",
        "5... Nf6": "Seeing what happened on my last move, now I hit e4 with the same move. ",
        "6. f3": "?! I was surprised to see this move.  She does get a pawn chain, but in this position, it's not as useful.  Better was to protect with 6.Bd3, developing another piece.  Worth noting is that Marriann will get herself by pushing pawns, as opposed to, completing development.",
        "6... g6": "Waisting no time and trying to take advantage of her inaccuracy, I prepare to castle by fianchettoing my Bf8, at once.",
        "7. b4": "Like before, she is pushing pawns.  I would've developed my Bf1.",
        "7... Bg7": "But, as noted, the idea behind the fianchetto was to develop my DSB and prepare to castle, at once.  Now, 7...Bh6 came into consideration, but after what happened in my game against bhidragon (where he noted the problem with that), despite it being blocked by my Nf6 I play this.  What he said was that, when you fianchetto, playing Bh4 or ...Bh6, generally makes it unsafe to castle short.  Believe it or not, this was mentioned in that annotation.",
        "8. Bd3": "She has, temporarily, caught up on development.  But, I will still castle on my next move which was also part of the plan behind the fianchetto.",
        "8... O-O 9. O-O": "So does she.",
        "9... Nbd7": "So, I continue development.  I considered 9...Nc5, but remember the course I took with Susan Polgar?  Despite the position being cramped, the plan behind this move is to bring my N to e5.  So, I guess you can say that the idea is Nb8-d7-e5, or Nb8-e5.",
        "10. b5": "But, this is where she winds up in trouble by not continuing with development.  As kenneth_fiore_3 mentioned, pawns are not the trick, but rather, pieces.  With that being said, this is a game where I applied what I've learned from one of TA's Q sac.  That's because by playing this I can and will get an open file by exchanging.  After this, I will bring my Nbd7 in a spot that I most desire, which will also allow me to complete my development.",
        "10... axb5 11. Bxb5 Ne5 12. a4": "Still pushing pawns, leaving two pieces undeveloped.",
        "12... Bd7": "So, I complete my development and threaten to win a piece.  This is part of theory, so the main idea is ...Bxb5, and if she answers with axb5??, ...Rxa1! winning the Rook.  And, yes, this is why there was a lot for me to learn with Joe's blitz Q sac.  In one of those games, he sacced on h7, and later on, with TA getting ahead in development he got an open file which proved disasterous, for his opponent.",
        "13. a5": "Preventing the loss of a piece.  But, I will still exchange to gain time.",
        "13... Bxb5 14. Nxb5 b6": "So, I come up with another plan.  The idea being is that she can't take due to my Ra8, so I'm threatening to win a pawn which if it happens, I'd have a dangerous passed pawn which would be overwhelming for white.",
        "15. f4": "So, Marriann protects by hitting my Ne5.  But, what she doesn't realize is that white is going to lose a pawn, sooner or later.",
        "15... Nc6": "I retreat.",
        "16. Be3": "? Developing another piece, and hitting b6.  But, with this move, not only do I pick up a pawn, but in doing so, I'll have a dangerous passer on a5 since there are no pawns in front or aside of it.  Even worse is the fact that I have a Rook behind my passed pawn which is known to be lethal.  The thing is that, unlike before the castle, white ought to have continued developing sooner.  But, when we're in a time crunch like, this, it's understandable.  At this point, we had, at most, 10 to continue.  In addition, I had a difficult time deciding between 16...Rxa5 and 16...bxa5  The reason I took with my pawn is because I still remain with a Rook behind the passed pawn, which is where they belong.  Whereas, if I take with the Rook, that doesn't happen.",
        "16... bxa5 17. Nb1a3": "? Developing the last piece.  While it's good to do that, this move is a mistake because I will pick up another pawn.  Instead, she should've completed her development to prevent and situation like this, and best was 17.Nbd7",
        "17... Nxe4 18. Qd3": "Hitting my Ne4.",
        "18... Nc5": "But, it won't work because I fire back at her Queen.  Right after this, however, the game timed out.  Sometimes, I'd record it as a win because when timing out, and I've wound up ahead, me and Mariann have presumed that one side has won.  But, this time, we agreed that it was just unfinished or still in progress.  While not definite, there is a possibility that we will continue this game, at some point.  If so, you'll see this annotation but with the second part.  And, I'll reinstate and show we're we left off.  After running out of time, this is where I did a little bit of coaching.  In it, I told the student that she made a similar mistake to what I've seen before, including the recent win.  That, she should've completed her development earlier, as opposed to, push pawns.  Had Mariann done that, she wouldn't have wound up in trouble, and it would be a lot harder to win material.  The idea here is that pieces can work together to win material, and even, deliver a devastating attack. "
    },
    "url": "https://gameknot.com/annotation.pl/otb-chess-game-for-real-this-time?gm=60336",
    "gameName": "OTB Chess Game-\"For Real This Time\"",
    "players": "Marriann  vs. Joe (1370)",
    "opening": "Sicilian (B54)"
}