{
    "moves": {
        "1. d4": "As with Tom in the previous annotation, Carl was black in our last game.  So, since this tournament is a match with two games each, I had to play as black, this time around.  What I'm used to seeing is Carl change his openings.  In fact, I've seen him play the KPO (1.e4), Reti Opening (1.Nf3), and even, the Dunst Opening (1.Nc3).  But, this is the first time that I have seen him play the QPO.  As ION pointed out in my last game with Carl, \"For some people, a fairly fixed opening repertoire is desirable. It leads to them a familiarity with the positions that arise.\"  It's safe to say that Carl is one of those peoples because he gets used to things that, for me, can lead to unfamiliar territory.  Sure, the start is what I'm used to, but things change early on.  So, it's more of an, \"educational approach\" as kenneth_fiore_3 puts it.  In fact, that's why he recommended that I play 1.d4 in our first game which became the KID.  And, then, when I played 1.e4 in our second game, he played the Owen's Defense, 1...g6 which I hadn't seen in a while before that and was almost in unfamiliar territory, right then and there.  ",
        "1... d5": "Of course, this is my main response to 1.d4 openings.  So, as with 1.e4 e5, it's now the Queens Pawns Game.  Now, it's about what Carl's going to play next.  I was thinking that he might go for a QG.",
        "2. e3": "But, he tries to turn it into the Colle's System.",
        "2... Nf6": "And, I accept.  Afterall, I'm used to it just from studying the Colle's Franketort System with Susan Polgar.  But, it was more understanding then memorization, of course.  Were it just for memorization, I'd just know how else to continue.  But, by understanding, all I know is that this is the first move to it.  It's actually good that I didn't go for memorization and not just because it doesn't blend in with my style of learning.",
        "3. Nc3": "?! But, it's also because Carl played this which was not analyzed by Susan.  The reason being is that it's inaccurate since it blocks in his c pawn.",
        "3... e6": "As with my game against Tom, I'm trying to see if there's a way to punish Carl for blocking the c pawn.  That is, playing his last move without advancing the c pawn, so my plan is to pin his Nc3.",
        "4. Be2": "And, this move allows me to do just that.",
        "4... Bb4 5. Bd2": "5.a3 is usually a better way to break the pin since it's less passive.  But, I reckon that Carl made the right choice, and if I had this position, 5.Bd2 is also what I would've played.  The reason being is that after 5.a3, I would've blocked the c pawn even further by exchanging with 5...Bxc3  Blocking the c pawn more wouldn't be the reason, but rather, I'd exchange to make Carl double up his pawns along the K side.  That would make it less safe for him to castle short.  But, there'd also be compromises on that side, as I would then start forming a plan to put pressure on his K.  Playing this prevents that.",
        "5... O-O": "But, bearing in mind that he broke it in a passive manner, which, in my opinion was the right choice, I go ahead and castle right here.  This was also part of my short term plan behind the pin.  My idea is to castle early and often.  A while back, there was a thread about when to castle or not, from jstevens1.  I posted, but ION posted what I originally said.  As Joann said that sometimes, castling can cause harm, although, Charles said that the mistake was later on.  Then, ION posted and said that it's usually better to castle short.  And, at a later point in time, I showed the thread to TA, and he said that castling early is usually essential.  What he mentioned is that the only time you should consider holding off is when you're much stronger, and we're talking about at IM.  He said, that you generally need to be good enough so that you can sac something like the Q, as he does, and win.  Then, Joe confirmed what Charles said which is that Joann's mistake was later on.  Having said that, I didn't consider any other move besides the text.",
        "6. a3": "But, this is where Carl starts getting aggressive.",
        "6... Bd6": "Since Carl, broke the pin a move prior, I was not going to exchange, this time around.  I only do that if I see something that'll appear to give me an edge or win of material.  That was, since Susan Polgar told me that you, especially, don't want to exchange B for N, otherwise.  Well, I would've felt confident, had it led to doubled pawns on the K side.  But, Carl put a stop to that, and with that, I wasn't willing to do it.  I also considered 6...Ba5, similar to the Spanish Opening, after 7.b5 Bb6 8.Na4 would've forced me to exchange.  I also looked at 6...Be7, but I felt that would've left my DSB less mobile.  So, I thought that this was the way to go.  On the other hand, similar to what ION posted in my previous annotation, after handing back a piece, with 6...Be7, my B would be on the same line as the Q, and then you add the N.  So, that might have been better then the move played.  But, since I'm getting into unfamiliar territory, I went by my gut instincts which told me to play this.",
        "7. Nh3": "Carl continues to develop, but much better, I believe was to play 7.Nf3 since the N is on the rim.  So, I studied a bit with GM Susan Polgar in a free course based on how a GM punished the opponent (who was also a GM) for leaving the N on the rim.  He used a discovered attack (masked battery) which led to a fork that won material, when white resigned.  Remembering that, I try a similar strategy against Carl.",
        "7... e5": "And, it was a masked battery of my own, against the same piece.  ",
        "8. dxe5": "Of course, Carl was going to play this which forks and appears to win a piece.  But, this is a conditional move because of what I'm about to do.",
        "8... Bxh3": "And, it's right here.  What I'm keeping in mind is that Carl is virtually forced to take back.  If he takes my Nf6 or Bd6 right away, rather then recapture immediately, I'll try to Q right away starting with 9...Bxg7  If 10.Rg1, then I'd capture one of the pieces on the 6th, and threaten to Q in another way.  Although, that line should fail, but Carl also felt that his next move was forced which, in return, doubles up his pawns.  That's what I wanted because isolated pawns usually benefits your opponent.  It's not always the case, but it can make a big difference during the endgame.  In fact, it could be enough to make or break (win or lose) a game.  And, once he captures, I'll recapture on e5 and see where it goes from there.",
        "9. gxh3 Bxe5 10. Bf3": "And, Carl continues by moving his B. I would've castled here, at once.  But, Carl goes right at it by attacking my pawn a second time.",
        "10... c6": "What I forgot is that my pawn was defended again.  I was thinking along the line of, what am I going to do?  And, how can I protect d5?  As I thought that if I wasn't careful, Carl has 11.Nxd5, and after 11...Nxd5 12.Bxd5??, winning a pawn.  But, I forgot about 12...Qxd5 which would've won a piece in return.  Had I given it more thought, I would've wounded up ahead because Carl would make that kind of blunder due to his quick play.  So, I defended, but had I realized that d5 was defended again, I would've completed my development with 11...Nbd7.  Of course, I'm moving just a little too quickly here.",
        "11. Qe2": "Meanwhile, Carl gets his Q side ready for action.",
        "11... d4": "Which was of no concern to me since I go on the attack here.  I was ready for Carl to exchange since afterwards, I'm, potentially, threatening to pin and win his Q.  Without his pawn there, and without the interference of my B on e6, this threat is powerful.  And, I asked myself the same question that Ken asked me which is, what Carl's going to do.  Of course, I thought that the situation had become difficult for him.",
        "12. exd4 Bxd4 13. O-O-O": "But, I was wrong, as he had a ready answer.  And, that was to castle on opposite wings of me.",
        "13... Re8": "Knowing that I don't have a pin, I just go on the attack in an attempt to complicate things.  The whole idea is that after forcing Carl to retreat, I thought that I was gonna win a pawn.  And, that's why I was still moving a little too quickly.  Usually, going too fast would be caused by me getting nervous.  But, I know how to prevent the Fight or Flight Syndrome.  So, moving too fast was the opposite here, as I thought that I, had a potential win.  But, I became overly confident, instead, and thus, moved too fast.  After this move, I slow down, but it's too little, too late.",
        "14. Qc4 Bxf2": "?? I didn't realize that, with this move.  It looks like I just won a pawn without anything in return and might be able to compromise the position.  But, this is one of those cases where I go wrong.  At this point, although I thought I went slower earlier in the game, I had only used about 20 minutes here which means that I had 35 left, for the entire game.  However, this is going to get me in trouble.  ",
        "15. Be1": "Since Carl plays this.  I was very comfortable here, for a while.  As my thought was that I was going to win a piece and had almost played 15...Rxe1??  Then, I realized that I was in trouble since Carl has, what turns out to be, a masked battery against my Q.  So, I gave it more thought and used, at least 5 minutes.  Afterawhile, I realized that the only way to avoid losing my Q is with my next move since I'll also attack his.",
        "15... b5 16. Qf4": "But, Carl defends and goes back on the attack.",
        "16... Be3+": "And, I try to defend by placing him in check.  I originally thought that he was forced to take which would allow me to win his Q.  But, then I looked at some more, starting on the next move.",
        "17. Qxe3": "And, I realized that it didn't.  As I almost played 17...Rxe3, but then would come 18.Rxd8+, and I thought that after 18...Re8 19.Rxe8+ was mate.  But, this was Ghost Vision since I thought that my N was f5.  Thus, it would've been better because I'd have 19...Nxe8 which would've handed me back a piece.  Therefore, it would've saved me because of what happens with my next move which will cost me the game.  ",
        "17... Qxd1+ 18. Nxd1 Rxe3 19. Nxe3": "Although, it didn't occur to me until here.  As I thought that not only was everything level, but I was up a pawn.  But, then I recounted everything with what I have and what he has.  And, that's when I discovered that I'm down a piece for only a pawn in return.",
        "19... Nbd7": "? But, thinking about how to recompensate, and thereby, trying to activate my other N, I played this.  But, I forgot about my c6 pawn, which Carl's also about to win.",
        "20. Bxc6 Re8": "Against Much stronger players, I'd resign, but Carl's about my strength.  And, Coach Stockel that resignation after losing a piece is reasonable against much higher rated players.  But, if you're about the same rating, especially during a tournament, that's the time to slow down and try to figure out a way out of trouble.  Besides a couple of games where I won hopelessly lost games, I played one, a while back, against Loyd.  I had a winning initiative due to being an entire piece up.  But, then I made mistakes, didn't develop my pieces quickly enough, which allowed him to compensate.  Then, I misplayed the endgame which allowed Loyd to pull a swindle and win.  Thus, \"it's not over until the opera singer sings\" as Susan Polgar puts it.  Therefore, I follow ION's logic of, \"Play the man, not the board\".  I do this by pinning his Ne3.",
        "21. Bd2": "This move was to be expected, and thus, a conditional move.  As Carl breaks my pin and leaves b5 attacked.",
        "21... a6": "So, I protect.",
        "22. Rg1": "Carl Threatens something else.  I had a hard time figuring out what to do being that, Nh5 stops Carl's threat.  But, if I move it now, he'll win my Nd7 since it's pinned.",
        "22... Rd8": "So, I break the pin.  The idea behind this is to push Carl back with an attack of my own.  So, this move was a very short term plan.",
        "23. Nf5": "Carl swarms in with this N.  ",
        "23... Ne5": "? Overlooking the threat, I go right after Carl's B.  What I forgot is that I was going to be in check with 24.Rxg7+  My thinking was that if he takes there, I've got 24...Nxc6, winning back a piece.  But, Carl will stop that and win another pawn with his next move.  23...g6?? is even worse, given that the g pawn is pinned which I almost overlooked, as well.  This would've allowed 24.Bg5!, pinning and winning a piece.  Best was 24...Nh5, protecting g6, and if white attacks with 25.Rg5, or 25.Bf3, then I'd have 25...Ne5 as an answer.",
        "24. Rxg7+ Kh8": "In contrast to before, in a regular game, even against players of about my rating, I'd resign right here.  But, because this is a tournament, I was going to try to hang in longer.  Before I looked at how much time he had left over, I was thinking, who knows.  Even if I'm losing or lost, Carl's got to think about how much time he has left over.  And, if his flag drops, he's lost, even if it's a won position.  When I checked, I had about 25 minutes, but what I didn't realize is that Carl had about 46 minutes which didn't cross my mind for another move or two.",
        "25. Bb7 Nc4": "As now, I'm threatening to win a piece which is part of playing the man.  But, when I looked back at his time, this when I figured out just how much there was.  And, btw, how much time's left isn't based on 40 moves.  As ION asked me if it was that, or for the entire game.  How much time you have is for the whole game, which is why I posted all in all, with the time control.  ",
        "26. Bc3": "Not surprisingly, Carl protects by attacking my N.",
        "26... Ne8": "So, I go after his R.  I overlooked the discovered check on his next move which will win another pawn.  But, I'm, pretty much, out of good moves here.  Yet, I'm still not ready to resign, just yet.  You never know what can happen.  Instead, I'm doing something similar to Hope Chess, and just hoping that white will underestimate, at least, one of my pawns, which would allow one to become passed, and possibly even promote.  But, the hope is slim because, as I learned with not underestimating your opponent, Carl doesn't do that either.  When he's winning, he's very careful and does not make a lucky blunder that would allow a swindle.",
        "27. Rxf7+ Kg8 28. Re7 a5": "Still hoping for counterplay, I go after Carl's a3 pawn.  If Carl doesn't move the pawn, I'll play 29...b4, as the plan is to exchange pawns in an attempt to get a passed pawn.  But, once Carl plays 29.b3, I will take right away, as I thought that this was going to win back a pawn.",
        "29. b3 Nxa3 30. Bxa5": "But, I overlooked this capture.  So much for that idea.  ",
        "30... Rb8": "So, I start a new idea by trying to make Carl think that his Bb7 is attacked.  Of course, I know that it's protect by his Re7.  Carl realizes and finds a move that I'm about to overlook which doesn't matter at this point, when you're doing what's possible in a hopeless position.  But, I'm still hoping for a mistake by white that would allow me to turn this game around (pull a lucky swindle).  At this point, my main focus is on the b pawn since it's potentially dangerous.",
        "31. Bc6": "Carl moves his B which is what I was hoping for.  But, it's not because he thought it was attacked.  Instead, he's trying to win another piece, which I'm about to overlook.",
        "31... Rc8": "?? As I go after his Bc6, but this is now lights out.  31...Nf6 was essential here.  Even then, white's clearly better, but I might've still had a very slim chance of counterplay.  This takes away any hope, starting with his next move.   ",
        "32. Rxe8+ Rxe8 33. Bxe8": "At this point, there's no point in me annotating anymore until the end.  As resignation is now called for.  But, I was waiting to see what would become of my b5 pawn.  As I start getting my K into action.  As noted earlier, if this weren't a tournament game, I would've thrown the towel earlier.  Having said that, even though there's no hope left, I was thinking along a line that might cause Carl to make a mistake and let my b pawn break through, such as something like moving his Ba5, c3, or c4.  With which, I'd be prepared to sac my N, and attempt to break through with the b pawn.  But, I was almost certain that this wouldn't work.  And, we're talking about being 95% positive, with which, I was correct.",
        "33... Kf8 34. Bc6 Kf7 35. Bb4 Kf6 36. Be4 Ke5 37. Bxa3 Kxe4 38. Nd6+": "Having said that, I resigned here.  Upon analyzing it, I figured out that I'm now in a fork between my K and b5 pawn (which he's going to win.)  In the aftermath, I only have the h7 pawn which is effectively blocked.  Thus, there's nothing that I can do to stop Carl from promoting.  And, that's not to mention the time control.  To be exact, I only have 14 minutes, against his 43 minutes.  So, even if I were to delay his promotion for many moves, I would have lost on time, anyhow.  In fact, I would've timed out before Carl would have the chance to promote.  Knowing that, I caved in which put me in 3rd place for this tournament.  "
    },
    "url": "https://gameknot.com/annotation.pl/otb-tournament-game-5-semi-finals?gm=65619",
    "gameName": "OTB Tournament Game 5-Semi Finals",
    "players": "Carl  vs. Joe ",
    "opening": "Queen's pawn (D00), stonewall attack"
}