{
    "moves": {
        "1. e4 e6": "I started off with my usual, and Loyd answered with the French Defense.",
        "2. d4 d5 3. exd5 exd5 4. Nf3": "Sticking with mainlines with the last few moves, but this is where I decide to develop.",
        "4... Nc6": "Continuing with his development, as well.",
        "5. Bb5": "Playing this, as though, it were the Ruy Lopez, keeping in mind that his Nc6 is pinned.",
        "5... Bd7": "Breaking the pin in the conventional way.  So, waste no time by not hesitating to castle.",
        "6. O-O Bd6": "Mobilizing his K side with a strong bishop pair.",
        "7. Nc3": "And, I continue with my development.",
        "7... Nf6": "So does he.",
        "8. Bg5": "I complete my development.",
        "8... O-O": "He castled.",
        "9. Nxd5": "?? Figuring that it was at a bad time and that he missed the story that the board was trying to tell him, I took without thinking twice about it.  But, this is a blunder that should've lost a piece for pawn.  Just about anything is better.  Normally, I don't say anything afterwards if it's someone of my strength or not as strong.  He's stronger, so I'm fortunate and happy (even if not supposed to be) that he didn't spot it.  The only move I was calculating was what comes to my fixation on exchanges as this was before my game with Ken.  And, what I calculated became a reality, as now, it appears that his K side will be destroyed.  But, taking was just bad as this could and ought to have failed.",
        "9... a6 10. Nxf6+ gxf6 11. Bh6": "Taking advantage of what happened, I attack his Rook.  As I was trying to apply what bhidragon did to me in my last game with him.  But, this was miscalculated due to the blunder I made of taking the pawn without giving any thought.",
        "11... Re8": "Centralizing his Rook.",
        "12. Bd3": "Trying to put pressure on his K side.",
        "12... Nb4": "I don't know why he made this move but didn't care either, even if, I should.  As far as, I was concerned, it was an inaccuracy.  As now, I'm more focused on exchanging pieces since I'm ahead.  What I didn't know until that blunder which Ted missed is that, it's not a good idea.  Since, in that game, I overlooked that he could've won a piece.  My assumption was that I had an edge, and that, I'd try to capitalize on that, as per Susan Polgar's advice.",
        "13. c3": "So, I attack his N, keeping that exchange in mind which is going to become a reality.",
        "13... Nxd3 14. Qxd3": "After this, however, I lost track of what was played.  As I had 14...Qe7 15.Rae1, Rd8 16.Qd2, but then black left his Queen vulnerable, and I failed to take his Queen.  Well, that didn't happen, as not only didn't Loyd leave his Queen en-prise.",
        "14... Bc8 15. Qd2 Bd7 16. Rae1 Qc8 17. Rxe8+ Bxe8 18. Re1 Qf5 19. c4 Qh5 20. Bf4 Be7 21. Bxc7 Rc8 22. Qf4 Qa5 23. Qg4+ Kh8 24. Nh4 Qg5 25. Qxg5 fxg5 26. Bg3 gxh4 27. Bxh4 Rxc4 28. d5 Bxh4": "So, in a case like that, all that matters is how long the game lasted, and what happened.  It was 28 moves, and in the end, I wound up losing, at least, a piece and pawn which was enough for me to resign as there was nothing else to learn from the game.  In the actual game, though, I lost a piece, as well as, my Queen, without compensation which is why I resigned.  The moral isn't what's in the annotation, itself, but rather, in the actual annotation.  And, what it boils down is how I actually lost a piece.  The problem was that I had my B and Queen tied down which is how he won that.  So, the lesson to be learned is what I learned a while ago.  It's not a good to tie down and restrict your own pieces.  As that gives you problems, which your opponent can exploit."
    },
    "url": "https://gameknot.com/annotation.pl/otb-chess-game-2?gm=61473",
    "gameName": "OTB Chess Game 2",
    "players": "Joe (1350) vs. Loyd ",
    "opening": "French (C01), exchange, Svenonius variation"
}