{
    "moves": {
        "1. e4": "So, I start off with my usual, and so does Ted.  Therefore, it's, as usual, going to become a Ruy Lopez.",
        "1... e5 2. Nf3 Nc6 3. Bb5 a6": "The usual response.  So, I'll answer with the conventional move, as well.",
        "4. Ba4 Nf6": "Usually, he answers with 4...b5 which is the most common response.  However, there's nothing wrong with this move.  And, bringing the other N, although it hasn't transposed into this line, this became something like the Berlin Defense.  The only differences are that whites LSB is not on a4, and black's a pawn hasn't advanced.  Otherwise, it's the same idea.",
        "5. Nc3": "So, I treat it, as though, it were the Berlin Defense since is the most common reply to that.",
        "5... b5": "Now, it goes back to what you most see in the Ruy Lopez.  So, my next move will be the same.",
        "6. Bb3 Na5": "? Ted often plays that.  But, this is where that bringing the N is on the rim but not the normal reason.  What I mean is that it's not due to the guideline of a N on the grim is rim.  Instead, there's more to it, as this move is going to lose a pawn.  In the past, I'd just castle and allowed an exchanged.  However, seeing that e5 is not defended, I take, especially given that my e4 is, on the other hand, protected by my Nc3.",
        "7. Nxe5 c5": "?? I'm not sure why he played this.  He was certainly fatigued here, so my guess is that he was zoning out.  But, this is already going to result in ruinous loss of material.  With that being said, 7...Qe7 was forced.  Back in the day, I'd answer with Bxf7+ only to take away his right to castle and win a pawn.  Seeing however, that I can fork with my N and get his Rook, I'm going to do that.  BTW, this was not my original intention, for had it been, I wouldn't have taken on e5.  That's because it would be a cheapo tactic which they can drive away.  The real reason behind my last move was because it wins a pawn with no way to defend.  This blunder, as noted, is going to spell disaster.",
        "8. Nxf7 Qb6 9. Nxh8 c4": "Sort of overlooked but am not surprised to see Ted play this.  I was wondering what to in order to capitalize on my advantage.  Yes, he is going to a piece, but the question is can I get something to exacerbate the situation?  Definitely, and I am going to do that with my next move.",
        "10. Bxc4 Nxc4 11. O-O": "Knowing my advantage, I capitalize on that, as noted by Susan Polgar in an e-mail course, by castling.",
        "11... Bb7": "Continuing his development, whilst, attacking my e4.",
        "12. e5": "So, I attack in an attempt to protect while gaining tempo.  I'll admit that this the one thing I need to stop thinking.  That's because this move is a mistake, as he will get a pawn back.  Better was to move my Queen to the e file.  Beyond that, (so best), however, was 12.Re1.  Not only does this protect the e pawn, but it centralizes a Rook.  And, as I recently learned, one way of controlling the center is to centralize the Rook.",
        "12... Nxe5 13. Re1": "Remebering here about centralization, I play that move now.  But, it would've been better a move earlier, as now, he has gotten back a pawn.",
        "13... O-O-O": "?? But, this was another blunder as it loses another piece.  Much better would've been 13...Qd4  Best, however, was 13...Bd6, as not only is the N protected, but Ted has completed his development, as well.",
        "14. Rxe5 Ng4": "?? Kicking my Re5.  I'm presuming that fatigue combined with tempo gain obsession led to this mistake.  But, this is yet, another blunder as I'm going to win a piece.  Just about anything else was better then this move.  For me, just that hyperfocus and fixation was enough to make a mistake like this.  When, however, you add fatigue, yes I'm understand where Ted comes from as I used to cope with that pattern.  In fact, the week before, I played two games.  The second one was annotated, where I applied what I learned from the N+B mate.  But, in the game before, my play was horrible and wound up making terrible mistake.  Therefore, I should not have won that first game.  With best play, I should've gotten a draw, at best.  I was very lucky that Ted didn't see the mistake, and it was then that I was able to figure out and force a win.  But, the mistake was directly caused by only getting 6.5 hours of sleep, the night prior.  Not only that, but I had a cup of coffee before the chess club and started getting tired, shortly there after.  This led to a mistake in the game after but was, somehow, able to find enough energy to apply what I learned about how to mate with N+B.",
        "15. Qxg4": "Once I took again, Ted resigned as black figured out that he didn't stand a chance.  Right after this game, my opponent told me that he was not concentrating and got a cup of coffee to help him stay awake.  That's how I could tell that he was fatigue because in the next game (which was my most recent annotation), he played much better and won.  That's because when I made that super blunder due to being distracted from the jazz band warm up and major time crunch he won my Queen.  And, I resigned, right afterward.  So, the moral of this story is to be well rested before a chess game.  If you're playing and did not get enough sleep the night before, you'll wind up fatigue.  That can cause blunders which, in the end, become costly, and that's what happened here."
    },
    "url": "https://gameknot.com/annotation.pl/otb-chess-game-well-rested?gm=61353",
    "gameName": "OTB Chess Game-Well Rested",
    "players": "Joe (1350) vs. Ted ",
    "opening": "Ruy Lopez (C77), four knights (Tarrasch) variation"
}