{
    "moves": {
        "1. e4": "For now, it's against Jack, and I start with my usual.",
        "1... e6": "And, he plays something different then what I expect.  I am sure that the idea is also playing different openings that I haven't seen in some time to help me learn.  And, it boils down to the same thing that happened in my second game against Kenneth_fiore_3 and before with the moral being how intense openings can be.  On the other hand, I am very used to playing against the French Defense, so for now, we stick with mainlines.",
        "2. d4 d5 3. exd5 exd5 4. Nf3": "But, I did not know how to continue after exchanging, so I go back to what I know.  Therefore, I continue, as if, we're about to go into the Spanish Opening.  But, the only idea behind that is development.  Therefore, nothing else came into consideration.",
        "4... Bg4": "What I overlooked is the pin.",
        "5. Be2": "But, it's not a problem as I simply break it.",
        "5... Nc6": "Not surprisingly, Jack continues with his development.",
        "6. O-O": "So, I castle at once since this is what I enjoy doing, anyhow.",
        "6... Nf6": "Meanwhile, Jack continues with his development.",
        "7. Bg5": "And, I decide to continue to develop with this pin.",
        "7... Be7": "Not surprisingly, he also breaks this way.  And, as Jack said, which I keep in mind on the fifth move, the most common way to break the pin is with the B.  The only time I'll ever give it more thought is when a piece is en-prise and needs to be defended.  That only happened in a team match, with which, I was lucky to get off with a draw.",
        "8. Nc3": "With that I complete my development.",
        "8... O-O": "As does Jack by castling.",
        "9. Qd3": "I didn't know what else to do, so the decision was made to mobilize the Queen.  One idea being is getting the Rooks connected.  But, the other was putting my Queen on the same diagnol as my Be2, with the idea to put pressure on Jack's Nc6.",
        "9... Nb4": "That plan doesn't work since he uses it to attack my Q.",
        "10. Qd2": "So, I am, instead, planning to put pressure on the other given that my Q is on the same diagonal as my Bg5, instead. ",
        "10... a5": "Worried that his Nb4 is under attack, Jack tries to defend this way.",
        "11. a3": "But, I've got an answer since it is now attacked.",
        "11... Nc6": "Right after this move was played, Perry shows up.  So, up until now, I was against Jack.  But, that is going to change.  Even though there's no tournament game, Mr. Stockel wants all of his students to have a chance to play for learning purposes which is sensible.  And, what he told Perry is that it's even.  I agree.  It stays like this for now but will change shortly when the first mistake is made.  For one move only, Jack gave him advice.  I thought that this would go on and off, in which, it would turn into an OTB consultation game.  But, that didn't occur since Jack was busy studying the OTB tournament games.",
        "12. Ne5": "With that being said, I played this to either force Perry into having doubled pawns by exchanging on c6, or if he exchanged on e5, black would face a tremendous amount of pressure with Bg5.  However, this is where Jack gave Perry advice to exchange on e2, first by saying, \"Take the Bishop\".  He was wondering, and questioned it.  But, Jack told him just to take that way.  Then, after looking harder, he said, \"Ok, if you say it is the best move, it must be.\"  And, he played 12...Bxe2  Even though I didn't say anything, I agree with Jack.  However, Jack was going to spend time on the tournament, and when the games were over, that's when he was going to give his post game analysis on what the player did wrong.  In fact, that's one reason that there are absolutes time controls, as well.  On top of getting used to it for the real deal with tournaments, having the restrictions, gives Jack time to analyze and give advice for the future.  As that way, you learn and improve.",
        "12... Bxe2 13. Nxe2": "Not only did I consider taking back with the Q, but 13.Qxe2? was almost played.  What stopped me from doing that is the fact that my d4 pawn is hanging.  By capturing this way, it is protected.",
        "13... b6": "?? Perhaps, he was thinking about a pawn chain.  But, this is his first blunder as it gives me a free piece.  With that, just about anything was better then this move.",
        "14. Nxc6 Qd6": "Any other Queen retreat, as we know, would've lost material.  But, with it, I take advantage of the opportunity to liquidate since I'm ahead.  As that's generally what you want to do.",
        "15. Nxe7+ Qxe7 16. Nf4": "As in the aftermath, his Nf6 is left indirectly pinned.  With that, I use the moment to attack his d5 pawn.  When he defends... ",
        "16... Rad8 17. Rfe1": "I attack his Queen by centralizing my Rook.  When Perry retreats...",
        "17... Qd6 18. Nh5": "I play this.  Seeing that his N is still pinned, this move also attacks twice.  But, there's more to it, for when he breaks the pin, I accomplish a short term goal.  It is based on a variation on a move that Ken recently asked me if I had considered.  That was during my win against Jack Stockel as it would have doubled up his K side pawn structures.  In which, I might have been happy afterwards.  Well, that is about to happen here, and I am quite here.  But, if that's not enough, there's even more as we'll see soon.",
        "18... Rd7": "?? As Perry breaks the pin this way.  But, after the game we played through some variations, and it turns out that this is the losing blunder.  It looks like black isn't going to lose any more material.  However, the real threat is against his King.  And, that threat is unavoidable now.  As Jack pointed out, best was 18...Ne4  And, despite moving a pinned N, it doesn't lose any more material since my Queen is attacked.  After I retreat, he analyzed what happens after I believe it was 19...Rc8  From there, we continued after the game.  It turns out that with being a piece up and not allowing counterplay, including the stalemate ideas, I would've won.  But, it would've been very difficult.  And, I would not have won until the very end.  With this move, however, it is over very quickly in a way that I almost overlooked.  The only way around that is to take back with his Queen, instead.  But, it would still be lost.  As now, you're talking about a free Q, and I would do whatever possible to prevent counterplay.  He obviously saw that and doubled up his pawns which will end the game even faster.",
        "19. Bxf6 gxf6 20. Qh6": "With those doubled pawns and weakened King, along with my Nh5, I add another attacker.  Had it not been for my loss against bhidragon, I would've overlooked this.  However, after I made a terrible blunder and hyperfocused developing my Nb1, this was his winning move.  I was only able to apply this technique once.  And, it was against Ted.  The win would've taken a little longer, but I would've either mated or won the Queen.  In that case, it was a checkmate.  But, in this position, it is a mate immediately.  Before playing this very move, however, I did ask myself a position somewhat similar to this that occurred with GM Susan Polgar in the mega bundle.  Since in that game it would've worked.  So, I asked myself what would happen if Perry moved his Rf8.  As it would be the question of can he defend and get the K out.  At first, I thought yes, but when I reanalyzed and saw where his K is, I determined that it's a no.  Unlike that game, Perry has only one move that he can make with his K, but it is not going to help which means that there is no escape here since it is, pretty much stuck in the corner.  With that, I played this as it forces an immediate win.",
        "20... f5": "The only move that would've delayed the mate was giving up the Queen with 20...Qxh2+, but after I recapture, the position is the same, and there is no way out.",
        "21. Qg7#": ""
    },
    "url": "https://gameknot.com/annotation.pl/otb-chess-game?gm=62709",
    "gameName": "OTB Chess Game",
    "players": "Joe (1293) vs. Jack and Perry ",
    "opening": "French (C01), exchange, Svenonius variation"
}