{
    "moves": {
        "1. e4": "Now, I looked at the game, and as it mentions, this starts off as the Sicilian Defense and becomes the open variation.",
        "1... c5 2. Nf3 d6 3. d4 cxd4 4. Nxd4 Nf6 5. Nc3 a6 6. Bc4": "So, as I would expect, white plays this to get another piece out.  But, there's more to this then meets the eye.  I showed Jack Stockel this game and he told me that this is the proper and most common continuation of the Open Sicilian.",
        "6... e6": "I like this move as it is developing and it opens up a line for blacks DSB.  And, believe it or not, Szendrei kept this in mind because he will bring that out, on his next move.",
        "7. Bb3": "At first, I did not know why white decided to retreat her LSB, as opposed to developing her DSB.  Afterall, it doesn't appear attacked and there was no danger.  I mean if say 7...d5 8.exd5, exd5 9.Nxd5, Nxd5  However, a second look at this position shows why.  After, say 10.Bxd5, 10...Qxd5 so white loses a piece.  Now, of course, if I were playing this game, I would've made that mistake and instead of 7.Bb3, I would of played something like 7.Be3??",
        "7... Be7": "As noted earlier, black brings his DSB into play.  As it turns out, this time, it's what I'm thinking.  It turns out that black is planning to and will castle on his next move.",
        "8. f4": "I do not know why JP played this.",
        "8... O-O": "As noted, black castles.",
        "9. Qf3": "Now, I also wasn't sure why she moved here and brought the Q out before developing her DSB.  But, Mr. Stockel told me that this is actually a very good.  And, she played to come in, attack his center, and put a lot of pressure on the f file.  With this move, white now has a slight edge, believe it or not.",
        "9... Nbd7": "A developing move.  However, in order to avoid the feeling of being crammed, I would have played 9...Nc6, even if it meant exchanging Knights.  On the other hand, my coach told me that this move was nearly forced and that 9...Nc6? would be a mistake.  This time, however, I don't why that would be so.",
        "10. g4": "At first, I wasn't sure why she played this, so I asked Jack.  And, he told me that it puts even more pressure on blacks K side.",
        "10... e5": "Now, I like this move a lot as he's hitting her N.",
        "11. Nf5": "So, this appears to be a retreat that's simply a better outpost then 11.Ne2.  However, that isn't so.  Mr. Stockel accurately contradicted that when he said, \"Wow, white's getting really nasty.\"  I agree, and this time, see why.  \"He better be careful from now on\" because white's N is very strong.  And, if Szendrei doesn't watch out, Judit Polgar can get both the Q and the N in action to expose black's K.  ",
        "11... Nc5": "Black moved here to exchange pieces with white, which is about to happen.  However, I don't know why he made this choice, as opposed to, preventing the threat.  Right now, he has more important things to worry about and should be paying attention to that.  Having said that, best was 11...g6! because of what I mentioned in the second sentence.",
        "12. Nxe7+ Qxe7 13. g5": "So, now white puts the squeeze on black with this move, as opposed to, the other way around, as noted earlier.  ",
        "13... Nfd7 14. f5": "Again, at first I wasn't sure white moved here.  But, Jack said that this move is actually quite good.  She is now placing a lot of pressure on black, in pretty much all directions.  In fact, JP is becoming quite aggressive, and should win with best play although it's difficult to say what'll happen since none of them have made any mistakes, yet.  What we do know, however, is that Judit is playing extremely well.",
        "14... a5": "This time, however, this move did not get discussed.  Having said that, I do not know why Szendrei made this move.",
        "15. Nd5": "This move, I understand perfectly well and know where white is going for.  She's attacking black's Q, and then some.  After retreating, black is going to have some problems.",
        "15... Qd8": "Also feasible was 15...Qe8, but for some reason, I like this move better.  And, this is something that I also would have played, if I were black.",
        "16. Rg1": "The idea here is to put pressure on the g file and expose black's K here soon, within a few moves, as is about to happen.  It took me a while, but now, I completely understand what my coach means when he says that, \"She's getting really nasty.\"  Afterall, he also tells me that I'm getting really nasty when it comes to the same issue, King exposure.",
        "16... b6": "? I don't know why black made this choice, but in my opinion, this is his first mistake.  This is one of the few times, where better was 16...g6 to prevent what is about to come.  Now, why do I say this?  In general, it's not a good idea to put a whole around your K unless you're giving it, \"air to breath\", in order to prevent a back rank mate.  That's because putting a whole around it usually leaves it vulnerable to exposure.  While we aren't talking about back rank mates, this time, putting a whole around it is the way to prevent exposure, paradoxically.  We're talking about some danger, should white decide to play something like g6.  As it turns out, she won't, but something similar which poses the same kind of thread is about to occur, so be ready.",
        "17. Rg4": "However, it's not this move, and since we never talked about it in the chess club, I don't know what this move accomplishes.  Afterall, she's not going to play Rh4 or g6.  Instead, an exchange is about to occur, with black forcing the exchange.  What I'm saying is that she won't play what I just mentioned, after the exchange.",
        "17... Nxb3 18. axb3 Nc5": "!? I do not know why Szendri moved here.  What I do know, however, is that no matter what black did not have a good reason for playing this.  That's because Jack told me that he didn't know the reason behind this, either, but it's not the best move.  So, at the very least, this is an inaccuracy, and possibly, even a mistake.  In fact, it's quite dangerous, and best was 18...f6 because of what's about to come.  That's why I'm emphasizing this as a !? choice. ",
        "19. Nf6+": "And, this move proves that 18...Nc5!?  But, what's going to happen from here?  Well, things are going to get very interesting.",
        "19... gxf6": "?? This move looks very good because you'd think hmm, at the very least black just won a piece for a pawn.  Well, that's just too easy.  According to my coach, this is a losing blunder.  But, I had to evaluate for myself by looking at the entire board since easy19 emphasizes to, \"be a spectator of your own game.\"  So, after analyzing this position, I realize that Jack is spot on.  This move loses right away.   Therefore, best was 19...Kh8 and this is what Szendrei really needed to play.  Now, there's more to this story then meets the eye, and I will cover them in the end.",
        "20. gxf6+ Kh8": "Now, he plays what would have been best on move 19, as noted earlier.  However, it's too little, too late.",
        "21. Qh3": "At this point, black resigned.  At first, I wanted to know why as resignation seemed premature.  However, the coach told me why and that it wasn't so.  In that, he accurately implied that white now has an unavoidable mating pattern.  First, he directly stated that white immediately starts with Rg7.  After that, I saw exactly what would have happened.  It turns out that this pattern involves a mating net because JP would use her Q to deliver a mate right away.  Therefore, it proves something important, as noted earlier.  So there are several morals to this game.  What are they?  First, it's based on something that archduke_piccalo mentioned in a previous annotation.  In this case, what might have been good 8 moves earlier is now a very serious blunder.  In that he implied that what sometimes would have been good earlier becomes bad later on.  Second, I learned from one of my favorite mentors here on GK that, what looks good, might be bad, as I noted in a different annotation.  This is the very reason that why is the most common.  So, like is a move good or does it just appear.  What actually makes it good or weak.  Why or why not.  Finally, \"to take is a mistake\", as also noted from a completely different annotation.  As therealjimfriar pointed out, \" always look a gift horse in the mouth. If any good player gives anything away then there is a reason.\"  That's the case here.  It looked like Judit Polgar blundered away a N.  But, it turns out that she made a reasonable sac.  And, it was also a trap which her opponent fell into by taking that piece.  Now, had black, however, saw what was really going and played 19...Kh8, he would have had a chance to stay in the game because despite one or two flaws, he played extremely well. "
    },
    "url": "https://gameknot.com/annotation.pl/otb-chess-tournament?gm=53206",
    "gameName": "OTB Chess Tournament",
    "players": "GM Judit Polgar  vs. GM Szendrei ",
    "opening": "Sicilian (B90), Najdorf, Lipnitzky attack"
}