{
    "moves": {
        "1. e4": "So white starts conventionally.",
        "1... e5": "Jeremy replies in kind.",
        "2. d4": "White play the Centre game (C21). It is not meant to give white any advantage, as it opens up the game too early.",
        "2... exd4": "So Jeremy takes.",
        "3. c3": "White offers a pawn sacrifice.",
        "3... d5": "Black counters in the centre. This is the recommended reply. ",
        "4. e5": "White advances.",
        "4... dxc3": "Black now takes the offered pawn.",
        "5. Nxc3": "White recaptures and attacks the pawn on d5.",
        "5... d4": "So black advances and counter-attacks the knight.",
        "6. Nb5": "And now the pawn on d4 is attacked twice, by queen and knight, but only protected once.",
        "6... a6": "Black gives the pawn back, as a rather nasty check is in the air.",
        "7. Nxd4": "White takes the pawn back.",
        "7... Bb4+": "But this check comes in. If white blocks with the bishop, the knight on d4 falls, so white is forced to play a very unnatural move.",
        "8. Ke2": "White cannot castle now.",
        "8... Qe7": "The pawn on e5 is now threatened. Ne7 is more commonly played here. We are now out of the Gameknot databases.",
        "9. Ngf3": "The logical way to protect e5",
        "9... Bg4": "By pinning the knight, black threatens e5 again.",
        "10. Qb3": "Not sure what this achieves. I was expecting Bf4 to protect e5",
        "10... Nd7": "Black could have just taken on e5 with the queen.",
        "11. h3": "White tries to relieve the pressure.",
        "11... Qxe5+": "Black finally takes the pawn with check.",
        "12. Qe3": "This presumably was the point of Qb3.",
        "12... Bxf3+": "Black takes.",
        "13. Nxf3": "Recapturing this way attacks the queen again.",
        "13... Qxe3+": "So the queens come off.",
        "14. Bxe3": "and white gets a piece into play. With these exchanges, white makes it less likely that his king will be mated in the centre.",
        "14... Ngf6": "Black develops the other knight.",
        "15. a3": "The bishop is attacked.",
        "15... Bc5": "Black offers an exchange of bishops.",
        "16. Bxc5": "and white takes.",
        "16... Nxc5": "Takes back.",
        "17. Rc1": "White hits the knight.",
        "17... Ne6": "This is the onyl retreat which protects c7 in the process.",
        "18. Ne5": "White advances the knight - I would be more concerned with developing the Bf1.",
        "18... Nd4+": "This seems a weak move. White wants to move his king to get it out of the way of the Bishop on f1. This just helps white achieve the development. 0-0 seems better.",
        "19. Ke3": "This also attack the knight.",
        "19... O-O-O": "This move protects the pawn on c7 with the king, and the knight on d4 with the rook, but leaves the pawn on f7 hanging. Presumably if white takes, black will save the exchange with Rh8-e8+. but it still seems like giving back a pawn...",
        "20. Bc4": "White finally develops the bishop.",
        "20... Rhe8": "Black pins the knight.",
        "21. f4": "White protects it. Nd7 for black now looks interesting to me...",
        "21... Nf5+": "Black checks white. White now resigned. I tend to agree with Jeremy that these is still a lot of play in this position. I think after the king moves, the knight on f5 drops back to d6 and white can't really capture on f7, for instance 22. Kf3 Nd6 23. Nxf7 is met by Nxc4 and Rd3+. \n\nMany thanks for reading, please leave a comment or two and rate it on the star system."
    },
    "url": "https://gameknot.com/annotation.pl/otb-tourney?gm=61079",
    "gameName": "OTB tourney ",
    "players": "???  vs. teardrop34 ",
    "opening": "Danish gambit (C21), Soerensen defence"
}