{
    "moves": {
        "1. e4": "So, I start off with the Kings Pawn Opening, as usual.",
        "1... c5": "As always, he responds with the Sicilian Defense.  Now, I already know that this is going to become an Open Sicilian.  ",
        "2. Nf3 d6 3. d4 cxd4 4. Nxd4 Nf6 5. Nc3 a6 6. Bg5": "After the Open Variation is complete, this is what I decide.  Like my misstep against blitzkov, I decide to play a line just like the Ruy Lopez.  Even though, it's nothing or can ever be anything like the Ruy Lopez, ION, in a different annotation stated, \"I think I can see where jkarp is coming from. He was intent upon the 1.e4 2.Nf3 3.Bb5 sequence almost regardless of what Black played.\"  That is absolutely the case.  The idea being is to experiment by playing the same type of variations that you would see in completely different openings and defenses.  Afterall, the same expert, ionadowman, added this statement, \"Back in schoolboy days, I liked the Queen's Gambit openings in which I would play 1.d4 2.c4. 3.Nc3 4.Nf3 5.Bg5. Then I encountered people playing the King's Indian (1...Nf6) and had no idea what to do against it. So I simply played the 5 move sequence I knew. It turned out to be a perfectly playable approach: I won quite a few games playing that\"  For me, this is completely different and out of the ordinary, making it an anomaly because I have never played this against my coach, after the open variation.",
        "6... e6": "?! At the same time, I understand that black wanted to develop by advancing a central pawn.  But, why not 6...e5, that was better and would have done the same, \"and then some\".  In addition, it would attack d N, forcing a retreat while he would be able to make a developing move.  This move, however, is an inaccuracy and nearly a mistake because he's blocking his own LSB, so that he'll either have to cram his position with ...Bd7 later on, or waste time to get it out.",
        "7. Bd3": "! Meanwhile, I am still determined to continue developing by getting another piece out, since you generally want to do this ASAP.  At first, I wasn't crazy about this because like Erika's (reachforgold's) game against me, my LSB right near a central square, which you generally need to control the center.  And, it's usually not a good idea to block this area since it's important to control the center.  This one piece can get in the way.  But, when I first told Mr. Stockel about, stating that I didn't like it, he said, \"That's a good move.\"  And, that's the very reason that I marked it with an exclamation point.",
        "7... Qb6": "In this position, black moved here to fork my b P a d N, and this is why my coach brought his Q out, before developing the other pieces.  Now, I can describe it as a forking move since it does not involve a N.  However, he is attempting a cheapo tactic which I should have seen.  ",
        "8. Nf3": "? Of course, I am not going let black win my N, but this is my first mistake.   As it turns out, I just missed one move that would have kept b2 pawn safe, as well.  Having said all of that, this move gives away a free pawn.  After the capture, he will attack my other N, so best was 8.Nb3 to prevent all of this.",
        "8... Qxb2 9. Ne2": "In this position, my only other option was 9.Na4, but I like this move better.  That's because I would rather not place my N on the rim, unless it is absolutely necessary to do so.   ",
        "9... Qb4+": "So, he attempts to intimidate white by placing me in check.  Now, the only other way he could have pulled off this check, was 9...Qc3?? but then 10.Nxc3, which instantly loses his Q.",
        "10. c3": "However, I am not going to be intimated.  Not only that, but I decide to punish black for his last move, with this one.  Of course, he was probably thinking that I would either exchange, when I'm already behind, make a move that would ultimately lose castling rights with 10.Kf1, but none of that was going to happen.  Having said that all of that, I also could have punished him with 10.Bd2, but that would cram my Q and delay center control, which I don't want to do.  As it turns out, my center is pretty much controlled, since I control a lot of center squares.  So, why undo something, when it's not necessary?",
        "10... Qa5": "Of course, also could have retreated with 10...Qc5, but then I just reattack with 11.Be3.  And, he kept all of this mind and wanted to prevent that which is why he moved here.",
        "11. O-O": "! Now, I decide to take advantage of my opportunity by advantage.  I wanted to do this before it was too late.  During this move, I told Jack that I finally have the chance to castle.  And, he replied by saying, \"Ok to castle.  Good move.  No question.\"",
        "11... Nxe4": "?? At first, he said that, \"better was 11.Ng3\".  That's because he thought that the last move gave away another pawn.  So, he told me to be careful, since I was two pawns behind.  ",
        "12. Bxe4": "But, then I told him something that he didn't see.  That since he took my P, I retake with my B which is why 11...Nxe4?? was a blunder.  Therefore, he just exchanged his piece, for my pawn, so I am actually ahead.  The reason that he didn't see this is because he has trouble seeing, so it's partial blindness, as I mentioned in a previous annotation.  Before I moved here, Jack thought that my LSB was blocked by something like my Q, but I'm not sure what exactly he thought blocked my LSB.  However, he quickly changed his mind by saying something like, \"Oh, you're right I didn't see this.\"",
        "12... h6": "Given that Mr. Stockel is now behind, he decides to go for it by attacking my DSB.",
        "13. Be3": "But, I just retreat.  I was struggling to find the best square, and I asked my coach where the best retreat square was.  He implied that it does not matter, when he stated, \"that bishop has to retreat somewhere.\"  After deciding for myself, I realize that he is dead on.  So, I decide to bring my bishops directly vertical to one another to establish a strong bishop pair.  Of course, that's not really a good way to determine, but this is how it usually, at least in a coaching or mentoring that I saw between adivela and steppenwolf.",
        "13... Qh5": "In this position, black has refocused his attention on trying to win my N.  But, that plan is not going to work.",
        "14. Nf4": "So, like before, I decide to punish with this time, but this time, it's because he neglected central control, and I am getting after him because.  Now, I actually thought that this move won the Q with no way out of it.  But, as it turns out, he had other options.  But, stay tuned because that's about to change, as we're about to see shortly.",
        "14... Qg4": "?? WTH.  This move loses immediately, and it is not a blunder.  In addition, Jack is not trying to test me, so why would my coach intentionally leave his Q en-prise like this?",
        "15. h3": "Well, as it turns out, Tom who's rating is also about 1800 USCF and is a little stronger Jack, given that he doesn't have problems with his vision arrived about 3-4 moves earlier.  Here's the thing, as already know Tom comes a little later but has to leave earlier then everyonelse.  And, there are only two chess boards, and Jack like to play two people.  In addition, he was in the middle of a game with Ted, his other student, Therefore, Mr. Stockel told me that he wanted to end the game immediately, so that Tom can play before he has to leave.  He will either play Jack or me.  In addition, my opponent is still a little behind, which gives white an advantage.  So, black decided to let white keep the advantage,  and that's the logic behind 14...Qg4??.  Now, had it not been for this circumstance, black would have escaped with 14...Qa5.  And, after this move, black resigned. "
    },
    "url": "https://gameknot.com/annotation.pl/otb-wtw-coaching-game?gm=51943",
    "gameName": "OTB WTW Coaching Game",
    "players": "Joe (1219 ELO) vs. Jack (1800 USCF)",
    "opening": "Sicilian (B95), Najdorf, 6...e6"
}