{
    "moves": {
        "1. e4": "Unlike the last two games, I am black this time around.  That's because Coach Stockel wanted to switch things up so that Carl would get used to playing with the white and black pieces.",
        "1... c5": "So, I stick with my usual.  The next few moves are all standard, as Jack explains to Carl.",
        "2. Nf3 d6 3. d4 cxd4 4. Nxd4 Nf6 5. Nc3 a6 6. Bc4": "This is also common in the Sicilian.  But, I sense that white might have a threat with his LSB and N.  I realize that I was wrong, but in the game, I was in a hurry, in an attempt to get the game finished, which doesn't happen.  ",
        "6... e6": "So, I just assumed that there was a threat, and treat, as though, white were attempting SM.  This isn't true, and players with experience don't.  This is one of them, but I treated it as though he did just to keep the game going.  I'm also am eying Carl's Nd4.",
        "7. Nf3": "To prevent any kind of nonsense, Jack has him retreat.",
        "7... Nc6": "Meanwhile, I continue with my development.",
        "8. a3": "This was played to prevent 8...Nb4.  What Jack didn't know, however, is that I was not going to play that, one or another.  As my primary focus is on development and castling.",
        "8... Ne5": "However, contrary to what I learned with Ken, this is a moment where I exchange just because it is possible to do so.  In other words, it's my readiness to do so.  And, although other things came into consideration, it's the time crunch.  For, had there been more time before noon (which is when I and others have to leave), I would've held off by developing my Bf8.  The problem is that with time being of the essence, my thought process is just absent.  As I didn't give this move a lot of thought, whatsoever.  Sure enough, my instinct about what's to come, as noted, is correct.  But, right now, white has an advantage.  For, the exchange means that I'm forced to double up my pawns.  And, I lose castling rights since 10.Qxd8+, with which, white is clearly better, despite it being even, material wise.",
        "9. Nxe5 dxe5 10. Qxd8+ Kxd8 11. Bg5": "That lose, also allows Carl to pin.",
        "11... Be7": "But, I just break it, regardless with what Jack has told me is the best way.",
        "12. O-O": "That allows Jack to castle.  And, this is where white's advantage starts to become noticeable.",
        "12... Bd7": "With that being said, I complete my development.  To be truthful, nothing else came into consideration because this was the quickest way to get my DSB into play.  What I don't like, however, is the pin that's about to come.",
        "13. Rad1 Rc8": "The plan here is to make, as though, I had castled.  It just takes four moves, as opposed to, one.  It's bringing a Rook over, getting the K down, bringing the other R over, and then, bringing the K back which is how it works.",
        "14. Ba2": "The idea was to protect his LSB, as it was attacked.  But, if I were Jack, I'd have Carl play 14.Bb3 where it's also protected.  And, the B keeps the pawns more supported since it seems more passive.  Meanwhile, I continue my plan of getting the R's connected by breaking the pin, at once.  And, although white still has the advantage, I am, believe it or not, feeling more comfortable.  This time, it's not because of the position, but rather, I'm feeling comfortable that white won't be able to convert his advantage into a win because time is running out.  Let's see, we started off with 30 minutes, but now, there's only about 15 minutes left here.  And, I'm continue to make it difficult for white to keep his edge.",
        "14... Kc7 15. Rd2": "This is Carl starts his plan of doubling up.  But, there's also pressure against my Bd7.",
        "15... Rcd8": "With me being almost out of time, as well, I forgot that Bd7 was protected by my Nf6.  Figuring that it was attacked, I add another defender.",
        "16. Rfd1": "But, this allows Carl to double up at once, after which, the pressure increases against me.",
        "16... Bc6": "So, I free it up by trying to put pressure on his e4 pawn.  I also had the exchange in mind.  As I didn't consider anything else due to not being able to double up, combined with being low on time.",
        "17. Rd2xd8 Rxd8 18. Rxd8 Kxd8 19. f3": "Which allows Carl to open up one of his pawns.",
        "19... h6": "So, I try to chase off white's Bg5.  I figured that it would work, but he exchanges.  And, believe it or not, right after we exchange, I feel happy and confident.  As right now, there is only 10 minutes left before we have to leave.  ",
        "20. Bxf6 Bxf6 21. Ne2": "White intends to get a better outpost with his N.",
        "21... Bb5": "So, I try to distract him by attacking it.",
        "22. c4": "And, I am certain that it will work.  The plan behind the distraction is preventing Carl from getting a good outpost with his N.  Had it not worked, 22.Ng3 would've been played, but he is also starting to feel pressure with the time.",
        "22... Bc6": "So, I sit back and wait just in case the opportunity to attack resumes.",
        "23. c5": "And, it does again.",
        "23... Bb5 24. Kf2": "After which, he defends.  But, that does not bother me because the plan worked.  As now, I will happily exchange, so that white can't do anything else with his N.  And, in this position, with only doubled pawns as an asset, white's advantage is gone.  And, with only 5 minutes remaining, I am, at this point, 100% confident that he won't be able to take advantage of my doubled.  Therefore, I have, ultimately, gotten myself out of trouble, that I got myself into with carelessness.",
        "24... Bxe2 25. Kxe2 Kc7": "Given that we're now in the endgame, I start using my K as a weapon.",
        "26. b4": "And, white advances his pawn, as this gives him a solid pawn chain.",
        "26... Kc6": "So, I race right over to the c file with my K.",
        "27. Bc4": "Trying to support his pawns.",
        "27... g5": "But, I don't care, at this point, given that time is almost with only about 2 minutes left.  So, I form a pawn chain of my own.",
        "28. Kf2": "And, he tries to race over to that file.",
        "28... h5": "But, I put a stop to that by making it impossible for white to play Kg4 which I believe was his intention.",
        "29. h3": "I'm not sure why this was played.",
        "29... Bg7": "But, I'm not worried about that.  As this move was played to ensure better mobility for my DSB where it now covers more squares.",
        "30. g3": "This is when I figured out white's goal.  The idea is trying to get a passed pawn.",
        "30... f5": "Like before, I put a stop to that.",
        "31. Bd3": "So, Carl brings an extra defender to stop me.  Now, if time weren't just about out, this would be lost.  But, I knew for a while, as previously mentioned that it would happen.",
        "31... Kd7": "As it did here.  And, with me having to leave to get ready for work, the game was declared unfinished which is how we leave it.  In other words, we will not be continuing this game at a later time, as some of you are used to.  Yet, it's not declared a win or loss since there wasn't enough time for white to win.   Therefore, my way of calling it unfinished is still in progress, but you can call it, from another perspective, a draw since we won't be going back to this game.  Meanwhile, I'm gonna have to work on playing better when time is of the essence.  I have improved though because the week after this game was played, I played another tournament game.  With a bigger handicap, I had only 20 min. against his 55 min.  I took my time, and thus, almost timed out.  But, with a better position, I was able to force the win, regardless.  I'll have to remember how I did that and not let the time crunch get to me.  For, if there was time to finish, I would've lost, with best play."
    },
    "url": "https://gameknot.com/annotation.pl/otb-mentoring-game-3?gm=62854",
    "gameName": "OTB Mentoring Game 3",
    "players": "Carl  vs. Joe (1293)",
    "opening": "Sicilian (B90), Najdorf, Lipnitzky attack"
}