{
    "moves": {
        "1. e4 e5 2. Nf3 d6": "She considered and almost played 2...Nf6 which, I'm not sure what it'd be called.  I think it would be the Two Knights Defense or the Berlin Wall.  But, I wasn't going to say anything on what's better because they're both common moves and they develop.  However, she decided to play this.  I explained to her that this is the Philidor Defense.  She was already impressed that I knew the name of openings and said I'm pretty smart.  I told her that I know the name because I've played against this, and the first time I played against this was with the first person I trained.  And, it was then explained that this is that Defense.",
        "3. d4": "The most common response.",
        "3... Nf6": "?! Not a mistake, but a small inaccuracy.  I understand why she played, this, though.  The idea is to develop.  But, best was 3...Be7  The idea being is that it doesn't lose a pawn, yet.  But, now if she plays it right, after 4.dxe5 black will lose the opportunity to castle.  Of course, I wasn't going to say anything here because Jack and ION have both told me that the loss of castling is a minor issue since all you must do is get the K out, push the R to the other side, and then, put the K back to where it was.  Then, it is, as though, you've castled.  The only issue is the loss of tempii which, in this case, can be easily compensated for.",
        "4. dxe5 d5": "?? This is her first blunder which I should've caught.  I thought, I won a pawn.  I actually told her that this is an inaccuracy because you allow me to undouble my pawns when I take back.  The idea is not to allow that.  ",
        "5. exd5": "But, the reality is that 5.exd6! was best as it wins a piece for a pawn.  And, that N doesn't have a chance to become dangerous.  By playing this, the N becomes powerful, and I will wind up with problems.  But, this is important, as now, I have something to learn.  What led to this blunder?  The reality is that there were sudden changes, not just because Jack's not there as that wouldn't lose, but when notating I had my folder on top of the paper.  And, I was trying to find a spot to place my folder.  Now, after this, I put it on a chair, but Ted walked in, and he needed it.  So, I was suddenly put on the spot.  The reason this is important, is that, while I passed the Double Bishop mate test, with like the highest grade, like this game, I was distracted by a sudden change, so I lost tempii.  But, this is worse as it is a real game where I'm training someone and missed the opportunity to get a piece.  Therefore, the question then becomes, how do you deal with the sudden changes?  The answer is that you pretend it never happened and that things are still normal even when they aren't.  And, if you do that, you've remained, it's like nothing happened, and that way, it doesn't affect you.",
        "5... Nxd5 6. Bc4": "So, now I develop and start coming up with a plan because, as I learned with GM Susan Polgar the idea is, strengthening your position.  One way you do this is, as long as, it's not unsound, you get aggressive, and in this case, I want to castle.  But, something is bound to happen.",
        "6... Bb4+": "In it, she says, \"This was just for fun.  But, now I end up in trouble, if you find the right move.\"  So, I said something which Jack implied when he said, \"No problem.\"  My response was, this is not bad at all.  You can easily get out of this, and she agreed.  In fact, how I got this idea was from Jack where he says, \"Don't get nervous.\"",
        "7. Bd2": "But, she figured that I'd get out this way.  I other words, Mary anticipated this move.",
        "7... a5": "?! The idea, of course, is to protect the B, but it is already protected.  So, with that, better was to castle, right then and there or to play 7...Nc6  Another way of saying is how he who must not be named would've said.  Better was 7...0-0, better was 7...Nc6  This, however, is an inaccuracy as I point out.  Now, she said, \"Jack dosen't like it when you move two spaces like this.\"   So, I blend it in with what he'd say, then.  But, I also added as this is important.  I said that this loses tempii because it doesn't develop.  And, the time is needed to develop, castle, and control the center.",
        "8. Bxb4": "So, I start capitalizing on my advantages by liquidating while up a pawn.  I also thought that I'd waste so that she'd take back with the a pawn.  She finds a better move, but nontheless, will lose the opportunity to castle with my next move.  With that, I will take advantage of my opportunity to castle right then and there, before it's too late.  The idea, as Susan also puts it is, \"Capitalizing your opportunities.\"  In addition, which I almost overlooked, when it comes to something like this, as I learned from a mentor, early Q exchanges are beneficial.  The idea being is that I now have a lead in development.",
        "8... Nxb4 9. Qxd8+ Kxd8 10. O-O": "But, this is not the best move because of what she's about to do.  Best was 10.Bb3, protecting the c pawn and R, whilst, eyeing the f7 square.",
        "10... Nxc2": "At first, I did, but in reality, even though it appears so, my last move was not an outright blunder.  For a while, I thought my R was a goner, until find my next move.",
        "11. Ng5": "!! Like last time, I nearly overlooked this, which is why I thought I was going to lose the R, without compensation.  But, this move bails me out of trouble.  When I played this, Mary said, \"You have evil intentions.  You are cruel.\"  So, I said, as per what Jack has also told me, you have to find a way out.",
        "11... Nxa1": "Right after this she said, \"At least, I have a R, in return.\"  But, the reality is that, they wind up exchanged.",
        "12. Nxf7+ Ke7 13. Nxh8": "She said, \"I've got nothing left.\"  So, I responded by saying, you're only down a pawn.  In part, that was the truth, but I was also giving her the same advice that Jack gave me about not getting nervous.  That's because, I'm actually implying that it's not, as bad as, it might appear.",
        "13... Be6": "So, she develops.  The only problem, however, is that it allows me to liquidate, while being up a pawn.  That's, for the most part, the problem.  But, with just a pawn, one could, compensate, if the opponent made mistakes.  I won't, though, because the idea is that you don't let your student get the advantage right back.  Instead, they have to learn from their mistakes, as what I learned, when I first started training players.",
        "14. Bxe6 Kxe6 15. Re1": "Now, the idea is protecting my passed pawn, and the way to do so is putting a R behind it.  It is passed since there are no pawns right in front, or to the side of that said pawn.  And, this happens to be an important since it's right in the center.",
        "15... Nc6": "She completes development, put's more pressure on my passed pawn, and is threatening to win piece.  So, I have to make some difficult choices.",
        "16. Nc3": "But, after some careful considerations seeing what she's really up to, I realize that the most important job is to prevent her from getting a free piece, even if it means losing my passer.",
        "16... Rxh8": "So, I take.",
        "17. Rxa1": "She says, \"Oh crumb\", so I said it's still an even exchange.  It's my way of implying, \"Don't get nervous.\"  Of course, it is not even because she equalizes which is also why 15...Nc6 was a good move.  And, that is the other reason I implied that.",
        "17... Nxe5 18. Re1": "The only thing is that equalizing means that I get to pin her N.  And, this pin is quite nasty, as we're about to see.",
        "18... Rd8": "?? This is a blunder as I point out.  In it, I said that best was 18...g5, to protect the N because of what I'm about to do.  The idea being is that if I then played 19.f4, we exchange the pawns, but she doesn't lose a piece as is about to happen. ",
        "19. f4": "So, she said, \"Yeah, I see, terrible.  You've got a good position.\"  So, I said that the idea is trying to get a better position, which I learned, as noted, from GM Susan Polgar and applied it for this game to coach her.",
        "19... Kf5": "The idea was to attack my pawn in return.",
        "20. Rxe5+": "I had a hard time deciding on whether to take my with my f pawn of R.  I decided to take this way with the idea being that once she captures my f pawn, I'll liquidate by taking on a5, and that way, I remain a piece up.  However, better was 20.fxe5  That way, it would promote, once and for all, and I'd win something much more valuable.  It would be a R for a pawn because my R stays behind the pawn.  So, once I promote, or even if I didn't, once she took on the e file, I'd grab her remaining R.  ",
        "20... Kxf4 21. Rxa5 g5": "? I believe that the idea was to add a defender to the K.  However, and I forgot to point this out.  The move played is a mistake.  21...Rd5?? is the worst as that loses the R.  And, why I say that is the idea on how to protect.  Therefore, best was 21...c6 to protect that pawn.  That's because the N can and will fork since she will be in check, and she cannot take with 21...Rxd5?? due to my R on the same rank.  So, once I check, black will lose another pawn. ",
        "22. Nd5+ Ke5 23. Nxc7+ Kd6 24. Nb5+": "Now, I run back.  The idea is, once again, \"Capitalizing my advantages.  I'm coming up with a plan for the endgame, and it's similar to the Double Bishop and the N+B mate using those same strategies.  For those that were in the Chess Warriors team and took the test, that strategy is the same which I posted in the KOH club about the endgames.",
        "24... Ke7 25. Ra7": "The idea here is to pin her b pawn.  No, I'm not trying to win anything else, yet, but the idea is to put more pressure on the b file.",
        "25... Rd1+": "Of course, she gets out of it, but as noted, I'm coming up with endgame techniques, as noted earlier with that link which are very similar to what I took in the quizzes that some know about, and it's how you use some of those difficult ones for standard endgames, as this is.",
        "26. Kf2": "It starts here.  So, what do we need to keep in mind.  In an endgame, the K is a powerful weapon.  In fact, I'd say that it's about as powerful as the R.  Now, in this case, my goal is to try and centralize my monarch, which means that I want it in the center and as close as possible to her K.  ",
        "26... Rd2+": "I thought the idea was to win a pawn but that isn't so, as I'd take back on b7, so it would be exchanged.  So, her real aim is to simply put pressure on my monarch.",
        "27. Ke1": "So, I get out by getting, \"The Opposition\" which is also very important in an endgame, as we learned about.  That's something that Jack also once emphasizes that, when you have the advantage, acheiving the opposition is very important.  However, best was 27.Ke3 because not only do I still get the opposition, but at the same time, I'm centralizing my monarch much more since it's closer to her K.  With this move, however, it's further away, which is something you generally don't want because when closer, there's more pressure on the opponents K so that it has less room to maneuver.",
        "27... Rd7": "Adding a defender to her b pawn.",
        "28. Ra3": "However, I decide to try and put a different pressure on her K.  In reality, what I'm doing is applying the same technique to what I used against chicoboy.  And, that's the only game where I had a very similar position to the N+B and K endgame against the lonely K where you figure out how to mate.  The only difference being is that I used my R and was able to beat him, but I kept in mind that if his K moved the wrong way, it would be mate.  And, that would be very similar to the N+B mate, except that you've used your R which is why I believe that in the endgame, the K is as powerful as the R, as they, do more or less, the same thing during that phase.",
        "28... Kd8": "? I think she was worried about a check on e8, which I was also planning to do.  But, as I tell her later on, this was a mistake because it loses a pawn.  Therefore, best was 28...h5  I now realize, after looking at it that just as good was 28...h6  I forgot to tell her, but had she played that, and I responded now with 29.Rh3, she could protect that pawn with 29...Rh7  ",
        "29. Rh3": "With that mistake which I tell her.  But, just before that, she said, \"That's terrible\"  So, then I said, just before what she should've played was that the only problem is the loss of a pawn.  Of course, I know it's far worse then that, as she's down a piece and a pawn, but I wasn't going to tell her just how bad it was, as Mary would get more nervous, and therefore, make more mistakes.  So, the idea is don't overcoach and keep her calm.  That way, her concentration is better and she doesn't make more mistakes.  And, the idea is keeping things positives so that the student doesn't resign either, as that's something I thought might happen as the idea is, \"Fight til the end.\"  By doing so, you learn more. ",
        "29... Re7+": "Although it seems odd, this is what I wanted her to do, as Mary will check to attack and gain a little confidence.  And, even though I won't mistakes, I want her to be calm and confident for learning purposes.  The idea is that by believing in yourself, you can make it through a difficult time, as I told reachforgoals during my first mentoring session with her.",
        "30. Kd2": "But, her last move now allows me to maintain the opposition and bring me one step closer to centralizing my K.",
        "30... Re5": "Maintaining confidence by going after my N.",
        "31. Nc3": "Now, I almost made a blunder here and came close to playing 31.Nd6??  The problem is that Mary would compensate with a skewer after 31...Rd5 which is something I can't allow.  The idea being is that one shouldn't allow their student to compensate as you make it too easy.  Instead, they have to learn from their mistakes so the only way is that you don't allow compensation and the way to do that is not make mistakes, like that.",
        "31... Re6": "She said, \"Have nothing left, no good moves.\"  So, now I said, it's not over yet.  In other words, I'm implying that resignation is still premature because I believe Mary was implying resignation and the idea is what I noted, that, \"it's not over, until it's over.\"",
        "32. Rxh7": "Meanwhile, I waist no time in grabbing that pawn that I noted.",
        "32... Rd6+": "At first, I thought that she was only doing this to get aggressive because of her position.  But, in reality her goal was to pull a swindle and get a draw by rep.  So, I must be very careful, and believe it or not, it almost worked.  Not to mention that I waisted time.  But, the reason it didn't is because I remembered what happened in the B+N mate quiz.  And, the idea is that you're supposed to be able to deliver check mate.  If you draw in any shape or form, then you fail.  While most failed due to 50 move rule, since there would be no captures and they couldn't check mate in 50 moves, I failed because the N moved too much, so the game ended in a draw by rep.  Well, if I didn't play 35.Kc2, I'm pretty sure that the same thing would've happened.  And, since I have a winning advantage and it's against a student, so more then just, \"the real deal\", allowing a draw would be terrible.  You can't just let your student off with a draw.  Instead, if you're winning you must keep that advantage because, if you don't, the student won't learn as much.  And, the idea is helping him or her learn from their mistakes in order to help them build, develop, and improve their games.  At least, I saw what was going on in time, and inhibited that chance of a draw by preventing another check.",
        "33. Ke3 Re6+ 34. Kd3 Rd6+ 35. Kc2 Rf6": "The idea is to be able to win a pawn with a fork.",
        "36. Rxb7": "And, I allow it because when she takes, this becomes an exchange, as opposed to, winning a pawn.  In addition, I once again, get the opposition and become one step closer to centralizing my K once I get out of check.",
        "36... Rf2+ 37. Kd3 Rxg2 38. b4": "No matter what I would've played, my h pawn is gone.  But, that is ok because I have two pawns that are better since they're passers.  With that being said, I come up with other ideas, and that's maintaining a pawn chain because, as I learned not too long ago, in endgames, one thing that is essential is a pawn chain with passed pawns as it helps you promote.  I couldn't find the best examples and had made some mistakes, as a couple of commentators in those annotations pointed.  But, this game is the perfect example of what I was alluding as a similar example was shown, I forgot exactly by who, but it was either an IM or GM, and his video was very good and instructive that I was able to apply it here.",
        "38... Rxh2 39. a4": "I also could've played 39.a3, with a pawn chain, once and for all.  But, the idea behind the chains is to protect one of the pawns.  But, in this position, I kept in mind that even if here, the a pawn is just as much defended by my N.",
        "39... Rh3+": "As expected.",
        "40. Kd4": "Maintaining the opposition, in the process.  Now, the only other way to keep my N safe was with 40.Kd2  But, the reason I played this is because I'm one step closer to centralizing my K.  The idea there is that the opponents K is confined, so now there is one less square that Mary has available for her K.  ",
        "40... g4": "Now, she has a passed pawn, which I will not chance.",
        "41. Ke4": "So, while I did mention centralizing your K, that wasn't the idea here, and forget the opposition.  With any other move, it's likely that black would get her advantage, and possibly win this game.  How do I know this?  A very similar position happened with amnita, and it was just like this, except that I did not have a pawn chains, and the R's were not present.  But, I just kept advancing pawns, and by doing so, she was able to promote.  Consequently, not only did I lose my advantage, but she got the edge and was able to pull a swindle because Amnita won what was a hopelessly lost game, as some know about from that annotation.  Well, I couldn't allow that.  And, knowing that her pawn was closer to the promotion square then my pawns, I just couldn't chance this one.",
        "41... g3": "And, she attempts to promote.",
        "42. Kf3": "But, I now stop it, cold.  And, she dare not discover check me with 42...g2+ as I'd win that remaining pawn with 43.Kxg2",
        "42... Kc8": "To put pressure on my R.",
        "43. Rg7": "But, no matter how you look at it, this is what I would've played, regardless, as now, black must lose her pawn, no matter what she plays.",
        "43... Kd8 44. Rxg3 Rh4": "She said, \"I have no pawns left.\"  So, I said, yes, and I knew how dangerous the passed pawn was and couldn't underestimate.  The idea being, of course, what Jack said which I also said in that annotation with my mistake against anitam.  That is, \"When you think that you have won or are in a winning position, be very careful, and do not underestimate your opponent.  Otherwise, you might start making mistakes and losing the game.\"  This especially applies here since, as noted, I was her trainer here, and therefore, could not allow Mary to get her advantage back for learning purposes.  That's also because, as easy19 puts it, \"Games that you win are bad for learning purposes.\"  Now, what he's alluding to is the person that's being trained, and I strongly with his assessment for the reasons outlined earlier, in part, because this is what Jack has implied.  And, that's why, when I'm with him, he'd rather play with me, then have me play with Mary.  That way, I also learn.",
        "45. b5": "Now, I get achieve that pawn chain.  And, part of it is that you advance one pawn at a time, so that they're directly diagonal from each, as they are here.  This way, the opponent can't stop both passed pawns.  And, usually as is with this position, none of the passers are stoppable.  There will be rare occasions where you'd be able to stop one but can't do so for the other, which is actually the idea behind it, but usually none can be stopped which is even better.",
        "45... Rh5": "The idea, which has occasionally worked is to stop one of the passed pawns.  However, the N does and will prevent her from being able to do so. ",
        "46. Rg8+": "I could've played 46.a5, but she might be able to refute this with 46...Ra7, and even if 47.a6, she can now play 47...Ra8 preventing those pawns from promoting.  Well, I wasn't going to allow that, so now the idea is forcing the K onto the 7th rank, and that way, things stay the same.  Except, that I will be able to promote a pawn. ",
        "46... Ke7 47. a5": "Having said that, I now continue the advancement.",
        "47... Rh3+": "Now, she checks just for thrills and giggles.  The idea being to maintain confidence and, for as long as, possible, in this situation.  This makes me impressed that Mary followed my advice by remaining calm in the worst of situations.  And, it also shows that she is improving her games.",
        "48. Rg3": "However, instead of moving back, I will prevent any more checks as that cost white time, and the idea as I learned in the Double Bishop Mate as noted much earlier where I waisted time is that, when you have a winning advantage you don't want to waist tempo.  Instead you want to get the job done.  Plus, if I got out with my K, she could continue checking me.  And, if this happened, the game could, eventually, end in a draw by rep.  Well, as noted, with a student, I won't make a mistake that will allow him or her draw in a won position, as the idea is helping the student learn from the mistakes. ",
        "48... Rh8": "She said, \"Darn\", and I understand why.  This time, I forgot what I said, and it is worth noting that I only made two mistakes in the notation.  However, I when it comes to remembering what I said, I have a near pictogram memory.  That means that I can remember exactly what is said real said, but not right after being said which would be pictogram, but once it gets stored from working into long term memory which is a general weakness.  Once I remember, however, I won't forget, and I remembered one of them very quickly.  This one, however, I didn't.   But, what I think I said was something like, don't give up, hope, yet.  Of course, the idea being is that if I was to make a mistake, there's still a chance that she'd be able to compensate.  So, I still did not her to resign yet because she wouldn't learn as much.  And, I'm not at all surprised with this move because with just a R, there's no way that she would allow me to liquidate, as noted since that would leave Mary with just her K.  I anticipated that, as well, which is another reason for playing with the idea being that now, I gain time promote.  And, at the very least, that kind of thing will happen.   ",
        "49. b6": "So, I continue advancing and maintain my pawn chain.",
        "49... Rf8+": "And, Mary does follow my earlier advice with this move as she's doing what she can to stay in.  This will help for, a move or two.  Worth noting is that, when I was in this situation, got nervous, and followed Jack's advice which I gave, I'd do so by placing my opponent in check, as I do so.",
        "50. Ke4": "But, getting out means that I prevent another check and therefore, prevent further loss of tempo by, once again, maintaining the opposition.  And, this is another reason that the opposition is essential, during the endgame.",
        "50... Ra8": "Doing, whatever she can to stay in and aiming for my a5 pawn.  If Mary finds the right move, she'll be to capture it, and therefore, stop one of my passers.",
        "51. b7": "Keeping that in mind, however, instead of continuing like a normally would with 51.a6 with the idea being, of course, the pawn chain, I play this.  The reason is that, even if she takes I promote instantly.  And, if black defends with 51...Rb8, I will play then continue that pawn chain with the immediate 52.a6, so that, no matter what she does, one pawn will promote.  And, that variation that I provided with 51...Rb8, 52.a6 is the main reason why a pawn chain is vital.  The idea being is that it will, generally, enable one to Q.",
        "51... Kd7": "?? As I told her, this is an outright blunder.  Best was 51...Rxa5, getting a pawn in return.  But, what I forgot to say was what someone once told me, which was, \"Almost any move was better then this.\"  The reason being is because of what I'm about to play.  Now, Mary took a quick break, but right after coming back, she forgot that I had played 51.b7  However, even for me, the position is resignable. ",
        "52. bxa8=Q": "At this point, seeing that black is only left the K, as opposed to, what I have, she resigned.  This time, as I agree because of what I said a move earlier that, at this point, resignation is no longer premature.  I would feel differently, if I only had a Q+K, in this position with her lonely K, as then, there would be a chance for Mary to get a draw.  That's because if I played things wrong, the game would end in a stalemate.  But, with this much material from white, there's no way that it could happen because no matter how you look at it, sooner or later, a checkmate becomes inevitable.  In the end, I told Mary that she played extremely well, in this game.  And, this is where Mary implied that I was a very good trainer by thanking me for taking the time coach her with a smile. And, I agree with Jack in the fact that she's really improving, as I've noticed this, myself.  She only made two or three mistakes as I told her, though in reality, I miscounted one, but that was enough to lose the game.  So, the morals of this game are, first, \"don't give things away\", as Jack puts it because doing so could mean disaster as things go downhill after, as I also remember from my game against elyhim where I blundered a pawn and lost.  And, as Dan Hesiman puts it, \"It only takes one bad move to lose a game. So be careful on every move.\"  That applies here because after Mary blundered her N, not too long after, things went downhill.  In addition, I learned something which I also mentioned earlier.  In chess and life, there are sudden changes.  And, when this happens you have to pretend that it didn't happen and things are normal.  By doing so, you play as you normally, and therefore, don't overlook or calculate anything.  With this being, I thank Jack Stockel for being the coach that he is, setting a good example for others, and bringing in the chess boards, regardless.  That is because, without it, this game would not have been possible."
    },
    "url": "https://gameknot.com/annotation.pl/otb-coaching-game?gm=59272",
    "gameName": "OTB Coaching Game",
    "players": "Joe (1268 ) vs. Marrian ",
    "opening": "Philidor (C41), Nimzovich variation"
}