{
    "moves": {
        "1. d4": "BTW, if 1.e4 was played, Jack would've answered with the French Defense since that's what it appeared I'd play.  But, as per ION's suggestion after mentioning it with Susan Polgar, I, for the second time, decided to play the Colle's System.",
        "1... d5 2. Nf3 c6 3. e3": "Joe: That's the Colle's Franketort.  Jack: That's ok.",
        "3... Nf6 4. b3": "Joe: The full continuation of the Colle's.  Jack: It's ok.",
        "4... Bf5 5. Bb2 Na6 6. Bxa6": "Meanwhile, the attitude begins, as I decide to capture Jack's badly placed Knight.  The real reason behind this move is that he's forced to capture away from the center.  And, I kept in mind the saying that you should capture towards, as opposed to, away from the center.  By being comfortable and what I'm used, as far as, I'm concerned, I have a small advantage which the idea is to capitalize.  However, there's only so far that this could go.",
        "6... bxa6 7. O-O": "Feeling more and more confident, I castle.  Now, this was delayed until it appeared that I got what I wanted which was noted a move earlier.",
        "7... e6": "Preparing to develop his Bf8, but as far as, I'm concerned, he's also blocked his center which I'll attempt to punish him.",
        "8. c4": "As now, I advance my c pawn.  But, unlike with bhidragon, it works because there are no threats here.  The reason for playing is the same as how I wound up blundering.  Now, I thought it was for center, but it's actually for a similar reason which helps but it's about safely bringing my Nb1 into play.  That's because the idea is that in 1.d4 openings, it should not be developed on c3, until you've advanced the c2 pawn.  And, that is exactly why this is played.",
        "8... Be4": "Bringing his B into a better spot, whilst, attempting to mess up my K side structure, it appears.  However, I kept in mind that it's not pinned, and therefore, don't allow it.  Therefore, I decide to bring mine in a better outpost where it'll be stronger then his Bishops.  My attitude to Jack is that I know what he's up to and now, \"Two can play that game.\"",
        "9. Nfd2": "The reason being is that it might seem crammed, but once I develop my Nb1, those two will work well.  The idea being is that both Knights close together can become very dangerous.",
        "9... Bf5": "Jack said, \"I'm not going to give you my Bishop.\"  For one thing, it's not a free piece.  But, in reality, this was calculated, and thus, accomplished my goal, as now, I can completed my development without compromising the position.  Therefore, I got what I wanted, for now.  The only problem is this attitude is going to become costly, so stay tuned.  The way it sounds here is actually how I'm thinking because, it's as though, I'm a, \"Mr. Know it all\", which doesn't work well in chess.  ",
        "10. Nc3 Bd6": "As now, he completes his development.",
        "11. c5": "So, I attack Jack's Bd6 for the thrills and giggles of gaining tempo and achieving a solid pawn chain.",
        "11... Bb8 12. b4": "Adding to my pawn chain and mobilizing the Q side.",
        "12... Qc7": "This is where I start to go wrong.  As now, he has a threat against me that I overlook.",
        "13. g3": "That's because, I originally played 13.Qe2??  Then, as homework, he made me find the only move that would get me out of mate, which was this.  After that, a chat ensued, and what bhidragon mentioned was a similar case but with Mr. Stockel getting frustrated for a, somewhat, similar reason.  Jack: How many years have I told you to look out for your King?  Joe: You've told me many times.  Jack: Don't make that mistake again, or I'll get really angry.",
        "13... Bh3": "After preventing mate, Jack attacks my Rook which forces it to e1, similar to what we saw with bhidragon.  Unlike, that game, I'm still safe, with accurate play.  However, I'm already in trouble with the monarch under siege, and that was due to the earlier thought process, as noted earlier.",
        "14. Re1 h5": "As this pawn is dangerous.  Little did I realize it since it's not a passed pawn, but you don't need a passer for this to be dangerous.  Come to think of it, tactical-abyss said a rook pawn can also be a liability because of the semi open file which this is becoming.",
        "15. Qe2 h4 16. Qxa6": "?? This is where the attitude is costly, but I do what I'm comfortable with.  The thing is that Jack Stockel is known to have glacoma, as otherwise, I wouldn't have considered with.  And, with problems in his vision, he has made a blunders, as we saw a week ago and then the time before.  That was, when I won his Rook for a piece.  Therefore, I didn't forget, but rather, ignored, that, \"To take is a mistake.\"  That's because I assumed that his glacoma got the best of him, and therefore, made a mistake that lost his pawn.  It turns out, that is where that pompous attitude is costly.  Similar to what we saw with bhidragon he gave this pawn away for a reason.  It turns out that by taking, my Queen is, likewise, out of play.  And, I'm now busted.    I was just focused on taking advantage of Jack being forced to capture away from the center which made me believe that I was gaining an edge.  But, we discussed it, and he said that there was no need to capture because that was a week.  Instead, his h pawn was the real danger.  With best, I'm going to lose two pieces.  Therefore, he said that best was 16.f3, as not only is the Queen still in play but it's more active right near the monarch (that's under attack.)",
        "16... hxg3 17. fxg3 Nh5 18. Ne2 Bg4 19. h3 Bxe2 20. Kf2": "?? Now, I didn't want to recapture due to thinking that 20...Qxg3+ is mate.  However, Jack implied that this is the final blunder, as he'll win my Queen.  So, we reviewed and he said that if I took back with 20.Qe2?? I'd wind up losing two minor pieces without compensation.  But, reanalyzed, and if I took back with the Rook or Queen, he'd have a mating sequence as the next move, no matter what I did would be 20...Qxg3+ 21.Kh1, Qxh3+ 22.Kg1, Bh2+, and if 23.Kh1, Ng3#  But, if I played 23.Kf2, 23...Qg3+ 24.Kf1 (forced), and now, 24...Qg1#",
        "20... Bxa6": "After getting my Queen, I resigned, as there's nothing else to learn.  When discussing how 16.Qxa6?? lost, he said that when you're trouble, don't attack defend.  But, after we said goodbye, God spoke to me, and I wound up thinking about this at work for the first 195 minutes of my shift and had a break down.  So, what led me getting in trouble in the first place?  It was what happened in the first, and as bhidragon previously noted, the way I was thinking.  It's true that I go wrong by not seeing the entire story the board reveals.  But, it's not due to my bag of chess quotes as he said.  Instead, it's the attitude of, I'll play based on what suits my style and what I'm comfortable with despite being corrected, so many times, over the past few years.  The idea being is that back then, (well before kenneth_fiore_3) unless it was Jack Stockel, tactical-abyss, archduke_piccolo,  I'll only listen to everyone if it's in my comfort zone where I feel comfortable and if it's what I'm used to.  If not, I'll ignore it.  This is also why I was pompous and impulsive and just did what my heart told me, without thinking twice about it.  And, showing off happened, even after receiving challenges dmaestro, elyhim, schakertje, thereaper1, and even, bhidragon in our regular.  Now, Dragon said that he was interested in how I was playing these days.  But, after a pm over what he saw in my annotations for years, my guess is that he was interested due to me showing off because that's how the other challenges start.  However, I'm very unusual, because after losing, even that recent, I still just did things my way and when they worked out, I had that big shot attitude.  But, this game makes history because it was not a challenge due to, showiness.  It was normal training, yet, that same attitude occured which led to my downfall.  Ok, so what goes into my thought process and why do I think like that?  It's because when I'm corrected, it's usually in third, as opposed to, second person mode.  So, when they make recommendations but it's for jkarp, instead of second person which would be me, (although it's meant to be constructive, I get embarassed and humilated).  That's how I still wind up acting out on impulse in my play and then being look what I accomplish.  However, the reason for feeling this way is because back in my days of High School people were using third character mode.  The idea, however, was to make me feel embarrased so they could get attention.  What I learned is two things.  First, when being corrected in third person, I just have to pretend that it's second person since it really boils down to, \"You say tomato and I say tomatto.\"  Second, even if you like to do what things you're way because it's comfortable, it's also important to, \"get of your comfort zone.\"  So, even if there are some things that I'm not comfortable, it's important to save position because it's about the story that the board reveals since chess is a language."
    },
    "url": "https://gameknot.com/annotation.pl/otb-wtw-coaching-game?gm=60916",
    "gameName": "OTB WTW Coaching Game",
    "players": "Joe (1355) vs. Jack ",
    "opening": "Queen's pawn game (D02)"
}