{
    "moves": {
        "1. c4": "Hello all; just a quick blitz game that I found enjoyable. White sets up a formidable center and a complex-looking position develops. White has a lot of space to work with, but his position has weaknesses as a result of all his pawn advances, while Black is a little cramped, but solid. As is so often the case in blitz, time pressure eventually forces a hasty computation in a sharp position, leading to a fatal miscalculation. Enjoy!\n",
        "1... c5 2. f4": "?! This is not any standard line I know of. More common are 2.Nf3 or 2.Nc3. With this move, White announces in no uncertain terms his desire to utterly control the center (and foreshadows a propensity for pawn-pushing).\n",
        "2... b6 3. Nf3 Bb7 4. d3 h6": "Preparing to challenge the center from the flanks, though 4...e6 or 4...Nf6 were probably better.\n",
        "5. e4 d6": "This move allows Black to develop both his Knights (by vacating d7 and defending e5). Both players have so far badly neglected their development, but White has a significant advantage in space, and very solid center control.\n",
        "6. Nc3 Nd7 7. Be2 Ngf6 8. h3": "Meant both to stop ...Ng4 and also prepare a kingside pawn storm.\n",
        "8... e6 9. Be3": "Not a great spot for the Bishop, in my opinion. c5 is very sturdy, so this move really does little except get the Bishop off of c1. 9.Bd2 would have been better, I think, with the potential to shift it into a kingside attack from c3 or centralize it on e3 if White decides to push the queenside instead.\n",
        "9... Qc7": "Black prepares to bring the Rook to the center, and places some indirect pressure on the White kingside. This does invite a White Knight to harass at b5, however.\n",
        "10. a3": "? This feels a little frivolous. Is White planning to storm both flanks and the center, all at once? Better would be a more cohesive plan of attack, ideally utilizing the powerful White center pawns by castling and preparing e4-e5, rather than just pushing and pushing with no clear goal. Every pawn move White makes creates another weakness.\n",
        "10... Be7 11. Bf2": "Black has so far kept his castling options open, waiting for White to make the first move against his reasonably solid formation. This move probably indicates that White is planning to push through the center, as he begins clearing the e-file for a Rook and allowing this Bishop to make its way over to g3 if needed.\n",
        "11... O-O-O": "The Kingside simply does not look safe for Black; there are too many aggressive White pawns there.\n",
        "12. Nb5": "Foreshadowed on Black's ninth move, this forces the Queen into an ugly-looking position.\n",
        "12... Qb8": "Black's position is cramped, but altogether not terrible. He has good possibilities for kingside/center expansion and a lead in development, even if his pieces are not quite ideally placed.\n",
        "13. b4": "White wants to bring forces to bear against the Black King, but he ought to begin worrying about his own monarch before he tears the position open like this. He's hardly prepared for this assault.\n",
        "13... a6": "Black seizes the initiative by kicking the Knight. White's queenside pawns don't honestly look that threatening, with the center still open and the White King still on e1. Besides, Black really doesn't want to capture on b4, so the better option is...\n",
        "14. Nc3 Nh5": "...switch wings to create threats and counterplay on all the weak squares created by White's pawn advances.\n",
        "15. Qd2 f5": "Black claims some space and presents a serious challenge to the White center for the first time. This move both threatens to break the position open and allows Black to play ...Nf6 without stifling his pawn storm.\n",
        "16. bxc5": "The kingside is looking pretty dangerous but White has *got* to get out of the center one way or another before he breaks it wide open like this...\n",
        "16... dxc5": "Freeing the Black Rook and DSB, while keeping a lid on White's 'good' Bishop.\n",
        "17. e5": "White prevents ...Nf6 and a disastrous opening of the center, at the price of offering the Black Bishop a beautiful diagonal. If White castles kingside now, he has to deal with that monstrous Bishop reaching right across his King's throat.\n",
        "17... Qc7": "Defending b6, mostly.\n",
        "18. O-O": "Frankly I think going queenside was a better option. Black actually has attacking potential on the kingside, whereas White has no queenside pressure at all. When castling on opposite sides, a sharp mating race can frequently result. Inviting this scenario when you have no attacking potential seems quite foolhardy.\n",
        "18... g5": "I had a slight time advantage here and I thought for over a minute before making this move. There are quite a few undefended Black pieces that could come under fire easily (Nh5, Be7, h6), but the opportunity to break open the White kingside and mobilize everything was too tempting, in the end. The main continuation I was considering was 19.fxg5 Bxg5 20.Nxg5 hxg5 (21.Qxg5? Rdg8! and Black wins back the pawn on g2 with check and a crushing windmill attack (eg. 22.Qe3 Rxg2+ 23.Kh1 Rxf2+ 24.Bf3 (24.Kg1 Rg2+ 25.Kh1 Rxe2+! 26.Rf3 Rxe3) 24...Bxf3+ 25.Qxf3 (25.Kg1? Rg2+ 26.Kh1 Ng3#) 25...Rxf3 26.Rxf3 Qxe5)), with 21...Rdg8 and 22...g4 to follow.\n",
        "19. Nxg5": "? I had briefly considered my response if White played this sacrifice, but I couldn't see a strong continuation for White and had discarded it. This move forced me to spend almost another full minute calculating, but I decided that the strength of my Rooks on a half-open g-file bearing down on the White King (along with my glorious LSB) would be enough to handle anything White could produce. It's worth noting here that while I had a little time left to spend thinking about my response to this move, my opponent was somewhat short on the clock.\n",
        "19... hxg5": "So, I accept. I played the next several moves without any hesitation.\n",
        "20. Bxh5": "? I was expecting 20.fxg4 Qxe5 21.Rab1, but this works out fine for me, giving an opportunity to lift this Rook.\n",
        "20... Rxh5 21. fxg5 Rxg5": "! The obvious move, 21...Bxg5, is playable but not remotely as strong. Now Black bears down on g2 with overwhelming force.\n",
        "22. Bh4": "?? White attempts to force the BR back and bring about a good trade and attack, but he has neglected his King's safety for too long, and the Black LSB is all too willing to remind him of that.\n",
        "22... Rxg2+ 23. Qxg2 Bxg2 24. Kxg2 Bxh4": "0-1. Black has any number of ways to finish the game from here. I hope you enjoyed it!\n"
    },
    "url": "https://gameknot.com/annotation.pl/out-of-the-frying-pan?gm=45897",
    "gameName": "Out of the Frying Pan...",
    "players": "Opponent  vs. bwaa ",
    "opening": "English (A30), symmetrical variation"
}