{
    "moves": {
        "1. d4 b6": "I was only trying to play the Queen's pawn game, but Black decided to take Long Ave. and play this move resulting in the Queen's Pawn (A40), English Defence.\r\nThis opening gives me, playing as white, an option to double check for tricks, or develope the wrong piece and lose.",
        "2. Nf3": "Definitely not 3.Nc3.",
        "2... Bb7": "This move was an inaccurate move. It does not pin the knight and Nc6 Blocks the Bishop's entire usage. Analysis recommended 2...Nf6 (Why did analysis consider this inaccurate when anyone playing this opening plays this line)? I think we should ignore the analysis's opinion because I see both sides of the argument.",
        "3. Nc3 c5": "Another mistake (as remarked from computer analysis). Better was 3...Nf6 (as of mow, I really don't see much of a problem with this move, but it can relatively cause queenside weakness later).",
        "4. dxc5 bxc5": "Computer analysis predicted this after Black's 3rd move was classified as a mistake. (I'm not sure that Black wanted this to happen or to play 5...Qa5).",
        "5. e4": "I reboot and start another attempt to gain central control.",
        "5... a5": "I wonder why Black did not try 5...Qa5? ",
        "6. Bb5": "I didn't really like this move, for Black can counterattack. Yet, I cleared way to castle safely.",
        "6... Nf6": "I'm still questioning Black's tactic for this opening, but the next two moves I play poison my position slightly. However, I'm not going to end up as mashed potatoes for Black.",
        "7. Be3 e6 8. Na4": "I'm bewildered about the moves played in an unusual opening: Why is Black not paying attention to his winning threat and is more focused on my queenside threat? I really think I shouldn't have played moves 7 and 8.",
        "8... Bxe4": "Black's Bishop (not his knight) took my e-pawn, and now we're going to get even with each other.",
        "9. Bxc5 Bxc5 10. Nxc5 h6": "10...Qb6, in my opinion, has more meaning than this move.",
        "11. Nxe4 Qb6": "When this move was played, it was played too late (according to analysis).",
        "12. Nd4": "So far, I'm not doing any better than Black after playing this blunder.",
        "12... Nxe4 13. O-O e5": "After I castled, this move became a mistake due to the  surprising 13.Re1.",
        "14. Qd3": "This move didn't seem right once I played it. I lose a tempo and forcefully lose a knight.",
        "14... Nc5 15. Qc4": "Flimsy Blunder loses knight by force. I wished I had played 15.Qe3. No wonder why 14.Qd3 didn't seem right at first glance! From now on, I wanted myself to play more cautiously to win, and this isn't even half of the mistakes!",
        "15... exd4": "Something was going through my head: Please don't take that suspicious and delicious d-pawn!",
        "16. Qxd4": "I think I lost my train of thought because I disobeyed my beloved king! Analysis recommended 16.Rae1+.",
        "16... f6": "I think Black thought that My Queen was a knight because he did not take my free Bishop!",
        "17. Rfe1+ Kf8": "Apparently, I can just play 18.Qd5. 17...Kd8 was a better alternative.",
        "18. Qc4": "I missed it, I missed 18.Qd5 (After this, I decided to stick with plan c: prove that you can win even with all these mistakes).",
        "18... Nb7": "Analysis wanted Black to play 18...Nc6, but seriously, that computer gives me a headache! It's complaining over almost every single move.",
        "19. Qc8+": "Analysis liked this move, but wait til you see how I blow up this breakthrough.",
        "19... Nd8 20. Bxd7": "Welcome to Ridiculous Ave., where I crazily blunder (this is the wacky pattern: I blunder, Black blunders).",
        "20... Ra7 21. Red1": "Long story: My Queen is stuck between two guarded knights (one is pinned to the King) and can't move unless I really wanted to lose the game entirely. Next, my savage bishop doesn't want to retreat and make-up another plan because he also is attacked 360. I abhor this Rook move and wished I played 21.Re8+ (If it's safe). Confused?",
        "21... Ke7 22. Rde1+ Kd6 23. Red1+ Ke7 24. Rde1+ Kf7": "Ridiculous Rook moves when I would have been smart enough to have my a-rook to d1, but with this game, there's no tactics involved! On move 23, I missed a two move mate 23.Rad1 (I wonder if anyone else had an insane game like this)!",
        "25. Qc4+ Kg6 26. Qg4+": "Same story here except now, even though this is a mistake, I am going to work around Black's active Queen and Rook (this is a successful plan).",
        "26... Kf7 27. Qh5+ Kg8 28. Re8+ Kh7 29. Bf5+ g6 30. Qxg6#": "Finally, it is mate. I never actually liked this game. Motto: Make sure that before you attack, you have a successful way of doing so. Also note that using tactics is better than making moves that came out of no where. I will never try to have another game like this frantic frenzy, but I'll learn from more of this if it happens again."
    },
    "url": "https://gameknot.com/annotation.pl/out-of-control?gm=40242",
    "gameName": "Out of Control!!",
    "players": "chesskingdom64 (886) vs. bagboy (905)",
    "opening": "Queen's pawn (A40), English defence"
}