{
    "moves": {
        "1. b3": "Hi everyone!\r\n\r\nLost my 44th game to Freddy the Master Mater.  At least I was trying to win this one but in doing so I over-extended myself which is what some of my lower-rated opponents have been guilty of doing against me.  So how did this all happen?  Well, it all starts with the Larsen's Opening, 1. b3 - a favourite of the Danish GM Bent Larsen.  As usual I will provide the Gameknot Analysis link to the game here.  http://gameknot.com/analyze-board.pl?bd=14047427&fb=1&rnd=0.7658726204127998",
        "1... e5 2. g3": "2. g3 - Hmm - a double-fianchetto.",
        "2... Nf6 3. Bb2 Nc6": "3. ..... Nc6 - develops a piece and defends my e5 pawn.",
        "4. c4 d6 5. Bg2": "5. Bg2 - Freddy completes the double-fianchetto.",
        "5... Bd7 6. Nf3 Be7 7. Nc3 Qc8": "7. ..... Qc8 - after developing the ecclesiastical twins, Fou Leblanc and Fou Lenoir, Glenda moves onto c8 to try and force a trade of light square bishops and weaken Freddy's castled position.",
        "8. Nd5 Nxd5 9. cxd5 Nd8": "9. .... Nd8 - with the idea of a possible c6 and an exchange of c for advanced d pawn allowing the knight to move back to c6.",
        "10. O-O Bh3": "10. ...... Bh3 - as Freddy chooses to castle kingside I decided to adopt my earlier plan of trade off of bishops and to delay castling.  I would have preferred to go queenside if at all but alas the decks are not cleared.",
        "11. Ne1 Bxg2 12. Nxg2": "12. Nxg2 - the trade takes place as planned.",
        "12... h5": "12. ..... h5 - I now decided to start a pawn storm on the kingside which does not quite get going.  This sort of thing is what Freddy has done to me so I have at least given him a miniscule dose of his own medicine!",
        "13. f4 f6": "13. ...... f6 - although Gameknot Analysis did not offer an alternative to this move, Freddy suggested that I should have followed up with h4 here.",
        "14. Qc2 Nf7": "14. ..... Nf7 - transferring my knight over to the kingside to attack/defend if necessary and I have at least moved one piece off that back row and next move I plan to put Glenda on h3 and then castle queenside.  However, Freddy puts a stop to the latter plan by keeping Henry either in the centre or having to go kingside after all.",
        "15. Rac1 Bd8": "15. .... Bd8 - another piece, Fou Lenoir takes the knight's place to defend that vulnerable c2 pawn from Freddy's heavies on the c column.",
        "16. Ne3 Qh3 17. fxe5 dxe5": "17. ...... dxe5 - the idea of f6 becomes apparent here - I played that move to support e5 - the e5 pawn prevents Freddy putting a rook on f4 in order to swing round to h4 forcing Glenda to retreat.",
        "18. Qg6": "18. Qg6 - aggressive but gameknot analysis suggested 18. Ba3 instead - please refer to the link in my intro speech for further detail.",
        "18... Kf8 19. d4": "19. d4 - hmm I expected Ba3+ here.  He is trying to deflect my e5 pawn from defending f4 as explained in a previous note.  However, it gives me a chance to temporarily carry out a Witch Ejection plan with  19. ...... Rh6.",
        "19... Rh6 20. Qd3 exd4 21. Nf5": "21. Nf5 - closing in on Henry and attacking my rook on h6.  I dare not play a move like Rg6 because of Ba3+ followed by a discovered attack winning the rook on g6 so I decided to move the rook to the safety of h8 only for Freddy to have suggested Ne5 as an improvement.",
        "21... Rh8 22. Qe4 Ne5": "22. .... Ne5 - I only received Freddy's suggestion that I should have played that move one move earlier just after I played Ne5.  I plan to move the knight to g4 and threaten mate (how dare I?!) on h2.",
        "23. Bxd4 Ng4 24. Rf2 Nxf2": "24. ..... Nxf2 - can't see anything much better but now Henry is doomed.",
        "25. Qe6 Ng4": "25. ..... Ng4 - allows mate in 3.  According to gameknot I would have had to have given up Glenda for the knight just to limp on against a player nearly 400 points above my rating.  No thanks, I prefer it this way.  So I think in retrospect that my attack was premature and Freddy thought that it was.  However, would you the jury rather see this than for me to keep defending all the time?  I look forward to hearing your views on this.  Hope you have all had a good weekend - bye for now - Joanne",
        "26. Bc5+ Be7 27. Bxe7+ Ke8 28. Nxg7#": ""
    },
    "url": "https://gameknot.com/annotation.pl/over-extended?gm=32182",
    "gameName": "Over-extended!",
    "players": "easy19 (2205) vs. jstevens1 (1827)",
    "opening": "Nimzovich-Larsen attack (A01), modern variation"
}