{
    "moves": {
        "1. e4": "I have been playing a whole lot of Queen Pawn Openings, and so I thought I'd mix things up a bit.",
        "1... c5": "The Sicillian Defense.  This and the Caro Kann are the reasons I've stopped playing 1. e4.   So if you play me and I do 1. e4, please do French, Open Game, Pirc, Scandanavian, or anything that isn't 1...c5 or 1...c6.  Thank you!",
        "2. Nf3": "All right.  It's hyper-popular and the line I feel most comfortable with.",
        "2... d6": "This is a very popular reply for black as well.  When I choose the Sicillian as black, I usually play 2...Nc6, but d6 usually comes later anyway.",
        "3. d4": "The book move, opening up the center.",
        "3... cxd4": "This move is virtually always played.  In fact, I would even go so far as to say that it is the whole foundation for the opening.",
        "4. Nxd4": "Of course.",
        "4... Nf6": "Standard.",
        "5. Nc3": "Still within my book in this game.  It's really sad how shallow my opening knowledge is...",
        "5... a6": "This move is a sort of waiting move for black, though it also keeps white's bishop and knights from the sometimes-critical b5 square.",
        "6. Bc4": "I think we're in the Najdorf, but I could be wrong.  Looking in the database when I got home, I found 6.Bg5, 6.Be3, and 6.Be2 are all more popular, but I don't think there's anything wrong with 6.Bc4.  Also, I recently read mybookrunesdeep's annotation and found mention of the sac, and I was already toying around with the idea at this point.",
        "6... b5": "Maybe this move makes white feel uncomfortable and explains the lack of popularity; personally, I have no qualms about playing 7. Bb3 and letting black get his queenside play going.",
        "7. Bb3": "Moving to d3 or e2 just admits I misplayed on my 6th and have given white tempo in his plan.  ",
        "7... e6": "Blunting my bishop.  This is a popular move and probably pretty good.",
        "8. O-O": "Black's queenside pawns have gotten some space.  Best not to castle long, especially since I want to open this game up!!  I'm feeling tactical. ",
        "8... Be7": "Logical.  Black wants to castle.  Both sides are fine with how things have developed.",
        "9. Be3": "Just getting my pieces out.  This move is extremely unpopular in both the world and gameknot databases.  The favored move, 9. Qf3  was quickly discarded by me in the game, for I worried about 9...e5, but that move would only saddle black with a backward d-pawn.  Still, this move is slightly passive and white has better.  ?!",
        "9... Bb7": "Why doesn't black castle?  This move leads to the interesting, but speculative sac.  After my reply, black told me he was busted and after the game, he felt that 9...0-0 was necessary.  ",
        "10. Bxe6": "I didn't calculate beyond the knight check, but I figured this had to be good for white.  I get at least three pawns for the piece and black's king is very exposed.  Is the sac sound.  I certainly don't know.  The one game in the gameknot database with my sac has black declining with 10...O-O.  The world database features a draw after a long game.  I felt that the practical difficulties it presented were worth the risk.  Plus, I was feeling tactical!",
        "10... fxe6": "Declining the sac didn't work in the database, and it shouldn't work anywhere else either.  White can move his bishop back, having won a pawn and crippled black's isolated d pawn.  White has a winning position.  Instead, black tells white to prove the sac is sound.",
        "11. Nxe6": "the obvious follow up.  Two pawns gotten, one to go.",
        "11... Qd7": "The only reasonable square for the queen.",
        "12. Nxg7+": "And now I began to worry.  Maybe I should have calculated farther?  Maybe things will end up badly for me after all?  ",
        "12... Kd8": "? This move is surely a mistake.  I felt very relieved that the more challenging 12...Kf7! hadn't been played.  The game in the world database featured this move and black achieved a draw with it.    I don't think I could have gotten the draw after 12...Kf7, but that would have been another game.",
        "13. Bb6+": "I played this check instantly, then kicked myself for being so rash and finally decided it must be ok for white.  Postgame, I haven't been able to find anything more challenge.  Perhaps 13.Nd5?  I'm not sure.",
        "13... Kc8": "Only move.",
        "14. Re1": "Panic really set in before this slow move was finally played.  I was fairly sure my game was better, but something more forcing would have been nice.  I saw that my pawn was being attacked and didn't see a clear way to continue.  Possible was 14. Nf5 But then I just lose my pawn and have nothing to show for it.  I was sure I had missed some tactic instead.",
        "14... Qc6": "?  This is certainly the wrong defense, but the alternatives are not particularly impressive.  A counterattack with 14...Rg8 meets 15. Nf5.  14...Nc6 makes his pieces look ridiculous, all cramped there around his king, but may have been the best try.  The text looks strong, threatening my bishop and getting his queen some scope, but I was looking at the unprotected e7 bishop and the h3-c8 diaganol.",
        "15. Nd5": "!  I find a way to keep my bishop where it is.  The tactic I played in the game may seem very odd to some, as it is axiomatic that one should not trade when down material or attacking.  In some way, I am both, but I saw my attack just picks up steam if I can get rid of the only active pieces in his game.",
        "15... Nxd5": "This forces some pieces off.  Black must feel as though white's attack is failing.",
        "16. exd5": "The pawn is well placed and, though it didn't, it could have played a big role in my attack.",
        "16... Qxb6 17. Rxe7": "Black's pieces are disorganized and cramped.  Notice especially the effect my d5 pawn has on his bishop.  ",
        "17... Nd7": "I was expecting to force this move after 18.Qg4, but he forced me to switch the order up.",
        "18. Qg4": "That knight is just being hammered.",
        "18... Qd8": "Qc7 would have met the same reply, where the King's one flight square off the 8th rank is occupied.",
        "19. Rae1": "!  Obvious, but still excellent.  Point being: black will lose his queen unless he moves it or he gives up his knight (and then my attack will be completely unstoppable, of course).  ",
        "19... Kc7": "My opponent made this move and I looked at 20. Nf5 for a long time before I saw the obvious.  I consider this move to be a resignation, as both the knight and the 8th rank couldn't be held anyway.  ",
        "20. Ne6+": "And Black resigned.  I appreciate any and all comments, especially ones with recommendations for white.  I've working on tactics lately and welcome any feedback on the (certainly unsound) tactics in this game.  Thanks!"
    },
    "url": "https://gameknot.com/annotation.pl/over-the-board?gm=25263",
    "gameName": "Over The Board",
    "players": "Mike (???) vs. Bobdole (1650ish)",
    "opening": "Sicilian (B90), Najdorf, Lipnitzky attack"
}