{
    "moves": {
        "1. f4": "Hi everyone!\n\nI had another game with a long-standing nemisis known as The Dentist.  Do not be fooled by his current rating.  He reached an optimum of over 1400 and I still maintain he is capable of getting to 1500 were it not for the fact that he regularly visits Vietnam which may not have a good internet connection and therefore he has suffered a lot of timeouts.  Make no mistake, at the top of his game he is a serious threat and I have had one loss, a few low draws and several near misses against him - that is why I play against him unrated.  Just have a look at my annotations, \"In the Dentist's Chair and The Dentist has his Day to see why.  Thankfully since the loss I had against him, I have hardly allowed him to breathe and I just hope I can continue to crush him like I did in this game.  Here is how it happened: http://gameknot.com/analyze-board.pl?bd=17550343&rnd=0.45702334734048733.  I decided to deviate from my normal e4 and play something else.  This is f4 known as The Bird's Opening.",
        "1... g6 2. e4 d5 3. e5": "3. e5 - pawn cramp - already takes away the black knight's best square, f6.",
        "3... e6 4. d4 Bb4+": "4. ...... Bb4+ - this check is a waste because that bishop can be driven back immediately with c3.",
        "5. c3 Ba5 6. Nf3 h6 7. Bd3 a6 8. Be3": "8. Be3 - over the last few moves I have concentrated fully on development.",
        "8... b5 9. O-O Qe7 10. Nbd2": "10. Nbd2 - and I continue to clear the decks.",
        "10... Nd7 11. Qc2 Bb7": "11. ...... Bb7 - black is playing well here.  I do not have a plan but I do have the seed of a plan here.  I am thinking about Concordborn's Sicilian MT in which I used a4 as a pawn break to beat Concordborn (Matthew).  I eventually got a decisive passed pawn on the a column and eventually went on to win the exchange.  Maybe I could utilise that plan in this game to good effect.",
        "12. b4 Bb6 13. a4": "13. a4 - here it is!",
        "13... f6": "13.  ....... f6?! - not sure about this move, maybe black had been better served by playing 0-0-0.  I now have the choice between BxP+ and axb5.  I decided on the latter - at least this leaves the former threat open.",
        "14. axb5 Nb8 15. bxa6 Bxa6 16. Bxa6 Nxa6": "16. ..... Nxa6 - this plethora of exchanges leaves a knight in a pin which can be exploited by ......",
        "17. b5": "17. b5!",
        "17... fxe5 18. Nxe5": "18. Nxe5 - I leave the knight on the board as it still cannot escape without the rook on a8 being taken for starters.  This move now threatens Nxg6.  I have threats on both sides of the board.  My opponent times out but gameknot analysis shows that I am winning hands down.  Freddy, if you had the black pieces here, how would you continue this game?  Can you turn the tables on me - this is your challenge.  Anyhow I hope you have all had a good read.  Kind regards - Joanne"
    },
    "url": "https://gameknot.com/annotation.pl/overpowering-the-dentist?gm=45161",
    "gameName": "Overpowering The Dentist",
    "players": "jstevens1 (1883) vs. The Dentist (1234)",
    "opening": "Bird's opening (A02)"
}