{
    "moves": {
        "1. e4": "It being Monday, I assumed it was a home game, so turned up at Didcot and set about putting out tables and chairs etc.  Come 7:30pm, match time, no one else had turned up, so I checked my diary and saw the dreaded word \"Away\".  With quick apology to the landlady of our host club, I hastened to my car and up the A34 to Oxford.  I had 25 minutes to beat the time-out and made it with 4 minutes to spare.  My opponent had also arrived late, so I was only about 7 minutes behind on the clock...",
        "1... c5 2. c3": "Oh no! the dreaded c3 Sicilian.  A few years ago I got so fed up with facing this boring riposte to my favourite opening that I bought Murray Chandler's book on it.  I wish I'd studied it more effectively and done my revision more recently!  In our post-match analysis, Matt admitted that he'd taken up this opening  because \"if you can't beat them, join them\".  He too had used the Chandler book to learn it.",
        "2... d5": "The most vigorous response but it can lead to positions not at all typical of other Sicilian lines, so I soon become uncomfortable.",
        "3. exd5 Qxd5 4. d4 cxd4 5. cxd4 Nc6 6. Nf3 a6": "A mistake according to Matt: White doesn't intend to put his WB on b5 anyway, so no need to discourage him.  Given my problems with my WB later in the game, his advice to play 6....Bg4 makes a lot of sense: much more active.   As an inveterate Najdorf player, I'm over-fond of ...a6.",
        "7. Nc3 Qd8": "and there's no need to retreat all the way to d8: d6 would have been OK.  If I'd compared my position more closely with a Scandinavian, I might have considered this option as well as ... Qa5 and ... Qd8.",
        "8. Bc4 e6 9. O-O Nf6 10. Re1": "After the game, Matt thought that he started to drift around here but this looks good to me.  From here on, I'm concerned about potential sacs on e6.  More direct was 10. Bg5.",
        "10... Be7 11. a3": "Confirming Matt's diffidence around here.  I assumed it was a waiting move and he confirmed this, though it does have the purpose of preventing 13... Nb4 in response to 13. Qd3.  After the game we thought that an immediate 11. Bg5 was more direct and to the purpose.",
        "11... O-O 12. Bg5": "But, funnily enough, Matt reiterated that when he had played this he felt that he was drifting into a bad position at this point.  I was already concerned about how I would complete my development.  Putting my B on d7 would cut my Q off from d4 and d5 and, potentially, if the Q went to c7, as it often does, it would cut it off from the defence of e7.  Moving the b pawn to allow the B to b7 leaves the Nc6 undefended.  If I don't get the B off the back rank soon, I'm going to have trouble connecting my rooks.  This becomes thematic in the denouement.",
        "12... Re8": "Nimzowitschean!  Over-defending the B and the e6 pawn prophylactically.  I resisted the temptation just to automatically push the B back, creating  weaknesses on h6 and g6.",
        "13. Qd3": "Now I become concerned about the threat of Bc4-Bb3-Bc2 followed by Bxf6 and Qxh7 with probable mate to follow.  After-game analysis indicates that this was a chimera: after Bxf6, my e7 square is free for my K; and White's Q, if it ventures to h8, will have to retreat ignominiously under threat from the Re8.  Consequently, Matt had dismissed this possibility while I was worrying desperately about it!",
        "13... h6": "but now I felt I had to force White's black squared B to make a decision.  I couldn't just wait for W to develop his attack.",
        "14. Bh4 b5": "played to help my WB develop while gaining a tempo on White's B, though, as I'd rightly predicted, W wanted to move the B back to c2 anyway, so I'm just helping him here.",
        "15. Bb3 b4": "and this was played to distract W from that plan.  If 16. axb4 Nxb4 prevents Bc2.  In my previously mentioned delusion about the attack on h7, I thought W could ignore the attack on the N  and play 16. Bc2 anyway but later analysis suggested that he was right to respond with 16. Ne4.",
        "16. Ne4 Bb7": "Matt thought 16... Nxe4 more accurate.",
        "17. Bxf6": "Forced, according to Matt's reckoning.",
        "17... Bxf6 18. Nc5": "I'd feared this.  Now I fantasised about N or B x d4 and failed to find a satisfactory conclusion.  Subsequent analysis suggested that this would have been successful: 18.... Bxd4 19. Nxd4 Qxd4 (I'd only considered Nxd4 at the time) 20. Qxd4 Nxd4 21. Nxb7 Nxb3 looks OK.  Other lines also seem OK for Black.  I failed to see far enough and blundered.",
        "18... Bc8": "Yuck - disconnecting my rooks and allowing the pin on the N which looks fatal",
        "19. Ba4 Bd7 20. Nxd7 Qxd7 21. Rac1 Rec8 22. Qe4": "The N falls with no compensation.  I trust my opponent to be able to beat me from here, so I resign"
    },
    "url": "https://gameknot.com/annotation.pl/oxford-city-1-v-didcot-1-bd-4?gm=19623",
    "gameName": "Oxford City 1 v Didcot 1 Bd 4",
    "players": "Matt Brown (1848) vs. Bob Jacobs (1592)",
    "opening": "Sicilian (B22), Alapin's variation (2.c3)"
}