{
    "moves": {
        "1. e4": "Here's a lucky escape against a young schoolboy who outplayed me for most of the game.  It does show the importance of hanging on in there!",
        "1... e6 2. d4 d5 3. Nc3 Bb4": "The Winawer variation of the French Defence, which I've usually met with an early Qg4, leading to a wildly loose and complex game, and mixed results ...",
        "4. e5 c5 5. a3 Bxc3+ 6. bxc3": "All standard moves so far ...",
        "6... Qb6": "! This caught me by surprise and provoked a poor response.  Normal moves at this stage include 6...Qc7, 6...Ne7, 6...Qa5, to which I usually respond 7. Qg4.",
        "7. Be3": "I still wanted to play Qg4 but felt that it would be safer if d4 was secured first.  While 6. Qg4 would have maintained defence of d4, it would only have done so if I didn't want to take g7.  Other means of over-defending d4, with Nf3 of Ne2 would, of course, have prevented Qg4. In retrospect, I think I should have played 6. Qg4 regardless. ",
        "7... Nd7": "Black defends c5 with a developing move, though it does block in the Bc8.",
        "8. f4": "? A move borrowed from the Advance Variation that is inappropriate here, with the Queenside already so seriously compromised.  The White King will have nowhere safe to go.  I was losing faith in the planned Qg4 by now, and thinking more about bolstering the centre, with 9. Nf3 to follow.",
        "8... Nh6": "! Black spots the opportunity to occupy f5 and attack the misplaced, and now undefended, Be3.  He may also have hoped to provoke g4, which I baulked at as being one pawn advance too far.  I think it would have been preferable to the mess that followed, though.",
        "9. Nf3 Nf5": "! This increases pressure on d4 and attacks the undefended B.  I didn't want to defend the B with my Q because that would have left the Ra1 undefended ...",
        "10. Bf2": "This retreat enables the B to cover all the squares attacked by the N and maintains defence of d4 but has a serious negative consequence ...",
        "10... Qb2": "!  This premature-looking foray exposes the dire weakness of White's Queenside.  The Q can't defend c3 because the Ra1 would be left undefended.  The Bf2 can no longer come to the rescue and a K move would give up hope of castling.  A rook move would not prevent the loss of c3 and would also leave a3 undefended.",
        "11. dxc5": "?! I felt that this was my best hope of attaining some sort of equality, as at least the pawn wouldn't be a further worry after the fall of the c3 pawn.  In fact, it just invited the other N to the party.  Given the lack of attractive alternatives, I can't quite dismiss this as a total blunder, though.  Perhaps 11. Bd3 would have been best, preparing castling, but, after 11...Qxc3+ Nd2 12. Ne3 would have been embarrassing.",
        "11... Qxc3+ 12. Nd2 Ne3": "! Black really makes me squirm!",
        "13. Bxe3 Qxe3+ 14. Be2": "Now I'm in a complete mess: loose pawns all over the place, pieces huddled in front of my king, rooks isolated and no prospect of safe castling.  The only good news is that Black is under-developed.",
        "14... Nxc5 15. Rf1": "I was determined to get some counter-play somehow.  With castling out of the question, I had to activate my rooks and defend my pawns if possible.",
        "15... Na4": "!  Black doesn't worry about his development yet as he can still exploit White's cramped position with the threat of ...Nc3, forking Q and B and thereby probably winning the B and mating.",
        "16. Rf3": "Fortunately, I can chase Black's Q away in the nick of time.",
        "16... Qg1+": "I had not overlooked this move but had decided it was preferable to the aforementioned scenario.  Now I had to decide which pawn to defend and how best to free up my cramped position.",
        "17. Nf1": "Now, if ...Qxg2, I can counter-attack with Qd4, having lured Black's Q off the black squares.",
        "17... Qc5": "Sensibly, Black retreats to a commanding square and renews the threat of ...Nc3.",
        "18. Qd2": "My longer range pieces are now acquiring greater scope for activity, though not enough to reach equality yet.",
        "18... O-O": "A pause for conventional development ...",
        "19. Rb1": "and another White piece expands its horizons.",
        "19... a6": "Black prevents White's threatened attack on the Q.",
        "20. Rbb3": "This connects the rooks on the 3rd rank but also allows the N to come forward without giving up the a-pawn or interfering with the KR's ambition of a full frontal assault on the newly castled king.",
        "20... d4": "Perhaps a premature advance of the pawn but it does prevent Ne3 and establish a further claim to c3.",
        "21. Bd3": "Blocking the pawn and eyeing up h7.",
        "21... b5": "Providing a good square for his B, on the long diagonal where my R is exposed.",
        "22. Be4": "Again improving the position of one of my pieces while attacking Black's R and preventing the B from immediately occupying the long diagonal.  My rooks are also reconnected.",
        "22... Rb8 23. Rfh3": "My first threat against Black's K!  Easily batted away, however.",
        "23... h6 24. Rbg3": "! Threatening to win the newly advanced h-pawn.  For the first time, my young opponent displayed some uncertainty.",
        "24... f5": "Black counter-attacks.  If White captures en passant, it looks like Black opens more lines towards White's K and Black can defend the h-pawn by recapturing on f6.",
        "25. exf6 e.p.": "I didn't want to give up my B's central postion and felt that the open lines could also benefit me.",
        "25... Rxf6 26. Rg6": "Now I want to eliminate the key defender while the other R is blocked off.",
        "26... Rxg6 27. Bxg6": "Still only one pawn down and with the semblance of an attack, I felt like I was now in with a chance of salvaging a draw.",
        "27... e5": "! but this dampened my optimism.  I can't take the pawn as my rook is attacked and now Black has powerful connected central pawns and can develop his B to any number of good squares.",
        "28. Rg3 Qe7": "! Threat exf4+! winning the R and the game.",
        "29. Kf2": "avoiding the check.",
        "29... Qf6": "increasing the pressure again.",
        "30. f5": "The pawn couldn't be defended effectively, with the B on g6 also attacked by the Q, and I felt that the capture on f5 was less dangerous than on f4.",
        "30... Bxf5 31. Bxf5 Qxf5+ 32. Kg1": "Safe at last?",
        "32... Nc3": "! Black centralises his N and forces White to deal with the fork threat from e4, while also protecting e2.",
        "33. Rf3": "Counter-attacking.",
        "33... Qe4": "Ditto!",
        "34. Ng3": "Again, counter-attacking but also improving the defence of e2 and offering the N the chance of more than a mere passive role.",
        "34... Qg6": "Now the main threat appears to be e4 followed by e3 once Black gets his R behind d4.",
        "35. Qf2": "Trying to set up a counter-attack down the f-file.",
        "35... Nd1": "Black continues to harrass White's Q and interfere with his plans.",
        "36. Qe2 Ne3": "and now the N has a lovely outpost close to White's K, tying White to the defence of g2.",
        "37. Rf2": "defending c2",
        "37... Rc8": "Now the c pawn can't be defended directly, so a counter-threat is required.",
        "38. Qf3": "The threat of a back-row check ties Black's R to the back row for now.",
        "38... Qd6": "?! Having shown some signs of uncertainty over his last few moves, Black picked up his Q to move it here, then returned it to g6 and let go again.  Soon after, he moved it here anyway.",
        "39. Qf7+": "My first check of the game but can I make it count?",
        "39... Kh7": "? Wrong square, as now K and undefended R are both on White squares.  I can threaten mate with a N move but that threat is easily warded off.  What else can I manufacture from the threat?",
        "40. Nf5": "! Threatening mate and the Q.",
        "40... Nxf5": "? overlooking the ensuing fork.  Would 40....Qg6 41. Qxg6+ Kxg6 42. Ne7+ have been any better?  I think 40 ...Qf8 may be the critical move.",
        "41. Qxf5+ g6 42. Qxc8": "At last I'm ahead on material with mate in one threatened.  All I have to do is round up Black's central pawns and the win should be easy.",
        "42... Qe7 43. Qf8 Qxf8 44. Rxf8 Kg7 45. Re8 Kf6 46. Kf2 Kf5 47. Kf3 g5 48. g4+ Kf6 49. Ke4 a5 50. Rxe5 b4 51. Rxa5": "and Black resigned.  I had 21 minutes left on my clock; he had 34, reflecting the fact that I'd been under the cosh for most of the game."
    },
    "url": "https://gameknot.com/annotation.pl/oxford-city-4-abingdon-school-v-didcot-2?gm=60563",
    "gameName": "Oxford City 4 (Abingdon School) v Didcot 2",
    "players": "Bob Jacobs (129) vs. James Beckinsale (120)",
    "opening": "French (C18), Winawer, advance variation"
}