{
    "moves": {
        "1. e4 c5 2. Nf3 d6 3. d4 cxd4 4. Nxd4 Nf6 5. Nc3 a6 6. Bg5": "As I've noted before, I've taken a shine again to this all out assault on the Najdorf, however well-trodden it is.",
        "6... e6 7. f4 Be7 8. Qf3 Qc7 9. Bd3": "All standard moves so far.  I suspected this one was slightly old-fashioned as it's not strictly necessary yet, given that White plans castling Queenside, but White needs to protect c2 and e4 against potential attacks in the myriad variations possible from this sort of position.  Looking it up in John Nunn's 1996 book \"The Complete Najdorf: 6. Bg5\", I find that it's not even in his book, so it's either so bad it's not worth a mention or hadn't yet been invented yet.  According to Nunn, 9. 0-0-0 Nbd7 10. Bd3 used to be the main line before 10. g4 took over, so we may just be messing with move order or we may go off on an unknown path...",
        "9... Nbd7 10. O-O-O": "duly transposed.",
        "10... b5 11. a3": "? According to Nunn: 11. Rhe1, 11. g4 and 11. Bxf6 are the only moves worth considering here.  White doesn't have time for 11. a3 (though it's often played).  \"This is a position in which only rapid development can offset Black's queenside initiative based on ...Bb7 and ...b4.  Once White starts to go backwards he will find himself hamstrung by the pressure on e4 and unable to take any aggressive action himself.\"",
        "11... Bb7 12. Rhe1 O-O": "I was expecting 12. 0-0-0 but Black wanted to set up an immediate battery on the c-file.",
        "13. g4": "I don't recollect ever getting into this exact position before but the sort of moves that work in such positions are familiar enough. White launches his attack before Black can launch his.  It's a classic castled-on-opposite-sides-of-the-board race.  Strategically, this suits both players in the Najdorf: Black hopes to withstand White's attack, which will probably waste pieces and pawns in unsuccessful sacrifices, and then finish White off with a surgical strike at his King.  White hopes to win his Kingside attack, never allowing Black to strike.",
        "13... Rfc8": "Black puts his money where his mouth is!  Both rooks are attacking.",
        "14. Rd2": "Another prophylactic move.  White is planning to sac the lsb at h7 or swap it on e4 or c4 as necessary.  White also wants to use the Nc3 in attack.  So White needs to defend c2 with something else that doesn't need to go anywhere fast.  There are also doubling possibilities on either d or e-file.",
        "14... Nb6": "I'd been expecting ..Nc5 but this more patient move threatens to occupy c4, attacking that defensive rook and the pawn on a3 (if White recaptures on a3, the Nc3 is left hanging).",
        "15. Qh3": "Sets up an attack on h7 and unpins e4, thus allowing e4-e5, which would attack the Nf6 and threaten check on h7.",
        "15... Nc4 16. Bxc4": "Played reluctantly but, I felt, necessarily. This gives up the plan mentioned last move but deals with the threats mentioned in relation to 14... Nb6.",
        "16... Qxc4": "This Queen is an imposing presence that ties White's pieces to the defence of his King but as long as they stick to their tasks it doesnt threaten anything new... yet.",
        "17. f5": "With the lsb gone, e4-e5 had lost its attraction. This move was designed to make Black think and provoke 17...e5.  It succeeded.  Hereafter, I was about half an hour ahead on the clock.",
        "17... e5 18. Bxf6": "Hoping either for 18...exd4 19. Bxd4 or 19. Rxd4 (I hadn't yet made up my mind whether I could risk this).  Originally, I'd analysed 18. Bxf6 exd4 19. Bxe7 dxc3 but that didn't look nice for White.  Capturing on d6 with either B or R wouldn't help (mate in 1 if the R took!; cxd2 if the B took)",
        "18... Bxf6 19. Nf3": "Now the N supports the planned attack on the g-file and Black's B is prevented from supporting Black's attack on c3 by his own pawn on e5.",
        "19... Be7": "The early retreat with the B increases Black's choice when White next advances a pawn.",
        "20. g5 Bf8": "I thought this was a good move but after the game my opponent suggested it was a poor one.",
        "21. g6": "Fully expecting Black to prevent mate with ...h6 but then planning to play gxf7+ followed by Rg1, when there would be some obvious avenues of attack.",
        "21... h6 22. Ng5": "?! But then I saw this opportunity to get the N deep into enemy territory.  Unfortunately, it allowed Black to close the kingside, so I think it was an error.",
        "22... f6": "Now the kingside is locked tight unless White can find a suitable sacrifice.",
        "23. Ne6": "!? I wanted to swap the N for Black's B because I was worried about ...d5 followed by Bxa3 but my opponent suggested 23. Nf7 was better (without expanding on it).  I guess the threat would have been Nxh6 followed by Rxd6 but I was already thinking in terms of abandoning the all-out assault on Black's king in favour of defence and heading for an endgame with at least even resources.",
        "23... a5": "!? This threatens to crack White right open but also allows White to swap on f8.",
        "24. Nxf8 Kxf8": "Played very quickly, as indeed were most of Black's remaining moves.",
        "25. Qd3": "Edit: Just re-reading my analysis and the comment here was nonsense, so I've withdrawn it.  I'd seen a threat by Black that was impossible.  This is what happens in a tense situation!",
        "25... Qxd3 26. Rxd3 b4 27. Nb5": "With the Queens gone, the N can move with a free conscience and furthermore defends a3.  ",
        "27... bxa3 28. Nxa3": "White has dealt with the threat of Black's pawns breaking up his defences and opening up the a-file for now.",
        "28... Ke7": "! Of course.  Black centralises his K and defends the backward d6 pawn.",
        "29. Nb5": "?! This seems a natural response, renewing the attack on d6, but it gets White in trouble.",
        "29... Ba6": "! Skewering N and R.",
        "30. Rb3 Rab8": "Now the N is pinned by a rook.  With the c2 pawn pinned as well, things suddenly looked drastic.  For a while, I thought I'd blown it and even considered resignation.  Fortunately, I used some of my extra time to think and coolly retreat the N.",
        "31. Nc3 Rxb3": "and got saddled with doubled pawns",
        "32. cxb3 Bb7": "= With about 10 minutes left to my 40, Black offered a draw.  I felt that this was indeed my most likely result with normal play but also felt that I ought to be able to exploit my time advantage, so I played on.",
        "33. Kd2 Bc6 34. Ra1 Ra8 35. Kd3 Kd7 36. Na4": "Threatening the fork on b6 and also inviting Black to sort my pawns out for me",
        "36... Bb5+": "Black refuses that invitation for now, seeing the opportunity to activate his rook.",
        "37. Kc3 Rc8+ 38. Kd2": "The King has to retreat and now I felt that Black stood better.",
        "38... Bxa4": "!? Surprising but I think it helps White as much as Black.",
        "39. Rxa4": "Taking with the pawn would have allowed 39...Rc4.  I didn't want that and wanted to attack the a-pawn.",
        "39... Rc5 40. b4": "White still undoubles his pawns.",
        "40... axb4 41. Rxb4 Kc6": "Now I have to decide whether to go after Black's kingside pawns, allowing Black to sweep up my second rank pawns, or play a tighter game.",
        "42. Rb8": "I start to eye the g7 pawn...",
        "42... Rb5": "Now I had to put my money where my mouth was... I thought 10 minutes... and opted for the quieter option, hoping that I could do something with my passed b-pawn",
        "43. Rxb5 Kxb5 44. Kc3 d5": "! I hadn't seen this.  It creates a dangerous protected passed pawn, whatever White does.  It looks like a sacrifice but isn't.",
        "45. exd5 Kc5": "White can't defend the d-pawn and, hereafter, he is torn between trying to promote his b-pawn and preventing Black's e-pawn from promoting.",
        "46. d6": "To force Black's King back.",
        "46... Kxd6 47. Kc4 Kc6": "With 7 minutes left, Black offered a draw again.  With nearly 35, I felt duty bound to try a little longer by seeking to impose zugzwang.",
        "48. h4 Kb6 49. h5 Kc6 50. b3 Kb6": "and here I offered my hand to accept the draw.  Theoretically he could have made me move first as I'd refused his offers already, but he was happy to shake hands.  Could White have tried for a win?  Could Black?  I don't think White can win unless Black loses patience and moves his e-pawn too soon, losing it and then allowing White to go after the g7 pawn.  As long as Black shuffles between b6 and c6 or b5 (if White goes to d5 or backwards), he holds back White's b-pawn.  White's K can't abandon proximity to the e-pawn, else it queens."
    },
    "url": "https://gameknot.com/annotation.pl/oxford-uni-1-v-didcot-1-bd3?gm=27074",
    "gameName": "Oxford Uni 1 v Didcot 1 Bd3",
    "players": "Bob Jacobs (1776) vs. Yangshi Ya (1928)",
    "opening": "Sicilian (B98), Najdorf variation"
}