{
    "moves": {
        "1. e4": "Mon ouverture classique avec les blancs",
        "1... g6 2. d4": "Cela devrait me permettre de pousser un des pions sur la 5e ligne.  Je m'attend à voir Bg2 au prochain coup.  Pour ce genre d'ouverture, je pense que c'est mieux de sortir le fou du côté de la reine et non pas celui du côté du roi comme le font les noirs présentement.  Sortir le fou en B2 permet une attaque subtile sur le pion en G7 (côté du roque).\n",
        "2... Bg7 3. e5": "Je préfère avancer e5 pour limiter la sortie du fou et du cavalier.",
        "3... d5 4. Nf3": "J'apporte une protection supplémentaire aux 2 pions, tout en préparant le roque.",
        "4... h6": "Je ne m'attendais pas à ça.  Je croyais voir Bg3 ou Nc6.  J'imagine que le but était de prévenir Bg5.",
        "5. h3": "Puisque les noirs n'ont pas joué Bg4.  J'avance le pion pour l'empêcher.",
        "5... e6 6. Bd3": "Je me positionne pour le roque.",
        "6... Ne7": "J'ai hésité avant de jouer ce coup.  Initialement je voulais roquer, mais j'ai finalement opté pour le pion en c4.  Un échange de pion viendrait fragiliser la diagonale f7-d4 des noirs.",
        "7. c4 dxc4 8. Bxc4": "L'échange se fait comme prévu.",
        "8... c6": "Encore une fois, pas certain de comprendre ce coup.  Je crois que la sortie du cavalier aurait apporté un bon support.  L'avance de tous les pions semble menaçant, mais cette menace est souvent facilement contrôlable.",
        "9. Nc3": "Sortie du cavalier en c3 pour potentiellement couvrir e4 et f6.",
        "9... b5": "La poussé des pions se poursuit, mais je crois que toujours que la menace est seulement apparente.",
        "10. Bb3": "J'ai préféré rester sur cette diagonale pour faciliter la sortie de la reine.",
        "10... a5": "La poussé des pions se poursuit, mais s'affaiblie tranquillement.  Les grosses pièces sont toutes derrières.",
        "11. a4": "Ceci forcera un échange ou affaiblira la diagonale.  Je peux facilement déplacer le cavalier si les noirs avance en b4.",
        "11... b4": "L'échange n'a pas eu lieu. ",
        "12. Ne4": " Je déplace Ne4 qui sera un atout en attaque.",
        "12... O-O": "Le roque est moins bénéfique, la protection des pions étant plus faible.",
        "13. Bc2": "Bc2 sera un meilleur support à l'attaque.",
        "13... Nd7 14. b3": "Encore une fois j'aurais aimé roquer, mais j'ai décidé de stopper définitivement l'avance des pions de ce côté.  Ceci empêchera la venue possible du cavalier sur d7 en c4.",
        "14... Nd5": "Bon coup.  Ce cavalier est bien positionné et je l'avais oublié...",
        "15. Bd2": "Ceci est pour empêcher Nc3 et prévenir l'avancement du pion b4 en c5 suite à un échange potentiel de cavalier.",
        "15... Ba6": "Bon coup.  Je crois que mon roque est foutu.  J'ai manqué ma chance à quelques reprises.",
        "16. Qc1": "Le roque n'étant plus possible, je me concentre sur l'attaque.  Le positionnement des pions noirs me font envisager un sacrifice potentiel pour créer une ouverture.",
        "16... Kh7": "Les noirs ont probablement senti le sacrifice pour ouvrir.  Kh7 vient compliquer les choses.",
        "17. h4": "Le roque n'étant plus possible.  h4 me permet d'ouvrir la ligne pour sortir la tour.",
        "17... f5": "Je crois que les noirs tentent de repousser l'attaque.  ",
        "18. Ng3": "Je peux prendre le pion \"en passant\", mais f6 est bien protégé par 5 grosses pièces.  Je préfère donc me replier avec Ng3, car je trouve que Nd6 s'éloigne de l'attaque et risque d'être coincé là."
    },
    "url": "https://gameknot.com/annotation.pl/ptit-challenge?gm=67466",
    "gameName": "P'tit challenge",
    "players": "dragoneye (1669) vs. talbocop (1520)",
    "opening": "Robatsch (modern) defence (B06)"
}