{
    "moves": {
        "1. e4 e5 2. Nf3 Nc6 3. d4 exd4 4. Nxd4 Bc5 5. Be3 Qf6": "Una delle continuazioni più utilizzate della Partita scozzese: il Nero triplica l'attacco sul Cavallo Bianco, a scapito della velocità nello sviluppo dei suoi pezzi",
        "6. Nb5": "Generalmente la mossa più comunemente giocata in questo caso è 6. c3 che difende il Cavallo. La mossa 6. Cb5 è insidiosa perché attacca subito il punto indifeso c7 lasciando l'Alfiere in presa.",
        "6... Bxe3": "Quasi obbligata",
        "7. fxe3 Qh4+": "Questo scacco ha più che altro lo scopo di aprire i pedoni dell'Arrocco del Bianco, costringendolo ad arroccare sul lato di Donna. Ovviamente, non si può, in seguito, prendere il pedone in e4 per l'attacco del Cavallo in c7 con scacco e attacco alla Torre nera",
        "8. g3 Qd8": "La Donna deve tornare a casa per difendere il pedone",
        "9. Qg4 g5": "E' chiaro che Dg4 del Bianco attacca il Pg7: nel DataBase di GK si trovano, come continuazione per il Nero, sia g6 che Rf8, che g5. Ho scelto quest'ultima perché forniva la maggior percentuale di vittorie per il Nero",
        "10. Qe2 d6": "Continuo a seguire il DataBase, che a questo punto dà il 100% di vittorie al Nero ( ma sarà attendibile?? )",
        "11. Nb1c3": "Mossa di sviluppo del Cavallo Bianco ( anche questa nel DB )",
        "11... Nf6": "Qui potevo scegliere tra la più ortodossa a6 e Cf6: Con questa mossa ha proseguito la partita Marina Brunello contro Pepino Enrico. Mi sono detto: se l'ha giocata lei ... ",
        "12. Bg2": "Ecco l'imprevisto: a dire la veirtà, Marina Brunello NON ha arroccato, preferendo mantenere il Re centralmente, ma spostando i pezzi sul lato di Re per difenderlo. Io, invece, preoccupato dei possibili sviluppi della manovra del Bianco ho pensato bene (?) di arroccare, mettendo il mio Re in grossi guai. Era sicuramente preferibile tentare di arroccare sul lato di Donna, sviluppando subito l'Alfiere c8  ( magari in g4 ) e la Donna, per esempio in e7, naturalmente dopo aver scacciato il fastidioso Cavallo in b5",
        "12... O-O": "Comincia già a sentire un po' di freddo, il mio Re!",
        "13. h3 Ne5": "Un'ottima posizione per il Cavallo, avamposto per l'altro Cavallo in g4, appena possibile",
        "14. O-O-O": "Così si mette al sicuro il Re!",
        "14... Be6": "Avevo pensato a mettere il re nell'angolo e, magari, portare le Torri sulla colonna g, ma, pensando di poterlo fare più tardi,  non ne ho più avuto il tempo.",
        "15. Qf2": "Ora il Cavallo in f6 e sotto attacco e blocca la Donna nera per la sua difesa. Era indispensabile scacciare subito il Cavallo in b5 e sviluppare la Donna ...",
        "15... Nfd7": "... invece, ho giocato una mossa molto debole e passiva, togliendo anche un pezzo dalla zona di difesa del Re",
        "16. h4": "Il Bianco comincia a spingere i suoi Pedoni contro il Re avversario.",
        "16... Ng4": "Lasciando, però, un importante casa al Cavallo Nero che conquista spazio e attacca la Donna Bianca ",
        "17. Qe2 Nde5": "Ecco i due Cavalli Neri in posizione. A questo punto, pensavo di riuscire a difendere il Re e la mia posizione con h6 e presa di Donna sulla presa hxg5. Poi, spostato il Re in h8, avvicinare , addirittura, raddoppiare le Torri sulla colonna f e mi sembrava di stare bene. ",
        "18. Kb1 Bc4": "Invece, ecco una mossa inutile, con perdita di due tempi per due mosse consecutive di Alfiere, con il solo scopo di attaccare la Donna avversaria senza, peraltro, impensierirla minimamente. ",
        "19. Qe1 Be6": "Torna a casa, Lessie!",
        "20. Nd4": "Non faccio a tempo a spostare l'Alfiere che il Bianco me l'attacca. Anche qui ho scelto la soluzione strategicamente meno valida: con il cambio Cavallo per Alfiere, infatti, il Pf6 abbandona la zona delle operazioni della difesa e il re Nero è sempre più nudo. ",
        "20... a5": "Questo velleitario tentativo di creare un diversivo sull'ala di Donna è ridicolo: era molto meglio preoccuparsi della posizione esposta del Re",
        "21. Bh3": "Ora la posizione diventa veramente delicata: il Nero minaccia di sfondare con una serie di cambi di pezzi e pedoni e di aprirsi la strada davanti al Re Nero",
        "21... a4": "Questo è un segno della confusione mentale in cui mi trovavo ( e non c'entra il raffreddore! ); ritirare l'Alfiere in d7, spingere il Pf7 in f6, raddoppiare le Torri e portare la Donna in difes, per esempio in g7 sarebbe stata una scelta strategica logica.",
        "22. a3 h5": "Così si difende il Cavallo, è vero, ma il Re adesso non ha solo freddo ... sta congelando!! ",
        "23. Ncb5": "Torna la spada di Damocle sul pedone c7",
        "23... gxh4 24. Nxe6 fxe6": "Et voila! E adesso avanti con l'attacco al Re Nero",
        "25. Bxg4 Nxg4 26. Rxh4 Qf6": "Alla buon'ora: La Donna Nera si è degnata di portarsi in difesa del proprio Re",
        "27. Rxh5": "E la colonna h è aperta",
        "27... Nf2": "Qui, forse, si poteva approfittare della temporanea impossibilità di accedere alla casa h8 per alzare la Torre f8 e dare una via di fuga al Re",
        "28. Rh4": "Ovviamente, non è possibile catturare laTorre d1 con il Cavallo perché segue un attacco fortissimo con Torre e Donna a partire dallo scacco di Torre in g4 e a seguire l'entrata della Donna Bianca sulla colonna h",
        "28... Qe5": "Perché attaccare il Cavallo in b5 ( e svegliare i can .. pardon, il Cavallo che dorme? ) quando è ancora attiva l minaccia su c7 e, soprattutto è imminente un attacco in massa contro li Re? ",
        "29. Rd2": "Ancora si poteva tentare una fuga con il Re: Tf7, Rf8, Re7 e Taf8",
        "29... Nxe4": "Con questa mossa il Nero fa Harakiri: il raddoppio delle Torri Bianche sulla colonna h è devastante",
        "30. Rdh2 Nf6": "Evita almeno Tg4+, ma ormai è la fine. ",
        "31. Nd4 Kf7": "Il Re Nero Tenta la fuga!",
        "32. Rf4 Kg7": "Ah, no! Come non detto! Forse, però, col senno di poi, si poteva tentare di scappare in e7, anche se il seguito era comunque\ndifficile. ",
        "33. Rhh4 Rae8": "Anche questa è una mossa poco chiara: l'analisi del computer la definisce un errore, suggerendo:\n… Dd5 34. g4 Tae8 35. g5 Dxg5 36. Cf3 Dg6 37. Txa4 Te7 38. Dc3 e5 39. Cd2 ",
        "34. Nf3 Qc5 35. e4 b5": "Forse si poteva tentare e5 per bloccare l'avanzata del pedone \"e\" Nero; l'analisi del computer dà addirittura Rd8 come mossa migliore: … Ttd8 36. e5 dxe5 37. Cxe5 b5 38. Cd3 De7 39. Tf5 Td5 40. Txd5 Cxd5 41. De5+ Df6 42. Tg4+ Rh7 43. Dh5+ Dh6",
        "36. e5": "A vederla così sembra buona: in realtà l'analisi del computer la definisce un errore: secondo lui era meglio Dh1. In effetti il raddoppio sulla colonna h non porta niente di buono al Nero, anzi...",
        "36... dxe5 37. Nxe5 Red8 38. Qe2 Qg1+ 39. Rf1 Qxg3 40. Rhh1 Ne4 41. Rfg1": "E la frittata è fatta! Ora con Donna inchiodata sul Re non ci sono più speranze. ",
        "41... Rf1+": "Uno scacco dettato dalla disperazione: l'analisi del computer lo bolla come errore, suggerendo: Th8 42. Txg3+ Cxg3 43. Dg4+ Rf6 44. Te1 Thg8 45. Th4+ Rf5 46. Cf7 Td1+ 47. Txd1 Tg6 48. Ch6+ Txh6 49. Dxh6 e5 50. Df8+ Rg4 51. Dg7+ Rf4",
        "42. Rgxf1 Nd2+ 43. Ka2 Nxf1": "Qui mi sono detto: \"Vuoi veder che sono riuscito a raddrizzare un po' la situazione?\" Ma l'attacco di Donna e Torre che segue mi ha smentito clamorosamente. ",
        "44. Qh5 Kf6 45. Ng4+ Ke7 46. Qc5+ Kd7 47. Rh7+ Kc8 48. Qa7": "Non resta che abbandonare: il Nero non riesce a difendere contemporaneamente il Pc7 e ikl matto di Donna in a8. "
    },
    "url": "https://gameknot.com/annotation.pl/palio-delle-regioni-10-turno?gm=62179",
    "gameName": "Palio delle Regioni - 10. turno",
    "players": "skorpio47 (2451) vs. andreabax (2258)",
    "opening": "Scotch (C45), Blumenfeld attack"
}