{
    "moves": {
        "1. e4": "Few weeks back I was sharpening my 1. d4 play but in this game, I wanna play tactical attack. So 1. e4 is the best for what I wished. \n",
        "1... c6": "1. ... c6! Caro-Kahn! pet-line of former world champion Anatoly Karpov. Seldom seen on today chess play. Most variation rich with solid and close play. But todays theory on Caro-Kahn include the gambit variation is tactically drench your will power. I once play white in a tournament on this line, medium profile tournament in my country where my tp = 2050! something which I'm proud of. My opponent was a veteran (50-60  ). When he play this at that point in time, we have a solid caro-kahn advance with light bishops exchange on g6 (black h pawn on g6). Till then, I was out of knowledge to proceed the attack! End up I lose. From that on, I'm searching for best method to counter Caro-kahn. \n",
        "2. c4": "I found out that Panov-Botzinnik Attack is more suit my repertoire! But that doesn't mean I did not tap with today theory on gambit or advance open line. ;) I may play it sometimes soon. \n",
        "2... d5 3. cxd5 cxd5 4. exd5": "Exchange all the pawn. To excel in this variation, white need to have knowledge on Isolated Queen Pawn (IQP). My first knowledge on IQP was through queen pawns opening and my former coach teach me some tips on playing it. After years of searching on Caro-kahn reply, panov-botzinnik attack give this structure! great.\n",
        "4... Nf6": "4. ... Nf6!? Usual Qxd5 is too tempi late as queen will be chased around the board. Nf6 is an improvement in sense it develop piece and d5 pawn is nowhere to be save anyway. Kinda of Scandinavian gambit in Center-Counter. \n",
        "5. d4": "This line can also achived through 1. e4 d5 2. exd5 Nf6 3. c4 c6 4. d4 cxd5 5. cxd5 (Nxd5)\n",
        "5... Nxd5 6. Bc4": "Bishop over knight move ;) Here bishop can go to b5 (exchange), c4 (tactical), e2 (solid) or d3 (!?). c4 is the best for me as it virtually attacking   the weak point of f7. \n",
        "6... e6 7. Nf3 Nd7 8. O-O Be7 9. Ne5": "9. Ne5!? this provoke for exchange move. After exchange white need longer to worry isolated d4 pawn.  vely this move also clear path for Qg4 and important attacking move. \n",
        "9... O-O 10. Qg4": ":)\n",
        "10... Nd7f6 11. Qg3 Kh8": "11. Kh8.  saw Bh6! \n",
        "12. Bd3": "another attacking move. \n",
        "12... Qe8": "Black feel inferior here. all his castle pawn is being attacked. Can it last? \n",
        "13. Nd2": "Development move. Considering Nc3 but after NxNc3 bxc3 white have bad pawn structure with 3 island to protect. \n",
        "13... Bd7 14. Ndc4": "Waiting   development move. Found NxBd7 is not satisfying. \n",
        "14... Bb5 15. b3 Rc8 16. Bd2 Nb4": "here considering Bb1!? but after deep calculation found BxNb4 (exchange) is the best reply. \n",
        "17. Bxb4 Bxb4 18. a3 Be7 19. a4 Bxc4 20. bxc4": "still solid. the only white weak point is d4. \n",
        "20... a6 21. Rab1 Rb8": "Rb8?! better was Rc7 (solid) or Qxa4 (Counter attack!?)\n",
        "22. Rb6": "Rb6!\n",
        "22... Nd7 23. Qh3": "Qh3!\n",
        "23... g6": "g6? ;)\n",
        "24. Rxe6": "Rxe6!! Now if 24. ... fxe6 25. Bxg6!!\n",
        "24... Nxe5": "Correct move.\n",
        "25. Rxe5 Qd8": "Trying to provoke d4 pawn. \n",
        "26. Rh5": "Another !? move. But not good enough. See if 26. ... gxh5 27. Qxh5 f5! 28. Bxf5 Rf7! safe for black. Gambit move as it is, it sure gives some fear to my opponent. Psychologically effect!\n[Improve comment] -  26. ... gxh5 27. Qf5! Kg7 1/2-1/2\nThis is the reason for playing Rh5!? 100% sure not losing here!.",
        "26... Qxd4 27. Rxh7+ Kg8 28. Bxg6": "! \n",
        "28... Bf6 29. Bc2": "I miss the mate twice here! although in the end I found out Rh8 lead to mate! 1-0\n",
        "29... Qe5 30. Rh5 Qf4 31. Rh8+": "Thank you."
    },
    "url": "https://gameknot.com/annotation.pl/panov-botzinnik-attack-attack-on-castled-king?gm=20908",
    "gameName": "Panov Botzinnik Attack - Attack on castled King",
    "players": "knazmi (1634) vs. borde (1810)",
    "opening": "Caro-Kann (B10), anti-anti-Caro-Kann defence"
}