{
    "moves": {
        "1. c4": "I never face the English, so I had to go out from my beloved Scandinavian. Actually, 1. d5 can be played, but I didn't know the theory behind it, so I went for the \"conventional\"...",
        "1... e5 2. Nc3 Nf6 3. a3": "Showing intentions, but effectively depriving my dsb from outer action. ",
        "3... c6": "!? I don't even know if this line exists. The idea is to avoid any N jump to the 5th rank, and to challenge the cental squares asap.",
        "4. e3": "Preparing d4, but I already \"have\"...",
        "4... d5 5. cxd5 Nxd5 6. Ne4": "f5 is tempting, but I \"smell\" some danger associated with the WQ's coming in, so better to be conservative...",
        "6... Bf5": "Thinking in Ng3, Bg6. But White had other plans in mind....",
        "7. Qc2": "The N is checking, so my B is hanging. If I defend the B (say g6), after Nd6+ QxN comes e4, forking my minor pieces... very nice! So...",
        "7... Bc5": "!? This allows him to exchange pieces and to deprive me of my bishop pair. I swore I could handle the outcoming position and get equality. Can you tell from now the outcome?",
        "8. Nd6+": "I have to take it...",
        "8... Qxd6 9. Qxf5 Nd7": "I am higly developed, and even if suboptimal, my position seems to hold... with some care in further developement. ",
        "10. b4": "Ok, in order to prevent that I would have lost a dev move (say a5), opening a confrontation field wiht so many problems to solve... no, I better stand this.",
        "10... Bb6 11. Bb2 Ne7": "Relocating my Ns while playing with his Q. But I play with fire...",
        "12. Qg4": "Hmmm... this I should have prevented. I don't want to move my pawns and I dont' want to castle \"under opponent's fire\", but I have to defend...",
        "12... Ng6 13. h4 Nf6 14. Qc4 h5": "...blocking white's advance. Now e4 frees my pieces and any e4 try just opens white's K. On the other side, I don't have a real safe place to castle...",
        "15. Nf3 O-O": "...but I decided I had to. The advantages deriving from the open d and (potentially) e columns had to grabbed. ",
        "16. Ng5": "Ok, now, provided I don't leave f7 unguarded, nothing happens...",
        "16... Rad8": "I liked this move. Of course white can castle queenside, but that will leave his K exposed...",
        "17. O-O-O": "Ok, he did it. So now I have to provoke / restrict him. I'm still more developed!",
        "17... e4": "?Saccing a pawn for a more open game.. even unlocking Bb2xNf6's trheat... now parrished by my Q. After Nxe4, NxN, QxN, Rf-e8, black has such a central dominance that must compensate for the pawn. If BxNf6 first, QxB threats f2 (maybe Qa1+)",
        "18. f4": "? The good thing about a complex sac like this is the opponent wants to become creative, and in this case, this just helps me. I'l get rid of my sacced pawn for an exchange, when his R's are far from the f column for a couple of moves. What do you think, dear reader? :-)",
        "18... exf3 e.p. 19. gxf3": "Planning to play on the g column, but opening the way for my Q to g3. Should I take it? What do you think?",
        "19... Ne5": "I opted for this line instead. I see my N landing on d3+, BxN, QxB. ",
        "20. Bxe5": "\"threatening\" Bb2 is gone. Well done!",
        "20... Qxe5": "...and my Q is out from the d column, threatening Qa1+ (if WQ goes away).",
        "21. d4": "?? Much better was f4, winning a tempo from my Q, leaving it out from g3, etc. etc. This seals white's fate...",
        "21... Qxe3+ 22. Kb1": "I can take the pawn and balance the game. I can play Nh7, theatening Qxd3 once the N is gone... But I opted for another line of attack. ",
        "22... Nd5": "Threatening Nf3+. I have to grab the advantage derived from the W's dsb exchange. I thought this was the proper way to do it. I was wrong!!!",
        "23. Bd3": "! Of course! Now my N is only standing there. I can play Nf4, but white has Rh-e1 and I am going backwards. What should black play?",
        "23... Bxd4": "Supporting Nc3+ again. I just need a tempo to place my Q on the second rank, and mythreats will be terrible!",
        "24. Rhe1 Qf2": "...as said. Of course, this forces white to...",
        "25. Bh7+": "...ok, to throw a check in. I am in a very risky position. Can I hold? What do you think?",
        "25... Kh8 26. Re2": "This is a critical moment. Did I stepped into it by chance? Not at all. I had my \"parachute\" and an \"additional one\" read to save me from falling to the earth. Let's see if I was right or wrong. ",
        "26... Nc3+": "If white moves the K, loses the R for free. I can't see any tactic... can you?",
        "27. Qxc3 Bxc3 28. Rxf2 Rxd1+": "This is NOT a free R, as you will see, but to cash it in, white has to leave me a move to open my other parachute...",
        "29. Kc2": "I can save the R, but... would you do it? What for? To get complicated endgames? Not at all!\n",
        "29... Rd2+": "I'd say ! This forces the winning simplification...",
        "30. Rxd2 Bxd2 31. Kxd2 g6": "Now is very funny the way I have to try to cahs the WB for a pawn. I'll have to work a little. Will I get it at last? Can you say it from here? ",
        "32. a4": "No prob move. ",
        "32... Kg7": "I have to move f6 without danger. Another move is needed. ",
        "33. Kc3 Re8": "Covering e6. Now, apparently, f6 can be played, and the B won. Is it true? Can White save his B?",
        "34. Kd2 f6": "... and the answer is NO, but white has another trick in his sleeve by playing Ne4, since if KxB inmediately, Nxf6+, winning. Of course, black just had to waste two more moves, with Rh8, RxB. But it was white's last chance of countergame (N agains the black's a, b and c pawns). ",
        "35. Bxg6": "? I'd say. White should have tried more. ",
        "35... Kxg6 36. Ne4 Re7": "? Worried abot Nd6, and wanting to be very cautios. N's are very nasty against Rs...",
        "37. Kd3 f5": "? I think better was to try to penetrate with the K. What do you think?",
        "38. Nc5 Rf7": "Just waiting for a plan! I'm looking at b6 as my way to break white, but I wasn't sure, and just wandered. ",
        "39. Kd4 Kf6": "Say that the K is a better guardian of e5. My R can penetrate into g, and I just have to make sure to be quicked than him grabbing pawns. ",
        "40. f4 b6": "Where to go, dear reader?",
        "41. Nb3": "? The last mistake. From there, his N has no countergame. From e3, yes (Ne5). My opponent resigned here, sensibly.. a nice blitz higher rated op win. Thanks for reading. ",
        "41... Rg7": ""
    },
    "url": "https://gameknot.com/annotation.pl/parachutes-one-and-two?gm=61000",
    "gameName": "Parachutes one and two",
    "players": "Zatiochi-Miike (1431) vs. damafi (1365)",
    "opening": "English opening (A22)"
}