{
    "moves": {
        "1. e4": "The King's Pawn Opening.",
        "1... e5": "The King's Pawn Game.  If he had opened with the Sicilian Defense (had played 1...c5, instead), I would have continued with my second favorite opening (the Open Sicilian).  Instead, I am going to try for my favorite (the Ruy Lopez).  This attempt will work because this opening will transpose into the Ruy Lopez.  ",
        "2. Nf3 Nc6 3. Bb5 Nge7": "? I understand that he wanted to continue with the Ruy Lopez, but this move is not best.  Why?   He blocked his own Queen and DSB.  Afterall, it is not a good idea to block your own pieces.  Therefore, I will begin to get aggressive, sooner then planned.  When will I start?  As soon as I castle.  ",
        "4. O-O d6": "At this point, he is planning to pin my knight with 5...Bg4, but it does not matter.  If 5...Bg4?!, 6.Be2!, breaking the pin immediately.  As I had noted earlier, this is where I begin to get aggressive.  Therefore, I am going to attack his e5 pawn and force an exchange.  Why?  In one of my previous annotations, Expert inadowman noted that d4 is best, in this position.  I believe this is a different exchange variation.  If I am correct, an exchange variation has more transpositions then any other variations because an exchange variation=a position where multiple exchanges occur.",
        "5. d4 exd4 6. Nxd4 Bd7": "! He develops his LSB to break this pin.  At first, I understood this logic but did not view this move as best.  Instead, I thought 6...Nxd4! was best and the most well known played.  Then, 7.Qxd4 with another exchange variation.  However, 6...Nxd4 is illegal, due to the mean.  Afterall, this is direct pin because his knight is pinned to the king, so he is not allowed to move that knight, until he finds another to protect black's king, like his LSB.  Therefore, this move was best.  6...Qd7 also would have worked, but there is a long term disadvantage.  What is it?  His Queen could eventually become pinned or trapped.  That happened in one or two of my other games, when breaking a pin, with my Queen.",
        "7. Nc3": "! At this point, I decide to play a little more aggressively by developing my other piece.  Why?  If I had not played this 7...Nxd4!!.  Then, if 8.Qxd4, 8...Bxb5, so he still wins a free piece.  This move, however, takes away that feasibility.  Now, if 7...Nxd4, 8.Qxd4, Bxb5, 9.Nxb5, so he does not get the advantage.  That is only half of my aggression, but what is the other half?  That is coming up. ",
        "7... a6": "In this position, he is trying to exchange my LSB for his a6 pawn, but it also does not bother me.  Why?  I decide to be very aggressive, at this point, so I am going to force another exchange variation with 8.Nxc6.  That way, if 8...axb5??, 9.Qxd8, Rxd8, exchanging his Queen for my knight.  Therefore, he will not take with his pawn.  Instead he will capture my knight, and he can do this in 3 ways, 8...Nxc6, 8...bxc6, or 8...Bxc6.  Out of these three choices, he will take with his knight.  ",
        "8. Nxc6 Nxc6 9. Bc4": "Because he captured with his knight, my bishop is still in danger.  This is a passive move, but it is the, \"cornerstone\" of my most aggressive plan.  That is why I retreated here, instead of anywhere else.  The plan will come with a trick, so stay tuned.",
        "9... Be7": "Unless he wants to castle, I do not know why he played this, but it does not change my aggressive plan.",
        "10. Qf3": "As they say, \"THIS IS IT, THE MOMENT YOU'VE BEEN WAITING FOR!\"  This is my most aggressive plan, of the entire game and the trick that I have been planning since move 9, and that is why 9.Bc4 was played. This is the trick includes several aggressive moves for a few reasons.  First, I was thinking of the, \"Scholars Mate\", but in 10 moves, instead of 4.  That's right, if he is not careful, 11.Qxf7#, mating him in one.  Second, Where did I get this idea?  It came from damaestro's last annotation, as I had mentioned in the intro.   In that annotation, cedeburca said, \"I assume jkarp is going for the f7 square; hoping to put the queen on f3 and deliver mate.  It's disappointing to see him play it now.\"  However, this was the point.  Why?  There are more reasons why my trick invloves several aggressive moves.  That and the point of my last move will be explained shortly.\r\n ",
        "10... Ne5": "I knew that he was going to fork my Queen and LSB, with his Knight, instead of falling for my attempted mate in one, and that was the point of my last move.  Unlike my game against jstevens1, reversed psychology is directly involved, this time.  Therefore, I wanted him to think that he had the advantage with this move, but this was the exact trick.  In this position, I am not going to retreat my Queen, but I will be much more aggressive, instead.  What will happen?  I am going to attack his g7 pawn.  How can I do that, and what are my options?  11.Qg3 is the only way.  If, 11.Qg4??, he will take my Queen with his LSB or e5 knight.  Why do I decide to attack his g7 pawn.  The final reason why several aggressive moves were involved in this trick and my last move will be explained shortly.",
        "11. Qg3 Nxc4": "? I knew he was going to take my LSB, instead of protecting his g7.  This move looks good, but there is a draw back.  After 12.Qxg7!, his position becomes weak, and that is why I decide to give away a free piece.  It appears that I made a bad choice and went wrong, but this sac will become deflective, sooner or later.  After I take his pawn, his king is left in a vulnerable, and that is why my plan involved a trick with several aggressive moves.  Afterall, this was my long term plan, and I wanted to put him, in this type of position.  FYI, I wanted to put him in this type of situation because I know that he is a very strong player and was an Expert, at one point.  Therefore, I was not going to mess around with my plans.  In other words, I was going to exceute my plans in chronological order. ",
        "12. Qxg7 Bf6": "?! He responds by attacking my Queen, but I do not mind.  Afterall, I will simply get it out of of danger.  Note: Although my followed through on my plan, I am still going to play aggressively.  However, \"The worst is over\", as they say.  In other words, the most aggressive aspect was the long term plan, as I had mentioned earlier.",
        "13. Qh6 Bxc3": "After this move, I will respond by retaking.  Afterall, I am not going to give this knight away.  This, however, is standard (the most common response, with this move.)",
        "14. bxc3 Qe7": "? He knew that my e4 pawn was hanging, so this move is decided.  In other words, he plays this move to win my e4 pawn, but I have a short term aggressive plan to stop this.  Once again, this plan, however, is less aggressive then before, so what is the plan to protect my e4 pawn? ",
        "15. Qg7": "I decide to threaten.  Now, if 15...Qxe4??, 16.Qxh8# mating him in one.  Of course, he is not going to fall for that, there are several.  Therefore, he has three options.  What are they?  Mate can be prevented with 15...Rf8, 15...Qf8, or 15...0-0-0.  He is going to castle Queenside.  I think, however, that 15...Rf8!, is best, in this position but am not sure.  Either way, however, it is no longer feasible for him to castle Kingside, and that is why I gave up my bishop.  In fact, this is why 9.Bc4, and 10.Qf3 was my aggressive plan.  Having said, that 11...Nxc4? was a mistake for this reason.  In addition, this is also where my Sac becomes deflective.",
        "15... O-O-O 16. Bg5": "Now, I take advantage and attack his Queen, in an aggressive manner.  Note: I know where attacking pieces can become costly, so I decide to take.  In other words, if 16...Qxg5??, 17.Qxg5, so I know that he is not going to bother my LSB.  In addition, I also know that his Queen is pinned to the d8 rook.  Therefore, he must protect his Queen, so I am going to win his d8 rook, for my LSB.  ",
        "16... Qe6 17. Bxd8 Rxd8 18. Qxh7": "! However, I had no idea that his last move leaves his h8 pawn hanging.  Therefore, I decide to take advantage by grabbing it.",
        "18... Qf6": "At first, I did not know why he played this.  However, I just figured out that this move is his attempt to win my Queen.  Now, I have to be careful, or he will take it.",
        "19. Rfe1": "?? At this point, I am trying to protect my e4 pawn, but I forgot that it is no longer hanging.  However, this is also my loosing blunder.  Why?  ",
        "19... Rh8": "In this position, my Queen is now trapped.  Therefore, 19.Qh3! would have saved the game.  Then, if this had been played, 20.Qf3, and I still would have had a chance..   ",
        "20. e5": "? At this point, I am trying to force another exchange variation, with this move.  How?  21.exf6, Rxh7. However, that will not work, this time.  Instead, he is going to win my e5 pawn, and my Queen is still trapped.  ",
        "20... Nxe5 21. Qe4": "At this point, he might be trying to find a mating sequence with his Queen and e5 knight.  That is, if he is able to play ...Ng4, followed by ...Qf2+, mate will become inevitable, sooner or later.  Therefore, I decide to prevent an immediate mating threat.  However, the threat will still come back, and he is clearly winning, as I had mentioned earlier. ",
        "21... Bc6": "However, he takes advantage of the fact that my Queen is still trapped, so he decides to attack it with his LSB.  Of course, I have to protect the Queen, but I am not going to move my Queen away from the e-file. ",
        "22. Qe2 Qh4": "In this position, he is clearly trying to mate in two.  23...Qh2+, 24.Kf1 (forced), Qh1#.  Therefore, I have to prevent this threat.  Of course, 23...g3 is not going to help.  In fact, I analyzed the position and came to the conclusion that 23.h3 is my only option. ",
        "23. h3 Qg5": "Now, I have to be careful or he will mate in one.  What is the mating move?  That will be revealed shortly.",
        "24. c4": "?? At this point, my goal is to exchange his knight for my c pawn.  However, I missed the immediate mating threat. 24.g3, 24.g4, or 24.Qxe5?? were the only ways to prevent this threat.  Now, it is mate in one, after 24.Qxg2#.",
        "24... Qxg2#": "I think that you will play better, if you are aggressive because it gives you the chance to see through your opponents weakness, even if it means loosing. If you do not play aggressive, however, it is unlikely that you will play well, even if you win. That is because you can become lackadasical, and it might cause you to ignore the position. BTW, this another example of where psychology, thought process, and cognition all play a role, in my games. For example, I believe that playing aggressively helps you to control the center.  In my game against Master elyhim, he said that it often appears that I ignore the center. Why did he think that?  It is because I was too passive, (not the other way around).  Therefore, it almost appeared that the center did not even matter to, me.  When I act aggressive, however, I do everything I can to control the center, even if it means threatening mate or capturing the Queen. Then, I develop immediately, after the opponent spots the threat. That usually enables me to control the center.   "
    },
    "url": "https://gameknot.com/annotation.pl/passive-v-aggressive?gm=45985",
    "gameName": "Passive V. Aggressive",
    "players": "jkarp (1085) vs. blitzkov (1826)",
    "opening": "Ruy Lopez (C60), Cozio defence"
}