{
    "moves": {
        "1. e4": "Manfred12g and I are old chess rivals and GK friends I feel. If I am ever in Australia I plan on checking out his Farm full of wildlife down there. But our games can be tough and bloody. He has a very direct and in your face approach which can be daunting but over time I have begun to learn to roll with the punches and let the chips fall and then see what happens. I am not too aggressive in the early part of the game myself and tend to wait for my opponent to make some error in their haste, and that often happens at my level of play where we 1200 to 1500ish player have a few tricks up our sleeves but not enough to work the miracles we envision at the start. He starts with E4.",
        "1... c6": "I go for the Caro-Kann as from experience I know manfred's style favors me playing E5 and him coming in like a battering ram. This sort of throws off the game of players like that and I have played enough to not be lost by the odd looking boards about ten moves in. ",
        "2. a3": "I do not know what is up here. I would figure E5 or KnC3. I continue with the line as I know it.",
        "2... d5 3. e5": "The advance variation which used to frustrate me, but now can lead into a sort of French Defense set up with a little work. ",
        "3... Bf5": "This keeps the pawn from advancing more and, more importantly, frees up the LS bishop that can get trapped and rendered impotent later in the game. Typically there will be an exchange later and best not to try and resist it too much. ",
        "4. d4": "It winds up looking like a typical caro- kann only it is all one move behind because of his pawn to A3 mover earlier. ",
        "4... e6": "This just following the line as I learned it from videos and databases. ",
        "5. Nf3 c5": "Over time I find I favor this move. Now the game has transposed somewhat into a French Defense only with the\nLS bishop freed. I saw this on a video by Dereque Kelley on YouTube. It opened my eyes to how lines of play are inter- connected at times. I knew that in a way, but never saw it. Before. ",
        "6. Bb5+": "This is something one has to learn to live with when playing the FD. It is pesky really and the only way to avoid it is to move pawn to A6 earlier, but the book more or less says not to worry about it and let it play out.  I guess. In a real FD and not a CK mutation game one would trade off LS bishops here, and white has in a way helped black by getting rid of the bishop that would otherwise be trapped and prevent a Queenside castle if needed later.",
        "6... Nc6 7. O-O Nge7": "I think maybe taking the knight before castling would have been a little better for white. Gives me a little time to sort things out and prevent doubling up pawns maybe. ",
        "8. dxc5": "This actually works out better for me as I will avoid doubled pawns by taking with my B7 pawn after the piece exchange that I know is coming. 9 out of 10 people will take the exchange and one has to learn to accept it and see that is not necessarily a negative thing for black in this set up.  ",
        "8... a6 9. Bxc6+": "Here I think white retreating a bit and trading off bishops may have been better. But some players hate to retreat or be pushed back a square or forced into exchanging pieces and will resist with tenacity in having to do something they do not want to do, even when it is the better thing. But this is okay too I suppose though I would like to keep the knight there there is no real reason now, as the E5 pawn it is to pressure is no longer there. ",
        "9... bxc6 10. Bg5": "This is manfred's style really and over time I have adjusted to it. It does not fluctuate much game to game and of course there are many other players like this. I think the idea is to \"simplify\" the board by taking pieces off of it, but of course that does not simplify anything and can only make things more complicated in the end game for the slightly weaker player. ",
        "10... h6": "If I do not do this that bishop will roost there forever. So... ",
        "11. Bxe7": "Here white can retreat a bit with the knowledge he weakened black's castled position but many people do exactly this and by ten or so moves into the game have decided that a bishop pair in the end game is not something they need. I begin to think that there is an idea that some players want to kill off the other guy's knights for some reason, when a bishop pair at the end is considered the bigger threat. ",
        "11... Bxe7": "Again, the trade off helps me to castle sooner. So do not panic with equal exchange players. It is when you are losing a pawn and a piece for a piece, or losing position and territory for a piece that you really must fret. It can be annoying but not really that much if you go through it over and over. ",
        "12. c3": "I was thinking he would do pawn to B4. ",
        "12... Bxc5 13. b4": "It would have worked better to guard the pawn than to just attack a piece that can easily retreat to a new position here. ",
        "13... Bb6 14. Nbd2 O-O": "I begin to think I might be keeping my LS bishop here. Not common to keep it in the CK. That is Caro-Kann, not Calvin Klein, okay?",
        "15. h3": "I see what he is going to do. Obsessive attackers telegraph their moves in advance rather than disguise them with decoys and smoke and mirrors. He is going to attack my bishop on the next move. ",
        "15... Rc8": "Maybe not a great move but just getting things set up for later. I do not retreat my bishop yet. Why?",
        "16. g4": "Here white makes an attack, again, on a piece that has a line of retreat. That is okay and I do it too. But \nWhite has also,and more importantly, uncastled himself needlessly. It would have been to his advantage, I think, to have stayed tucked in and developed his attack more. But it can be a compulsion I think to keep attacking and checking the other guy for some players. And do not think it cannot work, it can. But with a little experience you learn to relax and let it happen and things have a way of turning around often. ",
        "16... Bg6": "With the CK the bishop often goes all the way back to H7. I do not as I anticipate this will just make white want to push and attack the piece more. He has no LS bishop to force the common exchange in the CK. ",
        "17. Nh4": "I miscalculate which piece he will attack with (I figured his H pawn) and I also make a serious blunder here. I do not take the knight with my queen! It is a very bad mistake but we are moving a little fast and I am playing other games and do not focus like I should. ",
        "17... Bh7": "I go back to the little cubby hole white helped me make earlier. ",
        "18. Nhf3": "He sees his original mistake and retreats his knight, wisely. I ask you, who make the bigger mistake? The guy who leaves a piece in the open to be snatched, or the guy who misses the mistake? ",
        "18... c5": "Figure I will just push up the middle and see what happens. ",
        "19. Qe2": "Attacking A6.",
        "19... c4 20. a4 Bd3": "This slightly compensates for my queen not taking knight goof earlier, though in will lose my LS bishop, but losing it is often part of the Caro-Kann anyway and there is the psychological blow that moves like this delivers as well. ",
        "21. Qd1 Bxf1 22. Qxf1 d4": "I go ahead and continue pushing as now I am getting antsy myself at times. ",
        "23. cxd4 Bxd4": "I am two points up in material and the game is about half way over. Need to just pull back and relax if I can. ",
        "24. Rc1": "Here is a quality I have found in many players, and it is not always a bad one, but it is the attacking any and every unguarded piece they see. Of course why not do that, but I think spending a couple moves on such an attack can work better when a piece and pawn or two pieces are working in tandem. ",
        "24... c3 25. Nb3": "Now I am under some  pressure to hang onto my material lead. ",
        "25... Ba7 26. Qxa6": "I could not keep the pawn. Now white has two passed pawns on my queenside. I have issues, but there is a weakness for white. Will he see it? Most likely. ",
        "26... Ra8": "The weakness is, of course, my bishop to F3, check and then his queen is gone. But manfred's has learned about my tricks too and does not leave his queen there. ",
        "27. Qd6": "Of course he would love me to trade off queens and give him three passed pawns. ",
        "27... Qc8": "My queen makes her first move of the game at move # 27. ",
        "28. Nc5 Bxc5 29. Qxc5": "At this point white is making a good attack and I have to do something or I may be forced into an unwanted queen exchange. ",
        "29... Qb7": "Attacking his unguarded knight. ",
        "30. Qxc3": "Knight is now guarded and material is even again. Here often a certain kind of game forms for me. I have found that the other guy who is the one who wants to dominate the board more will begin pushing too hard to force advantages, that a status quo for several moves is not something he can tolerate. I used to be the same way. But you can sort of step back a bit and hope there is a \" rope-a- dope\" in the near future. Of course, that is a risky line of play too, as the other guy mY just whip your butt with a couple good upper cuts. ",
        "30... Rxa4": "A material lead once again. One pawn in the end me make or break a tight game. ",
        "31. Rb1 Rc8": "My extra rook is an issue for him to contend with now.  I just have to hang back, but I have to let him know I have fire power he lacks as well. ",
        "32. Qd3 Rxb4": "My two point lead is recovered rather quickly I think. I cannot read the board at a high level, but it would interpret that to mean I have more control over the ways things are shifting than my opponent does. ",
        "33. Rxb4": "I think this was a big mistake for white. He needed that rook. His passed pawns are gone and I am two points ahead. I think here the game goes south for him little by little. ",
        "33... Qxb4 34. g5": "Attacking now is not the best thing for white in my experience. He should dig in and prepare for black's coming attacks. I am not an aggressive player in the beginning or when my opponents is stronger or equal, but once there is a weakness I circle in, like a pack of hungry wolves staking a limping reindeer. Need to get that wounded critter now that he is a gimp and before he can recover or get away to help arrives. \n\n",
        "34... Rc1+ 35. Kg2": "I need his knight to move so I can get to E1. I think he will help me. ",
        "35... hxg5 36. Nxg5": "There we go. He may think he has an attack with queen to H7 but the game is wrapping up. ",
        "36... Qb7+": "I see a better line of attack and one that does not give my opponent much time or ways out as my previous idea, queen to E1 and then across and down, had allowed him. ",
        "37. f3 Qb2+ 38. Kg3 Rg1+": "These were all conditional moves as I recall now. ",
        "39. Kh4": "Less and less places to hide is the best thing for the attacker. Even providing one square as a way out is a mistake. ",
        "39... Qf2+ 40. Kh5 g6+": "One place to go. ",
        "41. Kh6 Qh4#": "I think at a few places he may well have had the game. Letting his castle crumble too early on and allowing me long range shots ( like move 36) were strategic errors that can be hard to see at time because one is trying to just attack something somewhere. A good game and tense. Manfred is not to be underestimated but just needs to slow down a bit now and then, then he will become quite a dangerous player. "
    },
    "url": "https://gameknot.com/annotation.pl/passive-vs-aggressive-with-a-caro-kann-game?gm=54768",
    "gameName": "Passive vs Aggressive with a Caro-Kann game",
    "players": "manfred12g (1416) vs. zhudan (1316)",
    "opening": "Caro-Kann defence (B10)"
}