{
    "moves": {
        "1. e4": "Hi everyone!\r\n\r\nSo many times have my Expert and Master buddies have said how patient they have been when they have been trying to press home advantages or even deal with slight disadvantages when playing me.  Well, this time it is my turn to be the higher rated opponent here.  I end up playing against the Sicilian Dragon.  I try to break through but meet stubborn resistance and at one stage my opponent (whose optimum rating was 1562) had very much the better of it.  He slipped up very late on in the game and allowed me to win 2 pawns.  I sacrificed those two pawns to exchange into a K & P ending.  Henry had the final say and I got my first rated win in about 3 weeks.",
        "1... c5 2. Nf3 d6 3. d4 cxd4 4. Nxd4": "4. Nxd4 - Standard Sicilian moves.",
        "4... Nf6 5. Nc3 g6": "5. ....... g6 - the Dragon Variation.",
        "6. Be3 Bg7 7. f3 O-O 8. Qd2": "8. Qd2 - standard Yugoslav Attack type development.",
        "8... Nbd7 9. Bc4 Qc7 10. Bb3 a6 11. O-O-O": "11. 0-0-0 - it is quite usual in the Dragon for white to castle on the opposite side.  Usually there are pawn rolls on each side but it doesn't quite happen here.",
        "11... b5 12. Bh6 Re8 13. Bxg7 Kxg7": "13. ...... Kxg7 - bishop trade.",
        "14. g4 Ne5 15. Nd5 Nxd5 16. Bxd5": "16. Bxd5 - a knight trade.",
        "16... Bb7 17. Bxb7 Qxb7": "17. ....... Qxb7 - now a bishop trade.",
        "18. h4 e6 19. h5 Reh8 20. Rh2": "20. Rh2 - my attack proceeds but will shortly come to a dead end.",
        "20... Qe7 21. hxg6 fxg6": "21. ....... fxg6 - surprise, was expecting hxg6.",
        "22. Qh6+ Kg8 23. Rf1": "23. Rf1 - to protect the weak backward f pawn.",
        "23... Nf7 24. Qd2 Kg7 25. f4": "25. f4 - the weakie advances.",
        "25... Rac8 26. f5 exf5 27. exf5": "27. exf5 - pawn trade.",
        "27... Qf6 28. Ne6+ Kg8 29. Qd4 Qxd4 30. Nxd4": "30. Nxd4 - queen trade.",
        "30... g5 31. Re2": "31. Re2 - to get first grab of the open e file.",
        "31... Ne5 32. Rg1": "32. Rg1 - that dangerous black horsie makes one of my rooks passive.  Now the g4 pawn is weak.",
        "32... h6": "32. ...... h6 - was expecting h5 making my f5 pawn weak and giving black a strong passed g pawn.",
        "33. b3 Kf7 34. Re3": "34. Re3 - to stop a possible rook incursion on c3.",
        "34... Rc5 35. Nf3 Nxf3 36. Rxf3": "36. Rxf3 - a knight trade.",
        "36... Rg8 37. Rh1 Kg7 38. Re3": "38. Re3 - without that pesky knight my rook now moves back on to the e file and threatens Re6.",
        "38... Rf8": "38. ....... Rf8? - loses pawn by a deflection motif as you will see.",
        "39. Re7+ Rf7 40. Rxf7+ Kxf7 41. Rxh6": "41. Rxh6 - voila, a pawn up, after being under the cosh for a few moves it was nice to plumb in some conditional moves - moves 40 and 41.  My patience is rewarded.  Black now defends with Rc6.",
        "41... Rc6 42. Rg6 a5 43. Rxg5": "43. Rxg5 - now the g5 pawn drops off.",
        "43... d5 44. Rg6": "44. Rg6 - I thought for about 3 days before this little shot in the dark.  My opponent did exactly as I had hoped though, played straight into my conditional moves as he thought he would win back the lost material.  He does but at a cost as you will see.",
        "44... Rxg6 45. fxg6+ Kxg6 46. Kd2 Kg5 47. Kd3 Kxg4 48. Kd4": "48. Kd4 - black's king has duly snaffled up those white passers and although material is even in a K & P ending black is lost.  Look at all those prawns!  Henry is licking his lips.  All three ebony pawns will duly drop off and it will be a toss up between one of my three ivory pawns as to which one gets to Glendadom.  My opponent realised this and waved the white flag.  What a relief!"
    },
    "url": "https://gameknot.com/annotation.pl/patience-is-a-virtue-my-friend?gm=22998",
    "gameName": "Patience is a Virtue My Friend!",
    "players": "jstevens1 (1772) vs. iwanttoplayfisch (1335)",
    "opening": "Sicilian (B76), dragon, Yugoslav attack, Rauser variation"
}