{
    "moves": {
        "1. d4": "Here are some analysis from two games in a recent Gruenfeld mini-tournament (the other game was against \"yulio\"), where we follow a main line with the big question: How strong will Whites advanced d-pawn be? The answer seems to be: VERY strong - but take a look at both games.",
        "1... Nf6 2. c4 g6 3. Nc3 d5 4. cxd5 Nxd5 5. e4 Nxc3 6. bxc3 Bg7": "Nothing much in this. It has been played thousands of times, but here White may consider a line with Bc4. Karpov preferred it in quite a few games against Kasparov - though with little success.",
        "7. Nf3 c5": "The classical attack of the White center.",
        "8. Rb1 O-O 9. Be2 Nc6 10. d5 Ne5 11. Nxe5 Bxe5 12. Qd2 e6": "The second attack on the center, but White has a good counter.",
        "13. f4": "Where should Be5 go to? Over the years there has been a dispute of wether Bg7 or Bc7 is best. I find Bg7 a bit too passive, but at least it protects the King. I tried the latter instead.",
        "13... Bc7 14. O-O exd5 15. exd5": "So finally, here is the d-pawn only three moves from the queening square. Nothing critical yet, but in this position I would prefer the White pieces: Better development, control over the half open b-file, and the pawn ...",
        "15... Ba5 16. d6 Rb8": "? A waste of time. According to later computer analysis, this was my only inaccuracy, but from now on Black is positionally more or less out of the game. 16. - b6 was better, but still Ba5 looks like a problem child.",
        "17. Ba3 Bf5 18. Rbd1 Rc8 19. g4 Bd7 20. Bf3": "White has put his pieces on perfect squares, so my only hope was some kind of a swindle on the K-side.",
        "20... Qh4 21. f5 gxf5 22. gxf5 b6": "Hadn´t it been for the pawn on d6, I would still have some optimism, but my opponent finds all the right moves.",
        "23. Kh1 Bxf5 24. Qd5 Bg6 25. d7": "What a pawn!",
        "25... Rcd8 26. Bb2": "Almost game over, but what if my Bishop had been on g7 instead of getting astray on c7 and a5?",
        "26... Qf6": "Looks like suicide, but I could not find anything better. My Queen is in the firing line from Rf1 and soon also from Bb2.",
        "27. Bg4 Qg7 28. Rf3 b5 29. Rd2 Kh8 30. c4 f6 31. Rdf2": "Black just got blown off the board, mostly because of bad piece coordination and that insisting pawn on d7. I will loose a lot of material (starting on f6), so in respect of my good opponent I chose to resign. At least I learned something - just take a look at my other game from the same tournament!"
    },
    "url": "https://gameknot.com/annotation.pl/patzerelis-gruenfeld-mini-tournament-i?gm=37861",
    "gameName": "patzereli's Gruenfeld mini-tournament I",
    "players": "superpom (2026) vs. ybrevo (2067)",
    "opening": "Gruenfeld (D85), modern exchange variation"
}