{
    "moves": {
        "1. d4 Nf6 2. c4 g6 3. Nc3 d5": "This was played in \"patzereli's Gruenfeld mini-tournament II\" so we didn't have much choice with the first three moves!",
        "4. cxd5": "I decided to play the exchange variation, having lost my last outing with the quirky 4. f3 (see http://gameknot.com/annotation.pl/is-this-rook-sac-really-sound?gm=36183)",
        "4... Nxd5": "So he takes back",
        "5. e4": "I grab the centre",
        "5... Nxc3": "He exchanges",
        "6. bxc3": "and I take back",
        "6... Bg7": "Roman continues to develop",
        "7. Nf3": "When I first played the Gruenfeld, this was regarded as a blunder, as it allowed black to pin the knight with Bc8-g4. Instead Bc4 followed by Ne2 was recommended. I studied many games with this variation (for instance Boris Spassky beat Bobby Fischer with it at the Siegen Olympiad), and I have played it as black frequently. However in the 1980s this move came back into fashion, combined with the pawn sacrifice which occours in the game.",
        "7... O-O": "Black continues to develop",
        "8. Be2": "as does white",
        "8... c5": "Black hits at the white centre in the recommended way.",
        "9. Rb1": "Now this was the \"new\" move which became popular in the 1980s. It discourages the development of the Bc8 and moves the rook off the long black diagonal, preparing the forthcoming pawn sacrifice.",
        "9... Nc6": "Black develops the knight.",
        "10. d5": "And this is the sacrifice!",
        "10... Bxc3+": "Which black accepts!",
        "11. Bd2": "The best way to block",
        "11... Bxd2+": "Black has to exchange, as he had both knight and bishop attacked.",
        "12. Qxd2": "white recaptures",
        "12... Na5": "Probably the best square for the knight",
        "13. h4": "So, a pawn down, we have to attack!",
        "13... f6": "This is the usual defence",
        "14. h5": "On with the attack!",
        "14... gxh5": "This is a bit double-edged - it opens up the black king side more. However it scores highly in the Gameknot opening database.",
        "15. Rxh5": "so I recapture",
        "15... e6": "Now, believe it or not, this is the first move not in any databases, Rf7 and Bg4 are the moves played previously. It is the only move of black which the Gameknot post-game computer criticizes. It may be the losing blunder! What do you think dear reader?",
        "16. Qh6": "Gameknot post-match computer program suggest d6 instead, but I think this is stronger. Black can't defend h7 with Qc7 or e7 because of 17. d6 nor by Qd7 because of 17. Pxe6",
        "16... Rf7": "So black defends in the only other way. Now, find white's next move. Cheat and use a computer program if you want!",
        "17. Ng5": "Now I wonder how many players, and how many computer programs for that matter, found this move. The Gameknot post-match computer program thinks this is a big mistake and gives 17. dxe6 Bxe6 18. Rxc5 b6 19. Rc2 Rc8 20. Rd1 Rd7 21. Rxd7 Qxd7 22. Rxc8+ Qxc8 23. Kf1 Nc6 24. Qxf6 Bxa2 as the best continuation, with 0.82 adavantage to white. However I think the move played wins for white! What do you think dear reader?\r\n",
        "17... fxg5": "Black more or less has to take, both Rf7 and Ph7 were attacked.",
        "18. Rxg5+": "White takes back",
        "18... Kh8": "Forced!",
        "19. Bh5": "Black can't really move his rook. It has to stay on the 7th rank to protect h7 and if it moves then the black queen is tied to f8, otherwise white plays Qf8 mate. So if the rook goes to c7 or e7 d6 is strong, or if Rd7 Pxe6 is strong again. So black is more or less forced to protect it.",
        "19... Qf6": "This or Qf8 amount to the same.",
        "20. Bxf7": "Brilliant queen sacrifice! Of course, if Roman had played QxQ I had Rg8 mate!",
        "20... Qxf7": "and he doesn't fall for those!",
        "21. Rc1": "Although a pawn down, this position is much better for me. If he now plays b6, I have Rc3 and this rook then comes along the 3rd rank with deadly effect",
        "21... Bd7": "So he develops. As I said, this is not given as a mistake by the Gameknot post-game computer and I don't think it is.\r\n",
        "22. Rxc5": "So I establish material equality again. However black is forced to part company with his knight, otherwise 23. Rc7, threatening Rxd7 and he can't recapture because of Qf6, is going to be too strong.",
        "22... Rf8": "Black threatens my f2 pawn. If Rxa5, Qxf2 actually leads to me getting mated, so I have to deal with this threat.",
        "23. f3": "Which fortunately is not hard!",
        "23... Nc6": "Now he has to part company with the knight. If say b6, 24. Pxe6 wins, for instance if Bxe6 I have 25. Rc7! or Qxe6?? 26. Qxf8+ and mate next move.",
        "24. dxc6": "So the knight goes",
        "24... Bxc6": "At least he gets his bishop to a decent square",
        "25. Rce5": "But now e6 is under fire",
        "25... Re8": "so he protects it",
        "26. Rg3": "This little re-organisation of my rooks is deadly!",
        "26... Qe7": "He prepares counter-attack with his queen.",
        "27. Reg5": "I complete the rook manoeuvre. The threat is Rg7",
        "27... Qb4+": "He throws in a check",
        "28. Ke2": "I move my king, and he resigns. This position is hopeless for black - my king will eventually get out of the checks, and then my threats will be irresistible. Many thanks for reading this, hope you enjoyed it. Please leave a comment and rate the annotation. Thank you!"
    },
    "url": "https://gameknot.com/annotation.pl/patzerelis-gruenfeld-mini-tournament-ii?gm=38984",
    "gameName": "patzereli's Gruenfeld mini-tournament II",
    "players": "charleshiggie (2146) vs. valenok37 (1992)",
    "opening": "Gruenfeld (D85), modern exchange variation"
}