{
    "moves": {
        "1. e4": "King Pawn opening, he expects e5. Everyone does it, it's the most common move. A move most people make without even thinking.",
        "1... Nc6": "\"Most\" people! I have used this response a number of times, with fair success. The knight is out early, what could be better than that?  \nThe GameKnot database calls it: B00: KP, Nimzovich defence\nI gotta say, I think that Nimzovich guy is pretty groovy.",
        "2. d4": "The textbook response. Apparent domination of the center by white. Black is in for some rough going to get a foothold in the center now. Perfect!",
        "2... d5": "Offering up the Marshall Gambit. Whatever that is?! I'm just learning about openings, and have studied only a few to any degree. What I saw was that this is going to cause immediate movement in the center. There is simply no way to avoid it. He either has to take my Queen Pawn, or move past him, or get a piece or pawn in place for protection of his King Pawn. What I didn't know was what that movement would be.",
        "3. e5": "He decides to move past the exchange. These sorts of moves always seem to jam me up, there a lowly pawn is, 3 moves into the game already across center ice. King Pawn is now constrained, and my development could easily be delayed.",
        "3... Bf5": "This is the standard response. I went with the text opening, although I much prefer to move my kingside pieces early and castle as soon as possible. I just feel safer after a castle, and always nervous when my King remains on d8.   However, the only way I'm going to learn openings is to follow the text line and explore it's benefits and strengths. I love to see some seemingly incomprehensible move from a text opening reveal it's strength 10 or 15 moves later!",
        "4. g4": "Damn! Right away, attacking my piece! I'll have to move the Bishop again. I always try to live by the advice of moving all your pieces once before moving any one twice. I think they'll make an exception in this case!",
        "4... Bg6": "I'm outta there!",
        "5. f4": "Hmm. Nary a piece moved on the white side. I don't feel so bad about having to move the Bishop twice now. But still, those pawns are getting too close for comfort.",
        "5... Be4": "Lookee there! A chance to bag a rook! ....................maybe",
        "6. Nf3": "Smart move. He had to protect the rook, and my Bishop was past any pawn attack. I was beginning to see some weakness in that last move.",
        "6... e6": "Clearing the way for the dark square Bishop. He can give check next move too. That's always fun!",
        "7. Bg2": "Clearing the Kingside for a castle?  I can't see trying to castle on that side any longer. The pawn structure is ruined there. And already an unprotected pawn on g4!",
        "7... Bb4+": "Too easy, had to do it! Plus, I decided I'd like my bishop on the g1-a7 diagonal in case he really did castle. With his pawns covering black, he might not see the danger, but we all know those pawns will _eventually_ fall! I guessed his next 2 moves. I used find those bishop pins knight to King or Queen mystifying. But this time I saw some potential for it. Incredibly the Bishop on b6 would prove to be perfectly placed. I usually feel like I am causing my opponent huge problems when I can chase off a Bishop with a pawn, but my thinking is definitely changing about that.",
        "8. c3 Ba5 9. b4 Bb6": "This is precisely where I wanted my Bishop. The potential threat to his King is obvious! \nLook at all those pawns out there!  And we're yet to exchange a pawn or piece. Now BOTH the King \nand Queen side are virtually useless for a castle.  \nI'm starting to kind of like what I see.",
        "10. a4": "Okay, he loves to move pawns. I see that he wants to attack either my Knight or Bishop. But the open ranks behind those pawns just look tempting, don't they?  ",
        "10... a5": "Opens a space for my knight. Not a great place, but no other good choices. I _refuse_, unless it is the _only_ possible move, to send a piece back to their home square. It's just plain bad. Evil even.  His pawns were at least able to keep that Knight at bay. \n\nHe may have some trouble with some diagonal pieces later  :)",
        "11. b5": "as expected, and I'll move the Knight to A7",
        "11... Na7": "See? Told ya!",
        "12. Nbd2": "Holy smoke, he moved a piece!",
        "12... Ne7": "I'm fixin' to castle. Although I end up never needing to castle. But the development of the knight was _crucial_ to the outcome!\nI don't really like where my Knights are. But those pawns are cramping my style... for now.",
        "13. Nxe4": "Took my Bishop. I love my Bishops, was said to see Mr. W.S. go. But the passed pawn, \"priceless!\"",
        "13... dxe4": "Look out, bad things are going to happen!",
        "14. Ng5": "He's attacking my kingside castle. sad thing is, nothing to back it up. His pawns have him as tied up as me. But theres a nice spot that just opened up that would make a lovely home for a Knight.",
        "14... Nd5": "I'm seeing some possibilities here! c3 is unguarded. Taking it will expose d4 (except for the queen, but he won't trade a piece for his queen.)",
        "15. c4": "Ah ha!!! That was the nail in the coffin as far as I can see.",
        "15... Nc3": "Got to the place I wanted, just didn't get to take the pawn. Oh well.\nD4 is doomed, I'm thinking my Bishop will look good there!",
        "16. Qc2": "Had to move here somewhere I guess. There were more inhospitable squares than friendly ones for the queen. Not sure where the better choice was. c2 protects the king better than b3, so I think this was the best move under the circumstances.",
        "16... Qxd4": "Thought about taking it with my Bishop, but decided the Queen would be better. Much better!",
        "17. Bd2": "Opps! That was a mistake.  And probably the \"real\" nail in the coffin instead of 15. c4  \nReally more a series of small errors that went south.\nHe never noticed my BS Bishop. Bummer. \n\nOr Yipppeee!  Depends on your side of the board.  \nI had to look at that for a while, just to make \"sure\". Sweet!\n\nThe wall of pawns didn't look so intimidating from the back side, and really proves what I have been reading in I.A. Horowitz'  \"How to Win in the chess Openings\" about making certain that you are not giving up territory by pushing a pawn. Pawns should support pieces, not vice versa.",
        "17... Qf2#": "Checkmate! No interpostion possible. Knight perfectly placed to prevent flight and the Black Queen is as safe on f2 as her home square. \nMy take is that there was too much pawn movement on the part of white, too early in the game. \nHe had no safe haven for his king. \nThe pawns that were moved were not guarded by other pawns as they should be."
    },
    "url": "https://gameknot.com/annotation.pl/pawn-mistakes?gm=3793",
    "gameName": "Pawn Mistakes",
    "players": "jefoy (1471) vs. graderguy (1502)",
    "opening": "KP (B00), Nimzovich defence, Marshall gambit"
}