{
    "moves": {
        "1. c4 Nf6 2. Nc3 d5 3. d4 c5": "I fear this move, playing with white. e3, the natural answer, blocks the white's bsb. Of course, theory shows this is acceptable, but I don't like it. And any other answers gives white some uneasiness. Look...",
        "4. Nf3 Nc6 5. dxc5": "Pawns away from the center. The show begins. ",
        "5... d4 6. Na4 e5": "Center occupied, the only reasonable move here for white is e3. Black then can choose Qa5+.",
        "7. h3 e4 8. Nh2": "To Ng5, Bf5...",
        "8... Be6 9. b3 Qc7": "Planning the strong queenside castling, that in one moves build a strong central pressure.",
        "10. g3": "Now, e3 is met by d3. Here, I am already thinking about Nh5, planning a sacrifice in g3. But I have no need to force the situation so early. ",
        "10... O-O-O": "Not fearing a pawn storm on the queenside. White is not developed enough.",
        "11. Bg2 e3": "White cannot take the pawn because I win a tempo attacking his queen.",
        "12. Qd3": "Again, Nh5 is ok. Or e3xf2 first, of course. Probably it was the best plan, but I couldn't resist the tempting...",
        "12... Nb4 13. Qd1": "Incredibly, it seems that the best move here is not e3xf2+. I analyzed a pretty lot, here... one \"of this\" situations...",
        "13... d3 14. Bxe3": "Ok, ok, I lost the e3xf2 check. But I have a concrete material win here.",
        "14... Nc2+ 15. Kf1": "Qxg3 is nice, since if f2xg3, NxBe3+ and I recover the queen. But still it is not enough to guarantee a win.",
        "15... dxe2+ 16. Qxe2 Nxa1 17. f4 Bf5": "Setting a little trap. My opponent didn't consider it, and the game is over. ",
        "18. g4 Bd3 19. Qxd3 Rxd3 20. Ke2": "Now, it is a boring won game. A pity. ",
        "20... Rxe3+ 21. Kxe3 Bxc5+ 22. Kf3 Nc2 23. Kg3 Be3 24. Rf1 g5 25. Kf3": "Any move is good, here. Probably, Qxf4+ was stronger. ",
        "25... Qc6+ 26. Kg3 Ne4+ 27. Bxe4 Qxe4 28. fxg5 Bxg5 29. Nf3 Qf4+ 30. Kg2 Ne3+ 31. Kf2 Nxf1 32. Kxf1 Qxf3+ 33. Ke1 Re8#": ""
    },
    "url": "https://gameknot.com/annotation.pl/pawn-storm-in-the-center?gm=24968",
    "gameName": "Pawn storm in the center",
    "players": "dime39 (1547) vs. damalfi (1644)",
    "opening": "English (A16), Anglo-Gruenfeld defense"
}