{
    "moves": {
        "1. d4 Nf6 2. c4 e6 3. Nc3 c5 4. d5 exd5 5. cxd5 d6": "This is the starting position for the themed MT.\n",
        "6. Nf3": "This is the main line, though I've never played it before, always favoring the 'flick-knife attack' with 6.e4 g6 7.f4 Bg7 8.Bb5+. Of course, that line is impossible with White's Knight on f3 already.\n",
        "6... a6": "Black moves to prevent an incursion on b5, a thematic square to fight over in this opening, and prepares ...b7-b5 for himself. I think it's more common to fianchetto the DSB first, or use a6 for a Knight maneuver (Nb8-a6-c7 to support b5), but this is perfectly playable.\n",
        "7. a4": "White increases his own control of b5 to prevent Black from using it.\n",
        "7... Nbd7": "This is the only place this Knight can develop at the moment. Black now eyes e5, probably the most thematic battleground square in this opening.\n",
        "8. e4": "White frees his Bishop and supports d5. This pawn will generally sit on e4 until White can orchestrate an e4-e5 break, or until Black manages to break the White center.\n",
        "8... Qe7": "?! Black brings out the big guns, threatening e4 and supporting e5, but I'm not certain that this is wise. Now the BQ is the sole defender of the d6 pawn, and she's lined up with her King, who is still at least three moves from castling.\n",
        "9. Qc2": "White reinforces e4 and moves his Queen to the half-open c-file.\n",
        "9... Ne5": "This was evidently the plan behind 8...Qe7, and occupying e5 is fine, but I don't think it gains much for Black here.\n",
        "10. Nxe5": "When Black recaptures, White will either gain a passed pawn on d5, or a tempo to beat back the BQ.\n",
        "10... Qxe5": "Black prefers to keep the e-file half-opened, but this does expose his Queen...\n",
        "11. f4 Qe7": "Black has now moved his Queen three times, and he's still far from completing development. White has a strong forward pawn cluster, though it remains to be seen whether it's too far advanced to be supported.\n",
        "12. Bc4": "White prepares to castle while supporting his forward pawns, and taking aim at f7 indirectly. Deciding where to place this Bishop is often a sticking point for me--depending on the game, it's just as likely to belong on d3 or e2 as c4. I chose c4 in this game because, as Black has yet to castle or develop his DSB, I felt confident that I would be able to make an e4-e5 break, in which case the d-pawn may need extra support.\n",
        "12... g6": "Black finally takes steps to complete his development.\n",
        "13. O-O Bd7": "This seems confused to me--Black prepared to develop his DSB to g7 (or even h6), so he should follow through on that.\n",
        "14. Bd2": "This Bishop presents a perennial problem for me in this opening; I have a terrible time figuring out when and how to develop it. With no Black Bishop on the long diagonal to complicate matters, it's significantly easier. From d2, the Bishop supports the kingside while still being able to jump into action on Black's weakened dark squares on the queenside.\n",
        "14... Nh5": "? Black's troops lack cohesion. I can't figure out what this move was meant to accomplish.\n",
        "15. e5": "Now that White's Rooks are connected, and with Black's forces in disarray and his King stuck in the center, it is the perfect opportunity to break through on the e-file. Of course Black can gain nothing from capturing, due to his King and Queen sharing the dangerous file.\n",
        "15... O-O-O": "Black evacuates.\n",
        "16. Rfe1": "Supporting the now-underdefended e-pawn, and threatening to expose an attack on the Queen, of course.\n",
        "16... Bh6": "Black seeks to undermine the White center, but this is easy to remedy. 16...Bg7 would have been stronger.\n",
        "17. g3": "White completes his pawn chain, stymieing Black's minor pieces. The White King breathes the fresh air without any worries for his safety.\n",
        "17... Ng7": "Presumably this Knight is headed for f5 or e8 (to support d6 en route to c7), but g7 really ought to belong to Black's Bishop.\n",
        "18. Ne4": "White activates his Knight by setting a trap: the e5 pawn is now defended only once. The Knight piles up on d6 to encourage Black to exchange...\n",
        "18... dxe5": "...which he does! I think this is an error, because the White d-pawn will now become an absolute monster, wielded with impunity against the entirety of the Black army, especially their King, who is not nearly as secure as he feels. I think 18...Ne8 was better.\n",
        "19. d6": "! Black's Queen is actually very limited in her scope, and this move cuts her off entirely from all of the action. Black's c-pawn is now en prise, and his forces are almost entirely unable to reach the queenside to defend their King.\n",
        "19... Qf8": "? This natural-seeming move is, I think, the losing error (though Black's position has been badly deteriorating for some time now). Had Black played 19...Qe8, the Queen could support a ...Bc6 move, and White would have to play Nf6 if he wanted to drive the Queen off of the e8-a4 diagonal. Why is that important, you ask? Well, in the text, White has all his minor pieces perfectly positioned to stage an unexpected incursion into the Black castle...\n",
        "20. Bxa6": "! I believe this move is decisive. Black cannot take the Bishop, for 20...bxa6?? 21.Qxc5+ Kb7 [21...Kb8 is the same] 22.Qc7+ Ka8 23.Be3 follows, with mate on a7 next move. If Black's Queen were on e8, this wouldn't be possible, because the Black Bishop could interpose on c6 to block White's check. If anyone can see a strong counter to this move, please let me know!\n",
        "20... Ne6": "I believe 20...Bc6 was the only defense here, though it's harder to see, and the text does look like it might be sufficient at first glance. The problem is that Black *must* get his Bishop to c6 before the file opens; otherwise the White Queen's checking power is overwhelming. \n",
        "21. Nxc5": "Now it's too late for ...Bc6, e.g. 21...Bc6 22.Nxe6 Qe8 (22...fxe6?? 23.Qxc6+ Kb8 24.Qxb7#) 23.Nxd8 Kxd8 24.Bxb7 and Black is lost. And of course the d-pawn is en prise now, but Black cannot afford to take it: 21...Qxd6?? 22.Nxb7+! Qc6 23.Na5+ nets the BQ.\n",
        "21... Nxc5": "This is not the most robust defense, but then again, Black is already lost.\n",
        "22. Qxc5+ Kb8": "or 22...Bc6 23.Qxc6+ Kb8. It's all over.\n",
        "23. Qc7+": "No one can come to the Black King's defense.\n",
        "23... Ka7 24. Qxb7#": "That's all she wrote! Many thanks to my opponent for a very enjoyable, spirited game! I hope you enjoyed the read; comments are much appreciated!\n"
    },
    "url": "https://gameknot.com/annotation.pl/pawn-wedge-pains?gm=53957",
    "gameName": "Pawn Wedge Pains",
    "players": "bwaa (1743) vs. ezogelin (1601)",
    "opening": "Nimzo-Indian defence (E20)"
}