{
    "moves": {
        "1. e4 e6": "I go for a French, which can be quite positional. The French, which usually curses Black's poor White-square Bishop to a life of being a Tall Pawn, or simply being traded off, but in this game, my Light Bishop proved to be quite the Piece, applying pressure to White's poor pawn on c4.",
        "2. Nf3 d5 3. Nc3": "Carrying us out of the database.",
        "3... Bd6 4. d4": "Finally a French-like position.",
        "4... c5": "As is the nature of the opening.",
        "5. e5 cxd4": "This probably should receive a ?!, since it trades off Black's Dark Bishop, going against the grain of the French.",
        "6. exd6 dxc3 7. Qd4": "Eyeballing g7, but not the right move here, since it allows cxb2.",
        "7... cxb2 8. Bxb2 f6": "The threat is easily neutralized.",
        "9. Bb5+": "And now White says \"au revoire\" to his Bishop pair, which may be a decisive factor come endgame.",
        "9... Nc6 10. Qc5 Qb6": "After making this move, I thought maybe Qa5+ would have been stronger, but no, I now do not think it is. \n\nI provoke a Queen trade since I am up a pawn and have superior structure. Black is good after 11.QxQ PxQ 12. BxN PxB with advantage.",
        "11. Bxc6+ bxc6 12. Qxb6 axb6": "Or that order. Whichever. Black now only needs to rid himself of that pesky d-pawn, and has but to wait while his opponent bleeds, searching for a way in.",
        "13. Ng5": "This Knight is poisoned. Kudos to White, but I saw 13...fxg5 14.Bxg2, winning the Rook.",
        "13... h6": "Chasing the Knight.",
        "14. Nf3": "Back to his original square.",
        "14... Kd7": "I had put this move off, but I decided that I would be safe even if I didn't castle.",
        "15. O-O": "He does, however.",
        "15... Kxd6": "About here I realize that if I can place all my pawns on dark squares, I can lock his Bishop down.",
        "16. Nd4 e5": "Perhaps he saw the fork on f5; consequently, White's Light Bishop is holding that square down.",
        "17. Nb3 d4": "One more pawn to go.",
        "18. c4 c5": "There. The pawn chain completely shuts down White's Bishop from all but five currently reachable squares. ",
        "19. f4": "Futile, really. Trading will not truly impair my wall.",
        "19... Ba6": "Now the poor c-pawn will need constant babysitting, tying up at least one of White's pieces at all times.",
        "20. fxe5+ fxe5": "White may own the file, but 21....Nf6 22....Rf8 and, upon moving the Knight, the file is now contested.",
        "21. Nd2 Nf6 22. h3 Nh5": "But I am going on the offensive.",
        "23. Kh2": "Stopping Ng3.",
        "23... Nf4 24. Ne4+ Kc6": "This check accomplishes little.",
        "25. Nd2 Nd3": "Attacking his Bishop.",
        "26. Bc1": "I do not want to trade my active Knight for his essentially worthless Bishop.",
        "26... Rhf8": "I contest the file, since his backup is blocked.",
        "27. Rxf8 Rxf8": "Now I control the file, and my Rook shall soon utilize it.",
        "28. a4": "He hopes to activate his Rook.",
        "28... Rf2 29. Ra2": "?? This loses.",
        "29... Nxc1": "Now Black will have little resistance after 30.Rc2 Nb3, and the Knight falls. Then black will simply march his center pawns up the board, any contesting will result in Black gaining material. He resigned. \n\nThank you, maongo, for this excellent game, and thank you, fellow chessman, for reading."
    },
    "url": "https://gameknot.com/annotation.pl/pawn-structure-owns-black-squares?gm=43483",
    "gameName": "Pawn structure owns Black squares",
    "players": "maongo  vs. theancientbeast ",
    "opening": "French (C00), Wing gambit"
}