{
    "moves": {
        "1. c4": "Hi everyone!\n\nA lot of players tend to fall to the knight fork, but there are also other forks, some that can be very easy to miss, the humble pawn fork.  In the three games I am about to show you I had the pleasure of executing such a tactical shot.  In this game, sadly, due to my inexperience at converting a won position, I settled for a draw when I should have gone on to win.  Now, I have a little more patience.  You can follow this game with the following analysis:-http://gameknot.com/analyze-board.pl?bd=9582247&fb=1&rnd=0.8716252950274858\n\nGail kicks off with 1. c4. which is the English Opening.",
        "1... Nf6 2. d4 e6 3. Nf3 b6": "3. ..... b6 - I decided to fianchetto Fou Leblanc on the a8-h1 diagonal.",
        "4. Nc3 Bb4 5. Bg5 Bb7": "5. ...... Bb7 - completing the fianchetto.",
        "6. a3 Bxc3+ 7. bxc3 h6 8. Bf4 d6": "8. ..... d6 - now you would never believe that a pawn fork will happen in this quiet looking position now, would you?",
        "9. e3 Nbd7 10. Bd3 O-O 11. O-O": "11. 0-0 - both sides tuck their kings away on the kingside.",
        "11... Re8 12. Re1": "12. Re1?? - but there is one coming now!",
        "12... e5 13. dxe5 dxe5 14. Nxe5 Nxe5 15. Bxe5 Rxe5 16. f4": "16. f4 - after the tactical stouche, Gail finds herself a piece for a pawn light.",
        "16... Re8 17. Qc2 Be4": "17. ...... Be4 - aiming to initiate another trade off to get into a won endgame.",
        "18. Rad1 Bxd3 19. Rxd3 Qe7 20. Rd4 Qxa3": "20. ..... Qxa3 - might as well grab that loose pawn on a3.",
        "21. e4 Rad8 22. e5 Rxd4 23. cxd4": "23. cxd4 - one pair of rooks is traded off.",
        "23... Nh7 24. h4 Qg3 25. Qe4 Qxh4": "25. ..... Qxh4 - and ",
        "26. Re3 a5": "26. ..... a5 - passed pawns must be pushed.",
        "27. Qc6 Qd8 28. Qe4 Qa8": "28. ..... Qa8 - trying to trade queens but Gail is not having any of it.",
        "29. Qc2 Qd8 30. d5 Nf8": "Here I make the biggest mistake of my chessic career - a bad draw offer!  Nowadays I hope I am a bit more discerning and patient before I hit that offer draw button.  The way to defend yourself against making bad draw offers in advantageous positions is to have a plan to convert these positions - planless play leads to inferior results.  Here is what Coach Ion had to say in his post match pm.  Hello, jstevens1! \nI think the way to learn how to convert late-game advantages is to play them out - indeed even play out endings that look drawish, if there looks as though there's still play left. You'll flub the odd one into unnecessary draws or losses, that happens to everyone (I can think of three or four at least that I've flubbed on GK), but you will bring home the desired result a whole deal more often, and your \"conversion\" rate can only improve with time. \n\nNow, in your game against yakky, I don't really like your last move, but it doesn't compromise your winning chances much: you ought still to win from the final position. I do wonder, though, whether you had made up your mind to offer the draw before you played the move, or afterwards. \n\nAnyhow, I'm going to take the game from White's last move 1.d5: \n\nInstead of 1...Nf8, Black could play 1...Nf6, exploiting the pin on the e-pawn to bring the knight to an active square. But it also carries a threat, namely, 2...Nxd5 3.cxd5 Qxc5 4.Qxc7 Qd4, with attack on the pinned rook and the f-pawn. Black ought to emerge from this 3 pawns to the good, but even if you ended up only two ahead (White plays 2.g3, say, and you went ahead with the exchange), you would have a near-on winning advantage still (1...Nf6 2.g3 Nxd5!? 3.cxd5 Qxd5 4.Qxc7 Qd4 5.Kf2 [Black would be more than happy with 5.Qc3 Qxc3, with 2 remote passed pawns in a rook ending - an easy win] 5...a4!?). \n\nIncidentally, this looks like an example of a theme in the latest \"Novice Nook\" thread. Ordinarily, White would want to keep the pieces on, and so here. The pure Q P and R P endings are all hopeless for White, pretty much. This adds another string to your bow: a latent threat to force piece exchanges. \n\nOf course, after 1...Nf6 2.g3 you might not want to give up the knight in this way, and that's fair enough. It might not be the best or simplest way to go. Instead, you could redeploy the knight 2...Nd7, 3...Nc5, and then start probing on the "
    },
    "url": "https://gameknot.com/annotation.pl/pawn-fork-part-1?gm=16516",
    "gameName": "Pawn Fork - Part 1",
    "players": "yakky (1702) vs. jstevens1 (1664)",
    "opening": "English, 1...Nf6 (Anglo-Indian defense) (A15)"
}