{
    "moves": {
        "1. d4": "Hi everyone!\n\nDespite the fact that pawn forks are more easier to spot than knight forks, even in games at Class A/Expert Level pawn forks can occur!  In this case there was a pin motif accompanying the fork.  But who was the victim?  Well read on!",
        "1... Nf6 2. c4 e6": "2. …. e6 - after allowing white to build an impressive pawn centre I now prepare to attack it - e6 prepares d5!",
        "3. Nf3 Nc6": "3. ….. Nc6 - development first!",
        "4. a3": "4. a3 - preventing a possible Nb4.",
        "4... d6 5. b4 e5": "5. …… e5 was played instead of d5 - white now has a very impressive looking pawn wall on the queenside.  A few jstevens1 hedgehog like moves follow.",
        "6. d5 Ne7 7. Nc3 Ng6": "7. ….. Ng6 Sir Lollabout must give Fou Lenoir some air!",
        "8. Qc2 Be7 9. e4 Bd7": "9. …… Bd7 - and we have another jstevens1 position - oh dear!",
        "10. Bd3 a6 11. h3 c6": "11. …… c6 - challenging white's queenside bind.",
        "12. Be3 Qc8": "12. ….. Qc8 - suddenly Glenda eyes up the kingside should King Butz choose to go there!",
        "13. Rc1 O-O 14. Na4 Bd8": "14. …. Bd8 - to challenge b6.",
        "15. Nb6 Bxb6 16. Bxb6 cxd5 17. exd5": "17. exd5? - yup, with the e4 square doubly defended you wouldn't think a pawn fork was possible would you?",
        "17... e4": "17. ……. e4! - I play it all the same because if the WQ goes to the e file she will be pinned against King Butz by my King Rook.",
        "18. Nd2": "18. Nd2 - he saves his knight.",
        "18... exd3 19. Qxd3 Re8+ 20. Kd1": "20. Kd1 - so my opponent loses two material points and the right to castle.  Getting this far is one thing but how to proceed from there is another.  With my next move I use Fou Leblanc to ramp up the pressure.",
        "20... Ba4+ 21. Nb3": "21. Nb3 - white is forced to put his knight in a pin - his king has no safe moves and it is the lowest value piece he can put in the way.  Now comes a knight fork.",
        "21... Nf4 22. Qc3 Qf5": "22. ……. Qf5 - out comes Glenda!",
        "23. Qc2 Qxc2+ 24. Kxc2 Re2+": "24. …. Re2+ - the queens are off the board but King Butz is in deep do-dos!",
        "25. Kc3 Ne4+": "25. ….. Ne4+ - White is a long, long way from copping Old Matey but will also be a long, long way behind in material as he cannot save his c3 knight.  He will be 5 points down on material.  Despite the rating differentials he decided this was far too much and waved the white flag.  Thanks to this game I got my second Expert Victory and enjoyed a brief sojourn in the 1900s."
    },
    "url": "https://gameknot.com/annotation.pl/pawn-fork?gm=66152",
    "gameName": "Pawn Fork!",
    "players": "thebutz (2075) vs. jotheblackqueen (1912)",
    "opening": "Queen's pawn game (E10)"
}