{
    "moves": {
        "1. e4": "Steve was playing on board 6 for us in the Wirral League knock-out cup. http://www.wirralchessleague.uk/results.php?comp=Knock+Out\nHis comments are in inverted commas.",
        "1... c5": "\"Sicilian again\"",
        "2. Nc3": "White plays a closed variation.",
        "2... e6": "I prefer 2....Nc6 keeping options open.",
        "3. f4": "\" (the Grand Prix Attack). I have been doing a great deal of studying on the Black side of this line recently so put this to the test. Danny Gormally and Simon Williams have done analysis on this in the recent past. I have produced my own system i.e. to constrict the White position by careful move order and piece placement thereafter.......3......a6 (a useful move in most Sicilians) \"",
        "3... a6": "\"A useful move in most Sicilians.\"",
        "4. a3": "\"a bit of a waste of tempo\" ",
        "4... Nc6": "\"controlling the key Queenside and d4 squares\"",
        "5. Bc4": "To me white's set-up seems poor. White is surrendering too many tempi.",
        "5... b5": "\"the point is to make this Bishop a bad one if possible which works a treat in this game\"",
        "6. Ba2": "Bishop retreats again.",
        "6... c4": "\"Restricting the Bishop\". This move seems weak to me, as white can just play d3 and b3 and force the removal of the blockage. Black would be better advised to get on with development.",
        "7. Nf3": "But white develops instead.",
        "7... d5": "\"Maintaining the bind\"",
        "8. exd5": "White takes. Fritz prefers d3 undermining c4",
        "8... exd5": "Black takes back.",
        "9. Qe2+": "White correctly throws in a check.",
        "9... Be7": "Black blocks.",
        "10. O-O": "White castles. Fritz prefers d3 undermining c4 or d4.",
        "10... Nf6": "Black makes the logical devlopment.",
        "11. Ne5": "\"a bit ambitious....maybe better to try to activate the dormant pieces\". Fritz prefers d4 or Rd1.",
        "11... Nd4": "\"Maybe 0-0 was better first\". Fritz likes this move.",
        "12. Qd1": "\"a difficult choice\". In fact the only way to save the queen and protect c2. Fritz agrees it is best.",
        "12... Qb6": "\"I had many options here but chose to get my pieces active and solid at the same time\". Fritz prefers Bb7 or 0-0.",
        "13. Kh1": "\"necessary due to all the veiled threats...now my time to get fully developed so castles now felt best......\"",
        "13... O-O": "Black castles.",
        "14. d3": "White starts to undermine c4 at last.",
        "14... Nf5": "\"gives many options for later\". Fritz agrees this is best. ",
        "15. dxc4": "White takes. Fritz prefers Qf3 or b3.",
        "15... dxc4": "\"Bishops still out of play and also the Ra1 trapped in too. Black must be much better now.\" After a think, Fritz puts black's advantage as over plus 1.",
        "16. Nd5": "\"forcing the trade but this seems to help Black coordinate\" ",
        "16... Nxd5": "Black correctly takes. Fritz gives black at more than plus 2 now.",
        "17. Qxd5": "White takes back.",
        "17... Be6": "Steve gives this move an exclamation mark, but Fritz prefers both Bb7 with plus 5 or even Bc5.",
        "18. Nd7": "\"After 25 minutes thought Dewi played the losing move...his position is really though now due to the three bad pieces and he's trying to attack without his full army. This leaves many gaps at the back as we shall see.\" Fritz gives black as only plus 1 after Qf3 or Qc6.",
        "18... Qc7": "Steve correctly gives himself an exclamation mark. Fritz says black is up plus 4 now.",
        "19. Qf3": "\"losing the piece but attacking still......\" Fritz gives this as best. ",
        "19... Bxd7": "Fritz prefers queen takes.",
        "20. Qe4": "\"dubious at best!\" Clearly a mistake, losing yet more time. Development was need. ",
        "20... Bf6": "\"protecting my potentially loose piece\" Fritz doesn't like this move.",
        "21. Rf3": "\"Final blunder\"",
        "21... Rae8": "\"attacks the Queen and if the Queen moves it's mate in 1 so Dewi resigned. Really pleased to win so easily. My system worked. I now have a 3-1 score to him against him. A good scalp as he always has had the better of our games years ago....but now I am the improved me! Thanks again for analysing if you have time.\" I have seen Dewi play a lot better than this, and I think Black's system worked as white failed to find the right plan against it, rather than its intrinsic merits.  Having said that, Black took his opportunities offered well, and didn't make any out-and-out blunders."
    },
    "url": "https://gameknot.com/annotation.pl/pen-y-ffordd-ko-vs-malpas-oswestry-ko?gm=63906",
    "gameName": "Pen-y-Ffordd KO vs Malpas & Oswestry KO",
    "players": "Dewi Jones (ECF127) vs. Steve Rush (ECF143)",
    "opening": "Sicilian (B23), closed, Korchnoi variation"
}