{
    "moves": {
        "1. e4": "So here I was up against the highest rated player in the tournament",
        "1... c5": "So I reply with my usual",
        "2. Nf3": "He follows the main line",
        "2... Nc6": "and so do I",
        "3. d4": "He continues with the Open Sicilian",
        "3... cxd4": "So I take",
        "4. Nxd4": "He takes back",
        "4... Nf6": "I hit the e pawn",
        "5. Nc3": "He defends",
        "5... d6": "I stop ideas such as Nd4xNc6 followed by e5. All this is very standard",
        "6. Bg5": "And this is the most popular too, the Richter–Rauzer Attack. The move 6.Bg5 was Kurt Richter's invention, threatening to double Black's pawns after Bxf6 and forestalling the Dragon by rendering 6...g6 unplayable, as g6 is simply met by BxNf6 and after exf6 Black's pawns are a mess, the d6 pawn in particular being isolated and backward on a semi-open file and the d5 square is open for White's pieces.",
        "6... Bd7": "I follow a suggestion by Barden",
        "7. f4": "He continues to develop",
        "7... a6": "I start queen side operations. Qb6 is probably stronger, taking advantage of the fact this his Bg5 can't defend dark squares in the centre.",
        "8. Qd2": "He prepares to castle",
        "8... b5": "I continue to expand on the queen side",
        "9. O-O-O": "He castles",
        "9... b4": "So I hit his knight. Now he can play 10. Bg5xNf6 as after bxNc3, hitting the white queen, White can play 11. Qd2xc3 and after gxBf6 play 12. Nd4xNc6, winning a pawn. However Black can reply with Qc7 and after White retreats his knight, exchange queens on c3 and the position is about level. Black has compensation for being a pawn down, as White's queen side pawns are smashed. This was better for White compared to what happened, where White ends up a pawn down AND a broken pawn formation.",
        "10. Nd5": "So he keeps his knight",
        "10... Nxe4": "But loses a pawn, and his queen and bishop are forked",
        "11. Qe3": "So he moves his queen",
        "11... Nxg5": "I take his bishop",
        "12. fxg5": "He takes back",
        "12... a5": "I secure my b pawn, releasing the Nc6 from protecting it, and preparing the following move",
        "13. Bc4": "He develops",
        "13... Ne5": "I hit his bishop, and prevent any nonsense down the e file.",
        "14. Be2": "So he retreats his bishop",
        "14... g6": "and I prepare to put my bishop on g7, protecting Ne5 and also with an idea of an attack along the long dark diagonal.",
        "15. Nf3": "So he tries to exchange my strong knight",
        "15... Bg7": "and I strengthen it",
        "16. Nb6": "He now takes the opportunity to get rid of one of my bishops",
        "16... Rb8": "so I hit the knight",
        "17. Nxd7": "He takes",
        "17... Qxd7": "I take back",
        "18. h4": "He tries to do something on the king side",
        "18... O-O": "I castle",
        "19. Rhe1": "This was a bit of a surprise. h5 seemed more consistent",
        "19... Qa4": "so my queen mobilises. Can you see what I am dreaming of?",
        "20. Kb1": "Is the king any safer here?",
        "20... Rfc8": "I continue to mobilise",
        "21. Rdc1": "and he protects c2",
        "21... Ng4": "Ihit his queen, sacrificing my e7 pawn. I thought he couldn't take it, and was expecting another queen move, however.....",
        "22. Qxe7": "OK, pause and find my next move!",
        "22... Qa3": "I thought I was clearly winning. The threat is Qxb2 mate. If he takes my queen, I take back with the pawn, discovered check and mate in 2. I couldn't see any defence for White. So pause again, and work out what White did play.",
        "23. Ne5": "This must be his best shot. If I take with the bishop then he takes my bishop with his queen, and after I take take back he can take my queen and this time there is no mate. But what if I take with my knight?",
        "23... Nxe5": "so I tried this",
        "24. bxa3": "He takes",
        "24... bxa3+": "I take",
        "25. Ka1": "King runs",
        "25... Nc6+": "This is ok, but lets White escape into an ending. Nd7 was probably better",
        "26. Qf6": "so he blocks the check",
        "26... Bxf6+": "I take",
        "27. gxf6": "He takes",
        "27... Rb2": "I take the 7th rank",
        "28. Bf3": "Bishop mobilises",
        "28... Ne5": "Knight advances, threatening R(either!)xc2",
        "29. c3": "He prevents that, but runs into....",
        "29... Nd3": "Picking up the exchange. White resigns. Many thanks for looking at this, please rate my annotation on the star system and leave some comments, so I know how I am doing. Please remember that this was a quick-play game, both sides had just 15 minutes each to make all moves. Until next time!"
    },
    "url": "https://gameknot.com/annotation.pl/pen-y-ffordd-january-quickplay-round-2?gm=48272",
    "gameName": "Pen-y-Ffordd January Quickplay Round 2",
    "players": "Chris Doran (ECF179) vs. Charles Higgie (ECF162)",
    "opening": "Sicilian (B58), classical"
}