{
    "moves": {
        "1. d4 d5 2. Bf4": "My favourite. ",
        "2... Nf6 3. h3": "I know this is called \"a loss of tempo\". Probably it is, as this game shows. But it is the base for an early g4-g5, that makes always shake black's kingside, if he is not familiar with the position. ",
        "3... e6 4. Nf3 Bd6": "This is an early choice for black. Normally, players go Be7, etc. This challenges me at once: either I let him exchange the bishops (and I reckon it is played and not regarded as \"bad\" for white, but it is not my choice), or I go for e5.",
        "5. Ne5 Nbd7": "Now, white's play is to keep the tension and develop quicly, while black deals with this knight. It means f6. For this, black has to move his knight, and can put it on e4. Normally, this is not a problem for white (even if it is a specular outpost), but in this very situation, it becomes so. ",
        "6. Nd2": "This is to support quickly Ne5 with the other knight. Black can go c5 and then Qc7 and attack. I must be prepared, this was the knight's move purpose. And it's thematic. White plans to close the queenside with c3. \nBut maybe an improvement should be made on this line. ",
        "6... c5 7. e3": "First this one, thematic too, that opens the lsb's way but, much more important, prevents the knight to jump to h5 after a future g5. Of course, it doesn't solve the e4 placement. ",
        "7... O-O 8. g4": "If I prepare this move with f3, in order to prevent the knight's jump to e4 after g5, I self-block my queen's action on h5, that turns to be a nice outpost for the black's knight. I don't want him to exchange my bishop, so I have to retire it to h2, and this gives black a valuable tempo for further defence. \nSo I go for it at once, maybe underestimating the power of his knight in e4. ",
        "8... cxd4 9. exd4": "Ok, also thematic. Black can choose to close my lsb with c5, or this exchange. Both are good, IMO. ",
        "9... Qc7": "Here he goes with the attack on the knight. Ok. I'm prepared. ",
        "10. Ndf3": "Now, my g5 plan doesn't work anymore. Ok, I just have to prepare it. \nBy the way: would Qe2 have been better? I see a very interesting line over there: after 10. Qd2, Qxc2. In my view, white can go 11. NxN (tactic, because it leaves the bishop en prise). Best black's seems to be BxBf4, leaving white with the exchange 12. NxRf8, KxN. After it, white frees the docks with Nf3. \nBut wait: what if black goes after the a1 rook with: 12. NxRf8, Qxb2! ? White goes 13. Nb3, it seems the most sensible move. Black may want to exchange queens then taking the Nf8, and the game proceeds quietey, or go for 13.... Qc3+, 14. Kd1, Ne5, after which white is very unconfortable. Not whorty to try to grab a pawn (Nxe6), that frees black. \nSo, Qe2 seems a bad choice, but a lot must be said, for sure.  ",
        "10... Ne4": "Here he goes. I know his next one will be f6. The NxN \"threat\" is a good way to get out of the situation... or it is not??? \n",
        "11. Bd3": "Another move, more in the spirit of white's way of play, was 11. g5. The idea is that after 11.... f6, 12. gxf6, Nxf6, 13. Rg1, attacking. Or 12... Rxf6, that leads to strange lines like this one: 13. NxN, and if RxB, 14. Ne5, BxNe5, 15. dxe5, and I'm too tired to find out more. It is an interesting position.\n\nfen=\"r1b3k1/ppq3pp/4p3/3pP3/4nr2/5N1P/PPP2P2/R2QKB1R b KQ -\"\n\nI think white loses after Qa5+, followed with the knight sac, with either c3, Ke2 or Nd2. Do you agree? The three are interesting, believe me :-)",
        "11... f6 12. Nxd7 Bxd7": "Now, as white, I cannot say I have a good position after the exchanges... so, Bd3 was not good either. But let's go on with the exchanges. ",
        "13. Bxd6 Nxd6": "Ok, a quieter situation. What is left for white? Nothing. I have to rebuild an attack. ",
        "14. c3 Nc4 15. Qc2": "This knight is not an inmediate threat, and surely it doesn't deserve b3. \nBut I overlooked...",
        "15... e5": "...disregarding the threat in h7. Sometimes, these checks are a self trap, so be careful. ",
        "16. Bxh7+ Kh8 17. Bf5": "I think I can hold. ",
        "17... Bc6": "Back doesn't have too much yet... right?",
        "18. Nh4": "...so I go for a try. Let's see if I can make something of this, after all. ",
        "18... Kg8 19. Bh7+ Kf7": "Not exactly a bunder, since Kh8 lead to a well-known Ng6+, KxN, NxR++, and white seems to win the attack - if not the game. ",
        "20. Qg6+": "But this allows my queen in, and now black is suddenly shaked! :-)",
        "20... Ke7 21. Qxg7+": "My problem is that Nf5+, obvuious like it seems, is not the proper move to win. ",
        "21... Rf7 22. Qh6": "So I tried this one instead. R h8 is impossible.",
        "22... exd4": "Crazy as it seems, I had the plan to win by bringing a rook into the fray, and not anyhow else. So I allowed \"some\" pawn's munch. ",
        "23. O-O": "I thought about queenside, but then the hungry pawn would have eaten with check, and I didn't had time enough to calculate, but it looked very dark. ",
        "23... dxc3": "Yes, opening the way for the lsb's action... scary. As it will prove to be. ",
        "24. Rfe1+": "Rook into the fray. Ok. ",
        "24... Ne5": "!!! I didn't see it. Ok, so let's be aggressive (the wise bxc3 is out from my repertoire on a blitz wild game... that's because I lose so much). ",
        "25. f4": "As if I had calculated it :-)",
        "25... Qb6+": "Easy to see, isn't it?",
        "26. Kh2": "If Kg2, d4 is lethal. Maybe Kf1?",
        "26... Qf2+ 27. Ng2": "The only defence, and I thought that it will hold. I still have threats after Rg1. But black has a nasty pawn on c3 that worries me a lot.",
        "27... d4": "Now, Rg1 makes me very vulnerable to the pawn's advance... I had urgently to find a way to get out of this. So I HAD to bet for my only chance...",
        "28. Rxe5+": "It turned out to be good. But who would have said that?",
        "28... fxe5 29. Qg5+": "Believe it or not, I'm looking for a PERPETUAL here. ",
        "29... Kd7": "I can defend from mate with Rg1 (the ONLY one move: white's queen cannot reach a square to defend g2), but then I'll be probably crushed by black pawns. ",
        "30. Bf5+ Rxf5": "So, this is a nice turn. I can save myself with gxR. It defends my g2, but then black can go Qxb2, and... I was running out of time, too!",
        "31. Qxf5+": "This was even more adventorous. I can win a lot with my queen's chechs, but it is not possible while black grabs g2. ",
        "31... Kc7 32. Qf7+ Kb6 33. Qb3+": "I have to be sure that I will have checks all the time. ",
        "33... Kc5 34. Qa3+ Kb6 35. Qb4+": "Incredibly enough, I think I have perpetual. Then... Could I win?",
        "35... Kc7 36. Qe7+ Kc8 37. Qf8+ Kd7 38. Qf7+ Kc8 39. Qf8+ Kc7 40. Qe7+ Kb6": "I already decided to try a plan, so I want to put my queen on the right spot. ",
        "41. Qb4+ Ka6 42. Rg1": "He is struggling to avoid perpetual, and he must have been very surprised when I broke the checks! The fact is I think I would have perpetual, or I'll deal with the black pawns. ",
        "42... exf4": "I expected something like Qxb2, but black is decided to win and finds another very good mate threat: Qg3, Qxh3. I AM AGAIN AT THE SAME POINT than before. My queen cannot get on time to defend g3 OR h3!",
        "43. Qa3+": "What else? Going for the perpetual again!",
        "43... Kb5 44. Qb3+ Kc5 45. Qa3+ Kd5 46. Qb3+ Ke5": "...and THIS gave me a chance. The perpetual trap is really so strong for black as his grimp on g2/g3 is for me. Isn't it interesting? ",
        "47. Re1+": "Getting the other rook into the fray, and allowing a DOUBLE mate threa on my king. Now, this move is \"unnatural\". ",
        "47... Be4": "So stupidly, here I didn't consider Qb5+ followed by RxB. But be aware: the pawns are still there. So I opted for...",
        "48. Rxe4+ Kxe4 49. Qxb7+": "More tactics. If Qe6+, Kmoves and then Qe3+, forcing the queen's exchange, but again, his pawns are there - well, one of them. But wait. ",
        "49... Kd3": "I cannot take the rook so lightly. Black threats f3, and I have to go for a perpetual again. Noooo! :-). But Qxb2, will be enough to win, since I cannot stop the pawns. So, I CAN'T TAKE that juicy rook! What a nightmare!",
        "50. bxc3": "Those pawns must be dealt with. ",
        "50... f3": "Probably a blunder. But it is true that I still CANNOT take the rook, and - oh, no, not again! - needing a perpetual to survive!",
        "51. Qb5+ Kc2 52. Qb3+ Kc1 53. Qa3+ Qb2": "WAIT! Black, probably desperate, thinks that with a rook against a knight he could win. And propose a liberatory queen's exchange. Was it good?",
        "54. Qxb2+ Kxb2": "Now, cxd4 was ok? After losing the knight for a pawn, I have two joined pawns on g an h... after the impressive pawn's center, black has now to fear MY pawns... BUT black has a tiny little pawn on a7... and for this \"insignificant\" pawn, I gave up the idea. ",
        "55. Nf4": "I know I will have to sac the knight, but let's see. ",
        "55... Rc8": "Not the best choice, of course. I think that dxc3 would have been crushing me. \n\nLet's see this: 55. cxd4, fxN, 56. Kxg2, Kxa2, 57. h4, a5, 58. g5, a4, \n\nfen=\"r7/8/8/6P1/p2P3P/8/k5K1/8 w - -\"\n\n59. d4!\n\nAnd I think black has difficulties to cope with all the pawns. Say: \n\n59.... Rd8, 60, g6, Rd7, 61. h5, Kb2, 62. h6, A3, 63. h7, \n\nfen=\"8/3r3P/6P1/3P4/8/p7/1k4K1/8 b - -\"\n\nblack can Rd8, g7, a2, and the situation is similar to actual game. \n\nif 63. ...a2, 64. h8=Q+, Kb1, and now is black that has to escape perpetual. Because if g7, black gets a queen on his own, and white has only checks to save him... for the third time! :-O\n \n\n\n\nBut HE was running out of tempo, now...",
        "56. cxd4 Rc2+ 57. Kg1": "Nice try, boy, but you wont' have enough for this. ",
        "57... Rd2 58. d5 Kxa2 59. g5": "Now that the situation is stalled, MY pawns will win. ",
        "59... Rd4": "You'll see an amazing knight, here.",
        "60. Ne6 Rxd5 61. g6": "AND THE ROOK CANNOT STOP the pawn!!!!!!!!!!!!! Black played excellently, and the game was one of the craziest I've ever played, with som many double-edged positions. \nBeing fair, I should have lost it, I deserved it. But, most important: it was FUN :-D",
        "61... Re5 62. g7 a5 63. g8=Q": ""
    },
    "url": "https://gameknot.com/annotation.pl/perpetuals-race?gm=43358",
    "gameName": "Perpetual's race. ",
    "players": "damalfi  vs. clintsmith ",
    "opening": "Queen's pawn, Mason variation (D00)"
}