{
    "moves": {
        "1. Nf3": "Hi everyone!\n\nIt is not often I give away the outcome of a game in the title, but because this game will go in a themed thread on Walking the Walk & Learning to Run, I feel it is necessary.  The player who is at a disadvantage (either threatened with # on the move) or behind on material usually instigates the perpetual check.  But who was the instigator of the perpetual?  Read on and find out.",
        "1... c5": "1. ….. c5 - In response to the Reti, Simon plays c5.  I think he is hoping to transpose into a Sicilian.",
        "2. e4 d6 3. d4 cxd4 4. Nxd4": "4. Nxd4 - and it does!",
        "4... Nf6 5. f3 e5 6. Nb3 Be6 7. c4 a5": "7. …… a5 - I think Simon is trying to stop me from castling long.",
        "8. Be3": "8. Be3 - development.",
        "8... Be7 9. Nc3 O-O 10. Be2 Nc6 11. O-O": "11. 0-0 - so I go kingside.",
        "11... a4 12. Nd2 Qa5 13. Nd5 Bxd5 14. cxd5": "14. cxd5 - B for P trade.",
        "14... Nb4 15. a3 Na6": "15. ….. Na6 - Simon's knight is driven back.",
        "16. Nc4": "16. Nc4 - and Sir Lollabout goes forward!",
        "16... Qc7 17. Qxa4": "17. Qxe4 - and now Glenda zaps a pawn!  But will she get away with it?  We shall see.",
        "17... Nc5 18. Qd1": "18. Qd1 - she bids a hasty retreat!",
        "18... b5 19. Nd2": "19. Nd2 - so does Sir Lollabout!",
        "19... Rfb8 20. Rc1": "20. Rc1 - pin!",
        "20... Qd7 21. Qe1 b4 22. axb4 Rxb4 23. Bxc5 dxc5 24. Nc4": "24. Nc4 - after a plethora of exchanges, Sir Lollabout returns to c4.  I now have a passer on d6.  This looks good but it looks as though Simon has a plan of attack from his heavies via the queenside.",
        "24... Qc7 25. Rd1": "25. Rd1 - threatening d6 forking BQ and BB.",
        "25... Ne8 26. Qg3 f6 27. Qg4": "27. Qg4 - Glenda is thinking of entrenching herself on d6 with check.",
        "27... Nd6 28. Nxd6 Qxd6": "28. ……. Qxd6 - knight trade.",
        "29. Rd2 Rab8 30. Rb1 Qb6 31. Rc2": "31. Rc2 - I plan to trade my b pawn for Simon's c pawn.",
        "31... c4+ 32. Kf1": "32. Kf1? - in retrospect a misstep for Henry.  I was loathe to create the possibility of back row chances by putting him on h1.  However, Henry will be far more trapped as the game will evolve.",
        "32... Qe3 33. Qe6+": "33. Qe6+ - so both queens sit on the e file and on their respective opponent's third rank!",
        "33... Kf8 34. d6 Bd8 35. Bxc4 Rxc4 36. Rxc4 Bb6": "36. ….. Bb6 - I end up a clear exchange and two pawns up.  But, Henry is just starting to shiver.  It seems as though Old Matey is about to descend on f2 and I can do nothing about it.  But!",
        "37. Rc8+ Rxc8 38. Qxc8+": "38. Qxc8 CHEEECK!!",
        "38... Kf7 39. Qd7+ Kg6": "39. ….Kg6 - this move is virtually forced.  Either Kf8 or Kg8 lead to Glenda delivering mate on e8.",
        "40. Qg4+": "40. Qg4+ Glenda checks King Simon again!",
        "40... Kf7": "40. …. Kf7 - King Simon retreats to f7.  He could block the check with his queen but I would simply trade queens and he is an exchange plus two pawns down - not in his best interests.  The king retreat allows Glenda to check again on d7.",
        "41. Qd7+ Kg6 42. Qg4+": "42. Qg4+ and draw offer which Simon accepts.  He told me in the chat that he felt it was quite an exciting game.  Ah well, I hope you have a good read because I have two more annotations in the pipeline for you.  One more from Yours Truly which I will call Berserker Pawn and another from ab15 which will require a lot of thought!"
    },
    "url": "https://gameknot.com/annotation.pl/perpetual-check?gm=66848",
    "gameName": "PERPETUAL CHECK!",
    "players": "jotheblackqueen (1904) vs. 5imon (1997)",
    "opening": "Reti opening (A04)"
}