{
    "moves": {
        "1. e4": "Tournament game I am annotating at the request of the_hog.  Welcome comments/suggestions from all.",
        "1... e5 2. Nf3 Nf6 3. Nc3 Nc6": "Pretty standard Petrov 3 knights",
        "4. Bb5": "Similar lines to Ruy Lopez...",
        "4... Nd4 5. Nxd4 exd4": "All book to this point, very standard stuff...",
        "6. Ne2": "I like the more aggressive e5 here, offering knight exchange.",
        "6... Nxe4": "Not one to look at a free pawn and let it go, I opted to take...",
        "7. f3": "Better to castle or perhaps d3, though castle and getting the king to safety is the better play.",
        "7... Nd6": "I also considered Nc5.",
        "8. Bd3": "I also thought White could have played Nxd4, but some prefer bishops to knights.",
        "8... c5": "Looking to protect the d4 pawn",
        "9. c3": "Given the position of the LSB on d3, it should be a priority to get the DSB in the game, so b3 should be given a hard look.  Also, this move basically encourages trading a bishop for something else with a pawn push, making it a negative play.",
        "9... c4": "Natural follow up",
        "10. Bc2": "The best play was Bb1, this move is now going to trade a piece for a pawn.",
        "10... d3 11. Bxd3": "I like that he took right away, getting the pin over with.",
        "11... cxd3 12. Nd4": "I think Nf4 would be more natural here.",
        "12... Be7": "Prepping to castle.",
        "13. O-O O-O 14. Qe1": "Perhaps White is looking to acquire the pawn on d3?  A better play would be to get the DSB in action by moving the b pawn.  Once you castle your development isn't complete until you connect your rooks.",
        "14... Bf6": "My eventual goal is to get my LSB into the game and get some movement on my d7 pawn, but this move allows me some options on piece trading if it becomes advantageous.  Also, there is an open vertical to the king and if I can pincer that knight by eventually moving my queen to b6, there could be some options for a nice attack.",
        "15. Qe3": "Apparently going after the pawn at d3.  A lot of moves just to get rid of a pawn that isn't going anywhere...  Better to connect the rooks first.",
        "15... Nc4": "If White is going to focus on the pawn, I might as well get to reposition my pieces for free in the process...",
        "16. Qxd3 d5": "Allows me to centralize a knight, make space for my LSB to get into the game, and gets me closer to finishing my development.  While I could have moved my b pawn to allow my LSB out, I don't want to give up the angle for my queen to attack the king by blocking the b6 square.",
        "17. b3": "Generally speaking you don't want to let enemy pieces stick around on your side of the board, so pushing me away makes sense, but, it allows me to force his queen to move again.",
        "17... Ne5 18. Qb5": "I'm not entirely certain what White is going for here... Perhaps some trade options for pawns or a chance to tackle my b pawn once I move out my bishop?",
        "18... a6": "There are a lot of places that White can move his queen that will cause him some serious trouble.  ",
        "19. Qe2": "Tactical redeploy.  Might have been better to move there or to c2 originally.",
        "19... Qb6": "Now, finally getting my pincer attack in place for White's king.",
        "20. Ba3": "Trying to build some pressure and getting his DSB into the game.  Good positional play.",
        "20... Re8 21. Qf2": "I thought f4 could have held some tactical intrigue.  Another move worth considering is Kh1 to get the pin undone on the knight.  Instead this move allows Black to get a free pawn, isolate a center pawn, and still keep some attack options open.  Therefore I label this move a mistake.",
        "21... Nd3": "Natural follow up, forcing only one response from White.",
        "22. Qg3 Bxd4+ 23. cxd4 Qxd4+ 24. Kh1 Be6": "I elected to finalize my development and connect my rooks on the back rank.  In retrospect Re6 or Re2 could have been more fun.",
        "25. Qc7": "Mistake!  Other than Qxb7 I don't know what White was hoping to get out of this play, as he desperately needed that queen where it was to prevent any mischief against his king.",
        "25... Nf2+": "Forcing a rook for knight trade.",
        "26. Kg1": "Blunder Mate (3).  In all my games this one is actually my first ever smother mate that I can recall achieving.",
        "26... Nh3+ 27. Kh1 Qg1+ 28. Rfxg1 Nf2#": "White only made 3 real mistakes in the game, but rather than focus on the specific moves, I'll offer some advice.  I think what was lacking was any urgency to fully develop his pieces.  Instead of focusing on the white pawn that was effectively dead, White should have worked to finalize development sooner.  White moved his queen into Black territory twice, without a clear strategy and the second time it should have been maintaining defense.  When making forays into enemy territory, seek to use multiple pieces to have a sustained presence and threat.  Finally, you have to play defensively sometimes.  Don't move out pieces that are critical to defense and consider all potential moves on enemy attacks and understand when you have to trade, even if it's not to your advantage. Being ahead in points doesn't matter if you get checkmated.\n\nThanks for your comments and review."
    },
    "url": "https://gameknot.com/annotation.pl/petrov-3-knights-game?gm=62606",
    "gameName": "Petrov 3 knights game",
    "players": "the_hog (1497) vs. evilgm (1915)",
    "opening": "Petrov three knights game (C42)"
}