{
    "moves": {
        "1. e4 e5 2. Nf3 Nf6": "Usually, the response is Nc6. But swindon went for the Petroff Defense. Otherwise known as the 'Russian Game'. Black is simply trying to keep things equal and nullify the advantage of White's first move and achieve simple equality.",
        "3. Nxe5 Nxe4": "Usually, the best move for black here was d6. Nxe4(?!) as the old trap here is possible.",
        "4. Qe2": "Qe2 is the normal response to Nxe4, hoping that black is silly enough to do 4...Nf3 5.Nc6!! when  white wins black's queen due to the discovered check from the queen.",
        "4... Qe7": "Qe7(!?) black trying to keep the game as symmetrical as possible. I find that in general, the Petroff Defense is played by those who don't mind drawing as black. If you are in a must-win situation, this opening would not be a good choice. Just in-case you wanted to know so far is the position American Champion Frank Marshall had, who liked to play for the win as black. However, if white plays d3 white has what few chances there are. ",
        "5. Qxe4": "Qxe4 (!?) Well, i thought i should might as well take the knight so i'm a whole piece up so early in the game. Only downside of this is that the knight is pinned due to the black queen.",
        "5... d6": "Obviously trying to get rid of the knight, which becomes en prise from the pawn.",
        "6. d4": "d4 just keeps the knight feeling a bit safer and gains more control in the center of the board.",
        "6... dxe5 7. dxe5": "Exchange helps white to win a piece back, though still a pawn down, with no central pawns.",
        "7... Qb4+": "Qb4+ is there really any point to exchange queens off right now? I don't think so.",
        "8. Qxb4 Bxb4+": "I exchanged queens off as i am a pawn up and i was forced to or i would have lost my queen.",
        "9. Bd2 Bc5": "Black retreats his bishop to c5 to try an attack on f2.",
        "10. f4": "I feel this is the obvious move,  getting rid of the threat, and beefing up the e5 pawn. White has complete control in the center.",
        "10... Bd4": "Black bishop attempts an attack on b2, which is very easy to spot.",
        "11. Nc3": "Bd4 just helps white really with Nc3, helping white to develop. White has now 4 pieces out on the board (Nc3,Bd2,e5,f4) while Black has only his bishop on d4. However, i think the b6-g1 diagonal, is quite a nice one for it.",
        "11... Bxc3": "Bxc3? Why get rid of your only active piece which is in a nice position for a not-as-well-placed knight? Black has just got rid of his ONLY active piece! ",
        "12. Bxc3": "The exchange puts me into a brilliant position.",
        "12... O-O": "Castles to get his king out of danger.",
        "13. O-O-O": "I queenside castle to get my rook onto an open file. You might have heard that opposite side castling has an aggressive game to come.  Find out more about opposite side castling in 'The Art of Attack' by Keres and Kotov (a classic little book).  That book gives a fine discussion of opposite castling.",
        "13... Nc6": "Black begins to get his pieces involved...",
        "14. Bc4": "...and so do I. I should of actually tried to exchange the knight off though.",
        "14... Bg4": "Another simple developing move targeting my rook.",
        "15. Rd7": "Now i've placed my rook on the 7th row, which is quite a dangerous area.",
        "15... Rac8": "I just realised that Rd7 was a blunder as Bxd7. Fortunately swindon missed this.",
        "16. Rd2": "Just moving my rook to safety. Hopefully i will be able to exchange of that pesky Bishop on g4.",
        "16... b6": "b6!? I don't really see how this helps black hmmmm....",
        "17. h3": "Adding pressure to that annoying bishop-go away!",
        "17... Bf5 18. g4": "Rhd1 loses the h3 pawn, so i added more pressure to the bishop.",
        "18... Be4": "Now pointlessly attacking my rook, but removing defense from h3.",
        "19. Re1": "Threatening to kill the Bishop now.",
        "19... Bf3 20. Re3": "Again, trying to get it away. Overall, I feel white has a much nicer position, Two developed bishops, Two rooks in the center-one on an open file, and a much more advanced pawn structure.",
        "20... Bh1": "I guess anywhere else the Bishop went, it would die.",
        "21. f5 g6 22. f6": "f6! removing the king's g7 escape square.",
        "22... Rce8": "Pinning the pawn on e5.",
        "23. Bb5": "I guess i am going to have to coin a new word here. I have COUNTER-PINNED you might say (the knight to the rook).",
        "23... Re6 24. Rd7": "Rd7-a dangerous looking move.",
        "24... Rfe8 25. Bxc6 Bxc6 26. Rxc7 Bd5 27. Rxa7": "Simple picking off the pawns.",
        "27... Rd8": "A 'mysterious rook move', but why not Bxa2 ?",
        "28. Ra6 b5 29. Rxe6": "I think an exchange of rooks is good here as i am 3 points up and gets rid of threat on e5.",
        "29... fxe6 30. Rd3": "Pinning the bishop to the rook.",
        "30... Ra8": "Rook escapes the pin to target a2.",
        "31. a3 Ra4": "Ra4!? Is there a meaning to this? A better move would have been Kf7! stopping my passed pawns.",
        "32. Rd4 Bg2 33. Rxa4 bxa4": "In the end game, swindon should have tried to avoid an exchange when he was 3 pawns down...",
        "34. h4 h6 35. h5 gxh5": "gxh5? Better would have been g5! Blocks the pawns from promotion.",
        "36. gxh5 Bf3 37. Bd2 Bxh5 38. Bxh6 Kh7 39. Bf4 Kg6 40. b3 axb3 41. cxb3": "Better move for black would have been Kf5! ",
        "41... Be2 42. Kc2 Ba6 43. b4 Bb5 44. Kb3 Kh5": "Here i should have played f7, but i didn't realise this at the time.",
        "45. a4 Be8 46. b5 Kg4 47. Bc1 Kf5 48. Bb2 Ke4 49. Kb4 Kd5 50. a5 Bf7 51. b6 Kc6 52. Bc3 Be8 53. Kc4 Bf7 54. Bd4 Be8 55. a6": "Here i won with an unstoppable promotion."
    },
    "url": "https://gameknot.com/annotation.pl/petroff-defense?gm=23232",
    "gameName": "Petroff Defense",
    "players": "hugomason (1193) vs. swindon (1195)",
    "opening": "Petrov (C42), Damiano variation"
}