{
    "moves": {
        "1. e4": "the_k_lags is one of the co-captains of my team and we periodically play some matches against each other for fun.  Welcome any and all comments to help us improve together.",
        "1... e5 2. Nf3 Nf6": "I prefer playing Petrov to the other defenses, and since I dislike the Ruy Lopez, this line prevents it.",
        "3. d4": "And now we've gone modern attack.  This move starts things off with a bang.  Black has a few responses: Nxe4, exd4, and d6 being my favorite.  I don't like d6, since it allows White to get some pawns deep into my territory.  exd4 isn't bad at all, but I like the tactical options of Nxe4 best.",
        "3... Nxe4": "This move strikes first blood for Black.  To regain parity White has several options, dictating the flow of the remainder of the game.",
        "4. Bd3": "Good choice.  Developing the LSB, making space for a castle, and threatening the knight at e4.  Any time you can accomplish three things in one move, it's a good one.",
        "4... d5": "Seeking to preserve my knight's post, I'm not ready to give that spot up yet.  It can't be threatened by a pawn until White moves his knight at f3...",
        "5. Nxe5": "and here we are.  Regaining pawn parity, White now has a projection of power on his own and can play f3 at some point to shoo away my knight.",
        "5... Nd7": "Threatening his posted knight and developing a piece at the same time.  As a general rule of thumb in early development, try not to move your power pieces more than you have to, and get your main pieces into play.  If you can do multiple things at once, go for it.\n\nSome might consider Bd6 here, in mirrored play.  I'm not as much a fan of that line and symmetrical play tends to be more boring.",
        "6. Nxd7": "Exchanging knights.",
        "6... Bxd7": "As another general rule of thumb, don't get caught up in moving your queen early if you don't have to.  Better here to take with the LSB vice queen.",
        "7. O-O": "Getting the king to protection is of high priority in early development.  Additional options include bringing the knight into action on Nd2 or Nc3, though I prefer the castle more.",
        "7... Bd6": "Time to get ready for my own castle.  Centralization of the DSB also projects good power on White's kingside.",
        "8. c4": "A strong play by White.  It threatens the protector for my knight and provides additional mobility options for his queen.  I can no longer castle immediately and must see to my defense.",
        "8... c6 9. Nc3": "This move is the best White can make.  White is closer to finishing his development.  At first blush another strong consideration would be pushing the pawn to c5, however, I don't think that helps much, as it allows me to retreat my bishop to c7, making an easy match up for a queen/bishop diagonal.",
        "9... O-O": "And now Black finishes his development, not terribly concerned with the c4 pawn threat, as there are several options to regain pawn parity.",
        "10. cxd5": "Making a go of the center.  ",
        "10... Nxc3": "In this context, the only two options to consider are Nxc3 and cxd5.  cxd5 isn't bad, I just like the lines in the move I played more.",
        "11. bxc3 cxd5": "Now the game begins in earnest.  By my reckoning, we are close in position/points.  My isolated central pawn will become a victim soon if White wants it, but White will normally lose the c pawn in a few more moves...",
        "12. Qh5": "Good attack by White's queen, immediately going after my d pawn.",
        "12... g6": "I thought long and hard about playing f5 instead.  This position won out on personal whim.  Notice if I don't move one of my kingside pawns 13. Qxh7#",
        "13. Qxd5 Qc7": "The only move worth considering... While Bc6 appears decent, if you do that you lose the chance to easily regain the pawn at c3.  Notice also that I have a chance to take Qxh2+ and effectively threaten two of White's pawns, if I can dislodge his queen.",
        "14. Bh6": "Great positional move, completing White's development.  The middle game awaits!",
        "14... Rfe8": "Allowing a space for my bishop to come and defend with on f8 as/if needed, also placing my rook on the open file.",
        "15. Rfe1": "Good move by White, maintaining parity across the board.  This is a great game so far.",
        "15... Bxh2+": "Regaining pawn parity.",
        "16. Kh1 Bd6": "Coming back home after a night out eating pawns...",
        "17. Rab1": "This move was a mistake and I didn't see it.   17. Rab1 Rxe1+ 18. Rxe1 Qxc3 would have won the pawn at c3.  Another move worthy of consideration is Bb5, looking for a bishop exchange.  White has two passed pawns which are a priority for me to something about.  If White can exchange pieces, he should have more options for getting one of those two pawns downrange for promotion.",
        "17... b6": "Protects the pawn but a missed opportunity.",
        "18. Bc4": "I honestly expected White to play c4 here, but as soon as this was played I smelled blunder.  This move would allow me to trade a bishop for a rook.",
        "18... Be6": "Note that White's LSB is now lost, forcing 19. Rxe6.",
        "19. Qb5": "This move surprised me.  If I had been playing speed chess I might have lost here.  Note that if 19 ... Bxc4 ?? it's a blunder mate (2).  That said, Qxc4 is still winning.  Because White didn't analyze the position carefully, they lost on a chance to stop the bleeding with 19. Rx36.",
        "19... Qxc4 20. Qg5": "If I were White I would made the queen trade.  While you're down a piece, yes, and it IS harder to come back once you start losing pieces, I'd rather trade and keep the c pawn.  Perhaps White is sniffing mate in 2?",
        "20... Qxc3 21. Qf6 Bf8": "And mate is averted.  Now White is in serious trouble.  Failing to trade Rook for Bishop is starting to look worse, as the final center pawn will almost certainly fall soon.  If White retreats with the bishop, Bg7 by Black wins d4.",
        "22. Rbc1": "Seeking to generate some momentum.  If White can get his rook to c7, it can lay some serious consequences for my king.",
        "22... Qb4": "pairing up with the DSB for added defense.",
        "23. Bf4": "I would have traded bishops... This new mistake opens the ground for some good counterplay by Black.",
        "23... Bg7 24. Qg5 Qxd4": "keeping the bishop and queen connected...",
        "25. Be3 Qd5": "offering the queen trade and threatening the a pawn at the same time.  Remember 2-for-1 moves are almost always the best!",
        "26. Qf4": "White needs his queen to mount a comeback is likely the thought on his mind.  Sometimes you need to trade down to prevent more abuse.  White is basically in that position.  However, there are always games where someone makes a mistake and you're glad you didn't trade.  White is starting to run out of options.",
        "26... Be5": "laying groundwork for projection of force against White's weakened Kingside.  It also prevents any incursions onto my 7th rank by White's rook.",
        "27. Qh4": "A tough position for White.  With my pair of bishops, I am close to being able to pin White's queen... maybe with a little work I can get it cheaply.  To succeed at that I need to keep her boxed in while I get a rook to c4.",
        "27... Rac8": "I am looking ahead to a change to split White's king/queen if possible, and get a mating net set up, or at least seriously compromise White's defenses.",
        "28. a4": "Seeking to protect his a pawn from the predation of my queen.",
        "28... Rxc1": "Trading down to limit White's comeback potential.",
        "29. Rxc1 Rc8": "offering a further trade...",
        "30. Re1 Rc4": "Now the moment of truth... This move wins the a4 pawn at a minimum, and has potential for much more depending upon White's response.  This is my attempt to go after White's queen on the cheap.",
        "31. Qg5": "A costly blunder.",
        "31... Rg4": "Threatening 32... Qxg2#.  White's beginning play was brilliant, inspired even.  Compounding errors in moves 18-19 compromised his position in a way that ultimately spelled his doom.  Thank you for the comments and votes."
    },
    "url": "https://gameknot.com/annotation.pl/petrov-modern-attack?gm=60389",
    "gameName": "Petrov, Modern attack",
    "players": "the_k_lags (1698) vs. evilgm (1899)",
    "opening": "Petrov (C43), modern attack, Trifunovic variation"
}