{
    "moves": {
        "1. e4 e5 2. Nf3 d6": "My opponent has played this a number of times...",
        "3. Bc4": "And I usually develop the Bishop instead of playing 3.d4. It's a perfectly good alternative.",
        "3... h6": "Especially when my rather defensively minded opponent allows me the luxury of what almost amounts to an extra move.",
        "4. d4": "The game develops in fairly standard way, with both sides getting pieces into play. Somehow, despite the early innacuracy, my opponent doesn't suffer too many consequences. Maybe I should have been more aggressive.",
        "4... exd4 5. Nxd4 Nf6 6. Nc3 Nc6 7. O-O": "I could exchange and double Black's pawns, something that happens in the Scotch opening, but I have a tendency to leave castling too late, and decide to get my King to safety now.",
        "7... Be7 8. h3": "Just to guard againt an intrusion by the Bishop or Knight. ",
        "8... O-O 9. Re1 Ne5": "Attacking my undefended Bishop, which now has to make a choice: to stay on the diagonal againt the King, or retreat?",
        "10. Bf1": "I don't want to lose it and leave Black with the two Bishops, and this seems about the safest place.",
        "10... Nh7": "Getting ready for an f-pawn advance, something that looks a little dubious.",
        "11. Nf3 Nxf3+": "Black wants to exchange his centrally place Knight, so I'm happy to oblige.",
        "12. Qxf3": "Looking at the board now, despite that early and unnecessary h-pawn advance, Black doesn't have a bad position at all; I have a bit more space, but those two Bishops have a couple of decent diagonals to play with, while mine has scurried home.",
        "12... f5": "I thought that f-pawn advance looked dubious, and it is. Better was developing the dark-squared Bishop, which can find a nice home on e5, via f6. Now I could go on the attack, as the computer suggests , with 13.Bd3, and suddenly that f-pawn is looking frail. Instead I decide to exploit the opened diagonal against the King.",
        "13. Nd5": "I also have the possibility of getting rid of one of Black's Bishops.",
        "13... Bg5": "If he's going to give it up, it will be for a Bishop, not a Knight. But this doesn't really interfere with my plan...",
        "14. Qb3": "Attacking the b-pawn and keeping the light-squared Bishop at home to defend it, and threatening a nasty discovered check.",
        "14... Kh8": "The Black King wisely steps out of the way.",
        "15. Bxg5": "I'm allowing the Knight back into the game, but I miss the computer's rather convoluted advantage... 15. exf5 Rxf5 16. Bxg5 Nxg5 17. Nxc7 Qxc7 18. Re8+ Kh7 19. Bd3",
        "15... Nxg5 16. Nf4": "Threatening a horrible fork on g6.",
        "16... Rf6": "Black guards against it, but it's better done with the Queen, getting both Queen and Rook on the same file.",
        "17. exf5": "Drawing out that Bishop from c8 - Black won't want to allow the check on g6. It means the Bishop will be attacking my c-pawn, but he will lose the b-pawn inexchange...",
        "17... Bxf5 18. Qxb7 Bxc2 19. Nd5": "Now I feel I have Black on the run, attacking the c-pawn twice. And his Bishop has opened the file against it as well.",
        "19... Rf7": "Black is on the defensive.",
        "20. Rac1": "Once I get rid of the Bishop, I have three pieces on that weak c-pawn. However, I've missed the reply. Chess is often about momentum, and at present I have it. Better to continue with 20.Qc6, which wins the weak pawn: 20...Bf5 21.f4 Bd7 22.Qxc7",
        "20... c5": "Black has neatly turned the tables, and now, threatening my Queen, I'm the one on the back foot.",
        "21. Re7 Rxe7": "It also allows him to exchange a couple of pieces, rather neutralising my attack and heading into the phase of the game he's better at...",
        "22. Qxe7 Qxe7 23. Nxe7 Be4": "One of those hard-to assess (for me) positions. But I probably do have it slightly better, despite those connected pawns in the centre; that a-pawn on a7 is going to be hard to defend.",
        "24. Bb5": "I start by trying to get the Rook away from it. Not a bad idea, and certainly not an error, but probably not the best plan...",
        "24... Rb8 25. a4 a6 26. Bxa6": "Now I win the a-pawn and give up my b-pawn. I've now got a passed pawn and a Bishop that covers the Queening square. Great. But the exchange has allowed Black two passed pawns, something that is going to prove a problem later.",
        "26... Rxb2 27. Bc4": "At the moment, though, those pawns aren't going anywhere.",
        "27... Rb4": "Black counters by threatening both Bishop and pawn.",
        "28. a5": "I get the pawn out of the way; the Bishop is already defended. However, once again I have lost momentum. A threat, and I think about defending the threat. Better to keep the momentum going with counter-attacks on Black's pieces - 28.h4, followed by 29.f3. Not a serious problem, but once again Black is seizing the initiative.",
        "28... Rb7 29. Nd5": "Black gets his Rook in front of my passed pawn.",
        "29... Ra7 30. Ra1": "And I get my Rook behin d it, which is how it's supposed to be!",
        "30... Nh7": "The computer prefers the exchange before this move, for some reason. Instead, it follows...",
        "31. f3 Bxd5 32. Bxd5": "I feel happy with the position; the Black central pawns are blocked and I have the right colour Bishop to cover the Queening square. Surely it's just a  matter of technique now?",
        "32... Nf6 33. Bc6": "Obviously I don't want to lose or exchange the Bishop.",
        "33... Kg8": "The King must lose no time in getting across the board.",
        "34. a6": "And I must push that pawn whenever I can, especially if it means placing it on a white square...",
        "34... Kf8 35. Bb7": "Where it can be covered by the Bishop. The Rook is out of play for now!",
        "35... Ke7 36. Rb1": "Getting ready to go to b7, force an exchange of Rooks, Queen the pawn etc. Ha.",
        "36... c4": "Black strikes out with his own passed pawns.",
        "37. Kf2": "I decided it might be prudent to get my King off the back row, in case there's a point where both pawns Queen. Rather negative thinking, given my position.",
        "37... Ne8": "This actually gives me a chance, with 38.Bc6, which, though it gives up the pawn, there follows 38...Rxa6 39.Re1+ and the Knight falls. But I didn't see that, so focussed was I on Queening that pawn!",
        "38. Bc8": "Instead, I go the other way, geeting ready to force an exchange of Rooks with 39.Rb7+",
        "38... Nc7": "Black really ought to have pushed his pawn. 38… c3 39. Ke3 c2 40. Rc1 Nc7 41. Rxc2 Kd8 and both pawns fall. With this move, I still have a chance.",
        "39. Rb7 Rxb7 40. axb7": "Eh? When I look back at this move I wonder what I was thinking. Did I just think it advanced the pawn to the 7th? Clearly, the Rook must be taken by the Bishop, so it's still covering the Queening square, and Black will be forced to give up the Knight for the resulting Queen. Then, I would have a Bishop to help stop Black's passed pawns, and a pawn majority on the K-side. It probably, might, have been enough to win. This way, it all goes awry. I later wondered how Black managed to get a draw, and the answer is probably here.",
        "40... Na6": "Now Black covers the Queening square and there's not much I can do about it with those pawns advancing.",
        "41. Ke3": "My King can at least block them...",
        "41... d5 42. Kd4 Kd6 43. f4": "And I still have that pawn majority to play with. Hopefully I can lure the King away to the K-side, win the Black pawns and head to b7 with my King.",
        "43... Nb8 44. g4 Nc6+": "Crafty; the Knight isn't confined to covering the Queening square. It can help drive my King back.",
        "45. Kc3 Kc5": "Once again, I have lost momentum and am being driven back. I wonder now if Black had a win here? The computer says not, but Black advances those pawns most skilfully...",
        "46. g5 d4+ 47. Kd2 hxg5 48. fxg5 Kd5": "Then he gets worried about my pawn majority, instead of pushing me further back with 48...c3+",
        "49. h4 Kd6 50. h5 Ke7": "Black reasons that since my King can't do anything about the pawns, he can get rid of that majority.",
        "51. h6 gxh6 52. gxh6 Kf6 53. h7 Kg7 54. Be6 c3+ 55. Kd3 Kxh7": "And he can! But I still get pawns too.",
        "56. Bf5+ Kg7 57. Be4 Nb8 58. Kxd4 Kf7 59. Kxc3 Ke7": "Still, his King has enough time to scurry back to my remaining pawn, hovering on the brink.",
        "60. Kb4 Kd6 61. Kb5 Kc7 62. Bf3 Nd7 63. Ka6": "However much I shuffle pieces, unless Black drops a real clanger, it's drawn.",
        "63... Kb8 64. Kb5 Ne5 65. Bc6": "Hoping for 65...Nxc6?? 66.Kxc6 Ka7 67.Kc7 winning.",
        "65... Kc7": "Nope.",
        "66. Bd5 Kb8 67. Kb6 Nd3 68. Kb5 Nf4 69. Bc6 Ne6": "Here I ceased scurrying about and accepted the draw."
    },
    "url": "https://gameknot.com/annotation.pl/philidors-defence?gm=65647",
    "gameName": "Philidor's Defence",
    "players": "feathered_tiger (1812) vs. metcalfe (1790)",
    "opening": "Philidor (C41), Steinitz variation"
}