{
    "moves": {
        "1. e4": "This is a fast blitz game played played against a player 200 points above me.",
        "1... c5": "I see the c5 opening often among people ranked 1500 to 1900, but I don't think it offers any great advantage over other openings.",
        "2. Nf3 d6 3. Nc3": "Protecting the white e4 pawn in case black pulls out a knight.",
        "3... Nc6 4. Be2": "Getting ready to castle. As they say, \"castle early, castle often\".",
        "4... Nf6": "What did I tell you about black pulling out a knight?",
        "5. O-O": "What's that rule about castling before embarking on any major attacks?",
        "5... e6": "Now both of black's bishops are blocked.",
        "6. d3": "Now one of my bishops is blocked.",
        "6... Be7 7. a3": "Moving the a pawn out to discourage that knight on c6 from getting any strange ideas.",
        "7... a6 8. Bd2 O-O": "With black clearing out the minor kingside pieces and advancing the queenside pawns, I figured black would castle soon.",
        "9. Rb1 b5": "Here comes trouble.",
        "10. b4": "Offering a pawn exchange so I can get my rook out.",
        "10... Qb6": "Now if I can just clear out both pawns on the b file, the rook gets to scare the queen away and take control over an open file. This will require moving some pawns and minor pieces into position first.",
        "11. Be3": "This is actually a dangers move for me. Black could eventually bring a pawn to the d4 square and fork the bishop and knight if I am not careful. However, I'm aware of the possibility, so if I see black moving towards that, I'll move either the knight or bishop to safety first.",
        "11... d5 12. exd5 Nxd5": "I guess black wasn't thinking of the d4 pawn fork after all.",
        "13. Nxd5 exd5 14. c3 Be6 15. d4": "Will black take the d4 pawn or push forward to occupy c4 with a doubly-supported pawn?",
        "15... c4": "Black chose occupation over capture here.",
        "16. Ng5": "If Bxg5, then Bx65 and my bishop is in position to disrupt black's kingside pawns.  Otherwise, the knight could take the bishop on e6 and leave a temporarily unprotected pawn on c6. With most of black's pawns on light squares, and me having a light square bishop, I might be able to pick off those pawns later.  On the downside, taking out black's bishop gives black's rook control over a half-open file.",
        "16... Bf5": "Black moves bishop out of harm's way and where it can harm my rook.",
        "17. Rc1": "Move rook to safe square.",
        "17... a5 18. Bg4": "Time to frighten the bishop away.",
        "18... Bg6 19. Bh5": "With white's bishop retreating to protect kingside pawns, let's see if I can entice it to take out my bishop. Then my queen moves forward with a threat of checkmate on h7.",
        "19... axb4": "Looks like black is not taking the bait, but wants to clear the a file for the rook.",
        "20. axb4 Ra3 21. Bxg6": "Fine, if somebody has to take a bishop, I'll do it.",
        "21... fxg6 22. Qg4": "Moving queen forward to where it can get to e6 and put black king in check. After that and some knight moves, I smell checkmate.",
        "22... Bf6 23. Qe6+": "Here we go! Right now, I can either force black into checkmate or to lose a rook and then get checkmated. If black moves the rook to block the queen, then the queen just takes it and puts black in check again. One move later, the white queen goes to e8 and wins.",
        "23... Kh8 24. Nf7+": "Black can sacrifice the rook now to stay alive. If the rook takes the knight, the queen takes the rook. That gives black tempo for one move to pull the queen or rook to protect the back row. After that, white can pick off the d5 pawn. Black is weakened, but lives. If black doesn't take the knight this move, then I can use Philidor's Attack over then next 3 moves to win.",
        "24... Kg8": "Wrong move! By now, white can do a series of moves where black has only response to each move and the the inevitable result is checkmate.",
        "25. Nh6+": "Double check to move the king to the corner.",
        "25... Kh8 26. Qg8+": "Sacrifice the queen so black moves the rook over to corner the king.",
        "26... Rxg8 27. Nf7#": "And the knight wins!"
    },
    "url": "https://gameknot.com/annotation.pl/philidors-attack?gm=39733",
    "gameName": "Philidor's Attack",
    "players": "rich_sposato  vs. malevokun ",
    "opening": "Sicilian (B50)"
}