{
    "moves": {
        "1. Nf3": "The Reti Opening. My first thoughts were 'Well, it looks like I'll be learning how to play against this opening'. I have only played this opening once, a long time ago.",
        "1... d5 2. c4": "The usual follow-up for the Reti.",
        "2... dxc4": "I capture. Is the Reti a kind of temporary gambit?",
        "3. Nc3": "Why is e4 rarely played at this point? It develops a central pawn and lets the LSB attack the pawn on c4.",
        "3... Nc6": "I try to catch up in development, as well as contest e5 so my e-pawn can move there.",
        "4. e4": "White grabs some of the centre.",
        "4... e5 5. Bxc4": "We are now equal in material again, with white having a positional edge.",
        "5... Bc5": "Developing my DSB.",
        "6. O-O": "Castling and removing his king from possible danger later on.",
        "6... Nf6": "White is still ahead in development, but the pawns on d2 and b2 are going to hinder the development of his DSB slightly.",
        "7. a3": "I don't really know why this was played. I guess to prevent Bb4, but I wouldn't threaten his knight with my bishop while it's defended.",
        "7... O-O": "I castle. Our levels of piece development are now equal.",
        "8. d3": "White clears up space for his DSB.",
        "8... Bg4": "I pin White's knight, completing my minor piece development. The White Queen is also somewhat restricted in that I get to open up White's kingside if the queen quits the defence of the knight.",
        "9. h3": "Kicking the LSB.",
        "9... Bh5 10. Bg5": "Pinning the knight.",
        "10... h6 11. Bxf6": "He takes the knight, allowing me to develop my queen.",
        "11... Qxf6": "Adding pressure to the knight on f3.",
        "12. Nd5": "Threatening my queen.",
        "12... Qd8": "Moving back to my original square.",
        "13. Qb3": "?! This may be threatening the pawn on b7, but it allows me to mess up White's kingside with Bxf3.",
        "13... Bxf3 14. gxf3": "Now I can begin to pressure White's kingside.",
        "14... Qg5+": "Check, while developing my queen again.",
        "15. Kh2": "Hmm... Would Kh1 have been better?",
        "15... Nd4": "Forking the queen and pawn on f3 while getting my knight closer to the action.",
        "16. Qd1": "Defending the pawn on f3.",
        "16... Qd2": "! A decoy/temporary sacrifice, which wins a pawn at worst.",
        "17. Qxd2": "As you can see, I am behind in material by a queen. I'll regain it pretty quickly, though.",
        "17... Nxf3+": "Taking a pawn with check. White is forced to give up his queen advantage.",
        "18. Kg3 Nxd2": "Taking the queen while threatening the rook. ",
        "19. Rfd1": "Best, because 19. Nxc7 Nxf1+ 20. Rxf1 Rac8.",
        "19... Nxc4": "Exchanging while ahead.",
        "20. dxc4": "The anticipated capture.",
        "20... c6": "Threatening the knight.",
        "21. Nc7": "?? This allows me to trap the knight with Rac8.",
        "21... Rac8 22. Rd7": "Protecting the knight. I initially overlooked this, but then realised that White is trading while behind.",
        "22... Rfd8": "Offering a trade.",
        "23. Rxd8+": "White didn't really have much choice: he loses the inight anyway.",
        "23... Rxd8": "The knight is no longer threatened, but it is still trapped.",
        "24. b4": "Threatening my DSB.",
        "24... Bd4": "Threatening the rook.",
        "25. b5": "?? White overlooked the threat on his rook.",
        "25... Bxa1 26. f4": "Offering another trade, which I will gladly accept, especially as it comes with check.",
        "26... exf4+ 27. Kxf4 Rc8": "Faced once again with the loss of his knight and with a large material disadvantage, White resigns here. Good game atom842."
    },
    "url": "https://gameknot.com/annotation.pl/pi-day-group-c?gm=58971",
    "gameName": "Pi Day Group C",
    "players": "atom842 (1314) vs. reubencpiplupyay (1267)",
    "opening": "Reti accepted (A09)"
}