{
    "moves": {
        "1. d4 d5 2. Bf4 Nf6 3. Nf3 e6 4. Nbd2 c5 5. c3 Nc6 6. e3 Be7": "A normal and quiet approach to the London by black. ",
        "7. Ne5": "Better was NxNc6, then this N will press on the c6 pawn, with the Q. Nothing that black can't parry, but still forcing. ",
        "7... O-O 8. Nxc6": "I hope in the other N to create pressure on e5... if it can get there!",
        "8... bxc6 9. Qa4 Qb6 10. Rb1": "No queenside castling this time. ",
        "10... cxd4 11. exd4 c5 12. Nf3 Bd7 13. Qb3": "The Q's exchange is not good or bad. But I am not taking any advantage of it. ",
        "13... c4": "This closes the center for black, and this is handable...",
        "14. Qxb6 axb6 15. a3": "Now black only has a sac to penetrate my queenside. I have to solve the lsb's developement, though. ",
        "15... Ba4 16. Be2": "Wonderful. My lsb for his.",
        "16... Bc2 17. Rc1 Be4 18. O-O": "With some manouver, I can force the Blsb back, opening the king's position. ",
        "18... h6 19. Ne5 Rac8 20. f3 Bh7 21. g4": "Launching the pawn's storm. Without the Qs and the queenside closed, it looks as a good attacking prospect. ",
        "21... g5 22. Bg3 Rfd8 23. h4": "The more black pushes his pawns, quicker will be my attack. ",
        "23... Ne8 24. hxg5": "I had to \"demonstrate\" my attack is sound, even by opening my K or sac some pawns. ",
        "24... hxg5": "Bxg5 only invites f4. ",
        "25. Kg2": "f4 would have been the right, I think. This is necessary but too slow. Moreover, I didn't see the threat: my N is trapped!",
        "25... f6": "I have to play with piece less. So let's take all I can from it. ",
        "26. Rfh1 fxe5 27. Rh6": "I don't care about retaking the pawn. I have to press his K. ",
        "27... Kg7 28. Rch1 Bg6": "! Very nice. If Rh8, he can move the N and exchange them, and I'll be busted. ",
        "29. dxe5": "Bxe5+ would have only helped him to unravel his pieces.  ",
        "29... Bc5": "My attack is now stalled! ",
        "30. f4": "Well, go on attacking! Nothing more left but a slow death. ",
        "30... Be3": "Nice, too. Black has so many moves...",
        "31. f5": "Open, open, open!",
        "31... exf5 32. gxf5 Bxf5 33. e6": "This pawn can become a headache for black... maybe...",
        "33... d4": "This game is lost...",
        "34. Be5+": "But let's go on with some nice moves...",
        "34... Kf8 35. Rh6h8+ Ke7 36. Rf1": "If Kxe6, there is nothing left for white. ",
        "36... Bxe6": "A little fear... and black returns the mistake losing a piece. Can you see it?",
        "37. Rh7+ Bf7 38. Rfxf7+": "Now white is only a pawn down, but not winning by any means!",
        "38... Ke6 39. Rfe7+ Kd5": "I can't exchange... but what else?",
        "40. Bf3+": "Oh, yes! This! :-)",
        "40... Kc5": "I lost here the chance to play Bxd4++, Bxd4, cxd4+. Not sure it was really good.",
        "41. cxd4+ Bxd4 42. Bxd4+ Kxd4": "The only weak piece on black's side is the N, but I have no chance to win it... or do I? Can you figure a plan to snap a piece here?",
        "43. Bb7": "Let's see if black falls in the trap...",
        "43... Rc5": "YES! He did. Now...",
        "44. Red7+": "Black now has to take. ",
        "44... Rxd7 45. Rxd7+": "...and wherever the BK goes, a Rcheck will win the N!",
        "45... Ke3 46. Re7+ Kd2 47. Rxe8": "Well, this is blitz. You lose pieces as flys.",
        "47... Rb5": "...but black is no dummy (about 1760) and attacks my pawns. From here on, the game loses interest. ",
        "48. Rg8": "Exchanging pawns. ",
        "48... Rxb2 49. Rxg5": "?? fatal mstake!",
        "49... c3": "...and black wins again, despite the piece. I had to play Be4, preparing to exchang it for the pawn and... see if I can hold. ",
        "50. Rd5+": "Keep checking, and see how black gets out of this. ",
        "50... Ke3+ 51. Kg3": "Preventing BK's escape route via f4. ",
        "51... c2 52. Re5+ Kd2 53. Rd5+ Kc3": "...the b3 pawn is my killer. ",
        "54. Rd8": "Now, if BQueens, I'll have to hold with Bxc2, and play again in disadvantage!",
        "54... Kb3": "Rd3 was the move here. ",
        "55. Bd5+ Kxa3 56. Ra8+ Kb4 57. Rc8 b5 58. Kf3 Rb3+": "If BxR, I'll lose the R with the c pawn, and then I'll lose because my K can't reach the opposition. ",
        "59. Ke2 Rc3": "Game lost. Still, interesting fight and piece snapping. ",
        "60. Kd2 c1=Q+": ""
    },
    "url": "https://gameknot.com/annotation.pl/piece-snapping?gm=60056",
    "gameName": "Piece snapping",
    "players": "damalfi  vs. russian cappuccino ",
    "opening": "Queen's pawn, Mason variation (D00)"
}