{
    "moves": {
        "1. e4 c5 2. c3 Nf6 3. e5": "Je n'avais pas suspecté ce coup, pourtant simple, qui me met déjà sur la défensive.  Nc6 aurait peut-être été mieux pour empêcher cette poussée de pion.",
        "3... Nd5 4. d4": "Voilà la grande diagonale, ce qui sera dure à contrer.",
        "4... e6 5. Nf3 h6": "Je ne veux pas laisser g5 de disponible pour son cavalier ou son fou.",
        "6. Bd3 a6 7. Be4 Nb6 8. O-O Be7 9. b3 d6": "Ici, je voulais essayer de provoquer un échange de pion afin de diminuer l'effet de cette diagonale de pions.",
        "10. Be3": "Malheureusement pour moi, l'échange n'a pas eu lieu et le fou en e3 apporte un bon soutient à son attaque éventuelle.  Ça commence à chauffer pour moi.",
        "10... O-O 11. exd6": "Ce coup me fait réaliser que je suis perdant au change.  Si Bxd6, dxc5 et je perd une grosse pièce.  Même chose pour Qxd6.  À ce stade ci, je décide de concéder 2 pions plutôt qu'une grosse pièce, en retirant mon fou.  Peut-être y avait-il un meilleur coup?",
        "11... Bf6 12. dxc5": "Voilà, l'adversaire a pris ces 2 pions et me force à retirer mon cavalier.",
        "12... Nb6d7 13. Qc2 Nc6 14. a3 a5 15. Nbd2 Nce5 16. h3 Rb8 17. b4 Re8 18. b5 Nxc5": "Un autre sacrifice, les pions sont maintenant trop nombreux et près du but.",
        "19. Bxc5 b6 20. Nxe5 Bxe5 21. Be3 Qxd6 22. Nc4 Qc7 23. Bc6": "Excellent coup de mon adversaire.  En plus d'attaquer ma tour, le fou bloque la ligne de ma reine.",
        "23... Re7 24. Rad1 f5": "Je dois ouvrir une porte.",
        "25. Nxe5 Qxe5 26. Rd8+ Kh7 27. Bxb6 Rxb6 28. Rxc8 Ra7 29. c4 Qc5 30. Bd7 Qe5 31. c5": "Après ce coup, je considère la partie terminée.  Je continue quelques coups pour la forme.",
        "31... Rxd7 32. cxb6 Rb7 33. Qc6 Rb8 34. Rxb8 Qxb8 35. Qc7": ""
    },
    "url": "https://gameknot.com/annotation.pl/pierre-vs-steve?gm=28469",
    "gameName": "Pierre vs Steve",
    "players": "pliko (1837) vs. dragoneye (1465)",
    "opening": "Sicilian (B22), 2.c3, Heidenfeld variation"
}