{
    "moves": {
        "1. e4 c5": "Team Match, I'm playing black, and I opt for the Sicilian. This is now my second longest game on GameKnot. Along the way it feels as if black just claims little advantage after little advantage, piling them on, until the pile is overwhelming, but white doesn't let black get any easy checkmates until he runs out of defenders.",
        "2. Bc4 Nf6": "White played the uncommon Bowlder Attack (2. Bc4). Standard for black is 2. ... e6 but black defers that for a developing move with a shot at the e4 pawn.",
        "3. Nc3 e6": "Back to the main line.",
        "4. d4 cxd4": "Black's strongest option, according to what little I find about the Bowlder Attack, is to get an early pawn on d5 to attack the white bishop with tempo. But I found that now, when annotating, not during the game. So maybe black's 4th move isn't the best line, bringing out white's queen and making d5 a difficult square for black to occupy. First advantage in the pile.",
        "5. Qxd4 Nc6": "Developing with an attack, gaining a bit of tempo.",
        "6. Qd1 Bb4": "The classc pin. All the rage these days.",
        "7. Nge2 Nxe4": "I don't know if white's 7th move was intended as a gambit, but it loses the e4 pawn that was only defended by the (now pinned) knight on c3. Probably ought to put a ? on 7. Nge2?. And before a commenter might point out that it's unnecessary to indicate the \"g\" in that move, I'm only parroting what the GameKnot notation recorded. 7. Ne2? would be sufficient, but the automatic notation wizard inserted the unnecessary \"g\" so I did to, for consistency.",
        "8. a3 Nxc3": "Intending to trade lots of material here (to exploit black's material advantage) and in the process to destroy white's queenside pawn structure.",
        "9. bxc3 Bc5": "Objective partially achieved, though white declined to play 9. Nxc3 as I had hoped he would. Now white has doubled isolated pawns on the half-open c-file ripe for the picking, and his isolated a-pawn is only slightly less attainable. Second addition to the pile.",
        "10. O-O Qh4": "Threatening to begin a kingside build-up of force, but it's not the only thing this move threatens.",
        "11. Ng3 Qxc4": "White missed the second threat (really the first threat, I guess, since the lone queen wasn't much threat to white's castled position yet). I have to put a ? on 11. Ng3?. Adding to the pile.",
        "12. Bb2 O-O 13. Nh5 Ne5": "I'm not comfortable with the potential for white's queen, knight, and fianchettoed bishop to put pressure on the black's kingside with all the black pieces on the queenside. This move locks white's queen off of f3 and g4. Also, black is planning to fianchetto the LSB on b7 to aim at white's castle, so moving the slow knight to the kingside first puts it in range to quickly support an attack on white's king.",
        "14. h3 b5 15. Qd2 Qh4": "White's queen wants to play to g5, but black doesn't want her there. This move keeps the white queen at bay and adds more pressure on white's castle.",
        "16. Qe2 d6": "The black pawn on b5 is en prise from white's queen, but white's queen is defending the knight on h5 so she can't capture the pawn just yet.",
        "17. c4 Qxc4": "That's probably another ? for white with 17. c4?, moving the pawn to c4 where three black pieces can safely capture it. Then again, doubled and isolated on a half-open file, that pawn was doomed anyway. Black captures in such a way as to invite a queen exchange while threatening the c2 pawn, which limits white's replies. The black knight still locks the white queen off of f3 and g4. More on the pile.",
        "18. Qd2 Qh4": "White didn't want to exchange queens, and who could blame him? Now he's eyeballing g5 again. Black needs to prevent that.",
        "19. Nf4 Bb7": "Finally the fianchetto, though black had a much better move. White's 19. Nf4? needs a ? applied.",
        "20. Rae1 Nc4": "A fork black should have played last move.",
        "21. Qc3 Nxb2 22. Qxb2 Qxf4": "White's queen was doing double duty, defending the knight at f4 and the bishop at b2. One had to fall unavenged. Piling it on.",
        "23. Qxb5 Rab8": "Defends the bishop and threatens a discovered attack with Bxg2.",
        "24. Qd3 Qg5": "Threatens mate on g2 but even better, it forces the exchange of queens.",
        "25. g3 Qd5": "Mates on g2 and h1 cannot be stopped unless white removes black's queen.",
        "26. Qxd5 Bxd5 27. a4 Bc4": "White's pawn on a3 was en prise and needed saving, but 27. a4? gets another question mark since now white loses the exchange. 27. Ra1 would have held the pawn. The pile grows.",
        "28. Red1 Bxf1 29. Kxf1 Rb2": "Time to gobble some pawns and get both rooks into the action.",
        "30. Rd2 Ra2 31. Kg2 Rxa4": "Piling it on.",
        "32. h4 Rb8 33. Kh3 Rd4": "Care to exchange?",
        "34. Re2 a5": "What black really needs, up by rook, bishop, and two pawns, is a queen. Being up by queen, rook, bishop, and pawn would be much better.",
        "35. c3 Rc4 36. Ra2 Rxc3": "OK, I'll trade pawns three for one. Didn't think I would promote that isolated a-pawn anyway. Gobble.",
        "37. Rxa5 Bxf2": "Gobble. Piling it on.",
        "38. Kg2 Bxg3": "Gobble. Piling it on.",
        "39. Ra2 h5": "White defended the quick checkmate, prolonging the game a bit. Black's king is vulernable to a back rank checkmate, so this move, while wasting a tempo, frees black's rook on b8 to move freely about the cabin.",
        "40. Rd2 Rb4": "Aiming for 41. ... Rxh4 and 42. .. Rh2  leading to mate. The pawn on d6 can take one for the team.",
        "41. Rd1 Rb2+ 42. Kg1 Bf4": "Forces white to exchange his only remaining piece.",
        "43. Kf1 Rc1 44. Rxc1 Bxc1": "Nothing stands in black's way. The pile of advantages has grown immense, and white is out of defenders. This is where I announced checkmate in 8 and I started entering in conditional moves.",
        "45. Ke1 Bf4 46. Kd1 Rd2+": "Restricting white's mobility.",
        "47. Ke1 Kh7 48. Kf1 Kg6 49. Kg1 Kf5": "The black king wants to be there for the finale.",
        "50. Kh1 Kg4 51. Kg1 Kf3 52. Kf1 Rd1#": "Final position. It felt a little like running up the score, but white never seemed to cave along the way, unless I missed something spectacular. I often do, sometimes even if it's only barely spectacular."
    },
    "url": "https://gameknot.com/annotation.pl/piling-it-on?gm=22108",
    "gameName": "Piling It On",
    "players": "unicornn (1580) vs. blake84120 (1603)",
    "opening": "Sicilian defence (B20)"
}