{
    "moves": {
        "1. d4 e6 2. c4 b6 3. Nf3 Bb7 4. g3": "It's like a Queen's Indian Defense, just without Black bothering with the Nf6 move.",
        "4... Bb4+ 5. Bd2 Bxf3 6. exf3": "Don't mind this. A push to f4 reopens the diagonal and secures a grip on the e5 square.",
        "6... Qe7 7. a3": "Basically forces the exchange with Black's queen now at e7.",
        "7... Bxd2+ 8. Qxd2 Nf6 9. Nc3 O-O 10. Bg2 d5": "Before playing this move Black must have been waiting for the fianchetto development of White's LSB, which moves that piece's line of sight off of c4. However, Black might have been better served to play it sooner.",
        "11. f4": "Discovering a pin on Black's d-pawn, safeguarding White's c-pawn.",
        "11... Nbd7 12. O-O c6": "Black can now play dxc4 if he wants, but it's only an even trade (Bxc6)",
        "13. Rac1 Ne8 14. Rfe1 Qf6 15. Rc2": "Preparing to double the rooks on the c-file. The threat of cxd5 soon becomes something for Black to be concerned about.",
        "15... Nc7 16. Rec1 Rac8": "Finally breaking the menacing of this rook by White's bishop on the a8-h1 diagonal, but now Black loses a pawn.",
        "17. cxd5 exd5 18. Nxd5 Nxd5": "Black's c-pawn was pinned before this move, and remains pinned after.",
        "19. Bxd5 Nb8 20. Bg2": "Although this bishop was not under immediate duress, White decides to retreat it back to g2, in order to advance his d-pawn.",
        "20... Rfd8 21. d5": "Yes, that pawn on c6 is still pinned.",
        "21... Qd6": "Blockading the passed pawn.",
        "22. Qc3 c5": "Finally, the threats on the c-pawn become too much for Black, who is forced to advance it, creating a passed pawn for White.",
        "23. Qe5 Na6 24. Re2": "Beginning a transfer of the rooks from the c-file, where they have done great work, to the e-file, where they can create back rank issues for Black.",
        "24... Nc7 25. Rce1 h6": "With his knight maneuver, Black has the White d-pawn overmatched--it is attacked three times and only defended twice. But Black absolutely cannot yet take the pawn on account of 26. Qe8+, which would win at least the knight. So he clears room for his king.",
        "26. Qxd6": "White trades queens. As it turns out, the d-pawn really is weak, but White decides to trade it off for Black's a-pawn, which will also give White one rook on the seventh rank, and possibly two at some later point.",
        "26... Rxd6 27. Re2e7 a5": "Black tries to save the a-pawn first, but this move fails to a one-move tactic.",
        "28. Bh3": "Winning a piece. The rest of the game could do without comment. Honestly, I was hoping Black might resign here. The last 15 moves somewhat diminish the earlier ones.",
        "28... Nxd5 29. Bxc8 Nxe7 30. Rxe7 Rd1+ 31. Kg2 Rd8": "An optimistic view might have still given Black some chances on the queen side, but Black's 31st through 33rd moves betray any such optimism.",
        "32. Ba6 Rb8 33. Rb7 Rxb7 34. Bxb7": "Black's chances go from slim before to none now.",
        "34... Kf8 35. Ba6 Ke7 36. a4 Kd6 37. Bc4 f6 38. Kf3 f5 39. Ke3 Ke7 40. Kd3 Kf6 41. Bg8 Kg6 42. Kc4": "Black resigns here. Black realizes the planned continuation 42... Kh5 is hopeless as White will just play either 43. f3 or 43. h3."
    },
    "url": "https://gameknot.com/annotation.pl/pins-and-pawns?gm=48235",
    "gameName": "Pins and Pawns",
    "players": "hscer (1765) vs. Black (1612)",
    "opening": "Queen's pawn (A40), Keres defence"
}