{
    "moves": {
        "1. c4": "my old favourite, maybe the one I know best. Are you the same if I say that, though it is my favourite, I feel unconfident to play it against better players. I feel pretty sure that they will find ways to distress me in it. The first move is always a plague for me, whatever side I play, white or black. c4? d4? Nf3? and what against e4? Shall I play a sicilian or try the Petrov? What against the e4 e5 f4 thing?  Sometimes, I wonder how far I have been in chess, and wouldn't it be better to stop it for good. \n",
        "1... Nf6": "ok, this is a classical one. Craftyfox is a good average player; I guess I'll have no surprise until move 9 or 10",
        "2. d4 e6 3. Nc3 Bb4": "looking for a direct fight, threatening slightly Ne4.",
        "4. Qc2": "as Bd2 is weak and f3 is considerably weakening my king side, I prefer this defensive move. I know it would probably better to play a more offensive one, as Nf3 or e3, or mayba a3. This I'd better play in real chess games.",
        "4... b6": "this sounds less effective than o-o, c5 or Nc6. ",
        "5. Nf3": "much much more effective is e4. But I was in a defensive mood, looking for a draw with white... Lazy, perhaps. I'll change dureing the game, but it is due to very different time. As you know, internet games cannot meet us with constant ways of considering a game. You all remember games you were comfortable with during 20 days, and then all of sudden losing interest about.\nUp and down mood in internet games are proabably more dangerous than in real game where only fatigue can change the mood.\nI feel much better now in real game... ",
        "5... Bb7 6. Bg5": "developping, withou precise idea",
        "6... d6": "considered as a huge mistake by computer analysis. ",
        "7. e3": "Qa4+ much better. and possibly wins",
        "7... Nbd7 8. Bd3 h6": "c5 sounds weaker. ",
        "9. Bh4 Bxc3+ 10. Qxc3": "I think I got out the theory here. If I ever was in... Strangely I prefer this move to the bxc3. \nMaybe some of you has an explanation. Well, yes, I am temporarily exposed to a potential Ne4 move, but long after a black queen move and the exchange of bishops on e4",
        "10... O-O 11. h3": "two reasons for this move: avoiding Ng4 and giving clear white bishop a potential escape.",
        "11... c5 12. Ke2": "here is a strange idea I had: why would I castle? On the king side, I would be exposed to the black light bishop and potential Bxf3 gxf situation. Ok, this would open the g column for a direct attack on king. Though I felt discomfortable with it. I had a better feeling with a direct g4 attack, so I had to protect my knight first and link the rook. Ke2 makes both. And it is surprising, isn't it?",
        "12... Qc7 13. g4": "here we are. but considered as a mistake by computer analysis with cxd followed by e5, opening the king way.",
        "13... Ne4": "so, much better according to computer was cxd, followed by exd (why note Qxd4?) and black playing e5",
        "14. Qe1": "computer says:\n14.\tQe1\tcxd4\n15.\texd4\tg5\n16.\tBg3\te5\n17.\td5\tNxg3+\n18.\tfxg3\te4\n19.\tBxe4\tQxc4+\n20.\tKf2\tNc5\n21.\tNd2\tQd4+\n22.\tKg2\tNxe4\n23.\tNxe4\tBxd5",
        "14... Ng5": "yes, this closes my attack for a moment.",
        "15. Bxg5 hxg5": "space closed?",
        "16. e4": "I had to close his own attack on the diagonal. but considerd as another mistake by computer. best was Qd2",
        "16... f6 17. d5": "better was h4",
        "17... exd5 18. cxd5": "the diagonal is closed, but I guess everyone has seen the dangerous e column. pawn, king, queen. A potential catastrophy.",
        "18... c4 19. Bc2 Bxd5": "good move.",
        "20. Kf1": "not takibng back, of course. Would lose the queen for a rook and a bishop.",
        "20... Bb7": "black is so much better now.",
        "21. Qc3 b5": "better Nc5 for the computer",
        "22. b3": "better Nd4 according to the computer. I liked it to try to propose a draw.",
        "22... Rac8 23. bxc4 Qxc4+ 24. Qxc4+": "at this time I only had hope for a draw.",
        "24... bxc4": "a good passed pawn.",
        "25. Nd2 c3 26. Nb3": "how to avoid the multiple menace on e4 and h1? The king position could be any worse?  I really thought black should play d5 to open this diagonal again and forced a Rg1 or Rh2 move.",
        "26... Ne5": "I guess there was a plan here, but I never saw it clearly. I am pretty sure Rfe8 is better and d5 much much better.",
        "27. Rd1": "counter-attack",
        "27... Rfd8 28. Nd4": "and now the return of the knight, my only clear soldier.",
        "28... Nc4 29. Ke2": "preparing f3",
        "29... Na5": "why not Ba6 first? the computer prefers d5",
        "30. f3": "better Nf5?",
        "30... Ba6+": "too late",
        "31. Kf2": "i feel comfortable here. Illusion.",
        "31... Bc4 32. a3 Rcb8 33. Rdb1": "mistake according to the computer.",
        "33... Rb2": "of course, black seem much better, but strangely my opponent never found the way to enter here. I remember I proposed a draw... Maybe not now, not here, but he refused.",
        "34. Rhc1": "double protection, in case of Bc3. Computer considers it another mistake because of Ba2",
        "34... Rdb8 35. Ke1": "had to free the bishop... long process.",
        "35... Kf7 36. Kd1 Rh8 37. Rxb2 cxb2 38. Rb1 Rxh3": "according to the computer, this is a blunder. Better was to play Rb8 and preserve the b2 pawn. I agree.",
        "39. Rxb2": "the king is in the middle of the black rays. ",
        "39... Rh1+ 40. Kd2 Ba6": "probably preparing Nc4",
        "41. Kc3": "forced, but also good, because my king is safely going to battle now. Who would have guessed my pawns would arrive to his field?",
        "41... Ra1": "and now for the first time the computer says I am better. And I felt so. ",
        "42. a4": "maybe better was Kb4",
        "42... Ra3+ 43. Kb4 Nc4 44. Rb3": "better was Bb3",
        "44... Ra1 45. Rc3 Nb6": "I think this was his more important mistake, now. Computer saw bigger mistakes before.",
        "46. Rc7+ Ke8 47. a5 Nd7 48. Rxa7": "even. But better was probably Ba4, forcing Rxa4+",
        "48... Bc8 49. Nf5": "and now regaining...",
        "49... Kd8 50. Nxd6 Rc1 51. Kc3 g6 52. Kd2 Rf1 53. Ke2 Rh1 54. Nxc8": "my bishop had no more role to play, I thought. How could I be more wrong? There was the Ra8 of course...",
        "54... Rh2+ 55. Kd1 Kxc8 56. Ba4 Nc5 57. Bb5 Rb2 58. Be8 Rf2 59. Bxg6 Rxf3 60. Ke2": "getting back up.",
        "60... Rf4 61. Bf5+ Kb8 62. Re7 Nb3 63. a6 Nc5 64. a7+ Ka8 65. Ke3 Nb7 66. Rf7 Nd6": "of course, not Kxa7 followed by Bc1 loses the knight.",
        "67. Rxf6 Nxf5+ 68. gxf5": "i calculated I preferred to pass two pawns though his pawn seems also passed. Actually his pawn is already lost.",
        "68... Kxa7 69. Rg6 Rf1 70. Rxg5": "the last moves are a hopeless restistance",
        "70... Re1+ 71. Kd4 Rd1+ 72. Ke5 Kb7 73. Ke6 Kc7 74. e5 Rd7 75. f6 Rd8 76. f7 Rf8 77. Rg8": ""
    },
    "url": "https://gameknot.com/annotation.pl/pinzerl-2013?gm=52853",
    "gameName": "pinzerl 2013",
    "players": "thitho (1629) vs. craftyfox (1683)",
    "opening": "English, 1...Nf6 (Anglo-Indian defense) (A15)"
}