{
    "moves": {
        "1. e4 d6 2. d4 Nf6 3. Nc3 g6 4. f4": "The Austrian attack is one of the more aggressive ways to counter the Pirc. \n",
        "4... Bg4": "And here I go with the first mistake. Thinking on countering this attack the move Bg4 can be very important. However, only after the opponent played Nf3 ...\n",
        "5. Be2 Bxe2 6. Qxe2": "Now white has a very strong center and is ahead in development\n",
        "6... Bg7 7. Nf3 O-O 8. f5": "An interesting option. Normally f4 is supposed to ensure the attack on e5, however this way white let's his Bishop into the game and tries to weaken my King safety.  A later fxg6 fxg6 allows white to check on Qc4\n",
        "8... e5": "Trying to gain space and to prevent an additional e5.\n",
        "9. dxe5 dxe5 10. Nxe5": "Mistake two: Overlooking that the pawn on e5 was undefended :)\n",
        "10... Re8 11. Nf3 Nc6 12. fxg6 fxg6": "White continues his plan to weaken my king's safety and he is willing to play with an isolated pawn (which of course could be given away later on for strategical benefit).\nHowever due to his grabbing of the pawn white lost his advantage in development. \n",
        "13. Ng5 Qe7 14. O-O": "Black tries to attack the isolated pawn. White of course counter reacts",
        "14... Rad8 15. Re1": "Everything focuses on the e4 pawn.\n",
        "15... Nd4": "I thought on forcing the queen to let go of the pawn. She has not that many squares to go (and I overlook the most important one :D). ",
        "16. Qc4+": "And here it is. The check I did not expect. However I did not see any harm, since my knight is defended. So why bother? Simply move out of the way... but...\n",
        "16... Kh8 17. Nf7+": "This allowed this very nice attack. Black looses a rook, at least: 17 .. Kg8 18 Nxd8+ Ne6 19 Nxe6 Qxe6\nSo it is probably better to play: 17 .. Qxf7 18 Qxf7 Nxc2 and go for the fork. However it is totally lost for black and really caught me off guard. :)\n"
    },
    "url": "https://gameknot.com/annotation.pl/pirc-part-iv-a-perfect-blunder?gm=41344",
    "gameName": "Pirc part IV: A perfect blunder",
    "players": "warmpancake (1531) vs. thedeafone (1586)",
    "opening": "Pirc (B09), Austrian attack"
}