{
    "moves": {
        "1. e4 d6 2. d4 Nf6 3. f3": "? Weakening the King safety and the Pawnstructure. Black continues with the standard setup.",
        "3... g6 4. d5": "Strenghens the Pawnchain, black has to search for the weakest link.However it opens the Diagonal that Blacks Bishop is going to use. :)",
        "4... Bg7 5. c3 O-O": "White has completly disregarded development. However the Bishops already have some power onfolding , but both nices have no good place to go.",
        "6. Bg5 c6": "Deconstruct the Chain and probably recapture with development. (If White does not capture, it will either have an advanced pawn which will probably fall, or White has to move the queen early)",
        "7. dxc6 Nxc6 8. Bxf6 exf6": "I decided to recapture with the pawn because I was planning f5, because either I could develop with gain of tempi, all other moves do not look that sound to me.",
        "9. Nd2": "?! White is terribly behind in development. The Knight on the second rank is not really well placed, but it wouldn't be well placed on a3 either...",
        "9... f5 10. Nc4": "? White wants to trade the e-Pawn for my isolated d-pawn, I got no problem with that, the Knight will be two far away from all the other pieces, interplay will proof to be very difficult.",
        "10... fxe4 11. Nxd6 exf3 12. Nxf3": "Black nearly lost his advantage in development, but his position is still superior.",
        "12... Qe7+": "This may be regarded as tactical, however strategically I think it's a sound move, as it occupies the open file which the rook can't occupy.",
        "13. Be2 Rd8": "Occupying the other open file and ByeBye Knight. ",
        "14. O-O": "?! Of course it heighthens King safety, but now the Bishop is under fire.",
        "14... Rxd6 15. Qc2": "?? Qe1 is proably the only solution, as Nd4 fails (15 Nd4 Nxd4 16 xd4 Rxd4/Bxd4+).",
        "15... Bf5": "! Developing and hunting the sole defender of e2",
        "16. Qb3 Qxe2 17. Rae1": "? White could have taken the Pawn on b7, to get at least something...",
        "17... Qa6 18. Ng5 Qb6+": "Let's simplify",
        "19. Qxb6 axb6 20. a3 h6 21. Nf3 Bg4 22. Nh4": "?! But whereelse to go?",
        "22... g5 23. Nf3 Bxf3 24. Rxf3 Rd2": "The magical 2nd rank... however the game was sort of over",
        "25. b4 Rxa3 26. Kf1 Bxc3 27. Rc1": "? allows further simplification, which only aids black.",
        "27... Bb2 28. Rxa3 Bxa3 29. Rb1 Bxb4 30. Kg1 Bc5+ 31. Kh1 Nd4 32. h3 b5 33. Rc1 Rc2 34. Ra1 b4": "And finally white resigned"
    },
    "url": "https://gameknot.com/annotation.pl/pirc-part-v-what-not-to-do-as-white?gm=41891",
    "gameName": "Pirc part V: What not to do as White",
    "players": "ranks2000 (1408) vs. thedeafone (1539)",
    "opening": "Pirc defence (B07)"
}