{
    "moves": {
        "1. e4 d6": "1. ............ d6 - the Pirc Defence.  May lead to the Philidor Defence by transposition, which it does and leads to an early queen exchange.",
        "2. d4 e5 3. dxe5 dxe5 4. Qxd8+ Kxd8 5. Nf3": "5. Nf3 - after the early queen exchange I now develop my king knight attacking the black e pawn.",
        "5... f6": "5. ............ f6?! - I think Nc6 defending the pawn by developing a piece was better, although queens are off the board it is still advisable to develop asap as there can be some nasty rook checks from queenside castling as you will see here.",
        "6. Nc3 Bb4 7. Bd2": "7. Bd2 - blocking the pin, developing a piece and preparing for queenside castling.",
        "7... Be6 8. O-O-O": "8. 0-0-0 - Voila!",
        "8... Nc6": "8. ........... Nc6?? - development at last, but it is at the wrong time, Ne7 was called for here to prevent the resulting combo.",
        "9. Bh6+": "9. Bh6 !! - this is a stunning discovered check, it does not appear to net any material at the moment but black will not have time to develop his king knight to free the trapped rook on h8.  I will now win at least the exchange.",
        "9... Ke7 10. Bxg7 Kf7 11. Bxh8 Nh6 12. Bxf6": "12. Bxf6 - Frere Lenoir does as much damage as he can before he perishes.",
        "12... Kxf6 13. h3": "13. h3 - to prevent Ng4 threatening f2.",
        "13... Bxc3 14. bxc3 Nf7 15. Nd2": "15. Nd2 - over the last few moves, two minor pieces have been exchanged and my queenside pawn structure is busted.  I try and consolidate.  Note that the a pawn is baited.  If black takes it with his bishop it will become trapped with c4 and rounded up by Henry a few moves later.",
        "15... Rd8 16. Nb3 Rxd1+ 17. Kxd1 Bxb3 18. cxb3": "18. cxb3 - my opponent is being extremely helpful - not only has he exchanged off his rook but he has straightened out my queenside pawns - I'm in 7th heaven here!",
        "18... Nd6 19. Bd3": "19. Bd3 - I finally complete my development on move 19.  Frere Leblanc defends my e pawn.  Next move I play f3 to consolidate my position.  After this black decided not to continue with the game and waved the white flag.",
        "19... a6 20. f3": ""
    },
    "url": "https://gameknot.com/annotation.pl/placida-discovery-mayhem-part-1?gm=18823",
    "gameName": "Placida - Discovery Mayhem - Part 1",
    "players": "jstevens1 (1698) vs. NN (1313)",
    "opening": "Pirc defence (B07)"
}