{
    "moves": {
        "1. e4 c5 2. Nf3 g6 3. c4 Nc6 4. d4 cxd4 5. Nxd4": "This is the infamous Maroczy bind. White makes sure that black will never be able to play ...d5.  The downside is potentially weak central dark squares, which the \"dragon bishop\" on g7 may be able to exploit.",
        "5... Bg7 6. Be3 Nf6 7. Nc3 Ng4": "This is the start of the variation I have prepared. The idea, believe it or not, is to transfer the N from c6 to e6 ...",
        "8. Qxg4 Nxd4 9. Qd1": "Not 9.Bxd4? Bxd4, and black is clearly better due to the bishop pair, and in particular the unrestricted DSB. If the white Q stays on g4, black can play ...d5! anyway due to the discovered attack. ",
        "9... Ne6": "On e6, the N keeps an eye on the critical central dark squares, c5, d4, and f4.",
        "10. Rc1": "Black's immediate threat was ...Bxc3+, wrecking white's Q-side pawns.",
        "10... Qa5": "Black must play actively to slow down white's development.",
        "11. Bd3 b6 12. O-O Bb7": "This is the only suitable diagonal for black's LSB. With the B on b7, white has to be careful about pushing his K-side pawns. Also, the B keeps an eye on d5, and can be traded for white's N if necessary.\n",
        "13. f4": "I don't think that white should move the f-pawn in this variation. With both e3 and d4 weak, black can get a lot of play on the dark squares. IMO, this pawn needs to stay on f2 to keep the a7-g1 diagonal sealed, at least until the black DSB has been dealt with.\n",
        "13... d6 14. a4": "The GK computer doesn't like this move, preferring 14.Rf2. I think both 14.Qe2 and 14.Bb1 give black a lot more problems than 14.Rf2, but that's a story for another annotation ;)\n",
        "14... Nc5": "White's a-pawn advance allows black to threaten ...Qb4 and ...Nb3",
        "15. Bxc5": "Giving up the DSB is a big positional blunder, as now black's own DSB can become a monster.  Better is 15.Nd5 Bxd5 16.cxd5 O-O 17.Bb5 Qb4, with an equal position.",
        "15... bxc5": "White might own d5, but now black owns d4, and with it the a7-g1 diagonal.",
        "16. Qe2 O-O 17. e5": "Trying to seal in the bishop on g7.",
        "17... dxe5 18. fxe5 Qb6 19. Rf2 Rad8": "Planning to sac the exchange in order to activate the bishops",
        "20. Qe3 Rxd3 21. Qxd3 Bxe5": "Black is winning. The active bishops and dark-square control are more than enough compensation for the exchange.",
        "22. Kh1 Bd4 23. Re2 e5": "Oh, I forgot to mention the passed e-pawn, too.",
        "24. Nb5 e4 25. Qb3 Be5": "Black has no desire to trade his best piece for a mere knight.",
        "26. Qe3 a6": "Chasing away the N so that the B can return to his post on d4.",
        "27. Nc3 Bd4 28. Qd2 f5": "Black now has a K-side attack brewing, with both B's pointed at white's K.",
        "29. Qc2 Qe6 30. Qb3 Rb8 31. a5 Qe5 32. Qa4 Qf4": "Threatening ...Be5, with mate to follow.",
        "33. Qd1": "To meet ...Be5 with Qg1.",
        "33... Bc6": "Activating the rook.",
        "34. Rb1 Rb4 35. Rc2 Be5 36. Qg1 e3 37. b3 Qg5": "Threatening ...f4 and ...f3.",
        "38. Re1": "GK computer claims this is a mistake and that white should pay 38.h3, but that's also wrong as black can just continue with 38...f4. White's best try here is probably 18.Rd1, looking to get some play on the open d-file, for example 38.Rd1 f4 39.Nd5! intending 40.Qf1, with some counter-play.",
        "38... Bd4": "Threatening to win white's Q with 39...e2.",
        "39. Qf1 Rxb3 40. Nd5 Kg7": "Probably not necessary, I was concerned about back-rank funny-business. Now the K can hide out on h6 if it needs to.",
        "41. Ra2 Be5 42. Rae2 Qh4 43. Qg1 f4": "It felt like I was playing one of those 15-number sliding puzzles to get the pawn to f4. Now I have to figure out how get f3 in. fortunately for me, white is completely bottled up.",
        "44. Rd1 Qh5 45. Qf1 Ra3": "?! I need to get rid of the N of d5 (to open up the a1-h8 diagonal) so I can play ...f3.  The plan is ...Ra4 and ...Rxc4, but after I made this move I realized that I could have just played 45.Rb4! right away, as 45...Nxb4 solves my problem!",
        "46. Rde1": "This also solves black's Nd5 problem ...",
        "46... Rd3": "Here comes exchange sac number 2!",
        "47. h3 Rxd5 48. cxd5 Bxd5 49. Rd1 f3": "Here white resigns. He has to return the the material he has gained with interest, for example, 50.Rxd5 fxe2 51.Qe1 Qf4! 52.Qxe2 Qf2 53.Qxf2 exf2 54.Rd1 Bg3, and the white rook is tied up defending against f1=Q, so black's can just march the c-pawn down to c2, and play ...Bf4 and ...c1.\n\n"
    },
    "url": "https://gameknot.com/annotation.pl/playing-against-the-maroczy-bind-part-1?gm=40446",
    "gameName": "Playing against the Maroczy bind, part 1",
    "players": "bartpieters (2054) vs. hityerclock (2225)",
    "opening": "Sicilian (B27), Acton extension"
}