{
    "moves": {
        "1. e4": "So the game started with e4.",
        "1... d5": "d5 for the Scandinavian Defence. I know it's a defence that comes after: Sicilian, e5, Frence, Caro Cann and g6 but it has become useful for me and a defence i can rely on.",
        "2. exd5": "He took the pawn, the only logical move.",
        "2... Qxd5": "I play the Lasker variation and i am not used to Nf6 positions. I know the early outcoming of the Queen may cause some problems but still it's a respected reply.",
        "3. Nc3": "Logical developing a piece.",
        "3... Qa5": "And now Qa5 is the variation i am playing. Others are Qd8, Qd6 (a modern one) and Qe5+. My opinion here is that Qa5 is the best.",
        "4. d3": "d3!? Awkard move blocking the LS Bishop and also did not challenge the e5 and c5 squares. Best here is d4.",
        "4... Nf6": "A logical move for black developing a piece and challenge the e4 square.",
        "5. Be2": "Be2 is a passive move for white. I see no reason to play that. Maybe Bf4 is better or Nf3.",
        "5... c6": "This is an important move for that defence opening space for to Queen too.",
        "6. Nf3": "Nf3 is ok. I think white has to decide which way he's gonna castle: 0-0 or 0-0-0. Going for 0-0-0 helps white better and causes more serious problems to black. From my experience from Gameknot and from blitz games 0-0 is better for black.",
        "6... Bf5": "Another main-line move for black. Here always  comes the question Bf5 or Bg4. I have used both in past but i slightly prefer Bf5, at least in a non blitz game.",
        "7. O-O": "Logical move as 0-0-0 has to move his bishop and Queen. ",
        "7... e6": "e6 is an important and main-line move too, protecting the bishop and the 'dangerous' d5 square.",
        "8. Bd2": "White can always play that move as the Queen has to be retreated. Other option is Bf5.",
        "8... Qc7": "So the Queen is moved to a safe place.",
        "9. Bg5": "Now this losses a tempo. White plays the same piece two times in row. Re1 would be better. The 'problem' for white is his LS Bishop as he's blocking the Queen's view. On the other hand this is a main set up for black with e6, c6, Bf5 and Qc7.",
        "9... Nbd7": "Protecting the knight on f6 and open the line for a possible 0-0-0.",
        "10. d4": "d4 a good move. White should have played it at once and not d3 and then d4.",
        "10... h6": "I was between opening my DS Bishop and h3. I played h3 to unpin the knight on f6.",
        "11. Bxf6": "He take it.",
        "11... Nxf6": "And i take it too.",
        "12. Ne5": "Ne5 is a nice move advancing the knight. White has to get his Queen into the game as well, so then a possible Bc4 and Qe2 with a Re1 would be a nice idea for him.",
        "12... O-O-O": "Didn't hesitate to play that. The d file could open in a while so the rook can do his job!",
        "13. Nf3": "He retreats is back. White seems like he has no plan at the moment.",
        "13... Kb8": "Protecting the a7 pawn. Also White's DS Bishop is gone so i won't have a problem.",
        "14. a4": "Almost instant reply to put pressure on my king, advancing the pawns. Good strategy but white has to mobilize all his pieces firstly.",
        "14... Bc5": "Bishop development, pinning White's Queen and starting to attack.",
        "15. b4": "b4? A useless move losses a pawn.. I don't know what he is thinking about that.",
        "15... Bxb4": "The pawn is gone.",
        "16. Na2": "Logical.",
        "16... Ba5": "A good square with a possible Bb6",
        "17. c4": "His pawn attack continues.",
        "17... c5": "c5 as he can't take it.",
        "18. d5": "So d4-d5 to exchange our pawns.",
        "18... exd5": "I take it.",
        "19. cxd5": "He takes it.",
        "19... Nxd5": "And now another pawn is gone, plus there's a Queen's pin by my rook. I am +2 so far.",
        "20. Qb3": "The only logical square i think.",
        "20... Nf4": "Move my knight in a good square and threat his bishop.",
        "21. Bc4": "Bc4 is move he should have played early in the match. Also pins my f7 pawn.",
        "21... Be4": "I put pressure on his knight.",
        "22. Bxf7": "As i predicted he took the pawn.",
        "22... Rhf8": "So he has to retreat it. Also is a really good square for my rook. Notice that his rook are out of the game so far.",
        "23. Bc4": "He moves it back. Now i saw something that rarely notice. A good combination of moves that could give a clear edge.",
        "23... Nxg2": "First is to sacrifise my knight for his g2 pawn! I think this is a really good move!",
        "24. Kxg2": "He didn't deny it.",
        "24... Rxf3": "Now Rxf3! The winning move! Pins his King and threatens his Queen at the same time. Whatever he's going to play like Qb2 then comes Rb3 and check.",
        "25. Qxf3": "So he decided to take it, the only logical move except from resigning i guess.",
        "25... Bxf3+": "The Queen is gone.",
        "26. Kxf3": "He captured my bishop. Now i have a winning advantage.",
        "26... Qxh2": "Took the exposed pawn.",
        "27. Ke2": "This is worthless now. No space to espape.",
        "27... Qh5+": "Check!",
        "28. Ke3": "He plays Ke3.",
        "28... Qe5+": "Another check!",
        "29. Kf3": "Only way to go!",
        "29... Rf8+": "The final check and he resigned then! So that was the game, hope you like my annotation! Feel free for any comments and ideas and please rate it if you like it too! Thank you very much, wish you all good matches!"
    },
    "url": "https://gameknot.com/annotation.pl/playing-the-scandinavian-and-sacrifising-a-knight-for-a-great-win?gm=46330",
    "gameName": "Playing the Scandinavian and sacrifising a knight for a great win!!!",
    "players": "drdoob (1467) vs. mariodag (1751)",
    "opening": "Scandinavian defence, Lasker variation (B01)"
}