{
    "moves": {
        "1. e4 c5 2. Nf3 g6 3. d4 cxd4 4. Nxd4 Nc6 5. c4 Bg7 6. Be3 Nf6 7. Nc3 Ng4": "This is the start of the variation.  Black will reposition the N from c6 to e6, via d4. But first white's Q must be diverted.",
        "8. Qxg4 Nxd4 9. Qd1": "Forced.  White doesn't want to give up the dark squares with Bxd4, and as black threatens both ...Nc2+ and ...d5 with a discovered attack, the Q must move.",
        "9... Ne6 10. Qd2": "In the first game I annotated, white played 10.Rc1. The two moves (Rc1, Qd2) are pretty much equivalent, and tend to transpose to the same thing as white will probably play Rc1 later anyway.",
        "10... Qa5 11. Be2": "Be3 was played in the game from part 1.",
        "11... b6 12. Rc1 Bb7 13. f3": "In part 1, I mentioned that I think moving this pawn is a mistake. in that game, my opponent played f4 (instead of f3), and was done in by the weakened dark squares.",
        "13... d6 14. O-O O-O 15. Rfd1 f5": "This strikes at the center, but the real threat is ...f4!, and white's bishops become very passive.",
        "16. Nd5": "?! Missing the point of ...f4. 16.exf4 is needed here, and after 16...Rxf5 17.Nd5 Qxd2 18.Rxd2 Rf7, white maintains a slight edge, but black is not in any danger.\n",
        "16... Qxd2": "The queen exchange gains an important tempo ...",
        "17. Rxd2 f4": "... which we use to play this move.",
        "18. Bf2 Kf7": "After ...Rf7, the rook won't have much scope. Better to defend the e-pawn with the King. Black seems to have equalized here.\n\n",
        "19. b3 Rac8 20. Kf1 g5": "further hemming in the white bishops.",
        "21. Rcd1 Rfe8 22. h4": "Trying to activate the DSB.",
        "22... h6 23. h5": "?! This move I didn't understand. How will white defend this pawn now? White's play has to come on the Q-side, so maybe a plan that involves pushing the Q-side pawns might be in order here?",
        "23... Nc5": "Looking to redeploy the N to e5 via d7. Black is looking to slowly improve his position, as white seems to be stuck for a plan.",
        "24. Bxc5": "?! Black now rules the dark squares with an iron fist. Instead, white should look to get some Q-side play (where else will he get play?) with b4.",
        "24... dxc5 25. Rc2": "Either this or Rc1, as otherwise ...e6 is embarrassing for the N. \n****** EDIT ******  After further analysis, it looks like white can also play in the center here with 25.e5!?, the point being that 25...Bxe5 is answered with 26.Bd3! and all of a sudden the errant pawn on h6 becomes a huge asset for white! Also 25.e5!? e6 26.Nc3 Bxe5 27.Nb4, and white has some activity for the pawn, though I don't know if it's enough compensation. ",
        "25... e6 26. Nc3 Red8 27. Rxd8 Rxd8 28. Ke1 Bc6": "The bishop goes to pick up white's wayward h-pawn.",
        "29. Nd1 Ke7 30. Rd2 Be8 31. Rxd8 Kxd8 32. Kd2 Bxh5": "Black is winning.",
        "33. Nc3 Kd7 34. a3 Bxc3+": "! Played only after double-counting the pawn moves ;)  Black's King can infiltrate on the dark squares!",
        "35. Kxc3 Kd6 36. b4 Ke5": "! This is now an easy win for black. The plan is Be8->Bc6, ...h5 and ...g4, creating a passed pawn. White's K can't both defend against this and keep the black K from infiltrating on d4, so white is lost.",
        "37. bxc5 bxc5 38. Bd1 Be8 39. Bc2": "Black's plan was to move the B to c6, and then play ...h5 and ...g4, creating a passed pawn. But with the white B off the d1-h5 diagonal, we can speed things up.",
        "39... g4 40. fxg4 Bc6 41. Bd1 Bxe4 42. Bf3 a6 43. a4 a5": "Now white is in Zugzwang.  Every move loses: K move (or BxB) allows the black king to infiltrate on d4 or e4, B move loses g2 pawn, and moving either g-pawn loses material. ",
        "44. Kd2 Bxf3 45. gxf3 Kd4": "White's K can't defend everything.",
        "46. Ke1 Ke3": "Seemed to be the quickest way. ...Kxc4 works, too.",
        "47. Kf1 Kxf3 48. Ke1 Kg2": "White can resign here.  The rest of the game is not interesting, my opponent decided to play it out until he was checkmated.",
        "49. g5 hxg5 50. Ke2 f3+ 51. Kd1 f2 52. Kc2 f1=Q 53. Kb2 Kf2 54. Ka2 Ke2 55. Ka3 Kd2 56. Kb2 Qe2 57. Ka2 Kc1+ 58. Ka3 Qb2#": ""
    },
    "url": "https://gameknot.com/annotation.pl/playing-against-the-maroczy-bind-part-2?gm=40814",
    "gameName": "Playing against the Maroczy bind, Part 2",
    "players": "somar96 (1768) vs. hityerclock (2231)",
    "opening": "Sicilian (B27), Hungarian variation"
}