{
    "moves": {
        "1. e4": "Before we begin, I should note that both players were playing quite quickly. Not blitz quick, but close to it, often with less than a minute per move.",
        "1... e5 2. Nf3 Nc6 3. Bb5": "Ahhh, my beloved Ruy Lopez. Thank you, black! (I don't really know why I like the Ruy so much, but it's been a favorite of mine since I was a kid).",
        "3... Bc5 4. c3": "Black chose the Classical (Cordel) Defense. I continue normally, supporting d4.",
        "4... Nf6 5. Bxc6": "Now I win a pawn. Edit: I did not mean to imply that it was forced.",
        "5... dxc6 6. Nxe5 Nxe4 7. d4": "Black was threatening f7, so I need to protect it.",
        "7... Qf6 8. Qe2": "He is still threatening f7, so I protect it another way, while threatening his knight.",
        "8... O-O 9. Qxe4": "8. ... 0-0 was an odd choice I thought. Black could have saved the knight, and my discovered check would have only netted me a pawn. Maybe it was an oversight since we were playing so fast. There seems to be no reprisal, so I eat the knight.",
        "9... Bd6 10. Nf3": "Thinking that if black exchanges, he can pin and win my e5 pawn by playing a rook to e8. I was afraid of him skewering my queen to my king with Re8, but e8 is not guarded so right now, I would reply with Qxe8 and win the rook. But I have to alleviate this danger very quickly.",
        "10... Bh3 11. O-O": "Of course, 11. Pxh3 loses my queen (I could save her by 12. Ne5 and maybe only lose the knight but even that sets up scary discovered attacks). So I ignore the bishop and castle to protect my queen and my g2 pawn. Black has two bishops and queen in striking range of my castled position, which worried me, but I didn't see any attacks that could overcome the defense offered by my queen and knight.",
        "11... Bxg2 12. Kxg2": "Black sacrifices to open up the castled formation, but again, I don't see an attack that can justify the sacrifice so I take the free bishop.",
        "12... Rae8 13. Qh4": "The rook move was expected, though I thought it would be the rook on f8 that would attack my queen. My reply offers to trade his most dangerous piece and liquidate toward an easy endgame.",
        "13... Qxh4 14. Nxh4": "He accepted my offer and now my King is safe and and white is ahead by two pieces for a pawn.",
        "14... Re6 15. Be3": "Shutting down the open e-file that black is more likely to dominate with his better development and also defending my f2 pawn since I am expecting to move my rook out from behind the pawn and don't want it to become a target for black.",
        "15... h6 16. Nd2": "Not my best move. I'm still playing quite fast here, and I wanted to catch up in development. Better was 16. Nf5! which exchanges my weak knight for black's strong bishop. I am also looking at Rg8 and Bxh6 (I have to clear away black's rook from the 6th rank first).",
        "16... Be7 17. Rfg1": "Bad move. I wanted to get my king back into some shelter with Kf1, and I wanted to take the half-open file aimed at black's king. Playing fast, I completely overlooked my hanging knight, allowing black to almost equalize.",
        "17... Bxh4 18. Rae1": "Well, on the plus side, after my blunder I'm still slightly ahead, thanks to black's questionable sacrifice on his 11th move. We have both given away a free knight this game. Time to be more careful. However, we're both still playing rapidly. With this move I chllenge black on the open e file.",
        "18... Rg6+ 19. Kh3": "By attacking the bishop, I force an exchange of rooks or an exchange of bishops. I'm hoping my tiny material advantage can be exploited to produce a bigger advantage, and liquidiating pieces seems the best approach here.",
        "19... Rxg1 20. Rxg1 g5 21. Nf3": "An odd choice by black, trapping his bishop on h4 with nowhere to run. His pawn on g5 cannot recapture because it is pinned. Now black must lose a pawn.",
        "21... Kh7 22. Nxh4 gxh4 23. Kxh4": "OK, now I'm back to a suitable lead, especially since there is no way for black to save his c7 pawn from my bishop and rook.",
        "23... Re8 24. Re1 Rg8 25. Re2": "To protect the f2 pawn while remaining on the open e-file. Black has no good attacks from the g-file.",
        "25... b6 26. Bf4": "Black seems to be preparing to advance to c5, but isolating his doubled pawns on the c-file won't help him, and capturing with Pxd4 just leaves white with a passed pawn after white recaptures with Pxd4 (this assumes white is able to play Bxc7 which black cannot really prevent).",
        "26... f5 27. Re7+": "Black wanted to play Rg4  and win white's bishop. I'm not too keen on letting that happen. I see my chance to get a rook on the 7th so I take it. Black only has one response to 27. Re7 .",
        "27... Kh8 28. Be5+": "Well, OK, black had two responses, but I never thought he would willing walk into checkmate (even not seeing the mate, cornering the king and immediately losing the rook should have been two warning signs). Black's kh8 move gives white a checkmate in 5: 28. Be5  Rb7 (forced) 29. Rxg7 (any), 30. Kh5 (any), 31. Kxh6 (any), 32. Rf6  ."
    },
    "url": "https://gameknot.com/annotation.pl/playing-too-fast?gm=21070",
    "gameName": "Playing too Fast",
    "players": "blake84120 (1499) vs. 1978vp (1274)",
    "opening": "Ruy Lopez (C64), classical defence, Benelux variation"
}