{
    "moves": {
        "1. e4 e6 2. d4 d6": "Its a weird looking move. I don't know this line. We should just perform the opening tasks.",
        "3. Nf3 Nd7 4. Be2 Be7 5. c4": "Since black is not making the most active moves, this c4 move is certainly justified, since we are at greater activity than the opponent. ",
        "5... h6 6. Nc3 a6": "Although the opening for black seems totally ridiculous, it is easy to understand his idea. Black wants to play on the flanks, and hold against any counters in the center. Thats why he set up e6 and d6. When the position is closed, then his lack of development means little. So it is clear white needs to blast the center and start attacking there.",
        "7. O-O g5 8. Ne1": "The move activates the Be2 and prepares to open up more lines near the center. Here black should be consistent with his idea, and play 8...e5 8.Be3. Now if black wants to force white to take, he will have to play ...c5. But then white still has a nice edge, since black has been forced to play in the center, and it has gotton opened up a bit. So black's strategy is incorrect, but if you don't understand it, then you will not be able to counter it.",
        "8... c6 9. f4 e5": "This move is rather poor in my opinion. It invites white to blast open the center and the f file.",
        "10. fxe5 dxe5 11. Be3": "We should keep the tension here.",
        "11... Bf6": "This move is not so great, since the bishop is blocking the other pieces.",
        "12. d5": "To neutralize the bishop and get passed pawn. Now it is clear white's strategy has prevailed. The center is clearly the place of action, and flank attack with g5 has failed.",
        "12... Ne7 13. d6 Ng6 14. Bg4": "Preventing Nf4, but black does it anways.",
        "14... Nf4 15. g3 Ng6 16. Qf3": "Now white is simply having a winning posiiton. You see that when we follow the correct strategic ideas, the winning position comes automatically.",
        "16... Nf4": "A good tricky idea to sacrifice the knight for play. It took a very long time to find the best response, but in the end I came up with something that would guarantee a clean advantage.",
        "17. gxf4 exf4 18. Bxd7+": "Getting rid of the knight. Now black should take back with the queen.",
        "18... Bxd7 19. Bc5 Qa5": "This is a poor move, since white now has a decisive way to end black's counterplay.",
        "20. b4 Qa3 21. Nd5": "Had the queen retreated, it simply would have been a waste of time. This tactic will end things immediately.",
        "21... Bd4+ 22. Kh1 Qb2 23. Nd3": "There were many ways to win here. ",
        "23... cxd5 24. Nxb2 Bxb2 25. exd5": "White is still making sure he plays the best moves, to end the game quickly.",
        "25... O-O-O 26. Rae1": "After a few more moves, black resigned. "
    },
    "url": "https://gameknot.com/annotation.pl/playing-against-weird-openings?gm=45982",
    "gameName": "Playing against weird openings",
    "players": "Me  vs. Opponent ",
    "opening": "Lengfellner system (C00)"
}