{
    "moves": {
        "1. e4": "Knowing basic opening knowledge, she plays king pawn.",
        "1... e5": "Not my usual response, but I'm not going to play the French against her.",
        "2. Nf3 Nc6 3. Bc4": "After placing her bishop on d3, I explain it blocks in the d-pawn and she moves it one square further.",
        "3... Nf6 4. d3 Bc5 5. O-O O-O 6. Nc3 d6 7. Bg5 h6 8. Bh4 Bg4": "Everything is going fine, but mum makes a mistake and opens up her kingside.",
        "9. Qe1": "9. Nd5 was a big improvement.",
        "9... Bxf3 10. gxf3 Kh7": "?! As soon as I made the move I realised how much better 10. Nd4 was, but it turns out to be a similar result.",
        "11. Nd5 Nd4 12. Qd1": "Back to the starting square.",
        "12... c6": "Wanting her to open up the g-file fully, so I can raid it with rooks and queen.",
        "13. Ne3": "Safe.",
        "13... g5": "I decide to attack anyway, and make it interesting.",
        "14. Bg3 Nh5 15. Nf5 Nf4": "My knights look pretty nice, centrally placed and aiming at many nice squares, unlike mum's bishop on g3, who is pretty much and over-sized, over-valued pawn.",
        "16. c3 Nde6 17. Re1": "I think she played this to allow luft for the king on f1.",
        "17... Nh3+ 18. Kg2 Nef4+": "Some nice checks and she retreats to the recently vacated square.",
        "19. Kf1 h5 20. d4": "She's playing some good moves, I was surprised by this one.",
        "20... exd4 21. cxd4 Bb4 22. e5": "?! She tries to make it interesting and open up the centre, and, you never know, maybe it was the best move to play against me, considering the skill difference.",
        "22... Bxe1": "Feeling greedy.",
        "23. Qxe1 h4 24. Bxf4 gxf4": "I decide to open up the g-file, a long-dreamed of plan which looks good.",
        "25. exd6 Qg5": "Slightly better than 25. Rg8. And after this move, me and mum spin the board around.",
        "26. Bd3": "! The computer agreed with my decision, which is always an accomplishment.",
        "26... Rfg8": "Interesting.",
        "27. Ne7+": "And out comes the revealed check, winning back the exchange.",
        "27... Kh8": "27... Kh6 is a slight improvement.",
        "28. Nxg8 Kxg8 29. d7": "As they say: PASSED PAWNS MUST BE PUSHED! Also, I liked this because after 29... Qg1+ 30. Ke2 it stops 30... Re8+ winning the queen.",
        "29... Qg1+ 30. Ke2 Qxh2": "Snatching.",
        "31. Kd2": "! Again, the computer likes my move. Wow, that's a nice feeling.",
        "31... Kf8": "The other, better option, was 31... Qxf2+.",
        "32. Bf5": "? 32. Qe5! wins, because of the threat of Qg8+",
        "32... Nxf2": "? The one move which half-held the position, was 32... Rd8. As they say: PASSED PAWNS MUST BE BLOCKADED!",
        "33. Kc3": "Out of the discovered check.",
        "33... Qg3 34. Qe5": "This wins, there is no threat involved in 34... Qxf3+, and now the unsafeness of the king will lose.",
        "34... Qxf3+ 35. Kc2 Qh5": "The game is just about done.",
        "36. Qd6+ Kg7 37. Rg1+ Ng4 38. Rxg4+ Qxg4 39. Bxg4 a5 40. d8=Q Rxd8 41. Qxd8": "And mum resigns. Thanks for watching this, hope you enjoyed it, I'll try to annotate some more games soon. See you all later."
    },
    "url": "https://gameknot.com/annotation.pl/playing-against-mum?gm=52761",
    "gameName": "Playing Against Mum",
    "players": "Mum/Me (???) vs. Me/Mum (???)",
    "opening": "Two knights defence (Modern bishop's opening) (C55)"
}