{
    "moves": {
        "1. d4": "I am playing d4 against my silican opponent in hopes of finding an edge before my oppents tactics hit me. My opponent is the honorable Saitek Maestro Master Chess Computer, which is set to level 3. I am not giving my opponent a rating because I only know of the maximum rating of 2200 elo for it. I included some annotation from Fritz7, noted as the source where applicable.\r\n",
        "1... Nf6 2. Nf3 e6": "The opening begins to form a Benoni.\n",
        "3. c4 c5 4. d5": "I have been reviewing some Capablanca games and have seen this response to c5, and although this game is not of exactly the same nature, this move works for me because after 4...exd5 5.cxd5 I have claimed a little more of the center than black and my d pawn while overextended is under guard by the queen.\r\n",
        "4... exd5 5. cxd5 d6": "Positional advantages for white at this point are that the f8 bishop is bad, and the b8 knight is limited to d7 or a6. Disadvantages for white are the weak pawn at d5, the minority queenside, a certain lag in piece development. White needs to move the f1 bishop, which requires e4, which requires Nc3. Black advantages are the queenside majority and castling before white after Be7. Disadvantages for black are the cramped position and the positional disadvantages of the b8 knight and f8 bishop.\r\n",
        "6. Nc3 g6": "Black opts to delay castling so that a wing attack can be placed by Bg7, which provides black some compensation in center control. White will have to keep in mind the x-ray attack on the a1 rook and the potential for an unguarded b2 pawn in that line of attack.\n",
        "7. Bf4": "The idea is to develop the bishop to a square having the most potential and where it will not be kicked back as in 7.Bg5 h6!\n",
        "7... a6": "Keeping white from playing 8.Nb5 to double attack the d6 pawn, and also prepares b5.\n",
        "8. e4": "Opening up the bishop line by pushing the pawn while adding protection to d5 and preparing for a future push to the e5 square. This move limits the choices for the c8 bishop also.\n",
        "8... Bg4": "Fritz:last book move.  Me: MC applies a pin which can be refuted. The question is which is better the knight or bishop?\n",
        "9. h3": "White puts the question to the bishop.\n",
        "9... Bh5": "This move does not achieve a questionable rating from Fritz because of 10.g4! g5! 11.Bxg5 Bg6 and the bishop can escape at the cost of a pawn, however I think it should at least rate a half a question mark for losing the pawn, or at least a speculative rating.\r\nFritz:: 9... Bxf3  [and Black has air to breath] 10. Qxf3 Nbd7\r\n",
        "10. g4 h6": "The losing moment where black does not play the correct 10...g5 move.\r\nFritz:: 10... g5 11. Bxg5 Bg6\r\n",
        "11. gxh5": "White gains a material advantage to complement the positional advantage.\n",
        "11... g5": "Fritz:: 11... Nxh5 12. Be3\r\n",
        "12. Bg3": "In restrospect this was not the best move, choices of 12.Bd2 or Bh2 would have been better, with Bh2 a preference. The Fritz variation looks interesting as well. Fritz:: 12. e5 [and White can already relax] 12... dxe5 13. Bxe5 Bg7\r\n",
        "12... Nxh5": "Now white must spend time to relocate the bishop.\n",
        "13. Bh2 Nd7": "It looks like the knight is headed to d5 or perhaps it is just there for support?\n",
        "14. Qd2": "With the idea of 15.0-0-0 and if 14...Nf4 then 15.Bxf4 gxf4 16.Qxf4 with decisive advantage. I part ways with Fritz on this moves notation because I want to set my opponent up for a fall, as will be seen later.  Fritz:: 14. Nd2 [keeps an even firmer grip] 14... Nhf6\r\n",
        "14... Qe7": "With the idea of placing pressure on e4 by way of 15...Nh5f6. I smile as I see the queen standing in front of the king - and fortunately my opponent can not see me smiling.\n",
        "15. O-O-O Nhf6": "Fritz:: 15... Bg7 16. Be2\r\n",
        "16. Re1": "Fritz:White prepares e5  Me:Now the queen looks a little precariously placed as the rook lines up on target. Obviously this can not win immediately, but there are enough well placed pieces by white to accomplish the goal. I like the move I made over the Fritz suggestion.\r\nFritz:: 16. e5 [makes it even easier for White] 16... dxe5 17. Re1 O-O-O 18. Nxe5 Nxe5 19. Bxe5 Rg8\r\n",
        "16... Bg7": "Black tries to counter the central development by white, but better would be 0-0-0 to remove the king from a potential deadly pin.\r\nFritz:: 16... Ne5 [praying for a miracle] 17. Nxe5 dxe5\r\n",
        "17. e5": "White lights a fuze to blow open the position.\n",
        "17... dxe5 18. Nxe5 Ne4": "Any other move loses fast.\r\nFritz:: 18... O-O [does not save the day] 19. Nc6 [Discovered attack] 19... Qxe1  20. Qxe1 bxc6 21. dxc6\r\n",
        "19. Rxe4": "White maintains the pin.\n",
        "19... Nxe5": "Fritz:: 19... Bxe5 [a fruitless try to alter the course of the game] 20. d6 Qf6 21. Bxe5 Nxe5 22. Qd5\r\n",
        "20. d6": "Applying more pressure.\n",
        "20... Qe6 21. Bc4": "Fritz:the best thing is for White to hand back some material. Rated as a good move by Fritz.  Me: setting up for the finish of the combination.\r\n",
        "21... Nxc4": "Fritz:Exploits the pin  Me: the black queen is lost while mine will escape. Other moves by black would have lost as well.\r\nFritz:: 21... Qxc4 [A pinning theme] 22. Rxc4\r\n",
        "22. Rxe6+": "Fritz::Annihilates a defender: e6\r\n",
        "22... fxe6 23. Qe2": "White targets the pawn and knight - both can not be saved.\n",
        "23... b5": "Fritz:: 23... Kf7 [is the last straw] 24. Qxc4 b5\r\n",
        "24. Qxe6+": "The king will be driven from this point. The choice for black is a short walk or long.\n",
        "24... Kf8": "Long.\n",
        "25. Re1": "There were a lot of choices to review at this position and I took some time to review the lines in my mind. It made most sense to cover e8 to prevent the a8 rook from lining up on my queen. The downside is that after 25...Bxc3 26.bxc3 and I do not have the pawn available to kick the knight so that I can push d6-d7 followed by Bh2-d6 mate. The black king is locked in place and all that is required is an unblockable check to apply mate. Unfortunately the position requires another route.\r\n",
        "25... Bxc3 26. bxc3": "Me:Of course I wish I had seen this line.  Fritz:: 26. Qf5  Kg8 27. Qd5  Kf8 28. Re7 Bd2  29. Kc2 Nxd6 30. Bxd6 Rd8 31. Qf7#\r\n",
        "26... Kg7": "The king makes use of the one square that allows escape.\r\nFritz:: 26... Rh7 [is no salvation] 27. d7 Ne3 28. Rxe3 Rxd7 29. Rf3  Kg7 30. Be5  Kh7 31. Qxd7  Kg8 32. Qf7#\r\n",
        "27. Qe7+": "White must drive the king away from the protection of the rooks or intervention of the knight, while keeping in mind the available squares to attack the king will not include e3 or e5.\n",
        "27... Kg6": "Fritz:: 27... Kg8 [cannot undo what has already been done] 28. Re6 Ne5 29. Bxe5 Rh7 30. Rg6  Rg7 31. Qxg7#\r\n",
        "28. Re6+": "Forcing move.\n",
        "28... Kh5 29. d7": "There are a few ideas at work on this move, ie, 30.Qe8 Rh8xe8 31.Rxe8 Ra8xe8 32.dxe8 promotes to queen, with check if the black king remains on h5. Another idea is to cover e8 from the move Ra8-e8 which would otherwise cause white to spend time on the rooks and not the king. And also it provides a waiting move for the king to walk into mate. However there was a better line found by Fritz, seen below. I learned something from Fritz.  Fritz:: 29. Qf7  Kh4 30. Qf5 Ne5 31. Bxe5 Rad8 32. Qg4#\r\n",
        "29... Kh4": "Fritz:: 29... Ne3 [doesn't improve anything] 30. Bg3 Rhf8 31. Qg7 Rf6 32. Qxf6 Rd8 33. Qxh6#\r\n",
        "30. Qf7": "The king is lured to take h3, in my mind, but MC decides that another move will prevail. Fritz:: 30. Qf6 h5 31. Qf3 g4 32. Bg3  Kxh3 33. Qh1#\r\n",
        "30... g4": "Fritz:: 30... Nd6 [is not much help] 31. Qf3 Rad8 32. Qg4#\r\n",
        "31. Bg3+": "Providing some impetus for Kxh3.\n",
        "31... Kxh3 32. Qh5+": "The moves are fairly forced from here with a decision branch available after the next black move.\n",
        "32... Kg2 33. Qh2+ Kf3 34. Qh1#": "The other choice of Kf1 results in mate also. Some kind words about my opponent, the Saitek Maestro Master Chess Computer is really nice and plays a strong game even at the lowest of settings, level 3 this time. I have just discovered the settings to make it play stronger at this level, computer thinking on all my time, and will try my next games using it. I will post my wins back here, and maybe some losses as well. I will also try the fixed depth levels for calculation training. I chose this computer for an opponent instead of Fritz, Shredder, etc, because I can tune it down and give myself a chance to win. What I like is that it doesn't play badly even at lower levels to the extent that some software opponents do.\r\n"
    },
    "url": "https://gameknot.com/annotation.pl/playing-the-silican-beast-a-benoni?gm=10058",
    "gameName": "Playing the Silican Beast a Benoni",
    "players": "ChessKnave (1543) vs. Mephisto Master Chess Program (0000)",
    "opening": "Queen's pawn (A46), Torre attack"
}