{
    "moves": {
        "1. e4 c5": "Team Match, I'm playing black and reply with the Sicilian to white's Open Game. Interesting note, I finished this game and my other match game against this same opponent within minutes of each other - I played my final move as white in that other game, then switched to this game and entered a series of conditional moves. By the time I was done, my opponent had resigned in the other game and logged out, so I went to bed and woke up find this game had concluded while I slept. I like winning while I sleep; I think it sends me pleasant dreams...",
        "2. Nf3 d6 3. d4 cxd4 4. Nxd4 Nf6": "Open Sicilian, very ordinary.",
        "5. Nc3 a6": "Najdorf Variation, very popular for black. The pawn on a6 prevents white from playing Bb5+, a strong move for white.",
        "6. Be2 e5": "6. Be2 is certainly playable for white, but not as popular as 6. Be3, the English Attack, or 6. Bg5. As played, white is choosing a quieter, less aggressive alternative. Black stays with the main line of the Najdorf.",
        "7. Nb3 Be7 8. Be3 O-O": "Just developing now, since I'm out of reference on the Sicilian.",
        "9. Qd2 Qc7": "White seems to be ahead in development, but black's pawns offset that somewhat by restricting much of white's mobility.",
        "10. O-O-O b5 11. f3 Nbd7": "Trying to catch up in development.",
        "12. g4 b4": "Trying to mix it up a little.",
        "13. Nd5 Nxd5 14. Qxd5 Rb8": "The black rook on a8 was en prise and needed to be saved, though in retrospect 14. ... Bb2 feels more powerful. I think I decided against it because I believed white would retreat the queen with a threat against the queenside pawns, so I preferred to make sure to cover them both.",
        "15. Kb1 Nc5 16. Nxc5 dxc5": "Getting a third pawn into the mix. The avalanche begins. Well, I guess it has already begun, but this gives it more credibility.",
        "17. Qd2 c4 18. b3 c3": "This move, 18. ... c3, made me nervous. I really feel overextended here, but I didn't see any immediate danger so it seemed like a good way to bind the white queenside. Truth is, a pawn avalanche against a castled king can be very powerful, but I've rarely used it. Playing this move, and the other pawn moves that follow, and not just seeing it in action but actually working it out and putting it in action myself, taught me a lot about this kind of strategy.",
        "19. Qc1 Ra8": "Time to bring in the final pawn and let loose the hounds of war.",
        "20. f4 Bb7": "Maybe a time waster. I don't think black gained anything here with this move.",
        "21. Bf3 a5": "Back on track.",
        "22. f5 a4": "Now if white plays 23. bxa4?, black replies with 23. ... Rxa4 and then moves like Qa5 and rfa1 line up a powerful attack against white's king - an attack that I don't think white could survive.",
        "23. Rd3 Ba6": "Wasting time again.",
        "24. Rd5 Bb7 25. Rd3 Rfc8": "This move is to put more focus on c2, as the upcoming moves will demonstrate.",
        "26. h4 axb3": "White tries his own pawn avalanche, but it's too late. If 27. axb3, then black plays 27. ... Qa5 28. Qb2 (forced) bxb2 29. Kxb2 Qa3+ 30. Kb1 Qa7# (white can delay with stuff like Rd8+ and Ba7 to throw away pieces to slow down black's checkmate). If 27. Rxc3, then black plays 27. ... Qxc3 still has forced mating lines beginning with 28. ... bxa2+ (28. Qb2 bxc2+ 29. Qxc2 Qxc2# or 29. Kc1 Qxe3# or 29. Ka1 Rxa2+ 30. Kxa2 Ra8+ 31. Ba7 Rxa7+ 32. Qa3 Rxa3#).",
        "27. cxb3 c2+": "Black announces checkmate in 4 beginning with 27. ... c2+. If 28. Qxc2 then 28. ... Qxc2+ 29. Ka1 Rxa1#. If 28. Ka1 or 28. Kb2 then 28. ... Rxa2+ 29. Kxa2 Qh5+ 30. Kb2 Qh7# or 30. Qa3 Qxa3#.",
        "28. Kb2 Rxa2+": "Maybe white hoped black wouldn't see the rook sacrifice and might give white time to regroup, but after 28. ... Rxa2+, white is faced with mate in two and chose to resign."
    },
    "url": "https://gameknot.com/annotation.pl/pleasant-dreams?gm=22639",
    "gameName": "Pleasant Dreams",
    "players": "jivko (1643) vs. blake84120 (1772)",
    "opening": "Sicilian (B92), Najdorf, Opovcensky variation"
}