{
    "moves": {
        "1. e4 e5 2. Nf3 Nf6 3. Nxe5 d6 4. Nf3 Nxe4 5. d4 d5 6. Bd3 Nd7": "On sort des grandes lignes. Sur ma compilation des TWIC (the week in chess), seules 3 parties sur 650.000 parties!\nLa grande ligne est Cc6 puis à égalité (Fd6 plus les occurences du coup Fe7)",
        "7. O-O": "le coup le plus logique, protege le roi immédiatement, et la tour va ajouter de la pression sur la case e4 ou tout va se passer",
        "7... Be7 8. Re1 Ndf6": "renforce la case e4 occupée par son ami le cavalier noir. c'était la case que Thierry avait choisie pour ce cavalier en passant par d7. Le fou c8 est libéré aussi.",
        "9. Ng5": "attaque bizarre que je ne comprends pas. Prévoyait-il un échange en e4?",
        "9... Bf5": "renforce e4",
        "10. Qf3": "ajoute encore de la pression sur e4",
        "10... Bg4": "le fou sort de l'attaque de la dame, et la contraint à bouger.\n\nA la place j'aurais joué Dd7 pour renforcer la position du fou et sortir la dame de sa 8eme rangée. D'ailleurs Rybka aussi, bien qu'au début de son analyse, il fasse comme toi. Ahh non, il change d'avis Rybka au bout d'une profondeur de 14, il fait comme toi, bon...\n",
        "11. Qe3 Nd6": "Pourquoi ce coup? quelle est ta stratégie à ce moment là? sans doute que tu as pensé que la position en e4 n'était plus tenable (trop d'attaquants?) Rybka aurait simplifié en échangeant Cxg5",
        "12. Nc3": "continue le développement basique",
        "12... h6": "''interroge'' le cavalier (comme ils disent dans les commentaires de 'pros')",
        "13. Nf3 Bxf3": "élimine le cavalier qui serait gênant en e5, contre un fou qui ne trouve pas sa place et bloque un peu les autres pièces",
        "14. Qxf3 c6 15. Qg3": "attaque g7. En plus les noirs ne peuvent plus roquer a cause du clouage si le fou c1 prend le pion défenseur qui est avancé en h6",
        "15... g5 16. f4": "plan classique après l'ouverture basique des blancs",
        "16... g4": "bien joué, c'est bien embêtant comme pion! mais rybka aurait joué Ch5 tout de suite",
        "17. f5 Qc7": "ah, je comprends maintenant, c'est là que tu voulais placer ta reine depuis le début, non? c'est une de tes armes habituelles?",
        "18. Bf4": "ce coup semble logique car il met en jeu le fou au 'centre' et contre ta dame, pourtant l'ordi n'aurait pas fait ça...",
        "18... O-O-O": "roque de ce côté, car le petit roque est compromis",
        "19. Qe3": "coup compréhensible: attaque double sur le fou d7, et en même temps sur le pion h6",
        "19... Nh5 20. Bxh6 Bh4": "Le fou s'échappe de l'attaque et se place à un endroit stratégique et se rapproche du roi adverse pour le combat final",
        "21. g3 Rde8 22. Qd2 Nc4 23. Bxc4 Nxg3": "le coup violent, mais qui ne marche que si les blancs prennent avec le pion h\nEn plus, comme les noirs n'ont pas tout de suite repris leur pièce en c4, il faudra penser à la sortie de combinaison pour le faire",
        "24. Bf4": "dégage le fou de l'attaque de la tour, et 'force'  de façon peu élégante mais efficace les échanges pour passer en finale avec une piece de plus",
        "24... Rxe1+ 25. Rxe1 Bg5 26. hxg3 Bxf4 27. Qxf4 Qxf4 28. gxf4 dxc4": "dommage que ton cavalier en g3 n'ait pas été plus dangereux dans les tactiques à la fin, ça aurait pu faire des dégâts..."
    },
    "url": "https://gameknot.com/annotation.pl/poe-master-51-10-eeir?gm=30164",
    "gameName": "POE MASTER 51+10', EEIR",
    "players": "Romain Razat, POE.  vs. Thierry Ditte, POE. ",
    "opening": "Petrov (C42), classical attack, Chigorin variation"
}