{
    "moves": {
        "1. e4": "I begin with the most common move which controls the centre and prepares to develop the light square bishop.",
        "1... e5": "A standard move.",
        "2. Nf3": "Attacks the pawn and develops my knigh to a useful square.",
        "2... d6": "More preferable is 2...Nc6 or 2...Nf6 ( Petrovs defense) 2.... d6 is extremely solid although white gain an advantage in space.",
        "3. Bc4": "Strikes the weak f7 square and prepares to castle. White is leading in development but blacks game is fundamentally solid.",
        "3... h6": "A rather dubious move. Black has only moved pawns so far whereas white has already developed 2 minor pieces and is ready to castle and bring the rook to support the pawns. The point of h6 was probably to stop ng5 which wins a pawn at least if played in the future.",
        "4. Nc3": "Develops the knight. 4. O-O was probably better followed by c3, Re1 then d4.",
        "4... c6": "Black should develop some pieces first. Black has significantly weakened his pawn structure with all these pawn moves. It's understandable that black wants to counterattack in the centre with an eventual d5 but I think 4... Nf6 was more appropriate since it develops a piece.",
        "5. O-O": "I castle to get my rook ready to swing into the action.",
        "5... b5": "Attacks the bishop with tempo. Black wants to gain some space on the queenside.",
        "6. Bb3 a5": "Tries to trap my bishop with a4. Notice how black has done nothing to develop his pieces. Of the last 6 moves, black has only pushed pawns.",
        "7. a3": "a3 prepares a flight square for my LSB incase a4 is played",
        "7... Ba6": "Develops the LSB to a potenially useful diagonal. Also threaten to win an exchange or a piece with b4 in the future. ",
        "8. Re1": "Gets the rook off the a6-f1 diagonal and supports my pawn.",
        "8... g6": "Prepare to develop the DSB to the closed diagonal This diagonal could be extremely useful in the future if black breaks through with d5.",
        "9. d4": "Because black can play d5 in the future, I immediately strike the centre with d4.",
        "9... Qe7": "Hold onto the valuable e pawn. If black can mantain a pawn on e5, I can't turn my space and development advantage into anything concrete.",
        "10. Be3": "Defends the pawn instead of capturing.",
        "10... Bg7 11. dxe5": "I capture with the idea of Nd2 then f4 which will allow me to my advantages in space and development as a weapon to attack blacks king.",
        "11... dxe5 12. Nd2 Nf6 13. f4": "f4 strikes the blacks strong e pawn although it severely weaken my kingside but my bishop on e3 neutralises threats along the a7-g1 diagonal.",
        "13... Nbd7": "Develops a knight.",
        "14. Nf3": "I continue to add pressure on e5.",
        "14... Nh5": "Black has placed his knight on the rim to threaten to win a pawn and effectively force the exchange of pawns.",
        "15. fxe5 Nxe5 16. Nxe5 Qxe5 17. Qe2": "Now the game begins to get interesting with a knight sacrifice. After I had played Qe2, I began to worry as I had seen the discovered attack a second after I had clicked submit. But after a while, I had seen it was actually going to give me a better game if the knight was taken if he played b4.",
        "17... b4 18. Qf3": "I had calculated that if black were to play bxc3? he would positionally be crushed after 19.Qxf7+ followed by bb6 and rd1.",
        "18... bxc3": "He takes the bait. Why not? It's free( Not really) Now white uncorks the fireworks!",
        "19. Qxf7+": "He allows me to gain strong counterplay after he captured my knight. I managed to calculate a few moves deeper into this complicated position. The two continuations I thought anout after Kd8(forced) were 20.Bb6+ and 20.Rad1 or Rfd1 then followed by 21.Be6",
        "19... Kd8": "I think 20.Rd1+(any rook) was just as good as 20.Bb6+ but Bb6 allowed my bishop to infiltrate blacks position.",
        "20. Bb6+ Kc8 21. Rad1": "I play Rd1 anyway.I bring another piece into the attack. I was planning to play either 22. Be6 or 22.Qd7",
        "21... Bf6": "Im not too sure what this move achieves.Perhap he thought about the possibility of a battery along the d file followed by a check on d8 but then again, I don't think any move would have been much better.",
        "22. bxc3": "I looked at the possibilities of a check followed by Rb1 making use of the open B file. I played 22.Bxc3 instead of 22. Be6 because I wanted my plan to be \"less obvious\"",
        "22... Be7": "A good defensive move that shuts off the 7th rank to the queen(temporarily) My attack seems to have run out of gas after 22... Be7 so I planned to use the positional advantage I had to a material advantage after Bd4( I thought)",
        "23. Bd4": "I didn't see something here. This seemingly gains a rook but...",
        "23... Bc5": "Pins the bishop to the king. Now black seems to be in a better position.",
        "24. Qe6+": "I thought about this move for a while. It seemed the best since I could win my bishop back after 24. Qe6+ Qxe6 25. Bxe6+ I capture the queen with check and I can win the bishop immediately since the king has to decamp to b7.",
        "24... Qxe6 25. Bxe6+ Kb7 26. Bxc5": "I am definetely positionally winning and I'm ahead two pawns in material. This is easily won for white.",
        "26... Rae8": "Black committs a serious blunder. Much better here was Rd8 which trades off rooks.",
        "27. Rd7+": "Black allows white to land this deadly check. Blacks king has an unappetizing choice of a8,b8 and c8.",
        "27... Kb8": "Kb7 allows me to develop my rook with tempo but every square was equally as terrible.",
        "28. Rb1+ Kc8": "This move loses immediately after 29. Re7+!! which forces the king to d8 then its mate after 30. Rb8 Bc8 31. Rxc8",
        "29. Re7+ Kd8 30. Rb8+ Bc8 31. Rxc8#": "This game was probably one of my most spectacular games I've ever played. Black was crushed after black captured the poisoned knight."
    },
    "url": "https://gameknot.com/annotation.pl/poisoned-knight?gm=44979",
    "gameName": "Poisoned knight",
    "players": "richard1234567 (1534) vs. vios (1369)",
    "opening": "Philidor (C41), Steinitz variation"
}