{
    "moves": {
        "1. d4 b5": "Polish Defense, I just felt like playing something different.",
        "2. Nc3 a6 3. e4 e6 4. Nf3 d5 5. a3": "I was expecting white to play Bg5 forcing an exchange with my bishop and subsequently drawing my Knight to e7 or Queen to the same square.",
        "5... dxe4 6. Nxe4 Bb7": "I decided to put pressure on his knight, expecting Ng3, but again I was wrong...",
        "7. Bd3": "White chose to develop his light square bishop to protect the knight.  Not a bad move, just not what I was expecting.",
        "7... Nd7": "I had visions of Ngf6 as my next move, and then attack, but...",
        "8. Bg5": "now I get Bg5",
        "8... Be7 9. Bf4": "I think better was Bxe7",
        "9... Ngf6 10. Ned2 c5": "I figured it was time to attack the center.",
        "11. O-O": "A good move to castle, but now I've got one barrel pointed at his king, and soon possibly two.",
        "11... c4": "I might have made a mistake, but I didn't see white taking c5 any time soon, and I thought I would pin his Bishop and close in his queen",
        "12. Be2 Qb6": "double barrel... ",
        "13. c3 Qc6": "I've temporarily pinned white's knight on f3 with a mate threat",
        "14. b3 Nd5": "My target is the light square bishop after the pawn on c3, this was merely a diversion to move the dark square bishop",
        "15. Ne5": "Ne5?, I think better was Bg3, but I'll take it.",
        "15... Nxe5 16. Bxe5 Nxc3": "Now I'm at least a pawn up, but I saw his light square bishop as a new problem",
        "17. Bf3": "There it is, about to ruin my whole plan...",
        "17... Qd7 18. Qc2": "Bxb7 was definitely the play to eliminate the threat, but I will take it.",
        "18... Bxf3 19. Bxg7": "Nxf3 was better, now I saw where I could gain a distinct advantage if not mate with the following...",
        "19... Ne2+ 20. Kh1 Bxg2+": "A necessary sacrifice to get my queen in the game and create a possible mating sequence",
        "21. Kxg2 Qd5+ 22. f3": "I think better was trading queens, and possibly losing the bishop",
        "22... Qg5+": "Now I am definitely thinking of a mating solution",
        "23. Kf2 Nf4": "I have a mating solution if white does not make a proper move.",
        "24. Bxh8": "Not proper, and the mating solution is 3... pretty easy to see in my opinion",
        "24... Qg2+ 25. Ke3": "only move to stave off mate for one additional move",
        "25... Nd5+ 26. Ke4": "only move",
        "26... Qe2#": "I think it is an interesting looking mate."
    },
    "url": "https://gameknot.com/annotation.pl/polish-defense-with-bishop-sac-cool-looking-mate?gm=19351",
    "gameName": "Polish Defense with Bishop Sac, Cool Looking Mate",
    "players": "kinggg (1510) vs. ralbama1 (1555)",
    "opening": "Polish defence (A40)"
}