{
    "moves": {
        "1. d4 Nf6 2. Nf3": "A flexible response",
        "2... g6": "Heading for my usual King's Indian formation",
        "3. e3": "A conservative approach.  This is looking like Colle or London System territory, common among weaker players.",
        "3... Bg7 4. Bd3": "?! Consistent with the Colle and London Systems but I always think a Bd3 is misplaced against a Black Kingside fianchetto, unless White plans a pawn assault on the f-file.",
        "4... O-O 5. c4": "Slightly more agressive than the typical 5. c3.  If I felt like it I could transpose to a Grunfeld with 5... d5 but for now I prefer to play the standard KI moves with ... d6 and e5, which is even more tempting if White hasn't put a pawn on e4 adn can potentially be forked from e4 by my pawn.",
        "5... d6 6. Nbd2 Nbd7 7. Rb1": "? obviously concerned about the B on the long diagonal but castling was more urgent",
        "7... e5 8. dxe5": "?! looks harmless enough but White is sleepwalking into trouble",
        "8... dxe5 9. e4": "blocking the aforementioned fork (which is not actually threatened yet but would be if White's Nd2 were to move) and potentially creating air for the dsb",
        "9... Nc5": "! attacking the undefended B",
        "10. Bc2 Nd3+": "An unusual opportunity.  I felt like Freddy the Big Bad Wolf here!",
        "11. Bxd3 Qxd3": "White is suddenly very cramped and inconvenienced, with castling impossible.",
        "12. Ra1": "freeing the Nd2 from its obligation to defend the R",
        "12... Bg4": "Furthering my development and increasing the pressure",
        "13. Qe2 Qxe2+": "Perhaps early to swap Qs when my attack has hardly got going but White will have trouble finding safety for her K and her pieces remain in disarray",
        "14. Kxe2 Rad8": "! This powerful rook dominates the rest of the game.",
        "15. h3 Be6 16. b3 Nh5 17. Ng5 Nf4+ 18. Kf1 Bc8 19. Ngf3 Nd3": "! the second N lands on the troublesome d3 square",
        "20. Ba3": "I'd overlooked this possibility but it doesn't solve White's problems.",
        "20... c5": "The N on d3 supports this block, saving my R from having to move from f8, where its dutry is to support the f-pawn in prosecuting the attack.",
        "21. g3 f5 22. Kg2 b6 23. Rhf1 Bb7 24. Ne1 fxe4 25. Nxd3 e3+": "Seemed more forcing than exd3.  I'm not sure how good it really is.  Though it was sufficient for this game.",
        "26. Kg1 exd2 27. Nb2 e4 28. Rad1 Rf3 29. b4": "?? the first outright blunder that I spotted anyway.",
        "29... Rxa3 30. f3 Bxb2 31. fxe4 Bxe4 32. Rf2 Rxg3+ 33. Kh2 Be5": "! I like this move!  White has no escape now.",
        "34. Rfxd2 Rg2+ 35. Kh1 Rgxd2+": "and White gave up the ghost.  She had used 44 minutes, I'd used 15... Hence my opportunity to catch up on Gameknot :-)"
    },
    "url": "https://gameknot.com/annotation.pl/portsmouth-minor-round-5?gm=21983",
    "gameName": "Portsmouth Minor Round 5",
    "players": "Susan Chadwick (1268) vs. Bob Jacobs (1592)",
    "opening": "King's Indian (A48), East Indian defence"
}