{
    "moves": {
        "1. e4": "I recommend flipping the board before watching this game.  This is the second game in a series on the portuguese gambit, I hope you enjoy the game.",
        "1... d5": "The scandinavian defense, a nice counterattacking way to meet 1.e4.  I normally play the sicilian, so while I play this (the scandinavian) occasionally my understanding of it is far from excellent.",
        "2. exd5 Nf6": "2... Qxd5 is a perfectly reasonable alternative, but I hugely prefer this move, it prepares a bunch of gambits from the one in this game (the portuguese) to the icelandic with 2... Nf6 3.c4 e6.  Also it plans to retake on d5 with the knight instead of the queen.  There is a maxim about not bringing out your queen in the opening, this move follows that idea as 2... Qxd5 loses tempo to 3.Nc3.",
        "3. d4": "White doesn't hold onto material with 3.c4, he's willing to give it back to erect a strong center via 3... Nxd5 4.c4.",
        "3... Bg4": "This initiates the portuguese gambit, black develops with tempo.  If white blocks with a piece black will regain the pawn and have a slight development lead to counteract white's good center, an approximately equal (and usually dull) game.  If white wants to play ambitiously he's forced to play the following weakening move.",
        "4. f3 Bf5 5. Bb5+": "White could defend the pawn with c4 as shown in my first annotated game on the portuguese gambit, this move places the bishop outside the pawns instead of being cramped by white's own c4 pawn.",
        "5... Nbd7 6. c4 a6 7. Ba4": "Taking the knight now that black has expended a tempo \"putting the question to the bishop\" is probably a better idea.  Now black plays an explosive move in order to give his pieces activity.",
        "7... b5 8. cxb5 Nxd5": "Black is happy for white to take on a6 as it gives him an a file to attack upon.",
        "9. bxa6": "White complies.",
        "9... Rxa6 10. Ne2": "Strangely enough, white can blunder the game in this position with a normal move, after the apparently natural 10.Nc3 Nb4! when black will strike on d3 with his knight (or if white plays 11.Bb5 Rb6 12.Bc4 he'll infiltrate on the equally valuable c2 square).",
        "10... e6": "Black prepares to conclude development.  I think it's time to take a step back and give the position a look.  I have an obvious development advantage and a target in the IQP (isolated queen's pawn), as well as having instigated the weakening f3 from white.  I also have two open files in the a & b files.  White has an excellent bishop on a4 that pins down black's knight, and thus my queen (in order to defend the knight).  I need to use my advantage in time effectively, this means I should play pressuring moves, but it also means I should NOT trade.  I've spent a lot of time developing my pieces and if I trade one for a piece white has just developed it'll be a loss of time.  My plan is to castle quick and attack white's game.  His plan is to trade his undeveloped pieces for my strong ones.  However, he shouldn't trade his bishop for my knight on d7 yet as it pins me down.",
        "11. Nbc3": "White follows his plan, preparing to trade.",
        "11... Nb4": "I also play the thematic move, this threatens 12... Nd3  and avoids a trade.",
        "12. O-O": "White avoids the check.",
        "12... c5": "This may seem counterintuitive as I'm allowing white to trade off his IQP, however, even more then I want him to have weaknesses I want to activate my pieces, especially when they come with gain of time via a check (13.dxc5 Bxc5 ).  And where else will my bishop go?  On e7 it's fine, but a little passive, and on d6 it's a target of eventual moves like Ne4.",
        "13. a3": "White pushes away my annoying knight, if it goes to d5 or c6 it gives white a trade, which should be avoided.  While the knight will be a target on d3, I feel it's impractical to retreat.",
        "13... Nd3 14. Bc2 c4": "My pawn sneaks through covering the d3 square, which may be a weakness and may be a strength.",
        "15. b3": "White has to undermine my strong d3 square by underming the defending pawn on c4.",
        "15... Nxc1 16. Qxc1": "The other option is 16.Bxf5 Nxe2  17.Qxe2 cxb3 where black has regained the pawn and it's passed!  Also a3 is hanging, this seems much better as my opponent forces exhanges without giving back the material immediately.",
        "16... Bxc2": "Sadly, I have little choice in the matter, where can my bishop go?  And I don't want him to take my bishop, doubling my pawns and opening the e file.  Perhaps 16... Bg6 preparing to open the h file if he takes is better.",
        "17. Qxc2 cxb3 18. Qxb3 Be7": "I want to castle as quickly as I can.  We've gotten through most of the middle game and I'm STILL down a pawn.  So I think it's time for another look at the board.  I'm targeting the a pawn, and white is tied down to it.  He also has to worry about the weakness of the IQP.  An IQP is usually helpful if you can use it in an attack, but that's unlikely here so it's a target for me.  The pawn on f3 is still a problem for white as it opens an annoying diagonal against his king.  In an open game I also have the advantage of still having a bishop on an open board.  This is my compensation for being down a pawn, is it worth it?  I don't know.  I think it's interesting though, that I've had compensation for the pawn from move 3 until now.",
        "19. d5": "A VERY double-edged move.  White tries to rid himself of a weakness and open the e file.  On the other hand it opens up the a7-g1 diagonal for me.  It also opens the a1-h8 diagonal.  It trades off a weakness but in return weakens the dark squares.",
        "19... O-O 20. dxe6 Rxe6 21. Nf4": "White's trying to activate but the position is an open one, where his knights will become targets.",
        "21... Nc5": "Instead of passively defending I counterattack his queen while threatening Qd4 .  However this a blunder, and I should now lose the game.  Instead I should probably play the pressure Re3.",
        "22. Qd5": "He misses the win!  After 22.Nxe6 Nxb3 23.Nxd8 Nxa1 24.Nc6! Bf6 25.Ne4! and white will trade off black's bishop, going into a pawn up endgame which should be a reasonably straight forward win.  This move is one from the green eyed monster school of thought.  The white queen, which has been on a side that's been constantly pressured, grows jealous of my queen.  She's willing to give herself up to end my queen's life... Aside from bad lines about green eyed monsters, this move makes sense as white still wants to trade.  The one problem is 22.Nxe6 wins.",
        "22... Ra6": "White removes his rook from the attacked square and it pressures white's biggest advantage (the outside extra pawns) and biggest weakness (it's an isolated pawn on the line of my bishop).",
        "23. Qxd8 Rxd8 24. Nfd5": "White continues playing for trades.",
        "24... Bd6": "...and I continue avoiding them as much as I can.",
        "25. Rfd1": "This move places a rook on an important file, but I think the trappy 25.Nb5!? may be better.  Afterwords my oppones said he looked at it, but thought it was bad after 25... Bxh2 !? 26.Kxh2 Rxd5 however he's got a nice move at the end: 27.Nc7! forking rooks.  While black's not forced to play the bishop check I think it's a nice trap to toss out, and I could see myself falling for it.",
        "25... Ne6": "I add pressure to a3.",
        "26. Ne4": "26.Nb5 was better and made more sense as it also attacks the bishop and defends a3.  However white has had to worry about little annoying threats the entire game, and here he begins to throw it away.",
        "26... Bxa3 27. Ne7+": "This traps was his plan with 26.Ne4... Too bad it's weak.  He want's 27... Bxe7 28.Rxd8  Bxd8 29.Rxa6, but I'm not going to fall for that.\n\nthanks to neilskye for pointing out that I initially wrote that 27... Bxe7 is met by 28.Rxa6?? which (he pointed out) is met by 28... Rxd1  winning.",
        "27... Kf8": "Now white has only one move to hold the position together, namely 28.Nd5 where I'm better due to the bishop but it's nothing close to a win.",
        "28. Rxd8+": "The losing blunder, now white has to worry about two threats.  One is the hanging knight and the other is Bc5  winning the rook on a1.  Notice that the weakness instigated on move 3 has lasted throughout the entire game and allows for this final tactic.",
        "28... Nxd8 29. Nf5 Bc5+ 30. Nxc5 Rxa1+ 31. Kf2 Ra5": "The final point, white might be able to hold the endgame if he's only down an exchange, and with knights there are so many forks to worry about that it would have been difficult to prove, if it was not for this skewer.",
        "32. Nd7+": "White's prays for 32... Kg8 where he'll have time to retreat the attacked knight on f5.",
        "32... Ke8": "But no.  There is a double attack on the knights and black wins.  While I can't claim that this game was the most accurate, it shows the way CONSTANT pressure and easy development comes in the portuguese gambit.  This isn't a crushing attack like game #1, in this game white doesn't grab material at every opportunity, the game shows another part of the opening, the constand build-up of threats that can last an entire game.  I hope you enjoyed the game, and please PM me with comments, criticisms and analysis."
    },
    "url": "https://gameknot.com/annotation.pl/portuguese-gambit-2?gm=6492",
    "gameName": "Portuguese Gambit #2",
    "players": "Class B Player (1750) vs. raskerino (1744)",
    "opening": "Scandinavian defence (B01)"
}