{
    "moves": {
        "1. e4": "Inviting an open, cut and thrust game.",
        "1... c6": "The Caro-Kann, a counter-attacking defence that has a good drawing reputation.",
        "2. d4": "White's standard response.",
        "2... d5 3. e5": "The advance Variation.  I have an excellent book by the Greek GM, Kotronias, on this opening.  I tend to play the wildest line, which gives me plenty of entertainment but not a very good percentage...",
        "3... c5": "! Black takes me into unknown territory, though thanks to the after-game analysis, more familiar now.",
        "4. c3": "? Loses a pawn after the sequence that follows.  John recommended either 4. dxc5 or 4. c4, both being complicated and potentially wild.",
        "4... Nc6": "increasing the pressure on d4.  dxc5 is no longer such a good option for White because Black's N could then take the pawn on e5.",
        "5. Nf3": "Not the best way to defend the pawn.  5. Be3 would have been better.",
        "5... cxd4 6. cxd4 Bg4": "pinning the N and threatening to take it, depriving the d-pawn of its cover.",
        "7. Be2": "Perhaps pinning Black's N might have been better.",
        "7... e6": "a normal developing move, releasing the other bishop.",
        "8. h3": "? a wasted tempo, forcing the B to do what it was planning to do anyway.  Be3 was still needed",
        "8... Bxf3 9. Bxf3": "This B is now out of position and the d-pawn is under-protected in view of Black's next move.",
        "9... Qb6": "! forking b2 and d4.  White's DSB is required in two places at once.  The d-pawn looks much more important than the b-pawn, so I opt to save it but the respite is only temporary.",
        "10. Be3 Qxb2 11. Nd2": "The R had to be defended.  Unfortunately the N interferes with White's Q's defence of d4.",
        "11... Nxd4 12. O-O": "White's one advantage is his advanced development.  Getting the K to safety is the best option at this stage.  Unusually for me, I'm hoping that Black will swap his good N for my bad B.  With Black's K trapped in the centre (or exposed on the c-file if he castles Q-side), White has good counter-chances with potential pins and skewers on the open lines.",
        "12... Nc6": "Now double-attacking the pawn on e5.",
        "13. Qa4": "Finally, a counter-attacking move, pinning the N, but too late.",
        "13... Qxe5 14. Rfe1": "I actually started to feel good about my prospects.  John offered a draw again. \"Fancy an early bath?\" \"If you're offering a draw, no thanks, let's play on a bit, it's just getting interesting.\"  I think I was somewhat over-optimistic!",
        "14... Bd6 15. g3": "To prevent the intrusion on h2",
        "15... Qf5": "Evading the threatened exposed attack by 16. Bd4 or Bc5 or Bf4.  All options had their attractions.",
        "16. Bg2": "defending h3 and preserving the option of a future capture on d5",
        "16... Nge7": "protecting d5, closing the attacking options down the e-file and preparing to castle",
        "17. Rab1": "at last threatening to take on b7 to reduce the pawn deficit",
        "17... O-O": "consolidating Black's position, which, with a monster protected passed pawn on d5, is already winning.",
        "18. Rxb7 Rfc8": "Now I recognised the reality of my plight and relied on Black's eagerness to be away, so I chose an innocuous-looking move and offered a draw.",
        "19. Nf3": "Black realised that he'd already offered draws twice and had, in fact, taken twice as long as me to get to this position, so he accepted the offer.  He then surprised me by suggesting that we spent some time analysing the game and proceeded to explain to me all my errors.  He claimed to have been winning in 5 out of his 6 draws in the tournament.  In that case, why hadn't he won them?  His grade would be much higher if he actually backed his judgments by seeing them through rather than initiate or accept premature draws."
    },
    "url": "https://gameknot.com/annotation.pl/portsmouth-minor-round-6?gm=22036",
    "gameName": "Portsmouth Minor Round 6",
    "players": "Bob Jacobs (1592) vs. John Upham (1480)",
    "opening": "Caro-Kann (B12), advance variation"
}