{
    "moves": {
        "1. e4 c5 2. Nf3 Nc6 3. Bb5 d6": "By the way, this is my nice reply to the unpleasant rossolimo variation. Most rossolimo players expect 3...g6, and not for the player to self pin the knight. Therefore, not so many players encounter this line or study the theory much at all. My coach introduced me to this line after I was about to drop 2...Nc6 for 2...g6, for fear of 3.Bb5. ",
        "4. O-O Bd7 5. c3": "The main move here is to play 5.Re1, so after 5...a6 6.Bf1, with the bishop being quite flexible; it can fianchetto, or stay active on the diagonal. ",
        "5... a6 6. Ba4 b5 7. Bc2 Bg4": "Now white cannot block the pin with his light squared bishop. However, the game is still really even, since the pin does not really matter much at the moment.",
        "8. h3 Bh5 9. d3": "White seems to be playing a ruy lopez sort of position, and it seems decent enough. However, the center is still quite fluid, which means flank attacks are subject to failure by a counter in the center. ",
        "9... Nf6 10. Nbd2 e6 11. Re1 Be7 12. Nf1": "Really like a ruy lopez:).But it is a totally fine idea for white, and there are no mistakes yet for either side. White has his kingisde potential prepared, and black is still developing, with a solid grip in the center. It is really about equal.",
        "12... Ne5 13. Nf1h2": "Seems quite odd, but should be the best move. White had 2 other alternatives: 13.Nfd2 should certainly be bad, because black has moved his pieces forward, while white has been forced backwards; 13.g4!? Nfxg4 14.hxg4 Bxg4 15.Nfh2 Nxf3+(15...Bh5!? is quite interesting to me but 16.d4/Kg2 relieves white a bit 16.Nxf3 0-0 is quite unclear, but black has quite the pressure, and follows up with f5. A sample variation could be 17.Kg2 f5(17...e5 to prepare 18...f5 is interesting as well, since if 18.Qd2 white's forces are quite tied up.) 18.e5 and now white has stalled the most dangerous black attacks and seems OK here(perhaps I will go for the 17...e5 line, looks more promising). Anyways, there was no need to do this calculation during the game. I just needed to see that the sacrifice was at least unclear for me to go ahead and play the move. If 13.g4 is played, I can then think about it(probably not much, due to the clock, but I will examine it more deeply.). As a last judgement, I am the one attacking in this line. The attacker's job is simply.. to attack, and make threats, while the defnder's task is very difficult.*note, by the way, I was looking through my analysis, and realized that white can play 13.g4 Nxg4 14.Nxe5, winning the game. It just shows that we need to *calculate candidate moves on every turn*. ",
        "13... O-O 14. d4 cxd4 15. cxd4 Nc4 16. b3": "A good idea, following the principle fo neutralization, getting rid of my advanced knight. So far, chances are roughly equal still, since although white has the ideal centre, black, with the d6.e6 pawns, still grips the center somewhat, while the knights on the kingside are rather oddly(but not necessarily badly)placed.",
        "16... Nb6 17. Qd3": "this move is the first inaccurate move in the game being played. The idea to use the battery against h7 is nice looking, but unforunately, this is one of the exceptions to where it fails terribly. There is the bishop on h5, which can move to g6 in an instant, blocking the diagonal. Up to this point, both sides have been playing rather fine.",
        "17... Rc8": "This move is the only one which will give black the advantage. It is quite logical: Develops a piece and stops 18.e5 Bg6. ",
        "18. Bf4": "This move is another mistake, which hands over a clear advantatge to the black player. Black's threat after 17...Rc8 was very subtle, since it is not a check or a capture, but a quieter threat. The threat is quite easy to miss actually. ",
        "18... d5": "White faces intensive difficulties defending his center.",
        "19. e5 Bg6 20. exf6 Bxf6": "Certainly black should not play the line 20...Bxd3? 21.fxe7 Qxe7 22.Bxd3, which is very unclear, and is probably giving no advantag to black. Whenever several lesser pieces are traded for a queen, the main question is \"Can these pieces coordinate well together?\" If they can, they often beat the queen. If they cannot, of course the queen is superior. This position is rather unclear. But winning clean pawn is the best move.",
        "21. Qe3 Rxc2 22. Ng4": "White has developed some potential on the kingside: In the hands of astrong player, that is something to really watch out for. Right now, black is safe on the kingside, and he has not made any pawn moves in front of the king: therefore, it will be very difficult to attack there for white.",
        "22... Be7 23. Rec1 Rxc1+": "This is now a real mistake from me: Giving up the open file. However, the time pressure is becoming real factor,since I have about 4 minutes left, and no increment. I should certainly know better than this, but it is actually a psychologicalt \"disease\" players from GM to beginner have. They understand the position, they know what they should do, but they think and think and suddenly do somethign ridiculous like this. Their thought is \"Well I gotta do something, so I'll just do this\". Time pressure causes this mainly, since we can't find the good candidates in low time. My opponent only had a minute more, but he started playing very fast once he realized he had lost a pawn. *But here is a little puzzle; What is the best move? I'll reveal my analysis in the end.",
        "24. Rxc1 Ba3": "Another inaccurate move.",
        "25. Rc6 Nd7 26. Rxa6 Qe7": "The rest of the game was mutual time trouble, me more than him. ",
        "27. Ra7 f6 28. Qc3": "27.Qe2! +/-",
        "28... Bd6 29. Bc1 Be8 30. Qc8 Nb6 31. Rxe7 Nxc8 32. Rxe6 Bd7": "32...h5! was the best move, when the g4 knight must block the rook 33.Ne3 or place itself badly with 33.Nh2. In the latter case, black's piece activity with his bishop pair should let him hold. ",
        "33. Re1 Bb4 34. Bd2 Bxd2": "Here is the most critical moment of the game, and the most instructive. \"I was down on time, so exchanging must be good to simplify!\" Most players believe this,and when they get in time trouble they hurry to get the pieces off the board. *It is actually a HUGE mistake. When you exchange a piece, you are making a critical change in the position, which needs to be assessed carefully. If you have no time to assess it, you are risking a lot. If the exchange is a bad one, then you are in more trouble, since you have increased the opponent's advantage. Therefore, it e, is best to keep the structure the same when in time trouble, unless you are certain it is beneficial or neutral. I understand this idea now, and this move gives up the bishop pair, increasing white's advantage.",
        "35. Nxd2 Bxg4 36. hxg4 Kf7 37. Rc1 Re8 38. Rc5": "Here I gave up, since my position is now very bad, and I am facing even more material loss. Also, I have less than 1 minute, while my opponent has double my time. By the way, the best move in the puzzle was ....Qa8!! This paradoxical move allows the other rook on f8 to join into the fight for the c file. Moving the queen into the corner is certainly not an obvious move for me. "
    },
    "url": "https://gameknot.com/annotation.pl/potential-upset-vs-master?gm=45438",
    "gameName": "Potential Upset vs Master",
    "players": "Rabitosky (2302) vs. Me (2096)",
    "opening": "Sicilian (B30), Nimzovich-Rossolimo attack (without ...d6)"
}