{
    "moves": {
        "1. e4": "Hi all! I'm back with a brief look at the next game in this training series, in which chicoboy catches me in an overconfident play and makes me pay dearly for it! This game is all about mindset--when you hold all the cards, remember that you get to make the threats!",
        "1... e5 2. Nf3 f5": "?! I've been playing the Latvian Gambit in these games, simply because it is a fun opening and full of energetic play from both sides.",
        "3. d3": "Personally, I think this is too passive. White should simply accept the gambit with 3.Nxe5 (or do so a move from now, with 3.d4! fxe4 4.Nxe5).",
        "3... Nc6": "Black develops a Knight that can be troublesome in this opening and defends e5.",
        "4. Nc3 Bb4": "As White is continuing to play passively, Black develops in an aggressive posture.",
        "5. Bd2": "Breaking the pin.",
        "5... Nf6 6. Nd5": "Probably a bit inaccurate--moving pieces more than once in the opening is generally a waste of time. Note that this does not actually lose the e-pawn for White: 6...fxe4 7.Nxf6+ Qxf6 8.dxe4 holds just fine.",
        "6... fxe4": "Note how many lines of exchange there are from this position. Nearly every developed piece is looking down one barrel or another. The surprising thing is that none of the lines win any material for anyone.",
        "7. Nxf6+ gxf6": "?! Black wants to keep a strong center pawn mass and open the g-file for Rook play against the White kingside as well, but 7...Qxf6 was probably more sound as it gives Black the option to shift the Queen over to g6 and pressure the hard-to-defend e-pawn.",
        "8. dxe4 d5 9. Bxb4": "White wants to discourage Black from taking on e4 and losing the right to castle in return, though at the current rate the pieces are disappearing, Black may not care.",
        "9... Nxb4 10. c3": "I think this is inaccurate. White is clearly aiming to win the d5 pawn, but Black can simply play...",
        "10... dxe4": "Now Black has an extra pawn, but White's position is a bit more stable. It remains to be seen whether Black can hold onto his advanced center with so few pieces developed to back it up!",
        "11. Nd2": "I don't know what I think about this move. White prepares to play Qh5+ and re-energie his development, but this still feels a bit passive. 11.cxb4 Qxd1+! (not 11...exf3 12.Qxf3) 12.Rxd1 exf3 13.gxf3 looks a bit more even.",
        "11... Nd3+ 12. Bxd3 exd3": "Black's center is hugely advanced, but it's still unclear whether that's a strength or a weakness! White now has 13.Qh5+! and a complex position develops after 13...Ke7 14.f4 Qd5 15.O-O-O Qxa2 16.fxe5 where Black may have a slight edge but it's hard to see how to capitalize on it.",
        "13. Ne4": "? I think this is probably a mistake. White wants to lock up the black center and create some space for his troops, but this allows 13...h5!, which keeps the WQ in check and gives Black time to develop. 13.Qh5+ immediately was stronger.",
        "13... f5": "? In a rush to push the center, Black misses his chance to gain time for development with 13...h5! Allowing the WQ to invade, with no pieces to repel her, is dangerous at best.",
        "14. Qh5+": "! The best move. White's Knight can relocate as needed once he sees where the BK goes.",
        "14... Kf8 15. Qh6+": "White keeps up the checks. Ideally he'll be able to maneuver the BK to a space where he can retreat the Knight with check, keeping ahold of his initiative. Black must play extremely carefully, as he has basically no developed pieces with which to defend his King.",
        "15... Ke7": "?? This was played without thinking too hard about it--Black doesn't feel that White's attack is that dangerous. It's not good enough; correct was 15...Kf7, because...",
        "16. Qf6+": "! White spots a devastating combination.",
        "16... Kd7": "Black must stay off the back rank to avoid hanging his Rook.",
        "17. Nc5+": "! Finally, this Knight is able to jump off e4 with huge effect. White's patience in moving the Knight is about to pay off in spades.",
        "17... Ke8": "Forced.",
        "18. Qxh8+ Ke7": "18...Kf7 19.Qxh7+ is no better.",
        "19. Qxe5+ Kf7 20. O-O": "I think I prefer castling long here, lining up the WR with the BQ and keeping the king a bit closer to the action, but this is fine. After leaping on Black's inaccuracy, White must now simply take his time to consolidate and simplify to a winning endgame.",
        "20... b6": "Desperately trying to gain time to develop the Bishop.",
        "21. Nxd3": "This is best. Eliminating that pawn leaves White free to maneuver and finish off the game.",
        "21... Qxd3 22. Rad1": "Better was 22.Rfe1, threatening a mating attack down the e-file and forcing the BQ all the way back to d8 before playing Rad1, but White's still in a commanding position.",
        "22... Qc4 23. b3": "23.Qh8! wins Black's Bishop after 24.Rd8! This is less strong.",
        "23... Qc6 24. Rd8": "Excellent move, clearing space on the back rank for the other WR. Black is lost.",
        "24... Bb7": "? Incorrect! Black is feeling behind and playing inaccurately, but 24...Bd7 was far better, keeping ahold of f5.",
        "25. Qxf5+ Ke7": "There is actually a rather unintuitive mate in 7 for White here after this move. Black is already done for, but that's no excuse for making poor moves!",
        "26. Rd5": "? It's very hard to blame White for not seeing the mate: 26.Re1+!! Kxd8 27.Qf8+ Kd7 28.Re7+ Kd6 29.Re8+ Kd5 30.Qf5+ Kd6 31.Qe5+ Kd7 32.Qe7# However, this move gives up material unnecessarily and *might* just give Black a fighting chance...",
        "26... Qxd5": "Black's only chance.",
        "27. Qxd5": "?? Nooo, White! The Queen trade sort of looks forced at first glance because of Black's nasty threat on g2, but 27.Re1+! leads to several long variations where White will win the BQ in return for the Rook. It's critical, in complicated open positions like this one, to look for aggressive options instead of instinctively defending. The text hands Black a winning advantage of a Bishop against two pawns.",
        "27... Bxd5 28. Re1+": "White continues to play well from here, but this game is a losing proposition now.",
        "28... Kf6 29. c4 Bb7 30. h4 h5 31. g3 c5": "Locking up the White pawns on light squares, the easier to pick them off with the Bishop. The BK stays on the f file to prevent a Rook from penetrating the position.",
        "32. f4 Bc6": "Preparing to take control of the e-file (while keeping the King centralized).",
        "33. a4 Re8 34. Rf1 Re3 35. Kh2 Re2+ 36. Kh3": "Slightly better was 36.Kg1 Rg2+ 37.Kh1 Kf5, though at this point it's irrelevant. Now Black has a mate in seven of his own--an opportunity not missed this time.",
        "36... Bg2+": "0-1. White resigns at the impending mate (37.Kh2 Bxf1+ 38.Kg1 Bh3! 39.Kh1 Kf5 40.Kg1 (or 40.a5; the pawn doesn't have time to promote anyway) 40...Kg4 41.Kh1 Kxg3 42.Kg1 Re1#). White found a winning tactic on move 16, but fell prey to a big bluff of an attack from the Black Queen--taking a trade he didn't need to and surrendering all hope of victory as a result. In a dangerous endgame like this one--with a few pawns and several major pieces left on the table--intermediate checks become the name of the game, and White getting caught up in a sort of midgame mentality of defending against threats immediately instead of looking for aggressive, forcing alternatives was all that it took to allow Black to turn the tides back in his favor. I hope you found something useful to take away from this game. Many thanks to chicoboy for the match, and thank you for reading!"
    },
    "url": "https://gameknot.com/annotation.pl/practice-seize-the-day?gm=46117",
    "gameName": "Practice: Seize the Day",
    "players": "chicoboy (1235) vs. bwaa (1776)",
    "opening": "Latvian counter-gambit (C40)"
}