{
    "moves": {
        "1. e4": "Hi all; this was a casual game played largely for practice. Probably the most critical thing of note in this game (besides the usual factors like activity and development) is staying aware of all moves--especially tricky ones, like en passant captures. Enjoy!",
        "1... e5 2. Nf3 Nc6 3. Bc4": "This is the Italian Game; similar to the Ruy Lopez but a little less aggressive.",
        "3... Qe7": "? The Queen defends f7, which was not really in serious danger, but it blocks in Black's King's Bishop, forcing him to either fianchetto it or move the Queen again. It's good to remember, as well, that in general terms, bringing the Queen out so early tends to be a dangerous play.",
        "4. d3": "4.Nc3 would have been fine here, as well. White is simply continuing his logical development.",
        "4... h6": "This is not bad, but it also doesn't accomplish anything: 5.Bg5 was no threat, and this move doesn't aid Black in his own development.",
        "5. Be3 d6 6. Nc3 Be6": "Black finally gets a Bishop out, though his kingside is still very restricted--his position is somewhat artificially cramped just because of the Queen sitting in the way of everything on e7. With Qd8 and Be7 instead, with Nf6 to come next move, Black's position would look worlds better.",
        "7. Nd5": "White forces Black to respond to his actions instead of developing--the Queen has not done anything useful, but it now becomes a liability.",
        "7... Bxd5": "7...Qd7 was probably better, freeing the DSB.",
        "8. Bxd5 Qd7": "Again, this probably should have been played last move.",
        "9. O-O Na5": "? This is an interesting idea, but the Knight has no real prospects out here! The only place it can actually move is back to c6, and it doesn't threaten anything on a5. Black seems to be worried about the White Bd5, but a more direct way to deal with that is the simple, clean way with 9...Nf6.",
        "10. b4": "Black's awkward Knight gives white a chance to start a queenside pawn push with tempo. After 10...Nc6 11.b5! Black must retreat the Knight to d7 (or somewhere even more awkward), allowing White to win a pawn and prepare a formidable attack on the queenside: 11...Nce7 12.Bxb7 Rb8 13.Ba6, with pressure on a7 and Rb1 coming soon. Alternately, Black can hold the b-pawn at the cost of further cramping his position with 11...Nd8, after which White can play 12.a4 or something else similarly dangerous.",
        "10... c6": "?! This seems at first glance to solve Black's problem, allowing him to exchange his Knight for the powerful White Bishop, but White has a resource to get the better of the exchange...",
        "11. Bxf7+ Qxf7 12. bxa5 Qh5": "? Simply put, Black is making too many Queen moves. She's moved four times out of Black's twelve moves, while the Knight and Bishop are still painfully inactive on the back rank. 12...Nf6 was a far better choice here, looking towards ...d5.",
        "13. Rb1": "White intends to make use of his advanced a-pawn to blast a hole through Black's queenside defenses. Between White's Rook and Bishop, the only defense is 13...Qf7, after which Black can play ...a6 and block White's advances while he gets his pieces developed.",
        "13... b5": "? This is probably an oversight--presumably meaning to lock out the a-pawn, but this allows Black to capture on b6 en passant, the strongest possible place for that pawn to go. Black's saving grace here is that White isn't very mobile on the queenside yet.",
        "14. axb6 e.p. a6": "?? This is the critical mistake in Black's game, I think. It was looking bad, but allowing White to roll his pawn unopposed down to the seventh rank means Black can no longer stop White from Queening with huge advantage: 15.b7 Rb8 16.Ba7 Rd8 17.b8=Q Rxb8 18.Rxb8+ etc. Black needed to play 14...axb6 here to stop the White attack from breaking through completely.",
        "15. b7 Rb8 16. Ba7 Be7": "It's sort of a moot point now, but this loses more material than Black needs to after 17.Bxb8 followed by Bxd6 and b8=Q. 16...Rd8 was better.",
        "17. Bxb8 Nf6 18. Bxd6 O-O": "Castling is all well and good, but this comes far too late to be useful. Black is lost, but there are a few more comments I'll make through the end.",
        "19. Bxe7 Rb8 20. Bd6 Rd8 21. b8=Q Rxb8 22. Rxb8+ Kh7 23. Nxe5": "As White doesn't have a clear mate yet, he needs to trade down and let his other pieces get into the fight, by threatening the BQ and preparing f2-f4.",
        "23... Qg5": "Technically 23...Qxd1 holds longer.",
        "24. Rh8+": "I think 24.Nf7 Qh5 25.Rh8+ looks promising as well, but this is an effective way to complete White's material advantage after 24...Kxh8 25.Nf7+, winning the Queen.",
        "24... Kxh8 25. Nf7+": "1-0. Black has had enough. I hope you found something constructive about development and awareness to take from this game--more will be forthcoming! Thanks to chicoboy for the game and thank you for reading!"
    },
    "url": "https://gameknot.com/annotation.pl/practice-early-passed-pawns?gm=45629",
    "gameName": "Practice: Early Passed Pawns",
    "players": "bwaa (1789) vs. chicoboy (1204)",
    "opening": "King's pawn game (C50)"
}