{
    "moves": {
        "1. e4 c5 2. Nf3 d6 3. Bb5+": "So many players do this to take me out of book that it probably should be the Main Line. I am annoyed at every possible follow-up move.",
        "3... Bd7 4. Qe2": "This is new to me.",
        "4... Nf6 5. e5 Bxb5": "Practically Forced",
        "6. Qxb5+ Qd7": "Again, a necessary reply.",
        "7. Qxd7+ Nfxd7 8. exd6 exd6 9. O-O Be7 10. Re1 Nc6": "I have yet to form plans for attack. None of my moves have been strategic. Rather, they are simple answers to simple questions. That idea had me concerned since it meant my development depended on White's whims. I just had to make it through the Middle Game and duke it out as best I could in the Endgame.",
        "11. Nc3 O-O-O": "I almost never castle long as Black in the Sicilian. I made the exception here because I had a Queenside majority (of sorts) to serve as defense. I was also hoping that this way I could most quickly position both my Rooks on the Kingside files and storm the White King's fort. ",
        "12. Nd5": "Incidentally, I allowed his White's Knight a very sweet outpost in the process.",
        "12... Bf6": "Here's to hoping he trades the strong Knight for the Bishop. I'd be looking at a possible N vs B endgame but at least that's better than facing mate positions involving play on e7 and c7.",
        "13. c3 Rde8 14. d3": "Here come the reinforcements.",
        "14... Rxe1+ 15. Nxe1 Re8": "A little tactic to gain momentum by shoving off a couple White pieces from the centre. ",
        "16. Bf4 Be5": "I pose the question to him, albeit with some rephrasing. ",
        "17. Be3": "It turns out he is equally fond of his Bishop as I am.",
        "17... Nf6": "But the retreat gives me one last chance to dislodge his pesky Knight!",
        "18. Nxf6": "White does not want me to play Ng4.",
        "18... Bxf6": "Much obliged.",
        "19. Nf3 Ne5 20. Rd1": "Rd1? I was not much interested in the d-pawn at all! ",
        "20... Nxf3+ 21. gxf3": "I was more interested in trading the Knights. But now, not only have I done so but managed to damage White's pawn structure.",
        "21... Kd7": "There's nothing left now but to dive in headfirst.",
        "22. Kf1 Kc6 23. d4 cxd4 24. Bxd4": "Things may have ended very differently with 24.cxd4 ... Anyone out there care to analyze the possibilities? ",
        "24... Bxd4 25. Rxd4 d5 26. b3 b5": "I can't control BOTH a4 and b4 in one move. At least b5 exerts a balancing force against White's c4 advance. Another threat here is the a4 advance. Very ugly play indeed.",
        "27. c4": "Either White prefers simpler play or did not see a4.",
        "27... bxc4 28. bxc4 dxc4 29. Rxc4+ Kd6 30. Ra4 Re7 31. Rh4 h6 32. a4 Kc5": "What was I even trying to do here???",
        "33. Kg2 Re5 34. Rf4 f6 35. h4": "Preventing Rg5 and attempts on my part to hold the 5th rank while protecting the g-pawn.",
        "35... h5": "Preventing Rg4 and attempts on his part to attack the g-pawn while allowing me to hold the 5th rank.",
        "36. Kf1": "With the 5th rank secure (and the e-file pressured) White has no means of advancing without worsening his position or going down in material. However, taking advantage of this situation required subtlety. In my earlier days I would have written this off as a draw. I will let the following sequence of moves speak for itself. ",
        "36... a5 37. Kg2 Kd5 38. Kf1 f5 39. Kg2 g6 40. Kf1 Kc5 41. Kg2 Re1 42. Kh2 Ra1": "I was playing to the person and not the position. In other words, I wanted him to make a Rook blunder. That was foolish of me.",
        "43. Kg2 Ra2": "A miscalculation on my part. I don't get anything here. Rb1 was better I think.",
        "44. Kf1 Rd2": "More accurate was Rb2-Rb4. (This IS a blitz game people. No one is perfect)",
        "45. Kg2 Rd4 46. Kg3 Rb4": "Zugzwang Achieved at long last!!!",
        "47. Rxb4 axb4": "The Endgame becomes a trivial matter.  "
    },
    "url": "https://gameknot.com/annotation.pl/pretty-positions?gm=33536",
    "gameName": "Pretty Positions",
    "players": "pa_chiro (1719) vs. tonnerre (1766)",
    "opening": "Sicilian (B52), Canal-Sokolsky attack, 3...Bd7"
}