{
    "moves": {
        "1. e4": "Standard.",
        "1... d5": "The Scandanavian - my personal favorite.",
        "2. e5": "Advance variation where white opts to play for a big center. The main alternative to this move is 2. exd Qxd 3. Nc3 Qa5 which I see a lot as well. Both variations seem to give equal play to both sides, and it has yet been proven to me that one is better than the other.",
        "2... c5": "Natural follow up which hits the central d4 square.",
        "3. f4": "?! Perhaps my opponent has seen my annotated game vs. bly_garcia:) With this move, white pushes for an early kingside attack. This is potentially very risky, as white weakens the area around his king. ",
        "3... Bf5": "Getting the light squared bishop outside of the probable pawn chain, and preparing to defend the light squares around the king by playing Nbd7 if needed.",
        "4. d3": "? I considered this move very, very slow. 3. Bb5 , Nf3, or even the aggressive g4! seem to have more merit.",
        "4... e6": "Solidifying d5 and opening a lane for the dark squared bishop.",
        "5. Nf3": "White develops, and hastens 0-0.",
        "5... h6": "Strictly defensive, as 6. Nh4 is strong for white. This move just creates a little hiding space for the Bf5 if needed, while having the added bonus of preventing 6. Ng5.",
        "6. h3": "As his Nf3 blocks his queen's influence on g4, my opponent bolsters the white squares and prepares to expand further by playing g4, which forces black to retreat.",
        "6... Nc6": "Simple development. The main issue at hand here for black is the development of the Ng8 and the Bf8, as the white pawn on e5 is very restricting.",
        "7. c3": "?! Again, I felt this move was a little slow. White does open up a route for his queen (is Qa4 on the horizon?) and overprotects d4, but conversely he loses a potential home for his Nb1. I really expected a developing move or g4 here.",
        "7... Nge7": "Being given some tempo, black attempts to solve the problem of developing this knight. While slow and retreating, Nc8 can now be played if needed.",
        "8. Be2": "Developing and preparing 0-0.",
        "8... d4": "Not satisfied with putting a knight on c8, black encourages a pawn exchange that will allow the Ne7 to move to d5.",
        "9. Nbd2": "! Strong move, as this knight belongs on e4.",
        "9... Nd5": "As planned.",
        "10. Ne4": "As planned.",
        "10... Be7": "Last piece developed.",
        "11. O-O": "King secure.",
        "11... O-O": "King secure.",
        "12. Bd2": "Last piece developed. Both sides have now accomplished their opening goals. The middlegame to come will surely be exciting, as tons of tactical complications are available to both sides. Let the fireworks begin!",
        "12... dxc3": "At this point, I felt that I had some tempo at my disposal, so I opted to force my opponent to react. As tactical complications are most definitely NOT my forte, I attempt to stay in the drivers seat and simplify things a bit. I'm hoping he will re-take with his Bd2, where I can play NxB and have the bishop pair.",
        "13. bxc3": "! Obviously my opponent sees this, and reinforces his center while keeping his dark squared bishop in play.",
        "13... Bxe4": "After pondering the \"importance\" of the bishop pair which I had been hoping for, I opt to cede it to my opponent in return for his doubled pawns on the d file and a juicy isolated pawn on c3 that I hope to attack very quickly.",
        "14. dxe4": "Equalizing.",
        "14... Nc7": "I considered Nb6, but that would have restricted my pawn on b7.",
        "15. a4": "! I really liked this move for white. He now controls my target square b5.",
        "15... a6": "Preparing for conflict on b5 with the added bonus of preventing 16. Bb5.",
        "16. Qc2": "A nice developing move which protects the weak pawns on e4 and c3.",
        "16... b5": "As both sides hit b5 twice, black attempts to further simplify to expose the weaknesses of whites problem children, the weak pawns on e4 and c3.",
        "17. Rfd1": "Rook to open file which threatens a discovered attack on the black queen.",
        "17... c4": "! This move restricts white's light squared bishop and concretes the isolani on c3.",
        "18. Be3": "! Whites gets his dark squared bishop to it's most active diagonal, forces the black queen to vacate the d file, and threatens a strong 19. Bb6 which can be protected by 20. a5. Strong move!",
        "18... Qc8": "The best alternative I felt. There were not many better choices.",
        "19. a5": "Preparing Bb6 and closing down some real estate on the queenside. This move does turn out to be very telling, although I doubt either of us realized it at the time. Keep your eyes on black's b and c pawns.",
        "19... Rd8": "Fighting to re-take the d file and still trying to simplify.",
        "20. Nd4": "Nasty. It is my opinion that white realizes my desire to simplify, so he attempts to complicate!",
        "20... Nxd4": "Fairly obvious if the \"flow\" of this game is understood. Black continues to trade down.",
        "21. cxd4": "Another telling move. White is threatening to ram his pawns down blacks throat and utilize his bishop pair. Again, watch blacks b and c pawns, as they are connected and passed.",
        "21... Rb8": "Supporting the passer.",
        "22. Bg4": "?! I didn't quite understand this move. I suppose white is looking to assult e6 after the black knight moves.",
        "22... Qb7": "Doubling support on the b pawn and hitting the enemy on e4.",
        "23. Bf2": "I'm guessing white wants to get this bishop to e1 where it can exert some influence on the e1-a5 diagonal, thereby slowing down blacks pawn advancement.",
        "23... Ne8": "As this knight is not accomplishing much, it is simply sent to the sidelines to open up the c file for some rook support.",
        "24. Rde1": "? I thought this an outright blunder. 24. Be1 was much stronger.",
        "24... Qc7": "? 24...Rdc8 was better.",
        "25. Qc3": "? White now allows the big pawn push to commence. This move only protects a5, which was not going to be attacked anyway.",
        "25... b4": "*beep beep* Out of the way lady!",
        "26. Qf3": "I considered Qb2 better, as Qb3 could be reached next after black pushes the c pawn.",
        "26... b3": "Rolling, rolling, rolling......",
        "27. Re2": "Trying to protect the 2nd rank, but white does not have enough ammo to do so properly.",
        "27... c3": "Keep them dogies rolling.....",
        "28. Qd3": "White furiously rushes to protect against black's promotion.",
        "28... b2": "Rawhide!!! Black now threatens serious material gain even if promotion does not occur.",
        "29. Rb1": "While not strictly forced, practical.",
        "29... Qxa5": "Black snags a free pawn, while maintaining protection on c3.",
        "30. Be1": "Too late. This move was required on move 24.",
        "30... Rdc8": "Taking over the protective duties on the c3 pawn, as black is preparing a crusher on the next move.",
        "31. Qc2": "White desperately hangs on.",
        "31... Qa1": "! Black dares white to take.",
        "32. Re3": "I really expected 32. Bxc. White is busted.",
        "32... Qxb1": "Black gains a rook, and if taken, the lost queen is quickly returned.",
        "33. Qxb1": "Again, not forced but there is nothing better.",
        "33... c2": "Of course.",
        "34. Qa2": "The only square to save the queen.",
        "34... c1=Q": "And white resigns, as another queen will surely be promoted. Many thanks to my new friend aaelarar for the fun game:)"
    },
    "url": "https://gameknot.com/annotation.pl/properly-pushing-powerful-passed-pawns?gm=6476",
    "gameName": "Properly Pushing Powerful Passed Pawns:)",
    "players": "aaelarar (1551) vs. tag1153 (1625)",
    "opening": "Scandinavian (centre counter) defence (B01)"
}