{
    "moves": {
        "1. e3": "Hi everyone!  It can really be quite deflating when you think you have a plan.  You carry it out but your opponent crosses you with a surprise move, sometimes one that will really put a spanner in the works or may cause you to lose at least a tempo to deal with the surprise move.  But you could have prevented that surprise move by taking preventative measures called Prophylaxis.  In this game, shortly after getting out of the database I was planning to exchange heavy pieces on the open e file and end up with a perfectly reasonable and tenable game.  Alas!  Many a slip twixt cup and lip and here is how it all unfolds.  Here is where the prophylactic move a6 is certainly appropriate!  If I had played it I would have kept Freddy's knight out of b5 (the surprise move!).   That error was compounded by me failing to eject Freddy's knight out of d6 by playing Glenda back to c7.  Instead I played my bishop to c6 trying to screen out the c file first.  This wasted tempo proved fatal and I then lost my f pawn.  In this game I let Freddy walk all over me and got what I deserved - being Freddied (Jospeak for getting checkmated by Freddy)!  He starts off with 1. e3 which is Van Krujts Opening.",
        "1... g6 2. Nf3 Bg7": "2. ....... Bg7 - according to the database it seems that kingside flank operations are the order of the day!",
        "3. d4 Nf6 4. Be2 O-O": "4. ....... 0-0 - still in the database - with the kingside fully developed castling seems to be the reasonable option.",
        "5. c4 d6 6. Nc3 Nbd7": "6. ........ Nbd7 - a suggested move in the database but it does have its downside, shutting in Fou Leblanc which means I may have to develop him by playing b6 followed by Bb7.",
        "7. O-O e5 8. b3 Re8 9. Bb2 exd4 10. exd4 c6": "10. ........ c6 - preparing d5 pawn break which will turn out to be double edged later on.",
        "11. Re1 d5 12. a3 b6 13. Qd2 Bb7": "13. ....... Bb7 - so far so good, but ........",
        "14. Bd3 Qc7": "14. ....... Qc7 - (to the tune of the song If I knew you were coming I would bake a cake) if I knew what was coming I would play a6, play a6, play a6 ...... - why, well just read on .......",
        "15. cxd5 cxd5": "15. ......... cxd5 - this pawn trade now allows that \"Surprise Move\" 16. Nb5!",
        "16. Nb5 Rxe1+ 17. Rxe1": "17. Rxe1 - got rid of one pair of heavies all right but there is still the Wicked Witch of the West, one castle, two clergy and two horses to contend with.",
        "17... Qd8 18. Nd6 Bc6": "18. ........ Bc6?? - how many more question marks would you like to give this move Freddy?  You suggested Qc7 which would have gained me a tempo to a. chase away that nasty horsie on d6 and b. I might have been able to have contested the e file and tried to get rid of another set of heavies.",
        "19. Ng5": "19. Ng5!! - this move well and truly punishes my last move.  There is no way of defending the f pawn and it drops.  Worse it allows two white horsies in my area.",
        "19... Bh6 20. Ndxf7 Bxg5 21. Nxg5": "21. Nxg5 - one of those horsies goes at the expense of Fou Lenoir but there is still the Witch, one castle, two clergy, one horse and a pawn deficit to contend with!",
        "21... Nf8 22. Qf4": "22. Qf4 - the Witch is coming ever closer.",
        "22... Kg7 23. a4 h6 24. Nf3": "24. Nf3 - the knight is driven back but not for long!",
        "24... Nf8d7": "24. .......... Nf8d7 - trying to prevent Ne5 but Freddy plays it 3 moves later anyway.",
        "25. Qd6": "25. Qd6 - that Witch gets in closer still, only a hair's breath away from Henry.  Now in order to avoid getting Freddied I must lose material.  My bishop is en prise so I defend it with Rc8.",
        "25... Rc8 26. Re7+ Kh8 27. Ne5": "27. Ne5 - here in order to save Henry I must now give up Glenda for the rook, somehow I cannot bear to do it and Freddy wants some satisfaction and he deserves it after such a pathetic display from me, so the sad answer is is to allow a swift end as follows.  After 27........ Nxe5 Freddy announces #2, in fact before I played Nxe5 he said there was a # in 17 which would have involved me giving up all my pieces.",
        "27... Nxe5 28. Qxf6+ Kg8": "28. ........ Kg8 - here a strange calmness comes over me.  I suddenly recall a couple of phrases that my late mother used to say to me.  One was \"If at first you don't succeed my girl, try, try again!\"  Another one was from a song which goes like \"I take a deep breath, pick myself up, dust myself off and start all over again.\"  In this mood I play my king to g8 and go downstairs and make myself a nice cup of Rosie Lee and bring it upstairs to my PC.  As soon as I got to the PC I got the message that I had lost.  So I take a deep breath, with one sip of my tea - dust myself off - then hit the \"challenge easy19 to a game button\" and start all over again!",
        "29. Qg7#": ""
    },
    "url": "https://gameknot.com/annotation.pl/prophylaxis?gm=21590",
    "gameName": "Prophylaxis!",
    "players": "easy19 (2232) vs. jstevens1 (1762)",
    "opening": "Van't Kruijs opening (A00)"
}