{
    "moves": {
        "1. e4": "I really like the sicilian Defence and so started out with the book move e2 to e4 but my opponent had different plans. ",
        "1... e6": "My opponent decides to go for the french defence",
        "2. d4 c6": "No longer the standard french defence with my opponents last move.",
        "3. Bc4": "Could have played e4 to e5 but instead chose to place a stronger control on the center.",
        "3... d5 4. exd5 cxd5": "choosing not to open his king in the center he attacks towards the center but thus leaving his king open to my bishop",
        "5. Bb5+ Nd7": "Now I really think he had better moves to protect the king because this move blocks in his bishop completely which will slow down his development.",
        "6. Nc3 Bb4": "He decides since his knight is pinned he will do the same to mine.",
        "7. Qd3": "not wanting to double up my pawns and I chose to bring my queen up. I didn't want to protect with my bishop hoping for the future knight to queen pin.",
        "7... Ngf6 8. Bg5": "And theres the pin.",
        "8... h6 9. Bxf6 Qxf6": "I sacrificed my pishop pair knowing he was down on development.",
        "10. Nf3 Bd6": "Not quite sure what his plans were with this move as he removed the pin and that just made his original pin move pointless.",
        "11. O-O": "Here I am completely developed and ready for the middle game and as you can see my opponent is way behind as he still needs to move his blocked bishop which requires him to move another piece first and his knight is pinned.",
        "11... a6": "finally attempting to unpin his knight.",
        "12. Ba4": "keeping it pinned",
        "12... b5": "now here I had the choice to sacrifice the bishop for two pawns knowing he was so far down on development instead of backing off and chose to do so.",
        "13. Bxb5 axb5 14. Nxb5": "now here you will notice I am threatening to take his bishop as well as seeing a future fork on the rook and king.",
        "14... O-O": "Blunder!!!!! He should have protected the fork and bishop in the same move by moving the bishop either on b8 or f4. The other choice is to move his queen once again and protect the bishop. You see how both moves require him to continue to remove pieces and not being able to continue to develop while I can begin my attack.",
        "15. Nxd6 Ba6": "here he is double attacking both my queen and rook but that is not a huge problem for me as I simply move up my c pawn to block knowing after his pawn takes I can take with my knight.",
        "16. c4 dxc4 17. Nxc4 Rfc8": "now he is double attacking my knight.",
        "18. b3": "so I double protect it.",
        "18... Nb6": "now he is triple attacking the knight knowing I can't move the knight as both my queen and rook are in the way.",
        "19. Rac1": "now here I move my left rook knowing I made need future protection from my other rook in the center as well on my d pawn.\n",
        "19... Rc6": "here I believe he is getting ready to bring out his other rook to place another attacker on the knight.",
        "20. Nfe5": "I place further protection forcing him to move his rook giving me a chance to relieve the queen of her pin",
        "20... Rc7 21. Qe4 Rac8 22. Qe2": "her I might be wasting some moves but I know I am ahead on pieces and am just patiently setting up my force.",
        "22... Qf4 23. Rfd1": "here is the extra protection I talked about before. ",
        "23... Rd8 24. Qd3": "placing my queen back to her original protection as the pawn needed extra protection.while keeping her protecting the knight.",
        "24... Nd5 25. Qd2": "he leases pressure on the knight and I am free to remove the queen from her pin and the d rook also is no longer pinned making my knight completely free to move. Also I am attacking his queen knowing the trades are better for me as I am still up two pawns in the end game.",
        "25... Qf6 26. Ne3": "now here I am attacking two pieces his knight and rook knowing trades are on my side thus forcing him to make a trade.",
        "26... Rxc1 27. Rxc1": "he chooses rooks and here my rook is perfectly placed on an open file :D",
        "27... Nxe3 28. Qxe3": "He then takes the double trade which is a very poor choice as it simplifies the game for me.",
        "28... Bb5 29. Rc5 Qf5": "here he realizes he is down on pieces and goes for a hopeful surprise backrank checkmate.",
        "30. h3": "I simply provide an escape root and am still attacking his bishop.",
        "30... Ba6 31. Nc6": "now here I am attacking his rook and queen at the same time and looking at a possible king queen fork.",
        "31... Qf6": "he protects his rook.",
        "32. Nxd8 Qxd8 33. Qc3": "preparing to attack the bishop forcing to move until it is no longer protecting the c1 file and then pinning the queen to the king and taking the queen.",
        "33... Bb7 34. a4": "knowing he can't stop the advance of my pawns without sacraficing a piece I begin my advance.\n",
        "34... Qg5": "making a final desperation for checkmate on g2 but not seeing I can attack with my rook.",
        "35. Rxg5": "Game over here he resigns."
    },
    "url": "https://gameknot.com/annotation.pl/protection-of-a-pin?gm=43911",
    "gameName": "Protection of a Pin",
    "players": "Jeffrey Williams (1935) vs. Armchessfan (1950)",
    "opening": "French defence (C00)"
}