{
    "moves": {
        "1. e4": "Winning a chess game is not easy.  A position is said to be better or winning, but then you haft to take the next step and prove it.  Your opponent isn't just going to roll over and play dead.  This game starts off as most with the simple push e4.\n",
        "1... c5": "Sicilian I like playing this better than the other alternatives.\n",
        "2. Bc4": "Consider weak compared to the other lines.\n",
        "2... e6 3. Nf3 d5 4. exd5 exd5 5. Bb5+ Nc6": "Bxc6 bxc6 and black has good control of the center.\n",
        "6. O-O Bd6": "Developing the bishop so I can play Ne7.\n",
        "7. Re1+ Nge7 8. Bxc6+": "Creating the slight weakness in pawn structure but black will gain a good center a half open b-file.\n",
        "8... bxc6 9. d3 Bg4 10. Nbd2 O-O 11. b3 Ng6 12. Bb2 Nh4": "Giving pressure to whites king side Qc7 may have been slightly better.\n",
        "13. a4 Qc7 14. g3": "Defending Bxh2+\n",
        "14... Ng6 15. Kg2 f5 16. Re6 Rfe8 17. Qe1 Qd7": "Gaining control of the e-file.\n",
        "18. Rxe8+ Rxe8 19. Qc1 f4 20. c4": "Attacking my center though cxd5 cxd5 and black is in fine shape.\n",
        "20... fxg3 21. hxg3": "Not allowing me to use the second rank for my rook.\n",
        "21... Bh3+ 22. Kg1": "Here I think white made a mistake best was Kh1.\n",
        "22... Nf4": "The g-pawn can't take due to the mate gxf4 Qg4+ followed by Qg2#\n",
        "23. Qc2": "Moving the queen out of the line of fire Ne2+\n",
        "23... Qg4": "Now here I would say black has an amazing position black should be able to win here.\n",
        "24. cxd5": "?? I believe this to be a blunder the action is happening around blacks king best was probably Nh2 Ne2+ Kh1 Qf5 Nf3 Bxg3! White would still be in trouble but not quite lost.  I would love to know if there is a forced mate in the current position on the board.\n",
        "24... Ne2+ 25. Kh1 Bxg3": "(!) Nxg3+?! fxg3 Qxg3 Ne4 saves white.  Blacks attack is overwhelming it's hard to find any way out not sure there is one after many deep looks.\n",
        "26. Qd1": "Not sure what this does but okay.\n",
        "26... Bxf2": "Force mate here.\n",
        "27. Qf1": "Leads to one of the easier mates.  Qg1 is the long mate.  Lets look at the other short mate Nh4 Bg2+ Nxg2 Qh3# or Nh4 Bg2+ Kh2 Qh3#.  Qg1 Bxg1 Rxg1 Nxg1 Ne1 Rxe1 with Qg2# impossible to avoid or Qg1 Bxg1 Ne1 Ng3+ Kxg1 Nf1+ Ng2 Qxg2# or Qg1 Bxg1 Ne1 Ng3+ Kxg1 Nf1+ Kf2 Re2#.\n",
        "27... Ng3+ 28. Kh2 Nxf1+ 29. Nxf1 Qg2#": ""
    },
    "url": "https://gameknot.com/annotation.pl/proving-the-attack?gm=31252",
    "gameName": "Proving the attack",
    "players": "damaik (1450) vs. yoshark (1393)",
    "opening": "Sicilian defence (B20)"
}