{
    "moves": {
        "1. Nf3": "This can go anywhere... I usually schablone this with 1. ... Nf6, and will mirror whatever they throw at me... We usually end up in a symmetric position evolving around e4/e5, or d4/d5...",
        "1... Nc6": "This time we try different; this is a strong player... The plan is 2. ... e5, of course...",
        "2. d4": "No chance in hell, for e5...",
        "2... d5": "We switch to Queens Gambit...",
        "3. c4": "Not really suitable, here... Better 3. Bf4 Nf6 4. e3 Nh5 5. Bg5 h6 6. Bh4...",
        "3... Bf5": "I always play this, before playing e6... 3. ... e6 4. cxd5 exd5, and then Bf5 costs too much time... @tiger_lilov: I am pretty sure, you are right; see my comment on move 4... But remember: this is blitz, after all... Then the rules are different; you get only five minutes to prove any point.",
        "4. Nc3": "Natural, but weak; white wants to prevent Bxb1... Better is 4. cxd5 Qxd5 5. Nc3 Qa5 6. Bd2 e6...",
        "4... dxc4": "We have reached some kind of Chigorin Defense... I liked this better then 4. ... e6 5. Bg5 Be7...",
        "5. e3": "Craving for c4, is not best at this stage... Better 5. d5! followed by 6. e4!... Bc1 gets cramped...",
        "5... Nf6": "Still no e6... I was under the impression, white was losing control over this game...",
        "6. Bxc4": "The stronger d5, was still an option...",
        "6... a6": "I saw no blessings in 6. ... e6 7. Qa4! Nd7 8. Bb5 Nb4! 9. e4 c6 10. exf5 cxb5 11. Qb3! This covers b5...",
        "7. Ng5": "White cannot get a hold of the position, and starts wandering... Best is 7. d5 Nb8 (tragic loss of tempo) 8. Qa4+ Nbd7...",
        "7... e6": "Right on time...",
        "8. e4": "First signs of desintegration... Best is 8. 0-0 Be7 9. Qf3 0-0 10. a3! Bd6 11. h3 Bg6...",
        "8... Bg4": "Setting up a nasty trap...",
        "9. f3": "Practically forced; the white queen has to hold her ground for d4... After 9. Qd3 Nb4! things get nasty...",
        "9... Qxd4": "Oops... 10. fxg4 Qxc4...",
        "10. Qxd4": "Much tougher is 10. Qb3! Bc5 11. Rf1 0-0 12. Ne2! Qd6 13. Bf4 Bb4+ 14. Kf2 Qc5+ 15. Be3 Na5, and then trade Queens...",
        "10... Nxd4 11. fxg4": "Gross failure... 11. Bd3 Bh5 12. Bf4 h6 13. Nh3 0-0-0 14. 0-0-0 Bc5, has white lots more to offer...",
        "11... Nc2+ 12. Kd2": "Next mistake: this knight will not be caught... Best is 12. Ke2 Nxa1 13. Bd3 c5 14. b3! b5 15. Bb2 c4 16. bxc4 bxc4 17. Bb1 Nb3 18. axb3 Rb8...",
        "12... Nxa1 13. b3": "Too soon... Better 13. Rf1 Bd6 14. Bd3/b3, or even 13. h3...",
        "13... Rd8+": "A nasty surprise again... Black gets to hold his quality, for another while...",
        "14. Bd3": "Sounder is 14. Ke2 Nc2 15. Nf3!",
        "14... Nxg4 15. Rf1": "Better 15. Nd1 (prevents Nf2) Bd6...",
        "15... Ne5": "Another nasty blow... Attacking Bd3, plus covering f7... This will cost at least another piece...",
        "16. Rf3": "What else?",
        "16... Be7": "Closing in, for the kill...",
        "17. Nxf7": "Buckles under the pressure... Tougher is 17. Ke2! h6 18. Nh3 Bg5 19. Bxg5 hxg5 20. Rg3! White had still some 4 minutes left, and me about the same... Altough white is bearing behind, there are still chances...",
        "17... Nxf3+": "But this ends all; 18. fxg3 Kxf7 19. Bb2 Nxb3+ 20. axb3 Bf6!... White resigns... Get shorty!"
    },
    "url": "https://gameknot.com/annotation.pl/proving-worthy-of-my-rating?gm=45397",
    "gameName": "Proving worthy of my rating...",
    "players": "lluminium (1875) vs. vonbonkagain (1200)",
    "opening": "Reti opening (A04)"
}