{
    "moves": {
        "1. e4 e5 2. f4 c5": "Mini-Tournament with fixed opening: KGD Mafia Defence. This is the initial position for the games.",
        "3. Bc4": "I think than 3 Bc4 is the best option. This move puts pressure over a2-g8 diagonal (d5 and f7, specially) 3 ... Qh4+ is answered with Kf1 and the queen can take f4 with check (and e4, too), but I believe than that capture gives to the white tempos and attack by the open lanes. Obviously, 3 Nf3 is a good alternative (I played this move in several games in this mini-tournament, and I comment my game with jimmysaylor with this move). May be 3 Qf3, adding pressure in d5 and f7, is a playable move.",
        "3... Qf6": "Black attacks the f-pawn, but it's so early for move the queen and now, the black queen can be a good target for the white pieces. I offer now a pawn for development, but, for example, white can play without fear 4 fxe5 Qh5+ 5 Kf1 Qxe4 6 d3 Qxe5 7 Nf3 and, now, the e-column is open and white has big advantage in development. Of course, black has another alternatives for her fifth move. Black must create a plan with the move d5, freeing the bishops! ",
        "4. Nc3": "I prefer this development, attacking the weak square d5. I see, in several games of the tournament, the move f5; but 4 ... Qh4+ 5 Kf1 Qxe4 is threating bishop and f-pawn. ",
        "4... Qxf4": "This move is risky. Now, white can threat the queen with d3, but Qh4+ and Qd8. With 5. d4 the situation isn't equal, white looks better. But, I choice the next move for castle quickly and attack f7, where I seek the Achilles' foot.",
        "5. Nf3": "Again, white had alternatives with d3 and d4. I choice protect h4, castle and, later, play in the center. May be, this plan isn't the better, but is sure.",
        "5... Be7": "Better is 5.... Nf6, acting over d5.",
        "6. O-O": "Now, I castled. But, d4 is an alternative, again.",
        "6... d6": "6 ... Nf6 or 6 Be6, may be.",
        "7. d4": "Ok, with both knights in the fight, and the LSB and the rook looking for f7, white has decisive advantage. The move 7 d4 opens the center.",
        "7... Qf6": "Black hasn't good alternatives. 7 ... Qg4 8 Bxf7+ and if 8 ... Kxf7 9 Nxe5 double check.",
        "8. Nd5": "8 Ng5 works, too.",
        "8... Qg6": "Again, black hasn't good alternatives. 8 ... Qe6 9 Nc7+",
        "9. Nc7+": "My first think was 9 Nxe7 Nxe7 10 Bxf7+ winning with the previous threat. But 9 ... Kxe7 is an alternative and white, still winning, has more work.",
        "9... Kf8": "I think than Kd8 was better. Now, white can destroy the kingside, keeping the material and positional advantage.",
        "10. Bxf7": "Black hasn't real choices, now. 10 ... Qg4 11 Bh5 Qxh5 12 Nxe5+ Nf6 13 Qxh5 and white has two mate threats f7 and e8. If 13 ... g6 14 Bh6+ Kg8 15 Nxg6 Nc6 16 Nxe7+ Nxe7 17 Qe8+ Nxe8 18 Rf8++ Beautiful mate.",
        "10... Qxf7 11. Ng5": "Black loses the queen.",
        "11... Qxf1+ 12. Qxf1+ Bf6": "12 ... Nf6 was better",
        "13. dxe5": "I think in open the d-column for my rook. White will take the rook.",
        "13... dxe5 14. Be3 Na6": "Now, I seek for 15 Nxa6 bxa6 16 Bxc5+ Ne7 and I didn't a way for the mate. Thus, I captured the rook",
        "15. Nxa8 h6": "Black generates weakness in your position",
        "16. Nf3 b6 17. Nxe5 Ne7 18. Rd1": "The last piece enters in the game",
        "18... g5": "Last blunder.",
        "19. Qxf6+ Ke8 20. Qf7#": "Thanks for your time. I repeat, excuse me, i don't speak english"
    },
    "url": "https://gameknot.com/annotation.pl/psilure78s-kgd-mafia-defense?gm=53622",
    "gameName": "psilure78's KGD Mafia Defense",
    "players": "alejandro83 (1728) vs. truetoit (1305)",
    "opening": "KGD (C30), Mafia defence"
}