{
    "moves": {
        "1. d4 Nf6 2. c4 Nc6": "I was happy to be getting my favourite defence against 1. d4, especially after having to face a few dodgy systems recently, such as the London System and Veresov.\n",
        "3. Nf3": "This is less pleasant for black than the main line, which goes as follows;\nAlternative variation: 3. Nc3 e5 4. d5 Ne7 5. e4 (5. h4 [this can be tricky to meet. Although a new (unorthodox) line seems to have become popular in recent times;] Neg8 6. Nf3 Ng4 7. a3 a5 8. e3 f5 [I'd be quite reluctant to play this myself but it certainly looks interesting.]) 5... Ng6 6. Nf3 Bc5 7. Be2 a5 [when black gets a quick development and an accelerated version of a King's Indian.]\n",
        "3... e6": "Black doesn't really want to be playing e6 in the Tango but as 3.Nf3 is quite a clever move that prevents the immediate 3...e5, if black still want to gun for a Tango then he must play 3... e6, develop the dark squared bishop and then play ...e6 and ...e5. It is slow, but the nature of the position is closed and therefore slow is okay.\n",
        "4. a3": "Now this completely refutes the Tango as the dark squared bishop can no longer be developed along the  a3-f8 diagonal. I completely forgot that my opponent is friends with Richard Palliser, the person who probably wrote the best Tango book on the market!\n",
        "4... g6": "So now I have to accept that I won't be getting a Tango now and will instead have to opt for the King's Indian Defence. We are a move behind though, due to the move 3...e6 being thrown in.\n",
        "5. Nc3 Bg7": "Alternative variation: [A better way to play this line would have been;] 5... d6 6. e4 Bg7 7. Be2 O-O 8. O-O Re8 9. Be3 e5 10. d5 Nd4 [with a nice little continuation] 11. Nxd4 exd4 12. Bxd4 Nxe4 [when black has probably now equalised. I don't see this line very often so hadn't really put much work into it.]\n",
        "6. e4 O-O 7. Be2 d6": "This is the point, I will now be able to reach a King's Indian proper but a tempo down.\n",
        "8. O-O e5": "inaccurate. White has a 61% win rate in this line but only 48% in the alternative line that I'm about to give;\nAlternative variation: 8... Re8 [this appears to be the best and most popular. It also leads to the same position as in the variation I gave earlier.] 9. Be3 e5 10. d5 Nd4\n",
        "9. d5 Nb8": "I play this because I don't like the alternative of going to d7, it just looks too cramped. Unfortunately, the text move is just too slow.\nAlternative variation: [The alternative isn't much better] 9... Ne7 10. b4 Ne8\n",
        "10. h3": "this seemed a bit pointless. I was never going to play ...Bg4, white can just get straight on with b4.\nAlternative variation: 10. b4 [and black still isn't developed.]\n",
        "10... a5 11. Be3": "this is usually an annoying move in the Tango as it challenges my active bad bishop on c5 however, in this line, the focus is more on supporting a later c5 advance.\n",
        "11... Na6": "hoping to jump into c5 at some point, although this never happened in the way i'd hoped.\n",
        "12. b4": "this was annoying. I didn't want white to start his counter-play so soon. Ideally I would have liked to have got ...Nc5 and ...a4 in but I simply didn't have time. It's now evident why black usually plays that other line with ... Re8 and then ...Nd4 after d5.\n",
        "12... c5": "Here I spent about 15 minutes before playing c5 and I'd actually calculated the entire continuation of this game, including white's exchange sacrifice. At the time of calculating this variation, it looked better for black. Once the position was reached however, my opinion changed. At the time, ...c5 seemed like the only move and my opponent thought so too however, there are a couple of interesting (and better) alternatives...\nAlternative variation: 12... Nh5 13. Bg5 f6 14. Bd2 Nf4 15. c5 f5 [when black is doing okay.]\nAlternative variation: 12... Bd7 13. c5 Nh5 14. Bc4 Nf4 [and white's a bit better in this line. For black to hold a draw with best play, 12...Nh5 seems best. After the game move 12...c5?!, white should be close to winning.]\n",
        "13. bxc5": "not as accurate as the alternative, taking en passant is better. Although white still carries an edge in the game move.\nAlternative variation: 13. dxc6 bxc6 14. b5 cxb5 15. cxb5 Nc7 16. Rc1 [and white has an edge here.]\nThe rest is pretty much forced and was all pre-calculated by myself so my replies were played pretty quickly until the end of the game.\n",
        "13... Nxc5 14. Bxc5 dxc5 15. Bd3": "I think that there are more active moves in the position. Not necessarily better, just more active.\nAlternative variation: 15. Rb1 b6 16. Rb2 Rb8 17. Qb1 [this might be slightly better and I did mention this line in the post-game analysis. I think although white has an edge though, black can still hold.]\n",
        "15... Ne8": "Alternative variation: 15... Ra6 16. Bc2 Nh5 17. Rb1 Qf6 [is another way of dealing with the position.]\n",
        "16. Re1 f5": "white doesn't have to take here but he spend a long time now, analysing the complications of the exchange sac and decided to go for it.\nAlternative variation: [I'd originally intended this when I first calculated the variations on move 12 however, before I played my 12th move I changed my mind and decided to go into the complicated alternative with the exchange sac line.] 16... Nd6 17. Rb1 Bd7 18. Re2 a4\n",
        "17. exf5": "Alternative variation: [White doesn't have to go for the exchange sac line, this is also just as good and much clearer.] 17. Rb1 Nd6 18. exf5 Bxf5 19. Qe2 Re8 [ with an edge for white but again, at this level I think black holds.]\n",
        "17... e4": "the point, and this is the exact position I'd reached in my head after white's 12th move. There are a lot of complications and 5 moves ago this looked better for black in my head. Now I wasn't so sure, but it's still forced and I'd seen further than this on move 12 so decided to just keep going along with what I'd calculated.\n",
        "18. Nxe4 Bxa1 19. Qxa1 Bxf5 20. Nxc5": "white offered me a draw here and although I took some time out to think about the offer and my chances to progress. I just thought white had too much initiative. I  have a Rook for a Knight and two pawns, and although that's usually enough to win in an open position, I felt as though white's central pawns are going to be dangerous in the long run. Black can take on h3 next but after Nxb7, white has two central united passed pawns. I feel as though I was lucky to draw this.     LESSON 1; additional work required on this line of the Tango and play the 8...Re8 line instead.     LESSON 2; when calculating a long variation, be prepared to deviate from the line along the way. Remember you can visualise the position better, the further down the line you are.     LESSON 3; don't allow yourself to get too distracted. Sometimes the opponents can make it feel like a friendly.\n"
    },
    "url": "https://gameknot.com/annotation.pl/pudsey-b-vs-leeds-b?gm=66402",
    "gameName": "Pudsey B vs. Leeds B",
    "players": "Browne, Robin (140) vs. Ibbitson, Anthony (144)",
    "opening": "Kevitz-Trajkovich defence (A50)"
}