{
    "moves": {
        "1. e4 e5": "Right now, everything is in book.",
        "2. Qh5": "But, as usual, Joe does deviate from the guidelines.  However, as I know from a couple of past games including the easy19, stronger players can go out of book and get away with it because they have more experienced.  ",
        "2... Nc6": "So, Boris develops.  However, I would've played 2...Nf6 with the idea that to develop a piece.  But, it's different here because even if black were to do that, it is a Q sac.  Therefore, Joe will is going to sac his Q for a pawn.  On the other hand, it's on black's weakest, so boriskhurgin, ...\"Better be careful from now on\" as there's little to no room for errors.  If he starts blundering, it'll be lights out for him.",
        "3. Qxf7+ Kxf7 4. Bc4+": "With that being said, Joe gets right to it and starts his development.",
        "4... d5": "The idea here is for black to gain time.  But, in my opinion, this is a mistake, as white will win a pawn by placing him in check.  However, I can't state it as a fact because Joe does not give this as a mistake.  However, things are bound to change.",
        "5. Bxd5+ Be6": "Not only getting out of check, but black plans to exchange Joe's stronger bishop.  Believe it or not, this is also what I would've played because the idea is to liquidate when ahead.  The only problem is that this will cause black to have doubled.  When it comes to doubled pawns, and a position is reached where I'm not sure if it's harmful or not.  As a general rule, I assume it's allright, until major pieces have been exchanged.  Therefore, I'll allow it because Joe said that, in general, doubled pawns are of no asset, until the major pieces have been exchanged.  However, he also pointed out the same thing that reversion said, and I agree on both.  It depends on the position, and in the case, despite being ahead, TA implied that the doubled pawns is going to cause Boris some problems.  That's why he'll take on c6, as opposed to, e6.",
        "6. Bxc6 bxc6 7. Nf3": "So, Joe develops another piece, and threatens to take on e5.",
        "7... Qf6": "?? And, Boris defends, but according to Joe, this is where black starts to go wrong.  In fact, he's already in trouble, with this move.  Here's the thing, white was able to deviate from the General Openings.  But, since white is stronger, black should not deviate.  To make matters worse, it's in front of the exposed King.  Now, I knew a lot about the basic guidelines, but I recently learned that one of them is also not bringing your Queen in front of an exposed.  After that, he'll use that extra tempo to continue developing.  Instead, as I mentioned in the intro, he should follow the General Opening Guidelines.  With that being said, I would've played 7...Bd6, as that also protects that pawn, whilst, developing a piece.",
        "8. d4": "Preparing to develop his DSB by advancing the center pawn.  And, once he does, Joe will harrass Boris's Queen.  It starts here because black must give up his pawn to avoid something worse.",
        "8... exd4": "?? But, by taking Boris is lost, according to what Joe implied starting with his next move.  Even so, what's mentioned is that white has an edge because it's harrassed.  So, bringing the Q to safety means that TA has a lead in development.  Best, in my opinion, was 8...Qg4, and I'm not sure how white would respond, but I'd go with 9.e5, to protect my center pawn. ",
        "9. Bg5": "That's because Joe will win that Q back no matter where black goes, as it traps.  Although black finds the best move, and gets a N, leaving him a little ahead, it won't be enough against his opposition.  That's because white is a much more experienced opponent.  It falls right into the same category as when reversion's attempted a trap, which I annotated that against more experienced, doesn't work.  And, what TA said is that once this happens, the game is lost for Boris.  With how much of his Q sacs I study for Homework (due to what I've learned), and the fact that I've used his methods to teach students, I, as usual, strongly agree with him.",
        "9... Qg6 10. Ne5+ Ke8 11. Nxg6 hxg6 12. Nd2": "One of the other reasons that Joe has a win is because, in addition to what I mentioned, black has doubled.  As we'll see, he also said that in the openings, like the Ruy Lopez, which reversion also noted, doubled pawns are of no real asset.  But, in the mid and endgames (as we're in the midgame,) doubled pawns become problematic.  In addition, white is finding a better outpost for his N.  And, when he does, Boris will have to deal with another threat.",
        "12... Be7": "Developing a piece and threatening to win white's Bg5.  But, as noted, in TA's book the damage has been done, and I agree with him, especially due to how much I've learned.  In addition to GM Susan Polgar, Jack Stockel, and archduke_piccolo, Joe is also one of the main reasons that I've improved which is why enjoy being in his club and studying games like this.",
        "13. Nf3": "What I was implying with 12.Nd2 is that the threat is winning a pawn, but Joe is also protecting Bg5.",
        "13... Bg4": "So, Boris decides to hit Joe's Nf3.  But, in this case, doubled pawns are of no concern because they're closer to the center, as TA also notes.",
        "14. Bf4": "So, Joe hit's c7.",
        "14... Bxf3": "But, Boris takes, nonetheless.  According to TA, however, enabling white to double up closer to the center, will add to Joe's winning advantage.",
        "15. gxf3 Rc8": "Protecting his b7 pawn.",
        "16. O-O-O": "Waisting no time, however, Joe castles, at once.  In this position, I also would've castled long because castling short would appear to leave the King exposed.  In fact, it would be similar to the blunder I made against Jack, last week.  So, I think that TA made the right choice.",
        "16... c5": "Trying to figure out what he can do about those doubled pawns.",
        "17. c3": "So, Joe attempts to exchange on d4.  ",
        "17... g5": "But, Boris declines by hitting Bf4.  However, Joe has other plans.",
        "18. Bg3": "Starting with this move, as he retreats here, instead of, on d2.",
        "18... Nf6": "Completing his development, but this time, it's too little too late, because of what TA mentioned earlier.  In fact, not only will Joe exchange, but he will pick up a pawn, in the process.",
        "19. cxd4 cxd4 20. Rxd4 Nh5": "In a game like this, where you should not deviate, I'm all but certain that Boris has made his position worse due to the N being on the rim.",
        "21. Ra4": "So, Joe takes advantage of black's last move, which I deem to be a mistake by hitting a7.",
        "21... Nxg3": "The idea is to liquidate when ahead.  But, I believe that Boris made the wrong choice because white will now undouble his pawns.  It wasn't much of an asset, to begin with which is why Joe allowed it.  But, by getting rid of doubled pawns, white gets a very solid pawn chain which is very beneficial here.",
        "22. fxg3 Bc5": "Protecting a7.",
        "23. Ra5": "So, Joe hit's his Bishop, instead.",
        "23... Bb6": "Which Boris also protects.",
        "24. Re5+": "Instead of taking on g5 (which I, likely, would've played), Joe goes for the gusto by placing Boris in check.  But, this move makes sense, as black's K will be more exposed.",
        "24... Kf7 25. Kc2": "I still anticipated 25.Rxg5, but this move makes sense to me.  The idea being is that we're now in the endgame, which in that phase, the monarch is a powerful weapon.  So, in this position, Joe is mobilizing his King.",
        "25... Rhd8": "The plan involves a nasty threat since Boris will play 26...Be3",
        "26. Rxg5": "But, before that happens, Joe takes, at once.",
        "26... Be3 27. Rf5+": "And, he delays that nasty check, by placing Boris in check, first.",
        "27... Kg8 28. Re1": "Preventing the nasty threat because with Joe's Rook on e1, if Boris plays 28...Rd2+??, after 29.Kc3, white will a win a piece.  Although it's not a fork, this is a double attack since two pieces are under fire.  The bishop is by white's Rook, and the monarch is attacking the Rook.",
        "28... Bb6": "Therefore, Boris wisely decides to retreat.",
        "29. f4": "As the saying goes, \"Passed pawn must be pushed.\"",
        "29... Rd4": "Boris tries to delay that.  But, by doing this, Joe will get a solid pawn chain.  When that happens, he'll be able to promote.",
        "30. e5 Rcd8": "Still trying to stop, as Boris doubles up on one file which is generally useful.  In many games, doubling up will generally win.  But, this is not going to help black, in this particular position, as Joe has ways around that.",
        "31. Re2": "Starting with this move.",
        "31... g6": "Hitting Joe's Rook.",
        "32. Rg5": "So, Joe fires back.",
        "32... Kf7": "Protecting g6, whilst mobilizing his K.",
        "33. b3": "Getting a different pawn chain.  But, this isn't, as useful as, the ones on h2-e5  Yet, in the long run, I think that it'll give Joe another passed pawn, overall.  In fact, this is white's long term plan, in my opinion.",
        "33... Ba5": "Trying to stop that.",
        "34. e6+": "Although his b pawn can't advance, it's still, too little, too late, because with the Rook behind his passed pawn and this check, not only will white win a piece, but Joe is going to promote.  ",
        "34... Ke7 35. Rxa5 Rd4d1": "Trying to keep both Rooks on one file.  But, I think this is a mistake, as Joe will win another pawn.  In this position, I'd play 35...Ra8, as black to protect a7.",
        "36. Rxa7 Ra1": "Hitting a2.",
        "37. Kb2": "Which Joe protects, whilst counterattacking by hitting black's Ra1.  In addition, after black retreats, white is going to win, yet, another pawn by placing Boris in check.",
        "37... Rdd1 38. Rxc7+ Ke8 39. Rg7": "Hitting g6.",
        "39... Rab1+": "So, Boris protects by placing Joe in check.  After white gets out, black will add protection by bringing his Rd1-d6.",
        "40. Ka3 Rd6 41. e7": "But, it's of no use.  Boris will delay the promotion by placing Joe in check.",
        "41... Ra6+ 42. Kb4": "But, now that he's out, Joe will promote.  And, I know the technique due to studying a similar position with Jack, as Homework.  With that being said, white's next move would be 43.Rg8+  Now, Boris can't take due to white's Re2, (which is why a Rook behind a passed pawn is lethal.)  So, after, he gets out of it, white, immediately Queens with 44.e8=Q+  From there, tactical-abyss has a mate in 7.  Seeing this, Boris, resigned.  The moral of this game is what was presented in, \"The Deeper Chess Theory Club\" since it was part of the lecture.  In it, Joe said, \"Borishurgin,a nearly 1900 rated player has an abundance of positional errors in theory right out of the opening few moves,including simply bring out his Queen to start(mistake),then placing his Q in front of his exposed King on move #7,then allowing my amazing Knight fork on move # 10....which almost equalized the game within 2 pawn values by move #11.Technically,the game was over already by move # 10 in my book!Feel free to add your own comments if you like in the meantime.Notice his pawn moves in the opening 4....d5.This is not controlling the center,its only giving me more material.A common mistake that players make in my Q sac games.I spot the pattern immediately and know the game will usually end up in my favor,just from that pawn thrust move alone on blacks side.Boris was in a mating net and in serious trouble(as he knew),so he resigned early before mate and scurried away quickly.I have a game in my Q sac thread somewhere else where I beat Boris before.Perhaps it is similar,I have not checked yet. \n\nSo what is the lesson here?There seems to be a serious lack of tactics with Boris,but even more so,a weak positional strategy with things like Q thrust moves early on and doubled pawns by mid game on the g file that were open to attack and needed to be supported...and were not.Theory dictates that doubled pawns in the opening like in some Ruy games and some Trompowski Attack games either diminish the pawn value combination only fractionally or not at all.But in mid and endgame,doubled pawns are more open to attack,especially if centralized or on b or g files.This is magnified if the opposing side has a pawn majority(as I did) on my Kings side that can be utilized as an exchange,file opener to blacks King,ex-ray or P=Q on the 8th rank promotion. \n\nSure,mistakes happen in 5 minutes.But technically,that should not matter in just the first few moves of this game.Boris's \"pattern\"of erratic and weaker moves proves he needs to buckle down on just some of the simpler areas of opening theory.For even if the game was a 2 minute game with zero increment(like on some other chess sites),his early Q moves and pawn thrusts should not have occurred,especially for a nearly 1900 rated player.\""
    },
    "url": "https://gameknot.com/annotation.pl/q-sac-know-your-principles?gm=60311",
    "gameName": "Q Sac-\"Know your Principles\"",
    "players": "tactical-abyss (2370) vs. boriskhurgin (1848)",
    "opening": "KP (C20), Patzer opening"
}