{
    "moves": {
        "1. d4": "Queen's Pawn, my favorite opening, as I don't usually like the white side of such openings as the Sicilian and Caro-Kann.",
        "1... d5 2. c4 e6 3. Nc3 Nf6 4. Bg5": "Standard QGD moves so far, the DSB develops to g5 before white plays a solidifying e3 push, so as the dear bishop doesn't end up trapped behind his own pawns.",
        "4... Bb4": "This move is more unusual, but you can't really say it's inaccurate since it's still development. More typical in the position is 4...Be7 or maybe 4...c6 transposing into a Semi-Slav",
        "5. e3 Bxc3+": "This I don't agree with, as trading a bishop for a knight so early is ill-advised in my eyes (unless provoked), seeing as it's much easier to open a position than to close it. These doubled pawns are of no trouble to White either, as c3 further strengthens the all important d4 pawn, and c4 does a good job contesting d5, and can always be traded off if need be. Better than this was 5...O-O, 5...Nbd7 and 5...Nc6",
        "6. bxc3 dxc4": "This was also inaccurate, as this allows my LSB to develop in one move. ",
        "7. Bxc4 h6": "Again, I didn't like this, as my DSB wasn't much of a nuisance on g5. Black needs to castle and develop.",
        "8. Bxf6": "Disregarding my earlier rule, but the bishop had to move, and I didn't feel it was much needed anymore at this point.",
        "8... Qxf6 9. Nf3 Nc6 10. O-O O-O 11. Bd3 b6": "Terrible mistake, as this allows the winning move",
        "12. Be4": "The knight is skewered to the rook and all defenses fail.",
        "12... Bb7 13. Ne5": "Black will end up losing material.\n",
        "13... Nxe5 14. dxe5 Qxe5 15. Bxb7": "Black is down material now and the win should soon follow",
        "15... Rab8 16. Bf3 c5 17. Rc1 Rfd8 18. Qa4 Qc7 19. Rfd1 b5 20. Rxd8+": "Black should be trying to avoid these trades",
        "20... Rxd8": "Qxd8 would hold on to the pawn, but either way the position is lost",
        "21. Qxb5 Rd2 22. a4 Ra2 23. Rd1": "An extra piece, control of the open file and pawns to target would make the win easy, and from here black resigned."
    },
    "url": "https://gameknot.com/annotation.pl/qgd-gets-aggressive?gm=44433",
    "gameName": "QGD gets aggressive? ",
    "players": "go4broke (1200) vs. drbenoc  (1559)",
    "opening": "QGD (D50), 4.Bg5"
}