{
    "moves": {
        "1. e4 d5 2. exd5 Nf6": "This is one of my main openings as Black against 1.e4.\nMy main fear in playing this is the 3.Bb5+ line, which I have had very little experience with outside of blitz.\nThe lines with 3.d4 are also very good for White, and we'll see an example of this in this game.   Black is very uncomfortable early on and maybe was lucky to salvage a playable middlegame ",
        "3. d4 Nxd5 4. c4 Nb6 5. Nf3 g6 6. Nc3 Bg7 7. c5": "This seems fairly good to me because Black has to make awkward moves to fight for the important d5 square.\nWhite will develop his Bishop on c4 and there's an idea of natural development of his Q to b3, attacking both f7 and b7.\n",
        "7... Nd5 8. Bc4 Nxc3": "I settled on this after a long think.   \ne6 seemed passive, and after 8...c6 9.Qb3, I will also need to play the passive 9...e6 move since 9...Nxc3 would no longer be possible because of the in-between move 10.Bxf7+.\n\nSomething like 8...Nf6 can be ruled out because it surrenders too great of a development lead to White.",
        "9. bxc3 Nc6 10. Bf4 O-O 11. O-O e5": "I felt pretty good about being able to get this move in.   It is a pawn sacrifice, but Black gets some play for his pieces and White's c-pawns are fairly weak.",
        "12. Nxe5 Nxe5 13. Bxe5 Bxe5 14. dxe5 Qe7 15. Qd4": "At first I was surprised by this move, but I guess White can give up a tempo or two to keep his pawns.",
        "15... Rd8 16. Qe3 Be6 17. Bxe6 Qxe6 18. f4 f6": "I played this move, but I thought of playing ...f5 first.   Playing this way instead seems better because once Black trades on e5, it is no longer defended by f4.    The danger, of course, is that the pawn becomes passed and Black will need to keep a constant eye on it.",
        "19. Rfe1 Rde8 20. Rad1 Re7": "I'm not sure if this is the right sort of idea.     Comments welcome.",
        "21. Rd2 Rae8 22. Rde2 fxe5 23. fxe5 Rd7 24. g3 Red8 25. c6": "Maybe I should have tried to play c6 myself....",
        "25... Qxc6 26. e6 Re7 27. Qxa7": "I thought White going for this pawn through c6 was a mistake at first, and maybe it is.    But White is able to get his Queen back into play by playing Qa3 next, not allowing Black to play Qc5+.   So maybe it's fine or even best.",
        "27... b6 28. Qa3 Rd6 29. Qb3 Qc5+ 30. Kh1 Rd3 31. Rc2 Rf3": "I was starting to feel I was getting an advantage here despite being down a pawn, but maybe I wasn't seeing clearly.",
        "32. Qb4 Qd5": "I had dreams of playing ...Rf1 mate, but White stops this and practically forces trades that will lead to an equal ending.",
        "33. Qe4": "!",
        "33... Qxe4": "...Qh5 might be possible, but in that case 34.Qa8+ loks good for White, I think.",
        "34. Rxe4 Kg7 35. Kg2 Rf5 36. Rf2 Kf6 37. Rxf5+ Kxf5 38. Kf3 Rxe6 39. Rxe6 Kxe6 40. Ke4 b5": "This move seems necessary.   My opponent told me there is a win in this pawn ending for White, but I haven't found it yet.   He's probably right though.",
        "41. Kd4 Kd6 42. c4 c5+ 43. Kc3 b4+ 44. Kd3 Ke5 45. Ke3 h5 46. h4 Kf5 47. Kf3 g5 48. hxg5 Kxg5 49. Kf2 Kf6 50. Ke2 Ke6 51. Kf2": "dead drawn position with black to move....  draw offered by white and accepted by black."
    },
    "url": "https://gameknot.com/annotation.pl/qrr-vs-qrr-heavy-piece-middlegame?gm=26161",
    "gameName": "QRR vs QRR Heavy Piece Middlegame",
    "players": "oppon  vs. me ",
    "opening": "Scandinavian (B01), Kiel variation"
}