{
    "moves": {
        "1. d4 d5 2. c4 e6": "J'aime mieux protéger mon pion que de prendre le pion adverse.  Ainsi après un échange de pion éventuel, les 2 pions restent face à face devant les dames.",
        "3. Nc3 a6": "Pour empêcher Nb5.",
        "4. cxd5 exd5 5. Nf3 h6": "Encore une fois, pour empêcher Ng5 ou Bg5.",
        "6. Bf4 Bb4 7. e3 Nf6": "J'ai hésité avec Nc6, mais j'ai préféré préparé le terrain du côté du roque.",
        "8. Qa4+ Nc6": "Ce coup permettait également de protéger mon fou.",
        "9. h3 Bd7": "J'essai de repousser la dame.",
        "10. Qc2 Qe7 11. Bd3": "Je n'aimais ma position pour roquer à cause du fou et de la dame sur la même ligne.",
        "11... g6 12. a3 Ba5 13. b4 Bb6 14. Na4 Nh5 15. Bh2": "Je veux pousser mes pions vers l'avant dans le but d'ouvrir un côté du jeu.  Je garde la possibilité du grand roque.",
        "15... f5 16. Ne5 Nxe5 17. Bxe5": "Je n'avais pas remarqué que le fou pouvait s'amener.  Je m'attendais à dxe5.  Ce coup m'a débalancé et je dois déplacé ma tour (les espace sont assez limité)",
        "17... Rg8 18. g4": "Le cavalier est perdu, j'essai de provoquer un échange avec le fou.",
        "18... Nf6 19. Rg1": "Je voulais roqué, mais j'ai remarqué que Nxb6 et je ne peux reprendre le cavalier avec le pion à cause de la dame qui clou le pion (si je roque).  J'ai donc décidé de concentrer l'action de l'autre côté du jeu.",
        "19... fxg4 20. Bxg6+": "Je n'avais vraiment pas prévenu ce coup.  Je voyais seulement hxg4.",
        "20... Kf8 21. hxg4 Nxg4 22. Bf4 Bxa4": "J'ai pris le cavalier, car si la dame vient prendre mon fou, ma tour prendre le fou en g6.",
        "23. Qf5+ Kg7": "Je sens que mes coups sont comptés.  Après analyse du jeu peut-être que Nf6 aurait été plus efficace.  Dommage de l'avoir vu après.",
        "24. Rxg4 Bxd4 25. Bxh6+ Kh8": "Encore là, je ne sais pas pourquoi je n'ai pas simplement pris le fou (Kxh6)??",
        "26. Qh5": "Je me suis auto-squeezé.  Je n'ai pas le choix, je dois enlever un fou.",
        "26... Rxg6 27. Qxg6 Bxa1": "Un coup du désespoir.  Ce fou protège tout de même la diagonale noire.",
        "28. Bg5 Qg7": "J'essai d'échanger les dames, cela enlèverai une menace.",
        "29. Rh4+ Kg8 30. Qe6+ Kf8 31. Bh6": "Évidemment... Qf7 aurait été mieux sur le coup précédent.",
        "31... Bc3+": "Je tente une dernière attaque avec les fous. (en espérant que l'adversaire aille en e1 pour un beau mat)",
        "32. Ke2": "Malheureusement, mon jeu a été déjoué.",
        "32... Bb5+ 33. Kf3 Re8 34. Rf4+ Bf6 35. Rxf6#": ""
    },
    "url": "https://gameknot.com/annotation.pl/quebec-8?gm=6743",
    "gameName": "Quebec #8",
    "players": "rocky_balboa (1773) vs. dragoneye (1490)",
    "opening": "QGD (D31), Janowski variation"
}