{
    "moves": {
        "1. e4": "Mini-tournament, I'm playing white and begin with the Open Game.",
        "1... c5 2. Nf3": "Sicilian.",
        "2... Nc6 3. d4 cxd4 4. Nxd4 Nf6 5. Nc3": "Chelyabinsk Variation.",
        "5... e5 6. Ndb5 d6 7. Bg5 a6 8. Na3 b5 9. Bxf6": "8. ... b5! was the move that gave this variation it's name, the Sveshnikov Variation. Everything so far is by the book.",
        "9... gxf6 10. Nd5 f5 11. g3": "Black could capture 11. ... fxe4 but after 12. Bg2, black can't hold onto the e4 pawn. 12. ... Bf5 is met with 13. Qe2 and black is out of defenders. 12. ... f5? is met with 13. Qa5+! with certain loss of the f5 and e4 pawns after 13. ... Kd7 (forced).",
        "11... Bg7 12. Bg2": "Defending on e5 and preparing the castle.",
        "12... fxe4 13. Bxe4 Be6 14. O-O Rc8 15. Qh5": "Threatening h7.",
        "15... Ne7 16. Rad1": "Black defended the pawn on h7 by threatenng to win the knight on d5 if white captures the pawn. And not 17. Nxe7 Qxe7 18. Bxh7? for now the white bishop is pinned with no dangerous discoveries, so black can win it at his leisure.",
        "16... Nxd5 17. Bxd5 O-O 18. c3": "Defending the c-pawn and allowing white's knight to get off of that horrible a3 square.",
        "18... Bxd5 19. Rxd5": "18. ... Bxd5? might have been the biginning of the end for black. Now his backward pawn on d6 will become problematic.",
        "19... Rc6 20. Nc2 Qa5 21. Nb4": "20. ... Qa5? was definitely not a good move for black. It puts his queen on the far side of the world and effectively removes her from the rest of the game with no compensation. As a rule of thumb, don't lock your queen in a closet, far from the action. Queens belong out of the closet.",
        "21... Rb6 22. Rfd1": "21. ... Rb6 was forced. The rook must be saved, but any other rook moves loses the backward pawn on d6.",
        "22... Rd8 23. Qg5": "23. Qg5! threatens too much for black to hold it all. The simple threat is 24. Qxd8+ and the less obvious threat is 24. Rxe5 and now black cannot capture the rook with his pinned bishop on g7, nor can he capture with the pawn on d6 for it is also pinned preventing 25. Rxd8#.",
        "23... f6 24. Qg4": "23. f6 was the only move that held it together, for a moment. The new threat is 25. Qe6+ winning the backward d6 pawn.",
        "24... Kf7 25. Rc5": "Now threatening 26. Rc7+ and 27. Qxg7. Black is busted. He tries for the material grab.",
        "25... dxc5 26. Rxd8 cxb4 27. Rd7+": "Black could have tried 26. ... Rb7 but the game ends in a king hunt: 27. Qh5+ Ke6 28. Qe8+ Kf5 29. Rd6 Kg4 30. h3+ Kg5 31. g4 Rf7 32. Qxf7 Kf4 33. Rxf6+ Bxf6 34. Qxf6+ Ke4 35. Qf5#. Still, that continuation would have been much more lively than simply capturing the white knight, for now it's white to mate in 2: 27. ... K (any), 28. Qxg7 (any) 29. Qf7#."
    },
    "url": "https://gameknot.com/annotation.pl/queen-in-a-closet?gm=22956",
    "gameName": "Queen in a Closet",
    "players": "blake84120 (1866) vs. elfin (1766)",
    "opening": "Sicilian (B33), Sveshnikov variation"
}