{
    "moves": {
        "1. e4 e5": "The usual King's Pawn Game.",
        "2. Nc3 Qf6": "It seems like Black is doing the reversed the Scholar's Mate. It doesn't compare with developement, however.",
        "3. Nd5": "Inaccurate. Better was 3.Nf6.",
        "3... Qd8": "Oh well, at least he retreated his Queen, because I don't want to win in four moves.",
        "4. Nf3 c6": "Inaccurate. Better was 4...Nc6. However, I see the point of this move.",
        "5. Nc3 b5": "A mistake. Correct instead is 5...d6.",
        "6. Nxe5 Bd6": "There are three solutions. #1. 7.Nf3; #2. 7.d4; #3. 7.f4. ",
        "7. Nf3": "Of course, I choose the first solution, but there could be other solutions besides those three.",
        "7... a5": "I see what he's doing now, but it is too late.",
        "8. Nxb5": "I give up my advantage in points for developement.",
        "8... cxb5 9. Bxb5 Nf6": "I think Black should have played this move before-hand.",
        "10. d3 h5 11. Nd4 Qb6": "There are only two solutions to this problem. #1. 12.c3 and #2. 12.Be3",
        "12. c3": "I preferred 12.Be3 over this move",
        "12... a4": "12...Ba6 looks better than this move.",
        "13. Bxa4": "Now I regained what advantage I lost.",
        "13... h4": "Black still tries to push his rook pawns, but why?",
        "14. h3": "14.g3 is probably better than what I just did.",
        "14... Ba6": "I don't think this move has a purpose.",
        "15. Qb3": "I don't like this move too much, but it works.",
        "15... Qc5 16. O-O Qe5": "If I were Black, I'd watch out for White's first Kingside threat.",
        "17. Nf3 g5": "If Black thinks that White will want an easy win for a pawn, guess again.",
        "18. Nxe5": "Actually, I win the pawn this way too.",
        "18... Bxe5 19. Bxg5 O-O": "Black is going to lose a minor piece.",
        "20. f4 Bc7 21. Bxf6 Bxd3": "I had an easy mate that starts with 22.Qd1 and goes like this: 22...Bxe4 (If not, than 23.Qg4+ wins) 23.Qg4+ Bg6 (forced, otherwise 24.Qg7#) 24.Qxh4 Bh7 (forced, otherwise 25.Qh8#) 25.Qh6 and there is no way to prevent mate.",
        "22. Rfe1": "I played this instead, and let go of the f-pawn in exchange.",
        "22... Bxf4 23. Bb5 Re8": "Did Black not just see what I was threatening?! Big mistake.",
        "24. Bxd3 Bg3 25. Qd5": "White doesn't mind trading rooks.",
        "25... Re6 26. Qxa8 Rxf6": "I wonder why he didn't take my Rook.",
        "27. Re3 Bf2+": "I lost it anyhow under one circumstance: giving up his Knight.",
        "28. Kh1 Bxe3 29. Qxb8+ Kg7": "Black's last bit of hope lies within his Kingside, and me making two blunders in a row (maybe three).",
        "30. Qd8": "30.Qe5 is better.",
        "30... Rd6 31. Qxh4 Rxd3": "32.Qg4 is a good idea here.",
        "32. Qg4+": "It's about time to bring out the unrepresented Rook.",
        "32... Kf8 33. Rf1": "That, or Rd1.",
        "33... Rd2": "33.Ke8 is forced, but still, mate is impossible to avoid.",
        "34. Qf3": "Black still had a chance to prevent this mate in one by playing 34...Rf2.",
        "34... Bc5": "Instead, he let himself get mated.",
        "35. Qxf7#": "Well, that's that. Through this game, Black's first critical blunder was where he gave up his Queen and he should be lucky that I did not find that forced mate. Black also seemed to be focusing on my Queenside until he attacked my Kingside and messed himself up."
    },
    "url": "https://gameknot.com/annotation.pl/queenside-vs-kingside-the-wrong-attacking-side?gm=42527",
    "gameName": "Queenside vs. Kingside: the Wrong Attacking Side",
    "players": "chesskingdom64 (1136) vs. hacker_1 (1120)",
    "opening": "Vienna game (C25)"
}