{
    "moves": {
        "1. e4": "e4. General king's pawn opening.",
        "1... e6": "e6. Leads into the French Defence.",
        "2. d4": "The most common moves follow, continuing with d4.",
        "2... d5 3. e5": "e5. The advance variation, generally seen as better than exd5, as this lets Black achieve equality and White is generally seen to have the advantage.",
        "3... c5 4. c3 Nc6 5. f4": "f4. This gains control on the kingside. This sets the game up for a White kingside and Black queenside game.",
        "5... a6": "a6. This is to prepare b5, gaining space on the Queenside.",
        "6. Nf3 b5 7. a4": "a4, trying to break up the pawn control of the Queenside.",
        "7... b4": "b4, instead of bxa, as after Rxp the a6 pawn will be isolated and weak.",
        "8. Be2 Qa5": "Qa5. This puts pressure on the diagonal.",
        "9. Bd2 Bd7 10. O-O c4 11. b3 cxb3": "Exchanges are needed from Black's point of view, as leaving the c pawn leads to bxc dxc Bxc leaving White a pawn up.",
        "12. Qxb3 bxc3": "This exchange is needed as well, as White still threatens to win a pawn. Now the Queenside is open but Black does not have good development on the Kingside.",
        "13. Bxc3 Qc7 14. Qc2 Nge7": "Nge7 - tries to rectify the development problem.",
        "15. Bd3 Ng6": "Ng6, preventing Bxh7, maybe winning a pawn (after g6 Bxg6 fxg6 Qxg6  the position is a Bishop for three pawns, and Black's King is exposed in the centre).",
        "16. f5": "f5. Pushing through the centre and kingside.",
        "16... exf5 17. Bxf5 Bxf5 18. Qxf5 Bb4": "Bb4. Development and threat of exchange - this is to equal white's development.",
        "19. Ng5": "Ng5. Threatening N or Qxf7.",
        "19... O-O": "O-O, cancelling the threats with safety for the king.",
        "20. Bxb4 Nxb4 21. Nd2": "Nd2. Even on the 21st move White is developing!",
        "21... Ra7": "Ra7, protecting the f pawn so the f8 rook or queen can be moved.",
        "22. g3 Qc2": "Qc2, trying to cancel some threats.",
        "23. Qf2": "Qf2. After QxQ NxQ, both White's pawn and Rook are attacked and they cannot both be defended.",
        "23... h6": "h6, removing the minor piece attack on the f pawn.",
        "24. Ngf3 Rc7 25. Rac1": "Ra-c1?! This move swaps off two rooks for a queen, which is generally seen as bad, but it is quite hard for Black to win.",
        "25... Qxc1 26. Rxc1 Rxc1+ 27. Kg2 Rfc8": "Doubling the rooks.",
        "28. Qe3 Rc8c2 29. e6 fxe6 30. Qxe6+ Kh7 31. h4 Rc2c6": "Rc6. Black realises another approach must be tried.",
        "32. Qf5 Rf6 33. Qg4 Rc2 34. h5 Ne7 35. Qd7 Nec6 36. g4 Nxd4": "Nxd4! Taking advantage of the pinned knight on d2, and if White takes he will lose both knights.",
        "37. Nxd4": "Nxd4. Although he will lose both knights, Black could otherwise play Nxf3 and win both knights anyway.",
        "37... Rxd2+ 38. Kg3 Rxd4 39. Qe7 Rd3+ 40. Kh4 Rf1": "Rf1! No need to defend the knight; after QxN Rh1 is mate.",
        "41. g5": "g5. Preventing one mate...",
        "41... Rf4#": "Rf4#. But leading to another!"
    },
    "url": "https://gameknot.com/annotation.pl/queen-or-two-rooks?gm=8030",
    "gameName": "Queen or two rooks?",
    "players": "marian_piticut (1517) vs. casmith_789 (1641)",
    "opening": "French (C02), advance variation"
}