{
    "moves": {
        "1. e4": "The King's Pawn Opening.",
        "1... c5": "This is the, \"cornerstone\" of the Sicilian, but I will not finish this defense. ",
        "2. d4": "?  This was my opponent's first mistake.  I do not know why he or she made this move because this is not a way to handle the Sicilian Defense, unless it is a Closed Sicilian.  For the Open Sicilian, 1.e4,c5 2.Nf3,d6 3.d4 is the proper continuation.  In this position, I now have a tactical advantage because I will capture his or her c4 pawn with cxd4.   ",
        "2... cxd4 3. Qxd4": "? This was my opponent's first serious blunder and will cause much bigger problems later in the game.  He or she made this move to get back a piece.  However, this opponent developed his or her queen way too early, and I am not going to take chances.  That is because he or she might bring out the bishop, and if that happens, he or she might be able to mate me early in the game.  That is how I lost to a different opponent, and that loss was my third worst game.  However, I am not going to let, \"history repeat itself\", as it is said.  ",
        "3... Nc6": "Therefore, white is now in serious trouble, and, \"This is just the tip of the iceberg\", as they say.  ",
        "4. Qc3": "In this position, white is forced to retreat his or her queen.",
        "4... e5": "I chose this candidate so that I could pin his or her queen with my bishop DSB.  That will be explained shortly.",
        "5. Nf3": "??  This was white's most serious blunder.  In fact, \"that looses immediately\", as Jack Stockel would say.  He or she should have retreated the queen because I am now going to pin the queen, as I had mentioned earlier.  How did white get into this situation?  That will be explained shortly.  ",
        "5... Bb4": "This is the first time that I have pinned the queen, and that is what made this my best game.  I usually get to pin the knight, at best, and was once able to pin the rook, but not the queen.  In this position, I am going to win that queen, and his queen will be exchanged for my DSB at best, so he resigns.  White went wrong when he or she brought the queen out in the beginning game.   It would have been better to develop the minor pieces (knight and bishop) before the queen.  It is generally better to develop the knight before the bishop and the bishop before the queen.  When you develop the queen in the beginning, your opponent is generally able to chase the queen while he or she develops the minor pieces.  After all, \"What you do in the opening will affect you in the mid-game; what you do in the mid-game will affect you in the endgame; what you do in the endgame will affect the results\", as chesskingdom64 would say.  There are also occasions where the beginning game will directly determine the outcome, and that was proven in this game.   "
    },
    "url": "https://gameknot.com/annotation.pl/queen-blunders?gm=43557",
    "gameName": "Queen Blunders",
    "players": "woutstra (1006) vs. jkarp (988)",
    "opening": "Sicilian (B21), Andreaschek gambit"
}