{
    "moves": {
        "1. g3 d5 2. Nf3 Bg4": "When playing against understated systems like the Reti I like to play hypermodern",
        "3. Bg2 Nd7 4. c4 e6 5. Qa4": "This is an interesting move, but black has a very good response since his knight is on d7 and not c6",
        "5... c6 6. cxd5 Bxf3": "His idea is to control the centre, and reposition the d7 knight on e6 preparing for a kingside attack",
        "7. Bxf3 exd5 8. O-O Nc5": "Gain of tempo",
        "9. Qc2 Ne6": "Central control",
        "10. d3 Nf6 11. e3 h5": "Gaining space and fighting for the initiative",
        "12. b3 h4 13. Bb2 Bd6 14. Qe2 Qd7 15. Nd2 O-O-O": "Black's development is complete, and his position is looking good with nice play developing on the kingside",
        "16. Bg2 Rh6": "Primitive, threatening to double on the h-file. Black would also like to play ..Rh5 followed by ..Ng4 but he defers due to the possibility of central play from white with e4. So h6 is the next best square for the rook",
        "17. Nf3 hxg3": "Open the h-file to explore attacking options",
        "18. hxg3 Rdh8": "Doubling major pieces, but no real weaknesses so far in white's position",
        "19. Rfc1": "Beginning counterplay",
        "19... Kb8": "Necessary precaution",
        "20. b4 Ng4": "Building pressure. Looking at play against g3 and unblocking the f-file to push the f pawn",
        "21. b5": "Active",
        "21... c5": "Probably best, consolidating the center",
        "22. a4": "Contesting the initiative and consistent",
        "22... f5": "Black must play actively",
        "23. a5 Re8": "Positioning the rook on the same file as the white queen, creating tactical opportunities",
        "24. b6 f4": "Black is ignoring white's real threats calculating that his attack will commence first",
        "25. Nh4 Nd4": "An interesting tactical idea",
        "26. Bxd4 fxg3": "Black intends to collect the h4 knight",
        "27. fxg3 Bxg3 28. Rxc5 Bf2+ 29. Qxf2": "Exchange sacrificing the queen for 3 pieces. In return white generates chances against the black king",
        "29... Nxf2 30. Rxd5 Qg4 31. Be5+ Ka8 32. a6": "A beautiful move",
        "32... Rxb6": "Only move",
        "33. axb7+ Rxb7": "Now watch the double pin. The black rook on b7 pinned against the king by the white bishop, and the white bishop in turn pinned against the king. Neither player is in any hurry to exchange off pieces",
        "34. Rd4 Qg5": "Continuing the pin",
        "35. Nf3": "Great move. Bxb7+ was premature and relieved black of pressure",
        "35... Qxe3": "Black intends to sacrifice his queen. This is the only move. With this move black guarantees a draw with best play since white has no pawns left to promote",
        "36. Re1 Qxd3": "A surprising move. The idea is if 37. Rxd3 Nxd3 picking up either the e5 bishop or the e1 rook",
        "37. Kxf2": "A good reply",
        "37... Qc2+ 38. Nd2 a6": "a6!  This is a very difficult move to find, and is the only move that draws. e.g. 38.. a5 39. Rd5 +/-   38.. Rf8+ 39. Kg1 (..Re8 40. Rb1 +/- or ..Qc5 40. Rb1 +/-).  38.. Qg6 39. Nc4 +/-  38.. Qc5 39. Rb1 Rxe5 40. Bxb7+ Kb8 +/-",
        "39. Be4 Qb2": "Inviting complications with a discovered attack on the black queen",
        "40. Rd7 Rxe5 41. Bxb7+ Qxb7": "Once again black wants to exchange his queen",
        "42. Rxb7 Rf5+": "A finesse that allows black to keep his g7 pawn, but the position is still a draw. Black must lose the g-pawn soon without compensation, meaning white can then sacrifice his knight on the a-pawn drawing the game",
        "43. Ke3 Kxb7": "Draw agreed"
    },
    "url": "https://gameknot.com/annotation.pl/queen-sacrifices?gm=29175",
    "gameName": "Queen sacrifices",
    "players": "1emmanouil (2151) vs. longtail99 (1908)",
    "opening": "Benko's opening (A00)"
}