{
    "moves": {
        "1. c4 Nc6": "I don't know what this opening is called.",
        "2. d3 Nf6": "Black is starting to develop his two knights.",
        "3. Nf3": "So I copy him.",
        "3... d6": " !? Hmmm.... d5 was better, and either cxd5 or c5 breaks the pawn chain. Something like Nc3, dxc4, dxc4 then Qxd1+ and it doesn't look to good for me. Luckily he played d6.",
        "4. e4": "Trying to develop my two bishops.",
        "4... e5": "Well, if he does the same, then hopefully that means I can't move d4, or can I? d4, exd4. Nxd4, Nxd4, then Qxd4, and I have an early queen. (If you want to know more about the early queen, see annotated game: Early queen effects the game)",
        "5. Nc3": "Simple developing",
        "5... Bg4": "Uh-oh, but I don't leave it, because, again, I don't want to get a early queen, nor a doubled pawn, so I move...",
        "6. Be2": "...Be2 to block it. I also prepared to castle in a situation like this.",
        "6... Bxf3": "Exactly, but do you believe that a bishop is worth slightly more (B=3 and a half, N=3 and a quarter) than a knight, or do you think they are worth the same?",
        "7. Bxf3": "Done. ",
        "7... h5": "I think your going for Ng4.",
        "8. h3": "h3's good, because 1. it stops the knight from moving to g4 & 2. it leaves a hole so when I castle, there's not much chance of back rank mate happening either.",
        "8... h4": "Walking pawns, eh? !?-?!",
        "9. O-O": "I've castled.",
        "9... g5": "? I don't think Black is watching where he is putting his pawns. What's more, it's gonna be dangerous if he's gonna castle kingside.",
        "10. Bxg5": "There we go.",
        "10... Bg7": "Sort of like copying me, just to the wrong square. Anyway, the knight's still pinned!",
        "11. Nd5": "Pushing on some pressure.",
        "11... O-O": "He wants to castle. But now the rook's moved, I can capture that black pawn on h4.",
        "12. Bxh4 Ne7": " ? Oops! I think that was just a mistake. Qd7 was the same. ",
        "13. Nxf6+": "I take it with my knight first.",
        "13... Kh8": "But he doesn't recapture at all.",
        "14. Nd5": "I move back to d5, attacking the knight. Black should've recaptured.",
        "14... Re8": "?? Hmmm...",
        "15. Nxe7": "All done and good. What do you think black shoud've done?",
        "15... Rxe7": "Now the rook's pinned!",
        "16. Bxe7": "I capture it as easy as a pie!",
        "16... Qxe7": "While the queen copes with the recapture right after.",
        "17. Bg4": "I just didn't know what to do, so I kept the queen of my bishop's diagonal, and the rook moving to c8.",
        "17... Qh4": "I'm not gonna try the threat of g3, I'm gonna move my bishop. just.",
        "18. Bd7 Qf4": "Now, I wonder why he moved there for.",
        "19. Qh5+": "I check easily.",
        "19... Kg8": "He simply moves.",
        "20. Bf5": "Trying the threat of Qh7+, but now black's defence is looking fine.",
        "20... Qh6": "Good.",
        "21. Qg4": "I pin the bishop now.",
        "21... Kf8": "The king moves, again.",
        "22. Rfc1": "People usally move Rac1, but, for the Queen and bishop both on the black square, I need to cope with the nifty Qh2+!",
        "22... f6": "Ok.",
        "23. c5": "Trying to get my rook out.",
        "23... dxc5 24. Rxc5": "Now I'm really trying to attack.",
        "24... Qd2": "But is he trying to defend himself, or attack?",
        "25. Rxc7": "Now the looks are fine.",
        "25... Qxb2": "Funny queen, I thought it was trying to defend.",
        "26. Rac1": "A rook join up.",
        "26... Qxa2": "Black does not sense what I'm up to.",
        "27. Rc7c8+ Rxc8 28. Rxc8+": "There.",
        "28... Kf7": "All good and done.",
        "29. Qg6+": "I'm gonna capture that bishop. Mate in 3., First move.",
        "29... Ke7": "Good.",
        "30. Qxg7+": "2.",
        "30... Kd6": "Aha, here come the spectacular mate.",
        "31. Qc7#": "Qd7 was the same, but Qc7 just looked more astonishing!\r\n\r\nA very fine, standard checkmate."
    },
    "url": "https://gameknot.com/annotation.pl/queen-and-rook-checkmate?gm=43315",
    "gameName": "Queen and rook checkmate ",
    "players": "oodle  vs. killingsworth9 ",
    "opening": "English opening (A10)"
}