{
    "moves": {
        "1. d4": "I am playing some higher players in this mini-tournament and I will try to use the games as instruction on good and bad moves.  ie, their good moves and my bad moves.",
        "1... Nf6 2. c4 e6 3. Nf3 b6 4. g3 Bb7 5. Bg2 Be7 6. O-O O-O 7. Nc3 Bb4": "All the opening moves are played for the Queens Indian Defence (as per game title) to whites move 7. and we begin to make our moves now.  Black to start and he opens with DB to b4 attacking my knight.",
        "8. Bg5": "I decide to attack blacks night at f3 with my DB which develops it as well.  I am forgetting that my knight at c3 is under attack and if taken will leave me with double pawns. And black will have access to 'b' file.",
        "8... h6": "My c3 knight is safe for now and black instead pushes his h pawn to h6 and kicks me off g5.",
        "9. Bf4": "I move my DB to f4 which I feel is a more central position and I leave my knight on c3 to the attack by black's DB.",
        "9... Bxc3 10. bxc3": "Now black captures my c3 knight and I retake with my b pawn and have doubled pawns on the c file.",
        "10... a5": "Black pushes his a pawn out to a5 and he has a chain of pawns and is protecting the diagonal from b4 to d6 with these pawns.  I probably should have pushed my c pawn and tried to attack on c5 and this would have broken the chain and given me more centre space.",
        "11. Bh3": "Instead I make a move with my LB to h3 (I was preparing to move my g3 pawn up so this LB was protecting g4).  I may be going to learn a hard lesson about moving your LB unnecessarily.  Perhaps a better move would have been moving my e pawn up which is a move I make and I would then have 3 pawns in a row but I seem to have forgotten this! ",
        "11... Bxf3 12. exf3": "Black decides to take my f3 knight with his LB and again I can only retake with my pawn so I will have doubled pawns again.  I don't think this is too bad on the 'f' file as it provides protection to my king.  Now there is the 'e' file for black to access but my rook is able to access too.",
        "12... d6 13. g4": "I move my pawn g3- g4 taking control of more squares around my king.",
        "13... g5": "Black moves g7 - g5 and blocks the progress of my g pawn and attacks my DB at f4.",
        "14. Be3": "I move my DB to e3 which gives protection to my f2 and d4 pawns.",
        "14... a4": "Black moves h4-h5 and I don't see that he is now bringing his flank pawns to take control of another diagonal. ",
        "15. a3": "I block this a4 pawn with a2-a3.",
        "15... d5": "Black now moves d6-d5 which attacks my pawn at c4.  I see he is also restricting my centre. ",
        "16. c5": "It seems I have only one move which is moving my top pawn of my doubled pawns on the c file to c5.  I could have taken on d5 but this would have been captured by black's e6 or I would have been left with doubled pawns on the d file.",
        "16... b5": "Black moves his pawn b6-b5 and if he moves his c7 pawn next will have taken control of the diagonal a4 to c6 with his pawns.",
        "17. Bd2": "I move my DB to d2 protecting my c3 pawn as I think that black may move his b5 pawn down to attack it.  ",
        "17... c6": "Black moves c7-c6 and his pawns are now connected and he has a very strong pawn defence while my pawns are doubled on 2 files and I am restricted by his c6 and d5 pawns from doing anything in the centre.",
        "18. Be3": "I move my DB back up to e3.  I have purely been acting in defence mode and not as white should play by making the moves with black defending.  I do not see that he is about to bring his last flank pawn to c6.  So instead I should have moved to c6 with my pawn but I would have been captured by the knight.  So black is in charge.",
        "18... Qc7": "Black moves Qc7 attacking the pawn at h2.",
        "19. Re1": "I move my rook over to E1 to take control of this file as I do not have any pawns on this file as they are doubled on the f file.",
        "19... Re8": "Black moves his rook over to e8.",
        "20. Bd2": "I yet again move my DB to d2 allowing my rook to access the e file.",
        "20... e5": "Black pushes his pawn down from e6 to e5 and he is attacking my pawn at d4.",
        "21. Qb1": "I move Qb1 accessing the diagonal to the square h7 which is free of any pieces.",
        "21... Nbd7": "Black moves Nd7 which defends his other knight at f6 which was a piece I could have launched an attack on with my queen at b1.",
        "22. Bg2": "I move my LB to allow my pawn at h2 to move to h3 whilst protecting my f3 pawn.",
        "22... e4": "Black pushes his pawn at e5 to e4 now attacking my pawn at f3.",
        "23. Be3": "I end blacks progress on the e file with my DB to e3.",
        "23... Kg7": "Black moves his king to g7 and with the pawn now at e4 my queen is prevented from commencing an attack on the diagonal to h7.",
        "24. Qd1": "I now move my queen over to protect the pawn at f3 together with the LB at g2.",
        "24... Re7": "Black moves his rook on e8 to e7.",
        "25. fxe4": "I capture the pawn at f3 this may have been a mistake as this piece was protected but it allows my queen now to access the f file.  If this pawn is retaken it is protected by my LB at g2 but the LB could be retaken by the knight at f6.",
        "25... Nxe4": "Black captures my pawn with the knight at f6.  This is difficult for me to retake as it is protected by the pawn at d5.",
        "26. Qf3": "I bring my queen to f3 and I am attacking the pawn at f7 but this is protected by the rook at e7.",
        "26... Nxc3": "Black moves his knight to c3 which allows the rook to attack down the e file.",
        "27. Bf1": "I move my LB to f1 to provide defence on the e file should it be needed.",
        "27... Ne4": "Black moves the knight back to e4.",
        "28. Qh3": "I move my queen over to h3 in order to try an alternative attack on the king from the h file.",
        "28... Rh8": "Black moves his a8 rook over to h8 in order to thwart my attack on the king.",
        "29. f4": "I push my pawn f2 to f4 attacking the g5 pawn protected by my DB at e3.",
        "29... gxf4": "Black captures my pawn with his g5 pawn but this is protected by the queen at c7.",
        "30. Qf3": "I move my queen to f3 looking to provide defence to my DB which black may capture since we are unable to capture the pawn due to the black queen defending.  I could have moved my DB but it would have involved taking it down to c1 and this would have meant the rooks were no longer together and if I had moved it to d2 or f2 black could have captured with his knight.",
        "30... fxe3": "Black captures my DB and I could capture with my rook or my queen although my queen is on the f file and I want to try to launch an attack on this file.",
        "31. Re2": "I do not capture the pawn at e3 but I move my rook to e2 looking to move it across the possibly g file and attack the king.",
        "31... Ng5": "Black moves his knight to g5 allowing the rook again to have access to the e file and this means I cannot capture the pawn at this stage.",
        "32. Qf5": "I move my queen f3 to f5 using my pawn at g4 as protection.",
        "32... Nf6": "Black moves his d7 knight to f6.",
        "33. Bg2": "I move my LB in front of the king at g2 as the black queen is at c7 on a clear diagonal and there is no pawn in front of my king.",
        "33... Qd7": "Black moves the queen to d7 and is attacking my queen at f5.",
        "34. Rf1": "I bring my rook from a1 to f1 and white looks good for an attack on the king.  However I seem to have forgotten the queen is at d7 and therefore is liable to attack.",
        "34... Qxf5 35. gxf5": "I feel I probably was not looking too bad up to now but it looks like my chance has gone with my queen.  The way black has blocked the centre with the pawns is not only bad for me but I feel it is bad for black too.  So despite black having more pawns it really does not show the real picture.  All he has is an extra piece and one passed pawn. ",
        "35... Rb8": "Black now moves his rook h8 to b8.",
        "36. h4": "I attack the knight at g5 with a pawn move h2 to h4.",
        "36... Ngh7": "Black moves his knight to h7.",
        "37. Rf4": "I now push my rook up to f4 this may prevent black trying to bring his rook down.",
        "37... b4": "Black now pushes his b pawn but I have a pawn at a3 and I am not concerned about the push as I have a LB which can cover the b1 square.  I do not wish to use my rooks as they are strategically placed.",
        "38. Bf3": "I begin to move my LB across with a move to f3.",
        "38... b3": "Black pushes his b pawn again.",
        "39. Rg2+": "I now check the king with my rook at g2.",
        "39... Kf8": "This means the king has to move and he goes to f8.  This allows me to move my LB again.",
        "40. Be2": "I move my LB to e2 and should be in time to pick up the soon to queen b pawn.",
        "40... b2": "Black pushes his b pawn down once more to b2 now.",
        "41. Bd3": "I am now ready to pick up the queening pawn as my LB is at d3.",
        "41... b1=Q+ 42. Bxb1": "Black queens and I pickup although there is a rook at the top of the b file and I will be captured but at least black does not have another piece on the board for me to defend against.",
        "42... Rxb1+ 43. Kh2": "Black captures my LB checking my king and I move my king over to h2 and out of check.",
        "43... e2": "Black now moves his passed pawn on the e-file to e2.  I feel I have a chance to interfere with this attempt.",
        "44. Rg1": "I move my rook from g2 to g1 attacking the rook at b1 protected by my king.",
        "44... Rxg1 45. Kxg1": "Black captures my rook and I capture the rook with my king.",
        "45... e1=Q+ 46. Rf1": "So pawn queens and I move my rook f4 to f1 and the rook stops the check.",
        "46... Qg3+ 47. Kh1": "The black queen moves to g3 to check my king and I move to h1 and out of check.",
        "47... Re2": "Black brings down his E7 rook to e2 and I can see that its probably all over and I resign.  \n\nWhat do you think about my game?  I thought I made a good fist of it against a higher rated player and I find myself not feeling scared but looking forward to following my plan and seeing what happens."
    },
    "url": "https://gameknot.com/annotation.pl/queens-indian-defense-old-main-line-7-nc3?gm=61555",
    "gameName": "Queen's Indian Defense, Old Main Line, 7. Nc3 ",
    "players": "milly64 (1025) vs. martin_ruhl (1582)",
    "opening": "Queen's Indian (E18), old main line, 7.Nc3"
}