{
    "moves": {
        "1. e4": "So, the first two moves are conventional.",
        "1... e5 2. Qh5": "Getting ready for the sac.",
        "2... Nc6": "I would've played 2...Nf6, but even so, it does not make a difference against this opponent as Joe's next move is the same.  As noted, black must be careful from here on in because removing the weakest pawn also means having an exposed King which is something to be weary of.  And, this is where I start finding it to be instructive.",
        "3. Qxf7+ Kxf7 4. Bc4+": "After taking back, Joe delivers check, which Dan gets out of.",
        "4... Ke8 5. Nf3": "Joe develops and prepares to castles.",
        "5... Nf6": "And, Dan also develops.",
        "6. O-O": "Meanwhile, Joe gets his K to safety.",
        "6... Be7": "Continuing with his development.",
        "7. d3": "With Joe's Q gone, 7.d4?? isn't possible as it would result in the loss of a pawn, and if TA were to take back, now he'd lose another piece without compensation.  At that point, it would, surely, be lost.  But, he is preparing for an eventual d4, as we're about to see.",
        "7... d5": "Meanwhile, Dan wants to exchange, and Joe is going to accept.",
        "8. exd5 Nxd5 9. Re1": "Centralizing his Rook, which is, generally, a good idea, especially because he is also attacking e5.",
        "9... Bf6": "So, Dan protects.",
        "10. d4": "And, now, it is safe to play this.  The idea being is that not only is e5 directly pinned, but with this move, it's attacked.",
        "10... Bg4": "?? Developing another piece, whilst putting pressure on white's Nf3.  Normally, I'd only give this one inquiry, but according to Joe, this is the losing blunder.  In it, he said, \"By move # 10,with my d4 thrust,attack on blacks e5 pawn with major piece support and Rook file domination,my opponent is doomed early in the game\"  By early in the game, he's implying that it starts here.",
        "11. dxe5 Bxf3": "In this position, I would've played 11...Bxe5, or 11...Nxe5 to prevent a passed pawn.  But, as noted, Dan is in trouble because white would still get a piece back with 12.Nxe5  From there, it might have continued with 12...Nxe5, 13.Rxe5  From there, he'd also liquidate while ahead.  But, even if the last two moves didn't happen, Joe's position is better.",
        "12. exf6+": "By taking and getting the discovered, Joe will win back another piece.",
        "12... Kf7 13. gxf3 Re8": "Centralizing his Rook and threatening to Re1.  But, playing this Joe will exchange.  Normally, it's a good to exchange while ahead.  However, I deem this to be an exception since Joe is a much stronger player.  In fact, he's stronger then anyone that I've played against, and he knows how to counter this.  Knowing something of that accord and extent, will often put the opponent in worse shape, in the aftermath.  In addition, this exchange is, not only going to cost Dan a pawn, but in return, Joe will have a passed pawn, which is known to be very dangerous.",
        "14. Rxe8 Kxe8 15. fxg7 Nce7": "Preventing white from promoting.",
        "16. Bg5": "But, Joe has other ideas, as he pins black's Ne7 (which happens to be a dangerous Knight.",
        "16... Kf7": "The idea is to win a pawn.",
        "17. Nc3": "But, Joe has answer to that, as well.",
        "17... Kxg7": "That's because by taking, Joe will win back another piece, as Dan's Ne7, is still pinned which is, yet, another example of where, \"To take is a mistake.\"",
        "18. Nxd5 Qd7": "?? Breaking the pin, but Dan forgot that this is going to lose a piece.  The only alternative (which would've broken the pin, as well) was 18...Qe8  With that being said, Joe will wind up ahead, as opposed to, behind.  This is also why exchanging on e8, earlier wasn't a good idea.  You might have been ahead, but now that black has made mistakes and winds up behind, liquidation now ends up in white's favor.",
        "19. Bxe7 Re8": "Doing what he can to stay in, which is why Dan attacks the center.",
        "20. Re1": "As usual, Joe has an answer.  However, I would've played 20.Nf6, to fork his Q and R.  The idea being is that Dan can get out of this.",
        "20... c6": "But, he fails to by hitting Nd5.  Instead, I would've played 20...Qa4, not only preventing further damage, but reattacking by hitting the Knight.  With this move, however, Joe will fork at once.  ",
        "21. Nf6 Rxe7": "! Best, as anything loses a Queen for the Knight, or a Rook.  By playing this, Dan will get two minor pieces, in return.  However, against a player of Joe's strength, after 21.Nf6  However, Dan will not much longer.",
        "22. Nxd7 Rxe1+": "That's because Dan does what he can to get counterplay.",
        "23. Kg2": "But, after this, however, Dan resigned."
    },
    "url": "https://gameknot.com/annotation.pl/queen-sac?gm=60399",
    "gameName": "Queen Sac",
    "players": "tactical-abyss (2370) vs. danieljacobson (1924)",
    "opening": "KP (C20), Patzer opening"
}