{
    "moves": {
        "1. d4 d5 2. c4 dxc4 3. Nf3 g6": "This was my second game verses jwpatzer. He won the first game. I noticed he played very sounds moves and advanced his army very thoughtfully.",
        "4. Bf4 b5": "I do notice my pawn structure is wide open and I'm hopeing to not make myself too vulnerable.",
        "5. e4": "I get the feeling jwpatzer is less concerned with material equality and more focused on tempo & controlling the center.",
        "5... Bg4 6. Be2 Bg7 7. Nc3": "Starting to like this!",
        "7... Bxf3 8. Bxf3 Bxd4 9. Nxb5 Nc6 10. Nxc7+": "Uh oh, starting to not like this!",
        "10... Kf8 11. Nxa8 Qxa8": "Now I see this as a big shift in the game's dynamics. I now have a better grasp of the center, but jwpatzer has gained a material advantage and prevented me from castling.",
        "12. e5 Bxb2 13. Rb1 Bc3+ 14. Kf1": "Guess this returns the favor with castle prophylaxis. Jw could have blocked with 14  Bd2  but after I ... Bxb2 then 15. Qxb2 I would be able to ... Ne5. At that point we would have equality on points, but I would favor my position. Kf1 is not a bad move.",
        "14... Qc8 15. g3 Qh3+": "At this point my 8 year old son had to take over for me. I went to Nigeria on a mission trip and while there I could not log in to gameknot.com. Instead of timing out I asked my kid to make moves for me while I was gone for three weeks. ",
        "16. Bg2 Qc8 17. Qe2 Qf5 18. Rd1 Nxe5 19. Rc1 Bd4 20. Bxe5 Bxe5 21. Qxc4 Kg7 22. Qe4 Nh6 23. Qxf5 Nxf5 24. Ke2 Rd8 25. Rhd1 Nd4+": "I think I'm back in the game at this point.",
        "26. Kf1 f5 27. Rc5 Ne6": "I didn't initially like the idea of moving my knight backwards, but in this case I felt it worked well.",
        "28. Rxd8": "Given the choice presented I had to opt for Nxc5 instead of Nxd8.",
        "28... Nxc5 29. Ra8 a6 30. Ke2": "Typically moving the king into the middle works in an end-game strategy.",
        "30... Bd4 31. Bd5 e6 32. Bc4": "This proves to be costly for jwpatzer in a few moves.",
        "32... Ne4 33. f3 Nc3+ 34. Kd3 e5": "Really starting to like my position now!",
        "35. Rxa6 Nd1 36. a4": "This move may be the biggest reason I won the game.",
        "36... Nb2+": "This bishop-grabbibg move drastically swings the advantage my direction!",
        "37. Kc2 Nxc4 38. Kb3 Nd2+ 39. Kc2 Nxf3 40. Rd6 e4 41. Kd1 e3 42. a5": "The race is on!",
        "42... Bc3 43. a6 Nd4 44. Re6": "Not sure why white does this.",
        "44... Nxe6 45. a7": "Jwpatzer is down too much on time at this point.",
        "45... Nd4 46. a8=Q e2+": "White resigns one move prior to an inevitable checkmate. This game was very difficult and very fun. To jwpatzer I say, \"good game!\""
    },
    "url": "https://gameknot.com/annotation.pl/queens-gambit-accepted?gm=55633",
    "gameName": "Queen's Gambit Accepted!",
    "players": "jwpatzer (1692) vs. tulsatallguy (1551)",
    "opening": "QGA (D21), 3.Nf3"
}