{
    "moves": {
        "1. e4": "A strong lead in development does not win itself, especially after most of the pieces are traded off. This game culminates in an exciting race between two opposing passed pawns after only the queens and pawns are left.",
        "1... e5 2. Nf3 Nc6 3. Bb5 Qf6": "This seems dubious, as it prevents Nf6. Black may lose some time with the exposed king, but it doesn't lose on the spot.",
        "4. Nc3 Nge7 5. Bxc6 Nxc6": "dxc6!, which is thematic in the Exchange Ruy Lopez, would have put a firm clamp on the important d5 square and threatened a strong Bg4. The move my opponent played is considerably inferior.",
        "6. Nd5 Qd8": "Perhaps my opponent had thought about Qg6, which isn't as complicating as it may seem at first. White can grab the rook an a8 and run.",
        "7. c3": "Preparing d4 to add to White's strong lead in development.",
        "7... a6": "I also like d6 here, which Black plays on the next move anyway.",
        "8. d4 d6 9. h3": "There is no reason to allow Bg4 here, as the knight keeps an eye on the tension in the center.",
        "9... h6 10. O-O Be6 11. Ne3": "Threatening the pawn fork at d5.",
        "11... exd4 12. cxd4 d5": "A direct challenge to White's strong center, and no doubt the best way to deal with the threatened d5.",
        "13. e5": "Trading on d5 would leave White with a very weak isolated d-pawn that would take up too much time to defend.",
        "13... Be7 14. a3 Bg5": "Under no circumstances should White allow the h-file to be opened. After 15.Nxg5 hxg5, Black would have strong threats, including 16...g4.",
        "15. Nc2 Bxc1 16. Rxc1 O-O": "Now, Black threatens to isolate White's d-pawn again by trading off White's e-pawn with ...f6.",
        "17. Re1 Qe7": "17...f6 was also possible.",
        "18. Qd2": "I saw that the e-file was about to be opened, and wanted to double my rooks there, and this move not only cleared the way but prevented 18...Na5.",
        "18... f6 19. Re2 fxe5 20. Nxe5 Nxe5 21. Rxe5": "21.dxe5? would make the pawn a lot harder to hold on to after 21...Rf5.",
        "21... Qf6 22. Rf1": "Defending f1 so that the queen is free to move elsewhere.",
        "22... Rae8 23. f3": "I'm not sure about this move. It weakens White's queenside a lot.",
        "23... Qg6": "Threatening 24...Bxg3, which would all but win the game on the spot for Black.",
        "24. Kh2 Bf5 25. Ne3 Bd3 26. Rxe8 Rxe8 27. Re1 Bc4 28. Nxc4 dxc4 29. Re5": "This is one of the most important moves in the game for White. Capturing on e8 would hand Black the e-file. Black would have a strong advantage on the kingside, and White's queenside play may not have been fast enough. Allowing Black to capture on e1 would displace White's queen and allow a devastating ...Qc2 for black.",
        "29... Rxe5": "This gives White a strong passed pawn. If Black hadn't captured here, I probably would have played Qe2 next.",
        "30. dxe5": "This papawn becomes very powerful.",
        "30... Qd3 31. Qb4": "Obviously, trading queens would give allow Black to queen.",
        "31... Qb3": "White has to let the b2 pawn go and trust that his e5 pawn can provide enough threats to compensate. ",
        "32. Qe7 Qxb2 33. Qxc7 c3": "This pawn isn't fast enough. White's queen is positioned too well.",
        "34. e6 c2 35. Qf7+ Kh7 36. Qf5+": "36.d7?? would be a blunder in view of 36...Qe5 , which would lead to mate for Black.",
        "36... Kg8 37. e7": "Mate is now forced.",
        "37... Qf6 38. e8=Q+": ""
    },
    "url": "https://gameknot.com/annotation.pl/queens-of-the-stone-age?gm=6647",
    "gameName": "Queens of the Stone Age",
    "players": "kansaspatzer (1550) vs. manhattan (1515)",
    "opening": "Ruy Lopez (Spanish opening) (C60)"
}