{
    "moves": {
        "1. e4": "Every chess player experiments with openings at sometime. We all search for the one opening that will give us a big advantage the majority of the time. Well, their ain't one! Once you learn that and play for equality and maybe a minimal advantage or initiative the sooner you'll move on to solid chess. I myself learnt that when playing the color black here. I was trying to hard to pull off swindles and turn the tide towards black's favor. \r\n\r\nWhen learning an opening its important to understand its goals and purpose. The opening here is King's Gambit, Falkbeer Counter Gambit. \r\n\r\nThe Falkbeer is a hard opening to understand for lots of intermediate players. --- more on this after the opening moves.",
        "1... e5 2. f4": "King's Gambit. Whites usual goal here is to open up the f file for his rook after castling short. If he can exchange a center pawn of white's for the f pawn all the better.",
        "2... d5": "The Falkbeer Counter Gambit. Black is gambiting a pawn, e5, for  positional advantages. He hopes to undermine the purpose of white's opening by not taking the f pawn and not allowing the file to be half open for white's rook.\r\n\r\nHe is offering (gambiting) his e pawn. Taking this pawn is considered unsound for white due to 3.....Qh4 and the old beginners type trap - 4.g3,  Qxe4ch  5. white blocks with Q, B or N on e2......QxR. The alternative for white being a king move and the loss of castling with a poor position.",
        "3. exd5": "The sound way to play against the Falkbeer. White will gain a tempo if Qxd5 and white plays Nc3. The black queen will have to move again.",
        "3... Qxd5": "This isn't the best move for black. Stronger is e4, advancing the center pawn and giving white problems to solve. The pawn can be supported by f5 and also Nf6. The pawn at e4 takes away Nf3, the usual and best placement of the knight.  If white plays the version of the King's gambit where this is a standard move then white is out of his comfort zone.",
        "4. Nc3": "Gaining tempo (time) as black must move the Q again. ",
        "4... Qe6": "Lets keep count of the black's Q moves, shall we ; \r\n  \r\nAs the Count on Sesame Street would say: \"Thats 2 Queen moves, Two moves.\"",
        "5. fxe5": "Opening up the f file as originally planned.",
        "5... Qxe5+": "Thats 3 Queen moves.",
        "6. Be2 Qg5": "Thats 4 Q moves. Striking at the undefended g pawn.",
        "7. Bf3": "Defending the pawn.  A tactic here could be Nf3 ignoring the pawns safety. If Qxg2 then Rg1 gives white a strong attack on his Q side.  Another similar tactic is 7. d4 and now if Qxg2 then Bf3 again with open lines for a king side attack for white.  ",
        "7... Bd6 8. Nge2 Ne7": "Instead black could of played Qh4. Yes this doesn't get you the rook due to the knight being on e2. After g3 black could play Bxg3 (if the knight wasn't there) and after h2xg3 the Q takes the rook. Maybe that's why white put the Knight there.  But moving Qh4 does force white to play g3 as Ng3 gets you the rook after BxNch. \r\ng3 weakens the castled position of white if he was to castle this side. So its a prophylactic type move. ",
        "9. d4 Qf5 10. O-O": "Accomplishing white's original goal.  Also puts a rook on the same file as the opponents queen. As Jstevens has referred to in an earlier annotation, a good thing as you never know what might happen.",
        "10... Qd7": "Anticipating 11. Bxb7, Q moves and BxR or 11. Bxb7, Qxf2ch, 12. Kxf2, Bxb7 trading a queen and pawn for a rook and bishop.",
        "11. Ne4 O-O 12. Nxd6 Qxd6": "Not cxd6 as this gives black an isolated pawn which can be a hindrance or weakness. Thats 7 queen moves now.",
        "13. Bf4": "Developes a bishop fully. Fully in that it has an X-ray type attack, it can move in four directions next. Compared to the c8 bishop that is partially developed. Makes the queen move yet again. #8",
        "13... Qd8": "So lets sit back and analyze the position so far. This is something we should do more often. It is clearly into the middlegame now. Here I go!\r\n\r\nBlack: Castled, a knight developed, a bishop partially developed and her queen back home on d8 after moving 8 times out of 13 total moves. Clearly playing around.\r\n\r\nWhite: Castled, half open f file with a rook at its base, knight developed, two bishops fully developed, ownership of the center. Clear advantage for white.\r\n\r\nBlack is not lost yet, but needs to quickly catch-up in developement.",
        "14. c4": "Further controlling the center.",
        "14... Nd7": "Not Nc6 due to d5 after.",
        "15. Qc2": "Getting the queen off the back rank and joining the rooks. This is a goal of most middle games. Oh! and moving the queen for the first time.",
        "15... Ng6 16. Bg3": "Not wanting to exchange bishop for knight here. The two bishops side by side are a strong battery.",
        "16... Nf6 17. Rad1": "The rook on the same file as an opponents queen, again.",
        "17... c6 18. Nc3": "Better developing the knight. A knight gains strength every rank it advances generally till the 7th rank. ",
        "18... Bg4 19. d5 Bxf3 20. Rxf3": "The exchange gives white the half open file he wanted.",
        "20... cxd5 21. cxd5": "and now white has an isolated pawn as well as apastpawn, or is that passed pawn. ",
        "21... Qb6+": "#9",
        "22. Bf2": "Why not. It makes her move again. #10",
        "22... Qa6 23. Bd4": "Moving to join the king side attack.",
        "23... Nd7": "Not wanting Bxf6, gxf6 which opens up the castled position. Black's queen can't help due to the rook on f3.",
        "24. Qf5 Nb6": "Attacking the future dangerous pawn.  Notice how this move blocks black's queen from helping with king side defense if needed. The black queen can only move to a5 or c4 now.",
        "25. Qg5": "Do you see white's plan? Take a moment and ask why the queen moved here. The answer will follow.",
        "25... Rad8": "Attacking twice at d5 but guarded twice, so no need to react here by guarding it more. Now white is able to do his plan.",
        "26. h4": "Trying to force the knight away and its mate at g7. ",
        "26... h6": "Forcing the queen away. But she stays on the same file to keep pressure on the knight.",
        "27. Qg3 Nxd5": "Black grabs the pawn as its only guarded once now that the white queen moved. ",
        "28. h5": "but white continues his plan. The knight is toast as it can't move due to mate after.",
        "28... Nxc3 29. bxc3": "Here black has a somewhat saving move. She could of played Rxd4 which removes the mate threat. It looses material (5 for 3) for a deficit of 2 points.  cxd4 then allows the knight to move which keeps the castled position intact.",
        "29... Qxa2 30. hxg6 fxg6": "This way opens up the black fortress and looses more material 4 vs 1 for a deficit of 3 points.",
        "31. Qxg6 Rf7 32. Rdf1": "Also playable was Rd2 if Qxd2 then Qxf7ch, Kh8, Qxg7mate.",
        "32... Rdf8": "This move gives it to white. Better was moving the f rook sideways. White would still have the much better game. This allows a wholesale trade off of pieces and white comes out with a bishop up still. When down material don't trade off as you limit your options to pull off a swindle or a perpetual check to save the game.",
        "33. Rf3xf7": "Much better was: Bxg7, if Rxg7, Rxf8mate. If black plays other moves afer Bxg7 then Bd4 is discovered check and black has to play Rg7 then Qxg7 is mate also. Of course white could play Qxg2 after Bxg7 or other silly moves and still loose the game.",
        "33... Rxf7 34. Qxf7+ Qxf7 35. Rxf7 Kxf7": "Simplifying down to a won ending for white.",
        "36. Bxa7 Ke6 37. Kf2 Kd5 38. Kf3 Kc4 39. Bd4": "Always have loved this set-up where a pawn and bishop have a symbiotic relationship protecting each other.",
        "39... g6 40. Ke4 b5 41. Bg7 h5 42. Kf4 b4 43. cxb4 Kxb4 44. Kg5 Kc4 45. Kxg6": "The moral of the story: Play an opening the way its meant to be. Here white was able to do that. Black did not play the gambit as it was meant to be played. Black wasted time playing around with her queen and when she was needed for defense, she was away. \r\n\r\n"
    },
    "url": "https://gameknot.com/annotation.pl/queen-plays-around?gm=12722",
    "gameName": "Queen plays around!",
    "players": "dmaestro (1542) vs. jstevens1 (1513)",
    "opening": "KGD (C31), Falkbeer counter-gambit"
}