{
    "moves": {
        "1. d4": "Queen Pawn.",
        "1... d5": "One of the most popular replies.",
        "2. Nf3 Nf6": "Developing.",
        "3. e3": "Wanting to play c4.",
        "3... Bf5": "Develops the bishop.",
        "4. c4 e6": "Protected.",
        "5. Nc3": "Putting pressure on the d5 pawn.",
        "5... Bb4 6. Bd2 Bxc3": "Some think prefer the bishop over knight, thus not liking this move. I see no problem with it.",
        "7. Bxc3 Bg4": "Awww, man. Another pin??",
        "8. Qb3": "Threatening Qxb7, which I now realize only wins a pawn after Bxf3 9. Qxb7 Nbd7 10. gxf3.",
        "8... b6 9. Be2": "Not wanting to double pawns.",
        "9... Nc6 10. O-O-O a5": "I think black should be trying to find a way to threaten the knight on f3, not wasting moves like this.",
        "11. Qb5 Qd7 12. h3": "Not wanting the bishop pinning my knight anymore, I threaten the bishop and force it to swap or retreat.",
        "12... Bxf3 13. Bxf3 O-O": "Finally castles.",
        "14. g4": "g5 threatens the knight protecting the pawn on d5, then I can win the pawn.",
        "14... Nb4": "Queen swap or free pawn… Or both.",
        "15. a3": "I like this move.",
        "15... Qxb5 16. cxb5 Na2+": "Meh. After capturing the bishop I will no longer have doubled pawns on the b-file, because I will win take the knight with my pawn on b2.",
        "17. Kb1 Nxc3+ 18. bxc3": "Liking my position.",
        "18... Rfc8 19. c4": "Good move, the pinned pawn is under pressure.",
        "19... c6": "Okay.",
        "20. g5": "After the knight retreating, I will eliminate the pawn on c6 and win the pawn on d5, and if the pawn on e6 takes back I will capture it, pinning rook to rook.",
        "20... Nd7 21. bxc6 Rxc6": "Now for the free pawn.",
        "22. cxd5 Rc3": "I will receive another free pawn.",
        "23. dxe6": "Beautiful. The pawn threatens the knight and the bishop threatens the rook.",
        "23... Rd8 24. exd7 Rxd7": "I am now in a very good position.",
        "25. Kb2": "Threatening and protecting.",
        "25... Rcc7 26. Rdc1 h6 27. Be4": "I don't know why I did this.",
        "27... hxg5 28. Rxc7 Rxc7": "Swaps rooks.",
        "29. Rc1": "Wanting to get rid of all the rooks and dominate with minor pieces.",
        "29... Rxc1 30. Kxc1 g6": "With doubled up pawns, It is now pretty much a bishop, a king and five pawns against a king and four and a half pawns.",
        "31. Kc2": "Wanting to get my king into the action. The most important and protected piece is deadly in the endgame.",
        "31... f5": "This doesn't do much.",
        "32. Bd5+ Kf8 33. Kb3": "Wanting the pawns on b6 and a5.",
        "33... Ke7": "The king can only defend one of the groups: g5, f5 and g6 or: a5 and b6.",
        "34. Ka4 Kd6": "The king goes for the smaller group.",
        "35. Bf7": "The pawn is unable to be saved, and my opponent resigns."
    },
    "url": "https://gameknot.com/annotation.pl/queen-pawn?gm=44308",
    "gameName": "Queen Pawn",
    "players": "strepsil999 (1434) vs. caran (1200)",
    "opening": "Queen's pawn game (D04)"
}