{
    "moves": {
        "1. d4": "At the time I was experimenting with the Queens pawn game so I started with d4 as opposed to my usual e4.",
        "1... d5": "The common response d5 followed.",
        "2. c4": "I really enjoy the queen's gambit and it's positional perks.",
        "2... e6": "Black responds with e6, which I think is a little weaker than c6 based on my experience. ",
        "3. Nf3": "As opposed to the usual Nc3 I developed the other knight first. My general strategy for this game was to attack the king-side strongly ready to strike with force if black decides to castle short. ",
        "3... Nf6": "Black brings his knight up adding defense on the attacked d5 square while eyeing the e4 as a possible resting spot.",
        "4. Bg5": "Advancing aggressively to the king-side with the bishop. Pinning pieces is always nice.",
        "4... Be7": "Black brakes the pin getting ready to castle short, which I liked since that is where I'm applying the most pressure so I knew it was going to be a fun game.",
        "5. Nc3": "I developed the other knight attacking the center.",
        "5... c6": "Black further defends his d-pawn with c6, which I think was kind of an unnecessary move at this point as the pawn was already defended by the knight and the queen. Was black possibly thinking of Qa5 to attack queen-side and pin my knight? This move also blocks his knight from coming to c6 so it really is a rather defensive move. ",
        "6. cxd5": "I attack the center now just for the sake of being aggressive and opening the center I guess, but I'm not really proud of this move. Black's last move made sure that he could establish a solid center structure by taking with the c-pawn. So basically I attacked his strong point allowing him to open up the queen-side. Does anyone have any thoughts on what you had played here and why? ",
        "6... exd5": "I was surprised to see black didn't utilize his c-pawn here, but instead took with the e-pawn giving me the advantage in central pawns. This move makes way for his bishop possibly coming to g4 getting ready to pin the knight or f5 to attack my queen-side.",
        "7. e3": "To open way for the bishop and the queen. The bishop is getting ready to go to d3 so I could maybe play Qc2 later. I decided not to worry about the possible Bg4 as black couldn't really capitalize on the pin.",
        "7... O-O": "Black castles so my strategy to attack king-side stays the same . Anticipating Nd7 or Bf5.",
        "8. Bd3": " Developing the bishop as planned.",
        "8... b5": "Black decides to push his queen-side pawns early in the game. I'm not worried about him kicking my knight with b4 because I want it to get to king-side anyway. So I can still focus on the attack.",
        "9. Ne5": "Found a nice place for my knight because white hadn't played Nd7 yet. Attacks the c6-pawn forcing Black's knight to defend it for now. Bring knights to the center, amirite?",
        "9... b4": "Black advances with the b-pawn kicking the knight. Only one sensible square to go.",
        "10. Ne2": "Reinforcements for the king-side. Black blocks his queen and bishop from checking so I don't really have to worry about my kings safety yet. Optimal position for an aggressive attack.",
        "10... h6": "Black moves his h-pawn out of danger of the possible Qc2 and harasses my bishop, so the bishop has to move...f4 or h4? Which one would you choose? Or would you rather like to take out Black's knight on f6?",
        "11. Bh4": " I decided to play h4, but don't really remember why. Analyzing this game know I would say f4 would have probably been better, since I don't have a particular reason to stay at this diagonal because the pin is broken. He also has a discovered attack against my bishop. On f4, the bishop would have later had the opportunity to take part attacking the king from the e5- or possibly d6-square. Any thoughts on this?",
        "11... a5": "Black marches along the queen-side still not developing his knight or bishop. The pawn on c6 looks rather lonely, doesn't it?",
        "12. Rc1": "Developing the rook to a half-open file forgetting the king-side attack for a second. C6 is now in double attack and needs more defense.",
        "12... Bb7": "Black defends with the LSB making it \"bite granite\" as it now has control over only 4 squares. This is a huge advantage for me as the king-side is now open for more attackers.",
        "13. Ng3": "||||||\"Wait for me, I want to attack too!\", says the horse and hops to g3. (Wait...why is the bishop looking at me like that and pointing to the pawn on g7?)........ \"Oh dear\".||||||. Sort of a blunder as I didn't take losing my bishop into account  as black can play g5. I guess I wasn't expecting black to bring up his king's pawns so early in the game and ignored the threat.",
        "13... g5": "So white does attack the bishop. I sighed facing inevitable material loss.",
        "14. Bxg5": "The bishop said his prayers and charged in for the last attack.",
        "14... hxg5": "White recaptures and I'm down material, but look at the silver lining: Black's king lost some defenses and I've got my pieces in place for an attack. Black's knight on f6 is troublesome as it prevents my queen from coming to h5 or g4. What would you play here?",
        "15. h4": "15.h4, bingo! Attacks g5, looking to open h-file for my rook. At this point, I analyzed the position quite a bit looking for possible checking patterns.",
        "15... gxh4": "White captures and I can open the file! I think 15.... g4 would have been worse for me.",
        "16. Rxh4": "Black's king is probably pooping his pants right now.",
        "16... Nbd7": "Black brings up more defense on his weak king-side. Critical point now. I have to capitalize on the attack before black can start trading pieces. ",
        "17. Rg4+": "This came up to me as the best answer. Sacrificing the rook in order to start checking Black's king. ",
        "17... Kh8": "Black didn't want to lose his knight and moved the king to the open h-file. How can I bring my queen up now?",
        "18. Kd2": "Threatening checkmate with Qh1. Black has to move his knight now.",
        "18... Nxg4": "So black takes.",
        "19. Qxg4": "My queen is now armed and dangerous. Getting ready to play Rh1.",
        "19... Bg5": "Black blocks my queen preventing the loss of his queen when I play Rh1",
        "20. Rh1+": "And so it begins.",
        "20... Kg7": "Analyzing this position and looking for check-patterns was very fun and I encourage you to do the same. Then you can look at what I came up with.",
        "21. Nh5+": "Preventing the king to escape to f6. 21...Kh6 leads to checkmate with 22. Nf6+. ",
        "21... Kg8": "Retreats to g8.",
        "22. Bh7+": "I wanted his king on the h-file for the discovered attack so I attacked with the bishop.",
        "22... Kh8": "Forced.",
        "23. Bf5": "Getting ready for the discovered attack. I'm pretty sure black cant escape now.",
        "23... Rg8": "Now there is a mate in 9. Can you find it, or maybe even a quicker way?",
        "24. Nf6+": "Gaze your eyes upon this sequence and congratulate yourself if you found it!  1",
        "24... Kg7": ".",
        "25. Qxg5+": "2",
        "25... Kf8": ".",
        "26. Nfxd7+": "3",
        "26... Ke8": ".",
        "27. Qxg8+": "4",
        "27... Ke7": ".",
        "28. Qxf7+": "5",
        "28... Kd6": ".",
        "29. Rh6+": "6. here black has the option to play 29...Qf6 so this is actually a mate in 9. ",
        "29... Kc7": ".",
        "30. Nc5+": "7",
        "30... Kb6": ".",
        "31. Qxb7#": "I hope you enjoyed this annotation and had fun analyzing.\nThank you edwardphz99 for playing the game and allowing me to annotate."
    },
    "url": "https://gameknot.com/annotation.pl/queens-gambit-with-an-aggressive-attack-on-the-kingside?gm=40544",
    "gameName": "Queen's Gambit with an aggressive attack on the kingside",
    "players": "multipurposetool (1740) vs. edwardphz99 (1792)",
    "opening": "QGD (D30)"
}