{
    "moves": {
        "1. d4 d5 2. c4 e6 3. Nc3 Nf6 4. Bg5 Nbd7 5. cxd5 exd5 6. e3 c6 7. Nf3 Be7": "This is Black's most solid reply. The idea of this move is that it renders the exchange varation harmless.",
        "8. Qc2": "Rubinsteins move, the main idea is that if black does not take active counter measures whites will castle queenside and launch a pawn storm",
        "8... Nh5": "This is a familiar manoeuvre this knight will eventually find a home on d6. ",
        "9. Bxe7 Qxe7 10. O-O-O": "white can also try h3 or Bd3. ",
        "10... Nb6": "this move allows black to develop the bishop to e6 or g4",
        "11. Bd3 g6": "limits the scope of the light coloured bishop and makes room for black to manoeuvre the knight to d6.",
        "12. Kb1": "slightly increases the safety of the king",
        "12... Be6 13. Rhg1": "intending g4. However, Rc1 or Re1 are more optimistic",
        "13... Ng7": "I could have waited for white to play g4 but why give your opponent an excuse to grab space with initative.",
        "14. Rdc1": "This move along with Ne5 can create alot of preasure on c6",
        "14... Bf5": "This trade is to Black's advantage it eliminates whites stronger white bishop. As well, it assists the knights manoeuvre to D6 with a plus in tempo.",
        "15. Bxf5 Nxf5": "With the bishops of the board black has equalized. ",
        "16. Ka1": "a waiting move. ",
        "16... O-O": "castling queenside is also possible but more risky. The text move allows me to start a pawn storm on the castled king.",
        "17. g4 Nh4": "Nd6 may have been more positional",
        "18. Ne5 f6": "My first real concession This lsighty weakens the king",
        "19. Nd3 Rae8": "Not ...Nc3 when 20. Rg3 gives a real advantage on the kingside.",
        "20. Rg3 Nc4 21. Re1 Nd6 22. Rh3 g5": "Sets up a block aid and allows the knight to escape to g6 if need be.",
        "23. f3": "I do not believe that this is whites best move. It creates a serious weakness on e3",
        "23... Qg7": "moving my queen off of the e-file so that I can attack e3",
        "24. Re2 f5": "I played this so that I can utilize the f5 square to put more preasure on e3.",
        "25. gxf5 Ndxf5 26. Qc1 Kh8": "sidesteping any pins on the g-file.",
        "27. Ne5 Ng6 28. Ng4 Nfh4": "Now I have the a new threat created on f3.",
        "29. Qh1": "It is hard to believe that this is a good move. White all but abandons the king.",
        "29... b5": "with all of whites peices on the opposite wing my chances of success are very good.",
        "30. Rg3 Nf5 31. Rgg2 b4": "now I cash in my space advantage in classical style. I slowly squeeze white into an unbearable position until he not stand it anymore and force him to make a concession. Then I breakthrough with a decisive attack",
        "32. Nd1 b3": "forcing the concession",
        "33. Re1 bxa2 34. Kxa2 Qe7 35. Rge2 Qb4 36. Nc3 Nfh4": "creating a distraction. ",
        "37. Rf1 c5 38. Rd2 Reb8 39. Rc2 cxd4 40. exd4 Nf5": "Black needs three to mate and the knight is on it's way.",
        "41. Ne2": "White must not allow ...Nxd5 but can he prevent it?",
        "41... h5 42. h3 Qa5+": "black does a bit of manoevureing to create a mate threat on the a-file.",
        "43. Kb1 Rb4 44. Rfc1 Ra4 45. Rc2c3 Nf4": "deflecting the defender of D4",
        "46. Nxf4 Nxd4": "The calvary has finally arrived and the show is over. White has a few spites checks then he is done.",
        "47. Ng6+ Kg7 48. Rc3c7+": "white has a few spite threats but i",
        "48... Rf7 49. Rxf7+ Kxf7 50. Ng6e5+ Ke6 51. Rc6+ Nxc6 52. Nxc6 Ra1+ 53. Kc2 Qc5+": ""
    },
    "url": "https://gameknot.com/annotation.pl/queen-gambit?gm=13397",
    "gameName": "Queen' gambit",
    "players": "valeriuzaharia (2026) vs. elyhim (1984)",
    "opening": "QGD (D51), 4.Bg5 Nbd7"
}