{
    "moves": {
        "1. e4": "The usual.",
        "1... e6": "This time, however, black responds with the French Defense.  But, it's still in book and follows the main lines.",
        "2. d4 d5 3. Nc3": "I think, I would've exchanged here with 3.exd5, exd5  But, I like this move better.  Remember when I talked about those complicated variations that I watched by GM Susan Polgar in the French Defense involving the Terrasch Variation where white kicks the Knight?  Well, that is going to happen here, and with that, I'm quite familiar with this.  Although I forgot about and moved on (for the obvious reason since I couldn't remember) the variations I studied with the Owen's and Grunfeld defenses, I didn't forget about the Tarrasch Variation.  In part, it was because it was by my favorite GM, and the lines I studied were not only more common but much more difficult as well since it involves more theory.  One reason being is the same, as if black were to play 4...Bc5 in the Ruy Lopez.  The idea is that white will get a solid pawn chain which Susan notes.  Therefore, I remembered even more of them and mentioned a little about this in bipolarcorners annotation, in his game against Reuben.  So, the next few moves are still book and part of that variation.  In fact, this game will help remember Terrasch even better since it actually happens here.",
        "3... Nf6 4. e5 Nfd7 5. f4": "If I recall correctly, Susan mentioned that f4 is often played in this variation to add another defender to e5.",
        "5... c5": "I think that this is also part of the mainline where black intends to exchange.",
        "6. Nf3": "But, Joe plays this, instead.",
        "6... Nc6": "I think this is, as far as, I remember in that video.  But, Susan said that this is a common move as black not only develops but both Knights are working together to control the center.",
        "7. Be3": "Meanwhile, Joe continues with his development.",
        "7... Be7": "So does black, and by doing this, he is one step closer to castling.",
        "8. Qd2": "Unlike before, I don't know why Joe played this.  Instead, I would've completed development, as white bringing my Bf1 into play.  But, my inference is that it doesn't need to come out right away since this is his good bishop.  I think the idea is that, once he castles, both rooks will be connected.  If so, I do see the point.  Back then, I use to say pointless, but with stronger players, I've learned to say that I don't see the point.  In Joe's case, however, I'll at least try and often see the point in all of his moves.  The reason being is that what he says makes more sense to me then average.  Therefore, it becomes second nature quicker then your average player. ",
        "8... O-O": "Black castles, but I would've played 8...Nb6 and then castled because he's up against a stronger player.  Since this is not a Ruy Lopez, theory does not say anything about castling, sooner (to my knowing.)  I say this because tipsyjourneyman said that against stronger players, you often finish developing, and then, as the last part of it, you castle, as Joe did.",
        "9. Be2": "As noted above, Joe completes his development.",
        "9... a6": "Preventing 9...Bb5 or 9...Nb5  But, I don't see the point since this is not the Siclian Defense.  However, I guess that this is a burden with any opening which is something new that I learned.",
        "10. O-O": "So, Joe castles, and despite material being even, I already favor white's position here since the center appears completely controlled.  Whereas, when black completes his development, I think that he'll have a ways to go.",
        "10... b5": "Fianchettoing his Bc8, whilst threatening 11...b4 which would force white to undevelop his Nc3.",
        "11. a3": "So, Joe puts a stop to that.",
        "11... Bb7": "Completing his development.  After which Joe will exchange material.  ",
        "12. dxc5 Bxc5 13. Bxc5 Nxc5 14. Rfd1": "Centralizing his Rook.",
        "14... Qb6": "Threatening a nasty discovered, that might lead to mate, in the long run.",
        "15. Qe3": "Like before, Joe stops that.",
        "15... Rac8": "Adding another defender to the c file.  But, I don't see the point, however, because white does not have an immediate threat, to my knowing.  I would've centralized my Rook with the same move, so, 15...Rad8, in this position.",
        "16. Bf1": "I do not know why Joe undeveloped his Bishop.",
        "16... h6": "Like white's last move, I don't know why black played.  But, unlike with Joe, I also don't see the point because he is advancing the pawn near the K, when there does not appear to be a danger.",
        "17. Ne2": "But this, however, makes sense as this gives Joe a better square for his Knight.",
        "17... Rfd8": "So, he responds by bringing his other Rook to the center, as well.",
        "18. Rab1": "Adding an extra defender to b2.  In this position, however, I would've played 18.b4  Not only does this also defend the pawn, but now black has pressure against his Nc5, and thus, would lose time.  Since, however, Joe played this, then it has to be best.  I'm just not sure what makes it better.  That's because I'm thinking of a line where Queens would be exchanged, which would appear to leave white better.  What comes to mind is 21.b4, Na4 20.Qxb6, Nxb6  ",
        "18... Nb8": "So, black undevelops his N.  However, I think that is an inaccuracy.  The reason being was due to a recent blitz Q sac I studied TA, and his opponent, in this case, went wrong by leaving his N on the back rank.  In doing so, Joe had more mobility with his Knight, and was, therefore, able to force a win.",
        "19. Ned4": "In fact, this is a reason why I view 18...Nb8 as an inaccuracy.  With this move, Knight pair is starting to become very dangerous, in my opinion.",
        "19... Nbd7": "I'm not exactly sure why black played, but my guess is to add a defender to his other Knight.  The reason it's just a guess is that his Nc5 appears well protected.",
        "20. c3": "Adding an extra defender to his Nd4  Normally, it would be the same idea as before where I wouldn't understand the logic since the Knight is not in danger.  But, in this position, I find it useful.  While appearing weak, Joe gets another pawn.  And, despite them isolated, with the N, in between, even though they're not passers, those pawns are extremely dangerous.",
        "20... Qc7": "I don't know why black played this.",
        "21. Bd3": "But, this move, however, makes sense, as now, Joe's bishop is in a better spot.  However, black will exchange (presumably because he's worried about white's Bd3.)",
        "21... Nxd3 22. Rxd3 Nc5": "In the after math, black puts pressure on Joe's Rd3 to gain time.",
        "23. Rdd1 Ne4": "I do not know why black played this.",
        "24. Nb3": "But, I believe that Joe moved here to maintain control of the center.  Normally, I wouldn't know why, but I recently learned that center control is important, even when we're not in the opening.",
        "24... Ba8": "To prevent white from hitting black's LSB, which I believe was Joe's plan.",
        "25. Rd4": "I think the idea behind this move was to double up on one column since this makes it possible for Joe to place his other Rook on the d file.",
        "25... a5": "Threatening ...a4 which would cost white valuable.",
        "26. Nfd2": "So, Joe answers by threatening to exchange on e4.  Doing this will give black doubled pawns.  It would cause damage, in this position.  Although, no one has an advantage, at this point, I favor white's position here.",
        "26... a4": "So, black attacks white's N.",
        "27. Nc1": "But, Joe has a plan by bringing his hanging Knight here.  Although it does appear undeveloped and cramped, there's more to it then meets the eye.  What redfoxrising alluded to in a Q sac (that I annotated, where a player near his strength times out), Knights can move in different places.  Although they don't appear so, they're about, as much as, or more then, a bishop.  And, that's what often makes them dangerous.",
        "27... Rd7": "I don't know why meilajb played this since he is not going to double up on one column.  But, Joe, however, will use that time to get Nc1 to a better outpost, starting with, the next move.",
        "28. Ne2 Nc5": "Since, as we're seeing frequently, I don't see the point of this move.  Since this keeps happening, there's a lot that I'm missing which is another way of knowing that Joe is facing strong opposition.",
        "29. Ng3": "Meanwhile, Joe finds a stronger outpost for his Knight, as noted earlier.",
        "29... g6": "But, I do see the point here.  Although it's not a pawn chain, by definition, g6 and h6 are connected pawns which are also known to be dangerous.",
        "30. Rf1": "Adding another defender to f4.",
        "30... Re7": "So, Joe's opponent puts more pressure by adding an extra attacker.",
        "31. Ne2": "At first, I didn't know why or see the point to Joe playing this.  But, with another look, it makes sense because if black does an eventual ...h6-h4 pawn push, there won't be any pressure on white's Knight.  Consequently, TA is preventing a possible tempo loss.",
        "31... Kg7": "Normally, the move makes sense, but in this position, I don't see the point.  The idea being is that the monarch becomes a weapon in the endgame, which is when you want to bring it out.  But, before that, you don't want it out, as otherwise, it would become exposed.  In fact, GM Susan Polgar noted that in our e-mail course.  But, we have not reached the endgame, yet.",
        "32. Rf3": "I presume that Joe is punishing black for his last move.  The idea being that white's Queen combined with Rf1 will put pressure on g6 and h6.  Enough of this would prove overwhelming for the other side.",
        "32... Bc6": "Bringing his B to a better spot, in my opinion.",
        "33. Rh3": "As noted earlier, I think the idea is putting pressure on the K side. ",
        "33... Rh8": "But, black defends against that.",
        "34. Nf3": "Bringing his Nd2 to a better place.  I also think that Joe intends to, at some point, put pressure back on black's K side.  Since a Knight, added to the mix can be quite nasty.",
        "34... Ree8": "Although the columns are not on the same file, by definition, the Rooks are connected on the same rank, so they're doubled up.  And, that can be just as dangerous, and possibly, more so then two rooks on one file.",
        "35. Rd1": "At first, I didn't know why Joe played this, but it makes sense.  That's because black was intending to play 35...Nb3 which would cost him tempo to defend his Rook.  By moving here, if black brings his to Knight to b3, it's no longer a concern.",
        "35... Bd7": "Normally, I wouldn't see the point, except that black is adding a defender e6.  Might seem irrelevant, though, but this makes his pawn chain more dangerous.  I had a similar position against Jack Stockel, in a game I should've won.  I was up a Queen for Rook, and then some.  But, a simple mistake lost the game, by failing to exchange Rook for Bishop.  In the end, although I had 3 pawns, he had a bishop, connected with his other two pawns, which proved to be lethal.  Although the same cannot be said here, the idea, however, applies.",
        "36. Ned4": "Still getting a better position for his Knights.",
        "36... Ne4": "I don't see the point because with this move...",
        "37. Nd2": "White want's to exchange Knights.  The reason I didn't see the point above was the failure to understand how that Knight on e4 is dangerous.  In fact, it's something that still doesn't make sense, but what I do is that if Joe wants to eliminate it, then there's way more to it then meets the eye as black's Ne4 is threatening to do something.  I just don't know what it is.",
        "37... Nc5": "But, black doesn't allow that.  So, now, it's obvious that there's something crucial with that Knight.  I just have no idea what it is.",
        "38. Re1": "In general, a Rook behind the Queen on the same file is also very dangerous.  I've seen examples in GM games, as well as, some of their annotations.  In fact, in one particular annotated game I studied, there were variations.  And, one of them included both on the same file, which would've been overwhelming for the other side.  ",
        "38... Rec8": "So, black does the same thing.",
        "39. Kh1": "Jack has told me that bringing your monarch in the corner, at some point, is part of King safety.  I have gotten it wrong, of when to do that because in one game I was lost, either way.  In another, I seem to recall Kh1 putting me a disadvantage.  So, it's about knowing but with what's unfolding, I'm starting to see where that applies.",
        "39... h5": "And, now has a solid pawn chain, as well.  Although we're only at move 40, I think that with best play, the game will end in a draw, which will become a reality much later on.",
        "40. Nd2f3": "Joe's Knight is better placed here.",
        "40... Rce8": "Putting pressure on the e file, in the long run.",
        "41. Ng5": "And, I like this placement even better because, if that Knight could reach the seventh it would have the potential to become very dangerous.  And, that's a well known fact since I've lost two or three games by allowing that.",
        "41... Qb6": "I don't know why black played.  But, I believe that the aim is to tie down white's Nd4.",
        "42. Qf2": "But, as usual, Joe has an answer to that.",
        "42... Reb8": "Like before, a Rook behind the Queen is known to be dangerous.",
        "43. Rf1": "So, Joe has the same idea in mind.",
        "43... Rbc8": "Like what happened earlier, I don't see the point here.  But, I realize that it's something dangerous because of Joe's next move.",
        "44. Rd1 Qc7": "I think that, as noted earlier, black once again, has the same idea as before.  It makes sense now, however, because while not right away, in the long run, he is threatening c3.",
        "45. Qc2": "So, Joe protects it.",
        "45... Qb6": "I don't see the point since Joe will move his other Rook.",
        "46. Rg3 Rh6": "While not immediately, in the long, run black is putting pressure on Joe's Ng5.  The idea is ...h4, and when white's retreats his Rg3, black would answer with ...Rh5  Although the Knight is defended, I sense that black has a plan more dangerous then this.",
        "47. Qc1": "Since Joe moved here.  But, I think it's because white might have a more dangerous plan here.  I think he intends to exchange pawns with f4-f5, followed by ...PXP, and NXP, the Rook is en-prise and protecting would mean the loss of tempo.",
        "47... Rhh8": "So, black prevents that, at once.",
        "48. Qb1": "So, Joe comes up with a different plan.  Not sure, unless black calculated in advance (which I believe.)  But, it appears that Joe is intending to play Nxe6 with the idea of ...fxe6, allowing Qxg6  However, that is too easy, as experienced don't do this.  On the other hand, I am analyzing that line as that's a start to doing something without oversights.  Lately, when calculating variations, I miss something and am, thus, incorrect, especially in complex positions like this.  So, to cut down on it, I start with the easy way, and then work my out so when calculating sample lines, I can do it with less inaccuracies.",
        "48... Rh6": "But, black also prevents that possibility.",
        "49. Qc2": "Unlike before I don't know why Joe played this.",
        "49... Kg8": "I think the idea was to bring the monarch back where it was.  That makes sense, as the King is safer here.",
        "50. Qe2": "With this move, black will face some tension.  It involves the same thing that I mentioned about 5-10 moves ago.  And, it is back.  The idea is putting pressure from g1-b6 with his Queen.",
        "50... Qa6": "In response, black plays this.",
        "51. Qe3": "But, he now faces more pressure.",
        "51... Rh8": "I do not know why black played this.  In this position, I don't see anything wrong with 51...Ra8 ",
        "52. Ndf3": "Two Knights, (where if it black against white, they'd be exchange)  Since that doesn't happen with the same players, when we see these two knights across from each other, like this, it's a solid Knight Pair which is also known to be dangerous.  In fact, I solved a chess puzzle with two Knights like this, that might have been used to deliver mate.",
        "52... Kf8": "Since it appears to be a potential threat black prevents that possibility by playing this.",
        "53. Re1": "Going back to the Rook behind Queen method.",
        "53... Qa7": "I don't know why black played this.",
        "54. Nd4": "I also don't know why Joe moved here.  But, my guess would be saccing his N for pawn to get something dangerous, known as a positional sac.",
        "54... Qb7": "How I came up with this inference is due to black playing this, as now, with added protection, that sac will not work.",
        "55. Qe2": "If my instincts were correct, I presume that Joe makes another attempt at that.  Or, he might have something more dangerous.",
        "55... Re8": "Since black answers with this move.",
        "56. Qc2": "I am not sure why Joe played this.",
        "56... Bc8": "Likewise, I'm not sure why black moved here.  And, for me, not knowing the logic behind certain moves is quite good as it shows just how much theory the game contains.",
        "57. Kg1": "This is the late middle game, and as we approach the end game, the King will become a powerful weapon.  With that being said, Joe is already mobilizing his monarch and preparing to do battle with it.",
        "57... Kg7": "Black has the same idea in mind.  Normally, I'd say that we have reached the distant opposition, except that it's too soon since not only isn't it the endgame, yet, but there are just too many pawns to call it that.  And, I learned that in charleshiggie's last annotation when ION noted that.  However, this move is still very good because black is threatening to do damage of his own, as we'll see later on.",
        "58. Rd1": "I'm not sure why Joe played this.  At first, I thought that it was to add a defender Nd4, as what, originally, went through my mind was 58....Nb3, which would appear to cost white tempo since it would appear that TA has to get his N out of harm's way.  But, white can just exchange.  So, for example, 58...Nb3, 59.Nxb3, axb3 60.Qxb3",
        "58... Rhg8": "But, I do not know what this move accomplishes, and thus, don't see the point.  If black was going to play 59...Kh8, it would make sense.  However, that does not happen.",
        "59. Rf3": "I do, however, see the logic here.  Although not immediate, at some point, black might have decided to threaten f4 (which is an important pawn.)  But this move, however, adds an extra defender so that, if black decides to attack it, that won't be of a concern.",
        "59... Bd7": "Mobilizing his Rd8.  It was a little mobile, but this really adds to it, and as we know mobility is essential.  ",
        "60. Rh3": "As usual, I did Homework by trying to figure out why Joe played this.  But, this time, I figured it out without having to guess.  In this position, white intends to sac his Rook a pawn.  The idea being is that if black takes, TA will mate.  And, if he is to avoid that, black would lose a pawn.  So, the threat is 61.Rxh5, and if 61...gxh5??, 62.Qh7+, Kf8 (forced) 63.Qxf7#",
        "60... Rgh8": "So, black stops that cold since, now, he has an extra defender to prevent 61.Rxh5.",
        "61. Rg3": "However, black might have had a plan to be concerned about starting with 61...f6 with the idea being 62.exf6, Kxf6 followed by 63...Rf8, making it difficult to defend the f pawn.  So, Joe doesn't take chances.",
        "61... Rh6": "I don't see the point behind this is move because, and in fact, view it as a blunder.  This appeares to restrict black's mobile Rook, and the idea being is that, in general, you don't want to restrict the mobility of your pieces, as that's a recipe for a disaster.  ",
        "62. Qf2": "Therefore, it would appear that Joe is punishing black for his last move.  But, what I thought doesn't happen.  The plan seemed to be 63.Rh3, followed by 64.Qh4, which would be my reason behind this move.  However, TA does not play that.",
        "62... Qb6": "Adding an extra defender to his Nc5, should Joe move his Nd4.",
        "63. Kh1": "Knowing this, Joe brings his monarch to the corner, instead.",
        "63... Rhh8": "And, black remobilizes his Rook.",
        "64. Ndf3": "Like before, Joe aligns his Knights together.  Even in endgames, this applies, so he is maintaining center control.",
        "64... Reb8": "Bringing his Rook behind the Queen, again.",
        "65. f5": "But, Joe threatens a nasty check.  It turns out, that 66.f6+ would be very dangerous, as white's pawn chain would be overwhelming for black.",
        "65... exf5": "So, black prevents problems by taking this way.  It's important to note that taking the other way would lose immediately as white would mate.  65...gxf5?? 66.Nxe6+, Kh6 (forced) 67.Qe3+, Kh7 (forced) 68.Rg7# ",
        "66. Rxd5": "Not surprisingly, Joe takes back.",
        "66... f4": "So, black defends the Rook.",
        "67. Nh4": "Instead of defending, Joe brings one of his Knight to the rim.",
        "67... Ne6": "Since black didn't capture, it's safe to conclude that, \"To take is a mistake.\"  With even more to learn, I studied what would happen if black played 67...fxg3, as Homework because this is very good practice, due to a tactical exercise.  It turns out that black would lose his Queen, as the only way to avoid mate would mean giving it up, after 68.Qxf7+, Kh6 69.Rd6  Therefore, he comes up with a new plan by attacking white's Queen.",
        "68. Qf1": "Which Joe protects.  Right after this, however, black will exchange Knights.  It does make sense, though, since white's Ng5 appears dangerous.  Even if not, why chance it?  The idea behind my last sentence goes with a well known chess fact which is, \"Never trust your opponent.\"  After the exchange, however, black's Bd7 will become a target.",
        "68... Nxg5 69. Rxg5 Bg4": "So, he defends.  I don't know why, but right after this, however, Joe will sac his Knight for a pawn.",
        "70. Nxg6 fxg6 71. Rd6": "My guess is to gain tempo since black must defend.  But, my other instinct is that Joe might have more dangerous up his sleeve.",
        "71... Qe3 72. Qb1": "That is due to this move since he is threatening an immediate 73.Qxg6#",
        "72... Kf8": "So, black prevents that.",
        "73. Rf6+": "But, that will not stop Joe from placing black in check.",
        "73... Ke7": "The only other option was 73...Kg7, and I was trying to calculate what would happen, after that starting with a discovered check by the Rook which would result in mate.  But, then (without analyzing the board), I quickly figured out that white would do that, immediately with 74.Qxg6#",
        "74. Rgxg6": "But, this will not stop Joe from trying since he takes.",
        "74... Qxe5": "But, black stops this by taking Joe's dangerous passed pawn.  However, white will continue to gain tempo by, repeatedly, placing black in check.",
        "75. Rg7+ Ke8 76. Qg6+ Kd8 77. Rg8+ Kc7": "The only difference is that, in this position, I might have played 77...Rxg8 to prevent white's next move since I don't see an immediate back rank mate, afterwards.",
        "78. Rf7+ Bd7": "This, however, is where the fun begins, as Joe is going to sac his Rook for Bishop.",
        "79. Rxd7+ Kxd7 80. Rg7+": "And, now, Joe decides to sac his other Rook for a Queen.  It appears to be forced win for black, but as we'll see later on, there's much to this story then meets the eye.",
        "80... Qxg7 81. Qxg7+ Kc6 82. Qf6+": "For now, this is the last check that Joe has against meilajb.",
        "82... Kb7 83. h4": "Preventing black from getting an open file.  As we know, open files are very dangerous, especially since black has another Rook, on the same rank.",
        "83... Rbc8": "I don't know what this move accomplishes.  Instead, I might have played 83...Rbd8 with the idea of 84...Rd1+, 85.Kh2, Rd2, followed by 86...f3.",
        "84. Kg1": "But, Joe prepares for the f4-f2 march with this move, as now, his monarch is more active.",
        "84... Ka7": "I'm not sure why black moved here, but I deem to be a mistake because Joe is going to win a pawn.  Instead, I would've brought one of my Rooks to f8, to protect f4, whilst, gaining tempo.",
        "85. Qxf4 Ka6": "One thing is for sure, however.  As noted earlier, in the endgame, the monarch is a dangerous weapon.",
        "86. g4": "At first, I thought that Joe was trying to promote with his passed pawn on h4.  But, black's Rh8 stops that.  Instead, white is saccing a pawn to gain tempo.  That's because, when meilajb takes, TA will place him in check.",
        "86... hxg4 87. Qf6+ Ka5": "Still keeping his monarch mobile.  And, the King around a pawn chain is also dangerous.  Although it won't work here, in general, a position like this would result in promoting a pawn.  The only thing that stops it, in this position, is white's a3.  But, usually, you don't have a pawn to block it.  For example, Jack Stockel, in a previous game, was going to promote in a similar situation which is why I resigned there.",
        "88. Qg7": "Instead of taking on h4 (which is what I would've done), he threatens g4.",
        "88... Kb6": "Likewise, instead of taking, black moves his King.  But, it makes sense here because this is triangulation since he played 85...Ka6, followed by, 87...Ka5, and then, 88...Kb6, so it's moved in a triangle.  And, this trigonometric method is very useful in endgames, but especially, in this position.",
        "89. h5": "So, Joe continues to advance his passer since, \"passed pawn must be pushed.\"",
        "89... Rcd8": "I'm not sure why black moved here.  But, in my mind one move is as good or as bad as the other.  With that being said, I just would not know what to do here.",
        "90. h6": "As white, however, this is what I also would've played as Joe keeps pushing his passer.",
        "90... Kc5": "Continuing his triangulation.",
        "91. Qc7+": "But, Joe places him in check.  And, when he gets out...",
        "91... Kd5 92. Kg2": "Joe will use his monarch as a weapon, this time.",
        "92... Ke4": "So does black.",
        "93. Qc6+": "But, Joe checks, again.  And, when black gets out white will win a pawn, again.",
        "93... Kf5 94. Qxb5+ Kg6 95. Kg3": "This time, it's safe to say that we now have the distant opposition.",
        "95... Rd2": "Threatening b2, but Joe answers by exchanging pawns, afterwards, he'll go back to, continuously, placing black in check.",
        "96. Qxa4 Rxb2 97. Qc6+ Kh7 98. Qe4+": "Meanwhile, black will get back a pawn, again.",
        "98... Kxh6 99. Qe3+ Kg6 100. Qd3+": "Normally, I'd annotate the rest, but I go by what TA outlines.  Therefore, I don't think it's necessary, until the very end, as this where, I believe, the theory ends.  In it, he notes that, for the rest of this game, Joe sees that it is drawn.  In fact, he sees this, even earlier.  But, I'm not sure, exactly when.  Starting now, he offers black a draw which gets turned out.  Throughout the rest of the game, he offers black a draw, on two occassions, but meilajb declines.  tactical_abyss even sends his opponent some messages on why he thinks it's drawn, without a response. ",
        "100... Kg7 101. Qd7+ Kf8 102. Qf5+ Kg7 103. Qe5+ Kg8 104. Qe6+ Kg7 105. Qe7+ Kg8 106. Qd8+ Kg7 107. Qd4+ Kh7 108. a4 Rg8 109. a5 Rg6 110. Qa7+ Kh6 111. Qe3+ Kh7 112. Qe7+ Kg8 113. Qd7 Kh8 114. Qf7 Ra6 115. Qc4 Ra7 116. Qd5 Rbb7 117. c4 Rbg7 118. c5 Raf7 119. a6 Rf3+ 120. Kg2 Rff7 121. Qa8+ Kh7 122. c6 Rfa7 123. Qe8 g3 124. Qh5+ Kg8 125. Qf5 Rae7 126. Qd5+ Kh7 127. Qh5+ Kg8 128. Qf3 Kh7 129. Qd3+ Kh6 130. Qd2+ Kh5 131. Qd5+ Kg4 132. Qf3+ Kh4 133. Qf4+ Kh5 134. Qd4 Re2+ 135. Kf3 Ree7 136. Qg1 Ref7+ 137. Ke2 Kg4 138. Kd3 Kf5 139. Qc5+ Ke6 140. Qe3+ Kd5 141. Qd4+ Kxc6 142. Kc4 g2 143. Qc5+ Kd7 144. a7 g1=Q 145. Qxg1 Rxg1 146. a8=Q Rf4+ 147. Kd3 Rd1+ 148. Kc3 Ke7 149. Qa7+ Kf6 150. Qa6+ Kf5 151. Qb5+ Kg6 152. Qb8 Rdf1 153. Qb6+ Rf4f6 154. Qd4 Rf1f3+ 155. Kd2 Rf3f2+ 156. Ke1 Rf2f4 157. Qd5 Rf6f5 158. Qa8 Rf4f2 159. Qe8+ Kg5 160. Qe3+ Rf2f4 161. Qe2 Kf6 162. Qd3 Ke5 163. Qb5+ Kd4 164. Qb6+ Kc4 165. Kd2 Rd4+": "At last, a draw is agreed on by both sides, to make a long story short.  The moral of this story and theory is that a Queen against both Rooks is a book draw.  Overall, I'd like to thank Joe for showing this game.  Without the lecture, I would not have known about it, so this annotation would not have been possible."
    },
    "url": "https://gameknot.com/annotation.pl/queen-v-two-rooks?gm=60348",
    "gameName": "Queen V Two Rooks",
    "players": "tactical_abyss (2519) vs. meilajb (2146)",
    "opening": "French (C11), Steinitz, Boleslavsky variation"
}