{
    "moves": {
        "1. d4": "I underestimated a menace, and got from a very good (?) middle game in a lost final.",
        "1... Nf6 2. Nf3 g6 3. Nc3 Bg7 4. e4 d6 5. h3 O-O 6. Bf4 a5 7. a4 c6 8. Bd3 b6 9. d5": "This is a mistake. Maybe e5.",
        "9... cxd5 10. e5 dxe5 11. Bxe5 e6 12. Bb5": "I analyzed a lot before this, considering the alternative c3-b5. ",
        "12... Nfd7 13. Bd6": "Another hard-thinking. Probably e5xg8 would have been safer, considering king x bishop, queen d5 , knight f3 e5, trying to get some compensation keeping in a king of jail the black pieces. But the jail didn't seem so secure, and I feared pawn's advance on f6, e5 etc. I did consider the black bishop taking my knight, but trusted in my queen d5 and kinght e5. Also, b2xc3 leaves the b column open on the weak pawn in b6. ",
        "13... Bxc3+ 14. bxc3 Re8 15. Qd4 Ba6": "I dind't consider this one in the previous thinking. As i said, the \"jail\" is not secured enough. I considered c8-b7, so black could both defend d5 in case of e5 and get the knight on b8 exchanged with the bishop in c6, since I couldn't allow this knight to sustain the pawns advance in the center. ",
        "16. Ne5": "I considered I had no choice but to maintain my \"jail\" letting a pawn instead of the bishop, in order to keep the knight, at least momentarily, in b8. The alternative was to play rock b1, in order to prevent a6xb6 because of the pressure on the pawn in b6 after b1xb5. But it will allow the knight to be placed in c6, eventually, and then everything will have been going back after the black pawn's advance. Or I think so. I still wonder if I were right. \nThis is a kind of positional sacrifice: I sacrifice my pawn structure in order to keep the pressure on black. With some risks...",
        "16... Bxb5 17. axb5 Nxe5": "Ok, this was into the calculations. Maybe I should have considered taking with the queen, but knight d7, followed by e6-e5, would have been depressing. ",
        "18. Bxe5 Nd7": "My dream of bishop h8 is just a dream, because of f6!",
        "19. Bg3": "Bh8 fails to f6",
        "19... Qf6 20. Qxf6": "This is another great mistake. I feared the advance e6-e5, but I had time, becouse d5 can still take in d5, although a8-d8, or even a8-c8 would have put me in serious troubles. ",
        "20... Nxf6 21. Bc7": "I was playing quickly, because my opponent was online. Don't do that. f3, in order to both stop the knight and let f2 for my bishop, was probably much better. ",
        "21... Nd7 22. Kd2 Rec8 23. Bd6 Nc5": "I needed urgently f3 here. It was very simple, but I was playing quickly. I was thinking only in avoiding the double menace in e4, without seeing that the knight would have menaced f2 too. ",
        "24. Be5 Ne4+": "...and that king d2-d3, the last one in order to keep c3, would have lead to a loss of quality through f2 . And by losing c3, then probably c2, there was no more hope. After this, the game lost interest, since it was an obviously inferior position with no compensation. ",
        "25. Ke3 Nxc3 26. Bxc3": "And if I don't change, I lose the pawn in b5 too. ",
        "26... Rxc3+ 27. Kd2": "Not d4 because after c3-c4 , the a pawn can advance freely. ",
        "27... Rc4 28. c3": "Attempting to make more difficult to take b5. Of course, Rh1-b1 would have been answered with the a pawn's advance, and was also good for black. ",
        "28... Rac8 29. Ra3": "I could have resigned here, but just in case...",
        "29... e5 30. Re1 f6 31. f3 d4 32. Re4": "Looking for some hope.",
        "32... dxc3+ 33. Kc2 Rxe4 34. fxe4 Rc4 35. Rxc3 Rxc3+ 36. Kxc3": "And I won for timeout. It was a lost final."
    },
    "url": "https://gameknot.com/annotation.pl/queen-op-reverse-to-london-blundered-endg?gm=14394",
    "gameName": "Queen op, reverse to London, Blundered EndG.",
    "players": "damalfi (1664) vs. thucydides (1743)",
    "opening": "King's Indian (A48), East Indian defence"
}