{
    "moves": {
        "1. e4": "My most common opening although I am venturing out into the Queens pawn and the English opening.",
        "1... c5": "Sicilian.",
        "2. Nf3": "I always make this move againt the Sicilian ,looking to move d4 next .",
        "2... d6 3. d4": "Sicilian Chekhover variation.",
        "3... cxd4 4. Nxd4": "I like this position. My knight is out and both my bishops ready for action.",
        "4... e6 5. Nc3": "Looking for control of the centre and developing another piece.",
        "5... Nc6": "Black develops and attacks my knight.",
        "6. Be3": "I decide not to exchange knights. I don't want (Nxc6,bxc6). That would only mean black strengthening his pawn position in the centre.",
        "6... Nf6 7. Be2": "I look to castle.",
        "7... Be7": "So does black.",
        "8. O-O O-O 9. f4": "I thought that black may advance e5 threatening my knight So I need some control in the centre.On the other hand I may be weakening my kings defence and a potential attack on the a7-g1 line.  Was this a good move?",
        "9... a6": "Black defends b5 knowing I have 3 pieces ready to converge on it.",
        "10. a4": "Here comes the start of my Queen side attack. I still want control of b5. I made this move because of the concern that black would move b5.",
        "10... Bd7": "Protecting blacks knight so he would not lose a pawn from the b file if I exchanged pieces.",
        "11. Nxc6": "I decide to exchange.",
        "11... Bxc6 12. Bf3": "e5 was an option here but I decided to postpone that move until next move. I had spotted a potential double attack on blacks bishop and knight if I first protected e4 then moved e5 next would attack both his bishop and knight. It would also leave his a,b pawns open to attack from my queen if although decided to exchange bishops.",
        "12... Rc8": "So black decides to protect his bishop and ready's his rook dow the open c file.",
        "13. e5": "I continue with my plan.",
        "13... Bxf3": "Forcing black to make an exchange",
        "14. Qxf3 Ne8": "Black retreats his knight.",
        "15. Qxb7": "My plan wins me a pawn or two.  I hesitated because I thought 'although' may have gone 15...Rb8 attacking my Queen and b2. Maybe I should not have made the move but I got away with it. Play would have gone 15...Rb1. 16. Qxa6, Rxb2. 17. Would either be Qd3,Qf2 or Rfc1 to protect my c pawn and still a pawn up. So would not have been too bad, I think at the time that were my reason for going ahead with Qxb7.",
        "15... d5": "Black may have moved a5 to save his pawn or Rb8 as I earlier discussed.\r\nInstead black opens the way for his bishop.",
        "16. Qxa6 Bb4": "Black starts a Queen side attack of his own so mine will have to wait. Threatening the knight with both Bishop and Rook. Black would be up a pawn if I turned a blind eye to this. If I move the knight I lose the pawn too with Rxc2 and a rook on the second row is not good.  So my knight needs some protection.",
        "17. Qd3": "I did not like my Queen out there by her self So I thought bring her back to defend the knight and the c pawn freeing my knight to move away.\r\n My other concern was black moving d4 forking my bishop and knight so I nearly moved Bd4 to block the advance of the pawn but in reply black may have gone for a bishop exchange by moving Bc5.",
        "17... Rc4": "Black prepares to double his attack down the c file with this move by making room for his Queen to move to c8.  This move also gives a d4 advance extra support.",
        "18. Bd4": "Giving my knight more protection.",
        "18... Qc8 19. Kh1": "I did not like my king on the g1-a7 line. c5 was a square that black had under control and could easily pin my bishop.",
        "19... g6": "Black's knight is stuck so moves g7 to release it. ",
        "20. Rf3": "Ideally I would like to move b3 to attack his rook but to do that the b2 pawn will have to be replaced by somthing else to protect the knight. ",
        "20... Ng7": "Black looks to put his knight on f5 and attack my Bishop.",
        "21. b3": "My knight now has ample protection for the exchange to go in my favor (21...Bxc3. 22.Bxc3,Rxc3.23. Qxc3, Qxc3.24. Rxc3...) Leaving me with 2 rooks and 2 passed pawns to blacks rook and knight.",
        "21... Rc6": "So black retreats.",
        "22. g4": "I defend f5 to stop the advance of ...Nf5.",
        "22... Qb7": "Black looks to double his rooks.",
        "23. Qb5": "With blacks Queen no longer pressuring c5 I look to attack before he can double his rooks. I attack his bishop knowing black would have to exchange Queens to save the bishop. Maybe black could have moved Rb8 here? I still would have exchanged Queens.",
        "23... Qxb5 24. axb5": "Exchange. I could not take it with my knight as I would lose a pawn. ...Rxc2.  This move doubles my pawns up but also opens up the a file.",
        "24... Rc7": "I think I would have gone Rc8 here readying a black attack with an a file attack with both his rooks.",
        "25. Ra7": "I look for a rook exchange.",
        "25... Rcc8": "Black refuses.",
        "26. b6": "Now I can protect against an a-file attack with this move and the pawn also gets ever closer.",
        "26... Rcb8 27. Nb5 Rfe8": "Black moves here to give his bishop a safe square to move(e7) in anticipation of ,28. c3 and the black bishop would be trapped.",
        "28. c3": "I still make this move, My aim here is to try and cramp Black's style.",
        "28... Be7": "Bishop moves to his haven.",
        "29. b7": "My aim here is to put as much pressure on a8 as possible and to move the pawn before it is attacked by both bishop and rook by black moving Bd8.",
        "29... Red8": "Black looks to attack b7with Rd7 next.",
        "30. Nc7": "I decide to block his potential attack on my b7 pawn and attack a8 even more.",
        "30... Rd7 31. Bb6": "Protecting my Knight. Things are cramped.",
        "31... Ne8": "Black looks to attack my Knight and hopes I decide to take his knight but that would not be good.",
        "32. Ra8": "I spot a possible checkmate combo( 32...Rxb7.  33.Nxe8 and black can not prevent the eventual double check when I move my knight Nf6+ and even if black does not go for it I will get a knight for a pawn or a queen if he decides to take the rook.",
        "32... Rxb7": "Black goes for it. A win. ",
        "33. Nxe8": "Rxe8 would not have been good. My knight would have had no where to go and black would have been back in the game. Black resigned knowing that any piece put in the way of the double check would be taken. \r\nBecause it was a discovered double check moving 34.Nf6+ is completely safe and forces black to move.34... Kg7.35.Rg8+,Kh6. 36. g5# or Rh3#.\r\nI really enjoyed this recent game. I took my time and analyzed a bit more than I normally do and it paid dividends. A good game."
    },
    "url": "https://gameknot.com/annotation.pl/queen-side-attack?gm=23104",
    "gameName": "Queen side  attack",
    "players": "wanred (1574) vs. although (1574)",
    "opening": "Sicilian (B54)"
}