{
    "moves": {
        "1. Nf3": "Reti Opening ",
        "1... Nf6": "I am black. I decided to match white's Nf3 move",
        "2. d4 d5": "Again I match. Also if white were to play 1. d4 I would play Nf3 And then if he played 2. Nf3 I would play d5 contesting to the center. I have read that Nf3 is a delayed Queen's gambit move, a anit-indian setup and also called the Torre attack. But now all the openings available have funnel down to one opening...",
        "3. c4": "Queen's gambit",
        "3... dxc4": "Which I accept",
        "4. Nc3": "preventing b5\nBy the way Nc3 is okay but it is not the best way to continue QGA. I used to play Nc3 also when the gambit was accepted but it gives black a tempo. Better would be e3 or Na3. Nc3 is for Novice players folks!",
        "4... a6": "This move is a preparation in order to play b5 but note I was not going to play it on move five. It also stops white from playing Bb5 check!",
        "5. a4": "Still preventing b5 but note I was not going to play b5",
        "5... Nc6 6. e4 Na5": "I play to hold the pawn and I do!",
        "7. Bd2": "I do not know if this is good for white or not",
        "7... Bg4": "a pin",
        "8. Na2 Nb3": "!! Attacking the rook and invading his territory ",
        "9. Rb1 b5": "!! now it is safe to play b5 and mature",
        "10. e5 Ne4": "Invading",
        "11. Bc3": "good move preventing me from playing Nxd5",
        "11... e6 12. Be2": "notice all of whites pieces are tangle up!",
        "12... c5 13. dxc5 Bxc5 14. Qxd8+ Rxd8 15. O-O Ned2": "!! a sacrifice to end the game!",
        "16. Nxd2 Bxe2": "!!",
        "17. Nxb3 cxb3": "!!",
        "18. Rfe1 bxa2": "!!",
        "19. Rba1 Bc4 20. axb5 axb5 21. b4 Bb6 22. g3 Rd3 23. Rac1 Bd4 24. Bxd4 Rxd4 25. Re3 Rd3 26. Rxd3 Bxd3 27. f4": "White missed the chance to skewer my king against my rook but I would queen with check and he would have a rook on h8",
        "27... Bc4 28. Kf2 Ke7 29. Ke3 Ra8 30. Ra1 Ra4 31. Kd4 Rxb4 32. Kc5 Rb1": "And I can not believe my opponent play untill I checkmated him",
        "33. Rxb1 axb1=Q 34. Kc6 Qb4 35. Kb6 Kd7 36. Ka6 Kc7 37. Ka7 Qa5#": "I won"
    },
    "url": "https://gameknot.com/annotation.pl/queens-gambit-accepted?gm=15836",
    "gameName": "Queen's Gambit Accepted",
    "players": "davemoo (1605) vs. freeman8201 (1549)",
    "opening": "Reti opening (A05)"
}