{
    "moves": {
        "1. e4": "This was the second of games with this time limit - it is the longest setting on the blitz section. I had won the previous one, on the white side of a Nimzo-Indian fairly comfortably. As she had annotated that one http://gameknot.com/annotation.pl/real-time-game?gm=61234 I felt duty bound to annotate this one.",
        "1... e5": "I opened e2-e4 to make a change. I had opened d2-d4 against her in our previous game. Maybe my first mistake?",
        "2. Nf3": "I stick with the main move. ",
        "2... Nc6": "So does she. It did cross my mind to deliberately lose this game, to my lovely opponent, to encourage her. Then I thought \"well she would never respect me if she found out I deliberately lost\", but as it happened, I lost anyway!",
        "3. Bb5": "So I play the Spanish, considered best.",
        "3... a6": "And this is the most common reply.",
        "4. Ba4": "I retreat.",
        "4... Nf6": "She hits e4.",
        "5. O-O": "I castle.",
        "5... Be7": "She plays the closed variation, as opposed to the open variation, starting with Nxe4.",
        "6. Re1": "So Protect e4.",
        "6... b5": "She hits my bishop.",
        "7. Bb3": "I retreat.",
        "7... O-O": "She castles.",
        "8. c3": "I prepare d2-d4.",
        "8... d5": "She plays the Marshall Attack\nhttps://en.wikipedia.org/wiki/Ruy_Lopez#Marshall_Attack",
        "9. exd5": "It would be ungallant to refuse a pawn from such a charming lady.",
        "9... Nxd5": "She takes back.",
        "10. Nxe5": "I take again.",
        "10... Nxe5": "She takes back.",
        "11. Rxe5": "So I take.",
        "11... c6": "She protects Nd5",
        "12. d3": "The modern way. d2-d4 used to be played here.",
        "12... Bd6": "She hits the rook.",
        "13. Re1": "Rook retreats.",
        "13... Bf5": "She develops. ",
        "14. Qf3": "My queen comes out.",
        "14... Qf6": "So does hers.",
        "15. Nd2": "I develop my knight.",
        "15... Qg6": "She attacks my pawn on d3. Funnily enough I looked at Bf5-g4 and thought, what of it? My queen can always go to e4. Then I go and play.",
        "16. Ne4": "This of course is motivated by a desire to save my d pawn. She already could have played Bf5-g4.",
        "16... Rae8": "But she plays this instead. I should have saved my queen with h2-h3, but instead I make another huge error.",
        "17. Bd2": "I played this, thinking I was now threatening Ne4-d6, now that my rooks were connected.",
        "17... Bg4": "Ouch! I learn that she is not just a pretty face! I have to give up my queen for two bishops - but I still have fighting chances, as I have an extra pawn too!",
        "18. Qxg4": "So I take.",
        "18... Qxg4": "She takes back.",
        "19. Nxd6": "I take the other bishop.",
        "19... Rxe1+": "She swaps rooks.",
        "20. Rxe1": "I take back.",
        "20... Qg6": "Queen returns to g6, forking d6 and d3",
        "21. Ne4": "The only way to save both.",
        "21... Nf6": "Offering a knight exchange.",
        "22. f3": "I protect my knight.",
        "22... Nxe4": "She exchanges - giving me a strong centre.",
        "23. fxe4": "This recapture also gives me play on the f file.",
        "23... c5": "She prevents me from playing d3-d4 with a dominating centre.",
        "24. Bd5": "I love this square for the bishop. I rather thought I was getting back into the game here. However around here the phone went. It was a chess playing friend, who is hard to get hold of. We had a lot to talk about, and I foolishly tried to play and chat at the same time.",
        "24... Re8": "She develops her rook.",
        "25. Rf1": "I hit f7.",
        "25... Re7": "She protects.",
        "26. Be3": "So I hit the c pawn.",
        "26... Rc7": "She protects again.",
        "27. Bf4": "So I hit the rook again.",
        "27... Re7": "Rook moves. Now surely best is Be3 and black has to somehow figure out how to stop the repetition. But, as I said, I was foolishly trying to conduct a telephone conversation at the same time, and I made a terrible mistake.",
        "28. Bd6": "Thinking I was attacking the rook again. As soon as I made it, I realised my mistake.",
        "28... Qxd6": "It is now hopeless. I resigned.\nMany thanks for reading, please rate this annotation, and leave a comment or two to let me know how I am doing! Until next time, dear reader!"
    },
    "url": "https://gameknot.com/annotation.pl/quick-play-game?gm=61378",
    "gameName": "Quick Play Game",
    "players": "Charles L Higgie (2038) vs. penelope80 (1747)",
    "opening": "Ruy Lopez (C89), Marshall counter-attack, 11...c6"
}