{
    "moves": {
        "1. e4": "I am White.",
        "1... e5 2. Nf3 Nc6 3. Bc4 Bc5 4. b4": "The Evans' Gambit. My idea is to drive the bishop to the unimportant b4 square, and play c3 with tempo attacking it.",
        "4... Bxb4 5. c3 Ba5": "Other moves allow me to play d4 with an overwhelming centre.",
        "6. O-O": "Threatening to take over the centre with d4.",
        "6... Nf6 7. Ng5": "Defends the pawn and threatens f7",
        "7... O-O": "7...d5 is risky because after exd5 Nxd5, I can sacrifice my knight with Nxf7 and then play Qf3 check, forcing the king to expose itself on e6, giving Black an uncomfortable position.",
        "8. f4": "I want to attack Black right away by taking over the centre with d4.",
        "8... d6 9. d4 h6": "A terrible mistake. Black should've played Bb6, which activates his bishop and threatens my pawn at d4 which would be pinned to my king. With Black's extra pawn and counterplay, perhaps he could've won, but with this error, winning is highly unlikely for Black.",
        "10. dxe5": "Black probably assumed that I had to retreat my knight, but instead I open up the centre while counterattacking his knight.",
        "10... dxe5 11. Qxd8": "Is going to drive the rook away from the defense of f7, or will drive the knight away from the defense of e5. Thus winning my pawn back that I sacrificed in the opening, and giving Black a very uncomfortable defensive position.",
        "11... Bb6+ 12. Kh1 Nxd8 13. fxe5 Nd7 14. Nxf7": "A temporary sacrifice",
        "14... Nxf7 15. e6 Nde5 16. exf7+ Kh8": "I win the knight back instantly and come out a pawn up.",
        "17. Ba3 c5": "Black can't move his rook because of my promotion threat.",
        "18. Bd5": "My bishop is very strong on d5 because it cannot be threatened by any pieces.",
        "18... Rb8 19. c4": "Gives my knight a developing square.",
        "19... Bg4": "A pointless move, because his threat of Be2 can be easily countered.",
        "20. Nc3 Bd7 21. Rad1 Kh7 22. Nb5 Bg4 23. Rde1 Rbd8 24. h3 Bh5": "A losing blunder. Black was losing anyway, but now it is much clearer.",
        "25. Rf5": "I am threatening both pieces at once.",
        "25... Nd3 26. Re3": "I am still attacking both pieces.",
        "26... g6 27. Rxh5": "If I retreat my rook, then black's knight escapes to b4 and I don't win any material.",
        "27... Nf2+": "Black tries to save his knight",
        "28. Kg1 Nd1": "Still trying to save his knight.",
        "29. Rxh6+": "I am going to lose that rook anyway, so I might as well win a pawn with it.",
        "29... Kxh6 30. Rd3": "Black's knight is finally trapped, and I will have the advantage since a bishop and knight (2 attacking forces) is usually better against a lone rook (1 defensive force).",
        "30... a6 31. Bc1+": "My bishop needs to free the a3 square for my knight",
        "31... Kg7 32. Na3 Rxf7": "My bishop is pinned",
        "33. Rxd1 Rff8 34. Rf1": "Trading pieces is good for the side with more material.",
        "34... Rxf1+": "Black must trade  or leave his rook for me to take it, otherwise my rook will dominate the f-file",
        "35. Kxf1 Bc7 36. Bb2+ Kh7 37. e5": "My pawn's path to promotion is clear, and it will promote soon.",
        "37... b5 38. e6": "I usually just ignore moves that don't interfere with my plans",
        "38... g5 39. cxb5": "Black can't take my bishop because I will play e7 and promote next move.",
        "39... Kg6 40. Be4+": "This move gets Black's king away from the action so that it cannot stop my pawn",
        "40... Kh6 41. e7 Re8 42. Bf6": "Black is now hopelessly lost. There is no defense to my threat of Bc6.",
        "42... Bd6 43. Bc6": "Black resigned because he must trade his rook for my f6 bishop to stop the pawn, but then I will play bxa6 and have yet another passed pawn ready to promote!"
    },
    "url": "https://gameknot.com/annotation.pl/quickplay-walhalla-61?gm=1561",
    "gameName": "Quickplay walhalla 61",
    "players": "bakerbaker (1493) vs. ami07 (1643)",
    "opening": "Evans gambit (C52), Richardson attack"
}