{
    "moves": {
        "1. d4": "Not a move I have faced to often but the higher the player's rating d4 is played more often because it leads to more positional games which suit higher rated players.",
        "1... Nf6": "I wanted to play Gruenfeld",
        "2. e3": "!? I don't know why this was played or what opening it is",
        "2... g6 3. Bd3 Bg7": "Just setup like a king's Indian",
        "4. c3": "!? traps the DSB unless b3 Ba3 is played",
        "4... d5": "opens up the LSB",
        "5. Nd2 O-O": "Complete my defence",
        "6. f4 Nc6": "White has a stonewall formation and so I want to take advantage of the e4 square which is a perfect out post for my Knight",
        "7. Ngf3 Bg4": "Pin the Knight but also leads to one less defender of e4 via either Be2 or Nxf3 however Qxf3 can also be played which adds another defender to the e4 square",
        "8. O-O a6": "Stops an attack on my knight but also starts a pawn storm which was my main idea",
        "9. h3": "Forces the capture",
        "9... Bxf3 10. Nxf3 b5": "Continues pawn storm",
        "11. a3": "stops b4",
        "11... Ne4": "Gets the outpost for my knight but also means that if Bxe4 dxe4 removes the bishop and allows a5 which means don't lose my b-pawn and also kicks the knight of f3 threatening Ne5",
        "12. Bxe4 dxe4 13. Ne5 Nxe5": "If dxe5 gains control of d-file",
        "14. fxe5": "gets the half-open f-file",
        "14... f6": "wanting to undouble pawns",
        "15. e6": "over extends the pawn and leaves it vulnerable to later attacks",
        "15... Qd5": "attacking the weak pawn",
        "16. Rf4 Qxe6 17. d5 Qe5 18. Qg4": "Has to protect the rook",
        "18... f5 19. Qg5 Bf6": "Queen msut go back to g3",
        "20. Rxf5": "?? Loses the rook although he obviously wanted o play Bxg5 Rxg5 trading queens",
        "20... Qxf5 21. Qxf5": "? Further compounds the last mistake. DON'T EXCHANGE WHEN YOU DOWN ON POINTS",
        "21... gxf5 22. Bd2 Rad8": "Controlling the half-open d-file and  trying to win the d-pawn",
        "23. c4 bxc4": "removes the defender of the d-pawn",
        "24. Bb4 Rxd5 25. Rf1": "Trying to get a pawn back",
        "25... c5": "0-1 White resigns because the material deficit is to large\n\nRemember\n\nDon't exchange when your down\n\nI believe white still had a chance to counter attack when he had a queen even though he was 5 points down with a queen you still have a chance"
    },
    "url": "https://gameknot.com/annotation.pl/quwetwo-game-1-blitz?gm=38287",
    "gameName": "Quwetwo game 1 (Blitz)",
    "players": "quwetwo (1746) vs. thedessertfox (1271)",
    "opening": "Queen's pawn game (A45)"
}