{
    "moves": {
        "1. d4 Nf6 2. c4 c5": "I decided, as usual, on playing this move, hoping to go into the Benko Gambit.\n",
        "3. d5 b5": "And here we are. Black sacrifices a pawn for queenside play.\n",
        "4. cxb5 a6 5. Nc3": "!? I have never played against this move before. It looks quite natural to develop a piece and defend the b5 pawn, so this can't be bad. After the game my opponent told me that he normally plays the 5.b6 line.\n",
        "5... g6": "I decided to continue my normal development. White can still transpose into the main line with 6.bxa6 Bxa6.\n",
        "6. Nf3 axb5 7. Nxb5": "Played instantly by my opponent. However, it turns out that 7.d6!? is the most frequently played move in this position. I don't really know those lines with a d5-d6 push by White, so probably if I want to continue playing the Benko, I should study them.\n",
        "7... Ba6 8. Nc3": "Now this position is also in the main line Benko: it's the same position as 1.d4 Nf6 2.c4 c5 3.d5 b5 4.cxb5 a6 5.bxa6 g6 6.Nc3 Bxa6 7.Nf3. I knew that during the game so I started to play my moves fast again.\n",
        "8... d6": "To control the e5 square, stop an eventual d5-d6 advance and to develop the knight on b8 to d7.\n",
        "9. e4": "White takes the space in the center that I give him, protects his d5 pawn and wants to exchange my active bishop for his passive bishop.\n",
        "9... Bxf1": "I oblige because it takes away White's castling opportunity and because I can't avoid the exchange either way (going back to b7 or c8 would deactivate my bishop as well).\n",
        "10. Kxf1 Bg7 11. g3": "! Planning to 'castle manually', move his king to g2 and then develop the h1 rook. It takes some extra time compared to simply castling in one move, but here he can't castle anymore so he has to do it this way. This manoeuver is also best according to theory and this position is still very well-known.\n",
        "11... Nbd7 12. Kg2 O-O 13. Re1": "Also popular is 13.h3, to prevent Black from playing ...Ng4 (with atheaim of putting a knight on e5). But this move is perfectly playable too.\n",
        "13... Qa5": "I didn't kknow the theory anymore, so I made a natural-looking developing move, planning of moving my f-rook to b8 next turn. Apparently this move is also quite popular, but 13...Ng4 is a major alternative.\n",
        "14. Nd2": "!? This move is rare, but it seems reasonable to move the knight towards the queenside. It was not really doing much on f3. More popular are 14.h3 (again) and 14.e5.\n",
        "14... Rfb8": "Occupying the half-open file, as usual in the Benko.\n",
        "15. Nc4": "This move has never been played before in the DB's. The 2 games that are in the 365chess.com DB both continued 15.Qe2 Ne8 16.Nc4 and now one game continued with the strange-looking 16...Qc7 and the other game went 16...Qa6.\n",
        "15... Qb4": "I wanted to play either this or 15...Qa6. Both attack the knight and keep pressure on the b-pawn, but I decided to play this because it also indirectly pressures the e-pawn and lets the rook rather than the queen attack the a-pawn. However, if I had played 15...Qa6, I could continue with ...Rb4 at some point (as happened in one of the two games mentioned before) and thereby also pressure the e-pawn. That plan looks good, probably somewhat better than what I did. But I felt quite confident that I had a decent position out of the opening.\n",
        "16. Qe2 Ne8": "The computer says that this is a slight inaccuracy and suggests 16...Nb6 instead. But I think this is a thematic move, which plans to move the knight towards the queenside and which opens the diagonal for the dark-squared bishop so that White has to watch out that everything remains defended on his queenside. Also I think that ...Nb6 can be played anytime so it's not necessary to do it right now. Probably both moves are reasonable and it doesn't matter all that much which one I play. Note that this position occurred in the aforementioned games as well, but in those games the queen was on c7 or a6 instead of b4.\n",
        "17. a4": "Planning to activate the rook and pushing the passed pawn. Fritz likes 17.f4 better, to start an attack on the kingside, and I tend to agree.\n",
        "17... Nb6": "Forcing White's knight to either retreat or exchange itself for a less active Black one.\n",
        "18. Nxb6 Rxb6": "I retook with the rook to be able to double rooks and to keep playing as actively as possible. I liked the queen where it was.\n",
        "19. Ra3": "Here Fritz suggests to give back the pawn with 19.Bd2!? Qxb2 20.a5 Rbb8 but that does not seem to give White a big advantage either.\n",
        "19... Rba6 20. f4": "! I suddenly felt a lot less happy about my position, because I started to worry a bit about an eventual e5 coming up. I wanted to prevent that at all cost because it would activate the whole White army which is prepared for an attack right through the center. Obviously I should have known that this move was coming up at some point and probably I should have been prepared for it.\n",
        "20... Bxc3": "?! This awful-looking move was the only one I saw to prevent 21.e5. I remember trying really hard to find something else, but I just couldn't. However, my computer friend Fritz did find another way to prevent it: 20...Qb7!. If white plays 21.e5?! then, I have 21...dxe5 22.fxe5 Bxe5! and if 23.Qxe5?!, then 23...Re6! wins the rook. White can try 24.Rb3 Rxe5 25.Rxb6 Rxe1 but Black is an exchange up after that. White has some compensation but it's probably not enough. I remember I did look at 20...Qb7, because it would attack the d-pawn, but I didn't see this whole line.\n",
        "21. bxc3 Qb7": "Now this also prevents 22.e5 because d5 would be hanging.\n",
        "22. Qa2 Nc7": "Another attacker on d5, but it was probably better to start attacking a4 with 22...Qa7. Now Black's pieces (especially the queen) have less room to manoeuver and I'm forcing Whhite to strengthen his center which he probably wanted too do anyway.\n",
        "23. c4 e6": "Once more attacking the White center.  I felt that my play on the queenside had almost disappeared so I neded another area to attack before White could convert his extra pawn.\n",
        "24. Bd2 exd5": "The computer wants to play 24...f5!? but that looks quite scary due to the open king position and the weak pawns at e6 and d6.\n",
        "25. Rb1": "!? Giving back the pawn (which I cannot really take, as will become clear). I had simply expected 25.exd5. If I had responded 25...Qa7 then, White could keep his pawn with 26.Ra1.\n",
        "25... Qa7": "Now White has to give back his pawn because there are three pawns that I could take here if it were my turn and he can only defend two of them.\n",
        "26. exd5 Rxa4": "?! As said this is not good, but I cannot really blame myself for missing it I think.\n",
        "27. Rxa4 Qxa4 28. Rb8+": "! I should have seen this move. Now I cannot take due to 28...Rxb8?? 29.Qxa4.\n",
        "28... Kg7": "But here it looks as if I'm safe, which is not true but that's very hard to see.\n",
        "29. Qb2+": "?! Fritz suggests the brilliant 29.Bc3+ Kh6 30.Qe2!! and if I take the rook with 30...Rxb8 I fall victim to an unstoppable mating attack beginning with 31.g4. So I have to play something like 30...f5 to stop that mating attack but then after the computer's suggestion 31.Bf6! (again sacrificing the rook which is not important for the attack) White simply has too many threats to the Black monarch. If after 29.Bc3+ I play 29...f6 instead of 29...Kh6, then 30.Qxa4 Rxa4 31.Rb7 Rxc4 32.Rxc7+ check wins a piece for White. However, I think that this all was very hard to see, at least at the level at which I play.\n",
        "29... f6 30. Bc3": "?? This move should have cost White the game, or at least given him a problematic ending. Correct was 30.Rb7 after which I have to defend the knight with 30...Ra7 and White is still in good shape.\n",
        "30... Rxb8": "? Unfortunately I miss my chance. With 30...Qxc4! 31.Bxf6+ Kf7 32.Rxa8 Qxd5+ I regain my rook in a good position. I think I thought I had to do something against 31.Bxf6+ and therefore I didn't look at this line.\n",
        "31. Qxb8 Qc2+": "Now it becomes clear that both White and Black are going to pick up a piece and so we'll end up in a queen ending. The ending is a draw as we'll see, although the computer thinks White is better at first.\n",
        "32. Kh3 Qf5+": "Just testing the waters... Is White already willing to settle for a draw?\n",
        "33. g4": "No, he isn't. Obviously 33.Kh4?? would have been a huge blunder due to 33...Qh5#. Note that in the end this move (33.g4) came in handily because it caused me to be able to give check along the 3rd rank, which was important for the perpetual check. If I hadn't induced White to play this, reaching the draw may have been somewhat harder for me, though it looks like I can still hold due to his exposed king.\n",
        "33... Qd3+ 34. Kh4": "Again avoiding an immediate draw.\n",
        "34... Qxc3 35. Qxc7+": "White has some checks now, but if Black is careful it can't cause any harm.\n",
        "35... Kg8 36. Qd8+ Kf7 37. Qd7+ Kg8 38. Qe6+ Kg7 39. Qxd6": "Now White has also come to the conclusion that this game will be a draw and decides to give Black the cahnce to give perpetual check. There was no way to break through.\n",
        "39... Qe1+": "I decided to give perpetual check because if I would play 39...Qxc4 White could play 40.Qe7+ Kg8 41.d6 when his passed pawn is more advanced than mine so it's only White who can play for a win.\n",
        "40. Kh3 Qe3+ 41. Kg2 Qe2+ 42. Kg3 Qe3+": "And here we agreed to a draw. An interesting game. White seemed to get the better of it around the 20th move, but after a tactical melee in which both sides missed some chances a drawn ending ensued. Thank you for watching this game, see you again for the 6th game.\n"
    },
    "url": "https://gameknot.com/annotation.pl/r5-an-interesting-benko-gambit-http-gameknot-com?gm=46166",
    "gameName": "R5: an interesting Benko Gambit, http://gameknot.com/",
    "players": "White Player (1521) vs. l-d-j (1387)",
    "opening": "Benko gambit (A57), Zaitsev system"
}