{
    "moves": {
        "1. e4 c5 2. Nf3 d6 3. d4 cxd4 4. Nxd4 Nf6 5. Nc3 a6": "I'm sure all fairly high rated players have seen this, the Najdorf variation. ",
        "6. Be3 e6": "This is the Scheveningen (unless I've forgotten the name, which is very likely!). It has a reputation as a very sturdy defense, however, I've prepared a very rare gambit against it. ",
        "7. g4 e5 8. Nf5 g6 9. g5 gxf5 10. exf5": "Has white gone mad!! No, in fact, this knight sacrifice, though unclear, is usually regarded as very sound. ",
        "10... Nfd7": "A mistake. Black's best response is to simply allow the recapture; white should avoid recapturing as long as possible, generally. This move simply exposes the black king to an onslaught. ",
        "11. Qh5 Nb6": "Allowing the light squared bishop to defend, but more importantly, blocking white's light squared bishop from moving to c4. ",
        "12. g6 Qc7 13. O-O-O Bg7": "A blunder. Best is to give away the rook with hxg6 and remove the edge from white's attack. The idea is to prevent material loss after something like Bxb6 Qxb6  Bc4 f6. ",
        "14. Bxb6 Qxb6 15. gxf7+ Kf8": "Black is already completely lost - however, its one thing to know that, and another to actually finish your opponent off! ",
        "16. Nd5 Qxf2 17. f6 Bf5 18. fxg7+ Kxg7 19. Bd3 Bg6 20. Rhg1 Qxf7 21. Rdf1 Qe8 22. Nf6 Qe6 23. Rxg6+": "Blasting through the defense with sheer weight of numbers. ",
        "23... hxg6 24. Qxg6+ Kf8 25. Ng8+ Qf7 26. Qxf7#": "And black perishes very simply. \r\n\r\nOne of the greatest lessons I've taken out of playing this knight sacrifice, the Perenyi, is to forget about the supposed \"piece values\" (e.g. knight ~ 3, rook ~5). If you think of each piece's usefulness in terms of the current position, it really helps develop your tactical skills among other things!\r\n\r\nAnyway, I hoped you enjoyed the game, and I would really recommend similar lines of the Sicilian for anyone having trouble against it. "
    },
    "url": "https://gameknot.com/annotation.pl/rapid-match?gm=33815",
    "gameName": "Rapid Match",
    "players": "togekissbomber  vs. ??? ",
    "opening": "Sicilian (B90), Najdorf, Byrne (English) attack"
}