{
    "moves": {
        "1. d4": "I play Queen's Gambit. thought you should know. \n",
        "1... f5": "Some Players know their opening. My opponent thought for 3 minutes before making this first move. this game takes awhile and thought goes into ... well, most of the moves. ",
        "2. c4 e6": "if you can identify black's opening, please do. ",
        "3. Nc3": "this was risky because of the unwanted Bb4. My friend who taught me Queen's told me to avoid Bb4 like the plague. ",
        "3... c6": "this opening of his seems to favor the black bishop and queen\n",
        "4. e3 Nf6 5. Nge2 d5": "the offensive has been taken! Counter attack!",
        "6. c5": "did I say attack? oops. ",
        "6... Ne4": "This bothered me. A lot. not enough to trade, but enough for me to prioritize my attack against it. also note f2 which is in peril once Qh4 happens. I want to avoid an attack on f2. ",
        "7. Nf4": "I want to attack the king on h6, and I do end up accomplishing my goal, but things don't go exactly as I wanted. ",
        "7... Be7 8. Qh5+": "I had anticipated Kd7 response.",
        "8... g6 9. Nxg6 Nf6": "yeah. that's where my plan took a turn for the worse. No harm done, but my attack is significantly weaker now. ",
        "10. Qh3 Rg8": "a sort of boring move. ",
        "11. Ne5": "I like how this locks the king in.",
        "11... Nbd7": "What? I say, a trade? very well then, sir!",
        "12. Be2": "strict policy: all trades must be brought to me....\nthis isn't true at all, but in this case it happens to be. ",
        "12... Nxe5 13. dxe5": "this forces black to surrender the h pawn. ",
        "13... Ng4 14. Bxg4": "see, right there, I already broke that trade policy thing. whatever. move on, I'm up a \npawn.",
        "14... fxg4 15. Qxh7": "2 pawns. ",
        "15... Kd7 16. e4": "the idea behind the king move was to also guard the g pawn by not moving the rook. \nthe point of my move is to get a fun attack once I castle. ",
        "16... b6": "unfortunately he saw through my rouse. ruse? I'll spell check later.\nthe pawn is actually a problem for me because I like his queen contained like it is. and I certainly don't want the rook to have free reign. ",
        "17. Be3": "eh. this move was ok, it makes the attack on d1 if he takes e4 faster I suppose. ",
        "17... Ba6": "this ends up to be his downfall. ",
        "18. exd5": "take the offensive! take it!",
        "18... cxd5 19. Qc2": "it's the ol' pull the queen back on the newfound diagonal trick! third time this week they've fallen for it! \n(also note black's current superiority over the c5 square)",
        "19... Bxc5": "why he took with bishop? the world may never know. well, I don't. comments?",
        "20. Bxc5 bxc5 21. Qa4+ Ke7 22. Qxa6": "this was really the cause of my opponents loss. a small oversight of position. ",
        "22... Qc7 23. Qd6+": "I'm ahead, I can do whatever I want... also that pawn is screwed no matter what so...\nwhatever. this was an ok thing to do in my eyes. If you disagree, please say why, don't just deem this stupid.  ",
        "23... Qxd6 24. exd6+ Kxd6 25. g3": "this. this pawn push. this pawn push is mean.",
        "25... Rab8 26. b3 d4": "predictable pawn push? I think so. don't tell me you weren't thinking to yourself \"I be he pushes that pawn.\"",
        "27. Ne4+ Ke5 28. Nxc5": "he gave up a pawn. ",
        "28... Rgd8 29. Nd3+ Ke4 30. Rd1": "that extra minor is a very useful wall. it is equal in use to a doorstop, at least for now.",
        "30... a5": "that's the least intimidating pawn push... ",
        "31. O-O e5": "oh boy that was a mistake. ",
        "32. Rfe1+": "please note that kf3 is followed by Nxe5#\nend of game.... I was really hoping he would do that for the awesome checkmate. \n",
        "32... Kf5 33. Rxe5+ Kf6 34. Rxa5 Rbc8 35. Ra4 Rc3": "the most useless move? ",
        "36. Ra5": "I wasted a turn. I figured I wanted to keep the king out of my stuff. ",
        "36... Rc2 37. Nb4 Rc3": "now he has wasted a turn, too bad this one ends the game for him.",
        "38. Nd5+ Kf5": "I don't think he noticed that this was pretty much the worst possible move in this situation. ",
        "39. Nxc3+": "He resigns. End of game.\n\nThanks for commenting/reading!"
    },
    "url": "https://gameknot.com/annotation.pl/rargonauts-games-1?gm=47820",
    "gameName": "Rargonaut's Games (1) ",
    "players": "Rargonaut (1220) vs. ??? (????)",
    "opening": "Dutch defence, Rubinstein variation (A84)"
}