{
    "moves": {
        "1. e4": "Game started with e4.",
        "1... e6": "I played e6, going for the French defence. ",
        "2. d4 d5 3. exd5": "To be honest, I was a bit disappointed to see the exchange French ",
        "3... exd5 4. Nf3 Nf6": "Casual developing moves from both sides. ",
        "5. Bd3 Be7": "Be7 was played, getting ready to castle king side.",
        "6. O-O O-O": "Both sides castles ",
        "7. Re1": "Re1, reasonable move, occupying open file. ",
        "7... Nc6": "Nc6, with the intention to play Nb4 to attack white's lsb.",
        "8. c3": "C3 stops Nb4",
        "8... Bg4": "Pinning the knight.",
        "9. h3": "H3, asking me what to do with my bishop.",
        "9... Bh5": "I decided to maintain the pin.",
        "10. Bf4": "Bf4, more development from white.",
        "10... Bd6": "Since my dsb is not doing anything constructive on e7, might as well trade him for white's more active bishop. ",
        "11. Bg5": "Bg5, moving the same piece twice. ",
        "11... h6": "Now asking white what to do with his bishop.",
        "12. Bh4": "Bh4, so far, white has moved his dsb three times in a row, giving me some extra tempi.",
        "12... Bf4": "Bf4, my dsb is now well placed, also my queen can now move to f4.",
        "13. Be2": "Be2? It seems a bit awkward, Nbd2 would definitely be the better alternative, the lsb was certainly more useful on d3, now Be2 not only making the bishop less functional, but also it is now blocking the rook from occupying the e-file.  ",
        "13... Re8": "Bringing the rook into the game.",
        "14. Nbd2": "Finally Nbd2, but it seems a bit late at this point, white has already wasted too much time.",
        "14... g5": "g5, since both of us castled king side, therefore this pawn push is not as risky as it seems.",
        "15. Bg3 Qd6": "It is tempting to play Bxg3 straight away to double the pawns, but it would only help white, after fxg3, there could be potential pressure from Rf1.",
        "16. Bxf4 Qxf4": "Now, a huge amount of pressure is exerted on the e-file, white is clearly in a difficult position. ",
        "17. Rc1 Re6": "Re6, planning to double the rooks on the e-file, Re6 also reserves the option of playing Ne7 in some variations (in case I need to manoeuvre my knight to the king side).",
        "18. Nf1": "Nf1, another inaccuracy from white, maybe he wanted to play Ng3 next, now the knight has left e4 unprotected, ",
        "18... Ne4": "Ne4, immediately occupies e4.",
        "19. Nf1d2": "N1d2, white realised my knight on e4 is too powerful.  ",
        "19... Rae8": "Getting the other rook involved.",
        "20. Nxe4 Re6xe4": "Even more pressure has been added on the e-file. White's position is pretty much jammed. Rc2 is probably the best move for white in this position.",
        "21. g4": "G4? white must be desperate, I couldn't believe he played this move. ",
        "21... Bxg4": "Bxg4",
        "22. hxg4 Qxg4+": "Qxg4+ now checkmate is now unavoidable.",
        "23. Kf1 Qh3+ 24. Kg1 Rg4#": "Rg4 game over. I hope you enjoyed this game, please feel free to leave your comments. Good luck with your games, bye for now."
    },
    "url": "https://gameknot.com/annotation.pl/reading-c-team-vs-eton-college-b-team?gm=61070",
    "gameName": "Reading C team vs Eton College B team",
    "players": "NN  vs. superlalulalu ",
    "opening": "French (C01), exchange, Svenonius variation"
}