{
    "moves": {
        "1. e4": "The road to victory begins here.",
        "1... d6": "Queens Pawn...",
        "2. f4": "The right side of the board shall be mine!",
        "2... Nf6": "Alas, his knight threatens my pawn!  ",
        "3. d3": "YOU CAN NOT HAVE MY PAWN!!!",
        "3... e5": "Another threat to my pawn!",
        "4. f5": "YOU CAN NOT HAVE MY PAWN! I claim this side of the battlefield!",
        "4... Be7 5. g4": "This side of the battlefield shall be mine!",
        "5... h6": "He finally sees my advances. Alas, it is too late! I lay claim to this side of the battlefield!!",
        "6. h3 c6 7. d4": "ADVANCE MY MINIONS!! FOR GLORY!!!!!",
        "7... Nbd7 8. Nc3": "I see that i have left my kings pawn open for an assault! I quickly rectify my blunder on the battlefield. Such mistakes can be costly...",
        "8... b6": "Feeling the threat on the right side of the battlefield, Liberion advances slowly along the left flank. However, It is too little and far too late. HIS KING SHALL BE MINE!",
        "9. d5": "I SEE YOUR ADVANCES! CONTINUE THE ASSAULT!",
        "9... c5": "His pawn is afraid to do battle with mine! You may have the left flank, at this point it is unimportant!",
        "10. Be3": "The Bishop moves to support the front lines and the king looks at the possibility of castling; However, this is only if danger is afoot!",
        "10... Nh7": "Make your retreat! PUNY KNIGHT! But wait! I see he is clearing way for his Bishop... Alas i am on to your plans! ",
        "11. Bf2": "I protect my king from the danger that looms and allow for the possibility of castling!",
        "11... Bg5": "I see your game, you devilish rogue! YOU WILL NOT JACK MY SWAG!",
        "12. Nf3 O-O": "The opposing king retreats into his castle! WE HAVE THEM ON THE RUN!",
        "13. Bg3": "I lay my trap! The first trade shall commence soon!!",
        "13... a6": "He creeps along the left flank. A lost cause!",
        "14. h4": "MY PAWN COMMENCES HIS ASSAULT!!",
        "14... Bf4": "His bishop dodges, and prepares to do battle with mine! ",
        "15. Bxf4": "The first trade commences!",
        "15... exf4": "HA! YOUR PAWN IS NOW ISOLATED!",
        "16. Qd2": "MY QUEEN! YOUR TIME IS NOW! ASSAULT HIS MEASLY PEON!",
        "16... b5": "He continues to crawl slowly along my left flank, under the false pretense that the left side of the board is useful territory! ALAS, IT IS NOT!",
        "17. Qxf4": "MY QUEEN STRIKES! +1!",
        "17... b4": "His pawn threatens my knight!",
        "18. Na4": "However my knight quickly evades the coming assault!",
        "18... Qf6": "His queen moves into play! Alas, i see what she is up to!",
        "19. c3": "YOUR PLANS ARE FOILED, YOU EVIL SUCCUBUS! ",
        "19... Re8 20. g5": "CONTINUE YOUR ADVANCE MY MINIONS!",
        "20... hxg5": "The second trade commences!",
        "21. hxg5": "I continue my advance and threaten their queen!",
        "21... Qe7": "RETREAT, EVIL SUCCUBUS!",
        "22. g6": "My minions continue their advancement, blissfully unaware of the incredible transaction that awaits...",
        "22... Qxe4+": "THE EVIL SUCCUBUS HAS SLAIN A MINION AND PREPARES TO DO BATTLE WITH MAH LADY!",
        "23. Qxe4": "YOU AIN'T GETTIN' MAH MAN, BIZNATCH!",
        "23... Rxe4+": "ALAS! THE QUEEN IS SLAIN!",
        "24. Be2": "The bishop will not allow any danger to his king!",
        "24... fxg6 25. fxg6": "Another battle, directly in front of their kings castle! Back away knight!",
        "25... Nhf6 26. Ng5": "My knight threatens his Rook!",
        "26... Re8": "And his rook slides away like a frightened, pre-pubescent girl!",
        "27. Nf7": "My knight valiantly advances, laying the foundations for a glorious victory!",
        "27... Ne5": "His final blunder! YOUR FATE IS SEALED!!!!!!!!!!!!!!!!!!!!",
        "28. Rh8#": "ROOK! COMMENCE THE FINAL ATTACK! ALL HAIL ZAKMO! VICTORY IS MINE! \n\nalas... the battle was not without casualties, the mighty queen fell, doing battle with the evil succubus and ultimately falling at the hands of Liberion's rook. Her sacrifice was not in vain! As the day was ultimately seized by the Rook of H after the brilliantly planned assault of Zakmo's minions and the Knight of G!"
    },
    "url": "https://gameknot.com/annotation.pl/real-time-chess-game?gm=38497",
    "gameName": "Real Time Chess Game",
    "players": "Zakmo (1200) vs. Liberion (1917)",
    "opening": "Pirc defence (B07)"
}