{
    "moves": {
        "1. d4": "My normal move",
        "1... d5": "I was a little surprised to see this since most people at higher levels now play 1...Nf6",
        "2. c4": "Moving on to my favorite, the Queen's Gambit",
        "2... c6": "Slav Defense, my least favorite defense to play against after 2. c4. This is the most popular response for Black next to 2...e6",
        "3. cxd5": "My team members give me a hard time for playing this opening. There's nothing wrong with it except that it's tame and often drawish. Sounds like my perfect opening",
        "3... cxd5": "Black naturally takes back with the pawn",
        "4. Nc3 Nf6": "Just normal development",
        "5. Nf3 Bg4": "This is where I had my first think of the game. Black's goal is to capture the knight on f3 and damage White's pawn structure. If I take with the e-pawn, my d-pawn is now isolated. Taking with the g-pawn is an option but it would be harmful if White were to castle Kingside.\n\nHowever, this isn't the strongest move in this position",
        "6. Qb3": "This is actually a very solid move for White in my opinion. White attacks the undefended pawn on b7. ",
        "6... Qc7": "Black loses a pawn right away. I was expecting 6...b6 in which I'd respond with 7. Ne5, where White seems to have a good position.",
        "7. Nxd5 Nxd5 8. Qxd5 e6": "Attacking the Queen and opening the line for the other Bishop",
        "9. Qb3 Nc6 10. e3 Bb4+ 11. Bd2": "Also possible is 11. Nd2, planning 12. f3 to drive the bishop away but that move is much more passive. This is the most natural way of blocking the check.",
        "11... Bxf3": "Taking the Knight expecting an immediate recapture",
        "12. Bxb4": "I sat on this one for about 8 minutes. I was looking at the possible benefits and consequences of 12. gxf3 Bxd2+ 13. Kxd2. White has a damaged pawn structure and a king in the center but also now has the two Bishops and more open lines for his pieces. In the end, I decided to go the safe route",
        "12... Nxb4 13. Qxb4": "White's queen now blocks Black from castling Kingside for now.",
        "13... Bd5": "Moving the Bishop away and keeping pressure on g2",
        "14. Bb5+": "The best move. This allows White to develop the Bishop without having to worry about 14... Bxg2",
        "14... Bc6 15. Rc1": "White slowly puts pressure on the Bishop. It know is pinned to the King and the Queen",
        "15... Rc8 16. O-O": "? I feel that this move lets Black off a little bit. Sure the Queen will be able to move out of the pin but now 16. Bxc6+ bxc6 would give Black a weaker pawn structure on the Queenside. ",
        "16... Qd7": "Black's Queen escapes from the Rook on c1 and White will eventually have to move the Bishop on b5. ",
        "17. Bxc6": "I think this is also a mistake. White relieves all the pressure in the position and allows Black to obtain an equal position (minus the slight pawn disadvantage, which I don't feel matters as much right now)",
        "17... Rxc6 18. Rc5": "White does not want to take back on c6, giving the Black Queen control of the file for the time being. This also brings up the possibility of moving the other rook to c1",
        "18... O-O": "Black finally castles the first chance he gets.",
        "19. Rfc1": "Swinging that rook over",
        "19... Rfc8": "Black does the same",
        "20. f3": "I know this game is going to reach an endgame so I need to open a space for my king to start getting active",
        "20... h6": "Black also opens up a space for his king but I like f6 better. The king needs to be towards the center!",
        "21. Rc5xc6": "Another exchange",
        "21... Rxc6 22. Rc5": "Avoiding Rxc6 Qxc6, where Black's queen takes a more active position",
        "22... Rb6 23. Qc3 Qa4": "Black now threatens the pawn on a2 and a possible infiltration on d1.",
        "24. Rc8+ Kh7 25. Qc2+": "This forces a Queen trade and gets into an endgame",
        "25... Qxc2 26. Rxc2": "I think this position is drawn with best play from both sides. White doesn't have any advantages besides the extra pawn.\n\nMy focus in this endgame is on getting a more active rook, a passed pawn, and a more active king. ",
        "26... Kg6": "Getting that King active",
        "27. Kf2": "White does the same",
        "27... Kf6": "?! I feel f5 is better here, preventing an advance on e4",
        "28. e4": "White takes advantage of the opportunity presented by him",
        "28... Rb4 29. Ke3 g5 30. b3": "Relieving the rook of the duties of protecting the pawn on b2",
        "30... Kg6 31. Rc4": "White offers a trade of rooks, which would magnify the pawn advantage. When ahead in material, try to trade pieces!",
        "31... Rb5": "Defending against a possible pawn push to d5.",
        "32. g4": "Trying to prevent an advance to f5",
        "32... f6 33. Rc5": "Trying the rook trade but this also gives White a better rook than Black. This rook prevents possible counterplay on f5 and allows White to push to d5 whenever he pleases.",
        "33... Rb6": "Black's rook is now less active and White's rook is now in a better position",
        "34. Kd3": "The King is centralized, t",
        "34... Ra6": "Attacking the pawn but this gives his rook a even more passive role",
        "35. a4": "Defending",
        "35... Kf7": "? Black was visibly frustrated after this move but I'll argue he made his position just as bad over the course of the last 10 moves. He allowed White to gain a better position than he started with. His rook is more active and his king is centralized",
        "36. Rc7+": "However, this gives white a clear advantage",
        "36... Ke8 37. Rxb7 Rb6": "Black makes this move purely out of frustration. This trade of rooks dooms Black",
        "38. Rxb6 axb6 39. Kc4": "Targeting the b-pawn",
        "39... Kd7 40. d5": "Getting my king even more centralized",
        "40... exd5+ 41. Kxd5": "Black resigns. It's been a while since I've annotated a game so I hope you all enjoyed it!"
    },
    "url": "https://gameknot.com/annotation.pl/region-iii-team-tournament?gm=51558",
    "gameName": "Region III team tournament",
    "players": "rookie879 (1331) vs. Evan Kuo (1511)",
    "opening": "QGD Slav defence (D10), exchange variation"
}