{
    "moves": {
        "1. d4": "The start of a queens pawn game",
        "1... d5 2. Nc3": "I was planning to go for a giuco piano it this point. But it turned out differently",
        "2... c6": "an unexpected counter for me",
        "3. e4": "I try to gain more control over the center",
        "3... e6": "stasiok plays defensively. The start of a long manoevering",
        "4. Qe2": "I take the line of his king. to attack d5 more",
        "4... Bb4": "To releave some pressure stasiok attacks my knight(that attacks d5).",
        "5. Bd2": "I counter by double covering my knight",
        "5... Bxc3": "he's not impressed. after this does take pressure of off d5",
        "6. Bxc3": "normal exchange",
        "6... Na6": "not sure what is happening here. Diversion from the center game I would say",
        "7. exd5": "I go for his queen pawn",
        "7... cxd5": "He takes it leaving a hole on his queen side",
        "8. Nf3": "reinforcing the center",
        "8... Ne7 9. Qb5+": "first attack on the king. trying to lure him in to Bd7 so I can attack his knight and rook in the a row",
        "9... Qd7": "stasiok is not daft ;)",
        "10. Qd3": "I hastly retreat my daring queen",
        "10... f6": "more pressure on the center from king side",
        "11. g3": "I start building a house for the king...",
        "11... g5": "Taking up my manoeverability but not my strength",
        "12. Bg2": "more construction work on the house and secretly preparing to take over the diagonal",
        "12... Nc6": "blocking the diagonal and putting some control on my queens pawn",
        "13. a3": "making some space for myself",
        "13... Qd6": "stasiok is trying to get some control of the queen side (which is mine off course)",
        "14. b4": "I emphasize my who's boss here",
        "14... Ne7": "stasiok is already changing the center of focus",
        "15. Bb2": "I start opening up line c for queen and rook",
        "15... b6 16. O-O": "a the house of the king is finished",
        "16... Nc7": "totally taking a defensive hold on d5 while im not even attacking...",
        "17. c4": "Ok now I im. Im ready to take the center now",
        "17... Qc6": "what is happening?",
        "18. Nd2 a6 19. Rac1": "threatening the queen ",
        "19... Qa4": "Queen sidelined now... Bad move Stasiok my baseline is well protected as oppossed to yours",
        "20. Rfe1": "taking the kings line again",
        "20... Ra7": "While protectting the knight(s) stasiok is even further weakening his baseline.",
        "21. cxd5": "I decide to break center open knowing I got the e line pinned down and a nice combination on c8.",
        "21... Nexd5": "stasiok tries to avoid the combination but I still have the diagonal to force him",
        "22. Bxd5": "theres the force . He had better taken his loss but no",
        "22... Nxd5": "c8 is open with theat of a combination",
        "23. Rxc8+": "taking the baseline and his rook. possible changes of getting check mate with Qh7",
        "23... Kf7": "fleeing in not necessarily the right direction. but leaving the rook open ",
        "24. Rxh8": "taking the rook. and the threat of Qh7 gets bigger.",
        "24... f5": "so big stasiok decides to remedy it... ",
        "25. Rxh7+": "leaving another deadly combination open for my killer rook.\r\nStasiok  decided to throw in the towel."
    },
    "url": "https://gameknot.com/annotation.pl/regular-chess-game?gm=12086",
    "gameName": "regular chess game",
    "players": "bonster (1291) vs. stasiok (1283)",
    "opening": "Queen's pawn (D00), Chigorin variation"
}