{
    "moves": {
        "1. e4 e5 2. Nf3 Nc6 3. Bb5": "Ruy Lopez opening",
        "3... Bc5 4. O-O d6 5. c3": "Preparing for the push d4.",
        "5... Bd7 6. d4": "Gaining control of the center.",
        "6... exd4 7. cxd4 Bb6 8. Nc3 Nf6 9. e5": "The attack on black's king begins with this pawn thrust.",
        "9... dxe5 10. dxe5 Ng4 11. Bg5 f6": "I think Ne7 or Qc8 would have been better here.  The computer sees nothing wrong with this move, though it gives white a slight advantage.",
        "12. exf6 Nxf6": "The computer doesn't like this one.  It suggests: Best: +1.96 » … gxf6 12.  Bf4  O-O  13. Qd5+ Kh8  14. Rad1 Be8  15. h3 Qxd5  16. Nxd5 Nge5  17. Nxe5 Nxe5  18. Nxb6 Bxb5  19. Nxa8 Bxf1  20. Nxc7.\n\nThe suggested line leaves white up a pawn.",
        "13. Re1+ Kf7": "Once again, I believe Ne7 would have been a better counter.  The computer disagrees.\nBest: +2.89 » … Kf8 13.  Nd5  h6  14. Bh4 Bg4  15. Nxf6 Qxd1  16. Rexd1 gxf6  17. Bxc6 bxc6  18. Bxf6 Bxf3  19. Bxh8 Bxd1  20. Rxd1\nIf anybody can tell me why 13...Ne7 is bad, please, I need the help.",
        "14. Bc4+ Kg6": "Even though this move sets up a deadly attack by white, I understand why black played this move.  It seems that there is no immediate threats that white can make against black's king.  It took me a while to find my 15th move.\nComputer suggests: Best: +6.08 » … Kf8 14.  Nd5  Be8  15. Nxf6 Qxd1  16. Raxd1 Bf7  17. Nd7+ Kg8  18. Nxb6 axb6  19. Bxf7+ Kxf7  20. Rd7+ Kg6  21. Rxc7 Rxa2",
        "15. Nd5": "Now, no matter blacks move, white wins at least a piece.",
        "15... h6": "And this move allows the forced mate.  I would have suggested 15...Be6 for black.  After 16 Nf4+ Kf7 17. Bxe6+ Kf8, black seems to have a respite from the attack.\n\nComputer disagrees again: Best: +12.61 » … Bxf2+ 15.  Kxf2  Ng4+  16. Kg3 Qxg5  17. Nxg5 Nge5  18. Nf3 Nxf3  19. Qxf3 Rhe8  20. Bd3+ Kh6  21. Qf4+ g5  22. Qxc7\nThough this leaves black down a queen.",
        "16. Nf4+ Kh7 17. Qd3+": "Black can only delay the inevitable.  1-0."
    },
    "url": "https://gameknot.com/annotation.pl/religion-and-war-how-knights-and-bishops-work-well-together?gm=31195",
    "gameName": "Religion and War.  How Knights and Bishops work well together.",
    "players": "sccadams (1568) vs. lazytony54 (1426)",
    "opening": "Ruy Lopez (C64), classical defence, Zaitsev variation"
}