{
    "moves": {
        "1. d4": "This is an interesting game with careful moves on both sides. Black had a mate opportunity at move 53, did not see it. Black deserved a win but lost probably because he was \"dizzy with success\" as russians would put it and made an impulsive mistake at the end.\r\nQueen's pawn to d4, my favorite move, leading to Queen's gambit. I enjoy this move because back when I was first learning the basics (very long time ago), I guess I took this as a habit because this opening leads to a closed game with slow maneuvering. In contrast, e4 is a good move but it leads to an open game and at the beginning, I had more chance of giving away material due to forks by knights and bishops.",
        "1... d5": "Queen's gambit, as expected.",
        "2. c4": "I am not giving away that pawn, after he takes that, I intend to e4, taking control of the center. Later I can capture his pawn by bishop to c4",
        "2... e5": "Interesting move, I can just go ahead and capture his pawn and then try to defend my isolated pawn at e5.",
        "3. dxe5": "Captured and I am 1 pawn ahead in the material.",
        "3... d4": "He advances his pawn, trying to control my c3 square.",
        "4. Nf3": "Threat on d4 pawn both by Knight and queen",
        "4... c5": "protects it and makes it solid on the board, controls my e3 and c3 squares.",
        "5. g3": "Preparing for italian style bishop to g2",
        "5... Bg4": "Juggling around",
        "6. Bg2": "protects the knight",
        "6... Nc6 7. Bf4": "Wanted to take bishop to the game, controlling the diagonal to the some point and protecting e5 pawn.",
        "7... Be6": "Threatens my c4 pawn.",
        "8. Qb3": "Take care of that threat and threaten b7 pawn at the same time.",
        "8... Qd7": "Protects b7",
        "9. O-O Nge7": "He is trying to castle but blocking his black bishop is not a good idea if you ask me. Then he cannot move his knight to f6 because i have a freaking pawn there.",
        "10. Na3": "connecting the rooks, mobilizing the horsy troops, planning on visiting b5 and forking with c7 if the opportunity represents itself :)",
        "10... a6": "He is preventing me horsy from coming to b5 I see :) In our last match, I did that and forked his rook and king.",
        "11. Qa4": "Now that he protects his pawn, i try to make my queen useful. Queen is \"vezir\" in turkish, which means like prime minister. Knight is \"at\", meaning horse, rook is \"kale\" which means castle, and king is \"sah\" which is persian king. Instead of bishop, we use \"fil\" which means elephant :) Really...",
        "11... Ng6": "Fine move, attacking my \"elephant\"",
        "12. Bg5": "running the bishop and controlling f6 and e7, kinda...I also have a pawn there, so its all good.",
        "12... Rb8": "i think he is gonna move his Q somewhere, so he wants to keep that pawn protected.",
        "13. e3": "trying to regain control over there and breaking the deadlock",
        "13... Ncxe5": "takes my pawn and attacks my Q, perhaps even hoping i wont see that.",
        "14. Qxd7+": "exchange the ladies.",
        "14... Bxd7": "he regains his lost pawn at the top of the game.",
        "15. exd4": "i take that back, i am again a pawn ahead.",
        "15... Nxf3+": "Exchanges horses",
        "16. Bxf3": "Now i control that nice diagonal. Good thing he saw ahead and protected his pawn at b7.",
        "16... cxd4": "material even now, and he has a passed pawn.",
        "17. Rfe1+": "Muhahahahaha",
        "17... Be6": "fine protectionovski.",
        "18. Bd5": "threat",
        "18... Kd7": "Surprising move me thinks, but now the queens are gone, we can have a macho game, playing around with kings and such :) I myself would still try to castle and lose the pawn.",
        "19. Rad1": "trying to get that lonely ranger at d4.",
        "19... h6": "bishop to c5 would have protected his pawnovski (trying to give this a russian theme :)",
        "20. Bc1": "maybe i could exchange the bishops at e6, but oh well, i wanted to keep that nice combo of bishop and pawn, protecting each other.",
        "20... Bxd5": "he makes the exchange for me.",
        "21. cxd5": "i could also take d4 pawn with castle, and he could not take my pawn because he would have to move his king.",
        "21... Bc5": "Now he takes care of his own.",
        "22. Nc2": "i am no fool, i threaten that pawn with my horsy also, so i win the exchange.",
        "22... Ne7": "he tells me i take his pawn, he takes mine.",
        "23. b4": "get out of here bishop sir...",
        "23... Bb6": "OK",
        "24. Nxd4": "I am up a pawn after all that hard work, but he can take my pawn also. But i plan to move my horse up to his right side, \"eating\" some more of his pawns.",
        "24... Nxd5": "even steven.",
        "25. Nf5": "Instead, I could also do rook e5 etc. But I like what I do here, coz I threaten pawn at g7 and pin horse at d5 (he cannot move thanks to my rook at d1)",
        "25... Kc6": "Now he can take my pawn at b4 if i take his pawn at g7.",
        "26. Ne7+": "again, rook e5 may have been a better move (followed by taking his horse at d5) but all i thouoght about here was getting my rook up there so I could line up one of his pawns. He has been playing very good with no dumb moves, so my mindset was not on major pieces but on getting an advantage.",
        "26... Nxe7": "as expected.",
        "27. Rxe7": "rook \"up there\"",
        "27... Rhe8": "empty threats.",
        "28. Rxf7": "pawn ahead.",
        "28... Ref8": "more empty threats.",
        "29. Rxf8": "I could have taken the g7 pawn, but you see, he has a bishop pointing at my f2 pawn, so he could take that with his rook, complicating the matters.",
        "29... Rxf8": "he takes the rook back.",
        "30. Be3": "i protect my f2 pawn",
        "30... Bc7": "he does not want to exchange bishops because he is down one pawn.",
        "31. h4 h5 32. Kg2": "getting my king out of black squares.",
        "32... Kb5": "attacking my pawn",
        "33. Rc1": "you take my pawn, i take your bishop. I guess d7 would have worked as well.",
        "33... Bd6": "attacks my pawn with two pieces (king and bishop)",
        "34. Bc5": "i protect it and attack his bishop",
        "34... Bxc5": "here i thought long and hard. Should i take it with my pawn or with the rook. Taking the bishop with rook would speed up the game, and I was ahead one pawwn, so i decided to go with that. Now that i think back, using the pawn would have been a lot better because i would have a passed pawn.it would be separated from the other pawn, but anyways...",
        "35. Rxc5+": "i am infact attacking his h5 pawn.",
        "35... Kxb4 36. Rxh5": "IMO i accelerated the game.",
        "36... b5": "now he starts rolling down his pawns.",
        "37. Rg5": "thinking back, i think this was the worst mistake. I should have done rook to h7 and start moving the pawns. I do it later (move 42), but too late.",
        "37... Rf7 38. Rg6": "move it up so i can threaten two pawns on the left side.",
        "38... a5 39. Rc6": "not sure if this is a good move.",
        "39... Ka3": "going for the other pawn. This shows the importance of an active king in an end game.",
        "40. Rc5": "i am like, now i got him, he cannot protect both his a5 and b5 pawns with his king.",
        "40... Rb7": "well, he does not have to, he will protect his g pawn and p pawns at the same time using one rook. Efficient use of technology. Star trek fans will know, this is like Borg or something :)",
        "41. Rh5": "i could do c2 here, but how long will i get to protect that pawn, he will just keep rolling down with the other pawns. I needed an attack plan.",
        "41... Kxa2 42. Rh7": "i should have done this long time ago.",
        "42... b4 43. h5 b3 44. h6 b2 45. hxg7": "i was hoping he would queen immediately and i would get a queen with a check, keeping my queen and rook. I knew if he took my pawn sacrificing his rook, it would not be good for me.",
        "45... Rxg7": "and surely, thats what he did.",
        "46. Rxg7 b1=Q": "now we have a queen for a rook and he has a good pawn on a file.",
        "47. Ra7 Qe4+": "checks",
        "48. Kh3": "i run",
        "48... a4 49. f3 Qd4 50. Ra5 a3 51. f4 Kb2 52. f5 a2 53. g4": "that must have been the dumbest move I made throughout the whole game. He could have just take the queen to c3 , taking my rook, promoting his pawn to queen freely, just mating me in a coupla moves.",
        "53... a1=Q 54. Rxa1 Kxa1": "no i gave my rook for another pawn, i am pretty darn sure to lose the game.",
        "55. Kh4 Qh8+ 56. Kg5 Kb2 57. f6": "just trying to promote the pawns, but i am almost hopeless.",
        "57... Kc3 58. Kg6 Qg8+ 59. Kf5 Kd4 60. g5 Kd5 61. g6 Kd6 62. f7 Ke7": "here, i think he would just put his queen to g7. What I think happened was he was \"dizzy with succcess\" as russian players would put it. This type of stuff happens. I have to admit he deserved a win but lost instead."
    },
    "url": "https://gameknot.com/annotation.pl/rematch-nice-moves?gm=3312",
    "gameName": "rematch, nice moves.",
    "players": "rider_tiger (1200) vs. bukefalt (1476)",
    "opening": "QGD (D08), Albin counter-gambit"
}