{
    "moves": {
        "1. e4": "He starts off kings pawn opening.\r\n",
        "1... c5": "I start off with a new opening I am working on \"The sicilian\"... besides king's indian (which I found was the easiest for beginners).",
        "2. Bc4": "He does what I did in the part 1 opening and comes out with the bishop on his second move. which I was told by many of you is not a very sound move.",
        "2... e6": "Im not sure this is a good pawn push. and I don't think it is in \" the sicilian\" line but it feels right and awkard at the same time. Also this is the move that is played against me whenever I play the bishop to c4 so I figure it a good move.",
        "3. d3": "He moves the queens pawn up one space. Protecting the e4 pawn and c4 bishop",
        "3... Nc6": "I move the knight to c6",
        "4. Nf3": "He brings his knight up to f3",
        "4... Nf6": "f6 is the square I bring my knight to.",
        "5. Qe2": "He brings his queen to e2",
        "5... d6": "This is the move I believe I should have done first but I prepare to bring up my e pawn one more square.",
        "6. Bg5": "He pins my knight.",
        "6... e5": "I go for middle control",
        "7. Nc3": "He brings his knight to c3 looks like he wants to control the center with this move. I think he wants to go to d5",
        "7... Be7": "But instead of countering. I select to further defend my knight.",
        "8. Nh4": "I don't know what his plan is here.",
        "8... h6": "But I go for his bishop freeing my knight",
        "9. Bxf6": "he selects to take.",
        "9... Bxf6": "I retake.",
        "10. Nf3": "He retreats his knight.",
        "10... O-O": "I castle king side.",
        "11. O-O-O": "He castles queen side.",
        "11... a6": "I bring up my pawn to a6 preparing to bring my b7 pawn up to b5 to attack his bishop",
        "12. Nd5": "he moves his knight finally to d5 where I knew it would end up sooner or later.",
        "12... Qa5": "Noob mistake? I forget my original plan to move my b file pawn to attack his bishop and I move my queen instead to attack his king.",
        "13. Kb1": "HIs king notices this and moves.",
        "13... Be6": "I attack his knight so that I can move my knight closer to his kings corner.",
        "14. Nxf6+": "but he takes my bishop on f6 at the same time checking me",
        "14... gxf6": "i retake with my pawn.",
        "15. Bxe6": "He takes another of my bishops. which in the long run I think it helps him because it makes it harder for me to check his king without my bishops in this predicament",
        "15... Nb4": "I continue with my plan instead of simply retaking his bishop. Which I think is my biggest mistake of this game. In my mind\" I have a checkmate in one move after this one\". But I don't see that this can easily be countered.",
        "16. a3": "After he does this move, LoL, I am lost and confused. Wondering what happened and I think all is lost as I look at his bishop and wonder why I did not take it and now I have to retreat. Very costly mistake!!",
        "16... Nc6": "knight retreats.",
        "17. Bd5": "bishop attacks my knight",
        "17... Rac8": "I protect my knight by moving the rook to the c file.",
        "18. Qe3": "His queen goes for my pawn on h6",
        "18... Qb5": "I believe as I move here I am thinking that all is lost and I'm not sure where I want to move and my time is running so I just make a move to the kings file. (This move serves no purpose! I am thinking the game is over for me from here. But if you saw my first game you know that this game isn't over till the time is out or the king can no longer move.)",
        "19. Qxh6": "He does what I expected. Maybe a better move wouldv'e been to move my king up one spot to protect this pawn prior to this move?",
        "19... Nd4": "Still thinking all is lost for me. I am just trying to trade off pieces from here.",
        "20. Qxf6": "He takes another of my pawns with his queen and now my king is out in the open.",
        "20... c4": "As he destroys my pawns around my king I start to form a plan to take out his pawns around his king to find room for attack.",
        "21. Qg5+": "He checks my king. I guess this is just to buy him time because I notice it is not much he can do from here.",
        "21... Kh8": "I move my king.",
        "22. dxc4": "he takes my pawn with his pawn on c4",
        "22... Rxc4": "I take with my rook.",
        "23. Bxc4": "He takes with his bishop",
        "23... Qxc4": "I take with my queen also looking at his c2 pawn getting ready to check.",
        "24. Rdc1": "He makes this move and again I think my hope is lost.",
        "24... b5": "Then I start to aim for his a3 pawn.( with lack of a better plan afterall)",
        "25. Nd2": "he moves his knigh to d2 to threaten my queen.",
        "25... Qe2": "I move my queen to e2 to get away from the knight and also get a pawn undefended on f2.",
        "26. h4": "White moves pawn to h4 getting ready to move on my king.",
        "26... Rg8": "I foil his plot by moving my rook to g8 attacking his queen.",
        "27. Qf6+": "He checks my king again simply showing me who is still in control of this game.",
        "27... Rg7": "I move my rook between white's queen and my king.",
        "28. Nf3": "I see that if his knight joins the fight I am done for.",
        "28... Qxf2": "So now I take his pawn on f2 also pinning white's knight to his queen.",
        "29. Ng5": "I think here white is still thinking about his plan when he didn't notice the pin on his queen and foolishly moves his knight. which is a game changing blunder. White also sends me a message at this point letting me know that he made a mistake.",
        "29... Qxf6": "I take his queen.",
        "30. Rhf1": "He chooses to continue and attacks my queen with his rook.",
        "30... Qh6": "I move my queen to h6 attacking his pawn on h4",
        "31. g3": "He protects his pawn",
        "31... f6": "I attack his knight on g5 by moving up my F pawn",
        "32. Nh3": "his knight flees.",
        "32... Rxg3": "I take his pawn gaining momentum",
        "33. c3": "He attacks my knight with his pawn on the other side of the board.",
        "33... Ne2": "and I move my knight to e2 attacking his rook on c1 and defending the rook on g3 and also threatning checkmate if not for his rook on f1",
        "34. Rce1": "He attacks my knight by moving his kings rook to e1",
        "34... Qd2": "I protect my knight by moving queen to d2",
        "35. Nf2": "he moves his knight to f2 to keep it from being captured.",
        "35... Re3": "This is a foolish move here. I am thinking I could use my rook to defend my knight and free my queen, but I only trap my queen on his next move.",
        "36. Red1": "My queen is trapped! My next thought is that my queen is done! So where can I move my pieces so that I will have an advantage after my queen is captured. Maybe knight to c3 is a good move checking his king? but then xc3 , Qxc3..and so on which might have been what some of you would have done. but I chose the following moves.",
        "36... Qxc3": "I allowed my queen to be taken on c3",
        "37. bxc3": "pawn takes queen.",
        "37... Nxc3+": "I follow up with a check which I foresee before my queen is taken.",
        "38. Kc1": "He moves his king. This is also foreseen.",
        "38... Na2+": "Again I check.",
        "39. Kb2": "He moves his king closer to attack my knight. ",
        "39... Re2+": "and my next move is to check again this time with my rook also defending my knight.",
        "40. Kb3": "after this I notice that his king is unable to move. I am also unable to move my major pieces. I notice if I can get the king in check in this situation I will win the game. ",
        "40... a5": "So I slowly begin to move my A file pawn to check his king.",
        "41. Rxd6": "I don't know who wouldv'e won if he didn't make this bad move, but instead of moving his rook to d4 saving his king. It looks like he didn't notice that his king was stuck and I think he was going for my king but nevertheless this is a game losing move.",
        "41... a4#": "CHECKMATE!!   Thanks for watching this game. I know it is a long game and if you have time to check this out I would enjoy reading your feedback and or tips if you all have any. Again I am a new chess player and im starting to play everyday now and I am also studying different openings and tactics on youtube and also some of your annotated games on this site ! So I hope you enjoyed this game, and to everyone that has commented , I would like to thank you all for making me a better player. Hopefully I can play you in the future. "
    },
    "url": "https://gameknot.com/annotation.pl/remarkable-win-by-improving-player-part-2?gm=40329",
    "gameName": "Remarkable win by improving player part 2",
    "players": "terris87 (noob) vs. bbqmcfadden (avg)",
    "opening": "Sicilian defence (B20)"
}