{
    "moves": {
        "1. e4": "Hi all; annotating this very interesting game on request! White opens with the old standard.",
        "1... c5": "Sicilian. The theory behind this opening is notoriously deep; I'm not going to go into it very much.",
        "2. Nf3 d6 3. Bb5+": "This is the Canal–Sokolsky Attack, also called the Moscow Variation. ",
        "3... Nd7": "3...Nc6 and 3...Bd7 are more common, but there's nothing wrong with this move.",
        "4. d4": "Good, solid, thematic move.",
        "4... Ngf6": "Black invites some very sharp play.",
        "5. e5 Qa5+ 6. Nc3": "Forced.",
        "6... Ng4": "?! This is the first deviation from book lines as far as I know. While there's nothing obviously wrong with this move--it doesn't lose material or anything--the Knight is badly misplaced on g4, and can be driven away at White's leisure with a gain of tempo, with moves like 7.Ng5, setting up 8.e6. Best was 6...Ne4, building pressure on the Nc3 (which was the whole reason for playing 5...Qa5+).",
        "7. O-O": "Probably 7.Ng5 was stronger but this is fine.",
        "7... b6": "?? This error is as subtle as it is deadly. By blocking b6, Black has cut off his Queen's retreat path, and now there's suddenly no way at all to save her! 8.Nd2 (also threatening the undefended Ng4) followed by 9.Nb3 wins the BQ outright, with no chance of escape! She could try to run to b4, but then 11.a3 keeps her trapped, and she'll have to move again to gain more than a pawn for her life.",
        "8. exd6": "The line I gave above was better, but this is still fine, blowing open the BK's cover. Look how much better White's position feels, even though material is basically even: the BQ is useless and on the verge of being trapped for good, and none of Black's minor pieces are doing anything useful either. White's minor pieces, on the other hand, are all actively placed and contributing to the threats on the board.",
        "8... a6": "8...e6 was better. Now White has the chance to break through the center with the advanced pawn and Nd5 after playing 9.Bc6 to get the Bishop out of danger (with tempo!)",
        "9. Bc6 Rb8 10. a4": "? Simply put, it's hard to see a reason for this move. White still has a much better position, but this pawn push does nothing to advance his goals. Much better was 10.Nd5, threatening Nc7+, adding pressure to e7, as well as threatening to trap the BQ with 11.Bd2.",
        "10... exd6": "? That pawn was a thorn, to be sure, but opening up the King like this is an invitation for disaster. Now White's 11.Nd5 comes with even more potent threats, as the King no longer has any defenders (and Re1 is on the way, as well as the other threats I already mentioned). Black needed to play 10...cxd4 instead, to let his Queen out of her miserable little corner.",
        "11. h3": "Another pawn move with no purpose: what does this accomplish for White? It forces Black to put his Knight in a better position--hardly what White wanted to do here! 11.Nd5 was certainly best, threatening all manner of checks and threats (Nc7+, Re1+, Bd2...).",
        "11... cxd4": "! Black finds the correct intermezzo here, gaining time to free his Queen and allowing his Knight to relocate to the strong e5 post.",
        "12. Nxd4 Nge5 13. Re1 Be7": "? Black wants to castle, and rightly so, but this doesn't get it done, because White still has too many threats. Better was 13...Qc5, where the threat of entrapment is gone and the Queen can finally be of some use tying down the White pieces to defending one another.",
        "14. Nd5": "Correct! All the old threats are still viable; Black is in trouble. Again, material is *even*, but there's no question that White is in vastly better shape.",
        "14... Bb7": "? This should have come earlier, say around move 10, or else later. Counterplay is the right thought, but this is the wrong way to do it just now, as it simply loses a piece outright to a nice tactical shot...",
        "15. Nxe7": "! If now 15...Kxe7? 16.Bxb7! Black cannot recapture, because 16...Rxb7?? 17.Nc6+ wins the BQ. Black must simply run away with his tail between his legs.",
        "15... Kxe7": "Or take, as I mentioned above, but since he can't avoid losing material, he should not be making more exchanges. The general case of the rule is simple: when behind, don't exchange!! Better was probably 15...Kf8 or maybe 15...f6, seeking to get the King out of the center any way possible.",
        "16. Bd2": "? But White misses his own combination! As I mentioned above, this was a good threat several moves ago, but now that Black's c-pawn is gone, the Queen can't be trapped this way. Best was to pick up the free Bishop with 16.Bxb7.",
        "16... Qc5 17. Bf4": "?? White is trying to put pressure on the Ne5, but overlooks his hanging Bc6. His mobility should have allowed him to continue with several powerful threats (indeed 17.Nf5+ Kd8 18.Bxb7 Rxb7 19.Be3 Qmoves 20.Nxd6 wins a pawn and an exchange with no counterplay for Black), but getting too tricky has led him to drop a piece instead.",
        "17... Bxc6 18. Nxc6+ Qxc6 19. Bxe5": "? Now it is White's turn to make trades at the wrong time: he is down a full piece at this point; he shouldn't be making exchanges. Perhaps 19.Bg3, threatening 20.f4, would have been better.",
        "19... dxe5 20. c3": "Trying to stop the bleeding and allow the Queen to get into play.",
        "20... b5": "! Black keeps up the pressure, offering exchange after exchange. When material is uneven (especially by a full minor piece), exchanges almost always benefit the player who has more.",
        "21. a5 Nc5": "21...b4 was stronger, taking advantage of the queenside minority to force trades. The text hangs the e-pawn and gives White back the initiative.",
        "22. Rxe5+ Ne6 23. Rc1": "I don't much like this; that pawn isn't really going anywhere if Black doesn't want it to. The computer prefers 23.Qg4 or 23.Qh5, and so do I. When behind, counterplay has to become the name of the game!",
        "23... Rbd8 24. Qg4 Qc7": "This just invites White to put his Rc1 on e1 where it belongs. I like 24...Rhe8 better, in preparation for ...Kf8 to get out of the pin.",
        "25. b4": "?? White misses the threat, and the rest is history.",
        "25... Qxe5 26. g3 h5 27. Qh4+": "?? 27.Qh3 was called for (though 27.Resigns was playable). Now Black has his own chance to trap a Queen, but unlike White, he jumps on it immediately.",
        "27... g5": "0-1. Faced with ruinous material loss, White resigns. Not a perfect game by any means, but certainly interesting to see all the tactical opportunities that sprang up as early as move 6! Well played by both sides, and well worth a close look at all the middlegame maneuvering. We saw both sides make poor choices that would have been strong at another time: a good reminder that every single chess position is different. What was strong last move may be fatal now! Thanks for reading!"
    },
    "url": "https://gameknot.com/annotation.pl/request-timing-matters?gm=47520",
    "gameName": "Request: Timing Matters",
    "players": "chicoboy (1237) vs. rockroller (1484)",
    "opening": "Sicilian (B51), Canal-Sokolsky (Nimzovich-Rossolimo, Moscow) attack"
}