{
    "moves": {
        "1. Nf3 d5 2. c4 dxc4 3. Qa4+ Nc6 4. Qxc4 Nf6 5. g3 e6 6. Bg2 Bd7 7. O-O Bd6 8. d4 O-O": "The starting position. Both sides have castled but still need to complete their development.",
        "9. Nc3 Na5 10. Qd3 a6 11. b3 Nd5 12. Nxd5 Bb5 13. Qd2 exd5": "The first skirmish leaves material still even.",
        "14. Bb2 Nc6 15. Rfe1": "Development is now completed, and we enter the middle game proper.",
        "15... Re8 16. e3 Re4 17. Rac1 h6 18. Bf1 Bxf1 19. Rexf1": "Another set of minors vanish.",
        "19... Qf6 20. Ne1 Rae8 21. Qe2 Nb4 22. Bc3 Qg6 23. Qd2": "Some slow maneuvering produces, as yet, no advantage for either side.",
        "23... a5 24. a3 Nc6 25. Bb2 Bxg3": "Some action! Black elects to sacrifice a piece for two Pawns to open lines for an attack on my King.",
        "26. fxg3 Re4xe3 27. Ng2": "The best way to refute a sacrifice, Steinitz said, is to accept it. So I do, and now I try to drive back Black's attacking efforts.",
        "27... Re3e2 28. Qc3 Re8e4 29. Rce1": "I offer to swap down, to reduce the attacking power.",
        "29... Re2xe1 30. Rxe1 Rxe1+ 31. Qxe1": "The swap is completed, and the end-game stage begins. In spite of a slight material deficit, Black still has good drawing chances.",
        "31... b5 32. Nf4 Qc2 33. Qc3 Qd1+ 34. Kg2 Ne5": "Undoubtedly an oversight.",
        "35. dxe5 c5": "With his Q still on the board and a passed QP, Black can still drag on his resistance for a while.",
        "36. e6": "Black must neutralize this Pawn at once. If he lets me get  another Queen...",
        "36... d4": "Forcing me to move.",
        "37. Qc1": "Now it's apparent Black's last move was a tactical error.",
        "37... Qxb3": "Obviously he can't afford to trade Queens...",
        "38. e7": "...but now I get a second one.",
        "38... g5": "This can be safely ignored.",
        "39. e8=Q+": "The final blow.",
        "39... Kg7 40. Ne2 Qd5+ 41. Kg1": "Black resigns, as he has run out of checks."
    },
    "url": "https://gameknot.com/annotation.pl/reti-opening-q-r4-ch-variation-mini-tournament?gm=56708",
    "gameName": "Reti Opening (Q-R4 ch variation) mini-tournament",
    "players": "last_archimedean (1401) vs. starkkev (1343)",
    "opening": "Reti accepted (A09)"
}