{
    "moves": {
        "1. e4 e5 2. Nf3 Nc6 3. Bb5 Nf6": "Not surprised to see Terence play the Berlin Defense, as that's what I do in the Ruy Lopez, these days, as he has seen.",
        "4. d3": "And, reversion gets a solid pawn chain.",
        "4... Bc5": "And, Terence continues his development and prepares to castle.",
        "5. c3": "As reversion told me, this is a very common theme in the Ruy Lopez.  Now, later comes with d4, and we're talking about gain of tempo and a solid pawn chain.",
        "5... O-O": "As noted, Terence protects his monarch, at once.",
        "6. Nbd2": "As white, I would've pinned black's Nf6 with Bg5 and then continued with my development as this appears to leave reversion with a cramped position.  Then again, he will, at some point, find a better posting for his N, which as Susan Polgar mentioned, and as Ken told me, an important part of chess is finding a better place for your pieces.",
        "6... d6": "Opening up a line for his Bishop.",
        "7. h3": "I am not sure why reversion played this.  It doesn't help to get his King to safety.  Then again, with more experienced players, there's always something that I do not understand.",
        "7... Bb6": "I'm also not sure why Terence retreated.  As black, I would've brought my Bc8 into play, at once.",
        "8. O-O": "But, I would've played this since my attitude (thought process) is, except for rare circumstances where it's clear blunder, castling early.",
        "8... Ne7": "As noted earlier, this appears to leave black with a cramped position.  However, he repositions his N.  I just don't understand why g6 is a better square, though.",
        "9. d4": "Following up with c3-d4 plan, as noted earlier.",
        "9... Ng6": "As noted earlier, there's something about this that makes the N stronger then on c6.",
        "10. Bd3": "I guess, reversion's adding a defender to e4.  However, I would've done that by centralizing my Rf1-e1 since that's one of my theme's, anyhow.",
        "10... c6": "Presumably, Terence wants to open up another square for his Bb6.",
        "11. Re1": "Centralizing his Rook, at once.",
        "11... Be6": "Completing his development.",
        "12. a4": "Trying to get a semi open file for his Rook.  But, Terence has other ideas first which is by exchanging pawns, followed by, centralizing his Rf8 in the same way as reversion, since it'll go to e8.",
        "12... exd4 13. Nxd4 Re8 14. Nd2f3": "Bringing his N to a better spot, as previously noted.",
        "14... Bd7": "I don't know why Terence moved here.  But, I would've played 14...Qe7 because I think that it's generally a good idea to bring the Queen in front of the Rook as I've studied similar examples.",
        "15. Bc2": "Likewise, I can't even begin to figure out why reversion played this.  I'm not saying it's pointless or anything of the sort, which it might soon.  Rather, I don't what variations go into this (how white follows up afterwards) which is also what I allude by a difficult position.",
        "15... a5": "Stopping white's semi open file.",
        "16. Qd3": "Mobilizing his Queen.",
        "16... d5": "Terence is preventing white from getting a passed pawn, with this move.  However, it gets more interesting since several exchanges are going to occur.",
        "17. exd5 Rxe1+ 18. Nxe1 Nxd5 19. Nef3": "Remobilizing his N.",
        "19... Qc7": "Similarly, Terence is activates his Queen.",
        "20. Bd2": "Like wise, reversion also remobilizes his Bishop.",
        "20... Ndf4": "Terence is interested in exchanging N for B, which means it must be more.  I understand as it's how I used to feel.  But, I wouldn't have gone for this exchange, only because of Kenneth_fiore_3 outlined which is not to exchange for the thrills of it.  The reason I say this is, were I to go for an exchange, it would just be because I could.  So, there has to be more to this that I'm missing.  However, reversion is going to go along with the exchange plan.",
        "21. Bxf4 Qxf4 22. Re1": "Reversion offered a draw here which Terence accepted.  And, I also would've offered a draw, in this position, as I don't see how any can win.  So, minds think alike here as it is a drawish position, I guess with no way to win, for sure."
    },
    "url": "https://gameknot.com/annotation.pl/reversions-open-fire?gm=61482",
    "gameName": "Reversion's Open Fire!",
    "players": "reversion (2359) vs. elyhim (2572)",
    "opening": "Ruy Lopez (C65), Berlin defence, Kaufmann variation"
}