{
    "moves": {
        "1. Nc3": "It's more unusual then the Owen's or Grunfeld's Defense, which is another reason for studying.  What I've been told is that it's good to get used to something different, in case, your opponent plays.  This is called the Dunst Opening.  While the other two are unusual, this is an irregular opening.",
        "1... g6": "So, Ken goes for it with a fianchetto.",
        "2. Nb1": "As I've seen before, Joe brings his N, and then, he hides back to it's original square.  He's testing Ken, and this will continue for a while.",
        "2... Bg7": "Developing his Bishop.",
        "3. Nf3": "Similar to before, Joe brings out his other N.  Likewise, that will also move back and forth for some time.",
        "3... d6": "Meanwhile, Ken prepares to get his DSB into play by developing a center pawn.",
        "4. Ng1 e5": "Advancing his other center pawn, whilst, achieving a pawn chain.",
        "5. Nf3 Nc6": "Developing another piece.  Unlike with Joe, it'll remain developed, but TA knows more theory which is why does extremely well.",
        "6. Ng1 f5": "Unlike with Joe's other opponents, I don't consider any moves by Ken pointless since I know him.  There's always a good reason, but sometimes, I don't know the logic.  This one of those times.  Instead of advancing the weakest pawn on the board, I would've developed my Ng8.  Now, for some reason, it can't be as good, but what I don't understand is what would happen if black played 6...Nf6, at once.",
        "7. Nc3 Nf6": "But, now, Ken continues to develop.",
        "8. Nb1 Be6": "Completing his development and preparing to castle.",
        "9. Nf3 Qd7": "Preparing to castle Q side.  So, there's something I'm missing because, in this position, I would've castled short, at once.  Therefore, my inference is that, with the K side weakened (due to Ken's f pawn advancing), 9...0-0 would've left the monarch exposed.",
        "10. Ng1 d5": "I also don't why this was played.  It appears to leave Ken with a bad bishop.  Kind of premature to talk about it, but this seems applicable to me, in a blitz game.  The idea being is to play fast but accurately or lose, as TA emphasized with the Q sacs.",
        "11. Nc3 d4": "I knew that it was a matter of time before Ken would play this.",
        "12. Nb5": "Testing his knowledge, Joe's brings his N to this square, as opposed to, retreating on b1. ",
        "12... a6": "Not to my surprise, Ken reattacks.",
        "13. Na3": "Forced.",
        "13... Bf8": "At first, I wasn't sure why Ken played this.  It appears to undevelop his DSB.   However, after studying it, I would've likely played this, as well.  The idea is to exchange Knight for Bishop.",
        "14. Nb1": "But, this is a closed position since TA's are blocking the other pieces.  Therefore, the N is worth more which is why he retreats back to b1.",
        "14... Bd6": "After which, Ken brings his DSB to a stronger outpost, similar to what we see when black's N's are on the seventh rank (or visa versa) when white's Knight's are on the second rank.",
        "15. Nf3": "Going back to where it was, after Ken attacks with his next move.",
        "15... e4 16. Ng1 h6": "?? I'm not exactly sure why Ken played, but according to Joe, this loses which is why I gave it two queiries.  It's important to note that TA showed everyone two positions with the fen.  This was the first.  In it, he said, \"His weak pawn storming combined with his perplexed Knight moving only drew him in farther to my electrical storm.\"",
        "17. c3": "So, Joe punishes Ken with this move.  The idea being c2-c3, followed by, an eventual d3-d4, just like what we see in the Ruy Lopez, when black plays ...Bc5  Although that wasn't played here, it's still very applicable due to me exploring the mind of a senior master.",
        "17... g5": "The idea is preventing an exchange of pawns which is why Ken played this.",
        "18. cxd4": "But, Joe does it, anyhow.  The idea being, is that, when Ken takes back, Joe will gain tempo by attacking the Knight.  ",
        "18... Nxd4 19. e3 Nc6 20. d4": "This is the same c2-d4 plan.  Usually, it's done to get a pawn chain.  Therefore, I don't understand the logic, quite as well, since it's an exchange is going to occur, starting with the en-pessant capture.  And, when Joe takes back, Ken will castle long, as noted on his 9th move.",
        "20... exd3 e.p. 21. Qxd3 O-O-O 22. a3": "Preventing 22...Nb4, or 22...Bb4+",
        "22... Ne5": "With Joe less developed, Ken harrasses the Queen.",
        "23. Qc2": "But, as we're about to see, it's of no concern in blitz, against a senior master.",
        "23... Qc6": "So, Ken goes for a Queen exchange which Joe will accept.  The idea being that, without black's Queen on the board, white will benefit.  As the saying goes, \"Don't trust your opponent.\"",
        "24. Qxc6 Nxc6 25. Nc3": "Redeploying his Knight.  But, this time, however, it will not retreat back to b1.",
        "25... Nd5": "Going for a N exchange.",
        "26. Bc4": "Which Joe declines with a half pin by developing another piece.",
        "26... Be5": "The idea is to exchange Knight for Bishop.",
        "27. Nf3": "Since this position has become open, Joe accepts by continuing with his development.",
        "27... Bxc3+ 28. bxc3 Rhe8": "Centralizing his other Rook.",
        "29. Bd2": "Completing his development.",
        "29... Na5": "Hitting Bc6, which Joe protects, whilst, keeping the half pin.",
        "30. Ba2 Nc6": "Retreating back to it's original outpost, where it's better placed.",
        "31. h4": "The idea is to maintain an open file by exchanging.",
        "31... g4": "Not to my surprise, Ken declines and goes on the attack by advancing that pawn another square.  ",
        "32. Nd4": "So, Joe reattacks and goes for another exchange, which Ken accepts.",
        "32... Nxd4 33. cxd4 Bg8": "Unlike before, I do not know why Ken played this.",
        "34. O-O": "But, Joe waists no time in castling.  And, what's interesting to note is that both sides have castled on opposite wings.  I don't see this too often.",
        "34... h5": "Preventing h4 from advancing another square.  I just don't know why that was a concern since it doesn't promote.  But, that's where there's still much to study and learn which is the reason behind an annotation, like this.",
        "35. Bb1": "Going after f5.",
        "35... Bh7": "Which Ken protects.",
        "36. g3": "Likewise, Joe prevents g4 from advancing another square.",
        "36... Nf6": "I don't know why Ken played this.",
        "37. Rc1": "Threatening a dangerous attack which will be very difficult to drive off.",
        "37... Ne4": "I'd call this Hope Chess, though.  That's because, although I'm unsure, it appears that Ken is hoping to meet the threat without a lot of calculation by reattacking.  But, I understand it very well in blitz.",
        "38. Ba5": "Not to my surprise, however, Joe isn't fooled and goes right after the target.",
        "38... Rd7": "So, Ken meets it with this move to prevent 39.Bxc7.  In this position, I would not know what to do as white.",
        "39. Bc2": "Not surprisingly, however, is the fact that Joe does.  That's another example of where I start to see the patterns and become familiar with theory.  In other words, this is where it starts to become second nature to me.  With that being said, I understand the logic behind this move since he's mobilizing his LSB where this covers more squares, and it will turn out to be very damaging, as we're about to see.",
        "39... Kb8": "I'm not sure why Ken played, but in my books, one move is about as good or bad as another, here.  ",
        "40. Rab1": "With that being said, Joe is still preparing for his attack.",
        "40... b6": "Going after Joe's bishop.  How I see it is that, black might as well, from how I see it.",
        "41. Ba4": "This the plan that I saw coming with 39.Bc2, as now, Joe will win material.",
        "41... b5": "Doing what he can, however, Ken goes after Ba4.  It appears that black is hoping that white will take back.  And, after taking back, when Joe checks, kenneth_fiore_3 would have ways out of trouble.",
        "42. Rc6": "But, Joe prevents that possibility by playing this.  ",
        "42... Kb7": "Still doing what he can, Ken attacks the Rc6.",
        "43. Rbc1": "But, this was the logic behind 42.Rc6  As now, Joe has doubled up.  In doing so, black has no chance of counterplay because of what's about to unfold.",
        "43... Nd6": "I'm not sure why Ken moved here.  As black, I would've, likely, played 43...Ree7 to add protection to the pawn.  But, as we know from the lecture, black is busted, one way or another.",
        "44. Rc6xc7+": "So, Joe takes, at last.",
        "44... Rxc7": "As anticipated, Ken takes back.",
        "45. Rxc7+": "But, when Joe makes this recaptures, Ken resigned.  The moral of this story is what TA posted, which I find good for learning purposes.  In it, he said, ...\"its my \"illusion of weakness\"that scrambles the brain of many players!They simply do not know how to properly attack or defend against such an odd way that a player would move,their game simply falls apart when I become suddenly and unexpectedly aggressive!\""
    },
    "url": "https://gameknot.com/annotation.pl/reverse-alkehine?gm=60503",
    "gameName": "Reverse Alkehine",
    "players": "tactical-abyss (2283) vs. kenneth_fiore_3 (1974)",
    "opening": "Dunst (Sleipner, Heinrichsen) opening (A00)"
}