{
    "moves": {
        "1. d4 b5": "orangoutan as black ! ",
        "2. Nf3 Bb7": "main line",
        "3. e3": "the e pawn has to stay home so i keep the interesting a8/h1 diagonal for after",
        "3... a6": "i have to protect b5",
        "4. c3": "missing agresivity, i whould play c4 to recover the center. But already from now, i equalize with white in the sense that they loose the initiative",
        "4... Be4": "plan was to advancec6, then take b knight, then exit the queen in a5 ...etc",
        "5. Nbd2": "of course white dont accept a LSB there in the center !",
        "5... Bg6": "so i keep this threat just to upset him !",
        "6. Be2": "preparing castle. My game is bad, undevelopped. now i have to exit my pieces and occupe the center",
        "6... d5 7. O-O c6": "renforcing, like a dutch's \"stone wall\". I have the presentiment that i will never castle...",
        "8. Ne5": "this is the white tactical blunder : he is upset about my LSB, so he absolutely whant to take it...BUT in case he take it now, i will take back with my h7 paw ! never mind castleling ! so the white castle will be under  A BIG ROOK TREATh !",
        "8... e6": "preparing to exit my queen to the kind side",
        "9. Nxg6": "Of course he does ! ",
        "9... hxg6": "So now ? Do you see the problem for white ? Of course, my position is not perfect : undevelopppment, no castle...but i have a very good tactical oportunity and if i play aggressively enought, it must bring me to the victory. In french we say \"de l'audace, encore de l'audace, toujours de l'audace !\" ",
        "10. Nf3 Nf6": "preparing for the fight. I have to kill this defensive f3 knight",
        "11. Bd3 Nbd7 12. b3": "preparing queen side attack",
        "12... Bd6": "i dont have special plan for the moment. Maybe just puting more and more pressure hoping that he will panic ! he he he ...",
        "13. c4 g5": "this little pawn should be enought treath to postpone the queen side white attack",
        "14. h3": "it was ! Look at this answer : it is not good at all, i will have my kniht in g4 in e few moves !",
        "14... g4": "first",
        "15. Nh2": "worse ! i will take h3 !",
        "15... gxh3": "ho ho, big problem for white camp",
        "16. g3": "temporary good answer",
        "16... Nh5": "so now i will try some sacrifice to break the poor white castle. I hope i will have time enought to bring my both rooks in front of the white king...",
        "17. e4 Nxg3": "sacrificing my courageous poor horse !",
        "18. e5": "good to cancel the d6/h2 diagonal treath, ...but not enought to prevent my knghit to take the f1 rook. So i think that ths was a big blunder. Otherwise, i whould have my BSB in g3 and this whould be anyway very ambarassing !",
        "18... Nxf1": "delicious ! and  i still can save my DSB",
        "19. Qxf1 Be7": "i'm now +4. I have to transform it in a victory.",
        "20. cxd5": "no a problem, we both loose a tempo",
        "20... cxd5": "my pawn structure in queen side is strong. Maybe a good attack for white whould be a4. but they wont have enought time for it",
        "21. Bd2": "i dont really understand this move. maybe in order to bring its a rook to the battle ? but in witch way ??",
        "21... Bg5": "so i take this free tempo to bring my queen in the action",
        "22. f4": "good answer.",
        "22... Bh4": "i choose to leave my DSB in the battlefield",
        "23. Be1": "i will take this oportunity to open a second colon, the g one wicht is very interesting because there is the white king n front !",
        "23... g5": "so will white exchange bishops ?",
        "24. Bxh4": "yes...bad time for white",
        "24... Rxh4": "theathening f4 and after d4. And preparing to bring my queen and fortunately maybe i will bing the second rook also !",
        "25. Nf3": "not good : answer is Rxf4 pinig the knight !",
        "25... Rxf4 26. Qxh3 Qe7": "prepare to brng my a rook : allowing free passage for the rook i hav to move the king to d7, so first i have to move the knight to f8 or maybe f6 if i move first the f pawn to f6 ...too complicated but i dot have the choice, this will make me loosing a lot of time and will give to the white the initiative.",
        "27. Qg3": "but i have a new plan ! : 27. ...f6  28. exf6 Kxf6  and if 29. Kf3xg5 Rf4 f5!! wining the queen. It is not exactly what it will happen, but it will finish by the same murderous weapon ! bloody ending is coming, be patient !",
        "27... f6": "first",
        "28. Rf1": "ho ! no e5xf3 i'm desperate",
        "28... f5": "so with this move it is the same kind of treath just that it will be the f5 paw that will ensure the rook",
        "29. Rc1": "white seems to ignre the treath, second BIG blunder...NO MERCY !",
        "29... Rg4": "he he he, this is the end ! So tell me : Do you liked this \"reversed orangoutan\" ?"
    },
    "url": "https://gameknot.com/annotation.pl/reversed-orangoutan?gm=47416",
    "gameName": "Reversed Orangoutan !...",
    "players": "andrei9 (1394) vs. 31415 (1219)",
    "opening": "Polish defence (A40)"
}