{
    "moves": {
        "1. e4 e5 2. Nf3 Nc6": "I would've played something else as per reversion's advice to try different openings.  But, we're at a time where I took a big cut in my games due to a busy schedule.  And while we're there, I decided to just stick with what I know to avoid taking any chances.  So, I prepare for the Berlin Wall should he play the Spanish Opening.",
        "3. Bc4": "But, he plays the Guaco Piano.",
        "3... Nf6": "So, I continue developing.  Afterall, the idea is, \"Know your principles\".",
        "4. Ng5": "I was surprised to see him play this and deemed it as a ?! move.  As black, I wouldn't have played this because it appears to be unsound, and even a cheapo tactic.  If he's trying to do what my opponent did in the last team game, with that nasty fork, it won't work because of what I play next.  And, if given the choice because of what Jack showed, I'd use my Bc8 and prepare to exchange since that's my bad B.  But, the only thing I can do against that threat is block it with my next move.  The only downside is that I don't want to exchange, but it's forced, in this position.",
        "4... d5 5. exd5 Nxd5": "I'm not ready to exchange yet.  But, in this position, there is no choice.  As I considered 5...Ng4, but if I did this would be a free pawn.  And, I was determined not to allow that because of Jack's advice of not giving anything away, as I have also taught my students.  In fact, that's one of the most important things that I have emphasized to them.",
        "6. Nxf7": "This is not a Q sac blitz game that we've been talking about.  So, feeling that this might have been a mistake, I, without any hesitations, took his N.  As I was in the process of compensating for the exchange.  As now, I felt that he became overly confident here.  That's because I felt that with best play, there's a slight chance of getting a draw or possibly winning.  Although, I had a feeling that he'd won due to being stronger, but keeping in mind what TA taught me, I was going to make things as difficult as possible for white.",
        "6... Kxf7 7. O-O": "Not surprisingly, he castles.",
        "7... Be6": "Remebering what went wrong in my game against bigpeta by not following up properly after being ahead, combine with Jack Stockel's advice to break the pin with the B, I don't hesitate to do it as this also develops.  I'm also keeping in mind that it's a matter of time before I complete my development.  And, from there, I'll try to organize my pieces which is what should've been done there.",
        "8. Nc3": "Not to my surprise, he develops.  But, due to being ahead, this is where I go back to what used to happen, where I'll exchange whenever possible.  Afterall, I'm adhering to the chess quote which describes what to do when behind and trying to do it here for an advantage. That is, \"Exchange pawns, not pieces\"",
        "8... Nxc3 9. Bxe6+ Kxe6 10. Qg4+ Kf7": "I also was, somewhat similar to my games with Ken not concerned about those checks, as I deemed them as nuicanses since I got out of them allright.  My attitude (thought process) is now what.  Another way of putting it after getting out of check is, \"is that all you can do?\"",
        "11. dxc3": "And, when thinking it, I calculated this move, as now, I'm still ahead.  So, now I'm feeling more and more comfortable about my position.  And, it'll continue this way, until I know that I'm lost.",
        "11... g6": "Without worrying about anything, I fianchetto for that nice long diagonal.",
        "12. f4": "Not knowing why this was played, I didn't see the point of this move.  With that, I felt that he just waisted tempo when the time could be used to develop his Bc1.  So, I use that time to complete my development and place him in check.  I know it's a nuisance.  But, once he gets out, I'll create a passed pawn and try to use it to my advantage, if possible.",
        "12... Bc5+ 13. Kh1 e4 14. f5": "Now, he is trying to get a passed pawn.",
        "14... g5": "So, I try to block his Queen in an attempt to stop it.  But, this is where I start realizing now that there might have been more then a pawn push.  His next move is check and I start losing confidence here.  He is going to have a nasty check.  Not only that but some of his attacking forces against my King is nastier then I thought.",
        "15. Qh5+ Kf8": "Feeling that the last check was nuicanse, I just move back.  But, this is where I start to fully realize how bad the position is for black.  You will note that (not the waist of tempo or seeing the point) but the other parts that went into confidence is identical to how I was thinking against Ken in that second game.  That was, when I was an entire piece down.",
        "16. Bxg5 Qd7": "But, now I realize what's going on.  Of course, I'm protecting the Queen, but there's a little more as he's threatening mate which I'm trying to hold off for the moment.",
        "17. f6": "And, I saw this coming which is setting up that attack since a P+B+Q and are known to win when there are right up against the K.  This is no exception since just like a couple of other games, it'll be overwhelming and will force his win quickly.",
        "17... Bd6": "Trying to delay that attack, I play this.",
        "18. Bh6+": "But, once this was played, I resign.  If I play 18...Kg8, he'll mate shortly after 19.Qg5+.  So, the only way to prevent is to give up my Queen with 19.Bxg7  From there, I don't stand a chance.  So, I decided that this was a resignable position. "
    },
    "url": "https://gameknot.com/annotation.pl/reversions-open-fire-finale?gm=62325",
    "gameName": "Reversion's Open Fire Finale!",
    "players": "harpov (2673) vs. jkarp (1298)",
    "opening": "two knights defence (C57), Fegatello attack, Leonhardt variation"
}