{
    "moves": {
        "1. e4 c5 2. c3": "My preferred system versus the sicilian",
        "2... d5": "the best response, despite it's very low popularity. I see Nf6 most with the occasional Nc6/d6",
        "3. exd5 Qxd5 4. d4 Nf6": "Nc6 is usually played here, but Nf6 has to be played at some point, and jumbling your move order up in the opening is a very useful ploy when playing a weaker opponent.",
        "5. Nf3 Nc6 6. Be3 cxd4 7. cxd4 e6 8. Nc3 Qd6": "Qa5 is better in my opinion. But this is perfectly playable.",
        "9. Bd3 Be7 10. O-O O-O 11. Ne4": "Maybe a bit early to play this, possibly should wait until after Re1,Rc1 but couldn't see a problem with it so played it.",
        "11... Nxe4 12. Bxe4 f5": "Very aggressive move. Got a bit worried about f4, g5 sort of thing here but I don't think black can get away with it..",
        "13. Bxc6 bxc6 14. Re1 Rb8": "Playing on his brand new shiny open file",
        "15. b3 Ba6 16. Bg5 Bxg5 17. Nxg5": "Applying pressure to the weak e6 pawn.",
        "17... Rbe8 18. Rc1 h6 19. Nf3 Re7": "Black doesn't seem to really have a plan here, there's not much for him to do except sit and defend the two weak pawns (e6 and c6)",
        "20. Rc5 Rd8 21. b4": "It's quite easy to play at this point for me, I have all the time in the world to cramp black into his own territory and then launch an attack on whichever pawn I want to.",
        "21... Bc8 22. Qc2 Bd7": "Black sets about getting the bishop round to the kingside. I'm not really bothered but from his point of view it's better than doing nothing at the queenside and what else is there to do?\n",
        "23. a4 Be8 24. Qc4 Qf4 25. Qc3": "25 Rxe6 ... Bf7",
        "25... Qd6 26. Rc4": "The point of this move is to eventually leave c5 for the knight to go to. What's the rush anyway? ;)",
        "26... Rb7 27. Ne5": "My knight joins the party",
        "27... Rb6 28. h3": "why not? Black has vague back-rank threats and his last move proves he has no plan of action.",
        "28... Rdb8 29. Nd3": "Knight was going here anyway, just conveniently it defends the b-pawn at the same time!",
        "29... Kh7 30. a5 Rb6b7 31. Nc5": "Knight is finally where I want it. Attacking that poor e6 pawn.",
        "31... Re7 32. Re5": "Preparing Qe3 to attack the e6 pawn further. There is still no time limit on white here, I can do whatever I like in this position as long as I keep black contained and tied to the defense of his pawns.",
        "32... Rb5 33. Qe3 Bf7 34. Qc1 Bh5 35. Qe1": "I'm not quite sure what I'm doing here, just looking for an opening really.",
        "35... Kg8 36. a6": "Eventually formed this plan of getting the Knight to b7 and piling up on the c-pawn.",
        "36... Be8 37. Nb7 Qd7 38. Qc3": "My inital plan here was to play Rxb5,cxb5, Rc5. But I hadn't forseen it loses the d-pawn so went with this.",
        "38... Rxe5": "I was prepared for this. I thought if black plays this it opens up a diagonal on the a7 pawn which is surely undefendable.",
        "39. dxe5 Qd1+ 40. Kh2 Qe2 41. Qd4": "Theres the diagonal.",
        "41... Rd7": "A good move. I can't take the pawn because I drop my rook and the only other space for my queen is c5, which falls to Rd5. Leaving me with just one option.",
        "42. Nd6": "I realised this isn't actually too bad-a move once I realised it was my only choice and looked into it. I'm now on blacks c-pawn and the knight is very strong and attacking the black bishop. Leaving black with just one option also.",
        "42... Rd8": "the only move. Unfortunately I still can't take on a7 because of Qxe5 .",
        "43. Rc5": "Played this to hold the e5-pawn. Although it does let the a7-pawn off I don't think it's an option for me any time soon with all the threats of the black queen.\n\nI assumed black would take on a6 here and had analyzed the following line\n43 ... Qxa6\n44. Qh4 ... Qb6\n45 Qe7 ... Bh5\n46 Qxe6 \n\nSurely this has to be winning for white?\nI didn't spot blacks next move though",
        "43... Kh7": "I didn't consider this move and so missed what a good move it actually was. Initially I thought hmm well fine, I'll just play Qh4 and black has neither Qb6 nor a pawn to show for it but the cleverness of this move is in removing the check of Qxe6. Black can play Rb8 and pick up both the b and a-pawns for his e pawn.\n\nThis led me to a rethink until I eventually came up with this.",
        "44. Ra5": "Now the rook is defending both the a6 and e5 pawns and is no longer blocking the diagonal on the a7 pawn. Which means black must finally do something to defend the a7 pawn, hence also weakening his position. \n\n",
        "44... Rd7": "The only move.",
        "45. Qc5": "Now I have both the a7 and the c6 pawns under attack and all my pawns are defended. Aswell as removing the pin on the knight to attack the bishop. Black cannot defend everything surely?",
        "45... Bh5": "Unfortunately he can. The bishop moves away, the rook holds the a pawn and after looking into it White cannot take the c-pawn because of\n\n46 Qxc6 ... Qxf2\n47 Qxd7 ... Bf3\n0-1\n\n",
        "46. b5": "after a long long think I came up with this as a new plan. Surely black is forced to take the pawn, then I can recapture with the rook (not the knight due to 47 ... Rd5 - advantage black) and pay Rb7 to surely finally kill that damn a7 pawn!",
        "46... cxb5 47. Rxb5 Rd8": "Making this move now rather than after Rb7 (Rb7 forces Rd8)",
        "48. Rb7 Ra8": "Now I didn't analyse this particular line any further when I worked this out earlier because I just assumed here that the a-pawn was doomed. But I cannot take it straight away because of Rxa7,Qxa7,Qxe5 0-1\n\n",
        "49. Nb5": "Now it really is finished though!",
        "49... Qe4": "This is where things get complicated. After working it out I cannot simply take on a7 as planned because of \n50 ... Rxa7\n51 Nxa7 (Qxa7 ... Qxe5 ) ... Be2!\n\nNow there is no way for me to defend the a6 pawn this way as the only way is 52 Qa5 or Qd6. Both of which fall to Bf1!!\n\nThe best I can muster is \n52 Qd6 ... Bf1\n53 Qc6 (53 f3 ... Qe2 0-1) Qxe5 \n\nWhich is very nice for black. So this requires a complete rethink yet AGAIN!",
        "50. Qd4": "Came up with this quite simple move in the end as it is very effective. \n\nBlack cannot really move his queen without allowing Rxa7 and if he trades queens then the knight can easily hop back to b5 and win the a7 pawn without any danger being posed by the white-sqaured bishop.",
        "50... Qc6": "The only spot for the queen without allowing Rxa7.",
        "51. Qd7": "Forcing the queen swap and giving white a strong advantage in the following endgame as there is no hope for the a7 pawn.",
        "51... Qxd7 52. Rxd7 Be2": "An irritating move that stops a7 being taken immediately (Rxa7, Rxa7, Nxa7, Bxa6 = 0.5/0.5)\n",
        "53. Nc7": "Winning the e6 pawn and defending a6.",
        "53... Rg8": "Rb8 may look more attractive but loses to Nxe6,Bxa6,Rxg7 \n\nThe reason for this move being to protect the g-pawn and therefore allow 54 Nxe6 ... Bxa6",
        "54. Re7": "Nxe6 is perfectly playable here but Bxa6,Rxa7,Bc4 is still drawable for black. Besides, what's the wait? All blacks pieces are tied down again!",
        "54... Bc4 55. Nxe6 Bxa6 56. Rxa7 Bc4": "Alright so this is identical to the position I quoted before! But I was entitled to have a try.",
        "57. Nf4": "There should be a win here if I play correctly.",
        "57... Rf8": "Black has little choice but to wait and set himself best he can for a 1pawn and knight vs bishop draw.",
        "58. e6": "This pawn is the key though. If I can't queen it I need to at least gain a substantial reward for letting it go.",
        "58... Re8 59. Nh5": "This will do! The beauty of it is g7 is undefendable due to Rg8, Nf6 !!\nBlack is forced to take the pawn and I win 2 pawns for it to go 2 pawns up.",
        "59... Rxe6 60. Nxg7 Re2": "There is no way to defend f5 because Black cannot stop Nxf5 delivering check and the knight attacking his rook all in one move.",
        "61. Nxf5+": "Munch. 2 pawns to the good. Getting closer!",
        "61... Kg6 62. Ne3": "Attacking the bishop and therefore buying me a move to save my f-pawn",
        "62... Be6 63. Kg3 Rb2 64. f4": "Starts the pawns rolling",
        "64... Rb3": "Black has very little play here but must make a choice here. To either stay behind the pawns in the hope of thwarting white with annoying checks and pins, OR to deploy the rook in front of the pawns and try to get a deadlock in them and draw. \n\nI think black chooses correctly. The rook cannot stop the pawns from the front as my knight can always manouvre itself into a position to attack the king bishop or rook on ANY sqaure and march the pawns on.",
        "65. Kf2": "65 Kf3 ... Bd5 \n66 Kf2 ... Rb2 \nIs annoying.",
        "65... Rb2+": "Same check as i mentioned before apart from now I have f3 to move to.",
        "66. Kf3 Bc8": "The only way to get a h1-a8 diagonal check in as Bd5  is unplayable and Bd7 cannot be played to set up Bc6 ",
        "67. g4": "The necessity to play Bc8 before delivering a check is cruical here as it gives me time to push the g-pawn rather than being forced to play Kg3 and wedge my king in front of the pawn halting its progress.",
        "67... Bb7+ 68. Kg3 Rb3": "You may think this is back to sqaure one of |Kf2, Rb2  but luckily I have a way out.",
        "69. Kh4": "I can leave the knight completely undefended and escape the checks to h4 as blacks rook cannot leave the defence of B7.",
        "69... Kf6 70. Nf5": "Now my knight can move on as it is no longer needed to protect my king back there.",
        "70... Kg6 71. Nd4": "A better position for my knight as it is unthreatened.",
        "71... Rb4 72. f5+": "Provides a nice little outpost for my knight on e6.",
        "72... Kf6 73. Ne6 Be4 74. Kh5": "Attacking the undefendable pawn.",
        "74... Bg2": "I was expecting to have to meet Rb8 with Rh7 here. (kxh6  Rh8#)\n",
        "75. Ra3": "Kxh6 isn't sound after Bxh3.",
        "75... Bd5 76. Kxh6": "Now it is. Although Rb8 looks like it forces mate it does not.",
        "76... Rb8 77. g5+": "Due to this. I can now play this virtually forcing Kxf5 followed by Ng7  giving me 2 passed pawns and almost certainly a win.",
        "77... Kxf5 78. Ng7+ Kf4 79. Nh5+": "Making way for the g-pawn.",
        "79... Kf5 80. Nf6": "Making way for the h-pawn!",
        "80... Bc6 81. h4 Rh8+": "Does not win the h-pawn due to",
        "82. Nh7 Rd8 83. h5": "The pawns march on aswell as providing a useful block to Rd6 ",
        "83... Rd6+ 84. g6 Kf4 85. Nf8": "Making way for Kh7 to remove the pin on the g-pawn.",
        "85... Kg4 86. Ra5": "Protecting the h-pawn and allowing Kh7",
        "86... Bd5": "Cutting out my defence of the h-pawn.",
        "87. Ra4+": "Forcing the king away and bringing blacks resignation. Kh7 is now playable and black cannot prevent at least one of the pawns from queening!"
    },
    "url": "https://gameknot.com/annotation.pl/revenge-for-game-6?gm=13318",
    "gameName": "Revenge for game #6!",
    "players": "paddl3s (1841) vs. gm_dursley (2117)",
    "opening": "Sicilian (B22), Alapin's variation (2.c3)"
}