{
    "moves": {
        "1. e4": "This was top board in a match between Wirral League Juniors and Wirrla League Adults to celebrate 50 years of the Wirral League.",
        "1... c5 2. Nf3 Nc6 3. d4 cxd4 4. Nxd4 Nf6 5. Nc3 d6": "So far a very conventional Open Sicilian.",
        "6. Be3": "But this is unusual, better is Bg5, Bc4 or Be2, as this can be hit by.....",
        "6... Ng4": "Hitting his bishop",
        "7. Bg5": "He avoid the exchange.",
        "7... Qb6": "Hitting his knight. If he moves it Qxf2 is mate!",
        "8. Bb5": "by pinning my knight, he saves his Nd4. This is his only move really!",
        "8... e5": "Again hitting his knight, which dare not move, as it allows mate.",
        "9. Nd5": "So he hits my queen.",
        "9... Qxd4": "I take his knight, threatening mate on f2.",
        "10. Qxd4": "So he exchanges",
        "10... exd4": "I take back.",
        "11. Nc7+": "He checks",
        "11... Kd7": "King moves",
        "12. Nxa8": "And we reach an interesting position, where although I am the exchange down, I should eventually win the knight on a8. Although I didn't know it at the time, all this has been seen before.",
        "12... h6": "I hit his bishop",
        "13. Bh4": "He retreats. ",
        "13... g5": "I hit it again.",
        "14. Bg3": "The only square!",
        "14... Bg7": "I want to protect my pawn on d4",
        "15. O-O-O": "This increases the pressure on d4, and prevents, say Ng4-e5",
        "15... Be5": "I threaten to exchange bishops and follow it up with Nxf2, forking his rooks.  A gameknot game, farenheit451 (1722) vs. thebigdaan (1687), continued with 16. Bxe5 dxe5 17. Rd2 Kd6 18. c4 Be6 19. c5+ Kd7 20. b4 Rxa8 21. h3 Nf6 22. f3 Kc7 23. Bxc6 bxc6 24. Kb2 a5 25. Ra1 axb4 26. a3 bxa3+ 27. Rxa3 Rxa3 28. Kxa3 Nd7 29. Kb4 f5 30. exf5 Bxf5 31. Ra2 Kb7 32. Rd2 Nf6 33. Ka5 Nd5 34. Rb2+ Kc7 35. Ka6 Bc8+ 36. Ka7 Ne3 37. Re2 Be6 38. Rb2 Bc8 39. Re2 Be6 40. Rb2 Bc8 41. Re2 and black won. I think 16. Bxe5 is a mistake as it straightens out Black's pawns and Danny's move is better.\r\n",
        "16. Rd2": "He simply protects f2.",
        "16... Re8": "Now I threaten to exchange on g3 and win his e pawn.",
        "17. f3": "So he protects e3",
        "17... Ne3": "I advance my attacked knight.",
        "18. a4": "I'm not convinced about this move. I think the idea is in some variations if he takes on e5, I take back with the rook hitting Bb5.",
        "18... Re6": "So that if he exchanges on e5 I can take back with the pawn and protect d4 with Rd6. But as his next move prevents this, Re6 may just be a waste of time.",
        "19. Re1": "There is now a sort of half pin on the d file. He can take on e5 and if I take with the pawn he can play Re1xe3. There is not much I can do about this, so I may as well round up his knight on a8",
        "19... b6": "Like so.",
        "20. Bxe5": "So he takes.",
        "20... Rxe5": "I take back. He can't take on d4 immediately as I have RxBb5! breaking the pin, so he must exchange on c6 first.",
        "21. Bxc6+": "Like so.",
        "21... Kxc6": "I take back.",
        "22. Rxd4": "He takes.",
        "22... Nxg2": "I take.",
        "23. Red1": "He moves his rook.",
        "23... Kb7": "I go after the knight.",
        "24. Nxb6": "He may as well get a pawn for it.",
        "24... axb6": "I take.",
        "25. Rd4xd6": "He takes.",
        "25... Be6": "I offered a draw here. White has a very slight material advantage, but it is virtually impossible to convert.",
        "26. b3": "So he supports a4",
        "26... Nh4": "I attack a pawn",
        "27. Rd1d3": "He protects.",
        "27... Kc7": "With a view to the following combination. If now 28. c4 Nxf3 29. Rxe6 fxe6 30. Rxf3 Rxe4 we manage to reach an ending with level material. But my opponent makes the losing blunder.\r\n",
        "28. Rd6d8": "This is a terrible move!",
        "28... Nxf3": "Ouch!",
        "29. Rh8": "He hits a pawn",
        "29... Nxh2": "I take another.",
        "30. Rxh6": "He takes.",
        "30... Ng4": "Hit the rook!",
        "31. Rh5": "He moves.",
        "31... Nf6": "Now I am winning another pawn and will have two connected passed pawns.",
        "32. Rh1": "As it is pretty hopeless for white I will not comment on the next few moves.",
        "32... Nxe4 33. Rg1 g4 34. Rd4 f5 35. Rh1 f4 36. Rh7+ Kc6 37. b4 f3 38. Kb2": "He wants to play b5+ Kc5 and Rc7 mate, but first he needs to protect his rook on d4 with c3, and first he moves his king up to protect c3. But it is too slow.",
        "38... f2 39. b5+ Kc5 40. c3 Nxc3 41. Kxc3 Re3+": "and white resigns. Many thanks for reading this, please comment and rate this annotation on the star system."
    },
    "url": "https://gameknot.com/annotation.pl/revenge?gm=56196",
    "gameName": "Revenge!",
    "players": "Daniel Savidge (ECF158) vs. Charles Higgie (ECF172)",
    "opening": "Sicilian (B58), classical"
}