{
    "moves": {
        "1. e4 e5 2. f4 exf4 3. Nf3 g5 4. h4 g4 5. Ne5 Nf6 6. Bc4 d5 7. exd5 Bd6 8. O-O": "The Rice Gambit. All games in this mini-tournament start from this position. It may not be a sound gambit by Grandmaster standards -- you won't see Anand break it out playing against Kramnik -- but one thing can be said for sure: it does lead to interesting play.",
        "8... Bxe5 9. Re1 g3 10. Rxe5+": "This game was one in which momentum shifted back and forth with almost every move. I momentarily equalize the material...",
        "10... Be6 11. dxe6": "...only to blunder away the Exchange with this move...",
        "11... Qd4+": "...after my opponent comes up with this nice bit of tactical play.",
        "12. Kh1 Qxe5 13. exf7+": "I ended up getting a Pawn for the Exchange, and a threatening one at that. My position isn't great but it's playable.",
        "13... Ke7 14. Nc3": "Time to start developing the Q-side.",
        "14... Nc6 15. d3 h5 16. Bd2 Ng4": "With a Knight, a Queen and two advanced Pawns pointing at my King's position, my opponent has something going here. Time to focus on defense for me.",
        "17. Qe1": "Momentarily freezing the Black Q to the K-file. With 17... QxQ 18 RxQ ch K-B3 Black could have entered an end game one Pawn up, but he understandably thinks he can still attack my King which is isolated in the corner.",
        "17... a6 18. Qxe5+": "I decide to remove the threat by exchanging Queens.",
        "18... Ncxe5 19. Re1 Rh7 20. Bxf4": "Material is even again and with 20...K-B3 Black could have preserved the balance, with a good chance of an eventual draw. The Knight would be unpinned and would threaten to capture my advanced Pawn.",
        "20... Kd6": "A mistake. With the Knight still pinned, now by the Bishop, I can attack and win it with my QP.",
        "21. d4 b5 22. Bb3 c5 23. dxe5+": "Not only winning the Knight, but if 23... K-B2 threatening 24 P-K6 dis ch with two connected, advanced passed Pawns.",
        "23... Kc6": "This, however, is worse. Now I can win the Rook on QR1 with a skewer.",
        "24. Bd5+ Kc7 25. Bxa8 Rxf7": "Black's position looks hopeless, but now it's my turn to blunder. I simply overlook 26... RxB.",
        "26. e6+ Rxf4 27. e7 Nf6 28. Nd5+": "The decisive blow. Now the Knight either must move or be captured, allowing my Pawn to promote.",
        "28... Nxd5 29. e8=Q Rxh4+ 30. Kg1": "I still have to be slightly careful. With my King stuck on KN1, a back-rank mate possibility exists.",
        "30... Nf4 31. Qe7+ Kc8 32. Qxh4": "With the Rook -- and back-rank mate chance -- gone, Black resigns."
    },
    "url": "https://gameknot.com/annotation.pl/rice-gambit-mini-tournament?gm=39102",
    "gameName": "Rice Gambit mini-tournament",
    "players": "thehellion (1374) vs. therealprologic (1212)",
    "opening": "KGA (C39), Kieseritsky, Rice gambit"
}