{
    "moves": {
        "1. d4": "My opponent had the white pieces and he started with d4,",
        "1... Nf6": "I responded with knight to f6,",
        "2. c4": "and after c4 this game can transpose into various Indian systems.",
        "2... e5": "However I chose to take the liberty to play a less common line; namely the Budhapest gambit with e5,",
        "3. d5": "My opponent played d5 and we have Budhapest gambit declined, most common response to Budhapest gambit is pawn takes e5 followed by knight to g4, but back to our game;",
        "3... Bb4+": "The game continued with bishop to b4; check, allowing me to play pawn to d6 without locking the dark squared bishop behind the pawn chain.",
        "4. Bd2": "Bishop to d2; blocking,",
        "4... Bxd2+": "bishop takes bishop; check,",
        "5. Nxd2": "white recaptured with knight,",
        "5... d6": "and only now d6.",
        "6. e4": "E4; improving his center control,",
        "6... Na6": "knight to a6; knight is going to c5, a nice outpost aiming at e4, throughout the game c5 will keep being a nice outpost for my knights,",
        "7. Ngf3": "Knight from g to f3; developping,",
        "7... Nc5": "knight to c5,",
        "8. Qc2": "queen to c2; defending e4,",
        "8... a5": "pawn to a5; expanding on the queen's side, also preventing b4, kicking the knight from its outpost,",
        "9. Be2": "bishop to e2; developing and white is ready to castle,",
        "9... O-O": "black castles king's side,",
        "10. O-O": "and so does white.",
        "10... Bg4": "Bishop to g4; developping the last piece and pinning the knight,",
        "11. h3": "pawn to h3; kicking the bishop,",
        "11... Bh5": "bishop to h4; retreating,",
        "12. Rfe1": "rook from f to e1; unpinning the knight, but not really aiming at anything...",
        "12... Bg6": "bishop to g6; now black has three attackers on e4 pawn,",
        "13. Bd3": "bishop to d3; white now has four defenders on e4 pawn, but white is losing tempo moving that same bishop twice over the same diagonal...",
        "13... Nfd7": "Knight from f to d7; falling back, preparing to open the f-file and backing up the c5-outpost to keep the tempo,",
        "14. a3": "pawn to a3; threatening b4, ruining my nice outpost, I can ofcourse not let that happen,",
        "14... a4": "and now a quiet move to the rescue, pawn to a4; countering b4 with en passant,",
        "15. Nh2": "knight to h2; falling back looking to reposition,",
        "15... Nxd3": "knight takes bishop on d3; making room for the other knight to ocupy the outpost with tempo on the queen,",
        "16. Qxd3": "queen takes knight and is now a target for the other knight,",
        "16... f5": "but there is no hurry, black's position here is just fine, \"Don't interrupt your enemy when he's making a mistake.\" -Napoleon Bonaparte-",
        "17. f3": "Pawn to f3, supporting the center, but weakens a lot of dark squares around the king...",
        "17... Qh4": "And my queen just happens to be on a dark square and would be keen to occupy an outpost in that area,",
        "18. b4": "pawn to b4; seeking to cease c5,",
        "18... axb3 e.p.": "but I am well prepared: pawn takes pawn en passant,",
        "19. Qxb3": "recapture with queen; threatening b7 pawn,",
        "19... Nc5": "And only now knight takes its position on c5; defending b7 and kicking the queen,",
        "20. Qc2": "queen retreats to c2 and notice how white has now wasted four of his turns moving his queen and she's still on the same spot as after her first move...",
        "20... Rxa3": "And as the position opens up I start to see possibilities for combinations: starting with rook takes h3, winning a pawn, offering to exchange my rook for an important defender of his king, namely the rook on e1.",
        "21. Nhf1": "Knight from h to f1; threatening pawn to g3, cutting my queen's view on e1 with tempo winning the rook, but he was already too late, because in this position I made a move, and three moves later white resigned... Can you spot: the 'killer move'?",
        "21... Nd3": "Knight to d3!",
        "22. Rxa3": "Rook takes rook; the knight is hanging, black can now capture e1 with knight? That's a good move,",
        "22... Qf2+": "But queen to f2; check is even better!",
        "23. Kh1": "King to h1,",
        "23... Nxe1": "and only now knight takes e1; threatening queen to g2; checkmate, but also the queen is hanging! How did white save his queen?",
        "24. Ne3": "He simply couldn't: knight to e3; the only way to prevent checkmate,",
        "24... Nxc2": "knight takes queen and black resigned; both knights and the rook are hanging, possible continuation is:",
        "25. Nxc2": "knight takes knight on c2,",
        "25... Qxd2": "queen takes knight on d2; attacking c2",
        "26. Ra2": "rook to a1; the only way to effectively defend the knight, however white is very cramped in this position with his knight pinned to the rook and the rook bound to the knight. Note that knight to a1 (terrible square for a knight anyway) is not better because of queen to c1; check, forking the rook.",
        "26... fxe4": "Pawn f takes e4 opening the lines for the rook and the bishop to join the assault and we can stop here. Thanks for watching hope you enjoyed it."
    },
    "url": "https://gameknot.com/annotation.pl/rickety-combinations-and-winning-tempo?gm=49504",
    "gameName": "Rickety combinations and winning tempo",
    "players": "Garyisk (1616) vs. Davydavidsson (1568)",
    "opening": "Budapest defence declined (A51)"
}