{
    "moves": {
        "1. e4 c5 2. f4 Nc6 3. Nf3": "I'd recently got ripped apart with this line by a 150 graded player in an OTB match where I played 3...d6 and was hit by an f4-f5 push very early. I've since had some coaching on the line by a player at my club and so was glad to be able to try it out!",
        "3... e6 4. Bb5 Nge7": "The idea is to play g6 and fianchetto the black bishop and then kick out in the centre with d5.",
        "5. O-O a6 6. Be2 d5": "Decided to break out with d5 before fianchettoing.",
        "7. d3": "This is the best move. e5 and exd5 are better for black",
        "7... g6 8. c3 Bg7 9. Na3": "Heading to c2. I'd have played the knight to d2 myself but there's nothing wrong with b1-a3-c2",
        "9... O-O 10. Qe1": "Preparing to bring the queen in to play on the kingside",
        "10... b5": "Black's best counterplay in this variation is on the queenside",
        "11. Nc2 Bb7 12. e5 f6": "Black has no troubles breaking open the centre here. All of my pieces are well placed for a positional battle in the middle.",
        "13. Qf2": "An interesting idea, letting black take on e5 in exchange for my c5 pawn. Although better is exf6 or d4..",
        "13... fxe5 14. Qxc5 exf4 15. Ng5": "White wins his pawn back and looks to have a good position here, although black's position is favourable...",
        "15... Rf6 16. Bxf4 h6": "Kicking the knight away to a bad square",
        "17. Nh3 d4": "A critical move. Black cracks open the centre and weakens white's position..\nIt is not (as it seems) a free pawn.\n\nIf 18 cxd4 ... Nd5!\n\nAnd white is in trouble, Bd6 is white's only move as if the bishop retreats then 19 ... Bf8! Wins the white the queen.\n\nAnd after 19 Bd6 ... Rc8 and black has a healthy advantage.",
        "18. c4 Rf5": "White's 13 Qf2 isn't looking so great now. White's queen is exposed after taking on c5 and she cannot retreat to her comfort zone on the g1-a7 diagonal because of the strong d4 pawn and so is forced to retreat to a weak square on a3.",
        "19. Qa3 bxc4 20. dxc4": "Black now has two very strong passed centre pawns. Perhaps better is 20 Bg4?!",
        "20... e5": "The advance begins.",
        "21. Bg3 Rxf1+": "I decided to trade the rook off before advancing the pawns any further",
        "22. Rxf1 e4": "With the immediate threat of d3 along with the overwhelming space advantage that comes with having two pawns in such an empowering position.",
        "23. Bg4 d3": "There is relatively little white can do to stop them..",
        "24. Ne3 Qb6": "Finally the black queen comes in to play",
        "25. Bf2 Bd4": "The knight is an obstacle in the path of the two passed-pawns and so must be attacked.",
        "26. Nd1 e3 27. Nxe3": "A clever move. White is forced to give up his knight for the advanced e-pawn although the d3 pawn is now unsupported and will also drop.",
        "27... Bxe3 28. c5": "Again, the right move. Much stronger than the obvious 28 Bxe3 ... Qxe3 : - ",
        "28... Bxf2+ 29. Nxf2 Qb4": "The best move. It is in black's interest to trade queens with his king unsafe. \n\n29 ... Qc7\n30 Qb3  \n\nIs not as good for black",
        "30. Qxb4 Nxb4 31. a3 Nbc6 32. Nxd3": "White now has two pawns for the knight",
        "32... Rf8": "I don't mind trading rooks here",
        "33. Be6+ Kg7 34. Rxf8 Kxf8 35. Kf2": "Transposing in to an interesting endgame. Black will be going for the win but white will hope for a draw.",
        "35... Nd4": "Wasn't sure whether to play this or just to play g5 and go straight for  the kill. I prefer the positional approach though. I think It's important to position my pieces well here before committing to anything",
        "36. Bc4 Nec6 37. Ke3 Ke7": "With my pieces now placed fairly well my king heads for the centre to begin pressing forward.",
        "38. Bd5 a5": "Was planning to play Kf6 here but I like the idea of pushing the pawn to a4 to freeze white's queenside pawns to a certain degree. With one pawn vs three I'm never going to have much joy on the queenside. The deciding factor in this endgame will be whether or not I can manage to pick white off on the kingside.",
        "39. g3 a4 40. Kd2": "White doesn't exactly have a plan here.. he just has to stay solid and force black to work as hard as possible to win",
        "40... Kf6 41. Be4 g5 42. Kc3": "White king heads to the queenside where he has more play",
        "42... Ke6 43. Bg2 Nb5+": "Time to reshuffle my knights",
        "44. Kc4 Nc7 45. Bxc6": "Not sure if this is the right idea for white. Although he does have a discovered check winning the g2 bishop to deal with so maybe it is the right move..\n\nI think b4 is perfectly playable here.. that would have been my choice",
        "45... Bxc6 46. Kd4 g4": "Freezing the white kingside pawns and gaining space for black",
        "47. Nb4 Bg2 48. Nd3": "Threatening Nf4 ",
        "48... Bf1 49. Nf4+ Kd7": "49 ... Kf5\n50 c6\n\nAnd white is better off than after Kd7",
        "50. Ng6": "Threatening Ne5 , Nxg4",
        "50... Be2 51. Ke3 Bd1 52. Kd2 Bf3 53. Kc3": "I thought for a very long time here. I have a few choices in this position. One is to play Ke6 and rely on keeping the a4-pawn to stop white's pawns advancing on the queenside and try to play on the kingside, the other is to play Nd5 \n\nBut in the end I decided to play Kc6, followed by Nd5 . Winning the c5 pawn. My a4 pawn drops if I play this but I'd thought it through thoroughly and I'd worked out I can keep my king and bishop defending the queenside and my knight is well positioned to go and pick off the kingside pawns that cannot move.\n\nThis was a pivotal decision in this endgame.. and one I think I got right for once!",
        "53... Kc6 54. Kc4 Be2+": "Forcing the king to b4 to allow Nd5 ",
        "55. Kb4 Nd5+ 56. Kxa4 Kxc5": "This is the position I had analyzed in great depth. White's plan is obvious: To throw his unopposed queenside pawns down the board as quickly as possible.\n\nMy plan is to keep my king and bishop halting the queenside charge, but the key to my plan is my knight can very quickly jump from d5-e3-f1 and pick up the kingside pawns. ",
        "57. Ka5": "I think this is the right move. \n\n57 b4  Kb6\n\nIs more comfortable for black",
        "57... Ne3": "The knight starts It's journey towards the kingside pawns",
        "58. b4+ Kc6": "The king must stay back and stop (or delay for long enough to win via the kingside) the queenside pawns",
        "59. a4": "White gets caught up in advancing his queenside pawns as quickly as possible and (I think) makes a small positional error. Black now has some juicy checks and should be able to win at least one of the queenside pawns..",
        "59... Nc4+ 60. Ka6 Nb2+ 61. b5+": "The other option is \n\n61 Ka5 .. Bd1\n62 Ne5 \n\nBut once again, I feel white makes the correct selection",
        "61... Kc5": "The correct move. Keeping pressure on both pawns and preventing a5.\n\nIf 61... Kc7\n62 Nf4! ... Bf1\n63 Nd5 \n\nWith enough firepower now on the queenside for white to definitely draw.",
        "62. Ka5": "62 Nf4?! .. Bc4\n63 Ka5\n\nIs a possibility",
        "62... Bd1": "Winning the a-pawn although it means white has time to mount a creditable plan around the b-pawn advance",
        "63. Ne5": "!\nDefinitely the right move. Using the time to bring the knight in to the game rather than being tempted to try and pick off some of black's pawns. Stronger than\n\n63 Nf4? ... Nc4 \n64 Ka6 ... Bxa4\n\n-  ",
        "63... Nxa4 64. Nd3+": "Checking the black king away to allow the b-pawn to advance.",
        "64... Kd6 65. Nf2": "Again, white's only move well found.\nThe bishop is torn between the defence of the g-pawn and the knight. Black can afford to lose neither.. so he is forced to play........",
        "65... Nc3": "Bringing blacks big guns a little disconcertingly away from the action (the b-pawn) but It's forced.",
        "66. Nxd1": "White has to play this. If not the bishop goes to f3 and the b-pawn is effectively halted. ",
        "66... Nxd1 67. b6": "My knight is now worringly far away from the ever-advancing b-pawn. Although I had worked out that because the white king must move to a6 to accompany the pawn, my knight has time to stop it because after Nc3,Nd5. Nb4 will deliver check, and therefore can get to C6 to stop the pawn in time!",
        "67... Nc3 68. Ka6 Nd5 69. b7 Nb4+ 70. Kb5 Nc6": "Now the b-pawn is un-queenable.",
        "71. Kc4": "White must abandon the b-pawn to go and go and try to beat black to the kingside and eliminate his pawns.",
        "71... Na5+": "I was a little worried after Kc4. I had (rather naively) assumed white would stick to the b-pawn.\n\nI thought of keeping the knight on c6 to stop the b-pawn and using my king on the kingside, although that draws because the king is then tied to the kingside pawns protection and the knight tied to the b-pawn. \n\nI also considered playing Ne5 , Nf3 and then Kc7 and taking the b-pawn that way and hoping my knight could hold a pawn for long enough for the king to arrive..\n\nBut in the end I went for 71 ... Na5 !\nThe knight deals with the b-pawn allowing the king to get to the kingside (slightly later than the white king) ",
        "72. Kd3 Nxb7 73. Ke4 h5": "!! \nThe key to my whole Na5  plan. The h5-pawn will drop. But my king has time to hold the f3 pawn and the knight arrives in time to stop it being swapped off.\n\n74 Kf5 ... Kd5\n75 Kg5 ... Ke4\n76Kxh5 ... Kf3\n\nAnd black wins. If white tries to play Kh4, h3 and trade the g-pawn off then black has time to play Nd6, Nf5 ! and force the king away from the h3-pawn's defence.\n",
        "74. Kf5 Kd5": "White resigns. One of my best performances on GK so far. I'm very happy with the way I played the sicilian having been thrashed with the same line not long ago, and picking out the right lines in a closely-fought endgame is a new pleasure for me aswell!!\n\nWell played gm_dursley also, Brilliant game."
    },
    "url": "https://gameknot.com/annotation.pl/riot-king-re-match?gm=17442",
    "gameName": "Riot King Re-match!",
    "players": "gm_dursley (2186) vs. paddl3s (1921)",
    "opening": "Sicilian (B21), Grand Prix attack"
}