{
    "moves": {
        "1. e4 d5": "This is the first time we have played, so I didn't know what to expect. I like the Center Counter against an unknown opponent, as it is safe and easy to play. The drawback is that it doesn't fight for a win like the Sicilian, but I am content with my endgame skills. If I can win a pawn I will trade down and try to outplay my opponent in the endgame.",
        "2. e5": "It is most common to trade pawns on d5 since white can play 3. Nc3 to gain a tempo on the queen. The text can transpose to a French Advanced pawn structure.",
        "2... e6 3. d4": "And so we have it. The difference between this and the normal Advanced Variation of the French is that black has not played ...Nf6 yet here. Normally white would wait for the e5 thrust until the knight has developed.",
        "3... c5": "The standard response to put pressure on the white center.",
        "4. Bb5+": "I am tempted to quote Fischer here, \"Patzer sees check, patzer gives check.\" I see no real purpose for this move.",
        "4... Bd7": "Offering to trade my bad bishop for white's good bishop.",
        "5. Bxd7+": "And white obliges.",
        "5... Qxd7": "This recapture allows the b8 knight to develop to c6 and pressure d4.",
        "6. Nf3": "A good developing move that prepares castling, although c3 may be more common in this position.",
        "6... cxd4": "Probably premature, but then I am just an intermediate hacker, so mistakes are expected :)",
        "7. Nxd4 Nc6": "Offering another trade, that if accepted, keeps me ahead in development.",
        "8. O-O": "White castles, which can never be bad. OK, maybe it can be, but it usually isn't.",
        "8... Bc5": "Threatening to win the knight, but white has a myriad of good responses.",
        "9. Nxc6": "But this one allows me to stay ahead in development.",
        "9... Qxc6": "I was torn between wanting to capture towards the center with ...bxc6 and the text move, but I decided not to isolate the a pawn. Stronger players could tell you whether my choice was correct or not :)",
        "10. Qg4": "A brazen attempt to win the g pawn, but I haven't castled yet, and there is no good way to protect it. I considered sacrificing it with:\r\n10...Ne7\r\n11. Qxg7 O-O-O\r\nbut then the f pawn falls too, and I didn't want to play a 2 pawn gambit.",
        "10... g6": "So I play the ugly ...g6.",
        "11. c3": "This move baffled me. I expected white to make a play to invade my kingside on the dark squares, but c3 seems to be simply a waste of time. Not to mention it takes the c3 square away from the b1 knight.",
        "11... Ne7": "It is imperative that I get my king to safety by castling, and even though the pawn cover is compromised, the kingside is still better than the queenside. At some future point I can get the c5 bishop to f8 and then g7 to help defend the dark squares around my king.",
        "12. b4": "And now the point of c3 becomes clear. White is attempting to keep my bishop from getting to the kingside by getting it off the a3-f8 diagonal.",
        "12... Bb6": "Forced, unless I want to play an unsound piece sacrifice.",
        "13. a4": "Gaining queenside space and threatening to kick the bishop back further, but allowing me the time to safeguard my king.",
        "13... O-O 14. Bh6": "And white finally invades with what looks like a strong square for the bishop. I plan to play ...Nf5 and challenge the bishop.",
        "14... Rfd8": "But first, I must save the rook, and getting it behind the d pawn seemed the best place to put it.",
        "15. Qg5": "Threatening Qf6 and Qg7#.",
        "15... Nf5": "So it is time to get rid of the bishop.",
        "16. g4": "Not sure why white plays this. The knight was going to move next turn anyway (taking the bishop), so kicking at it was pointless, and this weakens the pawn cover of the white king. If white wanted to launch a pawn attack, it would be more normal to attack with the h pawn, as black's g pawn is the one advanced.",
        "16... Nxh6": "And white's two piece attack is over. I must say that my position was dangerous for a while, but white did not attack aggressively and gave me time to fix the defects in my position.",
        "17. Qxh6 d4": "Threatening to win the c pawn, and if white trades, I will look to double rooks on the d file.",
        "18. a5": "White takes a moment to move the bishop back another square, but now it eyes the undefended e pawn.",
        "18... Bc7 19. cxd4": "And white decides to trade the c pawn rather than try to protect it. But this allows my pieces to become active.",
        "19... Rxd4": "Threatening ...Rxg4# and attacking the undefended b pawn. The e pawn is still en prise to the bishop. I like my chances here.",
        "20. f3": "This defends the mate threat, but further weakens the pawn cover of the white king. I think I would have played Qh3 to get the queen back in the game, but there really is no good move for white, only less bad ones.",
        "20... Bxe5": "Now I am up a pawn, the b pawn is still hanging to the rook, and I can even win a pawn with 21...Rxg4  and 22...Bxa1. Trading a pair of rooks while winning a second pawn would be tantamount to winning the game.",
        "21. Nd2": "And this lets me uncork a mini-combination that not only wins a pawn, but gets rid of a piece and rook for each side. After this the game is decided.",
        "21... Rxd2": "Temporarily sacrificing the exchange, but the discovered attack by the bishop will let me win the exchange right back.",
        "22. Qxd2 Bxa1": "And now the rook is overloaded, as it cannot recapture on a1 and continue protecting the f3 pawn.",
        "23. Rxa1 Qxf3": "And a two pawn advantage is enough to win from here. It may take a while, with a queen and rook on the defending side, but barring a blunder, the outcome is inevitable.",
        "24. Qg2": "The more pieces that get traded, the easier the endgame for me, so I am happy to accept this queen trade. I would like to trade rooks too, but I don't see an easy way to do that.",
        "24... Qxg2+ 25. Kxg2 Rd8": "And the rook must get active to tie down the white rook to defense. Then my king can go to work.",
        "26. g5": "This over advances the pawn and makes it weak. I think Rc1 to get the rook to an open file was necessary.",
        "26... Rd4": "Attacking one of the weak points in white's position. I expect a sequence like:\r\n27. Rb1 Rg4 \r\n28. Kf3 Rxg5\r\n29. Rc1 Rb5\r\n30. Rc4 b6\r\n31. axb6 Rxb6\r\nand the white rook is tied to the defense of the b pawn.",
        "27. Rc1": "Sacrificing the b pawn for rook activity.",
        "27... Rxb4": "And I will not look a gift horse in the mouth.",
        "28. Rc7": "Too little, too late. I will give up the b pawn since I can get both the g and a pawns for it.",
        "28... Rg4+ 29. Kf3 Rxg5 30. Rxb7 Rxa5": "And now a 4 pawn advantage should lead to a resignation.",
        "31. h4": "If he's not going to resign, he has to move something.",
        "31... h5": "But now he is down to king and rook moves. And neither of them have anything productive to do.",
        "32. Kf4 Kg7": "From here my king cannot be checked and protects the base of the pawn chain. White simply has nothing to do but shuffle pieces around, so he resigns. 0-1"
    },
    "url": "https://gameknot.com/annotation.pl/rise-of-a-chess-god-part-6-1000?gm=641",
    "gameName": "Rise of a Chess God part 6/1000",
    "players": "andra (1049) vs. markpinkston (1418)",
    "opening": "Scandinavian (centre counter) defence (B01)"
}