{
    "moves": {
        "1. e4 Nf6": "The Alekhine Defense. It is one of my favorites although I seldom play this opening.",
        "2. e5 Nd5 3. c4 Nb6 4. d4 d6 5. exd6 cxd6 6. Nc3 g6": "The normal continuation would be 6..... Nc6   7. Nf3 Bg4 when Black has an easy game.",
        "7. Be3 Bg7 8. Rc1 O-O 9. b3 Nc6 10. d5 Ne5 11. Be2 h6": "This is to prevent White from controlling the h6 square with Qd2. ",
        "12. f4": "With this move, White presented Black with another problem; how to mobilize the bishop at c8.",
        "12... Ned7": "There is nowhere else to go except to block the bishop's path.",
        "13. Nf3 Nf6": "Freeing the bishop at c8.",
        "14. h3": "This deprived the bishop at c8 with its preferred destination at g4.",
        "14... h5": "I don't think Black should be afraid of White's expansion on the Kingside with g4. With this move, he clearly demonstrated his intention to place the bishop on f5.",
        "15. O-O Bf5": "Finally, the bishop has mobilized but Black's position is somewhat shaky.",
        "16. Nd4 Qc8": "Black is very willing to trade the bishop but as a result, this enables White to exert pressure on Black's King's position. 16.... Be4 is bad due to 17. f5!",
        "17. Nxf5 Qxf5 18. Bd3 Qd7 19. f5": "This move cannot be prevented after all and Black is bound to lose some pieces.",
        "19... g5": "The pressure on g6 is unbearable. 19.... Kh7?  20. fxg6+ fxg6  21. Rxf6! followed by 22. Qxh5!! and 23. Bxg6!!!",
        "20. Bxg5": "Losing a pawn but managed to hang on for the meantime.",
        "20... Qc7 21. Ne4 Nbd7 22. Nxf6+ Nxf6 23. Bxf6 Bxf6 24. Qxh5": "Losing another pawn but Black managed to prevent certain catastrophe. ",
        "24... Qc5+": "The queen has come to life and Black has now some plays of his own.",
        "25. Kh1 Qe3 26. Rcd1 Kg7 27. Qg4+ Kh6 28. Qf4+": "This is a natural decision to make. Two pawns up going into the endgame, White cannot hope for anything less.",
        "28... Qxf4 29. Rxf4 Be5 30. Rff1 b6 31. g4 a5 32. Kg2 Rfg8 33. Kf3 Kg5 34. h4+": "White decided to give back a pawn for some active piece play.",
        "34... Kxh4 35. Rfh1+ Kg5 36. Rh5+ Kf6 37. Rh7": "If White can double his Rooks on the h-file, it's the end of the line for Black.",
        "37... Rgh8 38. Rdh1 Rxh7 39. Rxh7": "Black has managed to reduced material and go into the endgame with Bishops of opposite colors. I don't think a win for White is clear cut from this time on.",
        "39... Rg8": "Black has managed to place his pieces in ideal positions where it gives him good drawing chances.",
        "40. Be2 Bc3": "The maneuverings has now began. Black's active bishop allows him to create drawing chances.",
        "41. Ke4 Be5": "What else can he do except wait for White to make his move.",
        "42. Kd3 Bf4": "Clearly, White is attempting to catch Black off guard. But then again, Black's bishop is active enough to give him drawing possibilities.",
        "43. Kc2 Be3 44. Kd3 Bf4 45. a3 Bc1 46. a4 Bg5 47. Kc3 Bf4 48. b4 Ra8": "Capturing the pawn with 48.... axb4+ is bad since it will allow the White King to infiltrate.",
        "49. Bd1 Be3 50. Rh3 Bf2 51. Rh1 Be3 52. Rh2 Bg1 53. Rg2 Be3 54. Kd3 Bc1 55. Kc2 Ba3": "Forcing White's hand into making a decision he's not comfortable with.",
        "56. bxa5": "Now Black can make a sigh of relief since the tension has been eliminated.",
        "56... bxa5": "Things is going back to normal again.",
        "57. Rg3 Bc5 58. Rb3 Rh8 59. Rb5 Ra8": "Black see that he cannot make any progress with a Rook sortie deep into the enemy's position, so he decides the Rook just has stay put and respond to any threats by White. Clearly, Black has no winning play here; he's just trying to hang on and survive.",
        "60. Kd3 Ra6 61. Ke4 Bg1 62. Rb7 Ra8 63. g5+": "White has managed to change the nature of the position but still the win is not clear in sight.",
        "63... Kxg5 64. Rxe7 Rf8": "Trying to trick White into playing 65. Ra7??? when 65.... Bxa7 is decisive.",
        "65. Bc2 Bc5 66. Kf3 Kf6 67. Kf4": "What has gone wrong here? In trying hard to find a winning play, White has fallen asleep and leave his Rook ripe for the picking. ",
        "67... Kxe7": "Which Black obligingly did to his joy. What a sudden end to what seems to be a dry and listless game. The win allowed Black to win the tournament and advance to the next round."
    },
    "url": "https://gameknot.com/annotation.pl/rise-from-the-grave-not-really?gm=43444",
    "gameName": "Rise From The Grave..... Not Really",
    "players": "tobiasverhulst (1738) vs. matefork (1675)",
    "opening": "Alekhine's defence (B02), Steiner variation"
}