{
    "moves": {
        "1. e4": "The most aggressive opening move.",
        "1... e5": "Black, it would appear, wishes to avoid the Sicilian.",
        "2. Nf3": "This is the most common and probably best move here.",
        "2... d6": "The Philidor Defense, though rather a defensive option, is sound.",
        "3. d4": "This is seen most often and signifies a battle for the center coming.",
        "3... f6": "This move is altogether too defensive.  This position is designed for a fight and White retains all initiative here (as through most of the game).  The Philidor Counter Defense, which involves 3...f5, would have been better had Black been determined to move the f-pawn.",
        "4. Be3": "dxe4 might be good here, but White wants to bolster his center control.",
        "4... a6": "Confusing.  Builds to a ...b5 move sometime, but otherwise useless.",
        "5. Nc3": "White now has a strong center position, absolutely controlling the d5 square.",
        "5... Ne7": "Black now wishes to counteract that, although the move to f6 now hurts him.",
        "6. Bc4": "More aggressive, and allows for a castle.",
        "6... b5": "Black wants to push the bishop off that square.",
        "7. Be2": "Very defensive, as Bb2 might have been better here.",
        "7... Nec6": "Not altogether recommended; Black moves the wrong knight for the attack on the center.",
        "8. d5": "More pawn advancement, and an attack on the knight.",
        "8... Nb4": "Gets the knight out of the way and attacking White's position, although it is absolutely trapped here.  The knight has no safe move and if attacked will be forced to give itself up for a pawn at most.  A retreat to e7 would have been in order, and even a move to a5 would have been better than this. This is where Black's game really goes to crap.",
        "9. a3": "The inevitable attack.",
        "9... Nxc2+": "Black figures to get at least a pawn for his efforts.",
        "10. Qxc2": "Any other move would have been stupid beyond belief.",
        "10... c5": "Black must now free up operating space.",
        "11. dxc6 e.p.": "But Black has missed the en passant capture.  White figures to disrupt Black's defensive strategy by the exchange of pawns.",
        "11... Nxc6": "The simplest move.  It develops a piece as well, which Black sorely needs.",
        "12. Nd5": "White's plan is to go 13. Nb6, forking the bishop and rook.",
        "12... Be6": "White must now move the knight.",
        "13. Nb6": "There is no longer any fork, but White may as well try it.",
        "13... Nd4": "The dumbest move of the game. Black ignores the threat on his rook and instead tries a stupid attack on a defended square.",
        "14. Bxd4": "White has won a piece whether Black recaptures or not.",
        "14... exd4": "Still dumb.  The rook-for-bishop trade is not at all good.",
        "15. Qc6+": "But White does not intend just to take the rook.  He wants the queen also, and will be happy to, potentially, trade queens and exploit the advantage he'll have.",
        "15... Bd7": "Not a bad move under the circumstances.",
        "16. Qxa8": "White follows through.",
        "16... Qxa8": "Duh.",
        "17. Nxa8": "Likewise, duh.",
        "17... Be7": "Black is thinking to try to be somewhat aggressive and save this game.",
        "18. Nxd4": "Black resigned here (or, actually, signed off and let the computer resign for him).  Look at the position.  Black is down a rook, queen, two knights and a two pawns, whereas White has given up only the queen, a bishop and two pawns.  Black has a vaguely better pawn structure, but the isolated d-pawn is going to be difficult to maintain.  White can also castle on both sides, whereas Black has just the one option.  Black's white-squared bishop has a limited scope, and the same goes for the black-squared bishop.  This game is a disaster for Black, and resignation is appropriate."
    },
    "url": "https://gameknot.com/annotation.pl/rivers-of-blood?gm=39889",
    "gameName": "\"Rivers of blood!\"",
    "players": "johnpbro (1125) vs. netbr (1142)",
    "opening": "Philidor's defence (C41)"
}