{
    "moves": {
        "1. d4": "I think it was GM Bent Larsen who once stated that sometimes chess is pure mathematics, sometimes art and sometimes a pure boxing match. This Kings Indian really had the boxing aspect!",
        "1... Nf6 2. c4 g6 3. Nc3 Bg7 4. e4 d6 5. Nf3 O-O 6. Be2 e5 7. O-O Nc6 8. d5 Ne7": "This has been played thousands of times, but now White has to decide between main lines like: Ne1, Nd2, a4 or b4. More or less it all comes to the same: White attacks on the Q-side, Black on the K-side. The battle is on.",
        "9. Ne1 Nd7 10. Be3 f5 11. f3 f4 12. Bf2 g5 13. a4 a5 14. Nd3 b6": "Black tries to control the important square c5 for as long as possible, but I must admit Bg7 looks awful. Nevertheless it is still well known theory.",
        "15. b4 axb4 16. Nxb4 Nf6": "Only chance for Black is to keep the pawns rolling on the K-side. In poker they call it \"all in!\".",
        "17. Nd3 Ng6 18. Be1 Rf7": "I prefer this to the immediate 18. - h5 idea. For the time being the Rook defends the weak pawn on c7, and in the future it can swing over to g7 or h7.",
        "19. Nb5 g4 20. a5 bxa5 21. Rxa5 Rxa5 22. Bxa5 g3": "I thought this position was fun to look at: The pawn chains! Then I looked at my Bg7 again and didn´t think it was so much fun anymore. But at least it protects the King.",
        "23. h3": "I had a long think here. I am about to be crushed on the Q-side and decided for a dubious sac on h3.",
        "23... Bxh3 24. gxh3 Qd7 25. Nf2": "And a sac in return! Is it necessary? I had expected something like 25. Qd2 and 26. Bd1 to avoid the mate threats, but the position is rather unclear. Still I don´t think Black has enough compensation for the Bishop.",
        "25... Ne8 26. Qc2 gxf2+ 27. Rxf2 Qxh3": "Black is up a pawn in the endgame, but how often do you reach an endgame in a Kings Indian?",
        "28. Rh2 Qc8 29. Be1 c6": "Rather have a weak d6 pawn than a weak c7 pawn. The Black bishop can always protect the d6 pawn from f8.",
        "30. Nc3 Ra7": "Another good reason for playing 18. - Rf7: Suddenly the Rook challenges Whites back rank.",
        "31. dxc6 Qxc6 32. Bf2 Ra1+ 33. Kg2 Qb7 34. c5 dxc5 35. Bxc5 Bf8 36. Bc4+": "In my opinion 36. Bf2 is better. With the Bishop pair still on, White is still almost equal in spite of a pawn down.",
        "36... Kh8 37. Bxf8 Nxf8 38. Rh4": "White has played a very good game so far, and I guess he saw I mate on g8 in some lines after Rg4, but this blunder looses on the spot. 38. Ne2 Qb4 39. Rh1 is still better for Black but far from decisive.",
        "38... Qg7+ 39. Rg4 Ng6": "With the deadly threat h7-h5 or Nf6 and White will have to give up the exchange.",
        "40. Kf2": "Last chance was 40. Nd1 h5 41. Rxg6 Qxg6 with a lost endgame.",
        "40... Qa7+": "With a forced mate in maximum 10 moves.  No, the Kings Indian is not for players with bad nerves!"
    },
    "url": "https://gameknot.com/annotation.pl/rlcpw-iv-1-d4?gm=35979",
    "gameName": "rlcpw IV, 1.d4",
    "players": "rlcpw (1988) vs. ybrevo (2076)",
    "opening": "King's Indian (E99), orthodox, Aronin-Taimanov, main line"
}