{
    "moves": {
        "1. e4 g6": "Groan.",
        "2. d4": "White seizes the centre.",
        "2... Bg7": "Black gets ready to develop his Knight, tuck his King away, and hassle the White pawns.",
        "3. h4": "That is just not going to happen!",
        "3... Nf6": "Maybe a little too routinely played. Black could just open the centre with 3...d4 4.exd4 Qxd4 and quite a free game. But I imagien that goes against a Modern Defence player's natural inclination, which is to get the King away quickly. But the Knight is just a sitting target...",
        "4. e5 Nd5": "Since 5.h5 is obviously threatened, can 4...Ng8 really be a better option? Maybe so, since the Knight is still a target for the White pawns here.",
        "5. h5": "5.c4 is the obvious move, but so keen was I to try Fischer's gung-ho attack I didn't bother with it.",
        "5... Nc6": "Probably better to hit the pawns with 5...d6. c4 is still the natural move next.",
        "6. hxg6": "But I'm determined Black is not going to set up his usual defence. It's not happening.",
        "6... hxg6 7. Rxh8+ Bxh8": "Surely I will play 8.c4 now?",
        "8. Bh6": "No. I undo all my earlier advantage completely with this very suspect attempt to keep the Black Bishop off g7 and the King away from f8. It's a doomed plan, but never mind.",
        "8... d6": "Black attacks my pawns at last. I can still play 9.c4 and follow up with Na3 - that Knight has to be developed as I'm not going to be castling K-side, am I?",
        "9. Nf3": "Now I'm the one playing routinely, bring out a K-side Knight when there's no Rook there to allow castling. Once more 9.c4 shifts Black's Knight from the centre. Not only that, but Black can now win one of my centre pawns with 9...dxe5 10.dxe5 Nxe5 11.Nxe5 Bxe5 - I quite forget that Bishop stuck (for the present) on h8.",
        "9... Bg4": "Instead of the pawn win, Black gets another piece out, with a useful pin into the bargain.",
        "10. exd6": "I'd noticed the potential pawn loss rather belatedly and decided to avoid it by exchanging.",
        "10... cxd6": "Surely better to capture with the Queen and castle Q-side? I'm not the only one with K-side castling ruled out, after all.",
        "11. Bc4": "Now 11.c4 allows a rather dangerous Queen forte 11.Qa5+ and I can't block with 12.c3. So I attack the Knight with my Bishop instead.",
        "11... e6": "He defends, and though it's tempting to give Black doubled isolated pawns, that central pawn of mine is way too exposed now.",
        "12. c3": "So I defend it.",
        "12... Bxf3": "A rather strange exchange, but one I welcome, since it brings my Queen out attacking f7. Black's advantage has rather gone, for now.",
        "13. Qxf3 Qh4": "Attacking the exposed, and foolishly placed Bishop on h6",
        "14. Bd2": "It goes against the grain to go all the way back to c1. And in fact I needn't have retreated at all: 14.Bxd5 and if 14...Qxh6 15.Bxc6+ with possibly a winning game. Worse still, Black can now play 14...Bxd4 and if 15.cxd4 Nxd4 gives Black good compensation for the exchange.",
        "14... Nf6": "Phew. He retreats the Knight instead. We were both probably oblivious of 14...Bxd4",
        "15. g3": "Now I can drive away the Queen.",
        "15... Qe4+": "Offering an exchange I probably should have taken: Black's Queen is far more of a nuisance than mine",
        "16. Qe2": "But I want him to do it!",
        "16... d5": "He wants me to do it!",
        "17. Bb5": "But I want him to do it.",
        "17... Ke7": "But he wants... we could go on like this for some time.",
        "18. Be3": "Now the chance of an exchange for either of us has gone.",
        "18... Qh1+": "I could play 19.Qf1 but I've had enough of potential Queen exchanges...",
        "19. Kd2": "So I step onto the square just left vacant by the Bishop, and am thankful I never got around to developing that Queen's Knight.",
        "19... Ne4+": "Black goes on a King hunt...",
        "20. Kc2 Rc8": "I don't like the way this is shaping up, with a Rook directed at my King...",
        "21. a4": "This daft move should have lost me the game. Getting the Rook out via a3? yes, brilliant. Now 21...Nxd4+ 22.Bxd4 Bxd4 (that forgotten piece) 23.Qf1 Qf3... not looking good is it?",
        "21... a6": "Probably another routinely played move - one side advances a wing pawn so the other does the same. But a missed chance for Black.",
        "22. Bd3": "Getting rid of the Knight on c6 was called for, even if it did bring the Rook out. For now that forgotten Bishop again... 22...Bxd4 and if 23.Bxd4? Nxd4 wins the Queen.",
        "22... Nb4+": "Obviously not nearly as strong...",
        "23. Kb3": "My King gets away.",
        "23... Nxd3": "Black exchanges one of his most dangerous pieces...",
        "24. Qxd3 Nd6": "And the game's pretty much level, though it's high time that Bishop on h8 came into the game.",
        "25. Ka2": "Allowing my Knight to get out without losing the Rook.",
        "25... Qe4": "Black now goes on something of an exchange spree, something that I fall in line with, even though I know my endgame play is not good.",
        "26. Qxe4 Nxe4 27. Nd2": "Offering another exchange and finally freeing that Rook.",
        "27... Nd6 28. Rh1": "This gets me the open file, but I don't do much with it. Nothing, in fact.",
        "28... Nf5 29. Bg5+": "Now it's my turn to start exchanging.",
        "29... Bf6": "Possibly not a good exchange for me, since that Bishop has done nothing much throughout the game.",
        "30. Bxf6+ Kxf6": "It does bring the King out though. Who's best placed here? Hard to say.",
        "31. g4": "I decide to start my endgame endeavors by driving away the Knight...",
        "31... Nd6 32. f4": "And restricting the Black King's advance. (Yes, he's going to do that, isn't he?)",
        "32... Kg7": "Probably getting ready to exchange Rooks?",
        "33. Nf3": "Aiming at e5, though that f-pawn would soon put paid to the Knight there.",
        "33... Ne4": "I, however, have no such pawn to drive away Black's Knight, which now proves to be a tricky fellow.",
        "34. g5": "Stopping the f-pawn's advance.",
        "34... Ng3": "A rather pointless attack. I don't know it, but I probably have the better position, and the Black Knight can head to h5 from here, closing off that open file. But I go on one of my endgame lapses and imagine he's after the f-pawn via e2...",
        "35. Rh4": "So I defend it.",
        "35... Rh8": "Black offers another exchange. But I'm worried about that f-pawn, not even thinking that my King could probably waltz up the board to those pawns on the Q-side.\n",
        "36. b3": "Ouch. Now Ne2 really has me in trouble after the Rook exchange; I've quite missed that the c-pawn is undefended now, so preoccupied am I with driving home my pawn advantage on the Q-side.",
        "36... Ne2": "But Black leaves the exchange for me, which doesn't work for him: 37.Rxh8 Kxh8 38.Ka3 Nxf4 39.Kb4 and I probably still have the advantage.",
        "37. c4": "This, however, is not good. The Black Knight can run amok with my undefended pawns now... Alas, its taste for pawns becomes Black's undoing...",
        "37... Rxh4 38. Nxh4 Nxd4": "And he starts to grab them.",
        "39. c5": "I'm still obsessed with my Q-side majority, which, I imagine, must be worth more than losing the odd pawn. So it proves to be, but only because of Black's endgame play...",
        "39... Ne2": "He's getting a mite greedy is that Knight; 39...a5 would have stymied my pawn advance plan.",
        "40. Ng2 f6": "Meantime, he can ensure two connected passed pawns...",
        "41. b4 fxg5 42. fxg5": "My consolation is that my pawns on the Q-side are nearer their object than the two central Black pawns. Ironic that a game that began with two White pawns in the middle looks like it will end with two Black ones triumphing. For I'm fairly sure I'm sunk.",
        "42... Nd4": "No 42...e5? The Black Knight just wants to pop off my pawns one by one, I suspect.",
        "43. Nf4": "It's actually quite finely balanced now...e5 earlier would have stopped my Knight from going here.",
        "43... Kf7 44. Kb2": "Oh. The King has awoken.",
        "44... Nf3": "Yes - the Black Knight is after pawns; 44...e5 drives away my Knight.",
        "45. b5": "That pawn majority has to pay off now? Or at least ensure a draw?",
        "45... axb5 46. axb5 Nxg5": "Yes - the Black Knight wins his pawns and loses the game...",
        "47. c6 bxc6 48. b6": "I can only think that Black assumed I would recapture, when after 48.bxc6 Ke7 and the pawn is stopped, and all those Black pawns would probably be too much for my Knight. But I just pressed on, and he resigned."
    },
    "url": "https://gameknot.com/annotation.pl/robatsch-modern-defence?gm=66649",
    "gameName": "Robatsch (modern) Defence",
    "players": "captain_shannon (1772) vs. oofy (1628)",
    "opening": "Robatsch (modern) defence (B06)"
}