{
    "moves": {
        "1. e4 c5 2. Nc3 Nc6 3. Nf3 e6 4. d4 cxd4 5. Nxd4 Bc5": "This was completely new move for me but reminded of the usual position I end up with\nScottish opening.",
        "6. Be3": "So, the standard reply without further thought was this.",
        "6... Qb6": "Again, just a backbone reply. With original idea of blocking queens access to b2 while\nprotecting knight on d4. ",
        "7. Ncb5 a6": "Now there comes the anticipated pawn move but what to do? If Nb5 moves Nd5 is \nin trouble. If Nd5 moves then Nb5 is in trouble. But wait what about c7 and Bc5? Black's queen is protecting both. What if she couldn't do that?",
        "8. Nxe6": "Now there are interesting options. If black captures knight: 8. .. dxe6 9. Bxc5 \nif [9. .. Qxc5 10. Nc7  Ke7 11. Nxa8 and white probably will keep his knight ]\nif [9. .. axb5 10. Nxc5 has won pawn and white has a bit better position ]\n",
        "8... Bxe3": "Probably black thought that now white will go for the rook at a8. Sorry, I had something\ncompletely different on my mind. ",
        "9. Nd6+": "There is only one move black can do.",
        "9... Ke7 10. Nc4": "This threatens both bishop and queen. I did not see this coming. I was hoping Qb5 or Qa6 but that would have lost the game unavoidable. First\n11. Qd6  [11. .. Ke8 12. Qf8#] Kf6 13. Nd4  Kg5  14. h4  and eexpectingBe2ither king goes to h5 or g4 and 15. Be2#\n\nEven better than Bxf2 might have been just to capture the knight now. \n10. .. dxe6 11. Bxc5 Qxc5 12. Nc7 Ke7 13. Nxa8 Qb4  and white at least loses one pawn...\n",
        "10... Bxf2+ 11. Ke2": "Black doesn't see what is coming. The scariest threat here is not the capture of the queen but the checkmate. \nNow, giving up queen with:\n11. .. dxe6 12. Qd6  Ke8 13. Nxb6 Bxb6 14. Rd1 and white has better position but I think not enough\nto guarantee victory....\n\nEven better would have been (see the comment, thanks Blake) 11. .. Qf4 and white is in serious trouble. ",
        "11... Qa7": "A grave mistake.",
        "12. Qd6+ Kf6 13. Nf4+ Kg5 14. Nh3+ Kh5 15. Qd5+ Kh6 16. Qg5#": "Done."
    },
    "url": "https://gameknot.com/annotation.pl/robsondesouzas-mini-tournament?gm=19447",
    "gameName": "robsondesouza's mini-tournament",
    "players": "dafool (1640) vs. inner (1657)",
    "opening": "Sicilian (B23), closed, 2...Nc6"
}