{
    "moves": {
        "1. e4 d6": "I was anticipating a pirc style defense from black after this move however this was not the case. ",
        "2. d4 c6": "I believe this is a bit of a concession form the usual Nf6.  Though this could be a different move order say Nf3 Nf6.",
        "3. Nf3 b6": "? Now this is a real concession as it just looks like my opponent is just pushing pawns...",
        "4. Bf4 Nf6 5. Bd3 h6 6. e5": "I'm under the option I should have waited to make this move for at least a move or two.  Maybe after Nc3 or something.",
        "6... Nd5 7. Bg3 Bg4 8. a3": "This seems to be an odd move but my goal is to kick out the d5 knight with c4 and I don't want it coming to b4.",
        "8... Nd7 9. c4 Nc7 10. Be4 d5 11. cxd5 Nxd5 12. Nc3": "Attacking the well placed knight.",
        "12... Nxc3 13. bxc3 f5": "? this does nothing for blacks game in fact white had the very strong exf6 e.p. but I missed that in the game because I liked Bxc6 and hadn't even considered exf.",
        "14. Bxc6 Rc8 15. d5 Rxc6": "Black could no longer deal with the mounting problems as e6 was coming.  So he sacs the rook.",
        "16. dxc6 Nc5 17. Qxd8+": "I trade down to free my knight from the pin however gameknot considers this a mistake over e6.  I however don't see much of a gain out of e6 Nxe6 maybe the idea is that it gives the dsb more life.",
        "17... Kxd8 18. Nd4 e6 19. f3 Bh5 20. Nb5": "I think this wasn't a very good move I had thought to play Nd6 but it doesn't quite work in the current case.  I should have been patient and play O-O-O which would have closed the black knight of the position and threatens a various amount of discoveries on the king. ",
        "20... a6 21. Nd4 Kc7 22. a4 Be8 23. a5 b5 24. O-O-O Bxc6": "I figured this pawn would fall at some point.",
        "25. Nxc6 Kxc6 26. Kb2": "Defending against Nb3.",
        "26... Nb7 27. Bf2": "I should have defended my pawn with Ra1 but I had it in my head that I would be okay after Rd8?? but I was wrong and you'll see why here in a minute.",
        "27... Nxa5 28. Rd8 Ba3+": "!! I've gone from being at the advantage slightly to a losing position in one move :/.  The a6 pawn is going to be a big issue.",
        "29. Kxa3 Rxd8 30. Bd4": "Blocking out the rook which could be a real problem if I let it into my position.",
        "30... Nc4+ 31. Kb3 g5": "A good move as it makes it difficult to begin queen side play.",
        "32. Ra1 a5 33. Ra2": "plugs up the knight moves such as Nd2 so I can play something like g4-g3.",
        "33... a4+ 34. Kb4 Nb6 35. g3 Rb8 36. Bxb6": "Trading my bad bishop for good knight however this isn't going to help me much.",
        "36... Rxb6 37. c4": "Not sure I like this move very much something like Rd2 looks much better.  However my idea was to try to keep the king away from the queen side.",
        "37... bxc4+ 38. Kxc4 Ra6 39. Ra3 Kb6 40. Kb4": "? I think trying for a queen side break would be better here say f4 so Ra5 doesn't come with tempo.",
        "40... Ra5 41. f4 gxf4 42. gxf4 Rd5 43. Rf3": "Now here is a point where I have to disagree with the computer analysis after Rxa4 Rd4+ Kb3 Rxa4 Kxa4 Kc5 I have no way to stop him from dropping my f4 pawn and I'm going to lose.  I figured keeping the rooks on the board was my only chance for a draw.",
        "43... Rd4+ 44. Ka3 Kb5 45. Rh3": "Here I decide that I should try to make some things happen maybe if I can trade off a few pawns I'll be able to distract black from getting the a pawn down the board.",
        "45... Rxf4 46. Rxh6 Rf3+ 47. Ka2 Kb4": "pushing me back.",
        "48. Rxe6": "!? the only move that I can think of that can cause the position to change quite a bit.",
        "48... Rf2+ 49. Kb1 Rxh2": "Black takes my pawn and I can't say I'm surprised.",
        "50. Rb6+": "I play this move to make black commit his king.",
        "50... Kc5 51. Ra6 Re2": "I think allowing this pawn to drop is a big mistake as it is going to make defending much easier.  However it will be hard to defend the pawn and deal with my advancing e pawn as well.",
        "52. Rxa4 Rxe5 53. Rf4": "I offer a draw here because i believe that I have a really good chance at getting a draw in this position.  My opponent accepts my offer and I can't say I wasn't glad this game ended in a draw."
    },
    "url": "https://gameknot.com/annotation.pl/rocky-road?gm=47867",
    "gameName": "Rocky Road",
    "players": "zwarwiz (1848) vs. cupichov (1491)",
    "opening": "Pirc defence (B07)"
}