{
    "moves": {
        "1. Nf3": "Hi everyone!\n\nIn our WTW&LR club, Julio (easy-win) decided to take me on - brave one!  However, I have played opponents well south of my rating and they, such as Dmaestro and The Dentist have given me some really tough games and I have had to battle passivitis in the middlegame.  Will Julio also inflict this on me?  Well, maybe, but we do go into an endgame, a rook endgame and one player has a pawn minus.  But which player will eventually prevail?  Well, you will just have to read on.",
        "1... Nf6": "1. …… Nf6 - in response to the Reti Opening, Julio decides that piece development is the way to go!",
        "2. Nc3 c6": "2. …. c6 - after 3 knights come out to play here comes a pawn move.  This move prepares d5 of which black plays on the next turn.",
        "3. e4 d5 4. e5": "4. e5 - somehow this has transposed into a kind of Alekhine's Defense but with a few moves inserted in the interim.",
        "4... Nfd7 5. d4 e6 6. Be2": "6. Be2 - clearing the way for Henry to tuck himself away on the kingside.",
        "6... Be7 7. O-O O-O 8. Ne1 c5 9. Be3": "9. Be3 - Further development and additional defense of d4 pawn.",
        "9... cxd4 10. Bxd4": "10. Bxd4 - pawn trade.",
        "10... Nc6 11. Nf3 f5 12. exf6 e.p. Bxf6 13. Bxf6 Qxf6": "13. …… Qxf6 - after this plethora of exchanges I have got rid of my weakie on e5.  Julio does have a pawn centre which at first sight looks strong.  However, there is a backward pawn on e6.  Can this be exploited?  Well, bringing material to attack it at the moment is a long way off.",
        "14. Rb1 a6 15. Qd2 b5 16. a3": "16. a3 - to prevent b4.",
        "16... Bb7 17. Nd1 Qg6": "17. …… Qg6 - allo, allo, allo, I must watch it here, Julio's queen bearing down on Henry on the g column and there is a light square bishop bearing down on the a8-h1 diagonal.  However, there are a few pieces in the way so a defense can be mustered in time.",
        "18. Ne3 Nde5 19. Nxe5 Nxe5": "19. ……. Nxe5 - knight trade.",
        "20. c3 Nc4 21. Bxc4 bxc4": "21. …… bxc4 - B for N trade.",
        "22. Qd4": "22. Qd4 - Glenda moves into an attacking position where she cannot be assailed by Julio's bishop.  She also blocks up that diagonal leading to Henry - a good way of defending there, Glenda!",
        "22... Qg5 23. Qg4": "23. Qg4 - offering a queen trade but the BQ moves off the file.",
        "23... Qe5 24. Rbe1 Qf6 25. Qg3 Rf7": "25. ….. Rf7 - preparing Raf8 and suddenly I will be faced with a pile-on on the f column.",
        "26. Ng4 Qf4 27. Qxf4 Rxf4": "27. ……. Rxf4 - the queens are now traded off.",
        "28. Ne5 Rf6 29. Nd7": "29. Nd7 - suddenly threatening Nc5 and Nxf6.",
        "29... Rg6 30. Nc5 Bc6": "30. ….. Bc6? (Bc8) - loses pawn.",
        "31. Rxe6 Be8": "31. …… Be8 - draw offer.",
        "32. Rxg6": "32. Rxg6 - declined as I am a pawn up and I thought it was best to play on to see how I could realise this advantage.",
        "32... hxg6": "32. ….. hxg6?! - leaving himself with doubletons, is that wise?  I think that Bxg6 looked stronger.",
        "33. Ne6 Ra7 34. Nd4": "34. Nd4 - I am carefully considering my own weakie on b2.  I am preparing to exchange it by moving it to b3.",
        "34... Bf7 35. Re1 Rb7": "35. ….. Rb7 - Julio finally attacks my b pawn.  However, my rook can now defend it on the rank rather than the file and this gives my rook much more scope.  Also my rook could get attacked by Julio's lsb if it goes to b1.",
        "36. Re2 g5 37. f3 Kh7 38. Kf2": "38. Kf2 - the kings now start moving towards the centre.",
        "38... Rb6 39. Kg3 Bg6 40. Kg4": "40. Kg4 - Henry really likes the look of that juicy p(r)awn on g4.  It can be defended, however but this gives me the opportunity to trade pieces.",
        "40... Kh6 41. Nf5+ Bxf5+ 42. Kxf5 g6+ 43. Ke5": "43. Ke5 - now we have our rook ending.",
        "43... Rb5 44. a4 Ra5 45. Rd2 Rxa4 46. Kxd5": "45. Kxd5 - pawn trade.",
        "46... Ra2 47. Kxc4": "47. Kxc4 - gobble, gobble!",
        "47... Ra1 48. b4 Kh5 49. g3": "49. g3 - suddenly I spot the possibility of King Julio being caught in a mating net on the h column!",
        "49... g4 50. f4 Ra4": "50. …… Ra4? - this move now leads to a rook trade into a won K & P ending.",
        "51. Rd5+ Kh6 52. Ra5": "52. Ra5 - like this!",
        "52... Rxa5 53. bxa5 Kg7 54. Kc5 Kf6 55. Kb6 g5 56. fxg5+": "56. fxg5+ - there is no saving the pawn on a6 and Glenda making a re-appearance on a8.  Julio sees this and waves the white flag.  Solid play from Julio up until he left his e6 pawn en prise.  When you are down on pawn material in an endgame it pays to keep at least a piece on to give you some drawing chances.  I hope you have all had a good read and there will soon be another annotation coming up, this one will feature tactics in the middlegame which will net heavy material."
    },
    "url": "https://gameknot.com/annotation.pl/rook-endgame-study?gm=65297",
    "gameName": "Rook Endgame Study",
    "players": "jstevens1 (1809) vs. easy-win (1410)",
    "opening": "Reti opening (A05)"
}