{
    "moves": {
        "1. e4": "Tactical opening.\n",
        "1... e5": "I feel classical.\n",
        "2. Nf3 Nc6": "Thinking Spanish.\n",
        "3. a3": "A miscue. Better is Bb5 or Bc4, Spanish or Italian. The text move strives to limit black bishop counterplay, which it does at the price of giving black the initiative.\n",
        "3... Nf6": "Attacking e4 and developing with 0-0 in mind.\n",
        "4. Nc3": "White is playing on the defensive.\n",
        "4... d6": "Not a bold move, but it does open a bishop line without commiting to pawn and piece exchanges.\n",
        "5. Bb5": "White plays the belated bishop move, but the game is now out of the standard character of the Spanish.\n",
        "5... Be7": "Developing a piece and almost daring white to play BxN.\n",
        "6. d3": "White plays a symetrical pawn move which opens a bishop line and frees the c3 knight for operations.\n",
        "6... O-O": "Black plays for rapid development.\n",
        "7. Bxc6": "The text move offers the advantage of a flawed pawn structure for black, but it yields the bishop pair in the process, and no other gains are apparent due to the captured steed not being particularly dangerous.\n",
        "7... bxc6 8. Be3": "A unassuming move that overlooks a certain knight reprisal by black.\n",
        "8... Ng4 9. h3": "Not the best move, Bd7 is better. Perhaps white has a strategy to play NN vs BB.\n",
        "9... Nxe3 10. fxe3": "White is still uncastled and reaching an uncomfortable position due to the lack of support for the king. It is not an immediate problem, but the cookie will begin to crumble.\n",
        "10... Rb8": "Like a Lasker move, attacking a weakness while developing a piece to a useful line.\n",
        "11. b4 f5": "Playing like Lasker who would play on both flanks. The text move seeks to break up the pawns in the centre if ignored by white, or develop a bishop if white exchanges.\n",
        "12. exf5 Bxf5": "The bishop sits on a centralized position, but it could be pushed back by  the move g4 - which would cost white by opening up more space around the king. The bishop is bad for the moment due to the pawn structure.\n",
        "13. Qd2": "White seems to want 0-0-0, but is there time now?\n",
        "13... Bg5": "The text move may not be the best. 13...Bh4  looks better due to 14. Nxh4 Qxh4  and white is out castling rights with a slight advantage for black. There is a slow controlling positional aspect to the text move that prevents the e pawn from moving at the moment.\n",
        "14. Nxg5": "Makes sense to exchange a knight for the dangerous bishop.\n",
        "14... Qxg5 15. e4": "A blunder, perhaps the losing move of the game. Better was 0-0-0 while there was time. This move fails due to the checking move available by black.\n",
        "15... Qg3+": "A forcing move which allows the bishop to escape.\n",
        "16. Kd1": "Better than 16.Qf2 Qxf2  17.Kxf2 Bxe4 revealed check allowing black to gain a pawn.\n",
        "16... Bg6 17. Kc1": "Avoiding 17...Bh5 \n",
        "17... Rf2": "Putting some pressure on white.\n",
        "18. Qe1": "Better than 18.Ne2 blocking, but then losing to ...Bh5 and the knight is lost.\n",
        "18... Qxg2": "Taking strong hold of the seventh rank.\n",
        "19. Kb2": "Its hard to recommend alternatives at this point. 19.Rg1 fails to ...Rxc2  and 20.Kb1 Rb2   21.Kc1 Qc2#\n",
        "19... Rxc2+": "Beginning a small set of forced moves.\n",
        "20. Kb3 Rb2+ 21. Ka4 Qc2+ 22. Ka5 Rb3": "A double attack on the knight. Bad for white is 23.Rc1 Rxa3  24.Na4 Qxa4#\n",
        "23. Na4 Rb5+": "A forcing move which will set the king up for a revealed check.\n",
        "24. Ka6 Qxd3": "A dual check can be obtained by 25...Rb6  \n",
        "25. Kxa7": "Escaping the dual check.\n",
        "25... Qd4+ 26. Ka6": "The alternative does not work either 26. Ka8 Bxe4 27. Rd1 c5  28. Ka7 Rb7  29. Ka6 Qc4  30. Ka5 Qb5#\n",
        "26... Bxe4": "Creating the threat at h1 while making a line available to a8 after a pawn move. This is to give black the time to make a nice sacrifice next move.\n",
        "27. Rg1 Ra5+": "The text move forces a response from white of which all moves lead to mate.\n",
        "28. Kxa5": "Or 28.bxa5 Bd3# Or more fighting is 28. Kb7 c5  29. Kxc7 cxb4 30. axb4 Qa7  31. Kd8 Rb5 32. Nc5 Rb8#\n",
        "28... Qa7#": "An interesting mate pattern of QPP with unsupported queen. A fun game providing chances to try some strategies.\n"
    },
    "url": "https://gameknot.com/annotation.pl/rook-sac-team-match-http-gameknot-com?gm=22205",
    "gameName": "Rook Sac - Team match, http://gameknot.com/",
    "players": "donf2 (1390) vs. chessknave (1504)",
    "opening": "King's pawn game (C44)"
}