{
    "moves": {
        "1. Nf3": "Introducing the Torre attack (Tartakower variation)",
        "1... d5": "I'm sure this is all standard play for the next few moves so.......",
        "2. d4 Nf6 3. Bg5 h6": "This may be straying from the book a little I personally favour development, Nc6 followed by Bg4. However this move forces me to commit my bishop one way or the other....",
        "4. Bh4": "I decided not to trade just yet, I remembered a previous game where I played Bxf6 exf4 and those pawns gathered around the castled king proved very difficult to penetrate, so I abstain, for now......",
        "4... g5 5. Bg3 Nc6 6. e3 Bg4": "......",
        "7. Be2 Ne4": "Now black threatens to exchange N for B doubling my K-side pawns, which in many cases isn't necessarily a bad thing....",
        "8. Be5": "But in this case I preffered to exchange on e5 giving me an advanced knight and what I felt to be a slight positional edge...",
        "8... Nxe5 9. Nxe5": "Forcing the issue.",
        "9... Bxe2 10. Qxe2": "Now we have exchanged 2 minor pieces, we both have centrally positioned knights and there really isn't that much between us, all said everything is pretty much even steven, so, look at this position and ask yourself which colour you'de rather play?",
        "10... Bg7": "Now black threatens to double my central pawns which would provide an easy target for black to deny board privaliges to, however, I don't want to move my knight either, so...",
        "11. f4": "I liked this move at the time, if Bxe5 then fxe5 followed by 0-0 and my rook will have the f file to operate on....",
        "11... Bxe5 12. fxe5 c5 13. O-O": "....and that's exactly what happened, I begin to try a few cheap tricks here admittedly, but had I not the opportunity to play a few fantasy chess moves may not have arisen....So we play on.....",
        "13... e6 14. Qh5": "As I said, a cheap trick which is easily parried but it's worth a shot surely..?",
        "14... Qe7": "Cooley dealt with...",
        "15. Na3": "Again the start of a fruitless exercise and I admit it's pretty ugly, but come the end I hope you will have forgiven this minor blemish...",
        "15... O-O-O": "Not sure I like this, it leaves f7 firmly out in the cold! Nd2 was maybe better even a6....",
        "16. Nb5": "The reason I played Na3, I wanted to take the unpatrolled path to b5...",
        "16... a6": "And it's all a waste of time Na7+ is no good after Kb8 so maybe I will run the risk of a skirmish on c3 after all.....",
        "17. Nc3 Nxc3": "I actually don't like this exchange for black, I prefer Rdf8 I think....",
        "18. bxc3": "Now the center is loaded with white pawns and the b-file has been opened, this proves vital...",
        "18... c4": "Still not covering the f-pawn, I'm guessing my opponent completely missed this, but I hadn't....",
        "19. Rxf7": "Seizing the 7th rank and just look at that b file yearning to be utilised....",
        "19... Qa3": "Threatening the c3 pawn which in turn would attack my a3 rook, can I allow this to happen...?",
        "20. Qg6": "I decided this was a more positive reply, I didn't want to get bogged down defending pawns, so a letter is sent home to private pawns parents and he is sacrificed for the greater good.....",
        "20... Qxc3": "Now I do have to tread carefully, but it was at this point a sac came to mind, I love to sac so I do if the game allows for it, The next 7 moves will stay with me for quite some time, all forced. Black may not be aware of it, but he is staring defeat in the face, best and final chance was Rde8, now the wheels begin to grinds into motion....",
        "21. Qxe6+": "Move 1 (of the sequence) Blacks king is forced to b8,  as 21...Rd7  22. Qxd7+ kb8 23. Qxb7#\n",
        "21... Kb8": "I have to keep up the pressure, how to maintain my edge...hmmmm..",
        "22. Rxb7+": "BLAMMO! A whole rook is invested, a wise decision or an outrageous blunder....?",
        "22... Kxb7": "He has to accept or it's mating season yet again.....",
        "23. Rb1+": "Finally the a rook having spent most of the game in quiet contemplation stirs from his reverie to administer a swift admonishment...",
        "23... Kc7": "Again this is forced, should black hide in the corner, 23..Ka7 24 Qb6+ Ka8 25 Qb7# or 23...Ka8 24 Qc6+Ka7 25 Qb7#. So....",
        "24. Qb6+": "This move is vital Qe7+ asks for Rd7 in reply and the attack begins to lose momentum, and that's all I have right now in exchange for my Rook so I'm grabbin on with both hands!",
        "24... Kd7": "Again forced as 24 Kc8 loses to Qb7#",
        "25. Qd6+": "I take advantage as the Rook only has the kings back to stare down his scope at, splendid :) e6+ is no good and the attack wanes which would allow black a moment to play Qxe3+",
        "25... Ke8": "Forced again, 25... Kc8 26 Rb8# I also have the added bonus of cutting off the rooks 1 2 1 supply lines, I think my investment may be paying dividends...",
        "26. Qe6+ Kf8": "Again the only square hospitable to the fleeing king.... I now have the oppurtunity to regain my material if I so desire, I consult the oracles....",
        "27. Rf1+": "And decide not to! The black king has been found lacking and is about to pay the ultimate price. In all seriousness I was very pleased with this ending and it ranks right up there for me, I found all the right moves and made my investment pay for me in the grandest posible way, I really am proud of this one. Back to the formalities...",
        "27... Kg7": "Again forced....",
        "28. Qf7#": "And the icing on the cake...Thx for reading and I welcome all comments...."
    },
    "url": "https://gameknot.com/annotation.pl/rooks-i-give-em-away-but-at-what-cost-q-a-com?gm=32228",
    "gameName": "Rooks? I give em away! But at what cost? (Q,A.com)",
    "players": "zolaweed (me) (1946) vs. Kobeb (1886)",
    "opening": "Reti opening (A06)"
}