{
    "moves": {
        "1. e4": "I begin the game with a typical opening e4. At that moment I was getting ready to play the Italian game but black destroyed my plans.",
        "1... c5": "Sycilian defence! c5 begins the opening and black is ment to gt ready to attack on the queen side.",
        "2. Nf3 Nc6": "A most often played move for black's second move after c5. Black is going to play the dragon version of the syclian.",
        "3. d4": "d4 is a strong move to play in that position. White(me) fights for the centre and usually forces black to exchange.",
        "3... cxd4": "Black exchanges",
        "4. Nxd4 g6": "g6 gets the bishop ready to concere the two centre squares, e5 and d4.",
        "5. Nxc6": "Since I'm not so strong in that opening I wanted to avoid any problems. Safest way is to exchange the knights.",
        "5... bxc6": "Black takes the knight with the b pawn to help fight for the centre",
        "6. c3": "I played c3 to avoid any problems when the black bishop moved to g7. Then the b2 square would be on attack and had to be deffended at all times to later avoid losing the rook.",
        "6... Bg7": "As said before",
        "7. Bd3": "Played the bishop to defend the pon before the knight on b1 was activated.",
        "7... d6": "Prepares black for a later possibility of e5 and opens the line for the bishop.",
        "8. Be3": "You are propobly thinking, why did I play the bishop on e3 and not on f4? If I played Bf4 black would play d5 and I would have to move i t back anyway. Also I am planing in advance to play f4 and attack alittle bit on the kingside.",
        "8... Nf6 9. Nd2 O-O 10. Qc2": "This one of my favourite position when I am playing white. I really likemwhen I have the bishop on d3 and the queen on c2. That way I have some attack on the far pon on h7.",
        "10... Nd7": "Completely do not understand that move, but when I come to think about it , I know it had something to do with opening the line for the bishop.",
        "11. f4": "Maybe I came a bit to late with that move but I want to place my knight behing the pon and move forward.",
        "11... e6": "A good and defensive move. Now I have little chance with attacking with only the pons and bishops. I need to get \"reinforcements\".",
        "12. g3": "Hold the entire structure together.",
        "12... Bb7 13. Nf3": "As planned.",
        "13... Nf6": "Useless move. Just couple of moves ago black moved it from that place for no reason and now he is coming back there.",
        "14. e5": "Now I had enough attack to push the pon forward",
        "14... Ng4 15. Qe2": "Defending the bishop",
        "15... dxe5": "Exchanging pons",
        "16. fxe5": "Exchanging pons",
        "16... Nxe3": "My opponent didn't take the e5 pon because it would be the same equal exchange. 16...Nxe5  17. Nxe5  Bxe5 18. Bxa7. Maybe next he would take the c3 with a check and still keep the won pon but he would have almost no pieces around his king to defend.",
        "17. Qxe3": "I take the knight",
        "17... Qc7": "Forces me to keep my queen and defend the pon on e5",
        "18. O-O": "Not much to do else in that position",
        "18... Rad8": "At that time black was preparing to attack by alining the rooks of the d line.",
        "19. Rad1": "I did the same",
        "19... Rd7 20. Rd2 Rfd8 21. a3": "At that time I didn't think it was ergent to defend the bishop so I just didn't move my second rook.",
        "21... Rd7d5": "Attacks the pawn and soon wins it.",
        "22. Re1": "Still defending the pawn",
        "22... Qd7": "Let's go of the pawn and attacks for the bishop",
        "23. Red1": "Forced to defend",
        "23... h5 24. Qxa7": "I didn't see that pawn at first and hezitated wheter to take it or not but I remebered that for sure I am going to lose the pawn on e5 so I kind of had no choice if I wanted to win this game.",
        "24... Qc7 25. Qe3": "Black is not in the hurry to take the pawn  because they have it gurenteed to win it.",
        "25... c5 26. Bc4": "Black is getting ready for a  big attack so I didn't want to let it happen. I was  forced to move my bishop and exchange the rooks.",
        "26... Rd5xd2": "Exchanging rooks",
        "27. Rxd2": "Exchanging rooks",
        "27... Rxd2": "Exchanging rooks",
        "28. Nxd2": "Exchanging rooks",
        "28... Bxe5": "At that moment black could actually give me a nasty attack by playing Qc6 and win the pawn on h2, but they didn't see it. That was my only mistake in that game.",
        "29. Nf3": "Attacks the bishop and cools the attack",
        "29... Bf6": "Needs to go back",
        "30. Kf2": "I bring the king to put more defence on the knight in case of attack",
        "30... Qb6": "Attacks the pawn on b2. Then I moved my queen but now I'm thinking why not play b4?",
        "31. Qd2": "Defends the pawn",
        "31... Qc6": "Attacks the knight with a check. ",
        "32. Qf4": "Defence and attack at the same time. Whoever thought of that was a genius.",
        "32... Kg7": "Defends the bishop.",
        "33. h4": "Brings the pawn up.  Ther is not much to play.",
        "33... Be7": "Un explained but propobly he wanted to attack with the queen so had to defend the pawn.",
        "34. Qe5+": "I give him a check. ",
        "34... Kf8": "Can you see the mate in the next move?",
        "35. Qh8#": "Qh8!!! Finishes the game !!! The knig is trapped by his own bishop!!! If you have any questions about the game send me a message."
    },
    "url": "https://gameknot.com/annotation.pl/rosario-100s-mini-tournament?gm=4228",
    "gameName": "rosario-100's mini-tournament",
    "players": "bulleye (1269) vs. northcoaster (1425)",
    "opening": "Sicilian (B34), accelerated fianchetto, exchange variation"
}