{
    "moves": {
        "1. d4": "Starting out with 1.d4, wich happens to be my favorite opening move too.",
        "1... Nf6 2. c4 e6": "I wanted to go for the Nimzowich defence with 3...Bb4",
        "3. a3": "But I must have telepathically send this to my opponent....White immediately eliminates the possibility of a pinned knight on c3.",
        "3... d5": "Going for the center, with the idea of playing c5 soon.\nMaybe 3...b6 is also good, and then fianchettoing the bishop to b7.",
        "4. e3": "Not the most ambitious move. White has played 4 pawn moves and has yet to develop a piece, but he's in no hurry, black has no serious advantage.. ",
        "4... Be7": "Just developing and trying to go for quiet, positional play.",
        "5. Nc3 c5": "Attacking the white center. Maybe castling first is better. That's what most Game DB suggest.",
        "6. dxc5": "The strongest move. Now the d-file is opened up to the white queen and the capture cxd5 is coming, somewhat weakening the black center. After the recapture ....exd5, black has an isolated pawn on d5. Still, the position is about equal with correct play.",
        "6... Bxc5": "I considered castling first, but I didn't like the thought of 7.b4, though again Black is still ok after 7...a5, with 8...b6 etc.",
        "7. b4": "I didn't expect this move, but something like 7.cxd5 or 7.Nf3. Then again, both moves are still possible since I have to move my Bishop again. Here I thought quite some time about 7...Bd6. After 8.cxd5 exd5 white cannot take the d5 pawn of course, 9.Nxd5?? Nxd5 10.Qxd5 Bxb4  and the white Queen is lost. But I discarded the idea knowing my opponent would never fall for such a cheap trick.",
        "7... Be7": "3 out of the 4 last moves with the Bishop, but somehow its compensated by the fact that White is behind in piece development. ",
        "8. Nf3": "White must also have sensed this, so instead of capturing on d5 he wisely developed his knight. ",
        "8... dxc4": "Ok..an important moment in the game. It shows how occupied I was with the whole d5 issue. 8...O-O 9.cxd5 Nxd5 10.Nxd5 exd5 gives white a pleasant position. But my 'solution' to the problem unfortunately isn't good enough. 9. Qxd8  Bxd8 10. Bxc4 O-O is also good for white; The poor black Bishop must move again and it's white who is better developed.",
        "9. Bxc4": "Luckily my 80-year old opponent decided to develop first.",
        "9... O-O": "But now I missed the best continuation. 9...Qxd1  10.Nxd1 O-O, with equal play. In the words of Danish GM Bent Larsen: \"If black equalizes then he's already better.\"\n",
        "10. O-O": "Now white is better developed and his pieces are active. ",
        "10... Qc7": "Attacking the bishop, wich can't move ofcourse, because of 11...Qxc3.",
        "11. Qb3 a6": "To play b5 and develop my Bishop to b7.\n",
        "12. Bb2": "Intending to play Ra-c1.",
        "12... b5 13. Be2": "Defending the knight on f3.",
        "13... Bb7 14. Rac1": "As expected..",
        "14... Nc6": "With this move I can complete development and avoid a discovered attack on my Queen.",
        "15. Rfd1": "White wants to control the open d-file.",
        "15... Rfd8": "So black challenges him.",
        "16. Qc2": "This move allows black to equalize. Instead 16.Bd3 would have kept the advantage for white. ",
        "16... Rac8": "A perfect symmetry with totally equal play.\n",
        "17. Ne4": "Threatening 18.Nxf6  Bxf6 12.Bxf6 gxf6. I didn't want to capture the knight 17...Nxe4, because of 18.Qxe4, when the white queen seemed too dangerous. ",
        "17... Rxd1+": "The best move. ",
        "18. Bxd1 Qd8": "Releasing the pin on the c6-knight and intending to answer 19.Nxf6  Bxf6 20.Bxf6 with 20...Qxf6. Note also that the table is turned and black is now threatening a discovered attack on the white Queen.",
        "19. Nxf6+ Bxf6 20. Bxf6 Qxf6": "The position is still totally equal.",
        "21. Qb1": "Avoiding the discovered attack.",
        "21... Ne5": "Now it's Black's turn, with the idea of a possible capture on f3, but I played it too soon. If 22....Nxf3  23.Bxf3 Rxc1  24.Qxc1 black cannot capture with 24...Bxf3, because of mate on the 8th rank. So instead 21...h6 would have been a logical continuation instead of the text move.",
        "22. Rxc8+": "The best move again.",
        "22... Bxc8": "The Bishop has to leave its good b7 square and for a second I feared something like  23.Qc2 Bb7 24.Qc7 with mate threat. But black can allways defend with 23...Nc4 or 23...Nxf3  24.Bxf3 Qa1 .",
        "23. Nxe5": "Eliminating the annoying knight on e5.",
        "23... Qxe5 24. Qc2": "So my opponent saw the move too and goes for it. White is threatening mate now of course.\n",
        "24... Bb7": "But there's no problem defending it.",
        "25. h3": "With correct play there are no real winning chances for both sides anymore, so a draw would be the logical conclusion to the game. I was happy with this result, looking at the rating difference between me and my opponent (my rating at that time was 1385, while my opponent had a rating of 1599).\n",
        "25... Qe4": "With a mate threat on g2, forcing the exchange of queens.",
        "26. Qxe4 Bxe4": "At this point my team was leading with 2 - 0.5, so I offered a draw, which my opponent accepted, (though only after I had to repeat my draw offer three times, because he had an hearing-aid. :) bringing the score to 2.5 - 1.\n\nYet another draw result from the 1st board brought the score to 3 - 1.5. But then the unthinkable happened. All the remaining players from my Team started losing their game one by one, though each of them having good positions (pressure?). So unfortunately in the end my team lost the match with 3 - 5. \nHowever,this was our only loss in the competition and after seven rounds my team became Champion!\n\nHope you enjoyed, greetings from Holland."
    },
    "url": "https://gameknot.com/annotation.pl/rsb-klasse-3a-rotterdam?gm=21672",
    "gameName": "RSB Klasse 3a, Rotterdam",
    "players": "van Schelven (1589) vs. Reijnaert (1541)",
    "opening": "Queen's pawn game (E00)"
}