{
    "moves": {
        "1. e4": "e4! the most noble of openings!\n",
        "1... c6": "I pretty much exclusively respond to e4 with the Caro-Kann. It leads to a solid end-game position for black and i don't have to get to bogged down in theory, which i believe is the case with the Sicilian.\n",
        "2. Nf3": "A standard reply.\n",
        "2... d5": "fighting for the middle of the board.\n",
        "3. exd5": "He decides to exchange. Personally, i prefer to keep the tension in the middle but it is by no means a bad move.\n",
        "3... cxd5 4. Bb5+": "developing with a check.\n",
        "4... Bd7": "enticing the exchange of bishops, usually in the Caro-Kann i find that i'm left with Knights on the board while exchanging bishops.\n",
        "5. Qe2": "?! I've never seen this reply before...\n",
        "5... Nf6": "After a short pause, i decided this was not too significant and continued with development.\n",
        "6. Nc3": "And so does he.\n",
        "6... e6": "This is all somewhat standard, aside from maybe the queen move he made.\n",
        "7. a3": "I don't like this move. It takes away the b4 square from my bishop; however, i didn't plan on moving my bishop there in the first place. Better would of been to move the d pawn and develop the bishop.\n",
        "7... Bd6": "I'm going to keep developing.\n",
        "8. d4": "Activates the bishop and stakes a claim in the center of the board.\n",
        "8... O-O": "Getting that king nice and tucked away with his pool table. Standard opening procedure.\n",
        "9. Bg5": "Pins the Knight to the queen. It isn't too big a threat by any means, but i dislike it because it keeps my queen stationed at d8 for the time being. I dislike having the integrity of my castle questioned, especially with such a nice pool table inside. \n",
        "9... h6": "In retrospect i shouldn't of done this. It merely weakens the white squares around my castle. It was a poor attempt to shoo away the bishop.\n",
        "10. Bh4": "The best reply.\n",
        "10... a6": "My goal here was to entice the exchange of bishops. If he does exchange, i am able to develop my Knight to its usual square in this defense, as well as connect the Knights.\n",
        "11. Bxd7": "Excellent\n",
        "11... Nbxd7": "So my knights are connected giving my queen freedom to move. I can also get my Rook over to the c file where it will be more active.\n",
        "12. Ne5": "? i don't think this is a good move. After Qb6 white has some coverage to take care of.\n",
        "12... Qb6": "Now the d and b pawns are both at stake.\n",
        "13. Nxd7": "exchanging Knights\n",
        "13... Nxd7": "He still has to cover his B and D pawns.\n",
        "14. Qd2": "covers the d pawn.\n",
        "14... Rac8": "In retrospect, i'm wondering if i should of just taken at b2. Thoughts?\n",
        "15. b4": "I don't like this move. It does protect the b pawn for the time being; however, after Qc7 black will win the c pawn. This also creates a nice little spot for my Knight at c4 which will be hard to cover for white.\n",
        "15... Qc7": "Doubling up on the c file, threatening the Knight, and ultimately winning the c pawn. \n",
        "16. Ne2": "I don't see any better options here.\n",
        "16... Qxc2": "Nets a pawn and attempts to exchange queens. I'm really diggin' my position here.\n",
        "17. Rc1": "decides to contest the c file after the exchange of queens.\n",
        "17... Qxd2+": "Queens are now off the board.\n",
        "18. Kxd2": "Now it is time to get my Knight over to c4 where it will be a major thorn in my opponents side.\n",
        "18... Nb6": "Here it comes\n",
        "19. Rxc8": "? This merely relinquishes control of the c file. Not a good move in my opinion. My choice would be attempting to get the Knight more involved, as it is the only remaining piece that would be able to contest my Knight at c4 without the loss of material.\n",
        "19... Rxc8": "Now the c file is in my control again.\n",
        "20. Rc1": "This doesn't benefit white at all. After the exchange either the king or knight will be fairly displaced and simplifying the board only aids black at this point.\n",
        "20... Rxc1 21. Kxc1 Nc4": "So now the Knight is killing it at c4 White's pawn at a3 is a goner and he also has to be careful that his bishop doesn't get locked in the corner, as that would be game over.\n",
        "22. Nc3": "I don't think this move accomplishes anything. All of the Knights prospective squares are blocked off unless he moves backwards.\n",
        "22... Nxa3": "nabbing the pawn, i can easily return to c4.\n",
        "23. Na2": "puts the knight on guard duties. It is a very inactive piece. This game is all but over.\n",
        "23... f5": "White better find a way to get that bishop out of there.\n",
        "24. Kb2": "That wasn't the way to do it...\n",
        "24... Nc4+": "check...\n",
        "25. Kb3 g5": "And here my opponent ran out of time, although the game was for all intensive purposes, over. good game slaughterer41. Thoughts?\n"
    },
    "url": "https://gameknot.com/annotation.pl/rubber-match-blitz-game?gm=48164",
    "gameName": "Rubber Match, Blitz Game",
    "players": "slaughterer1 (1741) vs. yrahcaz1990 (1621)",
    "opening": "Caro-Kann defence (B10)"
}