{
    "moves": {
        "1. d4": "Rotlewi used this opening move 21 out of 25 times as white. He obviously felt most comfortable with 1.d4 so decided to play it against Rubinstein. Bear in mind the stats I point out are mostly from chessgames.com.",
        "1... d5": "This was Rubinteins fave way of combating 1.d4. He had an impressive record of 125 games win-draw-loss 35.2%-39.2%-25.6%",
        "2. Nf3": "A standard developing move.",
        "2... e6 3. e3 c5 4. c4": "This position has morphed into a kind of Tarrasch.",
        "4... Nc6 5. Nc3 Nf6": "The position is completely symetrical and both sides has two pieces developed.",
        "6. dxc5 Bxc5 7. a3": "This move prepares b4 attacking the c5 bishop.Notice that at this juncture, white has captured the c-pawn before black moved his bishop even once. If black can get white to play Be2 or Bd3 before he plays dxc4, he will have gained a tempo.\r\n",
        "7... a6": "Black makes this move because he soon will make the move dxc4 followed Bxc4 and then he will play b5 at some point to to attack the bishop. It has the same intention as whites previous move.",
        "8. b4 Bd6 9. Bb2": "Whites heeds Aron Nimzovitch's injunction, ' Never play to win a pawn while you development is yet unfinished' and avoids 9. cxd5 exd5 10. Nxd5 when the punishment would be 10...NxN 11.QxN Bxb4 check  and off comes his queen.",
        "9... O-O 10. Qd2 Qe7": "!",
        "11. Bd3": "Here the capture is still too risky .",
        "11... dxc4": "Rotlewi and Rubinstein, as you can see have adopted very similiar setups. The setups have to subtle but vital differences, however, both of which are in blacks favour. The first is that black waited to play 11. dxc4 until after white's king bishop moved, and this strategic delay gained a tempo for black.The second difference is that the black queen is better placed on e7 than whites queen on d2. Black's queen is safe, while the white queen is exposed on the open-d file. Are these small advantages enough to win. Maybe- maybe only if your name is Rubinstein!",
        "12. Bxc4 b5 13. Bd3 Rd8 14. Qe2": "The queen steps aside feeling uncomfortabe on the same file as the rook. This loses white another tempo.",
        "14... Bb7": "As you can see the positions are almost mirror images of each other. The difference is that Rubinstein has already castledand played his rook to d8. Clearly black has gotten an advantage out of development in the opening. ",
        "15. O-O Ne5": "!withvarious dangers,the major one being 16. NxB and if 17. QxN Bxh2  and off comes the queen.",
        "16. Nxe5": "Practically forced, but white parts with his king's knight the best protector of his castled position.",
        "16... Bxe5": "Now black threatens to win a pawn by 17.Bxh2  18. KxB Qd6  19...QxB",
        "17. f4 Bc7": "Is Rotlewi gaining an edge in the centre, or is Rubinsteinm provoking weaknesses in the white king's position? I think the latter. Look at balcks bishop pair glaring menacingly over at the black king from the long diagonals.",
        "18. e4": "Rotlewi still thinks he needs to gain space in the centre.",
        "18... Rac8": "Rubinstein brings up the reserves. This sort of move always reminds me of what Blackburne once said \"Never commence your final attack until the Queen's rook is in play\"",
        "19. e5": "This move cuts down the bishops mobilitya little bit but does not affect its attacking prowess as you will soon see. ",
        "19... Bb6+": "The bishop merely sidesteps the tackle and on to another long diagonal giving check to the king- the first move in a magnificent combo.",
        "20. Kh1": "forced",
        "20... Ng4": "The safety of whites kingis clearly the most criticlal element at the moment. 21. Qxg4 Rxd3 is clearly better for black.",
        "21. Be4": "Rotlevi tries to exchange his bishop, thereby removing one of a terryfing pair of angry wolves. This is a good idea, however... Rubinstein has other ideas. :)",
        "21... Qh4": "Rubinsteins begins the display of fireworks.",
        "22. g3 Rxc3": "!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! This is a remarkable sacrifice of a queen that white can't refuse. If 23. Bxc3 Bxe4  24 Qxe4 Qxh2 checkmate.",
        "23. gxh4 Rd2": "!Sacrificing a queen wasn't enough for Rubinstein. He now throws another rook into the the mixture. ",
        "24. Qxd2 Bxe4+ 25. Qg2 Rh3": "!And checkmate by ...Rxh2 is unavoidable. Notice that the white queen on on g2 is pinnedby the black bishop on b6. Rubinstein. What a game! I hope you liked this game. I'm happy for positive and negative feedback aslong as its constructive criticism! and feel freee to leave comments.\r\nThanks\r\nTom"
    },
    "url": "https://gameknot.com/annotation.pl/rubinsteins-immortal?gm=6587",
    "gameName": "\"Rubinstein's Immortal\"",
    "players": "George Rotlewi (?) vs. Akiba Rubinstein (?)",
    "opening": "Queen's pawn game (D02)"
}