{
    "moves": {
        "1. e4 e5 2. f4": "I'm playing another blitz with white with the king gambit.",
        "2... Nc6 3. fxe5": "?? Very bad blunder. Nf3 or Bc4 was necessary.",
        "3... Qh4+ 4. g3 Qxe4+ 5. Qe2 Qxh1": "Now I'm in a very shitty position.",
        "6. Nf3": "The only fine continuation. Trapping the queen and preparing d4.",
        "6... Bc5 7. b4": "! Now that I have lost a rook, I don't care losing a pawn. As the Evans Gambit, this move can help a lot to gain some tempo and a strong center.",
        "7... Nd4": "! Forcing to remove the white knight to free the queen.",
        "8. Nxd4 Bxd4 9. c3 Bb6 10. d4 Ne7 11. Bg5 h6": "? Waste of tempo. Ng6 would have been better.",
        "12. Bxe7 Kxe7": "Black still have the better because of the rook gain but white still have some chances. Black have some difficulties to develop his pieces because white control the center and his king is weak to attacks.",
        "13. Nd2": "Preparing Nf3 to trap the queen and castling.",
        "13... Qc6": "Necessary.",
        "14. Rc1": "Now that most of my pieces are far away, my king have no fine place to hide.",
        "14... Qa4 15. Qc4": "?! I think moving the knight would have been better here.",
        "15... Re8 16. Be2": "Protecting the king and preparing Bh5 for later.",
        "16... d6": "? I think than Qa3 followed by a5 would have been better for black here or Kf8.",
        "17. exd6+ cxd6 18. Qd5": "! This move give a lot of opportunities and black must protect himself of Bb5. ",
        "18... Qa3": "I don't like that move. Bc7 seems better here.",
        "19. Rc2 Bd7": "? Be6 was necessary here.",
        "20. Nc4": "Now Black is in some difficulties.",
        "20... Bc7": "?? Qa4 give more resistance even if black gets some checks. White have a very big advantage now.",
        "21. Nxa3 Bc6 22. Qb3": "This way I can continue to advance my pawns and continue to threat f7.",
        "22... Kf8 23. Kd1 Re3": "? Losing tempo.",
        "24. Nc4 Re7 25. Bd3": "Now the rook can move.",
        "25... Bd5 26. Qa4": "The queen must move because of b5.",
        "26... Rae8 27. Kc1 Re7e3": "?",
        "28. Nxe3 Rxe3 29. Re2": "! Threatening Re8# and forcing the exchange of rooks. After black loses the rook, the win gonna be way easier for white.",
        "29... Bc6": "Rxe2 give more survivability.",
        "30. b5 Rxd3": "If Rxe2 then 31.bxc6 Re3 32.cxb7 Rxd3 33.Qc4 threatening the bishop and the rook + promoting.",
        "31. bxc6 Rxc3+ 32. Kd2": "This way the rook cannot checks the king again.",
        "32... Rxc6 33. d5": "! Game over."
    },
    "url": "https://gameknot.com/annotation.pl/run-as-you-like-i-will-get-you?gm=52733",
    "gameName": "Run as you like, I will get you!",
    "players": "drchopper  vs. segovia30 ",
    "opening": "King's gambit (C30)"
}