{
    "moves": {
        "1. e4 e5 2. Nc3": "So far, so good -- a nice, standard Vienna game.  Typical next moves for black include Nf6, Nc6, or even Bc5.  But black has another idea...",
        "2... Qf6": "?!  This is premature, no doubt, as I could play Nd5 right now, forcing the queen to address the fork at c7.  But, as my opponent is about to be shown, developing your pieces can be far more important.",
        "3. Nf3 Bc5": "Going for the cheap mate threat on f2, no doubt.  At this point, Nd5 looks good, since once the queen addresses the threat on c7...",
        "4. Nd5 Qc6 5. Nxe5": "I'm free to take on e5; as an added bonus, I hit the queen *again* due to black's poor choice of where to move the queen.",
        "5... Qa4": "?  Abandoning the protection of c7, but I suppose black liked the counterthreat of Qxe4 .  As it stands, though, I'm happy to win a pawn and rook for two pawns, which is all I saw black could get out of his counterthreat after the knight fork followed by Qxe4  for black, Qe2 for white and then Qxc2 for black.",
        "6. Nxc7+ Kd8 7. Nxa8": "Snapping up the rook, but also preventing the black king from using c7 as a flight square.  Notice that Nxf7  is now a threat, winning the other black rook as well.",
        "7... Qxe4+": "Black follows through with what must have been his plan.",
        "8. Qe2": "!  Easily the best move here, as Bf2 loses the knight.",
        "8... Qf5": "Protecting against the knight fork on f7 and also threatening Qxf2  if the white queen moves.  At this point, notice that if the black queen leaves the protection of f7, then Nxf7 is checkmate!  This must be brought to fruition...",
        "9. g4": "trying to get the black queen away from f7 by any means...",
        "9... Bxf2+": "!?  I'll give black his only due with this move -- this is a nice try, as Qxf2 would be met with Qxe5 , keeping black alive for quite some time and allowing him to consolidate.",
        "10. Kd1": "White doesn't fall for it at all, though.  Now, not only must the black queen protect f7, but it must protect the straggler on f2, and address the lingering threat of white's 9. g4.",
        "10... Qf4": "The only other square that saves the queen and protects both f7 and f2 was f6; where she'll be forced to after white's next anyway...",
        "11. d3": "!  Much better than any other move, forcing the queen to f6.",
        "11... Qf6 12. g5": "!  And now this forces the queen back to f5, otherwise the bishop falls.",
        "12... Qf5": "To be honest, black should've jettisoned the bishop here, because what follows is far worse...",
        "13. Bh3": "!!  Ouch.  The queen is lost now -- she has no moves that will allow her to maintain protection of f7.  Jewels finds the one move that saves his queen...",
        "13... Qxh3": "... but overlooks what I noticed back on the 8th move: that if the queen leaves the protection of f7...",
        "14. Nxf7#": "Nxf7# is checkmate.\n\nBlack's queen moved 9 times out of his total 13 moves, and FOUR of his pieces are still at home.  This was a fun game to play, and I hope it was fun for you to step through!"
    },
    "url": "https://gameknot.com/annotation.pl/run-queenie-run?gm=7051",
    "gameName": "Run, Queenie, run!",
    "players": "ethansiegel (1726) vs. jewels26 (1323)",
    "opening": "Vienna game (C25)"
}