{
    "moves": {
        "1. e4": "I feel like a King pawn game.",
        "1... e5 2. Nf3 Nc6 3. Bb5": "I typically prefer the Spanish over the Italian due to better performance when playing as white.",
        "3... a6 4. Ba4 Nf6 5. O-O Nxe4": "Black plays for the open Ruy Lopez, a common alternative is [5...Be7]. I find this move to have a sense of adventure and it fits into my mood for the game.",
        "6. d4": "Probably a suggested book move, but I think [6.c3] may also be played.",
        "6... b5": "A typical book move.",
        "7. Bb3": "book",
        "7... d5": "Book, but hanging the knight.",
        "8. Nxe5": "The last book move per Hiarcs 9. I could have captured with the pawn, but I liked the placement of a knight here. An exchange could have occurred due to the unprotected knight on c6, which would have been interesting, but not necessarily giving white any great positional advantage. There was also the chance of [8...Na5], which was actually played, which costs the bishop advantage for white, but leaves the knight posted in a forward position looking at c6.",
        "8... Na5": "Going for the bishop advantage.",
        "9. f3": "Adding something to the equation. It does not prevent the NxB exchange, but it does add another factor into the mix.",
        "9... Nxb3 10. axb3": "The alternative [10.cxb3] is not as good because it does not bring another piece into the game as the text move does.",
        "10... Ng5": "I have to admit that this move baffled me. It seemed that [10...Nf6] was better because the knight is posted in a solid defensive position. The text move seems to suggest perhaps a future sacrifice at f3, but I did not see how this could be made to work within the next few moves so I felt at ease.",
        "11. Nc6": "The text move attacks the queen primarily, but also opens a line for the rook on the e file. Yes, its an unsecured move, but it can be maintained with the proper application of attacking moves.",
        "11... Qf6": "Keeping the queen safe while attacking the knight, but perhaps [11...Qd6] was better?",
        "12. Re1+": "Besides the obvious check, this move keeps the knight safe for the moment while developing a piece into a more useful position.",
        "12... Be6": "Better than [12...Be7 ??] which simply loses a piece. But now the knight at c6 is safe from the queen.",
        "13. Nc3": "Bringing another piece into the game with a promise of attack at b5.",
        "13... Kd7": "A reaction to try and shift focus from (Nxb5) since now the other knight is threatened.",
        "14. Ne5+": "But I have a strong reply (forcing move) - which cuts the king off from c6, which means the plan of Nxb6 is still a go.",
        "14... Kc8": "Better than [14...Kd6] incurring a check while losing a pawn.",
        "15. Bxg5": "A diversionary move (BxN exchange), which at first does not seem to offer much, but does offer some positional compensation by drawing the queen away from the 6th rank and reduces some potential attacking opponent counter-play.",
        "15... Qxg5 16. Nxb5": "The text move [16.Nxb5 ! ] brings a knight closer to the target of the king while gaining a pawn. The hanging rook at a8 enables the pin theme (16...axb5 ?? 17.Rxa8  ).",
        "16... Rg8": "A poor move ( ? ) that accomplishes little. Perhaps a pawn storm on the kingside would make this move seem more effective, but the position does not suggest this move.",
        "17. Ra5": "I return the favor and make a poor move of my own ( ?? ), which was caused by my own oversight. But as I looked a bit closer I decided that the text move could actually be beneficial by offering an exchange sacrifice at e1 with the idea of maneuvering the queen into position to attack the king using the c3 square.",
        "17... Bb4": "The painful fork is applied.",
        "18. Ra4": "Forcing, sort of, the exchange sacrifice.",
        "18... Bxe1 19. Qxe1": "The queen has been moved onto the black squares which give access to the opposing king via c3. Of course there is still the matter of preventing (...Qc1  ) that must be attended to first.",
        "19... Bh3": "The text move ( ?? ) is a futile attempt to enact a mate at g2, and is but a minor inconvenience.",
        "20. g3": "Refuting mate at the expense of some open air around the king.",
        "20... f6": "The text move ( ?? ) is a positional blunder due to the attack that is forming on the king.",
        "21. Nf7": "A nice move which presents an attack on the queen while opening a file for the white queen. The text move has the advantage of forcing the opposing queen farther from the action positionally.",
        "21... Qh5 22. Qe7": "A nice strong attack on c7 which must be dealt with immediately.",
        "22... Bd7": "Forced, otherwise its mate. Here I had to consider the best method to expose the king to attack and complete the mating attack. The knight sacrifice (using the b5 knight) screamed loudly to be played, so I did. The f7 knight is fulfilling the duty of cutting off the opposing queen, and will prevent the king from fleeing during the next few moves.",
        "23. Nbd6+ cxd6": "Knight down, knight down! We have a knight down! But its okay, all part of the plan.",
        "24. Nxd6+": "The only option will be a king walk.",
        "24... Kc7 25. Nf7": "While this is not a forcing move, it does keep the king blocked from using (d8,d6), while opening a line for the queen to reach c5 ( pawn supported square), to further the attack. Note that there would be trouble for white if not for the pawn at f3 which blocks (...Qd1  ).",
        "25... Qxf3": "Got to go for the free pawn so that (...Qd1   ) is possible. Notice how awkwardly placed the queen was and how it is unable to assist the king in the developing attack.",
        "26. Qd6+": "A forcing move to push the king into a smaller selection of squares. Notice that over the next moves how the queen at f3 is unable to assist due to having no open lines back to the king position.",
        "26... Kc8": "No other moves offer any promise.",
        "27. Qc5+": "Note the coordination of the knight blocking (d8,d6), which with the bishop at d7 creates a wall. Here however there is a chance to block the check instead of walking the king - but it does not help.",
        "27... Bc6 28. Qxc6+": "Only one square left for the king.",
        "28... Kb8 29. Rb4+": "And again, only one square left for the king.",
        "29... Ka7 30. Rb7#": "And mate by defended rook. Alternatively there was [30.Qb7 #], but the rook appealed to me aesthetically. Its interesting how I was down a point and with my king placed in a vulnerable position where an attack may have obtained draw by repetition, but it was the continuous attack that made the difference and allowed mate. I welcome comments by anyone, especially in the area of strategy, and what you think of my view of positional sacrifices, thanks."
    },
    "url": "https://gameknot.com/annotation.pl/ruy-lopez-open-c80-me-vs-excalibur-404d-bh015?gm=21502",
    "gameName": "Ruy Lopez Open C80 - Me vs Excalibur 404D BH015",
    "players": "me (1500) vs. Excalibur 404D BH015 ",
    "opening": "Ruy Lopez (C80), open, Schlechter defence"
}