{
    "moves": {
        "1. c4": "The English opening. I couldn't find any games that my opponent previously played so I didn't know what he would play. I had prepared an opening for e4 and d4, but not for c4. I don't know the theory behind it, but it's a pretty interesting opening.",
        "1... c5": "I decide to play the mirror match up. I was thinking about e5 to go into some sort of reversed Sicilian, but didn't feel confident in it.",
        "2. Nc3 Nc6 3. g3 g6 4. Bg2 Bg7": "So far every move has been quite natural. The mirror match up apparently turns bad for Black somewhere along the line, but I didn't know this at the time of playing. ",
        "5. Nf3 Nf6 6. d3": "I raise a question mark behind this move. Yes it's probably main theory in the English ( I haven't checked yet ), but it feels so meek. I suppose this is because I myself play the queen gambit which of course starts with d4 and thus I'm not accustomed to the entire d3 idea.",
        "6... O-O 7. O-O d5": "Explosive! This move isn't necessarily the best move, but I decided that I didn't want to allow my opponent to be in his comfort zone any longer so i tried breaking open the center. I looked at cxd5 Nxd5 Nxd5 Qxd5 but couldn't find any move dangerous moves after that.",
        "8. cxd5 Nxd5 9. Nxd5 Qxd5 10. e4": "This move is just a plain mistake if you ask me. Not only are you blocking the good diagonal of White's light squared bishop, giving it less scope but you also make d3 a target in the future.Yes you get a little center control due to it, but I don't consider it adequate compensation.",
        "10... Qd8": "I was pondering on retreating to d7 or d6, but I didn't want to obstruct my bishop and if Qd6 is played then he gets Bf4 with tempo which I didn't want to allow so I opt for retreating to d8.",
        "11. Rb1": "Another questionable move in my opinion, not because it's bad but because there are better alternatives. The idea behind Rb1 is simple. My bishop on g7 is attacking the pawn on b2 and as a result his dark squared bishop can't develop, so he plays Rb1 so he can develop it in the future. That being said Qc2 accomplished the exact same thing, but also threatens the c5 pawn and develops his queen so I don't understand why he didn't just play Qc2.",
        "11... Nb4": "This move ensures I win a pawn since it attacks both a2 and d3 which got weakened as a result of the previous e4 move and he can't defend both. That being said I do still need to be careful when I win a pawn since the knight can become a a subject to pins/skewers and whatnot if it for example were to take on d3.",
        "12. Be3": "Questioning my pawn on c5 and preventing Nxa2 due to Bxc5 which gets my knight in awkward position where it has trouble with retreating.",
        "12... b6": "After a long think I end up playing the obvious b6 move. I was thinking whether or not I could get away with for example Nxd3 but for some reason I didn't end up playing it. Maybe because I was scared of moves like Qc2 Nb4 Rfd1 but looking back to it, it isn't much to fear. The idea behind b6 is to not only protect c5 and a a result make his dark squared bishop less valuable, but also to play Ba6 if he would play d4. Example: 13. d4 Ba6 14. Re1 Nd3 15. Rf1 Nxb2 16. Re1 Nd3. It doesn't win a lot of material for Black, but it's something White will have to be wary of for quite some time.",
        "13. Ne1": "Not a big fan of this move, but it's understandable why he played it. He wants to avoid Nxd3 by defending it as it would give up the little center control he had. That being said, a knight on e1 isn't a lot to be scared of.",
        "13... Nxa2": "After a long time of thinking I capture on a2. I was calculating stuff along the lines of 13. Ne1 Nxa2 14. e5 Rb8 15. Qa4 Nb4 16. Qxa7 but found that it isn't really an issue. The White queen isn't helping in his defense over there and I'll be able to win the pawn on e5.",
        "14. e5": "Threatening the rook.",
        "14... Rb8 15. Qa4": "Executing the plan I calculated earlier.",
        "15... Nb4 16. Qxa7 Bf5": "This might be an inaccuracy on my part and I wonder if Ba6 isn't better. The reason being because it blocks of the escape of the White queen and maybe it'll be possible in the future to win the queen. The queen would have nowhere to run after Ba6. Bf5 is played to target the weak d3 pawn which is logical enough I suppose.",
        "17. Be4": "A move that emphasizes the situation White is in in my opinion. He needs to make these type of moves since, if he waits I'll capture the d-pawn, then win the e-pawn, trade everything off and you're suddenly down in an endgame with 2 pawns down. Even if it means trading off, White's strong bishop, he cant' just turtle up and do nothing.",
        "17... Bh3": "Targeting the rook on f1, however I think this is a mistake. Not only was Bxe4 probably better, but maybe I could have just played Nxd3 here. I didn't go for it since I was a little scared off creating a weakness on the g-file, but looking back on it this isn't that big of a deal considering the limited amount of pieces White would have left. I also would be up 2 pawns, meaning an easy endgame.",
        "18. Ng2": "Defending the rook by blocking the diagonal. His knight wasn't that strong on e1 so he might as well trade it for my strong bishop. I realised Bh3 was a mistake shortly after I made the move.",
        "18... Bxg2 19. Kxg2": "I probably would have played Bxg2 to avoid f5 being played with tempo, but this is fine too. I understand that he wants to keep his central presence as it's one of the few things White has going for him.",
        "19... Bxe5": "Finally capturing the material I could have ( and probably should have ) captured long ago. I was a little hesitant as I was expecting f4 to follow, but my plan for f4 was just to play Bg7 once more.",
        "20. Rfd1": "Preparing for the d4push and avoiding the loss of the d3 pawn. ",
        "20... f5": "Opening the position. The plan I had in mind was 20. Rfd1 f5 21. Bf3 f4 22. gxf4 Bxf4 23. Bxf4 Rxg4 and suddenly my rook is active. I'll play e6 or e5 in the future and get my queen involved to try for a mating attack.",
        "21. Bf3": "After a long think he retreats to f3. Perhaps he was trying to convince himself of Bb7, but it's far less threatening there then it actually looks so Bf3 is correct in my opinion.",
        "21... f4 22. Bd2": "After another long think he pulls out Bd2 with the plan of trading my knight for his bishop and creating doubled pawns on the c-file. which are very easy to target.",
        "22... Nc2": "The plan is simple. Get my knight to d4, trade with his light squared bishop and open up his king to the f-file so fxg3 comes with tempo. That being said I'm not sure why I didn't just play Nxd3. The pin isn't that scary with the bishop blocking the d-file. I suppose I got so focused on my plan that I forgot to search for alternatives which are clearly better.",
        "23. b4": "A little bit tricky, mostly because of the a2 square. I didn't want to play Nxb4 because Bxb4 cxb4 Rxb4 follows, giving White counter play again. What I should have played here was Nd4, but as I said in the introduction the first 20 or so moves aren't ones I'm proud of. I missed a lot in this game.",
        "23... fxg3": "I played this move far too quickly, convinced that b4 wasn't anything to be scared of. 24. bxc5 gxf2 25.cxb6 doesn't look too horrible after all since Black's pawn is so close to promoting.",
        "24. Qa2+": "The dreaded move where I lose a knight. Of course you can argue that Black already has compensation for his knight in the form of the pawns he won earlier, but it still was a hefty blow to my morale.",
        "24... Kh8": "Moving out of the check.",
        "25. Qxc2": "Capturing my knight. I had lost most of my spirit as I saw 20 minutes left on my clock. However it occurred to me that nearly all of White's pieces are in the same area and aren't capable of protecting the king. I start calculating the rooksac. Of course I would have to chase him for quite a while, but as long as I could chase him all the way over the board, I was confident to pull something off. A gut feeling so to speak.",
        "25... Rxf3": "Stunning his previously bright face in a look of horror as he mutters something I couldn't hear to himself. ( I assume he muttered something along the lines off, \"that lucky son of a ...\" ).\n\nThe problem with Rxf3 for White is that he can't really ignore it. If you decide to ignore it with for example bxc5 then Rxf2 follow and my queen will eventually enter the fray via Qd4. As if that isn't bad enough the pawn on the 3th rank can potentially promote if he isn't careful. And even if he finds some way out, he's 2 pawn down like before he captured my knight. Therefore it's really hard to resist the temptation of taking the rook. Capture the rook and pray that you can flee somewhere like for example, get all the way to the c1 square? Or ignore the rook and go into a lost endgame? None of the options seem appealing, he chooses the former.",
        "26. Kxf3": "There's 2 ways of approaching this for Black. Either Qd5+ or Qf8+. I'm pretty sure both of 'em are good, but I wanted to prevent the White king to abuse the e-file so I chose the latter.",
        "26... Qf8+": "Going to e2 gets met with Qxf2+ mate. Going to g2 gets met by the same move after which Kh1 Qxh2/ is checkmate. Going to g4 gets met with Qf5+ After which Kh4 is forced. After that you play Qh5+ which is also checkmate. Ke3 gets met with Qf4+ after which the Qe2 is forced and then you get the same checkmate as if he were to go to e2 immediately. By process of elimination the only safe square for White's king is e4.\n\n",
        "27. Ke4": "We're going for a walk. ",
        "27... Qf5+": "The only place to give check while limiting his options to just 1 square. Qe3 gets met with Qf4 leading to a checkmate explained earlier so e5 is his only square.",
        "28. Kd5 Ba1+": "Opting to move my bishop as far away as possible from the enemy king. Let's say I put my bishop on b2 instead, then things can get fishy if he gets his king on b3. Bg7 was also a possibility. ( Note that Bf6 isn't a possibility since my queen will go to the f6 square somewhere in the future. ) At this point of the game I have about 9 minutes left to figure out a winning variation.",
        "29. Kc6": "As sad as it is, this is the only move that doesn't immediately loses.. 29. Kc4 b5+ 30. Kb3 Qd5+ 31. Qc4 bxc4+ for example and White's future looks bleak. No matter where he goes, checks will follow and checkmate seems unavoidable.",
        "29... Rc8+": "This move took me 8 of my remaining 9 minutes, trusting on the 30 second increment per move to keep me from timing out while I work out the rest of the puzzle on the go. Other options were for example Qc8+, but then a draw by repetition seems unavoidable, Qe6+, but I don't want him to flee via Kb5-> Kc4 and I don't have an immediate way to keep on checking his king without a draw by repetition. Because of all this I opt for Rc8+ ",
        "30. Kxb6": "Moving his king to b5 would have meant I'd play c4 with discovered check. ( not cxb4 as his pawn on b4 is more of a hindrance for him then a strength ). after which he can play a5 that gets met by Ra8#. Moving to a6 instead of a5 gets met by moves like Qe6+ and if I get my queen on c6, then it's fair to say that White's king is dead. If he were to go try and escape via b5 then I'd play c4 again and White's king it in for a bad time, checkmate is unavoidable in that position. Kxb6 is the most prolonging move.",
        "30... Qf6+": "Putting the king in check once again. Going 30.Kb5 means I plays Qc6+. After he moves to c4 I play bxc4+ which is a discovered check. If he plays Kb3 I plays Qxc2+ which is checkmate with Ra8 after he flees to a3. Kb7 gets met by Qc6 which is also a forced checkmate. 31.Ka7 gets met with 31. Rc7+ 32.Kb8 Qb6+ 33. Ka8 Ra7#. 6 seconds left on my clock as I try my hardest to think of a forced mate if he moves to a5. I press the clock and my time goes back to 36 seconds. I haven't found a plan for a5 yet, but know I can come up with something given that I create a minute for me to work with. It helps enormously that the next few moves are rather obvious.",
        "31. Ka5 Ra8+": "Limiting him back to b5. I need to get rid of my own c-pawn in order to win his queen, though I can't help but wonder if there's a forced mate here.",
        "32. Kb5 Qa6+ 33. Kxc5 Rc8+": "Winning the queen. Like one of my friends sometimes says: win the queen first, give checkmate later",
        "34. Kd5 Rxc2 35. Rbxa1": "Not a bad move, removing my pesky bishop but White is already hopelessly lost. I think his king being in check every move since move 26 ( with the exception of move 34 where I win a queen ) says enough about how hopeless the situation for White is.",
        "35... Qxd3+": "The checks continue.",
        "36. Ke6 Rxd2": "I decide to just win material. After a short think I couldn't find an immediately forcing checkmate.  Having a queen for his rook in an endgame should be easy enough to win.",
        "37. Ra8+": "Trying to get some counterplay, but sadly this one check is all he's going to get.",
        "37... Kg7 38. Ra7": "I start looking at Qf5, which is checkmate in 1 after Kxe7. I find a mate in 1 in Re2+ though.",
        "38... Re2#": "And with this the game ends. It was a close one, closer then I dare to admit. I'm really happy that I found Rxf3 over the board. All the moves before that, however were questionable at times. The tournament is almost nearing the end. I just need to play one more game against someone with a similar rating. After having hard matchups every round it seems they've finally taking mercy on me and let me play similar rated opponents. "
    },
    "url": "https://gameknot.com/annotation.pl/sacrificing-for-a-kingchase?gm=59275",
    "gameName": "Sacrificing for a kingchase",
    "players": "Cotman Dirk (1331) vs. Goris Jeremy (1369)",
    "opening": "English (A38), symmetrical variation"
}