{
    "moves": {
        "1. e4 e5 2. Nf3 d6 3. Nc3": "Basic Rule: Getting my Knights out before my bishops",
        "3... Nf6 4. d4": "sacrifice 1: aiming at getting my knights into the centre",
        "4... exd4 5. Nd5 c5": "Black supporting the d4 pawn",
        "6. e5": "Hoping for 6.dxe5 ",
        "6... Nxd5": "Now i'm struggling to hold onto the centre, not looking like a good opening game",
        "7. Bc4": "threatening d5 and aiming at f7",
        "7... Nb6": "Hoping for eventual f7, and realise i need to try and support c4, but I decide to pressure the queen and hope to further push my centre pawn",
        "8. Bg5 f6 9. Qe2": "covering c4 but also hoping for a revealed check and further push my centre pawn",
        "9... Nxc4": "sacrifice 2 and -7 down in material, but I'm armed with artillery on the King side ready to strike",
        "10. exf6+": "Revealed check to once again further push my pawn towards h8",
        "10... Kd7": "Why stop the push now 11.exf7 seeing the threat to blacks queen with my white bishop",
        "11. fxg7": "Threatens h8 and advancement, black cannot take my advancing pawn as his queen is under threat",
        "11... Qa5+": "Applying pressure and trying to slow my development\r\n",
        "12. Bd2": "Threatening blacks queen and hopefully taking his concentration off my advancing g pawn",
        "12... Nxd2": "-8 down and now lets see if my sacraficing for positional advantage will pay off.\r\n",
        "13. gxh8=Q": "Seeing that blacks king is vulnerable on the 7th I decide to advance my pawn and hope to keep the pressure on his king with my two queen, but 1st dealing with the revealed check I'm about to recieve...",
        "13... Ne4+": "-8 to  5, I think my sacrificing is paying off and now I have opportunity to take control with my two queens...as soon as I adequately protect my king",
        "14. c3 dxc3": "Threatening revelaed check number 2, but hopefully I wont give him the chance",
        "15. Qxh7+": "Gaining some tempo to get my king safe before I really start opening up my big guns",
        "15... Be7 16. O-O": "Protecting my king before the strike",
        "16... cxb2": "Threatening to blacks pawn, but hopefully I can keep the pressure on ",
        "17. Ne5+": "Sacrafice 3 to open the d file and the start of a 7 straight checking combination",
        "17... dxe5 18. Rad1+": "I once heard when deciding which rook to move, look at the one in the best position and move the other one. I think I moved the right one?\r\n",
        "18... Nd6": "Now a pinned knight",
        "19. Qg4+ Ke8 20. Qh8+ Bf8 21. Qxe5+ Kd8 22. Rxd6+ Bd7 23. Qgg5+ Kc8 24. Qef6": "sacraficing the rook to enable my Queens to sqeeze blacks king further into a corner",
        "24... Bxd6 25. Qxd6 Nc6 26. Qg7": "I wanted to try and keep Blacks queen out of the action but seeing this was going to happen I needed a bit more fire power to combat the inevitable queen trade ",
        "26... Qd8 27. Rd1 b1=Q": "4 queens, but mine are alot better placed, also aiming to remove my rook from the d file, but thats easy to rectify",
        "28. Qgxd7+": "Forcing the exchange of his well positioned queen",
        "28... Qxd7 29. Qxd7+ Kb8 30. Rxb1": "Getting rid of the competition",
        "30... b6 31. Qxc6 c4 32. Rd1": "Getting the rook back onto the d file ready to mate on the back row ",
        "32... a5": "trying to get his rook out, but I ve got the tempo",
        "33. Qxb6+ Kc8": "Forced",
        "34. Rd8#": " 11 and that's game. Thanks to my opponent and to Anderssen for the new light into the power of sacrificing for positional advantage. All respect to my opponent who I leave anonymous. I must have caught him on a bad day."
    },
    "url": "https://gameknot.com/annotation.pl/sacrificing-for-positional-advantage?gm=8487",
    "gameName": "Sacrificing for Positional Advantage",
    "players": "Abinadi1 (1278) vs. Anon. (1482)",
    "opening": "Philidor's defence (C41)"
}