{
    "moves": {
        "1. e4": "Hello everyone. This game gives you a debate of whether castling is good or not. Are you safe behind your wall of Pawns? You might be. Trouble is, these Pawns might start rebelling! Don't get what I mean? Well, you will later...",
        "1... c5": "Black is kicking off with the Sicilian Defence.",
        "2. Nf3 Nc6 3. Bb5": "This is not that common, unless playing the Ruy Lopez.  Regular third moves for white are Nc3, Bc4, or maybe d3. Black should now play 3.... Nb4! escaping the threat although a6 is common in most junior games. ",
        "3... a6": "This move is debatable. It does chase the bishop away, but if 4. Bxc6 dxc6 Black results with doubled pawns. 4. ... bxc6 would still be the same, except the half-open file would be the b-file, not the d-file. Note that non of black's king-side pieces have been developed, making it difficult to castle.",
        "4. Bxc6": "Retreating the bishop with 4. Ba4 is silly as the bishop has to waste time running away, whilst back can catch up with the development with 4. ... Nf6 or even attack the bishop a second time with 4 ... b5!",
        "4... dxc6": "Black is forced to reply, resulting with doubled pawns. Black has all his pieces in bed, and his only piece that had come out was the knight, now taken, leaving white to move.",
        "5. O-O": "White immediantly castles into saftey. Another option would have been 5. Nc3.",
        "5... Nf6": "Black develops his second knight. ",
        "6. Nc3": "6. Nc3 defends the e4 pawn. Note that 6. d3 is also OK.",
        "6... Bg4": "This move pins the knight but white would not have doubled pawns as 7 ... Bxf3 8. Qxf3 resulting an advantage for white. Also, this enables blacks DSB to come out after 7. ... e6 does not block Black's LSB. 7 ... e5 is also another option as 8. Nxe5 would result in 8. ... Bxd1 winning the Queen.",
        "7. d3": "Supporting the e4 pawn and allowing White's DSB to develop.",
        "7... e5": "In order to get Black's DSB out and get Black's king into saftey. Again, 8. Nxe5 is not an option as Black would reply with 8. ... Bxd1, winning the queen.",
        "8. Bg5": "Developing the bishop and pinning the knight. Serves black right for pinning white's knight!",
        "8... Bd6": "Developing the bishop, preparing to castle.",
        "9. h3": "Chasing the bishop away. Note that 9. ... Bxf3? removes the pin.",
        "9... Be6": "The bishop returns to home and supports his friend, the other bishop, launching effective attacks. Note that black's LSB is much more mobile and active than Black's DSB.",
        "10. Qe2": "White connects his rooks and gets the Queen into play.",
        "10... O-O": "Black gets his king into saftey by castling, or is it really safe? ",
        "11. Rad1": "White gets his Rook from the corner into the centre and into the game.",
        "11... h6": "This move is also debatable. This messes up the kingside, but since white has done that too, so what's the problem?\n\nWhite should now play Bh4!! keeping the pin on the knight. Retreating down the long diagonal is a bad idea since the knight can now move into play without the queen being taken. ",
        "12. Bh4": "Keeps the pin steady and ready. You might think that 12. ... g5?! is disastrous for White. Actually, it's more disastrous for Black than White, as you will soon find out...",
        "12... g5": "?? This opens up Black's kingside. Now white can do a quick trick involving getting White's queen into the game and swapping a piece for two important pawns. ",
        "13. Nxg5": "!! 13. Nxg5!! Absurd, or is it? Two pawns for a knight is a good swap as Black's king is now vulnerable to attack. If 13. ... hxg5, White replys with 14. Bxg5! And if 13. ... Nd7, then 14. Nxe6 is as good as ever. 14. ... Qxh4 results with 15. Nxf8. ",
        "13... hxg5": "An option that's not that good, but what's better? Completely ruins the King-side. Black's pawns are dying for White's pieces! ",
        "14. Bxg5": "And will you look at this, it still keeps the pin! Now when the knight has vanished, the White Queen can get into the game. ",
        "14... Be7": "Breaking the pin! Good move, though now Black's LSB is even less mobile, with only one square to move to if attacked (d6).",
        "15. Bh6": "!! This move attacks the Rook and forces the Rook move onto the e8 square. ",
        "15... Re8": "This move is forced.",
        "16. Qe3": "White can now play 17. Qg5+ or 17. Qg3+, both as good as ever, both leading up to Qg7#. There is only one reply.",
        "16... Nxe4": "Black sacrifices the knight in order to stop checkmate. Now both queen checks can be taken by the knight. Even when the knight is taken, black does not stop preventing mate.",
        "17. dxe4": "This also opens the Rook to fearsome double-attack of mate and the capture of the queen! ",
        "17... Bh4": "This move leaves the Queen under attack and capture, but it prevents mate. For a while, anyway. But what's more important, the game, or the Queen?",
        "18. Rxd8": "Better take the Queen anyway! Black has lost his most precious piece! ",
        "18... Raxd8": "Black uses magic (only kidding) to get his rook into the game. ",
        "19. Qxc5": "Threatening 20. Qxe5 followed by 21. Qg7#",
        "19... Bd7": "Protects the pawn but does it protect the threat?",
        "20. Ne2": "White hopes to get the knight into the game. ",
        "20... Re6": "Black attacks the bishop. Note that after 21. ... Rxh6 22. Qxe5 does not lead to mate, as there is no bishop to help.",
        "21. Be3": "Returning to safety.",
        "21... b5": "?! This move has no use. Probably Black didn't think of anything else to do!!",
        "22. Ng3": "Getting the knight into the game, ignoring 22. ... Bxg3.",
        "22... Bxg3": "?! Dubious move. White now replies with 23. fxg3. Doubled pawns do not matter, since the Rook gets into the game.",
        "23. fxg3": "Prepare for the most magical phrase of all: THE ROOK IS IN THE GAME!!!",
        "23... Rg6": "Grabbing pawns at this time of game is absurd. Black needs to concentrate on the game. White is winning by six points at the moment. ",
        "24. Qe7": "!! Creating a triple attack on the d7 bishop, the d8 rook and the f7 pawn.",
        "24... Rf8": "The rook protects the f7 pawn. This is as 25. Qxf7+, is followed by 26. Qxg6. Sadly, the bishop will be lost. ",
        "25. Qxd7": "Say bye-bye to the bishop. Sorry, Black. ",
        "25... Rxg3": "Again, grabbing pawns is absurd. I mean, now White is eight points ahead. Black has more things to worry about!",
        "26. Bc5": "Attacking the Rook with the bishop, forcing the Rook to move, leaving the f7 pawn threatened. ",
        "26... Rb8": "The Rook moves to one of the two only safe squares for it to go to. Notice how if Black had played 26. ... Rg7?? is followed by 27. Bxf8! winning the rook as if 27. ... Kxf8 had been played, White would have followed with 28. Qd8# mate. ",
        "27. Qxf7+": "White is beginning to carry out a mating sequence. Has Black got a way to stop it?",
        "27... Kh8": "Forced move. ",
        "28. Rf6": "Threatening a killer threat, 29. Rh6#. Black can not stop it with 28. ... Rg6, as if 29. Rxg6 there is no escape, so this time Black moves...",
        "28... Rxg2+": "!! This is the only move delaying the mate by quite a bit. Notice if 29. Kxg2 is followed by 29. ... Rg8+. I was a bit silly then, and I only found this out after the battle. The best move was actually 29. Kf1, as if 29. ... Rg1+, White can reply with 30. Bxg1 solving the problem. ",
        "29. Kxg2": "As I said, I was very silly then and I didn't know that would happen. ",
        "29... Rg8+": "Nice move. Notice how 30. Qxg8?? is a big blunder, as the game could end quickly is White doesn't sacrifice his queen. ",
        "30. Kf3 Rg3+": "And Black sacrifices his second rook in order to delay mate. ",
        "31. Kxg3": "Notice how if none of the queenside pawns were there, then this position would have been stalemate? Well, luckily, there are pawns that can move, so it serves Black right. Either the result would be 31. ... a5 or 31. ... b4. ",
        "31... b4": "Black feeds his pawn into the path of the bishop. Well, sadly, there is no time to greedily grab the pawn...",
        "32. Rh6#": "And, unluckiliy for Black, white wins. Well, I win. I'm 18 points up (and the game up, of course.) \n\nSo, have you enjoyed my annotated game? And have you ever thought about the negative side of castling? Have a think. and I shall reveal the answer in the next annotated game of mine. \n\nI hope you have enjoyed my annotated game. Goodbye...\n@oodle "
    },
    "url": "https://gameknot.com/annotation.pl/safe-behind-pawns?gm=49432",
    "gameName": "Safe behind Pawns?",
    "players": "oodle  vs. chesscrazy ",
    "opening": "Sicilian (B30), Nimzovich-Rossolimo attack (without ...d6)"
}