{
    "moves": {
        "1. e4 e5 2. Nf3": "Alright this game is commentated by Nimzowitsch himself. I just found this in my book and thought that I would put it up. However if someone else has put this game up as an annotated game,tell me and I will put this game down. Also you will note that Nimzowitsch will talk a lot about blockading in this game. \nEdited: I had trouble translating the descriptive form to algebraic so correct me if I am wrong somewhere.",
        "2... d6 3. d4 Nf6 4. Nc3 exd4": "Surrender of the center. Black will seek to keep White's e-pawn under restraint.",
        "5. Nxd4 Be7 6. Be2 O-O 7. O-O Nc6 8. Nxc6 bxc6": "This exchange creates advantages for both sides. Black gets a more compact pawn formation in the center, safeguards for instance the d5 square against it's possible occupation as an advanced post by a White Knight; but the a-pawn is isolated, and, more over, as in the game, the c5-square may become a weak point.",
        "9. b3 d5": "very playable here would have been 9. ... Re8 followed by 10 ... Bf8, directed against White's e-pawn to keep it in restraint.",
        "10. e5 Ne8 11. f4 f5": "Otherwise 12. f5,with a strong attack.",
        "12. Be3 g6": "White's e-pawn is to be blocked; it is, however, by no means of indifferent whether this blockade is effected by Knight or Bishop. The latter would be inelastic, and its range of action small, at best as far as g4-square (should white play g4 to attack opposing pawn minority), while it would also be more attackable, e.g., by a Knight at c5,which could not the driven off. On the other hand a Knight at e6 would be not only an excellent - because unassailable - blockader, but also a very aggressive one,among other things preparing the way for g5. It is often the greatest importance to find the right blockading piece.",
        "13. Na4 Ng7 14. Qd2 Qd7": "In order to follow Rd8 as soon as possible.",
        "15. Qa5": "Combines continued pressure on the c5-square, with play against the weak isolated a-pawn. ",
        "15... Ne6 16. Rad1 Rd8 17. Nc5": "A positional mistake. White should seek to keep the Knight as a potential blockader, or at any rate only exchange him for a Knight. The situation is this: the two Knights are here the chief actors (because the most effective in blockade) and whoever gives up his proud horseman for a prelate gets in this case the worst of the bargain. 17. Bc5 was the right move.",
        "17... Bxc5 18. Bxc5 Bb7 19. Rf3 Kf7 20. Rh3 Kg7 21. Rf1 Rde8 22. Rhf3 Rad8": "Since Qxa7 is forbidden on account of 23. ... Ra8. 24. Qxb7 Reb8. There is little that white can undertake.",
        "23. Rd1 a6 24. b4 Kh8 25. Qa3 Reg8 26. Qc3 Rg7 27. Kh1 Rdg8": "Black plans g5, and in this the blockading Knight at e6 would render priceless service. A comparison between the two blockading pieces, the Black Knight at e6 and the White Bishop at c5, is here all in favour of the Knight. The Bishop, it is true, does his work as a blockader pure and simple well enough, but otherwise his effective range of action is very small.",
        "28. Be3 c5": "The Bishop's diagonal is opened by the pawn sacrifice, But it may be objected that the c5-pawn is here neither a passed pawn nor a ''candidate''. True, and yet logically he must be filled with that ambition to expand, for otherwise White would not have kept him under a blockade for so long. But now he takes vengeance for the restraint he has had to suffer.",
        "29. Rg3": "Best as given by Schlechter would be 29. bc d4 30. Rxd4 Nxd4 31. Bxd4 Bxf3 32. Bxf3 with 2 Bishop's and 2 Pawn's for 2 Rooks.",
        "29... d4 30. Qa3 g5 31. Bc4 gxf4": "31. ... Bd5 would have been good, if only to preserve the knight. ",
        "32. Bxe6": "A chess puzzle: How is Black to pursue his plan of breaking through?",
        "32... Bxg2+": "Now the Bishop runs amok! The death of the Knight makes him utterly reckless.",
        "33. Kg1": "But behold he still lives! The saucy fellow; and indeed after 33. Kxg2 (33. Rxg2? Qc6+) but 33. ... Qc6+ comes anyways 34. Kf1 fg 35. Bxg8 gh, he would have been bloodily avenged.",
        "33... Qxe6": "He who would regard Bxg2 as a bolt from a clear sky, shows thereby that he has not fully grasped the logic which lay in this sudden irruption of the Bishop, who had been kept under restraint for such ages.",
        "34. Bxf4 Bb7 35. bxc5 Qd5": "and black won.",
        "36. c6 Bxc6 37. Kf1 Rg7xg3 38. hxg3 Qg2+ 39. Ke1 Bf3 40. Qxa6 Qg1+": "Resigns."
    },
    "url": "https://gameknot.com/annotation.pl/san-sebastian-1912?gm=30146",
    "gameName": "San Sebastian 1912",
    "players": "Leonhardt  vs. Nimzowitsch ",
    "opening": "Philidor (C41), Improved Hanham variation"
}