{
    "moves": {
        "1. e4": "I begin with the king's pawn opening. Usually I find 1. d4 to be more effective, since 1. e4 can be more easily defended with c5 or c6, respectively the sicilian and karo-kann defences.",
        "1... c5": "The sicilian defence, popular for me as black.",
        "2. c3": "I move the game into the Alpin variation, seemingly just as effective as 2. Nf3, but to me c3 is preferable.",
        "2... Nf6 3. e5 Nd5 4. d4 cxd4 5. cxd4 d6 6. Nf3 Nc6 7. Bc4": "At this point I unintentionally leave the opening book lines (7. Nf3 would have continued along a branch of the Sicilian Defence, Alpin Variation) and decide to threaten Black's knight away from d5, hoping to prevent, or at least delay a dxe5, also hoping to develop my bishop and push his knight closer to the edge.",
        "7... Nb6 8. Be2": "Black moves his knight to safety as I do my bishop. With my bishop on e2, I'm more prepared to face a potential Bg4 from black, maintaining my queen's positional integrity after h3 Bxf3, Bxf3.",
        "8... dxe5 9. dxe5 Qxd1+ 10. Bxd1": "After the pawn exchange, Black is free to exchange queens. Not a problem with my bishop on e2, since now my position stays fairly solid.",
        "10... e6 11. O-O Bc5 12. b3": "Right here I play a risky, and perhaps unnecessary move. I had hoped to fianchetto my dark square bishop in an attempt to gain better control of the central squares d4 and e5. In addition, I had tried to control the squares a4 and c4 from his advancing knight on b6. On the minus side, this move endangers my a1 rook to Black's bishop and becomes my Achilles heel as we will soon see...",
        "12... Nxe5": "When Black had captured my pawn I had thought \"huh, he's endangering his knight. I must take it.\" My mind was so intent on winning a knight that I had failed to notice the importance of defending the d4 square from Black's bishop.",
        "13. Nxe5 Bd4": "And just like that, there is now nothing I can do to protect my a1 rook...",
        "14. Re1": "...so I just decide to protect my knight.",
        "14... Bxa1": "And now I'm behind by a rook and a pawn minus a knight. At this point I felt that I was going to lose no matter what, but I figured that I'd just keep playing.",
        "15. Ba3": "I thought that putting my bishop on a3 would be good for preventing my opponent's kingside castle, and could lead to an attack on his king.",
        "15... Bxe5 16. Rxe5 Nd7 17. Rg5 g6 18. Nc3 a6 19. Ne4 f6 20. Rg3": "I could've done Nd6+, but I was in no mood to exchange my aggressive knight for my opponent's bishop that had yet to be developed.",
        "20... Kf7 21. f4": "In doing this, I hope to prevent a possible e5 from messing up my plans of attacking the king.",
        "21... b5": "I believe that here was where my opponent made a critical mistake. Now, both the a7-g1 and a8-h1 diagonals are left open, and I still have my two bishops. As you will see in these next few moves, my opponent's rook has no means of escape.",
        "22. Bf3 Rb8 23. Bd6 Rb6 24. Bc7": "At this point, my opponent only has a couple of options: After moving his rook to c6, I can then land a check with Nd6+ (or Ng5+). My opponent can then capture the knight on d6 with his rook, and my bishop on c7 can recapture. Or, my opponent can simply move his king out of the way and I'd capture the rook with my f3 bishop (the less preferrable option).",
        "24... Bb7": "But instead, my opponent tries to develop his bishop, on account of the fact that it won't make a difference if he moves his rook, since his knight is guarding it.",
        "25. Bxb6 Bxe4": "Instead of recapturing right away with his knight, my opponent initiates a trade off. I can either save my bishop or recapture. I choose the latter.",
        "26. Bxe4 Nxb6 27. Rc3": "An now my rook has a lot of potential whereas his knight doesn't. Unless my opponent decides to trade rooks, I now have a tactic that may cause me to win one of the a or b pawns.",
        "27... f5 28. Rc7+ Kf6 29. Rc6 fxe4": "While creating a passed pawn on e4, my opponent also isolates his e pawns.",
        "30. Rxb6 Kf5": "I suppose that instead of protecting his a pawn, my opponent decides to keep his king playable, bypassing a possible g4 and attacking my f pawn. But really my opponent just puts his own pawns at risk, and material eventually evens out.",
        "31. Rxa6 Kxf4 32. Rxe6 Rd8 33. Rf6+": "Worried about a possible Rd1+, Kf2, Rd2+, which loses my a pawn, I need to get my rook down to where my king is.",
        "33... Ke5 34. Rf1 b4 35. Re1": "I'm just preparing for my king to jump to f2, also preventing my opponent from advancing his passed pawn.",
        "35... Rd2 36. Ra1 e3 37. a4": "I had to move my rook over and protect my pawn, but the enemy passed pawn just gets closer and closer. I decide that this is the best course of action, so that at least my a pawn isn't lost for nothing.",
        "37... bxa3 e.p. 38. Rxa3 e2 39. Kf2": "An obvious choice, since Ra1 only leads to a rook trade and promotion with Rd1.",
        "39... Ke4 40. b4": "By simply advancing the pawn, I prevent the enemy king from accessing d3. This way, no matter what, I eventually win the passed pawn.",
        "40... Rb2 41. Re3+ Kd5 42. Rxe2 Rxe2+": "That was unexpected. I had imagined that he would kill my pawn. I now have a slight advantage as his king would just go for the pawn, leaving my king closer to the other pawns.",
        "43. Kxe2 Kc4 44. h4": "Now, this was truly my worst error (besides 13. Nxe5 obviously). Before this move, I actually had a won position (you can plug the position before this into a chess engine to make sure), even though I hadn't realized it. The best move would have simply been to go after the enemy pawns. Doing this, I relinquish my pawns' ability to support each other and jump forward two squares. Even if the enemy king went for my pawns, I could have simply played h3 or g3 and my opponent would only get away with one pawn, leaving my other pawn to move up and join my king after I had killed his two pawns. After this move the position was drawn. Well, I guess I learned my lesson.",
        "44... Kxb4 45. g4 Kc5 46. Ke3 Kd5 47. Kf4 Ke6 48. h5 Kf6 49. g5+ Kg7 50. Kg4 h6 51. hxg6": "By now, as you can see, it's impossible for either player to win. The game eventually went ... Kxg6, gxh6, Kxh6, draw. This game just goes to show that one wrong move, although seemingly harmless, affects the whole game. I was actually quite disappointed with the outcome despite my comeback. But overall, this game was pretty interesting. I hope you enjoyed looking this over. And please, don't hesitate to leave me comments. Until next time, this is thechosen0ne.",
        "51... Kxg6 52. gxh6 Kxh6": ""
    },
    "url": "https://gameknot.com/annotation.pl/san_dins-mini-tournament?gm=20827",
    "gameName": "san_din's mini-tournament",
    "players": "thechosen0ne (1556) vs. onofre (1437)",
    "opening": "Sicilian (B22), 2.c3, Heidenfeld variation"
}