{
    "moves": {
        "1. e4": "Standard.",
        "1... e5": "The King's Pawn Game.  Of course, this is going to turn into the Ruy Lopez.",
        "2. Nf3 Nc6 3. Bb5 a6": "? Now, she decides to kick my LSB, but that does not bother because I will just exchange.  In fact, this is a mistake as I will win a free pawn, after this exchange.     ",
        "4. Bxc6 dxc6 5. Nxe5 Be6": "To me, this is a waste of time.  I understand that she wanted to develop, but she cannot do this Queenside, without bringing her Queen out too early.  However, I do not care because I am going to continue by castling Kingside.",
        "6. O-O Bd6": "She takes advantage by kicking my Knight.  Of course this is not going to achieve because I will move to a safe square.",
        "7. Nf3 Bf4": "I do not know why she played this, but it does not bother because I am just going to continue with development.",
        "8. Nc3 Bc4": "Because she Kicks my Rook, I am just going to protect it.  Therefore, I feel that she is still wasting time.  Instead, black already should have played ...Nf3, so that she could castle.",
        "9. Re1 b5": "I do not know why she played this.",
        "10. b3": "Because she decided to attack my pieces, I kick back.",
        "10... Be6 11. Bb2": "Now, I decide to fianchetto my DSB.  Of course, I am planning to finish development and connect my rooks, at some point.",
        "11... Nf6": "She also wants to develop and castle Kingside.  As I had mentioned a couple of moves ago, she should have done this, earlier, but it is not too late.",
        "12. d3": "?! In this position, I am just trying to protect my e4 pawn.  A second look proves that this pawn was not hanging, due to my c3 Knight, so this was a waste of time.  At this point, however, I am starting to get distracted by Hurricane Sandy, as it is already beginning to cause damage in the Caribbean and expected to make a sharp turn into the Northeast.  However, this is just the beginning of things to come and the distractions are only going to get worse with no way out of, this one, as Hurricane Sandy bears closer to the Northeast and produces more damage.   ",
        "12... Bd6": "I don't know why she moved there.",
        "13. e5": "The distraction is temporarily over, as I decide to fork her DSB and Knight.  However, that is soon going to change, and the distractions are going to get much worse and eventually lead to a loosing blunder.",
        "13... Bb4": "Because she retreats her bishop, I am going to take her Knight, without hesitating.  Therefore, I will trade her Knight, for my e5 pawn.",
        "14. exf6 Qxf6 15. Ne4": "?? Now, this is where I really start to go wrong.  I decide to kick her Queen, but I overlooked an important detail.  What was it?  In this position, I left my DSB hanging, and she is now going to win it, with the same piece that is attacked (her Queen).  Why did I miss so much?  At this point, Hurricane Sandy has devastated the Carribean Island and is now working on the Bahaman Islands.  There have already been fatalities in Haiti, as well as other areas.  If you think this is bad, it's not the other half.  After the Bahama's the Hurricane is directly going to the Northeast, and this storm is already several hundred miles wide.  ",
        "15... Qxb2 16. Neg5": "Now, I decide to fork her LSB and f7 pawn.  As cedeburca once mentioned, I am only interested in Knight forks, even though there is a lot more to chess, then just that.  Note: I am trying my best, for someone who is not at his best.  Of course, this is not going to stop her from castling Kingside, eventhough, she should have done it earlier.",
        "16... O-O 17. Nxe6": "This fork, however, happens to work out because I am going to win an extra pawn, after this exchange.",
        "17... fxe6 18. Rxe6 Rae8": "? Now, she decides to finish her development and connect her Rooks.  However, this is not a good move.  Instead, 18...Rc8 was best because I am now going to win a free pawn.  Having said that, the distractions caused by Sandy are not nearly as bad as that of Irene.  Why?  With Tropical Storm Irene, I would not have seen these types of opportunities.  Instead, I would have blundered and lost material by doing something like forking her DSB and Queen with 18...c3. ",
        "19. Rxc6 Rec8": "? Once, again, I do not what she is thinking, in this position, but this looses another pawn, for black.",
        "20. Rxa6 c6": "I don't know why she played this.",
        "21. Qb1": "This just wastes time and development.  In this position, my only goal is to knock the Queens, off the board, but she is not going to accept this exchange because she is behind.  Instead, she is going to retreat and protect the Queen and this is the right choice because of what I mentioned in my last sentence.  Therefore, 21.Qe2 was best as it is the final step to finishing development and connecting my rooks.  At this point, however, Hurricane Sandy just devastated the Bahamas.  It has already destroyed some of the islands and has caused more then 40 fatalities and hundreds of injuries.  Furthermore, this storm is still headed on the same path, toward the Northeast.  If that is not bad enough, this storm is already 900 miles long, the largest atlantic hurricane, in recorded history.  In addition, the pressure is very low, which makes Sandy more dangerous.  While some of this information might seem irrelevant, it has everything to do with my performance, in this game.",
        "21... Qf6 22. c4": "?? My goal is to exchange her pawns, but she is behind.  Therefore, she is not going to just accept this exchange.  Instead, she is going to respond with an important move.  Consequently, this is a serious blunder as it is going to loose my rook.  Of course, I am still thinking about and am overwhelmed by this Hurricane.  If that is not bad enough, I am not the only one, who is overwhelmed by the storm.  I work at a retail store, and we are running out of flashlights and D batteries.  Afterall, all of my customers are buying supplies because we know that it is only a matter of time before this storm produces a lot of damage, so we are prepared.  ",
        "22... Bc3": " ",
        "23. cxb5 Bxa1 24. b6": "In this position, I know that I cannot take back, due to her Queen.  Therefore, my goal is a promotion, of some sort.  Either a Queen, or an underpromotion.  What would the underpromotion be?  A rook, to replace the rook, that I had lost.  Of course, I am not surprised with the fact that my opponent will not allow this.  In chess, just like regular life, you always have to prepare for the unexpected, and you cannot rely on him or her to make a mistake.",
        "24... Rcb8": "Therefore, she decides to threaten my Rook, but I do not care because I am not going to move my Rook.",
        "25. d4": "Instead, I am just going to play mind games with her, and I am not going for any tricks or cheapos.  Therefore, why am I playing these games?  To alleviate my fears, associated with Hurricane Sandy.  Of course she is not going to accept this game because I am going to loose that pawn.  On the other hand, the main part of my goal worked because I am not quite as nervous, about this storm?  Why?  Now, I am going to use some of those mind games, to prepare for the worst, instead of panicking.  I am also going to associate it for preparations, thinking about what I have to do, before I loose power.",
        "25... Bxd4": "After she takes, I am just going to take back.  However, this is not going to win back material, as we will see shortly.",
        "26. Nxd4 Qxd4 27. Kf1": "?? In this position, I am worried that she will mate, unless I move my King.  However, this is the loosing blunder.  Instead, I should have moved my Queen to the second rank, as that would have saved the game.  Now, it is mate, 27...Qxf2#.  Of course, I am not thinking because Sandy is very close to the Northeast.  In fact, landfall is expected in less then a week.",
        "27... Qxf2#": "Sandy made landfall, four days after this game and became a superstorm.  I lost power and phone service for 8-9 days and cable for 2 weeks.  If that was not bad enough, a tree fell at the bottom of my street, so I was semi stranded for 1-2 days because no cars could get in or out for that amount of time.  In addition this storm also destroyed my neighbors car and caused a fire, at the bottom of my street.  Despite all of that, there were no injuries or fatalities in my family.  In addition, my house was not destroyed.  That was lucky because there were, at least, 180 fatalities and $53 billion in damage, due to Sandy.  It was the second most destructive hurricane, on record.  Moreover, I played better chess, prior to this storm, then that of Tropical Storm Irene, and Irene wasn't nearly, as bad as, Sandy.  With Irene, we also lost power but it only lasted for 3 days.  Then, things went back to normal.  With Sandy, I got a little nervous and distracted.  Therefore, I lost a few games, and my rating plummited by about 50 points.  Despite all of that, however, I was able to win between 3-5 games in a row.  With Irene, however, I got much more nervous and it caused to play horrible chess.  In fact, I skipped all of the basics, with Irene.  For example,there where a couple of games, where I brought me Queen out, by move 2, and lost in four moves.  When you count that, it was even worse then my mistep against blitzkov.  As a result, my rating plummited to 851.  That was my lowest rating, ever.  With this storm, however, I lost most of my games, due to some bad choices, like this game.  And, there were a couple of games where I violated some General Opening Principles, but I certainly did not skip all of the basics, like that of Irene.  That is because I was less nervous with Superstorm Sandy, then Tropical Storm Irene.  If you know that a bad storm is coming, you want to prepare, as much as, you can.  On the other hand, you do not want to get nervous, as that can only make things worse.  The same thing happens in chess.  If you are playing chess and have this situation, you want to prepare for the worst.  It is, however, not a good idea to fret over it, in a game.  Otherwise, you will not play as well.  That's the moral of this story.     "
    },
    "url": "https://gameknot.com/annotation.pl/sandy-v-chess?gm=47704",
    "gameName": "Sandy V. Chess",
    "players": "jkarp (1102) vs. checkmatecaptain (968)",
    "opening": "Ruy Lopez (C68), exchange, Alekhine variation"
}