{
    "moves": {
        "1. e4 d5 2. exd5 Qxd5 3. Nc3 Qe5+ 4. Qe2": "Standard Scandinavian moves. This white move is a good way for white to avoid the more seen lines, and I had my problems with it. ",
        "4... Qxe2+": "The exchange is, IMO, the best option, since the standard plan, Nc6 (hoping for developement after QxQ, NxQ) fails to Nb5.",
        "5. Ngxe2": "Better is Bxe2. This move heavily delays white's developement. ",
        "5... c6": "Necessary to avoid Nb5. Bd7 doesn't work on account of the fact that, sooner of later, the knight will develop on c6, renewing the threat of Nb5.",
        "6. h3": "A loss of time, of course. d4 is much more interesting for white. ",
        "6... Bf5 7. d3 e5": "Another scheme is e6.",
        "8. Ng3 Be6": "or Bg6, but there it bits granite. ",
        "9. a3": "This makes more sense. Bb4 is a possible move for black. ",
        "9... Nd7 10. Be3 Bc5": "By exchanging my bishop for the white's one, I get the advantage because his lsb has no action right now. ",
        "11. Bxc5 Nxc5 12. Nge4 Nxe4": "Why not? After this, we are equal in developement. ",
        "13. Nxe4 O-O-O": "If Nc5, Bf5, just to save it. ",
        "14. O-O-O Ne7": "I missed Bd5, but it was not a great threat after Be2.",
        "15. Kb1": "Not necessary. But I cannot find a plan to attack. ",
        "15... f6": "If f5, Ng5 is ok for white, and if Bd5, white can hit it with c4. ",
        "16. g4 h6": "One never knows. ",
        "17. Bg2": "NOW the white's lsb plays. So I went for it. ",
        "17... Ng6 18. Rde1": "Another loss of tempo. And I still can get the most of it. ",
        "18... Nh4": "Better than Nf4, because the bishop cannot go to f3. ",
        "19. Bf1 Nf3": "A blunder. ",
        "20. Re3 Ng5": "Returned tempoes. ",
        "21. Nc3": "Interesting, but NxN is not bad. ",
        "21... Rd4": "Trying to \"do something\". Just it. ",
        "22. f3": "Providing me with a target. ",
        "22... Rf4": "Another bad move. Too soon. And the rook can be trapped. ",
        "23. Bg2 Bd5": "I offered the bishop because anyway Ne2 will have kicked my rook. ",
        "24. Ne4": "Interesting! If NxB, cxN provides me with a strong center (and the rook is untouchable). ",
        "24... Bxe4": "I felt the knight was playing more than the bishop, but I'm not sure at all, since white has h4. ",
        "25. dxe4": "The rook is trapped, but nobody can kick it out of this square. ",
        "25... Rd8 26. Rd3": "A blunder by white. Interesting was h4, Rd2...",
        "26... Rxd3": "I took my chanche, finally, to get some advantage. ",
        "27. cxd3 Nxf3": "Rf1 is not possible because of Nd2+.",
        "28. Bxf3 Rxf3": "Correctly exchanging the almost useless bishop? Not sure...",
        "29. Kc2": "Ok, I have a pawn, but that's all. :-(",
        "29... Kd7 30. Kc3 c5": "Building tension against d3.",
        "31. b4 Kc6 32. h4": "Wise. ",
        "32... Kb5": "Forcing an exchange, with my king right into the game...",
        "33. bxc5 Kxc5 34. g5": "Smart? I can get another pawn, but I will have mine scrambled. Anyway, better than my \"wonderful\" idea. ",
        "34... Rg3": "?? A big blunder. ",
        "35. gxf6 gxf6 36. h5": "White wants to prepare Rf1 avoiding my rook to go to g6, but it was a mistake, since he should have waited for my rook to go there. White has a good spot on f6, but he doesn't want to exchange it for the h pawn. Should it be preferred?",
        "36... Kd6": "My king has to help defending f6 (sigh!). If Rf3, Rb1.",
        "37. a4": "Why not? I can't do much. Again.",
        "37... b6 38. Kc4": "Now his king is in a good spot. ",
        "38... Rg4": "? Trying to prevent d4, but other plans are equally... bad. Rg5 \"blocks\" his rook, but allows d4... I don't know!",
        "39. Rh3": "Naturally.",
        "39... Ke6": "I will try to get more chances via f5.",
        "40. Kb5": "Oh, yes, I know...",
        "40... f5 41. exf5+ Kxf5": "Now my rook is much more active where it is. ",
        "42. a5 bxa5 43. Kxa5 Rd4 44. Rf3+ Rf4 45. Rh3 Kg4": "What else? Otherwise, a repeated position would have been possible. ",
        "46. Re3 Rf5 47. Re4+": "Almost a resignation, but white cannot defend h5. Ka3 was called for. ",
        "47... Kxh5 48. Ka6 Kg5": "I cannot allow Rxe4+. I think that the pawn will have time to become dangerous. ",
        "49. Kxa7 h5 50. Kb6 h4 51. Kc5 h3 52. Kd5 h2 53. Re1": "Ok, here it is. ",
        "53... Kh4 54. Ke4 Rf8": "Kxe5, Re8+, of course. But he was smart. ",
        "55. Rh1 Kg3 56. Kxe5": "Do you see how I have lost my pawns? Compliments!:-(",
        "56... Kg2 57. Rd1 Rf1 58. Rd2+ Rf2 59. Rd1": "So I had to avoid repetitions. How?",
        "59... h1=Q": "Not without fear. Drawn could have been a shameful result. ",
        "60. Rxh1 Kxh1": "Now: can black win this?",
        "61. d4 Re2+ 62. Kd6 Kg2 63. d5 Kf3 64. Kd7 Ke4 65. d6 Ke5 66. Ke7 Kd5+ 67. Kd7 Re6": "Yes. But I am still not sure. Well played, okima, even if you lost. Just a couple of mistakes, not more than me. "
    },
    "url": "https://gameknot.com/annotation.pl/saved-on-the-last-chance?gm=41395",
    "gameName": "Saved on the last chance...",
    "players": "okima  vs. damalfi ",
    "opening": "Scandinavian defence, Lasker variation (B01)"
}