{
    "moves": {
        "1. e4": "Interesting endgame (I believe)",
        "1... d5 2. exd5": "Scandinavian gambit accepted",
        "2... Nf6": "I've begin to use this line for short. I usually plaid c6. This line is more common and has been plaid by great players (Alekhine, for example), so that it's easier to find games in various DB (easier for white as well...)",
        "3. c4 e6 4. Nc3 exd5": "We are not far away from a benoni",
        "5. cxd5": "trading",
        "5... Nxd5": "White has now an isolated pawn on d file.",
        "6. Qf3": "White doesn't want to carry on trading",
        "6... Nb4": "Fork attack menace...  Not sure it is a good move, for black doesn't develop in so doing.",
        "7. Qe4+ Qe7 8. Kd1": "White cannot castle. A little advantage for black.",
        "8... Qxe4": "I do not really have choice.",
        "9. Nxe4 Bf5": "Black's plan is to settle in the center and attack the weak d pawn.",
        "10. f3": "White is right not to abandon the center. Furthermore, if black trades by playing 10. ... BXe4 11. fXe4, white will have two pawns which can protect each other on e and d files.",
        "10... Nd7": "So that if 11. Bb4, 11. ... c6 and white has to drawback",
        "11. a3": "Logical move",
        "11... Nd5": "Not a bad place for the knight but it is unprotected and subject to attack. Anyway, black had little choice.",
        "12. Bc4": "White develops and get menacing.",
        "12... c6": "Black do not want to remove the knight, which is probably a mistake, for in case of a trade.\n13. Bxd5 cxd5, black will have an isolated pawn on the d file.",
        "13. Ne2": "Black doesn't trade on d5, prefering to develop.",
        "13... Be7": "Preparing the short castle which seems safer",
        "14. Ne2c3": "Ennoying for black who doesn't want to trade, for an exchange of knight would enable white to play dxc3 and considerably improve his pawn structure.",
        "14... Be6": "Only solution as black doen't want to trade his knight or to retreat the d knight.",
        "15. d3 h6": "To prevent 16. Bg5 or 16. Ng5",
        "16. g4 O-O": "Black can finally castle short",
        "17. Ba2": "White opts for a retreat.",
        "17... Rfe8": "Now, black's developpement is almost completed.\nMaterial equality, no immediate threats, white has a better control on the center, the white king is less safe than the black one, black has a rook on the open file but not the entire control on it, black's pawn structure is better, white is less developped (rook on a1 and bishop on c2) but controls more terrain and the white pawn on the kingside will soon be ennoying for black. Conclusion : a little advantage for black.",
        "18. h4": "The kingside will soon be under white's attack.",
        "18... Ne5": "Bringing reinforcements on the kingside and occupaing the center and menacing the d pawn..",
        "19. Ke2": "To defend the d pawn.",
        "19... Rad8": "Menacing the center.",
        "20. g5": "The hostilities begin on the kingside",
        "20... hxg5": "Black had little choice",
        "21. hxg5 Nxc3+": "To menace d3 with the rook and the LSB in a 2 with black's LSB.",
        "22. bxc3 Bxa2": "The ^LSB was too dangerous, for the f pawn might be needed to protect the black king.",
        "23. Rxa2": "White has little other choice",
        "23... Nxd3": "Now white's pawn structure is almost totally destroyed.",
        "24. Be3 Bc5": "With one pawn in advance and a better pawn structure, the trade is in black's favour.",
        "25. Rd2": "But white doesn't trade.",
        "25... Bxe3": "Black wants to trade",
        "26. Kxe3 Ne5": "Menacing 26. ... Kc4+ and the white's rook is doomed.",
        "27. Rd4": "White sees the danger but doesn't want to leave the open file.",
        "27... Rxd4": "Now black's plan is to trade as much as possible to take profit of his pawn superiority during the games end.",
        "28. cxd4 Nc4+": "Fork attack to get the pawn?.",
        "29. Kd3 Nxa3": "Mistake, this pawn was isolated, not dangerous and black will trade it against a good pawn but black oversaw the next move.",
        "30. Nd6": "Black expected 30. Ra1 Nb5, protecting the a pawn but this moves prevents it. The a pawn is condemned.",
        "30... Re7": "To stay on the open file and protect the b pawn.",
        "31. Ra1 Rd7": "Trading the knight.",
        "32. Rxa3": "White accepts the knight trade for he wins a pawn.",
        "32... Rxd6 33. Rxa7": "Black has still an advantage for he has one more pawn but the white king has a central position and the black pawns are further from the paradise.",
        "33... b5": "This is the black's passed pawn. It has to advance.",
        "34. Rc7": "The position is very ennoying for black. If 34. ... f6. 35.g6 and there is a mate menace by 36. Rc8. If 34. ... g6, the black king will be blocked on g7.",
        "34... f5": "The only move black saw to free the king from his corner.",
        "35. gxf6 e.p. Rxf6": "Menacing the f pawn and still protecting the c one",
        "36. Ke4": "A good idea to bring the king on the center at endgame.",
        "36... Kh7": "Now the black king can leave his corner.",
        "37. f4 Kh6 38. Ke5 Kg6": "Fruitless move but I do not see what else black could have plaid.",
        "39. Rd7": "Black will have to trade white's d pawn against black c pawn.",
        "39... Kh6": "Black had no other idea, for it seemed fruitless to attack the white king by 39. ... Rf5+ 40. Ke4 Rf3 ",
        "40. f5 Kh7": "Black is blocked.",
        "41. d5 cxd5": "No choice for black",
        "42. Rxd5 Rb6": "Last chance to bring a pawn to queen. The problem is that the white king dwells in between the black king and the b pawn.",
        "43. Rd3": "Good move, white has 2 possible options : Rh3 or Rb3",
        "43... b4": "If black can force the white king to come near the b file, eventually trading the rooks and the pawn, the black king would take  the f pawn and the g pawn could go for the transformation in super hero.",
        "44. Rh3+ Kg8": "No choice and ennoying.",
        "45. Rb3 Kf7": "No othe solution but white has more options than black whose king is still blocked in the corner.",
        "46. Ke4 Kf6 47. Kf4 Rb5 48. Kg4 Ke5": "Black's plan changes : 1. Bring the king on c4 to oblige the white rook to leave and 2. advance the b pawn. The white king will probably go ahead to eliminate the g pawn but it will be to late.",
        "49. Kg5 Kd4 50. Kg6 Kc4 51. Rf3 b3": "The black pawn is one tempo ahead than the white one",
        "52. Kxg7 b2": "Black is still in advance",
        "53. Rf1": "Obvious move",
        "53... b1=Q": "Mistake, better would have been 53. ... Rxf5  54. Rxf5 e1 although it would have been difficult (impossible ?) for black to have won with a queen against a rook.",
        "54. Rxb1 Rxb1 55. f6": "Black cannot prevent white to come on f8 except by sacrifying his rook.",
        "55... Rg1+ 56. Kh8 Rf1 57. Kg7 Rg1+ 58. Kh8 Rh1+": "White offers a draw. Accepted."
    },
    "url": "https://gameknot.com/annotation.pl/scandinavian-gambit-d?gm=49041",
    "gameName": "Scandinavian gambit. (D)",
    "players": "carlo19711130 (1673) vs. ptitroque (1694)",
    "opening": "Scandinavian (B01), Icelandic gambit"
}