{
    "moves": {
        "1. e4": "A thematic but nice sacrifice. ",
        "1... d5 2. exd5 Qxd5 3. Nc3 Qe5+ 4. Be2 c6 5. d4 Qa5 6. Nf3 Bf5 7. Bd3 e6 8. O-O Bg6": "It seems a loss of time, but the bishop would have to retire sooner or later, since the queen will soon retire to c7 (or, if white plays the good one, Bf4, to b6). ",
        "9. a3 Bd6": "Well, the crucial black diagonal is mine.",
        "10. Bxg6": "You see, a doubled pawn is not an advantage when the rook is aiming at your king...",
        "10... hxg6 11. Ne4 Qc7": "I could have saved the bishop, but it forced me to more time losses. ",
        "12. Nxd6+ Qxd6 13. g3": "Here I have my tempo back. ",
        "13... Nd7 14. Bf4 Qd5": "Ok, now the plan for white is c4, and try to press d5, or at least c5, in order to block my action. So I thought Qd3 or someting like that. ",
        "15. Re1": "This one is ok too, but I know this variation, and it cames too late. ",
        "15... O-O-O": "Without fear...",
        "16. b3": "As normal, trying inmediately to attack my weak queenside.",
        "16... Ngf6 17. Ng5": "White follows different plans, instead to concentrate to a more positional reinforcement. With c4, my game would have been difficult. This is a thematic threat. But...",
        "17... Rxh2": "Surprise. Now, if KxR, Rh1+ is mortal. Nh3 (the only one), Qf5... and if g5, Nxg5+.",
        "18. f3": "This one is ok, probably the best. But: \n19. ..., Rdh1, \nIf 20. Nxf7, Rh1+\nUnique: 21. Kf2, R8h2+\nUnique: 22. Ke3, RxR\nIf 23. QxR, e5.\nNow white can answer 24. Nxe5*, in order to save the Knight and avoid Qxd4#. 24. ..., NxN.\nIt seems normal to play d4xe5, but: Qc5+\nUnique: 25. Kd3, Qxc2+, \nIf 26. Ke3, Nf5+, 26. Kd4 (unique), c5+ 27. KxN (unique), Qd3+, 28. Kxc5 (or mate), Rc2+, 29. Kb4 (unique), Qd4+ and mate the next one. \nIf. 26. Kd4, c5+, 27. Kd3 (unique) and Nd5#. \n\nIf I were able to see all this without the analyzer' help...\n\nAnyway, not ALL white answers are forced, so this is mere speculation. Anyway, it's a real mate net. \n* If white takes the pawn with his one, the thematic mate is the same. Or, there is another very nice mate with this line: \n\n22. ..., e5, \n23.\td4-e5\t,       Nxe5\n24.\tBxe5, \td5-c5+\n25.\tKf4 (forced, since Kd3 leads to mate as in the other line), \tNd5+\n26.\tKg4 (forced, since Ke4, Qxc2+, then Rd2+. And if Kg5, Qe7+, Kg4, Qe6+, Kg5, Qf5#)\td5-e3+\n27.\tKg5 (or exchanges the queen for a knight, in one of two ways)\tQe7+\n28.\tKxg6 (not forced, but otherwise loses the queen for a knight...) Qe6+\n29.\tKxg7 (not forced, but if Kg5, Qf5#...) Nf5+\n30.\tKf8 (not forced, but Kg8, Qe8#...)\t  Rh7\n31.\tNg5 (not forced, but... can white save himself?)\t  Qe7+\n32.\tKg8\tNh6#\n... but who will like such a position, even being 4 material points up?\n\nSo, nice position, isn't it? I like Lasker's scandinavian...",
        "18... Rdh8 19. Nxf7 Rh2h1+ 20. Kf2 Rh8h2+ 21. Ke3 Rxe1+ 22. Qxe1 e5": "I have to prevent the horrible Nd6+, anyway.",
        "23. Nxe5 Nxe5 24. Bxe5 Rxc2": "Now is the moment",
        "25. Qb4 c5": "Another good tactis. BUT he resigned, and I am not sure I would have won. Probably yes, since if 26. Qa4, b5, 27. Qxa7 (Qxb5, c5xd4+ and loses the queen), c5xd4+, and if 28. Kd6, Qf5+, 29. Ke6 (forced), Nd5#.\nI must admit I was very lucky, but also a good performance with my favorite defence..."
    },
    "url": "https://gameknot.com/annotation.pl/scand-with-5-d4-but-sac-wins?gm=22547",
    "gameName": "Scand with 5.d4, but sac wins",
    "players": "homunculi (1644) vs. damalfi (1705)",
    "opening": "Scandinavian defence, Lasker variation (B01)"
}