{
    "moves": {
        "1. e4": "A nice demonstration of the attacking possibilities in this under-rated defence.",
        "1... e5": "This used to be my main defence to the king-pawn, but 300 years of praxis in some lines means they feel a bit played out in correspondence.",
        "2. Nf3 Nc6 3. Bb5 f5": "I actually think this is sound having analysed it, and this is what I would play OTB were I to take up 1...e5 again although I have lost every game I've played with it on here bar this one!",
        "4. d3": "4. Nc3 is the main line and after 4...fe 5. Nxe4 d5 6. Nxe5 de 7. Nxc6 Qg5 8.Qe2 Nf6 9.f4 (9.Nxa7!?)Qxf4, 10. Ne5  and 10. Nxa7  are horribly theoretical. With 4. d3 white aims for a risk-free advantage. Some on chesspublishing.com go as far to claim this is a refutation.",
        "4... fxe4 5. dxe4 Nf6 6. Bg5": "6.Nc3 or 6.Qd3 are more usual. The positional features remain though: white has control of d5 in return for a half-open f-file with black having pressure against f2.",
        "6... Bc5": "More pressure against f2",
        "7. Bxc6": "I am not sure about this: It's musch easier for Black to develop his light-squared bishop after this. In the long-term I woould have dropped this bishop back to the a2-g8 diagonal. 7.Nc3 would have been my choice followed by castling and then thinking about where to put my queen and light-squared bishop.",
        "7... bxc6": "7...dc was not in question.",
        "8. Nxe5": "This is a mistake. After 8. Nc3 I think Black is better, but it's still \"in the mix\"",
        "8... Bxf2+": "Winning material based on a neat tactic.",
        "9. Kxf2": "9.Kf1 is met by 9...O-O with multiple threats.",
        "9... Nxe4+ 10. Ke1 Qxg5": "Black gets a lead in development in addition to his lead in material.",
        "11. Ng4": "I wasn't sure about this, expecting 11.Nd3 but after castling or 11...Ba6, Black is for choice.",
        "11... O-O": "Yet more pressure on f2",
        "12. Qe2": "The only way to stop ...Nf2 winning more material.",
        "12... Ba6": "A deflective sacrifice and certainly the most spectacular way to win. 12...Qc1  was also good.",
        "13. Qxa6 Qc1+ 14. Ke2 Qxc2+ 15. Ke3 Rae8": "White is powerless to avoid either substantial material loss or his king being mated."
    },
    "url": "https://gameknot.com/annotation.pl/schliemann-spectacular?gm=14964",
    "gameName": "Schliemann Spectacular",
    "players": "lord_j (1667) vs. richard_pitts (1919)",
    "opening": "Ruy Lopez (C63), Schliemann defence"
}