{
    "moves": {
        "1. e4": "I start out with e4. Very common\n",
        "1... e5": "They respond with the same\n",
        "2. Nf3": "Nf3, another common move.\n",
        "2... Nc6": "Nc6, another regular move in the King's pawn opening.\n",
        "3. d4": "This move is more unusual, but compared with The King's pawn opening, it is better, and compared to the King's Pawn Game, it is about the same, except with a higher draw rate.  \n",
        "3... exd4": "... And he captures.\n",
        "4. Nxd4": "I was debating on whether I should do Scotch Gambit, or Scotch game, but I decided to Go with Scotch Game, as it has a higher win rate.\n",
        "4... Nxd4": "Obviously.\n",
        "5. Qxd4": "And Queen captures back, while indirectly pinning down the darksworn bishop. ( Bishop Moves away, Qxg7 ) Usually, you should develop your Queen last, though.\n",
        "5... d6": "Very Common response, but Nf6 is better.\n",
        "6. Bc4": "Developing.",
        "6... Nf6": "Now, he does Nf6.",
        "7. Bg5": "I dunno why I chose that move. I guess I just favor pinning down knights.",
        "7... Be7": "Nobody likes pinned knights, though.",
        "8. Nc3": "Nearly fully developed, now.",
        "8... O-O": "Of course. He castles. My opponent has a pretty bad position right now.",
        "9. O-O-O": "I like Queenside better than Kingside.",
        "9... Ne8": "... But I like my Bishop! :(",
        "10. Bxe7": "Moving back would have been kinda useless...",
        "10... Qxe7": "Queen Recaptures.",
        "11. Nd5": "Threatening the Queen.",
        "11... Qe5": "Of course. You try to exchange instead of giving up your Queen. He just blundered away your bishop, by the way. A better move would have been Qd8. Note that my opponent made this move very hastily.",
        "12. Qxe5": "Still think he did a dumb move, though.",
        "12... dxe5 13. Ne7+": "They Take back, Then I play Ne7+! He will have a horrible game now.",
        "13... Kh8 14. Rd8": "Now he'll definitely lose his bishop. He offered a draw, but I declined.",
        "14... g6": "Just to let the king have some space, because there is nothing else he can do for the bishop.",
        "15. Nxc8": "Decided not to exchange rooks.",
        "15... Kg7": "He probably didn't want to be smothered into one corner, and/or he might of been afraid of the possible attack with Bf7.",
        "16. Rhd1": "Bringing out my other rook and gaining 2 rooks on one file/ doubling up my rooks.",
        "16... Nf6": "Now he wants to exchange!? That was a pretty decent move, though.",
        "17. Rxf8 Kxf8 18. Rd8+": "We both took, and I check now. It was either this, lose a pawn, or lose a knight.",
        "18... Kg7 19. f3": "No taking my pawn!",
        "19... a5": "Now he'll start moving the h and a pawn up.",
        "20. g4": "Stopping H pawn from trying to advance.",
        "20... a4": "I really think there was a better move here, but, oh well.",
        "21. g5 Nh5": "Threaten knight, knight moves away, becomes isolated. Ng8 wouldn't have been any better.",
        "22. h4": "Protect my pawns.",
        "22... c6": "Seriously, I was kinda expecting Nf4.",
        "23. b4": "Trying to avoid backing up my bishop.",
        "23... b5": "Still need to move back...",
        "24. Bf1 Ng3": "Attack on bishop.",
        "25. Bh3 Ne2+": "I hate this Knight.",
        "26. Kd2 Nf4": "Attacking the Bishop Again.",
        "27. Bd7 Ne6 28. Bxe6 fxe6": "Simple exchange, though some rank bishop higher than knight.",
        "29. Rd7+ Kf8 30. Nd6": "Finally freed the rook and the Knight.",
        "30... a3": "Advancement.",
        "31. Rxh7": "Extra pieces, and Black also has to worry about the possible rook skewer.",
        "31... Kg8 32. Re7": "Threatening Pawn. ",
        "32... Rf8": "He does the same.",
        "33. Rxe6 Rxf3": "Pawn's taken.",
        "34. Rxg6+ Kh7 35. h5": "Scored two extra pawns already.",
        "35... Rf2+ 36. Kc3": "Pawns are the key point in the middle-end and the end game.",
        "36... Re2": "Threaten some more pawns.",
        "37. Rh6+ Kg7 38. Ne8+ Kf7": "They'll get a pawn back, now.",
        "39. Nf6 Rxe4 40. Rh7+ Ke6 41. h6": "Trying for promotion.",
        "41... Rc4+ 42. Kb3": "Now I start Threatening his A pawn.",
        "42... c5": "A adequate move.",
        "43. bxc5 Rxc5 44. Kxa3 Rxc2": "Only a pawn and a knight up after that. I thought it would be more, but at least Black will have a harder time winning.",
        "45. Nh5": "I could have done Kb4, but I decided to try to advance my pawns further.",
        "45... Rg2 46. Rg7 Kf5": "Attacking pawn on G file now.",
        "47. h7": "h7!! Black is dead.",
        "47... e4": "Trying to advance his pawn in hopes he can get there before my promoted pawn gets to it.",
        "48. h8=Q": "Yay! Promotion. ",
        "48... e3 49. Qe8 e2 50. Rf7+": "Now onto Checking.",
        "50... Kg6 51. Re7+": "Black is inevitable lost.",
        "51... Kxg5 52. Rxe2 Rxe2 53. Qxe2": "Got the pawn, and the endgame officially starts. ",
        "53... Kf5 54. Qxb5+": "All pawns down, the best he can do is stalemate now.",
        "54... Kg6 55. Kb4 Kf7 56. a4 Ke7 57. a5 Kd8 58. a6 Kc8 59. a7 Kc7": "Absolutely hopeless of even a stalemate, now. ",
        "60. a8=Q": "You know, my opponent offered a draw here. Well, promoting again. The a and h file pawns are probably the easiest to promote.",
        "60... Kd6": "Only one place to go.",
        "61. Qac6+ Ke7 62. Qe5+ Kf7 63. Qg7#": "And with that, the game is won. Good thing, too, because I was 2 minutes away from timing out. I wonder if there was a quicker checkmate... Well, if you find one, tell me!"
    },
    "url": "https://gameknot.com/annotation.pl/scotch-game?gm=45114",
    "gameName": "Scotch Game",
    "players": "Me!  vs. Anon. ",
    "opening": "Scotch (C45), Ghulam Kassim variation"
}