{
    "moves": {
        "1. e4 e5 2. Nf3 f5": "What the heck?  I had to look this up.  It's called the Latvian Gambit.  It's \"supposed\" to be an aggressive but weak opening.  I decide to attack.",
        "3. Bc4 f4 4. Nxe5 Qf6 5. d4 Nh6 6. Nc3 c6 7. a3 d6 8. Nf3 Bg4 9. h3 Bxf3 10. Qxf3": "I'm a point up, and I have fairly solid deployment in the center.",
        "10... g5": "He's solidifying his hold on my kingside, so I make a mental note that I plan to castle queenside eventually.",
        "11. d5": "I wanted him to take the pawn so I could play 12.Nxd5, attacking his queen.",
        "11... Nd7 12. Bd2": "Final prep to castle",
        "12... Ne5": "Forking my queen and bishop.",
        "13. Qh5+ Nhf7 14. Bb3": "I have started getting into the habit of never offering trades unless I really have to, or if I feel it will clear away unwanted clutter.  I in this case, I think my white bishop is much too important.",
        "14... Bg7": "He's getting ready to finally castle.  At the same time he's fortifying the a1-h8 diagonal.  All his pieces are arranged along it.  Perhaps I can flank them and sneak up the other side?",
        "15. dxc6 bxc6 16. Ba4": "Pinning the pawn.",
        "16... Kd7 17. Nd5 Qg6 18. Qe2": "No trading queens.  If I can bring my queen up the left side I will have a strong attack.",
        "18... Kd8": "Vacating the a4-e8 diagonal unpins the pawn, but leaves the king wide open.   I can't, however, see a better move for black.  18...e6 and I play 19.Nc7 forking king and rook.  Any other move and the pawn is still pinned or I get an immediate check on his king.",
        "19. Ba5+ Ke8 20. O-O-O Kf8 21. Nc7 Rb8": "Black is preparing to use his control of the a1-h8 diagonal.",
        "22. b3 Qf6": "If black moves his knight, I must stop the queen from moving down the diagonal.",
        "23. Bc3": "That should do it.",
        "23... Qd8": "Mistake.",
        "24. Ne6+ Ke7 25. Nxd8 Rhxd8 26. Qa6": "And Black resigned."
    },
    "url": "https://gameknot.com/annotation.pl/sdr46s-cynics-1st-mini-tournament?gm=13859",
    "gameName": "sdr46's cynics 1st mini-tournament",
    "players": "rajsahae (1536) vs. ypsilonalpha (1653)",
    "opening": "Latvian gambit, 3.Bc4 (C40)"
}