{
    "moves": {
        "1. e4 c5 2. Nf3 d6 3. d4 cxd4 4. Qxd4": "Nxd4 is more commonly played at this point.",
        "4... a6 5. Nc3 Nc6 6. Qd1 Nf6 7. Be3": "White could be more aggressive here.  Perhpas Bg5 with the option to trade the knight or Bd3 to the knight on c3 to move while ensure black does not play Nb4.",
        "7... b5": "With b5, black secures the qeen side of the board and can look to leverage an attack through this side.",
        "8. Bd3 e6 9. O-O Be7": "With this black secure's his ablity to castle.",
        "10. Bf4 e5 11. Bg5 Nd7 12. Bxe7": "Here Qd2 might be better.  This would allow white to maintain pressure on the BSB while keeping alive the knight center posting possibility [..f6  13.  Bh4  g5 (opens the king's pawns and greatly weakens a king castling position)  or ... 0-0 13. Nd5 will creates a stronger white position.",
        "12... Nxe7 13. Be2": "White makes another weak move.  A more interesting play could be \r\n13.  Nd5  Nxd5\r\n14.  exd5. \r\n\r\nThis position would allow for Be4.  The queen can then be eaisly moved off the back row to connect the rooks in an effor to attack black's d and e pawns.",
        "13... Nf6 14. Nh4": "This frees the WSB and creats the possiblity of attacking on the king side working around black's strong center position.",
        "14... b4 15. Nd5 Nexd5 16. exd5 O-O 17. h3 Bb7": "Black begins building an attack on white's d pawn.",
        "18. Bc4 Qa5 19. Nf5": "This is a critical move for white as it is the only move that can protects white center pawn which is the only thing keeping black from dominating the center board.\r\n",
        "19... Bxd5": "By this move black loses a piece.  Qc7 would be better as it allows black to reposition his pieces for another attack while continuing to maintain a strong center and good queen pawn structure \r\n\r\n19  ...  Qc7\r\n20  Ne4  a5\r\n21  Qe7\r\n\r\nWhite still eneds to use multiple pieces to protect the d pawn so the entire center does not crumble under black's attack.",
        "20. Ne7+ Kh8 21. Nxd5 Nxd5 22. Bxd5 Rac8 23. b3": "Bb3 would be much stronger as it maintains pressure f7 and maintains the diangle.  It also opens the queen attack on blacks d pawn and allows provides protection to the c pawn so the qeen can be mobile.",
        "23... Rc5 24. Bf3 Rfc8 25. Qxd6 Rc5xc2 26. Bb7 Rd8 27. Qxa6 Qc5": "With a weak pawn structure and down a bishop, black is reluctant to trade down his queen.  He instead attempts to maneuver his queen for better position. ",
        "28. Rad1 Qe7 29. Rxd8+ Qxd8 30. Rd1": "This is a massive blunder that costs white the game.  White overlooked the fact that Qxd1 results in a check for the mateing opportunity never arrises. White would have been better served by Qa8 forcing the queen trade and then working his piece advantage to finish the game.  After:\r\n\r\n30.  Qa8   Qxa8\r\n31.  Bxa8  Rxa2\r\n32.  Bd5\r\n\r\nWith the bishop move there isn't much left that black.  ",
        "30... Qxd1+ 31. Kh2 g6 32. Qf6+ Kg8 33. Qxe5 Rxf2 34. Qe8+ Kg7 35. Qe5+ Rf6 36. Qb2 Qd6+ 37. Kh1 Kh6 38. Bf3 Kg5 39. Qc1+ Qf4 40. Qxf4+ Rxf4 41. Kh2 Rd4 42. Kg3 f5 43. Bc6 Rd3+ 44. Kh2 Kh4 45. Ba4 Rd2 46. Kg1 Kg3 47. Kf1 Rxa2": "White resigns."
    },
    "url": "https://gameknot.com/annotation.pl/seafarer-i-charlotte-chess-club-rd-3?gm=17801",
    "gameName": "Seafarer I - Charlotte Chess Club - Rd 3",
    "players": "Charles Carerros (1168 (P)) vs. Andrew Turner (1467)",
    "opening": "Sicilian, Chekhover variation (B53)"
}