{
    "moves": {
        "1. Nf3": "This is a G25 I played at the Seattle Chess Club recently.  My opponent was rated around 400 points below me, but the game is very interesting from a positional point of view and contains some interesting tactics.",
        "1... d5": " ",
        "2. c4": " ",
        "2... dxc4": "My opponent opts for the Accepted variation of the Reti Opening.  This was the first time I have faced this opening OTB and I was definitely excited to play it.",
        "3. e4": "This move is recommended by Nigel Davies in his book \"The Dynamic Reti\".  3. e3 can transpose to a QGA.  The typical Reti move is 3. Na3, but this is not my most favorite of moves.  3. e4 leads to some very fascinating and unexplored positions.",
        "3... e6": "Wisely blunting the a2-g8 diagonal as my light-squared bishop will take up residence there on the next move.  3...b5? is just outright bad after 4. a4 c6; 5. ab cb; 6. Nc3 Bd7; 7. b3! when the Black queenside is smashed and White has open lines and a lead in development.  Best, however, is 3...c5.",
        "4. Bxc4 Nc6": "Again, ...c5 is better, taking control of the backward d-pawn and the holes on d4 and d3.",
        "5. Bb5": "5. 0-0 is another option, but I am aiming for a quick d4 and a stong central presence.",
        "5... Bd7 6. O-O a6": "Black is neglecting development and the bishop blocks the pressure down the d-file.  A better plan is the Sicilian-like 5...a6 followed by ...b5 and ...Bb7, with pressure on the e-pawn.  ...Nge7 is also better.",
        "7. Ba4 Bd6": "As often happens with a bishop on d6, it becomes a target for the White central pawn duo.",
        "8. d4 Nge7": "Black is all crowded together with no way to exchange pieces.  My next move is an attempt at a cheapo tactic.",
        "9. a3": "Threatening to win material with e5.  This is not a move I would have played in a standard tournament time control.  Objectively, 9. Nc3 is much stronger.",
        "9... b5": "Only kicking my bishop to a better square.  The immediate ...Ng6 is better, if a bit awkward.",
        "10. Bc2": "It's clear at this point that the Black king will find no refuge on the kingside.",
        "10... Ng6 11. e5": "Advancing the center duo will give me attacking chances on the kingside, clear the e4-square for a piece and divide the Black army in two.",
        "11... Be7 12. Nc3": "Here I felt I was committed to playing on the kingside and in the center.  A move like this fits in logically with that plan.  While White still has a sizeable advantage here, Fritz 10 suggests that 12. Be4 followed by Be3 and Qe2 is devastating for the Black queenside.",
        "12... f6": "This move is horrible.  The king is still in the center and this move only serves to highlight the weak squares around the king.  Black's best is 12...b4, when White still has a clear advantage, but Black will get some play on the queenside.",
        "13. Qe2": "Protecting the strong point of the attack.  Fritz suggests ripping open the position with 13. ef! Bxf6; 14. d5, with an overwhelming attack against the centralized Black king.",
        "13... Na7": "Black had to try and castle then liquidate the center for some much needed counterplay.  This move removes a vital piece from the theater of battle and allows me to continue my attack unabated.",
        "14. Rd1": "I decide to relentlessly pursue a policy of centralization and piece improvement.  Fritz still likes the exchange on f6.",
        "14... c6": "Stopping d5, however, I have complete control of the board.",
        "15. h4": "Fritz gives this move as very strong, and I agree!",
        "15... f5": "Black's only chance is to keep the position as closed as possible.",
        "16. h5": "16. Ng5 is crushing after 16...h6; 17. Nxe6!! Bxe6; 18. Qh5 Bf7; 19. e6!",
        "16... Nf8": "The Black pieces are in a complete state of paralysis and disharmony.",
        "17. Nh2": "Nd2 is also possible, however, I was aiming for a possible g4.",
        "17... g5": "An interesting move.  The pawn is obviously off limits due to the opening of the h-file to the Black rook.",
        "18. Nf1": "g4 is better, however, this maintains the advantage sufficiently to allow me to play for the win rather easily.",
        "18... h6": "Attempting to exploit my slow play with ...a5 and ...b4 seems to promise better practical chances, even if objectively White is winning.",
        "19. Qd3": "Again g4 is better, but I was starting to get into time trouble and was having to make quick decisions.  I was really only worried about blundering my advantage.  Since the position is relatively closed, playing a move like this will hardly toss the advantage.",
        "19... Qc8": "Again ...a5 is stronger, as is ...Qc7, targeting the e-pawn, if I ever try to force through d5.",
        "20. g4": "Finally!",
        "20... f4": "Giving up e4 dooms my opponent.  My knights are going to become much stronger than their counterparts.",
        "21. Ne4": "Already exploiting the hole!",
        "21... Kd8": "Black is waiting to die!",
        "22. Bd2": "Aiming to bring every piece into the attack.",
        "22... c5": " ",
        "23. Ba5+": " ",
        "23... Ke8": " ",
        "24. dxc5": " ",
        "24... Bxc5": "Now Black is lost.  The next sequence of moves is entirely forced.",
        "25. Nf6+": " ",
        "25... Ke7": " ",
        "26. b4": " ",
        "26... Nc6": " ",
        "27. bxc5": " ",
        "27... Nxa5": " ",
        "28. Qd6+": " ",
        "28... Kd8": " ",
        "29. Nxd7": "Black is crushed after ...Nxd7; Qxe6 and Bf5!!",
        "29... Qxd7": "Even worse!",
        "30. Qb6+": " ",
        "30... Ke8": " ",
        "31. Rxd7": " ",
        "31... Nxd7": " ",
        "32. Qxa5": " ",
        "32... Rc8": " ",
        "33. Bg6+": " ",
        "33... Ke7": " ",
        "34. Qxa6": " ",
        "34... Nxe5": " ",
        "35. Re1": " ",
        "35... Nf3+": " ",
        "36. Kh1": " ",
        "36... Nxe1": " ",
        "37. Qd6+": " ",
        "37... Kf6": " ",
        "38. Qd4+ e5 39. Qd6+ Kg7 40. Qe7+": "Resigns."
    },
    "url": "https://gameknot.com/annotation.pl/seattle-chess-club-friday-night-g25?gm=10036",
    "gameName": "Seattle Chess Club Friday Night G25",
    "players": "ME  vs. Opponent ",
    "opening": "Reti accepted (A09)"
}