{
    "moves": {
        "1. e4": "game with my very old and good friend.",
        "1... e5 2. d4": "Center Game.",
        "2... exd4 3. Nf3": "Qxd4 was main line.\r\nBlack has two options now. Save the pawn. Don't save the pawn.\r\nThere is no any reason/threat to not save the pawn.\r\nBut Question is How i save my soldier?\r\nif 3. ... c5 then c3 dxc3 Nxc3 \r\nand Black got backward d pawn\r\nweak Q-side pawn structure\r\nback in development ...\r\n(Nc6 will transpose to Scotch Game)",
        "3... Bb4+ 4. Nbd2 Qe7": "Is this move better than Nc6?\r\nor Black should play any other move?",
        "5. Bd3 Nc6 6. O-O": "d-knight is free now. so it can move to b3 and pressure d4.\r\nalso after a3 black bishop finds problems. \r\nwhile b3 knight is solid at b3 ... so",
        "6... Bxd2": "it is better to capture it now.",
        "7. Bxd2 Qc5": "this move makes Black back in development but if he wants to save pawn then this move is crucial because White could play Bb5, capturing N and then d pawn, this move also empty e7 square for g knight.",
        "8. Re1": "i think it is slow move.",
        "8... Nge7 9. a3 Ng6": "Knight ... at its destination ... at right time.",
        "10. b4 Qb6": "Q continues to guard the d pawn.",
        "11. b5 Nce5 12. Nxe5 Nxe5": "if Black's knight was not at g6 at right time, things could be different.",
        "13. Bf1 c6": "?!\nthis is slow move,\nBlack should simply play direct c5.\nbut this move was played with intention that, if White capture this pawn then makes his two  pawns isolated.",
        "14. a4 c5": "he is not going to exchange pawns.",
        "15. f4 Ng6 16. Qh5": "Black cannot castle, because kingside is under raid.",
        "16... d6 17. e5 dxe5 18. fxe5": "better was f5 Ne7 and Rxe5 ... \r\nLooking at this variation, im wondering where Black went wrong,\r\nor trying to save the d pawn was wrong ...!?\r\n",
        "18... Qe6 19. Rac1 Qg4": "Black wants to exchange some pieces as this decreases some pressure.",
        "20. Qg5": "no matter, at what place u want to be killed ... :)",
        "20... Qxg5 21. Bxg5 Bd7 22. c3 dxc3 23. Rxc3": "ok... conclusion upto now ...\r\nAdvantages to Black\r\nBlack has 'extra pawn' plus 'passed'\r\nWhite has one isolated pawn.\r\n\r\nAdvantages to White\r\nWhite has two bishops in open position.\r\n\r\n2 plans\r\neither play h6, pushing bishop to less important square.\r\nbut after h6 later if White wants to exchange his white bishop with knight then either black move the knight or he has to capture bishop with f pawn, and making white's isloated pawn ... passed and dangerous.\r\n\r\nother idea is moving the knight right now ...\r\n",
        "23... Nf8 24. Bh4": "(u know, c5 pawn is poisoned, as fork of knight, g5 bishop and c5 rook, so white moved bishop away to capture pawn now)",
        "24... Ne6": "this maneuver of knight makes center solid,\r\nBlack doesn't need to castle now, \r\nas it is endgame it is better ... king in center.\r\nlater or anytime knight can go to d4 ... a good outpost of knight.\r\nbut temporary it blocks own bishop ...",
        "25. Rd1 b6": "giving hand to pawn as now knight is free to move.",
        "26. Bc4 h6": "!\r\nBlack does not care of exchange of pieces.\r\nActually Black want to exchange one of white's bishop\r\nas two bishops are dangerous ...",
        "27. Rd6": "i could not understand the reason of this move.\r\nif White wants bloodshed at e6 then he cannot be succeeded to win the blood.\r\nbut if he wants Black to move his knight and win the f7 pawn then ok ...\r\nlets check it out ...",
        "27... Nd4": "knight at best outpost, and door is closed for White Rook.",
        "28. Bxf7+ Kxf7 29. Rxd7+ Ke8": "now 2 threats.\r\nattacking rook\r\nand knight fork",
        "30. Rxd4": "White chose this option, but if he played\n30. Rxg7 Ne2 \nor\n30. Re7  Kf8 31. (King or c-Rook to anywhere to stop the fork then) g5 attacking bishop and rook ...",
        "30... cxd4 31. Rd3 g5 32. Bf2 Rd8": "if White does not capture the pawn then it is saved,\r\nbut if he captures with Rook ... RxP RxR BxR then Black King comes to e pawn and Rook goes to a4 b5 pawns ...",
        "33. Bxd4 Rf8 34. g3 Rf7": "coming to d7",
        "35. e6 Rf5": "if 36 White play e7 then Kxe7 will be blunder."
    },
    "url": "https://gameknot.com/annotation.pl/second-round?gm=7669",
    "gameName": "Second Round",
    "players": "qamar1 (1560) vs. abro (1614)",
    "opening": "Centre game, Kieseritsky variation (C21)"
}