{
    "moves": {
        "1. d4 d5": "This is a transposed move from the main line, and the moves following this are out of sequence until move 4 is complete.\n",
        "2. Nf3": "I continue with a transposed move as well, for the reason that I am trying to steer the opening towards a Semi-Slav.\n",
        "2... Nf6 3. c4": "The pawn, according to this openings principals is offered in sacrifice.\n",
        "3... c6": "Black follows the prinicipals of this opening by not playing the wasteful move 3...dxc4, which takes away central control, but instead maintains the possibility of maintaining a solid central presence after (4.cxd4 cxd4). For this reason white does not play 4.cxd4, but leaves the tension while making more productive moves.\n",
        "4. Nc3 e6": "This position is the main line of the Semi-Slav by way of transposition. The normal move order is (1.d4 Nf6  2.c4 e6  3.Nf3 d5  4.Nc3 c6  5.Bg5 dxc4 ...), the text move 4...e6 assures a difficult game for white while maintaining strength at d5, and activates a bishop.\n",
        "5. Bg5": "I proceed with the main line, where this move is part of a strategy against the f6 knight. This reminds me of the Nimzo, but from reversed colors.\n",
        "5... dxc4 6. e4": "This move is still within the main line, and the white c pawn has been sacrificed for the initiative.\n",
        "6... b5": "This prevents white from regaining material balance.\n",
        "7. a3": "?! Here, because I am still learning, a deviation from the main line move of 7.e5 with (7...h6  8.Bh4 g5 9.Nxg5 hxg5 10.Bxg5 Nbd7) as the main line continuation. My move was made with consideration to limiting the f8 bishop and protecting the c3 knight, but departs from the planned exchanges of the main line. The move does create a different scenario from which springs some fun game play.\n",
        "7... Be7": "The obvious move that screams disapproval of whites prior move.\n",
        "8. e5": "?! Probably a bit out of place due to giving d5 to the knight. My thoughts were to sieze control of g5 and to eliminate blacks black-squared bishop for greater initiative for white.\n",
        "8... Nd5 9. Qd2 O-O": "Perhaps rushing castling, I would have considered 9...Nxc3 to remove an important contribution to whites game, or even the straight forward 9...Bxg5 bishop exchange would leave a lone knight at g5 with hopes of making it a positional liability.\n",
        "10. Ne4": "The knight will take part in kingside operations, so the exchange is avoided.\n",
        "10... Bxg5 11. Nexg5": "The knight occupies a reasonable square where it targets h7 in anticipation of the queen.\n",
        "11... Bb7": "Black follows the usual plan to develop the bishop on the a8 diagonal, even though it is not achieving anything now it can and does produce results later in the game. This is a very good diagonal for the bishop, especially if short castling is anticipated for white.\n",
        "12. h4": "I have a loosely intuited plan for attacking kingside, a favorite strategy of mine. Here the plan will involve pushing the g and h pawns. I consider possibilities for a knight sacrifice, but see nothing productive from that idea, mostly due to the hindered white squared bishop vs the c4 pawn.\n",
        "12... Nd7": "Black correctly anticipates activity and brings in the other knight, which proves to be a good decision.\n",
        "13. g4 c5": "A nice move, hacking away at whites center, and opening up the bishop line to make it more effective, which lends some concern to white for the f3 knight. This move guarantees white a positionally isolated e pawn while a knight resides at f3 after (14...cxd4)\n",
        "14. h5": "I realize that I need to push the attack forward quickly and feel that there is enough control of other key squares and pieces, so this move continues the battle plans of a kingside pawn attack.\n",
        "14... cxd4": "Fully expected.\n",
        "15. Qxd4": "This maintains the e5 pawn for the moment, although I knew  beforehand this would be the result of my choices, it takes the queen away from making a move onto the b1 diagonal, but it was necessary. Quite the contrast, the powerful queen is forced to guard the least powerful pawn.\n",
        "15... Qa5+": "Forcing the white king to dance a jig, denying long castling. This does not concern me in this game, in this position, due the placement of blacks resources.\n",
        "16. Ke2": "The position is somewhat akward for the white king, but due to certain odd positional considerations black does not have the exact requirements to succeed in attacking the king fruitfully.\n",
        "16... Qb6": "Black, ahead by a pawn seeks to trade queens with the idea of using the queenside majority.\n",
        "17. Qd2": "I decline the trade because I have other plans which involve using the queen.\n",
        "17... b4": "Pressure is applied to the weakened queenside.\n",
        "18. Qc2": "Applying a simple threat of Qxh7#, the queen is finally on the b1 diagonal.\n",
        "18... Nf4+": "Black springs a nice move on the king to force his majesty to a vulnerable e1 square, where after ...Nd3 provides some entertainment value for black. This move prevents whites threat of Qxh7# for the moment.\n",
        "19. Ke1 f5": "?! Black, before pressing the white king further chooses to shut the queen out of the kingside, and may have hopes for gxf5 to remove some of the building threat, but this overlooks another alternative by white by enpassant.\n",
        "20. exf6 e.p.": "This opens the queen line up again, and now the threat of Qxh7# forces the only worthy reply.\n",
        "20... Nxf6": "I consider that the knight at f6 must be removed and make plans to use the f3 knight to that avail.\n",
        "21. Ne5": "!? The idea is Nd7, which by proxy attacks the queen and a rook, but most ideally attacks the f6 knight. This move sacrifices a rook in the process, which appeals to me.\n",
        "21... Bxh1": "Black caves in to material greed. This move was not forced.\n",
        "22. Nd7": "A step closer to the objective, Q, R, N are forked.\n",
        "22... Nd3+": "I expected this and was ready.\n",
        "23. Bxd3 cxd3 24. Qxd3": "The queen is back in the attack on a clear b1 diagonal, ready for the removal of the f6 knight, with Qxh7+ to follow. Mate is not the fast solution now that the black f pawn is gone, and due to the expected responses to Nxf6. This move also regains a pawn in material for white.\n",
        "24... Rad8": "? Missing the white strategy and overlooking the check threat that leaves the queen untouchable.\n",
        "25. Nxf6+": "Forcing a single response, and clearing Qxh7+\n",
        "25... Rxf6 26. Qxh7+": "Continuing with the attack that rides on the edge of the knife. White gains another pawn and is down 4 points.\n",
        "26... Kf8 27. Qh8+": "Forcing the only response, the king has only e7 available due to the queen and knight coordination.\n",
        "27... Ke7 28. Qxg7+": "Hitting the king hard with an unblockable check, (28...Rf7?? Qxf7+) succeeds due to the knight support. There are two choices, ...Ke8 with some fighting chances but a thin line to walk, or ...Kd6 with check by Rd1. The first choice seems more agreeable. Another pawn is gained, -3 points for white.\n",
        "28... Ke8 29. Qxf6": "White is amusingly still able to keep the attack going, with a surprising lack of checks available from black, due in large part to the f2 pawn vs ...Qe3+, and the king residing on a black square which is untouchable by the white squared bishop of course, and safe from the rook by the lack of an open file to the king. White has encouraging chances for a continued attack due to mobile pieces that fit into the attacking plan. Now white has overturned the material deficit and stands two pawns ahead, this adds force to whites attack.\n",
        "29... Rd6": "Assumedly made to strengthen the rook and prepare for ...e5, a move for which white will not wait around to see.\n",
        "30. Qf7+": "Keeping the king moving towards his destiny, for which I have hopes of this being a mate.\n",
        "30... Kd8 31. Qf8+": "Persistance in attack, there are no blocks, and the king has d7 or c7 as choices, of which both lead to difficulties, and ...Kd7 possibly to mate.\n",
        "31... Kc7": "An unfortunate choice which gives white good piece activity, but the alternative leads to a dangerous battle in which black loses to mate.\nAlternative variation: 31... Kd7 32. Nf7 bxa3 33. Ne5+ Kc7 34. Nf7 Rd7 35. Rc1+ Kb7 36. Qc8#\n",
        "32. Rc1+": "The rook now joins the attack, and even though 32...Rc6 can be played, the queen is still in the attack and this will allow white gains.\n",
        "32... Rc6 33. Qe7+": "The best move because it prevents the king from escaping at b7 to a6, and with this move a concept begins to form in my thoughts in which I attempt to trade off all major pieces to an endgame having 3 pawns vs the bishop. This idea will require some work, but that is the plan.\n",
        "33... Kb8 34. Rxc6": "! Beginning the plan, a combination which will take some time to realize, but the outcome is almost a certainty.\n",
        "34... Bxc6": "?? I have to fault this move because it causes black considerable problems due to the black queen who can not counter attack the white king. Neither choice can save the e6 pawn, but (34...Qxc6  35.Nxe6 Qe4+) may yield chances for perpetual check.\n",
        "35. Qd6+": "Attempting an immediate trade of queens with Nxe6 to follow, which ensures 3 passed pawns for promotion strategy.\n",
        "35... Kc8": "Black tries to avoid the enevitable, but to no avail.\n",
        "36. Nxe6": "And now the idea of trading queens becomes more a possibility at d8. White leads by 3 pawns which makes it easier to proceed with the planned strategy.\n",
        "36... b3": "? A sad move, where an improvement can be found by 36...bxa3, to allow the queen a slim chance at checking possibilities at b1. This could be thwarted by (36...bxa3  37.Qxa3) where the white queen is unassailable by the white squared bishop which prevents any tricks that would gain the knight for black, but still a slim chance may be better than none at all.\n",
        "37. Qd8+": "! This forces the trade of queens with a knight sacrifice thrown in for the ultimate in fun.\n",
        "37... Qxd8 38. Nxd8 Kxd8": "The position looks dangerously close, and it is not guaranteed that white can win by pawn promotion, especially considering the proximity of the king to the promo squares and pawns, but this is the chance I was willing to take, and I had a plan which involved placing all the pawns on dark squares, manuevering the king to a useful postion, and with hope pushing a supported pawn to a win. I had thoughts of trying to get a trade of bishp for pawn also.\n",
        "39. h6": "This first step threatens promotion, so black will have to stop the pawn by controlling h7 with the bishop.\n",
        "39... Be4": "Now all the pawns must get past this b1 diagonal, and it seems a formidable task.\n",
        "40. f4": "Directly to a dark square.\n",
        "40... Ke7": "Correctly seeking to eliminate a pawn by the king.\n",
        "41. Kf2": "Using the safe dark squares.\n",
        "41... Kf6 42. Kg3": "There are two ways to look at this move. Its bad because Ke3 chases the bishop and seems better. Its good because it fakes out the black king who will attempt to attack the h6 pawn out of necessity, so pushing 43.g5 will encourage the king to circle clockwise around to get at the pawn base, which I will make appear to be open, which I hope will give me chances to menace the bishop using the king, then use protected pawns against the bishop position, with hopes of trading a pawn for bishop and gaining a free pawn for promotion.\n",
        "42... Kg6 43. g5 a5": "Black probably should have just played 43...Kh6, but this move does not really cause problems other than giving up a tempo.\n",
        "44. Kf2": "Dropping the bait, in which I try to lure the king to h5, then g4, while I circle around attacking the bishop by king, then by pawn.\n",
        "44... a4": "Again another odd move. I suppose if my strategy were to bolt to the queenside and try and achieve a passed pawn this would be sensible, but why do that when there are 3 connected passed pawns on the kingside?\n",
        "45. Ke3": "Encouraging the bishop to a lesser position.\n",
        "45... Bf5 46. Kd4": "Chasing after the bishop by using the safe dark squares. I have hopes that the black king will be enticed towards f4 via h5, where I will offer a pawn sacrifice with hopes to gain a win.\n",
        "46... Kh5": "Finally I am relieved to see the king circling, but this move seems a bit weak considering the hanging bishop, which after 47.Ke5 white gains a tempo.\n",
        "47. Ke5": "There are a couple of choices here: The idea ...Bh7 seems reasonable, but I think white can still find a way past the bishop after distracting the king by offering the f4 pawn. Or there is ...Kg4 which I am able to prove as ineffecive.\n",
        "47... Kg4": "Now black chooses to guard the bishop with the king while preventing white from access to the f4 pawn, with the idea of taking the pawn. This pawn will be sacrificed to get the win after 48.Kf6, next will follow 49.g6 which blocks the bishop access to h7, which should give white the win.\n",
        "48. Kf6 Kxf4": "I am happy to see the plan unfolding as anticipated.\n",
        "49. g6": "The win is assured.\n",
        "49... Bd3": "The bishop could be used to prevent promotion on the g file, but it will have no chances on the h file where black is the color of the promotional square.\n",
        "50. h7 Be4 51. h8=Q Bxg6": "Black eliminates the possibility of the other promotional pawn. Here the game is technically won.\n",
        "52. Kxg6 Kg3": "Makes it easy to finish the game quickly from this point.\n",
        "53. Qf6": "Restricts the king to 2 short files.\n",
        "53... Kh3 54. Kg5": "Using the king to push an enclosing wall towards the first rank, g4 and h4.\n",
        "54... Kg3 55. Qf4+": "Closing the net tighter.\n",
        "55... Kg2 56. Kg4 Kh1 57. Kg3": "A back rank textbook mate follows from here.\n",
        "57... Kg1 58. Qc1#": "Finally I have my revenge on the computer who has been thrashing me in this opening. I am playing up another level, and the computer has some improved play in some parts of the game, but seems a little weak on some endgame concepts.\n"
    },
    "url": "https://gameknot.com/annotation.pl/semi-slav-with-2p-n-r-sacrifices?gm=26235",
    "gameName": "Semi-Slav with 2P N R Sacrifices",
    "players": "Chessknave  vs. Computer - FH010 ",
    "opening": "Queen's pawn game (D02)"
}