{
    "moves": {
        "1. e4": "This game is unusual in that the white knights at move 15 occupy h7 and h8. It also features an unusual way of exchanging king side rooks, both of which are captured on their starting squares! Enjoy!\r\nI had played Cherrypie seven times, I have lost to him, and conceded 3 draws. He is a player I greatly respect. I normally start with d4, but I played e4 mainly for variety. I think I drew with him last time I ventured d4.",
        "1... Nf6": "And he responds with the Alekhine defence, black tries to lure the white pawns forward, and hopes to undermine the white pawn centre later. It is double-edge though, as the white pawn centre may prove very powerful!",
        "2. e5": "This advanced is really the only principled move and is by far the most commonly played move.",
        "2... Nd5": "This is virtually forced.",
        "3. d4": "and this is the standard move for white too",
        "3... d6": "Black starts to attack the white centre.",
        "4. Nf3": "Nf3 is the most commonly played move, and, according to the database, the most successful move, out of the commonly played moves. Nc3 here actually scores 100%, but it looks bad to allow black to double white's pawns. There is only one game with Nc3 on the database, and I wasn't going to trust a single game!",
        "4... Bg4": "Black pins the white knight on f3, again the most commonly played move in this position.",
        "5. Be2": "And likewise I chose the most commonly played move too.",
        "5... c6": "e6 is more common here, although c6 does score better for black.",
        "6. c4": "I go with c4 as it scores better than the more popular 0-0",
        "6... Nb6": "Nb6 is the most popular move, although Nc7 scores better.",
        "7. Nbd2": "Nbd2 is the most popular move, although Ng5 scores better, I thought it better to continue development.",
        "7... dxe5": "dxe5 is the more popular move - 60 games on the database with it, compared with 59 for Nb8-d7, which does score better. Generally when you have pawns in the centre like this which can take each other, it is better to leave the central tension, unless you fear your opponent exchanging, or can gain an advantage by exchanging.",
        "8. Nxe5": "Nxe5 is more popular, and scores better than recapturing with the pawn. Black can grab a pawn here, with Bxe2 and the Qxd4, but white has plenty of compensation in better development.",
        "8... Bf5": "So my opponent declines the pawn.",
        "9. Ndf3": "And now he doesn't get a second chance!",
        "9... e6": "Making a route out for his black squared bishop.",
        "10. g4": "We are getting near the end of previously trodden ground here. There is one game on the database with this position, Stein, Bernd (2405) vs. Andruet, Gilles (2365), which white won, so I was feeling confident!",
        "10... Be4": "But that game went 10. g4 Bg6 11. h4 Be7 12. Nxg6 hxg6 13. Be3 Nb8d7 14. Qc2 c5 15. O-O-O Qc7 16. Kb1 O-O-O 17. g5 Bd6 18. Qe4 Kb8 19. Rd2 Ka8 20. Rhd1 Nc8 21. Qc2 Be7 22. dxc5 Nxc5 23. b4 Na6 24. a3 Rxd2 25. Rxd2 Rd8 26. Rxd8 Bxd8 27. c5 Ne7 28. Bd4 Nf5 29. Be5 Qc8 30. Bxa6 bxa6 31. Qe4+. Perhaps my opponent knew this and wanted an alternative?",
        "11. c5": "I had a very good think before playing this move. 11. Nxf7 Kxf7 12. Ng5+ is interesting, and of course, if black just moves his king again, white recaptures the bishop on e4 with advantage. However black has Qxg5 13. Bxg5 Bxh1 with more than enough compensation for the sacrificed queen. 11. Ng5 is worthy of consideration, but Bxh1 12. Ngxf7 Qh4 is possible, so is Bb4+ 13. Bd2 Qxd4 14. Bxb4 Qxd1+ 15. Rxd1 Na6, so I decided to block the diagonal of the black dark squared bishop first, so there is no bishop check on g4.",
        "11... Nb6d7": "This seems a natural retreat, but the Gameknot post-match computer analysis says it is a mistake, and puts white's advantage at 1.4 pawns. It gives as best  f6 11. cxb6 fxe5 12. bxa7 Rxa7 13. dxe5 Qxd1+ 14. Bxd1 Bb4+ 15. Bd2 Bxd2+ 16. Kxd2 O-O 17. Ke3 Bd5 18. a4 with white's advantage down to 0.64",
        "12. Ng5": "So I continue with my plan......",
        "12... Bxh1": "Computer also gives this as a mistake, suggesting Bg6 12. Nxg6 hxg6 13. Bd2 Be7 14. h4 Bxg5 15. Bxg5 Nf6 16. O-O Nbd7 17. Qb3 Qc7 18. Rfe1",
        "13. Nexf7": "and in this way, white regains the rook.",
        "13... Qf6": "Again, this move seems very natural to me, but computer says better is  Qc7 13. Nxh8 Qxh2 14. Qb3 Qg1+ 15. Kd2 Qxf2 16. Nxe6 Bd5 17. Nc7+ Kd8 18. Nxd5 Qxd4+ 19. Ke1 Qxd5 20. Qxb7 Qh1+ 21. Kd2 Qd5+ 22. Ke1",
        "14. Nxh8 Bd5": "The black position is bad, maybe lost already. In many variations white has Qb3 hitting b7 and e6, so black sensibly prevent this. However the computer prefers Nxc5 14. Nxh7 Qh4 15. Nxf8 Qxh8 16. Ng6 Qh7 17. Nf4 Ne4 18. Nxe6 g5 19. Nxg5 Qxh2 20. Nxe4 Bxe4. I don't think I considered Nxc6 at the time!",
        "15. Nxh7": "and so we reach this crazy position with both sides missing their king side rooks, and white knights on h7 and h8.",
        "15... Qh4": "Best according to the computer.",
        "16. Qc2": "eying the weak white squares of g6 and h7. Protecting the Nh7 and preparing Qg6",
        "16... Nf6": "Computer prefers Qxh2 16. Qg6+ Kd8 17. Bg5+ Kc7 18. Qe8 Nf6 19. Qxf8 Qxh7 20. Bf4+ e5 21. Bxe5+ Kd7 22. O-O-O Ng8 23. Bxg7 Bxa2 24. Qd6+ Kc8\r\n",
        "17. Qg6+": "So in with the queen!",
        "17... Kd8": "Best!",
        "18. Nf7+": "Again, a natural move, although the computer prefers Kc8 18. Nxf8 Qxh2 19. Nd6+ Kc7 20. Ne8+ Nxe8 21. Qf7+ Kd8 22. Bg5+ Nf6 23. Qxg7 Kc8 24. Qxf6 b5 25. O-O-O Kb7 26. Nxe6 Bxa2. It is getting a bit academic - black is basically being torn apart.\r\n",
        "18... Ke7 19. Nd6": "Making way for the queen to get to f7.",
        "19... Qxh7": "Black no doubt took some comfort from removing one of the knights which had caused so much damage.",
        "20. Qf7+ Kd8": "Forced!",
        "21. Qxf8+": "now Kc7 allows mate in one with Qc8, so again, his move is forced.",
        "21... Kd7 22. Qf7+": "Back again to f7.....",
        "22... Kd8": "Again forced.",
        "23. Nxb7+": "might as well pick up a pawn.....I now left the following conditional sequence, and left a message for my opponent, \"Conditional moves - 22. … Kd8 23. Nxb7+ Kc8 24. Nd6+ Kd8 25. Qf8+ Kd7 26. Qc8+ Ke7 27. g5.\" This was enough to make him resign. Please leave your comments, and don't forget to rate this annotation!\r\n"
    },
    "url": "https://gameknot.com/annotation.pl/send-in-the-calvery?gm=31802",
    "gameName": "Send in the calvery!",
    "players": "charleshiggie (1992) vs. cherrypie (1878)",
    "opening": "Alekhine's defence (B05), modern, Flohr variation"
}