{
    "moves": {
        "1. e4 c5": "Remember - I was playing for a win.",
        "2. Nf3": "Good news - white was eager for battle too.",
        "2... d6 3. d4 cxd4 4. Nxd4 Nf6 5. Nc3 a6": "Najdorf variation - maybe the best choice if playing Black and wanting to fight for the win. ",
        "6. Bd3": "This move dissapointed me a little because at the time of the game, I was reading a book about Polugaevski varaiation (6. Bg5 e6 7.f4 b5) and wanted to test some ideas.\nOn the other hand this move is not played frequently by white players so it shouldn't be a very strong move.",
        "6... e5 7. Nf3 Ng4": "The idea behind this strange move is to provoke h2-h3 at some point, weakening white's kingside.",
        "8. O-O Be6 9. h3": "And here it comes.",
        "9... Nf6 10. Bg5 Be7 11. a3": "Not a good move I think. White doesn't use his advantage in development.",
        "11... Nc6 12. Ne2 Qc8": "A mistake. The idea was to aim at h3, but Qd7 would have been better.",
        "13. Ng3 h6 14. Bxf6 gxf6": "Opening the g-file for my rook(s). \nThe plan is to prepare and when the time is right to bust open white's kingside with a sacrifice (Bxh3 for example).",
        "15. Nh2": "Now Bxh3 is not good because of gxh3, Qxh3 Qg4! forcing exghange of queens and black's attack is less dangerous.",
        "15... Qd7": "Somewhere around here I realised my mistake at move 12. But seeing that white is preparing to defend I decided to keep preparing for the attack.",
        "16. f4": "This move threatened f4-f5. winning my bishop, and more important - blocking the h3-c8 diagonal. I have several options:\n1) 16...exf4 -  this would leave me with doubled and isolated pawns on the f-file.\n2) 16...b5 - defending c4 so my bishop could go there.\n3) Move my queen - so my bishop could go on d7.\nNaturally I didn't like any of these so I chose...",
        "16... Rg8 17. Nh5": "Now Bxh3 isn't a sacrifice.",
        "17... Bxh3": "So I played it immediately. This is the first pin of the game - g2 pawn is pinned.",
        "18. Rf2 O-O-O 19. f5": "Cutting the way back for my bishop.",
        "19... d5": "Opening the way to c5 for my other bishop.",
        "20. Qf3": "This wins my bishop on h3.",
        "20... Bc5": "The second pin - this time a rook.",
        "21. Qxh3 Bxf2+ 22. Kxf2 dxe4 23. Nxf6 Qd4+ 24. Kf1 exd3": "Saying \"please take my rook on g8\". I had in mind the following line:\n25.Nxg8 dxc2 26.Ne7  Nxe7 27.f6  Kc7 28.fxe7 Qd1  29.Rxd1 Rxd1  30.Kf2 Rd2  31.Ke3 c1Q \n32.e8=Q Rd8 ",
        "25. cxd3 Qf4+ 26. Nf3": "The third pin.",
        "26... Rg5": "Exploiting the pin on f3.",
        "27. Ne4 Rxd3": "Sacrificing the exchange again. And yet another pin - pinning the f3 knight again.",
        "28. f6+ Kc7 29. Nexg5 hxg5": "So far the game was going according to my \"plan\" when I sacrificed the exchange on move 27. I had the idea of g5-g4 on the next move. The next move for white made things easy.",
        "30. Qh2": "Maybe counting on 30... Qxh2 (unpinning the knight) and 31. Nxh2, but not expexting...",
        "30... Rxf3+": "CHeck! And now the white queen is undefended.",
        "31. Kg1 Qxh2+ 32. Kxh2 Rxf6": "Here white resigned. Even though I wanted to test some ideas but didn't have the chance, I enjoyed the game a lot. I want to give the due credits to Rathi -  my opponent -  for making the game so interesting."
    },
    "url": "https://gameknot.com/annotation.pl/seventh-a-t?gm=4414",
    "gameName": "Seventh A.T.",
    "players": "rathi (1495) vs. sasabg (1465)",
    "opening": "Sicilian (B90), Najdorf"
}