{
    "moves": {
        "1. d4 d5 2. c4 c6 3. Nf3 Nf6 4. Nc3 e6 5. e3 Nbd7 6. Qc2": "This is my first annoted game. In this game I want to show an unusual attack of the semi-slav game, the Shabalov attack. At 6th a very usual continuation is the meran variation with 6.Bd3 dxc4 7.Bxc4 b5 and now white must choice were to put his bishop (d3 o e2) with a loss of time. To avoid this I prefer to play 6.Qc2 which is the anti-meran variation.",
        "6... Bd6 7. g4": "Here we are! 7.g4 is the very aggressive Shabalov attack, introduced by Alexander Shabalov in the first 90's. Of course this is more powerful in fast games,because of the surprise effect. The main idea is that, after the sacrifice of the pawn (that in some cases can be token back), white can make a strong attack with the rook on the open g column, so black must be very carefull, as we will see with an example in the next comment. If the black decides to not take the pawn, white has gained some space and has the possibility of playing g4-g5, attacking the knight.",
        "7... dxc4": "Black decides to not take the pawn. Another way to decline the offer is the aggressive 7...e5, which I think is the best for black. If 7...Nxg4 a possible continuation could be 8.Rg1 Nxh2 9.Nxh2 Bxh2 10.Rxg7 and now the best possibilities for black are Bd6, Bc7, Qf6 or , if he doesn't want to give back the pawn, Qh4 and Nf8. In the game Shabalov - Mephisto(computer) we had a mistake with 10...h6? trying to save the pawn... 11.f4! trapping the bishop and then the game continued with 11...Qh4+ 12.Qf2 Qxf2+ 13.Kxf2 Nf6 14.Rg2 h5 15.Rxh2 Ng4+ 16.Kg3 Nxh2 17.Kxh2 with a good advantage for white. If you want to see the whole game you find it on www.chessgames.com ",
        "8. Bxc4 b6": "I think this move is a bit slow. 8...b5 or 8...Nb6 are better.",
        "9. e4": "The most important push for the white, trying to take the control of the center.",
        "9... e5": "The best answer if black doesn't want to lave the control of the center to white.",
        "10. g5": "And this is the attack with the g pawn, that makes the knight leave his good position.",
        "10... Nh5 11. dxe5 Nxe5 12. Be2 g6 13. Be3 Nxf3+ 14. Bxf3 Bb4": "This is the first important mistake for black. As we'll see this move gives no problems to white because after 15.a3! Bxc3 16.Qxc3! the queen makes a double attack on the rook h8 and the pawn c6. \n14...0-0 was better.",
        "15. a3 Be7 16. Rd1": "Now white starts to press on the d column.",
        "16... Bd7 17. Bg4": "The bishop d7 cannot move because of the queen d8, and is under attack! ",
        "17... f5 18. gxf6 e.p. Nxf6 19. Bxd7+ Nxd7": "Looking the board we see a very good position for white, with the passed pawn e4 and a strong pression on the d column.",
        "20. Bf4": "I decided to play this move because my intention was to push the e pawn, but another good possibility was Qb3, blocking the castle.",
        "20... O-O": "Another mistake... the king now can be attacked by the queen!",
        "21. Qb3+ Kg7 22. Qe6": "Another strong attack on d7! ",
        "22... Nc5": "The only possible defence.",
        "23. Qe5+ Bf6 24. Rxd8 Bxe5": "This is the final mistake. Now the best defence is 24... Raxd8! and after that the game goes into a forced combination 25.Qc7+ Rd7 26.Qxc6 Bxc3+ 27.bxc3 Rxf4 28.e5 Nd3+ 29.Ke2 Nxe5 and the position it's pair.",
        "25. Bxe5+ Kf7 26. Rxf8+ Rxf8 27. Bd6": "White has one piece of advantage and it's going to a won final. Black has no possibilities and resigns. "
    },
    "url": "https://gameknot.com/annotation.pl/shabalov-attack?gm=22460",
    "gameName": "Shabalov attack!",
    "players": "redeiperdenti (1724) vs. rushnpawn (1732)",
    "opening": "QGD Slav (D15), 4.Nc3"
}