{
    "moves": {
        "1. e4 e5 2. Nf3 Nc6 3. Bb5": "The Ruy Lopez, my favorite opening as white.",
        "3... Bc5 4. O-O Qf6": "!?  An interesting move, showing that black will play his king's knight to e7 and then probably to g6.  This indirectly impacts the d4 square and is not as vulnerable as I had thought.  I wanted to attack the queen with Nc3 Nd5 but saw that Nge7 refuted it quickly. After researching this position, I found that on chess.com all the given games of this time give the win to black.  This is a sideline in the Cordel/Classical Ruy Lopez that I wasn't familiar with as I normally see the Berlin or the Steinitz Defenses.  This is a solid defense for black indeed when played correctly.  ",
        "5. d3 h6 6. c3": "c3 is normally played first as per the book moves after Bc5 although castling is fine.  This is very similar to the book position, which just shows how natural this opening is to play as neither my opponent nor I  knew this opening by book before the match.",
        "6... Nge7 7. Be3 Bb6": "Prefering to not give me control over the d4 push after Bxe3 fxe3 (with the semi open f file to boot).  This is still found in databased GM games and is a common response to the logical Be3.",
        "8. Ba4": "Anticipating black to castle short, this move allows the bishop to relocate to a more useful diagonal.  White plans on exchanging the dsb for control over d4 and thus central power.  It doubles black's b pawns but there is much to be said about the compensation black gets for activity on the QS down the a file.",
        "8... O-O 9. Bxb6 axb6 10. Bc2": "The bishop serves well here against its inactive black counterpart.  Now h6 shows to be a bit of a weakening of the KS light squares.",
        "10... d6 11. h3": "Preventing the annoying Bg4 that Capablanca played in this variation at one point which leads to crushing activity for black with the semi open a file in combination.  This does allow Nf4, which I was concerned about, offering the sac on h3, although I considered tucking the king to h1 and Rg1 to take control and crush counterplay after the bishop sac.",
        "11... Ng6": "Eyeing f4",
        "12. d4": "Striking for a break in the center",
        "12... exd4": "Not black's best to be sure... though f4 is still theoretically weak for white atm",
        "13. cxd4 Re8 14. Nc3 Nce7": "?  A strange move, which I capitalized on quickly otb.  This prevents the queen from going back along the dark diagonal.  The idea seems to be a quick c5 to strick at white's strong center, but this is debunked with...",
        "15. Nb5": "!",
        "15... Ra5": "Showing the semi open a file a quick way to develope black's queen's rook.  This combination that follows (which I calculated for the most part, although black chose the more interesting exchange sacrifice that I didn't believe he would) proves the oddity that is the undeveloped lsb of black.",
        "16. Nxc7 Rf8 17. b4": "I thought the black rook would aggressively swing to h5 to prepare to sac on h3 with the bishop but there it would be tactically vulnerable",
        "17... Ra3 18. Nb5 Rxf3": "An interesting idea, I was thinking perhaps after Qxf3 and ...Qxf3 gxf3 Bxh3 with some chances though black is better with the queen's on the board if he seeks initiative on the KS with his knights.  This seeks counterplay and black does achieve some semblance of attack but the center proves to thwart the majority of his potential.  I certainly was forced to be wary and hold ground instead of trying to pound in my positional and material edge for quite some time, which drained my clock and gave my opponent the psychological edge for awhile.",
        "19. Qxf3 Qg5 20. Nxd6": "Allowing black counterplay but proving all his efforts to be well met with stubborn defense.  This creates an important passed d pawn, and with the pawns connected in the center this is a large trump card.",
        "20... Bd7": "Avoiding simplification",
        "21. Rad1": "Perhaps Rfe1 was better, but this has a clear goal of supporting the center, and preventing the black queen from infiltrating on d2 to cause trouble by double attacking bishop and b pawn.  It allows the annoying Nf4 though....",
        "21... Nf4 22. Kh1 Neg6": "Looking for ...Nh4! with a solid attack",
        "23. Qg3": "Kh1 was necessary because if Qg3 earlier ...Ne2+ winning the queen.  This slows down black's attack and forces a retreat which gives white some tempo.",
        "23... Qe7 24. e5": "Soldifying the material edge and closing out black's queen's options before advancing with an attack",
        "24... Ne2 25. Qe3 Nef4": "Black seems a bit limited though I think the activation of his rook might have been important (then his king would be more vulnerable to attack).  He has committed enough effort on the KS where he seems drained on the QS and is now somewhat zugzwanged (not literally but it seems so by the passivity of his attempts, he must avoid exchanges and simplifications as he will surely lose the resulting endgame as is).",
        "26. a3 Nd5 27. Qf3": "A good square for the queen in this position, hitting f7 (weak) and the b pawn indirectly.  ...Bc6 goes nowhere after b5 (which drops a minor for black)",
        "27... Ndf4 28. Bb3": "White uses black's wasted tempo to develop some initiative against black's king.  Many tactical opportunities may become presented against f7",
        "28... Qg5": "What follows is calculated to win the exchange...",
        "29. Nxf7 Rxf7": "practically forced",
        "30. Bxf7+ Kxf7 31. g3": "! Calculated to win, the pin picks up the knight for two pawns",
        "31... Bxh3 32. gxf4 Nxf4": "This is perhaps dangerous for white even with his substantial edge in material because of the exposed nature of his king, though there is a solid defense, which I do not take.  I actually blunder but have saving move that gives the endgame later indicated.   Qg3 was best I believe here with the line: Qg3 Bxf1 Qxg5 hxg5 Rxf1 and white is clearly winning with connected passed center pawns and the exchange up with black having two sets of useless doubled pawns.  This line is preferable for black over Qg3 Qxg3?? gxf3 Bxf1 Rxf1 and the pinned knight is lost again with the same motif that lost its partner earlier, black is even more lost.  After Qg3 the first line is best, and because the black queen is the sole defender of the f4 knight, which holds together black's KS operations, black cannot retreat the queen anywhere but g5 where it is weaker and after Rg1 or Rc1 black is the one in trouble.  I blunder here with Rg1, although white is still winning after the resulting line",
        "33. Rfg1": "??",
        "33... Qh4": "! Threatening mate in one with Bg2 double check (mate). The following move is calculated as the only saving move for white which gives away a large portion of his advantage in material but forces a simplification that leaves him with an endgame where he has at very least the draw, and with correct play a win because of his pawns",
        "34. Rxg7+": "!  The only defense, for now if Kxg7 Qg3+ simplifying to the endgame with a forced queen trade, and if the king moves then Kg1 is saving because Bh2 to prepare Qh1# is met by Rxg2 and all is good for white.",
        "34... Kxg7 35. Qg3+": "Nothing says confidence like pitching back a large portion of your advantage to prove you can still win the endgame after a forced queen trade with connected passed pawns and an active rook",
        "35... Qxg3 36. fxg3 Nd5 37. Kg1 Kf7 38. Kf2 Bg4 39. Rc1 Ke6 40. Rc8": "Dubious looking",
        "40... Kd7": "The wrong idea.  Black wants to get to e4 if possible to try to undermine the center pawns, although this is preventable and white can just play to the QS to create more passed pawns with correct play",
        "41. Rh8 h5": "I went on to win from here and stopped annotating but I got my King to the QS and forced black to sack the knight for the e pawn and then sacked the rook for the h pawn so that I had passed a and c pawns with black's king on the KS corner.  My opponent resigned with 30 seconds left with his bishop on c8 (my pawns on d6 and h5 after I played a6+ because one of the pawns will queen and black is lost."
    },
    "url": "https://gameknot.com/annotation.pl/shadow-days-quad-scc-game-3-final?gm=40728",
    "gameName": "Shadow Days Quad SCC Game 3 (Final)",
    "players": "Ryan Murphy  (1394) vs. Andy Hoerig (1350)",
    "opening": "Ruy Lopez (C64), classical defence, Zaitsev variation"
}