{
    "moves": {
        "1. d4": "This game took place in Reykjavik in 1992 between the incredible attacker Shirov (who is Latvian like Tal!  They've done a lot of analysis together) and a GM from Iceland.  It features the Shabalov attack, which like the Botvinnik (see my previously analyzed games) is a fearless and wild way to try to storm the semi-slav.  I will primarily try to explain ideas and plans instead of lots of variations, though there will be some of those too.  My analysis is not aided by computers and if people have thoughts I'd love to hear them.",
        "1... d5 2. c4 c6 3. Nc3 Nf6 4. Nf3 e6": "Initiating the semi-slav, a popular opening at the GM level, and I know a bunch of 1800-2000 guys who play it.",
        "5. e3": "This is the meran.  Generally I prefer the botvinnik as 5.Bg5 is a much more explosive, dangerous move, and it seems more natural to put the bishop outside of the pawn chain.  However in the Shabalov attack white attempts to put a pawn on g5 and storm the kingside.  Such aggresive ideas demand a kind of bloody-minded respect.",
        "5... Nbd7": "the natural square for the knight, once the defensive pawn takes the c6 square.",
        "6. Qc2": "White's last preparatory move before he begins his wild storm.  The queen does an excellent job eyeing both black's kingside and the c file from here.",
        "6... Bd6 7. g4": "7.g4!?? I'll give the reader a moment to let this move sink in...  Hundreds of years ago players used to play things like king's gambit sacrificing the f pawn, modern GMs have moved on to sacrificing the g pawn.  The idea behind this frightening pawn push is either to gain a half open g file (even the h file after 7... Nxg4 8.Rg1 Nxh2) or to push the pawn to g5 where it drives away black's best piece, the knight on f6.",
        "7... O-O": "I'm not sure if I would call this move brave... or foolhardy.  Black (by choice) steps into white's attack.  To me this move looks like walking, no, running right into the attack.",
        "8. g5": "The obvious point.",
        "8... Nh5": "There's not much choice, 8... Ne8 looks awful and 8... Ng4 loses to the simple 9.h3 (the knight's trapped).",
        "9. Bd2": "White decides to finish development.",
        "9... f5": "Black tries to shut down Shirov's powerful b1-h7 diagonal.",
        "10. gxf6 e.p.": "Shirov lets the knight come back into the game for the sake of re-opening the diagonal.",
        "10... Nhxf6": "The knight is back on it's square of f6... but the g file is now open!",
        "11. Ng5": "White sends the knight charging forward, he make the decision that the g file isn't immediately important (11.Rg1 doesn't create any instantaneous threats) and that it's move important to build on h7 while making a target out of the backwards pawn on e6.",
        "11... Qe8": "The best defense of e6.  The queen covers the kingside via f7, g6 and h5.  11...Nb6 having the bishop cover e6 would be weaker as black needs every piece for kingside defense he can get.",
        "12. O-O-O": "Opposite side castling normally signifies a race to massacre the other's king... in the game black is already so far behind in such a race that it's a completely one sided race.",
        "12... h6": "A knee-jerk response to the pressure.  Black wants to kick out the pesky knight, but he creates some huge light squared holes in doing so.  For the moment his queen defends some of the holes but white can add pressure.",
        "13. h4": "An excellent move.  White decides to open the h file at the cost of a knight.",
        "13... Bb4": "Black chooses not to take 13... hxg5 14.hxg5 when either black gives back the knight or white wins the h7 square.  Instead black tries to trade down, hoping to defuse the attack.  This plan is unsuccessful because he isn't trading white's attacking pieces, merely a queenside knight.  Apparently Thorhallsson spent a huge amount of time on this move and he couldn't find an adequate defense to 13.h4.",
        "14. Bd3": "White builds against black's weak light squares.",
        "14... Bxc3": "Black follows his policy of trading pieces.",
        "15. Bxc3 hxg5": "Black now accepts the piece offer, he has little choice as the myriad of threats against h7 and g6 are quite terrifying.",
        "16. hxg5": "Notice how white has converted the valuable open g file into the even greater open h file.",
        "16... Ne4": "Black's policy of trading is once again shown.  He both shuts down the b1-h7 diagonal and forces white to give up his light squared bishop (as ...Rxf2 and ...Nxc3 are threatened).",
        "17. Bxe4 dxe4 18. Qxe4": "White has two pawns for the piece, has a monster pawn on g5 and an open h file.  Also note that the bishop on c3 may now enter the game with a timely d5.  The immediate problems for black is h7.",
        "18... Rf5": "Black places a rook in the way of the queen's attack on h7.",
        "19. Qh4": "White renews the attack while defending his g pawn.",
        "19... Qg6": "An attempt to bring the queen to the defense, more importantly this move stops g6! which would restrict blacks king or if black takes give white a hugely powerful g file.",
        "20. Qh8+ Kf7 21. f4": "White has huge control over the center and kingside, he has pinned black's pieces down, and is almost equal in material.  The rest of the game is a bit slower than the opening, white maneuvers to create a pawn break through and black strives for counterplay while attempting to stop white's threats.  Personally, I'm a tactical player who loves to attack.  Most of my attacks come from a spatial advantage (especially when white).  Thus, for me this is a dream position, white has all the space he could ask for an is well on the way to a win with his attack.",
        "21... Nf8": "This stops the queen from infiltrating via d8 and it coves some light squares.",
        "22. Qh4": "White pulls the queen out, there's no more need for it on h8.",
        "22... Ke8": "Black flees.  Also, e4 threatened to trap black's rook and it needs a retreat square.",
        "23. e4": "And white begins an unstoppable rolling forward of his pawns.",
        "23... Rf7": "White's pawns look quite military to me, they will march forward and crush black.",
        "24. Rhe1": "After having done an excellent job on the h file the rook comes to the center aiming straight at black's king.  White is preparing to orchestrate a break through with d5 or f5.",
        "24... Kd8": "The king continues it's run.  As the king is on the d file, the break through is obvious.",
        "25. d5": "A great, explosive move.  Black's passive, cramped position is practically impossible to play.  And his extra piece is doing nothing of f8.  For that matter the c8 bishop is useless, one rook is locked out of the game and the other (on f7) cannot be envied.  Even the queen is doing little.  On the other hand white's pawn are a storm, his rooks support them perfectly and his bishop has suddenly come into the game.",
        "25... cxd5 26. cxd5 Bd7": "An attempt to shut the d file down.",
        "27. f5": "Another spectacular breakthrough.  The key pawns white wants to get through are the d and e pawns (as shown by rook placement), this move sacrifices the f pawn to fulfill that purpose.",
        "27... exf5 28. e5": "The thematic followup, white has forced a pawn breakthrough, he has two well supported passed pawns that continue to tie black down.",
        "28... f4": "Black has one asset.  A passed f pawn with a rook behind, so he does the only thing he can, he pushes it.",
        "29. e6": "A fork.",
        "29... Ba4": "Black counters with a threat.",
        "30. Rd2": "White doesn't want to give up his pawn phalanx by gaining material with 30.exf7 Bxd1 31.Rxd1, no, he wants the pawns to march.\n\nEdit: oops, 30.exf7 is met by 30... Qc2# duh.",
        "30... Rf5": "Black brings the rook out of danger while hoping to activate it.",
        "31. Qf2": "The one piece white has not used recently is his queen.  When the king was on g8 it did a great job on h4, but now that square has lost value.  This move also stops the f pawns from advancing to f2.  Another option is 31.e7  Kc7 32.d6  Kd7 and the king finds some safety on the light squares, 33.exf8=Q Raxf8 and white has lost his wonderful pawn for a mere knight 34.Re7  Kb8 yeah this probably wins but the following seems more convincing to me.",
        "31... f3": "Once again black pushes the one thing he has.",
        "32. Re4": "White puts the question to the hopeless bishop.  It's only squares are b5 where it's an easy target and e8 where it's hopelessly weak.  32.e7  is once again an alternative.",
        "32... Rxg5": "Black tries to create some tactics around the white's back rank and control over c2.",
        "33. Rxa4": "White moves the attacked rook and equalizes material.",
        "33... Rg1+": "Black gives a check to misplace white's rook.",
        "34. Rd1 Rg2": "Black has one plan, push that f pawn, note that it can't be taken 35.Qxf3 Qc2#.",
        "35. Qh4+": "White must check, and he does so.",
        "35... Ke8 36. Re4": "Now that Shirov's queen defends the e4 square it is the best way to shut down the black queen's attack on c2.",
        "36... Rc8": "An attempt to build pressure.",
        "37. d6": "The pawns roll.",
        "37... Rd8": "An awful move, played when low on time: here's a sample line that deepblade gave on chessgames: 37... Qh6  38.Qxh6 Rxc3  39.bxc3 gxh6 when mate in 7 follows: 40.d7  Nxd7 41.exd7  Kf7 42.d8=Q Rc2  (obviously a pointless computer move, to make the mate take one move longer) 43.Kxc2 Kg6 44.Qd6  Kf5 45.Rd5  Kxe4 46.Qe5#",
        "38. Qe7#": "Ouch!  Shirov first launched a wild pawn gambit, it was declined and so instead he sacrificed a piece to open line against black's king, this was converted into two pawns for the piece and a spatial advantage which he retained throughout, he turned this into two spectacular attacking passed pawns with rooks supporting them by sacrificing another pawn, and quite soon he had won.  I think this is a great example of an attack that went on for 31 moves, from 7.g4 to mate.  Throughout the game, the advantages white held constantly converted between different attacking positional advantages.  I'd recommend taking a second quick look at the game from black's point of view to watch the attack come to you.  I hope you enjoyed the game, and I'd love to get PMed if you have thoughts, criticisms or ideas."
    },
    "url": "https://gameknot.com/annotation.pl/shirov-1-shabalov-attack?gm=6270",
    "gameName": "Shirov #1: Shabalov Attack",
    "players": "Shirov (2720?) vs. Thorhallsson (2450)",
    "opening": "QGD Slav defence, Alekhine variation (D10)"
}