{
    "moves": {
        "1. d4": "in an attack a pawn can do great things when it snakes it's way towards the enemy king, it can support key squares to help mate, it can even sneak through and queen: it can also do both.  That's one half of Shirov's attack, but there's another part: pieces that flow towards the enemies king, heedless of losses.",
        "1... Nf6": "I'm going to skim over the opening, black offers a gambit, white declines.  Both sides develop, but white gets a space advantage on BOTH sides of the board.",
        "2. c4 c5 3. d5 b5": "Black had no desire to get blown out in this game, he plays the active and dangerous Benko Gambit.  Black sacrifices his wing pawns to open files for his rooks to pressure white's game.  It's one of the very few gambits where the pawn is not sacrificed for an immediate attack, but for long term positional pressure.",
        "4. cxb5 a6": "The natural continuation, white wants a great square on a6 for his bishop and to use the a & b files.",
        "5. b6": "White declines the gambit.",
        "5... d6": "No need to regain the pawn immediately.",
        "6. Nc3 Nbd7 7. a4": "White threatens to secure the pawn on b6 forcing black to take back.  The other point is to place the pawn on a5 and cramp black's game.",
        "7... Qxb6 8. a5 Qc7 9. e4 g6 10. f4 Bg7 11. Bc4 O-O 12. Nf3 Re8": "Black has basically concluded development and he's getting mighty scared of that e5 pawn push, where the e and d pawns will storm forward.  Black prepares to play his own e5 pawn push.",
        "13. O-O e5 14. dxe6 e.p. fxe6 15. Ng5": "Now the middlgame has started, white sees a target on the e6 square.  White goes for that target as he brings his pieces to the kingside.",
        "15... Nf8": "The best move, both the bishop and the knight now cover e6 and the knight controls the targets on g6 and h7.",
        "16. f5": "Black's e pawn is pinned to his king, white sees the and sends his f pawn marching forward, attacking the pinned pawn.",
        "16... h6": "Black gets afraid and kicks the knight out, this is a natural response, but look at black's pawns.  There's the thing people always say about how pawns can't move backwards so you shouldn't advance them when you don't have to.  It's true, black's pawns are all advanced which creates all kind of weak squares, it also means that none of his kingside pawns defend each other.  Also black's development to the back rank is quite miserable.  White has all the play, all the activity, all the hopes for a win.  This is definitely not what black wanted when he played the Benko Gambit.  And all his advantages lead up to the following flow of combinations.",
        "17. e5": "White plays to open lines.  Lets take a step back from the kingside, and look at the center, the centers his knights and bishops control.  White's key squares are e4 and d5.  White is opening up the game, and opening up squares for his pieces.",
        "17... dxe5": "Black must take the pawn giving Shirov access to the d file as 17... hxg5 18.exf6 where black's g pawn falls next will be awful for black.",
        "18. fxg6": "An excellent move, white is willing to to part with his knight to get an incredible pawn on g6.  The pawn cramps black and gives Shirov access to the perfect square... h7.",
        "18... hxg5 19. Bxg5": "The knight's on f6 and f8 are black's best defensive pieces so white threatens to get rid of one.",
        "19... Nf8d7": "Black must defend his knight, but this moves the knight away from the defense.  With a set of pawn sacrifices (especially the e pawn sac on move 17) white now has the d and f files open, and they just happen to be the files where all black's defensive pieces are.  Also, white has the only pawn next to black's king.  The question is how to bring the queen to the h file (and also off the d file so a rook can go there), and the answer comes back to the squares that the e pawn sacrifice opened up.",
        "20. Qf3": "The perfect answer, 17.e5! opened up the a8-h1 diagonal, and white wins a tempo there against the rook before heading over to h3.",
        "20... Qa7": "Black defends the rook, but surely 20...Rb8 counterattacking the b pawn is better?  However white has a stunning sacrifice coming up that attacks the c7 square, so maybe he should move the queen, but in that case I think b7 must be a better square for the queen (as it offers a queen trade).",
        "21. Rad1": "White grabs the file with the threat of 22.Rxd7! Bxd7 23.Bxf6 or 22... Nxd7 23.Qf7  where white picks off the rook and will probably mate in a few moves.  Not only is h7 covered by the pawn, but f7 is another important square that the g6 pawn covers.",
        "21... Qb7": "Black offers the queen trade, which, for the moment, stops 22.Rxd7.",
        "22. Qh3": "White shuttles to the h file not only threatening all sorts of combinations on h7 but also this hits e6.",
        "22... Qc6": "So black defends e6, once again taking the passive role he's taken the ENTIRE game since his gambit was declined.",
        "23. Nd5": "A beautiful sacrifice.  While this is a wonderful move doesn't the simpler 23.Bxf6 work?  Well, 23.Bxf6 Nf8 24.Bxg7 Kxg7 where 25.Rxf8  seems the natural way to continue 25... Kxf8 26.Qh8  Ke7 27.Qg7# so what about 25... Rxf8 26.Qh7  Kf6 27.Rf1  Kg5 28.h4  Kg4 29.Be2  Kg3 30.Bf3! where Ne2# is threatened.  So I don't see why he didn't choose this line, except that this win is FAR nicer looking.  I think 23.Rxf6 works too, but, oh well.  If someone would like to enlighten me on a defense for black I'd like to see it.  I think those win, but this is more enjoyable to play.",
        "23... exd5 24. Rxd5": "The point of the knight sacrifice, black cannot with the knight because of Qh7# and now, with the e pawn gone Shirov's bishop is aiming right at black's king.",
        "24... Kf8": "Black evacuates the a2-g8 diagonal, but the g8 square is weak and white brings another piece to bear on it.",
        "25. Qh7": "Black is now forced to shut down the a2-g8 diagonal at all costs the threats revolving around rook sacrifices (to open the bishop) on g8 are too scary.",
        "25... Re6": "So the rook blocks the diagonal.",
        "26. Bh6": "White now wins the g7 bishop because 26... Bxh6 27.Qf7#",
        "26... Ke8": "Black runs for the hills but the escape was not to be.",
        "27. Qxg7": "White takes the bishop, and black's king is falling to pieces.",
        "27... Nxd5": "Black's knight is no longer pinned and so he gets rid of the menacing bishop, while trying to place another piece in bishops path.",
        "28. Qh8+": "White's pawn has done it's duty as a pawn, it will now rise to a new and greater life, as a queen.  So white gets his queen out of the way with check to prepare pushing the g pawn to glory.\n\nThanks to scottyad for pointing out that this is a blunder!  28.Bg5 is stronger because it locks white's king where it is.",
        "28... Ke7 29. g7 Rxh6": "Black sees a free piece and he jumps at it, but white can now queen.\n\nAgain, thanks to scottyad for pointing out that here, black blunders back, after 29... Bb7! black has just enough to survive, and is even better.",
        "30. Rf7+": "An excellent rook sacrifice so that the pawn can queen with check.",
        "30... Kxf7 31. g8=Q+ Ke7 32. Qgd8+": "And black resigns as white has forced mate, with either 32... Kf7 33.Qg8#, 32... Ke6 33.Qxh6  Nd7f6 34.Qhxf6# or 32... Kd6 33.Qxh6 Nd5f6 34.Qhxf6#.  Notice how in the 32... Ke6 like the bishop pins a knight to the king, and after 32... Kd6 the queen pins the other knight to the king.  I think this is a great drawn out attack on the black king, where no matter how many pieces were lost there were always more to take their place.  I don't think I gave this attack full justice in my analysis, so I'd really appreciate thoughts, criticisms and variations.  I hope you enjoyed this fantastic attack- and at the end white has two queens and a bishop while black has EVERY piece but his dark squared bishop."
    },
    "url": "https://gameknot.com/annotation.pl/shirov-3-two-queens-beat-a-full-house?gm=6328",
    "gameName": "Shirov #3: \"Two Queens beat a Full House\"",
    "players": "Alexey Shirov (2700?) vs. Arnaud Hauchard (2500?)",
    "opening": "Benko gambit half accepted (A57)"
}