{
    "moves": {
        "1. e4 d5": "I keep using this system despite I know it is inferior against a strong player. But it is always fun to see how things get out...",
        "2. exd5 Qxd5 3. d4": "Finally something - and better, IMO - than Nc3! It is very dangerous to play against this. ",
        "3... e5": "if Nc3, Bb5, a6, BxN, bxN is a likely outcome. Qa5 is a move I don't like. ",
        "4. dxe5": "Thank you white. You give me the castling rights, but without the queens the game will be interesting. As in fact was. ",
        "4... Qxd1+": "The alternative, Qxe4+, is also playable. Black has attack, but I preferred this line. ",
        "5. Kxd1 Bc5": "Developing + threatening, but the f pawn was to go on f4 anyway, sooner or later. ",
        "6. f4 b6": "...so I can exploit the big diagonal... though this path is no with no dangers, as we'll see. With the text move, I take advantage on the fact that the black bishop can't be easily kicked by pawns (c3-b4 is too costly for developement). ",
        "7. Nf3 Bb7": "It's always uneasy to play against this. ",
        "8. Bd3": "White has to be very careful with the diagonal. ",
        "8... Ne7": "This knight is going to try to take advantage from the half pinned Nf3 and g2.",
        "9. Nc3 Ng6": "I'll be glad about BxN. Now, the danger is f5, but BxN+, gxB, Nxe4, Re8, and the N is pinned, but no pawn can kick him, and f6 defends it, as Nd7 and Bd6, just in case, so no worry about that. ",
        "10. Be4": "...but white surprises me with this rather obvious plan. I had my think, here, finding out what was the best move. Bc6, c6, or Nc6? Hard choice. ",
        "10... Nc6": "The \"worst\" one. But I was thinking on a tactic based on e4. Of course, if white goes f5, now I have to retire sadly on e7, since Nxe4 loses the piece. ",
        "11. Bd2": "White missed his chance, sadly for him. Not that this was a bad move, but for...",
        "11... O-O-O": "...letting me win a tempo. And he can't castle... my queen's exchange's seed grows here. ",
        "12. Nd5": "And this suggested me a \"great\" tactic: Nxe5, fxN, Nxe5, NxN, BxN, BxB, RxB, Nxf7, and black has open lines and pressure on the white king, who can't castle. BUT...",
        "12... Ncxe5 13. Nxb6+": "White finds a countertactic! Wow! I didn't even think on this move. ok. let's see: even if it seems better to keep the pawns together, I thought that after the storm it would be nice to be able to play c5, to keep the white's dsb off the action from b4. ",
        "13... Bxb6": "My bishop, here, is also safe from b4! by white. ",
        "14. Bxb7+": "As expected. ",
        "14... Kxb7 15. fxe5": "Now I can recover the pawn. I'm not sure I've played the best way, maybe my advantage is not so great as if I had kept the tension. Anyway, the position is still good for me because white can't castle. ",
        "15... Rhe8 16. Re1 Rd7": "Ok, I have to admit I wasn't on a clear plan, here, but I would have doubled the rookd depending on his move. Dont' do that at home :-)",
        "17. Re4": "Inmediately glanced f5, after the rook retires, f4! would be very interesting for black. But I couldn't see it so clearly. ",
        "17... h6": "He can't really add the other rook to the defence, so I have time to be profilactic and protect my rooks from Bg5 if they want to be free to double safely. ",
        "18. Ke2": "Now, I told myself it was the time to play the attack. After exf6, RxR+, Kf1, black's position is wonderful, even after gxf6. ",
        "18... f5 19. e6": "Another daring move by white! More and more interesting. I admit here that I missed RxB+, NxR, fxR, Nxe4, with winning material advantage. ",
        "19... fxe4": "But I was just fascinated by the check and a knight comination I foresaw...",
        "20. exd7": "You see, I adore this... and still be able to get out of it! :-)",
        "20... exf3+ 21. Kxf3": "Better was gf3 in order to avoid the following...",
        "21... Ne5+": "anyway, the pawn is doomed. White resigns here, because a single pawn is no compensation for the piece in this position. An interesting game, with two moderately interesting tactic moments...",
        "22. Kg3 Nxd7": ""
    },
    "url": "https://gameknot.com/annotation.pl/short-but-still?gm=47084",
    "gameName": "Short, but still...",
    "players": "plab59  vs. damalfi ",
    "opening": "Scandinavian defence, Lasker variation (B01)"
}