{
    "moves": {
        "1. e4": "A short game that starts very quietely, and suddenly goes wild. It shows a somewhat thematic sacrifice from black, with a tense tactic moment. Enjoy.",
        "1... d5 2. exd5 Nf6 3. d6": "A different outcome for the Scandivian! White concedes the pawn and developement, but I will have to think. ",
        "3... exd6": "cx would have kept my pawn to the center. But my style of game will lead me to feel unconfortable without the c pawn to shield any B or N incursion. This option will lead to a very passive game from my part. ",
        "4. d4 Be6": "Guarding d5 without double-moving the d pawn. The icelandic plan Qe7 - Bc5+ is still possible. ",
        "5. h3": "A waste of time, but white (maybe) remembers some lines in which black plays Ng4...",
        "5... Nbd7": "Allowing the c pawn to move. I play this position with the dsb \"out of the box\", on b6. But it was not possible with this opening, so maybe I should have gone for cxd6 after all. ",
        "6. Nf3 Be7": "Very, very passive for my standards, but hey, I'm playing black!",
        "7. g3": "Very slow, but it is a normal - though somewhat passive - way of developement. I am glad I kept the c pawn for c6. ",
        "7... O-O": "I can't recognize my style of playing! :-)",
        "8. Bg2 c6": "So simple, so neat. ",
        "9. O-O h6": "I'm without a plan! But Ng5 was annoying, I don't want to concede the lsb for a N. ",
        "10. Nc3": "Nb6-Qd7 was a line. White would have defended with the usual Kh2, and I would have had the thematic sacrifice Bxh3... that sometimes gets score, sometime doesn't. ",
        "10... Kh8": "I went for this idea: to attack with g5, supporting it with the r. g3 will be my target. ",
        "11. Kh2": "As foreseen, but not really necessary. White should throw in a plan. ",
        "11... g5": "I throw in mine, for sure. ",
        "12. Re1": "A normal developement move, as if on the Kingside nothing will be happening. ",
        "12... g4": "h4 can't be played because the N is en prise. ",
        "13. Nh4": "This N can be convenientely exchanged for the Be7 to open up the king's position... but it is not so straight forward, because white still has f4 to interpose. ",
        "13... h5": "I don't want HIS Q entering my kingside, or I'll be lost! Due to my risky plan, the game popped out in a tactic and tense battle. Very intense, by now. ",
        "14. Ne4": "Looking for exchanging material, which benefits me since my pieces are cramped. ",
        "14... Nxe4": "Now BxNh4 is a threat. White should take with the B, and accept d5 and to retreat to d3. ",
        "15. Bxe4 Bxh4": "Not following the normal exchange sequence is often a good resource. My target is to disrupt white's kingside, so I can't allow Ng2. ",
        "16. Bf4": "? White can't allow himself to lose a minor piece so lightly. ",
        "16... Be7 17. h4": "...even if it means white can build his defence again. ",
        "17... Nf6": "Now I can expand, threatening NxB and depriving him from one of his best pieces. ",
        "18. Bd3": "Won tempo. And fortunately my N has another brilliant jump to accomplish...",
        "18... Nd5 19. Be3": "White felt surprisingly ovewhelmed by black's pieces, all very active. Here, white should have hidden the B into d2 or even f1, since offering it for exchange on g5 is just lose after h4. Bh6, Rg8 is just helping black in his developement. White can then try to hold it with Qd2, with some prospectives. Now, where it is, it invites NxB. But I won't play that because there is no need to. I will do it if ever white tries c4, not before. I have to be quick, since white will reagrup soon and attack on his terms. And the best way to be quick is...",
        "19... Bxh4": "Classic sacrifice, and I'm a piece up, but I got to exchange it in the best of terms. ",
        "20. gxh4": "If white tries Bf4, NxB. ",
        "20... Qxh4+": "Feeling homicide... :-)",
        "21. Kg1": "Quickness is vital. What's the quickest way of attack? The \"more compelling one\". The one that most restricts white's options, without exchanging pieces without scope. ",
        "21... g3": "This creates the inmediate threat Qh2+, followed by Bh3+... white can't think in anything else, he has no time to play c4. Nothing to do...",
        "22. fxg3": "White could have tried Be4 instead, covering h1 and f3 to counter black's previous manouver (Qh2+, Bh3+ and W can interpose Bc6. Without hopes anyway). ",
        "22... Qxg3+ 23. Kf1": "If Kh1, Qh3+, Kg1, Rg8+ and white is lost. Anyway...",
        "23... Bh3+": "...and white resigns because of Ke2, QxBd3#. You can see why it was correct not to take the B: the N could have played some part later in the attack, and it happens it does. It had to preserve himself to keep his influence on the game, and exchange it only if necessary. "
    },
    "url": "https://gameknot.com/annotation.pl/short-but-dense?gm=58038",
    "gameName": "Short but dense",
    "players": "A guy from here  vs. damalfi ",
    "opening": "Scandinavian defence (B01)"
}