{
    "moves": {
        "1. e4 c5": "I played this game in a mini-tournament where all games started with the Sicilian Defence, 1.e4 c5. This can allow me to familiarise myself with this opening.\n\nThe purpose of the annotation is for myself to analyse my own game, and hopefully get some feedback from my team members.\n\nAfter the opening moves (based on game database), I will comment on almost every move, in order to allow some of our team's teachers to see my reasoning throughout the game.",
        "2. Bc4": "2.Bc4 is not a very common move it seems. Maybe the opponent is trying to take me out of book as soon as possible. I will follow examples from the Games Database to make sure I play a correct opening.",
        "2... e6 3. Nf3 Nc6 4. a3": "4.a3 and we're already \"out of database\" (on Gameknot in \"World\" setting). Looks like White may consider b4 at some point. If the move is meant as anti-Knight strategy, I don't think this was necessary here.",
        "4... Nf6 5. d3 d5 6. exd5 exd5 7. Qe2+": "7.Qe2+ brings out the Queen with check, but I can undo it by developing my dark squared bishop, after which I can castle.\n\nWhite played this move before moving away his bishop on c4. Maybe the idea was to make a forcing move and gain time and at the same time develop the Queen. But now my ambition is to castle and play Re8, putting the Rook in front of White's Queen.",
        "7... Be7 8. Bb5": "8.Bb5 pins my Knight. I'm about to castle, but since my Rook is going to travel to e8, I must be mindful of variations in which my c-Knight is required to move.",
        "8... O-O 9. Bxc6": "9.Bxc6 I'm not sure why White exchanges. There are certainly similar positions where this happens. Since exchanges should always have a point, I'm guessing White's point is to create a doubled pawn on the c-file and then attack it.\n\nI now have the bishop pair (and will be keeping it until the end of the game).",
        "9... bxc6 10. h3": "10.h3 Another move that doesn't immediately seem necessary to me. Of course it gives space to the King after castling. And it takes away g4 from my Knight and light squared bishop. Maybe White is avoiding a pin on his Knight.\n\nI would have castled.",
        "10... Re8": "10...Re8 puts my Rook on the open e-file, and in front of the White Queen (and King).",
        "11. O-O Rb8": "11...Rb8 is the last move that I found in games with a similar setup. It makes sense to me. It places my second rook on the open b-file, and makes the b-pawn a possible target. White must now make sure to defend it before moving his bishop.",
        "12. Re1 h6": "12...h6 The reason for this move was probably to prevent Bg5 followed by Bxf6. In that case, I would prefer to recapture with the Bishop, but I was concerned of my back rank.\nMaybe I could have developed my light squared bishop (on c8), thus connecting my Rook on b8 with the Queen and other Rook.\nI know moves like h3/h6 and a3/a6 can make sense, but I often feel like they make me lose time.",
        "13. Qd2": "13.Qd2 takes away the Queen from the e-file. Obviously safer for the Queen, but it blocks the ds-bishop, and maybe White should have moved the Queen to d2 in the first place instead of 7.Qe2+ earlier.\n\nMaybe White plans on manoeuvring on the Queen-side. This move does support b4, if White is going to attack my doubled pawn(s). But White's bishop can't join the fight.\n\nI'm a little concerned about the e5-square. It looks like White's knight has access to it, supported by its rook. ",
        "13... Bd6": "13.Bd6 was played to support the e5 square (now covered by both the rook and bishop). The bishop also keeps supporting c5.",
        "14. Rxe8+ Qxe8": "14...Qxe8\nI prefer taking with the Queen, so my Knight stays on f6. This also keeps control of the open file, and e5.",
        "15. b3": "15.b3 looks like White is going to develop his bishop to b2, where it will be very active.\n\nHere I don't remember all the variations I looked at, but my plan against Bb2 was to play d4, in order to somewhat limit the reach of White's bishop. However, White can challenge d4 with c3, and his Knight also covers the d4-square.\n\nTherefore my plan is to exchange Knights",
        "15... Nd7": "15...Nd7 in view of Ne5. ",
        "16. Bb2": "16.Bb2 is what I anticipated. The bishop there is a monster, eyeing g7. It reigns over the a1-h8 diagonal. Hence ...",
        "16... d4": "16...d4, hoping to block the White bishop.",
        "17. Qd1": "17.Qd1 White is making room for is other Knight on d2. This will counter my hope of not having a Knight on f3.",
        "17... Ne5": "17...Ne5 playing what I wanted to play.",
        "18. Nbd2": "18.Nbd2 thus supporting the other Knight",
        "18... Be6": "18...Be6 I had been wanting to develop my bishop. I also looked at Bf5 during the game.\n\nOn e6 it does block my Queen. I can't remember which variation I was looking at, which made me choose Be6. I hope to be able to bring the bishop to d5 later on.",
        "19. Ne4": "19.Ne4 White posts a Knight on e4, attacking my bishop on d6.\n\nI don't want to move my bishop. I could play a defensive move like Qd7.\n\nBut I was just reading Jeremy Silman's chapter on \"Macho Chess\" and \"Bowing to panic\", where he tells us to play the move you want to play. So I felt compelled to try something more aggressive.\nHere I reasoned that I could play Nxf3, Qxf3, Bd5 which would pin the Knight on e4. Then my bishop would be where I wanted, and I can play a defensive move later, if necessary.",
        "19... Nxf3+": "19.Nxf3+ check, and White \"must\" take back with the Queen.",
        "20. Qxf3 Be5": "20. Be5? This is why I should comment all my games every move. I played this move, having forgotten my plan of Bd5. This move throws away my pawn on c5.\n\nI'm sure I was calculating variations where this move would prove to be useful, but I failed to see my hanging c5 pawn. \n\nUp to this point, I felt I had been playing rather OK against a better rated player, but this was just bad.",
        "21. Nxc5": "21.Nxc5 and I only saw my error after White played his move ...",
        "21... Bd5": "21...Bd5 trying to retain my bishop pair. I know one pawn down isn't always game over. Hopefully I'll be able to put pressure on White's kingside.\n\nIf I chase the Knight away, my c-pawn could still support d4.\n\nOne move I was considering was a5. My Queenside looks a bit messy, but my central bishop pair does still cover many squares all over the board.",
        "22. Ne4": "22.Ne4? this looks like a present. White is moving the Knight into a pin, so now I can attack it. f5 is not possible yet, so I'll play g6 first.\n\nMaybe White feared being out of squares for the Knight in case of an attack. Black would have been able to attack the Knight with Rb5 and Qe7. White could defend with b5, but I think after a5 by Black, this defence doesn't hold out.\n\nNa4 would have been ugly ...",
        "22... g6": "22.g6 I feel guilty moving away my King's defences, but I'm hoping this will drive the Knight back, and it takes away some more squares on the Kingside.\n\nThe computer also points out that I totally missed the Knight fork on f6: Nf6+, Bxf6, Qxf6. I must have benefited from White concentrating on his Queen?",
        "23. b4": "23.b4 I would have understood this move one move ago. Now I'm not sure what it does. Maybe once again making space for the Knight via Nd2-Nb3 to attack d4, but the Knight is going to be lost.\n\nWhite should have moved his Queen to unpin his Knight.",
        "23... f5": "23...f5 is the reason I had played g6 earlier. Attacking the pinned Knight.",
        "24. Qe2": "24.Qe2 is one move too late.",
        "24... fxe4": "24.fxe4 I take the material will I can",
        "25. dxe4 Be6": "25...Be6 Although my material advantage is rather limited in mathematical terms, I do have the bishop pair, while White just has more pawns, and its bishop on b2 is still being blocked by my d4.",
        "26. Qd2": "26.Qd2 attacking both d4 and h6. Looks like I'm going to lose the material advantage, but I still believe my bishop pair should give me better chances now.",
        "26... Kh7": "26...Kh7 to support my pawns. I didn't like the idea of Qxh6, leaving me with an isolated g-pawn to defend, and the enemy Queen deep into my territory. \n\nThen I preferred losing my d-pawn. Since White will take that with his dsb, I'll exchange bishops, taking away White's piece that would otherwise become way too active.",
        "27. f4": "27.f4 driving back my bishop. It is being relegated to performing defensive tasks ...",
        "27... Bg7": "27...Bg7 to avoid having to move it again after e5. Maybe Bc7 and Bb6 would have been a better plan.\n\nMy bishop pair isn't looking very fearsome. They're not really doing that much.",
        "28. e5": "28.e5 now really locks away my bishop on g7. It can't go anywhere now. Here I really regretted not going to c7.\n\nMy pawn on d4 shold still fall, and I really need to improve my position. ",
        "28... Rd8": "28...Rd8 White gave me the time to play this move. I believe he should have taken my pawn, but I guess he wanted to retain his bishop and not risk the exchange.\n\nNow if the bishop takes on d4, it will be pinned.",
        "29. Qd3": "29.Qd3 not sure what this does for White?",
        "29... Bf5": "29...Bf5 This feels quite natural. The White Queen moved to a square where it could easily be chased, and my ls-bishop looks less silly now. It attacks c2.",
        "30. Qd2": "30.Qd2 still keeping the Queen on the same file as my Rook. I have a feeling White has made too many inaccurate Queen moves.\n\nIn my opinion White should have taken the d4-pawn, and then move his Queen to e3.\n\nNow he has made 2 moves and is still on d2.",
        "30... d3": "30...d3 this \"wins\" my pawn back, in the sense that I'm not losing it anymore.",
        "31. cxd3 Rxd3": "31...Rxd3 and suddenly my position looks much healthier. My Rook looks quite powerful.\n\nI must now find a job for my Queen as well. She's not doing anything at all.",
        "32. Qe1": "32.Qe1 yet another Queen move",
        "32... Qd7": "32...Qd7, part of my plan to finally get my Queen into play, while still covering my pawns on c6 and a7.",
        "33. g4": "33.g4 White is doing everything possible to reduce my bishop's influence. I'll need another 2 moves to go to d5. White is getting an impressive presence on the kingside.",
        "33... Bxg4": "33...Bxg4 So I lost my patience, and tossed away my bishop. Thinking that after axg4, Qxg4+ I'd finally have my Queen and Rook in an attacking position, and if White makes a mistake I could even have a mate threat.. If not, I'd still have a possibility to attack the two remaining white pawns, and things should still work out well in the endgame.\n\nI'd also almost certainly get the opportunity to check White's king and take it's bishop at some point.",
        "34. Qh4": "34.Qh4 White seems to dislike the scenario's after axg4.",
        "34... Rxh3": "34.Rxh3 and now White must move the Queen away again.",
        "35. Qf2 Qd5": "35...Qd5 threatening mate on h1. The alternative was Rf3 to start attacking the pawn on f4.\n\nQd5 seems more forcing, and gives White the possibility to blunder his Queen away with Kf1. It didn't happen, but would have been nice.\n\nNow White will need to exchange Queens, and I'll still take the pawns and win the endgame.",
        "36. Qg2 Qxg2+ 37. Kxg2 Rf3 38. Rf1 Rxf1 39. Kxf1 g5 40. fxg5 h5 41. Kg2 Kg6 42. Bd4 a6 43. Kg3 Kxg5 44. a4 Kf5 45. a5 Bxe5+ 46. Bxe5 Kxe5": ""
    },
    "url": "https://gameknot.com/annotation.pl/sicily-there-we-go?gm=62470",
    "gameName": "Sicily, there we go",
    "players": "big-mac (1578) vs. picadily (1520)",
    "opening": "Sicilian defence (B20)"
}