{
    "moves": {
        "1. e4": "Big departure! As White Al is a Qp man, dyed in the wool. Here he's just indulging me my Sicilian because he's a nice guy. ...Not! He just wants to show me he can beat me \"in my own house,\" as it were.  :-D",
        "1... c5 2. c3": "The Alapin variation. It takes Black out of the usual lines like the Najdorf and Dragon, and is a positional treatment as opposed to an overtly tactical one. As long as the second player doesn't go out of his mind against it during the opening, the Alapin doesn't offer any particular danger to Black. In fact, my personal opinion of the Alapin is that it's sorta the \"Petrov\" of White's options against 1. ...c5. (Oooooh! Ouch! I know all you Alapin players out there hated hearing that!)",
        "2... d5 3. Bd3": "!? -- This is the slightly eccentric coinage of Danny Kopec, an American Master most active during the late 1970s and 80s. The general idea is to turn the Sicilian into something more positionally akin to a Ruy Lopez/Spanish.",
        "3... Nf6": "!? -- chessgames.com gives only one example-game (played in 2003) for this move (and that came by transposition), which Black won. I didn't know about it at the time Al and I played. And in any case after 4. e5 in that game, Black played 4. ...Ng4. I played 4. ...Ne4, daring White to trade his good Bishop for my Knight. ",
        "4. e5 Ne4 5. f3 c4 6. Bc2 Nc5 7. d4 cxd3 e.p. 8. Bxd3 Nc6 9. f4 h5": "The game has already taken on a very independent character. The text move is to impede the K-side pawnstorm that you'd have to be nuts not to see coming. The downside (or is it?) is that Black virtually telegraphs his intention to keep his King in the center or castle long.",
        "10. Nf3 Bg4 11. O-O h4 12. h3 Bxf3 13. Qxf3 e6 14. Bc2": "?! -- Al is perhaps already feeling a little uncomfortable: this sort of rough-and-tumble semi-open position is much more to my liking than his. Still, in my opinion the text is the correct move.",
        "14... Nd7": "?! -- The idea is to get the Knight away from the threat of 15. b4, gaining a tempo for White. However, 14. ...Qb6+! hath its charm, with Black grabbing a tempo of his own since White can't answer with Be3 because of ...Qb2, attacking both the QR and KB, one of which would have to go bye-bye. ",
        "15. Be3": "! -- Fooey! No second chance for Black!\n\nAn additional observation here: White would LOVE to push a pawn to f5 in this position. But obviously the evil consequence of ...Nde5 makes that move impractical at the moment. Still, it's a strategy much to be lusted after. The thing is, can White find a way to carry out this plan before Black nullifies the weakness on the f-file?",
        "15... Bc5 16. Nd2 Qb6": "We now see why ...Qb6 earlier was at least somewhat preferable to 14. ...Nd7: should Black capture on b2 it's only White's KB (and the c-pawn) under threat instead of two pieces.",
        "17. Bxc5 Qxc5+ 18. Kh2 Nd4": "! - Nasty, nasty - Black forks White's Q and B, and if 19. cd4 Qc2 then White doesn't get to play Rc1 because the Knight and b-pawn are both hanging.",
        "19. Qd3 Nxc2": "Gobbling up that LSB; now making the push to f5 is a bit less meaningful for White and a bit easier to defend against for Black.",
        "20. Qxc2 Rc8 21. Nb3 Qe3": "(?) ...or more likely ?!",
        "22. Rae1": "?! -- After 22. Rf3 Black has no choice but to retreat back to b6. *Then* White can play 23. f5!",
        "22... Qg3+": "\"Box.\" ...For those of you who don't know, that's Informant-speak for \"only move,\" (i.e. the 'only move,' out of all the possibilities on the board, that's meaningful).",
        "23. Kh1 Rh6 24. Qf2": "And now 24. Rf3 is impossible because of 24. ...Qe1.",
        "24... Qxf2 25. Rxf2 Nc5 26. Nxc5 Rxc5": "With no open files for either side's Rooks to exploit, the position is somewhat unclear at the moment, and essentially level.",
        "27. f5 a5 28. Ref1 Rc7 29. fxe6 Rxe6 30. Rf2f4 Rxe5 31. Rxh4 Rce7 32. Rh8+ Kd7 33. Ra8 b6 34. Rd1 Re5e1+ 35. Rxe1 Rxe1+ 36. Kh2 Rb1 37. Ra7+ Ke6 38. b3 Rc1 39. Ra6 Rxc3 40. Rxb6+ Ke5 41. Rb5 Ke4": "!? -- Black is going for the brass ring, banking that he will either Queen the pawn or win White's Rook.",
        "42. Rxa5 d4 43. Ra7 d3 44. Re7+ Kd4 45. Rxf7 d2 46. Rxg7 Ke3 47. Rd7 Rd3": "! -- That's game. Black's King has options, finding shelter from checks at b2 or a3, or heading toward the K-side to slow the advance of White's pawns there.",
        "48. Re7+ Kf4 49. g3+ Kf5 50. Rf7+ Kg6 51. Rf1 d1=Q 52. Rxd1 Rxd1 53. a4 Rb1 54. h4 Rxb3 55. Kh3 Ra3 56. Kg4 Rxa4+ 57. Kh3 Kf5": "Had White's pawns all been connected, endgame theory says he wins easily ...a \"matter of technique.\" But since the pawns weren't connected the endgame was hopeless. White resigns."
    },
    "url": "https://gameknot.com/annotation.pl/sicilian-alapin-kopec-variation?gm=47675",
    "gameName": "Sicilian (Alapin-Kopec variation)",
    "players": "Alfreedom (1200) vs. Avocet (1200)",
    "opening": "Sicilian (B22), Alapin's variation (2.c3)"
}