{
    "moves": {
        "1. e4 c5": "Sicilian defense so far!",
        "2. Ne2": "Here's a strange reply, Nf3 would have been better. The idea is to reposition the knight on g3 so that it can defend the e4 pawn allowing c3 - d4 advance, but his just loses a tempo!",
        "2... Nc6 3. Ng3 g6 4. Be2 Bg7": "Now black took complete control of the d4 and e5 squares, this is due to the loss of a tempo by the white with his knight moving twice in the opening, a general guidline that's usually true is not to move a piece twice in the opening unless you have to!",
        "5. O-O e6": "Preparing fot the advance d5, and freeing the e7 square for the knight so that it doesn't block the powerful fianchettoed bishop!",
        "6. c3 Nge7 7. d3 O-O 8. Bg5": "An apparent pin, but there was better moves, Be3! gains a tempo by forcing black to protect his lonely pawn!",
        "8... d6 9. Nd2 h6 10. Be3 b6 11. Bf3 Bb7 12. Qc1": "Another bad move, this move is only for an easily countered threat of wining a pawn after Nc4 - Bxh6 if black couldn't see the obvious threat. Qe2 would have been better, clearing the way for rooks!",
        "12... Kh7": "Clearly, black is alert and is secruing his h pawn!",
        "13. Re1 Ne5": "Good move, threatens Nxd3 wining a pawn and the exchange, that's another reason for why the whites 12th move was bad, white is forced to either lose his bishop for a knight or losing a tempo!",
        "14. Be2 f5": "Black starts the assult on the castled king, this move also threats f4 wining  a piece for a pawn",
        "15. f4": "White is trying to counter attack but with this move he has to lose one of his bishops for a knight.",
        "15... Ng4 16. Nc4": "Protecting the bishop twice for Bxg4 would have half-opened the f-file for the black!",
        "16... Nxe3 17. Qxe3 fxe4": "black opens the f-file forcefully and launces a central attack, black has an overwhelming advantage and soon he'll demonstrate how to use the advantage to its maximum!",
        "18. dxe4 d5 19. exd5 Nxd5 20. Qe4 Rb8 21. Bd3": "A blunder, white has a hopless position now, and he shouldn't have tried to counter-attack, becuase black has a beautiful response to the Qxg6  threat.",
        "21... Nxf4": "Excellent move, the best in this position, black wins a pawn initially and a whole piece in the next move!",
        "22. Qe3 Nxd3 23. Red1": "attemping to regain his piece! ",
        "23... Qd5": "Excellent move, threatens Qg2# and freeing the back rank for the rooks, and attacking the unproteced knight on c4!",
        "24. Ne4": "Another blunder that loses yet another piece, white attempts to stop the mate threat and win his piece back, but make the worst move possible move to accomplish that!",
        "24... Qxe4 25. Qxe4 Bxe4": "And black has a huge material advantage, two pieces and a pawn ahead has an easily won game, white has nothing but to resign or wait for the inevitable mate, he chooses to stop the slaughter immediately!\r\nThis was a beautiful game, white played really bad and commited many mistakes and 2 or 3 major blunders, but black was very good and exploited those errors soundly and eventually won the game!"
    },
    "url": "https://gameknot.com/annotation.pl/sicilian-when-white-do-many-mistakes?gm=7590",
    "gameName": "Sicilian - when white do many mistakes!",
    "players": "jazzvanna (1721) vs. fareh2007 (1748)",
    "opening": "Sicilian (B20), Keres variation (2.Ne2)"
}