{
    "moves": {
        "1. e4": "One true statement about e4 games is: One blunder can be your downfall ",
        "1... c5": "Sicilian",
        "2. c3": "And with my rather timid pawn move I start the Alapin variation of the Sicilian. By playing this move you can avoid a lot of theory and long memorize lines. White can dictate the game to his liking. unlike the open Sicilian where you can play into blacks' pet line. Great players like Kasparov and Ponomariov have used the Alapin variation. Although Kasparov always played a delayed Alapin's",
        "2... Nc6": "Main line Sicilian. Here black can play anti-Alapin moves by 2...Nf6 or 2...d5 gaining the initiative. Also this can transpose into the French opening via 2...e6; 3. d4...d5",
        "3. d4": "The point of playing 2.c3",
        "3... cxd4 4. cxd4 d6": "!? Still playing into a Sicilian setup: Dragon, Scheveningen, Kan?",
        "5. d5": "Now I gain the initiative! Black has to respond to my move. Notice I am dictating the nature of the game. Now I am not going to lie; I found this move on gameknot.com database.",
        "5... Ne5 6. Nc3": "I felt it was more important to develop a minor piece than chasing the knight with pawns and preserving the move pawn f4. Also Bishop b5  and possibly trading light squared bishops is not to my taste.",
        "6... a6": "Restricting my bishop",
        "7. f4 Ng6 8. a4": "I did not black to play b5",
        "8... e6 9. dxe6 fxe6": "Forced, If he had played Bxp I would win material with pawn fork on f5",
        "10. Bc4": "I was not sure how to continue my development but I was preparing to castle king side.",
        "10... Nf6": "Now black play for a small combination by Nf6xe; NxN and then play d5 forking my two minor pieces. I do not know if he knew of this but I responded with...",
        "11. Qd3": "I restrict his counter play yet again. Do you see how?",
        "11... Be7 12. Ba2": "Best",
        "12... O-O 13. Nf3 Nh5": "Triple attacking my f pawn!",
        "14. g3": "I Have so far restricted his counter play three times! If view the whole game, his pieces never penetrate into my territory !",
        "14... b6 15. Nd4": "Double attacking his e pawn",
        "15... Rf6 16. f5": "Maybe I should have castle here?",
        "16... Ne5 17. Qe2 g6 18. Nxe6": "A pawn up and preparing a discovered check combination!",
        "18... Bxe6 19. Bxe6+ Kh8 20. Bd5": "I did not want him having the chance to double my pawns on the e file.",
        "20... Ra7 21. g4 Ng7": "hah! His knight stays there for awhile!",
        "22. Be3": "Some of you folks might be saying why not play g5?  Then if he retreats his rook play f6 forking his minor pieces. And to tell you why I did not play this is because, I was scared. This could be the crossroads of the mighty and the meek players. But if you view it like I do I believe I played cautious. I thought I would open his cramp position. Please, if you will, evaluate and elaborate your thoughts on this position.",
        "22... Rf8 23. O-O": "avoiding check",
        "23... Nd7 24. a5": "I play to have a very favorably endgame and the point of my Be3 move.",
        "24... Qc7 25. axb6 Nxb6 26. Rxa6": "Another pawn up!",
        "26... Rxa6 27. Qxa6 Nd7": "And here I was unsure how to continue my game. As I was annotating this game maybe Qc6 had more of a punch.",
        "28. Ne2": "I was going to try to fork his queen and rook via Nf4-e6, what a dubious motive. Also I going to play rook c1 or b1 preparing to push the passed pawn.",
        "28... Nf6": "Now he starts his counter play",
        "29. h3 Nxd5 30. exd5": "At least he has a inactive bishop",
        "30... gxf5": "Yet again, I was unsure how to continue my winning game.",
        "31. b4": "anything better?",
        "31... fxg4 32. Rxf8+ Bxf8 33. hxg4 Qd7": "uh oh",
        "34. Qc4 Qe8": "He is starting to have some counter play",
        "35. Qf4 Kg8 36. Ng3": "restricting his counter play",
        "36... Qa8 37. Qd4 Qe8 38. b5": "?? And one move can be your down fall. Yes folks I made this move.",
        "38... Qxb5 39. Ne4 Qe2": "Man his queen turn quite vicious!",
        "40. Nf6+": "You will see that this move pay off!",
        "40... Kh8": "His only move!",
        "41. Bh6 Qe5 42. Qf2": "Nope...nope... nope I sure did not want to trade queens yet.",
        "42... Be7 43. g5": "I do not know what I was thinking. But I did know that his pieces had little counter play!",
        "43... Nf5": "And here I seen mate via back rank",
        "44. Nh5 Nxh6 45. gxh6 Qxh5": "AND ONE MOVE CAN BE YOUR DOWN FALL ",
        "46. Qb2+": "Black resign"
    },
    "url": "https://gameknot.com/annotation.pl/sicilian-alapin-how-i-nearly-lost?gm=17323",
    "gameName": "Sicilian, Alapin: How I nearly lost",
    "players": "freeman8201 (1588) vs. basil73 (1638)",
    "opening": "Sicilian (B22), Alapin's variation (2.c3)"
}