{
    "moves": {
        "1. e4 c5": "Sicilian Defense. \n",
        "2. d3 Nc6 3. Nf3 Nd4 4. Nxd4 cxd4 5. Nd2 d5 6. Be2": "Black is beginning to stack her pawns in the center of the board. Bad way to start a game. \n",
        "6... e5 7. O-O Be6": "Not sure what she's up to here. It does nothing but protect the pawn (which was already protected by the Queen). Otherwise, the Bishop doesn't gain any advantage from that move. The Queen's side of the home rank is looking increasingly empty and undefended, while the King's Knight, Bishop, and Rook are still undeveloped. \n",
        "8. Nb3": "Getting my knight into the open field and opening up the diagonal for my Queen's Bishop. \n",
        "8... Bd6": "Another ineffective attempt to develop a Bishop. Her pieces are now stacked in the middle of the board, but not really controlling any territory. \n",
        "9. exd5 Bxd5 10. c3 Bc7": "Really unsure what that retreat is supposed to do. \n",
        "11. c4 Be6 12. Nc5 Rb8 13. Qa4+ Bd7 14. Nxd7 Qxd7": "Given her weak position, it probably would have been best for me to trade Queens at this point. Not only would it have been a blow to her material, but she'd lose time moving the King out of a position of relative safety:  15. QxQd7+ KxQd7 \n",
        "15. Qb4": "Instead, I chicken out and try to keep my Queen. \n",
        "15... Bd6 16. c5 Be7 17. Bf4": "Really not sure what I was trying to accomplish here, unless it was just to open up the e file so that I could ultimately pin the Bishop to e7 with my Rook. \n",
        "17... exf4 18. Bf3 b6 19. cxb6": "Stupidest possible move on my part. She could have practically ended the game right here with 19 ... BxQb4.",
        "19... Rxb6": "Instead of wiping out my Queen, which is the most prominent threat to her right now, she decided to go for my pawn. Even though it was edging over to her home rank, there was little, if any chance that I would promote it.\n",
        "20. Qc4": "Saved from my own stupidity. I've spent way too much time greedily trying to protect my Queen this game. That trade looks even better right now. \n",
        "20... Rc6": "She dooms herself with this move, which essentially gives away her Rook and makes mate inevitable. \n",
        "21. Bxc6": "The queen is now pinned in place. She can't move, or else she'll put the king in check. The most agressive move she can make from here is 22. ...   QxBc6, but that's just a trade of the Queen for the Bishop, resulting in 23. QxQc6+ After that, Black's King has virtually no place to go, because he's then trapped on the home rank. At this point, Black resigned. \n"
    },
    "url": "https://gameknot.com/annotation.pl/sicilian-pieces-http-gameknot-com-chess-pl-bd-15557401?gm=37822",
    "gameName": "Sicilian Pieces, http://gameknot.com/chess.pl?bd=15557401",
    "players": "chrishall (1181) vs. stephanievw (1117)",
    "opening": "Sicilian defence (B20)"
}