{
    "moves": {
        "1. e4 c5 2. Nf3 d6 3. d4 cxd4 4. Nxd4 Nf6 5. Nc3": "Common book moves  the opening.  White could have considered 5.f3 but it send the message of  s castling queenside to Black.",
        "5... a6": "In turn Black had a few options  5...e6 for a purer Scheveningen, but it allows for the Keres Attack 6.g4 h6 7.h4 Be7 8.Qf3 and White is defending his Rook and creating a pawn storm.\n5...g6 6...Bg7  Dragon variation,\n",
        "6. Be2 e6 7. Bg5 Be7": "White choosing a quieter positional opening.  For the moment 7.Bg5 makes Black'smove 7..Be7 for it.\nBlack is now considering Qa5/Qb6 as White's DSB had made a commitment to g5.",
        "8. Qd2 Nc6 9. Nf3": "9.Nf3  not a vitalmove from White, surely loses a tempo.  In post-mortem White said he didn't want exchange ...Nxd4,Qxd4 with vulnerable Queen or Nxc6, bxc6  with a strengthened Black central pawns.\nI think if this is a concern,put the white Bishop e3or so what Queen will be attacked after Qxd4.\nBut sometimes 'Peace-of-Mind' (Piece-of-Mind) is a great value in chess or it may conceal weaknesses in a position.",
        "9... Qc7": "Instead Black chooses the long-term approach.",
        "10. O-O O-O": "White said he choose kingside castling because he felt Black had too much activity on the Queenside. ",
        "11. Rfe1 Rd8": "Black said he moved here to keep White thinking of any future pawn moves.",
        "12. a3 b5": "White was worried about Nb4 but Black hadn't considered it.  But thought White wanted to prepare Bc4 and then have shelter from attack on the a2-h7 diagonal so was happy for the extra tempo. To both create queenside activity and a place for his LSB.",
        "13. Bd3 Bb7 14. Qe2 Ng4": "There may have been a better move  14....d5  but Black saw a way of dealing with a few positonal threats (Bg5 and Bd3) and equalising the game.  e5 square becomes the centre of activity. ",
        "15. Bxe7 Qxe7": "First an exchange.  White thought ...Nxe7 and then ...f5 was a difficult position for White.",
        "16. Rad1": "White rightly gains some advantage.",
        "16... Nce5": "With nopiece under attack,Black pushes from the back.  If h3 then NxNf3+ ",
        "17. Nxe5 Nxe5 18. f4": "f4 was always coming.",
        "18... Nxd3 19. Rxd3": "I think black has given too much away. White's remaining pieces are tucked in behind two nice pawns.",
        "19... Rac8 20. Red1 Ba8": "Black starts to show the lack of space is getting to him.  He wanted to send check with Qa7.  20...Rc7 to prepare against Whites next move would have been Better.",
        "21. Qd2 Rc6": "Now Black's pieces are starting to be uncoordinated. ",
        "22. Ne2": "White described this move as his best move of the game.",
        "22... h6 23. e5 Qa7+ 24. Kh1": "Black gets his Qa7+.  there was nothing wrong with Kf1, protects the f2 square and good for the endgame, if there was going to be one.\n\nBlack saw the Qf2 move, but felt there was nothing more could come of it.  It does pin the knight, discovered checkmate if White doesn't make the right move. In  post-mortem if 24....Qf2, 25 Rf3 Qc5 26. Nf3.  There maybe something more there.",
        "24... d5": "But Black went for shoring up the one side of the board.",
        "25. Nd4 Rc4 26. Rg3": "Alarm bells should start ringing with Black.",
        "26... Rdc8 27. f5": "White slowly increases the pressure",
        "27... exf5": "Black needed to bite the bullet and lose the exchange for a pawn. 27.  RxNd4 28.QxRd4 QxQd4 29.RxQd4 and then exf5 as it's more of a threat.\n",
        "28. Qxh6": "White reinforces his many threats.",
        "28... Kf8 29. Qxg7+ Ke8 30. c3 Rc8c7 31. Rh3 Rxd4 32. Rh8+ Ke7": "Kd7 would keep it alive a little longer.",
        "33. Qf6+ Kd7 34. Qd6#": "I hope you enjoyed the game and the post-mortem thoughts."
    },
    "url": "https://gameknot.com/annotation.pl/sicillian-scheveningen-otb?gm=47480",
    "gameName": "Sicillian Scheveningen  OTB",
    "players": "Player A  vs. Liam1260 ",
    "opening": "Sicilian (B92), Najdorf, Opovcensky variation"
}