{
    "moves": {
        "1. e4 c5": "Sicilian",
        "2. d4 cxd4 3. c3 d3 4. Nf3 d6 5. Bxd3 Nf6": "Not a good position for black, I guess. white has four pieces out against 2 for black",
        "6. O-O g6 7. Bg5 Bg7 8. Nbd2 O-O 9. Qc2": "joining the rooks and aiming at the king",
        "9... Nc6": "Black develop toward the center",
        "10. Rfe1 a6 11. Rad1": "to occupy the semi open file",
        "11... Bg4 12. h3": "Chasing the bishop",
        "12... Be6 13. Bc4": "Controlling the center",
        "13... Bd7 14. b4": "Developping on the queen side",
        "14... Qc8": "Danger on white kingside (if 15. ... Bxh3 ; 16. gxh3 Qxh3 - menace Ng4 or Qg4+",
        "15. Bf1": "To prevent black's attack on the kingside",
        "15... Nxb4": "I oversaw this move",
        "16. Qb3": "To chase the knight",
        "16... Nc6": "Now, black has a material advantage, white's pawn structure is inferior (the a and c pawns are unsupported), white is a bit stronger in the center but black only needs one move (e5) to regain the control.White pieces are more mobile.\nWhite plan is to exchange the weak c pawn against black stronger d pawn but for that, white has to prevent black to control the center and/or attack on the queenside",
        "17. Rdb1": "Menacing b7 and occupying the semi open file b ",
        "17... Rb8": "Menacing the queen",
        "18. Rec1": "to enable the c pawn to advance",
        "18... Be6 19. Qa3": "aiming at d6, which will be an important square in a couple of moves (see white's plan on annotation - move 16.)",
        "19... h6 20. Bf4": "d6 is the aim",
        "20... Nd7 21. Bh2": "To protect the DSB which will be an important piece and carrying on menacing d6",
        "21... Nde5 22. c4": "One tempo, the c pawn has to advance",
        "22... Nxf3+ 23. Nxf3": "The knight is as well placed here than on the d2 square",
        "23... Qd7 24. Rcd1": "Occuying the semi open file. Having a rook on the c file is not important any longer as the c pawn is not under immediate menace and the white queen will protect it on c5",
        "24... Qc7": "Black loses one tempo",
        "25. c5": "No immediate threat, the priority is advance tne c pawn",
        "25... Qa5 26. Qxa5": "Trading the queen, the black knight will be far on side",
        "26... Nxa5 27. cxd6": "White situation is getting better :\nmaterial equality, white is more powerfull on the center, both kings are safe (the white king is even a bit safer as black advanced 2 king pawn (g and h)",
        "27... Bxa2": "Mistake, beginning a couple of trading moves with black's advantage as result",
        "28. dxe7 Bxb1 29. Bxb8 Bxe4 30. Rd8 Nc6 31. exf8=Q+ Bxf8 32. Re8 Nxb8 33. Rxb8": "White has a winning game",
        "33... Kg7 34. Ne5": "From now on, black tries to get a draw but doesn't succeed",
        "34... Bd6 35. Re8 h5 36. Nc4 Bc6 37. Nxd6 Bxe8 38. Nxe8+ Kf8 39. Nd6 b5 40. g3 Ke7 41. Ne4 f5 42. Nc5 a5 43. Bxb5 Kf6 44. Nb7 g5 45. Nxa5 h4 46. Be2 hxg3 47. fxg3 Kg6 48. Nc4 Kf6 49. Kf2 Kg6 50. Ke3 Kf6 51. Kd4 Ke6 52. Ne3 Kf6 53. Kd5 f4 54. gxf4 gxf4 55. Ng4+ Kg5 56. Bf1 Kh4 57. Ke4 Kg3 58. Nf2 f3 59. Ke3 Kh4 60. Kxf3 Kh5 61. Kg3 Kh6 62. Kg4": ""
    },
    "url": "https://gameknot.com/annotation.pl/sicilian-smith-mora-g-w?gm=48760",
    "gameName": "Sicilian . Smith Mora G. (W)",
    "players": "ptitroque (1656) vs. gopackwin (1725)",
    "opening": "Sicilian (B21), Smith-Morra gambit"
}