{
    "moves": {
        "1. e4": "While going trough the Gameknot Game DB, checking out lines in the Sicilian, I came across this game. I think it's an exciting game with some good attacking  and tactical play.\n",
        "1... c5 2. Nf3 a6": "The O'Kelly or Paulsen variation.",
        "3. d4 cxd4 4. Nxd4 e5": "Compare this with the position after 2...Nc6 3.d4 cxd4 4.Nxd4 Nf6 5.Nc3 d6, another typical variation in the Sicilian.  You'll notice that the bishop on f8 now has more freedom to move.  And so in many variations the bishop can be placed actively on b4 or c5.  \n",
        "5. Nf3 Nc6 6. Bc4": "Fischer's favorite move.\n",
        "6... Nf6 7. Ng5": "Attacking square f7.\n",
        "7... d5": "Black sacrifices a pawn, making way for the bishop on c8.\n",
        "8. Bxd5": "This is where the players leave the Game DB. The continuation 8.exd5 Nd4 9.c3 gave white the advantage in 'cormac (1600) vs. homunculi (1604) 1-0' and 'elmewi (1762) vs. ilpo (1637) 1-0' (Gameknot)\n",
        "8... Nxd5": "Black now has the bishop pair.\n",
        "9. exd5": "Better then taking with the queen, because 9.Qxd5 Qxd5 10.exd5 Nd4 gives black a better position.\n",
        "9... Nb4 10. c4": "?? Defends the pawn, but gives away the advantage. 10.a3!? Qxd5 11.axb4 Bxb4  12.c3 Qxg2 13.Qf3 Qxf3 14.Nxf3 and white is obviously better. (10....Nxd5 11.Nc3! gives white an edge because of threats like 12.Qxd8  Kxg8 13.Nxf7 )\n",
        "10... Bf5": "! Now black is winning. Attacking squares c2 and d3 simultaneously.\n",
        "11. Na3": "If white tries 11.0-0?, then 11...Nc2 would give black serious advantage.\n",
        "11... Nd3+": "A nasty check. The king must move and loses his right to castle.  At the same time, square f2 has become vulnerable to attacks since only the king is defending it.\n",
        "12. Kf1 Qb6": "?? Unfortunately not the best move here.  Ofcourse black is threatening mate on f2, but too bad he missed this perfect opportunity to play 12....Bc5!, because black is simply winning after 13.Qf3 Qf6.\n",
        "13. Qa4+": "! With this check white can just save himself. The bishop on f5 is lured away.\n",
        "13... Bd7": "Let's not forget white still has a mate threat to defend now. So the queen must move again.\n",
        "14. Qc2": "Only move. The position is about equal again.\n",
        "14... Nxc1 15. Rxc1 Bc5": "At last...the bishop goes to it's destined square, though it has lost some of it's potential now the knight on d3 is gone.\n",
        "16. Re1": "It might be tempting to play 16.Nxh7? but 16...Qh6 17.Re1 f6 wins for black. (Not 17.Qxh7?! because 18.Rxe5  Kf8 19.Qxh7 Rxh7 20.Nxb1 wins for white.) \n",
        "16... f6": "The next move came as quite a surprise to me!\n",
        "17. Nxh7": "?? A crazy move! White basically sacrifices his knight here, instead of playing 17.Ne4 wich would have saved the game. But it's all part of a deep strategical combination, as we'll see. Did he calculate all the variations? I don't think so as we'll soon find out.\n",
        "17... Kf7": "Black must defend the pawn on f6 if he wants to move his pawn to g6. ( Note that black has a 'won' position, but ofcourse converting this into a full point isn't allways so easy.)\n",
        "18. Rb1": "Intending to play b4.\n",
        "18... g6": "This move traps the knight, but also makes it possible for the light squared bishop to got to f5. The only question is whether black should do so....  \n\nFritz is not impressed and suggests 18...a5!, stopping b4, which should be enough to win.\n",
        "19. b4": "White decides to give the exchange! In return he get's a killer passed pawn. \n",
        "19... Bf5": "? This is an important move of this game. I think black falls for the trap here. The simple 19...Bd4 would have won for black here (with something like 20.c5 Qd8). Did ultra-man go for the sacrifice on h7 knowing black couldn't resist this 19th move?\n",
        "20. bxc5": "Only move.\n",
        "20... Qxb1+ 21. Qxb1": "Not 21.Nxb1?? Bxc2 22.Nxf6 Kxf6 and black wins.\n",
        "21... Bxb1 22. Nxb1 Rxh7": "White has a knight and two pawns for the rook, so amazingly, material is even. But ofcourse white is planning an advance of his pawns on the queenside and this proves to be fatal for black. \n",
        "23. Nd2": "Note that in general the presence of a pair of enemy rooks is favourable for a passed pawn, especially if the enemy king can be kept at a distance, whereas the presence of minor pieces is rather devaluating.   So the ideal situation would be Rook, Minor piece and passed pawn(s) against two Rooks. As we can see, white achieved this with a cunning combination starting with 17.Nxh7! \n",
        "23... Rh4": "The immediate 23...Rc8!? was essential here. (24.Ne4 Ke7.)\n",
        "24. Ke2": "Finally the rook on h1 gets activated.\n",
        "24... Rc8 25. Rb1 Rc7": "Black could have tried 25...Rxc5 26.Rxb7  Kf8 27.a4 Rxh2 28.g3 but I still favour white's position.\n",
        "26. h3 f5 27. Rb6": "White is now planning to move his pawn to c6.\n",
        "27... Rh8": "? Loses almost instantly. 27...Rxc5 still looks playable, with something like 28.Rxb7  Ke8. \n",
        "28. Nf3": "The knight is on it's way to g5.\n",
        "28... g5": "?? A blunder in a bad position. Notice how 28...Re8 29.Ng5  Kg7 is also winning for white.\n",
        "29. Nxg5+": "Black is lost.\n",
        "29... Ke8 30. Ne6": "30...Rc-h7 won't help black, because of 31.c6 bxc6 32.Rxc6.\n",
        "30... Re7": "And now the move white has been preparing....\n",
        "31. c6": "! This pawn can't be taken.\n",
        "31... bxc6": "?\n",
        "32. Rb8+": "Ofcourse 32...Kf7 33.Rxh8 cxd5 34.cxd5 leaves black with a hopeless position so: 1-0. A very instructive game where white is eventually rewarded for his courage. Good work, ultra-man!\n"
    },
    "url": "https://gameknot.com/annotation.pl/sicilian-defence?gm=18527",
    "gameName": "Sicilian Defence!",
    "players": "ultra-man (1735) vs. jobser (1830)",
    "opening": "Sicilian (B28), O'Kelly variation"
}