{
    "moves": {
        "1. e4 c5 2. Nf3 d6 3. Bb5+": "I don't know what this Sicilian is called. Not the most common I think.",
        "3... Bd7 4. Bxd7+ Qxd7 5. O-O Nc6 6. c3 Nf6 7. Re1 g6": "I'm not sure this move was so great.",
        "8. d4 cxd4 9. cxd4 Bg7 10. Nc3 O-O 11. Bg5 e6 12. Qc1": "I suppose he was trying to eliminate my dark squared bishop and weaken my kingside defence, but I think Qd2 might have been better.",
        "12... d5": "Not sure this isn't a bad move, but I don't have much time on my hands since I'm studying now and I just went with it.",
        "13. e5 Ne8 14. Bh6 Ne7 15. Bxg7 Nxg7 16. Qh6 Ngf5": "I just wanted a strong knight on f5.",
        "17. Qd2 Kg7 18. g4": "Maybe this is a good move, maybe not.",
        "18... Nh6 19. Qg5 f6": "Not sure about this move either.",
        "20. exf6+ Rxf6 21. Ne5 Qe8": "Didn't want to allow the knight to go to b5. At the same time, I wanted to exchange my h6 knight for his e5 knight and thought that after exchanging knights on f7, by recapturing on f7 with my queen, I'd gain some initiative or momentum or whatever.",
        "22. Qh4 Nf7 23. g5 Rf5 24. Nxf7 Qxf7": "I liked this for black. Maybe I was wrong. Somebody prove me wrong if you can.",
        "25. Nb5 Rf4 26. Qh6+ Kg8 27. Nc7": "Not loving this move for white. Might have been the biggest mistake of the game.",
        "27... Rg4+": "After this, I don't think white stands a chance. ",
        "28. Kf1": "If 28. Kh1 Qf3#",
        "28... Rf8": "Could have played Qf3, but thought this was more forcing.",
        "29. Re2": "I expected this and knew this wasn't a good enough defence, but I don't really think there was any good defence.",
        "29... Qf3": "After this, I thought he'd resign. But he didn't.",
        "30. Ke1 Rxd4": "Maybe there were better moves, but I found this the most crushing. Any moves other than Qxf8 and Qh3 lead to quick checkmates. Maybe even Qg7+ stops a quick checkmate as well. I did not see/consider Qxf8 and Qg7 as viable options for him since they would mean surrendering his queen and/or resigning.",
        "31. Qxf8+": "I actually didn't see this, and thought for a while on this move. I was a bit stunned to see that he hadn't resigned and it was my turn to move, since I had set conditional moves which led to checkmate for every single move he could make, except this one and Qh3. I also did not see Qg7+, which might not be as good as Qxf8 but it saves his king from getting mated as well.",
        "31... Kxf8": "If 31. ...Qxf8 32. Nxe6 and we'll be even in material, or close to it. ",
        "32. Nxe6+ Kf7": "Kg7 fails to protect my knight after Nxd4, Ke8 pins my knight.",
        "33. Nxd4 Qh1+ 34. Kd2 Qxa1 35. Ke3": "After moving his king, he resigned."
    },
    "url": "https://gameknot.com/annotation.pl/sicilian-defence-canal-sokolsky-attack-moscow-variation?gm=49744",
    "gameName": "Sicilian defence (Canal-Sokolsky Attack / Moscow Variation)",
    "players": "alira22 (1729) vs. rickypr18 (1789)",
    "opening": "Sicilian (B52), Canal-Sokolsky attack, Bronstein gambit"
}