{
    "moves": {
        "1. d4": "Alright, I wanted to annotate more games, but I haven't found a good game to annotate. This game is played against a much lower rated player, but the game is interesting.",
        "1... e5": "?? e5. This move is only good if you know what the main line is. If you don't know the main line, then don't play this move. Best is simply take it with dxe5 but it leads to an interesting game. 2dxe5 Nc6 3 Nf3 Qe7 . Now this is where it is debatable if white should play Bf4 or not. Because 4 Bf4 Qb4+ which attacks both the undefended bishop and b2 but if white knows how to play this line he should simply play 5Bd2 Qxb2. It is now really tempting to play Bc3 but this is a losing blunder as black will respond with Bb4! so white should play Nc6 and white is now more developed and can exploit the open b-file by himself and will have a relative easy game. ",
        "2. c3": "But white doesn't take on e5 and wants to play a normal opening. I think d5 is better here. Also note if white played e4, the game is the same as 1 e4 e5 2 d4 which is a much more common opening game.",
        "2... e4": "Pushing through to give white a harder time to develop, and black has more control in the game.",
        "3. e3": "This move blocks the bsb but its not a bad move as its a certain kind of opening. I know a player that likes to play in this position as white, he plays a lot of blitz and wins a lot too. Its some kind of french I believe.",
        "3... d5": "Getting more control of the center, more support for e4 and allows the lsb to be developed.",
        "4. Ne2": "White already has trouble developping as it now would take another move (move the knight or the g pawn) to develop the bishop.",
        "4... Bg4": "Im pinning the knight to give white an even harder time to develop",
        "5. h3 Be6": "I place the bishop on e6 because I believe white will try to attack the d-pawn one way or another and this gives black more support. Looking at it now I'm not sure if this is the best move, probably Bd7 would be good too.",
        "6. Nf4": "White decides to move the knight to develop the bishop rather than move the g-pawn. Because h3 has been played, g3 makes the kingside weak.",
        "6... Bd6": "I decide not to defend my lsb because an open f-file would be good for me.",
        "7. Nxe6": "But white wants me to have an open f file in exchange for doubled pawns. White also has the bishop pair.",
        "7... fxe6 8. Qg4": "White sees weakness in my game and plays Qg4 to attack e6.",
        "8... Qf6": "The best way to defend e6 and the first piece is placed on the f file.",
        "9. b4": "White decides to attack on the queenside. ",
        "9... Nh6": "develops the knight. I like this move better than Ne7 because it attacks the queen with tempo. I can also play Nf7 after Qh5+.",
        "10. Qe2 O-O": "I now have full power on the f-file.",
        "11. Na3 a6": "the b5 square is a very good square for white since both the queen and the knight can move there. So I decided to play this move.",
        "12. b5": "White surprised me with this. I think its a good move but also allows some weakness on the queen side.",
        "12... axb5": "I now lost control of the b5 square but I couldn't find a better move. This also attacks the knight.",
        "13. Nxb5 Nf5": "I decide to play dangerous. White could play g4 here, and I would have replied with Nh4 to have a really active thread on the kingside since the f3 square will also be weak. ",
        "14. c4": "another move that surprised me.",
        "14... c5": "I was looking some time and found this the best reply. I'm not sure if this or the next move was the time that I really found a good plan to win. ",
        "15. Ba3": "Puts more pressure on c5 but I analised the game and I found some really cool moves. Do you see it? ",
        "15... cxd4": "!! cxd4 This doesn't lose a piece. I've analised this a lot and I always came up winning. But white didn't see it.",
        "16. Nxd6": "White takes the piece",
        "16... Nxd6": "I take back, now white has a serious problem! ",
        "17. Bxd6": "But white still doesn't see it",
        "17... d3": "!! atacks the queen and the rook on a1 ",
        "18. Qd2": "Qd1? Qxf2#",
        "18... Qxa1+": "as planned.",
        "19. Qd1": "The only 'good' move, as the other move Qc1 would just give it away.",
        "19... d2+": "I had an idea, this wins material.",
        "20. Kxd2": "If 20 Ke2 Rxf2+! and loses the queen",
        "20... Qxa2+": "If I played Rxa2 then Ke1 and there isn't much pressure anymore. Also if I played Rxf2+ then white would play Be2.",
        "21. Ke1": "White chose the wrong square but is lost anyway, even after Kc1.",
        "21... Qxf2#": "Note that black's rook on f8 was attacked by the bishop for 4 moves. I hoped you liked the game!"
    },
    "url": "https://gameknot.com/annotation.pl/sidsidsids-super-super-fast?gm=45718",
    "gameName": "sidsidsid's super super fast",
    "players": "nessie2012 (1314) vs. schakertje (1680)",
    "opening": "Queen's pawn (A40), Charlick (Englund) gambit"
}