{
    "moves": {
        "1. e4": "After four years, I have gone back to playing 1. e4, and am rediscovering the beauty of attacking play rather than the positional play of my beloved Reti/English.  This game features a Four Knights Sicilian with a direct kingside attack.",
        "1... c5 2. Nf3 Nc6": "FYI for the novices, other 2nd moves for Black are 2...e6, 2...d6, and my personal favorite, 2...g6.",
        "3. d4": "I was toying with the idea of 3 Bb5, however, the reason I switched back to 1. e4 was to more fully explore the open positions in order to further my development as an attacking player.",
        "3... cxd4 4. Nxd4 Nf6": "3...g6 is the Accelerated Dragon, my main line in the Sicilian.",
        "5. Nc3 e6": "A conservative positional approach by Black.  5...e5 is the sharp Shveshnikov variation, where, as an English player, exploiting the weak d5-square is second nature.",
        "6. a3": "This position is similar to the Symmetrical English where White plays an early d4, although White would have a pawn on c4.  In the English lines, White doesnt waste time with a3, as the weak doubled pawns on c4 and c3 are compensated by control over d5 and d4.  Here the doubled pawns would be on c2 and b3, so I don't want to allow that.",
        "6... Be7": "6...Bc5 might slow the White kingside pawn storm, as after 0-0, I would have to take time out for Kh1 before playing f4.",
        "7. Be2": "I decide to adopt the classical setup, no need to try to blow Black off the board.  He is playing solidly and I decide to show a healthy respect for his solid position.",
        "7... O-O 8. O-O a6": "Prophylaxis!  Keeping the d-knight out of b5 where it forces Black's hand in the center.",
        "9. Be3 Re8": "Making room for the Bishop on f8, to guard the kingside.  Black is playing ultra-defensive.  Another reminder, the best defense is a good offense.  Black needs to break with b5 or start preparing d5 for some much needed counterplay.",
        "10. f4": "The only logical move.  I am going for a direct attack against the Black monarch.",
        "10... d6": "A perfectly reasonable plan, the Hedgehog type setup is fine here, however, Black never really has a chance to get the queenside play rolling and I start preparing my attack with...",
        "11. Qe1": "A standard plan to transfer my queen to the kingside to start the direct assault.",
        "11... Nxd4": "Also typical, the side with less space exchanges a set of pieces to ease the defensive task.",
        "12. Bxd4 b5": "A good start!!",
        "13. Qg3 Bf8": "Black is looking good, if a bit passive.  White has a slight advantage due to his space advantage and his attacking chances.",
        "14. Rad1": "Simple chess.  Taking time out to activate the entire army.",
        "14... Bb7": "Black's play is very solid.  A typical plan to assail the weak e4-pawn, slows my attack.",
        "15. Bf3 Nd7": "This move is questionable.  The standard plan in the hedgehog is to play ...g6 and ...Bg7.  Now my attack races forward.",
        "16. f5 exf5": "16...e5 is better, but White still has the advantage as Black has the only real structural weaknesses on d5 and d6, and his pieces are less active.  Still, he has counter chances on the queenside.",
        "17. exf5 Bxf3 18. Rxf3 Ne5 19. Rf2": "Still retaining the option of doubling on the f-file if necessary.",
        "19... Nc4": "I wanted to play 20. Bxg7 really bad here, however, Black has a nice defensive resource in 20...Re3!! 21. Qg4 h5!, with advantage to Black.",
        "20. Nd5": "Not only defends the b-pawn, but Bxg7 is in the cards.",
        "20... Rc8": "Double question mark, as Black loses his queen or is mated.  However, I dont see a defense to White landing a piece on f6 with devastating effect.",
        "21. Bxg7": "The fatal breach.",
        "21... Bxg7 22. f6": "Black resigns as he loses the queen or is mated.  Thanks to my opponent who put up a good fight."
    },
    "url": "https://gameknot.com/annotation.pl/silhouet2003s-mini-tournament?gm=1435",
    "gameName": "silhouet2003's mini-tournament",
    "players": "mybookrunsdeep (1946) vs. vicit (1711)",
    "opening": "Sicilian (B33), Pelikan (Lasker/Sveshnikov) variation"
}