{
    "moves": {
        "1. d4": "This time my opponent opened with the d-pawn, which frequently leads to closed games.\n",
        "1... d5": "I am not really familiar yet with the hypermodern defences that occur when playing the Indian Defence 1... Nf6, so I choose to simply control the center by maintaining symmetry. It's quite interesting that only 25% of the games (according to the GameKnot 'World' database) in this opening are won by Black! White wins in 39% of all archived games and the other 34% are drawn.\n",
        "2. c4": "Offering the popular Queen's Gambit.\n",
        "2... e6": "I seldom accept gambits that I haven't studied before, so I decline with the 'Orthodox Defence' of the QGD. Accepting (2... dxc4) is not considered to be risky and the 'gambit' isn't even a true material sacrifice at all, because Black won't retain his pawn for long anyway, but nevertheless I prefer to decline.\n",
        "3. cxd5 exd5": "After this pawn exchange, the statistical White win, Black win and draw chances are totally equal in the GameKnot 'World' database (33% each).\n",
        "4. Nc3 Nf6": "Just simple development moves for both sides. I'm planning to castle kingside.\n",
        "5. Nf3 Bb4": "First I wanted to play the passive 5... Be7, but then I thought, why not pin his knight? Of course, you have to be careful about White's potential queen check on a4.\n",
        "6. Bd2": "Okay, the pin didn't last long.\n",
        "6... O-O 7. e3": "That white-squared bishop wants to get developed.\n",
        "7... Bg4": "Let's try it on the other knight ;-) The reason I played this was because I didn't want his knight to have control over e5.\n",
        "8. Be2": "... and another pin destroyed. Somehow I feel that my bishop 'ha-knight-you-are-pinned' moves are unsound and I should have placed them on other squares. On the other hand, I can't see anything bad in it - it's just a feeling. Any comments or alternative development suggestions on that?\n",
        "8... Nbd7": "8... Nc6 came to my mind first but I thought advancing the c-pawn sooner or later - be it one step for creating a strong pawnchain on the queenside or two steps for opening up the center - could be useful, so I'd head for b6.\n",
        "9. O-O Nb6": "Protecting my center pawn once more and fancying the outpost on c4...\n",
        "10. b3": "... which he avoids immediately. However, this move enables my bishop to go to a3 which will be very useful later :)\n",
        "10... Re8": "As all of the minor pieces have been developed, I was without plan. But I thought possessing the e-file can't be wrong.\n",
        "11. Rc1": "Ah, he is interested in the c-file. Time to strengthen my queenside...\n",
        "11... c6": "... with a strong pawn-chain! This way he can't take advantage of the c-file. Also takes away the b5 square from his knight.\n",
        "12. h3": "Forcing my bishop to make a difficult decision. Take it (the knight) or leave it?\n",
        "12... Bf5": "Leave it! Bxf3 was *very* tempting at first because it avoids his knight to go the fine center square e5 by simply killing it. But keeping the pair of bishops and thus not throwing away the minor imbalances was eventually more important to me, so I possessed the b1-h7 diagonal.\n",
        "13. Ne5": "'No surprises' by Radiohead came into my mind when the opponent made this move.\n",
        "13... Nbd7": "After some thinking what to do against his well-placed knight I reasoned that my knight on the queenside isn't of any use there anyway (since White's pawn move to b3 it got out of squares!), so I use to get rid of his intruder. Besides of that, the 'Silman pawn rule' (from 'The Amateur's Mind') came into my mind; my pawns point to the kingside, so I should concentrate of that side of the board!\n",
        "14. f4 Ba3": "! I was very excited after finding this move that forces the opponents rook to fall. It would have been possible already one move ago.\n",
        "15. g4": "Okay, I have to be somewhat careful that I really win the rook for only one minor piece, not for two - my light-squared bishop and my knight on f6 both run out of squares!\n",
        "15... Bxc1": "Now or never!\n",
        "16. Bxc1": "I guess taking with the queen would have been more reasonable because it defends the knight. I have won rook for minor piece by now, but my bishop is still attacked!\n",
        "16... Ne4": "Both 16... Be6 and 16... Bg6 would be blunder, because of 17. f5! and the bishop falls. The sad thing is, even the right-looking 16... Be4 would be bad, because of 17. g5! and my knight runs out of squares. This move exploits the fact that the knight on c3 isn't defended! 16... Nxe5 would also have been a possibility, but I didn't want him to open up the f-file.\n",
        "17. Nxe4 Bxe4": "Okay, at this point I was really happy that the material winning trick worked without problems.\n",
        "18. Bf3": "He wants to get rid of my bishop and places his queen on the f-file.\n",
        "18... Nf6": "I prefer to let him initiate the exchange and place my knight on the beautiful e4 square then.\n",
        "19. Rf2 Bxf3": "After this rook move I changed my mind, because the knight goes to e4 with tempo (it attacks his rook).\n",
        "20. Qxf3 Ne4": "The knight feels very comfortable there. That move also enables my f-pawn to advance, to get rid of my opponent's knight.\n",
        "21. Rg2 f6": "Go away!\n",
        "22. Nd3 a5": "At this point I was a bit unsure what to do again, so I decided to get my pawns on the queenside going.\n",
        "23. f5": "Again surprised, more expecting 23. g5. But then I saw, this pawn moves gives his knight a nice home on e6 which could get quite unpleasant for me.\n",
        "23... Ng5": "That move was the product of fear of his knight to come to e6 _and_ the hope that his attacked queen would go to a place where it leaves the pawn h3 undefended or even to f2 where a fork would be possible (yeah, I know, utopic...).\n",
        "24. Qg3 Qe7": "I thought about going to e4 again with the knight which could possibly lead to a three-fold repetition (Black knight goes back and forth between g5 and e4 and White queen between f3 and g3), but then again... why have fear, when I'm ahead in material? I can win this game!\n",
        "25. h4": "The g5 square for the knight is now history.\n",
        "25... Ne4": "This time I sweared to myself I wouldn't leave that e4 square with the knight - there's no reason, that place is perfect.\n",
        "26. Qf3 a4": "Trying to open the a-file.\n",
        "27. b4": "I wasn't happy about this - it's typical for me to overlook simple pawn advance moves. But the good thing is, this pawn is only defended by his knight.\n",
        "27... Kf7": "I felt uncomfortable on the g-file where White's rook is and planned to defend my king's fortress properly.\n",
        "28. Nf4": "Of course, White heads for e6.\n",
        "28... Reg8 29. Ne6": "Being on the sixth rank is usually the most powerful place for a knight, but fortunately he can't do any harm there in this case.\n",
        "29... Qxb4": "Why not take a free pawn? My queen is ready to penetrate the opponents fortress.\n",
        "30. g5 Qe1+": "Forcing the queen exchange which is good for me because I am ahead of material (his bishop hangs if he doesn't place his queen in-between).\n",
        "31. Qf1 Qxf1+": "Taking the pawn on h4 instead of the queen exchange was also tempting, but it looked like the opponent could trap me with endless rook attacks between the g- and h-file then, so I wanted to be on the safe side.\n",
        "32. Kxf1 fxg5 33. hxg5 g6": "Smashing that knights support point! h7-h6 would probably also have been good. \n",
        "34. Rb2": "One last hope for my opponent...\n",
        "34... b5": "Fortunately those one-move threats are easy defend.\n",
        "35. Rc2": "Another try...\n",
        "35... Rac8": "Now White is lost, more loss of material is about to come.\n",
        "36. Ba3 Ng3+ 37. Kg2": "? This creates the perfect knight fork on e3.\n",
        "37... Nxf5": "White can't avoid more loss of material. After this move Mr. Hamarat gave up and we shook hands. Victory! Another great simultaneous exhibition in the Vienna Stadion Center. A great game where I could finally make some use of the concepts presented in Jeremy Silmans book for chess amateurs. I will also analyze it with Fritz and add some comments to the positions where some tactical shots were possible that we haven't seen. At the risk of repeating myself: feel free to comment, I'm always happy to learn from better players! One final note: the ELO rating '~2400' is probably not true for 'real on the board' chess, but probably only for correspondence chess.\n"
    },
    "url": "https://gameknot.com/annotation.pl/simultaneous-exhibition-with-tun-hamarat-at-the-vienna-stadioncenter?gm=31363",
    "gameName": "Simultaneous exhibition with Tunç Hamarat at the Vienna Stadioncenter",
    "players": "Tunç Hamarat (~2400) vs. Sebastian Falbesoner (~1500)",
    "opening": "Queen's gambit declined (D30)"
}