{
    "moves": {
        "1. d4 d5 2. Nf3 Nf6 3. c4 Bf5": "Prokofiev responds aggressively to Capa's delayed Queen's Gambit.",
        "4. Qb3 Nc6 5. Qxb7": "Capa snatches the loose QNP, leaving his Q in a dangerously exposed position.",
        "5... Na5 6. Qa6 Nxc4": "Prokofiev equalizes the material.",
        "7. Nc3 e6 8. e4": "Capablanca initiates a tactical sequence.",
        "8... dxe4 9. Bxc4": "Instead of routinely maintaining material equality with 9 NxP, Capa plays for the sacrificial attack.",
        "9... exf3 10. Qc6+": "Pressing onwards. Prokofiev must defend carefully.",
        "10... Nd7 11. g4": "Driving the muscial maestro into retreat.",
        "11... Bg6 12. Bg5 Be7 13. Bxe7": "Forcing a decision. 13... QxB would maintain the possibility of castling, but the pin on Black's Knight would remain in place.",
        "13... Kxe7": "Prokofiev chooses to free the Knight, at the cost of leaving his K in the center.",
        "14. O-O-O Re8 15. h4": "Capablanca's attack is still going strong. Prokofiev's only edge is his Pawn plus.",
        "15... h5": "Creating a space for his B and limiting Capablanca's K-side expansion.",
        "16. gxh5 Bxh5 17. Nb5": "Switching the pressure to the Q-side.",
        "17... Kf8 18. d5 Qf6": "A bid for freedom.",
        "19. dxe6 Ne5 20. Qc5+": "Capablanca has regained the Pawn and is still pressuring strongly.",
        "20... Kg8 21. exf7+ Bxf7 22. Bxf7+ Qxf7": "Prokofiev has relieved some of the pressure on his position, but Capa still has a slight edge.",
        "23. Kb1 Rab8 24. Nxc7 Rbc8": "Countering the attack on the Rook with a pin. But in the scuffle, it is now Capablanca who is up a Pawn.",
        "25. Rdc1 Re7 26. Qd6": "With the position so complex, Prokofiev is willing to simplify even with a Pawn minus so as to avoid tactical traps.",
        "26... Rexc7": "Capablanca could maintain material equality with the simplifying line 27 QxN RxR ch 28 RxR RxR ch 29 KxR QxP, and Prokofiev's Pawns, particularly the one at KB6, would be very vulnerable in the ensuing queen-and-pawn end game. However, he chooses to maintian the tension instead, playing for the win in the middle game.",
        "27. Rxc7 Qxc7": "Now the Knight is defended, and the material advantage has passed back to the musician.",
        "28. Qe6+ Kh8 29. a3 Qc2+": "Prokofiev hasn't abandoned his own attacking plans.",
        "30. Ka1 Nd3": "Threatening ...QxNP mate!",
        "31. Rb1 Nxf2": "Creating an advanced passed Pawn.",
        "32. h5 Qc6": "Prokofiev now can simplify with advantage. Capablanca cannot afford to exchange Queens.",
        "33. Qf5 Ne4 34. Qxf3 Nd2": "Forking the Q and R, and forcing the exchange of Q's. ",
        "35. Qxc6 Rxc6 36. Rd1 Rc2": "We're down to skin and bones, and with a piece up, Prokofiev just has to not blunder away the game.",
        "37. Rg1 Rc5 38. Rg6 Rxh5 39. Ra6 Nb3+": "Preparing another tactical finesse.",
        "40. Ka2 Ra5 41. Rxa5 Nxa5": "Capablanca's last piece falls, and it's all over but the shouting.",
        "42. b4 g5": "The King is not in the \"square\", and the Pawn will become a Queen. Capablanca cannot stop the promotion.",
        "43. Kb2 g4": "Capablanca resigns. Well done by the master musician."
    },
    "url": "https://gameknot.com/annotation.pl/simultaneous-exhibition-st-petersburg-1914?gm=35897",
    "gameName": "Simultaneous Exhibition, St. Petersburg 1914",
    "players": "Jose R. Capablanca  vs. Sergei Prokofiev ",
    "opening": "Queen's pawn game (D02)"
}