{
    "moves": {
        "1. e4": "This is also Nathan's most common opening.",
        "1... c5": "And, I also answer with my favorite.",
        "2. d4": "I, generally, anticipate 2.Nf3 with the idea of turning it into a Nadjorf Sicilian.  But, Nathan plays this first.",
        "2... cxd4": "I take right away, but it's not to win an additional pawn, just yet.  Instead, I'm trying to turn it into something like the Nadjorf Sicilian.  But, a better try would've been 2...d6, and then if Nathan takes, I take back, transposing it into what I'm most used to which starts off with 1.e4 c5 2.Nf3 d6 3.d4 cxd4  And, I say transpose because I think that this is the same position, but if it isn't, then it's certainly turning it into something similar.  ",
        "3. Nf3": "Meanwhile, Nathan focuses on development, and he mentions that once our game is finished, so it's important to keep that in mind here.",
        "3... Nc6": "Meanwhile, I have the same idea.",
        "4. Bc4": "Continuing with that and bringing his LSB in a great spot since there is a little pressure on the f7 pawn, which is something important to keep in mind since he mentions that in the very end.",
        "4... e5": "Meanwhile, I'm, somewhat, fixated, on trying to compromise and put a little pressure on Nathan's position.  As this opens up a strong line for my Bf8, and it stops his e4 from advancing further.  Of course, he could still do it, and I'd take with my Nf3, but I felt that this move still limits his mobility because of what might happen, after exchanging on e5. ",
        "5. c3": "Nathan tries to exchange pawns.",
        "5... dxc3": "Which I accept right away.  I thought about what might happen, if I let him take first, and I wasn't comfortable with where it would lead me.  But, slightly better would've been to continue developing by bringing my Bf8 into play or playing 5...Nf6.  My anticipation was that he would take back with his b2 pawn, but he capture with his N, which is better.  First, his pawns will remain well connected which I didn't want.  Second, it'll leave him ahead in development, as I only have one piece out, but with his next move, development will almost be complete.",
        "6. Nxc3 Bb4": "Doing what I can to catch up on development, I pin which works.  But, against Nathan, it's almost too late, and he's already slightly better off.  That's not to mention that things will get better for him, as he's about to castle.",
        "7. O-O Na5": "?! So, I start getting aggressive and figured that Nathan's forced to lose tempo since I go after his B.  But, better was to continue developing with 7...Nf3  As Nathan is about to sac on f7, and similar to TA's blitz Q sac, this I'm already in trouble after 8.Bxf7+, as he mentioned.",
        "8. Bxf7+ Kxf7": "The reason being is that, not only have I lost castling rights, but my K is already exposed since the weakest, most critical pawn, has been removed from the board.",
        "9. Nxe5+": "And, Nathan takes advantage of that with a series of checks, until he can force a mating sequence.",
        "9... Ke6 10. Qd5+ Ke7 11. Qf7+ Kd6 12. Nb5+ Kxe5": "?? But, this loses instantly.  Much better then taking with 12...Kxe5, was 12...Kc5 It would've been very difficult for Nathan to win.  But, in about 10-12 moves, he still would've had a mating sequence, as we went through a sequence of variations.  And, this runner told me that mate couldn't have been completely avoided, all in all.",
        "13. Qf5#": "Right after this game, I flat out asked Nathan where I went wrong, keeping in mind that it followed the Supplemental Talking the Talk rules. \n\nAnd, this runner implied something that Michael posted in Eric's most recent annotations, \"We shouldn't be trifling about material when we have a position this strong.\" That's because Nathan said that, in general, when I'm way ahead like this, (a R up) I don't need to get fixated on winning more pawns. Instead, I should focus on other things, like tempo, development, center control, and King safety. Taking these pawns hindered my development, and 8.Bxf7+ actually gave him an edge, despite losing a piece because just like with TA he also sacs on f7 since that's where my K is, potentially exposed. \n\nThis rang an important bell to me because it's part of pattern recognition. As deeper-insight gives up a Q for pawn starting with 1.e4 e5 2.Qh5 Nf6 3.Qxf7+ Kxf7 And, despite being down a Q for P, he wins because his opponents overlook the importance of keeping the K safe. As noted, this is also how I remembered what to do when the opponent played the Domiano's Defense with Nxe5 because of what happens after ...fxe5??, whereas before, after 1.e4 e5 2.Nf3 f6?!, I always played 3.Nc3, and kept forgetting about the best move. \n\nSo, this moral is also pattern recognition since Nathan mentioned the importance of the same thing, as it felt just like what I studied with Joe. You shouldn't forget about the other things, even when being ahead. "
    },
    "url": "https://gameknot.com/annotation.pl/simultaneous-match-otb-wtw-coaching-game?gm=65828",
    "gameName": "Simultaneous Match-OTB WTW Coaching Game",
    "players": "Nathan (2320 Fide) vs. Joe ",
    "opening": "Sicilian (B21), Andreaschek gambit"
}