{
    "moves": {
        "1. e4 e5 2. Qf3 Nf6": "Not sure what to call white's opening. He's evidently hunting my pawn at f7, but I doubt that sound opening principles include early development of the queen. 2. ... Nf6 keeps the queen away from the f7 pawn.",
        "3. Nc3 c6": "Covering d5, both so I can advance my d-pawn and to keep white from playing his knight there.",
        "4. g4 d5": "Maybe 4. ... g5 would have been safer, to keep white from chasing away my knight at f6. But I figured if I could dominate the center, white's bishop won't be able to support his queen's attack on my f7 pawn.",
        "5. exd5 cxd5 6. Bh3 e4": "Time to chase white's queen a little, make him regret her early deployment. At least a little.",
        "7. Qg2 Nc6 8. g5 Bxh3": "Not really sure why I traded bishops here. It looks like a bad move. If 9. Qxh3, black's knight on f6 has nowhere to run except back home on g8. If 9. ... Nd7, 10 Nxd5 gains white a pawn. I didn't analyze this any further because white let me off the hook.",
        "9. Nxh3 Nh5 10. O-O Nd4": "That pawn on c2 has nowhere to go.",
        "11. d3 Nxc2": "Pxd3 would have opened up the e-file for white's rook aimed right at my king. Seemed risky, so I decided against it. Besides, the knight at c2 keeps his rook off of e1 for a while (he must save his rook on a1. The tempo I gain while white saves that rook lets black gain a pawn here, though doubled isolated pawns on the d-file aren't very strong unless I can liquidate all the white pieces before he grabs them.",
        "12. Rb1 exd3": "It's only the illusion of gaining material, since d5 is sure to fall.",
        "13. Nxd5 Bc5 14. Qe4+ Kf8": "I guess that isolated pawn was every bit as weak as I thought it was.",
        "15. Qxd3 Nd4": "Blocking white's queen from her defense of the knight on d5. I expected white to retreat the knight, or possibly even play 16. Nh3-f4. I was secretly hoping for 16. Ne3?? Nf3 ! to win white's queen.",
        "16. Be3 Qxd5": "I didn't expect a free knight. And better still, my prospects of Nf3  are still alive.",
        "17. Rbd1 Rd8": "Sustaining the possibility of Nf6 .",
        "18. g6 Nf3+": "Wow. White didn't see it coming. It's only worth a rook now, but still a sweet move. After 19. Kh1! Qxd3, 20. Rxd3 Rxd3, 21. Bxc5  and black is up a full rook.",
        "19. Kg2 Nh4+": "And now white makes his last mistake. Evidently he thought 19.Kg2 lets him take the black Knight after black exchanges queens and takes the white rook. But black has a much more sinister plan: Mate in 2 that begins with a doublecheck.",
        "20. Kg1 Qg2#": "What a strange position for an ending. 3 knights stuck on the same edge of the board, white is checkmated but he has a 1-move mate of his own with Qxd8  , and white's advanced pawn looks pretty strange up there all alone too. All in all, a strange final position."
    },
    "url": "https://gameknot.com/annotation.pl/sinister-plans?gm=20847",
    "gameName": "Sinister Plans",
    "players": "jmbr (1224) vs. blake84120 (1396)",
    "opening": "KP (C20), Napoleon's opening"
}