{
    "moves": {
        "1. e4": "My opponent had white pieces and started with e4.",
        "1... e6 2. d4 d5": "After e6, d4, d5 we have french defence. ",
        "3. Bd3": "The variation played by white is called the Schlechter variation.\n",
        "3... Nf6 4. e5 Nfd7": "After Nf6, e5, Nfd7 was play, this position reminds me of Steinitz variation, but instead the knight on c3, white has the bishop on d3 ",
        "5. Qg4": "Qg4, At the first glance, I thought this move is weird, why would white develop the queen so early in the opening? (I'm not sure if this is the main line) then I had a good look, realized that this move is not bad, because it stops me from developing my dsb, the queen also is now defending d4 and I can't really chase her away successfully, h5 would weaken my kingside. ",
        "5... c5": "C5, I decided to play solid opening, this is the most reasonable move in the position, attacking white center immediately, with the intention to play Nc6 or Qb6 next.",
        "6. c3": "C3 maintains the pawn chain, which is the best move.",
        "6... Nc6": "Nc6 adding more pressure to white's center. ",
        "7. Ne2": "Ne2 was play, this allows white to play f4 in the future, also that his queen would not be short on squares. ",
        "7... cxd4 8. cxd4 Nb4": "After the tension between the pawns was resolved Nb4 was played, trying to trade off white's lsb. ",
        "9. Qg3": "Qg3, the bishop has no place to go, so it has to be protected. ",
        "9... Nxd3+": "Nxd3+, finally I got rid of the pesky bishop, which was aiming at my king side. ",
        "10. Qxd3 Bb4+": "Bb4+ The queen is no longer attacking g7, this allows me to develop my bishop with check.",
        "11. Nbc3 O-O": "Simply castling king side, safety first.",
        "12. Bd2": "Bd2 unpinning ",
        "12... f6": "f6 undermines white's center with the idea to open up f file. ",
        "13. f4": "f4 defending the center. ",
        "13... fxe5 14. fxe5": "F file is now opened up, white can not castle king side. ",
        "14... Nb6": "Nb6, the knight was not doing anything on d7, now it's going to c4, which would be an excellent square. ",
        "15. a3 Bxc3": "I had a proper look at Be7, but I didn't like it, because white would gain initiative, so I took the knight.",
        "16. Bxc3": "I think Nxc3 would be better, because after this move, white's bishop is now blocked by his own pawn.",
        "16... Qg5": "I found this good move, Qg5, not only attacks the g2 pawn, but also stops white from castling queen side.",
        "17. Ng3": "White protects the g2 pawn with Ng3, maybe Qg3 could be played try to trade queens. His king is now exposed in the center. ",
        "17... Bd7": "Bd7, trying to get the lsb involved. ",
        "18. Bd2": "Bd2 was played, attacking the queen and gaining some initiative.",
        "18... Qh4": "my queen would be useless on e7 or d8, so Qh4 was played, keeping the queen active.  ",
        "19. Be3": "Not sure why this move was played, surely castle queen side would be better, this move invites me to play Nc4",
        "19... Nc4": "Nc4 forking the bishop and the b pawn. ",
        "20. Bf2": "Bf2 preserves the bishop, maybe planning to play some discovered attack on my queen. ",
        "20... Qf4": "I think Nxb2 would be better, but I wanted to protect my queen first.",
        "21. O-O": "white's king is now safe. ",
        "21... Rf7": "Planning to double the rooks on f file.",
        "22. b3": "B3 attacks my knight. Nb6 would throw my knight out of the game, so I have to find a move better than Nb6.",
        "22... Qd2": "Qd2 was play, if white trades queens in this position after Nxd2 white would be in trouble.",
        "23. Qb1": "He avoided the queen trade. ",
        "23... Na5": "Na5 provokes white to play b4. ",
        "24. Ra2": "Ra2 reasonable move, chasing my queen away.",
        "24... Qg5 25. Re2 Bb5": "Bb5 skewers the rooks, but I overlooked Be3.",
        "26. Be3 Rxf1+": "Rxf1+ was played first, I was hoping white to recapture with his queen, if that happens, I would play Qg6 moving the queen out of the harm's way first and then capture the rook on e2.",
        "27. Nxf1": "White wisely recaptured with knight.",
        "27... Qe7": "Qe7 was played, attacking white's a pawn.",
        "28. Ra2 Rf8": "Rf8 reoccupies the open file and adding pressure to the knight.",
        "29. Nd2": "Nd2, getting out of the attack and protecting f1 square.",
        "29... Qh4": "I noticed that white's back rank is weak, so I played Qh4, if white moved his queen away from defending his back rank, Qe1 check would be troublesome for black.",
        "30. a4 Ba6": "I played Ba6 then immediately regretted playing it.",
        "31. b4": "yes because of this move, I thought I was in trouble and would lose a piece. ",
        "31... Bc4": "I played Bc4, well at least I can get a rook for knight and bishop, but then I remembered that white still have the back rank problem, after bxa5, Bxa2, the queen can't recapture, because Qe1+ would be devastating. ",
        "32. Rc2": "white saw that and played Rc2, which is not an accurate move.",
        "32... Bd3": "This move pins the rook to the queen.",
        "33. bxa5 Bxc2": "Queen still can't recapture due to the same problem. ",
        "34. Qb5": "Qb5, this move was actually a blunder, but ironically I responded with a blunder move (Bxa4), I should have played Qe1+ check straight away, I thought after Qe1+ white can play Nf1, but I overlooked the move a6, which would be winning for me.",
        "34... Bxa4": "Bxa4 same threat, if queen takes bishop then Qe1+ ",
        "35. Qe2 Qd8": "Attacking white's a pawn.",
        "36. a6": "a6, hoping for bxa6",
        "36... b5": "I could not allow this pawn exchange, so b5 was played, supporting the bishop ",
        "37. Qg4": "White would obviously play Bh6 next, also white's queen is attacking my e6 pawn.",
        "37... Qc8": "I played this sneaky move, protecting e6 while aiming for Qc1+, if white plays Bh6 next, it would be game over for him.",
        "38. Bh6": "And it happened, he forgot about his back rank completely, h3 should have been played...",
        "38... Qc1+": "Qc1+ The knockout punch... There is no way out for white in this position. GG "
    },
    "url": "https://gameknot.com/annotation.pl/sir-youve-forgot-your-back-rank?gm=57481",
    "gameName": "Sir, you've forgot your back rank",
    "players": "karykash (1611) vs. superlalulalu (1587)",
    "opening": "French (C00), Schlechter variation"
}