{
    "moves": {
        "1. d4 f6": "I am not familiar with this opening against the queen's gambit. It may have merit, but it looks to me like it doesn't offer control over the center. ",
        "2. c4 c6 3. Nc3 e6": "Notice how control is now focused on the 5 line instead of the 5/4 lines. This gives white a full 33% more space with which to maneuver",
        "4. e4": "White solidifies control of the center. Pay attention to whites development options as compared to black. White can all backrow pieces except rooks and can support/defend pawns that are pushed",
        "4... Qa5": "This is most likely too early. If you bring your queen out while everyone has a lot of material on the board, not only does it reduce its effectiveness because there are fewer spaces it can threaten, but it gives the opponent a chance to threaten it. Would you make Qc7 on this turn? If no, then don't move the queen, leave her be. The queen is actually in a pretty good starting position, so long as you get the pieces around her out of the way",
        "5. Bd2": "I can develop my bishop while also putting pressure on the queen. The queen being out front is now a liability",
        "5... Qb6 6. c5": "Again a liability. Qb2 leads to trading the queen for a rook (iirc) and so full retreat is the best move. This has given white three free moves (Bd2 to threaten, c5 to threaten again, and then the next move after. Note that it also locks out blacks black bishop from moving aggressively past the front",
        "6... Qc7": "Don't be afraid of putting the piece back where it started if that is the best move. Not sure it is or not, but something to think about.",
        "7. Nf3": "More development, preparing to castle. ",
        "7... g5": "I am not sure there are better moves, but this one is particularly bad. g5 leaves f6 a weak pawn. Notice how there are no pawns behind it supporting? Once f6 falls so does g5. So i attack the f6 pawn. This also has the advantage of locking out the queen from being able to pressure on its long diagonal.",
        "8. e5 h6": "At this point i feel like the game is irrevocably won for white. Black has none of his backline developed, does not have a strong defense in the event of a king side castle, and is many moves away from a queen side. I attack the weak pawn and move my knight forward to exploit this poor defense",
        "9. exf6 Nxf6 10. Ne5 d6": "I am not sure what black can do at this point. The fork at Ng6 ensures that black cannot castle and trades a knight for a bishop in a game without strong diagonal pawn lines. Diagonal pawn lines constrain bishops in ways that don't constrain knights. So this trade is definitely in the favor of white. This move also makes e6 a weak pawn. Which will be exploited as soon as the knight is out of danger",
        "11. Ng6 Rg8 12. Nxf8 Rxf8 13. Bc4": "e6 is weak. So white develops. This lets white get his king out of the center of the board when black cannot, set up batteries, and generally exploit the fact that three of blacks pieces are doing almost nothing.",
        "13... a5 14. O-O Nbd7": "While moving to the edge is generally not preferred because knights can control so many fewer spaces from there. This move gives white a pawn for free. Its possible that black could have retained control of e6. Though there are no good moves here.",
        "15. Bxe6 dxc5 16. dxc5 Nxc5 17. Bxc8 Qxc8": "The trade looks even on points, possibly advantageous for black since it has two knights to a knight and bishop. But now blacks king is open and white simply has to hammer the advantage in.",
        "18. Be3 Ne6 19. Qe2 b5 20. Rae1": "White sets up a battery on blacks king, forcing him to move. He can move to a position where he doesn't have cover and be checked, or to a position where he does have cover. Always be cognizant of fork opportunities though, moving to the open position is better here.",
        "20... Kf7 21. Bd2 Re8 22. Ne4": "22. .. Nxe4 \n23. Qf5+ \n\nWhite wins a pawn and knight but might not mate. Failure to take it (or trade the queen)ensure white wins without a major blunder",
        "22... Ng7 23. Nd6+ Kg6 24. Qd3+ Qf5 25. Nxf5 Nxf5 26. h3 Reh8 27. g4 Nd5 28. Re6+ Kg7 29. Qxf5": ""
    },
    "url": "https://gameknot.com/annotation.pl/slow-ladder?gm=51561",
    "gameName": "Slow Ladder",
    "players": "goumindong (1566) vs. pantherone_777 (1334)",
    "opening": "Queen's pawn (A40)"
}