{
    "moves": {
        "1. e4": "I am playing black against a 1317.  He should be able to give me a good game. That rating is nothing to sneeze at.",
        "1... e5": "standard so far",
        "2. Nf3": "standard",
        "2... f5": "I decided to try a sort of kings gambit, just because I have been playing the Philador a lot lately.  I wanted to change it up.",
        "3. exf5": "White accepts the gambit.",
        "3... Nf6": "Black is now a pawn down and continues to develope.",
        "4. Nxe5": "Black is now 2 pawns down. This is a big mistake for black.  That could have been prevented.",
        "4... Qe7": "Black threatens horse which can't move.  I think they call this a \"pin\"",
        "5. Qe2": "White solves the problem",
        "5... d6": "Black threatens horse",
        "6. Ng4": "Horse runs away leaving two snarling queens face to face...  but that white horse looks vulnerable.",
        "6... Nxg4": "Black sees the mistake that white has made and captures the horse.  White queen can't take the back horse.",
        "7. Qxe7+": "White queen is so angry about the whole thing that she just wants blood.  ",
        "7... Bxe7": "Black recaptures using bishop.  Don't want to capture with king becuase then I forfit the opportunitiy to castle in the future.",
        "8. h3": "White begins to pester.",
        "8... Ne5": "Horse saves himself.",
        "9. g4": "White is developing a nice pawn chain and makes another opening for his bishop",
        "9... Nbc6": "black continues to develop",
        "10. Nc3": "standard",
        "10... Bd7 11. Nd5": "white gets aggressive. Look out for that nasty forking maneuver.",
        "11... O-O-O": "Black castles on the queen side to avoid the fork.  Also, it makes sence to castle that way because the Kings gambit destroyed the pawn protection on the king side.",
        "12. Nxe7+": "White takes bishop and makes a check.",
        "12... Nxe7": "Black recipocates and takes the white horse.  Now black has two horses and white has none.  Black is only one point ahead.",
        "13. Bg2": "white developes",
        "13... Bc6": "black takes an agressive stand.",
        "14. Bxc6": "white takes bishop.",
        "14... Ne7xc6": "black recipocates.",
        "15. d3": "white makes a hole for his other bishop",
        "15... Nd4": "Now begins the whole reason that I wanted to annotate this game.  Black begins an interesting Calvery dance.  Horses vs. King.",
        "16. Kd2": "White King sees the forking problem and solves it, although white can no longer castle.",
        "16... Nef3+": "Black gives check.",
        "17. Kc3": "King begins to take a long walk in the park.",
        "17... Ne2+": "another check",
        "18. Kb3": "king continues his stroll.",
        "18... Nfd4+": "another check",
        "19. Kc4": "king keeps walking",
        "19... d5+": "another check",
        "20. Kb4": "king is having a lovely time of it.",
        "20... Nxc2+": "a nasty forking check",
        "21. Kb3": "king dances around the dance floor.",
        "21... Nxa1+": "black takes his bounty and what is this I see: another check.",
        "22. Ka3": "King side steps.",
        "22... Nc2+": "Black horse just wants to get out of the corner, but bonus: another check.",
        "23. Kb3": "King happily bops around.",
        "23... Ncd4+": "another check.  The purpose of this one was to keep the king out in the open.  Can't slip back to his home.",
        "24. Kb4": "King is wide open for pot shots.",
        "24... b6": "First time that black did not check in a long time.  Black is setting up for more pawn checking.  White finally gives up at this point.  Can't take the abuse."
    },
    "url": "https://gameknot.com/annotation.pl/slow-ladder?gm=54959",
    "gameName": "Slow Ladder",
    "players": "harleyz (1317) vs. jutterback (1498)",
    "opening": "Latvian counter-gambit (C40)"
}