{
    "moves": {
        "1. d4": "Here are my thoughts you can do as you wish with them",
        "1... d5 2. c4 Nf6 3. Nc3 dxc4": "Black normally plays 3...e6 with a very solid game. The normal continuation is \r\n\r\n4. Nf3 Be7 followed by ...0-0 for black",
        "4. e3": "white can play e4 here but my experience has been that black can undermine the white center with ...e5 and ...c5",
        "4... c6": "??\r\n...e6 is better because your knight is better on f6. Also worht looking at for black is 4. ...a6 aiming to hold on to the extra pawn. If white is stupid enough to play \r\n\r\n5. Bxc4? e6 6. Nf3 b5! is perfect for black ",
        "5. Bxc4 e6 6. Nf3 Bb4": "developing the bishop to e7 is better because it prevents white from playing Bg5. However, Nf6 is pretty good, so in the end it all comes down to taste. ",
        "7. O-O": "I am not worried about 7. ...Bxc3 because I have a lead in development if you exchange now then you will only have one pieced developed. ",
        "7... Bxc3 8. bxc3": "Here is another game that I played that I think will be worth you looking at because I use the exact same pawn structure to win.\r\n\r\nhttp://gameknot.com/annotation.pl/queen-gambit?gm=13030",
        "8... b5": "?? This is the major cause of all your problems. It is easy to see why such a move is not that big of a deal because it drives the bishop back to d3. However, the irony is that the Bishop is better on d3 because it can support multiple attack from e4, c4, and a4. \r\n\r\nAlso please remember in the future that flank attacks like this one will never succeed if you do not have control of the centre. ",
        "9. Bd3 Nd5": "?? dont move a piece twice in the openning. You should develop your other pieces before you think about putting a knight on d5. ",
        "10. Qb3": "your attack on c3 is easily parried. Also noticed that I have defended with a purpose in that I am adding to my attack on b5 which will shortly fall when I play a4! As a result of A4 your knight on d5 will be undermined and will be forced to retreat. ",
        "10... Nd7": "this was your last chance to castle and any hope of surviving the coming on slought.",
        "11. a4": "The beginning of my attack\r\n\r\nplease notice several key factors that ensure that this attack will be decisive:\r\n\r\n1. I have clear space advantage on this side of the board. \r\n2. I have more pieces attack b5 then you have defending it. \r\n3. My king and pieces are all safe and there are no direct threats present in my position.",
        "11... b4": "this attack on the clank does deal with the threat on b5 but I own the centre so...",
        "12. e4": "! this knights days are numbered as it has no where to run",
        "12... Nf4": "?? I dont think i need to say anything. Remember as black your goal is not to create weakness. you want to play small moves that slow improve your position like Nd5b6. ",
        "13. Bxf4 bxc3 14. Bd6": "I could ahve taken the pawn but as you can see this pawn is going now where so why take it now when you can take it later. With Bd6 I have ensured that your king is in the centre. This move follows advanced rules in positional play so I totally expected this one to be a superise for you. ",
        "14... Nb6 15. Ba3 a5 16. Qxc3": "I am expecting you to play 16, ...Nxa4",
        "16... Nxa4 17. Qb3": "I am prettry sure you saw\r\n\r\n17. Qxc3? Bd7! and black is defending",
        "17... Ba6": "I saw this too and at first I was thinking of 18. Bxa6 Rxa6 19. Qxa4 which is fine for white but it help you defend c6 because rook is on a6 and you are not being forced into making any more mistakes. ",
        "18. Qxa4": "!! This is the winning idea because it forces a massive exhange of pieces. Which is what you want to do if you have a material advantage",
        "18... Bxd3 19. Qxc6+ Qd7 20. Qxd7+ Kxd7 21. Ne5+ Ke8 22. Nxd3 f5": "it is better to move your king up to d7 so that you can bring your rooks into the fight",
        "23. exf5": "the openning of the e-file will be wonderful for my rook",
        "23... exf5 24. Rfe1+ Kf7 25. Rac1": "I did see 25. Re7+ however after 25. ...Kf6 I am lacking the resoureces to force a mate so I bring the other rook into the fight. I alway make a habit of attacking with all my pieces and you should make that a habit as well. It will improve your win rate. ",
        "25... Rhd8": "Exchanging rooks in order to remove some attackers for the board is better for I.e\r\n\r\n25. ...Rhe8 26. Rxe8( 26. Rc7+ Kg8!) Rxe8 27. Rc7+ Re7 28. Rxe7 Kxe7 and I still have the win but I have to work harder for it. ",
        "26. Rc7+": "now the mate is forced",
        "26... Kg8": "The tougher defend is ...Kg6",
        "27. Ree7 Rxd4 28. Rexg7+ Kh8 29. Rgxh7+ Kg8 30. Rcg7#": "gg Bryan I hope you enjoyed playing"
    },
    "url": "https://gameknot.com/annotation.pl/slow-ladder?gm=35533",
    "gameName": "Slow Ladder",
    "players": "elyhim (2216) vs. bryan5555 (1372)",
    "opening": "QGD (D06), Marshall defence"
}