{
    "moves": {
        "1. d4 Nf6 2. c4 e5 3. dxe5 Ng4 4. Nf3 Nc6 5. Bf4 Bb4+ 6. Nc3 Qe7 7. Qd5 Qe6 8. Qxe6+ dxe6 9. h3 Bxc3+ 10. bxc3 Nh6 11. Bxh6 gxh6": "Ok, this one of the outcomes of the Budapest, if black exchanges queens on e6. Few other responses are possible. Here, both pawn's structures are bad, but white's is worse than black's.",
        "12. e4 b6": "I want to play c5, but it is not possible at the moment. This seems the best developement for black, since it is not likely to have f and e pawns removed by now. Black's bishop in b7 is not dangerous if white plays f3, but it leaves a weakness in g2. This is a result of a better pawn's structure, even if white controls most of the center. ",
        "13. Nd4": "A big mistake, since it allows...",
        "13... Nxe5 14. f4": "...but probably white thinks that this compensates for the pawn, and he is probably right. ",
        "14... Ng6 15. g3": "Probably better was f5, opening my king to the white pieces's action.",
        "15... Bb7 16. Bd3 Rg8": "Who matters about castling?",
        "17. Kf2": "Good, since g3 was in danger. ",
        "17... O-O-O": "Pinning the knight. ",
        "18. Ke3": "Defending the bishop, but leaving g3 unprotected. ",
        "18... c5": "Now I can play this, since Nb4 is not harmful. ",
        "19. Nb5 a6 20. Na3 Nh4": "If white takes the kinght, Rg6 wins back the bishop e3. ",
        "21. Rhg1": "Wise. And I have to lose a precious tempo. ",
        "21... Ng6 22. Rab1 Kc7 23. g4": "White is getting the most from his pawns, due to my inaccuracies.",
        "23... Rd7 24. Rb2 Rgd8 25. Be2": "Ok, I got something out of the situation. But I have to be creative.",
        "25... f5": "That's it. Opening the columns in of his king should be the key. ",
        "26. gxf5": "Bite taken. ",
        "26... exf5 27. exf5 Re8+ 28. Kf2 Nxf4": "Now black has a real edge, despite material is even. ",
        "29. Bf3": "Unfortunately, white blunders. ",
        "29... Nxh3+": ""
    },
    "url": "https://gameknot.com/annotation.pl/slow-with-a-touch-of-creativity?gm=45043",
    "gameName": "Slow, with a touch of creativity.",
    "players": "chaerephon  vs. damalfi ",
    "opening": "Budapest (A52), Adler variation"
}