{
    "moves": {
        "1. e4": "White opens with king pawn.",
        "1... e5": "standard stuff",
        "2. Nf3": "white threatens the black pawn.",
        "2... Nf6": "Lately I have been playing this when I have black.  It is called Petrov's defense. If you take me then I take you.",
        "3. Nc3": "White says no thanks and develops another horse while protecting the king pawn.  Now its called the Petrov three knights game (C42)",
        "3... Nc6": "Black does likewise and we have achieved perfect symmetry.  Seems like it should now be called the Petrov 4 knights game but GameKnot database does not make a distinction.",
        "4. Bb5": "White threatens to take blacks pawn protector.",
        "4... Nd4": "Black threatens the white bishop. This really goes against my training. because if white trades horses then the black pawns will be doubled and thus weaker.",
        "5. Nxd4": "As expected, white trades horses.",
        "5... exd4": "Black now has a doubled pawn which the experts say is a really bad thing but the white horse is threatened and black has hopes of getting that white king pawn.",
        "6. Ne2": "The white horse saves himself and that leaves the white pawn in trouble but it also puts the black pawn in trouble.",
        "6... c6": "Rather than taking his point, black decides to play chase the bishop.  This also goes against my grain.  It seems to me that black should do the pawn trade in order to get rid of that hated doubled pawn.",
        "7. Bd3": "Now the white pawn is protected again.  Black has lost his chance to go one point up and the black pawn is still in trouble.",
        "7... d5": "Black pushes the queen pawn.  Now the white pawn has two threats, but the leading black pawn is still in trouble.",
        "8. e5": "White smartly pushes his pawn threatening the black horse.",
        "8... Nd7": "Black horse saves himself while threatening the white pawn.  This seems familiar.",
        "9. Nxd4": "White takes his booty but allows black to do likewise.",
        "9... Nxe5": "As expected the pawn trade is executed.  So black ultimately gets his wish.  The black doubled pawn is now gone.  We just took the long road to get there. White is mildly threatened with a possible doubled pawn if black takes the white bishop.",
        "10. Qe2": "White is playing very well. The threat on the white bishop is squelched and at the same time, the black horse is pinned.  Can not move.",
        "10... Bd6": "Black protects his horse but it looks bad for black if white pushes the f pawn.",
        "11. f4": "As expected, white threatens the black horse which can not move.  Looks really bad for black.",
        "11... Bg4": "Black grasps at a straw and threatens the white queen.",
        "12. Nf3": "White block the threat.",
        "12... Bxf3": "Black decides to trade.  Its a good idea. If white uses the queen then the horse is no longer pinned.  If white uses the pawn, then white has a weaker pawn structure.",
        "13. gxf3": "White maintains the pin but now has a doubled pawn.",
        "13... Qh4+": "Black Queen give check and at the same time threatens a pawn. The only way to solve the check is for white to move his queen thus ending the pin. Or the King could move, but then it is no longer possible for black to castle.",
        "14. Qf2": "As expected white solves the check with his queen.  I can't believe that the black horse was able to get out of that jam.",
        "14... Nxf3+": "This might be the key move in the game.  Its very smart and a little surprising.  Black moves his horse which does a bunch of good things.  It gets the black horse out of trouble. It puts the white king in check, and it takes a pawn so that black is now one pawn up. White Queen can not take the black horse.  The White king must move.  Thus removing the ability for white to ever castle.  Also, notice that the white king side pawns are destroyed leaving a gaping hole on that side.  Another sweet thing is that another white pawn is threatened and black could go up by 2 points.",
        "15. Ke2": "As expected the white King has to move.  He picks a good place to move.",
        "15... Qxf2+": "Black decides to swap queens. ",
        "16. Kxf2": "White king is out in the open now. Black horse is in trouble.",
        "16... Nd4": "Black horse saves himself.",
        "17. c3": "Lets play chase the horse.",
        "17... Ne6": "Now white pawn has two threats and no protectors.",
        "18. f5": "White pawn gets himself out of trouble and threatens a horse.",
        "18... Bc5+": "Never a  bad idea to make a check.",
        "19. Kg3": "White King goes for a walk.  Black horse still in trouble.",
        "19... Ng5": "Black horse out of trouble. That white pawn could become pesky.",
        "20. Re1+": "White gives check. ",
        "20... Kd7": "I thought about blocking the check with my bishop but that white pawn could give me grief. Sometimes I think castling is over rated. I move the King so that both of my rooks now have freedom of movement.",
        "21. h4": "White plays chase the horse.",
        "21... Bd6+": "Black ignores the horse trouble and gives another check.",
        "22. Kg4": "That white King is way out in no mans land now.",
        "22... Ne4": "Horse saves himself.",
        "23. Bxe4": "White decides to trade.  Its a good idea because black will win a pawn.",
        "23... h5+": "Black ignores the chance to capture the white bishop and gives the King some trouble.",
        "24. Kf3": "King continues his walk in the park.",
        "24... dxe4+": "Black takes white bishop.  This will lose a pawn for black.",
        "25. Rxe4": "Score is now even, but the position for white looks bad.  King is out in the open and vulnerable to pot shots.  White bishop is hemmed in. ",
        "25... Rae8": "Black does not mind trading.",
        "26. Rxe8": "White accepts the trade.",
        "26... Rxe8": "Trade executed.",
        "27. d4": "White unblocks his bishop.",
        "27... Re1": "Black has essentially prevented the white bishop from moving and also prevented the white rook from moving.",
        "28. b4": "White tries another avenue to get the bishop out.",
        "28... Rh1": "Black lines up to grab a pawn.",
        "29. Bb2": "White finds a way to get that bishop out but the bishop is still quite useless on that square.",
        "29... Rxh4": "Black takes a pawn and goes one point up.",
        "30. Rg1": "White threatens a black pawn.  White finally has some pieces moving.",
        "30... Rf4+": "Black gives check and threatens a white bishop.",
        "31. Ke3": "White king walks.",
        "31... Rxf5": "Black is now two pawns up but white threatens to take one point back.",
        "32. Rxg7": "Black is now only one point up.",
        "32... Be7": "Bishop provides some protection to king but also will be protecting the h pawn if he decides to go up a square.",
        "33. a4": "White wastes a move.  Could not think of anything better to do.",
        "33... h4": "Black has a pawn in the clear.  It will be a long road to get there, but all journeys begin with a single step.",
        "34. Rh7": "White must stop that pawn if possible.",
        "34... Bg5+": "Black hounds the king.",
        "35. Ke4": "King now threatens the black rook.",
        "35... Ke6": "Black protects his rook.  The black King comes in handy.",
        "36. c4": "White pawns are becoming worrisome. Also the white bishop is finally coming into play.",
        "36... Rf4+": "Black hounds the King.",
        "37. Kd3": "King retreats.",
        "37... f5": "Black pushes another pawn and this one is also completely in the clear so if we lose one, we might be able to get the other one to the goal line.",
        "38. Ke3": "Don't know what white was thinking here.",
        "38... Rg4+": "Black executes what is known as a \"discovered check.\"  This also provides a path for the black f pawn to advance.",
        "39. Kd3": "White King goes back to where he was before.",
        "39... Rg3+": "Black gives another check, white King must go back a row.",
        "40. Kc2": "White King wisely goes beside the bishop to provide some protection to bishop.",
        "40... f4": "Black takes one more step toward the goal.",
        "41. Bc1": "White bishop prevents that pawn from going any further although it might be worth it for black to sacrifice the bishop to advance the pawn.",
        "41... h3": "Black cautiously makes another pawn advance.  It is still a long road fraught with danger.",
        "42. Rh5": "White threatens black bishop.",
        "42... Rg2+": "Black ignores the threat and gives check and leaves his pawn unprotected.  There is another reason for this.  It will allow the black pawn to advance another row after the white King gets out of check.",
        "43. Kd3": "White King bops around.",
        "43... h2": "As expected, the black pawn advances to the penultimate row. ",
        "44. Rh3": "Not sure what white was thinking here.",
        "44... Rg3+": "Black gives check and gives white the chance to trade rooks in return for creating a Queen.  I will take that trade all day long.",
        "45. Rxg3": "White takes the bate.",
        "45... fxg3": "Black executes the trade.  Black now has two pawns in the clear.  White sees his hopeless plight and resigns.\n\nBlack is thinking, I really like that Petrov defense.  I better annotate this thing and remember it for the future."
    },
    "url": "https://gameknot.com/annotation.pl/slow-ladder?gm=58050",
    "gameName": "Slow Ladder",
    "players": "howling_canine (1441) vs. jutterback (1467)",
    "opening": "Petrov three knights game (C42)"
}