{
    "moves": {
        "1. e4": "This is a second game in the Smith-Morra, white (me) plays quite aggresively, then misses a very strong move that causes the game to extend to 26 moves.  I think the game shows a nice way of marching forward with threats based on black's weaknesses.",
        "1... c5 2. d4 cxd4 3. c3 dxc3 4. Nxc3 e6 5. Nf3 Bc5": "A reasonable move, though I've never played against it before.  I don't have a high opinion as one of white's normal plans is queenside expansion with an eventual a3 and b4.  The bishop looks active, but never does much on c5.",
        "6. Bc4 Nc6 7. O-O": "White is developing naturally and black will soon have trouble covering all the pressured squares.",
        "7... Nge7 8. Bf4 d6": "I think this is a definite inaccuracy.  Black must try to cover b5 with 8... a6, otherwise white's knight can take control of the dark squares.  Note that white has made 5 developing moves (Nf3, Nc3, Bc4, Bf4 and 0-0) while black only has three (Bc5, Nc6 and Nge7).  Conventional wisdom says a pawn is worth three tempo, white has two (and it's his turn), good development and a # of open files to use.  He also has two clear plans.",
        "9. Nb5": "I chose to target the dark squares, I plan to start a quick attack which utilizes the fact that black has not castled.  d6 is looking very weak.  My other plan which is also very strong is 9.a3 with the plan of b4.  If black's bishop is hit away d6 will still prove very problematic for black.  He also has no good defense to b4, as 9... a5 10.Nb5 is a better version of the line in the game.",
        "9... e5": "The ONLY way to retain d6 (for the moment), but my c4 bishop has just been unleashed on my opponent's kingside.  Note that rottweiler has played completely reasonable moves, and is finding himself in a huge mess.  Besides my bishop on c4, d5 is a great hole for my pieces to hop into.",
        "10. Ng5": "Attacking the very weak square f7.  The dark squared bishop has been blocked, but the ...e5 push opened up the light squares, I love how I've done the same knight maneuver on both sides, and his positions is trouble.",
        "10... O-O": "Not good, but I'll examine an alternative: 10... exf4 (trying to grab some material for his misery) is met by 11.Nxf7 Qd7 (I don't know what square is best) 12.Nbxd6 !? I could grab material, but this seems more promising 12... Bxd6 13.Nxd6 Kf8 14.Qh5 with a lot of pressure on f7, according to Langrock the game might continue: 14... Ng6 15.Nf7 Qxf7 (moving the rooks is awful and if black gives up the rook white will infiltrate on h7- I can also win the d file with a great deal of pressure) 16.Bxf7  Kxf7 17.g3 and black has three pieces for the queen but it's difficult for him to mobilize, this is black's most promising line, but it seems that he'll have to survive for another 15 unpleasant moves to have any sort of play.  Development can be a fleeting advantage, but if every turn is used then it can be permanent, you're always a move ahead (or more) of your opponent.  While black has survived the brunt of the attack in this line, he's STILL undeveloped.  You do have to play quickly and aggresively in most gambits, but a developmental advantage can last a long time.",
        "11. Qh5": "And white is simply better, probably winning.  The threat is Qxh7# and black only has one defense, the targets are now on the light squares, f7 and h7.  It's like black had a choice, lose d6 and fall apart on the light squares or play ...e5 and fall apart on the light squares.  In the Smith-Morra the ...e5 advance can be very strong, but black has to be very careful about f7 and the hole on d5 which is great for knights (see Smith-Morra Gambit #1).",
        "11... h6": "The only move, but now black loses an exchange.",
        "12. Nxf7": "Black must take, the queen is attacked as are numerous discovered checks, here's a sample of the danger: 12... Qb6?? 13.Nxh6  Kh7 14.Nf5#.",
        "12... Rxf7 13. Qxf7+ Kh8 14. Bd2": "This is my worst move of the game.  In the Smith-Morra (especially when you're actually UP material) you should never have to retreat- a second after I pressed \"submit\" I spotted 14.Bg5 which can't be taken cause of 14... hxg5 15.Qh5#.  This move would've completely tied down black's game, and would've been a nice move for the always moving forward style that many gambits have.",
        "14... a6": "So... black is lost, but he's not ready to give up yet and he's going to lash out in the following moves, the rest of the game is pretty straightforward.",
        "15. Nc3 b5 16. Bb3 Ra7 17. Qh5": "Getting off of the line of the rook and threatening 18.Bxh6 gxh6 19.Qxh6#.",
        "17... Qf8 18. Nd5": "Trading off pieces.",
        "18... Nxd5 19. Bxd5 Nd4 20. Kh1": "Bringing my king off the g1-a7 diagonal and preparing f4.",
        "20... Bb7 21. Bxb7 Rxb7 22. f4 Rf7": "Praying for 23.fxe5?? Rxf1  mating, it's not going to happen, but what choice does black have?",
        "23. f5 Ne6": "Again trying to tempt me to open the f file.  Black never really gets any play as much as he tries, white's got a space advantage and active pieces.",
        "24. b4": "Trying to bring his bishop to d4, the bishop's much weaker on the outpost than the knight would be.",
        "24... Bd4 25. Rae1 Bb6 26. g4": "And black resigns, my king is breathing a lot of air, but he can't attack it yet and g5 is devastating.  I think this game shows a carefree way with pieces (except my blunder 14.Bd2?) and an attack on light squares then dark.  The ...e5 push can save black, getting his pieces into the game and making the bishop of f4 look awful, but it can only be played with great caution.  I think the line where black gives up his queen for three pieces is very interesting, and if anyone would like to play a game (rated or unrated) in it give me a PM or challenge me.  As always please leave comments and improvements.  I hope you enjoyed!"
    },
    "url": "https://gameknot.com/annotation.pl/smith-morra-gambit-2?gm=7175",
    "gameName": "Smith Morra Gambit #2",
    "players": "raskerino (1718) vs. rottweiler (1610)",
    "opening": "Sicilian (B21), Smith-Morra gambit, Chicago defence"
}