{
    "moves": {
        "1. e4 c5 2. d4 cxd4 3. c3": "Offering the Smith Morra Gambit",
        "3... dxc3 4. Nxc3": "Black accepted and as of now, white is ahead in development!",
        "4... Nc6 5. Nf3 d6 6. Bf4": "Black seeks to defend the important e5 square while White seeks to apply pressure on it.",
        "6... g6 7. e5": "Black stopped to reinforce e5. It is my duty to take advantage of it! \nTaking would allow White to screw up blacks King safety",
        "7... Bg7 8. Bb5": "Black reinforces and white attacks again by gluing the Knight to c6",
        "8... a6 9. Bxc6+ bxc6": "Killing a defender and weakening the pawn structure! What else could you ask for? ",
        "10. exd6 exd6": "Right now c6 and d6 and f6 are relatively weak , while Whites b2 f2 and g2 are weak. But White has a devastating advantage in development.",
        "11. O-O": "Ensuring King safety and strengthening the king-side Attack!",
        "11... d5": "Weakening e5 and condemning c6 to stay weak.",
        "12. Ne5": "Taking advantage of the weak e5 square!",
        "12... Qb6": "?! Attacking the weak spot b2 and defending c6, however what seems to be a solid move is not that solid at all.",
        "13. Re1": "A discovered check that endangers the queen and defends b2!",
        "13... Be6": "Securing the King. Perhaps developing the knight would have been better, because it enables to black King to castle.",
        "14. b3": "At this point I had to options: b3 or N a4. I decided on b3 for tactical reasons. If I had chosen black would have had the option to move Qb4, attacking my Bishop and applying pressure on my knight. \n\n13 Na4 Qb4 14 b3 Qa3 appeared in my head (overlooking 14 ... Qxf4), and I did not want my rook to be glued to the a-file. ",
        "14... Ne7": "Black prepares to castle.",
        "15. Rc1": "Now all the (half-)open files are mine. Time to apply more pressure on c6.",
        "15... O-O 16. Na4": "The only offensive square that does not block a file. Additionally it leaves black with three squares to protect c6. (Well 16 ... c7 is followed by 17 Nxg6! )",
        "16... Qb5 17. Rc5": "Attacking the queen and forcing her to retreat or to move to b4 (in which case c6 is no longer defended)",
        "17... Qb7 18. Qc2 Rac8 19. Rc1": "The siege on c6 continues, however black has a problem...",
        "19... Bd7": "Black has no other way to defend except to kill one of the attackers. Probably Bxe5 was the rescue... but this way...",
        "20. Nxd7": "White can trade an attacking piece for an defending piece and ...",
        "20... Qxd7 21. Nb6": "Magically a tactical opportunity appears!",
        "21... Qg4": "Black hopes to get some compensation... however",
        "22. Nxc8": "White attacks Ne7, so black has to reclaim the Knight. Note that c6 is still under siege!",
        "22... Nxc8 23. g3": "I decided on securing the Bishop and getting an escape square for my king in case any heavy piece would target the first rank. Since there are no light squared bishops anymore I assumed this to be save.\nThere is another option: 23 Rxc6!? Qxf4 24 Rxc8 Rxc8 25 Qxc8+ ",
        "23... Na7 24. Ra5": "Black has no quick option to defend both squares.",
        "24... Qc8 25. Be3": "?! I believe that Qc5 would have been stronger, however I'm not sure. :) Black was lost anyway.",
        "25... d4": "This move weakens the black d pawn, however it temporary resolves the stress on c6.",
        "26. Bd2 Re8 27. Qc4": "Using the queen near to her full potential: Attacking a6 c6 d4 and f7!",
        "27... Qg4": "Leaving a6 undefended for counterplay with the advanced d pawn. Possibly the plane was to get the rook to e2.",
        "28. Rxa6": "However, I see no reason to worry, and it would be rude to not accept gifts. (Especially since d3 can't yet advance because of 28 ... d3?? 29 Qxg4",
        "28... Re2": "Attacking the only undefended piece: My Bishop. However blacks Knight and blacks Queen are undefended!",
        "29. Bc3": "This allowed me to play this move.",
        "29... Qf3": "A mate threat, however a very weak one, since it stops defending d4... another gift.",
        "30. Bxd4 Nb5": "The final blunder. Black leaves the 8 rank totally undefended.",
        "31. Ra8+ Bf8 32. Qc5": "And mate is unavoidable!",
        "32... h5 33. Qxf8+ Kh7 34. Qg7#": "That's it. :) I really enjoyed the knight play and think it was in a way a beautiful game since not that much tactic was made and the black moves seamed pretty reasonable. :) \n\nThanks for reading, I hope you enjoyed it and comments are welcome. :)"
    },
    "url": "https://gameknot.com/annotation.pl/smith-morra-with-horsepower?gm=41245",
    "gameName": "Smith Morra with HorsePower",
    "players": "thedeafone (1537) vs. warmpancake (1540)",
    "opening": "Sicilian (B21), Smith-Morra gambit, Chicago defence"
}