{
    "moves": {
        "1. e4": "Hi everyone!\r\n\r\nYesterday an unrated game finished quite unexpectedly.  For the first 20 moves I seemed to be getting nowhere, my opponent seemed so safe but she suddenly left herself vulnerable at the back, just like a football team pressing forward for a goal and leaving the goalie on his own.  It then only needs one enemy footballer to press through and shoot at goal.  As you will see, a similar thing happens here.",
        "1... d6": "1. ...... e6 - Julie responds with the Pirc Defense, this is one of those hypermodern openings that attempts to induce the white player to overreach himself/herself.  Dmaestro, apastpawn and the Master Mater have all had success against me with it.",
        "2. d4 e6 3. Nc3": "3. Nc3 - development.",
        "3... c6 4. Nf3 f6 5. Bd3": "5. Bd3 - now I am ready to castle and ......",
        "5... g6": "5. ...... g6 - what's this?  Another pawn move.",
        "6. Bd2 Bg7": "6. ..... Bg7 - at last, a piece emerges!",
        "7. O-O b6": "7. ...... b6 - and another pawn move, is Julie gonna complete the picture with a6 and h6 to have a fascinating line up on her third rank?  It will look quite fascinating I think.  Funnily enough I had a similar set up in this game against my buddy The Carpenter but I went on to win it! http://gameknot.com/annotation.pl/material-imbalances-2-pieces-v-1-rook-pt-5?gm=24800",
        "8. Re1 Ne7": "8. ..... Ne7 - no she develops another piece and is ready to castle.",
        "9. d5 exd5 10. exd5": "10. exd5 - a pawn trade re-arranges the third rank configuration.",
        "10... O-O 11. dxc6 Nbxc6": "11. ...... Nbxc6 - black is now catching up in her development.  What should I do?  Ah, I now move a pawn to my third rank, a3 - standard prophylactic move to stop a move like Nb4.",
        "12. a3 a6": "12. ..... a6 - Julie has the same idea.",
        "13. Qc1": "13. Qc1 - preparing Bh6 to force a bishop trade on g7.",
        "13... Re8 14. Bh6 g5 15. Bxg7 Kxg7": "15. ....... Kxg7 - the bishop trade took place as planned.",
        "16. Qd2": "16. Qd2 - here I am contemplating completely denuding black's king with Nxg5, but after fxg5 and Qxg5 black has Ng6! up her sleeve.  I now reconnect the rooks.",
        "16... Nf5 17. Rxe8 Qxe8": "17. ...... Qxe8 - rook trade.",
        "18. Re1": "18. Re1 - centralises my queen rook and drives the Wicked Witch of the West off the e column.  She goes to h5.",
        "18... Qh5 19. Nd5": "19. Nd5 - I try not to be fazed by the Witch going to h5.  That horsie hits at b6 and possibly e7.  A bishop for knight trade and a knight for knight trade may well bring my e1 rook to e7 with check putting the cat among the pigeons.",
        "19... Nfd4 20. Nxd4 Nxd4": "20. ....... Nxd4 - knight trade - now you would not believe this game is gonna terminate in just two moves would you?",
        "21. Re7+": "21. Re7+ - As the knights have moved away from f5 and c6 the e7 square is now available to my rook, my opponent has helped me there.  Julie now plays the suicidal Kh6.  However, Kg8 would lead to Nf6+ and it is ding dong, etc. etc.  Best is Kf8 which would lead to Rxh7 winning a pawn for white but at least Julie can play on here.",
        "21... Kh6 22. Rxh7#": "22. Rxh7 MATE! My rook now sneaks in through the back door and snares the black king from behind.  Henry and Glenda are mere spectators, watching the combat from the safety of the pavilion.  Commiserations Julie, I hope that me and the jury can give you an informative post-mortem."
    },
    "url": "https://gameknot.com/annotation.pl/sneaking-through-the-back-door?gm=25171",
    "gameName": "Sneaking through the Back Door!",
    "players": "jstevens1 (1783) vs. black-velvet (1269)",
    "opening": "Pirc defence (B07)"
}