{
    "moves": {
        "1. e4": "Hi everybody, my 13th match with Freddy, the Master Mater and it very nearly was lucky 13 for me.  Because right up until after the 40 move mark I had drawing chances against him.  I built up a seemingly watertight defense against him, but alas, he did eventually break through - I could have prevented it however and perhaps you the jury can decide just what prevented me from getting my biggest achievement of the whole of my chess career.  I play e4 and he gives me d6 which is the Pirc Defense.",
        "1... d6 2. d4 g6 3. Nc3": "3. Nc3 - standard moves so far.",
        "3... c6 4. Nf3 Nd7 5. Bc4": "5. Bc4 - active development is called for here!",
        "5... Nb6 6. Bb3": "6. Bb3 - this time I decide to keep Fou Leblanc.  I also decide to create a bolt hole for him by playing a4 to counter a possible b5.",
        "6... Bg7 7. a4": "7.a4 - after I played this move I went into the Land of Sweet Dreams - in my dreams it works out like this, but the reality continues:-\r\n\r\n7. a4 Bg4 8. a5 Bxf3 9. Qxf3 Bxd4 10. Qxf7  Kd7 11. Be6  Kc7 12. axb6  Kb8 13. bxa7  Bxa7 14. Ke2 Qb6 15. Qe8  Kc7 16. Qd7  Kb8 17. Qc8#.  \r\n\r\nTrouble is, Freddy can block the a2-g8 diagonal with his d pawn at any time and if I try to put Glenda on f3 then simply Nf6 spoils the show.  Still, it always pays to be on the lookout for attacking opportunities even when playing the Master Mater! ",
        "7... a5 8. h3": "8. h3 - I am thinking about how I can avoid being \"Freddied\" mid game.   I will tell you a little more about the term being \"Freddied\" - I am also a cricket fan and in the England cricket team there is a strike bowler and former England Skipper (who is partial to pedaloes!) who is called Andrew Flintoff and has a nickname Freddy.  So when an opposing batsman is clean bowled by Andrew Flintoff he is known to be \"Freddied\" - so same applies to the opponents on the receiving end of a checkmate from the Master Mater!  I have a MasterPlan though, tee hee hee!  I simply plan a forced queen trade even if it means Henry going to d1.  Because the Wicked Witch of the West has had my Henry 4 times out of 5 I would dearly lurve to see the back of her!  8. h3 is stage 1 - stop a knight incursion on g4.  Step 2, play e5 and we get a trade of d for e pawn and because Freddy's knight is en prise he either has to take on d1 or move his knight.  Either way the Wicked Witch disappears - kaboom!",
        "8... Nf6 9. e5 dxe5 10. dxe5 Qxd1+ 11. Kxd1": "11. Kxd1 - I have a choice, king or knight recapture here,  I do not wish a knight incursion on e4 so Henry I choose you!",
        "11... Nfd5 12. Nxd5 Nxd5 13. Bxd5 cxd5": "16. ......... cxd5 - I also manage to get rid of 2 of Freddy's horsies, wretched, rampant creatures they are.  I am even prepared to lose Fou Leblanc to do it.",
        "14. Bf4": "14. Bf4 - Fou Lenoir develops and guards the pawn on e5 at the same time.  Note that there is a ready-made bolt hole for him.",
        "14... h6 15. Nd4": "15. Nd4 - this knight remains on d4 for nearly the rest of the game.  Freddy duly plays g5 but Fou Lenoir seeks sanctuary on h2 and still defends the pawn on e5.",
        "15... g5 16. Bh2 Bd7 17. c3 h5 18. Kc2": "18. Kc2 - rooks now connected.  Note the d4 knight prevents an annoying check from Freddy's lsb on f5.",
        "18... Rc8 19. Kd3": "19. Kd3 - sidestepps the pin - Henry is well centralised for the endgame.  I now protect my pawn on a4 by playing b3 and release my queen rook for useful action elsewhere.",
        "19... Rh6 20. b3 h4 21. Rhe1 Rg6 22. f3 Ra6 23. Rac1": "23. Rac1 - doubly protects c3.",
        "23... Bh6 24. Rc2 Bg7 25. Rcc1 Rb6 26. Rcb1": "26. Rb1 - the start of a War of attrition!  Never fear, I will soon awaken you!",
        "26... Kf8 27. Rbc1 Kg8 28. Rcb1 f6 29. exf6 Bxf6": "29. ....... Bxf6 - some action - a pair of pawns have been exchanged!",
        "30. Be5": "30. Be5 - I cannot allow the knight which is performing a vital defensive role in an attacking position to be exchanged off!",
        "30... Kf7 31. Rbc1": "31. Rbc1 - tempting to initiate the exchange of bishops but if I do my knight will be driven off by e5 after the BK recaptures.",
        "31... e6 32. Re2 Bxe5 33. Rxe5": "33. Rxe5 - more action - now the dsbs are exchanged!",
        "33... Kf6 34. Rce1": "34. Rce1 - the e file will become a death trap for my rooks later on.",
        "34... Re8 35. Re1e2 Ra6 36. Kd2 Raa8 37. Re2e3": "37. Re2e3 - I play this move in some anticipation of a doubling on the c file but is there anything better here?",
        "37... Rac8 38. Kd3 Rc5 39. Kd2 Rec8": "39. ........... Rce8 - after several moves of trying not to upset the status quo here is a big threat from Freddy, it seems I cannot avoid losing a pawn.  I did analyse my next move Nxe6 and went in for it because I thought that it would be better to lose a piece for 2 pawns rather than a pawn - this I picked up through reading a Dan Heisman article - it doesn't apply here.  Here is some analysis:-\r\n\r\nVariation A: 40. Nxe6 d4 41. Rxc5 dxe3  42. Kxe3 Rxc5 43. Nxc5 \r\nVariation B: 40. Nxe6 d4 41. cxd4 Rc2  42. Ke1 Rxg2 43. Kf1 Rcc2 44. d5 Rcf2  45. Ke1 Rh2 46. Re2 Rxe2  47. Rxe2\r\n\r\n",
        "40. Nxe6 d4": "40. ......... d4! - this little move throws a big spanner in the works because it discovers an attack from the rook on c5 to my rook on e5.  I decide to take with the c pawn backing up the rook on e5 but it doesn't work.",
        "41. cxd4 Rxe5": "41. .......... Rxe5 - because of this!",
        "42. Rxe5 Bxe6": "42. .......... Bxe6 - the knight is lost so I grab the a5 pawn.",
        "43. Rxa5": "43. Rxa5?? - In a post-match pm Freddy said that this was the losing move but do you the jury have any better alternatives?",
        "43... Bxb3 44. Ke1": "44. Ke1 - steering Henry towards the g pawn.",
        "44... Rc2 45. Kf1": "45. Kf1 - the g pawn is en prise, I decide to defend it with Henry but would Rb5 have been a better try here.  Freddy plays Ra2 and after some long analysis which I sent to Freddy explaining that I was resigning on the grounds of ruinous loss of material because I cannot stop the b pawn from crowning I waved the white flag.  In post-match pms from Ion and Freddy they said that I should have drawn the match.  OMG - how close am I ever gonna get to glory again.  There is only one way to find out.  Simply select the \"Challenge easy19 to a game button\".",
        "45... Ra2": ""
    },
    "url": "https://gameknot.com/annotation.pl/so-near-and-yet-so-far?gm=21900",
    "gameName": "So near and yet so far!",
    "players": "jstevens1 (1759) vs. easy19 (2223)",
    "opening": "Pirc defence (B07)"
}