{
    "moves": {
        "1. b4": "leaving the center fight for after. Is it a good strategy ? I think that there is no hurry to place paws in the center.",
        "1... e5": "this pawn will be soon exposed and then black will have to defend it",
        "2. Bb2": "starting the agressivity from the second move ! this is funy ! Of corse the \"grob trap\" is Bf7xb4 Bb2xe5 treatening g7 ...etc\n",
        "2... f6": "preventing the treath on g7, but opening the h5/e8dangerous diagonal. It will serve me after",
        "3. a3 d5": "now we will start to fight for the center...I wanted to do d4, but my mouse slip (or maybe my mind ?!) and i played e4 !",
        "4. e4 dxe4 5. f3": "i can tak this risk because the black queen cannont go to h5 for the moment, so i have the time to play this gambit, taking back with queen or knight, i still dont decided it",
        "5... exf3 6. Nxf3": "better with the knight in order to castle",
        "6... Bg4": "this is good, but if i play carrefully, there is no problem for the moment i can go on ",
        "7. Bc4": "more safy whould be Be2, but less agressive, and i think this kind of opening, like grob 's ones, need a lot of aggressivity to compense strange opening and weak center",
        "7... Nh6 8. d3": "in order to move my DSB in c1 to take the h6 black knight",
        "8... c5": "was it good this  move ? i stil ask my self, any way i will go on attacking, ignoring the exchange of pawns, and this is the better response because if i take c5, then black take back whith there DSB and they will make white castle impossible",
        "9. O-O": "so first i castle ! ",
        "9... Nc6 10. bxc5": "and now i take this pawn !\n",
        "10... Bxc5+": "i should move my king, but i prefer more agressivity, and it will cost me to get a bad situation. This is blitz",
        "11. d4": "bad calcul for me",
        "11... exd4": "i have to move the king",
        "12. Kh1 Bxf3 13. Qxf3": "now i have the way to h5 opened",
        "13... Ne5 14. Qh5+": "now the black king have to move an loose castle possibility",
        "14... Kf8 15. Bb3": "saving my LSB",
        "15... Qd7": "anticipating the treath on f7, of course i will try to get advantage on it, instead of the 2 knight preventing it...",
        "16. Bc1 Nhf7": "one knight less ! ",
        "17. c3": "to develop my knight",
        "17... dxc3 18. Nxc3 Qd4": "dangerous move for blacks , i will protect my knight with Bb2",
        "19. Bb2": "now the queen is under a discovered attack's treath",
        "19... g6": "ok,  i move",
        "20. Qe2 Re8": " i will attack his queen first",
        "21. Na4": "so what's the deal ?...",
        "21... Qd6": "i whant to Rf1xf6, so i will take the black DSB, the black queen will have to take back and f6 will be mine. But first i will take Ke5 to open f colon king's protections",
        "22. Bxe5": "FIRST",
        "22... Nxe5 23. Nxc5": "SECOND",
        "23... Qxc5 24. Rxf6+": "THIRD !",
        "24... Nf7": "easy, i have my LSB treathening this f7 square from long time !",
        "25. Rxf7+": "so i can ignore the Re8 treath on my queen and go on attacking",
        "25... Kg8": "Easy, i will win the black queen and then mate this poor black king ! ",
        "26. Rc7+": "So blacks resigns. I think i will experiment this funny opening for a while..."
    },
    "url": "https://gameknot.com/annotation.pl/so-strange-monkey-opening?gm=47250",
    "gameName": "So strange monkey opening...",
    "players": "31415 (1219) vs. jamshid78 (?)",
    "opening": "Polish (Sokolsky) opening (A00)"
}