{
    "moves": {
        "1. f4": "Suppose you win a pawn by move 13. How do you convert a full pawn into a full point? This is what I've been trying to do in this game.",
        "1... d5 2. d4 Bf5 3. e3": "Apparently, there's a first for everything, even \"Bird's opening with 1..d5\". Never played this before.",
        "3... Nf6 4. Nc3 e6 5. Bd3 Bb4": "They say it's not wise to move the same piece twice in the opening, so I chose to develop the other bishop instead of trading the light-coloured bishops.",
        "6. Bd2 O-O": "Safety first",
        "7. Nf3": "White is not going to castle very soon.",
        "7... Nc6 8. Ne5": "Perhaps 8. 0-0 would have been a more solid move.",
        "8... Nxe5 9. fxe5 Bg4": "I'm not sure this intermediary move is good. ",
        "10. Be2": "I decided to trade the light-coloured bishops, because mine wasn't doing much.",
        "10... Bxe2 11. Qxe2 Bxc3": "Intending to place the knight at e4 after white retakes with 12. Bxc3; it's a well-placed spot for a knight, and it cannot be chased away easily",
        "12. exf6": "he believes that my knight's place is outside the table. Everybody has the right to an opinion, after all",
        "12... Bxd2+ 13. Qxd2 Qxf6": "I exchanged bishop for bishop, he exchanged pawn for knight, so I came a pawn up after all the minor pieces have left the table. Being a pawn up, I thought \"well, if only I could exchange the rest of the pieces, I would have a very good chance to win this\".\nWith all the pieces gone, I would have essentially a won game. But how do you win a \"won game\"?",
        "14. Rf1": "taking possession of the half-open file",
        "14... Qh6": "Fritz likes 14..Qh4 better, but I preferred to keep an eye on e3, hoping that maybe he would leave it unguarded someday.",
        "15. O-O-O": "Finally, he castles. I believe the theory recommends an attack on queen's flank in this position, but that never happened.",
        "15... Qxh2": "I decided to go for the material, grab a (perhaps poisoned) pawn and hope to survive the attack that was to follow on the kingside.",
        "16. Qf2 Qh6": "I intend to place the queen at g6, so that it can survey the weak point h7 after white takes control of the h file",
        "17. Rfh1": "he takes control of the h file, a very sensible move. I am now 2 pawns up, but an attack will certainly follow on the king's flank. Perhaps it really was a poisoned pawn.",
        "17... Qg5": "Between g6 and g5, I chose the latter because it sort of forces the white queen to keep guarding e3, which is now his weak point. Of course, I only use a piece for the attack, so he can easily attack me and guard e3 at the same time",
        "18. Rh3": "which he does; obviously, Rdh1 is to follow",
        "18... f5": "I must try to bring the rooks into play, otherwise I don't really stand a chance.",
        "19. Rdh1": "ok, so now I'm starting to feel some pressure",
        "19... h6": "Not that many choices here, if I am to keep the h pawn",
        "20. Rg3": "Help! The paparazzi are harassing her royal highness!",
        "20... Qf6": "Her royal hiighness must protect h6, because the g pawn is pinned",
        "21. Qf4": "! A double threat: c7 and h6 (my g pawn is still pinned, so h6 is really only protected by the queen and attacked twice)",
        "21... Kh7": "I cannot parry both threats, so I decide that h6 is more important (obviously)",
        "22. Qxc7": "So much for my two pawns up",
        "22... Rf7": "Now my paparazzi are harassing the white witch. Errr... I mean, the white queen",
        "23. Qf4": "Back to where the action is",
        "23... Rg8": "Preparing g5",
        "24. Rg5": "ok, so g5 is no longer an option",
        "24... g6": "I go for the next best thing, g6",
        "25. Rg3": "with Rgh3 to follow, a triple attack on h6. Did I mention that h6 is my weak point?\nActually, we both missed 25. Rxh6 (\"did I mention that h6 is my weak point?\") Kxh6 26. Rxf5  Kg7 27. Rxf6 Rxf6, where he gains queen and 2 pawns for 2 rooks, and an interesting game to follow. I don't know if he considered this line, but I totally missed it. Fritz is screaming for it, giving it a  2 evaluation instead of roughly zero evaluation for the line actually played in the game.",
        "25... g5": "finally, g5. I thought, if I ever manage to exchange the queens and the rooks, some advanced pawns will come handy.",
        "26. Qd6 f4": "if he takes with the pawn, I can force a trade of queens",
        "27. exf4": "He did take the pawn. Perhaps queen and 2 pawns for 2 rooks would have been better.",
        "27... Qxf4+": "Forcing the exchange",
        "28. Qxf4": "Not that many options to ponder",
        "28... Rxf4": "Now the mating threats have disappeared, and I have a more pleasant game (still a pawn up). One pretty important step closer to victory",
        "29. Rd3": "d4 has to be defended. But why not 29.c3?",
        "29... Kg6": "Not a very bright move. I certainly have to bring the king closer, but the f file has to be dealt with first.",
        "30. c3 Rgf8": "Attaboy. Taking control of the open file, this is obviously the best and most solid move.",
        "31. Rd2 Rf4f1+": "Forcing another exchange",
        "32. Rxf1 Rxf1+": "Another step closer to victory",
        "33. Kc2 Kf5": "In the endgame, the king is an important weapon",
        "34. Re2": "He threatens Re5 , but it's not very bad for me",
        "34... h5": "Since I have a kingside majority, I'd better push those pawns",
        "35. b4": "Seeking counterplay on the queenside",
        "35... h4": "Keep on pushing the pawns",
        "36. a4": "Likewise",
        "36... g4": "Hmmm, advanced pawns in the endgame...",
        "37. a5 g3": "At this point, Fritz gives a -  evaluation, meaning basically \"a decisive advantage\". I threaten Rf2, exchanging the last pair of rooks, and entering a won (really won) endgame",
        "38. Kd2 Rf2": "Ha!",
        "39. Ke3 Rxe2+": "Another step closer to the victory, I can smell it. Or perhaps I'm just tired",
        "40. Kxe2 Ke4": "A very solid place for my king, surveying both my kingside pawns and his vulnerable queenside ones",
        "41. b5": "This is a non-losing move, but these kind of moves are in short supply now for white.",
        "41... b6": "I don't want to move the king, it stands very well on e4 and we'll soon see why.",
        "42. axb6 axb6": "Well, he is in zugzwang now. If he quits guarding d3, my king will enter and pick up all his pawns",
        "43. Kd2": "The only move still guarding d3, but I have a neat move prepared (pretty obvious, actually, but still neat). Told you he was in zugzwang",
        "43... h3": "With promotion to follow in 2 moves, white resigned.\nSo, how do you win a \"won game\"? In this case, make fewer mistakes and be a bit more careful than the opponent."
    },
    "url": "https://gameknot.com/annotation.pl/so-how-do-you-win-a-won-game?gm=3156",
    "gameName": "So, how do you win a \"won game\"?",
    "players": "hollcana (1302) vs. andydufresne (1667)",
    "opening": "Bird's opening (A03)"
}