{
    "moves": {
        "1. b4": "The Sokolsky opening.  A wing eccentricity that looks a little ridiculous, though it has more than a bit of poison for the unsuspecting (it's much more sound than say, the Grob).  If black plays passively white can eventually transpose into the family of more conventional d4/c4 openings with more queenside space.",
        "1... d5": "1. b4 e5 2. Bb2 Bxb4 3. Bxe5 is the \"main line,\" such as it is, in this opening, and one any Sokolsky specialist can expect to be very comfortable in.",
        "2. Bb2 Qd6": "My favored recipe against the Sokolsky.  The queen is well posted here, as it both hits b4 and supports a e5 push.",
        "3. a3": "3. b5?! runs into Qb4.  One sample line: 4. Be5 Qxb5 5. Bxc7 Qc5 6. Bg3 (or 6. Bxb8, ceding the bishop pair for...not a lot) Nc6, preparing ...e5 and black is already a little better.",
        "3... e5": "Full classical center achieved.",
        "4. e3 Be7": "4. ...Nf6 is slightly more accurate, if only because white can now transpose to a more \"proper\" opening scheme with the Bird via 5. f4, if that's to white's taste.",
        "5. c4 c6": "I prefer maintaining my center vs. advancing with ...d4 and then spending the middlegame defending this advanced target.  5. ...c6 also provides my queen luft on c7 in the event of a white push with c5.",
        "6. cxd5 cxd5 7. Nf3 f6": "I intended to develop my KN on h6, so this pawn move to fortify e5 is fine here.",
        "8. Be2 Be6 9. O-O Nh6 10. Nc3 a6": "Covering b5 from enemy knight harassment.",
        "11. h3": "?! I didn't like this move on white's part.  It covers g5 from invasion, however my knight would have been more likely to jump to f5, if anything.  Additionally I think this pawn bunt sets up h3 as a rather obvious target in the future.",
        "11... Nd7 12. d3": "White's position vaguely resembles a reversed sicilian, a sort of Scheveningen/Kan hybrid, with the \"small center\" at d3 and e3, and the queenside advances of a3 and b4.",
        "12... O-O": "My development is complete; pieces out, rooks connected, castled, and ready for middlegame operations. I felt very content with my position, and I think black, with a strong center and more space, is easier to play and find harmonious plans.",
        "13. b5": "I don't need to respond to white's bid for queenside play, especially since the majority of my army points more towards the king-side naturally.",
        "13... f5": "! Gaining more space, clearing the f6 square for a piece, and preparing a break in the center.  Depending on black's plan, a ...f4, ...d4, or even ...g5 push could all be justified with some prep, though I am more partial to ...f4.",
        "14. d4 e4": "The obvious and strongest response to white's bid towards the center.  Black closes the center and continues to gain space.",
        "15. Ne5": "White decides to sac a pawn to open the position somewhat.  He doesn't get full compensation, but then it's pretty thankless to face 15. Ne1 f5.",
        "15... Nxe5 16. dxe5 Qxe5": "I wasn't worried about the strong enemy dark-squared cardinal on the a1-h8 diagonal.  For one, the only \"discovered\" attack move is Na4, because otherwise the bishop hangs.",
        "17. Na4 Qd6 18. bxa6 bxa6 19. Bd4": "White plants his bishop on the hole in the center, and shifts attention to the c5 square.",
        "19... Rac8": "My queen on the third rank also protects a6, so I can spare this otherwise unengaged rook on the open file.",
        "20. Nb6": "? White's first outright positional blunder.  This knight sortie accomplishes nothing and wastes time.  20. Rb1 is called for, which is the logical follow-through from 19. Bd4.",
        "20... Rc6": "My rook wanted to go to this square in any case.  And now white needs to take timeout to move the knight again, or otherwise play (again) 21. Rb1.",
        "21. Na4 f4": "I continue my king-side attack.  White is in severe trouble.",
        "22. exf4 Rxf4": "Junior 10 prefers retaking with the queen, however I wanted to lift my rook over to h4 to join the fray.",
        "23. Be3": "? Not much point to this move, since it once again, nudges my army to squares they already wanted to go.  On h4 my rook also covers h6 and prevents white my splattering my king-side pawns with BxN.",
        "23... Rh4 24. Rc1 Bxh3": "! Beginning the demolition of the king-side.  All my artillery is pointed at the castled king's position.",
        "25. Rxc6 Qxc6 26. gxh3": "?! White probably felt obliged to accept this piece sac, however it goes according to the script I'd mapped out.  In defensive positions, indeed in chess in general, one should endeavor to play actively and in a non-stereotyped fashion, and try to find counterpressure whenever possible.  26. Qb3 is a more active move, pressuring the a2-g8 diagonal and keeping on eye on black's empty back-rank, and personally I would have found a sterner defensive move, though white is decisively worse in any case.",
        "26... Qg6+ 27. Bg4": "The only move to prevent a mating net.",
        "27... Nxg4 28. hxg4": "?? I was shocked to see this staid recapture which capitulates the rest of the game.  I was fully expecting 28. Qxd5ch and a bit of a chase around my light-colored squares as my king seeks sanctuary, though I felt secure in the calculations I made that there was no perpetual or cheapos to fear.",
        "28... Rxg4+ 29. Qxg4": "Nothing else.",
        "29... Qxg4+ 30. Kh1 Bd6 31. Rc1 d4": "Putting an end to things quickly, and driving the bishop off the c1-h5 diagonal so I can pick up the rook as well.",
        "32. Bxd4 Qh4+ 33. Kg2 Qg5+": "White resigns.  I always enjoy a good cold front with severe storms on the king-side.  My opponent's king-side, that is."
    },
    "url": "https://gameknot.com/annotation.pl/sokolsky-scuttle?gm=35454",
    "gameName": "Sokolsky Scuttle",
    "players": "mr5reasons1 (1639) vs. -nosferatu- (1732)",
    "opening": "Polish (Sokolsky) opening (A00)"
}