{
    "moves": {
        "1. d4": "This is the first time I have played macduffee, but I usually answer d4 with ...Nf6 to keep my central pawn options open.",
        "1... Nf6 2. e3": "An interesting move that leads me to think a Colle is coming. I used to play the Colle quite a bit as white, but more recently have moved to the Scotch Game. It would be fun to play the black side of a Colle.",
        "2... e6": "Keeping my options open should white play c4 and transpose into more normal lines.",
        "3. c4": "And we are back at a more normal position. I can play ...Bb5  if I want to head into a Bogo-Indian, but that is not what I play with black.",
        "3... d5": "I prefer a Queen's Gambit Declined.",
        "4. c5": "And now we are out of book. This can't be a good move theoretically, but as a surprise tactic, it may be playable. It certainly caught me by surprise.",
        "4... b6": "Threatening to win a pawn with ...bxc5 and ready to meet cxb6 with axb6, opening the a file for my rook.",
        "5. b4": "But white wants to bolster his pawn on c5.",
        "5... a5": "So I attack the defender.",
        "6. b5": "This drops a pawn, but white seems more interested in gaining queenside space.",
        "6... bxc5 7. Ba3": "Finally developing a piece, but I'm not sure what this accomplishes. Maybe looking to trade on f8 if black plays ...cxd4, but that trade doesn't really do anything for white.",
        "7... cxd4": "So I will take another pawn.",
        "8. Bxf8 Rxf8": "And now black can castle by hand with ...Ke7, ...Re8, ...Kf8. But for the time being, the king is safe where he is.",
        "9. exd4": "Getting back one of the pawns, but I don't see that white has enough compensation for his sacrificed pawn.",
        "9... c6": "Hoping for bxc6, when I can recapture with the knight and increase my lead in development.",
        "10. bxc6": "And white obliges.",
        "10... Nxc6": "After 10 moves we can take stock of the opening. Black is up a pawn and has both knights developed. The only piece white has that isn't on its starting square is the d4 pawn. If this was a boxing match, white would get a standing eight count.",
        "11. Bb5": "Developing a piece with an attack. Maybe this will be a game after all.",
        "11... Bd7": "As I am up a pawn, I will look for ways to trade down to an endgame. This prepares to offer a trade of bishops. Oh yeah, and it breaks the pin :)",
        "12. Nf3": "Nice developing move that prepares castling.",
        "12... Nb4": "White's a pawn can kick the knight from this position at any time, but the point was to trade the bishops off.",
        "13. Bxd7+ Qxd7": "Mission accomplished.",
        "14. O-O": "White gets castled, but if I can get the queens off, my king will be safe, even without castling. And in an endgame, my king will be closer to the center, which is an advantage.",
        "14... Ke7": "But I must release the king's rook.",
        "15. a3": "Getting rid of the knight.",
        "15... Nc6": "The knight resumes his attack on the isolated d pawn. I probably can't get enough pressure on it to win it, but maybe I can stretch white's resources enough to allow some other weakness to arise.",
        "16. Qd3": "Eyeing the h pawn and getting the queen off the back rank to help connect the rooks.",
        "16... h6": "Not only does this release the f6 knight from the obligation of defending the pawn on h7, it takes away the g5 square from white's knight. The drawback is that if the f6 knight moves away, white's queen can invade on h7 and the g7 pawn is weak. But I am not worried.",
        "17. Nc3": "Finishing development.",
        "17... Rfc8": "Putting a rook on an open file is standard middle game strategy.",
        "18. Rfc1": "Which white is aware of also :)",
        "18... Kf8": "Not sure why I did this, but probably to protect the g7 pawn so the f6 knight is free to move.",
        "19. Na4": "Heading for the nice outpost on c5.",
        "19... Qa7": "Again, I don't remember what I was thinking here, except that the queen has to go somewhere when the black knight gets to c5.",
        "20. Nc5": "And white's knight is strong here, covering important squares in the black camp.",
        "20... Nd7": "So I attempt to trade it off.",
        "21. Qh7": "And white declines to trade on d7, since my trading on c5 will let him recapture with the then-passed c pawn. Also, his queen has now invaded my weak kingside pawns, and looks to wreak some havok.",
        "21... Nxc5": "Getting rid of the strong knight, as I think I can successfully blockade the c pawn.",
        "22. Qh8+": "But rather than recapture immediately on c5, white plays this intermezzo to win the g pawn.",
        "22... Ke7 23. Qxg7 Nb3": "But by not recapturing on c5, white lost a piece, and with this move black wins the exchange also. As white does not want to continue a rook down, he resigns. 0-1"
    },
    "url": "https://gameknot.com/annotation.pl/solohawk6_9s-mini-tournament?gm=590",
    "gameName": "solohawk6_9's mini-tournament",
    "players": "macduffee (1390) vs. markpinkston (1473)",
    "opening": "Queen's pawn game (A45)"
}