{
    "moves": {
        "1. c4": "Having played John before, I know he likes to open with c4.",
        "1... d5": "Although there are many good moves for black here, this isn't one of them. After 2. cxd5 Qxd5 3. Nc3, white has exchanged a side pawn for a black central pawn (good for white) and is ahead in development by gaining tempo against the black queen (also good for white).",
        "2. cxd5 Qxd5 3. e3": "But now it is white who misplays the opening by failing to develop with tempo against the black queen. 3. e3 also blocks in white's dark bishop along the c1-h6 diagonal.",
        "3... e5": "A good move: gaining space and keeping both diagonals open for the bishops to develop.",
        "4. Nc3": "Better late than never. White develops with tempo against the black queen.",
        "4... Qe6": "An interesting choice. I think I would prefer to put the queen on d8 or a5, as in the Scandinavian Defense. The text blocks in the light bishop, and the queen just seems out of place on e6.",
        "5. Nge2": "I don't see the reason to play this instead of the normal Nf3. White must be planning to fianchetto the light bishop, as this blocks the f1-a6 diagonal.",
        "5... Bd6": "Developing a piece is better than wasting time with a pawn push, but the general rule is knights before bishops. This move puts black's \"bad\" bishop behind the e5 pawn where it lacks scope.",
        "6. Ng3": "This knight has taken two moves to get to the third rank when one move would have been sufficient. In my opinion this maneuver not only wastes a tempo, but the knight is not as well placed here as it would have been on f3.",
        "6... Nf6": "A fine developing move that fights for central squares and prepares castling.",
        "7. Nb5": "A violation of opening principles, in that a developed piece is moved a second time when there are still other undeveloped pieces to be moved. And for what reason? To \"threaten\" the bishop on d6? For white to trade a knight he has invested three tempos in for black's bad bishop which has only moved once seems foolish. And black would get to recapture with the c pawn and atone for his mistake on move 1, by getting his second central pawn back.",
        "7... Qd7": "This one has me totally stumped. It is clear to me that black's development is going to be ...Nc6, ...Bd7, and ...O-O. To waste time repositioning the queen to the square the bishop needs to go to seems incredibly wrong. Can black be thinking of a fianchetto with the light bishop? But if so, why move the queen at all? Very curious this is.",
        "8. b3": "Looking to take control of the long diagonal with Bb2.",
        "8... O-O": "Can't argue with an early castle. Neglecting his king's safety is one of Shawn's weaknesses, and he is refusing to let it be his downfall in this game. Good decision!",
        "9. Qc2": "White continues his odd development, but perhaps he is planning to take a shot at the h pawn with Bd3.",
        "9... Nc6": "And black is clearly superior. He is ahead in development, has more space, and has a safer king. White must play carefully the next few moves or he will be positionally lost.",
        "10. a3": "And instead of developing a piece, he wastes time with a meaningless pawn push. Danger, Will Robinson, Danger!",
        "10... a6": "I feel conflicted about this move. On the one hand it doesn't help the light bishop get developed, and completing development should be black's highest priority. On the other hand, it may induce white to trade the knight for the Bd6, which I have pointed out would be good for black. Besides the reasons I gave on move 7, there is, now, another reason 11. Nxd6 cxd6 would be good for black. With white's queen on c2, black can play ...Rac8 and take control of the newly opened c-file with tempo against white's queen. If white refuses to trade, and plays the knight back to c3 (the only safe square), he is admitting his knight sortie was ill-advised.",
        "11. Nxd6": "White does win the two bishops, but black is still ahead in development, and now has a chance to repair the damage to his pawn structure caused by his first move.",
        "11... Qxd6": "But black commits what I think is a positional blunder. Not only does he allow white to keep a central pawn majority, but he forgoes a chance to open, and then control, the c-file. In black's defense, this move does get his queen out of the way of the bishop, in case he doesn't want to fianchetto.",
        "12. Bb2": "White finally develops a piece, and it is to a good square. This bishop will pressure the long diagonal, and now it is white who, after Rc1, can play on the half-open c-file.",
        "12... Be6": "Black's light bishop finds a home and eyes white's b pawn.",
        "13. b4": "Neglecting to develop his last minor piece, white wastes time, and creates holes, with a pawn push.",
        "13... Bd5": "Although I would have preferred ...Rac8 to prepare the ...c5 break, this move does do something interesting. Now that the g2 pawn is attacked, white can't develop his light bishop right away. A problem with black's plan is that white can simply play 14. e4 and chase the bishop back.",
        "14. Nf5": "Attacking the queen, but there are several safe squares to go to.",
        "14... Qe6": "And black finds a nice centralized one that sets up a battery. One way to use the battery would be to skewer a white rook that ends up on d1 with ...Bb3.",
        "15. Ng3": "Realizing his original idea had no point, but now white has wasted two tempii.",
        "15... Rad8": "It is right to get the rooks on central files, but I would have put this rook on c8 (opposite the white queen) and the f-rook on d8.",
        "16. d3": "Don't see the point of this move. White needs to finish development with Be2 and O-O. This pawn move simply wastes another tempo.",
        "16... e4": "And now it is black who attacks prematurely. Black's rook on f8 should be re-positioned before black starts to move forward. It is best to go into the fight with your WHOLE army participating.",
        "17. d4": "And white locks the center to help protect against an attack on his uncastled king.",
        "17... Ng4": "Is this to get out of the way for ...f5? If so, I like the idea, as it gives a justification for keeping the rook on f8.",
        "18. Be2": "And white finally gets his last minor off the back rank.",
        "18... f5": "And black does follow up with ...f5. Looks like the f-file is going to get at least partially opened, and I wouldn't be surprised if black tries to get all three major pieces on it. I like black's chances here.",
        "19. Rc1": "And this is white's counter-play: the half-open c-file.",
        "19... f4": "Continuing the pawn advance to force open lines.",
        "20. Nf1": "I don't like this move, as it prevents castling. I think better would have been Nh5, when the knight can get back to f4.",
        "20... f3": "This surprised me. I fully expected ...fxe3 21. Nxe3 Nxe3 22. fxe3 and black controls the open f-file to trap the white king in the center forever.",
        "21. gxf3": "This gives white the half-open g-file, so that Rg1, in conjunction with the Bb2, will give white pressure on g7.",
        "21... exf3": "Closing the f-file for now, but maybe a piece sac on e3 will allow this pawn to advance in the future.",
        "22. Bd3": "Menacing the h7-pawn.",
        "22... Nf6": "Protecting h7, but leaving the f3-pawn hanging out to dry.",
        "23. Nd2": "And white takes quick aim at the weakness.",
        "23... Qh3": "A provocative move, but I don't see an immediate threat. Perhaps this was just over-protecting f3.",
        "24. Bc4": "Offering to trade is a good way to defend, and white actually has the opportunity to seize the initiative if black is not careful.",
        "24... Qg2": "Winning the h-pawn, as Rf1 is forced.",
        "25. Rf1 Qxh2": "Black has won a pawn, but this opens lines against the black king. White can really get started now with 26. Bxd5 and 27. Nxf3.",
        "26. Bd3": "But white has other ideas. Not sure what they could be, but I am anxious to find out.",
        "26... g6": "Yuck! This can't be a good move. Not only does it weaken the dark squares around the black king, it invites a sac on g6 to rip away the black king's only pawn cover. Hard to believe, but the white king would then be safer than the black king!",
        "27. b5": "White now redirects his focus to the queenside, where his latent pressure on c7 is about to become real.",
        "27... axb5": "Not good, but black had little choice.",
        "28. Bxb5": "And it is white with the initiative!",
        "28... Ng4": "A curious move. Is black thinking about a sac on e3? Maybe hoping for a swindle like 29. Bxc6 Nxe3 30. fxe3 Qe2#. But I doubt white will oblige :)",
        "29. Bc4": "Apparently white can't decide how to proceed. That is not good. It is almost better to pursue a bad plan than to move without any plan.",
        "29... Ne7": "Protecting the bishop so the Rd8 is free to move, or looking at f5 to put more pressure on e3? Not sure which it is, but I'm sure we will find out shortly.",
        "30. Bxd5+": "White finally pulls the trigger to start removing the blockaders of the central pawns.",
        "30... Nxd5": "Not only pressuring e3, but protecting c7.",
        "31. Nxf3": "?? This is an unfortunate blunder that ruins an otherwise interesting game.",
        "31... Rxf3": "Black has all sorts of tactics against f2 and e3.",
        "32. Ke2": "? This loses the f-pawn, and subjects the white king to a hunt.",
        "32... Rxf2+": "! Let the hunt begin...",
        "33. Rxf2": "Forced to save the queen.",
        "33... Qxf2+ 34. Kd3": "Of course not 34. Kd1 Nxe3#",
        "34... Qxe3+": "Slurping up pawns as she chases her quarry.",
        "35. Kc4": "Forced.",
        "35... Nb6+": "Black's attack is temporarily stalled, but he gives a check anyway. I would have preferred ...Qe6 setting up a discovered check.",
        "36. Kb4": "Probably best. The king doesn't want to get too far away from his friends.",
        "36... Nd5+": "Not a good sign. The attacker should not be repeating moves, but perhaps black has decided to try my suggestion after all.",
        "37. Kb5": "But rather than repeat the position with Kc4, white moves his king too far from his friends. From here, white will have to give up his queen to avoid mate.",
        "37... c6+": "Here are the lines:\r\nA) 38. Ka4 or Ka5 and ...Ra8#\r\nB) 38. Kc4 b5  39. Kc5 (forced) Qe7#\r\nC) 38. Kc5 Ne5 and the only defense to 39...b6# is 39. Qb3 Qxb3 with an easy win for black.",
        "38. Kc5 Ne5": "Threatening ...b6#",
        "39. Qa4": "Overlooking the threat.",
        "39... b6#": ""
    },
    "url": "https://gameknot.com/annotation.pl/solohawk6_9s-mini-tournament?gm=1844",
    "gameName": "solohawk6_9's mini-tournament",
    "players": "crenshawjohn (1295) vs. shawnjay (1334)",
    "opening": "English opening (A10)"
}