{
    "moves": {
        "1. e4": "\"I'm Woody, Howdy howdy howdy!\" ( The Shark from Toy Story) I'm bored, so I figured that I'd try annotating something to help pass the time before I continue playing \"Summon Night\" on the GBA.\r\n\r\nNormal opening. If you haven't seen this in my other annotations, you must be Oedipus or something.",
        "1... e5": "I hate it when they do that.",
        "2. d3 Qf6": "I swear... if he thinks he can nab me in 4 moves...",
        "3. Ne2 Bc5": "Ya SEE?! Oh, I wonder, wonder, whom I, do I, UH! What's in a Wond- oh, Uh, \"I wonder how often he succeeds with the 4-move checkmate...\"",
        "4. f4": "I could only hope he'd be ballsy enough to take it.",
        "4... Qb6": "This worried me.",
        "5. Kd2": "I worried he would move his bishop to f2, then next move he'd move the queen to e3, so I figured that I'd have to move my king out to be a little more active than usual.",
        "5... Qa5+": "Good thing he went for that check, he could have used his former position to put me in some really awkward positions.",
        "6. c3 Nc6 7. a3 b6": "that's when I discovered that the two lone pawns there wouldn't be enough. It needed some Divine protection to survive.",
        "8. Kc2 b5 9. fxe5": "I figured it would throw off the knight...",
        "9... Nxe5": "which it did.",
        "10. b4 Qa4+ 11. Kd2 Ng4 12. Qxa4": "THAT probably caught him off guard.",
        "12... bxa4 13. bxc5": "And now I'm up 3 points and it's a question of who can play better without their queen.",
        "13... Ba6": "It occured to me that he was planning on sacrificing his last bishop to get my rook with  \r\n14. . . .     Bxd3 \r\n15. Kxd3  Nf2 ",
        "14. c4": "mooove, B! get out the way! Get out the way, B, Get out the way!",
        "14... d6 15. cxd6": "might as well... besides, Doubled up pawns aren't always a good thing.",
        "15... cxd6 16. Nbc3 Ne7 17. Nxa4": "Snag me a free pawn...",
        "17... Nc6 18. Ke1": "Frees up my dark Bishop. I figured that it was bad to have 4 of my back row pieces still unactivated.",
        "18... Nce5": "Knight Defense?\r\nThat, and it sets his knight upto fork my king against my bishop and would destroy my pawn defense against the enemy's light bishop.",
        "19. Nec3": "pumps up the defense, frees up the bishop.",
        "19... g6": "I don't really \"get\" this move... Maybe to  set up for f7?",
        "20. Nd5": "I REALLY want to get that 3-way fork on 21. Nc7",
        "20... Kd8": "awww foink...",
        "21. h3": "Force that knight away...",
        "21... f5": "What the hoo-hah?",
        "22. hxg4 fxg4 23. Bg5+ Ke8 24. Nc7+": ""
    },
    "url": "https://gameknot.com/annotation.pl/some-team-match-against-somebody-from-somewhere?gm=603",
    "gameName": "Some team match Against somebody from somewhere...",
    "players": "judgeman (1152) vs. chelskipotter (1153)",
    "opening": "KP (C20), Indian opening"
}