{
    "moves": {
        "1. e4 e6": "I decided to use the French Defence for its superior structure and difficult-to-penetrate barriers. ",
        "2. d4 d5 3. e5 Nc6": "I should have played 3. . . c5; instead, I decided to develop my knight. ",
        "4. Bb5 Bd7 5. Bxc6": "White takes on c6 forcing an exchange and preventing c6 unless I decide to lose a tempo. ",
        "5... Bxc6 6. Ne2 Be7 7. O-O f6 8. Bf4 Qd7 9. exf6": "9. exf6 is good for black because I can now develop my knight and recover a piece -- two birds with one stone. ",
        "9... Nxf6 10. Nbc3 O-O": "I should castle long here.  White's idea is to attack on the king side, and I am a pawn short on the f-file. ",
        "11. Ng3 h6": "I play 11. . . h6 with idea 12. . g5.  In retrospect, I lose a tempo on a weak move. ",
        "12. Nh5 g5 13. Be5 Ne4": "I am looking to exchange material with 13...Ne4?, and white obliges with 14. Nxe4.  ",
        "14. Nxe4": "But 13...Ne4 gives white space, puts another white piece on the attack, and places black at a disadvantage.  My saving grace, however, is the pawn on d4. ",
        "14... dxe4": "I have to commit to 14...dxe4 and end up with ineffective doubled pawns.  In effect, I lost control of crucial center squares e4 and c4 and weakened my pawn structure.  ",
        "15. b4": "I refuse this trap.  After 15...Bxb4 16. Nf6+ Rxf6 17. Bxf6, black would have lost a rook for a knight.  ",
        "15... Qd5 16. Qg4": "White activates the queen for the king-side attack. ",
        "16... Bd6": "With 16...Bd6?, I plan to exchange dark-squared bishops, but white sees it differently.  I forgot my ideas at 15. and regretfully leave f6 open. ",
        "17. Nf6+": "17. Nf6 thwarts my plan.  Now I have to play 17. . . Rxf6 to save my queen.",
        "17... Rxf6": "In desperation, I still don't see a better move without putting my king in deeper peril.  ",
        "18. Bxf6 Qf5": "I sense impending danger in 19. Qh5 . . . 20. Qh6+. . . 21. Qh7++, so 18. . . Qf5 seems feasible.  At this point, I would like to get the queens off of the board.  If white denies an exchange, then my fork will yield white's bishop.  If white exchanges queens, black gains an improved pawn structure. ",
        "19. Qh5": "White denies the exchange.",
        "19... Qxf6": "I am able to recover material and thwart white's king-side attack.  I am still sans one rook, but I have both bishops. ",
        "20. f3 e3": "Black gains a passed pawn. ",
        "21. Rae1": "But white denies. ",
        "21... Bb5": "21...Bb5 attacks the blocked white rook on the f-file, and white takes the passed pawn.",
        "22. Rxe3": "22. Rxe3?",
        "22... Bxf1": "After 22. . . Bxf1, I am finally in a good position to win.",
        "23. Kxf1 Bxb4 24. d5 e5": "I decided against 24. . . exd5 because it would open the e-file for white. ",
        "25. c4 Rd8": "Black activates the rook to center.",
        "26. g3 Bc5 27. Rb3 e4": "I should have played 27...b6 to stop the rook on b3.  Instead, I looked to get a passed pawn with the pinned pawn on f3. ",
        "28. Kg2 e3": "28. . . e3 gains a valuable passed pawn. ",
        "29. f4 Re8": "29. . . Re8?? was a fatal blunder.\nTwo of my weaknesses are the queen and bishop on the periphery.  I was blind at this point. \nI should have come up with a plan to de-position, exchange, or capture white's queen. ",
        "30. Qxe8+": "20 Qxe8+ sealed my fate.  White will win. ",
        "30... Kg7 31. Rxb7 gxf4 32. Rxc7+ Be7 33. Rxe7+": "33. . . Qxe7 would only be met with 34. Qxe7+ and the win was a matter of promotion or bringing in the king for mate.  Resignation here was necessary. ",
        "33... Qxe7 34. Qxe7+ Kh8 35. Qf6+ Kh7": ""
    },
    "url": "https://gameknot.com/annotation.pl/some-foolish-mistakes?gm=37828",
    "gameName": "Some Foolish Mistakes",
    "players": "billpkelly (1219) vs. sblack (1254)",
    "opening": "French (C02), advance variation"
}