{
    "moves": {
        "1. g3 Nf6": "Team match, and I'm playing black. My opponent is rated 2 points higher than me when the game begins. White begins with Benko's Opening. I've never seen this before, so it should be fun. It ranks 5th in popularity of all of white's possible 1st moves. Interestingly enough, a couple hundred years ago this opening was called The Rat. I decide to catch the rat with the Indian system.",
        "2. Bg2 e5": "The only move I could find in any quick reference was 2. ... d5, but the GK DB seemed to like 2. ... e5 just as well, so I tried it this way.",
        "3. e4 Bc5 4. Nc3 O-O": "Just developing.",
        "5. Nf3 Nc6": "We seem to have reached a sort of Konstantinopolsky Opening, though not following the usual move order (2. Nf3 3. g3 4. d3 5. bg2). Even that's not quite right, but the closest I can find.",
        "6. O-O d6 7. h3 Be6": "White kept the black bishop off of g4, but he weakened his castle to do it.",
        "8. d3 a6": "Aniticipating the inevitable Nb5, and also preparing b5 for a black pawn if the desire arises.",
        "9. Bg5 h6 10. Bxf6 Qxf6": "White pins, black forces the issue, and white exchanges. Black now has the bishop pair.",
        "11. a3 Qg6": "Looks like the white pawn at f2 is pinned, maybe black can exploit it.",
        "12. b4 Ba7": "White attacks black's bishop and he has to be saved first.",
        "13. Nd5 Qxg3": "White's knight threatens the pawn at c7 but black is hunting bigger game.",
        "14. Nxc7 Bxh3": "Threatens mate on g2.",
        "15. Ne1 f5": "White played the only defense. Black intends to open the f-file for more pressure, or to put a rook on g6, whichever comes first, and maybe both.",
        "16. Qf3 Qxf3": "White alleviated the pressure, so black decides to exchanges some material.",
        "17. Nxf3 Bxg2 18. Kxg2 Rac8": "Saving the black rook that has been en prise for 5 moves and driving away the white knight.",
        "19. Nd5 Rf7 20. Rad1 Rcf8": "Doubling rooks on the soon-to-be-half-open f-file.",
        "21. c3 fxe4": "Not 22. dxe4? or white loses his knight on f3. White's 21st move, 21. c3? should probably get a ? for allowing black this continuation.",
        "22. Nd2 Rf7xf2+": "Winning another pawn.",
        "23. Rxf2 Rxf2+ 24. Kg3 exd3": "This doesn't really win another pawn since black can't hold onto it, but it prevents white from gaining a pawn with dxe4.",
        "25. Ne4 Rf7": "Defends the pawn at d6. If white plays 26. Nxd6?, black replies with 26. ... Rd7 skewering the two knights and winning one of them.",
        "26. Rxd3 Bb8": "Now that the white rook would defend the skewered knights, black must see to the defense of d6.",
        "27. Nb6 Ne7": "Well, that tears it. It's two-on-one attacking the doomed black pawn on d6. Black can't save it. Or can he? I entered the next two conditional moves and crossed my fingers. No, not hope chess, because the move was necessary to save the pawn either way, but I was hoping for a happy outcome.",
        "28. Nxd6 Bxd6 29. Rxd6 Nf5+": "White took the bait and now he loses a rook. That d6 pawn sold his life dearly. Sometimes the best defense is to not defend.",
        "30. Kg2 Nxd6": "30. Kg2 seals white's fate. Yes, it was fairly well sealed anyway, but now his king is trapped and will never be able to get past the black rook. 30. Kf3 seemed to be called for, so the white king would at least have a chance to stop the pawn on the e-file from promoting, and he might also support his own queenside pawn majority, although it would mean he could never reach black's passed pawns on the g and h files.",
        "31. Nd5 Nc4": "The white king cannot reach his own pawns, nor can he reach the passed black pawn on the e-file. White's knight is the only piece that can prevent that passed pawn from promoting, and black's move 31. Nc4 covers the pawns advance. At this point, that pawn will promote, or it will cost white his only remaining piece to stop it.",
        "32. a4 e4": "White saved his pawn, but that is why black played 31. ... Nc4. After black advanced the e-pawn, white realized he had to sacrifice his knight to prevent the promotion, and he chose to resign instead of play out a hopeless endgame down by rook, knight, and pawn - and black was never going to let that white king cross the f-file so support the white pawns. A small point of interest: it took 46 days to play 32 moves, and at least three of the moves here at the end (black's 28th, 29th, and 32nd) were entered as conditional moves. During that time my GK rating increased 197 points (including 5 from this win) and I'm now rated 253 higher than my opponent, a 255 point swing. A lot can happen in a month and a half. Our other game ended much more quickly, and much more abruptly, on 2/13/09 and can be found in the public annotations on that date titled \"The Price of Slow Development\"."
    },
    "url": "https://gameknot.com/annotation.pl/sometimes-the-best-defense-is-to-not-defend?gm=22304",
    "gameName": "Sometimes the Best Defense is to Not Defend",
    "players": "schlepy (1506) vs. blake84120 (1504)",
    "opening": "Benko's opening (A00)"
}