{
    "moves": {
        "1. e4": "An over the board game; the fifth round of the Viennese youth championship. My opponent was rated about 300 points higher than me, so I was pretty much the underdog. We played with 90 minutes each, plus 30 seconds per move.",
        "1... c5": "Standard Sicilian. ",
        "2. Nf3 d6 3. d4 cxd4 4. Nxd4 Nf6 5. Nc3 a6": "He goes for the Najdorf. I am playing this myself sometimes and it often leads to razor-sharp positions. Not too bad for me, since it gives him opportunities to make mistakes. In a blitz-game only five minutes before this game I had lost a Najdorf as black quite badly, which my opponent had seen, so I suppose he did not think I know this variation very well. (And, truly, I don't.)",
        "6. Bg5": "By now I'd probably play Be3, but the move is perfectly fine (and sharper). ",
        "6... e6 7. f4": "We're still in the opening book, which (not surprisingly) goes much, much further. At this point none of us had invested any time in his moves. ",
        "7... Nc6": "He played this move in blitz tempo and I saw myself confronted with an unnknown position. In the previous round my opponent had also side-stepped the main variations (of the Semi-Slav) with a theoretically \"unsound\" move and achieved a great advantage, for these side-variations can be hard to refute in over-the board games. \n",
        "8. Nxc6": "It took me quite a while to decide to capture the knight. The other possibility would have been to complete development with, say, Be2 but I thought that, normally, at this stage Black prevents the e5-thrust, which Nc6 doesn't. Therefore the logical plan would be to play e5 and force him to weaken his kingside. ",
        "8... bxc6": "Still blitz tempo, but then, what else should he do?",
        "9. e5": "Logically. It seems a bit absurd to me, though, that white is attacking despite not having completed development. Still, in this respect, black is not better. ",
        "9... h6": "This is forced unless black wants to play with a piece less. (It wouldn't have bothered me, though.)",
        "10. Bh4 g5 11. fxg5": "Now I had to give up my little pawn chain and the e5-pawn was destined to die. But I thought that I might get quite some pressure on the kingside to compensate for that. He is behind in development - even more so if he plays dxe5. If he doesn't, I can play exd6, after which his pawn structure is no better than mine if we reach an endgame. At this stage I found it rather unlikely, however, that we would reach an endgame. The position is absolutely not balanced; a perfect setup for a future tactical strike. ",
        "11... Nd5 12. Nxd5": "The main alternatives would have been Ne4 or Qh5. The Nd5 seemed a strong piece to me; after my two pawns on e5 and g5 are gone (which I was sure they would be soon) it might come back to f6 as a defender. Also, I did not want it to be able to exchange on c3 after 12.Qh5 Nxc3, leaving my queenside wide open should he ever want to attack there. Looking through this right now, I wonder whether this does actually matter by now. It is quite obvious that my king will not be safe wherever he goes - nor will his. ",
        "12... cxd5": "Yay, I got him to think for at least five minutes! This was more psychological. For now I knew that he was not playing theory any more, which I always consider reassuring. Especially since the last round I had lost (in a Najdorf) after about 20 moves; my opponent had used about three minutes of his time and only played theory until I was dead lost. ",
        "13. Qh5": "Obviously. Pressuring f7, since his knights are gone. Except for that, I was playing with thoughts not so much of gxh6 but rather g6, discovering an attack on his queen, and also some faint ideas of a sacrifice. ",
        "13... Qa5+": "Preventing any discovery, also trying to get the initiative. ",
        "14. Kd1": "?! Imprecise, I think. I did not want to play 14.c3 because of 14...d4 and e5, c3 are hanging, but it would have worked out just fine: 14.c3 d4?! 15.Be2 dxc3 16.0-0 and White must be better. ",
        "14... Qc7": "?! To protect f7. If he doesn't do so I can already play g6, but after the game we came to the conclusion that 14...Ra7 was much stronger. It does protect f7 as well without restricting the queen. But, just to give you an idea how complex the position is, another possibility would have been 14...Qb4!?, eg.15.g6 Qxb2 16.gxf7+ Kd8 17.Rc1 dxe5, which - to me - seems to be rather equal. ",
        "15. g6": "Which point do I want to attack most? f7. So what to do? Throw as many attackers on it as possible. Note that after 15...fxg6 16.Qxg6+ Qf7 17.Qf6 Qxf6 18.exf6 White is a pawn down and might convert this into a win - or, at least, he is not worse. This was enough for my opponent to refrain from it, since I was, after all, the underdog. (Sometimes there are huge advantages in this...)",
        "15... dxe5": "So he decides to build an impressive pawn center. Unfortunately, this was exactly what I was hoping for. 16.gxf7+ Qxf7 17.Qxe5 or 16.Bf6 Rg8 17.gxf7+ Qxf7 18.Qe5 both lead to a good position for White, but...Can you guess the next move?",
        "16. Bb5+": "I invested about thirty minutes before this one. The idea had first occured to me after move 13, and I could simply not find a refutation. He has no squares where to move his king and 16...Bd7?? 17.gxf7# is checkmate, so he has to take. Even after the match, assisted by a master, we did not find the correct refutation. There is one, but it by far exceeds both our abilities to calculate. Now the question is: can you call, considering the circumstances, such a sacrifice sound? I would call it at least beneficial, but still I'd like to know how you think about such moves (and whether you would play them or not). \nThe problem in this particular case also was that, as written in the last comment, I had another good option, too, but was not sure whether I had the necessary technique to win it. (And besides, it looked so much nicer...)",
        "16... axb5": "Forced. ",
        "17. Rf1": "The point behind the sacrifice. How should black defend f7? 17...Ra7? fails to 18.Rxf7 Qb6 19.Rxa7 Qxa7 20.g7+ +-. Now the position gets immensely complex. What I thought of was 17...Qc4 18.Rxf7 Qd4+ 19.Ke2 and had calculated that I would manage to hide on h1. Whatever variation I thought of, it was a miscalculation, though. Still, after 18...Qd4+ White can, with very precise play, win - at least every variation I have found. Eg. 19...Dc4+ (19...Rg8 20.g7 De4+ 21.Kd1 +-, 19...Qe4+ 20.Kf1 Qc4+ 21.Kg1 Bc5+ 22.Kh1 Rg8 23.Rc7! +-, 19...Bc5 20.g7! Qe3+ 21.Kd1 (21...Qg1+? 22.Rf1+)+-) 20.Kf2 Rg8 21.g7+-. \nIs there anything better for Black after 17...Qc4? If so, I'd be interested to know. In any case, I am quite sure neither of us was even close to being able to calculate this. \nWhat he would have had to find was 17...Ra4!, with the main variation 18.Rxf7 Rd4+ 19.Kc1 Rxh4 20.Qxh4 Be7 21.Qh5 Rg8 -/+. We did not even consider this move. ",
        "17... fxg6": "I was a bit surprised, he makes it rather easy for me. ",
        "18. Qxg6+ Kd7 19. Rf7+": "And his queen is gone. ",
        "19... Kc6 20. Rxc7+ Kxc7 21. Qf7+": "? I was exhausted from calculating and now I didn't want to lose control of the happenings. Still, with 21.Bf6! I would have almost forced resignation because he cannot prevent the loss of another piece. ",
        "21... Bd7 22. Bf6": "One move too late...",
        "22... Bd6 23. Bxh8 Rf8": "And now there was the possibility to go into a safely won endgame, which I gladly took. (Otherwise he can play 24...Rf1+, 25...Rxa1.)",
        "24. Qxf8 Bxf8 25. Bxe5+ Bd6 26. Bxd6+ Kxd6 27. Kd2": "Exchange and pawn up - even considering my knowledge of endgames, this should be enough. ",
        "27... e5": "His only hope, the central pawns. ",
        "28. c3": "Preparing to stop them. ",
        "28... b4": "Now if 29.cxb4 White should still be lost but could put up more of a fight - his central pawns could prove quite a pain...",
        "29. Rf1": "No, I'm not taking it. ",
        "29... bxc3+ 30. bxc3": "And after this he will never get two central passers and my rook is just too ready to invade and fest on his pawns, so he chose to resign.\nHope you enjoyed it, thanks for reading. "
    },
    "url": "https://gameknot.com/annotation.pl/sound-or-just-beneficial?gm=32306",
    "gameName": "Sound or just Beneficial?",
    "players": "Archaeopteryx  vs. N.N. ",
    "opening": "Sicilian (B96), Najdorf, 7.f4"
}