{
    "moves": {
        "1. e4 e5 2. Nf3": "The most common response, but this is new territory for me as white -- I usually play the Vienna game.",
        "2... Qf6": "?  Unusual, for sure, but I didn't see an immediate way to exploit it, so I just went ahead and developed...",
        "3. Bc4 c5": "Again, not what I was expecting.  Black is cementing d4 (possibly for a knight), but has only his queen developed and just made a hole on d5.",
        "4. O-O": "Maybe this is premature, but again, I just figured on gaining a large developmental advantage.  Maybe, however, d3 was better here.",
        "4... d6": "Giving me the d5 outpost for my knight.",
        "5. Nc3": "...so I prepare to grab it.",
        "5... Ne7": "Challenging d5, and this is the only logical square to develop the knight with the queen on f6.",
        "6. d3": "Threatening Bg5.",
        "6... h6 7. Nd5": "?!  This is definitely premature; I don't know why I played this.  Perhaps I thought that after Nxd5 Bxd5, it's nice to have a pin on the b-pawn?  Still, many moves (such as Be3 or Re1) were better.",
        "7... Nxd5 8. Bxd5 Be7": "Black's dark-squared bishop is very bad.",
        "9. c3": "This doesn't really make much sense here -- White needs to be getting his remaining pieces into action.",
        "9... Qg6": "With the transparent threat of Bh3.  Rather, with the threat that I underestimate, of Bh3.",
        "10. Re1": "Seems logical enough, but I don't realize that after something like Bh3 11. g3 Bg4, the pin on the knight is very strong, and with the queen there as well, I will be tied to the knight's defense.",
        "10... Nc6": "This move makes the bishop on d5 look silly -- so much for my phantasmal positional advantage.",
        "11. Be3": "?  I don't realize it now (or ever, until it's too late), but the e3 square needed to remain open so that the rook could rush to e3 and help defend the knight if necessary.",
        "11... O-O": "Getting his king out of the center before starting tactics -- usually a good move, but in hindsight, I don't know if I would've bothered here.",
        "12. d4": "?  Again, Bh3 is too strong for black, and white does nothing to address that here.  As a result, this is going to wind up hurting me a lot more than it hurts him -- it's long been said that a flank attack is best met with a counterattack in the center, but I need to be playing some defense here...",
        "12... Bh3": "!  This allows black a big advantage.  At this point, I realized my huge oversight, and wondered if it was too late!  I knew it would take some good defense and some luck to get out of this!",
        "13. g3 Bg4": "Oh, that knight looks AWFUL now!",
        "14. Bxc6": "Plowing ahead with my \"central counterattack\".  Yeesh.",
        "14... bxc6 15. dxe5": "I see the (perhaps) saving tactic of 15. dxe5 dxe5 16. Nxe5, allowing white to break the pin with at least an equal game.",
        "15... Rad8": "!  But this move is much stronger for black.  Now, I definitely CAN'T allow dxe5, or Nxe5 is met by Rxd1!, crushing white.",
        "16. exd6": "White is forced to walk the plank to stay in the game...",
        "16... Bxd6": "!  Very strong, as it threatens Bxg3 where white cannot recapture due to the threat on the queen.  Also strong is Rxd6.",
        "17. Nh4": "Desperately trying to exchange out the menacing black pieces.",
        "17... Qh5": "Forcing the queen to move off of d1.  At this point, I see that black is going to play g5 next, forcing the knight to move.  So I took a few days to think, and found...",
        "18. Qa4 g5 19. f3": "!?  This is a great defensive try, making the game very complicated.  This is why the queen went to a4 instead of b3, because if black wants to preserve the bishop, he can't attack the queen by retreating to e6.  Now black has many ways to win a pawn, and chooses...",
        "19... gxh4": "Forcing an exchange and opening up lines to both kings, and making the game very dangerous!  I want more complications -- I figure it gives me more tactical chances to turn the tables.",
        "20. fxg4": "The only logical follow-up.",
        "20... Qxg4": "!  Black's strongest response.  The g3 pawn is pinned and black threatens to win the house with hxg3 hxg3 Qxg3 ",
        "21. Qd1": "This defends against that threat, but black has many more.",
        "21... Qg6": "Still threatening hxg3 winning.",
        "22. Qf3": "!  Good defense.  Now, black can win a pawn with hxg3 (and white cannot recapture as black will have an overwhelming endgame after Qxg3 ), but the game definitely remains in doubt.",
        "22... hxg3 23. Kh1": "!  If black gets greedy and grabs the h-pawn, Rg1! wins the queen and the advanced pawn for two rooks.  If he pushes g2 , Qxg2 leads to an equal game.  But black is still for choice here.",
        "23... Kh7": "Stepping out of the future pin.",
        "24. Reg1": "Again, preventing gxh3.",
        "24... f5": "Wisely getting all of his pieces into the attack and opening up the board for maximum maneuverability.",
        "25. exf5 Rxf5": "And at this point, I realized I was down a pawn and was running out of defensive resources.  So naturally, I did what anyone would do...",
        "26. Qxc6": "grabbed a pawn?!  This basically tells black to prove it!",
        "26... Rdf8": "Rh5 was the move I was really afraid of.",
        "27. Qa6": "The f1 square had to be defended, or black threatened 27. ... R5f1 28. R(any)xf1 Rxf1 29. Rxf1 g2 , winning.",
        "27... Rg8": "Now g2 needs to be defended, or 28. ... g2  29. Rxg2 Qxg2# is checkmate.",
        "28. Qe2": "White's best defensive move (the other option was Rg2).",
        "28... Re8": "Another nasty pin.  But possibly the winning move was Re5, since after 29. Qf3 (the only way to defend g2 and e3 while stepping out of the pin), Rxe3 wins.",
        "29. Qd3": "This is a good move, since there's no more mate threat on g2, and this is an effective pin of the Rf5 to the queen and king.",
        "29... Qh5": "Threatens mate on h2, but this is easily defended by Rg2.  Black may win a pawn again, but the pin on the Rf5 is more important than he thinks.",
        "30. Rg2 Rd8": "?  After all of black's play, this move costs him everything.  Black thinks he's going to get a great discovered attack on the queen after Bc7 or Be7, but in reality, he's just stepped INTO a brutal pin.  And this is because...",
        "31. Bxc5": "!  The rook on f5 is stuck, and a recapture with the bishop would leave the rook on d8 hanging!  At this point, I thought Bc7 offered black the most chances, but he chose to go to an inferior endgame with...",
        "31... Qf3": "?  Perhaps overlooking that after exchanges of the queens...",
        "32. Qxf3 Rxf3 33. Bxd6": "...white can exchange off the two minors...",
        "33... Rxd6 34. Rxg3": "And win another pawn, giving him a decisive endgame advantage.",
        "34... Rf2": "Black fights on for 25 more moves, and white almost blows it AGAIN, but right now white has a huge edge, and, in fact, threatens mate with his next move...",
        "35. Rag1": "But this is easily parried and is unproductive for white.",
        "35... h5 36. Rg3g2": "Getting the rook off of the second rank...",
        "36... Rxg2 37. Rxg2 Rd1+ 38. Rg1 Rd2": "Where it's replaced by his brother.  At this point, I should have remembered my endgame principles, put the rook behind the c-pawn, and just marched to victory.  Instead, I made it... er... exciting.",
        "39. Rb1": "? Why would I want to hold on to a second pawn?  If I played Rc1 here and just started pushing, black could've played Rxb1, Rxa1, Rb1, and pushed the a-pawn all he wanted -- I would've gotten there first.",
        "39... h4": "Still not too late for me to play Rc1...",
        "40. a4": "Geez, it's like I'm trying not to win.",
        "40... Rc2": "Well, black knows what to do.  The best place to put a rook is behind a passed pawn, no?",
        "41. Re1": "\"threatening\" Re7 , forking king and pawn.  Do I even realize that if black plays h3 and I move the rook, Rc1 is checkmate?",
        "41... Kh6": "Guarding against the \"threat\".",
        "42. Re4": "h3 followed by Rc1 is checkmate...",
        "42... Kh5 43. Rb4": "This is NOT the best way to advance the c-pawn.",
        "43... a5 44. Rb5+": "\"forking\" king and pawn?",
        "44... Kg4": "Only NOW do I realize the danger I'm in.  If I play Rxa5, black will play h3. I'll have to play Kg1 to avoid checkmate, and black will play Rc1  followed by Rc2 , winning the h-pawn and giving black the game!  \n\nI can't believe how badly I've played since move 39 -- I need to play practically flawlessly to preserve the win.",
        "45. Rb7": "Rb8 was better, but this is okay; h3 can be dealt with.",
        "45... h3 46. Kg1": "Still risky -- Rg7  followed by Rg1 would have been safer.",
        "46... Kf3": "Rc1  was better, as it gives black good drawing chances, as it's risky for white to try to avoid the perpetual check.",
        "47. Rf7+": "!  Finally doing what I should've done a long time ago; putting the rook back on the back rank, where it can participate in defense as well as assist the c-pawn.",
        "47... Kg4 48. Rf1 Rxb2": "???  This loses, as now white can put his rook behind the c-pawn and march (like he should have 10 moves before).  But if black had wasted a move (like, Kh4 or Kh5 or something) he would have had more chances with his advanced position and active rook.",
        "49. Rc1": "The game is over now.",
        "49... Kf3 50. c4 Rg2+": "If white play Kf1 instead of Kh1, black has hope...",
        "51. Kh1": "Black has nothing left now -- white's fortress is impenetrable.",
        "51... Ra2": "This is simply too slow -- but to get back to the 8th rank and block doesn't have much appeal either.",
        "52. c5": "White decides to push it.",
        "52... Rxa4 53. c6": "Ahh... push it.",
        "53... Rg4 54. c7": "...puh-push it real good...",
        "54... Rg8 55. c8=Q": "<bah-BAH-dow, dow, dow, dow, do-doodle-do do doot!>",
        "55... Rxc8": "Black has to give up the rook for the queened pawn now.",
        "56. Rxc8": "There is nothing left for black -- his pawns will be wiped out and white will checkmate the black king against the side of the board.",
        "56... a4 57. Rc3+ Kg4 58. Rc4+ Kf3 59. Rxa4": "Black resigns. 1-0"
    },
    "url": "https://gameknot.com/annotation.pl/southern-chess-fall-invitational-2006?gm=4636",
    "gameName": "Southern Chess Fall Invitational 2006",
    "players": "ethansiegel (1812) vs. nicolso (1465)",
    "opening": "Greco defence (C40)"
}