{
    "moves": {
        "1. d4": "Here is my favorite game from the Southern Mississippi Open. Ever had a game where your opponent makes the moves you hope he will? It happened to me in this game, and I got the chance to go on a king hunt that was really exhilirating (at least for this class 'C' patzer:) My opponent gets his king stuck in the center and advancing, and I'm able to really make him squirm. I hope you enjoy:) As usual, I play my favorite 1. d4.",
        "1... Nf6": "Along with 1...d5, the most popular response to 1. d4.",
        "2. Nf3": "I'm heading towards Queen's Gambit territory (which I am very comfortable with). I've grown to like to play Nf3 first before c4 to protect my d pawn should the gambit c pawn be taken.",
        "2... e6": "Hmmm....perhaps my opponent is trying to steer into some line of the QGD.",
        "3. c4 Bb4+": "Here is the first instance of black playing what I was hoping for. I block with bishop, he takes, I take with my Nb1 and if he castles,  I have the opportunity for a big center.",
        "4. Bd2 Bxd2+": "Black plays as I was hoping for:)",
        "5. Nbxd2 O-O": "? I was so hoping he would do that. I now have the chance to pounce in the center big time. Much better for black was 5...d5.",
        "6. e4": "As planned. Now if black plays d5 I can push e5 and put his Nf6 on a much more passive square.",
        "6... d5": "It's weird.....I think it and he does it. Sometimes the stars just align, I guess. At this point, I feel that I will be able to establish a solid threat on his castled position after Qc2 and Bd3.",
        "7. e5 Nfd7": "Once again, black moves to the square I was hoping for. 7...Nh5 may have held more promise though. If I chase the knight by 8. g4, the knight can move to f4 safely and I may have had defensive issues on my kingside. I'm not sure I would have played g4 in that case, but I certainly would have considered it. As for the actual position, I'm feeling pretty good. I can now safely push c5 and start turning the screws on preventing black's development.",
        "8. c5 f6": "Good idea - black sees the need to open things up and threatens control of the f file.",
        "9. b4": "I liked this move, as it protects the c pawn which will be hanging after action on e5.",
        "9... c6": "? I didn't like this move for black. In post mortem, my opponent suggested that c6 was necessary in furtherance of b6. I suggested that if it was his intent to play b6, he should have just gone ahead and played it immediately, as the text restricts his Nb8 and just wastes time. It is interesting to note now that the reader should keep his eyes on black's Nb8. ",
        "10. Qc2": "Ok, I'm still with my plan to load up on the b1/h7 diagonal. I'm hoping for black to go ahead and open up the f file (and not shutting down my diagonal).",
        "10... fxe5": "I'm thinking at this moment that maybe I should be sending subliminal thoughts to my opponent about his pin number and credit card numbers:) I can safely retake the e pawn and my diagonal is viable.",
        "11. dxe5": "I did spend a little time with this one. I seriously considered 11. Nxe, but that would allow black to untangle his pieces some after NxN. Plus, my Nf3 is contemplating a move to g5.",
        "11... b6": "Black proceeds with his idea of b6 to start chipping away at my pawns, but it is a late attempt. I think Na6-c7, Ba6, or Qe8 or Qe7 were better attempts to develop.",
        "12. Bd3": "White is right on schedule and throwing a threat at h7.",
        "12... Ba6": "? Once again, black shows up late for dinner. While belatedly developing a piece, black drops a pawn.",
        "13. Bxh7+ Kh8": "13...Kf7 drops the g pawn after 14. Qg6 .",
        "14. Qg6": "!? And here is where it gets interesting. Not happy with simply having the better position, my ego gets the better of me and I play a very aggressive move. My plan is to now play Ng5 and start looking for mating threats.",
        "14... bxc5": "14...Qe8 and black can start successfully repelling the threat.",
        "15. Ng5": "Now I've reached my desired position, but am faced with the problem of not losing my bishop after Nf7 . I have my first real doubts as to the sanity of playing Qg6 so blatently. I'm not worried about black snagging the e pawn - it's black playing Qe8 that has me worried. I continue to send telepathic signals convincing my opponent that Qe8 is a BAD move;)",
        "15... Nxe5": "Aggressively hitting my queen while advancing.",
        "16. Qh5": "Ahhh....there it is. White threatens a discovered check that will cause black a great deal of pain. Qe8 no longer worries me as it can be blocked by Bg6.",
        "16... Rf6": "My opponent went into a deep think here, and played what I consider to be the only sane move. He can't prevent the check that is coming, so he starts creating an escape route for his king.",
        "17. Bg6+": "Of course. I can now play some forcing moves that will gain material.",
        "17... Kg8": "Forced.",
        "18. Qh7+ Kf8 19. Qh8+ Ke7 20. Qxg7+ Kd6 21. bxc5+ Kxc5 22. Rc1+": "A nice six move combination I cooked up back at move 17. Black goes into another long think.",
        "22... Kd6": "? This was probably the critical losing move. 22...Kb6 would have probably bought black some dearly needed time.",
        "23. Nde4+": "! My favorite move of the game, as it forces a capture which will allow me to play Ne4 , forcing black to advance his king or play Nd3  (which is easily sidestepped) or Bd3. After any of those moves, I play Rd1 and black is in a world of hurt.",
        "23... dxe4": "Forced.",
        "24. Nxe4+": "As planned.",
        "24... Kd5": "Probably the worst of three bad choices. ",
        "25. Rd1+": "This is just medieval:)",
        "25... Nd3+": "I'll give my opponent credit - he valiantly tries to save himself......however.......",
        "26. Ke2": "I can safely walk into HIS pin because his knight is pinned itself!",
        "26... Rxf2+": "Black keeps swinging. This rook was hanging anyway, so he launches a last ditch attack himself.",
        "27. Nxf2": "! Oh, this is so nice:) My Bg6 now hits the pinned knight!",
        "27... Qa5": "Black eyes grabbing my a pawn with check.",
        "28. Bxd3": "Killing the knight while keeping the pin alive.",
        "28... Qxa2+": "Gee whiz! The number of pins in this game is unreal! ",
        "29. Rd2": "Blocking the check and preparing to bring the other rook into the game.",
        "29... Bxd3+": "Black won't go quietly into that good night! He just keeps throwing every resource he has into the attack!",
        "30. Nxd3": "Yet again keeping my healthy pin alive.",
        "30... Qc4": "Black pins me right back! The only problem with that, of course, is............",
        "31. Qe5#": "Freaking brutal! I congratulate my opponent on a game well played (especially after survivng my initial onslaught). I don't find fault with his last move as he was in some serious time trouble (he had about 5 seconds left). This is one of my favorite OTB games ever. The sheer number of pins and their veracity was something I don't run across every day. It may seem like a rather mundane game to a lot of you stronger players (I know both sides made plenty of mistakes), but for patzers like me it sure was a beauty. Several of the players in this tournament hung around afterwards to compare games, and this one was awarded the \"Freaking Brutal\" award:) I hope you enjoyed it! - Thomas"
    },
    "url": "https://gameknot.com/annotation.pl/southern-mississippi-open-rd-4?gm=8571",
    "gameName": "Southern Mississippi Open rd 4",
    "players": "Thomas G. (1440) vs. Randall W. (1326)",
    "opening": "Queen's pawn (A46), Torre attack"
}