{
    "moves": {
        "1. e4 e5 2. d4": "Interesting choice........White opts to tear open the center with this aggressive move.",
        "2... Nf6": "?! An interesting move as well for black. Black attempts to trade e pawns.",
        "3. d5": "? White neglects his e pawn. 3. dxe was probably better.",
        "3... d6": "? Black declines the free pawn, while blocking in his dark squared bishop. Very poor play.",
        "4. Be2": "This game has gone off of the deep end. White continues to neglect his e pawn and develops very weakly.",
        "4... Nxe4": "! This exclamation is awarded strictly to reward black for curing his cranial-rectal inversion problem.",
        "5. Bf3": "? White RE-develops his light squared bishop. ",
        "5... Nf6 6. Bg5": "White develops, and gains a nice pin.",
        "6... Bf5 7. Nc3 Be7 8. Nge2 Nbd7 9. O-O O-O": "Both sides have now developed pieces to logical squares.",
        "10. Qd2": "Sort of slow........perhaps Re1 was stronger.",
        "10... h6": "Black starts swinging first, and attempts to kick out the pinning bishop.",
        "11. Bxh6": "?! Maybe too aggressive here. White sacs a bishop with unclear intentions.",
        "11... gxh6 12. Qxh6 Nh7": "It is possible that white did not see this block (if he were seeking a quickly drawn position).",
        "13. Qd2": "White retreats to regroup. The quick little attack he executed was summarily dismissed, and he must now come up with something else.",
        "13... Bg5": "Black keeps up the pressure on the white queen, forcing her to retreat even further.",
        "14. Qd1 Nc5": "Black positions himself for anticipated action on e4.",
        "15. g4": "? White detroys his king's protection with this extrememly aggressive move. ",
        "15... Bg6": "Black easily sidesteps.",
        "16. b4": "White is just full of all kinds of aggression. These repeated unsupported advances will be hard to justify should black be able to get in behind them.",
        "16... Nd7 17. a4": " And white has made his intentions known. He plans on queenside expansion after the Nc3 is moved.",
        "17... f5": "! White's position on the kingside is rife with attacking opportunities, so black shows some aggression of his own.",
        "18. b5": "A bit premature here, as white's c pawn is still blocked in, and b5 can no longer be occupied by the Nc3.",
        "18... Bh6": "Creating a new home for the Nh7.",
        "19. Kg2": "? Nb1 or even Kh1 make much more sense. White is walking straight into the gunfire.",
        "19... Ng5": "As planned.",
        "20. Nc1": "? Retreating even further away from the defense of the exposed king.",
        "20... e4": "Black takes advantage of white wanting to seemingly play on his heels, and forces him to retreat even further.",
        "21. Be2 f4": "! There are just too many holes around the enemy king for black not to keep advancing.",
        "22. f3": "Putting an end to any further f file action.",
        "22... Ne5": "Can you smell what the Rock is cooking?",
        "23. h3": "White prevents any sac ideas black may have on g4.",
        "23... exf3+ 24. Bxf3 Ngxf3": "Black picks up a bishop.",
        "25. Ra3": "! Deceptively strong. White loads the 3rd rank.",
        "25... Qh4": "! Threatening a forced mate.",
        "26. Nc3e2": "! Protecting the weak g3 square, and opening the door to get his 2nd rook into the game.",
        "26... Nxg4": "Black correctly calculates that he has just too much firepower bearing down on the enemy king for this not to be justified. ",
        "27. Raxf3": "White has finally coordinated his pieces in defense.",
        "27... Ne3+": "! Worst case scenario for white is gaining a rook for a knight.",
        "28. Rxe3": "Practically forced.",
        "28... fxe3": "Of course.",
        "29. Rxf8+ Rxf8": "And white resigns. I was a little surprised, as Qg1 has some possibilities. All in all a good game from my teammate utvols1:) I'm sure he will repay the favor........ - Thomas\r\n\r\n\r\n\r\n\r\nPS - Allen, if this is you reading this - forget about that payback business. I'm gonna get you again:) "
    },
    "url": "https://gameknot.com/annotation.pl/southern-chess-winter-invitational-2007?gm=4701",
    "gameName": "Southern Chess Winter Invitational 2007",
    "players": "utvols1 (1387) vs. tag1153 (1392)",
    "opening": "Centre game (C21)"
}