{
    "moves": {
        "1. d4": "Welcome to my latest OTB foray. The Space City Open in Huntsville, AL is one of the oldest and most successful OTB tourneys here in the back waters of Alabama. I talked a buddy of mine into going with me, and we both wound up with pretty good results - I finished tied for 2nd place with 3.5/5 and he  finished 3/5. Luckily for me, we didn't play each other, as he is the stronger player. It did feel good scoring more than him though:) Due to my rating, I naturally get paired the first round with the highest rated guy in the U1600 section. He is 1592, and I sense trouble right off the bat. I played this guy a few months ago at another tourney, and he destroyed me. I know that this game is gonna be tough. It may sound defeatist, but I will be more than happy to get out of this one with a draw. I play sensibly for the first few moves, IMHO, but allow him to unleash a marauding knight into my back yard that I just can't deal with. He opens 1. d4.",
        "1... Nf6 2. c4 e6": "I generally try to steer into Indian defenses, which have themes that I am comfortable with.",
        "3. Nc3": "3. Nf3 may be a little more common, but this also plays quite nicely. White knows Bb4 is coming, so he develops on the queenside first to prevent the check. I tell myself that I'm probably going to trade bishop for knight on c3, and then get in b6 to aim the other bishop at what I presume will be his castled position.",
        "3... Bb4 4. Qc2": "White develops his queen to a strong diagonal while protecting his knight.",
        "4... c5": "?! I've played this line many times before with mixed results. Sure, there was 4...BxN 5. QxB, but I want to claim some space before I play Nc6 while eliminating one of his central pawns.",
        "5. dxc5 Bxc5 6. e3": "Good play - and the kind of move that I am usually hesitant to play. White restricts his DSB, but immediately answers the question of f2 defense. White will now most likely play his DSB to its long diagonal.",
        "6... Nc6": "I sense the chance to lead in development, and deploy this knight to a strong square.",
        "7. a3": "!? This move tortured me, and put me into a long think. Is white being paranoid about me attacking his queen with Nb4? or is he planning on b4 with tempo to open up the long diagonal for his DSB?",
        "7... a6": "?! Thinking that I had the time to set up the queenside the way I wanted, I play a6 to prep b5 and to create an escape square for my DSB, as well as preparing my own fianchetto. I really should have gone ahead and castled here. I'll most definitely pay for that lapse in judgement very soon.",
        "8. Nf3": "White takes his time, and catches up in development.",
        "8... d5": "?! Again, I probably should have castled. This break is begging to be played, but in doing so I allow white solid action on the c file.",
        "9. cxd5": "Of course, as white can't allow me to play d4.",
        "9... Nxd5": "?! Mistake. I should have taken with my e pawn. Now white can dictate my next move.",
        "10. Nxd5": "Forcing my queen to retake to protect my DSB.",
        "10... Qxd5 11. Bc4": "Argh...I allow white to develop with tempo.",
        "11... Qd6": "I still have to protect my Bc5. The only other real choice of Qh5 seemed impotent.",
        "12. O-O": "White secures his king, and his position looks strong. I go into another long think and launch......",
        "12... b5": "......a typical Thomas attack which is all bark and no bite. Thinking I could force the issue on the queenside, I totally disvalued the strength of his next move.",
        "13. Rd1": "! Nice. White shows good patience, and I'm sure starts thinking of winning my DSB.",
        "13... Qc7": "? I need help. The kind of help you get on a couch. The kind that requires pills every day. 13...Qe7 and I still had some play. Now, I drop a piece.",
        "14. Bxb5": "! The best tactics are the simple ones.",
        "14... axb5 15. Qxc5": "At this point I am wondering if seppuku is as painful as it sounds. I REALLY should have castled when I had the chance. I hate this game.........",
        "15... b4": "I try to appear confident. I try to appear in charge, and act as if I had all of this already worked out in my head. It's really hard to pull off this acting job with tears rolling down my cheeks. I threaten a weak tactic of my own.",
        "16. Nd4": "! Strong. I can't take it - I can only support my Nc6.",
        "16... Bb7 17. Nb5": "! Stronger. My weak 13th is punished yet again.",
        "17... Qe7": "This is where I should have put my queen back on  move 13. The end is very near.",
        "18. Nd6+": "! Strongest. I now officially hate all horses.",
        "18... Kf8 19. Nxb7": "...and I throw in the towel. I hadn't properly noticed that this knight now protects his queen. I'm down a piece and a pawn and my Rh8 is worthless. White will have no problem cleaning up. As it is the first round, I cut my losses and decide not to waste my energy. The only real consolation that I have is that Richard winds up winning the section with a score of 4.5/5, and it's my buddy who nicks him for a legit draw in the last round. I also tell myself that every remaining game that I have will be against easier opponents. Such is life. Now I make my worst move of the tournament, and go to Cracker Barrel and load up on enough starch to guarantee that I will fall asleep during the second round. My buddy calls me an idiot, and I agree........"
    },
    "url": "https://gameknot.com/annotation.pl/space-city-open-07-reserve-rd-1?gm=11152",
    "gameName": "Space City Open 07 (Reserve - rd #1)",
    "players": "Richard D. (1592) vs. Thomas G. (1456)",
    "opening": "Nimzo-Indian (E39), classical, Pirc variation"
}