{
    "moves": {
        "1. e4 c5 2. Nf3 d6 3. d4": "Open Sicilian ",
        "3... cxd4 4. Nxd4 Nf6 5. Nc3 a6": "Nardof",
        "6. Be2": "Not the most ambitious try for white",
        "6... e5": "I chose to go with a system where black plays e5, of course this leaves the d pawn backward and the d5 square weak however black will get compensation in active piece play.",
        "7. Nb3 Be6": "Controlling d5 whilst developing",
        "8. O-O Be7 9. f4": "I hadn't expected this to come quite so soon but I suppose with most of whites army already developed it makes sense to strike.",
        "9... b5": "!? Maybe this wasn't the correct response however the idea seemed appealing the point was to allow lines where black can check the on b6 without having to worry about white playing a knight to a4 and of course the other main idea is to win a pawn in some lines by b4 followed by Nxd4",
        "10. fxe5": "I thought about throwing an I between move here by checking the black king",
        "10... dxe5": "However I changed my mind figuring that a queen exchange was probably in blacks favor however since b5 had been in order to allow for the queen check I probably should have gone with it.",
        "11. Qxd8+ Bxd8 12. Bd3 Bb6+ 13. Kh1 Ng4": "If I was to get this in it had to be played before it was prevented.",
        "14. Nd1": "Well I've forced back whites knight. I was reasonably happy with my position at this point",
        "14... Nd7": "I felt that c5 was an important square so I developed my knight to d7 as opposed to c6",
        "15. h3 h5": "!? This move is probably inaccurate as it weakens g5 and doesn't do a whole lot to help with blacks position. However I played it as more of a psychological weapon, it says to white you can't kick my knight out so easily ",
        "16. g3 Ngf6 17. Kg2": "There is nothing particularly wrong with blacks position at this point do really there was no reason for me to choose to sac a piece in the following way. Instead something like the simple ...Rc8 and black is doing well however I decide to mix things up",
        "17... h4 18. g4 Bxg4": "?! The sacrifice is bad enough as it is however even if I do want to sac a piece it should have been the knight that I sacrificed, not the bishop. However the main idea behind the sacrifice was to leave white in a position where it is very difficult to develop and coordinate the pieces, I thought by having my knight on g4 white would have a difficult time however I guess I just got lazy and didn't put enough thought into it. Because white has a reasonably easy game after this.",
        "19. hxg4 Nxg4": "The other main thing is I thought I would be able to push my pawn after the sac but I missed that white simply gets to play the king to h3. Had I foreseen that I think I would have instead saced the knight or not sacrificed at all",
        "20. Kh3 Ndf6": "I thought this risky as now white can play Be2 where I'm effectively forced to place my knight on h6 which, however it looked quite complicated and I thought I would be able to come out alright",
        "21. Bg5": "However white didn't play Be2",
        "21... Rc8 22. Bxf6 Nxf6 23. Nc3 Rd8": "The rook was threatning to come into d5",
        "24. Rf5": "Good move I missed that",
        "24... Bc7 25. Nc5": "And this! This just leaves black in a completely lost position",
        "25... Ra8": "?? Now white can just take on a6 since if the rook retakes then Bxb5+ wins the rook",
        "26. Nd5": "However he missed it",
        "26... Nxd5 27. exd5 Ke7 28. Ne4 Rad8 29. d6+ Bxd6 30. Nxd6 Rxd6 31. Rxe5+ Kf6": "I missed that the bishop was covering the f5 square not that it really matters anyway since the position is lost anyway",
        "32. Rf5+ Ke7 33. Re1+": "I thought about Kf8 here but I could find no good solution to Rfe5 ",
        "33... Re6 34. Rfe5 Kd6": "Losses a pawn",
        "35. Re5xe6+ fxe6 36. Rg1 a5": "I di",
        "37. Bxb5": "I resigned here, I missed that the bishop could simply be protected with a pawn"
    },
    "url": "https://gameknot.com/annotation.pl/speculative-piece-sacrifice?gm=46668",
    "gameName": "Speculative piece sacrifice ",
    "players": "Club player (1743) vs. James (1413)",
    "opening": "Sicilian (B92), Najdorf, Opovcensky variation"
}