{
    "moves": {
        "1. e4 e5 2. Bc4 Nf6 3. Nf3": "Developing, but leaving my pawn hanging.",
        "3... d5": "Forks pawn and bishop.  Now my pawn is attacked by two pieces.",
        "4. Bb3 Nc6 5. Nc3": "And we have a huge standoff in the center.",
        "5... d4": "That is definitely going to tear my center apart.",
        "6. Nb5": "Sets up the fork, but leaves the e4 pawn hanging.  Black has a stronger hold in the center.",
        "6... Nxe4 7. O-O a6": "Chasing the knight away.  Obviously, however, one square for the knight looks a lot better than the others.  That's \"looks,\" not \"is\" because they all suck.",
        "8. Nxc7+": "A very quick move on my part, made without really thinking about it.  I was using more time than him; that could have got me into trouble quickly.",
        "8... Qxc7": "The excessively obvious move.",
        "9. d3": "Trying to get some of the center back.",
        "9... Nc5 10. c4": "Should have moved the bishop.  But I panicked due to time control, even though I had a fair amount of time left.",
        "10... Nxb3": "Wins the knight for bishop exchange.",
        "11. axb3 Bd6 12. Bg5": "And I grab some squares in his territory; maybe I can force him to panic.",
        "12... O-O 13. Be3": "A very quick move made without thinking at all, and a huge mistake.  Should definitely have thought a little more, like how to get the a1 rook into the action.",
        "13... dxe3": "No messing around here.",
        "14. fxe3 e4": "This was a mistake.  I could now play dxe4 and open up (most of) the d-file for my queen.",
        "15. Ng5": "A slight mental lapse.",
        "15... Bxh2+ 16. Kh1": "Forced, and my king is crammed in a box, but black cannot work with that without freeing the king.",
        "16... exd3": "Ouch!",
        "17. Qxd3": "My queen stares bullets at the h-pawn.",
        "17... Rd8": "Threatens the queen.  That rook looks like a good piece to take...",
        "18. Qxh7+": "but I want the pawn.",
        "18... Kf8": "Forced",
        "19. Qh8+ Ke7": "Forced again",
        "20. Qxg7 Bd6": "Probably could have found better moves with another second or two of searching.  He was probably counting on me getting into time trouble.",
        "21. Qxf7#": "That never happens, I checkmate him with 17.5 seconds to spare.  Black ended with 36 seconds left on his clock."
    },
    "url": "https://gameknot.com/annotation.pl/speed-demons-chess-game?gm=28093",
    "gameName": "Speed Demon's Chess Game",
    "players": "johnnyk12  vs. NN ",
    "opening": "Bishop's opening (C24), Berlin defence"
}