{
    "moves": {
        "1. e4 e5 2. Nf3 Nc6 3. Bb5 Nf6": "Berlin defence.",
        "4. O-O Bc5 5. Re1": "? While this move does protect White's e pawn, it weakens the f2, which I don't waste time attacking it...",
        "5... Ng4": "...with this move. White has to move the rook again to avoid losing material.",
        "6. Re2 a6": "I put a question on White's bishop.",
        "7. Bxc6": "He captures my knight...",
        "7... dxc6": "...and I capture with my queen's pawn, allowing me to develop my light-squared bishop.",
        "8. h3": "He attacks my knight...",
        "8... h5": "!? And I defend it. White cannot take my knight right now. 9.hxg4? hxg4 10.Nxe5 Qh4! with a dangerous mating threat on the h column. This is very similar to the aptly name \"Fishing pole\" trap. ",
        "9. c3": "White does not fall for it though.",
        "9... Qd3": "!? An Interesting idea; I jam most of White's pieces at the cost of deactivating my trap, as I cannot play Qh4 any longer.",
        "10. b4 Ba7 11. hxg4": "White finally captures my knight, but was it safe?",
        "11... hxg4 12. Ne1 Qg3": "! I threaten mate via 13 ...Qh2+ 14.Kf1 Qh1#. The f pawn cannot take my queen as it is pinned by my handy a7 bishop.",
        "13. Re3": "The best defence. It blocks the a7-g1 diagonal and frees up the e2 square for the king.",
        "13... Qh2+ 14. Kf1 Bxe3 15. dxe3 Be6": "! A strong move; A bishop on c4 would be very troublesome for white.",
        "16. Nd2": "? This is the losing move. While it does prevent Bc4+ for now, it creates other problems...",
        "16... O-O-O": "...such as this pin on the knight. (Bonus style points for castling to attack?)",
        "17. Qc2": "White wisely unpins his knight, but it will not save him.",
        "17... Rxd2": "!! I remove the defender of c4 with this sacrifice.",
        "18. Bxd2 Bc4+": "Naturally.",
        "19. Nd3 Rd8": "! I could have played 19... Qh1+ 20.Ke2 Qxa1 here, which would have won as well, but I opted to put more pressure on the knight, squeezing him even more.",
        "20. Ke2 Qxg2": "I eye for the f3 square, which would put White's king on the first rank, thus removing a defender of d3.",
        "21. Rd1": "21.Be1 was White's best bet, but it does not stop 21...Qf3+ 22.Kd2 Qxe4, winning the knight.",
        "21... Qf3+ 22. Ke1 Bxd3": "White resigns. 0-1"
    },
    "url": "https://gameknot.com/annotation.pl/squeezed-unto-submission?gm=47632",
    "gameName": "Squeezed unto submission",
    "players": "eviva  vs. a_random_guy ",
    "opening": "Ruy Lopez (C65), Berlin defence, Beverwijk variation"
}