{
    "moves": {
        "1. Nf3": "I'm looking to play defensively.  This allows some threat to be made on the centre (at e5), but without exposing the king.",
        "1... e6": "A cautious, defensive reply",
        "2. g3": "Preparation for Bg2 followed by king-side castling, continuing the defensive theme.",
        "2... Nh6": "The database lists no other games following this line.  The move looks to be bringing the fight on to the kingside while avoiding pressing the centre.",
        "3. Bg2 Bd6": "Allows black to castle, but it's not a great square for the bishop.  c5 might have been better, threatening Ng4 then Nf2!, forking queen and rook (assuming white remained uncastled).  Either way, black's dark bishop can do little from d6",
        "4. O-O Na6": "?  I don't see what this acheives.  It only seems to be a waste of tempo",
        "5. d4": "With the king safely tucked away in his fortress, white begins to develop the centre",
        "5... Qf6 6. c4": "Frees the queen onto the light squares without moving the e2 pawn.  Also threatens the d6 bishop",
        "6... Nf5": "Both sides now have force coming together around d4",
        "7. Ng5": "Holds the bishop on c8 in place since moving the b7 pawn would cost black the rook.",
        "7... c6": "Counters the threat, and would allow the d6 bishop to maintain its diagonal even if attacked from c5",
        "8. Ne4": "Forks queen and bishop, although the bishop is already defended by the knight on e5",
        "8... Qe7 9. Bg5": "Harassing the queen",
        "9... f6": "Although this seals the queen in, so would Qf8.  Qf8 would also prevent castling and therefore the easy introduction of a rook",
        "10. c5 Bc7": "More or less forced by white's previous move.  Bb8 was also available, but would have completely trapped the bishop",
        "11. Bf4": "!?",
        "11... Ba5": "Had black taken the exchange (Bxf4, gxf4), white would have doubled pawns and a weakened kingside defence.  The text move, although attacking some of white's space, doesn't offer much else",
        "12. Bh3": "Brings the bishop back into play.  Its previous role of threatening the rook has long been defunct thanks to black's pawn structure",
        "12... g6": "Black seems to be preparing an advance with pawns",
        "13. Nd6+ Kd8": "Black had the option of a knight exchange ending in doubled d pawns for white but opted to move the king instead.  Kf8 would have resulted only in Bh6 ",
        "14. e4": "Ups the pressure on the f5 knight and frees the queen.  White is relinquishing the strong defence in order to meet the massing black pawns",
        "14... Ng7": "The only move that doesn't cost black the knight",
        "15. Qa4": "Threatening Qxa5 .  Perhaps Qb3 would have been better, threatening Nxb7  Bxb7, Qxb7 to fork the knight and rook",
        "15... Bc7": "Moves the fight back towards the d6 white knight",
        "16. Nc3": "?  A waste of time.  Although it is development, the knight is several moves from anywhere.",
        "16... b5 17. Qc2": "Nc3xb5 (leading to cxb5, Qxb5 and rethreatening Nb7 ) may have been better, but I do not remember observing the possibility of the b7 check at the time",
        "17... g5": "Pushing at the bishop",
        "18. Nxc8": "Any move that takes the f4 bishop away from the diagonal (i.e. moving the bishop to save it) would cost white the knight on d6 and the c5 pawn in exchange for black's dark bishop.  At least this way, equal vlaue pieces are traded (although in what looks a very closed position, perhaps the bishop is less valuable than the knight). ",
        "18... Kxc8 19. Bxc7": "Taking the exchange as the best means of obtaining value for the piece, and forcing the game to move away from the slow opening",
        "19... Kxc7 20. d5": "This keeps up the pressure.  Also, if black blindly takes the pawn trades (cxd5, 21. exd5 exd5) white can unleash a royal fork Nxd5 !",
        "20... Qxc5": "Black spots the danger and averts it, or perhaps his queen simply saw the free lunch.  Either way, black is up a pawn",
        "21. dxc6": "Possibly makes the black king a little more exposed, although a simple dxc6 would nullify",
        "21... Nb4": "Fork",
        "22. Nd5+": "Exposes the black queen to attack from the white.  Black must defend with the king.",
        "22... Kd6 23. Nxb4 Qxb4": "Levelling the material",
        "24. Rfd1+": "Things are about to get ugly for black. The king can go to one of two places, and neither will save his material",
        "24... Ke7": "Forced  Kc7 was also available",
        "25. Rxd7+ Ke8": "Threatens the rook, but Kf8 would have saved the knight",
        "26. Rxg7 Qf8 27. c7": "Preserves the material advantage, since Qxg7 will be met by c8=Q  and the subsequent loss of the a8 rook",
        "27... Qxg7 28. c8=Q+ Rxc8": "To move the king would have had the same result",
        "29. Qxc8+ Kf7 30. Qxe6+ Kf8 31. e5": "Threatens to take black's queen and create a passed pawn with Qxf6 ",
        "31... Qe7 32. Qxf6+": "White offers an exchange of queens to amplify the material advantage.",
        "32... Qxf6": "Black accepts",
        "33. exf6 Kf7": "The pawn can't be defended by white, but it represents a threat if it can advance",
        "34. a4 b4": "An exchange of pawns would be unfavourable to black as it would open up the queenside to white's pawns",
        "35. Rd1": "Allows the rook to come into the game, but c1 would have been better.  Black needs to take the f6 pawn soon.  Rc1 kxf6, 36. Rc8 Rxc8 37. Bxc8 would've been very damaging",
        "35... Kxf6 36. Rd7": "Black resigns at this point, in the face of white's advantage.  The a file will soon be opened up creating a passed pawn for white."
    },
    "url": "https://gameknot.com/annotation.pl/sseh-cyal-pstel?gm=925",
    "gameName": "sseh cyal ps'teL",
    "players": "jokeslayer (1210) vs. hawklord (1200)",
    "opening": "Reti opening (A04)"
}