{
    "moves": {
        "1. e4 e5 2. Nf3 Nc6 3. Bb5 d6 4. d4 Bd7 5. Nc3 Nf6 6. O-O Be7 7. Bg5": "(EL) This seems stronger than the customary R-K1.\n\n(RC) Tarrasch preferred the development of this Bishop in fianchetto, as its exchange for Black's KB, which normally soon follows the text move, eases Black's cramped game.",
        "7... exd4 8. Nxd4 O-O 9. Bxc6 bxc6 10. Qd3 Re8 11. Rae1 c5 12. Nb3 Ng4": "(EL) 12... R-N1 (with the intention of embarrasing the Knight by the attack on the QNP) could be countered by 13 B-B1, and White will still be able to fortify his center with P-KB4.\n\n(RC) Forcing the desired exchange of Bishops, since if the white Bishop retires, Black plays N-K4. But Lasker is now able to put the black Knight rather out of play.",
        "13. Bxe7 Rxe7 14. f4 Rb8 15. h3 Nh6": "(RC) If 15... N-B3, 16 P-K5 and the Knight has to retire to K1, for if 16... N-R4, 17 P-N4.",
        "16. f5": "(EL)  White could have achieved more by 16 P-KN4 which would have avoided yielding K5 and KN5 to Black. The text move seemed to have the advantage of getting the King's Rook into play via KB$ and of keeping the KN file open for the Queen.\n\n(RC) A move that leaves his KP backward and gives Black a strong square on his K4. In return Black must yield White a strong square on K6 (to prevent P-B6) and White's mobility in front of the black King is greatly increased.",
        "16... f6 17. Nd5 Re8 18. c4 Nf7 19. Qc3": "(RC) Defending his QNP and so freeing his other Knight for action.",
        "19... Re5 20. Nd2 c6": "(RC) After this White has a weak black Q pawn as a target, but Black has reckoned that as it cannot be attacked by a white Knight, his own Knight's position can ensure its security.",
        "21. Nf4 Qb6 22. b3 Rbe8 23. Qg3 Kh8": "(RC) To allow the defence of his QNP against White's next move.",
        "24. Nh5 Rg8 25. Rf4 Qd8 26. Nf3": "(RC) If 26 R-N4, 26... Q-KB1 and White is no nearer a successful attack on the KNP. Now if 26... R-K1, 27 R-N4 wins, but Black is not quite so gullible.",
        "26... Re7 27. Rh4 Qe8": "(RC) Now Lasker must be careful how he presses his attack, for he has the burden of his weak KP to carry. The promising line is N-B4, threatening N-N6 ch, but Black will simply answer N-R3 since he no longer needs to defend his Q pawn. Lasker therefore plays his Queen to a square where she will still be attacking the Q pawn after he has played N-B4.",
        "28. Qf2": "(EL) Even though Black suffers from a cramped position there is no immediate winning combination available for White. Hence, the Black pieces must be disorganised by tactical manoeuvres before the attack can be resumed.",
        "28... Rf8 29. Qd2 Qb8": "(RC) To free his Knight.",
        "30. Kh1 Rfe8 31. Rg4": "(RC) To weaken Black's attack on his K pawn and so make R-Q1 possible, continuing the pressure on the Q pawn.",
        "31... Rg8": "(RC) Here N-R3 would be answered with 32 NxBP, so that if PxN, 33 QxN winning a pawn.",
        "32. Rd1 Qb4": "(RC) If Q-K1, 33 Q-Q3 Q-N1 34 N-B4 R(1)-K1 35 R-R4, and if 35... RxP 36 N-N6 ch winning the Exchange. But now White switches his attack quickly back to the K-side.",
        "33. Qf2 Qc3 34. Qh4 Nh6 35. Rf4 Nf7 36. Kh2 Rge8 37. Qg3 Rg8 38. Rh4": "(RC) Against the likely looking 38 R-N4 Black can play 38... N-R3 39 R-R4 P-Q4 40 BPxP PxP 41 RxP B-B3 with new-found freedom for his Bishop; but after the text move 38... P-Q4 would be answered by 39 BPxP PxP 40 N-B4 and, Black's Knight not being on R3, he has an extra threat and a winning one in N-N6 ch. The text move now threatens N-R4-N6 ch, and Black's natural answer of N-R3 would now cost him his Q pawn.",
        "38... g5 39. fxg6 e.p.": "(EL) R-N4 could have been countered by ...B-K1.",
        "39... Rxg6 40. Qf2 f5": "(RC) Ridding himself of the KB pawn which has now become a still more serious weakness.",
        "41. Nf4 Rf6 42. Ne2 Qb2 43. Rd2 Qa1 44. Ng3 Kg8": "(RC) The threat was 45 PxP BxP 46 NxB RxN 47 RxP ch KxR 48 Q-R4 ch.",
        "45. exf5 Bxf5 46. Nd4": "(EL) ! Decisive.\n\n(RC) Lasker could still try 46 NxB RxN 47 RxRp, but the text move is better because more exchanges are forced and Black's center is broken open.",
        "46... cxd4 47. Nxf5 Kf8 48. Qxd4 Qxd4 49. Nxd4 Ne5 50. Rh5": "(RC) Preparatory to breaking the center with P-B5.",
        "50... Ref7 51. c5 dxc5": "(RC) A pawn is bound to go, for if ...N-Q2 52 NxP NxP (if... PxP, 53 NxP) 53 R(5)-Q5 N-N2 54 NxP. Black hopes by exchanging Knights to retain some of the drawing chances which exist when a pawn down in a Rook ending.",
        "52. Rxe5 cxd4 53. Rxd4 Rf6f2 54. Rd8+ Kg7 55. Ra5 Rc2 56. a3": "(EL) Naturally, since ...R(2)-B7 would have won the important QR pawn.",
        "56... c5 57. Rc8 Rb2 58. Rb5 Rff2": "(RC) Black's Rooks look aggressive, but Lasker easily answers the threat to his KNP.",
        "59. Rb7+ Kg6 60. Rc6+ Rf6": "(RC) If ...K-N4, 61 RxP ch K-N3 (61...K-B5 62 R-B7 ch) 62 R-B6 ch K-N4 63 R-N7 ch K-R4 64 RxP ch and White has won two pawns.",
        "61. Rxc5 Ra6 62. a4 Rf6": "(EL) 62...RxRP would be followed by 63 R-B6 ch followed by R-N5 ch and PxR.",
        "63. Rc3": "(RC) Freeing the other Rook.",
        "63... a6 64. Rg3+ Kh6 65. Rgg7": "(RC) It is White after all who has the doubled Rooks on the seventh rank, and Black has no way of saving his KR pawn. Black resigns."
    },
    "url": "https://gameknot.com/annotation.pl/st-petersburg-tournament-1909?gm=50846",
    "gameName": "St. Petersburg Tournament, 1909",
    "players": "Emanuel Lasker (GM) vs. Georg Salwe (GM)",
    "opening": "Ruy Lopez (C62), old Steinitz defence, Nimzovich attack"
}