{
    "moves": {
        "1. e4": "Hi everyone!\n\nIt has been a long time since my last annotation.  However, as I was looking through my Walking the Walk and Learning to Run Club threads, I came across a thread which discussed the stalemate issue.  Well, I will add this one to the melting pot!  Funnily enough, this is the first time that I have been involved in a stalemate scenario on Gameknot and I joined in Oct-06!  So how did all this happen?  Well, read on ......",
        "1... e5 2. f4 exf4 3. Nf3 g5 4. h4 g4 5. Ng5": "5. Ng5 - This MT is an Allgaier Gambit MT and this move starts the show off.  An alternative (which is Master Chrisobee's favourite) is the Kiezeritzky Gambit (Ne5).  This gambit involves a piece, a pawn and an exposed king, and that king will be .........",
        "5... h6 6. Nxf7 Kxf7": "6. ...... Kxf7 - .....Henry!  Henry has no choice but to gobble up this somewhat dodgy p(r)awn because he has no desire to lose his beloved Glenda and his home is his CASTLE I will have you know!  However, he could end up running the gauntlet from the Wicked Witch of the West et al if he is not careful!  As an aside, Freddy the Master Mater has been known to abandon his rook to its fate by playing Qf6 when faced with sub-2000 players and has had some excellent results with it, sigh and double sigh!",
        "7. d4 f3 8. gxf3 d5": "8. ...... d5 - opening up a diagonal for Fou Leblanc.",
        "9. Nc3 Be7": "9. ..... Be7 - develops a piece and lines up on the h4 pawn.",
        "10. Be3 Bxh4+ 11. Bf2 Bxf2+ 12. Kxf2": "12. Kxf2 - after this trade King Ben loses his right to castle.  However, that king is happier placed than Henry and white is far ahead in development.",
        "12... Qf6": "12. ..... Qf6 - I try to catch up, but ......",
        "13. Nxd5 Qd6": "13. ..... Qd6 (forced to prevent Nxc7 garnering my QR next move)",
        "14. Bc4 g3+ 15. Kg2": "15. Kg2 - King Ben takes refuge behind my g3 passer, now I have to deal with the thread of a nasty discovered check.",
        "15... Be6": "15. .... Be6 - I deal with it with a developing move.  Now I just have to get my knights out.",
        "16. f4 c6 17. Ne3 Ke7": "17. ..... Ke7 - tempting here to play BxB but I do not like NxB!",
        "18. e5 Qd7 19. Bxe6 Qxe6": "19. ..... Qxe6 - white initiates the trade  - I still have to bring out those knights.  However those 3 white central pawns (2 of them passers) become a right nuisance to me over the next few moves.",
        "20. f5 Qf7 21. c4": "21. c4 - and here's another one!",
        "21... Na6": "21. .... Na6 - now a black knight does get out of the starting block.  However, there is still my king knight stuck on its home square.  At least my QR is now free to move.",
        "22. d5 Rd8": "22. ..... Rd8 - and my QR does two things.  1. Puts pressure on d5.  2. Pins the pawn on d5 against the Witch.",
        "23. d6+ Kf8": "23. .... d6+ - alas that pawn can move forward.  Henry is forced onto f8.  If Kd7?? then Glenda falls next turn to a pawn fork (e6+).",
        "24. e6 Qf6": "24. ..... Qf6 - I am now prepared for the e7+ pawn fork.  If that happens then I will allow my g8 knight to be taken for two of those dastardly pawns - a liberation sac. methinks.",
        "25. Qd2 h5": "25. ...... h5 - preparing h4 to back up my g3 passer.  If that happens I can get some counterplay in on the kingside and not be a complete doormat!",
        "26. Rad1 Nc5 27. e7+": "27. e7+ - now comes that check!",
        "27... Nxe7 28. dxe7+ Kxe7": "28. ..... Kxe7 - finally, on MOVE 28 my development is complete.",
        "29. Nd5+ cxd5 30. Qe3+ Ne4": "30. .... Ne4 - this knight may be lost whatever I do, but I will make white work for this loss.",
        "31. cxd5 Qxb2+": "31. ...... Qxb2+ - CHEEEECK!  Glenda shrieks as she flies on her broomstick to turn the b2 pawn into dust.  Suddenly, some counterplay does come from Yours Truly.  Pity my e4 knight is still hanging though.",
        "32. Kh3 Qe5": "32. .... Qe5 - and Glenda reverts to defensive duties.  However, white can pile up on that pinned knight.",
        "33. Rde1 Qxf5+": "33. .... Qxf5+ - so Glenda steals another pawn.",
        "34. Kg2 h4 35. Qxe4+ Qxe4+ 36. Rxe4+ Kd6 37. Rhxh4 Rxh4 38. Rxh4 Kxd5 39. Kxg3 Rd6": "39. ..... Rd6 - after this plethora of exchanges I am a pawn up, but we are in a rook ending.  Will my extra pawn be decisive?  Only time will tell.",
        "40. Kf3 Ra6 41. a4 Kc5 42. Ke3 Rd6": "42. .... Rd6 - keeping King Ben from adding to the protection of his a pawn.",
        "43. Rh5+ Kb4 44. Rb5+ Kxa4 45. Rxb7": "45. Rxb7 - after this pawn exchange, I remain a pawn up but Henry is confined to the a column.  Can he escape?",
        "45... a5 46. Ke2 Ka3 47. Rb8 a4 48. Rb7 Ka2 49. Rb8 a3 50. Rb7 Ka1 51. Rb8 a2": "51. ..... a2 - over the last few moves my a pawn has advanced as far as he can.  I have also been in a severe state of denial, not wanting to see or take in the writing on the wall \"Low Draw!\"  Yup - it is certainly frustrating to draw a game when you are material up but doubly so if it is a Low Draw!",
        "52. Rb7 Rh6 53. Kd2 Rh1": "53. .... Rh1 - still hoping for my opponent making an error!",
        "54. Kc2": "54. Kc2 - but he gets it right!",
        "54... Rb1": "54. ..... Rb1 - last throw of the dice.",
        "55. Rh7": "55. Rh7 - there is no way out, so instead of hitting the offer draw button I offer up my rook knowing .......",
        "55... Rc1+ 56. Kxc1": "56. Kxc1 (draw by stalemate) - .... that if he takes my rook he can only give me the wrong kind of mate.  Ben duly takes my rook and gets High Draw honours.  Well played, Ben - Joanne."
    },
    "url": "https://gameknot.com/annotation.pl/stalemated?gm=56450",
    "gameName": "Stalemated!",
    "players": "benl123 (1760) vs. jstevens1 (1835)",
    "opening": "KGA (C39), Allgaier, Thorold variation"
}