{
    "moves": {
        "1. d4 e5": "The Englund gambit...not particularly strong against White's best play, but playable.",
        "2. dxe5 Nc6 3. Nf3 Qe7 4. Qd5": "Speculative move. Simple development gives white a slight edge, instead.\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n",
        "4... g5": "...g5! is good response. ",
        "5. Bxg5": "Bxg5?! White is aware that ...Qb4  is a strong reply, but decides to try something after that not in the database in reply, hoping to win in the complications. The move can't be recommended, however.",
        "5... Qb4+": "...Qb4 ! is a strong move.",
        "6. Nbd2 Qxb2 7. Rd1": "7 Rd1?? White had considered 7 Rb1,  Qxc2 but had been moving too quickly and thought this was better.",
        "7... Qxc2": "...Qxc2? Black also moves too quickly. Simply 7 ...Nb4! wins the queen, the threat was ...Nxc7 mate!",
        "8. Nd4": "White now has to play carefully.  First white tries to exchange the dangerous knight.",
        "8... Nxd4 9. Qxd4 Bg7 10. e4": "White's only hope is to develop quickly. ",
        "10... Qc6": "Here simply ...d6! exploits the pin",
        "11. f4 b5": "b5? It is too early for Black to make this move, ...d6! is still best.",
        "12. Qd5": "White has now gained equality again thanks to the pin along the diagonal.",
        "12... Qxd5 13. exd5 a6": "How the situation has changed! Black is now behind in development and faces a strong center.",
        "14. Be2 f6": "f6? is premature, and gets Black into real trouble quickly. White begins to gain the upper hand now, exploiting a strong attack despite the absence of queens.",
        "15. Bh5+ Ke7 16. Bh4 Bb7 17. Ne4": "A strong move.",
        "17... Rf8": "At this point, white has a strong attack, and conceives of a plan to bottle black up, Nc5 followed by d6 .",
        "18. Nc5 Bc8 19. d6+ cxd6 20. exd6+ Kd8": "Black is even in material but is trapped inside a vise.",
        "21. O-O Nh6": "Black tries to free herself.",
        "22. f5": "White squeezes the vise further.",
        "22... Nf7 23. Rfe1 Rhg8": "Otherwise Re7! would have been unbearable with the unprotected bishop.",
        "24. Re7 Ng5": "Black is approaching zungswang, had limited options, since Ne5 loses the knight to the pin",
        "25. Rde1": "White piles on the pressure",
        "25... h6": "Black resort to pawn moves to avoid zugswang.",
        "26. Bg6": "Tightening the vice even further.",
        "26... a5 27. Bg3": "To allow for h4!",
        "27... b4 28. h4": "Black resigns, she must lost a piece and still faces a vise grip. "
    },
    "url": "https://gameknot.com/annotation.pl/stepping-into-the-noose?gm=20552",
    "gameName": "Stepping into the Noose",
    "players": "dmaestro (1613) vs. jstevens1 (1734)",
    "opening": "Queen's pawn (A40), Englund gambit"
}