{
    "moves": {
        "1. e4 d5 2. exd5 Nf6 3. Nf3 e6 4. dxe6": "...being Bb5+ the nail in the coffin, but he went for the conventional one.",
        "4... Bxe6 5. d4 c6 6. Be2 Ne4": "This is kind of weird, but hey, I can't see the harm. If Nd2, I can play Bf5, or NxN (losing my small developement edge, that's already gone by now). ",
        "7. O-O Bd6": "Castled? Point my weapons against it!",
        "8. Be3": "Slowly charging weapons pointing to my Qside... but passive in all. ",
        "8... Qc7": "My intentions are crystal clear... I don't have time for Nd7, o-o-o, if I don't want to suffer from his attack.",
        "9. h3": "Thank you! First sign I make you worry! And this makes my target a square nearer! Of course I can't play g5 at once, but...",
        "9... Nd7": "I cound't find a good way to go on attacking right now, so I \"had\" to play for developement. This move is for o-o-o and start some kind of attack. He can play c4, that is his best mov, and I'll have to cope with c5 or something like that. All this has an extra \"trick\" if I manage to castle Qside, is the pinned d pawn until the WQ is on the d column, uncovered. This, sometimes, is a very nice resource to get out of some pawn's fork or advance. ",
        "10. c4": "Good. White won't make it easy. Now, c5 will cause me to play Bf4, and if exchanged, my Q is on the right side. If d5, which is much more harmful... I'm undefended. What would you play?",
        "10... h6": "? Not this, of course! o-o-o would be the only way to cope with d5. I thought on a plan designed to tempt white into open the h column, otherwise, Bxh3!? would be a nice try. Will it work? What would you say?",
        "11. Nc3": "I'd say this is a mistake, as d5 was much stronger. White is so convinced of his safety on the Kside that is taking time for his attack. ",
        "11... Ng5": "He would not take the N, or the h column will be opened. But I can threat something from there...",
        "12. Qd3": "? again, d5 called to be played. I can still play NxN+ and then castle... short!. How should I go? That way or...",
        "12... O-O-O": "Now, this kind of stops d5. If d5, I \"have\" (as they say) Nc5. The Q is threatened, and if BxN, BxB and d5 is pinned to the Q, saving my B. I slipped before, but I think I got the situation right by now. (I also \"have\" g6, threatening Bf5...). Let's say the previous moves, in the correct order, would have transposed to this. :-D",
        "13. a3": "White is a real gentleman, attacking so calmly...",
        "13... Nf6": "I was thinking all the time in Bxh3, and if gxB, Nxh3+, Kh1, but I was sure it was not enough or a mate, so I went on bringing my pieces in. Alternate plan form here is Nh5, in order to play N or B to f5. Would you say it is a good idea? I'm not sure. All in all, probably f5 was the right move. My N better move taking advantage of the pinned pawn. ",
        "14. b4": "White is coming. I have no defence, I know. I have to go on. ",
        "14... Bxh3": "Alea jacta est. I still think I have nothing, but I'm sure that no defence will be enough to save me from the correctly buildt attack. So... what should white do? To take a juicy piece, or not to take?",
        "15. c5": "White choosed not to take, but to threat another piece instead. I don't want to retire my B on e7, of course, so I have only one square left...",
        "15... Nxf3+": "h2...",
        "16. Bxf3": "This helps white in giving scope to his lsb, but saves mine...",
        "16... Bh2+": "[%clk 0:03:38]\n",
        "17. Kh1": "Now. I am not worried about g3, trapping my dsb. I'd play Bxg3, and with the Lord on my side (and Nf6, the g pawn...) maybe I'll be able to prevent my fall on the Qside. Now: I have to retire my lsb. WHERE? ",
        "17... Be6": "If Bg5 I lose a piece with BxB, NxB, Qf5+, and either Ng4 or Bh2 is lost. ",
        "18. Ne4": "After this, NxN seems unavoidable. White is threatening Nd6+. Thinking it twice, it will help me a lot solving my dsb's problem: BxNd6, and I'll even win a pawn. But if NxN, BxN, my lsb is really lost for nothing. Now, look to Nf6: shouldn' he be on d7, and go Ne5 now?",
        "18... Ng4": "A blunder? I wanted to play b5 in order to attack, and with this weak N on f6, this was not possible.",
        "19. Bxg4": "White was not forced to take. This, I though, was to prevent any possible h column opening, so white stopped my attack, for sure... but now I can still work on some things. A quick question: should I take the B or play f5, forking the two white pieces?",
        "19... Bxg4": "Of course not! Nd6+ would be deadly, since after BxN, cxB leaves my Q under attack.",
        "20. f4": "White cuts my dsb's protection's... I didn't see it, and it seems that's curtains for me! What to do? What would you do? (except to resign)?",
        "20... g5": "I won't defend this move. It was the only way to get something back from my B. f5 will be pinned, and my pawns will advance. If Nd6, I'll go RxN or Kb8, upon circumstances. ",
        "21. Kxh2": "I can't play gxf, or white's Bxf4 and it's over. f5 only forces white into a safe Nd6+, leaving me with RxN as the ony way to go on. What would you play?",
        "21... h5": "Yes, I know, Kb8 could have been much better (depriving white from Bd6 being a check). This way I sac another pawn, isn't it?",
        "22. Nxg5": "As planned. This diverts the white N from his dangerous spot, and finally opens a column for my Rs. ",
        "22... Rdg8": "I threat RxN, since f5 is pinned. How would you defend it? Kg1 or g3 or just moving the N?",
        "23. g3": "I'd say not the best! I played instantly... do you know, of course...",
        "23... h4": "Still not really dangerous, but it needs accurate play by white to defend. Which is the correct defence for white? Does Kg2 \"works\"? ",
        "24. Kg2": "I don't know if any other move worked. I think not. And now I not only recover my lost piece, but I do so in a completely won position... if I don't blunder! Can I say that, for my poor level, was it a very \"strategic\" play, taking advantage of the only, tiny compensation I could figure out from my loss of the lsb, and stopping white's attack, and building mine? It feels soooo good... Now I win back my piece. Would you be tempted by something like Bh3+, and if KxB, hxg3+, Kxg3, f3, still winning the piece? Or (Bh3+) Nxh3, Rxg3+, Kh2, Qd7...?",
        "24... hxg3": "I could see this. RxN, followed by Bh3+ is \"threatened\". White seems advised to take the pawn... or not? ",
        "25. Kxg3": "He does. Probably the wrong option. Rh1 seems much better!",
        "25... Rxg5": "Piece back, and Be2+ is threatened.",
        "26. Kf2": "I can't see another one. Now I have to retire the R, true? ",
        "26... Rh2+": "White can't move the K on the g column all the same. Let's try to see why: Say Kg1. Be2+. If white takes Rh2, BxQ... and \"f5 is pinned\". If white takes Rg5 instead, Qg3# (the dsb shields the WQ...). So the only sensible move for white is...",
        "27. Ke1": "My R on g5 is still untouchable, I think, after Qg3+ (Rf2, Rh1+, Kd2, RxR to start with). BUT, just in case... I have lots of moves. Retire the R or threat the white Q. Which would you do? Remember: I \"want\" white taking my Rg5 in order to play Qg3+ (if possible). ",
        "27... Re2+": "Maybe not the best! Still, if QxR, BxQ, fxRg5, BxRf1, KxR, Qh2, and I feel not all is lost. But probably one of the worst choices. Bf5, kicking the WQ, then the Rg5, confortably to h5 or so... no, I had to choose the worst one. ",
        "28. Kd1": "I can't believe that, white returns me the favour!",
        "28... Rxe3+": "Where to go? Where to put the K? d2 or c2? Quickly!",
        "29. Kd2": "NO! Not there! Now RxQ is check, otherwise (Kc2, RxQ, fxRg5... of course, it still allows Qg3+...)",
        "29... Rxd3+ 30. Kxd3 Bf5+": "Just playing around. If the WK goes on the e column, Q checks and penetrates. ",
        "31. Kc3 Rg3+ 32. Kb2": "Now it's not a great issue. I have to bring in the Q. ",
        "32... f6": "More forcing was Qd7, threatening d5 in the process. But this seemed the typical \"quiet deadly move\"...",
        "33. Rae1": "Rc1 offered more resistance (maybe...)",
        "33... Qf7": "Threats are unstoppable, of course. What do you think? Do I deserve too much pulls of ears this time? :-)"
    },
    "url": "https://gameknot.com/annotation.pl/sticking-to-the-only-tiny-compensation?gm=61763",
    "gameName": "Sticking to the only tiny compensation...",
    "players": "Dizzyduck1 (1520) vs. damafi (1434)",
    "opening": "Scandinavian defence (B01)"
}