{
    "moves": {
        "1. e4 c6": "Playing into my beloved caro-kann. It was at this point the Jkarp told me that he had very little experience with this move. So right from the first move I would say that I had the advantage because now white is on his own and he has very little idea of the ins and outs of the caro-kann. ",
        "2. Nf3": "Jkarp moves a knight to the centre which is good but it is the wrong knight. When black plays 1. ...c6 he is telling you that he intends to play 2. ...d5 establishing a strong point in the centre and attacking e4. However, the main drawback of 1. ...c6 is that it does not attack e4 immedaitely therefore white does have time to gain more space in the centre. This is why most white players play 2. d4 d5 3. Nc3 only now once e4 is truely threatened does White defends e4 and develops the knight. If black plays 3. ...dxe4 then white is allowed to post a knight in the centre. ",
        "2... d5": "White has played the wrong knight so now 2. ...d5 makes it a little problematic for white to defend e4. ",
        "3. exd5": "A good way to defend e4 is to exchange it for another centre pawn. Also good for white were 3. e5 and 3. Nc3",
        "3... cxd5": "In around about way we have transposed into the exchange varation of the caro-kann. ",
        "4. Ng5": "?? I was not sure what Jkarp was planning here but I must admit I was disappointed with this move. The best way to refute these types of ill prepared moves is to make normal developing moves. Better is d4 or Nc3",
        "4... Nf6": "Defending d5 and increasing my grip on e4 ",
        "5. Bb5+": "This is not a bad move it develops the bishop and attacks the king. However, it is not the best because it encourages black to play what he wanted to play anyway. Which is Bd7.  ",
        "5... Bd7 6. Bxd7+": "Not a bad exchange for Jkarp ",
        "6... Nbxd7": "Black is solid and has every important square covered. ",
        "7. d4": "Good idea to blockaid d5 and deny black the use of c5. ",
        "7... e6": "IMO all black players should aspire to achieve such a pawn structure. I aim for the ideal piece deployment of the queen on c7 the DSB on d6 and the knights of f6 and e4. \n",
        "8. Bf4": "A good diagonal for the DSB but it has a slight problem. Namely, that b2 is undefended and d4 is weak. ",
        "8... Qb6": "attacking the undefended b2 and building pressure on d4. ",
        "9. b3": "a good move that defends all the major threats and make possible c2-c4 with strong attacks on the queenside. ",
        "9... h6": "In the caro-kann a knight on g5 is a dangerous knight therefore send it packing before you embark on an counter attack. The only reason why I left it on G5 until now is that the knight is less active here than on f3. However, I am now aimming to increase control over the dark squares via ...g5 and Bg7.",
        "10. Nf3 g5": "This is the correct way to gain tempo and chase pieces. Dont case pieces with pieces use pawns that are supported by another pawn. I also want to point out that with the absence of the LSB bishops the weakening of the light squares on the kingdside are not that serious. If the LSBs were still on the baord I would not play this move. ",
        "11. Be3": "Another good move that makes it very unlikely that black can win the d4 pawn now. Bad is 11. Bg3?? Ne4!",
        "11... Rc8": "With nothing to attack I decide to defend. This develops the rook to the half open c-file and prevents the immedaite c4. ",
        "12. c4": "?? not a very good move I am afraid. Jkarp had the right idea but the timing was just a little off. Instead white does want to play c4 but the problem is that 12. c4 dxc4 13. bxc4 Rxc4 losses a pawn. So how does white get in c4 here's how. 12. Nbd2 g4 13. Ne5 Bb4 14. c4. Of course white also has 12. 0-0 Qc7 13. c3!",
        "12... dxc4 13. d5": "?? I think Jkarp saw the discovery attack on my queen but of course the queen has an escape. ",
        "13... Qd6": "Now of course 13. ...Qa5 14. Bd2 Qxd5 where black has a massive advantage but I took into consideration Jkarps playing level and adjusted my play accordingly. ",
        "14. Bxa7": "?? Jkarp thinks he has leveled the game materially but he would be wrong 14. ...b6 traps and wins the bishop. ",
        "14... Bg7": "Of course either 14. ...b6 or 14. ...c3 would have put the game to bed. ",
        "15. bxc4 b6 16. Nd4": "I think Jkarp forgot that his king is still in the centre. Or he was thinking of playing Nb4 defending the bishop and attack my queen. ",
        "16... Qe5+ 17. Qe2": "?? losses the knight forced was Kf1",
        "17... Qxd4 18. Qb2": "JKarp was thinking of the exchange on b6 but must have forgotten that his queen is undefended on b2! Maybe he could go for broke with 18. dxe6 Qxa8?? 19. exd7+ Kxd7 20. 0-0",
        "18... Qxc4": "The threat is 19. ...Qc1+ winning the rook on h1\n",
        "19. Bxb6 Qc1+ 20. Qxc1 Rxc1+ 21. Ke2 Rxh1 22. d6": "Maybe it was better to try and save the bishop with Bd4",
        "22... Nd5": "both the bishop and rook are gone. ",
        "23. h3 Nd7xb6": "JKarp resigned. However, he did very well considering he had the courage to play a player 1000+ above him. Hightsight being 20/20 JKarp had the right idea with wanting to play 12. c4. However, after12. c4 dxc4 Jkarp played 13. d5?? going behind in material by a pawn. Even after 13. bxc4 the game could have been a draw. "
    },
    "url": "https://gameknot.com/annotation.pl/sticking-with-what-you-know?gm=45468",
    "gameName": "Sticking with what you know",
    "players": "jkarp (1091) vs. elyhim (2247)",
    "opening": "Caro-Kann defence (B10)"
}