{
    "moves": {
        "1. e4": "[%clk 0:05:01]\n",
        "1... d5": "[%clk 0:05:02]\n",
        "2. exd5": "[%clk 0:05:03]\n",
        "2... Nf6": "[%clk 0:05:06]\n",
        "3. d4": "[%clk 0:05:03] Not the most common answer, but one of the best. \n",
        "3... e6": "[%clk 0:05:09] Icelandic, my favourite. \n",
        "4. dxe6": "[%clk 0:05:02]\n",
        "4... Bxe6": "[%clk 0:05:13] The point is black has two developed pieces and white none. It is actually not such a great advantage, though, and has to be handled carefully. I didn't. \n",
        "5. Bg5": "[%clk 0:05:02]\n",
        "5... Nbd7": "[%clk 0:05:14] Not forced still to employ the dsb on e7. I like it on d6. Now white can go d5, and if Bxd5, QxB, NxQ, BxQ, and black has Nb4 as a threat, forcing Bd6, NxB, cxN, after which black has still RxBd8 and is in good shape. \n",
        "6. Nf3": "[%clk 0:05:00]\n",
        "6... Bd6": "[%clk 0:05:07] Where I want it. Of course white can reject it with c4-c5. Two tempos, and I can still go c6 and Bb4+.\n",
        "7. Bd3": "[%clk 0:04:47] I would say this is too passive.\n",
        "7... h6": "[%clk 0:05:09] I plan all the way to castle queenside, so I'm not scared in opening the kingside. By playing this, I accept Bh4, g5 and the risky piece per two pawns sac. A fun game, the result difficult to predict. I also accept Bg3, and I will answer Qe7 and leave the exchange to him. \n",
        "8. Be3": "[%clk 0:04:45] Does this look like a bad move?\n",
        "8... c6": "[%clk 0:05:12] Sticking to my plan. \n",
        "9. O-O": "[%clk 0:04:48] Thank you white. Can you see you are inviting me?\n",
        "9... Qc7": "[%clk 0:05:15]\n",
        "10. h3": "[%clk 0:04:49] c4 was strongly needed, in order to force the deployment of my dsb (I'll go to f4 in case of c5). This is a mistake, even fearing Ng4, because it opens the way to my g pawn. \n",
        "10... O-O-O": "[%clk 0:05:14] Maybe too slow, but hey, I'm losing too many games no to be a little wiser. \n",
        "11. c3": "[%clk 0:04:45] ?? c4 was definitely needed. I later understood his plan, that is to open the way for his Q to a4, threatening a7. This plan will prove to be a frustrating one for white. Let's see why. \n",
        "11... g5": "[%clk 0:05:17] Last chance for white to \"open the umbrella\". g4 is threatened, opening the K's shield. \n",
        "12. Qa4": "[%clk 0:04:24] White bets for the counterattack. Who will get a deathly threat before? Now, when the game is like this, you have to give sooo much importance to tempoes. In this particular case, even after Qxa7, Qa8+, I have essentially nothing to fear in the short term.\n",
        "12... g4": "[%clk 0:05:07] So I go on with my attack, ignoring his! A breach in pawns or a piece, white: choose!\n",
        "13. hxg4": "[%clk 0:03:59] A deadly breach is opened in white king's front. Now: which one should take? N or B? \n",
        "13... Bxg4": "[%clk 0:04:46] The idea is that this B will be backed by a R, threatening the N. White's marvelous B pair is almost useless!\n",
        "14. Ne5": "[%clk 0:03:54] What else? Kh1 was a chance to bring in the R on g1. Would you say black has an edge here... ? :-)\n",
        "14... Nxe5": "[%clk 0:04:47]\n",
        "15. dxe5": "[%clk 0:03:57]\n",
        "15... Bxe5": "[%clk 0:04:49] Threatening Bd3 by the way. \n",
        "16. Bc2": "[%clk 0:03:02] What else?\n",
        "16... Rdg8": "[%clk 0:04:46] Why not the other R? I thought I had to avoid Bxh6 to ensure my dominion on the g file. I was wrong, in fact Bxh6 guarantees me the win. \n",
        "17. Qxa7": "[%clk 0:03:00] White still underestimates the danger.\n",
        "17... Bf3": "[%clk 0:04:26] \"Incidentally\", this covers Ra1+. It does allow Bf4+. But, incredibly this is not a problem due to white's Nb1, which prevents white to connect R. \n",
        "18. g3": "[%clk 0:01:55] The last mistake, what else?\n",
        "18... Bxg3": "[%clk 0:04:24] Not even calculating it. \n",
        "19. Bf5+": "[%clk 0:01:34]\n",
        "19... Kd8": "[%clk 0:04:21] Not Nd7. It covers d7. But in playing this, I invited (with some malice, I admit) my opponent in playing...\n",
        "20. Bb6": "[%clk 0:01:31] \"Oooooohhhhh!\" makes the lady \"my hero is in danger\" :-D but I reply: \"Don't worry, baby, just relax and look...\"\n",
        "20... Bf4+": "[%clk 0:03:53] Is this a beauty or not? I know, not a big deal, but \"live\" it is nice to have found it. \n",
        "21. Bg4": "[%clk 0:01:12]\n",
        "21... Rxg4#": "[%clk 0:03:56]\n"
    },
    "url": "https://gameknot.com/annotation.pl/straigh-forward-win?gm=61621",
    "gameName": "Straigh forward win.",
    "players": "piteich (1430) vs. damafi (1398)",
    "opening": "Scandinavian defence (B01)"
}