{
    "moves": {
        "1. d4 d5": "I usually play 1...Nf6 and head for the Kings Indian Defense.",
        "2. Bf4": "White plays the Neo-London.  The London system originally developed as a way for Black to meet the Reti opening in the 1920s.   The London system was then played from the White side.  In the London White plays Nf3 before Bf4.   In the Neo-London White plays Bf4 and Nd2.  Both the London and the Neo-London White usually forms the \"Slav Triangle\" with his pawns at e3, d4, and c3.   This makes the London a cousin of the Colle, where White also adopts the \"Slav Triangle\" but keeps the bad bishop inside the pawn chain.   There are pros and cons to both approaches, but a misconception some players have is that developing the bad bishop outside the pawn chain solves the problem of the bad bishop.  Outside the pawn chain the bishop is still bad and his absence cause a weakness on the queenside.  ",
        "2... Nf6": "White can get away with breaking Lasker's principle that at least one knight should be developed before a bishop, but Black cannot.   By playing the Neo-London White abandons his initial edge in the opening and allows Black to equalize.  White is basically playing a reverse Black defense with a move in hand, and hoping to outplay Black in the middle game.  The theory behind the Neo-London was developed in the 1980s by  Kovacevic.",
        "3. e3 c5": "White is playing a Black System, so Black should accept the challenge and play like White.  ...c5 is Black's best chance of dealing with his problem light squared bishop.    Both e6 and c6 make the situation worse for the problem bishop.",
        "4. c3 Nc6 5. Nd2 Bf5 6. Qb3": "A thematic move in the London systems, White immediately goes after the weakness left in the wake of Black's light squared bishop.",
        "6... Qd7": "note that this queen move would not be available to Black if White had played Nf3 since the knight could jump to e5 and White could increase the pressure with B-b5",
        "7. Ngf3": "White hastens to bring his knight out, but ...",
        "7... c4": "Black is able to strike attacking the White Queen and blocking White's light squared bishop.",
        "8. Qb5 Nh5": "with the initiative Black immediately moves to exchange White's London Bishop.",
        "9. Bg5": "This move surprised me.  Normally White plays Bg3.   Had I checked the gameknot data base, I would have seen that yellowlab has played this move before.   I am guessing that this is yellowlab's own move.",
        "9... f6 10. Bh4 g5 11. Bg3": "The bishop arrives at g3, and Black now has pawns at f6 and g5.   The question is: does that help White or Black?   My thinking is that it helps Black since it restricts the f3 knight.   It does seem to loosen Black's kingside.   ",
        "11... Nxg3 12. hxg3": "Black now has the bishop pair and all of White's minor pieces are pretty well constrained.   At the time, I thought the key to Black's position was to exchange the Queens.   I had rejected playing a6 because I feared the Queen going to b6 and White somehow would be to attack the Black King.   Post Morten analysis with Fritz showed that White queen's position is a liability.  Fritz recommended 12...a6 13 Qb6 Na7 followed by ...Nc8 and the White queen has to make a hasty retreat back to it's own lines.  Black would have a clear advantage.   I think I could have analyzed forever and not found the maneuver ...Na7-c8.  It's just too counter intuitive.    ",
        "12... Ne5": "Instead I played for the queen exchange.",
        "13. Qxd7+ Nxd7": "Now the position is equal.  Black has the bishop pair, but they need an open board to be an advantage.  In high school physics we learned about kinetic and potential energy.  Black's bishops are potential energy.",
        "14. b3 cxb3 15. axb3 e6 16. Bb5 a6 17. Ke2 Bg4": "main motive for playing this move was to preserve the bishop pair if White played B-d3.",
        "18. Rhc1": "White seems to be preparing action on the queenside.",
        "18... Rc8 19. Bxd7+ Kxd7 20. c4 Bd6": "Played to provoke c4 and take pressure off Black's center.",
        "21. c5 Bb8 22. b4 e5": "Black counters White's queenside action by striking in the center.   The pawns at d4 and e5 are called a lever.  The move also threatens to win the pinned f3 knight.  ",
        "23. Kf1": "The lever action created by the opposing pawns at d4 and e5 creates tension on the position.   Generally the side that is forced to resolve the tension suffers a disadvantage.   For instance if Black were to play exd, after Nxd4 White would have a fine outpost for his knight.   If White were to play dxe, after fxe, White's e5 and d5 pawn dual would form a mobile center which should work well with his bishop pair.    Although it would drive the knight back, I don't feel that Black should play e5 since it would close the position, and after a regrouping by the White pieces, White could mount an attack on the queenside without worrying about Black striking back in the center.  Although it would create temporary disorganization amongst the White minor pieces, the resulting closed position might well favor the knights over the bishops.    Still, if at some point Black can come up with a strong follow up to e5, its a possible future threat White has to watch out for.    ",
        "23... h6 24. Rab1": "White continues to organize for a queenside strike.  ",
        "24... b6": "I decided to make a preemptive strike on the queenside myself before White gets organized.   I don't mind giving up a pawn, If I can get activity for my pieces.   I have a fighting king ready to get into the action and if White tries to move his knights to the queenside, I can hit the center with a properly timed ...exd.  Also note that my a6 pawn and White's King are on the same diagonal creating tactical possibilities. ",
        "25. Rba1 Bf5": "threatening Bd3 when the bishop springs to life and White even has back rank problems that might result in a mate.",
        "26. Ke2": "prevents ...Bd3.   ",
        "26... Bg4": "If White wants to fight for a win, I am happy to take him on.  However, if White is happy to sit on the position.  I was having a hard time figuring how to play for a win myself.   One possibility might be e5 followed by h4, but I wasn't really thrilled about it.   If White wants to play for a win he has to play Ke1.   Putting the king on e-file which could be come open after ...exd.  Even White's d2-knight is somewhat restricted, since if it moves, ...Bxf3 followed ...exd is a possibility.   ",
        "27. Kf1 Bf5": "White seems content to repeat the position, so I made a draw offer."
    },
    "url": "https://gameknot.com/annotation.pl/strong-tournament-1?gm=23904",
    "gameName": "Strong Tournament #1",
    "players": "yellowlab (1774) vs. blake78613 (1857)",
    "opening": "Queen's pawn, Mason variation (D00)"
}