{
    "moves": {
        "1. e4 c5 2. Nf3 g6 3. d4 cxd4 4. Nxd4 Nc6": "The Accelerated Dragon",
        "5. c4": "White opts for the Maroczy Bind",
        "5... Nf6 6. Nc3 d6": "opens c8-h3 diagonal, bishop and knight are now attacking g4.",
        "7. Be2": "Covers g4.  Now is Black's last chance to play Nxd4 and force White to recapture with queen, as White can play Be3 without the Black knight coming to g4.",
        "7... Nxd4": "Black takes the d4 knight while White has to recapture with the Queen \"The Gurgenidze System\".",
        "8. Qxd4 Bg7 9. Bg5": "The two main choices are 9 Bg5 and 9 Be3.  Both choices could lead to same position that is reached in the game.",
        "9... O-O 10. Qd2 Be6 11. Rc1": "11 O-O is the alturnative.  ",
        "11... Qa5 12. f3 Rfc8 13. b3 a6 14. Na4": "\r\nThe proper time to offer the Queen exchange. The move ...a6 left a hole at b6, the knight threatens to fork the black rooks after the queens are exchanged, so Black will have to spend a tempo to protect against the fork.",
        "14... Qxd2+ 15. Kxd2 Nd7": "to protect against the threatened fork.",
        "16. g4": "The exchange allows White to start a kingside attack.  When the Queens were on the board, Black would counter a kingside demonstration with ...b5 which would be very dangerous for White with his king in the center of the board.  Now ...b5 is relatively harmless.",
        "16... f6 17. Be3 f5": "Note that this same position could have been reached with 9 Be3 in one move less, since Black would not have played 16...f6 but gone straight to16...f5.",
        "18. exf5 gxf5 19. h3 Rcf8 20. f4 Rad8": "One of Black's main ideas in this line is to try and power through the break ...d5 to show that the White king does not belong in the center.",
        "21. Nc3": "Here I break with the data bases for the first time.  21 g5 has been played here to prevent ...Nf6.",
        "21... Nc5": "guess the knight wasn't going to f6 anyway.  Possibly better for Black would be 21...d5 22 cxd5 Nf6, when White would have a slight edge at best.",
        "22. Bf3": "I think White is definitely better at this point.",
        "22... a5 23. g5 Bd7 24. Ke2 Bc6 25. Bxc6": "I decide to go into an endgame.  After the exchanges on c6 and c5, there are several factors that induced me to go into the endgame; but White could have maintained his advantage with 25 Nd5! For example:  ...Rd7 26 Nb6  Rc7 27 Bd5+ Kh8 28 Rhd1 Ne4 29 Bxe4 Bxe4 30 c5!",
        "25... bxc6 26. Bxc5 dxc5": "White may still have an edge with a better pawn structure and centralized king, but I think the position is close to equal.",
        "27. Rhd1": "White aims for what he hopes to be a good knight vs. bad bishop endgame.",
        "27... e5 28. Rxd8 Rxd8 29. fxe5 Bxe5 30. Rd1 Rxd1 31. Nxd1": "This is the position I was playing for.  White has the better pawn structure on the queenside, where the Black bishop can't touch his pawns.  An important factor is that the Black bishop is the wrong color for his h-pawn and cannot control the queening square.  If some type of mutual zugzwang position is reached on the kingside, White has two pawn moves a2-a3 & a3-a4 on the queenside.  White has the better king position.   However, with pawns on both sides of the board, the long reaching bishop is probably the better minor piece.",
        "31... Kg7 32. Ne3 Kg6 33. h4 Bg3": "If Black keeps his bishop on the h2-g8 diagonal it is hard to see how White can make progress.  ",
        "34. Ng2 Kh5 35. Kf3": "At this point I was starting to consider ways to get a draw.  The White King has to stay at f3 to keep the Black king from invading at g4 and if the knight leaves g2 the White kingside pawns fall.  If Black moved his bishop somewhere on the h2-b8 diagonal I was going to play Ne3 and take the f5 pawn while Black gobbled up my g&h pawn.  It looked like I could win the c6 pawn with my knight.  After that I could play a2-a3, b3-b4 and trade off my knight and queenside pawns for Black's queenside pawns.  The h-pawn, dark-square bishop and king vs lone White king was a book draw.",
        "35... Bxh4": "?? Black trades into a lost pawn endgame.  35 ...f4 is interesting.  White is in zugzwang on the kingside and has to use one of his pawn tempi on the queenside.  After that Black must shuttle his bishop between g3 & h2, while White shuttles his knight from g2 to e1.",
        "36. Nxh4 Kxh4 37. Kf4 Kh5 38. Kxf5 Kh4 39. g6 hxg6+ 40. Kxg6 Kg4 41. Kf6 Kf4 42. Ke6 Ke4 43. Kd6 Kd4 44. Kxc6 Kc3 45. Kxc5 Kb2 46. Kb5 Kxa2 47. Kxa5 Kxb3 48. c5": ""
    },
    "url": "https://gameknot.com/annotation.pl/strong-tournament-1-http-gameknot-com?gm=22741",
    "gameName": "Strong Tournament #1, http://gameknot.com/",
    "players": "blake78613 (1839) vs. yellowlab (1812)",
    "opening": "Sicilian (B27), Hungarian variation"
}