{
    "moves": {
        "1. e4": "This is a game which I played for a mini-tournament. It's the second game with the specific player. I lost the first game making a lot of mistakes and my opponent took advantage of them, winning easily the game. When I lost the first game I decided to concentrate to this game and don't make (a lot of) mistakes. I was playing carefully and with respect to my opponent. This game hasn't well-organized strategies and divine moves. I annotate this so you can see how emotions can destroy a game... It was a great lesson I took and I wanted to make it public.",
        "1... c5": "Sicilian defense. Even I don't use it a lot, I believed that it would help me develop without problems.",
        "2. Nf3 Nc6 3. d4 cxd4 4. Nxd4 Nf6 5. Nc3 d6": "I believe, looking the whole game, that e6 was better move in order to open my bishop, castle and prevent the knight claiming the d5 square (which destroyed me).  ",
        "6. Bg5 e5 7. Bb5": "??? Was it mistake? Nd4 is obviously ready to go to the graveyard and white didn't do anything to protect it. I thought a lot for the next move in case white had a plan. my opponent said that he didn't do this on purpose. It was simply a mistake which everyone has done at these low-respected games. I didn't find something that could cause me problems so... ",
        "7... exd4": "exd4. Here is the key to my defeat. After this move white had 4 options for his knight. 2 going back, 1 going to a4 and do nothing and 1 going ahead to d5. So this move was really natural to me and I wasn't surprised at all. ",
        "8. Nd5": "Expected...",
        "8... Qa5+": "And here is my crash. After taking the knight all were easier. I had only to attack, and using the queen was the proper way. It was the second time in the game that his knight couldn't move to prevent a second strike to his pieces: c3 was unavailable.   So there was only one solution...",
        "9. c3": "In this move I felt winner without happening in fact anything that could lead to victory. I was so happy with the idea that I would send another piece to the graveyard that I forgot completely my defense. c7 was barely protected now and with my next move everything was going down. I repeat that staying white knight in d5 was the result of the pressure of the d4 pawn. Everything was going allright",
        "9... Qxb5": "?!?!?!?!?! And now what? gr8m8 had only one move to do and he did it. The funny thing is that when I closed the pc I strongly believed that the opponent would soon resign after losing two pieces! But...",
        "10. Nc7+": "Knight threatens my king, my queen and my rook. When I saw this I was really angry with myself and I wanted to smash the computer. It wasn't the loss of the queen that made me furious but my blindness. There are some emotional rules which everyone must keep in order to play without unpleasant surprises. Even if you know playing chess masterfully if you underestimate your opponent (which I did after 7... exd4) weaknesses are expected. I believed that I won without doing something to prove this. Also, after 7... exd4 and 8... Qa5  I never looked back. I didn't pay attention to the heavy weaknesses. Knight and Bishop were not for me attacking pieces. Ι believe that everyone had this problem sometime. He underestimated his opponent just because he thought that he was in a superior position. In the end that was only a fake idea. You may say that 10. Nc7  was obvious and I was just careless but I think that you did it too sometimes in the past and it wasn't obvious for you then. That's all folks. I hope you enjoyed the crash of my arrogance...\nThank you for watching this game... :-)"
    },
    "url": "https://gameknot.com/annotation.pl/stupidity-is-invincible?gm=10154",
    "gameName": "Stupidity Is Invincible!!!",
    "players": "gr8m8 (1585) vs. fantasmenos (1487)",
    "opening": "Sicilian (B58), classical"
}