{
    "moves": {
        "1. d4": "This game features another ...b5 pawn sacrifice from Suba, soon followed by a temporary piece sacrifice that keeps white on the defensive for the rest of the game.  White remains constantly tied down by Suba's threats, but Marin eventually manages to trade queens only to find himself in an endgame that's lost because of the weaknesses the middlegame attack created.  I recommend flipping the board.  Enjoy!",
        "1... Nf6": "Suba was a fan of the Benoni as black, but in this game he plays a nimzo-indian very effectively.",
        "2. c4 e6 3. Nc3 Bb4": "This is the defining move of the nimzo-indian, white's knight is pinned and black is (usually) happy to give up the two bishops to double white's pawns.",
        "4. e3 b6": "The light squared bishop finds an excellent diagonal.",
        "5. Nge2": "This is the fischer variation, white can now take back with a knight after ...Bxc3  avoiding doubled pawns.  This takes some of the sting out of the bishop on b4.",
        "5... Bb7 6. a3": "Now that doubled pawns are not in the cards, white puts the question to the bishop.",
        "6... Be7": "The best retreat, ...Ba5 is trapped by b4 and trading doesn't get black anywhere.",
        "7. d5": "White tries to shut down the b7 bishop and cramps black development.",
        "7... O-O 8. e4": "Making the d5 pawn more secure.",
        "8... Re8": "The rook lines up against white's king which is three moves from castling, while the rook may not seem important now as there are four pieces between it and white's king, these pieces are going to move almost immediately.",
        "9. g3 b5": "And like in Suba game #1, black undermines white's center with a ...b5 advance.  What justifies this sacrifice?  White's king is still in the center, so if the center opens up white will have some problems.  Also, because white's bishop is not yet on g2, an opening up of the game will have black's bishop striking along the h1-a8 diagonal.  Finally, black has a good way to open up his rook with ...exd5 and he has a developmental advantage due to the moves white spent with his pawns.",
        "10. cxb5": "10.Nxb5 is met by 10... Nxe4 where the center still disintegrates, this move is met by...",
        "10... Nxe4": "10... Nxe4 anyway!  Suba (temporarily) gives up a piece to blast open white's center, which is already looking quite shaky.",
        "11. Nxe4 exd5": "And the center is gone, without a trace.  The white king is looking awfully uncomfortable and the bishop is eying the white rook with a delighted grin.",
        "12. Nd2": "The knight retreats, avoiding 12.Nc3 d4 forking the knight on c4 and the rook h1.",
        "12... d4": "But d4 comes anyway winning a tempo against the h1 rook.",
        "13. f3": "White blocks the threat, but his kingside pawns have some holes, and black can now win back his piece.",
        "13... d3": "Due to the strong e file, black wins back the piece, if the knight moves 14.Nc3 he is struck by 14... Bc5  (discovered check) trapping the king, when white will have to put a piece on e2 that will soon be taken by the black pawn on d3.",
        "14. Kf2": "White sidesteps the pin, but black is now equal in material, when white's pieces are undeveloped and his pawns are discoordinated and weak.",
        "14... dxe2 15. Bxe2 a6": "Black tries to get his b8 knight into the game.",
        "16. Re1": "White tries to nullify the e file pressure.",
        "16... Bf8": "This is a safe square to put black's bishop on that lets the e8 rook into the game.  I'm sure 16... Bc5  was tempting but then white's king would be forced to the safer square g2 and the bishop might be a target of white's pieces: perhaps it would give white the needed time to get out of this mess.",
        "17. Rb1": "White needs a way to develop the c1 bishop, but the knight is an important defender so white chooses to prepare b4 without losing a tempo to ...Qf6.  I think 16... Nf1 is a better way to get the bishop into the game, the knight will soon go to f1 anyway and white doesn't have to play such an irrelevant looking move as Rb1.",
        "17... Qf6 18. bxa6": "White now trades, hoping to show that the black knight will be useless on a6.",
        "18... Nxa6 19. b4": "White plays his prepared advance with the intention of developing and locking black's knight out of the game.  It'll be very difficult to bring his knight into the game, but he will find a wonderful way.",
        "19... Re6": "Black uses a rook lift, preparing to double rooks on the important e file and Suba's ready to shuttle the rook along the sixth rank.",
        "20. Bb2": "Winning a tempo against black's queen.",
        "20... Qh6": "Combines a threat of ...Qxh2  and Qe3 .",
        "21. Nf1": "White covers both dangers.",
        "21... Rae8": "Black concludes his basic development, the e file is the only fully open file and as it has been this entire game, it's very important.",
        "22. Qd2": "White offers a trade of queens, if queens are off may be he can unravel his position.  This also connects rooks which shuts down a little of black's pressure on the e file.",
        "22... Qh3": "Suba will not trade queens unless it comes with an explicit advantage, the queen is quite strong on h3, it's the only safe square for it on the powerful h file.",
        "23. Bc4": "White bring his bishop to an active square attacking black's rook, but this weakens the defense of f3.  Note that while white's king may be weak, he's getting development completed, and his bishops look active.",
        "23... Qh5": "Black hits the weak f3 square, a nice intermezzo (in-between move) before deciding what to do with the e6 rook.",
        "24. Qf4": "White covers the weakness while adding some pressure to f7.  It seems that white has survived black's early attack as black has two pieces that aren't playing much of a role in the game, the bishop on f8 and the knight on a6.  Black must activate or white has good chances here.",
        "24... Nc5": "!! If the rook on e6 is grabbed (25.Bxe6?) black will win with 25...Nd3 ! and a royal fork.  If the knight is taken (25.bxc5?) black will strike back with 25... Bxc5  and the king will be forced away from the defense of e1, where black will win a rook.  Because of these tactics the black knight can finally enter the game.",
        "25. g4": "White lashes out, trying to knock away a menacing piece.",
        "25... Qh4+ 26. Qg3": "And now that black has gotten his knight into the game he can trade queens, the weak pawns on f3 and g4 that were enticed to those squares will give black a winning endgame.",
        "26... Qxg3+ 27. Nxg3 Re6xe1 28. Rxe1 Rxe1 29. Kxe1 Na4": "The knight moves with gain of tempo, so that white has no time to shore up f3 and g4.",
        "30. Be5": "The bishop tries to win the tempo back, but black has an easy reply.",
        "30... d6 31. Bd4 Bxf3": "And after 31 moves, black has won a pawn.",
        "32. Bb5": "White's only asset is his passed a pawn, so he knocks away the defender and tries to get the pawn to run.",
        "32... Nb6 33. a4": "The pawn begins it's journey, but it will soon be halted.",
        "33... Nd5": "Attacking b4.",
        "34. Kf2": "White tries to get black's bishop off the h1-a8 diagonal so that the queening square of the a pawn is not blocked.  The ambitious 34.Bc6 (pinning the knight to the f3 bishop) loses to 34... Nxb4! 35.Bxf3 Nc2  36.Kd2 Nxd4 where black will win by blockading the dark squares with something like 37.a5 d5! 38.a6 Bc5 and white has nothing.",
        "34... Bxg4 35. a5": "The pawn marches for glory.",
        "35... Bc8": "And the pawn is stopped, sadly for white he cannot continue with 36.a6 because of 36... Nxb4 where the pawn is attacked and must rashly move forward 37.a7 Bb7 and the pawn is stopped, a last try like 38.Ba6 is met by 38...Ba8 where white is three pawns down.  So white resigned.  I hope you enjoyed the transitions in this game from a pawn sacrifice to the opening to a constantly pressuring middlegame, followed by a trade of queens at just the right time to create a winning endgame.  For me, Suba's ripping apart of the white center in the opening and 24... Nc5!! are the highlights of this game.  I hope you enjoyed, and as always comments are great."
    },
    "url": "https://gameknot.com/annotation.pl/suba-game-3?gm=7244",
    "gameName": "Suba Game #3",
    "players": "Marin (2533) vs. Suba (2530)",
    "opening": "Nimzo-Indian (E44), Fischer variation, 5.Ne2"
}