{
    "moves": {
        "1. e4 d5 2. exd5 Nf6 3. Nc3 e6 4. dxe6 Bxe6 5. Nf3 Qe7": "Typical Icelandic asset. ",
        "6. d3": "Better than others, blocking the white diagonal in sight of Bc4+. But this allows...",
        "6... Bg4+": "...and whatever white covers with, black takes the N, disrupting white's pawns. ",
        "7. Be2 Bxf3 8. gxf3": "This can be a disadvantage, in fact: Nf6 seems blocked, Q blocks dsb, and the other N is still unmoved. But white is not much better. ",
        "8... c6": "Avoiding Nb5 or d5. Maybe not necessary, but Nc6 kept the N jumps \"on\" for long. ",
        "9. Bg5 Nbd7": "White wants to castle queenside, so do I. ",
        "10. Qd2": "Here, black should better go Qb4, preparing lsb's liberation, by threatening b2. ",
        "10... O-O-O 11. O-O-O Qe5": "? Well, the idea is to mobilize the queen away from lsb's way. ",
        "12. Bf4": "! Very strong. ",
        "12... Qa5": "Threatening an attacking developent. ",
        "13. Bg3": "Just consolidating. but bad timing for it. ",
        "13... Bb4": "Threat is set, all of a sudden, it's white's death. There is no defence AFAICS) against Nd5. (* AFAICS: as far as I can see :-). ",
        "14. f4": "The lsb doesn't come on time for defence. ",
        "14... Nd5": "Now, let's imagine this position but the WK being in b1, instead: White can go NxN, and if black BxQ, Ne7#! This elegant shocking mate net, with all the pieces around, with just a B and a N, is wonderful. The main reason I saved the game for. ",
        "15. a3 Bxc3 16. bxc3": "No better is b4, Bxb4!",
        "16... Qxa3+ 17. Kb1 Nxc3+": "White has to sac the Q to avoid mate. ",
        "18. Qxc3 Qxc3 19. Kc1 f5": "I hope for resignation, but white seems to want more. ",
        "20. Bh4": "Well...",
        "20... Nc5": "The last sac. Can you see why white can't take the R?",
        "21. Bxd8 Nb3+": "Here is the reason. ",
        "22. Kb1 Qa1#": "A very elegant checkmate, I shall say, with the N \"en prise\" and just the Q giving check. It is more often seen with a B in c3, instead. "
    },
    "url": "https://gameknot.com/annotation.pl/sudden-death?gm=57341",
    "gameName": "Sudden death",
    "players": "player  vs. damalfi ",
    "opening": "Scandinavian defence (B01)"
}