{
    "moves": {
        "1. e4": "Thus begins a very interesting game played on Gameknot.",
        "1... e5 2. Nf3": "Main line King Pawn.",
        "2... Nc6": "Main line way of defending it.",
        "3. Bb5": "The Spanish opening/Ruy Lopez. White has his sights fixed on Black's e-pawn.",
        "3... Nge7": "The Cozio defence. Black firmly supports his queenside knight and e-pawn while blocking in his dark-squared bishop. Nowadays this is rare at most levels.",
        "4. O-O a6": "A thematic move in most Ruy Lopez variations: Black puts the question to White's bishop.",
        "5. Ba4 d6 6. c3": "White aims to create a powerful pawn centre, using his c-pawn to control d4 before moving his d-pawn there.",
        "6... Bd7 7. d4 exd4 8. cxd4": "White now has a very powerful Classical pawn centre, and is preparing to thrust forwards and gain space with d5!",
        "8... b5": "Black tries to regain space with a queenside expansion, forcing White's bishop back.",
        "9. Bb3": "Black chases White's bishop away while weakening his pawn structure.",
        "9... g6": "Preparing to fianchetto the bishop on g7, where it will control the long h8-diagonal.",
        "10. Ng5 Be6": "Black has to prevent 11.Nxf7 which forks Black's queen and rook. However, this walks into another fork, 11.d5! which wins minor piece for pawn.",
        "11. d5": "White pushes a centre pawn into enemy territory, blocking Black's position and forking his bishop and knight. Black now clearly has a very blocked up position.",
        "11... Bxd5": "Although it loses material, this move is preferable to playing Bc8 which blocks up Black's position even more, wastes moves and leads to this bishop being trapped.",
        "12. Bxd5 Nxd5 13. Nxf7": "A nice sacrifice which Black has to accept, risking the loss of his rook otherwise. This exposes Black's king.",
        "13... Kxf7 14. Qxd5+ Ke8 15. Qxc6+ Kf7 16. Nc3": "White is going on the attack. His pieces are swarming in to attack Black's exposed king.",
        "16... b4 17. Nd5 Bg7 18. Nxc7 Rc8 19. Qd5+ Ke7 20. Bg5+": "White uses every single one of his well-developed pieces. From having a blocked, cumbersome position, Black now has a vulnerable position that has been cracked open like an egg. This neat skewer, winning queen for bishop, completely seals the game for White.",
        "20... Kd7 21. Bxd8 Rcxd8 22. Qf7+ Kc8 23. Nd5": "Preparing Qc7#.",
        "23... Kb8": "Black's king is forced into the corner, ready for a checkmate.",
        "24. Qc7+": "Checkmate is still forced, as we see in the next two moves.",
        "24... Ka8 25. Nb6#": "A classic queen and knight checkmating position."
    },
    "url": "https://gameknot.com/annotation.pl/summer-end-party?gm=19107",
    "gameName": "Summer end party",
    "players": "cyrano (2461) vs. capricorn17 (1252)",
    "opening": "Ruy Lopez (C60), Cozio defence"
}