{
    "moves": {
        "1. e4": "classical opening",
        "1... g6": "my prefered defense, \"modern one\". It's safety and adaptable, give a lot of dinamic possibilities and quite funy by the way !",
        "2. Bc4": "claiiscal line",
        "2... Bg7": "Ok, now my defense is done ! then every thing can happen, and black pawns can arise from anywhere to fight for the center",
        "3. Nf3": "preparinf attack to f7, isnt that to easy ? maybe i playing with one of that top ranked players that think it's easy with lower rated players ? Or maybe is just the way he like to open !",
        "3... e6": "protecting from Bc4 treat",
        "4. d4": "occuping the center, in order to advance d4 to d5",
        "4... Nc6": "so i I let it happen preparing the response (5. ...-Na5)",
        "5. d5 Na5": "At this time, he took a lot of time to decide, meaning tht this was surprinsing him. Good for me !",
        "6. Bb5": "not so good ... and easy to refute (...-a6 ...-b5 ...etc)",
        "6... a6 7. Bd3": "retreating, I won this round !",
        "7... exd5": "now i can take the d5 pawn !",
        "8. exd5": "great ! the 2 kings are discovered.",
        "8... Ne7": "treat  d5, the white center is done",
        "9. c3": "i did not realize the treat at this moment : b4! ",
        "9... O-O": "so i castle to keep safe my king",
        "10. b4": "surprise ! i should anticipate it. Fortunately i had a plan taking advantage to the fragility of c3 and using my g7 fianchetto (moderne defense, isnt it !)",
        "10... Nxd5": "first, winning the pawn and double treat to c3...",
        "11. bxa5": "of course he took it !",
        "11... Nxc3": "now treatening the queen. And the white king is still discovered whereas I can use the f8 rook to treat the e colon. Things are becoming dangerous for white...",
        "12. Qc2": "the only better coice, witch is not so good anyway ...",
        "12... Re8+": "i still have the treat to Ra1 and in addition the rook is treatening the e colon and break the posibility for white to castle ",
        "13. Kd2 Ne4+": "i win the rook, ",
        "14. Bxe4 Bxa1 15. Nc3 Bxc3+": "better exchange than lose it",
        "16. Kxc3": "why with the king ???",
        "16... Qf6+ 17. Kd2": "a losed tempo for white",
        "17... c6": "preparing d5 to occup the center and free my c8 bishop. But i didnt anticipate the white plan (Bb2! ... Qc3!!...Qg7++)",
        "18. Bb2": "so here is the terrible white counterattack ! Will I get out alive ?",
        "18... Qf4+": "to win the e4 bishop",
        "19. Kd3": "protect his bishop, but it was a bunder because i could take it with my queen anyway, i didnt realize it ! so white AND black bunders ! Dear public, remember taht this is a 3mn blitz !",
        "19... d5": "my first plan",
        "20. Qc3": "and now i'm treatened a mate ! Fortunately i have some good shots to play",
        "20... Qxe4+ 21. Kd2 Qe2+ 22. Kc1": "at this time i realize that i was quite lost ...i was thining in puting my king in f8 to escape the mate, but then  : 22. ...-Kf8   23.Qh8+ - Ke7   24.Rh1 e1 !! and i lose the queen ...So, i found the way to exchange the queens, lucky lucky lucky !",
        "22... Qc4": "if white do the exchange they will lose any chance to win the game. But if they dont, i will keep my queen whith a BIG BIG advantage, so  ...? Dear masters, what whould you do  ?",
        "23. Kd1": "the treat on g7 was to dangerous to refuse the exchange",
        "23... Qxc3 24. Bxc3": "now the question is  : will i be abble to mate without the queen ?",
        "24... Bf5": "let 's try to take some advantages : in order to pin the knight or to put my bishop in e4, tretening g2 ....h1",
        "25. h3": "ok, so i will put my bishop on this strong center place e4",
        "25... Be4 26. Nh4 Rab8": "in order to : 27. ... - b7 b5 28. a5/b6xb5 - b8xb6 29. ... - Rb1+ 30. ... - b1xh1. Of course, white are not going to fall in this easy trap",
        "27. f3": "so i have to change my little plans",
        "27... Bd3 28. Kd2 Bc4": "treat a2 and Re2+",
        "29. g4": "he seems to ignore the treats ??",
        "29... Re2+ 30. Kc1 Rxa2": "will i have the oportunitie to move Ra2 in a1 ??",
        "31. Be5": "maybe ....",
        "31... Re8": "end is coming ...",
        "32. f4": "not enought, i will sacrifice my rook and win the bishop ...",
        "32... Rxe5 33. fxe5 Ra1+": "And our surfer resign, so i can come back to my work while he will come back to his waves ! Thanks for comments."
    },
    "url": "https://gameknot.com/annotation.pl/surfing-the-surfer-moderne-defense?gm=46662",
    "gameName": "Surfing the surfer ! (moderne defense)",
    "players": "surfingscotty (1507) vs. 31415 (1206)",
    "opening": "Robatsch (modern) defence (B06)"
}