{
    "moves": {
        "1. e4 c5": "Part of a series of annotated games where I explore the Sveshnikov Sicillian. See my annotated games list for other examples.",
        "2. Nf3 Nc6 3. d4 cxd4 4. Nxd4 Nf6 5. Nc3 e5": "Sveshnikov Sicillian",
        "6. Ndb5 d6 7. Bg5 a6 8. Na3 b5": "..b5 is the most popular, and suits my taste. Lines without ..b5 allow white to play Nd5, followed by c4 (and white has a central bind)",
        "9. Bxf6 gxf6": "Surprisingly the best move. ..Qxf6 loses a tempo after Nd5, and black lacks a semi-open g-file against the white king compared to the line played",
        "10. Nd5 f5": "Or a variety of other moves, including ..Bg7",
        "11. Bd3 Be6": "Probably the most popular in modern play",
        "12. O-O Bg7": "Inviting the complexity and pressure of white's Qh5",
        "13. Qh5 f4": "The best move according to Yuri Yakovich, and my preference to force the gain of space on the kingside. Otherwise white can play g3",
        "14. c4": "Critical line. c3 is also interesting",
        "14... b4": "My first real deviation onto theoretical sideroads. Theory dictates that ..b4 is inferior to ..bc, as it closes the position for black on the qs, leaving black's only opportunities on the kingside, while white retains options on both wings. However, this is the reason I wanted to try it: black can focus on the kingside, and does not need to deal with the myriad of additional threats white can make after the flexible ..bc. Black has an advanced f pawn, a semi-open g-file against the castled white king, an active light-square bishop, and is preparing moves like ..Rg8, ..h5,..h4, and even has the option to play ..f5 to increase the mobility of his central pawns. This game is interesting as it demonstrates the practical problems black has to hold his qs together after ..b5. The big problem of course is white's c-pawn, and on reflection I now think as a result of the game and the problems I faced from white playing c5 that it is better to play ..bc",
        "15. Nc2 Rb8": "15 ..a5 is also sometimes played",
        "16. Rfd1 a5": "I try 16.. a5 (novel) as alternatives have not been particularly successful. Let's look at 16.. O-O and 16.. h6. Both these moves are played in my game, but these games demonstrate themes with early g4 or c5 for white  [Event \"Kreuzberg\"]\n\n[White \"Pedzich, Dominik\"]\n[Black \"Valet, Richard\"]\n[Result \"1-0\"]\n[ECO \"B33\"]\n[WhiteElo \"2400\"]\n[BlackElo \"2370\"]\n[EventDate \"1991.??.??\"]\n\n1. e4 c5 2. Nf3 Nc6 3. d4 cxd4 4. Nxd4 Nf6 5. Nc3 e5 6. Ndb5 d6 7. Bg5 a6 8.\nNa3 b5 9. Bxf6 gxf6 10. Nd5 f5 11. Bd3 Be6 12. Qh5 Bg7 13. O-O f4 14. c4 b4 15.\nNc2 Rb8 16. Rfd1 O-O 17. g4 a5 18. b3 Qd7 19. Be2 Ne7 20. Rd3 Bxd5 21. cxd5\nRfc8 22. Ne1 Rc5 23. Rh3 h6 24. g5 hxg5 25. Bg4 Qe8 26. Nf3 f6 27. Qh7+ Kf8 28.\nRh6 Rc3 29. Bh5 Qc8 30. Rxf6+ 1-0   Alternately 16.. h6   [Event \"Wch (Women)\"]\n[Date \"1978.??.??\"]\n[White \"Gaprindashvili, Nona\"]\n[Black \"Chiburdanidze, Maia\"]\n[Result \"1/2-1/2\"]\n[ECO \"B33\"]\n[WhiteElo \"2425\"]\n[BlackElo \"2340\"]\n[EventDate \"1978.08.??\"]\n\n1. e4 c5 2. Nf3 e6 3. d4 cxd4 4. Nxd4 Nf6 5. Nc3 Nc6 6. Ndb5 d6 7. Bf4 e5 8.\nBg5 a6 9. Na3 b5 10. Bxf6 gxf6 11. Nd5 f5 12. Bd3 Be6 13. Qh5 Bg7 14. O-O f4\n15. c4 b4 16. Nc2 Rb8 17. Rfd1 h6 18. Be2 O-O 19. c5 dxc5 20. Nxf4 Bd7 21. Nd5\na5 22. Nce3 Nd4 23. Rac1 Rc8 24. Bc4 Rc6 25. Nf5 Nxf5 26. exf5 Rd6 27. Qg4 h5\n28. Qe4 Re8 29. Re1 Qg5 30. Ne3 Rf6 31. h4 Qh6 32. Bd3 Rc6 33. g3 a4 34. Kg2\nRcc8 35. Nd5 Kf8 36. Bc4 Bh8 37. Ne3 Qf6 38. Bd5 Bg7 39. Bb7 Rb8 40. Bd5 Rbc8\n41. Qd3 Red8 42. Qc4 Bxf5 43. Nxf5 Qxf5 44. Rcd1 Qg4 45. Qc2 Bf6 46. Bf3 Qe6\n47. Rxd8+ Bxd8 48. Qxa4 Be7 49. Qc2 Rd8 50. Qh7 Bf6 51. Qh6+ Ke7 52. Qe3 Rd4\n53. b3 Qf5 54. Rc1 Kd6 55. Rc4 Bg7 56. Qe2 Qd3 57. Rxd4+ Qxd4 58. Qa6+ Ke7 59.\nQa7+ Ke6 60. Qa6+ Qd6 61. Qc4+ Kf6 62. Bxh5 Qe7 63. Qc1 Ke6 64. Qc4+ Kf6 65.\nQe4 Bh6 66. Qh7 Bd2 67. Qh8+ Ke6 68. Bg4+ Kd6 69. Qa8 Bc3 70. Bf3 Qc7 71. Be4\nKe7 72. h5 Bd2 73. Bd5 Qd7 74. Bc4 f5 75. Qa6 Qd6 76. Qa7+ Kd8 77. Qf7 f4 78.\ng4 e4 79. Qg8+ Kc7 80. Qf7+ Kd8 81. Qg8+ Kd7 82. Qh7+ Qe7 83. Qf5+ Kc7 84. Kh3\nf3 85. Bd5 e3 86. fxe3 Qxe3 87. Bxf3 Kd6 88. Qf6+ Kd7 89. Kg2 Qg5 90. Bc6+ Kc7\n91. Qe6 Qd8 92. Bf3 Qd6 93. Qf7+ Qd7 94. Qf6 Qd6 95. Qg7+ Kd8 96. g5 Qf4 97. g6\nBe1 98. Kf1 Qxf3+ 99. Kxe1 Qe3+ 100. Kd1 Qd3+ 101. Kc1 Qe3+ 1/2-1/2\n\n\n\n",
        "17. a3": "One of white's themes is to attack on the queenside. Sometimes black counters a3 with ..ba followed by ..Rb3 (attacking the undefended bishop on d3), but here ..ba is less effective due to white's Rd1 on move 16 ",
        "17... b3": "Black wants to close down the queenside, so that he can castle and shortly play ..f5 ",
        "18. Ne1 O-O": "Black can force the exchange of white's knight after 18.. Nd5 19. Nf3 Nxf3 but the lines I examined where white takes gf (and gets open g-file) were unpleasant",
        "19. Nf3 h6": "Preventing Ng5, a very unpleasant threat for black",
        "20. Rac1": "-> c5",
        "20... Qd7": "Threatening ..Bg4 (which is not really much of a threat, as white may want to play h3, g4 anyway)",
        "21. h3 Ne7": "Black is just a few moves too late. If he can get a rook on the c-file he can play ..Rc5 to stop c5",
        "22. c5": "+-",
        "22... Bxd5 23. exd5 f5": "Black's only possibility of counterplay, since he has chosen to block the qs. Black intends to get his central pawns rolling, revealing an attack on the b2 pawn. He will lose a pawn or 2 in the process, but hopes to distract white with his advanced b-pawn. This already looked like a loss for black due to white's central pawns and major pieces. Black's only consolation is opposite coloured bishops, but its unlikely he can exchange off the knights to steer the game towards a draw. White has too many threats",
        "24. a4": "Logical, fixing the a5 pawn to be collected later",
        "24... e4": "This does not worry white as he has the intermezzo Bb5 to avoid losing a piece",
        "25. Bb5 Qd8": "Black has nowhere else for his queen. ..Qa7 would be silly, moving the queen away from the action",
        "26. Nd2": "White has a lot of time to execute his plan",
        "26... Bxb2": "Material equality again (6p vs 6p). But whose position would you prefer, and who has the broken pawn structure? Black's only consolation is that white must play accurately and patiently to get the full point (as this game demonstrates)",
        "27. Rcb1 Bg7 28. Nc4": "In analysis Nxb3 was also unpleasant for black. It is difficult for any plan white chooses to be wrong. This position is beautiful for white. But black hopes to make white's life difficult using his b-pawn",
        "28... b2 29. Nxd6": "Correct. White can hold white's b-pawn, although as mentioned Nxb2 is not bad either",
        "29... Qc7": "Inviting the loss of the exchange, as the knight on d6 is too strong. The most challenging move for white, otherwise black will quickly be crushed",
        "30. Ne8 Rbxe8 31. Bxe8 Qxc5": "Black got the best position he could hope for, getting rid of one of the central pawns and the dangerous white knight. Black hopes the pawn on b2 will prove uncomfortable for white, tying up one of his rooks and neutralising white's material advantage",
        "32. d6 Nc6 33. Bxc6 Qxc6 34. Qh4": "Black must allow white an extra pawn",
        "34... Qd7 35. Qxf4 Rd8": "Still tricky for white to win. He must play accurately. This is a good position to analyse",
        "36. Qd2 Qxa4 37. Qd5+ Kh8 38. d7 e3": "Black wants to hold onto his f5 pawn for now. There follows some queen play contesting central influence",
        "39. fxe3 Qb4 40. Qe6 Qe4 41. Qd6 Qb4": "The thought of pushing the black a pawn and connecting with his b pawn is enticing, but black does not have time and must play the position. Unfortunately black cannot afford to keep queens on the board (which he would prefer to increase tactical opportunities). This is true even at the expense of doubling b-pawns. I found this position from analysis at move 32, and could find nothing better.",
        "42. Qxb4 axb4": "Yes, unpleasant looking doubled b-pawns. My analysis indicated that black was unlikely to hold onto the a-pawn for long",
        "43. Kf2": "Once the white king is in position, he will roll the e, g, and h pawns to victory. Black can only play accurately and watch",
        "43... Kg8 44. Kf3 Kf7 45. Rd3 Ke6 46. Rbd1 Be5": "Black's king is in position. He will now just move his bishop around while white executes his plan",
        "47. g3 Bg7 48. Rd3d6+ Ke7 49. Rd6d5 Ke6 50. e4 fxe4+": "Forced. This gives white the e-file for one of his rooks, to push the black king to the right",
        "51. Kxe4 Bf6 52. g4 Bg5 53. Rb5 Bd2": "Just delaying",
        "54. Re5+ Kf6 55. Rf1+": "Black's king is now disconnected from the game. White's material advantage will start to tell",
        "55... Kg6 56. Re6+ Kg7 57. Re7+ Kg6 58. h4": "Once white has his passed pawn, the rest is a formality",
        "58... b1=Q+": "Forcing the exchange of pawns (b and d) to allow black's rook to contest the queenside and block white's mating threats",
        "59. Rxb1 Kf6 60. Re8 Rxd7": "This is an instructive ending. Black now wants to exchange his b pawn off for one of white's ks pawns, and then try to hold the ending. White either wants to a) push his connected pawns forward, exchange off black's h pawn, and win black's b pawn using a combination of threats of pawn promotion and pressure against the black king or b) Exchange off a rook with the black king on his back rank, the white rook on the 7th rank, and the white queen advanced. The threat of mate will allow white to collect black's b pawn. The mating threats of the 2 white rooks is strong, black's choices are limited",
        "61. Rf1+ Kg6 62. Rd1 Kf7 63. Re5 Kg7 64. h5 Kf8 65. Kf3 Rd4 66. Re4 Rxe4 67. Kxe4": "Black resigns. The position is lost, the bishop cannot protect both pawns. A beautifully played game from my opponent who needed a win to stay in the Gameknot GM section of the tournament (after he lost the other game). I learned a lot in this game -- and I hope you enjoyed some of the themes and tactics covered here, and share my opinion that the Sveshnikov is an interesting variation of the Sicillian with many rich lines for black to play"
    },
    "url": "https://gameknot.com/annotation.pl/sveshnikov-sicillian-7-bg5-9-bxf6-12-bg7?gm=28707",
    "gameName": "Sveshnikov Sicillian (7. Bg5, 9. Bxf6, 12.. Bg7)",
    "players": "nemrod (2182) vs. longtail99 (1869)",
    "opening": "Sicilian (B33), Sveshnikov variation"
}