{
    "moves": {
        "1. b4 e5": "Another ladder challenge. My opponent opens with the colorfully named Orang-utan Opening. Also known as the Polish Opening and as the Sokolsky Opening. Evidently Tartakover dubbed it the Orang-utan opening after an ape he claims to have conversed with. You be the judge. White begins on the flank intending to control the center from the outside looking in. Black responds by charging right into the center with a move that earn's black's choice the clever title of King's Pawn Variation.",
        "2. b5 d5": "Well, I'm already out of what little opening book to which I might dare lay claim (98% of which I've forgotten in nearly 25 years away from competitive play). I see little purpose to white's move other than hindering my queen's knight's development, so I make a grab for the classical strong center, and the few games in the World DB agree with my choice.",
        "3. d4 Bd6": "3. d4 takes me completely out of the world DB and into \"winging-it\" territory. Thanks to white's advanced pawn on b5, defending my e5 pawn with the knight is undesirable. I also don't favor recapturing or pushing forward yet with 3. ... e4. So I settle on 3. ... Bd6 which seems a weak move for the bishop, but better than my alternatives. Now 2. b5 makes a little more sense.",
        "4. e3 Nf6 5. Bb2 exd4": "Well, capture on d4 it is then.",
        "6. Bxd4 a6 7. bxa6 Nxa6": "I got rid of the b5 thorn in my side, so now my knight can develop more naturally, but now he's off on the side of the board. Well, I won't leave him there long.",
        "8. a3 O-O 9. Bxa6 Rxa6": "Or white will do me a favor and trade my misplaced knight away. I'm OK with that, too.",
        "10. h3 c5": "10. h3 seems like a waiting move. Perhaps white wanted to play Nf3 without worrying about the pin, though it seems there would be ample opportunity to drive away a pinning black bishop if needed. Black strikes at the center with tempo.",
        "11. Bxf6 Qxf6": "Don't miss the long-range threat.",
        "12. Nd2 Bf5": "Developing, but with a goal of capturing the (undefended) pawn on c2. Yes, undefended, since the white queen is too busy guarding her rook against black's queen to bother herself to recapture black if he takes on c2.",
        "13. Ngf3 Bxc2": "White misses it, so black takes the pawn.",
        "14. Qc1 Bd3": "White plays the only move that doesn't lose a rook, and black replies by nailing the white king to the center of the board where he needs to stay.",
        "15. g4 Rb6": "A pawn ahead, let's see about some exchanges. It's pretty clear what white intends to play next, and black's queen would like an aggressive new home.",
        "16. g5 Qb2 17. Qxb2 Rxb2": "White takes the offer of the queen exchange, an exchange that favors black since he's ahead in material, and now black also has a rook on the 7th rank and he has a very well-placed bishop nailing down white's king. I smell an attack in the making. White's king would be much safer in a castle, but the black bishop on d3 saw to that. Now white's king is in an \"uncastle\" that is about to be swarmed.",
        "18. Ng1 c4": "I admit, white's 18. Ng1?! perplexes me. I see no point to it so I'll mark it as a dubious move, undeveloping a piece. Perhaps the (misguided) point was to play to e2 and then castle, but that would only leave both knights en prise. Or maybe he just felt he needed to defend e2 against a rook check. Black advances his passed pawn. In retrospect, this may have been a wasted move by black when 18. ... Ra8 seems much stronger.",
        "19. Ndf3 Ra8": "And now black plays to the real attack. There is no saving that pawn now, but the pawn is not the real attack. In fact, for those who like puzzles, I have made a puzzle out of this one: http://gameknot.com/chess-puzzle.pl?pz=13111, so don't read on if you like puzzles.",
        "20. Nd4 Rxa3": "White's in a whole world of hurt and there is no way out. I announced checkmate in four beginning with the move just played, 20. ... Rxa3!. If 21. Rxa3 or 21. Rb1 then 21. ... Bb4+ 22. Kd1 Rb1# wins in two. If 21. Rc1 then 21. ... Bb4+ 22. Kd1 Be2+ 23. Nxe2 Rd3#. If 21. Rd1 then 21. ... Bb4+ 22. Rd2 Rb1#. The most interesting try is 21. Nc2 Bb4+! and now if 22. Nxb4 then 22. ... Rxa1# and if 22. Kd1 then 22. ... Rxa1+ 23. Nxa1 Rb1#. I call this the most interesting because I almost missed this line when I analyzed it and that made me reconsider 20. ... Rxa3! for a while until I came back to it and worked it out anew. No other moves work any better for white either.",
        "21. Nge2 Rxa1+": "White left his rook hanging, but it really didn't matter. White resigned here, but all that was left was 22. Nc1 (forced) Rxc1#."
    },
    "url": "https://gameknot.com/annotation.pl/swarming-the-uncastle?gm=25460",
    "gameName": "Swarming the Uncastle",
    "players": "tonyr2506 (1430) vs. blake84120 (2037)",
    "opening": "Polish (Sokolsky) opening (A00)"
}