{
    "moves": {
        "1. e4 c5 2. c3": "A cautious approach to the Sicilan",
        "2... d5": "I wanted to try something different here. I did not feel like playing a cluttered, positional game today.",
        "3. exd5 Qxd5 4. d4 cxd4 5. cxd4": "Great! White now has an isolani pawn which gives me a focal point of attack. Let's see how long he can hold his ground here.",
        "5... e5": "The most direct method. ",
        "6. Be3": "Not wanting to trade.  Both (6. dxe5 Qxd1+ (?!) 7. Kxd1 ... I go down a pawn but White cannot castle) and (6. dxe5 Qxe5+ 7. Be2 Be7 where White has minimal central influence) seemed unappealing to White I guess.",
        "6... exd4": "The problem pawn gets axed anyway.",
        "7. Nc3": "Now that I am the one with the isolani, White strives for the initiative. ",
        "7... Bb4": "My Queen is not to be easily threatened and I take the opportunity to develop.",
        "8. Nf3 Nc6 9. Be2": "Pins and needles everywhere! It is wise the King(s) seek shelter before the pending melee.",
        "9... Nf6 10. Bxd4": "Snap! The tension was too much to bear.",
        "10... Nxd4 11. Qxd4 Qxd4 12. Nxd4 a6": "Roughly equal again. White has gained some air. I enjoy my space and double Bishops.",
        "13. O-O Bxc3 14. bxc3": "I thought the trade was (very slightly) beneficial because I isolated another of White's pawns and for the moment, the struggle for the light squares seemed deadlocked.",
        "14... O-O 15. Rfe1 Nd5": "Pointing out White's weakness.",
        "16. c4 Nf4": "White's own pawn prevents his Bishop from occupying c4.",
        "17. Bf1": "This appears to be a blunder. ",
        "17... Ne6": "Trading Knights will allow me to develop my Bishop's potential.",
        "18. Nf5": "My opponent prefers that neither of us has a good Bishop. Here he threatens a forked check on e7 to remove my Bishop.",
        "18... Bd7 19. Rab1": "A half-hearted attack on the b7-pawn.",
        "19... Nc5": "Preferable to Bc6 which allows the forked check on e7 and isolates the b-pawn onto the c-file.",
        "20. Nd6 Bc6": "A near impregnable fortress is built here. White is surely annoyed at the awkward placement of his Bishop and c4-pawn. A fianchetto will be necessary at some point. At this moment I planned on an f5-break to trap the White Knight, fully control e4, creating a possible outpost there and delay White's Bishop from getting to the h3-c8 diagonal. ",
        "21. Nf5": "Practically forced. The Knight has panicked and rightfully so.",
        "21... Be4": "Not the strongest of forks but it will get the job done.",
        "22. Ne7+ Kh8 23. Rb6 Rfe8 24. Nd5 Bxd5 25. Rxe8+": "Move order here was critical. ",
        "25... Rxe8 26. cxd5": "Passed pawn at last! (almost).",
        "26... Re1": "White must be frustrated by all these pins!",
        "27. g3 Rd1": "A little pressure on the runaway pawn.",
        "28. d6 Kg8": "Ever so wary of back-rank mates.",
        "29. Kg2 Kf8 30. Bxa6": "A desperate move. White expects  30. bxa6 Rb8#. However, that was precisely the reason my Knight refused to make any moves for so long!",
        "30... Nxa6": "Any move loses for White."
    },
    "url": "https://gameknot.com/annotation.pl/tactical-sicilian?gm=33675",
    "gameName": "Tactical Sicilian",
    "players": "dinc-x (1586) vs. tonnerre (1817)",
    "opening": "Sicilian (B22), Alapin's variation (2.c3)"
}