{
    "moves": {
        "1. e4": "I am starting annotating this game as it is a very tactical and interesting game. \r\n\r\nI have looked through countless variations, many leading to checkmate and others to much material gain, but overall this game was very enlightening to me. Showing the power of inititaive and piece placement over pure material. ",
        "1... e5 2. Nf3 Nc6 3. Bc4": "Preferred by me over Bb5, Bc4 allows many more tactics and sharp fights in the opening compared to the Ruy. ",
        "3... Nf6": "2 knights defense. ",
        "4. d4": "The other option is Ng5. ",
        "4... exd4": " 4. Nxe4 is bad do to 5. dxe5 with a nice spatial advantage to white. ",
        "5. Ng5": "!? The Perreux variation of the 2 knights. The other option is 5. 0-0 when after 5. Nxe4 6. Re1 6. d5 7. Bxd5 7. Qxd5 8. Nc3 White will regain his piece with an attack. ",
        "5... d5": "This move is playable if black is careful, but 5. Ne5 leads to the main line of the Perreux variation where white has a very small advantage. ",
        "6. exd5 Nxd5": "? Now Black transposes back into an unfavorable variation of the Lolli attack. ",
        "7. O-O": "! book move but still strong. ",
        "7... Be7 8. Nxf7": "The main difference in this and the fried liver is the opening of the e-file, allowing white to use his rook early in the attack. ",
        "8... Kxf7 9. Qf3+ Ke6": "? Not a good move. Better is Ke8 when white has an advantage, but the text move is very bad. ",
        "10. Nc3": "!! Ok. If I had not looked at this line before the game I would have never come up with this move. \r\n\r\nThe point is after dxc3, both the e and d files are open and black cannot defend eventually against the numerous mate threats. Looking at this position is a very good exercise for tactics!",
        "10... Ncb4": "Black rightfully does not accept the sacrifice. ",
        "11. Re1+ Kd7": "A sign Black has messed up in the opening. Black has to concede a piece and leaves white materially equal and with a devastating position and attack. ",
        "12. Nxd5": "I have calculated a lot in this position and I believe this position is winning for white. It really is a great position to study from with all the tactics against the black king. I was ready for basically everything Black could have played. I spent a lot of time looking av variations, some probable and others not so probable, but it really was a great game to refine my tactical skills. ",
        "12... Nxc2": "?? Walks into a forced mate. The other option of Nxd5 is not pretty either though \r\n12. Nxd5 13. Qxd5+ 13.Bd6?? 14. Qf5+!! 14. Kc6 15. Qb5#\r\n12. Nxd5 13. Qxd5 13.Ke8 14. Qf5+!  14. Ke8! (not Kc6 Qb5#, not Kd6 Qd5#) 15. Qf7+ 15. Kd7 16.Bg5! And Black loses the bishop on e7 with a very dangerous attack to white, note also that 16. Re8?? loses to 17. Qe6# ",
        "13. Rxe7+": "?? Even worse. White misses the forced mate after 13. Nf6+!! clearing the d5 square for the queen. If after 13. Bxf6 then 14. Qd5#. If after 13. gxf6 then 14. Be6+! (the move i missed) and then if 14. Kd6 then 15. Qd5# and if 14. Ke8 then 15. Qh5+ 15. Kf8 16. Bh6#",
        "13... Qxe7 14. Nxe7": "I calculated this variation and found it to be quite favorable for white, not forced mate but very favorable. This variation tempted me into calculating these variations, when instead If I had looked harder I could have found the very pretty forced mate a move earlier. Note the interesting theme of not taking material. In fact 14. Kxe7?? loses the game after 15. Bg5+ and the King will get mated on the open board with the two bishops and Queen. Note also 14. Nxa1?? 15. Qd5+! and if 15. Kxe7 then white mates with the similar pattern as before, and if Black moves 15. Ke8 trying to hide behind the white knight then white wins with 16. Nxc8 and the mate with the two bishops is unavoidable. \r\n\r\nThus the strongest move in this position is the very odd 14. c6! attempting to run away from the white attack through c7. I calculated this variation beforehand also, and found that not winning material is the best option (such as Qf5+ forking the knight and king). Instead the best move is the interesting 15. Bf4! stopping black from running away. Again in all the variations where black gobbles material he finds that his king is quickly mated in the middle by the two well placed bishops and Queen that slice into the Black position. This position really is so pretty to me, White having superb development and a strong attack and is willing to sacrifice the material lead for the pretty mates with the two bishops and queen. ",
        "14... Nxa1": "?? A bad move gobbling white's worthless rook on a1 and deactivating the knight. White now has mate by force. I was very proud of myself for calculating all the lines beforehand and seeing there was no way for him to escape mate after Nxa1. ",
        "15. Qd5+": "Now White has a forced win. ",
        "15... Kxe7": "? The last error. Black could try to hold on after 15. Ke8! but still white wins after 16. Nxc8 16. Rf8! (16. Rxc8 17. Bg5+ 17. Ke8 18. Qf7#) 17. Bg5+ 17. Rf6 18. Qe7+! 18. Kxc8 19. Qe8#\r\n\r\nBut this variation requires no calculation.",
        "16. Bg5+": "The two bishops and Queen brutally rip apart the Black position. The game is not over yet although it is forced mate. I wanted to annotate the game as soon as possible so all the variations were still in my head, sorry if my opponent sees this. \r\n\r\nA great tactical game. Both of us missed a stunning knight sacrifice leading to forced mate, but I was able to get out of the opening with a strong material and positional lead which enabled me to sacrifice my material back for a winning attack. A very interesting game that had me laughing at all the funny ways white could win, I suggest people to check out other possible Black replies I did not show in the game and see the amazing replies white has. "
    },
    "url": "https://gameknot.com/annotation.pl/tactics-in-the-lolli-attack?gm=25024",
    "gameName": "Tactics in the Lolli Attack",
    "players": "grntnick (1200) vs. eugen6 (1200)",
    "opening": "Two knights defence, Perreux variation (C55)"
}