{
    "moves": {
        "1. e4": "I've been playing a lot of 1.c4 recently, but it's always good to stay in shape with the classics.\n",
        "1... g6": "The modern defense! I am wholly unfamiliar with this opening, but the basic idea is that White occupies the center while Black develops to the wings and will eventually attempt a break, usually with ...c5.\n",
        "2. d4 Bg7 3. Nc3 d6 4. Be3": "A little reserved, with the thought of preventing Black from playing ...c5 anytime too soon.\n",
        "4... a6 5. f4": "Given the situation, this is a safe push for White. He'll seek to initiate a big attack on the Black kingside once he castles.\n",
        "5... Nd7 6. Nf3 b5": "Preventing Bc4 and giving the Black LSB developmental options.\n",
        "7. Bd3 c5": "The thematic break.\n",
        "8. dxc5 dxc5": "?! Up until this moment, we've stayed pretty firmly within the established theory (not that I'm that familiar with the theory, as I mentioned), but this move from Black takes us off-book. The standard line is 8...Nxc5 9.Bxc5 dxc5.\n",
        "9. e5": "With no pawn on d6, White chooses to stuff Black's DSB, at the price of weakening the h1-a8 diagonal. A rather unassuming move--that will shape the rest of the game around it.\n",
        "9... Bb7 10. O-O": "This seems precarious at a glance because Black literally *just* placed a Bishop where it can see almost all the way down to the WK, but White is intending to make play before the BK can escape into his own castle (thanks to the thorny e5 pawn), and castling queenside is too slow. Besides, that Bishop is the only Black piece able to do anything at all.\n",
        "10... e6": "?! Trying to get the Knight out of the way in preparation for castling, but also seriously weakening f6. I think 10...Nh6 was better.\n",
        "11. Qd2": "Preparing to double on the open file.\n",
        "11... c4": "Mixing up plans. Better was to follow through with 11...Ne7 or better yet, 11...Bf8.\n",
        "12. Be4": "White effectively shuts down Black's only decent piece.\n",
        "12... Bxe4 13. Nxe4 Ne7": "This Knight was headed for f5 anyway, so I think ...Bf8, ...Be7, and ...Nh6 were called for instead. Now the Black DSB has no decent chance of escape.\n",
        "14. Rad1": "Now Black can't castle because he'll simply lose the Nd7. However, I think White's 15th move was better played here (see below), to complete the entrapment of the Black King's Bishop.\n",
        "14... Nd5": "? This is a pretty good place for this Knight, but it's still unclear where the other one might end up, and the DSB remains useless. Black really needed to play 14...Nf5 instead, shoring up d6...\n",
        "15. Nd6+": "What a glorious outpost for a Knight, on a friendly-controlled open file and supported by a strong pawn. And now Black can't castle, and his Bishop is even worse off than it already was. This move, I think, would have been even stronger a move ago, when Black would have had no choice but to play 15...Kf8 and shut the door on his Bishop for the forseeable future.\n",
        "15... Kf8": "15...Ke7 was probably a bit better, since it would allow the Rook and Bishop to get out (sort of), but Black is in some serious trouble either way he goes with the threat of Bc5 on the horizon.\n",
        "16. Ng5": "Both of White's Knights are all up in Black's business, and together they threaten a nasty fork on f7.\n",
        "16... Nxe3": "This was probably necessary, as that Bishop could not be allowed to get to c4 and now the BQ can escape to b6. However, it does leave Black with zero good pieces once again.\n",
        "17. Qxe3 Qb6": "This is a good try, I think. Black needs to trade down in order to free up his position a bit. It does have the unfortunate effect of leaving the Nd7 undefended, though.\n",
        "18. Rd4": "! Rather than settle for an exchange, White puts the Rook in a precarious situation, balanced on a Knife's edge between two Queens; pinned, in fact, as White's is undefended. All the tactics from this point on revolve around this Rook and the opposing Queens facing it.\n",
        "18... h6": "Okay, but not great. Honestly Black should try to trade off his Bishop for one of White's Knights, or just play the f-pawn up and try to fight for his freedom.\n",
        "19. Nge4": "This is an interesting choice. 19.Ngxf7 was playable, but the issue is that after 19...Rg8, there's nowhere else for the advanced Knight to go. So White opts to bring the Knight in toward the center in preparation for some tactics.\n",
        "19... Ke7": "?? The King is forced to take up the undignified task of defending his Knight, but I think 19...f5 was worth a look. Really, almost anything else was better: this move actually loses outright (see below).\n",
        "20. Rfd1": "? White misses a great trick here; though doubling on the d-file is certainly an okay move. He could, however, have played the brilliant 20.Nc8+!!, picking up a major exchange and the game in short order: 20...Rhxc8 21.Rxd7+! Kxd7 22.Qxb6.\n",
        "20... Rhd8": "?? Finally the Rook gets out of its corner, but it's too little, too late. Black fails to stop White's combination, and now it's even more powerful thanks to the doubled Rooks. Black needed to recant his last move and just play 20...Kf8.\n",
        "21. Nxf7": "Black can't take the Knight and he can't save the Rook; any Rook move loses outright to 22.Rxd7+. However, White still missed his most powerful option: 21.Nc8+!! Raxc8 22.Rxd7+ Rxd7 23.Rxd7+ Kxd7 24.Qxb6 was far better.\n",
        "21... Ke8 22. Nxd8 Rxd8 23. Nd6+": "If the BK was on f8, this would at least have cost White a tempo. As it is, he gets to play it with check and maintain the initiative, as well as the threats he had before!\n",
        "23... Kf8": "The only move. Any move to the 7th rank loses more material to 24.Nxc4+ because of the threat of check on d7.\n",
        "24. Kf2": "A seemingly slow move that is more foreboding than it looks. With the Queen defended, White's forward Rook is no longer pinned, and now threatens to tear down the d-file unchecked.\n",
        "24... Kg8": "The BK runs, but there's nowhere to hide.\n",
        "25. Nf7": "! While this doesn't win any material, it forces Black to accept a huge trade that will leave him with a worthless Bishop and inferior pawns against a powerful White Rook. The rest is history after 25...Rf8 26.Rxd7 Qxe3+ 27.Kxe3 Rxf7 28.Rxf7 Kxf7 29.Rd7+ Kf8 [29...Kg8? 30.Re7] 30.Ra7 and White mops up Black's pawns while the DSB is still struggling to get out of its cage.\n",
        "25... Rf8 26. Rd4xd7 Qxe3+ 27. Kxe3": "1-0. Black sees the rest of the continuation and realizes there is no hope left to him, and graciously throws in the towel. The early space advantage White got from playing e4-e5 just completely shut down Black's game, forcing Black to leave his DSB untouched after move two and giving White all kinds of tactical opportunities.  Many thanks to fefisas for the exciting game! Comments on the annotation and the game itself are much appreciated. Thanks for reading!\n"
    },
    "url": "https://gameknot.com/annotation.pl/tactics-and-space?gm=47450",
    "gameName": "Tactics and Space",
    "players": "bwaa (1663) vs. fefisas (1598)",
    "opening": "Robatsch (modern) defence (B06)"
}