{
    "moves": {
        "1. e4": "I have just begun a switch over to playing the open sicilian, for a year or two I've played the closed, I've had reasonable results but it always feels like I'm wussing out of the main lines.  So here's my first attempt to tear down the najdorf.  I recommend skipping to move 15 when we leave 'book.'  Enjoy!",
        "1... c5 2. Nf3 d6 3. d4 cxd4 4. Nxd4 Nf6 5. Nc3 a6": "The move that defines the najdorf and leaves white with two types of choices.  Black will usually play ...e5 if given the chance and white may choose to allow that with common moves such as Be3, Be2 or f3 (which typically transposes into 6.Be3) or white can prevent black with 6.Bc4 forcing black to block the dangerous a2-g8 diagonal with 6... e6 and white can prevent ...e5 with 6.Bg5 which is the move featured in this game.",
        "6. Bg5": "Now if 6... e5 black will have a horribly weak d5 square due to the pin on the f6 knight.",
        "6... e6": "So black sensibly controls the d5 square.  6... Nbd7 is a reasonable alternative that also avoids the weak doubled pawns that would happen after a move like 6...h6?! 7.Bxf6!",
        "7. f4": "White's plan is an aggresive pawn storm on the kingside while castling queenside.  At the same time though black can activate and has far better pawn structure in an endgame (as is the case in most sicilians, the sveshnikov being a notable exception).",
        "7... Be7": "A common line but one I was happy to see as white can very quickly begin a pawn storm.  Other moves include (but are not limited to) Gelfand's favorite 7... Nbd7, the infamous poisoned pawn that usually follows 7... Qb6 (the poisoned pawn is when black grabs b2), Polugaevsky's line with a risky 7... b5, 7... Nc6 and the tricky 7... Qc7 where if white follows with a standard plan of Qf3 and 0-0-0 black starts a very quick attack by marching the b pawn.  But these are all main lines outside of this game.",
        "8. Qf3": "The standard move, ...b5 can now be met by e5! forking rook and knight and white is prepared to castle queenside (which puts the rook on the same file as the black queen.",
        "8... Qc7": "So the black queen leaves the file to a square where it can potentially stare down the white king on c1.",
        "9. O-O-O": "I'm happy to castle, I will now begin throwing forward everything I have with moves like g4.",
        "9... Nbd7 10. g4 b5": "The battle lines are drawn.  The plans are clear, black will conclude development if he gets the chance with ...Bb7 and then use the c file with moves like ...Rc8 and ...b4 to pry it open.  White goes kingside, black has not castled yet but white can also blast open the center if necessary with one of his three levers (e5, f5 and g5).  The main plan here is to get the bishop out of the way of the g pawn, so white plays:",
        "11. Bxf6 Bxf6 12. g5": "And white advances his pawn with tempo gaining even more kingside space.  While white may be filled with holes in a potential endgame surely he has excellent play for the moment and excellently placed pieces.",
        "12... Be7": "12... Bxd4 doesn't promise much to black white will play 13.Rxd4 followed by Bh3 and pressure on e6.",
        "13. f5": "This pawn sac is theory and by far the most powerful move in the position.  White has huge pressure on the weak e6 square.  Black has two choices, defend e6 with 13... Nc5 or grab the pawn and survive the ensuing complications.",
        "13... Bxg5+": "My opponent grabs.  A reasonable choice, but he will have difficulty relieving pressure on e6.",
        "14. Kb1 Ne5": "Defending e6 with tempo on the white queen, but the tempo (and pawn) will be won back.",
        "15. Qh5": "This move both attacks the bishop on g5 and pins the f7 pawn (which renews pressure on e6).",
        "15... Be3": "And we have finally left book.  Black's move threatens to exchange white's knight but it draws the bishop away from defensive duties.  I've seen 15... Bf6 recommended and Q to e7 or d8 seem to be the most popular moves.  But why is 15... Be3 worse?  That was the question posed to me, and I think it's because the bishop becomes a target for white's pieces, my queen will not be on h5 forever, and when it returns to e2 it will do so with gain of tempo.  Also a knight on d5 will fork queen and bishop (again winning tempo), how can I make that happen?",
        "16. Nxe6": "But of course!  The f7 pawn is pinned and I now win the d5 square.",
        "16... Bxe6": "The knight is far too threatening to leave alive.",
        "17. fxe6 O-O 18. Nd5": "Winning a key square.",
        "18... Qc5": "18...Qa7 is the only alternative to defend the e3 bishop, but this seems to be more centralized.",
        "19. Bh3": "Defending the now attacked e6 pawn and maintaining even material.",
        "19... g6": "This is where we leave the GK database and I feel it's almost a decisive mistake.  The position is extremely sharp and now black has holes on both f6 and e7 for my knight to hop into.  While I don't have a dark squared bishop to attack the dark squares my excellently placed knight seems sufficient, my queen is attack but I can retreat with tempo against the misplaced e3 bishop.  My pawn on e6 allows me to play e7 or weaken the g6 pawn exf7 .  Also, due to the opening I don't have f or g pawns stopping my rooks from aiming directly at his king.  What's better?  I'm not sure.  19... fxe6 20.Bxe6 Kh8 has a few games in the database and the following positions favor white, which throws doubt on the entire 15... Be3 idea.",
        "20. Qe2": "I retreat with tempo, slightly sad that 20.Nf6  Kg7 21.Qxh7  Kxf6 leads to nothing as his king can escape to e7 (or if I check on h4 back to g7).  But still, I gain tempo on the bishop with the threat of e7 Rfe8 Nf6  picking up an exchange.",
        "20... Bg5": "This defends both weak dark squares (f6 and e7) but lets me develop against his bishop while lining up on the king.",
        "21. Rhg1": "Naturally.",
        "21... Bh4": "Ever since 15... Be3 the bishop has proved a target for my pieces, once again it moves to an unprotected square and it vacates the g file, leaving only a pawn in front of my rook (and one of the pawn's defenders: the f7 pawn, can be easily removed).  I expected my opponent to try to hunker down with either 21... h6 or 21... f6 (even 21... Bd8 where it's at least not going to lose more tempo seems an improvement) but both moves leave his position with many holes.  Here's a sample line: 21... f6 22.Rxg5!? fxg5 23.e7 Rfe8 23.b4! Qc4 (a lot of squares allow knight forks) 24.Qxc4 Nxc4 25.Nc7! Rab8 (actually 25...Kf7 is fine for black, this line doesn't quite work, but even without this line working white's got a great position, instead I should probably improve with a move like 22.e7 Rfe8 and the rook lift 23.Rg3 where it has great potential and Rc3 is a nice threat)) 26.Nxe8 Rxe8 27.Be6  Kg7 28.Bxc4 bxc4 29.Rxd6 with an easily winning endgame.  There are too many holes in black's game, and without the dark squared bishop to defend my attack is simple.  Following this concept later in the attack there will be a crossroads, and the correct continuation will be the one that gets rid of the dark squared bishop.",
        "22. exf7+": "! Weakening g6.",
        "22... Nxf7": "22.... Rxf7 23.Be6 is awful for black, and if he takes king then the king is on a dangerous open file.",
        "23. Qh5": "The queen comes back forward with tempo.",
        "23... Bd8 24. Rxg6+": "! This move looked very powerful, but I admit I did not see the followup yet- it's more of an auto-sac .  I had a bail out move in mind in case I couldn't find a clearly winning followup.  Knowing that after 24.Rxg6 ! hxg6 25.Qxg6  Kh8 that I'd at least have the move 26.Rg1 made me much more confident.  26.Rg1 forces 26... Qxg1  27.Qxg1 and there's no way I'm going to lose.  His pieces are awkwardly placed and I still have an excellent unchallenged knight on d5.",
        "24... hxg6 25. Qxg6+ Kh8": "Here is the moment of decision.  I think there are probably many roads to Rome in this position but some precision is required as I have sacrificed a full rook and the attack isn't as automatic as it might first appear.  I already mentioned that 26.Rg1 was my bail out move in case I couldn't find better, but my main idea was 26.Bf5, so here goes the analysis:\n\n26.Bf5 Ng5 is forced, it defends h7 and threatens to give back an exchange to get rid of my attacking bishop 27.h4 seems the only logical way to continue as I don't see queen checks helping 27... Qf2 is probably best as black must secure the h file and he can afford to give back a little material (27... Rxf5 28.exf5 Nh7 29.Rg1 is probably good for white by 28.hxg5! is even stronger, threatening to use the h file, and black is absolutely hosed).  28.hxg5 Qh4 and after 29.Qxd6 Bxg5 there's still a game.\n\nSo how should white continue the attack?  Black's defense is based around holding the g5 square for just long enough to stave off my attack.  So I have to get rid of that control... with tempo if possible.",
        "26. Nf6": "26.Nf6!  Due to the eminent mate threat on h7 black has no choice but to take the knight.  While the d5 knight might seem a better piece than the bishop, the bishop has far more influence on the kingside as the knight takes two moves to really enter the attack.  With the bishop gone black's defense falls apart.",
        "26... Bxf6 27. Qxf6+ Kg8": "Obviously not 27... Kh7 which allows 28.Bf5 .",
        "28. Qg6+ Kh8 29. Bf5": "Only now comes Bf5, and while 29... Ng5 is still forced, it's no longer at all secure there.",
        "29... Ng5": "Actually 29... Qxf5 lasts longer, but mate threats are still looming and even if black's not mated, white's pawns are excellent.",
        "30. Qh6+": "30.Qh6 !  A simple move, but I should take the knight with check.  If 30.Qxg5 Rxf5 might make the game last another 20 moves.",
        "30... Kg8 31. Qxg5+ Kf7": "If the king hides in the corner it's mate in two 31... Kh8 32.Qh6  Kg8 33.Qh7#.  But it's forced mate anyway.",
        "32. Qg6+ Ke7 33. Qe6+ Kd8 34. Qd7#": "Why did this attack work?  The lines were drawn very early as white went forward with e4,f4 and g4 while black pushed ...b5 but never got much activity.  It seems to me that even without the mistakes in the 7... Be7 line black is constantly on his heels.  The dubious move 15... Be3 put the bishop on a weak square.  19...g6 avoided an inferior endgame but allowed me to reposition with tempo.  21... Bh4 clearly lost time and made the attack flow easily.  His bishop may have been the key defensive piece to get rid of at the end of the combination but it was a useful target for most of the game.  The rook sac was automatic, and it was 26.Nf6! that took me a long time to see, though I was careful to keep a safe move in case I couldn't find a way to put black away.  This was a nice introduction to the najdorf for me, though I think my record at this point is 1-2 in correspondence/otb games and 2.5-.5 in blitz.  I hope you enjoyed the attack and thanks for the game and conversation steverand67."
    },
    "url": "https://gameknot.com/annotation.pl/taking-up-the-open-sicilian-najdorf-1?gm=11062",
    "gameName": "Taking up the Open Sicilian: Najdorf #1",
    "players": "raskerino (1610) vs. steverand67 (1680)",
    "opening": "Sicilian (B99), Najdorf, 7...Be7 main line"
}