{
    "moves": {
        "1. d4 Nf6": "Tal sets the scene to his inferno with the Indian Defense opening which can easily morph into almost any defense of his choosing.",
        "2. c4 g6": "Bobotsov lays claim to the center as Tal preps his bishop's fianchetto along the h8-a1 diagonal.",
        "3. Nc3 Bg7": "Now that Tal's fiancetto is complete, he can add the next ingredients that composes the alchemy of his inferno.",
        "4. e4 d6": "E77. King's Indian/ Six Pawn Attack.",
        "5. f3": "E80. White plans to castle long and fight king-side, but of course Tal knows that...",
        "5... O-O": "King-side development complete! Now into the inferno we shall delve!",
        "6. Nge2 c5 7. Be3 Nbd7 8. Qd2": "White anticipates his O-O-O.",
        "8... a6": "Tal continues with his plan to dominate the queenside by restricting White's ability to manuever with ease.",
        "9. O-O-O Qa5": "Tal subjects his queen to a discovered attack/sacrifice which proves to be his least necessary piece.",
        "10. Kb1": "What's Tal's next move? Hmmm... 10...Nb6 seems sound, attacking c4 with a fork on White's queen and bishop or perhaps 10...Re8 will suffice...",
        "10... b5": "Tal chooses to continue mounting the pressure on White's queen-side while setting the stage for his Queen's dramatic suicide.",
        "11. Nd5": "For white's next move, 11. dxc5 dxc5 would've been abit more reasonable as to open the d-file and then 12. Nd5. ",
        "11... Nxd5": "And now the moment we've all been awaiting!  Tal thrusts his queen into the pit of the inferno as the spectators gasp with awe! Now all Tal must do is stir the fire that it may burn ever fiercely!",
        "12. Qxa5 Nxe3": "White is now up in material, but he must figure out how to use this to his advantage.  Meanwhile, Tal eyeballs the b2 square and plans to open the diagonal for his bishop on g7 who's been waiting so patiently for its time to shine.",
        "13. Rc1": "White moves his rook to safety and hopes to trade down material to ease the pressure and regain the initiative but as we shall see, hope will soon be all White has left..",
        "13... Nxc4 14. Rxc4": "It is commonly agreed that 14. Qe1 would've been the better move here.  White does achieve the opening of the b-file, but unfortunately (for him) it is to Tal's advantage. ",
        "14... bxc4": "Material is now even but Tal's position is clearly much better.",
        "15. Nc1": "White activates his bishop and attacks c4.",
        "15... Rb8": "With mounting pressure, Tal ceases the b-file.",
        "16. Bxc4": "With White's d4 pawn free for the taking, 16...Bxd4 would allow White to counter Tal's bishop with 17. Nb3 while safeguarding his vulnerable b2 square.  All would be well and return to normalcy.  But tsk tsk, White's bishop is just abit too pesky...",
        "16... Nb6 17. Bb3": "Perhaps 17. Bxa6 would've been better, gaining a pawn while trading down and activating his stagnant queen in the process...",
        "17... Bxd4": "With White's bishop safeguarding the b2 square, Tal is free to lay claim to d4, opening the diagonal.  Tal keeps the fire raging and guns pointed at that b2 square.",
        "18. Qd2 Bg7": "Tal prevents a mounting attack on his valuable bishop with 19. Ne2 in which White would be more than happy to trade off.  Unfortunately (for white), 18...Bd7 19. Ne2...Na4 20. Nxd4...21. cxd4, is just a pipe dream!",
        "19. Ne2 c4": "Excuse me, Sir Bishop... would you so kindly step away from the b-2 square so that I may more easily checkmate your king?",
        "20. Bc2": "Thank you, kindly...",
        "20... c3 21. Qd3": "21. Nxc3 Nc4 proves to be fatal for white, ending with either a lost queen or mate.",
        "21... cxb2 22. Nd4 Bd7": "Tal opens the 8th rank for his rook, preparing to seize the c-file and maneuver his knight to a4.",
        "23. Rd1 Rbc8 24. Bb3 Na4 25. Bxa4": "Both b and c-files are possessed by Tal and his b2 pawn is once again invincable.  Trading\npieces doesn't seem to do much for White. At this point he doesn't seem to have very many options.",
        "25... Bxa4 26. Nb3": "Once again, Tal's bishop's diagonal is wide open.",
        "26... Rc3 27. Qxa6 Bxb3": "he infernal blazes full throttle as White is left with few choices. Mate lingers in the air as the\ntread (or perhaps noose?) White is hanging on gets tighter...",
        "28. axb3 Rfc8": "With both Tal's rooks charged on the c-file, can you hear the bolt locking into place? ",
        "29. Qa3": "Oops... White just steps into a forced mate... See it?",
        "29... Rc3c1+ 30. Rxc1": "Now it's mate in two....",
        "30... Rxc1+": "Well, I'm sure you see the mate by now, if you hadn't already.  White decides to throw in the towel (or maybe take an ice cold bath.)"
    },
    "url": "https://gameknot.com/annotation.pl/tals-inferno-varna-bulgaria-1958?gm=30910",
    "gameName": "Tal's Inferno. Varna, Bulgaria. 1958",
    "players": "Bobotsov, M.  vs. Tal, M. ",
    "opening": "King's Indian (E81), Saemisch, 5...O-O"
}