{
    "moves": {
        "1. d4 d5": "The game starts out with a classical Queen pawn formation.\n",
        "2. c4": "I feel like playing for a Queen Gambit.\n",
        "2... e6": "QGD\n",
        "3. Nc3 c5": "With this move the computer introduces a Tarrasch Opening, which I had no idea what it was when I was playing this, but upon looking it up in the MCO later I was very pleased in my intuitive play, but also impressed that the computer would choose this opening over other main line QGD choices.\n",
        "4. cxd5": "I remember when I first evaluated this position that this choice appears more correct than 4.dxc5 because 4...d4 can smother white positionally by forcing a withdrawl of the knight or akward placement, and simply leaving the pawns and waiting for 4...cxd4 is likewise unwanted. Another benefit of the text move is that black will be likely to be left with an isolated pawn at some point, which will tie up pieces.\n",
        "4... exd5 5. Nf3": "This position gave me pause for thought where I considered that 5...c4 could be positionally unpleasant for my bishop, but also considered that this could be remedied with a later e4 or b3 pawn move, so developing to cover d4 with a piece instead of the queen alone made sense, and this facilitates castling and rapid development.\n",
        "5... Nc6": "Black brings some pressure to d4, and could, speculatively, be planning 0-0-0, but I only considered this a mild possibility.\n",
        "6. e3": "Refuting 6...Bg4 before it can be played, this keeps d4 safe, and activates the bishop. The plan for white is to castle short, then look for a good plan for creating an improved position. I did not find this move in the MCO, so if anyone out there has some thoughts about it, please, let me know, thanks. The norm is to play 6.g3 instead.\n",
        "6... Nf6": "The knight covers d5, which enables queen play, and also suggests that 0-0 can be expected. It is possible that ...Ne4 may be played later, but at the moment that move carries no weight.\n",
        "7. dxc5": "The idea here is to lessen the black pawn presence in the center, and though it develops a bishop for black, the bishop will be a target for future attack when white is ready.\n",
        "7... Bxc5": "I ran a quick Toga analysis afer my analysis, and this is the last book move per Toga.\n",
        "8. a3": "!? With this move the obvious 9.b4 is planned, and black will have difficulties to parry this move, (8...a5) to try and prevent the move will receive (9.Qa4) !? followed by (10.b4) anyway. This could get much more complicated afterwards to undetermined favor, but this was my take on the position at the time.\n",
        "8... O-O": "Black is the first to castle and so enjoys a lead in development due to whites positional moves. Now the question will be which player has a better chance of orchestrating a good plan from the position.\n",
        "9. b4": "The idea is to cost black a tempo while developing Bb2 where it points in the right direction, plus gaining a little expansion. My guess is that in this opening white is usually concentrating on queenside play, but since the formation of the pawns has taken on a new profile, play towards the kingside seems to be warranted.\n",
        "9... Bb6": "Black maintains what could be a good bishop line, if not for the e3 pawn, but this is a good line all the same because the e3 pawn is not fixed and could perhaps be motivated to move a little later on.\n",
        "10. Bb2": "White almost seems to be playing with recklessness, but there is actually no reason for concern because black has no immediate threats with which to catch the king out in the open, and castling is not far away. White simply has plans which in order to be realized require a particular ordering of pieces beforehand, even at the cost of slow castling.\n",
        "10... Bf5": "The text move provides good central control, but I wonder if 10...Bg4 would not perhaps be an improvement.\n",
        "11. Be2": "I gave consideration to playing (11.Bb5 a6  12.Ba4) but decided against it because I wanted to make castling the priority, and because I did not want the bishop idling on the a4 diagonal - there is simply nothing to do there.\n",
        "11... d4": "!? A move that could be considered good or bad, depending upon ones point of view. It certainly did open up a box of fireworks, and so I definitely approve of the action it generates, but to whose favor does this move lean? The results may make one think white, the computer was probably heading for complexity to favor black, but perhaps the truth is actually balancing somewhere in the middle.\n",
        "12. exd4": "Essentially this move answers the question, do you like a complicated game, and the answer is a resounding yes.\n",
        "12... Nxd4 13. Nxd4 Qxd4": "!? The recapture with the queen appears dangerous, but I would have played it myself because it drops the queen directly into the center of the action, quite literally. White, due to some considerable positioning moves still has to deal with placing the king in safety and so short castling is an expected response to follow.\n",
        "14. O-O": "There was no fear of a queen trade because it simply improves white by bringing a rook to an open file, and so this move fairly screamed to be played.\n",
        "14... Rfd8": "Black begins to order pieces to bring as many threats to bear on white as possible, the current threat is a discovered attack on the queen. A threatening idea, but the rook may have been better at e8, so 14...Rad8 would seem to be an improvement.\n",
        "15. Qb3": "The queen directs play from this podium quite well, and this move also allows the creation of counter attacks.\n",
        "15... Rac8": "Black seems to have a very good position now that 2 rooks are on open files, even though one of them is not quite centralized it still leans on the knight a little, but the only trouble with actually gaining the knight is the sharp bishop lurking behind it.\n",
        "16. Rad1": "Now it is whites turn to develop into a better position, and this is attained with a gain of tempo.\n",
        "16... Qe5": "Black stubbornly maintains a hold on the black squares, perhaps with the idea of presenting some additional tactics to gain some material, (17...Rxc3  18.Bxc3 Qxe2), or maybe for more sinister reasons leaning towards mate.\n",
        "17. Rde1": "It almost looks unnatural to play the d rook to e1, especially after my comments about centralizing rooks, but this choice is actually very good for white who has to keep control of f2 and to have the possibility of playing f4, if needed.\n",
        "17... Bc7": "Black plays the simpleton mate threat, but white has a small preperation ready.\n",
        "18. f4": "The queen is asked to kindly step off.\n",
        "18... Qe3+": "The queen outraged by the prior move plays a lone ranger attack on the king, but loses some positional coordination in the process.\n",
        "19. Kh1": "Taking the required step which will then enable some creative and active play to follow.\n",
        "19... Bxf4": "Black, feeding exclusively on a diet of pawns, gains material, but this meal is not as satisfactory as it seems now that the position for black is becoming more uncoordinated.\n",
        "20. Bc4": "! White begins to generate some threats, this time two for the price of one, the queen is asked to take a hike, while the king is certainly going to be paid a visit soon. The queen will be unable to stop 21.Bxf7+ because of the hanging bishop on f4, and there is no means to prevent it by 20...Be6 because of the threat to the queen by rook. There is an even greater threat to follow the simple threats created by this move, which is a precursor of things to follow.\n",
        "20... Qd2": "Black, unable to break the tether to the bishop keeps the queen close in hopes of creating difficulties.\n",
        "21. Bc1": "!? Now the queen is harried yet again, to keep the threats going.\n",
        "21... Bc2": "!? Black seems to be learning from my play, and so the favor is returned.\n",
        "22. Bxf7+": "! This move begins a combination, which creates immediately forcing choices, and positionally threatens mate, and uses clearance and deobstruction tactics to retire the king. A knight sacrifice is intended after 23.Qe6 to accomplish the goal.\n",
        "22... Kh8": "+/-  This has the be the worse looking move of the game by black, who up to this move was doing reasonably well, but there seemed to be no practical alternative, this is forced. Now white has real chances to turn the tide and achieve a win through tactical resources inherant to the position. The knight at f6 is the cornerstone for an attack against the trapped king.\nAlternative variation: 22... Kf8 23. Qe6 Qxc3 (23... Re8 24. Bxe8 Qd8 25. Qf7#) 24. Qe7#\n",
        "23. Qe6 Qxc3": "The black queen escapes certain disaster with the gain of a knight, but loss of positional quality.\n",
        "24. Bxf4": "White does not have to feel to bad about the knight sacrifice since it was temporary. Trading up, in a manner of thinking.\n",
        "24... Qxa3": "?? The black queen, starving, feasts on a pawn. This is greedy, considerations to the building forces around the king should have weighed more heavily, and now certain disaster is destined to strike. Alternative lines fight more, but still favor white.\nAlternative variation: 24... Qc6 25. Qe3 Rd7 (25... Rf8 26. Qe7 Nd5 27. Bxd5 Qxd5 28. Bd6 Rg8 29. Rf7 Rce8 30. Qxe8 Rxe8 31. Rxe8#) 26. Be6 Re8 27. Bxd7 Rxe3 28. Bxc6 Rxe1 29. Rxe1\n",
        "25. Bg5": "The idea is (26.Rxf6 gxf6  27.Bxf6#) and note the artistic pin of knight to rook.\n",
        "25... Rc6": "Black, reluctant to suffer mate at this moment is forced to use force against the queen. Notice how the introduced rook will now guard f6.\n",
        "26. Qe7": "The position becomes dire, the rook is enprise, and now (27.Rxf6 Rxf6 28.Bxf6 gxf6 29.Qxf6#) is a problem.\n",
        "26... Rg8": "Black offers the rook in sacrifice to hold the position together. This does not mean an immediate sacrifice.\n",
        "27. Rxf6 Rxf6 28. Bxf6": "This is the end of my first line of thought when playing 22.Bxf7+  at the start of the combination. The position is very good for white who is winning.\n",
        "28... Qa6": "An obvious improvement to 28...gxf6, now black is still in the game, barely.\n",
        "29. Bxg7+": "! A forcing move that does not allow the queen to respond.\n",
        "29... Kxg7 30. Bxg8+": "! Stripping away all protection from the king, forcing only a kingly response.\n",
        "30... Kxg8 31. Qg5+": "It takes a little time to achieve a good net, and this move while it appears somewhat uninspiring does actually work well positionally with the game continuations.\n",
        "31... Bg6": "The lesser piece is used to block, although the queen could have interceded, but it may not have helped really.\n",
        "32. Re8+": "Closing the position some, this move is preferrable to attempting Kg1 with Rf1 because of unwanted checks. The forcing check keeps the white king safe from mate for the moment.\n",
        "32... Kg7 33. h4": "A tricky move, bringing in some square control, and a little threat to the bishop. Black could play 33...h6, but then the position becomes even more closed, although not immediately terminal, this could speed that result. This move also prevents a back rank mate on the white side of the board.\n",
        "33... Qc6": "Threatens the rook.\n",
        "34. Re7+": "Making an intermediate move, afterwards the rook will hold the line from e1.\n",
        "34... Kf8 35. Re1": "White gained a little positionally from the prior rook check, the king sits on the back rank.\n",
        "35... Qd6": "Prevents 36.Qe7+ and targets b4.\n",
        "36. h5": "Bringing in the heavy hitter, the position is constricting.\n",
        "36... Qxb4": "?? This just hands the game completely to white who now can make use of the 7th to great effect.\n",
        "37. Qf6+ Kg8 38. Re7": "Note that 38.Rd8 fails due to the bishop, and 38.hxg6 fails to 38...Qxd1+ losing the rook and not attaining mate, but the text move introduces threat of 39.Qg7#\n",
        "38... Qxe7": "If (38...Qe1+  39.Kh2) then afterwards no more checks are available and white wins. So black sacrifices for a slow death.\n",
        "39. Qxe7 Bxh5 40. Kh2": "The king is obviously needed to complete the mate, and there will be a heavy use of black squares for white, and three pawns will need to be attended to in their time.\n",
        "40... b5 41. Qxa7": "Removing one promotional threat while keeping the king trapped on the back rank.\n",
        "41... Be2": "Centralizing, and guarding b5, prevents g4 without support.\n",
        "42. Qb7": "Chains the bishop to the a6-f1 diagonal.\n",
        "42... h6 43. Kh3": "The idea is to simply walk the king up the board to support the queen for mate.\n",
        "43... Kf8 44. g4": "Taunting the bishop, which if it takes the pawn will help white obtain mate quicker.\n",
        "44... Bc4 45. Kh4 Ke8 46. Kh5 Kd8 47. Kxh6": "Removing a promotional threat while on the way to the office.\n",
        "47... Be6 48. g5": "The pawn probably is not really necessary, but I hang onto it for some reason.\n",
        "48... Bc8": "Black loses a pawn to gain an annoyance.\n",
        "49. Qxb5 Bd7 50. Qb6+ Ke7 51. g6": "The pawn seems  to be of use in providing certain distractions while weaving a good mating net.\n",
        "51... Be6 52. g7 Bg8 53. Kg5": "All white pieces reside on black squares which make it easiest for white, g7 is protected by way of Qf6+ against ...Kf7.\n",
        "53... Bf7 54. Qc7+": "A forcing move where if the king heads to the shallow end of the pool, then the bishop will be lost, or if heading to the deep end will be trapped and mated.\n",
        "54... Ke8": "The king dives into the deep end, this shortens the game considerably, relief.\n",
        "55. Kf6": "The king is now in a royal jam, and white is still making effective use of the black squares.\n",
        "55... Bd5 56. Qe7#": "It took a while, but mate is still mate no matter how many moves, and this was definitely not a draw. The game was won due to my play having some reasonable strength, healthy calculations on my part mixed with a little risk, a feasable attacking plan, well timed piece sacrifices or exchanges seemed to make it work. The combination, while not calculated to mate did give good results as I expected. The computer played an interesting opening, very creative, I like, and it introduced a position having a thicket of tactics, which made this a very enjoyable game, especially since I was motivated to win, but not completely certain of getting it. Contributing factors to the win were a few weak moves at critical moments, and perhaps a little excessive material greed by black.\n"
    },
    "url": "https://gameknot.com/annotation.pl/tarrasch-defense-6-e3-variation-m55?gm=25968",
    "gameName": "Tarrasch Defense 6.e3 Variation - M55",
    "players": "ChessKnave  vs. Computer - FH005 ",
    "opening": "QGD (D33), Tarrasch, Schlechter-Rubinstein system"
}