{
    "moves": {
        "1. d4": "Sometimes in chess material advantages do not mean a whole lot and the Tarrasch Defense proves this point. In exchange for the isolated d-pawn black gains space free development and attacking chances. This game features perfectly the key characteristics of well coordinated pieces in tandem with superior mobility that are trademark Tarrasch.",
        "1... d5 2. c4 e6 3. Nc3 c5 4. cxd5 exd5 5. dxc5": "The main battle from white's point of view is to control the dark squares around the the d-pawn,",
        "5... Nf6 6. b4": "In this line of the Tarrasch white seeks to retain his pawn advantage. However, just like in the Queen's Gambit accepted it is wiser to give it back the extra pawn for rapid development.  I consider this an inferior move that in the end creates serious holes on the queen side especially on c3. \n\nAs it turns out I have played this move myself to a winning advantage. here is the link\n\nhttp://gameknot.com/annotate.pl?id=29189",
        "6... Be7 7. Nf3 O-O": "business as usually. I complete my development before attacking. other than my isolated pawn I have no serious weaknesses. Notice that I have not developed any of my queen side pieces? This is because the threat of b4-b5, also most grandmasters delay developing the light bishop until white plays his. ",
        "8. a3": "the proof of the shakiness of 6. b4 is that white thinks it is necessary to support it. Although at this point it is not in any danger so the move is a bit of a waste of tempo. I kinda like the idea of Bb2 myself",
        "8... a5": "This is a bit of a risky move, however I felt that with my king tucked away it was time to deal with the chief reason why my queen side pieces were not developed(b4!). With ...a5 I bust open for use the h file and create some time and space to take advantage of the fact that whites king is still in the centre. ",
        "9. Bf4": "I am not sure this is the best diagonal for this bishop. I prefer 9.Bb2 where it can keep an eye on the a1-a8 diagonal",
        "9... axb4": "This works because white did not play 9.Bb2",
        "10. axb4 Rxa1 11. Qxa1": "with the queen deflected to a1 the black d5 pawn is can breath a bit easy now. This is a good thing because it gives me time to play Nc6 now. ",
        "11... Nc6": "black is down by a pawn but has the initiative for it. Black has two threats one is to advance the d pawn and the second is to capture b4. ",
        "12. Qb1": "? this is no better than the queen sitting on a1",
        "12... d4": "12. Qb2 would have prevented this nasty thrust. Black's IDP is a double edge sword it is both his weakest point but if not respected(like in this game) it becomes his most powerful weapon. ",
        "13. Nb5 Nxb4": "wins back the pawn! \n\n14. Qxb4 Nd5! -/+",
        "14. Bc7": "the only way to take the Knight on b4. However I have a nice tactical plan in the event of Qxb4",
        "14... Qd7 15. Qxb4 Nd5 16. Qxd4 Qxb5": "And here it is I sacrifice the knight for a strong attack. This is a sound sacrifice that I am sure caught Valeriuzahia by surprise. ",
        "17. Qxd5 Bxc5": "In exchange for the knight black has gained excellent mobility, a supported past pawn, back rank threats and dominance on the queen side. ",
        "18. e4": "a must because 18 ...Qb1+ wins or 18. e3 wins the queen via 18. ...Bb4+",
        "18... Qb1+": "This prevents white from castling and makes it very difficult for white to bring his rook into the action. As a result even though black is technically a minor piece behind he is practically two pawns to the good because of the lack of communication between white camp. ",
        "19. Ke2 b6": "hinders mobility of the white bishop, places the pawn on a safer square and opens the a6-f1 diagonal for the light bishop.  ",
        "20. Nd2 Ba6+": "My what fine bishops you have Mr wolf!",
        "21. Kf3 Qe1": "Threatening mate on f2",
        "22. Bg3": "??\nOften times in chess mistakes are not outright(i.e dropping a piece) rather are the result of small positional blunders. Here the Bishop does prevent the checkmate on f2 but it also takes away a escape route from the king. Therefore it can not be the best move. I was expecting...\n\n22. Bxa6!(the only way I see to ensure the draw) Qxf2+ 23. Kg4 Qxg2+(black has regained some material but does not have enough for the win) 24. Bg3! (the bishop returns home to assist in the defense and the game is drawn) ",
        "22... Qd1+": "! Black starts a combination of forced moves that lead to mate. ",
        "23. Kf4 Bc8": "!! a very strong and forceful move that threatens checkmate and has only one reply",
        "24. Nf3": "The only move White must break the communication of Black's well coordinated pieces.",
        "24... Qa1": "renewing the mate threat. ",
        "25. Ne5": "?? Valeriuzaharia needs to rein in his horse because he is getting ahead of himself. \n\nTo me the most logical defense was...\n25. Bh4(taking away the checkmate square and giving back an escape square) Be6 26. Qd2 Qa4 -/+ black has a winning edge. ",
        "25... Be6": "!! the power of this move is in the fact that after white moves his queen the knight on e5 is just about dog food. ",
        "26. Qd2": "the only square. ",
        "26... f6": "!! seizing control of the important e5 square and creating a mating net around the white king",
        "27. Nd3": "Not Nf3 because then the white kings has no escape routes\n\n27. Nf3?? g5+ 28. Nxg5 fxg5+ 29. Kxg5 Qf6+ 30. Kh5 Qg6+ 31. Kh4 Qg4++",
        "27... Rd8": "Pinning down the last free piece for white and again threatening mate with 28. Rxd3 in four moves. ",
        "28. Kf3": "the only move that avoids mate",
        "28... f5": "Go further mighty pawn and clear the f file and strike fear in the heart of the enemy king!",
        "29. Be5": "there is nothing white can do but allow black to win. ",
        "29... fxe4+": "I love these little in between moves!",
        "30. Kf4": "the pawn is immune because...\n30. ...Qa4+! wins the queen",
        "30... Qa8": "white played on for 6 more moves before resigning. "
    },
    "url": "https://gameknot.com/annotation.pl/tarrasch-defence?gm=31828",
    "gameName": "Tarrasch Defence",
    "players": "valeriuzaharia (2042) vs. elyhim (2022)",
    "opening": "QGD (D32), Tarrasch defence, Tarrasch gambit"
}