{
    "moves": {
        "1. e4": "You'll find in this annotation some \"questions\", proposed lines to find out before seeing the next move. Just for fun. Please read the final comment. ",
        "1... d5 2. exd5 Nf6 3. Nc3 e6": "The Icelandic. At higher levels it won't be safe, but for fun and as a test for myself, it's a good \"battlefield\" for training. It forces me to find the \"best\" move at any moment. The try is more valuable because my opponent didn't play the usual (and bad) c4. Now I'll have a real \"test\".",
        "4. dxe6": "Good. ",
        "4... Bxe6": "As the manual says. ",
        "5. Nf3": "This moves enables for black the plan Qe7, wanting to use the discovered check (Bg4+) to follow on with BxN, forcing white to retake with the g2 pawn. This just scrambles and isolates white's pawns. Of course, this plan implies the longside castling.",
        "5... Qe7": "I go for it. I'm not worried for blocking myself the Bf8. I have to find a way to develop it in the near future, right, and is one of the opening's downsides. ",
        "6. Be2": "White is almos forced to play this. Note that Bb5+ is a blunder, since after c6 (black has this move in the agenda, too, but better is to keep it to prevent white's check and not to waste a tempo in doing it prematurely), white's bishop has to retreat to e7. ",
        "6... Bg4": "This was a bad move, since now white can castle, and the open e column will revert on black. ",
        "7. O-O Nbd7": "I have to ensure the queenside castling the next move, but in doing so, I am neglecting the dsb's developement. Now my queen would struggle to find a place. All this because of Bg4?",
        "8. h3 Bh5": "This whie's advance, actually favours me. I want to be his defences a little opened to find some counterplay. ",
        "9. Nd4": "...and here, it came a hard decision. I can exchange, for a boring game. Or I can try something else. Inmediately after I played the following move, it seemed to me very unwise. Nb5 is a very strong move, and I should have used the exchange to play c6 and stop it for a while. But I didn't see it at the moment. ",
        "9... Bg6": "My B and N block the advance of my own pawns, further imprisioning my dsb. Still, I like the way I am controlling a lot of center squares, and how white has to resolve his developement, too. Sure, no weak points in his position, and my queenside is weak. ",
        "10. d3": "He didn't play a N to b5. Incredible. This was his first \"blunder\". This move frees his dsb, true, but he also gives me tempos to coordinate. ",
        "10... c6": "AAAAAhhhhh.... I feel a lot better, now! The sac (Nb5, threatening the fork), is not effective anymore without the bishop looking at b5. ",
        "11. Re1": "Enabling the dangerous pin. Note that when I decided to keep the bishop in b6 (\"it looked such a nice spot!\"), I gave up the Be6 \"shield\" that could have been useful. But it is a defensive move, and I know how most \"purely defensive\" plans end... ",
        "11... O-O-O": "I castled, with a little fear of what will be about to come. ",
        "12. Bg5": "This is not a problem. Note that now Nd7 can uncover, by moving, a threat on white's Nd4. I couldn't see where did it lead, so I preferred to take advantage on the unprotected Nd4 and free my dsb in the meantime. That will prove to be very \"expensive\", in terms of queen's hunt. Can you figure out?",
        "12... Qc5": "Black threats the Bishop, too. I welcomed BxN, NxB. But it has a downside, ",
        "13. Be3": "Obviously. My Q can go to e5, but after it, I think my queen would have no future (not even with Bd6 supporting it). So I decided to leave it in the queenside. ",
        "13... Qb4": "It's a \"farol\" (when you bet a lot for nothing just to scare your opponents). In order to open the b column, white can afford to lose a N, for sure!",
        "14. Qc1": "White defends. The game is cramped for both sides, and many combinations are awaiting after any move. Here, Ne5 causes Nd4 to be en prise, but if white answers with a3, I am forced to move the Q to b6. Can you say if it is better or worse than the played?",
        "14... Bd6": "\"Now or never\". I know that I am falling in the known problem: I am occupying the perfect \"escape squares\" for my queen, that now will be hunted, while white advances over my K. ",
        "15. a3": "Here it comes. ",
        "15... Qa5": "I am accepting b4, but what else? If Qd5, Ne6, winning the exchange at least. ",
        "16. Nb3": "? I's say a blunder. My opponent is playing passively, and this is a pity, since the test won't be so severe. ",
        "16... Qc7": "Wonderful! Now, I have to be very careful about the known attacks that spread out of b5 (now impossible) and Bxa7, and the well-know resource b6, forcing white to Bxb6, and black has the best of it. ",
        "17. Nd4": "White doesn't go for it! This move enables the b4-b5 threat. I can't meet it with a6 because of a possible Bb6. I have to look for a safe b6. ",
        "17... Kb8": "I decided to meet my opponent's calm style, and avoid once for all to chek each move if the Bxa7-g6 move was still good for me or not. This way I don't have to worry. But I slowened my reaction a tempo, and this was a mistake. ",
        "18. a4": "White decides to attack with the \"wrong\" pawn. I'll just leave him go to a6, and play b6. I have two tempoes for it, so I can't lose any. \nI have a battery on the white king, and white has to be very careful. I plan to play a typical \"a piece for a column\" sacrifice. Can you tell which? I need just ONE preparatory move. Which one? Done? :-D",
        "18... h5": "The planned sac is Ng4. The idea is that if hxN, hxg opens the column to my rook's action, and this will give me good attacking chances. On the other side, white can stop all this with a good (and obvious) move I didn't see in the hurry. Can you tell which one?",
        "19. Nf3": "No, not this. This was done to cover h2 or to open the way for Wdsb look to a5-Bb6. I don't know. But this was a mistake from white, in the sense that now the sac is even more playable. After Ng4, hxN, hxg, the N is threatened. He can go away, but subsequently white will have to stand the known \"Bsac Q mates\" routine: Bh2+, etc, EXCEPT that now white can escape with Kf1. This will still be a good attack for black. Should black have gone for it? Can you tell?",
        "19... Ne5": "I didn't. I just choose the other strategy: exchange the knights, and the threat of my sac Ng4 will still be there. (Now, you can say: well, white is not forced to take the knight after Ng4. True. Good thinking. So you have to chech all the other possible white's responses... and this is when the game becomes too interesting for a blitz). But this \"change knight's\" strategy of mine is just WRONG. Beacuse by allowing white \"free\" his f2 pawn, I enable his \"best defence\"! So, I can dare to say that the knight's sac had to be played instead. ",
        "20. Nxe5": "White falls into it. I got a goal: to coordinate my pieces. Bla bla bla. All pure crap. ",
        "20... Bxe5 21. f4": "...because of this. Well, it could have been d4 as well. \"Why is this a problem?\" I asked myself. \"Well, because it makes the two WB weak, but you don't have a single rook in the e column to press on them.\" \"But\", I replied, \"all this central stuff catches me unprepared. I played for a h column attack, now I just have to try to keep the threat \"on\" (or near so) as long as possible.\"",
        "21... Bd6": "I had to accept something like d4, now... I though that I would have lost. A simple oversight that ruined my game. f4 is always a white's resources in the opening I play, how did I forget?",
        "22. Bf3": "Oh, yeah, of course. Now b4-b5 is really serious. ",
        "22... Bf5": "Now, you really need more time to think about this. I was resouceless. This is thinking in making the lsb help from c8 or d7. ",
        "23. Ne4": "Fortunately, white doesn't consider his best plan, b4-b4, for another move. He wants to exchange my precious dsb, and I can save it only by taking it off the diagonal. The \"correct\" move was Ne7, but I can't stan for such a passivity, so I decided to give this bishop a concrete purpose: to exchange W's dsb. In order to do so, he will have to go in enemy's battlefield and stand enemy's infantry fire. But.. this will bring him nearer to my king, but will allow weak spots in his center, also (particularly d3!), and, you know me... Which was the plan, and why it was bad? Done? Please, go on. ",
        "23... Bb4": "Just consider this hint: \"white can go NxNf6 at any moment. He must do it if he wants to play d4 (or NxNe4). He needs to play d4 to avoid the dsb's exchange, and threat to trap the black bishop after the pushes.\" Moreover, white has to calculate what damage can come from (1) Rxd3, 2) after the N exchanges, the threat Rg8-Bxh3. ",
        "24. c3": "White was too tempted, this time, from the chance to advance, and he took the bite. ",
        "24... Ba5 25. b4 Bb6 26. a5": "? b5 was better. Black would have been forced to play c5, and this opens the way for Wlsb. Very strong. The played move allowed the exchange. And the exchange has another inconvenient for white, a \"hidden\" one. Can you see it from here?",
        "26... Bxe3+ 27. Qxe3": "...and the queen lands on a perfect spot for me to make a hidden and nice N fork. ",
        "27... Nd5": "The queen and the f5 pawn are forked. Moreover, B threats BxN and Nxc3 (if ever he dares to play it!)",
        "28. Qc1": "White makes his Q defend c3 in case I go for it. f5 is lost. It was all dsb exchange's fault. ",
        "28... Nxf4": "The problem with this is that d3 is double-threatened...",
        "29. Re3": "Only reasonable defence. We are at move 30, and just now it is starting to burn. Very few pieces have been exchanged, and the position is devilishly complicated. For a blitz! I thought that the d6 pawn could have some hidden poison behind it, and I didn't take it. I was looking for the royal fork (Ne2). R and B prevent that, but maybe both pieces can be diverted by a sac on d3. What do you say? Is it a good plan?",
        "29... Bxe4": "It was a serious mistake. Nothing comes from it. White has dxe, BxB AND RxB. None is forbidden. ",
        "30. Bxe4 Rhe8": "Just piling up. And a mistake? Any wasted move is a mistake. But my opponent's following move was more than a mistake. It seemed sooo natural...",
        "31. Rf3": "...and the so interesting game came to a very premature end. The material was equal, black lost some of his edge with the stupid exchange of the B for the N, but the game is still very playable. A pity. I hope you had some laughs with the \"teaching style\", and please forgive me for my mistakes. The chessistic views here contained CAN BE WRONG. I am not a qualified commenter, I just do this for fun and for love to chess. Thank you for reading. ",
        "31... Ne2+": ""
    },
    "url": "https://gameknot.com/annotation.pl/teacher-mode-on?gm=56238",
    "gameName": "Teacher mode \"on\"",
    "players": "player (1800) vs. damalfi ",
    "opening": "Scandinavian defence (B01)"
}