{
    "moves": {
        "1. c4": "bluenoser: d6 or Nf6\nwhich would be my usual response to c4.  roneshet: d6\ncan you explain in a sentence the reason for d6?  a_random_guy: 1...Nf6\nThat knight belongs on f6.\n\nThe d pawn can still be moved up 1 or 2 squares later, depending on white's move.  roneshet: Nf6\nSorry for asking. Why is it important to move to knight now?  ptitroque: 1. Nf6\nis ok for me.",
        "1... Nf6 2. g3": "bluenoser: d6\nPossible Pirc defence?  a_random_guy: 2...c6\nAgain, there are multiple viable moves here, it is mostly a matter of preference.\n\nI pick 2...c6, to prepare to push d5 at once.  roneshet: c6\nI agree. I think his next move will be Bg2 - so c6 will also defend our castle...",
        "2... c6 3. Nf3": "roneshet: d5\nI'm not sure. But i think we need to open the middle a little bit.  bluenoser: g6\ng6 with thoughts of Bg7 developing and getting ready for our king side castle, if they play d4 we could play d3 instead of Bg7. I think d5 could really open things up also, with lots of possibilities. I just like to play a bit more defence.  a_random_guy: 3...d5\nAfter all, we played 2...c6 to prepare 3...d5.  ptitroque: 3.d5\nis good. We shouldn't let whate taking the control of the center (not without fighting for it, at least)",
        "3... d5 4. b3": "a_random_guy: 4...Bg4\nSimple developpement move.\n\nAlternatives are 4...e6, 4...g6, 4...Bf5 and 4...dxc4.  bluenoser: 4...Bg4\nLooks good to me  ptitroque: 4... g6\nTo fiancheto our DSB, as they have opened the long black diagonal. Our LSB could also be nicely placed in e6 - we can see later were to settle it.  roneshet: Bf5\nI say we should take out our bishop, so we can open the way to take out the knight afterwards to d7. then we can move safely e5.",
        "4... Bg4 5. Bg2": "bluenoser: e6??\nI was thinking e6 to open our diagonal for our Bishop. We could also play g6 with intent of Bg7 and castling.  a_random_guy: 5...e6 is fine\nOverprotecting d5 is a good idea, it lets our DSB out and our LSB is already out, so it won't be locked in.\n\nAn alternative here would be 5...Nbd7. It likely transposes into the same lines.  roneshet:  Nbd7\nI thinks we need to protect e5 - the middle.\nThan we can move to e5 next move.\nThe way i see it, d5 is already overprotected...  ptitroque: 5. e6\nFreeing our DSB, so that we'll be able to castle whithin 2 moves and have control over the a3 f8 diagonal.\nNbd7 ik ok as well. ",
        "5... e6 6. O-O": "a_random_guy: 6...Nbd7\nIt's clear that our b knight belongs to d7 for now, to support f6, e5 and c5, so we may as well play it now. We'll have to wait for White's reply to figure out what is the optimal square for our black squared bishop.  roneshet: Nbd7\nI agree. I think we should also prepare for right side castling. we need the h8 rock there.  ptitroque: 6... Nbd7\nFor the sames reasons than a random guy.\nWe have to get control on c5 and e5.\nWe have no other proper place for the knight. We have several squares for the DSB (depending on what they will play and the strategy, we'll decide.  bluenoser: 6.....Nbd7\nAppears to be our best move.  ",
        "6... Nbd7 7. Bb2": "ptitroque: 7. Bd6\nWe can play a further e5 to take control of the center.  a_random_guy: 7...Bd6\nSeems fine to me.\n\nAn acceptable alternative would be 7...Be7, to overprotect our f6 knight.  roneshet: How about Bc5?\nWhy not advance a little and position the bishop on a further diagonal?  a_random_guy: About 7...Bc5.\nThat move isn't actually horrible, it's just that white can push d4 at once and force us to move our bishop again, while they reinforce their center. That d4 push would partially block their dark-squared bishop though, so there's that. Also, I don't really see the bishop being usefull on the a7-g1 diagonal for the moment, since they can easily close that diagonal. 7.Bd6 could help prepare an e5 pawn push by black, eventually after castling.  bluenoser: Bd6\nOf the two moves suggested I like Bd6. Bc5 in my opinion just helps them push d4 and chase our bishop around. I guess so far we are in agreement to move that Bishop. I do believe Bd6 to be more solid for us.",
        "7... Bd6 8. d3": "bluenoser: Castle?\nWould now be a good time  a_random_guy: 8...0-0\nYeah, it would be a good time to castle!  ptitroque: 8.O-O\nWe've got to castle short so let's do it now",
        "8... O-O 9. Nbd2": "ptitroque: interresting position\n9... e5\nNot sure about it, it's getting complicated.  9th move\n...maybe it's worth a discussion, we shouldn't decide to quickly.\n(discussions are interresting in this kind of games, because it's how to learn...)  bluenoser: 9....e5\nI too was looking at this move...Like you I think it is worth some discussion could be a key move in the game. I was also looking at Qc7, then e5...but that might be too slow as they may push d4.  ptitroque: Qc7?\nseems ok but if they play a further Rc1, we might be in trouble.  roneshet: Qe7 - Why trouble?\nCan you explain a little bit, why are we going to be in trouble if the do Rc1?\nI think e5 is a very good move.\nI thought of h6 also. opening up for the king.  ptitroque: @roneshet\nIf\n1. ... Qc7 2. Rc1 Let's suppose 2... b6 (or anything else)\n3. cxd5 exd5 4. Nd4 * But you suggested Qe7 which is another matter. I'll have a look.  ptitroque: @ roneshed (about Qe7)\n9... Qe7 seems safe for me, but we'll be heading to a close game and be less active. It's more chances to end with a draw.\n\nNow, it's a question of general strategy.  a_random_guy: 9...Re8\nTo free f8 for our knight if needed, and to prepare the e5 pawn push.  ptitroque: 9...Re8\nI checked again to see if 9...e5 was possible and it's indeed dangerous to play it right now. With Re8, it'll be safer. ",
        "9... Re8 10. h3": "ptitroque: 10... Bf5\nWe have only 2 other options :\n10... Bh5 but I do not like this line because of 11.e4\n10... Bxf3 but we'll lose the bishop pair and get nothing in exchange.  roneshet: Bf5 of Bxf3\nI think Bf5 is better. Bxf3 will let him take out this locked bishop...let him stay there...  bluenoser: 10...Bf5\nI like this move Bf5, let them chase it if they want.  a_random_guy: 10...Bh5\nSeems fine to me, we can always push e5 if they do push e4.  ptitroque: 10.... Bh5\nI've had a closer look and it seems it works.  bluenoser: Try Again here\nWhat makes Bh5 better than better than Bf5? I am not disagreeing just wondering why we want to stay on that diagonal.  ptitroque: @bluenoser\na random guy probably has a better analyse than I do.\nThe only little advantage I can find in Bh5 is that it is on the diagonal of their queen. Obviously they will notice it but it may limitate their moving possibilities at some points.  a_random_guy: @ptiroque\nThe problem I see with 10...Bf5 is that they can basically play 11.Nh4 to trade off our bishop for their knight. If they want to push g5 to push our bishop to g3 before forcing a trade with 12.Nh4, they'd have weakened their kingside more in that variation then if we had played 10...Bf5.  ptitroque: @a random guy\nThanks, I didn't thought about Nh4  bluenoser: thanks for explaining\nI can see it now! \n ",
        "10... Bh5 11. Qc2": "roneshet: e5\nGet a better stand at the middle. next d4.  ptitroque: I hesitate\ne5 was indeed my first idea but we'll probably obtain a close game, for we'll have to push our d pawn if they play e4 and I do not like that kind of games.\n\nQc7 is another possibility, connecting our rooks  bluenoser: 11....e5\ne5 looks good to me, may give us a close game, but I believe we will have more space. ",
        "11... e5 12. a3": "ptitroque: Hmmm hmm\nIt seems that they plan to attack our queenside...\n\nI consider\n12... Qc7 : completing our developpement by joining our rooks and protecting our DSB in cas if they trade the central pawns.\n12... e4 seems also playable, more aggressive. They'll have to respond energically if they want to avoid 13... e3. which would put them in troubles.  a_random_guy: Another option\n12...a4, to slow down white's advance on the queenside.  ptitroque: @ a random guy\n12... a4 ? Do you mean 12... a6 or 12... a5\n\nWhat about if white answer 13. e4 ?\n\nI suppose that both could be played  a_random_guy: Oops\nI meant 12...a5, yeah.  roneshet: d4?\nTaking more controll over the center of the board ",
        "12... a5 13. e4": "ptitroque: I propose 13... dxe4\nto prevent their knight to come on g5  a_random_guy: 13...d4\nI don't really see Ng5 as a threat, as it doesn't attack anything and we can just push it back with h6.\n\nThat being said, I'd suggest locking the center with 13...d4 instead to make both of their bishops locked in.  bluenoser: 13...d4\n13...I like d4, I don't see the Ng5 as a big threat. Also gives us space advantage and their two bishops don't look very troublesome right now or in the near future.  roneshet: dxe4 explain\nplease explain a little more about the reasoning. why would it prevent their knight from coming to g5? h6 would do it?",
        "13... d4 14. Rab1": "roneshet: с5\na better stand in the middle.  a_random_guy: 14...Qe7\nc5 is probably fine, but I also like 14...Qe7, attacking the a pawn.  bluenoser: Qe7\nQe7 forces them protect their a pawn either by pushing it or moving the rook they've already moved. My bet would be they will push the a pawn.  ptitroque: Qe7\n...might lead to a less close game, personnaly, I prefer it.",
        "14... Qe7 15. Rba1": "ptitroque: 15... b5\nThe situation is blocked on the center. We could try to push on the right wing  bluenoser: 16...b5\nI don't see a better move than b5.",
        "15... b5 16. Nh4": "roneshet: Qe6\nIf they will not notice the trap, They will respond with Nf3.\nAnd than we can do Bxf3, the will respond with Bxf3 and we can do Qh3...  a_random_guy: Hmmm\nBoth 17.Nf5 and 17.f4 could be quite annoying for us. I'd suggest 16...Bg6 here.  ptitroque: 16... Bg6\nYes, we must have some control on f5 ",
        "16... Bg6 17. Nf5": "a_random_guy: 17...Bxf5\nProbably followed by 18.exf5 Rac8.  roneshet: Bxf5\nWell, this was our plan all along...  bluenoser: 17....Bxf5\nI don't see anything better! ",
        "17... Bxf5 18. exf5": "ptitroque: 18... Rac8\nprotecting the pawn - indirect menace on their Q  bluenoser: 18...Rac8\nRac8 also appears to be forced to me.",
        "18... Rac8 19. Rfe1": "ptitroque: 20... Be5\nWe are cramped.\n\nThe immediate threat is 20. Bxd4, for our e5 pawn is pinned.\nI do not see any counterthreat for us. I believe that we should play 20... Be5\n\nBut maybe I've overlooked something.  bluenoser: Be5?\nI don't believe our Bishop will go to e5 if my diagram is right. It could possibly go to c5  a_random_guy: 19...Qf8\nSure, 19...Qf8 looks ugly, but it does unpin our e pawn and it provides additionnal support to our c8 rook, if they decide to pile on the c file.",
        "19... Qf8 20. g4": "roneshet: h5\nTo open up this defense a little bit. if they answer with g5, we can do Nfh7  a_random_guy: 20...h6\nI don't like 20...h5 due to 20...h5 21.g5 Nh7 22.h4, locking us in even more. I think we need to stop g5 from happening, since white really wants to bring their knight onto e4. By playing h6, we stop that plan for now and still open up h7 for the knight.  ptitroque: 20...h6\nseems fine, indeed  bluenoser: 20....h6\nh6 looks good to me...it is the other game that is a tricky one at the moment. ",
        "20... h6 21. Re2": "roneshet: N7c5\nThreatening b3 and d3. In addition we put it in a very central position.  bluenoser: 21. b4?\nI was looking at b4 which would give us more space and everything is protected.  ptitroque:  I do not like b4\n2 possibilities ;\n\n21... b4\n22. axb4 axb4\n23. Ra6 and we are in trouble.\n\n21... b4\n22. axb4 Bxb4 and we have an isolated pawn on the a file, which will be hard to defend.  bluenoser: 21,b4\nOn 22. axb4 Bx4 was my intent, I don't see why it will be hard to defend as we have a pin on rook as the knight is on the same diagonal. You of course have the higher rating so I could be missing things moves down the road.",
        "21... Nc5": "I generally don't post when, but I put down that this was Ron's suggestion.  The logic behind this is one person voted for 21...b4, and the other disagrees.  But, Ron voted for this move independently of everyonelse based on what he thought was best.  And, I can relate to that, for the wrong reason, as well.  As this is how I thought during, I hate to say it, but the kibitzing moment in GM Judit Polgar's puzzle with the terrible headache.  That was, based on, what I thought the best move would be, independently of everyonelse.  Plus we starting to run into danger of losing the game on time here, as we had about 2 days left.  And, that was, during a day off from work..",
        "22. b4": "bluenoser: 22....axb4\n22...axb4...if 23. ax b4....Nh5.  roneshet: Axb4\nWe knew they'd do that move...  ptitroque: 22... axb4\nWe are in trouble. I'm not sure it holds.  bluenoser: We could be in trouble\nI think you care correct Ptitgorque. We should have seen this sereral moves back, or I should say our higher rated players should have seen it coming....I for one didn't.",
        "22... axb4 23. axb4": "ptitroque: 23... Nd7\nWe need to defend our e5 pawn - vital for our defense.\n\nIf they play Ra e1 and a further Nf3, we need at least 3 pieces to defend e5 and 2 of them have to be knights or bishops (since we have no pawn available to defend it).  roneshet: Na4\nWell Nd7 is also a good move, adding protection to the e5 pawn, and defending the other Knight.\nBut i think the danger from the rock on the A column is more imidiate...  bluenoser: 23...Na5\nI believe this was our original plan.  a_random_guy: 23...Na4\nThis blocks the a file, preventing their rook from landing on a6 and pressuring our c6 pawn. In a pinch, we could trade our a4 night for their b2 bishop, to reduce pressure on our central pawns. I don't think trading the rook for our knight is worth it for white for now, if they want to play Rxa4, though I could be wrong.\n\n(I fixed some typos from my previous post)\n",
        "23... Na4 24. c5": "roneshet: Bb1\nWe can't put our B on c2 or e2, because it will lead to losing one of our pawns...\nBb1, as far as I can tell, is the only viable move.  ptitroque: Bb1\nYes, I see no other solution",
        "24... Bb8 25. Rae1": "ptitroque: I suggest NxB2\nOur knight is poorly placed and stuck. Their DSB is on a fine diagonal (it could take our d4 pawn it e5 dies, which is probable soon, for they will play Kf3 and we cannot prevent it). I admit that it doesn't solve the problem of our e5 pawn.\n\nMaybe someone has something better to propose...  roneshet: Nxb2 or Nd5\nI agree, but we shpuld consider, after or before, this line of defence on the e4 pawn.\nNd5 Bxd5\ncxd5 Nf3\nf6 ... ptitroque: Nd5\nIs an option that I din't consider seriously but it's worth to analyse it.  thewrongreason: So, ptitroque mentioned about what we ought to consider which was with Ron. I can wait a little, but by tomorrow evening, at the very latest, I'd have to make the move. As we're down to a little more then 2 days left to make the move.  bluenoser: Nd5\nNd5 looks good to me. they can't do much with their B on b2 I think we are helping oursevles more by playing the Nd5. ",
        "25... Nd5 26. Bxd5": "ptitroque: 26... cxd5\nwhat else ?  roneshet: only move\nCxd5 is the only move",
        "26... cxd5 27. Ba1": "ptitroque: 27... Qe7\nThey'll probably attack our unpritected d5 pawn, so that our queen can come and defend it on d7.\n\nIf they chose to move their knight on b3, we can menace their king side by Qh4. Our queen has to be mobile.  roneshet: agreed\nQe7, looks like a good option. I like the Qh4 option...  a_random_guy: 27...f7\n27...Qe7 allows them to play 28.Bxd4, as our e5 pawn would be pinned.\n27...f7 would help to protect our e5 pawn, and prepare Qf7 (protecting our d5 pawn while keeping an eye on e8) and Kf8. geting out of the g8-a2 diagonal, and protecting e8 once more.  ptitroque: 27 th move\na random guy is of course right.\nQe7 doesn't work.\n\n27. f7 is ok. They have no more LSB to menace our king on the a2-g7 diagonal.",
        "27... f6 28. Nf3": "roneshet: Qf7\nI say, Qf7 following by h5, will open their king side...\n\nHow are you all doing with the corona madness?  ptitroque: 28...Qf7\nseems ok\n\nprotecting our d5 pawn and giving mobility to our queen  bluenoser: Qf7\nQf7 looks good to me too.",
        "28... Qf7 29. Nh4": "ptitroque: 29... Qc7 ?!\nGives us a strong menace : they cannot prevent us to play e4 and we have a mating menace.\nIf they play f3, we can play Qg3+ and their knight gets it.\n\nPlease gentlement check carefully, for it's edge to edge situation  bluenoser: Qc7?\nI was thinking Qc7 with thoughts of pushing our e5p to e4. with the threath of Qh2. Just taking a quick look at this so far.  ptitroque: 29... Qc7 !?\nThe more I think about it, the better it seems. We might get an overwhelming attack  roneshet: problems...\nif they move their knight to g6 after we do Qc7, we cam be in a great deal of trouble.\n29. ... Qc7\n30. Ng6 e4\n\nThan what will we do? say they do f3...\n31. f3 Qg3+\n32. Kf1\n\n\nWe should not open our e column... It's dangerous!!!  ptitroque: @ roneshed\n29... Qc7\n30. Ng6 e4\n31. f3 Qg3\n32. Rd2 (forced) Qe1 chessmate\n",
        "29... Qc7 30. f4": "bluenoser: f4 was unexpected.\nWe were all thinking f3 for some reason.....Going to have to look this one over really good now.  roneshet: e4\nI still think e4 is a good move.  bluenoser: e4?\nI've been wondering if that is still the best follow up move?  a_random_guy: I don't like 30...e4. 30...Qc6 maybe?\nThey can play 31.Ng6, covering their f4 pawn and leaving our d4 pawn defenseless.\n\nI think this position is bad for us, and is actually quite complicated; They might want to pile on everything they have onto e5.\n\nThat being said, I'm unsure what the best move would be: Here are all the moves I could see being played:\n\nKf7, Qc6, Nb6, Nc3\n\nPersonally, I prefer 30...Qc6: We still threaten to take on f4, and it unpins our e5 pawn as e8 now has enough protection for now. It also protects our d5 pawn as well, as it could get targeted by their queen in some lines.  bluenoser: Qc6\nQc6 does look like a solid move for sure.  roneshet: Qc6\nI really learned from your explanation, thanks.\nQc6, leads to minimum losses at the moment...  ptitroque: 30... Qc6\nseems good, indeed ",
        "30... Qc6 31. Ng6": "a_random_guy: 31...Nc3\nI think we can't quite play 31...exf4 sue to 32.Bxd4, locking our knight to a4 forever. By playing Nc3, we more or less force them to exchange their bishop for our useless knight.\n\nSample line:\n\n1. ... Nc3\n2. Bxc3 dxc3\n3. fxe5 Bxe5\n4. Nxe5 Rxe5\n5. Rxe5 fxe5\n6. Rxe5 Re8\n7. Rxe8+ Qxe8\n8. Qxc3 Qe3+ *\nLikely a draw?  roneshet: sounds good Nc3\nAlso will open the way for d5 to move to d4, thus opening the way for the queen.  bluenoser: Nc3 looks good\nNc3 looks good to me, maybe our only good move. The sequence after could change along the way. I know you are looking at what you consider best moves on each side. They may do something different which might even give us winning chances.",
        "31... Nc3 32. Bxc3": "bluenoser: 32.....dXc3\ndxc3 is our only move as predicted by a_random_guy.  a_random_guy: 32...dxc3\nNot much else to say here. The question is whether they'll play 33.Qxc3 or 33.fxe5 (probably the latter).",
        "32... dxc3 33. Qxc3": "ptitroque: 33... d4\nif 34.Qb3 (probable), then 34... Kh7  bluenoser: 33...d4\nd4 looks good to me. I know I can't look as deep into the game as ptitroque can.  a_random_guy:  I dislike 33...d4. I'd suggest 33...e4 instead\nThey can play 34.Qb3+, and it would give them the time to take on e5 safely, leaving us 2 pawns down like in this line:\n\n1. ... d4\n2. Qb3+ Kh7\n3. fxe5 fxe5\n4. Nxe5 Bxe5\n5. Rxe5 Rxe5\n6. Rxe5 *\n\nI also just realized we can't play play 33.exf4 either, due to Ne7+.\nI think we've already lost this game, but 33...e4 seems like our best bet to keep us into the game, not opening the e file yet and stopping a series of disavantageous trades on e5.  roneshet: Qc7\nThat being said, and i think well said. we can add a little bit more defense on the e5 square, while also preventing the option of Ne7+, which will be devastating.  bluenoser: 33....e4\nYes of course e4 not d4....That is the move I was looking at too. but did say d4 which was not correct.",
        "33... e4": "roneshet: Qc7 no one has responded..\nThough we already made the move, I'd like to hear you opinion on QC7. If it's possible.\nThanks!  ptitroque: @roneshed about Qc7\nI believe it would have been a bad move for 2 reasons\n\n1. Offensive reason\nWe cannot take the f4 pawn which is protected by the g knight and we have no chance to capture or force the g knight to move.\n\n2. Defensive reason\nIt would enable white to play dxe4 without trouble : 33. dxe4 dxe4 34. Rxe4 Rxe4 35. Rxe4 and white has control on the open file with plenty of attacking possibilities.",
        "34. Qd4": "a_random_guy: 34...Kf7\nI don't think we can prevent the loss of another pawn; The best we can do is activate our pieces, avoid trading our pieces and trade some pawns.",
        "34... Kf7 35. dxe4": "roneshet: qa6?\ngo around to threaten h3, g3  a_random_guy: Resign\nI can't think of a good move here, I'm pretty sure we've already lost at this point. Sorry!  bluenoser: Resign\nI believe I agree here. I can' see them making any major mistakes. Perhaps it will be another learning experience for everyone.  thewrongreason: We have resigned here. I'll be annotating this game later this week.  For those that are wondering, my resignation was GG."
    },
    "url": "https://gameknot.com/annotation.pl/teacher-learners-v-knights-templar-consultation-game-2?gm=67838",
    "gameName": "Teacher/Learners V. Knights Templar Consultation Game 2",
    "players": "apatzer (2099) vs. thewrongreason (1319)",
    "opening": "English, 1...Nf6 (Anglo-Indian defense) (A15)"
}