{
    "moves": {
        "1. d4": "Standard.",
        "1... d5": "Whenever my opponent plays QP, this is my response, as I'm ready, in case he played the QG or something similar.",
        "2. Nc3": "?! This is a perfect example.  It's I believe the QID.  Now, there was more game chat then what shows, but that's because most of it got deleted, as the game lasted over 2 months.  With what got deleted, I forgot what he said, but remembered what I said.  So, I'm not sure but seem to remember telling him that this is a slight inaccuracy because in QP games, like this, the one should not bring the C N to c3  Instead, better was 2.Nd7 developing the N, but on a square where the c pawn is not blocked.  ",
        "2... Nf6": "Not to protect, but rather, develop the right N and prepare to castle.",
        "3. h4": "?! I have no idea why he played this, but I told gus that this is an inaccuracy because it doesn't develop or help control the center.  Better, was to develop his other N or DSB.",
        "3... e6": "Not only developing and opening a central.  But, the idea was also adding protection to f7.  In addition, after seeing comments in another annotation, I realize that I could allow my N to be pinned, as I anticipated 4.Bg5  That, however, wasn't needed, but as I recently learned from GM Susan Polgar, which happened almost at the end of the game, one of the main things you want to think about in the opening is a pawn chain.",
        "4. Bg5 Bb4": "The idea is that, by allowing that, I was going to pin his N.  This one would be nastier because he hasn't developed or opened a space for his LSB.  In other words, I am better developed, which will make it very difficult to break this pin.  Doing so means that he will have to advance his wing pawn, when the time should be used to develop another piece.",
        "5. a3": "I think I said something like I know why you played this.  I understand that you wanted to break the pin, but more common was to retreat the DSB.  That's because, by playing this, I will take, and in order to prevent the loss of a piece, he must take back.  And, when Gus does this, he will wind up with doubled pawns.  Since I'm not behind, and he does not have a passed pawn, doubled pawns are known to be bad as this will weaken his position.  Of course, I keep in mind what I've been taught which is that the whole idea is thinking about how to improve your position, which I am.\n",
        "5... Bxc3+ 6. bxc3 Nbd7": "Not only developing, but seeing how strong my position is, I improve it a little more with this.  I also could've castled, but now instead of say 7.Bxf3, Qxf3, I have an extra defender.  This way, if he takes, my weak N will become even stronger then my N f6.  In addition, Jack has accurately said that stronger players don't mind having one N out, but having the other near it's homesquare.  In fact, he annotated a game like that, and the stronger player, believe it or not, benefitted from that.  So, I kept that in mind and realized that this setup would benefit.  In addition, my LSB is in no rush to come out.  The is that stronger players can make slight deviations from normal openings, whereas the trainer should follow the guidelines.  What I just said is a lesson I learned from the easy19. ",
        "7. e3": "This does develop, but nontheless, as I'm slightly ahead, I will now take that opportunity to castle.",
        "7... O-O 8. f4": "?! I told Gus that I understood why he played this.  White wanted to advance and was worried about the f pawn.  But, I said that the pawn was not in danger, and there were other things to be worried.  With that, I gave it as an inaccuracy.  By doing this, his DSB isn't just jammed, but also trapped, as it blocks off white's only retreat square for that B.  Normally, it doesn't make a difference, except that his B is worth more then my N on f6, and I do go by what Dan Heisman says about B pair.  Therefore, not only do I win an exchange, but my N on d7, as noted, will become even stronger then one on e6, once we exchange.  So, although point value is down to 0, it goes from slight to me having a, noticeable advantage, at this point. ",
        "8... h6 9. Bxf6 Nxf6 10. Qe2": "The thing is that this move doesn't develop as the Q is out sooner then other pieces.  And, since he's training, it's not a good idea to deviate, as noted, unless you must.  But, this is not one of those times.  Better was to develop his N or LSB and prepare to castle.  However, I wasn't going to fault him for this move because he is still going to castle, which is a good idea to do.  Come to think of it, I really should've, though, since castling is going to be a blunder.  Yet, I decided to emphasize the most important because, as I've learned from ION, sometimes, too much coaching can also be problematic and can cause the student to make a mistake which you don't want.  So, it's about finding the happy medium, and knowing when to and not to give to do it.",
        "10... Ne4": "But, I knew the plan, and played, as now it is no longer safe to castle.  Instead, there is a much bigger to look at.",
        "11. O-O-O Ng3": "I told Gus that I understood why he castled, as it's generally a good idea.  But, 11.0-0-0?? was a blunder because of this three way fork.  Instead, better was 11.Qf3, better was 11.Rh3, and that way everything is safe as it would no longer be possible for me to come on to g3.  One of the main ideas, as Jack taught me was that you can't let the N advance too far because when it does, they can become quite dangerous.  So, you can't let it come that far.  In addition, while Rh3 and Qh3 do not develop, there are exceptions to the guidelines and one must deviate if there's an immeidiate threat, loss of material, mate, etc.  For that, I remembered something that is very important to teach and that's what I told him, \"Consider all threats made by your opponent, checks, and captures.\"   The other idea, which I didn't mention as I'd be teaching too much, is that this is also why 8.f4 was an inaccuracy for if he hadn't played that, there's a good chance that my N would be stuck on d7 and f6.",
        "12. Qf3 Nxh1 13. g3": "! Of course, I overlooked this, so the R isn't free.  But, white still loses a R for N.  Therefore, it's a similar position to the first game against ION.  Unlike there, however, I remembered it here and was not going to overlook something like that.  The idea, as kenneth_fiore said is that, when teaching, you must be cruel and not show lienence.  That's how you learn.  However, since he is going to win my N in exchange, regardless of what black does, I will take on g3.  By doing this, I win an extra pawn, in the process for the reason outlined.",
        "13... Nxg3 14. Qxg3 c6": "Normally, I wouldn't play this, as it appears pointless.  But, there is a point, and the idea here is that I see a weakness.  So, the idea is trying to take advantage of your opponents weaknesses.  In this case, being able to do so means that I start figuring out a way to expose his K and win a pawn.  The idea is forming a plan, and as I learned from Susan in strategy, while things can get in the way, the idea is to form a plan.  And, the way to plan accurately is by thinking about forcing moves, which I'm doing.",
        "15. Nf3": "? Developing another piece.  But, I told Gus that this is another mistake because of my next move.  Best was 15.Ne2  This time, however, it would be crammed because there are no outposts, in the long term.  Also, I remember this position from past games against the person who I've moved on from.  However, it's better then what's about to unfold because it means that white is going to lose a pawn, once I get my Q to a5  Afterall, we talked about something like this a long time ago, with the first person I coached.  Now, tactics were mentioned, that I could've won a pawn.  What I was planning then would've worked as it wins a pawn.  Now, had he played 15.Ne2, I still would've played 15...Qa5, but it would not have lost a pawn.  Well, I kept that in mind and am not going to miss that opportunity because the idea, as noted, is being teaching chess, so you have to make things very difficult.",
        "15... Qa5 16. Nd2": "? Fixing the placement of his N.  But, this is another mistake.  Either way, white was going to lose a pawn, but best was 16.a4  That's because I was planning to take on c3, of course, anticipating that he'd advance his a pawn.  But, with this move, I'll take first which is going to win two pawns.",
        "16... Qxa3+ 17. Kb1 Qxc3 18. Nf3": "? I said, I know why you played this, as you were worried about the N. However, it is important to look at the entire board. And, in this position, the N was not in danger because of the R. So, if I had played ...Qxd2??, you could win the Q, in return with Rxd2 But, this move, however, loses another pawn. In this case, almost any move was better then this.  What I allude to by seeing the entire is what the master mater would say which is, being a spectator of your game.\n",
        "18... Qxe3 19. Rd3": "Very understandable.  And, I like his attempt in counterplay.",
        "19... Qe4": "At first, I thought that my Q was trapped, but this was the only way out.",
        "20. Ne5": "His plan was to play 21.Bg2, and get my Q.",
        "20... Qh1": "But, I don't allow it, and thus, decide to pin his B.  Now, I have studied similar positions, and pins like this are often quite nasty.",
        "21. Rd1": "Of course, white gets out, and I say that except for some mistakes and blunders, he's playing quite well and respectively north of his rating.",
        "21... b6": "Seeing that, now I continue my development.  Since I have a bad bishop, the goal is to get rid of it.  So, I start with a fianchetto.",
        "22. Be2": "Developing my his B and going after my Q.",
        "22... Qe4": "The only safe spot.  This isn't the reason, but I did keep something in mind.  In those GM games that I've analyzed, whenever they're in a situation like this, the opponent gets out by reattacking, as I did here.",
        "23. Bf3": "Not surprised.",
        "23... Qf5": "I also considered 23...Qe3, but the reason behind this was to keep his c pawn pinned.",
        "24. Bg4": "But, I like white's fighting spirit.  First, he keeps in mind that if I go wrong, he can win my Q.  However, after my blunder with superandy, I won't make that same mistake here, as it's not as good for learning purposes.  More importantly, however, is the fact that white does not resign, which makes me happier.  The idea is, \"Fight Til the End\".  In addition, this gives him back a pawn, for now.",
        "24... Qf6": "Indirectly forced.",
        "25. Nxc6 Bb7": "However, I will not allow him to pull a swindle, which is, I'm sure, what he wants.  The idea, is as therealjimfrior put it, you don't give your student second chances.  Instead, they have to win on their own merits.",
        "26. Ne5 Qe7": "This is the start to an aggressive plan.  That is, the idea of winning a pawn by checking on b4.  Of course, I'm also aware that other things can cross in between those plans.  The main thing is the forcing moves, as that's what it takes to think like a GM.  But, even at non grandmaster, it's important to do at all levels, according to what Susan told me.  So, I'm maintaining what she said for this game since things become second very quickly, when I learn from her.",
        "27. f5": "He wants me to take on f5, with the idea that after 27...exf5, 28.Bxf5, g6 29.Nxg6, fxg6 30.Qxg6+, Kh8 31.Qxh6+, Kg8 32.Bh7+, Kh8 33.Rg1, Ba6 34.Bf5+, Qh7, after which, the tables would've turned, as now, in order to prevent mate, I'd have to lose my Q, and my K would be even more exposed, which would've given him a winning advantage.  ",
        "27... Rfc8": "What I didn't realize, however, was that after 27...exf5 I can immeidately respond with the plan of 28.Qb4+  Although it doesn't seem that good, white's K is worse exposed, so I think that best was to take.  However, I do have a long term plan, in this position.  The goal is to be able to attack c2, with my Q and c R, which is why I played.  Doing that would allow me to win the pawn, and just about the game quickly.  But, being able to execute this is a lot more difficult then this sounds.  And, that's also what I allude to by things getting in the way of your plan, as I recently learned.  Still it's good to think about things like this.",
        "28. fxe6": "So, he takes first.",
        "28... Qb4+": "Instead of taking back with 28...fxe6, I play this, as now, white is in worse trouble then he might think, which was the plan since my 14th move, which is was the idea behind 14...c6  What does that mean.  It's something that I've been trying to improve on for years due to graphomotor difficulties.  Graphomotor difficulties is a weakness that makes it difficult to read graphs, which is why College Algebra with Trigonometry and Precalculus were killers.  Those same things also produced a weakness in chess since it's about reading graphs, like algebraic tansformations, which is what I was thinking about when it came to chess.  But, I found that you don't have to struggle that much to find answers.  Instead, if you think about how things get in the way, but have a plan around that, you can think ahead without miscalculations, which was my goal.  In fact, the reason I thought I was improving where I was wrong is that a certain someone was able to think ahead without miscalulating, which was always my weakness.  I was surprised then that GM's could think over that far in advance.  He told me he could and calculated some moves, but I still didn't know how to apply that method.  Although he's a bygone, I don't completely forget about his teaching method because applying some of it suits my learning style.  But, I thought I was improving and what I was promised came from Susan, since the real answer is what I just noted, about things getting in the way, but still being able to form the plan.  The idea is that, you just need to think about forcing moves.  In fact, that's the secret with many GM's because the idea is that, she tells you things that they aren't telling you.  That's part of what I saw, when I signed up for the course, and it's one of the main things that inspired me to take it.",
        "29. Kc1": "Best.  29.Ka1??, would have lost a pawn and the Q for R because of 29...Qa4+ 30.Kb1, Qxc2 31.Ka1, Rc3, by which white must take the Q because anything else would result in immeidate mate.  For example, if 32.Qf4, 32...Ra3#  In addition, 29.Ka2 would lose even quicker as black would have an automatic mate in 2.  29...Rxc2+ 30.Ka1, Qb2#",
        "29... f6": "Now, that he found the best move, instead of taking, I advance forward.  This is because, it doesn't just attack the N, but I'm playing a move that I've seen from GM's, as noted earlier.  Unfortunately, this is where one can make mistake by overanalyzing those variations.  Do you remember that game with Mariann?  Well, I could've won sooner, but I overanalyzed the double B and N+B mate.  By doing so, I missed opportunities that I wouldn't have missed.  And, I went wrong, in my game against Joann.  I played quite well, except that from my favorite annotator, GM Davorin, there was a game, I believe it was between Carlson and Topalov.  Where after seeing that an important pawn was directly pinned, he added another attacker, and it worked.  But, that was since he the opponent wasn't as well developed.  But, in my last game against jstevens1, it wasn't like that, so when I added an attacker, her K was able to move.  And, in the process, I wound up getting stuck in a fork.  Things went downhill quickly after that, and I wound up losing.  So, the idea is analyze and play through, but try not to overanalyze.  That's the painful lesson I had to learn.",
        "30. e7": "With that being said, white find a good move, and tries to Q.  I thought for a moment that I was in real trouble, as I'd lose a R to stop this.  But, that isn't so.  I have double R's, so if white dares to play 31.d8=Q+, I will stop it right in it's tracks.",
        "30... Rc3": "Now, if his Q weren't there, I would play 30...Qc3, and get the pawn.  But, it's not possible, so the idea is hitting it with the gain of tempo to enable to do some more damage.  The plan is getting off that square.",
        "31. Nd3": "Not surprised that he played this.  In fact, this is what I anticipated, but the result will, nontheless, be the same.  That's because I thought the check was dangerous.  As it turns out, it's a nuicanse, but it does, however, expose his K a little worse.  But, as we know, one can still last longer then you might think with an exposed K.",
        "31... Qa3+ 32. Kd2": "More or less, forced.  Actually, I said, I looked at this move and studied, but this is a blunder. Best was, 32.Kb1  And, he said, \"yes your right :{\"  The reason is that, black will be able to get which will, at the very least lose a N.  However, there is something that I missed there.  What I figure out, a move later is that, white doesn't have to lose his N.  Instead, there's a different variation that would protect it, but he'd still a lose a pawn.  So, edited this comment a move later.  ",
        "32... Qa5 33. Qc7": "What I missed, until now, was that white could've played 33.Nf2.  And, now even if, let's suppose 33...Rc4+, which is what I would've played, he would still lose a pawn, after 34.Rxd4, but the N is still safe.  However, this is a serious blunder, that will lose very quickly.  So, I edited my previous comment, and combined it with this blunder by saying, Edit: Not a blunder, but rather a mistake. The reason why 32.Kd2? was a mistake is that you would've, had to lose a pawn, at the least. There were other moves, which now lose a piece or wind up in mate as I looked at different lines. But, this move, however With that being said, this move is a blunder as it loses the Q. The danger was the discover check. So, best was 33.Ke3 Sure, I would take with 33...Rxc2, but then even after 34...Ba6, all you've lost was another pawn as the N can get out. But, with this move, you lose much more then just that.  What I'm alluding to by a lot more is the Q.  In fact, after that, white will be left with no good moves left, which is where the game chat ends.",
        "33... Rxc7+ 34. c3": "Now, one would think that 34.Ke3 was better, but I would've pinned his N with 34...Qa3, followed by 35...Rc3 which would've won the N, and there would've been no way out.  So, as noted, there are no good moves left.",
        "34... Qxc3+ 35. Ke2 Rxe7+": "Taking advantage of his weaknesses.  And, no matter where he goes, I will win that N.",
        "36. Kf3 Qxd4 37. Kg3 Re3+": "No matter where he went, this is what I would've played.  That's because I'm trying now to centralize his K, until it's confined to one square, where I would mate.  But, this time, I don't need my K to do so.  This shows the importace of protecting material.",
        "38. Bf3 Rxd3": "Even if he ran back with his K, this is the move I would've still played, knowing that it wins another piece because if now 39.Rxd3, 39...Qxd3",
        "39. Kg2": "To unpin the B.",
        "39... Qb2+": "But, no matter this is what I was going to play, one way or another, to centralize his K.",
        "40. Kg3": "Indirectly forced because, if white moved back to the first rank, I'd immediately liquidate with 41...Rxd1+ when ahead.",
        "40... Rxf3+": "So, I give him my R, for his B.  But, this is a combination I learned about, where you give up something worth more for a more dangerous attack.  ",
        "41. Kxf3": "Instead of taking, however, had he moved back with 41.Kg4 (which was the only other move), I'd still mate very quickly.  41...Qg2+ 42.Kh5, Rf5#  However, black is still going mate very soon.  What does this mean?  What it boils down is that mate was inevitable, no matter how you dossed dice, so white might as well have taken my R, regardless.  That's from an expression that Jack introduced me to.  It was the first game that I won against him.  He was in a similar situation, and would've been mated in one.  So, he took, and said, \"I might as well because I have nothing better.\"  Of course, I kept that in mind, and now calculate that mate.",
        "41... d4+": "So, without further adue, it starts right here.  But, how I figured this out was calculating lines, but in the calculation, I took note that this is a discovered check which white cannot get out of.",
        "42. Kf4": "Now to start calculating all lines, which I did some in the game, as this is how I improve.  But, as homework, I'm doing the rest.  Let's say he played 42.Kg4, as opposed to, this.  I would've responded with 42...Qg2+, and if 43.Kh5, I'd mate with 43...Bf3#  If instead of 43.Kh5, he played 43.Kf5, I'd mate almost as quickly.  43...Bc8+, 44.Kf4 (forced), Qg4#  And, if 42.Kg3, 42...Qg2+ 43.Kf4 (forced), Qf3#  So, either way you look at it, mate is inevitable.",
        "42... Qf2+ 43. Kg4 Qf3#": "Overall, white played north of his rating.  But, the morals are that in Queen Pawn Opening, it is generally not a good idea to play Nc3, or ...Nc6 early because the idea is taht those c pawns are important.  Also develop your pieces and control the center.  For example, white played 3.h4?!, when he could used the time to develop with 3.Nf3, or he could've brought his DSB into play early.  That way, I wouldn't have an advantage, as early.  Instead, developed earlier, and one step closer to controlling the center.  By playing that, he didn't just fall behind in development, where I could gain even more tempo to develop, but I got the head lead in center control which helped maintain an advantage.  But, the main moral is to pay attention to all threats.  Sometimes, that even means giving up or delaying K safety to do this.  For example, instead of castling, white needed to protect his pieces.  By castling, he lost material.  And, there were other examples that led to an overwhelming advantage for black, until I was able to force mate.  So, the idea is development and being aware of threats made by your opponent.  @vesper2: If you can remember this, I'm sure that your rating will climb to 1100, before you know it.  "
    },
    "url": "https://gameknot.com/annotation.pl/teachers-and-learners-coaching-game?gm=59480",
    "gameName": "Teachers and Learners Coaching Game",
    "players": "vesper2 (935) vs. jkarp (1268)",
    "opening": "Blackmar-Diemer gambit (D00)"
}