{
    "moves": {
        "1. e4": "So, I stick to my normal opening.",
        "1... c5": "And, Mikko answers with the Siclian Defense.  So, I'm gonna continue with my usual.",
        "2. Nf3 Nc6": "But, now we're out of familiar territory.  So, I play something that makes me feel comfortable.  Do you remember the Spanish Opening?  Well, I asked myself the same question that ION asked a while back in my annotations.  Will there be any complications with my position, if this is played.  Once I discovered that it doesn't.  Therefore, my response is the same with 3.Bb5 which ironically, is the same time this is played in the Ruy Lopez.",
        "3. Bb5 Nf6": "Meanwhile, Mikko continues with his development.",
        "4. Nc3": "As do I.",
        "4... d5": "Even though white hasn't made any mistakes or inaccuracies, the training starts here since he asked me a question.  And, the irony is that it's as familiar as it should be due to my first training game with Ken.  That's right, I'm using what he taught me to teach Mikko chess.  flatus77: I like to reduce the number of pieces. That way its easier to understand what is going on.  jkarp:  I know what you mean by that. I used to think this way. In this case, the idea is exchanging pieces. And, I would always exchange just because it was possible. But, there are situations where you don't want to do that. As sometimes, you need those pieces later on for the endgame. So, as a general rule, don't exchange just because you can.",
        "5. exd5": "Now, I had a hard time deciding between this move and 5.e5.  But, I didn't want to allow 5...Ng4.  That's because were I to allow it, I'd have a very difficult time trying to figure and even struggle to defend the center pawn.  Yes, I'd find a way, but I wouldn't like white's position as well.  With that, this a time where I must exchange pawns because if I just let him take, flatus77 would just get a free time which I cannot allow, for learning purposes. ",
        "5... Nxd5": "flatus77: Well, I mostly exchange because I dont know what opponent is trying and when I get the feeling that there is something going on and I dont know what, I try exchance.  jkarp: Yes, that is when exchanging works. But, it's always good to ask yourself when and where to do it. I actually have a different training game. In this case, I got trained but the first lesson was about knowing when exchanges works.  For those that are wondering, that lesson I'm talking about is with Kenneth_fiore_3 during our first training session.  And, I showed him that game.",
        "6. Ne2": "With that, you'll be shocked to find out that I came close to exchanging N's.  But, I asked myself the very same thing, on what I can get.  And, can I use that N later on.  What helped me to figure out the answer was TA's lecture on the N visualization count.  As there is mobility, and my Ne2, which is cramped for the moment, can move around, at a later time.  With that, the idea is also the same as what happened with Ken.  I want to make things a little more complicated for this student since he wanted to exchange.  So, the idea was taking him out of his comfort zone by refusing to give in, as Ken did with me.  One reason is because of what's about to occur.",
        "6... g6": "I'm not surprised to see this played.  We all like fianchettos.  Mikko is going for a long flank to castle.",
        "7. Ne5": "But, just like with the training game, as mentioned earlier, this is where I complicate the position by adding pressure.  In part, it's due to his Nc6 being pinned, as now, it is attacked twice but only defended once.",
        "7... f6": "jkarp: ?? This is your first blunder, Mikko. The reason I played 7.Ne5 is because your Nc6 is pinned. So, by playing it, this was attacked twice and defended once. Thus, the danger was overlooked. So, in the process, white is going to win material. Best was to break the pin with 7...Bd7 As a word of advice, this is where taking your time does become important as there are dangers like this which need special attention to.",
        "8. Nxc6": "flatus77: Good point. I was too busy developing my pieces. And I didnt even had clear idea how, I was just trying to get material going and then find a plot.  jkarp: The thing to note is that 7...f6 didn't develop. But, the move that would've prevented the loss of material which also breaks the pin would've. I think the focus was kicking my Knight. But, when there is a threat, attacking, like that, doesn't work. The idea is thinking about what you're opponent is threatening to do and respond before making the move. ",
        "8... bxc6": "flatus77: Thinking positively, my pieces are in better position than yours.  jkarp: That's true. But, losing material makes things difficult, especially early in the game.  flatus77: True. Not ideal position.",
        "9. Bxc6+ Bd7 10. Bxd5": "It's also worth noting that 10.Bxa8 came into consideration as this wins a Rook for a piece.  And, yes, we're talking about a major pieces, as opposed to, a minor one.  But, this was played because even though it's a minor, the N appears more mobile then the Rook.  And, in doing this, white gets a pawn and piece, without compensation.  That is something that I remember from my first loss against easy19, as he took my N instead of the Rook.  It boiled down to the same thing.  Which is that if he took the Rook, I'd get the B, in return, but by capturing the N, it was a free piece.  And, my Rook was not as mobile, either.",
        "10... Rb8": "Preventing further loss of material for now.",
        "11. Nf4": "But, I bring my N to a stronger outpost.  Unlike what was noted, I'm now seeing what can be done to force an exchange because when you're ahead, you want to liquidate.",
        "11... Qb6": "After what I noted about not wanting to exchange, Mikko played this to prevent that.",
        "12. Qe2": "Believe it or not, castling came into consideration as it did here.  But, after 6 years, what I'm finally thinking about is when and where it's safe to castle, as presented in the KOH club.  Now, shamash posted a game where Karpov wins by not castling.  And, Janet noted what might have happened if he had done it.  The reason I find that important is because Karpov also had a lot of patience, as otherwise, he might have castled which could have ended differently.  With that being said and remembering the patience, this was played in a different attempt to liquidate.  As now, if I am to play Ne4, and he takes, it's safe for me to take back.  That's because with this move, he can't then recapture without losing his Queen.  Then, I reanalyzed and realized that there is a flaw.  For some reason, I had Ghost Vision and thought that his Bd7 was pinned, but it isn't.  Therefore, I don't bring the N to e6, as I know that he'll decline.  With that being said, there would not have been anything wrong with castling, but it's always good to explore different options.",
        "12... Bh6": "Meanwhile, Mikko attacks my Nf4.",
        "13. d4": "So, I protect.  But, 13.Nd3 also came into consideration.  The reason for playing this is that my Queen remains in play.  More importantly, however, is that it continues my development since this is a central pawn which, therefore, opens a nice diagonal for my Bc1.",
        "13... Qb4+": "flatus77: Im trying to analyse this position we're having and more I look it more I like it. Thats what happens me often. I see something that I may be able to do and miss something. Then opponent makes unpredictable move and I lost my touch to the game.",
        "14. c3": "jkarp: Yes, that's been a common problem for me, as well. I'd say that the more comfortable you feel, ask yourself if there's anything your missing. For example, that happened in my last game with kenneth_fiore_3. After having had lost a piece, he asked me how I felt about the position. So, I said that I was more comfortable, but after a while, I realized that it didn't improve as he liquidated which led to my resignation.",
        "14... Qb6 15. O-O": "This is where I castle.  But, it's not about K safety, as you might have thought.  Instead, I'm analyzing a variation which is going to pose as a nasty threat against Mikko, as we're about to see.",
        "15... g5": "flatus77: I just noticed that my last move was blunder.  And, a huge one.  jkarp: It's not as bad as you might think, though. I know why you think that because Qh5+ is possible, whereas, it wasn't before. But, I can hold off on that. The one thing is that with being down in material, one move wasn't much better worse then the other.",
        "16. Re1": "?? That's because I have the nasty threat which I noted when castling.  However, the information as God emphasized in my sleep last night.  It turns out that this was a definitely.  My strategy is giving him the N because of the threat.  However, I got training.  So, this was the exact position in my dream.  ",
        "16... gxf4": "As I told him this was anticipated which will result in mate.  But, the lord and I went back right after 16.Re1 this was played.  So, God asked me an important question.  He said what would've happened if black had moved his King to f8 or d8.  I told him that my response would've been 17.Qh5.  But, then his response was the fact that after Qh5, black can take, and if I retake, although it's liquidation, black would still have a fight left.  What he was really implying was that I was wrong to tell Mikko that 15...g5 was not a terrible blunder.  And, that I was wrong to threaten mate.  Instead, I should've placed him in check and then taken the Bishop.  As then, he'd have no play left.  The conversation also resumes with a similar note, but I agree with God's assessment even more.  jkarp:?? I figured that you'd play that, but this move does lose. You're right about the last move as Qh5+ would've won a piece when the K moves out. But, there, I gave you back a piece. Better was ...e6, but the best move was moving the K. It's still a bad position for black when you count being down a piece. But, by playing this, it's mate. The story is that I castled and played Qe2 as there was a threat against the monarch with the attacking force, so there was a danger there. But, recapturing overlooked that. I think the lesson to be learned after attacking my N again is to not just attack or kick a piece because it's possible to do so. Instead, look at what danger lies ahead. So, the important thing to take note of is to look out for all threats made by your opponent.  \n   ",
        "17. Qxe7#": "flatus77: I'm totally pissed fot myself after our game. After taking some advice from TA I will reduce number of my games and concentrate more. \nWhen I'm happy with my overall game, I'd like to take another lesson from you, if its alright for you. \nBut first I need to sort my game up. I threw myself too deep in chess becouse I got too much fun. I got to accept that this is now my level and work starts now.  jkarp: Yes. TA is a good teacher. You should also remember his blitz Q sacs. What happened is that when you kicked my N, your f pawn got removed. Just remember that the f pawn is the weakest pawn on the board. So, when it advances, you're left with a vulnerable target. And, in the end, I gave you a piece, and once you took it was mate. So, the moral is to be aware of all threats made by your opponent. The way to do that is by cutting your number of games and slowing down the pace. "
    },
    "url": "https://gameknot.com/annotation.pl/teachers-and-learners-training-game?gm=62416",
    "gameName": "Teachers and Learners Training Game",
    "players": "jkarp (1310) vs. flatus77 (1073)",
    "opening": "Sicilian (B30), Nimzovich-Rossolimo attack (without ...d6)"
}