{
    "moves": {
        "1. e4": "For all the moves on this game go to:\n\nhttp://gameknot.com/chess.pl?bd=19494345\n\nThis game catches my immediate attention because White plays King's Gambit.  Watch it. ",
        "1... e5": "Black tries the Ruy Lopez leading for White to try the King's Gambit:",
        "2. f4": "And there it is! I am immediately focused on this game regardless of what player is on what side.  This is a tried and true King's Gambit from White against the weak Ruy Lopez! How more exciting can this get now? In the King's Gambit White takes incredible risk to overpower Black using the common Ruy Lopez. I hate common Black Defenses.  I am for White at this point!  White is doing the century old Gambit! Will it be declined or accepted?",
        "2... exf4": "Accepted!",
        "3. Nf3": "Standard! For the King's Gambit Accepted! (or King Bishop to Queen Bishop Four!) ",
        "3... d6": "Black is hoping to pin King Knight to the Queen! ",
        "4. Bc4": "The King's Bishop is coming out to place.  I'd be worried about the pin and what to do to make life harder for Black. You can bring out the knight or the bishop or both but we must pay attention to what happens now...",
        "4... Be6": "In this scenario I'd have taken the Black Bishop right away since it would mess up the Black 0-0 area.  What does white do?",
        "5. Be2": "He backs off! And he should be ATTACKING hard and fast in the King's Gambit! ",
        "5... Be7": "It looks like a reasonable move for Black at this time to develop without problem. Why not? When you use the King's Gambit you ATTACK and never stop ATTACKING. White retreated and now Black is opening safely. ",
        "6. O-O": "Seems \"safe\" but now Black is attacking. A King's Gambit does not always require an immediate 0-0. Especially when the attack is failing. ",
        "6... g5": "Common to reinforce that f4 pawn. ",
        "7. d4": "White is trying to just develop now.  He already retreated from the ATTACK to the DEFENSE. ",
        "7... h6": "More reinforcement. ",
        "8. c4": "More opening up. ",
        "8... Nf6": "More Black development. ",
        "9. Nc3": "More White development. ",
        "9... Bg4": "Okay. Now White needs to do something else besides...",
        "10. b3": "THIS! Can you see the move White should have done instead?",
        "10... Nc6": "Nothing wrong with Black continuing to develop while White sits in arears!",
        "11. Bb2": "Was there a better place for that bishop to go? Or, another pawn to move instead? ",
        "11... Qd7": "Clearing, now, for a 0-0-0 of course.  Well, it seems by now Black has the time to do so. ",
        "12. Qd3": "I'd have tried, as White, to get that g4 Bishop out of the way before this. ",
        "12... O-O-O": "Now the King is safely ensconced.  What can White do now?",
        "13. d5": "Finally! ",
        "13... Ne5": "Now you see why White's Queen on d3 is a wasted move instead of something else sooner. ",
        "14. Nxe5": "Creating a lock up. ",
        "14... Bxe2": "Here is another choice by White to make.  Why not use the c3 Knight?",
        "15. Qxe2": "Didn't do it. ",
        "15... dxe5": "And the result. ",
        "16. a4": "White is really too far behind to go after the 0-0-0 King. ",
        "16... Rdg8": "Black uses a rook to drive the point home double time. ",
        "17. Nb5": "White advances on the King.  ",
        "17... a6": "Black responds with reason. ",
        "18. Na3": "White retreats again. ",
        "18... Bc5+": "Nothing stops the Bishop from checking White's King into a corner...",
        "19. Kh1": "Thusly. ",
        "19... Qd6": "There's a barracade of pawns to maneuver through.  Will Black figure out how?",
        "20. Nc2": "Perhaps. White continues to retreat. ",
        "20... g4": "Black is doing a Nimzo thing here. Get a rook behind a pawn and what will stop it?",
        "21. Bc3": "White is trying to figure out what to do next and makes a \"move\" to pass time perhaps.  Not the best move anyway. ",
        "21... h5": "Now another pawn behind a rook is advancing Nimzo style...",
        "22. b4": "White is hoping to get an attack to the Black King.  Will he make it?",
        "22... Ba7": "We have to see...",
        "23. c5": "Here White is being aggressive and moving forward FINALLY. But will White be in time?",
        "23... Qe7": "Reconnoitering by Black. Not bad. ",
        "24. Na3": "Okay. A forward Knight by White.  But where will this Knight go after this?",
        "24... Ne8": "Black is already forward on the King side. Time to think about the Queen sided 0-0-0 to make sure all is intact. ",
        "25. Nc4": "So there goes the Knight from White. ",
        "25... f6": "And there goes the back up for the pawns on the King Side advancing...to...the...King. ",
        "26. Rac1": "Not the best place for the rook to go but there it went. ",
        "26... h4": "In the meantime Black is pushing King side....with ROOKS behind pawns! ",
        "27. Bb2": "I call this meaningless movement from White. I have no idea what White has in mind. But I do see what Black has in mind. ",
        "27... Qg7": "An overwhelming rook and Queen gathering King side. Black had the time to do it. ",
        "28. d6": "White pushes Queen side. ",
        "28... cxd6": "Black does whatever. Other moves were possible.  ",
        "29. Nxd6+": "Not really a threat to Black really. ",
        "29... Nxd6": "Time for disclosed check. ",
        "30. cxd6+": "Thusly. ",
        "30... Kb8": "Black is fine.  See what is gathered on the King Side?",
        "31. Rc7": "Not a threat. ",
        "31... Qg6": "Perhaps going for the e4 pawn?",
        "32. Qc4": "Not enough force by White to be significant. ",
        "32... Bb6": "So why not pressure the rook?",
        "33. Rf7": "To move elsewhere like here. ",
        "33... Rg7": "I dunno. ",
        "34. Rxg7": "I dunno. ",
        "34... Qxg7": "Just a meaningless exchange when other things could have ensued to shorten this game. ",
        "35. a5 Be3 36. b5 Rc8 37. Qd3 Qd7 38. bxa6 bxa6": "I think a bunch of mistakes are made up to this point.  I think the next move by White is not the best move.  But I am looking at it hindsight.  Taking the a6 pawn seems fine so why not? The d6 pawn will be protected and it is advanced.  Perhaps Q d5 would work as well. I don't have the brains to say what is best but I see other options to consider. ",
        "39. Qxa6 Rc6": "Black has a more than this option but that passed pawn is worthy of double attack. ",
        "40. Qe2": "Well this gives up the advanced pawn here.  There are other moves better. ",
        "40... Rxd6": "And there goes the advanced pawn along with the powering of a queen and rook in line...And, the White Bishop sitting there doing absolutely nothing without any power to squeak about last rites. ",
        "41. Ba3": "Okay so the White Bishop is useful for something. ",
        "41... Rd2": "And the something is an attack by Black after the Queen. ",
        "42. Rb1+": "Good move.",
        "42... Ka7": "Good move. The King is able more than often to take care of himself or business. We forget this time and time again.  The King is a Fighting Piece. ",
        "43. Qf1": "One of two choices for the most maneuverable pieces on the board to go.  Now you know it is closing time. ",
        "43... Qa4": "The King remains a fighting and defending piece for Black.  Black knows how to employ the King's Saber! ",
        "44. Ra1": "Oh well. ",
        "44... Qxe4": "Black's King is still defending and wielding a Saber.  In the meanwhile, the Queen is up to dirty business to advance the Infantry...",
        "45. Be7": "Useless move. ",
        "45... h3": "All of White's pieces are out of line.  I figure they lost hope when the attack made them do knee jerk responses to a command that did not know how to Attack.  \nThe King's Gambit is an ATTACK and it stays that way to the bloody end. "
    },
    "url": "https://gameknot.com/annotation.pl/team-match?gm=50175",
    "gameName": "Team match",
    "players": "rinaldi (1581) vs. mark1973 (1659)",
    "opening": "KGA (C34), Fischer defence"
}