{
    "moves": {
        "1. e4 e5 2. Bc4": "Bishop's opening.",
        "2... Qf6 3. Nf3 Bc5 4. d4 exd4": "This move is not found in the database.  Not sure why--it seems like a good one.",
        "5. Bg5 Qg6 6. Nbd2 h6 7. Nb3 hxg5 8. Nxc5 g4 9. Nh4": "Unwise.  RxN for free.",
        "9... Qc6 10. Qxd4": "Yep.  This protects both knight and bishop.  But that h knight remains at risk.",
        "10... b6": "You know what I really like here?  Bd5.  The black queen and rook are lined up.  What is probably even better is Qe5+.  Nah, Bd5.  PxN, then Qe5+.  If the queen intercedes trade her for the bishop, and you still have QxPc5 as a little bonus.  Though instead of QxPc5, Pg3 to protect that poor knight might be better yet.  I cannot believe that thing is still hanging out there undefended.\n\nThe problem with Bd5 is PxN threatens the white queen.  BxQ, PxQ, BxR.  White comes out ahead.  If black moves the queen white still takes the rook.",
        "11. Nd3 Qd6 12. Qxg7": "Right, well, black HAS to see that undefended knight has been sitting out at h4 for four moves now.  Will black trade knights?",
        "12... Rh6": "Well the knight is as ugly as a horse's head, but so what?  RxNh4 seems WAY better, so long as you're moving the rook.  Qf6 would probably have been better yet for black.\n\nHere white wants BxPf7+.  Black has Kd8, which is mortal because QxN+ is followed by Qf8 and then QxQ#.  But Ke7 is also horrible, because Nf5+ gives white the black queen.  Actually, Nf8+ drives the king back to d8, where the previous mate plays out.  Game over.  Force mate.",
        "13. Qxg8+": "See, here white went for the knight out of pure greed.  A little patience would have worked wonders--take the pawn first--it is free.  QxPf7+ and the knight could be picked off at white's leisure.  Two pieces and black wouldn't even be able to propose a queen exchange.",
        "13... Qf8 14. Qxg4 Qh8 15. O-O": "Now the knight is lost for sure.  Castling was a terrible idea.  I would have gone with Pg3, to put some pawn power on that knight.  Or Nf3, to protect Ph2.  Now black takes the knight (finally) AND picks off Ph2.",
        "15... Rxh4 16. Qf3 Rxh2 17. g3 c6": "What, when in doubt push a pawn?  Pf7 is undefended.  ",
        "18. Qxf7+ Kd8 19. Rfe1 Ba6 20. Kf1 Rh1+ 21. Ke2 Bxc4 22. Rexh1": "No.  The proper response here would be QxBc4.  RxR, RxR or NxR.",
        "22... Qxh1 23. Rxh1 Bxf7 24. Rh8+ Kc7 25. Ne5 Bxa2 26. b3 Bb1 27. Kd2 d6 28. Nf7 a5 29. Kc1 Ba2": "Bishop should probably have taken the pawn, just to get something out of it.",
        "30. Kb2 Kb7": "This move tosses Pd6 (as in NxPd6+).",
        "31. Kxa2": "Guess it can wait.",
        "31... Nd7": "On the other hand, I see now black hoped to get the rook out.  Being down a pawn this late in the game even trades are ill advised.",
        "32. Nxd6+ Ka7 33. Rh7 Rd8": "Here white should push the e pawn.  Pe5.  Then Pe6 eats the black knight, unless black moves the king first.",
        "34. c4": "This pawn move occupies a square the knight would have liked to be on.",
        "34... Kb8": "Black, of course, wants to move the king to free up the knight.",
        "35. Nf7 Re8 36. f3 Nf6 37. Rh6 Ng8": "This doesn't help prevent RxPc6.",
        "38. Rxc6 Ne7": "That doesn't help prevent RxPb6+.",
        "39. Rxb6+ Ka7": "Here I kind of like Pc5.",
        "40. Rb5 Ka6 41. Ka3 Rf8": "Ne5 protects against RxPf3.",
        "42. Nd6": "Uh, not quite.",
        "42... Rxf3 43. Ka4": "Say goodbye to another pawn.",
        "43... Rxg3 44. c5": "Wait--RxPa5+ actually isn't bad here.",
        "44... Nd5": "Black may have been so focused on Nc3+ (which gives him the white rook) he overlooked PxN.",
        "45. exd5 Rg5": "Pc6 protects Pd5, at least momentarily.",
        "46. Rb6+": "This works too.",
        "46... Ka7 47. Kxa5 Rxd5 48. Rc6 Kb8 49. Kb6 Rd3 50. Rc8#": "Beautifully executed.  The kings are lined up, the rook leans back against the wall."
    },
    "url": "https://gameknot.com/annotation.pl/team-match?gm=55948",
    "gameName": "Team match",
    "players": "psycho422 (1060) vs. nathansa (994)",
    "opening": "Bishop's opening (C23)"
}