{
    "moves": {
        "1. c4": "another loss, due to a nice attack from mandrake. english",
        "1... Nf6 2. Nc3 Nc6 3. g3 e5": "according to the computer, slide inaccuracy",
        "4. Bg2 Be7 5. d3 O-O 6. e3 d5 7. cxd5 Nb4 8. e4": "white seems slightly better...",
        "8... c6 9. a3 Na6 10. dxc6 Nc5 11. Nd5 Nxd5 12. exd5": "and all of sudden, the cards castle seem fragile.",
        "12... Bf5 13. cxb7 Nxd3+ 14. Kf1 Rb8 15. d6": "computer says this is a clear mistake. Should have played\ng4 Bg6 16. d6 Qxd6 17. h4 Nc5 18. Qxd6 Bxd6 19. Be3 Nxb7 20. Bxa7 Ra8 21. Be3",
        "15... Qxd6 16. Be3 e4 17. b4": "once again a mistake according to the computer. Best is\n17. g4 Bg6 18. h4 h6 19. Ne2 Rxb7 20. b4 Bh7 21. Qb3 Rc7 22. Rd1 Qg6 23. f3 exf3 24. Bxf3",
        "17... Qe5 18. Ne2 Rfd8 19. Qb1 Rxb7 20. Ra2 Bg4": "computer says this should have been followed by this: Bg4 21. Rd2 Rc7 22. h3 Bxe2+ 23. Kxe2 Rc3 24. Qa1 Nxf2 25. Bd4 Rxd4 26. Qxc3 Rxd2+ 27. Kxd2 Qd6+ 28. Ke2 Nxh1 29. Bxh1\nBut i have not seen it, and we have the continuation better for black.",
        "21. h3 Be6 22. Rd2 Bc4 23. Kg1 Bg5 24. Nf4": "strange: mandrake told me in a message he liked that move, but computer says it is a mistake. I like it too!",
        "24... Bxf4 25. Bxf4": "of course, black cannot take back with horse: there is a mate threat!",
        "25... Qe7 26. Be3 a5 27. Qc2 Qe6": "according to computer this moves give me back the advantage... I have not seen so... too bad.",
        "28. bxa5 Rc8 29. Qa4": "this is clearly a mistake. ",
        "29... Nb2 30. Qc2": "and here is becoming fatal.",
        "30... Bd3 31. Rxd3": "black cannot take the queen...",
        "31... Nxd3 32. Qe2 Rb2 33. Qg4 f5": "purchasing the queen",
        "34. Qh4 Ra2 35. Bf1 Ne5 36. Kg2 Nf3 37. Qf4 g5": "gaining the queen",
        "38. Qxf3 exf3+": "hopeless, if not before..."
    },
    "url": "https://gameknot.com/annotation.pl/team-match?gm=35700",
    "gameName": "Team match",
    "players": "thitho (1754) vs. mandrake53 (1842)",
    "opening": "English opening (A16)"
}