{
    "moves": {
        "1. e4": "I've decided to annotate this because I found myself with an interesting position on move 6 which I would like to see how the game goes from there.  I've started to annotate from 6.Nxf6+\n\nKing pawn 2 standard",
        "1... e5 2. Nc3 Nf6 3. a3": "I've move a3 to try for a checkmate which I think is called something like \"bradburne\" it involves black moving his bishop to c5 my knight moving to d5 his knight capturing e4 and my queen moving to g4.  This will give me a good advantage and hopefully a seven move mate should things go to plan after that.",
        "3... Bc5": "c5 its working so ...",
        "4. Nd5": "... Nd5 it is.   Capture my pawn please.",
        "4... d6": "ahhhhh it didn't work next time maybe.",
        "5. d3": "Now I better protect e4.  ",
        "5... Bg4": "Okay he's threatening my queen so I need to deal with this.  I think if I capture his knight on f6 I can then capture his bishop on g4 when he captures my knight.",
        "6. Nxf6+": "Now this is where I found the 'interesting position'  I am analysing the board as he hasn't made his move and I have time to kill.  I assume 6.Qxf6 7. Qxg4 but then I realise he can move Qxf2 ouch.  check and capture the bishop on f1 and I've opened up a can of worms.  But after further analysis I realise I have an escape route around the back d2 -c3-b3 then when he cant check me he becomes vulnerable.  My queen can move to c8 and capture g7 depending on what he does.  Even retreating his queen at some point I believe I can still have a small material advantage. Castling I can move my dark squared bishop to h6 to give him problems. The trouble is though am I leaving my king out in the open too much??  Will I set myself up for a fall.  He's still not made his move so I will have another look when he captures my knight with the queen should that be what he does.",
        "6... Qxf6": "As expected...",
        "7. Qxg4": "so here goes the gamble.",
        "7... Qxf2+": "as expected he saw the check so he thinks he's in good shape. (he still might be)",
        "8. Kd1 Qxf1+": "got the bishop",
        "9. Kd2": "I want him now to go f2 preferably but Qf6 would be acceptable.  Should he castle I will have to possibly move to c3 without being forced",
        "9... Bxg1": "I wasn't expecting that. I didn't come across it when analysing that could cause problems.",
        "10. Rxg1": "I nearly missed this and immediately put my queen on c8.  I figured out in the end that my rook was lost and it would possibly be rook for rook but this way I get his bishop as well. ",
        "10... Qxg1 11. Qc8+": "here is the check",
        "11... Ke7": "Qxb2 I thought was an option until I saw he could movie his knight.",
        "12. Qxh8": "So i'll take the rook",
        "12... Qxg2+": "check",
        "13. Kc3 Qg6": "Hmmm I was hoping he captured h2 then I would have checked him Bc5 then hopefully Ke6 Qe8# or f6 Qxg7 then see what happens.",
        "14. Qc8": "This move is to capture b7 then a8 I cant see an escape for the rook.",
        "14... c5": "This confused me.  He must know I would go Qxb7 what is this for. It also opens up the check.  ",
        "15. Qxb7+": "I looked up everywhere and I cant see a way for him to get anywhere near my king so this seems safe.",
        "15... Ke6": "He's on e6 I wonder if there is a way to mate him here as he cant move to d5 or f5",
        "16. Qxa8": "Rook capture at the minute will be ok for now.  Nc6 I capture.  Na6 Qc8+ Qxa6 capture. Nd7 Qe8+ Kf6 Qxd7 capture.",
        "16... Nd7 17. Qe8+ Kf6 18. Qxd7": "All as predicted",
        "18... Qg2": "I hadn't spotted it until now but.......",
        "19. Qxd6#": "CHECKMATE!!!!"
    },
    "url": "https://gameknot.com/annotation.pl/team-match?gm=54331",
    "gameName": "Team match",
    "players": "willikizz (1429) vs. rossmiller (1413)",
    "opening": "Vienna (C26), Mengarini variation"
}