{
    "moves": {
        "1. e4 c5 2. Nf3 d6 3. d4 cxd4 4. Nxd4 Nf6 5. Nc3 a6": "Opening moves, Blacks most popular system in the scillian defence, Najdorf variation.",
        "6. Bg5 e6": "I was expecting this move as usual in the Najdorf variation.",
        "7. Be2": "After e6 I wanted to play Be2 cause i wouldnt like my Bishop on b4 anymore.",
        "7... Be7 8. a4": "I thought my opponent would like to play b5 followed by Bb7, So i wanted to prevent it.",
        "8... Bd7 9. f4": "I was trying to gain more space and have a strong center with my pawns on the 4th rank. .",
        "9... Nc6": "He s developing his Knight.That controls central dark squares and attacks my Knight on d4. So far it s not a problem for me But things might get worse.",
        "10. O-O": "I thought it s time to castle. I am sure you all can see why s it bad move cause my knight on d4 s hanging after Qb6.. I just couldnt concentrate on the game at the moment i made this move.",
        "10... Qb6": "and my opponent didnt miss the chance of having my knight as a morsel.",
        "11. e5": "Here, It was clear that i am gonna  lose my Knight on d4.With that in mind, i thought I can  set up a counter attack while he s taking  his time  with my Knight on d4.",
        "11... Nxd4": "I think Qxd4 was better. That way He could exchange Queens and when Queens are of the board and i am a piece down, I guess It would be all over already..But my opponent immediately takse my Knight and now he s threating double check next move. I cant let it happen.",
        "12. Kh1": "So my king ran away.",
        "12... Ng8": "Now lets look at the position. I am a piece down but I gained tempo with e5 move and forced his Knight back to g8 so i gained one more tempo.\n ",
        "13. a5": "I am trying to have some positional advantage while i am down in material.",
        "13... Qa7": "His Queen went to a7 square, probably to get rid of my attacks to his Queen. Now I cant attack his Queen anymore and her majesty  protects his knight on d4. But Lets look at Black's position now. He s up a piece but his rook on h8 and Knight g8 has to be developed.He needs two moves to gather himself and build a killing attack But two moves are a lot in chess. He has to find a way.",
        "14. exd6": "Here I wanted to open position before he finds time to develop his Knight followed by Castling.",
        "14... Bxd6 15. Qd3": "Improving my position with Qc3. I am threating Rd1 next.",
        "15... h6": "Here I was expeting him to play some defensive move. But he wants to attack He has seen something.",
        "16. Bh4": "My only move was Bh4.. Threating f2 next move now. That s my new plan.",
        "16... g5": "So my plan works here after Bf2 I will eventually win my piece backand will have a good positional advantage. But What happened why my opponent played this move?? He appearenty thought i would take the pawn fxg and then hxg!! threating my Bishop plus opening h file and if i take the pawn his rook takes on h2 and Kxe2 mate next move.if i dont take the pawn I cant go to g3 because my Bishop hangs and f2  cant save me anymore. I cant let that happen. So I went for my plan.",
        "17. Bf2 e5": "He has to protect his knight.",
        "18. Ne4": "Attacking his Bishop.",
        "18... Bc7 19. fxe5 Bxe5 20. Nd6+": "20 Nd6!! he cannot take my Knight, because if he takes Bxd4 wins by forking queen and rook. So his king has to move. d8 loses because Nx f7 wins his Bishop for free and I would still have the pin on the Knight.f8 and e7 loses because I would take f pawn anyway!",
        "20... Ke7": "He chosed e7 to avoid oncoming discovery checks",
        "21. Nxf7": "So I played the move!",
        "21... Bf5": "He had to do something but it was too late. If i take the Bishop I would have material advantage after couple of exchanges but I have an attack going.So I didnt wanna exchange now.",
        "22. Qe3": "Attacking his Bishop! Look at his Queen rooks and Knight on g8. they are not doing anything. They are not in the battle. I made a big mistake on this game in the very beginning but developing my pieces and gaining time could save the day so far. I am attacking since I lost my Knight.",
        "22... Kxf7": "King captures my Knight. He doesnt have many good moves actually. He s trying to survive and run.",
        "23. Qxe5": "So I take the bishop,Threating rook and d4 Knight. And also mating threat Bf5+ followed by Bxd4",
        "23... Re8": "He cant avoid mate anymore..",
        "24. Bh5+ Kf8 25. Qxe8+ Kg7 26. Qf7#": "The end.. 1-0"
    },
    "url": "https://gameknot.com/annotation.pl/team-match?gm=30351",
    "gameName": "Team match",
    "players": "dusundurt (1646) vs. sanych (1601)",
    "opening": "Sicilian (B95), Najdorf, 6...e6"
}