{
    "moves": {
        "1. d4 d5 2. Nc3 Nf6": "The unfamiliar Queen's Pawn Chigorin variation plays role here. It si a more common version and the winning percentages (thanks to a website called chessebook.com) are: 1-0=12%  1/2=52%  0-1=36%. This is an opening advantage for black.",
        "3. f3 Nc6 4. e3 Bf5": "Not the best move for a center challenge.",
        "5. e4": "I was worried about this move until I saw that I had the advantage.",
        "5... dxe4 6. g4": "Why did white have to do this flimsy pawn move? Sure, your Bishop has a totally open line, but do you have space for early pawn pushes? ",
        "6... Bg6": "If I still want to protect the e-pawn, I had to do this move.",
        "7. Be3": "White puts more pressure on his d-pawn, not realizing what was going to happen. Suppose he played 7.Bg2, then he would have prevented me from doing the next three moves.",
        "7... Qd6": "I was expecting white to do 8.Bb5, but I was unprepared for white's next move.",
        "8. Nxe4": "Suddenly, this thought traveled in my head, \"Big miscalculation.\"",
        "8... Bxe4 9. fxe4 Nxe4": "White's entire opening process was destroyed! Now, white must develope his back rank pieces in order to keep this game going.",
        "10. Nf3": "In desperation to recover his d-pawn's defence and to fling it down the isle, he played this move?!",
        "10... e5": "e5!? was an attempt to trick white. ",
        "11. Bb5": "A pathetic bishop move. Better is 11.Bd3!? or 11.Bg2.",
        "11... Qb4+ 12. Bd2 Qxb5": "The bishop is gone. White cannot castle. To make matters worse, White's king side is being pried open!",
        "13. b3 Bb4 14. a4 Qa5": "White's pawns put me in a position to sucessfully challenge d2 or d4.",
        "15. O-O": "15.O-O is a complete disaster to the king side.",
        "15... exd4 16. Qe1 O-O-O 17. c3": "This blazing blunder cost White the game.",
        "17... Nxc3": "Here we go again. White stops trading with me after I play this move. Maybe White's Queen is fixed on the the open e-file.",
        "18. g5 g6 19. h4 Ne2+": "I desperately rushed to grab the bishop with this crazy blunder. I quickly lose the d2 trade.",
        "20. Qxe2 Rhe8": "I had to play this to recover the trade.",
        "21. Qc4 Bxd2": "Because of White's dubious move, I eliminated White's bishop.",
        "22. Qxf7 Be3+": "White can hardly play any move that can turn the tables around.",
        "23. Kg2 Qd2+ 24. Kg3 Re7": "White's plan to get my pawns to promote his pawns failed because of the use of one piece. His Queen has to retreat.",
        "25. Qc4 Bf4+ 26. Kg4": "White's King is on the road of death. He is trapped by several pieces; some are his own!",
        "26... Ne5+ 27. Kh3 Nxc4 28. Nxd2": "Oh well, we traded Queens. Something back-fired because now, White has three possile winning threats!",
        "28... Re3+": "I liked this move; the only problem is, how can I protect my pieces (the bishop and the knight) from winning takes?!",
        "29. Kg4 Rf8 30. Rfg1": "Problem solved. White seemed to have ignored 30.bxc4. This knight becomes the powerhouse!",
        "30... Nxd2 31. b4 Nf3 32. Rg3 Bxg3 33. Kxg3 Nxg5+ 34. Kg4": "A forced move.",
        "34... Ne4 35. h5 Rg3+ 36. Kh4 Rf4#": "Moral: too much pawn structure can lead to many flaws."
    },
    "url": "https://gameknot.com/annotation.pl/team-match?gm=37259",
    "gameName": "Team match",
    "players": "mick48 (866) vs. austinwkeller (586)",
    "opening": "Blackmar-Diemer gambit (D00)"
}