{
    "moves": {
        "1. d4 Nf6 2. c4 g6 3. Qc2 d5 4. Nf3 Bg7 5. cxd5 Nxd5 6. e4 Nb6 7. Bf4 c6 8. Nbd2 O-O 9. Bd3 Nb8d7 10. Nb3 Re8": "There isn't any special theme to until this situation. I have main idea to keep castling to both side open as long as possible. ",
        "11. h4": "Now I can try something sharp because 0-0-0 is possible ",
        "11... e5 12. Bg5": "Just looking shortly black queen, hoping that pawn comes f6 and black bishop is then not so powerfull ",
        "12... f6 13. Be3": "there is now plenty of variations to play against exd4",
        "13... Nf8": "there is no hurry for castling :)... sharp play continues",
        "14. h5 Be6": "black don't mind my h pawn... go go",
        "15. h6 Bh8": "now black King has no save places at all and Bishop...he is deep deep deep",
        "16. dxe5": "breaking center her majestic will be without cover after some moves",
        "16... fxe5 17. Nc5": "I want eliminate black bishop, because it is too powerful defence man for king and with threat of b7 both white knights are active",
        "17... Qe7 18. Ng5 Bf7 19. Nxf7 Qxf7": "Now there is black king like sitting duck",
        "20. a4": "this is nice little move. I'm gonna play a5 and then Bc4, black has to play a5, which will cost b7 pawn.",
        "20... a5 21. Nxb7 Qxb7 22. Qb3+": "now, Black playing Qf7 will get endgame with difficulties, but Ne6 is ruining move, I think",
        "22... Ne6 23. Bc4 Kf7": "Now black king will be \"in lights\" ",
        "24. Qxb6 Qxb6 25. Bxb6 Reb8 26. Bc5": "this situation I have seen several moves before and I have calculated 2 black choice...",
        "26... Rxb2": "now...I have the key move :)",
        "27. O-O-O": "black have to choose now..Rb8 or Rb7...If Rb8 these were the moves what I planned: 27...Rb8 28.Rd7+ Ke8 29. Bxe6 Rb1+ 30. Kc2 Rxh1 31. Rg7!! Kd8 32.Bd6 ...White wins, I think",
        "27... Rb7 28. Rd6 Re8": "Knight is now binned forever, lets do same to Bishop !",
        "29. Rh3 Bf6 30. Rf3": "And now what moves black has anymore left :) ?",
        "30... Rc7 31. g4 g5 32. Rf5": "and what moves he has now  :)  ?",
        "32... Rcc8 33. Be3": "well here we are...nice work I think :)"
    },
    "url": "https://gameknot.com/annotation.pl/team-match?gm=63565",
    "gameName": "Team match",
    "players": "rf6_ (2030) vs. faustus987 (1926)",
    "opening": "Queen's pawn (E60), Mengarini attack"
}