{
    "moves": {
        "1. d4 d5 2. Nc3": "Note, in my annotations I use ?! and !? to be the same thing: An inaccuracy. (I never could figure out how to remember which is which.) And I think this move is an inaccuracy. Queen pawn games usually involve the c pawn, and this blocks it in. ",
        "2... c5": "Maybe not the best move, but I'm very comfortable in the queen's gambit, so why not use it as black if he doesn't?",
        "3. dxc5 e6 4. e3 Bxc5": "I think the position is equal here.",
        "5. Nf3 Nc6 6. Bb5 Qc7": "Well this looks a little like one of my white games, as I usually play the queen's gambit.",
        "7. O-O Bd7": "Breaking the pin",
        "8. a3": "I assume he is planning b4.",
        "8... Nf6 9. b4": "Yup",
        "9... Bd6 10. Bb2 O-O": "If he moves his knight away, he's in for a nasty surprise on h2.",
        "11. Ne2 a6 12. Ba4 b5": "I continue to force his bishop back and luck up the position slightly",
        "13. Bb3 a5": "I plan that if he captures, to recapture with either my knight or my rook. My knight because it will allow me to swing your to a nice outpost on c4, my rook because I often have trouble getting them active. (I know you're not supposed to bring your queen and rooks out early, but since my development is over it isn't bad is it?",
        "14. bxa5 Rxa5": "I choose rook",
        "15. Bc3 Ra6 16. Bxf6": "! OUCH With the queen's on the board it's very dangerous to have an open file near me king. My only advantage is maybe I can stick my rook on it and bear down on his king.",
        "16... gxf6 17. Ned4 Nxd4 18. Nxd4": "...And he has a very nice outpost. But, this move has a major downside.",
        "18... Bxh2+": "I pick up a pawn",
        "19. Kh1 Kh8": "Planning to move my rook onto the g file.",
        "20. Nf3 Be5 21. Rb1 Rxa3": "If he's going to undefend his pawn, I'll take it.",
        "22. Qd2": "Trying to get his queen active?",
        "22... Rg8 23. Rfg1 Bc3 24. Qc1 Qd6": "I defend my rook.",
        "25. Rd1 Rg6 26. Rd3 Rh6+": "Not sure if this leads anywhere, but it can't hurt.",
        "27. Kg1": "Pity his knight is there.",
        "27... Be5 28. Kf1 Rh1+": "He'll block with his knight, but then it'll be pinned and he'll be in trouble. It might have been better to let me take his queen.",
        "29. Ng1 Bh2 30. Ke2 Rxg1 31. Qb2 Rxb1 32. Qxb1 b4 33. e4 f5 34. g3": "Trying to trap my bishop",
        "34... Bb5": "Pin, I should have noticed this earlier.",
        "35. Kd1 Bxd3 36. cxd3 Qa6": "I was tempted to play Rxb3, and make an simplification sacrifice, but I decided this was better as it threatens a queen pin.",
        "37. Bc2 fxe4": "?? I should have pinned the queen, but I remember him taking the full three days to move, so I think it might have had something to do with forgetting about my plan.",
        "38. dxe4 Qf1+": "I should have pinned his queen, and I had a sinking feeling as soon as I hit submit.",
        "39. Kd2 Qxf2+ 40. Kc1 Qe1+ 41. Kb2 Qxb1+ 42. Kxb1 Bxg3 43. Kc1": "I now have a very easy game.",
        "43... dxe4 44. Bxe4 b3": "I advance",
        "45. Kb2 Bd6 46. Bd3 Kg7": "Getting my king involved",
        "47. Bc4 e5 48. Bxb3": "I knew he could take my pawn, but this allows a simplification sac that clears up the game.",
        "48... Rxb3+ 49. Kxb3 Kf6": "Now I just need to promote.",
        "50. Kc3 Kf5 51. Kc4 e4 52. Kd5 Be5 53. Kc4 Kf4 54. Kb3 e3 55. Kc2 e2 56. Kd2 Kf3 57. Ke1": "?? Allowing things to end sooner than expected ",
        "57... Bc3#": "With Bc3# While not the best game I've ever played, I chose to annotate it because it pushed my rating up over 1200."
    },
    "url": "https://gameknot.com/annotation.pl/team-match?gm=50943",
    "gameName": "Team match",
    "players": "mpearce01 (1158) vs. porcho (1212)",
    "opening": "Queen's pawn (D00), Chigorin variation"
}