{
    "moves": {
        "1. e4 c5 2. d4": "Play Nf3 before this move",
        "2... cxd4 3. Qxd4": "Chess is all about time. What that means is that do you have the checkmate before your opponent can checkmate you. Thus making queen moves like this one are bad because now you have to borrow \"future time\" in order remain balanced in the present. At this point if a move is not part of standard theory then there is a good reason for that. ",
        "3... Nc6 4. Qd1": "Qa4 would have been more active. Why leave home unless you intend to go out?",
        "4... e5 5. Nf3 Nf6 6. Nc3": "Do you see how you now behind by a full move now. ",
        "6... d6": "I would played ...a6 here with the idea of b7-b5-b4. The game move betrays black main tactical threat which is d7-d5. ",
        "7. Bb5": "! Good pin",
        "7... a6 8. Bc4 b5 9. Bb3": "This bishop is very strong here",
        "9... Bg4 10. O-O Bxf3 11. Qxf3 Be7": "?? I am sure you were betting on ...Nd4! Forking the queen and bishop. On a side note after white moves the queen black should not be to hastie in play NxB because the Knight on D4 practical shuts white down. Under these circumstances it would be impossible for white to not crack. ",
        "12. Nd5": "Good idea but premature you need to cover the Nd4 threat. Maybe Be3 is possible. It highlight what I was saying before about time. Currently you are a move behind so your attack is going to fail. the rule is don't attack unless you have the initiative. ",
        "12... Nd4 13. Nxf6+ Bxf6 14. Qd3 Nxb3 15. Qxb3": "The game is about equal here. Good job ",
        "15... O-O 16. Bd2": "?? More pressing is Rd1! Or Be3 as a second best",
        "16... Rc8 17. Rac1": "Don't defend a pawn unless it is really in trouble. you have to play to create threats of your own. Like Rd1",
        "17... Qe7 18. Be3": "? Bb4 make the black queen feel uncomfortable. Whit can threaten to win the d6 pawn with\n18. Bb4 Qc7 19. Rd1 Be7 20. Qd3 rd8 and white has a slight edge. ",
        "18... Bg5 19. Rfd1": "?? You need to keep your bishop. You can't win d6 without it. ",
        "19... Bxe3 20. Qxe3 f5": "Excellent move",
        "21. exf5 Rxf5 22. Qd3 Qf6 23. Qxd6 Qxd6": "A serious error that hands white the win ",
        "24. Rxd6 Rf6 25. Rxf6": "?? Now it is a draw. White should played for 25. Rd5 rf5 26. C3 and black is in trouble Because he has no counter play. ",
        "25... gxf6 26. Kf1 Kf7 27. Ke2 Ke6": "Black is winning now because he has complete control of the centre. White can no longer break through his defenses",
        "28. a3": "C3 is better",
        "28... h5 29. c3 f5 30. Rd1 a5 31. Rd2": "Rd3 is more active \nIf 31. ...e4 32. Rd4 is good for white",
        "31... Rc5": "Rd3 is better",
        "32. Kf3 Rd5 33. Rxd5 Kxd5": "White is lost now as there is nonway he can prevent the black king from eating his pawns",
        "34. b3 Kc5 35. Ke3": "Good! The white king must stay in the centre ",
        "35... a4 36. bxa4": "! Only move ",
        "36... bxa4 37. Kd3": "This losses fast. The only option was Kd2 followed by Kf2 ",
        "37... e4+ 38. Kc2 f4": "An error that also white to get back in the game. Black should have played Kc4 forcing white in to a zugwieg. ",
        "39. Kd2": "? The drawing move is 39. F3 e3 40. Kd3! e2 41. Kxe2 Kc4 42. Kd2 Kb3 43. c4 Kxc4 ( 43...Kxa3 44. Kc3! Ka2 45. Kc2 [a3 46. C5!+/-]  45. ...Ka3 46. Kc3 Ka2 =) 44. Kf2 Kd4 45. Kd2 =",
        "39... h4": "Is is again a draw is white plays f3 ",
        "40. Kc2 Kc4": "Now black has a easy win",
        "41. h3 e3 42. fxe3 fxe3 43. Kd1 Kxc3 44. Ke2 Kb2 45. Kxe3 Kxa3 46. Kf4 Kb4 47. Kg4 a3 48. Kxh4 a2 49. g4 a1=Q 50. Kh5 Qg7 51. h4 Kc5 52. g5 Kd4 53. g6 Ke4 54. Kg5 Qe7+": ""
    },
    "url": "https://gameknot.com/annotation.pl/team-match?gm=35472",
    "gameName": "Team match",
    "players": "charmedones (1620) vs. pawnpusher2004 (1496)",
    "opening": "Sicilian (B21), Andreaschek gambit"
}