{
    "moves": {
        "1. e4 c5 2. Nf3 d6 3. Bc4 e6 4. Qe2": "Sicilian - a special variation - normally white would develop faster and not use time on the queen, but white plan to open the center and push e5 at some point, the \"normal\" Nc3 with the idea d4 is also a good plan here.",
        "4... Be7 5. O-O a6 6. c3": "Prepare d4 and make an escape hole for the bishop.",
        "6... Nc6 7. d4 cxd4 8. cxd4 Nf6": "Another good move would have been 8.-,d5 and black have at least equal, however this is much more in the sicilian style, half-closed game with black playing on the queen-side.",
        "9. Nc3": "I was considering to play 9.e5, but white get a strange position which I do not like to play.",
        "9... O-O 10. e5": "One of us have to play either e5 or d5, I prefer to make it here, though my Bishop on c4 is rather passive now, but it will get into play through b3 and c2 and then it has the line to h7  which we will see.",
        "10... Nd7 11. exd6": "Another option was Bf4, but this bishop is on the wrong place, it will only force black to choise between dxe5 or d5 and either way it has to move later on again.",
        "11... Bxd6 12. Be3": "Open for the rook and protect d4, but also blocks the white queen.",
        "12... b5": "Black develop his white-bishop in an elegant way.",
        "13. Bb3": "Not Bd3, it will be nice to have the option to play Qd3 or put rooks in either c or d or both.",
        "13... Bb7 14. Ne4 Be7 15. Rac1 Na5 16. Bc2 Nc4": "Nice place for his night!",
        "17. Bd3 Nxe3": "I think this is a mistake - Normally I would have waited, with  this move black open the f-line, white get an extra protection on d4 and white get an easier game.",
        "18. fxe3 h6": "I think this is a small mistake, I understand that he is affraid of Ng5, but he should probably have played 18.-,f5 19.Ned2,Rc8 and black has a fairly good pressure on white.",
        "19. Ng3 Nf6 20. e4 Qb6 21. Kh1 Rac8 22. Rcd1 Rfd8 23. e5": "I played this with move 27.Rxf7 in mind, it is very risky, but black did not find the right defence. Another strategy could have been to play 23.a3, with the idea to play b4, but it looked to me like I had the most difficult game here, so I took the risk.",
        "23... Nd5 24. Qe4 g6 25. Nh4": "White it threatening to take on g6, so black have to exchange his bishop",
        "25... Bxh4 26. Qxh4 Ne3 27. Rxf7": "I guess this was a shock to black, I had put a lot of hours into analyzing this position when I played 23.e5 - with the best defence from balck, white does not get more than a draw or might even loose, but that is always the risk in this kind of game.",
        "27... Qxd4": "Big mistake - the only way was 27.-,Bxg2+ (force the king into the b6-g1 line) 28.Kg1, and now Kxf7 and Nxd1 are both options that are good for black.",
        "28. Rg7+": "White have to keep making the check or he will loose.",
        "28... Kxg7": "Only move, otherwise there is mate in 1.",
        "29. Qf6+ Kg8 30. Qxg6+ Kf8 31. Qxh6+ Kg8": "Black is loosing, but this make it faster - \"best\" move would have been 31.-,Ke8 but he have to face 32.Bxg6+ and he loose his queen.",
        "32. Bh7+ Kf7 33. Bg6+": "Black resigned, there is mate in 1 or 2 moves, i.e. 33.-,Ke7 34.Qg7#"
    },
    "url": "https://gameknot.com/annotation.pl/team-match?gm=38964",
    "gameName": "Team match",
    "players": "hvalsoe (1885) vs. caramante (1779)",
    "opening": "Sicilian (B50)"
}