{
    "moves": {
        "1. e4": "The King's Pawn Play.",
        "1... e6": "I decide to play the double kings knight opening instead of the Sicilian Defense.",
        "2. Nc3": "This is where he decides to develop his minor pieces, but I cannot figure out why he did this on the queen's side instead of the king's side.",
        "2... Bb4": "At this point, I threaten to force an exchange with Bxc3 and dxc3.",
        "3. a3": "He attempts to prevent the exchange by playing a3 because he does not want two bad pawns since two pawns would be on the c file, but he is not successful because the exchange is inevitable.",
        "3... Bxc3 4. dxc3 Nf6": "Now, I bring out my knight in the attempt to capture his free pawn, but he does not allow this to happen.  ",
        "5. f3": "This was not a great move because he could have played e5 and threatened me with exf6, and that would have been his best move.  However, he did not think about the feasibility because he was worried about his pawn on e4 since I was threatening to play Nxe4.  Therefore, he played f3 to prevent this from happening.",
        "5... d5": "Now, I try to force an exchange with d5 but am unsuccessful. ",
        "6. c4": "He responds with c4 in order to get rid of his bad pawns, and it works because he forces an exchange with dxc4 and Bxc4.",
        "6... dxc4 7. Bxc4 Qxd1+": "Now, I decide to check him in order to force an exchange, with Qxd1+ and Kxd1.",
        "8. Kxd1 e5": "By playing e5, I prevent him from threatening me with exf6. ",
        "9. h4": "I do not know what he was thinking when he chose that candidate.  He probably figured that he would put pressure on the h square. ",
        "9... Be6": "I play Be6 in order to force an exchange with Bxe6 and fxe6. ",
        "10. Bxe6 fxe6": "However, this was a bad move because I now have two bad pawns on the e square.",
        "11. Ne2": "At this point, I attempt to threaten him with Nxh1 by playing Nh5, then Ng3.  Therefore, he prevent this potential threat by playing Ne2. ",
        "11... Nc6": "I am not sure why I picked this candidate or what this move does, in the long term.",
        "12. b4": "I do not know what he was thinking when he picked this move, unless he was trying to put pressure on the b square.",
        "12... Rd8+": "At this point, I check him in order to prevent him from castling.  I forgot, however, that he could have played Bd2 and still castle, but he did not think about that possibility, either.",
        "13. Ke1": "Now that he moved the king, it is no longer feasible for him to castle, as I mentioned earlier.",
        "13... Nd4": "At this point, I play Nd4 to force an exchange with Nxe2 and Kxe2.",
        "14. Kd1": "I cannot figure out why he chose to play Kd1, as opposed to leaving his king on e1, or playing Kf1.  That is because he is put himself into a discover check during the exchange because my rook is on the d square.",
        "14... Nxe2+ 15. Kxe2 h5": "I played h5 in order to stop his pawn on the h square from advancing further.  However, I do not why I chose this candidate because he would not have been able to play h5, regardless, because of my knight on f6. ",
        "16. Bg5": "He plays Bg5, in his attempt to force an exchange with Bxf6 and gxf6, but I do not allow this to happen.",
        "16... O-O": "I could have exchanged his pieces, but I decided to castle on the king's since this is my favorite move, but this also prevents him from exchanging the pieces because of my rook on f8.",
        "17. g4": "He plays g4 in order to force an exchange with hxg4 and fxg4.",
        "17... hxg4 18. fxg4 Rd4": "That was not a good move.  Instead, I could have gotten a free pawn, if I had Nxe4.  However, I do not think at all, so I make a sudden and quick judgement, when I play Rd4.",
        "19. Bxf6": "Now, he forces an exchange with Bxf6 and gxf6.",
        "19... gxf6 20. Ke3": "At this point, he plays Ke3 in his to put pressure on my rook.",
        "20... Rfd8": "I respond by connecting and doubling my rooks.",
        "21. h5": "At this point, he is trying to get a pawn promotion, but I am just as determined to prevent this from happening.",
        "21... Rd4d2": "I respond by playing Rd2 in my attempt to capture his free pawn with Rxc2 because he cannot play Kxd2 since my other rook is also on the d square.",
        "22. Rac1": "He protects the pawn with Rac1.",
        "22... Rd2d6": "I do not know why I made that move or what it is going to do.",
        "23. Rcf1": "Now, he plays Rcf1 in his attempt to capture a free pawn with Rxf6. ",
        "23... Rd6d2": "In response, I threaten to play Rxc2 and capture one of his pawns, if he played Rxf6.  I also could have protected my pawn on f6 with Rf8, but the thought did not occur to me.",
        "24. h6": "At this point, he is trying to get a pawn promotion. ",
        "24... Rxc2": "I respond by capturing a free pawn with Rxc2.",
        "25. h7+": "He tries to trick me so that he could get the promotion by checking me.",
        "25... Kg7": "I could not have played Kf8, or he would have checked me with his pawn promotion and won my free rook.  I also could not have played Kh8 because he would have been able to capture a free pawn with Rxc6, so Kg7 was my best and only choice. ",
        "26. Rfd1": "He decides to play Rd1 in order to force an exchange with Rxd1 and Rxd1, but I do not let this happen.",
        "26... Rh8": "Instead, I play Rh8 to put pressure on the h square.",
        "27. Rd7+": "He responds by checking me.",
        "27... Kg6": "I cannot play Kg8 because he would check me and win my free rook with Kh8+, so I, \"quick play\", with Kg6.",
        "28. Rh5": "He, therefore, responds with Rh5, but I do not know why chose that candidate because pawn on h7 was already protected by his rook on the h square. ",
        "28... b5": "I figured that I would prevent his pawn from advancing further with h5, but I do not why I made that move either because he would not have been able to get a promotion since my rook on the second row or column.  Instead, I force an exchange with Rxc7 and Rxc7, and it is great because I exchange my pawn for his rook.  ",
        "29. Rxc7 Rxc7 30. Kf3": "After he moves his king, I force another great exchange.  That is because I capture more pieces then him because I capture with two of my pieces, but he only captures with only one piece.  This exchange occurs when Rhxh7, Rxh7, and Kxh7 are played.",
        "30... Rhxh7 31. Rxh7 Kxh7 32. Kg3": "I cannot figure out why he chose that candidate.",
        "32... Rc3+": "At this point, I decide to check him in order to capture his free pawn, with Rxa3.",
        "33. Kf2 Rxa3 34. Kg2": "I do not know what he was thinking when he moved the king because he was not in check.",
        "34... Ra4": "I played Ra4 in order to capture his free pawn, later in the game.",
        "35. Kh3": "I do not know the logic behind Kh3.",
        "35... f5": "At this point, I play f5 in order to force a series of exchanges with exf5, exf5, gxf5, and Rxb4.",
        "36. exf5 exf5 37. gxf5 Rxb4 38. f6": "Now, he plays f6 in another attempt to get a pawn promotion, but, unlike my game against anitam, I do not let this happen. ",
        "38... Rf4": "I play Rf4 in order to prevent him from getting the promotion.",
        "39. f7": "He still is determined to get the promotion and probably does not see my rook or thinks that he could slip away, but I do not have a nonchalant attitude about this. ",
        "39... Rxf7": "Therefore, I capture his pawn with Rxf7.",
        "40. Kg2": "Now, all he can do is move his king, and he continues to do this in his attempt to capture my pawn.  However, I make sure that he cannot do this.  ",
        "40... Re7": "For example, he played Kg2 earlier in his attempt to play Kxe5, but I respond with Re7 to protect the pawn on e5.",
        "41. Kf2 a5": "I could have played e5 and would have still gotten the promotion, but I play a5 in order to trick him and make it difficult for him to tell what pawn I would promote.  ",
        "42. Ke2": "Now he is more determined to capture the pawn, but he knows that he cannot make the capture on the e square because of my rook.  Therefore, he is trying to capture my pawns on the b square followed by the a square, but I am not about to let this happen.",
        "42... a4": "I now play a4 because he could no longer play Kxa4, at the current moment because of my other pawn on b5.",
        "43. Kd2": "Now, he is trying to trick me, I am not going to be fooled by that.",
        "43... b4": "I decide to play b4 because it brings me one step closer to getting the promotion.",
        "44. Kc2": "I do not know why played Kc2 instead of Kd3.  Kd3 might have allowed him to capture a free pawn with Kxb4, in the long run.  Now, he is going to be checked with b3+, and there is nothing he can do about that because the possibility of capturing my pawn Kxb3 is now gone since the other pawn is on a4.  The only thing he can do, at this point, is run away from danger, with Kb2 or Kc3. ",
        "44... b3+ 45. Kb2 e4": "At this point, I do not check him again with a3+ because this would allow him to capture a free pawn with Kxb3, followed by another free pawn with Kxa3 or Kxa2.  Instead, I decide to play e4, and I know that he cannot capture my pawn on the e square because of my rook on e7.  That way, he is unable to capture my pawn on b4, as well as, e4.   ",
        "46. Ka3": "In this position, he threatens to play Kxa3 and capture a free pawn, but I figured that I would let him.  If he played Kxa4 I would respond with b2, and he would not be able to stop the promotion.",
        "46... Rb7": "I could have played Rb7 instead of Ra7.  That would prevent him from playing Rxa3, but I played Rb7, instead.  That way, I will be able to get the pawn promotion because he would not be able to play Kxb3, even if I had played e3 right away, and he is almost pin because his only options are Kxa4 or Kb2.   ",
        "47. Kb2": "He chose Kb2 in order to block my pawn on b3 and prevent me from checking him with a3+.",
        "47... e3": "I respond with e3 in order to trick him and put pressure on his king.",
        "48. Kc1": "He responds with Kc1 in his attempt to stop my pawn promotion, but it does not work.",
        "48... e2": "I thought he would capture my pawn with Kxb2, if I had checked him with b2+, but I forgot that he would not have been able to do this because of my rook on b7.  Since that happened, I played e2 instead of b2, but it does not matter, anyway.  That is because he would not have been checkmated right away since he would have been able to play Kc2, and I now have a pass pawn.  In this position, I will get a pawn promotion, and there is nothing he could do about that.",
        "49. Kd2": "He plays Kd2 hoping that I will not get the promotion.",
        "49... Re7": "I respond with Re7, to protect my pawn on e2.",
        "50. Ke1": "He now plays Ke1 in his last minute attempt to stop the promotion, but that does not work. ",
        "50... b2": "I respond with b2, so there is nothing he could do to stop the promotion, in this position, because it is now inevitable. ",
        "51. Kd2": "His only choices are now Kf2 or Kd2 because he cannot move his king anywhere else.",
        "51... b1=Q": "I just got a pawn promotion here.",
        "52. Kc3": "In this position, his only choice was Kc3 because he could not move anywhere else since my rook is on e7, and my promoted queen is on b1.",
        "52... e1=Q+": "At this point, I got another pawn promotion with, and I directly checked him with it.",
        "53. Kc4 a3": "At this point, I was thinking about promoting, yet another pawn which is why I played a3, but I quickly realized that I could mate him without a third promotion.  In addition, a third pawn might directly lead to a stalemate because the king might only be safe in the same spot but nowhere else.  Therefore, I do not bother with a2 followed by a1=Q.  ",
        "54. Kc5": "Because he is nervous, he pulls his king back with Kc5, as opposed to Kd4, but that is not a problem either.",
        "54... Qbb4+": "At this point, I find a forced mating pattern, so I check him with Qbb4+ and force him to play Kd5.",
        "55. Kd5 Qe5+": "Now, I check him again with Qe5+ and force him to play Kc6.",
        "56. Kc6": "Now, I have him just where I want him.",
        "56... Qbd6#": "That is because I culminate him into and force a checkmate with Qbd6#.  I learned something interesting in this game because it was contrary to my game against amnita.  I learned that one game could make a person play better in the next game.  That is because one game is supposed to be a learning experience, even it is rated and not a coaching game.  Until this game, I thought that it required a coaching game or a series of bad games to learn from previous mistakes."
    },
    "url": "https://gameknot.com/annotation.pl/team-match?gm=41571",
    "gameName": "Team match",
    "players": "gocats (1052) vs. jkarp (983)",
    "opening": "French defence (C00)"
}