{
    "moves": {
        "1. e4 e5 2. Nf3 Nc6 3. d4 exd4 4. Bc4 Nf6": "In my opinion the most interesting variant of the Scottish Gambit from black's perspective. Unfortunately for me, this line has not been played all that often against me, so I was kind of uncertain of my play in the middle game.",
        "5. O-O Nxe4 6. Re1 d5 7. Bxd5 Qxd5 8. Nc3": "The point behind all the sacrifices: the white knight is untouchable because of several pins, so the black knight on e4 is lost. ",
        "8... Qa5 9. Nxe4": "Better than Rxe4, since the pawn on d4 can be poisonous for a while and having to block the way back for the rook on the next move with Ne2 or playing Nb1 both seem very uncomfortable.",
        "9... Be6 10. Neg5": "Putting pressure on the e-file immediately",
        "10... O-O-O": "Preventing a pawn loss with 10....Qe5 is problematic because of 11. Nxf7 Kxf7 12. Ng5 and 10...Qf5 allows 11. Nxd4",
        "11. Nxe6 fxe6 12. Rxe6 Bd6 13. Bg5 Rde8 14. Qe2": "As black will demonstrate, this leads to a forced exchange of two rooks vs a queen. Qd1 was likely a bit better",
        "14... Kd7 15. Re1": "Seems like the only option.",
        "15... Qxe1+ 16. Nxe1": "This allows the queen to come out actively at least.",
        "16... Rxe6 17. Qg4 Rhe8 18. f4": "Aiming for f5-f6. While black can rather easily prevent this threat, it also creates a fast lane for my king and allows my knight to develop behind the f-pawn, rather than blocking it.",
        "18... h6": "This move allows me to cover my knight for free. While I end up not using that to my advantage, playing Kc8 directly may have been a bit better.",
        "19. Bh4 Kc8 20. Nf3": "I didn't really want to trade two pieces for a rook here, but 20. f5 Rxe1 21. Bxe1 Rxe1 22. Kf2 actually creates a rather dangerous situation for black, as I will look to play f6 on the next turn winning the g-pawn and creating a passed pawn that is quite far advanced. Black will still have a lot of play in that position, but I feel like I may have had a bit more chances in that line than the cautious one I took.",
        "20... g6": "solving the issue with the f-pawn.",
        "21. Bf2 Kb8": "freeing up his rooks which can now finally start demolishing me.",
        "22. Bxd4 Nxd4 23. Nxd4 Bc5 24. c3 Bxd4+ 25. cxd4": "After the exchange, the pair of rooks seems even more dangerous than before, but what else was I supposed to do?",
        "25... Rd6 26. g3": "covering f4, so that g6 may be taken after Rxd4, but it may have been better to allow all that, as I would get to take h6 anyways. Instead, h4 seems like a reasonable option, looking to play h5 next, which creates some opportunities for my pawns on the king side to become dangerous.",
        "26... b6 27. Kf2 Re4": "taking on d5 without giving up g6",
        "28. d5": "forcing the rook off the e-file, which gives my king a bit of space.",
        "28... Rd4 29. Ke3 Rd4xd5 30. h4 h5": "emphasizing another problem that the earlier move g3 created. The queen is now forced back strongly.",
        "31. Qh3 Rd5d2 32. f5": "further attempting to gain some counter play through my pawn majority on the KS",
        "32... Rxb2 33. Qf1 Rxa2": "But black is not at all concerned, already seeing how he can deminish my threats. Meanwhile, he has cleaned up my QS meaning that he as overwhelming threats once my pesky pawns are dealt with.",
        "34. f6 Ra5": "excellent move that I had not considered. 35. f7 is now prevented, as black will play 35...Re5, forcing the king to the f-file, which means the queen is lost.",
        "35. Ke4": "preventing the nightmare scenario described above, but now black has enough time to pick up the pawn.",
        "35... Re6+": "This move even removes the option of a desperado 35....Rf5 36. Qxf5 xf5 37. Kxf5, which might give white some sort of chance to promote a pawn.",
        "36. Kd4 Rf5 37. Qc4 Rexf6 38. Qg8+ Kb7 39. Ke4 a5 40. Qc4 Rc6 41. Qb3 Rcc5 42. Kd4": "Most of white's moves already didn't really have a clear plan behind them any more and mostly played to some sort of misstep that would allow to pick up a pawn or something like that, but now the curtain definitely falls.",
        "42... Rcd5+ 43. Ke4 Rde5+ 44. Kd4 c5+": "Forcing the king on the same row as the queen to play Rf3 for the win and therefore prompting the concession."
    },
    "url": "https://gameknot.com/annotation.pl/team-match-kingslayers-vs-the-white-knight?gm=57891",
    "gameName": "team match kingslayers vs the white knight",
    "players": "martenp (1866) vs. cheester (1854)",
    "opening": "Scotch gambit (C44), Dubois-Reti defence"
}