{
    "moves": {
        "1. d4 d5 2. c4": "With 2.c4, White challenges Black for the center.",
        "2... c6": "With this second move, Black looks to defend the pawn on d5 with c6, so that the pawn on the e-file does not block the way for the light-squared bishop to develop. In the main lines, White looks to dominate through the center, where Black looks to control b4 and make a later push to the e5/c5 squares. The threat of taking on c4 now carries more weight since it can be covered by b5 (which is in turn protected by c6) creating a strong, dynamic queenside pawn mass.",
        "3. Nc3": "One of the normal, developing ways to meet the Slav (the other being Nf3 which often transposes with accurate play). The third option is the exchange variation (3.cxd5 cxd5) which often results in a dry game (for pre-arranged draws).",
        "3... Nf6 4. Nf3": "Note: The immediate 4...Bf5 is a mistake due to 5.cxd5 cxd5 6.Qb3 where Black will have great difficulty defending b7. Black can only (reasonably) play Bf5 if he can keep the Queen from b3.",
        "4... dxc4": "Black has won the pawn, threatening b5 to make the gain permanent and taking the b3-square from the White Queen (making Bf5 possible). While White looks to recapture, Black will complete development. On the downside, White will gain a stronger pawn center. Other common moves include 4...e6 to play the Semi-Slav (an entirely different beast) or the increasingly popular 4...a6 (a solid and flexible subvariation).",
        "5. a4": "Not a strong developing move, but by far one of the most common replies (compared to e4/e3) looking to prevent b5. However, b4 becomes a critical weakness that Black will try to leverage.",
        "5... Bf5": "Developing the light-squared bishop (Bg4 is also possible) and looking to prevent White from achieving e4. Black can continue with an ...e6 to create a solid pawn chain without trapping the light-squared bishop in.",
        "6. e3": "White connects the pawns and frees the bishop to recapture the pawn, without commiting to a middlegame strategy, but blocking the dark-squared bishop.",
        "6... e6": "Creating a modest yet solid pawn center to free the dark-squared bishop to get to b4 if desired. The knight will go to d7 (and the bishop can stay within the triangle) to create a very strong grip over the center.",
        "7. Bxc4 Bb4": "A great square for the bishop - pinning the knight and free from threats of the a/c pawns.",
        "8. O-O Nbd7": "or (O-O). This is pretty much the traditional setup - White has recaptured the pawn and brought his King to safety to begin his plan of e4. White will try to achieve this through either Qe2 of Nh4. ",
        "9. Qe2 O-O": "Black allows the advance, hoping that the central pawns will be targets for counterplay as the center isn't entirely dynamic (d5 is prevented, e5 leaves a hole on d5.",
        "10. e4 Bg6 11. Bd3 Bh5": "With this structure, Black looks to play the pawn breaks of e5 or c5 (e5 preferred to prevent White from playing e5). This move pins the knight to the Queen to keep the threat alive.",
        "12. e5": "White calls on the threat with arguably the best move.",
        "12... Nd5": "The Black Knight jumps to the new hole, looking to exchange and solidify the pawn structure.",
        "13. Nxd5": "13.Ne4 was also possible to keep the tension higher.",
        "13... cxd5": "Recapturing with the c-pawn - White has a spatial kingside advantage, so conceding a kingside pawn majority would have been risky.",
        "14. Qe3": "Creating threats of a kingside initiative threatening Ng5.",
        "14... Be7": "Meeting the threat. The followup plans include a rook to the open c-file and repositioning the knight to a more active square.",
        "15. Bd2 Rc8 16. Rfc1": "White builds tension by contesting the c-file. There's no need for either to take at the moment.",
        "16... Nb8": "Intending Nc6.",
        "17. Ne1": "And White takes the time to reposition his knight (freeing the f-pawn).",
        "17... Nc6 18. Nc2": "The position is rich, but neither side has a definite advantage over the other. In attempt to \"kick over the chessboard\" I followed up with...",
        "18... f6": "?! Looking to generate some counterplay by increasing the piece activity. At this point, as far as I know, theory is near exhausted, so rather than play a safe and drawish move I felt I could take a risk. Initially I was looking at a way to open the f-file. Qh3 is of course thematic, looking to take the bishop. While evaluating f6?!, I noticed that I would lose the e-pawn if played (in order to meet the threat of Qh7#), but that it would be a nice square for the knight to centralise.",
        "19. Qh3 Qe8": "Protecting the bishop and giving up the pawn. There are no alternatives (g6 is met by Qxe6+, Kh8, g4)",
        "20. Qxe6+ Bf7 21. Qh3 Bg6": "Same position as before, minus a pawn.",
        "22. f4": "An attempt to push forward and strangle Black. After the game, while discussing ideas with my opponent, we came up with the clever 22. Bxg6 Qxg6 23.e6 Qe4 24.Qe3 Nd8 25.Qxe4 dxe4 26.d5 creating a pair of deadly passed pawns for White.",
        "22... Bxd3 23. Qxd3": "Some of the kingside initiative has been dissipated. ",
        "23... Qd7": "Hitting d5, e4, and the associated diagonals while connecting the rooks.",
        "24. Rce1 fxe5": "The f-file can now be opened for the rook, and e6 made safe for the knight through the exchange.",
        "25. fxe5 Nd8 26. a5 a6": "Solidifying the position first.",
        "27. Nb4 Ne6": "And now the knight has a bit more flexibility with any plans moving forward.",
        "28. Bc3": "White creates a tall-pawn to block the file.",
        "28... Nf4 29. Qd2 Qb5": "Black's position has now suddenly become much more dynamic with the potential to build threats - advanced knight, rook on the f-file, queen on the a6-f1 diagonal, and a strong (but \"hidden\") bishop.",
        "30. g3": "?? A blunder which costs the game. Kh1 was probably the best to ensure King safety.",
        "30... Nh3+": "First the Knight parks taking control of g1, f2. Note: Kg2 is met by Rf2 winning the Queen.",
        "31. Kh1": "Rf2 doesn't win the Queen here anymore, unless the Queen can be mandated to stay on the 2nd rank, which can be accomplished by deflecting the tall-pawn to concede the c-file to the other rook to get to the 2nd.",
        "31... Bxb4 32. Bxb4 Rf2 33. Qe3 Rcc2": "Threatening Rxh2#",
        "34. Qxf2 Rxf2": "And now Black is clearly winning with an impending mate.",
        "35. Bc3 Qd3": "With plans of Qf3 -> Qg2#"
    },
    "url": "https://gameknot.com/annotation.pl/team-match-dogfight-in-the-slav?gm=47382",
    "gameName": "Team match - Dogfight in the Slav",
    "players": "rednif_tap (1741) vs. tisamon (1746)",
    "opening": "QGD Slav defence, Alekhine variation (D10)"
}