{
    "moves": {
        "1. d4": "an interesting game where I am aware I didn't play as well as I could, but I felt inspired and resisting. Though, theralph won by responding calmly and logically to my assaults and my attemps to resist.",
        "1... Nf6 2. c4 c5 3. d5 d6 4. Nc3 g6 5. e4 Bg7 6. Bd3 O-O 7. h3 Nbd7 8. Nf3": "Until now, the kind of openings I like most.",
        "8... Nb6 9. O-O e6 10. Qc2 h6 11. Be3 Re8 12. Qd2 g5": "till uncertain. I feel that black has defended quite well and is not threated by white pieces turned into the king side. Though black pawns are doing well their job, Black is still underdevelopped. I though I could played on that idea.",
        "13. Nh2": "more in the defensive idea to protect g4 than to attacj with f4.",
        "13... e5": "and now f4 is obviously impossible for a while.",
        "14. b3": "freeing my knight by prohibe his to move on a4.",
        "14... Nh5 15. Rac1": "seeing an eventual movement including e5 out...",
        "15... Nf4": "And so I thought.",
        "16. Bxf4 exf4 17. Rfe1 Qe7 18. Nf3 Bd7 19. Re2 Rad8 20. Rce1": "garrison all the pieces on the center...",
        "20... g4": "... and attack.",
        "21. hxg4 Bxg4 22. Nb5 a6 23. Na3": "may sound crazy but I had that in mind to protect d4-e3",
        "23... Be5 24. Nc2 Kh7 25. Nxe5": "now, if Bxe2, then Nxf7 and there is some kind of equivalence.",
        "25... Qxe5 26. f3 Bh5 27. Kf2": "g column is open: my king has to leave it.",
        "27... Reg8 28. Rh1 Qg5": "Here the queen attacks my king, but has black seen what he left to white?",
        "29. Kf1": "g2 and f3 are well defended. ",
        "29... Rd7 30. e5+": "entering the castle.",
        "30... Bg6 31. e6": "now, if fxe, then Rxe6 is turning interesting, though not decisive. I have hesitated in that case with dxe. There was also the weakness f4 (good attacker, but bad defender).",
        "31... Re7 32. exf7 Rxf7": "of course not Kxe2, because of fxg=Q and white has a rook more.",
        "33. Re6": "looks like I should have asked for draw here.",
        "33... Rf6 34. Re7+ Rg7 35. Rxg7+ Kxg7 36. Ne1 Nd7 37. Bxg6 Qxg6 38. Rh4": "here is my fatal mistake. I though I had f4 well for me... I forgot my queen was not defended.",
        "38... Ne5 39. Rxf4 Qg5 40. g3 Ng6 41. Nd3 Nxf4 42. Nxf4 Kf7": "of course not Qxg3... I guess you see why.",
        "43. Qf2": "now it will be a fight for the draw.",
        "43... b5": "did i have to let my pawns line broken? Actually I had very few choices...",
        "44. Qe1 Qf5 45. Qe2 Qg5 46. Kf2 h5": "all very tactical moves... boring, in appearance, but a single move could have been fatal.",
        "47. Ne6 Qf5 48. f4 Kg6 49. Kg2 bxc4 50. bxc4 a5": "My queen is overwhelmed by his queen threats. On the other side, I hoped for a fatal move by him to fall into my knight's trap. Never came...",
        "51. Kh2 Qg4": "Change? No, no, I can't: the rook can move too fast for my poor knight: there are two columns to defend, and potentially a third one o h column... impossible.",
        "52. Qe4+ Kh6 53. Ng5": "trying to bloch his queen and pointing h7 mate. Of course i did not expect a win here.",
        "53... Qd7": "best defense.",
        "54. Qe2 Qg7 55. Ne6 Qg8 56. Qd2 Qg4 57. a4": "there is nothing to expect from f5... But though I made a mistake here. I should have played back ny knight on g5.",
        "57... Kg6 58. Qd3+": "not very clever.",
        "58... Qf5 59. Qc3": "another stupid move... now black queen is coming in.",
        "59... Qe4 60. Ng5 Qe2+ 61. Kh3": "If Kh1, then Qd1+ and falls a4.",
        "61... Rxf4": "hello surprises! Excellent move!",
        "62. gxf4 Qg4+ 63. Kh2 Qxf4+ 64. Kh1 Kxg5": "the rook was well invested.",
        "65. Qg7+": "no more hope, so accumulating the mistakes...",
        "65... Kf5 66. Qh7+ Ke5": "there is nothing more here: c4 will fall, though h5 is ready to fall too, it is only a matter of time to see all my pawns eaten by... the king, and probably a quick exchange of queens that will be doubly fatal. Congratulations to theralph."
    },
    "url": "https://gameknot.com/annotation.pl/team-match?gm=37790",
    "gameName": "Team match",
    "players": "thitho (1661) vs. theralph (1727)",
    "opening": "Benoni defence, Hromodka system (A56)"
}