{
    "moves": {
        "1. e4 d5": "Scandinavian (centre counter) defence (B01)",
        "2. exd5": "Scandinavian defence, Lasker variation (B01)",
        "2... Qxd5 3. Nc3 Qd8 4. Bc4 Nf6 5. d3 e6 6. Nf3 h6": "Här lämnar svart Scandinavian defence, Lasker variation (B01). 6...Be7 hade varit i den linjen",
        "7. O-O Nc6 8. Bf4 a6": "Här tänkte jag först parera vits S med h3, men det är inte så bråttom med den paraden. Dessutom kan vit sätta min L på c4 i knipa genom att göra b5. Min L måste kunna retirera, så draget blir därefter.",
        "9. d4 b5 10. Bd3 Nxd4": "När jag slår hans S på d4, så kan vi hoppas på att han slår min S med D. Då slår jag med L på b5 och schackar. När han sedan säkrar K så kniper jag D.",
        "11. Nxd4 b4": "OK, då kör jag med ett mothot på f7 mot hans T.",
        "12. Qf3": "Sätter min D i spel, och öppnar upp för kombinationer. Slår han min S på c3 så slår jag hans T på a8. Säkrar han T så säkrar jag S.",
        "12... Rb8 13. Nc6": "Justja, höll på att missa denna finfina gaffel tidigare. Men så länge man upptäcker möjligheterna i tid, så är man på säker mark.",
        "13... Bb7": "Han parerar smart, så vi tar en bonde under tiden.",
        "14. Bxa6": "Avleder samtidigt L, men sannolikt slår han min S på c6 och då slår jag med D på c6 och schackar.",
        "14... Bxa6": "Avledningen gick hem, så jag tar hans D. Sedan slår han förmodligen mitt T med L.",
        "15. Nxd8": "Slår han S med T så går jag med D till c6+ och sedan tar jag hans L. Slår han S med K så säkrar jag f-T till d1+, efter K till c7 så säkrar jag S till e4.",
        "15... Bxf1": "Finemang, han kunde motstå frestelsen att knipa mitt T. Då har jag en manöver som återger mig en hel del material, från att schacka med D på c6.",
        "16. Qc6+": "Slår han S med K, så slår jag bonden på c7 och kungsgafflar med T.",
        "16... Ke7": "Här har jag lite bråttom, för T till d1 hade skurit av svarts K bättre. Men jag spelar godkänt med D till c7+",
        "17. Qxc7+": "Han kommer säkert att parera T med S till d7, men då kungsgafflar jag  på c6.",
        "17... Nd7": "Som förväntat, och jag har lite bråttom igen. Här hade S till d5 varit starkare, eftersom det hade tvingat hans K att fly till f6 och blivit mer inträngd.",
        "18. Nc6+": "Materiellt tänkt, men OK som drag.",
        "18... Kf6": "Nu flyr svarts K till f6 iaf, men jag är sugen på hans T. Spelar materiellt igen med S.",
        "19. Nxb8 Nxb8": "Här vinner jag mer tempo på att schacka med S på e4, så jag hejdar mitt materiella tänkande en stund.",
        "20. Ne4+": "Försöker han dubbelhota med K på f5, så går jag bara upp med D och schackar på e5. Det tränger honom längre in mot h-kanten.",
        "20... Kg6": "Han viker undan, så jag passar på att knipa hans L. Här är det befogat med en sådan manöver.",
        "21. Kxf1 Na6": "En rad alternativ står till buds, men jag väljer att skära av diagonalen d8-h4.",
        "22. Qd8": "Backar han eller går han till h5 ?",
        "22... Kh7": "Han backar till h7, och skyddar samtidigt sitt T om han skulle vilja aktivera L. Här hade antagligen D till d3 varit bäst först och sedan S-manövern, men jag valde S-manövern först.",
        "23. Nd6": "Slår han med L, så slår jag tillbaka med D. Går han upp med g5, så slår jag antingen med S mot f7 eller så säkrar jag L på e3.\n",
        "23... g5 24. Nxf7": "* Här gav svart upp kampen. En aning för tidigt dock, för jag kunde inte se någon direkt matt inom de närmsta 5 dragen iaf."
    },
    "url": "https://gameknot.com/annotation.pl/team-match?gm=29059",
    "gameName": "Team match",
    "players": "chekof (1256) vs. majicdragon (1350)",
    "opening": "Scandinavian defence, Lasker variation (B01)"
}