{
    "moves": {
        "1. d4 d5 2. Nc3": "2. Nc3  is a bit unusual. Most people don't block the c pawn in a Queens pawn opening.\r\n\r\n",
        "2... Nf6 3. e3": "3. e3 this is a passive move for what to adopt, locking in the black bishop.  But not bad, per se.\r\n\r\n",
        "3... a6": "3. ... e6 there is no reason for this move, and it gives up valuable time.  He should be developing, in preparation for a fight for the center.\r\n",
        "4. Nf3 Nc6 5. a3": "5. a3 passive, does little.  I suppose you want to avoid a pin, but your bishop could deal with an such pin if it occurred.  The bishop really has nothing else to do anyway, since you have locked him in.\r\n\r\n",
        "5... Bg4 6. h3 Bh5 7. Be2 e6 8. Qd3": "8. Qd3 is a bit hard to justify since it is natural for his white bishop to oppose.\r\n\r\n",
        "8... Be7 9. O-O h6": "9. ... h6 A useless, weaking move.\r\n\r\n",
        "10. Nh2": "10. Nh2 I dunno about this.  I see what you are doing, but I don't like it that that Knight might end up being left out of play down here.\r\n\r\n",
        "10... Bg6 11. Qd1 O-O 12. f4 Bd6 13. Bd2 Ne7 14. Bg4": "14. Bg4 This move surprised me, not sure if it's any good.  Invites him to exchange a Knight for the Bishop... sometimes that is a good idea, sometimes not.  I suppose Bg4 is ok.  You are at least sticking to your theme of trying to prepare to push f5 i suppose.\r\n\r\n",
        "14... b5": "14. ... b5  He plays a good move here.  He wants to dislodge your knight because he realizes that the fight for the hole at e4 might become important.\r\n\r\n",
        "15. b4": "15. b4 And so, to keep the ability to observe e4, this is a good move.\r\n\r\n",
        "15... Nc8": "15. ... Nc8 He wants to play in the hole at c4.  This does allow the f5 push, if you wanted it, which could be probably folllowed up with an e4 push.  That might be a laudable goal for you at this point and would be consistent with your previous play.\r\n\r\n",
        "16. Rc1": "16. Rc1  Instead you play this meaningless pos move.  Why? :)\r\n\r\n",
        "16... Nxg4 17. Qxg4": "17. Qxg4  Really?  The Knight was the natural reply, even the pawn was a better take.\r\n\r\n",
        "17... Bf5 18. Qf3 c6": "18. ... c6  This looked like a pointless move at first, but then I noticed you were threating Nxd5.  Nonetheless, he'd have done better to play his Knight up to b6, that was the idea anyhow.\r\n\r\n",
        "19. Qf2": "10. Qf2 No idea what your plan is here. :)",
        "19... Nb6 20. Be1 Nc4 21. Ra1 Bxc2 22. Ng4": "22. Ng4 With the kinda locked position and no open files, I might have gone for the trade of Rook and pawn for a Knight and Bishop.\r\n\r\n",
        "22... Bd3 23. Ne2 f5 24. Ra2 Ra7 25. Ne5 Nxe5": "25. ... Nxe5 I think taking with the bishop would have been much better for him.\r\n\r\n",
        "26. fxe5 Be7 27. g3": "27. g3 Baffles me. :)\r\n\r\n",
        "27... g5 28. Kh2 Kh7 29. Rg1 Rg8 30. g4 f4": "30. ... f4 Questionable move.  pxp might be preferable.  But he is trying to get play for his dark squared bishop that he should have traded off when he had the chance and also wanting to avoid giving you a passed pawn.\r\n\r\n",
        "31. exf4 Rf8 32. Qg3 Bb1 33. Rb2 Be4 34. Rf1 a5": "34. ... a5 Very good move for him.  he needs to rearrange his pieces to cover the opening file, get his other rook abe to play.  This means moving his Q or B, and the a5 move gives him chances to do it.\r\n\r\n",
        "35. Nc3": "35 Nc3 This is a good move.  You hope to play NxB and make way for a pawn push to f5, probably securing at least one passed pawn.\r\n\r\n",
        "35... axb4": "34. ... axb4  I like B g6 better than this.\r\n\r\n",
        "36. Nxe4 Rxa3 37. Rb3": "37. Rb3 I dunno... I kind of expected Qg2 here.\r\n\r\n",
        "37... dxe4 38. Rxa3 bxa3": "38. ... bxa3 He now has 2 connected passed pawns.  He should be playing to go to end game ASAP to realize this advantage.  He has a probable won position here.\r\n\r\n\r\n\r\n",
        "39. Rf2 Qxd4 40. fxg5": "40. fxg5 This is a good idea on general principals, you need counter play.  This opens things up to allow it.  unfortunately, it plays right into his hand, assuming he does as much trade off as  possible.\r\n\r\n",
        "40... Rxf2+ 41. Qxf2 Qxe5+": "41. ... Qxe5+  Few C players can pass up a free check with the gain of material at the same time.  Nonetheless, QxQ and he has an endgame that almost plays itself.  Two connectd passed pawns are pretty much worth a piece.  Now of course, he has 3 connected passed pawns.  I can understand the allure of this move.  However, he opens the door for counter-play, not a wise thing.\r\n\r\n",
        "42. Kg2 e3": "42. ... e3 The loosing move, and you know why.  Even axg here would have preserved a probable winning position, but ugly with all the open lines, exposed King and Queens on the board.\r\n\r\n",
        "43. Qf7+": "43. Qf7+  The start of your pretty, forcing 3 move combination that gains the full point.  Nicely done this.",
        "43... Qg7 44. g6+ Kh8 45. Bc3": ""
    },
    "url": "https://gameknot.com/annotation.pl/team-match?gm=51771",
    "gameName": "Team match",
    "players": "asdfking (1467) vs. nikosbo (1476)",
    "opening": "Blackmar-Diemer gambit (D00)"
}