{
    "moves": {
        "1. e4 e5 2. Nf3 d6": "Philidor defence.",
        "3. Bc4 h6": "Mayby little too passive by black. It appears that he is defensive player, It's your initiative now, white.\r\n\r\nInteresting line goes with 3..Nd7",
        "4. Nc3 Nf6 5. Nh4": "5.Nh4?!     White knight was in better square in f3 , early move like this with no backup is dangerous, white has no good squares to move into either.  This is tactical loss as well as positional since if black does now . 5...Nxe4! 6.Nxe4 6...Qxh5\r\n\r\nThis is positional mistake also because now it s dangerous to castle kingside since ..g5 thread\r\n\r\nBetter try is 5.0-0 or moving d pawn.",
        "5... Be7 6. Nf5": "Moved three times same knight before move 7. now that is a bad sign. if black now captures with bishop 6...Bxf5 you will notice that you have spent  3 whole moves moving your knight, yet black can capture it in one move.",
        "6... a6": "6...a6??",
        "7. Nxg7+ Kf8 8. Nh5 Bg4 9. Be2 Bxe2 10. Qxe2 Nc6 11. Nxf6 Bxf6 12. Qh5 Nd4 13. O-O": "Kd1 seems logical too, though not so obvious.",
        "13... Nxc2 14. Rb1 Nd4": "Black knight has nothing to fear, shouldnt waste moves like that, instead, building rooks on g file would be a good plan for black at the moment.",
        "15. d3": "Finally opening a way for bishop. Though Bx h3 looks dangerous, but f file can be opened now.",
        "15... Bg7": "15...Ke8!? sacrificing pawn which blocks the way to enemy king is not bad idea, also pins white bishop.",
        "16. f4": "A good plan.",
        "16... exf4 17. Bxf4 f6 18. Nd5": "Good!, now you have brought all your resources in the frontline, its time to think about tactical possibilities here, even sacrifices.",
        "18... Ne6": "In a matter, Ne6 makes a lot of sense, he wants to get rid of your bishop here and trade all of his pieces, blacks position, however, was quite ruined already so I dont think any line here would do any good for black.\r\n\r\nBut here, white should see the pin and sacrifice by 19.Nxf6!. this sac is quite sound . For example if 19...Nxf4 20.Rxf4 20...Bxf6 , you can easily summon your second rook to platy and you win your material back with all extras.\r\n\r\nThere's nothing good really left for black, \r\n\r\nif Black tries to escape the pin by 18...Kg8 the same sacrifice is possible, but only after moving your bishop away by Be3 (not allowing queen to take) and the sacrifice.      (19.Be3! 19...Ne6 20.Nxf6 20...Bxf6 21. Qg6! and double thread)",
        "19. Qg6 c6 20. Bxd6+": "20.Bxd6! nice move.",
        "20... Qxd6 21. Nxf6": "Here White missed the first prize, the forcing 21.Rxf6! 21...BxF6 22.Qxf6 \r\n\r\n22...Kg8 23.Ne7  mate in two or Knight for Queen.\r\n22...Ke8 for free rooks.",
        "21... Ke7 22. Nh5 Rhg8": "I think black should make is A rook active in here.",
        "23. Rf7+ Kd8 24. Nxg7 Qd4+ 25. Kh1 Nxg7 26. Qh7 Re8 27. Rxg7 Qxd3 28. Rc1": "Blacks advantages: Backrank mate thread and easily teasable Rook on C1.\r\nWhites advantages: 7th rank, proves to be better here besides black has a bad rook.",
        "28... Rb8": "This move is a waste, instead Qd2! forcing to make inactive rook and protecting the mate at D7",
        "29. Qf5 Qxe4": "Poisoned pawn.",
        "30. Rd1+": "Qd7!! mate.  Safe moves are quite understantable reaction though. Always aim for the best.",
        "30... Qd5 31. Rxd5+ cxd5 32. Qxd5+ Kc8 33. Qd7#": "1-0"
    },
    "url": "https://gameknot.com/annotation.pl/team-match?gm=10692",
    "gameName": "Team match",
    "players": "kitesurferx (1446) vs. otto_glasgi (1454)",
    "opening": "Philidor (C41), Steinitz variation"
}