{
    "moves": {
        "1. e4 c6": "Here's a game that seems tense and all bottled up, until a sacrifice (that was almost missed) changes everything.",
        "2. d4 d5 3. Nc3 dxe4 4. Nxe4 Nf6 5. Nxf6+ gxf6": "I learned the Caro-Kann back in the 80s because of this variation. But other variations gained favor, and I never got to use this in tournaments. Fortunately, I've had a couple of opportunities with GK.",
        "6. c3 Bf5": "That's an uncommon move. I expect White to develop his kingside pieces, play c4 to hold the center, and develop his QB.",
        "7. Nf3 Nd7 8. Bf4 Nb6": "Black usually castles queenside and has his rooks on d8 to help keep white off of d5 and on g8 to attack the castled king.",
        "9. Be2 Qd7 10. Qb3 e6 11. O-O-O": "Usually White doesn't castle queenside in this variation, and you have massive attacks as each side throws pawns at the other's castled position. I'm thinking this may be a more careful game than you usually get in this variation since we'll both have somewhat exposed kings.",
        "11... Bd6 12. Bh6": "I thought he'd trade instead of giving me that diagonal for my bishop. I don't think that's such a strong spot for his bishop, because Bg7 is easily thwarted.",
        "12... Nd5": "I usually don't get to put my knight there (because of a pawn on c4).",
        "13. g3": "My threat was Bf4+. After he takes the bishop and I play Nf4, his bishop would have to retreat to f1.",
        "13... a5": "I started thinking that with my mass of pawns in the middle, my king might just be safer there. I'm thinking of moving up to e7 and sending both rooks over to the queenside at him.",
        "14. Bd3 a4": "I hadn't decided if I want the bishop. But I can continue with this plan for another move.",
        "15. Qc2 Bg4 16. Be2 Bf5": "He has to decide whether he wants a draw from repetition. I might go for it if he does.",
        "17. Qd2": "But he decides that he wants to beat me ... I think he was higher rated than i was, and he's white, so I can understand that.",
        "17... a3": "But I think this is going to be hard on him. I don't see how he can take it and let my bishop and rook in to attack the king.",
        "18. b3": "But now he has a weak pawn on c3 and a thorn on a3 that won't be easy to eliminate.",
        "18... b5": "One was good, so two will be better.",
        "19. Nh4 Be4": "My other choice is Bg6. I expect him to play f3 and then I'll play Bg6. The advantage of playing Be4 first is that after he plays f3, he won't be able to put his bishop there. If I play Bg3 immediately, I think his best move is Bf3 to try and get rid of my knight. And I need it there at least one more move.",
        "20. f3 Bg6 21. Nxg6 hxg6 22. Be3 b4 23. c4 Nc3": "But now I've build a nice spot for my invader, and getting him out isn't so easy.",
        "24. Rde1 e5": "I figure that I have to keep attacking. Eventually, he'll move the queen and play Bd2. Then I'll either have to have a new safe square for the knight, or I'll have to trade for his bishop. But what I gain is more initiative. He has to deal with chasing away the knight, and while he has to move his pieces to worse spots to do that, I can be moving mine to better.",
        "25. Bd3": "He prevents me from playing e4.",
        "25... O-O-O": "And now I decide to castle. The a and b-files got clogged up, and my king feels relatively safe, so I decide to relocate that rook to a file where there's so more action.",
        "26. c5 Bc7 27. Ba6+ Kb8 28. dxe5": "I'm going to get to play Bxe5 soon enough, but my goal is to go ahead.\n",
        "28... Qxd2+ 29. Bxd2 Nxa2+ 30. Kc2 Bxe5 31. Bc4": "I was planning to play Rd7. That's what I'd written down that I was going to do in my notes to myself. The next day, I looked at it again, and it still looked like the best move -- and I would follow it up with Nc3.\n \nThe next day I moved Rd7 ... except I didn't press Submit. Instead, I found the winning move.",
        "31... Rxd2+ 32. Kxd2 Bc3+ 33. Kd3 Rd8+": "He has two bad choices now. if he plays Kc2, it leads to a checkmate after Rd2+.",
        "34. Ke2": "And this direction leads to being down by a queen.",
        "34... Re8+": "After he moves the king, I trade the bishop and rook for both rooks, move the knight to c3, and queen the pawn that he can't reach.\n \nAnd I was very close to missing the combination."
    },
    "url": "https://gameknot.com/annotation.pl/team-match?gm=23241",
    "gameName": "Team match",
    "players": "mikkorepo (1895) vs. chuckbo (1913)",
    "opening": "Caro-Kann (B16), Bronstein-Larsen variation"
}