{
    "moves": {
        "1. e4": "This gets wild in a hurry. I usually don't fasten my seat belt till at least a half dozen moves",
        "1... e5": "I have no clue how to open as black. This seems safe enough. Someday I'm gonna have to learn some good opening moves",
        "2. Qh5": "What's that all about? This guy looks serious",
        "2... Qe7": "Better get serious also",
        "3. d4": "At this stage I had no idea how to proceed. Both bishops are free to attack and queen looking very menacing. With me nothing going on. ",
        "3... exd4": "Had to.  Anything else leaves him too strong",
        "4. Bd3 h6": "Trying to slow down black bishop from getting into the fray",
        "5. Bf4": "Things seem to be going downhill quickly",
        "5... g6 6. Qd5": "This guy's relentless",
        "6... c5": "Things looking up slightly with strong center developing",
        "7. Na3 Nf6": "Finally something for him to think about",
        "8. Qc4 d5 9. Qb5+ Qd7": "Please trade and get out of my kitchen.",
        "10. Be5 Bg7 11. Qxc5": "Relentless!",
        "11... Nxe4 12. Qxd4 O-O 13. Bxg7": "Looking pretty bad again. Must keep attacking",
        "13... Nc6 14. Qe3 Kxg7": "The game is on. Finally some breathing room. My dev't is perhaps even better.",
        "15. Bxe4 dxe4 16. Rd1": "Perhaps castling would have been better",
        "16... Qe7 17. Ne2 Rd8 18. Nc3 Rxd1+ 19. Nxd1": "? Maybe better captured with King. Anyway glad to finally see some retreat.",
        "19... f5": "The eventual winning pawn surge begins.",
        "20. O-O": "Finally",
        "20... Be6": "Freeing the rook while attacking unprotected pawn",
        "21. c4 b6": "The pawns are gonna have to protects themselves, everbody else is going to war soon",
        "22. Nc3 Nb4 23. Qe2 Rd8 24. Nc2 Nxc2 25. Qxc2 Bxc4": "Finally my nose in front a point, with dev't ripe with possibilities.",
        "26. Re1 Qd7 27. b3 Ba6 28. Rd1": " would love to trade the big guns off and waltz in the end zone with a pawn.",
        "28... Qc7 29. Rxd8 Qxd8": "So far so good.",
        "30. Ne2": "Yes, this is indeed looking promising.",
        "30... Bxe2 31. Qxe2 Qd3": "Please take me!!",
        "32. Qe1": "Too smart",
        "32... f4": "I'm beginning to like my chances",
        "33. g3 g5": "This move took awhile to to figure out. There were tons of other possibilities, but it was probably the decisive move that sealed the deal.",
        "34. Qa1+": "Expected but no real threat",
        "34... Kg6 35. b4": "Not sure why. Probably nothing better.    ",
        "35... e3": "Earlier pawn move looking better all the time. Should'nt be much longer.",
        "36. f3 e2 37. Kf2 Qe3+": "Oh! those lovely lowly pawns.",
        "38. Ke1 Qg1+": "\r\nBallgame! Now I know why people don't get wild with their queen early. Thanks Mojawi for an exciting game from the get-go"
    },
    "url": "https://gameknot.com/annotation.pl/team-match-queen-on-the-loose?gm=2352",
    "gameName": "Team match - Queen on the loose",
    "players": "mojawi (1270) vs. wildpops1000 (1265)",
    "opening": "KP (C20), Patzer opening"
}