{
    "moves": {
        "1. e4": "E4 or d4 are my only choices as White. I am comfortable with either and do take time to look into the history of my opponent to see which way to go. ",
        "1... e5": "Black is trying the Ruy Lopez against me. I have a surprise since I learned chess from my father who won every time I tried the Ruy. ",
        "2. f4": "The King's Gambit. ",
        "2... exf4": "The King's Gambit Accepted. ",
        "3. Nf3": "This is my favorite although I could have done Bc4....",
        "3... g5": "Black really has to either come up with an attack or defend that f4 pawn (and counter attack). Black is doing what I usually did against my dad back in the 1960s when he taught me chess. This is a good move for Black but it doesn't really stop the pacing of White to really come on strong....",
        "4. h4": "The King Side attack is the whole idea with the King's Gambit. Get an attack going fast on the King Side and worry about the (your White King) King later. There are measures in the King's Gambit you can take to protect your White King should this attack be subdued....",
        "4... g4": "This is a usual move by Black to try and upset the King Side attack....",
        "5. Ne5": "I would consider Black to have two \"passed pawns\" before I jumped. I always thought a pawn crossed over the center line was \"passed\" (at least it was \"passed\" in my days with my dad who taught me chess). \n\nHowever, my knight that has to move is conveniently set to move again to e5....",
        "5... Nf6": "Black moves to develop and defend g4.",
        "6. Bc4": "I apply pressure to the f7 Black pawn. It is a standard King's Gambit practice...\nYou can see why, right? It really upsets things down in Black's King Side area....and King! \nThe King's Gambit is an Attack instead of a slow moving game that a Ruy will do to an end game. \nThis is why I don't use the Ruy Lopez.  My dad taught me not to use that defense against e4. I then learned Sicilian and Caro-Kann and Alekhine's instead to deal with e4. I became biased against the Ruy Lopez. I am still biased to this day even though I have used it a couple of times here just to see if it is really as good as others say (and do what) it is. ",
        "6... d5": "This means I do have to stack pawns. Using the bishop is not correct. Also, remember the King Side is very busy right now! ",
        "7. exd5": "I want that bishop in line with the f7 Black pawn straight into the 0-0 area. ",
        "7... Bd6": "Black is blocking and putting forth pressure on my e5 Knight.  What shall I do to make things a bit more saucy around here (in the King's Gambit you can easily make things more sparky or fiery or explosive...)?",
        "8. d4": "I push a pawn into the fray that is rapidly getting complicated. ",
        "8... Nh5": "His passed pawns (as I understood it in the 60s from my dad) are targets for the King Side attack. ",
        "9. Bb5+": "Time to shift the attack to threaten the Black King...",
        "9... Kf8": "Black knows castling on King Side ain't gonna happen...",
        "10. Nxg4": "He takes my Knight if he wants and my Queen is ready.....",
        "10... Ng3": "So down comes his Knight...",
        "11. Rg1": "My rook is limited but useful in the King's Gambit...",
        "11... Qe7+": "This doesn't really change much.  I just put the Knight back to...",
        "12. Ne5": "...e5! (see the wickedness of the King's Gambit?)",
        "12... f6": "Applying pressure to make my King stay in the line of fire...however, more wickedness (in knowing the King's Gambit positions for the King Side attack) is in store....",
        "13. Bxf4": "Thusly. ",
        "13... fxe5": "Black's King and Queen are subject to my Queen Bishop (dark square). Which is best? The Black King is under cross fire from both bishops at a single move; but, so is Black's Queen and that Queen I want to suppress instead of trying a game of \"chasing the King\" with cost....",
        "14. Bg5": "So I suppress her by making her move necessarily in a confined situation. ",
        "14... Qf7": "She tries to find the best confined space and threat....",
        "15. Nc3": "I know it's a stacked pawn but it is worth developing and defending it....",
        "15... e4": "Black decides e4 to move ahead...",
        "16. Bh6+": "I decide to check...",
        "16... Kg8": "He had only two choices to move the King here. He chose this...",
        "17. Qd2": "I want that h6 bishop fixed in place with back-up to keep Black's King in one place. I have the time to do it. ",
        "17... Bf5": "The analysis of this move by Black says it's a mistake.  I did not have analysis at this time I was playing.  However, the logical next move here is, anyway....",
        "18. Qg5+": "Which brings more of my pieces downrange to control Black...",
        "18... Bg6": "He blocks the check...",
        "19. Qd8+": "I take opportunity...",
        "19... Bf8": "I am -1 but obviously a real problem here for Black...all because I sacrificed a pawn in the King's Gambit. The KG was popular at the turn of the Century (20th Century = 1900s) and if you buy a book on Chess Openings that is complete through every 8th move and possibility you will see a quarter of the book dedicated to the King's Gambit. The Gambit is the most diverse and complicated White Attack ever. It is risky and does have holes in it--but by the time you are involved with it the position(s) have sent you light years ahead of any predictable game. I like it that way! No one can memorize the moves even up to the 5th or 6th or 7th--let alone 8th position!\n\n ",
        "20. Bc4": "I am thinking to advance d5 pawn into a pin. Right now I am feeling like I am closing in... ",
        "20... Nd7": "at the cost of that rook over there.  ",
        "21. Qxa8": "Rook gone. ",
        "21... Nb6": "Time to do something to take out more material with this move. The Queen is no longer needed except to go out with a bang. ",
        "22. Qxf8+": "No choice for Black. ",
        "22... Qxf8": "There it goes in material.  In the King's Gambit you either win right away or you get material and go after material....",
        "23. Bxf8": "One bishop or the other which?",
        "23... Nxc4": "That one!",
        "24. Be7": "The only place for the remaining bishop not taken and I think a good one. ",
        "24... Ne3": "Black's Knights, as close as they are, are not in a position to do much....",
        "25. Kd2": "I felt this was my only choice to get out of the possible fork...",
        "25... Nef5": "I expected him to do Nc4 but he did not. ",
        "26. Bf6": "I have opp for more material and my King is safe from either Knight....",
        "26... e3+": "I can't allow the disclosed check from Bishop on g6...",
        "27. Kc1": "Only place I can go but Black is way behind already with a rook under attack...",
        "27... e2": "My King can take care of this anticipated promotion while Black's Knights are out of position....",
        "28. Kd2": "Thusly. ",
        "28... h6": "Too late for that on Black's part no matter what.",
        "29. Bxh8": "Thusly. ",
        "29... Kxh8": "Bishop traded in for a rook....",
        "30. Nxe2": "I shift to the right side now. I put my remaining Knight where it is most useful. ",
        "30... Nxe2": "So Black trades. ",
        "31. Kxe2": "We are winding down by now. ",
        "31... Nxd4+": "I have enough left over to get this over with so....",
        "32. Kd2": "I anticipate Nxc2.",
        "32... Nxc2": "However, ",
        "33. Rac1": "This should end the game for sure but I don't know if I am playing against a person who wants to go to the end...\n\nIt turned out Black was ready to surrender. \nWish more on this site would see ahead and not drag out a game to checkmate. I do get checkmated on occasion but usually I see it and give up. "
    },
    "url": "https://gameknot.com/annotation.pl/team-match?gm=47973",
    "gameName": "Team match",
    "players": "9422m (1934) vs. ethansiegel (1813)",
    "opening": "KGA (C39), Kieseritsky, Rice gambit"
}