{
    "moves": {
        "1. e4 e5 2. Nf3 Nf6 3. Bc4": "This is generally considered unsound and called the Boden-Kieseritzky Gambit. Black's typical replies are 4. ... Nxc3 or 4. ... Nc6 both generally leading to good games for Black although there are dangers. I was not aware of this particularly gambit at the time and proceeded differently.",
        "3... Bc5 4. d3 O-O 5. Nxe5": "White eventually tires of looking at my hanging pawn hoping I'll take the Gambit and simply takes it himself",
        "5... d6 6. Nxf7": "Generally trading a Bishop and Knight for a Rook is considered weak but already up one pawn my opponent decided to open up the game.",
        "6... Rxf7 7. Bxf7+ Kxf7 8. Qf3": "With my Kingside badly weakened getting the Queen into the game seems sound although 8. Bg5 pinning my Knight seems strong to me because I would be loathe to further weaken my already bad pawn structure on the Kingside.",
        "8... Nc6": "Trying to activate my pieces and take advantage of my extra minor. I'm never able to fully accomplish this goal.",
        "9. c3": "Preparing for d4 to block off my dark squared Bishop from effectively entering the game",
        "9... Kg8": "Perhaps a waste of time better spent getting out pieces with something like 9. ... Bg4",
        "10. d4 Bb6 11. Bg5": "Now comes the pin",
        "11... Bg4": "Another bad move on my part not fully calculating exchanges",
        "12. Bxf6 Bxf3": "The only move as 12. ... Qxf6 13. Qxg4 and I give back the piece",
        "13. Bxd8 Bxg2": "At least gaining two pawns for the lost piece",
        "14. Rg1 Bxe4 15. Bf6 g6 16. Nd2": "Activating more pieces. Note my glut of pieces on the Queenside none of whom can effect the game",
        "16... Bc2": "16. ... Bf5 would probably have been better but I'm in bad shape at this point",
        "17. Nc4 Kf7": "I'm thinking that my darksquare Bishop is a pretty bad piece although the trade doubles my pawns",
        "18. Nxb6 axb6 19. Kd2": "Now if I had retreated the Bishop earlier I wouldn't lose this tempo",
        "19... Bf5 20. Bg5 Na5": "This was a poor choice for a number of reasons that appear later in the continuation. Basically the Knight is reduced to utter uselessness. I was hoping to be able to outpost him on c4 but that is not realistic",
        "21. b3 c5 22. d5": "Locking my Knight into a poor position",
        "22... b5": "I'm trying to get out my Knight via the b7 square but it takes far too long",
        "23. Bf4 Rd8": "I'm in pure defensive mode here and in bad shape",
        "24. Rae1": "Bringing in the Rooks for the kill",
        "24... b6 25. h4 h5": "I don't want the g-column open with 26. h5",
        "26. Bg5 Rd7 27. Re3 Nb7": "Too little, too late",
        "28. Rge1": "Now it is over. There is no way for me to protect the e7 square effectively",
        "28... c4 29. Re3e7+": "I resigned at this point as I will drop the Knight and all my Queenside pawns soon. 29. ... Rxe7 30. Rxe7 Kf8 31. Rxb7 with more pawns to fall quickly. My opponent moved boldly and got his pieces working together while mine were trapped in bad positions and unable to help with the eventual finishing attack."
    },
    "url": "https://gameknot.com/annotation.pl/team-match?gm=31973",
    "gameName": "Team match",
    "players": "spark009 (1373) vs. tomlib (1525)",
    "opening": "Petrov (C42), Italian variation"
}