{
    "moves": {
        "1. d4 d5 2. Nf3 Bg4 3. e3 Bxf3 4. Qxf3 e6 5. Bd3": "planning e4.",
        "5... Qf6": "After exchange black would bring his knight with tempo into the game.",
        "6. Nd2": "symmetrical. I win a tempo after exchange.",
        "6... Bb4 7. c3 Qxf3 8. Nxf3 Bd6 9. e4": "Without queens, the king can be a fighting piece, that's why I didnot play 0-0.",
        "9... Nf6": "??",
        "10. e5 Ne4 11. exd6 Nxd6 12. Bf4": "To make more alternatives, which black must now calculate.",
        "12... O-O": "Black king is in safe, but after exchanges I want to bring in a pawn, that is why the king better stands in the middle.",
        "13. Bxd6 cxd6": "The pawnstructure is worse.",
        "14. Kd2": "Make contact between the rooks and centralize the king, too. The black knight has no good place, but must move.",
        "14... Nc6 15. a3": "Maybe with b4 next, or just for preventing any attack with a and b pawns.",
        "15... e5 16. Bb5": "I donot want to make better these pawns, so I try to exchange the lightfigures. If the knight goes away, the e5 pawn is over.",
        "16... exd4 17. Bxc6 dxc3+ 18. Kxc3": "After Rc8 I would play Nd4 safely.",
        "18... bxc6 19. Rhe1": "The only totally open file to catch.",
        "19... Rfe8 20. Rxe8+ Rxe8 21. Re1 Rxe1 22. Nxe1 f6 23. Kd4": "Black cannot push the c-pawn, so I made moveless this crowd.",
        "23... Kf7 24. Nd3": "I want to give my knight for the d5 pawn, to get the a-b-c files, where I can make an isolated pawn, what black must catch, so I get time for win the fight on the kingside and push a pawn in.",
        "24... Ke6 25. b4": "preventing c5.",
        "25... a6 26. Nf4+ Kf5 27. Nxd5 cxd5 28. a4": "Kxd5 maybe better, but it doesnot matter anymore.",
        "28... Ke6 29. b5 axb5 30. axb5 g5 31. b6 Kd7 32. Kxd5 h6 33. g4": "black resigns, because have no pawnmoves and the d6 pawn hangs, so I can make the territory on the kingside mine."
    },
    "url": "https://gameknot.com/annotation.pl/team-match?gm=8529",
    "gameName": "Team match",
    "players": "gazdvez (1662) vs. chriskirkland (1605)",
    "opening": "Queen's pawn game (D02)"
}