{
    "moves": {
        "1. d4 f5 2. e3 Nf6 3. Bd3 g6 4. Nf3 Bg7 5. O-O O-O 6. c4 d6 7. Nc3 c6": "Up to this point we have been playing a reasonably normal dutch defense opening, although I found it is rather uncommon that white does not fianchetto on g2, developing the bishop on d3 is by no means bad. I play c6 here to reinforce control of d5, but since e7 is often a weakness in the Dutch defense, it may have been better to prioritize on preparing for e5",
        "8. e4": "white opens up the game to be able to put pressure on the e-file.",
        "8... fxe4 9. Nxe4 d5": "chases the knight away from its active square, but has the downside of make the situation of the e-pawn even more problematic.",
        "10. Nc3 Bg4 11. h3 Bxf3": "While I don't really like making two moves with the bishop just to trade it, there seem to be no better squares for it to go. In addition, the queen is not fully comfortable on f3, since the f-file is half open, so there is not a real tempo gain for white here.",
        "12. Qxf3 Nbd7 13. Qe2 Re8 14. Qe6+": "black was finally ready for the pawn thrust, so this was an excellent way to postpone it even further and keep the black position cramped up.",
        "14... Kh8 15. cxd5 Nf8": "pointing an extra attack at the d5 pawn, while gaining a tempo.",
        "16. Qe2 Nxd5": "taking like this hits the d-pawn. This forces white's hand, which means black will finally have time to take care of his e-pawn.",
        "17. Be3 e5 18. dxe5 Nxc3": "This trade weakens white's pawn structure, but does leave him with a bishop pair. Perhaps trading on e3 would have been better, to leave the dark-squared bishop uncontested. While white's light-squared bishop will also be uncontested, if the dark-squared bishops were to trade, with each other, black has a wide open king.",
        "19. bxc3 Bxe5 20. Rac1 Ne6 21. Rfd1 Qc7": "Evaluating the powition from here, no plan becomes immediately apparent to me. Maybe white should play for creating strong squares for his knights by pushing the c-pawn? In the meantime white might want to get the black bishop off the board, but at this point I am not too sure any more that this will lead to a deadly attack.",
        "22. Qc2 Nf4": "In the game I adopted the rather weak plan of trying to chase the light bishop, trade with it and try to ride the slightly better pawn structure to victory. As a result the game is not really going anywhere for a while.",
        "23. Bc4 Rad8": "making sure not to leave the d-file uncontested.",
        "24. a4 Qa5": "I have no idea any more what my motivation behind this move was. Sure, it covers a7, but the queen is hardly active here.",
        "25. Rxd8 Rxd8 26. Bf1 Nd5 27. Bd2 Qc7": "MOving out of the battery, returning the queen without it having had any real effect.",
        "28. c4 Nf4 29. Bc3 Qg7": "Somewhat forcing the trade, since if black gets to trade now, his rook can enter white's position threateningly on d1",
        "30. Bxe5 Qxe5 31. Rd1 Re8": "Keeping the rooks on the board means black doesn't have to retreat immediately to defend d8",
        "32. Qd2": "Rd7 seems a little stronger to me as it forces black to play Re7, allowing white to trade and be the first to make an active queen move in the very open position, where initiative can be of utmost importance.",
        "32... Kg7": "giving the king a head start for the end game.",
        "33. Qd4 Qxd4 34. Rxd4 Rf8": "defending the knight and giving me the option to defend the seventh row.",
        "35. Rd7+ Rf7 36. Rxf7+ Kxf7 37. f3": "opening a lane for the king",
        "37... Kf6 38. Kf2 Ke5 39. Ke3 Ne6": "played around to c5, but since the knight was keeping the bishop at bay as a guardian of g2, it would probably have been better to reposition the pawns on the king side on dark squares so they can't be attacked by the white bishop. 39...g5 has an additional benefit of preventing f4",
        "40. Bd3 Nc5 41. Bc2 Nd7": "Very passively played, but since the KS pawns are now locked in position because they are on light squares, there needs to come some sort of support.",
        "42. f4+ Kd6": "Probably the wrong direction to go. At f6, the king could support g6, which would make those pawns mobile. The white king kan easily block d4, so black can only dream of going to c5, and black has the knight to prevent white from advancing too far with his king himself.",
        "43. Kd4 c5+ 44. Kc3 Nf6": "Nf8 may have worked a bit better, though it sounds strange, by virtue of allowing h6. Of course, if white responds with h4, preventing g5 from black, black still needs to bring his king to the KS to support g5, but since white can't really progress his king regardless, this plan may actually be fine.",
        "45. g4 Ke6 46. Kd2 Kf7": "This plan to support g6 is once again too backwards. If anything, the king should be on f6. The knight has time to regroup via e8 to d6 before white can get his king to e4 in time. An additional disadvantage of f7 is that it is on a light diagonal together with one of white's weak pawns, which certainly ends up mattering.",
        "47. Ke3 h6 48. g5": "Now black is in trouble, since he has been playing backwards for a while and now runs into the problem that he has to give up control over e4, which means white can get his king to a rather dangerous position.",
        "48... hxg5 49. fxg5 Nd7 50. Kf4 Nb6 51. a5": "Now we see the disadvantage of the king being on a light diagonal together with the pawn that black would like to pressure: since Nxc4 gets punished by Bb3, winning the knight, the fork on both of white's pawns doesn't work at all!",
        "51... Nd7 52. Ba4 Ke6 53. h4 Ne5 54. Bc2": "White can of course still not take on c4 and white now pressures the weak g6 again as well.",
        "54... Kd6": "Trying to move out of the dangerous diagonal to bind the white bishop to c4 on b3, but it is much too late.",
        "55. h5": "the resulting pawn will be very hard to fight for black.",
        "55... gxh5 56. g6 Nxg6+": "Black could instead have tried to go for 56....Nc6 57. g7 Ne7, but after that 58. Bh7 is still going to force the exchange of pawn for knight and win that way.",
        "57. Bxg6 h4 58. Be4 b6 59. a6 h3": "Thinking that luring away the king and traveling to e5-d4-c3-b4-a5 with my own king might give me a shot. ",
        "60. Kg3 Ke5 61. Bc6": "HOwever, instead of allowing himself to be chased away from d3, white makes the much better move of settling in on b5 with his bishop, where he can stand forever and c4 and a6 will be defended forever.",
        "61... Kd6 62. Bb5 Kc7": "Here I somehow get illusions of a stalemate or refusal to let myself get chased out of the corner but of course....",
        "63. Kxh3 Kb8 64. Kg4 Kc7 65. Kf5 Kb8 66. Ke6 Kc7 67. Kd5 Kc8 68. Kd6 Kd8 69. Bd7": "....This is not a stalemate at all, but rather zugzwang, which will cost me two pawns and then allow white to win with his passed pawn. Not seeing that the blockade on b6 would obviously be lifted dragged the game out 15 moves after it was actually over."
    },
    "url": "https://gameknot.com/annotation.pl/team-match-romania-vs-the-white-knight?gm=57892",
    "gameName": "team match romania vs the white knight",
    "players": "geluclin (1774) vs. martenp (1866)",
    "opening": "Dutch (A80)"
}