{
    "moves": {
        "1. e4 g6 2. Bd3 Nc6 3. Qf3": "Queens that don't stay at home, are looking to be courted by errant-knights. Thus...",
        "3... Nd4 4. Qe3 Bg7": "Typical of the bishop, to meddle in queens and knights affairs.",
        "5. e5": "Let them be friar! says the white queen's lady of company. ",
        "5... c5": "Its good for knights to remember all those occasions where dating with queens turned an unhealthy business for the guys involved. Queens always get pardoned. Decapitation, emasculation, and other ations are only reserved for the knights. This one in particular choose wisely to bring a squire to his meetings. Just in case, you know, she gets hungry after sex..... The bitch. ",
        "6. Ne2": "The king prepares to castle, just wanting to be as far as possible from the scandalous behavior of his consort. He also sends a knight to stand for his honor...",
        "6... Nh6 7. h3": "... but the white knight does nothing. Two reasons for that; either he is amused at the situation, or le faltan huevos. ",
        "7... Nhf5 8. Bxf5": "That's just enough for the bishop. If the knight is going to do nothing, well, he will... at the price of his own life if necessary. ",
        "8... Nxf5 9. Qxc5": "Lanzarote gone, Guinevere decides to calm her urges with a foot soldier...",
        "9... d6 10. exd6 exd6 11. Qb5+ Bd7 12. Qxb7": "... and with another",
        "12... O-O 13. Nbc3 Rb8 14. Qxa7": "and with another one. ",
        "14... Qg5": "Now, you see, black queen means business. She's not out to flirt, but to attack white king's summer palace, which, by the way, can't be defended anymore by the white Lady, busy as she is, wandering all around the board. ",
        "15. g4 Bc6": "and the summer palace is no longer suitable for vacation. ",
        "16. Rg1 Nh4": "looking to fork king and rook",
        "17. Nd4": "Finally he decides to intervene. His timing couldn't be worse. He lefts his king unprotected, limits the movement of his queen, and though he feels protected and safe...",
        "17... Bxd4": "He is not.",
        "18. Qc7": "Yes, adventuring has ended and she can't face the consequences of her rambling. Proving her selfishness once more, she goes for a bishop, leaving the king to his own. ",
        "18... Bxf2+": "As protectors grow fewer, king is forced to defend himself. ",
        "19. Kxf2 Qf4+": "A number of combinations derive from here...  I wonder if there could have been a better way to mate. Lets say 18... Qf4? White could have parried that easily... Isn't it?",
        "20. Ke1 Nf3+ 21. Kf1": "No one... is going to help you... oh king...",
        "21... Nxg1+ 22. Kxg1 Qg3+": "you...",
        "23. Kf1 Qg2+": "are",
        "24. Ke1 Rbe8+": "lost.",
        "25. Kd1 Qf1#": "So, final recommendation to you all guys. Keep your queens at home and, if they have to leave the house, be sure it is only for work. \n\nSaludos a mis compas del equipo Monkey Wrench. \n\nKordelero."
    },
    "url": "https://gameknot.com/annotation.pl/team-match?gm=37819",
    "gameName": "Team match",
    "players": "fyghter (1512) vs. kordelero (1745)",
    "opening": "Robatsch (modern) defence (B06)"
}