{
    "moves": {
        "1. c4": "English opening",
        "1... d5": "Not the best move for Black, because...",
        "2. cxd5 Qxd5 3. Nc3": "It forces the queen out too early, allows me to chase her around a bit and gives me a lead in development (I'd like to thank nuntar for pointing this out in an earlier annotation :) )",
        "3... Qc6": "i guess Black doesn't want a move wasted, so he keeps the Queen in play. However, it could lead to more wasted moves should I put pressure on it.",
        "4. Nf3": "normally, I would play 4.g3, but that would sacrifice my rook for nothing",
        "4... Bg4": "threatening to double my pawns on the f file",
        "5. e4": "I played this with the hope of not doubling my pawns, but I had just voluntarily pinned my knight",
        "5... Bxf3": "Black's exchange saves me from this pin, thankfully",
        "6. Qxf3 Qf6": "instead of developing, Black seeks an exchange",
        "7. e5": "This did mean losing my e-pawn, but I was planning to launch an attack on b7. Also, after 7... Qxe5 8.Bf2, I could simply get rid of the pin by castling",
        "7... Qxf3": "?! Black trades off Queens, to double up my pawns on the f-file",
        "8. gxf3 c6": "not sure why this move was made... to stop 9.Bb5+ ?",
        "9. Bh3": "I'm not sure why I did this either... it does put pressure on the d7 square, so I guess that's it, but it also covers the e6 square, which works out for me later",
        "9... e6": "blocks my bishop",
        "10. d4": "developing - but at this point, I notice that my king was more exposed than I'd like it to be...",
        "10... Bb4": "Black puts a pin on my White king...",
        "11. O-O": "so I castle, though my kingside isn't as strong as I'd like it to be",
        "11... Nd7": "developing, and opening up a possible path for the rook",
        "12. a3": "chasing the bishop away",
        "12... Be7": "probably the best move, as the bishop has no good reason to keep the pressure on the a5-b1 diagonal",
        "13. f4": "advancing my pawn hoping to play 14. f6 exf6 15. Bxf6 and eliminating my doubled pawns",
        "13... f6": "putting pressure on the e5 pawn",
        "14. f5": "Going ahead with my plan",
        "14... fxe5": "Black hopes to win a pawn here, but...",
        "15. fxe6": "will have to deal with my pawn first! with hindsight, Black would have been better off taking that pawn first, as it proves a major threat later in the game",
        "15... Ndf6 16. f4": "Why did I play this move? maybe I didn't want my pawns doubled, but dxe5 would have been better...",
        "16... exf4": "? but why didn't Black play exd4? that seems the better of the two choices, as it allows Black a passed pawn. This move, on the other hand...",
        "17. Rxf4": "immediately gives up that pawn!",
        "17... O-O-O": "not the best move - Black just castled onto the same diagonal as my h3 bishop, and if I can move that pawn, it will be disastrous for Black",
        "18. Ne4": "I offer an exchange for Black, to give protection to my d-pawn with my rook and to back up my e-pawn for a possible push to promotion",
        "18... Rxd4": "Black ignores the exchange, but this leads to....",
        "19. Nxf6": "Nxf6! no matter what Black does, White gains material; if bxf6, e7+ and White has a promoted pawn. If gxf6, White simply takes the rook (same thing with Nxf6) and if...",
        "19... Rxf4": "Rxf4, where Black hopes for a fair exchange from me with 20. Bxf4 Nxf6, but instead...",
        "20. Nxg8": "I take Black's other knight",
        "20... Re4": "this does give Black's rook safety (and pressures my e-pawn) but this loses to...",
        "21. Nxe7+": "taking down some of Black's defence againgst pawn promotion",
        "21... Kd8 22. Bg5": "threatens a discovered check, and another threat...",
        "22... h6": "which Black fails to see",
        "23. Ng6+ Ke8 24. Nxh8": "another takedown of Black's defence, as well as gaining material",
        "24... hxg5 25. Bf5": "attempting to drive away the rook...",
        "25... Rf4": "which works...",
        "26. Bg6+": "and White keeps the pressure on the Black king",
        "26... Ke7 27. Bf7": "the bishop and pawn protect each other, with the knight giving additional defence to the bishop",
        "27... Rh4": "??",
        "28. Ng6+": "King fork!",
        "28... Kf6 29. Nxh4": "no piece now, except the king, stands in the way of promoting that pawn!",
        "29... gxh4 30. Rf1+ Ke7 31. Rf4": "I intend attack Black's pawns, but I should have gone straight for the attack one move ago; 30. Rd1 Ke7 31. Rd7+",
        "31... h3 32. Rg4 Kf6 33. Rh4 b5": "Black desperately pushes for a promotion of his own",
        "34. b4": "prevents any chance of a promotion (Black could obtain a passed pawn on the c-file with 34... b5 35. bxb5, but white would also obtain a passed pawn and would promote first)",
        "34... g6 35. Rxh3": "nabbing a pawn",
        "35... g5 36. Re3": "trying to push my e-pawn again...",
        "36... Ke7": "forcing the king back to Ke7",
        "37. Rd3 Kf8 38. Rd7": "a position I ought to have reached 7 turns ago",
        "38... a6": "saving it from my rook",
        "39. e7+ Kxf7": "this was an oversight on my part, as at the time, I thought I could promote safely, but of course I just lost the piece protecting the e8 square",
        "40. Kf2": "I bring my king out for protection instead. The next couple of moves are just my king coming to the aid of my pawn, while Black looks on helplessly",
        "40... Ke8 41. Rb7": "protecting my rook, of course",
        "41... Kf7 42. Ke3 g4": "perhaps a desperate attempt for me to make a huge mistake with 43. h4??, where Black captures with en passant and promotes his pawn",
        "43. Ke4 Ke8 44. Ke5 Kf7 45. Kd6 Kg6": "? at this point Black completely abandons his position of preventing promotion and attemps to flee (I guess Black's king would be forced away sooner or later)",
        "46. e8=Q+ Kf5 47. Qe5+ Kg6 48. Ke6": "slowly trapping the king with my king and queen....",
        "48... Kh6 49. Qf6+ Kh5 50. Rh7#": "and delivering the final blow with my rook - checkmate!"
    },
    "url": "https://gameknot.com/annotation.pl/team-match-2-my-longest-game?gm=26128",
    "gameName": "Team match#2 - my longest game",
    "players": "x-machine (1087) vs. sbmr (1041)",
    "opening": "English opening (A10)"
}