{
    "moves": {
        "1. f4": "Hello. I just finished this game recently, and I am very happy to have been in it. I was white and I was playing a very good opponent in Hawkeye22. Enjoy!\r\n\r\nBird's opening.....",
        "1... d5 2. Nf3": "Goes into the polar bear system..",
        "2... Nf6 3. b3": "Want to get the bishop on the long diagonal. This plays a HUGE role later on in this game.",
        "3... e6 4. g3 Be7": "Getting ready to castle...",
        "5. Bb2": "=)",
        "5... O-O 6. Bg2": "Wanting to castle...",
        "6... Nc6 7. O-O Ne4 8. Ne5 Bc5+": "Gives this check...very annoying for me. I cannot simply move into the corner with my King because Nf2  is a killer.",
        "9. e3": "So I close the diagonal off.... Instead of winning material, black has weakened my King's position and I am well aware of that.",
        "9... f5 10. Nxc6": "Capture to do 2 things.\r\n1) To double his pawns on the c file\r\n2) to open up the bishops diagonal to his king",
        "10... bxc6 11. Bxe4": "Getting rid of the well posted knight",
        "11... fxe4 12. Qg4": "Threatening mate....but black proves on the next move this was a mistake.",
        "12... e5": "His LSB attacks my queen, but that's not the only threat. He also plans to take down the wall of pawns because of my King's weak position.",
        "13. Qh5 Rf5 14. Qe2 exf4": "Cannot take with e-pawn because it's pinned...Instead I want to get rid of the threats to my King.",
        "15. Rxf4 g6": "Hmm, not so sure about this move...",
        "16. Rxf5 Bxf5 17. Nc3": "Development, and also trying to get the rook on the f-file to get as his weak King position.",
        "17... a6": "This move I couldn't understand. I thought for sure he was gonna play Bh3 or maybe get his Queen involved with Qg5. ",
        "18. Na4": "Attacking..",
        "18... Ba7 19. Rf1": "There's that nasty rook on f1.",
        "19... Bb8": "???",
        "20. g4": "Trying to open the f-file.",
        "20... Be6 21. Nc5 Bf7 22. Qf2": "Now all of a sudden I have a huge attack aiming at his King. He has to play Qe7, no choice here. Here's the reason why....There are 2 threats going on right now. Of course, Qxf7#, but also Qf6. Remember that bishop on b2? Now he's really strong. ",
        "22... Qe7": "Plays correctly. This move guards both the bishop and the f6 square, nullifying both possibilities.",
        "23. Nd7": "Here it is. This move I was extremely proud of. He can't take because of Qf6 and forced mate soon thereafter. But this knight also hits the very weak f6 square. It was hard for me to see anything he could do. So in a way I used this knight as bait.",
        "23... Qxd7": "Ouch....",
        "24. Qf6": "Black resigns seeing how both Qg7 anf Qh8 is mate. He can delay the process by 1 move with Qxg4 , but after King h1 there are no more checks. Here he has to play Kf8 where the following would ensue...\r\n25. Qh8  Ke7\r\n26. Ba3  Ke6\r\n27.  Qf6#\r\n\r\nOverall I am proud of this game and hopefully you have enjoyed it."
    },
    "url": "https://gameknot.com/annotation.pl/team-match?gm=13625",
    "gameName": "Team Match",
    "players": "Buckethead15 (1517) vs. Hawkeye22 (1525)",
    "opening": "Bird's opening (A03), Lasker variation"
}