{
    "moves": {
        "1. e4 c5 2. Nf3 e6 3. Bb5 a6 4. Bc4 b5 5. Be2 Nc6": "All quiet so far",
        "6. d4": "I know I shouldn't really lose one of my central pawns here",
        "6... cxd4 7. Nxd4 Bb7 8. Bd2": "Big blunder as now my knight is unprotected",
        "8... Nxd4": "black takes a free piece",
        "9. Bc3 Nxe2": "black is happy to exchange",
        "10. Qxe2 Nf6 11. Nd2 d6 12. e5 dxe5": "I'm giving a pawn away to expose black's queen.  Hoping to castle queenside and leading to a discovered attack",
        "13. f3": "this is to pre-empt the knight coming down the fourth rank",
        "13... Be7 14. Bxe5 O-O": "black castles into safety",
        "15. O-O-O": "my rook is now potentially threatening black queen.",
        "15... Nd5": "blocks discovered attack if I move my knight",
        "16. h4": "i start the attack on black's king by sending in the infantry",
        "16... Bf6": "this i suppose to try to drive my bishop away or possibly exchange to relieve danger to black's g pawn",
        "17. h5": "pawn advance!",
        "17... Bg5": "pins my knight to king and also stops g6, but means wasted previous move.",
        "18. Kb1": "best to move my king out of the line of fire",
        "18... b4": "no immediate danger but need to be careful of advance towards my king",
        "19. Ne4": "hoping to drive black from existing diagonal and advance pawn later",
        "19... Bh6": "blocks pawn advance",
        "20. f4": "although black's queen is pinned, black could have played 20.... Bxf4, 21. Bxf4 Nxf4 would lead to possible exchanges of Queens and Rooks and white would be at a loss for the rest of the game.  Thanks to Nutcraker for the comment on this.  If 20.....Bxf4, I would probably have played 21. Bxg7 rather than exchange Bishops.",
        "20... Qc8": "black moves queen out of danger anyway",
        "21. Rd3": "to support attack on right",
        "21... Bxf4": "free pawn for black",
        "22. h6": "i can't take black's bishop because black's knight would fork my queen and rook after Nxf4. i decide to press my pawn forward rather than retreating my bishop.",
        "22... Bxe5": "Black piles on the material advantage instead of trying to defend.  22...g6 might have stalled my attack.",
        "23. hxg7": "punches a hole in the pawn barrier",
        "23... Bxg7 24. Rg3": "Black is now in real danger as with his bishop pinned against the king the options for defence are running out.",
        "24... Qd8": "The black queen tries in assist in defence.  24......Nf4 and then to g6 might have prevented mate.",
        "25. Qg4": "Seals the fate for black",
        "25... Nc3+": "A last ditch attempt to divert white's forces as 26. Nxc3 would mean black's queen could defend on f6.",
        "26. bxc3": "Black resigns.\r\nThanks to bottlenose for this game.  I think if anything, this games shows that you can recover from mistakes and focusing on the end result together with some luck can pay dividends.  I was stupidly timed-out on my other Team Game and after my early blunder was determined to put up a good fight."
    },
    "url": "https://gameknot.com/annotation.pl/team-match?gm=30446",
    "gameName": "Team match",
    "players": "beaker88 (1469) vs. bottlenose (1370)",
    "opening": "Sicilian defence (B40)"
}