{
    "moves": {
        "1. e4": "My standard white opening, haven't branched out yet.",
        "1... g6": "One of my students uses this as his response for black with great successs, but it does allow later for easier attack on this side in the endgame.",
        "2. d4": "Claiming the center, for now.",
        "2... Bg7": "black fiancettos the bishop",
        "3. Nc3": "continuing to develop to the center",
        "3... d6": "I am not familiar with this more modern opening, but looks to offer nice lines for both bishops",
        "4. Bg5": "Pinning the e pawn for a bit",
        "4... f6 5. Be3": "pulling back.  Lots of pawns developed on black's side, but I feel pretty good about my center control.",
        "5... c6": "Another pawn move.  Assuming black does not intend to castle, but looks to get some nice pawn chains going.",
        "6. d5": "Offering up a pawn trade, and possibly opening up a file, while giving black a doubled pawn.",
        "6... e5": "black says 'no' and makes a lovely pawn formation.",
        "7. dxe6 e.p.": "Fortunately, I remember en passant and destroy it,  but I end up with a doubled pawn myself.",
        "7... Bxe6": "No longer doubled, but black  starting to claim a bit more of the center",
        "8. Qd3": "Preparing to castle queenside",
        "8... Ne7": "Black develops more material to the center",
        "9. O-O-O": "The queenside castle seems less secure, but for now, my c3 knight will hold down the fort.  Also, it forms a battery if I want to  offer to trade queens for a pawn on d6.",
        "9... d5": "and the black pawn chain is completed--d6 pawn no longer on the table.",
        "10. g3": "With the king safely castled, preparing to fiancetto my own bishop.",
        "10... f5": "nicely protected pawn, and beautiful pawn formations",
        "11. f3": "adding a lower value piece to the e4 defenders.",
        "11... b5": "This pawn is really in the way of my plans.. he's not very defended, but the c4 square is off limits for now.",
        "12. Bd4": "offering a bishop trade resulting in  my queen lined up on the h file rook.",
        "12... fxe4": "nice one.. queen threat trumps bishop/rook threat, must take.",
        "13. fxe4 dxe4": "queen threat agin.. the center is opening up a bunch.",
        "14. Qxe4": "I take with queen as knight has an important job protecting a2 pawn.",
        "14... Bf5": "another queen attack, and feeling  forced off my bishop/rook attack idea",
        "15. Qe3": "keeping the d4 bishop protected and the e7 knight pinned, and really wanting to Bxg7 the free bishop on g7 next time and revealing a queen attack.",
        "15... Bxd4": "black is forced to take to avoid losing material--and another queen threat!",
        "16. Rxd4": "with the center open now and no pawn cover on the d file ,  instead of forcing the queen trade, I take with my rook... it doesn't attack the rook, but does threaten the queen.",
        "16... Nd7": "black interposing a knight, which is now pinned",
        "17. Nf3": "Getting my knight in the mix. And thinking to get the rook out of the corner.",
        "17... O-O": "This was unexpected.  The king looked hard to attack in the center, and I was thinking I'd have to start building batteries. However, I suppose getting the e7 knight unpinned is valuable, as is getting the rook lined up on an open file.",
        "18. a4": "Since the king is so exposed behind the castle, eventually want to get my bishop to c4, so trying to convince the b5 pawn to move.",
        "18... c5": "he says no and attacks my rook.",
        "19. Rh4": "since I must move, starting an attack on the h7 square",
        "19... Re8": "revealed attack in progress.",
        "20. Qh6": "Threatening Qh7# and then a mating pattern",
        "20... Nf6": "With the unpinned knight, defends h7",
        "21. axb5": "With no more imminent threats, I can finally take out the b5 pawn. I want a Bc4# down the road.",
        "21... Bg4": "This sneaky move clears off f5 for the beautiful Nf5--- fork!!",
        "22. Ng5": "Not paying much attention to this, because I have tempo, I pursue my attack on h7.",
        "22... Nf5": "And here is the lovely queen/rook fork... looks very bad for white here. I could have been in big trouble here with nowhere for my queen or rook to go safely.",
        "23. Bc4+": "But, I have my beautiful Bc4# to get me out of trouble, putting immense pressure on black with three pieces on the f7 square, and no great pieces to interpose with.",
        "23... Nd5 24. Qxh7+": "after checking with the queen--black only has one move here, Kf8",
        "24... Kf8": "At this point black resigns."
    },
    "url": "https://gameknot.com/annotation.pl/team-match?gm=50349",
    "gameName": "Team match",
    "players": "rollowa (1602) vs. eugen1943 (1620)",
    "opening": "Robatsch (modern) defence (B06)"
}