{
    "moves": {
        "1. d4 d5 2. h3 e6 3. a3 Nc6 4. c3": "This is a strange move for White, and now the only way to bring out the knight is by doing Nd2 and blocking the bishop's path. ",
        "4... Nf6 5. a4 Ne4 6. e3 Bd6 7. Bd3 Bd7 8. Ne2 O-O 9. Nf4 e5 10. Nxd5 Qh4": "I lose my pawn but threatening checkmate with my knight as support.",
        "11. Bxe4 Qxe4": "White exchanges pieces to avoid checkmate.",
        "12. dxe5 Qxg2": "Rather than taking the pawn on e with my bishop, I instead go for this move; if White decides to take my bishop with the pawn, I will then do Qxh1+ and gain a rook.",
        "13. Rf1": "One of two options for White to save the rook. The other would have been to move the King up one row to allow the Queen to protect the rook, and then I wouldn't have been able to make the next move with my bishop and gain an advantage in territory. I think this was a key mistake on White's part because my bishop does cause some trouble a few turns later.",
        "13... Bxh3": "Taking the pawn and providing support for my queen so that next turn she can do Qxf1+ and perhaps begin to force a mate.",
        "14. Qe2": "A better move for White would have been to do Ke2 and let the Queen protect the rook and remain protecting the knight. The D-column knight is now dead.",
        "14... Qxd5": "Taking the knight.",
        "15. f3": "Not really sure why White made this move. I suppose White is trying to prevent my Queen from returning to wreak havoc by blocking her path with a pawn, but now I get the rook. Perhaps a better move would have been Rg1 to prevent my queen from returning to g2.",
        "15... Bxf1": "Taking the rook. I anticipate White capturing my bishop with either the Queen or the King.",
        "16. Qxf1": "White takes the bishop.",
        "16... Qxe5": "I take the pawn, and now my DSB is supporting my queen. ",
        "17. e4": "I think White was anticipating my Queen to take the e-column pawn for Qxe3+, forgetting that the bishop is protecting that pawn already. This proved to be a key mistake on White's part because when I begin to force mate on the next move, e4 is now blocked when it could have been a possible escape route for the King. ",
        "17... Qg3+": "Beginning to force a checkmate. ",
        "18. Ke2 Qh2+ 19. Kd3 Ne5+ 20. Kd4 c5+ 21. Kd5 Rad8": "This move with my Rook was the only one without a check. The two pieces that can help at this point are the bishop and the Queen, but the queen can only make a useless interposition, and if the bishop goes to f4 to block my queen's path to protect the knight (thereby allowing the king to escape mate by taking the knight), I would take the bishop with my queen and mate on the next move. One thing that I really find that helps is before actually submitting my move in a game, I analyze the board first to see what my last few moves were (which can sometimes serve as a reminder of what move I wanted to make next) and I can play around with different outcomes, like if I move my Queen here, what would White do in response, and things like that. ",
        "22. Bg5 Be7#": "Mate. I think White's moving the pawn to e4 was a key move in this game. If White had left that pawn alone and instead moved the pawn on f forward one (therefore threatening my queen when she was on e5 and blocking her path), this checkmate could have been avoided, and I would have had to find another method of attack. Another key aspect of this game is that White didn't utilize the b-column knight at all; for most of the game, the pawn on c3 blocked the knight's best method of getting on the board. "
    },
    "url": "https://gameknot.com/annotation.pl/team-match?gm=59804",
    "gameName": "Team match",
    "players": "catzlaw (983) vs. otakumadness (1021)",
    "opening": "Queen's pawn game (D00)"
}