{
    "moves": {
        "1. c4": "Mon Capitan asked me to annotate a few games for the team with the reason why I made the move I did.  The notes have been made as the game progressed, rather than after.(although I have tidied them up a bit at the end)  They are basically the short term notes I leave for myself.\r\n\r\nc4 - Transpositional opening.  Black can put a stamp on what that is straight away.",
        "1... e5": "My standard reply to c4.  Mainly because I don't like playing queen's gambit as black.",
        "2. g3": "Setting up for Bg2, Nf3, O-O.  A very strong castled position from frontal assault",
        "2... Nf6": "Centre control, setting up for kingside castle",
        "3. Bg2 Bc5": "Centre control, allows castleing",
        "4. d3": "??? Allows B out...",
        "4... Nc6": "Centre control",
        "5. Nf3 O-O": "May as well.  Have 3 well developed pieces to 2 off to the side",
        "6. O-O d5": "Long term plan is to open and control c, d or e and attack castle from behind the pawns",
        "7. Bg5": "Pin the N.  Leads to no material advantage.  Depending on how I disarm it, it may weaken my castle",
        "7... dxc4": "open d",
        "8. dxc4 Qxd1": "Simplify by exchanging Q. Still have better development.  Ng4 is likely to make the R return to f1, keeping d up for grabs in line with my long term plan.",
        "9. Rxd1 Ng4": "If i now do h6, the bishop will retreat now, rather than have the option of an exchange which leaves me with a weakened castle and doubled up pawns. I am expecting Rf1 to protect f2 and in turn e3",
        "10. Rf1 h6": "Makes the B retreat, ceding more centre control.  Gets me the escape hole from the castle now, so I can keep tempo in the end game.  Also the escape hole is on a white square, and white's white bishop is likely to be stuck on g2 for a while",
        "11. Bd2 e4": "N on f3 has safe squares at e1 - N takes pinned pawn on f2 setting up a discovered check (Nd1 ,Nxb2)\r\n                                                    If RxNf2 then fork with e3.  \r\n                                         at h4 - g5 13 Bxe4 gxh4\r\nMaterial advantage for me, small breach in whites castle, but probably still have to go around the back",
        "12. Ne1 Nxf2 13. Rxf2 e3 14. Bc3": "I won't pull punches.  This is just BAD.  14 Bxe3  Bxe3 (bishop for a pawn), would have minimised the damage.  This leads 14.... exf2  (up a rook) 15 Kh1 or f1 fxe1=whatever as the B on c3 will take it.(up a knight)\r\n                                ",
        "14... exf2+ 15. Kf1 fxe1=Q+ 16. Bxe1 Ne5": "c4 unprotected so white will use a move to protect it.  Ng4 next to attack h2, which he can't protect as easily.",
        "17. b3 Ng4": ""
    },
    "url": "https://gameknot.com/annotation.pl/team-match?gm=14018",
    "gameName": "Team match",
    "players": "kungfugod (1465) vs. joe17 (1480)",
    "opening": "English opening (A20)"
}