{
    "moves": {
        "1. d4": "..I enjoy playing with black...more aggressive openings in reserve...against d4 openings, things tend to get positional.",
        "1... Nf6 2. c4": "..black has a number of options here depending on taste. I tend to play a Benko, but KID, Nimzo and others offer attacking options too.",
        "2... c5 3. d5 b5": "..normal lines include taken the pawn, declining (as the Benko is hairy if you get it wrong for white)..or other stuff",
        "4. a4": "...this is quite sharp and black has to be careful. Taking the pawn (bxc) leads to quite hairy stuff for black. Decided to develop quickly as white only has a dark square bishop with no real targets to use...",
        "4... Qa5+ 5. Bd2 b4 6. f3": "...this normally prepares e4 with strong central push....blacks eventual plan will be 0-0 and e6, opening the f file.",
        "6... g6 7. e4 d6": "...all normal stuff here...not worried about the queen for the moment, just develop.  Blacks position is already slightly better...white's queenside can't do anything and Nh3 will be met by Bxh3, when white is then in trouble very early..",
        "8. Ne2": "....I look at this and thought (as per previous comment) white is just badly developed...so finish development and use the extra tempii.",
        "8... Bg7 9. Nc1 Nbd7 10. g3 O-O 11. Kf2": "...big ??? Possible longer term threat of h4-5 but blacks position is solid, and now a simple plan...get in f5 and the king is in trouble...",
        "11... Ne5 12. h3": "...justa weak move i thought....(or crap)",
        "12... Ne8": "..preparing f5...",
        "13. Bg5 Qc7 14. f4": "...keeping in mind the idea of the opening f file and the exposed king, the next move by black is obvious...",
        "14... f6 15. Bh4": "..oops...did white just drop a pawn....?",
        "15... g5 16. fxe5": "....should i panic..? A lost piece...? Er..no. The position is now such that White is in big trouble. A stagnant queenside, an exposed king. Black can deliver 5 major pieces to the attack very quickly...",
        "16... fxe5+ 17. Kg2 gxh4 18. g4": "...next part is to dismantle the centre and bring in all pieces to the attack.",
        "18... e6 19. dxe6 Bxe6": "...all moves lead to quick attack...Qf7, Nf6 and Re8....",
        "20. Nd2 Bh6": "..the knight on d2 will be a key piece defending c4 & e4...so going to eliminate it. White has simply not developed and will pay the price...",
        "21. Nd3 Bxd2 22. Qxd2 Bxc4": "..bit greedy and it could have made things difficult for black with Nxe5..! ..and that threat is available to white for several moves...",
        "23. Rc1 Ba6 24. Be2 Qg7": "..taking care of Nxe5 and Qg5  threats. Need to bring in the Bishop and Ra8 into the game....",
        "25. Kh2 Bb7 26. Qe3 Nf6 27. Nf2": "...an attack is brewing for black but must get rid of annoying Bc4 ",
        "27... Kh8 28. g5": "..in this position, the white king has some protection but Qg3# would be nice...so time for a bit of material sacrifice for deflection and bring in the big guns....",
        "28... Nxe4 29. Nxe4 Bxe4": "....what is black doing? !!?? Well white should not take the bishop as Rf2 , Kg1 Qxg5 , Kxf2 Qg3 , Kf1 Rf8  ..and white must give up the Queen and bishop to stay in the game, Black has really strong passed pawns that will zoom home....I think white has to give up another rook to prevent one pawn going home...",
        "30. Qxe4 Rf2+": "....seen this before somewhere..?!",
        "31. Kg1 Qxg5+ 32. Bg4": "...ok...Qxc1 , Kxf2 Rf8  and black still has a strong attack...",
        "32... Raf8": "..but this is just as strong...and keeps the pressure on white....",
        "33. Rc2": "..so now to get the queen inside the white palace.....",
        "33... Rxc2 34. Qxc2 Qe3+": "..white resigns in view of mate to follow (Qg3)..spotted that a while back ...!\r\nIf nothing else, this game is an example of what happens when you do not develop......"
    },
    "url": "https://gameknot.com/annotation.pl/team-match?gm=17507",
    "gameName": "Team match",
    "players": "wwgia (1688) vs. shambobala (1708)",
    "opening": "Benko gambit (A57)"
}