{
    "moves": {
        "1. e4 e5 2. Nf3": "King's knight.",
        "2... Bc5 3. c3 Nf6 4. Nxe5 Nxe4 5. Qf3": "This move is not found in the database.  Before this it was the King's knight opening.  However, that is not to say this is not a bad move.  It is a variation of the four mate, though in this case white may soon lose Pf2.  Black should castle to avoid checkmate, or move Qe7.",
        "5... g6": "Wow.  REALLY bad move on black's part.  QxPf7#.  Game over on move 6 instead of move 4 (usually executed with the bishop).",
        "6. Nxf7": "Ok, WT_?  This SHOULD have been a six move game.  Everything was in sweet position.  Why would white do this?  QUEEN TAKES THAT PAWN, GAME OVER!  All your base are belong to us.  Ha ha ha!  This is insane.",
        "6... Bxf2+": "Actually, this isn't such a hot move for black.  Ke2 black kind of has to decide which piece he wants to lose, the knight or bishop.  Either way is a trade for a pawn.",
        "7. Ke2 d5": "?  I would have moved the queen to e7--get her out of harm's way and let white have the rook.  The queen would do a fine job protecting that knight, and if white did not move his own queen (instead of taking the rook) black could trade Ne4 for the white queen with Ng5+.  (discovered check by the black queen).  If white interposes the queen she falls to the kick of the black horse (Nxe3) or Qe4 (worse) Qe7xQe4+ for free.  Then black gets to move the rook.",
        "8. Nxd8 Kxd8 9. c4": "Ok, I like Pd3 better.  That way if black does not move the knight white picks it off with the pawn.  If black DOES move the knight QxBf2 or KxBf2.  Either way black sheds a knight or bishop.  Black might respond with Re8 to protect the knight, but that is faint help when a pawn's lance is thrusting into the mighty steed.  Horse heart makes a fine addition to polish sausage.",
        "9... dxc4": "Here black must be hoping white accepts the QxN sacrifice.",
        "10. Qxe4": "Ok, no.  No no no no no!  Re8 pins the queen.  Oh the humanity!  I cannot bear to watch.  Of course black trades a rook for the white queen, and loses the bishop besides.  So although this is a terrible move, white still enjoys material advantage.  Plus, a rook and bishop are almost worth a queen (eight points versus nine).",
        "10... Rf8": "?  Re8 pins the white queen.  Here white really should move Qd5+, to prevent black from seizing the precarious queen.",
        "11. Nc3": "No.  If you don't like Qd5+, to see if black would be foolish enough to interpose Bd7 (12. QxPb7 and black's a rook bites the dust), then QxPc4 seems nice.  Then Pd unleashes the black bishop.  Pb3 isn't all that bad either--once the queen has been placed out of harm's way.",
        "11... Nd7 12. d3 cxd3+ 13. Qxd3 b5": "QxPb5?",
        "14. Qe4": "While Re8 again pins the white king, Bg5+ forces black to (ultimately) interpose the rook, and QxR# ends the game.  So Re8 is now bad for white.",
        "14... Nf6": "So black chooses to ignore QxRa8.",
        "15. Qxa8 Ne4": "Down 13 points even trades tend to be very bad for black.  This is not even a trade, white gets a free knight.",
        "16. Nxe4 Re8": "Here white likes Bg5+.  This lets Ra dog out.",
        "17. Kxf2": "Or that.  I think the other may have ended in mate.",
        "17... Rf8+ 18. Ke1": "I like Kg3 better.  With the queen gone the king can advance to the field to assist pawns.  Not that white needs more material with a 19 point advantage.  But this move tethers the knight.",
        "18... Re8": "See?  Knight can't move now.  Bg5+ still looks real good, and lets the left rook loose.",
        "19. Bxb5": "This move is good, it should be followed by Qc6.  With a 20 point lead the king deserves special consideration.",
        "19... Re5 20. Bf4": "Nope.  Bg5+ forces a bishop/rook exchange withe either RxBg5 or Re7, BxR, KxB (QxB, so the first move is better for black).  This move sacrifices the white bishop for nothing.  ",
        "20... Rxb5": "O-O-O+ would be fun just because, but is illegal now that the king moved.",
        "21. Rd1+": "Next best thing.",
        "21... Ke7 22. Qxc8 Rxb2 23. Qd7+ Kf8": "Here white likes Bh6+.",
        "24. Qxc7": "That is ok too, though not necessarily faster.",
        "24... h5 25. Rd8#": ""
    },
    "url": "https://gameknot.com/annotation.pl/team-match?gm=55660",
    "gameName": "Team match",
    "players": "psycho422 (1025) vs. ozreaper (928)",
    "opening": "King's knight opening (C40)"
}