{
    "moves": {
        "1. e4": "I recently annotated a game where I was white vs the pirc defense, and I found it a lot of fun to do. So I thought I would do another, as it was a different line of the same opening, one where mistakes were made and I had ideas at the time that I think were probably not so good as I look back on them. Also a fun game, which is good. ",
        "1... d6 2. d4 Nf6": "The Pirc defense. ",
        "3. Nc3 e5": "Mainline here is g6, to which I enjoy slamming down f4 and playing the Austrian Attack. This move is second most popular here on the databases (about 34000 to 8000) but both are seen a lot, even at high level of play. g6 leads to a sharp game where a draw is not likely, but white has an edge they can push if they play precisely. e5 is a little more drawish, challenging the center immediately with the possibilities of mass trades later in the game. ",
        "4. Nge2": "A bit of a sideline. Nf3 is by far the most popular move here but I want to leave f4 as a possible move later should my opponent castle kingside. I can go queenside and push f4, h4 and get a nice attack going. The problem with that is that the light squared bishop is trapped in if I don't push g3 myself, and if I do push g3 I weaken my light squares a little on the king side. Not the worst set up, but double-edged. ",
        "4... Be7 5. g3": "And then I do it immediately after being concerned about the weakening effect. Pretty clever of me. If I'm going to do it though right away is a good idea, playing Bg2 later to defend e4 in some lines. Might allow for a Nd5.",
        "5... O-O 6. Bg2 Bg4": "As far as I could tell this is a novelty on the databases. I had not considered this move. The light squared bishop is black's good bishop (his pawns are on dark squares so it is the one with all the threats) and so he doesn't really want to trade it off for a knight as that would mean my light squared bishop would become an unopposed monster should the center ever open up. It is also not clear whether or not the bishop should be here or on d7 or e6, so this might waste a tempo in some lines. Of course you could just take on e2, knight has to take back and maybe play d5 and try to open lines before the king is safely castled. Without a light squared bishop and the dark squared bishop passive, opening these lines holds little venom in my opinion, but it is a possibility. ",
        "7. h3": "I took a very long think before playing this move. I wasn't sure what I wanted to do with my bishop, e3 or g5, and playing Nd5 doesn't really work here because Bxe2 threatens to win a pawn with Qxe2 exd4. This pawn is probably not being kept long term, but black is close to equal if not better in this position so I that seemed bad. The pin makes f4 less enticing as pawn has to take, really weakening...everything basically. I still kind of wanted to play f4 at some point and attack on the kingside so castling wasn't super exciting to me. I generally don't like to play both g3 and h3 at the same time as it gives weaker points to try to attack. I assumed he would play Be6 and at some point Qd7 with pretty good pressure aimed at the h3 square. In the end I played h3 because if he retreats I just develop and castle queenside and h3 isn't so weak with the rook staying on the h-file. Maybe I could push g4 as well to start my attack. I'm still not sure about this move, but I don't mind it. ",
        "7... Bh5": "?! I did not expect this response. I does maintain the somewhat annoying pin of the e2 knight and maybe allow for Bg6 with pressure against e4 in some lines, but it is inviting g4 with tempo, which was a plan that I already had. I think Be6 or d7 here is probably better, or even taking on e2 (though this seems less good all around to me). In the end I think this sequence is why 6..Bg4 is not such a good move in the first place. ",
        "8. Be3": "Developing. I don't want to go Bg5 because it is in the way of a potential pawn advance there, and really ties me up if I try to get an attack going. I've basically decided at this point that I would go Qd2 and O-O-O at some point. ",
        "8... Nbd7 9. g4": "Maybe I should Qd2 here. I don't think it matter if I do this pawn move or the queen move first if I'm planning to play both, but in general moving pawns is the more forceful as they can't move back if you decide it's a mistake later on so unless I see a forcing continuation then keeping options open is generally better. ",
        "9... Bg6 10. Qd2 c6": "Stopping any future idea of Nd5. This move seems close to forced somewhere in here. ",
        "11. Ng3": "Look at that great f5 square. I get the bishop pair if I want it as well as pressure against g7 if pop my knight in there. I could castle queenside here before playing this move but (similarly to Sicilian lines) I will attack on the kingside and black will counter on the queenside. My attack looks stronger, but the king might be safer in the middle. Maybe. Or maybe I should just castle. Not sure. ",
        "11... b5 12. a3": "Taking a move off to try to prevent b4 with tempo and queenside pressure. ",
        "12... Qc7": "I assume this is preparing c5. Seems pretty good. ",
        "13. g5": "I attack on the kingside. The game right now is quite sharp with black having space and a potential attack on the queenside and white having space and a potential attack on the kingside. I think white is better here as their attack is faster and they might be able to tuck the king away on f1 or g1 and be somewhat away from harm. ",
        "13... Nh5": "? I think this is a blunder. Lets look at the knight's good squares. That's all of them. There are none. Nf4 loses a pawn right away and the rest are attacked by pawns. This move bascially buries the knight to make matters worse, the g6 bishop means pawn g7-g6 protecting the knight isn't possible. This knight is probably doomed. ",
        "14. Nf5": "Pressure is mounting and black's pieces lack coordination. ",
        "14... Bxf5": "The alternatives (Bd8, Re8) don't seem better. White looks much better. ",
        "15. exf5": "F6 might be possible, or g6 or Qe2 or Bf3 and black's kingside is falling apart. ",
        "15... exd4": "White is attacking on the flank so black counters in the middle. This is a good strategy in general. ",
        "16. Bxd4 Rae8 17. O-O-O": "Finally white castles. ",
        "17... c5": "This is a double edged move as it opens that really nice d5 square for the knight, which comes with tempo. ",
        "18. Nd5 Qd8 19. Be3": "I also considered Bxg7 with 20 f6 to follow. Also f6 immediately seems interesting. This is the most solid option, just protecting everything and forcing black to a defensive posture. Qe2 or maybe Bf3 trying to win the h5 knight is a plan here. Can also play Nxe7+ which would win the d6 pawn and threaten the c5 pawn as well. Something like 20. Nxe7+ Qxe7 21. Qxd6 Qxd6 22. Rxd6 and the bishop is attacking c5 and the rook is attacking d7. Black's h5 knight is still out of play and white still has a nasty pawn wall on the 5th rank. Seems good for white. ",
        "19... Ne5": "Nc4 and then x3 would let up some pressure. seems as good a plan as any for black here. ",
        "20. Qe2 Ng3": "There really aren't any great moves here. Black is just losing a piece. If g6 to protect the knight then 21. f6 traps the bishop at the very least. And the knight is still out of play in that moment with the black king possibly getting mated after the white bishop goes to 3 and takes on h5 with Qxh5 Qh6 Qg7 mate to follow. So black moves the knight to force white to recapture with the pawn. Not sure what the idea here really is other than to leave the bishop on e3 undefended by a pawn, which might matter if black can ever discover a pin along the open e file or maybe push those queenside pawns, which are somewhat dangerous. ",
        "21. fxg3 Nc4": "This is a good square for the knight where maybe Bxg5 gives black some counter-chances. ",
        "22. h4": "This stops Bxg5 at the very least and white's kingside pawns are bearing down on the black position. F6 here looks good, as well as maybe even just h5 h6 as well if the threat to g5 goes away. ",
        "22... Nxe3": "This move didn't seem great to me at the time and I don't really like it now either. That knight was black's only really good piece and they've traded it off for a bishop that is fine but not great. ",
        "23. Nxe3": "Maybe taking with queen and leaving the knight on a great square was better, but I didn't want black to have counter chances and leave myself open to a discovered attack along the e-file at some moment. ",
        "23... b4": "Trying a last ditch effort to attack the king. ",
        "24. axb4 cxb4 25. Bc6 Qa5 26. Bxe8 Rxe8": "If Qa1+ then just Kd2 and the queen is attacked without any possible checks and the bishop would escape as well. ",
        "27. Kb1 Rb8 28. Nd5 Bf8 29. f6": "Black is really just dead here. ",
        "29... b3 30. cxb3 Rxb3 31. Qe8": "Ne7+ is coming with mate on f8 to follow. Nice. ",
        "31... Rxb2+": "I was a little afraid of a perpetual check here but the knight on d5 and the queen on e8 are actually covering all of the important squares the black queen might have here. Looking back over the game the fact that I just put the knight right back to the d5 square makes me think that taking with the queen on move 23 might have actually been the correct move.",
        "32. Kxb2 Qa3+ 33. Kxa3": "Of course black gave away his pieces there at the end but he was dead at the end there. I really enjoyed playing this game and my opponent and I messaged back and forth for a bit after the game. I thought he played fine really for most of the game but that move Bg4 early on was probably not a great one and then moving the knight to h5 put t offside so early on in the game where I could improved my position, get an attack going, and then take it off at my leisure. "
    },
    "url": "https://gameknot.com/annotation.pl/team-match?gm=62349",
    "gameName": "Team match",
    "players": "tombulous (1890) vs. nichita (1913)",
    "opening": "Pirc defence (B07)"
}