{
    "moves": {
        "1. Nf3": "This is taken from a recent team match. I haven't done too well in team matches for some reason. Also my rating has recently plummeted. I am hoping this marks a change in direction for my rating. I hope you enjoy the game feel free to comment",
        "1... Nf6": "This is the Reti - not an opening I know very well at all so I was looking forward to the challenge",
        "2. d3 d5": "I like this move as it stakes a claim on the centre and should white play e4 he will lose a pawn and the right to castle with something like e4, dxe4, Qxd1+, Kxd1,Nxe4",
        "3. h3": "To be frank this move seems a bit of a waste in this position as I am not clear there is a lot of point in playing something like Bg4. Perhaps someone better versed in this opening can offer some thoughts.",
        "3... c5": "In the Gameknot database this move is not successful for black however I wanted to play this before I moved Nc6",
        "4. Bg5 Nc6": "Possibly better in this position would be e6 however I wasn't too worried about the possbility of doubled pawns just yet and I certainly would be happy to exchange a bishop for my knight at this time.",
        "5. Bxf6 gxf6 6. g3": "White has a problem with his remaining bishop now, perhaps e4 would have been better to get it active",
        "6... e5 7. Nbd2": "I can't help but feel this isn't the best move for white as now he is going to take a while to get his queen active",
        "7... Bg7": "I once played a much higher ranked player who put his bishop in front of his king to take the place of a missing pawn, I figured that this would be a good game for me to try that out. With hindsight I think my logic is a little flawed as white has lost his dsb and so I should be looking to take advantage of that fact by using my dsb",
        "8. c3 O-O 9. Bg2 Be6 10. O-O b5": "At this point I was thinking of a queens side pawn charge, this move also has the advantage of restricting the white queens mobility. White is starting to look a little cramped",
        "11. e4 Rb8": "supporting the pawn charge",
        "12. a3 a5": "I think I have never seen a position quite like this it will be interesting to see how this works out",
        "13. Nh2 Qd7": "Threatening to gain a pawn with bxh3, Bxh3 Qxh3",
        "14. g4": "Now whites pawns around his king are even weaker however that bishop makes up for it at the moment",
        "14... d4": "time to open a file",
        "15. c4": "This is surely better for black as the rook is already waiting to claim the half open file, unfortunately however it leaves an isolated pawn on a",
        "15... bxc4 16. Nxc4 Ne7": "Looking to shift my knight over to the kings side. If Nxa5, Rxb2 and I have a rook on the 7th rank",
        "17. Qd2 a4 18. Bf3 Ng6": "Looking for Nh4 to pressure the area around the white king, if I can get my knight there which it looks like I can now then it will be tricky to extricate",
        "19. Be2 Nh4": "Now I just need to work out how to get my queen to g2",
        "20. Kh1": "This seems unnecessary to me and I can use it to my advantage",
        "20... Qb7": "My queen is now where I want it, on the h1-a8 diagonal I can gain material with Bxc4, dxc4,Qxe4+ ",
        "21. Rab1": "Another unnecessary move that pawn is well protected already",
        "21... Bxc4 22. dxc4 Qxe4+ 23. f3 Qg6 24. f4": "This has to be a mistake from white as the h1-a8 diagonal is now wide open again",
        "24... Bh6": "pins the pawn to the queen and opens g7 for my queen if white plays f5",
        "25. Bd3 f5 26. Bxf5 Qc6+ 27. Kg1 Bxf4": "pressuring the queen, it has to stay on the second rank, however white is in trouble now",
        "28. Qe2": "I'm unclear what whites best move is here, possibly Nf3",
        "28... Be3+": "And now white cannot avoid mate",
        "29. Rf2 Qg2#": "Thankyou for reading please feel free to comment"
    },
    "url": "https://gameknot.com/annotation.pl/team-match?gm=30639",
    "gameName": "Team match",
    "players": "mauro1236 (1427) vs. elwoos (1464)",
    "opening": "Reti opening (A05)"
}