{
    "moves": {
        "1. e4": "The usual.",
        "1... c6": "Caro-kann. A solid response to e4. Often result in drawish positions. Black only wins if White overextends himself.",
        "2. d4 d5 3. Nc3 dxe4 4. Nxe4 Bf5": "The old mainline. The new mainline is Nd7 with Ngf6. Both are playable. Black wants to get his light bishop out before e6 (an advantage of 1...c6 over 1...e6) which would shut it in for quite some time.",
        "5. Ng3": "In turn White tries to harrass this bishop while developing his pieces into agressive squares.",
        "5... Bg6 6. h4 h6 7. Ng1e2": "Mainline is Nf3 but I like this move since it's not very popular but almost as good in my opinion since it results in some interesting position that might trouble Black if he doesn't pay attention to the subtle change of piece set up.",
        "7... e6 8. Nf4": "Putting the knight into a nice square with threat to the Bishop.",
        "8... Bh7": "Forced.",
        "9. Bd3": "Standard exchange. The point is that Black has been using all his turns to develop his light bishop and now has been forced to trade it off for a piece that only moved once. He would be down a lot of tempos straight from the opening. But Black's position is solid enough that if he doesn't commit any major errors he should be OK.",
        "9... Bd6": "A bit forceful. The objective for Black in this opening is not to attack White (if he wants to be agressive then Sicillian would have been a better choice) but to keep the balance using his solid position. Developing with Nf6 first would have been preferred I think.",
        "10. Nfh5": "White has already had most of his pieces out and ready for attack. This move highlights the error of Bd6. Black's kingside is exposed to weakness that cannot be covered by 0-0. If his bishop hasn't moved then Nh5 would not generate any serious threat.",
        "10... g6": "Awkward move. The light bishop is shut in. But it's hard to come up with an alternative since Black had wasted too many turns with ineffectual moves. Black has been too trusting in his solid position that he completely forgot the fundamental rule of opening: developing your pieces.",
        "11. Nf4": "No speculative sacrifice to be found. But often time creating a weakness in your opponent's camp is as good an objective as any.",
        "11... Qc7": "Black's knights must be feeling pretty jealous of their White counterparts right about now. While their enemies are ready in formation preparing for battle, they have to stay home in their original squares looking pretty.",
        "12. Qf3": "Protecting the knight. Also clearing up spaces if White chooses to castle queenside. White is better.",
        "12... Nd7": "Black probably wants to seek shelter on the queenside as well, seeing how his kingside has already been weakened and all the White pieces are pointing at it.",
        "13. Nfe2": "There's really not much White can do at the moment, despite his superior development. Black's position is still rather solid. I saw that if Black was to push e5 the next move then I would be forced to trade my d4 pawn for it and then Black knight can go to e5 attacking my Queen. His position wouldn't seem as bad then. So I decided to retreat and see what Black's plan is.",
        "13... Ndf6": "I feel Ngf6 is more accurate and to the point, planning to use Nd7 for the center thrust e5. I don't think Black adequately considered that option.",
        "14. Bd2": "Still playing the waiting game.",
        "14... O-O-O": "Settling down.",
        "15. c4": "White has spatial advantage. This move aims to take away the knight's awesome spot on d5. This is the first commital move of the game, since d4 is slightly weakened, but only if Black manages to gain some counterattack via c5 or e5. Note that I haven't settled down on castling yet, give me the option of castle kingside and go for opposite side attack which would benefit me since my pieces are more ready.",
        "15... Bxg3": "I did not see this move coming, partly because I did not expect Black to part his bishop for a knight. The position is rather open and my bishop pair might become an advantage.",
        "16. fxg3": "Forced. Ng3 loses the d4 pawn, and Qg3 leads to unnecessary Queen exchange which would benefit Black. fg3 is not bad, however, since it opens up the f file, and that is precisely where Black's position is weak (due to g6).",
        "16... h5": "Attempt to create an outpost for his knight at g4 and limiting my kingside pawn movement. Unfortunately this lets White create a nasty pin that forces material.",
        "17. Bg5": "Dark-square weaknesses after the dark bishop's departure.",
        "17... Qe7": "Forced.",
        "18. O-O": "Too many attackers. The piece is lost.",
        "18... Qb4": "Hoping to generate counterattack. The problem is Black has no active piece.",
        "19. Bxf6": "Simplest. There's a little Queen trap with 19.a3 hoping 19...Qb2 20.Rfb1 winning the Queen but it's rather obvious and Black queen is not forced to take the pawn.",
        "19... Nxf6 20. Qxf6 Qd2 21. Qf3": "White is winning here. Now I only have to make sure to not blunder and give anything back.",
        "21... g5 22. Rfd1 Qxb2": "Getting some pawn back for his piece, but this open files on the queenside which is where his king resides.",
        "23. Rab1 Qxa2": "Pawn grabbing, there's really not much else for Black to do.",
        "24. Qxf7": "Threaten mate in one. I expect to have a completely dominating position here even after Black's best reply. Instead the game ends abruptly.",
        "24... Bxd3": "Not sure if Black overlooked it or just saw through all the variations and decided to make the last gamble. ",
        "25. Qxb7#": "Of course not 25.Rd3?? due to Qb1  picking up Rd3 as well."
    },
    "url": "https://gameknot.com/annotation.pl/team-match?gm=3819",
    "gameName": "Team match",
    "players": "lordnguyenvo (1702) vs. theinnergame (1702)",
    "opening": "Caro-Kann (B19), classical, 7...Nd7"
}