{
    "moves": {
        "1. d4": "1.d4 is usually slower than 1.e4 but it gives white much more opportunity for a lasting initiative and it is suitable for players who like to play slow positional games with semi closed pawn structure in the center. If I play with white pieces I always play with 1.e4 and try to open up the center by pawn exchanges in order to make the game explode tactically. I usually avoid a closed center because it is boring to me and I don't feel quite comfortable \r\nwith it. In this game I'll try to open up the center as soon as possible and seize the initiative in the right moment.",
        "1... d5": "I usually prefer this move to 1...Nf6 which leads to Indian lines of defense. 1...d5 is the immediate challenge of the center which usually leads to the Queen's Gambit, Slav-defense or Catalan opening",
        "2. Nf3": "this move usually leads to the Colle system which is a slow and boring game, or a transposition to the queen's gambit. White is trying to develop his kingside as soon as possible and to castle on the kingside.",
        "2... e6": "This is a very flexible move. It protects my very important d-pawn and opens a3-f8 diagonal for my dark square bishop. Although it shuts the h3-c8 diagonal for my light square bishop, but as you will see black usually doesn't need this diagonal for the bishop in this structure.",
        "3. Bg5": "This move has been pioneered by Emanuel Lasker. White's idea is to play e3 and to have no problems with developing his dark square bishop. The bishop could be tickled immediately by playing f6, but f6 is not a very good idea because my knight will lose his best square and h4-d8 diagonal will be closed to my queen. Also after playing f6 white will be in a great lead in development and will maintain the initiative for a long time.",
        "3... Nf6": "This is the most preferred move by opening books. Although it is a self pin, but black's queen won't stay on d8 for long. The most important thing is that my knight cannot be attacked by any other white piece for a long time, so this is not a really painful pin.\r\n",
        "4. Nc3": "This move was a surprise to me. Obviously white's best move here was to play c4 and challenge my strong central pawn. If White had played 4.c4 then, after 4...c6 4.Nc3 dxc4!? 5.e4 b5 6.e5 h6 the game would be transposed to a form of queen's gambit called the Botvinnik System; which is one of the sharpest modern openings and leads to an unbalanced and very dynamic game.",
        "4... c5": "A very important move! Now I can exchange my side pawn with white's central pawn. Also my queen now is free and can come into the game in the right moment. Now, I'm planning to put my queen on a5 and exploiting the pin by playing Ne4. This plan is similar to black's plan in the Cambridge Springs Variation of the Queen’s Gambit Declined. If black can execute this plan, he will equalize in an early stage of the game and will seize the initiative from white very soon.",
        "5. e3": "This is the most reasonable reply. White protects his d-pawn and opens a diagonal for his light square bishop.",
        "5... cxd4": "Black exchanges his flank pawn with white's central one, a good positional achievement!",
        "6. Bb5+": "An in-between move. I don't like this move for white because it forces exchange of light square bishops and this is completely favorable for black. So I can put a question mark to this move and consider it a strategic mistake. I think it was better for white to take on d4 with his e-pawn and develop his bishop on e2 or d3.\r\n",
        "6... Bd7": "White is forced to exchange bishops. otherwise he will lose a knight.\r\n",
        "7. exd4": "hmmm... Not the best move I think! When you play with white pieces it is very important to play actively and to retain the initiative. \r\nWhite's initiative is fading by this move and black is almost equalized. \r\nIt was much better for white to first take the bishop on d7 and then \r\ntake on d4. These slight differences may not look very important in the \r\nfirst view; but these differences in fact can play a huge role in the nature \r\nof the game's continuation. \r\nNow I am out of opening book and I should plan for the middlegame. My first objective is to seize white's initiative. If I take White's bishop he has to retake with the knight and then I consider playing Qa5  forcing white to play the reactive Nc3. Then I can put a huge pressure on e1-a5 diagonal by playing Bb4 and white is now has to make just a defensive moves. Also I want to bring my king into a safe home, then try to open up the center and deny white's king from castling. If I succeed in keeping my opponent's king in the center then I can attack him relentlessly!",
        "7... Bxb5 8. Nxb5": "White also had the option to play Bxf6, when I would continue with my plan and play Qa5! which leads to 9.Bg5 Bd4 10.Bd2 Ba6! and white's king is denied from castling and black has the upper hand.",
        "8... Qa5+": "as planned!",
        "9. Nc3 Bb4 10. Bd2": "Now I am attacking white. I could continue my attack aggressively by playing Ne4?!, but I first have to consider the fact that I have problems with my development. My king is still sitting in the middle of the board and my pieces haven't fully developed yet. If I had played 10...Ne4 then after 11.Nxe4 dxe4 12.Ne5! Bxd2  13.Qxd2 Qxd2  14.Kxd2 I can claim that white is much better. Black can't attack any longer and his pawn on e4 is so vulnerable. Also White has got a fantastic outpost for his knight on e5. So I had to play a little patiently!\r\n{White's bishop exchange has cost tempo, and the initiative has passed to Black. \"Only the player with the initiative can successfully attack\". Al}",
        "10... O-O 11. a3": "This move proves that white is in a deep problem. I think this moment was white's best chance to castle and to improve his game a little. \r\n",
        "11... Bxc3": "The best way to retain the initiative!",
        "12. Bxc3 Qa6": "Now white's king is denied from castling. My game is improving with every move and now I have to complete my development and to go after my opponent's king!",
        "13. Ne5": "I think white's best try was to play 13.Bd2 and then after 13...Nbd7 14.c3 Ne4 15.Qe2 Qb6 16.Bf4 white stands well. White may think of playing Nd3 in order to close a7-f1 diagonal to my queen but after 13...Rc8 14.Nd3 Ne4 15.Bd2 Qc4! 16.Rc1 Nxd2 17.Qxd2 Qxd4 black is up a pawn with a great position and will win the game very quickly.",
        "13... Rc8": "developing my rook to a semi open file. Remember Alfred's advise: Don't make a single move, improve the board by your move!\r\n",
        "14. f3": "Black is denying my knight from going to e4, but he is weakening his kingside.",
        "14... Nfd7": "This move may look bizarre to you! By playing 14.f3 white makes my knight meaningless on f6, so I thought to reposition it and to make better use of it. Now white's knight is in a great danger on e5 and can't stay there any longer. If white takes my knight I take it back with a tempo.",
        "15. Nd3": "White retreats his knight to keep it on the board but he is yielding the center and I can consider playing e5 in the near future to open up the position.\r\n",
        "15... Nc6": "Again, improving my game and preparing e5",
        "16. Qd2": "A normal developing move. White may consider castling on the queenside, \r\nbut it is very risky because all of my pieces are now sitting on the queenside too. \r\nYou may argue that black's set up is not pretty here because all of his pieces are sitting in one corner of the board! Yes, you are right. So I need a blow to open up the position and to mobilize my pieces.",
        "16... e5": "This move will leave me with an isolated central pawn structure. But if \r\nyou look deeply to the position you will recognize that this pawn is never \r\nconsidered a weakness because it can't be blocked by white's pieces. \r\nWhen you have a structure with an isolated pawn, usually the best strategy is to push this weak pawn. Remember Victor Kortschnoj advised: Weaknesses must be pushed in order to changed into strengths",
        "17. dxe5": "not a good move! I think white's position is critical after this positional blunder. \r\nWhite should've castled on the kingside: 17.0-0 Qb6(pinning white's pawn) \r\n18.Rf2 (removing the pin) exd4 19.Bb4 Nxb4 20.Qxb4 Qxb4 21.Nxb4 Nf6 22.Rd1 and white would have good chances to survive.",
        "17... d4": "Another in-between move, destroying black's position.\r\n{If this pawn is not removed, Black will have a dangerous knight outpost on e3. Knights work best with queens, and black has both knights left. White's immediate need is to prevent, if possible, the incursion of a knight to e3. Al}",
        "18. Bb4 Ndxe5": "Now you can feel that white is in a real trouble! Let's see how: if white takes my knight on e5 then after 19.Nxe5 Nxb4! 20.c3 (White can't take my d4 pawn because of Nxc2 a family fork!) 20...dxc3 21.bxc3 Re8 22.cxb4 Rxe5  23.Kf2 Qb6  24.Kf1 Rae8, and white is much better.\r\nYou may think of defending white's knight by playing 22.f4 instead of taking black's knight. this is a total blunder because after 22.f4 Nd3 ! 23.Kd1 Nxe5 24.fxe5 Rad8 knifing the queen! \r\nIf white castles on the kingside instead of taking my knight then after: \r\n19.0-0 Nc4 20.Qf4 Ne3 (see how strong my knight is) 21.Rfc1(forced) Re8 \r\n22.Bd2 Nxc2 23.Rxc2 Qxd3 24.Rac1 Re2! and white is in big trouble. \r\nAnd finally if white castles on the queenside he will lose very quickly: \r\n19.0-0-0 Nc4 20.Qf4 Ne3 21.Rdg1 Qa4 22.Ne1 Nxb4 and white's king is attacked by all of my pieces. White can't take my knight because of the queen's check on a1 and mate in the next move. He also can't take my d4 pawn with his queen because of Na2  winning the queen.",
        "19. Kf2": "I failed to find the logic behind this move! White hasn't solved any of his problems by this desparate move.\r\n",
        "19... Nc4": "this precious knight now is attacking white's queen and heading to his fantastic outpost on e3.",
        "20. Qc1 Ne3": "my knight on e3 now is a devastating force. Black is ready to launch the final attack!\r\n",
        "21. Bd2": "white is realizing how dangerous my knight is on e3 and he is going to eliminate it.\r\n",
        "21... Ne5": "There is a nasty trap lying behind this move!! \r\nIf white takes this knight then: 22...Rxc2! 23.Qe1 Qa5 24.b4 Qxe5 and black get back his material with a high interest! \r\nAnd if white takes the e4 knight by the bishop then: 22...dxe3  23.Qxe3 Rxc2  24.Kg1 Nxd3 and white is doomed!",
        "22. Nb4": "Attacking my queen and preventing my rook from penetrating into white's game on c2.",
        "22... Qf6": "My queen has harmoniously joined the attack . Now I have the option of N5g4  a poisonous check! \r\nYou may think that black is going to lose his d-pawn after 23.Bxe3 dxe3  24.Kxe3. Yes, you are right but black will have more than enough compensation for that! The king is coming up the board and I can attack it relentlessly with all of my pieces.",
        "23. Bxe3 dxe3+ 24. Kxe3": "Yes he is coming! You see that my queen and knight are very close to white's king and usually a queen can work very harmoniously with a knight against an enemy king.\r\n{The attack is an instructive example of the way queen and knight work together. Al}",
        "24... a5": "Right after this move I realized that Re8 was stronger, but this move is fine \r\ntoo. Actually this move was a result of a long calculations. If white plays \r\n25.Nd5 then after 25...Qg5  26.f4 Nc4  27.Kd4 Qxg2 28.b3 Qf2  29.Kc3 Qf3  30.Kd4 Nd6 white is going to be mated in a few moves! \r\nIf white plays 5.Nd3 this is even worse! because after 25...Nxd3 26.Kxd3 Qf5  27.Ke3 Rxc2 28.Qd1 Re8  29.Kd4 Qd7# a sad destiny for white!",
        "25. c3": "This obvious blunder made the game even easier to win!",
        "25... axb4": "Beginning the deflection of the White Queen.",
        "26. axb4 Rxa1": "Preparation for the final blow!",
        "27. Qxa1 Qg5+": "Just take a look at this position! White's both pieces are out of the game and all of my pieces are ready to mate this poor naked king!",
        "28. f4": "Not much of a fork!",
        "28... Nc4+ 29. Kf3 Nd2+": "Attack and attack and attack...!!",
        "30. Kf2 Qxf4+": "It is very pleasant to calculate mate in these kind of positions! \r\nIf the king goes to g1 then Qe3 is just mate! \r\nIf he goes to e1 then after 31...Nc4 32.Qd1 Re8  33.Qe2 Rxe2  34.Kxe2 Qe3  35.Kd1 Qd2# So the best try is to go to e2...",
        "31. Ke2 Nc4": "In this moment I saw and announced mate in 5. \r\nLook: 32.Qc1 Re8  33.Kd1 Qf2 34.Qg5 Nxb2  35.Kc1 Nd3  36.Kd1 Qe2#\r\nMy opponent Resigned."
    },
    "url": "https://gameknot.com/annotation.pl/team-match?gm=7837",
    "gameName": "Team match",
    "players": "gocall01 (1846) vs. sirmohammad (1836)",
    "opening": "Queen's pawn game (D02)"
}