{
    "moves": {
        "1. e4": "So, in this annotation, I'm - hopefully - telling you something useful about the theory of French defence, and especially, the classical variation. This is a miniature game, that includes a routine kingside attack, and some use of GK database. French defence is known as an opening that is fairly problem-free, and simple to play for black. Many people do not study it as much as other openings, and now I'm going to show that it might be dangerous; French defence is not that simple for black as many seem to think.\r\n\r\nPartly becouse I use database, I have to admit, that I don't know that much about the openings. Though I know something about the theory, the knowledge has mostly allocated through experience. That's why there might be mistakes in this analysis, so don't be afraid to correct me. You can send me a private message via gameknot, if you disagree with me.",
        "1... e6": "First of all, I don't play French defence as black, so my level of knowledge might be fairly poor for that reason, too. I've played against French only a couple of times, but I see already that there are these frequent themes that keep coming, especially in the classical variation.",
        "2. d4": "I have no idea how much my opponent has played this opening. Those who play French often use it a lot, becouse it is so universal. But if it's the only opening in your openings book against 1.e4, then you really should spend some time with it.",
        "2... d5 3. Nc3": "So, this is the move that I currently favor. Other ideas are exd5 (exchange variation), and e5 (advance variation). The problem with the exd5 is that it often leads into drawish positions. Move e5 is in use today, but, the idea to make black's position narrow doesn't really work. You see it pretty often, but black has very good brakethrough opportunities, mainly the instant c5 (Steinitz variation). \r\n\r\nThen there is Nd2, which leads into various French Tarrash lines. I haven't really played them, but this move is fairly popular now, and is considered as a good option. But if I've understood correctly, this Tarrash variation theory is actually an real art on its own. There are a lot of other options, too, but the classical (Nc3) is the most popular.",
        "3... Nf6": "I use only GameKnot openings database as I play, and in this point, it seems as if white had an advantage. Almost all moves favour white by at least 5 percent. But that's not the reason why a really like to see this move. Nf6 is logical, but I feel that white can pretty easily achieve a problem-free position, where both sides have attacking changes on the sides while center remains closed. This is, of course, usual in all French variations, but in classical variation, I feel that white often gains more mobility, and has a slight edge in development. \r\n\r\nIf black want's to make things tricky for me, Bb4 (the most popular choice, the Winawer defence)) can do the thing. The result is often white's advantage in space (next move is often e5) against black's queenside pawnrush. It's not simple for white to exploit his space in center to develop an attack. The pin itself can be very annoying, too, and black can mess white's pawn structure, but it's not clear whether it turns out to be any real weakness.",
        "4. Bg5": "Not any real options here, except 4. e5, which has the point after 4.- Nf-d7, to go for a straight attack with 5. f4. Black has the usual c5 -counter again.",
        "4... Be7": "This is the most popular and a logical answer. Sometimes, unexperienced players freak out in this point (Oh god, my knight is pinned, gotta get that bishop away!\") and play something crazy, like h6, which causes weaknesses in 4.-h6 5. Bh4, that gets just worse in 5.- g5 6. Bg3, after which the bishop is just great, aiming to move in square e5. If, for example, 6.- dxe4 7. Be5, then it's not clear whether the extra pawn can be defended, or whether it's even worth it, But it might be playable, though.\r\n\r\nA real option is Bd4, which leads into very double-edged situations. 4.- Bb4 5. e5 h6 6. exf6 hxg5 7. fxg7 Rg8 is a well-known line, which is advantageous for black. White can, however, settle with 6. Bd2, or 6. Be3, which both -apperently - favor white. The move dxe4 is can also be played, which seems pretty equal after 4.- dxe4 5. Nxe4 Be7.",
        "5. e5": "This is by far the best option.",
        "5... Nfd7 6. Bxe7 Qxe7": "I wonder if someone has tried 6.- Kxe7?!?!",
        "7. f4": "Move f4 is thematic for white in many French variations. It's a direct attacking move, which must be done before bringing the g1-knight to f3. Nb5 here is gaining popularity, but for me, it seem a bit too sloppy. ",
        "7... O-O": "So here black has two real options, a6 and 0-0. I can't totally understand this a6 move for black in French, but it does two things: it stops white knight (and bishop) from coming to b5, and aids the following queenside pawn attack (black can then play b5 after c5). But the thing is that the white bishop is excellent in d3, and the queenside attack is coming without a6, too, so I can't quite see the point. Of course, it's useful not to allow the knight in b5, but if white didin't play it on the last move, that it's not likely to be a threath before c5 comes.\r\n\r\nIf you go with a6, then you'll end up having your king in the center for a while, becouse the point (7.- a6 8. Nf3 O-O is clearly worse for black) of a6 is to play c5 next. It seems, playble for me, though; 7.- a6 8. Nf3 c5 9. dxc5 Nc6 is a classical, French situation, where it's all about who's going faster. Instant c5 here is definetly premature becouse of Nb5, so I would castle here as black, too.",
        "8. Nf3": "Here you can see white doing something weird, Qd2. I think queen should be left to d1, becouse you can't yet know where you should place her. In d1 she is ready to go to h5, g4 or d3. Nf3 is a very confident, all-round choice, in my apinion.",
        "8... a6": "I give this move ?! becouse it seems to me that this is the reason for black's defeat. I'm pretty sure that there is a way to survive after this, but the correct move was definetly c5. I quess that people are quite afraid of white playing 9. Nb5 in return, but now that the black king is safe, it actually isn't that big of an issue. 8.- c5 9. Nb5 a6 10. Nd6 isn't nice for black, but it's by no means over. In the event of 10.- cxd4 11. Nxd4 f6 12. Qg4, it's not that easy for white to exloit his advantage. Black also has an alternative 9.- Nc6, but I'm not sure whether it's better. 10.c3 gives white a very solid position. \r\n\r\nWhite also has other moves, 9. dxc5 and 9. Qd2. In the latter option, black has a very solid 9.- Nc6. In case of 9. dxc5, black can also play 9.- Nc6, but white does have the advantage, even after black recaptures in 10. Qd2 Qxc5. This is why 9. dxc5 is tempting, and 9. Nb5 might not happen.",
        "9. Bd3": "The only played continuation GK database. Directly aims to the h7 pawn. After this, all variations have only been played less than 10 times in GK database, so notice now that my explanations could go fault.",
        "9... c5": "? Black should have admitted her error, and play a humble move f6. It's not pretty, but it seems that black can equalise. In 9.- f6 10. exf6 Nxf6, white's central pawns seem kind of scattered. White propably has to settle for 9.- 0-0, which seems very equal. The move also has some shock effect; white was going for a kingside attack, but but after f6, black's the one with kingside initiative.\r\n\r\n9.- h6? won't propably quite do the trick. The pawn offers an excellent target for white's attacks (both pawn advances and piece sacrifices), although 10. Qe2?! doesn't seem to be the way to go. Qd2 can be tried, but for me, it seems best to keep the queen in place, to castle instead (10. 0-0), and see what black does. Only then white can determine where the queen should be developed.",
        "10. Bxh7+": "The situation called for this sac, and that's why I'm not giving any !'s. I'm quite sure that moves like 0-0 and dxc5 can be played, but it's much funnier this way.",
        "10... Kh8": "?? The sac must definetly be taken. Now black propably has no way to escape.\r\n\r\n10.- Kxh7 is a very interesting (and fairly well-known) variation. The logical way for white to go is Ng5 . Black king has two places to go (Kh/g8 leads into a mate after Qh5, of course), g6 and h6. 11.- Kh6 loses quickly for 12.Qd3, after which white has far to many mating threaths. Black can sac his rook to avoid getting mated (12.- Rh8 13. Qh3  Kg6 14. Qxh8), but white has then won enough material to win. This sac is thematical in French classical variation, and most of the time, black can survive, if correct moves are played.\r\n\r\n11.- Kg6! is the critical variation. There, white has no straight win if black plays correctly. When white plays the obvious 12. Qd3 , black has a suprising 12.- f5!. White is an exchange up in 13. Qh3 Nf6 14. exf6 Kxf6 15. Nh7  Kf7 16. Nxf8 Qxf8, but it might not be that simple to convert it into a victory.\r\n\r\nWhite can also play in a risky way with 13. exf6 e.p.  Kxf6, and then choose not to take the exchange. White is then two pawns down, but has a great attacking changes. An clear idea might be to build a pin agains the queen in the central lines, with moves 0-0, Rf-e1, and then utilize it with Nxd5. Black can propably survive, but it won't be simple for him.",
        "11. Ng5": "Opens the diagonal for the queen to come to the h-line.",
        "11... g6": "If 11.- f6, then 12. Qh5 fxg5 13. Bg6  Kg8 Qh7X. 11.- f6 12.Qh5 g6! 13. Bxg6  Kg8 14. Nxe6! also loses too much material.\r\n",
        "12. h4": "! It's not that easy to find a move to go here, but once you get it, it actually quite simple (isn't it like that always in chess?). The point is to give white queen an enterance.",
        "12... Kg7": "If king stays in the corner, he gets mated once white queen comes in the h-line. \r\n\r\n12.- f6 now would have propably put up the best fight; 13. Bxg6 Qg7 \r\n14. Qh5  Kg8 15. Qh7  Qxh7 16. Bxh7  Kh8 17. Nxe6 and white has won enough material to win, or the alternative 13. Bxg6 fxg5 14. Qh5  Kg8 15. hxg5 Qg7 16. Bh7  Kh8 17. Bf5 ! Kg8 18. Bxe6  Rf7 19. Bxf7  Qxf7 20. Qh8X is a beatiful mate.",
        "13. h5 Nc6": "13.- f6 here was again the best option, but it, too loses in 14. hxg6  fxg5 15. Qh5 Rxf4 (Balck has nothing better, 15.- Nf6 only delays the inevitable)16. Qh6  Kh8 17. Bg8  Kxg8 18. Qh8X\r\n\r\nAn attempt 14.- f6 15. hxg6 Rh8 15. Qh5 Kf8 16. g7 ! Qxg7 (16.- Kxg7?? 17. Qh6X) 17. Nxe6  Ke7 18. Nxg7 loses the queen.",
        "14. hxg6": "14. h6 ?! leads in nothing directly, but after this move, it's all settled. 14.- f6 won't help after 15. Qh5 fxg5 16. Qh6  Kh8 17. Bg8  Kxg8 19. Qh8X. Notice how either the knight ot the pawn holds the f7 square.",
        "14... fxg6": "Can you see white's killer silent move?",
        "15. Qd3": "!! g6-pawn is attacked twice and can only be defented by black's next move... Allowing the take (Qxg6 ) would also lead into a mate, of course (Kh8 Bg8). Can you see why 15.- Rf5 wasn't enough?",
        "15... Qe8": "Forced. Rf5 is met with g4; black can escape the mate in this line but loses too much material. Black would have got some counterplay with her queen, though.",
        "16. Bxg6": "Now that queen's threathened, only sensible move is Qxg6, which leads into mate in Rh7  Qxh7 Qxh7X. Otherwise, black's queen is lost, and that's why she resiqned.\r\n\r\nSo here's some points about the game, and French classical variation in general:\r\n\r\n- The move 4. -Nf6 is playble for black, but make sure you take a look at other alternatives as well.\r\n\r\n- Decide whether you want to invest time for a6 -move, or go for the straight c5 as black.  If you don't do a6, make sure your king is safe, first. Black should propably castle early.\r\n\r\n- White should not hurry with castling. Sometimes in French, white king castles queenside (to throw all the kingside pawns into an attack), and sometimes he might stay in the center (becouse those pawn chains that often exist in the French make it safe).\r\n\r\n- White should not hurry with queen deployment, either. See first where she is at her best, and move her there.\r\n\r\nLastly, I just wanna tell that in this kind of position, database is very useful. Many players use it here, and if you don't, then that's your own choice but remember, that you're giving your opponent some free advantage. The reason why I use just the GK database is that I don't want it to make everything for me. GK base won't win the games for you, but with it, you're likely to avoid the most common opening traps, and get a playable middlegame position. If you haven't studied that much openings theory, then the database is definetly the way to go. In corresponde chess, databases basicly frees you from studying openings theory, but you still have to make sure that you understand the ideas behind the openings. \r\n\r\nSo in my opinion, using the database makes the corresponde chess a bit funnier than OTB chess, becouse you don't have to spend hours learning opening lines. Of course, you don't have to learn all the openings from heart to play OTB, but the lines are still more important than in corresponde, where you can use database. But I want to make it very clear, that "
    },
    "url": "https://gameknot.com/annotation.pl/team-match?gm=313",
    "gameName": "Team match",
    "players": "maca (1679) vs. gothicgirl (1619)",
    "opening": "French (C14), classical, Stahlberg variation"
}