{
    "moves": {
        "1. e4": "My opponent is White from The Team Scotland Forever. I play the Highland Bagpipes and my favorite to play is \"Flower of Scotland\" along with \"Scotland the Brave\" and \"Mist Covered Mountains.\"\nMy esteemed opponent uses kmcl as his monicker; but like my own monicker we have reasons to choose a monicker when playing in GK!\nKmcl is better known as Ken McLean. He is from the Isle of Islay in the United Kingdom. He is 55 and I am 54 (until I go 55 on the 17th of December).  Go to Ken's Player profile and see him across a board of chess and the pint of the best! \n\nKen opens e4 according to Scotland the Brave! E4 is my preference for being bold and to the point. It is also brave because who ever is across the board has the Ruy or Sicilian or French or Alekhine's or Caro-Kann or others to respond. E4 is brave because it means knowing how to respond to ALL of the above for success. \n\nI like Ken and feel with his history and profile we are of kin. I like him just by looking at his profile. I review his history. \nIn the review I feel I can use my favorite Black Defense against e4 White Open: The Caro-Kann (which I learned in Seminary after playing against a blind seminarian who used it against me! note: pay attention to the opposition's defense against YOUR favorite open--I did and learned more from that game than most games I've played. And my opponent was BLIND). ",
        "1... c6": "This seems such an insignificant move in response to the e4 open. I had not really encountered it before and when this happened to me I thought my blind seminarian was perhaps behind the grand Sicilian and the vaunted French Defense and the common slow Ruy Lopez.  I felt sorry for him after he made that move in seminary but now I know why the Blind Man knew some things I needed to learn; mainly, the Caro-Kann Defense. \nI am not blind and move Caro-Kann. ",
        "2. d4": "Expected. ",
        "2... d5": "The usual progression for Black. ",
        "3. Nd2": "Ken is using a slightly different response here but in the end the Caro is simple and well defined to deal with contingency problems. ",
        "3... dxe4": "Just take the pawn as the Caro-Kann sets up for. \nI just follow the simple rules in Caro-Kann. No complications here at all. ",
        "4. Nxe4": "Expected. ",
        "4... Nf6": "This is one of a few branches of Caro-Kann. ",
        "5. Nxf6+": "A trade. Which pawn should I stack?",
        "5... exf6": "I stack AWAY from the center. Toward the center has less freedom.  The Caro is a freeing defense with many branches of opportunity; plus, you will readily foresee if you are in trouble and you will have the means to respond rapidly. \nI guess this is why the blind man (who introduced me to it) liked it. The year we played this game was in 1984!",
        "6. c3": "White has to defend and block a diagonal and horizontal against his King. ",
        "6... Bd6": "It's a safe time to be safe with my King. Bobby Fischer's first look on any chessboard was to the safety of his King. In Caro-Kann you can develop either way to 0-0 or 0-0-0 depending upon the development. Oftentimes when it is time to castle a Caro-Kann just decides which side to castle. Here it is obvious to 0-0. ",
        "7. Bd3": "White could have done any number of moves.  His infantry is set up well. ",
        "7... O-O": "I fear the Infantry more than the pieces unless the piece is a Queen! ",
        "8. Qc2": "There she goes to send a bishop into a nice threat. \nWell, she couldn't just sit there to get pinned behind a 3 point piece. White can't keep the King where he is.  ",
        "8... g6": "To alleviate the threat by the doubled Queen/Bishop on h7. ",
        "9. h4": "A counter threat! ",
        "9... c5": "I'll wait for White to organize an attack on my ensconced King and try to open back rank pieces to get into action on the Q side...\nRemember; the chess board can be divided into two fields of hostile fire. Just cut the line vertically to divide the Q side and the K side.  Investigate timing and threats on either side individually from either side. Then look at timing....",
        "10. Be3": "White elevates (ordains) the bishop to keep his file, defend the IN Black (LIGHT INFANTRY) attack, And (AND) clears the way for 0-0-0! Scotland Forever is Brave and Bold! I like Ken even MORE! ",
        "10... cxd4": "I am bold and brave to as Scotland! I will not retreat! Especially with my BAGPIPES playing behind the INFANTRY to engage the Enemy! \nEver hear the Highland Bagpipes in Battle? They make the IN inspired to be Bold and Brave. The Pipes are sending them into ACTION at the cost of life limb sorrow suffering and what ever else is associated with being Bold and Brave. \nYou either Love the Pipes or you Hate them.  I love them! ",
        "11. Bxd4": "The pawn had mission needed to the higher ranking officers.  He is slain in the process for the Band of Brothers falling in behind him! ",
        "11... Nc6": "A knight is always a knighted Soldier (or Fusileer) and knows what to do to HONOR the Fusileer that opened the way for a better position in Battle! ",
        "12. Be3": "Where else could White's bishop go? White risked a trade here with the Black Knight but declined. It is better to keep TWO bishops on the board instead of a Knight and a Bishop. We both have our TWO bishops this way for now. In a middle game try to keep TWO bishops and lose the two knights, or, if you have to, keep a bishop with a knight. In the last recourse keep TWO Knights--but then range and circumstances with Knight maneuvers make it harder to clear a board that is already cleared or clearing. ",
        "12... Bg4": "I want to keep White from 0-0-0 here since our Queens are still on the board equally dangerous. \nHowever, my King is safer than White's King. ",
        "13. Ne2": "To 0-0? Or 0-0-0?",
        "13... Re8": "This rook should be a square away from my King on the e rank. The center of the board (whether e or d rank) is where a rook should be. White's knight is now pinned in front of the King and the bishop is also there ahead of the knight. The rook is Field Artillery. In Field Artillery (LIGHT) missions are planned according to vertical (elevation) shelling (by 105mm Howitzers) in front or behind or on target. The lateral is taken care of by other FA in OTHER grids to take the same action.\nNever underestimate the power of the Rook in the rear.  He supports advances by IN (LIGHT) as well as other pieces in on the action. ",
        "14. O-O-O": "So it is 0-0-0. ",
        "14... Qa5": "Getting out the most POWERFUL PIECE on the board! Laterally on the opposition side to play around with that usually unprotected pawn in a 0-0-0; But really White's Queen is on the Queen side and my Queen needs to be on THAT same side for White to deal with her. \nEver see a cat fight? Not with real cats but with real women? \nIt's going to be fun for us isn't it?!",
        "15. Kb1": "He had to do that. ",
        "15... Rad8": "Rooks belong in the center field of fire. Together they can really do damage on both the Q and K side as they are. They are Artillery! ",
        "16. Qc1": "White is providing support to the rear rank. White is getting a bit compressed here. ",
        "16... Ne5": "I'm just pressing forward into White's space. D6 bishop is stymied and the knight can come out and clear up some mud in the water. My King is safe. My Queen is safe. My rooks are where they should be right down the center left or right. ",
        "17. f3": "Good move by White. It means retreating the bishop which is pinning the rook. I expected to have to do something before White made his threat on my pinning bishop. I just wandered my knight out there thinking it was time to do something on the d rank with my d6 bishop. That was my thinking. I always felt I could just slide that g4 bishop out of the way in the event a threat to it emerged. Now the threat has emerged and my reflex is to retract my bishop. Where to put the threatened Bishop now to stay in action? I can't cover my rooks with him the d rank. I CAN put him on e6 to threaten a2 pawn--but that really isn't a big enough threat to block Field Artillery on the e rank. \nThen I saw that I could MAKE White trade with my knight by making a bigger threat than pawn v bishop to knight v Queen. \n",
        "17... Nxd3": "White HAS to make the trade here. ",
        "18. Rxd3": "And White does. ",
        "18... Bf5": "And the pin is back with the rook in front of the King. ",
        "19. Rhd1": "Double rooks are always way more powerful. But my concentration here is on the forward deployed rook that is pinned to the King. ",
        "19... Qa6": "Why not?",
        "20. Qd2": "White moves into a pile of three along the vertical with very powerful field artillery supported by the Queen. Her diagonals are quenched here but her power is in line with HEAVY ARTILLERY! \nMy first reaction was to take the rook with the bishop. I almost took it. \nThere is a saying by somebody I respect: \"If you see a good move, look for a better one.\"\n--Emanuel Lasker\nIs there a better move?\n",
        "20... Qxd3+": "An \"aha\" moment for me. ",
        "21. Qxd3": "I saw it. ",
        "21... Rxe3": "White resigns. "
    },
    "url": "https://gameknot.com/annotation.pl/team-match?gm=47737",
    "gameName": "Team match",
    "players": "kmcl (1831) vs. 9422m (1921)",
    "opening": "Caro-Kann (B12), 3.Nd2"
}