{
    "moves": {
        "1. e4 d5": "Hi, it's jstevens1 here yet again with another game to annotate.  I am a new member of the Sneaky Knights Connection and have completed 12 games so far and scored 7 points.  This is one of the most nailbiting games I have ever played in, although it does not quite measure up to the one against Yakky In \"In Old Matey's Shadow, Part 2\".  However, for a few moves, it did look as though I might cop Old Matey.  I will now start with my first move as black.  This is the first time on gameknot that I have played the Scandinavian Defence - I guess I took some inspiration from Chrisobee - he played that opening against me in the annotated game \"Slow King\" and beat me with it so it can't be a bad opening.\r\n\r\n1...... d5 (the Centre Counter or Scandinavian - to prevent white from totally controlling the centre)",
        "2. Nc3": "2. Nc3 (an unusual response to d5, normally white takes on d5), this is to control the centre with a knight)",
        "2... dxe4 3. Nxe4": "3. Nxe4 (I decide to exchange pawns).  After the exchange the knight comes to e4 and is attacked by the bishop and the knight then retreats to c3.",
        "3... Bf5 4. Nc3 Nf6 5. Bc4 e6 6. Nf3 Be7": "6. ....... Be7 (both of us have been busily developing pieces and are now ready to castle which we do on move 8.",
        "7. h3 h6 8. O-O O-O 9. Re1 Nbd7 10. a3 a6 11. d3 Bd6 12. Be3": "12. Be3 (our development is now almost complete and over the next two moves it will be)",
        "12... Re8 13. Qd2 Bf8 14. g4 Bh7": "14......... Bh7 - the bishop is driven to h7 where he remains right up until the last move of the game!)",
        "15. Kh1": "15. Kh1 - white is planning a pawn storm here supported by the possibility of rooks doubling up on the g file, must watch out for this - fortunately for me this plan will backfire on him later",
        "15... c6 16. Reg1 Nd5 17. Nxd5 exd5 18. Ba2": "18. Ba2 (over the last few moves one pair of knights has been exchanged and the white bishop is driven back to a2.  This will give black serious headaches on this diagonal later in the game)",
        "18... Ne5 19. Qe2 Nxf3 20. Qxf3 Re6": "20. ........ Re6 - another pair of knights is exchanged and the rook goes to e6 preparing to either exchange queens or move over to g6 to counter the white rooks.  Three moves later something interesting is about to happen ......",
        "21. Rad1 Qf6 22. Qg2 Qxb2": "22.......... Qxb2!? - is this a sac or an oversight - I cannot make up my mind.  One thing for sure, white is piling up on that g file!",
        "23. Bb3 Qxa3": "23. ........ Qxa3 - another white pawn bites the dust, what is white up to?",
        "24. Rda1 Qd6 25. Rad1 Qc7": "25. ....... Qc7 - the queen hides away on c7, but it is a potentially useful diagonal leading through to h2.  Now follows an exchange of pawns.",
        "26. c4 dxc4 27. Bxc4 Ree8": "27. ........ Ree8 - the rook is forced back to e8 now the a2 to g8 diagonal is opened - the f pawn is pinned so after an exchange of pawns on the g file my king moves to h8 which becomes more of a prison cell rather than a refuge as the game wears on.",
        "28. g5 hxg5 29. Qxg5 Kh8 30. Bd4": "30. Bd4 - white instantly takes advantage of the situation - I block the diagonal with f6 but unfortunately open up the h2-g8 diagonal next to the king.  The king has no flight squares and my bishop on h7 runs the risk of being pinned.  The air is becoming fetid in his cell, Old Matey is peering through the ceiling, breathing down me poor ole 'enry's (pet name for my king) neck, just waiting to pounce on g7 or h7.  As Bart Simpson would say - \"I'm in trouble, deep, deep trouble!\"",
        "30... f6 31. Qh5 Qf4": "31......... Qf4 - this move saves the day, I think, the white dsb is en prise and he moves to e6 - the queen backs off to f5 - she can do this because although the bishop is pinned the queen is defended because if QXQ the pin is released.  White does exchange queens but in a way which gains a tempo and puts the white rook on g4, preparing a deadly line up.",
        "32. Be3 Qf5 33. Qg4 Qxg4 34. Rxg4 b5": "34. .......... b5 - I am thinking of putting a rook on my second rank to defend my broken castled position so I create a haven square by moving up my b pawn where the rook should be shielded from white's lsb.  It also falls in with a maxim - passed pawns should be pushed (if safe to do so)",
        "35. Ba2 Rad8": "35. ....... Rad8 - this move prepares to put a rook on the 7th rank but also attacks the IQP.  White now pins the bishop.  I try and break the pin with g5 on move 36.",
        "36. Rh4 g5 37. Rh5": "37. Rh5 ??  - falls into the honeytrap, white has overreached himself!  I know his plan, he is trying to pile up on my poor lsb, well, he is in for a shock!",
        "37... Kg7": "37. ........ Kg7 - you would never believe that this quiet king move would lead to a rook being trapped, would you?",
        "38. Rg1 Bg6": "38. ...... Bg6 - but it does!  The \"hapless\" lsb moves off h2 and hammers the final nail in the rook's and my opponent's coffin.  White is well and truly cornered and he waves the white flag.  Wheew!  Don't I get involved in some nailbiters!"
    },
    "url": "https://gameknot.com/annotation.pl/team-match-cornered?gm=14432",
    "gameName": "Team match - Cornered!!!",
    "players": "gabriel442 (1507) vs. jstevens1 (1551)",
    "opening": "Scandinavian (centre counter) defence (B01)"
}