{
    "moves": {
        "1. e4": "This is another requested annotation by team-mate Michael333",
        "1... c5": "Nice to see him copying my openings!",
        "2. Bc4 Nf6": "But this is unusual. If he had only used the Gameknot opening databases, he would have seen that e6 is more popular and scores better",
        "3. d3 h6": "Mutual blunders! 3. e5 is much better than d3 and h6 is just a waste of time. 1. e4 c5 \r\n2. Bc4 Nf6 3. d3 e6 4. Nf3 d5 5. exd5 exd5 was eventually won for Black in Duminica Mariana (2084) vs. Hasznosi Lorand (2062)\r\n",
        "4. h3 e5": "White copies the mistake and Black at last plays a sensible move, although it leaves the d5 square weak",
        "5. Be3 Be7": "Both sides develop",
        "6. Nf3 O-O": "Black just leaves his e pawn hanging",
        "7. Nc3 Nc6": "Which White misses also....",
        "8. a3 a6": "White is coming up with a bad plan....",
        "9. b4 cxb4": "Which loses a pawn",
        "10. axb4 Bxb4": "Black takes",
        "11. Bd2 Qe7": "Interesting position, White has some compensation for the lost pawn in open a and b files, and perhaps more central control. I would prefer 12. 0-0 here",
        "12. Nd5 Nxd5": "It is not a good idea to exchange pieces when materially down",
        "13. Bxd5 Bxd2+": "Black exchanges again",
        "14. Qxd2 Nb4": "and hits the strong bishop on d5",
        "15. c3 Nxd5": "Black correctly takes it",
        "16. exd5 d6": "good idea to put pawns on Black sqaures to enhance the powers of the white squared bishop on c8",
        "17. O-O Bd7": "Both sides develop",
        "18. d4 exd4": "I prefer 18....e5 - although it may be strategically poor to put a pawn on a white square and restrict the movement of the bishop, I think this is more than compensated for by driving the knight back and not undoubling the white d pawns. By capturing back with the knight now, the knight would have a lovely central square.",
        "19. Qxd4 Rfc8": "I would prefer to put the rook on e1 and contest the only open file, the e file.",
        "20. Rac1 Bb5": "I prefer b5 and if White plays c4, then exchange pawns and then play Bb5. White could play c4 now, but what he plays is reasonable too",
        "21. Rfe1 Qf6": "Black prefers to have weak king side pawns instead of an inactive queen against an active queen. I prefer Qc7",
        "22. Qxf6 gxf6": "So black takes back",
        "23. Re7 Rab8": "White has good compensation for the pawn now, in his active rook and play against the broken black king side pawns.",
        "24. Nd4 Rce8": "Black correctly seeks a rook exchange",
        "25. Rce1 Bd3": "A terrible mistake! White could have just taken on e1 and been a rook up with a winning position, but.....",
        "26. Rd7 Rxe1+": "Now it is Black who is a rook up",
        "27. Kh2 Rc8": "and, the position is hopeless for white, who resigns. Thanks for reading this, please leave a comment and rate the annotation"
    },
    "url": "https://gameknot.com/annotation.pl/team-match?gm=42695",
    "gameName": "Team match",
    "players": "obuta55 (1212) vs. michael333 (1239)",
    "opening": "Sicilian defence (B20)"
}