{
    "moves": {
        "1. d4": "My standard.",
        "1... Nf6 2. c4 e6 3. Nc3 a6": "Unorthadox, but solid.",
        "4. Nf3 h6": "More defensive posturing.",
        "5. e4 d6": "Black has committed himself to defending, and hopes to counter-attack later on.",
        "6. Bd3 Nc6 7. a3": "0-0 was probably better. I made this move to prevent Nb4 saving my light squared bishop from moving again.",
        "7... Bd7 8. h3": "Now I get defensive......my ex-wife used to say that about me all the time.........:)",
        "8... Be7 9. Be3 O-O 10. O-O": "And we are both developed and castled........",
        "10... e5": "Black starts the fighting........",
        "11. d5": "With hopes of doubling his pawns after 11...Nd4 12. Nxd4 exd4 13. Bxd4.",
        "11... Na7": "Janis is far too crafty for that..........I can see he is wanting to expand on the queenside........",
        "12. b4": "So I step up.......",
        "12... c6 13. a4 cxd5 14. cxd5": "The c file is now up for grabs......",
        "14... b6": "? The telling move of the game. I don't know if black saw me capturing a6 or not. This weakness will be exploited severely for the next 49 moves (the rest of the game).",
        "15. Bxa6 Nc8": "I think he realizes his error........",
        "16. Bd3": "White's light squared bishop retreats back to where he was, and my mindset is to start eliminating everything in sight - pressing my new found pawn advantage into a quick endgame. manhattan is no pushover though, and he struggles fiercely to resist.",
        "16... Qc7": "Staking a claim on the c file.......",
        "17. Qb3": "Protecting my knight, and setting up to load the c-file.",
        "17... Bd8 18. Rfc1 Qb7 19. b5 Ne7": "This knight continues to try find a place to live.",
        "20. Ne2 Ng6": "I'm thinking black wants to start a riot on the kingside.",
        "21. Nd2 Bc7 22. Nc3 Rfc8 23. Nc4 Ne8 24. Na2": "Preparing Nb4 and pushing on the queenside.....",
        "24... Bd8": "Notice that black is no imminent danger, but his pieces are rather restricted.",
        "25. Nb4 Ne7 26. Na6": "! Strong. This posting proves effective for the duration of the game.",
        "26... Kh7 27. f4": "Sensing that d6 can be weakened after 27...exf4 28. Bxf4.",
        "27... f6": "Black probably sees my idea, and thwarts it easily. The catch is, he has further restricted his Ne8.",
        "28. f5": "Continuing to squeeze the position.",
        "28... Kg8 29. Ra2": "C file here I come:)",
        "29... Kf7 30. Rac2 Kg8 31. Na3": "Welcoming the exchange. I can come out even and still own the c file.",
        "31... Rxc2 32. Rxc2 Rc8 33. Rxc8 Bxc8": "I had calculated he would have recaptured with the queen.",
        "34. Nb4": "Seeing a 3-1 pawn advantage on the queenside after an exchange of knights on c6.",
        "34... Bd7": "As usual, my good friend manhattan can read my mind.",
        "35. h4": "With dreams of pawns on g4 and h5 to totally lock the kingside.",
        "35... Qc7": "Obviously, there is no way I allow black to retake my c file......",
        "36. Qc4 Qxc4 37. Nxc4": "At this point, all of my efforts go into pushing up the queenside. It may seem a bit odd, but in retrospect black's best defensive piece is now his king, and he has a way to go to get over to the action. Both of black's bishops are weak, and the time needed to get a knight to b7, then to a5 (getting behind me) is just far too great. Black digs in, and hopes to win back the pawn he lost earlier by doubling up his attack on one of my pawns. Which one, at this point, is still unclear to me.",
        "37... Nc8 38. Nc6 Bc7": "Perhaps trading his weakend bishop for my knight may have been the play here....",
        "39. Bd2": "I see action on a5 on the horizon.",
        "39... Kf7 40. a5 bxa5 41. Bxa5 Bxa5 42. Nc4xa5": "This game is all about my passed pawn. Can I push it? Can he stop it?",
        "42... Nc7 43. Nb7 g6": "With my queenside advance temporarily stalled, manhattan pushes on the other side.",
        "44. g4 gxf5 45. gxf5 Ke8": "Maybe Be8 was better, with the idea of getting it to h5.",
        "46. Kf2": "I figure I'm gonna need His Majesty in the attack eventually, so I better get him moving.",
        "46... Kf7 47. Nbd8+": "This check was designed to push black's king even further away from the queenside.",
        "47... Kg7 48. Nb7 Kf8 49. Kf3 Kg7 50. Ke3": "I realize that the kingside is safe, so my king heads towards the action.",
        "50... Kf8 51. Kd2 Ne8": "Now I'm guessing black envisions this knight flanking to the kingside.",
        "52. Kc3 Kf7 53. Kb4 Kg7 54. Ka5 Kf7 55. Nbd8+": "Again, pushing black's king away.",
        "55... Kf8 56. b6": "Now it is safe to push the pawn. Black is forced to take.",
        "56... Nxb6 57. Kxb6 Kg7 58. Bb5": "Now to go to work on exchanging bishops.",
        "58... Kf8 59. Na7 Bxb5 60. Nxb5 Ke7 61. Ne6 h5 62. Kc6 Kf7 63. Nxd6+": "And black resigned. Black's 14...b6 proved to be his undoing. A satisfying win after manhattan has OWNED me for the last couple of years:) "
    },
    "url": "https://gameknot.com/annotation.pl/team-match?gm=338",
    "gameName": "Team match",
    "players": "tag1153 (1522) vs. manhattan (1516)",
    "opening": "Nimzo-Indian defence (E20)"
}