{
    "moves": {
        "1. c4 e5": "I don't know what this opening is, and I don't know what opening mine is.  I just figured claiming the centre and opening my bishop was good here.",
        "2. Qc2": "never seen this before",
        "2... Nf6": "development",
        "3. a3": "not a bad move, but more pawns in this opening than I'm used to seeing.  no minor pieces out yet.",
        "3... Nc6 4. e3": "more pawns... what is white up to?",
        "4... d6": "solidify the chain, I can afford to move a pawn as I'm up on development.",
        "5. Nc3": "great, but how is white going to free up that dark-squared bishop?",
        "5... Bg4": "my thinking here is that I might be able to get his pawns to chase me all the way down to g6 and ruin his pawn defense.  if he doesn't, then at least i pose as a bit of threat.",
        "6. h3 Bh5 7. g4 Bg6": "great.",
        "8. Qb3": "oh oh, my f7 is now vulnerable",
        "8... Na5": "chase the queen back a bit, or hopefully move to a4 to get off of this diagonal",
        "9. Qa4+ Nc6 10. Nd5": "i always get worried when knights come storming in like this. ",
        "10... Nxd5": "i realized that i probably shouldn't have just done this. blunder",
        "11. cxd5 Be4": "i'm thinking rook, but now my bishop isn't protected.  another blunder.   wtf",
        "12. Qxe4 Nb8 13. Qa4+ Nd7 14. Nf3 Qf6 15. Be2 Be7 16. Rb1 O-O": "weathered the storm, but down in material.  my only chance now is stellar play (unlikely), or a few blunders by white.",
        "17. b3 Nb6": "fork queen and pawn(big pain)",
        "18. Qb4 Nxd5": "sweet, and i pick up some tempo",
        "19. Qxb7": "no concern there.  my pawn was less valuable than the d5 pawn",
        "19... Qg6": "rook attack... offering up my knight.",
        "20. Qxd5 Qxb1": "sweet.  blunder that i needed.  is it good chess strategy to account for your opponent's blunders?  :)",
        "21. O-O": "smart",
        "21... Rab8 22. b4": "smart",
        "22... Qg6": "get my queen out of there",
        "23. Bd3 Qh6 24. Kg2": "not certain where I can go, but i do see that if a pawn moves to e4, i fork the bishop and knight.",
        "24... Rb6": "i plan on moving c6, need backup.",
        "25. Be4 c6 26. Qd3 g6 27. Qc2 d5 28. Bd3 e4": "nice",
        "29. Bxe4 dxe4 30. Qxe4 Re8": "perhaps a discovered attack comes next?",
        "31. Qd4 Rb7 32. Bb2": "oh my... mate in one.  i have one move.",
        "32... f6 33. Qc4+ Kf8 34. Bd4 Rc8": "protecting loose pieces",
        "35. Qa6 Rcc7 36. Qa4": "i guess white's moving back to that g8-a2 diagonal",
        "36... f5": "i need to press forward",
        "37. Ne5 fxg4": "it's going to be a race to who can trap the king first.",
        "38. Qb3": "i can save this with Bd6, but I really want that g4 pawn in place.",
        "38... Qxh3+ 39. Kg1 Bd6": "now i'm protected, and white needs to deal w/ my attack",
        "40. f4": "not so certain about this.",
        "40... g3 41. Nf3 g2 42. Kf2 gxf1=Q#": "done.  i got lucky a few times..  but i also gave away pieces too.  any feedback would be greatly appreciated.. especially on how my mind is thinking.\n\ncheers."
    },
    "url": "https://gameknot.com/annotation.pl/team-match?gm=37211",
    "gameName": "Team match",
    "players": "barry628 (1211) vs. unohuim (1307)",
    "opening": "English opening (A20)"
}