{
    "moves": {
        "1. e4 e5 2. f4 exf4 3. Nf3 d6": "The Fischer Defense, taking e5 away from the knight. This makes 5.h4 questionable, since 5. ... g4 displaces the knight.",
        "4. d4 g5 5. h4": "5.g3 is a solid alternative.",
        "5... g4 6. Ng1 Qf6 7. Nc3 Ne7 8. Nge2 Bh6": "If White can regain the pawn his mobile center will assure him the advantage. ",
        "9. Qd2": "9. g3 is more common, but no better according to John Shaw (The King's Gambit, Quality Press).",
        "9... Nbc6": "Counterattacking d4 since f4 can no longer be held.",
        "10. g3": "10. Nb5 is more popular, and the move recommended by GameKnot's chess engine. Shaw does not think Nb5 is good for more than equality, as Black has the safer king and the better coordinated pieces. ",
        "10... Bg7": "Shaw gives this position as =/+, and his analysis does not include White's reply. Black's pieces are better coordinated than White's, and Black has a lead in development. Plus it appears that Black will be able to maintain the extra pawn for the moment. I don't like the computer's recommendation of 10...Be6, as it puts it in a precarious position. If 11. d5, Ne5 will suffice, but if 10.gxf4, Black has nothing better than 10...d5, which gives white a protected passed e-pawn. ",
        "11. Qxf4 Nxd4 12. Nxd4 Qxd4": "Black has the freer game plus an extra pawn.",
        "13. Nb5 Qc5 14. Be3": "The computer's line with 14. Qe3 avoids the following material loss.",
        "14... Qb4+ 15. c3 Qxb2 16. Rd1 Bxc3+ 17. Bd2 Bxd2+ 18. Rxd2 Qc1+ 19. Kf2": "If 19. Rd1, Qxf4 and 15. ... Kd8 with a winning ending.",
        "19... Qc5+ 20. Kg2 a6 21. Nd4 Qe5": "White must either move his queen and allow the Black queen to reign supreme on e5 or trade down to a lost ending.",
        "22. Qe3 f5 23. Qb3": "23. Re2 avoids losing more material but permits Black to force a winning ending, as the computer's recommended line shows.",
        "23... fxe4 24. Be2": "While it is necessary to get the Bf1 and Rh1 into play, this takes the knight's best square -- hence Black's reply.",
        "24... c5 25. Nc2 Be6": "The mobile Black center pawns will soon become a nightmare for White. if 26. Qxb7, Bd5! is a killer."
    },
    "url": "https://gameknot.com/annotation.pl/team-match?gm=55502",
    "gameName": "Team match",
    "players": "gideo (1827) vs. rob9258 (1913)",
    "opening": "KGA (C34), Fischer defence"
}