{
    "moves": {
        "1. e4 c5 2. Nf3 e6 3. d4 cxd4 4. Nxd4 a6": "its a thematic move in sicilian since the black queen finds a good place in c7 and helps in the queen side attack which is the motive behind blacks second move. without this pawn push the queen is sent back with a tempo for white",
        "5. Nc3 Nc6 6. Be3 Be7 7. Bd3": "I think 7. Bc4 is better it keeps the dispute on the d5 square hot enough",
        "7... d6": "making a way for the light colored bishop so that the rooks are connected",
        "8. Qg4": "queen comes out in the king side to bolster the attack on the king. in sicilian white is developing an attack in king side in mind where the black in developing to counter that and attack on the queen side",
        "8... Bd7": "the king knight pawn is not a good option to take with the queen since white wants to castle in the king side. for example 9 Qg7, Bf6 and black loses the knight",
        "9. Nxc6": "so he decides to remove the knight which hangs there, but in all this cancellation loses a tempo for white",
        "9... Bxc6": "now the light color bishop for black  is very powerful, and it will be dangerous for white to castle on the king side after this",
        "10. O-O": "? not a good move",
        "10... Nf6": "the g pawn is still free to take.",
        "11. Qg3": "just moves the queen to a safe place but still asserting the possibility of attacking on the g pawn",
        "11... Qd7": " !? preparing to castle on the queen side, but it is a bad move to that end since it cannot prevent white from preventing blacks 0-0-0",
        "12. Bb6": "preventing a queen side escape of black king",
        "12... O-O 13. Be3": "keeping the bishop ready for king side attack ",
        "13... Rfe8": "making space for the dark colored bishop to return to its home square if needed",
        "14. Bh6": "and it is needed",
        "14... Bf8": "this defence is better than pushing the g pawn since it does not creat hole in g7 for the opponent bishop to keep its influence",
        "15. Bg5 Kh8": "unpinning the g pawn",
        "16. Bxf6 gxf6": "black's intention to open the g file has come true, with a cost of a hampered king side , but the white pieces are not in good position to take advantage of that",
        "17. Qh4": "eyeing at the f pawn",
        "17... Be7 18. f4 Reg8": "occupying the g file immediately",
        "19. Rf2 Rg7": "both wants to double the rooks",
        "20. f5 Rag8 21. Raf1 exf5": "a triple pawn, I have heard that four pawn once had lined up in a tournament game, but three is the maximum that happened to me and only in this game so far",
        "22. Rf2xf5": "?? not e4xf5 since that will block the white bishop for ever , but this is a very bad move since it clears the g2 pawn in front of the king under attack",
        "22... Rg7xg2+ 23. Kh1": "only place to go for the king but infront of  blacks light colored bishop, even though it is separated by a pawn often this kind of situation is not good",
        "23... Qxf5": "! of course , white cannot take the queen its perfectly safe there, because if 24. RxQ ? Rg1#\nif 24. e4xQ Rg1#",
        "24. Nd5": "?",
        "24... Bxd5": "! cannot take the queen again!",
        "25. exd5": "! threatning blacks queen which cannot be  moved safely without checking the king because 26. Qxh7#",
        "25... Rg2g1+": "making a way for the queen to check",
        "26. Rxg1 Qf3+ 27. Rg2 Qxg2#": "# \nIt was a really wonderful  game, I thank chessmeastro for this excellent chance to play with him. I hope that it was as amusing to you all, please feel free to PM me any comments you have in mind, cheers, himu (himadri mukherjee) "
    },
    "url": "https://gameknot.com/annotation.pl/team-match?gm=5363",
    "gameName": "Team match",
    "players": "chessmeastro (1623) vs. himu (1619)",
    "opening": "Sicilian (B43), Kan, 5.Nc3"
}