{
    "moves": {
        "1. d4": "Takes control of the center, c5 and e5, from the center. Opens a bishop line. Signals intent to play a positional game. The pawn is protected.",
        "1... Nf6": "Black plays a covert response which can translate into many openings. Controls d5 and e4. The knight is protected.",
        "2. c4": "A flank aproach to controlling the center, b5 and d5 squares. Unprotected piece that has only e7-e5 to contend with for an attacking move. This move would however provide a trade of flank for center pawn. The opening is taking on an Indian flavor.",
        "2... e6": "Heading towards what could be a Nimzo Indian opening, but other openings can spring from this position. Contests control of d5, controls f5. Controls some of the center from a defensive position.",
        "3. a3": "E00 Queens Pawn Anti-Nimzo-Indian Opening to this move. Typically d7-d5 is played next. This move controls b4 which prevents Bf8-b4+. White controls more center, has more space, has some defensive measures in place, but lacks piece development.",
        "3... c5": "A flank attack on a center pawn. Contends control of b4. Blockades c4. Threatens c5xd4. Offers d4xc5, Bf8xc5 with an attack on f2 - but with the bishop susceptable to a b2-b4 attack. The pawn is protected by the bishop. Black is fighting for the center. Opens up the Queen check line of Qd8-a5+. White should respond with Nf3 or e3 to capture back with a piece that is resistant to attack by the B8 knight.",
        "4. e3 Bd6": "Black takes advantage of quick development and moves towards king safety. The bishop appears awkward here, but does offer an attack later via Qd8-c7 with an attack directed towards h2 where white must presumedly castle. Its is an ambitious move, but I feel Be7 is better. Maybe because of white gaining space by d4xc5, Bd6xc5, b2-b4, Bc5-e7. Rate as ?! and = because white can make positional gains, but black has a lead in piece development. There is the debate of expansion of space for white verses piece development for black. There is an imbalance between the applied strategies.",
        "5. Bd3": "White moves for piece development instead of continued pawn expansion by the previously mentioned line that chases the bishop at d6. The imbalance shifts some, but black still maintains a lead in piece development.",
        "5... cxd4": "Black attempts to take away some of the protected control of the center from white. The result is after e3xd4 the pawn at d4 is not protected and contention of f4 is more balanced with B vs B instead of B vs P. It is true that d4 is safe for white for the moment and white still has more space and a 2 point pawn front on the 4th vs the 1 point pawn presence at e6. The move 0-0 looks better. Rate +\\= because black drops the momentum of developing for a pawn move.",
        "6. exd4 Qb6": "Black launches a queen attack, but overlooks a tactic by white. Rate as ?? and +\\- because black will lose a piece from this move.",
        "7. c5": "White takes advantage of previous move. Rate as +\\-",
        "7... Bxc5": "There is no better move.  Some tries are Qb6-a5+, Bc1-d2 refutes. If Qb6-a5+, b2-b4, Bc5xb4  !, and a3xb4 loses the rook - so is avoided. The knight can block at c3, but it is a passive move.",
        "8. dxc5 Qxc5": "Black does end up at only -1 point, but pieces can accomplish more than undeveloped pawns so the trade-off of the bishop for the 2 pawns is not beneficial tactically, positionally, or materially. The center is open which provides white much freedom for the bishops and the black queen is an unprotected target for the bishops.",
        "9. Be3": "White takes advantage by attacking to gain tempo and developing a piece.",
        "9... Qe5": "Black attempts to attack the b2 pawn while pinning the bishop. The move is not successful and only helps white to develop and gain tempo. Rate as ? because the move helps white to develop and because the queen has moved to a vulnerable square because of Ng1-f3.",
        "10. Nc3": "This move blocks the threat of Qe5xb2 while developing a piece. White stands better.",
        "10... d5": "Black has forgotten about the king and continues to pursue an attack by hoping to obtain a fork by d5-d4. Rate this move as ?! because it has limited potential as an attack, while it does gain some central control.",
        "11. Nf3": "White continues to develop, this time with tempo gained by attacking the queen. White is 2 moves from a fully developed back rank.",
        "11... Qd6": "Black hopes to push the pawn to obtain a fork, but the threat is stronger than the execution.",
        "12. O-O": "White castles for development and safety. The fork is not a serious threat.",
        "12... b6": "Black is still working for an attack, but positionally is standing badly with an unprotected queen and lack of piece development. The idea is to follow with Bb8-b7 to apply pressure down the long diagonal.",
        "13. Nb5": "White attacks the queen with the idea of Ra1-c1 to support the move Nb5-c7+ and a winning fork. Rate as ! for the concept.",
        "13... Qd7": "Black sees the move Nc7+, but does not see the assisting move of Ra1-c1.",
        "14. Rc1 O-O": "Black obtains king safety at the expense of the rook. There is no better move.",
        "15. Nc7": "Rate as ! for the continuation of the idea started at move 13.",
        "15... Bb7 16. Nxa8": "White transitions from +1 to +3 points securing a material edge. Rate as +\\- because of the material advantage combined with a positional advantage gained by better piece placement.",
        "16... Bxa8 17. Qc2": "White begins to setup an attack on the king by targeting h7. The knight at f6 will have to be eliminated to free the protection of h7.",
        "17... d4": "This move does not accomplish anything and is easily refuted. Black may have been thinking Be3xd4, Ba8xf3, g2xf3, Qd7xd4 winning a bishop - not a very good or likely line.",
        "18. Nxd4 Bxg2": "Black overestimates the success of this move hoping Kg1xg2, Qd7-d5+, Kg2-g1, and continued manouvers using the queen and knight in an attempt at mate.",
        "19. Kxg2": "White now stands very much better materially and even with the risky appearance of the king on g2 is fine positionally. Rate +\\- with +6 points.",
        "19... Qd5+ 20. f3": "The refutation.",
        "20... Ng4": "Black aims for Ng4xe3 with a grand fork of K, Q, R. The pin prevents the capture of the knight. Not a bad try but for the bishop can escape while maintaining control of the e3 square.",
        "21. Bg1 Nd7": "Black moves another piece into the fray, but unfortunately it is a knight travelling from the opposite side of the board and will not gain ground quickly enough.",
        "22. Be4": "There is no move that will afford black an advantage. Black resigns. If Qd5-g5 in hopes of a revealed attack by moving the knight, then f3xg4, Qg5xg4+, Kg2-h1 and the attack is over. Win 1-0."
    },
    "url": "https://gameknot.com/annotation.pl/team-match?gm=8510",
    "gameName": "Team match",
    "players": "chessknave (1408) vs. stephendedalus (1408)",
    "opening": "Queen's pawn game (E00)"
}