{
    "moves": {
        "1. c4": "i like english as white or black",
        "1... Nf6 2. Nc3 g6 3. Nf3 d6 4. d4 Bg7 5. e3 O-O": "black is ready to the expanse on king-side.",
        "6. Be2 Nbd7 7. O-O": "white is ready to attack on the queen side.",
        "7... Re8 8. e4 e5 9. dxe5 Nxe5 10. Nxe5": "I am not that good with the theory, but i have the impression that this move is giving the advantage to black.",
        "10... Rxe5 11. f4 Re8 12. Bf3 Nd7 13. Be3": "well, I never miss that kind of occasion.",
        "13... Bxc3 14. bxc3": "black has now a well-structured pawn structure. White has a queen-side in a pity condition. At last, there has been no king-side attack from black  neither queen-side attack from white, but this is all because white has chosen this atypical middle-game.",
        "14... Nf6": "back on best place.",
        "15. Qc2 Bg4": "finishing the opening after the middle-game has started.",
        "16. e5 Bxf3 17. Rxf3 Ng4 18. Rd1": "threatening clearly to destroy my pawns structure... If you can, try to guess my next move, i have been thinking quite a lot on it.",
        "18... Qh4": "that's right, lady...",
        "19. g3": "as planned.",
        "19... Nxe3": "and this is why g3 was not really indicated.",
        "20. Rxe3 Qg4": "now, exd is forbidden of course...",
        "21. Rde1 Rad8": "and now my structure remains intact.",
        "22. exd6 Rxe3 23. Rxe3 Rxd6": "black is really better, thought there is no material advantage. ",
        "24. Re8+ Kg7 25. Kg2 Qd7": "threatening Rd2...",
        "26. Re2 Qc6+ 27. Qe4 Qxe4+ 28. Rxe4 Rd2+": "ouf... grasping a pawn!",
        "29. Kf3 Rxh2": "better this one, of course, where the white structure is better. Now black has the possibility to save a bad pawn or to take a good one.",
        "30. Re7": "takes the good one",
        "30... Rxa2": "takes the bad one.",
        "31. Rxc7 Rb2": "saving the nicest.",
        "32. Rd7 a5 33. Rd5 Ra2 34. Rb5 Ra3": "threatening to clean the (ex-)queen-sides",
        "35. Ke4 Rxc3 36. Kd4 Rxg3": "cleaning everything now :-)",
        "37. Rxa5": "and finally, the g and h pawns will be the decisive ones... ",
        "37... Rb3": "to avoid the advancing of c-pawn. Rb5 would not resolve, because h-pawn will arrive before an aventual white pawn on queen-side",
        "38. Kd5 h5 39. c5": "it is not as scary as it looks.",
        "39... h4 40. Kd6 h3 41. Ra2": "forced. ",
        "41... Kf6": "hehe... finally his majesty is in... I was waiting for the good occasion",
        "42. Rh2 Kf5 43. Rf2 f6 44. Kc7": "pointless. i guess, panicking.",
        "44... Kg4 45. Kd6 Kg3": "the king pushes the defender. Rooks are bad defenders, actually, when they are confronted to pawn and king.",
        "46. Rf1 Kg2": "pushing...",
        "47. Re1 g5 48. f5": "probably the best move, but this allows me to pushes g-pawn further.",
        "48... Kf2": "pushing...",
        "49. Rc1 h2": "\"step by step\".",
        "50. Rc2+ Kg3 51. Rc1 Kf4": "the rooks is blocked on line 1, so the king can go back on f-column, gaining a tempo by threatening the pawn, forcing white to play...",
        "52. Ke6": "this...",
        "52... g4": "and this is definitive... there is nothing more that can save white now, unless i give up... Actually, as white, I would have resgined much sooner.",
        "53. Kxf6 g3 54. Rf1+ Kg4 55. Re1 g2 56. Re4+ Kf3 57. Ke5 Re3 58. Rxe3+ Kxe3 59. f6 g1=Q 60. f7 Qg7+ 61. Ke6 Qf8 62. c6 bxc6 63. Kf6 h1=Q": "that's all folks. Tomorrow, I will comment a lost game, for a change... I have a lot of them too, but usually my lost games are a real mess... I recently lost a game against mandrake that is a beauty from him. I'll try to show you."
    },
    "url": "https://gameknot.com/annotation.pl/team-match?gm=35557",
    "gameName": "Team match",
    "players": "dgrandman (1642) vs. thitho (1760)",
    "opening": "English opening (A16)"
}