{
    "moves": {
        "1. e4 e5": "I'll comment only from black's perspective, and taking a quick look through. I'm not analysing in any depth, so look for yourself at other possibilities, and don't be afraid to mention my oversights and errors !",
        "2. Nf3 Nc6 3. d4 exd4 4. Nxd4 Bc5": "All standard and reasonable so far, remember not just the moves in an opening, their sequence too",
        "5. Be3 Qf6": "This move does not look especially bad at first glance but remembering some of the team tips here are a few pointers \r\n- usually develop N and B before R or Q \r\n- early Q development can leave it vulnerable \r\n- Q is blocking f6 (stops Nf6) \r\n- creates weaknesses like c7  \r\n- Bc8 is still blocked in \r\n- still 2 moves required to castle\r\n",
        "6. c3 Nge7 7. Bc4 d6 8. O-O Ne5": "white has not exploited the vulnerable Q or the obvious weaknesses to any great extent. Now black has space and options that looked unlikely 3 moves back",
        "9. b4 Nxc4 10. bxc5 dxc5 11. Nb5 Qc6": "I really don't like this position for the Q. I would spend some time to look for better alternatives here. ",
        "12. a4 Be6": "Not a bad move but a bit passive. I would have looked at a6 or 0-0 first. Consider also NxB followed by 0-0",
        "13. Bf4 Nd6 14. Bxd6 cxd6 15. Nxd6+ Kf8 16. e5 Rd8 17. Na3 a6 18. Nac4 Bxc4": "White's blunder should be game over really.  Black now needs to think about simplifying the position and swapping off material until his extra piece is decisive. First objective take off that N on d6, second get all pieces active.",
        "19. Re1 Bd5": "Nc8 puts more pressure on the N(d6) and will probably win the e5 pawn too and leave Q   R in control of d file. Nice and simple ! ",
        "20. Qh5 Ng6 21. Rab1 b6": "I would have looked at Nxe5 or even RxN ",
        "22. Qg5 Rd7 23. h4 h6": "Nxe5 finishs off the game",
        "24. Qg4 Be6": "It is even more obvious here Nxe5. Even h5 makes room for the R to come into play",
        "25. Qg3 Ke7": "I don't like this. K is vulnerable now on black square",
        "26. h5 Nf8": "Now 2 pieces are locked on the back rank - but I won't mention the obvious N move Nxe5. I think this type of thoughtless move comes from playing too many games together, playing too quick, or just not giving adequate analysis time to each move. ",
        "27. Qh4+ f6 28. f4 Rxd6 29. exd6+ Kd8 30. c4 Rg8 31. a5 Bxc4": "Not an outright blunder this is not really improving the position. b5 looks better followed by g5 which gets the R into action",
        "32. Rxb6 Qc8 33. Reb1 Nd7 34. Rb6b7 g5": "Bb5 separates the rooks and gets that hanging B out of harm. I thought that was the logic for Bc4 in the first place",
        "35. fxg5 Rxg5": "Careless. ",
        "36. Qxc4 Qc6 37. Rb1b2 Qxd6": "Rxg2  gets the combined Rs off the case   leaves black 2 pawns for an exchange",
        "38. Rb2b1 Qg3 39. Rb7b2 Qe3+": "Rxh4 is worth a try",
        "40. Rf2 f5": "Ne5 looks better with a threat of Nd3 or Ng4 coming",
        "41. Qxa6 f4": "Marching the pawn takes way too long",
        "42. Qa8+ Ke7 43. Qf3 Qxf3 44. Rxf3 c4": "If you must give up the f pawn take h5 with c protected",
        "45. Rxf4 Rxa5 46. Re1+ Kd8 47. Rxc4 Rxh5 48. Re6": "white misses the chance to wrap this up - pin the N first, then use the other R to force the K to defend from d8 and follow by doubling Rs winning the N. Always look at the simple option first. ",
        "48... Ne5 49. Rd6+": "Yet again white misses the win. Rd4  followed by Rd5 wins the N",
        "49... Ke7": "White does not have a plan here. \"A bad plan is better than no plan\" The black R is poorly placed on the edge and white could have pushed the K onto the c file before ",
        "50. Rcd4 Rg5 51. Kf2 h5 52. Ra6 Ng4+ 53. Kf3 Rf5+ 54. Rf4 Rd5 55. Rh6 Rd3+ 56. Ke2 Rg3 57. Rxh5 Rxg2+ 58. Kf3 Nf6 59. Re5+ Kd6 60. Ra5 Rg6 61. Ra6+ Ke7": "It is clear that white is unsure how to proceed but black deserves credit for avoiding trouble and not making it easy",
        "62. Rb4 Rg7 63. Rb7+ Nd7 64. Ke4 Rf7 65. Kd5 Rf5+ 66. Ke4 Rf7 67. Kd5 Rf5+ 68. Kc6 Rf6+ 69. Kb5 Rf5+ 70. Kc4 Rf7 71. Rh6 Rf4+ 72. Kd3 Rf7 73. Ke3 Rg7 74. Kf4 Rf7+ 75. Kg5 Rg7+ 76. Rg6 Rf7 77. Kh6 Kf8 78. Ra7 Ke7 79. Rg7 Rxg7 80. Kxg7 Ke8 81. Kg6 Ke7 82. Kf5 Kd6 83. Ra6+ Ke7 84. Re6+ Kf7 85. Rh6 Ke7 86. Ke4 Nf6+ 87. Kd4 Ke6 88. Kc5 Ke7 89. Kd4 Ke6 90. Rh8 Kd6 91. Rd8+ Ke6 92. Ra8 Kd6 93. Ra6+ Ke7 94. Ke5 Nd7+ 95. Kf5 Kf7 96. Re6 Nf8 97. Rf6+ Ke7 98. Ke5 Nd7+ 99. Kf5 Nxf6": ""
    },
    "url": "https://gameknot.com/annotation.pl/team-match?gm=15668",
    "gameName": "Team match",
    "players": "irmo29063 (1418) vs. ihalimi (1408)",
    "opening": "Scotch (C45), Blackburne attack"
}