{
    "moves": {
        "1. e4 e5": "Traditional, not sure what its actually called. But I prefer playing it than the sicilian.",
        "2. Nf3 Nc6 3. Bb5 Qf6": "Ok, this is a variation. He is trying to get a quick edge on me. The queen is not only backing up the knight, it is attacking d4. Maybe this setup calls for an early c3 with a d4 launch coming? I could also castle, or even b3 with fianchetto in mind. I don't want to let the development of black out run me here. I think I like the fianchetto, it gives me a nice kingside diagonal, backs d4, will prob cause opponent to d6, and I can still c3 and d4.",
        "4. b3 Bc5": "Ok, now d4 has a lot of heat, as well as pressure on f2. I see to things, my white bishop has become isolated somewhat, it will have to return to Bb2 I think. I think this may get messy quickly, I like the castle here.",
        "5. O-O a6": "There is the bishop threat, retreat to e2. Now I am in danger of losing the pawn, but he doesn't have the structure to grab it yet. But he may go Nh6, with a view to Ng3. I think I will retreat and then play h3. Priority moves in my mind are c3, Bb2 and then d3 or d4. Not sure what order yet.",
        "6. Be2 d6": "Okay, he has backed up his pawn structure. d3 is an option, but weak in my mind. If I move the d pawn, it really should be to d4. I think the fianchetto, followed by c3. But I am worried about the knight coming down kingside. A bishop attacking my horse now would prob be doing me a favor to be honest. Lets fianchetto and see how it goes. ",
        "7. Bb2 Bg4": "Well I got my wish. C3 as per my thoughts..",
        "8. c3 O-O-O": "Castle queenside. I didn't expect that, d4 still looks good, but it will leave me down some, I need to play Rfe1 to shore up my defences. However that would lead to d5 methinks, I am not sure how that would work out, it makes my head ache thinking of it! but I could still d4, after that there are too many combos to consider.",
        "9. Re1 h5": "I have changed my mind here now. I want to play h3 and then onto d4.",
        "10. h3 Be6": "Ok, there is a lot going on, this could backfire with a rook threat to my queen, but here goes...",
        "11. d4 exd4": "Which to use.. this is opening up, vote knight, I need to concentrate on queenside, so a good reason to pull in the knight, plus it threatens the white bishop.",
        "12. Nxd4 d5": "Tricky! I have looked at this, I am thinking nxc6 here, threatens the rook on the queen threat, and in responding pawns will be doubled..",
        "13. Nxc6 Bxf2+": "This is going to hurt. That is twice I ignored the bishop.",
        "14. Kh1": "This seems the best option, no check immediate check line.",
        "14... Bxe1": "Okay, lets have a look here. Need to pick something up from this. Is there a way to take his bishop and save my knight? Would make the trade worthwhile. I can see a way to mess his pawn structure up in the loss of the piece, but he would have to do that anyway. Actually, this could be intersting. I will go 2 down, but there will be some momentum. I really need to get my knight out of the way to let my rook do his job.",
        "15. Qxe1 Rd6": "Okay, he saw it was not prepared to make the exchange. nd4 seems strongest, na5 tempted me.",
        "16. Nd4 g5": "Okay nd2 to develop and back e4, also preps for nf3 if required.",
        "17. Nd2 g4": "This is looking messy. I am looking to see if I can prevent anything from happening. Best option seems to be h4.... Hopefully this stormy weather clears up..",
        "18. h4 Nh6 19. g3": "This seems to be the best option, halts the king attack, nf5 doesnt seem to be to bad to me.",
        "19... c5": "Attack queenside. I think this is not a bad move by black, but I think he could have found more momentum elsewhere. This should get heated now! Lets exchange, lots of options ahead.",
        "20. Nxe6 Rxe6": "Okay, I have to be really careful. There is prob only 1 or 2 moves that will keep me in this game. I am looking forward to analysing this one later. Ok, the 2 moves I can see are rb1 or bd3. I think I need to rb1, to activate my pieces. Lets roll the dice!",
        "21. Rb1 dxe4": "Okay! I think I may finally be able to capitalise. I can see the skewer on the diagonal, I can't see a good response for black. I could take the pawn, but then I lose the skewer. My hope is that I grab the skewer and hopefully that distracts him to make another mistake and I can grab a pawn as well.",
        "22. c4 Re5": "I just anaysed the buggery out of this move and then didn't save. The short version is I was planning a move, bd1 (after the take and exchange), but it was crap, but then I relised once the queen takes the bishop I can agress with bd3!! then swing my knight up and get some breathing space. This is a great game, I am enjoying it.",
        "23. Bxe5 Qxe5 24. Bd3": "Something else I just realised, if he isnt careful, I may get his queen from a bishop check.",
        "24... Rd8": "And he is going to fall for it I hope! Hope he stays greedy...",
        "25. Bxe4 Rxd2": "I just looked as this before checking the annotation, and I was thinking it was a great move by black, with the rook check fork etc... Then I checked the annotation and realised it was covered. The stormy weather is clearing a little now, was pretty intense for a while!",
        "26. Bxb7+ Kxb7 27. Qxe5 Rxa2 28. Qxh5": "I see a chance to knock the horse out",
        "28... Ng8 29. Qxf7+": "and duly take it.",
        "29... Kb6 30. Qxg8 a5 31. h5": "Black resigned at this point. I am really happy with winning this game, it is one I would have lost in the past, but if you are bored and want to see where I could improve it would be much appreciated.\n\nGreg"
    },
    "url": "https://gameknot.com/annotation.pl/team-match?gm=31509",
    "gameName": "Team match",
    "players": "grege79 (1090) vs. imun (1052)",
    "opening": "Ruy Lopez (Spanish opening) (C60)"
}