{
    "moves": {
        "1. e4 c5 2. Nf3 e6": "Normal moves until...",
        "3. Bb5": "A bit like a Canal- Sokolsky( Nimzovich-Rossolimo) attack but with e6.",
        "3... a6": "Kicks the bishop to either c4, d3 e2 or f1.",
        "4. Be2": "The best option.",
        "4... Nc6": "Developing move.",
        "5. O-O Be7 6. c3": "White tries to occupy the centre with two centre pawns. Next move he will strike the centre unless I strike it first.\n",
        "6... d5 7. exd5 exd5 8. d4 c4": "I advance as White can't attack from the flanks.",
        "9. Re1 Nf6 10. Bg5 h6": "I should've castled here but h6 was a natural response which ended in me being a pawn down.",
        "11. Bxf6": "Taking with the pawn would leave my king unsafe.",
        "11... Bxf6 12. Bxc4+ Be6 13. Bb3 O-O 14. Qd3 Qd7 15. Bc2": "Threaten mate on h7.",
        "15... g6": "Blocking the mate and creating a nice square for my DSB.",
        "16. Nbd2 Rfc8 17. Nb3 b6 18. Re3 Ne7 19. Ne5 Qe8 20. Rae1 Bf5 21. Qe2 Bxc2 22. Qxc2 Qd8 23. Nd2 Nf5 24. Rh3 h5 25. Ndf3 Rc7": "White's position is far better and White should've played slowly holding on to his extra pawn and more comfortable position. But instead white attempts to crash through quickly.",
        "26. Rxh5 Nxd4": "The best response. I will be up an exchange here but white will  have an extra pawn.",
        "27. Nxd4 gxh5 28. Re3 Bxe5": "Wasting whites tempo but giving up my important DSB.",
        "29. Rxe5 h4": "Protecting my pawn.",
        "30. Ne6": "Ne6?? I'm up a rook for a knight and pawn. This sac was unneccesary. It was to open lines for the queen.",
        "30... fxe6 31. Qg6+ Kf8 32. Qh6+ Rg7 33. Qh8+ Kf7 34. Qh5+ Kf6 35. Re1 Qe8 36. Qxh4+ Kf7 37. Qh5+ Kg8 38. Qh6 Qg6": "Threaten mate and tries to trade off queens.",
        "39. Qh3": "Keeping the queens on the boards and protecting g3.",
        "39... e5": "I am able to advance freely as is Rxe5 fails to Qb1+",
        "40. Rxe5": "A blunder.",
        "40... Qb1+": ""
    },
    "url": "https://gameknot.com/annotation.pl/team-match?gm=41433",
    "gameName": "Team match",
    "players": "zal667 (1400) vs. richard1234567 (1516)",
    "opening": "Sicilian defence (B40)"
}