{
    "moves": {
        "1. e4": "The King's pawn opening: my normal first move as white, hoping to catch opponent's out, for the Scholar's mate. I learned this move at high school: that's why I do this opening.",
        "1... Nf6": "Alekhine's defence. My opponent is ahead on development, and my pawn is under attack from the knight, and one way of defending it is...",
        "2. Nc3": "...to bring out my queenside knight, going with the Scandinavian version. I am now level on development, and I could develop my light-square bishop or queen if I wanted/needed to...",
        "2... d5": "...but he brings up his queen's pawn, placing my king's pawn under attack, so now we have pawns on the light squares in the centre of the board, contested by the knights...",
        "3. exd5": "...and I decide to take his pawn to initiate an exchange...",
        "3... Nxd5": "...and he captures my pawn to get back on level terms...",
        "4. Nxd5 Qxd5": "...and we trade our knights, getting his queen out into the middle of the board...",
        "5. Qf3": "...and I bring mine out to contest the long light diagonal, hoping my opponent will capture my queen with his, so my remaining knight can move out...",
        "5... e6 6. Qxd5 exd5": "...but I end up initiating the exchange.",
        "7. d4": "I bring up my queen's pawn to block his pawn and to free my queenside bishop...",
        "7... b6": "...and he's hoping to fianchetto his queenside bishop...",
        "8. Nf3": "...so I bring up my remaining knight...",
        "8... Bd6": "...but a little surprisingly, he brings out his kingside bishop (I was expecting Bb7)...",
        "9. c4": "...so I attack his pawn with mine, hoping to trade pawns, to get my bishop onto c4...",
        "9... Be6": "...but he brings light-square bishop on the shorter diagonal (Bb7 would have been another way to defend his pawn)...",
        "10. b3": "...so I cover my QBP with my QNP, hoping for 10... dxc4 11. Bxc4 Bxc4 12. bxc4, where I'd have two pawns still on the 4th rank...",
        "10... h6 11. cxd5 Bxd5": "...but I end up initiating the exchange. This wasn't really a good trade, as I now have an isolated pawn on d4, even if it is covered by my knight, as the latter is under attack from the bishop.",
        "12. Bc4": "Why did I do this move? I was hoping to trade bishops, so my pawn on d4 would no longer be isolated, even if the one on a2 did, as the rook would still be behind it...",
        "12... Bxf3 13. gxf3": "...but instead, I end up with a distorted pawn structure, which is all over the place: doubled isolated pawns on f2 and f3, and an isolated pawn on d4.",
        "13... O-O 14. Bd5": "I attack his rook...",
        "14... c6": "...but this was the obvious response to my move, to ensure that no material is lost.",
        "15. Be4 f5 16. Bd3 Nd7 17. Kd1 Rae8 18. Re1 Rxe1+ 19. Kxe1 Bxh2 20. Be3 c5 21. dxc5 Ne5 22. Bc4+ Kh8 23. cxb6 axb6 24. Bxb6 Nxf3+ 25. Kd1 Re8 26. Kc2 g5 27. Rd1 Be5 28. Rd8 Rxd8 29. Bxd8 h5 30. Be2 Nd4+ 31. Kd3 g4 32. Bb6 h4 33. Bxd4 Bxd4 34. f3 h3 35. fxg4 h2 36. Bf3 fxg4 37. Bh1 Bb6 38. Ke4 g3 39. Kf3 Bf2 40. a4 Kg7 41. a5 Kf6 42. a6 Ke5": "We agree to draw here, as the my bishop guards the g2 square, should his g-pawn advance to the square, and is already stopping the h-pawn from promoting. Also, his bishop guards the a7 square, and should it capture my pawn there, my king can capture his g-3 pawn, and possibly his h-2 one. The moral of the story? If you are a pawn down, you are not completely lost. I haven't finished annotating yet, so more will be added: I tried making another game private, then public, but after making it public, it wouldn't show up that way."
    },
    "url": "https://gameknot.com/annotation.pl/team-match?gm=25635",
    "gameName": "Team match",
    "players": "aspiemikey (1380) vs. edwardnorton (1254)",
    "opening": "Alekhine's defence (B02), Scandinavian variation"
}