{
    "moves": {
        "1. d4": "This, and the next game, also against sarapitolas are included for an unusual reason. In this game I was a pawn up, and in the other game I was a pawn down. I offered a draw in both games, and he accepted. What I want you to do is to work out who had the better deal and why? Your comments would be welcome!",
        "1... d5 2. c4 c6": "This is the Slav Defence to the Queens Gambit. It is quite solid and respected. As Barden writes in his excellent book \"Openings for the Club Player\". \"The Slav attempts to maintain Black's centre pawn while permitting the free development of the queen's bishop.\"",
        "3. Nf3": "3. Nf3 is usually played as 3. Nc3 allows 3.... e5, the Slav Gambit, with interesting play, although in practice 3.... e5 is not that common!",
        "3... e6": "And this transposes to what is known as the Semi-Slav as it combines features of the Slav and the Orthodox Defence to the Queen's Gambit.",
        "4. Nc3 Nf6 5. e3": "I was tempted to play 5. Bg5 here too. I was influenced by the fact that e3 was more popular on the opening databases.",
        "5... Nbd7 6. Bd3 dxc4 7. Bxc4 b5": "This is all fairly standard stuff.",
        "8. Bd3 Bb4": "But this is a little unusual. It is not on any of the World database, and the 9 games on the Gameknot database are all White wins. Oh good!",
        "9. O-O O-O 10. Qc2 Bb7 11. a3": "On the Gameknot database there were 2 games with Rd1 and 1 with a3, but a3 seems better. Surely Black cannot exchange and strengthen the White centre after 12. bxc3 and a retreat just admits the mistake on move 8",
        "11... Bd6": "In the game on the Gameknot database the bishop retreated to be7, so I had to think for myself now!",
        "12. Rd1 c5": "this seems to blunder a pawn, but the position was difficult for Black. the alternative break was to play e5, but that loses to exchanges on e5 followed by Bxh7 discovering an attack on the Black queen from my rook on d1. Perhaps a6 preparing c5 was better or Qc7 preparing e5?",
        "13. Nxb5 Bxf3 14. gxf3 Qb6 15. Nxd6 Qxd6": "So in return for a pawn, black as split White's king side pawns, but White has the two bishops. I think White is winning.",
        "16. dxc5 Qxc5 17. Qxc5 Nxc5": "And now with queens off it is harder for Black to stir up complications. ",
        "18. Bc2 Ncd7 19. Bd2 Rac8 20. Bc3 Nd5 21. Bb1 Nxc3 22. Rxd7 Na4": "And this is the position, where a draw was agreed on the basis that I am a pawn up in this game a pawn down in the other game. So I ask you to look at the next game and tell your view on who had the best of the deal and why?"
    },
    "url": "https://gameknot.com/annotation.pl/team-match-the-better-deal?gm=16723",
    "gameName": "Team match, The better deal?",
    "players": "charleshiggie (1931) vs. sarapitolas (1933)",
    "opening": "QGD Slav (D11), 3.Nf3"
}