{
    "moves": {
        "1. e4 c5": "I rarely play the siclian but I was in the mood for a fun game. ",
        "2. Nf3 Nc6 3. Nc3 Nd4": "The typical movce is ...d6, or ...g6 but like I said was in a different mood. ",
        "4. Bb5": "If my opponent was to play something like 3. ...Nd4 on me I would play less aggressive moves and  aim to undermine the advanced knight in the future. \r\n\r\n4. Nxd4!? cxd4 5. Ne2 e5 is ok for black",
        "4... e6 5. Bc4": "0-0 is preferrable to me only because I hate having to move a peice two times in a row. ",
        "5... a6": "I am moving fast and have already kick started my queenside pawns. ",
        "6. Nxd4 cxd4 7. Ne2 Nf6": "7. ...e5!? is risky because of the bishop on c4 and the fact that I am behind in development. ",
        "8. Nxd4 Nxe4 9. O-O d5": "Securing the knight on e4 for now and gaining tempo against the LSB",
        "10. Bb3 Bd6 11. c3": "When I evaluate a position I use the model that Antoloy Karpov give in his book, \"Finding the Right Plan\"\r\n\r\n\r\nMATERIAL RELATIONSHIP BETWEEN FORCES\r\nThe material relationship is currently equal                         Score: =\r\nPRESENCE OF DIRECT THREATS                                        Score: =\r\nwhite has no direct threats. Black has the direct threat of ...Nc5 which will cause a pawn weakness and disruption of whites ablility to develop his remaining pieces.  \r\nPOSITION OF KING AND THEIR SAFETY                              Score: +/=\r\nthe white king has castled kingside and front pawns remain unmoved. The black kings has prepared to castle kingside and is slightly behind white in development. \r\nPAWN STRUCTURE, WEAK AND STRONG SQUARES                Score: -/+\r\nBlack enjoys clear strong points on c4,c5 and e4, while white has d4. e5 and strong influence over the light squares on the queenside. Black has a more active and uniform pawn structure.   The half open e-file is under dispute. White has potiental attacks on e6 and can play d3 to boot the knight off of e4. Where as Black has Nc5 with good attacking chances in the centre. \r\nTHE CENTER AND SPACE                                                 Score: -/=\r\nBlack currently has more influence in the center. Black enjoys greater control of space. \r\nDEVELOPMENT AND POSITION OF PIECES                           Score: -/=\r\nBlack's knight are slightly more active compared to their counterparts. Both have the equal amount of pieces developed. \r\n\r\nEvalutation conclusion: Black has a better position based upon his greater piece and pawn moblity, and presence of a direct threat. However, the knight on e5 can not be easly attacked but needs preparation to execute. Whites knight is more secure on d4, and both players have development problems for their remaining bishops. In the end white has to play c3 in order to avoid serious pawn weaknesses. ",
        "11... O-O 12. d3": "White can drive the knight back now without fearing serious weaknesses",
        "12... Nc5 13. f4": "!? a bit over zealous, and creates too many holes. Besides the feared, ...e5 is still premature as the advance of the e5 would seriously weaken d5 and the light sqaures. The best way to keep the balance is 13. Bc2. ",
        "13... Nxb3": "the exchange is in black's favor because now I do not have a problem on the light squares. ",
        "14. axb3 Bd7 15. Be3 Qc7": "f4 has a big red bulls eye on its back. ",
        "16. Qf3 Rfe8 17. c4 Rac8": "17. ...dxc4 only helps untangle whites messy pawns. However, if white intends then 18. ...exc5 unleashes the power of the bishop pair. In short, White can not afford to open the positon and must strive to keep it closed. ",
        "18. Rae1 h6": "?? I should have played \r\n18. ...dxc4 19. dxc4 b5!? with nice lines for attacking. ",
        "19. Qf2 f6": "preparing for e5",
        "20. Rea1 e5 21. fxe5 Bxe5 22. Bf4 Bxf4 23. Qxf4 Qb6": "attacks d4 and supports the third rank. the queen has more influence on this sqaure. And of course white wouls love to trade the queens of the board.",
        "24. Rfe1 Bf5": "diverting the queen off of the defence of d4. So I can seize control of d4 which will put tremdeous pressure on d3, b3 and b2. ",
        "25. Qxf5 Qxd4+ 26. Kf1 dxc4 27. dxc4 Rcd8 28. Qf3 Rxe1+ 29. Rxe1 b5 30. cxb5 axb5": "creating the potiental for a past pawn after capturing b2 and b3. ",
        "31. Qc3": "defending against the complete collapse of his queenside. ",
        "31... Qf4+ 32. Kg1 Kf7": "preventing any funny back rank checks and invasions on e7 ",
        "33. Qc6 Qd4+ 34. Kf1 Qd3+ 35. Kg1 Kg6": "I want to make sure my king is safe",
        "36. Qe4+ Qxe4 37. Rxe4 Rd2": "with the queens gone the white weaknesses are increased. ",
        "38. Rg4+ Kf7 39. Rb4 Rd5": "I must have miscaluated something because it looks like white can hold for a draw. Rook ending are notoriously hard to win. As such is very wise to study and practice them. Besides King pawn endings rook endings are the next most commonly occuring ending. \r\n\r\nMy plan is to 1. centralize my king in the area of the queenside where it can defend b5\r\n2. seiz the 2nd rank with my rook and  eat pawns for lunch",
        "40. g4": "?? Holy cow\r\n\r\nnothing like making your rook useless. ",
        "40... g5": "fixing the pawn to g4 where it limits the mobility of the white rook",
        "41. Kg2 Ke6": "I got to get my king to c6 where it can defend b5 so that my rook can gubble up pawns. ",
        "42. Kf3 Kd6 43. Ke4 h5 44. Ke3": "if 44. gxh5?? f5+ wins the rook",
        "44... f5 45. gxf5 Re5+": "?? the immedaite Rxf5 is better. ",
        "46. Kd3 Rxf5 47. Ke3 g4 48. Ke4 Ke6": ""
    },
    "url": "https://gameknot.com/annotation.pl/team-match?gm=36775",
    "gameName": "Team match",
    "players": "skqe (2197) vs. elyhim (2251)",
    "opening": "Sicilian defence (B30)"
}