{
    "moves": {
        "1. e4": "This game features a new signing for the England team, redka, aka Anna against a lady from IHS team ITALIA in a little mini-international. White starts off conventionally enough",
        "1... d5": "And black replies with d5, the Centre Counter defence",
        "2. exd5": "White takes, probably the best move.",
        "2... Qxd5": "And black re-captures, the most usual move, although Nf6 is perfectly playable.",
        "3. Qe2": "This move is odd. White should be developing the minor pieces, bishops and knights. Nc3 attacking the Qd5 is the most logical. This wastes a move, and also blocks in the Bf1.",
        "3... e5": "For some strange reason, the Gameknot post-match computer database gives this as a mistake, but I think it is a sound opening move. It grabs central control and opens up a diagonal for the Bf8.",
        "4. Nc3": "An excellent move, even better if played the move earlier.",
        "4... Qe6": "I'm not happy with this retreat. Qa5 or Qd8 are the normal squares the queen moves to in this variation, and I am sure that they are the best moves here too. Gameknot computer doesn't criticize it though!",
        "5. Nf3": "Another excellent move by our heroine! White is developing and making threats - the best way to develop. Two pieces now attack the Pe5.",
        "5... Bd6": "So black defends it again, but Nc6 is better, because now white has d4",
        "6. d4": "Which she correctly plays. Black is already on the back foot. White has 2 pieces on e4, so black can't play e4. Black can't play Nc6 because white replies with d5.",
        "6... f6": "This weakens the black king side, doesn't help development. I think Nd7 or Pxd4 were better moves, although the Gameknot computer doesn't criticize this move.",
        "7. d5": "Not bad, gaining space and attacking the black queen, but I quite like the look of Pxe5 or the immediate g3 too.",
        "7... Qf5": "Wrong square in my view, the queen can just be attacked again.",
        "8. Nh4": "Which white correctly does so!",
        "8... Qd7": "The only safe square for the queen.",
        "9. g3": "Preparing to develop the bishop to g2",
        "9... Bb4": "I don't like this move, as I think black needs to develop her other pieces, she can't really afford to move a piece which has already moved once again. Ne7 and 0-0 screams out to me. Gameknot computer doesn't criticize this move (or any of the others since 5...Bd6), but I don't like it!",
        "10. Bg2": "I think this is best. The Gameknot computer prefers Bd2 to prevent the doubling of the white c pawns, but I don't think this is too much to worry about. The position is reasonably open, so the bishops are probably worth slightly more than the knights. The white centre would be stronger by the exchange and white would have the semi-open b file for a rook.",
        "10... Ne7": "This would be my first choice of move. GK computer prefers g5 which to me is not a developing move and weakens the black king side terribly. I'm coming to the conclusion that the GK computer is very weak! Do you agree dear reader?",
        "11. a3": "I'm not convinced by this move. White just ignores the extra attack on the d5 pawn. The smart way to meet it would be 11. O-O Bxc3 \r\n12. bxc3 Nxd5 13. Qh5+ g6 14. Qf3 and white wins back the pawn with advantage.\r\n",
        "11... Bxc3+": "Black duly takes",
        "12. bxc3": "White recaptures",
        "12... Nxd5": "Black takes the pawn",
        "13. Bxd5": "I don't like this move, giving up the bishop for nothing. White did have 13. Qh5+ g6 14. Nxg6 Qf7 15. Bxd5 with advantage.\r\n",
        "13... Qxd5": "Black recaptures, attacking Rh1",
        "14. O-O": "So white removes that threat.",
        "14... b6": "Black dreams of playing Bb7 and Qg2 or Qh1 mate.",
        "15. c4": "White hits the queen. The right idea, although Rd1 was probably even stronger!",
        "15... Qc6": "The queen stays on the a8-h1 diagonal, but more important was to stay on the a2-g8 diagonal.",
        "16. Qh5+": "Excellent move by white! Black should now move the king and lose the right to castle. While this should be avoided normally, at least that was the better option, compared to what black did play.",
        "16... g6": "Blocking the check is normally natural, unfortunately for black, white has a better move than just moving the queen.",
        "17. Nxg6": "And this is it! Black is on the ropes now. Best for black is to bite the bullet and take the knight, as his Rh8 is going to be lost whatever she plays.",
        "17... Bb7": "But black still dreams of that mate on the long white diagonal.",
        "18. f3": "Which is easily blocked. I would have taken the rook with check first though. There is also Nxe5 check in this position, which wins the black queen and may have resulted in a balck resignation. Black is given a chance to partially make up for the mistake the previous move.",
        "18... hxg6": "So black takes the knight.",
        "19. Qxg6+": "Here, stronger would have been QxRh8 instead.",
        "19... Ke7": "This is the wrong square for the king, as white can fork king and rook with a queen check on g7. Kd8 would have made things a lot harder for white.",
        "20. Qg7+": "White plays the best move.",
        "20... Ke6": "So does black. No need to let white take the rook with check.",
        "21. Qxh8": "so the rook goes.",
        "21... Na6": "An excellent move, developing a piece and also making a discovered attack on Qh8 by the Ra8",
        "22. Qh3+": "White plays the best move.",
        "22... Kd6": "But black doesn't! The king steps into the open d file, where it can be checked by the rook. Ke7 was better. White can't mate with just a queen, she needs support.",
        "23. Rd1+": "White again finds the best move.",
        "23... Kc5": "But black again doesn't! It is suicidal to move the king up the board like this. Ke7 was better, although white is obviously winning. Against Ke7. Qh7 check with the long term plan of developing Bc1 and Ra1 to decent squares, and maybe h2-h3-h4-h5-h6-h7-h8. Black can't grab the pawn on f3 as the queen is needed to stay near the king for protection, for instance preventing checks on d7. It is now White to play and mate in 4 moves. before going on, see if you can spot it!",
        "24. Be3+": "White plays the best move. Black is mated in all variations now.",
        "24... Kxc4": "Forced!",
        "25. Qf1+": "White again finds the best move, bringing round the queen. White is having a party and all the pieces want to get involved!",
        "25... Kc3": "Forced again!",
        "26. Qd3+": "White concludes the game faultlessly",
        "26... Kb2": "Forced again.",
        "27. Rdb1#": "Qb3 would have done the trick too. The wonderful mating sequence is now a Gameknot puzzle. http://gameknot.com/chess-puzzle.pl?pz=40399"
    },
    "url": "https://gameknot.com/annotation.pl/team-match?gm=39006",
    "gameName": "Team match",
    "players": "redka (1181) vs. letianna (1150)",
    "opening": "Scandinavian defence, Lasker variation (B01)"
}