{
    "moves": {
        "1. e4 e5 2. Nf3 d6 3. Bc4 f5 4. Nc3": "Good up to this point.",
        "4... h6": "4 ... h6 is weak.  Your opponent should have continued developing.",
        "5. d3": "You could have tried 5. Nxe5 dxe5 6. Qh5+ Kd7 (If he played Ke7, it would have been mate in four -- see if you can find the mate) 7. Qxf5+ Qc6 8. Qxe5.  For the knight, you get three pawns and your opponent's center is ripped to bits.",
        "5... g5": "A pawn storm this early in the game is very bad play.",
        "6. O-O": "Hurrah for king safety!",
        "6... f4 7. Bd2": "Your first blunder. A better move was d4!  Bd2 doesn't look that bad, but it turns the pawn storm into a real threat. Notice also that he had constructed a pawn wedge, which will work to his advantage.",
        "7... Bg7 8. a4 Qe7 9. Bb5+": "Bb5+ is a mistake.  Nd5 would have been much better.  Your opponent should play c6 immediately (which he did) and then play g4 and then bring his knight out from g8. ",
        "9... c6 10. Bc4 Nf6 11. a5": "Instead of a5, try thinking about Qe2 or h3 or b4.",
        "11... Be6 12. Bxe6 Qxe6 13. Ra4": "Ra4 is a bit premature.  Again, h3 or b4 would have been better.  h3 is defensive or in chess-ese prophylactic. b4 could be the start of something strong on black's queenside. For rooks to really succeed, they need space and that is something that's lacking at the moment. The fact that they're connected -- once you get your queen off of the back rank -- means they're mobile and ready to pounce.",
        "13... Na6 14. d4 exd4 15. Rxd4": "Instead of taking with the rook, why not take with the knight?  By taking the rook, you give black chances.  The knight would love to land on d4 and it would push the queen away.",
        "15... Nd7": "Nd7 is a mistake for black. He should have castled.",
        "16. Rd3 O-O 17. Na4": "Na4 is a mistake.  The correct response for black would have been 17 ... Nac5 18. Nxc5 Nxc5 and you would still have had chances. Better would have been 17. Bxf4 Ne5 18. Rxd6 Nf3+ 19. gxf3.",
        "17... Qxe4 18. Rxd6 Qxa4 19. Rxd7": "19. ... Rf7?? swings things back your way rather quickly: 20. Rxf7 (which you did -- yahoo!) Kxf7 21. Bc3 Bxc3 22. Qd7+ Kg8 23. Qe6+ Kg7 24. bxc3 . . . ",
        "19... Rf7 20. Rxf7 Kxf7 21. Bc3 Re8": "Instead of Qd7+, why not 22. Nxg5 hxg5 23. Qh5+ Kf8 24. Bxg7 (moving the king away from the rook) Kxg7 and 25. Qxe8! . . . At this point, you would have won the game.",
        "22. Qd7+ Re7 23. Qf5+ Kg8 24. Qc8+": "24. Bxg7 would have been much better.",
        "24... Bf8 25. h4": "I don't get h4. Why not Nd4?",
        "25... Rc7 26. Qe6+ Kh7 27. h5": "I see why you chose h5, but Rd1 is SO much better.  Again, you would have had a won position.  Remember, when attacking, try and get all of your pieces involved.  Your rook is doing nothing on f1.",
        "27... Qxc2 28. Bf6": "No need to move your bishop, better was Nd4. Bf6 gives away your advantage. Ne5 would have kept your winning hopes alive.",
        "28... Qd3 29. Nxg5+": "Nxg5+ now gives black the initiative.",
        "29... hxg5 30. Bxg5": "Re1 is better.  ",
        "30... Nc5": "Black is now on the attack.",
        "31. Qe8 Qf5": "Your circling the bowl at this point, but Qg6+ is better than Qd8.",
        "32. Qd8 Rd7 33. Qf6": "Too late for this move, but it was forced.",
        "33... Qxf6 34. Bxf6 Rd2 35. Re1 Kh6 36. g4 Rxb2 37. Re8 Bg7 38. g5+": "Egad, g5 will make things worse.",
        "38... Kxh5 39. Bxg7 Rb1+ 40. Kg2 Kxg5 41. Re5+ Kg6 42. Bf8 Nb3 43. Kf3 Ra1 44. Kxf4 Nxa5 45. Rg5+ Kf7 46. Rf5+ Ke8 47. Bg7 b6": "After b6, you could have munched on his rook and the game is yours!",
        "48. Re5+ Kd7 49. Bf8 c5 50. Rd5+": "Better was 50. Re7+ Kc6 51. Rxa7",
        "50... Kc6 51. Rd6+ Kb5 52. Bg7 Ra2 53. Rd7 Nc6 54. Rd1 Rxf2+ 55. Ke3 Rf7 56. Rb1+ Ka6 57. Bc3 b5 58. Ra1+ Kb6": "Putting him in check actually forces black's king to the right squaure.",
        "59. Ke4 a5 60. Kd5 c4 61. Be1 Rd7+": "This was a good move for black.  By now I'm sure you realized that he's going to push his passed pawns home and there's really no way for you to stop the rush to queen.",
        "62. Ke4 b4 63. Rb1 Kb5 64. Ke3 Kc5 65. Ke2 c3 66. Rc1 Kc4 67. Ke3 Rd3+ 68. Ke4 b3 69. Ra1 Rd4+": "Black should have played c2 immediately.",
        "70. Ke3 b2 71. Ra4+ Kb3 72. Rxd4 Nxd4 73. Kxd4 c2 74. Bh4 c1=Q 75. Ke5 b1=Q 76. Bf6 Qbb2+ 77. Ke6 Qxf6+ 78. Kxf6 a4 79. Ke5 Qd2 80. Ke4 a3 81. Kf3 Qe1 82. Kf4 a2 83. Kf5 a1=Q 84. Kf4 Qae5+ 85. Kf3 Qf1+ 86. Kg4 Qef4+ 87. Kh5 Qh1+ 88. Kg6 Qg2+ 89. Kh5 Qfh2#": ""
    },
    "url": "https://gameknot.com/annotation.pl/team-match?gm=27699",
    "gameName": "Team match",
    "players": "roan99 (1308) vs. frnz571 (1251)",
    "opening": "Philidor (C41), Lopez counter-gambit"
}