{
    "moves": {
        "1. e4": "My opponent open the game with her e-pawn. Mi oponente comienza el juego con su peón e.",
        "1... e6": "The French Defense, when the black try to attack the e-pawn with d-pawn. La defensa francesa, donde las negras intentar atacar el peón e con su peón d.",
        "2. d4": "Another alternatives to this move are: Qe2 (Tschigorin´s attack), b3 (Tartakower´s attack), Nf3 d5 3 e5 c5 4 b4 (wing´s gambit) and the Indian Atack. Entre otras alternativas a este movimiento tenemos: De2 (ataque Tschigorin), b3 (ataque Tartakower), Cf3 d5 3 e5  c5 4 b4 (gambito del ala) y el ataque Indio de Rey.",
        "2... d5 3. exd5": "Exchange variation, in the most popular lineas, white try to tend a simetrical position of pawns, but my opponent will play aggresive. White can play too: e5 (advance variation), Nd2 (Tarrasch Variation) and Nc3 (Clasical variation). Variante del cambio, que en sus más populares líneas, las blancas juegan estructuras de peones simétricas, aunque este no será el caso. También pueden jugar: e5 (variante del avance), Cd2 (variante Tarrasch) y Cc3 (variante clásica).",
        "3... exd5 4. c4": "This move attacks the black center but the d-pawn is now a weakness. I think what c6 do not offer adventage to the black and dxc4 allows Bxc4 with initiative. So, Nf6 with development and allows castle. Este movimiento ataca el centro negro, pero el peón en d4 es ahora una debilidad. Creo que c6 ahora no ofrece ventajas, por remitir a una estructura simétrica, y que tomar el peón cede la iniciativa al adversario. Mejor desarrollar el caballo e intentar enrocar.",
        "4... Nf6 5. Nc3": "More pressure to d5. I will try to put a rook in the e column. Más presión sobre el peón central, mi idea ahora era enrocar y colocar una torre en la columna abierta.",
        "5... Be7 6. Bd3": "Now, I can play dxc4 winning a move, but I do not desagreed this position. The weaknees in the d4-pawn is the caractheric to the position and white will try to compensate. Ahora, podría tomar el peón c, ganando un tiempo, pero no me disgusta la posición, la debilidad en el peón central es la característica de la posición y las blancas deberan ingeniarselas para compersalo.",
        "6... O-O 7. Qc2": "This move allows the next move with two threats. May be better are Nge2 with castle. Este movimiento permite la siguiente maniobra con fuerza, mejor seguramente era desarrollar el caballo rey y enrocar.",
        "7... Nc6": "Threats d4 and b4. Amenaza b4 y d4.",
        "8. Nce2": "I do not understand this maniuvre. Better Nge2. No comprendo esta maniobra, mejor era el otro caballo.",
        "8... Re8": "Now, black had adventage in pawn´structure and development, his king is safe. Black is better. Ahora, las blancas están mejor porque poseen mejor desarrollo y mejor estructura de peones, asi como su rey está seguro. ",
        "9. a3": "better Be3. Mejor Ae3",
        "9... Nxd4": "If Nxd4, Bb4+ and mate in the next. Si Cxd4, Ab4+ y mate en la próxima",
        "10. Qd1 dxc4": "I play this move to development the ligth bishop to f5 (seeing c2) and protect the knitgh with the queen. Two ideas and a only move, must be strong. Jugué este movimiento con la idea de colocar el alfil de casillas claras en f5, atacando c2 junto con el caballo, y defender mi caballo con la dama. Dos ideas en una sola jugada, debe de ser buena.",
        "11. Bxc4 Bf5": "Now, Black has a winning position, but the next move is a blunder, best is Bb3.",
        "12. Be3 Nc2+ 13. Kf1 Nxa1 14. Qxa1": "Advantage in material, White´s king in the center and pressure in both open columns, I will try to exchange the active pieces, to try reduce the counterstrike. Con ventaja en material, el rey en el centro y presión en ambas columnas abiertas, intentaré cambiar las piezas activas para restringir el contrajuego.",
        "14... Bd3 15. Bb3 Nd5 16. Bxd5 Qxd5 17. Nf3 Rad8 18. Ke1 Bc5 19. Nc3 Qc4 20. Qc1 Re7 21. Nd2 Qf4 22. Ne2 Rxe3": "If 23 fxe3 Qxe3 24 Qd1 Qf2++ or 24 Kd1 Qxe2++."
    },
    "url": "https://gameknot.com/annotation.pl/team-match?gm=37325",
    "gameName": "Team match",
    "players": "arjo (1726) vs. chizzo83 (1760)",
    "opening": "French (C01), exchange, Svenonius variation"
}