{
    "moves": {
        "1. Nc3": "In this game, I had a few problems with the Game DB because, like my other game against this opponent, I misunderstood the Game DB.  However, I made a comeback with some important techniques.  First, I remembered Jack Stockel's advice about finding a way out of trouble since it is feasible 99.7% of the time.  I also remembered him telling me to, \"Study the positions, and think about things\".  Second, I used some of -chess's- techniques during our past games, and he is, BTW, a master with almost a 2100 rating.  ",
        "1... e5": "I opened with the Queens Knight opening to immediately develop minor pieces, but this was not good because it could have destroyed the center, prevented me from controlling it.  However, his candidate move is the King's pawn play which I am used to this since I normally do this with white. ",
        "2. e4": "I respond by turning this into a King's Pawn opening, if I am correct.",
        "2... Bc5": "Now, he, again, attempts the, \"Four Move Trick\".",
        "3. b3": "This was a huge mistake for two reasons.  First, I thought that b3 would prevent him from threatening my knight with Bb4, but a3 would have done this, instead.  Second, it allows him to bring out his queen which could be disastrous, in this position.  This flaw occurred because I, once again, misunderstood the Game DB since I was not basing it on the most amount finished games.  That is the correct and most successful way to use this feature.  Instead, I based the feature on the highest rating and percentages of wins, but I recently learned that those wins are masters who do this with unprecedented moves.  This flaw, will force me to think and act critically in order to avoid the, \"Scholars Mate\".     ",
        "3... Qf6": "Now, he has almost won the game in four moves, but I still have one trick up my sleeve.",
        "4. f3": "It is my only choice since this is a, \"forced move\", so the Game DB is now useless, in this particular game.  ",
        "4... Bxg1 5. g3": "This was my biggest mistake in this game, and I do not know what I was thinking because his tactics temporarily dominated my defenses, as was the case in the coaching game with ubermensch43.  I should have played Rxg1, as opposed to g3 because it would have been an even exchange between my knight and his bishop, in this position.  Instead, I inadvertently gave him a free knight because this allows him to pull his bishop away.  Therefore, it was a horrible candidate because inadowman reiterates, in a different annotation, Jack Stockel's advice.  That is, \"Don't give things away\".    ",
        "5... Bd4 6. Nd5": "At this point, I follow Jack Stockel's advice about getting out of trouble by moving my knight, as opposed to resigning, which is what I used to do, at this point in the game.  Therefore, I threaten to play Nxf6 and capture his queen.",
        "6... Qc6": "Now, he is forced to move his queen away from danger.",
        "7. Rb1": "However, there is a drawback because he currently threatens to capture my rook with Bxa1, so I must now move my rook away from the, \"danger zone\" because I do not want to give him another free piece, at the moment.",
        "7... Nf6": "He currently threatens to capture my and force an exchange with Nxd5, but this does not bother me any longer.",
        "8. Bb5": "Remember Jack Stockel's not to sacrifice free pieces?  He also told me that there was one exception.  In other words, he said that it is only okay to give up pieces if a person is going to win by checkmating his or her opponent in one move or is going to win a more powerful piece such as the queen or rook.  That was the case here because I remembered how -chess- did this since he sacrificed pieces, like a bishop or knight in other games.  Then, he played powerful forks against me between my queen and rook forcing me to resign.  Therefore, I sacked my bishop by threatening his queen with Bxc6 instead of castling, but that was not a mistake, this time. ",
        "8... Qxb5": "That was one of my favorite moments, in this game.",
        "9. Nxc7+": "At this point, he resigns because he is going to loose his free queen since he can no longer defend it. This was my second best game, on this site, because there was only one other game, on Gameknot, that I won in less than 9 moves."
    },
    "url": "https://gameknot.com/annotation.pl/team-match?gm=42353",
    "gameName": "Team match",
    "players": "jkarp (913) vs. delta5ply10 (908)",
    "opening": "Dunst (Sleipner,Heinrichsen) opening (A00)"
}