{
    "moves": {
        "1. e4": "With 3 d4 this unfold to be the Scotch game, which I really enjoy.  It's a dynamic, fighting game. These moves are all pretty common.",
        "1... e5 2. Nf3 Nc6 3. d4 exd4 4. Nxd4 Nxd4 5. Qxd4 Nf6": "The computer analysis shows this move, Nf6, as not as precise as d6.  The gameknot database for the Scotch shows only d6 as the book move here.  In 365chess.com, they show White winning ~79% of the time with the response of e5.  Black cannot find a good place for his Knight.\n\nNote how this one imprecise move by Black causes it to lose time, while White develops nicely.\n\nThis corresponds to the advice I give to look for a mistake or lack of precision or sharpness in the opening, seize on it and relentlessly put pressure on your opponent. The opening book does show Black's Bf6 as possible.\n\n",
        "6. e5": "The computer analysis shows this continuation (rather than e5): \n\n6. Nc3 d6 7. Bg5 Be7 8. O-O-O O-O 9. e5 Ng4 10. Bxe7 Qxe7 11. exd6 Qxd6 12. Qxd6 cxd6 13. Rxd6 Nxf2\n\nI like the immediate pressure that e5 creates.",
        "6... Qe7": "Th computer analysis liked  c5 rather than Qe7:  c5 7. Qe3 Nd5 8. Qe4 Nb4 9. Nc3 Be7 10. Bc4 O-O 11. Be3 Qb6 12. O-O-O Kh8 13. Nd5 Nxd5 14. Bxd5",
        "7. Be2": "Freeing the e pawn to threaten Black's Knight, and developing.\n\nBut the computer analysis calls this a mistake on my part.  It liked Be3, with this continuation:  \n\n7. Be3 Ng8 8. Nc3 Qb4 9. O-O-O Qxd4 10. Bxd4 Nh6 11. Nd5 Kd8 12. Be3 Nf5 13. Bg5+ Ne7 14. Bc4 h6 15. Nxe7 Bxe7",
        "7... Ng8": "Black has lost a lot of time.  Look at the development of White's and Black's positions.\n\nThe computer analysis preferred c5:  \n\nc5 8. exf6 Qxe2+ 9. Kxe2 cxd4 10. Na3 b6 11. Re1 gxf6 12. Nb5 Ba6 13. Kd1+ Kd8 14. Nxd4 Bc5 15. Be3 Re8 16. Nf5 Bb4 17. c3",
        "8. O-O": "White is far better developed.",
        "8... Qc5 9. Qe4": "White is not ready to exchange its Queen, nicely in the center, and not so easily scared away.",
        "9... g6": "So this is Black's plan: to develop and put pressure on e5, and claim the long diagonal.",
        "10. Nc3 Bg7 11. Nd5": "Threatening the c7 square with a fork on the King and Queen's Rook. Or possibly checking the King later at f6 (if supported by White, say with its Queen Bishop).  \n\nCentralized, the Knight is commanding and widely threatening.  \n\nToo bad that Black's Queen is guarding c7. What can White do?",
        "11... a6": "The computer analysis calls a6 a blunder, preferring Ne7:  Ne7 12. Nf6+ Kd8 13. Rd1 Bxf6 14. exf6 Nf5 15. Bc4 Re8 16. Qd5 Qb6 17. Qxf7 Nd6 18. Qd5 Nxc4 19. Qxc4 Qxf6\n\nBlack is behind in development and needs to get its pieces deployed.  White is in it face with Nd5 and Black needs to counter that. \n\na6 falls far short.",
        "12. b4": "White sees an opportunity to get the Black Queen off the c file and maybe to trap the Black Queen.",
        "12... Qc6": "Black needs to protect the c7 pawn.",
        "13. b5": "White continues to harass the Queen.",
        "13... axb5 14. Bxb5": "Now White has its King's Bishop in the game!\n\nIf Qxb5??, then Nxc7+ forking not just the King and Rook, but the Queen, too!",
        "14... Qc5": "Nowhere else to go!\n\nBlack's Queen is where it was six moves ago, but meanwhile White's pieces continue to develop and attack.",
        "15. Be3": "Now the Queen Bishop is developed and attacking.  \n\nWhere can the Black Queen go to escape?",
        "15... Qa3": "The computer analysis calls Qa3 a mistake.  \n\nIt prefers accepting this loss of material, the Queen for the Knight and Bishop:  Qxd5 16. Qxd5 c6 17. Qc5 cxb5 18. Rfe1 h6 19. Bd4 Rh7 20. Qxb5 Ne7 21. Bc5 Nd5 22. Bd6 Nc3 23. Qc5 Nxa2.\n\nThe computer is right about Qxd5 being the better approach.  I was thinking Qxd5, 16. Qxd5 c6 17. Qc5 cxb5 18. Bg5 Bf8 19. Qxb5 Ra6 20. Rfd1 Rc6 21. h4 h6\n",
        "16. Nxc7+": "Black is going to lose the exchange with his Rook.  But, worse, look at White's pieces amazingly coming to the fore to attack the uncastled King.  \n\nBlack's lag in development has cost it big time. ",
        "16... Kf8": "If Black's King went to d8, then White might respond 17 Bb6, Ne7; 18. Rfb1, Nf5; 19 Rb3, Qe7 and 20 Nxa8+ and the Black King is back at e8.",
        "17. Nxa8": "White doesn't find anything better to do than take the Rook.",
        "17... Qxa8": "Black recaptures with it Queen.  \n\nAt the time of the game, I thought that Black needed to do something else, but the computer does not show this as an error.\n\nHow about . . .d6 18 Nb6 Qa5 19. Nxc8 Qxb5 20. Nxd6 Ne7 21. Rfd1 Nc6",
        "18. Bc5+ Ke8": "The computer analysis calls Black's move a blunder, preferring d6.  It's mate in 5 the analysis says:  . . . Ke8  19. e6 Be5 20. exd7+ Bxd7 21. Qxe5+ Kd8  22. Bb6+ Kc8 23. Qct#\n\nThe d6 continuation goes this way per the computer:  … d6 19. Rfd1 Bh6 20. exd6 Bd7 21. Bxd7 Bg5 22. Be8 Bd8 23. d7+ Ne7 24. Bxe7+ Bxe7 25. Re1 Bd8 26. Qb4+ Kg7",
        "19. e6": "Black resigns as he sees mate on the horizon.\n\nMorals of the story:\n1) The Scotch game is fun (for White)\n2) Develop, Develop, Develop\n3) Jump on early move inaccuracies, here Black's Nf6 at move 5."
    },
    "url": "https://gameknot.com/annotation.pl/team-match?gm=43877",
    "gameName": "Team match",
    "players": "glenn5454 (1837) vs. charmedones (1782)",
    "opening": "Scotch (C45), Ghulam Kassim variation"
}