{
    "moves": {
        "1. c4 f5": "Hoping to convert to Leningrad Dutch, which is my favourite defense against 1. d4 later on.",
        "2. g3 Nf6 3. Bg2 g6 4. Nc3 e5": "A soft spot in the Leningrad variation of the Dutch defense is often a weakness on the e-file, as white gets control over e5 and then opens up the e-file on his side, preferably via trading at f5. It is therefore reasonably valuable to me that I get to play e5 quickly here.",
        "5. d4 e4": "At this point, the e-pawn blocks the white bishop and although white should be able to deal with that at some point, it will likely involve trading it off, meaning that I likely get to play without the e-file as the typical weakness.",
        "6. Nh3 Bg7 7. O-O O-O 8. Bg5 c6": "Preventing his knight from bugging me at d5 and potentially preparing d5 for myself. The downside is that developing my queen side will now cost me a lot of time, though, so maybe simply allowing the white knight to get to d5 and developing with d6 and Nc6 would have been better.",
        "9. Qb3 d6": "I would like to be able to respond to c5+ with d5, but if I do that with my pawn standing on d7, white would be allowed to hit en passant. Playing d6 here means I would have d5 at my disposal as a response and I needed to create some space to allow my white-squared bishop to develop anyways.",
        "10. e3 a5": "While it is a reasonably common theme to play this in the Leningrad to grab space before developing the knight via a6, an important downside of it is the hole it creates on b6 and given that I am somewhat behind on development already, it would probably have been better to simply play Na6 or Nd7",
        "11. Na4": "Immediately heading for my freshly created weakness.",
        "11... Nbd7 12. Bf4 Qe7": "I could opt for d5 instead, but than it will be really hard to regain control over b8, which means my queen side will be very constricted",
        "13. Qa3 c5": "This doesn't look great, but neither does Ne8",
        "14. Rad1 h6": "Tring to force away the annoyinh dark-squared bishop, but because of the following combination, it is too late. Rd8 was pretty much forced.",
        "15. dxc5": "Opening up the d-file, so white gains full control over d6",
        "15... dxc5 16. Bd6": "and winning the exchange.",
        "16... Qf7 17. Bxf8 Bxf8 18. Nf4 Ne5": "I need to create activity for myself if I wnat to make it remotely difficult for white, so I try to place my knight more agressively, rather than trying to grab a pawn on c5",
        "19. Nb6": "Although of course now I give up b6 so white's knight can become very annoying.",
        "19... Rb8 20. Nbd5": "I think going here with the other knight may have been a bit more effective, as the one on f4 is a lot less menacing than the one on b6 was and this move also gives up control over c4, whereas after 20. Nfd5 Nxc5, white would have had access to 21. Nxc6 followed by Nxc4, winning a knight.",
        "20... Nxd5": "I wasn't too comfortable with allowing white to retain the option of taking my knight at f6 at some point, gaining a tempo, so I wanted to trade on my terms. If white decides to protect his c-pawn by taking with that, my queen side can finally become unlocked, along with fully unleashing my unmatched dark-squared bishop.",
        "21. Rxd5": "White gives up the pawn in exchange for full control over the dangerous d-file with his soon-to-double-rooks.",
        "21... Nxc4 22. Qb3 b5": "Although I am an exchange down, I am starting to grab some space, while white's bishop is still rather useless and I can soon push back his knight. There may still be hope.",
        "23. Rfd1 g5 24. Bf1": "Already running into trouble, as now I think I am clearly ahead when the smoke clears. 24.Ne4 Be6 25. Rd8 Nd6 looks quite unpleasant as well, though, so perhaps white was already in more trouble than it seemed on the surface.",
        "24... gxf4 25. Bxc4 Be6 26. Rxf5": "Seems like the best option white has left, as I can't find another line where white ends up at least equal in material.",
        "26... Bxc4 27. Rxf7 Bxb3 28. Rxf8+ Rxf8": "Better than Kxf8, since after white takes my bishop, I can open the f-file and thereby immediately restrict the white king.",
        "29. axb3 fxe3 30. fxe3 Rf3": "Given the atrocious pawn structure that white is left with, black seems to have an overwhelming end game.",
        "31. Rd5 Rxe3 32. Rxc5 Rxb3 33. Rc2": "Probably better than exchanging the b-pawn for the e-pawn, since two connected passed pawns will be harder to handle than an isolated passed pawn.",
        "33... Kf7 34. Kf2 Kf6 35. h3 Ke5 36. Re2 Kd4 37. Rd2+ Rd3 38. Rc2 h5": "And white resigns. Black's passed pawns will soon prove too powerful, while white's pieces have very little room to maneuver."
    },
    "url": "https://gameknot.com/annotation.pl/team-match-san-miguel-knights-vs-the-white-knight?gm=57897",
    "gameName": "team match san miguel knights vs the white knight",
    "players": "tweethart10 (1839) vs. martenp (1866)",
    "opening": "English (A10), Anglo-Dutch defense"
}