{
    "moves": {
        "1. Nf3": "richkitch v saguaro.  This was a Team Match. \nSaguaro opens. Saguaro does not open e4 or d4.",
        "1... d5": "Black responds forcefully. ",
        "2. d4": "White mirrors. ",
        "2... Bf5": "Now, Black is developing the Queen Bishop common in the Caro-Kann defense....a good move. ",
        "3. Nc3": "White develops along a lot of paths to deal with this. ",
        "3... e6": "Black does another Caro-Kann move to make infantry and Q bishop on defense and ready attack.  ",
        "4. Bg5": "All Black has to do for this is attack the bishop in a common Caro-Kann fashion...",
        "4... f6": "...and so he does!",
        "5. Bh4": "Bishop backs off. ",
        "5... Nc6": "Usually in Caro we want the knights to work as a pair as in a pair of rooks.  Black manages to achieve this with a more forward move ready to have the King Knight to become a duo pair....",
        "6. e3": "White is opening for the King Bishop and reinforcing while doing so. ",
        "6... g5": "Black is on the attack now forcing the Queen Bishop to g3....",
        "7. Bg3": "...and there it is. ",
        "7... Nb4": "Now I am realizing Black is being rather offensive considering Black is usually defensive. Perhaps Black wants to advance more infantry (c6) while netting White into a restrictive environment.",
        "8. Bd3": "Black realizes taking the King Bishop is as the cost of developing White's Queen! ",
        "8... Nh6": "Black decides to do another Caro-Kann move moving a night into a \"corner\" where it serves while Black develops at the cost of White. ",
        "9. Bb5+": "Immediately I see c6 for Black...",
        "9... c6": "And so it is! ",
        "10. Ba4": "The King Bishop on White is now backing up! ",
        "10... Ng4": "I'd swear Black knows the Caro-Kann.  Black is doing from a modified Caro-Kann when White opens Knight to f3--really a weak open by White. In my world White Opens e4 or d4 or loses. ",
        "11. h3": "Expected from white at the cost of having to push a pawn in the King side 0-0...into the respected \"cup\" formation that Caro-Kann also uses. Does Black know how to deal with it?",
        "11... Nh6": "We shall see....",
        "12. a3": "Notice Black's Infantry are on the front lines according to the Caro-Kann formation. Already White is constrained by the weak open instead of e4.  However, the Caro Infantry and knights are well forward as well as the INFANTRY to FIX and KILL. White pushes a pawn in the constrained environment to try and salvage an attack which White should be doing instead of Black. ",
        "12... Na6": "The only open space for the Black knight but perfectly placed...",
        "13. O-O": "White is feeling fine to castle and does. ",
        "13... b5": "Black cannot castle but black is forward deployed to keep on with the best defense: an attack! ",
        "14. Bb3": "Retreat. ",
        "14... c5": "Forward.",
        "15. Nxb5": "A hail mary move to try and threaten...",
        "15... c4": "Black INFANTRY moving FORWARD. \n",
        "16. Ba4": "White is setting up for disclosed check...",
        "16... Kf7": "Black's King moves.  This actually happens in, guess what? The Caro-Kann.  In the Caro the option to castle EITHER side is available in the first moves of a game. Queen or King side. Sometimes in the Caro-Kann Black gains the OFFENSIVE and leaves the King alone while forces move FORWARD DEPLOYED to fix and kill. Will it work in this game?",
        "17. c3": "A reinforcement move to White's Pawn Skeleton. White's Pawn Skeleton (INFANTRY) formation is actually quite nice at this point. But Black's Infantry are beyond a mere pawn skeleton at this point.  They are WAY forward while White tries to reinforce what position is left after the first stupid move: King Knight to f3 instead of e4. ",
        "17... Kg8": "Trapping the King Rook but getting the King away from a fight He might become rather vulnerable too...",
        "18. h4": "White moves forward to take advantage. ",
        "18... g4": "Black's infantry, once again in a Caro-Kann FORWARD DEPLOYED FORMATION can decide to press FORWARD.  Pawn by pawn, pig by pig (Apocalypse Now) Black (the DARKSIDE) is turning the White Saints into rubbish without regard to feeling but only logic....",
        "19. Nh2": "The horse (pig now) is retreating...",
        "19... Nf7": "Black sees ahead his own pig (knight) needs to savage elsewhere without being put on a stick (Lord of the Flies by Golding)...",
        "20. Nxg4": "White's pig come back out...",
        "20... h5": "Ready to be stuck on a stick: Kill the pig, cut it's throat, etc (Lord of the Flies). \n",
        "21. Nh2": "Back into the net for White to figure out what next to do...",
        "21... Bg6": "I think Black at this point is moving the Bishop to advance INFANTRY to fix and KILL. ",
        "22. f4": "White is trying with his own INFANTRY to stop the INFANTRY from Black...",
        "22... Bd3": "At this cost! A foward and safe Bishop on the edge of a pawn. Beautiful move! ",
        "23. Rf2": "Rooks are especially clunky in a net constricting them...",
        "23... Nh6": "Black wants to keep g4 away from White.  It is. ",
        "24. Bc2": "White is trying to trade down at this point. ",
        "24... Bxc2": "Black allows it. ",
        "25. Qxc2 Qe8": "Now here we see a sort of unusual thing. The queen moving one square instead of two squares or across the entire board which she can do if allowed...",
        "26. b4": "Black's Queen cannot take the knight and so the next best thing is en passent here...",
        "26... cxb3 e.p.": "En Passent. ",
        "27. Qxb3": "White realizes Black didn't fall into the trap. Time for the Queen to do a bit of clean up. ",
        "27... Nf5": "!!!",
        "28. Qa4": "..going for the knight...",
        "28... Nb8": "Where else was the knight to go?",
        "29. Nf1": "Protecting the bishop. ",
        "29... a6": "Attacking Queen and knight at the same time! ",
        "30. e4": "Forcing the knight out? Opening the board again to a White Offense totally dismantled?",
        "30... dxe4": "Back to the position against Queen and knight...and the White bishop....",
        "31. Rd1": "A back end rear move by a rook to advance what is forward: A pawn. ",
        "31... Rh7": "A back end move by a previously trapped rook to make pressure...",
        "32. c4": "An advance, finally, by White to move INFANTRY forward. ",
        "32... e3": "A sort of risky advance of Black's Infantry...but will it pan out?",
        "33. Re2": "Blocked by a slow moving rook in a tight place.",
        "33... Raa7": "Rooks aligned...",
        "34. Bh2": "A save of the bishop to stay on target to g3...",
        "34... axb5": "We expected it.  Black is ready to do it. ",
        "35. Qb3": "White hopes to use the Queen in a more open board perhaps.  But constraints by Black Infantry and knight and rooks may help Black to continue forward...",
        "35... bxc4": "This pawn is a move I might not have done but I still think it works. ",
        "36. Qxc4": "White has a bit more room for the queen. ",
        "36... Rxa3": "At cost. ",
        "37. g3": "White is on the defense for sure now. ",
        "37... Ra4": "Attacking the most valuable player on the board with support to do so....",
        "38. Qc3": "Perhaps the 3 pawn is worth the move...",
        "38... Ra3": "But the bishop supports the rook to continue an attack on the White Queen while defending the e3 pawn...",
        "39. Qc4": "Back and forth trying to figure out the best place for the most maneuverable chess piece on the entire board. ",
        "39... Ra4": "Attack resumed. ",
        "40. Qc3": "Back. ",
        "40... Bb4": "And now the Queen is getting rather trapped on the entire board of 64 squares. Where shall she go to do the most damage?",
        "41. Qb3": "The trapped rook now untrapped by a single square move is ready. ",
        "41... Rb7": "There it is. ",
        "42. Nxe3": "Knight X knight only allows White to develop more.  What should Black do?",
        "42... Ra3": "Attack again. Attack is the best defense. Right?",
        "43. Qc4": "White is trying, still, to make the most powerful piece on the board available and ready to make the most damage. ",
        "43... Ra4": "The best move for Black to remain in the offense while keeping the King side under control. ",
        "44. Nxf5": "and now it becomes really fascinating! ",
        "44... Qd7": "A King being checked with room to move FORWARD is never a problem.  Place the King or leave it where it may be checked to move to a better position and in the meantime use the other pieces and pawns to gain position. This very strategy is employed by the White's King's Gambit--the King is not protected while an onslaught of White is moving to kill the weak Ruy Lopez! I use it all the time against the weak Ruy Lopez.  ",
        "45. Rxe6": "White decides not to check the King but instead get forces forward...and set up a disclosed check.  Both of these players are doing things well above 1100 or 1300...",
        "45... Kh7": "Fischer would have done the same! ",
        "46. Rxf6": "Opening White's Queen to get into more action! ",
        "46... Rc7": "Where can White's Queen go to do the most damage now?",
        "47. Qd3": "Another disclosed check opportunity! ",
        "47... Ra3": "Black says go ahead! ",
        "48. Ne7+": "Done! ",
        "48... Rxd3": "At cost! ",
        "49. Rxd3": "What next? Are you enthralled? I am! But now Black has a rook with a Queen instead of two rooks and a knight in the fire zone! ",
        "49... Qxe7": "Now minus the knight. ",
        "50. Rb6": "At this point White should just resign but I always respect players that fight to the end. ",
        "50... Nd7": "Black has to reassure White the game is over. ",
        "51. Rb5": "A hail mary move that won't change a thing unless Black blunders. ",
        "51... Qe1+": "Well, what else would you have done if you were Black to end the game?",
        "52. Kg2": "Avoiding the inevitable.  In the stages of Grief or Loss we first have Denial. Then Anger. Then Bargaining. Then Depression. And then, we finally have Acceptance. ",
        "52... Qe2+": "White came to Acceptance to resign. \n\n"
    },
    "url": "https://gameknot.com/annotation.pl/team-match?gm=49791",
    "gameName": "Team match",
    "players": "saguaro (1260) vs. richkitch (1177)",
    "opening": "Reti opening (A06)"
}