{
    "moves": {
        "1. c4": "This game is an example of positional play - active middlegame after an early material loss, positional transformation and a seemingly easy ending, which still required some patience.",
        "1... e5 2. Nc3 Nc6 3. Nf3 Nge7": "English opening is not something that is played often on GK, so I don't know it at all. Therefore I try to play it as Closed Sicilian with colors reversed - I play this line as White with some success. But the opponent deviates from the script early on.",
        "4. b4 a6 5. Bb2 Nxb4": "Confused by unfamiliar opening, I suddenly thought I could win this pawn. Well, I can - at the expense of my own e-pawn.",
        "6. Nxe5 d6 7. Nf3 Bf5": "Not knowing the strategic ideas behind the opening I resort to tactical trivialities. Here the idea, of course, is Nc2+, but it is easily refuted.",
        "8. d3 g6": "Bad blunder which I do make from time to time - trying to fianchetto with the opponent's bishop (or queen) already looking down the diagonal. Don't try to repeat this.",
        "9. Ne4": "I get punished for the blunder. The rook is on prise and worse, there is a threat of Nf6#. I have to take the knight, giving away the exchange.",
        "9... Bxe4 10. Bxh8 Bf5": "Now this is a bad position. The White's bishop dominates the black diagonal. Moving the king over to the kingside doesn't offer much safety, especially with the kingside rook gone. On the queenside White has a nice open file and pawns that can rush down and open more files. No strategic ideas at this point, but the opponent just keeps me busy.",
        "11. Qa4+ Nbc6 12. Bf6 Bd7": "Isn't it wonderful - I get squeezed like a lemon.",
        "13. Qb3 Qc8": "Looks like my opponent will need to get on with development. This gives me a chance to do something about my own position. The first thing to do is to drive away that terrible bishop.",
        "14. g3 Ng8 15. Bc3 Rb8": "Okay, this is a bit better. Not at all pretty, of course, with that king in the center, but at least I am doing useful moves and I know what the opponent is going to do - fianchetto and castle kingside. My job is to develop the pieces and throw my kingside pawns at his king's position.",
        "16. Bg2 Be7 17. O-O h5 18. Nd4 Ne5": "No exchanges when you are down on material - this only gives the opponent a larger edge. Besides, the knight is more useful closer to the place where I want the action to happen - opponent's kingside.",
        "19. f4 Ng4": "Now this was a very nervous move (19. f4). It weakens both e3 and g3 and gives me an extra tempo. The knight was moving to g4 anyway so why chase if from e5? A simple Rb1 would have been better and more to the point.",
        "20. Bd2": "As a result, the bishop has to take a much less active position and grant me another tempo. Good - I get on with the pawn storm.",
        "20... h4 21. Rab1 c6": "Moving the b-pawn would weaken a6, and let the opponent hassle me with something like 22. c5 ...dxc5 23. Nc6 and I have to either give up another exchange or part with my dark-square bishop, which is an ugly choice. And of course 23. ...Bxc6 24. Bxc6+ is also not quite beautiful.",
        "22. Bh3": "I wonder whether this is a good move. White is obviously under attack here, so what should you do in such a case? Seek exchanges, of course, the more so since White is already up in material. A better plan would be Qb6 with the idea of Ba5 and then Qc7 with an assured exchange of queens. Let Black take on g3 and open the h-file: with no heavy pieces on this side of the board this is not a problem for White.\n\nExchanging the light-squared bishop would be a good idea of course, but it is simply not feasible at the moment.",
        "22... hxg3 23. hxg3 Ng8f6": "Knight is a slow-moving piece, but here it needs only two moves to get from the back rank into the very action and attack the obvious weakness - the pawn on g3. Think back to move 19 - f4 was a mistake.",
        "24. Nf3 Nh5 25. Kg2": "By the way, I don't know what was the purpose of 24. Nf3 - looks like a waste of time. Now the stage is set for a little combination - the idea is to win back the exchange.",
        "25... Ne3+ 26. Bxe3 Bxh3+ 27. Kf2 Bxf1 28. Rxf1": "Not bad - we are now level on material. Positionally, however, White is still a bit better, I think. Why - because my knight is out on the rim, while the opponent's bishop and  queen are quite active. That's what a sober look tells me. During the game, however, I felt somewhat elevated because of the successful counter-strike and tried to continue in the same attacking manner.\n\nThis is a difficult thing in chess. When you gain a success, you tend to try and go on hammering, though the right thing to do might be to switch onto a lower gear and play cautiously. Look how it could have spoilt the game for me.",
        "28... Qe6": "Having pulled off a combination, I am seeking another. The threat, of course, is Nxg3 - and if the king takes then Qxe3. The bishop can retreat but I figure that it is good to activate the queen with a tempo...",
        "29. Bd2": "... a timid response. Ba7 would get me into trouble - I guess I don't have to explain it, but a lost pawn with exchange of queens is the least I can think of.\n\nI have not noticed this during the game, by the way.",
        "29... Kd7": "I felt sober enough to understand that my pawns are weak and I need to protect them. Also the possibility of Qb6 is troubling, so I am prepared to meet it with Bd8.",
        "30. e4 Kc7": "Okay, now b6 has some protection against invasion. Ba5+ can be met with b6 and then a5 when the bishop retreats.",
        "31. Rb1 b5": "Just about the right time to trade the queens.",
        "32. cxb5 Qxb3 33. axb3 axb5 34. Ra1": "Of course the rook should occupy an open file, but is the a-file the right choice? The king just moves to b7 and covers all possible invasion points. Taking the h-file would make much more sense - it would tie down the knight. Also, on a1 the rook is vulnerable across the diagonal - which creates more tactical opportunities.",
        "34... Kb7 35. Nd4": "Here is that tactical thing! Let's just pin that knight.",
        "35... Bf6 36. Bc3 b4": "Now a piece is gone.",
        "37. Bb2 c5 38. Nf5 gxf5 39. Bxf6 Nxf6 40. exf5": "Okay, this is a new milestone in the game and time to think of a plan once more. The game is far from being won at this point. White can try to invade with the rook to start attacking from behind, and if he can knock out my f-pawn, his clump of pawns can give me real trouble. I can try to exchange rooks by Ra8, but White doesn't have to go for it. So again, I shouldn't try to force a quick win (there are still 23 moves to go!), but slow down and start improving my position.",
        "40... Nd5": "To begin with, I need to protect the f-pawn. The plan is to move it to f6, if need be, and move the king to c6, if White's rook penetrates along the h-file.",
        "41. Re1": "No problem here, e6-e8 fields are protected. That's why the pawn should remain on f7 for the time being - it covers e6. In the meantime, I can move the king closer to the center.",
        "41... Kc7 42. Kf3 Rh8 43. Ra1 Kb7": "White tries to find a way for invasion, and I am just working to prevent it.",
        "44. Ke4 Nc3+ 45. Ke3 Re8+ 46. Kf3 Nb5": "Once White's invasion attempts are restricted, I can start creating threats of my own. Here the threat is Nd4+, winning the b-pawn or f5-pawn.",
        "47. Rb1 Nd4+": "The b-pawn is protected but this ties down the rook and I can get a bit more active. The king moves to protect the f5-pawn, but this exposes it to my rook.",
        "48. Kg4 Rg8+ 49. Kh3 Nxf5": "The f5-pawn goes and now White struggles (successfully) to save his other pawns.",
        "50. g4 Rh8+ 51. Kg2 Ne3+ 52. Kf3 Nd5 53. Kg3 Re8 54. Rf1": "Now it is me who is seeking to break into White's position with the rook; White defends against this.",
        "54... Re3+ 55. Rf3": "The rook is in, but going for an exchange right now is doubtful. The knight will need quite a few moves to attack the d or b pawns, and in the meantime White can get active with his pawns - and if he cannot break through with them, he can at least penetrate with the king and attack the backward d-pawn. So even here I should not rush it. The king should come into play and give a hand in holding up White's pawns, which are about to move.",
        "55... Kc6 56. g5 Kd7 57. f5 Ke7": "Now that the king is in, White's fortunes take a turn for the worst. At this point he probably does not have chances for active game, but passive defense is still a possibility. The point is that the pawns cannot break through as long as the knight is on d5, but being there it cannot attack the d and b pawns. So White exchanges rooks and tries to tie the knight down to d5.",
        "58. Rxe3+ Nxe3 59. Kf4 Nd5+ 60. Ke4": "Fortunately the knight can give a few checks and at the same time maneuver to a better spot.",
        "60... Nc3+ 61. Kf4 Ne2+": "Nd5+ would make no progress.",
        "62. Ke4 Nd4": "Perfect position for the knight. The king cannot harass it and the b-pawn is on prise.",
        "63. f6+ Ke6": "White resigned.\n\nThe takeaway from this game: early material loss is very annoying, but by careful play this can be made up sometimes. On the other hand, being an exchange up early on may set you up for trouble because while the rooks are not active, you are essentially a piece down.\n"
    },
    "url": "https://gameknot.com/annotation.pl/team-match?gm=50417",
    "gameName": "Team match",
    "players": "freddefense (1701) vs. maxas (1775)",
    "opening": "English (A27), three knights system"
}