{
    "moves": {
        "1. c4": "This was a game were three pawns were worth a piece for a long time... Then, the three pawns turned two, then,... well, let's see the story...",
        "1... Nf6": "there was one day a horse who went out of his corral,...",
        "2. Nc3 g6 3. d4": "the main idea for white is to build an attack on the queen side and to hope for complications. For complications, I'll be served.",
        "3... c5": "black contest the queen-side",
        "4. Nf3 cxd4 5. Nxd4": "queen-side it will be",
        "5... Bg7": "on the other side, black will castle and attack on the king side... or so i thought...",
        "6. e4 Qa5": "well, it appears he wont.",
        "7. Bd2 Qb6 8. Be3": "the normal move Nb3 has to face Ng4 with many threats",
        "8... Qxb2": "did i lose a pawn?",
        "9. Ndb5": "we are going to complicate a little bit",
        "9... Nxe4": "ok, said black, i complicate too...",
        "10. Nxe4 Na6 11. Rb1 Qxa2 12. Nbc3": "it is now some moves that the black queen is in danger.",
        "12... Qa5 13. Bd2 Qd8": "so she gets back. Result: 3 pawn for a piece: seems average. But white is much more developped (of course) than black. On the other side, black is closer to complete protection.",
        "14. Be2 O-O": "castling and the large barrier of corrals seems to be strong enough to confront the exceding white piece.",
        "15. O-O d6": "developing the last minor piece. black seems  ok.",
        "16. Bf3": "i am no more sure; i think my idea was to prepare the occupation on d5, and try to provoke the advance of e6, to weaken the pawns chain.",
        "16... Rb8": "well, it was not my target, but it is good to protect. And, anyway, we'll see that black will attack there too.",
        "17. Qb3 Bf5": "surprise to me. I expected black to be more defensive, avoiding the exchanges.",
        "18. Rbe1": "Ra1 is uncomfortable, because of the dark bishop; Rc1 was too passive; Rd1 was scary because of a long-time possibility of Nb4 Bc2.",
        "18... b6 19. Be3": "i already renounced to my dark bishop, hoping to exchange the knight. I know it can sound strange, but I expected to valorize my own knights against the pawns.",
        "19... Qd7 20. Ng3 Nc5 21. Bxc5 bxc5": "discovering attack, but expected",
        "22. Qa3": "has to be careful: the queen is overcharged of defense.",
        "22... Bd3": "this is why i said it was overcharged. I panicked a little bit , because i had considered this move, but thinking it was harmless. By seeing he played, i thought to myself: ok, i forgot something... as usual...",
        "23. Be2": "but i don't see what i forgot...",
        "23... Bc2 24. Nd5": "the exact seat i intended since i played Bf3... Now playing it although Bf3 is failing.",
        "24... Ba4": "this sounds like a mistake",
        "25. Nxe7+": "check and dangerous to take.: the queen is also overcharged with defense!!!\nand a first pawn is down",
        "25... Kh8": "choosing to keep the bishop",
        "26. Bg4": "condemnig the two bishops",
        "26... Qxg4": "Not Qe8, followed by dramatic Nxg6, and there is no other place to protect Ba4",
        "27. Qxa4 Rb4": "Black decides that a7 was too difficult to protect, or that the 2 pawns on c and d columns can go to queen.",
        "28. Qxa7 Rxc4": "so now  what is white problem? the 2 rooks are too passive.",
        "29. h3": "go, mother, go!",
        "29... Qh4 30. Re2 Bd4": "nicely done: the knight is no more protected!",
        "31. Ne4": "So i move it.",
        "31... Be5": "now it is attacked two times.",
        "32. Rfe1": "and protected two times.",
        "32... Qf4": "gosh, mate in 2 threatened!",
        "33. g3": "i think it was the best, if not the only good defense.",
        "33... Qh6 34. Kg2": "king has to do everything!",
        "34... f5": "black opens his fortress, intending to attack the white castle. But does black have enough troops?",
        "35. Nd2 Rc2 36. Nf3 Rxe2 37. Rxe2 Bf6 38. Nd5": "yo, i like these 2 knigts!",
        "38... Qg7 39. Qxg7+": "i decided that i had enough troops to destroy th 2 pawns, IF the queens disappear.",
        "39... Bxg7 40. Re6": "i am proud of the next few moves, because i think there is nothing black can do against it.",
        "40... Rd8 41. Ng5 Kg8 42. Ne7+ Kf8 43. Nxh7+ Kf7 44. Ng5+ Kf8 45. Nxg6+ Kg8 46. Ne7+": "I would have resigned, as black, here. ",
        "46... Kf8 47. Nxf5": "Now, not only has white recuperated his pawns, but white is one pawn ahead and threatening the d6 pawn.",
        "47... d5": "quite obvious, and I had made a conditional move here...",
        "48. Rc6": "counting on Bd4, then Nxd4... bye bye horses, but what a work",
        "48... Re8": "ah... deciding to lose one more pawn?",
        "49. Ne6+": "but i have better: here i win the bishop or a new quality!",
        "49... Rxe6": "it will be the quality!",
        "50. Rxe6": "who wouldn't have resigned... not dgrandman, apparently. I felt quite annoyed here, thinking I could make some mistake and give him a draw...",
        "50... Bc3 51. Ne3 d4 52. Nd1": "prohibiting any possibility of promotion",
        "52... Bd2 53. Rd6": "go on the left, i take the right, and vice versa.",
        "53... Ke7 54. Rd5 Bb4 55. Kf3 Ke6 56. Ke4": "now black has really nothing more... resigned? ",
        "56... Ba3": "no... boring...",
        "57. f4 Kf6 58. g4 Bb4 59. h4 Be1 60. h5 c4 61. Rxd4 c3": "i could have given my knight for the last pawn, but i decided he made such a good job that i didn't want to lose him.",
        "62. Rc4": "if c2, pawn is dead.",
        "62... Bd2 63. g5+ Kf7 64. Rc7+ Kg8 65. h6 Kh8 66. g6": "i sent a message: whatever move, is followed by Rc8x.",
        "66... Bxf4": "looks like he wanted to go to the last move.",
        "67. Rc8#": "I hope you enjoyed it. "
    },
    "url": "https://gameknot.com/annotation.pl/team-match?gm=35486",
    "gameName": "Team match",
    "players": "thitho (1760) vs. dgrandman (1653)",
    "opening": "English opening (A16)"
}