{
    "moves": {
        "1. e4": "1. e4 allows me play Caro-Kann defence.\r\nOriginally mentioned by Polerio in 1590, the Defense was rarely played until H. Caro of Berlin and M. Kann of Vienna seriously analyzed it in the 1890s. Capablanca frequently played it to avoid book lines. It can be highly successful against aggressive opponents but the CK lacks attacking possibilities. Patience and endgame skill are usually needed by Black to win.",
        "1... c6": "With Caro-Kann Black stakes a claim to the central squares and seeks free development. While solid, it is by no means a drawing weapon - resulting positions generally contain at least a degree of imbalance and the critical lines lead to sharp positions with chances for both sides. \r\n",
        "2. d4": "It is not mandatory. White have few other alternatives and the most promising is 2. Nc3 leading (2. ... d5 3. Nf3) to Two Knights variation or to Spielmann attack (2. ... d5 3. Qf3). Other good alternative is Steiner attack 2. c4!? White can select Old Indian like structure with 2. d3 (Breyer variation or Stein attack). Rarely used moves are 2. Ne2, 2. b3, 2. Nf3, 2. f4 (with tranposition to Advanced variation), 2. g3, 2. Bc4?! (Hillbilly attack) and 2. Qe2 (in Russian book, I found that it was proposed by \"Нипхауз\", but I can't identify that master - (Niphouse?) ) ",
        "2... d5": "Caro Kan defence -- good even for blitz!\r\n",
        "3. exd5": "I found that Exchange variation is not so simply as it seems, so I started to take more attention to it.\r\nThe Exchange variation is a rare guest at modern tournaments. For its apparently non-aggressive approach, most books don't take it seriously and guarantee Black equality. But remember - Bobby Fisher used it against T. Petrosian, one of the greatest defenders of all time!\r\nAnd it is a prelude to Panov attack!",
        "3... cxd5": "(3. ... Qxd5 is a transposition to Scandinavian...)\r\nAsymmetric pawn structure in the center define plans: a) initiative of White at King wing (e-file and e5 square); b) attack of Black’s pawn minority at Queen wing (b7-b5-b4) and pressure using c file. And Black can organize their minority attack easier than White - to attack at King wing (related to some level of risk).\r\nBut that did not happen in this game...\r\n",
        "4. Nf3": "Not the most common move - but it seems that White likes that development schema (Nf3, Bf4) and uses it in many beginnings...\r\nUsually there you will meet 3. Bd3 (Rubinstein variation; does not allowing Bf5) but it is acceptable to play immediately 4. c3\r\n4. c4 starts Panov-Botvinnik attack but that is another story!\r\n--\r\nOne of the first games of this variation was played about 130 years ago: Noa-Winawer, London, 1883:\r\n4. Nf3 Nc6 5. Bb5 Qb6 6. Nc3 e6 7. a3 Nf6 8. 0-0 Bd6 9. Bd3 Bd7 10. Ne2 Bc8 11. c3 Ne7 12. h3 h6 13. Bb1 Vc7 following long (100 moves, proposed by 1951 “Chess Review”  as “the dullest game ever played) and maneuvering game in which Black had a success.\r\n",
        "4... Nf6": "Another possible move is 4. ... Nc6. It is possible to meet 4. ... Bg4 and 4. ... g6\r\nI consider 4. ... Bf5 as possibly dangerous (for example, 5. Nc3 e6 6. Bb5 Nc6 7. Ne5 with sme pressure)",
        "5. Bf4": "I looked into some games of my opponent and saw that he likes that development schema (Nf3 + Bf4) and uses it for various openings.\r\nPopular moves here are 5. Nc3 and 5. Bd3. Possible moves are 5. Bb5+ and 5. c3\r\n5. c4 lead to Panov-Botvinnik attack (again)",
        "5... Nc6 6. Nc3 a6": "One of ideas was - do not allow Bb5 as well as Nb5\r\nBut ... in the context of further events in the game - I'd prefer 6. ... Bg4",
        "7. Ne5": "Very interesting move and I've to grant more attention to it...\r\nI see one of its advantages - it doesn't allow Bg4 piining Knight at f3",
        "7... Bf5": "I did not like 7. ... e6\r\nAfter 7. ... Vb6 it was not clear 8. Na4 (note: there at GK it were a couple of games played using 7. ... Vb6)\r\n--- 7. ... g6 - also one of possibilities",
        "8. g4": "I predicted that move and saw that it leads to complex and unclear positions... Anyway, I risked 7. ... Bf5 to see what'll happen\r\n... good move is 8. Be2, too. But that in the game creates fire on the board, immediately...",
        "8... Nxe5": "Where to retreat: 8. ... Bg6 or 8. ... Bd7 ? Not sure... 8. ... Bg6 seems dangerous. 8. ... Bd7  - I don't like to go forward and then withdraw back...\r\nSo I selected - if the fire was called let's be the fire!",
        "9. dxe5 Nxg4 10. h3": "I'd prefer 10. f3 - it doesn't allow a Black's move Be4 - which happened later in the game",
        "10... Nh6": "Only move!",
        "11. Qxd5": "Very interesting move was 11. Qd4  (with idea Qa4+) I planed to answer to it 11. ... Vd7 and then White can to go for line in the game 12. Qxd5 Qxd5 13. Nxd5 or select something else, for example 12. 0-0-0, or 12. Nxd5, or 12. Bxh6\r\n \r\nIt seems it is acceptable 11. Bxh6 and then Black has two responses (at first sight, both looks acceptable):\r\nA) 11. ... d4 12. Bd2 dxc3 13. Bxc3 Qc7\r\nB) 11. ... gxh6 12. Qd4 Bg7",
        "11... Qxd5 12. Nxd5 O-O-O": "All these were forced movies.",
        "13. Ne3": "13. 0-0-0 Be4 14. Nb6+ Kc7 15. Rxd8 Kxd8 looks like an acceptible line for Black",
        "13... Be4": "I decided to transfer my Bishop to defence of King (as his position looks dangerous)\r\nAlternative move could be 13. ... g6 - providing \"a window\" for another Bishop.",
        "14. Rg1 g6": "14. ... Nf5 (trying to trade good White Knight) 15. Nxf5 Bxf5 (back to previous place) 16. Rg3 (Rook wants to be active) 16. ... e6",
        "15. Rc1": "Interesting position is after 15. e6 Bg7, for example 16. Bxh6 Bxh6 17. exf7 Bxe3 18. fxe3 Bd5",
        "15... Bg7 16. Bd3 Bc6": "16. ... Bf3 (?) - not allowing 17. Rd1 , but isn't it loosing the time after 17. Rg3 Bc6 ",
        "17. Rd1 b5": "Not allowing the Knight to c4 and later, as I planned e6, to d6 \r\nionadowman noted: \"At move 17, I found ...b5 rather counter-intuitive, unless you were thinking in terms of a minority attack to leave White with an isolated or backward pawn on that flank. It didn't really work out that way. I might have been inclined instead to try 17...e6 with the view to redeploying the dark-square bishop via f8. Possibly the h-rook might have had to move first.\"\r\nBut I disliked 17. ... e6 immediately because of line 18. Nc4 Nf5 19. Bxf5 Rxd1+ 20. Kxd1 exf5 21. Nd6+ Kd7 22. Nxf7 with, as I think, slight advantage for White.",
        "18. c3": "Maybe, in first, is better to go 18. Ke2...\r\nGood alternatives are 18. c4 and 18. a4",
        "18... e6": "Opening window to re-employee his Bishop (after h-Rook eill be movied).",
        "19. Ke2 Rhe8": "This move has some dose of poison... Knight is going to f5 and if White decides to take it then after exf5 Rook is looking directly to White King's eyes...\r\nAs example, the possible (interesting)  line 20.a4 Nf5 21. axb5 axb5 22. Nxf5 exf5 23. Bxf5+ Kb7 25. Rxd8+ Rxd8 26. Bh2 Bxe5 27. Bxe5 Re8 28. f4 f6 (unclear position, I think , with better chances for White).\r\n",
        "20. a4": "Yep, weak pawns are a target of attack...",
        "20... Nf5": "Hurrying to put his pieces into work...",
        "21. axb5": "It was possible to trade Knights: 21. Nxf5",
        "21... axb5": "Interesting complications arise after 21. ... Nxe3\r\nFor example, 22. bxc6 Nxd1 23. Rxd1 Rd5 (23. … a5; 23. ... Kc7) 24.Bxa6+ Kc7 ",
        "22. Nc2": "After 22. Nxf5 exf5 23. Bxf5+ Kb7 24. Rxd8+ Rxd8 White can select different moves (all leading to unclear positions): 25. Bh2 (see note to 19th move); 25. Bg4 Re8 (or 25. ... Bxe5!?); 25. Bc2 Re8; 25. Bd3 Re8;  25. Bg3 Re8\r\nIn place of White, I'd play 22. Nxf5\r\n",
        "22... Bf8": "Finally, Bishop returns to work",
        "23. Rda1": "To grab the open file",
        "23... Kb7 24. Ra5 Rda8 25. Rga1 Rxa5 26. Rxa5": "All these were forced movies",
        "26... Ra8 27. b4": "It was possible 28. Rxa8 - with even position ",
        "27... Kb6": "It was possible to take a Rook just now - with even position\r\nionadowman noted: \"At move 27, I think I would have preferred the alternative you suggest: 27...Rxa5. It seems to me that the line 27...Rxa5 28.bxa5 Bg2!? is survivable. For instance: 29.Bxb5 Bxh3 30.Be8 Nh6 31.Bxh6 Bxh6 32.Bxf7 Bf5 33.Nd4 Bf4 with the following possible conclusion: 34.Nxf5 gxf5 35.Bxe6 Bxe5 36.Bxf5 Bxc3 37.Bxh7 Bxa5 38...Bb4 and white can not win.\"\r\nAnd I agree - the game showed, that, maybe, 27...Rxa5 is stronger. But, instead of proposed by ion 28. ... Bg2!? I looked into 28. ... Be7 - activating another Bishop.",
        "28. Bxf5": "There was possible 28. Rxa8 again.\r\nAnother possibility 28. Bg5 - and if Black takes Rook 28. ... Rxa5 29. Bd8+!?",
        "28... gxf5 29. Nd4 Rxa5 30. bxa5+ Kc7": "I can't say about final issue of this game but can say only that it'll be difficult game for Black... They have to keep eye on a-pawn, do not allow King or Knight to his King-side pawns... Fortunately, he has a pair of Bishops.\r\nIn my opinion, Knight of White is stronger than passive Bishop of Black.",
        "31. Be3 Bd7 32. Nb3": "I doubt if that is the strongest move. It allowed Black's b4 - with, as I guess, simplifying Black's task",
        "32... b4 33. Kd3 bxc3 34. Kxc3 Bb5": "And as result - white-squared Bishop becomes more active",
        "35. Bc5 Bg7 36. Bd6+ Kb7 37. h4 Bh6": "I was not sure for plan to select at the moment...",
        "38. Be7 Bg7 39. Kd4 Ka6 40. Bd8 Bc6 41. Nd2 Bd5 42. Nf1 Kb5 43. Ne3 Ba2 44. Nd1 Bb3 45. Nc3+ Ka6 46. Ne2": "Knight searching his place in his own teritory... going here and there...",
        "46... Bd1": "Draw offer was sent.... and accepted"
    },
    "url": "https://gameknot.com/annotation.pl/team-match?gm=29412",
    "gameName": "Team match",
    "players": "mszak (2033) vs. loreta (1939)",
    "opening": "Caro-Kann (B13), exchange, Rubinstein variation"
}