{
    "moves": {
        "1. f4": "1...From Gambit, e5...leads to sharp play, as played this is a Dutch but W has a move in hand.",
        "1... d5 2. Nf3 g6 3. e3 Nf6 4. c3 Nc6 5. Bb5 Bd7 6. O-O a6 7. Ba4 b5 8. Bc2 Bg7 9. h3": "9.   Holy Swiss cheese, Batman...holes at d3,c4, e4. and g3...",
        "9... O-O 10. d3 Qc8 11. Nbd2 Bxh3 12. gxh3 Qxh3 13. Qe2": "13...Doubtful that B has compensation for the piece...W can get his Q over to g2, and force a trade or retreat with a loss of tempo...B doesn't have a really good follow up to the piece sacrifice",
        "13... Ng4 14. Nb3 Qg3+ 15. Qg2 Qxg2+ 16. Kxg2": "16. W should win this now....he has no weak spots, and the extra piece should tell",
        "16... Rad8 17. Nc5": "17.  A strong outpost for this knight...opening up this game will just make W's pieces more active...so black has got a real problem here",
        "17... Nb8 18. Rh1 Nf6 19. Bd2 Nfd7 20. d4 Nxc5 21. dxc5 Nc6 22. Rag1 e6 23. Kf2 Na5 24. b3 Nc6 25. Ng5 h6 26. Nf3 f5": "27. R takes g6 right away, and B is just about cooked",
        "27. Nh4 Ne7 28. Nxg6 Nxg6 29. Rxg6 Rf6": "30. Rg2 with the threat of a capture on f6, using the pin forces more simplification.",
        "30. Rg2 Kf7 31. Rhg1 Rg8 32. Be1": "32. B's rook is f6 is horribly misplaced...I would have looked at c4...worth a pawn to open the long diagonal for the Black squared B...the doubled pawn on c4 couldn't be held anyway",
        "32... c6 33. Kf1 Kf8 34. Bd1": "34.  This is also good...h5 and g6, f7 are weak...B is missing that light squared B",
        "34... Rf7 35. Bh5 Rd7 36. Bh4": "36.  Also good, activate all pieces and apply pressure till the position cracks",
        "36... a5 37. Bf6 Ra7 38. Be5 a4 39. Bd6+": "39. Ouch!...B wins an exchange, and then the B on g7"
    },
    "url": "https://gameknot.com/annotation.pl/team-match?gm=60091",
    "gameName": "Team match",
    "players": "chesplay01 (1518) vs. jazzbox61 (1465)",
    "opening": "Bird's opening (A03), Lasker variation"
}