{
    "moves": {
        "1. d4": "queen pawn, but just to change the order...",
        "1... Nf6 2. c4": "... cause good old english is back, by reversed moves",
        "2... e6 3. Nc3 Bb4 4. Bd2 O-O 5. e3 b6 6. Bd3 Bb7 7. Nf3 d5 8. O-O": "all bookie...",
        "8... dxc4": "pointing my good knight fellow on the right side of the board...",
        "9. Bxc4 c5": "starting the confusion, here...",
        "10. a3": "well, where will you put your bishop?",
        "10... cxd4": "er... nowhere, I attack your stupid knight... The other one, i mean.",
        "11. Nxd4": "i Have considered axb dxc, but after exd Qxd4, I see doubled pawns and no advantage for white.",
        "11... Bc5 12. Nb3 Nbd7 13. Qe2 Qc7": "both queens try to find safer place, and prepare for an attack (mostly black queen).",
        "14. Nxc5": "I keep the two bishops.",
        "14... Nxc5": "better than to take with pawns, but now c and d columns are largely opened for rooks.",
        "15. Rac1": "and... here we go. (and conscious of eventual Nb3)",
        "15... Qc6": "threatens mate in one",
        "16. f3": "not so dumb.",
        "16... Nd5 17. Nxd5 exd5": "I had the feeling that black wanted the draw, here.",
        "18. Bb5 Qd6": "of course not Qc7 or c8, because of the next move...",
        "19. b4 Ne6 20. Rc2 a6 21. Ba4 b5": "this manoeuvre just helped me to comfort my bishops focusing on both the center and the king, as we'll see. I recognize that black helped me a lot here.",
        "22. Bb3": "Here we go, pointing o weak pawn!",
        "22... Rfe8": "I wonder how valuable would have been d4, here.",
        "23. Qf2 Rad8 24. Bc3 h6": "once again, why not d4?",
        "25. Rd1": "and now d4 is no more an option...",
        "25... Qe7 26. a4 Qg5": "black is deeply focused on my king, but there is nothing serious as the line 2 is well defended.",
        "27. axb5 axb5": "now black has 2 weak pawns.",
        "28. h4 Qg6 29. Rcd2": "focusing on the central weak pawn.",
        "29... Nc7": "defending?",
        "30. e4": "of course, dxe is impossible, as it is followed by Rxd8. This move is the first one which included the next ones I planned. Before that, I had no clear idea how to penetrate. I only had the idea to focus on the weak pawn.",
        "30... Rd7 31. Kh2": "this prepares the next, which i hoped to be a surprised for my opponent... The computer did not like this movement, and prefer to take the weak pawn directly, but this convert my strong pawn in weak pawn... So i don't like the computer option.",
        "31... Red8 32. e5": "and... I think it was a surprise, as we'll see.",
        "32... Qe6 33. f4": "now 2 pawns, very strong are going to treasure land...",
        "33... Qf5": "black seems without idea. Why black queen didn't go there first? And why go there?",
        "34. Bc2": "... because it is exposed!",
        "34... Qe6": "and back...",
        "35. f5": "e and f pawns makes black queen play... In the meanwhile, black bishop and knight are blocked... no speaking of the rooks... On the other side, both of my bishops threat the king-side",
        "35... Qc6 36. Qg3": "threatening discovered attacks on the king AND protecting g2.",
        "36... Ne8": "decent move... but will lead to a larger blockade.",
        "37. Bd4": "prohibiting the e4 advancing, but also threatening another move... do you see which one?",
        "37... Ba8": "does not know what to play... can't blame him... black has no more space. ",
        "38. h5": "if i had played f6, I guess black would have played g6, and the threat was almost killed. So i had to prohibate it.",
        "38... f6": "once again, black had no choice: f6 played by white was too dangerous.",
        "39. e6": "but e6 is dangerous, too...",
        "39... Re7 40. Bb3": "3 reasons for this move: it liberates my rook for bishop protection; it opens my light bishop to better attack position, as previous diagonal was no more productive. Could sayt also that, in case the attack does not conclude on d column, I have a new perspective on c-column... but black has counter-game in that case.\n\nthe computer suggests this is a mistake (without jeopardize the victory, though), and prefer the direct attack on the rooks by Bc5",
        "40... Rc8": "pointless. I was amazed to see this move.",
        "41. Bc5": "and here is the very decisive positioning move. My bishops were really strong",
        "41... Rec7 42. Rd2xd5": "finally the weak pawn is taken... but it was no more the target, only an obstacle for next moves.\nComputer estimates this is a blunder, but I am really not convinced by its point of view...",
        "42... Qa6": "weak counter-attack... but was it possible to respond to next attack?",
        "43. Rd5d8": "!!",
        "43... Rxd8": "maybe better was to play 43 ... Qc6 but then 44 Bd5 followed by a lot of exchange: ... Rxd8 45 Bxc6 Rxd1 (and my king on h2 makes sense) 46 Bxa8 => White gains Q+B>< R+R, with the bonus of e6 very strong. But still black option here is a disaster",
        "44. Rxd8": "the king can't defend the knight... so, the only \"defense\" is:",
        "44... Rc8 45. e7+": "but now the rook is too well defended. And a discovered check that forced the end.",
        "45... Kh8 46. Qg6": "46. ... Qc6 47 Bd5  (not Qf7 of course, that would be followed by Qxg2x) Qxd5 48 Qxe8+ Qg8 49 Qxg8x or Kh7 49 Qh8x\nThanks for having read these until the end. I hope you enjoyed as much as I did."
    },
    "url": "https://gameknot.com/annotation.pl/team-match?gm=37180",
    "gameName": "Team match",
    "players": "thitho (1678) vs. soultosqueeze (1726)",
    "opening": "Nimzo-Indian defence (E20)"
}