{
    "moves": {
        "1. e4": "This game shows one of the best opening sacrifices I've ever played.",
        "1... e6": "I personally consider the French passive, which is why I sacrifice.",
        "2. d4 d5 3. e5 c5 4. c3": "Nf3?! is totally winning for Black, because after cxd4 Nxd4, Black has an extra pawn in the centre, my pawn on e5 is weak, and Black is ahead in development.",
        "4... Nc6": "At first glance, Black's position may look better, since he already has a knight developed, and his pawn structure is more solid, but I like my position, because I have a lot of scope on the kingside for my bishops, and in the French, Black often gets a cramped position and can't do anything.",
        "5. Nf3 Qb6": "Adding pressure to d4.",
        "6. a3": "Threatening to break through with b4.",
        "6... a5": "Stops b4.",
        "7. Bd3": "This doesn't lose a pawn, because after 7...cxd4 8.cxd4 Nxd4? 9.Nxd4 Qxd4?? I have 10. Bb5 !! winning the queen by a discovered attack.",
        "7... Bd7": "This stops a future Bb5  and threatens to win a pawn, however, I decide to finish developing while Black is busy winning a pawn or two.",
        "8. O-O cxd4 9. cxd4 Nxd4 10. Nxd4 Qxd4": "Now Black is up a pawn, and may win another, and it seems as though I don't have any compensation, but Black's position is somewhat cramped, and I can gain tempo attacking Black's queen.",
        "11. Nc3": "I offer Black my e5 pawn.",
        "11... Ne7": "Black doesn't take immediately.",
        "12. Nb5": "Threatening Nd6  Nxf7  and of course Black can't take my knight because of my discoverable attack on the queen.",
        "12... Qxe5": "Now I'm down two pawns, but I'm better developed and my pieces are more active.",
        "13. Re1": "Tempo.",
        "13... Qb8 14. Qf3": "Threatening Bf4 winning material.",
        "14... e5": "After Ng6 I have Qxd5, but however, this move allows me to go into crazy tactical game where I exploit Black's underdeveloped position.",
        "15. Rxe5": "If Black declines the rook sacrifice, then I will eat his position alive.",
        "15... Qxe5": "What compensation do I have for the rook?\r\nI already had development compensation for the pawns, and now I can gain more tempo with threats against Black's queen and king.",
        "16. Bf4 Qxb2": "Any other move allows me to win my rook back with Nc7 , but now Black's threatening MY rook.",
        "17. Nd6+ Kd8 18. Nxf7+ Ke8": "Kc8 will reach the same position after my next move.",
        "19. Nd6+ Kd8": "If the king had moved from c8 to b8 instead of e8 to d8, then I have Nc4  discovered check winning the queen.",
        "20. Be5": "Takes away the threat on my rook with tempo.\r\nIf Qxe5? then Nf7  wins the queen.",
        "20... d4": "Black could also sac his queen for my rook leaving him with two rooks against my queen, but I would still have the compensation I have for the rook.",
        "21. Nxb7+": "I've regained my pawns, and am only down a rook.",
        "21... Ke8": "Kc8 will reach the same position.",
        "22. Nd6+ Kd8 23. Qxa8+": "Now that I have won my rook back, Black has no material advantage, and I still have my active pieces.",
        "23... Nc8": "Kc7 obviously loses to discovered attack.",
        "24. Rb1": "Takes away the threat on my rook with tempo.",
        "24... Qxa3 25. Nf7+": "Because of Black's underdeveloped position, I win a rook.",
        "25... Ke8 26. Qf3": "Taking the rook will only complicate the game after Qxd3. And I can still win the rook eventually.",
        "26... Rg8": "I can win the rook with Bxh7, but I'm not comfortable trading queens when I don't have many pawns on the board for the endgame. I choose the best way to win the rook while keeping my pieces active.",
        "27. Ng5 Qa2": "Stops Qf7 ",
        "28. Bxd4": "Now material is even, but the terrible position of Black's underdeveloped rook will cause him to lose it.",
        "28... Bb4": "Blocks my rook's open file, but it won't be enough to save the game.",
        "29. Ra1": "I simply move my rook over and now I have dominating control of the a2-g8 diagonal, without even having a bishop on it!",
        "29... Qd2 30. Qf7+ Kd8 31. Qxg8+": "Just look how I went from being DOWN a rook, and used my more actively placed pieces to win TWO rooks, leaving me UP a rook.",
        "31... Kc7 32. Qc4+": "I still have a dominating position due to my active pieces.",
        "32... Kd8 33. Nf3": "I was actually a little annoyed that Black resigned here. Even though I will use my superiorly placed pieces and extra rook to tactically crush his underdeveloped position, I would've had fun doing it, and just being handed a win isn't as fun. It's the thinking required to win the game that's fun, not the win itself."
    },
    "url": "https://gameknot.com/annotation.pl/team-tournament-2006?gm=2866",
    "gameName": "Team Tournament 2006",
    "players": "bakerbaker (1795) vs. Aldrich (1700?)",
    "opening": "French (C02), advance, Milner-Barry gambit"
}