{
    "moves": {
        "1. e4 c5 2. Nf3 Nc6 3. d4 cxd4 4. Nxd4 g6 5. Nc3 Bg7 6. Be3 Nf6 7. Bc4 O-O 8. Bb3 a5": "This game is yet another Sicilian, along very similar lines to the last. This time I have played a5 in the hope that I can make a push to a4 useful. Sadly, the knights are making b5 inaccessible, and it seems that Ne5 will be required to prevent the bishop simply moving to c4. However, whilst Bd5 works it is not worth pushing this line yet.",
        "9. O-O e6": "Preventing Bd5",
        "10. Re1 Re8 11. Qd2": "Presumably looking at the Bg5 pin, I decided to defend this by attacking.",
        "11... Ng4": "Now Bg5 can be met with Bf6 or f6, and the knight move to Be5 allows the a4 pawn push planned earlier.",
        "12. h3 Nxe3": "Maybe should have played Ne5 with the aim of pushing a4 as originally planned, but I only had that as a plan to remove a bishop (I struggle against bishop pairs). Under the circumstance, taking this one seemed like a good plan.",
        "13. Qxe3": "A blunder - Nxc6 was required here to maintain material I think",
        "13... Nxd4": "I think Bxd4 may have been better here, allowing Qf6 and pressure against the f2 pawn. I captured with the knight in the hop of advancing b5 and a4 to capture the white bishop. When white has a3 after b5 this was just foolish I think",
        "14. Qd2 b5 15. e5 Qb6 16. a3 Nxb3": "So I decided to capture the bishop instead - swapping off pieces when ahead on material is normally a good thing. I now have a bishop pair, and the ability to get the white bishop onto the long diagonal. The game seems safely in black's favour now.",
        "17. cxb3 Bb7 18. Rac1 Rac8": "Keeping a presence on the open file -- More than happy to have the file opened if necessary, else looking at a possible Qc6 to threaten mate on g2. if Ne4 then Qd5 seems strong.",
        "19. Qxd7": "Takes then pawn, but this seems to be asking for material to be swapped off en masse -- I fail to see how this is going to be advantageous to white in the long term.",
        "19... Red8": "If 20. Qxb5 then 20... Qxb6 21. Nxb5 Rxc1 22. Rxc1 Bxe5 regains the pawn, with a lot less material on the board and whilst retaining both bishops -- this seems good for black.\n\nif 20. Qe7 then 20... b4 21. axb4 axb4, and after the knight moves a rook exchange followed by Bxe5 seems to gain a pawn -- the d8 rook, b7 bishop and b4 pawn will all be defended by the queen. This exchanges one of the rooks but gains the pawn lost at d7.",
        "20. Qxb5 Qxb5 21. Nxb5 Rxc1 22. Rxc1 Bxe5": "Complete the exchange of material, leaving the position very favourable to black as the pair of bishops is strong, and a bishop for a pawn is a solid material advantage. Also, the b2 pawn is currently hanging.",
        "23. Nc3": "Looks sensible, protects the pawn and keeps the knight protected.",
        "23... Rc8": "I'm not sure if giving up the open file is wise, but currently both the white rook and knight are now pinned lest more material loss is taken (24. Rd1 Bxc3 25. Rxc3 and black gains a pawn and threatens to gain another.)\n\nThe difficulty now is constructing a solid plan of attack to make this position more favourable. I would like to start looking at getting my King into play, but also have Bd5 in mind - There is a real concern of white playing b4 at this stage, and at the moment after 24. b4 axb4 .. 25. axb4 will be forced because of the threat to the knight. I don't want 25. a4 to be an option, and may use Bd5 to force white's hand.",
        "24. Kf1 Bd5 25. Re1": "This seems to lose material, and gives white little chance of recovering the game without a blunder. I think 25. b4 would have been better, as it would have given two (admittedly doubled) passed pawns which at least creates some threats in the black camp. However, now ...",
        "25... Bxc3": "If 26. bxc3 Rxc3 the pawn advantage is gone, and white cannot prevent black from going another pawn ahead: Either after 27... Rxb3 or 27. b4 axb4 28. a4 Ra3 or 28. axb4 Rb3 the queenside threats of pawn promotion that white may have had in mind are now gone.",
        "26. bxc3 Rxc3 27. Rb1 Rxb3": "Now the lead is a solid bishop and a pawn. if white exchanges rooks now the game is as good as over, so white must look for some counter-play and accept the loss of the a3 pawn as well.",
        "28. Rc1 Rxa3 29. Rc8+ Kg7 30. g3 a4": "Going for promotion ... I need to get the rook out of the way, but need the pawn to be on a white square first so my bishop can take over child-care duties :)",
        "31. Rc1 Rb3": "Getting the rook out of the way before the white king enters the game.",
        "32. Ra1 a3": "Now I can play Rc3 and a2 relieving the immediate pressure on the pawn. I would prefer being on the b file to allow a later Rb1, but even in the worst case scenario swapping my pawn and bishop for the white rook will be winning, so I can afford to be slightly careless.",
        "33. Ke2 Rb2+": "Great, this has allowed a2 -- if 34. Kd1 a2 35. Kc1 (preventing ...Rb1 ) I can just play 35... Rxf2 and threaten a simple Rf1  to take a rook swap.",
        "34. Kd3 a2": "Game annotation for team benefit --"
    },
    "url": "https://gameknot.com/annotation.pl/team-match?gm=9984",
    "gameName": "Team match",
    "players": "bloedeter (1531) vs. topazg (1548)",
    "opening": "Sicilian (B35), accelerated fianchetto, modern variation with Bc4"
}