{
    "moves": {
        "1. Nf3 Nc6 2. Nc3 Nf6": "I think it's the first time I've moved a knight on my first move: I thought I'd try it out for a change. Interesting that Black should do the same on his first move, but then I'd normally play 1... Nc6 as a response to 1. Nf3 when I'm black. That influenced my second move, which probably influenced Black's: a keenly contested centre.",
        "3. e4 e5": "We're keeping symmetry here, allowing our kingside bishops some freedom. ",
        "4. d4": "This move was made to free up my queenside bishop, and to try to get out the queen: if Black takes my pawn, I take the capturer with my knight, and if black takes my knight, I take back with my queen...",
        "4... Bd6": "...but he declines to take my pawn, enforcing the pawn trade...",
        "5. dxe5 Bxe5": "...so I agree to go ahead with it...",
        "6. Nxe5 Nxe5": "...along with a pair of minor pieces: his bishop for my knight. I have one developed piece to Black's two, but I do have one more long-range piece remaining.",
        "7. h3": "I made this move was necessary to prevent a knight from camping on g4.",
        "7... d6 8. Be3": "Now I get out my bishop, hoping to trade it for one of Black's knights, and get level on development...",
        "8... Be6": "...which prompted Black to develop his only previously undeveloped minor piece...",
        "9. Bd4": "...allowing me to line up his knights with my bishop...",
        "9... O-O 10. Bxe5 dxe5": "...so I trade my bishop for a knight, to remove another threat from Black, and open up the d-file...",
        "11. Qxd8 Rfxd8": "...so I can get rid of the queens. I may have surrendered the open file, here, but I thought it was best to remove Black's most powerful piece, for my king's sake, my queen capturing Black's in making the only queen move in the game...",
        "12. Rd1": "...but I can contest the open file with my rook. I'm hoping that Black's agreeing to go ahead with the exchange, as my king is denied access to the queenside...",
        "12... Rxd1+ 13. Kxd1": "...and Black did agree. He must be trying to make exchanges for the same reason, to help his own king.",
        "13... Rd8+ 14. Kc1": "Now Black has control of the open file, again. I moved the king along his starting rank along the queenside, to keep his bishop free, so it can allow his rook to contest the open file...",
        "14... a6 15. Be2": "...and I develop my bishop to the second rank to free the rook, allow my rook to contest the open file, and keep the bishop out of harm's way...",
        "15... b5 16. Rd1": "...so now my rook is free to contest the open file. I'm again hoping Black will agree to exchange, which would allow my king more room to roam...",
        "16... Rxd1+ 17. Kxd1": "...and Black agrees. The reason behind exchanging the six major pieces was to allow our kings more freedom on the board. If this was in a newspaper, this looks like a good position to begin analysing from: one open file (although open files are probably no longer an issue now that the major pieces are gone), with both of us having a light-square bishop, a knight, and seven pawns apiece.",
        "17... c5": "I'm playing a very defensive game here, allowing Black's pawns to come at me, and hoping to catch them, stop them from slipping through the net...",
        "18. b3": "...so I move up my knight's pawn to cover a4 and c4, to try to catch the pawns on those files...",
        "18... g6 19. a3": "...and I move my rook's pawn to cover b4, and to help my knight, as I could take the pawn should it land on b4...",
        "19... h5": "...so now the pawns are coming at me down the kingside...",
        "20. Kd2": "...so I advance my king to get him into the arena, and free up another square for the knight, should it need to retreat...",
        "20... Kg7": "...which prompted Black to move his king, as well...",
        "21. Ke3": "...so I move mine onto a good square: dark (so he can't be checked by the bishop), and the squares on which a knight could check him are guarded by pawns...",
        "21... g5": "...so Black advances a pawn towards me again...",
        "22. f3": "...forcing me to cover its next square...",
        "22... g4 23. hxg4 hxg4": "...prompting another pawn trade. I'm hoping Black will take another pawn (on f3) so I can take back, and keep mine connected...",
        "24. Kf2": "...so I move my king back, instead of capturing, as that would leave me with isolated pawns, while Black's are connected...",
        "24... Kg6 25. Nd1": "...and I now bring my knight into play by retreating it first...",
        "25... Kg5 26. Ne3 Kf4": "...but for the third successive occasion Black declines to capture, waiting like me...",
        "27. g3+": "...so I move my knight's pawn to push the king back...",
        "27... Kg5 28. fxg4": "...but than I had no option but to capture the pawn...",
        "28... Nxg4+": "...in exchange for mine. Now I'm facing a difficult endgame with weak, isolated kingside pawns, whilst Black's are connected.",
        "29. Nxg4 Bxg4": "I felt I had no choice but to initiate the knight trade...",
        "30. Bd3": "...but I decline to trade bishops, as that would leave me with a difficult pawn ending, as both kingside pawns wouldn't have been savable...",
        "30... Be6 31. Kg2 f5": "...but this turned the game in my favour...",
        "32. exf5 Bxf5 33. Bxf5 Kxf5": "...as now we both have an isolated, passed kingside pawn, but mine is closer to the edge of the board, which would allow my king to get nearer the queenside. I had no choice but to take Black's bishop, otherwise I would have either lost the pawn on c2, or it would have been disconnected from the one on b3.",
        "34. Kf3 e4+ 35. Ke3 a5 36. g4+ Kxg4 37. Kxe4": "And now, after an even game throughout, I'm about to win, with my king being better placed, and after my next move, Black's will be three files away, giving mine a head start...",
        "37... Kg3 38. Kd5 Kf3 39. Kxc5 Ke3 40. Kxb5": "...allowing mine to clean up two pawns, giving me a passed pawn on c2...",
        "40... Kd4 41. c4 Kc3 42. Ka4": "...and Black resigned here, knowing he couldn't stop all my pawns."
    },
    "url": "https://gameknot.com/annotation.pl/team-match?gm=29271",
    "gameName": "Team match",
    "players": "aspiemikey (1290) vs. devaunchy (1325)",
    "opening": "Reti opening (A04)"
}