{
    "moves": {
        "1. e4": "I'm from Boston so when i saw that my opponent was a \"New York Lovers\" member, i decided to put extra time into the games! Also it is my first ever completed game as a member of \"The Sneaky Knight Connection\"... Thanks to my awesome captain gothicgirl for setting up the game.",
        "1... c5 2. Nf3 d6 3. Nc3 Nf6 4. Bc4 Nc6 5. d4 cxd4 6. Nxd4 e6": "and we transpose into chess opening the GK database identifies as B88: \"Sicilian Sozin, leonhardt variation\"\r\nFischer played this opening as white frequently (although with different move order) so some call this the Sicilian \"Fischer-Sozin Attack\" ",
        "7. Bg5 a6 8. O-O Be7 9. Nf3 O-O 10. a3 h6 11. Bh4": "So far, just common sense moves with the development",
        "11... b5": "eventually i want to play d5 and that won't happen with his bishop there",
        "12. Bd3 Bb7": "points at the opponent's king and supports d5",
        "13. Qe2 Nh7": "i didn't like his bishop and i wanted a little more space inside my formation ",
        "14. Bxe7 Qxe7 15. Rfd1": "the D file is critical because it is half open, and my pawn is not part of my chain.... my opponent is trying to exploit this weakness while i try to prepare for a d5 push",
        "15... Rfd8": "This rook first because the C file is also half open",
        "16. Rd2 Rd7 17. Nd1": "he doesn't have that much time..... ",
        "17... Ng5 18. Nxg5 Qxg5": "his knight was more powerful than mine because of its location and now my queen also supports a d5 push ",
        "19. Ne3": "for now, i still can't play d5.... also his knight defends g2",
        "19... Ne5": "this attacks his bishop and also removes one of the two pieces separating my white bishop from attacking G2 and pinning the white knight in its place by threatening mate",
        "20. c4": "trying to prevent the d5 push and win some space for this bishop.... also sets up a 2-1 white pawn majority on the queenside.... i thought this might prove problematic later in the game",
        "20... Nxd3": "eliminating the only defender of the one piece between my bishop and G2.... he will capture with the queen to avoid losing the pawn.... his position of having the queen in front of the rook later is very problematic for him",
        "21. Qxd3 bxc4": "i found no other moves to avoid losing the pawn",
        "22. Nxc4": "I thing that Qxc4 is much better but i haven't analyzed it.....perhaps hs was afraid of Rc8 \r\n",
        "22... d5": "Finally, D5!",
        "23. f3": "no good moves here that i can see for white...",
        "23... Rad8": "to allow either dxc4 or dxe4",
        "24. Nb6 dxe4 25. Qc3": "Black's best option was Qxd7, which would lead to 2 of my rooks for his queen",
        "25... Rd7xd2": "what other move is there to make? ",
        "26. g3": "the only move that doesn't result in mate of the loss of the queen (Kf1, Qxg2, Ke1 #) or Qxd2 Rxd2, then white is back in the same predicament it was before",
        "26... exf3 27. Qc7": "trying to make something happen and regain a few of those lost points",
        "27... Rd2d1+": "I found a mate sequence before he could though",
        "28. Rxd1 Rxd1+ 29. Kf2 Qd2#": "Thanks Flycatcher for the game! "
    },
    "url": "https://gameknot.com/annotation.pl/team-match?gm=360",
    "gameName": "Team match",
    "players": "flycatcher (1476) vs. acrewboy02 (1458)",
    "opening": "Sicilian (B50)"
}