{
    "moves": {
        "1. e4": "Just a warning that this game is full of mistakes and/or blunders but the analysis is done anyway to learn from mistakes.",
        "1... c6 2. d4 d5 3. Nc3 dxe4 4. Nxe4 Bf5 5. Ng3 Bg6 6. Nf3 Nf6 7. h4 h6 8. Ne5 Bh7 9. Bd3 e6": "Not that e6 is bad or anything but Bxd3 is probably slightly better and gives both opponents a more even game.",
        "10. Bxh7 Nxh7 11. Qh5 Qc7 12. Ne4 Bb4+": "Again not the best move but could not be considered bad.\nMaybe developing a piece with Na6 would be okay even if it looks somewhat odd.",
        "13. c3 Ba5": "Blunder.  After the following long line we see why this is: … Ba5 13.  Nd6+  Kf8  14. Bxh6 Nf6  15. Bxg7+ Kxg7  16. Qg5+ Kf8  17. Qxf6 Rh7  18. Ndc4 Qd8  19. Qf4 Ke8  20. Nxa5 Qxa5\n\nSuggestion maybe … Bf8 might defend the black kingside?",
        "14. Bf4": "This is a mistake if you look closer:\n14. Nd6+  Kf8  15. Bxh6 Nf6  16. Bxg7+ Kxg7  17. Qg5+ Kf8  18. Qxf6 Rh7  19. Ndc4 Qd8  20. Qf4 Ke8  21. Nxa5 Qxa5 gives White a fairly big advantage.",
        "14... O-O 15. Rh3 Nd7 16. Rg3 f6 17. Ng6 e5": "Big blunder.  Checkmate in 9 (… e5 17.  Ne7+  Kh8  18. Bxh6 g5  19. hxg5 Bxc3+  20. bxc3 fxg5  21. Bg7+ Kxg7  22. Nxg5 Nxg5  23. Qg6+ Kh8  24. Rh3+ Nxh3  25. Qh6#).\n",
        "18. dxe5": "Another blunder... Ne7+ Kh8  19. Bxh6 g5  20. hxg5 Bxc3+  21. bxc3 fxg5  22. Nxg5 exd4  23. Bg7+ Kxg7  24. Qg6+ Kh8  25. Qxh7# gives white the win.",
        "18... Rfe8 19. O-O-O": "Small mistake 19. e6 seems more solid.",
        "19... fxe5": "… Nxe5 would keep the game more even.",
        "20. Bxh6 Ndf6 21. Nxf6+ Nxf6 22. Qg5": "Blunder.  This move allows the opponent right back into the game.  However  22. Qf5  Red8  23. Rxd8+ Rxd8  24. Nxe5 Ne8  25. Qe6+ Kh7  26. Nf7 Qd7  27. Ng5+ Kh8  28. Bxg7+ Nxg7  29. Nf7+ Kg8  30. Nxd8+ Qxe6  31. Nxe6 gives white a much bigger advantage.\n\n",
        "22... Ne4 23. Qe3": "Mistake is seen here: 23. Qe3  Nxg3  24. Qxg3 gxh6  25. Ne7+ Kh8  26. Rd7 Rxe7  27. Rxc7 Bxc7  28. Qg6 Rh7  29. Qf6+ Kg8  30. Kc2\n\nBest move would keep the game even with: Qg4 Nxg3  24. fxg3 Rad8  25. Rxd8 Rxd8  26. Qe6+ Qf7  27. Ne7+ Kf8  28. Ng6+ Kg8",
        "23... Nxg3 24. Qxg3 e4": "Mistake I believe... better is … gxh6 24.  b4  Bb6.",
        "25. Bf4 Qf7 26. Kb1 Rad8 27. Rh1 Rd3 28. Qg4 Qd7 29. Qh5 Bb6": "… Rd5 29.  Qe2  Bb6 should be considered.  ",
        "30. Ne5": "30. Be5  Kf7  31. Bd4 Qd5",
        "30... Rd5 31. Qg5": "Blunder... Qg5 Qd6  32. Qg4 Rdxe5  33. Bxe5 Qxe5  34. Rf1 Qf6  35. f4 Rd8  36. Rh1 Qd6  37. h5 Qd3+  38. Ka1 Bc5",
        "31... Bxf2": "Blunder again.  … Qd6 31.  Qg4  Rdxe5  32. Bxe5 Qxe5",
        "32. h5": "Blunder yet again.  32. Nxd7  Rxg5  33. Bxg5 e3  34. Nc5 e2  35. Nd3 e1=Q+  36. Nxe1 Bxe1  37. Kc2 Bg3  38. Rd1 Bf2  39. Rd2 Bc5  40. g4 would give white a clear advantage.",
        "32... Qe7": "Smaller error because of the following… Qe7 32.  Qxe7  Rxe7  ",
        "33. Qg4": "Mistake:  Qxe7 Rxe7  34. Ng6 Re6 is better.",
        "33... e3 34. h6 Rxe5 35. hxg7": "Another mistake this game is now approaching to an end with black having the advantage.  ",
        "35... Qxg7 36. Qxg7+ Kxg7 37. Bxe5+ Rxe5 38. Kc2 e2 39. Kd2 e1=B+": "Although at this point the game is lost … e1=Q+ would be the better promotion.\nAfter this there are still several mistakes done by the players but as said the game is over.",
        "40. Kd3 Re3+ 41. Kc4 b5+ 42. Kb3 a5 43. a3 Re2 44. Ka2 Bxc3 45. Rb1 Bfd4 46. Kb3 Bcxb2 47. Rxb2 Rxb2#": ""
    },
    "url": "https://gameknot.com/annotation.pl/team-match?gm=32014",
    "gameName": "Team match",
    "players": "chess_avenger (1384) vs. jnod (1451)",
    "opening": "Caro-Kann (B18), classical, Flohr variation"
}