{
    "moves": {
        "1. e4 c6 2. d4 d5 3. Nc3 dxe4 4. Nxe4 Nf6 5. Ng3": "I've encountered this move a couple of times, but not very frequently. Again, he says he wants to get out of the book -- but why leave the book when the recommended move is supposed to be good for White?",
        "5... g6 6. Nf3 Bg4 7. Be2 Bg7 8. O-O O-O": "Just standard development to this point. Now what? It feels strange for me to have a fianchettoed bishop in the Caro-Kann, because how can I play c5? I'm looking at Qb6 next and then Nbd7 and, at some point, e6. I feel I'll have to trade on f3 at some point and get rid of my problem bishop that way.",
        "9. c4": "I just peeked at my teammates' game -- already lost one and behind in the other one. That's tough. Means that I have to win both just to get a draw. And my plan had been to win my game as white and try to get a draw with this one.",
        "9... Nbd7 10. Ng5 Bxe2 11. Qxe2 c5 12. d5": "I'm going to have to deal with my weak pawn on e7 at some point.",
        "12... h6 13. Ng5e4 b5 14. cxb5 Nxd5 15. h4": "Why would he do that? If he pushes it to h5, I'll play g5. That lets his knight have f5. So I'll play e6 to keep ahold of that and also helps take some pressure off of that pawn.",
        "15... e6 16. h5 g5 17. a4 Qc7 18. Nc3": "Is he going to give me a free pawn? Maybe he thinks he can win it back with a strong attack on my c-pawn.",
        "18... Nxc3 19. bxc3 Bxc3 20. Bb2": "It's been a few days since I saw this game. I was looking at this position, trying to see the best way to keep the pawn. Should I play Qe5 or just take the pawn? Then I saw that I'm up  a pawn! I don't even remember that happening. So let's trade.",
        "20... Bxb2 21. Qxb2 Ne5 22. Qc3 Rfd8 23. Ne4 c4 24. Nf6+ Kf8": "I probably should've moved f5 instead of Rfd8 a couple of moves ago. That would've kept his knight off of e4 (and would've let me play Kf7 if I got into a position like this). Now, I think he can force a draw.",
        "25. Rae1 Nd3 26. Re4 Rac8 27. Nh7+ Kg8 28. Nf6+ Kf8 29. Nh7+ Kg8 30. Nf6+ Kf8": ""
    },
    "url": "https://gameknot.com/annotation.pl/team-match?gm=45325",
    "gameName": "Team match",
    "players": "haragan (2032) vs. chuckbo (2032)",
    "opening": "Caro-Kann (B15), Alekhine gambit"
}