{
    "moves": {
        "1. e4 d6 2. d4 Nf6 3. Nc3 g6 4. Nf3 Bg7 5. Be2 O-O 6. O-O Bg4 7. Be3 Nc6 8. Qd2": "Not a normal opening for me, but fairly standard looking development.",
        "8... e5 9. d5 Ne7": "This seems a bad exchange for black, as the g7 bishop seems to have no control any more.",
        "10. h3 Bd7 11. Nh2": "Now trying to build up a kingside attack whilst my pieces seem to have good positioning.",
        "11... c6 12. a4": "Erm, yes, like I said, my kingside attack ... :S\n\nNot quite sure why the change of plan here -- I think I was blocking bishop advances to b5 whilst hoping to play Ra3 to get the Rook into kingside play.",
        "12... cxd5 13. exd5 Nf5": "Hmmm, not so good. now e4 can release the black bishop and I'm under attack myself. I'd love to know what I should have done differently? The only thing I can think of is playing dxc6 myself and then following with f3, but it seems to restrict the kingside I was trying to activate.",
        "14. Bg5 h6 15. Bxf6 Bxf6 16. Ne4": "Trying to maintain the initiative and swap a bishop back as I get uncomfortable with my opponent having both bishops.",
        "16... Kh7": "Strange move to me? I'd love to know the thoughts behind this one.",
        "17. Nxf6+": "Tempted with g4 and Nxd6, but my desire to remove a bishop was greater.",
        "17... Qxf6 18. Ng4 Qg7 19. Ne3 Qf6 20. Ng4 Qg7 21. Ne3": "Kingside pressure is far bigger for black now, so I play for repetition.",
        "21... Nxe3 22. Qxe3 f5 23. c4 f4": "Here comes the pawn rush.",
        "24. Qd3 Bf5 25. Qb3": "Forced, but happy with this, I had hoped black would play this so I could play Bd3 and swap off more pieces. I've already lost the belief in the win here, which cannot be a good sign.",
        "25... b6 26. Qb4": "Single piece threat to the pawn, getting desperate.",
        "26... Qf6 27. Qa3": "Hoping to play b4 and lock up the queenside.",
        "27... g5": "The pawn rush keeps coming.",
        "28. Bd3": "This seems desperate now, as e4 puts so much pressure on white -- Rae8 makes things a lot worse as well.",
        "28... Bxd3": "Seems to be a small respite for white now!",
        "29. Qxd3+ Qf5 30. Qxf5+": "Now a draw seems guaranteed after Rxf5 and f3.\n\nGame annotation for team benefit --"
    },
    "url": "https://gameknot.com/annotation.pl/team-match?gm=10933",
    "gameName": "Team match",
    "players": "topazg (1565) vs. justinian (1578)",
    "opening": "Pirc (B08), classical system, 5.Be2"
}