{
    "moves": {
        "1. d4 e6 2. Nf3": "I thought he was going to paly Queens gambit which i respond e6 then d5 or c5 in any order.",
        "2... Nf6 3. e3": "Blocking his dark squared bishop would be a mistake. The block wasn't forced",
        "3... c5": "My favourite move. Attacking the center and if he was to recapture I ould develop my dark squared bishop and castle the next move.",
        "4. Qd3": "Not a particularly good move. He should've tried to develop his light squared bishop first",
        "4... Nc6": "Attacking D4",
        "5. c3": "He didn't need to reinforce it yet,",
        "5... d5": "Striking the center.",
        "6. h3": "I wasn't really planning t move Ng4",
        "6... Bd6": "Getting ready to castle. This is like Queens Gambit except for black. I have developed the initiative early in the game. HE could capture So i would lose tempo.",
        "7. b3": "Preparing for a c4 pawn push or to prevent my push to c4 which i wouldn't do because it would easily be countered.",
        "7... Bd7 8. a4 Qb6": "A powerful square for the queen to be on",
        "9. Ra3": "? Mistake. I will win pawn at least.I could Capture on d4 and if he were to capture back i would capture his rook. If he were to move his rook i would capture e3 and when he captures back i would capture b3 althoug my queen might get trapped.",
        "9... cxd4 10. cxd4": "He didn't realise it",
        "10... Bxa3 11. Bxa3 Ne4 12. Bc5": "Attacking the queen I could've gained a pawnby capturing the bishop with the knight but i opted not to.",
        "12... Qc7 13. Nfd2": "Despertely trying to rid my knight. Why not with the queenside knight?",
        "13... Nxd2": "I captue",
        "14. Qxd2": "Capture with queen. I thought he would with the knight",
        "14... b6": "The bishop prohibited me from castling so i try to push it back a little and hopefully remove it off the diagonal.",
        "15. Bb4 Nxb4": "Material is gained no matter what. If he takes my knight then i could come to c1 and check his king and fork the knight winning a piece at least.",
        "16. Nc3": "He realises this and finally develops his knight",
        "16... O-O": "I castle FINALLY to develop my rook. I castled on a free move when there wasn't much to do",
        "17. Bd3": "Why would he wasn't to exchange with me? I'm in a winning position and it's not smart to exchange.",
        "17... Nxd3+": "I capture",
        "18. Qxd3 Rac8": "Striking C3 and developing my rook.",
        "19. Kd2": "Only move in which he could hold on to material. He could've moved his knight to d1 which wouldn't be so bad",
        "19... Rfe8 20. f4": "Since his king had already moved he didn't need his kingside anymore.",
        "20... Red8 21. Rc1 Qd6": "Just tryin to stay out of a queen attack",
        "22. Kd1 Rc7": "Preparing for a battery.",
        "23. g4": "Now he attempts to attack ",
        "23... Be8": "I moved back just incase his pawn storm worked. I would move f6 or f5 and my bishop would be a supporting piece.",
        "24. Kd2 Qb4": "A pin",
        "25. h4 Rdc8 26. h5": "MOving his king to d2 was a mistake because He had a Queen and rook defending a piece while i had a rook and queen. 2 defenders beat 2 attackers.",
        "26... Rc7xc3": "I exchange and now i know his pawnstorm will fail",
        "27. Rxc3 Rxc3 28. Qxc3 Qxc3+ 29. Kxc3 Kf8 30. b4 Bxa4": "Free pawns. Victory is ensured",
        "31. g5 Ke7 32. Kd2": "Last attempts to destroy my king side.",
        "32... a5 33. Kc1": "Obviously a mistake from his low morale",
        "33... axb4": "RESIGNS"
    },
    "url": "https://gameknot.com/annotation.pl/team-match?gm=39140",
    "gameName": "Team match",
    "players": "artykid (1252) vs. richard1234567 (1384)",
    "opening": "Queen's pawn (A40)"
}