{
    "moves": {
        "1. d4 d5 2. c4 Nf6": "The Queen's Gambit Declined, Marshall Defence.",
        "3. Nc3": "White is trying to mysteriously gain my pawn.",
        "3... Be6": "I have to admit, I did not do so good playing this move. However, the good news is that I can overcome the lazy c4 pawn without a doubt.",
        "4. e3": "Not good enough.",
        "4... dxc4 5. Nb5": "A little worse from his past move.",
        "5... Nc6": "Expecting 6.d4?.",
        "6. Nf3 Bd5": "Preparing to bring out the dark squared Bishop.",
        "7. Be2": "Why not 7.Qc2?",
        "7... e6 8. b3": "What is White up to now?",
        "8... Bb4+ 9. Bd2 Bxd2+": "I didn't really like this move.",
        "10. Qxd2": "Safe take.",
        "10... Ne4 11. Qc2": "White should have double-checked this position before playing this move.",
        "11... Nb4": "White's Queen is dodging bullets in the new game,\"Who's in Bullet Alley?\"",
        "12. Qb2 c6": "First, White's Queen, and now his Knight!?",
        "13. Nc3": "At last, a safe move for White. ",
        "13... Qd6 14. Nxe4": "What was that for? A free knight! For what?",
        "14... Bxe4 15. Bxc4": "I didn't see this coming.",
        "15... Bd3": "Threatening 16...Nc2+.",
        "16. O-O-O": "16.O-O-O? An uncommon move for White, but the right move aside from 16.Rc1.",
        "16... Bxc4 17. bxc4": "I did an accidental experiment with a Bishop sacrifice.",
        "17... c5 18. dxc5 Qxc5": "Motto: Never commit an experiment in chess unless you really want to know what will happen to your position.",
        "19. Qd2": "Up ahead...I spy...a free pawn and check?! I must of not been as foolish as I thought.",
        "19... O-O": "Out the window his free pawn went. What do I mean? Let's say I had an easy breakthrough and I blew it. Better luck next time for me.",
        "20. Ne5": "My point exactly. Now we're playing, \"Free for All\".",
        "20... Qxe5": "I got greedy again!!",
        "21. Qxb4 Qa1+": "Fine.",
        "22. Kd2": "Another free pawn. This time, I will hopefully grab it.",
        "22... Qxa2+": "Finally!",
        "23. Kc1 Qa6": "I was not intended for a draw.",
        "24. Rd3 Qa1+ 25. Qb1": "Now is probably a great time to trade Queens.",
        "25... Qxb1+ 26. Kxb1 Rfd8": "It's the d-file wars, and guess what's going to happen. Don't worry, it's predictable.",
        "27. Rxd8+ Rxd8": "The endgame? So soon!?",
        "28. h4": "Now, I am disappointed that I traded Queens. I can see how helpful one can be. Sigh...I wish this was bughouse.",
        "28... f6 29. Rc1 Rd2 30. c5": "If White were a bit smarter, he'd play 30.Rf1",
        "30... Rxf2 31. c6 bxc6 32. Rxc6 Rxg2 33. Rc8+": "A okay check. Keep checking and he'll have trouble. All I think White's trying to do is take the a7-pawn, which I don't think he should try.",
        "33... Kf7 34. Rc7+ Kg6 35. Rxa7 Rh2": "We've just committed a pawn exchange after35.Rxa7?!. White couldn't gain anything with the rook take.",
        "36. Ra6 e5": "Another attempt to gain more material than I'm taking goes wrong. Now a slow chase begins.",
        "37. e4 Rxh4": "Step 1: Taking the h-pawn is crucial.",
        "38. Kc2 Rxe4": "Why did White not do 38.Ra4?",
        "39. Kd3 Rf4 40. Ke3": "White's king is so wild, he has already given me a severe headache and a piece cramp.",
        "40... h5 41. Kd3 h4 42. Kc3 Rd4": "I gave the White King a little box to rome around in.",
        "43. Kb3 h3 44. Ra4": "These last nine moves were finished today. My opponent offered me a draw...",
        "44... h2": "and I declined it by playing this move.",
        "45. Ra1": "I had a plan to create a double threat after this move.",
        "45... e4 46. Rh1 Rd2": "Step one: guard the a2-pawn with the rook.",
        "47. Kc3 e3": "Step two: Guard the rook as well.",
        "48. Re1": "Step three: expect this move and be willing to sacrifice a rook and a pawn for a Queen and other chances to promote.",
        "48... Re2 49. Rh1 Rf2": "Step four: force White to choose what he is going to take.",
        "50. Kd3 e2": "Step five: enjoy success after this move.",
        "51. Kd2 Rf1 52. Kxe2 Rxh1 53. Kf2 Rg1": "My opponent resigned. 54.Ke3 h1=Q and there is no other way for White to win."
    },
    "url": "https://gameknot.com/annotation.pl/team-match?gm=39264",
    "gameName": "Team match",
    "players": "nwchess (1017) vs. chesskingdom64 (1060)",
    "opening": "QGD (D06), Marshall defence"
}