{
    "moves": {
        "1. Nf3 f5": "f5? This seemed like a mistake right away. I've seen this move vs d4 and also vs f4 Bird's opening. It comes up in the Kings Gambit, e4--e5, f4--f5, but here it isn't challenging anything and weakens the king-side.",
        "2. d3 e6 3. e4 fxe4 4. dxe4 Bc5 5. Nc3 d6 6. e5 d5 7. Bg5 Ne7": "It has led to this where White is clearly better as a result of Black's poor piece placement, backward e pawn, and lack of king safety.",
        "8. Na4 Bb6 9. Nxb6 axb6": "Now Iv'e eliminated the strong bishop and the queenside now will not provide good castled protection.",
        "10. c4 c6 11. cxd5 cxd5 12. Bb5+ Nbc6": "My bishops have a nice cross-fire attack going and all Black's minor pieces are tied up.",
        "13. O-O O-O 14. a4 Qe8 15. Be3 Qh5 16. Bxb6 Nxe5 17. Nxe5 Qxe5 18. Bc5 Qg5 19. f4 Qh4 20. Ra3 Rd8 21. Rh3 Qf6 22. Bd4": "Black didn't see the problem the rook lift at a3 was going to cause.",
        "22... Qf7 23. b4 Nf5 24. Bb6 Rf8 25. Bd3 Bd7 26. a5 Qe8 27. g4 Nh6 28. Bc5 Rf7 29. Qe1": "Now is where I'm going to go to work--I have the space and the piece placement and what I want is to sacrifice the exchange at h6 and rip open his king position.",
        "29... e5 30. fxe5 Rxf1+ 31. Qxf1 Bxg4 32. Rxh6 gxh6 33. Qg2 h5": "He has to lose a piece in this sequence and again just didn't see it coming.",
        "34. h3 Qxe5 35. hxg4 hxg4 36. Qxg4+ Qg7 37. Qxg7+ Kxg7 38. Kf2 Re8 39. b5 h6 40. a6 bxa6 41. bxa6 Ra8 42. a7 Rxa7 43. Bxa7": "That definetly did it. Now it would be a matter of being careful not to give a stalemate.",
        "43... Kf6 44. Bd4+ Ke6 45. Kf3 h5 46. Kf4 h4 47. Kg4 h3 48. Kxh3 Kd6 49. Kg4 Kc6 50. Kf4": "Black resigned here although it would have taken a little work to avoid a stalemate or a draw. But being a 1900 player, he felt this was his loss and took it like a man. Good game."
    },
    "url": "https://gameknot.com/annotation.pl/team-match?gm=32487",
    "gameName": "Team match",
    "players": "jhfit (1887) vs. eludens (1866)",
    "opening": "Reti (A04), Lisitsin gambit deferred"
}