{
    "moves": {
        "1. d4": "Alright,I decided to play d4. I used to play d4 all the time before but now i prefer e4. after you play d4 so many times you get tired of it and e4 has so many different variations that you wanna try. I tried switching to english,looking up some satisfactionary main lines but I judged that they are to similar to d4 openings and I usually run out of ideas in english.",
        "1... Nf6": "Normal move. I have met c5 (old benoni) d5 (Queens gambit after 2.c4) and e6 (usually transposes into Nimzo-indian) and one time i played against g6. I had the advantage but i made a misstake move,i went for a combination and over-looked a move which completely won. It was a real game and my opponent had 2036 in rating.",
        "2. c4": "Normal move. You can also play 2. Bg5,that's the ''Trompovsky attack'' however i have studdied in trompovsky and figured out that black gets a better game if he knows his stuff in that opening i mean i play as black 1.d4 Nf6 2.Bg5 Ne4 with unclear positions even tho i think black gets the advantage. 2.e3 and 2.c3 is a bit passive since c4 grips the d5 square. 2.c3 also prevents that knight from developing to c3. I think you can also play 2.Nf3 with the idea of delaying c4 a move just to confuse your enemy a little bit. It worked well against me.",
        "2... e6": "black can play c5 (modern benoni) or g6 (grunfeld/KID) as well. This looks Nimzo-indian like. But it doesnt have to be a Nimzo-indian even tho it looks to me the most popular setup in this position. It can become a Queens-indian and even a Modern Benoni again after 3. ... c5. So yeah,again this is book so far.",
        "3. g3": "I enjoyed playing the Catalan (3. g3) before,despite that i usually played wrong moves in the opening ^^. White can also play Nc3 and Nf3 in this position. both are different main lines.",
        "3... d5": "Black plays normal here. he can also play c5,that's also a variation.",
        "4. Bg2": "inviting black to take the c-pawn. The advantage is that i get a big diagonal for my bishop,pressuring that b7 square.",
        "4... Be7": "Black chose not to take the pawn. If he takes it is a Catalan Open. If he doesn't it's called Catalan Closed. but he can take that pawn later,transposing it into a catalan open.",
        "5. Nf3": "It is neccessary to develop that knight. It looks like it is blocking the g2 bishop but the knight can go to e5 in some occasions.",
        "5... O-O 6. O-O": "Alright Both of us castles. So far it's book. Look at this position. I enjoy this position as white. the way white's king is so well protected by three pieces and 4 pawns, and has two center pawns dealing with the center.",
        "6... c5": "i think c5 is a main line move. Black can also play the more normal 6. ... dxc4 7. Qc2 a6 8.Qxc4 b5 9.Qc2 Bb7. I think this is a main line move too. It was a while i played against it.",
        "7. Nc3": "Simpel development.",
        "7... cxd4": "And black decided to clarify the situation. i think Nc6 is also a move.",
        "8. Nxd4": "If white takes with the queen black wins tempo with Nc6. Now we can also see that white frees the g2 bishop.",
        "8... Nc6": "Okay. I haven't read any main line that goes like this. From here i tried to play as good as i can.",
        "9. cxd5": "Boy i dont know. i think leaving that c-pawn there might have been better. The point of this move is to give black the isolated queens pawn.",
        "9... exd5 10. e4": "I have actually played this position against black before. But i tried 10. b3 Bc5 11.Nxc6 bxc6 12.Na4 Bd6 13. Bb2 Be6 14. Rc1 and we see how well i cover the black squares and stop that passed-backwards-c-pawn. the game went on 14. ... Rc8 15.Nc5 Qe7 16. Qd4 with a small advantage to white (i went on to win that game). I decided that i wanted to try something else in this position and e4 looks fine to me.",
        "10... Bc5": "Bc5. Uh,i think it's an okay move,it's diffcult to judge for me but after...",
        "11. Nb3": "Nb3 it's getting difficult for black. I am attacking his bishop and questioning his bishop pair.",
        "11... d4": "He tried d4. it was perhaps the best move.",
        "12. Nd5": "I decided to play Nd5. But now it looks like white has the advantage here. Black can't play 12. ... Nxd5 13.exd5 where as both the knight and bishop is underfire.",
        "12... Bb6": "Probably the best move but now comes...",
        "13. Bg5": "A powerfull Pin. it threatens to weaken black's kingside with taking that knight. Maybe this was black best continuation after 10. ... Bc5. because i think Bc5 was a bad move because of what it's leading to.",
        "13... h6": "i think 13. ... Re8 was slightly better.",
        "14. Nxf6+": "I analyzed this position a lot. I looked at Bxf6 too but Nxf6 is clearly better.",
        "14... gxf6 15. Bxh6": "Now i didn't only weaken black's kingside but i also won a pawn. i dont like the looks of it for black.",
        "15... Re8": "Here i really wanted to play the 2 move Checkmate with Qg4+ but of course the bishop on c8 stops that.",
        "16. f4": "!? interesting. I analyzed this move deeply. I looked mostly at 16. ... f5 and i decided that white was still leading in that position. The point of this move is to play 17.f5 followed by Qg4+ that wins.",
        "16... Kh7": "i think black would be better of with f5. He obviously didnt see that. because now...",
        "17. Qh5": "I play the risky move Qh5 this looks uncomfortable for black.",
        "17... Rh8": "well this was probably not the best move. But i dont see a good move for black in this position anyways. 17. ... Rg8?? would be answered by 18. Bf8+! with mate on the next move.",
        "18. f5": "Now came to deadly f5. I dont think black has any defence against that. i block off his light squared bishop and simply threatens to bring my rook into the attack.",
        "18... Ne5": "Ne5. Black protects f7,putting the knight on a nice outpost and protects the g4 square.",
        "19. Rf4": "Rf4 comes anyways Bringing that rook into the attack is very difficult for black.",
        "19... d3+": "discovered check but after...",
        "20. Kh1": "Kh1 black resigned. I suppose he saw that for example 20. ... d2 is met by 21. Nxd2 Qxd2 22. Rg4. there is 20. ... Qg8 21. Bf8#. if black plays 20. ... Bd7 just to see my plan,then 21. Rh4 (threating Bf8+) 21. ... Kg8 22.Rg4+! Nxg4 23. Qxg4+ Kh7 24. Qg7# So a good kingside attack by me without making any interesting piece sacrifices. gg."
    },
    "url": "https://gameknot.com/annotation.pl/team-match?gm=35107",
    "gameName": "Team match",
    "players": "excile (1661) vs. chessssss (1647)",
    "opening": "Catalan (E07), closed, 6...Nbd7"
}