{
    "moves": {
        "1. Nf3": "This is a team game I lost and my opponent and I discussed annotating it together as practice, so here we go. I'm using Reti, which is an opening I like due to the versatility and flexibility.",
        "1... d5 2. d4 Nf6 3. c4 Nc6 4. Bf4": "This was a mistake. e3 was what I should have done, which is pretty obvious in retrospect. This move accomplishes exactly nothing.",
        "4... dxc4 5. Nc3 e6 6. e4": "I guess I wanted to leave an escape route for my DSB.",
        "6... Be7 7. Bxc4 Na5 8. Qa4+ Nc6": "I feel like I'm in good shape in this position. None of my previous moves have sealed my fate and no one has dominant control of the center yet.",
        "9. h3": "Mistake. d5 is the better move as I have more threats on that square and would likely dictate tempo going forward.",
        "9... Bd7 10. Bb5 a6 11. Bxc6 Bxc6 12. Qc2 O-O 13. e5 Nh5 14. g3": "Obviously I made a mistake here. Left the N hanging to protect the B, when I should have just Be3 or Bd2. ",
        "14... Bxf3 15. Rg1": "My earlier mistake forces another move, which I think I pay for much later on in the game in the form of an exposed K.",
        "15... Qxd4": "Central Q will now punish me for not developing better. It's hard to look at mistakes like this next move and figure out what I was thinking when I did it. I blame a combination of moving too fast, playing at work, and playing too many games. ",
        "16. Be3": "Really, though, this was stupid carelessness. Have a pawn, I'm done using it.",
        "16... Qxe5 17. g4": "Want to see another smart move? Looking at it now, I guess I never wanted to win. I can't even find a decent move here with all of his forces joining up on my side of the line.",
        "17... Qh2": "I think you could argue this was a mistake, with perhaps a trade like Nf4 being better and then working toward bringing the DSB into the fray via 17. ... Nf4 18. Bxf4 Qxf4 19. ... Bc5. ",
        "18. Kd2 Qxh3": "This was definitely a mistake, but I have no real means of capitalizing any more than gxh5.",
        "19. gxh5 Bxh5 20. Bh6": "I'm desperate here and this just ends up keeping my B and R both occupied for no good reason. He's got me boxed out from getting my Q to g7. ",
        "20... Rad8+": "This is a critical move for black and the beginning of the end for me.",
        "21. Ke1 Bf6": "I knew he saw it already, but this cements it.",
        "22. Ne2 Qf3 23. Rd1 Rxd1+ 24. Qxd1 Rd8 25. Qc2 Kh8 26. Be3 Bh4 27. Nd4 Qxe3+ 28. Ne2 Qxf2#": ""
    },
    "url": "https://gameknot.com/annotation.pl/team-match?gm=59016",
    "gameName": "Team match",
    "players": "atom842 (1252) vs. mdu111 (1233)",
    "opening": "Reti opening (A06)"
}