{
    "moves": {
        "1. d4 e6 2. c4 d5 3. Nc3 c6": "3....c6  We are headed for either the Slav Defense or the Semi-Slav Defense, and both variations create vigorous counterplay for both sides on both the Q-side and the K-side.\r\n",
        "4. Nf3 dxc4": "4...dxc4  An invitation to W to create a central pawn push, possess the center and command from there, or to lose time retrieving the c-pawn and risk opening the W Q-side to a B onslaught.  An important point is that B played 1...e6, preventing a move like .....Bg4.  This choice creates a \"bad bishop\" for B later, similar to many variations of the French Defense.  It is not a bad choice, but it dictates some rock-ribbed behavior by B to get through to the early middle-game, with normally good prospects. ",
        "5. a4 Bb4": "5....Bb4  Of course! W cannot challenge this Bishop now with a3.  But W has other plans to restrict the coming B Q-side pawn play.",
        "6. e3": "5...Bb4  Of course!  W cannot challenge this Bishop with a3 now.  But W has other plans to disrupt the coming Q-side pawn play.\r\n\r\n6. e3  I seriously considered 6. e4 to command the center.  But that is B's intention anyway, and I had decided first to counter-balance B's Q-side pressure.  And getting in my early 5. a4 guarantees that good counter-balance and an eventual recovery of the c-Pawn.",
        "6... b5 7. Bd2 Bxc3 8. Bxc3 Nf6 9. axb5 cxb5 10. b3": "10. b3  All book to this point.  But now we start to stray from the main lines.  My counter-balance operation is in progress now.  There is no hint yet that the game will shift quickly to the the K-side and later the center.",
        "10... Qc7 11. Ba5 Qd6 12. bxc4 bxc4 13. Ne5 O-O": "13....O-O  B's Q-side is obviously open terrain, so this is the only move to give B's King any sanctuary.  But now what will W do with his own Queen and King?  It is hard to believe that they do not move during this entire game!   In fact, to do so from this point on only serves to slow down the action W's minor pieces are causing!",
        "14. Nxc4 Qd5": "14....Qd5.  We are commencing a fascinating phase of the game.  First observe that the control of the a8-h1 diagonal will begin to dominate the game.  This is the ongoing counter-balance strategy I have started.  But secondly, also observe that B has activated his Queen and can soon activate his Q-side minor pieces to do some serious damage to W's King.  How do these two strategies play out against each other?",
        "15. Be2": "15. Be2  Is that tempting K-side Knight Pawn worth yielding the a8-h1 diagonal? That is the question I posed to B, in effect.",
        "15... Nc6": "15....Nc6.  I considered he might try 15....Ba6 attacking the Knight.  I was considering 16. Bf3 if he made that move.",
        "16. Bc7": "16. Bc7.   Of course! This freezes B's Rooks and commands the b8-a2 diagonal.  Both Bishops will soon be commanding the board.",
        "16... Bd7": "16....Bd7.  B did not apparently consider 16...Bb7, maybe because some variations seem to leave that bishop hanging undefended on that a8-h1 diagonal, depending upon how the N/c6 moves.   Once W moves Bf3, the diagonal belongs to W.  It was possibly worth looking at 16....e5 for B, even though it costs a Pawn, because it really frees up his pieces and gives his a-Pawn more support if it can make it to a5.  But the timing is important.  Can he do that knowing that Bf3 is looming?",
        "17. Nd6": "17. Nd6  This retains the lock on B's Rooks and continues the invitation to B's Queen to stray into the K-side, and of course take another Pawn!",
        "17... Qxg2 18. Bf3 Qg5": "18...Qg5  From this point on I begin an active hunt for the B Queen.  Can I prevent her from escaping to her Q-side and trap her on the K-side?",
        "19. h4 Qh6 20. Nc4": "20. Nc4.  The Knight can leave its e6 post as long as the B Queen is not on the fifth rank; otherwise she escapes her confinement.  But in this position, she is on the sixth rank.  And by moving the Knight, I am able to use the Q's Bishop on c7 to harass the B Queen.  As a reminder, my own Q is completely out of play.  She is not needed!  This is still a very dynamic position.  For example, even though the B Queen is on the sixth rank and seemingly confined, with a properly timed ....e5 she can escape from the area of h6.",
        "20... Nd5": "20....Nd5.  I thought he could try 20...Rfc8 21. Bf4, followed by 22. Ne6 or 22. Ke2 making Rg1 possible.",
        "21. Bg3 Nde7": "21... Nde7  B does not have many choices, as W's dominance on the a8-h1 diagonal is significant.  The choices are to release the Q Rook from behind that pin by the W King's Bishop but give up that isolated Pawn on a7.  That Pawn is often a winner for B in many variations where B is successful in launching a Q-side attack.  But here it is totally stalled. So the only other choice for B is to reinforce the Knight at c6 and maintain the block on that diagonal.  What will give first?",
        "22. Bf4": "24.  Bf4.  Of course!",
        "22... Qg6 23. h5 Qf5": "23....Qf6 is bad due to 24. Ne5 threatening 25. Be4 and 26. Ng4 finally trapping the Queen.  In this line, 24....Nxe5? provokes 25. de, attacking Queen and Bishop.  This becomes a real shooting gallery for W against B.",
        "24. Nd6": "24. Nd6.  Still aiming to trap the Queen!  Notice the sweeping firepower of W's two Bishops and Knight.  And soon the Rook will start to train on the K-side.  In this position, W's Queen seems superfluous, aside from supporting the a8-h1 diagonal pin!  A very odd position, a type I have never played before.",
        "24... Qf6 25. Ne4": "25. Ne4.  I thought long and hard about this move, as it blocks the big diagonal and gives B more breathing room.  But the goal is still the B Queen, if I can snag it.  ",
        "25... Qf5 26. Rg1": "26. Rg1.  Here is the defining moment.  Can B afford the time to free his Queen with Qb5?  It certainly allows the Queen the escape valve she needs, plus maybe one or two spite checks on the W King.  But I wanted to allow that finally, because I had some serious fire-power trained on B's King-side now.  B's King looks very vulnerable, between the Rook, h-Pawn, and all the minor pieces aiming at that corner.",
        "26... g6": "26....g6.  Moving his Queen anywhere along the fifth rank causes instant ruination starting with 27. Nf6+.  Now he must decide how to give up his Queen,starting now.",
        "27. Rg5": "27. Rg5.  The hunt is on!",
        "27... Qh3 28. Bg2 Qh4 29. Bg3 Qxg5": "29.....Qxg5  At last!  Now is the time to try to consolidate and keep the B pieces tied up still.",
        "30. Nxg5 Nf5 31. hxg6": "31. hxg6.  Now that the Rook is gone from the g-file, this move clears out another file and prepares the next big blow.",
        "31... fxg6": "31....fxg6.   The alternative  31....hxg6 protects the e-Pawn, but it does not much matter now. ",
        "32. d5": "32. d5 Some unfathomable results now.  This move forces open either or both of the big diagonals and B has no good reply.  If he had been able to return his Knight to e7 first, he would still have 32. d5 to contend with, and play 32.....Nxd5 33. Bxd5 ed (33....Nb4 does nothing) 34. Qxd5+ and B loses the Bishop plus control of the seventh rank. ",
        "32... Nxg3 33. dxc6 Bc8 34. c7": "Ruinous losses are pending now, with a legitimate threat by W to force entry onto the seventh rank.  Once that occurs,  B's King is toast.  Even with 34....Nf5 35. Bxa8 (this threat was hanging all game, and only now comes into play) followed by Rxa7 and Ra8, or more directly by Qd8!\r\nA very hard-fought game, with solid positional issues to work through for both sides."
    },
    "url": "https://gameknot.com/annotation.pl/team-match?gm=32587",
    "gameName": "Team match",
    "players": "huckjim (1682) vs. renato818 (1659)",
    "opening": "Queen's pawn (A40), Keres defence"
}