{
    "moves": {
        "1. e4 e5 2. Qh5": "King's pawn game, Patzer opening.\n\nI don't like this opening, as black can develop his pieces while chasing the white queen around the board.  It is useful against rank amateurs, who might respond with Pg6, thus losing the rook and pawn.",
        "2... Nc6": "Black wisely protects the pawn instead.  White typically comes back with Bc4, setting up for mate with QxPf7#.  Black can easily defend against this, however.",
        "3. g3 Nf6": "Black begins the queen chase.",
        "4. Qf5": "Qf3 would protect Pe4.",
        "4... d5": "Now the forward pawn falls.",
        "5. Qg5 Nxe4 6. Qe3": "Although down one pawn, trading queens might not be such a bad idea.  Black would still enjoy greater development and material advantage, but would be unable to castle.  Castles are not as important, I am told, when the queens are gone.",
        "6... Bc5": "Black now has five pieces in the field, while white has only two, and must move the queen yet again.  Worse, black seizes Pf2.",
        "7. Qf3 Nxf2": "...and Rh1.",
        "8. Bb5 Nxh1 9. Qxh1 O-O 10. d3 Nd4": "Here black moves into position for the famous king/rook fork with NxPc2+.  White should respond with Qg2, though Ba4 works too.",
        "11. a4": "White will not have an opportunity to move the rook.  Also, this move traps white's bishop, should black play Pc6.",
        "11... Nxc2+ 12. Kd1 Nxa1 13. h4 c6": "Pc6.  Sometimes I hate being right.",
        "14. d4 Bxd4": "Black would probably have been better off taking the bishop, which gives him the pawn too.",
        "15. Bg5 Bg4+ 16. Be2 f6 17. Bxg4 Bxb2": "Even though it opens the h file for white, taking the bishop was probably black's best move, which unleashes the rook.",
        "18. Be6+ Kh8 19. Bc1": "Down 9 points all even trades favor black.",
        "19... Bxc1 20. Kxc1 Nb3+ 21. Kb2 Nd4 22. h5": "Black could play NxB.",
        "22... Qa5 23. Nc3 Qb4+ 24. Ka2 Qb3+ 25. Ka1 Nc2#": ""
    },
    "url": "https://gameknot.com/annotation.pl/team-match?gm=59547",
    "gameName": "Team match",
    "players": "nevhelp (994) vs. dansuno (1079)",
    "opening": "KP (C20), Patzer opening"
}