{
    "moves": {
        "1. e4": "this is my first annonation game.  I'm playing white.  There are a few sacrifices I do in order to increase my postion, and one risky one that i did with my rook that work out in the end. ",
        "1... e5": "etc etc etc",
        "2. Nf3 Nc6 3. Nc3 Bc5 4. Bc4 d6 5. h3 Nf6 6. O-O O-O 7. d3 Be6": "still developing on both sides",
        "8. b3 a6 9. Bb2 b5": "This is where my I start giving him pieces to insure my position.  I could of traded his bishop, but didn't want him to have an open file for his rook at my queen side. so, instead....",
        "10. Nd5": "He has 2 choices, take my knight, or take my bishop.  I'm assuming he will take bishop since the rule is to always take with the least vauable piece first.",
        "10... bxc4": "So far so good, (I think)",
        "11. bxc4": "Don't want to take his knight, then he will develope at tempo with his queen.  don't want that.",
        "11... Nh5": "?!?!?!  could have taken my knight.  but that is worst postion for knight.  Did a quick sacrifse again which will be able to snag his free knight.",
        "12. Nxe5": "Now i have to knights in great strong postion.  Surely he will take one.  I know i would.",
        "12... dxe5 13. Qxh5": "His knight is free for taken, and develope with tempo with attacking his king side.",
        "13... g6 14. Qh6": "now his king side formation is hurting, and his king and pawn on h file can not move.",
        "14... Bxd5 15. cxd5": "quick trade",
        "15... Bd4": "don't want to trade, can use the dark square bishop to threating checkmate ect.",
        "16. c3 Qb8": "?!?!!? another odd move by my opponent.",
        "17. Rab1 Bb6": "i forgot his knight was just sitting there being attacked by my queen with my developing.  free for my taking.  munch munch as people would say.",
        "18. dxc6 Qe8 19. Kh1": "didn't like the way his bishop was attacking my king, and if he wanted to check me.",
        "19... Qxc6": "pawn was a goner anyway.  and served no purpose for my attack.",
        "20. c4": "creating a free zone for my bishop to attack.",
        "20... f6 21. f4": "the attack begins!!!",
        "21... Be3": "trying to slow me down from behind.",
        "22. Bc1 Qc5": "didn't want to trade my dark square bishop, but this will force him to bring his unprotected queen into enemy lines.",
        "23. Bxe3 Qxe3 24. Rf3": "attacks and protects my d file pawn.",
        "24... Qd2": "i guess he is not afraid of the enemey.",
        "25. Rbf1": "protecting each other, and attacking king side.",
        "25... Rad8": "Now this is where i start to think hard.  i could protect that pawn.  but that will divert me away from my attack. but how can i attack.....",
        "26. Rg3 Rxd3": "pawns a goner!!  BUT.....",
        "27. Rxg6+": "this is where my daminours says, \"I see....\"  this is a risky move by my part, since i'm sacrafising a rook to the chess gods for a pawn, but will gain great postion, and open his king completly.  but he does have 2 strong pieces attacking my king.",
        "27... hxg6 28. Qxg6+ Kh8": "forced. and king is trapped in the corner.",
        "29. fxe5 Rd7": "can not take the open pawn since i could checkmate him with my rook on file f. only logical move to make. ",
        "30. Rxf6": "this next move took a long time for me to make sure it was the best choice.  i could of move forward with my pawn and attack his rook.  but he could pin my queen on the g file with a force mate.  i could have taken the rook with the pawn.  but in this situation, i feel a pawn is better then a rook.  plus i can force mate with my pawn queen  (A team)",
        "30... Rxf6": "forced",
        "31. exf6": "If i took with my queen, he would of moved his rook to the g file, and threaten my king with mate.  don't want that.",
        "31... Qd1+ 32. Kh2 Qd6+ 33. Kh1 Qf8": "making his way to help defend his king.",
        "34. e5 Qc5": "?!?!!?  a bad move.  but i felt the game was over at the prior postion.  I had his king pined in the corner, two pawns pass protecting each other, and my king was pretty well protect.  Its now a game of material, but a game of postion.",
        "35. Qe8+ Kh7 36. Qxd7+": "This is were daminours retired.  does not stand a chance now for sure.  He played quite well, and i thank him for this great game.  I hope someone will learn a thing or two from this game.  i know i did! "
    },
    "url": "https://gameknot.com/annotation.pl/team-match?gm=24923",
    "gameName": "Team match",
    "players": "cmgraves (1505) vs. daminours (1517)",
    "opening": "Three knights game (C46)"
}