{
    "moves": {
        "1. e4": "I probably face 1.e4 more than any other opening move in correspondence chess. Either acolytes of \"best by test\" or lots of people prefer open games to closed games.",
        "1... e6": "As for me, I prefer semi-open or closed games :-)",
        "2. Nf3": "By eschewing 2.d4 my opponent is inviting any one of a number of unorthodox moves to avoid any mainline French theory. ",
        "2... d5": "I do not oblige him.",
        "3. exd5 exd5 4. d4": "So d4 is finally played and we have the beginning of a familiar/drawish French exchange setup.",
        "4... Nf6 5. Nc3 Be7 6. Bd3 Bg4": "6...Bg4 is playful more than anything else. There are a number of other moves just as good and more solid, but I'm sensing my opponent is hoping for just that: solid defensive play. Better to play around and see if any holes develop!",
        "7. h3": "I've already goaded him!",
        "7... Bh5 8. Be3 Nbd7": "? This is a mistake that should cost me a pawn. I took my opponent's previous move as cautious and complacent and so I started really horsing around when I'm now in serious danger of blowing the opening. The continuation to lose the pawn would be: 9.g4 Bg6 10.g5 Nh5 11.Nxd5",
        "9. g4": "Here, I thought my opponent saw it and I was close to resigning already. Thankfully, my favorite chess motto is \"Never Resign!\"",
        "9... Bg6 10. Rg1": "Aha! 10.g5 is missed and so now I have a chance to save my loose pawn. I'm not sure what my opponent hopes to gain here as the pawn is already bolstered on the g5 square by the DSB. As we will see, the rook is misplaced, not only in preventing castling, but will need to defend h2 very soon.",
        "10... c6": "protecting the d5 pawn from 11.g5",
        "11. a3": "At this point it's becoming clear that my opponent is not entirely sure what to do with me. I haven't castled yet, nor I have I made any threatening moves. It's like we're both waiting for the other to do something. I, however, have already been planning. His kingside is a shambles, I must provoke to start stirring the pot.",
        "11... Ne4": "I love this move! The white king is still stuck in the center (I can castle at my leisure) and now my knight occupies the valuable real estate at e4. He can't be exchanged for the knight at c3 because of the impending pawn fork, but exchanging him for the LSB is almost worse since then my bishop pair gives me a lot more latitude should the position open up. The best thing for the moment would be to just leave him there, except that should I exchange at c3, the queenside gets airy and the white king has nowhere to go should things get ugly.",
        "12. Bxe4": "My opponent cannot risk being unable to castle and so gambles the longterm threat of my bishop pair (and potential light square weaknesses) against removing the threat immediately and maybe even winning the soon-to-be black e4 pawn in the process.",
        "12... dxe4 13. Nd2": "Making his bid for the e4 pawn clear.",
        "13... Qc7": "Now we see the misplaced rook. This also give me the option to castle queenside if I so choose. My king has lots of options, his king is stuck!",
        "14. Rh1": "Correcting the error as best he can. I would prefer 14.Rg2 myself, although that would be a mistake if he pushed the g-pawn, which he later does. So the best he could do given his situation and inclinations.",
        "14... Nf6": "This is a gamble. I'm hoping to provoke a response, buying time for a longterm defense of the pawn and keeping my opponent's position cramped. Should he ignore my e-pawn and try to develop his king to the queenside a very different game than the one I imagined should arise.",
        "15. g5": "He takes the bait!",
        "15... Nd5": "The pawn can now be taken, but not without serious consequences: 16.Nxe4 Nxe3 17.fxe3 Bxe4 18.Nxe4 Bxg5 ... if now 19.Nxg5 then 19...Qg3+ pickes up the knight, an extra pawn, and leaves the king dislodged on his decimated kingside. Not a won game to be sure, but an uncomfortable one, all things considered.",
        "16. Nxd5": "My opponent would rather not engage in the tactical exchange-fest, but it's all to the good for me.",
        "16... cxd5": "Now that e-pawn is there for a good long while :-)",
        "17. c3": "Still hoping to castle queenside and regain some semblance of stability and development. However, looking at the board now, only two pieces remain on white squares. It will be open season for my LSB.",
        "17... O-O-O": "I took days for me to make this move. The idea was that if my opponent did castle queenside, he wouldn't be able to assault my king without risking his own fortress. Also, the kingside is a shambles for him now, but if I castled there he could quickly turn this to his advantage sending the heavy artillery behind those advanced/advancing pawns...with my bishops in the way.",
        "18. Qb3": "I took this as an indication he would attack the queenside, now that he knew where my king would be.",
        "18... Bf5": "Giving more squares for my LSB to play with, also reminding him if he doesn't want to lose his a-pawn he need to keep his rook right where it is, out of the action.",
        "19. Ke2": "Hard to fathom by the end, but here it makes perfect sense. Connects the rooks, and keeps his king out of the theater he means to attack at any moment.",
        "19... Be6": "This d-pawn needs defending if I'm to develop my rook to b6 like I plan.",
        "20. Rac1": "Castling would have prevented this move, which looks threatening, what with my queen and king on the same file and his d2 knight to bolster the advance.",
        "20... Kb8": "Oops.",
        "21. Rca1": "So suddenly the c-file is no longer viable and the a-file is the next target. I'm guessing my opponent by this point doesn't like closed positions at all.",
        "21... Qc6": "I love this move, too! The white squares are a veritable smörgåsbord of threats and access for not only my LSB, but now my queen.",
        "22. a4": "Justifying the rook to a1.",
        "22... Rdc8": "The c-file will open up at some point, and when it does I need a rook here.",
        "23. a5": "A bad move. The pawn on a4 provided a necessary stop-gap on the a6-f1 diagonal. That stop-gap is now gone.",
        "23... Qa6+": "Ouch, that hurts.",
        "24. Ke1 Ka8": "My opponent took forever when he saw this move. I'm guessing for several reasons. I don't need him picking up an extra check like I just did if he were to play 25.Bf4, and I also need my king off the b8 square in case he gets any ideas to continue advancing the a-pawn while I'm messing around. Also, what does he do now? What moves are available to him?",
        "25. Qa4": "Not what I would have played, but then what are his options?",
        "25... Qd3": "I had thought a while on my opponent's previous move and it occurred to me that e2 is the mating square now. I just need a bishop bolstering my queen and the game is over. So after this move, I need Rhd8, Bd7, Bb5, Qe2 checkmate. This isn't what happens, but this plan will allow something just as cool to come to fruition shortly.",
        "26. Rd1": "Seems reasonable, but totally unnecessary as my queen has an adequate escape square.",
        "26... Rhd8": "The first step of my plan.",
        "27. Qb3 Qa6": "Part of what I had been banking on was a free move I would get with Bd7 threatening the queen. That extra move (\"the most powerful weapon in chess\" - Bronstein) is now gone, so best to retreat and go back to the drawing board. Also, the d-pawn and e-pawns are loose if I play 27...Bd7 now.",
        "28. Ra1": "In this position I'm guessing my opponent would have accepted a draw if I offered one. Or maybe not. He didn't offer me one.",
        "28... f6": "So we will free up some squares for my other bishop! Also, this diverts the action back to the kingside to give my opponent as many headaches as possible.",
        "29. h4": "?? The game is now lost. A simple pawn move and it's over. Here the light square weakness is fully revealed as most of the moves that follow are forced.",
        "29... Bg4": "My opponent must now prevent mate in one.",
        "30. c4": "30.Nc4 also works, at which point I would have played 30...Rxc4, giving me a rook move (anywhere!) that threatens mate-in-one. I also considered 30.f3 as a possible response, but that just loses a pawn as the pawn supports the mate-in-one just as well as the bishop.",
        "30... dxc4": "No more checks until the end, but it's like check in that the threat of mate forces very particular responses. Again, if my opponent takes with the knight I take with my rook and I have that dangerous rook move interposing mate.",
        "31. Qc2": "What else does he have? This way he can at least meet the threat at e2, but the queen can't do everything, but she's the only piece that can do anything. Time to overburden!",
        "31... c3 32. Nxe4": "The blasted e4 pawn is finally dispatched...far too late.",
        "32... cxb2 33. Qxb2": "The goal so far has been to avoid mate and egregious loss of material, but the position was such that you can't have your cake and eat it too. Material has been saved, but now the game is over beyond a doubt.",
        "33... Bb4+": "The final stroke. There are five ways to interpose between the bishop and king, and they all lose by force (in various variations), as does taking the bishop (since the queen gives up protection of e2). Amazingly, material is even in this final position, but my bishop pair, domination of the light squares, and my opponent's stranded king gave me a distinct advantage that directed play and created an unbeatable winning game (after the blunder on 29.h4). One of the more satisfying games I've played against near-equal competition."
    },
    "url": "https://gameknot.com/annotation.pl/team-match?gm=27065",
    "gameName": "Team match",
    "players": "domani (1676) vs. suenteuspo147 (1744)",
    "opening": "French (C00), Wing gambit"
}