{
    "moves": {
        "1. c4": "This is an English Opening by my opponent. It is also known as the \"Bird's Eye\" or \"Reverse Sicilian\" in the archives. \nThe Sicilian is a good defense against e4 and actually it can even work as an offense--it is that good. \n\n",
        "1... c5": "When I get a reverse Sicilian open against me I find it is fine to mirror the open for awhile.  So I did. ",
        "2. Nf3": "This move is a bit different for me and mirroring may not be the best way to go; but I am not convinced, yet, that mirroring is a problem. ",
        "2... Nf6 3. g3": "The fianchetto from White is a sort of Sicilian (reverse) Dragon.  I am familiar with the Dragon as Black against e4.  I am also a bit wary of using a fianchetto because this opens up the King's \"box\" in the event the King should be behind the fianchetto. \nFianchettos are always risky business. \n\n",
        "3... d6": "Now I am reverting to a Sicilian and should be thinking hard about the Queen's Knight for development. ",
        "4. Bg2": "White is completing the fianchetto. ",
        "4... Bd7": "I thought getting the Queen's Bishop ready was better than dealing with her knight.  ",
        "5. O-O": "Now White has committed to residing the King under a \"broken box (fianchetto)\" and that (to me) is a weakness.  In most, if not all of my Sicilian Defense records I rather try to avoid the Dragon.  The Dragon with the fianchetto is classical (so I like it) but many times I find when using it (in the Sicilian Defense) I slowly lose or extend a game beyond reasonable time.  I do not know all the proper moves by heart for the Dragon.  I rarely see it today by any opponent.  There must be a reason! \n",
        "5... Nc6": "This knight HAD to come out! It is part of the Sicilian Defense! (against a Sicilian sort of Offense!). ",
        "6. Nc3 g6": "Well, now! It looks like I am reverting to a Dragon Sicilian! The board can be split in half (I.e. a-d; e-h) and the MIRROR comes back! \n\nRemember, I am defending here! \n\n",
        "7. d4": "From this move by White we are pretty even. \nThe mistake from White comes at move Number 24 when White allows me to take advantage.....",
        "7... cxd4 8. Nxd4 Bg7 9. Bg5 Nxd4 10. Qxd4 h6 11. Bxf6 Bxf6 12. Qd2 Rb8 13. Nd5 Bg7 14. Rad1 b5 15. cxb5 Rxb5 16. b3 O-O 17. Rdc1 Bf5 18. Rfd1 Kh7 19. e4 Bd7 20. Bf1 Rb8 21. Rc2 Rc8 22. Rdc1 Rxc2 23. Rxc2 f5 24. f3": "This was an error by computer analysis.  At the time of playing without the analysis I wanted to simply open the King's Rook downrange. ",
        "24... fxe4 25. fxe4 e6 26. Nf4 Qb6+": "As you can see, things went out of control by this time for white. \n\nTo the end. \n\nAlways remember to protect your king before you make a move. \nJohn ",
        "27. Kg2 Bd4 28. a4 e5 29. Nd5 Qxb3": "I just pushed my Queen into a checkmate position at the cost (if the game went on) of White's material. \n\nBlack resigned. \n\n"
    },
    "url": "https://gameknot.com/annotation.pl/team-match?gm=47383",
    "gameName": "Team match",
    "players": "jokolor (1867) vs. 9422m (1906)",
    "opening": "English (A30), symmetrical, hedgehog system"
}