{
    "moves": {
        "1. d4 Nf6": "Typically against 1.d4 I'll play either 1...d5 then c6 looking to head into a Slav or possible transition into the Noteboom variation, or Nf6 then e6 looking to play either the Nimzo Indian or Benoni depending on White's setup. I noticed that my opponent seemed fond of the London setup, so I decided to reply with Nf6 and then a c5-thrust.",
        "2. Bf4": "This move is certainly playable, but puts little immediate pressure on Black. White is looking to control e4 with the bishop developed out of the pawn triangle with prospects of a kingside attack starting with Ne5.",
        "2... e6": "An immediate e5 is obviously out of the question, but I decided to find a way to immediately challenge White over the center. 2...e6 opens the diagonal to develop the bishop to support c5.",
        "3. e3": "White works on building the strong pawn triangle and opening his LS bishop.",
        "3... c5": "And Black thrusts forward from the flank into the center to challenge the development scheme. I've found that immediately challenging fans of the d-pawn systems (London, stonewall, etc) seems to be quite favourable as you steer them away from familiar waters (while I, myself, am quite fond of fighting through a semi-open c-file). If White takes the pawn, I simply develop the bishop with recapture.",
        "4. c3": "White completes his triangle.",
        "4... Nc6": "And Black delays capturing to develop the Queen's Knight to it's natural square behind the c-pawn.",
        "5. Nd2": "White continues to develop his Queen's pieces - the Nd2 supports the center and scheme well, flexing his muscle over e4/c4.",
        "5... cxd4": "And Black initiates the exchange in accordance with his strategy.",
        "6. exd4": "White could have also captured with the c-pawn but e-pawn takes is probably better for maintaining imbalance and limiting options for Black's LS Bishop's development.",
        "6... a6": "Butting out the elbow to start gaining space on the queenside with b5, limiting the scope of White's LS Bishop and allowing for the queenside fianchetto of Black's.",
        "7. Bd3": "The most aggressive square available to the bishop - if White can displace Nf6 it becomes quite powerful when supported by a Queen on c2, and may support a future knight hop to e4/c4.",
        "7... b5": "Black continues with the intended scheme of development.",
        "8. Ngf3": "White finally gets the King's Knight into the game - signaling a possible intent to castle kingside.",
        "8... Be7": "Black can delay developing the King's Bishop no longer if he wishes to castle with White. Be7 is the only square that makes any sense in this position, supporting the knight and central pawns.",
        "9. O-O O-O 10. h3": "Perhaps White intended this to support a potential g4 push (which could be met with h3), but if he was afraid of Ng4 this move was misguided as the strong Qc2 would have completed development while still eliminating Ng4 through Bxh7.",
        "10... d5": "I debated on this move for some time (also possible was 10...Nd5 11.Bg3 Bb7 12.Qc2 f5 but I wasn't too keen on the idea of playing with a weak d-pawn). d5 I felt was stronger for gaining territory in the center/queenside and controlling the e4/c4 squares, and the option of exchanging bishops on d6.",
        "11. Qe2": "Another option would have developed the Queen to c2 where it seems to be a bit more influential, but White decided to pile up on e5 (that's two pieces and a pawn supporting Ne5).",
        "11... Bb7": "Developing the last minor piece. While it is blocked at the moment by the pawn on d5, it does support it and the diagonal may open in the future.",
        "12. Ne5": "The expected Ne5, exerting strong pressure into Black's territory.",
        "12... Nxe5": "Black decides to eliminate the offending oppressor. Also possible was 12...Nd7 looking to exchange, but the knight is usually well placed to balance offense and defense on f6. The question now, is how will White decide to recapture?",
        "13. dxe5": "White naturally recaptures with the pawn which is probably the most pressing option. Recapturing with the Queen doesn't coordinate as well and may have risked having her kicked back, recapturing with the bishop leaves it susceptible to being kicked with Nd7 which could then possibly reroute to b6 then to c4.",
        "13... Nd7": "As the offending pawn cannot be immediately eliminated, Black must find a new post for the Knight - the c5 square looks good.",
        "14. Nf3": "White redeploys the Knight to f3, continuing to push on the Kingside with the option of centralising on d4. Also possible was Nb3 to guard the c5 square (b4 would have left the c-pawn weak).",
        "14... Nc5": "Pushing forward with a nicely central knight, attacking the bishop and eyeing the e4 square.",
        "15. Bc2": "White naturally retreats to the only decent square for the bishop.",
        "15... Qc7": "Connecting the rooks and developing the Queen to the semi-open file with the intent to develop the rook behind it and then decide where the Queen best resides (batteried with the rook, or perhaps with the bishop). Slight pressure is applied to White's e-pawn tying up a piece. Qc7 was also possible to support pawn pushing on the Queenside.",
        "16. Bg3": "I'm not sure what White was planning with this - perhaps looking to exchange on h4, perhaps looking to start unblocking the f-file, perhaps looking to entice Black's Ne4, but Nd4 and Rfd1 appear to be stronger candidates.",
        "16... Ne4": "Looking to eliminate the bishop-pair, one way or another, or have a nicely advanced knight controlling White's camp. The exchange of Bxe4 results in a strong, nicely advanced e-pawn.",
        "17. Bxe4": "White naturally captures, but giving up the bishop pair and allowing the supported d-pawn to harry his camp.",
        "17... dxe4 18. Nd2": "White's Knight retreats adding another attacker onto Black's e-pawn.",
        "18... Qc6": "Which Black defends with a Queen-Bishop battery locking on to the Kingside. To remove it, White will have to compromise his pawn structure resulting in an isolate King's pawn.",
        "19. f3": "White looks to immediately remove the offender (also possible and stronger was 19.Rae1 e3 20.fxe3 Rd8).",
        "19... exf3 20. Nxf3": "With Knight takes being the strongest option to improve his position. Note that 20.Rxf3 fails to 20...Qb6+ 21.Rf2 Bc5 or 21.Bf2 Bxf3.",
        "20... Rac8": "Black's next immediate plan is simple - Rooks to the c/d-files to exert their command.",
        "21. Rad1 Rfd8 22. Rxd8+": "White decides to exchange - usually I leave the rooks facing off to keep the tension high, unless I'm looking to exchange off for a draw.",
        "22... Rxd8 23. Rd1": "White continues in his quest to trade pieces off the board - as I have the slightly healthier pawn structure and the bishop pair, I'm content to oblige.",
        "23... Rxd1+ 24. Qxd1 h5": "Black begins the push in against White's Kingside - looking to hold back his pawns and displace his pieces to allow the King to enter the fight heading after the e-pawn.",
        "25. Qe2": "White looks to defend the e-pawn further and possibly allow the Queen exchange on e4.",
        "25... g5": "Pushing forward again with a defended g-pawn to press in on White.",
        "26. Ne1": "White retreats the knight, further defending g2. With Black's h4 White will have to cede control over the h2-b8 diagonal with his bishop.",
        "26... h4 27. Bf2 Qe4": "Black offers an exchange of Queens which favours his position (The King is not far away from attacking the e-pawn)",
        "28. Qxe4": "White obliges as Black's Queen on e4 also attacked the e-pawn.",
        "28... Bxe4": "Queens are off the board, and Black's bishop dominates the Knight with no squares where it cannot be attacked.",
        "29. Be3 Kg7": "Black gets the King moving to take care of the isolated pawn, while White's King is unable to penetrate through to aid in time.",
        "30. Kf2": "And White looks to activate his King.",
        "30... Kg6 31. g4": "White is unable to lock in the Kingside pawns due to en passant, but was perhaps looking to exchange off. 31.Nf3 Bxf3 32.Kxf3 Kf5 33.Bd4 and Black's bishop can still reposition through d8->c7 to attack the e-pawn.",
        "31... hxg3 e.p.+ 32. Kxg3 Kf5 33. Bd4 Bd5": "Black's DS bishop reroute is still planned, but Bd5 was played to probe and see what weaknesses might be induced on the Queenside pawns to take advantage of in the future.",
        "34. a3 Be4": "Back to dominating the Knight.",
        "35. Nf3 Bxf3": "With the Knight eliminated, it's only a matter of time before e5 falls.",
        "36. Kxf3 Bd8 37. b3": "White plays the strong 3-pawns abreast against Black's minority.",
        "37... Bc7 38. c4": "And with c4 leading the charge, naturally creates a passed pawn.",
        "38... bxc4 39. bxc4 Bxe5": "Black has finally gained the 1-pawn advantage, with three of his pawns connected and strong in comparisson to White's more fragile, though still somewhat dangerous, position. ",
        "40. Bb6": "White aims to support the movement of his c-pawn and inhibit Black's a-pawn.",
        "40... Bb2": "Not just attacking the a-pawn, but more to the point to allow e5 and the bishop to come back to d4.",
        "41. c5": "White naturally advances the potential Queen, but leaves it susceptible to a pin/skewer.",
        "41... Bd4 42. a4": "White advances the a-pawn aiming for a5 to alleviate the pin with the threat of double-passers.",
        "42... e5 43. a5 e4+ 44. Ke2 Ke6": "Blacks central pawn majority will be fine for the moment - it's more important to take care of the threats on the Queenside for the timebeing.",
        "45. c6": "White opens the pin, but Black's King is close enough to the action on e6 to single-handedly deal with two unsupported passers. Also possible was 45.Bd8 Bxc5 46.Bxg5 f5 47.h4 Be7.",
        "45... Bxb6 46. axb6 Kd6": "Two passed pawns, just two steps away each from Queening, but alas the Black King owns that part of the board.",
        "47. c7": "If 47.b7 Kc7 (to take is a blunder) 48.Ke3 f5 and White King cannot catch pawns on both sides of the board.",
        "47... Kd7": "The correct move to take the steam out of White's threats. If 48.c8 then Kxc8 and if 48.b7 Kxc7 and the other pawn falls as well. ",
        "48. Ke3": "White realises the passers are impotent at the moment and looks to attack Black's pawn mass.",
        "48... f5": "Which is made difficult with f5 as h4/g4/f4/f3/d3 are unavailable to the King.",
        "49. Kd4 a5": "And with a5, there are too many potential promotion threats for the King to deal with.",
        "50. Kc5 e3 51. b7 Kxc7": "And White resigned."
    },
    "url": "https://gameknot.com/annotation.pl/team-match?gm=48125",
    "gameName": "Team match",
    "players": "N.N. (1858) vs. tisamon (1898)",
    "opening": "Queen's pawn game (A45)"
}