{
    "moves": {
        "1. e4 c5 2. Nc3 d6 3. Bb5+ Bd7 4. Qf3": "So white has begun this struggle with the rosslimo variation against blacks sicilian defence, now white decides to bring my fair lady into the fight early! \"Whenever she come out early\", the light squares aroundher king meant become an issue!",
        "4... a6": "Chess is a often a game of capture the squares, both players are intent on developing their pieces, fighting for control of of the center & of course \"keeping the king safe!  With blacks last move he simple says stay in my house if you want but pay the price!",
        "5. Bc4": "KMSTP ... stands for King Safety ... Material ... Space ... Time ... & Pawn Structure, we will call these elements the Fabulous Five! With 5. Bc4 white \"threatens to go to the locker room early... but black is not have that!",
        "5... Nf6 6. Nh3 b5": "Whenever my opponent has developed their queen early, I look at the squares at home that she usually protects. Here c2 is not protected and a solid alternative is Nc6, getting a new plyer off the bench and into the game with an eye on ted4 square.",
        "7. Bd3 g6 8. e5": "8. e5?! is an attempt to win, material based on the discover attack but chess is a game of exchange, something for something else an black will get more out of this exchange than white realizes!",
        "8... dxe5 9. Qxa8 Bc6": "Ok material, the rooks relative value is 5 points & blafck has received a N & p fo r a rook that didn ot get out of the locker room yet!  Notice all of the squares the black pieces & pawns control, black should be very happy with this transaction!",
        "10. Qa7 e6": "Strategy & Tactics make playing chess so challenging ... strategy is the plan we our using where as tactics are the mini operations involved in the game to make our plan work. 10. ...e6! is simple but effective, it protect the c5 square & does not let the white queen get back home!  Remember when you go into some ones house make sure you can get out",
        "11. a3 Bd6": "11. ... Bd6 is a good developing move but Bxg2 would make white pay for having his white squares left unattended. Each oour chessmen have a job, pawns fight for territory & space, protect pieces and protect the king, lastly they advance to threaten to promote.\r\n\r\nBishops control color, where as knights attack squares, rooks generally control files and ranks where as the queen is a deadly piece that combines with other players to finish a job!",
        "12. Ng5 O-O 13. b4 Nfd7": "Black has played the middle game like a seasoned veteran, ... blacks king is safe material is not the central issue in this struggle developement king safety & unprotect stuff, that what it is all about! 13. ...Bxg2 would keep things simple. It wins an important pawn, attacks the Rh1 with tempo make white king position a little uncomfortable & Ng5 would be looking for some help!",
        "14. Be4": "This is a critical point in this game someone is going to take control of the stuggle... I play this game using a 12 Question Checklist let's take a moment and look at the first 6 questions\r\n\r\n1.  Is Whites king safe ... Is blacks king safe?\r\n2.  Is material even?\r\n3.  Are there any checks\r\n4.  Are there any unprotected pieces\r\n5.  Is my opponnt threatening something?\r\n6.  Can I threaten something...threat counter threat, threat greater threat!\r\n\r\nThese 6 question all we do is identify these conditions!\r\n\r\nWhite king safe No  Black king Yes\r\nMaterial ... No whites ahead 1 point\r\nNo Checks\r\nWhite threatens BxBc6... with threatens b4xc5 white threatens to 0-0!\r\nBlack threats QxNg5... Bc5xBe4 c5xb4 ...\r\n\r\nOK lets use the last 6 questions, these are Evaluators so with these we answer to what extent w can do these things!\r\n\r\n7.  Can I increase activity of my pieces?\r\n8.  Can I restrict the activity of my opponents pieces?\r\n9.  If I capture material is it consistent with my plan?\r\n10. If my opponent captures material is it consistent with their plan?\r\n11. What is my opponents strategic plan short & long term?\r\n12. What is my strateic plan short & long term?\r\n\r\nWell ... black has done a great job so far, lets see what the last 6 question tell us to do!\r\n\r\n7. Can I increase the activity of my pieces ... Yes ...Qxg5! my Qg5 will have more work ethic\r\n8. Can I restrict the activity of my opponents pieces ... \r\nlook at Qa7 she cannot get back to help her king!\r\n9.  If I capture material is it consistent with my plan?    Yes \r\n10. If my opponent capture material is it consistent with their plan?  No\r\n11. What is my opponents strategic plan short & long term?  \r\nGet his king safe & free his queen from limbo!!\r\n12. What is my strategic plan short & long term? To prevent my opponent from doing their plan by... getting in their house & messing with thier stuff!!\r\n\r\nSo...lets see how this works out!  14. ...Qxg5!  15. Bxc6 forced ...otherwise material advantage to black. 1\r\n10. If my opponent capture material is it con sistent with their plan",
        "14... Qxg5 15. Bxc6 Nxc6": "I see threat greater threat...",
        "16. Qxd7 Qxg2 17. Rf1": "forced...",
        "17... Rd8": "Aye captain... me thinks our queen not happy",
        "18. Qb7": "forced...",
        "18... Rb8 19. Qd7": "forced ...notice whites other option would involve sacificing his queen for the rook, but the black pawn should win the game easily!",
        "19... Nd4 20. Qxd6 Nf3+ 21. Ke2 Nd4+ 22. Ke1 Nf3+ 23. Ke2 Nd4+": "With a draw, if",
        "24. Qxd4 cxd4 25. Na2 Rc8 26. d3 Rxc2+ 27. Bd2 e4": "And black should win easily!"
    },
    "url": "https://gameknot.com/annotation.pl/team-match?gm=35584",
    "gameName": "Team match",
    "players": "drtwist (1414) vs. sensfan33 (1394)",
    "opening": "Sicilian (B23), closed"
}