{
    "moves": {
        "1. e4": "rooks and knight vs. queen: wins",
        "1... e5 2. Nf3 Nc6 3. Bc4": "The fast attempt threatening a poor check on f7. I tried this once. But that was not funny. ",
        "3... h6": "That basicly covers g6, the spot for the white knight. Although not yet necessary at this point - g6 is still covered by the queen",
        "4. d3": "Now h6 is necessary if I'm counting right.",
        "4... a6": "Avoiding white to pin the queenside knight against the king with his bishop on c4. This ended up in a bad trade too often. Also this is preparing b5, attacking the bishop on c4. ",
        "5. a4": "White avoids b5. Now this would end up in my rook to be captured. \r\n",
        "5... Bc5": "Now I am threatening a poor check, trying to catch up a bit with my castle :) ",
        "6. Be3": "Well, at least I am trying. But I am still behind as white has figured correctly. \r\nActually, that seems to be an interesting trade. I think I will try this one day. ",
        "6... d6": "but not today. I am not ignoring the bishop on c4, by the way. ",
        "7. Bxc5": "Thats an interesting trade, Mr. White. ",
        "7... dxc5": "Nice view for the black queen :)",
        "8. Nc3": "Thats ok, now d5 is clearly in whites hands.\r\nAs is b5 buy the way. But there is no attack yet. ",
        "8... Nf6": "Ketchup. ",
        "9. b3": "looks a bit like the white bishop is pushed into an attack :). Probably white expects 9. ... be6 and does not really want let the queens face each other if I decided to play tit for tat. ",
        "9... Bg4": "But I am going to be mean today. I will take the knight!! Also I am happy that I have catched up with the castling options. ",
        "10. h3": "This will not scare me away, sorry. Otherwise I would have gone to e6 before. Usually. ",
        "10... Bxf3": "This time I will take the knight because it is covering d4. Sorry, was covering... \r\nthe view for my queen improved dramatically",
        "11. Qxf3": "what I had expected. White now has two castling positions. Thats why a bishop/knight trade on the kingside does not hurt too much. Usually. ",
        "11... Qd4": "This really is a beautiful position for the black queen. She is scaring whites remaining knight to death. All ways to safe it, are bad or dangerous. \r\nAll 4 of them are killing two rooks. \r\n12. Nb5 or Ne5 would allow a fork on c7, but what is one lost black rook against two white rooks?",
        "12. Kd2": "There is a fifth option that I did not really expect. This is weakening the white king. I had expected a kingside castle, abandoning the knight and rescuing the rooks. Thats a noble king, I am impressed. ",
        "12... O-O": "Well, this is basicly defining which side I will attack later.... also i dont want to leave my king in the E file. ",
        "13. Nd5": "I don't see an attack.  The black king has left the stage. The white rooks are covering each other now and the white knight can feel pretty comfortable on d5.",
        "13... Nxe4+": "This is dangerous. But I dont think that white will take knight, he would have to use the queen. In return I could consider a queen exchange, because I am in a good position, I also could decide 14. Qe4 Qf2 annoying the white king... ",
        "14. Ke2": "... I am lucky. ",
        "14... Nc3+": "I can proceed.",
        "15. Nxc3 Qxc3 16. Qd5": "This is avoiding the fork 17. ?? Nd4 and also opening the white kings long way home. Moving the king back to baseline, would still sacrifice two rooks.\r\nI feel comfortable.",
        "16... Qxc2+": "Check. \r\n16. Qd5 Nd4  also looks tempting, but I was looking not to deactivate the black queen on c3. \r\nThat was stupid, because of 16. ... Nd4  17. Ke3 (forced!) Nc4  (fork on Ke3 and Ra1) would definitly win a Rook without risking the knight!!! ",
        "17. Kf3": "Step two of the long way back",
        "17... Nd4+ 18. Kg3": "Step 3",
        "18... c6": "Scaring the queen away. I am not sure whether I really planned this already but its also preparing to win the white bishop...",
        "19. Qxe5": "Preparing to win my knight by removing the covering pawn #1",
        "19... b5": "Now the attack on the bishop",
        "20. axb5 cxb5 21. Qxc5": "removing the cover #2 of my knight as expected",
        "21... Ne2+": "solved by a little bit of check",
        "22. Kh2 bxc4": "and  the bishop is won ",
        "23. bxc4": "again, not looking for queen exchange",
        "23... Qxd3": "not the best move...",
        "24. Rhd1 Qg6": "ok,  I do leave...",
        "25. Ra2 Nc3": "Isn't this a beatyful fork? Nf6 would have been a nice idea too, treatening mate on g2.  but white could easily defend it. \r\n",
        "26. Rd6": "White seems to be angry. I cant blame him...",
        "26... Rac8": "want to exchange queens now? This would loose matarial for white in any variant, because the black knight is still aiming at a white rook. \r\nThats why I did not decide 26. .. e4 for another fork. I am holding this back for 27. Rxa6",
        "27. Qe5 Nxa2": "Now I really want to figure out, whether two rooks and a knight are stronger than a queen. ",
        "28. Rxg6 fxg6 29. f3 Rfe8": "baring my teeth",
        "30. Qd5+": "forced, more or less. I did not want to wait for white to consider this option.",
        "30... Kh7": "not a castle, but a hut :)",
        "31. c5": "from now on its hard work for both of us. white will try to advance his paws and attack my tiny castle - sorry, my hut. g6 is the weak point ",
        "31... Nc3": "he felt lost down there",
        "32. Qc4 Nb5": "now he feels quite comfortable",
        "33. c6 Rc7": "first of three moves to win this pawn",
        "34. f4": "going for my hut",
        "34... Rec8": "#2 going for the pawn",
        "35. g4": "cover for the advancing f-pawn",
        "35... Rc7xc6": "#3 taking the pawn and attacking the queen",
        "36. Qd5": "covering f5. ",
        "36... Rc6c2+": "extra time, ignoring the danger on f5",
        "37. Kg3 Rf8": "altough this is not equaling forces on f5, at least this avoids 38. f5 gxf5, 39. Qf5  ",
        "38. h4": "????\r\nI think 38. f5 still would have been the better choice. this move gives me a great chance.",
        "38... Rc3+": "removing the noble king.\r\n\r\n",
        "39. Kh2": "obviously, Qf3 was not an option. ",
        "39... Rxf4": "this removes the worst danger for my hut. now i feel pretty safe",
        "40. Qe5": "attacking the rook",
        "40... Rf2+ 41. Kg1 Rd2": "threatening checkmate",
        "42. Qe1": "avoiding checkmate and attacking the rook",
        "42... Rd4": "taking cover",
        "43. Qa1": "attacking the covering pawn for my knight",
        "43... Rc2": "again threatening checkmate, in case white takes the pawn",
        "44. Kf1": "getting the king involved",
        "44... Nc3": "no need to work any more. lets simplify.",
        "45. Ke1 Rd1+ 46. Qxd1": "forced",
        "46... Nxd1 47. Kxd1 Rc4 48. g5 a5": "this is it, I have no trouble emancipating a queen. white risignes, the rooks win. "
    },
    "url": "https://gameknot.com/annotation.pl/team-match?gm=2177",
    "gameName": "Team match",
    "players": "darare (1449) vs. blindrabbit (1474)",
    "opening": "King's pawn game (C50)"
}