{
    "moves": {
        "1. e4": "This is an attacking game with an interesting pawn sacrifice at move 18. Black made several mistakes after which he gets mated. ",
        "1... d5 2. d4": "By transposition an ordinary Scandinavian has become a Blackmar-Diemer Gambit. Ordinarily this position arises after the moves: 1. d4 d5 2. e4.",
        "2... dxe4 3. Nc3": "This move is better than the immediate 3. f3, because then black can try 3. ... e5 and he gets a better position. ",
        "3... Bf5": "The normal move here is 3. ... Nf6 after 4. f3 exf3 5. Nxf3 white tries to use his lead in development, space advantage and half-open e- and f-lines to create an attack against the black king. ",
        "4. f3": "I still try sacrificing the pawn. ",
        "4... e3": "He doesn't accept the pawn. He probably didn't like to be in an opening of which didn't know much so he tries to lead the game in calmer lanes.",
        "5. Bxe3 Nf6 6. Nge2": "I develop my knight with the intention to go to g3 and kick his bishop.",
        "6... h6": "He anticipates that his will be kicked away and makes a hole at h7. At the same time his pawn controls the g5-square. However, I don't think that this was necesarry: The bishop can go to g6 and black doesn't need to excert extra control over g5 since there isn't a knight on f3. A normal developing move like Nc6 or d6 would have been better. ",
        "7. Ng3": "Following my plan of development. I want to continue with Bc4, Qd2, 0-0-0 and Rhe1.",
        "7... e6": "A bad move. Though he starts the development of his other bishop, he simply lets his bishop get captured and in doing so gets a double pawn. The retreat of his bishop to h7 would have been better. Furthermore, his sixth move seems useless now, as he doesn't use the h7-square.",
        "8. Nxf5 exf5": "Now I have the bishopspair, a better pawn structure ,an extra central pawn and even a bit of a lead in development because he did the move h6.",
        "9. Bc4": "This move is of course a good developing move and there is nothing wrong with it, but there was a better and interesting alternative. Possible was the strange looking 9. Qe2. At first sight this move seems to just lock in the bishop on f1, but this move also threatens different things. There's the discovered check over the e-file with which white can win the h6 pawn. Also the queen threatens 10. Qb5  after which both the pawns at b7 and f5 are attacked. ",
        "9... Be7": "He gets ready to castle but perhaps 10. ... Bd6 was a bit more active.",
        "10. Qd3": "I get my queen out of the way so that I can castle long, while simultaneously attacking the pawn on f5.",
        "10... Qd7": "He needs a move to defend the pawn and gets a little further behind in development.",
        "11. O-O-O": "Again a normal move, following my development plan, but again there was a better possibility. With the move 11. d5 I would have stopped his knight at b8 from developing to c6 and also gained space in the center. ",
        "11... a6": "Another non-developing move. His plan is to play b5 and b4 and start a queenside attack, but it's far to early for that. A better move would have been 11. ... 0-0 getting his king a bit safer. ",
        "12. h3": "This move wasn't very good of me. The idea behind this move was to start a kingside attack with g4. Because there's a pawn on f5 I would surely be able to open lines on the kingside. However this move is slow and not really necesarry. I could've still done d5, hampering the development of his knight (which now also can't go to a6) or I could've played 12. Rhe1, completing my development scheme. ",
        "12... Nc6": "Now his knight is allowed to develop.",
        "13. d5": "This move gains space in the center, but it's a lot less strong than the previous move because now black is able to trade his knight for my bishop. ",
        "13... Ne5": "Attacking both my queen and bishop.",
        "14. Qd4 Nxc4 15. Qxc4": "Now I no longer have the bishopspair so blacks position has improved, I still have an advantage though. ",
        "15... b5": "Now this move is okay, he attacks my queen and perhaps starts a queenside attack, but he still needs to get his king to safety so 15. 0-0 would also have been a good move. ",
        "16. Qd3": "16. Qc6 would've been more active. After 16. ... Qxc6 17. dxc6 0-0 18. Bf4 white's pieces are more active than black's.",
        "16... Kf8": "This is a serious error, and I don't know what my opponent thought here. He should've play the normal move 16. ... 0-0 after which chances are about equal. White attacks the kingside and black the queenside. White has got some extra space because of the pawn on d5, but that pawn could become weak. After 16. ... Kf8 his king still isn't very safe and his rook on h8 can't really participate in the battle. ",
        "17. Rhe1": "Completes the development scheme and makes blacks king feel a bit uneasy.",
        "17... Ne8": "He decides to move his knight to the d6-square where it is active and can't be attacked from the front. However, it is a bit slow and once the knight come to d6, white doesn't have to worry about the defense of the d5-pawn. ",
        "18. d6": "A pawn sacrifice that wasn't really necesarry. The ideas behind this move were the following: I get a square for the knight on d5, once he captures on d6 his piece can be attacked from the front and my rook gets an open file. I thought this move would be good since his king is still not safe. The sacrifice wasn't really necesarry though. I could've just played g4 and once his knight moves to d6, I can do Nc3-e2-d4-c6.",
        "18... Bxd6": "Capturing with the c-pawn wouldn't have been good. The pawn would've become weak and after 19. Nd5 I would threaten to win the exchange with 20. Nb6. The move 18. ... Nxd6 was a possible alternative though. ",
        "19. Nd5": "My knight is on a strong square and his knight can't go back to f6 because after Nxf6 he would have a tripled pawn. Also notice that he still can't chace my knight away with the c-pawn because of the knightfork on b6.",
        "19... Rd8 20. Bd4": "This puts presure on blacks kingside, opens the e-file for my rook(s) and makes way for the knight to come to e3 to attack the f5-pawn. ",
        "20... h5": "He's trying to develop his rook via h6, but it doesn't work. The only effect of this move is that it weakens the pawnstructure further. A better move would've been 20. ... Kg8 with the intention to do Kh7 and get his rook out of the corner. ",
        "21. Ne3": "Attacking the f5 pawn, and stopping the development of the rook to h6. If 21. ... Rh6 then 22. Nxf5 Re6?! 23. Nxd6 Nxd6 24. Qh7 and blacks king is very unsafe. ",
        "21... Rg8": "Still, this move isn't good either. A better move was f4, making sure the f-pawn isn't captured. My position is still better though after Nf5.",
        "22. Nxf5": "It's funny to see that Fritz gives as blacks best move here: 22. ... Rh8. My advantage is overwhelming now. For example 22. ... a5 23. Nxd6 Nxd6 24. Qh7 b4 25. Bc5 and blacks pieces can't do much. ",
        "22... f6": "Not a very good move as it weakens the kingside, but what should black do else?",
        "23. Bc5": "Threatening 24. Bxd6 Nxd6 25. Ne7 Rh8 26. Ng6 , and also his bishop is pinned in two ways now.",
        "23... Qc6": "Getting his queen out of the pin and attacking the bishop, but it doesn't help. White will win material.",
        "24. Bxd6+ Nxd6 25. Nd4": "A good move, but the easiest would've been 25. Ne7, forking the knight and the rook and also threatening Ng6 . After 25. ... Qd7 26. Qd5 black is forced to give his queen to stop Ng6#",
        "25... Qd7": "This loses completely. After the better 25. ... Qc4 26. Ne6  Kf7 27. Qh7 black can still give his queen with 27. ... Qxe6.",
        "26. Ne6+ Kf7 27. Qd5": "Threatening 28. Nf4  Kf8 29. Ng6#",
        "27... Kg6": "Stopping the one mate but allowing another one. ",
        "28. Nf4+ Kh6 29. Qxh5#": "He played passively throughout the whole game, made several errors after which my better positioned pieces secured the win. Always making normal developing move is good, but you should always watch out for better possiblilies like 9. Qe2! or 11. d5!. The pawn sacrifice 18. d6, though not the best move, was an interesting attacking move which occurs more often. "
    },
    "url": "https://gameknot.com/annotation.pl/team-match?gm=16863",
    "gameName": "Team match",
    "players": "peter91 (1793) vs. hermitto (1791)",
    "opening": "Scandinavian (centre counter) defence (B01)"
}