{
    "moves": {
        "1. e4": "Since I was never any good at openings, I started with the most basic move. e4",
        "1... d5": "Things started to complicate for me, never liked to study or train openings and this one was all new to me. (didn't know about Game DB, call me a Noob. :o )",
        "2. d4": "I decided to try and conquer the center of the board.",
        "2... dxe4 3. Nc3": "Developing pieces and aiming to get a pawn back.",
        "3... Nf6 4. Be3": "Dumb move on my part. Just wasted a move, since I will move the bishop again. I would have been better of with Bc4",
        "4... e6 5. Bg5 Bb4 6. Qe2": "Another dumb move, I can't explain today.",
        "6... Qxd4 7. Rd1": "Only logical move at this point.",
        "7... Qe5 8. Bxf6": "At this point I was hoping that he played Qxf6 so I would do Qxe4, liberating my Bishop and getting a pawn back.",
        "8... gxf6 9. g3 b6 10. f4": "Another strange move, but I wasn't thinking proper.",
        "10... Bxc3+ 11. bxc3 Qxc3+ 12. Kf2": "At this point, running away was best, since I couldn't afford to exchange more pieces, given my pawn disadvantage.",
        "12... f5": "I  believe he would be better off with Rg8. It would apply extra pressure on my already difficult position.",
        "13. Nh3 Ba6 14. Qd2": "I had no choice at this point, I had to deliver my queen to the exchange.",
        "14... Qf3+ 15. Kg1 O-O": "Protecting from Qd8  ",
        "16. Ng5": "Time to budge that Black Queen away.",
        "16... Qa3 17. Bxa6": "Clearing some of the pressure on my king.",
        "17... Nxa6 18. c3": "I stop him from doing Nb4 while protecting my a2 pawn",
        "18... Nc5 19. Kg2": "Freeing my h1 rook.",
        "19... Nd3 20. Rhf1": "No idea why I played this, but I was running low on ideas.",
        "20... Rad8 21. Qe2": "Taking my queen out of harms way.",
        "21... Kg7 22. Qh5": "Finally a chance to put a bit of pressure of my own.",
        "22... Qxc3 23. Nxe4": "This seems like a  dumb move, but Qxh7 would only help him develop his rook on the h column. I sacrifice my Knigh, but...",
        "23... fxe4 24. f5": "Now I'm getting some where. I think...",
        "24... Nf4+": "He decides to give me my Knight back, can't imagine why.",
        "25. gxf4": "Only move possible.",
        "25... Qc2+ 26. Kh1 Rxd1 27. Rxd1": "Some trades.",
        "27... exf5 28. Qg5+": "Mate in three.",
        "28... Kh8 29. Qf6+ Kg8 30. Rg1+ Qg2+ 31. Rxg2#": "Check Mate. Couldn't believe I had won."
    },
    "url": "https://gameknot.com/annotation.pl/team-match?gm=5855",
    "gameName": "Team match",
    "players": "kaleidoscopio (1413) vs. doclovejones (1421)",
    "opening": "Scandinavian (centre counter) defence (B01)"
}