{
    "moves": {
        "1. e4": "A Win I'm Proud of",
        "1... e5 2. Nf3 Nf6 3. Nxe5 d6 4. Nf3 Nxe4 5. d4 d5 6. Bd3 Bd6": "6. ... Nc6 is usual here. But I wanted to develop my kingside faster. I heard this called as the Marshall Gambit. Perhaps if White aims for the pawn on d5.",
        "7. c4 Nf6 8. c5": "White chooses to ease the pressure. But the bishop is just as well placed on e7, maybe even better.",
        "8... Be7 9. Nc3 O-O 10. h3": "Preventing the pin. ",
        "10... Re8 11. O-O Nc6 12. Bg5 h6 13. Bh4 Be6": "Black has centralized his pieces.",
        "14. a3 a6 15. Bc2": "Making room for the queen.",
        "15... b6": "To dismantle White's pawn center.",
        "16. cxb6 cxb6 17. Bxf6": "To prepare the attack on the b1-h7 diagonal.",
        "17... Bxf6 18. Qd3 g6": "Which is adequately met.",
        "19. Rad1 b5 20. Ne2 Rc8": "Open files for rooks.",
        "21. Ng3": "(What is the specific purpose?) But he has abandoned the d-pawn.",
        "21... Nxd4": "Wins a pawn because the queen is protecting too many pieces.",
        "22. Nxd4 Bxd4 23. Qxd4 Rxc2": "Black is a pawn ahead. Although his pawn plus consists of an isolated pawn in the center which could be difficult to protect.",
        "24. Rfe1 Rc8": "After winning material, it's a good idea to collect your forces.",
        "25. Qf4 Qg5": "Tempting White with simplification where White has the better pawn formation for the pawn minus. ",
        "26. Qxg5": "He bites. ",
        "26... hxg5 27. Re2 Kf8 28. Red2 Rc5 29. Nf1": "The knight had nowhere to go on the kingside. ",
        "29... Rec8": "Maybe 29. ... Rd8 immediately.",
        "30. Ne3 Rd8 31. Nc2": "Headed for the juicy d4.",
        "31... Kg7 32. Nd4 Rdc8": "Again grabbing a hold on the open file.",
        "33. Kf1 Rc5c1": "Exchanges are encouraged for the one who has an advantage in material. ",
        "34. f3 Kf6 35. Ke2 Rxd1 36. Rxd1 Ke5": "The King is in the very center.",
        "37. b3": "This weakens the queen-side pawns. I think this move decided the game in my favor.",
        "37... Kf4": "Just poking.",
        "38. Kf2 Ke5 39. Rd3 Bf5": "Black is just too willing to exchange the bishop for the stronger knight.",
        "40. Rd2 Rc1": "Now, the rook will attack the a-pawn from behind.",
        "41. b4 Ra1 42. Nxf5 gxf5 43. Rd3 d4": "Makes way for the King to go to the queen-side.",
        "44. Ke2 Kd5 45. g4 Kc4 46. Rd1": "Black was threatening 46. ... Ra2+.",
        "46... Ra2+ 47. Rd2 Rxa3": "Two pawns up. A third hanging and the center dominated by Black. White capitulates. For me this was an enjoyable win because the losing moves were not that obvious."
    },
    "url": "https://gameknot.com/annotation.pl/team-match?gm=50961",
    "gameName": "Team match",
    "players": "brucelee6400 (1736) vs. gamlet (1675)",
    "opening": "Petrov (C42), classical attack, Marshall variation"
}