{
    "moves": {
        "1. e4 c5 2. Nf3 d6 3. d4 cxd4 4. Nxd4 Nf6 5. Nc3 a6": "The beginning of the Najdorf Sicilian",
        "6. Be2 e6": "In the Be2 the more aggressive move for black is e5.",
        "7. Bg5": "Not the best choice I really should have castled kingside.",
        "7... Be7 8. Be3": "I've lost a tempo and gained nothing. ",
        "8... O-O 9. Qd2 b5 10. O-O-O": "Castling queenside was probably wrong for the position.  I should have castled kingside and exploited blacks advanced pawns. ",
        "10... Bb7 11. f3 Nbd7 12. h4": "Preparing to attack the kingside with pawns. ",
        "12... Nc5": "Black is putting pressure on e4 with his knights. ",
        "13. h5 b4": "Starting his queenside attack.",
        "14. Nb1": "The only move not the best place for the knight.",
        "14... a5 15. Nb5": "A pointless move. Better was probably Nb3.",
        "15... Nfxe4": "Black sacrifices his knight for two pawns.",
        "16. fxe4 Nxe4": "Black now has a strong central knight.",
        "17. Qe1": "This move prevents blacks knight forking the bishop and rook by moving to g3.",
        "17... d5": "Protecting the strong central knight but closing off the light squared bishop. However white seems to have no piece that matches the knight.",
        "18. Bd3": "Threatening to take the knight. ",
        "18... Nc5": "The knight retreats since Bxe4 wins the knight for nothing. Bxe4 dxe4 Rxd8 Ra8(Rf8)xd8 black would then lose the queen for a rook.",
        "19. g4": "Continuing to attack on the kingside with pawns. Perhaps Qg3 would be a better move. Maybe even Qd2 in order to move the dark squared bishop to h6 to aid in the attack.",
        "19... Rc8": "Taking control of the c-file. Nxd3 Rxd3 would give black the bishop pair. He probably should have played Nxd3 on move 19.",
        "20. Bxc5": "I give him the bishop pair which was a bad idea in an open game. I may be a pawn ahead but material isn't everything. Maybe Nd4 would have been better the knight is doing nothing in its current position.",
        "20... Rxc5 21. Nd4 Bg5+ 22. Nd2 a4 23. Kb1": "Unpinning the knight from the king.",
        "23... h6": "Strengthening the bishops outpost. But the bishop would be better placed elsewhere.",
        "24. Nd2f3": "The knight no longer on the edge of the board finally has something to attack. My pieces are now a bit more coordinated towards a kingside attack.",
        "24... b3 25. cxb3": "I chose this pawn since I didn't want to give black the a-file to achieve checkmate at some point. ",
        "25... axb3 26. Bg6": "Attempting to trick black into capturing the bishop. I really should have played Nxd3. I thought I could get away with letting black take the a-pawn. \n\nIf black captured the bishop 26. Bg6 fxg6 27.Nxe6 Qf6 28. Nfxg5 hxg5 29.Nxf8 Qxf8 30. hxg6. I end up 2 pawns ahead.\nI also get the h-file for my queen and rooks. But this was just wishful thinking. ",
        "26... bxa2+ 27. Ka1 Bc8 28. Bd3": "Instead of the bishop retreat I should have played Nxg5. If black then played hxg5 then I would play h6.",
        "28... Bf6 29. Qf2": "Perhaps g5 now since Qf2 is perhaps not necessary yet. ",
        "29... Qc7 30. g5": "Advancing the pawn to open blacks kingside.",
        "30... hxg5 31. h6 g4 32. Nh2": "Big blunder now black forks me and I lose my knight. The better move was hxg7 threatening checkmate.\n\n32.hxg7 gxf3 33.Rh7+ Kxg7 34.Rh7+ Kg8 35.Qg1+ followed by mate two moves later.\n\nBlack is more likely to reply 32...Bxg7 however. After Qh4 threatening mate again and black replying Re8 to give his king space to retreat white can find a place for the knight.",
        "32... g3 33. Qg1 gxh2 34. Rxh2 g5 35. Nf3 d4 36. Rg2": "White down in material continues the pointless attack.",
        "36... Qf4": "Black is on the counter attack and will soon win the game.",
        "37. Nd2 Bb7 38. Rg4": "Nb3 attacking the rook might have been better.",
        "38... Qe3": "Queen swap just what black wants he is ahead in material after all and has the initiative.",
        "39. Qxe3 dxe3 40. Ne4": "The fork only works to blacks advantage. Nb3 was probably better. Black may have the fork Bf3 but this doesn't increase his material lead.",
        "40... Bxe4 41. Rxe4 Rb8": "White resigns checkmate is not far away."
    },
    "url": "https://gameknot.com/annotation.pl/team-match?gm=27652",
    "gameName": "Team match",
    "players": "kendo-ka (1473) vs. waterslag (1579)",
    "opening": "Sicilian (B92), Najdorf, Opovcensky variation"
}