{
    "moves": {
        "1. d4": "He starts off with this opening.",
        "1... d5": "So, I respond with my usual.  I'm prepared for him to answer with the QG or what he plays next which is the cornerstone of the Colle's System.  This, however, will not be the colle's system, though, but I am ready.",
        "2. Nf3 Nf6": "Despite it not being that, this is the most common response to the last move.   Plus, black is developing here.",
        "3. Nc3": "?! Sure, it develops.  But, he is blocking his own c pawn which is generally not a good idea in 1.d4 openings.  This is why QG is a commonly played opening in QPO as the c pawn advances right then and there.  But, thinking that my advantage is bigger then it really is with this inaccurate move, this is where I start losing patience, believe it or not.  In fact, I thought that it was, to some extent, overwhelming, but that is not so. ",
        "3... Bg4": "Therefore, I just treat it like the Spanish Opening, despite it starting off with 1.e4.  Better might have been 3...e3, or a fianchetto with 3...g6 to develop my Bf8 and castle.  But, due to lack of patience, nothing else came into consideration which is, as usual, problematic.",
        "4. Ne5": "At first, I didn't see the point.  I thought that Ken might be planning to fianchetto his Bf1, and then kick my Bg4.  For that would allow white to play Bh3, at some point, which would threaten a nasty fork, very similar to what happened in a different team game.  And, as you'd imagine, I overlooked a similar threat due to lack of patience.  But, once it got overlooked, and the opponent was going to my Rook.  And, I resigned very shortly after that, which was under 10 moves.  Thinking that he might try to do something, I have plans to stop it, and thus, play what would've been best in that game.  Therefore, it was 4...e6.",
        "4... e6 5. Bg5": "We're using to see this, and I was wondering what to do.  But, this is where that impatience really shows.  The N is pinned in a nasty way.  Now, I was thinking the same way that I did with Kenneth_fiore_3.  But, this time, I play it which is blunderous.  ",
        "5... Be7": "?? That is with this move.  The worst part is that nothing else came into consideration.  Like what I discussed with Kenneth_fiore_3 this was played because Jack told me that when your opponent pins like this, the most common way to break it is with the Bishop.  So, I was only going by what I was told.  And, being just about as impatient as you'd get, that's all that I was gonna go by.  But, it's terrible here, as this is the move that loses a piece.  At first, I just anticipated the exchange on f6, but overlook 7.Nxg4.  Had I been more patient, however, I wouldn't have played it because that piece needed to stay protected.  Instead, I would've played 5...0-0  So, needless to say that the dream hadn't happened yet.  But, had it occurred here, I definitely would've seen the danger.  As noted, that dream included a very important training game with God which would've been applied here.  Luckily, it does occur later on which is how I got the draw.  But, to be honest, with best play from black, white should still win especially because white exchanges first which boils down to liquidation, as well.",
        "6. Bxf6 Bxf6 7. Nxg4 Be7": "Threatening to liquidate further.  This still happened before the dream.  So, had I not been a piece down, I would've exchanged.  But, I remember what I was taught from elyhim which applies in almost all position, and I think this one is included.  That is, exchange pawns, not pieces, when behind.  Unlike with Kenneth_fiore_3 it works here, and I'm able to avoid liquidation for a long while, up to my surprise.  ",
        "8. Ne3": "I'm not sure why Ken played this, but I believe that he wants a better placement for his N.",
        "8... Bb4": "Doing what I can for counterplay, I decide to pin his other N.",
        "9. a4": "I presume that Ken is trying to get a semi open file which is why this would be common.  But, as white, I'd, instead, fight the pin with 9.a3  For, had he played that, almost all of my hope for counterplay would be gone by now since I have to drive it back.  And, then, he can do something with his Nc3.  But, by playing this, the pin is going to remain.  Plus, I'll respond by castling which is something that I enjoy doing, anyhow.",
        "9... O-O 10. Qd3": "Ken mobilizes his Queen and plans to do something dangerous with it, as we're about to see.",
        "10... Qf6": "Likewise, I intend to do something with my Queen.  But, it's not until the end that I get comfortable enough to feel that my goal is my achieved.  As I'm still thinking about what can be done to save the game.  And, I'm thinking that a more experienced player would've busted my chops, already.  By then, I, more then likely would've resigned here, if he's won another piece at this phase.  We don't approach that yet.",
        "11. Ng4": "Although, I'm still doing what I can for counterplay, this move gives me some hope.  I understand why he played this.  Maybe the idea is bringing the N down or doing something dangerous.  But, what he didn't expect is what I play next which is reattacking and driving Ken back.",
        "11... Qg5 12. Ne5 Qe7": "As this was plan since my Queen is now on the same diagonal as the Bb4 which can make a dangerous combo.  Although there's definitely some hope, I'm absolutely not super confident.  And, this also means that I'm not counting my chickens before they hatch.  For, I know that there's still a long way to go, and that he has winning chances.  And, that I, more then likely, would've resigned by now against a stronger player.  What I want to know is the moves they would've played, instead, for the win.",
        "13. Qb5": "This shows that good judgement is needed.  The dream is around the corner, but I see the danger here, anyhow.  Now, were I not a piece down and had the N out, I would've given up my b pawn, and in response would've with ...a6 in an attempt to trap his Queen, as per what I learned with GM Susan Polgar in the London System.  But, I'm not going to take any risks because of the situation I'm in.  So, I defend, instead, with my next move.",
        "13... b6 14. Kd1": "I don't know why Ken played this, but what I know is that this prevents him from castling.  And, with it, this is the first time where I'm pretty confident about drawing the game, despite being a piece down.  As I feel that black has better mobility, at this point.  But, I'm not gonna take too many risks.  So, I hit his Queen.  You will note that the important dream I had takes place right after this move.",
        "14... c6": "? I was patient here, but the idea was forcing the Queen back for tempo gain.  So, better would've been 14...a6  By playing this, Ken gets another pawn, and with it, my hopes of pulling a swindle and getting a swindle are almost over.  All I can do now is rely on something similar to Hope Chess.  And, that attitude is the one thing that will save the game, believe it or not.   ",
        "15. Nxc6 Nxc6 16. Qxc6 Qf6": "This is where it starts, as I threaten his d and f pawns.  I'm just hoping that white will overlook the threat which is what happen.  But, unlike what we've seen before, that hope is based on patience since, as noted, that dream has happened.",
        "17. Qb5": "And, this is where hoping works.  I anticipated this move since Ken is threatening my Bb4.  So, this is where I go on the attack by taking his center pawn.  And, I keep in mind that I might even have the chance to win this game should he get out of check with his K since there are variations that would hurt white, in the aftermath.",
        "17... Qxd4+ 18. Qd3": "But, he gets out this way.  So, I decide to take his f pawn, instead.  Therefore, even if I can't win, which isn't the idea, I'm now all but certain that this is a draw.  But, being patient is what allowed this moment to occur.",
        "18... Qxf2 19. Qb5": "Not surprisingly, he attacks my B again.",
        "19... Qd4+": "So, I throw back in the check.",
        "20. Qd3": "As anticipated, but the next several moves are based on the variation that I studied.  Despite the fact that I can't win, I don't see how Ken can win either.  He is ahead a piece for a pawn.  But, white is also faced with two isolated pawns which are also considered bad pawns, just like with my game against Joann when she was ahead by a pawn.  Similarly, those pawns will also be blocked by my Rook.  That's why Joann offered me a draw which I accepted.  And, I kept that game in mind.",
        "20... Qxd3+ 21. exd3 Bxc3 22. bxc3 Rac8": "Which is why I offered Ken a draw.  And, I guess he felt the same way for the reason that I mentioned that I mentioned which is why he accepted the offer.  But, it's because I didn't rush into it which is how I got the swindle.  Therefore, just like the last game, the moral is the same.  So, patience is very much of a virtue.  If I had more of this in the beginning and didn't rush to break that pin, I wouldn't have blundered a piece so early.  And, to remember this important lesson, I think about the tortoise and the hair which is a famous story.  The moral to that story is exactly the same as the first game against this opponent.  That's why I remember that here since as they say, \"slow and steady wins the race\" because it's another example of why it's important to be patient."
    },
    "url": "https://gameknot.com/annotation.pl/team-match?gm=62412",
    "gameName": "Team match",
    "players": "1pawnsoon2queen (1342) vs. jkarp (1310)",
    "opening": "Queen's pawn game (D02)"
}