{
    "moves": {
        "1. d4 d5 2. c4 e6 3. Nc3 g6 4. Nf3 Bg7 5. Bf4 a6 6. e3 c5 7. cxd5 exd5 8. Ne5 c4": "Maybe it would be better to do f6 first.",
        "9. Qa4+ Bd7": "Probably Ke7 would be better.",
        "10. Nxd7 b5": "very stupid..",
        "11. Nxb5": "problem..",
        "11... axb5 12. Qxa8 Nxd7 13. Qxd5": "White could trade queens now and whould have a comfortable situation, but is still eager.",
        "13... Qa5+": "Now white has a rook and two pawns for one knight. Situation for Black is ridiculous, but what the hell..",
        "14. Kd1 Ngf6 15. Qf3 Qa4+ 16. Kc1 O-O": "Well, I can say at least that I castled while White couldn't... :-P",
        "17. e4 Qb4": "To prevent 18.Qa3 and forced trade of queens.",
        "18. Bd2 Qe7 19. e5": "I didn't see that...",
        "19... Rd8": "The only way to save this stupid horse is by Ne8, which prevents my only rook. This would lead to a very passive situation for black. Therefore I choose to give away another piece and try to attack the white king while the white rooks are still undeveloped.",
        "20. Ba5 Nxe5": "White chooses to attack my rook rather than to take my bishop. I play Nxe5 and hope that this provokes White to hit my rook with his bishop, which gives away his important defence at e2, because that's the only chance I have left...",
        "21. Bxd8": "... and it indeed provokes him!",
        "21... Bh6+": "Here comes the attack.",
        "22. Kc2": "I think white should play Kd1 instead of Kc2. The white king is completely helpless now.",
        "22... Qb4 23. Qe2 Nd3": "White can't prevent the attack anymore.",
        "24. b3": "Rb1 instead of b3 also doesn't help, because of 24...Qa4 ",
        "24... Ne4": "Not 24...Nd5, because of 25.Qe8  Kg7 26.Bxd3 which will cause problems. White can move his king to b1 and then later escape to b2 and a3 and if Black doesn't check the white king, White can play Qe5  and win the knight at d5.\r\n\r\n\r\n\r\nAfter 24...Ne4, White resigns."
    },
    "url": "https://gameknot.com/annotation.pl/team-match?gm=7350",
    "gameName": "Team match",
    "players": "touhoankka (1712) vs. blokky (1663)",
    "opening": "QGD (D31), 3.Nc3"
}