{
    "moves": {
        "1. e4 e5 2. Bc4 Bc5 3. Nf3 Nc6 4. c3 Nf6 5. d3 d6 6. O-O O-O": "The opening is standard fare.",
        "7. b4 Bb6 8. a4 a5 9. b5 Ne7 10. Bg5 Ne8": "To avoid a severe weaking of my Pawns if White had played BxKN. If he plays BxQN now, my Q will recapture and my Pawn structure in front of my castled K wil remain intact.",
        "11. d4 exd4 12. cxd4 Kh8": "To unpin my KBP in preparation for driving Black's QB.",
        "13. Bd3 f6 14. Bf4 Ng6 15. Be3 Bd7": "Clearing the square for my Rook.",
        "16. Bc4 Rc8 17. e5 fxe5": "Gaining a small material advantage. Now my job is to swap off some of the pieces. The more wood leaves the board the bigger the advantage of one Pawn looms.",
        "18. Ng5 Qf6 19. Qh5 h6": "Forcing the horseman to retreat.",
        "20. Ne4 Qf5": "I was expecting the White Q to zip back along the diagonal behind its lines. But...",
        "21. Ng3 Qxh5": "To my surprise, White allows the exchange of Q's. One very major piece for each side leaves the board, simplifying the position. ",
        "22. Nxh5 Nf6": "Looking to swap down more...",
        "23. Nxf6 Rxf6": "...and White does my job for me. The \"small\" material advantage is getting bigger by the move.",
        "24. Rd1 exd4": "If White doesn't want to lose another Pawn, more wood must now come off.",
        "25. Bxd4 Bxd4": "A pair of minors vanishes.",
        "26. Rxd4 b6": "I lock the Q-side, where I have a protected passed Pawn.",
        "27. Nd2 Rcf8": "With four pieces left for each side, there's still the possibility of complications. I add extra defenses to the King's wing.",
        "28. f3 Ne5": "Looking to swap down further...",
        "29. Rf1 Nxc4": "...and I do, winning a minor exchange to boot.",
        "30. Rxc4 Rc8": "Now I have to guard my base Pawn on the Q-side.",
        "31. Ne4 Rff8": "I retreat and reconnect my Rooks.",
        "32. Rd4 Bf5": "Activating the B.",
        "33. Ng3 Kh7": "Securing the K where the white Rooks can't reach it.",
        "34. h3 Bd7": "Even in endgames you see the struggle for a tempo at times. I simply mark time here.",
        "35. Ne4 Bf5": "Looking to swap down further.",
        "36. g4 Bxe4": "Hoping for 37 PxB, which would also let me swap a pair of Rooks...",
        "37. Rxe4 c5": "...but this time White doesn't play into my hands. The ending with 2 Rooks and Pawns on both sides is called by the great Capablanca the most difficult of all endings.",
        "38. bxc6 e.p. Rxc6": "Freeing my Rook.",
        "39. f4 d5": "Naturally I wish to push my passed Pawn.",
        "40. Rd4 Rc4": "I see a chance to simplify down while maintaining my material advantage. The passed Pawn is bait...",
        "41. Rxd5 Rcxf4": "...and White swallows it.",
        "42. Rf5 Rxf1+": "After White's 42nd move I can get rid of BOTH remaining pairs of Rooks. I was only trying to swap off one pair...",
        "43. Rxf1 Rxf1+": "...but I gratefully take the opportunity to dump both pairs.",
        "44. Kxf1 Kg6": "Now all the pieces are gone and my extra Pawn is an enormous advantage. White's K has to defend both flanks.",
        "45. Kf2 Kf6": "I feint towards the Q-side, where I have a material edge...",
        "46. Ke3 Kg5": "...and now quickly switch to the K-side, where I threaten to massacre White's pawns.",
        "47. Ke4 Kh4": "White hopes to neutralize my K-side Pawns as well...",
        "48. Kf5 g5": "...but now I'm one vital tempo ahead.",
        "49. Kg6 Kxh3": "If White plays 50 KxP, 50... KxP and my K will escort the KNP to the promotion square.",
        "50. Kh5 Kg3": "White now must move his K away from his KNP...",
        "51. Kxh6 Kxg4": "...which I promptly capture. When trying to promote a Pawn during a K and P end game, it is always best to have your K *in front* of the P -- exactly where I have mine.",
        "52. Kg6 Kf4": "Clearing the path.",
        "53. Kh5 g4": "White resigns.  The finish would be 54 K-R4 K-B6 55 K-R5 P-N6 and the Pawn cannot be stopped from Queening.",
        "54. Kh4": ""
    },
    "url": "https://gameknot.com/annotation.pl/team-match?gm=40906",
    "gameName": "Team match",
    "players": "slowdog (1383) vs. last_archimedean (1371)",
    "opening": "Bishop's opening (C23), Classical variation"
}