{
    "moves": {
        "1. e4 e5 2. Nf3 Nc6 3. Nc3 Nf6": "Igra četiri skakača. Volim ovu poziciju jer znam šta sledi. Beogradski gambit je moja opsesija još iz mladih dana i nikad ne propuštam da ga odigram.\nTo je varijanta koju sam najviše studirao i u njoj za mene nema nepoznanica sve do završnice.\nAko protivnik zagrize mamac, biće samleven.\nTaj gambit ima svojih slabosti, ali protivnik mora da odigra do savršenstva precizno da bi ih iskoristio. To se dešava izuzetno retko jer je malo onih koji poznaju ovu varijantu. ",
        "4. d4 exd4": "Ovo je još uvek igra četiri skakača. Nastavak za belog u toj varijanti je :\nNxe4, ali ja to nikada ne igram.",
        "5. Nd5": "BEOGRADSKI GAMBIT !!\nNajbolji nastavak za crnog je \n5...Be7 6. Bc4 d6 7. Nxd4 O-O 8. O-O\nOvakav razvoj belom ne daje prednost u otvaranju kao neka druge varijante i zbog toga Beogradski gambit nije popularno otvaranje, ali ja ga volim zbog onoga što sledi, ako crni ne odigra tako.\nOvo otvaranje  protivniku koji ga ne poznaje deluje prilično laički.\nKrši pravilo otvaranja: -Ne igrati istom figurom dva puta u otvaranju, ostavlja nebranjenog pešaka koji uopšte ne deluje otrovno i ... teško je odoleti.\n",
        "5... Nxe4": "Upravo tako ! \nCrni je zagrizao prvi mamac i pojeo tog pešaka koji je otrovan samo ako crni nasedne i drugi put na nešto još privlačnije.",
        "6. Qe2": "Ovo je crni predvideo i zna kako da se brani. Verovatno se i pomalo smeška.\nTo uopšte ne deluje opasno, a beli se još više zapetljava. Sada već ima dva pešaka manje i zatvorenog belog lovca.",
        "6... f5": "Ono čega crni, u ovom trenutku nije svestan je da je ovo, zapravo jedini mogući potez i da on polako upada u mašinu koja će ga samleti, ako bude neoprezan.",
        "7. Ng5 d3": "Ovo je zaista najbolji potez crnog. Svaki drugi potez prepušta belom inicijativu.\nOvaj potez će odigrati svaki majstor i može se naći u svim bazama podataka. \nCrni sada igra potpuno školski i potpuno je ubeđen da je na pravom putu.\nUstvari...on to i jeste. Njegova pozicija je bolja, inicijativa je njegova, ali ...\nima tu još nekih izazova koji ga čekaju. ",
        "8. cxd3": "Mislim da je crni ovde očekivao -Qxd3 jer ovo ne izgleda baš dobro za belog.",
        "8... Nd4": "Naravno ! \nBela dama više ne može da vezuje crnog konja. Mora da se sklanja sa e linije i gubi konja g5.\nPozicija belog zaista izgleda očajno.\nQe3 gubi damu.  Qd1 gubi konja. Sve drugo osim Qd1 gubi topa. \n9. Qh5+ g6 bi sve to odložilo samo za jedan potez. \nCrni ima mnogo razloga da se oseća superiorno u ovoj poziciji i da se opusti.\nIz njegovog ugla, ova partija je praktično dobijena.",
        "9. Qh5+ g6": "Beli je ipak odigrao Qh5+.\n Iz ugla gledanja crnog to je samo očajnički potez i odugovlačenje.\nIz ugla belog to je rutinska igra i uvlačenje crnog u zamku iz koje nema vađenja.",
        "10. Qh4": "Zanimljiva pozicija i crni mora malo da se zamisli. \nMislio je da je odvezao napadnutog crnog konja, ali on je i dalje vezan jer iza njega se nalazi nebranjena figura.\n Nc2+ i uzimanje topa izgleda privlačno, ali ako se malo bolje analizira, beli jednog konja uzima, a drugi ostaje zarobljen i to nije dobra trampa. Osim toga beli bi potpuno pruzeo inicijativu i sa pet aktivnih figura lako savladao crnog. \nSve je lepo odigrao, ali topa još ne sme da uzme i to je pomalo iritirajuće. I to je upravo ono što će crnog kasnije uvesti u zamku. Ta fiksacija poteza Nc2+ koja dugo traje i sve vreme mami i opija crnog. \nTo je u ovoj varijanti najveći adut belog i to je upravo ono zbog čega sam zavoleo Beogradski gambit.\n ",
        "10... c6": "Crni i dalje pokazuje zavidno poznavanje teorije ili je ovu poziciju veoma detaljno i dugo analizirao.\nOvo je zaista najbolji potez crnog.",
        "11. dxe4 cxd5 12. exd5": "Kocka je bačena !\nOvo je trenutak partije u kojem sam uvek uzbuđen.\n    Najbolji potez za crnog je Bg7 !! Ako odigra to onda zadržava prednost i materijalnu i pozicionu i beli će morati veoma preciznom igrom da se bori za remi.\nDobar potez je i Qa5+, ali i on vodi u remi, ako beli odigra precizno.\n    Najgori potez za crnog je Nc2+, ali i najprivlačniji. ( : \nOsim toga, crni je veoma dugo fiksirao taj potez i imao ga na oku i zbog toga se najveći broj igrača ovde prevari.\n Onaj e4 pešak u petom potezu nije bio toliko otrovan i mogao se svariti, ali on je vodio crnog do ove pozicije, a top je smrtno otrovan. Naravno, nije to lako da se vidi jer ništa u ovoj poziciji ne ukazuje na to.",
        "12... Nc2+": "Crni je zagrizao mamac. ( : ",
        "13. Kd1": "Ovaj potez kralja, iako iznuđen, ima dve napadačke funkcije.\nTera crnog konja dalje u zamku i istovremeno oslobađa polje e1 za topa.\n",
        "13... Nxa1 14. Qd4": "Sad je crni već potpuno izgubljen, ali verovatno još uvek nije svestan toga.",
        "14... Rg8 15. Bb5": "Ovo je za mene jako zanimljiv potez.\nU teoriji i u svim partijama majstora koje sam pronašao(a nema ih mnogo) ovde beli uvek i bez izuzetka igra 15. d6!\nZbog toga ja ovaj potez Bb5 smatram svojim potezom. ( :  \nVerovatno nisam pogledao dovoljno partija, ali nema veze. Neću ni da gledam. Lepše je ovako.\nTo ću smatrati svojim potezom sve dok mi neko ne pokaže partiju u kojoj je to neko odigrao na zvaničnom turniru, a da je tražim sam...neću. ( :\n15. d6 je dobar potez i vodi u pobedu, ali mene je toliko iritirao zbog sporosti da ga nikad nisam do kraja analizirao. \nMožda je on i bolji, ali ja potezu Bb5 ne mogu da nađem ni jednu jedinu manu. Mnogo je lakši za analiziranje jer je brz. Odmah otvara sve karte i ne ostavlja crnom ni tračak nade. Za mene je ovde partija završena. Crni ne može da učini apsolutno ništa da se izvuče.",
        "15... Qc7": "Jedino logično. Pretnja na c2, ali ....nema crni vremena.",
        "16. Re1+ Be7 17. Re2": "Ovaj potez crnom definitivno izbija poslednji adut i nadu da može da se izvuče.\nKonj ostaje zarobljen, d6 i dalje preti, pa i žrtva topa je opcija. Praktično, sve figure belog su potpuno operativne i imaju igru.\nCrni nema odgovor na tolike pretnje.",
        "17... Nb3": "Ovo je iz očaja. Pokušaj da se neočekivanim potezom nešto promeni na tabli.",
        "18. axb3": "Ali ne smeta ništa. Sve je isto, samo njega nema. (:",
        "18... Qd6": "Ovaj potez sprečava i napredovanje d pešaka i žrtvu topa.\nAlternativa je Qb6, ali u tom slučaju, žrtvom topa beli može da diriguje sve do mata.",
        "19. Bf4": "Kraj ! \nOvo dalje je samo rutinska završnica i može da ide u raznim pravcima, ali ishod ne dolazi u pitanje.",
        "19... Qxf4 20. Qxf4 Rg7 21. d6 Kf8 22. dxe7+ Rxe7 23. Qd6 Kg7 24. Rxe7+ Kh6 25. f4 Kh5 26. Rxh7+": ""
    },
    "url": "https://gameknot.com/annotation.pl/team-match-beogradski-gambit?gm=19563",
    "gameName": "Team match Beogradski gambit",
    "players": "srdjand (1864) vs. sirarthur (1875)",
    "opening": "Four knights (C47), Belgrade gambit"
}