{
    "moves": {
        "1. d4": "Hi, again. I entered in this chess' page for learn to play endgames (I am weak in endgames) and enjoy to think chess. The rhythm of play gives me the chance to think the strategy and tactics (and analyze the position in boards). The game in question is very interesting, my opponent and me alternates the initiative in the game. I'm pleased if you (all levels, please) comment the game or criticized my (or my opponents) moves. I don't use pmca, if you see tactical errors, please, comment!.   ",
        "1... d5 2. c4 e6 3. Nc3 Nf6 4. Bg5 Be7 5. e3 c6": "I don't know if this move is good in this position. I was thinking in QGD, Capablanca variation, where the rook is in c1 and pawn in c6,  I remembered than is play Qc2, c5 is stronger; thus, with pawn in c6, I can play a better variation of QGD. But, if that's true, I was wrong with the plan. ",
        "6. Nf3": "Normal development, but 6 Qc2 and 7 Nge2 are a real alternative",
        "6... Nbd7": "Now, 7. Rc1 0-0 8 Bd3 dxc4 is the normal position of Capablanca variation.",
        "7. Qc2": "That was my idea.",
        "7... Bb4": "Now, we had a variation (with loss of time) of Cambridge Springs!.",
        "8. Rd1": "Now, this is an strategical blunder, White must play 8 Rc1. Now, the rook is misplaced! The d-column can't be opened.",
        "8... Qa5": "Cambridge Spring's idea",
        "9. Bxf6": "This exchange isn't forced. But, now, my plan is Nd2 and the bishop in g5 will be exchanged, anywhere. ",
        "9... Nxf6 10. Nd2": "Normal idea in Cambridge Springs. Knight in c3 isn't pinned.",
        "10... b6": "I expected the castled and, later, black can play with a rupture.",
        "11. Bd3": "I see than if White plays 11. a3 Bxc3 12 Qxc3 Qxc3 and now Ne4 is a \"real threat\", cramped the white position. With this idea in my head, I played the bishop controlling e4.",
        "11... Ba6": "Attacking the c4-pawn and allows the threat Rc8. The position is complex, now. ",
        "12. O-O": "Castled!. Black exchanges the pawn and gives space to the white. ",
        "12... dxc4 13. Bxc4 Bb7": "14 ... Qg5 is a threat and white wants exchanges the knights and winning space in the centre with the next move. ",
        "14. Nde4": "A critical position. If 14 ... c5 15 Nd6+. Thus, 14... Nxe4 15 Nxe4 Qf5 is a good alternative (threat c5, before Be7).  ",
        "14... Bxc3": "Black allows a simple combination, who destroys the pawn structure.",
        "15. Nd6+ Ke7 16. Nxb7 Qb4 17. Qxc3 Qxc3 18. bxc3 Rab8": "The knight in b7 is trapped, but I don't see the next black move. I, only, calculated 19... Ne8.",
        "19. Ba6 Nd5": "The difference with 19...Ne8 is the tempo! I was thinking in play 20 Rb1!. Now, this move isn't possible ",
        "20. Rdc1 Nc7 21. Na5": "Only move, but black has damaged his structure. (Nxa6, Nxc6+)",
        "21... bxa5 22. Bc4": "Controlling d5. If 22. Bd3 (my first idea) Nd5 23 e4 Nf4 and black is better (or, less, equal)",
        "22... a4": "Black can't allow Bb3",
        "23. Rcb1": "Fight for the column",
        "23... Rb6": "Black wants double the rooks",
        "24. Rb4": "But white too can double the rooks.",
        "24... Rxb4": "Good move. If 24... Rhb8 25 Rfb1 and white keep the pressure and can exchange in a favourable moment.",
        "25. cxb4 Rb8 26. a3": "Now, White take the compromise of exchange your bishop for the knight, but, however, the c-column (and the c5 square) gives to the white a comfortable advantage.",
        "26... a6 27. Rc1 Kd6 28. Bd3 Nb5 29. Bxb5 axb5 30. Rc5": "Block the position. Now, I calculated 30 ... Kc7 31 Kf1 Rd8 32 Ke2 Rd5 33 Kf3 Rxc5 34 dxc5 Kd7 35 Ke4 f6 36 g4 g6 37 h4 and white is better ( I don't know if the endgame is winner).",
        "30... f6": "good move. Winning space in the king side, white needs your king in the redzone",
        "31. f4 h6 32. h4 Re8": "Another critical position. White is better, but, what is the plan? Black threats open the e-column... if black exchanges the rooks, with the white king far of the queenside, black can win with c5 advance (creates a passed pawn). Now, the white e-pawn is weak; the better option is now 33 Kf2 and if 33 ... e5 34 dxe5 fxe5 35 f5 h5 (else, 34 g4) 34 e4, where white closes the center with advantage 34... Rf8 35 g4 hxg4 36 Kg3. But, I was choice advanced the e-pawn. We will see than that's an blunder and black takes advantages!",
        "33. e4": "Black takes the initiative! I was feeling than I could loss this endgame",
        "33... e5": "I, too, think in 33 ...f5 if 34 exf5 exf5 and black opens the e-column and could threat the a-pawn. Thus 33 ...f5 34 e5+ Ke6 35 d5+ cxd5 36 Rxb5 and fight with the passed pawns...",
        "34. dxe5+": "If 34 fxe5+ fxe5 35 d5 (dxe5+ loses) cxd5 36 Rxb5 d4 gives to the black a real chance for winning the endgame. 36 ... dxe4 allows than the king can blockade the passed pawn, but 36 ... d4 and 37 Rxe4 cut the access to the king.  ",
        "34... fxe5 35. f5 h5": "Black had, now, a good position",
        "36. Kf2": "This move allows the pin, but, for example, 36 Kh2 Kc7 37 Kg3 Rd8(threat Rd3) 38 Rc3 Re4 39 Kf3 Kd6. I don't like this position.... ",
        "36... Rf8 37. Rc3 g6 38. Rd3+": "Good move, winning a tempo. If, directly, 38 Rf3 gxf6 39 exf6 c5 40 dxc5+ Kxc5 with idea of b4. ",
        "38... Ke7 39. Rf3 gxf5 40. exf5 Kd6": "I think than this move loses the game for the black. Black needs blockade the passed pawn with 40 ... Rf6! and, for example, 41 Ke3 Kd6 42 Kd3 Kd5.",
        "41. Ke3": "Now if 41 ...Rf6 42 Ke4 white is better!",
        "41... Kd5 42. Rf2": "A good move, the alternative is Rf1!. But now, if 42 ... Rf6 43 Rd2+ Kc4 44 Ke4 Kb3 45 Rd3+ ",
        "42... c5": "Creates a passed pawn (the e-pawn is blocked).",
        "43. bxc5 Kxc5 44. Ke4": "Now, White winning the run of pawns! If 44... Kd6 45 Rb2. If 45 ... Rb8 46 Rd2+ and Kxe4. ",
        "44... b4 45. axb4+ Kxb4 46. Kxe5 a3 47. f6 Kb3 48. Ke6 a2 49. Rf1": "Winning a tempo!",
        "49... Kb2 50. Ke7 Ra8 51. f7 a1=Q": "Check with 51 ... Ra7+ 52 Kf8 doesn't changes the position!",
        "52. Rxa1 Kxa1 53. f8=Q Rxf8 54. Kxf8 Kb2 55. Kg7 Kc3 56. Kg6 Kd4 57. Kxh5 Ke5 58. Kg6": ""
    },
    "url": "https://gameknot.com/annotation.pl/team-match?gm=53656",
    "gameName": "Team match",
    "players": "alejandro83 (1771) vs. sanych (1713)",
    "opening": "QGD (D53), Lasker variation"
}