{
    "moves": {
        "1. d4": "very usual openingsmove, It is played 189000 times on GK",
        "1... Nf6": "Not the most usual move(most usual is d6) but it is the best move as well.(according to the chess database it is the only usual move that has a advantage for black)",
        "2. c4": "very usual too, played more than 47000 times",
        "2... e6": "most usual move",
        "3. Nf3": "not the most usual move, it has played a little more then 6000 times on GK, Nc3 is played over 12000 times, but it has a little advantage for white instead of a little disadvantage(according to the Chessdatabase)",
        "3... Bb4+": "This only 1078 times played on Gameknot. The more usual moves are b6 and d5. According to the chess database it is  a little disadvantageful for black and so I want to call it a bad move. However, all outcomes of the game are possible at the moment!!",
        "4. Bd2": "Most usual is Nc3(1021 times). Bd2 is played 789 times. But Bd2 is more advantageful for white, if you may believe the chess database. \r\nBy the way, this opening is called the Bogo-indian defence.",
        "4... Qe7": "All possible moves are a little advantageful for white. This is the most usual, a little more usual than Bxd2, with a difference of 3 times. But according to the chess database, Bxd2 is a little more advantageful for white. So this is a better move.\r\nBy the way, this is the Nimzovich variation of that Bogo-indian defence.",
        "5. Qa4": "Most usual is g3(158 times played). There are five other moves that are more usual than this one. This one is played 3 times. But it is the most advantageful one for white. I didnt look in the chess database when I played this move. I dont know exactly why I played this.",
        "5... Bxd2+": "Now he takes my bishop. All three times this is played on GK, black took the bishop!!",
        "6. Nbxd2": "All three players of whit have done this. The king stays in his shelter on this way, the moving knight is more active, and the other knight stays active and is defended now.",
        "6... O-O": "He thought, this is a good moment to do the rochade. I think so. All 3 players in the chess database have done this.",
        "7. e4": "1 player did e4, 2 players did e3. The e4-player has wonnen the game, The first e3-player loosed and the other e3-player has wonnen the game.\r\nI cant explain why everyone has played with the e-pawn. Maybe it is a kind of challenge to the black knight. It is also a preparing of the offer in the next move.\r\n",
        "7... d6": "This is the preparing of the offer. That player in the database was more aggressive, he did d5. So this is the end of the things I say about the chess database. Starting with this move it is an original game on GK.",
        "8. e5": "Making a fork between pawn and knight and offering the pawn in this way.",
        "8... dxe5": "Deleting the threating on the knight and accepting the fork",
        "9. dxe5": "Of course completing the fork and threating the knight again.",
        "9... Nfd7": "Of course the knight is running away.(and in this way he treats my pawn, that is undefended)",
        "10. Qa5": "Defending my pawn",
        "10... Nc6": "Threating my queen, in nearly every case a good idea, but now more than in other cases for this is the defending queen.",
        "11. Qxc7": "Taking the undefended pawn and holding the defending of the pawn",
        "11... Qc5": "Attacking the pawn for the thirth time",
        "12. Be2": "Defending the knight as a preparing to the attack of the knight that is on d7 at the moment about 2 moves.",
        "12... Ndxe5": "Taking the pawn, that is defended by my queen, but is damageful defended by his queen and his other knight.",
        "13. O-O": "Giving the king a quiet old day.",
        "13... Nxf3+": "immediately taking my knight and attacking my king.",
        "14. Bxf3": "only possible by move 12",
        "14... Qe7": "Challenging my queen to an offer. (he dislikes the visit of my queen I think, a brutallity, when my queen makes a visit it must be a honour!!!! :P:P)",
        "15. Qxe7": "But Im accepting the offer.",
        "15... Nxe7": "And of course he completes the offer.",
        "16. Nb3": "Preparing the active-making of the rook. You dont see?? Wait and you shall see!!!",
        "16... Rb8": "I dont know why this move. I should do Ng6, but that I cant explain too.",
        "17. Rad1": "St5ill preparing the activemaking of the rook(yeah, he is more active than a move ago, but Im going to make him very more active)",
        "17... e5": "This move too, I dont know why. I should do now already move 20, b5.",
        "18. Nc5": "You see it already?? Still preparing the active making.",
        "18... Nf5": "This move even too, I dont know why. I should do Ng6 to defend the pawn.",
        "19. Nd7": "Making a fork between the two rooks and is defended by my rook, and this is a way to get my rook in the game without being taken by the bishop.",
        "19... Bxd7": "Of course takes he my knight to prevent that I can take 1 of the rooks(the b-rook is even undefended)",
        "20. Rxd7": "Very more active rook. This was the purpose. Now this rook can be useful in next moves.",
        "20... b5": "Maybe wants an offer(and in that way a more active rook), maybe it is his purpose that I go one field straight ahead.",
        "21. c5": "I dont want an offer or a more active black rook, I go 1 field straight ahead. Evermore, so I can defend my undefended rook on d7.",
        "21... a5": "Trying to promoting in a couple of moves I think.",
        "22. Re1": "Making the rook more active and attacking the black pawn",
        "22... f6": "Defending the attacked and undefended pawn.",
        "23. c6": "Defending the undefended rook",
        "23... Nd4": "Attacking the pawn, the defending of my rook.",
        "24. Bd5+": "Attacking the king. Between nose and lips, we say in Dutch.",
        "24... Kh8": "Of course the king is running away. Otherwise he must Move his rook between bishop and king and that is not very smart.",
        "25. c7": "The pawn is moved away. It was possible too without attacking his king, but I did that between nose and lips as I said, it is about a couple of moves maybe useful.",
        "25... Rbc8": "Preventing the promoting of the pawn and attacking.",
        "26. Bb7": "Attacking that rook, he can not take the pawn, for that is defended by my rook.",
        "26... Ne6": "Attacking the pawn for a second time. Maybe not smart that he dont takes the rook away.",
        "27. Bxc8": "So I can take the rook with my bishop.",
        "27... Rxc8": "Of course he takes the bishop back, but it is a material gain of two points. But I have not a bishop to attack the rook again, thats true.",
        "28. Rc1": "But I can defending the pawn for the second time as well.",
        "28... h5": "Yeah, syure, you must do something, and then we do a nearly useluss move isnt it??",
        "29. Rd8+": "Sure, Im attacking the king, but resigning was not necessary. When he did Nxd8, I should do c7Xd8=SOMETHING.(What something is is not important at the moment) And he should do Rxd8, he should have a material gain of 1 point and a big chanche to win the game.\r\nThanks for reading my annotations. Im hoping youve learned something and enjoyed."
    },
    "url": "https://gameknot.com/annotation.pl/team-match?gm=9744",
    "gameName": "Team match",
    "players": "appelflap (1641) vs. smoothg (1622)",
    "opening": "Bogo-Indian defence, Nimzovich variation (E11)"
}