{
    "moves": {
        "1. d4": "I'll anotate this game, for it seems to illustrate some chess strategical principles : open file, center...",
        "1... Nf6 2. c4": "Queen's gambit.",
        "2... e6 3. Nc3 Bb4 4. Qc2 O-O 5. a3 Bxc3+ 6. Qxc3 d6 7. Nf3 b6 8. e3 Bb7 9. Be2 e5": "This move comes to early in the game : none of both coulours is fully developped.",
        "10. dxe5": "OK for the trade",
        "10... dxe5 11. Qxe5": "Taking with tege knight would have meant 11... Bxg2 - White is one pawn up but the queen will be harrassed",
        "11... Re8": "now, a few moves tp contain black and save the queen.",
        "12. Qg3": "The queen has to stay on black squares - then, a couple of positionnal moves (we are still in the opening).",
        "12... Nc6 13. O-O Qc8 14. b3 Ne4": "Once agai, this attack might have been to early. Both caps are not fully develloped.",
        "15. Qf4 Ne7": "White has to save his queen.",
        "16. Qe5 Ng6 17. Qb2": "Queen in safe, the defense is ok. No counter attack possible (white is not fully developped).",
        "17... c5": "A weak move - moving the queel no join the rooks would have been better.",
        "18. Bd2": "Now begins the fight for the open file.",
        "18... Qf5": "Bold attack but the black queen will be soon under harass.",
        "19. Bc3": "strong menace - aiming at the center which is under black control. The fight for the open d file and consequently the center will occupates most of the time, from now on.",
        "19... Nxc3 20. Qxc3 Rad8": "The control of the d file is vital.",
        "21. Rfd1": "White cannot let black take control of the d file ( and, consequently the center).",
        "21... Bc6": "waiting move.",
        "22. Rd2": "If black takes, white will control the d file.",
        "22... Rd7 23. Rxd7 Qxd7 24. Rd1": "Now, white controls the d file.",
        "24... Qf5": "The following moves are fight for the center.",
        "25. h3": "The g4 square, proved to be an important one further in the game.",
        "25... Bxf3": "Probably a mistake. Black's attacking possibilities are ùore reduced than white's defensive capacity.",
        "26. Bxf3 Ne5 27. Be2": "retreat.",
        "27... g6": "Doubtfull move, which weakens the black king (the white queen holding firmly the long black diagonal).",
        "28. f4": "Launching the attack ! Centeeeeeeeer !",
        "28... Nc6 29. Bg4": "Black has only 2 moves available",
        "29... Qe4 30. Bf3": "menacing Q and N",
        "30... Qe6": "Only move to save the knight - now white has a better control on the center.",
        "31. Kf2": "To protect e3",
        "31... h5": "Black nas not plenty of options.",
        "32. Bd5": "Settling at the center and beginning of the final attack.",
        "32... Qc8": "Crucial move. 32. Qd6 and 32. Qd8 would have loss the queen. 32. Q d7 was bettre but it wouldn't have changed much.",
        "33. Qf6": "Several menaces.",
        "33... Rd8": "Not the best move - mate in 3.",
        "34. Bxf7+ Kh7 35. Qxg6+ Kh8 36. Qh6#": ""
    },
    "url": "https://gameknot.com/annotation.pl/team-match?gm=68770",
    "gameName": "Team match",
    "players": "ptitroque (1900) vs. cantonabest (1853)",
    "opening": "Nimzo-Indian (E32), classical, Adorjan gambit"
}