{
    "moves": {
        "1. d4": "This game seems to me interresting (strategical) and, I must admit, I'm proud of it.\n\n",
        "1... Nf6 2. c4 g6 3. Nc3 d5 4. cxd5 Nxd5 5. e4 Nxc3 6. bxc3": "We are still in the data bases but it seems a bit weird for black let the center to white with little compensation, in my opinion but I might be wrong.",
        "6... Bg7 7. Nf3": "Logical moves, aiming at the center which will be the crucial part of the game.",
        "7... c5": "attacking the center",
        "8. Rb1": "The control of the half open file is important. Furthermore, the rook is of the fireline of black's DSB (with an inconvenient : the a2 pawn is not protected.",
        "8... O-O 9. Be2": "Safety of the kings.",
        "9... cxd4": "trading",
        "10. cxd4": "Now, those 2 pawns occuping the center have to be protected and, if possible, have to advance.",
        "10... b6 11. O-O Bb7": "2 fianchetoed bishops. Attacking the central pawns : a necessity for black - typically modern chess strategy.",
        "12. Qd3": "Developping and reinforcing the center.",
        "12... Qd7 13. Be3": "The white pieces, grouped in the center are very powerfull at ong term, for they control a big pack of squares.",
        "13... Ba6 14. Qd2 f5": "After having weakened the e4 pawns, forcing the queen to move, black attacks. This is a strong move but it considerably weakens the king and, if white manages to advance its e pawn, it will be very hard to fire him.",
        "15. Bxa6": "Contestable move : when you have fianchetoed a bishop in front of your king, you want to exchange the other one. Furthermore, the a2-f7 diagonal is opened !\nOn the other hand, white estimated that this piece would put him in trouble for it controlled the d3 square.",
        "15... Nxa6 16. Qd3": "Back on d3",
        "16... Nc5": "The d4 pawn is pinned",
        "17. Qc4+": "Now, the black knoght is in trouble",
        "17... Qe6": "Only move",
        "18. Qxe6+ Nxe6": "Until know, white's center holds.",
        "19. e5": "Hurray ! The e5 pawn will be very hard to take.",
        "19... f4 20. Bc1": "Bd2 was playable as well but the bishop will anyway end on the a1-h8 diagonal and it would prevent the rook to control the open c file (which is white's next intention).",
        "20... Rfd8 21. Bb2 Rac8 22. Rbc1": "This file is very important.",
        "22... Rxc1": "Probably a mistake, for it let white controlling the file.",
        "23. Rxc1": "Lasker 7 points analysis :\n1. immediate threats : none\n2. safety of the king : white is slighly better but, as there are no more pieces able to attack on the a2-g8 diagonal, it's not that serious.\n3. material : equality\n4. center : black is firmly settled\n5. opened files : one, under white control.\n6. pawn structure : black has an island with the f4 pawn (almost isolated) - black has a majority on the queenside\n7. general configuration : white has more mobility - both camps have an unprotected piece.",
        "23... Kf7 24. h4": "White plans to close the kingside, one way or another.",
        "24... h6 25. Kh2": "To support the advance. Black is cramped. Why hurry ?",
        "25... b5": "Black attacks where he has the majority.",
        "26. a3": "blocking the advance.",
        "26... a5 27. g4 Rd5 28. g5": "White wants to block both sides before attacking the center.",
        "28... h5 29. Kg2": "Now, the next plan is to take the f pawn, which will necessitate a couple of moves.",
        "29... Rd8": "waiting move - black proposes a draw.",
        "30. Rc2 Rd5 31. Rd2 Ke8 32. Bc3": "So that the rook will be defended by the DSB which liberates the knight frome this task and enables him to live and catch the f4 pawn.",
        "32... a4 33. Ng1 Rd7 34. Ne2": "The f4 pawn is doomed.",
        "34... Nc7 35. Nxf4 Nd5 36. Nxd5 Rxd5 37. f4 e6": "Blocking the center",
        "38. Kf3": "The white king has to protect the central pawns to free the rook and bishop from this task",
        "38... Kd7": "Black take control of c6, c7, c8, hoping to prevent the white rook to come on one of those squares.",
        "39. Bb4": "To prevent  39... Bf8",
        "39... Bh8 40. Ke4": "Now, the white rook can take control of the open file - White's objective is now to set black in zugzwang.",
        "40... Bg7 41. Rc2 Bh8 42. Bd6": "Black submits. Whatever he does now, he'll be in zugzwand next move."
    },
    "url": "https://gameknot.com/annotation.pl/team-match?gm=67946",
    "gameName": "Team match",
    "players": "ptitroque (1916) vs. normski1951 (1945)",
    "opening": "Gruenfeld (D85), modern exchange variation"
}