{
    "moves": {
        "1. e4 e5 2. f4 d6": "declining the kings gambit. i usually accept but in this game i wanted to experiment!!well the experiment was a failure!!",
        "3. Bc4 f5": "looks like the queens gambit in reverse colors:) Fritz suggests 3...exf4 as better here!",
        "4. d3": "i like 4.exf5 Bxf5 better here for white. d3 is more passive in my opinion. not bad however.",
        "4... Nf6": "a natural move. Fritz insists on exf4 however!",
        "5. fxe5 dxe5 6. exf5 Bxf5 7. Qf3": "nice move indeed! White will try to exploit the fact that black isn't developed and in fact with this energetic move will hinder blacks activity in the future!!!",
        "7... Bc8": "not accurate. In my opinion 7..Bd7 was the right move. If White takes the pawn on b7 the black can develop with 8..Nc6 and get a much better play than in this game!! By trying to save the material i lost the positional fight all together!",
        "8. Qg3": "Whites on the same path, hindering blacks development!!",
        "8... e4 9. Nc3 exd3 10. cxd3": "Fritz favors Bxd3 here but obviously white liked that diagonal better:) The king file is opened now and that Will be my demise, after a serious mistake i made in a few moves ahead!!",
        "10... Bg4": "developing the bishop and covering g7 for the other bishop to come out if he has the chance. Other possibilities were 10...c6 covering b7 and preventing Nb5. But finally i realised i had to develop my pieces. If 11 Nb5 now 11..Bb4+ and if 12Kf2 then 12..Na6 and the c7 pawn is protected plus I've developed two of my pieces!!if 12Nc3 then I've simply developed my bishop and theres no threat to c7. ",
        "11. Bf4": "developing, pressuring c7 and making way to the long castle later on maybe. ",
        "11... Bd6 12. h3 Bxf4 13. Qxf4": "Black has done ok until now. hes under pressure but hes exchanged some pieces, developed a bit and trying to make his king safer.But here comes the big blunder on my part. ",
        "13... Qe7+": "a rushed decision. i missed what was coming next and didn't calculate. i thought i could play Bh5 after the check!! but.....",
        "14. Kd2": "Re1+ is coming now and ive just hanged a piece. Instead of this i should have played 13...Bh5 and after  14Kd2 14....Qd7 and black is still pressured but not loosing immediately",
        "14... Kd8 15. hxg4": "i resigned here. Its not just the material lose. Whites attack now comes and there's no way out!! But what i wanted to show was in fact not my blunder here!! Blacks position even at best moves was still pressured a lot. That came as a result of Whites energetic play, not letting me develop properly and creating threats all over. i responded well up to a point but is hard to play this positions and probably i would have made other mistakes along the way. White on the other hand had a much clearer path and would be much more easier for him to find his way."
    },
    "url": "https://gameknot.com/annotation.pl/team-match?gm=29743",
    "gameName": "Team match",
    "players": "vilden (1886) vs. thegreek1 (1887)",
    "opening": "King's gambit (C30)"
}