{
    "moves": {
        "1. e4 c5": "My usual response to e4 . . . ",
        "2. d4 cxd4": "I learned once the hard way that it's a good idea to take the pawn at d4.  Allowing white's pawn to d5 leaves black all congested.  Besides, if white's queen captures back at d4, it gives the initiative back to black.  ",
        "3. Qxd4 Nc6": "Which is exactly what happened here.  Pretty common stuff so far.  ",
        "4. Qd1 Nf6 5. Bd3 d5 6. exd5": "Maybe Nc3 would have been better for white here instead of capturing at d5.  ",
        "6... Qxd5": "Threatening Qxg2 and pinning the bishop, since Qxd1 will prevent white from castling.  ",
        "7. Nf3 Bg4 8. Be2": "Now I'm starting to regret having my queen out so early.  I hate to retreat, so . . . ",
        "8... Nb4": "Hoping that the threat of the knight fork at c2 will prevent the queen trade . . . \n",
        "9. Bd2": "The first evidence that my opponent might be the type of player who avoids trades, at least with queens.  ",
        "9... Bxf3": "That kingside knight seems so important to white's defense, and worth the trade if I can divert his bishop from e2.   ",
        "10. Bxf3 Qc4": "Renewed attack on c2.  ",
        "11. Nc3": "I think I was hoping for c3 instead, which would have allowed Nd3+.  But white's good move here turns the tables for a long time.  ",
        "11... Rd8 12. Be2 Qh4": "I have few places to hide.  I didn't want Qe6, bottling up my e pawn.  I thought about Qc1, but that seemed like such a retreat.  I know I'm going to get chased around here.  ",
        "13. Bb5+ Nc6": "Okay, forget about the fork at c2 then!  :-)  White is ahead in development and pretty clearly has the better game here.  ",
        "14. Bxc6+ bxc6": "And the better pawn structure.  :-(",
        "15. Qe2": "This puts a damper on my hopes for Ng4 followed by an attack on f2.  Now, maybe I better start to think about castling . . . ",
        "15... g6": "I am not a fiancetto player by nature. I guess I just thought it would make me safer in this case, since my queenside is so blown apart.  ",
        "16. g3 Qb4": "Maybe I'm thinking after I play Bg7, I'll have pressure on b2 . . . and where else could I have gone?  h3?  d4?  ",
        "17. O-O-O": "Oooh, I'm thinking, b2, yum!  ",
        "17... Rb8 18. b3 e6 19. Nb1": "And my threat is over for about the next 20 moves.  Good defense by white, I think.  Threatens my queen, prevents Qa3+. . . . ",
        "19... Qb7": "Okay, retreat!  I hoped to play Bg2, followed by O-O, leading to a close tough game. . . . ",
        "20. Bc3": "Okay, I thought.  Makes me do what I wanted to do anyway.  ",
        "20... Bg7 21. Qf3": "Ugh!  Great move by white.  What can I do to save the knight?  Qe7?  That allows Qxc6+.  I can't move it because of Bxg7.  I was hating my position at this point, as you can imagine.  It's all because I was a tempo or two behind due to having to keep moving my queen earlier.",
        "21... Ke7": "So I save my knight, for now.  I was hoping to bring my h rook over and into the game, but I'm too exposed and white knows it.  ",
        "22. Bd4": "Allowing for Bc5+",
        "22... Qc7": "Dumb!  At least Qb5 would have prevented the check at c5.  I can't imagine what I was thinking here.  ",
        "23. Bc5+ Ke8": "Back to where I was before . . . ",
        "24. Bd6": "Ugh.  I felt a bit like resigning.  I can't castle, I'm about to lose the exchange, and I have no threats . . . . Well done on white's part.  ",
        "24... Qb6 25. Bxb8 Qxb8": "Poo.  Now what?  I'd like to get my rook into the game, my king to a safer place, but white has the initiative and material advantage.   ",
        "26. Qxc6+": "Especially now!  ",
        "26... Kf8 27. Qc5+ Kg8 28. Qg5": "Smart move, pinning my Knight.  I'd like to get it into action and open the long diagonal for my bishop, but I can't because of the threat of Rd8+ forking my king and queen (protected by his queen at g5.  If I play Nd5, then white plays c4.  What an awful position!  Who wants to bet on black to win this game???",
        "28... h6": "Go away.  ",
        "29. Qa5": "Renews the threat of Rd8, so . . . ",
        "29... Kh7 30. Rd2 h5": "I'd like to spear the white rook and king.  He'll never let me though . . . ",
        "31. f4": "Bottling me up for several moves to come.  ",
        "31... Ne4": "This helps prevent R1d1 which would increase pressure on d8.",
        "32. Rd7": "f7 is a sitting duck . . . ",
        "32... Nf2": "But this prevents R1d1 again.",
        "33. Rf1 Ne4 34. Rxf7 Rd8": "I think white should have called my bluff here and played Rd1.  I'd almost have to trade rooks, and he'd be further ahead after simplifying the board.  ",
        "35. Re1": "But he keeps harassing my knight, spearing the pawn at e6.  He's got such a lead, it makes sense to just whittle me down.  ",
        "35... Nd6": "So I harass his pieces.  I think even Rxg7 here would give him a better game.  ",
        "36. Rxa7": "But instead, pawn snatching.  I think snatching the e pawn might have been better.  ",
        "36... Nb5": "More harassment, buying time.  Maybe I could go Nd4 next, keeping his other rook from invading. . . . ",
        "37. Re7": "???   Wouldn't Rxe6 be better here?  I know there's no saving the e pawn in any case . . . ",
        "37... g5": "I really want to break up that pawn chain, open up the threat of Qf4+.  It's a longshot, but what else do I have?  ",
        "38. Re1xe6": "Yum!  a pawn!  ",
        "38... gxf4": "Give some breathing room over here!  I still think Rxg7 here gives white the better game.  My king would be completely exposed.  ",
        "39. Rb6": "Instead he goes after my knight (and queen).  I've got nowhere to go with the queen . . . but I think this is an example of white going after material instead of keeping his eyes on the prize--my king.  To save my queen, and possibly the game, I launch a kamikaze attack.   ",
        "39... Rd1+": "Since I own the long diagonal, white has no other move but to capture.  ",
        "40. Kxd1 Qd8+": "Regaining the rook . . . ",
        "41. Kc1 Qxe7 42. Rxb5": "Again, going after material instead of playing good offense (or defense).  Nd2 or even c3 would have probably held the game and the advantage for white.  Instead he takes the knight and goes back up by 8 \"points\" (but of course, chess is not a game of points, is it?).  BTW, white was smart in capturing with the rook, because Qxb5 would have allowed Qe1 mate.  Hmm.  What's going to happen?  Here's where it gets REALLY interesting.  I have the initiative, so I have to take it.  ",
        "42... Qe3+ 43. Qd2": "I expected this.  I think Kd1 would actually have been better though.  It makes sense for him to force a trade since he's got such a clear advantage.  I thought about trading and trying to get my pawn to queen, but it's impossible.  So, to keep the initiative. . . . ",
        "43... Qg1+ 44. Qd1": "White's only move.  I was hoping maybe to find a perpetual check and thereby a draw, but Qe3 could be answered once and for all by Nd2 (which is why it would have been better for white to make that move instead of taking my knight at move 42.  Again, trading queens here is hopeless for black.  I need a miracle.  What could it be?  ",
        "44... Bb2+": "Touche!  This might be the move I'm most proud of since I started playing.  What are white's options?  If Kxb7, then Qxd1.  Of course, that would be a bad move, right?  So . . . ",
        "45. Kd2": "Save the queen . . . ",
        "45... Qe3#": "Lose the game.  And I couldn't have done it without that little hopeless pawn at f4.  Of course, I couldn't have done it with some errors from my opponent.  The lesson in this game?  A big lead in material won't win by itself.  Instead of going after more material, good defense or strong offense (against the king!) is the key.  Thanks for reading.  I'm interested in your insights and opinions too.  --Crossquill"
    },
    "url": "https://gameknot.com/annotation.pl/team-match?gm=26333",
    "gameName": "Team match",
    "players": "hmsonne (1559) vs. crossquill (1636)",
    "opening": "Sicilian (B21), Andreaschek gambit"
}