{
    "moves": {
        "1. e4 e5 2. d4": "King's pawn, Center Game.",
        "2... exd4 3. Qxd4 Nc6 4. Qd1 Bc5 5. Nh3": "Here I like d6, and then take the knight if it remains on h3.",
        "5... h6 6. a3 Nf6 7. Bd3 d6 8. Nc3": "Taking the knight doubles white's pawns while wrecking the king side castle.\n",
        "8... Qe7 9. Qf3 Bg4 10. Qg3": "While the g pawn is considered poison, black should take care about losing it anyway.",
        "10... Nd4 11. Nf4": "If white forces the bishop to move, g7 will be at risk.",
        "11... c6 12. h3 Be6 13. Qxg7 O-O-O 14. Qg3 a6 15. Na4 Ba7 16. Be3": "If white pushes Nd4 with a pawn, Ba7 is undefended except by Nb5.  Another pawn push and black will want to move BxBe3.\n",
        "16... Nb5": "If Bxa7, Nxa7.  That is why the knight is protecting it.  If Bxb5, Bxe3.  Otherwise free bishop for white.",
        "17. Bxa7 Rhg8": "White must move the queen, but e3 looks like a good spot which covers Ba7.",
        "18. Qe3 Nd7 19. O-O-O Rde8 20. Nb6+ Nxb6 21. Bxb6 Nc7 22. g3": "Now white can play NxBe6 and pick up Qxh6 in the exchange.",
        "22... f6 23. h4 Bd7 24. Ba5 c5 25. Bxc7": "That knight was covering d5.  If Kxc7 white forks the queen with Nd5+.  Here Bg4 lets the queen move OnThe bishop but is easily countered by f3.  Bc6 might be better, but lets white's black bishop escape. ",
        "25... Kxc7 26. Nd5+ Kb8 27. Nxe7 Rxe7 28. Qxh6 Re6": "Oh no, this lines up the rooks for a bishop pin, Bc4.",
        "29. Qh7 Rd8 30. h5 Ree8 31. Qh6 Ref8 32. Qf4 Be6": "I like Bc6 better, where a pawn mutually protects the bishop.",
        "33. h6 Rfh8 34. Qxf6 Rde8 35. f4 Ka7": "Pf5 means black loses Pd6.",
        "36. f5 Rhf8 37. Qc3": "...or maybe not.",
        "37... Bf7 38. g4 Rfh8 39. g5 Bg8 40. Qxh8 Bf7 41. Qf6 Bg8 42. Qxd6 Rb8 43. Qxc5+ Ka8 44. g6 Ba2 45. e5 Rd8 46. Be4 Re8 47. Qc7 Rb8 48. h7 Bg8 49. h8=Q": ""
    },
    "url": "https://gameknot.com/annotation.pl/team-match?gm=63465",
    "gameName": "Team match",
    "players": "rejected_2 (1248) vs. umpire20 (1290)",
    "opening": "Centre game (C22)"
}