{
    "moves": {
        "1. d4 d5 2. c4": "favourite start",
        "2... c6": "over 11.000 times played on gameknot. Little favourable for white.",
        "3. Nf3": "Not most common, most favourable for white as well(according to chess database)",
        "3... Nf6": "most common",
        "4. e3": "not most common, a little more favourable than the most common move for white.",
        "4... Bg4": "Not most common, relatively favourable for white. From now of this is called the queen gambit declined, 4 e3.",
        "5. cxd5": "not most common, 5th in the list of the chess database.",
        "5... cxd5": "most common move",
        "6. Bd3": "move that not is earlier played in this position on gameknot. So here is stopping my commentary about the chess database.",
        "6... Nc6": "making knight active, attacking d4, which is defended.",
        "7. O-O": "rochading when it is possible and it is relatively quiet.",
        "7... e5": "presenting pawn offer",
        "8. dxe5": "I cant doing something else as accepting pawn offer",
        "8... Nxe5": "completing pawn offer, making a fork between bishop and knight, which is not dangerous.",
        "9. Bb5+": "making check. nearly always handy.",
        "9... Nc6": "Must do something to turn the check away.",
        "10. Nc3": "defending bishop, I think, cant very good remember.",
        "10... Bc5": "uh, making bishop active and preparing castling??",
        "11. Qa4": "making queen active and defending bishop, dont remember at the moment why defending bishop exactly, which is not attacked.",
        "11... Bxf3": "trading bishop for knight",
        "12. Bxc6+": "He expected I took the bishop I think, but I take the knight first. So he need a move to get my bishop and I have space to do something else.",
        "12... bxc6": "takind the bishop indeed",
        "13. Qxc6+": "making a fork between rook and king.",
        "13... Nd7": "must do something",
        "14. gxf3": "And eventually I take the bishop. So I have a material gain of one point.",
        "14... d4": "fork between pawn and knight",
        "15. exd4": "taking the pawn",
        "15... Bxd4": "taking pawn back and attacking my other knight.",
        "16. Re1+": "making check, he must do something about that first.",
        "16... Kf8": "running away, cant castling anymore.",
        "17. Qd6+": "making check again.",
        "17... Kg8": "running away again.",
        "18. Qxd4": "and taking bishop, bnow material gain of 4 points.",
        "18... Nf6": "presenting challenge for queen offer.",
        "19. Be3": "defending queen",
        "19... Qxd4": "indeed making queen offer.",
        "20. Bxd4": "and completing queen offer and attacking knight in this way.",
        "20... Nh5": "running away with knight.",
        "21. Bxa7": "taking pawn. Looks very fool, when you see the rook, but when he should do Rxa7, I should do Re8, checkmate.",
        "21... h6": "creating a way for the king in case of emergency.",
        "22. Bb6": "taking bishop out of the attack from the rook.",
        "22... Kh7": "already running away over his new emergency way.",
        "23. Rad1": "making the other rook active.",
        "23... Ra6": "attacking bishop.",
        "24. Bc7": "running away.",
        "24... Rc8": "attacking bishop with the other rook.",
        "25. Rd6": "challenging for rook offer.",
        "25... Ra7": "running away and attacking bishop for the second time.",
        "26. Bb6": "running away and attacking rook.",
        "26... Ra6": "attacking bishop again, when I remove bishop, that rook is attacking my rook, that is undefended in that case.",
        "27. a4": "giving support",
        "27... Nf6": "doing the same thing",
        "28. a5": "defending bishop, which is defending the pawn.",
        "28... Nh5": "running back?? I dont know what is the planning. I think he wasted 2 moves.",
        "29. Nb5": "giving support, defending rook.",
        "29... Rc2": "dont like the little game in the corner anymore and attacks the pawn.",
        "30. Nc7": "attacking rook",
        "30... Rxc7": "taking the knight, that is attacking the rook. He must offer 2 points.",
        "31. Bxc7": "taking rook, gained 2 points. Totally 7 points now.",
        "31... Ra8": "running away for my rook.",
        "32. Re7": "attacking undefended pawn.",
        "32... f6": "running away, to stay in defence of the pawn at g7 that is in defence of the king.",
        "33. Re5": "looks risky. It is. It looks like a blunder. It is. I was forgotten the pawn at a 5. When it wasnt there, this was a good move. I cant explain exactly. Are there volunteers that can explain in a comment??",
        "33... fxe5": "taking undefended rook",
        "34. Rd5": "attacking pawn",
        "34... Nf4": "attacking rook",
        "35. Rd8": "running away and attacking rook that is very isolated and undefended.",
        "35... Rxd8": "offers rook.",
        "36. Bxd8": "completing offer.",
        "36... Ne2+": "making check",
        "37. Kh1": "running away of course",
        "37... Nd4": "attacking undefended pawn at f3",
        "38. a6": "trying to promote",
        "38... Nc6": "trying to prevent the promoting",
        "39. Bb6": "challenging for an offer between pawn and knight.",
        "39... Kg6": "maybe running away for the case I promote??",
        "40. b4": "challenging, when he takes that undefended pawn I can promote. Here he resigned. I hope you have enjoyed reading this and learned something."
    },
    "url": "https://gameknot.com/annotation.pl/team-match?gm=10156",
    "gameName": "Team match",
    "players": "appelflap (1598) vs. 2dio (1627)",
    "opening": "QGD Slav (D11), 4.e3"
}