{
    "moves": {
        "1. d4 c6 2. c4 d5": "Queens gambit, Slave variation. Very solid.",
        "3. Nf3 Nf6 4. Nc3 e6 5. e3": "Also playable (and popular) is Bg5, but I noticed that I have a better score with this move (even thu I don't know why).",
        "5... Bd6 6. Qc2 Nbd7 7. b3": "I'm sure this has been played before, but for me I get out of the books here. I just don't want to play Bd3 and loose a tempo after dxc. So I prepare to fianchetto the bishop, even thu my king is still in the center.",
        "7... a6": "?! Not sure what this was for. Prepare b5 maybe. 0-0 seems better.",
        "8. Bb2 O-O 9. Bd3": "Finally, I cannot delay this if I want to finish my development. ",
        "9... h6 10. h3": "?! Not sure what is the point, likely 0-0 at once is better.",
        "10... e5": "At last some action in the center. Black has an edge in development and decide to open the center. I cannot allow e4 because of the fork, and because my pieces would be burried alived.",
        "11. dxe5": "11.c5 ? Bc7 would be bad for white.",
        "11... Nxe5 12. Nxe5": "I cannot let him inflict me double pawns on f3. Black has the initiative.",
        "12... Bxe5 13. O-O": "0-0-0 seems more dangerous because the Q-side pawns can easily be exchanged. But my king is almost alone.",
        "13... Be6 14. cxd5": "What will black do for the center ?",
        "14... cxd5": "After 14...Nxd5 minor pieces would be exchanged, and I would have tried a minority attack on the Q-side (2 pawns vs 3), while black would probably have gone for a king attack on the other wind.\nThe chosen move gives a central isolated pawn, that can be a weakness or a help for an attack. C column opens as well.\nPosition is balanced.",
        "15. Ne2": "I propose more exchange and try to make d4 a strong place for my knight.",
        "15... Rc8": "! Black occupy the column 1st, I should fight for it latter if I can.",
        "16. Qd2 Bc7": "?! I guess the bishop exchanged would have favored white, but b8 seems a better place, not blocking the rook.",
        "17. Rac1": "So I challenge the column",
        "17... Ne8": "? Black should have tried 17...Ne4, or heaven some Qd6 (threatening mate). Now it's position looks more cramped.",
        "18. Bb1": "With these 2 wonderfull diagonals for my bishops, I prepare some B+Q battery to attack the king.",
        "18... Qd6": "Black goes first.",
        "19. f4": "14 g3? Bxh3. or 14 Ng3 ?! but the knight cannot move and if the Qd6 move, BxN would destroy my pawns. So I weaken e3",
        "19... Qe7": "Aiming at h4 and e3 (X-ray).",
        "20. Qd3": "As French says: \"un air de déjà vu\" ^_^",
        "20... f5": "20... Nf6?? 21. BxNf6 loose. While 20...g6 Qd4 is quite unpleasant. So, same medecine for both players (f4 and f5). The e6 bishop is burried.",
        "21. Nd4": "Just considering the knight position, white has a big +. Black knight want to jump on e4.",
        "21... Bd7": "Soon, black will play, Nd6 - e4, or attack e3 with Q+R, and come into play. So I need to find something.",
        "22. g4": "!? Open everything while ahead in development.",
        "22... Bb6 23. Rxc8": "I exchanged 1st to avoid Bxe3+ and Bxc1 in some variation. Not sure it is mandatory but I felt it safer.",
        "23... Bxc8 24. gxf5": "A pawn is a (doubled) pawn !",
        "24... Qh4": "I was expecting 24...Nf6 followed by 25...Re8. GK computer spots this as a mystake. May be, but a dangerous one as we'll see.",
        "25. Kg2": "I protect the pawn, but actually 25.Kh2 followed by 26.Rg1 is better, without fearing 26...Qf2+ thanks to 27.Rg2.",
        "25... Nd6": "Black counter attack on f5 or e4 with the knight, after which the Q can enter in g3",
        "26. Nf3": "But this simple defense stop it.",
        "26... Qh5 27. Qxd5+": "And now I felt confident for the win.",
        "27... Nf7": "Forced",
        "28. e4": "GK computer found out a nice tactic : 28. Rc1 Bxe3 29. Rxc8! Rxc8 30. Qe6 Rf8 31. Qxe3",
        "28... Rd8 29. Qc4": "Only square, but it is fine as d2 is under control",
        "29... Kh8 30. Qb4 Rd6": "I intended to trap my opponent, as 30...Be3 (or Bc7) is faced with Qc3 wining the bishop thanks to the Qxg7# threat. I was expecting 30...Ba7 31 Qc3 Rg8.",
        "31. Qc3": "So I forked anyway. Again I missed a tactic here : 31.Rd1 !! as 31... RxR is countered by 32.Qf8+ Kh7 33. Qxg7#.",
        "31... Rg6+": "Forced to counter the mat",
        "32. Kh2": "! Never too late to loose ! After 32.fxRg6 ?? Qxh3#",
        "32... Nd6 33. Rd1": "The knight is not protected as the g6 rook must protect g7",
        "33... Bxf5": "Desperate. GK computer proposes the sharp : … Ne8 34. Qxc8 Rc6 ! 35. Bxg7+ Kh7 36. Qxb7 Qxf3 37. Bd4+ Bc7 38. Qxc6 Bxf4+ 39. Kg1 Qxd1+ 40. Kg2 Qe2+ 41. Bf2 Nd6 with a +5, but I would still not be confident there is no perpetual check in such an open position with the queens on board.",
        "34. exf5 Nxf5 35. Qc8+ Kh7 36. Qxf5 Bg1+": "Last boulet",
        "37. Rxg1": "37.Kh1 ??? Qxf3#\nHere my opponent resigned, after QxN it is an easy mate. \nThanks for watching, feel free to leave coments."
    },
    "url": "https://gameknot.com/annotation.pl/team-match?gm=65919",
    "gameName": "Team match",
    "players": "riwulof (1956) vs. mrkiivan (1957)",
    "opening": "Queen's pawn (A40)"
}