{
    "moves": {
        "1. d4": "In this game was I in bad positions and piece-underdog at several times, but find a way, (maybee with help of my opponents mistake, but I also did some) to change -9,6 to +12,3 and won the game by turning the advantage around.",
        "1... d5 2. g3 Nc6 3. Bg2 Nf6 4. Nf3 Bf5 5. a3 e6 6. Nc3 Ne4 7. Nxe4": "This move told the computer analyze as:Inaccuracy: -1.14, but in my mind was the next move NxNc3 and 2 pawns at c-line was not interesting to have!",
        "7... Bxe4 8. O-O h6 9. e3 Be7 10. Nh4": "And here did I a mistake, was in thought that opponent would capture Bg2 first, and forgotted that opponent moved Be7 in capturing psition for Nh4, which also went the nevt move. ",
        "10... Bxh4 11. Qg4": "so I had to move Qg4 to stop the away taking of defending pawns forward the King, now was I in piece-underdog for a while of 13 moves,",
        "11... Bxg2 12. Kxg2 Bf6 13. c3 O-O 14. e4 dxe4 15. Bxh6 Ne7 16. Be3 Qd5 17. f3 exf3+ 18. Rxf3 Ng6 19. h4 Qb3 20. Bc1 Qc2+ 21. Kh3 Rad8 22. Rf1 e5 23. h5 Ne7": "And here by the treath to Ng6 did opponent missed that Bf6 went unguarded by N:s moving,",
        "24. Rxf6": " and the piece advantage was over",
        "24... exd4 25. h6 Qh7 26. cxd4 Ng6 27. Rf5 gxh6 28. d5 Qg7 29. Rh5 Rfe8 30. Bxh6 Qxb2 31. Rf1 Re2 32. Qf5 Rh2+ 33. Kg4 Qe2+ 34. Qf3": " Here was my position worse, I  had maked a: Blunder: -9.64 told me the computer analyze after end of game. Rf3 had been better, but it went no piece losing............  ",
        "34... Qc4+ 35. Bf4": "And the check stopped with this move, and my thought was Rxh5 but ...........",
        "35... Ne5+": "another move which maked the -9.6 to +3.78",
        "36. Rxe5": "I had to capture by Rxe5",
        "36... f6": "and to let Q came in at B: kingside and check instead of move R from e5",
        "37. Kf5 fxe5": "As expected captured B W:s R At e5",
        "38. Qg4+": "And my first check came",
        "38... Kf7": "perhaps had Kf8 been better, but h6+ had leaved B:s Q for capturing and Kh8 also by Bxe5, so....",
        "39. Qg6+ Kf8": "Here could I check with Bh6+ and captured B: R after Rxh6 ",
        "40. Qf6+": "but choised to check by Qf6+ which could give me opportunity to capture B:s  Rd8, if  K:s move went back to g8",
        "40... Ke8 41. Qxe5+": "here have I to make a possibility for W:s  Rook at 1-line to check later",
        "41... Kd7": "And here have the score become +12.21",
        "42. Qe6#": "CHECKMATE!"
    },
    "url": "https://gameknot.com/annotation.pl/team-match?gm=58053",
    "gameName": "Team match",
    "players": "gustert (1472) vs. scarecrow1167 (1549)",
    "opening": "Queen's pawn game (D00)"
}