{
    "moves": {
        "1. e4 c5 2. Nf3 Nc6 3. d4 cxd4 4. Nxd4 Nf6 5. Nc3 e6": "This allow a special variation - played by people with 2600 ELO, so I guess it is fine, but it allow white to hunt black or interrup his game a bit, example is this game \nTopalov,V (2690) - Illescas Cordoba,M (2600) [B45] \nESP-chT Div 1 Cala Galdana (4), 11.11.1999\n1.e4 c5 2.Nf3 e6 3.d4 cxd4 4.Nxd4 Nf6 5.Nc3 Nc6 6.Nxc6 bxc6 7.e5 Nd5 8.Ne4 Bb7 9.c4 Nb4 10.c5 Qb8 11.f4 Ba6 12.a3 Bxf1 13.Rxf1 Nd5 14.Qd4 Be7 15.f5 exf5 16.Rxf5 0-0 17.Bd2 f6 18.0-0-0 fxe5 19.Rxe5 Qb3 20.Bg5 Rae8 21.Bxe7 Ne3 [21...Rxe7 22.Rxe7 Nxe7 23.Qc3] 22.Nf6+ 1-0\n\n",
        "6. Nxc6 bxc6 7. e5 Nd5 8. Ne4": "The weak spot is d6, so keeping the pressure here is the right thing to do.",
        "8... Qc7 9. f4 d6": "9.-,d6? is a mistake, probably better to develop a bishop, i.e. Bb7 or Qb6 followed by Ba6.\nThis is also violating the opening principle of not moving the queen too often (with a few exceptions) in the beginning, develop the pices instead.",
        "10. Nxd6+ Bxd6 11. exd6 Qa5+": "Black could not play 11.-,Qxd6 due to the binding, i.e. white would play 12.c4 and the night can not move because it will loose the queen, but this is no fun for black either.",
        "12. Bd2 Qc5 13. c4": "I want to move the night, so that I can play b4 and consolidate the pawn on d6, that will be really difficult for black to play if I can do that.",
        "13... Nb6": "13.-,Nb6?! I was expecting 13.-,Ne3 and planned to play Qb3 to cover the pawn on c4 (and save the queen).",
        "14. b4 Qd4 15. Rc1 O-O": "I understand that black want to get the king to a safe place, but 15.-,c5 would probably have been better, it interrupts whites plan with c5 and open up for the c8 bishop.",
        "16. c5 Nd5 17. Rc4": "Keep pushing",
        "17... Qf6 18. Qa4": "The natural move 18.Bd3 is not good because of Ba6, the queen move prevents this and put pressure on c6.",
        "18... Bd7 19. Be2": "Another good move was Bd3, the threat Qa1+ is not serious due to Rc1.",
        "19... e5": "There is not a lot black can do, this open the line for his bishop, but also open the f-line for white.",
        "20. O-O exf4 21. Bxf4 Nxf4 22. Rcxf4 Qb2 23. Bc4": "Black resigned, there is not a lot to do about the pawn on f7."
    },
    "url": "https://gameknot.com/annotation.pl/team-match?gm=39018",
    "gameName": "Team match",
    "players": "hvalsoe (1887) vs. abraxas44 (1790)",
    "opening": "Sicilian (B33), Pelikan (Lasker/Sveshnikov) variation"
}