{
    "moves": {
        "1. e4 e6": "I play the opening I always use as Black against the King Pawn, the solid French Defence.",
        "2. Nc3": "Unusual. Usually, White plays d4 to occupy and, temporarily, control the centre. This move is perfectly playable and will probably transpose into a Winawer Variation (2.d4 d5 3.Nc3 Bb4).",
        "2... d5": "According to plan. Black almost always plays this move to challenge White's central gains, otherwise he risks being forced into passivity and cramp. An interesting option, it is worth mentioning, is 2...c5?!, which I value only as a move which confuses my opponent :-).",
        "3. d4 Bb4": "Transposing fully into the Winawer Variation.",
        "4. e5 c5 5. a3 Bxc3+ 6. bxc3": "Main line.",
        "6... Ne7 7. dxc5 Qa5 8. Qd4 Nbc6": "Putting pressure on White's advanced central e-pawn: this is, it could be said, the core theme of most French variations.",
        "9. Qd2 Nxe5": "No pressure needed, really. The central pawn gives up without a fight.",
        "10. c4 Qxd2+ 11. Bxd2 Nxc4 12. Bxc4 dxc4": "After the melee, Black has managed to gain an extra pawn, and consolidated it by exchanging most minor pieces AND the queens off!",
        "13. Nf3 b6": "Trying to get rid of the irritating c5-pawn.",
        "14. Be3 bxc5 15. Bxc5": "14...b5 solidifies Black's c-pawn, but gives White a passed c-pawn. I opted to keep my c-pawn isolated but get rid of White's.",
        "15... Nc6 16. O-O Ba6 17. c3 O-O-O": "I know, it's not much of a castling position. But I need to connect my rooks, and take over the open d-file.",
        "18. Ng5": "Annoying, but I think I can push off all forking threats.",
        "18... Rd7 19. Rad1 Rhd8": "After 19...Rxd1 20.Rxd1, Black has a hanging f-pawn AND has lost control of the open d-file. Naturally I preferred to double up my rooks on the d-file and maintain defence on the f-pawn, even though it loses the h-pawn.",
        "20. Rxd7 Rxd7 21. Nxh7 f6": "Stopping the knight from retreating - I hoped. Maybe I could turn my irritating loss of my extra pawn into a cunning knight trap!",
        "22. Nf8": "Apparently not.",
        "22... Rd5 23. Be3 e5 24. Ne6": "The knight is prancing about trying to mess up my pawn-structure.",
        "24... g5 25. Nc5 Bb7 26. Nxb7 Kxb7": "The irritating pony is exchanged off: time to bring in some cannon.",
        "27. h3 Rd3": "This doesn't win any material at all, but it ties White's rook down to a particularly inactive square.",
        "28. Rc1 Ka6": "Time for my king to be active. In this kind of endgame, every piece counts - a cliche, I know, but a useful maxim.",
        "29. g3 Ka5 30. Bc5 Rd5": "Once enough of White's pieces are overworked, I can start snapping off pawns! (preferably my opponent's)",
        "31. Bb4+ Ka4 32. Rb1 Nxb4": "I opt to exchange my c-pawn for his a-pawn, because I think I can then win the c-pawn and be left with an extra passed a-pawn. Sounds good to me!",
        "33. Rxb4+ Kxa3 34. Rxc4 Rd1+ 35. Kg2 Kb3 36. Rc6 Rc1": "Operation \"Win the C-Pawn\" but, unfortunately, I lose my f-pawn. However, I think I still have an advantage - my 2 kingside pawns should hold off White's 3, while my a-pawn races to victory!",
        "37. h4": "Oh dear. That really annoys me. I have no option but to allow White a passed h-pawn.",
        "37... Rxc3 38. Rxc3+ Kxc3 39. h5": "Oh dear. White is well ahead in the pawn promotion race - by 2 moves.",
        "39... a5": "Run, run, run!",
        "40. h6 a4 41. h7 a3 42. h8=Q a2": "So near, and yet so far.",
        "43. Qa8": "Here the real irony of the position shows itself: White cannot stop Black from queening, unless of course he keeps checking Black's king, which leads to a draw. White can get a win, but he will have to be careful: he can repeatedly check Black while gathering up his pawns, THEN allow Black to queen, exchange queens and promote his pawns. This is his longer-term win: there is not quick win here.",
        "43... Kb2 44. Qb7+ Ka3": "I offered a draw, my opponent accepted."
    },
    "url": "https://gameknot.com/annotation.pl/team-match?gm=22498",
    "gameName": "Team match",
    "players": "jtft (1447) vs. fatcat2 (1421)",
    "opening": "French (C00), Pelikan variation"
}