{
    "moves": {
        "1. e4": "I believe that it's the first time in my life that I succeed a game in  five moves with a queen sacrifice. Can you find, please if he had another solution.\n\"ok boss, let's go\"",
        "1... e5 2. d4": "Center game. \"The second central scout squad, it's your turn\"",
        "2... exd4": "\"Bad luck for you second central scout squad\"",
        "3. c3": "\"The c scout squad is now reluctant to accomplish his duty but has to  go anyway\"",
        "3... dxc3": "\"We shall revenge you, c scout squad\"",
        "4. Nxc3": "Lasker variation. I like it. \"See, the first motorised regiment has liquidated the ennemy\"",
        "4... Bb4": "Doesn't aim at the center which is even more important because of the open files",
        "5. Bd2": "\"Protect the GQ\"",
        "5... Nf6 6. Bd3": "To develop as quickly as possible to use the initiative given by the gambit.\n\"By our informations, the adversary will set is GQ on g8. Occupate the battlefield center and aim a machine gun on his position.",
        "6... O-O 7. Nf3": "\"General mobilisation\"",
        "7... c6 8. O-O": "\"Headquarters in safety\"",
        "8... Qc7": "Mistake, the black pieces are blocked in the corner.\n\"The heavy armored black regiment  aims at our headquarters\"\n",
        "9. e5": "To free the b1 h7 diagonal for the bishop.\n\"Go and explore the terrain, you feel lonesome but I don't care\"",
        "9... Ng4": "\"Boss, a black motorised compagny comes near\"",
        "10. Re1": "Carrying on developing. There is only one black piece on the right\n\"Everybody ! Go out\"",
        "10... Re8 11. Ng5": "\"Now, attack !\"",
        "11... Nxe5 12. Qh5": "It's finished, mate in four moves (appart of the possible sacrifices from queen, knight or rooks) I don't see what black can do to avoid it. But if you find a way...",
        "12... h6 13. Qxf7+": "queen sacrifice. Black has to take to avoid the mate (if13. ... h8, 14. Qxe8)",
        "13... Nxf7 14. Rxe8+": "Black has only one move",
        "14... Bf8": "Forced move.",
        "15. Bh7+": "Black submited there but I add the mate.",
        "15... Kh8 16. Rxf8#": ""
    },
    "url": "https://gameknot.com/annotation.pl/team-match?gm=48703",
    "gameName": "Team match",
    "players": "ptitroque (1662) vs. lulu-m (1627)",
    "opening": "Danish gambit (C21), Collijn defence"
}