{
    "moves": {
        "1. e4 e6 2. d4 d5 3. Nc3 Bb4 4. e5 c5": "Typical French setup. White has grabbed a bit more space, which constricts the movement of the black pieces, but the centre pawns of white are also easily contested, which is what black will try to exploit in order to get to a middle game in which his e- and d-pawn will be free to march onward and create a lot of danger in the white position. I often struggle against this opening, so French experts may find my play rather inaccurate.",
        "5. a3 Ba5 6. Nge2": "Already inaccurate? I noticed in de GK database, that b4 is the conventional move here, after which black takes either pawn and white can gain it back at some point after playing 7. Nb5. The played move quickly leads to some trouble with my centre.",
        "6... cxd4 7. Nxd4 Ne7 8. Bd2": "Maybe f4 would have done a better job of maintaining the centre here, although the threat of Nc6, with d5 upon retreat and a monster of a centre after exchange. Maybe the best solution would be b4, followed by f4?",
        "8... Nbc6 9. Nf3": "Any exchange at c6 will lead to an extremely powerful centre for black, along with a half open b-file, which I feared would create too much play for black. After 9. Bb5, a6 would follow and I would be forced into the unwanted exchange.",
        "9... a6 10. Bd3 d4 11. Ne4": "This cuts off my influence over g6 and prevents my queen from being capable of covering e5, pretty much dooming e5. However, the knight occupies a very active square on e4 and I decided I would much rather position all my pieces nicely, rather than desperately hanging on to the pawn while awkwardly placing all my pieces\n",
        "11... Bc7 12. Nfg5": "The pawn is lost anyways, since Bf4 would be answered with Ng6. Therefore, I invest my time into positioning my pieces more agressively. Black will most likely castle short some time soon now and at that point I will have all of my pieces eagerly jumping the king side. This knight moce adds to that effect both because the knight becomes more agressive ths way and opens up my position to facilitate Qh5 and f4.",
        "12... Nxe5 13. f4": "grabs some space",
        "13... Ne5g6": "Nxd3 may be better, since black might want to quickly move into an end game, given that he has a pawn advantage at this point and after xd3, the pawn structure of white is suboptimal. Maybe black was not interested in offering up the c-file?",
        "14. O-O": "conveniently defends f4",
        "14... O-O 15. Nxh7": "Adventure time! I couldn't fully calculate everything from here, but I felt that if I wanted anything out of this game, it would have to be through an attack, given that I am down material, but have my pieces exquisitely positioned at his king. Holding out on this move would allow black to play h6, which would complicate my attacking options.",
        "15... Kxh7 16. Qh5+ Kg8 17. Bb4": "This move is important, as it makes it harder for black to create an escape route for his king... At least that was my thinking during the game. The GK computer analysis strongly disagrees and calls this move a blunder. The proper defense against this move will be outlined later in this annotation. I myself considered the strong defense a sign that the initial sacrifice of the knight was wrong, but the GK computer considers THIS to be the blunder giving white an advantage of 0.41 after the following line (I do not fully understand it myself, but it's posted here so it may be discussed): 17. Ng5 Re8 18. g4 Ba5 19. f5 exf5 20. gxf5 Bxf5 21. Nxf7 Bxd2 22. Nxd8 Bxd3 23. cxd3 Raxd8 24. Qg4 Kh8 25. Qh5+ Bh6",
        "17... Qd5": "Not the right defense. As we will see, white's active pieces will make quick work of blacks position. While black's position was not particularly easy to defend, there seems to be a solution to it. Since the lines are not forced, there are a lot of options, so I guess we might first consider the less reasonable ones before coming to the one that appears the strongest and was suggested by the GK computer. The knight on g6 can not move, because of Nf6 xf6, Qh7#For this reason neither Bxf4 nor Nxf4 is an option. Removing the pin on the knight by playing 17....Re8 seems to be too slow because of 18. f5 leading to for example A) 18....Nxf5 19. g4 Nh6 20. Rxf7 Nxf7 21. Qxg6 Bd6 22. Nxd6 Nxd6 23. Qh7 Kf7 24. Rf1 Nf5 25. xf5  Qg5 26. Kh1 with a very vulnerable king for black, B) 18....Nf4 19. Rxf4 Bxf4 20. Nf6 xf6 21. xe6 xe6 22. Qh7 Kf8 23. Bg6, or C) 18....xf5 19. Bc4 Be6 20. Bxe6 xe6 21. Ng5 Nf8 22. Qf7 Kh8 23. Rf3 Ng8 24. Qh5 Nh6 25. Nh7. While none of these lines are forced and I may have missed something, it seems like it is very hard to defend after 17....Re8. The correct defense is therefore to immediately move the knight on e7 to a better defensive position. From the GK computer: 17....Nd5 18. Ng5 Nf6 19. Qh3 Bd6 20. Bxg6 fxg6 21. Bxd6 Qxd6 and white basically simply stays a full piece behind. I may myself have opted for 17....Nd5 18. Bxf8, but at that point the attack will also mostly have died down and two pieces for a rook is generally not a very favourable trade.",
        "18. Ng5 Re8 19. Bxg6": "And black resigns, as he can't deal with both Bxf7 and Qh7-h8. I am sorry for the giant walls of text and (most likely) the need for a chess board to follow all the lines. I hope you still enjoyed the annotation and found the game interesting. If someone could tell me if there is a way to better edit the text, so I can make paragraphs, rather than big walls of text, I could maybe make this even a bit more readable. "
    },
    "url": "https://gameknot.com/annotation.pl/team-match-masters-of-the-game-vs-the-white-knight?gm=57773",
    "gameName": "Team match Masters of the game vs The White Knight",
    "players": "martenp (1835) vs. degfitzgibbon (1811)",
    "opening": "French (C17), Winawer, advance, 5.a3"
}