{
    "moves": {
        "1. e4": "Please evaluate and criticize.\r\n\r\ne4.  Standard opening usually met with e5 or c5.  I always take the other route.",
        "1... Nc6": "The Nimzovitch!  Grabs control of the center and developes a minor piece.  Sound opening principles.",
        "2. Nf3": "Nf3.  The best defense.  Covering the attacking squares and moving one step closer to castling.",
        "2... Nf6": "Nf6.  Attacking the pawn and covering the remaining two center squares.  Note: if e5 is played then Ng4 is fun but Nf5 is more sound.  Moving into an Alekhine line.",
        "3. Nc3": "Nc3.  Developing a piece, controlling key squares, and protecting the e4 pawn.  This game could transpose into many lines, more often to the 4 knights.  4 Knights is too common and boring.  So I move to...",
        "3... d5": "d5!.  Immediate pressure in the center. e5 is met with Nd7 and then to a standard Alekhine line.  exd5,Nxd5 is playable but then leads to equally developed pieces.  This is one of my goals as black.  Usually a piece behind in the opening, it feels good to have my stallions out against his.",
        "4. d3": "d3.  Too safe for me.  Protecting the e pawn and opening lines for the dark squared bishop.  I think I'll add more pressure to the center, as d4 is weak.",
        "4... e5": "e5.  More pressure on d4.  I'd like to put a knight there one day.  I could have played more aggressive though with ..dxe4, dxe4 Qxd1, Nxd1 Nxe4.  That would be ideal, disrupting his castling ability and gaining a pawn.",
        "5. Bg5": "There goes that plan. Bg5.  This helps with my development but makes d5 EXTREMELY weak.  I have to protect that square.",
        "5... Be6": "Brings out a piece and covers the weak square.  The first idea of Be7 develops and helps castling but loses to exd5.",
        "6. exd5 Bxd5": "I'll take it!  Development may have been better since everything was covered for him.  Let the exchanges begin!",
        "7. Nxd5": "Take.",
        "7... Qxd5": "Take.  Oh no! My Knight!",
        "8. Bxf6": "Ouch.  There goes my kingside developement.",
        "8... gxf6": "Always take inwards with the pawns.   Funny enough this strengthens my pawn on e5 and opens a file for my rook.  I wouldn't castle king side if I were him.  Also my King is now ready to castle queen side.",
        "9. Be2": "Developes a piece and looks like he is gonna castle.",
        "9... h5": "Starts a Kingside attack.  Probably a bit too early but it does allow me to move my bishop to h6 whenever I please since the rook will cover it.",
        "10. c4": "The attack begins!  I need to move the Queen.  f6 is weak as well as b7.  His weaknesses are b2 and g2.  Time to devise a plan.  The king is opened now with only one defender.  See the tactic?  Here it comes.",
        "10... Bb4+": "Bb4!.  forcing the Knight to defend or else he loses the ability to castle or sacs his Queen.",
        "11. Nd2": "Kf1 was better.",
        "11... Qxg2": "BAM.  In there like swimwear.  No Kingside castle for you! Not yours!",
        "12. Bf3": "Uh oh.  Not to worry.  Exchanges will ensue.  I can still castle, control the center and have great positional advantage.",
        "12... Bxd2+": "I like bishops but the center is still 'kinda' closed.  I'll keep my knight.  Open positions require bishops, closed positions require knights.",
        "13. Kxd2": "Only way to protect  the bishop and rook still but leaves a weak f2.",
        "13... Qxf2+": "Ta Daaaa.",
        "14. Qe2": "lets take'em off.",
        "14... Qxe2+ 15. Bxe2 O-O-O": "Nice.  I have achieved control of the center, protected king and an outpost for my Knight.",
        "16. Rhf1": "my weakest square but easy to protect.",
        "16... Rh6 17. a3": "Stopping the Knight but giving me more time.",
        "17... Nd4": "my knight loves it there and seeks the fork on b3.",
        "18. Bd1": "protects the square b3 but disconnects the rooks.",
        "18... f5": "Uses the Knight as protection,pushes my only passed pawn and opens up the 6th Rank.  Every move should be Offenseive and Defensive.",
        "19. Kc3": "His king is closer to the center, breaks a future pin, and if e5 falls then he can take my knight.  I would have worked my out of place rook into the game.",
        "19... f6": "Protecting e5 but cutting off my rook.  My knight is permanent now though.",
        "20. Bf3": "Connects the rooks.  Maybe a queenside pawn storm was better?",
        "20... Ne6": "Eyeballin the d3 square.  With my excellent pawn position I would love to trade everything off soon.",
        "21. Bd5": "Oops.  Missed that.  There are many outposts though for me.",
        "21... Nf4": "Protecting the check on e6 and outposting my knight.",
        "22. Rad1": "Protecting a weak square.  But this leads to.",
        "22... Nxd5+": "Take.",
        "23. cxd5": "Take.",
        "23... Rxd5": "Take.",
        "24. Rxf5": "Take.",
        "24... Kd7": "All was calculated. ",
        "25. d4": "Cracking open the center and my Rook is going to open up.",
        "25... c5": "If he sleeps then I can get in exd4 , Kc4 Rxf5.",
        "26. Kc4": "Remember before?  I want to trade everything off and push my powerful pawns in the center forward.",
        "26... Rxd4+ 27. Rxd4+ cxd4": "Look at that pawn chain.",
        "28. b4": "Here he comes.",
        "28... Kd6": "cutting off his king.  direct opposition would result in a check.",
        "29. h4 a6": "his king is totally cut off now.",
        "30. a4": "trying to create a passed pawn.",
        "30... b6": "any move results in a freeze.",
        "31. b5 a5": "pawns are frozen but more importantly he is in zugzwang.  my goal once he started moving those pawns.  remember to count the moves out.  zugzwang sucks, especially for the opponent.",
        "32. Rf3": "Any king move and I'd push into the center with my king.  Now I can open up.",
        "32... Rg6 33. Rf5 Ke6": "attacks the Rook but....",
        "34. Rxh5": "BLUNDER.  Sike.  Look at his king.  His rook is totally out of the game now.",
        "34... Rg3": "oops.  Where can he go now.",
        "35. Rh8": "Doesn't matter where he goes.  His only option would be a check on e5 but pawn take or king take results in the same.",
        "35... Rc3#": "Checkmate!  Ahhhhh.... the glorious feeling of victory.\r\n\r\nPlease message me or comment with any ideas or criticism."
    },
    "url": "https://gameknot.com/annotation.pl/team-match?gm=14175",
    "gameName": "Team match",
    "players": "budul (1462) vs. boogaloo (1406)",
    "opening": "KP (B00), Nimzovich defence"
}