{
    "moves": {
        "1. e4 c5": "The Sicilian Defense is probably the best example to illustrate the advances and progress in chess opening theory over the years. By advancing the c-pawn two squares, Black asserts control over the d4 square and fights for the center. Once thought to be passive, it has grown to become one of the most combative options for Black. The queenside pawn advance provides a local spatial advantage - breaking symmetry early which will influence development for both sides providing both flexibility and a latent power.",
        "2. Nf3": "With 2.Nf3, White intends to play d4, opening the d-file and taking charge in the center, not with two pawns on e4/d4, but with a pawn and a knight with open lines and natural squares for piece development.",
        "2... Nc6": "Perhaps the most natural developing move preparing Nf6 without committing to a particular pawn structure, although this is hardly a neutral move.",
        "3. d4": "White thrusts forward to initiate the exchange.",
        "3... cxd4 4. Nxd4 Nf6": "Black begins to fight back with this developing move, aiming at the unprotected e-pawn, which in turn leads to the natural Nc3 to develop and protect.",
        "5. Nc3 e5": "The Sveshnikov (Lasker-Pelikan) variation. Black immediately fixes the pawn formation in the center with the seemingly anti-positional ...e5 which leaves Black with a backwards d-pawn and weakness on d5. At one point, this move was regarded as a clumsy minor variation, but the efforts of Evgeny Sveshnikov, confident in the correctness of the strong pawn center, have propelled this to one of the most influential variations of the Sicilian Defense. It has become popular due to the sheer inexhaustible resilience of Black's position which suggests that the harder White hits, the harder Black hits back, yet White cannot afford to play passively. ",
        "6. Ndb5": "The theoretically critical move which threatens Nd6+. All other moves are considered to allow Black easy equality, if not the advantage. 6.Nb3/Nf3 are met by 6...Bb4 threatening to win the e-pawn. 6.Nf5 allows the powerful 6...d5. And 6.Nxc6 is met with 6...bxc6 where the extra pawn in the center gives good play.",
        "6... d6": "By moving the pawn forward, protected by the Queen, Black does not allow 7.Nd6+ Bxd6 8.Qxd6.",
        "7. Nd5": "The classical variation is to play the aggressive Bg5 to strengthen the grip on d5 and introduce the possibility of taking the knight forcing Black to take back with the g-pawn (where the doubled f-pawns have been demonstrated to be a dangerous weapon by Black). 7.Nd5 is the main alternative, where White uses his control over d5 to bring about a change in the pawn formation where he is banking on the queenside pawn majority to be of more importance that Black's central advantage.",
        "7... Nxd5": "As both of White's Knights were controlling the forking square of c7, Black must accept the exchange.",
        "8. exd5 Nb8": "Another seemingly unnatural move - Black's knight has been kicked from c6 and retreats to redeploy at d7.",
        "9. c4": "White here has a number of options (c4, a4, c3, and Qf3), with c4 remaining as the most popular to work the queenside pawn mass and consolidate the position.",
        "9... Be7": "Both Black and White's next few moves are quite natural - Black will play Be7/Nd7/O-O, while White develops his King's bishop to castle as well.",
        "10. Be2 O-O 11. O-O Nd7": "Bringing the Knight back into the game to the best available square with the ability to jump to the important f6/e5/c5/b6 squares as required.",
        "12. b3": "With this move, White develops a strong queenside pawn chain, giving his Queen's bishop extra options for development.",
        "12... a6": "Black intends to fight back through the Kingside, but first kicks back the aggressively posted knight.",
        "13. Nc3 f5": "Black begins to work the Kingside, using the f-pawn either for direct attack or securing the space advantage.",
        "14. f4": "White seeks to undermine Black's maneuvers. To immediately take is a mistake that allows White to further develop resulting in the d-pawn isolani, and to immediately advance leaves Black with a somewhat cramped and awkward position.",
        "14... Bf6": "The best move I felt, allowing White to initiate the exchange, but improving the development  of Black's pieces, giving the bishop more scope.",
        "15. fxe5": "An innaccuracy, I suspect, as it may have been stronger to develop White's Queen or Bishop first as this provides some counterplay for Black.",
        "15... Nxe5": "Bxe5 was probably just as strong (where dxe5 concedes an advanced central passed pawn), but with Knight takes, there is the discovered attack of Nxc4 on the hanging knight by the bishop potentially winning a pawn.",
        "16. Ba3": "White looks to load up on the weak d-pawn, but misses the threat of Nxc4. Better would have been perhaps the simple Qc2. Once the a1-h8 diagonal is cleared out, with Black's bishop remaining, White's dark squared bishop will be quite limited.",
        "16... Nxc4 17. Bxc4": "17.bxc4 Bxc3 18.Rc1 Be5 was perhaps a stronger alternative for White.",
        "17... Bxc3 18. Rc1": "A natural move for White - kicking back the bishop and taking command over the open c-file, but damping options for the a3 bishop.",
        "18... Be5 19. Rf3": "Lifting the rook, although I'm not certain what the purpose of this was. Stronger and simpler in my opinion would have been Re1 to take the other file (perhaps allowing his dark squared bishop to be free due to it's pin on the rook through the d-pawn which could be decoyed through Rxe5)",
        "19... b5": "b5 not only gains space on the queenside, but threatens the dark-squared bishop which has no retreat (not the tall pawn bishop) with b4 threatening a queenfork if White accepts the pawn.",
        "20. Bf1 b4 21. Bxb4": "21.Rxc8 Rxc8 22.Bc1 was another option.",
        "21... Qb6+": "Winning the Bishop.",
        "22. Kh1 Qxb4 23. Rc4": "Black is now up the bishop pair on an open board. White looks to threaten and displace the queen, perhaps forming a battery on the c-file.",
        "23... Qa3": "Attacking the undefended a-pawn, but looking to draw White's Queen to the second rank in order to play Qb2 on the diagonal commanded by the dark squared bishop to trade down the Queens.",
        "24. Qd2 Qb2 25. Rc2": "White initially declines the trade...",
        "25... Qd4": "But the trade is pretty much forced due to threats of Qh4",
        "26. Qxd4 Bxd4 27. Bd3": "White looks to load up on and win the f-pawn",
        "27... Bb7": "And Black is willing to lose it for White's d-pawn, centralising the bishops.",
        "28. Rxf5 Rxf5 29. Bxf5 Bxd5 30. Rd2": "Black looks to attack both undefended bishops, but a back-rank mating threat exists, nullifying this effort.",
        "30... Re8": "Threatening Re8#",
        "31. h3": "White creates a luft to give his King some breathing room, but mate is now forced. 31.Rd1 Re2 would have held on for longer, but the game was still lost.",
        "31... Re1+ 32. Kh2 Be5+ 33. g3 Rh1#": ""
    },
    "url": "https://gameknot.com/annotation.pl/team-match-pretty-sveshnikov?gm=47776",
    "gameName": "Team match - Pretty Sveshnikov",
    "players": "N.N. (1691) vs. tisamon (1867)",
    "opening": "Sicilian (B33), Pelikan, Bird variation"
}