{
    "moves": {
        "1. d4": "Queen's pawn opening ! Black can play the benoni which I'm working in the moment.",
        "1... Nf6": "Modern benoni, first move.",
        "2. Nc3": "But it's not the expected move. No benoni for this time.",
        "2... d5": "Black had no precise idea about wht to do and changes his plan.",
        "3. Nf3": "We go for the boring four knights opening.",
        "3... c5": "Now it looks more like a sicilian of some sort.",
        "4. Bg5": "Not a very efficient move when the e pawn is still in the starting block.",
        "4... Ne4": "I'm not sure about this move. If white takes with the knight, black will have a double pawn difficult to defend and has moved twice the same piece. On the other hand, by playing f6, black can easily drive away white's DSB and the knight at the center menaces the white knight and the bishop.",
        "5. Bd2": "White chooses to retreat his bishop, probably fearing 5. ... Nxc3 6.bxc3, doubling the c pawn.",
        "5... cxd4": "Trading",
        "6. Nxd4": "trading",
        "6... e5": "Settling in the center and opening diagonals for the DSB and the queen.",
        "7. Nf3": "Retreating and menacing the e pawn.",
        "7... Nxc3 8. Bxc3 e4": "The d pawn is now weak but can be protected, by 9. ... Be6.",
        "9. Nd4": "Good place for a knight on the center if it cannot be attacked by the pawns.",
        "9... Bc5": "Black has to develop and the f2 square is an interresting target.",
        "10. Nb3": "attaécking the bishop.",
        "10... Qd6 11. Nxc5": "White trades ",
        "11... Qxc5 12. Bxg7": "apparently a good move, winning a pawn and menacing the h rook.",
        "12... Rg8": "To drive the bishop away and occupate the half open file. The drawback is that black will have to caslte long and the king on c8 won't be safe at all.  To stay on the center will not be safer as the two central pawns are far away from home. As black has 4 pieces out against one for white, black has the initiative and it balances the unsafe king position (but may be not the late in material).",
        "13. Bd4": "obliging black to lose one move to retreat.",
        "13... Qa5+": "Undangerous check",
        "14. c3 Be6": "so that the queen is no more necessary to protect d5",
        "15. e3 Nc6": "All of black's minor pieces are out now and white has still a bishop in his garage (and need 2 moves to leave because of the menace 16. Be2 Rxg2) ",
        "16. Bf6": "To prevent black to castle but a mistake anyway because the DSB will have to move twice. I believe that Better would have been 16. g3 to prepare a fiancheto.",
        "16... Rg6": "The bishop has to leave.",
        "17. Bh4 f6": "Just to permit the castle",
        "18. Bg3": "Probably to prevent the castle but it's a mistake to me because black gets more and more developed and white has only 3 pieces out. And it doesn't prevent black to castle anyway. Furthermore, I think theat the fiancheto on g2 would have been the best option for white and it is now more difficult.",
        "18... O-O-O": "So, black developpement can be considered as completed. Both kings are unsafe (although white can still castle and the black king cannot move on b8). Black is better on the center, The semi open file g is under black control, black is in late in material, White's pawn structure is better but underdevelopped. Black occupates far more field than white.",
        "19. Be2": "To permit the castle",
        "19... d4": "Black's plan is to attack on the center before white can castle so that he can menace the royal pair.",
        "20. exd4 Nxd4": "The c pawn is pinned. Black could have played 20. ... Rxd4 21. Qc2 and then, and then... I had no idea how to prevent white to castle and unpined the c pawn. This is far more menacing.",
        "21. Qc1 Nxe2": "Expecting 22. Kxe2",
        "22. Kxe2": "Now, black has a winning sequence.",
        "22... Bg4+": "Better to attack with the bishop than withe the queen (by 22. ... Qb5+), to control the d1 square and because the queen can also come on black squares and the bishop not.",
        "23. f3 exf3+": "To enable the black queen to come on the e file.",
        "24. Kf2 Qc5+": "I do not see any option for white to avoid the mate in 4 moves.",
        "25. Qe3 Rd2+": "White submited here. Anyway, the king would have to move on line 1, black would take the white queen with mate to follow with queen on g2 or rook on line 1."
    },
    "url": "https://gameknot.com/annotation.pl/team-match?gm=49188",
    "gameName": "Team match",
    "players": "knightplay (1664) vs. ptitroque (1675)",
    "opening": "Queen's pawn game (A45)"
}