{
    "moves": {
        "1. e4": "This is a game out of two in a team match (I annotated both). Black makes an opening inaccuracy in Sicilian defence, and then slips for a combination that combined two common Sicilian tricks. ",
        "1... c5 2. Nf3 d6 3. d4 cxd4 4. Nxd4 Nf6 5. Nc3 a6 6. g3": "I play this move against the Najdorf Sicilian sometimes simply to avoid all the theory behind more common moves such as Bg5, Bc4 or Be3.",
        "6... b5": "This move seems dubious to me: black may have some problems with giving my g2 bishop targets to attack, and also with his lag in development, as happened in the game. ",
        "7. Bg2 Bb7 8. O-O e6": "Perhaps e5 was better.",
        "9. a3": "Black was threatening to win a pawn after b4.",
        "9... Nbd7": "As black, I would prefer Qc7 here. Be7 is bad due to e5! Bxg2 10. exf6 Bxf1 11. fxe7 Qxe7 12. Kxf1",
        "10. Bg5 Be7": "? Playing carelessly. Qc7, Qb6 or h6 were all better.\r\nWhat would you play here as white?",
        "11. e5": "! The start of a long combination which does not seem to win any material against best defence, but gives me a good attack and keeps black too busy to castle.\r\nBlack has two choices: Bxg2 as in the game, and 11 ... Nd5 12. Bxe7 Qxe7 13. Nxd5 Bxd5 (exd5 14. Nf5) 14. Bxd5 exd5 15. Nf5! and black is in trouble.",
        "11... Bxg2 12. exf6 gxf6": "Now after 13. Kxg2 fxg5 14. Nc6 Qc7 15. Nxe7 Kxe7 black seems to have defended successfully.\r\nWhat would you play here for white?",
        "13. Nxe6": "The key move! \r\nNow 13 ... fxe6 14. Qh5  Kf8 15. Bh6  Kg8 16. Qg4  Kf7 17. Qg7  Ke8 18. Qxh8  B(N)f8 19. Kxg2 wins a piece for white.",
        "13... Qa5": "? Qb6 was obviously better, as the queen can give a check on b7/c6 when desired, and also stays safe from being trapped by Nd5 - b4 - Nc3 sequence",
        "14. Ng7+ Kf8": "Kd8 had the disadvantage of occupying an important retreat square for the queen, and after 15. Kxg2 fxg5 16. Nd5! b4 17. axb4 Qb5 18. Ra5 Qb7 19. Kg1 white wins a pawn in a good position.\r\n(One last time and I'll quit bugging you:) What would you play here as white? (See next move annotation, I didn't play the winning move)",
        "15. Kxg2": "The best variation was 15. Bh6! Bxf1 16. Nd5! with all sorts of crazy threats, including knight checkmates and queen traps. \r\nEx: 15 ... Bc4?? 16. Ne6 ! Ke8 17. Ndc7 ! Qxc7 18. Nxc7  and Nxa8\r\nFritz gives black's best 15 ... Rc8 16. Qg4 as 5.5 points up for white, even though temporarily black is up a rook!",
        "15... fxg5": "Tough choice to make. Taking the bishop corrects black's pawn structure, but I believe the knight is a more dangerous piece, and after Kxg7 16. Be3 Ne5 17. Nd5 black survives with his horrible pawns until the endgame.",
        "16. Nf5 Qd8 17. Nd5": "White attack is extremely easy to play, while black has to make a tough choice literally every move!",
        "17... Bf6 18. Qh5 Bg7 19. Rad1 Ne5 20. Nde7 Nc4": "Seems like resignation to me. Black still could try to come up with some resilient defence, perhaps Ra7 or even Qxe7.\r\n20 ... Ng6 21. Rxd6 Qc7 also seems sensible.",
        "21. b3 Nxa3 22. Qxg5 Be5 23. Qh6+ Ke8 24. Rfe1 f6 25. Qg7 Kd7 26. Rxe5 fxe5 27. Rxd6+ Kc7 28. Nd5+ Kc8 29. Rxd8+ Rxd8 30. Qc7#": "I hope you enjoyed the game, please comment on the game as I probably have lost of mistakes in analysis."
    },
    "url": "https://gameknot.com/annotation.pl/team-match-game-1?gm=14271",
    "gameName": "Team match, Game 1",
    "players": "safin (1775) vs. adiadiadi999 (1763)",
    "opening": "Sicilian (B91), Najdorf, Zagreb (fianchetto) variation"
}