{
    "moves": {
        "1. Nf3": "This is a game that I should have won, but lost because I underestimated the strength of a knight against a rook\r\n\r\nReti opening - I don't know much about this so I looked in the opening database and made a move that leaves it up to white to start with ",
        "1... g6 2. g3": "The main lines convert to a QP game by d4 or c4. I decided to go for a line that would go for e5 and then f5 by black",
        "2... Bg7 3. Bg2 e5 4. d3 Ne7": "main line is 4....d5 which has a good win % for black but I fancied f5",
        "5. e4 O-O 6. O-O d6 7. Re1": "7. c3 is more common, then throwing forward the b pawn. I think white has surrendered any advantage of playing first by now. In terms of previous games we are rapidly entering unknown territory",
        "7... Nbc6 8. c3 h6": "need to discourage anything from going on g5 before pushing the f pawn forward",
        "9. Nbd2 Be6 10. Nf1 f5": "This is quite sharp because of the unprotected bishop on e6, but the f pawn is on a mission...",
        "11. exf5 gxf5": "going for the attack but that isolated h pawn will come back to haunt me in the end... I did not like Bxf5 because of Nh4, or Nxf5 because of d4 leaving me with an isolated e pawn because it is pinned against the bishop",
        "12. Nd4": "Looks clever but I don't think it is a good move",
        "12... Nxd4 13. cxd4 Qd7": "sacrificing the b pawn for a white square attack",
        "14. Bxb7 Rab8 15. Bg2 f4 16. b3": "He probably has to do this because of the rook and bishop homing in on b2 with danger on f2 if the rook ends up on the 7th rank. I was pretty happy here",
        "16... Bd5": "17.Bxd5 Nxd5 and there are lots of threats including f3 and Qh3, e4 with a discovered attack on the rook and then e3 or Nc3. The rook on the b file can also switch quickly to the king side. If white leaves the knight on f1 with a black knight on d5 it is hard to defend g2",
        "17. dxe5 Bxg2 18. Kxg2 f3+": "This is very strong but unfortunately black cannot quite force mate and white ecspes at the cost of some material",
        "19. Kh1": "19. Kg1 Qh3 20. Ne6 Nd5 and white can only avoid mate by sacrificing the Q. Now the rook can protect g2 and try as I might I could not find a mating variation ",
        "19... Bxe5 20. Rxe5": "If 20. Rb1 Qh3 21. Ne6 Nd5 22. Rg1 Nc3 wins rook for knight at least, with lots of other possibilities ",
        "20... dxe5 21. Ne3 Rbd8": "Here I said to myself that I was material up, could take the d pawn and swap queens, and then it would be plain sailing. What I should have done is looked at how weak my pawns were and kept the pressure on while I improved the position by swapping some of them off. White is very tied down by the need to defend the g2 square and by advancing the h pawn I could have brought the rooks into play. h5, Rf7, Ng6 would have been better, and thye queen swap would have been much better if the g4 square was not avaialble to the knight",
        "22. Ba3 Rf7 23. Rc1 Qxd3": "Big mistake.... h5 would have been better, followed by Nd6 and h4. Once the h file is open white is in trouble, and the f and c pawns can be defended long enough to press the attack",
        "24. Qxd3 Rxd3": "25 Rc2 was a trap because of 25....Nf5 26. Rc1 Nxe3 27. fxe3 Rxe3 and the two central passed pawns will soon win. However in setting this trap I failed to notice Ng4!",
        "25. Ng4": "threatening multiple forks. All my pieces are on the wrong squares, which is what you should think about before forcing a queen swap!",
        "25... Rg7 26. Nxe5 Rd2": "Looks OK but the a-pawn turns out not to be worth anything because the two black queen side pawns cannot work together",
        "27. Bc5 Rxa2 28. Nxf3": "In theory I am still a pawn to the good and I still thought I was winning. But wherever I wanted to put my rooks the knight keeps harrassing them and in a few moves I am going to lose either the h pawn or the c pawn",
        "28... Nf5 29. Nd4": "29.     Nxd4 would probably have drawn. The bishop is good for defending pawns but not much good for attacking as the two rooks and queen can always protect any white square. I was still trying to win and was after the f pawn, but miscalculated",
        "29... Nd6 30. Kg2 Ne4 31. Nf5": "more pesky forks threatened so I cannot get the f apawn",
        "31... Rd7 32. Nxh6+ Kh7 33. Ng4": "defending that damned pawn and threatening another fork if I take the bishop! Now we are all square but white's pawns are much more effective than black's",
        "33... Rg7 34. h3 Nxc5": "I decided to get rid of the bishop but too late... probably 34...Nd7 35. b4 a5 swapping one of the queen side pawns and at least giving myself a passed pawn would have been better",
        "35. Rxc5 Rf7": "a5 trying to connect the rooks would maybe have given drawing chances (I was still trying to win!)",
        "36. h4 Rb2 37. Rc3": "white just defends the b pawn. Once the pawns arrive near my king it will be over and I needed to do something like c4 to give myself a passed pawn with a rook behind it to distract his pieces away from the K side. I was still trying to find a way to win the b pawn while keeping both a and c pawns however",
        "37... Re7 38. h5 Rd2 39. Kh3 Rd1": "trying to annoy him with some checks, but it does not work!",
        "40. f4 Kg7 41. Kh4 Rd5 42. Ne3 Rb5 43. g4": "white has a clear plan - I don't! And still the annoying knight is threatening forks!",
        "43... Kf8 44. g5 c5": "now finally I try to do something over on the Q side, but far too late",
        "45. h6 Kg8 46. Nd5 Re1 47. g6 Rh1+ 48. Kg5 c4": "just clutching at straws...",
        "49. bxc4 Rc5 50. Re3 Rg1+ 51. Kf5 Kf8 52. Rb3": "Once the pawns are there I could not afford to let the rook out...",
        "52... Rf1 53. g7+": "black resigns\r\n\r\nThis game taught me that a knight can be better than a rook especially against a weak pawn structure"
    },
    "url": "https://gameknot.com/annotation.pl/team-match?gm=30236",
    "gameName": "Team match",
    "players": "jadeion (1904) vs. horsforth (1944)",
    "opening": "Reti opening (A04)"
}