{
    "moves": {
        "1. e4 d5 2. exd5 Nf6": "Center Counter Game\\2 ...Nf6",
        "3. Nf3": "Center Counter Game\\2 ...Nf6",
        "3... Nxd5 4. c4": "I decided on Nf3, leaving a gambit unprotected for a bit of tempo connected with double move of black knight",
        "4... Nf6 5. d4 g6 6. d5 Bg7 7. Bd3 O-O": "white pawn chain is a bit streached, to prevent Nc6. Passive Bd3 was thought to be active after being ganged up with queen and ramming black kings' side with a knight or/and a pawn",
        "8. O-O b6 9. Bg5 Bb7 10. Nc3 c6": "This is a moment when development is finished and sloughter is to begin",
        "11. Bxf6 Bxf6 12. Be4 Bxc3 13. bxc3 Qd6 14. Rb1 Qc5": "After exchange of light figures black plans to overpower d5 pawn",
        "15. Qd3 Rd8 16. Ne5 cxd5 17. cxd5 Bxd5": "black wins d5 pawn",
        "18. Rb5": "garde",
        "18... Qxb5 19. Qxb5 Bxe4": "queen for a rock and a bishop. White has 2 week isolated pawns. Material is even and black is looking much better. My idea at this point is to make some air near black king what would enable white queen to fork some material gains or draw with never ending checks (what's a legimit name for it?)",
        "20. Qb3 e6 21. f3 Bb7 22. c4 Na6 23. Rc1 Nc5 24. Qc2 Rac8 25. Kf2": "I'm putting my self in terrible fork on d4. ",
        "25... f6 26. Nxg6": "An attempt to open  king side",
        "26... Nd3+": "declined. imho, not the best choice for black becouse...",
        "27. Kg3 Nxc1 28. Ne7+ Kg7 29. Nxc8 Nd3 30. Nxa7 Ne5 31. Nb5": "... this combination lead to  2 for white",
        "31... Ba6 32. h4 Rc8 33. Nd4 Bxc4 34. Qb2 Rb8 35. a4 Bd5 36. a5 Nc4 37. Qb5 Nxa5": "my poor play lead to even material and black positional advantage due to a passing pawn on B6",
        "38. Qd7+ Kg6 39. Nxe6 Bxe6 40. Qxe6 b5 41. f4 b4": "passing pawn is advancing, yet f5 check (called as alsol the last hope of white) is comming",
        "42. f5+ Kh5": "a terrible blunder. After g7 game was still on. White has it's eadge, but black is 3 moves from promotion",
        "43. Qf7+": "mate in one - black resigned\r\nthanks to  hsidnevac  for a interesting game : )"
    },
    "url": "https://gameknot.com/annotation.pl/team-match?gm=12677",
    "gameName": "Team match",
    "players": "zal667 (1432) vs. hsidnevac (1554)",
    "opening": "Scandinavian defence (B01)"
}