{
    "moves": {
        "1. d4 c6 2. e4 d6 3. Bd2": "White usually brings out a knight here instead.",
        "3... Qc7 4. h4 Nf6 5. f3 Be6 6. Nc3 Nbd7 7. Bg5 O-O-O 8. Bxf6 gxf6 9. a4 Bh6 10. g3 d5 11. a5": "White fails to guard against QxPg3+, which forces the white king to move Ke2 (white cannot interpose).",
        "11... a6 12. Na4": "The knight move robs Pa5 is its protection by the a rook.  The black queen enjoys her choice of pawns.",
        "12... Qxa5+ 13. Nc3 Qb4 14. Nge2 Qxb2 15. Rb1 Qa3 16. g4 Qa5 17. f4": "This move robs Pg4 of an protection.  Black is encouraged to play BxPg4.",
        "17... Bxg4": "PxPe4 is also good in that Nc3 is pinned.",
        "18. exd5 cxd5 19. Bg2": "Black is highly encouraged to play BxNe2.  KxB or QxB, QxNc3 for free.  Black picks off another piece.  Another decent move is BxPf4.  If white responds with NxBf4, BxQd1.  Very bad trade for white.",
        "19... e6 20. O-O": "Too late for BxNe2 now.  But Rg8 looks like all kinds of potential fun.",
        "20... Bxe2": "It's a fair trade if white plays NxB.  Otherwise white loses Nc3 to the black queen.",
        "21. Nxe2 Rhg8": ":)",
        "22. Ra1 Qb6": "I like Qb4 better.",
        "23. Ra3 e5 24. Rb3 Qa5 25. dxe5 Rde8 26. Kh1": "White moved the king to put pressure on Pd5.",
        "26... fxe5 27. Bxd5": "Black should watch out for BxPf7, which forks the rooks.",
        "27... Nc5": "This counter threat is pretty weak.  White could play Rc3, pinning the black knight.  Although it looks like the queen could take it, actually the white knight is protecting it.",
        "28. Bxf7": "White decides a pawn and rook is worth more than a rook alone.",
        "28... Red8": "That is a really nice escape!",
        "29. Qb1 Nxb3 30. Bxb3": "White would have been better off taking the rook.  It is worth more."
    },
    "url": "https://gameknot.com/annotation.pl/team-match?gm=56936",
    "gameName": "Team match",
    "players": "17jk39 (1190) vs. wichita1967 (1225)",
    "opening": "Queen's pawn (A40)"
}