{
    "moves": {
        "1. e4 c6 2. d4 d5 3. Nc3 dxe4 4. Nxe4 Nf6": "I remember when this was considered the main line of the Caro-Kann, but it seems like I rarely play against it. Most of the time, I see the advance variation.",
        "5. Nxf6+ gxf6": "And I started playing the Caro-Kann, a long, long time ago, because of this variation that was appealing.",
        "6. Be2": "Not the usual spot for the bishop, if I recall, but it gives him options for which side of the board to use it on.",
        "6... Bf5 7. Nf3 Qc7 8. O-O Nd7 9. Be3 O-O-O 10. c4 e6": "This is a common setup for Black. It seems like White should have the advantage, but somehow, when I play this, good things seem to happen for me. And that can be what makes an opening or a defense a good one for you. I know that when I play my favorite White opening, it's like opportunities just kind of magically appear sometimes.",
        "11. Qa4 Kb8 12. Rfc1": "Usually, I'm the one attacking, especially with this defense, but he's not wasting time.",
        "12... Bd6 13. c5 Bf4": "I really didn't want to trade, but what choice do I have. But what's appealing is the idea of getting a knight or even a bishop to d5.",
        "14. b4 Rhg8 15. b5": "His attack's starting to look real serious, especially with that rook and those bishops backing it up.",
        "15... Be4": "Here's a real good defensive move, I feel, that also has a threat to go along with it.",
        "16. Qb4": "If he takes my pawn, I'm still going to recapture with the bishop -- especially now that my pawn will be pinned.",
        "16... Bxh2+": "It feels like the time is ready! ",
        "17. Kh1": "He can't afford to take it with the knight because next I get the pawn on g2.",
        "17... cxb5 18. Qxb5": "I was feeling pretty good about now. In the match, our team was down by a point with only my two games left, and I was a pawn up in each of them.",
        "18... Bf4 19. Qb3": "Nice move. Otherwise, I'm willing to trade bishops and after he takes back with the f-pawn, my queen can go and sit on g3. But now, he'll recapture with the queen.",
        "19... Rg4 20. c6": "I was expecting that one, but I knew I'd be able to bottle everything up.",
        "20... Bxe3 21. Qxe3 Bxc6": "Now I'm two pawns ahead!",
        "22. Bb5 Rdg8": "What I really wanted to do was find a way to get my knight into the attack. Not enough time -- I felt if either of us paused to regroup, the other's attack would be the winner.\n \nThis was a hard move to decide on because I know he's going to take the bishop. But I worked it out, and it looked like my defense would hold out, and I wanted the pressure from the doubled rooks.",
        "23. Bxc6 bxc6 24. Rab1+ Ka8": "It isn't easy to get to my king.",
        "25. g3 f5": "Finally, here comes the knight. But I also have some plans for that extra pawn. Now I'm two pawns up!",
        "26. Ne5 f4": "He can't afford to play Rxc6 (yet).",
        "27. Qf3 Nxe5 28. dxe5 fxg3": "The last real hard decision. I figure he's going to play Rxc6, we'll trade queens, but I'll win with my extra pawns.",
        "29. Rxc6 Rf4 30. Rxc7+ Rxf3 31. Rbb7": "That's the awesome move that I'd overlooked, and I knew I'd end up with a draw after I analyzed it. The reason this move works is still a couple of moves away.",
        "31... g2+ 32. Kg1 Ra3 33. Rcxf7 Rxa2 34. Rfg7": "This is the scenario I hadn't considered until he moved down the rook on move 31. But this is just an awesome move. I've got all of these extra pawns that are going to be shown for how weak they are.",
        "34... Rf8": "I should've just gone ahead and traded...",
        "35. Rbf7": "... because I hadn't expected this move either. ",
        "35... Rxf7": "I asked for a draw here, but I don't remember why now. I remember looking it over and seeing cases where I couldn't get my king out to help and his king and rook would take my e-pawn while he still had his f-pawn. So I decided to ask for the draw while I was ahead and sure that he would be happy to get it."
    },
    "url": "https://gameknot.com/annotation.pl/team-match?gm=22258",
    "gameName": "Team match",
    "players": "jgrimm (1837) vs. chuckbo (1826)",
    "opening": "Caro-Kann (B16), Bronstein-Larsen variation"
}