{
    "moves": {
        "1. e4 d5 2. Nc3 d4": "White refuses the sacrifice, avoiding open, tactical play, but in return black gets to grab a lot of space in the centre.",
        "3. Nce2 e5 4. d3 c5 5. f4": "White starts contesting the centre, creating space for himself in the process.",
        "5... f6 6. Ng3 Nc6 7. Nf3 Qc7": "black needs to focus on strengthening e5, while continueing development, rather than opening the position, which would mostly benefit white's development",
        "8. fxe5 fxe5": "Nxe5 may have been better, as my dark squared bishop might have been a bit more effective in that case",
        "9. Be2 Nf6 10. O-O Bd6": "While the bishop is no better than a pawn in this position, I did not want to clog the 7th row in order to maintain the defensive power of my queen and to keep the option of Ne7",
        "11. Ng5 O-O 12. Nf5 Ne7": "White's pieces are getting very active, and since trading for my bishop would put a pawn on f5 and create a monster of a knight at e6, that's not really an option. Instead, I figured I had to reposition as many pieces as I possivly could towards defense of my king.",
        "13. Bg4 b5": "Black needs to create some sort of couterplay. This move opens some opportunities for positioning the bishop along the a8-h1 diagonal, and serves to grab some space on the queen side.",
        "14. a4 h6": "Not without danger: there are some lines here that seem rather dangerous While I considered it defendable, there are some lines that are interesting enough to study, even if they end up falling short.\n\n15. Nxh6 xh6\n16. Ne6  Bxe6\n17. Bxe6 Kh7\n18. Qd2  Neg8 and the position is secure?\n\nA similar position may arise if Ne6 is the first move. Another option may be Nxg7, which is followed by Ne6 regardless of the knight that black takes, practically forcing the trade with the bishop. The pawn on g5 can then be taken by white's light squared bishop, which leaves him with very active pieces and black with a very vulnerable king. Once again I can't completely oversee the outcome, since the moves aren't forced, but there certainly is merit in studying it",
        "15. Nxe7+ Qxe7 16. Bxc8 Rfxc8 17. Nf3 a6": "White avoids the complications, but the massive exchange now leaves the initiative to black, as he gets to focus on building up pressure on the queen side.",
        "18. b3": "possibly meant to halt the progress of the black pawns, but they can continue unfazed",
        "18... c4 19. axb5 axb5 20. Rxa8 Rxa8 21. bxc4 bxc4": "I don't really like the line white plays here, since black gets even more space to maneuver now. Sadly, I can also not see a clear path for white to take at the 19th move. However, if white keeps the position closed, black has to do some work before being able to open up the queen side himself (doubling rooks on the c-file, but first playing Qb7 to make sure the a-pawn doesn't get pinned is what I reckon would be the plan of action), alllowing white some time to reorganize.",
        "22. Qe1 Ra2": "building up pressure on white's weaknesses",
        "23. Rf2 Ra1 24. Rf1 Ba3": "White has properly defended against the pin, but black can still force trades that further the developoment of black's pieces.",
        "25. Bxa3 Qxa3 26. Qe2 cxd3 27. cxd3": "Qxd3 leaves a very weak pawn behind.\n\nWhile white might want to trade rooks, this would of course be disastrous because Rxa1 Qxa1, Qf1 (Qe1 Qxe1, Nxe1 d2) Qxf1, Kxf1 xc2",
        "27... Ra2": "Seizing control over the second row, creating danger for the king.",
        "28. Qd1 Ng4": "Getting the final piece involved in the attack while simultaneously covering e5",
        "29. Qc1 Qc3": "The threat Qc8 could be countered with Ne3, Qa6 or Kh7, but each of these moves would give up some initiative, as white's queen could become a menace behind black's pieces.",
        "30. Qxc3 dxc3 31. Rc1 Ne3": "Simply playing c2 wouldn't cut it, since white would be able to get his king off the first row, preventing a rook on b1 from being back breaking and eventually allowing him to pick up the c-pawn as he approaches it with his king.\n\nWhite is not allowed to take on c3, since 32.... Rxg2 33. Kh1 Rf2 33. Ng1 (only safe place) Ng4 would happen and now the knight needs to move away from g2 to prevent mate on h2, but it has no safe squares to move to.\n\nAttacking the knight with Re1 is also no good, as it is followed by 32... Rxg2 33.Kh1 Rf2 34. Rxe3 c2 35. Re1 Rxf3 36. Kg2 (any other move would allow white to play Rf2 making promotion of the c-pawn inevitable) Rxd3 37.Rc1 Rc3, with what looks like a very favourable endgame for black, as he gets to move the king towards white's pawns, while white has to make an effort to take out the c-pawn.",
        "32. Nxe5 Rxg2+ 33. Kh1 c2": "Too hasty after all, as demonstrated by white's next move. Better would have been Rd2, as white would still be unable to take on c3 because of Rd1# If white moves the king to remove the threat of checkmate, c2 can be played, after which Rd1 and promotion become inevitable. 34. Nc4 can be answered with Nxc4 35.xc4 c2 with once again unstoppable promotion. The sturdiest defense seems to be 34. Nf3 Rf2 35. Nd4 c2 36.Nb3, preventing Rd2. This seems to hold the position for white, but the fact that white's king remains 'locked up' makes this position in black's favour, I believe. ",
        "34. Nc4 Re2 35. Nxe3 Rxe3 36. Rxc2 Rxd3": "White has dealt with the biggest threat, but the e-pawn seems to be there for the taking, as the white king is cut off from supporting it.",
        "37. Re2 Kf7 38. Kg2 Ke6 39. e5": "Dooms the pawn. If black would have been forced to come towards it and place the king besides it to support Re3, white may have had a shot of defending it, or at least abandoning it at a moment where it would allow him to apply counter pressure on the pawns on g7 and h6.",
        "39... Rd5 40. Kf3 Rxe5 41. Rxe5+ Kxe5 42. Ke3": "White keeps the king from advancing",
        "42... g5 43. Kf3 h5": "This is a poor move. Black had the opportunity to oppose the white king with 43...Kf5, forcing him to take a side (possibly after 44. h4 g4 or 44. h3 h5 45. h4 g4, which would allow the black king to advance",
        "44. Ke3": "Instead, white gets to oppose again and black gets nowhere",
        "44... g4 45. h3": "Forces the draw. Kf5 doesn't help because you will be left with either a pawn on the side of the board, or a pawn ahead of the king, both of which can be defended and taking the pawn will also lead to a position where neither of the black pawns will be able to end the game",
        "45... g3 46. h4": "Sadly, I dropped the ball at the end of an otherwise reasonably well played match, leaving me with an unsatisfactory feeling (especially since a player at my level should understand end games well enough to not make the mistake in the end).\n\nHowever, there were still interesting aspects about the game overall, so I hoped you enjoyed the annotations."
    },
    "url": "https://gameknot.com/annotation.pl/team-match-masters-of-the-game-vs-the-white-knight?gm=57662",
    "gameName": "Team match Masters of the Game vs The White Knight",
    "players": "spacegoat  vs. martenp ",
    "opening": "Scandinavian (centre counter) defence (B01)"
}