{
    "moves": {
        "1. e4": "! This was a huge surprise for me, because my opponent played exclusively 1.d4 in all the games I could find. Now I pretty much knew that this was prepared for me, while my own preparations were completely futile. It is worth noting that my opponent was a 2200 ELO player 7 years ago, but his rating gradually slipped due to lack of competitive playing (it is hard to defend the rating if you are not playing regularly). I know him as a strong positional player, but also pretty good tactically - certainly a respectable opponent. \n",
        "1... c5": "I wasn't too worried though - I have been playing the Sicilian for 11 years so I have grown quite familiar with it and I have a solid repertoire for most of White systems. Besides, I know which of my games are available in databases, so I know how to avoid previous tricky positions :)\n",
        "2. Nc3 e6 3. f4": "This is the beginning of Grand Prix Attack, my favourite variation. I am scoring very heavily against this system due to the fact that it is usually employed against me by weaker players, who play 'schematically' and tend to make small tactical mistakes in the middlegame.\r\n",
        "3... a6": "Recently I started playing this move instead of my previous favourite 3...d5, because it stops early exchanges via Bb5. This is probably what my opponent had primarily prepared for (judging from the developments in the opening).\r\n",
        "4. Nf3 Nc6 5. d4": "!? This is an interesting move - White switches to open Sicilian lines. Usually people play d3, g3, Bg2, 0-0 etc. with standard GPA play.\n",
        "5... cxd4 6. Nxd4 d6": "This move defines Black's opening intentions - I am proposing mainline classical Scheveningen. I used to play a lot of these, but not recently - it seems that it has gone out of fashion, most likely due to Kasparov's efforts. White can still castle long, but this is slightly more risky and I felt that this is not likely considering my opponent's style of play and the way he opened the game (it is a long way mentally from closed 2.Nc3 systems to castling long in the open Sicilian).\r\n",
        "7. Be3 Bd7": "I wanted to avoid closing of the c file in case of 8.Nc6, bc6. Black kingside is lagging in development but White can't exploit this immediately.\n",
        "8. Be2": "This move finally defines the opening - classical Scheveningen it is. I usually play 8.Qf3 with 9.0-0-0 in similar positions, which is more aggressive but also more risky.\n",
        "8... Nf6": "Black has to hurry with kingside development, because in a few moves White will be ready to start active operations. The main question is - where?\r\n",
        "9. O-O Be7 10. Bf3": "In this position White has a lot of different moves/plans, I will just mention the typical ones: 1) 10.a4 stops Black's counterplay based on b5 for a long time, and allows for play in the centre and possibly on the kingside. 2) 10.Nb3, b5; 11.a3 avoids exchange on d4 while retaining control over the centre 3) 10.Qe1 is probably the strongest, preparing the transfer to g3 and creating some threats on the kingside 4) 10.Kh1 is a useful waiting move, postponing the decision regarding the placement of other pieces 5) 10.Bf3, which usually indicates White's intention to focus on the queenside, but can also support kingside pawn storm\n",
        "10... Qc7": "Since White did not threaten the kingside yet, I decided to delay castling for 1-2 moves and first overprotect e5, c6 and b7.\n",
        "11. Qd2": "!? This was a surprise - usually the Queen doesn't define its place so soon (I expected it to go to d3 later). I expected 11.a4 or 11.Nb3 first. \n",
        "11... O-O": "In any case, castling needs to be done eventually, so this is as good a moment as any. Black position is rock solid and very flexible, the small center ready to advance as needed.\n",
        "12. g4": "?! Another surprise, but this time I considered it slightly dubious. White is not nearly prepared to overrun Black kingside, and this move opens his King greatly. His central cluster of pieces prevents any mating counterattack right now, but how permanent is this remains to be seen. I would recommend 12.Kh1, which is always a useful move in Scheveningen.\n",
        "12... Nxd4": "! Following the old rule - on wing action react in the centre. This move also (if necessary) allows Bd7 to move to c6 and allow Nf6 to retreat on d7 after White pushes g5. --- In my experience, generally for Black the best moment to counterstrike is right after White commits his pawn structure to the kingside attack. \n",
        "13. Qxd4": "Better than 13.Bd4, due to having more options after the following 13...e5.\n",
        "13... e5": "! Forcing favourable simplifications, while simultaneously picking on g4 pawn.\n",
        "14. Qd1": "Practically best. White does not have many good options here: A) 14.fe5!?, de5; 15.Qb6, Qb6; 16.Bb6, Bg4; 17. Bg4, Ng4; 18.Nd5, Bd8 and B) 14.Qb6, Qb6; 15.Bb6, ef4 and C) 14.Qd2, ef4; 15.Bf4, Bg4; 16. Bg4, Ng4 leave Black with a clear extra pawn, but white can fight for a draw, while D) 14.Nd5??, ed4; 15.Nc7, de3; 16.Na8, Ra8 loses outright.\r\n",
        "14... exf4 15. Bxf4 Bc6": "?! Here I decided against objectively best 15...Qb6; 16.Kg2, Qb2; 17.Bd2 because now Black has to either give up the b7 pawn or allow 18.g5. The reason is that I liked the (objectively equal) position after 15...Bc6 - it is very safe and still gives plenty of opportunity for long-term advantage, due to the safer King and slightly better pawn structure (less weaknesses). This decision is a direct result of the competitive situation (explained in introduction). \n",
        "16. Kh1": "A defensive move - White makes sure that any future Qb6 will not be with check. Moves like 16.Qd2!? (16...Qb6?!; 17.Be3, Qb2??; 17.a3!) and 16.g5 were also good options here.\n",
        "16... Nd7": "The transfer of Nf6 to e5 is one of main strategic points in Scheveningen, for the following reasons: 1. centralized Knight will have a lot of influence over the board 2. in case White exchanges it, Black will repair his pawn structure 'for free' while still leaving White with e4 isolani (in that case after Nd5 Black might choose to leave the Knight there for a while) 3. Be7 will get slightly more scope, and in case of exchange on e5 a lot more.\n",
        "17. Nd5": "This is objectively a good move, but I don't really like it :I I would recommend 17.g5 first (then 18.Nd5), to stop Black from playing Bf6-Be5 (which improves Be7).\n",
        "17... Bxd5 18. exd5": "White chooses to improve his pawn structure (of course g4 is still a liability), but 18.Qd5!? is also very interesting. It keeps the d file open to allow for pressure on d6 pawn (and therefore stops Bf6), taking opportunity from the fact that 18...Qc2?!; 19.Qb7 favours White. Of course, after 18...Rac8 Black is perfectly fine.\n",
        "18... Bf6": "Now I was very happy with the way things were going - this move greatly improves the Bishop and ensures permanent domination over e5. I was hoping that White would allow the exchange of Bishops, leaving me with extremely strong Ne5 dominating the board. Unfortunately, there is no way to force this.\n",
        "19. c3 Qb6": "Essentially, this is just a waiting move. I was sure that moving the queenside pawns is a bad idea (White has the majority here so that can only help him create passers), but couldn't decide where to place the Rooks (Rac8, Rae8 or Rfe8). Playing 19...Ne5 would allow 20.g5, while 19...Be5 is a good move which can be played at any time. The game is balanced for now so I wanted to provoke White to do something. Due to the competitive situation it was his 'obligation' to try to win, I was generally OK with a draw but not inclined to allow a simple one.\n",
        "20. Qc2": "The best move - protects b2 while looking at h7. If White played 20.Qb3 I would return to c7 and then decide on future play.\n",
        "20... Be5": "Again postponing the decision regarding placement of Rooks. I knew White will not allow the exchange but this move has to be played eventually.\n",
        "21. Be4": "21.Bd2!? is an interesting move, basically doing nothing and leaving Black to decide what to do (which is exactly what I was doing at that time). I know it probably sounds horrible to some people, but this is the way chess needs to be played sometimes :)\n",
        "21... g6": "It seems that 21...h6 is actually playable, but I like 21...g6. It does leave some holes on black squares, but White can't exploit that and if Bishops get exchanged the Knight on e5 will be very strong both defensively and offensively.\n",
        "22. Bh6": "22.Bg5 and 22.Bd2 are also quite possible, but in any case the situation doesn't change much - and 22.Bh6 is more active and therefore poses more problems (=opportunities to make a wrong decision) for Black. Time remaining: 34 minutes\n",
        "22... Bg7": "! Still trying to exchange the Bishops (22...Rfe8 is also good, but I didn't want to define the rooks yet). Time remaining: 36 minutes\n",
        "23. Bg5": "! Still keeping the tension. The game is equal after 23.Bg7, Kg7 but I really liked Black's position in that case - centralized Knight that can be taken out only with exchange sacrifice is a beautiful thing to have. If White wanted a draw 23.Bf4 is a good choice (but I would probably avoid the repetition with a Rook move).\n",
        "23... Rae8": "I did what I could with light pieces (the Bishop is greatly improved compared to a few moves ago), now it was time to activate the Rooks.\n",
        "24. Rae1 Ne5": "24...Nc5 is also possible, but I wanted to provoke pushing of h pawn to further loosen up White's kingside. If White later played Bf6 or Bf4, I would probably retreat the Knight back to d7 or maybe even allow the B-K exchange with the idea that in positions with opposite coloured Bishops the side with the initiative (or in this case safer King) has the advantage.\n",
        "25. Qg2": "! Calmly reinforcing the kingside. There is no need to move the h pawn yet.\n",
        "25... Qc7": "I gave up on 25...Qa5; 26.Bb1, Qa4 because White can play several useful moves while my Queen actually does nothing on a4 and can be pushed back with tempi if needed. Instead I decided to try to put some pressure on g4 with Qd7 and maybe later f5. Time remaining: 28 minutes\n",
        "26. h3": "White finally decided to reinforce the g4 pawn. This is certainly not a bad idea, but now Black (if needed) can probably even allow B-K exchange, which would leave him with a dominant Be5 looking at the weaknesses on black squares. Time remaining: 19 minutes\n",
        "26... Nd7": "! A very good practical move, baiting White to try something active while keeping all options open (the Knight can go from d7 to either c5 or e5). Time remaining: 22 minutes (This is also a factor in the game - Black has a very solid position AND better time on the clock.)\n",
        "27. h4": "This is exactly what I was waiting for. I must honestly say that this move is objectively not bad at all, but it seems to me that in a practical game both players need to play really precisely from now on - and I still think that Black's position is more solid.\n",
        "27... Ne5": "The Knight is returning to assume his ideal position, resuming pressure against g4 while reinforcing g6 and f7. One of my students (a cadet) was watching the game and later asked me why I was 'wasting tempi' here (which I always preach against). I explained that he failed to appreciate the significant positional change in pawn structure after 27.h4.\n",
        "28. h5 Qd7": "Increasing the pressure against g4 as originally planned with 25...Qc7.\n",
        "29. h6": "! The best move, cramping Black slightly. On the other hand, now White needs to keep an eye on that pawn and be especially careful if the game starts to simplify into an ending. Other options need to be addressed here: A) 29.Bf3, Nf3; 30.Qf3, Re1; 31.Re1, f5 and B) 29.Rg1, Qg4! and C) 29.hg6, fg6 are all too passive and give Black slight advantage. Time remaining: 12 minutes\n",
        "29... Bh8": "Time remaining: 19 minutes\n",
        "30. Bf3": "?! Neither of us noticed very interesting possibility 30.Bf5! (radically stopping f5), which leads to equality after 30...gf5; 31.gf5, Ng6; 32.fg6, fg6; 33.Re8, Re8; 34.Qf3. I was looking only at inferior options 30.Bf3?! and 30.Rg1?!, Qg4; 31.Qg4, Ng4; 32.Rg4,f5\r\n",
        "30... f5": "?! Imprecise. The best move order is 30...Nf3!; 31.Qf3, f5; 32.Re8, Qe8 which is slightly better for Black.\n",
        "31. gxf5 Rxf5 32. Be4 Rxf1+ 33. Rxf1": "Time remaining: 10 minutes\n",
        "33... Rf8": "!? Not necessarily the best move (solid options are 33...Ng4, 33...Qg4 and 33...b5), but seems principled - Black wants to exchange heavy pieces and win the h6 pawn. If White refuses to exchange then Black has won the f file for himself. Time remaining: 13 minutes\n",
        "34. Rxf8+ Kxf8 35. Qf2+": "?! This check looks tempting but it helps Black's plans. Improving the King with 35.Kg1 looks like a good option here. Time remaining: 8 minutes\n",
        "35... Qf7": "The same situation as 2 moves before - if White refuses the exchange then Black has won the f file for himself. Time remaining: 14 minutes\n",
        "36. Kg2": "?! I think White should just move the Queen to g2 or e2 (avoiding the exchange but not relinquishing the file). White's  strong pair of Bishops needs to be supported by the Queen to be fully effective. On the other hand, if White wants to allow the exchange then this is certainly the best way to do it - gaining tempi to improve the King.\n",
        "36... Qxf2+ 37. Kxf2 Nf7": "Now it is obvious that the h6 pawn is doomed - but I had no idea if this ending can actually be won. Bishop pair is usually extremely problematic in such positions - Black has 3 pawn islands and the board is wide open.\n",
        "38. Be3 Bf6 39. a4": "Since Black will soon have 2 passers on the kingside, the logical plan is to advance the queenside majority and try to create some counterplay.\n",
        "39... Bg5 40. c4": "?! This, however, is a somewhat questionable decision. I was very much relieved to be given the opportunity to get rid of the Bishop pair - of course my Knight is inferior to the remaining Bishop but this position is now definitely unwinable for White. Time remaining: 6 minutes\n",
        "40... Bxe3+ 41. Kxe3 Nxh6": "? Definitely a big mistake. Since black-squared Bishop is gone now I should have played 41...a5! followed with 42...b6 to create a blockade on black squares, and only then pick up the h6 pawn.\n",
        "42. b4": "?! More precise is actually 42.a5!, to definitely fix the positions of Black pawns.\n",
        "42... Ke7": "?! Another mistake, missing the last opportunity to play 42...b6. I was (unnecessarily) worried that this could maybe even lose, since the a6 pawn could be threatened by Bd3 and c5. So I decided to hastily bring the King over to defend the queenside pawns, which were due to 41...Nh6? left stranded on white squares.\n",
        "43. c5": "! After this White has excellent chances to save the game, if not for time trouble. Time remaining: 7 minutes\n",
        "43... Kd7": "! Getting in range of the c7 square, thereby again gaining the 'Black can't lose the game' status. Time remaining: 4 minutes\n",
        "44. a5": "Securing the black squares, fixing a6 and b7 pawns on white squares and opening the f1-a6 diagonal for the Bishop - not bad for 1 move. That said, 44.Kf4 is a bit more precise here, since: A) 44...a5? doesn't work due to 45.c6, Kc7; 46.ba5 and B) 44...Nf5?; 45.Bf5, gf5; 46.a5! (46.Kf5??, a5! wins for Black) leaves White ahead, so black has to play C) 44...Nf7; 45.c6, Kc7; 46.cb7, Kb7; 47.a5 - which is completely equal.\n",
        "44... Nf7": "In this position I was feverishly calculating 44...Nf7, 44...Ng8!? and 44...Ng4!? and evenutually picked the move that looked the safest. This can transpose to the position I mentioned on previous move (variation C). Time remaining: 2 minutes\n",
        "45. c6+": "One of the players from the other team remarked after the game that after a neutral move 45.Kd4 or 45.Kf4 it is hard to see how exactly Black will win this. I must agree - kingside passers are not moving any time soon. But 45.c6 is also a good move, certainly not losing the game. Time remaining: 6 minutes\n",
        "45... Kc7": "?! I didn't like 45...bc6; 46.dc6, Kc7; 47.b5, ab5; 48.a6 - I couldn't be sure that I am not missing something there due to time trouble. Actually 48...Ne5; 49.a7, Nc4; 50.Kd4, Nb6 and the pawns are stopped. How to actually win this after 51.Kd3! is a different matter entirely. Time remaining: 2 minutes\n",
        "46. Bd3": "?! I was only looking at immediate 46.cb7, after which the game is most likely a draw - the King has to look after the a6 weakling and the Knight can't advance the passers alone.\n",
        "46... Ne5": "Luckily (it would only increase the stress), I had no idea at the time that we were in fact losing the match 3:2 at this moment, and this game would eventually decide the winner of the league competition. Time remaining: 1 minute\n",
        "47. b5": "? I don't know why White didn't play 47.cb7 - maybe he didn't notice that 47...Nd3 (47...Kb7 is also very drawish as mentioned before); 48.b8Q, Kb8; 49.Kd3 is a dead draw - Black can never move his King to the kingside due to the b5 threat. --- Amazingly, this move does not actually lose the game yet, although it drops the second pawn!\r\n",
        "47... axb5 48. Bxb5": "Time remaining: 4 minutes\n",
        "48... bxc6": "Time remaining: 2 minutes\n",
        "49. dxc6 Nxc6 50. a6 Na7": "!! I decided here to play the rest of the ending like it is King and 3 pawns vs. King and Bishop (like Na7 and pawn on a6 do not exist). The reason is that I sensed (did not calculate) that losing time on the a6 pawn would allow White to endanger the kingside passers and draw the game. One possible variation (found in analysis) is 50...Kb6; 51.Be2, Nb4; 52.Ke4, Na6; 53.Kd5 and Black pieces are cut off on the edge of the board and therefore can't help the pawns. This move does not win yet, but now White has to play precisely to hold the position. \n",
        "51. Bc4 Kc6 52. Kf4": "! White knows that he has to take out the kingside passers with the King (Bishop can't do this). The problem is that after he takes the h pawn he has to be able to simultaneuosly stop the d and g pawns from advancing, and for this the Bishop has to control both d and g file. Time remaining: 5 minutes\n",
        "52... Kc5": "My teammate GM Nikolac (who scored fantastic 8/9 on the 1st board and was the best board in the league) immediately after the game proposed  slightly more precise 52...d5!?, to keep the Bishop away from the kingside. It does not change the evaluation and analysis shows that both moves are pretty much the same strength, but is interesting to observe how a GM (reduce opponent's options first) has different instincts than a MK (activate the King first). Time remaining: 2 minutes\n",
        "53. Bd3": "?! Unnecessary loss of time (allows 53...Kd4), although still not fatal. After either A) 53.Bg8, h6; 54.Bh7, g5; 55.Kg4, d5; 56.Kh5, Kd4; 57.Bf5! (holds the g pawn), Ke5; 58.Kg4!, d4; 59.Bd3= or B) 53.Bf1, h6; 54.Bd3, g5; 55.Kf5!, d5; 56.Be2!= White has saved the game\n",
        "53... Kd4 54. Bb1 d5": "Finally, we have arrived to the last critical position. The are several interesting elements to notice: 1. the Bishop can't immediately assist the King in winning the kingside pawns, because it does not control the crucial g file 2. kingside passers can't move because the Bishop has them both pinned at the moment 3. if the Bishop remains on b1 then all Black can do is try to advance the d pawn a bit further 4. (not obvious at the first glance) if the Bishop attacks the d5 with 55.Ba2!, the kingside passers can move - but to their detriment!\n",
        "55. Kg5": "?? Horrible mistake, which loses the game on the spot. The only explanation is that due to stress and time trouble White simply did not correctly and fully assess the position. I knew that this was a bad move when I saw it played (since I had a plan how to proceed), but also had no idea at the time which was the correct plan for White. Now after careful analysis I have found 2 different drawing continuations: A) 55.Ba2!, Kc5 (55...Nc6; 56.Kg5, Ke4; 57.Bb3!=;; 55...h6; 56.Bb3, Nc6; 57.Bd1!=); 56. Bb3!, d4; 57.Kg5, d3; 58.Kh6, Kd4; 59.Kh7, g5; 60.Bd1= and B) 55.Kf3!?, Kc3 (55...Kc4; 56.Kf4=;; 55...Ke5; 56.Kg4=); 56.Ke3, d4; 57.Ke2=\n",
        "55... Ke3": "! Now it is all over.\n",
        "56. Ba2 d4 57. Bg8": "This is a further waste of time, but nothing helps anyway.\r\n",
        "57... d3 58. Kh6 d2 59. Bb3 Ke2 60. Kxh7 g5": "White resigned. --- I hope you enjoyed the game. What can I say at the end? This was a tense and hard-fought game between evenly matched opponents, which was ultimately decided not by superior skill, but by time trouble and nerves. Nevertheless, it does carry certain learning points: 1. In important team matches, a draw is often a good result (especially for Black) while a loss can be catastrophic - this can greatly influence the amount of risk that players are willing to take 2. Opening preparation is important, but it can be dodged by the opponent so solid backup plan is needed 3. I always strived to have a solid position, which was easier to play and allowed me to be calm for the most part of the game (which was a big factor in the endgame) 4. Bishops have huge advantage over Knights in endgames where there are pawns (especially passers) on both wings 5. Activity of Kings is the key to the endgame --- Thank you for looking over this game, I can answer any questions on private. Regards, Marin Vukusic\r\n"
    },
    "url": "https://gameknot.com/annotation.pl/team-play-effect-of-competitive-situation-on-style-of-play?gm=11878",
    "gameName": "Team play: Effect of competitive situation on style of play",
    "players": "White player (2142) vs. marinvukusic (2136)",
    "opening": "Sicilian (B23), closed, Korchnoi variation"
}