{
    "moves": {
        "1. d4 d5 2. Bf4 Bf5 3. Nf3 Nc6 4. c3 e6 5. h3 Nf6 6. Nbd2 Bd6 7. Ne5 O-O": "All more or less standard moves, I don't comment because I already did in many similar games. ",
        "8. g4 Bg6": "I can get rid of the annoying lsb by NxB, but it is not particularly interesting. ",
        "9. e3 Ne4 10. h4": "Needed, to avoid Qh4.",
        "10... Nxd2": "If I take with the queen, the game is even. More of all, my queen is not anymore on the light squares, which means a completely different game. I like to fight for the light squares. So, I decided for the \"offside\"...",
        "11. Kxd2 h6": "Providing a square for his lsb. ",
        "12. g5": "I don't go for the simple h5, since it kind of blocks the attack. This one seems more interesting. ",
        "12... h5": "Ok, now I planned to exploit the weakness of g6, but I failed. ",
        "13. Nxg6 fxg6 14. Bxd6": "I am not sure what happens if here Rxf2+, Ke1. But probably it is not good for black. Rxb2, Ba3, Rmoves, and I am free to attack g6. ",
        "14... Qxd6 15. f4": "This pawns chain is weak, I know. ",
        "15... Ne7": "with this move, black solves his g6 problems. Hmpf...",
        "16. Bd3": "Maybe Be2, planning a sac on h5 could have been a plan... but too risky. ",
        "16... Nf5": "Now, THIS is a pain. I should have taken the knight at once, and forget attacks. ",
        "17. Qc2": "But I am hardheaded... which turns to be a mistake. Nxe3 KxN, Qxf4+ and I'm cooked. But fortunately for me, black didn't dare. ",
        "17... c5": "...this one is good, too...",
        "18. Rh2": "Blunder. Now, Nxe3, KxN, Qxf5+, K moves and QxR. Simple and crushing. But again, he doesn' see it. ",
        "18... cxd4": "good, too. I'm sweating. ",
        "19. cxd4": "Now, Nxd4, and I cannot go exN, because of... well, you already know it :-)",
        "19... Rfc8 20. Qb3": "The attack black performs is on the \"normal\" kind. Can I resist?",
        "20... Rc7 21. Bxf5": "Finally, I can exchange that nasty knight... before he realizes its power. ",
        "21... gxf5 22. Rc1": "Exchange is kind of coward, but what else can I do?",
        "22... Rac8 23. Rxc7 Qxc7 24. Qc3": "Exchange, exchange! :-)",
        "24... g6": "Blockading the kingside... but wait. ",
        "25. Kd3": "Helping the R in, and approaching to the center.",
        "25... Qd7 26. Qb3": "Controlling Qb5. ",
        "26... Rc4 27. Rc2": "Exchange, exchange... :-)",
        "27... b5 28. Kd2": "Avoiding the fork after RxR. I'd like to penetrate with the queen behind the barrier, but it doesn't work. Too much power for black. ",
        "28... a6 29. Rxc4 dxc4": "This should be manageable. Let's see. ",
        "30. Qa3": "Attacking a5, but just for a tempo. Nothing serious. ",
        "30... Qc6": "Threats to penetrate on g2. Now, it's a matter of techique. Who will destroy the opponent first?",
        "31. Qe7": "I'm very near to it. He too. ",
        "31... Qg2+ 32. Kc3": "Aha, my bet was: now what? Black must move the queen again in order to make her harmful, but I can take and check in one move. ",
        "32... Qc6": "He has to defend. ",
        "33. Qd8+": "Let's the dance start. ",
        "33... Kg7 34. Qf6+ Kh7 35. Qf7+ Kh8": "I can take the pawn, and black has the same plan as before. But wait: b4+ comes in a single move, and I smell danger. He can start checking, then... let's be calm. I am too lucky to have survived to blunder now. ",
        "36. Qf8+ Kh7 37. Qc5": "You WON't exchange, would you? :-)",
        "37... Qe4 38. Qc7+ Kg8 39. Qe5": "This exchange is better for black... but he loses anyway. He is a 1900+... he should see it in a glance! My king is nearer of his pawns than his to mine...",
        "39... Qxe5": "Uh oh! ",
        "40. dxe5": "Now, is just a matter of time. ",
        "40... a5 41. a4": "or b3. But I don't have to let him any extra tempo, so this is quicker. ",
        "41... bxa4 42. Kxc4 Kf7 43. Kb5": "Or Kc5, and his king can't escape the cage. But again, let's do it quickly. ",
        "43... Ke7 44. Kxa5 Kd7 45. Kxa4 Kc6 46. b4": "Or Kb4. But I know any square the pawn advances restricts his movements (he cannot go behind the pawn anyway!)",
        "46... Kb6 47. Kb3 Kb5 48. Kc3 Kc6": "He CAN stop this pawn, but...",
        "49. Kc4 Kb6 50. b5 Kc7 51. Kc5": "...while he does it, I go after e6, and I win. My opponent resigned. \nSacs are not a fancy thing: they are needed, sometimes. "
    },
    "url": "https://gameknot.com/annotation.pl/techincal-win-2?gm=43271",
    "gameName": "Techincal win 2",
    "players": "damalfi  vs. rossfresser ",
    "opening": "Queen's pawn, Mason variation (D00)"
}