{
    "moves": {
        "1. c4": "Hi everyone!\n\nYet again it has been a long time since my last annotation.  Thankfully my dad has now settled in to his care home and his house is now being let so I can give my attention to some chessic issues.  This game was played between myself and a long-standing on the board nemesis dmaestro (Mike).  Do not be fooled by that Class B rating he has got.  At the top of his game he is an expert!  In quite a large percentage of my games against him, he, like the Dentist, had managed to inflict severe passivitis on me in the middlegame.  Sometimes I have managed to turn the tables on these two opponents, but more often than not, particularly with Mike - he has gone on to win.  In this game it certainly looked as though I was set to lose, not just the game, but my Class A rating.  I thought of hitting that resign button quite a few times in the endgame, but something kept me from doing this and I ended up teetering on the brink.  So, what was the final twist here?  Well, you will just have to read on.  Below is the gameknot analysis version:  http://gameknot.com/analyze-board.pl?bd=22168815&fb=1&rnd=0.5423497644644992",
        "1... e5": "1. ...... e5 - Mike kicks off with his favourite opening as white.  It is the English Opening and I respond with e5 which is a fairly popular response.",
        "2. Nc3 Bb4": "2. ...... Bb4 - potential pin.",
        "3. Nd5 Be7": "3. ..... Bd7 - retreat.",
        "4. d4 d6 5. Nf3 e4 6. Nd2 f5": "6. ..... f5 - this game has transposed into an Anglo-Dutch defense.  Mike has got me into this one before and I lost.",
        "7. e3 Nf6 8. Nxe7 Qxe7": "8. ..... Qxe7 - at least my last two moves have speeded up my development.  A knight to f6 and Henry is ready to castle.  So far not too bad.",
        "9. Be2 O-O 10. O-O Nc6 11. Nb1": "11. Nb1 - Mike retreats his knight to b1 as he wishes to redeploy it to c3 - he does this next move after I put Fou Leblanc on d7 and cleared the decks on my back row.",
        "11... Bd7 12. Nc3 a6": "12. .... a6 - no Nb5 thank you!",
        "13. f4 Be8": "13. .... Be8 - I eschew exf3 ep as Mike will be left with a powerful unchallenged central pawn wall.",
        "14. d5": "14. d5 - here we go, the passivitis rot is just starting to set in.",
        "14... Na7 15. h3 Bf7": "15. ...... Bf7 - I have a feeling there is a pawn storm coming, so Fou Leblanc joins a little huddle around Henry.",
        "16. g4": "16. g4 - I assumed correctly!",
        "16... Bg6 17. g5": "17. g5 - now my knight has to move.  The only plus point I can see is that Mike has left his king a little draughty.  This will not present a problem for him - at the moment.",
        "17... Nd7 18. b4": "18. b4 - now an expansion on the queenside.",
        "18... Rab8 19. Bb2": "19. Bb2 - enter the bishop that is gonna be a thorn in my side for the best part of the game.",
        "19... Rfd8 20. h4 Bf7": "20. ..... Bf7 - scratching around.",
        "21. h5 Be8 22. Qd4": "22. Qd4 - uh,oh!  Here comes the Wicked Witch of the West!  (Please note, I always refer to the enemy queen as the Wicked Witch of the West and NOT MY OPPONENT!)  The witch is threatening to turn my queen knight into horsemeat so I must do something about this.  My knight retreats to c8 and I am further tied up, aaargh and double aargh!",
        "22... Nc8 23. h6 Bg6": "23. ..... Bg6 - I dare not play g6 here because the Witch is backed up by Mike's dsb (although a white knight momentarily stands in the way), this could easily lead to Henry copping Old Matey so I try and keep things as closed as possible but now I start to lose material.",
        "24. hxg7 Qf7": "24. ... Qf7 - and where there is a threat of Old Matey, Glenda always tries to protect her better half by snuggling up to him,  aaaah!",
        "25. Na4 Ne7 26. Rf2 Bh5 27. Bxh5 Qxh5": "27. ..... Qxh5 - trying to trade out of trouble.",
        "28. Raf1 Qf7 29. Rh2": "29. Rh2 - now my h pawn is in danger.",
        "29... b5 30. cxb5 axb5 31. Nc3": "31. Nc3 - at least my queenside is a little less cramped but alas it does not help much.",
        "31... Nb6 32. Nxb5 Nbxd5 33. a4 c6 34. Na3 Rxb4": "34. ...... Rxb4 - at last some further queenside counterplay, but again, what good will it do?",
        "35. Qd2 Rxa4": "35. ...... Rxa4 - at least I have now gotten rid of Mike's queenside pawns and my pieces are a lot freer on the queenside but the kingside is still very much an issue.",
        "36. Qg2 Nxe3": "36. .... Nxe3?? - I cannot resist taking another pawn and inflicting a knight fork.  Alas, Mike gets out of it by putting Henry in Old Matey's shadow.  Henry will stay under this shadow for the rest of this game.",
        "37. Qh3 Qg6 38. Qxe3 Nd5 39. Qb3 Rb4": "39. ..... Rb4 - my rook tries to harass the Witch as much as possible but alas, she can escape.",
        "40. Qa2 h5": "40. ..... h5 - trying to break the white stranglehold on my kingside.",
        "41. Nc4 Qh7 42. Ne3 Rb5 43. Nxd5 cxd5": "43. ..... cxd5 - have to retake with the pawn because I do not want my rook to be pinned along the a2-g8 diagonal.",
        "44. Bf6 Rdb8 45. Rd2 Qg6": "45. .... Qg6 - still scratching around.",
        "46. Rxd5 Rxd5 47. Qxd5+ Qf7 48. Qxf5": "48. Qxf5 - grabs another pawn but leaves Glenda on the board.  I start to see that Mike's king is looking very draughty indeed.  This is one reason why I hesitated on hitting that resign button - I am now 3 material points down - as the possibility of a perpetual starts to form in my mind.",
        "48... Qb3 49. Qxe4 Qg3+ 50. Qg2 Qe3+": "50. .... Qe3+ - now four material points down but at least Glenda is in the right area!",
        "51. Kh2 Qd3 52. Rf3 Qf5 53. Qh3 Qc2+": "53. ... Qc2+ - still aiming for that perpetual.",
        "54. Kg3 Qe2 55. Qxh5": "55. Qxh5? - grabs another pawn and leaves Henry shivering.  The Witch is threatening to descend on h8 at any moment. However, I give that move a question mark because ......",
        "55... Qe1+": "55. ...... Qe1+ - CHEEECK!  Now Glenda is in a position to harass King Mike.  Can her checks be perpetually annoying?  We shall see.",
        "56. Kg4 Qg1+ 57. Rg3 Qd1+": "57. ..... Qd1+ - DRAW OFFER .....",
        "58. Kh4": "58. Kh4 - DECLINED.",
        "58... Qh1+ 59. Rh3 Qe1+ 60. Kg4 Qg1+ 61. Rg3 Qd1+ 62. Rf3 Qg1+ 63. Kf5": "63. Kf5 - King Mike tries to evade the perpetual, but Glenda still finds ways of getting at him.",
        "63... Qb1+ 64. Ke6 Qa2+ 65. Kxd6 Rb6+": "65. .... Rb6+ - another pawn drops and I am now the equivalent of a rook and pawn behind, not to mention Henry being in Old Matey's shadow, but the main thing is, King Mike is still being hounded by Glenda and my rook.",
        "66. Kc5 Qa5+ 67. Kd4 Rd6+": "67.  ..... Rd6+ - King Mike now has to be very careful.  With my rook joining in the fun he could now walk into a lawnmower type mating net.",
        "68. Ke4": "68. Ke4 - Mike now allows a perpetual, which I gratefully inflict on him.  Gameknot analysis, much to my astonishment, suggested a winning alternative for me.  I feel gutted to have missed this opportunity but because I did not see it at the time I just wanted to avoid a loss and took the opportunity of doing so.  For now, I still hold on to that Class A rating.  Just.",
        "68... Qd5+": ""
    },
    "url": "https://gameknot.com/annotation.pl/teetering-on-the-brink?gm=58687",
    "gameName": "Teetering on the brink!",
    "players": "dmaestro (1653) vs. jstevens1 (1817)",
    "opening": "English, Kramnik-Shirov counterattack (A21)"
}