{
    "moves": {
        "1. d4 Nf6 2. c4 e6 3. Nc3 Bb4": "So it starts off as a Nimzo-Indian https://en.wikipedia.org/wiki/Nimzo-Indian_Defence",
        "4. e3": "This is my usual reply.",
        "4... c5": "This is quite a reasonable move.",
        "5. Bd3": "I continue with the plan.",
        "5... d6": "He seems to have a plan of putting his pawns on black squares.\n",
        "6. Nge2": "And I have a plan to stop him doubling my c pawns.",
        "6... Nc6": "He is preparing e7-e5.",
        "7. Bd2": "Now I am thinking that maybe if he takes on c3 I can take back with my bishop and have a nice diagonal for it, after I move my d pawn.",
        "7... O-O": "And he castles.",
        "8. a3": "This seems to me to be a natural move, but on the opening databases I use I can only find 0-0 here.",
        "8... Ba5": "I was slightly surprised he didn't take - there would have been some logic in taking and then putting more pawns on black squares.",
        "9. O-O": "And finally I castle.",
        "9... e5": "He continues with his plan",
        "10. d5": "And notice how now we have a similar pawn formation to the Czech Benoni, just like the previous game.",
        "10... Ne7": "The knight drops back. This position was seen in Jeremic, Veljko (2334) vs. Prelevic, Dusko (2385)\t\t2001.03.13 when white continued with Rb1. That plan did cross my mind, but I chose something else - based on preventing his Bc8 finding any decent squares.",
        "11. Ng3": "This is to stop his bishop - or his knight for that matter - coming to f5.",
        "11... Bg4": "And the same move played in the previous game.",
        "12. f3": "The same reply.",
        "12... Bd7": "And the same retreat. Again, I think that black has just lost time. f2-f3 is a move I would quite like to make anyway.",
        "13. h3": "I am planning f3-f4 but I didn't want a black piece returning to g4.",
        "13... a6": "This maybe played more to deter Nc3-b5, as he never tries to play b7-b5.",
        "14. f4": "So I continue with my plan.",
        "14... exf4": "He takes.",
        "15. exf4": "I take back.",
        "15... Qc8": "This move got me thinking? Was he preparing to sacrifice on h3? Was he hoping to play a piece to f5?",
        "16. Qc2": "This move seems to stop both. Bxh3 17. gxh3 Qxh3 18. Be1 and black doesn't have enough for the piece. But maybe f5 was a better move, constricting black more, and preventing his next move. It leaves e5 weak, but it is hard for black to exploit that weakness. ",
        "16... Ng6": "So he moves his knight to a better square.",
        "17. Rae1": "This seemed to be a normal developing move.",
        "17... Bxh3": "And now he plays it! Computer preferred b7-b5.",
        "18. Bxg6": "Fritz says the best way to refute the bishop sacrifice was 18. f5!",
        "18... fxg6": "The best way to take.",
        "19. gxh3": "Now I take.",
        "19... Qxh3": "He takes back.",
        "20. Nce4": "I was scared stiff that he would win another pawn with Nxe4 21.\tNxe4\tQg4+ 22. Kf2 Rxf4+ 23. Bxf4\tQxf4+ 24. Ke2 Qg4+followed by taking my rook on e1 with his bishop on a5. I thought I couldn't play 22. Kh3 because of Rf5, but this is easily met by Ng3. However he didn't play that, he played this,-\n",
        "20... Bd8": "I think this move is dire!",
        "21. Bc1": "Played, to maintain my protection of f4 and also to free my queen for action along the 2nd rank, without blocking the e file.",
        "21... Ng4": "He comes in, with potential mate on h2 if I am not careful.",
        "22. Qg2": "This stops any of that nonsense.",
        "22... Qh4": "He avoids the queen exchange.",
        "23. f5": "This is a mistake. I should have just taken on d6. If he had taken on f5, I can't take back, because he takes back on f5 by his rook, and if I capture on f5 again, then my rook on e1 is taken by his queen. Luckily it doesn't really spoil anything.",
        "23... Bf6": "Threatening a horrible check on d4.",
        "24. Nxf6+": "So I take it.",
        "24... gxf6": "Computer prefers the queen capture.",
        "25. Bf4": "Hitting d6",
        "25... Ne5": "He tries to shield it. OK stop and work out white's next.",
        "26. Re4": "Did you get that? Black is in all sorts of trouble now.",
        "26... Ng4": "The knight has to lamely retreat.",
        "27. Bxd6": "And a pawn goes, attacking his rook.....",
        "27... Rfe8": "... which duly contests the e file.",
        "28. Rfe1": "I could exchange and take on c5, but why give him any activity?",
        "28... Rxe4": "So he takes.",
        "29. Rxe4": "I take back.",
        "29... Qg5": "Moving his queen to somewhere more active.",
        "30. Qe2": "I hit his knight.",
        "30... Ne5": "Knight moves.",
        "31. Bxe5": "I take.",
        "31... fxe5": "He takes back.",
        "32. Rg4": "I hit his queen.",
        "32... Qc1+": "He throws in a check.",
        "33. Kg2": "King up!",
        "33... Kf7": "And he protects g6.",
        "34. fxg6+": "I take.",
        "34... hxg6": "He takes back.",
        "35. Qxe5": "And now - with all sort of threats - he resigns. Many thanks for reading, please rate this annotation on the star system, and leave a comment or two. Merry Christmas, if I don't see you before then!"
    },
    "url": "https://gameknot.com/annotation.pl/telford-a-v-oswestry-a-shropshire-league?gm=60365",
    "gameName": "Telford A v Oswestry A, Shropshire League",
    "players": "Charles L Higgie (ECF177) vs. Richard Thompson (ECF154)",
    "opening": "Nimzo-Indian (E41), e3, Huebner variation"
}