{
    "moves": {
        "1. e4": "Hi everyone!  Just to say that I had a narrow squeak against wakefire who played very well and my position had the worrying hallmark of a jstevens1 game - passive but just about able to hold things together.  My passed c pawn saved the day and prompted my opponent's draw offer which I gratefully accepted!  Cheers.  Joanne",
        "1... c5 2. c3": "2. c3 - a c3 Sicilian.",
        "2... Nf6 3. e5 Nd5 4. Nf3 Nc6 5. Bc4 Nb6 6. Bb3 d6 7. exd6 e5 8. O-O": "8. 0-0 - Henry is tucked away but I will have to develop my queenside somehow and the d6 pawn will soon drop off.",
        "8... c4 9. Bc2 Bxd6 10. d3 cxd3 11. Qxd3": "11. Qxf3 - the start of a queenside liberation process.",
        "11... Bg4 12. Rd1 Be7 13. Qxd8+ Rxd8 14. Rxd8+ Bxd8": "14. ............. Bxd8 - two major pieces have been exchanged but I must develop my queenside.",
        "15. Be4": "15. Be4 - to avoid my kingside pawns being busted but still my knight and Frere Lenoir are at home!",
        "15... Bc7 16. h3 Bh5 17. g4 Bg6 18. Bxg6 hxg6 19. Kg2": "19. Kg2 - forced, to prevent Rxh3, and guess what, the knight and Frere Lenoir are still at home!",
        "19... Nd5 20. Na3": "20. Na3 - movement of that comatose queenside back row at last!",
        "20... f6 21. Bd2": "21. Bd2 - and now Frere Lenoir flies the coup!",
        "21... e4 22. Ng1 g5 23. Nc2 Kf7 24. Re1 Re8 25. Ne2": "25. Ne2 - have spent the last few moves on trying to centralise my pieces, at least the knights are not dim on the rim!  Black still has the edge though.",
        "25... Ne5 26. Ncd4": "26. Ncd4 - a white centralised knight - whoppee doo!",
        "26... Ng6 27. Nf5 Nh4+ 28. Nxh4 gxh4 29. Nd4": "29. Nd4 - not much has changed except that one pair of knights have been exchanged and black has undoubled his pawns.  The only good thing is that the black h pawn provides shelter from hostile castle fire for my own as he cannot take his own pawn.",
        "29... g6 30. c4 Nb6 31. b3 Nd7 32. Nb5 Bb8": "32. ....... Bb8 - if Bb6?? then black will drop the exchange to Nd6 ",
        "33. Be3 a6 34. Nc3 f5 35. gxf5 gxf5 36. Bd4 Be5 37. Bxe5 Nxe5 38. Nd5": "38. Nd5 - gives an illusion of equality but black's central pawns and his knight and rook will soon start to put me under pressure.",
        "38... Nd3 39. Re2 Rd8 40. Kf1 b5 41. Rc2 bxc4 42. bxc4": "42. bxc4 - I must retake with the pawn, else the knight on d5 drops.",
        "42... a5 43. a3 f4 44. Rc3": "44. Rc3?! - my opponent pointed out that f3 would have been better here!",
        "44... f3 45. Rc2 Rb8": "45. ......... Rb8 - suddenly I feel a dark shadow and some cold fetid breath right over me.  Yup, it is the chessic Grim Reaper, Old Matey and I am in his shadow all right.  Black is threatening mate in two.  Kg1 stops the mate because Henry will have a flight square on h2.",
        "46. Kg1 Ne1 47. Rc1 Rg8+ 48. Kf1 Nd3 49. Rc2 Rb8": "49. .......... Rb8 - after a manoeuvering of the pieces we have a repetition of the position on black's 45th move and there is a draw offer!  I accept the draw offer with a sigh of relief.  After the match my opponent sent me a pm telling me he was a little worried about my passed c pawn which had some influence over the draw offer.  Hence, thank heaven for little pawns!   Could black have improved on this.  You the jury decide.  Joanne"
    },
    "url": "https://gameknot.com/annotation.pl/thank-heaven-for-little-pawns?gm=20114",
    "gameName": "Thank heaven for little pawns!",
    "players": "jstevens1 (1744) vs. wakefire (1678)",
    "opening": "Sicilian (B22), 2.c3, Heidenfeld variation"
}