{
    "moves": {
        "1. e4": "Hi guys, I haven't being annotating any chess game recently, because I was preparing for my exams, and finally I got some free time today, so i decide to use the time and bring you guys a very unprofessional chess annotation. This was a game between me and ruderooks, it's definitely not my best game, but I found it quite interesting, let's get started:  My opponent had white pieces, and he started with e4.",
        "1... e6": "Just 2 weeks ago, I was studying French defense, so I decided to use it in this game, e6 was played.",
        "2. d4": "d4, standard.",
        "2... d5": "standard!!!",
        "3. exd5": "exd5! I was soooooo disappointed, after I saw this move, obviously he was trying to avoid the mainline of french defense.",
        "3... exd5": "what else but exd5, I was thinking to offer him a draw, but then I found out, if I draw the game I would lose 5 points, so I continued with exd5. Just kidding :D",
        "4. Bf4": "bf4, a natural developing move",
        "4... Nc6": "Nc6 develops the knight, and adds some pressure on white's center.",
        "5. Bb5": "Bb5, develops the lsb and pins the knight.",
        "5... Bd7": "Bd7 unpins.",
        "6. Bxc6": "Bxc6 it seems that my opponent hated my knight and captured it straight away. Maybe he was just going for a draw. ",
        "6... Bxc6": "what else, bxc6",
        "7. Nd2": "Nd2 I wasn't sure why this move was played, I think Ne2 would be better, because white would be ready to castle, and take note if Nf3 was played, Bb5 could be a possible response, which stops white from castle, and also the bishop is not doing anything on c6, apart from babysitting d5 pawn.",
        "7... Nf6": "Nf6 develops the knight, and maybe Nh5 at some point, just to kick away the dsb.",
        "8. Ngf3": "Ngf3, again if I were white I definitely play Ne2.  ",
        "8... Bb5": "Bb5, stops white from castle, and also the bishop is now functioning on a much better diagonal.",
        "9. a3": "a3 this is not a good move at all, white tries to stop black from playing Bb4, but b2 should have being considered by white, and he can play c4 for the next move, kicks away black' lsb, and then castle. ",
        "9... Nh5": "Knight on f3 is now blocking white queen from watching over h5 square , so black can now play Nh5, attacks white's dsb.",
        "10. Be3": "Be3 was played",
        "10... Bd6": "Bd6, not only develops the dsb, but also gives support on f4 square for the knight to land. ",
        "11. b3": "Finally white realized my lsb was a giant pest, b3 prepares for c4, a little too late, white never had a chance to castle in the game, let's see what happened.",
        "11... Nf4": "Nf4, the threat is Nxg2#",
        "12. Bxf4": "Bxf4 pretty much forced, white could not play c4, because black would play Nxg2+, after Kf1 which is the only move, Nxe3+ forking the king and the queen, thus fxe3 must be played, then dxc4, black would have time to retreat the lsb. However we don't have that.",
        "12... Bxf4": "Bxf4, now black has a bishop pair against two knights.",
        "13. c4": "c4, finally played.",
        "13... dxc4 14. bxc4 Qe7+": "after the pawns were exchanged, I played a in between move, Qe7+, the reason is simple, I was hoping for white to play Qe2, so i would exchange queens and keep the bishop pair advantage in the late middle game or end game. ",
        "15. Kf1": "but black didn't want to exchange queens, and played Kf1.",
        "15... Bd7": "Bd7 then I realized it wasn't an accurate move, because it allows white to play Qb3. ",
        "16. Qb3": "Qb3 As I expected ",
        "16... O-O-O": "I could not play some random moves for example, like b6, that would be disaster, because Re1 wins the queen, however this move is very risky, if white plays carefully, he can use the half open b file and the pawns to crash my queen side. ",
        "17. Re1": "Re1! What?  I just couldn't believe it! Rb1 would be a killer! I just couldn't believe what white played!! ",
        "17... Qd6": "Qd6",
        "18. Ne4": "Ne4 attacks the queen",
        "18... Qa6": "Qa6, bring my queen close to the king, so she can help with the defense, but Nc5 could be absolutely irritating, and also I was thinking if white would play something like Ng5, threats the fork. ",
        "19. Rb1": "luckily none of those happened, Rb1 was played , but my queen is in position to defend. ",
        "19... b6": "b6 stops Nc5",
        "20. Ke2": "Ke2, my opponent wanted to bring out the h1 rook.",
        "20... Ba4": "Ba4, does not give white anytime to breathe. ",
        "21. Qc3": "Qc3, so queen can still defend c4.",
        "21... Rhe8": "Rhe8, non stop attack.",
        "22. Kd3": "Kd3, if white play queen d3, f5 would be played, and the knight would be a goner. ",
        "22... c5": "c5, tries to break down d4. ",
        "23. d5": "Epic blunder by white, d5!!",
        "23... Rxd5+": "Rxd5+, c4 is pinned.... ",
        "24. Ke2": "Ke2, sadly that is the only move.",
        "24... Rxe4+": "Rxe4,suddenly white's position got crashed, and white king is now walking on a rope covered by olive oil. White could have resigned in this position.",
        "25. Kf1": "But he decided to play on a bit, maybe was hoping I would play something like Re1+, still kidding :D",
        "25... Rxc4": "Rxc4, that's obvious, and black resigned. because to prolong the game, white would have to play Qxc4, but that is pointless to continue.  If white played something else, let's say Qa1, hides in the corner, avoids the discover check, then Rc1 discovered double check and mate(lol...). In conclusion: white had so many chances, but he missed too much, and d5 was the main reason that he lost the game so quick. Still I think it's a very interesting game, you may notice that white's king had a very bad day, he went from e1 to f1, f1 to e2, e2 to d3, d3 to e2 again, and then eventually back to f1. Anyway, I hope you enjoyed it, see you guys next time! :D    "
    },
    "url": "https://gameknot.com/annotation.pl/the-little-things-give-your-game-away?gm=50401",
    "gameName": "The little things give your game away",
    "players": "ruderooks (1335) vs. superlalulalu (1555)",
    "opening": "French (C01), exchange, Svenonius variation"
}