{
    "moves": {
        "1. g3 d5 2. Bg2 Nf6 3. b3 e5 4. Bb2 Bd6 5. Nc3 c6 6. a3 Bf5 7. Nf3 Nbd7 8. O-O Bg6": "The beginning of a plan. The idea is not to lose time after e5, Ng5. Luckily, white will exchange NxB, and I would play with the semi opened h column.",
        "9. d3 Qc7 10. Nh4": "Here he goes!",
        "10... O-O-O 11. e3": "Smelling something. It was all too clear I welcomed NxB. ",
        "11... Kb8": "A profylactic move to avoid pins with Bh3.",
        "12. Qd2 e4": "The chosen moment for opening the game. ",
        "13. dxe4": "d4 instead closed the game, but probably in my favour. ",
        "13... Be5": "The key move. One of the pieces between my R and his Q is gone. Nc3 is pinned.",
        "14. Nxg6": "He feared something on e5. ",
        "14... hxg6": "...but gives me this! How to exploit it properly?",
        "15. f4": "Well, the price I had to pay. Only one answer: ",
        "15... Bxc3": "Sadly. ",
        "16. Qxc3": "Removing the Q from the d column. Weak spot in white field: e3, the \"price\" for f4. My strong move: Ng4. When it can take e3 afterward. g7 is weak, but I don't care. How would you take in e4?",
        "16... dxe4": "Nxe4 allowed BxN, and a pawn would have landed on e4, guarding e3. ",
        "17. Qc4": "Forking my f7 and e5 pawns. But forgetting e3. ",
        "17... Qb6": "This is not a sound counterattack. He will play the B, I will block with the pawn, he will retire the B, and I have no Q attacking e3. I could be able to save both of my pawns, though. ",
        "18. Bd4 c5 19. Bb2 Ng4": "Of course I don't care about pawns. Not in this position. If the WQ leaves, c4 threatens e3. h2 is en prise. ",
        "20. Rae1": "? e4 is en prise. ",
        "20... Nxh2": "Bxe4, f5, but it doesn't favour black. I need tempoes to double R on h. ",
        "21. Rf2 Ng4 22. Rd2 Ndf6": "Seizing an opportunity: to sac some pawn to have a Q in d, uncontested!",
        "23. Rxd8+": "Otherwise, RxR followed by Nxe3.",
        "23... Qxd8 24. Qxc5": "A blunder. White must cover d2. ",
        "24... Qd2": "White has to defend with Rf1, but Nxe3 will seal its fate. ",
        "25. Bc3 Qf2#": ""
    },
    "url": "https://gameknot.com/annotation.pl/the-power-of-a-h-semiopened-column?gm=60601",
    "gameName": "The power of a h semiopened column.",
    "players": "ziaghazni (1463) vs. damafi (1434)",
    "opening": "Benko's opening (A00)"
}