{
    "moves": {
        "1. e4": "I'll name this annotation \"The Trojan Horse\" - standard King's Pawn opening",
        "1... e5": "Épine Dorsale - mutual King's Pawn opening",
        "2. Nf3": "Develop King's Knight - which is customary for me leading to my preferred Scotch Game, or Ruy Lopez when I'm feeling more aggressive",
        "2... f6": "Damiano Defense - an inferior response",
        "3. Nxe5": "Damiano Gambit - poison chess at it's greatest.  It's an enticing capture that should be avoided, because that \"piece\" offering comes with bad intentions.",
        "3... fxe5": "Gambit accepted, a common mistake taking the knight - which I refer to as the Trojan Horse",
        "4. Qh5+": "Once the Trojan Horse has been invited inside the walls of Troy, it's only a matter of time before the Spartans sack the city.\n\n",
        "4... Ke7": "From my frame of reference, Checkmate is inevitable at this point",
        "5. Qxe5+": "Keep Black's King in check, to separate further from his defenses",
        "5... Kf7": "Only option for Black",
        "6. Bc4+": "Continued development for White, all while Black's future options are continuing to look bleak",
        "6... Kg6": "Bad option for Black, sacrificing the Queen's Pawn in order to free up the Queen's Bishop, while attacking White's KB, would have been a more prudent option",
        "7. Qf5+": "The Spartans are running wild in the city!",
        "7... Kh6": "Only move at this point, when your King is beyond your defenses - it's not a good place to be",
        "8. d4+": "Again, continued development for White while keeping Black in check",
        "8... g5": "Only move available for Black, # of moves for Checkmate is dependent upon White's response",
        "9. h4": "First move in many that White does not check Black (please see above comment)",
        "9... Kg7": "Shouldn't have been surprised by another poor move by Black, although I was....  Black may have prolonged Checkmate by KB to e7",
        "10. Qf7+": "It's as good as over with another check",
        "10... Kh6": "Only option for Black",
        "11. hxg5#": "Checkmate in 11 - take away, avoid poison pieces & expect the unexpected through respect of your opponent, assume their \"mistake\" was made intentionally - with bad intentions...\n\nread Sun Tzu's Art of War for a fuller appreciation of these strategic theories."
    },
    "url": "https://gameknot.com/annotation.pl/the-trojan-horse-damiano-gambit?gm=51178",
    "gameName": "The Trojan Horse (Damiano Gambit)",
    "players": "chief_rieffer (1713) vs. rampninja (1459)",
    "opening": "Damiano's defence (C40)"
}