{
    "moves": {
        "1. d4 Nf6 2. Bg5": "Already something a little unusual: the Trompowski Attack.  This can lead to some very weird and tactical positions (I've played it once on GK myself, and had the Black pieces on one other occasion).",
        "2... Ne4 3. Bh4": "Not the most popular choice (3.Bf4) but playable and interesting.",
        "3... d5": "Among other possibilities 3...g5 leads to unusual and interesting positions.  It is quite playable, as is the game continuation.",
        "4. e3": "(!?) OK, but more usual is 4.f3, driving off the knight.",
        "4... c5": "Also good here was 4...g5, seeking to exploit White omission of 4.f3.  Whether Black gets much of an advantage thereby is moot.",
        "5. Nf3 Qb6": "Clearly going after the b-pawn.  How should White respond?",
        "6. Na3": "(!?) Inviting the capture, and intending to derive some advantage from the knight's further move to b5.  An alternative was 6.b3, but White's choice is much more interesting.",
        "6... Qxb2": "Boldly carrying forward his own scheme.  Now, not for nothing is the b2-pawn called a poisoned pawn (as in the Poisoned Pawn Variation in the Najdorf Sicilian).  I don't know how many games I've won when an opponent has snatched my b-pawn ('...and welcomes little fishes in/ with gently smiling jaws').  However, here White has no way to round up Black's Queen.  What alternative compensation can he seek?",
        "7. Nb5": "Threatens 8.Nc7+, but the move also has the effect of cutting off, for the time being, the Black queen's retreat to safety.  ",
        "7... Qb4+": "(!) Best to haul one's bunns outta there at once.  The check gives Black a tempo to bring the Queen to a5 betimes.",
        "8. c3": "(?!) Now White gets into a spot of bother.  Better was 8.Nd2.",
        "8... Nxc3": "(!?) Looks obvious and plausible, but this leads to surprising complications.  Simpler was 8...Qa5, whereat Black makes off with his booty.",
        "9. Nxc3": "Forgoing the threats aimed at c7.  An alternative was 9.a3 and Black has no useful discovered check.  If then 9.a3 Qa5? 10.Qd2, White gets the edge on account of the pin at c3.  So Black would probably have to bury the queen once more deep in White's Q-side: 9.a3 Qb2 (threatening 10...Nxb5 as well as 10...Nxd1) 10.Qc1 Qxc1+ 11.Rxc1 Nxb5 with an even (and much less interesting) game.",
        "9... Qxc3+ 10. Nd2": "Two extra pawns ahead for the moment, Black has the advantage. But...",
        "10... cxd4": "(?!) Overlooking White's reply.  Instead, 10...c4 might have been worth a look, seeking to exploit his Q-side majority.",
        "11. Rc1": "(!) Skewering the Queen against the loose c8-bishop.  What can Black do about it?",
        "11... Qa5": "(!?) Now Black loses a bishop, and White emerges with a big edge.  As it transpires, Black did have an effective and tactical way of containing the damage, but it's not at all easy to find: The spectacular 11...Bg4!! retains for Black a slight edge: 12.Bb5+! Kd8 13.Rxc3 Bxd1 14.Rc5 dxe3 15.Rxd5+ Kc8 16.Kxd1 exd2 17.Kxd2... Black still would have had his two-pawn plus, but White's active position would have made up for at least some of that material differential.  ",
        "12. Rxc8+ Kd7 13. Qg4+": "(!) Good follow up.",
        "13... e6 14. Rc2": "Consolidating his ill-gotten gains.  But White could have played 14.Rd8+ and Black would have had seriously to think about 14...Qxd8 so strong would White's attack have been (14...Kc7 15.Qe4+; 14...Kc6 15.e4!).  Still, the text move is sensible enough.",
        "14... dxe3 15. fxe3 Bb4": "Developing with ideas of counterattack.  However, as 16.Qxg7 was probably very good for White, maybe 15...Nc6 was the better option.",
        "16. Qd4": "This centralisation looks OK, but now Black is able to consolidate his centre.  ",
        "16... f6": "(!) Correctly identifying his central pawn phalanx as a key factor in Black's game.  At the moment Black has three pawns for the bishop, a nominal material equality.  The pawns are usually to be favoured when they are well advanced, the piece when they are far back, or weak.  Here, the game seems to be roughly level, as though not far advanced, Black's centre pawns are, or have the potential to become, very strong (Personally, I set a high store on central pawn majorities: they can be and often are game winners).\r\nBefore continuing, although pawn majorities tend to be 'positional' assets, this particular game retains a strong tactical flavour owing to White's highly active pieces.  This game has just begun: there is a long way to go yet, and plenty of excitement to come.",
        "17. Be2 Nc6 18. Qb2 Ne5 19. O-O Rac8": "Over the last few moves, both sides have hastened to deploy their reserves.  The battle lines have been drawn: game on!",
        "20. Nb3 Rxc2 21. Qxc2 Qb6": "Threatening ...Qxe3+, but this is easily thwarted. Black might have considered a Q exchange here (21...Qc7 22.Qxc7+ Kxc7) with the idea of reducing White's tactical chances.  That would have added value to his central pawns.",
        "22. Nd4 Bc5 23. Bb5+": "(!?) Good was 23.Rc1.",
        "23... Ke7 24. a4 Bxd4 25. exd4 a6": "Recognising that 25...Qxd4+?? would have lost: 26.Bf2 followed by 27.Qc7+ etc.  But better was to seal off the c-file by 25...Nc6.",
        "26. Be2": "(!?) But even stronger was 26.a5!",
        "26... Ng6": "26...Nc6 still came into consideration.",
        "27. Bg3": "(!) White has a range of good moves hereabouts.  For instance, 27.Rb1.",
        "27... Kd7 28. Kh1": "(?!) Understandable, with the idea of obviating any inconvenient checks by Black.  But it wasn't necessary, and gives Black an extra move to consolidate his defences.  Instead, 28.Rb1 would have been pretty close to winning.",
        "28... Qxd4": "(?) A mistake that could have lost quickly.  Black had to retain watch and ward over c7 - a particularly vulnerable but vital square right now.",
        "29. Qc7+": "(!) Natch!",
        "29... Ke8 30. Qc8+": "Plausible, and good enough for a big advantage, but Black is just about able to stay (more or less) in touch.  The winning line was 30.Rc1! Qa4 (say, hoping the Q can influence events) 31.Qxb7 Ne7 32.Bd6 Qd7 33.Qxa6 Kf7 34.Rc7.  Black gets driven back and back and then has to give up material.",
        "30... Kf7 31. Qxb7+ Ne7 32. Bh5+": "Raining blows upon Black's game.  But stronger was 32.Bd6.",
        "32... g6 33. Be2 Qxa4 34. Bxa6": "(!?) Very nasty would have been 34.Be5! with attack on the doubly pinned f6-pawn!",
        "34... f5": "Be5 was still threatened, so Black thwarts it.  The downside, though it can't be helped, is that Black is now faced by a serious dark-square weakness that White is not slow to exploit. The game enters a new phase...",
        "35. Bb5": "(!) ",
        "35... Qa8 36. Qc7 Rc8 37. Qd7 Rd8 38. Qc7": "Just testing the waters...",
        "38... Rc8 39. Qf4": "White has no reason to be interested in a draw.  He still has the better of it, though Black is by no means out of the game yet!",
        "39... Rc5 40. Bd3": "(?!) Another retreat that reduces White's attacking potential.  Instead of this, 40.Bd7 would have retained a strong attack.  Black now begins to recover some ground.",
        "40... Qa3": "(!)",
        "41. Be2 Rc2": "(!) ",
        "42. Bb5 Qb2": "Black has developed a threat of his own: a double attack on b5 and g2.  What should White play here?",
        "43. Bd7": "(?) Aggressive, but overlooks a vicious counterblow he could have played: 43.Qb8!! threatens 44.Qe8+ to win the e7-knight.  After 43.Qb8 Nc8 44.Qb7+ White would again be attacking strongly.",
        "43... Rxg2 44. Qe3": "(?) A mistake, though it is not at first sight obvious how Black is able to counter the strike against e6.",
        "44... Re2": "(!) Great move, an X-ray defence.  Naturally, the Queen can't take the e-pawn, but nor can the bishop, even though it is check (45.Bxe6+ Kf6 and after the Q moves off the file, the bishop is lost and Black would be well on the way to winning).  As it is, Black has now seized the initiative.  Can he retain it?",
        "45. Qh6 Kg8 46. Qh4": "(?) Rather a doleful phase of the game for White, as this move could well have lost him the game.  Again, it has to be admitted, given that White is attacking the vulnerable dark square weakness in general and the e7-knight in particular, the refutation is not something that leaps at once to the eye.",
        "46... Qg7": "(?) The obvious defence, and obviously planned ahead of time, but it throws away Black's advantage.   Black had a much better defence - really a counter-attack: 46...Qb7!! - a fantastic 'recoulez pour mieux attaquer' move.  It threatens the light square bishop, which White can of course defend by taking the knight: 47.Qxe7.  But then comes 47...d4+! and White loses at once!  Although pieces have been much reduced in this game, the game remains fiendishly complicated.",
        "47. Bd6": "(!) As you were.  White recovers the initiative, and against the win of material that follows, there is little Black can do.",
        "47... g5": "There is no better defence than this.",
        "48. Qh5 Ng6 49. Qxe2 Qxd7": "Now White has won the exchange.  Yet all is not lost for Black.  He has 4 pawns for it - not a whole rook's worth, withal, but enough to cause White a whole heap of trouble in realising a win.  For example, if Black were, against a lone rook, to get a pair of pawns on the Number 3 rank with the kings out of play, then if neither can be captured on the move, he'd be winning, even if it were not his move.  Something like this: fen=\"8/2R5/7k/8/7K/3pp3/8/8\" w Black wins whatever White plays (e.g. 1.Kg3 d2 2.Rd6 e2 etc).",
        "50. Ba3 Nf4": "(?!) A propos of my last comment: passed pawns should be pushed.  Indicated was 50...d4! and Black would have been still well and truly in the game.",
        "51. Qb2 Kf7 52. Qh8": "(!) The other advantage of advancing the pawn to d4 would have been to prevent this infiltration.  Now Black is in real trouble, and has to hang on through all sorts of dangers.  It is the phase of the game that follows on from this that reminds me of the Fenimore Cooper novel.",
        "52... Kg6 53. Qg8+ Kh5 54. Bc1": "(!) Very strong...",
        "54... Qb5": "Gamely issuing threats, but now White had a forced win.",
        "55. Qxh7+ Kg4 56. Rg1+": "(?) Good enough to retain a big advantage, but White could have cut to the execution here with the remarkable 56.Rxf4+!! and mates in 4 more moves.  The second 'match point' missed!",
        "56... Kf3 57. Rg3+ Ke4 58. Re3+ Kd4 59. Qg7+": "Black's wagon laager has been completely encircled, and soon some stragglers will be picked off.  Black's hopes for survival are fading...",
        "59... Kc5 60. Qe7+": "(?!) ...and might have been extinguished right here with 60.Qc7+! Since 60...Kd4 (61.Qc3#) and 60...Kb4 (61.Qc3+ etc) led to a quick quietus, Black would have had to play 6o...Qc6, whereupon 61.Rc3 settles the matter.",
        "60... Kd4 61. Re1": "A pause to draw breath, and fair enough, too.  Black was threatening 61...Qf1#.",
        "61... Qc4 62. Qxg5 e5 63. Qxf5": "I think White could have improved on this by 63.Bxf4! exf4 64.Qxf4+ and whatever Black plays, he has to drop Queen for Rook: 64...Kd3 (any other move, and 65.Rc1 follows) 65.Qe3+ Kc2 66.Rc1+ will do.",
        "63... Nd3 64. Rd1 e4 65. Qf6+ Kc5 66. Be3+ d4": "Black has now just one pawn for the rook - nowhere near enough even though his last two pawns are connected, advanced and passed.  But White continues to probe, looking for an opening, yet, I suspect, to settle upon a plan.",
        "67. Qf8+ Kd5 68. Qa8+ Kc5 69. Bg1": "Still unable to find a clear winning line, White draws his bishop back out of trouble.  Perfectly safe: he is still pretty much winning.  But, if he had been prepared to give up something, he might have been able to find quicker, tactical roads to the win.  For instance, he could have given up the bishop here: 69.Qxe4! dxe3 70.Qxe3+ ... 71.Qxd3 and obtained a simple win.",
        "69... e3 70. Qa3+": "(!) Possible here was 70.Bxe3, although I would not assert that it's any better than the move played.  E.g. 70.Bxe3 dxe3 71.Qa7+ Kb4 72.Qxe3 Nc5 73.Rd4.  Instead of the knight move, Black could initiate a series of checks for White to survive.  On reflection, the move played is straightforward enough, and ought to win at least a piece...",
        "70... Nb4": "Else the knight is lost.  But now White wins the Queen...",
        "71. Qa5+": "(?) ... or not.  71.Rc1 wins.",
        "71... Kd6 72. Qd8+": "72.Bxe3",
        "72... Kc5 73. Qc8+ Kb5 74. Qd7+ Kc5 75. h4": "At last hitting on the idea of pushing home his h-pawn.  It isn't the only plan he could have adopted, as we have already seen, but it looks promising.  However, he had a better plan available, which would have made a fine and spectacular conclusion to a fascinating game: 75.Rxd4!! Qxd4 76.Bxe3!! Qxe3 77.Qa7+ picking up the loose Q at e3.  A couple of decoy sacrifices followed by a skewer.",
        "75... e2": "(?) Black has to make the best of the slender chances he has remaining, and this is a very desirable advance.  But it ought to have led to a quick loss.  Relatively better was to exchange Queens (75...Qd5+), but it is not at all an attractive prospect.  It is possible that Black saw the possible consequences of this move, but figured, on past record, White might not find the tactical win from here... ",
        "76. Re1": "(?) Missing another killer combination: 76.Bxd4+ Qxd4 77.Qxd4+ Kb5 78.Qxb4+!! (simplest) Kxb4 79.Re1 with an elementary win.  Yet though he's missing the killer combos, White has been doing enough to keep himself well ahead.  For some time now, Black has been living on hope - of which he seems to have an inexhaustible supply...\n",
        "76... Qd3": "(!)",
        "77. Qe7+ Kc4 78. Rxe2": "Another one bites the dust... But White might have been better advised to take with the Queen, to force the Queens off the board.",
        "78... Qf3+ 79. Rg2 Nd5 80. Qe2+": "(!) Once the Queens are off, surely Black's chances go with them?  Well... maybe...",
        "80... Qd3": "(?!) Not that it makes all that much difference here, I would have taken the Queen.   It's a tempo thing.  It is clear White now wants them off, so Black might as well take now, and hit the rook with ...d3 to follow, and some chance, however skinny, of an attack.",
        "81. Qxd3+ Kxd3 82. h5 Nf4 83. Rg3+": "(?!) OK, but more consistent was 83.h6 at once.  E.g. 83.h6! Nxg2 84.Kxg2 Ke4 85.Bxd4! wins.",
        "83... Ke2 84. Rg5": "Still good was 84...h6!",
        "84... d3 85. Re5+": "85.h6!",
        "85... Kf3 86. Re3+": "86...h6!",
        "86... Kg4 87. h6": "(??) Unbelievable!  For four moves White declined to move this pawn though it was quite OK to do so. Now, faced with its imminent capture, White advances it.  But it is precisely now it is a mistake that throws away White's entire winning advantage.  Then what was the correct move?  Although at first sight a rook sac might look good, it doesn't quite work: 87.Rxd3? Nxd3 88.h6 Ne5 89.h7 Nf7 and Black reels in the pawn.  Correct was 87.Re4 and whatever happens, White retains his rook advantage.",
        "87... d2": "(!) Black's only chance, but it's a good 'un.  White has just one problem-like move to draw the game...",
        "88. h7": "(?) ... and this isn't it.  But how was White to find the stunningly paradoxical drawing line?  88.Rd3!! Nxd3 89.h7 d1=Q 90.h8=Q and Black pretty much has to take the perpetual: 90...Qf3+ 91.Kh2 Qg3+ 92.Kh1 etc.\r\nThe rook sac has the effect of drawing the knight away from the corner, away from where the final action takes place.",
        "88... d1=Q 89. h8=Q Qd5+": "What a turnaround.  Still a rook ahead, White can not stop the mate.",
        "90. Kh2 Qg2#": "What a game!  And what a finish!  "
    },
    "url": "https://gameknot.com/annotation.pl/the-prairie?gm=27038",
    "gameName": "The Prairie",
    "players": "blackgnik (1439) vs. theshandykid (1425)",
    "opening": "Trompovsky attack (Ruth, Opovcensky opening) (A45)"
}