{
    "moves": {
        "1. d4": "This is another game I've played in the botvinnik, and fortunately for me another win.",
        "1... d5 2. c4 e6": "My opponent chooses ...e6 before ...c6 in order to take back ...exd5 if I exchange.  However if he plans to play e6 and c6 this order gives him less flexibility with his c8 bishop.",
        "3. Nc3 c6 4. Nf3 Nf6 5. Bg5": "This move indicates my aggresive intent, more common is e3 which can be exciting but this move leads to much more interesting complications in my eyes.  The pin on f6 is the most important part of my position.",
        "5... dxc4 6. e4 b5 7. e5": "In the previous game I annotated I played 7.a4, this is the other possiblity, I prefer this one but the theory goes far, far deeper and is thus much more difficult to play.",
        "7... h6": "The only move to not hang the knight, trying to counterattack with 7... b4 lets me intensify the pin on f6 with 8.Ne4.",
        "8. Bh4": "The pin is the key to my whole position and it's the reason I gave up the pawn on c4, if I exchange my bishop then I lose all my pressure, and thus I retreat and keep the pin alive.",
        "8... g5": "Black tries to break the pin and save his knight.",
        "9. Nxg5": "What's the most important part of my position?  It's the pin on the f6 knight.  I have to keep it alive and I'm willing to give up my f3 knight to keep the pin and eventually win his knight on f6.",
        "9... Nd5": "9... Nd5!?  While 9... hxg5 is the most common move in this position, this move is reasonable if black is willing to sacrifice.  Black tries to get rid of the pin by getting the knight out of there when he has the chance, however this puts the queen in the line of fire.",
        "10. Nxf7": "I, white, take up the challenge, 10.Nf3 defending the bishop is probably fine for white, black is active and has pressure after 10... Qa5 but is covered with weaknesses.  This move makes the black king look a lot weaker as he's lost his f and g pawns.  Oh yeah, and I also pick up the exchange.",
        "10... Qxh4": "Forced",
        "11. Nxh8": "Normally having a knight on h8 or a8 means it will soon be taken, however with my opponents' problematic kingside the knight will soon escape.",
        "11... Bb4": "This move is the most active, and I think it's probably best as black must play actively.  He's down material and must create as much pressure as possible, either the lack of an f and g pawn gives him weaknesses OR he can use them as open files, also his advanced pawns will be weak OR they can be used to attack with.  In this game he tries to activate, but doesn't get enough.  Maybe black doesn't have enough for the rook?",
        "12. Rc1": "I cover knight before trying to exploit his problems.",
        "12... Nd7": "Where else will the knight go?",
        "13. Be2": "His weaknesses must be exploited, with this move I prepare Bh5  where his king will start looking awkward.",
        "13... Bb7": "Black ignores the threats for the sake of finishing development and creating pressure.",
        "14. Bh5+": "I go full tilt for my attack, as he goes full tilt for his.",
        "14... Kd8": "Ke7 or Kf8 loses his his queen to Ng6 !  However, either way my knight is coming out and it's going to enter the attack.",
        "15. Nf7+": "What else?",
        "15... Kc7 16. O-O": "this seems risky... and it seemed risky when I was playing it.  He has an open g file against my king, and active queen and bishop on b7 ready to open up on my king.  However if my king stays in the middle his bishop on b4 will retain a very powerful pin that ties down two of my pieces, my knight and rook.",
        "16... Bxc3": "He has to trade off his bishop as I threaten 17.Nxd5 which would cause ...exd5 or ...cxd5, either one shuts down his bishops diagonal.",
        "17. bxc3 Rg8": "He grabs the open file.",
        "18. Bf3": "I cover g2 and try to counter his pressure on the h8-a1 diagonal.",
        "18... c5": "He attempts the natural break which opens up his b7 bishop.",
        "19. Nd6": "I grab the square that his b4 bishop used to protect.  I also hit his important attacking bishop and his pawn on b5 (with check).",
        "19... Bc6": "He moves his bishop out of the way while also defending the pawn on b5.",
        "20. g3": "I hit his queen and try to cut down pressure on the g file.  However this also weakens my light squares to tactics (though I don't think they work-they're still dangerous), if anyone has another suggestion I'd love to hear it.",
        "20... Nd7b6": "Of course the g pawn is pinned so his queen isn't actually attacked yet, but it soon will be.  Black feels that the knight is best going to b6 and then d5 or a4.  Ideally his knight would come to the kingside, but that's slow.  He had an intriguing option in 20... Ne3?!! 21.fxe3 (21.Qe2 is fine for white, but this is more exciting) 21... Rxg3  22.Kh1 (21.Kf2 is awful 21...Rxf3 simply wins and 21.hxg3 leads to a draw after 21... Qxg3  22.Kh1 Qh3 check and there is an unavoidable repetition) 22...Rh3 (he can't trade bishops yet and this keeps up threats) 23.Qe2 and I can't imagine he has enough.  The whole idea is that there's a lot of possible tactics here, and while I think 20.g3 was reasonable it leaves my position with holes.",
        "21. Bg2": "I get my bishop out of the way, and now the queen is hit.",
        "21... Qe7": "Where else?  If 21... Qg5 22.Ne4! and after the queen moves I play 23.Nxc5 and it hits e6 with a great square for my knight.",
        "22. dxc5": "I grab the pawn but I think it's a pretty bad blunder, I should go with 22.Qh5 which I play next move.  I'll explain it then.",
        "22... Na4": "forking c3 and c5.",
        "23. Qh5": "A move too late.  This threatens h6 and Qf7! trading off to a winning endgame.",
        "23... Rg7": "This defends Qf7 but 23... Naxc3 is more difficult to face 24.Qf7 Qxf7 25.Nxf7 Ne2  26.Kh1 Nxc1 27.Rxc1 where black has an exchange for a pawn and if it's winnable it's tough.  Luckily my opponent went for this line.",
        "24. Qxh6": "I grab h6, which gives him an open h file but also creates threats of getting to the back rank with my queen which would threaten Qc8#.",
        "24... Rh7": "He grabs the file and stops my plan.",
        "25. Qg6 Naxc3": "Only now does he go for this plan, but it's late.",
        "26. Qg8": "threatens mate on c8.",
        "26... Bd7": "He covers the threat... and now I infiltrate.",
        "27. Qa8": "Against threatening mate, this time via 28.Qxa7  Kd8 29.Qb8  Bc8 30.Qxc8#.",
        "27... Ne2+ 28. Kh1": "Black almost has a pretty mate- if he didn't have a pawn on e6 then 28... Rxh2 !! 30.Kxh2 Qh7  31.Bh3 Qxh3# would've made me the loser of this exciting game, as it is he resigned, there's no good defense to my theats.  This was a fun game for me, he tossed out a move I don't know the theory to in a highly complicated opening, and I didn't get slaughtered!  If anyone has any comments or ideas, PM me."
    },
    "url": "https://gameknot.com/annotation.pl/the-botvinnik-2?gm=5870",
    "gameName": "The Botvinnik #2",
    "players": "Me (1800) vs. Class A Player (1900)",
    "opening": "QGD (D31), semi-Slav, Noteboom variation"
}