{
    "moves": {
        "1. e4": "This was a game played with a time control of 15 minutes plus a 10 second increment.\n",
        "1... c5": "My standard counter to 1.e4.\n",
        "2. Nf3 d6 3. Bc4": "Typically, white plays d4 here, but Bc4 is not bad at all.\n",
        "3... Nf6 4. d3": "Guarding the e-pawn while opening up a diagonal for the bishop.\n",
        "4... Nc6": "Taking control of d4.\n",
        "5. a3": "An interesting move, probably played with the aim of retaining the bishop pair if Na5 and playing b4.\n",
        "5... g6": "Another possibility was Bg4 pinning the f3 knight taking further control of d4. However, the bishop on g7 will aid in the control of the central dark-squares.\n",
        "6. Nc3 Bg7 7. O-O O-O 8. h3": "Preventing Bg4.\n",
        "8... e6": "Covering d5 and preparing to break open the center with d5.\n",
        "9. Bd2": "A better place for the bishop is on g5 where it pins the black knight.\n",
        "9... d5 10. exd5 Nxd5": "I played this instead of exd5 because the only way for white to safely dispose of the knight is to take with the bishop which gives me the bishop pair. Taking with the knight fails to exd5 B moves Bxb2 winning a pawn. If white doesn't take then I can double his pawns.\n",
        "11. Bxd5": "I would have accepted the doubled pawns as they exert control over the center.\n",
        "11... exd5": "I believe black has a nice advantage because he has the bishop pair, central control and more space.\n",
        "12. Rb1": "Getting the rook off the bishop's diagonal.\n",
        "12... Bf5": "Developing the bishop, although it appears to have no future here, I plan to play c4 to try to clear up its diagonal and turn white's cpawn into a potential weakness.\n",
        "13. Ne2": "Perhaps with the aim of playing b4.\n",
        "13... c4 14. Ng3": "Pushing my bishop back.\n",
        "14... Be6 15. dxc4 dxc4 16. Be3": "Offering the trade of queens.\n",
        "16... Qxd1": "I accept.\n",
        "17. Rfxd1 Rfd8": "I was struggling to decide whether Rad8 was better but I didn't like how it left the a-pawn weak.\n",
        "18. c3": "Stopping my threat of Rxd1+,Rxd1, Bxb2.\n",
        "18... b6": "Blocking the bishop's attack on my a7 pawn.\n",
        "19. Nd4": "I think this is weak because it creates an isolated d-pawn.\n",
        "19... Nxd4 20. Bxd4 Bxd4 21. Rxd4 Rxd4 22. cxd4": "I now plan to target the d-pawn and prevent it from becoming a powerful passed pawn.\n",
        "22... Rd8 23. Rd1 Kf8": "Bringing the king into the action.\n",
        "24. Ne4 Ke7 25. Nc3": "Preparing d5.\n",
        "25... Bd5": "Blockading the pawn.\n",
        "26. f3": "I prefer g3 followed by h4. placing his pawns on the opposite color as my bishop.\n",
        "26... h6": "Placing my pawns on dark-squares to keep his on light-squares. I think g5 was stronger.\n",
        "27. Kf2 g5 28. Ke3 f5": "Aiming for f4.\n",
        "29. g3 Kd6": "Bringing my king to strengthen the bishop and help blockade d4.\n",
        "30. Nb5+ Kd7": "Nxa7 does not win a pawn because of Re8+ Kf2 f4 gxf4 gxf4 Re1 Rxe1 Kxe1 Bxf3",
        "31. Nc3 Kc6 32. Nxd5 Kxd5": "My king has now replaced the bishop as the blockader of the pawn.\n",
        "33. Kf2 Re8": "Occupying the only open file.\n",
        "34. Rd2": "For some reason he just repeats the same moves for the next three turns.",
        "34... b5 35. Rd1 a5 36. Rd2 b4": "Making use of my queenside pawns.\n",
        "37. Rd1 bxa3 38. bxa3 c3": "I have a passed pawn!\n",
        "39. h4 c2 40. Rc1 Rc8 41. Ke3 Rc3+": "The point of my last few moves.\n",
        "42. Kd2 Rxf3": "White is in serious trouble.\n",
        "43. Rxc2 Rf2+ 44. Kd3 Rxc2 45. Kxc2 Kxd4": "Picking up the d-pawn and he resigns.\n"
    },
    "url": "https://gameknot.com/annotation.pl/the-sicilian-defense?gm=50786",
    "gameName": "The Sicilian Defense",
    "players": "? (1648) vs. benl123 (1700)",
    "opening": "Sicilian (B50)"
}