{
    "moves": {
        "1. e4": "OK, fair is fair, and even though this game hardly deserves any annotation, I have been annotating all my games. This one ends so badly that I'm embarrassed to make it public, but it would be bad form only only make the good games public. Note: my opponent chose the title of the game when he challenged me, and I've left it in his honor, though as you'll see at the end, there might be better names, such as \"Pointless Suicide\"...",
        "1... e5 2. Nf3 Nf6 3. d4": "Petroff's Defense. Mainline says to take the pawn. 3. Nf3 and 3. Bc4 are also playable. The Game DB seems to favor 3. d4 (The Steinitz Attack) so I went with it. My esteemed opponent is rated 723 points higher than I am, so I'm reluctant to branch out on my own sooner than I have to.",
        "3... Nxe4 4. Bd3 d5 5. Nxe5": "Still playing the main line of the Steinitz Attack.",
        "5... Nd7 6. Nxd7": "Black could have responded with 5. Bd6 for what is known as The Symmetrical Variation, but evidently the move as played is considered stronger.",
        "6... Bxd7 7. O-O Bd6 8. c4 c6 9. cxd5": "All standard stuff so far, and all still guided by the Game DB.",
        "9... cxd5 10. Nc3 Nxc3 11. bxc3 O-O 12. Qh5": "Still more DB-inspired moves. I feel that this position is pretty good for white. The white pawns in the center feel strong enough, compared to black's isolated pawn in the center. In return, white has an isolated pawn on a2, but it's less of a concern at the moment. The threat on h7 and d5 seems to win a pawn, but only temporarily, since the white pawn on c3 is backward and hard to defend.",
        "12... g6 13. Qxd5 Qc7 14. Bh6": "Feeble, but it doesn't seem to hurt.",
        "14... Rfe8 15. h3": "This move was in the Game DB (yep, still leaning on my crutch so far). But I'm not sure I like it much. Either way, the H2 pawn needs rescuing, and the c3 pawn is doomed. Or the other way around. I was temped to save the c3 pawn since after 15. ... Bxh2  16 Kh1, black doesn't seem to have a pressing attack. Still, that felt too risky, and the Game DB didn't like it much either.",
        "15... Be6 16. Qf3 Qxc3 17. Qf6": "This is all still by the DB, but now I am fearing I have been steered wrong. All along, the DB indicated the moves I chose were white's best chances, and they all favored white. Still, here I am with a weak isolated pawn on d4, a bishop en prise on d3, and black has 4 pieces well placed centrally and seems to be marshaling for an attack, while my feeble mate threat does nothing more than slow him down. I feel the advantage here is definitely black's, no matter what the Game DB said - I have been deceived.",
        "17... Bf8 18. Bxf8 Rexf8 19. Rfd1 Bd5 20. Rac1": "Everything by the DB so far until now. I'm on my own in shark infested waters. My previous analysis still stands, though now that I've driven back one of the black attackers and exchanged another, the attack prospects seem about even, but white's two isolated pawns cry out to be attacked and slaughtered.",
        "20... Qa3 21. Rd2": "??? This loses immediately. Obviously. This was not the move I had meant to play. I had spent a lot of time analyzing multiple lines, trying to find a way to a drawish endgame. After a long time of analysis, I concluded that 21. Rc2 was my best option. If 21. ... Bxa2, 22. Ra1 looks good. I think I may have saved the a-pawn and held the position for quite a while, seeking exchanges and hoping for an advantage from my passed d-pawn. After all that analysis, I came back and clicked my move, but I moved the wrong rook! Unbelievable. Now I lose both rooks.",
        "21... Qxc1+ 22. Kh2": "I would have resigned on the spot. This game is quite over. I doubt I could win now if I were rated 723 points above my opponent instead of the other way around. But, I had a nice winning streak going, and several games about to conclude in my favor to extend that streak, so I dragged my feet for a few days before resigning.",
        "22... Qxd2 23. Qe5 Rfd8": ""
    },
    "url": "https://gameknot.com/annotation.pl/the-big-bad-wolf?gm=21805",
    "gameName": "The big bad Wolf",
    "players": "blake84120 (1509) vs. easy19 (2232)",
    "opening": "Petrov (C43), modern attack, Trifunovic variation"
}