{
    "moves": {
        "1. e4": "my favourite apparently - must try d4 one day",
        "1... Na6": "strange reply? where you going with that? isolating the knight on the wing for waht purpose?",
        "2. d4": "ok another favourite of mine - if I can develop both center pawns then the bishops can both strike out with ease ...",
        "2... c5": "hmmmmmm? ",
        "3. Bxa6": "ok I'll take the knight - weakening your pawns on the a file. (two pawns in foront of each orher hamper forward progress and are no help in defending each other - a weakness I'll try to exploit later.",
        "3... bxa6 4. dxc5": "and have the pawn that was defended by the knight",
        "4... Qa5+": "whoops, remiss of me... forgot you could do that... ok have the pawn back I'll chase your queen for awhile hopefully",
        "5. Nc3": "knight is best defender - I'll use the bishop to chase your queen",
        "5... Qxc5 6. Be3": "where you gonna go?",
        "6... Qc6 7. Nf3": "develop further - threaten queen agian - allow for castling ",
        "7... d6 8. Qd3": "can't rember the plan fully here, maybe starting to apply pressure to pawns on the a file. Maybe just don't want your bishop to pin my knight on f3 to the Queen... with the chance of wrecking my pawn defences on the kings side. also fully develops major pieces - I now have the choice of castling either side",
        "8... g6": "surely creating opportunities for the bishop?",
        "9. O-O-O": "ok queens side it is.\r\nAnd if I can get rid of the Queen then knight d5 c7 and win pawn on a6",
        "9... f5 10. Qd5": "should annotate as I go along really - there was some real sneaky thinking and analysis here... but it really only boils down to a pawn advantage  attacking either h6 or h7 with the bishop.... \r\nWith the pawn on d5 after exchange and the possibilities of knight attack on either c6 or e6.",
        "10... Bd7": "but then again you don't HAVE to take",
        "11. Nd4": "oh yes you do!",
        "11... Qxd5 12. exd5": "not too sure about this either surely knight takes would threaten c7 as mentioned - though easily defendable with rook-c8 ....  hmmmmm",
        "12... Nf6": "ok you can progress that knight there doesn't look to be any percievable danger.",
        "13. Ne6": "ok .... surely the pawn on h7 is mine ",
        "13... Bxe6 14. dxe6": "now this is probably very silly... retrospectively how did I get there .. don't really wanna defend this pawn - it may actually be indefensible. together with being immovable. e7 is solid. I'll probably give it up as lost.. now I really need to get get at the pawns on 'a' file ",
        "14... h5": "giving your rook the chance for future attack on e6",
        "15. Nd5": "gotta take surely! otherwise h7 is lost.\r\nif you take h6 is lost :-) ... at last ... one track mind ... \r\nObviously I've been working on that a file for some time.",
        "15... Nxd5": "ok",
        "16. Rxd5": "a6 is mine",
        "16... Bh6": "ok - retrospectively ... now I get it ...\r\nI'm aiming to take h7 *after* h6 this is your only opportunity to neuturalise the bishop - whilst getting your rook over to e6 in the meantime... \r\nso be it! though why I didn't think of progressing my pawns, namely f2-f4 is beyond me.. defending the bishop whilst developing the pawns!?",
        "17. Bxh6": "ok I'll press with two rooks in the far corner then - bye bye faithful bishop",
        "17... Rxh6 18. Ra5 O-O-O": "shit! forgot you could still do that! only one pawn then... grrrrr",
        "19. Rxa6": "one pawn ahead going into the end game with e6 pretty undefendable. not happy!",
        "19... Kb7 20. Ra5": "that 'feels' good though if you chase me with your king?",
        "20... Rf8": "ok defending f5",
        "21. Re1": "enter the fray",
        "21... g5": "ok - theres alot of thought here - 'specially around mating your king with two rooks. Either against the a file - or in the corner on a8 - but it would certainly take your complicity ....",
        "22. Re3": "start preparation for attack on king",
        "22... f4": "thats fine - I like e4 ",
        "23. Re4": "now the simple mate is, of course,\r\nJohn comes off back rank with rook to f6 ...\r\nkev goes rc4 - \r\njohn takes kevs givaway pawn\r\nkev goes rb5 \r\njohn k-a8 (oh yeah!)\r\nkiev mate on the last rank\r\n\r\nIn your dreams a little more work to do yet as JD can come forward as well as backwards ....",
        "23... g4": "ok moving your indefensible pawn",
        "24. Ra3": "kiev moves a little further back and hopes John doesn't see mate coming...\r\n(though it still takes a little complicity - If I move rook c4 the king coming forward to b6 wrecks any chance of mate...\r\nAs does johns retreat of his yet unadvanced rook!!",
        "24... f3": "hmmmm - troublesome ",
        "25. g3": "that should stop yer",
        "25... Rff6": "ok so the rook comes forward... lets go for this ill advised mate attempt?\r\nsurely JD can get out of it easily enough!!",
        "26. Rc3": "this is the preparation for .... as you surely know!\r\nJohn takes on e6\r\nkev rook b4 and mate ....\r\n... Of course the problem is. you don't have to take on e6 you could retreat rook to f8 and a draw looks likely ... or you could move your king to b6... and then to a5.. and I can't mate on a3 due to you now threatening my rook..\r\nYour king has too much time to escape the ill informed mate attack..\r\nSo...\r\n1) you retreat your rook - the best I can analyse is a forced draw ..\r\n2) you come forward with your king and I can't force mate.\r\n( and all the while h4 and your rook attacking on the h file is looking *very* dangerous ) (hadn't mentioned that till now but your advanced pawns are a *major* threat)\r\n3) you do something silly and take the pawn on e6\r\n----\r\nDraw offered ...\r\n----\r\nThough in retrospect I *could* have forced mate on the a file if you'd done anything other than retreat to f8 ...\r\neg ... Kb6\r\nRb4  ... Ka5\r\nRc-b3 ...\r\nand how do you defend against c3 and ra3 \r\n----\r\nhmmmm\r\nA good game - you didn't capitulate under pressure as you have before and were solid in your moves. Gave me plenty to think about at all times during the game... Of course this plays a big part in putting doubt into other player minds. and here I offered the draw prematurely because of this --- should have waited to see how you played your next move at least....\r\n\r\nAfter all you could have taken the pawn?\r\n"
    },
    "url": "https://gameknot.com/annotation.pl/the-3-day-challenge?gm=5428",
    "gameName": "the 3 day challenge?",
    "players": "kiev53 (1200) vs. felius (1132)",
    "opening": "Lemming defence (B00)"
}