{
    "moves": {
        "1. e4": "This game features the very dated variation of the Dragon where White wins a pawn but allows activity for Black. The main defender of this line for Black is GM Fedorov, scoring quite well with it.",
        "1... c5 2. Nf3 d6 3. d4 cxd4 4. Nxd4 Nf6 5. Nc3 g6 6. Be3 Bg7 7. f3 O-O 8. Qd2 Nc6 9. O-O-O": "This is slowly gaining favor over the old 9.Bc4, which though still difficult for Black, is gaining new favor because of newly found resources, one of them being the very modern and fashionable Chinese Dragon.",
        "9... d5": "The most critical response. Other moves that are playable here are: 9...Nxd4 10.Bxd4 Be6, although a plan involving 11.Bb5, with the idea of Ba4-Bb3 has proven quite successful for White, and 9...Bd7 10.g4 Rc8 11.h4, and it looks like White's attack will be faster than Black's.",
        "10. exd5": "10.Kb1 is a new idea here, though I'll hopefully play it in a future game and explain it more thoroughly there.",
        "10... Nxd5 11. Nxc6 bxc6 12. Nxd5": "12.Bd4 is the current main line, but my personal feeling is that Black can hold the position there.",
        "12... cxd5 13. Qxd5 Qc7 14. Qc5 Qb8": "Believe it or not, I think this is the losing move. It's not really apparent but Black is left without an important tactical resource to counter White's defensive set up.",
        "15. Qa3": "As a side note, only play this after 14...Qb8, if 14...Qb7, play 15.b3. It doesn't allow the following trick by Black 14...Qb7 15.Qa3 Bf5 16.Bd3 Rab8 17.b3 Qc6!, with the point that if 18.Bxf5 Qc3 and White is in trouble.\n\n",
        "15... Be6 16. Ba6": "Stopping a5 and now allowing a Rook to come to c8.",
        "16... Qe5": "After 16...Qc7, White should play c3 to blunt out the Bg7.",
        "17. g3": "Preparing Bf4 and freeing the Rook from the defense of the h2 pawn.",
        "17... Rad8": "Preventing 18.Bd4",
        "18. Bf4 Qf6 19. Bc7": "Forcing the exchange of one pair of Rooks.",
        "19... Rd7": "If 19...Rxd1+ 20.Rxd1, White has stabilized the position and the Rf8 has no good places to come into play.",
        "20. Rxd7 Bxd7 21. Re1": "If 21.Rd1 Qc6 22.Bf4 Bf5 23.Bd3 Qxf3.\n\nNow e7 is under attack but Black should create threats instead of wasting time defending it.",
        "21... Bf5": "Threatening Qc6. If 22.Rxe7 Qc6 23.Bd3 Qxf3 24.Bxf5 Qf1+ (forcing the White King to come to the center) 25.Kd2 Qxf5 and Black is better.",
        "22. Be5": "The general aim for White in this line is to exchange pieces and enter the endgame where his extra pawn will grant him victory.",
        "22... Qc6 23. Bd3 Bxd3 24. Qxd3": "One pair of Bishops has been exchanged and now White can be a little more relaxed. Black has to either exchange the dark squared Bishops or reroute to a less active diagonal. I can't blame him for choosing the latter.",
        "24... Qe6 25. Qb3": "Offering a Queen swap after which the c-pawn could advance unhindered.",
        "25... Bh6+": "Activating the remaining Bishop.",
        "26. f4": "Finally getting rid of the f3 weakness but entering a slightly annoying pin.",
        "26... Qh3": "Invading the White squares. The fact that Black is forced to attack measly pawns instead of the King means that White is out of the woods.",
        "27. Qf3": "Indirectly defending h2, since after Qxh2, Rh1 wins the Queen.",
        "27... f6 28. Bc3 e5": "Exploiting the pin. Believe it or not, all of these moves have been played before. Here, the stem game continued with 29.Kb1, but after 29...exf4, Black survived.",
        "29. Qd5+": "This is much stronger as it shows that it's Black's King turn to come under attack.",
        "29... Kh8": "If 29...Rf7, then 30.Kb1 and exf4 isn't possible on account of 31.Re7.\nIf 29...Kg7, then again 30.Kb1 but now 30...exf4 is possible but still 31.Re7+ is the move of choice, and after 31...Kh8, it's time to give the White monarch some breathing room with 32.a4",
        "30. Kb1": "Finally breaking the pin.",
        "30... exf4": "Trying to win a pawn. But now it's White's turn to harass the King's castled position.",
        "31. Bb4": "Making room for the Queen to come to f7.",
        "31... Rg8 32. Qf7 Qc8": "32...Bg7 loses to 33.Re8 and Black has to give up the Queen to stave of mate.",
        "33. Be7 Bg7 34. Bxf6 Bxf6": "34...Qf8 was more stubborn but after 35.Bxg7 Qxg7 36.Qxf4 he is two pawns down and out of threats to stay in the game.",
        "35. Qxf6+ Rg7 36. Re7": "A horrible pin. Black is hopeless.",
        "36... Qg8 37. gxf4 h5 38. Rxa7 Kh7": "Forcing the exchanges but now the simple march of the a-pawn is decisive.",
        "39. Rxg7+ Qxg7 40. Qxg7+ Kxg7 41. a4": "Black resigned.\n\nI'm still wondering why this line has fallen out of favor with top GMs, White just seems better and with a little defense he should hold on to the extra pawn and succeed in the endgame."
    },
    "url": "https://gameknot.com/annotation.pl/the-importance-of-a-square?gm=25435",
    "gameName": "The importance of a square",
    "players": "nyctalop (1663) vs. eddeeagle (1601)",
    "opening": "Sicilian (B76), dragon, Yugoslav attack, Rauser variation"
}