{
    "moves": {
        "1. d4 c5": "The Old Benoni Defence, as once played by Tartakower and Alekhine a few times. Although it is common at club level (always trying to catch your opponent unawares in an unfamiliar opening) it is very rare at GM level. ",
        "2. d5 Nf6 3. c4": "The other possibility, Nf3, has had great success for White on Gameknot 1900  games. ",
        "3... d6": "The classical e6 is better here, or even switching to the Benko Gambit with b5! However, d6, know as the Hromodka System of the Benoni Defence, has proved the best move for Black on Gameknot. ",
        "4. Nc3 g6 5. e4 Bg7 6. f4": "Move 6 is decision time for White and he has a lot of valid and interesting choices. The most common are Nf3, Bd3, Be2 or h3, all offering standard development. Other interesting possibilities are f3 and Bg5. I think this would a perfect set position for a Mini-Tournament, leaving White to choose his 6th move. I went for f4, an aggressive line against the King's Indian Defence.  ",
        "6... O-O 7. Be2": "Nf3 is more common and continues the main line against the Hromodka System. Be2 moves us into the 4 pawns attack against the King's Indian Defence. ",
        "7... e6 8. Nf3 exd5": "This is the Florentine Gambit, says the DB on Gameknot. Personally, I've never heard of it! Let me know if you have and why it's considered a 'gambit'. ",
        "9. cxd5 Re8": "Now we can finally give the game it's definitive opening classification: A69 Modern Benoni: Four Pawns Attack. If Black had played Bg4 here it would be classified the Four Pawns Attack of the King's Indian. Other interesting choices for Black here were b5 and Nbd7. ",
        "10. e5 dxe5 11. fxe5 Ng4": "It is considered too risky for Black to play Nfd7 here.\r\n12.e6 fxe6, 13.dxe6 Nb6 (or Nf6), 14.Qxd8 Rxd8, 15.Nb5 Na6 (to avoid Nc7 and getting the rook on a8), 16.e7 Re8, 17.Bg5 and the passed pawn should prove a painful splinter. ",
        "12. Bg5": "White prepares to advance his d-pawn. The Bishop can then come into e7. ",
        "12... Qb6 13. O-O Nxe5": "White is a pawn down. For what benefit? His pieces are all developed and thus more active. ",
        "14. d6": "This is the move I was preparing, and as I expected, it came as a surprise to gm_dursley, who expected the usual Nxe5. ",
        "14... Qxb2": "And White is now 2 pawns down. Ah, the b2 pawn, infamous for being the 'poisoned pawn'. What other options did Black have here? \r\n\r\nThere is c4 , which gm_dursley long considered before opting for Qxb2. A possible continuation is: 14. ... c4 , 15.Kh1 Qxb2, 16.Rc1 Nbc6. \r\n\r\nBut the best was probably 14. ... Bf5, 15.Nd5 Qxb2, 16.Nc7 Nbc6, 17.Nxa8 Rxa8. Black is a point ahead and, most importantly, he has activated his second knight and bishop. ",
        "15. Nd5 Nxf3+": "When ahead, exchange pieces and head for the endgame. \r\n\r\nAnother strategy, however, is to use your extra material to gain a winning advantage. Again I would have played Bf5 here. The exchange removes Black's best placed minor piece and allows White's bishop the h1-a8 diagonal. ",
        "16. Bxf3 Bd4+ 17. Kh1 Qxa1 18. Qxa1 Bxa1 19. Rxa1": "White is 4 points down.\r\nAm I losing?",
        "19... Nd7 20. Be7 Rb8 21. Nc7 Rf8 22. Re1 Kg7 23. Bxf8+ Nxf8 24. Re8": "Believe it or not, we are still in the Chessbase DB.\r\nKluss (2195) 1-0 Schwiezer (2190) Germany, 1995. ",
        "24... c4": "The DB game continued 24. ... Nd7. ",
        "25. Nb5": "The game actually looks pretty much equal at this point, and so I offered gm_dursley the draw. He declined the offer. ",
        "25... a6": "Having declined the draw he plays a poor move. Nd7 was needed here.",
        "26. Na7": "Maybe gm_durlsey missed this move? Or did he over-value his c-pawn?",
        "26... c3 27. Bd1": "A serious blunder would be 27.Rxc8?? Rxc8 28.Nxc8 c2 and the pawn queens. \r\n\r\nBlack should also win after 27.Nxc8? c2 28.Re1 Rxc8.",
        "27... Bg4 28. Rxb8 Bxd1 29. Rxb7 c2 30. Rc7": "And now the question is: Am I winning?!\r\n\r\nThe c-pawn can go nowhere and now I have two choices which should lead to victory: 1) protect and push the d pawn; or 2) abandon it and exchange the knight for the bishop and c-pawn, giving me a won rook pawns v. knight pawns endgame. \r\n\r\nGm_dursley was off-line at this point which gave me time to play through both lines. In the end I chose the former, which I believe is the more difficult, but leads to the quicker win. ",
        "30... Ne6": "Kf6 was better here. ",
        "31. Rc4 Nd8 32. Nc8 f5 33. d7 Kf6 34. Kg1 Ke6 35. Nb6": "This is lost for Black now. His knight and bishop are completely inactive. ",
        "35... h6 36. Kf2 f4 37. Ke1 Ke7 38. Kd2 g5 39. Rd4": "With the King guarding against c1Q, the rook is free to force the issue at the other end.",
        "39... Nc6": "This may look strange, but otherwise White's knight will go to c8 , then the rook to d6, from where it can start mopping up Black's pawns.",
        "40. Re4+ Kd6 41. Re8 Bg4": "And the rest is automatic. ",
        "42. d8=Q+ Nxd8 43. Rxd8+ Kc7 44. Rh8 Kxb6 45. Rxh6+ Kb5 46. Rg6": "An interesting game clearly highlighting the potential power of a passed pawn. All comments and queries are welcome. "
    },
    "url": "https://gameknot.com/annotation.pl/the-power-of-a-passed-pawn?gm=14170",
    "gameName": "The power of a passed pawn.",
    "players": "lecce-wulf (2283) vs. gm_dursley (2198)",
    "opening": "Old Benoni defence (A43)"
}