{
    "moves": {
        "1. e4": "Ah, the Blackburne Shilling gambit.  Probably my favourite chess trap, although it's very easy for an experienced player to spot and avoid.  I certainly wouldn't recommend using it...ever...because there are several chances for White to decline, escape and capitalise on the early sacrifice of Black's material and position.  But a fun party piece all the same.\r\n\r\nThis game is a textbook example of the trap, with a few of the possible escapes outlined. Enjoy!",
        "1... e5 2. Nf3 Nc6 3. Bc4": "A standard Italian Game up until now; this is the point at which Black must decide whether he is actually going to use the Blackburne, or go for something a lot more main line: 3...Bc5 (Giuoco Piano, although I'm not a fan) or Nf6 (Two Knights defence) for example.",
        "3... Nd4": "Nd4?!  The gambit.  Here Black intentionally gives up defence of the e5 pawn in order to tempt a gain of material in 4. Nxe5 and potentially allow White the easy fork with 5. Nxf7.  \r\n\r\nThis is one of the most obvious opportunities for White to sidestep the trap, with 4. Nxd4, which essentially leaves Black underdeveloped with a hanging pawn on d4 and his weak f7 still under threat.  Alternative moves include simply ignoring the Knight and continuing with White's own development, or reinforcing the bishop and undefended pawn with 4. d3.",
        "4. Nxe5": "4. Nxe5?  White falls into the trap -- on first glance this appears to be a move capitalising on Black's \"blunder\".  There is no easy way for Black to gain a pawn back at this point, and White seems set for the fork between Rook and Queen on the next move.",
        "4... Qg5": "4...Qg5!  It is never wise to bring out the Queen so early in the game, but the reason for the pawn sacrifice becomes clear: to persuade the Knight into giving up protection of g5 and h4.  Black now threatens both the unprotected Knight and the undefended g2 square.  Assuming White only notices the first threat, he will continue his plans for the fork with 5. Nxf7.\r\n\r\nThe obvious escape at this juncture is simply for White to castle;  the g2 square is then protected and White can force the Queen to retreat with 6. d3 or f4.  Another playable counter is 5. Nd4, which both blocks the Queen's threat to g2 and prevents 5...Qxe5, which would be the result of White castling, losing him the Knight and allowing Black to strengthen his position.  ",
        "5. Nxf7": "5. Nxf7??  A very good move at first glance, but this will essentially bring about White's downfall: even though he has forced a fork between Queen and Rook (defended by Bc4), it is unlikely the Knight will get a chance to move again following...",
        "5... Qxg2": "5...Qxg2!!  A highly aggressive attack on White's kingside.  The placement of the d-file Knight is now revealed as very significant, as it blocks the King's only escape.  White is practically forced to play 6. Rf1, as playing Rg1 or leaving the rook where it is will result in a back rank mate.",
        "6. Rf1": "Forced.",
        "6... Qxe4+": "6...Qxe4 !!  Black gains back his sacrificed pawn and puts White in an embarrassingly early (and constricting) check.  Notice how forcing the Rook closer to the King has severely limited his options of escape.\r\n\r\nThis is essentially White's final opportunity to escape the Blackburne Shilling trap:  if he plays 7. Be2, he smothers his own King and is mated in one;  if he plays Qe2, sacrificing his Queen (which some players seem reluctant to do, even in the face of imminent checkmate!), it prolongs his game somewhat, but he is still left in a terrible position and down by a significant amount.",
        "7. Be2": "7. Be2??  Not wanting to lose his Queen, White blocks the check with his bishop.  But the King is now fully surrounded by his own pieces and the coup de grace comes in the form of...",
        "7... Nf3#": "7...Nf3!!#  A smothered mate.  White's bishop cannot take the Knight without exposing the King to a second check, and so, drowning in his own pieces, White is finished.\r\n\r\nAs I said at the start, there are a number of ways to avoid this trap (for beginners and inexperienced players -- experienced players would hopefully spot this one a distance away).  In any case, I use this one more for humour than anything else; you feel a little guilty just using it!"
    },
    "url": "https://gameknot.com/annotation.pl/the-blackburne-shilling-gambit-ins-and-outs?gm=3792",
    "gameName": "The Blackburne Shilling Gambit: Ins and Outs",
    "players": "xxxxxxxx (1277) vs. bzbright (1203)",
    "opening": "Blackburne shilling gambit (C50)"
}