{
    "moves": {
        "1. d4 Nf6 2. c4 c5 3. d5 b5 4. cxb5 a6 5. bxa6 Bxa6 6. Nc3 d6 7. e4 Bxf1 8. Kxf1": "We pick up the game mid way through the theoretical main lines. ",
        "8... g6": "critical idea where black wants to develop his DSB bishop on the strong diagonal ",
        "9. g3": "Making room for the white king who for the most part will be safe on g2. Though later on he may have to watch out for tactical threats along the a8-h1 diagonal ",
        "9... Bg7 10. Nf3 O-O 11. Kg2": "White has essentially castled the old school way. ",
        "11... Nbd7": "Develops a piece and prepares to create an outpost on ...c5 later on. ",
        "12. a4": "one of white's long term assets is the passed a-pawn. This kicks off some tactics as well as creates an outpost on b5 for the white knight. ",
        "12... Ra6": "lifting the rook and preparing for possible operations in the centre by supporting d6. The long term idea is to play ...e6 liquidating white's center pawns and creating possible tactic against white's king along the light squares with the queen on a8. Also with the queen on a8 taking on the white a-pawn is a threat. ",
        "13. Qc2": "!? first major deviation from main line theory. The idea is to fight against ...c5-c4 and support a4 and e4. I think it is a pretty useful move. The two more popular moves are Re1 and Qe2. But IMO both are not as useful as Qc2. ",
        "13... Qa8": "Black continues to put pressure on a4 and build long term tactics on the a8-h1 diagonal. ",
        "14. Nb5": "Not only does this knight look strong here it hits at black critical square of d6. The tactical idea is that it inhibits ...e6",
        "14... Rc8": "black is clearly wanting to play ...c5-c4 making room for ...Nc5. Tactically after a future exchange on ...c5 the rook is lifted and has a powerful c-pawn that is well supported by the DSB on g7 and rook on c5.  ",
        "15. Bd2": "Of course I have prepared for this tactical idea by black and played Qc2, Nb5 and Bd2 making the journey of the black c-pawn a dangerous one. ",
        "15... c4": "Only move that gives black a chance in this position. Black can not afford to be timid. ",
        "16. Bb4": "The idea of Bd2 was in anticipation of ...c4 now ...Nc5 is short lived. This sets up a critical moment for black. As I see it black has two moves",
        "16... Nc5": "!? this is the main move and if black can play it he would dearly love to play it. But can he? You see, the other alternative that I am sure is a novelty is the exchange sacrifice 16. ...Nb6 supporting c4 and adding another attacker onto a4. Which in my mind would force me to play the unwanted 17. a5 Nbxd5!? 18. exd5 Qb7 19. Qa4 Rb8 looks decent for black. But as this game progress you be the judge on whether 16....Nc5 is playable. ",
        "17. Bxc5 Rxc5 18. Ra3": "Lifting the rook and tactically threatening Rha1",
        "18... e6": "!? a super risky move that really puts black behind the 8-ball. The final game in my database continued with 18...Nfd7 which ended in a draw. ",
        "19. dxe6 fxe6 20. Re1": "defending e4 and threatening e4-e5",
        "20... d5 21. exd5 Nxd5 22. Re4": "now the critical black c-pawn finds itself under attack. Slow but surely black's pieces get deflected away from a4. ",
        "22... Bf8": "because the c-pawn is threatened so is the hanging rook on c5. So black feels obliged to move the bishop off it's strong diagonal and onto a weaker one. ",
        "23. h4": "White has many threats now. h4-h5, Nbd5 attacking e6 and Rxc4",
        "23... Be7 24. h5": "boom!",
        "24... Nf6": "24...g5 is met with 25. Qe2",
        "25. Rd4": "The rook invades black territory ",
        "25... Nxh5 26. Rd7": "the rook lands on the 7th rank with big plans",
        "26... Qe8 27. Rc7": "Threatening Rxc5 with the fork on c7",
        "27... Rac6 28. Ra7 Bf6 29. Ra1": "The idea is Rd1-Rd7 but maybe simpler was 29.Nfd4 Bxd4 30. Nxd4 Rd6 31. b4!!",
        "29... Rd5 30. Rd1 Rxd1 31. Qxd1": "Tactical threat of Nd6 or Nc7 ",
        "31... Rc8": "black allows Nd6 with the idea of getting the queens of the board. ",
        "32. Nd6 Rd8": "with a passed a-pawn I am more than happy to exchange down to a simplified endgame. ",
        "33. Nxe8 Rxd1 34. Nxf6+ Nxf6 35. a5": "Because of the innate power of the a-pawn I think 16....Nb6 with the aim of getting rid of the pawn was ultimately black's safest option.  ",
        "35... Rb1 36. a6 Rxb2 37. Rc7": "black is a dead duck. The white rook will clean up pawns",
        "37... Ra2 38. a7 Ne8 39. Rc8 Rxa7 40. Rxe8+ Kf7 41. Rc8": "wins a pawn",
        "41... Kf6 42. Rxc4 h6 43. Nd2 Ra2 44. Ne4+ Ke5 45. Kf3 Ra3+ 46. Rc3 Ra1 47. Re3 Ra7 48. Ng5+": "winning a pawn. ",
        "48... Kf6 49. Nxe6 Ke7 50. Nf4+ Kf7 51. Re6": "winning another pawn. ",
        "51... g5 52. Rxh6 Ra3+ 53. Kg4 gxf4 54. Kxf4 Ra2 55. f3": "and it is over. Hope you enjoyed it. "
    },
    "url": "https://gameknot.com/annotation.pl/the-furious-benko?gm=60281",
    "gameName": "The furious Benko",
    "players": "elyhim (2519) vs. the_great_omni (2445)",
    "opening": "Benko gambit (A59), main line"
}