{
    "moves": {
        "1. d4": "my favorite",
        "1... d5 2. c4 c6": "the slav defense",
        "3. Nc3 Nf6 4. Nf3 e6 5. Bg5": "standard move",
        "5... Be7 6. e3 O-O 7. Rc1 Nbd7 8. Bd3 a6": "i think this is a variation of the slav",
        "9. c5": "!? i did this so he wont go b5 and attack my c4 pawn twice. but at the same time he can get ready to try to advance to e5",
        "9... Re8 10. Qc2 Nf8": "now, if bxf6 then bxf6 and i cant take on h7 with my bishop cause of his f8 knight",
        "11. Ne5 Nh5 12. Qe2": "!? this shows i want to attack his king! if i went bxe7 then qxe7 followed by f6 then the knight moves go e5",
        "12... Bxg5 13. Qxh5": "attacking f7",
        "13... f6 14. Nf7": "!? a dubious idea!!?? I'm going to take his DSB and double his pawns",
        "14... Qe7 15. Nxg5 fxg5 16. h4 g4": "! if qxg4 then e5 attacking my queen (the LSB is) then i move my queen he can get play in the center",
        "17. f4": "!!this is a excellent move it prevents the threat of e5 ",
        "17... Bd7 18. Na4": "! planning to go nb6 rook moves, nxd7 qxd7 qxg4 with a pawn up",
        "18... Rad8 19. Nb6 h6 20. Nxd7 Rxd7 21. Qxg4": "im up a pawn",
        "21... Nh7": "my LSB is better then his knight why? it controls more space",
        "22. Qe2 Nf6 23. a4": "! this move is to close the queen side down",
        "23... Qf7": "planning qh5 and an exchange of queens",
        "24. g4": "! this stopped that",
        "24... Rc7 25. Kd1": "! get my king out of the way so i can work  on the king side",
        "25... Qd7 26. Qg2 Qf7": "no where to go",
        "27. h5": "! a excellent move! i want to go g5 but, if g5 first he go h5! ",
        "27... Rf8 28. Bg6 Qd7 29. a5 Qe7": "he cant do anything",
        "30. Kc2 Qd7 31. Rcg1 Ne4": "!? hopping i would trade my good bishop for his bad knight!!",
        "32. b4 Nf6 33. g5": "now i push!",
        "33... hxg5 34. Qxg5 Ne4": "attacking my queen",
        "35. Qg2 Rf6 36. h6 Rxg6": "he has to take if not i can keep on pushing my h pawn!",
        "37. Qxg6 Qf7": "he wants to trade queens and get in a tough endgame what do i do look at puzzle 62021 and you will see what to do!",
        "38. Qh7+": "!!!! the most excellent move of the game!! he resigned why: after kxh7 hxg7+ kg8 rh8 mate or, kf8 rxg7 mating soon!!! hoped you liked it as much as i did please leave a comment or two and rate it on the star system thank you!!"
    },
    "url": "https://gameknot.com/annotation.pl/the-asheboro-open?gm=44603",
    "gameName": " The Asheboro Open",
    "players": "water123 (1888) vs. Damon smith (1828)",
    "opening": "QGD Slav defence, Alekhine variation (D10)"
}