{
    "moves": {
        "1. e4": "He opens with the standard Kings pawn opening, e4.  A chess guru ( who I cannot name. Sorry, I simply forgot it) once said,\n\"Once white moves e4 he is in his death throes.\" Or something along those lines. Landon will soon learn the veracity of this statement.",
        "1... Nc6": "I open with a knight. I like early knight movement, it feels \"nimbler\". This is King's Pawn Nimzovich defence I believe this is classified a \"hyper-Modern\" Opening. I don't know what is \"modern\" about something from the early 20th century (around 1920 according to wikipedia), maybe that is modern is \"chess time\". Landon might be able to shed some light on the \"hyper\" part, his end came at hyperspeed. :)\n",
        "2. Nc3": "Landon responds with his knight, mimicking my move. He's like that. ",
        "2... Nf6": "Out comes another knight, working the center from afar. Soon all 4 horsies will be pointing towards the center. After that it will be time to break the tension.",
        "3. Nf3": "The 4th knight comes out. The board looks nice. But not for long.",
        "3... d5": "Now some trading must occur.  Landon must either trade pawns, or attack my knight. ",
        "4. e5": "He attacks my innocent knight. ",
        "4... Ne4": "I do the only sensible thing and attack him back. The knight move is virtually forced.",
        "5. Nxe4": "Landon chooses the trade. I rather like it.",
        "5... dxe4": "My response attacks his other knight. He HAS to move it in this case. ",
        "6. Nh4": "He runs like a little kid. Waa waa!. I'm not sure g5 would have been any better, and given the following exchange, I'd say it was the right move. ",
        "6... Nxe5": "I snag the pawn. It looks like a freebie, I expect an attack but have a retreat plan.",
        "7. d4": "Why did I not capture enPassant?  I had his knight in my sights. I thought I was going to force him to move it again and allow me to develop another piece.",
        "7... Ng6": "My knight retreats but attacks his knight. At one time I mentioned to Landon how I enjoy trading pieces in front of protective pawn structure because it wrecks their pawn protection and can stop a castle or open up a castled king to attack. Why, oh why, do I help him? ",
        "8. Nxg6": "He takes it and wrecks my plan for a king side castle. He knows this has thrown me off my game and is cracking his knuckles and saying Hallelujah!",
        "8... hxg6": "I take the piece. This does open up the rook file for possible early rook involvement. Thanks Landon!",
        "9. Bf4": "I think we have both realized at this point that a king side castle is out for both of us. Black due to the open file, white due to the same open file and that nasty rook pointing his way. So we prepare to castle. I see no real danger in the bishop move, but I am not thinking of the board position after I castle queen side. Bad move, Dave, bad move.",
        "9... f6": "I want my king pawn to be able to move forward and free my bishop. I plan to castle on the queen side, but I want my bishop open when Black castles.",
        "10. f3": "Landon decides it's time to harass my pawn.",
        "10... exf3": "I haven't figured out what he was thinking on that exchange, it seemed to give me an advantage. But Landon is a very thoughtful person and may have forgotten he is supposed to win.",
        "11. gxf3": "This is a mess. I have NO pieces developed, an awful pawn structure kingside and a hemmed in Bishop. Landon is in better shape, but not by much.",
        "11... Bf5": "I must develop some pieces and this is a safe haven. It also aids my impending QS castle. It will turn out to be a great move. Books might be written about it. Comic books. ",
        "12. Qd2": "Landon gets ready to castle, and frees his Queen.",
        "12... Qd7": "I mimic him, Okay? Sometimes the mentor gets mentored! Prepare to castle. Don't look at the board \"Just do it!!\" Castling is ALWAYS a safe bet. ",
        "13. O-O-O": "Landon secures his King. I mean secures his demise. But it looks good!",
        "13... O-O-O": "I mimic again. Like a dang fool. I knew the \"a\" pawn was weak, but planned to take care of that right away.",
        "14. Qa5": "He gives me a great reason to protect the \"a\" pawn. I also now notice a rather nasty potential for abuse at c7. Thankfully my queen protects. I am starting to curse under my breath a bit at my hasty castle.",
        "14... a6": " Landon is now about to bust a gut. I'm sure he has seen blood and is ready to feed like a psychotic Great White Shark. ",
        "15. Bxa6": "I initially think Landon has lost his mind. I am going to take the bishop with my pawn and be up a piece. What the heck?\nThen I realize the diabolical potential in the move. If I take the bishop mate looks inevitable. He will smother my King in the corner. But after examining the board I realize checkmate is not impending in the corner without bringing up a supporting piece. Still, I decide to leave the Bishop and give my King a flight square. ",
        "15... Qc6": "This attacks a weakened pawn @f3. More importantly it points my Queen directly at c2, the checkmate square. I am grinding my teeth hoping Landon misses this.",
        "16. d5": "Whoops.... In his greedy attempt to checkmate me, Landon forgot the most important piece on the board.",
        "16... Qxc2#": "This caused much teeth gnashing in North Carolina, I'm sure. \nAnd a fair bit of dancing in Kansas!\n\n"
    },
    "url": "https://gameknot.com/annotation.pl/the-9th-dojo-of-a-hatism?gm=2368",
    "gameName": "The 9th dojo of a**hatism",
    "players": "dieselengine9 (1174) vs. graderguy (1492)",
    "opening": "KP (B00), Nimzovich defence"
}