{
    "moves": {
        "1. d3": "I imagine all of us had that draw that sprouted from a lost position. Given the fact that my opponent lost a win, I want to see other peoples' comments on what the given endgame. ",
        "1... d5 2. Nf3 e6 3. g3 g6 4. Bg2 Bg7 5. O-O Ne7 6. Na3": "I thought c4 was a little too symmetrical, if black were to recapture with 6...dc4",
        "6... O-O 7. c4 c6 8. Bg5 Bxb2 9. Qb3 Bxa1 10. Rxa1 f6 11. Bd2 Nd7 12. cxd5 exd5 13. e4 Nb6 14. e5 fxe5 15. Nxe5 Nf5 16. Nc2 Nd7 17. f4": "gameknot's engine gives this move as a mistake",
        "17... Nxe5 18. fxe5 Qe7 19. d4 Be6 20. Bb4 Qc7 21. Bxf8 Rxf8 22. Qb4 Qe7 23. Qxe7 Nxe7 24. Rb1 b6 25. a4 Rc8 26. a5 b5 27. Nb4 c5 28. dxc5 Rxc5 29. Nd3 Bf5 30. Rb3 Bxd3 31. Rxd3 Kf7 32. Bh3 a6 33. Rf3+ Ke8 34. Rf6 Rc6 35. Rxc6": "Again, gameknot suggests Rf1",
        "35... Nxc6 36. Bc8 Nb8 37. Bb7 d4 38. Kf1 Kd7 39. Ke2 Kc7 40. Bd5 Nc6": "for obvious reasons I cannot take the knight as my opponent would definitely win, because it would transpose into a won endgame for Black",
        "41. Kd3 Nxe5+ 42. Kxd4 Nc6+ 43. Kc5 Nxa5 44. h4 h6 45. Bf7 g5 46. hxg5 hxg5 47. Kd5": "this was my plan: to feign an attack on his pawn. ",
        "47... b4": "it worked\r\ncrazy as it seems what one move can do\r\nI believe this moved led me to eventually draw the game. ",
        "48. Kc5 b3 49. Kb4 b2 50. Bg6 Nc6+ 51. Kb3 Nd4+ 52. Kxb2 Kd6 53. Kc3 Ne2+ 54. Kb4 Nxg3 55. Ka5 Ke5 56. Kxa6 Kf4 57. Be8 g4 58. Bd7 Nf5 59. Bc6 g3 60. Kb6 Nd4 61. Bh1 Nf5 62. Kc5 Ke3 63. Kd5 Nh4 64. Ke6": "I don't know if was important to dodge Black's check move. But to error on the right then to error wrong",
        "64... Nf3 65. Kf5 Nd2 66. Kg4 Kf2 67. Bd5 Nf1 68. Kh3 Nd2 69. Kg4": "Blocking Nf3",
        "69... Nc4": "draw offered. "
    },
    "url": "https://gameknot.com/annotation.pl/the-draw-that-almost-wasnt?gm=40962",
    "gameName": "the draw that almost wasn't",
    "players": "freeman8201 (1620) vs. iriship (1680)",
    "opening": "Mieses opening (A00)"
}