{
    "moves": {
        "1. e4": "54th GK Tournament, round 1. Another player leads our group#90 with 5 wins and a loss - I gave him the loss, but we split 1-1. The only way I move on is to win both of my games against my opponent in this game, in which case I am in a 2-way tie for first place in our group at 5-1.",
        "1... c5 2. Nf3": "Black played the Sicilian. Of course. Everyone does. Well, almost.",
        "2... d6 3. d4": "Standard stuff.",
        "3... cxd4 4. Qxd4": "My capture with the queen is the Chekhover Variation.",
        "4... a6 5. Bc4": "Black would like to have played 4. ... Nc6 to attack the white queen, but white would reply 5. Bb5, pinning that knight and sparing the queen the indignity of retreat. By playing 4. ... a6 instead, he protects b5 from the white bishop.",
        "5... Nc6 6. Qd3": "As predicted, but no harm done. White has 3 developed pieces to black's 1.",
        "6... Nf6 7. Nc3 e6 8. a3": "Black might have enjoyed Nb4, forking the queen and the c2 pawn, threatening Nxc2 with a fork against white's king and rook. Also, white's bishop might need to run away. Thus my 8th move, solving both concerns.",
        "8... Ng4 9. Ba2": "I am not sure what 8. ... Ng4 accomplishes. The knight threatens nothing. It might move to e5, forking my queen and bishop. Since I would find that irritating, I relocate the bishop to his previously arranged hideout.",
        "9... b5 10. h3": "Again, black's move perplexes me. 8. ... b5 would have driven off the white bishop and gained a little tempo. But 9. ... b5 does neither. Maybe black plans a home for his bishop on b7. As for white, it's time to drive away the black knight from g4.",
        "10... Nce5 11. Qe2": "But black didn't want to flee just yet. No matter, the queen is happy next to her beloved king, and black's knight is still en prise on g4.",
        "11... Nf6 12. Nxe5": "Though it's not much of a miscalculation, black may have been better off with 11. ... Nxf3 . As played, 11. ... Nf6 allows white to double up the black pawns on the e-file.",
        "12... dxe5 13. Bg5": "And now I play the classic pin.",
        "13... b4 14. axb4": "I welcomed 13. ... b4 since it invites black's king bishop to come play on my side of the board, where it may be vulnerable (for example, if white can play Qb5  after clearing away the pawn from a6). It also tempts black to avoid Be7 breaking the pin on his knight at f6.",
        "14... Bxb4 15. Qc4": "Defends the knight on c3. I wouldn't want black to force me to recapture with my b-pawn if he takes my knight. That would double and isolate my only queenside pawns. It also threatens the overly venturous bishop.",
        "15... Bxc3+ 16. Qxc3": "Recapturing as planned, and putting pressure on e5.",
        "16... a5 17. Qxe5": "I don't know if black just missed the threat on e5, or if he decided to abandon the doubled pawn. It is rather awkward to protect doubled pawns. 16. ... Qd6 17. Rd1 Qb8 would hold the pawn for now, but leave the black queen in a strange and distant place.",
        "17... a4 18. Rd1": "This is when my plan formed. Black's king is exposed in the center. A rook on d8 supported by the bishop on g5 would be checkmate. There is the small matter of black's queen and knight - time to drive them off. It's worth noting that there are lots of things black can do to prevent this checkmate. It's risky to make bad moves that might end in a checkmate, especially if your opponent has simple ways to escape the mate. So, if the checkmate you want to play for is not a forced checkmate, then make sure the moves you make along the way are sound moves so that you don't leave yourself worse off for trying for the failed checkmate. First step, chase away black's queen. This move also places a white rook powerfully on the open d-file - always an excellent place for a rook. And it does so with a threat against black's queen, buying white a tempo.",
        "18... Qa5+ 19. Qxa5": "Even better, black wants to trade queens. White is a pawn ahead and welcomes this trade. Another consideration is worth noting. Even though I drove the queen off of d8, she still protects d8. Here is a secret: When any piece moves, it automatically defends the space from which it moved. I know that sounds obvious, but consider the implications. Driving a piece from a square does not automatically mean you control the square. More often, that square is still in contention, as is the case with d8 after black's 18th move. The queen exchange will solve that.",
        "19... Rxa5 20. f4": "I'm halfway there, but now I need to chase off the knight. 20. e5 would be awesome, except for the fact that black would play 20. ... Rxe5  and my dreams would die unfulfilled. Black is also threatening my bishop on g5 with that same rook. Fortunately, there is one move on the board that solves both concerns. 20. f4! prepares for the advance of 21. e5 and it also defends the white bishop.",
        "20... Nxe4 21. Rd8#": "Ahh, there it is. I didn't expect to actually succeed in the checkmate. Black could have avoided it many ways. 20. ... 0-0 would have worked, though 21. Bxf6 does more damage to black's pawn structure. 20. ... Nd7 also would have worked with no worries about the pawns. 20. ... h6!? would have been interesting, driving the white bishop off of the h4-d8 diagonal, but at the cost of further exchanges that favor white. Still, while the mate was not expected, the moves leading up to it were all valuable moves that advanced white's game, so had black averted disaster at the end, white would have been in a solid position to go on and win the game. The final position is worthy of study. It arises in many games. The triangle formed by white's bishop and rook and the edge of the board is a common mating theme. All it takes is for a piece to exist where the black pawn at f7 is in this example. The rook and bishop cover all the squares to which the king might flee except the one diagonally away from the rook. Here black's f7 pawn contributes to the mate. This triangular checkmate formation (the diagonal between the bishop and rook form the hypotenuse) comes up surprisingly often. I call it the Bermuda Triangle. I don't know if the chess world has a different name for it. Recognizing the formation is a good way to find the checkmates and use them against your opponents, or avoid them when your opponent wants to use them against you."
    },
    "url": "https://gameknot.com/annotation.pl/the-bermuda-triangle?gm=21910",
    "gameName": "The Bermuda Triangle",
    "players": "blake84120 (1509) vs. wormold (1584)",
    "opening": "Sicilian, Chekhover variation (B53)"
}