{
    "moves": {
        "1. e4 Nf6": "Alekhine defense. I never faced it, so I tried to follow the main lines...",
        "2. e5 Nd5 3. d4 c5": "... but my opponent clearly doesn't want!",
        "4. c3": "This position comes out also from a variation of the alapin sicilian, but I saw this only after the game.",
        "4... cxd4 5. cxd4 Qa5+ 6. Nd2": "Other defenses are playable. Also 6.Nc3 Nxc3 that seems to lose the knight, because white has the tactical move 7.Qd2! taking back material. I didn't like 6.Qd2 because I didn't want to exchange queens.",
        "6... Nc6 7. Ngf3 f6": "Let's take a look to the position: white has the two central pawns under attack and right now they are very poorly defended. The knight d2 is pinned and closes the way to the bishop. Black has knights in good positions and looks very solid. However, he has the bishops closed by the pawn an their develop will be very slow. For this reason I think that here was better for black to move a pawn in order to open a diagonal for a bishop, like d6 or g5. The move played in the game is slow and is not a real menace for white center. Now I found the right strategy for this position, that is to try to have a rapid development and to open the central columns to take advantage of the better bishop's position.",
        "8. Bc4 fxe5 9. O-O": "Taking the pawn is a bad move:\na)9...exd4?? 10.Nb3! Qb6 11.Bxd5 and black has lost the knight\nb)9...Nxd4?? 10.Nxd4 exd4 11.Nb3! Qb6 12.Bxd5 and again black has lost the knight",
        "9... Nf4 10. d5": "Taking the pawn is bad, for reasons similar to the precedent comment.",
        "10... Nb4 11. Nxe5": "Again taking the pawn is bad, but black makes the mistake. In my opinion the only good move here was 11...b5, that opens a case for the develop of the bishop but also forces white's bishop to occupy b3, obstructing this good case for the knight.",
        "11... Nbxd5 12. Nb3 Qc7 13. Re1": "I like to write 13.Re1!! probably exaggerating, but I'm really proud of this move. It looks very natural, because defends the knight in e5, but this is not the only reason why I played it. Even if it's not evident now, this move will allows a lot of tactical tricks that, without the rook in this position, would never be possible. The fact is that, when the knight e5 changes position, black's e pawn will be unoffensive (and also \"undefensive\") because of the pin of the tower! ",
        "13... e6 14. Bxd5": "The game now becomes forced.",
        "14... Nxd5": "Obviously not the stupid 14...exd5?? 15.Bxf4",
        "15. Qh5+ g6 16. Nxg6": "Now I can explain the choice of the title \"The power of the pins\": this is the first one of a long series of pins, that will bring white to the win. Black can't play 16...hxg6 because loses quality.",
        "16... Nf6 17. Qh4 Rg8 18. Nxf8 Rxf8 19. Bg5 Nd5 20. Rad1": "Great! Rook d1 can threaten the knight because of the pin of Rook e1 on the pawn! ",
        "20... Qc6 21. Qxh7": "White threatens the checkmate and black enters in a forced combination.",
        "21... Rf7 22. Qg8+ Rf8 23. Qg6+ Rf7": "Now also the rook is pinned!",
        "24. Nd4": "If you take a look, you'll understand that the positional advantage of white is very big. Now every piece is joining the attack, while black has a bishop and a rook completely cut off the fight!",
        "24... Qc5 25. Nf5": "Thanks again to rook e1 that made this move possible!",
        "25... d6 26. Qg8+ Kd7 27. Qxf7+": "Finally black loses the rook and remains with a clearly lost position.",
        "27... Kc6": "The only thing black can do is resign. Any comment i welcome, thanks for watching."
    },
    "url": "https://gameknot.com/annotation.pl/the-power-of-pins?gm=23992",
    "gameName": "The power of pins",
    "players": "redeiperdenti (1791) vs. jarhead1 (1814)",
    "opening": "Alekhine's defence (B03)"
}