{
    "moves": {
        "1. e4": "This game is famous for the concluding combo and the report that Curt von Bardeleben didn't bother to resign but simply got up and walked away without a word..Sour grapes or what! He resigned later on that day! Steinitz was definitely past his best in 1895, but as he himself said, \"I may be an old lion, but I can still bite someone's hand off if he puts it in my mouth.\" ",
        "1... e5": "Black keeps it symetrical and also stakes a claim for the centre.",
        "2. Nf3": "Standard.",
        "2... Nc6": "There are no really solid alternatives here apart from Philidors defence 2....d6 which is indeed solid however has seen little use at master level because it is deemed rather passive. There are some other gambits which are shaky to say the least; 2...f4 The Latvian Gambit; or 2...d5 The bizzarely named Elephant Gambit.",
        "3. Bc4": "This moves signals the beginning of the Italian game. The development of white's bishop to c4 prepares castling, eyes up the f7 pawn and hinders an early d5 by black. This is obviuosly not as popular as its durable neighbour the Ruy Lopez. This is because in most accounts black has a pretty simple route to equality in all directions. However this obviously wasn't realized in the 19th century as it was seen quite often at master level.",
        "3... Bc5": "This is the Giuoco Piano. There are three moves now to be considered. \n1) 4.c3 followed by an immediate d4. If balck isn't careful he can end up very lost, very quickly, but theoretically White struggles to equalize against precise defence.\n2) The Giuoco Pianissimo ('Very quiet game') variations with  d3.\n3) 4.b4!?, the Evan's Gambit, which has been tried by several strong modern players i.e. Nigel Short and even Gary Kasparov.\n4)Nc3 The Italian four knights which often transposes into lines of the Giuoco Pianissimo. ",
        "4. c3": "Steinitz decides to go with the first option I mentioned. This prepares d4. This has one major drawback which is that it takes white's b1 knights most natural developing square.",
        "4... Nf6": "Black takes advantage of whites inability to defend his e4 pawn with Nc3 by attacking it. One lesser alternative includes d6 which aims to defend the e5 pawn from the inevitable advance, however this is an old fashioned move which has now been deemed obsolete.  ",
        "5. d4": "This is the most ambitious move in this situation. The other alternative is 5.d3 which transposes into the Giuoco Pianissimo.",
        "5... exd4 6. cxd4 Bb4+": "This is the only move which leads to equallity for black out of the opening. The other lesser alternative is 6.Bb6 which gives White a slight edge.",
        "7. Nc3": "?! This was the whole point of this opening, white sacrifices material in order to castle rapidly.From a modern perspective , however this line now looks increasingly dubious, and if black is well prepared, he should have no problems.emerging from the opening with a sizeable advantage.\n7. Bd2 is a quieter safer option for white. ",
        "7... d5": "?!Steinitz was willing to sac a pawn or more in return for a lead in development. Curt von Bardeleben declines the offer to win material by (7...Nxe4) and immediately strikesback in the centre. The struggle now shifts to the battle for the control of d5. A rare alternative to 7...Nxe4 8.O-O, when Black may choose between 8...Nxc3 9.bxc3 d5 [9...Bxc3 10.Qb3 has been known to be very good for White since the time of Greco] and the speculative Moller Attack, 8...Bxc3 9.d5, now thought to lead to a draw with best play.",
        "8. exd5 Nxd5 9. O-O Be6": "Steinitz was again willing to sacrifice another pawn,i.e. 9...Nxc3 10. bxc3 Bxc3, in return for rapid development and again Curt von Bardeleben  prefers to concentrate on reinforcing his control over what he percieves the criucial square, d5.",
        "10. Bg5 Be7": "Steinitz develops with a threat by attacking the black queen, which can almost never be a bad move. Curt von Bardeleben must now take a moment to defend against the threat. now both white and blackhave four pieces developed, but white has also castled and is on the move. Which colour would you rather be. White I think, no?",
        "11. Bxd5 Bxd5 12. Nxd5 Qxd5 13. Bxe7 Nxe7": "Black still hopes to connect his Rooks by castling, but he will be unable to shake off the pressure on the central files. A slightly better try was 13...Kxe7 14.Re1  Kf8.",
        "14. Re1": "This pins the Knight to the King.",
        "14... f6": "Steinitz initiated the preceding series of exchanges for a subtle yet ingenious reason. Now Curt von Bardeleben can't castle, because he needs his king to guard the knight. He now hopes to escape his predicament by playing his king to f7 and then a rook to e8, but does he have enough time? I dont tink so!",
        "15. Qe2": "Threatens checkmate.",
        "15... Qd7 16. Rac1 c6": "  Allowing a powerful pawn sacrifice. Better was 16...Kf7, and if 17.Qxe7  Qxe7 18.Rxe7  Kxe7 19.Rxc7 , the ending is by no means clear, though White will have enough pawns for the Exchange.",
        "17. d5": "!A fine move -- the d5 square, which Black has been using for his pieces, will be occupied by a Black pawn, the d4 square is made accessible to White, and the c-file will be opened.",
        "17... cxd5": "Steinitz has sacrificed the d- pawn in order to clear the d4 square for his knight. The time gained to bring the knight into the attack is worth more than one measly pawn. Notice how Von  Bardeleben's rooks still stand on their original squares.",
        "18. Nd4 Kf7 19. Ne6 Rhc8": "Steinitz now threatens to invade with 20.Rc7.",
        "20. Qg4 g6": "Von Bardeleben must now guard against 21.Qxg7 Ke8 22.Qf8 checkmate",
        "21. Ng5+ Ke8 22. Rxe7+": "Of course the Rook cannot be captured by the Queen (22...Qxe7 23.Rxc8 ) and 22...Kxe7 leads to 23.Re1  Kd6 24.Qb4  Kc7 25.Ne6  Kb8 26.Qf4 . But after Black's next move, every White piece is en prise, and mate is threatened on c1...",
        "22... Kf8": "This is an extraordinary situation. Black can't capture the white rook, but white cant capture the black queen!!!!!!!!!!!If 22...Qxe7 23. Rxc8  ( or 22...Kxe7 23. Re1 Kd8 24. Ne6 ) wins for white, but Rxd7( or Qxd7) Rxc1 checkmate wins fro black. Thats what I call a bloody complicated position!Now a comical series of moves takes place, where Steinitz's impudent rook essentially thumbs its nose at Von Bardeleben's King. ",
        "23. Rf7+ Kg8": "Not.23...Kd8 24. Qxd7 .",
        "24. Rg7+ Kh8": "No better is 24...Kf8 25.Nxh7 ",
        "25. Rxh7+ Kg8 26. Rg7+ Kh8": "Steinitz's checks haven't been without purpose, surprisingly!Now that Von Bardeleben h-pawn has been eliminated , Steinitz can bring the queen into the attack with check. White must not allow black to play Rxc1 , which mates quickly, so keepingthe black king in check is crucial. By replacing the harrasing rook with a marauding queen, white increases his attacking force by a decisive amount.",
        "27. Qh4+ Kxg7 28. Qh7+ Kf8 29. Qh8+ Ke7 30. Qg7+ Ke8": "If 30...Kd6 31.Ne4  dxe4 32. Rd1   removes the mate threat and wins the black queen. ",
        "31. Qg8+ Ke7 32. Qf7+ Kd8 33. Qf8+ Qe8 34. Nf7+ Kd7 35. Qd6#": "CHECKMATE! Von Bardeleben walked away from the board without playing out playing the final sequence which is bad manners but understandable. I know if I'd been in his shoes I would have been extremely frustrated by my inability to to move anything other than his king for so long! I hope you liked this game. I'm happy for positive and negative feedback aslong as its constructive criticism! and feel freee to leave comments.\r\nThanks\r\nTom"
    },
    "url": "https://gameknot.com/annotation.pl/the-battle-of-hastings?gm=6571",
    "gameName": "\"The Battle of Hastings\"",
    "players": "Wilhelm Steinitz (?) vs. Curt von Bardeleben (?)",
    "opening": "Giuoco Piano (C54), Greco's attack"
}