{
    "moves": {
        "1. e4": "Hi everyone!\r\n\r\nA player rated between 1800-1999 is a Class A player.  In this game I played like a novice.  Hence the title \"The Beginner with a Class A Rating\".  My opponent's optimum rating was in the 1500s but has recently hit some very bad form.  Here though, my opponent helped me out with some bad decisions of her own.  We start off with a Four Knights Opening.",
        "1... e5 2. Nf3 Nc6 3. Nc3 Nf6": "3. ...... Nf6 - this is the Four Knights Opening where all four knights develop.  With my opponent's next move she plays the Lopez Four Knights which is 4. Bb5.",
        "4. Bb5 Bb4 5. Nd5 Nxd5 6. O-O": "6. 0-0 - a speculative piece sac for quick development.",
        "6... Nde7": "6. ..... Nde7? - this move avoids Bxc6 busting up my pawn structure but this is the start of some bizarre development from Yours Truly.",
        "7. c3 Bd6": "7. ....... Bd6? - in hindsight Bb6 was better but I wanted to bolster my e5 pawn.",
        "8. d4 a6 9. Bc4": "9. Bc4! - moves her lsb on to a better diagonal striking at f7.",
        "9... Ng6": "9. ..... Ng6?? - providing support to e5 and unblocking e7.  But this move allows 10. Ng5!  Maybe better was 0-0 or h6, the latter stopping a knight or bishop incursion on g5.",
        "10. Ng5 f6": "10. ........ f6 - I did consider castling but Qh5! would have resulted in a winning attack.  Now I must bite the bullet.  At least I will get 2 pieces for the rook after Nf7.",
        "11. Bf7+": "11. Bf7+?! - not the best, misses chance to net the rook in the corner and get close to material parity.",
        "11... Ke7": "11. Ke7 - trying to free up the back rank by moving Henry here.  White surprises me by firstly playing her rook to e1 and then waving the white flag.  Although it is a win in the book and I have now completed my Memoralis mini-tournament in second place behind Master Chrisobee with 15 points out of 20 games, black's play was well below the standard required of a Class A player and I like my final position not as I am still horribly tied up despite being a whole piece up.  My assesment therefore is that White has a clear advantage (do note that if I play fxg5?? immediately I drop Glenda to a skewer from white's dsb through BxP+ so I will firstly have to move Glenda to f8 and then Henry to d8 and then Fou Lenoir to e7 before I can do this) - do you the jury agree with this verdict?  I can only now say, whew, what a relief!",
        "12. Re1": ""
    },
    "url": "https://gameknot.com/annotation.pl/the-beginner-with-a-class-a-rating?gm=26066",
    "gameName": "The Beginner with a Class A Rating!",
    "players": "NN (1361) vs. jstevens1 (1825)",
    "opening": "Four knights (C49), double Ruy Lopez"
}