{
    "moves": {
        "1. e4": "Another game from the 52nd Gameknot Tournament, Advanced Section, Round 2.",
        "1... e5 2. Nf3 Nc6 3. Bb5 Qf6": "A novice's response to the Ruy Lopez.  The Queen shouldn't come out this early, where it is prone to attck by White's minor pieces as they develop.",
        "4. Nc3": "Heading straight for d5 to harass the Q",
        "4... Nge7 5. Bc4": "Not quite sure what the motivation was for this.  Of course it aims at f7, which is always a good idea, and it supports the QN moving to d5 but I could have achieved that by 5. Bxc6 Nxc6 or, if Black recaptured on c6 with a pawn, left Black with doubled pawns.",
        "5... d6 6. d3": "Prepares another line of attack on the Q",
        "6... h6": "Stymies that plan for now ...",
        "7. Be3 Qg6": "threatens g2 and, if White castles, ... Bh3, threatening a quick mate",
        "8. O-O Nd4 9. Nh4": "attacks the Q",
        "9... Qf6": "which attacks the N in return",
        "10. Bxd4": "reasoning that Black can't take both B and N at the same time",
        "10... Qxh4 11. Be3 c6 12. Qf3": "in turn attacking f7",
        "12... Qf6": "The third time that Black has moved his Q to f6.  He's now well behind in development.",
        "13. Qg3 b5 14. Bb3 a5 15. a4 b4 16. Ne2 c5 17. c3": "Black's series of pawn moves has inconvenienced White's minor pieces and gained him space on the Q-side but done little for his development.  Now White hits the point of Black's phalanx and makes room for his B",
        "17... Ba6": "Black's B joins the fray, attacking the newly weak d-pawn",
        "18. Rad1": "White completes his development while defending the d-pawn",
        "18... Nc6": "finally freeing up the other B",
        "19. Bd5": "pinning the N against the QR",
        "19... Rc8 20. f4": "Threatening mayhem by taking on e5 and threatening the Q at the same time",
        "20... exf4 21. Bxf4 bxc3 22. bxc3 Qg6 23. Qh3 Rc7 24. Ng3 Be7 25. Bxf7+": "?  An over-optimistic miscalculation on my part",
        "25... Qxf7 26. Bxd6 Qxf1+ 27. Nxf1 Bxd6 28. Qe6+ Be7": "The dust has cleared and, materially speaking, we're even: White has a Q and 2Ps (11 pts) for a R and 2Bs (11 pts)",
        "29. Ne3 Bc8 30. Qg6+ Kf8 31. Rf1+ Bf6 32. d4 Ne7 33. Rxf6+": "? harassed by Black's army of minor pieces, I decide to sacrifice the exchange, leaving myself with an uphill struggle for several moves.  I had no plan for how I was going to force a win.  I should by rights have resigned after this but decided to persevere and see what turned up.",
        "33... gxf6 34. Qxf6+ Kg8 35. Qd6 Rd7 36. Qxc5 Rh7 37. Nf5 Bb7 38. Nd6 Ba6 39. e5": "White's best chances seem to lie in threatening to promote the connected central passed pawns and maybe seizing an opportunity to fork Black's pieces with N or Q.  I started to feel more optimistic about my position.  Black should be looking to hit f1 or g2 with his Rooks for a quick mate and to stop the rampant pawns however he can..",
        "39... Ng6 40. e6 Rde7 41. d5 Nf4 42. c4 Rhg7": "now Black threatens g2",
        "43. g3": "not to threaten the N (it doesn't because it's pinned), just to avoid being taken",
        "43... Rg5": "? leaving the R on e7 undefended",
        "44. Qb6": "threatening the B in order to gain time to fork K and R from d8",
        "44... Bxc4": "The B had nowhere else to go",
        "45. Qd8+ Kh7": "and Black didn't wait for 46. Qxe7+ with either a mating attack or further material gain with Nxc4 or Nf7+ and Nxg5."
    },
    "url": "https://gameknot.com/annotation.pl/the-value-of-perseverance-in-the-face-of-the-odds?gm=22545",
    "gameName": "The value of perseverance in the face of the odds",
    "players": "rjacobs (1648) vs. seedboss (1378)",
    "opening": "Ruy Lopez (Spanish opening) (C60)"
}