{
    "moves": {
        "1. d4": "I had just turned 16, and was starting to become aware of the joys of the fairer sex. I was also obsessed with chess. One night, I went to sleep after studying some games in Bobby Fischer’s “60 Memorable Games.”\r\nI woke up to find myself lying in soft grass. Looking up I saw that I was in a square field. Beside me was a bench, with, what seemed to me at the time, an old man crying. I noticed the long robe, and the mitre on his head, and his long staff. “he must be a bishop” I said to myself. I sat down beside him and asked me what was the matter. As he removed his hands from his face, I noticed for the first time that he was black, and I saw the purple shirt he was wearing, with a dog collar above it, as confirmation that he was indeed a bishop.\r\n“It’s starting again. The kings and queens are collecting armies together. There is going to be another war. Beware young man, beware.”\r\nJust then a black horse slowly trotted up beside us. A tall, dark lady was riding side-saddle on it. She was wearing a long flowing cloak and a small crown on her head. I realised she must be a queen. She slipped off the horse and clicked her fingers in front of the bishop with the single word “sleep”. The bishop immediately seemed to fall into a deep sleep. “What’s up with him” I thought to myself, for at that time, I had no knowledge of the art of hypnotism.\r\nShe turned to face me. She had big dark eyes, skin as back as coal, big lips. She was tall, she absolutely towered above me. She was more beautiful than any lady I had ever seen before. She sort of scared and excited me all at once.\r\n“What have we here? Is it a boy who will fight for me?”\r\n“I’m not going to fight for you. I don’t want to die. I am white, if I fought for anyone it would be for the white queen.”\r\n“But black can become white and white can become black. Haven’t you heard of Michael Jackson?”\r\n“Yes but I don’t want to end up like him.”\r\n“Good point and you will not.”\r\nShe sat down beside me, so I only had to look up slightly to look at her face.\r\n“And you are in your pyjamas; boys in their pyjamas should be asleep.”\r\nLooking down I noticed I was still wearing pyjamas.\r\n“Look into my eyes boy.”\r\nI looked up into her lovely eyes and there was something magnetic about them. I started staring in those lovely big brown eyes looking directly into mine. The tone of her voice changed, it was gentler, sweeter, and more seductive.\r\n“Yes I can see in your eyes that you have been sleeping, and that you want to go back to sleep. Let me help you boy. Just look into my eyes and trust in me. Trust in me completely.”\r\nI didn’t trust her one inch, but somehow I couldn’t turn my gaze away, I wanted to keep looking into those eyes.\r\n“That’s right boy keep looking into my eyes and listening to my voice, my sweet soothing voice.”\r\n“Sleep boy and dream of me. I am your queen. You love me boy. You love my big brown eyes. Keep thinking of my eyes. You love the smell of my perfume. You love my voice. You love my touch. You are",
        "1... d5": "Next thing I knew there was noise and commotion everywhere. I was standing in front of her.\r\n“Be ready boy, we are about to start.”\r\nIn the distance I saw a soldier advance towards me.\r\n“Pawn to Queen Four” bellowed a voice behind and to left of me.\r\n“Oh darling you are so old-fashioned.” I heard my queen behind me. “He means Pawn to d5. That’s you boy, off you go, forward two squares.”\r\nShe pushed me in the back and thrust me forward two squares. I came face to face with the opposition soldier.",
        "2. c4": "“I have no quarrel with you” he said.\r\n“But I have!”\r\nLooking forward and to the right I saw another opposition soldier.\r\n“Look out, use your shield,” shouted my queen from behind me.\r\nIn the nick of time I raised my shield and parried the blow from his sword.\r\n",
        "2... c6": "“Don’t worry we will send re-enforcements.” My queen shouted from behind me.\r\n“Can I suggest the Slav defence dear?”\r\n“Yes pawn to queen bishop’s three.”\r\n“He means pawn c6.”\r\nBehind me and to my right I heard a soldier advance one square.\r\n“Don’t worry sir; I am here to protect you.” \r\nI was rather relieved to hear those words!\r\n",
        "3. Nf3": "In the distance I heard the enemy start to mobilise the cavalry",
        "3... e6": "\"Don't worry boy, I'll send more re-enforcements.\" Yelled the queen behind me. I noticed another foot-soldier come up behind me on the other on my left hand side this time.",
        "4. Nc3": "Meanwhile I continues to hear the terrifying sound of the opposition cavalry",
        "4... dxc4": "\"Kill him, kill him\" screamed the black queen. Obediently I drove my sword deep into my opponent's heart.",
        "5. a4": "I became aware of a white foot soldier making an advance to my right",
        "5... Nf6": "And more thundering of hoofs, this time behind me",
        "6. e4": "My heart sank, I realised a white bishop was out to take me. \"Don't worry, we'll send help\" yelled the black queen",
        "6... Bb4": "And all at once by my side was the kindly old bishop I had seen before. \"I am combining with the cavalry to put pressure on the white centre. Everything is in order.\" He told me reassuringly",
        "7. e5 Nd5 8. Bd2 Bxc3": "\"And now I must die for you.\" He said. \"No, no, no, don't leave me I screamed, but it was too late. But at least he had taken an enemy knight with him.",
        "9. bxc3 b5": "And thankfully more re-enforcements soon arrived behind me.",
        "10. Be2": "While the opposition clergy gathered their plans together",
        "10... O-O 11. O-O": "I saw both kings run to the sides. \"Typical I thought, hide away in the corners and leave us to risk our necks.\"",
        "11... a5": "then another trooper arrived near me. It looked like the odds were in our favour in this corner of the battlefield.",
        "12. Qb1": "Then I caught a glipse of Her majesty herself, the tall white queen moved into action",
        "12... Bd7": "while our one surviving Bishop said a few prayers",
        "13. Ng5": "\"King alert, King alert\" screamed the Black queen. \"Don't worry, I have it covered, g6\" Replied the Black King. \"Thank God, he seems to have learned the notation muttered the black queen",
        "13... g6 14. Ne4": "\"Damn, weak black squares round the king, send for our black squared bishop\". Yelled the Black queen. But darling, we exchanged him 6 moves ago replied the Black monarch",
        "14... Na6 15. Bg5": "Then a white bishop bravely charged to attack the black queen. \"Look into my eyes\" started the black queen. But the white prelate was having none of it, and started chanting the Lord's Prayer over and over again. The black queen skunked away in disgust.",
        "15... Qc7 16. Nf6+ Nxf6": "And behind me I heard the cavalry clashing. They were going at it hammer and tongs. It sounded like they were killing each other off",
        "17. Bxf6 h5": "As the white bishop assuming a commanding position, one of our foot soldiers who was meant to be protecting our king made a cowardly dash into no man's land",
        "18. Bxh5": "Only to be mowed down by the other white bishop. The two white Bishops started singing \"Onward Christian Soldiers\" I could see morale dropping in our camp.",
        "18... Kh7": "Even the black king tried to escape, but he ran into a brick wall.",
        "19. Qe4": "The White queen magnificently swept passed me, towards the black king, dagger in hand. I knew the game was up.",
        "19... Rfh8 20. Bxg6+": "Then a white bishop made an attack at the Black King. He called across to his beloved queen. \"I must resign\" he shouted. \"No, fight on, to the death\" yelled back the black queen. And my eyes started to open. I saw for the first time the wicked, cruel streak in her",
        "20... fxg6 21. Qh4+ Kg8 22. Qxh8+ Kf7 23. Qg7+ Ke8 24. Qg8#": "But it was to no avail. The Black monarch was soon killed. At that moment, the black queen's spell was lifted from eyes, and I realised how I had been led into such a terrible war. I was confused, didn't know what to do.... then I woke up in bed. It had all been just a dream. Damn that book of Bobby Fischer's, it gave me chess nightmares! I won't do that again. It will have to be Kotov's \"Think like a Grandmaster\" tonight!"
    },
    "url": "https://gameknot.com/annotation.pl/the-chess-players-dream?gm=28208",
    "gameName": "The Chess Player's Dream",
    "players": "Forces of good  vs. Forces of Evil (1822)",
    "opening": "QGD Slav (D11), 3.Nf3"
}