{
    "moves": {
        "1. d4": "I always like to play 1. d4 because it gives you a range of opening ideas.",
        "1... c6": "1. d4 c6 - I do not know this opening. However, it is most likely that 2. ... d5 will be played.",
        "2. e4": "e4 dominates the centre.",
        "2... d5": "Black replies 2. ... d5, just as predicted.",
        "3. e5": "If 3. exd5 cxd5, we have a normal 1. d4 d5 opening, save that my e- file is vulnerable to attack, and black's c-file is half-open. Thus, I proceed with 3. e5.",
        "3... Qa5+": "This move is by far a mistake. The queen should not go out in the opening unless the opponent is sure: however, the more important reason is that the queen will be vulnerable to attack.",
        "4. Bd2": "The queen is now chased away by Bd2. Nc3 would have been possible, as would 4. c3, but the bishop has a better taste.\n",
        "4... Qb6": "The only available square save c7 and d8. This threatens 5. ... Qxb2 or 5. ... Qxd4, the latter better.",
        "5. Nf3": "Nf3 to defend the d-pawn, a key pawn. Note that after 5. ... Qxb2, there is now sufficient attack for white.",
        "5... e6": "5. ... e6 etches in the light-squared bishop, but the other bishop can come out also. It also supports the d-pawn.",
        "6. a4": "6. a4!? A most obvious thought, is 7. a5 next move. But 7. a5 has also more sophistication than you may think ...",
        "6... Nd7": "Black ignores the threat completely, and instead develops his knight.",
        "7. a5": "7. a5!  There are only 3 squares that Black can escape with the queen.",
        "7... Qxb2": "The title tells the story. This is by far the worst move in Black's play, as you will see soon. Let's play 'spot the move' ...",
        "8. Bc3": "8. Bc3! And within only eight moves of the game, black's queen is trapped.",
        "8... Qxa1": "The only beneficial gain, but then Black will be three points down.",
        "9. Bxa1 b6": "To develop the LSB to b7. However, after the pawn exchange, Black has axb6, threatening the bishop, or Nxc6, developing the knight.",
        "10. a6": "This prevents Bb7. However, after b5!, the pawn is trapped.",
        "10... b5": "b5! and now the pawn is unfortunately etched in.",
        "11. Nbd2": "Nd2, preparing c4! next move, collapsing the black pawn structure.",
        "11... Bxa6": "I am now only 2 points ahead, even with the free queen for rook.",
        "12. Bb2": "Bb2 threatens Qa1, attacking the undefendable bishop. Note that Bc3 blocks the c2 pawn from advancing to c4.",
        "12... Nh6": "Nh5! Developing the knight instead of to the e7 square.",
        "13. Qa1": "Note that Nb8 is possible, but not recommended.",
        "13... Bc8": "Bc8?? Surely Bb7 would have been more reasonable.",
        "14. Qa5": "I take advantage of this and play Qa5.",
        "14... g6": "g7? A bit too late to castle for both sides.",
        "15. Qc7": "Qc7! And the c6 pawn is undefendable. Bb7 fails to Qxb7.",
        "15... c5": "c5? This is a blunder, for the b5 pawn is vulnerable. ",
        "16. Bxb5": "Bxb5, pinning the knight!",
        "16... cxd4 17. Bxd4": "Now the bishop is fully developed.",
        "17... Nf5": "Nf5! Now the bishop has to move.",
        "18. Bxa7": "Bxa7! Note that if 18... Rxa7 19. Qxa7.",
        "18... h5": "h5? This is probably to give the bishop shelter after Bh6, or letting the rook go to h7 to protect the f7 pawn.",
        "19. Bb8": "Bb8!!! Now, this move blocks the rook from defending the c8 bishop, and the rook cannot take because the queen is protecting it, and the knight cannot take because it is pinned. You might be screaming, what about Ra1+?",
        "19... Ra1+": "Uh-oh ... bad luck ... I'm an idiot ... (or am I?)",
        "20. Ke2": "Ke2! ... and suddenly the rook realizes that the rook cannot take on h1 because of 21. Qxc8+ Ke7 22. Qxd7#! What's more, the rook is under attack itself!",
        "20... Ke7": "Ke7. The only one of saving moves. However, this leaves the bishop on c8 hanging, the rook on a1 hanging, and after the bishop is taken, the knight is hanging too! Uh-oh!",
        "21. Qxc8": "Qxc8! - and the rook still can't take on h1 because Qxd7 is mate! And the knight cannot move because after, let's say, 21 ... Nxb8 22. Qe8#!\n\n(P.S. I must give credit to the pawn on e5, which covers the key squares of d6 and f6.)",
        "21... Re1+": "A case of a Rampant Rook, except that no stalemate is occurring. This is probably so that there will be no danger that the rook will take on a1 and join the attack. Even if 22. Rxe1, it will take another move to arrive at a1. And Rxh1 fails to Qxd7# - did I mention that already?",
        "22. Kxe1": "The king is an option, so as to avoid any stray checks. Now, black is under danger of 23. Qxd7# as the defender has been removed.",
        "22... Nf6": "Nf6!!! A lovely graceful move, and the only saving move! Even if 23. exf6+ Kxf6 will not be as deadly. However, 23. Qc5+ Nd6 24. Qxd6# mates and also 23. Qc5+ Kd8 24. Qc7# mates also. But, however, I found another spectacular move ...\n",
        "23. Nd4": "Nd4!!! planning Nc6#, which, if not for Nxd4, would be unstoppable, as the king is in stalemate position, and all the other pieces are out of action. There follows the only move...",
        "23... Nxd4": "Nxd4 ... ",
        "24. Bd6#": "... and the bishop swoops in for a lovely checkmate. Note that the defender of the d6 square is removed, thus enabling this lovely mate. Thank you for reading ... please rate and make comments. @oodle3."
    },
    "url": "https://gameknot.com/annotation.pl/the-over-exubarant-queen?gm=56433",
    "gameName": "The over-exubarant queen",
    "players": "oodle3 (1205) vs. Grannis (1050)",
    "opening": "Queen's pawn (A40)"
}