{
    "moves": {
        "1. e4 e5 2. Nc3": "I started reading in books about openings that people usually don't play. This is the Vienna Game. Others include the King's Gambit.",
        "2... c6": "On computer analysis, this was not book and better is 2...Nf6, the Falkbeer variation, followed by, from what massive opening book I read from, 3.Bc4. Other Black second move choices include 2...Bc5, 2...Bb4, and 2...Nc6.",
        "3. d4": "Because of the slow 2...c6, I decide to take over the center.",
        "3... Bd6": "I didn't like this move too much for Black. I thought that 3...d6 was better for Black.",
        "4. d5": "This move was pointed out to be a mistake. Computer analysis showed that 4.Nf3, a development move, was better.",
        "4... c5": "Computer analysis pointed this out as a mistake because of 5.Nb5. 4...Nf6 was recommended.",
        "5. Bd2 b5": "Still, the computer analysis thinks that I, as White, can play 6.Nxb5. It still thinks that 5...Nf6 was better.",
        "6. Nxb5 Bf8 7. d6 a6": "A complete blunder! 7...Na6 is his best option!",
        "8. Nc7+": "I forcefully win a Queen.",
        "8... Qxc7 9. dxc7 Nc6 10. Nf3 Ra7": "Whew! It seems like Black wants to bring me to justice. If he blunders again, I will smother his entire army and burn up his fortress.",
        "11. Bd3 Rxc7": "Well, I didn't need that pawn anyway. Besides, I couldn't help my abandoned pawn.",
        "12. O-O Bd6 13. Qe2": "Next target, the sitting duck pawn on a6!",
        "13... Nf6 14. Bxa6 Bxa6": "This is why I had my Queen placed behind my Bishop.",
        "15. Qxa6 O-O": "Black's King is actually not safe. ",
        "16. Qe2 Ng4 17. a3": "I looked forward to play 17...b4",
        "17... f5": "I don't know why computer analysis did not point this out as a mistake because this is really where Black's troubles begin.",
        "18. Qc4+ Rf7": "Better for Black was 18...Kh8. Now his rook stepped in a ditch and can't get out!",
        "19. exf5 Nf6": "Computer analysis recommended 19...e4, but I'd still play the torturing 20.Ng5",
        "20. Ng5 h6": "Computer analysis recommended 20...Nd8, but still uderestimated:20...Nd8 21.Nxf7 and if Black played the analysis move 21...Be7 then, I'd play 22.Nxe5+!.",
        "21. Qxf7+": "I wasn't paying attention to what was better, 21.Nxf7, or this move.",
        "21... Kh8 22. Ne6": "A complete mistake. The computer recommended 22.Nf3.",
        "22... dxe6 23. Qxe6": "Hopefully, I can get back on track. Right now, I got derailed slightly from the train of thought's tracks.",
        "23... Be7": "My Queen is almost Black's hostage. Fortunately, I plotted out a back-up plan: More participation.",
        "24. Rae1 Nd7 25. Bxh6 gxh6": "Analysis recommended 25...Nf8, but after, I'd play 26.Qf7.",
        "26. Qxh6+ Kg8 27. Re4": "As of right now, I can't take anything. I plan to start disintegrating Black's defence with 28.Rg4+",
        "27... Kf7 28. Qe6+": "Analysis suggested 28.Qg6+ to prevent 28...Ke8, but if I did so, I wouldn't be annotating this game.",
        "28... Ke8 29. Rg4 Nf8": "This is where I start torturing my opponent...with pins!",
        "30. Rg8 Nd4": "Actually, I'm surprised that computer analysis did not mark this as a mistake because I'd play 31.Qxe5.",
        "31. Qxe5 Rc8": "Analysis considered this a blunder.",
        "32. Re1": "Mate in one...........skip it.",
        "32... Nc6": "Because his Bishop is, without a doubt, stuck in place, I decided to make Black wish that he didn't put his DSB there.",
        "33. Qxc5": "Now, a deadly mate occures if he moves the knight.",
        "33... Rc7 34. Qb6": "Analysis urged me to play 34.f6.",
        "34... Kd8 35. Rd1+ Kc8": "I finished my opponent off by trying to forcefully budge the Bishop away from Black's knight.",
        "36. f6": "Black resigned. However, I sit here and still wonder, is there anything else that Black can do to me? Is he overlooking something? Otherwise, this was my most interesting game about how pins can torture the opponent's pieces."
    },
    "url": "https://gameknot.com/annotation.pl/the-pins-have-all-of-the-answers?gm=40124",
    "gameName": "The Pins Have all of the Answers",
    "players": "chesskingdom64 (839) vs. bbhollaway (1113)",
    "opening": "Vienna game (C25)"
}