{
    "moves": {
        "1. e4 c5 2. f4 d5 3. Nf3 dxe4 4. Ng5 Nf6 5. Bc4 Bg4 6. Qxg4 Nxg4": "Again, start from the sac position. Till 9. Bxg4 is a routine play.",
        "7. Bxf7+ Kd7 8. Be6+ Kc6 9. Bxg4 e6 10. Nc3": "Developing queen side.",
        "10... Na6 11. a3": "Attacking b4 square, to protect c2 square to avoid a fork of king and rook by the knight.",
        "11... Qf6": "Attacking pawn at f4 and protecting black pawn at e6.",
        "12. O-O": "Castle king side, moves the king to safety and also protects the f pawn.",
        "12... h5": "Attacking the bishop at g4.",
        "13. Bxe6": "Capturing black pawn and also moving to safety.",
        "13... Nc7": "Moving the knight out of the edge and attacking white bishop at e6.",
        "14. Bh3": "Moves to safety. f5 and g4 were not safe, so h3.",
        "14... Be7": "I assume trying to open the rank for connecting the rooks.",
        "15. Ngxe4": "Capturing the black pawn at e4 and attacking black queen.",
        "15... Qd4+": "Move to safety and also check white king.",
        "16. Kh1": "Move out of check.",
        "16... Rag8 17. d3": "Opening a diagonal for bishop and also extra protection for knight at e4.",
        "17... Nd5": "Attacking white knight at c3.",
        "18. Be6": "Forking black knight and rook.",
        "18... Nxc3": "Maybe 18. ... Ne3 was better!? ",
        "19. bxc3": "Attacking black queen and covering the center. Also it opens a file for rook.",
        "19... Qd8 20. Be3": "Developing the bishop and also opens the rank to connect the rooks.",
        "20... b6": "Protecting the pawn at c5",
        "21. c4": "Blocking the pawn at c5.",
        "21... Rgf8": "Move the rook to safety. It seems that black lost tempo by doing 16. ... Rag8. It could be played as 16. ... Raf8 instead.",
        "22. f5": "Advancing the passed pawn",
        "22... h4": "Advance the pawn",
        "23. Bd5+ Kd7 24. c3": "Trying to advance the pawns.",
        "24... Bf6": "Attacking c3 pawn and pinning it to the rook at a1. Also blocking the f5 pawn.",
        "25. Rac1": "Protecting the c3 pawn and releasing it from the pin.",
        "25... Qe7": "Pinning the knight to the bishop.",
        "26. Bf4": "Releasing the knight from the pin.",
        "26... Be5": "Offering exchange of bishops. I think this was the biggest error of black.",
        "27. Be6+": "Protects the bishop at f4 and also forks black king and bishop.",
        "27... Kc6 28. Bxe5": "Capturing black bishop, but pinning the white bishop to DSB. Also pinning black pawn at g7 to the rook.",
        "28... g6": "Attacking the pawn at f5. However, offering the exchange of rook with bishop. But remember, don't cash in quickly. Also don't open files.",
        "29. Bd5+": "Checking the black king and gaining tempo to move the DSB to safety.",
        "29... Kd7 30. Bd6": "Move to safety and also attacks and skewers black queen. Now the white knight and two bishops located perfectly. This deadly position of these pieces made the black situation too fragile. As you can see, the black king cannot move forward and is somewhat trapped.",
        "30... Qg7": "White could take black rook, but again \"don't cash in too soon\"",
        "31. f6": "Pushing the passed pawn at f6 and attacking black queen.",
        "31... Qh6 32. d4": "Attacking pawn at c5",
        "32... cxd4": "Not sure, but think that black shouldn't take that pawn. Anyhow, I cannot find a better move for black.",
        "33. cxd4": "Capturing black pawn and creating a passed pawn at d4.",
        "33... Qe3": "Moving behind the defense force of white and attacking pawn at d4. a3 pawn is protected by DSB.",
        "34. c5": "If black took d4 pawn with queen, the next move would be 35. c6+",
        "34... bxc5 35. dxc5 Qd4": "Attacking bishop at d5. From now on, the mate is certain.",
        "36. c6+": "Pushing the passed pawn and check black king.",
        "36... Kd8": "Maybe 36. ... Ke8 was better. However, I can smell mate in any moves!",
        "37. Be6 Qxd6": "Black has to sacrifice its queen, to postpone the mate. \nForking pawn at a3 and bishop at e6.",
        "38. Nxd6": "Capturing black queen. Actually taking the black queen, made me to play without thinking. Maybe 38. c7+ was a better move!",
        "38... Kc7": "Attacking white knight.",
        "39. Ne4": "Move the knight to safety. Again, maybe 39. Nb5+ was a better move!",
        "39... Rh5": "It was better if black took control of the opened file at d8 or at least pinned the bishop to knight at e6. So either plays 39. ... Re8 or Rd8 was better than this move, I think!",
        "40. Rfd1": "Taking control of open file and planning to check the king at d7.",
        "40... Re5": "Forking knight and bishop.",
        "41. Rd7+": "Check the black king.",
        "41... Kb6 42. Rb7+ Ka5": "42. ... Ka6 was better.",
        "43. Rcb1 Rxe6": "Maybe 43. ... Ra8 could postpone the mate.",
        "44. Rxa7#": "And so it ends.\nI should confess that it was the best game that I have ever played, I really enjoyed it. Thanks id=jbravo58d for a nice and fair game."
    },
    "url": "https://gameknot.com/annotation.pl/the-knights-coaching-project?gm=30292",
    "gameName": "The Knights Coaching Project",
    "players": "ariaraman (1593) vs. jbravo58d (1408)",
    "opening": "Sicilian (B21), Grand Prix attack"
}