{
    "moves": {
        "1. e4": "This game was relatively equal until we enter an endgame that I believe I should have lost. However, my opponent mishandled the endgame and allowed me to win the game.",
        "1... e5 2. Nf3 d6": "Philidor's defence. Solid but a bit passive.",
        "3. d4 exd4 4. Nxd4 h6": "I'm not sure why he played this move instead of developing. I believe it to be an inaccuracy.",
        "5. Nc3 Nf6 6. Bd3 Bd7 7. Be3": "As with the last game against this opponent, white has a strong center and a lead in development.",
        "7... a6": "Again, this seems to be a wasted move.",
        "8. Qd2 c5": "This move strikes at the center and chases my knight, but he should work on developing his pieces soon.",
        "9. Nf3 Be7 10. Nd5 Nc6 11. O-O-O": "I decide to castle queenside, because I was thinking of attacking the kingside with a pawn storm. In retrospect, I think it would have been better to go kingside.",
        "11... Nxd5": "He removes my knight from its powerful position.",
        "12. exd5 Nb4": "Forks two pawns.",
        "13. a3": "? I should have played Bc4, protecting both pawns.",
        "13... Nxd5 14. c4": "Not a great move, in my opinion. It opens up my king and allows the following move.",
        "14... Ba4 15. Bc2": "I wanted to keep my rook on the d file, so I blocked instead of moving my rook.",
        "15... Bxc2 16. Qxc2 Nxe3 17. fxe3": "Now I'm down a pawn and my e pawn is isolated.",
        "17... O-O 18. Rd5": "Bringing my rook into the game",
        "18... f6": "I don't think this is a very good move as it creates a path to his king and doesn't really accomplish anything.",
        "19. Qg6": "I capitalize on the weakness",
        "19... b5": "He's counterattacking on the queenside.",
        "20. Rh5": "Threatening Rxh6.",
        "20... Qe8": "A good response",
        "21. Qg4": "I didn't want to exchange queens as I still had hope for the attack.",
        "21... f5": "This allows me to win a pawn, but it defuses the attack, so I think it is quite a good move.",
        "22. Rxf5 Rxf5 23. Qxf5 bxc4": "...And now he retakes his pawn, but not for long...",
        "24. Qd5+": "...Because I can do this. If he tries to save his pawn by playing Qf7, he loses his rook.",
        "24... Kh8 25. Qxc4": "And material is even again.",
        "25... Qb5 26. Qd5": "I decline the trade as it would have rejoined his pawns and opened the h file for his rook. In hindsight I think it would have been better to exchange, though.",
        "26... Rb8": "Threatening Qxb2+",
        "27. Qd2 Bf6": "Piling on the pressure",
        "28. b4": "I think that was the best move, but I could be wrong. It does, however lose a pawn.",
        "28... Qc4+ 29. Qc2 Qxc2+ 30. Kxc2 cxb4 31. axb4 Rxb4": "And we now enter the endgame. Black has a significant advantage. His rook is active while mine is hidden behind my pawns; he has a bishop for my knight; and he has an extra pawn. What's more, that extra pawn is also passed. If I were black, I would be looking forward to a win.",
        "32. Rb1": "Trying to trade off my passive rook",
        "32... a5": "I'm don't think this is a very good move. It allows me to exchange rooks, and it also changes the passed pawn's promoting square from dark to light. I think this is a mistake because he has a dark squared bishop.",
        "33. Rxb4 axb4 34. Kb3": "I advance my king. My only advantage in this endgame is my king is active, while his hides in the corner.",
        "34... Bc3": "Defends the pawn",
        "35. Nd4": "I plan on playing Nc6 and then Nxb4.",
        "35... g5": "Opens a path for his king",
        "36. Nc6 Bd2": "This way he will remain ahead in material.",
        "37. Nxb4 Bxe3": "He still has a passed pawn, but it is now closer to his king.",
        "38. Nd5": "Prevents the passer from advancing",
        "38... Bf4": "I believe this is the move that throws away the win. It allows me to exchange my knight for his superior bishop, and it separates his pawns. In addition, my king will reach his d pawn before him. Better would have been Bc5, followed by bringing his king into the fray.",
        "39. h3": "?? This is a big mistake. I should have taken his bishop. This gives him a chance to escape.",
        "39... Kg7": "Luckily for me, he doesn't.",
        "40. Nxf4 gxf4": "Now my situation is not quite as good as it would have been if I had taken his bishop immediately. I will no longer reach the d pawn before him. I was playing for a draw at this point.",
        "41. Kc4 Kf6 42. Kd5 h5": "Instead of this I would have played Kg5, and tried to take white's pawns.",
        "43. Kxd6 Kf5": "Again, I think Kg5 would have been better. This time because he cannot play Kg4, but he could play Kh4.",
        "44. Kd5 h4": "This is a mistake. It prevents him from easily getting to my pawns.",
        "45. Kd4 Kg5 46. Ke4": "He gives ground and I take advantage of it. Now he will lose a pawn.",
        "46... f3 47. Kxf3": "This is much better than taking with the pawn, as it keeps my pawns connected. At this point, I still believe he could draw, but considering he has already made some mistakes, I am hoping for a win.",
        "47... Kf5 48. g4+": "Were he to take my pawn via en passant, I believe the game could have ended a draw. That is because I think that a rook pawn and king cannot beat a king. I might be wrong in this, feel free to correct me.",
        "48... Kg5": "Instead he played this. This move confirmed the win for me.",
        "49. Ke4 Kg6": "Now his pawn will fall.",
        "50. Kf4 Kf6 51. g5+ Kg6 52. Kg4 Kg7 53. Kxh4": "He has no chance of stopping two pawns.",
        "53... Kg6 54. Kg4 Kg7 55. h4 Kg6 56. h5+ Kg7 57. Kf5": "The black king is driven back.",
        "57... Kh7 58. g6+ Kg7 59. h6+": "One pawn sacrifices himself so his comrade can go on to greater glory.",
        "59... Kxh6 60. Kf6 Kh5 61. g7 Kg4 62. g8=Q+ Kf4 63. Qd5": "I probably didn't end this as quickly as I could have, but it doesn't really matter.",
        "63... Ke3 64. Kf5 Ke2 65. Ke4 Kf2 66. Qd3 Kg2 67. Qf3+ Kh2 68. Qg4 Kh1 69. Kf3 Kh2 70. Qg2#": "And mate! This was a very fun game, and I was extremely happy to win it! When we started the endgame, I was expecting a loss or a draw at the very best. I think he played the endgame less then perfectly, and that allowed me to win. This is my second annotation, so if you have any comments on my annotation style I'd appreciate them."
    },
    "url": "https://gameknot.com/annotation.pl/the-endgame-matters?gm=60021",
    "gameName": "The endgame matters",
    "players": "blenderboy (1327) vs. enemy_chaser (1341)",
    "opening": "Philidor (C41), exchange variation"
}