{
    "moves": {
        "1. Nf3": "I'm playing White here. I like Nf3 because it's very safe and waits to see what Black wants to do. My knight should be good on f3 no matter how Black continues. This game was played with only 10 minutes per player, so it is not perfect, and there were many blunders by both sides. Black gave me a total win at one point, but I almost allowed him to draw because I made a lot of hasty moves",
        "1... Nf6 2. g3 d5 3. Bg2 Nc6": "Here Black is threatening the central boost e5, so I had to think about if I wanted to allow it and castle, or if I should play d4 and stop it.",
        "4. O-O": "I don't like the drawish position that arises from d4, so I let Black have the central boost since I'm already castled and it shouldn't be too dangerous.",
        "4... e5 5. d3": "My position looks somewhat passive, but I am very solid, so if Black overextends, then he could be left with weaknesses.",
        "5... e4": "Not the best move. It's better to solidfy your center instead of extending it too early.",
        "6. dxe4 dxe4 7. Qxd8+ Nxd8 8. Ng5": "Now Black's pawn is weak from overextension, and I can pile attackers onto it",
        "8... Bf5 9. Nc3 e3": "Black is threatening my c2 pawn, so he hasn't lost a pawn. But I am already castled and will have a slight lead in development, so I should be better here, especially since Black spends a move recapturing his lost pawn.",
        "10. Bxe3 h6 11. Nh3 Bxc2 12. Nb5": "I am attacking both a7 and c7",
        "12... Bd6 13. Rac1": "I didn't want to take the a-pawn because I thought taking the c-pawn would be better. I wasn't comfortable taking the a-pawn because it would oddly place my piece, and I'm more concerned with completeing development and launching an attack",
        "13... Ba4 14. Nxc7+ Bxc7 15. Rxc7 Bc6": "I didn't notice that my rook was trapped here, and I was only looking that Black was attacking my powerful bishop, so I made a blunder next move",
        "16. f3": "This is terrible, I shouldn't block the path of my bishop just because Black wants to trade it. Now Black can win my trapped rook, which he couldn't have done if I hadn't blocked my bishop's path",
        "16... Ne6 17. Rxc6 bxc6 18. f4": "Maybe the blunder wasn't that bad, because I can reopen the path for my bishop. I have a pawn for the exchange, and I have the bishop pair. A lot of times, having the bishop pair and an extra pawn is enough to compensate for being down the exchange. The bishops are especially powerful in open positions like this. So maybe it wasn't a blunder, and more like an accidental sacrifice",
        "18... Rc8": "Defending with Nd8 is more passive and leaves the rook on the dangerous diagonal",
        "19. f5 Nf8 20. Bxa7": "By point value, material is even, but I think I'm winning because my bishops are very strong attackers in this position, plus I have a passed pawn now.",
        "20... Nf8h7 21. Rc1": "Black may have been able to save this pawn if he played N8d7 c5 earlier",
        "21... O-O 22. Bxc6": "If I take with the rook, then my lack of a rook will make Black's rook stronger after he trades rooks and plays Rc8",
        "22... Rfd8 23. b4": "I have two passed pawns now, and a 1-point material lead. I thought winning with my queenside pawns would be easy, but I got too careless and let some pawns slip away",
        "23... Rd6 24. b5 Ne8": "Black wants to bring his knight over to try to stop my passed pawns.",
        "25. Bc5": "Here I made a few fast hasty moves, and gave Black more chances. I should've thought harder since winning this position should be easy. My opponent had two more minutes than I had, so I was trying to catch up on time, which caused me to make such terrible moves",
        "25... Rd2 26. a4 Ra2 27. e4 Rxa4": "I should not have given Black one of my passed pawns, but that's what I get for getting too cocky and making moves that were not thought out",
        "28. Nf4 Nc7": "This is a blunder by Black, because I have the tactic b6 double attacking the rook and knight, and my pawn can promote faster than Black can regain his piece",
        "29. Nd5": "I thought this was a good move because I'm threatening Ne7  fork, so it forces a knight trade and allows the advance of my b-pawn to be easy with the assistance of my bishops. I had about 4 minutes left here, so I wanted to move quickly, but I was moving too fast I totally missed my chance to get a winning position. Black's next move is also horrible blunder, and I didn't spend time to exploit it. Black gave me two winning positions in a row, but when you're making split-second decisions, it's easy to miss tactics.",
        "29... Rxe4": "I cannot believe Black would make a move like this. He probably expected I would play Ne7  fork, which isn't really a good move since Black can trade down to an ending where I have only a slight advantage. If I had actually spent time looking at this position, I would've played Nxc7 which is totally winning.",
        "30. Ne7+ Rxe7 31. Bxe7 Nxb5": "This is what Black wanted, and now material is even. I shouldn't have been too confident and thinking that any move I made was winning. I made about six or seven moves in less than ten seconds, and now I'm not winning anymore. Black is also threatening Nd4 getting my pinned bishop",
        "32. Rd1": "I started to get scared here, but luckily I have this move that saves my bishop. If Black takes my bishop, then Rd8  Nf8 Rxf8 Kh7 Rxf7, and I'm up a pawn with an attack on the king. I have also broken the pin, so Bxb5 is also a threat",
        "32... Na7 33. Bb7 Rb8 34. Rd8+": "I wanted to trade as quickly as possible because I had less than three minutes here. The game had no time delay or time increments added after each move, so losing on time was an issue here.",
        "34... Rxd8 35. Bxd8 Kf8 36. Bb6": "I was moving fast, so attacking the knight while getting my bishop active seemed logical. My only advantage here is that I have the bishop pair. Black's knights are not as powerful because they don't have the long range abilities that the bishops have on the open board. The knight's abilities to jump over pieces are also not important in this position. ",
        "36... Nb5 37. Bc6 Nc3 38. Bc5+ Kg8 39. Kf2 g6": "This is a mistake, because of Black's one simple pawn weakening move, I win a pawn by force.",
        "40. fxg6 fxg6 41. Bd4": "If Black plays Na2, then Bd5 wins the knight. If Black gives check with Nd1, then Ke1 attacks the immobile knight. The bishops are definitely stronger because the knights limited range allows them to get trapped easily.",
        "41... Nb1": "This is the only move that doesn't lose the knight, but allows me to get Black's weakened pawn",
        "42. Be4 Nd2 43. Bxg6 Ng5 44. h4 Ne6 45. Bc3 Nc4 46. g4 Nf4 47. Be4 Nd6 48. Bc6 h5": "Here my first instinct was to advance the pawn, and I almost did, but then I saw that simple Nf5 and Ng6 maneuvers would win my weak pawn, going into a probably drawn position. It's better just to trade, which should be winning.",
        "49. gxh5 Nxh5 50. Kf3": "I had less than two minutes here, but it was enough to win the game, especially since I had almost caught up on time",
        "50... Nf5 51. Kg4 Nxh4": "Instead of playing Nf5, I think Black has a better chance by keeping the knights and trying to defend. Both of us have slightly more than a minute here, so it's very difficult to analyse with hardly any time to think. This variation gives me a position that is easier to play with little time, so Black should've kept the knights back and have a better chance of drawing",
        "52. Bd5+": "This check probably wasn't necessary, but my mouse cursor was closer to the bishop and I didn't want to spend an extra 0.5 seconds moving it to my king, which i did during Black's move.",
        "52... Kf8 53. Kxh5 Nf5": "This position is theoretically won, but without time to think, I might screw it up.",
        "54. Kg5 Ne7": "The knight should stay close to the king, since it will just get trapped if it ventures off in the range of my bishops.",
        "55. Be6 Ke8 56. Kf6 Kd8 57. Ke5 Kc7 58. Ba5+": "Black's king can't get closer to the center with Kc6 because I play Bd8 and then Black's knight is forced away from the king. ",
        "58... Kb7 59. Kd6": "Winning this type of endgame just takes logical moves, and the position is simple enough not to require long analysis. ",
        "59... Nc6 60. Bd5 Ka6 61. Bc7": "Taking the knight is an obvious draw",
        "61... Nb4 62. Bc4+ Kb7 63. Kd7": "I am slowly pushing Black's king to the corner, while all he can do is make random maneuvers that won't save the game",
        "63... Na6 64. Bd5+ Ka7 65. Ba5": "I make this waste move to see what Black does. Eventually I will put Black in zugswang, where anything he does will lose his knight or get mated. ",
        "65... Nb8+": "If Nc5 , then Kc6 Na6 Bc4 Nb8  Kb5 and then Be6 will trap the knight and I'll always have a tactic to win it. The knight's only escape after Kb5 is Nd7, but Be6 will trap the knight or force it away from the king where it can be trapped. I didn't have time to analyse this deep during the game, but my moves were logical, and usually in endgames, the logical looking moves are correct.",
        "66. Kc7 Na6+": "It's bad to threaten my bishop with Ka6, because the simple Bc3 retreat wins immediately, since Ka7 is the only move that defends the knight, then Bd4  wins the knight.",
        "67. Kc6 Nb8+ 68. Kb5 Nd7": "Na6 loses to Bb6 ",
        "69. Be6": "The knight can longer go back to the king because of Nb8 Bc8 Ka8 Kb6 and Black's king is stalemated, while his knight is in zugswang and must move to where I can capture it.",
        "69... Nf6": "So the knight must leave the guard of the king, where I can set up mating threats",
        "70. Kc6": "Black loses quickly if he plays Ka6, because I play Bb6 and have an unstoppable mate in 1 threat.",
        "70... Ne4 71. Bb4": "I shouldn't worry about taking Black's isolated knight yet, since it isn't in a position to interfere with my mating ideas.",
        "71... Nf6": "I win faster if Black's king moves to the 8th rank, because Kb6 seals him in to be mated quickly.\r\n71.Ka6 allows Bc5  Ka7 Kc7 and Black has to lose the knight or get mated",
        "72. Bc5+ Kb8": "Ka6 still allows my unstoppable mate threat with Bb6.",
        "73. Kb6": "If Black's knight wasn't guarding d5, then I would have Bd6  Ka8 Bd5#, so Black is forced to move his king",
        "73... Ka8 74. Be7": "I attack the knight defending d5. Luckily I didn't play Bd6, because Nd7  is a stalemate cheapo and the knight can get back over to the king.",
        "74... Ne8 75. Bd8": "I'm trying to get my bishop to c7 to assist in my mating attack. I can attack the c7-guard with Bd7 if Black moves his king to b8, and then c7 will be clear for Bc7  Ka8 Bc6#",
        "75... Ng7": "Here I had only 23 seconds left, and was searching for a forced win. I have the simple Bd7 followed by Bc7 and Bc6#. And I also have many other forced winning sequences.\r\nMy first instinct was to check, so this was the forced mate I saw:",
        "76. Bd5+ Kb8 77. Bc7+ Kc8 78. Kc6": "Black is in zugswang, and can only move his knight, but the knight is the only defender of e6, so I'll have Be6 mate next move. Black lost on time in this position, while I had a little more than 10 seconds."
    },
    "url": "https://gameknot.com/annotation.pl/the-power-of-the-bishop-pair?gm=8108",
    "gameName": "The Power of the Bishop Pair",
    "players": "byakuugan3 (1635) vs. Bruce B. (1678)",
    "opening": "Reti (A05), King's Indian attack, Spassky's variation"
}