{
    "moves": {
        "1. d4": "Opening with d4, i still haven't found an opening that i consistently stick to. I reckon this one might be the keeper.",
        "1... Nf6": "Always a solid reply from black.",
        "2. c4": "Taking up space, at this time i was thinking about the KID.",
        "2... c5": "I don't normally see this reply, but i assumed we would eventually find ourselves into a QGD like position.",
        "3. Nf3": "Development and adding a defender to the d4 square as well as trying to control the e5 square.",
        "3... e6": "Increasing the scope of the bishop as well as adding control to d5.",
        "4. Nc3": "Further development and fighting for the center.",
        "4... d5": "Contesting the center with the d5 push.",
        "5. cxd5": "Here my idea was that if he played exd5 i could play dxc5, creating an isolated d pawn which i could try and target.",
        "5... Nxd5": "Clearly that won't work now...",
        "6. Nxd5": "I'm wondering if this was an alright move to make. Perhaps i should of continued developing pieces via e3 to open up my Bishop?",
        "6... Qxd5": "Capturing with the Queen, i'm assuming to prevent the isolated d pawn.",
        "7. b3": "Here i was looking to add support to d4, in retrospect i'm wondering if Bf4 was the better move. No worries though.",
        "7... Nc6": "Developing the knight and further contesting d4.",
        "8. Bb2": "There is the fianchetto. my goal here is to get my Rook over to c1 so he can contest the c file which i assumed would be opened fairly soon.",
        "8... Be7 9. e3": "But first i'm going to free my bishop from the confines of the back rank.",
        "9... O-O": "Retreating into his castle... bet it doesn't have a pool table like mine...",
        "10. Rc1": "Bringing my rook to the c file where it looks like some action might take place soon.",
        "10... Bf6": "? this just kills the pawn at c5...",
        "11. Bc4": "Or not... i should have just taken immediately with Rxc5.",
        "11... Qe4": "Alas, it would appear i get to take the c5 pawn anyway.",
        "12. Bd3 Qd5": "? So there weren't many great options for the queen when it came to placement but this just lets me chase her around a little more.",
        "13. Rxc5": "Snatching that c5 pawn, opening up the c file and chasing the queen around.",
        "13... Qd7": "Not very many great spots for the queen to go...",
        "14. a3": "the idea here is that i didn't want to see Nb4. I have a pretty solid advantage in space, so a Knight/Bishop exchange wouldn't do me any good. Since his bishop was blocked in for the time being i figured i could slowly build up an advantage and work the queen side. a3 takes away his Knights most potentially active square. In retrospect, i'm wondering if Ba3 was the more suitable option as that would still take away that square as well as make my dark squared bishop more active. Thoughts anyone?",
        "14... b6": "Chases away my rook and leaves a spot for his Bishop to develop to. However, i'm definitely eyeing the b5 square...",
        "15. Rc1 a5": "? This simply gives me control of the b5 square for me to create a nasty little pin.",
        "16. Bb5": "Now his Knight is locked up with some serious pressure on him.",
        "16... Bb7": "forced but it is a better spot for his bishop.",
        "17. O-O": "My main problem as a chess player is i struggle to come up with effective plans, so i'd like to stop and look at this position for a second. From here i think i have the much better position. My only frustration is my dark squared bishop is locked in. From here my plan of action is to continue building up on the c file and try to exploit my opponents seemingly weak queen side. what are your thoughts?",
        "17... Qd5": "Attacking my bishop and freeing the Knight from Pin.",
        "18. Bc4": "However this one move threat is easily parried.",
        "18... Qf5": "I think this move benefits me as now after Re1 and Bd7 i can look to build up an imposing center and slowly squeeze the life out of my opponent, all while dominating the open C file.",
        "19. Re1": "Looking to advance to e5.",
        "19... Ne7": "Trying to prevent the e5 push, However after Bd7, e5 will belong to me.",
        "20. Bd3": "Forcing the queen away and preparing e5.",
        "20... Qd5": "?? This just loses a tempo.",
        "21. e4 Qh5": "I have a pretty imposing center, now i think it is time to enter the opposing camp.",
        "22. Rc7": "Threatens the bishop as well as establishes a presence in the opposing camp.",
        "22... Rab8": "I don't think this was the right move. Could Bc6 or Ba6 be better options?",
        "23. Qc2": "Further bolstering my presence on the C file.",
        "23... Rfc8": "trying to contest me, but i'm not moving anywhere.",
        "24. Rc1": "Now i have a cannon going down the c file...",
        "24... Bg5": "So stopping at this position, lets note that when he made this move i went into the red timing. I think the best move in this position for me would be Rxb7 as if he takes either the Rook or the Queen i'd win with a back rank mate. If Bxc1 then Rxb8 and whites game is looking great. Unfortunately given my time troubles i didn't see this tactical shot. I was worried that any miscalculation and i would have lost my queen... It was certainly a severe oversight on my part.",
        "25. Nxg5": "Removes the attacker and keeps my cannon on the c file...",
        "25... Qxg5": "My tactical shot is still an option but it no longer leads to a back rank mate. If 26.Rxb7 then 26...Qxc1+ 27.Bxc1 Rxc2 28.Rxb8+ Rc8 29.Rxc1+ Nxc1. While it may not be a back rank mate it is still a decisive win. Unfortunately i was still in time trouble and was afraid of miscalculating and losing my queen. After two turns it just boils down to a massive tactical oversight on my part.",
        "26. a4": "The idea here was to put my bishop on a more active square and shoo the Knight away, which would once more allow the back rank mate that eluded me before.",
        "26... Nc6": "Bummer... and just like that my tactical shots are gone.",
        "27. Rxc8+": "This move was played pretty much instantly just to add those precious 10 seconds back onto my clock.",
        "27... Rxc8 28. d5": "Here the goal was to simply give back my pawn advantage to open up the game. the exchange of pawns   my bishops would have utter dominance over the board. ",
        "28... Nb4": "Unfortunately for my opponent, this time i did see the back rank mate...",
        "29. Qxc8+": "Mate is inevitable.",
        "29... Bxc8 30. Rxc8+ Qd8": "I have to give a great amount of credit to my opponent for letting me finish on a nice little tactical shot. I really appreciate that.",
        "31. Rxd8#": "So while there were a few oversights on both our parts, i thought it was a solid game. Thanks again to cirofornaro for letting me finish on a pretty mate as well as for a great game in general. Let me know what you all think, any constructive criticism is encouraged."
    },
    "url": "https://gameknot.com/annotation.pl/the-back-rank-mate-that-almost-wasnt?gm=46125",
    "gameName": "The Back Rank Mate that Almost Wasn't",
    "players": "yrahcaz1990 (1200) vs. cirofornaro (1572)",
    "opening": "Benoni defence (A56)"
}