{
    "moves": {
        "1. e4 c5 2. f4 d5 3. Nf3 dxe4 4. Ng5 Nf6 5. Bc4 Bg4 6. Qxg4 Nxg4": "This is one of the games that I played as Black. Starting from the sacrifice position. The best next move for white is 7. Bxf7+.",
        "7. Bxf7+": "Black has just one move, which is 7. ... Kd7",
        "7... Kd7 8. Be6+": "Here, in my opinion, the best move for black is 8. ... Ke8, which I played. However, there is the possibility that white tries to draw the game by 3-repetition rule. Anyway, I always try this move and will see what white does. If it doesn't go for 9. Bf7+, then black can be an attacker; otherwise the next best move could be 10. ... Kc6. In that case, white will take the position of attacker and black should defend for a while.  ",
        "8... Ke8 9. Bxg4": "It is obvious that white should take the g knight.",
        "9... e5": "Since my king is not in c6, this move cannot be as risky as Dana Mackenzie explained in Chess Lecture. So white cannot go for 10. Nf7 as black king is attacking the f7 square.",
        "10. Nxe4": "Kind of expected as e4 pawn was unprotected; and if white didn't play that, probably black would go for 10. ... e5xf4 and then white needed to move his knight anyway.",
        "10... Qh4+": "The black queen was released and activated. So from now on, as you will see, the white's job is so hard!!! Because the other bishop of white is still inactive, while the black queen is active. ",
        "11. Nf2": "Best move for white, as the knight is covering the king and also protecting the bishop at the same time.",
        "11... exf4": "Taking the pawn to open a file for future usage of my rooks.",
        "12. O-O": "White simply castle, which could be the best move as the black queen was in the area.",
        "12... Bd6": "Activating the bishop and also protecting the f pawn.",
        "13. Nc3": "Developing the queen side's pieces as I can see.",
        "13... h5": "Attacking the bishop to engaged white and force him to defend. This will prevent him from developing his pieces well.",
        "14. Bh3 g5": "Thinking of attacking g2 square. So I needed to prepare good protection for my f pawn.",
        "15. Bf5": "White bishop escaped from being trapped.",
        "15... Be5": "Don't really remember why I did this move!! Maybe to prevent of being checked by white's rook so saving time.",
        "16. Re1 Nd7": "Protecting the bishop as my attack's plan was based on its later protection for queen.",
        "17. Nb5": "Didn't really understand this move. Maybe white wanted to fork the king and rook.",
        "17... Kd8": "By considering the above theory, even though the bishop was protecting c7 and d6 squares, I decided to move my king from fork and check situation by white's knight. ",
        "18. c3": "Protecting b pawn, I assume.",
        "18... f3": "Opening the bishop's way to attack h2 square.",
        "19. Bh3": "Protecting h pawn and also g2 square.",
        "19... g4": "Trapping white's bishop and also protecting f pawn.",
        "20. Re4": "Didn't really understand this and the next moves of white's rook.",
        "20... Re8": "Providing extra protection for my valuable bishop!",
        "21. Rc4 Bxh2+ 22. Kf1": "I cannot find why white didn't take the bishop. I remember that I was wishing him to take it but it seems that he saw the trap and didn't bite the bait. If anyone can see the trap now, please make comment.",
        "22... Re2": "Providing protection for my queen to attack f2 for mate. From now on, the mate is forced in 6 moves, I assume.",
        "23. Nd3": "Protecting the f2 square.",
        "23... Ne5": "Attacking the d knight. From now on, the mate is forced in 5 moves, certainly. \nI made a puzzle with this position, but it seems it's removed from my list of puzzles. However, you cannot make a puzzle by this positions again as it errors \"similar available puzzle!\"",
        "24. Re4": "Trying to attack my e rook.",
        "24... Nxd3": "Although I was able to take the rook, since my plan was to attack f2 square, I took its protection (white's knight)instead.",
        "25. Rxe2": "Taking my rook and also encouraging me to take white's rook by f pawn. However, if I did that white would had the possibility to escape from mate.",
        "25... fxg2+": "I took g pawn instead and left white with just two options, either take my pawn with king or bishop. ",
        "26. Bxg2": "Taking with bishop postponed the mate one move.",
        "26... Qf6+ 27. Bf3 Qxf3+ 28. Rf2 Qxf2#": "And so it ends. The lesson that I've learned, which is obvious: Don't let the black queen gets free and be able to move freely. So I assume that the big mistake of white was to let my king to go back to e8 square (8th move) and remain there. This let me to be able to focus on attacking rather than defending."
    },
    "url": "https://gameknot.com/annotation.pl/the-knights-coaching-project?gm=28317",
    "gameName": "The Knights Coaching Project",
    "players": "jbravo58d (1630) vs. ariaraman (1475)",
    "opening": "Sicilian (B21), Grand Prix attack"
}