{
    "moves": {
        "1. e4 c5": "Another mini-tournament game, and another game as black. 5 in a row. I really want to play white again... For now, black's opting for the Sicilian again.",
        "2. Nf3 d6 3. d4 cxd4 4. Nxd4 Nf6 5. Nc3 a6": "Knee-dwarf.",
        "6. Bg5 Nbd7": "The main line",
        "7. Be2 e6 8. O-O b5": "Gaining turf on the queenside and restricting those white pieces.",
        "9. Bh5 Nb6": "I think I was a little crazy here. White's building up on the kingside and I'm moving my defenders farther away. I must have really wanted my bishop on d7.",
        "10. Qf3 Bd7 11. Bxf6 Qxf6 12. Qxf6 gxf6": "The liquidation doubled black's pawns, but not in a bad way, since they will jointly support a push in the center and usually undouble easily enough through exchanges.",
        "13. Nd1 Rc8": "White wants to play 14. Ne3. Black wants to punish him if he does.",
        "14. Ne3 Nc4": "Let the punishment commense. 14. Ne3? loses a pawn. White is forked. He won't enjoy 15. ... Nxe3 doubling his pawns in a bad way, nor will he enjoy 15. ... Nxb2, so his reply is essentially forced.",
        "15. Nxc4 Rxc4": "Another fork. Moving the knight loses the pawn at c2.",
        "16. c3 e5": "And now the real punishment. White loses a pawn. He could have saved this pawn by playing 14. c3 before playing 15. Ne3.",
        "17. Nf5 Rxe4 18. Ne3 Rh4 19. Bf3 f5": "Time to advance that strong pawn formation and gain ground in the center.",
        "20. g3 Rh6 21. Nd5 Kd8": "White was threatening 22. Nc7+ followed by 23. Nxa6. Had to be stopped. It's not like the black king had any plans to castle...",
        "22. Nb4 a5 23. Nc6+ Kc7": "Choices, choices. Now white has forked the black king and the undefended pawn on a5. 23. ... Bxc6 keeps white from gaining a pawn, but at the cost of the bishop pair, and after 24. Bxc6 b4 25. cxb4 axb4 white has strong queenside and a well-placed bishop hindering black's central advance. On the other hand, just sac the pawn, trap the white bishop, and extend the central advance. I'm still not sure black made the right call here, but after lots of deliberation and playing out combinations and in fact, playing out the entire game a handful of times on my practice board, I finally decided to sac the pawn.",
        "24. Nxa5 e4 25. Bg2 Bg7": "White would want to play 26. b4 to pin down black's pawn, but this move prevents it, while clearing the way for black's rook on h8 to get more active.",
        "26. Nb3 b4": "Not so much a sacrifice as a delayed exchange. I learned this technique from years of playing chess computers. I don't see it so much in human play. I can immediately get the pawn on b2 but it's b4 that I will want.",
        "27. cxb4 Rb8 28. Rfc1+ Kd8 29. Rab1 Rxb4": "Easy enough.",
        "30. Rce1 Be6 31. Re3 d5": "More central advancing. Note that now black has a passed pawn on the d-file, and it supports the e-pawn, so collectively black has a 5-3 pawn advantage on the kingside. White, of course, has two passed pawns and a 2-0 pawn advantage on the queenside, but the center/kingside seems more active, and more likely to produce results.",
        "32. Ree1 d4 33. Nc1 d3": "Threatening to fork with 34. d2, and discovering the bishop's attack on the long diagonal against b2.",
        "34. b3 Rd4": "The fork with 34. ... d2 wouldn't work, as white would respond with 35. Rd1 pinning the advanced pawn to the black king and giving the white knight time to escape.",
        "35. Rd1 Bd7": "Both shielding the black king and preparing to support the pawn advance as needed. Also handy to prevent white from advancing the b-pawn, and to tie down the knight and/or rook to defense of the b-pawn if white advances the a-pawn.",
        "36. Rd2 Rc6": "Planning a sneaky little trick to clear out some pieces. If white allows it, 37. ... Rxc1 38. Rxc1 Bh6 skewering the two rooks and regaining the exchange.",
        "37. Rd1 Rc2": "White didn't let black get tricky, but this is fun too.",
        "38. Bh3 Rd6": "Nope, it's not a time-waster. That rook was sitting on a square that has suddenly become prime real estate for a dark-squared bishop.",
        "39. a4 Bd4 40. Rf1 Bb6": "Nope, not a time-waster. The bishop needed to get to d4, but now it needs to get out of the rook's way and let him support the d-pawn.",
        "41. Ra1 e3": "Why support the d-pawn? So black can advance the much more practical e-pawn without losing the d-pawn in the process.",
        "42. Rb1 e2": "Now if 43. Re1??, then 43. ... d2! 44. Rxe2 d1=Q+ is decisive.",
        "43. Nxe2 dxe2 44. Rfe1 Bd4": "Off of d4, onto d4. Black's pieces get in each other's way, but each move had its reasons. This one is the first step on the way to 45. ... Bc3! to win the exchange. 44. ... Ba5? would fail to 45. b4.",
        "45. a5 Bc3 46. f3 Bxe1 47. Rxe1 Rd1": "And now to win more than the exchange.",
        "48. Kf2 Rxe1 49. Kxe1 Bb5 50. Kf2 Rc1 51. Ke3 e1=Q+": "To win a queen. I guess the black king was lonely, and any old pawn in a dress will suffice...",
        "52. Kf4 f6": "Trapping the white king.",
        "53. Bxf5 Qd2+ 54. Kg4 Qg5+ 55. Kh3 Bf1#": "Final position. I think I'll write this one up as a puzzle, too. Puzzle number 10878."
    },
    "url": "https://gameknot.com/annotation.pl/the-march-of-the-center-pawns?gm=23604",
    "gameName": "The March of the Center Pawns",
    "players": "mc_rennett (1807) vs. blake84120 (1965)",
    "opening": "Sicilian (B94), Najdorf, Ivkov variation"
}