{
    "moves": {
        "1. e4": "I was WAY behind in this game due to an early blunder-- a simple pawn fork I overlooked that cost me a piece.  This game is an excellent example of how you shouldn't give up when you are behind.  At one point, I was down 5 points and was still fortunate enough to win the game.\r\n\r\nlrgraham",
        "1... e5 2. f4": "I wasn't familiar with the King's Gambit....",
        "2... exf4": "...so I played the best move according to GameKnot's Game Database.",
        "3. Nf3 g5 4. Bc4 Nc6 5. O-O Qe7": "Preparing for Queenside castle later on...",
        "6. h3": "a good move by white, preventing me from moving Bg4, pinning his Knight at f3 to his Queen!",
        "6... Bg7 7. Re1 d6 8. d4": "Everything looks pretty normal so far...",
        "8... Be6": "Until now... see any problems with my last move?",
        "9. d5": "Black sure did!  As you can see, even a lowly pawn can win a piece... I can only move my Bishop OR my Knight, but not BOTH-- and he wins the other!",
        "9... g4": "Counterattack was my chosen defense....",
        "10. hxg4 Bxg4": "He still takes the Knight...",
        "11. dxc6 Bxf3": "...but by attacking his Queen, this prevents him from playing cxb7, threatening to Queen his pawn!",
        "12. Qxf3": "Net damage is -2, but White's not done yet.  Note where the White Queen had to move to take the Bishop...",
        "12... Bd4+": "Now, I give him three choices:  \r\n1.  Blocking with Be3 allows me to capture his Bishop with my pawn; blocking with Queen or Rook wouldn't even be considered.\r\n2.  Kh2 or Hh1 would allow Qh4 , losing momentum and exposing his King...  and finally...  ",
        "13. Kf1": "3.  Kf8, safely (?) nestling his King between Rook and Queen.",
        "13... Qh4": "Continuing the attack with my Queen, I threaten Qh1  and also attack his Rook at e1",
        "14. Bxf4": "White develops his othe bishop, possibly looking at Bg3 or Qg3.  This gives me time to...",
        "14... O-O-O": "...protect my King by castling Queenside.",
        "15. cxb7+": "Now I'm down by 4, and he's threatening to queen his pawn.  Fortunately, I see it appears he is planning to protect the pawn with e5, so to avoid the discovered attack on my King, I play...",
        "15... Kb8": "Kb8, blocking the pawn's progress, and avoiding giving up a free move due to the check from his Queen.",
        "16. c3": "He attacks the Bishop, planning to either develop more pieces or continue to swap me down....",
        "16... Be5": "...so I most obligingly allow him to do so!  Why?",
        "17. Bxe5 dxe5": "Well, he's 4 ahead, perhaps he'll get greedy...",
        "18. Bxf7": "...and take the pawn at f7.  He does!  Do you see any problem with this?  Opportunity knocks!  If my Knight weren't in the way, I could pin his Bishop to his Queen and King by moving either Rook to f8!  So...",
        "18... Nh6": "I move my Knight out of the way, and ATTACK his Bishop.  What happens next really surprised me, and was not what I was expecting at all; I was expecting an attack, perhaps g3.",
        "19. Bd5": "I assume this is to protect the pawn at b7, but opening up the f file was a mistake that will ultimately cost White the game:",
        "19... Rhf8": "Rf8! firmly pins White's Queen to his King!  He can interpose with Bf7, but as my Knight protects that spot, RxB wins back a piece.  I seriously thought his best move at this point would be QxR, but he instead chose...",
        "20. Nd2": "Nd2... to protect his Queen, so that RxQ would be answered by NxR, threatening my Queen?  What he may have overlooked, though, is that I don't HAVE to take his Queen with my Rook...",
        "20... Ng4": "Ng4 threatens Nh2, forking his King and Queen.  Please note that now, in addition to the threat of my Knight fork, his Queen is still pinned to the f file!",
        "21. Ke2": "White chooses to unpin his Queen by moving his King out of line.  Besides, he's up by 6 points, and after RxQ, NxR (or gxR), he'll still be ahead, right?  Let's see:",
        "21... Rxf3": "I go from -5 to  4...",
        "22. gxf3": "...and he counters with gxR, leaving me STILL a pawn down.  Also, he's attacking my Knight, too!  However, position counts for something, and he may have overlooked the scathing attack that will soon ensue...",
        "22... Qf2+": "The power of check:  ALWAYS look for ways to put your opponent in check-- even if he can capture a major piece (like my threatened Knight at g4)... or QUEEN A PAWN... he MUST answer to check... which is why putting your opponent in check is one of the most powerful moves in chess!",
        "23. Kd1": "...so he scoots his King safely behind his Knight (remember, we LEARN from our mistakes... He just lost a Queen because of a pin-- he's not going to move Kd3 and allow me to pin his Bishop at d5 to his King, too!",
        "23... Ne3+": "Continuing to attack with a check from my Knight leaves him two bitter options:\r\n1. Move Kc1 gives up a full Rook with QxR, so he wisely chooses...",
        "24. Rxe3": "RxN...",
        "24... Qxe3": "Only losing 2 points instead of the full 5.",
        "25. Kc2": "White's King runs away from the Queen.  Note that this is his ONLY King move, because:\r\n1. Kc1 would be answered with Qe1 , skewering his other Rook... or even worse:\r\n2. Leaving his King at d1 would be countered with Qg1 , losing the Rook the same way (or losing the Knight too, by interposing it at f1)\r\n\r\nThis leads to a more subtle, but just as deadly pin:",
        "25... c6": "c6 attacks his Bishop, but why can't he move it?  Any Bishop move would allow R(or Q)xN !",
        "26. Bxc6": "White decides to take a pawn anyway, perhaps to preserve his only real hope for another Queen at b8 (or maybe he missed the double attack on the Knight)",
        "26... Rxd2+": "I took the Knight with my Rook, because in this way, any King move to White's first rank would be checkmate with Qe1.  His only other choice is...",
        "27. Kb3": "Kb3, allowing me the double attack...",
        "27... Qb6+": "Qb6 , which at LEAST wins White's last Bishop, putting white at a -6 material disadvantage lacking the ability to protect several other pawns as well.   White resigns at this point.\r\n----------------------------------------------------------------------------------------------\r\nTakeaways from this annotation: \r\n1. \"The pin is mightier than the sword.\"  \r\n2. Check must be answered, no matter what the cost.  It's one of the most powerful moves in chess, and you should ALWAYS look for ways to put your opponent in check!  Remember, since your opponent MUST answer to check, you get a FREE MOVE, no matter how bad your position is!\r\n3. Even when you are down -5, don't resign unless your position is hopeless!  We are all prone to mistakes, and unless you know your opponent VERY well, don't resign too early.\r\n\r\nI welcome your comments, and I hope this was helpful.\r\n\r\nSincerely,\r\nLloyd Graham\r\nlrgraham"
    },
    "url": "https://gameknot.com/annotation.pl/the-pin-is-mightier-than-the-sword?gm=14329",
    "gameName": "The pin is mightier than the sword!",
    "players": "warn1584 (1559) vs. lrgraham (1501)",
    "opening": "KGA (C37), Blachly gambit"
}