{
    "moves": {
        "1. e4": "simple enough...\n",
        "1... b6": "Owen's Defence - Black plans a hypermodern approach with a fianchetto\n",
        "2. Nf3 Bb7": "fianchetto, and targets the e-pawn\n",
        "3. Nc3": "The pawn is defended easily enough. White follows through with the 'knights before bishops' idea, though I have to say, I never knew why. There is also this other saying, about how, when you've worked out the best rook to place on the open file, you should move the other one. Weird... though this might be beginner chess ignorance talking... okay, enough with that rambling, back to the game...\n",
        "3... g6": "White goes with 'knights before bishops' - Black goes with 'bishops before knights!' Again, playing hypermodernly - though perhaps too much so? we'll see... ['hindsight moves' stop here]\n",
        "4. Bc4": "White applies a bit of pressure to the f7 square - a traditional target point for White, it seems\n",
        "4... Bg7": "now both my bishops are on strong diagonals :)\n",
        "5. d3": "interesting.... White would be perfectly safe going for the traditional centre here, and why he didn't do so is a bit of a mystery...\n",
        "5... e6": "...not that I'm one to talk! :P I am going for a defence idea mentioned by id=nuntar in my very first annotation [These are most likely not the best lines for Black - but I had planned this from the very beginning, so this is more of an 'experiment game' if you will...]\n",
        "6. O-O": "natural....\n",
        "6... Ne7": "and logical (Nf3 right now is met by the very annoying e5)\n",
        "7. Bb3": "I really can't understand this move... maybe White is cautious of a future attack on the bishop, but surely he would be better off with a normal developing move?\n",
        "7... Nbc6": "I considered d6/Nd7 for awhile, but found that way too passive, so I played this move instead... but I'm already starting to notice a few problem areas for Black - namely, the limited scope of the e7 knight and queen... that could pose a problem for me later on\n",
        "8. Bd2": "luckily for me, White doesn't seem to be playing the most aggressive lines, which means that Black's hypermodern approach is doing ok... now Black delivers the first punch...\n",
        "8... d5": "hoping to create some space for my pieces (namely, the knight and queen) Black has more control of d5 than White in this position\n",
        "9. exd5 exd5": "more space - I got what I wished for :)\n",
        "10. Re1": "rook to open file - that knight could prove to be a problem for Black\n",
        "10... Qd6": "Black brings out his queen, and reserves castling options... he also starts to formulate a plan of his own involving - what else? - the two bishops\n",
        "11. a3": "I have no idea what White intends with this move (to stop Nb4, maybe, but why would Black want to do that?)\n",
        "11... Nd4": "Phase #1 of my plan - get rid of the knight on f3!\n",
        "12. Nxd4": "White plays into my hands - good! If White had played another move, I would have played Nxf3+\n",
        "12... Bxd4 13. Rb1": "Indicates that White is planning to move his knight [which, by the way, I hope to force anyway ;)]. White makes sure that the b2 pawn is not left hanging. However, I very much prefer Qe2 for White, which puts the pressure on Black [I need to be careful - I'm focused on my attack but my uncastled king makes an easy target - I have to remember that]\n",
        "13... Be5": "Now Black starts an attack! Right now, the most natural way to defend the h2 pawn would be...\n",
        "14. g3": "this move. However, it opens up the lovely a8-h1 diagonal, and my fianchettoed light-square bishop is conveniently on said diagonal...\n",
        "14... d4": "of course! Black doesn't hesitate to open up the diagonal and use his light-square bishop to its full power!\n",
        "15. Ne4": "White has to block that diagonal, and he attacks my queen while doing so. good thing I was planning to move her anyway...\n",
        "15... Qc6": "Now Black threatens the knight with capture - 16...f5!, and the knight can't move because Black's queen will mate on g2 or h1\n",
        "16. f3": "forced, as far as I can see - but the king's defence isn't that desirable now, is it? Now I don't very much like f5, because after Ng5 I don't like White's pressure on the f7 square (for example, Bf7+, or if 0-0-0, Nf7! forks the rooks)\n",
        "16... O-O-O": "Black takes the opportunity to castle before White pulls off any sneaky tricks of his own. True, the f7 pawn is hanging, but I want White to take it because Black can get increased pressure on the white position after the capture",
        "17. Bg5": "Well, White does not take the free pawn here, and now Black is beginning to feel the influence of his opponent's bishop pair, bearing down into his position. The first move that popped into my head here was 17...f5, since the knight could no longer reach the g5 square. What follows would be a spectacular line - should White play along with it; 18.Bxe7 bxe4 19.Bxd8? [here comes the pain...] exf3 20.Kf2 [the diagonal MUST be kept closed!]  Re8!, and there's nothing to stop 21...Bxg3+! 22.hxg3 Re2+, opening the diagonal once again. However, White ruins this simply be playing 19.dxe4!, leaving him a pawn up, an even more closed diagonal and two strong bishops!\n",
        "17... f6": "The only other alternative was this move, so I played it. True, it does lose a pawn [no it doesn't! I don't know how I came to that conclusion!] but I believe that I can make it work to my advantage if I play it right \n",
        "18. Bd2": "The only reasonable place for the bishop to retreat to (Bc1 is incomprehensible!)\n",
        "18... h6": "Black's target is still (obviously) the weakened kingside, and he starts up a pawn storm to exploit this. Black wants to play f5, but makes sure that the g5 square is off limits for the knight once he does so\n",
        "19. f4": "....what the hell?? This is a very silly decision  to me - has White forgotten about the queen and bishop already? Opening the long diagonal can't be good!\n",
        "19... Bd6": "I will have to guess that White wants to get in Be6+, which is a good outpost for the bishop, but Black has a much bigger advantage from the open h1-a8 diagonal. f5 will now be a much more powerful move (the knight is pinned, as Qg2 is mate and Qh1, Kf2, Qh2 also mates (that is, if White tried a move like Re2) It remains to be seen whether White has anything that can save that knight\n",
        "20. Nxf6": "....oops! White declined a free pawn earlier in the game, but now that he goes for it (though it isn't really 'free' now, is it? :P) he pays a big price!",
        "20... Qg2#": "Like I said, not a glamorous 'at each other's throat' or a tense struggle for power, but there's still some interest before this. [the most interesting one being the power along the long light diagonal] Besides, I'd already started annotation of this game :P Until next time!\n"
    },
    "url": "https://gameknot.com/annotation.pl/the-fianchettoed-bishops?gm=31837",
    "gameName": "The fianchettoed Bishops",
    "players": "mark1973 (1456) vs. x-machine (1472)",
    "opening": "Owen defence (B00)"
}