{
    "moves": {
        "1. e4": "This is a 30 minute ranked game I played offsite, the ratings shown reflect our ratings there after the game. ",
        "1... g6 2. d4 Bg7 3. Be3": "Something a bit different this time around, I wanted to try fianchettoing my Bishop. This might have been a mistake, considering I was black, white already has a strong claim to the center that will be difficult to challenge. ",
        "3... e5": "While on the one hand, this pawn is defended by my bishop...",
        "4. d5": "...I failed to consider that white might elect to just set up his pawn structure.",
        "4... d6": "Stopping the march of the D-pawn, but playing into white's wish for a closed game. ",
        "5. h3 c6": "Stop a moment and look at my bishops. Neither one has any hope of moving to any square where they'll be useful any time soon. White's e4 pawn in particular completely locks down my e-pawn, my dark-squared bishop and takes the f5 square away from my other bishop. If I'm going to do anything this game, it has to go. And since I don't want to move my f-pawn, that means attacking white's d-pawn first. ",
        "6. c4 b5 7. b3": "White declines to trade pawns, twice. If I play cxd5 or bxc4, he simply retakes, and his center pawns are as safe as ever. While it would open up the queenside, his bishops are better placed to take advantage of that than mine. ",
        "7... Nf6": "My knights are about the only pieces I have capable of offensive pressure. This is step one in actually attacking that E4 square.",
        "8. Qc2": "White brings the queen in to defend, but I think Bd3 (or Bg5 to pin the knight) would have been better.",
        "8... Na6 9. Bd2": "White wants to avoid Nb4, as it would chase the white queen off the b1-h7 diagonal, letting me claim the pawn. ",
        "9... Nc5": "So I just develop my knight to the other available black square. White needs to find another defender.  ",
        "10. Nc3": "?",
        "10... b4": "That knight is being chased away, and the e4 pawn is now lost. Big mistake by white.",
        "11. Nce2 Nfxe4 12. Bxb4": "The threat here is that if I don't react well, white will play Bxc5, dxc5, Qxe4, and I'm down a piece with a worse pawn structure. ",
        "12... Bf5": "This neutralizes white's threat both by adding a defender to the d4 knight, and setting up a much deadlier threat. If white reacts poorly, black can play Nxf2, threatening the h1 rook and unmasking the bishop for a discovered attack onto white's queen. The queen's movement options are also severely limited, the only space she can safely move to is Qd1. (c1 and b2 are unavailable because of Nd3+.)",
        "13. Ng3": "?? This loses the game immediately. While technically Nxf2 doesn't work any more...",
        "13... Nxg3": "This accomplishes the same thing, and gives me a free knight in addition to what I was already going to get.",
        "14. Qxf5": "White elects to trade in his queen instead of giving up the rook, which I think is a poor decision. With his queen off the board, his dark-squared bishop becomes his only developed piece, and none of the others (particularly that h1 rook he decided to save) can reach active positions any time soon. ",
        "14... gxf5": "? I was so eager to take the queen, I missed Nxf5. It costs me the knight, though the material advantage is decisive regardless.",
        "15. fxg3": "While the game is effectively over, white elected to play on for a while, and the mop-up isn't too dull.",
        "15... e4": "Rejoice! The g7 bishop is finally free! A little late to actually be useful, but it's the thought that counts, right?",
        "16. Rd1 Qg5": "The queen is threatening both Qe3+ (which is rather difficult for white to fend off), as well as Qxg3+. ",
        "17. Ne2": "? White really isn't helping his case here. Even if this didn't immediately lose material, his light-squared bishop is now completely blocked in.",
        "17... Nd3+ 18. Rxd3": "Forced.",
        "18... exd3 19. Bd2": "White should have played this a couple moves ago, but it's too little, too late now. ",
        "19... Qe7": "Keeping the knight pinned for dxe2.",
        "20. dxc6 dxe2 21. Bxe2 Qe4 22. O-O": "This is actually cute. While the bishop looks loose...",
        "22... Qxe2 23. Re1": "Taking it forces me to trade my queen for a bishop and rook. Of course, being up this much material, that's still to my advantage, though I hadn't intended it.",
        "23... Bd4+ 24. Kh1 Qxe1+ 25. Bxe1 O-O": "White finally resigned. Overall, this was a fairly sloppy game. White made quite a few unforced errors, and seemed to be playing on tilt after losing his queen. On my end, I made some poor decisions in the opening, and but my mistakes (missing 14... Nxf5 and 23. Re1 was bad) were overshadowed by white's blunders. That said, I feel the positional play early-mid game around white's pawn structure was interesting enough to be worth annotating, hopefully you found it entertaining. "
    },
    "url": "https://gameknot.com/annotation.pl/the-best-defense-was-probably-something-else?gm=61902",
    "gameName": "The best defense... was probably something else.",
    "players": "Justborn (1509) vs. Nicholas1024 (1507)",
    "opening": "Robatsch (modern) defence (B06)"
}