{
    "moves": {
        "1. d4": "I used to hate playing against d4, but I've grown used to seeing it now.",
        "1... d5": "Since then, there's a certain varation of Queen's Gambit Declined that I've grown quite fond of...",
        "2. e3": "But we won't be seeing a Queen's Gambit this match. In fact, I don't even know the name of this kind of opening at all. Gameknot calls this \"The Stonewall Attack\". I've rarely ever encountered this.",
        "2... Nf6": "I'm walking in blind, so I go with a move I feel is just safer to do in unusual openings.",
        "3. c4": "And we transpose back into a Queen's Gambit Declined. I can relax a little.",
        "3... e6": "So maybe I can play this guy like my other encounters against this opening...",
        "4. a3": "Not a chance. I've never seen a QGD go this way either.",
        "4... c5": "And I say, screw it. I'm just going to keep developing.",
        "5. dxc5": "He captures. The GK Database says that the position here is very strong for Black. But I usually see a knight push before this pawn goes down. Notice how White has only moved pawns at this point.",
        "5... Bxc5": "I have to exchange, but I've still hesitated already for a lot of the match. It's taken me 30 seconds to proceed this way, whereas White has taken only 5 seconds out of his clock after this next move:",
        "6. b4": "He is still continuing to be very aggressive with his pawn pushes, but I can't see any problem with his moves right now. The tempo is bound to run out if he won't push out a back rank piece yet...",
        "6... Be7": "And, of course, a full retreat would be unacceptable. GK says I still have a slight edge.",
        "7. Bb2": "Not up for playing 7. c5? After coming all this way? Not sure how I feel about White right now.",
        "7... O-O": "There's no way I want my king near this queenside action, so I tuck him away at once.",
        "8. Nf3": "White continues to develop.",
        "8... dxc4": "With all these queenside pawns in the way of my development, I move to exchange the queens, thinking I've just gained a pawn after ...b5! Even if I wasn't planning that attack, the threat of c5 shutting down my Queenside back pieces is too great, and this pawn needed to die.",
        "9. Qxd8": "And then I quickly found out that I don't have the time to play b5. C'est la vie.",
        "9... Rxd8": "Forced.",
        "10. Bxc4": "Obvious, because it allows O-O and more development.",
        "10... a6": "Still planning b5. I need some sort of tempo against White after he castles.",
        "11. Nc3": "I think the plan here was to strengthen b5, but I think Nbd2 would have been stronger...",
        "11... b5": "With only back rank defenders, it's obvious that the bishop always had to move somewhere.",
        "12. Be2": "It retreats here. Would Bb3 or Ba2 be worth considering? My kingside pawns are strong, but the bishop is still constrained both ways here.",
        "12... Bb7": "I seize the light diagonal, strengthening attacks after he castles.",
        "13. O-O": "He figures he should do it now, instead of as a response to something later.",
        "13... Nd5": "If White does e4, then after my Nxc3, White plays Bxc3, losing the e pawn to Bxe4. It also allows me to get rid of his knight if I decide I hate it too much.",
        "14. Rfd1": "Trying to establish the threat on the d file if I exchange the knights, but both of our bishops are guarding the d-back ranks, so both threats aren't really warranted to either of us.",
        "14... Nd7": "Still, I want to join my knights at the center. I lean more to playing Ndb6 instead of Ndf6, because if I can safely play f6, I have a lead against his kingside pawns for quite a bit of time. Ndb6 also has a threat against White's a4.",
        "15. Nxd5": "He agrees that my knights have been bothering him for too long now.",
        "15... Bxd5": "So I bother him with an equally powerful bishop. Both my bishops are causing him a lot of grief at this point. But notice that if he plays 16. Bd4 (for whatever reason), then if I did play Nf6, the position is perfectly symmetrical on White's 17th move. It means I need to find a new edge on this board, soon.",
        "16. Rd2": "He decides he wants to stack the rooks against the d file, instead. Obviously Bd4 wasn't an actual move worth considering (loses after ...e5), but could White played have played a4, or h3?",
        "16... f6": "I continue with my plan to strengthen my kingside situation. I could have played Nb6 right now, but I didn't want to deal with g7 being threatened, or the knight moving to e5 to annoy my pieces.",
        "17. Rad1": "The stacked rooks aside, he's throwing them at a bishop-pawn pair. Probably planning e4.",
        "17... Nb6": "But not that e4 matters after this point, because I can safely take it, and if Rxd8+, I have the bishop protecting f6 and d8 from that square. White's attack is still completely pointless, and I felt as though I had a clear tempo advantage over White at this point. So, what should I do with it?",
        "18. Ne1": "White agrees that the f6-e6 pawns are too much to deal with, and would rather not move the d rooks to reposition it. Freeing the f pawn for White, I can't say this is a bad move for him at all.",
        "18... Nc4": "Now he either loses his strong bishop defender, or the rooks must separate anyway.",
        "19. Bxc4": "He really wants this attack, so he sets out to fight both my powerful bishops.",
        "19... Bxc4": "White's queenside is now shut down. He has to contest my kingside, or find a way around.",
        "20. Rd2d7": "? - I don't know what this was. Probably a misclick?",
        "20... Rxd7": "I complete the exchange anyway.",
        "21. Rxd7 Kf8": "Both moves practically forced. ",
        "22. Bd4": "It's a good square, but I don't see the point of it coming in my area of the board at this time.",
        "22... e5": "So I force it to move again, while further developing my pawns.",
        "23. Bb6": "He was trying to stop Rd8, but I didn't think it was nearly as powerful at the time. Is there a line that would force Black coming out with a clear advantage?",
        "23... h6": "More development.",
        "24. Nf3": "The knight clearly needs to help the other two pieces, or White's finished.",
        "24... g5": "My pawns are getting closer, and allowing my king to have more flight squares.",
        "25. Nd2": "It's still going to be at least three more moves before that knight finds influence on my king.",
        "25... Kf7": "But I decide to do something about the attack now. I COULD have, but this was simply stupid and fatal. Much, MUCH better was Ke8, but I was greedy and didn't think Ke6 was dangerous.",
        "26. Bc5": "And it wouldn't have been, but the sad part was that I remembered why it was a bad square for the king back on 21 ...Kf8, and just forgotten about the pin. Now the pin is even more deadly.",
        "26... Re8": "White playing Ra7 would be better for me at this point.",
        "27. Nxc4": "At first, I didn't understand the exchange, but in case you don't, can you see what White's plan is?",
        "27... bxc4 28. Rc7": "It was a pawn drop. At this stage in the game, that is a problem that I need to dispute right now.",
        "28... Ke6": "If Rc6+, I play Kd7! White has to retreat the rook and capture at a6, but then I can rescue the pawn after Bxc5, and then after bxc5, I play Rc8. With my king closer to my pawn than his king to his, my pawn would promote first, and I would win.",
        "29. Bxe7": "But again, I'm too greedy. This saves White, and confirms that I have to face the material disadvantage. I'm in a lot of trouble right now.",
        "29... Rxe7": "Forced.",
        "30. Rxc4": "Well, what do I do now?",
        "30... Kd5": "I kick the rook out. If Rc5+, my King lands at d6. That would allow me to play Rc7 after he retreats, and forces a rook exchange, or else I would have mate (31. Rc5+ Kd6, Rc2 Rc7! Re2?! Rc1# fcd), and if White tried to play Rd2+, my king would retreat to c6, then b6, still fully allowing me enough time to drive the rook out to claim the queenside pawns.",
        "31. Rc2": "But my opponent sees all of this even more quickly than I do. The only thing I can do now is hope to keep my king near the exchanges. I'm almost certain that his true skill level is probably equal, if not a bit higher than mine at this point.",
        "31... f5": "Another mistake. I think Kd6 would have been better, and I just didn't want to pull my king back at this point, so I just charged with the pawns.",
        "32. f3": "Dare I move to e4?",
        "32... Re6": "Perhaps I should have, because I don't see how the rook is a threat now that I look again.",
        "33. Kf2": "[Okay Rick, you should really move that pawn to e4 before I do...]",
        "33... Rc6": "But, rook exchanges!!!",
        "34. e4+": "Yeah. Rc6 proved to be my undoing. If I dare exchange and capture the e4 pawn again, I lose my rook. Stupid, stupid, stupid. :(",
        "34... fxe4 35. fxe4+ Kd6 36. Rd2+": "So Kd6 got forced upon me, and I should have played it awhile ago. Now this rook check comes in, and my tempo advantage melted before my eyes. Why? Because my clock was under 3 minutes at this point. White has a decisive advantage at this point.",
        "36... Ke6": "It doesn't stop me from making one last desperate push for the kingside.",
        "37. Rd3": "Stopping my own Rc3, which would have been wonderful.",
        "37... Rd6": "I want his rook gone, and he knows it.",
        "38. Ke3": "So, he lets me have it.",
        "38... Rxd3+": "I don't even care anymore if his king is where it should be. I'm still pushing ahead.",
        "39. Kxd3": "Now it's all a matter of time to see who gets to h2 first.",
        "39... g4": "This allows my king to step on g5 first.",
        "40. g3": "This stops me from hitting from h4 right away.",
        "40... Kf6 41. Kc4": "I think he's trying to go after a6...",
        "41... Kg5 42. Kd5": "but in reality, he wanted e5. But why?",
        "42... h5": "Maybe I could beat him to h2 first. Maybe he made a mistake?",
        "43. Kxe5": "But no. He didn't. I was entirely wrong about the end position. Now I've realized that I was just one tempo too short of slipping my king through the door.",
        "43... h4 44. gxh4+ Kxh4 45. Kf4 Kh3 46. e5": "And here is the resulting punishment of it. White's king has trapped mine in a corner, and my material disadvantage makes it impossible for me to force White to move to h3. I resign here, as Mate is inevitably sure to follow at this point. Such a great game, but a poor finish on my part. :("
    },
    "url": "https://gameknot.com/annotation.pl/the-blitz-series-pt-3-a-missed-opportunity?gm=57528",
    "gameName": "The Blitz Series Pt. 3 - A Missed Opportunity",
    "players": "drenergize (1200) vs. Rickdaily12 (1576)",
    "opening": "Queen's pawn (D00), stonewall attack"
}