{
    "moves": {
        "1. d4 Nf6 2. Nc3 e5": "The Budapest. ",
        "3. e4": "A conservative approach. Good. Any other move was good, c5, or exd4...",
        "3... d6": "Still more conservative, but wrong. Black will end up very cramped. And white can play dxe, and if dxe, QxQ+. Not fatal, but small mistakes like this one help games to be more interesting! :-))",
        "4. d5": "Uh-oh.",
        "4... Bg4": "?! I opted for developement, well knowing what could come after...",
        "5. f3 Bh5": "If g4, I'll try to exploit white's opened kingside, but it won't be easy. ",
        "6. Qd3": "?! Well, it was very easy for me to spot the threat, Qb4+, but I was playing very bad.",
        "6... Bg6": "I saw that now I could take on d4 if the WN moves from c3. ",
        "7. Qb5+": "...but this made me ashamed of myself!",
        "7... Nbd7": "The best way out to this. ",
        "8. Qxb7 Rb8 9. Qxa7 Be7": "...and try to castle and hold before white can add more pressure. I accept I'll lose c7 to Nb5, but the king's safety comes first...",
        "10. Bb5": "Developing, but not as much aggressive as Nb5. ",
        "10... O-O": "If I can just ignore a move, the move must be put under investigation. White lost an attack's tempo. ",
        "11. Bxd7 Nxd7": "(Edit, thanks) In the hindisght, Qxd7 was much better, but I was happy with this, trying to find a way out. The problem with the lsb's outcome is that now Nb5 can't be played anymore due to the R...",
        "12. Qf2": "?! Well, what's the plan behind this? :-)",
        "12... Nb6": "?! I'm not any sure about this one or Nc5 or, even better, Qc8, thinking in c6. ",
        "13. h4": "I know, I know. ",
        "13... h5 14. g4": "Ah, white is playing hard, correctly trying to open my kingside! Very interesting! My kinside countergame is far from clear. ",
        "14... Qd7": "if anything else fails, I'll try c6. As for white's \"threat\", I can just ignore it. If g5, white will self-block himself. ",
        "15. gxh5 Bxh5": "...and now it will be hard to attack my B. ",
        "16. Qg2": "Preparing Bh6. My Rf8 is threatened, for the less. But to Bh6, I can simply answer Bf6...",
        "16... Na4": "I didn't play c6 just in time. This will allow the WN to jump to d4, and this will complicate thing for me. A lot. But not this way!",
        "17. Nxa4": "Otherwise, after NxN I could have threatened white's c3 in a couple of ways. ",
        "17... Qxa4": "The situation reverted: now I am the attacking part on the kingside!",
        "18. Bh6 Bf6": "As planned. This defence costs me the whole B pair, but it is very strong... or so it seems!",
        "19. b3": "? White has to defend b2, and he has NO good way to do it. With the text's, he opens holes in the black squares. Enjoy the following sequence!",
        "19... Qa5+": "(Edit) c3 is not possible anymore!",
        "20. Kd1 Qc3": "(Edit) Ra1 is threatened. ",
        "21. Rb1": "Ok, saved, but...",
        "21... Qd4+": "White must retire, and lose his attack. Be aware he can't retire the Q, but he can play Bd2... accepting to withdraw from the attack. ",
        "22. Bd2": "This is good. To understad when it's better to retire than to lose something more. It seems white paid his price, but it's not quite so...",
        "22... Qxe4": "Magnificent pin and justifying white's lsb weird position. From now on, f3 is a target, preventing white from developing. ",
        "23. Kc1 Qxd5": "Black balanced the material, and now my position looks far from desperate. Besides, I have some attack lines opened, while white's developement is still cramped due to the pinned f3!...",
        "24. Rh3": "Freeing the N to move. ",
        "24... Rba8": "(Edit) Threatening a2. Another step in pressure building. ",
        "25. Rg3": "!? I know that after Rxg7+, BxR, Bh6 would crush me, so...",
        "25... g6": "DefCon2. Now white has to work another lot to mine my king's bunker. ",
        "26. Bg5": "If I exchange, the R in g5 will be threatening my lsb since the g pawn is pinned. But I can simply move the king away. ",
        "26... Bxg5+ 27. Rxg5 Kh7": "...and now the defence stabilizes once more, at the price of my lsb being placed in a forced (but very important) square. ",
        "28. Qg3": "Unpinning the Q, so to move the f3 pawn (finaly!), but overlooking...",
        "28... Rxa2 29. Ne2": "? No, it was not still possible. c2 is too weak for this. ",
        "29... Qc5": "c2 is threatened, and c4, RxN. Qa3+ and Qe3+ are threatened, grabbing f3. ",
        "30. Rb2": "It seems a defence, but unfortunately, it isn't. ",
        "30... Qa3": "And despite white's aligned forces, it's curtain. Still, a high mark for my opponent!"
    },
    "url": "https://gameknot.com/annotation.pl/the-last-stroke?gm=57442",
    "gameName": "The last stroke",
    "players": "unnikuttankr  vs. damalfi ",
    "opening": "Queen's pawn game (A45)"
}