{
    "moves": {
        "1. e4 e5 2. Nf3 Nc6 3. d4": "White began with a Scotch game. It usually leads to early simplification or gambit situations for White. If Black chooses to avoid trading pieces, white has the choice of comfort to either go for a try on a closed or semi-opened game with d5 or take on e5, and open up the center right away.",
        "3... Nf6": "Black is avoiding early trades.",
        "4. Bg5": "So white continues with the aggression. This pin on Nf6 renders its attack of the e4 square useless, and it threatens dxe5. It's a pin we have all encountered more than once so the position is well understood by most: The knight can't move or Black will loose the queen. The only way to free the Black knight is to intercept the line of fire with the Black's king side bishop or to counter-attack with h6, which may force a trade of pieces on f6.",
        "4... d6": "Black decided to respond to dxe5 by cementing up the e5 pawn with d6, but it compromises more that in accomplishes.",
        "5. dxe5": "White takes the initiative to simplify. If black takes back with d6 pawn, white can trade queens and force weaknesses in Black position. If after 5. ... dxe5 6. Qxd1 Black takes back with the King, then (1) he can no longer castle to safety and will remain vulnerable in the center for quite some time and (2) White will have the option to double Black's pawns on the f file with the exchange of bishop for Knight. 6. ... Nxd8 might make more sense, but the d1 square is far from ideal for a Knight,White should seize the initiative with quicker development and some weaknesses on the King-side may be forced.",
        "5... h6": "Black attempts to counter-attack and somehow save the knight on f6. If the White bishop retreats to h4, then 6. ... f5 will save the f6 Knight from the pin and allow it to take on e4 or to retreat to a safer square.",
        "6. Bxf6": "The pin on f6 was no longer possible so this was a good time to make the exchange. Although trading the a bishop while opening up the center of the board is often strategically unsound, Black is forced to mess up the pawn structure with doubled pawns on the f file.",
        "6... gxf6 7. exd6": "It makes no sense to take back on f6, because one isolated pawn is easier to defend that two doubled isolated pawns. Therefore, White takes  the e pawn with 7. exd6.\nThe first pin of the game has forced a considerable weakness in Black's King side pawn structure.",
        "7... cxd6": "Here black should have taken back with the bishop 7. ... Bxd6. Second best choice would have probably been to take back with the Queen 7. ... Qxd6 and after the trade of queens to again take back with the bishop 8. Qxd6 Bxd6. After the trades, black could plan castling Queen-side and doubling rooks on the open g file if White ever castles King side. \nThe move cxd6 further weakens Black's pawns. Just 7 moves into the game and Black now has 4 pawn islands! This can't be good... \nFinally, this move limits the mobility and even momentarily traps the Black bishop on f8, which would have been a very important piece on this semi-open board for Black.",
        "8. Bb5": "White continues with yet another Pin on Black's only developed piece. The Black knight on c6 could have found a sweet spot on e5, offering a trade of knights on e5 which would greatly improve Black's pawn structure and control over the center of the board. \nWhereas pinning a piece to a piece of greater value threatens to win material, pinning a piece to the opponent's King completely immobilizes it. Given the situation on the board, the Black Knight is the only active Black piece. The remaining Black's forces are still undeveloped...",
        "8... Bg4": "Black now pins the White Knight to the Queen. White did have a threat of bringing that Knight to d4 attacking the pinned knight on 6, but that plan would have been far-fetched - Black could easily defend by developing that light-square bishop to d2.\nBetter would have been 8. ... Rg8, pressuring White's g2 pawn. That would also prevent White from castling King side, because after castle 9. o-o, Black would have a powerful pin 9. ... Bh3! - g2 would be pinned by the rook on g8 so gxh3 is impossible. Black would threaten to take the g2 pawn with the bishop setting up a discovery check and if 10. g3 Black would win the exchange with 10. ... Bxf1.",
        "9. Nbd2": "White responds to the pin with a developing move - the Knight defends the pinned piece allowing the White queen to eventually move out of the pin without the threat of having the King side pawn structure getting compromised by an exchange on f3. This move also blocks the a5-e1 diagonal, guarding the White king from checks.",
        "9... Qb6": "Black continues with the efforts to counter-attack. This move pins the White bishop on b5 and if it moves, the b2 pawn will be left unguarded. This move also prepares a pin on f2 if White castles King side.",
        "10. c4": "Here White could have also simply traded the bishop for the pinned knight, but giving up both bishops and further simplifying should be the last resort for White, because the game has the potential to open up and White would wish to not have traded away both bishops. ",
        "10... Be7": "Not a good move by Black. The black bishop does nothing there, as it's blocked in by it's own pieces. It appears as if Black intends to castle short which makes no sense since the King-side has major weaknesses...",
        "11. O-O": "White King moves to safety. Without the Black rook on g8, castling King side is absolutely safe.",
        "11... f5": "White tries to activate the e7 bishop by pushing the weak doubled pawn up the board for an exchange.",
        "12. Qb3": "If White were to take on f5, after Bxf5, the Black light-square bishop would become very strong, slicing into the White's territory over important squares. \nThe White Queen on b3 does many things. First, it relieves the pin on the f3 Knight. Second, it frees the d2 knight from the defensive bind to the f3 knight, because the White queen is now also defending it from a safe square; therefore now, if Black makes the pawn trade 13. ... fxe4, white can centralize the d2 knight with 14. Nxe4\nQb3 is a good move. It brings many of White pieces to life.",
        "12... Rg8": "This move came too late. Black's Bh3 tactic can be easily avoided and White can simply move the king out of the pin on the g2 pawn.",
        "13. Kh1": "Responds to Black's main threat of Bh3 and relieves the pin on f2 by the Black queen.",
        "13... Bh4": "A blunder. \nWhite Knight on f3 is no longer pinned down to anything and thus the Black bishop on h4 is unguarded.",
        "14. Nxh4": "No comment",
        "14... Kd8": "Black got annoyed with the pin on c6 and tried to escape just like the White queen did it a moment ago.",
        "15. Bxc6": "Now that the Black c6 knight was no longer pinned, it could have aggressively position itself on d4 or e5. White gives away the second bishop by making the trade, but now White is up material, so trading down pieces, increases White's advantage.",
        "15... Qxc6": "bxc6 would have given White the possibility to simplify further with a queen trade, so Black has to take back with the Queen in hopes of building any counter-measures.",
        "16. f3": "White wants to take on f5 and not to weaken its pawn structure, so f3 attacks the defender of f5 and also defends the e4 pawn which was now attacked twice: by the pawn on f5 and the queen on c6.\nBlack bishop will have to move, and that pawn is for the White knight on h6 to take.",
        "16... Bh5": "The Black bishop retreats to the only available square where it's movements are completely obstructed by the black pawns.",
        "17. Nxf5": "This square is quite favorable for the White knight. Well centralized, uneasy to kick out from and close to the Black king.",
        "17... d5": "Black intends to shuttle the queen over to the king side in hopes of any counter-play.",
        "18. cxd5": "White simply grabs the pawn, which is far from a Trojan horse per ce and opens up the c file preparing it for the a1 rook.\nWhite now also has a passed pawn - another great weakness in Black's possition",
        "18... Qg6": "Threatening mate with Qxg2  ",
        "19. Rfg1": "This move eliminates any chance of counter-play. White has a solid position. \nOn the other hand, White had the move g4!, trapping and winning the Black bishop on h5. After 19. g4 Bxg4; 20 fxg4 Qxg4; 21. Rg1 White wins the bishop over two pawns. \nNote however that this would open up a lot of space around the White's King position and waste a lot of time. \nThe Black Bishop on h4 is currently immobilized so I felt like trading it for 2 pawns would be more of a concession, because the Black King is sitting ducks in the center of the board, - mate is in the air, should go for the king before Black can reorganize his remaining forces to cover him up... g4 is a perfectly good move too, but I wanted to go for the King...I'm already up a piece and 3 pawns, - satisfying the hunger for material can often provide your opponent with time to build up a counter-plan.",
        "19... b6": "preventing Qxb7, but Black already has greater weaknesses in the position",
        "20. Qb4": "This move threatens to mate Black with 21. Qe7  Kc8; 22. Rc1  Kb8 23. Qc7++",
        "20... Ke8": "Black could have prolonged the struggle, but the outcome was inevitable. White is up a piece and 3 pawns.\n\nRespectfully, Black accelerates the game to a mate in one.",
        "21. Qe7#": "So the course of the game was greatly influenced by many different pins. White maintained the pins to the point at which it was no longer possible. The pins by Black were refuted and several threats to pin the pawns on f2 and g2 have been avoided by White. The blunder by Black on move 13 was also the result of White escaping the pin on the f3 Knight with 12 Qb3. The irritating pins on the Black knights have successfully limited Black's movements, on the other hand it seemed that Black did not anticipate the so very basic pins on the knights to be as harmful, as Black made no decent attempts to deal with the pins without allowing White to compromise Black's position."
    },
    "url": "https://gameknot.com/annotation.pl/the-power-of-a-pin?gm=4164",
    "gameName": "The Power of a Pin",
    "players": "pulsas (1200) vs. qp460 (1239)",
    "opening": "Scotch opening (C44)"
}