{
    "moves": {
        "1. d4 Nf6": "I decided to move my horse because it moves in an L shape and that is pretty cool.",
        "2. Bg5": "I haven't ever seen anyone do this before.",
        "2... e6": "But it's all coo' because my queen now has visual contact with the steed of awesomeness.",
        "3. e4": "I see your game, you devious rogue you!",
        "3... Be7": "That pin isn't cool yo. Not going to lose my Noble steed of awesomeness to some pawn like that.",
        "4. e5": "Still going to advance. Long hair, don't care",
        "4... Nd5": "Dun want my horsy to get taken.",
        "5. Bd2": "That dude with the cross on his head ran away. Probably because my army is so intimidating and what not.",
        "5... d6": "Quit cramping me yo, i need some room to breathe.",
        "6. c3": "Waste of a tempo and removes a good square for one of his horsy.",
        "6... dxe5": "HIYAHHHHH! And with the swiftness of a thousand lambs my pawn strikes!",
        "7. dxe5": "I drew first blood, so its all good.",
        "7... Nc6": "Now i have 2 horsy's running around. I wish i had an apple to feed them.",
        "8. Nf3": "One of his horsy's come to protect the evil foot soldier dude that is in my space.",
        "8... O-O": "My king decides it is time to chill in his awesome castle. It has a pool table.",
        "9. Bb5": "That other dude with the cross on his head came out. Long hair, she don't care.",
        "9... Bd7": "So i figure i will bring my other dude with the cross on his head. His name is Fredrick the 3rd and 1/2.",
        "10. Bxc6": "NOOOOOOOOOOOOOOO MY HORSEY! ",
        "10... Bxc6": "VENGEANCE! dang poachers are stealing my steeds. Luckily Fredrick the 3rd and 1/2 was there to rectify the situation and maintain order.",
        "11. O-O": "He goes into his castle. It probably doesn't have a pool table though.",
        "11... Nb6": "My horsey made another L. It was pretty cool.",
        "12. Qc2": "The evil succubus is on the move! You shan't have my king succubus!",
        "12... Bxf3": "I decide to exchange my crossheaded dude for one of his horsey's, thus piercing his castle!",
        "13. gxf3": "Now that i see inside his castle, i am certain there is no pool table.",
        "13... Nc4": "My horsey threatens his cross headed guy.",
        "14. Bf4": "But his cross headed guy runs away... again. What a pansy.",
        "14... Bg5": "However, my cross headed guy is not a pansy, and looks to do battle.",
        "15. Bg3": "And his cross headed guy runs away again! pansy...",
        "15... Bh4": "My guy will not be denied!",
        "16. b3": "meh...",
        "16... Bxg3": "Hiyahhhh! and the cowardly cross headed dude is slain. ",
        "17. hxg3": "and now no crosses remain. And his castle still has a hole in it... Whats up with that?",
        "17... Nxe5": "Yo... my horsey just ate a man. that is what happens when you don't feed them apples.",
        "18. Nd2": "His horsey finally enters into the field. About time you lazy horse. Maybe he had too many apples?",
        "18... Qf6": "And my noble lady leaps into the field!",
        "19. f4": "meh...",
        "19... Ng4": "Your castle is all but destroyed! your walls are crumbling and my army approaches!",
        "20. Nf3": "His horsey comes to the defense...",
        "20... e5": "But my minions know no fear! and i'm pretty sure there are apples on the other side of the board.",
        "21. Kg2": "meh...",
        "21... exf4": "Invading the castle for all the apples and other assorted fruits for my horsey.",
        "22. gxf4": "meh...",
        "22... Qxf4": "Your castle is all but destroyed, your apples will soon belong to me!",
        "23. Rfh1": "A pathetic attempt to raid my castle! The pool table shall remain in my possession.",
        "23... h6": "Your feeble assault has been repelled! My bulwark of fortitude is unrivaled!",
        "24. Rh4": "I'm not worried. Your apples will soon belong to me.",
        "24... g5": "And my castle suddenly grows feet and charges into the fray! Soon i shall send everything at your crumbling structure. Except for the pool table of course... That stays with me.",
        "25. Nxg5": "A last ditch effort to create an opening for my pool table.",
        "25... Qxg5": "However your assault is easily repelled once more.",
        "26. Rh3": "Retreat you little pansy! Your apples will soon belong to me.",
        "26... Ne3+": "And my noble steed makes his move on the evil succubus, whilst my noble lady discovers the king and his apples.",
        "27. Kf3": "The castle has been fully vacated, and the apples are ripe for the taking!",
        "27... Nxc2": "But first the steed defeats the evil succubus in battle.",
        "28. Rg3": "Hmm... the noble lady is put in a predicament. However, the battle is all but over, and the apples will soon be mine.",
        "28... Qxg3+": "And this is where my opponent cancels the game? He didn't leave, he didn't resign, but cancelled on the count of a move taking too long? Personally i'm a bit upset with that as i didn't think any of my moves were particularly long, however i have an apple, so i'm still calling it a victory and dominant performance. My pool table was not even threatened in the process either."
    },
    "url": "https://gameknot.com/annotation.pl/the-apple-assault?gm=45788",
    "gameName": "The Apple assault",
    "players": "rawgirl  vs. yrahcaz0729 ",
    "opening": "Trompovsky attack (Ruth, Opovcensky opening) (A45)"
}