{
    "moves": {
        "1. Nf3": "Hi everyone!\n\nThis could be my very last game against The Coach.  I was hoping it would end on a fairly high note for Yours Truly but alas it wasn't to be.  Of what was intended to be a de-cramping exchange of bishops turned out to be something completely different.  Because Glenda was on the same line as Ion's dsb, Ion was able to take advantage of this by exchanging his rook for two of my pieces.  This exchange proved to be as disastrous as it could be and the end was almost comical - my rook was trying to evade Ion's swarming pieces but it was all in vain and I ended up resigning on the grounds of ruinous loss of material.  So how did this happen?  You can follow the game with this link. http://gameknot.com/analyze-board.pl?bd=18375546&fb=1&rnd=0.12734190257427663",
        "1... d5": "1..... d5 - Ion chooses to kick off with the Reti Opening and I played the standard response to it.",
        "2. g3 c6 3. Bg2": "3. Bg2 - a standard fianchetto in both the Reti and English Opening.",
        "3... Nf6": "3. ...... Nf6 - development.",
        "4. c4 e6 5. b3 b5 6. O-O Ba6": "6. ..... Ba6 - not bad but in retrospect and due to what was to follow, maybe I could have prepared this move with a5.  The a pawn where it stands becomes a target for Ion's dsb later on.  The bishop move indirectly bears down on Ion's rook on f1.",
        "7. d3 Nbd7 8. Nbd2 Be7 9. Bb2": "9. Bb2 - double fianchetto.",
        "9... O-O 10. Rc1 Qb6": "10. ..... Qb6 - not fatal but a step towards perdition.",
        "11. Rc2 Rfd8 12. Qa1 Ne8": "12. ...... Ne8 - interesting.  This move was recommended in the World DB but according to Gameknot Analysis this is an innacuracy.  It does make the knight more passive, I must admit.",
        "13. cxd5 cxd5 14. Bd4 Bc5": "14. ...... Bc5? - here is the fatal error.  Glenda should have gone to b7 even though she was in line with Ion's lsb.  It would take a few moves before that diagnoal is opened and in that time I could have got Glenda to safety.",
        "15. Rxc5 Nxc5 16. Rc1": "16. Rc1 - pile on.",
        "16... Rdc8 17. Rxc5 Rxc5 18. b4 Rc1+": "18. ...... Rc1+ - I do not want to allow Ion to get a passer on the c column so I decided to lose my rook in this way.",
        "19. Qxc1 Qc7 20. Qxc7 Nxc7": "20.  ....... Nxc7 - queen trade.  Ion criticised this exchange and warned me that the endgame would not be promising.  Boy wasn't he right!  It was difficult, however, to see anything better.",
        "21. Be5 Rc8": "21. ..... Rc8 - trying to compensate for the material minus by optimising the power of my rook - bag an open file.  But Ion has a way of closing it!",
        "22. Nb3 Bb7 23. Nc5": "23. Nc5! - In his favour!",
        "23... Bc6 24. Nd4 Be8 25. Bh3": "25. Bh3 - here comes the swarm!  Already my e pawn is pinned to my c8 rook.",
        "25... Na8": "25. ..... Na8 - this is the fatal innacuracy.  The plan is for my knight to go to b6 and make some bid for freedom but I never get the chance to execute it.",
        "26. Ndxe6 f6": "26. ....... f6 - not fxe6 because of Bxe6+ forking Henry and the c8 rook.",
        "27. Bd6": "27. Bd6 - nasty.",
        "27... Rc6 28. Bb8": "28. Bb8 - nastier - this is what I meant in my earlier note about this pawn.  Ion is after much bigger fish though ....",
        "28... a6 29. Nd8": "20. Nd8 - Bleeeurgh - here I told Ion that I felt that the chessboard had become a minefield for my rook.  Ion then described his pieces as soldier ants swarming over my rook and warned me that my rook was running out of safe squares.  Two moves later my rook was trapped and I then resigned on the grounds of ruinous loss of material.  I played this game very badly but Coach Ion must take credit for the awesome way he manoeuvered his pieces to induce me to concede a ruinous amount of material.  Well played there.  At least I will soon have a much better game against an Expert to annotate.  This time I manage a draw .....",
        "29... Rb6 30. Ba7 Rd6 31. Ncb7": ""
    },
    "url": "https://gameknot.com/annotation.pl/the-swarm-part-2?gm=47574",
    "gameName": "The Swarm - Part 2",
    "players": "ionadowman (2108) vs. jstevens1 (1952)",
    "opening": "Reti (A07), King's Indian attack (Barcza system)"
}