{
    "moves": {
        "1. e4 d5 2. exd5 Nf6 3. c4": "White seems unaware of the dangers of this early outcome (or maybe he knows too well how to get out of it). Let's show. ",
        "3... e6 4. dxe6 Bxe6 5. d4 Bb4+": "Here the fun starts. ",
        "6. Nc3": "I'd prefer Bd2, so to create inmediate urge for a response, before I can use my developement advantage.",
        "6... Ne4": "Now, the normal is Qc2. Probably the only one. ",
        "7. d5": "Nice try. But NxN, bxN, Bxc3+, Bd2, and all I have is BxR, and then I'll lose one of the two bishops. Not enough.",
        "7... Qf6": "I go this risky one. Threatening f2, but allowing...",
        "8. Qa4+ Bd7 9. Qxb4": "Qc2 was needed. ",
        "9... Qxf2+ 10. Kd1 Qxf1+ 11. Kc2 Qxg2+ 12. Nge2": "Ok. I have the advantage. I have a free R and a free N. White has Qxb7, a rook and a forced castling. If I move the Q, I'll lose Ne5, and if Bf5, Qxb7 and if I don't mate... anyway. Make it simple. ",
        "12... Nxc3 13. bxc3": "White wants to keep the threat on b7. ",
        "13... Bf5+": "I can take two pieces, but I like this move in order to get some firepower into the battle. ",
        "14. Kb3": "Now, I can play a5 right away. If Qxb7, a4+. But I can take the R and still threaten white with Qd8+, winning Ne2 too, let my R on a8 to be taken, and then castling is ok. ",
        "14... Qxh1 15. Bg5": "White had a very nice idea, that I didn't see, and that puts me in some trouble. On a blitz I'm too dumb to see everything. Fortunately, I have a way to escape. ",
        "15... Qe4": "But this still allows Qxb7. White wanted to go on pressing me. ",
        "16. Ng3": "...and this nice move wins a piece. ",
        "16... Qe5": "The Q can't move from the guard of e7. ",
        "17. Nxf5 f6": "This stops white's main threat, and keeps \"on\" Qxb7. ",
        "18. Nxg7+ Kf7": "Same situation: two attacked pieces. Again, white has an escape route: ",
        "19. Bh6": "If Rg8, Rg1. But hey, if I cannot create a real threat, I better defend. ",
        "19... b6": "This is not only a defensive move, thoug...",
        "20. Ne6": "White settle his weak minor pieces, but... the cost will be too high. ",
        "20... a5 21. Qb5 a4+": "If Ka3, Qxc3+ and white has to lose the Q to save the K. If Kb2, I have plenty of moves, like a3+, or Qe2+. Nothing deadly, but my opponent went a little scared from the course the game took... and fell in a nasty trap. ",
        "22. Kb4": "Well...",
        "22... Ra5 23. Rg1 Rxb5+ 24. Kxb5 c6+": "? I am \"able\" to trhow the game away, if I'm not careful. This was an unnecessary mistake (it is to be said that white should have played Bf4 and make my Q run away from its fantastic position. ",
        "25. Kxb6 Rg8": "This is profilactic. White has to avoid exchanges, not me...",
        "26. Rxg8": "Almost a resignation. ",
        "26... Kxg8 27. Kc5": "White should have tried to defend d5 by playing Kb7. After the pawn's exchange, my Q \"can't\" take on d5 because of KxN. Not much difference, though...",
        "27... cxd5 28. cxd5 Qxc3+ 29. Kd6": "I didn't see Qb4+, but there is no mate. A good move would be Kf7, threatening Qc6#, but white has Nd8+... ",
        "29... Na6": "First N move. I can bet in any other moment, to \"develop\" it would have been a huge mistake. ",
        "30. Bf8": "I can still play Qb3+, k moves, QxB and I'll win with N and f pawn. But of course, you don't want to be so slow...",
        "30... Qe5+ 31. Kc6": "Well, he I can try...",
        "31... Nb8+": "Just a little help...",
        "32. Kc5": "?? Definitely losing the game. Of course, any other move and Qxd5, winning. ",
        "32... Nd7+": "...and here my opponent resigned, of course. The \"sitting N\" gave me the \"coup de grace\"."
    },
    "url": "https://gameknot.com/annotation.pl/the-sitting-n?gm=61265",
    "gameName": "The sitting N",
    "players": "deedza (1489) vs. damafi (1434)",
    "opening": "Scandinavian (B01), Icelandic gambit"
}