{
    "moves": {
        "1. e4": "Since both players are (obviously) way above my playing level, there is a good chance that I'll miss a lot of ideas/points/trick behind the moves of both sides. I'm just warning you now... ;)\n",
        "1... Nf6": "Alekhine's defence. I don't know much theory behind this opening, but I'll take a guess that Black hopes for counter-attacking options against White...\n",
        "2. e5": "Timman's knight move prompts this move - Short is able to get a tempo attack against him...\n",
        "2... Nd5 3. d4": "...in return for a solid centre.\n",
        "3... d6": "This move was played to perhaps weaken Short's centre control in the near future, as well as opening up a path for the light square bishop\n",
        "4. Nf3": "As I'm following the GK database to check the moves played so far [as I've said, I don't have a lot of experience with this line], I can tell that both sides are still in mainline theory. This knight development is defined as the modern variation of Alekhine's defence.\n",
        "4... g6": "!? According to GK, Bg4 is played more here (followed by dxe5, with this move coming in third place). This is defined as the fianchetto variation, as of course is completely playable.\n",
        "5. Bc4": "Before Timman can fianchetto his bishop, he needs to save his knight! [this is now called the keres variation according to GK]\n",
        "5... Nb6": "The best move, gaining a tempo attack on the bishop with the retreat\n",
        "6. Bb3": "Short maintains pressure on the a2-g8 diagonal\n",
        "6... Bg7 7. Qe2": "Another option here is 7.a4, starting activity queenside\n",
        "7... Nc6": "knight development...\n",
        "8. O-O O-O": "...and castling.\n",
        "9. h3": "Because of membership restrictions, my analysis of the database ends here, but it shows that only 15 games reached this position. h3 is played to prevent Bg4\n",
        "9... a5": "Timman starts activity queenside... (I may have looked at 9...Na5 as a possibility as well, looking to trade off bishop for knight)\n",
        "10. a4": "...and Short counters\n",
        "10... dxe5": "Timman initiates a pawn exchange...\n",
        "11. dxe5": "and now both sides will wage war over the e5 pawn in the centre.\n",
        "11... Nd4": "! Not a bad start. Timman provokes the knight exchange...\n",
        "12. Nxd4 Qxd4": "to bring out his queen. Now there are two pieces attacking e5 and one defending.\n",
        "13. Re1": "The best move for Short. He now threatens 14.e6!, and no matter what happens, the e-file will become semi-open, and the strength of Short's queen and rook will grow\n",
        "13... e6": "Preventing the pawn from advancing\n",
        "14. Nd2": "Short now looks to ease the pressure on his position. The knight is destined for f3, where it will drive away Timman's queen\n",
        "14... Nd5": "Timman, in turn, centralises his knight\n",
        "15. Nf3 Qc5": "Timman retreats his queen, and targets White's c2 pawn as well! \n",
        "16. Qe4": "!? I would have played c3 in this position - committing my queen to its defence just doesn't seem sure enough to me... though this move turns out just fine!\n",
        "16... Qb4": ".Short need not worry about the pawn now. Instead, Timman offers an exchange of queens\n",
        "17. Bc4": "Good move - instead of retreating the queen to a less active (or more awkward) square, Short simply blocks the attack. Short's queen definitely has more power here!\n",
        "17... Nb6": "Timman retreats his knight back to b6 to threaten the c4 bishop.\n",
        "18. b3": "Again, Short doesn't want to retreat his piece...\n",
        "18... Nxc4": "so Timman exchanges\n",
        "19. bxc4": "! 19.Qxc4 Qxc4 20.bxc4 would have doubled up the pawns anyway. With this move, Short preserves the strength of his centralised queen\n",
        "19... Re8": "Short was threatening Ba3, but why not Rd8? It grabs the open file...\n",
        "20. Rd1": "and allows this move from Short!\n",
        "20... Qc5": "Timman attempts to get his queen more active...\n",
        "21. Qh4": "while Short aims his at kingside! This move serves another purpose, as will be revealed in the next couple of moves...\n",
        "21... b6": "With the idea of Bb7... but couldn't Timman simply play Bxe5? After all, there are two pieces attacking it and only one defending - Timman must have been worried about the defence around his king - 21...Bxe5 22.Nxe5 Qxe5 23.Qh6, and should Short's dark square bishop ever occupy the long diagonal, the results could be devastating!\n",
        "22. Be3": "After 22 moves, Short finally brings his last piece into the game. This isn't so much an attack on the queen as it is a zwischenzug...  \n",
        "22... Qc6": "The Black queen doesn't have a lot of options here - Qe7 was on I looked at as an alternate variation, trying to get rid of the queens, but then Short can simply play Bg5... the idea behind this move is to pin the knight after Bb7.\n",
        "23. Bh6": "Now Short reveals the real purpose of the bishop, putting the question to the fianchettoed bishop. There really is only one logical answer to this...\n",
        "23... Bh8": "Timman initiating the exchange doesn't work - after Short recaptures with his queen, all roads lead to mate after Ng5 (and his pawn on e5 conveniently stops f6) leaving the bishop isn't as hazardous, but Black still has to deal with increased pressure on his king e.g. 23...Bb7 24.Bxg7 Kxg7 25.Qf6+ Kg8 26.Nf6 Rf8, and White looks better. Undoubtedly this is the best move to make, I believe. \n",
        "24. Rd8": "!! Very strong move! Short takes advantage of the fact that Timman's rooks aren't connected and will now claim full ownership of the file, no matter what Black does. Timman cannot exchange, as that will lead to mate\n",
        "24... Bb7": "This was Timman's original plan anyway...\n",
        "25. Rad1": "solidifying the d-file for White\n",
        "25... Bg7": "Seeing a trick, Timman has a change of heart. Now that Short's knight cannot move, it will be perfectly safe to exchange on h6. This move also threatens to win the rook on d8, as after Bxh6, Qxh6 Timman simply plays Rxd8.\n",
        "26. Rd8d7": "Short takes care of the material gaining trick...\n",
        "26... Ref8": "Seems forced, because 27.Bxg7 Kxg7 28.Qf6+ will mate I guess that Bxh6 is unplayabe now (because the rook-winning trick is gone) because Short can then play a rook to d4, then Rh4, and there doesn't seem to be any valid defence to this\n",
        "27. Bxg7": "Short now trades off the bishops...\n",
        "27... Kxg7 28. Rd1d4": "!! A subtle, but brilliant move. This move accomplishes three things, which will be revealed in due course. It doesn't look like Short has any forcing sacrificial combinations, (though he is undoubtedly better) the path to victory is surprisingly simple...\n",
        "28... Rae8": "What else can Tammin do? he doesn't have many options...  (note that Qxa4 isn't that good of an idea - after Rxc7 it will now be nigh on impossible to shift the roof from the seventh rank, and if Timman doesn't play Bc8, then Rdd7! is crushing!)\n",
        "29. Qf6+": "This is vital for Short's plan\n",
        "29... Kg8": "Forced.\n",
        "30. h4": "And now comes the first use of the rook on d4. The h4 pawn cannot be allowed to advance! Should the white pawn get to h5, it cannot be captured; 30...Ba6 31.h5 gxh5 32.Rh4!! Qxd7 33.Rxh5 Qd1+ [delaying mate] 34.Kh2 Qd2 [the only way to stop mate] 35.Rg5+ Qxg5 36.Nxg5 and it is now mate in 2 (Qh6, Qxh7#). Of course, ignoring the pawn doesn't help either, because after h6, Short simply mates on g7.\n",
        "30... h5": "The only move to stop the h4 pawn. Now though Timman is still cramped in his play, it doesn't seem like Short can do anything. (though if anyone sees a line other than what was played in the game, feel free to comment) The rook on d7 is keeping the pressure on Black - not advised to move it. The rook on d4 protects d7 - where can that go? the queen, again, is there to keep pressure on Timman, and the knight is still pinned due to the mate threat on g2. There is only one piece that can be moved...\n",
        "31. Kh2": "At first glance, this does look like a waiting move, as most king moves are in the middlegame...\n",
        "31... Rec8": "Does Bc8 look better here? well, it does put up more of a fight to me, it seems, but I think that Short can still win in those lines; 31...Bc8 32.Ng5! and now; if Bxd7 then Rf4 and mate will follow after Nxf7 (the second useful advantage of 28.Rd1d4) If 32...Qxd7 33.Rxd7 Bxd7, then the game would continue a lot like the game continuation (though with a difference... I'll let you know when I come to it, as I may have miscalculated in the Qxd7 line..)\n",
        "32. Kg3": "What's this? where's the king going? Technically this is still the middlegame, surely!\n",
        "32... Rce8": "Perhaps now, Timman sees the final destination of the king...\n",
        "33. Kf4": "and knows that there is nothing he can do to stop it! The third use of Rd1d4 - if not for that rook, Timman could have stopped this with Qe4.\n",
        "33... Bc8": "Hoping to distract Short - but it is not to be! Short's king moves to Kg5 next move, and Timman resigns as there is no defence to Kh6, then Qg7#. This would never have been possible without Short's vicelike grip on Timman's position. great tactics by Short, and a classy finish too! :) Just one more thing...\n",
        "34. Kg5": "I would like to go back to the Qxd7 line mentioned back at move 32 - 32...Qxd7 33.Rxd7 Bxd7 34.Kg3 Bxa4 [supposing Timman tries promotion] 35.Kf4 Bxc2 36.Nh3 a4 37.Kg5 [and now Timman can play] Kh7 38.Nf4 a3 39.Nxh5! [a sac to open the position; all lines I've looked at leads to mate e.g. 39...Rh8 40.Qxf7+ Kh8 41.Nf6 Rg7 42.Qxe8+ Rg8 43.Qxg8#] 38...Bd1 is similary met with 39.Nxg6! and the only way I can see to stop mate is 39...Rg8 40.Qxf7+ Rg7 41.Qxe8+ Rg8 42.Qd7+ Rd7 43.Qxd1 Rxg6+ 44.Kxh5, with a won endgame for Short. There are many more lines that I looked at, so if anyone is curious about those other lines, or they found a possible refutation to all this, feel free to comment or PM me :)\n"
    },
    "url": "https://gameknot.com/annotation.pl/the-king-as-an-attacking-piece?gm=32205",
    "gameName": "The king as an attacking piece",
    "players": "Nigel Short (2660) vs. Jan Timman (2630)",
    "opening": "Alekhine's defence (B04), modern, Keres variation"
}