{
    "moves": {
        "1. e4": "I always open e4 unless I'm in a game with pre-set moves.",
        "1... c5": "And Steve and I have had many battles with the Sicilian, one of which was my favorite game of all time: http://gameknot.com/annotation.pl/nicolsos-isle-of-wight-open-2010?gm=37371",
        "2. Nf3 e6": "He's made a habit of playing either the Dragon or the Najdorf against me. This variation -- the Paulsen -- is just as good, but has a different flavor.",
        "3. d4 cxd4 4. Nxd4 a6 5. Nc3 Qf6": "The first surprise. I'd expected a knight to eventually go to f6; putting the queen there means a different setup is coming.",
        "6. Be3": "Designed to make Bc5 less attractive, this is the best square for the dark-squared bishop.",
        "6... Bb4": "Pinning the knight, now that the bishop has chosen e3 instead of d2.",
        "7. Qd2": "Bc4 was maybe a little more straightforward, making way for a kingside castle. This move makes way for O-O-O instead.",
        "7... h6": "Keeping the bishop off of g5; I would've preferred developing a piece, but this is fine.",
        "8. f3": "In hindsight, this wasn't the strongest move either. There's no pressure on e4, so no need to protect it just now.",
        "8... Ne7": "Consistent, and clears the way for a kingside castle. Playing the Sicilian and delaying queenside development pretty much commits black to castling kingside, though there are exceptions.",
        "9. O-O-O O-O 10. g4": "Castling on opposite sides of the board in an opening like this generally mean you're going to see a race to attack the kings: white will attack the kingside while black will counterattack on the queenside. This (overly?) aggressive move gets straight to the point, and helps justify the earlier f3.",
        "10... Qe5": "Greatly enhancing the queen's mobility, but beginning queenside development was maybe a superior strategy.",
        "11. f4": "h4 was maybe stronger, but chasing the queen out of the center isn't all bad.",
        "11... Qa5": "The pin on the Nc3 is now very strong.",
        "12. Nb3": "Again, chasing the queen. Black can respond Bxc3, but after 13. Nxa5 Bxd2+ 14. Rxd2, black is at a pretty severe positional disadvantage.",
        "12... Qc7": "Best, as this keeps up the pressure on the still-pinned Nc3.",
        "13. Be2": "It's small moves like this that get me into trouble. Yes, connecting the rooks is a smart move, yes, it keeps the g-file free for possible rook action, but what's black going to do with his light-squared bishop? Probably eventually eye the h1-a8 diagonal, and this just helps black out.",
        "13... b5": "Prepping for Bb7, attacking the e-pawn, which is unprotected thanks to the Bb4 pinning the knight.",
        "14. h4": "Pushing for an attack without paying any mind to defense. Yes, it's easier to attack than find the correct defense, but black's position is not easy to break through.",
        "14... Bb7": "Obvious and good. White has to address the threat to e4 now.",
        "15. Bf3": "Necessary to defend the pawn.",
        "15... f5": "Threatening to win a pawn.",
        "16. g5": "?! My first mistake of the game. This gives up a pawn in order to launch an attack on the black king.",
        "16... fxe4": "Free pawn.",
        "17. Bg4": "Keeping the second rank clear.",
        "17... Nd5": "Putting even more pressure on the Nc3 while also hitting f4. White is looking like he may lose another pawn unless some defensive measures happen.",
        "18. Rhf1": "?! Defending against the triple threat on f4, but this move fails to press the attack on the kingside and concedes a material loss near white's king.",
        "18... Bxc3": "Nxc3 was also playable; this forces recapture with the pawn.",
        "19. bxc3": "Forced.",
        "19... Qxc3": "! I like this move for black, getting the queens off the board and winning a second pawn.",
        "20. Qxc3": "Forced, as any attempt to keep the queens on loses the Be3, and maybe even more.",
        "20... Nxc3": "Black is up two pawns, and can win a third (the a-pawn) with check next move. This can get ugly for white, but even with the queens off there are still a few threats.",
        "21. Rd6": "A good square for the d-rook, which had to move. If white wants to stay in this, he has got to put pressure on black's remaining army.",
        "21... Nxa2+": "?! A little weak. How can winning a pawn with check be weak? Black's advantage is material only; his pieces are uncoordinated and his pawn structure is a mess. This not only fails to address that, it moves the knight farther away from where the action is taking place.",
        "22. Kb2": "Tempoing the knight, and taking away the c3 square.",
        "22... Nb4": "Forced.",
        "23. Nc5": "Here's the thing about chess when you're down-but-not-out yet: you're not going to get anywhere making the \"objectively best\" move most of the time. You've got to put pressure on your opponent, and make it easy for him to make a mistake!",
        "23... Bc6": "Saving the bishop while also protecting d7.",
        "24. Bd4": "An easy move to make, but not necessarily the best; gxh5 offered a number of good threats, too. But it's important to remember that black has a lot of threats of his own, most of which take the form of exchanging pieces to a won endgame! My goal is to prevent that and drum up threats against his king and pieces!",
        "24... hxg5": "?! A weakening move, although I can understand the desire to prevent gxh6, which was tempting last move. h5 looked better.",
        "25. hxg5": "Of course not fxg5; I liked this recapture for opening the h-file with two rooks and two bishops on. What I didn't see, however, was 25. Nxe6!, which leaves white with a great attack after either dxe6 26. Bxe6+ (and black faces huge problems after the king moves to the h-file) or R-moves followed by 26. Nxg5 and at least equality.",
        "25... Nd5": "? This move looks good on the surface as it threatens a variety of things: the pawn on f4, to advance e4-e3, maybe to even play Nb6 with an eye to Nc4+, forking the rook. But white now has a sacrifice of his own that wins the Nd5 and turns the tables: 26. Nxd7 Bxd7 (not Nxd7 27. Bxe6+) 27. Rxd7! Nxd7 28. Bxe6+, and white's attack is tremendous.",
        "26. Nxe6": "?! The wrong pawn! This improves white's situation over what it was a few moves ago, but is a much weaker move than Nxd7.",
        "26... Rf7": "Much better than dxe6 27. Bxe6+, but after all the carnage, _this_ position is roughly equal.",
        "27. g6": "This was a hard move to find, but I like it a lot. The rook must move (and e7 is the only safe square), and this really hems in the black king.",
        "27... Re7": "Forced.",
        "28. Nd8": "Threatening 29. Nxc6, which will either run into Nxc6 30. Rxd5, winning a piece, or dxc6 30. Rd8+ Re8 31. Rxe8#.",
        "28... a5": "Nothing better, as there's no way to move the Nb8 and free the Ra8 to roam the 8th rank.",
        "29. Bc5": "?! Getting cute and going for an extra threat on the Re7, when simply Nxc6 gives white a winning edge.",
        "29... b4": "?? Na6 was the saving move, as Nxc6 could be met with Nxc5!, re-defending the d7 square in the process.",
        "30. Rxd5": "?! Missing Nxc6, which -- with the white pawn on g6 -- would now win easily! 30. Nxc6 Nxc6 (not dxc6 31. Rd8 and mate to follow) 31. Rxd5, and black needs to drop the Re7 for a bishop to avoid going down even further. Rxd5 is still solid, as it wins a knight and rook for a rook, but there's still a lot of chess left, now.",
        "30... Bxd5": "The only move.",
        "31. Bxe7": "Also the only move.",
        "31... Nc6": "Pretty much forcing the exchange of knights.",
        "32. Nxc6 dxc6": "Okay, let's take stock now. White is up a bishop for two pawns, has a slightly more aggressive position, and black's king is a little vulnerable. On the other hand, black has some aggressive pawns and a little firepower, too. Having escaped a losing position, we turn to winning a won game, which is full of challenges!",
        "33. f5": "I'd love to play Be6+, but black's Bd5 prevents that, so I have thoughts of trying to turn my kingside pawn edge into a new queen.",
        "33... Re8": "A good move, supporting an e-pawn push and hitting the bishop.",
        "34. f6": "I like this move even if the computer analysis doesn't; this makes it hard for black to do any counterattacking.",
        "34... gxf6": "Best.",
        "35. Bxf6": "All of a sudden, there's the threat of Rh1 followed by Rh8#!",
        "35... e3": "Stymying that threat, but this doesn't really solve black's problems.",
        "36. Rf5": "Now the threat is Rh5 followed by Rh8#.",
        "36... Be4": "Of course not pushing for the queen, which gets black checkmated, but this is the final mistake, and allows white to win in a more roundabout way.",
        "37. Re5": "Okay, look. I appreciate that there's more than one way to win a won game, and that to many, that means to look for the win that happens in the least number of moves. (The computer prefers Rg6 here.) But here's the thing, this move is best for me for two reasons: 1.) It forces the rooks off the board (or white wins the bishop), and 2.) that simplifies to an endgame where ***I see the win***.",
        "37... Rxe5": "Best.",
        "38. Bxe5": "This is what I was hoping for. Can you see what's going to happen?",
        "38... Bxg6": "Yes, black is going to play Bxg6, with temporary material equality. But the e-pawn will fall in two moves, and black's other pawns are too far away from his king to save. The best he can do is wind up in a K+B+P vs. K+P endgame or a K+2B vs K endgame, both wins for white.",
        "39. Bd4": "There is no saving the e-pawn.",
        "39... a4": "Pushing his own pawns in hopes of queening one or causing a white mistake.",
        "40. Be6+": "I like this in-between move. White _could_ just play Bxe3, but this puts a wet blanket on black's queening ambitions.",
        "40... Kh7": "There is no good move here.",
        "41. Bxe3": "Now.",
        "41... a3+": "Trappy. Making white fight for it. Note that b3 doesn't get white's c-pawn off the board; white plays c3 followed by Ka3, Bc1 and winning both pawns for nothing.",
        "42. Kb1": "! Smart. Of course not 42. Ka2 (Bxc2), but also not 42. Kb3, as a2! creates headaches for white.",
        "42... Bxc2+": "I was shocked to see this, but there's no good answer to the threat of Bc5 followed by the cleanup of the black pawns. This leads to an instructive two bishop endgame.",
        "43. Kxc2 Kg6 44. Kb3 Kf6 45. Bc4": "Step 1: clean up black's remaining pawns, to shut down any shenanigans.",
        "45... Ke5 46. Kxb4": "1 down, 2 to go.",
        "46... Ke4 47. Bc5": "This is the most powerful part about two bishops in the endgame: they create a wall one space in front of them and two impassable diagonal walls. The king is stuck, and can mount no threats.",
        "47... a2 48. Bxa2": "Two down, one to go.",
        "48... Kf4 49. Bd4": "It's faster to get the bishop out of the way and just get there with the king.",
        "49... Ke4 50. Kc5 Kf5": "Kd3 -- with an eye to taking the d4 bishop if Kxc6 -- is best met by Bb1+, forcing the king away from both bishops.",
        "51. Kxc6": "Three down. Time for Step 2: to corral the black king and force him to one side of the board.",
        "51... Ke4 52. Kc5 Kd3 53. Bb1+": "This forces the king off the third rank and nearer to the rim.",
        "53... Ke2 54. Be4": "And this will keep him there. Note how he can only move between d2 and e2 without backing up even farther.",
        "54... Kd2 55. Kc4": "Bringing the king in is essential.",
        "55... Ke2 56. Kc3": "And by taking away d2, black is forced onto the rim.",
        "56... Kf1": "Now that he's chosen a square, the key will be keeping him there.",
        "57. Bf3": "Taking away e2. Note that Kd2 here would have resulted in stalemate; it's important to be careful!",
        "57... Ke1 58. Be3": "This is the key position to setting up Step 3: checkmate in the corner. Black is caught between e1 and f1, making the kingside the \"weak side\" and the queenside the \"strong side\". To finish the mate, I'll have to move my king to the weak side, where it will cut off the black king's escape.",
        "58... Kf1 59. Kd3": "And I've got all the time in the world to do it.",
        "59... Ke1 60. Ke4 Kf1 61. Kf4 Ke1 62. Kg3 Kf1": "Now the last part begins: forcing the black king into the corner, which here means freeing up g1 and taking away e1.",
        "63. Bd2 Kg1": "And now to force him to h1.",
        "64. Be2 Kh1 65. Kh3": "This \"extra\" move is vital! Note how a premature Be3 here would result in stalemate.",
        "65... Kg1": "Forced.",
        "66. Be3+": "Black resigns. At last, victory is here; the finale is 66... Kh1 67. Bf3#. The computer's only complaint is that when I played 53. Bb1+ -- mating 13 moves later -- I could've gotten there 3 moves faster by playing Kd5. A win is a win, and that's how you do it with two bishops in the endgame!"
    },
    "url": "https://gameknot.com/annotation.pl/the-two-bishop-endgame?gm=51787",
    "gameName": "The Two Bishop Endgame",
    "players": "ethansiegel (1827) vs. nicolso (1793)",
    "opening": "Sicilian (B43), Kan, 5.Nc3"
}