{
    "moves": {
        "1. d4": "Another open challenge, this is one example of how important a bishop on a nice diagonal can be.",
        "1... d5 2. c4": "Queen's gambit, one of my preferred openings as white",
        "2... dxc4": "Accepted, in my games playing this I haven't seen it accepted that often.",
        "3. Nf3 c6": "I'm not keen on this response from black though I think it's still within book, I don't like that it restricts the knight",
        "4. e3": "This is a bit more passive than my usual Nc3 or e4 but I don't think its bad",
        "4... b5 5. Nc3 e6": "Again I am not keen on this move as it renders blacks lsb pretty useless.",
        "6. b3": "This move took us out of the Gameknot database. I wanted to break up the black pawn structure a little and give my dsb access to b2 and a3 as black was now going to have to castle king side.",
        "6... Bb4": "This move from black pretty much forces me to make a move I wanted to make anyway i.e. Bb2",
        "7. Bb2": "This bishop stays on this lovely diagonal for the rest of the game. Note that although the diagonal is blocked by a couple of pawns, there are no black pawns to stop my pawn on d4 advancing and opening the diagonal further. This proves significant later in the game as we will see.",
        "7... Nf6 8. bxc4": "regains the gambitted pawn and gives my lsb a little more room to maneouvre",
        "8... a6 9. Qb3": "As well as shifting the bishop, my queen now has an eye on the a2-g1 diagonal",
        "9... Qe7": "Doesn't really defend the bishop as I have the option of c5, though I am not going to take that option. I'd like to keep my pawn on c4 but won't complain if bxc4 as then Bxc4 leaves my queen and bishop lined up with where I am expecting the black king to soon be i.e. on g8 after castling",
        "10. a3 Ba5 11. Bd3": "Preparing to castle but also commanding the diagonal b1-h7, again attacking the area around where the black king will be after he castles.",
        "11... Nbd7 12. O-O O-O": "All according to plan. note that the black dsb is now out of place and doesn't really have any good options. In addition the black lsb can only move to b7",
        "13. Ng5": "This was to encourage black to create weaknesses in his pawns around his king",
        "13... h6": "and he obliges. ",
        "14. Nge4 Bb7 15. Nxf6+ Qxf6": "I think I would have taken with the knight here, however I think black is planning c5, opening the diagonal for his lsb",
        "16. cxb5": "However I now have a plan to attack the black queen with my dsb as we will see.",
        "16... cxb5 17. d5 exd5": "I think this is a poor move from black, to me Bxd5 looks much stronger. With that pawn where it is blacks lsb is obstructed",
        "18. Nxb5": "Threatening the queen. I didn't want to take the d5 pawn as then I would have made life easier for black. ",
        "18... Qb6 19. Nd4 Qc7": "Declines the exchange, later on this may prove blacks undoing.",
        "20. Rac1": "grabbing the open c file",
        "20... Qb8 21. Nf5 Nf6 22. Qa4": "Moving the queen to the nice open 4th rank. As both my bishops and my knight are threatening the area around the black king I can easily bring my queen into the action too.",
        "22... Qd8": "I was expecting something like Bb7 here leading to an exchange of bishops. I think black was rightly worried about Bxf6",
        "23. Qh4": "I was very pleased with this move, blacks options are limited and I am threatening Nxg7 with some nice threats to follow",
        "23... Ne4": "Possibly the best response though my dsb still has control over the a1 - h8 diagonal",
        "24. Nxh6+ gxh6 25. Qxh6 Qg5": "An unfortunate oversight from black. I was expecting f6",
        "26. Qh8#": "Thanks for reading please comment"
    },
    "url": "https://gameknot.com/annotation.pl/the-power-of-the-diagonals?gm=39863",
    "gameName": "The power of the diagonals",
    "players": "elwoos (1527) vs. tweekit250es (1499)",
    "opening": "QGA (D21), 3.Nf3"
}