{
    "moves": {
        "1. e4": "I had many names for this game.  The Double Queened Pawn endgame, Why never to offer a Draw, Good endgame, the importance of planning in the end game.....\r\n\r\nNormal openings etc, I accept there might have been mistakes but the important part starts at move 36.  Josh Waitzkin is an avid believer not to always trust what a stronger player sees when he offers a draw.  In this case I offered the draw to a stronger player and he rejected it.  The draw would cost him 0.1Points - the loss cost him 10.1!!!! ",
        "1... e5 2. f4 Nc6 3. Nf3 f5 4. Nc3 fxe4 5. Nxe4 d5 6. Nf2 e4 7. Ne5 Nf6 8. Bb5 Bd7 9. d4 exd3 e.p. 10. Nfxd3 Nxe5 11. fxe5 Bxb5 12. exf6 Qxf6 13. Rf1 Qh4+ 14. g3 Qe7+ 15. Qe2 O-O-O 16. Bf4 Qe4 17. Be3 Bb4+ 18. Kd1 Rde8 19. Rf4 Qxe3 20. Qxe3 Rxe3 21. Nxb4 c6 22. Rf2 Rhe8 23. Kd2 a5 24. Nd3 Bxd3 25. cxd3 Re8e7 26. Raf1 Kd7 27. Kc3 b5 28. b4 a4 29. a3 Re3e2 30. h4 Rxf2 31. Rxf2 h5 32. Kd4 Kd6 33. Rf5 g6 34. Rf6+ Re6 35. Rxe6+ Kxe6": "Here I offered the draw to my opponent, even being a pawn up I though this would end in a draw, I possibly did not calculate far enough or missed something. At best I could only see him getting out with a draw - I saw my oponent could play \r\n\r\n36. Kc5 Kd7 \r\n37. Kb6 Kd6 \r\n38. d4 (waisting a move, defending c5 and forcing my king away) Kd7 \r\n39. Kc5 Kc7 - Which would be stalemate or Kb7 which he played followed by Kd6 \r\n40 Kb6 and it would end in 3 fold draw as c5 Quickly loses the game.",
        "36. Kc5": "My oponent rejected the offer and proceeded as planned - but I was worried what I had missed...... Ke3 Kd6 d4 might have been better for white?",
        "36... Kd7": "Planned",
        "37. Kb6": "Planned",
        "37... Kd6": "Planned",
        "38. d4": "Planned",
        "38... Kd7": "Planned",
        "39. Kb7": "Planned",
        "39... Kd6": "Planned",
        "40. Kc8": "????? This was the losing move - he had the draw!!  Suddenly with his king on c8, there is not enough defence on c5, so like the GPS system says - RE-Calculating!!!!  I saw he handed me the win on a platter even though he possibly thought he would run over and queen on the g or h file.",
        "40... c5": "So I pushed the pawn to open the way",
        "41. bxc5+": "Still under control as he forces me to block his king away from the action",
        "41... Kc6": "No way back into the action",
        "42. Kd8": "He only has Kd8 or Kb8 -With G4 I could choose to take or let him take",
        "42... b4": "Opening the way",
        "43. axb4": "He takes and opens the runway for the A pawn",
        "43... a3": "Pushing to get the Queen - I saw the next moves and new It was all winning for me",
        "44. b5+": "Expected",
        "44... Kxb5": "planned",
        "45. Kd7": "His way back in, but it is to late",
        "45... a2": "Pushing",
        "46. c6": "expected",
        "46... a1=Q": "No he has trouble",
        "47. c7": "now i have trouble",
        "47... Qa7": "saw this comming",
        "48. Kd8": "planned",
        "48... Qa8+": "planned",
        "49. c8=Q": "planned - to simplify the game when calculating ",
        "49... Qxc8+": "planned",
        "50. Kxc8": "Now we are at the start again equel pawns - I am closer to the action though as he has to run George over to g6 - he cant stop the d pawn falling",
        "50... Kc4": "Planned",
        "51. Kd7": "Planned",
        "51... Kxd4": "Planned",
        "52. Ke6": "Planned - Ke7 would be a mistake here as it would leave Ke 5 ",
        "52... Ke4": "Planned",
        "53. Kf6": "Planned",
        "53... d4": "Planned - here I could also play 53. Kf3 Kxg6 54. Kxg3 Kxh5 then push the pawn and he has to waiste Kg5 for instance to open the way -  I chose not to waiste the time as he had to take both pawns before moving",
        "54. Kxg6": "Planned",
        "54... d3": "Planned",
        "55. Kxh5": "Planned",
        "55... d2": "Planned",
        "56. g4": "Possibly blocking the resulting check from the Queening move - this could also work with Kg5",
        "56... d1=Q": "Planned and here I knew it was mine to through away - it is hard to queen 2 pawns with constant checks, I knew there would be a way to get his king away from the pawns and I had 4 ranks to do so",
        "57. Kg5": "Only move - but if 56. Kg5 then he could now play either g4 or h5",
        "57... Qf3": "Preparing for the end - I knew he would not leave the pawn and had only Kh5 or h5\r\n\r\nKh5 would lead to Qf7+ and would also drive the king away from the pawns eventually",
        "58. h5": "Planned",
        "58... Qf4+": "He will still not leave the pawn",
        "59. Kh4": "Planned",
        "59... Qf6+": "Planned - here he had Kg3 or g5 - 60. g5 Qf4 loses both pawns when the king vacates the 4th rank",
        "60. Kg3": "the end is near",
        "60... Qg5": "Here my oponent resigned - He only had h3 to defend the pawn - the end would be\r\n61. Kh3 Kf4 \r\n62. Kh2/g2 Qxg4 \r\nand it is all lost.\r\n\r\nJust goes to show even when there is no way out but the draw your opponent can always still give you the game!!!",
        "61. Kh3 Kf4 62. Kh2 Qxg4": ""
    },
    "url": "https://gameknot.com/annotation.pl/the-draw-that-was-a-win-no-more-draw-offers?gm=45362",
    "gameName": "The Draw that was a WIN!!  No more draw offers!!!",
    "players": "??????AJ (1500) vs. nieh (1493)",
    "opening": "King's gambit (C30)"
}