{
    "moves": {
        "1. c4": "I chose to annotate this game because I think it is a good example of how a few passive moves by a player can lead to a positional advantage for his opponent.",
        "1... c5": "I always choose the symmetrical variation of the English as I know it well and the Botvinnik setup is not as effective.",
        "2. Nc3": "As usual, my annotations are for players who have more than a basic understanding of the game. If you dont understand the basic opening moves that I leave unannotated, there are several good books out there.",
        "2... Nc6 3. Nf3": "If White were to continue to maintain flexibility with his king's knight, by playing 3.g3, then I would continue the symmetrical motif.  Here I decide to play a \"Botvinnik\" setup myself, although it's technically called the Wedberg variation when black adopts it, after Swedish GM Tomas Wedberg.",
        "3... e5 4. g3": "4. e3 and 4. d3 are all main lines also.",
        "4... g6 5. Bg2 Bg7 6. O-O Nge7": "The plan is to castle and play ...f5 or ...d5 at some point, depending on which setup White adopts.",
        "7. Rb1": "Play typically continues with 7. d3, although we do transpose back to the main variation.  Here White wants to play a3 followed by b4, to break apart the bind on the d4 square.",
        "7... d6 8. a3 a5": "Sensibly preventing b4.",
        "9. d3 O-O 10. Bd2": "Not the most critical variation.  Other moves are Bg5 and Ne1.",
        "10... Rb8 11. Re1": "This is what we in the chess world call 'weak sauce'.  There are four alternatives that are critical in the position, the most interesting in my opinion is 11. Qa4 Be6; 12. Ng5 Bd7; 13. Nge4 Nd4; 14. Qd1 Bc6; 15. b4.",
        "11... h6": "Preparing to play ...Be6 without having to worry about Ng5.",
        "12. Qc1": "Here I had anticipated 12. e4, when Black has the ...f5 break and the initiative.  I would say it's probably dynamically equal or very slightly better for Black.  At any rate Black has won the opening battle and achieved easy equality.",
        "12... Kh7 13. Qc2": "13.  e3 is interesting here, although, black has no problems after 13...Bf5.",
        "13... Be6": "I considered 13...Bg4, but decided that I was going to play ...f5 and wanted to keep the Bishop behind the pawns, rather than swap it for the knight of f3.",
        "14. Rbd1": "I am kind of confused at this move, maybe White was thinking he was going to play e3 and d4.  Its possible to reroute the dark-squared bishop to b2 via c1 after b3 also.  White's play is slow and I decide to begin a kingside attack.",
        "14... f5": "Not possible is ...d5, when 15. cd Nxd5; 16. Nxd5 Bxd5; 17. Qxc5 just drops a pawn for no compensation.",
        "15. Nb5": "Better is 15. e3.",
        "15... f4": "Now 16. e3 gives Black a huge initiative after 16...fg; 17. fg Bg4; 18. Rf1 e4!?; 19. de Ne5.",
        "16. e4": "The center is now closed and the White rooks are both made poor.  White's position lacks any dynamic aspect and he will have to sit while I crank up the pressure on the position.  Admitting the positional mistakes with 16. Rf1 seems to be better.  White can at least hold for the time being.",
        "16... Qd7": "finishing development and linking the rooks.  I also had the idea of bringing a rook to the d-file as to relieve my queen of the defense of the d-pawn.",
        "17. Bc3": "Get's out of the way of the rooks, but White has no pawn breaks in the position.  In this type of position, if you don't have any breaks, you dont have any play!",
        "17... g5": "With the situation in the center and the Queen's wing under control, I start to use my intiative on the kingside.",
        "18. Nd2": "Gets out of the way of the ...g4 push and prepares to play f3 to mitigate the Black pawn storm.",
        "18... g4": "Pressing on!",
        "19. Qa4": "f3 or gf is better.  This allows Black to completely seal the White position.",
        "19... f3 20. Bh1": "Bf1 is to be preferred, although it really doesnt matter at this point.",
        "20... h5": "The plan now is to break through on the h-file.",
        "21. Nf1": "Routing the knight to e3 will give it some much needed activity.  White's pieces are basically dying.",
        "21... b6": "Keeping everything solid, although the a-pawn was untouchable as after Bxa5, ...Ra8 wins.",
        "22. Ne3 Bh6": "not so much threatening to trade minor pieces, but to control the f4-square as I had ...h4 planned.",
        "23. Qc2 Nd4 24. Bxd4 cxd4 25. Nf1": "25. Nd5 is better, although after ...Nxd5, White still cant get anything going.",
        "25... Rbc8": "Threatening to win a piece with ...Qxb5.",
        "26. a4 h4": "Commencing the attack.",
        "27. gxh4": "Clearing g3 for the knight, but also clearing ...f4, which is much more useful...to me.",
        "27... Ng6 28. h5 Nf4 29. Ng3 Bg5": "Now begins a repositioning of forces which will mop up the h-pawn and threaten to break through on the h-file.",
        "30. b3 Kh6 31. Qa2 Rcd8": "The idea behind 16th move comes to fruition.  The queen will go to ...f7 and after ...Nxh5, the h-file invasion will be decisive.",
        "32. Qc2 Qf7 33. Qb2": "Planning to play Qa3 to tap the d6-pawn.",
        "33... Rfh8": "Getting ready to infiltrate.",
        "34. Qa3 Qd7": "simply defending.",
        "35. Qb2 Nxh5 36. Nxh5 Kxh5": "after the coming ....Kg6 White is mated.  A sample variation could run: 37. Ra1 Kg6; 38. Rb1 Qh7, and no matter what White does, his king cant get off the first rank in time due to my control over e2 and d2!!!"
    },
    "url": "https://gameknot.com/annotation.pl/the-art-of-the-closed-position?gm=20371",
    "gameName": "The Art of the Closed Position",
    "players": "sykonot (1873) vs. mybookrunsdeep (2001)",
    "opening": "English (A35), symmetrical, four knights system"
}