{
    "moves": {
        "1. e4": "King's pawn opening, With 1.e4 white occupy the center, opens lines for the bishop and the queen and challenges directly d4. this moves has been for centuries the most popular and the Fisher's favorite move.  ",
        "1... e5": "black responds symmetrically for 1.e4 with e5, this keeps options opens for both sides.",
        "2. Nf3": "With this natural move 2.Nf3 white threatens the e5 pawn and clears the way for castling.",
        "2... Nc6": "Black protect his e5 pawn and creates a direct threat to d4. This defends the centre and plays to reach an equal position.",
        "3. Bb5": "The start of the Ruy lopez, the Spanish game, By 3.Bb5 white puts the pressure on the knight and creates a potential threat to win the e5 pawn by Bxc6 followed with Nxe5. But it is not yet time to win the e-pawn. If he plays Bxc6 dxc6 Nxe5 Black will win the pawn back with a Queen Fork: Qd4 with a good position.\r\n\r\nIt is designed to maintain long-term pressure on Black's center. If driven away, the King's Bishop will take up a position at b3 or c2 to focus on a Kingside attack or on the central squares.\r\n\r\nWe can regroup the ruy lopez in two major lines:\r\n\r\nA-defensive systems without the move 3...a6.\r\n1-Cordel defense 3...Bc5.\r\n2-Bird defense 3...Nd4.\r\n3-Jannisch gambit 3...f5.\r\n4-Berlin defense 3...Nf6.\r\n5-Steinitz defense 3...d6.\r\n6-rare schemes: other responds to Bc5 except 3...a6\r\n\r\n \r\nB-defensive systems with 3...a6 \r\n1-Exchange variation 4.Bxc6\r\n2-Moeller system 4.Ba4 Bc5\r\n3-The improved steinitz defense 4.Ba4 d6\r\n4-Open variation 4.Ba4 Nf6 5.0-0 Nxe4\r\n5-Chigorin system 4.Ba4 Nf6 5.0-0 Be7 6.Re1 b5 7.Bb3 d6\r\n6-Marshall counter attack 4.Ba4 Nf6 5.0-0 Be7 6.Re1 b5 7.Bb3 0-0 8.c3 d5 9.exd5\r\n7-Variation with 4.Ba4 f5",
        "3... a6": "to be able to break the potential pin whenever Black chooses.",
        "4. Ba4": "White makes no sense to 3.Bb5 if he moves other than Ba4 or Bxc6.\r\nWhite chooses to stay on the diagonal, White can take by the bishop! and enter the exchange variation of the ruy lopez, but delays the capture of the e5 pawn.\r\nIf white tries to capture the e5 pawn with 4.Bxc6 then follows 4...dxc6 5.Nxe5 Qd4!! White forks the knight and takes the pawn with check it leads to the loss of the favor of castling for white and a good attack chances for black. with the variation 5...Qd4!! 6.Nc3 Qxe4  7.Qe2 Qxe2  8.Kxe2 .",
        "4... d6": "Black with this move is consolidating his e5 pawn for a potential Bxc6 and Nxe5, this maneuver is called \"the improved steinitz defense\"",
        "5. O-O": "White castles and his rook is ready to occupy e1 and support his pawn on e4.",
        "5... Bd7": "Breaking the pin, the knight can take some breath.",
        "6. d4": "When your king is safe you can open lines and take the initiative for the attack.",
        "6... b5": "These pawns are pushed and white will make from them targets later in the game, black prepares them for a queenside attack",
        "7. Bb3": "A well posted bishop targeting the weak point f7.",
        "7... exd4 8. c3": "With 8.c3 white tries to sacrifice a pawn for development if 8...dxc3 then 9.Nxc3 and white is ready to attack with full development, note we ca say that the bishop is already developed at its original square!!\r\nif any move other then d3! then white will take on d4 and will have a perfect center, for example 8...Nf6 9.Bg5 Be7 10.Cxd4! ",
        "8... d3": "d3! is the best move here it leaves c3, the knight post, occupied by a pawn, and white will have some difficulties to develop the Knight",
        "9. Qxd3 Nf6 10. Bg5": "Pinning the knight, a natural move,",
        "10... Be7": "Breaking the pin! why not g6 and fianchettoing the bishop? for: \r\n1) g6 is a waisting move\r\n2)there's no utility to develop the bishop in fianchetto, at least now: the pin is not broke!!\r\n3)the variation after 10...g6 11.Re1 Bg7 12.e5!! Nxe5 13.Nxe5 dxe5 14.Rxe5  gives white a huge initiative for the attack\r\n",
        "11. Nbd2": "White has compleated his development! and will start an eventual attack on the e file for example Re1 and e5. with e5 white clears the way for queen and bishop battery pointing h7. ",
        "11... O-O 12. h3": "Restricting Black's bishop options! and we running out of the opening phase, now we can say its the middle game, Both sides has full development and ready to attack, withe is slightly better with his two bishops on open diagonals, and the queen occupying a semi open d file, the a rook is coming to support her Majesty, and with an eventual Bxf6 followed by Bc2, e5, black will find his self in a difficult position!!",
        "12... Be6 13. Bf4": "The fight for the e5 point has begun, and whiteh will immobilise all his forces for this, ",
        "13... Nd7": "13...Qc8 was slightly better targeting h3 with the knight on f6 black have good chances for a king side attack!\r\nso, \r\n1) 14.a4 is replied by 14...Nc5 and white must retreat his queen to c2, a4 is not a good move. think of Nc5\r\n2) 14.Rae1 is not bad, but as i said for \"Qd7\" it restrict White's pieces to move and in this case the rook on f1, so 14.Rfe1 is better and its a good move we highlight it!!\r\nbut if 14.Rfe1 Nde5 15.Qe3 or Qe2... also bad for white, white moves his queen and black gain a tempi!!\r\n3) 14.e5 loses a pawn for 14...Ndxe5 and if 15.Nxe5 dxe5 white loses a bishop or a knight. the push e5 is not yet prepared!\r\nwith all that what do you think for whites moves 14.Bd5 or 14.Nd4 or 14.Qe3.?\r\n\r\n",
        "14. Nd4 Nc5": "Nd4 attacks white's queen, the queen must move to b1, c2, e2, e3, f3, g3?\r\nWe can eliminate the following classed as non significant moves, Qb1 \r\nAnd Qc2, Qe2, Qf3 restricts whites options to move its pieces\r\nWe find finally two best moves for the queen, so Qe3 or Qg3, choose one?",
        "15. Qg3": "Qg3 targets g7 for a possible Bh7, the move Ne5 is not possible for it loses a pawn, don't forgot a black knight is thretned!! so 15...Bh4 is a loosing move it gains no tempo!",
        "15... Nxd4": "For a doubled pawn on the Q-side white will have a full center",
        "16. cxd4 Nxb3 17. axb3": "Why white don't take with the knight?\r\n1-When you're better don't exchange material, for Nxb3 black answer Bxb3 and always there's doubled pawn! \r\n2-The knight is needed to influence the e5 square via f3! and maybe go to d4!\r\n3-its somewhat a closed position, Knights are better than bishops\r\n4-It opens an a-file for the rook the black a-rook is tied down to protect the a pawn\r\n5-this controls c4! a beautiful case for the bishop if the knight goes to f3!",
        "17... f6": "f6! a weak move, \"the dead bishop move\" f5 was clearly better it puts a question mark on the situation on e5 before the knight come, and white must decide push or exchange!",
        "18. d5": "white closes the diagonal for the bishop, and evacuates a case for an eventual knight coming to d4!",
        "18... Bf7": "Bf7 do many things: protect the castle from the eventual Bh6! and stay on a good diagonal b1-h7 and it reenforces the king protection!",
        "19. Qd3": "the knight must go to f3 so the queen may move to another square cause its mobility will be restricted on g3 with a knight on f3! \r\nQueen on d3 is great: protects e4 from Bg6 if the knight go to f3, stays on a central file, dont obstruct any white piece from moving!",
        "19... Bg6 20. Nf3": "Natural, to control e5, and transit  for d4 outpost."
    },
    "url": "https://gameknot.com/annotation.pl/the-why?gm=17792",
    "gameName": "The why",
    "players": "askaltaman (2069) vs. _antares_ (1971)",
    "opening": "Ruy Lopez (C72), modern Steinitz defence, 5.O-O"
}