{
    "moves": {
        "1. e4": "This great classic game was played in Paris in 1858 after Morphy traveled to play a match against Harrwitz which he won ( +5 -2 =1) after Harrwitz retired. Later he defeated Anderssen (+5 -1 =1) winning the last five games in a row! Regular type annotations are Kasparov's while parenthetical annotations are the author's humble contributions :) ",
        "1... e5 2. Nf3 d6": "(Passive, but thought to be solid at the time. Black must play accurately however)",
        "3. d4 Bg4": "Nowadays every schoolboy knows that this is bad, but those days it was even played by Harrwitz!",
        "4. dxe5 Bxf3 5. Qxf3 dxe5 6. Bc4 Nf6": "? The decisive mistake. True, Black had an unpleasant choice between 6...Qf6 7. Qb3 Bc5 (the spectacular variation 7...b6?! 8. Nc3 Ne7? 9. Nb5 Na6 10. Qa4 Nc5 11. Nd6+! Kd8 12. Qe8# was pointed out long ago in Greco's treatise!) 8. 0-0 Bb6 9. a4 a5 10. Nc3 Ne7 11. Be3 Nd7 12. Rad1 and 6... Qd7 7. Qb3 followed by Nc3, O-O, and Rd1 - in both cases White has an obvious advantage.",
        "7. Qb3": "A classic double attack",
        "7... Qe7": "In a game played a month earlier Morphy-Harrwitz; Paris 8th matchgame 1858; Black preferred to suffer a pawn down after 7... Bd6 (7...Qd7? 8. Qb7) 8. Bf7+ and he resigned on the 59th move.",
        "8. Nc3": "!? For the sake of rapid development Morphy avoids the exchange of queens, although after 8. Bf7+! (Qb7 Qb4+ 9. Qb4 Bb4+ 10. Bd2 is rather a \"small\" achievement) 8...Kd8 (or 8...Qf7 9. Qb7) 9. Qb7 Qb4+ 10. Qb4 Bb4+ 11. c3 Black can resign",
        "8... c6 9. Bg5": "(White sets up the first of many deadly pins)",
        "9... b5": "? An attempt to solve all the problems in one go. 'Black would hardly have saved the game by 9...Na6 10. Ba6 ba6 11. Qc4 or 9...h6 10. Bf6 gf6 11. O-O-O, while 9...Qc7 10. O-O-O Bc5 would have been refuted by the simple 11. Bf7+! Qf7 12. Rd8+' (Neishtadt)",
        "10. Nxb5": "but not 10. Be2? Qb4!",
        "10... cxb5 11. Bxb5+ Nbd7": "(And black is forced into another pin...)",
        "12. O-O-O Rd8": "If 12...Qb4?, then 13. Bf6",
        "13. Rxd7": "'White lands successive blows, and each time with gain of tempo' (Euwe) 'Morphy is in his element. The brilliant combination with sacrifices makes this game one of the most beautiful achievements in the entire history of chess' (Maroczy)",
        "13... Rxd7 14. Rd1 Qe6": "14...Qb4? 15. Bf6\n(Too late to step out of the pin)",
        "15. Bxd7+": "15. Bf6 was a drier alternative",
        "15... Nxd7 16. Qb8+": "!!",
        "16... Nxb8 17. Rd8#": "'A sparkling finish!!' (Euwe)"
    },
    "url": "https://gameknot.com/annotation.pl/the-opera-game?gm=30678",
    "gameName": "The Opera Game",
    "players": "P. Morphy  vs. Duke of Brunswick & Count Isouard ",
    "opening": "Philidor's defence (C41)"
}