{
    "moves": {
        "1. e4": "Hi everyone,\r\n\r\nI decided to play the white side of this gambit against Master Freddy.  I lost a game with the black pieces against this opening so I decided to see how I would get on as white.  Freddy showed me how the gambit could be refuted.  First we play the Four Knights Opening so the action starts on Move 4.",
        "1... e5 2. Nf3 Nc6 3. Nc3 Nf6 4. Nxe5": "4. Nxe5 - here it is!",
        "4... Nxe5 5. d4": "5. d4 - this is meant to open up Fou Lenoir's diagonal and force a retreat of his e5 horsie and really cramp his style!",
        "5... Ng6 6. e5 Ng8": "6. ...... Ng8 - a necessary retreat.",
        "7. Bc4 d5": "7........ d5!! - this move is the refutation of this gambit.  Give back a pawn for the piece and blunt my attack.",
        "8. Bxd5 c6 9. Bb3 Be6 10. Bxe6 fxe6": "10. ..... fxe6 - I orchestrated this bishop trade in order to leave Freddy with an isolani and endeavour to get 3 pawns for the missing piece.",
        "11. Qg4 Qd7 12. h4 c5": "12. ..... c5 - this move departs from the database.  I decide on defense by development by moving Fou Lenoir to e3.",
        "13. Be3 cxd4 14. Bxd4": "14. Bxd4 - pawn trade.",
        "14... Nh6 15. Qe4": "15. Qe4 - Glenda must flee on her Nimbus 2000 to avoid the black horsie.  She flies to e4 to defend Fou Lenoir and the pawn on e5 (that poor gal, she always somehow finds herself defending something!)",
        "15... Nf5": "15. ...... Nf5 - and here comes another of Freddy's horsies, the're everywhere!  I now castle long to add protection to Fou Lenoir and to perhaps discover an attack on that evil Witch!",
        "16. O-O-O Qc6 17. h5": "17. h5 - I now try a pawn run down the h column but that is as far as this footman gets.  Now Freddy initiates a queen trade.",
        "17... Qxe4 18. Nxe4 Nf4": "18. ..... Nf4 - a nasty attack on my g2 pawn.  Also a knight fork is threatened on e2.",
        "19. Bc5": "19. Bc5 .... I play for complications .......",
        "19... Bxc5 20. Nxc5 b6 21. g3 Ne2+ 22. Kd2 Nexg3 23. fxg3 bxc5": "23 ...... bxc5 - ...... but they just do not come off ..... and Freddy widens the deficit to 2 material points.",
        "24. g4 O-O-O+ 25. Kc1": "25. Kc1 - Henry retreats to safety.",
        "25... Nh6 26. Rhf1": "26. Rhf1 - striving for a counter-attack .....",
        "26... Rxd1+ 27. Kxd1 Rd8+ 28. Kc1 Nxg4 29. Rg1": "29. Rg1 - .... but it does not get off the ground.  After playing this move I now see that if Nxe5, Rf7 then Freddy can play Rd7 stopping my rook from taking any pawns on his second rank.  After seeing nothing left in the tank I decide to give the game to Freddy.  At least this proves the unsoundness of the Halloween Gambit."
    },
    "url": "https://gameknot.com/annotation.pl/the-halloween-gambit?gm=26133",
    "gameName": "The Halloween Gambit",
    "players": "jstevens1 (1831) vs. easy19 (2273)",
    "opening": "Four knights (C46), Schultze-Mueller gambit"
}