{
    "moves": {
        "1. e4 c5": "I find this game interesting and  therefor I have decided to annotate it.\n",
        "2. c4 Nc6 3. Nc3 e6": "black start with a rather unusual moves and it looks like they are loosing the center",
        "4. Nf3 a6 5. d4 d6": "white now has three pawns on the 4 line and has a rather good prospective to attack in the center with a d5 move",
        "6. d5 Ne5 7. Nxe5 dxe5": "black tries to get a good position for his knight but is stopped",
        "8. Qh5": "white makes a very aggressive move that in this case is a mistake because the queen has little support and the pawn on e5 can be easily defended.",
        "8... Bd6": "and the pawn is defended",
        "9. Bd3": "Bg5 would have continued the attack",
        "9... g6": "black want to force the queen away and to have a prospective to launch a pawn attack at the wing",
        "10. Qf3 f5": "black prepare to launch the attack with the pawns if the white king castles on his side",
        "11. O-O": "the white makes the  mistake which the black are waiting for and castles his king on the side which is under the pressure of the black pawns",
        "11... f4 12. b3 Qe7 13. a4": "white pawns are moving at the other wing wanting to attack first",
        "13... Nf6": "black are securing the important square at g4",
        "14. Ba3 b6 15. Bb2": "white are making pointless moves with the bishop and are giving time to the black",
        "15... Bb7 16. a5 g5 17. Qe2": "black continue their attack with the pawns forcing the  white queen to move",
        "17... h5 18. f3": "white try to add more pressure on g4",
        "18... g4 19. fxg4": "white are forced to attack",
        "19... hxg4 20. axb6": "white are trying to launch an attack on their own on the other wing",
        "20... O-O-O 21. dxe6": "white decide to free space for a Nd5 move and to free the white bishop ",
        "21... Rh4": "black are securing g4 and adding the rook to the attack. I  think that Qxe6 would be better ",
        "22. Nd5 Qxe6 23. Nxf6": "white decide to attack and are hoping to draw attention from the attack in the wing",
        "23... f3 24. gxf3 Qxf6": "the pressure on the white king is raising",
        "25. Bc3 Rg8": "the white face a disastrous gxf3+ 27 Kh1 fxe2 option\n",
        "26. Kh1": "the white see the trouble",
        "26... g3": "the situation becomes even more complicated",
        "27. Rfg1 Rxh2+": "it looks like the white are in a desperate situation but they are not. the black aren't realising that they are changing two rooks and a pawn for a queen",
        "28. Qxh2 gxh2 29. Rxg8+": "the queen and the two rooks are gone and the black king is check",
        "29... Bf8 30. Be2 Kd7 31. Kxh2": "and here is the pawn",
        "31... Qh4+ 32. Kg2": "the king finds a very good position",
        "32... Qf4 33. Rd1+ Ke7 34. Rd3 Bc6": " better decision here would be Qc1",
        "35. b4 Kf7 36. Rg4 Qf6 37. bxc5 Bxc5 38. Ba5 Bb7 39. Rd7+ Kf8": "white are trying to make a queen and they take a bishop too",
        "40. Rxb7 Qc6 41. Rb8+ Kf7 42. Rgg8 Qa4": "the black queen is forced to go away ",
        "43. Rbf8+ Bxf8": "but white makes a little mistake",
        "44. Rxf8+ Kxf8 45. b7 Qe8": "black decides not to take the bishop and let the white to make a queen",
        "46. Bc7 Qg6+ 47. Kf2 Qe8 48. b8=Q Qxb8 49. Bxb8": "and with this the game is decided"
    },
    "url": "https://gameknot.com/annotation.pl/the-interesting-story-of-the-queen-and-the-two-rooks?gm=25461",
    "gameName": "The interesting story of the queen and the two rooks",
    "players": "alexaand (1348) vs. thearrtofnoise (1504)",
    "opening": "Sicilian (B20), Gloria variation"
}