{
    "moves": {
        "1. d4": "Here's a short sharp lesson from Freddy!  I adopt my usual policy of avoiding 1. e4 against stronger opponents...",
        "1... Nc6": "Freddy did tell me what opening this was but I was none the wiser...",
        "2. Nf3": "so I decide to play \"sensible\" opening moves, first developing the KN and opposing Black's N",
        "2... d6 3. h3": "to deter the B from coming to g4",
        "3... Nf6": "Black calmly develops his KN",
        "4. Bg5": "provoking me to play the move I'd prevented him from playing.  This is like the Torre Attack",
        "4... Ne4": "and this is a common response to the Trompowski, which I'm used to encountering as Black, so I felt I was on slightly more familiar ground now, though I don't play the Tromp myself.",
        "5. Nbd2": "One of my favourite chess writers, Yelena Dembo, advises never to retreat!  Somewhat extreme but there is sense in there if you like an attacking style.  Rather than retreat or bolster up my B more, I develop another piece, while leaving my c-pawn freedom to move.",
        "5... Nxg5": "Freddy whips off my B, giving himself the only B pair on the board.",
        "6. Nxg5": "Naturally I recapture but this N is somewhat exposed and unsupported",
        "6... e5": "so Black counter-attacks in the centre.  The pawn can't be defended effectively with a pawn or N, so I counter-attack Black's N",
        "7. d5": "and Black seizes the opportunity to win the pawn, tying up my K-side at the same time",
        "7... Qxg5 8. dxc6 bxc6 9. Nf3 Qf6 10. e4": "I need to resume my development but I didn't have to play this pawn two squares.  I could have allowed him to push my N around with 10...e4 but I didn't fancy that much.",
        "10... Be7 11. Be2": "Perhaps 11. Bc4 would have restrained Black's pawn centre",
        "11... O-O": "Black gets castling in first, so his opening play has gained him at least one tempo",
        "12. Qd2": "Not fancying running into a brutal kingside attack via ...Qg6 and ... Bxh3, I contemplate castling queenside, though this looks no better with Black having that open file to b2",
        "12... Rb8 13. Qc3": "For the time being, I can defend the b-pawn, and pretend to threaten the doubled pawns",
        "13... c5 14. Bc4": "belatedly trying to control the a2-g8 diagonal and potentially block Black's attack on b2",
        "14... Qg6": "but now Black attacks g2 and castling kingside looks too risky.  On the other hand, if I connect my rooks and he takes on g2 I can chase the Q and draw a bead on his castled king's position.  There's a terrible problem with my next move though.  I really should have studied the position more carefully. ",
        "15. O-O-O": "??",
        "15... Qxe4": "Oh dear.  Freddy snaps up this central pawn immediately.  I'm two pawns down with nothing to show for it.  The Big Bad Wolf has just had to let me make mistakes.",
        "16. Rhe1 Qf4+ 17. Kb1 Bf6": "Now b2 is the target in earnest.  My Q cannot defend from c3.  18. Qd2 might defend, followed by c3, but the B would be hanging.  Perhaps I should attack the Q with 18. g3.  After the Q moves I can play 19. Qd2",
        "18. Bb3": "? missing the immediate threat while concentrating on the longer term threat.",
        "18... e4": "! Horrible double attack",
        "19. Qe3": "as good as resigning really",
        "19... Qxe3 20. Rxe3 exf3": "A whole piece and two pawns down, there's no point carrying on.  Perhaps, rather than criticise others' efforts, I should concentrate on removing errors from my own game."
    },
    "url": "https://gameknot.com/annotation.pl/the-big-bad-wolf?gm=21311",
    "gameName": "The big bad Wolf",
    "players": "rjacobs (1517) vs. easy19 (2244)",
    "opening": "Queen's pawn (A40), Lundin (Kevitz-Mikenas) defence"
}