{
    "moves": {
        "1. d4": "Hi everyone!\r\n\r\nHere is Round 2 of the Dentist against Master Freddy.  The Dentist does better this time, although he does create a few too many cavities with too many pawn moves and later on, Freddy ensures he has a major dose of both heartache and toothache!   He starts off with a QP opening with 1.d4.  Before I go any further, here is the Gameknot Analysis version for you to refer to as you run through the moves. http://gameknot.com/analyze-board.pl?bd=14069274&rnd=0.039215609280492836",
        "1... c5": "1. ...... c5 - Freddy just lurves trying out gambits!",
        "2. d5": "2. d5 - The Dentist declines the proferred c pawn and tries to use his d pawn to inhibit Freddy's pawns.",
        "2... g6 3. c3 Nf6": "3. ..... Nf6 - after a bit of pawn play Freddy brings a knight out to put pressure on d5.",
        "4. f3": "4. f3 - another pawn move, to prepare e4 perhaps?",
        "4... Bg7 5. g4": "5. g4 - perhaps not.  Maybe a little pawn storm is in store for Master Freddy should he castle kingside.",
        "5... d6 6. e4": "6. e4 - now he plays e4 - I think he had better start developing his pieces though.",
        "6... h6 7. h4 Nbd7 8. a4 a6 9. Ra3": "9. Ra3 - a piece does develop but The Dentist violates opening principles and should be thinking about moving the minor pieces first though but I think he is trying to surprise and confuse Freddy though.",
        "9... Ne5 10. Bf4": "10. Bf4 - clap hands - finally a minor piece DOES emerge!",
        "10... h5 11. Bxe5 dxe5": "11. ...... dxe5 - B for N trade.",
        "12. g5": "12. g5 - the Dentist continues his Pawn Storm, trouble is Freddy refuses to oblige and keeps his king in the centre.",
        "12... Nd7 13. a5 b5 14. b4": "14. b4 - the Dentist just lurves to move those pawns!",
        "14... Qc7 15. Rh2": "15. Rh2 - and now his KR emerges!",
        "15... O-O": "15. ..... 0-0 - Freddy sure feels confident about castling into a pawn storm, he might do it against The Dentist but would he dare against The Kitten?",
        "16. Rd2 Qd6 17. Qb3": "17. Qb3 - now his queen moves but she could be asked to move again if Freddy plants a footman on c4.  Freddy has other ideas, however with a pawn push to f5.",
        "17... f5 18. c4 cxb4 19. Raa2 bxc4 20. Bxc4": "20. Bxc4 - and now, with the Dentist a pawn to the bad he finally develops his lsb!  Now just both his horsies remain at home.",
        "20... fxe4 21. fxe4": "21. fxe4 - pawn trade - this does open the f file however and there is a black rook on it.  Now, can Freddy make use of this.",
        "21... Nc5": "21. ..... Nc5! - setting a trap, which alas, The Dentist falls into in trying to restore material equality.  The pawn on b4 becomes highly toxic indeed.",
        "22. Qxb4 Nd3+": "22. ..... Nd3+!! - this move wins the WQ as it is a discovered attack.  The Dentist has nothing better than to capture the knight, but the loss of the WQ proves fatal to white.  Here I would have waved the white flag faced with such a deficit.  The dentist chooses to play on just a little longer.",
        "23. Bxd3 Qxb4 24. Ne2": "24. Ne2 - the king knight develops at last but it is too little too late.",
        "24... Bg4 25. Nec3": "25. Nec3 - I think the other knight ought to have gone to c3 rather than stayed at home.  I rather feel that this is all irrelevant now with Freddy's huge material advantage.",
        "25... Qd4": "25. ..... Qd4 - the BQ is looking to land on g1 and deal death to the WK.",
        "26. Ne2": "26. Ne2 - he sees the mate but now we have a removal of the guard by means of a B for N exchange.",
        "26... Bxe2 27. Bxe2 Qg1+": "27. ..... Qg1+ - The Dentist can only interpose his lsb on f1.  Next move, The Dentist will be Freddied by Qxf1#.  This was why I thought that 25. Nbc3 was better than Nec3.  However, as I stated in my previous note, it would have simply prolonged the agony.  The Dentist chose to wave the white flag here.  Although the Dentist made far too many pawn moves, it wasn't until Move 18 that he fell behind on material and he did not have a completely lost position until Move 22.  Compare that with his 11 move loss against Freddy in the previous game."
    },
    "url": "https://gameknot.com/annotation.pl/the-dentist-and-the-master-mater-game-2?gm=32539",
    "gameName": "The Dentist and the Master Mater - Game 2",
    "players": "The Dentist (1381) vs. easy19 (2205)",
    "opening": "Old Benoni (A43), Franco-Benoni defence"
}