{
    "moves": {
        "1. e4 c5 2. Nf3 Nc6 3. Bb5": "The Sicilian Rossolimo",
        "3... g6 4. c3": "Preparing to build a pawn center.  In my database 4.c3 ranks at number 3.  The most played move here is the flexible 4.O-O.  Next in line is 4.Bxc6, creating a pawn structure vs. bishop pair imbalance.",
        "4... Bg7 5. d4 cxd4 6. cxd4 Qb6": "Here White has the gambit line 7.Nc3 Nxd4 8.Nd5 and Black has to be tactically alert due to his exposed Queen.  However, I wasn't prepared to go into this, so I chose simple equality.",
        "7. Bxc6": "Giving up the minor exchange to relieve pressure on d4.",
        "7... bxc6": "Capturing toward the center with the positional threat of ...Ba6.",
        "8. O-O d6 9. h3": "I did not want to allow the ...Bg4 pin.  Also possible is 9.Qc2, since Black cannot grub the d-pawn with 9...Bxd4?? due to the Queen fork on c6.",
        "9... c5": "I didn't like this move.  I thought the further opening of the center favors White here, due to Black's uncastled King.  The position is equal after the simple 9...Nf6 10.Nc3 O-O.",
        "10. dxc5 Qxc5 11. Be3": "Developing with tempo!",
        "11... Qc6": "It is now clear that Black is targeting my b2 and e4 pawns.  Here I came up with the idea of sacrificing a pawn to secure a lead in development.  I figured if Black was that hungry to eat pawns, then I would make him pay for it.  Better is 11...Qb4, still targeting my center and queenside, but not allowing White's next move.",
        "12. Nc3": "This develops my Knight to its natural square and defends e4.  If Black wants to win my e4 pawn, then it will cost him that trophy Bishop on g7 and some more tempi in the process.",
        "12... Bxc3": "Wow!  He goes for it!  This is a strategic mistake to give up such a wonderful Bishop for the lowly c3 Knight.  Black was probably thinking he would trade his fianchettoed Bishop to break up my queenside AND win my e4 pawn, but...",
        "13. Rc1": "...the zwischenzug gives White the better end of the deal, as the QR now develops with a pin.",
        "13... Qxe4 14. Rxc3": "White is down a pawn, but has a huge lead in development.",
        "14... Nf6 15. Re1": "White has all of his pieces in the game and his King is safe.  Black has only 2 pieces developed, weak dark squares, an exposed Queen, and worst of all his King is caught in the center!  White is threatening 16.Bh6 winning material, if Black castles on the move.",
        "15... Qd5": "Black wants to trade Queens or take the a-pawn, but this only forces White to improve his position with gain of time.  Perhaps better would be to evacuate the Queen from the center with 15...Qb7.",
        "16. Rd3 Qxa2": "Deflecting the Queen to a2.  I guess winning two pawns is just too tempting in a tournament game!",
        "17. Bh6": "The key move to White's attacking strategy!  It should be noted that the immediate 17.Rxd6 can be answered by 17...O-O.  White can still use his development to attack the castled King, but the attack becomes more difficult.  The text keeps the Black King in the crosshairs of the heavy artillery.",
        "17... Be6": "Still struggling to defend the threats and get the rest of his pieces activated.  Now White has a simple way to break in.",
        "18. Bg7 Rg8 19. Bxf6 exf6 20. Rxd6 Kf8 21. Qd4": "An important centralization move, defending the b-pawn and attacking f6.  Black can try to scurry his King to defend f6 with 21...Kg7, but White has a winning combination: 22.R1xe6! fxe6 23.Rd7+ forcing mate.",
        "21... Qc4": "Desperately trying to trade Queens!",
        "22. Qxf6 Ke8": "Black self-destructs at this point, with practically nothing to do except resign.  I should note that Black is a young scholastic player, and most of the time kids do not give up until checkmate is staring them in the face.",
        "23. Rexe6+ fxe6 24. Rxe6+": "Here, on 24...Kd7, it's mate in four: 25.Qf7+ followed by 26.Qxg8+, 27.Qf7+, and 28.Re8#.",
        "24... Qxe6 25. Qxe6+ Kf8 26. Qf6+ Ke8 27. Ne5 Rf8 28. Qe6+ Kd8 29. Qd7#": "THE BASIC OPENING PRINCIPLES\r\n1) Control the center\r\n2) Develop your pieces\r\n3) Castle\r\n4) Aim your Rooks"
    },
    "url": "https://gameknot.com/annotation.pl/the-pawn-hunter?gm=346",
    "gameName": "The Pawn Hunter",
    "players": "Michael Hosford (1784) vs. Michael Wang (1615)",
    "opening": "Sicilian (B31), Nimzovich-Rossolimo attack (with ...g6, without ...d6)"
}