{
    "moves": {
        "1. e4": "This is my first game I have ever annotated, hopefully I have not made too many mistakes. For most of the game the position was pretty much drawn, so this game will not be interesting to those who want to see some wild action. However the pawn endgame had a pretty nifty little ending that I wanted to show.",
        "1... c6": "Caro Kann, nice and conservative.",
        "2. Bc4": "I don't know what white tries to achieve, it simply loses a tempo.",
        "2... d5 3. exd5 cxd5 4. Bb5+ Bd7 5. Qe2": "This move must hope for an exchange of bishops and a dangerous looking queen on b5.",
        "5... a6": "Don't want the white queen on b5.",
        "6. Bxd7+ Nxd7": "Knight takes because in the Caro Kann the black queen finds a natural spot to sit on b6",
        "7. d4 e6 8. a3": "I was expecting c4 here, but I guess that the isolani position is not as useful without the white squared bishop.",
        "8... Ngf6": "Plain Jane piece development",
        "9. Nf3 Bd6": "More piece development.",
        "10. Ne5 O-O 11. Bg5 Qb6": "I often like to place my queen here in the Caro Kann, a natural fit ;)",
        "12. Nxd7": "I don't think white should be exchanging knights here, e5 was a good square to sit on.",
        "12... Nxd7 13. c3": "White would not appreciate my queen on b2",
        "13... Rfe8": "To prepare the e pawn push, never materialised though. I was not in the mood to play active.",
        "14. O-O h6 15. Be3 Qc7": "Hoping for the opponent to miss an obvious attack (b x h2 ) is never a good plan, but hey, I might as well give it a try.",
        "16. h3 Bf4": "At this stage I just wanted to exchange my pieces and rush into an endgame. Not that I had any advantage going to an endgame, but it is the part I enjoy playing the most.",
        "17. Qf3 Bxe3 18. fxe3 Nf6": "e4 is just screaming for the black knight to sit there.",
        "19. Nd2 Ref8": "Ok, I admit it, this is a very passive move. I had this lurking fear of some dangerous tactics heading towards my f7 pawn.",
        "20. Rac1": "Hmm, a white rook battery on the c file, won't be too nice either.",
        "20... Qb6": "Back to my queens  favourite square.",
        "21. Rc2": "Planning for  a doubling up on f and protecting b pawn",
        "21... Rac8": "I could not find a better move here. Suggestions welcome.",
        "22. Qg3": "Threatening r x n.",
        "22... Qc7": "Hoping of an exchange. r x n will not work now because of q x q",
        "23. Qh4": "White must have trying to achieve a doubling of rooks on the f file and advance its pawns towards my king.",
        "23... Nh7": "This was to make a future f5 move possible",
        "24. Nf3 Qd8": "If the queens don't get exchanged, then at least the black knight move to g5 will be allowed.",
        "25. Qf4 Qf6 26. Qg3 Qe7": "Too scared to leave my queen on the f file",
        "27. Rcf2 Ng5": "Was hoping for n x n, q x n, q x q and h x q. Rook endings are my favourite.",
        "28. Nd2 f5": "Opens up space to place my rooks on f file.",
        "29. Rf2f4": "Not sure what white was trying to achieve here.",
        "29... Ne4 30. Nxe4 fxe4": "Now heading into and endgame, but a queen endgame not a rook endgame",
        "31. Rf1f2": "It looks like white also wants a queen endgame.",
        "31... Rxf4 32. Rxf4 Rf8 33. Rxf8+ Kxf8": "Not q x r, otherwise q c7, q f7, q x q, k x q, c4 ! With black having a bad pawn structure that white should be able to win against.",
        "34. Qb8+ Kf7 35. Kf1 Qd7 36. Qf4+ Kg8 37. Qg4 Kf7": "I was expecting a 3 fold repetition here with q f4 ",
        "38. Qe2": "White must have wanted to carry on and see if he get find a win somewhere.",
        "38... Qa4 39. Ke1 Qb3 40. Kf2 Kf6": "Looks dangerous, but its perfectly safe.",
        "41. g4": "White wants to break through on the kings side.",
        "41... g5 42. Kg3 Qb6 43. h4": "Not sure what white wants to achieve by exchanging pawns. The next few moves are queen maneuvers to find some kind of advantage, but the game in my opinion was effectively drawn.",
        "43... Qd6+ 44. Kh3 gxh4 45. Kxh4 Kg6": "Wanted to get my queen on the g5 square.",
        "46. Kh3 Qf8 47. Qg2 Qf6 48. Qe2 e5": "The queen on e5 is a nice spot",
        "49. dxe5 Qxe5 50. Qf2 Qg5 51. Qf4 Qxf4": "I didn't want to have my queen forced back, with the white queen causing havoc on my side of the pawn structure.",
        "52. exf4": "Entered a pawn ending, with a both sides having a passed pawn protected by another pawn. The game was still a draw as far as I can see.",
        "52... h5": "This will break up the two white pawn supporting each other. If white plays g5 ? then black plays e3 followed by h4 and the white will not be able to stop both passed pawns.",
        "53. gxh5+ Kxh5 54. Kg3 Kg6 55. Kf2": "This move really surprised me, I was pretty sure that white was going to play k g4. I was thinking the game would go something like this: kg4, kf6, f5, ke4, kg5, e3, f6, e2, f7, e1 = q, f8 = q. With both queens back and now too much open space to avoid perpetual checks from either side.",
        "55... Kf6 56. Ke3": "This move lost white the game. The black king can now move onto f5 and the f4 square is now open to move towards to in the future, bringing on a zugswang sooner or later where black has to move away from e3 and lose the pawn on f4.",
        "56... Kf5 57. b3": "It does not matter how many pawn moves white can make compared to black, the black king can keep on moving between f5 and g4 until white runs out of moves and has to move his king.",
        "57... b5 58. b4 Kg4 59. c4": "When I first was looking at this position and saw c4 I thought that the game was still a draw. If d x c4 then k x e4 and the black king cannot move too far away from the f pawn. If c3 then the black king can chase it down and white will not be able get in, believe me I tried all possibilities they will not work because white can simply move a4 at the right time and black cannot win no matter where he has opposition the white king.",
        "59... bxc4": "This move at first looks bad, white can now simply play a4 and create two passed pawns that the black king cannot both chase down. While blacks passed pawns are all facing a white king in front of them that he can stop, or can he ?",
        "60. a4 c3": "All seems good for white, after c2, the king stops it with kd2.",
        "61. b5 axb5 62. axb5 d4+": "If the king takes either black pawn then black will win the promotion race.",
        "63. Ke2 d3+ 64. Kd1": "Again the king has to move back otherwise black promotes first.",
        "64... e3": "White cannot stop all three pawns. Not a position I come across often.",
        "65. b6 c2+ 66. Kc1 e2 67. Kd2 e1=Q+ 68. Kxe1 c1=Q+ 69. Kf2 d2 70. b7 d1=Q": "And white resigned, I hope that you liked that last little pawn tactic."
    },
    "url": "https://gameknot.com/annotation.pl/the-power-of-3-pawns?gm=10063",
    "gameName": "The power of 3 pawns",
    "players": "cieloazul (1666) vs. ulrich321 (1766)",
    "opening": "Caro-Kann (B10), Hillbilly attack"
}