{
    "moves": {
        "1. e4 c5 2. Nf3 g6": "One of the first to experiment with Kings Indian tendencies, in the Sicilian Defense, was Bobby Fisher. He was one of few players, who mastered this opening strategy with both black, and white. Bobby would never have played 2. Nf3... Most likely, he would have played 2. f4 d6 (or e6) 3. Nf3 Nc6 (whatever) 4. g3...",
        "3. d4 Bg7": "This is not for the faint-hearted; black does not defend c5... This is one of the great concepts of the Sicilian Defense: never defend c5... It is about d5...",
        "4. dxc5": "A natural reply, but weak... White is opening the diagonal to Bg7... Since black can easily win the pawn back, he gains tempo... In other variations, black would strive for e6, Ne7, 0-0, followed by d5... If he can beat white to it... It is all about d5...",
        "4... Qa5+": "The trick is: black can leave c5 undefended, while this check is still possible; after c3 or Nc3, black has to trade pawns with cxd4...",
        "5. Ke2": "Obviously, white is planning on a trick... The best reply is 5. c3 Qxc5 6. Be3 Qc7 7. Bd3... 5. Nd2, Bd2, or Qd2, are all options... But this?",
        "5... Qxc5 6. c3": "Right move, one too late... Best is 6. Ke1, and sit it out... With any luck, white can exchange queens...",
        "6... Nc6": "Of course, there is 6. ... Nf6 7. e5 Ne4/Ng4, but I was not sure if white was sticking to his plan... So I introduced the minor threath Nd4+...",
        "7. Be3": "White finds the one wrong move! After 7. Ke1 Nf6 8. Be3 Qa5 9. Bd3, all is well on the white front... Apart from castling...",
        "7... Qb5+": "A very unpleasant surprise... White was gambling on 8. Ke1, with an attack on the queen... Well, that goal is met...",
        "8. Ke1": "Got you...",
        "8... Qxb2": "Oops... Black also threatens Bxc3+, all of a sudden... After Nxc3, Qxc3+, it looks grim...",
        "9. Nd4": "White is following his bad intent... Planning on trapping the black queen, he defies 9. Nbd2 Bxc3 10. Rc1 Nf6 11. Qc2 Qxc2 12. Rxc2 Nxe4, with fighting chances against 3 pawns for somewhat better development...",
        "9... Qxa1": "No mercy...",
        "10. Qc2": "Of course, white could just as easily have resigned, but this is blitz... You never know, what is going to happen...",
        "10... e6": "Best is off course 10. ... Nxd4 11. cxd4 Bxd4 12. Bxd4 Qxd4 13. Bd3, and white starts praying... But I wanted to see if he still wanted my queen...",
        "11. Nb3": "Which he did... White has no options left...",
        "11... Bxc3+": "Forced, and winning... After 12. Kd1 Nb4 13. Nxa1 Nxc2 14. Nxc2 Bg7 it is done... After 12. Qxc3 (Nxc3 is pinned) Qxb1+ 13. Nc1 f6! also...",
        "12. Bd2": "White finds the only way, to lose another piece...",
        "12... Bxd2+": "And blacks queen escapes... White resignes, with 6 minutes on the clock..."
    },
    "url": "https://gameknot.com/annotation.pl/the-slaying-dragon?gm=45121",
    "gameName": "The slaying Dragon...",
    "players": "bossan (1200) vs. vonbonkagain (1200)",
    "opening": "Sicilian (B27), Hungarian variation"
}