{
    "moves": {
        "1. e4": "Hi everyone!  After the trials and tribulations of Beafyness' tourney it is nice to report that I beat someone in just 13 moves.  The Dentist is back after a sabbatical in Vietnam.  This game goes a long way to exorcise the memory of what happened the last time I was black against him (see The Dentist has his day).  He starts off with the Patzer's Opening, an opening you should underestimate at your peril as an Expert played this against me and won.",
        "1... e5 2. Qh5 Nc6 3. c3": "3. c3 - to prepare d4, though sometimes Bc4 is played to threaten Scholar's Mate, this mate can be beaten off by Qe7 or Qf6 or g6.  I now drive back the Wicked Witch of the West with Nf6.",
        "3... Nf6 4. Qf3 d5": "4. ........ d5 - I avoid the passive set up of my last game against him with this move twice attacking the e pawn.",
        "5. d3 dxe4 6. dxe4 Bg4 7. Qd3": "7. Qd3 - the witch must block the d file - otherwise Glenda will steam down to e1 delivering mate.  I exchange queens and then castle queenside, substituting the queen for the rook on the d file.",
        "7... Qxd3 8. Bxd3 O-O-O 9. f3": "9. f3? - loses pawn as you will see!",
        "9... Rxd3 10. fxg4 Nxe4": "10. ...... Nxe4 - Voila!",
        "11. Ne2 Bc5": "11. .......... Bc5 - I complete my development and this move contains a threat of mate in two .......",
        "12. b4": "12. b4?? - ....... which he misses!  With Glenda off the board no doubt he was lulled into a false sense of security here.  Nd2 should have been played here I think.",
        "12... Bf2+ 13. Kf1": "13. Kf1 - the only legal move.",
        "13... Rd1#": "13. ......... Rd1#.  So he who doesn't castle is castled!  Again, Old Matey appears out of nowhere.  Even with the queens off, white was punished for slow development.  All his queenside pieces are at home where black is fully developed.  My battle with passivity continues.  What I am now trying to do is study what moves are thematic to what opening, in particular pawn moves so that I do not get squeezed.  Just hope I have some more good news to post here.  Have a nice day everyone!  - Joanne"
    },
    "url": "https://gameknot.com/annotation.pl/the-dentist-is-castled?gm=20404",
    "gameName": "The Dentist is ............... Castled!!!",
    "players": "The Dentist (1293) vs. jstevens1 (1734)",
    "opening": "KP (C20), Patzer opening"
}