{
    "moves": {
        "1. e4 d5 2. exd5 Nf6 3. Nc3 e6 4. dxe6 Bxe6 5. Bb5+": "Kind of naive from white's side, unless he purposedly wants to keep his B away from his Kside.",
        "5... c6 6. Ba4 Bc5": "Bd6 is more in the defence's mainline. But it is rare I can play this and delay d4, so I wanted to try it. ",
        "7. d3": "Good for me. I should have gone Ng5 at once. ",
        "7... O-O": "Anainst my principles, I castled \"normally\". This is not what I use to play, but the R's pressure on e8 on the white K, still a little away from castling, was too tempting. Good, old schemes work too!",
        "8. Qf3": "Not a strong move, and I should have punished it with Bg5 at once. ",
        "8... Re8 9. Nge2 Bg4 10. Qf4": "I couldn't see a serious Q trapping, so I went elsewhere.",
        "10... Qb6": "Pressing on f2, and even letting him castle. But I saw no way o break in at once. ",
        "11. Bb3": "Leaving the square for Na4\n",
        "11... Bxe2": "Time to do something. ",
        "12. Nxe2 a5": "Threatening the lsb. ",
        "13. a4": "Nh5 doesn't help (Qf3). ",
        "13... Bb4+ 14. Bd2 Nd5 15. Bxd5": "Chooses to lose the B pair... My isolated central pawn won't be such a terrible weak point to defend. ",
        "15... Bxd2+ 16. Kxd2": "The good recapture, to connect rooks and keep a defence on the central squares. Otherwise, cxb and Qxb2 is a serious threat. ",
        "16... cxd5 17. b3": "I still can't go Qb4+ because QxQ doesn't give me anything.",
        "17... Nc6 18. Nc3 Nb4": "Very well placed N of mine...",
        "19. Rhe1": "...and this aims for a hatefully drawn game... unless...",
        "19... Re6": "I force RxR, otherwise Rf6 will be very strong on f2.",
        "20. Rxe6 fxe6": "! leaving a dangerously weak pawn on e6, but an f column ready for my R to grab.",
        "21. Re1 Rf8": "My R comes first.",
        "22. Qg4": "Planning a revenge on e6, but my Q guards it...",
        "22... Rxf2+": "My Q would have been more vulnerable to Re2.",
        "23. Kc1": "? Kd1 provided some more resistance at least.",
        "23... Rxc2+ 24. Kb1 Rxc3": "Threats are multiple, and if White goes Qxe6+, after the exchanges black is clearly winning.",
        "25. Rxe6": "This move would be a serious threat, if not for... Rxb3+, Kf1, Qc5+, Kd2, Rb2+, etc., or...",
        "25... Qg1+": "! A nice mate net.",
        "26. Kb2 Rc2+": "My opp resigned here. Of course...",
        "27. Ka3 Ra2#": "...is a very elegant mate. Thanks for reading, comments are welcomed!"
    },
    "url": "https://gameknot.com/annotation.pl/the-killer-move?gm=63352",
    "gameName": "The killer move",
    "players": "pdiddy32 (1470) vs. damafi (1487)",
    "opening": "Scandinavian defence (B01)"
}