{
    "moves": {
        "1. d4": "\"Can I become a queen this game please daddy?\" As you will know, Paula the petulant pawn longed to become a queen (see http://gameknot.com/annotation.pl/the-petulant-pawn?gm=28212 for details?)\r\n\"I don't know\" replied the king, placing her on the c2 square.",
        "1... Nf6": "Out comes the knight, in particularly, preventing 2. e4",
        "2. c4": "The Bishop behind Paula gave her a hearty push, as the King bellowed \"c4\". Paula found her self advancing 2 spaces. \"Good at least I have made a start\" she said to herself.",
        "2... e6": "Black plays the Nimzo-Indian defence, controling the centre with pieces rather than pawns.",
        "3. Nc3": "\"We'll hang out the washing on the c3 line\" sang the white knight to himself, as he jumped into action.",
        "3... Bb4": "Black finds another way to prevent white from playing e4.",
        "4. e3": "The white king shoved the e pawn forwarded one space. This is The Rubinstein System (named after Akiba Rubinstein)",
        "4... b6": "Slightly unusual, but perfectably playable. 0-0 and c5 are more common here.",
        "5. f3": "The white king pushes forward the f2 pawn one square. This again is unusual, white's more common 5th moves in this position are Bd3, Nge2, Nf3, a3, Bd2 or Qc2. There is a certain logic to f3. It reduces the power of the Black bishop if it goes to b7, prevents Ne4 from black and prepares e4 for white. The down side is that it is not developing a piece, and slightly weakening the white king side.",
        "5... Nh5": "So black moves his knight, threatening Qh4 check. c5 is the only move here for black on the Gameknot databases.",
        "6. Nh3": "So white covers that, and prepares to reply to the check with Nf2.",
        "6... O-O": "Black castles, a good move, taking the king to safety and developing the rook.",
        "7. Bd2": "White prevents his c pawns from being doubled.",
        "7... c5": "So here comes c5, as expected really.",
        "8. a3": "So having played Bd2, this is a logical follow up, if black exchanges on c3, my bishop is powerful on c3.",
        "8... Ba5": "So black retreats.",
        "9. dxc5": "White exchanges. Black's d pawn is now somewhat backward and there is a weak square on d6. After the recapture, white also has a backward b pawn and a weak square on b3, but this is less important, as 1. It is further away from the centre, the main scene of the action, and 2. It will take time for black to line up pieces on the b file and move the knight towards b3. Black in fact never does this, but white immediately starts making threats.",
        "9... bxc5": "So black recaptures.",
        "10. Ne4": "White threatens the c pawn and eyes the weakness on d6.",
        "10... Bb6": "Black is rather forced into defensive measures.",
        "11. f4": "Now the Nh5 is threatened.",
        "11... Nf6": "Black retreats.",
        "12. Nxf6+": "White exchanges, the Bd2 is going to c3 after all.",
        "12... Qxf6": "black recaptures.",
        "13. Bc3": ".....and it reaches the square. Just contrast the scope of the dark square bishops. On c3 white's has a lovely diagonal, while on b6 Black's has very limited scope.",
        "13... Qe7": "Black's queen supports the weak d6 square.",
        "14. Bd3": "White carries on with his development, if black doesn't defend accurately, white can launch a king side attack in some variations.",
        "14... f5": "Black is awake to the threats, but just compare the development of both sides,",
        "15. Qh5": "Although I played this move, I am not sure that it is best. Maybe just 0-0 is best.",
        "15... Nc6": "Black starts to catch up on development now.",
        "16. O-O": "White finally castles.",
        "16... Ba5": "And now black, aware of the power of the white bishop on c3, seems to go to exchange it.",
        "17. Rac1": "So white makes sure that his pawns are not doubled when the exchange comes in.",
        "17... Bd8": "I really don't understand this move. By moving to a5 first, black has just lost a move. In the post-match analysis, the Gameknot computer also criticised this move. It gave as the best follow up for both sides, Bd8 17. Ng5 h6 18. Nf3 Rb8 19. Rcd1 d6 20. Rf2 Qf7 21. Qxf7+ Kxf7 22. e4 Ba5 23. Bxa5 Nxa5 24. exf5. It also says as best for black Bxc3 17. Rxc3 Rb8 18. Rc2 g6 19. Qf3 a5 20. Rd2 Bb7 21. Qd1 d5 22. Ng5 h6 23. Nf3 Kg7. Well of course, I didn't see all that, but I thought the exchange on c3 was best for black, and would have given approximate equality. White is now slightly better (0.95 better according to the Gameknot computer)\r\n",
        "18. e4": "As white is better developed, it makes sense to open up the position, maybe launch a king side attack, if conditions are right.",
        "18... g6": "Black is alert to the risks in his position, and gives extra protection to f5, while attacking the white queen.",
        "19. Qh6": "Now there are threats of moves like Ng5, R-f3-h3.",
        "19... Nd4": "Black is alert again, and reduces white's attacking chances, but at the cost of a doubled d pawn.",
        "20. exf5": "Maybe it was better to take on d4 first?",
        "20... exf5": "Black recaptures.",
        "21. Bxd4": "White captured. Black d pawns are weak.",
        "21... cxd4": "Black recaptures. Paula, who had been sitting patiently on c4 suddenly woke up. \"I'm free to advance at last.\"",
        "22. c5": "And before anyone could stop her, she charged forward.",
        "22... Qg7": "Black moves to stop white's plans of a quick king side attack once and for all.",
        "23. Bc4+": "White throws in a check....",
        "23... Kh8": "Pretty much forced....",
        "24. Qxg7+": "and then white agrees to the queen exchange.",
        "24... Kxg7": "Forced again.",
        "25. b4": "\"Someone had better back up Pauls! b4!\" screamed the white king. \"before what wondered Paula\". Then she realised he meant the square b4, and smiled to herself for being so silly.",
        "25... Bf6": "Black tries to secure the vunerable pawn on d4.",
        "26. Ng5": "If black exchanges on g5, the pawn on d4 goes, while the white doubled pawn on g5 is not at all weak.",
        "26... Bb7 27. Bb5": "White attackes d7. If the d7 pawn goes, Paula on c5 really will have a clear path to promotion.",
        "27... h6": "So black counter-attacks on the king side.",
        "28. Nf3": "White retreats the attacked piece, and re-centralises the knight.",
        "28... Bc6": "Black tries to stabilise matters on the queen side. Now white would surrender all his advantage by exchanging bishops, the black pawns would be undoubled, and the pawn on d4 could be supported by a rook on d8.",
        "29. Ba6": "But white is also alert to the needs of the position. b5 followed by c6 is in the air. ",
        "29... Rfe8 30. Ne5": "A little temporary sacrifice of a pawn prepares the advance.",
        "30... Bxe5": "White was threatening b5, and after the Bc6 moves, taking on d7 with the knight.",
        "31. fxe5 Rxe5 32. Rfd1 Re4 33. b5": "The queenside pawn start to roll. Paula was getting really excited now.",
        "33... Bd5": "The only square.",
        "34. c6": "Paula jumped up and down with glee as she advanced.",
        "34... Re2": "The downside of b5 of course, is that the white Ba6 no longer covers e2, so black has this counter attack.",
        "35. cxd7": "\"One step to go, one step to go.\" Shouted Paula happily, jumping up and down. \"Look daddy you can play Bc8 or Rc8 next and then I safely queen next move. Look daddy this time I'm really going to do it!\"\r\n\"Quiet down Paula.\" Her dad, the white king replied. \"I'm sorry to spoil your fun, but black has already resigned. You will have to wait a bit longer yet to be a queen.\"\r\n\r\nI hope you enjoyed this game, which was a real Gameknot game, and the story. Don't forget to rate this annotation, so I know how I'm doing, and to tell your friends about it!"
    },
    "url": "https://gameknot.com/annotation.pl/the-petulant-pawn-part-2?gm=32505",
    "gameName": "The Petulant Pawn Part 2",
    "players": "Paula's family  vs. The other lot ",
    "opening": "Nimzo-Indian (E43), Fischer variation"
}