{
    "moves": {
        "1. e4": " MOVE BY MOVE ANNOTATION: This is a move by move annotation and the outcome is unknown at this time. Trying something a little new.I am annotating this game as I play it to avoid a rushed annotation later. Also, I do not like to skip ahead lots of moves. I usually pass on annotations where several moves leading to a crucial position are skipped over. I don't have time to figure it out and I will figure from comments I have read I am not the only one with this issue. So starting now all my annotations will show every move, however trivial, to make viewing easier. I will publish the game after it is completed as to avoid getting comments while the game is going on.\n\nI only open with D4 or E4 as white. I try to do about 50/50 with each opening. And it is E4's turn this time.",
        "1... d5": "Here is a move by black that should be a sound and aggressive response to E4 but it never seems to pan out for black, at least at level I play at, the 1250 to 1550 range usually.  I never play it as black myself.  I am not sure what the objectives are really but it always evolves into a board setup I do not like. Where black and white's pieces are stuck behind their pawns too long and a big open battle field sits empty between the two sides. Oh well. It seems a popular reply to E4 at GK so I am a little used to it and handle well these days winning most games that start in this position, according to my personal database. ",
        "2. exd5": "I think this is the standard way to go. ",
        "2... Qxd5": "Queen takes pawn.",
        "3. Nc3": "Knight to C3. This move forces his queen to do something, letting her know she is not welcome to roost on D5 as she pleases. It also develops a piece on white's side. The book responses tend to be queen back to her station on D8 or moving to A5 and establishing a formidable outpost for a possible flanking attack later. ",
        "3... Qe6+": "But he does what 75% of players do in this position and he checks the king. Why? They seem like they cannot resist that early check either on E6 or E5. In my early games I did get myself tied up with the queen jumping around my king side and it can get messy and I lost a few early games with this one.   But with a little experience you will find that this usually this works against black since he seems to try to win the game with a queen alone. As he jumps around trying to check you or get the G2 pawn you are developing pieces and often corralling his queen little by little. White just needs to take a breath and relax and let it play out. ",
        "4. Be2": "Bishop to E2. This works better, I think, than putting your knight on E2. A queen trade only leads to a long and boring game from the get go. Even if I win I have won a long and boring game and there is little thrill. He probably wants a queen trade off but I am not interested. Players who rush in early with queen attacks tend to run out of steam and I will move my lady out when the time is right. ",
        "4... b5": "I do not know what is up here. Maybe he was thinking that because my LS bishop was pinned he could advance that pawn. Maybe he wants to attack the G2 square with his bishop, but pawn to B6 would have worked better for that. I hesitated thinking it was sort of trap but decide it was a blunder. ",
        "5. Nxb5": "Knight takes pawn. ",
        "5... Ba6": "I think I can see what he is thinking here.  Or maybe not. Seems he may be attacking the LS bishop on E2 with his bishop and queen? Not sure. It is double guarded anyway by my queen and knight. Or he got antsy because he just lost a piece and wants to be aggressive and takes the \" in your face\" approach. I don't know, but I have found a queen loss is common for black with the Scandinavian if he is not cautious and patient. His best move was to move his queen back to protect the vulnerable C7 square. But sometimes people see this as \"retreating\" and giving up gained (though worthless) territory. ",
        "6. Nxc7+": "Black often can lose his queen with the Scandinavian if he is not careful, but it is usually not this quick and easy. I have made goofs like his too and I would have resigned the game and flagellated myself. My opponent is not disturbed by this turn of events, as if it is all in the expected course of events.",
        "6... Kd7": "King gets out of check. ",
        "7. Nxe6": "Queen is butchered on move 7. ",
        "7... Bxe2": "My opponent seems to think the loss of a queen so early on is nothing to prevent him from continuing attacks and trading off material. I think hanging on to that bishop would have been better but I would not even be playing any longer, so I don't know. I do not play what I see as \"lost\" games. ",
        "8. Qxe2": "Move my queen out. Want my knight on F3 for some reason, not on E2 slowing down my queen deployment and blocking my rook on the E file later.\n....\nMaybe taking his DS bishop and checking him last move and then taking his LS bishop would have been better, but I am not worried really. ",
        "8... fxe6": "He takes the knight and doubles up pawns. Note the big expanse of board between the two sides, a common formation with the Scandinavian and one reason I loathe it. ",
        "9. Nf3": "Develop knight. ",
        "9... Nc6": "Knight to C6. ",
        "10. O-O": "I castle and plan on getting my rook out to the soon to be semi-open E file ASAP. ",
        "10... h6": "I guess he is trying to prevent my knight from going to G5, but I no longer have any reason to go to that square with my knight. His king is open and in the center of the board and off the 8th rank. ",
        "11. d4": "Maybe not a great move. Want my bishop out and want to pressure him as well. I tend to move by instinct more than some deep logic. ",
        "11... Nf6": "Moves his knight to F6 defending, I think, against my pawn advance. Or he is limited in what he can move or do now and so he has to just move something. ",
        "12. c4": "I just figure I will claim territory and try to control as many squares as I can for now. No major plan in the works. Just sitting things up for later. ",
        "12... g5": "He still seems to envision he has 2nd strike capabilities. He is advancing to attack my F3 knight. Also freeing up his DS bishop later to harass my rook. ",
        "13. Ne5+": "I figure I will just move the knight and trade off equal points in material which is always better for the guy with the larger material lead. ",
        "13... Nxe5": "Trade off. ",
        "14. dxe5": "I take it with the pawn rather than queen as I am fairly conservative with queen moves and I want to open the D file, upon which rests his exposed king. His knight is attacked.",
        "14... Ne8": "Has to move his knight somewhere. It does not matter where I guess so long as it is saved.",
        "15. Rd1+": "Take control of that open file and remind him his king is vulnerable. ",
        "15... Kc7": "King moves. ",
        "16. b4": "Further advancing towards enemy territory with the intention of seizing and occupying unprotected squares. ",
        "16... Bg7": "Okay. Actually trying to attack my rook I feel. ",
        "17. a4": "This is not looking good for black really.",
        "17... Rd8": "Amazingly despite his weak position and loss of material he attacks my rook! Is he throwing the game or does he feel this shows bravery? Of course in the end ( the game is currently ongoing) he may win if I get too cocky or complacent. It is not likely though and by trading off a rook he only weakens himself further. ",
        "18. Rxd8": "Of course I trade off. ",
        "18... Kxd8": "Takes rook. ",
        "19. b5": "Pawn push with the pressure on him to prevent promotion. He cannot ignore those pawns. ",
        "19... Nc7": "Okay. ",
        "20. Be3": "I want my other rook to be active and I do not give a hoot about that pawn on E5. If he captures I will get my material back by taking his pawn on A7.",
        "20... Bxe5": "He takes it. ",
        "21. Rd1+": "Check his king again.",
        "21... Ke8": "One of two doable options is taken. I do not see one move any better than the other. Can develop an attack later with my queen to H5, but in no hurry. No need to rush a check. ",
        "22. Bxa7": "Get my material back and now have three passed pawns. One passed pawn can signal danger. Two signals imminent doom. But three signals infernal damnation. ",
        "22... Bf6": "This means nothing to him I guess and he prepares for another assault. I look to see if I am missing anything. I appear okay. Sometimes when one is ahead it best to step back and be sure over confidence is not making you miss a threat or danger. I lost a couple games where I was as much as 14 points ahead and got careless. Man that hurts. ",
        "23. Bd4": "Decide to get rid of that pesky bishop. He has to trade or lose his rook. What will he do? I wait to see.",
        "23... Rf8 24. Bb6": "The move of his rook to F8 (to take my bishop should I take his I guess, though using his pawn would be a little better I think)makes me now change plans a bit. I was up to trading off pawns but I see a checkmate now if he moves his knight to A8 to fend off my bishop taking it. I hope to go to H5 with my queen (which I have held off on for a bit as well timed check is better than a wasted one where your opponent only strengthens his defense) and check. I have only moved my queen once in the game so far. She seems inactive but she is like a predatory cheetah, waiting to pounce at the right moment. And that moment has come. Food. His only move will be rook to F7 as F8 is now taken by the rook, then my rook to D8 and checkmate. Will it work out? Will he see the set up? We have to just wait a bit and see. There is always a bit of excitement and worry at these moments. My opponent is on line now and I set up conditionals moves to see if I can predict his moves now. ",
        "24... Na8 25. Qh5+": "He moves his knight to A8 as I hoped. Not sure if his other options were that charming and I had not even explored what they might be. The game is over now. Will he let me have the checkmate? \n......\nNo. He fights all this way and resigns. To be frank I hate that and it leads me to think that players in his position may actually think they have a chance of winning or stalemating a game like this. It is possible of course, but not likely. Can at least let the other guy have the mate, but the only thing worse than a sore loser is a sore winner. So an interesting game and an interesting way to annotate it. "
    },
    "url": "https://gameknot.com/annotation.pl/the-perils-of-the-rushed-scandanavian?gm=54298",
    "gameName": "The Perils of the Rushed Scandanavian",
    "players": "zhudan (1369) vs. mm3308 (1249)",
    "opening": "Scandinavian defence, Lasker variation (B01)"
}