{
    "moves": {
        "1. e4 c5": "This game was part of a mini-tournament, \"Derman's sicilian  XXI\". Not surprisingly if you know the name, this was the starting position.  The idea of the Sicilian is that White gets a developmental lead and tries  to attack in the centre or on the kingside, while Black seeks counterplay  on the queenside and the c-file (which is usually opened soon).\n",
        "2. Nf3 d6 3. d4": "Mainline open Sicilian.\n",
        "3... Qa5+": "?! Yes, the queen is a very  powerful piece. But to get her out so early is risky, to say the least. She can  now easily come under attack, and because she is so powerful, you should  try to keep her on the board, unless you get very good compensation or can  deliver checkmate. That's why this is not a good move. Better would be  3...cxd4, exchanging a wing pawn for a central one and opening the c-file to  attack.\n",
        "4. Nc3 Bg4 5. Be3 e6 6. dxc5 dxc5 7. h3 Bxf3": "I think this is the best  move, because 7...Bh5?! 8.g4 Bg6 9.Ne5 and White already gets his kingside  attack going while he is still able to exchange knight for bishop if he wants  to. (Usually an N for B exchange is good for the side that loses the N,  especially on an open board)\n",
        "8. Qxf3": "And there comes Her Majesty.",
        "8... Nd7": "? A mistake, Black should try to undermine White's plans. My computer  (Fritz 8) gives 8...a6 to deny White access of b5 and prepare ...b5 for himself.\n",
        "9. O-O-O O-O-O": "? And another mistake. Now the queen shows her power for  the first time.\n",
        "10. Qxf7": "If your opponent has his queen out, always watch out  for this kind of things. A queen can cause a lot of damage, as happens in the  game.\n",
        "10... Qb6": "? Black shouldn't care about that little e6 pawn. Now White  has a clever (but rather simple) way to win material:\n",
        "11. Rxd7": "! Removing  the defenders of f8.\n",
        "11... Rxd7 12. Qxf8+ Rd8": "? Another mistake. Better  was 12...Qd8, 'only' losing two more pawns: 13.Qxc5+ Qc7 14.Qxa7. Now Black  will lose a piece and a pawn instead.\n",
        "13. Qxg7 Ne7": "Unfortunately for  Black, the only way to keep his rook is to sac his knight.\n",
        "14. Qxe7 Rd6": "?!  Again, I don't think this is the best move. The rook can easily be chased away.\n",
        "15. Bf4 Rd7 16. Qg5": "So the queen goes back. But the one man (or rather one  woman) show is not over yet...\n",
        "16... Rhd8 17. Bc4 Rd7d4 18. Bb3": "My computer found a  nice variation here: 18.Nb5! Rxc4 19.Bc7! Qxc7 (the only way to prevent  mate on d8) 20.Nxc7 Kxc7 and White won't have any problems to convert this into a  win, with so little material on the board.\r\n",
        "18... Qb4": "?? Another big mistake by  black. The next move must have been a surprise for him...\n",
        "19. Nd5": "! A  knight sac. Of course there's the threat 20.Nxb4. If 19...Q5, White gets a devastating attack with 20.Ne7+ and if 19...Qb5, White can threate unstoppable mate with 20.Qe5 and Qc7# to follow soon. (I didn't actually calculate these lines)",
        "19... exd5": "? The  wrong capture. Better would be 19...Rxd5 20.exd5. But now comes another trap  that was set by the sac:\n",
        "20. c3": "Black loses queen or rook.\n",
        "20... h6": "??  Another blunder. Of course White can just take the pawn and maintain the  threat. But he has even better...\r\n",
        "21. Qf5+": "! There's the queen again. Black has to  get the king out of check and cannot save his own queen anymore.\r\n",
        "21... Rd7 22. cxb4 Rxb4": "? 22...Rxe4 would have postponed the end a little bit. Now the White  queen can show her power for the last time in this game.\n",
        "23. Qf8+ Rd8 24. Qxc5+": "And with some smart manoeuvering she also wins the rook. Actually the  checkmate would be delivered faster without taking the rook, and of course the  queen plays an important part in that line again: 24...Kd7 25.Qd6+ Ke8  26.Qe6+ Kf8 27.Bxh6#. Unfortunately for Her Majesty, Black resigned and ended her  pleasure. Still she was very proud of this game. She had taken two bishops, a  knight and two pawns and helped her teammates to take the enemy queen. Thanks for  reading this annotation and I hope you enjoyed it. I did enjoy playing this  game, but next time I'll show you a more exciting gone."
    },
    "url": "https://gameknot.com/annotation.pl/the-power-of-a-queen?gm=33292",
    "gameName": "The power of a queen",
    "players": "l-d-j (1405) vs. icebergslimjimjo (1266)",
    "opening": "Sicilian, Chekhover variation (B53)"
}