{
    "moves": {
        "1. d4 d5 2. Bf4 e6 3. Nf3 Bb4+": "A tempo waste. ",
        "4. c3 Bd6": "My plan was to get the pawn in c3, so this just gave me a tempo. Now, let's see if I can made something with it. ",
        "5. Bg3 Bxg3 6. hxg3": "Very interesting. Now, I have an unusual semiopen file, let's see if I can use it. ",
        "6... Nh6": "Unusual, and it must not be good. ",
        "7. Qc2": "If the knight moves, Rxh7. ",
        "7... Bd7": "Not still ready to play Ne5 (f6 and I can't brake into black's position). ",
        "8. e3": "If I get the bishop into the fry, this will be won. ",
        "8... Nc6 9. Bd3 f5": "Of course! The last resource for black, one of which I must be always aware. g4 Nxg4 doestn' help, and RxN, gxR, g4! seems good, but it is a lot of material sacrified and I am not absolutely sure of the advantage it will give me, so I better try to take my time and get the other rook into the battlefied. ",
        "10. Nbd2 Ng4": "Black thinks he is preventing me to castle, but there are more than a way to do things (I miss the English proper idiom, here :-(. ",
        "11. Ke2": "Nothing definitive, still, but a lot of pressure. Black is adviced to castle queenside asap. ",
        "11... g5": "My God! Black \"attacks\"! Well, let me ride off that nasty f5 pawn a way or another. ",
        "12. Nh2 h5": "No way, my dear. ",
        "13. Nxg4 fxg4 14. Bg6+": "At last! Objetcive accomplished! Now white \"must\" win, isn't it?",
        "14... Ke7": "...but there is no easy way to penetrate. I can grab a pawn And then the other (h5 and g4), but that won't be \"brilliant\". With no dsb, I have to open the position quickly. ",
        "15. e4 Qg8": "A good one. Black is playing very well defensively. ",
        "16. exd5 exd5": "Still no way of penetration. I have to lose a tempo. ",
        "17. Rae1": "But what a tempo!",
        "17... Be8": "Black tries to exchange, but it only gives me the tempo back. ",
        "18. Kd1+ Kd8": "My kingdom for a dsb! But no one heard me...",
        "19. Qf5": "So I blundered. I modified the game, but I did bluder here. I thought QxB, so Qxd5+, etc., but black surprised me with the good...",
        "19... Bxg6 20. Qf6+ Kd7": "Still no win, and I made a sac for this position!\nThe game went on another way, but here I realized after the game that the white queen was in fact almost trapped, and I imagined what would have happened if...",
        "21. f4": "This move is because white knows that after Rf8, the only place for the queen to go will be Qxg5. After that, Bc2+ will cause white to lose the queen, so this way it will be defended. Another try could have been Kc1, but it was SO passive...",
        "21... Rf8": "If blak takes the pawn, either ways, the white queen retakes and it gets some squares. ",
        "22. Qxg5 Rf5": "Futher hunting the queen. ",
        "23. Qh4": "What a square for a queen, but... will it be lost?",
        "23... Qf7": "Black has to lead the knight to one of the R or B squares, but if black moves the knight, white penetrates supported by... the \"useless\" queen. So black must manouver. This is the first step: covering e7. ",
        "24. Re2": "White can only try to double rooks, but it cames too late. The other way is to retreat the queen in h2, then g1, to make it play again, but... they are lots of tempoes. ",
        "24... Re8": "Black has to avoid white to reinforce his power, and this rook was in fact useless. ",
        "25. Rhe1 Rxe2 26. Rxe2": "Black's turn. ",
        "26... Ne7": "Accomplished: N on e7. Now, black must coordinate his pieces. ",
        "27. Re5": "The only way white can contest black's plans. ",
        "27... Bh7": "But black is smart. This move threats Ng6. ",
        "28. Rxf5": "Only way for white to proceed. ",
        "28... Qxf5": "...but the white queen is still \"useless\"! It can only go back, and now the black queen is threatening to penetrate. Fortunately, a knignt is a fiercy guardian to a queen. ",
        "29. Qg5": "At last white can get his queen out. To be thruthful, by exchanging queen black must win, but let's go on for a little. ",
        "29... Qc2+ 30. Ke1 Qc1+ 31. Ke2 Nf5": "Look at this beauty: the white queen can't give any check or take any piece (not Qxh5, because of Nxg3+, forking it. ",
        "32. Nf1": "White has to stop Nxg3 or Qd3+. ",
        "32... Qc2+": "The black queen goes pawns grabbing. ",
        "33. Ke1 Qc1+ 34. Kf2 Qxb2+ 35. Kg1 Qxc3": "...threatening again Nxg3, or better, Qe1, Ne3. ",
        "36. Qf6": "White is out of moves, and tries to get his queen some use. Now it does threat a fork, grabbing the bishop. For this reason, black can take Qxd4+, exchanging the queens, and win. But again, let go ahead a little more. Here, it would be interesting to find out if black can play Qe1, trusting in Ne3 after QxB, but it is a lot of work. It smells like white has perpetual tricks or something. ",
        "36... Qd3": "So black defends the bishop. ",
        "37. Qf7+ Ne7 38. Qxh5": "Ok, white took back a pawn. It was a mistke, but white hoped to take g4, later. ",
        "38... Qxd4+ 39. Kh1": "Black seems to have a won game with Qf2, but after QxB, QxN+, Kh2, black has \"nothing\" but a piece and better pawns. Let's see if there is something better. ",
        "39... Bd3": "Now white is busted. Black DOESN't defend g4, because he wants to throw the knight back, even if pinned!",
        "40. Qxg4+ Nf5": "The bishop can stop it, but then everything would have been in vane. Now, black doesn't threat the Nf1, because of QxN+. But it is only a matter of one move: Qf2 is deadly for white. And, note, white cannot move Nh2 because of Qa1+ and mate. Probably, best white's move here is Nd2, but again, Qf2, Nf3, and black has not won yet, because of Ne5+. So a whole new line to explore. ",
        "41. Qf3": "White stops Qf2, but he cannot avoid to lose a piece, because if BxN, QxB, Ng3+ forking. So white is lost, I think in an interesting position. White's queen has been humiliated as seldom seen before. Thank you for reading. "
    },
    "url": "https://gameknot.com/annotation.pl/the-useless-queen-an-imaginary-game?gm=49271",
    "gameName": "The useless queen (an imaginary game)",
    "players": "damalfi  vs. blitzbased ",
    "opening": "Queen's pawn, Mason variation (D00)"
}