{
    "moves": {
        "1. d4 Nf6 2. e3 g6": "White here is making a bid for control of the center, while Black is aiming to limit White's control of the center and creating a fianchetto opportunity.  Black playing for the counterattack.",
        "3. Nc3 Bg7": "White has aimed to counter Black's knight, while Black has constructed the fianchetto.  Black is not in a position to move the knight and free up the bishop's potential, but can do it soon.",
        "4. Bd3 d6": "White is attacking well.  Black playing defensive, setting up for an eventual move to e5 to have some real fun.",
        "5. Ne4": "White aiming to break the tension of this position.",
        "5... Nxe4 6. Bxe4 f5 7. Bd3 e5": "Black will trade knights and chases the bishop away, then proceeds to make the move to e5, bidding for control of the center himself.",
        "8. dxe5 dxe5 9. Bb5+": "White is only too happy to make the move first.  This check will allow White to take Black's queen and keep Black from castling.",
        "9... c6 10. Qxd8+ Kxd8 11. Bc4 e4": "So, after 11 moves, Black has a major advantage in pawn structure, and his pawn structure is also more open to development of his non-developed bishop.  Black's king, however, is exposed and cannot castle, as opposed to White's rather protected king and ability to castle.  I give White a very slight advantage right now, though it's extremely close.",
        "12. f3 b5 13. Be2 Be6 14. fxe4 fxe4": "So Black's pawn chain is broken but he has both bishops out and dominating the board.",
        "15. h3 Nd7 16. Bd2 Ne5 17. Bc3": "Now Black has a pin on White's knight.  The tables have turned a bit.",
        "17... Kc7": "Time to get the king moving and avoid the check from the impending castle.",
        "18. O-O-O Rad8 19. Rxd8 Rxd8": "Rooks traded.  Black's pieces look to be much more active.",
        "20. Ba5+": "And Black has made a major mistake.  Rook will be lost.",
        "20... Kb7 21. Bxd8 Bxa2": "Might as well take something.",
        "22. Bg4 Bh6": "Pin on the pawn.",
        "23. Bf6 Nxg4": "No more reason to avoid trading pieces.  It benefits White but there are not too many other options - any move either takes the knight away from the fray or (moving to c4) pins the bishop in.  Not many better options.",
        "24. hxg4 Bxe3+ 25. Kd1 h6 26. Ne2 Be6 27. c3 Bxg4": "White has made a bit of a mistake here.  Black is understandably taking any and every piece he can, but he is also able to pin Black's knight, making it essentially a shield to be maneuvered around.",
        "28. Bg7 h5 29. Bd4 Bg5": "Black will not trade pieces now.",
        "30. Rf1 Ka6": "White's gonna unleash a fun attack of his own.",
        "31. Rf7 b4 32. Rxa7+ Kb5 33. Rb7+ Kc4 34. Rxb4+ Kd3": "Black has had to run for his life.  That said, he is now attacking the knight.",
        "35. Ke1 Bxe2": "Even now, things aren't over for White by any means.  He's got an escape route in the f3 square, and should Black try to attack it with Bh1, he has a block with his bishop.  Perhaps he should play for a draw rather than a win, but he ought not to lose.",
        "36. Bf2": "Calamity.  He has pinned his king in.",
        "36... Bd2#": "Goodbye..."
    },
    "url": "https://gameknot.com/annotation.pl/the-power-of-a-migratory-king?gm=42600",
    "gameName": "The power of a migratory king",
    "players": "georgebourque (1164) vs. johnpbro (1184)",
    "opening": "Queen's pawn game (A45)"
}