{
    "moves": {
        "1. e4": "Hi! I present one of my first game on GK, a game that i enjoyed and i hope you do so. I made two sacrifice in order to accomplish my idea that i had early in the game. This game show how a pawn is powerful together with a queen and how this alliance can fight against a queen, a rook and a knight. I think it a was a quick and a beautiful game. Enjoy it!",
        "1... c6": "Caro-Kann defense, classical variation",
        "2. d4 d5 3. Nc3 dxe4 4. Nxe4 Bf5 5. Bd3": "Although the book recommend 5. Ng3 i chose to develop quickly. ",
        "5... e6": "Maybe better 5. ...Qxd4 ?",
        "6. Nf3": "Defencing the d pawn.",
        "6... f6": "I considered this move a big mistake for black. I don't actually see any reason for it. Additionally it weaken the position of e pawn, and this will play a role in the end of the game.",
        "7. Bf4 g5": "And here I've got the idea and i really don't want to leave the b8-h2 diagonal.",
        "8. Bg3 h5": "Again a mistake. Now, after castling the h pawn remain unprotected, a situation that I fully exploited later.",
        "9. h3": "Keeping the bishop on the diagonal, and preventing 9. ...h4",
        "9... Bb4+ 10. c3": "And black accomplished nothing with this move. ",
        "10... Ba5 11. Qe2": "This is my last preparing move for my attack, preceding two beautiful sacrifice that I really enjoyed. Do you see it?",
        "11... b5": "Probably it was a very profound sense in this move, because I don't see it. Maybe blacks only await for my actions.",
        "12. Nxf6+": "Let's go! The first sacrifice. It half-open the e file for my queen. But this is apparently a sacrifice, because very soon i regain the material.",
        "12... Nxf6": "If 12. ...Qxf6 13.Be5 and black lose a rook.",
        "13. Bxf5": "And voila! I opened another diagonal - b2-h7. The e pawn remain pinned and my bishop intact.",
        "13... O-O 14. h4": "This is my second sacrifice, and the black will take it gladly because they don't see the danger. ",
        "14... exf5 15. hxg5 Nfd7 16. Ne5": "And the white queen obtained access to the h file. For blacks it was the end. ",
        "16... Nxe5 17. Qxh5 Re8": "Threatening 18. ...Nf3+ but there is poor continuation, and the danger on black king is not eliminated. In my opinion, Blacks here lose the last chance to resist. Because the White's forces are targeting the h8 square, moving the queen away from the 8th row would offer to Blacks more defensive possibilities.",
        "18. Bxe5 Nd7 19. g6 Nxe5": "I would prefer to play 19. ...Qf6, but maybe it will prolong the agony of the black king?",
        "20. Qh8#": ""
    },
    "url": "https://gameknot.com/annotation.pl/the-beauty-of-sacrifice?gm=32588",
    "gameName": "The beauty of sacrifice",
    "players": "volandm (1200) vs. mbh476 (1202)",
    "opening": "Caro-Kann (B18), classical variation"
}