{
    "moves": {
        "1. d4": "Weaker players may enjoy learning about the Nimzo-Indian Defence with this game. For stronger players I want you to evaluate the final position. Was black wrong to accept a draw?",
        "1... Nf6": "Black is going to play an Indian defence, as indicated by this move. It is the most played move in this position, and prevents white from playing e4.",
        "2. c4": "Again the most-played move. White gains space and prepares to develop his knights.",
        "2... e6": "Again, this is most usual move in this position, although g6 heading for the King's Indian Defence or Grunfeld Defence is nearly as popular.",
        "3. Nc3": "White can instead play Nf3 when black normally replies b6 going into the Queen's Indian Defence",
        "3... Bb4": "And this introduces the Nimzo-Indian Defence, named after Aron Nimzowitsch 1886-1935. There have been several famous games with this opening, for instance P Johner-Nimzowitsch 1926, Botvinnik-Capablance 1938 and the first game Spassky-Fischer 1972. Black prevents e4 with a pin on the Nc3",
        "4. a3": "The Samisch variation, named after Friedrich Samisch 1896-1975. It virtually forces black to give up the dark squared bishop, but in return, white gets doubled pawns",
        "4... Bxc3+ 5. bxc3 c5": "Having got rid of the black squared bishop, it makes sense to put pawns on black squares to compensate. This is the most commonly played move in this position",
        "6. e3": "White bolsters the d4 pawn",
        "6... Nc6": "and black attacks it again",
        "7. Bd3 O-O": "both sides develop some more",
        "8. Ne2": "In most opening the white knight goes to f3 instead. However this is the most commonly played move here. From here the white knight defends c3 and also after 0-0 white can play f3 and and e4, gaining a strong pawn centre",
        "8... b6": "Another pawn onto a black square, enhancing the scope of Bc8",
        "9. e4 Ne8": "Black doesn't want the f6 knight pinned with Bg5",
        "10. O-O Ba6": "Black brings pressure on the c4 pawn",
        "11. f4": "White now has quite an impressive looking pawn centre, with moves like e5 and f5 in the air",
        "11... f6": "f5 is more commonly played, but in the world database on Gameknot f6 had scored better.",
        "12. e5": "On the world database there are three games from this position, all draws. I would be happy with that. Adam is graded about 60 points ahead of me, and the only time I beat him was when he timed-out. Apart from that, before this game I had had 6 losses and one draw against him. I should have lost the one drawn game, he messed up after being a piece ahead.",
        "12... f5 13. d5": "This looks horrible for black, the white pawns cutting the black position in two, black pieces round the edge of the board. In fact the black position is quite sound. The knights are better than the bishops in this rather blocked position",
        "13... Na5 14. d6": "Instead of d6 white can't defend c4 with Qa4 and after exd the c pawn can't recapture as white would lose the Bd3",
        "14... Bxc4": "so black has to take now, as exd is no longer possible",
        "15. Bxc4 Nxc4 16. Qd3 Na5": "Black has won a pawn, but white has compensation",
        "17. c4 g6": "We are following Stefanova Antoaneta (2483) vs. Pelletier Yannick (2589) which ended in a draw",
        "18. Bb2": "But here Adam deviates from that game, where Bd2 was played. I now have to start thinking for myself!",
        "18... Rf7": "This gives more protection to the king",
        "19. Rf3": "white dreams of a king side attack",
        "19... Qc8": "Bringing the queen out to replace the exchanged white squared bishop",
        "20. Rh3 Qa6": "Pressure on c4 again!",
        "21. Rc1 Rb8": "Perhaps dreaming of breaking with b5 at some stage?",
        "22. Qc2 Ng7": "Bringing the knight to a better square",
        "23. Rf3 Nh5 24. Rc3": "and draw agreed on white's suggestion. The question is - should black have played on? He is a pawn up, but how to make progress is a problem. I wondered about playing the black king all the way over to a8 and then play to open lines on the king side. What do you think?"
    },
    "url": "https://gameknot.com/annotation.pl/the-england-team-super-tournament?gm=26644",
    "gameName": "The England Team Super Tournament",
    "players": "adamraoof (2006) vs. charleshiggie (1932)",
    "opening": "Nimzo-Indian (E26), Saemisch variation"
}