{
    "moves": {
        "1. e4": "Hi everyone!\n\nIn this game I was the exchange and a pawn up.  You would think that it would have been a gift from heaven from Freddy, wouldn't you?  A real chance for me to get that elusive victory against Expert opposition and earn myself the username TheBlackQueen.  The reality was different.  Passivitis set in and allowed Freddy to mass all his pieces around Henry.  My own pieces were fairly close to Henry but were very poorly co-ordinated in defense.  When playing Freddy and Ion I am sometimes caught between two stools, to be aggressive prematurely - i.e. to use Glenda as a Lone Wolf or to dig in and become passive and hopefully ride out the storm.  I tried to get aggressive with Freddy and put Glenda on a4, preparing a possibility of a queenside mating attack.  Unfortunately this move was a waste of tempo and Glenda would have been better served on h1 to enable Henry to get sanctuary on the queenside and to stop the Wicked Witch and her henchmen pouring in via the kingside.  I will let you, the Inquest Jury decide how I should have prevented this invasion and converted my material advantage to victory.  But before you decide, here is how the action unfolded.",
        "1... e5 2. f4 exf4 3. Nf3 g5 4. h4 g4 5. Ng5 h6 6. Nxf7": "6. Nxf7 - these first six moves were the thematic Welcome MT Part 9 Allgaier Gambit moves.  Freddy however hangs his rook rather than take the knight.",
        "6... Qf6 7. Nxh8": "7. Nxh8 - might as well!",
        "7... f3 8. gxf3 gxf3": "8. ..... gxf8 - pawn trade.",
        "9. d3 f2+ 10. Ke2": "10. Ke2 - Henry must give up the right to castle.",
        "10... d6": "10. ..... d6 - threat Bg4+ winning Glenda.",
        "11. Bh3 Bxh3 12. Rxh3": "12. Rxh3 - bishop trade.",
        "12... Nc6 13. c3 O-O-O 14. Be3": "14. Be3 - Freddy has a lead in development and I must now try and catch up!",
        "14... Qxh8 15. Nd2 Nf6 16. Bxf2": "16. Bxf2 - I decided to get rid of the nuisance pawn, but would a queen move to h1 been the order of the day here?",
        "16... d5 17. Qa4": "17. Qa4 - wrong decision, wrong decision, wrong decision!  If I could turn back the clock I would have moved Glenda to h1 and then the QR to g1.  The idea of a possible later Q or B x a7 seemed so inviting at the time.",
        "17... Qg8 18. Rg1 Qe6 19. Rhg3": "19. Rhg3 - plausible, but it does not cut the mustard.",
        "19... a6 20. a3 dxe4 21. dxe4": "21. dxe4 - pawn trade.  Now Henry is cut off from the c file due to a possible pin on my d2 knight which will remain on this square for the rest of the game.",
        "21... h5 22. Qc2 Ng4 23. b4 Nxf2 24. Kxf2": "24. Kxf2 - knight trade.  This lures Henry onto the gaping, open f column.",
        "24... Ne5 25. Ke2": "25. Ke2 - Henry tries to go back towards the queenside but he will get no further than this.",
        "25... Bh6 26. Rd1": "26. Rd1 - a rook is pulled back to d1 to defend my knight.  I also have an idea of trying to trade rooks on the d file but this plan does not materialise.",
        "26... Bf4 27. Rg2 Qh3 28. Kf1": "28. Kh1 - the rook must be defended but now Freddy announces #7, I worked it out but gameknot analysis showed it to be #8.  My calculations were as follows  ......... ",
        "28... Ng4": "This was the message that Freddy received from me: \"Game won, congratulations! Resignation note from jstevens1: Hi Freddy, You are right. It is #7, viz:- Variation A 29. Kg1 Be3+ 30. Kf1 Nh2+ 31. Ke2 Qxg2+ 32. Kxe3 Ng4+ 33. Kf4 Rf8+ 34. Kg5 Ne3+ 35. Kxh5 Rh8# And there is an even shorter mate in:- Variation B 29. Ke1 Qxg2 30. Qc1 Bg3# I will be calling for Gameknot Analysis as soon as I hit the resign button and will start annotating this game in due course but for the record I am resigning our game on the grounds of Unavoidable Mate. Well played! Joanne\" \n\nSo, four pieces were enough to weave a mating net around Henry.  Oh well, there will always be another game and in fact I am currently playing him as white.  At least until the outcome of that game, TheBlackQueen must wait."
    },
    "url": "https://gameknot.com/annotation.pl/theblackqueen-must-wait?gm=52275",
    "gameName": "TheBlackQueen must wait!",
    "players": "jstevens1 (1836) vs. easy19 (2137)",
    "opening": "KGA (C39), Allgaier, Horny defence"
}