{
    "moves": {
        "1. d4": "This game features the tiamonov attack which is white's most agressive line in the modern benoni. White presents his opponent with some serious problems to solve; if black is careless then the white pawns will soon crash through in the centre. It is problablely because of this line that most GM's rarely play the modern benoni. It is that fearsome.",
        "1... Nf6 2. c4 c5 3. d5 e6 4. Nc3 exd5 5. cxd5 d6 6. e4": "As a result of the early ...c5 by black there has been created a pawn imbalance that will play a vital role in the game. Black will try and play b5,or f5. And white will try and play e4-e5",
        "6... g6 7. f4": "The begins of the super aggressive four pawns attack. Which follows similar themes as four pawns attack in the KID",
        "7... Bg7": "I have played against the four pawns attack many times in tournament play so I am not afraid to meet the challenge.",
        "8. Bb5+": "This is the start position of the tiamonv attack",
        "8... Nfd7": "Black's other alternative is Nbd7. In the past I have played Nbd7 but have only managed to draw after a long forcing line. ",
        "9. a4": "The standard move taking time out to prevent ...a7-a6 and b7-b5. Whites alternatives are Bd3 and Be2.",
        "9... Qh4+": "In my opinion it is not worth was the time for black to spend two moves to force a weakness in the white kingside.",
        "10. g3 Qd8 11. Nf3 O-O 12. O-O a6 13. Be2 Re8 14. Kg2": "This helps fill in the gaps along the light squares around the king.",
        "14... Nf6": "adding pressure to e4",
        "15. Qc2 Bg4": "seeking to exchange a critical knight in whites plans.",
        "16. h3 Bxf3+ 17. Bxf3 Qc7 18. a5 b5 19. axb6 e.p. Qxb6 20. Nd1 Nbd7": "in this position black clearly has the worst of it. However, if he plays actively he can make it difficult for white to execute his plan. ",
        "21. Ne3 Re7 22. Nc4": "This is a powerful outpost for the knight that will ensure that white is able to play the crushing e4-e5.",
        "22... Qc7 23. e5": "and it is all over for black. ",
        "23... Ne8 24. Re1 Ra7 25. exd6": "and black resigns after he realizes that he will be down at least a rook"
    },
    "url": "https://gameknot.com/annotation.pl/thematic-benoni-4-for-fast-players-only?gm=13230",
    "gameName": "Thematic Benoni 4 for FAST players only",
    "players": "elyhim (1964) vs. renatello (1849)",
    "opening": "Benoni (A67), Taimanov variation"
}