{
    "moves": {
        "1. d4 Nf6 2. c4 c5 3. d5 e6 4. Nc3 exd5 5. cxd5 d6 6. e4 g6": "The first 6 moves of the Benoni 6, which generally favors white by about a third of a pawn or so. ",
        "7. Nf3 a6 8. Be2 Bg7 9. O-O": "Black's next move is the first one not out of the books :)",
        "9... b5": "Going for queenside counterplay, but a bit too early probably. black has no queenside developement, and little control of the center, and he is also not castled. He must play with care. Better would be 9) ... o-o",
        "10. e5": "white takes more space and control of the center. ",
        "10... dxe5 11. Nxe5 b4": "Black needs to castle badly, his king is very exposed and he lacks control of the center, and more importantly, the white squares. ",
        "12. Na4 Nxd5": "Black has delayed castling for too long, and will pay the price for it in the form of a pretty combination based on a pin along the white squares. ",
        "13. Nxf7 Kxf7 14. Bc4 Be6": "Defending the knight.. but white has calculated he will sufficient material  compensation for the sac on f7.",
        "15. Nxc5 Nc7": "Better is 15...Nc6, trying to hold on positionally at least, giving up a pawn in material.",
        "16. Nxe6": "Qf3  skewering the rook is inevitable: 16)...Qxd1? 17) Nxc6 ",
        "16... Nxe6 17. Qf3+ Qf6": "Bf6 is better, leaving the king with more options and defenses. however, by now, black isn't in the best shape. ",
        "18. Qb7+": "This is better than Qxa8! it wins two pieces rather than the rook. If not, Nd7, really the only other choice is 18)..Qe7 followed by 19) Bxe6  and 20) Qxa8",
        "18... Nd7 19. Qxd7+ Kf8 20. Bxe6 Rd8": "Black's pretty lost by now. ",
        "21. Qc6 Qe5 22. Be3": "the chilling threat is Bc5..",
        "22... Rd6": "walking into a pin..",
        "23. Bc5 Qxe6 24. Bxd6+ Kf7 25. Rae1": "Black is mated, or he will have to give up his queen. Black resigns. "
    },
    "url": "https://gameknot.com/annotation.pl/thematic-benoni-6-for-fast-players-only?gm=15172",
    "gameName": "Thematic Benoni 6 for FAST players only",
    "players": "jakey101 (1698) vs. altera (1870)",
    "opening": "Benoni (A70), classical with e4 and Nf3"
}