{
    "moves": {
        "1. d4 Nf6 2. c4 c5 3. d5 e6 4. Nc3 exd5 5. cxd5 d6 6. e4 g6 7. Nf3 Bg7 8. Be2 O-O 9. O-O Re8 10. Nd2": "The old main line benoni, I believe ECO E73.\r\n\r\n(Taken from MCO 15)... \"The Benoni defense strives for imbalance from the start. Black cedes White more central territory with an advanced pawn on d5 and normally a kingside pawn majority. Black in turn normally gets dark-square play in the center and an extra queenside pawn which can be dangerous if mobilized. ",
        "10... Nbd7": "eyeing e5, black plays on the dark squares in the center. ",
        "11. f3": "I was surprised not to see a4, surpressing black's queenside play, or f4, thrusting into the center. ",
        "11... Ne5 12. Nc4": "12. f4? Neg4\r\nNc4 challenges the dark squares nicely.  ",
        "12... Nxc4 13. Bxc4 a6": "preparing a pawn thrust on the queenside, trying to make use of the majority.",
        "14. a4": "stopping the thrust. ",
        "14... Nh5": "Better for me probably would have been Nd7, with the juicy b6 and e5 squares in the knight's sight. I chose h5, however, because of the weak f4 square. ",
        "15. Be3 Be5": "preparing Nf4. ",
        "16. Qe1 Qf6": "black plays harder on the dark squares, and he is already seemingly better because white failed to utilize his center pawns well. ",
        "17. Qd2 Nf4": "black's pieces are invasive and annoying to the white center. ",
        "18. Rab1": "preparing b4, with counterplay. ",
        "18... b6": "aiming to surpress the counterplay ",
        "19. Ne2 Nxe2+ 20. Qxe2": "perhaps Bxe2 was worth a look as well. ",
        "20... Qh4": "a gentle threat. ",
        "21. f4": "I believe g3 may have been the better way to stop Qxh2, as this opens the h5-d1 diagonal for the black bishop. After Bxe2, this wouldn't be a problem...",
        "21... Bg7 22. Bd3 f5": "opening the E file could prove to be deadly for white. 23. exf4 Bg4 ",
        "23. Qf3": "This fails tactically, as white's position crumbles to dust. ",
        "23... fxe4 24. Bxe4 Bg4 25. Qf2 Qxf2+ 26. Bxf2 Rxe4": "White loses a bishop. ",
        "27. g3": "better was h3 here for white, but he's already a goner, and is playing sloppily until the end. ",
        "27... Rxa4 28. Rfe1": "better was b3. ",
        "28... Bf5": "Seeing he's going to lose yet another pawn, white resigns. "
    },
    "url": "https://gameknot.com/annotation.pl/thematic-benoni-6-for-fast-players-only?gm=16281",
    "gameName": "Thematic Benoni 6 for FAST players only",
    "players": "riva77 (1682) vs. jakey101 (1785)",
    "opening": "Benoni (A77), classical, 9...Re8, 10.Nd2"
}