{
    "moves": {
        "1. e4": "Here is a game which illustrates White's plans against the Pirc defense and the typical kingside attacking positions that are latent in the position if Black doesnt play accurately.",
        "1... d6 2. d4 Nf6 3. Nc3 g6 4. Nf3": "Aiming for the classical setup which is not as sharp as the Be3/Qd2 plans, but is very straight forward and logical nonetheless.",
        "4... Bg7 5. h3": "White aims to restrict the light-squared bishop.",
        "5... O-O 6. Be3": "A second consequence of 5. h3, now the knight swat is prevented.",
        "6... a6 7. a4": "White is aiming to cramp Black's queenside counterplay, here to prevent the ...b5 break.",
        "7... b6 8. e5": "The early break is recommended by Dzindzi and gives White a healthy initiative, sometimes at the expense of a pawn.  Alburt and Chernin indicate that White is not ready for this break in their comprehensive work on the Pirc, \"Pirc Alert\", however, new analysis by Dzindi and practical games at master level call into question this analysis.",
        "8... Nfd7": "The best move, as 8...de 9. de Nfd7 10. e6! shatters Black's pawn structure.",
        "9. e6": "Played anyway, but Black can hold if he plays carefully.  White wants to weaken the light-squares around the enemy monarch and gain tempi for development by attacking these squares.",
        "9... fxe6 10. Bc4": "Stronger and more direct than the immediate 10. Ng5, which is the only coninuation given in Alburt and Chernin's book \"Pirc Alert\".",
        "10... Nf6 11. d5": "Offering a pawn to open the light-squares to White's powerful bishop.",
        "11... c6": "Black wants to exchange White's powerful center pawn, without allowing White to dominate the d5-square with his pieces.",
        "12. Ng5": "Increasing the pressure on e6.",
        "12... Kh8": "More to the point would be 12...e5, with a tough struggle ahead.  Other alternatives are 12...h6 and 12...ed.  12...Kh8 is an aimless move, which allows White a strong attack centered around a pawn wedge at e6.  Black's army on the queenside will be cut off from defensive duties on the kingside and White's standard h-file plan will come into play, allowing the White pieces to stream in for the attack.",
        "13. dxe6 Qc7": "Moving the queen away from the action, although, it's difficult to find a good move here.  13...d5 can be met with 14. h4! followed by 15. h5! and Black doesnt have anyway to stop the opening of the h-file with devastating effect.",
        "14. h4": "As mentioned earlier, this is the strongest move, preparing to advance the h-pawn and rip open the king position.",
        "14... Bb7": "Black's pieces have nothing to do, the pawn wedge at e6 cuts the Black army in half and Black is forced to wait passively for the attack.",
        "15. h5 Nd5": "Finally, sensing the danger to his king, Black decides to attack with the only two pieces he has at his disposal, however, this move leads to a forced mate.",
        "16. hxg6 Nxe3": "Black can only postpone the inevitable.",
        "17. Nf7+": "Here Black resigns, as after 17...Rxf7, there is no defense to 18. Rxh7  Kg8 19. exf7  Kf8 20. Qh5, when all Black has are some gratuitous checks, which White can easily avoid, while preserving the mate threats."
    },
    "url": "https://gameknot.com/annotation.pl/thepirc?gm=1783",
    "gameName": " ThePirc",
    "players": "mybookrunsdeep (2017) vs. sartrewannabe (1717)",
    "opening": "Pirc (B08), classical, h3 system"
}