{
    "moves": {
        "1. d4 d5 2. c4": "first time I've tried queens gambit",
        "2... dxc4 3. e4": "and an aggressive line too!",
        "3... b5 4. e5 Nc6 5. Nc3 a6 6. a4 Bb7": "allows me to recapture the pawn..",
        "7. axb5 axb5 8. Rxa8 Bxa8 9. Nxb5": "pawn recaptured - and looking at c4",
        "9... e6 10. Bxc4": "ok - I'll have c4",
        "10... Na5 11. Qa4": "now here I'm going out on a limb - not sure I have enough development for this bold move... but if you make the wrong decision there are some great opportunities...\r\nIf you make the correct replies... then the most I can hope for is a draw..",
        "11... c6": "excellent",
        "12. b3": "here I offer the draw ... \r\nmy notes say that if your pawn takes on b5 - white win\r\nif the knight takes bishop - its a draw",
        "12... Ne7": "but this is a blunder? \r\nwinning rook and pawn for knight! I'll settle for that being already a point ahead",
        "13. Nd6+ Kd7 14. Nxf7 Qb6 15. Nxh8 Nf5": "ok got the rook ... but now you have chances in the center with queen to d4",
        "16. Nf3": "develop and protect",
        "16... Bb4+": "nice move - there is a lot of thought here..",
        "17. Bd2 Bxd2+ 18. Kxd2": "recapture with king ... I'll be looking at getting rook to d1 and hopefully pinning any knight attack.\r\n",
        "18... Bb7": "in retrospect maybe it would have been better for me to get the king to c3 now! but I thought I might save the knight f7 and then d6...\r\nthreatening your bishop agian anyhow.",
        "19. Nf7": "ok save the knight",
        "19... Nxd4 20. Rd1 Ke7": "ok - gonna come under threat for a short while ...\r\nworrid a little concerning perpetual checks.. but if your queen comes away from protecting knight on b5 then that'll be compensation for the short chase.",
        "21. Nxd4 Qxd4+ 22. Kc2 Qxf2+ 23. Kc3 Qe3+": "ok - here we go!\r\n",
        "24. Rd3": "Thought I had an answer to everything here!\r\nas soon as you stop checking I have queen takes kinght threatening some serious action on d8 .... though I could avoid perpetual check and a draw here - looking at it now I'm not too sure",
        "24... Qe1+": "especially with the excellent !!\r\ndidn't see that coming atall seems I had a mental block with e1 - didn't considerit atall - monumental blunder and now you protect your knight too.\r\n\r\nok - need to work my king to a3 - not happy ",
        "25. Kb2 Kxf7": "and now can't recapture on a5.. well played...",
        "26. Bxe6+": "looking for a way out of this mess.. I'm still strong and your minor pieces are still pretty blocked.\r\nThink I analyse a win if your king can be tempted forward to take the pawn on e5 ... if you retreat after taking the bishop then I think I can force a draw?",
        "26... Kxe6": "ok lets wee if you can be tempted forward?",
        "27. Rd6+": "if you retreat your king to e7 then white queen to d4 threatens mate forward.. while protecting d2 f2 and d4 from your checking queen.. \r\nyou have to bring your queen to the defence\r\n",
        "27... Kxe5": "but you take the pawn - this is now unstoppable - your queen is mine :-)",
        "28. Qd4+ Kf5 29. g4+ Kg5 30. Qxg7+ Kf4 31. Rf6+ Ke5 32. Rf1+": "phew!\r\n"
    },
    "url": "https://gameknot.com/annotation.pl/think-about-it?gm=5858",
    "gameName": "think about it",
    "players": "kiev53 (1468) vs. rheiner (1366)",
    "opening": "QGA (D20), 3.e4"
}