{
    "moves": {
        "1. e4": "My first Walk the Walk and Learn to Run annotation... \nI started this annotation at least 3 earlier times and became discouraged during the process. I came back to it again, because it was my first game challenging one who plays in the celestial regions of the game and an obligation to fulfill the Walk the Walk annotation. The early part of the game was much fun but then it spiraled away from me...I must admit that after this game I have made a conscious effort to change some of the ways I approach my game. \n\n( I slide into my chair from the right and not the left )  ............. :)",
        "1... Nf6 2. e5": "I felt bold, because I recalled a game I played where my knight was systematically chased and thought I could duplicate the maneuver. ",
        "2... Nd5 3. d4": "Even though I decided to give chase, center presence seemed more important...",
        "3... d6 4. Nf3": "Natural progression, still looking at that wayward Knight...",
        "4... g6 5. Bc4": "Challenging the Knight with the Bishop seemed better than the c Pawn, development and subsequent a2-g8 diagonal, ready to castle.....",
        "5... Nb6 6. Bb3": "I like it...",
        "6... Bg7 7. a4": "I was emboldened because of the diagonal my WSB commanded.",
        "7... dxe5": "I felt that pushing my a Pawn and continuing the chase was a better idea at the time, than the recapture and the resultant skirmish that would occur... besides that g5 square looks mighty inviting to my Knight...",
        "8. a5 Nb6d7": "I was as nervous as if I was playing face to face.",
        "9. Bxf7+": "I could not believe I did that!",
        "9... Kxf7 10. Ng5+": "I'm down a minor piece but what do I care! I've got his King on the RUN!!!",
        "10... Kg8 11. Ne6": "I cant believe this...",
        "11... Qe8": "Oh man, oh man...",
        "12. Nxc7": "Oh man, oh man, oh man...",
        "12... Qf7": "Oh great his Queen is out and in attack mode but what do I care, I've got his Rook!",
        "13. Nxa8": "So impatient! That Rook wasn't going anywhere! I should have grabbed his pawn @ e5....",
        "13... exd4 14. O-O": "In retrospect I think I should have gotten my Knight outta there......",
        "14... Na6": "Yep, abandoned!",
        "15. Na3": "Both Knights in the worst spots for Knights! I was thinking of galloping him out to help his brother Knight.....",
        "15... Qd5": "I'm up, my King is tucked away, his K seems unprotected and blocking his Rook... So why do I feel so threatened? \nMaybe he knows I'm trying to balance the situation with my cornered Knight.",
        "16. Be3": "Riiiiiiiight, like he's gonna take the offer...",
        "16... b6": "Obviously making it easier to get that wasted Knight...",
        "17. c4 Qe4": "Why should he bother with that Knight? I had my chance to get him out and ignored it. What's he up to? Supporting the attack on my bishop maybe...",
        "18. Re1": "Since my Knight is dead meat, I should have taken the b6 pawn and maybe get an open a file instead of just giving him up....Should have shown him more respect after the trouncing he did earlier....",
        "18... dxe3": "Great there goes my Bishop...",
        "19. Rxe3": "Looks good, I can get the E pawn and I'll have my Rook on the 7th rank!",
        "19... Qxa8": "Aaaaaand there he goes... could mean I'm gone too...",
        "20. Rxe7": "Looks formidable...",
        "20... Qc6": "His g7 Bishop and d7 Knight are preventing immediate threats on the King....As I said he seemed unprotected.",
        "21. Nb5": "Threat on a7 but I wanted to involve the Knight possibly on d6...",
        "21... Bb7 22. Qd5+": "Oh nuts! At the time I felt the only way to diffuse that threat was to interpose and check, forcing the Queen trade...I think f2-f3 might have given me a little breathing room...",
        "22... Qxd5 23. cxd5 Nab8": "Protecting his Knight...",
        "24. Nd6": "Giving up d5 and looking to get his Bishop off  g7 with my Knight...",
        "24... Bxd5 25. Ne8 Bxb2": "Don't think it was such a hot idea now... losing pawns left and right ... his Bishops are controlling much of the board now... I still seem to be exerting some pressure but it might be illusory...",
        "26. Rd1": "Want to dislodge WSB...It protects f7 and might be able to get something going there...",
        "26... Bc6 27. Nd6": "Thanks...",
        "27... Bf6 28. Re8+": "Wait, no... f7 might have been better",
        "28... Kg7 29. Rxh8 Kxh8 30. Nc4 b5 31. Ne3": "Rallying what's left of the troops, shouldn't have traded off all my pieces...I probably would have been better off now...",
        "31... b4": "Nothing to really impede his progress without giving up more pieces....\nTo quote myself from earlier.... \"I can't believe this!\"...",
        "32. Rb1 Be7 33. g3 Nc5": "Hey! that's the Knight I was pushing around early on, giving me a gift and teasing me into thinking I have a chance... at what I don't know...",
        "34. Rxb4 Nbd7 35. Kf1 Bd8": "So many options for Black...",
        "36. Rd4 Bxa5 37. Ng2 Bxg2+ 38. Kxg2": "Still trading off my pieces!... jeez... ",
        "38... Bc3 39. Rd1 a5 40. Rb1 a4 41. Rc1": "Should have pushed my Pawns instead...",
        "41... Be5 42. Rc2 a3 43. f4 Bg7 44. h3 Nd3 45. Rc8+ Bf8 46. Rd8 a2 47. Ra8 Nc1 48. Kf2 Nb6 49. Rxa2": "...",
        "49... Nxa2": "That's the same Knight I thought I could push around... now, who is getting chased around the board?",
        "50. Ke3": "My King, of course!",
        "50... Kg7 51. g4 Kf6 52. h4 h5 53. Kf3 hxg4+ 54. Kxg4 Nd5 55. Kf3": "This became painful for me about 20 moves ago and had to end my suffering after the next 10...",
        "55... Kf5 56. Kg3 Nxf4 57. Kf3 Be7 58. Kg3 Nh5+ 59. Kf3 Bxh4 60. Ke3": "The mating net being cast...",
        "60... g5 61. Kf3 Nf4 62. Ke3 g4": "Must have gotten tired of my impertinence of earlier...",
        "63. Kd4 g3 64. Ke3": "I couldn't stand it any longer...\nIt's taken me a long time to get over this game but as I said at the beginning it changed some things in my game... my rating may not reflect it, but I feel I am a better player for it...\nThank you,Sir!\n\nI hope you've enjoyed the replay of the game as much as I enjoyed playing it (ok, most of it)...\n"
    },
    "url": "https://gameknot.com/annotation.pl/third-battle-of-breitenfeld?gm=55921",
    "gameName": "Third Battle of Breitenfeld",
    "players": "vocihc (1435) vs. stalhandske (2192)",
    "opening": "Alekhine's defence (B04), modern, Keres variation"
}