{
    "moves": {
        "1. e4": "Easily the best first move for white, though some people prefer the dubious 1. d4?.",
        "1... c5 2. Bc4": "An unorthodox move for white. I did this to throw off my opponent, since he probably knows the sicilian better than I do. As we'll see, my suspicions were correct, and once we leave the main-line sicilian, this guy has no idea what to do. Classic sign of a guy who memorizes openings but doesn't actually know how to play them.",
        "2... d6": "Not sure what black was thinking here. e6 would have been a far stronger move. I think he wanted to keep to the variation that he had memorized, another sign that he has poor understanding of chess openings.",
        "3. Nf3 Nc6 4. Ng5 e6 5. Qf3 Nf6 6. d3 Nd4 7. Qd1 Nc6": "This move was the first indication that redrook4 has an inflated rating that he does not deserve. This is the kind of move a 900 player makes.",
        "8. O-O a5": "Again, what is this guy thinking? Someone get the 900 player off this guy's account.",
        "9. Nc3 Bd7 10. Bf4 Nd4 11. Nf3 b5": "LOL. He tries to trap my bishop. He literally just spent 4 moves trying to trap my bishop, and it doesn't even work. Observe:",
        "12. Nxd4 cxd4 13. Nxb5": "LOL. What a disappointment this must have been for our poor 900 player.",
        "13... Bxb5": "Do I sense desperation?",
        "14. Bxb5+ Nd7 15. Qg4 Ra7 16. e5 dxe5": "Probably not the best move here, but it's already too late to try to counter white's initiative. Black has to pay for his horrid opening play.",
        "17. Bxe5 Rb7 18. Bxd7+ Qxd7": "Taking with the rook instead would have let him keep his d-pawn. This guy just keeps making bad moves...",
        "19. Qxd4 f6 20. Qxd7+ Kxd7 21. Bc3 Bb4 22. Bxb4 Rxb4": "He still thinks I'll let him get the b-pawn. This guy has such epic tunnel-vision that I'm not surprised that he lost so badly.",
        "23. b3 a4 24. Rfe1 axb3": "Gave my rook free reign on the a-file, and a clear route to the 7th rank. ",
        "25. axb3 Rc8 26. Ra7+": "And the noob realizes he's been stomped and resigns. He probably just noticed that he was two pawns behind. I wouldn't doubt that it escaped his attention, considering how epic his tunnel-vision is. Simply too many beginner mistakes from a high-level player for him to get out with a draw."
    },
    "url": "https://gameknot.com/annotation.pl/this-guy-should-not-be-1843?gm=39162",
    "gameName": "This guy should NOT be 1843.",
    "players": "oops_you_lose  vs. redrook4 ",
    "opening": "Sicilian defence (B20)"
}