{
    "moves": {
        "1. d4 Nf6": "These moves are just standard. Nothing really special about them.\n",
        "2. Nc3": "A bit of a mistake on my opponents part. This move allows me to develop my Queen's Pawn without disruptions, also blocking out the opponents e-pawn. Better would be 2.c4, which stalls development for black and increases development speed for white, or 2.Nf3, which does not block the c-pawn from advancing, but still develops a knight. \n",
        "2... d5 3. Bf4 Bf5": "Reverse Giuoco Piano is my name for this, but I think this transposed into a Blackmar-Diemer Gambit.\n",
        "4. h3": "I think this move is pretty pointless, unless they want to try and drive my bishop away with g4, which isn't really a good idea. Also, I probably would have never moved my bishop to g4 anyways.\n",
        "4... e6": "Continuing with basic development.\n",
        "5. a3": "I was planning to do 5...Bb4, but I guess this move stops it. Either 5...Nc6 or 5...Bd6 are good as Nc6 adds development and also make enables e5 if my opponent chooses not to take the Bishop when I move it to d6. Bd6 is more rushed and has a slightly worse line, but can gain development faster.\n",
        "5... Nc6": "I decide to do Nc6 because it has more options in the long run. It also frees up more options with Bd6.\n",
        "6. Nf3": "Development.",
        "6... Bd6": "This bishop is basically useless now, considering the only other place my dsb can go other than d6 is e7, which is absolutely useless, because Be7 would do absolutely nothing. So, Why not exchange it? It also lets my queen free through the c-file. Plus, his dsb is really annoying me for some reason. ",
        "7. Bxd6 cxd6 8. e3": "Personally, I think this move should have been played earlier. He could try 9. Bd3, with a attempt to mimic me, but I have a pawn on e6 protecting my bishop, so I have no need to capture.",
        "8... O-O": "I am practically done with development.",
        "9. Bb5": "What was the point of this move? It does absolutely nothing!",
        "9... Ne4": "You see, if the opponent takes with his knight, then I take back, there is the threat of 11... Qa5+, which forks the bishop and king.",
        "10. Nxe4 dxe4": "Not sure if Bxe4 is better, it probably was.",
        "11. Nd2": "This is necessary, blocking Qa5+. ",
        "11... Qg5": "Threatening to rip apart white's kingside.",
        "12. g4": "Umm... g3 is better, right? Well, I wanted to see Rg1(?!). I haven't figured out all the lines with Rg1, but, I think its the worst of the 3 listed moves.",
        "12... Bxg4": "First time you see this, you see a blunder. Looking at it again, you see black has snagged a extra pawn. (Qxg4/hxg4, Qxb5!)",
        "13. Qxg4": "Was hxg4 better? NO! This way, White can create a higher threat with this, and also, the White queen would be trapped in.",
        "13... Qxb5 14. O-O-O": "Right or Wrong time to castle? Both. White can create a stronger attack now, but white can also be attacked with more force. It's more of a bad time to castle, because the queen can be driven back now and deprived of the move Qxe4.",
        "14... f5 15. Qg5 e5 16. c4": "A mistake. White has lost a pawn here.",
        "16... Qa4 17. d5": "This was not the best move here. 17...Na5 was going to be my next move, and his c-pawn is dead.",
        "17... Na5 18. Qe7 Nxc4 19. Qxb7": "This is a Blunder?! Yes. Does it seem like a blunder? No. But, it is.",
        "19... Nxa3": "Nxa3!! Now, White is dead. Well, why can't white do bxa3? ",
        "20. bxa3": "BLUNDER!! You are probably thinking \"This is a blunder?! How?\" Well, the queen is now lost. ",
        "20... Rfc8+": "Either Kb1 or Kb2, which means the queen is lost through a pin. Nc4 is also a bad choice.",
        "21. Nc4 Qxc4+": "The King has a escape route, But that doesn't prevent the fact that the queen is lost.",
        "22. Kd2 Rab8": "The queen doesn't look lost, does it? Alas, its either the King or the Queen.",
        "23. Qxa7": "By not doing a rook-queen exchange, the king is now lost.",
        "23... Rb2+": "23... Rb2!! And after Ke1, Qe2 is checkmate.",
        "24. Ke1 Qe2#": "I hope you enjoyed this!"
    },
    "url": "https://gameknot.com/annotation.pl/this-is-a-blunder?gm=46071",
    "gameName": "This is a Blunder?!",
    "players": "??? (1604) vs. ryanyu10 (1506)",
    "opening": "Queen's pawn game (A45)"
}