{
    "moves": {
        "1. e4 e5": "Jenn prefers to reply with the Sicilian 1...c5, but I think a conversation between us about mini-tournaments led her to play this - I mentioned I was in a Ruy Lopez thematic.",
        "2. Nf3 Nc6 3. Bb5": "My preferred choice of move here is the Italian game 3. Bc4 but I've been having a lot of trouble against 3... Bc5. For that reason, I have decided to try the Ruy Lopez in recent times (as I have experience of playing against it).",
        "3... a6": "The most popular reply.",
        "4. Ba4 b5 5. Bb3": "I'm not used to seeing b5 so quickly because it forces the bishop to attack that f7 square so quickly, however I can't see how White can make use of it anyway.",
        "5... Nf6 6. O-O": "Putting the king away and preparing to put my rook into that e-file.",
        "6... Bc5 7. c3": "In this move, I'm preparing for d4 and allowing a retreat square for my bishop if I need it - I feel it is a strong bishop that I don't want to lose to Na5.",
        "7... d6": "Black adds extra protection to his e5 pawn while opening up a useful diagonal for his LSB.",
        "8. d4": "White attacks the centre with the pre-planned d4. In my short time playing this opening, it seems like White's intention is to get into a position similar to this and play d4. Although under-developed on the queen-side, White has a strong pawn structure and a lot of pieces are aimed towards Black's king-side.",
        "8... Ba7": "A GK computer inaccuracy as it recommends 8. Bb6. That would provide additional support to c7 and a5, if needed, and doesn't restrict the rook's view of the a-file... and it still has the view of the same diagonal.",
        "9. Be3": "I chose to develop my bishop to e3 instead of g5 to challenge on the a7-g1 diagonal, while strengthen my pawns grip on the centre squares.",
        "9... O-O": "Black puts his king away to safety by castling - this seems a very natural position to develop from a Ruy Lopez opening and one I feel comfortable playing... for now.",
        "10. Nbd2": "Developing as e4 seemed very weak after Black king had moved from that file - I also want to keep my LSB, so Na5 would allow his knight into c4.",
        "10... exd4 11. cxd4": "Exchange of pawns - Black is trying to relieve some of the pressure the pawns were applying on the centre.",
        "11... Na5": "Attacking my LSB which I feel is going to be essential for me so I need to keep it safe. It is also worth noting that this opens up the a8-h1 file, with tempo, for his own LSB.",
        "12. Bc2 Re8 13. Rc1": "Both sides have mobilised a rook onto half-open files - Black has his on the e-file and White on the c-file.",
        "13... Bb7": "Black is putting a lot of pressure on my pawn at e4 and it presses me into an inaccuracy next move with...",
        "14. e5": "An oversight from myself - I've forgotten about my bishop on e3. The bishop because vulnerable from either d5 or e5, and now I'm going to get doubled pawns on the e-file. I've just assisted Black in taking the centre. Hindsight is a wonderful thing, but I should definitely have played 13. Re1 (or even 14. Re1) to support my e3 bishop.",
        "14... dxe5 15. dxe5 Bxe3 16. fxe3": "Exchange of pawns and bishops leaves us with an open d-file and half-open f-file and I have no immediate control over either due to my knights. I also have some horrible double pawns on the e-file that are threatening the Black knight, however my LSB is more attacking with a sight over h7...",
        "16... Ng4": "Attacking both e-pawns, with e3 threatening a fork on my queen and rook. It was here that I noticed how passive most of my pieces were while Black was threatening to come at me from every angle. 17. Qe1 was an obvious move to defend e3 and move my queen from behind my knight... I don't want to be forced into an exchange.",
        "17. Nd4": "In an attempt to become more active, I move my knight into the centre and threaten the g4 knight. I've given up any attempt to save the pawns because I felt the e3 pawn was safe for now. I was going to respond to Qh4 with 18. N2d4 and felt I'd mobilised my knights better. My opponent and I exchanged chat during the game in which she admitted that she wanted to thought about playing 17... Bxg2. GK analysis shows up Qg5 which would have been utterly devastating for myself as White, especially against someone rated over 300 points more.",
        "17... Nxe3": "Black chose to take the e3 pawn and fork the White queen, rook and bishop. I was fairly certain here that I had at least a draw, but I have been known to get my analysis wrong. ",
        "18. Bxh7+": "Sacrifice No. 1: This leaves the king with three options - Kxh7, Kh8 and Kf8. Kxh7 is drawn immediately with a perpetual check. Kh8 gave me the most headaches trying to analyse but I was sure I could force a draw. I won't ruin your fun though, so I'll give you all a chance to look over it before I give you the line I saw. Lastly was Kf8 which I felt gave me very much a winning (if not, won) game.",
        "18... Kf8": "I know Jenn has said she will comment on the annotation, so I don't want to comment too much on her choices. I'll try to let her do that. However, when playing a player who is 300 points less, I would guess she didn't want to settle with a draw.",
        "19. Rxf7+": "Sacrifice No. 2: Black doesn't have a choice anymore and must take the rook, exposing his king to a White counter-attack. ",
        "19... Kxf7 20. Qh5+": "I think it is worth noting now that the knight on d4, pawn on e5 and bishop on h7 provide a very nice wall for White to keep the Black king refined in.",
        "20... Kf8": "20... Ke7?? 21. Qg5+ Kc7 22. Bf5+ Nxf5 23. Qxf5+ Ke7 24. Qe6+ Kf8 25. Rf1+ Qf6 26. Rxf6+ gxf6 27. Qxf6+ Kg8 28. Nf5... and White wins. Sorry it is long but most of that is forced. If Black chooses to play 21... Kf7/Kf8, White follows with 22. Rf1+ and Black will have to sacrifice a lot of material to avoid the many mating threats that White will have.",
        "21. Rf1+": "Sacrifice No. 3: The bishop on a7 is holding onto f3 to stop my queen returning for a check there... but more importantly, the knight at e3 stops Qf5+. 21. Rf1+ stretches the knight where he is forced take the rook and relinquish his grip on f5. However, other options are clearly inferior.",
        "21... Nxf1 22. Qf5+": "Black needs to play Qf6 to avoid checkmate - this line still ends in Black giving up a lot of material. It goes something like 22... Qf6 23. exf6 Nxd2 24. Ne6+ Rxe6 25. Qxe6... I think Black has to take the pawn because of the mate threat, which allows White to, effectively, finish the game with Bg8.",
        "22... Ke7": "The reason I think Jenn chose this even though it loses is because of my choice of moves. I have played her several times before and have played passive at times, and 18. Bxh7+ showed that I was quite willing to take a draw against my higher-rated opponent. Qf6 forces me to play on and press forth with my advantage... while, if I miss my mate in 3 combination, gives me a chance to take the perpetual check option for a draw (Queen checking between e6 and f5).",
        "23. Qe6+ Kf8 24. Qg8+ Ke7 25. Qxg7#": "And here is my first win (or even draw) against anyone rated over 1900, never mind 2000. I realise that I could easily have lost if my opponent had played 17. Qg5, but I'm pleased that I found the sacrifices need to draw/win the match and think I play reasonably well otherwise. I hope you enjoy the annotation and I look forward to reading your comments! :)"
    },
    "url": "https://gameknot.com/annotation.pl/three-times-a-sacrifice?gm=40397",
    "gameName": "Three times a sacrifice!",
    "players": "gcah2006 (1694) vs. jkedzie (2002)",
    "opening": "Ruy Lopez (C70), Graz variation"
}