{
    "moves": {
        "1. e4": "A Team Match. These are getting harder now that I'm getting closer to my true rating and facing opponents that are too. I open with the Open Game, as usual.",
        "1... e5 2. Nf3 Nc6 3. Bb5": "My favorite, the Ruy Lopez.",
        "3... a6 4. Ba4": "The Morphy Defense, and white replies main line.",
        "4... Nf6 5. O-O": "Still mainline. Black attacked white's center pawn on e4, and white leaves it en prise because it's a \"poison pawn\" as they say. If black takes it, bad stuff will ensue for black.",
        "5... b5 6. Bb3": "Black plays the Arkhangelsk variation (5. ... b5) driving back the white bishop.",
        "6... Nxe4 7. d4": "With black's 6th move we have transformed into the Open Lopez (more common is 5. ... Nxe4 6. d4 b5 7. Bb3 to reach this same position). Black has gained a pawn but his center is unstable and he cannot hold it.",
        "7... exd4 8. Re1": "Now black has gained two unanswered pawns, but his knight is pinned on e5.",
        "8... f5 9. Nxd4": "Black defends the knight and white regains one of the pawns, at the same time freeing the f-pawn to push forward to f3 to win the pinned knight.",
        "9... Qh4 10. g3": "Black threatened to win the pawn on f2 (10. ... Qxf2+; the knight on e5 is still pinned). White could have simply pushed the pawn with 10. ... f3? to save it, but then black has 10. ... Nxd4 and white cannot recapture on with 11. Qxd4??? because 11. ... Qxe1# is instantly decisive. So first, the vulnerability is protected and the black queen is driven off.",
        "10... Qf6 11. Nxc6": "White is threatening some mayhem with the possibility of Qh5+. Black would like to keep his queen on the kingside to defend against this threat. This seems like the perfect time to play with black's pawn structure, open a file aimed at black's king, and clear away a black defender. Besides, white is about to be ahead in material, so exchanges of pieces now favor white.",
        "11... dxc6 12. f3": "And now the pinned knight must fall.",
        "12... Bd7 13. fxe4 O-O-O 14. e5": "An interesting choice here. White could have played 14. exf5? which would be followed by 14. ... Bxf5 putting white's queen en prise. This is bad for multiple reasons. White is ahead by a piece for a pawn, but this is not a winning endgame advantage. White should try to exploit his material lead to expand that lead into a more decisive advantage before the endgame is reached. Hence, it's usually wise to avoid trading pawns when ahead by such a small margin. Further, the white pawn on e5 is now a passed pawn and will be a continuous thorn in black's side (or center) for the rest of the game. Finally, letting black get his bishop onto a strong square with tempo (the discovered attack against the white queen is also not a useful strategy. Hence 14. e5! is a very strong move and will play a pivotal role in this game.",
        "14... Bc5+ 15. Kg2": "Black develops with check. An excellent move. White's development is dismal, the price he paid to gain his small material edge.",
        "15... Qe7 16. Qh5 h6 17. Qf7": "Whit's queen assumes a strong post. The imminent threat is exchanging queens, which probably favors white more than black, though black may welcome the riddance of white's most formidable piece. There is also a threat against the pawn on g7 which, for now, forces black to keep his queen home to defend it.",
        "17... Kb8 18. Nc3": "I am not sure what black's intent was with 17. ... Kb8?!. It seems to serve no purpose, the king was not threatened on c8. More importantly, now the king is not defending the two black pieces on d7 and d8 which will soon come under fire.",
        "18... Rhe8 19. h4": "Restricting black's queen.",
        "19... a5 20. a3": "Bolt hole.",
        "20... a4 21. Ba2 Qxf7 22. Bxf7": "After chasing white's bishop into the bolt hole, black then sets him free by playing the queen exchange. Perhaps what black is hoping for here is reducing the pieces on each side, going after that e5 pawn, and settling in for a lazy endgame where white is up by a knight vs. 2 pawns, a tricky endgame that might go either way.",
        "22... Re7 23. Bh5 Be8 24. Bf3": "White's bishop is happier here on f3 than he was on b3 or on a2. Black's bishop is awkwardly placed.",
        "24... Bd7 25. Bf4": "White finally, on move 25, develops his last minor piece. The bishop finds a very happy home on f4, defending white's precious advanced passed pawn and looking down the diagonal at black's king.",
        "25... Re6 26. Ne2": "The white knight wants to sit on c3, but the c2 pawn is itching to get into this game, even if only briefly.",
        "26... Bb6 27. Rad1": "As predicted 10 moves ago (it took longer than I thought) the black pieces on d7 and d8 are now under fire. Further, the black bishop on d7 is pinned. If it moves, the black rook on d8 falls. This puts a direct threat against the black pawn on c6, though for now black's rook keeps the pawn safe.",
        "27... c5 28. c4": "Black opened up the long white diagonal from h1 to a8. White's bishop is sitting on this diagonal, so that is a dangerous move for black. White advances the c-pawn to pressure blacks pawns. It is undefended and black can win a pawn here, but that will triple and isolate his pawns on the half-open c-file and white's rooks and pieces will gobble them up one by one.",
        "28... Ba5 29. Nc3": "This may have been a mistake by white. Black might do all right with 29. Bxc3 30. bxc3 bxc4 since white's isolated c-pawn will shield those tripled black pawns from white's rooks. Maybe not though, white could attack them other ways.",
        "29... bxc4 30. Rd5": "Like this. As sweet as it is to attack a pawn, it's sweeter still to double rooks on the d-file",
        "30... Rb6 31. e6": "30. ... Rb6? was a blunder that will ultimately cost black the game, though it's hard to see that right now. White's pawn has sat on e5 for 16 moves, more than half of the game, biding its time, and now it's ready to pounce with 31. e6! which ultimately is the winning move. Black cannot capture it with his bishop: 31. ... Bxe6??? 32. Rxd8+ Ka7 33. Ra8#. 31. ... Rxe6? simply loses the rook to 32. Rxe6 and now black's bishop still cannot recapture. And yet, that bishop is en prise and white can win it easily. But white has bigger plans, big enough to throw away his entire queenside for them. It's interesting to note how much weaker this move would be if black's king were still on c8.",
        "31... Rxb2+ 32. Kf1": "Black gains a pawn and puts white in check. Worse, that pawn was the only defender of the white knight on c3, so black also wins that knight. It won't save him now.",
        "32... Bxc3 33. Rxd7": "White's rook on e8 is en prise now and black can win the exchange. White doesn't care, he is willing to throw it all away, so he charges ahead with 33. Rxd7! and now black is in real trouble. Not 33. ... Rxd7 34. exd7 Rd2 35. Rd1 Rxd7 36. Rxd7 and white is up a rook+2 bishops against 1 bishop and a few poorly placed pawns, an easy win for white.",
        "33... Re8 34. Rxc7": "The killing stroke. White gains a pawn, but it is of no consequence. Black's king is about to face a discovered check that will eliminate the only piece he has that can stop that pawn from promoting on e8.",
        "34... g5 35. Re7+": "Black thought he could threaten to capture the white bishop to deal with the check, but it only wins a little inconsequential material. White's pawn still promotes.",
        "35... gxf4 36. Rxe8+ Kc7 37. e7": "One square away. Black's king cannot approach: 37. ... Kd7? is met with 38. Rd8+ K-any 39. e8=Q. So black must try another way.",
        "37... Bxe1 38. Ra8": "Black has been looking at capturing that rook since move 32, so he finally does. Now the black king can approach the white pawn, but it's too late, e8 is protected and the pawn will promote. Black must look for another way.",
        "38... Rf2+ 39. Kg1": "Black might have almost found his other way. If white had played 39. Kxe1?, the continuation goes 39. ... Rxf3 40. e8=Q Re3+ and now black trades rook for queen. White could almost certainly still win that endgame, but it would be a long battle. Instead, white wins by declining the sacrificed bishop with 39. Kg1!.",
        "39... Rxf3 40. e8=Q": "Remember back on move 14 when I predicted this pawn would play a pivotal role. OK, when I typed that into the annotation, I knew how the game played out. But, it remains to be said, my decision in game to play 14. e5! was based on the expectation that the pawn would be pivotal. Incidentally, white has checkmate in 4 (actually 7, really, since black has a handful of spite checks). I didn't realize it in-game at this point.",
        "40... Rxg3+ 41. Kh2": "Black takes the first of his checks and now he's busted. What follows is forced (except the first two spite checks): 41. ... Rg2+ 42. Kxg2 f3+ 43. Kxf3 Bxh4 44. Rc8+ Kd6 45. Rc6+ Kd5 46. Qd7+ Ke5 47. Qd6#. Sure, black could try something else, like 41. ... Rg6 42. Rc8+ Kb7 43. Qd7+ Ka6 44. Ra8+ Kb6 45. Rb8+ Ka6f6. 46. Qb7+ Ka5 47. Qb5#. Anything else just loses faster."
    },
    "url": "https://gameknot.com/annotation.pl/throw-it-all-away?gm=24895",
    "gameName": "Throw It All Away",
    "players": "blake84120 (1991) vs. sirarthur (1909)",
    "opening": "Ruy Lopez (C78), Wing attack"
}