{
    "moves": {
        "1. e4": "This game is by no means perfect with mistakes from both sides. If you like sacks then there's plenty of them here. This has to go down as one of the most enjoyable games i've played just because of the way it was won. It just shows that some sacks are sound and others are just plain lucky.\r\nI know nothing of the Silician and don't like playing against it either but that's not what this is about.\r\nMy comments are from my perspective so feel free to add further comments if you wish. \r\nhope you enjoy the game, however scrappy it gets :)",
        "1... c5 2. Nf3 h6": "I'm not a fan of the Sicilian, but i know h6 is not very common. Not on move 2 anyway. Normally i'd expect Nc6 or e6, so h6 left me pretty optimistic. I suppose it stops me playing the knight to g5 or the bishop once it's developed but that does not concern me. Altho maybe it's just a waiting move to see what i'm going to do.",
        "3. d4": "I just play the Sicilian as normal.",
        "3... cxd4 4. Nxd4 Nf6 5. Nc3": "I have to protect the pawn.",
        "5... e5": "Chases off my knight",
        "6. Nf3 Bb4 7. Bd3": "I feel its more important to protect the pawn rather than block the pin by playing Bd2, so i play Bd3 instead.",
        "7... O-O": "Black castles leaving the e pawn unprotected.....",
        "8. Nxe5": "I could have and probably should have played Bd2 this time, with blacks next move most likely to be d5 after this. To complete the line 9. Nxd5 Bxd2  10. Nxd2 Nxd5 11. exd5 Qxd5 and it's even.\r\nBut i always like to be on the attack as you'll see, and i'll take risks to keep it that way.\r\nSo i took the e pawn with my knight, with the intention that when it's chased off by the rook, i'll sack it on f7.",
        "8... Re8": "Sure enough it is chased off. I could back it off and play Ng4!? but black just plays Nxe4 and gets the pawn back and also has the better position....",
        "9. Nxf7": "So i decided that i would continue my attack anyway.",
        "9... Kxf7": "King takes, although perphaps black could have played Bxc3  first, but it makes no real difference.",
        "10. O-O": "Castled to get my king to safety while i still could.",
        "10... Bxc3": "Exchange of pieces doubling up my whites pawns in the process.",
        "11. bxc3": "I have to retake. One advantage is that there are plenty of open files and diagonals for me to exploit and blacks king looks pretty vunerable.",
        "11... Nxe4": "Nxe4?? This is a very bad move. It gives white the piece back. After 12.Bxe4 Qf6 13.Qh5  g6 14.Bd5  Ke7 15.Qxh6 white is clearly winning. If black took the Bishop after Bxe4 then Qf3  wins the rook.",
        "12. Bc4+": "Fortunately for black and for the game in the end, i missed it and played Bc4 ?? throwing away the advantage. I was too busy concentrating on how to expose blacks king.",
        "12... Kf8 13. Qd5": "Threatening mate.",
        "13... Re6": "Blacks only real move.",
        "14. Ba3+": "Both my bishops on strong diagonals.",
        "14... d6 15. Rae1": "Bringing my rook across focusing on the strong e file which i intend opening at some point.",
        "15... Nf6": "Blacks only move really, and as a result is way behind in development.",
        "16. Qxe6": "Although i'll be material down, the game is actually egded in my favour.\r\nWith my queen under attack and while still wanting to exploit the black kings vunerability i decide to trade the queen for the rook and bishop to gain complete control of the e file.",
        "16... Bxe6 17. Rxe6": "I have to take with the rook and allows me to double up at some point too.",
        "17... Nc6": "Another option was Ne8 protecting the d pawn, but it's not much better than Nf6.",
        "18. Bxd6+": "Here i had the option of Rxd6 or Bxd6 . If i took with the rook i would be attacking the queen with the threat of a discovered check.\r\nI took with the bishop instead.",
        "18... Kf7 19. Rfe1": "I missed the oppertunity yet again to solidfy my advantage. I should have played 19.Re7  Kg6 20.Bd3  Ne4 21.Rxe4 and the position is alot better for white.\r\nI was too quick in moving though to spot this and doubled up the rooks instead. In effect this should have left the game in a stone cold draw after....",
        "19... Kg6": "Kg6.",
        "20. Bd3+": "Nothing else i can do unless i want to give black the advantage.",
        "20... Kf7 21. Bc4 Kg6 22. Bd3+ Kh5": "Kh5?? This changes everything. I guess with the material advantage black didn't want to settle for the draw. But it's back in whites favour after 23.R1e3 Qb6 24.Rh3  Kg4 25.Rg3  Kh4 26.Rxg7 Qb1  27. Bf1.....",
        "23. Be2+": "But i did not see this and continued checking to see where black was intending to put their king.\r\n\r\n(It has also been pointed out since publication that ''Instead of this, 23. Be7!? now, although not the best move, is actually still winning for white. White's other Bishop is better placed on d3 than e2. If after 23. Be7 Qb6 (not 23...Nxe7?? 24. R1e5 g5 25. Rxf6 when Black must give up his Queen to avoid mate.) 24. Bxf6 gxf6 25. Rxf6 Rg8 26. g3 Qd8 27. Ree6! and Black, again, has to give back his Queen.'' Thanks for agmac for pointing this out.\r\n\r\nWith Blacks knight covering e5 and my White squared bishop blocking the kings escape it would make sense and give the sack a purpose.\r\nhowever i was always thinking about black playing g5 and would have preferred blacks king on the g file rather than the h file, meaning that g5 isn't an option.)\r\n",
        "23... Kg5 24. Be7": "Running out of ideas i decided to try something crazy, which if you ever play me regulary you will learn to expect. Also you'll notice that i tend to be pretty ignorant towards defence. I'm all about attack, attack, attack, and as one last throw of the dice, i played Be7??\r\n'A good sacrifice is one that is not nesscessarily sound but leaves your opponent dazed and confused' - Rudolph Splelmann.\r\nThe main aim of this move was to divert the attention away from my attack and i didn't really need my bishop anyway.",
        "24... Nxe7 25. Bd3": "Blocks blacks king's escape route around the back.",
        "25... Nc6": "Nf5 is the move here giving black excellent chances to hold on for the win but....\r\nperphaps underestimating the strength of whites current attack, black maybe thinks that Nc6?? is sufficient.",
        "26. Re6e5+": "But after Nc6 mate is forced with another sack.",
        "26... Nxe5 27. Rxe5+ Kg4": "Black will get mated which ever square the king moves to.",
        "28. h3+ Kh4 29. g3+ Kxh3 30. Rh5+": "One final sack to finish the game.",
        "30... Nxh5 31. Bf5#": "Checkmate!\r\nI appreciate that this game is not the best for tactical awareness and probably could have been won easier, but it is worth mentioning that when sacrificing pieces, if you take too long thinking over whether the sack is sound or not your oppontent is going to catch on that you want them to take it which is why i didn't especially take the time over my moves and didn't nesscessarily play what was best. However i hope the final outcome makes up for all this , after all not every game is won when you're the equivalent of 13 pawns down :)\r\nThanks to Oinegue for playing and thanks to everybody who looks at my game.\r\ncomments are much appreciated, even if it's just about how bad my spelling is, lol"
    },
    "url": "https://gameknot.com/annotation.pl/through-the-eyes-of-a-serial-sacker?gm=6854",
    "gameName": "Through the eyes of a serial sacker",
    "players": "lamacuk (1680) vs. oinegue (1666)",
    "opening": "Sicilian defence (B27)"
}