{
    "moves": {
        "1. e4": "I lost this interesting KG game to Joanne, who is playing better against the KG. What is instructive is how White threw away good prospects against good defense.",
        "1... e5 2. f4 exf4 3. Bc4": "Standard KB Gambit position. Favored by Bobby Fischer.",
        "3... d6 4. d4 Qh4+": "Black decides to check, and the White King must move. This is all part of White's strategy, however, to tempt an attack which must succeed or the counterattack is very strong.",
        "5. Kf1 g5 6. g3": "White sacrifices another pawn.",
        "6... fxg3 7. Qf3": "Threatens f7 and protects the KR.",
        "7... Bh3+ 8. Nxh3 Qxh3+ 9. Ke2 Qd7": "Black is ahead, and wants to avoid risky complications after Qf7 ",
        "10. Bxg5 Nc6 11. c3 Bg7": "A good move.  Black threatens to take the QP with the Bishop since Black can fork if White recaptures.",
        "12. Qxg3 f6": "Pretty much necessary. At this point, White has a slight edge.",
        "13. Bf4 O-O-O 14. Nd2 Bh6 15. Bxh6 Nxh6 16. Qh4": "Qh4 is a strong move, forcing the N back.",
        "16... Qg7 17. Rhg1 Qf8 18. Raf1 Ng8": "Black wants to regroup. ",
        "19. Be6+": "White wants to create back rank threats. ",
        "19... Kb8 20. Bxg8": "Bxg8?! Here White gets careless, hallucinates an easy pawn win that does not exist. White should continue to pile on the pressure.",
        "20... Rxg8 21. Rxf6": "Rxf6?! was not what I intended, nor was it best. I forgot that Black could simply take the rook. ",
        "21... Rxg1": "Rxg1! Of course. Black gets 2 Rooks for the Queen and White's king exposed. ",
        "22. Rxf8 Rxf8 23. Qxh7 Rg2+ 24. Kd3 b6 25. b4 Rff2 26. Qh6 Rgxh2 27. a4": "?? Moved without looking, and this loses the Queen. Otherwise, White can probably draw with careful play.",
        "27... Rxh6": ""
    },
    "url": "https://gameknot.com/annotation.pl/throw-away-game?gm=22179",
    "gameName": "Throw Away Game",
    "players": "dmaestro (1554) vs. jstevens1 (1767)",
    "opening": "KGA (C33), bishop's gambit"
}