{
    "moves": {
        "1. e4": "it was classic start! ",
        "1... e5": "i did also move my King's pawn ahead, i wanted to battle for the middle of the desk",
        "2. Bc4": "he moved his bishop! he also wants the middle! ",
        "2... Nf6": "i attack his King's pawn",
        "3. d3": "now he defends his King's pawn by moving Queen's forward",
        "3... Bc5": "i develop my black bishop",
        "4. Bg5": "he attacks my knight, that was expected",
        "4... h6": "i want his bishop to get my knight",
        "5. Bxf6": "he does ",
        "5... Qxf6": "know i develop my queen, and the next move can be the last one",
        "6. f3": "but no, he is not a child i can win with such an easy checkmate, so, the game continues...",
        "6... d6": "i have my white bishop still not developed, moving the queens spawn to d6 i defend the King's spawn and open a way for my white bishop",
        "7. Nc3": "well, he also developing ",
        "7... Bg4": "what's there? free bishop, the game is going to end if gets my bishop",
        "8. Nd5": "well, attacking my queen, and then i mistake, next move ( K5d:c7) can turn things arround",
        "8... Qd8": "i know i can lose my bishop now, but it's better than losing my queen or rook",
        "9. Ne3": "but here i think was his first mistake, he had to take my bishop, hadn't he?",
        "9... Be6": "i want to change our bishops now, after my \"f\" spawn shifts to \"e\" diagonal, i can attack e4, the battle for the middle continues...",
        "10. Bxe6": "yes, he does everything i want, that's great!",
        "10... fxe6": "i get his bishop",
        "11. Nc4": "now if i move my queen spawn forward he gets my \"e5\" spawn for free",
        "11... Nc6": "so, i defend it",
        "12. c3": "he wants his queen to take part in the battle (Qd1-a4)",
        "12... O-O": "i make that move vain",
        "13. Nh3": "well, what was that? actually i didn't understand that move",
        "13... Qh4+": "but i did start attack, the battle for the middle sucks",
        "14. Ke2": "yes, he had to move his king, if he cross my queen's way with the \"g\" spawn, i get his knight, if he cross my queen's way with the knight, the game will be over, next move Qh4:f2#",
        "14... g5": "i don't want his (f) spawn to be there, so i move my \"g\" spawn ahead",
        "15. Qe1": "he knows that this condition is bad for him, he says let's exchange our queens, i answer no!",
        "15... Qh5": "i go back,that was only one move that i can left my queen alive",
        "16. Qg3": "here he makes my spawn absolutely useful, he just paralyze it",
        "16... d5": "i leave my \"e5\" spawn ",
        "17. Nxe5": "and he has it! that's what i wanted",
        "17... Bd6": "now i control his knight's movements",
        "18. d4": "and he also do not give up!",
        "18... b5": "no one could get the middle, but the right wing, is now the best area i can use for attacking the middle",
        "19. Kd3": "well, he wants to move his \"f\" pawn, but he couldn't do it before because of his kings position, now he can do it",
        "19... b4": "i don't like that \"c\" pawn, i want it to be out of the middle",
        "20. exd5": "he gets my queen's spawn, not a bad move, but...",
        "20... exd5": "i understood that now i have a little advantage, next move i begin my attack, of course, if he lets me",
        "21. f4": "i know i can not get his spawn, now, but i did expected this move",
        "21... g4": " so i reply by moving my spawn ahead to attack his knight",
        "22. Nf2": "he runs away, but at the same time attacks my spawn",
        "22... Bxe5": "now i sacrifice my bishop to get more advantage",
        "23. fxe5": "he still doing everything i want, he gets it ",
        "23... Qf5+": "now my attack does begin",
        "24. Ke2": "really cleaver, defending knight and the second line",
        "24... h5": "i double my \"g\" spawns defense ",
        "25. Rhf1": "that's was mistake i think, now i can continue my attack",
        "25... Qc2+": "Check!",
        "26. Ke3": "again mistake, i think it could be better to move on first line",
        "26... bxc3": "Together to victory!",
        "27. bxc3": "A great mistake! FATAL MISTAKE!!! ",
        "27... Qxc3+": "Check, Sir!",
        "28. Ke2": "i think it would be better if he close down my queen with his knight, but ...",
        "28... Nxd4+": "now,no way back from this position, Check!",
        "29. Kd1 Qc2+ 30. Ke1 Qe2#": "CHECKMATE! we could and this game in a just 30 moves, it was interesting game, which made me think a lot! "
    },
    "url": "https://gameknot.com/annotation.pl/tiago-vs-aleksey-glazyrin-2011?gm=37979",
    "gameName": "Tiago vs Aleksey Glazyrin 2011",
    "players": "tomfc (1202) vs. alex_krasnovodsk (1485)",
    "opening": "Bishop's opening (C24), Berlin defence"
}