{
    "moves": {
        "1. e4": "B33 Sicilian,\n\nLike most of the time I play c5 vs e4; we will see that Sicilians are full of tricks and I will be in a position I do not appreciate a lot but eventually win by a slight white's mistakes.\n\n",
        "1... c5 2. Nf3 Nc6 3. d4 cxd4 4. Nxd4 Nxd4": "Here I play the worst move that black could play! \nAccording to chessdatabes this move leads to white's wins in 66% out of 100 games...I must say I realised how bad it was later on: Egold will set a cental Queen and many possible traps.",
        "5. Qxd4 d6 6. Bc4 e6": "not convincing. e5 is much better.",
        "7. Nc3 Nf6 8. Bg5 h6 9. Bh4": "Whites are far more developped than blacks and can castle on both sides. ",
        "9... Be7 10. O-O-O": "now I realised how late I was... the possible plans for whites are tremendous...\n\n",
        "10... a6": "11... 0-0 was better.",
        "11. f4": "strongest line for white.\n(then 12.Bxf6 Bxf6 13. e5 Bxe5 14. fxe5 etc.)",
        "11... b5 12. Bb3": "(Bd2 also)\nI started to breath better: My plan is Bb7 to get a hold on the center",
        "12... Bb7 13. Bxf6": "e5 was an ok-move too but my opponent was focused on d6 and he had 2 clear lines in mind:\nif I play b*f6 he would go for d6 (1 pawn won)\nif I play g*f6, my king's side is messed forcing black to play with a central king; not easy to deal with.",
        "13... Bxf6": "I decided to get ride of 1 pawn and the powerful central white queen. I am betting on my light squares bishop (threatening g2) and some little tempos.\r\nWith the other line gxf6, I'd keep d6 with a central king and a passive position; whites will eventually win.\r\n=> Realistically, any strong player would have kill the game easily from here.",
        "14. Qxd6 Qxd6 15. Rxd6": "From now on the tempo is mine, egold probably realised too late that he had no advantage on the game neither on the center. This is the drawback of blitz attack without a long term plan.",
        "15... Bxc3": "I give the bishop for a knight to hit e4 and threat g2.",
        "16. bxc3": "Score is therefore even.",
        "16... Bxe4": "egold surprised me with the coming possible combination:",
        "17. Bxe6": "...Bxe6. and the trap his obvious (17...fxe6 18 Rxe6 ...19 Rxe4) nicely thought but I really did not want to kill my light squares bishop for the moment and take g2.",
        "17... Bxg2": "I decided to clear the board a bit and see what could happen If i play King e7...\nat this stage I prefer my pawns structure even if once again this is an even game.\n",
        "18. Rg1 Ke7": "I am offering here a clear choice to egold: a rook or a bishop?\nMy king does not suffer any danger.\n",
        "19. Rd2": "white's Rooks have a little more activity. My aim was to avoid a silly mistake in the endgame. Besides this, I still think a win is possible as I wanted to win against a 1600 \n",
        "19... Kxe6 20. Rgxg2": "King e6 could look weird for some players but I planned to bring my King on g7 as we already know the targets of whites ( a6 and f7) \n even if f7 is pinned, it would never be an issue.",
        "20... g6": "preparation of a safe place (g7) for the king.",
        "21. Rge2+ Kf6 22. Rd6+ Kg7": "Here is the King on g7. \nEgold hasn't made many mistakes so far. His plan to pressure on a6 is good.",
        "23. Re7": "but his heart balanced between a6 and f7... ",
        "23... Rhf8 24. Rdd7": "expected\n",
        "24... Rae8 25. Kb2 Kf6 26. Rxe8 Rxe8 27. Rd6+": "egold has still the good move. \nVariation was (27. Kb3 Re2 28.h3 Re4 29.Rd6  Re6 30.Rxe6 fxe6 ...balcks win as f pawn'd fall)",
        "27... Re6": "I prefered to offer a honest opposition and a draw.",
        "28. Rd2": "for the first time of the game egold pulls back, leaves the center and will be less sharp in the next moves.",
        "28... Re4": "28. Kf5 is ok too and will threat f4 to get tempo on k's side. \nI must say that I used to play blitz and I expected 29.Rd6  ... I'd have answered 29... Re6...etc.",
        "29. Rf2": "! surprising bad defensive move at this stage of the end game. \nI still don't know why I didn't take f4. I guess  I was afraid of my weak queen's side. Also I just noticed that his king his trapped and can not escape. (30.a4! Rxa4 ... / 30. c4! Rxc4 ...) so I decided to keep my rook and planned f7-f5...",
        "29... Kf5 30. Kb3": "Kb3! useless nevertheless it warns me that if I want to exchange, egold will rush on a b pawns. ",
        "30... Kg4 31. a3 f5 32. Rg2+": "I had an advantage with the f pawn an active king even if egold destroys my background: a6, g6 and possibly h6",
        "32... Kxf4": "f passed-pawn.",
        "33. Rxg6 Ke3 34. Rxa6": "egold goes for a-pawn while f-pawn has a motorway in sight.\nother line:\n34. Rg3  Ke2 35.Rg2  Kf1 36.Rd2 f4 37.Rd4 Rxd4 38.cxd3 f3 39.d5 f2 40.d6 Ke1 41.d7 f1=Q 42.d8=Q  demonstrates that the game was tight.",
        "34... f4 35. Rxh6": "h is down aswell and f has still a long way to go. Here we must thank the tools offered by gameknot to analyse out games because I did analyse this position to avoid miscalculations.",
        "35... f3": "36. Rh3 won't help because 36 ... Ke2  etc 0-1.\n\negold was too hungry. We know that his rook has to be sacked soon.",
        "36. Rf6": "notice: h4 is still not impossible (but a4 and c4 playable). \nMy Rook keeps the white king in safety. I can not stop thinking about the so called cold war and dissuasion (This rook on e4 would not move anymore)... I was lucky because 28... Re4 was only supposed to threat f4.\n",
        "36... f2 37. h3": "whites should have abandoned.",
        "37... Ke2 38. c4 bxc4+": " (if 38. ... Rxc4  39.Re6  Kf3 40. Rf6  Rf4) \n0-1.",
        "39. Kb4": "King has finally a path but that's too late for whites. \nI will have to stop a and h pawns meanwhile to protect my c pawn,to attack c2.",
        "39... f1=Q 40. Rxf1": "forced",
        "40... Kxf1 41. a4": "black's plan:to bring the king to d2 asap.\nwhite's plan: to try to bring a pawn and take back's c pawn.",
        "41... Ke2 42. a5 Kd2": "my opponent had no more reasonable plan",
        "43. a6 c3+": "This is the last convincing move.\n\negold had a terrible dilemma: keep c2 or support a6 to reach a8: insoluble."
    },
    "url": "https://gameknot.com/annotation.pl/tight-sicilian-appreciate-end-game?gm=3601",
    "gameName": "Tight sicilian - appreciate end game",
    "players": "egold (1597) vs. ukuyo (1560)",
    "opening": "Sicilian (B32), Flohr variation"
}