{
    "moves": {
        "1. e3": "I start off slowly with a single move forward. It'll release my bishop and queen to open a can of whoop ass on Bird.",
        "1... e5": "Bird fires stright back with a big pawn push. No real concern at this time.",
        "2. Bc4": "I move into an open position to give attacking options, I expect him to threaten it with his pawn currently on B7",
        "2... d5": "Aye, well, the old boy has played a good move there and has killed off my attack. I cannae take that pawn because his queen will eat me.",
        "3. Bb5+": "I move in for a cheeky check. Try and convince him (and myself) that I can play an attacking game.",
        "3... c6": "It was a mistake.... I anticipated this move but never really thought about the consequences.",
        "4. Ba4": "In a panic and running. Here was another mistake and I'll be punished for it.",
        "4... b5": "I'm buggered.",
        "5. Bb3": "Out of harms way for now but I'm pinned here and he knows it.",
        "5... Be6": "Not really sure what he's upto, but I'll try and bait his bishop into a trap.",
        "6. h4": "I've opened a route for my wee castle to get out if needed, Birds speciality is nipping down the side and cleaning out your back corners. ",
        "6... c5": "I see what he was doing now but its too late to do anything about it. I'll try a move away from that area of the board to try and distract him.",
        "7. Nf3": "Genius",
        "7... c4": "Hmmm.... he obviously has the concentration of a bear. Looks like I'm buggered now, but  I think I can hold him off for a bit and get some reinforcements up.",
        "8. Ng5": "Have some of that!",
        "8... Bc8": "He's running scared. Its really the move I should have made with my one ages ago!",
        "9. Qf3": "I really just wanted more options in the middle of the field. I think I might be able to rescue that bishop.",
        "9... f6": "Oh, thats right, I've got a pony in no-mans land. Christ i'm useless.",
        "10. Nh3": "Take it back a bit and hide it. Now i'm expecting my bishop to be nailed.",
        "10... e4": "Again, no. He's gone for the big guns. ",
        "11. Qg3": "A cheeky shimmy see's my queen out of the way. I now have a disturbing feeling that I'm not only on the back foot, I don't have any shoes on either!",
        "11... cxb3": "Ah well, at least it's out of the way and I can concentrate on another attack now.",
        "12. axb3": "The gentlemanly thing to do!",
        "12... Bd6 13. Nf4 Bd7 14. Qxg7 Bxf4 15. exf4 h5 16. Qxh8 Be6 17. Nc3 b4 18. Nb5 Qb6 19. c4 dxc4 20. Qxh5+ Bf7 21. Qf5 Ne7 22. Qxe4 Bd5 23. Qh7 Qxb5 24. d4 cxb3 25. Bd2 Bg8 26. Qg7 Qd3 27. Bxb4": ""
    },
    "url": "https://gameknot.com/annotation.pl/time-for-a-beatdown?gm=12679",
    "gameName": "Time for a beatdown!",
    "players": "blacky173 (1025) vs. bird45 (1108)",
    "opening": "Amsterdam attack (A00)"
}