{
    "moves": {
        "1. d4 Nf6 2. Nf3 c5 3. c3 e6": "This is where this mini-tournament started. I'm not sure what this opening is called.",
        "4. Bg5 Be7 5. Qa4": "Attacking early on",
        "5... O-O": "Making myself able to play d5, fighting for the center. ",
        "6. e3": "Opening an opportunity for the LSB to help attack blacks king-side.",
        "6... b6": "Opening the a8-h1 diagonal for my LSB but I think this may be an inaccuracy because it allows an attack by white on my king-side. Maybe d5 is better enabling black to fight for the center and giving white's LSB less room to maneuver. I completely missed white's responding tactic.",
        "7. dxc5 Bxc5 8. Qh4 Be7 9. Bd3": "Now white is applying some pressure to my king-side and I need to play careful to avoid getting crushed.",
        "9... g6": "Only move I could find that prevents immediate mate.",
        "10. O-O Ba6": "Trying to trade my bad bishop for his active one.",
        "11. Rd1 d6": "I didn't trade because I saw a combination for white that I can't currently find. I thought that the rook would be active and would cause me trouble but I think I should've and saved d6 or d5 for later. d6 prevents Ne5 and allows black to add another defender to the knight on f6. Also possible is a future Nc5 attacking the bishop but that never happens.",
        "12. Be4 d5": "Forced.",
        "13. Ne5": "I thought for quite a long time on this move and I ended up playing...",
        "13... Nbd7": "Nbd7. A move making me lose a piece. I'm not sure what I should've done instead. My pieces are all either stuck doing nothing or defending. Any suggestions? I'm not sure if Nbd7 was a blunder in the end because it freed up my king-side and allowed my pieces to be freer but it made me down 2 points in material. Was it? What should I have done instead?",
        "14. Nxd7 Nxe4": "I didn't know what to do but decided on taking the bishop. Am I missing a tactic?",
        "15. Bxe7 Qxd7 16. Bxf8 Rxf8 17. f3 Nd6": "Planning next move to be Nc4 or Nf5.",
        "18. b3 Nf5 19. Qf4": "I thought long and hard for a move better then Qd6 with a queen trade and for awhile couldn't find one but then saw...",
        "19... Qb5": "The interesting Qb5. Qe2 being my next move. 20. c4 dc 21. bc Qb2 22. Nd2 and the position is okay for white. 20. c4 dc 21. Qxc4 Nxe3 22. Qxb5 also seems okay for white or 21... Qxc4 22. bc Bxe4 which also seems okay for white.",
        "20. e4 Qe2 21. Nd2": "Qd7 would've been better.",
        "21... Ne3 22. Qg3": "Stopping Qxg7# but allowing Nxd8",
        "22... Nxd1": "And white resigns. A good game with blunders by both sides. Please comment and rate!"
    },
    "url": "https://gameknot.com/annotation.pl/tinker101s-mini-tournament-i?gm=51109",
    "gameName": "tinker101's mini-tournament I",
    "players": "mcmf1212 (1635) vs. tinker101 (1502)",
    "opening": "Queen's pawn game (A46)"
}