{
    "moves": {
        "1. d4 d5 2. Bf4 f5": "A strong move, in my opinion, rarely played, against which I am not really prepared. ",
        "3. Nf3 Nf6 4. Nbd2 e6 5. e3 Bd6": "Now the challenge I expect in this kind of opening. ",
        "6. Ne5": "I like this move. Specially when the black knight is on f6. ",
        "6... O-O": "Normally I play the pawn in g4, but now... and to prepare it with h3 is delaying my developement. ",
        "7. Be2": "That leaves me behind in my plan to castle queenside, in order to be free to attack his kingside. But you can't have it all. That darn pawn in f5 is a good soldier!",
        "7... Nbd7": "Black's compressed power is growingly slowly. But with this move, he have to think about what happens if he moves the c pawn (say c5) and my knight jumps to f7, since his bishop is undefended. Nothing definite, still. ",
        "8. g4": "You play for a win. Even with a stronger opponent. ",
        "8... fxg4 9. Bxg4": "I'm pretty sure he didn't expect this planned continuation. Obviously, if I take with the knight, the following exchanged would have been in black's favour, so I opted for losing the nice bishop's pair  but keep the initiative on the g column. A strong attack, with its counters. ",
        "9... Nxg4 10. Qxg4 Nf6 11. Qg2": "Here the queen is safe, and prepares to put pressure on g7.  ",
        "11... Ne4 12. Rg1": "Of course. Running. ",
        "12... Qf6 13. Ndf3": "Here the first mistake. I had to exchange the knight and take the pawn. Good for me. I played the knight thinking about anything to \"brake\" black's defences. Black overlooked Bb4+, and I can't play c3 (Nxc3 with fork to follow). True, I planned to move theking just to e2, overlooking the dangerous b6 (for Ba6+).",
        "13... Bxe5": "This move actually helps me. But it is hard to decide which is the best piece to  retake. ",
        "14. Bxe5": "It can't be bad. Of course, if QxN, Qxg7#",
        "14... Qg6": "Oh, yes. So I have to lose a tempo exchanging? No way, sir. You'll lose that time. ",
        "15. O-O-O": "Preventing any possible hit on c2 but, specially, RxN... but I overlooked",
        "15... Qxg2 16. Rxg2 g6": "It is interesting to see if white's compensation is enough after RxN. ",
        "17. Rdg1": "I just blundered again. But it is not easy for white to breack the barrier without all his forces. ",
        "17... Rxf3 18. Rg2xg6+": "Desperation. ",
        "18... hxg6 19. Rxg6+ Kf7 20. Rg7+ Ke8 21. Rg8+ Kd7": "NOw black thinks he is going to escape to c6. But I prefer to leave his pieces just as they are, because they are very cramped. So may be a hope.",
        "22. h4 Rxf2 23. b3 Rf1+ 24. Kb2 Re1 25. h5 Rxe3 26. h6": "And here, my opponent slipped the rook to f3 instead ofh3. What do you think? Could white have survived this? Thank you for reading, I hope you enjoyed it. ",
        "26... Rf3 27. h7": ""
    },
    "url": "https://gameknot.com/annotation.pl/titans-fight?gm=50350",
    "gameName": "Titans fight",
    "players": "damalfi  vs. andigre ",
    "opening": "Queen's pawn, Mason variation (D00)"
}