{
    "moves": {
        "1. Nf3": "Hi all! This is a game from an ongoing mini-tournament that I just had to annotate. The tactics and complications are simply too good to pass up! Enjoy!\n",
        "1... d5": "This was a thematic mini-tournament starting with just 1.Nf3, so almost any opening is open season through transposition. I'm not going to spend too much time on the opening itself, both because it's quiet and because I'd just end up saying 'we could still transpose into...' a lot.\n",
        "2. c4 c6 3. b3 Bf5 4. Bb2 Nf6 5. g3 Nbd7 6. d4": "We've arrived at a sort of Slav-defense-looking position.\n",
        "6... e6 7. Bg2 Bd6 8. O-O Qc7 9. Nc3 h5": "Aha! After a quiet opening, Black fires the first shot, announcing his intention to break into the White King's position by force. This is probably the most common strategy to break a castle with a fianchettoed Bishop, when a Bishop-Queen battery isn't available to force a trade, like here. Another option would be the immediate ...e5 break, followed by shifting the Queen to d7, but I like this better anyway. More style.\n",
        "10. Nh4": "It's much more common to block this with h2-h4, but that leaves White's g3 pawn somewhat weak and presents a huge invitation to Black to play ...Ng4. The text frees the f-pawn to move and threatens to trade off Black's LSB--a critical piece for the castle assault.\n",
        "10... Bg4": "?! This does not prevent the exchange, so I'm unclear what the point was (not that 10...Bh7 looked particularly promising right away). However, it does force White to weaken his castle to get the trade done...\n",
        "11. f3 g5": "!? Black wastes no time in pressing the attack! There's suddenly a lot of firepower pointed at g3...\n",
        "12. fxg4 gxh4": "This got complicated awfully fast. Black is threatening to win both White pawns, and lines to the WK are about to open. Look through the main variations: White suddenly has no clear way to maintain material equality! (A) 13.gxh4 Bxh2+ 14.Kh1 hxg4 looks terrible. (B) 13.gxh5 hxg3 [1] 14.hxg3 Rxh5 or [2] 14.Kh1 Rxh5 or [3] 14.Qd3 Rxh5 don't seem to be any better, and at any moment Black will castle long and bring the other Rook into play on g8 or h8. So what is White to do?\n",
        "13. e4": "!? White's biggest difficulty was the pawn on e2 blocking his Queen and Knight from getting to the kingside. With pawns hanging already, White decides to simply throw another one at the problem to gain some space and activity. What was already a complex situation has gotten even more unstable.\n",
        "13... dxe4": "This seems to be indicated. Anything else allows White to win a piece for several (at least 3!) pawns with 14.e5, which, while Black would still have a strong position, diffuses the attack somewhat. Two quick examples in that line (please excuse me for not writing out *all* the variations!): (A) 13...hxg4 14.e5 hxg3!? 15.exd6!? gxh2+ 16.Kh1 Qxd6 seems very strong for Black despite the loss of the Bishop, or (B) 13...hxg3 14.e5 gxh2+ 15.Kh1 (15.Kxg2?! Bxe5+ 16.dxe5 Qxe5+ 17.Kg1 hxg4) 15...Bxe5?! (or 15...hxg4 or 15...Nxg4) 16.dxe5 Qxe5 softens the Black offensive but he will have good endgame chances with his unopposed kingside pawns.\n",
        "14. Nxe4 Nxe4 15. Bxe4 hxg3 16. Qf3": "!? The WQ *must* enter the fight if White is to get some counterplay. At this point, there's little White can do about the advanced g-pawn, so he sacrifices h2 in order to put counterpressure on f7 and activate the Queen. Also possible was 16.h3 hxg4 17.Qxg4 f5 (there isn't much better, as 17...O-O-O 18.Rxf7 Rdg8 19.Qxe6 looks very good for White all of a sudden) 18.Qg6+ Kd8. (Black mustn't slip up and play 18...Ke7?? because 19.Qg7+ wins the Rook).\n",
        "16... gxh2+ 17. Kh1": "This was the reason for choosing 16.Qf3 over 16.h3. The WK now gets to hide out on a light square behind a Black pawn. The pawn is nasty-looking, but with no Black LSB on the board and his own Bishop on the h1-a8 diagonal, White's King is actually pretty safe here.\n",
        "17... O-O-O": "There's no good way to save the f7 pawn, so Black gives a pawn back in favor of connecting his remaining kingside passers.\n",
        "18. Qxf7 hxg4 19. Qxe6 g3": "I think a Rook move might have been better here, perhaps 19...Rhg8. It's not like h2 is in any danger, and it would be good to get the Rook off the a1-h8 diagonal, even it it's not in any immediate danger.\n",
        "20. c5": "White has converted his momentary safety in the shelter of the Black pawns into sheer aggression, trying to force the Black pieces into less consolidated positions and simultaneously free his own Bishops.\n",
        "20... Bf4 21. d5": "Kicking the Rh8 and threatening to push d5-d6, winning the Bf4.\n",
        "21... Rde8": "!? Just as White did earlier, Black responds to threats by steadfastly ignoring them in favor of making threats of his own. Note that this doesn't prevent 22.d6 in any way--it just makes the resulting variations that much harder to calculate.\n",
        "22. Qg4": "?! White decides he's willing to lose the important LSB in order to win an exchange. By taking the Rh8 off the board, he stands a chance of playing an eventual Kg2 and picking off the advanced Black pawns.\n",
        "22... Rxe4": "?! Black did actually have a choice about accepting the trade: attempting to get out of it with 22...Rhg8 appears to fail because the Bf4 is hanging, but further examination shows an escape: 22...Rhg8 23.Qxf4 Rxe4 24.Qxe4 g2+ 25.Qxg2 Rxg2 26.Kxg2 cxd5 and the resulting slugfest of an endgame with RRB vs QN is sure to be exciting. Not that the text is boring, of course.\n",
        "23. Bxh8 cxd5 24. Qg8+": "White sees a lot of barely-defended Black pieces in the middle of the board--so he'll try to remove the defenders (here, the Queen and the d5 pawn).\n",
        "24... Qd8 25. Qxd5 g2+": "??! The intention here is plain: Black's Rook has precious few places to go where it will be of use, since the Bf4 is hanging and if it falls, so does the pawn chain. So Black sacrifices one of his passers to draw the WK into the open and give the Rook someplace to go with tempo.\n",
        "26. Kxg2 Re2+ 27. Kh1": "Certainly not inviting a trade with 27.Rf2 or marching into the open with 27.Kf3, as straying from h1 too far would tie the White Rooks down to defense. As the endgame approaches, White cannot afford to have passive pieces--the Ra1 is problematic enough!\n",
        "27... Qxh8": "This is a nice tactical maneuver--it seems as though Black has kept a Knight and Bishop for the Rook, since 28.Rxf4?? Qxa1+ gives Black an easy forced mate. White must continue to play carefully, but despite all the Black pieces on the kingside and no White pawns to deflect them, there's still no obvious way for Black to force his way in!\n",
        "28. Rad1": "But the right move for White is easy to find. This Rook was the problem, and was also his least active piece, languishing in the corner all game. Now Black has no satisfactory way to defend both the Knight and the Bishop, and must lose one.\n",
        "28... Qe8": "This is the best play, I think. Black defends the Knight and looks threateningly at e1, which might tempt White to play 29.Qxd7? Qxd7 30.Rxd7 Kxd7 31.Rxf5 where material is even but Black effectively has an extra piece, since White's King is utterly trapped. Instead, 29.Rxf4 Re1+ 30.Rxe1 Qxe1+ 31.Kxh2 is perfectly safe for White, and he should win with a Rook and pawn against a Knight.\n",
        "29. Rxf4 Re5": "! Black finds a nice alternative to 29...Re1+. This wins him back a pawn, narrowing the gap between the two armies, although White's twin Rooks should still prove decisive.\n",
        "30. Qf3": "There were many places for the Queen to go, but this seems like the best. After 30...Rxc5 (not 30...Nxc5?? 31.Rf8 winning the BQ) 31.Kxh2 Rc2+ 32.Kg3 Rxa2 Black must be very careful not to get trapped by the heavy White pieces. For example, 33.Rc4+ lays a nasty trap; if Black tries to stay out of the center with 33...Kb8? 34.Rxd7! picks up the Knight for free (if 34...Qxd7?? 35.Qf8+! and mate in one).\n",
        "30... Rxc5 31. Kxh2 Rh5+": "Planning 32...Qg6+ to avoid the Rf8 threat and hopefully keep White in check as long as possible.\n",
        "32. Kg2 Qg6+ 33. Rg4 Qc2+ 34. Kg3": "?? Oh, White makes a horrible mistake that brings a disappointing end to this exciting game. Correct was 34.Kg1, where Black no longer has any checking threats (34...Qh2+ 35.Kf1 seems a bit fruitless, though Black can force a Queen trade if he likes (not that he should)) and now it's White's turn to bring on the hurt. Note that the immediate 34.Kf1?? loses a Rook to 34...Rf5! 35.Rf4 Rxf4! 36.Qxf4 Qxd1+.\n",
        "34... Qh2#": "That's all she wrote! I hope this game proved entertaining and/or instructional to at least a few of you. Many thanks to acrai for the exciting game! Comments on the analysis or the game itself are always welcome. Thanks for reading!\n"
    },
    "url": "https://gameknot.com/annotation.pl/to-hide-a-king-complications-in-the-reti?gm=46636",
    "gameName": "To Hide A King: Complications in the Reti",
    "players": "bwaa (1724) vs. acrai (1726)",
    "opening": "Reti opening (A09)"
}