{
    "moves": {
        "1. e4 e5 2. Nf3 f6 3. Nxe5 fxe5": "?? Normally, you would think that this moves wins a piece and gives you the advantage.  As it turns out, this is the losing blunder as it will eventually lead to an unavoidable mate.",
        "4. Qh5+": "So, he decides to kick things off by placing me in check.",
        "4... Ke7": "!? At the time, I thought that this move was forced, but I was still a beginner then.  As it turns out, best was actually 4...g6 because this will wind up exposing my K, this time.  The K should have stayed on e8 because it was safer there.  No matter what, blacks next move will be the same as he is going to win a pawn by placing me in check.",
        "5. Qxe5+ Kf7": "Forced.",
        "6. Bc4+": "Knowing that 6...Kg6 will be forced, this was a conditional move.  And, he will keep setting conditional moves, throughout the game.",
        "6... Kg6 7. Qf5+": "At this point, I am already starting to feel the pressure.  ",
        "7... Kh6": "Forced.",
        "8. d4+": "I did not even see this discovered check.",
        "8... g5": "Once again, this move is forced.",
        "9. h4": "In this position, my opponent is trying to win another pawn by placing me in check, and he will succeed in doing so.  In addition, this move threatens an immediate mate, as we will see shortly.",
        "9... Be7": "At this point, I am only thinking about development, but it's already too little and too late.",
        "10. hxg5+": "Now, black does it.  He places me in check by taking my pawn.  In addition, there's way more to this then meets the eye.  Cmethan even pointed out that it was mate in one.   In this position, how is mate inevitable?  10...Kg7 (forced), 11.Qf7#, so I resigned.  There are two morals to this story.  The first one is what this opponent told me.  It is more important to develop early and control the center then to take a piece with a non developing move.  The idea being is that it is usually a bad idea to develop the f pawn early in the game since it is a non central pawn.  The second lesson, but more importantly, is what Jack Stockel taught me last Friday.  Sometimes, \"To take is a mistake\", and your opponent does not just blunder away material.  Until recently, I assumed that my opponents always had a bad reason for giving things away, so I figured that I just knew their week spot.  And, I also thought that I was taking advantage of their weakness, but that is not always the case.  More often then not the opposing player usually has a good reason for sacrificing material, so they are not unsound sacrifices.  It is normally done to set the opponent up for disaster.  So, making a capture like this, is underestimating him or her.   "
    },
    "url": "https://gameknot.com/annotation.pl/to-take-is-a-mistake?gm=50699",
    "gameName": "\"To take is a mistake\".",
    "players": "cmethan (1168) vs. jkarp (998)",
    "opening": "Damiano's defence (C40)"
}