{
    "moves": {
        "1. e4": "I have never had very good results against the sicillian when 2..e6 has been played so decided to learn some book against it which i employed with good effect here. I am sure there is room for improvement with the black handling of this line as what was played allowed me a pretty finish.",
        "1... c5": "Standard Start",
        "2. Nf3": "Natural and considering is played by most of the worlds top GM's has to be right",
        "2... e6": "Against me this has always been a good move as i am never comfortable with the bishop coming to b4.",
        "3. d4": "Again if it is good enough for the worlds best i should play it.",
        "3... cxd4": "Natural",
        "4. Nxd4": "Unlike if black plays d6 i do not have the choice of Qxd4 as Nc6 is just good for black.",
        "4... Nc6": "Challenging the centre got to be right for Black",
        "5. Nc3": "Instead of the text c4 is a choice but i feel strongly that black gets too much time to counter attack if played so i feel this is best.",
        "5... Qc7": "This move i feel is not quite as good as Nf6 further challenging the centre but Qc7 does prevent e5 at some point so has merit.",
        "6. Be2": "Be2 time to get castled.",
        "6... Nf6": "Got to be best though i feel the move before is better because then can be combined with Bb4 before i castle.",
        "7. O-O": "Now Bb4 does not have as much bite.",
        "7... Nxd4": "I understand this move but also question it. White is castled and ready to start attacking. Black has three pieces out but is not ready to castle so the exchange to me is wrong. Bc5 or Bb4 seems more natural.",
        "8. Qxd4": "Obviously the only move",
        "8... Bc5": "The point of the previous move so he can castle with tempo.",
        "9. Qd3": "Not a happy move for the queen but from here she has a lot of options and i am ready to connect my rooks",
        "9... O-O": "Natural and best",
        "10. Bg5": "I was not sure what was best here. I considered the move Be3 and if taken would take with my f pawn to free up my rook and was not convinced i could make it pay.",
        "10... Qe5": "Good move making my last look silly. Qg3 was a plan but i do not want the queens off the board.",
        "11. Be3": "I wanted to play f4 but that is illegal so i had to retreat after his accurate move as taking the knight achieves nothing.",
        "11... b6": "defending and preparing to develop his bishop which is natural and good",
        "12. f4": "Got to be best. If i am going to get anything in this position i must strike now while his pieces at not on their best squares his rooks are not connected and his bishop has not come out yet.",
        "12... Qc7": "I think best for him was BxB followed by Qc5 swapping off the queens",
        "13. e5": "E5 has to be right as leaves room for the Knight to go to e4 and if Nd5 i take and his pawns are split and isolated with Rad1 to follow he would struggle to hold on to the pawn.",
        "13... Bxe3+": "This seemed somewhat suspect as he is exchanging his only active pieces and i was happy to see this.",
        "14. Qxe3 Ne8": "Only move. Again Nd5 would have been suspect as the d pawn would end up on d5 and the game would be decided by whether he can defend it enough whilst defending against the threats to his king.",
        "15. Bd3": "Pointing in the right direction.",
        "15... g6": "I think he should play Qc5 to get off the queens which i know is not great for him but at least he is not being mated.",
        "16. Rf3": "Ferrying more pieces into the attack. His kingside is in big trouble he only has one active defender and all my pieces are on the way to attack.",
        "16... Ng7": "This seemed natural but after my next it can clearly be seen that his king has severe problems that Qc5 would solve but at the cost of the d6 square and probably the pawn on c5 but it would be a fight.",
        "17. Ne4": "The gaping hole on f6 is very inviting. and preventing Qc5",
        "17... Nf5": "He is spending far too much time moving this piece. Bb7 is better as Nf6+Kh8 and after Rh3 the pawn is defended by the Knight on g7 if it needs to go to h5 and again Qc5 is possible.",
        "18. Qf2": "Getting ready to come to h4 if allowed",
        "18... Bb7": "Natural but too late. I think here he has to play Kg7 to shuffle the rook to f8 and stop me gaining a tempo with the NF6 check.",
        "19. Rh3": "All my pieces are ready and waiting to pounce.",
        "19... h5": "Surely Bxe4 had to be tried as then he has stopped the first wave of the attack. But this is suicide. The king position is already weak this pawn move loses any flexibility and gives white the time for the following.",
        "20. Nf6+": "It is time to cash in that tempo",
        "20... Kg7": "Probably best If he plays Kh8 instead the same combination seems to work.",
        "21. Bxf5": "Get rid of the only defender!",
        "21... exf5": "Obviously best as gxB Qg3+ wins easily",
        "22. Nxh5+": "The problem of h5 is revealed. He does not have a choice but to take it.any other move and the Knight returns with check and mate follows so....",
        "22... gxh5": "An unhappy choice",
        "23. Qg3+": "Very Strong and he has 3 choices none of which save him.\r\n...Kh8 24.Rxh5++\r\n...Kh7 24.Rxh5++\r\n...Kh6 24.Qg5+ Kh7 25.Rxh5++ so my opponent understandably resigned. The moral if there is one in this game is if you are under attack and if exchanging the queens or your enemies most dangerous attacking pieces will diminish the attack and i think you will agree that i would not have got away with such a simple cheap combo had the queens come off when he had the chance or if he had taken the Knight off with his bishop. "
    },
    "url": "https://gameknot.com/annotation.pl/tomaks-mini-tournament-vii?gm=29877",
    "gameName": "tomak's mini-tournament VII",
    "players": "cameron12345 (1870) vs. savsams (1677)",
    "opening": "Sicilian (B47), Taimanov (Bastrikov) variation"
}