{
    "moves": {
        "1. e4": "Sometimes you show up overdressed for the party.  In this game, Mr. Kitrich wore a cummerbund to a camp fire.",
        "1... e5": "I usually play D4, but a lot of my games have been drawish with symmetrical pawn structure.  ",
        "2. Nc3 Nf6 3. Nf3": "I used to play the Four Knights, and I think this is the book line.",
        "3... Nc6 4. Bc4": "The position takes on characteristics of the Giucco Piano.",
        "4... h6 5. d3 Bc5": "My first idea is to exchange off his dark-squared bishop.",
        "6. Qe2 Ng4": "Threatening the proverbially-weak f2 square.  In blitz you get a lot of players who prefer these arrogant attacks.  In the game, I estimate that I will be able to defend.",
        "7. Be3 d6": "Nd4 might have been a better try.",
        "8. Bxc5 dxc5 9. h3 Nf6": "I want to get a knight to the inviting d5 square.",
        "10. Qe3": "Threatening Qxc5.",
        "10... Nb4": "Threatening Nxc2+.  Here I decided to sacrifice c2 and the exchange in return for a strong attacking position.",
        "11. O-O Nxc2 12. Qxc5": "The immediate threat is Qxe5+.  I estimate that he will not allow me play it.",
        "12... Nxa1 13. Qxe5+ Be6 14. Bxe6 fxe6 15. Qxe6+": "White is down a rook, with 1 pawn for the exchange.  In this position it is imperative to keep black off balance, and unable to muster a defense.",
        "15... Qe7 16. Qc4 Nc2": "In this sharp position, white shows the first hint of class.  ",
        "17. e5": "E5 kicks the night, allowing me to play the compelling Nd5.",
        "17... Nd7 18. Nd5 Qc5": "A convincing reply.  White must continue to keep the pressure up while managing to avoid simplifications.",
        "19. Qg4": "A dubious sacrifice from white.  While white be able to regain face?",
        "19... Qxd5 20. Qg6+ Qf7 21. Qe4": "White is down a rook and pawn, and the attack appears to be petering out.",
        "21... O-O-O 22. Rc1": "Black still has a considerable advantage, with a seemingly-secure king position.  White's f3 knight appears listless.",
        "22... Nc5 23. Qe2 Nd4 24. Nxd4": "And white is regaining some material.",
        "24... Rxd4 25. Rxc5 Qxa2": "This looks materialistic and narrow-minded.  Black has undefended pieces and white's e5 pawn could be a liability.",
        "26. Qc2 Qa1+": "Black's play is characterized by increasing thoughtlessness.",
        "27. Kh2 b6 28. Rxc7+ Kd8": "In this critical position white chose e6 over the immediate rc8+ followed by ke7, qx7+,  and ke6.",
        "29. e6": "The position is now critical for black.  His best try may have been Qa3 or Re8.",
        "29... Qa5": "Instead there is this moves, perhaps with ideas of qe5+, but it is much too slow.",
        "30. e7+ Ke8 31. Qc6+ Kf7 32. e8=Q#": "And white reaches checkmate via a promotion.  I did feel a bit bad after this win, because there were probably many ways for black to retrieve the game, but in general I had sustained a sacrificial attack from the middlegame.  And in the end, there was some class."
    },
    "url": "https://gameknot.com/annotation.pl/too-much-class?gm=35125",
    "gameName": "Too Much Class",
    "players": "Omar Kitrich  vs. alelay ",
    "opening": "Vienna (C26), Falkbeer variation"
}