{
    "moves": {
        "1. d4 Nf6 2. c4 g6 3. Nc3 d5 4. Nf3 Bg7 5. Qb3 dxc4 6. Qxc4 O-O 7. e4 Bg4": "Uno de los más difíciles problemas de la teoría del ajedrez. Las negras permitieron la formación de un fuerte centro de peones blancaso, pero logran ejercer una presión de piezas sobre las casillas centrales. Según Smyslov, tal estrategia \"no es de fácil manejo, pero abre amplias perspectivas para el espíritu creador de cuantos buscan la lucha en el tablero",
        "8. Be3 Nfd7 9. Qb3 Nb6 10. a4 a5 11. d5 Bxf3 12. gxf3 Qd6": "Desde aquí la dama puede trasladarse a la fuerte posición \"b4\"",
        "13. Nb5 Qb4+ 14. Qxb4 axb4 15. Nxc7": "Si 15 a5, sigue Ab2;16 Tb1, Ca4 y las negras tienen una posición activa",
        "15... Rxa4 16. Rb1 Nb6d7 17. Nb5 Rc8 18. Be2": "Smyslov indicó que aquí las blancas debían seguir con 18 Cd4, lo que hubiera conducido a un juego complejo con probabilidades aproximadamente iguales",
        "18... b3 19. Na3": "Más seguro sería 19 Ad1",
        "19... Bxb2": "En sus instructivos comentarios a esta partida, Smyslov escribe: \"Decisión sencilla en apariencia, pero que en realidad implica una cuestión de principio. No cabe duda de Euwe tenía en cuenta esta contestación, pero esperaba, gracias a la pareja de alfiles, recuperar el peón b6 y obtener un final favorable ¡Cómo prevalece en nuestros días la convicción de la superioridad de los dos alfiles! Es interesante mencionar que a Chigorin le gustaba luchar llevando dos alfiles y que más de una vez lo hizo con éxito\"",
        "20. Rxb2 Rxa3 21. Kd2 Na6 22. Rhb1 Nac5 23. Bd4": "Ganar el peón de \"b3\" no resulta tan fácil. Si 23 Ab5, Smyslov da la siguiente variante: 23..., Ce5; 24 Ac5, Tc5; 25 Tb3 , Cf3; 26 Re3, Tc3! Con ventaja para las negras",
        "23... e5 24. dxe6 e.p.": "Era mejor Ac3",
        "24... Nxe6 25. Be3 Ndc5 26. Bxc5": "Fracaso del dogmático punto de vista sobre la \"siempre fuerte\" pareja de alfiles. Resignándose a este cambio, las blancas admiten el error de su concepto estratégico",
        "26... Nxc5 27. Kc3 Ra4 28. Kd2 Kg7 29. Ke3 Rd8 30. Rc1 b6 31. Bc4 Rda8 32. Bd5 Ra4a2 33. Rcb1 Ra8a4 34. Kd2": "La situación de las blancas es ya desesperada. La jugada del texto da pie a un hermosa combinación final de Smyslov",
        "34... Rd4+ 35. Ke2 Na4 36. Rxa2 bxa2 37. Ra1": "O bien 37 Aa2, Cc3; 38 Re3, Ta4; 39 Ab3, Ta3 y las negras ganan pieza",
        "37... Nc3+ 38. Ke3 Rd1": "Las blancas abandonan"
    },
    "url": "https://gameknot.com/annotation.pl/torneo-match-por-el-campeonato-mundial?gm=33322",
    "gameName": "Torneo/Match por el campeonato mundial",
    "players": "Euxe, Max  vs. Smyslov, Vassily ",
    "opening": "Gruenfeld defence (D99), Smyslov, main line"
}