{
    "moves": {
        "1. e4": "Les presento mi primera partida de la UNAM, admito estar sumamente nervioso, me temblaban las manos y estaba taquicárdico. Mi sistema límbico estaba gritando, pero decidí sentarme y hacer ejercicios de relajación, es decir, respirar profundamente.",
        "1... e6 2. Nf3": "Desde este momento, noté cierta confusión de mi contricante quien la manifestó sacudiendo la cabeza de un lado para otro, negando y como quien deduce que el rival (yo) ha hecho una jugada mala. Decidió jugar Cf3.",
        "2... d5": "Decidí seguir con lo planeado, defensa francesa y esperar que me tenían preparado. Nunca hay que confiarse, y quise jugar a la espera de la fuerza ajedrecistica de mi contrincante",
        "3. exd5 exd5 4. d4 Bg4": "Es muy molesto el Ag4, me pareció una buena maniobra para desconcertar aún más a mi rival y tomar de cierta manera, la iniciativa.",
        "5. Nbd2": "Demasiado pasiva, pero sostenible, de hecho no es una jugada mala. Sin embargo le da demasiado importancia a un alfil que no la tiene.",
        "5... Nf6": "En estos momentos decido desarrollar y enrocarme, pues aún no sabía contra que clase de rival me enfrentaría",
        "6. h3 Bf5": "Esta jugada es fea, me parece que pierdo un tiempo para realizar Af5. Sin embargo, el blanco ha frenado su desarrollo y ha debilitado el flanco de Rey. Supongo que es una buena justificación",
        "7. Nh4 Be6": "De nueva cuenta, me parece que persigue a un alfil que no tiene mucha importancia y la nueva posición de mi alfil, me gusta aún más",
        "8. Bd3 c5": "Quizás es un poco apresurado, pero me pareció apropiado seguir con la iniciativa",
        "9. c4": "Me parece mejor dc, y 0-0",
        "9... Nc6 10. cxd5": "Es de todos conocido que capturar una pieza retrasa y acomoda a las piezas menores",
        "10... Nxd5 11. Nhf3": "Esto ya me pareció un error",
        "11... Nf4": "Ahora debe jugar Af1 y eventualmente amenazar al caballo negro",
        "12. O-O": "Grave error, sin embargo en este punto ya considere jugar agresivamente debido a la inexperiencia de mi rival",
        "12... Nxd3 13. Ne4 Bc4": "Una jugada agresiva pero peligrosa, mi rival estaba cayendo a menos de una hora de tiempo y comenzaba a impacientarse",
        "14. Ng3 Be7": "Es probable que haya sido mejor Cxc1 y amenazar la torre en f1 que era la idea original",
        "15. dxc5": "En este momento ya estaba impaciente y quería que la partida terminara rápido, no quería desgastarme tanto al tener ventaja considerable y decidí hacer cambios.",
        "15... Nxc5": "Creo que esto fue un error de mi parte, era mejor 0-0",
        "16. Qxd8+ Rxd8 17. Re1 O-O 18. Nf5": "El blanco juega sin ninguna estrategia planeada",
        "18... Bf6 19. Bg5 Bxg5": "Como dije, los cambios me favorecen pero le deba algo de contrajuego al blanco",
        "20. Nxg5 Rd5": "La jugué porque me pareció que mi rival tardaría en hallar la jugada Ce3 y así fue, en estos momentos ella tenía menos de 30 minutos y yo, poco más de una hora.",
        "21. Ne3 Rxg5 22. Nxc4 Ne6 23. Nd6 Ncd4": "Es obvia la amenaza Cf3+",
        "24. Re4 b6": "No quería dejar nada a la deriva",
        "25. Rc1 Rd5": "La teoría sugiere amenazar la pieza sin defender en estos casos",
        "26. Nc8": "Debo admitir que esta jugada me sorprendió, un poco porque mi contrincante la jugó después de consumir casi 10 minutos y francamente no la esperaba.",
        "26... Rd7": "Sin embargo, el caballo ha quedado atrapado y es cuestión de tiempo para que sea capturado",
        "27. h4": "Pretende algo de contrajuego",
        "27... Rfd8 28. Re5 Kf8": "Me parece que pretendía f4-f5 ",
        "29. Nxa7": "Con 15 minutos para jugar, mi rival se desesperó que cometió este otro grave error.",
        "29... Rxa7 30. f4": "En estos momentos no entendía porque quería seguir jugando con tanta desventaja y con tan poco tiempo",
        "30... Nxf4 31. g3 Nfe2+": "Hago el paréntesis que para estos momentos mi rival, una mujer de tal vez 17 años carecía de tiempo y no jugaba ya con precisión, ni concentración",
        "32. Rxe2": "Un tremendo error garrafal",
        "32... Nxe2+": "Con desventaja de 13 puntos, finalmente se rindió."
    },
    "url": "https://gameknot.com/annotation.pl/torneo-unam-2012?gm=48404",
    "gameName": "TORNEO UNAM 2012",
    "players": "Arriaga Emigdio, Teresa (1000) vs. Pastor, Arturo (1532)",
    "opening": "French (C00), Wing gambit"
}