{
    "moves": {
        "1. e4": "EXCELENTE JOGADA!\nCom esse lance, a dama e um bispo foram desbloqueados, e na sua próxima vez de jogar as brancas já terão mais alternativas: esse movimento começou a deixar as peças brancas menos asfixiadas.\nUma outra qualidade desse lance: ocupa o centro do tabuleiro.\nO CENTRO DO TABULEIRO: são as 4 casas d4d5e4e5. É uma região estratégica, e quem domina o centro fica com mais chances de dominar a partida.",
        "1... e5": "As pretas respondem na mesma moeda: esse lance tem as mesmas qualidades do lance anterior das brancas, e é uma reação correta, pois quando seu adversário ocupa o centro você deve brigar com ele para disputar esse rico espaço!",
        "2. Nf3": "Ótimo lance. f3 é uma \"casa natural\" para o cavalo, e deve ser sempre uma boa escolha para os seus lances iniciais. O cavalo saiu das margens e se aproximou do centro, e com isso ficou com muito mais raio de manobra. Na posição inicial ele só tinha 3 casas (2 das quais estavam ocupadas por suas outras peças), e em f3 ele passou a ter oito casas para ir (apenas 3 estão ocupadas por suas próprias peças, e 1 casa, d4,  está protegida pelo peão preto.\nAlém disso, essa foi uma jogada de ataque! O cavalo ameaça capturar o peão preto. É claro que é bem fácil se defender dessa ameaça, mas o que importa é que as pretas perderam a liberdade, pois obrigatoriamente precisam providenciar uma defesa para o peão atacado.",
        "2... Nf6": "Jogada interessante, que configura a \"Defesa Petroff\".\nAqui, a resposta mais comum seria com o outro cavalo em c6 - nessa casa o cavalo protegeria o peão: se as brancas capturam o peão preto, as pretas capturam o cavalo!\nMas deixemos de lado Cc6, pois o lance da partida foi o Cf6. A Defesa Petroff é uma linha de abertura interessante, mas eu recomendaria a nenhum iniciante que se especializasse nela. Aqui as pretas resolvem a ameaça ao peão por meio de um contra-ataque: se o cavalo branco toma o peão preto (que é a continuação mais comum), o cavalo preto pode tomar o peão branco, e fica \"elas por elas\" (embora seja melhor, antes disso, avançar o peão da Dama para d6, \"expulsando\" o cavalo branco.",
        "3. Nc3": "Ótima resposta: as brancas mantém a tensão no centro, desmanchando o trabalho de defesa feito pelas pretas (pois agora não é possível responder à perda do peão preto com a captura do peão branco, pois isso deixaria o cavalo preto perdido).. E o melhor é que as brancas fazem isso simplesmente desenvolvendo seu outro cavalo para a sua \"casa natural\". Agora as pretas precisam resolver novamente o mesmo problema da rodada anterior - como defender o peão central?\nAlém de CxC (CxC=\"Cavalo toma Cavalo\") e deste Cc3, uma outra resposta muito boa seria colocar o peão da dama em d4.",
        "3... d6": "A essa altura, esse é um dos melhores lances à disposição das pretas. Dentre as partidas que começam com esses lances, a minha base de dados diz que as brancas vencem 39%, as pretas vencem 30% e em 31% dos casos dá empate.\nAo colocar o peão em d6 as pretas finalmente providenciam uma defesa mais definitiva para o seu peão central de e5. Em termos de desenvolvimento, a boa notícia é que agora um dos bispos está mais livre; a má notícia é que o outro bispo que já estava livre agora voltou a ficar preso!",
        "4. Bb5+": "LANCE FRACO!\nEvite dar xeques a esmo. Esse é um xeque facilmente defensável, e o lance pouco contribui para o desenvolvimento das peças brancas. Além disso, não possui ação no centro. Melhores seriam:\n- colocar o peão da dama em d4, ou\n- colocar esse bispo mais perto do centro, em c4.",
        "4... Bd7": "Boa resposta.\nObserve que, nessa configuração, se as pretas pudessem fazer um segundo lance consecutivo elas poderiam tomar o bispo com BxB - as brancas retomariam com CxB, mas aí haveria uma surpresinha desagradável: o cavalo preto tomaria o peão central das brancas, pois o segundo cavalo que apareceu para dar suporte foi \"distraído\" na recaptura do bispo (depois de Cxe4 as brancas não podem imitar com Cxe5, senão levam d6xC (\"d6xC\"=\"peão que está na casa d6 captura o Cavalo\").",
        "5. O-O": "INICIATIVA E VIVACIDADE NO ROQUE!\nÉ sempre bom realizar o roque, de preferência O-O (\"O-O\" é o símbolo do roque pequeno. Se o roque tivesse sido realizado com a outra torre, que está mais longe, o símbolo seria \"O-O-O\").\nObserve que esse roque PERMITE que as pretas façam o estratagema descrito no movimento anterior, com BxB seguido de CxB e depois Cxe4, ganhando um peão. Contudo, com De2 as brancas atacam o cavalo preto, que terá de recuar para se defender. Se isso tudo acontecer, mesmo com um peão a menos a posição das brancas é boa, e cedo ou tarde serão boas as chances de capturar esse peão preto da coluna \"e\", reequilibrando o placar.",
        "5... a6": "Esse avanço do peão da torre para a6 deixa o bispo branco ameaçado (pois se as brancas permitirem que o bispo preto capture o bispo branco na esperança de retomar com o cavalo, perderão também o cavalo!)\nVamos ver o que as brancas fazem para se livrarem dessa ameaça...",
        "6. Ba4": "Lance fraco.\nMelhor seria o agressivo BxB.\nEntenda: as brancas estão restringidas, sob ataque, e fizeram um lance PASSIVO, meramente defensivo, o que \"passa a iniciativa\" para as pretas, que estão livres para tentar inventar qualquer coisa - e se houver um novo ataque, as brancas terão que se defender novamente... e após um terceiro ataque, nova defesa... com isso, as pretas \"pegaram a iniciativa\" e podem começar a pressionar as brancas.\nPOR OUTRO LADO... se o lance é BxB, às pretas não restará alternativa senão retomar - e qualquer que seja o modo escolhido para realizar essa retomada, a vez de jogar voltará para as brancas nenhuma ameaça - as brancas é que estarão livres para tentarem inventar alguma ameaça. SEMPRE LUTE PELA INICIATIVA!",
        "6... b5": "Lance fraco. Melhor seria BxB.\nEmbora esse avanço de peão tenha o mérito de criar uma ameaça às brancas, mantendo a iniciativa em posse do time preto, o fato é que depois que o bispo recuar para b3 as pretas não terão mais o que fazer, e com um agravante: em b3 o bispo branco dominará uma importante diagonal!\nAPRENDA: torres devem dominar colunas livres (e também fileiras), bispos devem dominar diagonais livres. As colunas livres são verdadeiras estradas asfaltadas, dando às torres ótimas condições de mobilidade. Idem em relação aos bispos, que em vez de colunas preferem diagonais. ",
        "7. Bb3": "Não deu outra: as brancas \"agradecem\" a pressão dos peões pretos, que no fim das contas não causaram nenhum prejuízo à posição das brancas e ainda por cima conduziram o bispo para uma ótima localização!",
        "7... Nc6": "Aparentemente, é um bom lance, pois desenvolve o cavalo para uma \"casa natural\". Contudo, observe que logo após as brancas posicionarem um bispo em uma ótima diagonal as pretas respondem fechando uma das rotas que estavam abertas para o seu bispo da coluna d.\nAlém disso, esse lance permite que as brancas respondam com Cg5 - se nada for feito, a sequência disso seria Cxf7, que além de ganhar o peão preto de f7 ainda faz um ataque duplo à dama e à torre, ou seja, ganha uma torre!\nMelhor teria sido colocar o bispo mais atrasado em frente ao rei (Be7), o que ao menos permitiria o roque.",
        "8. d3": "As brancas deixam escapar a oportunidade de criar as ameaças associadas ao avanço do seu cavalo da direita para a casa g5 (Cg5), o que poderia permitir o letal Cxf7.\nMas avançar o peão da dama para d3, embora um pouco passivo, não pode ser considerado um lance ruim: tem ação central, desenvolve um bispo e é bastante sólido.",
        "8... Na5": "Boa jogada, pois devolve ao bispo um pouco de liberdade. Além disso, embora bispos e cavalos tenham o mesmo valor (cada um é considerado equivalente a 3 peões, sendo tradicional pensar que P=1; C=B=3; T=5; D=9), é comum considerar que \"bispos sejam um pouquinho melhores do que cavalos\" (na verdade, depende de cada posição - em algumas posições mais obstruídas os cavalos são melhores, pois saltam, nas posições mais abertas os bispos são melhores, pois voam rapidamente ao longo de diagonais livres, ou seja, cada caso é um caso). Quem tem o par de bispos e já está sem cavalos quase sempre está melhor do que um adversário que tenha o par de cavalos e já esteja sem bispos. E essa jogada tem o mérito de permitir que as pretas sacrifiquem um cavalo para ganhar um bispo, \"normalmente vale um pouquinho mais\".\nMas vale uma última observação: cavalos têm maior potencial de ação quando estão no centro. Posicionados junto à borda eles têm movimentos limitados, de modo que só vale a pena colocar os cavalos longe do centro quando existe alguma razão tática bastante evidente",
        "9. Bg5": "Como não existe nenhum jeito de evitar desvantajosa troca de bispo por cavalo, as brancas tratam de cuidar de desenvolver suas peças. Esse lance Bg5 não é ruim, pois \"crava\" o cavalo - embora seja difícil aproveitar essa cravada (quando uma peça estiver pregada, tente atacá-la - nesse caso, porém, não é fácil providenciar um novo ataque - além disso, as pretas podem intercalar um bispo entre o cavalo e a dama ao jogarem Be7, anulando a cravada).",
        "9... Be7": "Boa jogada!\nJamais ignore o incômodo fato de que uma das suas peças está pregada: sempre lute pela máxima mobilidade\" (se você estivesse em um campo de batalha, o que você ia preferir: ficar PRESO, de mãos amarradas e dentro de um caixote, ou LIVRE, com os braços ágeis e prontos para atacar e defender, junto com pernas livres para chutar e correr??)",
        "10. Qd2": "Lance interessante: observe que a dama saiu do caminho, permitindo que as torres \"se comuniquem\". É sempre uma boa ideia manter as torres em comunicação, pois uma defende a outra e a outra defende a uma! Além disso, em breve uma das torres poderá se posicionar atrás da dama, criando uma metralhadora ofensiva ao longo da coluna d.\nEm todo caso, foi um lance um tanto quanto passivo, e melhor seria o agudo BxC, o que abriria de uma vez por todas as linhas defensivas das pretas (o que compensa o fato de que bispos são \"um pouco melhores do que os cavalos\", pois uma linha de defesa em frangalhos é bem melhor do que isso).",
        "10... O-O": "O-O\nFinalmente!\nO roque é um lance muito útil, pois deixa o rei protegido e coloca a torre em jogo. É um lance para ser feito o quanto antes, e não seria um bom sinal esperar mais do que dez lances para rocar!\nEsse roque é um pouco tardio, e já nasce sob ameaça: com BxC as brancas podem bagunçar todas as características defensivas desse roque.",
        "11. Rad1": "Bom lance: a torre se posiciona atrás da dama, dobrando o poder de ataque ao longo da coluna d.\n\nPassados 10 lances, como estamos?\nA posição está equilibrada. Os dois reis rocaram, mas o roque das brancas está mais \"inquebrável\". Os dois bispos brancos estão muito ativos e bem posicionados (um ameaça demolir o roque adversário e o outro domina uma importante diagonal), enquanto um dos bispos pretos está totalmente aprisionado. Os cavalos brancos estão em posições \"naturais\", enquanto os cavalos pretos parecem um pouco inferiores (embora um deles esteja prestes a realizar uma vantajosa troca de cavalo por bispo). A disputa por espaço no centro do tabuleiro está equilibrada. A dama branca está muito mais livre do que a sua irmã preta, e as torres brancas já se comunicam e estão dobradas com a dama, algo que não se vê no lado das pretas. Em todo caso, é uma posição equilibrada, e os dois jogadores chegaram até aqui sem cometerem erros graves. Uma cuiriosidade: dez lances se passaram e não houve nenhuma captura!",
        "11... Nxb3": "A primeira captura do jogo. Lance correto das pretas, pois ganham um bispo mesmo perdendo um cavalo - além disso, dois peões brancos ficarão \"dobrados\" na coluna b, e isso é considerado uma fraqueza: quando dois peões estão lado a lado é impossível posicionar uma peça inimiga diante deles, mas quando estão enfileirados esse \"escudo\" deixa de existir.\nAPRENDA: dobrar torres é muito bom, mas dobrar peões é ruim\nAPRENDA TAMBÉM: peões formam uma espécie de \"escudo\" quando estão lado a lado, e isso é especialmente importante no caso dos 3 peões que protegem o rei após o roque.",
        "12. cxb3": "1) Os peões brancos ficaram dobrados;\n2) As pretas ainda têm um par de bispos, mas as brancas não - elas têm apenas 1 bispo\n3) As pretas tinham um problema: um dos seus cavalos estava mal posicionado, junto à borda. Por outro lado, as brancas exibiam orgulhosamente um bispo muito bem posicionado, que dominava uma diagonal livre que desembocava direto na direção do rei inimigo - e as pretas acabam de trocar um cavalo mal localizado por um bispo bem localizado\n4) As brancas não têm escolha: nem é preciso pensar... devem retomar. Isso significa que a iniciativa está com as pretas.\n5) As brancas escolheram o peão errado! A captura deveria ter sido feita com o peão da coluna a, pois o peão de c é mais central e estava em uma formação de 3 peões alinhados diagonalmente em direção ao centro.",
        "12... c6": "Qual foi o objetivo desse lance?\nNa verdade, foi um lance sem objetivo. Muito passivo, e ainda por cima bloqueou os caminhos de um bispo.\nA posição estava um pouco \"morta\", sem nenhuma ameaça evidente. Tampouco havia uma clara oportunidade. Em momentos como esse é comum \"perder a inspiração\" e fazer lances fracos.\nMas sempre existe algo interessante! Por exemplo, colocar o bispo em g4 (não seria brilhante nem letal, mas seria bom... ao menos ameaçaria bagunçar o roque das brancas por meio de BxC)",
        "13. a4": "Ao fazer isso, provavelmente as brancas visualizaram uma troca de peões do tipo b5xa4 seguida de b3xa4 (desdobrando os peões).\nContudo, em casos assim é comum que o jogador não perceba que AS PRETAS NÃO SÃO OBRIGADAS A TOMAR O PEÃO, podendo simplesmente avançar seu peão de b5 para a casa b4 - se fizerem isso, ameaçarão o cavalo branco, que será obrigado a fugir, abandonando a ótima casa c3 em que atualmente se encontra - e ao fazer isso, a presença branca no centro ficará menos sólida.",
        "13... d5": "Esse avanço tirou a ÚNICA defesa que sustentava o peão central preto (o peão de e5), que se encontra ameaçado por um cavalo desde o segundo lance da partida.\nAPRENDA: perder um peão é ruim; perder um peão central é péssimo.\nOutro problema com essa jogada é que ela entrega um peão central SEM NENHUMA COMPENSAÇÃO. Foi uma distração, uma queda no grau de concentração.\nAPRENDA: no xadrez (ou durante uma prova no colégio), depois de um certo tempo nosso grau de atenção oscila para baixo. Isso é normal, mas é importante que \"algum despertador interno\" nos avise \"ei! seu grau de concentração está baixo - espere um pouco e NÃO FAÇA NADA enquanto a sua atenção não voltar para os níveis normais\") - dessa vez, esse desertador não tocou.",
        "14. Nxe5": "Ótimo lance: implacáveis, as brancas aproveitam o primeiro vacilo das pretas e obtém uma importante vantagem: capturaram o peão central das pretas!",
        "14... Be6": "As pretas passam por um mau momento na partida, e parecem um pouco assustadas com a perda do peão.\nÉ verdade que o bispo se encontrava ameaçado pelo cavalo, mas também é verdade que ele já estava protegido pela dama.\nCom esse movimento as pretas entregam mais um peão...",
        "15. Nxc6": "As brancas são inclementes e sem comiseração, punindo severamente cada lapso das pretas.\nZonzas como estão, não seria uma surpresa se as pretas reagissem ao ataque feito pelo cavalo à dama com o desastrado Dc1 (você consegue imaginar o que as brancas poderiam fazer nesse caso? Elas tomariam o bispo e ainda fariam um ataque duplo, com xeque e ameaça à dama... e quando as pretas saíssem do xeque, adeus dama preta!)",
        "15... Qd6": "As pretas despertam, e fazem um lance coerente. Parece que o grau de atenção voltou ao normal.\nA essa altura, porém, as pretas já começam a ficar pressionadas pelo relógio, com cerca de 5 minutos a menos do que as brancas.",
        "16. Nxe7+": "Aqui as brancas provavelmente pensaram \"Em vez de fazer um lance passivo que meramente defenda o cavalo, é melhor fazer algo mais agressivo, como uma troca de cavalo por bispo - que, aliás, costuma ser um bom negócio\"\nBom lance",
        "16... Qxe7": "As pretas retomam corretamente.",
        "17. h4": "Agora é a vez das brancas realizarem um lance desprovido de significado.\nAPRENDA: como regra geral, não é bom movimentar os 3 peões que protegem o rei rocado - embora existam exceções, é claro, pois cada posição é um caso.\n\nFoi um lance pouco inspirado, as brancas deveriam ter pensado um pouco mais -- eles têm tempo para isso! (por exemplo, avançar o peão central para e5 seria ótimo, já que o cavalo está pregado - ele não pode sair de onde está, sob pena do bispo branco capturar a dama preta).",
        "17... Rac8": "A ideia de posicionar uma torre em uma coluna livre é boa, em geral.\nNesse caso específico, porém, a jogada não é boa, pois dá às brancas uma segunda chance de perceber que o avanço do peão central para e5 é um bom ataque...",
        "18. Nxd5": "Estrategicamente, essa jogada tem um defeito: entrega à torre das pretas uma coluna 100% livre.\nAlém disso, as brancas deixaram a oportunidade de atacar o cavalo pregado por meio do avanço do peão central para e4.\nMas a jogada possui um mérito muito positivo: o condutor das brancas percebeu que essa troca resultaria em um lucro de um peão (pois depois de Cxd5 pode seguir BxC, mas quando as brancas prosseguirem com e4xB as pretas perceberão que não podem usar o cavalo em Cxd5, já que isso implicaria a perda da dama).",
        "18... Bxd5": "O bispo retoma... ok",
        "19. exd5": "Pronto: as brancas ganham bispo e peão em troca de um cavalo - além do lucro de mais um peão, as brancas trocaram um cavalo por um bispo, o que também é lucrativo.",
        "19... bxa4": "Essa captura é uma boa forma de dar sequência à partida, pois deixa as pretas com ótimo espaço livre.",
        "20. bxa4": "ok, retomada normal.\nObserve a posição: as pretas possuem uma significativa desvantagem material (3 peões a menos), mas suas peças estão bem mais livres: sua dama tem ótimas casas, sua torre domina uma coluna aberta e seu roque permanece intacto (embora isso não seja mérito das pretas: as brancas é que desperdiçaram várias oportunidades de desmantelar o roque preto).\nPesando prós e contras, é inegável que as brancas estão em vantagem, embora não seja uma vantagem tão cômoda que permita \"ligar o piloto automático\": ainda há muito trabalho a ser feito!",
        "20... Rcd8": "Péssima jogada, tanto pelo que fez quanto pelo que não fez: a torre preta dominava uma coluna aberta, e abandonou o posto para atacar um peão dobrado; deveria ter feito esse ataque com a dama (dama em d6), pois além de criar uma ameaça as pretas conseguiriam:\na) despregar o cavalo; e\nb) posicionar a dama em uma excelente diagonal",
        "21. Rde1": "Confesso que não tenho certeza se anotei corretamente esse lance: talvez a partida tenha continuado com a outra torre sendo movida para a casa e1 - que, de fato, é superior.",
        "21... Qc5": "A dama foi atacada e deve ser defendida.\nO lance realizado não é um erro grave, mas seria mais agressivo posicionar a dama na casa d6 (se na sequência as brancas permitissem que o cavalo preto fosse à casa g4, as brancas poderiam levar xeque mate)",
        "22. Qe3": "Lance aceitável. As brancas propõem uma troca de damas.",
        "22... Qxd5": "As pretas tomam o peão, e isso é correto.",
        "23. Rec1": "Em vez disso, talvez fosse melhor abrir de vez a defesa das pretas, com BxC.\nAPRENDA: embora os bispo normalmente valham um pouquinho mais do que os cavalos, também existe um valor \"posicional\" em ver o roque adversário desmantelado. As brancas ignoraram esse fato durante esse jogo.\nMas tudo bem: ocupar uma coluna aberta com uma torre também tem um certo valor posicional (embora, nesse caso específico, essa coluna esteja um tanto quanto \"fora da região onde as coisas acontecem\")",
        "23... h6": "Para retomar a iniciativa, teria sido interessante atacar a dama branca colocando uma torre na coluna e.\nAlém disso, esse movimento enfraquece um roque que passou vários lances sendo inacreditavelmente poupado pelo condutor das brancas - e de repente o próprio condutor das pretas causa a destruição!",
        "24. Bf4": "Definitivamente, as brancas têm algum carinho especial pelo roque do rei preto...\nO certo (acho que escrevo isso pela décima vez aqui...) seria BxC",
        "24... g5": "Essa perseguição do bispo branco pelos peões pretos é inútil, mas é muito comum: instintivamente, ao vermos alguém fugindo somos tomados pelo desejo selvagem de empreender uma perseguição!\nMas calma: xadrez é exatamente uma luta interior entre o nosso lado racional e os nossos instintos selvagens!\nAqui, novamente o lance correto seria ameaçar a dama deslocando uma das torres para a coluna e.\nSe não bastassem esses problemas, existe outro: há um erro de cálculo, e esse movimento permite uma troca de peões que será lucrativa para as brancas.",
        "25. hxg5": "As brancas capturam...",
        "25... hxg5": "Em vez de recapturar, você consegue adivinhar qual deveria ter sido o lance das pretas??\nPois é... \"ameaçar a dama deslocando uma das torres para a coluna e\" (dessa vez eu copiei e colei o texto, para economizar digitação!)",
        "26. Bxg5": "Pronto! Mais um peão se foi...",
        "26... Nh5": "A essa altura as pretas já estavam bastante pressionadas no relógio, e começam a fazer lances rápidos, sem pensar.\nO cavalo estava pregado! (pobre cavalo... passou boa parte da partida cravado)\nComo aquele texto ainda está copiado, vou apenas pressionar ctrl+v: o melhor lance seria \"ameaçar a dama deslocando uma das torres para a coluna e\", ou, se preferir, deslocar a dama para f5. Existem inúmeras formas de proteger esse cavalo, inclusive o fraco lance com com a torre em d6 (um erro mais perdoável).",
        "27. Bxd8": "Lá se foi uma torre...\n(colocar a torre em c5 também seria uma boa ideia)",
        "27... Rxd8": "Também poderia ter capturado o bispo com a dama.",
        "28. g4": "Lance pouco inspirado das brancas... mas ok, a vantagem material é muito grande: 5 pontos!",
        "28... Nf6": "Melhor seria Cg7 (o cavalo perto do rei ficaria defendido e daria alguma proteção ao rei).\nEsse lance permite, por exemplo, que o cavalo seja novamente atacado (por meio de mais um avanço desse mesmo peão)",
        "29. g5": "Segue o ataque...",
        "29... Nd7": "Cg4 teria sido uma fuga mais agressiva, pois atacaria a dama e posicionaria o cavalo próximo do rei branco, que está bastante exposto.",
        "30. Rc7": "As brancas começam a atacar sem muita objetividade... embora estejam azucrinando o pobre cavalo preto, o fato é que as brancas não vão muito longe com esse movimento (inclusive porque o cavalo está duplamente defendido).",
        "30... Nb6": "O cavalo preto vai se afastando cada vez mais da região da tabuleiro em que o jogo se concentra: a briga está no lado direito, e o cavalo foi parar no lado esquerdo. Essa fuga foi desnecessária.",
        "31. Qf3": "As brancas deslocam a sua poderosa dama para uma casa de onde ataca duplamente o peão preto - contudo, esse peão preto está bem defendido pelo casal real, dama e rei (se Txf7 segue Dxf7 e se as brancas insistem com Dxf7 então as pretas respondem com Rxf7, e as brancas acabaram de trocar uma torre por um peão!).\nMas o pior mesmo é que, depois de jogar com relativa calma e segurança, as brancas cometem o pior erro que pode ser cometido: entregam a dama de graça, sem nenhuma compensação.\nO lance seguinte sela o desfecho da partida...",
        "31... Qxf3": "As pretas não deixaram de notar que as brancas cometeram um lapso, e dessa vez são elas que atuam de modo implacável: o erro das brancas não foi perdoado.\n\nLamentavelmente, cometi algum erro ao anotar a partida, e não sei os lances finais. As pretas não se comportaram bem a partir desse lance, pois pouco depois elas é que cometeram um lapso, entregando a dama - mas dessa vez o condutor das brancas não percebeu, e a dama preta prosseguiu viva. Sem cometer novos erros, as pretas devastaram todas as peças brancas, chegando a um final de rei e dama contra rei. Mas o ponteiro das pretas caiu: essa queda de seta, em tal posição, significou empate. O jogo foi bom até o 13º lance, mas a partir desse ponto os dois jogadores erraram muito. O condutor das pretas errou mais, porém o erro do condutor das brancas foi mais grave. Espero que esses comentários ajudem os dois jogadores a reverem suas próprias partidas, aprenderem com os próprios erros e melhorarem seu desempenho.\nParabéns aos dois jogadores, foi um empate justo. A partida inaugurou muito bem o Torneio AFBNDES de Xadrez Sub-18 por equipes!"
    },
    "url": "https://gameknot.com/annotation.pl/torneio-afbndes-de-xadrez-sub-18-por-equipes?gm=59481",
    "gameName": "Torneio AFBNDES de Xadrez Sub-18 por Equipes",
    "players": "Matheus  vs. Lucas ",
    "opening": "Petrov three knights game (C42)"
}