{
    "moves": {
        "1. e4": "e4 e5 basic opening",
        "1... e5": "e5 standard reply",
        "2. Nf3": "nf3 makes me defend my e5 pawn",
        "2... d6": "d6 Philidors Defense",
        "3. d4": "d4 pawn attack to weaken my middle and open the middle.",
        "3... exd4": "I always do this move to keep the opponents pieces off my half of the board.",
        "4. Nxd4": "nxd4 standard rebuttal to exd4.",
        "4... c5": "c5 to attack the forward knight",
        "5. Nf3": "Nf3 retreat to safety.",
        "5... Nc6": "Nc6 develops a knight",
        "6. c4": "c4 pawn move to influence the middle and keep my middle position looking shabby.",
        "6... Nf6": "Nf6 I develop another knight and attack the e4 pawn.",
        "7. Nc3": "Nc3 my opponent develops a Knight and protects his e4 pawn while exerting more influence on the d5 square",
        "7... a6": "a6 a pawn move to try to keep his knights at bay.",
        "8. h3": "h3 a pawn move to keep me from pinning his f3 knight to his queen and to keep my knight from advancing on the board.",
        "8... h6": "h6 a similar move to keep my opponents queenside bishop from advancing and his f3 knight from moving to the g5 square.",
        "9. Bf4": "Bf4 my opponent develops another piece which exerts pressure on the center and d6 pawn.",
        "9... Be7": "Be7 probably not the greatest move to do here but one I usually do in this situation to enable castling to the kingside perhaps I should advance the g7 pawn to g6 or g5 to possibly fianchetto the bishop after moving the c3 knight to e5.",
        "10. Be2": "Be2 my opponent semi-develops his bishop to enable castling on the kingside",
        "10... Be6": "Be6 I develop my c8 bishop to the only viable open square that puts some influence on the middle.",
        "11. Qd2": "Hiblit moves his queen to enable castling to either side.",
        "11... g5": "g5 I attack the bishop on f4 with a pawn advance leaving my kingside castling looking tarnished.",
        "12. Be3": "Be3 hiblit retreats the bishop to e3",
        "12... g4": "g4 I further destroy my kingside protection and this move proves to be a blunder in this game.",
        "13. hxg4": "hxg4 my adversary takes the pawn and sets up some nice tactics on my kingside.",
        "13... Nxg4": "Nxg4 I retake the pawn on g4 with my kingside knight.",
        "14. Bg5": "Bg5 I can't take the bishop here or I'd lose my rook.",
        "14... Nge5": "Ng-e5 I don't remember why I did this move here.",
        "15. Bxe7": "Bxe7 hiblit swaps bishops and maintains the momentum.",
        "15... Qxe7": "Qxe7 I retake the bishop with my queen.",
        "16. b3": "b3 My opponent shores up his weak c4 pawn(which is probably why I moved my knight on the previous turn).",
        "16... O-O-O": "0-0-0 I castle to the queenside for better protection.",
        "17. a4": "a4 hiblit possibly wants to swarm pawns on my castled king.",
        "17... Na5": "Na5 I see an opportunity for my knight on the b3 square.",
        "18. Rb1": "Rb1 hiblit refutes my knights advances.",
        "18... Nxf3+": "Kxf3 I swap knights.",
        "19. Bxf3": "Bxf3 hiblit retakes the knight with his remaining bishop.",
        "19... f5": "f5 I see an oppurtunity to put a little pressure on my opponents king.",
        "20. Nd5": "Nd5 my opponent replies with an attack on my queen.",
        "20... Bxd5": "Bxd5 I retire the offensive knight.",
        "21. Qxd5": "Qxd5 hiblit recaptures with his queen.",
        "21... Rhe8": "Rh-e8 A blunder on my part losing me the pawn on f5.",
        "22. Qxf5+": "Qxf5  hiblit takes my pawn and puts my king in check.",
        "22... Kc7": "Kc7 God save the king!",
        "23. Rxh6": "Rxh6 my blunder loses me a second pawn as my opponent advances his rook to the 6th rank.",
        "23... Nc6": "Nc6 I failed to see the danger to my queen in this position and it costs me the game. I saw an oppurtunity to attack his queen.",
        "24. Rh7": "Rh7 My adversary pins my queen to my king with his rook.",
        "24... Nd4": "Nxd4 I attack his queen",
        "25. Rxe7+": "Rxe7 hiblit takes my queen and puts me in check forcing me to retake with my rook.",
        "25... Rxe7": "Rxe7 I retake the rook.",
        "26. Qf6": "Qf6 hiblit's queen eyes my rooks.",
        "26... Rh7": "Rh7 I see an opportunity for a free rook on my opponents back rank.",
        "27. Rb2": "Rb2 hiblit squelches my optimism",
        "27... Nc6": "Nc6 I see a free rook a few knight moves away.",
        "28. Qf4": "Qf4 Hiblit probably senses the danger.",
        "28... Ne5": "Ne5 I move the knight into position.",
        "29. Qe3": "Qe3 again my knight is thwarted.",
        "29... Rh1+": "Rh1  I see if I can get my rook to the far corner and down to a3 I might be able to fork his queen and rook with my knight.",
        "30. Ke2": "Ke2 my opponent moves out of check.",
        "30... Rdh8": "Rd-h8 Two heads are better than one.",
        "31. Rd2": "Rd2 M y opponent does not want me to get two rooks on the back rank and moves his rook into position to block this.",
        "31... Ra1": "Ra1 I move over to the far side.",
        "32. Qc3": "Qc3 My long term plan is foiled as hiblit attacks my rook with his queen.",
        "32... Rhh1": "Rh-h1 I protect my rook and see a checkmate at  e1 with one of my rooks.",
        "33. Ke3": "Ke3 Hiblit senses the danger.",
        "33... b6": "b6 I see a check at a5 and block it with a pawn.",
        "34. Be2": "Be2 Not sure what this move is about.",
        "34... Rac1": "Ra-c1 I attack the queen.",
        "35. Rc2": "Rc2 My opponent interposes his rook to protect the queen.",
        "35... Rxc2": "Rxc2 I trade rooks even though I can't really afford to.",
        "36. Qxc2": "Qxc2 hiblit retakes with his queen",
        "36... Nc6": "Nc6 My trusty knight moves into attack formation.",
        "37. f4": "f4 my opponent advances one of his passed pawns and also inhibits my knights movements on that side of the board.",
        "37... Nd4": "Nd4 I attack his queen and bishop with my knight.",
        "38. Qd2": "Qd2 hiblit moves his queen to safety while protecting the bishop.",
        "38... Re1": "Re1 I see one last chance for glory and use a tactic on hiblit.",
        "39. Qxe1": "Qxe1 hiblit takes the bait.",
        "39... Nc2+": "Nc2  I fork his queen and king.",
        "40. Kd2": "Kd2 hiblit moves to protect the queen.",
        "40... Nxe1": "Nxe1 I take the queen.",
        "41. Kxe1": "My opponent recaptures my knight and at this point I throw in the towel knowing it is pointless to continue."
    },
    "url": "https://gameknot.com/annotation.pl/tough-as-nails?gm=3668",
    "gameName": "TOUGH AS NAILS",
    "players": "hiblit (1626) vs. floppyjoe (1467)",
    "opening": "Philidor (C41), exchange variation"
}