{
    "moves": {
        "1. e4 e6 2. d4 d5 3. Nc3 Nf6 4. Bd3": "Not the most favored move, but a perfectly natural developing one, and consequently it cannot be bad.",
        "4... dxe4": "P-QB4 is generally played in this case instead of the text move.",
        "5. Nxe4 Nbd7 6. Nxf6+ Nxf6 7. Nf3 Be7 8. Qe2": "This is played to prevent ... P-QN3, followed by ... B-N2, which is Black's usual development in this variation.",
        "8... O-O 9. Bg5 h6": "Of course Black could not play ...P-QN3 because of BxN, followed by Q-K4.",
        "10. Bxf6 Bxf6 11. Qe4 g6": "This weakens Black's K side. ...R-K1 was the correct move.",
        "12. h4 e5": "This is merely giving up a Pawn in order to come out quickly with his QB. But as he does not obtain any compensation for the Pawn, the move is bad. ",
        "13. dxe5 Bf5 14. Qf4 Bxd3 15. O-O-O Bg7 16. Rxd3 Qe7 17. Qc4": "In order to keep the Black Queen from coming into the game.",
        "17... Rad8 18. Rhd1": "A better plan would have been to play R-K1, threatening P-K6.",
        "18... Rxd3 19. Rxd3 Re8 20. c3 c6": "Of course if... BxP, 21 NxB QxN 22 R-K3. Black with a Pawn minus fights very hard.",
        "21. Re3 c5 22. Kc2 b6 23. a4": "White's plan now is to fix the Q-side in order to be able to maneuver freely on the K-side, where he has a material advantage.",
        "23... Qd7 24. Rd3 Qc8 25. Qe4 Qe6 26. Rd5 Kf8 27. c4 Kg8": "Black sees that he now stands in his best defensive position, and therefore waits for White to show how he intends to break through.",
        "28. b3 Kf8 29. Kd3 Kg8 30. Rd6 Qc8 31. Rd5 Qe6 32. g4 Kf8 33. Qf4 Kg8 34. Qe4 Kf8": "Black persists in waiting for developments. He sees that if White plays P-KR5, he has... PxP. If White replies PxP, Black plays... Q-R6, causing White serious difficulties. White therefore decides to bring his King to KN3 to defend the squares KR3 and KN4 against invasion.",
        "35. Ke2 Kg8 36. Kf1 Kf8 37. Kg2 Kg8 38. Kg3 Kf8": "Now that he has completed his King march, White is ready to advance.",
        "39. h5 gxh5": "...P-KN4 would be answered by Q-B5, winning.",
        "40. gxh5 Qe7": "Against ...K-N1 white would play Q-N4 practically forcing the exchange of Q's, and would have an easy endgame win. Black would be down a Pawn and his B would be virtually useless.",
        "41. Qf5 Kg8": "Black overlooks R-Q7. The best defense was ... R-Q1, to which White would play N-R4 threatening N-N6 ch.",
        "42. Rd7 Bxe5+": "This loses a piece, but Black's position was altogether hopeless.",
        "43. Kg4 Qf6 44. Nxe5 Qg7+ 45. Kf4": "Black resigns. This game is notable for the march of the White King during the final stage. It is an instance of the King becoming a fighting piece, even while the Queens are still on the board."
    },
    "url": "https://gameknot.com/annotation.pl/tournament-game-new-york-1918?gm=52174",
    "gameName": "Tournament game, New York, 1918",
    "players": "Jose Raul Capablanca  vs. Oscar Chajes ",
    "opening": "French (C11), Swiss variation"
}