{
    "moves": {
        "1. d4 Nf6 2. c4 e6 3. Nc3 Bb4 4. a3 Bxc3+ 5. bxc3 d6 6. f3": "Cutting across Black's normal play on the white squares with the idea of establishing a dynamic position in the center.",
        "6... O-O 7. e4 e5": "Denied access to the white squares, he has to make what he can of the black.",
        "8. Bd3 Nc6": "Inviting P-Q5 when the weakness of the doubled pawns would be emphasized and his access to the black squares would be increased. White resists the bait.",
        "9. Ne2 Nd7 10. O-O b6 11. Be3 Ba6 12. Ng3 Na5 13. Qe2 Qe8 14. f4": "The energy in White's center begins to make itself felt.",
        "14... f6 15. Rf3 Kh8 16. Raf1 Qf7": "Forcing White at last to admit the threat to his doubled pawn.",
        "17. fxe5 dxe5 18. d5 Nb7": "At once shifting his focus onto the weakened black squares.",
        "19. Nf5 Nd6 20. Rh3 g6": "Taking steps against White's outpost, but the maneuver gives White further weaknesses to exploit.",
        "21. Nh6 Qg7 22. g4 g5": "He is once more forced to concede the outpost square and has a weak KB pawn into the bargain.",
        "23. Rh5 Nc5 24. Bxc5 bxc5": "Preventing any frontal attack on White's doubled pawns and leaving Black also with doubled pawns.",
        "25. Rf3 Qe7 26. Rfh3 Bc8 27. Qf2 Ne8 28. Rf3 Ng7 29. Rhh3": "Not 29 RxNP B-Q2 and the Rook is trapped.",
        "29... Bd7 30. Rhg3": "Preparing the advance of his KR pawn.",
        "30... Be8 31. h4 gxh4 32. Rg2 h3": "The pawn cannot be held, and giving it up this way interferes with White's build-up against the KB pawn.",
        "33. Rxh3 Bg6 34. Rf3 Rab8": "Having established his defensive position, Black prepares to counterattack on the Q side.",
        "35. Qh4 Rb3 36. Rgf2 Rxc3": "Black has won the doubled pawn after all, but at the cost of allowing White a devastating attack.",
        "37. g5 Ne8 38. gxf6 Qd8": "If 38... Q-Q3, 39 P-B7 N-N2 40 R-B6 increases the pressure.",
        "39. Ng4 Rxd3": "If ...Q-Q2, 40 Q-N5 still wins the KP.",
        "40. Rxd3 Bxe4 41. Re3 Nd6 42. Nxe5 Bf5": "Hoping to win the dangerous White KB pawn at last, but a drastic finish follows. Black no doubt thought the Bishop was taboo because of the resulting fork.",
        "43. Rxf5 Nxf5 44. Ng6+ Kg8 45. Re7": "A beautiful move. If 45... NxQ, 46 R-N7 mate. If 45... PxN, 46 Q-R7 mate. If 45 ... NxR, 46 PxN Q-K1 47 PxR (Q) ch wins easily.",
        "45... Rf7 46. Rxf7 Kxf7 47. Ne5+ Kf8 48. Qxh7": "Black resigns. If 48.. QxBP to stop 49 Q-R8 mate, 49 N-Q7 ch wins the Q."
    },
    "url": "https://gameknot.com/annotation.pl/tournament-game-karlsbad-1929?gm=56635",
    "gameName": "Tournament game, Karlsbad, 1929",
    "players": "Friedrich Saemisch  vs. Ernst Gruenfeld ",
    "opening": "Nimzo-Indian (E24), Saemisch variation"
}