{
    "moves": {
        "1. e4 e5 2. Nf3 Nc6 3. Bb5": "The Ruy Lopez, probably the most deeply analyzed opening in chess. Some published variations go for more than 40 moves of \"opening\" analysis!",
        "3... a6 4. Ba4 Nf6 5. O-O Be7": "The Closed Variation, leading to a slower, more positional game. 5...NxP, the Open Variation, can get tactical very quickly.",
        "6. Re1 b5 7. Bb3 O-O 8. c3 d6": "All by the book.",
        "9. h3": "Preventing the pin on the KN.",
        "9... Na5 10. Bc2 c5 11. d4 Qc7 12. Nbd2": "Black will play for a Q-side advantage, while White's play evidently lies on the K-side.",
        "12... cxd4 13. cxd4": "For the moment, Black controls the open QB file.",
        "13... Bb7 14. Nf1 Rac8": "Forming a battery on the open file.",
        "15. Bd3 Nc6": "15...N-Q2 is a drawish alternative.",
        "16. Ne3 Rfe8 17. Nf5": "17 P-Q5 would have a cramping effect.",
        "17... Bf8 18. Bg5 Nd7 19. Rc1": "Pinning...",
        "19... Qb8": "...and unpinning.",
        "20. Bb1 Nxd4 21. Nf3xd4 Rxc1 22. Bxc1 exd4": "A tactical burst that leaves Keres a Pawn up for the moment but with doubled, isolated QP's.",
        "23. Nh6+": "Fischer counters with gusto.",
        "23... gxh6 24. Qg4+ Kh8 25. Qxd7": "Now Keres' Pawn plus is virtually nullified by his horrible Pawn structure. He has TWO sets of doubled, isolated Pawns.",
        "25... Bd5 26. Qf5 Re5": "Keres tries to drive off Fischer's attack.",
        "27. Qf3 f5 28. Bf4": "Counterthrust!",
        "28... Re8 29. Qh5 Bxe4 30. f3": "Driving the Bishop.",
        "30... Bc6 31. Rc1 Bd7 32. Bxh6": "Winning back a Pawn.",
        "32... Re6 33. Bxf8 Qxf8": "More wood vanishes from the board.",
        "34. Qh4 Qf6 35. Qxf6+ Rxf6": "The Queens vanish, and the endgame begins in earnest. Keres is still up a Pawn, but his Pawns are very weak.",
        "36. Kf2": "An alternative choice was 36 R-B7 R-B2 37 R-R7, attacking Keres' Pawns from the rear.",
        "36... Kg7 37. Rc7 Rf7 38. Ke2": "Trying to centralize the King.",
        "38... f4 39. Ra7 Kf6 40. Rxa6": "Equalizing the material.",
        "40... Re7+ 41. Kf2 Be6 42. Rxd6 Ke5": "Keres tries to use his passed QP to generate a counterattack.",
        "43. Rc6 Bd5 44. Rh6 Rc7": "Trying to invade via the QB file.",
        "45. Rh5+ Kd6 46. Rh6+ Ke5 47. Rh5+ Kd6": "Down a Pawn, Keres tries to lure Fischer into drawing by threefold repetition.",
        "48. Rf5": "48 P-QN3 would severely restrict Black's Bishop.",
        "48... Rc1 49. Bd3 Rd1": "Keres has penetrated and now tries aggressively to force the issue.",
        "50. Ke2 Rg1 51. Kf2 Rd1 52. Ke2 Rg1": "Again trying to get a draw by threefold repetition.",
        "53. Rg5 Bxa2": "Material is again even...",
        "54. Bxb5": "...momentarily.",
        "54... Rb1 55. Kd3 h6": "55...RxP would make it very difficult for Fischer to produce a win.",
        "56. Rh5 Rxb2 57. Kxd4 Rxg2 58. Rxh6+": "Even if Fischer wins Keres' last Pawn, the ending is drawn if the Bishops are exchanged. If the Rooks are exchanged and Keres can reach KB3 for a King blockade, the ending is also a draw [White's B is the wrong color to Queen the KRP.]",
        "58... Ke7 59. Ke4 Rg5 60. Ba6": "A mistake. 60...B-N8 ch draws for Keres.",
        "60... Bf7": "Another mistake! Now Fischer retains winning chances.",
        "61. Bc8 Rg6 62. Rh7 Kf8 63. Bg4 Rg7": "Trying to trap Fischer into exchanging Rooks, which would enable Keres to set up a drawing fortress.",
        "64. Rh6 Rg6": "Now, however, Fischer can prevent the blockade after the exchange.",
        "65. Rxg6 Bxg6+ 66. Kxf4 Kg7 67. Kg5": "The critical move. Fischer's King blocks access to the square Keres needs to reach to successfully draw.",
        "67... Bd3 68. f4 Be4 69. h4 Bd3 70. h5 Be4": "Keres is trying to prevent the advance of the White KBP.",
        "71. h6+ Kh8 72. Bf5": "Blocking the B from the critical diagonal. Obviously Keres cannot trade, as Fischer would easily win the ensuing King and Pawn ending.",
        "72... Bd5 73. Bg6 Be6": "Occupying another diagonal to block the BP.",
        "74. Kf6 Bc4 75. Kg5 Be6 76. Bh5": "Fischer tries to drive off Keres' obstructing Bishop. If his P can reach KB6 the game is won.",
        "76... Kh7 77. Bg4 Bc4 78. f5 Bf7": "A last-ditch attempt.",
        "79. Bh5 Bc4 80. Bg6+ Kg8 81. f6": "Keres resigns. With his King confined to the back row, Fischer will simply use the black squares to move his own King to K7, supporting the KBP and enabling it to Queen after driving the black Bishop."
    },
    "url": "https://gameknot.com/annotation.pl/tournament-game-zurich-1959?gm=31230",
    "gameName": "Tournament game, Zurich, 1959",
    "players": "Bobby Fischer (GM) vs. Paul Keres (GM)",
    "opening": "Ruy Lopez (C99), closed, Chigorin, 12...c5d4"
}