{
    "moves": {
        "1. c4": "Tarrasch uses an English Opening.",
        "1... f5": "Richter responds with a Dutch Defense.",
        "2. d4": "Tarrasch attempts to immediately seize the center.",
        "2... e6": "Richter guards his KBP and opens a line for his KB.",
        "3. Nf3": "The first piece is developed.",
        "3... Nf6": "Richter counters with his own KN.",
        "4. e3": "Opening a line for the KB and preparing for K-side castling.",
        "4... b6": "Preparing for a Q-side fianchetto.",
        "5. Bd3": "Proceeding with his plan.",
        "5... Bb7": "Aiming at the future home of Tarrasch's King.",
        "6. O-O": "Tarrasch castles K-side anyway.",
        "6... Bd6": "Aggressive play, aiming at the White KRP.",
        "7. Nc3": "Having finished his K-side development, Tarrasch begins bringing out his Q-side pieces.",
        "7... Nc6": "Richter's last minor piece comes off the back rank.",
        "8. e4": "Bold play by Tarrasch. He feels he has the advantage and wishes to open the game.",
        "8... fxe4": "Richter issues a nonverbal challenge: \"Bring it on!\"",
        "9. Nxe4": "Completing the exchange of Pawns and centralizing his Knight.",
        "9... Be7": "Richter makes a slight retrenchment in the face of the gathering storm.",
        "10. Ne5": "Centralizing his other Knight and opening the diagonal for a potential Q-R5 ch.",
        "10... Nxd4": "Unafraid, Richter grabs a loose Pawn and opens up an attack by his fianchettoed Bishop.",
        "11. Nxf6+": "Tarrasch's attack begins.",
        "11... Bxf6": "11... PxN would have partially blocked in Richter's B, so he chooses the alternative recapture.",
        "12. Qh5+": "Tarrasch presses forward.",
        "12... g6": "Interposing, but Tarrasch will break down the barrier.",
        "13. Bxg6+": "This sacrifice will force the Black monarch to bestir himself. Richter delays this fate one move...",
        "13... hxg6": "...by capturing with the Pawn...",
        "14. Qxg6+": "...but with this move, he now has no choice.",
        "14... Ke7": "14... K-B1 would be answered with 15 Q-B7 mate, so Richter must move here.",
        "15. Ng4": "Tarrasch is relentless in his pursuit of the goal.",
        "15... Qf8": "Adding extra protection to the threatened Bishop.",
        "16. Nxf6": "Tarrasch captures anyway.",
        "16... Qxf6": "Forced, to avoid losing the piece. But now...",
        "17. Bg5": "...this pin appears to be crushing. Richter's Queen is a goner. ",
        "17... Ne2+": "Never give up! Richter's stunning counterattack swings the game in his favor in a heartbeat.",
        "18. Kh1": "Forced.",
        "18... Rxh2+": "A beautiful sacrifice. Mate is forthcoming.",
        "19. Kxh2": "Again forced.",
        "19... Rh8+": "Brilliantly played.",
        "20. Bh6": "This shortens the game by a move. ",
        "20... Qh4#": "A superb struggle. Richter, lying on the ropes, came up with a brilliant combination to score the knockout."
    },
    "url": "https://gameknot.com/annotation.pl/tournament-game-halle-1883?gm=33423",
    "gameName": "Tournament game, Halle 1883",
    "players": "Siegbert Tarrasch  vs. Bernhard Richter ",
    "opening": "English (A10), Anglo-Dutch defense"
}