{
    "moves": {
        "1. c4 Nf6 2. Nf3 e6 3. d4 d5 4. e3 Be7 5. Nbd2": "In preference to the older move N-B3, so that he can recapture with the Knight on QB4 and so make a strong point of his K5.",
        "5... O-O 6. Bd3 c5 7. dxc5 Na6": "Black, too, will recapture with the Knight and make a strong point of his own K5. Note that 7... QN-Q2 is less accurate because of 8 P-B6.",
        "8. O-O Nxc5 9. Be2 b6 10. cxd5": "Giving up hope of working the Knight via QB4 to K5 with any effect.",
        "10... Nxd5 11. Nb3 Bb7 12. Nxc5 Bxc5 13. Qa4 Qf6": "Delaying the development of White's Q side, and so gaining time.",
        "14. Ba6 Bxa6 15. Qxa6 Nb4 16. Qe2 Rfd8": "Showing his gain of time in the occupation of the open file.",
        "17. a3 Nd3 18. Ne1 Nxe1 19. Rxe1 Rac8 20. Rb1 Qe5": "White is now ready to free his game by P-QN4, so Black must invade the White position at once. If, however, 20... Q-B4 to enter at QB7, White replies 21 P-K4. The text move is a finesse to gain time to bring the Queen to Q4. If White now replies 21 P-QN4, Black plays 21... B-Q3 22 P-N3 Q-K5 and the entry square QB7 is again under control.",
        "21. g3": "Missing his last chance of keeping the black Queen off the white diagonals, which he could have achieved by 21 P-K4. Now Black breaks in.",
        "21... Qd5 22. b4 Bf8 23. Bb2 Qa2 24. Rba1 Qb3 25. Bd4": "A last effort to keep Black out by 25 QR-B1 would fail owing to the weakness of the Q side after 25... P-QR4.",
        "25... Rc2 26. Qa6": "Defence was better by 26 Q-Q1, so that if 26... P-K4 27 R-K2.",
        "26... e5": "Control of the seventh rank is now worth a pawn.",
        "27. Bxe5 Rdd2 28. Qb7": "If 28 R-KB1, Black has 28... QxKP 29 B-B4 (not 29 PxQ??? R-N7 ch 30 K-R1 RxP ch 31 K-N1 R(B7)-N7 mate) RxP 30 BxQ R-N7 ch etc. While if 28 Q-B1, Black has 28... Q-Q4 29 B-B4 Q-B6 and the KBP is still vulnerable.",
        "28... Rdxf2 29. g4 Qe6 30. Bg3 Rfxh2": "A most attractive forcing of the rank. If now 31 BxR, Black has 31... QxNP ch 32 K-R1 Q-R6 forcing mate.",
        "31. Qf3 Rhg2+ 32. Qxg2 Rxg2+ 33. Kxg2 Qxg4 34. Rad1 h5 35. Rd4 Qg5 36. Kh2 a5 37. Re2 axb4 38. axb4 Be7 39. Re4 Bf6 40. Rf2 Qd5": "He is reduced to an utterly negative position. One Rook must stay on the KB file to prevent ...P-KN4. The Bishop must stay on its present diagonal, otherwise ...B-K4 ch follows. And what of the remaining Rook? If 41 R/4-B4, Black has 41... B-K4 42 RxP BxB ch 43 KxB QxR 44 RxQ KxR with a won K and P ending. If White tries 41 R-K8 ch, Black plays 41.. K-R2 42 R-QB8 Q-K5 and more White pawns fall. So White resigns."
    },
    "url": "https://gameknot.com/annotation.pl/tournament-game-new-york-1927?gm=51621",
    "gameName": "Tournament game, New York, 1927",
    "players": "Aron Niemzowitsch  vs. Jose Raul Capablanca ",
    "opening": "English opening (A15)"
}