{
    "moves": {
        "1. e4": "Standard fare.",
        "1... c5": "The Sicilian, indicating Suechting is in a fighting mood.",
        "2. d4": "Played, presumably, to steer Suechting into a variation of Krejcik's chioce. ",
        "2... cxd4": "The obvious response.",
        "3. Nf3": "Instead of an immediate recapture, Krejcik concentrates on getting his pieces developed quickly.",
        "3... Nc6": "Suechting counters by developing his own pieces. When you accept an opening gambit, it is best to develop fast and return the Pawn if necessary.",
        "4. Nxd4": "Krejcik now does recapture the Pawn. If 4... NxN, 5 QxN leaves White's Queen beautifully centralized in a position where Black cannot easily drive it from.",
        "4... e5": "Black instead plays to force the Knight back.",
        "5. Nxc6": "Rather than lose a tempo by retreating, Krejcik captures Suechting's Knight in a position where Suechting must recapture with a Pawn.",
        "5... bxc6": "Suechting's QBP is now in a position to support ...P-Q4.",
        "6. Bc4": "Temporarily preventing ...P-Q4, as White would end up a Pawn ahead after the exchanges.",
        "6... Nf6": "Again guarding the Q4 square. ",
        "7. O-O": "White sets a clever trap. The move apparently leaves the Pawn on K4 hanging.",
        "7... Nxe4": "Black's greed gets the better of him.",
        "8. Re1": "If the Knight retreats now, White wins back his Pawn with 9 RxP. Yet this is Black's best line.",
        "8... d5": "Black thinks this is a clever move. White, however, has a better one.",
        "9. Rxe4": "Black can still escape unharmed with 9... PxB 10 QxQ ch KxQ 11 RxKP, and even though Black cannot castle material is even and the game is still playable. However, once again he gets greedy.",
        "9... dxe4": "The losing move. ",
        "10. Bxf7+": "Black resigns. After 10... KxB 11 QxQ White's material advantage gives him a technically easy win."
    },
    "url": "https://gameknot.com/annotation.pl/tournament-game-wenen-1908?gm=37181",
    "gameName": "Tournament Game, Wenen 1908",
    "players": "Josef Krejcik  vs. Hugo Suechting ",
    "opening": "Sicilian (B21), Andreaschek gambit"
}