{
    "moves": {
        "1. e4 c6 2. d4 d5 3. Nc3 dxe4 4. Nxe4 Nd7 5. Nf3": "5 Q-K2 QN-B3 [not 5.. KN-B3??? 6 N-Q6 mate] gives White nothing.",
        "5... Ngf6 6. Nxf6+": "The Knight is not well-placed after 6 N-N3.",
        "6... Nxf6 7. Bc4 Bf5 8. Qe2 e6 9. Bg5 Bg4": "This super-refinement reduces all of White's attacking prospects. Petrosian has a knack for snuffing out such dreams twenty moves before they even enter his opponent's head!",
        "10. O-O-O Be7 11. h3": "It might have been better to prevent further simplifications with 11 K-N1 N-Q4 12 B-B1! 0-0 13 B-Q3, etc.",
        "11... Bxf3 12. Qxf3 Nd5": "Forces an exchange of Bishops.",
        "13. Bxe7 Qxe7 14. Kb1 Rd8": "I had expected 14... O-O-O,",
        "15. Qe4 b5": "Now it's apparent why Black didn't castle long. He wants to drum up counter-play on the Q-side, which he couldn't do if his King lived there.",
        "16. Bd3 a5 17. c3": "Already White has been thrown on a mild defensive.",
        "17... Qd6": "17... P-R5 would be met by 18 P-R3.",
        "18. g3": "I thought he wanted to exchange Queens.",
        "18... b4 19. c4": "Practically forced -- but now the QB Pawn is weak.",
        "19... Nf6 20. Qe5": "After 20 Q-K2 O-O 21 B-B2 P-B4 White could easily end up with the bad Bishop.",
        "20... c5 21. Qg5": "This looked like a shot ---",
        "21... h6": "-- but instead it's a shock.",
        "22. Qxc5 Qxc5 23. dxc5 Ke7": "23... R-QB1 immediately is also good.",
        "24. c6 Rd6 25. Rhe1 Rxc6 26. Re5 Ra8 27. Be4": "Right after I made this move, Petrosian offered a draw. I was ready to accept, but Tal happened to be standing there at that moment, hovering anxiously, since a drawn result would practically clinch first place for him. [It would have put him up a full point over Fischer with just one round remaining -- LA] So I refused -- not because I thought White has anything in the position, but because I didn't want to give Tal the satisfaction!",
        "27... Rd6": "Serendipity. Simply 27... NxB leads to a dead draw.",
        "28. Bxa8": "This obvious capture shattered Petrosian, who apparently had been engrossed in analyzing the intricacies of 28 RxR KxR 29 RxP ch PxR 30 BxR K-B4 31 P-N3 N-Q2 32 K-B2 K-Q5 with an absolute bind on the dark squares.",
        "28... Rxd1+ 29. Kc2 Rf1": "There's no turning back. If 29... R-Q1 30 RxRP wins.",
        "30. Rxa5 Rxf2+ 31. Kb3 Rh2 32. c5 Kd8": "On 32... RxRP 33 R-R7 ch K-Q1 34 RxP RxP ch 35 KxP the Q-side Pawns hurtle toward a touchdown. The Bishop, since it can control both wings at once, is vastly superior to the Knight.",
        "33. Rb5": "On 33 R-R7, 33... N-Q2! 34 P-B6 N-N3 holds.",
        "33... Rxh3": "Now 333... N-Q2 is refuted by 34 P-B6.",
        "34. Rb8+ Kc7 35. Rb7+ Kc6": "I suspect Petrosian saw White's reply, but wanted to be put out of his misery. 35... K-B1 36 RxBP RxP ch 37 KxP is futile.",
        "36. Kc4": "Petrosian resigns. There's no defense to the discovered checkmate."
    },
    "url": "https://gameknot.com/annotation.pl/tournament-bled-1961?gm=53951",
    "gameName": "Tournament, Bled 1961",
    "players": "Bobby Fischer (GM) vs. Tigran Petrosian (GM)",
    "opening": "Caro-Kann (B17), Steinitz variation"
}