{
    "moves": {
        "1. e4 e5 2. Nf3 Nc6 3. Bc4 Bc5": "The \"Quiet Game\" will soon turn not so quiet.",
        "4. c3 Nf6 5. O-O": "5 P-Q4 is the usual --and good -- move. This move allows Winawer to make a quick tactical strike that leaves him with a dominating Pawn position.",
        "5... Nxe4 6. Bd5 Nxf2": "The risky but potentially devastating tactical finesse is underway.",
        "7. Rxf2 Bxf2+": "This gives Winawer two more Pawns than Albin. If Winawer can quickly mobilize his Pawns, Albin will be swept off the board. Albin must counter by quickly developing his Q-side.",
        "8. Kxf2 Ne7": "Attacking White's advanced B.",
        "9. Qb3 O-O": "Winawer secures his own King before engaging in attacking maneuvers. Albin *must* now focus on developing his Q-side pieces.",
        "10. Be4 d5": "This Pawn advances with tempo, as White is forced to move his wandering Bishop yet again.",
        "11. Bc2 e4": "Now Winawer gains another tempo, as Albin must move his Knight. Albin's Q-side is still a hopeless mess.",
        "12. Ne1 Ng6": "Preparing for ...P-KB4-B5 and also opening the diagonal for ...Q-R5 ch.",
        "13. c4 d4": "14 BxP? Q-R5 ch! wins the B.",
        "14. Qg3 f5": "The Pawns are sweeping forward in an inexorable Black wave, pushing aside everything in their path.",
        "15. Kg1 c5": "Yet another Pawn advances. Albin can do nothing to stop the invasion.",
        "16. d3 f4": "Forcing back the Q.",
        "17. Qf2 e3": "Gaining another tempo by again attacking the Q.",
        "18. Qf3 Qh4": "Preparing to mount the final assault on the forlorn White King. With the Q-side pieces as useful as a cast-iron life jacket, Albin can mount no adequate defense.",
        "19. Qd5+ Kh8": "Dodging away from the spite check.",
        "20. Nf3 Qf2+": "Forcing White into the corner.",
        "21. Kh1 Nh4": "Threatens ...QxP mate.",
        "22. Qg5 Bh3": "Albin resigns. Black simply has too many threats."
    },
    "url": "https://gameknot.com/annotation.pl/tournament-game-nuremberg-1896?gm=36767",
    "gameName": "Tournament Game, Nuremberg 1896",
    "players": "Adolph Albin  vs. Simon Winawer ",
    "opening": "Giuoco Piano (C53)"
}