{
    "moves": {
        "1. d4 d5 2. c4 e6 3. Nc3 Nf6 4. Bg5 Be7 5. Nf3 Nbd7 6. Rc1 O-O 7. e3 b6": "(LA) Book QGD, Orthodox.",
        "8. cxd5 exd5 9. Bd3 Bb7 10. O-O c5 11. Re1 c4 12. Bb1 a6 13. Ne5 b5": "(LA) It is already clear that Black will operate on the Q side, while White's chances lie on the K side.",
        "14. f4 Re8 15. Qf3 Nf8": "(EZB) White's attack is the more dangerous inasmuch as it can lead to a mate, but there is no weakness in Black's camp and his plan will be to hold White's attack and to obtain a preponderance on the Q side with the ultimate object of obtaining an advanced passed Pawn and queening it... ...White's only hope is centered in his attack, whilst Black has every incentive to bring about an end game.",
        "16. Ne2 Ne4": "(EZB) Every exchange is in Black's favor, as thereby the defence becomes easier, the attacking forces are diminished in numbers and the end game is so much nearer. This move forces the exchange because of Black's threat of ...P-KB3.",
        "17. Bxe7 Rxe7 18. Bxe4 dxe4 19. Qg3": "(EZB) What are now White's actual threats? He can advance the KBP and attack Black's isolated KP. To this end he will need 7 moves (P-B5, Q-R4, R-B1, B-B4, N-N4, N-B2, N-N3) while Black, in order to defend this threat, needs 5 moves (P-B3, B-Q4, Q-Q2, Q-B3, QR-K1), and can utilize his extra tempi in advancing his Q side Pawns. However, he will require a supplementary defensive move because after N-N4 White threatens N-R6 ch, so Black must insert ...K-R1.",
        "19... f6 20. Ng4 Kh8 21. f5 Qd7 22. Ref1 Rd8 23. Rf4 Qd6 24. Qh4 Rde8 25. Nc3 Bd5 26. Nf2 Qc6": "(EZB) Black, with some moves to spare, has marked time and has accomplished nothing with his Q side Pawns... ...All Black's pieces are now available for the defence and nothing stands in the way of the beginning of his advance on the Q side.",
        "27. Rf1 b4 28. Ne2 Qa4": "(EZB) White is facing a serious problem -- how to protect his QRP. If 29 N-B1, 29... Q-B7 attacking the QNP followed by ... Q-Q6 attacking the KP. The solution is to combine attack and defence.",
        "29. Ng4 Nd7": "(EZB) it is a pity to have to displace this Knight which was so well placed for the defence of the KRP and the squares at Black's K3 and KN3. But unless Black resigns himself to a purely defensive game and forgoes any attempt to win, he has to take a certain amount of risk.",
        "30. Rf4f2": "(EZB) If 30... QxP, 31 N-B4 B-B2 32 N-N6 ch BxN 33 PxB P-R3 34 NxRP with an easy win. The White QRP cannot yet be captured.",
        "30... Kg8 31. Nc1 c3 32. b3 Qc6": "(EZB) All of Black's pieces are cooperating in the defense. But if he wishes to succeed with his own attack he will have to detail at least one piece for that purpose. What is his plan of attack in the present circumstances? The only possible one is to advance the RP and exchange it for the QNP; then he will occupy the QR file with a Rook and attack the QNP with R and B. It is possible to calculate exactly the number of moves required in this process. That number is 4 moves; on the 5th move the QNP will be attacked twice. Now what of White? Again there is only one possible plan: the opening of the KN file. This will also require 4 moves, but on the 4th move the KBP will already be under attack. Had Black not lost one or two moves in his earlier maneuvers HIS threat would be the first to mature.",
        "33. h3 a5 34. Nh2 a4 35. g4": "(EZB) Now Black must decide between two courses: he must either ruthlessly continue the advance on the Q side or take some defensive measures to stop White's advance on the K side. This he could acheive by 35... P-R3; upon which White would have to play 36 Q-N3 [preparing for P-R4] and Black would have time to defend himself by 36... N-B1 37 P-R4 N-R2 38 P-N5 KRPxP 39 N-N4 PxRP 40 QxP N-N4, threatening 41... N-B6 ch. If 40 R-R2, 40... K-B1 leaving the Bishop to guard Black's KN1. But Black prefers to attack himself, in the belief that he will reach his objective ahead of White.",
        "35... axb3 36. axb3 Ra8 37. g5": "(EZB) If Black plays ... PxP, 38 QxNP [threatening P-B6] Q-B3 39 Q-N3, threatening N-N4. Black would have no defense against P-B6 and N-K5. If Black plays 38... N-B3. 39 N-N4 threatening N-K5 and R-KN2. The Knight cannot be taken due to... QxR. Therefore, Black must leave the exchange to White and can get in a move in furtherance of HIS attack.",
        "37... Ra3 38. Ng4": "(EZB) Black cannot take the KNP (38... PxP 39 QxP N-B3 40 R-KN2 with a decisive attack) and he therefore must take the QNP, the object of his attack, and hope for the best.",
        "38... Bxb3": "(EZB) White cannot now play 39 NxB RxN because of Black's ensuing threat of ...R-N7, negating White's Rook on the second rank.",
        "39. Rg2 Kh8 40. gxf6": "(EZB) If now 40... NxP, 41 N-K5 threatening N-N6 ch.",
        "40... gxf6 41. Nxb3 Rxb3 42. Nh6": "(EZB) With a terrible mating threat by R-N8. If ...R-K1, N-B7 mate. Two white squares are defenceless because the Bishop has gone... The Black king, denuded of pieces, is defenceless... The game is lost because Black lacks the help of his Bishop. If he had captured the QNP with his *Rook*, giving up the Exchange, he would have preserved his Bishop, which was so essential to the defence, and the two united passed pawns supported by the Bishop would have been more than a match for the Rook. Black had this tactical opportunity and failed to take it. Either he did not see it, or he underestimated the dangers of the situation, or he lacked the pluck to make the sacrifice. White, by contrast, did not hesitate to sacrifice  a whole Knight. Black did not lose because of a faulty conception; his tactical failure in its execution was his downfall.",
        "42... Rg7 43. Rxg7 Kxg7 44. Qg3+ Kxh6 45. Kh1 Qd5 46. Rg1 Qxf5 47. Qh4+ Qh5 48. Qf4+ Qg5 49. Rxg5 fxg5": "(LA) Were Black's King not trapped on the edge, but at somewhere like his K2, he would still have good drawing chances. But White can now spin a mating net.",
        "50. Qd6+ Kh5 51. Qxd7 c2 52. Qxh7#": "(LA) I hope you all find this game as enjoyable to review as I did."
    },
    "url": "https://gameknot.com/annotation.pl/tournament-game-hastings-1895?gm=46562",
    "gameName": "Tournament game, Hastings 1895",
    "players": "Harry N. Pillsbury (GM) vs. Siegbert Tarrasch (GM)",
    "opening": "QGD (D53), 4.Bg5 Be7"
}