{
    "moves": {
        "1. e4": "The king's pawn game.",
        "1... e5": "The double king's pawn opening, which is my usual choice.",
        "2. Nf3": "The king's knight opening: White attacks Black's pawn on e5.",
        "2... Nf6": "This is called the Petroff. Black chooses not to respond to White's attack on the pawn by defending it, but attacks White's e4 pawn instead.",
        "3. Nc3": "A good response, defending the pawn and still threatening Black's pawn on e5. The normal move is 3.Nxe5, after which Black first plays 3...d6 to chase back the knight, and after 4.Nf3 he can take the pawn on e4.",
        "3... Nc6": "Now we have transposed into a simple four knights game.",
        "4. Bb5": "! This is a good move if you like to play the Ruy Lopez. The type of play is similar. The Ruy Lopez can also be called Spanish opening, and because of the similarity with the Ruy Lopez this variation is called the Spanish four knights.",
        "4... Nd4": "This is an agressive move. Black hopes to get a wild and interesting game very quickly. The bishop on b5, knight on f3 and pawn on c2 are all attacked, but they are defended well for the moment. Meanwhile Black has a pawn hanging as well...",
        "5. Nxe5": "!? And White decides to take it. And if you don't see a problem with taking, why not? Actually the move does not win a pawn, since after my next move I will win it back, but this move is not bad. More common, however, are 5.Ba4 and 5.Bc4. With those moves White tries to preserve his bishop pair, which can be a strong force in open positions like this one.",
        "5... Qe7": "With this move Black attacks White's knight on e5 and if it moves, he will win the pawn on e4 back. The disadvantage is that he blocks his bishop on f8 in. Usually that is temporary so it's not such a big deal.",
        "6. Nc4": "?? A perfectly natural reply, but it gives away a piece. The most common move in this position is to defend the knight with 6.f4 and after 6...d6 move it to f3, after Which Black can exchange on b5 and win back the pawn on e4. Another possibility is 6.Nf3 which is also a good move.",
        "6... a6": "The retreating route for the bishop was just blocked off and if it flees to a4, Black plays 7...b5 with a pawn fork. There is no way to save the piece.",
        "7. O-O": "?! It's good to castle to get your king safe and develop your rook, but in this case White should have waited. He can win a pawn for his piece by playing either 7.Ba4 b5 8.Bxb5 axb5 or 7.Bxa6 bxa6 (or 7...Rxa6). Now Black wins a full piece. When you know you're going to lose a piece, you should try to win as much material as possible for it.",
        "7... axb5": "Taking the bishop and attacking the knight at the same time.",
        "8. Ne3": "The knight retreats to the only good square. 8.Na3?? is not only bad because 'a knight on the rim is dim', but also because the pawn fork 8...b4 wins a knight for Black.",
        "8... Nxe4": "?? I simply took the pawn, but when I analyzed with my computer I discovered that this is actually a blunder, as I will explain momentarily.",
        "9. Nxe4": "? Fortunately for me, White didn't capitalize on my mistake. The move 9.Ned5! would have chased my queen away from the defence of my knight. After 9...Qc5 or 9...Qd8 White can simply take the knight with his c3 knight and after 9...Qe5 White can pile on the pressure on the knight by 10.Re1. I can try to defend with 10...f5 but after 11.d3 there are just too many attackers and my knight will eventually fall. The move played just leaves White a piece behind. It exchanges knight voluntarily and exchanging is usually not good when down in material, but if he leaves the knight there I can exchange myself and 9.Nb1? is just a horrible place for the knight. After 9.Nxe4 Qxe4 White can try to develop while attacking the queen (developing with tempo) so I think that 9.Nxe4 is the second best move. But really, the only good move is 9.Ned5. This goes to show that a 1700 like me can also make blundners and that you are not without a chance against them.",
        "9... Qxe4 10. d3": "! A very good move, attacking the queen and giving the c1 bishop a diagonal to develop on. Especially when the knight on e3 has moved, it has some nice squares to move to, for example e3 or f4.",
        "10... Qg6": "Retreating the queen while keeping an eye on the White kingside. I'm thinking of a kingside attack. I don't know how yet, but  I thought a bishop on d6 could be nice. Another move which could possibly be a threat was ...Bh3, which is not possible now but could be played after moving the d-pawn. If the knight on e3 would not be there and I could put a bishop on h3 now, I would be winning an exchange because I would be threatening mate on g2 and the only defence would be g3, which would allow ...Bxf1 Kxf1. These moves are potential threats to White and thus they are part of my plan. When I can execute them with good effect, I will be totally winning so I'm going to try to be able to play them. Of course I also have to assess the probability that I can play my plan, if it is an unrealistic plan it doesn't make sense to try to execute it, of course. This is a good method of long-term planning, which I use quite often.",
        "11. Nd5": "! Another good move by White. It attacks the c7 pawn and threatens a fork between my king on e8 and rook on a8. I have to defend the fork and there are four ways to do that, 11...Kd8, 11...Qc6, 11...Qd6 and 11...Bd6. Those are the candidates I need to examine.",
        "11... Bd6": "I chose this move because it was part of my plan anyway and because it develops another piece. The disadvantage is that it blocks in the d-pawn, so I can't play ...d6 to control the center and allow my bishop to develop, but I had already foreseen that this wouldn't be a big problem since I can first chase the knight with ...c6, then retreat my bishop to c7 and then play ...d5. This was the way in which I was planning to execute my plan mentioned before.",
        "12. Re1+": "A good move. This rook was not very active yet and is developed to an open file while forcing me to block the check. I have to either retreat a piece or move my king, which would take away my castling possibility. You could call this 'developing with tempo' since White develops a piece and I'm not able to respond with a developing move as well.",
        "12... Ne6": "This is the best choice. I did not want to move my king because that would take away my castling right, as mentioned earlier, and if I would play 12...Be7?? White could fork my king and rook with 13.Nxc7+. 12...Qe6?? would just throw away my queen.",
        "13. b3": "Trying to form a fianchetto, but the bishop could already be developed (on e3). Therefore, I think that this loses time because it was an unnecessary move. The fianchetto is a good idea in itself, but the bishop is equally effective on e3 and the weakness of the dark squares on the queenside will play a role in the game later on (after the dark-squared bishop has gone).",
        "13... O-O": "Getting my king to safety and removing the pin on my knight.",
        "14. Bb2 c6": "As per my plan mentioned above, I kick back (or hit or chase away, other words with almost the same meaning) the knight, enabling ...Bc7 and ...d5 next.",
        "15. Nc3": "A good move. It blocks the fianchetto bishop temporarily, but the bishop is still powerful on the long diagonal since the knight can move away easily and then the bishop has again control over the diagonal.",
        "15... Bc7": "Continuing with the execution of my plan. I want to play ...d5 next. Notice that 4 of my 6 last moves (10...Qg6, 11...Bd6, 14...c6 and 15...Bc7) have been part of a general plan which I had already decided on at move 10.",
        "16. Ba3": "?? Unfortunately, this is a big blunder because the bishop is unprotected. However, I do like the idea that jkarp probably had in mind when he played this move. He wanted to force my rook to move, either to the d-file where it is passive as well, or to e8 where it walks into a pin. The pin is not devastating or anything, but at least the knight on e6 is tied down and can't move, so that my bishop on c8 is also blocked in (after I have played ...d5 it can still only develop to d7).",
        "16... Re8": "?? Somehow, I miss that the bishop is unprotected. Was it the open a-file, which I'm not used to have, or was it just a problem with my concentration? I don't know, but of course I should just have played 16...Rxa3.",
        "17. Rb1": "?? White had to return the bishop to b2 (or c1, but that's a very passive square), of course.",
        "17... Rxa3 18. Rb2": "?! I don't know what this move accomplishes. The only thing I can see is that it protects the pawn on a2, but that pawn was already protected by the knight on c3. On b2, the rook has less room to manoeuver and White also walks into a pin.",
        "18... Qf6": "Now that the dark-squared bishop is gone, the weakness of the dark squares on the queenside created by the move 13.b3 is starting to tell. Because there's no bishop which can protect them, White has to block the diagonal with 19.d4.",
        "19. Qd2": "?! This move is not very good. As I mentioned before, 19.d4! was the best move in this position. It removes the attack of the queen on the knight and the rook. Of course I can't win that pawn for free, because 19...Qxd4?? 20.Qxd4 Nxd4?? walks into the back rank mate 21.Rxe8#. After the move played, Black can take advantage of the pin.",
        "19... Ba5": "? I do not take advantage completely. With 19...Be5 I can win the knight, because it can't be defended and it can't move as well, due to the pin on the rook. White's best, then, according to the computer (and I agree) is 20.Ne4! (attacking the queen), after which I can play 20...Bxh2+! (sacrificing the bishop, but winning the rook next turn) 21.Kxh2 Qxb2. I thought my move would work just as well, but I missed a defence...",
        "20. b4": "! ... which jkarp did find. Well done.",
        "20... Qxc3": "I want to exchange and this move does force the exchange of queens, but I could have gained a pawn with 20...Bxb4! (the bishop is going to be taken anyway) 21.Rxb4 Qxc3 22.Qxc3 Rxc3. It doesn't matter that much though, because I'll win some pawns anyway.",
        "21. Qxc3 Rxc3 22. bxa5 Nc7": "Unpinning my knight and also forcing another exchange or else the rook has to go to a very passive square. Here we see that by threatening something (an exchange, in this case, which would not be good for White) I improve my position by force.",
        "23. Ra1": "I guess 23.Rc1 was a bit more accurate, because I would not be able to win the c-pawn as easily. It also contains a trap: if I want to get to the 2nd rank with my rook to attack White's pawns (23...Re2), White can chase my rook with 24.Kf1 and if I want to stay on the 2nd rank with 24...Rd2?? White traps my rook with 25.Ke1!. So instead I have to retreat at move 24, making 23...Re2 quite useless.",
        "23... Re2": "The 2nd rank (or 7th rank for White) is a great place to be for a rook (unless it can be chased away). That is because there are many pawns to attack (especially when they are still in their starting positions) and because it restricts the king to the 1st (8th) rank. Especially in an endgame this is very powerful.",
        "24. Kf1": "?! White could still protect his pawn with 24.Rc1.",
        "24... Rcxc2 25. Rxc2": "Another exchange, but if White wanted to avoid it, he had to move the b2 rook after which I could start picking up pawns with 25...Rxf2+ and then also the g2, h2 and a2 pawns can probably be taken. That's the power of a rook (or two rooks) on the 2nd (7th) rank. So I think this was the best choice for White.",
        "25... Rxc2 26. d4": "Probably wanting to block my advance on the queenside (because after 26...c5 27.dxc5 Rxc5 I have very weak pawns there).",
        "26... d5": "Finally giving my bishop some air to breathe (a diagonal to be developed on).",
        "27. Re1": "!? Letting go of the a2 pawn, but also setting a trap. I think this is an OK move, probably it's hard to protect those pawns anyway and White has to play actively to even have some chance to draw this game..",
        "27... g6": "?? A blunder, but fortunately not fatal. I wanted to free my knight from his defensive duty (it has to defend e8 because of the back rank mate) but instead I allow a tactic for White.",
        "28. Re7": "!! And he seizes that chance immediately. A very good move, because I can still not really move my knight: after (for example) 28...Ne6, White wins a bishop with 29.Re8+ Kg7 30.Rxc8. I thought I would trap the rook with 28...Ne6 and then 29...Kf8, but I had missed 29.Re8+.",
        "28... Bg4": "!? Instead I threaten mate (29.Rxc7?? Rc1#), knowing that a piece will be lost no matter what I do. ",
        "29. f3": "! But of course White sees that. Now two of my pieces are under attack and I have to give up one of them.",
        "29... Bxf3": "I choose to sacrifice the bishop, because it isolates White's pawns on the kingside.",
        "30. gxf3 Ne6": "I still had to move my knight out of danger and this was the most active spot. The b7 pawn could not be saved anyway.",
        "31. Rxb7": "Creating two passed a pawns.",
        "31... Rxa2": "Taking one of them, attacking the other and creating a passed b-pawn for myself.",
        "32. Ra7": "Defending his own pawn. It won't be able to promote though.",
        "32... Nxd4": "Taking another pawn and planning a switch to the queenside to help defending against promotion.",
        "33. a6": "Pushing the pawn, hoping for me to slip up.",
        "33... c5": "But this time I defend accurately and White decides to resign. He can get the pawn to a7, but no more: 34.Ra8+ Kg7 35.a7 Nc6 and the pawn will be captured, after which my three connected passed pawns will decide the matter. Jkarp saw that I would be able to get an inevitable pawn promotion and therefore he resigned the game. Thanks to jkarp for playing this enjoyable game. I hope you have learned a lot from this game and I also did learn something: never underestimate your opponent, always sstay concentrated even in a winning position. I think jkarp played a very good game and I really had to work for this win."
    },
    "url": "https://gameknot.com/annotation.pl/training-game-with-jkarp?gm=45562",
    "gameName": "Training game with jkarp",
    "players": "jkarp (1073) vs. l-d-j (1738)",
    "opening": "Petrov three knights game (C42)"
}