{
    "moves": {
        "1. e4": "Here's a loss in a Training Tournament I was invited into.",
        "1... c5": "Sicilian - my favourite, though, according to my Personal Database here in Gameknot, I'm not too successful with it... ",
        "2. Nf3 d6 3. d4 cxd4 4. Nxd4 Nf6 5. Nc3 a6": "The Najdorf Variation - still my favourite.",
        "6. Bg5": "White's strongest continuation, I believe.",
        "6... e6": "Although the Najdorf is supposed to enable ...e5, it's not a move I've ever played in this position, preferring the more flexible ...e6.  Perhaps I should try ...e5?",
        "7. f4 Be7 8. Qf3 Qc7": "This is a well-worn trail.  I think White's chances are better but Black has good counter-attacking options if White slips up.",
        "9. O-O-O Nbd7 10. g4": "The recommended move.  White is preparing an all out attack on Black's position, wherever the King goes.",
        "10... b5": "Black prepares to counter-attack, fianchetto and castle Queenside",
        "11. a3 Bb7 12. Bxf6": "A critical decision point for Black.  The B is needed to support the pawn on d6 but has counter-attacking potential on the long black diagonal.  Both the N and B, if they recapture, are vulnerable to pawn thrusts.  Recapturing with the pawn doubles the pawns on the f-file but opens the g-file for Black's rook.  If the B stays on e7 it is virtually paralysed and in many variations difficult to protect from attack by White's knights.",
        "12... gxf6": "I opted for the wall of pawns.",
        "13. f5": "White immediately seeks to disturb the wall.",
        "13... e5": "While the King was still in the centre, this seemed the safest option but it gave White control of the White squares and left the Bishop very vulnerable.",
        "14. Nb3": "This seemed a conservative move and I felt good after it.  In another game, happening more or less simultaneously, White played 14. Nd5, which seemed to cause me more immediate problems and also won, but I probably made mistakes in that game too ...",
        "14... O-O-O": "Now we're moving into the middle game where tactics are used by both sides either to force a quick mate, material superiority or a conclusive strategic advantage.  Failing that, a draw through repetition is often an option.  White still has the initiative here but if he's too slow to prosecute the attack, Black can quickly counter-attack.",
        "15. Kb1": "White first moves off the vulnerable c-file and prepares to occupy that file with his Rook.  Black would do well to follow suit but I don't want to use that tempo with a quiet King move.  I choose to attack...",
        "15... Nc5": "This move frees up Black's position at the rear somewhat, giving the KB some protection from the Queen and also puts pressure on White's e-pawn and threatens to swap off one of White's King's defenders... either that or to go to a4 and attack the King's position directly, but to be truly dangerous, Black needs to get his Rook on the c-file.",
        "16. Nc1": "He who runs away lives to fight another day, as a chess club colleague is wont to say...Now White can push Black's N back with b4.",
        "16... Qb6": "Black supports a potential push with his own b-pawn but more urgent was moving the King off the c-file.",
        "17. Nc1a2": "White patiently manoeuvres his knight to a strong square and supports the other knight.",
        "17... Bc6": "This move prepares ...a5 by over-defending b5 but again the King move is preferable.",
        "18. Nb4 Be8": "Consistent with the previously mentioned plan but fatally relinquishing control of d5.",
        "19. Nbd5": "!! This knight controls the game.",
        "19... Qb7 20. b4 Na4 21. Nxa4 bxa4": "Each move opens up the position.  It is very double-edged but White has the initiative and doesn't let it go.",
        "22. Qc3+ Kb8 23. Bxa6": "Now Black cannot take because of Qc7+ followed by Nb6+ when Black loses his Q to avoid immediate mate.",
        "23... Qa7 24. b5": "The noose closes in...",
        "24... Bxb5": "Black has to offer up material to loosen White's grip and develop counter-chances.",
        "25. Bxb5 Rdc8": "At last Black's Rook occupies the c-file, attacking White's Q",
        "26. Bc6": "But blocking the attack opens up new lines for White.",
        "26... Rxc6": "Another sac to save His Majesty.",
        "27. Qxc6 Rc8": "The other Rook joins the defence.  Black's only advantage here is that all his pieces are involved, whereas White's h-rook is a mere spectator.",
        "28. Qb5+": "but with this I raised the white flag.  Blocking with the Q allows White to swap Qs and then snaffle the B, leaving a simple win by material superiority.  Moving the K to a8 allows Nb6+ forking King and Rook.  Worse, Black's only escape from mate is to take the Nb6 with his Q: too high a price.  Still, I learned something from this game :-)"
    },
    "url": "https://gameknot.com/annotation.pl/training-tournament?gm=26547",
    "gameName": "Training Tournament",
    "players": "darknessvisible (1948) vs. rjacobs (1539)",
    "opening": "Sicilian (B99), Najdorf, 7...Be7 main line"
}