{
    "moves": {
        "1. d4 d5 2. Nf3 e6 3. e3 Nf6 4. c4 Be7": "So, by playing it differently, this is as though it were the QGD as noted.  So, the way to decline is by not taking which is what she does.  Instead, Sue plays an interesting move by developing her B.  Consequently, I for it by exchanging her center pawn for my c pawn.",
        "5. cxd5 exd5 6. Nc3": "Being that my c pawn is now on the d file, I develop my Nb1 at once because I want both N's out before the B.  It's based a little on what Susan Polgar said about having a good outpost because strategy is important.  If I don't play well, Sue won't learn.",
        "6... c6": "Interesting move with a nice pawn chain.  I was considering a line a little similar to the Domiano with a sac that I come to now realize would've been unsound.  I was having Ghost Vision since the f pawn never advanced, which is very good for black.  With that being said, I almost played 7.Nxd5??, with the idea being 7...cxd5 8.Qa4+  But, what stopped me from playing that terrible blunder was her Nf6.  With that being said, I overlooked her Queen because if I took, she could've and probably would've recaptured with the Queen, in which, the plan is foiled and spoiled.",
        "7. Bd3": "With the N's developed, I decide to continue with my development.",
        "7... Bb4": "And, Sue plays an interesting move with this pin.",
        "8. Bd2": "So, I break it by continuing to develop.  Aside from development, nothing came into consideration except for breaking the pin this way.  And, it's only because Jack Stockel said that this is the best way to break a pin like this. ",
        "8... O-O": "Meanwhile, Sue gets her K to safety at once.",
        "9. Qa4": "And, I apply what I learned from the KOH club of, \"When and Where It's Safe to Castle\" in the KOH thread.  I realize that I don't need to do it so fast when I can take advantage of the fact that black moved the same piece twice.  So, I attack it, as afterwards, I can pick which strengthens my mobility, as now, both of my rooks are also connected, in the process.  With that being said, I still have no problem with exchanging either since I don't wind up with doubled pawns.  That's because to me having my Rooks connected, as they will be, is of even more importance.  I also kept in mind that she couldn't attack my Queen under the same ground.",
        "9... Bd6 10. O-O": "?! But, castling should've held off another move, though.  I also saw this and asked myself what if Sue plays 10...b5  I asked if I'd win anything by doing that.  I studied one or two variations that does win.  But, that's all I looked at.  I should've been more mobile because black should not lose material from that.",
        "10... Nbd7": "Not to my surprise, though, Sue continues with her development.",
        "11. e4": "So, I come up with a nasty.  The idea is stricking in the center, as I've learned from elyhim in one of his recent annotations.  But, black still has the option to play 11...b5  But, her next move, however, is going to lose material, as we're about to see. ",
        "11... b6": "?? After which, I coach her but forgot that she could've harassed my Queen which means that I did a hate pet of mine, and told her the wrong thing.  That's because I said, This is your first blunder. I know what you were thinking since this is a finchetto. That's how I think, when the time is right because long diagnols are nice to have. But, there was a danger with this move because it leaves that same diagnol unprotected due to my Queen being in that area. And, that e pawn is dangerous. By playing this, more then one piece is unprotected. Best for black would've been to exchange with 11...dxe4 After which, I'd answer with 12.Nxe4, and after 12...Nxe4 13.Bxe4, the position is still even.  However, I made a mistake here soon because you could've fianchettoed without losing material.  So, with that being said, just as good would've been 11...b5, and after something like 12.Qb3, 12...dxe4 is just as effective.",
        "12. Qxc6 Rb8 13. Qxd6 dxe4": "And, now she exchanges.  But, what was good earlier doesn't work, at this point.",
        "14. Nxe4 Ra8": "I told her that this was a blunder by saying, ?? I know why you played. You wanted to protect your Rook. But, it was protected by your Nd7. With that being said, I considered and had, in fact, almost played 14.Qxb8?? which would've lost my Queen. With that being said, your best move was to hit my Queen with 14...Ne8 as I'm forced back. But, just about anything else was better then this move. By playing this, the Rook is now unprotected which is going to cost black more material.  However, I was wrong because I looked at all but one variation.  With that being said Sue, yes, I was still going to play 15.Qc6, but you're ok if you play 15...Rb8 due to your Nd7.  Having had overlooked that, I stop saying anything after this because of what ION mentioned with the idea of not overdoing things when you have a winning advantage.  But, I will be pointing out mistakes during the annotation, though.",
        "15. Qc6 Bb7": "?? This, however, is the move that loses material because as noted above, you wouldn't have lost anything else, had you played 15...Rb8",
        "16. Qxb7 Qe8": "My guess is that Sue wanted to place pressure on the center.  Now, I was wondering what to do here but figured that I could liquidate by placing her in check.  The idea is to exchange when ahead.",
        "17. Nxf6+ Nxf6 18. Bb4": "Still thinking about how else to continue, I decided to go after Rook.",
        "18... a5": "I was going to call this a blunder during the annotation as 18...Rb8 appears to protect the Rook but after I retreat I can still grab the Rook.  So, the truth is that there are no good moves left.  Yet, I like Sue's fighting spirit, though.",
        "19. Bxf8 Qxf8 20. Qxb6 a4": "As now, she is trying to pull a swindle.  With the idea being that if I'm not careful, although not passed now, she could threaten to get a passed pawn.  Although, there are ways to stop this kind of thing, I believe that what Sue has in mind is to hit my Queen with ...a3, followed ....axb2 to follow.  Although there's no swindle here, she would get some counterplay.  ",
        "21. a3": "But, as a trainer, my job is to stop that.  So, the idea is preventing the passed pawn and working my way from there.",
        "21... Qe8": "I am not sure why Sue played this.  Now, I did consider 22.Bb5 to hit the Queen.  But, I then asked myself what happens when she moves.  So, I did not see the point of doing that.",
        "22. Bc4": "Therefore, I played this to pin her f7 pawn since for the same reason that I played this against dynamic_dv which was blunderous.  But, for me, it doesn't matter, as long as, it worked it one game because the idea is trial and error, that's how it works.  What I did learn from that is that it doesn't work on all games, so you still have to base on the position.  But, it works here because I'm not just doing it for the thrills and giggles of a pin as it appears.  Yes, that's the prime reason, but the secondary reason is that I am threatening to trap her Queen, as we're about to see since I learned how to do something like this from reversion.  That's because I played an inaccurate during the KG which got my Queen trapped.  So, I am using his strategy.",
        "22... Nd7": "Which Sue delays by hitting my Queen.",
        "23. Qd6": "So, I put a little pressure on her center.  Now, just like before, I considered exchanging Queens with 23.Re8 to centralize a Rook.  Although exchanging is good, I felt that I had something because of my next move which is where that threat becomes real.",
        "23... Nf6": "? But, this is a mistake, as your best move would've been 23...Qf8, Sue.  Sure, an exchange is forced, but it's better then what's about to happen.  That's because not only are you about to lose another pawn, but it's the weakest pawn on the board which now leaves the K exposed.  It's worth noting that I also kept this in mind when pinning the f7 pawn, for I am using TA's strategies in his blitz Q sacs for this position.  As that's where he emphasizes the same thing that GM Susan Polgar teaches in one of her lectures being that the f pawn is the weakest pawn on the board.  And, once it's removed, you're in trouble.  But, it applies here even more because black is way behind in material.",
        "24. Ng5 Rd8": "?? Not to my surprise, Sue hits my Queen.  But, as noted, I am going to remove the weakest pawn to compromise blacks position even further.  However, this is a blunder as black will is going to lose her other Rook, in the process without compensation, at the least.  But, there are no good moves left as black is in trouble, so it boils down to all other moves being better then this.  ",
        "25. Bxf7+ Qxf7 26. Nxf7 Kxf7": "?? I know that you didn't want to lose the Rook, Sue, but that was the best alternative.  So, with it, best was to take back with 26...Rxd6, as this move is going to lose the Queen, after which, mate is not far off.",
        "27. Qxd8 h6": "I am not sure why she played.  But, unlike before, no move is as good or bad as another.  In fact, not before, but at this point, I would've resigned as black under this ground.  That's because there's nothing else, and thus, no more to learn because no move is as good or bad as another, at this phase.",
        "28. Rfe1": "Forget about what I said earlier.  As now, this wasn't played to centralize the Rook.  In fact,  this gives me a mating attack.  That's because I considered pushing my passed, and thus, almost played 28.d5 with the idea of threatening to promote.  But, I realize that with this much material, I don't need an extra Queen, as there is a mating sequence somewhere that I can take advantage of.  As now, I'm threatening, 29.Qe8#  However, even after she defends against it with 28...Nh7 it's still mate.",
        "28... Nh7 29. Qe8+ Kf6 30. Qe6+ Kg5 31. Re5+ Kf4": "I studied this variation, after finding 29.Qe8+.  For black's only other option was 31...Kh4, but then I would mate with 32.g3#.",
        "32. Qf5#": "After this game, I gave her my take.  Usually, I call it the moral of the story, but it's not because of my inaccuracies.  But, they're important to keep in mind.  So, what I said this was something new and different. First, in the future, I'm not going to let myself get mixed up, in the future, for what opening you'd like. You played ok, until that fianchetto. I know how easy it is to want to fianchetto and get a nice long diagnol as I've always felt more comfortable in the process. But, what's important to remember is that there's a time and place to do it. If the position demands something first, though, then the need should be taken care of. For example, you played ...b6 but overlooked that your DSB was hanging. Had you exchanged the pawns and then Knights, white wouldn't have won material, as early. Then, a different move was a blunder. I did make one mistake, though, for had the Rook moved back, you wouldn't have lost another piece. But then, you moved your LSB, instead, which lost a second piece, as well as, a pawn. From there, it went downhill. My advice is actually the same as what Ken gave to me, in our current game, to look at things from a more mobile perspective.  The real moral that ties into this, Sue, as it is instructive for the future due to this being a training, that if someone plays something different then you're used to, don't get overwhelmed.  In all situations, stay calm and focused.  Try to think of it as something like a Yoga Class.  So, my new take on it is to expect the unexpected.  Therefore, as the saying goes, \"if life throws a lemon at you, make lemonade.\"  Yes, that's also something I've had to learn the hard way.  What really helped with this, believe it or not, was my first game against elyhim, for he played something that I wasn't used.  For, at the time, I had no experience with the Caro Kann, so getting overwhelmed and nervous is what caused me to rush.  After which, Terence told me or less the same thing in that game, being to stay calm and relaxed."
    },
    "url": "https://gameknot.com/annotation.pl/training-game?gm=62020",
    "gameName": "Training Game",
    "players": "jkarp (1315) vs. knightrider62 (954)",
    "opening": "Queen's pawn game (D02)"
}