{
    "moves": {
        "1. e4": "DSB: Right then.  1. e4.  A classic opening, grabbing a share of the centre and opening lines for the Bf1 and Qd1. ",
        "1... e5": "JB: Yup. now I go e5\r\nDSB: 1. ...e5 - a classic response to a classic opening move.  Black seeks to fight toe to toe in the centre, and the battle revolves around whether White can attack that pawn and play either d4 or f4 at some point, or whether Black can hold firm.",
        "2. Nc3": "DSB: White plays the Vienna Game.  The plan is to play f4 in the manner of the King's Gambit, without letting Black play exf4 and d5, equalising.  White is trying to develop and maintain some tension in the position with this move.  He can, if he wants, look to play g3, Bg2 and Nge2 as a system of development, or even look to play d4.\r\nI've been playing this for some time and prefer it to 2. Nf3 which is probably, objectively, the strongest move in this position.  It takes Black out of his book a little, and avoids the Petroff (2. Nf3 Nf6), Philidor (2. Nf3 d6) and Latvian (2. Nf3 f5).\r\nJB: Black starts to get dizzy",
        "2... Ne7": "JB: No immediate threat to my e5.  Let's see if I can hold the centre and force White into advancing and block himself in on the kingside.  \r\nDSB: 2. ... Ne7 seems illogical in that it blocks the Be7 and doesn't put pressure on the e4 pawn, but Black can play Ng6 (Xf4) and still threaten ... d5. ",
        "3. Bc4": "DSB: The choice is probably 3.d4, 3.f4 or 3.Bc4. I quite fancy 3.f4 but I think that Black can play 3. ... d5 or even 3. ... Nbc6 with a view to Ne7-g6-e5 at some point. I'd play 3.Bc4 against 2. ... Nf6 in any event.\r\nJB: That kills the potential for 0-0.\r\nDSB: I suspect that Black doesn't appreciate just how dangerous this system is for Black.  White has defended his e4 pawn, has clamped down on d5, is hitting f7 and has the potential for a speedy attack down the f-file.",
        "3... f6": "DSB :Interesting, although it can't possibly be good. It's not that f6 belongs to the knight (which is going to g6), but it's going to make 0-0 impossible without kicking the Bc4 off the a2-g8 diagonal and it weakens the h5-e8 diagonal too. White has 3 genuine options here - 4.f4, 4.Nf3 and 4.d4.  4.f4 is interesting. The threat is not just fxe5, but also to push for g2-g4-g5 as part of the attack. In those circumstances, White will play d3 and either Nge3-g3 or Nf3.",
        "4. f4 Nbc6 5. Nf3 a6": "JB: Now I start preparing 0-0-0\r\nDSB: Black's difficulty here is getting his bishops developed and king to safety. 0-0 is going to be difficult since ... f6 and ... a6 is going to leave the queenside subject to a b2-b4-b5 assault after 0-0-0. Can Black leave his king in the centre?",
        "6. a4": "The question is as to whether to prevent ...b5. 6.d4, opening the last of the lines, is attractive because exd4 or exf4 leaves the f6 pawn looking uncomfortable. It'll come in time but let's stop ...b5",
        "6... b6": "JB: Gotta stick to the plan. Will try 0-0-0 by means of 6. ...b6.  White hasn't gone for an immediate confrontation on the kingside.  The balance in the centre now is unclear, but this is where I will lose, or not.  The White bishop may now feel threatened. I hope/calculate White will either go into preparation for 0-0, or f5.  Perhaps he'll play 7.g3?  Anything else I can see would mean too much of a loss for White. \r\nDSB: Black underestimates White's lead in development. If exf4, I'm happy to play d4.  If Black wants to hold the f4 pawn with g5, White has a Muzio Gambit idea with the potential of playing e5, hitting f6 and opening up the potential of Qh5+ or an assault down the f-file.",
        "7. O-O": "DSB: The choice of d3 or d4 can wait. Develop, and hit f7 until it bleeds.",
        "7... Bb7": "DSB: Black's development is too defensive and too slow.  White has shown that he intends a quick attack, hitting f7.  Black can't 0-0-0 for another 3 moves.  Can White take advantage?",
        "8. fxe5 Nxe5 9. Nxe5": "Now 9. ...d5!? was the only move, when Black, whilst significantly worse, is surprisingly resilient because of the possibility of a ... Qd4+ hitting the Bc4.  I'll some analysis of the various captures later.  Instead, Black's reply brings the game to a speedy conclusion.",
        "9... fxe5 10. Bf7#": "Black has acheived nothing in the last 9 moves.  The Ne7 is a hinderance, both to the Bf8 and the king itself.  The f6 pawn didn't hold the centre, and the a6, b6, Bb7 development is too slow and stodgy.  A game in the style of 1860!"
    },
    "url": "https://gameknot.com/annotation.pl/training-game?gm=50567",
    "gameName": "Training game",
    "players": "dsb13 (1908) vs. josetborda2 (1393)",
    "opening": "Vienna game (C25)"
}