{
    "moves": {
        "1. e4 d5 2. exd5 Qxd5 3. Nc3 Qa5 4. d4 Nf6 5. Nf3 Bf5": "The pinning move 5. .. Bg4 would put the question to the center indirectly. Continuing with 6. h3 Bh5 7. g4 prepares for a full scale King side assault.\n\nThe Main lines of the Mieses Variation follows 5 .. c6 6.Bc4 Bf5 7.Ne5 e6 8.g4 Bg6 9.h4 Nbd7 ... 1-0 (Viswanathan Anand - Joel Lautier, 1997), and\n6.Ne5 Be6 7.Bd3 Nbd7 8.f4 g6 9.O-O Bg7 10.Kh1 Bf5 11.Bc4 e6 ... 1-0 (Kasparov - Anand, 1995).",
        "6. Bc4 e6 7. O-O Nbd7": "This move leaves open the opening of the center with 8. .. c5.",
        "8. Bf4": "Establishing control over the center and connecting the back row. ",
        "8... c6": "This move establishes firm control over the center with the minimum amount of force. This move suggests that Black is not going for the queenside castling.",
        "9. Bb3": "This move protects the b-pawn while protecting the Bishop.",
        "9... Be7 10. h3 O-O 11. g4 Bg6 12. Re1": "Moves the rook to the half open e file while minimizing the threat of exchanging off the knights.",
        "12... Nd5 13. Nxd5 cxd5 14. c3": "The purpose of this move was to protect d4. However, c4 would have attacked the strengthened center at the cost of a isolated d pawn. The move seemed to be the lesser of a few evils.",
        "14... Rfe8 15. Bc2": "Trying to weaken the area in front of the kingside while protecting the unprotected b pawn.",
        "15... Bxc2 16. Qxc2 b5 17. Ne5 Nxe5 18. Bxe5": "Still keeping an eye on the kingside.",
        "18... b4 19. cxb4": "This move isolates the d pawn in addition to opening up the file.  The presence of a rook on c1 is in order.",
        "19... Qxb4 20. b3": "This move allows for the queen to hide while protecting the d and a pawns.\nThis overworking of a piece is perfect for a Zugzwang. Placing a rook on c1 was\ncalled for, even at the cost of the a pawn following the inevitable rook exchange.",
        "20... Rec8 21. Qb2 Qc3 22. Qxc3 Rxc3": "Black is established in the open file. The white king is forced into a passive role in the endgame. Notice that the kingside attack was never established.",
        "23. Kg2 Rac8": "Doubling up on the open file. Notice that white's Bishop is totally out of action on the a1-h8 diagonal.",
        "24. Re3": "Hoping to exchange the rooks and protect the isolated d-pawn with e3.",
        "24... Rc3c2 25. a4": "Perhaps a3 followed by b4 would have been in order.",
        "25... Rd2": "Preparing for Rcc2, attacking the weak f-pawn. ",
        "26. Kf3": "A series of errors begins at this point. The only thing keeping me from resigning is stubbornness.",
        "26... Bg5 27. Bf4 Bxf4 28. Kxf4 Rxf2+ 29. Rf3 g5+ 30. Kg3 Rxf3+ 31. Kxf3 Rc3+ 32. Kg2 Rxb3 33. Ra2 a5": ""
    },
    "url": "https://gameknot.com/annotation.pl/training?gm=6699",
    "gameName": "Training",
    "players": "carnap (1469) vs. rayman (2124)",
    "opening": "Scandinavian defence (B01)"
}