{
    "moves": {
        "1. e4": "Good choice. Get a centre p and open lines for Q and B. But I hope this is the first move of your plan !",
        "1... e5": "A move behind still but achieves same as white",
        "2. Nf3": "good - develop with a threat and we head toward Ruy Lopez - which is your plan, right !",
        "2... Nc6": "develop - but with defense",
        "3. Bb5": "good developing move - clears way for 0-0 - carries a threat of BxN with Nxp following",
        "3... a6": "pushes the B to take or move. ",
        "4. Bc4": "Ba4 is usual, so you must have some logic for this. c4 is not a bad square for B but moving the B twice to get there is not a good idea unless you have compensation for the loss of tempo. In this case the logic is not apparent to me, and it shows you not following through the plan you initiated with move 3. Bb5  In summary, the move is not especially bad, but you broke a few tips - always play to a plan (even a bad plan is better than no plan) - and avoid moving pieces more than once to reach their development square. The result - loss of a tempo ",
        "4... Nf6": "I want to open up for 0-0, I'm keeping it simple, I'm doing N before B development, there is a threat of Nxe4, and I've just about achieved \"equality\" (I've sort of recovered from being a move behind)",
        "5. Nc3": "good developing move. I would have looked at 0-0 - only because black needs 2 moves to castle and therefore 0-0 has more potential to apply pressure on the e file, and discourages Nxe4",
        "5... Bc5": "I'm very tempted by Nxe4 and it looks safe, grabs the initiative, etc. but for training purposes I'll follow my own preaching, keep developing, prepare for 0-0, etc. etc.",
        "6. O-O": "d3 first might be better.",
        "6... d6": "opening a line for whiteB - propping e5 - releasing N from guard duty ",
        "7. d3": "likewise",
        "7... Bg4": "This is not especially strong play. I may wish for 0-0 later but many players worry about pinned Ns and this is me throwing a little test at you",
        "8. Re1": "With Nd4 coming you should have considered h3 or Be3.",
        "8... Nd4 9. Be3": "getting your p on g2 disrupted is not the end",
        "9... Nxf3+ 10. gxf3": "forced",
        "10... Bh3 11. Ne2 Bxe3": "I need to focus on my position rather than easily defended attacks",
        "12. fxe3 O-O": "There is no point throwing pieces into attack unless I can reach an improved and sustainable position",
        "13. d4 b5 14. Bd5 Nxd5": "That's your best positioned piece off and lines opened for me",
        "15. exd5 Qf6 16. f4": "This is not so clever. Obviously Qxf3 is the threat but you want N on g3 right ! which unblocks your Q and R, and defends f3. Always think carefully before pushing pawns. In this case you need mobility to defend the exposed K. Your N is in the way and the B on h3 cuts down options",
        "16... Bg4 17. Rf1": "When you make a mistake (last move) take special care with your next move. This pin looks dangerous if it continues - can you step out of it ?  Rf1 compounds the mistake ",
        "17... Qg6": "Now you have disc   coming with BxN. If you had played out of the pin Ng3 would defend",
        "18. Kf2 exf4": "this is more about opening the e file",
        "19. exf4": "Again you needed badly to step out of the pin",
        "19... Rfe8 20. Re1": "you are losing the game over this pin",
        "20... Qh5": "it is hard to see any defense here",
        "21. Rh1 Rxe2+ 22. Kg1": "checkmate can be forced from here",
        "22... Bh3 23. Qd3 Qg4+ 24. Qg3 Rg2+ 25. Kf1 Qe2#": "I strongly recommend you make a plan to play your favourite opening. Do not wander off the normal moves unless your opponent varies first. If he does - check the popular responses in the Gameknot DB and figure out why/what/reason that move is good. In the other games I looked at, you were inclined to make the odd blunder, in this game just a few weak moves. I think you need a check routine, before each move, to elliminate blunders/weak moves among the moves you consider. You might also benefit from a check routine/plan that takes up after the opening phase to give your play some focus.  "
    },
    "url": "https://gameknot.com/annotation.pl/training-match-with-tanp?gm=15694",
    "gameName": "Training Match with tanp",
    "players": "amegls (1171) vs. tanp (1973)",
    "opening": "Ruy Lopez (C68), exchange variation"
}