{
    "moves": {
        "1. e4 Nc6": "So I offered skitter a choice of an Alekhine, a Caro Kann, a French, a Modern, a Pirc or a Scandinavian, and he asked for a Nimzovich. \nThere's nothing obviously wrong with Nc6, except that it's never going to help Black fight for the centre in the same way as other moves.  If Black is to play ...e5 or ...d5 in the first few moves, he would rather support that pawn with another pawn, as if white plays 2.d4 e5 3.dxe5 Nxe5 the knight is potentially vulnerable, whereas after 3.d5 the knight is going to have to move anyway. \n",
        "2. Bb5": "On the one hand, White starts his development and attacks the knight, with the possibility of doubling Black's pawns, but is this the best move?  Black's first move allows White to seize the centre if he's so minded with 2. d4, or control the e5 square with 2.Nf3 or 2.f4.  Given that I didn't offer 1. ...e5 as one of my regular openings, would I really want to put myself in a Ruy Lopez or Scotch game position?",
        "2... Nf6": "Black puts some pressure on the White centre, and keeps his powder dry as to what he's going to do with his central pawns.",
        "3. Nc3": "White defends the e4 pawn and develops a piece.  Black has to make a decision with his central pawns which will determine where we go from here.  3.Nc3 also inhibits ...d5.",
        "3... Nd4": "Black's choices aren't huge here.  White was threatening to play 4.Bxc6 and 5.e5, or just 4.d4.  3. ...d6 self-pins the Nc6, so 3. ...e5 (which takes us back, after 4.Nf3, to a Berlin Defence to the Ruy Lopez) or this move are the obvious candidates.  Black takes advantage of White not having played Nf3 to try to grab the bishop pair without damaging his pawn structure, but breaks the rule against moving the same piece twice in the opening.",
        "4. d3 Nxb5": "Whilst I don't like moving the knight a 3rd time, the threat is 5. e5 and the only alternative is to play 4. ...e5 myself. I'm heartened by the fact that the White knight on b5 isn't going to be staying there too long.",
        "5. Nxb5 d6": "Black moves a central pawn, but why this one?  And why only to d6?\nThe answer is relatively straight-forward.  Black will play ...g6, Bg7 and 0-0 where White cannot easily challenge the Bg7, the Bc8 can come to d7, e6 or g4, he can expand on the Q-side with c6, b5 etc and Bf4 ceases to cause any problems on c7.",
        "6. Nf3 g6 7. a3": "I'm not sure what the point of this move might be.  I'm not looking to play Bb4, and it can only ever give me a target for a Q-side advance.  There's no need to wait if White wants to play b4 either.",
        "7... Bg7": "Simple development, and stopping b4 because of ... Nxe4",
        "8. Nc3 O-O 9. O-O": "9 moves in and both sides compete to see who can take the most moves to complete their development.\nBlack now has to make a decision about how he's going to play the position:\nHe can play 9... c5 with a Sicilian Dragon style set up, ever mindful that White might play d3-d4 and turn it into an Open Sicilian position. \nHe can play 9... e5 with the plan of playing for f7-f5 with a K-side attack.\nFinally, he can play 9... c6 with a b5/a5 Q-side attack.",
        "9... Bg4": "Black keeps his powder dry for a move or two and indirectly puts a little more pressure on the putative White centre. ",
        "10. Rb1": "Is this the best square for the rook?  White has to decide on a plan in this position.  He'll struggle to whip up a K-side attack, although he could try something with Be3(g5) and Qd2, followed by Bh6.  His problem is that without any half open files, he cannot easily bring his rooks into the attack.\nIn those circumstances, he has to look at some sort of pawn break, made more difficult by the lack of a Black pawn to target.  The most obvious are d3-d4 and f2-f4-f5.  Rb1 suggests that b2-b4 is coming, but, from Black's point of view, so what?",
        "10... Nd7": "Black stays flexible, opens the diagonal for the bishop and looks to put his knight on e5 (supported by c7-c5) or c5 (with e7-e5).",
        "11. h3": "Now that the Bishop cannot retreat, White invites the exchange.",
        "11... Bxf3 12. Qxf3 c6": "Another decision for Black.  Again, the options are ...e5, ...c5 and ...c6.  There's no point in 12... Bxc3 as after 13. bxc3 White has the open b-file and the dark squares to compensate for his doubled pawn and is clearly better. ",
        "13. Ne2": "I'm not sure about this move.  White is clearly angling for b4 and/or d4, but is that the best use of his time?  13. Bg5 is interesting, trying to inhibit ...e5, whilst Bf4 is also interesting, with a view to dropping back to g3 after ...e5.  I think I'd have played 13. Bg5 and try to force some weaknesses around the Black king.",
        "13... e5": "Black finally puts a pawn in the centre, and it's counter-intuitive to block the Bg7, but it stops White playing d4 and threatens ...f5 in due course.",
        "14. Nc3": "Isn't the knight better off heading over to g3 to try to control f5?  That knight has taken 5 moves to get from b1-c3!",
        "14... f5": "Black decides to seize the initiative because White has been too passive.  White has no attack anywhere yet, so Black goes for the king.",
        "15. Qe2 f4 16. f3": "White stops the advance, but at the cost of weakening g3.  The c6 pawn controls d5 and White has no counterplay.",
        "16... g5 17. Nd1": "Black is looking to manoeuvre his knight to g3 via h5, but he won't be able to break through without playing h5, g4 etc.  White should prepare for the knight coming in to g3, but he needs some activity and quickly.",
        "17... Nf6 18. Nf2 h5": "Black's attack really starts to play itself here, but it won't break through immediately if White just holds tight.  Black will have to play Kf7, Rh8 and bring his major pieces to the g-file and h-file.  White almost had enough time to run his king back to the Q-side. ",
        "19. g4": "I think that this is just plain bad.  Black would have played g4, but he was going to need to spend some time preparing for it.  Now, White's king-side is breached.  c3 and d4 probably constitute the best option. ",
        "19... fxg3 e.p. 20. Nh1 Qd7 21. Bxg5": "21. Kg2 is better because 21... h4 is met by Bg5.",
        "21... Qxh3 22. Nxg3": "What's wrong with 22. Qg2?",
        "22... Qxg3+ 23. Qg2 Qxg2+": "Black has an extra piece, so there's no need for him to play ...h4 and weaken the h-pawn.  Once White's position starts to fall apart and he's a piece down, the emphasis should be on trying to use the pieces that he's got to grab some initiative, not swapping them off.  Black is happy playing an endgame with an extra piece and grinding out the win. \nSimon Webb's excellent book Chess For Tigers explains it beautifully.  Tigers will hunt rabbits, but rabbits have sharp teeth, so you stalk them until they're exhausted.  Heffalumps, by contrast, are stronger than tigers, so head for the swamp and hope they fall in before you do.",
        "24. Kxg2 Kf7 25. c3 Ke6": "Black wants to use the half-open f-file and h-file, together with the open g-file for his rooks, and is quite happy to swap off anything that moves, safe in the knowledge that even if White could swap pretty much everything, he's still got an extra piece and the bishop is the right colour to queen the a-pawn.",
        "26. Rbd1": "White could simply play 26.d4 and then decide whether he wants to put the rook on c1 or d1.",
        "26... Rfg8 27. Kf2 Raf8 28. Ke2 Rgh8 29. Bh4": "Understandably, White wants to slow Black's push down the h-file, but Harry wasn't going anywhere just yet - he'd get cut off fairly quickly.  The more important diagonal for White was the c1-h6 one (because of the weaknesses at f4 and e3.  Black takes it immediately. ",
        "29... Bh6 30. b4": "If the plan was b2-b4 rather than d2-d4, what was the point of playing Rbd1?",
        "30... Bf4 31. Rfg1 Rfg8": "Inviting the exchange of as many rooks as possible.  Black's h-pawn is significantly better than White's backward f-pawn in this position and, with hindsight, White should have looked at f3-f4 back at move 29 or before.",
        "32. Rgh1 Rg2+": "I was always taught of the power of a rook on the 7th rank.  Whilst the exchange was not to White's liking, he should have kept the rook on g1, as if Black plays Rxg1, Rxg1 still gives White some measure of control over the g-file.  Now White's king is pushed back and Black has a choice of how to mop up the Q-side pawns.",
        "33. Kf1 Rc2": "Black can play Ra2 straight-away.  This move gives White a choice - does he want to defend the pawn with Be1, tying his pieces down yet further, play c3-c4 and lose his flexibility with the pawns or d3-4 to open up the centre (albeit a long time too late).  I suspect that (d) none of the above would be a preferred option, but it's not available.",
        "34. Be1 Ra2": "White is now hog-tied by the Ra2 and his weak dark squares.  Black has a number of plans including picking up the Q-side pawns, mating on g1, pushing the h-pawn, invading down the g-file with the other rook etc. ",
        "35. c4 Rg8": "Logical.  Black has no fear of swapping a pair of rooks, but otherwise he'll play Rgg2 and dominate the 7th.",
        "36. Bf2": "Stopping Rgg2 for the time being and hitting a7, although Black's not overly concerned about that.  White's main problem at this stage is that he has no squares for his rooks, no open file to use, no counter-play and no chance.",
        "36... Rxa3 37. Ke2 Ra2+": "White's last move turns out to be a waste of time.  The end is swift and quite pretty.",
        "38. Ke1 Rg2 39. Rf1": "Time to pause, briefly, to spot the prettiest finish.",
        "39... Be3": "There it is.  40. Bxe3 R(either)e2#"
    },
    "url": "https://gameknot.com/annotation.pl/training-match?gm=56021",
    "gameName": "Training Match",
    "players": "skitter (1467) vs. dsb13 (1920)",
    "opening": "KP (B00), Nimzovich defence"
}