{
    "moves": {
        "1. e4 c5": "This move is the Sicilian defense. The idea is to bring pressure on the center with the c-pawn and  trade it for white's d-pawn. White has many responses, sometimes allowing the trade, sometimes avoiding it. There are many versions of the Sicilian, some quiet and positional, and others, like the dragon (which I prefer), that are very sharp.",
        "2. Nf3": "This is the most common response to 1. ... c5.",
        "2... Nc6": "Still the most common continuation. Both sides are putting in their pitch for the d4 square.",
        "3. c3": "The idea here is that the c pawn can be used to recapture after the exchange on d4, allowing white to keep two center pawns.",
        "3... Nf6": "My idea is that it is now impossible for the b-knight to protect the e4 pawn, and I want to force some other move that will slow white's development and be something other than white's plan. \r\n\r\nNormally I would avoid Nf6 until after I had played d6 in order to avoid e5 driving my f6 Knight away. In this case, however, I think e5 is overstretching for white, and after I play Ng4, white will either have difficulty keeping his e5 pawn or at least be giving up initiative.\r\n\r\nI'm not sure I really know what I'm talking about here. I do know, however, that I rarely regret taking the initiative. Initiative means that you are forcing your opponent to constantly respond to your plans, rather than advancing on his own plans. To me, the strongest aspect of 3 ... Nf6 is that it takes the initiative and will probably keep it for a few moves.\r\n\r\nThere is danger in Ng4 if white plays e5. My N is exposed to the white Q without the protection of the white bishop as soon as the white Knight moves from f3. I think that's not a problem, though, as the most likely place for the f3 N to move is to e5, and I can trade my g4 Knight for it there. Also, if e5 is played, I will be playing d6 shortly thereafter, allowing my bishop to protect the Knight at g4.\r\n\r\nThis is a long comment, and if this were simply an annotated game, most of it would be unnecessary. However, in a training game, I'm trying to give all my thoughts in why I chose a move, even if it exposes my plans to my opponent.",
        "4. Bd3": "I think this is not the strongest move, because it blocks the d-pawn, severely limiting white's mobility. d3 is much better, allowing the development of the c-1 bishop and the b-1 Knight, which not only has both its best spots blocked, but now has no good way to get them opened.\r\n\r\nBd3 allows a quick castle, but that benefit is small compared to the drawbacks. That is especially true in a Sicilian, where black's development is always slow, anyway. in a Sicilian quick development and limiting black's space and development is what you want. Notice that Black's K and Q pawns have not moved yet. The white King is in no danger and has no need to hurry into castling.\r\n\r\nI wrote a lot about e5 on the last move. I don't think e5 would be a good move here, but I do think it's better than Bd3. I'm not a master, so I can't see all the ramifications of e5, but it seems like overextension to me. ",
        "4... d6": "Prevents e5 and opens the door for Ne5, attacking the d3 Bishop. Making the Bishop move a second time slows white's development. In this case, however, it's probably superfluous, because the Bishop will have to move a second time, anyway, in order to mobilize white's Q-side.",
        "5. h3": "This purely defensive move is forced by Bd3. Black's Bg4 cannot be defended by Be2 because the Bishop is needed to defend the e4 pawn.",
        "5... Nh5": "The Sicilian is a slow development opening, and White's move are calling for quick action on black's part. That may be impossible, but black is trying. f4 is an excellent spot for black's knight, attacking d3, g2, and h3. At some point e5 will allow it to be defended by a pawn there and allow black's Q to get into the game quickly. White's b-1 knight is at least two moves away from challenging that square. g3 isn't a real good option for white because of weakening the Q-side (or giving away the h3 pawn if white has castled).",
        "6. Bc2": "Frees d3 so the Q-pawn can move and Queen Bishop can be developed and leaves the King Bishop on a strong diagonal.",
        "6... Nf4": "I'm a 1600 player, not 2400. This may not even be a good move. The drawbacks are that it's the 3rd time I've moved this N in six moves and my King Bishop cannot develop yet.\r\n\r\nThe reasons for the move are that it attacks the g7 pawn and puts pressure on d3 and h3. It may force castling, though white may have done anyway. e5 will follow, protecting the N and opening up the King Bishop and the king side to the Queen. White has developed slowly, so this move is aggressive for possible rapid aggression on black's part.",
        "7. O-O": "Protects g2 pawn and castles",
        "7... e5": "Protects Knight, frees King Bishop and Queen and reinforces d4.",
        "8. d3": "Frees Queen Bishop and attacks the f4 Knight. This traps the c2 Bishop, but d5 can be played at any point to free it. This was a good move. It also gives some freedom to the b-1 Knight, though it can also go a3-c4 if there's time.",
        "8... g5": "I hope the idea of a training game is to learn, not for me to play excellently. This, too, might be a mistake. The idea is to get my pieces in play rapidly while the white pieces are on the Q-side. This not only frees my King Bishop, but it opens the g-file if white trades his B for my f4 N and further blocks his mobility when I retake. the g5 pawn can also go to g4 to boot the f3 Knight should I decide it's worth eliminating the h3 and g2 pawns. It is highly dangerous, because my Q-side isn't real suitable for castling, and it wouldn't be too hard to open up the e-file if my King stays in the middle.",
        "9. g4": "Ouch! This move has to get a 9. g4??. The h3 pawn is no longer protected, and this plays into black's hands, letting me get the h3 and g4 pawns without the cost of a piece. I'm much more mobile, so this is frightening!",
        "9... Nxh3+ 10. Kg2 Bxg4": "Rather than moving the N, this move wins a pawn, pins the f3 Knight, further opens the K-side, and keeps the pressure on white.",
        "11. Rh1": "This move gets the rook in play, and it offers to trade off pieces, which can only help white. Another option here was Nb1-d2, but this further blocks off white's pieces.",
        "11... Nf4+": "I opted for this rather than trade off pieces. White can trade his bishop for my knight here, but when I play g5xf4, the g-file is opened and white's pieces are further blocked off. Right now, even sitting at its home square, the c-1 Bishop is a key defender."
    },
    "url": "https://gameknot.com/annotation.pl/training-game?gm=15274",
    "gameName": "Training Game",
    "players": "jom77 (1320) vs. shammahbn (1698)",
    "opening": "Sicilian defence (B30)"
}