{
    "moves": {
        "1. e4 e5 2. Nf3 Nc6 3. d4": "The Scotch Game/Gambit, you've all seen this before. For me, this is my favorite opening.",
        "3... exd4 4. Nxd4 Nxd4": "Ah, This isn't a really good move. It brings the queen out, and the queen also has no threat, which means white technically takes the center right out of blacks hands. Better would be d6 or Nf6.",
        "5. Qxd4 d6": "This move takes back some center control, but not that whole lot. It also stops white from playing e5, which almost completely traps the DSB, stops black from even doing the slightest to take back control of the center and also stops the knight from going to f6.",
        "6. Bc4": "This is just a simple move which develops my LSB, allowing me to castle and also attacking the weak f-pawn.",
        "6... Be6 7. Bxe6 fxe6": "Okay, maybe not the best trade-off, but the king is exposed now!",
        "8. O-O Nf6 9. Bg5": "I'm not letting this knight go any further. Also, I'm almost done with my development.",
        "9... Be7 10. Nc3": "Yeah, I'm done with my development. This position is fairly equal. I think.",
        "10... O-O 11. e5": "Ok, this is a fairly offensive move, isn't it? If you can see I am aiming to land my Queen on e6, forcing the King into a corner, or pinning the rook.",
        "11... dxe5": "The system marked this as a mistake, dunno why.",
        "12. Qxe5 Qd6": "Only move to prevent Qxe6. I really don't like Queen trades, for some reason.",
        "13. Qe2 Qb6": "Now, the Queen eyes down the undefended b-pawn while giving a small threat to f2.",
        "14. Rab1 Rad8 15. a4": "The computer analysis said that we were at a completely equal position. I guess I'd expect that much.",
        "15... h6": "Alright, Now he chases my bishop away? It would have been more effective earlier",
        "16. Be3 Qc6": "Now the Queen is attacking the g2 square, though leaving the h-pawn wide open. ",
        "17. Rfd1": "I am getting bored, so I try to enforce a rook exchange.",
        "17... Rxd1+ 18. Rxd1 Rd8": "Another exchange? I guess he had some troubles with rooks in past games.",
        "19. Rxd8+ Bxd8 20. Bd4": "I don't know what else to do!",
        "20... Be7 21. Qe5": "The only place Black can move his knight is h5, and it is always bad to put knights on the edges.",
        "21... a6": "Didn't really get this move, maybe just now he realized his pawn was in danger.",
        "22. f3": "The king always needs a bit of space. Plus, this removes from the pressure given by the queen to g2.",
        "22... Qd6": "Again, trying to do a queen exchange. I have 3 options here, capture, move to e3 or don't bother with the queen and let it be captured, still enforcing the exchange but also moving the DSB to e5.",
        "23. Qe3": "As I mentioned before, I hate Queen exchanges, so I decide to bring my Queen back. The score with the system stands at +0.01 for me, apparently. ",
        "23... c5": "... This move forces me to either take a pawn and gain a slightly worse position or threaten the Queen, so this really isn't that good.",
        "24. Be5 Qb6": "Attacking my B-pawn again, apparently.",
        "25. Ne2": "Well, That move allowed my knight to actually move again so think something better could have been played.",
        "25... Kf7 26. Kf2": "Yes, I did mirror my opponents move because I really didn't want to think at the time I moved.",
        "26... Bd6": "I don't care, if he wants to exchange, go ahead.",
        "27. Nf4 Bxe5 28. Qxe5": "At this point in the game, I really started despising the Black Queen. If it were somewhere else, I would have been able to capture on e6.",
        "28... c4+ 29. Kg3": "The system said that this was inaccuracy. I don't see anything wrong with this move... Also, this was the only time in the whole game that I went to negative anything, according to what the analysis said.",
        "29... Qc6": "This was also marked as inaccuracy. I don't see anything beneficial to my opponent here... Better would have been g5.",
        "30. h4": "Pushing pawns!",
        "30... b6 31. b4 cxb3 e.p. 32. cxb3": "I really thought that this game would end in a draw at this point.",
        "32... b5 33. a5 Qd7 34. b4 Nd5": "Now, my opponent goes onto the offensive.",
        "35. Nd3 Qe7": "Looking at this, what do you think the best move is? It may not seem like it, but there is a trap here to lure the opponent into a losing state.",
        "36. Nc5": "You probably figured this trap out already. It's very thinly hidden, so it should be easy to see. To be honest, I thought a player with a higher rating than mine wouldn't fall for this trap... ",
        "36... Nxb4": "But they did. This is a really bad blunder.",
        "37. Qf4+": "A pawn for a knight.",
        "37... Kg6 38. Qxb4": "This was actually marked as a mistake... Well, I guess Qe4+ could be considered better.",
        "38... Qd6+ 39. f4 e5": "At this point I thought there was no way I could win, only draw, despite the fact I was a knight up. I needed to eliminate the Queen. Then, I thought of something.",
        "40. f5+": "Since my opponent had been greedy enough to take the extra pawn and fall into my trap before, I considered he would this time as well. ",
        "40... Kxf5": "And he did! Taking the pawn was a blunder, making him lose his queen. This was a bit more concealed than the last trap.",
        "41. Qg4+": "This is the finishing move, In which Black's king is forced to move back to f6, and then with Ne4+, his Queen is gone. He promptly resigned. I hope you enjoyed this!",
        "41... Kf6 42. Ne4+ Ke7 43. Qxg7+ Ke6 44. Qxh6+ Kd5 45. Nxd6": "Basic continuation. "
    },
    "url": "https://gameknot.com/annotation.pl/trapped?gm=45655",
    "gameName": "Trapped!",
    "players": "ryanyu10 (???) vs. ??? (???)",
    "opening": "Scotch (C45), Ghulam Kassim variation"
}