{
    "moves": {
        "1. e4 e5 2. Nf3 Nc6 3. Bc4 Nf6 4. Ng5 Bc5 5. Nxf7": "Reinisch can be forgiven in thinking that this fork was the best move for White (though it is playable!) This is the starting position of the ongoing mini-tournament...\n",
        "5... Bxf2+": "...and this is the normal follow-up. Though Reinisch has never seen this before, he realises the danger of taking the bishop.\n",
        "6. Ke2": "? However, this was the wrong king move, not only bringing it out into the open but also aligning it on the same diagonal as the queen. Here, 6...Qe7 7.Nxg8 d5! would be great for Black...\n",
        "6... Nd4+": "...but Traxler has a different idea in mind! Though this improves the position of the knight, the king/queen skewer is neutralised once the king moves\n",
        "7. Kd3": "?! Reinisch brings his king further out into the open, and it can't retreat back to safety - I don't know why he didn't play Kf1 here. On a side note, Kxf2 would be suicide now that Black has a knight on d4!\n",
        "7... b5": "a tactical shot from Traxler - he leaves his queen hanging, but he gets more than enough compensation should Reinisch take it; 8.Nxd8 bxc4+ 9.Kxc4 Ba6+ 10.Kb4 Be2 [credit to ionadowman for pointing this line out in a seperate annotation] If Reinisch doesn't want to go down this line, he'll have to save his bishop instead!\n",
        "8. Bb3": "Forced to save the bishop...\n",
        "8... Nxe4": "!! Traxler is still willing to give up the queen, while grabbing even more space in the centre - brilliant! Reinisch has two hanging pieces to choose from now - the knight and the queen. I don't know whether there is a mating attack should Reinisch take the knight, but he can bring the queen out with check [Qh4+] and then save his rook, and Black's position would more than compensate for the lost knight! \n",
        "9. Nxd8": "The queen capture leads to a beautiful combination - Mate in 9! Almost everything that follows is forced for White\n",
        "9... Nc5+ 10. Kc3 Ne2+": "Not content with just a queen sacrifice, Traxler throws in a knight as well!\n",
        "11. Qxe2": "Declining the sac doesn't really make much difference\n",
        "11... Bd4+ 12. Kb4 a5+": "A pawn sacrifice! Ka3 leads to b4#\n",
        "13. Kxb5 Ba6+": "Another pawn is thrown away, but since the bishop is poised to take the queen next turn, it can't really be considered as a sacrifice\n",
        "14. Kxa5 Bd3+": ":) This is just rubbing salt into Reinisch's wounds now! Bxe2+ leads to the same combination but this makes the ending position all the more attractive!\n",
        "15. Kb4 Na6+ 16. Ka4": "It doesn't matter where the king goes on the a-file...\n",
        "16... Nb4+": "...as he has to accept this final sac regardless!\n",
        "17. Kxb4 c5#": "...and with all this piece manoeuvring, Traxler ends thing with a pawn thrust - the rook on h8 is the only piece not participating in the action! What I love the most is the position of Black's two bishops and the c and e pawns - it makes me think of a fighter jet for some reason :) Hope you enjoyed!\n"
    },
    "url": "https://gameknot.com/annotation.pl/traxler-with-nxf7-the-first-game?gm=35095",
    "gameName": "Traxler with Nxf7 - The First Game",
    "players": "J Reinisch (?) vs. Karel Traxler (?)",
    "opening": "two knights defence (C57), Wilkes Barre (Traxler) variation"
}