{
    "moves": {
        "1. e4 e5 2. Nf3 Nc6 3. Bc4 Nf6": "So far a Two Knights' Defence - almost a guarantee of an exciting game whatever happens...",
        "4. Ng5": "A controversial advance by the knight in order to place pressure upon the f7-pawn.  As it transpires, Black does find certain contortions are needed to stay on level terms.  For instance, 4...d5 5.exd5 Nxd5?! 6.Nxf7! and Black is already fighting for his life.  Usual, then is to let the pawn go (5...Na5) after which Black gets a very active game.",
        "4... Bc5": "But this move - the signature move of the Traxler Variation (a.k.a. the Wilkes-Barre) - allows White to conquer f7, and even win the h8-rook if he so chooses, with a view to obtaining a powerful counterattack.",
        "5. Bxf7+": "Self-restraint.  White is content with the small gain of a pawn plus disruption to the Black king.  The knight capture 5.Nxf7 Qe7 6.Nxh8 has a tendency to bring on the storm: 6...Bxf2+ and it's all on.  White can also hold back either capture for the moment by playing 5.d4, hoping a more opportune moment will occur.",
        "5... Ke7": "The generally preferred retreat, allowing the rook to reach f8.  Instead, 5...Kf8 has been tried (against me) in order to keep open the Queen's diagonal d8-h4.",
        "6. Bd5": "One of the two usual retreats, the other being 6.Bb3.  For some reason, the books are silent on 6.Bc4, nor is it much played.  ",
        "6... Rf8": "The most usual, obviating the fork altogether at f7.  If instead, 6...h6, then 7.Nf7 Qf8? 8.Nxh8 Nxd5?? 9.Ng6+, forking K and Q.  Nor has 6...d6 much to recommend it after 7.c3! (though White might be tempted into 7.Nf7?! Qf8 8.Nxh8 Nxd5 and the knight is stranded at h8) 7...Rf8 8.d4 exd4 9.Bxc6 bxc6 10.o-o! h6 11.cxd4 Bb6 12.e5 and White has a slight edge, according to Yakov Estrin.",
        "7. O-O": "The most usual here.  For a while, 7.Nf3 became popular after the game Belov vs Matsukevic (1962) in which Black responded 7.(Nf3) d6 8.c3 Bg4 9.Bxc6 bxc6 10.d4 Bb6 11.Qd3 exd4 12.cxd4  Kd7 13.Be3 and White seems to have the better of it.  Nor did moving the Q to e8 help in the 1959 game Elpidinsky vs Shkurovich-Hazin: 7.Nf3 d6 8.c3 Qe8 9.d4 exd4 10.cxd4 Bb4+ 11.Nc3 Nxd5 12.exd5 Kf7+ 13.Be3 Ne7 14.Qb3 Ba5 15.0-0 is also good for White.  Much more promising for Black is: 7.Nf3 Nd5!? and if 8.Nxe5 Nxd5 9.exd5 d6 with dangerous threats.  Instead 7.Nf7 Nd5!? 8.Nxd4 Bxd4 9.0-0 Nxd5 10.exd5 and White retains the advantage according to Estrin.  After 10...Kf7 11.c3 Bc5 12.d3! ... (Not the risky 12.Qh5+ Kg8 13.Qxe5 Qh4! and Black has the initiative) 12...Kg8 13.Nd2 'Black had no compensation for his pawn' in the game Jovcic vs Sapundzhiev (1969).  However, I followed this exact line with Black in a correspondence game in about 1974-5, and went on to win with a piece, followed by a double rook sacrifice in a King hunt(unfortunately, I don't have a score of that game).",
        "7... d6": "Instead 7...h6 could transpose into the game line, but White could improve after 8.Nf3 d6 9.h3! Qe8 10.c3 with this possible continuation: 10...Qh5 11.d4 and [a] 11...Bb6 12.Be3 Nd8 13.dxe5 or [b] 11...Bxh3 12.Bxc6! bxc6 13.gxh3 - neither line looking very good for Black.",
        "8. h3": "Playable, according to Estrin, but he gives 8.c3 as the more energetic.  Probably I ought to have played here 8...h6, but...",
        "8... Qe8": "This has been played before.  Instead, 8...h6 leads to 9.Nf3 Qe8 10.d3 Qh5 11.Nh2! White stops the attack after 11...Qh4!? 12.Be3 Bb6 13.Nc3 and Black's attack looks to be petering out.",
        "9. c3": "Readying the central pawn break d2-d4.",
        "9... h6": "Drives back the knight.  This might seem to constitute a loss of time for White, but it has been well invested in the disruption caused by the Black King's central location.",
        "10. Nf3 Qg6": "This leads to a huge clash of arms.  More circumspect, perhaps, was 10...Bb6.",
        "11. d4": "Getting in the first punch.  For the next several moves, the game takes on the look of two pugilists standing toe to toe in the centre of the ring and raining blows upon each other.",
        "11... exd4": "Again, Black could have retreated the bishop, but he's not backing off!",
        "12. cxd4": "Also possible is 12.Bxc6.",
        "12... Nxd4": "Black is willing to take a shot in order to deliver one...",
        "13. Nxd4 Nxd5 14. exd5": "There's no reason not to take.  White is now a piece ahead...",
        "14... Bxh3": "Black had to take a blow to the body to get in this one-two to the head.  ",
        "15. Re1+": "Counterpunching, forcing Black to retreat a little, allowing White to slide out from the ropes...",
        "15... Kd7": "Staying on rank 7 to allow the inactive rook to enter the game.  About here, though, I began to apprehend the likelihood of Qa4+ at some point, forcing the K to the back rank.  Too bad: it couldn't be helped.",
        "16. g3": "Blocking the knock-out blow...",
        "16... Qf7": "...but Black gets another shot in, at the f2-square just now left unguarded by the rook - as it were trading a guard to get in a counter-punch (15.Re1+), but also aiming a right hook by ...Qxd5-g2#.  Can White defend?",
        "17. Be3": "(?) Hard lines!  This attempted block fails whereat White gets battered to the canvas.  There were two possible defences here.  One was to force himself off the ropes by 17.Kh2!? Qxf2+ 18.Kxh3 Bxd4 19.Nd2 (19.Nc3 and 19.Qg4+ also deserve consideration) 19...Qf5+ 20.Qg4 Rae8 (still smacking each other in the teeth) 21.Rxe8 Kxe8 22.Qxf5 Rxf5 with a roughly even game, but plenty of play left.  The other was by delivering a left hook of his own: 17.Qa4+! (I think this might be the best line - it was the one I was expecting) 17...Kc8 (I hadn't quite yet made up my mind whether to play to d8 or c8, but the latter seems safest) 18.Bf4 (18.f4 Qg6 19.Kh2 Qh5) 18...Bxd4 19.Qxd4 g5 20.Re4 gxf4 21.Rxf4 Bf5 and it still seems to be anyone's game.",
        "17... Qxd5": "A staggering right hook... ",
        "18. f3": "There's really nothing else.  White has to cover g2, and as this defence is swept aside, conjure up further defences along the vacated rank 2.  The blow 18.Qa4+ is easily parried now by 18...c6.",
        "18... Bxd4": "What a peculiarly geometric picture the board presents!  Black wants to batter though White's defences.  White can not retake on d4 with the Queen (19.Qxd4 Qxf3 20.Qxg7+ Rf7)...",
        "19. Bxd4": "...but maybe he could have staggered on after 19.Nc3 Bxe3+! 20.Rxe3 Qxd1+ 21.Rxd1 Be6 though the two pawns extra would have been near on a winning advantage for Black.",
        "19... Rxf3 20. Bf2": "A doomed attempt to defend g3.  I think, though, that my opponent had already read the writing on the wall.  It's mate in two.  He sportingly plays it out.",
        "20... Rxg3+": "(!)",
        "21. Bxg3 Qg2#": "White's 17th was the turning point of the whole game.  After playing 16...Qf7 I thought we might have been heading for a very entertaining draw..."
    },
    "url": "https://gameknot.com/annotation.pl/traxler-variation-tournament?gm=28015",
    "gameName": "Traxler Variation Tournament",
    "players": "nuntar (1678) vs. ionadowman (2113)",
    "opening": "two knights defence (C57), Wilkes Barre (Traxler) variation"
}