{
    "moves": {
        "1. e4": "Hi everyone!\r\n\r\nThis is my last game in the Traxler MT.  It ended on a fairly high note with a High Draw against Paolo, but, alas, wrapped up in gaining material parity with him, I missed a chance to get a five point lead in material against him which would have been enough to win despite our rating differential.  The moral here is, always look for a better move and try not to get too wrapped up in your plan, otherwise you will end up with a missed opportunity.  Gameknot analysis is provided as follows and I will pick up commentary on Move 7.  http://gameknot.com/analyze-board.pl?bd=15146349&fb=1&rnd=0.6709744076164328",
        "1... e5 2. Nf3 Nc6 3. Bc4 Nf6 4. Ng5 Bc5 5. Nxf7 Bxf2+ 6. Kf1 Qe7 7. Nxh8 Bb6": "7. ...... Bb6 - this retreat of Fou Lenoir has netted me most of the 6.5 points achieved from this MT.  That a7-g1 diagonal has actually resulted in a couple of my opponents copping Old Matey from Glenda once the d column has been opened because Fou Lenoir has prevented the WK from taking refuge on g1.",
        "8. Bf7+ Kd8 9. Bb3 d5": "9. ...... d5 - this pawn move is intended to cut off the lsb's line to f7 (an escape square for the cadaverous white steed on h8) and enable either Glenda or my remaining rook to snap it up later on.",
        "10. Nc3 Qf8 11. Nxd5 Nxd5+ 12. Qf3 Nf6": "12. ..... Nf6 - after this move, which alas has re-opened the lsb's diagonal onto f7 I have managed to narrow the deficit to 3 material points.  I still either need to get material parity or a mating attack going or I am gonna be toast!  At least backing off the knight to f6 avoids a queen trade.",
        "13. Nf7+ Ke8 14. Bc4 Bg4 15. Qa3 Bc5": "15. ..... Bc5 - after a few more moves, Henry has been prevented from hiding away in a queenside castle and the Wicked Witch of the West has been chased around the board.  Again I prevent the exchange of queens.",
        "16. Qb3 Bb6 17. Qd3": "17. Qd3?? - Glenda should have gone to c5 immediately, but alas I am half asleep here.  I am so caught up in trying to trap that wretched f7 knight that I missed a chance to go 5 points up in material with the dozy Bh5?? and to gain 15 rating points.  Sigh and double sigh!  I only saw that queen move after I hit the submit button, alas it was too late as I was foiled by Qa3.",
        "17... Bh5 18. Qa3 Qxa3 19. bxa3 Bxf7 20. Bxf7+ Kxf7": "20. ..... Kxf7 - well, so I have my material parity and perhaps a slight positional edge, as white's queenside pawns were shattered by the queen trade before the white knight and the white lsb's disappearance from the board.  I still feel a bit sick about this missed opportunity.",
        "21. d3 Ke6 22. Rb1 Rf8": "22. ...... Rf8 - threatening Nxe4 discovered check winning a pawn.  Paolo wisely moves his king out of the line of fire.",
        "23. Ke1 Nd7 24. Bd2 Nf6": "24. .... Nf6 - it was sooo tempting to have played Rf2?? here.  That would have cost me a piece due to Rxb6, however.  I saw that move just as I was about to hit the submit button and played my knight back to f6.  I considered at this point to have had no more than a slight positional edge.  My opponent said that he was not happy with his position so I decided to put in a draw offer.  My opponent accepted and I gained 5 rating points.  Ah Ion, I bet you thought you would never see the day when I, Joanne Stevens, would be disappointed with a High Draw against a 1950+ player would you?"
    },
    "url": "https://gameknot.com/annotation.pl/traxler-with-5-nxf7-missed-opportunity?gm=36361",
    "gameName": "Traxler with 5.Nxf7 - Missed Opportunity",
    "players": "paolo2504 (1953) vs. jstevens1 (1767)",
    "opening": "two knights defence (C57), Wilkes Barre (Traxler) variation"
}