{
    "moves": {
        "1. e4": "Analysis; http://gameknot.com/analyze-board.pl?bd=14874608&rnd=0.2536924332866103 - a lot of these listed mistakes assume that Black is looking to draw\n",
        "1... e5 2. Nf3 Nc6 3. Bc4 Nf6 4. Ng5 Bc5 5. Nxf7": "As ever, the game starts in this thematic position...\n",
        "5... Bxf2+ 6. Kf1 Qe7 7. Nxh8 d5 8. exd5 Nd4 9. d6 cxd6 10. Kxf2": "...and these moves have been played often as well [the pawn sacrifice was made to open up the line of the light-square bishop] I've tried Ne4+ here, but it didn't work that well. I haven't had the chance to try Jo's next move here, and unfortunately it's too little too late for me (I have one White game left vs ionadowman)\n",
        "10... d5": "This move closes down the diagonal once again, and threatens the bishop as well...\n",
        "11. c3": "!? but I make a counter-attack, which also holds a hidden trap if Black is not careful; 11...dxc4 12.cxd4 exd4?? 13.Re1! and White wins. If Jo doesn't want to go down this line, then she'll have to move her knight...\n",
        "11... Bg4": "...but first, this zwischenzug! White needs to save his queen!\n",
        "12. Qa4+": "I remove my queen from the line of fire...\n",
        "12... Nc6": "... but am unable to capture the knight because of this block. Now White moves his bishop...\n",
        "13. Bxd5": "? I'd thought that I had seen a nifty trick in this position; the f6 knight may be able to capture my bishop, but it's also the only piece protecting the g4 bishop! Looks good on paper, but Jo has her own trick up her sleeve with another zwischenzug... \n",
        "13... Qc5+": "! If I had to name one main weakness in my chess-playing, it would be missing deadly king forks like this - now the queen can take the bishop!\n",
        "14. d4": "At the very least I can use the check to speed up my own development slightly - There's no reason for my queen to be targeting the bishop when it's protected\n",
        "14... Qxd5 15. Nd2": "?! I'm not so sure that this move was best - maybe Bg5 ought to have come first? All I remember thinking was that my bishop didn't have much use on the c1-h6 diagonal...\n",
        "15... O-O-O 16. Rf1": "Nevertheless, I had good reason to be optimistic about my chances here, despite the fact that I'm about to lose my knight; Kg1 and I have castled by hand and my king is safe. My extra piece should then carry me to victory... right?\n",
        "16... Rxh8": "On a side note, I think as White if you can't get an immediate attack, you should go after the cornered knight before it can escape\n",
        "17. b3": "Preparing to develop my final minor piece, but should I have played dxe5? Jo can win a pawn here with exd5 - she doesn't do it straight away though...\n",
        "17... Rf8": "Threatening a discovered check. If it was Black's turn to move, I don't think any knight move would be too damaging, but it does mean that I can't take the e-pawn; 18.dxe5? Ne4+! 19.Ke1 Nxd2 20.Bxd2 Rxf1+ 21.Kxf1 Qxd2 wins a piece.\n",
        "18. Kg1": "Pre-empting the discovered check\n",
        "18... exd4 19. cxd4 Re8": "A pawn exchange, and here Jo has Qxd4+ or Nxd4 to win a pawn. I don't know why she didn't play that - perhaps she was looking to improve her position, or she was unwilling to exchange material for just a pawn. I do notice a bit later on that despite being a piece up, Black has a better positional advantage than White\n",
        "20. Ba3": "I'll also admit that I hadn't considered the d4 pawn with this move and was only thinking about the scope of my bishop, else I may have played Bb2\n",
        "20... Re2": "Rook on the 7th rank - and it threatens both checkmate on g2 and the d2 knight!\n",
        "21. Rf2": "Forced...\n",
        "21... Rxf2": "...and Jo decides to exchange\n",
        "22. Kxf2 Qf5+ 23. Kg1 Qd3": "! Another fork, and both the pawn and knight [again!] is attacked... where should the knight go? it seems uncomfortable on the back rank, and Nf3 allows Black to wreck my pawn structure. I also don't like the look of the queen check or exchange - yes, I'm a pawn ahead but with Black's central domination I wasn't sure if I could keep the material lead. What to do...?\n",
        "24. d5": "!? Complicating matters - If Jo decides to exchange knights (QxN, PxN) then I can launch an attack on the exposed king. Of course, since the f6 knight is protecting the bishop, it can't take the pawn either. Finally, Jo could retreat the knight, at which point I would just play according to where she put it.\n",
        "24... Qxd5": "This capture works too - and I still need to move my knight! I then noticed the position of the queen and bishop...\n",
        "25. Nf1": "...and embark on an idea that proves to be a complete flop! You'll see how in just a bit!\n",
        "25... h5 26. Ne3": "? I ought to have moved my rook first. The intention is simple (getting rid of the bishop) but I underestimate the strength of Glenda...\n",
        "26... Qe5": "! The first strike - Glenda moves out of the line of fire AND forks two pieces! There are only two ways to deal with this threat...\n",
        "27. Nc2": "...and I chose the wrong one! I had looked at and rejected Re1 because of Qd3, but I had missed the move Kf1! (this does allow Black to draw by threefold repetition, however... Whether Jo would want to do that or not is another matter!) Now the knight falls... \n",
        "27... Bf5": "I still have two pieces under the line of fire!\n",
        "28. Re1": "Hoping that this counter-attack would be effective, but it was not to be! Rc1 doesn't work because it doesn't really defend the knight - If the rook leaves the first rank, Qe1# follows.\n",
        "28... Qc3": "! This is, if I'm not mistaken, the fourth time that a fork has been used against me in this game - they're nasty little things aren't they? :)\n",
        "29. Qc4": "I knew I was going to be down material, but I was growing tired of Glenda wrecking havoc in my camp! \n",
        "29... Qxc4": "However, my pawns do become weaker due to this trade!\n",
        "30. bxc4 Bxc2 31. Be7": "My bishop comes to the seventh rank...\n",
        "31... Nxe7": "...only to be replaced by my rook! If Jo had not done this, I would have either captured the other knight [weakening pawn structure] or Bg8, if the other knight had moved\n",
        "32. Rxe7 g6": "Naturally - this pawn is now protected by the bishop and is immune to my rook. It does have its use on the seventh rank in that it ties down Henry, and if my own king can get over there, material equality and even mate could follow! (King on d6, rook on e8 and no f6 knight, for example)\n",
        "33. Kf2": "Beginning the king march...\n",
        "33... Nd7": "! The power of my rook has been significantly weakened by this move - now Henry is no longer confined to the back rank!\n",
        "34. Ke3": "nevertheless, king centralisation is vital in the endgame!\n",
        "34... Kc7 35. Kd4 Kd6 36. Re2": "My rook has no more use on the seventh rank, so I retreat with tempo with a new goal; getting rid of one of my queenside pawns!\n",
        "36... Bf5 37. a4": "The advance begins!\n",
        "37... b6 38. Ra2 Kc6": "Here, I wanted to play a5, but was deterred by the move b5 [if I exchange pawns, my a5 pawn is doomed!] However, the GK analysis says that I should, in fact, have played that move!\n",
        "39. g3": "Instead, I play a waiting move...\n",
        "39... Kd6": "...and now that the Black king has moved away, I can initiate my advance...\n",
        "40. a5 Kc6 41. axb6 axb6": "... and rid myself of the pawn weakness... so what now?\n",
        "42. Ra3 Kd6": "Here Jo offered a draw, and I accepted - 1/2-1/2. Neither of us could see any breakthrough for either side, but GK analysis judged that the game was +2 in Black's favour. If anyone can see a winning course of action for Black here, feel free to comment! :)\n"
    },
    "url": "https://gameknot.com/annotation.pl/traxler-with-5-nxf7-all-clear-for-white?gm=35791",
    "gameName": "Traxler with 5.Nxf7 - all clear for White?",
    "players": "x-machine (1547) vs. jstevens1 (1765)",
    "opening": "two knights defence (C57), Wilkes Barre (Traxler) variation"
}