{
    "moves": {
        "1. e4 e5 2. Nf3 Nc6 3. Bc4 Nf6 4. Ng5 Bc5 5. Nxf7": "The starting position of the mini-tournament...\n",
        "5... Bxf2+": "...and the normal follow-up - Black has to do this if he wants to get anything out of this variation\n",
        "6. Kf1": "By far the safest option - the next two moves are also normal for this mini-tournament...\n",
        "6... Qe7 7. Nxh8 Bb6": "!? It seems that mainline here is 7...d5 but there has to be playability in this move - by allowing the dark-square bishop to stay on the board, Black can exert considerable pressure on the a7-g1 diagonal [I think I'll be playing more of this move as the mini-tournament goes on...]\n",
        "8. Nc3": "Naturally, Joanne needs to develop her pieces as fast as possible to repel any attacking attempts from Black\n",
        "8... d5": "Developing with a tempo attack on the bishop, and White has two pieces and a pawn to choose from in which to recapture, although GK analysis prefers Qc5\n",
        "9. Bxd5": "?! Not the best recapture, even though Black can't capture the queen with Bg4. I had considered that, but rejected it due to Bxc6+ [the knight pair can be a monster in this variation] That was, however, the best move according to the GK analysis, but I get confused by the line it gives - 9.Bxg5 Bg4 10.Bxc6+ bxc6... but then the line continues Ne2, which allows Nxe4... why Qe1 wasn't considered by GK analysis, I don't know.\n",
        "9... Nd4": "?! At any rate, I opt to keep my knight - however, Bg4 is a plan in the immediate future...\n",
        "10. h3": "Joanne puts a stop to that right away...\n",
        "10... Ng4": "But the knight can't be stopped! It seemed such a strong move at the time, opening up the f-file for my queen while posting my knight on a strong square... but there was a refutation that the GK analysis picked up on; 11.Bf7+ Kf8 12.Nd5!, and the black queen has no squares for intrusion on the f-file. It is true, though, that the knight cannot be taken right now...\n",
        "11. hxg4": "?? As will be demonstrated in the next couple of moves!\n",
        "11... Qf6+": "The attack begins, and White's next move is forced; 12.Kg1 Ne2+ [double check!] 13.Kh2 Qh4#\n",
        "12. Ke1": "Although exposed, the king seems safe enough here, but I'm going to hazard a guess that Joanne missed my next move...\n",
        "12... Nxc2+": "! Once again, this knight shouldn't be taken! [13.Qxc2 Qf2+ 14.Kd1 Bxg4+ 15.Ne2 Bxe2#] Unfortunately the only other move that White has walks right into a king/queen skewer!",
        "13. Ke2 Bxg4+": "Here, Black's advantage is +6.66... ;)\n",
        "14. Kd3 Bxd1 15. Rxd1": "Rb1 saves material, but the king becomes dangerously exposed after Nb4+\n",
        "15... Nxa1": "...and then the black knight captures White's rook - Black just went from -9 to +4! Joanne resigned at this point, and with Black's material and positional advantage, who can blame her? I'm going to have to be careful though - she'll be sure to be looking for revenge in our second game! :P\n"
    },
    "url": "https://gameknot.com/annotation.pl/traxler-with-5-nxf7-the-ideal-attack?gm=34949",
    "gameName": "Traxler with 5.Nxf7 - The ideal attack!",
    "players": "jstevens1 (1779) vs. x-machine (1607)",
    "opening": "two knights defence (C57), Wilkes Barre (Traxler) variation"
}