{
    "moves": {
        "1. e4": "Hi everyone!\r\n\r\nJust to let you know that I failed to get my first ever Expert Victory - by 90 rating points!  I had to settle for only my second ever victory against 1900+ oppo. in a non-timeout game.  With the black pieces I managed a High Draw against him.  Matt gave me a hard game from the Opening to Middlegame but in the latter part, a strong move from Glenda forced an exchange of queens that led to my advantage in the endgame in which I was a piece for a pawn up.  Gameknot analysis of this game is provided as follows:-\r\nhttp://gameknot.com/analyze-board.pl?bd=14963275&rnd=0.11080572229711893",
        "1... e5 2. Nf3 Nc6 3. Bc4 Nf6 4. Ng5 Bc5 5. Nxf7 Bxf2+ 6. Kf1 Qe7 7. Nxh8 d5 8. exd5": "8. exd5 - the first 8 moves have been fairly standard.  I sacrifice my d pawn to try and interfere with black's counter-attack.",
        "8... Nd4 9. d6 cxd6 10. Kxf2": "10. Kxf2 - Henry dares to snare Matt's dark square bishop, but is he dancing into the fire?!",
        "10... d5 11. c3 Bg4 12. Qf1 Nc2": "12. ....... Nc2 - Nasty, nasty, my QR is trapped.  Can I sell him as dearly as possible?  We shall see.",
        "13. Bb5+ Bd7 14. d4 O-O-O 15. Kg1": "15. Kg1 - after black castled queenside, Henry must find some sancturary on the kingside.  Alas, my KR is well and truly boxed in.",
        "15... exd4 16. Bxd7+ Nxd7": "16. ...... Nxd7 - thought I had better rid myself of black's lsb at the cost of Fou Leblanc as that prelate could be lethal to Henry.",
        "17. Na3 Nxa1 18. Bd2": "18. Bd2 - my knight is coralled on h8 but Matt's is also coralled on a1.  Dare I imagine I could end up with a piece advantage out of this?",
        "18... Rf8 19. Qxa1 Qf6 20. Qe1": "20. Qe1 - Glenda gets as close to her other half as she can, aaah!  Reason, Henry is in Old Matey's shadow (Qf2#).",
        "20... dxc3 21. bxc3 Rxh8 22. Qf2 Qa6": "22. ..... Qa6 - this looks like a very strong move.  It attacks the knight on a3 which is blocking an undefended pawn on a2.  Luckily Fou Lenoir can safely defend the a3 knight.",
        "23. Bc1 Rf8 24. Qe1 Ne5 25. h3": "25. h3 - this knight prevents Ng4 and also opens up some luft for Henry and ultimately my KR!",
        "25... Nd3 26. Qe7": "26. Qe7 - spent a lot of time analysing this move.  Glenda and I are gals of a like mind - we absolutely hate being pinned down - so Glenda hops on her broomstick and menaces the rook on f8.  Should the BR move off the f file, Glenda can either hassle the BR further or the BK.",
        "26... Qf6 27. Qxf6": "27. Qxf6 - Glenda gladly gives up her life for the Wicked Witch of the West as the pressure on a3 is greatly eased.  After the trade, Fou Lenoir moves to e3 to prevent a rook incursion on f2.",
        "27... Rxf6 28. Be3 Ra6 29. Nb5": "29.  Nb5 - counter-attack on the a2 pawn.",
        "29... b6 30. Kh2": "30. Kh2 -  at last Henry makes way for his rook.",
        "30... Ra5 31. Rd1": "31. Rd1 - Jo The Beginner (my OTB rating is 1200!) has a tendency to suffer greatly from the afliction passivitis.  Here she tries to erase that word right out of her vocabulary with more counter-attack!  This gets my KR right into the fray.  Notice the weak d5 pawn behind the d3 knight?!",
        "31... Rxb5 32. Rxd3": "32. Rxd3 - it is good to trade pieces when a piece up and plenty of pawns still on the board.  I wish I could trade rooks ....",
        "32... Kd7 33. c4": "33. c4 - my opponent grants me that wish.  I now exploit the pin on the weak d5 pawn to either win another pawn making me a full piece up, or to force an exchange of rooks giving me a won endgame.  My a pawn and Fou Lenoir can hold fast on the queenside.  If the BK tries to make use of the queenside pawn majority by moving towards the queenside pawns then Henry will move towards the black kingside p(r)awns for a fine supper later on - he fancies prawn vindaloo tonight.  If Henry eats those pawns then my kingside pawns will march on to Glendadom.  My opponent saw all this and decided to wave the white flag to end a lovely evening for me.  Hope you have had a good read.  Bye for now - Joanne"
    },
    "url": "https://gameknot.com/annotation.pl/traxler-with-5-nxf7-a-big-win?gm=35944",
    "gameName": "Traxler with 5.Nxf7 - A Big Win!",
    "players": "jstevens1 (1775) vs. charlie06 (1910)",
    "opening": "two knights defence (C57), Wilkes Barre (Traxler) variation"
}