{
    "moves": {
        "1. e4 e5 2. Nf3 Nc6 3. Bc4 Nf6 4. Ng5 Bc5 5. Bxf7+": "This is the only move I question because the initial agreement was that white would 5.Nxf7, and then black would play 5...Bxf2  My guess is that white didn't want to go into all those variations and think he can win by playing taking with the B since he is stronger.  But, this is very difficult to access, especially, when you count the fact that black will be victorious, in the end.",
        "5... Ke7": "I would've played 5...Kf8, instead.  But, seeing that he moved here means that moving to f8 wouldn't be as good.  I just don't know why this is better, it is interesting since.  From what I've learned, unless it's an endgame, getting the K off the homesquare is less safe.",
        "6. Bc4": "The idea being is that, if white can ever fork black's Q and R, black cannot refute the threat with ...Nf7  So, he is definitely threatening to win material.  Therefore, (although it's a move I wouldn't have thought of) I really like it.  That's because GM Damien Lemos told me, in an e-mail course that, in chess, one thing you want to do is create a threat that is difficult to drive off.  It turns out that this is what white is doing.",
        "6... Qe8": "At first, I wasn't sure why black played this, but it makes sense.  In this position, white was threatening 7.Nf7  So, He is preventing a nasty fork which would lose a R for N.  ",
        "7. O-O": "Knowing that Nf7 won't work, white gets his K to safety, at once.  Believe it or not, this is also what I would've played.  ",
        "7... d6": "Developing a center pawn.  For the obvious reason, I would not have even considered 7...d5  But, this, however, is the same move that I would've played, as it gives the opportunity for black to complete development.  Despite it looking bad for him for the reasons mentioned, one thing that's important to note, however, is that black is a move ahead in development.  While it might seem insignificant, especially at our ratings, for them, this is especially important.  For example, when tactical-abyss saccs his early and wins, he points out important points.  One of them is that his opponent should win, but the reason they don't is due to their lack of develeloped.  So, when Joe completes his development and they haven't, one thing he does is coordinate his remaining pieces for a devastating attack.  Just being one move behind in development can make all the difference in the world.  In fact, I recall seeing one of those games, where that happened.  Well, the same thing could be said here, but with the setup being difference, as with any variety, it's interesting to see what will become of this.",
        "8. c3": "This time, I have no idea why white played this.  My guess is that he is thinking along the lines of b4, so that when black retreats, he can use that time to complete his development.",
        "8... Rf8": "However, I don't know why black played this.  But, this time, I don't see the point.",
        "9. Nf3": "I am also not sure why white moved here.  I don't see anything wrong with 9.b4 for the reasons outlined earlier.  In other words, I don't see any immediate threats, so that is what I would've played.  ",
        "9... Bg4": "Meanwhile, black has just completed development.  And, while he's still down by a pawn and can't castle, I think it's even.  In fact, I am, ironically, starting to favor black's position.  But, I can be very wrong which is why I won't draw conclusions, and anything can still happen.  In fact, where we are reminds me of, as archduke_piccolo calls it, \"Back to School\".",
        "10. d3": "While analyzing b4, I like this move a lot, as it develops a central.  Yes, I normally would consider deviating from guidelines as these players do, but others like easy19, and even, tactical-abyss (when I used one of his techniques from the Q sac) said that against stronger players, one should not deviate from The General Opening Guidelines.  Of course, there are exceptions to which you must, but otherwise, you should follow them since they have more experience.",
        "10... Qg6": "Connecting his R's.",
        "11. Kh1": "Although it's not immediate, in the long run thinking many steps ahead (as I've done things like this before as Homework) black just might have a mating threat should he be able to bring his Q to h5.  The idea being, as I learned from Jack Stockel, is that when you're faced in a situation like this (that is where a threat allumes) The K should be in the corner.  And, it is part of K safety.  In a position like this, I understand where that applies. ",
        "11... Qh5": "Although I've tried to analyze it, I don't see the point behind this move.  I was initially thinking that black wanted to prevent Nh4, except that the N is indirectly pinned to the Q, anyhow.  But, some things that don't make sense to us make sense to much stronger player like these two.",
        "12. Nbd2": "Adding a defender to the f3.",
        "12... a5": "The idea behind this move is to create a semi open file for black.  Moves like this often give one an advantage.  I know because this is something that TA mentioned in another Q sac, which was opened files.  I also annotated that game, and one of the commentators also mentioned the importance of open files.  In addition, he is preventing white from attacking the DSB since the loss of tempo would be ugly.",
        "13. Kg1": "I am not sure why he played this.",
        "13... Nd7": "Black is trying to find a better outpost for the N, presumably, on b6.  I know because this was an example that Susan Polgar gave when she talked about strategy.  That was why they appear to cram their N's.  While they appear that way, there is a plan, and usually they get a better position with a stronger outpost, and the idea is about how to improve your position.",
        "14. h3": "Getting rid of black annoying LSB.  I am not sure, if its the right choice.  While white is a pawn up because a recent annotator said the same thing that elyhim emphasized.  When you're behind, exchange pawns, not pieces, the problem is that with this move, white will lose the exchange.  In other words, after exchanging pieces, white will go from ahead to behind.  From there, I think that black will have a clear advantage.  However, it's impossible to conclude or even state as a fact since white is a much stronger player.  So, things can still change.",
        "14... Bxh3 15. gxh3 Qxh3 16. Nh2": "?? I am not sure why white played this.  But, in my opinion, it's a blunder because black will further liquidate, but more important, white's K will become exposed.  Therefore, I think it's safe to conclude that black is winning.  However, I don't know if white has anything to counter it.  If the two players were the same strength, then I'd think otherwise.  However, stronger player can and does things that will throw the opponents off guard.  An example happened in a game that Mr. Stockel annotated.  It was with GM Bobby Fischer against his opponent.  Now, Fischer played a move that everyone, including the computer thought was a losing blunder that would lose the game (and I forget the variations, btw).  But, Fischer saw something that no onelse did.  And, what appeared to be a losing mistake was, in reality, the winning move.",
        "16... Bxf2+ 17. Rxf2 Rxf2 18. Kxf2 Qxh2+ 19. Ke1 Qg3+": "As implied earlier, white is in trouble.",
        "20. Ke2": "I like 20.Kf1 better, but I guess white wants to keep his monarch closer to his pieces.",
        "20... Rf8": "Threatening something nasty.",
        "21. Qh1": "However, this is still the better alternative since there is no mate, anyhow.  And, it's better then losing a Q for a R.  With that being said, black's next move will not kill white.",
        "21... Rf2+ 22. Kd1": "Forced.",
        "22... a4": "But, this is what black had in mind.  I think that the long term plan for him is to get a passed pawn which would, however, prove to be lethal for white.",
        "23. b4": "Personally, I would've tried to stop it with 23.b3  Now, if black wants he can make an en-pessant capture with 23...axb3 e.p.",
        "23... Nf6": "That is what I would've done.  But, I like this move almost as well because, as noted earlier, black has found a stronger outpost for his N.",
        "24. Kc2": "Since this is not an endgame, yet, I don't know why white played this.  The idea being is that usually, where we are, the K does not play a role so bringing out isn't a good idea.  But, given how much stronger these players are, I don't what role to bring it out earlier.",
        "24... h5": "This time, black has two passed pawns, so he is going to start using to his abilities, a that's an important part of tactics.  That is especially because we're now nearing the endgame.  It's not quite, yet, but I think that will change, shortly.",
        "25. Kb1": "Therefore, the K does play an important role, at this point.  I think white's plan is to get his monarch to a3 where there will be pressure against a4.",
        "25... g5": "Connecting his passed pawns.  The plan is to get a pawn chain with them.",
        "26. a3": "Stopping black from getting a third passer.",
        "26... Qf4": "Keeping his R and Q aligned which is known to be dangerous.",
        "27. Ra2": "Adding another defender to his N.",
        "27... g4": "As noted, black achieves a solid pawn chain with this move.  And, with it, a promotion will become inevitable.  I saw a similar example with tactical-abyss involving where someone did get an edge and promoted with a pawn chain, like this.  That's where they, especially, play an important role.  I remembered that in my game against redfoxrising, in my toughest endgame, ever.  I mean, it was more difficult then anything I've ever studied, yet I remembered those as well, and followed everything I knew about endgames.  One thing that played the role and allowed me to force the win was the pawn chain, similar to what we're seeing now.",
        "28. Qe1": "Trying to stop black's passer from promoting.",
        "28... g3": "But, it is, unfortunately, too little, too late.",
        "29. d4": "At first, I thought that white wanted to exchange, but he really intends to do is attack black's N.  Knowing that he can't stop promotion, if black was to make another Q, white would get a N, in return.  ",
        "29... Qg4": "Supporting the passer.  By doing so, the second Q will prove to be lethal.  ",
        "30. d5": "As noted, he is going after the N.  ",
        "30... g2": "But, this does not bother black, as I also outlined.  And, now white takes the R, instead, after which, will make a second Q. ",
        "31. Qxf2 g1=Q": "And, now, the Q's will be exchanged.  After which, white will equalize by taking a piece for a pawn.  However, it really isn't near even because, despite being only the equivalent to a pawn up, white will lose his Q, whereas, black will keep it.  And, stay tuned because, as we're about to see, black has something up his sleeve, as they say.",
        "32. Qxg1 Qxg1 33. dxc6 bxc6 34. Rc2": "Adding a defender to the c file.",
        "34... h4": "Attempting a promotion, and if he's able to do it, it'll mean lights out for white.",
        "35. Nf1": "Stopping the passed pawn from advancing, any further.  The only problem is that black gets a pawn, and this time, without compensation.  But, it's still better then allowing white to Queen.",
        "35... Nxe4 36. Kb2": "Mobilizing his K.",
        "36... Nf2": "Blocking white's R so that, if he wanted to, black could advance his h4, another square.",
        "37. Bd2": "I don't why white played this.",
        "37... e4": "With another passer, black takes advantage of it because, as the saying goes, \"Passed pawns must be pushed.\"  And, this move, guarantees a promotion for black.  With that being said, I'd say that the game is lost for white.  But, it's still worth fighting and being aggressive because you still don't know what'll happen.  However, I don't think that white has a chance of counterplay, at this point.",
        "38. Bg5+": "So trying anything, white checks, with the idea being that he will liquidate when white gets out.  And, now it's to his advantage due to being up a pawn.",
        "38... Qxg5 39. Rxf2 d5": "Getting the pawn chain that we all know about.  Since it's an endgame, a pawn chain, like this, is also known to be deadly.",
        "40. Ba6 c5": "Allowing white to take, knowing that when he does, black will go after the R.  In return, black will get that pawn, and wind up with a bigger structural advantage.",
        "41. bxc5 Qg1 42. Rf5 Qxc5 43. Be2": "Protecting his B.  That's because with white's move, had white not retreated, black would win a piece, as white's B+K would be forked by the Q.",
        "43... Qb6+ 44. Kc1 Qb3": "Given that white has two isolated pawns, black is going to win one of them.  That is why he moved here, no matter what he does.",
        "45. Ne3": "The idea being that if black takes, white will recapture.  So, the plan is to prevent black from getting another pawn.",
        "45... Qxc3+": "But, it's too little, too late.  And, I think that black made the right choice because he took the passed pawn.  The thing is that none of them are passes pawns.  But, a pawn doesn't have to be a passer in order to be considered dangerous.  a3 was not concern, as it was blocked by black's a4, but c3 because although it's not passed, white was threatening to isolate.  The plan was 46.d4, and after 46...dxc4 47.Nxc4, and now, aside from h4, not only would black have two isolated pawns, but the rest of them would be blocked.  And if white were to play Bf1, which I believe was the plan, the h pawn would be no longer be a concern, either since it can't advance further.  And, from that, I think would end in a draw, so this does more then just nab a dangerous pawn.  In doing so, black deprives white's chance of counterplay.",
        "46. Nc2": "Intervening to prevent the loss of a piece.  Now, I believe it was GM Susan Polgar who said that when in check, don't think that you should, automatically, get out with the K.  Sometimes, it's better to intercede with a piece, as we see here.",
        "46... Kd6": "Although winning, black is centralizing his King.  The idea being, as noted earlier, is that the monarch is quite dangerous in the end game.",
        "47. Bb5": "But, with his last move, white will get a pawn.  However, in this particular position, losing a pawn is not a big deal because it was useless on a4.  This is something that Jack Stockel has emphasized, and he calls it a bad pawn.  He said that winning a bad pawn (in the endgame) doesn't do much.  That's because, it's more like a gambit (in it's late stages).  So, when he or she takes it, the opponent uses that time to advance a passed pawn, which will often allow a promotion, as we will see later on. ",
        "47... c6": "Gaining time with a pawn chain, in the process.  But, as noted above, when white takes, black will advance a passer, until a promotion is guaranteed.",
        "48. Bxa4 e3 49. Kb1": "Doing whatever he can to minimize the damage.",
        "49... e2": "But, it's too late.",
        "50. Ka2": "Protecting a2, which is his only passed pawn.  But, to throw white off guard (in my opinion), black will advance a different pawn.",
        "50... h3 51. Rh5": "Stopping that pawn from Queening.  But, black will promote the other pawn, that he has been advancing for several moves.",
        "51... Qd2": "Guaranteeing the promotion, so that, when white takes, black will have a second Q, regardless.  This time, however, the damage is irrevocable.",
        "52. Rxh3 e1=Q 53. Rh6+": "Trying to do what he can, white gives check.",
        "53... Ke7 54. Rh7+ Kf8": "Following, triangles because when white checks again, the K will move to another file.  So, he is moving in a triangle, by playing ...Ke7 ...Kf8, and ...Kg7  Now, Susan Polgar has said that in endgames, where you have an advantage with a difficult win, triangulation is the way to go.  That's why even though I disregarded and eliminated the trigonometry, after blocking a certain someone, I resumed it again.  That is because she said that the trigonometry, involving the K, it is how you win, in complicated positions like this.  And, with this form of triangulation, white will run out of checks as black will get tempo, to add insult to injury.  The reason being is that, after 55...Kg7, if white checks, he'll lose his R.  So, by retreating, black will do further damage.",
        "55. Rh8+ Kg7 56. Rb8 d4": "The reason being is that, with this move, black's passer on d4 is protected by his Q.  And, black can clear a path, by moving his d3 Q to allow ...d3, and if white protects and attacks, after, with Nb4, black can answer with ...c5, not just attacking the N, but achieving another pawn chain, in the process.",
        "57. Rb2": "Adding a defender.  But, black has an answer to that.",
        "57... Qee2": "The reason being is that he has added another attacker to that rank.  Therefore, white is in bigger trouble.",
        "58. Rb7+": "Without anything to lose, white checks.",
        "58... Kg6 59. Rb2": "It's proven with this move because, after getting out, white comes back here since white must defend against the pressure.",
        "59... d3": "However, the pressure has now become overwhelming for white to handle.",
        "60. Bb3": "I would've played 60.Bxc6 to get a pawn out of this.  But, it doesn't matter what he does because white is toast.",
        "60... dxc2 61. Rxc2": "I would've recaptured with 61.Bxc2 because I would've felt slightly more comfortable.  But, it won't do anything, in this position, no matter how you look at it.",
        "61... Qdxc2+": "At this point, black resigned.  And, now we can apply, exactly what I know from how to mate with your N+B, but with the colors reversed since black has the mate.  So, with that being said, black will be able to confine white's K to one square (a1).  And, then there would be no way to avoid mate.  Worth noting that one of the reasons I kept studying the K against K+B+N, (taking the test until finally passing, where it became second nature) as noted in chicoboy's legacy; was so that I could notate something similar which applies in all endgames.  With that being said, here is a sample line of how black would mate.  After 62.Bxc2, Qxc2 63.Ka1, Qe4 64.Kb2, c5 65.Kb3, c4+ 66.Kc3, Qd3+ 67.Kb4, c3+ 68.Kb3, c2+ 69.Kb2, Qd1 70.Ka2, c1=Q   And, now that the K is pinned, the only move left is 71.a4, in which case, 71...Qa1#, 71...Qb1#, 71...Qc2#, or 71...Qd2# are all mate.  Since white saw this happening, he wasn't going to stay in any longer."
    },
    "url": "https://gameknot.com/annotation.pl/traxler-counter-attack-1-e4-e5-2-nf3-nc6-3-bc4-nf6-4-ng5-bc5-5-nxf7-bxf2?gm=60015",
    "gameName": "Traxler Counter Attack 1. e4 e5 2. Nf3 Nc6 3. Bc4 Nf6 4.Ng5 Bc5 5. Nxf7 Bxf2+",
    "players": "unrealness (2494) vs. johnny5 (2340)",
    "opening": "two knights defence (C57), Wilkes Barre (Traxler) variation"
}