{
    "moves": {
        "1. e4 e5 2. Nf3 Nc6 3. Bc4": "This straightforward development and direct strike towards f7 is probably the most 'natural' line, though not so often seen at the top levels these days, compared with 3.Bb5 (Ruy Lopez) or even 3.d4 (Scotch Game).  Also playable here is 3.Nc3, the Three Knights Opening.",
        "3... Nf6": "The Two Knights' Defence, one of my favorite lines in Chess.  Riskier than 3...Bc5 (Giuoco Piano - the Quiet Game), it offers a tactical struggle with chances for both sides.",
        "4. O-O": "Probably White's most circumspect answer, though it does offer Black the chance to transpose back into a Giuoco Piano.  Instead, White could try 4.d4, striking at the centre, 4.d3, transposing into the Bishop's Opening (1.e4 e5  2.Bc4 Nf6  3.d3 Nc6  4.Nf3).  Probably still the most controversial line is 4.Ng5!?, which can lead, after 4...d5  5.exd5 Nxd5?? (Best - certainly safer - is 5...Na5)  6.Nxf7! ... into the toils of the frumious Fegatello Attack, a.k.a. the Fried Liver.  Surprisingly in this line, Black can at move 4 ignore the threat to his f7 and develop by 4...Bc5!? - the Wilkes-Barre (or Traxler) Variation, which can lead to some very wild and woolly play.",
        "4... Bc5": "Effectively transposing into a Giuoco Piano.",
        "5. c3": "Planning to establish a broad centre (of pawns) at d4 and e4.  ",
        "5... d6": "(?!)  White's having left his e-pawn unguarded, Black would have done best to grab it:  5...Nxe4  6.Bd5  Nf6  7.Bxc6 dxc6  though after 8.Nxe5 0-0  9.d4 Bd6  10.Bg5 White gets his pawn back and the game remains fairly even.  Black would have the bishop pair, very much an  asset on a fairly open board.",
        "6. d4": "As planned, and it's quite in keeping with the spirit of the opening White has chosen.",
        "6... exd4": "Black does best to exchange at d4 before retreating the Bishop.",
        "7. cxd4": "Establishing his broad pawn centre.",
        "7... Bb6": "Feasible was 7...Bb4, but White would probably have chased the Bishop back to b6 anyhow by 8.a3 and 9.b5, and then brought his rook to e1.",
        "8. Ng5": "(?!) It becomes clear that White played this with a particular idea in mind.  However, it is ill-advised, and better would have been 8.Nc3.",
        "8... O-O": "The best way to stymie White's strike at f7.\n",
        "9. Bxf7+": "(?!) In my early days I used to do this sort of thing myself, in order to unbalance the game.  It certainly does that, but in the exchange of White's B and N for Black's R and P, Black gets the better of the bargain in terms of the greater flexibility and mobility.  At Master and Expert level, this would be a mistake; at Grade level - perhaps 'dubious' is a better description.  Knowing how to make best use of these advantages is the trick, and in my view it is worthwhile, at some early stage in one's development, to try out this kind of exchange and discover for oneself the 'truth and consequences' of this decision.  ",
        "9... Rxf7": "Correct.  Black realises that although he loses a major piece (and a pawn as well), the two minor pieces are likely to be worth more.  It's certainly better that allowing White to get away with a pawn for nothing.",
        "10. Nxf7 Kxf7": "The King is not seriously discommoded by this move to f7.  If the need arises, he can always duck back to g8.",
        "11. d5": "With both his centre pawns attacked, White had little choice but to gain time this way to protect them both.  The drawback is that Black gets the e5 square for his knight.  Later Black finds a use for the c5-square as well.",
        "11... Ne5 12. Nc3 Bg4": "Already, it seems to me, the advantage of the minor pieces is apparent.  Look at Black's development!  He must already have been thinking in terms of a direct K-side attack.",
        "13. Qc2 Qe7": "Possibly heading for e5, which will be vacated by the Knight betimes.  Possibly 13...Qd7 came into consideration as well.",
        "14. Bg5": "Probably hoping to relieve the pressure by exchanges?",
        "14... h6": "(!) Fine!  It is often the case that the best time to play this sort of pawn advance is when you can a tempo by hitting a minor piece, with the prospect of an aggressive advance by the g-pawn subsequently.  This sort of thing isn't always good, but when it is, it is very strong.  Now if the Bishop retreats, Black has gained some momentum for a K-side attack.",
        "15. Bxf6": "(?!)  Had White tried to retreat, Black would have got a strong attack after 15.Be3 Nf3ch!!  16.gxf3 Bxf3  17.Rfc1 Ng4  18.Bxb6! (essential now, with ...Bxe3 threatened) 18...Qh4 (...Qe5 has the same idea in mind)  19.Kf1 Qxh2  20.Ke1 cxb6  21.Nd1 Re8! ",
        "15... gxf6": "Though the GK engine mislikes this move, there is a lot to be said for it in my view - in particular the g-file that is opened up for Black's lone rook.  But taking with the Queen would have given that piece a lot of options subsequently.  Gameknot suggests 15...Qxf6 (already threatening ...Nf3ch)  16.Ne2 Nf3ch! (anyway!  This move is very thematic in this game hereabouts)  17.gxf3 ... (17.Kh1 Qh4!) 17...Qxf3  18.Qc3 Qxe2.  At this point a clear bishop pair for a rook ahead, Black would have had much the better of the game.",
        "16. h3": "(??)  This is the first really bad mistake of the game.  So far White has been under some pressure as a consequence of his decision to go in for a R+P vs B+N game.  But this pawn push, weakening as it is, ought to have had a worse outcome than it did...",
        "16... Bh5": "(?) Understandably, Black thought he had to pull back the Bishop, after which White gets back onto level terms.  Instead 16...Nf3ch (that move again!) 16.gxf3 ... (No use to White is 16.Kh1 Qe5!) 16...Bxf3  17.Rfc1 ...(looking for a bolthole for the King)  17...Rg8ch  18.Kf1 Qe5 with all kinds of threats.  E.g. [A] 19.a3 (?; a 'nothing' move to demonstrate one idea) 19...Qh2! (19...Rg1ch is almost as good) 20.Ke1 Rg1ch  21.Kd2 Qxf2ch  22.Ne2 Qxe2ch  23.Kc3 Qe3  24.Kc3 Qe3ch with a winning attack; but  [B] 19.Ke1 Qd4  and Black's pieces are far too active for White to expect to live much longer.",
        "17. Kh1": "(!) At last getting his King into safety, and neutralising Black's Dark-square bishop.",
        "17... Nd7": "Regrouping.  Given the attack has been repulsed, pretty much, it shows commendably flexible thinking.  All the same, there was a lot to be said for 17...Rg8.",
        "18. Na4": "Black's Bishop having been a considerable nuisance on b6, White decides he would be better rid of the thing.",
        "18... Nc5": "Not a bad move.  He might have distracted White into exchanging on c5, whereat Black keeps his bishop pair; or else the knight wins for himself a useful outpost square.",
        "19. Nxb6": "Not to be deterred, decoyed or distracted.",
        "19... cxb6": "(!?) Interesting strategic decision.  Ordinarily one would expect Black to Capture 'towards the centre' - especially in view of the state of his pawns already.  But Black anticipates the c-file will be useful to him.  He is counting on his pieces to win the game.  In this he might have been over optimistic.  White is quite soundly placed, now.  Probably 20.f3 would have consolidated his pawns and left Black a very difficult task even to stay on level terms.  Instead, White tries something more aggressive, but also more loosening of his position.",
        "20. g4": "(?) If he didn't like 20.f3! he might have had a crack at 20.e5!? dxe5  21.Qh7ch Ke8 22.Qxh6 and White's counterplay (according to the GK engine) might well be good enough to draw.",
        "20... Bg6": "But now Black has a triple attack on e4, with a Bishop fork on the King and Queen threatened.",
        "21. f3": "Apparently stopping the threat...",
        "21... Qe8": "(?) Another regrouping in mind, but Black could have snaffled the e-pawn here, whose protection is less solid than it looks: 21...Nxe4!  White would not have dared take the Knight on account of 22.fxe4 Bxe4ch, winning White's Queen.  Nor would 22.Rfe1 have been any use as with 22...Ng3ch 23.Kg2 Bxc2  24.Rxe7ch Kxe7  25.Kxg3 Rc8  (26.Rc1 Bf5!) the extra piece should win for Black.",
        "22. Rae1": "Now e4 is sufficiently protected.  Also possible was 22.Rac1 with 23.b4 in mind.  If then 22...Nxe4  23.Qc7ch and White wins the Knight on e4.",
        "22... Rc8": "Reopening the threat ...Nxe4.",
        "23. Qb1": "Probably the best White has.  If, say, 23.Qd2, then 23...Nxe4 was possible, with the idea 24.fxe4 Bxe4ch  25.Kg1 Rc2 and now [A] 26.Rxe4 Qxe4; [B]  26.Qxh6  Rg2ch  27.Kh1 Rxg4ch!  28.Kh2 Rg2ch   29.Kh1 Re2ch!  30.Kg1 Qg8ch, game over.",
        "23... Qb5": "Unable to find a way through White's line of entrenchments, Black goes around.",
        "24. Rec1": "Pinning the Knight...",
        "24... Re8": "...Unpinning.  In so doing, once again Black threatens a breakthrough at e4.  White's position is under a great deal of pressure, especially upon the e4-point, and it is quite hard, having only heavy pieces available, for White to find the means to relieve the strain.",
        "25. Kg1": "Obviates the K-Q fork after ...Nxe4; fxe4 Bxe4ch.  It is hard to see that White had anything better available.",
        "25... Re7": "Arming himself against surprises along the second rank.  Circumspection - for good or ill - seems to be a feature of Black's play in this game.  However, attempted aggression by 25...Nxe4 (hoping for 26.fxe4 Bxe4  27.Qa1 Qd3) would have come unstuck by 26.Rc7ch or 27.Rc7ch.  By playing as he has, Black now threatens 25...Nxe4 for real once more.  ",
        "26. Rc3 Nd7": "Another redeployment, back to e5.  Black has directed a lot of his play very effectively about the central dark squares.  Though his tactics have been less than optimal, his positional feel looks pretty good to me.",
        "27. Rfc1": "Hoping the open file will yield something...",
        "27... Ne5 28. Rc3c7": "(??) Overlooking the lack of protection available for the pawn at f3.  This is the turning point of the game, as up to here White has been more or less holding his own.  With 28.Qc2 - trebling the pieces on the c-file - he might have found enough counter-play to cause Black to wonder how he was going to make any more progress.",
        "28... Nxf3+": "(!)  This is one of those situations in which there is more than one good move available.  The text is obvious, and obviously fine; but equally effective would have been 28...Qe2!",
        "29. Kf2 Nd2": "(!) ",
        "30. Rxe7+": "Superficially this looks OK, but maybe 30.Qc2 ought still to have been preferred, though after 30...Nxe4ch  31.Kg2 Qxd5 White runs out of play: 32.Rxe7ch Kxe7  33.Qxc7ch Kf8  34.Qc8ch Be8.",
        "30... Kxe7 31. Rc7+ Kd8 32. Qc1 Nxe4+": "Although White is threatening a quick counter-attack, Black coolly carries on his own scheme.",
        "33. Ke3": "Safer was 32.Kg1.  Black can make use of the White King's vulnerability on the central squares.",
        "33... Nc5": "Cutting off the communications between White's Q and R.  The latter has but one square available to it.",
        "34. Rg7": "Only move to save the rook...",
        "34... Qd3+": "0-1.  At this point, feeling that the situation had become hopeless, White resigned.  Now, from an objective point of view, Black did indeed have a winning game here.  It seems likely that Black has a forced mate after 35.Kf2, though it's not easy to find, given the wealth of possibilities, e.g. this 'sample' line: 35...Ne4ch  36.Ke1 Qg3ch  37.Ke2 Qf2ch  38.Kd3 Nc5ch  39.Kc3 Qf3ch  40.Kd2 Qf4ch  41.Kd1 Qf1ch  42.Kd2 Ne4ch  43.Kc2 Qe2ch  and now [A] 44.Kb1 Nd2ch  45.Ka1 Nb3ch  46.axb3 Qa6#; or [B] 44.Kb3 Qd3ch  45.Ka4 Nc5ch and White has to give up his Queen to avert mate.  More clear cut, perhaps, is 35.Kf4, but Black has to find 35...Qe2!  36.Rg8ch (the only move to save mate) 36...Be8  37.Qe3 ... (a counter-threat!) 37...Nd3ch  38.Ke4 Nf2ch  39.Kd4 Qxb2ch and now White exchanges Queens: 40.Qc3 Qxc3  41.Kxc3 Nxh3 and White's chances have almost disappeared.  Having looked at all this, it has to be said that it would have been Black's task to find the winning lines, and in my view, White would have had every right to test Black's technique.  Here's a good rule: NEVER TRUST YOUR OPPONENT.  Never trust him to make a bad move; but never trust him to make a good one, either.  Note that 'trust' does not mean 'assume'."
    },
    "url": "https://gameknot.com/annotation.pl/truth-and-consequences?gm=47473",
    "gameName": "Truth and Consequences.",
    "players": "johnsmith95 (1244) vs. simonv45 (1460)",
    "opening": "Giuoco piano (C55), Rosentreter variation"
}