{
    "moves": {
        "1. e4 g6 2. d4 Bg7 3. Nc3 d6 4. Be3 Nf6 5. Nf3": "Nothing out of the ordinary so far - Black goes for a more hypermodern approach, perhaps looking to counter-attack; all his moves are standard with the d6 push providing a hole for the f6 knight should White advance his pawns. At these early stages White can't yet make anything of the extra space that he's been allowed to have\n",
        "5... O-O 6. h3": "Preventing Bg4 or Ng4; a solid move\n",
        "6... b6": "Unusual; a double fianchetto isn't seen too often but there is logic in that Black doesn't see a future for his light-squared bishop on the c8-h3 diagonal. A bishop on b7 targets e4; a bishop on d7 targets nothing!\n",
        "7. Bc4": "Innocent bishop development...or is it?\n",
        "7... Bb7": "?! Black had this planned but failed to realise White's plan! A better move (to prevent White's next) would have been Nfd7 from my point of view, also perhaps in preparation for either c5 or e5 to challenge White's centre.\n",
        "8. e5": "White thrusts forward, forcing the black knight to move. Thanks to White's 'quiet' move back at move 6 the g4 square is out of the question leaving only two possibilities.\n",
        "8... Ne8": "Looks ugly, yes, but this is the only place Black's knight can move since Nfd7 is now met...\n",
        "9. e6": "! with this move! Should Black take that pawn the bishop takes up a commanding square but with the threat of exf7+ it can hardly be ignored! \n",
        "9... f6": "from Black's point of view a pawn there isn't too much better! \n",
        "10. d5": "Obvious - and now what can Black do? There is a severe cramp in the mobility of his pieces and if he wants anything from this game it has to be addressed!\n",
        "10... c6": "Probably the best move for Black, attempting to undermine White's d5 support\n",
        "11. h4": "Meanwhile - whilst Black focusses on removing the cramp in his position - White looks to attack the Black king. Once again this move proves to be significant later on though it won't have been something White had forseen\n",
        "11... b5": "?! Black will want to stop that pawn in its tracks (if the h-file is even half-open White will have a great big bulls-eye to target!) but first he lashes out at the bishop - though following White's reply was it the best move? To maintain the defence of d5 the bishop will go to b3 but first...\n",
        "12. dxc6": "...this little intermediate move! 12...bxc4?? will lose the rook so Black has to recapture\n",
        "12... Bxc6": "It was either this or the knight recapture and either way the b5 pawn can be taken but though Nc6 makes more sense development-wise 13.Bxb5 Bxb5 14.Nxb5 Qa5+ 15.Nc3 h5 and Black has more activity queenside at least as well as the e6 pawn suddenly becoming vulnerable\n",
        "13. Bb3": "White doesn't bite, preferring to hold on to e6.\n",
        "13... h5": "preventing the advance of the h-pawn\n",
        "14. Qd2": "Of course White's focus is still kingside - a possible Bh6 is on the cards\n",
        "14... Nc7": "Developing and targeting e6 - Black doesn't have too many options but this is probably the best move he can do. Bxf3?! isn't such a good idea considering it half-opens the b-file to his king and his undefended g-pawn\n",
        "15. Rh3": "Still, White plans to target it anyway with this move not usually seen at Master level\n",
        "15... a5": "Still showing activity on the only side he can Black still goes for the only target he has - the threat is 16...a4 17.Bd5 Bxd5 18.Nxd5 Nxe6\n",
        "16. a4": "The natural defence and though White doesn't threaten material gain Black decides to take immediate action (there might be something threatened here but I don't see it)\n",
        "16... bxa4": "It was either this or b4; in hindsight of what happens next it's easy to say that b4 was better but it more or less forces the White knight to switch its attention to kingside and that vulnerable g6 pawn; Ne2, Nf4, c3, Bc2, Rg3, Qd3....with potentially four pieces available to target it it certainly doesn't look like it'll survive! Of course Black does have another defence which will be looked at later...\n",
        "17. Nxa4": "From White's point of view the only recapture considering the defence of e6. 'A knight on the rim is dim'...\n",
        "17... Nba6": "...but unlike this knight White's knight has a future - but where else was Black's b8 knight going to go?\n",
        "18. Nb6": "! Not only is this a powerful square for the knight there is no good way to dislodge it; White has control over queenside now as well as kingside!\n",
        "18... Rb8 19. Rxa5": "White's last piece comes into the action and comparing the two positions a Black resignation wouldn't be too much of a surprise!\n",
        "19... Kh8": "Black plays on with a move that seems to achieve nothing - but as had been the common theme for him this game what could he do? The only active move that Black can make is Nc5 which (would be met with Qc3 from White. Some variations after 19...Nc5 20.Qc3; [1]20...Rxb6 21.Bxc5 dxc5 22.Qxc5 and the bishop will be won; the queen simply moves to c4 to avoid the g7 bishop if f5 is played. [2] 20...N7xe6 21.Bxe6+ Nxe6 22.Qxc6 - again, piece won! Note that with Black's move the bishop will not check the king at move 21 but even then the hanging knight can't move without letting the bishop go as well! [3] 20...Nxb3 21.cxb3 followed by 22.Qc4 (or perhaps the more aggressive Qd3) keeps the piece but also White's advantage. If I've missed anything by the way let me know!\n",
        "20. Qd3": "In short Black has no good plan - unlike White! g6 is attacked and Black only sees one way to defend it...\n",
        "20... f5 21. Ng5": "...which allows this nice little outpost for the knight! The threat is Qf7+ which will allow White a protected pawn on f7 after Rxf7.\n",
        "21... Qe8": "Fork avoided...\n",
        "22. Nf7+": "...but it's still a great post for the knight!\n",
        "22... Kg8": "Kh7 may have been better here in that it keeps g6 defended...\n",
        "23. Rg3": "...as it can still be targeted! At this moment the only way that Black can defend himself is Kh7\n",
        "23... Be4": "Black thinks he is playing an intermediate move here (zwischenzug if that's the right spelling, probably isn't) to chase away the queen before he addresses the threat on g6. The move itself seems strange as it allows White to play Nd7 after the g-pawn is defended but it turns out that was the least of Black's worries...\n",
        "24. Rxg6": "!! It's been something White has been threatening for a long time now and he finally launches his attack in spectacular fashion, smashing through Black's crumbling wall at the expense of his queen.\n",
        "24... Bxd3": "I do love a good queen sacrifice!\n",
        "25. Bd4": "! The point of White's last move; the bishop is pinned and the threat is Rxg7#. Also possible is Bh6 but this square will be more active for the bishop when the following exchanges have passed.\n",
        "25... Nxe6": "To protect the bishop Black needs to give up his knight...\n",
        "26. Bxe6 Rxf7": "...and his rook...\n",
        "27. Rxg7+": "Right move; White still needed to be careful as Bxf7+?? would have stopped the attack in its tracks; this is the power of the two bishops!\n",
        "27... Kf8": "27...Kh8 28.Rxf7+ Kg8 29.Rxe7+ Kf8 30.Rxe8+ Rxe8 31.cxd3 is no better than what happens here\n",
        "28. Nd7+": "Not to be forgotten the knight delivers the final blow - there is only one move Black can make!\n",
        "28... Qxd7 29. Rxf7+": "!\n",
        "29... Ke8 30. Bxd7+ Kxf7 31. cxd3": "The result of white's total space dominance; a piece and pawn up, the Black army in tatters and - when the knight is saved - in with winning at least two more pawns straight away. Black resigned at this point - hope you enjoyed the game as much as I did and comments are very much welcome! :-)\n"
    },
    "url": "https://gameknot.com/annotation.pl/turning-space-into-a-win?gm=50563",
    "gameName": "Turning space into a win",
    "players": "Frank Roeder (2255) vs. Wolfgang Zbikowski (?)",
    "opening": "Robatsch (modern) defence (B06)"
}