{
    "moves": {
        "1. e4": "My opponent started with e4. This is my only opening if I play white.",
        "1... e5": "My usual response to e4. I don't know much about opening and and still trying to learn the basics.",
        "2. Nf3 Nc6 3. Bc4 Nf6 4. d3 Bc5": "So far, both sides have developed King side and prepared to castle.",
        "5. Bg5": "Pinning my knight and developed his bishop.",
        "5... d6": "Supporting my pawn on e5 and preparing my LSB to get into action.",
        "6. h3": "I've encountered this move so many times after this game and started to think that this is a very good move as it preventing my bishop or my knight on g4. But i don't usually play this move.",
        "6... O-O 7. O-O Nd4": "Both sides castled and the objective of Nd4 is after Nxd4, I recaptured his knight with my bishop and attacking the unprotected b2.",
        "8. Nxd4": "Here, I took a long time thinking about Bxd4. I was thinking after c3, my bishop will have to go back to c5 and I'm considering exd4. Of course exd4 is not a good move as it will block my attack on the f2 and my DSB will trap on the other half of the board from his king.",
        "8... exd4": "But i played it anyway thinking that I will have time to bring my DSB soon to the king side. I really should've played Bxe4.",
        "9. Qf3": "When he played this move, I know that he is planning to exchange queen.",
        "9... h6": "So, why wait?",
        "10. Bxf6 Qxf6 11. Qxf6 gxf6": "Now, my king is exposed and I have double f-pawns while his bishop attacking the f7.",
        "12. Nd2": "Developing his knight.",
        "12... Kh8": "Planning to bring my rook to the open g-file and allign it with his king.",
        "13. Nf3 Rg8": "Now my f7 pawn is hanging and after Bxf7, my rook on g8 will be under attack. But he saw the threat Bxh3.",
        "14. g4": "g4? Maybe Bxg7 is better?",
        "14... h5": "Attacking the pawn and trying to open a way to his king.",
        "15. Bxf7": "Finally, he took the pawn. Now my pawn structure is a mess and my DSB is still trapped on the other side. I want to play Rg7 but I saw the threat Bxh5 will completely destroy my plan. So, I decided to play more aggresive.",
        "15... Bxg4": "Sac my rook and threatening his knight.",
        "16. Bxg8": "He took the rook. Computer analysis showed that this is a blunder and suggested white to play hxg4. And computer analysis also suggested that I play Bxf3. But I was thinking, if I played that move, his bishop can retreat and guarded the g8 square. I want to bring my rook to g8. So, I decided to play another move.",
        "16... Bxh3": "Blunder, as per computer analysis. My plan here is threatening his rook and after he move his rook, I will take his bishop with my rook and controlling the g-file.",
        "17. Rfd1 Rxg8+": "Now, the battle of two rooks vs two bishops begins.",
        "18. Kh2 Bg4": "Attacking his knight and aiming for his rook on d1.",
        "19. Kg3": "Protecting his knight. My DSB has been trapped for quite some time and I'm planning to bring it to the battlefield.",
        "19... f5 20. exf5 Bxf5+ 21. Kh4 d5 22. Rdg1": "Kxh5 will lose a knight. Proposed to trade my last rook.",
        "22... Bg4": "Be7+ will come to the same result.",
        "23. Ng5 Be7 24. f4 Kg7": "His passed pawn on f4 is unprotected. I think it's time for my king to join the battle.",
        "25. Rae1 Bf6": "Attacking my bishop and I just move it away, still keeping the pin on his knight.",
        "26. c3": "Starting from this move and the next 5 moves, computer suggested white to play Rxg4 but he didn't. White could have a good game if he made that move, I think.",
        "26... dxc3 27. bxc3 Kh6": "I have time to play dxc3 before moving my king. ",
        "28. d4": "Maybe to protect his c3 pawn which I have no intention to play. I still don't want to give up my pin on his knight. When I saw this position, I saw potential mate. If I can bring my rook to h3, I'll win. So, that is my next target.",
        "28... Rd8": "E-file is protected by his rook. The only way is through the d-file.",
        "29. Rg3": "Rg3?? That is the only square his king can move. Playing his rook there was not a very good move. Now, I have another mate option. If I remove his unprotected pawn on f4, Bxg5 is mate. I can still play my rook on h2 which also lead to mate.",
        "29... c5": "Pawn sac to open the d-file.",
        "30. dxc5 d4 31. cxd4 Rxd4": "Attacking his unprotected f-pawn.",
        "32. Re8": "Re8??",
        "32... Rxf4": "Threatening mate.",
        "33. Rxg4": "Finally, he made this move but it's a little too late. My rook already on f4. This move also came with a message from him said \"You got me.. :)\". It also ended the battle of two rooks vs two bishops.",
        "33... Rxg4+ 34. Kh3 Bxg5": "Grabbing everything I could..",
        "35. Rh8+ Kg6": "My king laughed all the way to g6.",
        "36. Rb8 Be3": "The only logical move, I think.",
        "37. Rxb7 Bxc5 38. Rc7 Bb6": "Now my bishop and my a-pawn is untouchable.",
        "39. Rd7 Rd4": "Offering a trade.",
        "40. Re7": "Declined. Ouch..",
        "40... Rd3+ 41. Kg2 Rd2+ 42. Kf3 Rxa2": "Eliminating his last chance of queening.",
        "43. Re1 h4": "A diversion. My plan is to queen the a-pawn.",
        "44. Kg4 Ra4+ 45. Kh3 Kh5 46. Re5+ Kg6 47. Rb5 Rd4 48. Rb3 Re4 49. Rd3": "Blunder!! I've waited for this move for so long.",
        "49... Re3+ 50. Rxe3": "He has to take it.",
        "50... Bxe3 51. Kxh4 a5": "And he resigned. Comments, please.. :)"
    },
    "url": "https://gameknot.com/annotation.pl/two-rooks-vs-two-bishops?gm=43930",
    "gameName": "Two Rooks vs Two Bishops",
    "players": "icebergslimjimjo (1274) vs. komengrage (1345)",
    "opening": "Two knights defence (Modern bishop's opening) (C55)"
}