{
    "moves": {
        "1. e4": "This is a though game I played recently. I started with the common and solid e4...",
        "1... e5": "This reply leads to open games.",
        "2. Nf3": "C40 King Knight Opening. It leads to a great number of openings, such as the Scotch, The Ruy Lopez, the Giuco Piano, Philidor and so on.",
        "2... Nc6 3. Bc4": "This is the Italian Game. It's a boring position, so I played...",
        "3... Nf6": "!? The Two Knights Defense, considered nowadays risky, because White can launch a serious offensive with the Fried Liver Attack wich begins with  4. Ng5. White has an incredible pressure in the f7 square.",
        "4. Bd5": "?! A strange and dubious move, because Black can now equalise and make White lose tempi.",
        "4... Nb4": "I broke all the opening principles with this move. I intended to crush White's center, by adding pressure in the d5 central square.",
        "5. c3 Nbxd5 6. exd5 Nxd5 7. Nxe5 d6": "White loses a tempo.",
        "8. Nf3": "The position is equal at this point, but I could have played better in the opening.",
        "8... Be7": "Black prepares castling and develops one piece.",
        "9. c4": "?? Better would have been d4! .",
        "9... Nf4 10. O-O O-O 11. d4": "White bilds up an impressive center. At this point, Black's position is somewhat cramped. Notice that moving my Knight is a must, because of the discovered attack.",
        "11... Ng6 12. d5 Bg4": "Black pins the White knight and develops his last piece. White is behind in development, and Black has a solid position.",
        "13. b3": "White has now an impressive pawn chain and more space at the Queenside. But his position has weakened, and I reply...",
        "13... Bf6": "! The Rook can't be saved.",
        "14. Bg5": "White sacrifices a Bishop to defend his Rook.",
        "14... Bxg5 15. Qd4": "? this looks like a bad move, because the natural reply is the skewer.",
        "15... Bf6": "! The skewer is effective. White has only one move to try to compensate his loss, which is...",
        "16. Qxg4 Bxa1": "At this point, White is a rook down, and his only compensation is more queenside espace, wich isn't useful in this position.",
        "17. Qh5": "White tries to weaken my rock and to lauch an offensive in the Kingside.",
        "17... Bf6": "The Bishop is redeployed to defend my Kingside.",
        "18. Re1": "? Black can't gain control of this open column, because Black replies...",
        "18... Re8": "Re8! White must now retreat and lose one tempo and the open column, or exchange pieces and lose the open column. Exchanging pieces is not an option because Black has the material advantage. So White choses to...",
        "19. Rf1": "...retreat his piece, losing two tempi.",
        "19... c5": "With the next moves, I tried to cause a pawn break in the Queenside, to gain space and to develop my extra Rook. GM Yasser Seirawan recommends to finish developping the pieces when in material advantage, in order to succesfully attack.",
        "20. g3": "White declines to lose space in the Queenside. However...",
        "20... a6": "I insist on the pawn break.",
        "21. Kg2": "? White could have develloped his Knight on the Queenside. Instead, he makes his King vulnerable and puts it inta a weak square.",
        "21... b5": "The pawn attack continues.",
        "22. Nbd2": "A late and unuseful development.",
        "22... bxc4 23. Nxc4 Re4": "At this point, I saw a great tactic that could win the game. I noticed that I could do a Royal Fork and win a Queen, but I had to take out the g-pawn. And so...",
        "24. h4": "?? White's pawn structure is better than mine, but his Rock is seriously compromised, as I play...",
        "24... Bxh4": "!! And then I start the tactic. I hoped White would respond Nxh4, and then I would have replied Rxh4, leaving the Queen whit nowhere to run and forcing the g-pawn to capture my rook.",
        "25. gxh4": "White foolishly falls into my deadly trap.",
        "25... Nf4+": "The Royal Fork succeeds! I can't believe my oponent fell for that one. This combination gave me loads of hapiness.",
        "26. Kg3 Nxh5+": "White resigns, having lost his Queen and being down in twelve points. I was happy with this win because my opponent didn't even see it coming. I'd like to thank GM Yasser Seirawan to teach me how to do things like this one in his book \"Winning Chess Tactics\". If you can, just get it, it's a great book."
    },
    "url": "https://gameknot.com/annotation.pl/two-knights-defense-a-great-weapon-for-black?gm=6457",
    "gameName": "Two Knights Defense - A great weapon for Black",
    "players": "baghwan24 (1200) vs. afonsoz (1232)",
    "opening": "Two knights defence (C55)"
}