{
    "moves": {
        "1. d4": "Hi everyone!\n\nSo, you have all enjoyed my near-miss victory against Pitroque (Charles)!  So, by the grace of God I kept my Class A rating.  Happily and slightly more convincingly, I found myself taking another two steps on the Yellow Brick Road towards the Kingdom of Expertdom.  We ended up in the endgame mentioned above where I had the pieces and Andy had the rook.  So, how did this all happen?  Well, read on .......",
        "1... d5 2. e3": "2. e3      - I usually open with e4 so this is a thematic mini-tournament based on the Stonewall System.  This MT arose from two unrated games between Brigadecommander (Janet) and Stalhandske (Torsten).  Well, here is the start of the stonewalling.",
        "2... Nf6 3. Bd3 e6 4. Nd2 c5 5. c3 Nc6 6. f4": "6. f4 - after some rapid piece development on both sides, this move sets up the Stonewall.  It is very hard for either side to get a result, but sometimes these breakthroughs do happen!",
        "6... Bd6 7. Ngf3 O-O 8. Ne5": "8. Ne5 - this is the usual spot for a knight in this tournament.  It puts a bit of a crimp on black's position.",
        "8... cxd4 9. exd4 Bxe5 10. fxe5 Ne4": "10. ....... Ne4? - after a white pawn replaces a white knight on e5, black advances his knight onto my fifth rank.  However, this loses a pawn.",
        "11. Bxe4 dxe4 12. Nxe4 Qh4+": "12. ...... Qh4+ - sssss, in comes the Wicked Witch of the West.  It looks as if black will get a piece for a pawn, but .......",
        "13. Ng3": "13. Ng3  - ....... deals with both issues.",
        "13... b5 14. O-O": "14. 0-0 - now is the time to tuck Henry away.  I know the Witch is there to greet him, but it will be a while before she can be joined by her colleagues.  In the meantime, consolidation is the key here!",
        "14... Ba6": "14. ...... Ba6 - threatening a discovered attack on my rook.  I spoil the show by advancing my b pawn to its fourth rank.",
        "15. b4 Bb7 16. Qh5 Qxh5 17. Nxh5": "17. Nxh5 - queen trade.  Good idea methinks when up on material.",
        "17... a5 18. Ba3": "18. Ba3 - a far sighted plan to prevent Andy's knight moving in to c4.",
        "18... a4 19. Nf4": "19. Nf4 - I decided to increase the scope of my knight.",
        "19... Ne7 20. Bc1 Rac8 21. Bd2": "21. Bd2 - now for Fou Lenoir.  I feel there is more future for this prelate on this square than on a3 or b2.",
        "21... f6": "21. ..... f6? - loses another pawn.",
        "22. Nxe6": "22. Nxe6 - like this!",
        "22... Rf7 23. Nc5": "23. Nc5 - this knight remains on this square for the rest of the game.",
        "23... Bd5 24. exf6 Rxf6 25. Rxf6 gxf6": "25. ..... gxf6 - after this plethora of exchanges, black's kingside pawns have been separated.  But where do I go from here?  A further bit of consolidation to my  queenside pawns is needed - i.e. I need to get my a pawn away from Andy's lsb before I can get my rook into play.",
        "26. a3 Ng6 27. Re1": "27. Re1 - I manage to improve the scope of my rook but it does allow a counter-attack from Andy as follows.",
        "27... Nh4 28. Re2": "28. Re2  - not g3?? as this allows Nf3+.",
        "28... Rc7 29. Bf4 Rg7 30. Bg3": "30. Bg3 - Fou Lenoir defends my g2 pawn by blocking that rook's line.  My rook now gets traded in for Andy's two pieces and the g2 pawn.  This will result in me having two pieces and a pawn against a rook.  Although it depends on the position and Coach Ion managed a victory with the rook, more times than not the two pieces are better.",
        "30... Nxg2 31. Rxg2 Bxg2 32. Kxg2 h5 33. Kf2": "33. Kf2 - Henry moves towards the centre now that Andy only has his rook for me to contend with.",
        "33... Rg4 34. Kf3 f5 35. h3": "35. h3 - the rook is to be driven back.",
        "35... Rg6 36. d5": "36. d5 - I now take a look at the board and I notice that all the squares up to d7 are covered by pieces.  I think I will exert a little pressure on Andy by moving my pawn up to d7.",
        "36... Kf7 37. d6 Ke8 38. d7+": "38. d7+ - I now realise that if the BK blocks my d7 pawn, Fou Lenoir will kick him out of d8 with a check on h4.  This spells Glendadoom for Andy's king.",
        "38... Kd8 39. Bh4+ Kc7 40. d8=Q+": "40. d8/Q+ - A huge fanfare of trumpets greet the resurrection of Glenda in all her splendour.  King Andy is not long for this world in this game.",
        "40... Kc6 41. Qd7+": "41. Qd7+ - I now set up the conditionals as it is # on the next turn.  Notice, in the final position, Fou Lenoir could also deliver mate on d8, but, the way I feel at the moment, I just want Glenda to be putting her stamp on proceedings as she is not called Glenda the Defender for nothing.  I may have a few more annotations in the pipeline but for now, watch this space ......",
        "41... Kb6 42. Qb7#": ""
    },
    "url": "https://gameknot.com/annotation.pl/two-pieces-and-a-pawn-v-1-rook?gm=52373",
    "gameName": "Two Pieces and a Pawn v 1 Rook",
    "players": "jstevens1 (1833) vs. andymars (1480)",
    "opening": "Queen's pawn (D00), stonewall attack"
}