{
    "moves": {
        "1. d4": "1. d4 - the other \"Best by test\" - just ask Bennett!",
        "1... d5": "COPY CAT.  Not a bad idea to copy though - both sides have one Bishop that can look out onto the chess board and each side has planted a flag on Mt. Everest.  Ok - so I am exaggerating about the whole Mt. Everest flag planting thing - both players are actually controlling part of the center because they have each placed a pawn there.  Which is always a good think! ",
        "2. c4": "QUEEN'S GAMBIT anyone?",
        "2... dxc4": "\"Sure... How about the Queen's Gambit Accepted!\" - this is essentially what Sigmund Reppen has replied back to me as signaled by his chess moves.",
        "3. Nf3": "DEVELOP YOUR TEAM!",
        "3... Nf6": "DHITTO - like to the max!",
        "4. e3": "This allows my Bishop to look at the pawn on c4.  I really, REALLY want to capture that pawn with my Bishop!",
        "4... e6": "Controlling the d5 square.  The is a \"LIGHT SQUARED STRATEGY OPENING\".  We will shall talk more about that some other day though.",
        "5. Bxc4": "\"Crunch...crunch...munch...chomp...  Yum.\" says my Bishop who really enjoyed eating that pawn!",
        "5... a6": "This pawn is getting ready to help it's brother/sister to attack my Bishop on c4.  Penguins Attack!",
        "6. O-O": "KING SAFETY!  Ok there are three things we want to do in the opening:\n1. Control the entire center - or at least our fair share of it.\n2. Develop our team.\n3. King Safety.\nI can safely check off items one and three off of my list now because as the White player I have a pawn on the d4 square and I have castled my King over onto the King's side of the board.  I am still working on number two though.  I have yet to move the Bishop on c1, the Knight on b1 and my Queen on d1.  I will have safely gotten out of the opening and into the middle-game once I have played those pieces out onto the board.\nNotice that my opponent's King is still stuck in the center and that he has to catch up in getting his team out onto the board.  That is the trick when you are playing the black pieces because you move second.",
        "6... b5": "Penguins - ATTACK!  The question being asked by this rather rude Penguin is \"MOVE IT OR LOSE IT BISHOP?\".  I think I had better move it!",
        "7. Bd3": "...to that square!",
        "7... c5": "Now my opponent is trying to chip away at my control over the center.  Sigmund once ALL of the center square to himself - how greedy!",
        "8. dxc5": "Take you very much! ",
        "8... Bxc5": "Take you back very much!  Remember whenever your opponent captures one of your Pieces or pawns you want to be able to recapture back.  If you cannot capture back then you will lose on points in the endgame. ",
        "9. Qe2": "Making way for my Rook on f1 to go stand on the d1 square.  I am hoping to win my opponent's Queen in a line like 9. Qe2 0-0 10. Rd1 Bb7?? 11. Bxh7 CHECK!  Now I will get a Queen and a pawn for my Bishop and Rook - quite a deal actually.  That is 10 points that I will have won for an investment of only 8 points - a real bargain! ",
        "9... O-O": "I am liking that move!",
        "10. e4": "First I expand my control over the center.",
        "10... Bb7 11. a4": "Time to weaken his Queen-side but the flip side of this move is that I am unable to take that move back.  Once the pawns move forward they can never go back - so I have created some weaknesses too!",
        "11... b4": "I like the idea of Knight on b1 going to d2 and then later on - if he is needed there - to go to either the squares b3 or c4.  This is why I actually did not play this piece out - that is develop him earlier.  I was waiting to see what kind of weak squares and pawns that my opponent would give me, and then and only then will I play my Knight out onto the board.",
        "12. Nbd2 a5": "Sigmund's pawns on a5 and b4 prevent his own Bishop from standing on those squares.  This can be a useful tool for determining whether or not we want to play our pawns to certain squares or not - what will this do to the team of Pieces that I have?  ",
        "13. e5": "Karate - CHOP!  I just cut the board in half - one half has Sigmund's King on it and the other has a bunch of his pieces who are standing around in a huddle and are confused.",
        "13... Nfd7": "Played with the idea of protecting the Bishop on the c5-square.  However where is his other Knight going to go now?",
        "14. Ne4": "Notice how I have two Bishops, two Knights and a Queen looking over at my opponent's King-side.  I should already be thinking about attack!\nA.) An isolated King.\nB.) Several of my pieces pointed at that King!\nC.) I have more space on the board than my opponent does.\nD.) Sigmund's minor pieces (Knights and Bishops) are clumsily placed as they are practically tripping over each other.  No ballet here!",
        "14... h6": "Sigmund's spider sense is tingling now!  He suspects my plan...",
        "15. Rd1": "Now it is time to switch back to the \"obvious\" moves that I could have played much earlier.  I didn't play this move earlier because I did not want Sigmund to put his queen on a better square in trying to avoid my Discovered Attack.  Now that I have a pin to play for - why not!  Also I am trying to create MULTIPLE (many) threats - so as to put my opponent off balance.  ",
        "15... Qb6": "Sigmund immediately breaks the pin - a very good idea.  Now his Queen takes up residence - along with it's dark squared Bishop teammate - on a dangerous diagonal which leads to my King!\nSigmund has accomplished the following in the opening of this game - up to this point in the game:\n1. Started to develop his team - but like me he still has a player in the way of his Rooks.\n2. Still controls part of the center.\n3. Has castled which usually gets our King immediately to a safe place on the board.  Unfortunately for Sigmund I am aiming most of my army at the side of the board that he has chosen to castle to. \n\nPlease also notice that Sigmund has FEWER SQUARES UPON WHICH TO PLACE HIS PIECES - while I have much more space on the board.",
        "16. Bf4": "Protecting the pawn on e5.  Also being sneaky in that I have connected - or linked - my Rooks and that I am still AIMING MY BISHOP OVER AT THE h6 PAWN.  I must be up to something!",
        "16... Rd8": "This move does not help in getting both of Sigmund's Black Rooks linked up.  He is trying to protect the Knight on d7 that may be attacked by my Rook on the d-file should he end up moving the other Knight on b8.",
        "17. Rac1": "One more prep move.  I want to have all of my pieces working - that is to say that I want ALL OF MY PIECES to be ready for the fight.",
        "17... Bd5": "That is one move with the same piece too many for me!  I cannot contain my desire to attack any longer... must look at the line... before I make a move... must control the cobra hand... must....",
        "18. Nfg5": "ATTACK!\nThis Knight is really thinking about removing the few defenders that yet remain around the Black King - HIS PAWNS.  I am saying to the pawn - WOULD YOU LIKE TO HAVE ONE OF MY KNIGHTS?  IT IS FREE - I DARE YOU TO TAKE IT!\n\nI can do this because Sigmund has the following problems with his army:\n1.) His pieces have less space\n2.) He is playing a Rook down - the one on a8 is not doing anything.\n3.) His Knights are passively looking at each other - how vain!\n4.) His King is only protected by a few pawns.\n5.) I have five pieces that are aimed at and that can attack his King - while he doesn't have any pieces with which to defend.  ",
        "18... hxg5": "\"Thank you Coach Sean... it's my birthday today!\".\n\n",
        "19. Nxg5": "You are welcome - Checkmate you very much!",
        "19... Bxf2+": "A big moment in the game!  I have the following three options whenever my King is in check:\nI.) Capture the piece\nII.) Block the check (Not an option against Knights.)\nIII.) Runaway.\nSo here is a list of possible moves that I could play in this position:\n1.) 20. Qxf2\n2.) 20. Kf1\n3.) 20. Kh1\nSo I have three options.  Let us look at the first of these... \n\n1.) What is wrong with the line 20. Qxf2 Qxf2 + 21. Kxf2 Bb3! And now I am losing the pawn on a4 and the endgame - OR - I am \"just\" losing the exchange - My Rook (5 points) for his Bishop (3 points).  I also no longer have an attack - or my Queen with which to attack with.  SO I AM NOT INTERESTED IN THIS OPTION - Thank you very much!\n2.) 20. Kf1 brings my King towards the center of the board where it will be easier for my opponent to attack him.  I only want to centralize my King in the endgame when there are fewer pieces and pawns standing upon the board - we are in a heavily populated middle-game position right now and the middle of the board is the last place that my King wants to be.  I would also be standing on the square that one of my Rooks might like to stand upon - the f3-square.  WAIT A MINUTE!\n3.) 20. Kh1 Gets my King out of Check, allows him to find some measure of safety and gives my d1 Rook the f1 square.  Once my Rook gets to that square it will be able to attack down the semi-open f-file.  BRILLIANT - I like that plan!",
        "20. Kh1": "Side stepping the check!",
        "20... g6": "Putting up a sign that says - at lest to members of my army - \"CLOSED FOR BUSINESS\".  My pieces don't believe that for a second!",
        "21. Rdf1": "Now just give me that f-file...",
        "21... Bd4": "The Bishop was attacked twice and defended once so it was time to remove him from the f2 square.  ALWAYS REMEMBER TO COUNT HOW MANY TIMES MEMBERS OF YOUR AND YOUR OPPONENT'S ARMY/SPORT'S TEAM LOOK AT A SQUARE - that is before you play one of your pieces to that square.  If you both look at whatever important square that you are both \"arguing about\" - and here it was the f2 square with the Black Bishop upon it - the same number of times then who-ever steps upon it first will lose a piece or pawn.  If one of you looks at the important square more than your opponent - then you can own that square - maybe even step on it.\nIn this game I added a second attacker to the f2 square - my Rook - and so I was now looking at that square twice.  Sigmund was only looking at the f2 square once - with his Queen.  We never count the pieces or pawns that stand upon such important squares as these pieces and pawns never look at their own feet.  So in this game I got to own the f2 square which - once the Bishop was saved by being yanked away by it's Queen - gave me the f-file down which to attack with my Rooks. ",
        "22. Nxf7": "DEMOLITION TIME!",
        "22... Kxf7 23. Bxg6+": "DEMOLITION TIME - TWO!",
        "23... Kxg6": "I have pulled my opponent's King out into the open and please notice just how alone he really is.  We can even take away more of his pieces - because they aren't defending their King anyways.",
        "24. Qg4+": "Check you very much!",
        "24... Kh7": "RUN-AWAY!  One of the King's three options when he is in check.  Do you remember the other two?",
        "25. Qh5+": "CHECK-A-DOODLE-DO!",
        "25... Kg8": "RUNAWAY.",
        "26. Bh6": "Now my opponent's King is in a BOX!  I am threatening a checkmate in two - but now Sigmund tries to give back more material in order to open up diagonals that lead to my King - all for the sake of trying to set up a defense against my attack.  Unfortunately for Sigmund he also opens up another road for my pieces to travel down in order to get at his King.",
        "26... Bxg2+": "Check!",
        "27. Kxg2": "ONLY MOVE!  I must capture.",
        "27... Qb7+": "Check!  What is wrong with this plan?  What important line has opened up for one of my three line (or laser beam) pieces?  It is true that the Black Queen will be able to defend the g7-square after Sigmund's Knight on d7 moves but what did he overlook?",
        "28. Kh3": "Un-check and give me the g-file!",
        "28... Nxe5": "The nervous Black King is looking around and asking - to no one in particular - is it safe yet?  So do you know what line it is that Sigmund has given to me?  WHAT IS MY NEXT MOVE GOING TO BE?",
        "29. Rfg1+": "But of course! : P\nI only need three of the four pieces left for the checkmate.  Here - have my Rook!\nSigmund resigned because of a line like the following:\n29. Rg1+ Bxg1 30. Rxg1+ (The other one - a very good example of why we want our Rooks to be looking at each other!) 30. ...Kh8 31. Bg7+ Kg8 32. Bxe5 + (Discovered Check!) 32. ...Kf8 33. Qh8+ Ke7 34. Rg7 + + ! CHECK AND MATE!  A rather fun attacking game of chess - wouldn't you agree?  Perhaps not a perfect game but still an enjoyable one to play through."
    },
    "url": "https://gameknot.com/annotation.pl/type-corr?gm=29409",
    "gameName": "Type \"corr\"",
    "players": "Tobin, Sean  vs. Reppen, Sigmund ",
    "opening": "QGA (D26), classical variation"
}