{
    "moves": {
        "1. e4 h6": "La défense Miles.",
        "2. d4 a6": "Les blancs occupent le centre, les noirs avançant les pions tours pour détruire les pions du futur roque blanc. ",
        "3. c4 d6": "Les blancs préparent une attaque, 3... d6 contre les trois pions. Les coups 4. c5 ? ou 4. e5 ? ne fonctionnaient pas, car après 4... dxc5 5. dxc5 Dxd1 ! 6. Rxd1 et les blancs ne peuvent plus roquer.",
        "4. d5 b6": "Une précaution envers les trois pions peu utile. En effet, les pions ne peuvent plus avancer.",
        "5. b3 Bd7 6. Nf3": "Les blancs continuent à se développer et consolident leur chaîne de pions tandis que les noirs préparent une structure \"Béton\" qui a comme unique point faible la traditionnelle case f7.",
        "6... Nf6 7. h3 g6 8. Bd3": "Les blancs contrôlent le centre et ont beaucoup d'espace, les noirs sont très reserrés.",
        "8... Bg7 9. Na3": "Le développement du cavalier dame se fait normalement en c3, où il a théoriquement plus de mobilité et une bonne prise au centre. ",
        "9... Nh5 10. Rb1": "Suite à ce coup de cavalier noir, le Fg7 peut désormais aller sur c3.",
        "10... Bc3+ 11. Ke2": "Les blancs ont perdu leur occasion de faire le petit roque. 11. Fd2 Fxd2 12. Cxd2 permettait d'empecher ce désagrément.",
        "11... O-O 12. Qc2 Bf6": "Observons la position. Les blancs ont une tour inamovible (Tb1), un cavalier qui n'a aucune case de fuite (Ca3), un roi non protégé (Re2) mais un fou qui pourrait s'infiltrer chez les noirs via h6 (Fc1).\nLes noirs ont une solide défense mais des problèmes de développement (Cb8, Ta8 ...).",
        "13. g3": "13. Fxh6 était aussi jouable.",
        "13... Ng7 14. Rd1 e6": "Les blancs ont regroupé leurs pièces, mais les noirs ont une faiblesse : le pion h6.",
        "15. Bxh6 exd5 16. exd5 Bxh3": "Chaque camp a un fou chez l'adversaire.",
        "17. Be3 Bg4": "Les blancs pouvaient garder leur fou en h6, pouvant peut-être l'échanger contre le cavalier en g7. Cependant, une idée de combinaison germe chez les noirs : 17... Fg4 18. Tc1 Te1 19. Cb1 Cf5 20. Th1 ??? Cd4  ! 21. Rd2 Cxc2 gagnant la dame.",
        "18. Rdh1 Re8 19. Rh2 Nf5 20. Rh4 Nd4+": "Les blancs ont laissé la combinaison s'exécuter.",
        "21. Kf1 Nxc2 22. Bxc2": "Avec un avantage aussi grand, la fin se passe de commentaire.",
        "22... Bxh4 23. gxh4 Bxf3 24. Bd3 Qxh4 25. Nc2 Qh1#": ""
    },
    "url": "https://gameknot.com/annotation.pl/un-mini-tournoi-fran-ais-pourquoi-pas?gm=13992",
    "gameName": "Un mini-tournoi français ... pourquoi pas ?",
    "players": "niallol (944) vs. villiers (925)",
    "opening": "Carr's defence (B00)"
}