{
    "moves": {
        "1. c4": "El enfoque creativo con el que afronté este torneo, se reflejó de la forma más precisa en esta partida. Ninguna pretensión de apertura, intentando trasladar al medio juego el peso de una adecuada comprensión de la posición y la elaboración de los planes subsiguientes.\n",
        "1... e5 2. Nc3 Nf6 3. Nf3 Nc6 4. e3": "Debo mencionar que la apertura inglesa la jugué en mi primer campeonato nacional durante el año de 1988. A lo largo de los años he seguido alguno de los esquemas más representativos, especialmente el que en esta posición comienza con g3. Sin embargo, hice el movimiento de la partida intentado llevar la partida a una posición tipo siciliana invertida, contando con que mi adversario pudiera no estar consciente de ello y tuviera que encontrar un plan de juego desacostumbrado.\n",
        "4... Be7": "La práctica me hace considerar que el movimiento más fuerte en esta posición es Ab4 por su incidencia concreta en la lucha por el centro.\n",
        "5. a3 a5 6. d3 d5 7. cxd5 Nxd5 8. Bd2 O-O 9. Be2 Be6 10. Rc1 Qd7 11. Na4": "Este movimiento lo hice por analogía a la posición equivalente de la defensa siciliana en el que la casilla c4 es un objetivo tradicional. En esta posición, la casilla c5 se convierte en este objetivo. También consideré este movimiento tratando de evitar que fuera cambiado en la siguiente jugada negra si hacía el movimiento mecánico 0-0, lo cual ami parecer, disminuiría sensiblemente la posibilidad de crear complicaciones en el flanco de dama.\n",
        "11... Nb6": "Alternative variation: 11... f5 12. Qc2 Nf6 (12... e4 13. dxe4 fxe4 14. Qxe4 Rad8 15. O-O $16) 13. O-O Kh8 14. Nc5 Bxc5 15. Qxc5 e4 16. Nd4 Nxd4 17. Qxd4 Qxd4 18. exd4 $14\n",
        "12. Nxb6 cxb6 13. Bc3": "Contando con la siguiente jugada negra\n",
        "13... f6": "Alternative variation: 13... Qd5 [Esta jugada podría haber sostenido mejor la posición negra, manteniendo la tensión.]\n",
        "14. d4": "Este es el movimiento que establece la ventaja en esta línea. Mi intención es buscar el cambio en el centro, lo que abre la posición conventaja blanca intentando aprovechar las debilidades de la estructura de peones en el flanco de dama negro. Un detalle en particular en este momento es que al jugar d4 inmediatamente se evita que las negras pongan en movimiento su masa de peones con b5 lo que podría otorgarles incluso ventaja.\n",
        "14... exd4": "Alternative variation: 14... e4 [Línea propuesta en el análisis de la partida por mi amigo Josué Velázquez en la que se procura que el peón negro en e4 obstruya la adecuada protección del flanco de rey blanco y la armoniosa ubicación de las piezas. Se evita también la línea de la partida en la que todo es más cómodo para la blancas. Dejaré intacta la secuencia propuesta por el módulo de análisis.] 15. Nd2 f5 16. Bc4 Rfd8 17. O-O Rac8 18. Qb3 Bxc4 19. Qxc4+ Qd5 20. Qxd5+ Rxd5 21. Nc4 Bd8 22. a4 Bc7 23. Na3 Na7 24. Bd2 Kf7 25. h4 Nc6 26. Nb5 Bb8 27. Bc3 Ne7 28. f3 exf3 29. Rxf3 Rc4 30. e4 Rd8 [[%eval 32,21]] \n",
        "15. Nxd4 Bd5 16. Bg4": "Es en particular por esta jugada por la que me atreví a comentar esta partida. Al tener todavía a mi monarca en el centro, la secuencia obvia pasaba por un inmediato enroque. Sin embargo, tuve la fortuna de no precipitarme y considerar esta jugada a la que le dediqué varios minutos durante los cuales consideré diversas ramificaciones, después de las cuales sentí que lograría en cualquiera de ellas una posición muy ventajosa.\n",
        "16... Qd8": "Alternative variation: 16... f5 17. Nxf5 Rxf5 18. e4 $18\n",
        "17. Ne6 Bxe6 18. Bxe6+ Kh8 19. Qh5 Qe8": "Alternative variation: 19... g6 [Si las negras hubieran ralizado esta jugada, ya había pensado en el plan De2 seguido de h4 con lo que seguén mis consideraciones obtenía una ataque directo sobre el rey negro. No es la línea que propone el módulo lamentablemente, pero ya lo había decidido. Como decía el gran Tahl \"Cuando me gusta una jugada ya no busco otra, y como no la busco pues no la encuentro, y como no la encuentro pues hago la que me gusta\"] 20. Qe2 Qe8 21. Bb3 Bd6 22. h4 $40\n",
        "20. Qh3 Rd8": "Alternative variation: 20... b5 [Este era el único movimiento que me preocupaba y realmente no tengo claro que hubiera jugado. Todo el resto de la partida el alfil en c3 ejerció una presión devastadora, por lo que cuando tuve conciencia de esta posibilidad me sentí intranquilo a pesar de que consideraba una clara ventaja para las blancas. El módulo propone la siguiente línea  en la que establece una clara ventaja blanca, pero de la que estoy seguro yo no habría seguido simplemente porque no habría cambiado mi alfil por el caballo y la que tal vez habría dejado escapar mi ventaja.] 21. O-O b4 22. axb4 axb4 23. Bd4 Nxd4 24. exd4 Bd6 25. Rfe1 Qg6 26. Bf5 Qh6 27. Qxh6 gxh6 $16\n",
        "21. O-O Bc5 22. Rcd1 g6": "Tal vez el negro mantenía la imagen residual del alfil ejerciendo presión a lo largo de la diagonal b1-h7 y hace este movimiento que traslada la presión a la diagonal negra...hasta el final de la partida.\n",
        "23. Rxd8 Qxd8 24. Bb3": "Esta maniobra la propuso el módulo sin cambiar en d8. Tratando de comprender lo importante de la posición llegué a una conclusión tipo Botvinnik (ustedes perdonarán lo pretencioso): !Hay que cambiar las torres y mantener los alfiles!\n",
        "24... Qe7 25. Rd1 Rd8 26. Rxd8+ Nxd8 27. Qf3": "Alternative variation: 27. g4 [Una jugada muy concreta, ejerciendo presión rápidamente sobre f6. Sin embargo, francamente fuera de mi alcance.]\n",
        "27... Kg7 28. Qd5 Nf7 29. Kf1 Nh6 30. h3 Qd6 31. Qxb7+ Qe7 32. Qd5 Qd6 33. g4 Qxd5 34. Bxd5 Nf7 35. Ke2 Nd6 36. g5 Ne8 37. Bc6 Kf7 38. Bxe8+ Kxe8 39. Bxf6 a4 40. Bd4 Be7 41. h4 b5 42. Bc3": "Limitando hasta el movimiento b4.\n",
        "42... Kd7 43. f4 Ke6 44. e4 Bc5 45. Kf3 Bg1 46. Kg4": ""
    },
    "url": "https://gameknot.com/annotation.pl/unam-2012?gm=47772",
    "gameName": "UNAM 2012, ?",
    "players": "Hidalgo Mendoza, Enrique A.  vs. Cruz de la Rosa, Marco Antonio ",
    "opening": "English (A22), Bellon gambit"
}