{
    "moves": {
        "1. e4": "Hi everyone!\r\n\r\nAs you know my queen ain't called Glenda the Defender for nothing!  However, one can easily fall asleep when dealing with her.  But watch it!  She can be very sneaky and if you doze off you can get a mighty rude awakening as my unfortunate opponent did in this game - although I think it is more appropriate to say that my opponent was pre-occupied with pinning my e pawn and missed the mate threat.  He who is without sin, cast the first stone, because in my recent game, annotated as \"Heavy Weather\" I overlooked the chance to deliver mate in 3.  Luckily the move I played won enough material for my opponent to chuck in the sponge.\r\n\r\n",
        "1... e5 2. Nf3 Nc6 3. Bb5": "3. Bb5 - If faced with Nc6 I play my stock move, Bb5 the Ruy Lopez, also known as Kasparov's Spanish Torture.",
        "3... a6 4. Ba4 d6 5. c3": "5. c3- preparing a later d4.",
        "5... Nf6 6. d3": "6. d3 - but it is d3 first.",
        "6... b5 7. Bc2 Be7 8. Nbd2": "8. Nbd2 - my queenside is undeveloped so out comes the wood!",
        "8... Bg4 9. Nf1": "10. Nf1 - must unblock Fou Lenoir.",
        "9... O-O 10. h3 Bd7": "10. ...... Bd7 - black chooses to retreat his lsb.",
        "11. Ne3": "11. Ne3?! - in retrospect I am wondering whether Ng3 would have been better, see below.",
        "11... Nb8": "11. ...... Nb8 - making way for Bc6 perhaps.",
        "12. d4": "12. d4 - I decide the time is ripe for this move.",
        "12... c6": "12. c6? - loses pawn.",
        "13. dxe5 Ne8 14. exd6 Bxd6": "14. ...... Bxd6 - after that black remains a pawn down.",
        "15. Qd3": "15. Qd3?1 - I wonder whether I should have played Nf1 before this move, disguising my intentions.",
        "15... Bc7": "15. ...... Bc7 - my opponent wisely backs off his dsb.",
        "16. e5": "16. e5 - I play e5 anyway but I am cursing the fact that my knight is blocking the c1-h6 diagonal. After black plays the expected g6 I am cursing the fact that I cannot immediately put Fou Lenoir on h6.  However, here is some good fortune, my opponent forgets about Glenda and puts the Wicked Witch of the West on e7, and now, Glenda eagerly gets on her Nimbus 2000 and ........",
        "16... Qe7 17. Qxh7#": "17. Qxh7 MATE!!   ......... and traps the enemy king on h7 - she now waves her wand and my opponent's king will be spending many an uncomfortable night in the dungeon of either Castle Acre or Castle Rising - that's right, I may be christening my rooks next with those names after two medieval castles not too far from my native King's Lynn and Hunstanton in Norfolk!  Anyhow, just glad to get my 6th victory in the Sneaky Knights Group 3 Mini-Tournament."
    },
    "url": "https://gameknot.com/annotation.pl/underestimate-glenda-at-your-peril?gm=26141",
    "gameName": "Underestimate Glenda at your peril!",
    "players": "jstevens1 (1834) vs. NN (1569)",
    "opening": "Ruy Lopez (C74), modern Steinitz defence"
}