{
    "moves": {
        "1. d4 d5 2. Bf4 c6 3. c3": "I see this move as necessary. Qb6 causes white to defend, and white can, in fact, but it leads the game slightly on black's side. If now black goes Qb6, Qb3 is ok. White won't exchange queens if black doesn't go for it. ",
        "3... Nd7": "Not bad but black must have a good plan to develop his lsb. ",
        "4. Nf3": "Preventig e4, mandatory. ",
        "4... Ngf6 5. e3": "Inviting black to exchange my good dsb for the Nf6, at the cost of opening the h column for my rook. I'm planning to castle queenside. (Nh5, Bg3, NxB, hxN).",
        "5... g6": "! It is always more difficult for me to play against the fianchetto. ",
        "6. Nbd2": "I wait for the bishop to develop until it can do on a threatening square. Bd3 is not bad, but not the priority. ",
        "6... Bg7 7. Bd3": "? h3 would have been profilactic, but I intended to use the h pawn to break the black kinside pawns. ",
        "7... O-O": "Falling into my game. Black is well advised to unravel his pieces and castle queenside instead. ",
        "8. Ne5": "This is important to free the way for the queen and the other knight to support. ",
        "8... Re8": "Useless, now that e5 is impossible for black. This is the key of white's game. ",
        "9. g4": "? Gives the pawn for nothing, but opening the g column. Again, h3 was necessary, but I hate slow moves. ",
        "9... Nxe5 10. dxe5 Nxg4 11. Nf3": "I have to defend e5 at all costs. And this is not bad, since my other knight gets into the fry. Even so, the entire sequence is ? due to the fact that black has now half-solved the lsb's problem. ",
        "11... Nh6": "\"Threatening\" Bf5, and I won't get anything from BxB, NxB. Now, white has not a good position. ",
        "12. Bxh6": "? Trying to avoid black's developement plan, but falling into...",
        "12... Bxh6": "Now, h3 seems necessary. But this will be a defensive move. ",
        "13. h4 Bg4": "...I got what I deserved. Now, I have to lose a tempo! And, far worse, black has developed his lsb to a very nice square (h5).",
        "14. Rg1 Bh5": "...and the bishop is in a very nice square, blocking my h pawn to cause some trouble to black's kingside. ",
        "15. Be2": "Only way to cope with the pin. Again, I could have saved a tempo by waiting to move it on d3. ",
        "15... e6": "Threatening BxN and Qxh5 (but it won't be necessarily good for black). ",
        "16. Ng5": "I have to \"use\" the e5 pawn, and this is the way. If f6, BxB! I'm also threatening it just now. Now, BxN just don't give much to black, but it loosens my attack (provided black doesn't allow me to open his king accepting BxBh5, gxB).",
        "16... Bxe2": "Half-forced, avoiding BxB. ",
        "17. Qxe2": "Freeing the way for castling, while black has only the queen to attack my queenside (for the moment).",
        "17... Qb6 18. O-O-O": "Although ruined by my bad moves, the general idea to go for the BK, even at the cost of accepting him losing time attacking my king, still holds. This castling offers b2 a protection (freeing my queen), and joins the two rooks. Moreover, it gets a R's eye on d4. ",
        "18... Rac8": "? Preparing his queenside attack, of course, but better would have been c5!, definitely, threatening to open the columns against my king by pawn's exchanges, and preventing Rd4. I could defend, but my attack would be compromised. ",
        "19. Qf3": "? More interesting maybe was h5 at once. This wins a tempo to have my queen well on the kingside. This move is possible because of o-o-o, otherwise the queen is dued to b2's defence. It threatens mate (Qxf7+), so black has to defend. ",
        "19... Ref8": "That kind of demostrates that Re1 by black was a loss of tempo. Now, Qf6 is worthless because of Bg7. But the queen is not staying there forever. ",
        "20. Rd4": "!? h5 was needed, in order to go on with the attack. This aims at f7. Qf6 was worthless due to Bg7. The great question you have to ask yourself before making such a move is: \"Would I be able to save the rook in the future, if it has to move along the 4th row?\". With lots of pawns on the board, the answer is generally \"no\", so you better don't. I took the risk, here, because I planned to get all my forces on f7, pressuring black, and I had the \"escape square\" b4, threatening the black queen and thus winning a tempo to save the rook againt future pawn's advances. My other plan was to take away the queen so to play f4 (once e3 was well guarded). But again, this is a \"passive\" plan, that gives black tempo to c5 and d4. ",
        "20... Bg7": "! Giving the B his best use.",
        "21. Rf4": "I give black e5, a very dangerous concession, but if Bxe5, Rxf7. Qg3 was another idea. But this was more exciting (and in blitz I always go for the excitement! :-)",
        "21... Rc7": "! Defending f7, and I can't add another piece. Does it means that the whole plan started with Rd4 was bad? Maybe. But my pieces are just threatening, aren't they? Note that if now black could move, Bxe5 will be answered by Nxe6 (fxN, QxR#), BxR, NxRf8. So I was not opposed to Bxe5, and...",
        "22. h5": "To start mining black's pawns. ",
        "22... Bxe5": "I just overlooked Nxe6 because of the hurry. It would be fun to go through it and see what happens. ",
        "23. Rb4": "? The \"escape square\" I planned to use some moves ago. Alternative move Rh4 was hard to calculate (f6...)",
        "23... Qa5": "Ok now I can be passive and play Kb1, as a good boy... or Rb3 (Qxa2?, Ra3!)... or try to push for the win. Can you guess what I choosed? :-)",
        "24. hxg6 fxg6": "?? The losing move, no doubt. With hxg6 black could have survived longer. My queen kicked? No problem. Black thinks that he wins a tempo by threatening my queen, AND f2, but... hey, he is leaving e3 unguarded by a pawn, so it has a fork threat... and much more!",
        "25. Qh3": "Threatening d6 for the second time, and making it impossible to defend. ",
        "25... Qxa2": "? Black doesn't sense the danger, or he thinks that his threats are stronger than mines. As often in tactic chess, the crossed-attacks theme is most interesting, but you have to be very realistic in tempo calculations. Note that black has Qa1+ followed by QxRg1. But white's threat is worse that this. Black could simply play Re7. It deverted the R from the attack, but now if white goes Nxe6, black has Rxf2, while the dsb guards some squares around the king. Bue even more than that: black has to prevent the white R to join the attack, so d4 was mandatory, even sacrifying it, in order to keep this rook apart from the attack (then, black can try to win it with Bd6... after the kingside storm). ",
        "26. Qxe6+": "...but this is a heavy move. Note that the Be4 is hanging, and so is the Rc7. My queen will take both, and then black's revenge on the Rg1 would be not enough. It is fun to try to calculate if white can afford (after the previous moves) Rxb7, with unavoidable mate threat, but leaving black the check's round with Q AND the Rf8 (xf7+ at some point). Very thrilling, but I won't go for it. ",
        "26... Rcf7": "Black gets a knight after all, instead of plainly losing B and R (for a R).",
        "27. Nxf7 Qa1+": "Winning my rook in the meantime. ",
        "28. Kc2": "Prepared to hide on b3...",
        "28... Qxg1": "Now, the tempting double check Nh6 is just bad: Kg7, QxB+, KxN. So I went for another idea. ",
        "29. Ng5+": "...looking at Rh4. Note that f2 is under double attack.",
        "29... Kg7": "Black is forced to lose the bishop this time. But it is well worse than that. ",
        "30. Qxe5+ Rf6": "Kh6, Rh4#. But I could have played Rxb7+, winning without question. But I saw another way. ",
        "31. Qe7+ Kh6": "Rh4+? KxN, but now that f2 will be defended, there is no hope for black. He can just try the last way: if I go Rxb7 now, he can start the check's round with Rxf2, and... this is unnecessarily risky (black's queen can go to d1, so my king won't be able to hide easily. ",
        "32. Qxf6": "It seems a mistake, since it loses the kinght, but... (can you see it, beg? :-)\nNote that it was just dangerous to let black take f2 with check. ",
        "32... Qxg5": "Black will lose a rook down, but there is still a quicker way. ",
        "33. Rh4+": "The \"coup de grace\". The R is \"x-ray\" defended by my Q, and both QxR or Qh5 will leave me a Q up. Thank you for reading and forgive me for the bad moves :-). My opponent, sensibly, resigned here. "
    },
    "url": "https://gameknot.com/annotation.pl/unexpected-x-ray?gm=55666",
    "gameName": "Unexpected X-Ray",
    "players": "damalfi (1800) vs. Player (1662)",
    "opening": "Queen's pawn, Mason variation (D00)"
}