{
    "moves": {
        "1. e4": "Team match, I play white and, as usual, I go for the open game.",
        "1... e5 2. Nf3 Nc6 3. Bb5": "Yay! The Ruy!",
        "3... a6 4. Ba4 Nf6 5. O-O": "Normal lines.",
        "5... b5 6. Bb3": "5. ... b5 is the ARchangel line of the Morphy Defense.",
        "6... Be7 7. a4": "Threatens 8. axb5 and black cannot recapture 8. ... axb5?? for he loses his rook at a8 with 9. Rxa8.",
        "7... Bb7 8. d3": "Black double-defended his rook, allowing him to recapture if white captures on b5, but I don't want to do that - I would rather see to my development. Besides, if black plays bxa4, white can reply with Bxa4, repositioning on the half-pinned knight on c6 and isolating black's rook pawn on a6.",
        "8... d6 9. Nc3": "Adds pressure on b5.",
        "9... O-O 10. axb5": "Black didn't defend his pawn on b5, so it's time to win a pawn and clear out some pieces.",
        "10... axb5 11. Rxa8 Bxa8 12. Nxb5": "And now white is a pawn ahead. Development is relatively even, and neither side seems to have any pressing attacks yet, so I'm hoping to work up some exchanges and head for a pawn-up endgame - unless I find more goodness along the way.",
        "12... Na5 13. c3": "Defends the bishop on b3 so I don't end up doubling pawns if black captures him. I welcome any exchange of pieces that doesn't create disadvantages in my pawn structure.",
        "13... c6 14. Na3 Qc7 15. Ba2": "I want to be able to move my queen without fear of losing the bishop on b3.",
        "15... d5 16. exd5 cxd5 17. Re1": "Seizing the half-open file and doubling the pressure on e5.",
        "17... e4 18. dxe4 dxe4 19. Nb5": "Black has deliberately created pawn exchanges in the center. On the one hand, general rule is that when you're up by a pawn, exchange pieces, when you're up by a piece, exchange pawns. So ostensibly the pawn exchanges can help black get to a drawn endgame. But on the other hand, these exchanges have created a pair of adjacent passed pawns for white on the b and c files. Those pawns should be able to support each other and press for promotion, unopposed by anything but pieces - played right, I should be able to gain material as black sacrifices to stop their advance.",
        "19... Qc5 20. Nfd4": "The knights defend each other.",
        "20... Rd8 21. b4": "My knight on d4 is pinned, but the only piece making any threats is black's queen. If he gets serious about attacking the knight on b5 with something else, like a bishop, I will have to worry about the pin. Meanwhile, advancing pawns while attacking seems like a good plan - especially when the advance includes a fork! I feel 20. ... Rd8? deserves a single ?. (I sure wish there were some way to put those ? right into the move list).",
        "21... Qb6 22. bxa5": "OK, capturing caused me to voluntarily isolate my two passed pawns, one of which falls instantly, leaving me up by exactly a knight. I wasn't sure if this was a wise line of play. I cannot win a king knight vs. king endgame. That's a draw. But I can win a king pawn vs. pawn endgame. I traded the winnable endgame to a draw endgame, banking on the opportunity to use my extra piece and my passed, but isolated, c-pawn to gain additional material before everything gets traded down. I truly don't know which path is best.",
        "22... Qxa5 23. Qc2": "Defending the attacked pawn on c3 and the attacked bishop on a2.",
        "23... Rc8 24. Bd2": "Doubling the defense of c3. This is the point that the game timed out. My opponent has been offline for 5 days and has had over a dozen consecutive games timeout during that time. Apparently he is away - I hope he is well. As for this game, as my previous comment states, my intention is to play for advancing the c-pawn, banking on my extra knight to ensure its safety and hoping to force black to sacrifice more material to prevent its promotion. Black's advance pawn on e4 looks like a possible target too. This game still had a lot of potential for both sides. Too bad we didn't get to finish it."
    },
    "url": "https://gameknot.com/annotation.pl/unfinished-business?gm=21887",
    "gameName": "Unfinished Business.",
    "players": "blake84120 (1504) vs. wkand (1504)",
    "opening": "Ruy Lopez (C78), Wing attack"
}