{
    "moves": {
        "1. f3 d5 2. Kf2": "The bad thing for black with this opening is that if black doesn't win, he feels like an idiot... and often he is.",
        "2... e5 3. e3 Nc6 4. g3 d4 5. Be2": "No pont in dxe and exchange queens. ",
        "5... Bc5 6. a3": "The \"normal\" move is to stop the b4-b5 advance. But I wanted to surprise him. This is the risk of this kind of opening. ",
        "6... Nh6": "My idea is to press strongly e6, so I set my knight in order to do that... maybe.",
        "7. b4 Bb6 8. c4": "First interesting moment. If I take the pawn, I help him. If I don't, he threats to trap my bishop. I didn't foresee this move, but I must \"demostrate\" I did, so I considered to play the only other reasonable choice. Here is one variant I saw...\n\n\n8.\tc2-c4\td4-d3\n9.\tc4-c5\td3-e2\n10.\tg1-e2\td8-f6\n11.\tc5-b6\te5-e4\n12.\tb1-c3\tf6-f3+\n13.\tf2-g1\tc8-h3\n14.\te2-f4\tf3-d1+\n15.\tc3-d1\th3-g4\n16.\tc1-b2\te8-g8\n17.\tb4-b5\ta8-d8\n18.\tb5-c6\td8-d2\n19.\td1-f2\tg4-f3\n20.\tc6-b7\tg7-g5\n21.\tf4-g2\th6-g4\n22.\tb6-a7\tg4-f2\n23.\ta7-a8\tf2-h3+\n24.\tg1-f1\tf3-g2+\n25.\tf1-e1\td2-b2\n26.\tb7-b8\tb2-b8\n27.\ta8-b8\tf8-b8\n28.\te1-e2\t",
        "8... dxc3 e.p.": "At last, I wasn't sure, so I played the \"simple\" one. ",
        "9. Nxc3 Nd4": "If he takes the knight, I recover the piece in a way or another, after pawn xd4, Na5, d3+, NxB, PxB, NxP, PxN... maybe playable by him, but with an edge for me, despite the pawn, due to a much more active position and open play (Qd5...).",
        "10. Na4": "How to demostrate him that I foresaw this move and that it was part of MY plan?\nBecause the knight is still safe, now for a new reason: Qxd5+, threatening the rook. \n",
        "10... Be6": "Another surprise. I am threatening Bb6. A better reason to play KxB. As if I thought that this is good to me. And actually it is!",
        "11. Bb2": "Incredibly complex, for my standards. Bb3 doesn't win a piece, this is for sure. Nor the white queen need to retire. I considered deeply Nb3, but the weakness of e5 is dangerous. It makes me lose a movement playing f6 or o-o, even if in some variants I can let him take in g7. \nI will probably go for the simpler one, but there is a word of tactics around here. ",
        "11... Bb3 12. Qe1": "I never expected this one... it makes things easier for me...",
        "12... Nc2 13. Nxb6 Nxe1 14. Nxa8": "Now, the simpler one is QxN, RxN, and I am only +1. But my queen is trapped, and he has good game in the center. Note that my knight isn't playing... So I wanted to surprise him again. ",
        "14... Nd3+ 15. Bxd3 Qxd3": "This leaves unattended the a8 knight... a risk, but I thought that the attack I have worths it, even allowing the next to moves...",
        "16. Nxc7+ Kd7": "Now, I have double threats.",
        "17. Bxe5 Qxd2+": "Of course! This \"must\" win, or I am lost!",
        "18. Ne2 f6": "Now, this was the mistake. I was considering here Nf5, and this would have been a winning move, I think. I thought, mistakenly, that it was more or less the same to play this one before or after. No way.",
        "19. Bc3": "Didn't see it. Even now, probably Qc2 was better. ",
        "19... Qd3 20. Ne6": "I cannot take the knight! What a shame I didn't see it before...",
        "20... b6": "Just to avoid Nc5! Boooooo...",
        "21. Ne6f4": "He has grouped his pieces... the play is tactically lost for me. Now I have a lot of work in order to save my queen!",
        "21... Qc4 22. Rhc1 Qa6 23. Nd4 Qa4": "I am playing an idiot... :-)))\n\n23.\te2-d4\ta6-a4\n24.\tc1-b1\tb3-c2\n25.\tb1-c1\th8-c8\n26.\tc1-c2\th6-f5\n27.\tc2-d2\tf5-d4\n28.\td2-d4+\td7-e8\n29.\tc3-d2\tg7-g5\n30.\tf4-h5\te8-e7\n31.\ta1-c1\tc8-c1\n32.\td2-c1\ta4-c2+\n33.\tc1-d2\tc2-b2\n34.\td4-d3\tb2-c2\n35.\td3-d5\tc2-b3\n36.\td2-c1\tb3-a2+\n37.\td5-d2\ta2-b1\n38.\tc1-b2\tb1-h1\n39.\tb2-f6+\te7-e6\n40.\tf6-g5\th1-h2+\n41.\tf2-e1\th2-h5\n42.\tf3-f4\th5-h1+\n43.\te1-e2\th1-g2+\n44.\te2-d1\tg2-g3\n45.\td2-e2\tg3-g1+\n46.\td1-d2\tg1-a1",
        "24. Rcb1 Bc2 25. Rbc1 Bb3 26. Rcb1 Bc2 27. Rbc1": "At this point, I analyzed Rc8, looking for some phantom to save me. But no. \nIf NxN, RxB, ok. But if Nxb? Qb3, ok. \nBut if Ne2, I had nothing. \nSad but true. ",
        "27... Bg6": "But I was not looking for draw! ",
        "28. Rcd1": "He didn't take the bishop. He loved too much his two knights, or he feared some king of counerattack on the h columns... with some good reasons!",
        "28... Kc8": "Sad necessity. The knight out of the inmediate reach of a Knight jump!",
        "29. Rac1": "Just shaking. ",
        "29... Kb7": "My queen is safe, but trapped. If I don't get my pieces into the game, I'm finished!",
        "30. Bb2 Rc8": "He cannot exchange. If RxR, QxR threatening to win the bishop after the check. ",
        "31. Rd2": "Now what?"
    },
    "url": "https://gameknot.com/annotation.pl/unfinished-tactc-game?gm=26188",
    "gameName": "Unfinished tactc game",
    "players": "irade92 (1687) vs. damalfi (1684)",
    "opening": "Gedult's opening (A00)"
}