{
    "moves": {
        "1. e4": "1.e4\n*************************************************************************** \nCongratulations Rick! You started this game with the most popular Master move (as per the GameKnot World Database)!\n\nThis move is good because it opens lines for the LSB (light squared bishop) and the queen. More important you control the crucial d5 square and the secondary f5 square. In the opening you have a constant battle to control the primary center squares, being d4, d5, e4 and e5. Whether you control them with pawns (as you are doing with your first move, 1.e4) or you control them with pieces (as I do with my first move 1...Nc6), you must battle to control these squares!\n\nAlso, to a lesser degree, the same principle goes for the secondary center squares, being c3, c4, c5, c6, d3, d6, e3, e6, f3, f4, f5 and f6. Bottom line Rick, to play well in the opening, you must be a control freak. Control those squares!",
        "1... Nc6": "So 1...Nc6 marks the Nimzowitsch Defence.\n\nThough it is not currently used in top level chess, it is a great weapon to use in intermediate level games. Wikipedia states, \"This opening is an example of a hypermodern opening where Black invites White to occupy the centre of the board at an early stage with pawns. Black's intent is to block or otherwise restrain White's central pawns and, if allowed to do so by inaccurate play by White, eventually undermine the White pawn centre by well-timed pawn advances of his own or by attacking the White pieces defending the centre.\" See reference in comment below.\nI like this defence because it is not as studied by my opponents as more popular openings.\n***************************************************************************\n\nThe Nimzowitsch Defence is categorized as a Semi-Open Game. That is \"...a chess opening in which White plays 1.e4 and Black breaks symmetry immediately by replying with a move other than 1...e5. The Semi-Open Games are also called Single King Pawn, Asymmetrical King Pawn, or Half-Open Games (or Openings), and are the complement of the Open Games or Double King Pawn Games which begin 1.e4 e5.",
        "2. Nf3": "2.Nf3\n*************************************************************************** \nSo on a master level this is the most common move. *************************************************************************** \nIt seems to me to be an attempt to go into an open opening such as Ruy Lopez or Giocco Piano. If Black plays 2...e5 (considered by many to be the best move) now, white can play the Ruy, with 3.b5 or the Piano, with 3.c4. I won't allow that though, since my reason for my previous moves is that I like the Nimzowich. And so....",
        "2... f5": "2...f5!?\n*************************************************************************** \nThis move, sacrificing a pawn, leads to positions racked with traps and complications (which is the style of game I prefer).",
        "3. e5": "3.e5\n*************************************************************************** \nA sound move (declining my pawn sac), in line with the white side of this defence. You want to restrict black's position. My gameplan on the other hand is to play behind the lines and undermine your pawn(s).",
        "3... d6": "3...e6\n*************************************************************************** \nThe beginning of my undermining your pawn center (or centre, as it's spelled up here in Canada. I'm originally from New York, thus the American spelling).",
        "4. exd6": "4.exd6\n*************************************************************************** \nAgain a good move as you would have a hard time holding that pawn.",
        "4... e5": "4.e5?!\n*************************************************************************** \nI request feedback from all of the Immortal Kings (and others who see this annotation), especially advanced players. This move is an experiment on my part. Gameknot's computer analysis states it is an mistake. GK's World Database does not show it at all.\n*************************************************************************** \nSo I am sacrificing a pawn to gain momentum in the center and gaining space and development. After 4...e5 5.dxc7 Qxc7, I threaten e4! His knight has few squares to move to. He can play 6.d3 to stop the e-pawn advance, but that leaves him with back wards development and a temporarily blocked in Bishop.",
        "5. dxc7": "5.dxc7\n*************************************************************************** \nYou take my bait!",
        "5... Qxc7": "5...Qxc7\n*************************************************************************** \nI take back! So Rick consider this position.\n*************************************************************************** \nI stated previously, \"In the opening you have a constant battle to control the primary center squares, being d4, d5, e4 and e5.\" You also have a constant battle to gain development. This means you need to get your pieces out as quickly as you can, and preferably before your opponent. An army in it's original position(s) can neither defend no attack. Take a look at the final position. You finished with a bishop, knight and rook on their original squares. You lacked development, thus you could not ward off my attack. I was even able to give up material (15...Nxf3), because my remaining material was sufficient due to your lack of development.\n*************************************************************************** \nThere are several ways to ensure your development is good:\n1. Try to avoid moving the same piece repeatedly until you complete your development. Your development is complete when you have your knights, bishops and queen off the back rank and you have castled, so your rooks are connected.\n2. Make threats against your opponent. When I played 7...e4 attacking your knight, you may have wanted to play 6.Nc3, (a good developing move) but you couldn't because of my threat to take your f3 knight. You could have played 8.Re1, furthering your development, as my pawn would be pinned. Instead, you moved your king side knight a second time, slowing down your development.\n3.Check your opponent's king with a developing move. When I played 11...Bc5+ you could not develop your knight to c3 for example, since you were required to move your king.\n*************************************************************************** \nThere are times it is okay to disregard this principle, along with all the principles of the game. This is when you have very forceful threats which your opponent can't counter effectively. For example, why think about development if you have a forced mate in 3 moves? ",
        "6. Bc4": "6.Bc4\n*************************************************************************** \nA good developing move. Because you have a threat, being 7.Bxg8, I can't make the move I want to make, 6...e4.",
        "6... Nf6": "6.Nf6\n*************************************************************************** \nPreventing 7.Bxg8, and keeping my knight which is needed to defend my kingside. ",
        "7. O-O": "7.O-O\n*************************************************************************** \nGood developing move, but it allows 7...e4! Maybe 7.d3 would have been better. Now your bishop would not be blocked in.",
        "7... e4": "Ahhh 7...e4!\n*************************************************************************** \nThe move I've been waiting for. Now you will need to move the knight a 2nd time, losing development. I am also setting a trap with this move: 8.Ng5 h6 9.Nf7 Rh7 and the knight is trapped. I would then harass the defending bishop with 10...Na5 11.Qe2 Nxc4 12.Qxc4 Qxf7. Or you may try 8.Ng5 h6 9.Bf7+ Ke7 leaving you with 2 attacked pieces and 1 of them will die. You seemed to be falling for this trap at first as you made the 8.Ng5 move but then move the knight back to h3. ",
        "8. Ng5": "8.Ng5?! \n*************************************************************************** \nI think 8.Re1 was needed here. Keep your development going, and postpone moving the knight a 2nd time.",
        "8... h6": "8.h6\n*************************************************************************** \nFortunately for me, you could not video cam me drooling on my keyboard, so you can post it on Youtube. Will he fall for the trap? Will he fall for the trap? ",
        "9. Nh3": "9.Nh3\n*************************************************************************** \nNo, he did not fall for it! Yet now if you count your development moves, you only have 4 moves (castling counts as 2) while I have 6. So I am 2 moves ahead in development. Since white gets to go 1st, you started out a half move ahead of me. But moving your knight 3 times (2.Nf3, 8.Ng5 and 9.Nh3) put you behind in development. In addition, you now have the knight on h3. The knights are not good on the side of the board as they have control of less squares. A white knight on f3 or c3 (f6 or c6 respectively for black knights) has control of 8 squares, including 2 of the primary central squares I mentioned earlier. A white knight on h3 or a3 (h6 or a6 for black) has control of 4 squares, none of which are the primary central squares.\n*************************************************************************** \nNote also, this is only your 9th move and you moved that knight 3 times. That means 33.33% of your moves were made by the one knight. That's seldom good.",
        "9... f4": "9...f4\n*************************************************************************** \nSimilar to if you had moved your knight to f7, your knight is trapped! So I played this move to threaten to take him, destroying your kingside pawn structure, while also threatening the pawn push to f6, which you can't afford to accept as it would leave your knight unprotected.",
        "10. f3": "10.f3\n*************************************************************************** \nPreventing my pawn push, yet allowing a later 11...Bc5+, slightly helping my development.",
        "10... Bxh3": "10.Bxh3\n*************************************************************************\nSo I chose to take the knight 1st otherwise you may play 11.Nf2. What I see now after the game is 10...Bc5+ 11.Nf2 e3 12.N(moves where ever) e2+ and the queen hangs! Interesting.",
        "11. gxh3": "11.gxh3",
        "11... Bc5+": "11...Bc5+",
        "12. Kg2": "12.Kh2\n*************************************************************************\nI think the king would be better in the corner here. Then if you can get rid of my bishop on the g1-a7 diagonal (tough task), the rook can go on g1.",
        "12... Ne5": "12...Ne5\n*************************************************************************\nAttacking the Bishop and f3 pawn. 13.Be2 is necessary. You later gave up the exchange because your bishop was not defending f3. When defending, it is good the defend with minor pieces, to free up the heavy artillery for other tasks.",
        "13. Qe2": "13.Qe2?",
        "13... O-O-O": "13...O-O-O\n*************************************************************************\nSafeguard the king and connect the rooks. My development is now complete.",
        "14. fxe4": "14.fxe4?\n*************************************************************************\nThis allows my next move, winning material. Also as I mentioned before this would be a safe move if the bishop was on e2.",
        "14... f3+": "14...f3+!",
        "15. Rxf3": "15.Rxf3\n*************************************************************************\nThe only way to save the queen! God save the queen!",
        "15... Nxf3": "15...Nxf3!",
        "16. Qxf3": "16.Qxf3",
        "16... Rhf8": "16...Rhf8\n*************************************************************************\nPrepare for a discovery attack on the queen. Always be careful when threatened with this.",
        "17. d3": "17.d3\n*************************************************************************\nThis doesn't really defend the pawn as I have a discovery attack on the queen and also a mate net around your king!",
        "17... Nxe4": "17.Nxe4!\n*************************************************************************\nSo I was not concerned about the knight's safety due to my mate threat. You could get your queen out of trouble by 18.Qg4+ Kb8 19.dxe4. It would not help because my mate threat is only on dark squares, so the result would be the same.",
        "18. Qxe4": "18.Qxe4\n*************************************************************************\nI see nowhere else she can go short of sacking by Qxf8. The rest is elementary dear Watson.",
        "18... Rf2+": "18...Rf2+\n",
        "19. Kg1": "19.Kg1",
        "19... Qxh2#": "Qxh2#\n*************************************************************************\nThanks for the game Rick! I hope I was a help to you. Enjoy that deck when you get it finished!"
    },
    "url": "https://gameknot.com/annotation.pl/unrated-tutoring-game?gm=55655",
    "gameName": "Unrated Tutoring Game",
    "players": "rick51 (1451) vs. faithfulltrav (1894)",
    "opening": "KP (B00), Colorado counter"
}