{
    "moves": {
        "1. e4": "This game is only public so cannycap can see it.\nI make a habit of starting with e4, so I'm not confusing myself with too many different openings.",
        "1... Nf6 2. e5": "The most popular move in gameDB. And it's aggressive, which I like.",
        "2... Nd5 3. d4": "Still in GameDB. This is called Alekhine's defense. W seems to be getting a firm grip on the centre.",
        "3... e6 4. c4": "GameDB main lines are c4, NF3 and Bc4. I'm initially tempted by NF3 as it's getting a piece off the back rank. But playing through the common line from there, it looks as if c4 is pretty much bound to comeup. So I may as well do it now, while the board is less cluttered.",
        "4... Nb4 5. a3": "*bump*\nBlack gets to move the N again. We'e getting to the end of the gameDB moves, \nand I have a very weird start, for me, with lots of pawn moves and no pieces. A lot\nof control of the centre but a very exposed back rank.",
        "5... Nb4a6 6. Nf3": "Finally leaving gameDB; developing a piece and clearing the way to castle, maybe.",
        "6... d5 7. Nc3": "I'll decline the pawn exchange for now; if d5xc4 I can use the white bishop to retake \nand kill 2 birds with one stone. Just get on with developing pieces.",
        "7... g6": "CC says: This is turning into quite an interesting game... it's weird how by chasing my knight around you have sacrificed quick development. Glad I didn't sacrifice the knight. We each have one blocked bishop, two useless rooks, semi-effective queen lines. You are one up on knight development. What do you think?",
        "8. cxd5": "I considered: c4xd5 f1-d3 Q-a4  c1-g5. I really liked the idea of developing a piece, \nbut on refection decided I was just getting twitchy about the general principle.\nAll the specific piece moves just seemed to lose me tempo for no real gain. \nc1-g5 was the most tempting alternative, as it makes a mess of black's planned fianchetto.\n",
        "8... exd5": "CC says: Rather than that move being a pawn grab, have taken your pawn in order to be able to develop my bishop.",
        "9. Bg5": "The obvious counter for black here is B-e7, then a B exchange leaves that kingside \npawn structure less useful than black might have wished. Also my N can pick off \nthe pawn with a threat to the Q. (And now she knows that and may avoid it.)",
        "9... Qd7": "CC said,  apperox: This was the obvious one to me; I don't want to lose the B so early.",
        "10. Bb5": "Purely on intuition. It just looked so nice. (I wonder if this is how I sometimes blunder badly??)\nIt seemed nice because it's developing with a threat, but it's an empty threat and allowed the \nd pawn to be protected.",
        "10... c6 11. Ba4": "No real choice here.",
        "11... Bg7 12. O-O": "No current attacks in progress or threats to counter, all clear for castling.",
        "12... b5 13. e6": "My line of retreat for the B is open, so I'll respond with a counter threat. This is nice; if PxP the castle is breached; if QxP even better, I get to pin the Q and I think all the possible saves gain me something.\n",
        "13... Qxe6": "CC says \"Pin away\"",
        "14. Re1": "OK, here goes. If I worked this out right I think I get to swap B&R for Q, at worst.\npXB, RxQ, BxR. I think.",
        "14... bxa4 15. Rxe6+ Bxe6 16. Qe2 O-O 17. Nxa4": "At least I get a pawn up, with no obvious problem. And I might exchange Ns too.",
        "17... Nd7": "A blunder??",
        "18. Qxa6": "If there's a trap too subtle for me to see, too bad. A free piece is a free piece. ",
        "18... Rae8 19. Qxc6": "Moving Q closer to the centre, plus picking off another pawn, leaving black with 2 isolated pawns.",
        "19... Nb8 20. Qd6": "Just a biff, I evade without backing out of the offensive position.",
        "20... Red8 21. Bxd8": "A clear blunder; sieze the chance.",
        "21... Nd7 22. Bg5": "Get the B out of the firing line.",
        "22... h6 23. Be7": "I wish I'd thought of this last move. A nice threat.",
        "23... Nb6": "CC says \"I'm stuck\"",
        "24. Nxb6": "Take all exchanges offered - especially Knights as I'm prone to losing to cuunning N forks. This is better than taking the rook as BxB threatening the Q would allow my N to be taken without redress."
    },
    "url": "https://gameknot.com/annotation.pl/unrated-discussion-game?gm=3124",
    "gameName": "Unrated discussion game",
    "players": "cajela (1337) vs. cannycap (1269)",
    "opening": "Alekhine's defence (B03)"
}