{
    "moves": {
        "1. e4": "1.e4 *************************************************************************** Congratulations John! You started this game with the most popular Master move (as per the GameKnot World Database)! This move is good because it opens lines for the LSB (light squared bishop) and the queen. More important you control the crucial d5 square and the secondary f5 square. In the opening you have a constant battle to control the primary center squares, being d4, d5, e4 and e5. Whether you control them with pawns (as you are doing with your first move, 1.e4) or you control them with pieces (as I do with my first move 1...Nc6), you must battle to control these squares! Also, to a lesser degree, the same principle goes for the secondary center squares, being c3, c4, c5, c6, d3, d6, e3, e6, f3, f4, f5 and f6. Bottom line Rick, to play well in the opening, you must be a control freak. Control those squares!",
        "1... Nc6": "So 1...Nc6 marks the Nimzowitsch Defence. Though it is not currently used in top level chess, it is a great weapon to use in intermediate level games. Wikipedia states, \"This opening is an example of a hypermodern opening where Black invites White to occupy the centre of the board at an early stage with pawns. Black's intent is to block or otherwise restrain White's central pawns and, if allowed to do so by inaccurate play by White, eventually undermine the White pawn centre by well-timed pawn advances of his own or by attacking the White pieces defending the centre.\" See reference in comment below. I like this defence because it is not as studied by my opponents as more popular openings. *************************************************************************** The Nimzowitsch Defence is categorized as a Semi-Open Game. That is \"...a chess opening in which White plays 1.e4 and Black breaks symmetry immediately by replying with a move other than 1...e5. The Semi-Open Games are also called Single King Pawn, Asymmetrical King Pawn, or Half-Open Games (or Openings), and are the complement of the Open Games or Double King Pawn Games which begin 1.e4 e5.\n",
        "2. Nf3": "2.Nf3 *************************************************************************** So on a master level this is the most common move. *************************************************************************** It seems to me to be an attempt to go into an open opening such as Ruy Lopez or Giocco Piano. If Black plays 2...e5 (considered by many to be the best move) now, white can play the  Ruy, with 3.Bb5 or the Piano, with 3.Bc4. I won't allow that though, since my reason for my previous moves is that I like the Nimzowich. And so....\n",
        "2... f5": "2...f5!? *************************************************************************** This move, sacrificing a pawn, leads to positions racked with traps and complications (which is the style of game I prefer).\n",
        "3. Nc3": "3.Nc3\n*************************************************************************** \nA good developing move. You have focused both your knights on controlling those primary squares I spoke of earlier.",
        "3... fxe4": "3...fxe4\n",
        "4. Ng5": "4.Ng5? \n*************************************************************************** \nSo in chess, you can't give away material without a reason. On my second move, I offered a free pawn to you. I had a specific purpose in mind. In playing 2...f5, if you accept, you can't hold the pawn without intense complications, which I like. Here you give me a free pawn, and from what I can tell you had nothing behind it. You must always look at what is attacked and defended. A 1 pawn lead is sufficient for a win.",
        "4... d5": "4...d5\n*************************************************************************** \nDefending my pawn, and controlling the e4 & c4 squares. I was not concerned about 5.Qh5+ g6.",
        "5. h3": "5.h3?\n*************************************************************************** \nNow the knight has no where to go. In a few moves I will go on to attack and win him. Always think, \"If my opponent attacks this piece, how do I defend? If it can't be defended, where can it move to? If I move it there, can it be attacked again?\" And so on.",
        "5... Nf6": "5...Nf6\n*************************************************************************** \nI wanted to play 5...h6, but then 6.Qh5+, chasing my king to d7. Instead 5...Nf6 will forever prevent Qh5+. ",
        "6. g4": "6.g4?\n*************************************************************************** \nYou needed to make a place for your knight to move to.",
        "6... h6": "6...h6!\n*************************************************************************** \nHe's trapped!",
        "7. Ngxe4": "7. Ngxe4\n*************************************************************************** \nThe only move.",
        "7... Nxe4": " ",
        "8. Nxe4": " ",
        "8... dxe4": " ",
        "9. Bb5": "9.Bb5\n*************************************************************************** \nPinning my knight, thereby restricting his control of the squares d4 and e5.",
        "9... Bd7": "9...Bd7\n*************************************************************************** \nUnpinning the knight.",
        "10. f4": "10.f4?\n*************************************************************************** \nYou need to get your king to safety!\nI stated previously, \"In the opening you have a constant battle to control the primary center squares, being d4, d5, e4 and e5.\" You also have a constant battle to gain development. This means you need to get your pieces out as quickly as you can, and preferably before your opponent. An army in it's original position(s) can neither defend no attack. Take a look at the final position. You finished with a bishop, and 2 rooks on their original squares and the queen also on the back rank. You lacked development, thus you could not ward off my attack. *************************************************************************** \nThere are several ways to ensure your development is good: 1. Try to avoid moving the same piece repeatedly until you complete your development. Your development is complete when you have your knights, bishops and queen off the back rank and you have castled, so your rooks are connected. 2. Make threats against your opponent. What I played 6...h6 you could not prepare to develop your bishop for example with 7.b3, since you would lose your knight. 3.Check your opponent's king with a developing move. For example, when I played 15...Bc5+, you may have wanted to play 16.Qe2, (a good developing move) but you couldn't because of my check on your king.  *************************************************************************** There are times it is okay to disregard this principle, along with all the principles of the game. This is when you have very forceful threats which your opponent can't counter effectively. For example, why think about development if you have a forced mate in 3 moves?",
        "10... Nd4": "10...Nd4\n*************************************************************************** \nA double attack on your bishop and threatening 11...Nf3+! Your bishop is needed to defend the king, so 12.Be2 was necessary.",
        "11. c4": "11.c4? \n*************************************************************************** \nSee my previous note.",
        "11... Nf3+": "11.Nf3!\n*************************************************************************** \nThe rest of the game, you are defending against my attack. If the bishop was on e2 you could just take, the knight.",
        "12. Ke2": "12.Ke2",
        "12... Bxb5": "12...Bxb5!\n*************************************************************************** \nTo open the d file to your king.\n",
        "13. cxb5": "13.cxb5",
        "13... Qd3+": "13...Qd3+\n*************************************************************************** \nSo I want to make a mating net around your king. If possible, I'd like to chase him out into the middle of the board, always a favorite technique of mine.",
        "14. Kf2": "14.Kf2",
        "14... e5": "14...e5\n*************************************************************************** \nTo open up the bishop to join in the attack!",
        "15. f5": "15.f5?\n*************************************************************************** \nYour king is in serious trouble here! You need to get your pieces out.",
        "15... Bc5+": "15...Bc5+!\n*************************************************************************** \nThe net is forming. Each move I make leaves your king less moves and squares available.",
        "16. Kg3": "16.Kg3",
        "16... Nh4+": "16...Nh4+!\n*************************************************************************** \nSo I want to entice your king to take a leisurely time away from his army, always a dangerous activity for kings in times of war. So that his highness does not need to walk, I offer him a horse to ride!",
        "17. Kxh4": "17.Kxh4\n*************************************************************************** \nRide on oh King John! If you played 17.Kh2, then I had17...Bf2 18.Qf1 Qg3#. Even still I preferred that you take the knight, since I like to have your king in the open.",
        "17... Bf2+": "17...Bf2+!\n*************************************************************************** \nChasing the king further from the troops! I also had 17...Be7. It amounts to the same thing.",
        "18. Kh5": "18.Kh5\n*************************************************************************** \nThe only move.",
        "18... Qd7": "18...Qd7\n*************************************************************************** \nPreparing for 19...Qf7#!",
        "19. g5": "19.g5\n*************************************************************************** \nTo give the king an escape route, g4.",
        "19... Qxf5": "19...Qf5\n*************************************************************************** \nBlocking off the escape. Now the threats are 20...Qxg5#, 20...hxg5# and 20...g6#. You can't stop all three threats.",
        "20. Qg4": "20.Qg4\n*************************************************************************** \nPreventing 20...Qxg5#.",
        "20... g6#": "20...g6#\n*************************************************************************** \nI also had as I mentioned 20...hxg5#.\n\nGood Game John! I hope this helped you!\nScott"
    },
    "url": "https://gameknot.com/annotation.pl/unrated-tutoring-game?gm=55697",
    "gameName": "Unrated Tutoring Game",
    "players": "jcht (1293) vs. faithfulltrav (1897)",
    "opening": "KP (B00), Colorado counter"
}