{
    "moves": {
        "1. e4": "As White, I've always preferred the closed and semi-closed openings. Closed openings start with 1. d4 d5. Semi-closed ones start with 1.d4 and black responds with some move other than 1. ... d5. The Open Game is 1.e4 e5, a Semi-Open Game (such as this one we played) is 1.e4 where black makes moves other than 1...e5. Flank openings 1.c4, 1.Nf3, 1.f4 can easily transpose into closed or semi-closed (or sometimes open or semi-open).\n***********************************************************************\nSo I like closed and semi-closed. You on the other hand are playing for the Open Game or Semi-Open Game. Which one depends on my response.\n***********************************************************************\n\nNone of these categories are better or worse for Black or White. They are more only a matter of preference. ",
        "1... e6": "So when my opponent has White and plays 1.e4, I prefer the Semi-Open game. I play the French Defense (1...e6), the Pirc Defense (pronounced \"peerts\" not \"perk\" 1...d6) or Alekhine's Defense (1...Nf6).\n\n***********************************************************************\n\nYou should study one opening at a time for at least a year and get really good at it. Then move on to study another opening. Currently, for this 12 month period (starting early July), I am studying through the French so I only respond to 1.e4 with 1...e6.\n\n***********************************************************************\n\nKey Principle: Study one opening at a time for at least a year, until you know it in and out. This does not mean you don't continue to learn other openings, but that your primary focus is on only one.",
        "2. d4": "So Chase, one reason I like the openings I mentioned (the French Defense, the Pirc Defense and Alekhine's Defense) is that in each one, Black willingly allows White to establish an imposing pawn center, with intention of attacking and destroying that center! So it's an intense debate between the 2 sides, a debate won not with words, but in tactical chess moves.\n\n***********************************************************************\n\nWhite says, \"My solid pawn center will restrict your pieces, giving me a superior position!\" Black says, \"Your pawns are weak! I'll use my pawns to destroy your weak pawn center! I will undermine those overly advanced pawns, and trade them off and gain a free open position!\" \n\n***********************************************************************\n\nIf White succeeds in keeping this \"strong\" pawn center, he will definitely have the better game. Yet, if black accomplishes his goal of undermining and / or trading off White's pawns, in my opinion, he will probably gain equality and if White is not careful, Black can gain a strong advantage.\n\n***********************************************************************\n\nOn the other hand, in the French Defense, Black willingly accepts a restricted LSB and possibly a restricted King-side. The French is fairly popular though, so obviously many people agree with me that the tactical battle which ensues makes these \"minor inconveniences\" worthwhile.",
        "2... d5": "With this move I begin to contend for the center and oppose your pawns. There are several primary responses frequently played: The main line is 3.Nc3. Black can continue with the following variations:\n\nRubinstein Variation 3...dxe4;\nWinawer Variation 3...Bb4;\nClassical Variation 3...Nf6;\n\n***********************************************************************\nIf White chooses not to play 3.Nc3 he can instead play the Exchange Variation: 3.exd5 exd5; the Advance Variation 3.e5; the Tarrasch Variation 3.Nd2.\n\nThe Advance Variation is the most aggressive, blocking in Black's LSB. Black then starts an assault on the pawns via c5 and possibly (after more preparation), f6.",
        "3. exd5": "So you chose to play the Exchange Variation: 3.exd5. Although it is sound, it lacks the intense battle or complications of some of the other variations mentioned above. Exchanging pawns on d5 removes the tension that is frequently part of this defense. Therefore, it is usually avoided by most advanced players. For this same reason though, it's probably the best line for beginners playing White against the French Defense. Until a player learns how to make in depth calculations, complications should be avoided.\n\nAn interesting note, after the pawns are exchanged, the pawn structure and overall position looks nothing like the French Defense, although it still is the French!",
        "3... exd5": "3...Qxd5(?) would give White unwarranted initiative with moves like 4.Nc3 or 4.c4. It would also leave Black without a pawn presence in the center. Thus 3...exd5.",
        "4. Nf3": "Good move developing towards the center. The knights are usually best on c3 & f3 or for Black, c6 & f6. It's also good usually to bring the knights out before the bishops, as you are doing.",
        "4... Nf6": "Ditto for me.",
        "5. Nc3": " ",
        "5... Be7": "So, the reason the knights should be out first is that you usually don't know where the bishops should be placed. If your position is such that you know where they should go, and you have a specific reason for bringing them out, then bring them out. In this case, I wanted to prevent you from pinning my king-knight with Bg5.",
        "6. Bf4": "Since Bg5 would not be a pin, I agree this is the better move. Your bishop covers more squares on f4 than g5.",
        "6... O-O": "The next string of moves, I don't annotate, because I feel you were simply making good developing moves. For my next annotation, see 10.h3.",
        "7. Bd3": " ",
        "7... Nc6": " ",
        "8. O-O": " ",
        "8... Bg4": " ",
        "9. Be5": " ",
        "9... Bd6": " ",
        "10. h3": "(?) You needed more protection on the DSB. After 11...Bxf3 12.Qxf3 you only have a pawn defending. You could have played 10.Re1.\n\n***********************************************************************\n\nSo, you had one piece defending the d4 pawn (White Move 8). I pinned that piece,(Black Move 8) so you add extra defense to the pawn (White Move 9). So I redirect my attack to the Bishop which defends the pawn (Black Move 9). \n\n***********************************************************************\n\nNow you have a pawn defending the bishop and a knight defending, but the knight is pinned, so not really. So you play 10.h3(?). I need to do something with the bishop, since you attack him. So I use him to remove the defending knight. After your queen captures, your only defense to the bishop is the pawn, while I have my bishop and knight attacking him. So I exchange on the e5 square, winning a pawn.",
        "10... Bxf3": "Remove the defender!",
        "11. Qxf3": " ",
        "11... Nxe5": "I normally prefer my bishops over knights. This is because while knights are the stronger piece in cramped, closed positions, bishops are stronger in open positions. So, you have to consider each game individually, but generally, as pieces get traded off, closed positions become open positions in the middle game and end game. As the position opens up, the bishops become stronger and stronger. So, although both pieces are technically the same value, the bishops are my piece of choice. That may be just a personal thing though, because while most strong chess players agree with me, I've met some who disagree. So here I take your bishop with my knight instead of my bishop.",
        "12. dxe5": " ",
        "12... Bxe5": "So, I have won the battle of the pawns I was speaking of on your 2nd move. Your center pawns have been eliminated and one of them was taken for free. Yet I am the one who still has a pawn in the center on d5!",
        "13. Rad1": "So my advantage is now my pawn on d5. You prepare to harass my pawn by putting your rook on the file. In addition, in doing this, you also brought your rook to the center, to a semi open file (which would be completely open if you win that pawn). Rooks are better in the center than they are on the edge on the board. They are best on open files, 2nd best on semi open files and least effective on closed files.",
        "13... c6": "So I solidify his stronghold! In addition, I am putting my pawns on light colored squares. This is because we have opposite color bishops; you have a LSB, I have a DSB. So in putting my pawns on light squares, I give my bishop more freedom and restrict your bishop. This move also opens another line of attack for my queen along the d8 a5 diagonal. At this point I am considering Qb6 to attack the Pawn on b2 or Qa5 to bolster the bishops attack on your knight. I am also considering Bc7, followed by Qd6, to attack your king.",
        "14. Rfe1": "Now you bring your other rook to a completely open file. Good for you. You now have both rooks on central squares, and one of them on a an open file! The fact that I have a Bishop on that file does not mean it is semi-open. Whether a file is open, semi-open or closed is determined by pawns.\n\n***********************************************************************\n\nIn addition you are attacking my bishop, so I must attend to that.",
        "14... Re8": "Defending the Bishop, while bringing a rook to the center, open file. I wanted to play Bc7 followed by Qd6. The problem with that is, you are ahead in development with your 2 central rooks. My rooks are still on their original squares. I needed to develop also, before I attempt to develop an attack.",
        "15. a4": "15.a4(?) A valiant attempt at some queen-side action, but this makes it hard to defend your b-pawn. After 15...Qb6, if you chose to defend the pawn, you need to play 16.Rb1. Then I would play 16...Qb4, increasing my attack on your Knight. If you play 17.Nd1, your previously coordinated pieces become somewhat spastic. Your rooks are no longer connected, and you have a knight on the back rank.\n\n***********************************************************************\n\nIf instead, you play 16.Bf4 or 16.Bf1 to defend the knight with your queen, I can play 16...Bxc3 followed by Qxa4., winning a 2nd pawn.",
        "15... Qb6": "Attack!",
        "16. Ne2": "So you chose to give me the pawn. I was thinking you may have been planning 16...Bxb2 17.Rb1 then following up with a attack on the pinned bishop. I would have played 17...Qb4. It will take some time to get your other artillery over to the queen-side, this would give me time to play Qa3, removing the pin, b6 to close your attack on the b-file and then moving my bishop back. \n\n***********************************************************************\n\nI would not play 16...Qxb2 as you get too much counter-play with 17.Rb1 Qa6 18.Rxb7 Qxa4 19.Reb1.",
        "16... Bxb2": "My 2nd free pawn.",
        "17. Nf4": " ",
        "17... Qb4": "Threatening 18...Rxe1, so you need to either move the rook off the open file or trade. With my material lead, trading is good for me, while if you move off the file you weaken your position.",
        "18. Rxe8+": "And trade you did!",
        "18... Rxe8": "Again my threat, 19...Re1+.",
        "19. Rb1": "19.Rb1(!?). Of course this does nothing for you since I am about to force the trade with the rook check.",
        "19... Re1+": " ",
        "20. Rxe1": " ",
        "20... Qxe1+": "So the reason it is to my advantage to trade is that if we trade off all equal material, it will leave me with a 2 pawn lead in the end game.",
        "21. Kh2": " ",
        "21... Ne4": "Now there is no way to defend the f-pawn, unless you want to play 22.Bxe4. I did not have mate formulated in my mind yet, so I want to win pawns to get the greatest advantage in the end-game.  \n\n***********************************************************************\n\nBe careful though when you go grabbing pawns, that you don't leave your king or other pieces in a precarious position. Notice, each time I take a pawn, you have no means of retaliation.",
        "22. Nh5": "With this move of yours, I am starting to plan how to mate you. I am attempting to form a net around your king. I just spoke of how I wanted to trade, and 2 moves ago, I would have accepted a queen trade gladly. Yet now since I was seeing mate in the near future, (though not yet worked out in detail), I did not want to trade queens. I was sure she would be helpful in the mate process. Currently, your king has no squares he can move to. Yet, since I plan to capture the f-pawn with my knight, the king will have g3 as escape hatch. Soooo...",
        "22... Be5+": " 22...Be5+ cuts off the kings access to g3.",
        "23. Ng3": "You sent me a message to say you should have blocked the check with 23.g6. Well that would have stopped this particular mate, I would go into the end game with a 3 pawn lead. That is more than enough for a win.",
        "23... Nxf2": "Obviously you saw the mate threat, 24...Qh1# (the knight is pinned), or you would not have sacked your bishop.",
        "24. Bxh7+": "You are prolonging your agony! Just kidding, I actually always suggest people I mentor play the games out as still there may be things I can teach.",
        "24... Kf8": "Taking the bishop would have the same results, it would just take longer. 25...Kxh7 26.Qf5+ (not 26.Qh5 Kg1 and no more checks for white) Kh6 (not 26...Kh8 or 26...Kg8 as white would have 27.Qc8+, delaying things further) and the white queen has no more checks.",
        "25. Qxf2": " ",
        "25... Qxf2": "Now the mate threat is (as I'm sure you know) 26....Bxg3 27.Kh1 Qf1#. It's been good Chase, thanks for the game!"
    },
    "url": "https://gameknot.com/annotation.pl/unrated-french-defense-game-for-tutoring-purposes?gm=40308",
    "gameName": "Unrated French Defense Game for Tutoring Purposes",
    "players": "iceclaw35 (1184) vs. faithfulltrav (1771)",
    "opening": "French (C01), exchange, Svenonius variation"
}