{
    "moves": {
        "1. g4": "Hi everyone!\n\nThis game came from Dennis Hebblnyck's THEM Tournaments, which are a correspondence chess site which is not related to Gameknot.  This game is THEM27-34 FRITZ GAMBIT (known as The Grob on Gameknot).  My opponent is Guy Shelmerdine.  Because of the involvement in the Club I ended up taking too long over responding to Guy's moves.  Thankfully Guy decided to join Gameknot and we finished our games on Gameknot.  This is the first of a best of two.  I won by 1.5 - 0.5 on aggregate.  So, I kick off with the thematic 1. g4 of which my opponent responds d5 and I play Bg2 and my opponent then takes on g4.",
        "1... d5 2. Bg2 Bxg4 3. c4": "3. c4 - I decided to undermine the pawn on d5 and black defends with Nf6.",
        "3... Nf6 4. cxd5 Nxd5": "4. ..... Nxd5 - pawn trade.",
        "5. Nc3 c6 6. Nxd5 cxd5": "6. ...... cxd5 pawn trade.",
        "7. Qb3": "7. Qb3 - I now decide to put pressure on b7.  Guy then makes a big mistake.  Glenda has been eyeing up the square a4 and has been itching to fork the BK and the bishop on g4.  However, that prelate or the Witch can interpose on d7 and either way the bishop is protected.  However ......",
        "7... e6": "1. ..... e6 ?? - this move blocks that diagonal.  There is no way for black to play those moves which will avoid being a piece for pawn down.  Now Glenda takes a jump to the left and then six steps to the right and the black prelate on g4 finds himself doing that timewarp in the sky!",
        "8. Qa4+ Nc6 9. Qxg4 Bc5": "9. ..... Bc5 - black keeps his king upright and puts up a terrific fight for another 30 moves or so.  As he has decided to play on, he must get his pieces out asap and mount an attack on Henry.  I must be alert to this and clear my own decks as quickly as possible.",
        "10. Nf3 O-O 11. a3": "11. a3 - to prevent Nb4.",
        "11... Qf6 12. O-O": "12. 0-0 - now Henry gets tucked away on the kingside.  Guy gives me the chance to start trading pieces.  This will take me one step nearer to the endgame.",
        "12... Ne5 13. Nxe5 Qxe5 14. e3": "14. e3 - threat - d4.",
        "14... f5 15. Qa4 Qf6 16. d4": "16. d4 - I play it anyway - Fou Lenoir must have a square to develop to so that I can connect my rooks.",
        "16... Bd6 17. Bd2 a6 18. Bb4": "18. Bb4 - looking to force another trade.",
        "18... b5 19. Qb3 Qe7 20. Bxd6 Qxd6": "20. ..... Qxd6 - mission accomplished.",
        "21. Rac1 Rac8 22. Qd3 g5 23. Qd2": "23. Qd2 - I now give myself an opportunity to trade off the rooks.",
        "23... h6 24. Rxc8 Rxc8 25. Rc1 Rc4 26. Rxc4 bxc4": "26. .... bxc4 - the rooks have been traded off, but I am going to have to work very hard to avoid throwing away the win here.",
        "27. Qa5 Kf7 28. Bf3 g4 29. Bd1": "29. Bd1 - I am taking a risk here.  Henry could still cop Old Matey even in this endgame.  All the Witch needs is a few black pawns and even the BK to help her, so I must still take care.  However, I have to do something else black may be able to get away with a draw.",
        "29... h5 30. Qc5": "30. Qc5 - I am even prepared to get an isolani to get those queens off the board.  If I do it is only a matter of time.",
        "30... Qb8 31. Qb4 Qc7": "31. ..... Qc7 - still no trade.",
        "32. Ba4 h4 33. Qc5": "33. Qc5 - I am planning to put Glenda on c6 threatening the pawn on a6 and a check on e8.  This plan now entices/forces Guy to trade off the queens.",
        "33... Qxc5 34. dxc5 Ke7 35. Kg2 e5": "35.  ..... e5 - black is still trying to get a passer on the d file, I must be careful.",
        "36. Bc2 f4 37. exf4 exf4": "37. ..... exf4 - pawn trade.",
        "38. Bf5 g3 39. fxg3 fxg3 40. hxg3 hxg3 41. Kxg3": "41. Kxg3 - now all the kingside pawns have been liquidated, Henry rushes towards the centre of the board.",
        "41... d4 42. Kf4": "42. Kf4 - Henry has caught the smell of his favourite nosh!  P(r)awns!  He wants them with piri-piri sauce today!",
        "42... d3 43. Bg4 Kd8 44. Ke4": "44. Ke4 - Henry is gonna clean up those juicy p(r)awns on c4 and d3.  Guy sees this and waves the white flag.  In our next game, Guy gets his revenge."
    },
    "url": "https://gameknot.com/annotation.pl/unusual-opening-grobs-attack-a00-part-2?gm=49132",
    "gameName": "Unusual Opening - Grob's attack (A00) Part 2",
    "players": "jstevens1 (1938) vs. chessmaniac51 (1200)",
    "opening": "Grob (A00), Fritz gambit"
}