{
    "moves": {
        "1. e4 e5": "A fun game against a friend, I play black and build a crushing pawn advantage on the queenside, then screw it all up and watch it go up in smoke.",
        "2. Nc3 Nc6": "White chose the Vienna Game and I responded with the Max Lange Defense.",
        "3. g3 Nf6": "3. g3 is known as the Paulsen Variation, and my reply breaks from the main lines - from here I'm exploring new ground (new to me anyway, and not much in the Game DB).",
        "4. d3 d5": "Charging into the center.",
        "5. Bg2 d4": "Charging more.",
        "6. Nce2 Bb4+": "At this point I feel like black is doing well. 3 pieces developed to only 2 for white, and a more open and mobile position.",
        "7. Bd2 Qd6": "Trying to play by opening principles of not moving any piece twice unless I have to. I felt that taking white's bishop removes one of my developed pieces and puts the white queen on a stronger square. Also, this move sets a bit of a trap. White shouldn't exchange bishops.",
        "8. Bxb4 Qxb4+": "But he did.",
        "9. c3 Qxb2": "And now it cost white a pawn and a second white pawn is in danger.",
        "10. cxd4 Nxd4 11. Nxd4 Qxd4": "A little bit of center liquidation. At this point, only 11 moves into the game, I'm already thinking about exchanging away as many white pieces as I can so that I can exploit my queenside pawn majority.",
        "12. Nf3 Qc3+ 13. Nd2 Qxd3": "A small blunder by white. None of his options were great. Moving his king limits his castling ability, but was his best choice. Blocking with his queen loses the white rook on a1. But the move played loses the white pawn on d3.",
        "14. Rc1 c6 15. Nc4 Qxd1+": "Up by two pawns, with a 3 to 1 advantage on the queenside, the only thing standing between me and an easy win is all the white pieces. Fortunately, white seems willing to trade them off.",
        "16. Rxd1 Be6 17. Nxe5 Bxa2": "Now a 3 to 0 advantage on the queenside, with three supported adjacent passed pawns. There is absolutely no way for black to fail to promote one ore more of these lucky pawns, right?",
        "18. O-O O-O 19. Rd2 Be6": "I think 19. Nd7 would have been strong for white. I wouldn't want him to take my knight on f6 and break up my pawn formation when he has a 4 to 3 advantage and open up my king to all of his pieces on the kingside. Which means I would have played 19. ... Nxd7 which would allow him to get a rook on the 7th rank and create problems for my queenside pawns. White didn't do it, and now I prevent it with 19. ... Be6.",
        "20. Rb1 Rfd8": "Here I miscalculate. I had a sneaky plan of putting white in check on the back rank and then pinning the white bishop after he blocks, then winning it by attacking the pinned bishop with my own bishop. It was not until after I had committed to this foolhardy plan that I realized there was no way I could complete that plan before white could play Kg2. Fortunately, I had a fallback plan, but I am still doomed to watching most of my queenside advantage go up in smoke.",
        "21. Rxd8+ Rxd8 22. Rxb7 Rd1+ 23. Bf1 g6": "I was facing a checkmate in 1 and I have no good attacks against white. I make a hole that is the opposite color of the only white bishop and that his knight can never threaten without facing a pawn capture, or blocking his rook on the 8th rank. I am thinking about 24. ... Ng5 which then trades knights and allows me to play Be2 to win the white bishop or which chases the knight away allowing Bc4 to win the white bishop - but I doubt white will allow this.",
        "24. Kg2 Nxe4 25. Rxa7 Bd5": "My careless plan on my 20th move cost me a pawn and decimated my queenside advantage. At least I am well poised for an attack. This move threatens to win the white bishop with Nd2 ",
        "26. f3 Ng5": "Threatens to win a pawn. It looks to be fully protected but it is not.",
        "27. g4 Nxf3": "White believed his pawn was safe but I showed him the error in his logic. Now if 28. Nxf3 Bxf3  and black has still won the pawn and has exchanged some of white dwindling material. If 29. Kxf3 Rxf1  and black has still won the pawn and has exchanged even more material.",
        "28. Kf2 Nxe5": "White realized he didn't want to exchange material, so he chose not to pursue the exchange(s), but then he forgot that his knight was en prise.",
        "29. g5 Ng4+": "Now comes a series of pretty knight moves, starting with check and a fork. White cannot save both his pawn on h2 and his bishop on f1 at this point - one of them will die.",
        "30. Ke2 Rc1": "I only need to move one space - if white follows, he loses his bishop.",
        "31. h3 Nh2": "31. h3 was the wrong move for white. His bishop on f1 is now attacked twice and has nowhere to run.",
        "32. Ra8+ Kg7": "The stall is no threat to black.",
        "33. Kf2 Nxf1": "Final position. White has had enough."
    },
    "url": "https://gameknot.com/annotation.pl/up-in-smoke?gm=21478",
    "gameName": "Up in Smoke",
    "players": "remohgramps (1117) vs. blake84120 (1495)",
    "opening": "Vienna (C25), Paulsen variation"
}