{
    "moves": {
        "1. d4": "Hi everyone!\r\n\r\nHad a duel with the Master Mater I would much rather forget, but I must see if I can learn something from this - the only recurring theme seems to be that I tend to get rid of my opponent's pawns only to find myself in a killer pin - ouch and double ouch!  This is the Kings Indian Defense 4 pawns attack opening which is a thematic tournament.  The non-set up moves start on move 6 where I played Nf3 which is the main line in the World DB.",
        "1... Nf6 2. c4 g6 3. Nc3 Bg7 4. e4 d6 5. f4 O-O 6. Nf3 a6": "6. ........ a6 - this little pawn move prepares a pawn roll down the queenside beginning with b5.  Very reminiscent of a Sicilian Dragon/Naijdorf setup later on with both sides castling on opposite sides.  Well, I don't even get started on my attack.",
        "7. Bd3 Bg4 8. Be3 Nfd7": "8. ...... Nfd7 - opening up the f column for a possible Hoover Dam busting f5.  Yup it does get busted and the only thing that is gonna get sucked up Freddy's Numatic Henry HVR200 (http://www.electrocentreltd.com/viewproduct.asp?pid=5140) is King Henry!\r\n \r\n \r\n",
        "9. h3 Bxf3 10. Qxf3": "10. Qxf3 - white's position looks perfectly OK at this point, but appearances can be very deceptive.",
        "10... Nc6 11. Qf2": "11. Qf2 - Glenda adds some extra defence (as usual) to the weak link in the dam, the d4 pawn.",
        "11... e5": "11. ....... e5 - the Dambuster!",
        "12. dxe5 dxe5 13. f5": "13. f5 - recommended in the DB.",
        "13... Nd4 14. O-O-O": "14. 0-0-0 - this move was played in the World DB but in retrospect I think I should have castled short here.  Do you the Inquest Jury agree?",
        "14... b5 15. cxb5": "15. cxb5 - a deviation from the db but is it a good one?",
        "15... axb5 16. Kb1 c6 17. b3 Nc5 18. Qb2 Ndxb3 19. Bxb5": "19. Bxb5?? - here Freddy suggested fxg6.  I was expecting cxb5, axb3 but I was just sooo green, soooo bally green!  I completely overlooked the deadly Nd4.",
        "19... Nd4 20. Bxc6": "20. Bxc6 - walking into a pin but there seemed nothing better.",
        "20... Rb8 21. Bb5 Qa5": "21. ...... Qa5 - piling up on Fou Leblanc and that poor prelate just hasn't got a prayer!",
        "22. fxg6": "22. fxg6 - too little too late.  As it looks as though I will drop a piece I might as well try and get rid of as many black pawns as possible.  Alas, the damage will be much greater than a piece as I am just about to find out......",
        "22... Nxb5 23. gxf7+ Kh8": "23. ...... Kh8 - quiet move before the storm.",
        "24. Kc2": "24. Kc2?? - I play this move overlooking Nd4+ winning Glenda.  I only see it after I pressed the submit button.  You cannot expect the Master Mater to miss this tactic can you?  So I decided to wave the white flag and give Freddy his deserved victory. A sorry (white) picture.  You can safely say here, Coach Ion, that my tactics were well and truly up the Swanney - Joanne"
    },
    "url": "https://gameknot.com/annotation.pl/up-the-swanney?gm=29592",
    "gameName": "Up the Swanney!",
    "players": "jstevens1 (1771) vs. easy19 (2279)",
    "opening": "King's Indian (E76), Four pawns attack, dynamic line"
}