{
    "moves": {
        "1. e4 e5 2. Nf3 Nf6": "Opting for a Russian opening.",
        "3. Nxe5 d6 4. Nf3 Nxe4 5. d4 d5": "This is the most common line in the Russian Opening. By moving his pawn a second time, Black opens up- the otherwise closed f8-bishop, and cements his knight on e4 for the foreseeable future.",
        "6. Bd3": "As chess 'law' dictates, bombarding the outpost with all force possible.",
        "6... Be7": "This move is very rarely played now, since 6...Be6 just offers up so many more active options. As we will see, the e7-bishop becomes a heavy burden.....",
        "7. O-O Nc6 8. c4": "Now we see Black having his only central pawn - crucial to the defence of the e4-knight - being undermined.",
        "8... Nb4": "Black decides to remove a dangerous piece, but note he could have developed further here.",
        "9. cxd5": "White decides to lure the queens into play, but you will now see the e5-square become ridiculously weak, a feature that wouldn't be present in this game if Black had played 6...Bd6\n",
        "9... Nxd3 10. Qxd3 Qxd5 11. Re1": "If the Black knight moves, then the e7-bishop is tied down, and the pin is transferred to another of Black's pieces, a 'pin on a pin' if you will!",
        "11... Bf5": "Despite looking great, this move does little. The knight can be easily exchanged off of e4, and the e-file control of White means that Black can't castle, else he face material catastrophe.",
        "12. Nc3 Nxc3 13. Qxc3": "Here, Black is already losing. It may seem a slightly worse position, but the c7-pawn is the burden here. After Bisguier moved him, hell was unleashed. Note the features of the board however, the e-file is lost on Black, most notably e5, and the repercussion of a fork on e5 is brutal. Also, Black can't castle thanks to the pin on e7, and this tied down piece means that White is in essence a piece up.",
        "13... c6": "Wholly logical in appearance, and certainly an excusable move, but watch what happens! \n(13...Be6?! is recommended here to prevent severe positional downsides.) ",
        "14. Bh6": "(!!) Dubbed the move of the century, this is certainly Walter Browne's finest moment! After spending 40 minutes, staring at the board, several grandmasters watching the game were astounded that Browne was taking so long on such a relatively common line! Despite looking bizarre on every level, the analysis explains itself.\nIf Bisguier plays the face-value 14...gxh6, it will turn out that this is bad after 15. Re5 Qd7 16. Rad1 Be6 17. d5!... (freeing the crucial c3-h8 diagonal) ...cxd5 18. Rxe6! fxe6 19. Qxh8+ Bf8 20. Qf6 Be7 21. Rxe6 +/- With a won position. Bisguier saw this, and played the best if not too successful line.\nAnother variation is -\n14...gxh6 15 Re5 Qd6 16. Rxf5 0-0 17. Re1 Qg6 18. Rf4 Bd6 19. Rfe4... +/-\n ",
        "14... Rg8": "To prevent a loss in material, black covers up the g7-pawn. Now, White makes expert use of the e-file and makes clear that the e7-bishop is a setback.\n14...Be4 15. Bxg7 Rg8 16. Bf6! Bxf6 (16...Bxf3 17. Rxe7+ Kf8 18. g3 Bh1 19. f3... +/- ) 17. Rxe4+ Qxe4 18. Re1 ... +/-\n\n",
        "15. Re5 Qd7 16. Rae1 Be6": "Here, we see the activity of White's pieces is thanks to constant tempo-winning moves, all his pieces are developed (with the Bh6 being the oddity!) and when compared to Black's pinned e6-bishop, a rook on g8 forced to cover the g7-pawn and the queen with no strong squares to choose from - things are looking bleak for Bisguier.",
        "17. Ng5": "(!) Threatening the deadly 18. Nxf7!... Note how if Black now plays 18...Bxg5 then 19.Bxg5... strands the Black king in a precarious centre. \n(19...f6? 20. Rxe6... +/- ) \n17...Bf6 18. Nxe6 Bxe5 19. Nc5... +/-\n17...gxh6 18. Nxe6 fxe6 19. Rxe6 Rg7 20. d5! Kf8 21. Qxg7+! Kxg7 22. Rxe7+ Qxe7 23. Rxe7+... +/-\n17...Bxg5 18. Bxg5 h6 19. Bh4 g5 20. Bg3 Kf8 21. Rxe6! fxe6 22. d5 +/- \n\nBrowne was apparently just as proud about 17.Ng5!... as he was about 14.Bh6!!... ",
        "17... O-O-O": "Several chess engines see this as the only move capable of even slightly holding the position here.",
        "18. Nxf7": "(!) Here follows a combination that takes Browne into a won endgame.",
        "18... Bxf7 19. Re5xe7 Qxd4 20. Rxf7 Qxc3 21. bxc3 gxh6": "Note how now, White has a kingside majority of pawns, including the passed f-pawn. His isolated queenside pawns are slightly weak, but are strong enough to stave off the advances of the a,b and c-pawns that Black boasts for a respectable amount of time. Black's doubled h-pawns mean he is effectively a pawn down here. After White gives his king an escape square, White could cause havoc on the 7th rank.",
        "22. Rb1 Rg5 23. h4": "(!) Simultaneously gives his king a flight square and gains a tempo, as well as starting to block up Black's kingside pawns.",
        "23... Rb5": "The only move that doesn't cause complications for Black. The b7-pawn was a strong target for White.",
        "24. Rxb5 cxb5 25. Rxh7": "Now White proceeds to remove the obstacles to give himself a deciding majority.",
        "25... Rd1+": "Black has meagre chances, with his pawns far away from reaching a queening square, but his best shot is to attack the isolated pawns and forge a path for his own.",
        "26. Kh2 Rd2": "Which pawn is more valuable? It doesn't really matter to White!",
        "27. Rxh6": "With three passed pawns, White has a won position. ",
        "27... Rxa2": "Despite the f-pawn being dangerous, Black NEEDS to create his own passed pawn here.",
        "28. h5": "(!) Browne knows his endgames, as a rule is :  \"Small material advantages [pawns] in rook endgames have little/no effect.\" If Black takes on f2, White can force his h-pawn further and further. ",
        "28... Rxf2 29. Rh8+ Kc7 30. h6": "The threat to Black is near.",
        "30... Kb6 31. Kh3": "Both players spend a tempo on advancing their king. White safeguards the g4 and h4-squares, whereas Black needs to support his pawns. ",
        "31... a5 32. g4": "White sends a friend to help the h-pawn. Both kings are situated as such that they can't be checked, so both players march.",
        "32... b4 33. cxb4 axb4": "White knows the pawn has no effect on his chances of winning!",
        "34. Re8": "(!) An excellent move that provides White with access to a check, or to both of the b-pawns!",
        "34... Rf1": "(Threatening 35...Rh1+)",
        "35. Kg2 Rf7": "Black now has to stop the advance, meaning his rook is tied up.",
        "36. g5 Rf5 37. h7": "Black is now torn apart, his rook is no longer capable of halting the pawn from promoting, so he must exchange to save himself. ",
        "37... Rxg5+ 38. Kf3": "This move is obvious but crucial, as it brings the king one square closer to the b4-pawn.",
        "38... Rh5 39. h8=Q Rxh8 40. Rxh8": "Now thanks to Black's doubled pawns, each will be captured due to their inability to work together. Bisguier resigned here. A fantastic game which shows - Move loyalty is what makes chess grandmasters."
    },
    "url": "https://gameknot.com/annotation.pl/us-championship-1974-with-move-of-the-century?gm=56201",
    "gameName": "US Championship 1974 (with 'MOVE OF THE CENTURY!')",
    "players": "Walter Shawne Browne  vs. Arthur Bisguier ",
    "opening": "Petrov (C42), classical attack, Jaenisch variation"
}