{
    "moves": {
        "1. d4": "My coach (a class A player coached by an IM), had previously gone over a few solid lines against d4 openings, which I took into consideration, so I was happy to see this for the first time all tournament.",
        "1... d5 2. c4 e6 3. Nf3 Nf6 4. g3 Be7 5. Bg2 O-O": "This is a line in the closed catalan so far.  Usually white follows with 6. O-O",
        "6. Qc2 Re8": "As long as the f6 knight guards h7 there should be no Ng5 funny business.",
        "7. cxd5 exd5": "This simplification in the center equalizes for black I believe for after ...c6, there are no easily exploitable pawn weaknesses to focus on and the white lsb loses it's powerful scope, meanwhile the black bishop pair is liberated.",
        "8. Nc3 c6 9. Bg5": "White wants to play e3 but doesn't want to lock in the dsb.  He could have carried out this plan after castling, which I believe the better course, considering my rook on the half open e file.",
        "9... Nbd7": "A very flexible, thematic knight move, seen also in the QGD tartakower variation.",
        "10. e3 h6": "Objectively a fine idea, putting the question to the bishop in hopes of gaining the bishop pair.  White doesn't want to retreat as he will then lose his bishop for two pawns without much hope of attack because of lack of development on the KS.",
        "11. Bxf6 Nxf6": "Not 10...Bxf6, locking the dsb on the KS where the pawn structure inhibits its movement.  Now the knight reinforces e4., wish should become a target for the black pieces.  Black might be slightly better out of the opening.",
        "12. Rd1 Ne4": "I decide to play aggressively, and calculated just enough to know this was a sound move with immediate control where I wanted it.  13. Nxe4? is bad because of ...dxe4 and after the knight moves the bishop will play to b4, with some dynamic attacking chances for black.",
        "13. O-O f5": "Reinforcing the knight and e4 in general.",
        "14. Nd2": "Attempting to eliminate the pesky knight without losing tempo.",
        "14... Bb4": "a3? loses to ...Nxc3",
        "15. Rde1": "?! We can already see that white misplaced his rook earlier, but it doesn't belong on e1 either.  Now it blocks the access of the king's rook, optimally it should be placed on the half open c file and white should strive to push his a and b pawns to try to force a weakness in the black pawn chain.  This increases tension in the pin.",
        "15... Qa5 16. Ncb1 Bd7": "Black has clearly shifted focus from the KS with his early knight maneauver to chances on the QS, as this move activates the queen's rook and guards the c pawn so that there may be advances on the QS.  Black doesn't want to give white counter chances by ignoring his development on the QS.  Simplifying with the exchange in order to grab the a pawn is also a bad idea as white gets more than enough in positional factors.",
        "17. f3 Nf6 18. a3 Bd6 19. e4": "Here white has successfully parried black's attack, and returend by grabbing tempi and space, ultimately coming to contest e4 with lots of pressure.",
        "19... fxe4 20. fxe4 dxe4": "e5 with a fork was threatened.  ",
        "21. Nxe4 Nxe4 22. Bxe4 Kh8": "Now white has proven his rooks to be placed well on the f and e files.  Black has been pushed back a bit, and his queen perhaps is a little awkward, though so too is white's knight.  I would assess this as about equal, because of the bishop pair and the fact that both open files can still be contested easily.",
        "23. Nc3 Bh3": "Trying to gain time.",
        "24. Rf7": "An active response that postes a threat of its own, although this was surely in mind when the bishop was on d7 as it would then buy a tempo.",
        "24... Qb6": "Defending b7 and attacking the pinned isolated pawn on d4, which should be black's focus now. White may soon be in trouble if he is not careful.",
        "25. Qd2 Ref8": "Contesting the key open f file, I suppose ...Rad8 was also possible so that the   sacrificial    ... Bxg3 becomes possible",
        "26. Rxf8+ Rxf8": "The exchange was almost forced as Rd7?! leads to Be5! and black is having everything his way.  The game has now swayed in black's favor and he should be able to come in with an advantage in the endgame.",
        "27. Bg2": "Giving up the good lsb bishop to avoid complications",
        "27... Bxg2 28. Kxg2 Qd8": "?!  This I remember was a horribly passive consolidation move made under lower time, it gives away the majority of black's advantage, although it has the idea of ...Bc5.  It also avoids Na4, attacking the queen.",
        "29. Ne4 Bc7": "Threatening ...Ba4 b4 ...Bb6, or even ...Qd5 with a comfortable pin on the knight",
        "30. Nc5 Qd5+ 31. Kg1 Bb6": "Black regains some semblance of an attack",
        "32. Re5": "The only active defense that covers both the knight, pawn and queen indirectly.  b4 would have been weakening to the a pawn but would also have covered the bases",
        "32... Qf3 33. Qe2": "This should essentially be offering a draw, and black should have tried to press on with Qf6, but he hardly has any initiative.  If ...Bxc5 there are two responses dxc5 (bad for black because it restricts the QS pawns) and the other is better for black with Qxf3 ...Rxf3 dxc5 ...Rb3.  Even with the isolated d pawn, white should have a draw",
        "33... Qxe2 34. Rxe2 Rd8": "Keeping some life in the position, hoping for Nxb7?",
        "35. Re4": "??  As mentioned before, I was getting low on time (almost half hour lower than my opponent by this point as my notation shows)  and missed the temporary sacrifice that wins this game almost outright ...Rxd4!  I am considerably more tactically inclined than I was at the time of this game, and this being my first chance to review it besides the immediate post mortem with my coach, I finally see some glimmer of hope for black.  ...Rxd4, Rxd4 Bxc5!!  and the rook is pinned to the king and will be lost as no pawn can defend it.  If not Rxd4 then the rook must move and the knight should be lost to the pin immediately.  I literally almost just pulled my hair out annotating this >.<",
        "35... Bxc5": "??  Horribly frustrated with myself",
        "36. dxc5": "As a lower rated player I suppose I was trying to just be safe, but black had the win for sure with the rook sac.  Now white has connected his pawns, and this is a drawn Rook v Rook ending, that becomes just that.",
        "36... Kg8 37. Kf2 Rd2+ 38. Re2 Rd5": "I calculated this to fight on for a try at the win, even though I was low on time",
        "39. b4 Kf7": "Key to preventing any Re7 ideas",
        "40. Kf3": "Preventing similar ...Rd3 ideas",
        "40... a5": "! An interesting pawn sac.  maybe ...b6 was a better try for black, but this has the same idea of fracturing the chain to try to pick apart at the resulting weakness.  I played this idea in an earlier game in the tournament with good intentions but blundered elsewhere to lose the game to an 1800.",
        "41. h3 axb4": "Draw offered by black",
        "42. axb4 Kf6 43. g4": "Preventing Rf5+ with the idea of gaining a route of penetration or repelling the white king to a useless square",
        "43... Rd3+ 44. Kg2 Rb3 45. Re4 Rb2+ 46. Kg1 Rb1+ 47. Kf2 g5 48. Kg2 Rb2+ 49. Kf3 Rb3+ 50. Kg2 Rb2+": "Draw Agreed, white cannot leave his h pawn to hang in order to continue the game, and black doesn't want white's king to contribute to the endgame efforts.  I had a little under 5 minutes left on my clock here.  A back and forth kind of game, hope it was somewhat interesting.  Please comment if I missed something, I only spent about an hour or so on this so I'd appreciate the help.  Thanks!"
    },
    "url": "https://gameknot.com/annotation.pl/us-national-scholastic-championship-round-5?gm=40478",
    "gameName": "US National Scholastic Championship Round 5",
    "players": "James Thomas Moresco (1589) vs. Ryan Murphy (1253)",
    "opening": "QGD Slav (D30)"
}