{
    "moves": {
        "1. e4 c5": "This is an appropriate response. I did it in about 2 of my games.",
        "2. Nf3": "Nc3 might have focused on the center even better, but this still helps in future positions.",
        "2... Nc6": "A normal response puting pressure on d4.",
        "3. b3": "Fiancetto? was that my plan. Or bishop A3?",
        "3... Nf6": "Nc3 would help fiencettoing, and put all four knights out in a nice way. His fine position helped mine.",
        "4. Nc3": "Yep. ",
        "4... d6": "These past moves are what I call a \"double development.\" The pawns are out there. Plus it gets ready to launch other minor pieces.",
        "5. Bb5": "This is, \"a ruy lopez two moves later.\"",
        "5... Bd7": "Many of you probably do that. The only problem is it must stay there pinned for position.",
        "6. Bb2": "I have my favorite pieces left on the first rank.",
        "6... e6": "D5 has pressure for a fight I would not win.",
        "7. Bxc6": "This may have not been wise, but my bishop would stay there anyways.",
        "7... Bxc6 8. d3": "I needed one more piece in able to make e4 safe. This just completely changes the look of the board too. Closed to open in one move.",
        "8... Be7 9. Qe2": "Left open for any direction of castling",
        "9... e5": "I was pushing on e5, so he needed to block it.",
        "10. O-O-O O-O": "And with that, we both castled and made a change again.",
        "11. h3": "I don't have a clue what I was thinking there. Maybe I didn't think I had good options so I wasted a move. ",
        "11... b5 12. Rhe1": "I needed to break my rooks through to do some damage.",
        "12... b4": "My knight was in trouble. I couldn't believe that I responded Nb1! It WAS a good option though.",
        "13. Nb1 Qa5": "I played Soumya Kalkarni, (920) the game before. She tried to break in the sides too. That game ended I lost. It is a good plan. ",
        "14. a4": "I was risking en passant, but it was the only way to stop  a pawn and position loss.",
        "14... Rfe8": "Someone who watches this game, please explain this move to me.",
        "15. Nbd2": "I was trying to advance, not retreat.",
        "15... Rad8": "Pushing on d5, obviosly",
        "16. g3": "Now I remember; my plan was to advance the free pawns.",
        "16... d5": "Now we started the major exchange on d5.",
        "17. exd5 Rxd5 18. Nc4": "That change sure opened the position.",
        "18... Qa6": "Next I charged at the free E5 pawn, 4 of my players on it.",
        "19. Bxe5": "next he pins me good.",
        "19... Bd6 20. Nxd6": "But I come away safe!",
        "20... Rxd6 21. Qd2": "A rook in the pin defended three ways puts more pressure on him. I control the E file now!",
        "21... Rdd8": "His rook is no longer safe there",
        "22. Bxf6 gxf6 23. Rxe8+ Rxe8": "Now that we exchanged, we get down to the endgame pretty fast. But it lasts a long time.",
        "24. Re1 Rxe1+ 25. Nxe1": "It was currently in a draw position, but i thought I could still win.",
        "25... Qb7 26. h4": "Moving my pawns.",
        "26... Kg7": "My queen could now not come in. It took me a while to advance.",
        "27. Qf4 Qa6": "I was wondering, \"what is he doing there?\"",
        "28. Qc4": "Going for a pawn or a queen trade, less wanted, or likely.",
        "28... Qa5": "I knew it. He couldn't go for it.",
        "29. Qg4+ Kf8 30. Qc8+ Be8": "Now I had him pinned! Later I get his bishop.",
        "31. Kb2 Qb6 32. Ng2 Qd6": "Now he invades.",
        "33. Ka2 Qd4 34. Qa8": "I just gave him a free pawn. But by this point there were only 9 minute on my clock.",
        "34... Qc3 35. Qxa7 Qxc2+ 36. Ka1 Qxf2 37. Qa8 Qxg3": "Oh no! I was losing all my pawns; A weakness I have in the endgame.",
        "38. Qd5 Qf2 39. Qd6+ Kg7 40. Qd5 Qc2 41. a5": "Distracting him with a promotion run.",
        "41... Bb5 42. Qf3 Bxd3 43. Qg3+ Kf8": "I was going to call 3 move repetition. After I forced it. But it didn't work out. Kh6 was there to go.",
        "44. Qb8+ Kg7 45. Qg3+ Bg6": "That was also an option.",
        "46. Qe1 Qxb3 47. Nf4 Bf5 48. Qg1+ Kf8 49. Qxc5+": "And here I when it happened: A free bishop!",
        "49... Ke8 50. Qxf5 Qa3+ 51. Kb1 Qc3": "Oh no! He will soon promote a pawn. ",
        "52. Qb5+ Kf8 53. a6 b3 54. Qb8+ Kg7 55. Nh5+ Kg6 56. Qg3+ Kxh5": "QG3 is what what I did, Qg2 affect if I could capture or not. Qg2 got accidentally played. So note: I cannot capture. I would if I could.",
        "57. a7 Qd3+ 58. Kb2 Qd4+ 59. Kxb3 Qxa7": "From this possition, I stopped notating. I had only 3:12 secconds left. I am amazed if you look at the USCF rating change. It ended up a draw. I was 2 1/2 out of 5 games for the tournament. My rating went up 142 at the end of the tournament. Goodbye for now, \r\n\r\nJoshua. P"
    },
    "url": "https://gameknot.com/annotation.pl/uscf-michigan-club-champ-tough-oponents?gm=27815",
    "gameName": "USCF Michigan Club Champ \"Tough Oponents\"",
    "players": "Joshua. P (346-488) vs. Ben. D (712-635)",
    "opening": "Sicilian defence (B30)"
}