{
    "moves": {
        "1. d4 d5 2. c4 e6 3. Nc3 Nf6 4. Bg5 Nbd7": "I enjoy the Cambridge Springs opening alot, especially against U1700 players.  There are lots of little tactical tricks to look out for.",
        "5. Nf3 c6 6. e3 Qa5": "The defining characteristic of this opening, putting pressure on c3.",
        "7. Nd2": "I believe this is now the mainline.",
        "7... dxc4": "Revealing an attack on the bishop on g5.  Will he notice?",
        "8. Nxc4": "Nope. ",
        "8... Qxg5": "Now I'm up a bishop.",
        "9. e4 Bb4": "Shooting to remove the defender of the e4 square.",
        "10. Qc2": "Adding a defender to e4.",
        "10... O-O 11. g3 e5": "Threatening exd4, when the bishop is pinning the knight.",
        "12. h4 Qg4 13. Nd2": "A mistake, allowing me to win additional material.",
        "13... exd4 14. Bh3": "Now, THIS was an interesting position!  I thought long and hard about my options here.  Of course, I can retreat my queen and have a long, hard(er) fought position...ooorrr, I can take the knight, with interesting and exciting play.  ",
        "14... dxc3": "I take the more interesting route.  This turns out to be a good decision, and leads to very fun and exciting play.",
        "15. Bxg4 cxd2+": "Of course, the whole thing wouldn't have worked if white had already castled.  I have to be able to take the bishop with my knight on my next move.",
        "16. Kf1 Nxg4 17. a3 Bc5": "Attacking f2.  ",
        "18. Qxd2": "Of course I was hoping for f3, but of course he doesn't play it.",
        "18... Nxf2": "Forking rook and pawn.  It would take ALOT for white to even have a chance at a draw now.",
        "19. Rh2 Nxe4 20. Qd3 Ndf6 21. b4 Bf5": "A major blunder.  I was unfocused at this point, already thinking of what I would do after the game.  This is the kind of DOY! move that haunts your darkest nightmares...you had a winning position against someone higher rated than you in a state championship event and then you blew it!  ",
        "22. bxc5": "Even here, though, I could still win.  But, being an impatient teenager, I impulsively responded immediatly with...",
        "22... Nxg3+": "Of course, there's nothing wrong with this other than the fact that he can take my knight...(facepalm)",
        "23. Qxg3": "Now we've reached an endgame where the material is level, but white definetly has the positional advantage.",
        "23... Rfe8 24. Re1 Ne4": "Of course I don't want a trade at this point.",
        "25. Qf4 Rad8": "Hoping desperately for the blunder Qxf5.  No such luck.",
        "26. Rhe2 Ng3+": "I shouldn't have played this.  It's based on Bd3, but it loses even more position.",
        "27. Qxg3 Bd3 28. Kf2 Bxe2 29. Rxe2 Ref8": "He's up a pawn and I'm lost.  ",
        "30. Qc7 Rdb8 31. Re7 Rfc8 32. Qa5 Kf8 33. Re3 a6 34. Qc3 f6": "Stopping the invasion of the queen (temporarily, at least).",
        "35. Qd3 Rcd8": "Missing the next move.",
        "36. Qxh7 Kf7 37. Qh5+ Kg8 38. Qg6": "And I resigned.  The only resource against the advance of the h-pawn is Rd7, and this loses to Re8 check."
    },
    "url": "https://gameknot.com/annotation.pl/utah-high-school-chess-championship?gm=33712",
    "gameName": "Utah High School Chess Championship",
    "players": "Brian  (Grisenti) vs. Matt (Boren [me])",
    "opening": "QGD (D51), Rochlin variation"
}