{
    "moves": {
        "1. d4": "Hi again everyone!\n\nHere is part 2 of the pawn majority theme.  As before Chris kicks off with 1. d4 and I respond with d5.",
        "1... d5 2. c4 dxc4": "2. ..... dxc4 - Queen's Gambit Accepted.  I have been inclined to accept gambits like these and have had mixed results.",
        "3. e4 e5 4. Nf3 exd4 5. Bxc4 Bb4+": "5. ...... Bb4+ - unlike the previous game, there is no sign of a Stonewall here!",
        "6. Nbd2 Nc6 7. O-O Nf6": "7. .... Nf6 - as this is a more open game, it is now imperative that Henry gets out of the centre, somehow!",
        "8. e5 Nd5 9. a3 Be7 10. Qb3 Na5 11. Qa4+ c6": "11. ...... c6 - whew!  This is a pretty sharp line here.  This interposition however, opens up a defensive line to my knight on a5.  The defender is Glenda, no less!",
        "12. Ba2 b5": "12. ..... b5 - I now adopt a Witch Ejection Plan.  However, she now turns my hanging passer on d4 into dust - tears!",
        "13. Qxd4 Be6 14. Ne4 h6": "14. ..... h6 - that old staple move - preventing a white piece incursion on g5.",
        "15. Nc5 Bxc5 16. Qxc5": "16. Qxc5 - N for B trade.",
        "16... Qb6 17. Qxb6 Nxb6": "17. ..... Nxb6 - queen trade.",
        "18. Bxe6 fxe6": "18. ...... fxe6 - bishop trade.",
        "19. Be3 Nd5 20. Bd2 Nc4 21. Bc3 Nxc3 22. bxc3": "22. .... bxc3 - N for B trade.",
        "22... c5 23. Rfe1 O-O": "23. ...... 0-0 - finally Henry is tucked away - on move 23.",
        "24. Ra2 a5": "24. ...... a5 - pawn wall.",
        "25. Nd2 Nxd2 26. Rxd2": "26. Rxd2 - knight trade.",
        "26... Rfd8 27. Rd6 Rxd6 28. exd6": "28. exd6 - rook trade.",
        "28... Kf7": "28. ..... Kf7 - Henry hurries towards the centre as quickly as he can.",
        "29. Re5 Rd8 30. Rxc5 Rxd6": "30. ..... Rxd6 - pawn trade.  Note that if Chris gets greedy and plays Rxb5?? he will cop Old Matey on the back row!",
        "31. Kf1 Rd5 32. Rxd5 exd5": "32. ..... exd5 - it will soon emerge that I will be fighting for my life in this endgame.  At one stage it looked as though I was gonna be in a zugzwang.  However, things are not always what they seem......",
        "33. Ke2 Ke6 34. Ke3 g5": "34. ..... g5 - trying to hold back f4.",
        "35. g3": "35. g3 - oh, oh!  Chris is now preparing it!",
        "35... h5": "35. ..... h5!  I think this move is gonna save my bacon.  You would never have thought that this pawn would spell checkmate for King Chris, would you?",
        "36. f4 gxf4+ 37. gxf4": "37. gxf4 - pawn trade.",
        "37... h4": "37. ..... h4 - hoping for the best.",
        "38. h3 Kf5": "38. ..... Kf5 - I now realise that if Kd4, Henry will be able to have a couple of white p(r)awn crackers on the kingside and get a reunion with Glenda before Chris has had a chance to crown one of his queenside pawns.",
        "39. Kf3": "39. Kf3 - it looks as though I am now in a zugzwang.  However .......",
        "39... d4": "39. ...... d4!! - pawn sac.",
        "40. cxd4 b4": "40. ..... b4 - suddenly I have a pawn majority on the queenside where it matters most.",
        "41. axb4 axb4": "41. ..... axb4 - and a passer on the queenside where it matters most!",
        "42. Ke3 b3 43. Kd3 Kxf4": "43. ..... Kxf4 - munch!",
        "44. d5 Ke5 45. d6 Kxd6": "45. ...... Kxd6 - munch!",
        "46. Kc3 Ke5": "46. ..... Ke5 - I was remembering another endgame with Chris in which I left King Chris to hoover up my queenside pawns in order to crown a kingside pawn.  My very first game with him in fact!  Poor Chris is gonna get a real case of Deja Vu here!",
        "47. Kxb3 Kf4 48. Kc3 Kg3": "48. ..... Kg3.  There is absolutely no way King Chris can prevent Henry from consuming the last white pawn on the board and preventing my solitary black pawn from reaching Glendadom a few moves later.  Chris waved the white flag a few moves later.  This was a very tricky king and pawn ending which could have gone either way but thankfully for me it went my way.  Next up for discussion will be an endgame involving K & R v K, B and R but that is gonna wait until next time.  See you later!  Kind regards - Joanne",
        "49. Kd2 Kxh3 50. Ke2 Kg2": ""
    },
    "url": "https://gameknot.com/annotation.pl/utilising-pawn-majorities-in-the-endgame-part-2?gm=54353",
    "gameName": "Utilising Pawn Majorities in the Endgame - Part 2 ",
    "players": "patzerblitzer (1698) vs. jstevens1 (1851)",
    "opening": "QGA (D20), 3.e4"
}