{
    "moves": {
        "1. d4 d5 2. Bf4 Nf6 3. Nf3 Nc6 4. Nbd2 e5": "Finally someone who  goes for the hard play! The issue is that I never faced this before, and it seems to become very tactical. I regret not to spend time on theory books. ",
        "5. dxe5": "I win a tempo on his N, but he can win another on my B. Let's see...",
        "5... Nh5 6. e3": "I lose my strong lsb, but I create a center that, I hope, won't be easy to undermine. ",
        "6... f6": "As soon as move 6 I had the Caissa's devil inside of me. I was insane by playing the most unexpected move I could find.",
        "7. Ng5": "Of course, if fxN, QxN+. Nevertheless, he can save the piece by grabbing my lsb. ",
        "7... Nxf4 8. exf6": "Now he has to choose: either try to save the N by Ng6, but in this case, f7+ would be very unpleasant for him, or to grab the pawn, and accept a piece exchange. He can take f6 with the Q, and this would probably be the best. If 8...Qxf6, 9. exNf4, Qxf4, 10. Qe2+, followed by Ne6, can provide - maybe - some compensation. But he went for",
        "8... gxf6 9. exf4": "...and I officially sacced a full piece. But my Q's diagonal is wide open.",
        "9... fxg5 10. Qh5+ Kd7": "I'd say a good compensation for the piece. Now, I had two plans in mind: g3, in order to play Bh3+, but he can defend, probably with Nd4, so to block the check with Ne6. But I can't resist a good attacking castling...",
        "11. O-O-O": "...with all sort of threats, including Ne4, of course. Qf7+ looks tempting, but after Ne7 blocking maybe his pieces can start to move, and I lose my sprint. ",
        "11... gxf4": "?? This was a fatal mistake! Sometime, +1700 do those things... Qxd5+, Bd6 is not the best.",
        "12. Ne4 Qe7": "?? Qe8 or Ne7 would have been better. d4 was an option, but after Bb5 my attack goes on.",
        "13. Rxd5+": "Probably he realized now that Ke6 is not possible due to Qf5#.",
        "13... Qd6 14. Nf6+": "His Q is mine, so I can go on attacking and bringing my pieces closer to his monarch.",
        "14... Ke7": "I wanted to play a more aggressive move, but I couldn' find it. So...",
        "15. Rxd6 cxd6 16. Nd5+": "The best square for the K was d8, but black is busted anyway.",
        "16... Ke6": "Now I think I missed 17. Qe8+, and if KxN, 18. c4+ and it is probably mate in few, but...",
        "17. Nc7+": "PRobably better was Bc4, threatening Nb6+...",
        "17... Kd7 18. Nxa8 b6": "Qf5+, and if Kd8, Qf6+ wins the other Rook. And if Ke8 or Ke7, QxBc8 wins. ",
        "19. Bb5 Bb7 20. Qf5+ Ke7 21. Re1+": "...but being able to bring the other R into the game was very tempting. ",
        "21... Ne5 22. Qd7+": "...and a good pin is always impressive...",
        "22... Kf6": "NOw Qd8+ looks great. He can't shield with his B since Rh8 is hanging. ",
        "23. Qxb7": "Well... this is over! ",
        "23... Bh6 24. f3": "Just frustrating him. ",
        "24... Re8": "The final blunder... 12 rating points won, and with a lot of fun! Thanks for reading."
    },
    "url": "https://gameknot.com/annotation.pl/very-tallish-maybe?gm=65137",
    "gameName": "Very \"Tallish\"... maybe!",
    "players": "damafi (1592) vs. mtnewman123 (1732)",
    "opening": "Queen's pawn, Mason variation (D00)"
}