{
    "moves": {
        "1. d4 e6": "Oh good! I like playing against the French like squeezing the life out of my opponents. ",
        "2. e4 c5": "Surprise not the French but my old friend the Sicilian. ",
        "3. Nf3 cxd4 4. Nxd4 a6": "Hum my opponent seems bent on not playing by the rules. Instead of the usually Nc6, Nf6, or e6 black plays the mysterious ...a6. Which lead to anything. ",
        "5. Nc3 Qc7": "The Kan/paulsen defense. Black tries to remain noncommittal waiting for whit to declare his plan. At this point I am getting tired of my opponent lack of commitment to our relationship so I decide to dump him. ",
        "6. g3": "Now it is my turn to stump my opponent. I am assuming that he has not seen this relatively unexplored line. That actually has some very interesting ideas. ",
        "6... Bb4": "Most common black pressures c3 while developing DSB to active square. ",
        "7. Bd2 Nf6": "Nc6 is also playable. Also 7. ...Bxc3 just gives white the bishop with strong diagonals ",
        "8. Bg2 Nc6 9. Nxc6 dxc6 10. a3 Bd6": "10. ...Bxc3 just gives white two strong bishops for nothing really",
        "11. f4": "!? A very active move that weakens the kings position(something that I harshly criticize my chess students to avoid) but in return black entombs his bishops and concedes a huge potential on the kingside. ",
        "11... e5 12. f5": "I normally try to avoid creating Center backward pawn and wide out spaces but I think my super active king pawns, bishop pair and superior development can be enough to secure an advantage. ",
        "12... b5 13. g4": "Like most Sicilian lines it usually comes down to pawn races. ",
        "13... Bb7 14. g5 Nd7 15. h4 O-O-O 16. Qf3 f6 17. O-O-O Nb6": "Oh nuts my king pawns have stalled and black is starting warm up. I smell trouble",
        "18. Be3 Nc4": "This I afraid that is turning into the classic of the tortoise and the Hare fable. ",
        "19. Bf2": "At least I can console myself with the fact that I control the dark squares in the heart of the black camp. Little help when my own dark size is about to trampled. ",
        "19... Qa5": "Ok call 911 we are about to have serious causalities ",
        "20. Nb1": "Barely hanging on with my fingernails ",
        "20... b4": "So many players under estimate the lowly pawn. Yet it wins the vast majority games! ",
        "21. Bf1": "!! The white king sees the light and puts his salvation on the righteous bishop.  ",
        "21... bxa3 22. Bxc4": "Now white has a great bishop on a very powerful diagonal outside the pawn chain",
        "22... a2 23. Bxa2": "Like a good Christian the white bishop makes himself a martyr ",
        "23... Qxa2 24. Bb6 Bc7 25. Bxc7": "The LSB I can live with but that DSB is interfering with my pawn. ",
        "25... Kxc7 26. Qg3": "Benign exchange of DSBs think again! ",
        "26... Qf7 27. Nd2": "I am thinking of maybe Ng3-Nc5-Ne3 with a huge advantage ",
        "27... Qe7 28. h5 c5": "28. ...fxg5 Nf3 ",
        "29. gxf6 gxf6 30. Rhg1 Rd7": "30. ...Rhg8 31. Qh4 does not prevent white from invading on the g-file",
        "31. Nb3": "Threatening Rxd7 with the fork on C5",
        "31... Kb6 32. Rxd7 Qxd7 33. Qe3": "! Defending e4 and threatening Qc5++ and h6-Rg7 at the same time ",
        "33... Qc6 34. Rg7": "Threatening mate via Nd2-Nc4-Na5",
        "34... Rc8 35. Nd2 Qa4 36. Qh6 Qa1+ 37. Nb1 Qa4 38. Qxf6+ Bc6 39. Nc3 Qa1+ 40. Kd2 Qf1 41. Qxe5 Qf2+ 42. Kc1": "Now after 42....Qe3+ 43. Kb1 Qe1+ 44. Ka2 the king walks away with two pawn scalps"
    },
    "url": "https://gameknot.com/annotation.pl/vics-sicilian-showdown-kan-variation?gm=48310",
    "gameName": "Vic's Sicilian Showdown (Kan variation)",
    "players": "elyhim (2347) vs. desafiante (2338)",
    "opening": "Queen's pawn (A40)"
}