{
    "moves": {
        "1. e4": "White sends a foot soldier forward two spaces.",
        "1... e5": "Monkey see.  Monkey do.",
        "2. f4": "White plays the Kings Gambit.",
        "2... exf4": "Black accepts.",
        "3. Nf3": "The white horse decides to come out of his stall.",
        "3... g5": "Black supports his pawn. ",
        "4. h4": "White tries to dismantle the black pawns.",
        "4... g4": "Black says screw it. Let's play chase the horse.",
        "5. Ne5": "The white horse moves out of harms way as expected. The black pawn on g4 is now quaking in his boots because the white queen and the white horse are threatening to eat him for lunch.",
        "5... Nf6": "Black develops a horse which threatens the White pawn on e4 and also gives some protection to that scared pawn on g4, but its not enough.",
        "6. Bc4": "White leaves that scared pawn alone for now.  He has bigger fish to fry.  White is threatening check by taking the black pawn on f7.",
        "6... d5": "Black sends a foot soldier out in an attempt to at least forestall the check.",
        "7. exd5": "White pawn takes black pawn.",
        "7... Bd6": "Black sends out a bishop.  This does a couple of nice things.  It keeps the white pawn from advancing and therefore takes the pressure off of the f7 pawn.  It also threatens the white horse who stands unprotected at present.",
        "8. Qe2": "The white horse stands his ground. The white queen comes out to protect him.",
        "8... O-O": "Black decides to castle in order to put his rook into play.  If the rook can make it to e8 white might get a little nervous.",
        "9. O-O": "Monkey see.  Monkey do.",
        "9... Bc5+": "\"Check\" is always a clever thing to do, and often a fun thing to say.",
        "10. Kh1": "The white king runs and hides.",
        "10... Ne4": "The black horse offers himself up as a sacrifice.  He is hoping that queens like the taste of horse meat.\n\nWhite examines all his options and decides to resign after only 10 moves.\n\nBlack is thinking, wow, I better annotate this thing so I can remember how to do it the next time someone tries the Kings Gambit."
    },
    "url": "https://gameknot.com/annotation.pl/victory-in-10-moves?gm=60038",
    "gameName": "Victory in 10 moves",
    "players": "myminov (1761) vs. jutterback (1563)",
    "opening": "KGA (C39), Kieseritsky, Rice gambit"
}