{
    "moves": {
        "1. e4 e5 2. Nf3 Nc6": "White can go into the Ruy Lopez, but breaks away from it.",
        "3. d4": "A very aggressive move by White. This is now the Scotch Game.",
        "3... exd4 4. Nxd4 Nf6 5. Nc3": "A position not usually seen in competitive play.",
        "5... Bb4 6. Nxc6 Bxc3+": "White's only logical response is to take with the pawn. While this results in doubled pawns, Black will have to double his pawns as well in order to take the knight.",
        "7. bxc3 bxc6": "There is now a completely empty file on the queenside, which could be useful in an attack by either player.",
        "8. Bd3 Qe7 9. O-O O-O": "The position is fairly balanced, though Black's bishop is doing little on c8 in comparison to either of White's bishops.",
        "10. Re1 Rb8": "Black now takes control of the b-file, and should have a fair game ahead of him. Unfortunately, his queenside pawn structure is pretty weak, while White's doubled pawns can easily be defended by the two bishops.",
        "11. Bf4 Ne8": "11. ... d6 would have been better, as White's two bishops will now encounter minimal resistance and Black will have a hard time bringing his rook on f8 into the game.",
        "12. Qh5": "White is planning to push the pawn on e4 forward and then checkmate Black by taking the pawn on h7 with the queen. Of course, Black will have none of that.",
        "12... g6 13. Qa5": "White, again, mounts an attack against the pawn on c7, as well as the pawn on a7.",
        "13... d6": "This may seem a strange move by Black, as he could have played 13. ... Rb7, defending both pawns, but then White could simply play 14. Rab1 or 14. Reb1 and Black will still have to lose a pawn, eventually.",
        "14. Qxa7 Rb6 15. a4 Be6 16. a5": "White knows that if he can build up enough pressure on Black's queenside, Black will have to give up material to stop a promotion.",
        "16... Rb2 17. Bc1 Ra2": "Black wants to trade off rooks, and, quite frankly, it's a good idea. One less White rook means that Black can defend more easily against a promotion.",
        "18. Rxa2 Bxa2 19. Bh6": "Black's rook is trapped, and so there is only one good move.",
        "19... Ng7": "This move has the added bonus of giving the rook some participation in the action. Unfortunately for Black, White's queen is still dominating Black's queenside.",
        "20. Qd4 Nf5": "Note that Black could have played 20. ... Qe5 to block the threat of checkmate while keeping the rook on f8 safe.",
        "21. Bxf8 Qe6 22. Qa4 Kxf8 23. Ra1": "Black is now in serious trouble. White is preparing to push the pawn on a5 forward to promotion, and Black can do little to stop it.",
        "23... Nh4 24. Rxa2 Qg4": "Black is now desperate. It's somewhat insulting to your opponent to hope that he will fall for a cheap checkmate like this in a championship, rather than simply resign what is a bad game.",
        "25. Bf1": "And, of course, Black now resigns due to his hopes of a checkmate having been dashed. If you wish to leave me a suggestion for an annotated game, or want to leave me feedback, please drop me a message. Your help is appreciated."
    },
    "url": "https://gameknot.com/annotation.pl/viner-watson-perth-1906?gm=34416",
    "gameName": "Viner-Watson, Perth 1906",
    "players": "William Samuel Viner (no rating) vs. Charles Gilbert Marriott Watson (no rating)",
    "opening": "Scotch (C45), Schmidt variation"
}