{
    "moves": {
        "1. e4": "While I'm not an extremely strong player, I know how useful it is to get a glimpse into the mind of a fairly strong player, when you're looking to improve your game. I'm going to annote games that demonstrate a certain theme.\n\nThe theme of this game is the squandering of tempo, and the special attention players need to give c2, f2, c7 and f7.",
        "1... Nf6": "I play 1... Nf6 no matter what white plays. 1. e4 Nf6 is a lot of fun, though (moreso than 1. d4 Nf6).",
        "2. e5 Nd5 3. c4": "Leading to the 4-pawn attack, a line that black equalizes in easily.",
        "3... Nb6 4. d4 d6 5. f4 dxe5 6. fxe5 Nc6": "Threatening Nxd4.",
        "7. Nf3": "The knight moves are slightly out of order, and white suffers a bit because of it. White normally brings his king's knight out after Be3 and Nc3.",
        "7... Bf5": "Normal continuation. Eyeing c2.",
        "8. Nc3": "Be2 or c5 were best. Nb4 could then be defended by Na3.\n",
        "8... Nb4": "Threatening Nc2. Black normally plays this move to play c5, since white would normally have his queen's bishop at e3 and the rook can go to c1. I'm not convinced that this move is best for black, though. 8... e6 Be3 and then Nb4, perhaps, was better.",
        "9. Kf2": "Avoiding the check.",
        "9... Nc2": "Might as well carry on.",
        "10. Be3": "10 Rb1 isn't much better. 10... e6 11 g4 Bg6 12 Bd3 Nxd4 and white stands poorly (Nxc4 will result).\n",
        "10... Nxa1": "I went about 6 moves deep into Nxe3, but it leads to nothing lasting. Don't get too exotic when you can pocket material.",
        "11. Qxa1": "Is white's lead in development and strong center adequete compensation for the exchange? Looking at this position I was concerned that I'd just get steamrolled from here. I think I like white's chances here.",
        "11... e6": "Opens the door for my king's bishop, holds up the e pawn so the f pawn can attack it, makes d5 impractical.",
        "12. a3": "? White here squanders any compensation he might get from giving up the exchange (his superior development, his strong center). This move, ultimately, serves no purpose. Black can now at least develop enough to soften white's advantage.\n\nWhite should have played, oddly enough, 12. h3!, preparing g4, h4 and g5 with a kindside pawn attack.",
        "12... f6": "12. a3? allows black to take a move to hit at the white center. The lag in development won't matter quite so much after cracking white's center.",
        "13. Be2": "exf6 or Rg1 is best. Rg1's a hard one to see here, but the threat of g4 and g5 isn't to be taken lightly. after 13. Rg1 Bg4 then 14. Ne4 or 14. exf6 and white fights on, with Bxf3 being restained by the spectre of the opening of the g-file for the rook.",
        "13... Bg4": "Threatening Bxf3, where white's faced with capturing with the king and further exposing his majesty, capturing with the g pawn and leaving the h pawn isolated and weak, or capturing with the bishop, allowing Nxc4.",
        "14. Rf1": "? Does nothing, threatens nothing, restrains nothing. I like 14. Ne4 Be7 here.\n",
        "14... Bxf3": "Nimzowitsch's idea of 'putting the question' to pinning pieces can be applied to a capture like this. Up the exchange, I make a routine trade now, when the method of recapture determines the further play. White has 3 choices, none of them good.",
        "15. Bxf3": "Ultimately, I think Kxc3 was best, even though it further exposes the king. White really should have forseen the threat of Qh4  and moving the king would have been useful. After 15. Kxf3 c5 white would still have stood worse, but it was better than the alternative.",
        "15... fxe5": "? Blunder. I went back to the plan of breaking up the center and opening up the lane for her royal highness, but allowed white a chance with Bxb7.\n\n15... c6, to block the bishop's line of fire, was correct. When I made this move, I dismissed Bxb7 as a nuisence, not realizing the power of that move.",
        "16. Rd1": "A transparent threat. The black queen aims for h4 anyhow. \n\n16. Bxb7 Rb8 17. Bc6  Kf7 and now 18. c5 exd4 and white, utimately, gets a reasonable game. Perhaps even an advantage.\n\n",
        "16... Nxc4": "free pawn! the threat of Bxb7 can safely be ignored now (17. Bxb7 Qh4 ).\n",
        "17. dxe5": "White has wasted 4 tempo (a3, Be2, Rf1 and Rd1), as well as missing the only chance to get an even game. The queen is out of the fight and the queen's knight is ill-placed, and now invites black to attack.\n\nI like 17. Qa2. If then 17... Qh4  18. Ke2 Nxe3 19. Qxe6 , while not good, is better than losing by force.",
        "17... Qh4+": "Nice of white to herd me where I wanted to go.",
        "18. Kg1": "All moves are bad, but this isn't the best move.\n18 g3?? Qxh2  19 Kf1 Nxe3  20. Ke1 Nc2  and the loss of the queen.\n18 Kf1 Nxe3  19 Ke2 Nxd1 20 Qxd1 Qf4 and wins.\n18 Ke2 [best] Nxe3 19. Kxe3 Bc5  and white faces a strong attack, but doesn't fold immediately.",
        "18... Nxe3": "Free bishop!",
        "19. Re1": "?? Final blunder",
        "19... Nc2": "White has to give up the rook with 20 Re4 Qxe4 21 Bxe4 Nxa1 and the threat of Bxb7 remains, now that white's pieces are scattered, negligable. White's problems began with Nc2 and, 10 moves later, Nc2 seals it.\n\nWhen down in material, ATTACK! Time is against you, then. And keep an eye on c2/7 and f2/7."
    },
    "url": "https://gameknot.com/annotation.pl/vini-vidi-vici?gm=142",
    "gameName": "Vini, vidi, vici.",
    "players": "ahaa (1421) vs. mossberg4570 (1571)",
    "opening": "Alekhine's defence (B02), Steiner variation"
}