{
    "moves": {
        "1. e4 e5 2. c4 Nf6 3. f3 Bc5 4. Nc3": "Solid positional setup for both sides, White concentrating more on pawn structure, Black going for pieces.",
        "4... O-O 5. d3 Bd4": "Movement now to add some spice to the position.",
        "6. Nge2 Bxc3+ 7. Nxc3 c6 8. Be2 d5": "Black continuing to be aggressive.",
        "9. cxd5 cxd5 10. Bd2": "White's position solid, Black not developing positionally but staying on the offensive.",
        "10... d4 11. Na4": "The knight is a bit out to dry here. The only other alternatives were moves to b1, which negates advancement, and b5, which seems vulnerable.",
        "11... Bd7 12. b3 Bxa4 13. bxa4": "Doubled pawns. White's position still stronger defensively.",
        "13... Nc6 14. O-O b6 15. Qc2": "Black's setup has improved, White's king is very secure. The queenside is quite open, and there are possibilities for White, although the knight on c6 for Black is quite well placed.",
        "15... Rc8 16. Qb3 Na5": "A bit unnecessary - Re8 might have been better, threatening to bring both rooks into the game.",
        "17. Bxa5": "This bishop was limited on the queenside and there is little opportunity for effective diagonal work on the kingside. Decent move to remove a threatening piece.",
        "17... bxa5 18. Rfc1 Rxc1+ 19. Rxc1": "Doubled pawns for both sides on the a-file, White has his big guns out on the queenside.",
        "19... Qe8 20. Qb5 Qxb5 21. axb5": "The trade doesn't serve all that much of a purpose but is not really a bad move either.",
        "21... h6 22. Rc4 Rb8 23. a4 Rb6 24. Rc7 a6": "Now we have some action.",
        "25. Rc8+": "Done mostly to keep the king away.",
        "25... Kh7 26. bxa6 Rxa6 27. Kf2": "Both kings involved, although White's king seems to be more effectively involved. ",
        "27... Nh5": "Possibly threatening.",
        "28. g3 Rb6 29. Rc5 f6": "White suddenly on the defensive, without many prospects for action.",
        "30. Rxa5 Rb2 31. Rc5 Ra2 32. a5 Kg6": "White's main threat is that hanging pawn on the a-file. It is, unfortunately for White, a bit too close to its starting position to force Black to keep the rook on the a-file.",
        "33. f4": "Questionable move, but White doesn't have much.",
        "33... exf4 34. Kf3 fxg3 35. hxg3 Nxg3 36. Kxg3 Rxe2": "At least the game is more open now.",
        "37. a6 Ra2 38. Rc6 Kf7 39. Kf4": "Theoretical draw, it would appear.",
        "39... g5+ 40. Kg4 Kg6": "This is the mistake. The pin on f6 is deadly.",
        "41. e5 Rg2+ 42. Kf3 Ra2 43. Rxf6+ Kh5 44. Rd6": "Black probably will not win, but can White find a way?",
        "44... Ra4 45. e6 Kg6 46. Ke4 Ra5 47. Kxd4 g4 48. Ke3": "Black's rook is miserably useless, serving merely to corral White's hanging pawn.",
        "48... h5 49. Kf2 Kf6 50. Kg3 Ke7 51. Rb6 Kd8 52. Kh4 Kc7": "A mistake, though Black is rather out of good moves.",
        "53. Rb7+ Kd8": "d6 much better. Playing into White's hands.",
        "54. a7 Ke8 55. Rb8+ Ke7 56. a8=Q Rxa8 57. Rxa8 Kxe6 58. Rh8": "Over now. Black insists on extending it.",
        "58... Kf5 59. Rxh5+ Kf4 60. d4 g3": "Black has nothing.",
        "61. Rg5 Ke4 62. Rg4+ Kd5 63. Kxg3 Kd6 64. Kf3 Kd5 65. Ke3 Kd6 66. Ke4 Kd7 67. d5 Kd6 68. Rg6+ Kd7 69. Ke5 Kd8 70. d6 Kd7 71. Rg7+ Kd8 72. Ke6 Kc8 73. d7+ Kd8": "Hoping for a last mistake from White.",
        "74. Rg8+ Kc7 75. Ke7 Kb6 76. d8=Q+ Kc6 77. Qd7+ Kb6 78. Rc8 Ka5 79. Qb7 Ka4 80. Ra8#": "Really an interesting game, to see how a small mistake can take a probable draw into a loss."
    },
    "url": "https://gameknot.com/annotation.pl/volatility-of-drawn-positions?gm=50947",
    "gameName": "Volatility of drawn positions",
    "players": "johnpbro (1031) vs. therick17 (1088)",
    "opening": "King's pawn game (C20)"
}