{
    "moves": {
        "1. e4": "I have the White pieces.",
        "1... e5 2. Nf3 Nc6 3. d4 exd4 4. Bc4": "The Scotch Gambit\r\n\r\nFor some light analysis on possible continuations in this opening, please refer to the \"Alekhine's Block\" annotated game.",
        "4... h6": "A common mistake in this line.  Black is concerned about a possible Ng5 or Bg5, but 4...h6 does not assist in controlling the center, contributes nothing toward development, and weakens the light squares.  In most openings the moves h2-h3 and h7-h6 must be played judiciously.",
        "5. O-O": "In open positions I normally answer a time-wasting move like ...h6 with O-O, since I can easily embark on tactical operations without having to worry about my King in the center.",
        "5... Bc5": "Black heads for a Giuoco Piano like position minus a critical tempo!  Although my opponent defends his d4 pawn for the moment and develops his KB to an aggressive post, 5...Nf6 was a better move, as 6.e5 can be answered by 6...d5 with standard Two Knights Defense type play.",
        "6. c3": "White is threatening to build a strong center combined with a tempo hit on Black's c5 Bishop.  What can he do?\n\nThe standard 6...Nf6? runs into a mobile pawn center after 7.cxd4, where Black's developed pieces get pushed around.  Normally Black would have ...Bc5-b4+ (as in the Giuoco Piano), but instead Black has the quite useless ...h6 and White has the very useful O-O.  Black is nearly lost after 7...Bb6 8.e5, since the pawn center is a formidable attacking weapon in this position.\n\nBlack cannot opt out with the move 6...dxc3?, for reality hits hard after the foreshadowing 7.Bxf7+! Kxf7 8.Qd5+ Ke8 9.Qh5+! Kf8 (9...g6 is nothing after 10.Qxg6+ and White will still recover his material) 10.Qxc5+ d6 11.Qxc3.  White is clearly better with more space in the center, an advantage in development, and a much safer King.",
        "6... d3": "Black tries a familiar idea in gambit play.  Give the pawn back and deny White the natural c3 square for his Knight.  But here it's dubious.  Perhaps Black could have tried 6...d6, but after 7.cxd4 Bb6 8.Nc3 White is very comfortable.",
        "7. b4": "White begins to impose his will on Black, attempting to punish him for his 4th Move mistake (4...h6?).  It's always instructive how lack of center control and backward development can lead to a quick defeat, especially in open positions.\n\nBlack has some choices where to move the Bishop:\n1) 7...Bd6 is hardly a choice, as 8.e5 forces the comical 8...Bf8 (8...Be7 9.Qb3!+-).\n2) 7...Be7 turns the Bishop into a passive defender and hems in the Queen.  Play similar to the actual game results with White attacking f7, sacrificing to expose the Black King, etc.\n3) 7...Bf8 undevelops, so at this point Black might as well continue with ...Nb8 and set up for a new game!",
        "7... Bb6": "Of course Black tries to stay as active as he can with his dark-squared Bishop, so the text move is totally understandable.",
        "8. b5": "This hit on the Knight has everything to do with the center, giving White an overwhelming attack.  For the game continuation, it's important for White to decentralize the c6 Knight in order to access e5.  Here Black should retreat with 8...Ne7, although White maintains pressure after 9.Qb3 d5 10.ed followed by Re1, Nbd2, Ba3, etc. White enjoys several advantages: king safety, development, center control, and a strong initiative.",
        "8... Na5": "Blunder!  Now that Black's minor pieces have been pushed aside, it's time to rock & roll!  Can you find the move?",
        "9. Bxf7+": "Exclam!  It's the \"Achillies Heel\" attack!  White sacs on the weakest square in Black's camp.  Black is officially out of this game, and it's all up to White to find the correct series of checks, captures and threats to put him away.",
        "9... Kxf7": "In the game, Letelier vs. Liebstein, Mar del Plata 1951, Black did not accept the Bishop sac on f7, and instead tried 9...Kf8.  White won a nice attacking game in 41 moves.",
        "10. Ne5+": "Here Black is faced with several continuations.\n1) 10...Kf8 and 10...Ke7 are both met by the simple 11.Ng6+ fork.\n2) 10...Ke8 is forced mate after 11.Qh5+ Ke7 (11...Kf8 12.Qf7#) 12.Ba3+ d6 (12...Ke6 13.Qf5#) 13.Qf7#\n3) 10...Kf6 is the game continuation (10...Ke6 is essentially the same).",
        "10... Kf6": "10...Ke6 transposes to the game after 11.Qg4+, when 11...Kxe5 is forced on account of...\n1) 11...Kd6 12.Nf7+ royal fork is unpleasant.\n2) 11...Ke7 12.Qxg7+ forced mate in 7.\n3) 11...Kf6 12.Qf5+ Ke7 13.Ng6+ followed by mate next move.",
        "11. Qf3+": "Exclam!  White sacrifices a second minor piece to draw the Black King into the center, where he will surely find no shelter from the storm.",
        "11... Kxe5": "Black has nothing better.  Other moves transpose to variations already given.  The goal now is to pull the Black King across the equator and into White's camp, where White can easily deliver checkmate.  If Black tries to run back home, he will get mated quicker or lose massive amounts of material defending his King.",
        "12. Qf5+ Kd6 13. e5+": "Here Black's only escape route leads to disaster after 13...Ke7 14.Ba3+ d6 (14...Ke8 15.Qf8#; and 14...c5 is nothing after 15.bxc6+ e.p.) 15.exd6+ cxd6 16.Re1+ Be6 17.Qxe6+ Kf8 18.Bxd6+ and Black loses the Queen!",
        "13... Kd5": "This was not the game continuation.  Black actually played 13...Kc5, and I accidentally played 14.e6+?  Black then interposed with 14...d5, allowing reinforcements to assist in the defense. This was a major mistake on my part.  After sacrificing two minors, I failed to appreciate the level of accuracy required to finish off my opponent, and instead made a quick move without careful consideration of his defensive resources.\n\nIt's unclear to me if, after 13...Kc5 14.e6+? d5, White still has a forced mate in this position.  Black's King is horribly exposed on d5, but White needs more dudes activated in order to force mate.  Houdini calculates only a forced drawing line after 15.a4 Nc4 16.Qf4 Ba5 17.Ba3+ Nxa3 18.Qd4+ Kd6 19.Qf4+ Kxe6 (19...Ke7 20.Qf7+ Kd6 21.Qf4+ and Black will need to eventually take on e6 if he wishes to vary) 20.Re1+ Kd7 21.Qf5+ Kd6 22.Qe5+ Kc5 23.Qd4+ Kd6 24.Qe5+ 1/2-1/2.  In any case, I was eventually able to win back some material, but could not hold out in the long run.  The Black King slithered away to safety.  The game ended with White trying one last-ditch sacrifice to keep the fire burning, but Black defended like a pro and it was 0-1 on Move 35.  If you want to view the actual game, go to my history and pull up \"hansdevries\" dated 11/21/05.\n\nAfter 13...Kc5, the CORRECT way to nail the coffin shut is the simple 14.Qxd3!  White threatens Ba3 mate, therefore 14...Nc4 15.a4! (threatening Qd4 mate) 15...Qh4 16.f4!  The final nail in the coffin forces Black to resign, as there is no stopping Qd4#.",
        "14. e6+": "Here the discovered check is definitely correct, since Black cannot interpose with ...d7-d5.  And now Black's next move is forced, since 14...Kd6 loses quickly to 15.Bf4  Ke7 16.Qf7#.",
        "14... Kc4 15. Na3+ Kxc3": "Forced",
        "16. Bd2+": "With the Black King deep into White's camp, a third sacrifice comes as no surprise.  Here are the variations:\n1) 16...Kxd2 17.Qe5 with 18.Qe1# or the cute 17...Bxf2+ 18.Rxf2#!\n2) 16...Kd4 17.Rac1 trapping the King, followed by 18.Bc3#\n3) 16...Kb2 prolongs the mate...",
        "16... Kb2 17. Rfb1+ Kxa3 18. Qxd3+ Ka4 19. Rb4#": "Checkmate!  The win was right there in front of me.  8-)\r\n\r\n1-0\r\n\r\nThe End"
    },
    "url": "https://gameknot.com/annotation.pl/walking-the-plank-ii-achillies-heel?gm=591",
    "gameName": "Walking The Plank II: Achillies Heel",
    "players": "escrimador (1664) vs. hansdevries (1692)",
    "opening": "Scotch gambit (C44)"
}