{
    "moves": {
        "1. e4 d5": "scandinavian gambit",
        "2. exd5": "Gambit accepted",
        "2... c6 3. dxc6 Nxc6": "Lasker variation accepted",
        "4. Bb5": "In my opinion it's not a good move, for the bishop will have to move twice to gain nothing",
        "4... Qd5 5. Bxc6+ Qxc6": "Th black queen is exposed but menaces g2 and h1. ",
        "6. f3": "It's probably the best move to eliminate the black queen's menace but it weakens white right wing in case of a castle and tend to block the g knight.",
        "6... Bf5": "Menacing c2 ",
        "7. d3": "Efficient defense short term but white will have trouble to gain the center",
        "7... e5": "Taking control of the center",
        "8. Nd2": "Menacing e4 but blocking the dark square bishop",
        "8... Nf6": "Still aiming at the center",
        "9. Ne4": "This move seems good to me (white doesn't want black to settle at the center) although the knight had to move twice (Black's developpement is well in advance now)",
        "9... Bc5": "To permit the short castle",
        "10. Qe2": "The only move to enable a long castle relatively quickly",
        "10... h6": "preventing 11. Bg5",
        "11. Be3": "Preparing the long castel and menacing Bishop on c4",
        "11... Bxe4": "To eliminate the menace on the c4 bishop which I don't want to move, for he is on an open diagonal, aiming at the center.",
        "12. fxe4 O-O 13. Bxc5": "This seems a mistake to me, for now white has nothing on the center and the black queen will be well placed on c5, soon supported by a rook.",
        "13... Qxc5 14. O-O-O": "The queen is on the king's file",
        "14... Rfd8": "Settling on the semi open file.",
        "15. Nf3 Rac8": "Both rooks on the semi open files",
        "16. Rd2 Qa5 17. Kb1 Rc6": "Preparing to double the rooks or rook and queen on same file",
        "18. c3": "Weakening the king ",
        "18... Ra6 19. a3": "Weakening the king.",
        "19... Rb6 20. Rc2": "Preparing the attack",
        "20... Qxa3 21. Kc1": "?? Mistake. This move leads to the lost of the h rook.",
        "21... Qa1+ 22. Kd2": "Forced move",
        "22... Qxh1 23. Qe1 Qxg2+ 24. Qe2 Qxe2+": "The trade favorise the one with the more material",
        "25. Kxe2 Ng4": "Mistake",
        "26. h3 Nf6": "The knight must withdraw. Black's 25th move was useless and permitted white's pawn to advance",
        "27. Nxe5 Re6 28. Nf3 Nh5 29. Ke3 g5 30. Nd4 Red6 31. b4 Nf4 32. e5 Rd6d5 33. Ke4 Ne6": "Not much to say about all those moves.",
        "34. Kf5": "Mistake for it allows the black knight to set the king in check and win a pawn",
        "34... Nxd4+ 35. cxd4 Rd5xd4 36. Rc7": "Blunder. White didn't see the mate. But there was, at this stage, little to do.",
        "36... Rf4#": ""
    },
    "url": "https://gameknot.com/annotation.pl/walking-the-walk-and-learning-to-run-mt-part-4?gm=48623",
    "gameName": "Walking the Walk and Learning to Run MT Part 4",
    "players": "chicoboy (1239) vs. ptitroque (1649)",
    "opening": "Scandinavian defence, Lasker variation (B01)"
}