{
    "moves": {
        "1. e4 c5": "The Sicilian is often seen at master level. It can lead to very sharp play, as explained in some other annotations of mine. I normally see 1...e5 in my games.",
        "2. Nf3 e6": "A somewhat non-committal move, as Black can still choose from many Sicilian systems, such as the Scheveningen, the Taimanov and the Kan variation. Nevertheless, 2...d6 is more often seen, which can lead to the hyper-sharp Najdorf and dragon variations. Another possibility is 2...Nc6, which can lead to the accelerated dragon and the Sveshnikov. (Other transpositions are also possible) Another advantage of this move is that it discourages 3.Bb5, as after 3...a6! the bishop has to retreat because 4.Ba4?? b5 5.Bb3 c4 loses it. This move (3.Bb5) is a good possibility against 2...d6 and 2...Nc6 though.",
        "3. d4": "I stick with what I know - the open Sicilians.",
        "3... cxd4 4. Nxd4 a6": "The Kan variation - a rock solid approach, but it can have quite some 'bite' if either player is not careful.",
        "5. Nc3 b5": "Black chooses to expand early on the queenside, without even developing a piece. This is the so-called minority attack: Black has a 3 vs. 2 minority on the queenside, so if two pairs of pawns are exchanged white is left with an isolated pawn on that side of the board, which can be attacked easily by the open lines that are created.",
        "6. Bd3 d6": "Black also wants to control a small share of the centre, though White hasmore control on that part of the board for now.",
        "7. O-O": "I keep making solid developing moves. In many variations of the Sicilian I like to castle queenside, but as Black already has an attack going at that side (and, to be honest, another reason was that I was playing a master) I chose the safer approach.",
        "7... Nd7": "This move is rarely seen. Far more common are 7...Nf6 and 7...Bb7.",
        "8. a4": "Trying to induce Black's pawns forward, to be able to attack them and break them up. The immediate threat is 9.axb5, on which Black can't respond 9...axb5?? on account of the hanging rook on a8. I was aware of the fact that I followed a game in the database, which ended in a win for Black and I knew that I would probably have to deviate to hope for a better result than in that game.",
        "8... b4": "But to my delight, the master deviates first. The move played in the game we followed, 8...bxa4, looks somewhat illogical, as it isolates the a pawn, which can be attacked easily as it is on an open file after White retakes.",
        "9. Na2": "Attacking the pawn. Other squares are even worse: 9.Nde2 blocks a good developing square for the queen, and on b1 the knight is nothing but a spectator as a3 and c3 are both controlled by the pawn on b4, and there doesn't seem to be a nice spot which the knight can go to in the near future. Also, it blocks the rook from developing, so it has to move again soon (after the bishop and queen are out). That, combined with what I saw in games in the opening DB and with earlier experience in this variation (not this particular position), were the reasons why I preferred this move.",
        "9... e5": "? Normally I would hesitate to give a move made by a master a ?, but, as the master admitted, this move was a plain oversight. Ion had written the notation down wrongly, so he had the wrong position on the board. As he didn't look at the board on the GK site properly, he made this blunder... Fortunately for him, it was only a pawn that I could win.",
        "10. Nc6": "! This simple knight fork (with double attack on b4) wins me a pawn. I was really hesitating to make this move, as I was afraid the master had set a trap which I was not aware of, but I couldn't find a reason not to play it, so I decided I would try and see what would happen.",
        "10... Qb6 11. Ncxb4": "At first I wanted to play 11.Naxb4??, until I discovered that that would be a horrible blunder as 11...a5 wins a piece (the knights can't defend each other anymore). The computer gives me a decisive edge (+1.91) at this point, while Ion felt that he had some compensation in an active game and open lines for his pieces now. I'm not sure who is right or wrong, as I felt I also had active piece play and especially a strong grip on the centre, so I thought my advantage was at least a clear pawn.",
        "11... Ngf6 12. Be3": "Developing with tempo, but my advantage drops slightly, to +1.51. I'm not sure what is wrong with this though...",
        "12... Qb7": "I would expect the bishop to develop to this spot, but if the queen would go to a5/d8 or c7 there could be some tactics involving knight forks on c6 or d5 respectively, and on b8 she blocks the natural square for the rook.",
        "13. f4": "!? Gaining space in the centre and preparing a kingside assault, as is often the plan in the Sicilian for White. However, Black's position has no weaknesses at that side of the board (which is often the case in the Kan) and maybe I should have switched my attention to the queenside, in particular the weak a6 pawn (but 13.Qe2 would be strongly met with 13...Nc5, when I have to concede the bishop pair because 14.Bc4 loses the a pawn).",
        "13... Be7 14. Kh1": "There are many options here, but I decided to make a waiting move to see what Black would do. Another move I considered was 14.Qe2, but I didn't like to concede the bishop pair after 14...Nc5. Still, it could be a good move as after (14.Qe2 Nc5) 15.Bxc5 dxc5, Black has many weaknesses on the queenside.",
        "14... O-O 15. fxe5": "Opening lines on the kingside. Though the computer doesn't spot an inaccuracy, my advantage decreases by 0.3 or 0.4 points with every move I make and has now fallen to only +0.45 (while I still had the feeling that I was far better, if not winning, though I knew who I was playing against).",
        "15... dxe5 16. Bc4": "?? And here I make a horrible blunder. I had probably forgotten that the exchange on e5 had also opened a line for Black... My idea, of course, was an attack on the f file and f7 in partiicular, but that didn't quite happen.",
        "16... Bxb4 17. c3": "? The mistakes keep coming. Here I simply forgot about the e pawn. In an OTB game it is quite normal to make two mistakes in a row due to the psychological effect, but it's not necessary in a correspondence game. My idea was to place a rook on e1, of course.",
        "17... Qxe4 18. Bg5": "Dreaming about exchange sacs on f6 (why not? I'm way behind in material, so might as well throw in some extra wood).",
        "18... Bb7 19. Rf2": "? Planning to double on the f file, but this is another blunder.",
        "19... Bc5": "The game is totally over now.",
        "20. Rd2": "I could have tried 20.Bd3, but I had the idea to win back some material on d7...",
        "20... Qxc4 21. Rxd7 Nxd7 22. Qxd7": "However, by neglecting my defence, I allow Ion to mate me with a nice piece sac.",
        "22... Bxg2+": "! It's mate in 6.",
        "23. Kxg2 Qe2+ 24. Kh3": "It's mate in 2 now. 24.Kg3 would last a little bit longer, but I missed that after 24...Bf2+ I could return to g2: 25.Kg2 Be1+! (necessary to block the 8th row) 26.Kg1 Qf2+ 27.Kh1 Qf1#.",
        "24... Qf3+ 25. Kh4 Bf2#": "A convincing win for the master, but I had a good game until my blunder at move 16. Thanks for reading, I'd like to receive some comments. Ion, thanks for this lesson, I hope we can play another game soon."
    },
    "url": "https://gameknot.com/annotation.pl/walking-the-walk-2-a-blunder-in-the-middlegame?gm=42960",
    "gameName": "Walking the Walk 2 - A blunder in the middlegame",
    "players": "l-d-j (1561) vs. ionadowman (2006)",
    "opening": "Sicilian (B43), Kan, 5.Nc3"
}