{
    "moves": {
        "1. e4": "This was one of my first and probably the shortest game I have played (so far) in the Walking the Walk & Learning to Run Welcome MT 11\n\nI think it can best be described as a painful reminder of what can go wrong in a game",
        "1... e6 2. d4 d5 3. Nc3 Bb4 4. e5 c5 5. a3": "Tournament starting position",
        "5... cxd4 6. axb4 dxc3 7. bxc3": "At this point I was reasonably happy that white had a weakened pawn structure and I would soon be able to castle",
        "7... Ne7 8. Bd3": "This is one of those moves that at the time I thought was fairly innocuous, however it is anything but.",
        "8... O-O 9. Nh3": "This is where we vary from the Gameknot database which only has h4 as an option. Although I was suspicious of this as an unusual move I couldn't see what was to come. In fact this move serves two purposes, firstly it keeps the d1 h5 diagonal clear for the queen and secondly it threatens the rather nasty Ng5",
        "9... Nbc6": "simple developing move to threaten the pawn on e5",
        "10. Bxh7+": "This was a bolt from the blue for me. My first instinct was not to take it, however after Qh5 I would be in serious trouble",
        "10... Kxh7 11. Qh5+ Kg8 12. Ng5 Re8": "Pretty much the only way to avoid mate, if I can get my king on f8 it can at least get a little protection from the knight which can go to g8",
        "13. Qxf7+ Kh8": "Of course white isn't going to allow me that luxury",
        "14. Qh5+ Kg8 15. b5": "with hindsight I realised the purpose of this was to open the a3-f8 diagonal for whites dsb",
        "15... Nxe5 16. Ba3 Ne5g6": "This achieves nothing other than losing material as we will see",
        "17. Qh7+ Kf8 18. Qxg6": "At this point I'd had more than enough as mate is imminent. \n\nThanks for reading, please comment."
    },
    "url": "https://gameknot.com/annotation.pl/walking-the-walk-learning-to-run-welcome-mt-11?gm=54112",
    "gameName": "Walking the Walk & Learning to Run Welcome MT 11",
    "players": "alex_ratchkov (2255) vs. elwoos (1490)",
    "opening": "French (C17), Winawer, advance, Rauzer variation"
}