{
    "moves": {
        "1. c4": "Though I don't know much opening theory, I've come to like this opening move.",
        "1... Nf6 2. Nf3 e6 3. Nc3 d5 4. d4 c6": "An interesting response. Limiting the spots the knight can go but defending the center. Also limits what the bishop can do in the game, but as my games tend to be more closed in nature, this shouldn't really be too big of a problem.",
        "5. e3 Nbd7 6. Be2 Bd6 7. c5 Bc7 8. b4": "I forgot why I did this move but it does reinforce my c-pawn and for now adds a layer of protection to my c3-knight.",
        "8... O-O 9. O-O": "At this point, what I see is both sides evenly developed, though I feel that white's pieces are more mobile. This I feel gives me a minor positional edge I feel.",
        "9... e5 10. Bb2": "Working to finish development and find a strategy.",
        "10... e4 11. Nd2 Re8 12. b5 Nf8 13. Re1 Ng6 14. g3": "Limiting the squares my opponents pieces can move to is a common technique I use and I am sure a lot of other high rated players do as well.",
        "14... Qd7 15. Bf1": "Prevents Qh3",
        "15... h5 16. a4 h4 17. a5 hxg3 18. hxg3": "Opening the h-file, but currently neither side can capitalize on the opening.",
        "18... Ng4 19. Bh3 f5 20. a6": "Seeing nothing more I can do on my kingside currently, I attack the base of black's pawn chain.",
        "20... Nxf2": "Black does the same with a beautiful combination which I invite.",
        "21. Kxf2 Bxg3+": "Taking the bishop would be horrible, so I must retreat.",
        "22. Kf1 Qf7": "An exposed king does not look good for me. I began to wonder if I still had a chance to pull out the win.",
        "23. axb7 Bxb7 24. Qh5": "Claiming the open h-file for myself while I try and figure out some way to defend my king.",
        "24... Bc8": "This gives me a pawn, though I thought before taking and realized perhaps this was not the best option for black.",
        "25. Re2": "First, I got my rook out of danger.",
        "25... f4 26. Bxc8": "I get rid of the Bishop threatening my king side and a possible mating net.",
        "26... fxe3+ 27. Qf5": "! - My saving grace. Giving up my queen was the best way I felt to defend my position. ",
        "27... Rf8 28. Qxf7+": "Still exchange. I don't want the threat of the queen lingering around.",
        "28... Rxf7+ 29. Kg2": "At this point I feel I can at least get a draw here.",
        "29... Nf4+ 30. Kxg3 Nxe2+ 31. Nxe2 Rxc8": "Simplifying the position.",
        "32. Nf1 cxb5 33. Nh2 Rf2": "I learned here that doubled pawns are not always bad. Very interesting.",
        "34. Re1 Rc6 35. Bc1": "Attacking the weak pawn on e3.",
        "35... Rg6+ 36. Ng4": "With a double attack on e3 vs no defenders, I feel I had an edge.",
        "36... Rf3+ 37. Kh4 Kh7 38. Nxe3": "I am told that taking with the bishop was better, but I didn't see myself in a position to win so I was comfortable going for the draw. ",
        "38... Rh6+ 39. Kg5 Rg6+": "Please tell me how I did, this is the first game I've ever annotated. Rate and comments are welcome."
    },
    "url": "https://gameknot.com/annotation.pl/walking-the-walk?gm=55184",
    "gameName": "Walking the Walk",
    "players": "eaglei (1768) vs. a_random_guy (1968)",
    "opening": "English opening (A15)"
}