{
    "moves": {
        "1. d4": "White indicated he was interested in playing the Benoni with me, rather than the Sicilian. ",
        "1... d5": "However, I am not entirely prepared with the Benoni, so I decide to mirror his opening move and see what the master player has in mind. I am hoping for a QG game, as I'm pretty good there as well. \n\nIn this game, because of the next few decisions stay fixed for much of the game resulting in a relatively closed game.\n",
        "2. c4": "Queens gambit! White applies immediate pressure to the d5 pawn. Black has various choices here, in no particular order: dxc4 (QGA), e6 (QGD), Nf3 (Marshall), c6 (Slav, after c6), among others. I've not studied all of these well enough. I've reviewed Marshall (Nf3), but have spent more time with either QGA (dxc4) or QGD (e6). \n\nIn addition, given my opponent's rating he could probably play these positions blindfolded, so I thought maybe playing something this typical might produce a complacent move. Let's see how it turns out.\n",
        "2... e6": "QG declined. Black decides to not accept the pawn at c4 and instead moves to defend d5. Cramping a bit the LSB, but he'll be ok with it in a while.",
        "3. Nc3": "Normal developing move pressuring the d5 pawn. ",
        "3... Nf6": "and black responds counter with the same move. Pressure mounting.",
        "4. Bg5": "White pins the knight to the Queen reducing the defense on d5 and threatening to double the pawns on the file spoiling a kingside castle.",
        "4... Be7": "further development for black, removes the benefit for white to exchange at f6 and moves closer to the castle.",
        "5. e3": "this move further supports the d4 pawn, but more importantly opens lines or the LSB and Queen. Specifically, the LSB now defends the c4 pawn and the Queen line prevents black from moving Ng4 anytime soon.",
        "5... O-O": "castle",
        "6. Nf3": "normal development",
        "6... Nbd7": "I debated here whether to move Nd7 (Orthodox defense) or h6 (Neo Orthodox). I decided on the Orthodox even though it is a bit more cramped. \n\nI am not as strong with knights as I would like to be. In fact, in general I do not like knights at all, not my favorite piece. The Orthodox line depends on piece exchange for black to stay in the game and I figured this would be one way to remove those pesky critter knights. :)",
        "7. cxd5": "so the opening attack begins, white strikes first at the center!",
        "7... Nxd5": "black retakes offering up his first knight! ",
        "8. Bxe7": "Nice bishop fork. ",
        "8... Qxe7": "Good exchange for white. The white DSB was less valuable then the black DSB given center pawn structure. Now black is stuck with a LSB that can't move easily, while white has a nice line for his LSB.",
        "9. Nxd5": "one knight down, three to go.",
        "9... exd5": "two knights down, two more to go! I'm loving life right now. I simply don't like them.",
        "10. Bd3": "The white LSB opens up his look and gives white the option to castle.",
        "10... Nf6": "Protects the h7 pawn and the d5 pawn... the f6 knight is overloaded. However, I am prepared to exchange if I can manage it!",
        "11. Qc2": "Now white loads the b1-h7 diagonal gun. In addition, opens the option to castle long (albeit unattractive)",
        "11... Qb4+": "Attack queen side... threatens the b2 pawn, which keeps the queen busy for a few moves. Gives black the initiative and white has not yet castled. ",
        "12. Nd2": "Black could exchange queens here, but chose Nd2 instead. This move pins the knight. I am expecting the h3 kick in the next move or so. Not much more the queen can do here. By forcing the knight into defense, I think she's done enough.",
        "12... Bg4": "Attack king side. I didn't want white to castle long, his pawns are slightly better positioned for a pawn storm. ",
        "13. O-O": "natural",
        "13... Bh5": "I thought about bringing the bishop to g6, but will need some additional help back there and the queen is awaiting her next mission",
        "14. Nb3": "white mobilizes on the queen side preparing to attack the weak pawns there.",
        "14... Qd6": "Queen pulling extra defensive duty: defending d5, c5 and helping defend the kingside in subtle ways. \n\nI see the potential of Ng4 & Qh2, but that's unlikely given a highly likely h3 pawn push. \n\nI also imagine one future with a black rook at e8 and the queen at e6. The black queen is in a nimble position. I like this position for her. She is highly mobile and capable of playing both sides. ",
        "15. Rfc1": "White steals my idea, but he's several moves ahead there... that looks strong",
        "15... c6": "Simple, yet powerful, defensive move. Relieves the black queen for other duty and stalls the white queen. \n\nNotice that white has amassed all his major and minor pieces on the queen side. The black king looks a bit vulnerable now. I'm feeling comfortable with the black side. I feel the piece spread is solid with many pieces working in harmony and an active queen.",
        "16. h3": "Anticipated as earlier discussed. This stops the Ng4 plan. ",
        "16... Bg6": "Time to mess with that bishop. I know I'll end with doubled pawns (which become a factor later in the game), but I think having the rook staring down the f file is interesting. Maybe there's a discovered attack there with a knight move in the future. ",
        "17. Bxg6": "takes",
        "17... fxg6": "takes. doubling the pawns and weakens the castle. However, the bishops are off the board, so the only piece that can threaten the king diagonally is the Queen, which the d5 pawn holds at bay. ",
        "18. Nc5": "I hate knights",
        "18... Qe7": "Put the queen where I envisioned her earlier. I know in this position the knight must move twice to threaten the queen and defends the b pawn simultaneously.",
        "19. b4": "and the pawn storm on the queen side begins.",
        "19... Rf7": "Will prepare to double my rooks up on the f file. The f file is now my attack plan. The queen is not well positioned yet, I would like to move the knight up to e4 (blocking the queen and pressuring f2), then maybe g2. ",
        "20. a4": "pawn attack alert.. that's a problem I'll have to deal with. c3 is the weak spot.",
        "20... Rc8": "It's clear white will push forward on the Queen side. All his major pieces are prepared and in good position. However, back to my earlier note. This leaves his king side a bit weaker. \n\nMy attack plan is still along the f file. However, while I’ve learned keeping to a strategy is certainly a good idea, small tangents are often necessary to dismantle or interrupt an opponent's plan. In this case, I want to perturb the threat building on the queen side. I still intend on doubling my rooks on f, but put a minor threat on his queen while defending the c6 pawn.\n",
        "21. Nd3": "Move the knight out of harms way and opens up the queen-rook attack on c3. I only have two defenders, but they I think I will win the exchange still. ",
        "21... Ne4": "Discovered attack on f2 and positions the black knight in excellent position. I really don't like knights, with their strange and mysterious way, but I think this one is in pretty good position. White cannot easily contest the black knight. ",
        "22. Qa2": "Threatens an eventual white queen centered at d5. Not sure my plan to interrupt the queen side attack was effective. It seems my opponent is committed there.. perhaps this is something I should use. The black pawn at a7 does look weak, but its not clear how the final attack will form there. White still has the f2 attack, but that's not really that powerful yet. I think if I put more pressure there white will have to react and slow the queen side attack.",
        "22... Rcf8": "So back to my f file attack plan. Double the rooks, double the fun! I basically abandoned the queen side pawns and committed to a king side attack. I didn't do the math, but think the queen side pawns can fend off the queen side attack while my king side attack solidifies. ",
        "23. Rc2": "This move by white maintains his attack on the queen side and additionally defends f2. At this point, I really don’t know if my king side attack will work. The next move seems to be Qh4, which will commit me to king side and weaken my queen side defense. I spent a lot of time analyzing this position. Now, because white moved the rook to c2, this tells me the king side attack has some merit. This provides a bit more confidence. ",
        "23... Qh4": "So, black attacks. The black queen is no longer supporting the queen side pawns, but they don't seem in imminent danger. \n\nThe pressure is quite high on both sides of the board. On the queen side, the pawn storm is well underway with a strong supporting cast ready to invade black’s territory. On the king side, black is preparing an attack at the f2 cell. The white pawns on the kingside appear to be fixed, while the black pawns on the queen side are in the same condition. \n\nThe difference from both sides appears to be that white’s major pieces provide both attacking and defending support, while black’s strong pieces are mostly committed to the attack on the king side. If I’m committed to this attack, black needs to add another piece to the mix. The king side pawns are pretty useless in their current state. I think moving one of these into the mix would be good.. just seems a bit too slow.",
        "24. b5": "White's queen side attack begins. If black exchanges on b5, the queen side defenses are done. In fact, I don’t see a pawn move on the queen side that doesn’t result in a total defensive breakdown. Also, at this point my opponent and I were discussing the pawn structure. He also pointed out my king side pawns are doubled. He sees this as a weakness as well. ",
        "24... g5": "I decide to advance the king side attack further and simultaneoulsy try to resolve the doubled pawns. I considered h5 and h6, as this gives my king a place to run when the white pawns reach the rear rank (which appears inevitable), but neither supports the black attack. The only pawn move that participates in the f attack is the leading g pawn.\n",
        "25. bxc6": "White continues on the Queen side. The defenses have been breached.",
        "25... bxc6": "Black can’t afford to let the pawn pass. This exchange is logical as the white rook on c2 is fixed to defend against the f2 attack. ",
        "26. Rxc6": "I didn’t expect this capture. I thought white would double the rooks on c. This seems to opens the door for an  attack at f2. ",
        "26... Nxf2": "so black takes on f2. My opponent indicated a Queen exchange here may have been better, but he doesn't know I really just wanted to get rid of the knights!!!",
        "27. Nxf2": "one more down, only one more to go!",
        "27... Rf7xf2": "finally.. the knights are gone and now I'm threatening the queen.",
        "28. Qxd5+": "I spent a while analyzing the position and forgot about the d5 pawn threat. This changes things for black. The queen side is entirely breached and two very strong pieces running amok uncontested. I must come up with an alternate offensive approach.",
        "28... Kh8": "But first, I need to move out of check  :)",
        "29. Rac1": "Now white doubles the rooks.",
        "29... Qg3": "This moves threatens checkmate unless the white queen stays on the the diagonal, somewhat limiting the white queen's movement.",
        "30. Qe4": "White intent on pushing forward with the d pawn",
        "30... Re2": "Trying to line up the rook, then the queen and pawn on e3.",
        "31. Qf3": "White has forced the exchange. I didn't see this coming either. Black choices are Qb8 (and lose the rook) or exchange. Any other move is results in checkmate. ",
        "31... Qxf3": "Black makes the only viable move.",
        "32. gxf3": "Black takes",
        "32... Rxe3": "At least I was able to even out the material. ",
        "33. Rc1c3": "White defends his pawns",
        "33... Rxc3": "I decide to exchange. I've read more complex positions favor the stronger player, so my goal is now to simplify.",
        "34. Rxc3": "White takes. The d pawn is my concern now. If that pawn is out of the way, perhaps the imbalance on the king side can result in a positive result for black.",
        "34... h5": "Making room for the black king and moving the pawns forward.",
        "35. d5": "Yea, that's the one.",
        "35... Kg8": "I counted the moves and the black king can beat him.",
        "36. a5": "Looked like a waiting move maybe, but lined up the white pawns.",
        "36... Rf5": "Pinned the d pawn",
        "37. Rc7": "The black a pawn is gone.",
        "37... Rxd5": "Now, Black has to worry about the white a pawn.",
        "38. Rxa7": "takes",
        "38... Rd2": "I decide to keep the black king from participating",
        "39. Rb7": "Moving out of the way for the pawn.",
        "39... Kh7": "I wanted to bring the king up so he doesn't trap my king on the last rank. I'm hoping the king will participate in a pawn promotion.",
        "40. a6": "Yikes.",
        "40... Ra2": "Attack that puppy.",
        "41. Rb6": "White could have moved the pawn forward, but this move keeps the black king constrained for a move. It also fixes the black rook along the a file and the white rook along the 6th row.",
        "41... g6": "I really want my king involved Mr. White chess guy.",
        "42. Rb7+": "check",
        "42... Kh6": "uncheck",
        "43. a7": "Yikes!!!",
        "43... g4": "Time to attack the pawns and try to promote one.",
        "44. fxg4": "take",
        "44... hxg4": "take",
        "45. h4": "I didn't expect this move, the final pawn exchange would result in a draw. So, I look very carefully. White has set a trap with h4. Its a game ending move for black, do you see it? ",
        "45... g5": "Not interested in ending the game (Kh5 results in checkmate), I decide to move the pawn forward.",
        "46. hxg5+": "take",
        "46... Kxg5": "take and I think maybe I can march the pawn up the board to promote. However, if you count carefully, it won't work. ",
        "47. Kf1": "White moves to intercept the black rook",
        "47... Kh4": "Moved the king to start walking",
        "48. Rc7": "From here, I'll skip ahead a bit because we are pretty much even.",
        "48... g3 49. Rg7 Kh3 50. Rh7+": "This is the first potential draw position.",
        "50... Kg4 51. Rb7 Kf3 52. Rb3+ Kg4 53. Rb8": "My opponent has determined at this point, the a7 pawn is irrelevant to the draw, so we make a couple of moves and then draw.",
        "53... Ra1+ 54. Kg2 Ra2+ 55. Kf1 Rxa7 56. Rg8+": "We agreed to draw at this point. I'm very pleased with my progress in this game and thank the club for advancing my game so rapidly. I will also say that during this game, I got very little sleep and spent a long time analyzing these positions. So... its off to bed! \n\nHope you enjoyed the annotation and please leave your comments.\n\nThanks David for the game!"
    },
    "url": "https://gameknot.com/annotation.pl/walk-the-walk-2?gm=60771",
    "gameName": "Walk the walk #2",
    "players": "dynamic_dv (2404) vs. russ20124 (1675)",
    "opening": "QGD (D60), Orthodox defence"
}