{
    "moves": {
        "1. e4 e5 2. f4": "I can't say I've ever really studied the King's gambit. Some of the lines in it seem crazy, it was interesting to dabble in it this time though.",
        "2... exf4 3. Nf3 g5 4. h4 g4 5. Ng5 h6 6. Nxf7": "All games in this tournament started here. The acid test of the gambit is to accept, so that's what I did.",
        "6... Kxf7 7. Bc4+ d5": "If I'm going to survive the attack I have to develop quickly which is why I preferred this to 7 ... Ke8, this gives back a pawn but since the one on g4 would have been dropping anyway I'm not really losing out. ",
        "8. Bxd5+ Kg7": "My plan was to try to hide my king in the corner and surround it with pieces. As it turns out I don't have time, in view of this 8 ... Ke8 might be a better try",
        "9. Bxb7": "Brilliant move, and one I would use if given the opportunity now. I'm now left with a choice of accepting the second piece but leaving my king to be chased around or giving up a rook and trying to play for an attack of my own. I didn't really see a good way to do the latter though, I'm just not developed enough.",
        "9... Bxb7": "Second gambit accepted, let the king chase begin!",
        "10. Qxg4+ Kf7 11. Qh5+ Ke6": "This looks odd, but 11 ... Ke7 loses the rook after 12. Qe5+ and the placement of the queen now prevents any hope of safety in the kingside corner. I thought I had to try to hide in the other corner, and hope I didn't have to give up huge amounts of material to save my tired king.",
        "12. Qf5+ Kd6": "12 ... Ke7 fails as before.",
        "13. d4 Bg7": "Had to prevent Qe5+. This also frees my Queen from the defence of the Bishop. If 14. Bxf4+ I had planned 14 ... Ke7 15. Qc5+ Ke8 and slowly white is running out of meaningful checks. ",
        "14. Qg6+": "I think this is correct, since 14 ... Bf6 15. e5+ Ke6 is basically forced it wins back some material and stops my king from stepping back towards safety. ",
        "14... Bf6": "I considered 14 ... Nf6 too, but thought I would end up having to give up two pieces then. At least this way I can keep some defenders near my king, which is in desperate need of some! Interestingly the computer thinks I have a winning advantage, not sure I agree but at least it shows that I've defended quite well up to this point.",
        "15. e5+ Ke6 16. c3": "Can't quite understand this move, I realise the Bishop isn't going anywhere but I don't see why defending d4 suddenly becomes a priority. I was expecting white to either play exf6 or develop instead. Perhaps moves like this is the difference between 1950 and 2100?",
        "16... Nd7": "With my king still fixed in the centre I decide to develop. More pieces means more safety in theory.",
        "17. exf6 Qxf6 18. Qg4+ Qf5 19. Qxf5+ Kxf5": "At last I get the pesky queen off the board, it cost me most of the gambit material to do so, but I felt quite happy with this position. Given how alarming the queen's invasion had looked things could have been a lot worse.",
        "20. O-O Ngf6": "I can't save the f-pawn so I develop my worst piece instead.",
        "21. Bxf4 Ke6": "The computer says this is a mistake. Indeed in the cold light of day moving my king back to the centre seems odd. I was trying to keep the g-file open for some play of my own I think. In hindsight running to the corner with 21 ... Kg6 was probably better, I didn't appreciate just how much of a target my king still was even with the queens off the board. The computer suggests I have a slight advantage if I play 21 ... Ba6, thereby preventing any discovered checks and it seems I can even force a bishop exchange (eg 21 ... Ba6 22. Rf3 [22 Rf2 Ne4 23 Rf3 Be2 wins a piece] Be2 23. Rf2 Ne4 24. Rxe2 Kxf4). ",
        "22. Nd2 Rag8 23. Rae1+ Kf7 24. g3 c5": "This is where things start to go really wrong. I save my c-pawn but give up the dangerous square d6, which my opponent immediately exploits.",
        "25. Nc4 Kg6": "25 ... Kg7 would have walked into some rather dangerous pins and discovered checks. After 26. Re7+ I have the choice of going to g6 anyway after which 27. Be5 is coming, or moving back to f8 and walking into the extremely nasty 27. Bd6 (see how important that d6 square was!). ",
        "26. Ne5+ Nxe5 27. Bxe5 Rgf8 28. h5+": "Game over. I have to give up the exchange at the very least. As it happens I ended up giving up the whole rook.",
        "28... Kg5 29. Bxf6+": "1-0 After 29. ... Rxf6 then 30. Re5+ forces the king to leave the defence of the rook.\n\nThings I learned\n\n1. When accepting gambits be prepared to give some material back to ease the pressure on an unsafe king\n2. When you think the fire is out, don't relax! Make sure it's out.\n3. Moving a pawn will often give up a square, make sure the square is not important."
    },
    "url": "https://gameknot.com/annotation.pl/walking-the-walk-learning-to-run-welcome-mt-pt-9?gm=50781",
    "gameName": "Walking the Walk & Learning to Run Welcome MT Pt 9",
    "players": "easy19 (2105) vs. itchynscratchy (1936)",
    "opening": "KGA (C39), Allgaier, Urusov attack"
}