{
    "moves": {
        "1. e4": "Standard fair, not going with any of my lesser practiced openings against a 2000+ player. ",
        "1... e5 2. Nf3 f5": "The Latvian Counter-Gambit.  If I ever played against this before, I have no recollection of doing so.",
        "3. Nc3": "So I proceed cautiously in unknown territory.",
        "3... fxe4 4. Nxe4": "A trade of pawns and I'm feeling a little more comfortable.",
        "4... d5": "Bigpeta gaining central position with pawns early.",
        "5. Nc3 e4 6. Nd4": "Shuffling the knights, some space to play in is available, although my opponent controls the tempo.",
        "6... Nf6 7. d3": "I did this to open up the bishop for a possible Bg5, pinning the knight against the queen...",
        "7... c5": "But that is disallowed by a further attack on one of my knights.  This is beginning to feel like the Alekhine defense. ",
        "8. Nb3": "Not many other options here, still not a horrible position to be in...",
        "8... exd3 9. cxd3": "I recapture, not recapturing would have allowed 9 ... c4.  Not that he would have played that particular move, but it was on my mind and I felt the need to develop other pieces.",
        "9... Be7": "He's a step ahead of me, here I don't have to abandon Bg5, but I do anyway...",
        "10. Qe2": "A mistake.",
        "10... O-O": "A powerful castle.",
        "11. Qd2": "Another mistake.  I am aiming my queen towards the kingside with this move, but I'm also pinning in a bishop that would probably be better off developed.",
        "11... Nc6 12. Be2": "Preparing to castle...",
        "12... d4 13. Na4": "Running out of room with the knights.",
        "13... c4 14. dxc4": "Forced.",
        "14... Ne4": "The attack is coming, I may own a temporary material advantage, but I'm losing pretty handily at this point.",
        "15. Qc2": "Really nowhere else to go with the queen at this point.",
        "15... Bb4+ 16. Nd2": "I should have placed the bishop I've been dying to develop there instead of the knight.  I can see why I thought to move the knight, there's room on the board and I would much rather give away a knight and win a bishop, the knights are stranded uselessly on the side of the board anyway.  I still prefer Bd2, however.",
        "16... Bf5": "Things are getting worse by the move!",
        "17. O-O": "A minor and temporary escape.",
        "17... Nxd2 18. Qd1": "A nice attack by peta and I simply have to lose material...",
        "18... d3 19. Bxd2": "I have to gain something...",
        "19... dxe2 20. Qxe2": "Not much choice but to take.",
        "20... Nd4": "The onslaught continues.",
        "21. Qd1": "There really isn't much going on here for me, there are so many guns aimed at my pieces that I would consider resigning in a regular game.  Alas, that's against the rules of WtW.",
        "21... Bxd2": "More material gained...",
        "22. Nc5": "I can't capture the bishop with the queen because it's followed by Nf3+, 23. Kh1 Qxd2.  This knight move was the first time I was able to cross the center of the board in this game, peta took the initiative from the beginning and forced me to play on my heels in retreat.",
        "22... Qg5 23. Kh1": "A move in response to the pressure being placed on my g2 pawn.",
        "23... Bc2": "But I missed his true intention...",
        "24. Ne6": "A weak move, knowing I'll lose my knight seems ok if I can capture the c2 bishop in response.",
        "24... Qh6": "Didn't expect that...",
        "25. Qg4": "Seems logical, just a bit too late.",
        "25... Nxe6": "I couldn't have saved that knight anyway.  I made an effort but peta's pieces are dominating the entire board at this point.",
        "26. a4": "In hopes of bringing out the rook to a3 and then hopefully a playable position.",
        "26... Rf4": "So much for that idea...",
        "27. Qg3 Rh4 28. h3": "Trying to avoid mate at all costs at this point.",
        "28... Nf4 29. Kh2": "Moving the king up as another defender for the h pawn.  I do understand the positioning of my queen and king here is extremely dangerous, I just don't know what else to do.",
        "29... Nxh3 30. Kh1": "Retreating the king to avoid a possible spear with the bishop.  ",
        "30... Nf4+": "A discovered check and mate is approaching.",
        "31. Qxh4": "The game's already over, I can see the defined mate, but am playing it out in accordance with the rules and out of respect for my opponent.  After all, how often does he even get a checkmate?  At his level I'm sure he only sees draws and resignations, right?  ;)  ",
        "31... Qxh4+": "Queen captures...",
        "32. Kg1": "King moves...",
        "32... Ne2#": "Knight moves, checkmate.  I hope you enjoyed the annotation and were able to learn a thing or two from the lesson bigpeta handed my way.  I wish good game to peta and can't wait to lock horns with him again real soon!"
    },
    "url": "https://gameknot.com/annotation.pl/walking-the-walk?gm=47746",
    "gameName": "Walking the Walk",
    "players": "jj414 (1435) vs. bigpeta (2070)",
    "opening": "Latvian counter-gambit (C40)"
}