{
    "moves": {
        "1. e4": "Short game. Black did well till the 10th move and a couple of mistakes after.",
        "1... e5 2. d4 Nc6": "Central game, gambit refused",
        "3. Nf3": "The most logical move, aiming at the center",
        "3... d6 4. dxe5 Bg4 5. Be2 f6 6. exd6 Bxd6": "White gets material advantage but black has 4 pieces out against 3 for white (gambit situation)",
        "7. Be3": "White has to develop quickly. It's hard for black to castle short because the g knight cannot go to f6 and h6 is a bad place. Furthermore, the pawn f6 opens the diagonal a2-g8 for the white bishop. On the other hand, both white bishops aim at the black queen side and can be dangerous in case of long castle.",
        "7... Qe7 8. h3": "To eject the ennoying black bishop",
        "8... Be6 9. O-O O-O-O": "Long castle for black whith white DSB aiming at a7... danger",
        "10. Bd3": "Protecting the e pawn and allowing the queen to come on e2",
        "10... Ne5": "Mistake",
        "11. Bxa7": "2 pawns advance for white and a hole near the king",
        "11... Kd7": "Weak move, I suppose. It let the initiative to the white and the b pawn is now unprotected.",
        "12. Nc3": "to developp and aim at b5 and d5, two important squares",
        "12... c6 13. Qe2": "defending the e pawn and aiming at d5 with the eventuallity of a sacrifice to oblige the c pawn to move.",
        "13... Nxd3": "It supress a menace but weakens black center and the exchanges are good for the one with material advance",
        "14. Qxd3": "Now black DSB is pined",
        "14... Ke8": "To permit the d rook to menace the white queen but letting the initiative to white. Now it will be hard for black to join both rooks",
        "15. Qe3": "To escape the d rook menace, protect the  bishop in a7 and create a menace on e file (permiting e5)",
        "15... Bc4": "This move achieves nothing. White anyway planned to send the f rook on e1 or d1",
        "16. Rfe1": "I hesitated between 16. Re1 and 16. Rd1 to settle on the open file. I finally opted for e1 because I planned to play e5 as soon as possible and because the a rook can come on d1.",
        "16... Be6": "Back home. The 15th and 16th moves have achieved nothing, except the white's position is better.",
        "17. e5": "Here we go for a central attack",
        "17... fxe5 18. Nxe5": "Knight on the center. No best spot. ",
        "18... h6": "Blunder !",
        "19. Ng6 Bc5": "Last defense try",
        "20. Bxc5 Qf6": "To save the queen but the game is lost",
        "21. Nxh8": "I looked for a mate, couldn't find it, so capture the rook seems the best."
    },
    "url": "https://gameknot.com/annotation.pl/walking-the-walk-and-learning-to-run-mt-part-4?gm=48650",
    "gameName": "Walking the Walk and Learning to Run MT Part 4",
    "players": "ptitroque (1642) vs. lesplay (1204)",
    "opening": "Centre game (C21)"
}