{
    "moves": {
        "1. d4 d5 2. Bf4 Nf6 3. Nf3 h6 4. h3 Bf5 5. g4 Bh7 6. Nbd2 g5": "It was very long ago I faced this line. I'm not worried at all. There is no point it taking the B to e5 while it can be exchanged by Nc6.",
        "7. Bg3 e6 8. e3 a6": "Preparing the break in c5.",
        "9. c4": "This is a little trap. If Bb4, pinning the N, Qa4!, Nc6 (only not to lose the B to the Q), and after Ne5 I threaten NxN, bxN, Qxc6+, Ke7, wich is winning for white. Black doesn't fall for it. ",
        "9... Nc6 10. a3": "I can play Ne5, NxN, dxN, Nd4, NxN, dxN, etc, but this will be like \"killing the game\".",
        "10... Bd6 11. Ne5 Bxe5": "Wonderful!",
        "12. dxe5 Nd7": "Now, I should protect my e5 pawn with f4. This means I don't have anymore f3 in case of Be4. I should be aware of not moving Nd2 until the black's lsb is threating to get to a safe square.",
        "13. cxd5": "I thought about this possible \"brilliancy\", to undermine my opponent's K. The inmediate response is Nc6xe5, then 14. dxe6, fxe6, 15. Qg3, pressing e6, while Nf3+, 16. Ke2,Qf6, and I think White is ok. ",
        "13... exd5": "Now, 14. Nf3 is bad, due to Be4, and white can't avoid the loss of e5. Another idea was 14. Qg3, but after Nd7xe5 it fails. No way, I have to use the last resource, no more \"tricks\".",
        "14. f4": "If gxf4, exf and my position holds ok. Nb3 would be my next move.",
        "14... d4": "I like this opp: he's mimic my own \"technique\"... :-) Well, we both can play this game, and as for checks, my comes in first, if I play 15. e6. If black ...dxe3, I can choose exf2+ or exN+. But if black just takes it (fxe6), I can see no more advantage, even after Qxe6+...",
        "15. exd4 Nxd4": "Now, I lost the track, and I simply overlooked the c2 weakness. f5! was the correct answer, and after Qe7, Qa4!, and black must defend his Nd4. I went wrong.",
        "16. Qa4 Nc2+ 17. Kf2": "Trying to get the most of it.",
        "17... Nxa1 18. Bc4": "?? Inviting a fork with no compensation.",
        "18... Nc2": "Saving the N instead of taking the fork + saving the N...",
        "19. f5": "Trapping the N and setting a stunning pawns formation, but overlooking again the fork: ",
        "19... b5": "Obviously, if I take Bxb4, axB, QxB, black would probably save his N and get a dangerous initiative on a and b.",
        "20. Bxf7+": "I will take the piece with another fork. He choosed to take. Otherwise, ...Kf8, QxNc2, KxB, with similar results as in the game. ",
        "20... Kxf7": "Shall I interpose e6+? Shall I interpose Qg3+? Probably. 21. Qg3+, Kf8 (seems the only reasonable square to avoid inmediate danger). It gives white a very strong attack.",
        "21. Qxc2": "I admit I was lazy, but hey, I was -7 and I still have most of my threats on black's K. ",
        "21... Nf8": "Avoiding the fork. Here, the straight e6+ seems to win, but Nxe6 is possible since f5 is pinned. I think the best move was Qc3, threatening e6 and preventing Qd4+.",
        "22. Qb3+ Ke8 23. Ne4": "I thought that summing the N into the fry was best: Nf6+ is a deadly threat for black. But black has resources. ",
        "23... Qd4+ 24. Kf3": "I thought here nothing could stop me from Nf6+, and Rd1. ",
        "24... Rd8 25. Nf6+ Ke7": "Aha. And now, what? I have nothing! Qb4+ is giving up! The threat is Qd3+, exchanging the Q (or, otherwise, getting in with his R with deadly effects).",
        "26. Re1": "The only move I saw that prevented Rxd3+, K2 or g2, Rd2+ and Rxb2.",
        "26... Qd3+ 27. Re3 Qxb3 28. Rxb3 Nd7": "Now I win c7, one way or another. But which is the best? Hard to say with less than a minute. NxN, and after black retakes either with the K or the R, white ends up winning f7. ",
        "29. Nxh7": "? Nd5+, Nxc7 was easy and obvious.",
        "29... Rxh7 30. e6 Nc5 31. Rc3": "Ok, the idea here was to penetrate with the R on c7, instead that with the B. Please remember white is playing a full R under. This is why I secured my pawn chain, made free my B and hoped  for the right moment to try to win back the material with my free pawns. A delicate manouver!",
        "31... Rd5": "Black always finds a move! Now, b4 was the only one, but black still has Rd3+, and after RxR, NxR, I don't think I can trap the N...",
        "32. Bxc7": "? Making the game easier for black!",
        "32... Rh8 33. Bb6": "Tempting him into...",
        "33... Na4 34. Rc7+": "...and THIS is the critical position of the game. White can win the Rh8, but at the cost of the dsb. The e7 pawn can't get to the 8th... or can it?",
        "34... Kf6": "Here, I played Rf7+, and lost miserably. But what if I had played...",
        "35. Ke4": "Black has only one move to save the R.",
        "35... Re5+ 36. Kd4": "White threatens mate. Only move: ",
        "36... Rf8": "And my question is: is this position winning, losing or drawing for white? Which is the \"rescue plan\", if any? My K can't leave to leave the square for the dsb (Nxb2). Rf7+, RxR, exR, Kxf7, KxR, leaves NxB, and a lost engame without a piece... Now I think that the correct move was Ba7, and wait. Nxb2 doesn't worry me.",
        "37. Rh7": "Threatens again to win a full R with Rxh6+.",
        "37... Nxb6": "Better than nothing.",
        "38. Rxh6+ Kg7 39. Rg6+ Kh7 40. Kxe5": "I am still a piece under, but I have good pawns. Can I win this?",
        "40... Nc4+ 41. Kd5 Nxb2 42. Kd6 Nc4+ 43. Ke7": "All moves are more or less forced, unless black has some resource I can't see. ",
        "43... Ne5": "! The only way to \"save\" his R. ",
        "44. Rf6 Rxf6 45. Kxf6 Nc6 46. Kxg5": "...and I can say that white wins. ",
        "46... Kg7": ""
    },
    "url": "https://gameknot.com/annotation.pl/was-it-a-win?gm=63455",
    "gameName": "Was it a win?",
    "players": "damafi (1459) vs. beefkake31 (1467)",
    "opening": "Queen's pawn, Mason variation (D00)"
}