{
    "moves": {
        "1. e4": "This was my opening game in a minitournament consisting of teammates from Waskally Wabbits and Morose Mooses. I decided to annotate all my games from the competition, as this would also help me to focus more on my games and hopefully cut out most blunders. I can't promise scintillating play, as I'm not that kind of a player. :) \n\nMy opponent, Blackbaron, is my most frequent opponent on Gameknot, and I played against him in my very first minitournament in this site. We usually have very exciting games with a lot of exchanges early on, so let's see how this one goes. \n\nHe starts with 1.e4. My personal favourite, pawn moves to the centre, and frees two pieces, the light squared bishop and the queen. My usual defence against 1.e4 is the French Defence.",
        "1... c5": "1.... c5. The Sicilian, my current preferred opening against 1. e4. I had a pretty good run with the French, and will return to it soon. Tried the Pirc for a while, with horrible results. Record with the French : 50%, Record with the Pirc : 35%.  Have recently ordered the book Play the French by John Watson (just arrived today, in fact. Takes 12 days for Amazon.com to deliver to Bangladesh, for anyone who might be interested) :) . Will switch back to the French after I study the book for a while.",
        "2. Nf3": "Normal development, moves the Knight to its best square, and follows the rule : Knights before Bishops, as we know what the best squares are for the knights, whereas it is better to wait a bit before developing the bishop.",
        "2... d6": "This move frees my light squared bishop. I plan to play the Sicilian Dragon, so while my king side bishop looks horribly locked in, I 'm not too worried.  I plan to fianchetto the bishop. The fianchettoed bishop failed miserably for me in the Pirc Defence, let's see how the Dragon suits my style.",
        "3. b3": "Unorthodox move, no idea if this move is in the book, will have to check later after the game what the best response is. For now, will have to follow my instincts. Perhaps he is planning to fianchetto his own bishop, to prevent me from playing g6 for the Dragon formation.",
        "3... Nf6": "Normal development, Knight to its best square. If he fianchettoes his bishop to counter my Dragon, I'll still continue with my plan, I fancy the early exchange which wins his bishop for my knight.",
        "4. e5": "4. e5. Typically aggressive play by the Baron, but has he overlooked something? I can play 4.... dxe5, which wins a pawn, because if 5. Nxe5?, I can play 5..... Qd4! which forks the knight and rook. Let's wait and see though.",
        "4... dxe5": "Awaiting his response...",
        "5. Nxe5": "He has overlooked it!",
        "5... Qd4": "How will he defend this? Give away the rook, as a sort of poisoned rook, if there is such a thing, and attempt to trap my queen? For example, 6. Nc4  Qxa1, 7. Bb2  Qxa2, 8. Nc3 Qa6 and so on. Or even 7. Nc3 which looks better. Let's wait and see. Of course, trapping my queen is one thing, capturing it with no further loss of material is something else entirely :)",
        "6. Nxf7": "Actually, I was expecting this, Kxf7 looks safe, and worth the extra piece.",
        "6... Kxf7": "Possible responses from the Baron? Bc4 looks plausible. Note the placement of my knight, by choosing to develop it early to it's best square, it prevents my opponent's queen from playing threatening queen moves such as Qa5 or Qg4. The Knight defends beautifully from there.",
        "7. Bc4+": "As predicted. Too late for me to react to this now, as it's way past midnight, and I have to get up early for work tomorrow. To be continued.",
        "7... e6": "Protecting the King with the e pawn. White could castle and bring his rook into play on the half open file, but my pawn is backed by the bishop, and I could bring a piece or two out myself by then. I wanted to avoid a move like Ke1 because it would leave my king too exposed",
        "8. Nc3": "Protects the rook, and develops a piece.",
        "8... Bd6": "Reasons for this move : Develops a piece; the game is very open, and the player with better development should have the advantage. Also, it takes me a step closer to 'castling by hand' and takes my King to safety.\nI would have loved to have been able to play Ng4, but there's a time and a place for everything.\nPossible threats now : Nb5 I can deal with, Qf3 gives me time to bring out my h1 rook, Qe2 could have been a worry, but my bishop at c1 is nicely placed to deal with that.\n",
        "9. Qf3": "9. Qf3. Let's see, pins the knight, and prevents my light squared bishop from moving, with an eye on my b7 pawn. That's always a thing to remember when your opponent plays a queen move, it can threaten multiple pieces or squares simultaneously, and it's easy to miss out sometimes. The knight is well protected for the moment, and I could play Nbd2 if necessary, developing my Qside knight in the process. I could try Qe5 , to ease the pressure a bit, and see how my opponent reacts. He would most likely block the check with his bishop, giving me time to bring out my rook and continue with my original plan of castling by hand.",
        "9... Qe5+ 10. Be2": "10. Be2, as expected. My queen move also prevents White from castling, as O-O would be followed by Qxh2 . Time to bring my rook into play, but where? One of the two half open files (f and d), or Re8?",
        "10... Rf8": "I choose Rf8, as it allows Nd5 (after I take my King to safety), which threatens White's Knight currently protecting the queenside rook, while simultaneously attacking White’s Queen with my rook.",
        "11. Bb2": "I need to watch out for any discovered attacks on my queen now. But how soon do I need to respond to this threat? Do I have time to tuck away my King? What's the worst the Knight can do? And most importantly, the Bishop itself is unprotected, so a discovered attack may not be on the cards just yet. Another motive could be that my opponent plans to castle queenside, and use a pawn storm to tear up whatever protection I have left for my King. I don't like this at all.",
        "11... Kg8": "Safety first, the King looks better protected, and I manage to unpin my Knight. Must start preparing my response to O-O-O.",
        "12. O-O-O": "12.O-O-O. Let's see how this changes things. White's fianchettoed bishop is now protected, and can threaten my queen. Let's see what my options are. I have three pieces that I haven't developed at all, not a good idea in such an open game. The bishop and rook can't really move, and are running out of oxygen. Nc6 looks like the only developing move. But what if 12… Nc6?  13. Nb5. Among other options, an exchange of queens would suit me fine, will have to find ways to force it. Something like Qf4 would be a step in that direction, and would also take my queen out of the range of White's annoying darksquared bishop. But should I go for that now, with so many pieces still undeveloped? ",
        "12... Qf4": "In the end, I settle for Qf4. Getting White's queen out of the game, or even forcing it to move away from the h1-a8 diagonal would allow me to develop my pieces. Of course, White still has the option of replacing the queen on that diagonal with his lightsquared bishop.",
        "13. Qxf4": "Exchange of queens suits me fine, as I am a piece ahead. Also reduces the pressure that was being exerted on my queen side pieces.",
        "13... Bxf4": "Now let's see if the bishop replaces the queen on the long diagonal.",
        "14. g3": "Bishop must move, but what is the best square? Keeping it on this diagonal would be useful, as it prevents White from pushing the d-pawn. However, Bg5 or Bh6 could easily be blocked off with f4. In response, I could try Nbd2 followed by e5. Worth a try.",
        "14... Bh6 15. f4 Nbd7 16. Bf3": "I was afraid of that. Well, time to open things up a bit more, something along the lines of 16...e5  17 fxe5 Nxe5 which gives me some breathing space and gets rid of my isolated e-pawn.",
        "16... e5 17. f5": "I don't like this. Next up I suppose he'll support it with g4. I'll take measures to advance my pawn anyway.",
        "17... Re8": "I'm not too happy with my position, my extra piece hasn't meant anything so far, must get to the endgame quickly.",
        "18. Nd5": "Threatening my f6 knight, which is well protected by my knight on d2. I now have to find a way to prevent Nc7 which forks my rooks.",
        "18... Nxd5": "I chose to exchange knights, as :\nIt takes me closer to the endgame with two more pieces off the board, and\nI can now use my other knight as the blockader at f6.\n",
        "19. Bxd5+": "Where should I move my King? I chose Kf8, as I was worried about the possibility of being cornered by the two bishops.",
        "19... Kf8 20. g4": "Now my knight move Nf6 looks nice, forks White's bishop and pawn, and blocks the f pawn. One thing to keep in mind is a future g5 by Baron, which will fork my bishop and knight.",
        "20... Nf6 21. Bf3 Bg5": "So that when I play e4, if Baron tries Bxf6, I can retake with my bishop and replace one blockader with another.",
        "22. h4 Bf4": "What's next, g5? That will weaken the f5 pawn though.",
        "23. Kb1": "Makes it possible to advance the d pawn, my bishops are beginning to look less useful, I really haven't taken advantage of my extra piece. Baron's Knight sacrifice brought my King out, and I've been under pressure since.",
        "23... Rb8": "Looks like a clumsy and awkward move, but I can't think of anything better at the moment. Advance the b pawn next, and try to exchange the light squared bishops.",
        "24. g5": "Thought so, the blockader must move now. Nd7, and I wait for Baron's next move. His f pawn is hanging. If he brings it forward, the exchange gives him a passed pawn that is well advanced.",
        "24... Nd7 25. Be4 Kg8": "Protect my own hanging pawn. It seems to me as though I've been reacting to Baron's moves for a long time, rather then setting up some threats of my own. Hopefully things will change when my queenside pieces enter the play.",
        "26. d3": "New plan, will attack the lightly protected f pawn with a discovered attack, next move Rf8",
        "26... Nb6 27. Rhg1 Rf8": "Continuing with my plan, but I'm expecting Baron to play f6. Exchange of pawns, my King's exposed, not good.",
        "28. a4": "Return the knight to d7, and then start advancing my queenside pawns?",
        "28... Nd7": "The knight does provide added protection to my isolated e pawn though.",
        "29. h5": "I'm seriously thinking about sacrificing a piece here, the knight, if it eases the pressure on my King. For example, 29... Nf6. 30. gxf6   Rxf6. This could win White's f pawn for me as well, so I'd be a pawn ahead, with a Kingside pawn majority, and closer to the end game. But what are my opponent's options? If he decides to advance his pawn rather than take my knight, that suits me too, as I can exchange my knight for his bishop and retain my piece advantage. I'll go for it.",
        "29... Nf6": "Awaiting Baron's response…in hindsight, a better move may have been b6, but I was worried about the way my opponent's pawns were storming my already weakened King side defence. ",
        "30. gxf6 Rxf6 31. Rgf1 Bxf5": "I win the pawn, but how do I respond to Bxe5? Will the resulting exchanges be favourable for me?",
        "32. Bd5+ Be6 33. Be4 Bf5": "I notice the chance for the stalemate, and go for it. I apologise for the anticlimax. My endgame is my weakest point, it would have been good practice to continue, on the other hand, I was under a lot of pressure for a very long period, and was relieved with the draw.",
        "34. Bd5+ Be6 35. Be4 Bf5": "Draw, we share the points. I had an extra pawn, with a kingside pawn advantage, but I was under pressure from my opponent from a very early stage, and was relieved to get the 1/2. "
    },
    "url": "https://gameknot.com/annotation.pl/waskally-invitational-2007?gm=6268",
    "gameName": "Waskally invitational 2007",
    "players": "blackbaron (1402) vs. farhadexists (1608)",
    "opening": "Sicilian (B50)"
}