{
    "moves": {
        "1. e4": "The classic pawn opening.",
        "1... e5": "As Black, I've been thinking of trying the Pirc Defence, but this move works good as well.",
        "2. Nf3": "This move was played around 100 years ago and is considered the best response for White.",
        "2... Nc6": "Black doesn't have too much responses to White's second move, but White has a lot of responses to Black's second move.",
        "3. Bc4 Nf6": "The Two Knight's Defence. ",
        "4. Nc3": "Now, this looks like it transposed into the Four Knights Game Italian Variation.",
        "4... Bc5 5. d3 d6": "So far, both sides aquired symmetry. Nothing new here...",
        "6. h3": "I talked to a chess coach about this move and it seems like castling is necessary before playing this move. Therefore, this move was not necessary.",
        "6... Nd4": "Okay. I hope White takes my Knight because it seems like his best move at the point.",
        "7. Ng5": "Trapped Knight. Now you know why I liked Nxd4 better.",
        "7... Be6": "At the same time, I had to protect f7 at costs that include castling, which I don't mind giving up.",
        "8. Be3 Qe7": "This move is okay, but lets face it, I thought castling was better.",
        "9. Nd5": "I'm going to trade.",
        "9... Bxd5 10. exd5": "It is official: the LSB is a bad Bishop.",
        "10... O-O-O": "A risky move, although I don't think that the Kingside is any safer at this point.",
        "11. c3": "My only move, 11...Nf5.",
        "11... e4 12. dxe4": "It's my opponent's mistake of not taking the Knight. I don't know why he did this move, but I perhaps had no reason to play 11...e4",
        "12... Nxe4": "This is no good either. 13.cxd4 Nxg5 14.Bxg5 Qxg5 dxc5 15.dxc5 Bxc5 is what I originally thought would happen, but White made it easier to avoid the unnecessary material loss.",
        "13. Nxe4 Qxe4 14. f3": "That's reasonable... only for then.",
        "14... Nc2+": "This move automatically wins.",
        "15. Kf1": "And this moves enforces the win even more.",
        "15... Nxe3+ 16. Ke1 Nxd1+": "I will now be twelve points up.",
        "17. Kxd1 Qe3": "I get irritated at myself for not taking a free Bishop. As they say, \"Better safe than sorry.\"",
        "18. Kc2 Qf2+ 19. Kb3": "Now the King is out in the open wanting to kill himself. The problem now is getting to him.",
        "19... Qxg2": "I didn't really find anything that would help me win permanently. For my own benefit, I decide to wreck my opponent's pawn structures.",
        "20. f4": "Qxb2 shall win the game, but I can't go full throttle and lose the Queen for nothing.",
        "20... a6": "Plan B: I try to imagine what my opponent's game look like if I won the bishop for nothing. It seems like maybe I should chase it away from the d5 pawn.",
        "21. Bd3": "Unfortunately, I could not take the bishop. In fact, this was my consequence for not taking the bishop earlier.",
        "21... Qxd5+ 22. Bc4": "...Qc6 then d5.",
        "22... Qc6": "That's step 1.",
        "23. Bxf7": "I was not expecting that, but I didn't care.",
        "23... Qb5+": "Plan C: Queenside pawn push when or if I distract the Rooks... not a very bright plan.",
        "24. Kc2 Rdf8 25. Be6+ Kb8 26. f5": "...Bb6 then Rxf5 unless Rf1.",
        "26... Rfe8": "I set up my Rook and I will see if g6 is possible.",
        "27. a4": "Free pawn. Honestly, I don't know what was up with me on my next move.",
        "27... Qe2+ 28. Kb3 g6 29. Rae1 Qh5": "This would be why.",
        "30. f6 Rhf8 31. f7 Re7": "I thought that Plan B was the \"impossible plan by now and that C was too risky and it gets me into traps. This move was not necessary. 31...Rxe6! is what I missed. 32.Rxe6 Qd5+ would prove that plan B was still alive.",
        "32. Ka2": "I still could do Rxe6 and get the same results.",
        "32... g5": "This move was worse than Re7.",
        "33. b4 Bf2": "Ther was still another idea. Rfxf7 or Rexf7. I don't know which one is better, but I have a great feeling that they're both equal.",
        "34. Bg4": "There goes the pawn...",
        "34... Qxf7+ 35. Ka3": "and ther goes the Rook that Plan C covered. Atleast one of my plans worked, but remember that I wasted moves and lost many opportunities.",
        "35... Rxe1 36. Rxe1": "With the Rooks gone, I can now forget about the Bishop unless otherwise.",
        "36... Bxe1": "My plan: simply take the c3 pawn with the Bishop and invade White's corrupted forces.",
        "37. Be2": "My plan can commence.",
        "37... Bxc3 38. Bd1 Qf1": "There was a better move than this 38...Qc4, then Rf2 creates a crushing combination that the Bishop cannot withstand by itself. 38...Qc4 39.Bb3 Qxb4+ 40.Ka2 Rf2+ 41.Kb1 Qxb3+ 42.Kc1 Qc2#.",
        "39. Bc2": "Now 39...Qa1+ 40.Kb3 Qb2+ 41.Kc4.",
        "39... Qa1+ 40. Kb3 Qb2+": "You might laugh at me here (I don't blame you), but I actually thought this was checkmate and did not pay attention to the c4 square.",
        "41. Kc4": "Until he moved there. However, I did not lose my grip on White.",
        "41... Bxb4": "This move wins permanently. No matter what move he plays, I'll respond with Re1.",
        "42. Kd3": "Especially this move.",
        "42... Re8": "Mate in 1 is now visible.",
        "43. Bd1": "Qc3 mates.",
        "43... Qc3#": "That's the game. Something occured to me during this game; it was the motto, \"When faced with a challenge, look for a way, not a way out.\" Aside from missing out on early opportunities and missing out on tactical advantages, I finally pulled though and checkmated White. There is more than one way to do something. Next time, I should think more slowly to get the best moves possible. You make a decision, it becomes your choice and it leads you to your consequences."
    },
    "url": "https://gameknot.com/annotation.pl/wasted-oppotunities?gm=43463",
    "gameName": "Wasted Oppotunities",
    "players": "mforddog (1193) vs. chesskingdom64 (1208)",
    "opening": "Two knights defence (C55)"
}