{
    "moves": {
        "1. e4": "The King's Pawn Play.",
        "1... e5": "The King's Pawn Opening.",
        "2. Nf3": "This is the King's Knight opening, and it is a transposition of the King's Pawn Play.  In addition, he wants to capture black's e5 pawn, for free. ",
        "2... Nc6": "Black responds by bringing out his or her queen's knight, to protect the e5 pawn.",
        "3. Bc4": "This is the Ruy Lopez opening, and it is a transposition of the King's Knight opening.",
        "3... Bc5": "In this position, black and white have both developed their minor pieces.",
        "4. Nc3": "He made this move to bring out his other knight and transpose the Ruy Lopez opening into the Double Knights Opening.",
        "4... Nd4": "Black chose this candidate to force an exchange with Nxd4 followed by Bxd4.  By the way, this was ! and the best way to handle the Double Knights Defense.  That is what I learned in a different annotation.",
        "5. Nxd4 Bxd4 6. Qf3": "Because his c4 bishop is out, he chose this candidate because he wants to mate black in one move, with Qxf7#, and that is what will happen.  I will explain this shortly.",
        "6... c5": "In my opinion, black chose this candidate because he or she had a Fight or Flight response and was worried that white would play b4.  Therefore, he or she probably felt that there was no way out of trouble.  However, this was ??, and the loosing blunder.  In fact, \"That looses immediately\", as Jack Stockel would say.  Nf6 or f6 might have enabled him to play b4, but it would have been a better choice as it would have prevented a check mate.  That is because he now has an inevitable mating pattern against black and will mate him or her in one move with Qxf7#.",
        "7. Qxf7#": "There is an important lesson to learn from this game.  There is usually a way out of trouble, and this is feasible 99.7% of the time, according to Jack Stockel.  On the other hand, I used to think that there was only one way out of a bad situation, and that put me through a, \"Fight of Flight\", response. In addition, it caused me to be pessimistic and inflexible, so I used to make moves that I felt were forced.  However, those moves were also loosing blunders, in some cases.  Now, I remember that there is, generally, more then one way out of trouble. That is because I remember Jack Stockel's advice to, \"Think about things\", and, \"there is always another way to do something\"... as chesskingdom64 would say.  However, there are then better ways to address a problem. The question then becomes the best way.  That is because there is one way that works the best, but there are other solutions, as well.  After all, \"The glass is half full, not half empty\", as they say.  Therefore, I now try to solve a problem.  Then, I try to find a better solution to the problem.  This method is helping me to become a better chess player.  When a problem occurs (due to a blunder or an unexpected position), I view it as an extremely difficult equation with many solutions.  Then, I solve the problem by narrowing it down, until I find the best solution.  "
    },
    "url": "https://gameknot.com/annotation.pl/ways-out-of-trouble?gm=43354",
    "gameName": "Ways out of Trouble",
    "players": "psa121 (1253) vs. alice02 (1130)",
    "opening": "Giuoco Piano (C50), four knights variation"
}