{
    "moves": {
        "1. d4": "Dopo tre tentativi falliti con i pezzi bianchi, Sergey Karjakin decide che ne ha abbastanza con 1.e4. Dopo tutto, Carlsen era quello che ha deciso il tipo di apertura nella prima metà della partita così lo sfidante deve aver sentito una certa pressione per cambiare le cose. Nei loro precedenti incontri, Karjakin ha giocato 1.d4 solo tre volte contro il campione del mondo.",
        "1... d5": "Già Carlsen si differenzia dalla sua scelta di apertura giocata a Bilbao. Sicuramente Karjakin non può ripetere la combinazione giocata allora perché Magnus sarebbe in grado di rigiocare la stessa partita senza molto stress.\n(1... Nf6 2. c4 e6 3. Nf3 d5 4. Nc3 Bb4 5. Qa4+ Nc6 6. e3 O-O 7. Qc2 Re8 8. Bd2 a6 9. a3 Bd6 10. h3 Bd7 11. cxd5 exd5 12. Bd3 Na7 13. Qb3 c6 14. Qxb7 Nb5 15. Nxb5 axb5 16. Ne5 Rb8 17. Qa6 Ra8 18. Qb7 Rb8 19. Qa6 Ra81/2-1/2 (19) Karjakin,S (2773)-Carlsen,M (2855) Bilbao 2016)\n",
        "2. c4": ".",
        "2... c6": "Entriamo nel slava, generalmente considerata una solida apertura per il nero. Il Bianco spesso sviluppa con più facilità e spera di creare punti deboli sul lato di Donna, ma il Nero è in grado di espandersi con a6, dxc4, b5, c5 (come si vede nel gioco). Carlsen tentò di giocare la slava alle in Olimpiadi di quest'anno, ma prima di allora, non aveva giocato l'apertura dal 2014. A questo punto è facile pensare che il team del russo avesse preparato questa apertura per prendere in contropiede Magnus. Cosa però che non si è realizzata.",
        "3. Nc3": "Questa mossa permette alcune varianti della slava, limitando altre. (4. Nf3 è anche popolare, ma questo cambia la direzione del gioco portandolo in linee e posizioni complicate Questa variante è stata giocata più di 5000 volte: 4 ... dxc4 5. a4 Bf5 6. e3 e6 7. Bxc4 Bb4 . In questo caso il bianco ha fatto una concessione legittima sul lato di Donna consegnando la casa b4, ma Bianco mira a muovere alla fine e3-e4 e colpire nel centro. C'è una certa tensione in questa linea con una forte concentrazione di pezzi minori che non è presente nel proseguimento del gioco. Forse Karjakin rammarica della direzione che ha preso il gioco.)\n",
        "3... Nf6": ".",
        "4. e3": ".",
        "4... a6": "Altra variante: 4... e6 [questa é la più usata]\n",
        "5. Bd3": ".",
        "5... dxc4": ".",
        "6. Bxc4": ".",
        "6... e6": ".",
        "7. Nf3": "..",
        "7... c5": ".",
        "8. O-O": ".",
        "8... b5": "Questa mossa porta ad una struttura di gambetto di donna accettato.\n",
        "9. Be2": ".",
        "9... Bb7": ".",
        "10. dxc5": ".",
        "10... Nc6": "Un tentativo insolito giocato fino ad ora solo una volta.\nAltra alternativa: 10... Qxd1 11. Rxd1 Bxc5 12. Nd2 Be7 13. Nb3 Nc6 14. f3 O-O 15. e4 Rfc8 16. Be3 Ne5 17. Na5 Bc6 18. f4 Nc4 19. Bxc4 bxc4 20. Nxc4 Rab8 21. e5 Ne4 22. Nxe4 Bxe4 23. b3 Rd8 24. Ba7 Rbc8 25. Bb6 Rxd1+ 26. Rxd1 Bd5 27. Ne3 Bc6 28. Rc1 f6 29. Bd4 Kf7 30. Kf2 h5 31. g3 Ke8 32. Nc4 Bb7 33. Ke3 Rc7 34. Rc3 Rc8 35. exf6 gxf6 36. Nd2 Rxc3+ 37. Bxc3 Bd5 38. Kd4 Kd7 39. Nc4 Kc6 40. Kd3 [Wang,Y (2730)-Wang,H  (2734) Danzhou 2016 1-0 (64)]\n",
        "11. Nd2": "Dopo questa mossa il nero sta un po' meglio. Carlsen può conquistare una tranquilla patta. Probabilmente però non molto di più.\nAltra possibile variante: 11. Qc2 Nb4 12. Qb1 (12. Qb3 Bxc5 13. Rd1 Qe7 14. a4) 12... Bxc5 13. Rd1 Qc7 14. a3 Nbd5 15. Nxd5 Nxd5 16. Bd2 Be7 17. Qd3 Rd8 18. Rac1 Qb8 19. Qb1 O-O 20. Ba5 Rc8 21. h3 Rxc1 22. Rxc1 Rc8 [1/2-1/2 (21) Bischoff,K (2533) -Schlosser,P (2554) Austria 2006]\n",
        "11... Bxc5": ".",
        "12. Nde4": ".",
        "12... Nxe4": ".",
        "13. Nxe4": ".",
        "13... Be7": ".",
        "14. b3": ".",
        "14... Nb4": ".",
        "15. Bf3": ".",
        "15... O-O": "Altra possibilità : 15... f5 [Per creare un po' di pressione a Carlsen non restava che giocare questa mossa]\n",
        "16. Ba3": "La patta è nell'aria.\n",
        "16... Rc8": "Un errore inspiegabile che costringe Carlsen a giocare con senza possibilità di errore per un paio di mosse per salvare il gioco. Fortunatamente per lui la cosa si è rivelata abbastanza facile. Avrebbe avuto più facilmente la patta con qualsiasi altra mossa.\nMossa migliore: 16... Bd5 [gli avrebbe fatto la vita più facile] 17. Nf6+ Bxf6 18. Bxb4 Bxa1 19. Bxf8 Kxf8 20. Bxd5 Qxd5 21. Qxd5 exd5 22. Rxa1 Rc8 23. h3 Ke7 24. b4 Rc4\n",
        "17. Nf6+": ".",
        "17... Bxf6": ".",
        "18. Bxb7": ".",
        "18... Bxa1": ".",
        "19. Bxb4": ".",
        "19... Bf6": "Questa mossa garantisce una patta tranquilla.\n",
        "20. Bxf8": "A qiesto punto non servono altri commenti. Carlsen gioca per la patta, che oramai è sicura, e Karjykin non può far latro che accettarla.",
        "20... Qxd1": ".",
        "21. Rxd1": ".",
        "21... Rxf8": ".",
        "22. Bxa6": ".",
        "22... b4": ".",
        "23. Rc1": ".",
        "23... g6": ".",
        "24. Rc2": ".",
        "24... Ra8": ".",
        "25. Bd3": ".",
        "25... Rd8": ".",
        "26. Be2": ".",
        "26... Kf8": ".",
        "27. Kf1": ".",
        "27... Ra8": ".",
        "28. Bc4": ".",
        "28... Rc8": ".",
        "29. Ke2": ".",
        "29... Ke7": ".",
        "30. f4": ".",
        "30... h6": ".",
        "31. Kf3": ".",
        "31... Rc7": ".",
        "32. g4": ".",
        "32... g5": ".",
        "33. Ke4": ".",
        "33... Rc8": "Il risultato è stato una piccola sorpresa. Ma era difficile intravvedere un piano di gioco più utile al bianco. Volendo, però, quest'ultimo avrebbe potuto continuare a mantenere Carlsen sotto pressione. Ma con certi campioni è difficile forzare un errore che permetta una vittoria. Quest'ultima, a questo livello, è possibile conquistarla solo con una pianificazione perfetta del gioco e senza eccessive sbavature.\n"
    },
    "url": "https://gameknot.com/annotation.pl/wch-2016-new-york-usa?gm=62204",
    "gameName": "WCh 2016, New York USA",
    "players": "Karjakin, Sergey (2772) vs. Carlsen, Magnus (2853)",
    "opening": "QGD Slav defence, Alekhine variation (D10)"
}