{
    "moves": {
        "1. e4": "A normal, somewhat aggressive first move.",
        "1... e5": "I generally have bad luck with the Sicilian so I like Open Game.",
        "2. Nc3": "An interestingly defensive choice of knight movement.  This is more of a waiting move than anything, leading to the dangerous Vienna Game.",
        "2... Nf6": "Black decides to take the Falkbeer Defense, challenging the d5 square.",
        "3. Bc4": "White has nailed down the d-pawn by absolutely controlling the d5 square.",
        "3... c6": "Alekhine recommends Nxe4 here - this move is rather timid and not terribly good.",
        "4. b4": "More aggression, White is trying to assert control over the fifth rank.",
        "4... Bxb4": "But White makes a bad blunder there and gets Black's bishop out of the back rank, in a strong and annoying position to boot.",
        "5. d4": "Another, even worse move.  White is apparently trying to attack Black's center.",
        "5... Bxc3+": "Black sees the undefended knight and the opportunity to check the king and fork the rook as well.",
        "6. Bd2": "The most sensible move, White wants that bishop off the board.",
        "6... Bxa1": "Bxd2 or Bxd4 might be good here, but getting a rook off the board on the sixth move is always nice.",
        "7. c3": "White moves to trap the bishop in his corner; not the best move in the world since Qxa1 is available, though it does defend the d-pawn.",
        "7... Nxe4": "More and more captures, leading to a weak White formation.",
        "8. Qb3": "Prepping for a Bxf7, a really bad move as White should have other priorities.",
        "8... exd4": "Castling might work here but Black has nothing to fear from the weak check and will keep harassing White.",
        "9. Bxf7+": "White follows through. An attack, finally, although a weak one.",
        "9... Kf8": "Forced, basically, as Ke7 pins in the queen and is asking for something bad to happen.",
        "10. Nf3": "An attack on the center, White wants to bolster up his burgeoning attack.",
        "10... dxc3": "There is more havoc to be wreaked; White's attack is still pretty toothless and Black is having fun here.",
        "11. Bg5": "Now White has something going.",
        "11... Qe8": "Rather a mistake, as Nxg5 was available, but it sets up a discovered check.",
        "12. Qb4+": "An obvious move, Black thinks he can exploit the Black dark-squared bishop being involved.",
        "12... Kxf7": "Clearly he forgot that the queen was the only defender of the light-squared bishop.",
        "13. O-O": "Eliminates the discovered check and gets the rook into playing position; Black will take anything it can get.",
        "13... d5": "Black sees his neglected queenside and angles to get some of those pieces going.",
        "14. Re1": "Pinning the knight.",
        "14... h6": "White does not have terribly many good moves here and attacks the bishop, which is a bit close for comfort.",
        "15. Be7": "White appears to be evident on trading queens, though doing so at the cost of a bishop is high stupidity.",
        "15... Qxe7": "Black will take it.",
        "16. Ne5+": "A weak check.  Awful.",
        "16... Qxe5": "Why not do it?",
        "17. Kf1": "White has no idea what to do.",
        "17... Bb2": "Black wants to promote his long-neglected pawn and is trying to protect the promotion square.",
        "18. g3": "Building for a 19. f3.",
        "18... c2": "Black wants to promote.",
        "19. f4": "White did it, and Black can't promote.",
        "19... Nd2+": "Rather the worse intermezzo.  Bh3+ would have been better.",
        "20. Qxd2": "White will take the knight.",
        "20... Bh3+": "Black's caught on and will do it here.",
        "21. Kf2": "Black either pins himself in the corner, loses his queen, or does this.",
        "21... Qd4+": "Keeping the king moving.",
        "22. Qe3": "White finally wants to trade queens.",
        "22... Qxe3+": "And Black will do so.",
        "23. Kxe3": "Capturing with the rook would give direct promotion.",
        "23... Re8+": "Oh well, the rook will go anyway with this skewer.",
        "24. Kf2": "White will protect the rook.",
        "24... Rxe1": "Wins promotion.",
        "25. Kxe1": "The only decent move.",
        "25... c1=Q+": "And White resigned, utterly lost.  I'm sure I made mistakes.  Have fun with this anyway."
    },
    "url": "https://gameknot.com/annotation.pl/weirdest-game-ever-played?gm=38598",
    "gameName": "Weirdest game ever played",
    "players": "W1ze (899) vs. johnpbro (1039)",
    "opening": "Vienna game (C26)"
}