{
    "moves": {
        "1. e4 g6": "Mini-tournament game, I decide to go Modern.",
        "2. d4 Bg7": "White grabs the strong center and black plays the logical continuation of his first move.",
        "3. Nc3 d6 4. Nf3 Nf6": "Transposed into a Pirc Defense.",
        "5. Be2 O-O 6. O-O c6": "Preparing d5 and/or b5 and making a home for the queen on c7.",
        "7. Re1 Qc7 8. Bf4 Nh5 9. Bg5 h6 10. Be3 Nf6": "All that just to teach the white bishop a lesson.",
        "11. Qd3 Nbd7 12. Qd2 Ng4": "The pawn at h6 is in danger of 13. Bxh6. This knight move defends the pawn. The knight can be driven away by 13. h3, but then it simply captures with 13. ... Nxe3 and without the DSB, white has no attack on the black pawn at h6.",
        "13. Bf4 b5": "Probably not my brightest move. I think a day or two had elapsed and I had lost track of white's threats. In any case, black is now about to lose a pawn.",
        "14. h3 e5 15. hxg4 exf4 16. Qxf4 g5": "But the castle is safe. Who needs that pawn?",
        "17. Qg3 Re8 18. Bd3 Bb7": "adding pressure to the white pawn on e4.",
        "19. Nd1 c5 20. d5 c4 21. Bf1 Nc5": "White keeps retreating back to his back rank. Maybe black can get all the white pieces to go home?",
        "22. Nd2 Bxd5": "22. Nd2? was a small blunder. That knight was the only piece defending the rook on e1, and with the knight gone, the pawn at e4 is pinned and is no longer protecting the pawn at d5.",
        "23. f3 Bb7": "Now the white queen is defending the isolated rook on e1, so the black LSB must retreat.",
        "24. c3 Qb6": "Threatening to win white's queen with 25. ... Nxe4+.",
        "25. Kh1 Na4": "Forking two pawns, but they're defended. Still, it keeps white's knights busy.",
        "26. Rb1 Be5 27. Qf2 Qxf2": "A plan forms.",
        "28. Nxf2 Bf4": "The white knight on d2 has only two legal moves, both of which are suicide. It must be defended instead of moved. White's pieces are getting in each others' way.",
        "29. Re2 d5": "White's pawn on e4 is pinned. Again. The rook at e2 is defended, but white needs that rook to protect the knight on d2.",
        "30. Nh3 Bxd2": "White tried to chase away the bishop, but to no avail.",
        "31. Rxd2 dxe4": "And now black has gained a pawn.",
        "32. Be2 exf3 33. Bxf3 Rab8": "I'm not sure why white chose 33. Bxf3, saddling himself with doubled, isolated pawns on the g-file, when 33. gxf3 solved that problem nicely. White is inviting black to exchange bishops with 33. ... Bxf3, but that would only solve white's pawn problems, so black defends b7 instead.",
        "34. Rd7 Bxf3": "Ah, well, had to do it anyway. Maybe white planned this when he chose not to play 33. gxf3, though at this point, piece exchanges favor black with his material advantage.",
        "35. gxf3 Rbd8": "No point saddling a rook with the onerous duty of defending the pawn on a7 when there is attacking to be done.",
        "36. Rxa7 Rd2": "A rook on the 7th, always a thing of beauty. Of course, white has one too...",
        "37. Rb7 Ree2": "There, two rooks on the 7th is twice the beauty. White's knight on h3 is in trouble. 38. Ng1??? is suicide (38. ... Rh2#). 38. Nf2 and 38. Nf4 simply lose the knight. And leaving it there will lose the knight after 38. ... Rh3.",
        "38. Nxg5 hxg5": "White chose to win a pawn for the doomed knight.",
        "39. Rxb5 Nxb2": "Seems pawns are falling all over the board now, and one more will yet fall.",
        "40. Rxg5+ Kf8": "One wonders if white sees that black has a simple win in one move. ",
        "41. Rf5 Nd1": "Nope, he didn't see it, and now it's game over. 41. Rf5?? loses to an almost forced checkmate, beginning with 41. ... Nd1!. Look at those three black pieces working together like a well-oiled machine. White can survive, for the short term, with 42. Re5 Rxe5 43. Rxd1 Rxd1+ and now the white king escapes, but faced with a lone king against two black rooks, white would have a hopeless endgame and will soon be checkmated. All other continuations lead to checkmate with black playing Re1# or Rxd1#, though white can stall for a while with a series of rook moves.",
        "42. Rb8+ Kg7 43. Rg5+ Kh6": "Black wants to get his king to g6 where white's rook on the 5th rank cannot give check.",
        "44. Rh5+ Kg6 45. Rg8+ Kf6": "And now black wants to get behind his pawn. ",
        "46. Rf5+ Ke7": "46. Ke7! is the winning move. Not 46. ... Ke6? allowing white to escape the checkmate with 47. Re8+ and 48. Rxe2. Now white has no safe checks. All he can do is throw away his rooks.",
        "47. Rxf7+ Kxf7 48. Re8 Kxe8": "Rookless, white has nothing left.",
        "49. Kg1 Re1#": "Final position."
    },
    "url": "https://gameknot.com/annotation.pl/well-oiled-machine?gm=22885",
    "gameName": "Well Oiled Machine",
    "players": "soul2197 (1591) vs. blake84120 (1839)",
    "opening": "Robatsch defence (B06), two knights variation"
}