{
    "moves": {
        "1. e4 c5": "New Opponent, same old opening. An OTB game from last month. ",
        "2. Nc3 d6": "Figure we're headed for a closed Sicilian so I prepare e5 and open my bishop. Apparently Nc6 is more recommended but I think this is fine. ",
        "3. g4": "?! Way out of book, my Fritz tree doesn't have this move and the GK World database shows three games. Fritz recommends 3... Nc6",
        "3... Nc6": "What'd ya know! ",
        "4. Bg2": "One reason to push the g-pawn, prepare Bg2. Fritz wants 4...e5",
        "4... Nf6": "Not necessarily a terrible move. If Black is thinking of castling long then the knight can traverse from f6 to d7 to b6 and rest happily eying d5 and c4. Fritz still gives Black a small edge here (-.25).",
        "5. g5 Ng4": "?? Heeere's the blunder, quick trap the knight! ",
        "6. f4": "! Duh. At the time I was thinking that my opponent would play f3, then I would play to e5, c4, then b6. Pretty silly considering the other path previously mentioned. ",
        "6... h5": "Not wanting to resign this early I tell myself, o.k. I'll recapture with my bishop and see what, if anything, I can make of the position. Then a few moves down the line I'll resign. ",
        "7. h3 Nd4": "Trying to see if I can stir up some problems deep in White territory. ",
        "8. hxg4 Bxg4": "As planned, but the plan is not a good one. Accurate play leads to immediate disaster for Black. Fritz recommended 6...h6 7.h3 hxg5 8.hxg4 Rxh1 9.Bxh1 gxf4 An interesting struggle with black getting two pawns for the piece. Evaluated at (.39) after 10. Nh3 e5",
        "9. Nf3": "While this move isn't losing, it does lead to trouble for White later on. Voluntarily placing the knight in the pin with the knight on d4 wasn't the wisest move. Force the bishop trade with 9. Bf3 Nxf3+ 10. Nxf3 , develop and castle queen-side and the game is quite comfortable for White. ",
        "9... Qb6": "Misplayed by black, the text allows Nd5, a very strong post. Fritz recommends ...h4 immediately by Black with the score at (.93)",
        "10. d3 e6": "I realize the knights dangerous post and hasten to rob it of that square. ",
        "11. Na4": "Perhaps goaded by the pawn on e6 to look for knight moves White plays the pointless Na4. ",
        "11... Qa5+ 12. Nc3": "Forcedly admitting the error. White still maintains a lead (.41) after the recommended ...h4. ",
        "12... b5": "I'm insistent on letting White win this game as this gives white a much bigger edge after 13.Kf2  (2.49) White must be feeling confident up a piece and not searching for the strongest moves. ",
        "13. O-O": "? Instead of searching for the strongest moves White has played one of the weakest, castling directly into my only hope for counter play on the h-file. ",
        "13... h4 14. Qd2": "This is the \"losing\" move for White. Not actually a losing move but it puts the game back on even keel (-0.05). ",
        "14... h3 15. Bh1 b4": "Want to drive this knight off the protection of e2. ",
        "16. Nd1": "Here's the losing move for White. Correct is 16. Nxd4 since this knight has been unpinned, remove the multiple threats of f3. \n",
        "16... h2+": "Tactics abound from the position forward. For example...\n\n17. Nxh2 Ne2+ (see why we had to drive that knight off?) 18. Kf2 Rxh2+  (-1.16)\n",
        "17. Kf2 Nxf3 18. Bxf3 Bxf3": "Black is destined to promote. ",
        "19. Kxf3 h1=Q+": "Only (-1.62) After Rxh1 Rxh1. But after doubling the rooks on the h-file it should be easy to convert. ",
        "20. Rxh1 Rxh1 21. Kg2 Rh5 22. Qe2 g6": "Pretty simple moves but White's fate is sealed discounting another blunder by me. ",
        "23. Ne3 Be7 24. Bd2 Kd7": "Looking to bring the rook to h8.",
        "25. Nc4": "Sure, but no real threat.",
        "25... Qc7 26. c3": "? Could possibly try 26. Be1 Rah8 27. Bg3 to give the king some protection. This allows Black to easily launch an attack. ",
        "26... Rah8": "Here we're at (-3.08) and white can easily resign. Fritz recommends Qf3. Instead White plays...",
        "27. Kf3": "to get to (-9.09) since this allows....",
        "27... Rh5h3+": "28. Kg4 Rh8h4# or 28.Kg2 Rh2+ 29... Rxe2. \r\n\r\nA lucky game with one material blunder from me but many positional blunders from my opponent. "
    },
    "url": "https://gameknot.com/annotation.pl/western-ma-ct-valley-championship-rnd-1?gm=22897",
    "gameName": "Western MA/CT Valley Championship, Rnd 1 ",
    "players": "Alex Relyea (1807) vs. Matthew Webber (1532)",
    "opening": "Sicilian (B23), closed"
}