{
    "moves": {
        "1. e4": "The King's Pawn Play.",
        "1... c5": "As we know, this is the, \"cornerstone\" Sicilian Defense.  This defense is studied by masters and grandmasters, and this is how Bobby Fisher beat a well known Russian player in a famous chess game.",
        "2. Nf3": "! Jack Stockel has told me that this is the way to handle the Sicilian defense.  Then, if black plays d6, white should respond with d4. ",
        "2... d6": "Her continuation of the Sicilian Defense.",
        "3. d4": "My continuation of the Open Sicilian.",
        "3... cxd4": "Of course, this was black's best move here, and Jack Stockel has also told me that in the past, when I played with him.",
        "4. Bb5+": "?  When I did this with Jack Stockel, he said that he was not crazy about this move.",
        "4... Nc6": "Of course, she could have also played Bd7, but I am not sure if this candidate or Bd7 was better, in this position.  That is because I will still force an exchange and get a pawn back, when 5.Bxc6+, bxc6 16.Nxd4 are played.",
        "5. Bxc6+ bxc6 6. Nxd4 Bb7": "She made this move to form a, \"Fianchetto\" with her dominant bishop.",
        "7. O-O": "I decide to castle on the king side, where it is safe to do so, and this is still my favorite move.  ",
        "7... Nf6": "Now she starts to develop her knight because she wants that pawn, but I do not see that threat.",
        "8. Bg5": "This is where I make my first serious blunder.  This move appears good because I am now threatening to capture her knight with Bxf6, in my attempt to force it away.  However, it is actually ?? because the knight is not pinned, so my e pawn is not protected.  Therefore, she will capture that free pawn, when Nxe4 is played.  Better would have been Qf3, Nd2, or f3.",
        "8... Nxe4 9. Nf5": "??  I have no idea why I made this move, but it is another serious blunder because she will be able to capture another free piece, when Nxg5 is played.  This time, however, it is my bishop.",
        "9... Nxg5 10. Qd2": "I chose this candidate to chase away her knight, so this was !, in my opinion.",
        "10... Ne6": "Now, she is forced to pull her knight away.",
        "11. Re1": "I do not know why I made this move because her knight was already protected by her f pawn.",
        "11... Qb6": "In this position, she is threatening to capture my pawn with Qxb2, but I am not about to let that happen.",
        "12. b3": "Therefore, I made this move, so it is !.",
        "12... g6": "In this position, she is threatening to capture my knight with gxf5, but I will not let that happen, either.",
        "13. Ng3": "Therefore, I chose this candidate.",
        "13... Bg7": "She made this move to form her second, \"Fianchetto\".  I recently found out that two, \"Fianchetto's\" from the same player is rare and hard to find.",
        "14. Nc3": "I chose this candidate because it brings me one step closer to connecting my rooks.",
        "14... Qa5": "She made this move in order to attack my knight with her queen and bishop because it gives me less protection.  After all, Jack Stockel would say, \"count your pieces\".  That is because she is protected by two pieces, but I am only protected by one piece.",
        "15. Re3": "Not ?  However, it would have been better to connect the rooks with Rd1 because my a pawn is already protected by my knight on c3.",
        "15... Bh6": "She chose this candidate to pin my rook, so this was !!  That is because I will loose my queen, if I move my rook.  This is the first time that I have seen my rook pinned.  ",
        "16. Rae1": "Therefore, I connect my rooks, this time, because both of my rooks are now on the e file.  However, that will not help because my rook will be exchanged with her bishop when Bxe3 followed by Rxe3 are played.",
        "16... Bxe3 17. Rxe3 d5": "I think that she made this move to trick me.  That is because she probably wanted to set a trap with a, \"Deflective Sacrifice\".  In other words, it is likely that she wanted me to capture her pawn so that she could capture my knight.  However, I was not falling for her trick.",
        "18. Rf3": "Therefore, this is played.",
        "18... d4": "Now, she wants to capture my knight, so she attacks my knight with her d pawn and queen.  However, I cannot move my knight because it is pinned.  If I retreat the knight, she will capture my queen with Qxd2. ",
        "19. Rd3": "Therefore, I protect the knight with my rook, but I could have protected my knight and queen Ne4.  Consequently, it is not the best move, and it is actually ??.  As a result, my knight will be exchanged for her pawn when dxc3 followed by Rxc3 are played.",
        "19... dxc3 20. Rxc3 Rd8": "In this position, she now threatens to capture my queen with Rxd2, so I must move my queen away from danger.",
        "21. Qh6": "??  This looks good because it protects my queen and, \"boxes in\" her h pawn, but this is my biggest blunder.  In fact, \"this looses immediately\" as Jack Stockel would say.  Qe2 would have been much better and my best move because it still protects my queen.  Then, if she plays Qxc3, I respond with Qxc3.",
        "21... Rd1+": "This is a very serious check, so I do not have options.",
        "22. Nf1": "That is because this move is forced.",
        "22... Qxc3": "As a result, I inadvertently give away a free rook.  Consequently, I am far behind, at -13, and she has an inevitable mating pattern against me.  That is because she will be able to mate me, as soon as she is able to play Qxf1#.   Therefore, I resign because I do not, \"stand a chance\" here.  It is not a good idea  not to make a move just because it seems good.  After all, \"don't judge a book by its cover\", as they say.  Instead, it is important to answer the, \"why\", questions in chess.  That is because you do not know if a move is good, unless you know the logic behind, you know what makes the move good or bad."
    },
    "url": "https://gameknot.com/annotation.pl/what-appears-good-might-actually-be-bad?gm=42950",
    "gameName": "What appears good, might actually be bad.",
    "players": "jkarp (952) vs. adivela (2075)",
    "opening": "Sicilian, Chekhover variation (B53)"
}