{
    "moves": {
        "1. d4": "A tactical unexpected victory.",
        "1... Nf6 2. Nf3": "I play the Budapest, but now it is impossible, so... what?",
        "2... h6": "I found this apparently dull move in the database. The plan is to play till g4. It is probably not so good, but I like to experiment. ",
        "3. c4 g5 4. Nc3 g4 5. Ne5 d6 6. Nd3": "White is not bad, but it is a strange play for him, since the knight in d3 is unusual. ",
        "6... Bf5 7. g3 Nbd7 8. Bg2 c6 9. e4 Bg6 10. f4": "This is the normal strategy of the average player: pawns up! It is not necessarily bad: I feel \"squeezed\", in fact. ",
        "10... gxf3 e.p. 11. Bxf3 e6": "I must just stay calm. ",
        "12. Bf4 c5 13. d5": "This is a mistake. He must open the white diagonal, not to block it. ",
        "13... e5 14. Bd2": "I hate this positions specially from the black point of view. He has a better position, undoubtely, more space, more ways of action. But he has the problem to seek the correct way to brake into mine. ",
        "14... h5": "Looking for some space for my pieces. I thought about the queenside, but I had not clear how we could fight there. I cannot easily penetrate, nor him. If he plays Nb5, a6 just gets it back. He can try with b4, but if he does, I can stand it. Despite of the blocked white diagonal, white seems to be very easy, and black very unconfortable. \nThe hidden reason for this move is to activate the black squares's bishop. ",
        "15. h4": "Thank you. Maybe he feared h4 from me... ",
        "15... Nb6": "The c4 pawn gives me a tempo. ",
        "16. b3 Qd7": "Controlling g4 and a4. I had nothing concrete in mind, till now. ",
        "17. Qe2 a5": "Well, if he doesn't go for the queenside, I will. Of course, I should have developed but... castling under the open g column? No, thank you. ",
        "18. O-O-O": "Red alert! The opponent made this move! Doesn't he see the danger on the a column? Probably yes, but he underestimated it. ",
        "18... a4 19. b4": "No no, it leaves c4 undefended. ",
        "19... cxb4 20. Nxb4": "Now he thinks everything is ok, since the c4 pawn is defended. But I already looked ahead. ",
        "20... Rc8 21. Nc2 Nxc4": "I thought a lot if to take with the rook, instead, threatening e4... I don't remember the whole sequence, but finally I decided to make the normal one, just to threat Nxd2 and Bh6.",
        "22. Bg5": "To defend or not to defend? I think this is a really interesting position. He can take my knight and my rook, but I will have two tempos... what can I do in 2 tempos? A lot. \nAnd, after taking the rook, his bishop would be trapped and almost useless. \nI didn't like defending moves like Bg7 or Nh7, since the key for me is to use the bishop in h6, just into the heart of white's position, and I won't accomplish that with them. \n",
        "22... Na3": "Variants are A LOT, and all interesting. \n\n23.\tNxa3\tRxc3+\n24.\tKb2\tNxe4\n25.\tBxe4\tBxe4\n26.\tQxe4\tRxg3...\n\n",
        "23. Rd3": "The correct one, I thought. Of course, I cannot just retire the knight, my other one must be lost for something.",
        "23... Nxc2": "I spent a lot of time looking through variants with both KxN, QxN, or the obvious BxNf6. I couldn't see a clear victory, there are a lot of tricks on both sides. ",
        "24. Kxc2": "Now, the key is in activating the queen, that is not easy. Qb5 only allows Rb1. I am pretty proud of the next move, that leaves BOTH my N and my R to his bishop just in order to win tempos.\n24.\t..., \ta4-a3\n25.\tBxf6\tBh6\n26.\tRb1\tQa4+\n27.\tRb3\tb5\n28.\tBxh8\tb4\n29.\tBxh5\tRxc3+\n30.\tRxc3\tb4xRc3\n31.\tKxc3\tQd4+\n32.\tKc2\tBe4+\n33.\tRd3\tQb2+\n34.\tKd1\tQc1#",
        "24... a3": "Opens the squares for the black queen, due to the pin of the white knight. After BxN, Qa4 and... wait a minute! There is no mate there! He could escape on the kingside, and I am not sure at all my attack won't vanish, letting me with just two pieces under!\nI went for it just after considering the 2º tempo the bishop's take will leave me. Time to block the white king with Bh6!",
        "25. Bxf6": "Ok, am I sure about what am I doing?",
        "25... Bh6": "No risk, no gain. ",
        "26. Bxh8": "7 points under. Bud, you better be sure about it, or you will lose with a much inferior opponent. ",
        "26... Qa4+ 27. Kb1 Qb4+": "Now, he blunders for a mate in two. But interesting is to observe\n28.\tb1-a1 \tc8-c3\n29.\th1-b1\t        c3-c1\n30.\tb1-c1\t        h6-c1\n31.\td3-b3  \tc1-b2+\n32.\ta1-b1 \tb4-c5\n33.\te2-e1 \tc5-d5\nPretty crazy... and I am still a rook under, but with a strong attack. Now, to be absolutely sure I will win, not at all! No risk, no win. \n\nOr, look at this one: \n28.\tb1-a1\t        c8-c3\n29.\th8-f6 \tb4-b2+\n30.\te2-b2\t        a3-b2+\n31.\ta1-b2\t        c3-d3\n\npure chess!\n\nBut \n28.\tb1-a1\t        c8-c3\n29.\th1-b1\t        c3-c1\n30.\tb1-c1\t        h6-c1\n31.\td3-b3\t        c1-b2+\n32.\ta1-b1\t        b4-c5\n33.\te2-b5+\tc5-b5\n34.\tb3-b5\t\n\nAnd I am the trapped one! But...\n\n34.\tb3-b5 \tf7-f5\n35.\tb5-b7\t        f5-e4\n36.\tf3-d1 \te4-e3+\n37.\td1-c2\t        g6-c2+\n38.\tb1-c2 \te3-e2\n39.\tc2-d2\t        b2-c3+\n\nSo he has to lose his rook for my bishop in order to save himself, so... enough? :-)",
        "28. Kc2": "Now he's lost. It's a pity. It could have been a most interesting game. ",
        "28... Qb2+ 29. Kd1 Qc1#": ""
    },
    "url": "https://gameknot.com/annotation.pl/what-a-sac-winning?gm=23490",
    "gameName": "What a sac! Winning?",
    "players": "tag1153 (1476) vs. damalfi (1715)",
    "opening": "Queen's pawn game (A46)"
}