{
    "moves": {
        "1. c4": "Although my opponent is higher rated than me, I have won every game between us. Most of the time I get Black against Dusan and he's already tried both e4 and d4 against me, so this time, he opted for the English opening.",
        "1... e5 2. Nc3 Nf6 3. Nf3 d6": "I decided to avoid the four knights variation to confuse my opponent, though I do enjoy that line.",
        "4. d4 exd4 5. Nxd4 Nc6 6. g3 Ne5": "Here, I'm not really threatening to capture the pawn, because of Qa4+. Developing one of the bishops would have been a more effective use of this tempo.",
        "7. Bg2 c6": "Now I have to watch out for a potential knight sacrifice on c6 followed by Bxc6+ picking up the rook on a8",
        "8. b3 Be7 9. Qc2": "White increases his control over the light squares.",
        "9... O-O 10. O-O Re8 11. Nf5": "Here White loses his opening advantage after allowing Black to trade his undeveloped bishop for White's centralized knight.",
        "11... Bxf5 12. Qxf5 Qa5": "Threatening ... Qxc3 and ... Nxc4 winning a pawn",
        "13. Qc2 d5": "Black must seize this chance to break through the center, else he will suffer if White is allowed to play e4, cramping Black's position.",
        "14. Bd2 dxc4 15. Nd5 cxb3 16. axb3": "Nxe7+ first was a slight improvement for White.",
        "16... Qd8 17. Nxe7+ Qxe7": "Black is up a pawn, has a 3-1 majority on the Queenside, but White has the bishop pair.",
        "18. Bc3 Nd5 19. Bd4 a6 20. e4 Nc7 21. Bc5 Qe6 22. Rad1": "White has the initiative here and it's unpleasant to defend as Black, thought the position is approximately equal.",
        "22... Rad8 23. f4 Rxd1": "Exchanging rooks will ease the defensive task and additional exchanges will eventually lead to a winning endgame.",
        "24. Rxd1 Ng4 25. Rd6 Qc8 26. Bh3 h5": "... Nb5 first was also an option",
        "27. Qd1 Nb5 28. Rd3 Qe6 29. e5 f6": "Attacking the pawn chain as in the French defence",
        "30. Bf1": "With the idea of an eventual Bc4",
        "30... fxe5": "Only move, else 31. h3 will be hard to meet",
        "31. Rd8 Kh7 32. Bc4 Rxd8 33. Qxd8 Qg6": "Here ... Qf5 was the most accurate move, for reasons that I couldn't figure out during the game.",
        "34. Qg8+ Kh6": "In this position, White can secure a draw by perpetual with 35. Bf8! (threatening 36. Qh8 Qh7 37. Bxg7+ winning) Qh7 36. Qe6+ Qg6 37. Qg8\nIf the Black Queen were on f5 instead, he'd be able to defend with 35. ... Qd7 and White's attack runs out of steam.",
        "35. Qh8+ Qh7": "White's best try here is to trade Queens, kick the Knight with h3 and then play fxe5.",
        "36. Qd8 Qb1+ 37. Bf1 exf4 38. gxf4": "Here Black's best move is ... Nf6, intending ... Qg6+",
        "38... Qf5": "If my opponent were not in time trouble, he may have found the drawing move 39. Be7!",
        "39. Qh8+ Kg6 40. Bf8": "... Qf6 here would allowed a perpetual with Bd3+ Bc4+ Bd3+ ...",
        "40... Qd7": "White's best try is 41. Bd3+ where the King is forced to go to f6 else Black's Queen will be skewered.",
        "41. f5+ Kxf5": "I was feeling pretty bold here and pretty good about my position because I saw that once the King reaches f4, there are no more checks",
        "42. Qxh5+": "Bxg7 was a better try",
        "42... Kf4 43. Bc5 Qd5": "Once queens come off the board, Black's two knights will overpower White's bishop pair due to Black's better King position and passed IQP.",
        "44. Qxd5 cxd5 45. Bg2 Nc3 46. h3 Nf6 47. Bd6+ Ke3 48. Bc5+ Kd2 49. h4 Nfe4 50. Bf8 g6 51. Bg7 Ne2+ 52. Kh2 Nf4 53. Bf3 Ke3 54. Bg4 d4": ""
    },
    "url": "https://gameknot.com/annotation.pl/when-2-knights-are-better-than-2-bishops?gm=63248",
    "gameName": "When 2 Knights are Better than 2 Bishops",
    "players": "Dusan Simic (2108) vs. David Fei (pdfiadp) (1924)",
    "opening": "English (A22), Bellon gambit"
}