{
    "moves": {
        "1. e4 e5 2. Nf3 Nc6 3. Bb5 f5 4. Nc3 fxe4 5. Nxe4 d5 6. Nxe5 dxe4 7. Nxc6 Qg5": "Check out the position! I've never really been able to resist this sort of tactical freewheeling  You may object that Black has no development to speak of, and you would be right. Black is playing early tactics, and taking a big risk in so doing. But it will be the tactics that will keep him in the game. Note that the queen was attacked on d8, but 7...bxc6 was scarcely playable on account of 8.Bxc6ch Bd2 and now 9.Bxa8 Qxa8 10.Qe2 ... and I don't see Black holding his e-pawn; or, better, 9.Qh5ch! Ke2 (9...g6 10.Qe5ch tsk tsk) 10.Qe5ch Be6 11.Bxa8... The line has been tried, though. \n",
        "8. Qe2": "Defending the attacked bishop \n",
        "8... Nf6": "Developing and defending the e-pawn. \n",
        "9. f4 Qh4+": "Instead, 9...Qxf4 is far more popular, more successful and played by players of the same rating as those who tried the check. i suspect, then, that 9...Qxf4 is the better line. But the text has its points... \n",
        "10. g3 Qh3 11. d4": "?? This turns out to be a mistake that I completely fumbled. Much better would have been 11.Ne5ch or Nxa7ch. \n",
        "11... a6 12. Ba4 b5": "?? Returning the compliment. The right move was 12...Bd7, which would have won a piece. \n",
        "13. Bb3 Bg4": "Black is probably losing, now, but the game is getting complicated. Anything could happen. ",
        "14. Qf1 Qh5 15. Be3 Bf3 16. Ne5": "! Threatens 17.Bf7ch winning Queen for two minor pieces. \n",
        "16... O-O-O": "? This should have lost. But it so happens that Black had an amazing move available that might have contained the damage to his position: 16...Ng4!! The idea is this: 17.Bf7ch Qxf7 18.Nxf7 Nxe3! 19.Qf2 Kxf7 20.Qxe3 Bxh1 The game would probably have been good for a draw for Black, at least. However, White could have avoided that and played 17.Nxg4 and retained an edge. Wow! ",
        "17. Nxf3": "Winning would have been 17.a4. White lights on that idea later on, with interesting results. ",
        "17... exf3 18. a4": "? It is remarkable how a move can be winning at one moment, and a move later, losing. ",
        "18... Bb4+": "! Obvious - completing Black's development - and strong ",
        "19. c3 Rhe8 20. Kd2": "!",
        "20... Rxe3": "!? Over sanguine. Even during the game I thought 20...Ne4 would be good. I just thought this exchange sac might be better. It isn't. But it should be good enough to hold. ",
        "21. Kxe3 Re8+ 22. Kd2 Re2+ 23. Kc1 Ne4": "? Wrong. The right move ought to have leapt to the eye: 23...f2! But the fact is, I already had this knight invasion lined up, and wasn't looking for alternatives. Let that be a lesson! ",
        "24. cxb4": "? During the game I thought he would play 24.Be6ch! first. \n",
        "24... Nf2 25. Bc2 Nxh1 26. axb5": "White lights upon a remarkable idea for counterattack. Unfortunately, is isn't quite good enough. Better was 26.Bd1 when maybe White can hold out for a draw. \n",
        "26... Qxh2": "? Instead 26...f2 was winning. \n",
        "27. Bf5+ Kd8": "! Instead, 27...Kb8 might well have lost! The game continuation should give the clue how that would have come about. \n",
        "28. bxa6": "With the Black King on b8, it would have been threatened with 29.a7ch. I didn't notice at the time that 28...Ka7 would have been an adequate defence. Never mind: the retreat to d8 was good enough. ",
        "28... Nxg3 29. a7 Nxf1": "White has given away a cubic yard of material for the counterattack promoting a pawn, but there is no checkmate. \n",
        "30. a8=Q+ Ke7": "White resigned: There is no saving the King unless the queen gives up her life: 31.Qe4ch Rxe4 etc.  Full of mistakes, yes, but a whole lot of fun!  Try the Schliemann: but be prepared to exercise your imagination! \n"
    },
    "url": "https://gameknot.com/annotation.pl/when-using-databases?gm=65122",
    "gameName": "\"When using databases...\"",
    "players": "DW  vs. archduke_piccolo (2172)",
    "opening": "Ruy Lopez (C63), Schliemann defence, Berger variation"
}