{
    "moves": {
        "1. e4": "like 90% of my white games I start with the kings pawn.",
        "1... c6": "This was my first time facing this pawn, too early in a game(Caro-Kann defence). though i was glad that i wont have to deal with knight c6.",
        "2. b3": "because he left the center for me I decided to be creative with my play, and I also assumed that he was also planning to \"Fanchette\" his bishop why else would he leave the center open like that.",
        "2... d5": "There we go \"a move I a more familiar with\".",
        "3. e5": "here obviously I had two choices these are either to go for the pawn exchange or gain more space and create a Tempo at e5 I choose the later. the pawn exchange would have lead to the unleashing of the knight on c6 so I could not have that, given the choice.",
        "3... Bf5": "to me this bishop was an empty threat there was no counter play necessary for it yet.",
        "4. Nf3": "I develop my knight, protect pawn e5 and prepare pawn d4 i liked this.",
        "4... e6 5. d4": "I was proud of that e5 pawn it made sure knight f6 will not be possible and it's now being supported by the pawn and knight. powerful pawn.",
        "5... Nd7": "Now the knight will find it difficult to be involved effectively in the game with my d4 pawn eying c5 and e5 squares.",
        "6. Nc3": "here I am simply developing my knight at this moment there is not much it can do in terms of moving forward because of c6. until I know more and play more this does not convince me to play c6 or f6 too early in a game, the reason being that the opponent will have a longer time to plan another path for his knight to infiltrate your kingdom.",
        "6... a6": "I beleive this was a waste of time and valuable move by playing pawn a6, pawn c6 is already taking care of the b5 square, i have not studied chess much but the only lessons I have  are develope, develope, develope, gain space and gain even more space while taking your opponents ability to do the same. this move is not reasonable to me especially from a >1800 rated player.",
        "7. Bd3": "Developing my bishop while threatening the opponents bishop.",
        "7... Ne7": "Another bizzare move to me. I aways like my knights in the third row from where I am seating so though h6 is less effective i think it could have been better or pawn g6 if you want to avoid a double pawn on the h file; that is if your opponent would take the risk of exchanging the knight for the dark square bishop. I geuss he was underestimating me so he decided to try out some new moves against me, but I know slightly better. however we could say that knight is protecting the bishop but then the only threat to his light square bishop is my bishop so the e6 pawn could do the job even though the pawn will be left hanging after, that is if I do decide to take it (the bishop) with my bishop so again knight e7 I don't fully get.",
        "8. Bg5": "PIN! I do my best to utilise any pin I see, if I don't have any agenda even an unnecessary one like this, (unnecessary in my own perspective).",
        "8... Bxd3": "finally he takes my bishop, In my mind now I am assuming that the knight protecting Bishop theory was right, so since I pinned knight I disturbed whatever he had planned so he decided to give up his bishop, I avoid doubling my pawns by taking with the queen, and hence more development.",
        "9. Qxd3 Qc7": "Since he moved the Queen thereby I lost my PIN on the knight I decided to take the knight, I did not mind the exchange since of all his pieces that knight had the best potential to invade into my zone, plus never trust a knight in a higher rated players hands.",
        "10. Bxe7 Bxe7 11. O-O": "And my king shuts the door and orders his Queen to take charge and make the enemy surfer.",
        "11... c5": "I have had many games where the opponent prepares a pawn strike in the Queen side like this, that is in the side opposite to where I castled while it proves to be good for a pawn end game given that the pawns will have less distance to promote, I do feel that against an aggressive player pushing the pawns instead of lining an attack with the big pieces is dangerous, for obvious reasons. (an agreesive opponent will knock until you fall I think of it like boxing the pawn strike each pawn move is a body punch while head strikes are the big piece move) you need many body punches to win and it will take longer but with head strikes need I say more.",
        "12. Rac1": "Since I assumed my opponent was preparing for a queen side pawn strike I looked for potential of an open file and c qualified. in my mind if Pc5-c4 from there Pc4*b3 then I would go c2*b3 opening the  c file with the rook eying down through.",
        "12... Rc8": "You know you are on track when a stronger player mirrors your moves or rather thinks along your lines.",
        "13. Ne2": "I remove the knight to prepare for the presumed soon to come open file. besides that knight had a better future on the left side of the board. with all the uncharted squares.",
        "13... c4": "here I had to move my queen obviously.",
        "14. Qc3": "I had originally planned on moving the queen to the right side of the board but then I realise the potential threats my opponnents bishop and queen had if positioned in the a5 and b4 squares so I realise that my queen can stop that potential.",
        "14... b5": "this pawn made me realise that hopes of the open file are gone.",
        "15. b4": "the queen made it possible for me to make this move without the queen this would not be possible. because of the bishop.",
        "15... Nb6": "thats when i realised that I took that knight for granted, however in some  few minutes I realised that he was not much of a threat given that he had potential for a4, b2 and c3. even though i had no low points piece to exchange him for.",
        "16. a3": "the knight made me realise that at one point i will have to move my queen leaving  b4 pawn valnerable, i moved pawn a2-a3 to support him. now I am ready for his knight's inversion.",
        "16... Na4 17. Qe3 c3": "That pawn scared me but again some assassment made me realise its not much of a threat.",
        "18. Rca1": "the rook no longer had any use on the c file so i looked for another job for it, it could work to difuse the knights threat, i was ready to loose one rook for that knight given that its his only real threat.",
        "18... O-O": "he castled, If i were him I would not castle for the whole game, or I could have spared the rook c8 move for long castling in the first place, the reason being black here has little control of the king side so king taking refugee on the queen side would have been best besides the porn structure.",
        "19. Rfb1": "I prepare to neutralise the knight threat.",
        "19... a5": "I guess here he is/was trying to knock my queen side down. my counter play here is governed by a simple strategy for me \"NO DOUBLE PAWNS\". so i let him take if he wants to.",
        "20. Ng5": "while i prepare for delivering a head punch",
        "20... h6": "I guess I got too excited and overlooked the potential of his h file pawn and his bishops grip on the g 5 square.",
        "21. Nh3": "i realised that my queen needs more space i thought its wise not to return knight to f3  but to h3.",
        "21... axb4": "finally.",
        "22. axb4 Qc4": "my mustache rattles when queen made this move i was not prepared for this, i assessed the danger that queen imposes on my kingdom and concluded that most of the threats are passive specifically the threats on the e2 knight and d4 pawn.",
        "23. Ng3": "Immediately i move my knight but mainly because i am preparing to do some damage on my opponents king side, again my strategy is to produce a state of perpetual check and prepare another piece that can allow for a checkmate. if the bishop was not there i could have allowed his h file pawn to take my knight just so my queen can be in that square.",
        "23... Bxb4": "I was too busy with the attack strategy that i forgort about that pawn, but then thinking about it made me realise that there was nothing i could do for it.",
        "24. Nh5": "Attack!",
        "24... Kh8": "I guess here he felt the heat but i wasn't deterred.!",
        "25. Ng5": "at this point i am now in beast mode, i dont give much thought I simply knock until the door falls.",
        "25... Be7": "the bishop is back, but its too late seeing how last time it was there there was only one knight, now there is double trouble. ",
        "26. h4": "advancing the h pawn to pile up more pieces there and deliver fatal blows.",
        "26... Rc7": "here i assumed he smelled the disaster so he got his rook involved taking the 7nth row there.",
        "27. Qf4": "Getting my queen into the action there while still protecting the d4 pawn.",
        "27... Bc5": "the bishop again now I think my opponent felt the need to develope his own attack strategy and the fact that my knights have moved forward provided the window for that through the d4 pawn, but then by now i had a dont care attitude because i knew and felt that the two knights and pawn with my queen can do something fatal to his king.",
        "28. Nxg7 Qxd4 29. Qf6": "again ignoring his threats i move my queen forward.",
        "29... Qxf2+": "i admit that thinking about his queen so close to my king was scary, so i had the option to exchange the queens but then i imagined that without the queen there is no way my knights alone could checkmate him, and my rooks may not be able to come to the aid in time before his big pieces invade my space, this made me nervous since i did not want my opponent to control the game so i decided to simply move my king, and let the queen exchange be on his terms while i cross my fingers that he wont make it an option. i knew that the first row is secured by my rooks and of if he takes my h file pawn with a check i will block with my horse.",
        "30. Kh2 Qxf6": "And my queen falls. i cringed! I admit at this point I nolonger had hopes of winning but I was seeing how I still had the ability to give my opponent some hard times I went on with the game.",
        "31. exf6": "Here i knew i am soon to moan my g4 knight, and I knew i had to find ways to get my rooks into the action now that the board is now in this position i reversed my initial thought(that it would take long for my rooks to be involved) now i think i can easily get them to take advantage of the h file.",
        "31... hxg5 32. hxg5 Rg8": "I was not sure that my high rated opponent would exchange 5 points for three besides that knight is not much of a threat there, i realised that if he does(take my g7 knight). i would have to make a plan to take over control of the 8th row after I take his rook with the pawn. since none of his pieces would be able to stop me after I take the b5 pawn, all i wanted was to remain in control of the game. so my next move would be obvious taking that hanging pawn.",
        "33. Rxb5 Nb2": "again this is one of his blunders in my eyes now is not the time to attack Sr, you lost your window, knight b6 would have been better.",
        "34. Rh1": "there is no way he could stop the open check on the horizon the heat is back on.",
        "34... Rxg7": "finally he takes the knight!",
        "35. Rb8+": "if he moves rook g7-g8 moving my king into the g file would have led to a easy win.",
        "35... Kh7": "I guess he saw it coming at this time i had no plan other than to remain in control and look for tricks.",
        "36. Kg3+ Kg6": "As a puzzle this would not be even a Three star difficult puzzle. This was one of my best wins, and My 34-0 opponent converted to a 34-1, he could not take it, he sends a rude message, I could not send a reply since he blocked me, this was my first encounter of someone rude to me on a chess site I am free to chat with any of my opponents, I like interactive opponents as long as my opponent is comfortable with it and this player shocked me, currently I am in a masters tournament and I am playing against players slightly above 2000 in ratings I hope they won't be as arrogant, I am an engineering student and if someone thinks my mind is like a computer I take it as a complement.",
        "37. Kg4": "And he resigns seeing how rook h6 would be fatal, and if he tries to take over the h file with his rook my 8th row rook would deliver a similar blow on g8. Thank you for  taking your time to go through the annotation. \n\n\n\n\n\nThank you Administration for a great chess site. Thank you gameknot community for simply loving the game, the true gentleman and Ladies' game. #my name is Gwinyai. #mynamejeff."
    },
    "url": "https://gameknot.com/annotation.pl/when-you-underestimate-kings-pawn?gm=63493",
    "gameName": "WHEN YOU UNDERESTIMATE KINGS PAWN.",
    "players": "mnamejeff (1412) vs. Concealed (1802)",
    "opening": "Caro-Kann defence (B10)"
}