{
    "moves": {
        "1. c4": "This game against 2hopeful was a great game were I thoroughly enjoyed the ending. Unfortunately my opponent had a minor mishap (See title) and was the funniest reason I have ever heard for why someone lost. Read on and enjoy.\n\nNot my usual but I am enjoying playing different openings",
        "1... e5 2. g3 d5": "!? I haven't faced this before",
        "3. cxd5 Qxd5 4. Nf3 e4": "?! ",
        "5. Nc3 Qe6 6. Ng5 Qd7 7. Ngxe4": "Was this the right knight?",
        "7... Be7 8. d3": "Supporting the knight and allowing development of the lsb",
        "8... Nc6 9. Bg2 h6 10. a3": "This was because I was thinking whether to play b4 and Bb2",
        "10... Nf6 11. Nxf6+ Bxf6 12. O-O O-O 13. Nd5": "This was played a while ago but I like this square for my knight. Also allows the DSB to be placed on b2",
        "13... Be5 14. e3": "Preparing d4 allowing the Dsb to be developed but after d4 is it the correct place?",
        "14... b6 15. d4 Bd6 16. e4": "I decided no looking for Bf4 followed by Nxf4 after Bxf4",
        "16... f6 17. Bf4 Bxf4 18. Nxf4": "g6 is a good hole for the knight but I never get there",
        "18... Ba6 19. Qb3+": "At this moment I had ideas of e5 Bringing the LSB to e4 and sacking the exchange",
        "19... Kh7": "I realize it won't work so...",
        "20. Qe6 Qxe6 21. Nxe6 Bxf1 22. Nxf8+ Rxf8 23. Kxf1": "I trade material but lose my d-pawn. However I have a B v N advantage which I will look to make use of in the endgame.  Also notice how all black's pawns are on dark squares. This is something I will have to change if I am to win",
        "23... Nxd4 24. Rc1 c5 25. b4 Rc8 26. bxc5 Rxc5": "?! was bxc5 better I like having the rook behind a passed pawn",
        "27. Rxc5 bxc5 28. f4": "I need to develop my king while avoiding a fork. Ke1? Nc2+! wins the a-pawn and the 2 passed pawn will be hard to stop. Even if the pawns are captured without losing the bishop. The knight should be the better minor piece with all pawns on 1 side.",
        "28... g6 29. Kf2 Kg7 30. Bf1": "Stopping the c-pawn advancing. Was Kg1 a mistake. Was 29...c4 better. I think so note how Ke3 fails to Nc2+ Kd2 Nxa3 Kc3. Although white gets the c-pawn the a-pawn will be more dangerous than the c was. Then black should be able to get his king in behind the white K-Side pawns. (Only quick analysis) So I will come back later and do some more this may be mistaken. I managed to lose my notes on this position so I don't know what else I saw.",
        "30... a5 31. Bc4": "This stops the c-pawn from moving. However White's king is in a poor position so he needs to move the a-pawn to free the king. Also black maybe able to play a4 however I am not a fan because it places the pawn on a light square however this would free the c-pawn to be pushed. White will trade the bishop and have two pawns for his piece with one of them an outside passed pawn. Good thing with a4 is that it ties down the white king ",
        "31... Kf8 32. a4": "White will allow his king to move this also controls b5 which become important later",
        "32... Nc6": "Is black looking to go to b4 and stop the white king from escaping???",
        "33. Ke3 Ke7": "I want my king on c4 so I spend the next few moves looking to kick the knight to get my king in there. However as it transpires my king is better on the K-Side",
        "34. Bb5 Nd4 35. e5": "Trading allows White to move is king out. Also Look at how the LSB teases the knight. It frees the c and a-pawns however White will get a passed b-pawn which is more dangerous when combined with the e-pawn which is threatening exf6",
        "35... f5 36. h3": "Wanting to play g4",
        "36... g5": "Black can't play Nxb5 because of axb5 when the b and e-pawns will be more dangerous. Nxb5? axb5 a4 b6 a3 b7 a2  b8=Q a1=Q any king moves invite e6 or e6+ when the b pawn queens. That line I gave is the best. Looking now I think that this is playable but the line black plays is better.",
        "37. h4": "I prefer this over g4 because I like to keep two pawns together.",
        "37... gxh4": "g4 may have been better although the black pawns get on the light squares. But White will struggle to make use of this while the black king stop the white bishop from getting in behind enemy lines.",
        "38. gxh4 h5": "No king can break through the same would have happened is the black king moved some where after h5. ",
        "39. Bc4": "Wanting to get into f7",
        "39... Kd7": "? This loses. Now this is what my opponent said to me in chat: Too funny I was sleep walking and gave you an unearned pawn. This is the funniest reason I have ever heard for someone losing a game",
        "40. Bf7 Ne6 41. Bxh5 c4": "Black tries to get some counterplay but this is really a nothing move I think Ng7 was better",
        "42. Bg6 Ng7 43. Kd4": "now white should have an easy win",
        "43... Ne6+ 44. Kxc4 Kc6 45. Bxf5 Nxf4 46. e6": "! A great end to a good ending.",
        "46... Nh5 47. e7": "Black resigns after Nf6 Bg6 Kd7 e8=q+ Nxe8 Bxe8 Kxe8 Kb5 and white wins the a pawn and has two outside passed pawns which black can't stop. Thanks for the game 2hopeful. All comments welcome. I am wondering should this ending be drawn?"
    },
    "url": "https://gameknot.com/annotation.pl/when-you-need-to-control-your-sleep-walking?gm=43287",
    "gameName": "When you need to control your sleep walking",
    "players": "thedessertfox (1497) vs. 2hopeful (1616)",
    "opening": "English opening (A20)"
}