{
    "moves": {
        "1. d4 Nf6 2. c4 c5 3. d5 b5 4. cxb5 e6": "I normally play the Benko gambit however I've previously employed it a couple of times against this opponent and he seems to do well against my normal sort of set ups so I thought I would do well to deviate. After having someone play this very gambit against me I immediately decided I liked the look of it and knew I would have to give it a shot some time. Its called the Blumenfeld gambit. ",
        "5. dxe6 fxe6": "Of course ...dxe6 would make no sense, Now however it is true that blacks light squares have been weakened slightly, but taking advantage of that wont be easy for white. Plus black will be able to make use of the f file in the future plus with a pawn advantage in the centre and by following up with ...b5 black will end up having alot of open lines and long temr activity which promises black a good game",
        "6. Nf3": "I would probably play Nc3 myself, in order to facilitate e4 giving white some claim in the centre himself",
        "6... a6": "This is consistant, black wishes to open up files on the queenside so that black can make full use of the long term qactivity black will have and use it to apply plenty of pressure against white in all three sectors of the board",
        "7. e3": "I personally dont think this is the best way for white to really handle the position. In my opinion white would much rather get in e2-e4 and ideally that should be played in a single move, this move also does nothing to stake any hold in the centre and it blocks in whites DSB. instead moves like 7.b6 7.bxa6 come to mind one other alternative that seems quite interesting is 7.Nc3!? with the idea of ...axb5 8.a4!?",
        "7... Qb6": "threatening to win back the pawn which would bring back material equality in which case black would just have a positionally Superior game",
        "8. Be2": "? seems too passive, now black wins back the pawn which just leaves black supieror positionally. white should have tried either 8.bxa6 or 8.Nc3 and another thought that never occured to me but seems intriging is 8.a4!? intending to recapture with the bishop if black were to play 8...axb5",
        "8... axb5": "Black is better here because I know have the a file to make use of as well which already has the rook on it which got active for free also I have a more space and a better central structure black will have more activity and mobility and white already seems like they might end up a little passive",
        "9. O-O Be7 10. Na3": "?! usually when a knight develops via a3 or h3 its intention is to carry on to c4 or f4 or else it is maneuvering to c2 or f2, usually in order to help facilitate some sort of pawn break. In this case black controls the c4 square so the knight is simply out of play on a3 and doesn't do anything with regards to the centre. redeploying to c2 doesn't accomplish anything since since a later b4 can easily be met with c4. With that in mind this knight move doesn't make any sense, perhaps white was hoping I'd play ...b4 when the knight could make use of the c4 square, but that's hope chess and making moves with the idea being to hope your opponent will voluntarily make a weakness is a bad way to play chess ",
        "10... Ba6": "simply maintaing my space gaining pawns integrety, they restrict whites piece and leave him passive, so it is in my best interest to keep them as they are",
        "11. Nc2 O-O 12. Bd2 Nc6 13. a3": "we can already see the effects of never having got in e4 by white, because black controls more territory and whites pieces are getting in the way of each other it becomes very difficult for white to make useful moves, it seems like white has been trying to get in a b4 break, however this would be a mistake because it would leave a3 as weak and would give black a protected passed pawn",
        "13... Ne4": "centralising my knight and attacking the white bishop. whites position is already very bad since he has no play and blacks control of more territory and more active army give black a big advantage already",
        "14. b4": "As I outlined ealier, this move is a mistake because it leaves a3 weak (which also leaves the b4 square as a hole) and it gives black a protected passed pawn",
        "14... c4": "Despite material being equal I think black is already close to winning. white suffers from a lack of space, the a pawn is a weakness black has a better centre and more files and active plans, basically white has no active play anywhere on the board so because white is passive, balck can go into cat and mouse mode constantly improving the position of all the pieces and white cant do anything about it.",
        "15. Ncd4 Bb7": "the bishop was no  longer serving any purpose on a6 so it redirects to the more promosing a8-h1 diagonal ",
        "16. Qc2 Bf6": "This move indirectly defends the well centralised black knight since 17.Qxe4? Nxd4! it also x-rays the rook on a1",
        "17. Bc3 Nxc3": "Now that the bishop had made its way to an active diagonal I snap it off, this also lines up the queen and rook on the same diagonal as my bishop so there is potential for tactics. However I'm not certain this is the optimal move because my knight was really strong on e4 and I had more space so I didnt need to exchange pieces, the thing is however that blacks position is so strong at this point that most moves are very strong for black, this move gives black the bishop pair and does nothing to actually harm blacks huge advantage ",
        "18. Qxc3 Ne7": "This lets my bishop see and also gives my knight the chance to jump into either d5 or f5 ",
        "19. Qd2": "gets out of site of my bishop",
        "19... Be4": "it was possible to start my pawns rolling immediately but I thought there was no rush, so I got my bishop outside of my pawn chain, since ...d5 will be coming at some point and I can also redirect it to g6/f7",
        "20. Ra2": "getting out of the line of my bishop but now black decides its time to begin marching the troops",
        "20... e5": "the onslought begins, first this forces back the only centralised piece of whites",
        "21. Nc2 d5": "And now the second one comes rushing in ready to carry on to d4 and punch through the white ranks",
        "22. Nfe1": "? really bad move, this square is hardly an active square and now white is completly passive, it is now very easy for black to get in ...d4 and white will be run over, this also stops his rook entering the fray. I can only guess white was trying to do something with his f pawn or maybe put his bishop on f3 instead white should try to get his f1 rook working somehow, Rd1 comes to mind",
        "22... Bg6": "...d4 right away would have been thematic, however I felt no rush, I've said several times that white is passive so black can take the time to get the pieces placed optimally before pressing onward. Bishops work best from long range, so I place it on g6 where with the assistance of its patner on f6 they will work together to get the pawns steamrolling whites position, it also prepars to move to f7",
        "23. Kh1": "another move that does nothing for whites position, I suspect white is devoid of any plans and so not knowing what eaxtly to do he makes this king move, my hguess is he was thinking about mving the f pawn and did this so he wouldnt be in a pin. ",
        "23... d4": "Here they come, a central phalanx of pawns supporeted by the bishops is a wonderful thing to behold they can leave a trail of destruction in their wake as they push foward scared of no enemy piece",
        "24. exd4 exd4 25. Bf3": "white finally gets a piece active however it is too late, blacks pawns have already broken through",
        "25... Ra4": "Placing the rook on the hole where it continues to target the weakness on a3 and it also prevents any ideas white may have had about undermining the black centre with a4, though bring the rook to a central file to further assist the dynamic duo was also good",
        "26. g3": "I can only guess he is giving hiself a square for the knight on e2, you know things have gone wrong when you have to make such a move",
        "26... d3": "And they march the pawns are so strong infact that white immediatly gives up a piece",
        "27. Nxd3": "supported by the black bishops as they were white may have found the pawn duo delving yet deeper into the white position if he had not done this, moves like ...c3 attacking the queen followed by ...d2 where the innocent pawns made their way all the way to the seventh rank where they can further be supported by the rooks leaves a grim impression",
        "27... Rd8": "No need to immediatly take back",
        "28. Qe3 Qxe3 29. fxe3 cxd3": "even now they continue to push white into further passivity",
        "30. Ne1 d2": "This is played with the a2 rook in mind, it is already short on squares and this further cuts them off ",
        "31. Ng2": "After Nc2 Bf7 and the rook is gone however it is already game over, the same idea cant be stopped",
        "31... Bf7": "white resigns since he must give up further material. 32.Rc2 Bb3 followed by promoting the pawn, white has no chance."
    },
    "url": "https://gameknot.com/annotation.pl/when-centre-pawns-go-mobile?gm=49673",
    "gameName": "when centre pawns go mobile",
    "players": "turtlesedge (1504) vs. thereaper1 (1810)",
    "opening": "Benko gambit half accepted (A57)"
}