{
    "moves": {
        "1. e4": "The King's Pawn Opening.",
        "1... c5": "The, \"cornerstone\", of the Sicilian Defense.",
        "2. Bc4": "This is the third opponent who has attempted the, \"Four Move Trick\" during a team match.  Therefore, this game took place before some of my other games, including joelhender94.  I will get into more details about my last sentence during the end of this game.",
        "2... e6": "! This is the proper response to an attempted, \"Scholar's Mate\".  However, it will start to get ugly soon because I will go by my first instinct. ",
        "3. Nc3": "I originally thought that he had made this move to place his knight on the rim so that he could win a pawn with 3...Nxc5.  However, I forgot that my c5 pawn is protected by my DSB, so I do not know why he moved there.",
        "3... Qg5": "? Therefore, I bring my queen out because it is my first choice to protect the c5 pawn, but this is a blunder as it violates general opening principles.  According to the principles, you are not supposed to develop the bishop before your knight, unless there is an immediate tactical advantage.  Most importantly, you are not supposed to develop your queen, early in the game.  This mistake will cause serious problems, later in the game.",
        "4. Nf3": "That is because he chases my queen.  Therefore, I will loose a tempo and be forced to retreat my queen, or will I?  That will be answered shortly.",
        "4... Qxg2": "? I forgot that his g2 pawn was unprotected because he developed his LSB, in the beginning.  Therefore, I capture his pawn, and this is, btw, my first instinct.  As a result, I am now a point ahead, but this is a mistake that I will soon regret.",
        "5. Rg1": "That is because he is now threatening to capture my queen, with 6.Rxg1, and I cannot respond with 5...Qxg1+.  If 5...Qxg1+, I will loose my queen with 6.Nxg1.  Therefore, I will be forced to retreat my queen with 5...Qh3, this time.",
        "5... Qh3 6. Rg3": "! He chose this candidate to chase my queen, again.  ",
        "6... Qh6": "? Therefore, I am forced to retreat my queen, so I have lost two tempos, so far.  6.Qh5 is the only other option, and that would have been better.  That is because 6.Qh5 would have pinned his knight and keep my queen safe.  I will go into more details, shortly.",
        "7. d3": "If 6...Qh5, he would not have threatened 8.Bxh6, even if he made this move.",
        "7... Qf6": "?? Therefore, I am, once again, forced to retreat my queen.  However, this is the loosing blunder, eventhough the game is not officially lost, yet.  Like my game against binblaster, my queen is now trapped.  I had another chance to protect my queen and pin his f3 knight with 7...Qh5, but I blew it.  As a result, 7...Qh5 would have saved the game.   ",
        "8. Bg5": "! He chose this candidate to drive my queen away.",
        "8... Qg6": "Therefore, this move is forced.  In this position, I would loose my queen, a move sooner, if I had played anything else.  Having said that, I will loose my queen, right after my ninth move.  That will be explained shortly.",
        "9. Nh4": "!! In this position, \"a knight on the rim is dim\".  I originally thought that he placed his knight on the rim to chase my queen away, but it is far worse then that.  In reality, he made this move to win my queen.",
        "9... Qh5": "I believed this move was forced to protect my queen, but I overlooked his queen on d1.  Therefore, the game is officially lost, at this point, because he will capture my queen with 10.Qxh5.  ",
        "10. Qxh5 g6": "At this point, I usually resign in most games.  However, I am determined not to do that, in this case, because this is a team game.  Remember: a team game affects the entire team.",
        "11. Qg4": "I do not know why he made this move.",
        "11... f5": "? I chose this candidate to chase his queen away, but this is a blunder.  He can force an exchange with 12.exf5, but I do not want to exchange pieces because I am far behind, due to my lost queen.",
        "12. Qf4": "Therefore, he retreats his queen, but 12.exf5 would have been better, as I had mentioned earlier.",
        "12... Bg7": "I made this move to fianchetto my DSB.",
        "13. Nb5": "At first, I did not know why he chose this candidate, but I quickly discovered the reason.  In this position, he is threatening to play a very powerful fork with 13...Nc7+.  If this happens, he will win my rook with 14...Nxa8, but, \"I cannot allow that\", as Jack Stockel would say.",
        "13... Na6": "Therefore, I am forced to put my knight on the rim. ",
        "14. Nd6+": "! I had no idea that he was going to place me in check, and this turns out to be a serious fork.  ",
        "14... Kf8": "? 14...Kd8 would have been my best move as it would have protected my LSB.  In this position, he can force an exchange with 15.Nxc8, Rxc8.  As I had mentioned earlier, I do not want to exchange pieces.   In addition, I lost my chance to castle, but that also would have happened with 14...Kd8.  He does not respond with 15.Nxc8, but it is far worse then that.  ",
        "15. Nb5": "In this position, he will find an inevitable mating sequence with his Queen, DSB, and b5 knight.  What did we learn from this game?  Your first choice is correct when you take enough time to come up with your first instinct.  However, it does not work when you, \"rush to judgment\".  Second, it is not a good idea to bring your queen out in the beginning, or you opponent will chase away your queen while he or she develops his or her minor pieces.  BTW, this was one of my earlier games.  In other words, this took place before some of my other games including but not limited to: woustra, binblaster, and joelhender94.  Having said that, I want to thank casper-walbo and his team for giving me this game.  It has made me become a stronger player, if you count my other opponents that I had mentioned in my last sentence.  In addition, this game has made it possible to annotate my game against woustra.   "
    },
    "url": "https://gameknot.com/annotation.pl/when-your-first-choice-is-correct?gm=43888",
    "gameName": "When your First Choice is Correct",
    "players": "casper-walbo (951) vs. jkarp (976)",
    "opening": "Sicilian defence (B20)"
}