{
    "moves": {
        "1. e4 c5 2. Nf3 a6": "Again, chikochiko played his pet line, the O'Kelly Variation of the Sicilian Defence. I started to dread this game, because as you guys know, I almost lost the first game against chikochiko with this variation.",
        "3. d4": "So, I decided to try something new so as to bamboozle my opponent. I attacked the center immediately so as to force him to respond to my moves.",
        "3... cxd4 4. Nxd4 d6 5. c4": "My plan at the opening is to set up a Maroczy bind like setup and cramp my opponent's position, making his position harder to play.",
        "5... e6 6. Nc3 h6 7. Be3 Nf6 8. Be2": "My opponent waits defensively while I continue with my setup.",
        "8... Qa5": "NOT AGAIN!?!? chikochiko is one stubborn guy! He played this move on our first game, and now he does this again! WOE is he thinking? I started to dread this game even more.",
        "9. Qd2": "Instead of playing Nb3, I protected my knight by floating up my queen, allowing me to castle freely either on the kingside or the queenside.",
        "9... Bd7 10. f4 d5": "chikochiko starts the assault on my center, probably seeing his cramped position. This move also frees the dark-squared diagonal for his dark-squared bishop.",
        "11. e5": "Obviously, I did not want to give my opponent more space and sacrifice my center, so I attacked his knight.",
        "11... Nh7": "The knight retreats to a pathetic square. Now his position will turn out to be more cramped than before.",
        "12. O-O": "Satisfied with my spacial advantage, I castled my king to the safe g1.",
        "12... Bb4": "Black starts to assault my queenside, intending to play 13...Bxc3 14 Qxc3 Qxc3 15 bxc3, thus damaging my pawn structure on the queenside. Find a good counterattack to get out of this sticky position.",
        "13. Nb3": "You are right, Nb3. This move attacks my opponent's queen, thus my opponent has to respond to my move.",
        "13... Bxc3 14. Nxa5 Bxd2 15. Bxd2": "A chain of exchanges.",
        "15... Bc6 16. Nxc6 bxc6": "Black tries to save his queenside. Try to find a good move here. Hint: Notice his cramped position and his pathetic knights.",
        "17. c5": "True enough, c4.This move locks the b8 knight's routes, and gains more space on the queenside.",
        "17... Nd7 18. b4 O-O 19. a4": "More space on the queenside. Now my opponent is gasping for air. Note that this position is not necessarily good for me, as this position is so closed that I cannot make any progress.",
        "19... g5": "My opponent struggles for the kingside, trying to get more breathing space for his pieces to acticate.",
        "20. Bd3": "I closed the light squared diagonal and interlock escaping squares for my opponent's pieces.",
        "20... g4 21. a5 h5": "Each of us struggle on opposite sides.",
        "22. h4": "I safely played this move, as even if my opponent played gxh3 e.p., The escaping squares are still interlocked and the position still does not allow Black's pieces to advance",
        "22... Kg7 23. g3 f5 24. Kg2": "After a mind-boggling battle, I finally offered a draw to chikochiko, and he agreed. As you guys can see, this position is so interlocked that none of us can effectively advance our pieces. In desperation, we agreed a draw by mutual agreement. Hope you guys like this annotation."
    },
    "url": "https://gameknot.com/annotation.pl/when-nothing-can-advance?gm=38886",
    "gameName": "When nothing can advance",
    "players": "feathers8x8world (1414) vs. chikochiko (1336)",
    "opening": "Sicilian (B28), O'Kelly variation"
}