{
    "moves": {
        "1. d4": "A Queen's Gambit Declined Tournament",
        "1... d5": "In this game, black finds a nice combination and wins a pawn. But tragically, this leads the way to a counter-attack that black does not succeed to repel.",
        "2. c4 e6 3. Nc3 c6": "The Triangle or Wedge Variation. I'm not familiar with this variation and I'll soon get outplayed by my opponent.",
        "4. Nf3 Nf6 5. Bg5 Nbd7 6. e3 Be7 7. Rc1": "Maybe I should have played something like a4 instead, in order to hinder the queen's side pawn-rush that we will see in the game.",
        "7... dxc4 8. Bxc4 O-O 9. O-O h6 10. Bh4": "If 10. Bf4, then 10. ... Nh5, but maybe that was better for white than the game continuation.",
        "10... b5": "There it comes...",
        "11. Bd3": "Maybe Be2 is better.",
        "11... Bb7": "Now I should calm down and line up the rooks on the c-file, I guess.",
        "12. Ne4": "But I want to free my game and naively I play this move.",
        "12... Nxe4": "Which runs into a nice combination found by my opponent.",
        "13. Bxe7": "Now the black queen would take back on e7, n'est-ce pas?",
        "13... Nxf2": "No! This is called a zwischenzug (intermediate move).",
        "14. Rxf2": "Ok, instead of that I could also go on playing 14. BxQ NxQ, 15. RxN RxB, but without the queens on the board it would be even more difficult to reverse the trend.\n\n",
        "14... Qxe7": "Now I am one pawn down.",
        "15. Be4": "Maybe I can win it back?",
        "15... Rac8": "No!",
        "16. Ne5": "The way things are, I can as well try a move like this and at least clear the f-file!",
        "16... Nxe5 17. dxe5 c5": "Black pushes the pawn and offers to trade the bishops.",
        "18. Bb1": "Of course, I'll rather keep my bishop. And in fact, I happen to have two nice compensations for the lost pawn: the f-file, but also the second rank where I can manoeuvre my pieces from one side to the other.",
        "18... Rfd8": "This does no harm.",
        "19. Qc2": "On the contrary, it allows me to provoke g6, with a softening of Black's king-side.",
        "19... g6 20. Rcf1": "Lining up on the f-file. Already there is the possibility of RxP, QxP, RxQ, KxR, QxP .",
        "20... Rdf8": "The rook comes back to his original square and defends. Black must cope with threats along the f-file, but also along the diagonal b1-h7.\n.",
        "21. Rf2f6": "If the black queen did not control the h4-square, I could also try something like Rf4-h4, and if black plays h5, Rxh5! (Black cannot take, because of the mating threat Qh7#). \n",
        "21... Rcd8 22. Qf2": "Bringing over the queen.",
        "22... Kg7": "I guess black wants to clear the back rank, but this is not a very good idea. Now White's hopes start to get realized.",
        "23. Qg3": "If Black plays 23. ...g5, then 24. h4. Another try for black could be 23. ... Rd2 with the idea Rxg2  winning the queen. In this case, the move 24. Bxg6 were not sufficient. But there would be 24. Rxg6 ! and whatever black answers (taking with the pawn or retreating the king), he will end up by being checkmated anyway: for example 24. ...fxg6, 25. Qxg6 \tKh8, 26. Rxf8 \tQxf8,\n27. Qh7#\t.",
        "23... Bd5": "Black sees this continuation, and keeps his rook on the back rank. Maybe the best try would have been 23. ...g5 and then 24. ...Rd2.",
        "24. Bxg6": "Now I have to take with the bishop in order to keep enough fire-power along the g-file. But there is no need for a check now (as after 23. ...Rd2)!",
        "24... fxg6": "If black does not take, then the bishop returns (25. Bb1), with or without check (if black retreats the king), anyway black is helpless.",
        "25. Qxg6+": "This is why 22. ...Kg7 was a bad idea. Black cannot put his queen in front of the queen and must retreat the king.",
        "25... Kh8 26. Qxh6+": "Black resigned. \nIf 26. ...Qh7, then 27. Rxf8 Rxf8, 28. Rxf8#.\nIf 26. ...Kg8, then 27. Rg6  Qg7, 28. Qxg7#.\n"
    },
    "url": "https://gameknot.com/annotation.pl/when-good-combinations-backfire?gm=13475",
    "gameName": "When good combinations backfire...",
    "players": "mirela22 (1730) vs. ksasidhar (1732)",
    "opening": "QGD (D31), semi-Slav, Noteboom variation"
}