{
    "moves": {
        "1. e4": "The Kings Pawn Opening.  ",
        "1... c5": "Of course, my opponent expects me to play the Sicilian Defense, and that is what happens.",
        "2. Nf3": "The cornerstone of the Open Sicilian.  Note: this is not a transposition of that.",
        "2... d6": "The continuation of this defense.",
        "3. d4": "Of course, he is going to continue with the Open Sicilian.",
        "3... cxd4": "Standard.",
        "4. Nxd4": "Standard.",
        "4... a6": "Now, there are many versions to this continuation, but this is my favorite.  Unlike my previous annotation, it does prevent him from playing 5.Bb5.  At least, I assume that he wanted to play that.",
        "5. Be3": "So he decides to play this, instead.  I don't mind, but I would have played 5.Bc4, if I were white.  As it allows me to develop my LSB and Right Wing, so that I can castle Kingside.  Of course, I see that he wants to castle Queenside.  Therefore, I already feel that I have the advantage.  Many chess coaches have told me that it is far better to castle Kingside then Queenside.  However, Master paulmorphy91 disagrees with this assessment.  In jsteven's1 annotation about, \"Where and When it is Safe to Castle\", he says that Queenside Castling is often better then castling Kingside.",
        "5... Nc6": "I decide to continue development and hope for a Knight exchange.  Afterall, I feel that doubled pawns will strengthen my position, this time. ",
        "6. Nc3": "I do not know why he played this because his e4 pawn is not hanging.  He might just want to develop, but I do not think that this is normal development.  Instead, I would have played 6.Bc4 and castled Kingside, before this move.",
        "6... Nxd4": "At least, I am getting a Knight Exchange, but it is not what I had expected.  Instead, he will take with the Queen, but I will chase it around, with my e pawn.",
        "7. Qxd4 e5 8. Qd2 Nf6": "Now, I decide to develop properly, with my Kings Knight.  Although it took a long time, this transposed from a Sicilian Defense, into a King's Knight Opening.  As bwaa mentioned in my last annotation, the timing also does not matter.  Before that, I originally thought that the order did not matter, but timing was critical.  BTW, I am specifically alluding to transpositions.",
        "9. f3": "? I do not know why he played this, but this should cause problems.  Now he has opened his King, and it is no longer safe to Castle Kingside, without exposing it.  On the other hand, Castling Queenside should also leave his King Open, but he has no choice now.  If he does not castle, his King will also remain exposed.  Therefore, I now feel that I have a big edge.",
        "9... Be7": "This is the only way that I could have developed my DSB.  Otherwise, I would have played 9...Bb4, pinning his c3 Knight.",
        "10. O-O-O": "As mentioned earlier, he does not have a lot of options to protect his King from exposure.",
        "10... Be6": "I decide to take advantage of that by producing a, \"Strong Bishop Pair\".",
        "11. g4": "I do not know why he played this.  Afterall, he is not going to develop his LSB immediately.",
        "11... Qa5": "I decide to bring my Queen out and try to go for an attack.  My goal is to win his a2 pawn for free, but that will not work here.  I was thinking of 12.Bxa2, and if 12...Nxa2, 13.Qxa2.  I did not think that the pawn could be protected.  In other words, I thought that I was automatically going to win that pawn because there was nothing he could do to protect it, but I was wrong.",
        "12. Kb1 Rc8": "Therefore, I am trying to put pressure on the c file, with this move.",
        "13. Nd5": "He wants to exchange pieces with me, and I do not mind because I am not behind in material, yet.",
        "13... Qxd2 14. Nxf6+ Bxf6 15. Rxd2 Rc6": "Now, I am trying to create more problems, for white, so this is where I start thinking.  My goal is to put more pressure on white's center.  ",
        "16. Be2": "Now, he has a, \"Strong Bishop Pair\", but that is what I wanted, this time.  Why?  He missed what I am going to do next.  At this point, I am going to do what I felt that white should have been able to do.  That's right, I take advantage of the opportunity to castle Kingside.",
        "16... O-O 17. Rhd1": "He decides to connect his rooks, and that is always a good idea to do this, in chess.  ",
        "17... Rfc8": "?? I figured that I would do the same thing, in terms of rook connection.  However, this is a mistake.  In fact, this is my loosing blunder, according to damaestro.  Why?  This will enable him to win a free pawn.  Instead, 17...Rfd8 was best, as it would have protected my d6 pawn.  Therefore, like my second game against blitzkov, I went from no mistake, to loosing in one move.",
        "18. c3": "I do not know why he played this because his c2 was not hanging, and this opens up his King.  As Damaestro had mentioned our last game against each other, I lost that first game by opening and putting a whole around that King.  This enabled him to get a Mating Net.  Therefore, I still feel that I will win but am wrong.",
        "18... b5": "I decide to take advantage by connecting my a and b pawns.  Afterall, Jack Stockel has told me that two connected pawns are very powerful during an endgame and often lead to a promotion.  However, that is not going to happen, and I no longer have an edge.",
        "19. Rd2xd6": "This the free pawn, that I am talking about.  I figured that I would get that pawn back, with some exchanges, but that is not going to happen, here.",
        "19... Rxd6 20. Rxd6 Ra8": "Now, my a6 pawn is hanging, so I need to protect it.",
        "21. Bd1": "I do not know why he played this.",
        "21... Be7": "In the meantime, I am no longer going to be intimated by his d6 rook, so I decide to kick it with my DSB.",
        "22. Rd2 Rd8": "Therefore, I decide to force an exchange.  Normally, you do not want to exchange, when you're behind.  However, I feel that I now have more opportunities because his d8 rook will be out of the picture.",
        "23. Rxd8+ Bxd8 24. Bc5": "At this point, I do not see how anyone can win, so I decide to offer him a draw.  Afterall, he only has an extra pawn.  However, he declines the offer and implies that he is going to win, due to his extra pawn.  Therefore, I feel that I now have the edge because he just underestimated me.  Afterall, \"When you think that you have won or are in a winning position, be careful, and do not underestimate your opponent.  Otherwise, you might start making mistakes and loosing the game\", as Jack Stockel would say.  Therefore, I thought that damaestro had, \"let his guard down\" and was going to loose, but I am wrong, for a third time, due to miscalculation.  As it turns out, he is going to cause a lot of damage with that extra pawn, as we will see later on.",
        "24... Bg5": "Now, I decide to continue development, with my DSB.  Afterall, I just finished the last step of development.",
        "25. Bb3": "He does the same thing.",
        "25... Bf4": "I see that he is thinking about getting a passed pawn, with his pawn on g4, so I decide to prevent that from happening.",
        "26. h3": "Now, he does, what I had mentioned earlier.  He decides to connect his g and h pawns.",
        "26... Bd7": "I just do not know what I was thinking here.  In the past, I have mentioned that it is not a good idea to make a move, without knowing why you did it.  In this case, I was not paying attention, so this is a mistake, in it's own nature.  Afterall, you do not know if a move is good, until you know what makes it good.",
        "27. Bd5": "He probaly wants another strong bishop pair, here.",
        "27... Bc8": "Once again, I do not know what I was thinking here.",
        "28. Kc2": "?? I don't know why he played this.  ",
        "28... g5": "It does not bother me.  What about not opening up your King?  In the end game, it is a little different because my goal is generally to get a pawn promotion.  Now, that the beginning and middle games are complete, it does not matter, if I push pawns.  ",
        "29. Kb3": "I am not sure, but I think that he might have been intending to stop me from getting a passed pawn.  If that is the case, I understand the logic, behind this move.",
        "29... Kg7": "Now, I decide to bring my King out.  Afterall, Mr. Stockel illustrates that your King becomes a powerful weapon, in the endgame.",
        "30. Kb4": "My opponent feels the same way, and we are going to keep this up, for the next couple of moves.",
        "30... Kf6 31. Ka5 Bc1": "In this position, I am still trying to get the pawn back.  Afterall, I am still basing it on what damaestro had told me, after declining the draw offer.",
        "32. b3": "He sees my intention and decides to advance his b2 pawn.",
        "32... Bb2": "But, I am not, yet.  I am still attempting to win it back.",
        "33. c4": "And, he still sees my intention. ",
        "33... Bc3+": "At this point, it almost does not matter.  I figured that I won something back, with this check.  Of course, I felt that he would move something else to get out of check.  Little did I realize that he could get out of it, with his King.  This is, however, another example of where your King is a powerful weapon, during an end game.",
        "34. Kb6 h6": "I figured that I would continue the advancement, in order to get a promotion.  However, I missed something important.  What did I miss?",
        "35. cxb5": "?? This is it.  I just blundered another pawn, after the exchange is over.  Now, the game is lost for black, as we will see towards the end.",
        "35... axb5 36. Kxb5 Kg6": "Now, I am just trying to protect my other pawns, with this move.  Note: both of his bishops are threatening these pawns.",
        "37. b4": "Of course, now he is planning his promotion, and this is the cornerstone.  Therefore, he decides to advance his b3 pawn.  ",
        "37... f6": "And, I am not taking any chances, so I decide to advance my f7 pawn.",
        "38. a4": "This is where trouble begins, and I see his goals.  After the advancement, he plans to connect his a and b pawns.  As implied earlier, connected powerful are very powerful and hard to beat.",
        "38... Kh7": "I decide to retreat my King because I am worried that he might put it in a dangerous check, if he makes it feasible to play Be4+.",
        "39. a5": "Now, his pawns are connected.",
        "39... Kg6": "Now, I only played this move because I am trying to trick him into a draw by repetition, but that plan is not going.  Why?",
        "40. a6": "Because he continues the pawn advancement.  Now, I know that he is going to make a promotion, but I have one more trick up my sleeve, before resigning.",
        "40... Bd7+": "In this position, my intention was to stop his promotion, but I forgot something.  Although in check, my LSB, is not directly horizontal to his a6 pawn, so this is not a fork.  Therefore, like my game against l-d-j he is still going to make an inevitable promotion, despite this move.  As a result, I resign, after he gets out of check.  ",
        "41. Kb6": "In the past, Mr. Stockel has said, \"Don't give things away\", but I did not understand the logic behind it.  I always thought that it was feasible to get something back, after blundering material.  BTW, I am specifically referring to pawns.  However, I now know the reason for this.  In an endgame, you are usually left with only a few pawns.  80% of the time, one pawn makes the difference between winning and loosing, according to elyhim.  That was proven, in this game, and it is the moral of this annotation.  Having said that, I would like to thank Master elyhim for helping to make this annotation feasible."
    },
    "url": "https://gameknot.com/annotation.pl/where-an-extra-pawn-makes-the-difference?gm=46985",
    "gameName": "Where an Extra Pawn Makes the Difference",
    "players": "dmaestro (1537) vs. jkarp (1074)",
    "opening": "Sicilian (B54)"
}