{
    "moves": {
        "1. e4": "The usual King's Pawn Play.",
        "1... e5": "He transposes the King's Pawn Play into the King's Pawn opening, but I am used to this.",
        "2. Nf3": "I respond by developing my knight for two reasons.  First, it brings me one step closer to controlling the center.  Second, I am now threatening to capture his free e pawn with Nxe5.  This is where it is safe to start developing minor pieces because it is not my first move.",
        "2... Nc6": "He responds with this candidate to protect his develop his minor pieces and protect his e pawn.  ",
        "3. Bc4": "I could have played Bb5, but that would not have been as good because it would have forced an exchange with Nxd4 followed by exd4.  Therefore, it would have doubled his pawns on the d file, but doubled pawns would give him a tactical advantage, in this position.",
        "3... Bc5": "He responds by bringing out his bishop.",
        "4. O-O": "This is generally my favorite move, so I castle, as soon as it is safe to do so.",
        "4... d6": "He thought that I would play Bd5 so that I could threaten to capture his knight with Bxc6.  If I made that he would be forced to have two weak c pawns, putting him at a disadvantage.  Therefore, he made this move, but I was not planning to play Bd5. ",
        "5. Bb5": "This was, instead, my plan because his knight on c6 is now pinned.  I wanted to pin him because his knight is extremely dangerous, in this position.",
        "5... Bd7": "He responds by breaking the pin with his bishop.",
        "6. d3": "Even though I wanted to capture the knight, I decided to wait, and this was the right choice.  If I had forced the exchange with my bishop and his knight, I would be at a disadvantage because he would win a free pawn with Bxe4.  Therefore, I decided to be patient and play d3 to protect the knight, so this move was !. ",
        "6... Nge7": "He responds by bringing out his other knight.  However, I am now able to make the capture because my e pawn is now protect.  Therefore, I will force the exchange with Bxc6 followed by Nxc6.",
        "7. Bxc6 Nxc6 8. Nc3": "I do not know why I made that move because he would not have been able to play d5, due to my pawn on e4.",
        "8... Bg4": "He probably decided to pin my knight on f3 because he thinks that my knight is extremely dangerous, in this position.",
        "9. h3": "I made this move in my attempt to break the pin, but I will not successful.",
        "9... Bh5": "Instead of forcing an exchange with Bxf3 followed by Qxf3, he decides to retreat his knight.  I understand the logic behind this move because Jack Stockel told me that it is not a good idea to capture the knight after a pawn move breaks the pin.  However, I recently learned from inadowman that it would have been perfectly ok to make the capture.",
        "10. Nd5": "Since he does not make the capture, I do not know what to do now, so I decide to take a risk.  I recently learned that you have to take some risks in chess.  Therefore, I chose this candidate to, \"box in\" his d pawn because I thought that it was a threat.  I originally believed that I would be a little behind with a -3, at worst, but it was much then that.  Instead, it turns out to be a very serious blunder, so it was ??.  In fact, the game is now lost.  I will explain this later on.",
        "10... Nd4": "In this position, I cannot capture the knight with Nxd4, or I will immediately loose the queen since my knight on f3 still pinned.",
        "11. Bg5": "Therefore, I made this move to threaten the queen with Bxd8.  I decided to take another risk because I was hoping that he would not spot this threat, but he sees it.",
        "11... f6": "As a result, he chose this candidate to protect his queen on d8.",
        "12. Be3": "Consequently, I am now forced to retreat my bishop.",
        "12... Nxf3+": "This is what I was hoping to avoid.  In this position, I cannot recapture with Qxf3, or I will loose the queen.",
        "13. gxf3": "Therefore, I am now forced to take with the pawn, so I now have two bad f pawns.  Most importantly, my king is now exposed, so there is no way out of trouble, in this position.  However, I do not want to resign yet because I am still hoping that I could come up with something good, but that will not happen.",
        "13... Qd7": "He made this move because he wants a free h pawn, but I am not about to allow that.",
        "14. Bxc5": "Therefore, I respond by capturing his bishop, and I thought that he would recapture the bishop with dxc5.  However, that will not happen.",
        "14... Qxh3": "Instead, is much worse then that because he captures my pawn.  Even though I am two pieces ahead with a +2, the game is inevitably lost.  That is because he will win my queen, at best and mate me, at worst.  In fact, he will be able to find a mating pattern against me, in this position, and it is inevitable.  Therefore, I resign, at this point.  10.Nd5 was the mistake because it caused my king to become exposed.  This shows that one blunder could win or loose a game."
    },
    "url": "https://gameknot.com/annotation.pl/where-a-blunder-makes-the-difference?gm=43023",
    "gameName": "Where a blunder makes the difference",
    "players": "jkarp (933) vs. reyner0 (1349)",
    "opening": "Giuoco Piano (C50)"
}