{
    "moves": {
        "1. Nh3": "White opened weak Kh3\n",
        "1... b6": "I decided to try to finicheto my LSB on the next move.",
        "2. e4": "Now white opens to the center to e4 on 2nd move",
        "2... Bb7": "following my plan I put bishop in place.",
        "3. Nc3": "white continues to develop bring out a Knight.",
        "3... e5": "I decided to stop any further advancement of whites pawn on e4",
        "4. g3": "white seems to want to get the lsb to g2 like I did at b7",
        "4... d5": "I bring out my pawn to d5",
        "5. Nxd5": "White takes my pawn with a knight",
        "5... c6": "I am down a pawn and decide to just move a pawn up to attack the knight.",
        "6. Nc3": "The knight retreats",
        "6... Bd6": "I bring out my dsb to d6",
        "7. Bg2": "white finichettos to g2",
        "7... Nf6": "I continue with development of my knight allowing to castle King side in the future if I even need to",
        "8. O-O": "White castles O-O",
        "8... Ba6": "I move my lsb to a6 attacking the rook on f1",
        "9. Ng5": "white bring knight out to g5 on my king side",
        "9... Qe7": "I choose to move my queen to e7",
        "10. f4": "White moves pawn to f4 attacking my e5 pawn",
        "10... Bc5+": "I check moving DSB to c5",
        "11. Kh1": "White moves King to the corner in h1",
        "11... Bxf1": "I decide to take the rook on f1 with my LSB, putting me up +4 at this point.",
        "12. Qxf1": "White takes with Queen and now white is up +1",
        "12... Ng4": "I move up K to g4 looking to check on f2 next move",
        "13. Qa6": "! blunder by white moves queen to a6  and resigns. White resigns and I need not to play further. A win by black. I was looking to attack further with my queen to d6 then d4. "
    },
    "url": "https://gameknot.com/annotation.pl/white-resigns-after-move-13?gm=48889",
    "gameName": "White resigns after move 13",
    "players": "ifonlyoncemylove (1061) vs. redfox17 (1192)",
    "opening": "Amar (Paris) opening (A00)"
}