{
    "moves": {
        "1. d4": "My opponent opens with d4.  I myself use the queen's gambit when white so I feel that this is a strong opening move.",
        "1... d5": "Play continues..",
        "2. Nc3 e6 3. h4": "h4? white's first questionable move.  Now, I'm sure theres a purpose to this, but I don't see it.. maybe to defend his bishop soon to be on g5, but his bishop stays put costing white a tempo.",
        "3... c5": "As I mentioned before I use the queen's gambit so I am now in a position I am very comfortable in as black.",
        "4. Na4 b6": "White's knight is not threatening to me, and allows me to free up my light squared bishop without losing tempo.",
        "5. b3 Bd6": "Now I can develop without having to worry about his pesky pawns.",
        "6. c4": "It looks like he wants to break up the centre, which is fine with me.",
        "6... Nc6 7. e3 Nge7 8. dxc5": "I do not feel that this is in his best interest as I am much more developed than him and if we trade off pawns I will have centre control with all my big pieces.",
        "8... bxc5 9. cxd5 Nxd5": "Capturing with my knight made it incredibly powerful. Just look at all the dark squares my centre three pieces are attacking.",
        "10. g4": "Don't even ask..",
        "10... Bb7": "A very good spot for my bishop.",
        "11. Nxc5": "Nc5??? What a blunder! Trading his only developed piece for an isolated pawn?",
        "11... Bxc5": "Just look at my development compared to white's.",
        "12. e4": "Should've done that while your knight was still protecting c3.",
        "12... Nc3": "Attacking the queen and threatening checkmate.",
        "13. Qxd8+": "NOT a good time to trade queens.",
        "13... Rxd8": "Now another powerful piece joins the attack! White looks to be in trouble here.",
        "14. Bb2 Nxe4 15. Nf3 Nb4 16. Rc1": "He sees my threatened fork, and moves to defend..",
        "16... Nxf2 17. Rg1": ".. but he should have moved Rh2..",
        "17... Nfd3+": ".. because this three-pronged fork and discovered attack on the rook leaves him in a much worse position than before.",
        "18. Kd1": "Now, would you take the bishop or the rook?",
        "18... Nxb2+": "The bishop of course, and it soon become clear why.",
        "19. Ke2 Ba6+": "Ba6! Forcing the King back to e1.",
        "20. Ke1 Nb2d3+": ".. look familiar?",
        "21. Kd2 Nxc1+ 22. Kxc1 Bxg1 23. Bxa6": "With Nxg1 I would win a free bishop on f2..",
        "23... Be3+ 24. Kb2 Nxa6": ".. but the result is the same.",
        "25. a4 O-O": "Now it is not long before his impending doom.",
        "26. Ka3 Bc5+ 27. Kb2 h5 28. gxh5 Kh7 29. Ne5": "Careless..",
        "29... Bd4+ 30. Ka3 Bxe5": "And white, understandably, resigns."
    },
    "url": "https://gameknot.com/annotation.pl/white-gets-a-whooping?gm=43416",
    "gameName": "White gets a whooping!",
    "players": "-- (1200) vs. mrdaddychops (1200)",
    "opening": "Queen's pawn (D00), Chigorin variation"
}