{
    "moves": {
        "1. e4": "For those of you who know me this is my norm, I almost never stray from this move in serious games, I hate 1.d4, frankly it's safe and boring. 1.Nf3 don't get me started on this, I hate hypermodern openings! Anyway I like 1.e4 because there are so many fun gambits resulting from 1.e4 e5. ",
        "1... e5": "This was compulsory as this was a thematic tourney of the moves 1.e4 e5 2.Nf3 Nc6 3.Bc4",
        "2. Nf3": "Compulsory",
        "2... Nc6": "Compulsory",
        "3. Bc4": "Also compulsory the Italian game. An old opening that is now thought to be rather dull and boring. Black now has two main options here 3....Bc5 the Giuoco Piano or 3... Nf6 The Two Knight's Defence. The Italian game can evolve into the romantic Evans Gambit if 3...Bc5 then 4. b4!? this however is definitely not dull and boring! Anybody who thinks it is send me a challenge and ask me to play it and we'll see how boring it is when  I beat you!",
        "3... Bc5": " The Guicco Piano. This is less agressive than the Two Knight's defence.  Yes! I was happy to see this move as I could now play the Evans Gambit.",
        "4. b4": "This the move that signals the beginning of the Evans.  White sacrifices a pawn for center control and a kingside Initiative with a quick attack on the Black king which will hopefully end in mate. Most  gambits like these give White an early initiative, however  if Black can defend accurately, he stands better in the ensuing endgame, with plenty of chances for a win. When people tell me this I simply reply \" I don't give a crap, I don't plan letting Black get into an endgame position anyway. Lol.\"\n\nOne opinion (pulsaris'):\n\n\"As white opens up the center, it's pieces are no longer obstructed by pawns and they can rapidly jump into play with high maneuverability. However, since all the minor pieces remain on the board, black is highly resourceful in terms of defense. This opening is primarily a psychological attempt to delude the opponent into an immediate state of panic as white targets the f7 pawn (that is so close to the king) with numerous pieces. If black manages to defend that pawn and holds up the basic chess principles, White's steam will run out and that pawn will nostalgically possess a precious value. This opening doesn't leap before it jumps. In terms of modern chess that pawn is a premature giveaway and the opening itself is romantic at best ;)\"\n\nThis is of course is partly true, this is my opinion\n\n\"This so called \"romantic gambit\" by pulsaris has proven to be greatly resilient to modern technology, while it is not generally thought of as a path to advantage it hasn't been refuted(correct me if I'm wrong which i am pretty certain I'm not!).The idea of this opening is to gain momentum while opening the centre., this is often at the expense of a pawn or two.For this reason this line of the Guoco Piano has often attracted attention from more aggressive players and and will probably continue to do so in the future. Even Garry Kasparov found the opening worth playing a few times.  He even used it to beat none other than ANAND! Pretty good surprise weapon,no? ",
        "4... Bxb4": "It is often said that the way to refute a gambit is to accept it. Black grabs a pawn so as to have the option of uploading(returning\"marinvukusic\") it in a later stage in the game in order to neutralize whites resulting initiative. This is atleast what Black  is meant to try and do!",
        "5. c3": "This is the plan of giving away the b4 pawn to gain tempo by forcing black to move his bishop repetitively while he gains  momentum in the centre. ",
        "5... Ba5": "This retreat is probably the most natural responce to the Evans Gambit.The e1-a5 diagonal, pinning the c3 and d2 pawns for the momentand, more importantly is not in any kind of trouble on a5. or instance it would be in danger on c5 because of d4. Or 5.Be7 which is solid yet deemed passive by experts,on the other side though white will be able to put pressure on blacks position with Ba3 later on, Black's plan to meet this is with d2-d3, i would pick this option as in the games I have played with it has neutralized whites pressure with no positional disadvatages.( not for black anyway!)\n\"Actually there are some cases when White can play Qa4 and pick up the Bishop - although this can't be forced it is a threat nevertheless\" - Marinvukusic\nAlthough not in this opening i don't think so this is really relevant as i wasn't refering to all openings in general.",
        "6. d4": "White seizes space in the centre. Alternatives here are the imediate 6.0-0 which is not so popular or 6.Qb3!? which starts an immediate atack. These moves are interchangeable though and are normally played at some stage of the game anway it depends on whatever swuits your style.",
        "6... d6": "As I said. Again logical solidifying the e5 pawn and also stopping the danger of Ba3. An adequate and more common alternative is 6...exd4.",
        "7. O-O": "I castle to get my king into safety before  start my attack. This move also breaks the pin on the c3 pawn. This  gives black the opportunity to play the afforementioned ...dxe4",
        "7... exd4": "Amarg finally decides to take the pawn.",
        "8. cxd4": "I return the favour! Now i have a very strong grip on the centre. My plan now is to develop my pieces while simultaneously aiming at black's soon to be castled king.",
        "8... Bb6": "Now we have reached a very common position from the Evan's Gambit. There are two main options I can take. I can aim for long term compensation with 9.d5 which Anderssen preffered. Many games with 9.d5 continue like 9...Na5 10.Bb2 Ne7 11. Bd3 0-0 12.Nc3 Ng6 13. Ne2 c5 14.Qd2 f6 15. Kh1 Rb8 16.Ng3. This would be the strategic positional approach with less attacking chances wich doesn't suit my style.. I prefer Morphy's more tactical and logical developing move 9.Nc3, when I maintain possibilities of advancing either of my two central pawns according to Black's moves. This is obviously a more dynamic approach in my opinion.\n\"Agreed. In the book I own on the Evans this is actually called \"The Normal Position\",\"-marinvukusic",
        "9. Nc3": "I decide to go with the more logical developing move. Now i have developed 3 pieces, got 2 central pawns holding the centre, a safe castled king and good squares to develop pieces (i.e Qb3,Ba3,Re1 etc.) Black on the other hand has developed two pieces, still has castled, has his king wide open in the centre like a sitting duck in the eye of the storm waiting for the hurricane that will hopefully be me attack on him. Oh yes and what has he got a material advantage over me. This sounds very daunting, but unfortunaetely it is not all good for white as if black can defend diligently hye will get a better endgame with a queenside pawn majority and overall better pawn structure.",
        "9... Nf6": "? This move looks like a good developing move however it is one of the traps of Morphy's continuation. This leaves Black in trouble, this will show you why;",
        "10. e5": "! Immediately putting pressure on Black's position and attacking the Black Knight.",
        "10... dxe5": "? Black does exactly what I wanted him to do. he opens the a3-f8 diagonal for my bishop to attack. I prefer 10... Ng4",
        "11. Ba3": "! This builds up pressure on the Kingside and prevents castling. This is the major defect of 10...dxe5.",
        "11... e4": "Black foolishly tries to strike back at White. He should have concentrated on development e.g. 11...Bd7",
        "12. Qb3": "This again builds pressure. This is another thematic move of the Evans. I was wuilling to give up my Knight for Control of the e-file for my rook.",
        "12... Qd7": "Black again makes a foolish move trying to defend f7, it is better to give up the f7 pawn and get the king to safety. Why not take the knight you might say? Oh yeah because he doesn't want to  give white control of an open e-file. This is kind of smart.\nActually, defending f7 is black's only play, as white is threatening mate in two. If black takes the knight 12) ... exf3, then 13) Bxf7 Kd7 (only legal move) 14) Qe6#.",
        "13. Ng5": "THis move builds even more pressure on f7 pressure.",
        "13... h6": "? This is a pointless move becuase it forced me to do exactly what I was gonna do anyway! And it weakens his kingside pawn structure not that that matters because black won't get a chance to castle anyway.",
        "14. Bxf7+": "I regain some of my material defecit. 13...h6 really hindered my master plan.",
        "14... Kd8": "This forced unless you count 14.Qxf7????? as a falllible move.",
        "15. Ne6+": "! I keep the attack on forcing the sacrifice of the Black Queen. This is really makeing 13...h6 look really productive now.",
        "15... Qxe6": "Absolutely forced! he can't do anything else.",
        "16. Bxe6": " \"Come to Daddy Queeny!\" I accept the Queen with open arms.",
        "16... Nxd4": "Black's Knightforks my Bishop and my Queen.",
        "17. Rad1": "I produce a clever move which pins the Black knight and gives me control of the d-file.",
        "17... Bxe6": "??? Absolutely pointless. I'm not going to suggest moves which are better becuase Black has no chance anyway and if I were black i would resign!",
        "18. Qxe6": "I accept the material.",
        "18... Re8 19. Qf7 Rb8 20. Nb5 a6": "This tries ti drive away my aggressive knight.",
        "21. Rxd4+": "I'm willing to sac my rook for mate ( 21...Bxd4 22. Qxc7 CHECKMATE) ",
        "21... Kc8": "Black sees the threat and avoisds it.",
        "22. Qxc7+": "I sacrifice my queen for mate... which it hink is pretty cool myself all though i am probably being arrogant.",
        "22... Bxc7": "Forced!",
        "23. Na7#": "Checkmate! This game is not for the aspiring defender, it shows some of the attacking motifs of the Evan's and some of the traps NOT to fall into. Thanks for the game Amarg and thanks for Whizzkid111 for his tournament.  I hope you liked this game. I'm happy for positive and negative feedback aslong as its constructive criticism! and feel free to leave comments. One thing I would like you to do is before you rate this game please think honestly and think how I can improve on it and leave comments and PM me with them. Don't just give one and a half stars and not tell me why.\nThanks for all the input from yttrio, pulsaris and marinvukusic \nTom\n"
    },
    "url": "https://gameknot.com/annotation.pl/whizzkid111s-2nd-mini-tournament?gm=6945",
    "gameName": "whizzkid111's 2nd mini-tournament",
    "players": "tomwhufc (1489) vs. amarg (1534)",
    "opening": "Evans gambit (C52)"
}