{
    "moves": {
        "1. d4 Nf6": "Here playing black on a challenge asked by Juanefe. Against d4, I play usually Nf6 giving me the oportunity to play the king indian defense, the queen indian, the nimzo or the benoni. I'm not a big fan of the queen gambit, I find these games quite boring most of the time. The dutch, mostly the leningrad variation, look pretty interesting but I'm not experienced enought with this opening to think about playing it in a ranked game. Maybe in a close future.",
        "2. Nf3": "Well, to tell the truth, this move surprised me very much. I didn't seen this move quite often and seriously didn't know what to play against it. Black still have a lot of choice and could transpose it to something lookliking at the QID, the KID or even the benoni. I think c4 is a little superior finally because it take the center right in the beginning, giving a lot of space to your pieces.",
        "2... c5": "I was thinking about to transpose into the benoni. With the knight on f3, white couldn't play the dangerous taimanov variation. This opening have his proper name, the Spielmann-Indian Defense. The name come from of Rudolf Spielmann, one of the best attacker in the first part of the last century.",
        "3. c3": "?! Black have good results generally with the Spielmann-Indian. I think the best way to fight it as white is to advance the pawn to d5, going into the main lines of the benoni. By doing so, white continue to keep his center pawn and take more space. The benoni is not considered as one of the best defense for black, but I really like this opening because some of my favorite players (Tal, Velimirovic) could do miracles with this. Anyway, it's rare that I enter into the main line of the benoni cause it's rare beginners know them (and I'm not going to help them to! :D). I don't like that much that c3 move because the knight will not be able to use it if black don't take the d4 pawn.",
        "3... e6": "Well, here black could have done b6 and going for a double flanchetto, giving a fine position later. However, this move sounded more natural to me.",
        "4. a3": "I think it's a lost of tempo at this point of the game, but it's still playable. White have now the option to do b4 to threat the c5 pawn.  I think Bg5 would have been better here.",
        "4... b6": "The fianchetto on the queen side is often used in the nimzo and the queen indian. With this kind of position, there's a lot of chance than white castle on the king side, so the bishop positionned on b7 can create some nice attacks.",
        "5. e3": "?! At this point in the game, I was thinking that this match would be at first a fight of space. I thought that it would be a hard fight in closed position a la Nimzowisht and I didn't wanted to be squizzed like a rat facing a snake. That's why I've been surprised by this move. White can now free his light squared bishop but it's gonna be harder for him to develop his queen side as we will see further in the game.",
        "5... a5": "?! Well I'm not sure if it was that much a good move. I think it was a kind of high risk high reward move. Losing tempo but taking space and countering white's development on the queen side. It can pay as it can be a problem later because there's possibility that white find a way to take benefit of the weakness on b6 (only the queen can protect it right now)",
        "6. Bb5 Be7": "We're now both ready to castle on the king side.",
        "7. Ne5": "?! White underestimated me here. With 5 pieces protecting the d7 pawn, there's no way white can dream of taking it, the only purpose of this move is to do Qf3 to threat my rook. On a bullet game or against a weak player it can be a strong move and give a won game early in the game but in this case it will only result as a lost of tempo. O-O would have been better here.",
        "7... Bb7 8. f3": "! Even if computer analysis doesn't like this move, I think it's a good move, useful later as much in offense than in defense.",
        "8... O-O 9. Nd2 Ne8": "! To me it was a great move, giving me the option to continue with f5 and even attacking on the queen side with Nc7. The computer analysis doesn't have the same opinion.\n\nComputer analysis:\nInaccuracy: +0.37 » … Ne8 10. O-O d6 11. Ng4 Nc7 12. Bd3 f5 13. Nf2 Nd7 14. Re1 b5 15. c4 Bc6 16. cxb5 Nxb5\nBest: +0.98 » … d6 10. Nec4 Nc6 11. dxc5 bxc5 12. O-O Qc7 13. e4 d5 14. Ne3 Qf4 15. Qe2 Ne5 16. g3 Qg5",
        "10. Ndc4": "? White is not well enought developed to think about to make this kind of attack. It only lead to complications.\n\nComputer analysis:\nInaccuracy: +1.21 » 10. Ndc4 d6 11. Ng4 Nc7 12. a4 Nxb5 13. axb5 d5 14. Nce5 f6 15. Nd3 cxd4 16. exd4 Qd7 17. Nf4\nBest: +0.36 » 10. O-O d6 11. Ng4 Nc7 12. Bd3 f5 13. Nf2 Nd7 14. Re1 Bc6 15. b3 Nd5 16. Bb2 Bh4 17. Nc4",
        "10... Nc7 11. Nxb6 Nxb5 12. Nxa8 Bxa8": "?? Well I think it really didn't worth it for white to lose a bishop and a knight for a rook and a pawn. It was too early in the game to make this kind of sac; white didn't have enought advantage to do this and it didn't provoked anything. White still lack of development, not coordinated for a great attack and his pawn structure is not that fine.",
        "13. Qd3 Nc7 14. e4 Nc6": "Thinking about to exchange as much pieces as possible to finish this off.",
        "15. Bf4 cxd4": "Exchanging the pawn to not have the burden to protect it later, giving the possibility to dismantle the 3 linked pawns. My plan here was: 16.cxd4 f5! 17.O-O fxe4 18.Qd2 Nxe5 19.Bxe5 exf3 20.gxf3.",
        "16. c4": "? White want to keep his 3 linked pawns but keep getting lower in materials. Black is better prepared than white right now to face this plan.",
        "16... Na6": "! I didn't liked the idea at this time that white exchange both his knight and bishop on my knights, moving my queen to c7. If my queen move, the white queen can get the d4 pawn. Nc5 will give me some counterplay later.",
        "17. O-O f5 18. Rae1": "Computer analysis:\nInaccuracy: +3.74 » 18. Rae1 fxe4 19. Nxc6 exd3 20. Nxd8 Rxd8 21. Rd1 Bf6 22. Rxd3 d5 23. cxd5 e5 24. Bg3 Nc5 25. Rd2 Bxd5 26. Rc1\nBest: +2.76 » 18. Nxc6 Bxc6 19. Rae1 fxe4 20. fxe4 Qb6 21. Re2 Qc5 22. Ref2 a4 23. Bg3 Rxf2 24. Rxf2 Bf6 25. Bf4 Qh5",
        "18... Nc5": "Forcing the queen to stay back, threatening e4 and give the oportunity to advance my pawn to d4. ",
        "19. Qd1": "?! I expected Qd2 who looked more natural, protecting the bishop.\n\nComputer analysis:\nMistake: +4.26 » 19. Qd1 fxe4 20. Nxc6 Bxc6 21. fxe4 Qb6 22. Qd2 Nxe4 23. Qd3 Qxb2 24. Rxe4 Bxe4 25. Qxe4 Bxa3 26. Bc7 Rxf1+ 27. Kxf1 Qc1+ 28. Kf2\nBest: +3.07 » 19. Qd2 fxe4 20. fxe4 Nxe5 21. Bxe5 Rxf1+ 22. Rxf1 Nxe4 23. Qd3 Qb6 24. Rf4 Qxb2 25. Rxe4 Bh4 26. g3 Bxe4 27. Qxe4",
        "19... fxe4 20. fxe4": "?? Huge mistake by white, he should have done Nxe6 here.",
        "20... Qb6": "?? Missed a very good chance to get a very big advantage here! Rxf4!! would have gave me the chance to gain another piece for free! I have made a quick move without analysing the position, just following a plan I had in head since a couple of moves. I thought by going to Qb6, there would have a lot of activity and combinations possibles.\n\nComputer analysis:\nBlunder: +3.53 » … Qb6 21. Qg4 Rf6 22. Nxc6 Bxc6 23. Be5 Rg6 24. Qf3 Bf6 25. Kh1 Qb7 26. Bxf6 gxf6 27. Qf2 Bxe4 28. Qxd4 Bxg2+\nBest: +7.05 » … Rxf4 21. Rxf4 Nxe5 22. Rff1 d3 23. Qh5 Nxc4 24. Rc1 g6 25. Qf3 Nd2 26. Qf7+ Kh8 27. Rf3 Nxf3+ 28. gxf3 Nxe4 29. fxe4 Bxe4\n",
        "21. Qg4": "! I didn't expect it at all! Now white can create a devasting attack if I let him the oportunity.",
        "21... Rxf4": "?! I should have done it the move before! There was for sure a lot of other better moves but when I have seen that I have an oportunity to sac a rook and do that kind of combination, I just couldn't stop it!\n\nComputer analysis:\nMistake: +1.74 » … Rxf4 22. Qxf4 Nxe5 23. Qxe5 Nd3 24. Qh5 g6 25. Qf3 Ne5 26. Qf2 Qc5 27. b4 axb4 28. axb4 Qxb4 29. Ra1 Bxe4 30. Qxd4\nBest: +3.40 » … Rf6 22. Nxc6 Bxc6 23. Be5 d3 24. Bxf6 Nxe4+ 25. c5 Qxc5+ 26. Kh1 Nxf6 27. Qg3 Bb5 28. Qb8+ Bf8 29. Re5 Nd5",
        "22. Qxf4 Nxe5 23. Qxe5 Nd3 24. Qh5 g6": "I must not let him go to e7 because: 25.Qf7+ Kh8 26.Qe8+ and the game is over.",
        "25. Qf3": "! Well seem very logic, but I didn't expect it, I don't know why!",
        "25... Ne5": "No choice, can't take the rook.",
        "26. Qf2 Bc5 27. b4 axb4": "Finally, my a5 move has been useful.",
        "28. axb4 Bxb4": "Now white have some open lines to create threat to a lot of place on the board. I have the advantage on materials but white can mate me pretty quickly if I don't move carefully(There's a lot of tactics for white here). My knight must protect f7, my dark bishop must protect f8, my queen b8 and d8, my light bishop a8. The position is now almost equal with a very little advantage for black.",
        "29. Rea1": "Computer analysis:\nMistake: +2.05 » 29. Ra1 Bxe4 30. Qf4 d3+ 31. Kh1 Qc6 32. Ra2 d2 33. Rxd2 Bf5 34. Rd4 d6 35. Qh4 Qc7 36. Rff4 Kg7 37. Qg5\nBest: +0.50 » 29. Rb1 Bxe4 30. c5 Qxc5 31. Rbc1 Nf3+ 32. gxf3 Qg5+ 33. Kh1 Bb7 34. Rc7 Qd5 35. Rxb7 Qxb7 36. Qxd4 d5 37. Rc1 Kf7",
        "29... Bc6": "I didn't like the Bxe4 move because it lead to a lot of complications because of Qf4. My calculs were going nowhere : 30.Qf4 d3+ 31.Kh1 Qc6 32.Qxe5 Bxg2+ 33.Kg1 Bc5+ 34.Rf2 Bxf2 35.Kf2 Qf3+ 36.Ke1 Qf1+  OR  30.Qf4 d3+ 31.Kh1 Qd4 32.Ra8+\n\nComputer analysis:\nMistake: +0.50 » … Bc6 30. Rab1 Bxe4 31. c5 Qxc5 32. Rbc1 Nf3+ 33. gxf3 Qg5+ 34. Kh1 Bb7 35. Rc7 Qd5 36. Rxb7 Qxb7 37. Qxd4 d5 38. Rc1 Kf7\nBest: +2.10 » … Bxe4 30. Qf4 d3+ 31. Kh1 Qc6 32. Ra2 d2 33. Rxd2 Bf5 34. Rd4 d6 35. Qh4 Qc7 36. Ra1 Qb8 37. Qf6 Nd3",
        "30. Rac1": "?! White can't move his rook out of f1 because ex.: 30.Rfd1 Ng4 31.Qf4 d3+ 32.Kh1 (Kf1 Nxh2#) Nf2+ and stalemate or lost of queen). I've thought a lot of time on these variations: 30.Bc5 31.Qf4 d3+ 32.Kh1 Qc7 33.Rd1 d5  OR   30.Bc5 31.Qf4 d3+ 32.Kh1 h6?! 33.Qxh6 Bxe4 34.Qf4 Bf5/Qc6.\n\nComputer analysis:\nMistake: +2.57 » 30. Rac1 Be7 31. c5 Qb4 32. Qf4 Qb8 33. Rf2 d3 34. h4 Ba4 35. Rd2 Bc2 36. Rdxc2 dxc2 37. Rxc2 Qb1+ 38. Rc1\nBest: +0.50 » 30. Rab1 Bxe4 31. c5 Qxc5 32. Rbc1 Nf3+ 33. gxf3 Qg5+ 34. Kh1 Bb7 35. Rc7 Qd5 36. Rxb7 Qxb7 37. Qxd4 d5 38. Rc1 Kf7",
        "30... Bxe4": "! Finally found a much better solution, with the move of the rook everything had changed. If 31.Qf4 then d3 32.Qh1 d2 33.Rd2 (Qxe4 then dxc1 and I've got a queen) Qd4 and I have a fine position.",
        "31. Rc3": "?? White was trying to swindle the game. I can't take the rook because I would lose my queen or be mated.",
        "31... Bc5": "The game is lost for white now, there was now no way to avoid losing.",
        "32. Rg3 d3 33. h4 Bxf2+ 34. Rxf2 d2 35. Kh2 Qxf2 36. h5 Nf3+": "Mate is coming.",
        "37. Kh3 Bf5+ 38. Rg4 Qh4#": "Well this was a very fun game with a lot of surprises!"
    },
    "url": "https://gameknot.com/annotation.pl/who-need-rooks?gm=45446",
    "gameName": "Who need rooks?!",
    "players": "juanefe (1257) vs. drchopper (1581)",
    "opening": "Queen's pawn game (A46)"
}