{
    "moves": {
        "1. g3": "A less common opening.",
        "1... g6": "I tend to mirror the less common openings at first just to keep things balanced as I am still learning.",
        "2. Bg2 Bg7 3. c3 Nf6 4. Qb3": "A somewhat early queen move.",
        "4... Nc6": "Continuing to develop as well as thinking about a way to trap the emerged queen. Knight is one move from putting queen in jeopardy.",
        "5. Nh3": "Knights on the edge are typically weak. This one ends up re-moving too much.",
        "5... O-O 6. O-O d6": "I was thinking about 7 ... Be6 as another way to get at the queen.",
        "7. d4": "This move prevents my 7 ... Be6 because 8 d5 would fork the bishop and knight while the pawn is protected by the bishop at g2 and the queen. I would end up losing a minor piece, even if I tried to counter attack the queen with Na5. Qb5 would make sure of that.",
        "7... d5": "If I hadn't done this 8 d5 would probably have been the next move.",
        "8. Nd2 e6 9. Nf4": "Trying to get his knight off the wall.",
        "9... b6": "Making room for the bishop. As well as protecting the a5 square.",
        "10. e4": "Looks like the battle starts here.",
        "10... dxe4 11. Nxe4 Nxe4 12. Bxe4 Na5": "Bb7 was probably a better move but I felt like being adventurous and like I said before I wanted to play with the white queen.",
        "13. Qb4 Bb7 14. Bd3": "Some people are afraid to trade pieces. I think trading bishops would have been a better move. Instead this gives me line of sight to the king's corner.",
        "14... Rc8": "Preparing for a c5 push.",
        "15. Be3": "Kind of takes the wind out of the c5 push.",
        "15... g5": "The queen on d5 would be a nice move so let's make that knight hop around.",
        "16. Ne2 g4": "I could have moved the queen to d5 now but I thought this move puts the pawn in a nice advanced position. Claiming h3 and f3.",
        "17. Nf4 e5": "Need to move the knight again.",
        "18. Nh5": "Trading pawns might have been better for white but instead the knight is moved back to the wall.",
        "18... Qd5": "Threatening checkmate.",
        "19. f3": "Only way to block the checkmate without losing minor pieces.",
        "19... gxf3": "The pawn at g4 was a good call!",
        "20. Rf2": "Running out of good moves at this point.",
        "20... exd4": "Here's where things get interesting. I figured another pawn trade...",
        "21. Nf4": "But a counter-attack instead.",
        "21... dxe3": "You don't see a queen go down willfully very often unless the other queen goes down too. But I was playing on the edge and since I knew I could get 3 minor pieces for the queen, I decided to see how this played out.",
        "22. Nxd5 exf2+ 23. Kxf2 Bxd5": "The middle game is nearing it's end. Let's see how minor pieces vs a queen hold up.",
        "24. Qh4": "Going for a quick checkmate.",
        "24... h6": "The block.",
        "25. Qg4": "I see another checkmate attempt coming.",
        "25... Rfd8": "No way to block so I need to give the king some room to move.",
        "26. Qf5": "Queen into position anyway.",
        "26... Kf8": "Let's deny the check altogether.",
        "27. Re1": "Controlling the E file.",
        "27... c6": "Protecting the bishop so I can move the d8 rook.",
        "28. Qh7": "?! A waste of a move.",
        "28... Rde8": "Willing to trade since I have 2 extra pieces.",
        "29. Qf5": "Again, some people don't like to initiate trades. Rxe8 would have been better because after my Rxe8 it would be white's turn.",
        "29... Rxe1": "So I make the trade myself.",
        "30. Qxc8+": "Thinking a trade-check would be clever, it really just wastes a move.",
        "30... Re8": "Blocking the check and forcing the white queen to move.",
        "31. Qd7": "Now the trade is over and it's my move.",
        "31... Re7": "Threatening the queen as well as protecting the a7 pawn.",
        "32. Qc8+ Re8 33. Qc7 Ra8": "Could have gone Re7 again but I don't want a draw. I want to win!",
        "34. h4 h5 35. Qd7 Be6": "I planned to put the bishop at the g4 square to protect the f3 pawn and be protected by the h5 pawn. Seemed like a good place.",
        "36. Qd6+ Kg8 37. Qe7": "Not sure what the plan for this move was. I probably would have taken the pawn at f3, but this move lets me continue my plan.",
        "37... Bg4": "There we go.",
        "38. Qe4": "Another check threat.",
        "38... Kf8": "Denied.",
        "39. b4": "I knew this was going to show up at some point and it worried me. But I didn't think about what to do until I was now forced to. As you can see my knight hasn't moved since I put it on the wall. Again, weak spot for a knight, they don't have many squares to move. And if the battle is at the other end of the board, it takes at least 2 moves to get them somewhat close to the action.",
        "39... Re8": "Nb7 was probably a better move, losing the pawn at c6 to the queen and using another move to protect the knight again. But I had started visualizing a checkmate with my bishop on d4 and I needed the rook on the E file to do it. I decided that the knight might be expendable so I respond with a counter-attack. I could only hope things would work out since I gave up so much with my queen and I needed all the minor pieces I could keep.",
        "40. Qf4 Be5": "Thought that if I could move the queen a little that maybe I could save my knight afterall.",
        "41. Qh6+ Bg7 42. Qd6+": "Hmm. A nice check, with no block that threatens the queen.",
        "42... Kg8 43. bxa5": "We'll see just how expendable that knight was.",
        "43... Bxc3": "Time to see if my checkmate could materialize. It would require my opponent not to see it though. Two bishops and a rook is a tough checkmate with a queen hanging around, but with a well placed pawn sometimes good things can happen. I needed the pawn at c3 gone so that was first. Creating the threat on the a5 pawn was my diversion. My goal was to get the bishop on d4 with the queen unable to touch it.",
        "44. axb6 axb6": "The trap is set. Encouraging the queen to take the c6 pawn which would also threaten my c3 bishop AND rook without my ability to protect them both!",
        "45. Qxc6": "Seems like a killer move! But it actually unleashes a mate in 2!",
        "45... Bd4+": "Check...",
        "46. Kf1": "And...",
        "46... Bh3#": "Mate!! "
    },
    "url": "https://gameknot.com/annotation.pl/who-needs-a-queen?gm=13829",
    "gameName": "Who needs a queen!",
    "players": "vehake (1416) vs. agentsparrow (1487)",
    "opening": "Benko's opening (A00)"
}