{
    "moves": {
        "1. e4 c5 2. Nf3 Nc6 3. d4 cxd4 4. Nxd4 e5 5. Nxc6": "This was not the usual move for the Sicilian.",
        "5... bxc6 6. Nc3 Bb4 7. Bd2 Nf6 8. Bd3 O-O 9. O-O Re8 10. a3 Bc5": "Bc5 gave me more options than Ba5 after 11. b4. Nonetheless I ended up moving my bishop to b6 anyway.",
        "11. b4 Bb6 12. Ne2 d5": "I needed this push to open up the position.",
        "13. exd5 cxd5": "I now have two central pawns with White having none. They would've been quite vulnerable if it weren't for my queen and rook supporting them.",
        "14. c3 h6 15. h3 Qd6 16. Be3 Bc7 17. Bc5 Qe6 18. Ng3": "The position was gaining tension, and I had to be careful or I would lose something valuable.",
        "18... e4 19. Re1 Qc6 20. Be2 Nd7 21. Bd4": "The board was still deadlocked. Playing became intense as it was difficult both to spot tactics and strategy and to avoid errors at the same time.",
        "21... Ne5 22. a4 Bd7 23. Qc2 a6 24. Reb1 Qg6": "I think this move raised a yellow flag for my opponent, which would be good for me. I was simply looking for play along the kingside: If the knight moved then I could take on h3, and there were possibilities for discovered attacks on the undefended white queen.",
        "25. b5 axb5 26. Bxb5 Bxb5 27. Rxb5": "I had to be more careful now that the b file opened up and White had a passed pawn.",
        "27... Red8 28. a5 Qa6 29. Qb3": "The position was still very tense, and quite a bit of time had gone by. Both sides had to be as accurate as possible, and it was driving us both insane!",
        "29... Nc4": "This was a good move, controling the critical dark squares around my queen and his passed pawn.",
        "30. Bb6": "My opponent's only blunder during this game was this move. The pressure was very high, and someone had to crack first.",
        "30... Bxb6": "My opponent could have stopped here and spared losing more material, but the tension during the long game drove us mad, and in desparation, he captured.",
        "31. Rxb6 Nxb6 32. Qxb6": "This was where it all went downhill, with every piece battling it out for b6.",
        "32... Qxb6": "My opponent failed to notice the pin on the a6 pawn after the pieces all recaptured.",
        "33. axb6 Rxa1+": "My opponent resigned, and I was finally relieved that the tension was gone. With that victory I was 3-1. A trophy was only a game away: Round five."
    },
    "url": "https://gameknot.com/annotation.pl/whsca-ind-championship-u1300-sec-rd-4-5?gm=29547",
    "gameName": "WHSCA Ind. Championship: (U1300) sec. rd. 4/5",
    "players": "Timmy Koglin (1263) vs. Travis Olson (878)",
    "opening": "Sicilian (B32), Labourdonnais-Loewenthal variation"
}