{
    "moves": {
        "1. d4 e6 2. c4 d5 3. Nc3 c5": "Again, from round two, there was that seemingly premature push of the c pawn. I reacted accordingly.",
        "4. cxd5 Qb6": "This move was unexpected. I decided thereafter to protect the pawn.",
        "5. Nf3 Nf6 6. e4": "I almost carelessly push my pawns into the center, trying to be aggressive and thinking I'm dominating the center. Maybe e3 was better?",
        "6... cxd4 7. Nxd4": "Qxd4 wouldn't seem very appealing after 7...Bc5, but I didn't realize that when I was playing. I simply wanted to avoid the queen exchange and let tactics manifest.",
        "7... Bc5 8. Na4": "This was a blunder that caused me to lose the d4 knight, but at the time I thought I would be able to trade my a4 knight for the bishop.",
        "8... Qb4+ 9. Nc3": "After a lot of thought I decided that this was the best alternative. I thought at the time before this move that if 9...Bxd4 then 10. a3 and I might recapture the bishop with my queen, but then there's Qc5 or Qb6, which will make my position all the more worse. Other moves I considered were Bb5+ and Bd2, but for the latter after 9...Qxd4 I thought of playing Be3, but then there's 10. Qxd1+ Kxd1 Bxe3 fxe3, which isn't any better.",
        "9... Bxd4 10. a3 Qa5": "My opponent's only major blunder as I saw it. The queen had to move where it still protected the bishop (b6 or c5).",
        "11. Qxd4": "I was glad to be back in this game! Little did I know that my overconfidence would soon cause my downfall in this game.",
        "11... O-O 12. b4": "If Qc7, then 13. d6, shortly followed by 14. e5. That was my rationale with this move.",
        "12... Qd8 13. Bg5": "I wanted to do this before h6 was played. I now threaten e5, but at this point I was a little worried about Nc6, although I'd do fine once my queen moved to e3.",
        "13... Re8 14. e5 exd5": "I had not noticed that my pawn would be pinned to my king; now I'm just down a pawn.",
        "15. f4": "I was too worried about letting the pawn fall on e5 after Nc6.",
        "15... Nc6 16. Qd3": "Didn't want the knight on f6 coming out and threatening my queen.",
        "16... h6 17. Bh4 g5 18. Qg3": "This was also a mistake for me. I was somehow thinking that pinning my opponent's knight to his king would be better than simply saving the bishop. I was overconfident, as I said before. At this point I was determined to win the f6 knight. Instead, I had simply exposed my queen to danger and taken by bishop's only means of escape away.",
        "18... Ng4 19. h3": "If fxg5, then Rxe5+, plus the h pawn could still take back on g5.",
        "19... gxh4": "And now the danger to my queen is apparent; I cannot capture the knight and save her at the same time.",
        "20. Qf3 Nf6 21. Be2": "Ridding myself temporarily of the pin and making way to castle. Unfortunately this would also force the bishop's exchange.",
        "21... Nd4 22. Qf2": "Another blunder. I should have moved my queen to d3. Mistakes come in bunches!",
        "22... Nc2+ 23. Kd1 Nxa1 24. exf6": "I finally \"win\" the knight on f3, but at what cost!? LOL.",
        "24... Qxf6 25. Qf3 Qd4+ 26. Qd3 Qxd3+": "My opponent saw no better alternative than to exchange queens, reluctant as he was.",
        "27. Bxd3 Nb3 28. Ne2": "As the black knight tries to make a getaway I attempt to stop it by controlling d4.",
        "28... Bd7 29. Kc2 Ba4 30. Kb2 Rac8 31. Nc3": "At this point, I'm just trying to get back the knight.",
        "31... b5 32. Nxb5 Bxb5 33. Bxb5 Re3 34. Rd1 d4 35. Ba4 Re2+": "If I take the knight with my king, then I get checkmated with 36...Rc3#",
        "36. Kb1 Nd2+ 37. Ka1": "Would 37. Rxd2 have been better?",
        "37... Rc3 38. Ka2": "I feebly try to protect a3.",
        "38... Nc4+ 39. Kb1": "Barely better is Ka1, since I am not checked on the next move. (Well, I guess it's no better at all.)",
        "39... Rb2+": "I resigned, because of an inevitable Ka1 Rxg3#. Rating and commenting are appreciated."
    },
    "url": "https://gameknot.com/annotation.pl/whsca-ind-championship-u1300-sec-rd-3-5?gm=29324",
    "gameName": "WHSCA Ind. Championship: (U1300) sec. rd. 3/5",
    "players": "Travis Olson (878) vs. William VanderVeen (1202)",
    "opening": "Queen's pawn (A40), Keres defence"
}