{
    "moves": {
        "1. e4 c5 2. Bc4 e6": "This was my usual response to 2. Bc4, to prevent complications with my f pawn.",
        "3. Qf3": "It looked like my opponent was planning an aggressive attack on my king-side, although it was too early and poorly executed.",
        "3... Nc6 4. Nh3 Nd4": "Threatening both the queen and a fork at c2.",
        "5. Qd3 a6": "I was preparing to trap the bishop...",
        "6. c3": "...but of course, he kicked me away, also giving his bishop a potential pocket at c2.",
        "6... Nc6 7. Qf3": "With the threat of the knight gone, my opponent sought to continue where he left off.",
        "7... b5": "Not wanting to trade my knight for his bishop, I instead kicked it to put my own bishop on b7.",
        "8. Be2 Bb7 9. Qf4 d6 10. Ng5": "He threatened mate and a fork on f7, but he didn't see that it was easily met.",
        "10... Nf6 11. d4 cxd4 12. e5": "White thought he could support a pawn push to e5 with a move like 11. d4, with the idea of chasing away my knight and winning the game. Moreover, White thought that \"striking while the iron was hot\" (with 12. e5) was better than first recapturing (12. cxd5). But in the process he forgot that e5 was defended twice by my knight and pawn.",
        "12... dxe5 13. Qf3 Qc7 14. cxd4 Nxd4": "I threatened his queen, his bishop, and a fork on c2. White couldn't stop all three threats, as you will see.",
        "15. Qc3 Qxc3+ 16. bxc3 Nc2+": "Of the three threats my opponent chose the best option, the fork.",
        "17. Kf1 Nxa1 18. Bb2 Rd8": "That knight was a goner, since after 18...Nc2, Bd3. I instead developed without losing tempo.",
        "19. Bxa1 Be7 20. f3 Nd5 21. h4 Bc5": "With this move I prepared my knight to make a series of jumps, which would continually put my opponent in check.",
        "22. Ne4 Bb6 23. Nd6+": "Just a cheap blunder from my opponent. He probably thought the knight was protected.",
        "23... Rxd6 24. c4": "White failed to meet the threat.",
        "24... Ne3+ 25. Ke1 Nxg2+ 26. Kf1 Ne3+ 27. Ke1 Nc2+ 28. Kf1 Nxa1": "By this point my opponent was greatly annoyed by my knight gobbling up his pieces while giving him repeated check.",
        "29. Kg2 Nc2 30. Bd1": "White neglected to notice the fork point at e3 and the fact that his bishop was only defended once.",
        "30... Ne3+ 31. Kf2 Nxd1+ 32. Kf1 Nf2 33. Rg1 Bxf3": "Finally, my pieces go after his king.",
        "34. Rg3": "This was my opponent's final blunder (Nc3 was the only good move).",
        "34... Rd1#": "And with that, I won the first round of the tournament. I was now more confident in my abilities from this point forward. On to round two!"
    },
    "url": "https://gameknot.com/annotation.pl/whsca-ind-championship-u1300-sec-rd-1-5?gm=29294",
    "gameName": "WHSCA Ind. Championship: (U1300) sec. rd. 1/5",
    "players": "Lee Carter (unr.) vs. Travis Olson (878)",
    "opening": "Sicilian defence (B20)"
}