{
    "moves": {
        "1. d4": "So here's a game where i win. i kicked off with d4",
        "1... b6 2. c4 Bb7": "He decides to fianchetto his bishop.",
        "3. Nc3 e6 4. Nf3 Be7 5. e3": "here i first should have gotten my dsb out.",
        "5... Nf6 6. Bd3 Bb4 7. Bd2": "Unpinning my knight",
        "7... O-O 8. O-O Bd6": "not sure what he was after with this move.",
        "9. e4 c5 10. d5 exd5 11. cxd5": "It it better to take with this pawn because it still threatens a for on knight and bishop",
        "11... Ba6": "offering an exchange of bishops",
        "12. Bxa6": "i had to take because if i would have gotten out of the way he would have taken my rook.",
        "12... Nxa6 13. e5": "forking the knight and the bishop",
        "13... Bxe5 14. Nxe5": "While winning the exchange i also get a nice centralized knight",
        "14... Qe7": "attacking my knight.",
        "15. Re1": "This is where a great queen chase begins",
        "15... Qd6 16. Bf4 Qb8 17. Qd2": "protected my bishop, in case of d6",
        "17... d6": "And it was good to do so",
        "18. Nc6": "attacking the queen",
        "18... Qb7 19. Re7": "Again attacking the queen while also infiltration on the 7th rank",
        "19... Qc8 20. Bxd6": "collecting a free pawn and also adding support to my rook",
        "20... Qg4 21. Rae1": "decided to connect my rooks",
        "21... Nb4 22. Ne5": "Here i did not want an exchange of knights so i decided to harass the queen a bit more",
        "22... Qh5 23. a3": "Here knight is kind of stranded, only square for it not to be taken is a6",
        "23... Ng4": "his threatening qxh7 check",
        "24. Nxg4 Qxg4 25. axb4": "winning the knight here.",
        "25... Qxb4": "Queen should not have taken back, because on b4 it is kind of helpless to defend blacks king.",
        "26. Qe3 h6": "black has to make room for his king to escape a backrow mate",
        "27. Ne4 Rae8": "i decided to get a pair of rooks off would be good for me",
        "28. Rxe8 Rxe8": "seemingly pinning my knight to my queen.",
        "29. Nf6+": "But surprise. Knight gives himself up for a mating sequence",
        "29... gxf6 30. Qg3+": "Now here move 25....qxb4 is punished, the queen is helpless against the attack",
        "30... Kh7 31. Rxe8": "there's no defending of the mate here, but it annoys me that everyone always resigns. Maybe someday i get to finish my combination in to a checkmate. Thanks for checking the annotation out."
    },
    "url": "https://gameknot.com/annotation.pl/why-everyone-always-resigns?gm=52499",
    "gameName": "Why everyone always resigns??",
    "players": "vavavi (1346) vs. shakers (1235)",
    "opening": "Queen's pawn (A40), English defence"
}