{
    "moves": {
        "1. e4 c5 2. Nf3 Nc6 3. Bb5 a6 4. Bxc6 bxc6 5. d4 e6 6. O-O": "This is a sicilian variation I sometimes like to do. It is the Rossolimo Variation. The main ideas of the Rossolimo are rapid development and seizing the initiative.  I have seen several games by Rossolimo himself and have come to admire this variation of the Sicilian.  When Rossolimo originally started playing 3.Bb5 he wanted to castle as early as move four and then go on the attack.",
        "6... Nf6": "At this point, white is ahead in development, and black has moved too many pawns in the opening. This usually results in problems in tempo.",
        "7. e5 Nd5 8. c4": "Taking control of a weakened black center position, while attacking the running knight. Again, black continues to lose tempo by moving the same piece multiple times while not attacking anything. ",
        "8... Nb6": "The first safe square black has moved to. ",
        "9. Bg5 Be7": "!? - A ok move to protect the queen and activate the bishop, but I would've preferred the more sound response of Qc7 at this point. Though this option does give black the ability to castle.",
        "10. dxc5": "Attacking the knight again and forcing black to move the knight once again. By delaying the castle 1 move, I further strengthen the tempo for white. ",
        "10... Nxc4": "? - A more solid response and perhaps more intriguing is Bxg5!\nWith Bxg5 cxb6, white still has a significant lead, but at least the bishop is out, and for the moment, safe.",
        "11. Bxe7 Qxe7 12. Qd4": "Bringing more pieces into the game, I bring out my queen to protect b2, fortify my weak central pawns, and keep pressure on the knight.",
        "12... Na5 13. Nc3": "! - A key move. Planning the Ne4 response to a castle to bring an interesting attack to the destroy the black kingside.",
        "13... Nb7": "? I did not understand this move. Maybe trying to protect d6 or attack c5?",
        "14. Ne4": "Attacking d6! and f6! Both of which are very weak.",
        "14... O-O": "? - With this move, black moves into what I was planning a bit earlier. Now the fun begins.",
        "15. Nf6+": "! - taking advantage of a weak position on the kingside. But black does correctly pick the right move, as taking would've been disastrous. ",
        "15... Kh8": "Must commend black because not everyone would know to not take the knight! Well done.",
        "16. Ng5 h6": "Another good move. Puts pressure on the knight and adds some protection to the weakened king.",
        "17. Qe4": "Adding more pressure and continuting to exploit the weaknesses of black's position. ",
        "17... g6": "A 3rd good response!. Stopping the mate threat in its tracks.",
        "18. Qh4": "Protection by virtue of attacking.",
        "18... h5": "?? - A move that significantly empowers this entire attack. Kg7 is much more solid. Now black must choose to play without a queen, or fall into the mating net.",
        "19. Nxh5": "So what do we learn here: in the opening, make more development moves rather than just pushing pawns. Tempo is not a term we higher rated players throw around. We must move 1 or 2 pawns, develop all minor pieces (Bishops and Knights) off of the back rank, and castle the king to safety. Of course, we must parry any threats along the way put forth by our opponent. The pawns should either occupy the central squares, or allow for the development of our minor pieces to influence it (as when we fianchetto a bishop for example to g2, g7 or b2, b7). I do commend stealth-invader for putting forth a valiant effort, and some of his moves do indicate he is capable of being a great player. "
    },
    "url": "https://gameknot.com/annotation.pl/why-is-the-opening-so-important?gm=53577",
    "gameName": "Why is the opening so important?",
    "players": "darknite13 (2064) vs. stealth-invader (1480)",
    "opening": "Sicilian (B30), Nimzovich-Rossolimo attack (without ...d6)"
}