{
    "moves": {
        "1. d4": "Second clash against Joanne. Soon, as usual, we fall into tactics, with surprises and tricks jumping out form any corner. To me, to have fun with chess means to enter into wild tactic positions. In on-the-board games, I'm far too poor at it. With time to analyze, I get often so overwhelmed with possibile lines that I can spend days on them. My work don't allow me to do it. Even so, my question is: \"How to manage complex situations like this one?\" Which is the right pattern to follow? I remember what Bent Larsen said in his book about Korchnoi - Karpov's match: Korchnoi loses so much time looking for incredibly deep combinations that, sometime, just don't exist at all. That's why he fells for time trouble so often\".",
        "1... c6": "Not the more usual answer. The good thing about this is that opens the way for the queen to b6, that is normally a good move against the scheme I am used to play. I have to be ready to defend b2.",
        "2. c3": "This is the normal move for the scheme I play. I can defend b2 with both Qc2 or Qb3. Of course c4 is good, but it is overplayed and overstudied. I want to shield my queenside in order to proceed with an attack on the kingside. \nI know it is too soon for a plan, but this is the way I play. ",
        "2... d5": "Normal. ",
        "3. Bf4": "Now that b2 is not a concern, I can go for my favorite line. I could have played Nf3 first, but this assures me the best place for my bishop. ",
        "3... Bf5": "Now I laughted. So we are playing for simmetry... aren't we?",
        "4. e3": "I was so tempted to try the sideline f3!?, with an inmediate g4 etc. advance, but it really makes difficult for me to develop my kinside. Let's be serious...",
        "4... Nf6": "Ah, well, so now I go for Nf3 and it is still symmetry. By the time, I spent a lot wondering about BxN, Qb3 and Qa4... or combinations of there ones, but nothing catched my eye. ",
        "5. f3": "So I decided to go for the \"weird one\", against my previous idea. Let's start thinking. This advance is against my way of playing, which keeps open the white diagonal for the queen or bishop (after Be2). But it was obvious I couldn't go for \"my\" usual piece settings, and I had to go for something \"better\" (?). This is an experiment...",
        "5... e6": "I would have played h5, being black. Jo is more conservative. And my f3 move does mean I don't have my knight on f3, so if she plays \"normally\", I will just be inferior. I \"have\" to demostrate f3 had a purpose. ",
        "6. g4": "Well aware of the offside of this. Nxg4, fxNg4 and Qh4+, Bxg4. Did Jo give it some consideration? It is too much a \"daring\" move? Opinions welcomed! :-)",
        "6... Bg6": "Trying to save the bishop normally provides me with a ready-made pawn storm. But it is dangerous, because I am not developed. ",
        "7. h4": "This is not much of a threat, it is to stop any idea of Qh4 check, that is usually deadly for white. But it makes black think about h6 or h5. Jo went for another surprising idea.",
        "7... Bxb1": "Oh my! So she gambled me! Never, no one had taken the knight before (in a similar position)!\nSo the first hard choice. My idea is to castle queenside, so RxB seems to leave my king wihtout a cave to hide in. On the other side, my plan is to control the white squares, and my queen is not doing much at the time, blocked by my own pawns. So, once again, I'll try to be coherent with my original idea. ",
        "8. Qxb1": "I didn't fear Qa5 or Qb6 anymore. The black's best move, in my opinion, is c5. ",
        "8... Bd6": "Now my \"regular\" Ne5 is not possible. Of course, not BxB, since I have a hole in g3, and f4 is not possible due to Nxg4. The normal one, Ne2, keeps my lsb trapped. Nh3 was the move, but...",
        "9. Bd3": "I told I wanted to take advantage from the white squares, so I have to build my pressure over them. If Nh3, BxB, NxB, and my knight is doing nothing over there.",
        "9... Bxf4 10. exf4": "This way, a kinside pawnstorm is set. Of course, I didn't expect this to make me win. In fact, I have the horrible feeling that I will lose this :-)))",
        "10... h6": "This, now, appears to be too much \"fearing\" my attack. It doesn't help to prevent g5, since I can retake with f4. But I won't do it anyway, not while the black knight can jump to h4, for instance. Anyway, this also opened me ideas of some Bg6 sac, but it is not enough, so I stopped my hand. I should have gone for developement in sight of a possible o-o-o. But...",
        "11. f5": "Let's go for the white squares, then. Too soon, I know. I keep telling Jo she is not enough aggressive, but I am too much of it. But it seemed to me that if I allowed black to develop, I would be lost - my king is trapped in an open middle.",
        "11... Qe7": "Obviously, she takes advantage of it. ",
        "12. Rh2": "Another piece becomes active, while my position becomes weirder. I though about Ne2 or Kd2, too. But I have to prevent e5 in the strongest way I can. If I cannot open the white diagonal, all my strategy goes to the trash can. And black only has a queen and a knight to attack, for some moves. I have pawns and a rook, besides the bishop/queen limited but strong action.",
        "12... O-O": "Oh, My... Did she dare? I cannot believe it! This way, she is putting her king just under the fire! Ok, it releases the QK pin, and if I go fxd6, with f7xd6 she will open a line against f3. I felt that it was not to be allowed by any mean. I would criticize this move as \"castling must be good\". Sometime I will go through my games and see how many times I castled in the opening... not much of a work, I guess...",
        "13. g5": "Don't believe I was thinking I would have won this. By this time, (after spending my usual lot of time \"analyzing\"), I thought that I would have been lucky if ever I will survive. But I have to show Qb1 wasn't totally bad... :-). And I'm sure I made Jo think hard :-) By this move,  I was already thinking in shielding my king with Ne2 (in case of a queen check), or Kd2, not Re2. Anyway, this move was probably premature. ",
        "13... hxg5": "Any slip is fatal for both players. I thought this was the one. I was wrong, but the potential mate combinations on h7 are so juicy... now I was sure I wouldn't shield my king with the rook (an useless knight can do that. Or just Kd2, preventing any idea of Qe3 for a while). But Jo has a trick in her sleeve. Jo set a whole line of conditional moves, here. She made ME think a lot.",
        "14. hxg5 exf5+": "So it is time for Ne2, or Kd2. As for the latter, I realized she had Nh7, Bxf5, g6, and I didn't see a clear win after that (not even a bishop sac in g6). And if I went f4, g6 would have shielded her. It takes too many moves to double rooks on the h column, even if it was deadly. I spent a lot of time, but then I decided to go for the \"normal\" one. I'm not sure it was ok. ",
        "15. Re2": "I knew I wouldn't have taken a piece for free... Jo was well aware of this, surely, and she had something in mind. ",
        "15... Ne4": "OH, well! Jo shows his nails! Wonderful. I calculated this one, and realized, slowly, the sac is very dangerous for me to accept, mailny because of g5. So I started to think hard. I not necessarily have to keep the piece, not even take it. I thought f4 would have been wise. But I am not wise... :-)",
        "16. fxe4 fxe4": "So here it cames the \"big think\". The \"normal\" is: Bxe4, dxe4, Qxe4, Qxg5. Leading to a lost endgame, because of the black pawns. So my choices are: 1) Nf3. The queen must go away, so to release the pin, say Qd6  (threatening Qg3. How much dangerous is it?), or Qd8. Then, Bxe4, etc. 3) Qc1. She retires the queen, and again I have to choose between try to keep the extra bishop (almost useless, for now), or sac it for 2 pawns and a more free position. Essentially, the question is: it is better to play a bad position with one piece for three free pawns, or a better position with even material? And the answers is: it is better the former, IF THE 3 pawns can be stopped or taken. And I wasn't sure. So...",
        "17. Nf3": "I'm not so good to analyze all the possible outcomes. I was sure Bc2? Qxg5. But among Qc1 (fighting to preserve the bishop, and play a piece against 3 free pawns in a cramped position) and Nf3, planning to give back a piece and centralize my queen and keep my developement advantage, I choosed the second one. And I broke the conditional moves, finally! :-) By the way: I set here a lot of conditional moves, too... just to return the courtesy. :-)",
        "17... Qd8": "As expected. (But Qc7 (looking to g3) must have deserved a try). This forces me to...",
        "18. Bxe4 dxe4 19. Qxe4": "Now my queen is free, and looking to h7. All of a sudden, my position is even better than hers! The main point: I keep the g5 pwan, that happened to become a key piece for me. Without it, I'm crushed! I already devoted a lot of time just to get here, but the best is still to come.",
        "19... Na6": "Now Jo breaks the conditional move, with this unexpected knight outcome, that makes possible Re8. Is she looking for c5, beside? Now, the question is: the little pawn can still be harmful if g6? For instance, fxg6, Qe6+, Rf7 (forced, or Rh1#), Ne5... but I came to the conclusion that it doesn't work. Can you tell me? I, as black, would have played g6, probably. ",
        "20. O-O-O": "\"Sad\" necessity. But now, castling is an attack - not a defensive move. 20. Rh2 instead didn't work because 20..., Re8 pins my queen. Oh, I've spent hours considering 21. Ne5, but no use. 21..., Qxg5, 22. Qh7+, Kf8, 23. Qh8+, Ke7 and the only try is 24. Re2, and if RxQh8, 25. Nf3+ (disc), but Kf6 saves the day for black, who has Rh1+, winning my other rook. \nAnother try is: 22. Rf8+, KxR (forced), 23. Nxf7+, forking, Rg8 (forced), 24. NxQ, RxQ+, 25. NxR, BUT Re8 wins the knight!",
        "20... Re8": "So here it comes. How will a good player manage this situation? Ok, the \"normal\" and \"easy\" one is Qd3, RxR, QxR and the game is equal in material, and the tension is released... partially.\nBut of course, the marvel would be if 21. Qh4 were a good move. Oh, it looks horrible: 21..., RxRe2. But look: 22. Rh1 threats mate. If 22..., f6, 23. Qh7+ and black cannot Kf8, since 24. Qd3 threats Rh8+ (with the queen behind), and the white rook on e2 is lost. Nice. But black can go 23..., Kf7, and white can do something more? Let's go wild: 24. Ne5+, f6xN, and 25. Qh5+ recovers the rook and pins e5, but loses g5 with check... it is enough? OR: 25. Rf1+, Kmoves, and white can go on with the checks, with the rook hanging on e2... and if the black king ever goes to d6, d5xe6+ leaves white Rd1... On the other side, 24. g6+ is also a try: if 24..., Ke7 or Ke8 just help because it allows Qxg7+ (and then Qxb7...), but if 24..., Ke6, 25. d5+ allows Kd4+, forking the rook, or allows Rd1+... and white has to consider all this after 25. Qxg7, who threats Qf7+... Can you figure all the variants? I sure can't handle all this. Back to the start: Black can defend the mate with 22..., Kf8 (Fritz, later, gave this as the correct answer for black). 23. Qh8+, Ke7, and white doesn't have anything better than 24. Qxg7, Qd6... and it's over. Ok, so let's try: 23. Qf4 (threats Rh8+, recovering the material. Black can defend with Qd4 (if 24. Rh8+, Ke7, 25. RxRa8, Qxa2 (threats Qa1#), 26. Nd2, Re1+, 27. Kc2, Qa4+, 28. Qa2+, 29. Kd3 and white holds... with a pawn less. Now look: if black defends with 23..., Re8, 24. Rh8+, Ke7, 25. Ne5!, RxRh8, 26. Qxf7+ and mate. \nAnd so on... So, what's the conclusion? How does a good player handle a situation like that? \n (Later, Fritz said this is +3.33 for white. Ne5 only +2,60 or so... and Qh4 gives a little inferior game for white. So, I spent all this time \"for nothing\", just like Korchnoi would have done! - except he is \"a little\" better than me :-)",
        "21. Ne5": "Finally, I decided for this less compromising one (the second best, according to Fritz, whom I \"asked\" after the game). It throws away the very important g5 pawn, but doesn't lose a whole rook, just in case. \nThis move allows f6, pinning the knight, but I have the Rh1 resource to counter it (with similar complex tactics as before involved). Now, Jo can release the tension with Qxg5+, Kc2, Qg6, NxQ, RxQ, Ne7+, RxN, RxR, but I stay an exchange up and she with 2 passed and joined pawns. Probably a draw. But she didn't go for it.",
        "21... Qxg5+ 22. Kc2": "So I lost g5 and black has a free tempo. But... how can she take advantage of it?",
        "22... Nc7": "A surprise, I was expecting c5, f6, or f5. And, probably, a fatal loss of time.",
        "23. Rh1": "This is the right rook, I think. Of course, f6 is still on sight, as f5 or Qg6. I spent time looking for these, of course. Another possibility for me, maybe even stronger, was Rg2, and the black queen cannot fly to b6. f5 from black should be taken into consideration, too. In that case, Rg2 will do it (fxQ, RxQ, and the black passed pawn is hard to defend).",
        "23... f5": "So Rg2... but there is only one life... live it fully! :-)",
        "24. Reh2": "Queen is safe for the mate threat. And after the only possible move...",
        "24... Kf8 25. Rf1": "...the feast goes on! I analyzed 25. Nd7, but I couldn't see anything decisive after Kf7. Even worse was 25. Rh8+, Ke7, 26. Nxc6++, Kf6 (any other loses with tricky mates, but this one holds! Oh, my, what a hard think for just one game!). Besides, black cannot play for a draw with Kg8, due to Rxf5, of course.",
        "25... g6": "Even if it sounds a likely move, probably it was better to drive the king to e7 - d8. ",
        "26. Rg2": "Best place for the queen: h5, I think. 27. Nxg6+, QxN, and now not 28. RxQ, RxQ, but 28. Rxf5+, Kg8, and an inmediate win is still far. ",
        "26... Qf6": "This was almost a resignation.",
        "27. Nxg6+": "Crushing. Because after QxN, it comes Rxf5+.",
        "27... Kf7": "The best one, given the position. ",
        "28. Ne5+": "Now, the train was: RxN, QxR, QxQ, dxQ, Ke6 and, with only an exchange under, another game starts. Not a good one for black, but better than the following.",
        "28... Ke6": "Look at this pretty line, one you would like to play for all your life (and not just see it in tactics excercises :-) \n29.\tRxf5\t\tQh8\n30.\tRg6+\t\tKe7\n31.\tRf7+\t\tKd8\n32.\tRd6+\t\tKc8\n33.\tQf5+\t\tKb8\n34.\tNd7+\t\tKc8\n35.\tNb6+\t\tKb8\n36.\tQc8+\t\tRxc8\n37.\tNd7#\n\nMany other lines give white a won engame, or a checlmate, but the way to get it is not always obvious, and it is a very interesting excercise for average players to find them. I did some homework on my conditional moves, but unfortunately I didn't save them. ",
        "29. Rxf5": "Jo should have done her homeworks too, since she resigned here, even if it was not so obvious she will lose at once, e.g. 29... Ke7, 30. Ng6+, Kd8, 31. QxR+, NxQ, 32. RxQ, NxR and all white has is a pawn. Of course there are better moves for white. I want to thank Jo for such an entertaining and tense game, on which I spent a lot of time, sure much more of what is reasonable for a \"normal way of living\"... and showed me \"Why I don't play chess anymore\"!"
    },
    "url": "https://gameknot.com/annotation.pl/why-i-dont-play-chess-anymore?gm=38510",
    "gameName": "Why I don't play chess anymore :-)",
    "players": "damalfi (1775) vs. jstevens1 (1795)",
    "opening": "Queen's pawn (A40)"
}