{
    "moves": {
        "1. e4 e5 2. Nf3 Nc6 3. Bc4": "This has to be the most straightforward line White can possibly play.  You don't often see it in master play, as Black seems to be able fairly easily to match White (by which I mean, keep a rough equality, not 'copy').",
        "3... Nf6": "Two Knights' Defence: one of my favorite openings for either side....  instead, 3...Bc5 leads to the Giuoco Piano, and I daresay there are many other lines Black could consider.",
        "4. d4": "(!?) The recommendation of Grandmaster S. Tarrasch.  Though 'positional' in intent, can lead to interesting and sharp play, such as the famous Max Lange Attack.  More often I play the sharper 4.Ng5 - 'A beginner's move', sneered Tarrasch, but it leads again into some very wild country (though Black should shun the frumious Fried Liver [Fegatello] Attack).  I have a feeling White's best - certainly solidest - line is 4.d3 - the Bishop's Opening by transposition (1.e4 e5  2.Bc4 Nf6  3.d3 Nc6).",
        "4... exd4 5. O-O": "White had a wide choice, here: 5.Nxd4; 5.e5; 5.Qe2 being the main ones.  This ducks the King out of danger, and offers a pawn that White hopes will lead to good things along the e-file for his rooks.",
        "5... Nxe4": "Taking the bold line.  The move is OK, but White attempt to exploit the open e-file.",
        "6. Nc3": "(??/!!) This was my recent discovery, probably looking at the database.  Surely this can not be sound?  What White is doing is trading material for time and space, massing for an all-out assault upon the Black King.",
        "6... dxc3": "(!) The right thing to do if Black had no reason to suppose White had suffiecient attack to balance the material invested.",
        "7. Bxf7+": "(??/!!) Apparently crazy - a piece down, White throws another piece into flames of Moloch.  Two pieces short and almost no development, what has White got?",
        "7... Kxf7": "Of course, Black has to take the bishop, pretty much, as 7....Ke7  8.Qd5 and White is at lest level already.  But there is also no reason for Black to apprehend trouble, is there?",
        "8. Qd5+": "At this it becomes apparent that White will get a piece back quite quickly, and the Black King will be stuck in the centre.  In fact, all the material given up has been in the interests of time.  White will now mobilise very, very quickly.",
        "8... Ke8": "The only viable alternative was ...Kf6, and who would have the courage to play that?  This retreat is safest.",
        "9. Re1": "Obviously, taking back the knight at once with the Queen would have been hopeless. Time is of the essence.  The knight can not run away, and he's well and truly in the cross hairs.",
        "9... d6": "(!?)  Probably already the key moment in Black's defence.  This pawn advance looks a reasonable and plausible defence, and one that certainly came into consideration: to free the Q-side, and to give the King a bolt-hole.  However, the best defence seems to be 9...Qf6.  Even then, though, White gathers together his forces for a terrific attack: 9...Qf6  10.Bg5 Ne7  11.Rxe4 Qf7  12.Qd4 d5  13.Re5 (13.Rf4 comes into consideration, too) ...Bf5 (...cxb2 or ...c5 are alternatives to think about)  14.Rae1  and White is attacking with everything he's got - and with apparently good prospects, too.  It would appear, then, that the gambit has a lot going for it.",
        "10. Rxe4+ Ne5": "(?) Not the best, as White's attack just rolls over this 'beau chevalier'.    Nor would 10...Ne7 have been enough:  10...Ne7  11.Ng5! cxb2  12.Bxb2 Kd7 (White was threatening 13.Qf7ch Kd7  14.Ne6 Qe8  15.Qxe8ch Kxe8  16.Nxc7ch Kd8  17.Nxa8, winning the exchange.  Although the Knight looks imprisoned at a8, Black has only problematical chances of reeling in the catch.  The best defence, then, appears to be 10...Be7!, but even then White keeps up the pressure by 11.Bg5! cxb2   12.Rae1 b1=Q  (an attempt to deflect White's pieces away from the main attack on the Black centre) 13.Rxb1 h6  (striking at the bishop to force an exchange)  14.Bxe7 Nxe7  15.Rbe1 (back again!).  At this point, if 15...Kf8, White can [A] go in for a promising ending by 16.Rxe7 in which is active Q and N (compared with Black's undeveloped army) make up for a slight material deficit; or [B] continue the attack by 16.Qh5 (e.g. 16...g6  17.Qh4 g5  18.Nxg5!  Man, White is sure lord having all the fun in this game!",
        "11. Bg5": "At this point White must have at least an equal game.  Black's resources are quite stretched, and it is very hard to find a credible defence.   So far, Black has just the one piece developed, and that an outpost knight about to be overrun.  All but one of White's pieces is in action already, and the a1-Rook can be mobilised, if required,  in one move.",
        "11... Be7": "This bishop move covers the e-file and protects the Queen, but this even doesn't slow down White's attack.  Nor was 11...Qd7 any use after 12.Nxe5 dxe5 (12...Qf5  13.Ng6ch Qxe4  14.Qxe4ch etc)  [A] 13.Rxe5ch Be7  14.Rxe7ch Qxe7  15.Bxe7 Kxe7  16.Re1ch Kf6  17.Qe5ch, and, if nothing better shows up, pick up the c3-pawn (though White can probably begin weaving a mating net after 17...Kg6 18.h4, say).   The counterattack 11...c6 leads to 12.Rxe5ch Be7 (Running's no good, as after 12...Kd7  13.Qe6ch Kc7  14.Bxd8ch wins Black's Q with check, whereat White's Queen can make off.  And of course, taking the rook allows Qxd8ch etc)   13.Rxe7ch Qxe7  14.Qd4 (a pause in White's attack!) 14...c5  (to deflect the WQs attention away from d6)  15.Qxc3 Qf7  16.Re1ch.  In this line, though White is still down Rook for Knight, and the first wave of his attack has been stemmed, so active are his pieces compared with Black's, that his chances must be the more favorable.",
        "12. Nxe5 dxe5 13. Qxe5": "There is no saving the bishop, of course, and the capture ...cxb2 would be only a minor irritation.  Black's best is to bite the bullet with 13...Kf7 or maybe 13...cxb2  14.Qxb2 Kf7.  ",
        "13... Kf8": "(??) After this, the game loses its interest.  Black had the right idea - get the King out from under - but forgot about the bishop fork that White would play in response to this move.  13...Kf7 was correct, but already White would have gained the advantage.  Now the end comes quickly.",
        "14. Bxe7+ Kf7 15. Bxd8 Rxd8 16. Qe7+ Kg6 17. Qxd8": "1-0.  A game such as this does not prove anything one way or another about the virility of the Yurdansky Gambit after 7.Bxf7ch. The analysis is suggestive, however, that it is worth a try, and Black's life on defence is not an easy one.  I recommend it to any developing players (including id=chicoboy) to try it for themselves."
    },
    "url": "https://gameknot.com/annotation.pl/wild-woolly-and-wicked?gm=45541",
    "gameName": "Wild, Woolly and Wicked...",
    "players": "ionadowman (2079) vs. chicoboy (1200-)",
    "opening": "Two knights defence (C56)"
}