{
    "moves": {
        "1. g3 e5 2. Bg2 d5 3. Nf3": "?\n",
        "3... e4 4. Nd4 c5 5. Nb5": "? Running low on squares.\n",
        "5... a6 6. Nb5a3 b5": "!? Nail in the knights coffin.\n",
        "7. d3": "? Trapping knight on a3. But so far theoretical. All blacks moves are pawn moves - potentially permanent weakening moves. Weighed against whites fast development who knows what is going on here!?\n",
        "7... b4 8. c4": "!?  [ 8. dxe4 bxa3 9. exd6 axb3 10. Bxb2 and white has strong bishops against blacks exposed king.]\n",
        "8... bxa3 9. cxd5": "9. bxa3 Qf6!\n",
        "9... axb2": "[ worse is 9... Qa5+? 10. Nd2 [10. Nc3? Nd7 11. dxe4 Rb8! and white faces considerable difficulties] ]\n",
        "10. Bxb2 Nd7 11. dxe4": "And after the smoke has cleared white is a pawn down but for obvious attacking compensation.\n",
        "11... Rb8 12. Qc2 Qb6": "Creating short and long term threats. Eg, ..c4, ..Bc5 ..Nf6-g4, etc..\n",
        "13. Bc3 Qg6": "A useful pin against White's unprotected queen.\n",
        "14. Nd2 Ngf6": "Threatening 15... Nxd5!\n",
        "15. Qa4": "! \n",
        "15... Ng4": "15...Bd7 16. e5 Ng4 17. Be4 Qh6 18. d6! and things look bleak for black due to imminent strikes like Nc4, Bf5, e6!\n",
        "16. h3 Ne3": "!! Good try.   White though once again plays solidly. \n",
        "17. Bf3": "!   [ 17. fxe3 Qxg3+ 18. Kf1 Qxe3 19. Qc4 Qf4+ 20. Nf3 Bd6 and black has good chances. ]\n",
        "17... Rb5": "Black overlooked 17. Bf3! and now has a stranded knight. If white can play Rg1 then all his problems are solved.   After 17...Rb5 however things are a little more complicated.   Threatening 18...Nb6 which, amazingly, wins the white queen! [ 18. Rg1 Nb6! 19. Qa3 Nc2+ ]\n",
        "18. fxe3": "Effectively forced. (See previous note)  [ 18. Nc4? Nxc4 19. Qxc4 Nb6 20. Qd3 Na4 and black stands much better. ]\n",
        "18... Nb6 19. Qa3 Qxg3+ 20. Kd1 c4": "Discovered attack! White is becoming enormously cramped and i think black has adequate compensation for the knight sacrifice.\n",
        "21. Qc1 Bd7 22. a4 Rb4": "22...Rc5 23. Bd4.\n",
        "23. Qc2": "Why not take the rook, like everybody else would!!??  The obvious 23. Bxb4 Bxb4 24. Nxc4 looks OK to me.  \n",
        "23... Rxa4": "The rook is immune of course, and overprotected.\n",
        "24. Qb2 Bb5": "? Unfortunately overlooking whites plan.  [ 24... Bc5 25. Nf1 Qh4 26. Bxg7 Rxa1+ 27. Qxa1 Ba4+ 28. Kd2 Rg8 29. Bf6 Bb4+ with a strong attack for black ] [ 24... Qg6 just defending the knight is OK ]\n",
        "25. e5": "! It begins. Black has allowed white to untangle. \n",
        "25... Qf2 26. d6": "Very strong! Blocking in the bishop is crucial in the delicately balanced position. Now white is clearly better.  [ My careless move, 26. Bd4 fails to ...c3! 27. Qxc3 Bb4 28. Qb2 Bxd2 29. Qxd2 Nc4! and black is castling soon with a strong attack ]\n",
        "26... Qxe3 27. Rb1": "Eliminating the ...Rxa1 idea. \n",
        "27... Qg5": "?\n",
        "28. Rf1": "Missing an immediate win with Bc6+!   [ 28. Bc6+ Bxc6 29. Qxb6 Bxh1 30. Qc7 with no way for black to survive. [ 29... Bd7 30. Qc7 Qd8 31. Rb8 Be7 32. e6! <--- an amazing position, well worth analysing] ]\n",
        "28... Nd7 29. h4": "A move which baffles me. \n",
        "29... Qxh4": "Unfortunately blacks earlier 20...c4 has spoilt communication between his pieces. In fact, most of his pieces have few good moves.\n",
        "30. Bd5 Nc5 31. Rxf7": "Maybe 31. Bxf7 was stronger. Especially if the queen was still on h5.  31 ...Kd7 32. Bb4 Rxb4 Ne6 33. Bxe6+ Kxe6 34. Nf3! \n",
        "31... Qg4 32. Ra7 Ne6": "Only move.   [ 32... Qg3 33. Bc6+ Nd7 34. Ra8+ Kf7 35. Bd5+ and 1-0 ]\n",
        "33. Kc2": "Both players are now in a time scramble to reach move 40.\n",
        "33... Nd8 34. e4": "Securing the bishop on d5.\n",
        "34... Qe2 35. Rf1 Qd3+ 36. Kc1 Qe3 37. Rc7 Qg3 38. Nxc4": "!\n",
        "38... h5": "38...Bxc4 39. d7+ Ke7 40. Qb4+! Rxb4 41. Bxb4#\n",
        "39. Bb4": "With seconds left on the clock, White misses the hammer blow 39. Rc8! However the position is clearly won anyway.  [ 39. Rc8 Qg5+ 40. Bd2 and black cannot prevent the mating pattern Bf7+ Kd7, Rc7#\n",
        "39... Qg5+ 40. Kb1 a5": "White has reached the time control equal on material, but with a crushing position.\n",
        "41. Rc8 Qg6": "41... axb4 42. Bf7+ Kd7 43. Nb6#",
        "42. Bc5 Rb4": "Allowing a great finish.\n",
        "43. Qxb4": "!! The beginning of a nice combination to finish the game.   \n",
        "43... axb4 44. e6": "Amazing position, and now black is defenceless. \n",
        "44... Ba4": "All moves fail for black.\n",
        "45. Rxf8+": "!\n",
        "45... Rxf8": "45... Kxd8 46. Rxd8+ Be8 47. e7#!\n",
        "46. Rxd8+": "All forcing moves regain the queen on f8. Of course white was not giving away the queen blindly on b4 - it was a temporary sacrifice in a forcing continuation. 44. e6! was the key, and black had no adequate response.\n",
        "46... Kxd8 47. e7+ Kc8": "47... Kd7 48. Nb6+ Ke8 49. d7+! Bxd7 50. exf8=R#!\n",
        "48. Nb6+ Kb8 49. exf8=Q+ Qe8 50. Qxg7": "1-0 Threatening mate on both c7 and b7!   Difficult to pinpoint where black went wrong. On move 23 he had pushed white back and was looking for a way to attack. Before this he had played very solidly against whites dubious opening, and also played with imagination and flair (16...Ne3! would have beaten weaker opponents). In my opinion he stood better. Things started to slide after 24...Bb5? and i think defending the knight instead of blocking the attack was a better idea. After white broke free he himself played very imaginatively and took advantage of a seemingly careless spell of moves from black, notably between 24-28. White missed a couple of immediate wins on moves 27 and 39 but finished off with a fantastic continuation starting with the amazing 43. Qxb4!!  Great game.\n"
    },
    "url": "https://gameknot.com/annotation.pl/wild-west-101?gm=25855",
    "gameName": "Wild West 101",
    "players": "Savchenko, B (2650) vs. Bagirov, R (2467)",
    "opening": "Benko's opening (A00), reversed Alekhine"
}