{
    "moves": {
        "1. e4 e6": "I really don't like playing against the French; pushing the e-pawn to e5 seems dubious, but White often ends up playing it. But not here...",
        "2. d4 c5": "Straightaway we are not going to see the usual French. I gather taking the pawn leads to some sort of Benoni game, which I didn't fancy. Nor did I like the idea of advancing the d-pawn.",
        "3. Nf3": "I try to steer the game into a more familiar Sicilian.",
        "3... cxd4 4. Nxd4 Bc5 5. Nb3": "5.Be3 is better, developing a piece and defending the Knight. But this attacks Black's Bishop, so no real tempo has been lost.",
        "5... Bb6": "Black uses a move to retreat the Bishop.",
        "6. Nc3": "I'm already slightly ahead in development.",
        "6... Nc6": "6...Ne7 allows Black quicker castling, which is probably better.",
        "7. Bf4": "Possibly not the best move, since Black can just drive the Bishop back by advancing the e-pawn and gaining space.",
        "7... e5": "Which he does.",
        "8. Bg3": "Going back along the c1-h6 diagonal makes the previous move a little pointless; this covers f2, something that grows to be most important!",
        "8... h5": "Logical, I guess, to try to trap the Bishop.",
        "9. h4": "Equally logical and necessary to prevent it.",
        "9... d6": "Black is probably better getting out the other Knight, but my opponent likes attacking, risky and unusual strategies, and that Bishop could find a nice square on g4 supported by the h-pawn.",
        "10. Be2": "Interestingly, I'm already slipping into a defensive mind-set, protecting g4, when 10.\nQd2 followed by Q-side castling might give me a better edge.",
        "10... Nf6": "Black gets out his other Knight.",
        "11. Qd2": "I prepare for castling Q-side.",
        "11... Be6": "Black gets out his last minor piece and threatens to double my pawns.",
        "12. Qg5": "Very suspect, in retrospect. This early sorte by the Queen results in Black gaining a momentum by driving it back and back and back...",
        "12... Bxb3": "First, though, he carries out his plan to double my pawns, at the same time taking away the defender of the d4 square, something I hadn't really considered a problem.",
        "13. axb3 Nd4": "But Black has thought of it and has a nice, if temporary, spot for his Knight.",
        "14. Bd3": "My Queen is positively begging to be brought back, but I still feel there's a worthy attack. Somewhere.",
        "14... Ne6": "d4 proves just a stepping stone in the start of Black's Queen-harrassing.",
        "15. Qf5": "The Queen really isn't getting the message!",
        "15... Ng4": "Building up a nice attack on f7, but with the Bishop guarding that square it's rather toothless - and Black has left d5 unguarded.",
        "16. Nd5": "So I follow his early example and post a Knight there.",
        "16... g6": "Black continues to hassle the Queen.",
        "17. Qf3": "Back she goes...",
        "17... Nd4 18. Qd1": "Back, in fact, to the starting square, proving what a silly move Qg5 was.",
        "18... O-O 19. c3": "Black finally castles behind a somewhat weakened defence. The computer actually has me ahead, but it didn't feel that way, as I drive away one Knight.",
        "19... Ne6 20. Be2": "And get ready to do the same to the other.",
        "20... f5": "Black doesn't want to retreat the Knight, and here I should have taken full advantage of the weakened Black defence with 21.exf5 gxf5 22.Bc4. I didn't because I thought Black might recapture the f-pawn with his Rook, building up his attack on f2. But that would have fallen foul of 22.Bxg4 followed by 23.Qxg4 and White is on top.",
        "21. Nxb6": "Instead I give up my nicely posted Knight for the Bishop that's been bearing down onto f2.",
        "21... Qxb6": "Now I have the Black Queen on the same diagonal. Not the smartest move.",
        "22. Qd5": "I do get my own Queen to the centre of the board, though exchanging pawns on f5 first was still advisable.",
        "22... Rf6": "Better to bring out the other Rook and defend from e8; I still have the option of exchanging on f5...",
        "23. Rd1": "Instead I build up against the d-pawn, letting another chance to exchange on f5 go",
        "23... Rd8": "Black defends the d-pawn",
        "24. O-O": "And here I blunder, not only passing up my chance for 24.exf5 gxf5 but castling into a mass of advancing pawns...",
        "24... Kg7": "First, though, Black gives me one more chance by stepping aside with his King to unpin the Knight.",
        "25. Rd3": "I want to double up my Rooks, but I don't get chance...",
        "25... f4": "Having unpinned the Knight, Black doesn't attack the Rook with 25...Nc5, but drives back the Bishop instead.",
        "26. Bh2 Nc7": "Black begins to chase my Queen again.",
        "27. Qc4": "Black could now play 27...Ne6, threatening 28..Nc5...",
        "27... Nxh2": "Instead he rather loses momentum by exchanging off his nicely placed Knight.",
        "28. Kxh2 Qc6": "Offering a Queen exchange that I don't fancy, even though it takes a bit of the pressure off and allows me to seize the open a-file with the Rook afterwards.",
        "29. Rf3": "Instead I allow Black to exchange if he wants...",
        "29... Ne6": "But he doesn't. I think we both wanted to keep potential attacks going and didn't want to go down to an endgame just yet.",
        "30. g3": "Opening up the position, something I really do at my peril. But the game is being played at such a fast and furious rate I'm hoping there will be a few attacking chances.",
        "30... g5": "Black makes the psotion very complicated indeed, and I really needed to spend some time analysing it before going ahead.",
        "31. gxf4 g4 32. fxe5": "There are not many hiding places for the Kings now!",
        "32... Rxf3": "Black can't afford to take with the pawn as my capture of his Rook results in a check!",
        "33. Qxe6": "Now I'm banking on counterplay, with the Black King exposed.",
        "33... Re8 34. Qxd6": "I doubt very much Black will fancy a Queen exchange to allow those two pawns to link up, though it's probably hsi best bet. Instead he tries something speculative...",
        "34... Rh3+ 35. Kg1": "Only two squares for the King and clearly g2 is lethal after 35...Qxe4+",
        "35... Qxe4": "It looks pretty dangerous without the check.",
        "36. Qf6+": "But now I have the counterplay I want, and the game is very evenly balanced. Whoever blunders first might be the loser!",
        "36... Kh7 37. Qf7+ Kh6": "And oh, how I want to take the Rook. But mate on h1 awaits me if I do. I guess the game could have ended in a draw by repetition here. But I'm starting to fancy my chances!",
        "38. Qf6+ Qg6": "Maybe Black thinks I'm after the draw and tries this, which hands me a big advantage...",
        "39. Qf4+ Kg7": "Now there's little to stop my Rook getting to d7 via d1.",
        "40. Qd4": "Alas! I hand the initiative, and possibly the game, back to Black, by setting up this very obvious revealed check.",
        "40... Qe6": "Whichj Black stops right away. It's not even that dangerous: 40...Qf5 41.e6+ Qf6 42.Bc4 Qxd4 Black still holds the advantage.",
        "41. f4": "Ooooh but this is risky, even if I do get two passed pawns; that g-pawn is now looking hungry for Queening.",
        "41... g3": "Forward it goes. And curiously, this ought to have been the losing move for Black: 42.f5 Qb6 43.f6+ Kf8 44.Rf5 Qxd4+ 45.cxd4 Rxh4 46.Bxh5 is surely enough. But I just see that unguarded pawn on h5...",
        "42. Bxh5": "And think I have time to take it!",
        "42... Rh1+": "As soon as Black played this I knew I was sunk. But as I've said, it was a game played at breakneck speed and understandable that Black missed a mate.",
        "43. Kg2": "Obviously taking the Rook is suicide.",
        "43... Qh3+": "It's looking grim anyway.",
        "44. Kf3": "Now, 44...g2+ is deadly...",
        "44... Rxf1+": "But Black also just sees the material.",
        "45. Ke4": "My King is on the run, and it's surely only a matter of time?",
        "45... Qg2+": "45...Re1 brought mate closer, but I'm still sunk, I think.",
        "46. Kf5 Rf8+ 47. Kg5": "I thought I'd escaped here, and I've certainly escaped the checks for a move or sao.",
        "47... Rf1xf4 48. Qd7+": "Now it's my turn for a check or two, though Black still has, incredibly, a forced mate. But it's in 12 moves so I escaped.",
        "48... Kh8": "I expected Black to interpose a Rook on f7, but his King scurries away instead.",
        "49. Bg6": "Now I'm getting ready to deliver mate myself on h7. In my dreams... 49...Rxh4 50.Bf5 Qh1 51.Qd6 Rh5+ 52.Kf4 Rfxf5+ is the computer's continuation, ending in mate a few moves later. To my surprise, Black decides to liquidate the position...",
        "49... Rf4f5+ 50. Bxf5 Rxf5+ 51. Qxf5": "I don't know whether Black missed something here, but now I am right back in the game, though with that pawn sitting on g3 it's probably drawn?",
        "51... Qf2": "Yes, taking that Queen would be the answer to Black's prayers.",
        "52. Qc8+": "I'm looking for drawing chances now; surely I can keep that King pinned down with perpetual checks?",
        "52... Kg7 53. Qxb7+": "Actually, 53.h5 is more threatening; h6+ would be a difficult one for Black. But I'm focussed on keeping the Black King in check. And this square with my Queen covers g2.",
        "53... Kg8 54. e6": "Oh dear; 54.Qd5+ keeps the Black King on its toes, but suddenly I think I have winning chances (nope) and foolishly hand the initiative back to Black.",
        "54... g2": "Now that pawn really is dangerous, especially with my King on the g-file, something that might have been crucial.",
        "55. Qa8+": "I must keep the checks going now.",
        "55... Kh7 56. Qe4+ Kh8 57. Qa8+ Kh7": "I keep them going long enough for Black to offer the draw, which I gratefully accepted. Interesting to speculate about 58.Qb7+ Kg8 59.Qb8+ Qf8 60.Qxa7 g1=Q+ 61.Qxg1 Qg7+ 62.Kf5 Qxg1... but the game's pace meant that it went begging. A really wild one."
    },
    "url": "https://gameknot.com/annotation.pl/wild-ride-following-french-defence?gm=66509",
    "gameName": "Wild ride following French Defence?",
    "players": "captain_shannon (1751) vs. krenovac (1806)",
    "opening": "French defence (C00)"
}