{
    "moves": {
        "1. e4": "My second attempt at public annotation.  In this game I play black and get myself into a really exciting mexican standoff situation in which it becomes a very tense game where the first person to make a mistake will lose.  Thankfully I was not that person.\n\nThe bigger theme in this game is one of sacrifice.  The more I play, the more I realize that sometimes sacrifice can be a good thing.  I think it's important, however to have a goal in mind when sacrificing.  In this game, my goal was simple, but I think just having some rough idea of what I was going for gave me the confidence to play more aggressively.  I think in this instance my confidence was complimented by White's stubborness not to give anything up, so I was able to fortify my position because I was willing to accept a piece exchange when White was not.  This put white in a situation where he was constantly trying to defend and keep his pieces which eventually lost him the game.\n\nThis game is one of the first instances where I conciously noticed that there might be another way to win a chess game other than just attacking the King.",
        "1... e5 2. Nf3 Nc6": "The game starts out amiably enough with the amature version of the KP opening.. I'm not comftorable enough to play outside of the epine dorsal so early.",
        "3. d4": "My opponent, however, does not seem to have a problem with that and moves into the Scotch game.",
        "3... exd4": "What  I have read about this opening leaves me to believe that an agressive pxp is the best move.",
        "4. Nxd4": "As expected he takes back with his Kt.  I decided to try a new line that I saw not long ago by putting my Q into play which is something I don't usually like to do this early in the game.",
        "4... Qh4": "Here I have a chance to gain a pawn.. and if he takes my Kt, I can recover it with the same Qxe4 .\n\nI wasn't real sure what would happen here, I thought maybe he would bring his Q down to block the Kt, but I was willing to see what  happened.",
        "5. g3": "I believe that this was White's first mistake.  Not only does it do nothing to address the threat on  his e pawn and subsequent Check, it also opens up up a lane to his rook which I could easily take  now after putting him in check.",
        "5... Qxe4+": "So, do just that.",
        "6. Qe2": "This move actually surprised me.  Although I believe it was a solid and pretty well thought out move.\n\nNow my Q is pinned and if i don't protect it, he will just  take it with his Queen.\n\nI also notice that by moving his Queen, he left his Kt at d4 completly ungaurded.  If I could only secure my position in the center of the board then I might be able to attack his Kt and gain 3 more material points.",
        "6... Nf6": "The only sensible move I really have. as it  develops my Kt and serves to protect my Queen.\n\nI was thinking here of a game annotated by andydufrensne titled 'So, how do you win a \"won game\"?' in which he describes the process of being ahead by one pawn and deciding to trade all of the other peices off the board to essential clinch the \"already won game\".  \n\nI was willing to trade Queens if that's what he wanted and then try to figure out how to evenly trade off everything else as depicted in andy's game.  \n\n(andydufrensne's annotated games: http://gameknot.com/list_annotated.pl?u=andydufresne)",
        "7. Bg5": "At this point, white is not interested in trading Queens.  He still has me in a pretty tense situation because I can not move my Queen.  However, he is in the same situation.  I did contemplate initiating the trade myself, but I wasn't completely confident that I could have orchestrated the rest of the exchanges as elegantly as andy.  I would only go that route if he initiated the exchange first, the important aspect for me here is that I was *willing* to go through with it and had some sort of plan if that did in fact take place.\n\nIf White was thinking of a piece exchange, most likely he didn't have any idea why he would want to do after it happened.  I also think that by my not initiating the exchange he thought I was trying to avoid it also.  So there are two perspectives going on.  He is tryign to defend his pieces and he percieves that I am doing the same, but what I am doing is simply making sure that if we do trade that I will still come out  1 or more. \n\nThis does however give me the chance to take his Kt at d4 which would also attack his Queen.  again, my only advantage here is my one pawn.  The board position is pretty much equal as both of us can do nothing to relieve the pressure without trading equal pieces.\n\nAgain, my advantage here was probably that I was willing to make the trades and switch tactics and perhaps he was determined to find a way out that did not lose him material.\n\n",
        "7... Nxd4": "I take his Kt and he still has the option of ending this stand off by commiting suicide.  I'm not sure if there would be any advantage to him initiating the exchange, but I believe that White's flat out refusal to consider it is what lost him the game.\n\nI'm really starting to like this board because not only have I escalated the stand off, but I'm also threatening ...Ktc2 which would fork his King and Rk and since his Q is pinned he could do nothing about it.\n\nI'm still thinking about trading off all the piece to turn my pawn advantage into a win, so if I can get even farther up on him, then I will take that chance.",
        "8. Nc3": "This move was not too bad, but may be not very well thought out.  The good thing about this move is that it attacks my Q (nothing new there), but more importantly if I want to commence with my forking maneuvere then I will ultimatly lose my Q.\n\nI really like the board at this point because I'm not opposed to having a blood bath and trading a bunch of material and ending up  1 at the end of it all (just to see if I could do it and if it would work).\n\nAlso, at this point, that is white's best plan of action.  His queen is under attack by my kt. (although at this point I can't take it without losing my own Queen).  And White can't castle to get out of the situation because that will lead to an almost sure win.",
        "8... Bb4": "by moving my bishop here, I essentially am forcing White to start the exchange process or lose the game.  He can not move his Queen, so I will take it with my Kt  on my next move and he will not be able to take back because his Kt will be pinned.\n\nhe can not castle to release the Pin because  of more sinister plans...",
        "9. O-O-O": "I'm sure that White considered exchanging material, but just couldn't bring himself to do it and by trying to release the pin on  his Kt so that our Queens would be be equally threatened he actually gave me all the room I needed to move in for the kill.",
        "9... Nxe2+": "I love this move because I get the Queen and because of the new position of his King, he's now in check and is forced to either move his King or take my Kt.. Regardless, my Queen is now unpinned and I'll be able to escape (most likely to f1) where I've now gained a significant amount of material and if I'm not able to pull a win easily out of that position I will continue with my plan to trade peices off the board keeping my advantage.  \n\nHowever, at this point I would have to make some pretty big mistakes in order to lose.",
        "10. Nxe2": "He chooses to take back with his Kt.",
        "10... Qxh1": "I do, indeed capture h1.  If he continued  play at this  point, my next move  would have been to move my Kt to the center of the board if he didn't take it.. are and if he did take it I would capture h2 and start dismantling his pawn structure.\n\nIt's possible that with some careful planning on White's part I still could have made a mistake that would have given him some sort of help (maybe f1 was a misatake for all I know).\n\nBut we'll never know because White resigned at this point.\n\nI think the main thing that won me this game was my willingness to trade material with a purpose in mind.  Conversely, what probably lost him this game (especially towards the end), was his unwillingness to lost material, even for an equal trade. \n\nMaybe he saw my tactic of trying to keep a  1 and trade everything else off.. But even if he knew what I was up to, from my point of view he passed up his best moves (which involved trading) in favor of inferior moves that eventually lost him the game.\n\nFeel free to message me with any comments you have on this game, as I'm strictly amature and trying to explain my own thought process."
    },
    "url": "https://gameknot.com/annotation.pl/willingness-to-change-tactics-produces-a-fun-game?gm=3234",
    "gameName": "Willingness to change tactics produces a fun game.",
    "players": "speedracerx1 (1312) vs. fycorsia (1223)",
    "opening": "Scotch (C45), Pulling counter-attack"
}