{
    "moves": {
        "1. d4": "My opponent had white pieces and he started with d4.",
        "1... d5 2. c4": "After d5, c4 we have queen's gambit. ",
        "2... e5": "I decided to play something less common - e5, we now have queen's gambit declined, albin counter gambit, a very aggressive reply. Frankly speaking, this gambit is pretty risky for black, if white knows the right continuation, he could neutralize all the threats and have a very good game. ",
        "3. dxe5": "Challenge accepted! dxe5 was played. ",
        "3... d4": "d4, black's d pawn advances further into white's territory, it takes away the natural developing square from white's queen knight, it can be very troublesome for white.  ",
        "4. e3": "e3 appears to be a very sensible move, challenging black's strong d pawn. However, this move is a mistake, the best move would be Nf3, putting pressure on black's d pawn. ",
        "4... Bb4+": "Bb4+, Black now goes for the Lasker's trap line, only because white played e3 last move. ",
        "5. Bd2": "Bd2, again, it looks sensible, blocking the check and with the intention to trade off dark square bishops. ",
        "5... dxe3": "To white's surprise, dxe3, black totally ignores the tension between the dark square bishops. \n",
        "6. fxe3": "After some calculation, my opponent decided not to capture my bishop and barely managed to side step the Lasker's trap. ",
        "6... Qh4+": "Qh4+ was play, if white plays g3, then Qe4 would be played.",
        "7. g3": "White did play g3.",
        "7... Qe4": "Qe4, forking white's rook and pawn on e5.",
        "8. Qf3": "Qf3, white wants to exchange queens.",
        "8... Bxd2+": "The tension between the dsb was resolved.",
        "9. Nxd2 Qxe5": "Of course I did not trade queens, it would only help white.",
        "10. Qe4": "Qe4 white is quite persistent. ",
        "10... Nc6": "Nc6, developing the knight and protects the queen. ",
        "11. Qxe5+ Nxe5 12. Ngf3 Ng4": "After the smoke is clear, white is ahead in development, but the weak isolated e pawn quickly becomes a target for black. ",
        "13. Ke2": "I was expecting white to play e4, but Ke2 was played. This move indicates that white wants to centralize his king and play Bg2 at some point, so that he can have play on the queen side.  ",
        "13... Ne7": "h3 is definitely coming, but I wanted to add more pressure on his e pawn, then I saw this move Ne7.",
        "14. h3": "This was expected. ",
        "14... Nf5": "Nf5, totally ignores the threat of hxg4! The idea is, if white plays hxg4, black would play Nxg3+, forking white's king and rook, and black would eventually capture the pawn on g4 with Bxg4.  ",
        "15. hxg4": "White did play hxg4.",
        "15... Nxg3+": "Everything went according to plan.",
        "16. Kf2 Nxh1+ 17. Kg2 Bxg4 18. Kxh1": "I used two knights to trade for my opponent's rook and two pawns, most importantly, I now have three to one majority with two connected passed pawns on the king side. White would have a very tough game from now on.",
        "18... f6": "f6, stopping white's knight from coming to e5, also vacating f7 for the king.",
        "19. Bg2": "white finally gets his bishop developed. ",
        "19... h5 20. Nh4": "Nh4, discovered attack on black's b pawn, but this move is a mistake, white now leaves his knight on d2 unprotected, additionally, his knight on h4 is susceptible to g5. The best move for white would be Nd4.",
        "20... Rd8": "Rd8, exploiting the unprotected knight. This would not be possible If white played Nd4... ",
        "21. Nb3 g5": "g5, gaining more tempi. ",
        "22. Nf3 Rd3": "Rd3, attacking white's e pawn and x-rays the knight on f3. ",
        "23. Nfd4 Rxe3 24. Bxb7 O-O": "I decided to castle king side, so that my king can assist the pawn push, also i can double my rooks on e file. The downside of this move is that white now has some counter play.   ",
        "25. Bd5+": "and there it is....",
        "25... Kg7 26. Rf1 Rfe8": "Doubling the rooks, with the intention to Re1",
        "27. Nc5": "Nc5, white brings the other knight into the attack, black has to be very careful in this position. It is really tricky to look out for both knights!",
        "27... Re3e1": "Re1, I wanted to simplify the game. ",
        "28. Rxe1 Rxe1+ 29. Kg2 Rb1 30. Nde6+ Kh6": "Note that Kg6 and Kh7 would fall for Be4+, which would be a devastating blunder!  ",
        "31. b3 Rb2+": "Rb2+ forking white's king and a pawn. ",
        "32. Kg3": "Kg3, and this is a blunder, better move would be Kg1. ",
        "32... f5": "f5, threatening f6+! If white plays Nxc7, f6 would be checkmate. Additionally white's king can not go back because the rook is guarding the second rank! This is the reason that he should have played Kg1.",
        "33. Nxg5": "Out of desperation, Nxg5 was played. ",
        "33... Kxg5 34. Ne6+": "White wanted to get some counter play, but it was just not enough. ",
        "34... Kf6 35. Nd4 Rxa2 36. b4 Ke5 37. Nf3+ Bxf3": "After Nf3+ I simply snatched the knight with Bxf3, the position got simplified even more. ",
        "38. Bxf3": "\n",
        "38... Ra4": "\n",
        "39. Bxh5": "\n",
        "39... Rxb4 40. Bf7": " ",
        "40... f4+ 41. Kf3 Rb3+ 42. Kf2 a5": "My opponent played the best move after a5, he resigned. I hope you enjoyed this game, good luck with your games and see you next time. "
    },
    "url": "https://gameknot.com/annotation.pl/winning-with-the-albin-counter-gambit?gm=60690",
    "gameName": "Winning with the Albin counter gambit. ",
    "players": "NN  vs. superlalulalu ",
    "opening": "QGD (D08), Albin counter-gambit, Lasker trap"
}