{
    "moves": {
        "1. e4": "yawn",
        "1... e5": "i decided to go a bit more mainstream than usual",
        "2. Nf3 Nc6 3. Bc4": "really i couldn't be less exited in the opening",
        "3... Nf6 4. d3 Bc5 5. Be3 Bxe3 6. fxe3": "after that bishop exchange i was very afraid of white getting a very strong centre",
        "6... Ng4": "i did this to try and intimidate my opponent, to really try to make him scared",
        "7. Qd2 Ne7": "i send my knighton a trip across the board, a tall order when your opponent owns the centre  ",
        "8. Nc3 Ng6 9. O-O-O Nh4 10. Rhf1 O-O 11. g3 Nxf3 12. Rxf3 d6": "i made this move withb the aim of bg4 eventually winning a rook for a bishop",
        "13. h4 Nf6": "immediate reiterate ",
        "14. g4": "this move puzzled me it gives away a pawn even if my bishop wasn't there",
        "14... Bxg4": "sucsess",
        "15. Rdf1 Bxf3 16. Rxf3 c6 17. b3 d5": "chalanging the centre",
        "18. exd5 cxd5 19. Bb5 a6": "caught in a trap",
        "20. d4 axb5 21. Nxb5 e4 22. Rf5 Rxa2 23. Qc3 Qa5": "i deide on a queen exchange",
        "24. Qxa5 Rxa5 25. Nd6 Ra6 26. Nxb7": "carlessly giving away a pawn but i thought that it would be usless anway, i was a rook up",
        "26... Rc8 27. Nc5 g6": "hoping for the exchange",
        "28. Rf2 Ng4 29. Nxa6": "accepted ",
        "29... Nxf2 30. Nb4 h5": "follish move but i didn't care i was a rook up...for now",
        "31. Nxd5 g5": "the biggest blunder i did the entire game and coincidental the bluner that won me the game ",
        "32. Ne7+": "this move spelt my victory an eleven point blunder... but not in a bad sense ",
        "32... Kg7 33. Nxc8": "at this point i almost resigned, but i realised things wern't that bad and infact i had won",
        "33... gxh4 34. Nd6": "relising the king couldn't stop it he tried the knight but that was doomed from the start",
        "34... h3 35. Nf5+ Kg6 36. Ng3": "seems lost well actualy it doesn't its an obvious win for white",
        "36... h2 37. d5": "embarks on an unwinable race",
        "37... h4 38. Nh1": "miscalcutation. probably thought he had enough time to promote",
        "38... Nxh1 39. d6 Nf2 40. d7": "almost but no cigar",
        "40... h1=Q+": "my win. because i blundered of a rook i was up 11 points",
        "41. Kb2 Qd1": "he resigned"
    },
    "url": "https://gameknot.com/annotation.pl/winning-blunder?gm=28200",
    "gameName": "winning blunder",
    "players": "doccath (1111) vs. kamshaft (1123)",
    "opening": "Two knights defence (Modern bishop's opening) (C55)"
}