{
    "moves": {
        "1. e4": "I'm a e4 player :-)",
        "1... d5": "Tag1153 trade mark move.",
        "2. exd5": "I grab the pawn.",
        "2... Qxd5": "Black takes back the pawn.",
        "3. Nc3": "Develop with threat.",
        "3... Qa5": "With the idea of a retreat to d8 later.",
        "4. d4": "Grabbing the center",
        "4... c6": "Creating an escape route for the queen.",
        "5. Nf3": "Developing a piece and a move closer to castle kingside.",
        "5... Bg4": "Pinning the knight.",
        "6. h3": "\"Want to trade bishop for knight?\"",
        "6... Bxf3": "\"Sure!\"",
        "7. Qxf3": "\"Thank you very much!\" White now have the bishop pair. (Having the two bishops is usually considered worth 0.5 pawns).",
        "7... e6": "Opening a line for the black bishop.",
        "8. Bd3": "Developing a new piece and White is ready to castle.",
        "8... Nf6": "One step closer to castle kingside.",
        "9. Bd2": "Developing with tempo as it sets up a discovered attack on the black queen.",
        "9... Qd8": "Avoiding the discovered attack and retreats with tempo as it attacks d4.",
        "10. Qe3": "Protects d4. I was very seriously considering 10. Ne2 and 11. c4, which is what ChessMaster suggests. But I was afraid of locking out my queen... But thats just an phantom threat. At this point there is nothing that can threaten the queen.",
        "10... Bb4": "Starting a combination that I didn't see coming... I could have avoided it altogether had I chosen to play 10. Ne2.",
        "11. a3": "All I think is: \"Yeah he is trading his second bishop for my knight, sweet!\". This is a wasted move as Black wants to trade.",
        "11... Bxc3": "Chop!",
        "12. Bxc3": "I don't want to ruin my pawn structure with 12. bxc3 so I take with my bishop. This is what black wants... My message to tag1153 said \"You're trading away your second bishop for my knight?\"",
        "12... Nd5": "\"Yeah, so I can remove your two bishop advantage!\" Throwing me the fork that Black was planning all along! Nice combination tag1153!",
        "13. Qd2": "Moving away and as well as saving the pawn structure.",
        "13... Nxc3": "The advantage of the two bishops are gone...",
        "14. Qxc3": "And my queen has been all over the board... but she'll do plenty more running later, don't you worry. :-)",
        "14... Nd7": "Developing the last knight.",
        "15. Qd2": "I get the chance to change defender of the d4 pawn as I don't want my queen as the primary defender. I seriously regret not playing 10. Ne2",
        "15... Nf6": "Moving the knight to a good square with tempo as the queen attacks d4 yet again.",
        "16. c3": "The proper defender of d4. All queenside pawns are now on black squares, which is good as I have a white bishop.",
        "16... O-O": "Castle to safety.",
        "17. O-O": "Ditto.",
        "17... Re8": "Centralizing the rook.",
        "18. Rfe1": "I do as well.",
        "18... Qc7": "Connecting the rooks as well as lining up on the h2-b8 diagonal targeting the castled kings position.",
        "19. Qc2": "Forming a queen-bishop battery.",
        "19... h6": "Weakening the defense of the white squares, but freeing the knight from the defense of the h7-pawn.",
        "20. Qe2": "My thought at the time was to stop e5. ",
        "20... a6": "When played I didn't see the reason for this move. But it might make sense later.",
        "21. Bc2": "Preparing another battery with the queen up front.",
        "21... Rad8": "Nice centrally placed rook.",
        "22. Rad1": "I mimic black.",
        "22... c5": "Opening up the center. Now I see that 20...a6 might have been played to remove b5 from the bishop. ",
        "23. dxc5 Qxc5 24. Qf3": "Attacking b7, expecting it to move forward.",
        "24... Rxd1": "Simplifying the game.",
        "25. Rxd1": "But White gets the open d-file.",
        "25... b6": "Moving it out of harms way.",
        "26. Qd3": "Eying d8, h7 and threatening a6.",
        "26... a5": "Both queenside pawns are now on black squares, safe from the white bishop. I hope I have won something by forcing them up the board...",
        "27. Qd4": "White offer a trade of queens. If the queens are removed my rook is better than Blacks and as we have pawns on both sides on a open board the bishop is considered to have a slight edge over the knight.",
        "27... Qxd4": "Black accepts the offer and Whites queens running days are finally over ;-)",
        "28. Rxd4": "Both the queens are now off the board.",
        "28... Nd5": "Where it should be placed, centrally.",
        "29. Be4": "\"Go away!\" A key principle playing bishop vs. knight is to deny the knight any good central outposts. This move also put the bishop on the long white diagonal.",
        "29... Nf4": "\"I'll move...\". A bad move would have been 29... Rd8 which would loose to 30. c4",
        "30. Bf3": "\"You there! Move!\" Attacking the knight with the rook and removing squares e2 and h5 from the knight. ",
        "30... e5": "Forcing my rook to move as well as placing the pawn on a black square AND protecting the knight. Good move.",
        "31. Rc4": "Retreats to a square that still cover e4 as I don't want a pawn stab that forces by bishop off the long diagonal. I'm not afraid of a move like 31...b5. It will be met by 32. Rc5 forking two pawns.",
        "31... Nd3": "Repositioning the knight as well as forcing me to move the b-pawn. But the d-file was free. 31...Rd8 might have been better.",
        "32. b3": "32. b4 was also playable.",
        "32... Nc5": "A place to stay, but not an outpost. But at least it's on a black square. Attacking the b-pawn again.",
        "33. b4": "\"You are not welcome here! Go away!\"",
        "33... axb4": "Trading the pawns.",
        "34. axb4": "\"I said, you are not welcome!\"",
        "34... Nd3": "\"Sure, I'll move...\"",
        "35. Be4": "\"Shoooo!\" Stopping the advance of the e-pawn. And forcing the knight to move yet again.",
        "35... Nf4": "\"Can I stay here?\"",
        "36. Kh2": "I prepare to say \"No way!\" as I plan to play g3. This move takes my king farther away from the center, but at the time I thought it more important to remove the knight.",
        "36... g6": "Preparing for a f5 pawn push.",
        "37. g3": "\"I said go away!\"",
        "37... Ne2": "\"There will be no escape for you my friend! Muhahaha\" laughs the bishop. The pawns will cover the black escape squares (a5, c5, d4 and g4) and the bishop the white d3 square. Truthfully, the knight can escape, but it will take a lot of moves...",
        "38. Rc6": "More or less all the pawns are on the third row, so this is a good place for a rook. I plan to play 39. Bd3 Nc1 and then 40. Bc4 controlling the knight completely as well as pinning the f-pawn to the king.",
        "38... f5": "(??) A blunder that White fail to exploit. Better would have been 38...Rd8 seizing the open file. ",
        "39. Bd3": "I am so preoccupied with my own plans that I only \"see\" the lower left side of the board at this point. My only thoughts are to trap the knight. With this move I hope to force the knight to c1 and get out of trouble at the same time. It's not a bad move but I miss the first chance to win two pawns. Can you see how? You'll get the answer later so try to figure it out here...",
        "39... Nc1": "The only place to go if black doesn't want to sacrifice the knight. ChessMaster suggest 39...Nxc3, but I think that path is a bit to hard to play at our level.",
        "40. Bc4+": "(?) A bad move. All I could see was that the bishop now completely controlled the knight. White could have won at least two pawns with 40. Rxg6  and then 41. Bxf5.",
        "40... Kf8": "I think 40. Kg7 would have been better. What's white best move here? It's not the one I played...",
        "41. Bb5": "41. Rxg6 would have been a much better move. But I was afraid of 41...Rc8 with a skewer on the bishop and the pawn. But that's an imaginary threat as 42. Rg8  wins a the black rook. 41. Bb5 removes the imaginary skewer threat and insures at least winning one pawn for white. It's not as good as the two other opportunities, but better than nothing... It also \"wastes\" the previous move 40. Bc4 .",
        "41... Kf7": "Protecting the more important of the two pawns. If White is allowed to take the g-pawn the h- or f-pawn will fall as well. 41...Rb8? 42. Rxg6 h5 43. Rf6  Kg7 44. Rxf5 or 42...Kf7 34. Rxh6",
        "42. Rxb6": "Winning a pawn and creating two connected passed pawns that eventually will win me the game.",
        "42... Rc8": "Attacking the c-pawn.",
        "43. Rc6": "I'm offering to trade an active rook for a passive one, but I'm counting on my connected passed pawns...",
        "43... Rxc6": "Black takes the offer.",
        "44. Bxc6": "Taking back.",
        "44... Ke7": "Moving towards the passed pawns.",
        "45. Bd5": "Stopping Na2 and Nb3 and aiming to get back to c4.",
        "45... g5": "Black misses the chance to get his knight back in to the game. Better might have been 45...Nd3 46. Kg2 e4 creating an escape square for the knight.",
        "46. Bc4": "(!) White has won the game! The knight can go nowhere! Blacks king can't go outside the square formed by b4-b8-f4-f8 (also known as \"the square of the pawn\") as this would allow the pawn on b4 to queen. And the Black king can't touch the \"little fortress\" the bishop and the pawns have built. The White king  can force the trade of knight and bishop on d3*. Then he can pick up the passed d-pawn**. Afterwards he can calmly walk over and win the remaining kingside pawns as the b- and c-pawns protect themselves. (If Black takes the c-pawn, the b-pawn is unstoppable.)\n\n* At some point Black has to trade knight for bishop with ...e4 and ...Nd3, Bxd3, dxe3 otherwise White will get the knight for free with help of the king.\n\n(If you want you can use http://gameknot.com/chess.pl?bd=8409329 to play out the moves quoted below.)\n** The play I envisioned was 46...e4 47. Kg2 (moving to get inside the square of the soon passed d-pawn) 47...Nd3 48. Bxd3 exd3 49. Kf1 (White king is now inside the square) 49...Kd6 50. c4 (stopping the black king and winning). If Black plays 50...Ke5 White plays 51. b5 shrinking the square of the pawn preventing the Black king from safeguarding the passed d-pawn. \n\nFor an explanation of \"the square of the pawn\" see http://en.wikipedia.org/wiki/King_and_pawn_versus_king_endgame#Rule_of_the_square",
        "46... Kd6": "Moving towards the passed pawns.",
        "47. f3": "Stopping any thoughts of an immediate bishop-knight trade on d3 that would create a passed pawn. Allows black to create passed pawn on e4. At this point I want to trade away or lock up the kingside pawns and then walk down and force the bishop-knight trade.",
        "47... e4": "Creating a passed pawn.",
        "48. fxe4 fxe4": "Black has a passed pawn...",
        "49. Kg2": "... that the White king can catch.",
        "49... h5 50. Kf2": "White is going to play Ke3-Kd2 forcing a trade on d3 where White wins a knight and a pawn for a bishop. After that Black can't stop White from winning the kingside pawns and queening shortly after. Black resigns. Thanks tag1153 for a good game."
    },
    "url": "https://gameknot.com/annotation.pl/winning-the-bishop-vs-knight-endgame?gm=12101",
    "gameName": "Winning the bishop vs. knight endgame",
    "players": "claespiper (1650) vs. tag1153 (1496)",
    "opening": "Scandinavian defence, Lasker variation (B01)"
}