{
    "moves": {
        "1. d4": "My opponent (a much lower-graded player, whom I hoped to beat easily considering the ECF grades given above) opens with the queen pawn. Grabbing a stake in the centre, and opening up lines to develop the dark-squared bishop and later queen. Standard and theoretical stuff.",
        "1... d5": "A very common reply. Black also grabs his share of the centre, and makes it less attractive for White to play an immediate e2-e4 (which he would like to attempt at some point, to take more control of the centre).",
        "2. c4": "One of the most common openings in existence: the Queen's Gambit. White apparently sacrifices a pawn (in reality, most experts do not consider this a pawn sacrifice, because the pawn can easily be regained and theory offers no tried-and-tested way for Black to keep hold of the extra pawn). White's purpose in playing this move is to challenge Black's stake in the centre and build pressure against the d5-pawn.",
        "2... e6": "The reply which I always play against the Queen's Gambit - known simply as the Queen's Gambit Declined. A simple (yet highly theoretical) move, aimed at keeping a pawn in the centre (e.g. after the unusual but playable 3.cxd5 exd5). The obvious drawback being that Black's light-squared bishop is blocked in.",
        "3. Nc3": "The usual move in the Queen's Gambit Declined: White develops a piece, and increases the pressure against Black's pawn on d5. I have played this position many times, from both sides of the board. An interesting alternative is 3.Nf3.",
        "3... c5": "This opening for Black is called the Tarrasch. Black opts to occupy the centre with an unstable pawn structure, in exchange for long-term fast development and good spatial control. Note that it is not possible for White to win a pawn immediately, although it may initially appear so: in fact, 4.cxd5 exd5 5.dxc5? is a well-known equalising line for Black after 5...d4! 6.Ne4 Bxc5! 7.Nxc5 Qa5+ with the fork regaining the minor piece.",
        "4. e4": "? Clearly, my opponent did not know how to meet the Tarrasch - this move is an opening error! This move simply loses a pawn for White, as the following moves demonstrate:",
        "4... dxe4 5. Nxe4 Qxd4": "? I think that this was a mistake on my part - and the computer (Fritz 10) corroborates this judgement. I played this move in the hope that White would allow a queen exchange, which would help to consolidate Black's material advantage. However, 5...cxd4 is better, since it affords Black a space advantage and a firm grip on the centre as well as his material advantage. Black could then have followed up with ...Nc6 and ...e5, with a powerful grip on the central dark squares.",
        "6. Qc2": "! Avoiding a queen exchange, and placing the queen on a (slightly) more useful square.",
        "6... Nf6": "Developing a piece, and aimed at exchanging off White's strong central knight, thus robbing White of a useful piece. Piece exchanges, I decided, would be useful in consolidating my small but significant material advantage. In fact, this formed my strategy for the next few moves - so much so that I unfortunately sank into positional apathy and handed over the initiative to my opponent.",
        "7. Bd3": "Developing a piece, and preparing to replace the central knight with a well-placed central bishop, if the former is exchanged off.",
        "7... Nxe4": "Carrying out my strategy of exchanging pieces, whenever possible.",
        "8. Bxe4": "Despite being a pawn down, White now has an excellent position - his light-squared bishop holds Black's queenside in a bind, as well as putting pressure on Black's kingside. I therefore decided to force this bishop to move away as follows:",
        "8... f5": "?! An odd-looking move, leaving Black's e-pawn backward and weak. However, I was determined to dislodge White's light-squared bishop from its excellent post in the centre!",
        "9. Bf3": "The most useful square for White to place his bishop, retaining the unpleasant bind on Black's queenside. Black cannot play ...Bd7, because the b-pawn and then rook are hanging; Black also cannot play ...b6, because the pawn is pinned to the rook.",
        "9... Bd6": "Developing a piece to a good square, and preparing to castle.",
        "10. Ne2": "Developing a piece, and forcing Black's queen to give up the useful post in the centre.",
        "10... Qf6 11. O-O": "By now, Fritz 10 rates the position as approximately equal. If we take into consideration the fact that White is a pawn down, this means that the computer believes that White has enough compensation for the pawn. I agree with the computer - White's pieces are mostly developed to excellent, logical squares (whereas Black's queenside is in a bind and undeveloped, and Black's central pawns are weak).",
        "11... Nd7": "Struggling to catch up with White in the development race. I was unwilling to play 11...Nc6 because of 12.Bxc6 bxc6, giving Black horrible doubled and isolated c-pawns to worry about.",
        "12. Rd1": "Developing the rook to an excellent square, from where it controls the open d-file. White also gains a tempo in playing this move, since Black must do something about his undefended bishop on d6.",
        "12... Bc7 13. Rb1": "Preparing to expand on the queenside with b2-b4, after which White will enjoy a queenside space advantage and the power of his queenside rook will be increased.",
        "13... Ne5": "My strategy was still to exchange as many pieces as possible! I felt that removing White's light-squared bishop from the board would be an achievement, since this would allow Black to develop his queenside via ...Bd7, or ...b6 and ...Bb7.",
        "14. Qc3 Nxf3+ 15. Qxf3 O-O": "Black's position seems to make more logical sense than it did a few moves ago, with fewer undeveloped pieces hanging around. Also, Black retains his extra pawn! However, I still think White enjoys the better position, and White's next move grabs the initiative:",
        "16. b4 Qh4": "Trying to retake the initiative, with threats against the pawns on h2 and c4.",
        "17. Bf4": "Neatly parrying both threats, and making Black's dark-squared bishop less useful.",
        "17... Bxf4 18. Nxf4 cxb4 19. Rxb4": "The most striking difference between these two positions is the activity of the rooks and minor pieces. White's rooks and knight are all dominating the board, controlling a multitude of squares; by contrast, Black's rooks and bishop are all huddled on the back rank, controlling hardly any squares at all! I resolved to do something to sort this out immediately:",
        "19... Rb8": "Trying to wriggle out of the bind which White's queen imposes on Black's queenside.",
        "20. c5": "Taking advantage of Black's loss of time, and increasing White's space advantage on the queenside.",
        "20... Qe7": "Pinning the c-pawn, and thus preventing c5-c6, which could otherwise be an extremely annoying move for Black to face.",
        "21. Rc4 Bd7": "The bishop is starting to become more useful! Additionally, this move clamps down on the c6-square, preventing White's pawn from advancing any further.",
        "22. Re1": "White changes his plans - now he tries to put pressure on Black's backward, weak e-pawn and tie down Black's bishop and queen to defending it.",
        "22... Bc6": "Moving the bishop away from defending the weak e-pawn, but White cannot take advantage of this yet, because his queen is under attack. Furthermore, this moves Black's bishop to a very useful diagonal - pointing directly at White's kingside, where it will play a very important role later on.",
        "23. Qg3 Rf6": "I'm not sure exactly what I was trying to achieve with this move, other than simply defending the e-pawn.",
        "24. Nh5 Rbf8": "??! I didn't really want to play 24...Rff8, returning the rook and allowing a repetition of moves. Therefore, I impulsively (and stupidly?) allowed this exchange sacrifice (sacrifice of a rook for minor piece).",
        "25. Nxf6+ Rxf6 26. Qb8+": "A fork allowing White to pick up a pawn. However, I think that this is a mistake, since it leaves White's queen completely out of the game. Over the next few moves, Black is able to create all the activity and set tactical problems for White, largely because White's queen has become an irrelevance.",
        "26... Kf7 27. Qxa7": "Black now has a material disadvantage, so he is obliged to create activity in order to gain compensation. I achieved this by creating a series of threats, as follows:",
        "27... Rg6": "Firstly, a simple threat against White's kingside - namely, targeting the g-pawn.",
        "28. g3": "Parrying the threat, but weakening all the light squares on White's kingside.",
        "28... Qd7": "! Aimed at exploiting the weak light squares on White's kingside. The threat is ...Qd5 followed by ...Qg2# or ...Qh1#. My opponent sank into thought at this point.",
        "29. Rc3 Qd2": "If 29...Qd5 30.f3 seems to hold White's position together. Instead, I tried to create trouble by attacking White's rooks.",
        "30. Rce3": "If 30.Rcc1, 30...Qd5! reintroduces Black's threats against White's kingside light squares.",
        "30... f4": "! Preparing to break open White's kingside.",
        "31. Re3e5 fxg3 32. hxg3 Rxg3+": "Not really a rook sacrifice, since 33.fxg3?? Qg2#. White's kingside is broken open, and I felt sure that checkmate should follow.",
        "33. Kf1": "The only move: if 33.Kh2 Qxf2#.",
        "33... Bg2+": "? At this point, I missed a forced checkmate! 33...Qd3+! and checkmate follows in all lines, e.g. 34.R5e2 Rg1+!! 35.Kxg1 Qg6+",
        "34. Kg1 Bh3+": "Observe the fact that Black's pieces, for the first time, are all playing active roles in the game - they are all playing a part in Black's overwhelming attack! By contrast, White's queen is doing absolutely nothing on a7, and White's rooks aren't particularly useful either.",
        "35. Kh1 Qxf2": "I calculated that this led to a forced win as the text shows, by exchanging off most of the pieces on the board into a winning rook-and-pawn endgame. Shame I didn't find the forced checkmate to crown my rather nice attack, but such is life...an important skill, in chess as well as in life, is to know when to stop attacking, exchange off all the pieces, and convert the small advantage that you have gained in the attack.",
        "36. Qxb7+ Kf6 37. Re5e2 Bg2+": "! Forcing the exchange of all the pieces except one pair of rooks.",
        "38. Qxg2 Rxg2 39. Rxf2+ Rxf2 40. Rc1 Rxa2 41. c6 Ra8 42. c7 Rc8": "The rest is easy: Black walks his king over to d7, picks up White's last remaining pawn, and promotes one of his three pawns in an easily winning endgame.\n\nHope you enjoyed the annotation! Comments would be welcomed! :)"
    },
    "url": "https://gameknot.com/annotation.pl/winning-attack-after-a-difficult-game?gm=43304",
    "gameName": "Winning attack after a difficult game",
    "players": "E. S. (ECF 89) vs. fatcat2 (ECF 139)",
    "opening": "QGD (D32), Tarrasch defence"
}