{
    "moves": {
        "1. e4": "I annotated this game for some of my teammates, as I thought that there were a few notes worth pointing out.  Welcome any comments.",
        "1... e5 2. Nf3 d6 3. Nc3 Be6": "This move is an inaccuracy that allows me to make an early push for the center.",
        "4. d4 c6": "A mistake.  Now I can take the e pawn, force a queen trade, and take away his castle.  The big lesson to learn here is that you and your opponent can both screw up early in the game. Don't make automatic moves in the first few turns. Really study what your opponent is doing and see if you can take advantage. If you can (and it doesn't really cost you development), go on the offensive early.",
        "5. dxe5 dxe5 6. Qxd8+ Kxd8 7. Nxe5 Nh6": "I believe that Nf6 was the better move, but perhaps he didn't want the knight pin?  Normally I would prefer to keep my bishops in a game like this one, with an open, exposed king, but the chance to double up his pawns on the kingside is too tempting to pass up.",
        "8. Bxh6 gxh6 9. Bc4": "I made this move to allow a graceful exit for my knight, threatening Nxf7 to fork his king and rook, thus inviting him to exchange bishops.  However, he decided not to play the game my way, and I respect that.",
        "9... Rg8": "This move has some merit and was a decent response, but it still allows me to exchange bishops.",
        "10. Bxe6 fxe6": "After this move I had a few options, but felt that the best bet was to castle kingside and see if he would go for the doubled e pawns.  A queenside caste has some interesting implications, but I think that a kingside castle, due to his doubled pawns makes more sense long term.",
        "11. O-O Bg7 12. Rad1+": "Getting this rook posted on an open file was a no brainer.  I was hoping that he would go to c7 and he did.",
        "12... Kc7 13. f4": "To protect the knight and and hopefully open up the f file as well.",
        "13... Bxe5": "Rf8 would have made things a lot more interesting.  As it is, he manages to double up my e pawns, but opens his king up to check allowing me to eat his two h pawns, setting the stage for a crushing connected, passed-pawn advantage.",
        "14. fxe5 Nd7": "Not a mistake per se, as he really needed to get his knight in the game, but it does allow the pin and eating of his h pawns.",
        "15. Rf7 Rad8 16. Rxh7 Kc8 17. Rxh6 Nc5 18. Rxd8+ Rxd8 19. g4": "Now is the time to start marching down this passed pawns.  He could bring his rook down to eat my c and b pawns, but doing so will allow me to promote without true resistance.  If you have connected, passed pawns, march them down the field and make your opponent sweat.",
        "19... b5": "here he makes a play for the e pawn by trying to force out my knight.  I need to respond to this threat before continuing my march.",
        "20. a3 Rg8 21. h3 a5 22. b4 axb4 23. axb4 Na6 24. Na2 Rd8": "protecting my queenside is all done, but now he threatens some interesting things with his rook.  I have a decision to make, between advancing my g pawn and taking the e pawn.",
        "25. Rxe6": "This move is a mistake, as I should have continued the march of my g pawn.  Even with this mistake I would still be able to promote my g pawn, I would just have less total pieces left as a result.  \n\nThe best series of continuation is as follows:\n\n25.\tg5\tNc7\n26.\tRf6\tNe8\n27.\tRf8\tRd1+\n28.\tKg2\tKd8\n29.\tRf2\tNg7\n30.\th4\tKe7\n31.\tRf1\tRxf1\n32.\tKxf1\tNh5\n33.\tNc3\t",
        "25... Nc7": "A blunder, allowing me to take c6 and pin his knight.",
        "26. Rxc6 Rd4": "A better play is to put me in check with Rd1+, as it allows me the chance to make more errors in my play, giving shamusb a chance to get back closer to even.  However, Rd4 is a mistake as it will allow me to force a rook exchange, which shamusb can ill afford.  However, my response also has a hidden threat.",
        "27. Nc3": "This move is good, as it protects my e pawn, but also threatens to get his knight for free.  The only good response to this play is Rc4, forcing a rook exchange, however, I hoped that he wouldn't see my next move, and he did not.",
        "27... Kd8": "A mistake, and a critical one at this late stage in the game, but one that can and often is overlooked by newer chess players.  I have missed many opportunities such as this in previous games, which is one of the reasons I was able to see it here.",
        "28. Rxc7": "Herein lies the best teaching moment of this annotation.\n\nIf he takes the rook with his king, I can play Nxb5 and get his rook with a fork. These types of moves are often overlooked by junior players and my opponent gave me a \"nice move\" comment after this one. The game was already over at this point, but this move sealed the deal, as it were. \n\nTake a look at where pieces end up AFTER the captures are complete, and see if you can leverage a fork to regain parity. Often times people only look to see \"Oh, that knight is protected by my king\" and don't think any further. As my friend mythas once told me, dream a bit and see what would happen if a piece is no longer there, or a piece can be made to move a square. Engineer those moments and you will be a better chess player and catch people off guard. I hope this little teaching moment was useful.",
        "28... Rxb4 29. Rc5": "A blunder on my part.  I should have continued the push of my g pawn, as the potential fork is still in operation, but sometimes when we have an overwhelming advantage, we don't always make the best moves to finish the games out as quickly as possible.",
        "29... Rb2 30. Nxb5": "Another mistake, as Nd5 was much better, threatening the king.  One of the things that I need to work on is remembering that you don't always have to take the proffered piece right away.  Nd5 allows me two ways to eat his pawn and allows me to continue the assault on black's king.",
        "30... Rb3 31. cxb3": ""
    },
    "url": "https://gameknot.com/annotation.pl/winning-exchanges?gm=42421",
    "gameName": "Winning exchanges",
    "players": "evilgm (1582) vs. shamusb (1416)",
    "opening": "Philidor's defence (C41)"
}