{
    "moves": {
        "1. e4": "So I open conventionally",
        "1... b6": "Owen defence  (also known as the Queen's Fianchetto Defence or Greek Defense) http://en.wikipedia.org/wiki/Owen's_Defence",
        "2. d4": "The usual continuation",
        "2... Bb7": "He hits my e pawn",
        "3. Bd3": "I am hoping for the Matovinsky Gambit f5. I saw it first in the early 1970s, in an edition of the magazine Chess in the early 1960s, and a \"How good is your chess?\" column. In that it gave 3...f5 as the best move for black with continuations like 4. exf5! Bxg2 5. Qh5+ g6 6. fxg6 Bg7 7.gxh7+ Kf8 etc. However in an edition of British Chess Magazine later, I found out that 8.Nf3! leads to an advantage to white in all lines. Unfortunately my opponent didn't play that.",
        "3... Nf6": "Hitting my e pawn.",
        "4. f3": "This non-development move is weak. Qe2 is probably best",
        "4... e6": "he continues to develop",
        "5. Ne2": "And so do I",
        "5... c5": "He hits at the centre",
        "6. Be3": "Continuing my development, but probably c3 is stronger.",
        "6... Nc6": "He hits at the centre again.",
        "7. O-O": "I ignore it, but probably c3 is better.",
        "7... cxd4": "He takes",
        "8. Nxd4": "I take back. In some ways the position now looks a little like an open Sicilian now.",
        "8... Bc5": "He hits my knight",
        "9. c3": "I protect it. Now d5! puts a lot of pressure on the white centre, but fortunately he plays",
        "9... e5": "Hitting the knight",
        "10. Nf5": "Threatening Nxg7 check, so he exchanges",
        "10... Bxe3+": "Taking with check",
        "11. Nxe3": "I take back. He can now get rid of his weakness of a backward d pawn on a semi-open file with d5! which equalises, but he plays....",
        "11... O-O": "Castles",
        "12. Qc2": "And now of course, d5 is met by taking twice on d5 followed by Bxh7 check",
        "12... Rc8": "He threatens Nb4",
        "13. Rd1": "I decide taking control of the d file is more important than keeping my bishop.",
        "13... g6": "This weakens the dark squares round his king - as we shall see at the end. I think this is a mistake. Maybe Ne7 preparing d5 is better.",
        "14. Bf1": "So I emphasise my control of the d file. I also had dreams of playing g3 and Bh3 hitting d7 again.",
        "14... Qc7": "A fairly logical square to put his queen",
        "15. Na3": "Except it may be hit by Nb5",
        "15... Na5": "I'm not sure why he plays this, it has to go back again in couple of moves later.",
        "16. Nb5": "So I hit his queen",
        "16... Qc5": "He attacks my knight on e3",
        "17. Qf2": "as well as protecting it, I have to unpin it to maintain control of d5. I now threaten b4 forking his queen and knight",
        "17... Nc6": "So he retreats his knight. OK stop and tell me what you think white played now.",
        "18. Rd6": "This blocks his queen's retreat. There are now dangers of b4 and his queen has no squares to move to.",
        "18... Ne8": "So he hits my rook. I could here get a knight for two pawns with b4, but then his rook and queen have some activity. Better to keep him bottled up I thought.",
        "19. Rxd7": "So I took the pawn instead, hitting his bishop",
        "19... Ba6": "So Bishop moves. OK stop again and tell me what you think white will play",
        "20. Nxa7": "Is that what you would have played?",
        "20... Ra8": "This is another mistake, in a difficult position",
        "21. Rd5": "So I hit his queen. Rather than play Qe7 22. Nxc6 and be a knight and two pawns down, he gives up queen for rook and knight now.",
        "21... Rxa7": "So he takes the knight",
        "22. Rxc5": "I take the queen",
        "22... bxc5": "He takes back",
        "23. Nd5": "I hit c5",
        "23... Bxf1": "He takes the bishop",
        "24. Qxc5": "I take the pawn, hitting his knight",
        "24... Ra6": "He protects his knight",
        "25. Kxf1": "I take with the king, maintaining the protection of a2 with my rook. I am threatening Qb5 forking knight and rook, so he makes a desperate attempt to get his Ne8 and Rf8 into play.",
        "25... Ng7": "Ok stop and tell my white's best move.",
        "26. Nf6+": "Of course. Did you find it? It is mate next move. Many thanks for reading this, please leave a comment or two and rate the annotation with the start system. Until next time, dear reader!"
    },
    "url": "https://gameknot.com/annotation.pl/wirral-league-away-to-buckley-mold-1?gm=46709",
    "gameName": "Wirral League, away to Buckley/Mold 1",
    "players": "Charles Higgie (BCF162) vs. Dave Pearcey (BCF138)",
    "opening": "Guatemala defence (B00)"
}