{
    "moves": {
        "1. d4": "This was an ashameful loss. It was a tough work time for me. Some lines saved from the analysis engine may be found interesting. I'd like to have a better way to show them than copypaste GK algebraic annotation... I hope some beginner will find something useful in my mistakes. ",
        "1... Nf6 2. Bf4 d5 3. Nf3 e6 4. e3 a6 5. Nbd2 c5 6. c3 Nc6 7. Qc2 b5 8. a3 Bb7 9. h3 Be7 10. Be2 Rc8 11. dxc5 Bxc5 12. Nb3 Bd6 13. Bg5 O-O 14. Nbd2": "? Changing plans is normally bad. Anyway. ",
        "14... Na5 15. e4 dxe4": "I preferred to avoid this line: \n\n15.\te3-e4\td5-e4\n16.\tf3-h4\th7-h6\n17.\tg5-f6\td8-f6\n18.\td2-e4\tf6-h4\n19.\te4-d6\tb7-g2\n20.\th1-g1\tg2-h3\n21.\td6-c8\tf8-c8\n22.\te1-c1\t",
        "16. Bxf6": "So I played this. ",
        "16... Qxf6 17. Nxe4 Bxe4 18. Qxe4": "It seems a good position for white... or it is not?",
        "18... Nb3 19. Rd1 Bb8": "Now, the logical move was Bd3, but I thought it was too \"naive\". I wanted to move the rook on d7 before. But not just now, without the other supporting it. Castilng would have been very interesting. Or g4.   But I choosed the wrong path. ",
        "20. h4 h6 21. Qb4": "?? The attacking blunder that throws away the game. The bishop has to go to d3 before than the knight covers this square. Even if it is not a mating threat, it is pressure. You must increase pressure. rejecting this knight from here is no pressure. I was pondering if to play against the queenside pawns, instead, since I didn't see clearly the winning attack on the kingside. But this was bad strategy, since my attack should be winning, if quick and precise. \n\n",
        "21... Nc5 22. g4": "Too late to be effective. ",
        "22... Ba7": "I found an interesting sac for white pieces. \n\n23.\tg4-g5\tf6-f5\n24.\tb4-d4\tf8-d8\n25.\td4-d8+\tc8-d8\n26.\td1-d8+\tg8-h7\n27.\tg5-g6+\tf5-g6\n28.\tf3-g5+\th6-g5\n29.\th4-g5+\tg6-h6\n",
        "23. g5 hxg5 24. hxg5 Qg6 25. Qh4 f6": "26.\tb2-b4\tf6-g5\n27.\tf3-g5\tg6-h6\n28.\te2-h5\tf8-f2\n29.\th5-f7+\tg8-f8\n30.\tg5-e6+\tf8-f7\n31.\th4-f2+\th6-f6\n32.\te6-g5+\tf7-g6\n33.\tf2-c2+\tg6-g5\n34.\td1-d5+\tg5-g4\n35.\tc2-e2+\tg4-g3\n36.\th1-g1+\tg3-h3\n37.\td5-h5+\tf6-h4+\n38.\th5-h4+\th3-h4\n\n\n26.\tb2-b4\tf6-g5\n27.\th4-h8+\tg8-f7\n28.\tf3-e5+\tf7-f6\n29.\th8-f8+\tf6-e5\n30.\tf8-c8\tg6-e4\n31.\tc8-c7+\te5-f6\n32.\tb4-c5\te4-h1+\n33.\te1-d2\th1-d5+\n34.\td2-c1\td5-c5\n35.\tc7-d8+\tf6-e5\n36.\td8-g5+\te5-e4\n37.\tf2-f3#\t\nCHECKMATE",
        "26. b4": "?? Again, it was not necessary to weaken like this. I wanted to make vulnerable the e6 pawn, but I made wrong calculations. ",
        "26... Ne4 27. Rh2 Bxf2+": "That rids me off of two very annoying pieces for a rook. Can it be a bargain?",
        "28. Rxf2 Nxf2 29. Kxf2": "Sure that my position looks frightening, now. ",
        "29... fxg5 30. Qg4": "Two minor pieces for a rook, but -1 due to black uncordinated pawns... who can say which has the edge?",
        "30... Rf4": "31.\te2-d3\tg6-d3\n32.\tg4-e6+\tg8-h8\n33.\td1-h1+\td3-h7\n34.\te6-c8+\tf4-f8\n35.\tc8-f8#\t",
        "31. Qg3": "I realize I am in very great danger of a horrible death. Only QxR prevents black to crush me with g4.",
        "31... Rcf8": "Now he can play it. ",
        "32. Kg1": "Surprise resource? A \"zen\" defence is often the best. ",
        "32... g4 33. Nd2": "I needed to control e4, so Nh2 was not good. A pity I block my rook's action, but... step by step!",
        "33... Qc2 34. Qe3": "Zen. Be calm. Let the storm pass over you :-)))",
        "34... Qg6 35. Bd3": "Manouvering so to make my pieces useful. It came black had the edge, due to my weak king. I think I am slowly improving. ",
        "35... Qh5 36. Qxe6+": "The passive Qg3 fails. I have to take my chances. ",
        "36... Kh8 37. Rf1": "Or Bg6. I thought that exchanging the rooks would have facilitaded my taks stopping the pawn and the mate. ",
        "37... Rf4xf1+ 38. Nxf1 g3": "? ",
        "39. Nxg3 Qd1+ 40. Bf1": "Maybe this was the black's idea in the first place. But I doubt this is an improvement over the last comment's position. I do threat some perpetual, but now, being +1, I am thinking again in victory!",
        "40... Qf3 41. Qh3+ Kg8": "Now, Bg2 was definitory. If Qxc3, or Qd1+, Kh2, and black has to stop Bd5+. ",
        "42. Ne2": "?? A blunder from my part, I didn't see the check in f2 that deprives me from the chance to survive. I had other choices, like checking in e6 or Bg2. ",
        "42... Qf2+ 43. Kh1 Qxf1+ 44. Qxf1 Rxf1+": "Nothing can reasonabily be done. ",
        "45. Kg2 Ra1 46. Kf3 Rxa3 47. Ke4 Kf7 48. Kd3 Ra1 49. Ke4 Re1 50. Kd3 Rxe2 51. Kxe2 Ke6 52. Kd3 Kd5": ""
    },
    "url": "https://gameknot.com/annotation.pl/with-some-little-blunders-yourly?gm=49737",
    "gameName": "With some little blunders, yourly...",
    "players": "damalfi (1784) vs. cheeky_knight (1697)",
    "opening": "Queen's pawn game (A45)"
}