{
    "moves": {
        "1. e4 a6": "Unusual!  The sort of move played by my young grandson but I didn't let that put me off.  There are lots of sensible follow-ups...",
        "2. d4 e6 3. Nf3 b5": "Black's moves conspire to hem my lsb in before it's even peeped out of the vestry.",
        "4. Bd3 Bb7 5. Bg5": "I reasoned that my Nb1 would probably get harassed if it moved to c3, so I planned moving it to d2 but didn't want to hem in my dsb.  This B has nothing much to bite on yet as the attack on the Q is easily foiled but would pin a N blocking the attack on the Q and could swap with a B doing the same.  If Black blocked with ...f6, that would weaken his kingside.  If Black left the B alone, it would be nicely placed.",
        "5... Ne7 6. Nbd2 h6 7. Bh4 d6 8. Qe2": "Hoping to open lines towards Black's K and in the meantime keeping my castling options flexible.",
        "8... Qd7": "Black unpins his N at the cost of depriving his Nb8 of its safest square.",
        "9. O-O": "Memories of my first game of the season (my last annotation) persuaded me against castling long.",
        "9... f5": "This seemed an intemperate response with his K still stuck in the centre.  I think he was looking to trap my dsb.",
        "10. exf5 exf5 11. Rfe1": "! The battery on the e-file dominates the game for the next 10 moves.",
        "11... g5 12. Bxg5": "I didn't have much choice here but saw it as an opportunity to develop an attack on his K",
        "12... hxg5 13. Nxg5 Nbc6": "Black prepares to castle long but ...",
        "14. Ne6": "!  This N virtually seals Black's fate as he cannot castle now without budging it, which is very difficult...",
        "14... Nb4": "I hadn't expected that but it wasn't very frightening.  I saw another opportunity to open a file for a rook.",
        "15. Nf3 Nxd3": "Black has just played 3 consecutive moves to swap this N off and open a file for my other rook.",
        "16. cxd3": "I wasn't worried about doubling my extra pawns in view of the advantages that outweighed this minor (in this position) disadvantage .",
        "16... Kf7 17. Rac1": "This prevents ...Qc6, attacking g2 through my Nf3, and attacks c7, virtually forcing Black's reply.",
        "17... Rc8 18. Nfg5+": "Thanks to the previous move, this N can safely join the attack.",
        "18... Kf6 19. Nxf8": "It may seem odd to swap off this dominant N for a B that hasn't moved but I needed to operate on the Black squares to make progress and I had another N ready to land on e6.",
        "19... Rcxf8 20. Ne6": "Only after I played this did I spot that Black could try 20. .. Rfg8!?, attacking g2 while leaving the other rook to dominate the h-file, which I was hoping eventually to use for my Q.",
        "20... Rfc8": "Inwardly I breathed a sigh of relief to know that I didn't have to worry seriously about defence after all.",
        "21. Qe3": "! I loved this move and for the first time my opponent really sank into thought.  Up to now, I had used about 10 minutes more than him.  Over the next few moves I developed a handy cushion.  What I loved about it was that it was a logical progression from my previous play while being far from obvious and, at first sight, like so many small Q moves, seemingly innocuous.  The more I looked into it, the better it seemed - a sort of puzzle reset move.",
        "21... Rhg8": "Black obliges ..",
        "22. Qh6+ Ng6 23. Nf4": "This really drove Black to distraction ...",
        "23... Be4": "In his desperation to block the e-file, Black gives up a piece to leave me two clear pawns ahead, with a crushing attack developing.",
        "24. dxe4": "Thanks very much!",
        "24... Kf7 25. Nh5": "The attack proceeds without checks, causing Black to ponder ever deeper.",
        "25... Ne7 26. Qf6+": "Only my third check of the game but I'm totally dominating.",
        "26... Ke8 27. exf5": "The N is pinned yet again.",
        "27... Kd8": "and still...",
        "28. Qf7 Qxf5": "With only half a minute left, Black cracks completely.",
        "29. Qxe7#": "Very satisfying :-)"
    },
    "url": "https://gameknot.com/annotation.pl/witney-2-v-didcot-1-fws?gm=35174",
    "gameName": "Witney 2 v Didcot 1 (FWS)",
    "players": "Bob Jacobs (1752) vs. Richard Weston (1664)",
    "opening": "St. George (Baker) defence (B00)"
}