{
    "moves": {
        "1. d4 d5 2. Bf4 e6 3. e3": "This is the mainline of the London System from both sides.  In other words, that's how it starts.  ",
        "3... Bd6": "I was surprised to see the computer play this.  But, I should not be.  For one thing, it develops.  But, more importantly, it brings a threat to the b2 square, as we'll see later on.  That's because Susan mentioned that it's generally a mistake to take there because there are variations, then after, that would trap the Queen.  I attempted a different variation but failed due to this move.  That's because those variations involve white's DSB.  By exchanging it, that doesn't work out which I didn't realize.  Knowing, however, that the B was included, I asked myself what could be done to avoid this exchange since I'd want to use it later on.  The answer is nothing, as either I take or the opponents takes it so that they both come off the board.  Try anything fancy, though, and I'll wind up losing that B, without compensation which I don't want to allow.",
        "4. Bxd6 cxd6 5. Nf3": "So, I start developing here.",
        "5... Qb6": "He's coming after my pawn.  Which I am more then happy to give away but should not be.  Knowing what I was taught, I figured that if he captured on that square, there would be a way for me to capture the Queen.  But, without my DSB, it's not going to work out.",
        "6. Nc3 Qxb2 7. Na4": "That's because Susan recommended a3 right after.  But, the issue was Nc3.  So, I explored a different option which she also mentioned by kicking the Queen.  The thing, however, is that I'm not going to be able to trap it, no matter how hard I try.",
        "7... Qa3 8. Bb5+": "Thinking that I might still have a chance to get it, I place black in check.  It's similar to hope chess, as I'm hoping that my opponent won't see the threat.  Which would allow Rb1-b3, trapping the Queen, if my LSB is still around which is another method that she uses.",
        "8... Bd7": "As anticipated, but with that, it's also not going to work.  I still figured that there might be a chance and play 9.Rb1, hoping that black won't exchange which does happen.  In fact, that was the wrong way to think because, in the process, not only doesn't white get the Queen, but now, I'm going to lose a piece on top of the pawn.  And, it'll be without compensation.  However, I'm still gonna try to trap the Queen, at any cost by going from passive to aggressive.",
        "9. Rb1 Bxb5 10. Rxb5 Qxa4 11. Qd3": "As now, the Rook is protected.  And, as noted, I'm not done attempting to trap blacks Queen, yet.",
        "11... b6": "I'm not sure why black played this.",
        "12. a3": "But, this is also an attempt to capture black's Queen.  My plan is here so that if Rb4, life becomes difficult because my Rook would now be protect by my a pawn.",
        "12... Nc6": "But, black answers with this to prevent that move since my R cannot land on b4, afterall.",
        "13. O-O": "Therefore, without anything to lose, I castle, at once.",
        "13... Nf6": "And, black continues with his development with the same purpose.  ",
        "14. Nd2": "So, I, once again, attempt to capture the Queen, starting with this move.  And, once black castles, I play my next move to continue with the plan.",
        "14... O-O 15. Nb1 Ne4": "Trying to stop deflect my plan.  So, I attack the N to continue.  For once black retreats, I attack, at once, figuring that the Queen will become trapped.  I know that black doesn't have a lot of options but figured that he'd defend with 17...Qa6.",
        "16. f3 Nf6 17. Nc3 Qa6 18. Rd1": "So, I intend to do something else like capture a pawn or piece with this move.  I do have a plan that black stops with his next move. ",
        "18... Rac8 19. a4": "Now's the time where I attempt to get a passed pawn by advancing it.  I'm thinking a few steps like exchanging and then trying to promote, or something similar, still trying to take advantage of the fact that black captured on b2.",
        "19... Qb7": "Once this was played, however, that's when I realized that I could not follow up on the plan in any shape or form.  Instead, I won't be able to compensate for lost material.",
        "20. Rdb1": "So, I do the next best thing by doubling up since it's known to play a powerful.",
        "20... Qc7": "Preventing any nonsense, black brings his Queen behind the Rook.",
        "21. e4": "Going for an exchange, as it appears to win back a pawn.  But, black stops that with his next move.",
        "21... Nxd4 22. Rb5b4": "? Thinking that I still might have some compensation, I attack the N.  But, it doesn't work out.  In fact, it's another mistake as I'm gonna lose, yet, the equivalent to another pawn.",
        "22... Nxf3+ 23. Qxf3 Qxc3 24. Qxc3 Rxc3 25. Rb1b2": "And, I'm almost ready to resign, but I try one other thing figuring since my c2 cannot be touched.  But, I miss something else that's coming.",
        "25... Rfc8": "As he attacks again.",
        "26. Rb4b5": "And, I defend again.  After which black is going to win another pawn on e4.  Once this happens, I resign by exiting out because this is where I felt that there was nothing else to fight for, and therefore, nothing else to learn.  Still, I'm glad I have this program and got to try something different based on a course that I took.",
        "26... Nxe4": ""
    },
    "url": "https://gameknot.com/annotation.pl/wizard-chess-london-system-training?gm=61778",
    "gameName": "Wizard Chess-London System Training",
    "players": "Joe (1324) vs. Computer ",
    "opening": "Queen's pawn, Mason variation (D00)"
}