{
    "moves": {
        "1. e4": "As Usual.",
        "1... Nc6": "Not surprised that he played this.",
        "2. Nf3": "On a normal basis, I would've played the Ruy Lopez.  But, although this is not against a person, it is on the hardest level, so it's as though I'm playing against a 2200+ rated player.  So, I avoid the Ruy Lopez, at once.",
        "2... d5": "I have no idea why he wants to exchange here.",
        "3. exd5": "But, I accept because the idea is that when you're up against a stronger opponent, you want to exchange often, as I learned from Jack Stockel.  The idea is that the opponent is familiar with all the variations and what to do with his pieces and pawns, so as long as it's level, by exchanging, you take him or her out of the comfort, which often results in a better game.",
        "3... Qxd5 4. Nc3": "But, exchanging, in this position, meant bringing the Q out early.  It was an occasion where the general opening guidelines in order to prevent the loss of a pawn, but I'm still going to spend the time to develop.  And, worth noting that stronger players can deviate from the principles, but the ones that aren't should not deviate, whatsoever, as per what I learned from the Master Mater.",
        "4... Qe6+": "Doesn't make much difference because of this move.",
        "5. Qe2": "There are two reasons why I get out of check with my Q.  The first is to keep castling rights, which I will castle in a few moves.  Second, but more importantly, as I could've also 5.Be2 which also allows castling is that I wanted to exchange Q's which will happen, for the reason outlined earlier.  That is, it's basically the equivalent to playing against a much stronger player.  ",
        "5... Bd7": "To add a defender onto the b file since the N is not pinned.  But, I'm still going to exchange, one way or another.  However, with this move, black will not wind up with doubled pawns in the center, when all is said and done.",
        "6. Qxe6 Bxe6 7. Bb5": "And, now that we exchanged, I waste no time in pinning the N since I view it as very dangerous.  As I learned from Jack, N's in a position like this can cause problems, and I blundered against him and a different opponent during a team game by letting the N become too dangerous.  So, this is a way to prevent that from happening.",
        "7... Bd7": "The best way to break the pin.  But, now, I can castle which was also part of my plan.",
        "8. O-O O-O-O": "So does the computer.  This is a little better because castling on the other side would require the other pieces to come out, so the K safe sooner.",
        "9. d4": "This is a center which develops, and the other idea is to bring out my remaining piece so that I can connect both rooks, and even, double up, as I've been studying.",
        "9... f6": "Unlike before, I have no idea why black played this.  But, for this game after how complicated it gets, I don't view any of black's moves as pointless because some of them become more dangerous then it appears.",
        "10. Be3": "At last, my final piece is out.",
        "10... Bf5": "The idea is to win my c pawn.",
        "11. Rac1": "But, after what happened in past games, I don't allow it.",
        "11... e6": "The idea is to get more pieces out because as noted, this is a center pawn and is black is preparing to bring the DSB into play.",
        "12. Rfd1": "Meanwhile, I'm already coming up with plans.  Since the pieces are already developed, I finally complete center control with this move.  And, now my goal is to double up which is bound to happen.  I've studied past games, and they often double up by bringing one R to one side, before moving on a different rank.  And, right behind, on the same rank, they put the other R behind it, which will happen in a little while.",
        "12... Nb4": "Normally, I'd have no idea why black would move the same piece twice when nothing's in danger, and the time could've been used to develop the other N or DSB.  But, I do know what's going on because of past mistakes, I've made, as noted earlier.  This move makes the N more dangerous.  And, the goal is to win a pawn.  In this case, the c2 pawn because it's becoming coordinated with LSB so that after, say ...Bxc2, if I respond with RXB, black would play ...NXR, not only winning a pawn, but then a R for a N.  However, I see black's plan.",
        "13. Rd2": "And, I will not allow it.",
        "13... Ne7": "Developing the other N.  It is a little crammed, I admit since confined near the homesquare so it's a little tight and uncomfortable, but black does not have a lot of choices.  The only other choice would be placing it on the rim, but then I would take it with 14.Bxh6, and when 14...PXN, he has doubled away from the center.  I think it has a name is called wing pawns, unless I'm mixed up.  But, they're doubled on the edge, which is said to give black a disadvantage.  So, for now, this was the best place for the other N to come into play.  ",
        "14. a3": "However, I'm still going to gain time.  The idea is that after the retreat, it'll take longer for black to bring the remaining piece into play.",
        "14... Nbd5": "And, now, I delay black's development even more by forcing another exchange with the same idea, as noted earlier.",
        "15. Nxd5 Nxd5 16. c4": "Still gaining tempii so that black will have to take even longer to develop.",
        "16... Nxe3": "Instead of it being forced, black gladly accepts the exchange.",
        "17. fxe3 c6": "I would've brought my remaining piece into play.  But, this is very understandable.",
        "18. Ba4": "Most common response, anyway.  But, even if not, it's indirectly forced to avoid losing a piece for a pawn.",
        "18... g5": "I don't know why black played this.",
        "19. Rf2": "I also could've doubled up.  However, the decision was to add a defender near the K since the f pawn, near is gone.  So, the idea behind was K safety, to prevent the risk that it'll become exposed.",
        "19... Bh6": "Bringing the remaining piece into play, and thus, completing development.",
        "20. Bc2": "The idea now is to, like before, exchange.",
        "20... Bxc2": "Like before, black accepts.  Plus, when all is said, I will have doubled up, in the process.  Believe it or not, this is what you typically see from GM's.  So, in this game, at least for this part, I was thinking like a grandmaster.",
        "21. Rfxc2 g4": "However, I overlooked something very important.  First, why did black this?  Well, as we know, moves aren't played just for a thrill of attacking something.  As it turns out, when I retreat, black is going to win two pawns, as we're about to see.  So, this was an important tactical motif that I missed.  On the hardest, it's a mistake because against someone this strong, losing a pawn is, especially, very dangerous.  In addition, even if the N were not attacked 22.e4?? would be a blunder, as the e pawn is pinned to the R, so I'd lose a R for a pawn.",
        "22. Nd2 Bxe3+ 23. Kf1": "Also possible was 23.Kh1, but it looks like mate in a few moves, if I do that.  He has those dangerous R's which is something to watch out for.  Normally, it's not a big deal as it won't generally mate, but against much stronger players, this is very important.",
        "23... Rxd4": "However, this is the second pawn, that I was alluding to, on black's 21st move.",
        "24. Ke2": "Since black already has a noticeable advantage and nothing's being threatened, now is the time to become aggressive.  So, the idea isn't an attack, but to put pressure not just on the B, but indirectly on the d R, and directly in the center, since that's where I'm attacking.",
        "24... Bf4": "Not only protecting the B but trying to get my h pawn, in the process.  And, it is very difficult to defend it, in this position, even though it looks very easy.  The tactical motif is even more, then I thought.  You'd think, well I can reattack with my g pawn, but then, black would win my N, either with the B or d R, which I am not going to allow.",
        "25. Nb3": "Therefore, this is the only alternative.",
        "25... Re4+": "However, black goes to plan B which, as we're about to see is very dangerous, as well.  ",
        "26. Kf2": "?? I also considered 26.Kd3, with the idea of an exchange.  And, I would've done it earlier, but now, I will not as that becomes liquidation of pieces when down.  Meaning: I'm ok with pawns, but I will not exchange when behind, unless I get something which is not the case here.  With that, it's safe to infer that this was black's plan.  However, this was a blunder, and that exchange had to occur, as this move loses a R for a B.",
        "26... Be3+": "This is how.",
        "27. Kf1": "Also possible were 27.Kg3 or 27.Ke2, but I would not like the checks that follow after.  That's because after studying various games, that would result mate.  Well, not right away but sooner, especially if black were to organize the h R, which would be, perhaps, the main risk.  So, I was not going to allow that.",
        "27... Bxc1 28. Rxc1": "Also possible was 28.Nxc1, but I wanted to prevent the same thing, as now the risk, while not immediate, is ...Rd4, and if he were to double up with ...Rd8 and then the worst would be ...Rd1! which would lose a R.  That's the perfect example of where two R's on one file is extremely dangerous.  So, this move, stops black from the bringing a R onto the first rank, even if black were to double up.",
        "28... Rd8": "Black still wants to double, but with what I noted, it won't be as effective.  So, now, I believe that I made the right choice.",
        "29. Nc5": "Since I'm in bad shape, the idea is putting pressure on the b file, with the idea that I could soon get the R more mobile, which of course, won't happen.  But, anything is worth a try since nothing's being threatened and am still at a disadvantage.  As we know, I maintain confidence, especially when in a situation like this.  In fact, that is so important that I emphasize it in my club.",
        "29... Re5": "!! However, black sees this and goes right after the N.  But, as it turns out, as we'll see later on, this move wins the N no matter where I move it, which is why I gave it two exclamation points.  ",
        "30. Nb3": "However, I did not know that the N, at the time.  Therefore, I now start thinking defensively because, all I know, at this point is that the N is being threatened.  So, I thought it could be protected.",
        "30... Rd3": "Same thing as what we saw on the last move.  But, I now start realizing what's going on, and realize that at best, I'd be forced to exchange my remaining, if I am to avoid losing a free N.",
        "31. Rc3": "Therefore, I get the R out, and he black gladly exchanges to exploit my weaknesses.",
        "31... Rxc3 32. bxc3 Re3": "What I realize, however, is that the c pawn is gone, in addition to, what I've already lost.",
        "33. h3": "However, I don't mind exchanging pawns because the idea is that it's ok to exchange pawns when behind, but that it isn't good to exchange pieces.  And, the reason behind this move was counterplay with a pawn chain, as that is how I pulled a swindle in a past game against Jack.  However, that's not going to happen here, and it is an exception where exchanging pawns is a bad idea.",
        "33... gxh3 34. gxh3 Rxh3 35. Na5": "Knowing that he's going to get the h pawn, I might as well play anything.  So, I go back to square one by putting pressure on the b pawn.",
        "35... Rxc3 36. a4": "Seeing that my a pawn is not danger, I waste no time.  So, I advance for protection.  However, what I overlooked is how many squares my N would have.  And, the answer is none because, as it turns out, this move traps the N.  So, it is now lost, no matter where it goes.  But, this is not a mistake, as no matter what else I would've played, the N could not be protected, anyway.",
        "36... Kc7": "The idea is that we're now in an endgame so the K becomes a powerful.  So, now is the time to move it forward, plus it adds protection his pawn structures on the a-c files, allowing him to get a passed pawn.  It's not passed yet, but it's a matter of time before that changes.",
        "37. Ke2": "So, ignoring the N, seeing it's gone I advance my K with the same idea.  Plus, I am trying to get the opposition, but it is too little, too late.",
        "37... b6": "Normally, I don't resign, until I see that mate is inevitable.  However, while it's not immediate, it is to follow.  For one thing, black has several passed pawns, whereas, I have none.  And, N is gone, plus, with those passed pawns and R, it's a matter of time before he wins the pawns.  So, normally I'd stay in, with the idea of trying to get a stalemate, but knowing that it'd be against the equivalent to a Master, or even a GM, I don't stand a chance.  It's lost one way or another, so I resign, at this point.  Now, it wasn't official resignation, as unlike here, they don't give resign as an option, but I hit escape and exited the game, after recording the positions.  And, I recorded them for this annotation because I lasted longer on the hardest levels, then any other past games on Wizard Chess."
    },
    "url": "https://gameknot.com/annotation.pl/wizard-chess?gm=57605",
    "gameName": "Wizard Chess",
    "players": "jkarp (1281) vs. Computer (N/A)",
    "opening": "KP (B00), Nimzovich defence"
}