{
    "moves": {
        "1. e4": "Not sure of how my opponent would respond, I still stuck with my normal opening.",
        "1... Nc6": "Develops, but I didn't think anything of this move since I hadn't seen it played this early.  And, my e4 pawn is not attacked yet.",
        "2. Nf3": "So, I play it like I would in the Italian Opening.",
        "2... d5": "Going for a center break.  So, I take with the idea that when black recaptures, I can gain tempo by attacking the Q.",
        "3. exd5 Qxd5 4. Nc3 Qe6+": "I'm not surprised to see the computer place me in check like this.  I decide to break it with my Bf1, as that will, subsequently, bring me one step closer to castling.",
        "5. Be2 Bd7": "Black's prepared to the same thing on the opposite wing.",
        "6. O-O O-O-O 7. Ng5": "With that, I go after black's Q, and when the computer reattacks, I'll defend by claiming another stake in the center, with my d pawn.",
        "7... Qf6 8. d3 e5": "I don't see the point of this move, and as such, I decide to go after black's Q, again.",
        "9. Nd5 Qf5": "Still not seeing the point to this, I attack against.  But, this will turn out be an inaccuracy.  Although material will still be even after 10.Bg4?! when we exchange, the computer will have a more mobile position which will put me at a disadvantage, regardless.",
        "10. Bg4 Qxg4 11. Qxg4 Bxg4 12. Nxf7 Rxd5 13. Nxh8 Nd4": "Not seeing the point to this, I decide to attack black's R.  What I didn't realize is what the computer intends to do with it's Nd4.",
        "14. c4 Rd7 15. Re1": "?? Going after a pawn, but this will cost me a R for P due to the upcoming N fork.",
        "15... Nc2 16. Rxe5 Nxa1 17. Nf7": "?? Figuring that black would try and trap it, I felt that this was my only way out.  But, this is a terrible oversight as black's next move will show.",
        "17... Rxf7 18. Re8+": "Trying to put pressure.  For some reason, I thought that this was mate which it would be if the monarch were placed on b8, instead.  But, I'm not resigning, yet.",
        "18... Kd7 19. Re4 Bf5": "I was not surprised to see black attack, again.",
        "20. Re1 Nc2 21. Re5": "Figuring that the Bf5 was attacked, but I forgot about black's Rf7.  Nontheless the computer moves the B, anyhow.",
        "21... Bd6 22. Rd5": "And, I decide to pin it.",
        "22... Nb4": "Which is why black attacks.  But, I'll respond with a counterattack.  The only problem is that it'll cost me another pawn.",
        "23. Rb5 Nxd3 24. Be3": "Getting my last piece out, but it's too little too late.",
        "24... b6": "Not seeing the point to this move, I reattack.",
        "25. Rd5 Nxb2 26. Rd2": "? Forgot about c4.",
        "26... Nxc4 27. Rd4": "Figuring that there was pressure.  However, this allows liquidation which puts me at a further disadvantage.  But, I'm lost no matter what, and with that, I'm pretty close to resigning.",
        "27... Nxe3 28. fxe3 Re7": "And, I do it here because no matter how you slice it, the computer will also win my e pawn.  Plus, I'm too far down to continue that I felt that now was the time to throw in the towel."
    },
    "url": "https://gameknot.com/annotation.pl/wizard-chess-game-2-hardest-level?gm=68236",
    "gameName": "Wizard Chess Game 2-Hardest Level",
    "players": "Joe  vs. Computer ",
    "opening": "KP (B00), Nimzovich defence"
}