{
    "moves": {
        "1. d4": "ok I'm gonna play queens gambit. played a few times before and like the very open games it produces.",
        "1... d5 2. c4 e6": "so you decline the gambit?",
        "3. Nc3 Nf6 4. Bg5": "pinning the knight.",
        "4... Nbd7": "and as you don't remove the pin ...",
        "5. cxd5": "I'll simply take the pawn. and become a pawn up early in the game. Thanks",
        "5... h6 6. Bh4 Bb4": "and as I cannot recapture on d5 if you now take with pawn ....",
        "7. dxe6": "I'll swap that off first.",
        "7... fxe6 8. Qd3 Bxc3+ 9. bxc3 O-O 10. e3 Qe8 11. Be2 b6 12. Bf3 Rb8 13. Ne2 Bb7 14. Bxb7 Rxb7 15. Nf4 g5": "At this point I'd made a serious mistake and was shocked to see the pawn come forward....",
        "16. Nxe6": "... but I managed to recover",
        "16... Qxe6 17. Qg6+ Kh8 18. Qxh6+": "... cleaning up three pawns for my knight - not my intention but forced by your pawn advance to g5.",
        "18... Kg8 19. Qg6+ Kh8 20. Qh6+ Kg8 21. Qg6+": "just to let you know I could force a draw if I wanted :-)",
        "21... Kh8 22. Bxg5": "before cleaing up final pawn",
        "22... Qf7": "now here, you thought I could take my win quickly - I'd like to know If you saw good things for me here as I just couldn't see a quick kill myself. and decided to...",
        "23. Bxf6+": "clean up a few pieces.",
        "23... Nxf6 24. Qxf7 Rxf7 25. O-O": "... and hope to press home the pawn advantage thinking four pawns for the knight would see me through .. especially as the kings side is wide open.",
        "25... Nd5 26. c4 Nc3 27. a4 Ne4 28. Ra2 Rb8 29. f3 Rbf8 30. Rc1 Ng5 31. h4 Nxf3+": "And then I wasn't expecting this sacrifice but it was inspired... not only does it take care of all my pawns on f-g-h but we see later it equalises on a4 \r\nnice move!!",
        "32. gxf3 Rf7xf3": "ok 3 pawns for knight h4 is indefensible.",
        "33. Re1 Rg8+ 34. Rg2 Rh3 35. Rxg8+ Kxg8": "still thought I could do it! with the passed pawn on the e file... ",
        "36. Kf2": "and wanted my king behind the three pawns for the push forward",
        "36... Rxh4 37. Ke2": "f3 may have been better but I still would have had no answer to ...",
        "37... Rh2+ 38. Kd3 Ra2": "and now the a pawn is gone and you have a passed pawn of your own on the a file ...\r\nI am now seriously worried !!",
        "39. d5 Kf7 40. Kc3": "... but decide that if you are to take my pawn? I'm not gonna allow your rook back out round the back of my king.",
        "40... Rxa4": "so you do..",
        "41. Kb3": ".. and I cut off your retreat.\r\nyour rook must join your pawns and hopefully be trapped from my e pawn advance ...\r\n",
        "41... Ra5 42. Rf1+ Ke7": "though I can't see anything better than a draw here for myself at present.",
        "43. Rf5 Rc5 44. Re5+ Kd6 45. Re6+ Kd7": "now ... here I cannot see a way through atall with my pawns :-(\r\nand your pawn on a file is strong .. I can see only a draw at most for me but I'm not in your shoes ....\r\nonly panicking in mine ...",
        "46. e4": "looking now you cannot really loosen up your position and all your pieces are pretty bound to their current positions. any move will weaken your defences",
        "46... Ra5": "so you can't really be blamed for this one ... but it gives me great hope ...",
        "47. Rc6": "now my rook takes a strong position",
        "47... Ra1": "and I'm sure your chase is futile ..",
        "48. e5 Re1 49. e6+": "... but still there is no real way through ...",
        "49... Ke7": ".. unless you allow me to take your defending pawn on c7 !!!\r\nsurely king to d8 was better ?? let me know why you gave up your pawn here.. I cannot see me forcing anything with your king on d8  - but giving away your pawn has given away the game!! ",
        "50. Rxc7+ Kd6 51. Rd7+ Ke5": "so now its elementary",
        "52. e7 Kf6 53. d6 a6 54. Rd8 Kf7 55. Rf8+": "Great game again..\r\nIt had a draw written all over it again - I'm sure you had me stronger than I felt - and maybe I was missing the killer moves that you were seeing at various points? the knight sacrifice was inspired and really got you right back into it ... cheers for another good one :-)"
    },
    "url": "https://gameknot.com/annotation.pl/wonder-if-therell-be-fireworks?gm=6756",
    "gameName": "Wonder if there'll be fireworks",
    "players": "kiev53 (1600) vs. racsimjoe (1463)",
    "opening": "QGD (D51), 4.Bg5 Nbd7"
}