{
    "moves": {
        "1. d4 Nf6 2. c4 g6 3. Nf3 d5 4. Nc3 Bg7 5. cxd5 Nxd5 6. e4 Nxc3 7. bxc3 c5": "\"White’s 8. Bb5+!? was perhaps Anand’s way of sidestepping his opponent’s prematch preparations, as after the game’s 8. … Nc6 9. d5, the line 9. … a6?! 10. Be2 Bxc3+ 11. Bd2 Bxa1 12. Qxa1 Nd4 13. Nxd4 cxd4 14. Qxd4 0-0 15. 0-0 is one of the classic Grunfeld variations where White’s two bishops are considered worth at least as much as the lost exchange.\"",
        "8. Bb5+ Nc6 9. d5": "I guess all this should be well covered by theory. Since I don't study, it seems a very interesting and tactic game to me... :-). \n\nI don't guarantee the quality of the moves in the following lines, then! Theorists are welcomed to pitiless destroy my attempts to explore myself some well-known lines, probably choosing the wrong way. I'm only enjoying myself. \n\nNow, black can try to cash in with 9... Bxc3+, 10. Bd2 (just guessing, no books),  BxRa1 (saying that he's greedy), 11. Qxd1 (this threatens the Rh8 - wow, so I guess black's best option is 0-0. Now it's white's turn to cash in with 12. dxNc6. \n\nfen=\"r1bq1rk1/pp2pp1p/2P3p1/1Bp5/4P3/5N2/P2B1PPP/Q3K2R b K -\"\n\nNow, black must choose between two lines: \n\na) 12... bxc6, 13. Bxc6, Rb8, (with a possible follow up as 14. o-o!?, Bg4 -attacking-, 15. Ne5 (threatening the fork Nd7?), QxBd2, 16. NxBg4, Rb2 17. a4, Rf-b8, and black seems to have a good edge, despite material theoretical equalness. \n\n\"fen=1r4k1/p3pp1p/2B3p1/2p5/P3P1N1/8/1r1q1PPP/Q4RK1 w - -\"\n\nb) ...or try to look for ANOTHER move, waiting for a possible cxb7 with Bxb7 (which white won't do, probably). Keeping in mind, of course, all the complications if Bg4...\n\nBack to a), let's imagine that after 13. Rb8, white gets greedy, and wants to cash in an exchange by the mate threat 14. Bh6. It seems that the only defence for black is f6, so we have: \n\n\"fen=1rbq1rk1/p3p2p/2B2ppB/2p5/4P3/5N2/P4PPP/Q3K2R w K -\"\n\nOnce you see that 15. Ng5 leads to nothing, I tried the simple one, 15. BxRf8. This could be a clear loss by black, so you would advise him not to play this. But black has another interesting move: 15. Qa5. \nWould this move will be able to compensate black's exchange (or even full rook, if necessary)?\nLooking at it, it seems black has a powerful attack, here. But can it lead to victory?\n\nWhen these kind of situation happens in real games, I sink in a sea so deep that I often end with the wrong move (see my game with Symbian, annotated, if you want to laugh at me :-(. )\n\nOk, let's see: \n\n\"fen=1rb2Bk1/p3p2p/2B2pp1/q1p5/4P3/5N2/P4PPP/Q3K2R w K -\"\n\nI explored the logical 16. Nd2. I cannot remember the line, but I couldn't find a clear win if black, instead of the natural KxBf8, goes Ba6 (it smells like mate, but where's the roast-beef?), or tries to proceed harassing the bishop with Rb6. Anyway... let's see if white can afford 16. Ke2... (it is only the last line of several dozens I found, and I can't swear it is the best...)\n\n16. Kd1 is a choice to be explored. The other is...\n\n\"fen=1rb2Bk1/p3p2p/2B2pp1/q1p5/4P3/5N2/P3KPPP/Q6R b - -\"\n\nof course black goes on attacking, and very strongly, but hey: white is about to play Bxd7, and then f6 gets fatally weak: black has no easy way to defend it. So, after all, white can go like that, after all, just to tempt - as to say - black to go on with the attack and getting unable to defend f6 after the storm is gone. For example: \n\n16... Ba6+, 17. Ke3 (practically forced because white cannot affor the blac",
        "9... Qa5": "Well... the previous message was cut by GK's UNADVISED limit of comment's lenght. \n\nOk, I understand I cannow write an entire book on a position, but please, programmers, WARN me FIRST, please!!\n\nIt never mind. I just wanted to show whay happens to me when analyzing a particularly tactic postion like this. My life stops, and I frequently get lost. And this is the reason I don't play seriouslyu anymore (sigh!).\n\nBut the astonisching think is theory \"must\" have explored all these lines - for sure, and for sure \"all this work is in vain\", since if the world's champions don't go inte them, it must be that all this is so well known by them that both are sure they will get to an even position... and black prefers to go otherwise, overattacking c3, thus complicating even more the situation. \n\nThis amazes me. Gelfand's preparation behind this move implies to have reviewed all the lines after Bxc3+, white goes in (because he know he will survive and even get an advantage for the fork... \nBut black has this trick... \n\nAnd the comments say that the game was not \"such a big deal\" (no literally, of course :-). \n\nChess IS EXCITING :-D\n\n\nThe last line of the previous message was: \n\n\n10.\tc1-d2\tc3-a1\n11.\td1-a1\te8-g8\n12.\td5-c6\tb7-c6\n13.\tb5-c6\ta8-b8\n14.\td2-h6\tf7-f6\n15.\th6-f8\td8-a5+\n16.\te1-e2\tc8-a6+\n17.\te2-e3\ta5-a3+\n18.\te3-f4\ta6-c8\n19.\tf8-e7\tg6-g5+\n20.\tf3-g5\tf6-g5+\n21.\tf4-g5\tc8-e6\n22.\tg5-h6\ta3-b2\n23.\te7-f6\tb2-d2+\n\n(I cannot decoy it again now!!!)\n",
        "10. Rb1 a6": "Again, black goes beyond the natural Bxc3+... and all this is theory....",
        "11. Bxc6+": "Of course, the chesc's momentum should be kept... I guess.",
        "11... bxc6 12. O-O": "White doesn't defend c3, nor attacks using the d pawn, but castles. If before Bxc3 was not dangerous, why NOW it is necessary to castle?",
        "12... Qxa2": "Black doesn't try to defend c7 (what's wrong with Bd7?), or save it by exchanging it (cxd5, exd5, Bxc3), nor B (or Q) x c3. He prefers this \"naive\" move, that would allow white to easily cover everything with Bd2. ",
        "13. Rb2": "White choose an attacking move, again, keeping momentum. It seems that it white's best was - hey, Vishy played it! - or is it all still theory?",
        "13... Qa5 14. d6": "It WAS theory, until here. Comments goes: \"The contest’s most intriguing moment, superbly negotiated by the challenger, came on 14. d6! (setting a high-class trap) Ra7!\"\n \nI would like to have time to find out exactly what is the \"high-class trap\" the comment refers to, but I have to work, to sleep... :-)",
        "14... Ra7": "Having to assume that it is forced...",
        "15. Bg5": "\"...15. Bg5, when the plausible 15. … f6? runs into 16. Rb8! and Black may already be lost: 16. … 0-0 17. Ne5!! exd6 (best; losing are 17. … fxg5 18. Nxc6 Qxc3 19. dxe7 Re8 20. Rxc8 Rxc8 21. Qd5+ Kh8 22. Qd8+ Rxd8 23. exd8=Q+ Bf8 24. Qxf8 mate, and 17. … fxe5 18. dxe7 Re8 19. Qb3+ Kh8 20. Qf7 Raxe7 21. Bxe7 and wins) 18. Qb3+ Kh8 19. Nxc6 c4 20. Qb2 Qxg5 21. Nxa7, and White is clearly better.\"\n\nWhy not Rb8 at once, then?\n",
        "15... exd6": "\"But Black finds 15. … exd6! 16. Qxd6 Rd7 17. Qxc6 Qc7, consolidating nicely. White’s attack peters out and in the final position, Gelfand’s bishop pair give him a distinct edge. The challenger may regret later in the match playing on a few more moves in a position in which he could hardly have lost.\"",
        "16. Qxd6 Rd7": "This, again, seems to be a \"naive\" move, but if Qc7, probably white wins with Rb8...",
        "17. Qxc6 Qc7": "Now he can, because white's queen is not on the good diagonal. Why not o-o? Because black is absolutely sure white has no better choice than to exchange queens and that he will survive the attack. ",
        "18. Qxc7 Rxc7 19. Bf4": "I guess Rd1, o-o is not better. ",
        "19... Rb7 20. Rc2": "Oh, the forgotten and never taken c3! Nobody was remembering it, right?",
        "20... O-O": "And black, after the well prepared white's novelty, survives on a decent - or even advantageous - position. A psychological victory, for sure.",
        "21. Bd6 Re8 22. Nd2": "scattered pawns, open game... all a delight for tactics, but there's not much left, to be truthful. Black, again, finds a way to attack. ",
        "22... f5 23. f3 fxe4 24. Nxe4 Bf5": "Now black seems to have a pin, but the white knight escapes taking a pawn and threatening a rook. Despite it, THEY DECIDED TO DRAW here the game!",
        "25. Nxc5": "This is the move, I guess... again, I faced myself with a sea of complications. Let's explore only one of them. ",
        "25... Bxc2 26. Nxb7 Bxc3": "Now, it seems to be logical for white to try to win a bishop with Rc1, but Bd4+ forces white to Kh1 or Bd3#. After it, black has at least a pepetual threat against the rook with the bishops. \n\nWhite has to find a way to stop black's threats, and Bc5 seems to be the one, or, probably better, Bg3. ",
        "27. Bg3": "White has to save the knight, and black has the bishop's pair and a free pawn... somewhere I went wrong :-)\nWhite's Nxc5 is under question again...",
        "27... Bb4": "Is this a draw? :-)"
    },
    "url": "https://gameknot.com/annotation.pl/world-championship-match-may-2012-1st-game?gm=44762",
    "gameName": "World Championship Match, May 2012. 1st game",
    "players": "Anand  vs. Gelfand ",
    "opening": "King's Indian, 3.Nf3 (E60)"
}