{
    "moves": {
        "1. e4 c5 2. Nf3 Nc6 3. d4 cxd4 4. Nxd4 Nf6 5. Nc3 e5 6. Ndb5 d6 7. Nd5 Nxd5 8. exd5 Ne7 9. c4 Ng6 10. Qa4 Bd7 11. Qb4 Bf5 12. h4 h5 13. Qa4 Bd7 14. Qb4 Bf5": "Caruana deviated on move 9. It is clear Carlsen has no problem repeating moves. Will Caruana accept?",
        "15. Be3": "Caruana is telling Carlsen that he came to play today! Is this a decision he may regret? We will see!",
        "15... a6 16. Nc3": "Carlsen should just develop Bishop to e7. But the game can get wild which I am not sure who will benefit more.  If Carlsen loses this game, it is because of his stubbornness for refusing to deviate his opening. If he wins, he is right for not deviating and many of the chess pundits will swallow their pride Carlsen did not want to go into the pawn sac line of 16...Be7 17. Qxb7. Instead he went for  ",
        "16... Qc7": "White is slightly better at this point. Maybe the players will fight in game 12 after all. Caruana simply cannot give away his last white game as the playoff will favor Carlsen.  I do not see the official time clock, but it seems to me that Caruana has spent a lot f time. It can mean 2 things: 1) He is out of book 2) Nerves set in and he is being extra cautious as he knows that 1 mistake can cost him the title.  It is a tough decision for Caruana now. What to do? He can try g3, f3, Be2, Kf2 then swing the h Rook to c1. But then what. Or he can take big risk by trying to do something on the Kingside. This is why he is thinking. He is out of book and has to figure something out now. ♟",
        "17. g3": "and Carlsen immediately responded w/",
        "17... Be7": "This is a very uncomfortable situation for Caruana. Objectively speaking his position is fine. But Carlsen is playing so fast. This can psychologically effect Caruana because he does not know if this is still in Carlsen’s prep Caruana played",
        "18. f3": "as I suggested earlier. But Carlsen immediately responded with ",
        "18... Nf8": "I am sure this is very confusing for Caruana. Carlsen is cranking out moves at lightning speed. The idea of Nf8 is to go to d7 to help solidify the c5 square.  This is NOT a good home prep game for Caruana as Carlsen is clearly dictating the pace. So either Carlsen thoroughly prepared for this or he is doing an amazing job bluffing Caruana. We will see ♟",
        "19. Ne4": "and Carlsen should just continue with Nd7. Time may be a factor as Carlsen is well ahead on the clock. The position is still objectively OK for Caruana. ♟",
        "19... Nd7 20. Bd3": "Now Carlsen can retreat his Bishop to g6 threatening f5 at some points.  Exciting position but Caruana must pay attention to his clock, especially in the next 5-10 moves. ♟",
        "20... O-O 21. Rh2": "This is a move I did not consider. I like Carlsen’s position. His plan should be Bg6 then f5. He is also well ahead on time. As I said a few moves ago, this is the critical stage for Caruana. Complicated position, no real clear plan and well behind on the clock♟",
        "21... Rac8 22. O-O-O": "We officially have a real brawl! As I predicted before the game, I have a feeling that somebody is going to win today. But who? Nerves, nerves, nerves! That is what it will come down to. Now the idea I mentioned Bg6 then f5 looks really good!",
        "22... Bg6": "Carlsen’s idea is clear with f5. For example if 23. Rc2 f5 24. Ng5 Bxg5 25. hxg5 e4. Black is on the attack while Caruana has to be extremely careful as one slight inaccuracy can cost him the game.",
        "23. Rc2 f5 24. Nf2 Nc5 25. f4": "Caruana is in big trouble! His King is vulnerable. b5 is coming soon after exf4. White’s position can crumble very quickly. ♟",
        "25... a5": "This is not the best move IMHO. I believe that 25...exf4 or 25...b5 are both more accurate. The question is does Carlsen have what it takes to convert. This seems to be a problem for him of late, missing opportunities. ♟",
        "26. Qd2 e4 27. Be2 Be8 28. Kb1": "White has no counter-play on the Kingside. Black is building up, even though not the most efficient way, a lot of pressure on the Queenside. The World Championship is in Carlsen’s hands if his nerves hold up. ♟",
        "28... Ra8": "My internet kept dropping from 39,000 ft. This is one of the more disappointing ending. It seems that Carlsen lost his ability to calculate and he also lost his nerves. There is no way to sugarcoat this. He offered a draw in a superior position after making inaccuracies. ♟ Carlsen’s legacy has suffered a great deal. I cannot say 100% but most GMs would never offer a draw with Black, which has very little risk. This is simply shocking! ♟ All 12 games are drawn! This has to change! @FIDE_chess needs to change this rule! No draw offer should be allowed! There is no draw offer in , ping pong , boxing , MMA & other sports. Fighting draw is no problem. But not because one’s nerves is shot! Am I wrong?  As I said in the beginning, the players will do what they think is best for them. They do not care about styles to please the fans. Carlsen came into this game wanting a draw. He offered to repeat early on. Caruana refused. Then he offered draw in better position + more time! ♟  Caruana would be crazy not to accept the draw offer in that position with such little time. Since Carlsen seems to have lost his ability to calculate deep lines, he is much more suited for FASTER time control where chess instinct is more important. That was the game plan.♟ Based on statistics, Carlsen is the favorite in faster time control. But after his mindset & clearly fragile nerves, Caruana may surprise him, especially now that he’s just given a new chance. I can’t imagine any World Champion, male/female, would offer a draw in that position.♟ "
    },
    "url": "https://gameknot.com/annotation.pl/world-chess-championship-game-12-live?gm=65761",
    "gameName": "\"World Chess Championship Game 12 LIVE\"",
    "players": "Caruana  vs. Carlsen ",
    "opening": "Sicilian (B33), Pelikan, Bird variation"
}