{
    "moves": {
        "1. e4": "This is a game I finished recently, I'm black and royzilla is white. I wanted to annotate this game mainly because of how many ups and downs, and twists and turns there are, ending in a very unusual checkmate.",
        "1... e5 2. f4 Qe7 3. Nf3 exf4": "My pawn on f4 is the basis of almost all of the beginning moves of this game.",
        "4. d3": "Threatening my pawn is what started the battle.",
        "4... Qf6": "Setting up a guard for him.",
        "5. Nc3 Bb4 6. Bd2 Nc6 7. Nd5": "I barely get myself out of this fork. it's forking 4 pieces, which is extremely rare(queen, bishop, pawn on c7, and the pawn on f4). I barely find a way out.",
        "7... Bxd2+": "freeing bishop with an even trade....",
        "8. Qxd2 Qd6": "and freeing queen while guarding the pawn on c7 and the pawn on f4.",
        "9. Be2 Nf6 10. O-O Nxd5": "I wanted to open up the board with this move, I gave up on the pawn on f4, it's too much of a bear.",
        "11. exd5 Qxd5 12. Qxf4 d6": "Guarding the pawn on c7.",
        "13. Ng5": "Yikes, whites got a very good position on my kingside.",
        "13... Bf5": "This was a mistake on my part, but white missed his chance.",
        "14. Bf3 Qc5+ 15. Kh1 f6 16. Rae1+": "Looks really bad.",
        "16... Kd7 17. g4 fxg5": "It took me a long time to think about this move, and the next few.",
        "18. Qxg5 Bg6 19. Qf4 Rae8 20. Qc4": "I think this was a mistake on whites part, now I can make an even trade and release the pressure on my kingside.",
        "20... Qxc4 21. dxc4 Nb4": "forking two pawns.",
        "22. Bxb7": "I was hoping white would fall for this.",
        "22... c6": "Now whites bishop is blocked in....",
        "23. h4 Reb8": "....and now he has to sacrifice it.",
        "24. Bxc6+": "Best move possible.",
        "24... Kxc6 25. c3": "Very smart, if I took the pawn on a2 my knight would suffer the same fate as whites bishop. White would follow with Ra1 and my knight would be gone.",
        "25... Nc2 26. Re7": "Blocking my king in, now I'm in another mess.",
        "26... Rxb2 27. h5": "hhhmmm",
        "27... Bd3": "Forked pawn on c4 and rook on f1.",
        "28. Rff7": "If I were to take the bishop on c4 I would lose it when white would follow with Rc7.",
        "28... Rxa2 29. Rec7+": "I barely avoid checkmate here.",
        "29... Kb6": "Only move.",
        "30. Rcb7+": "I'm forced to sacrifice my pawn on a7 and my rook to avoid checkmate.",
        "30... Ka6 31. Rbxa7+ Kb6 32. Rxa2 Ne3 33. Rf3": "Trying to fork....",
        "33... Re8": "....so I guard.",
        "34. Rb2+ Kc5 35. Rf7": "A mistake which saves me from checkmate.",
        "35... Nxc4": "Now my king is free.",
        "36. Rc7+ Kd5 37. Rb5+ Ke4 38. Rxg7": "I'm doing really bad, I don't know how I made it. I have to sacrifice so much to avoid checkmate.",
        "38... Kf3": "Trying to block his king in.",
        "39. Kh2 Re2+": "Closing in on him.",
        "40. Kh3 Ne5": "Keeping both his rooks away from my king.",
        "41. Rb3 Bc4 42. Rb1 Rc2 43. Rxh7 Rxc3": "Even trade.",
        "44. Kh4 Nxg4 45. Rg7 Be6 46. Rg6 Bf5": "Forking doesn't work so well here.",
        "47. Rf1+": "As you can see.",
        "47... Kg2 48. Rxg4+": "I really didn't think this move was so good a move, but I wasn't sure what he had in mind.",
        "48... Bxg4 49. Rf6 Bxh5": "I didn't want that pawn to escape my grasp.",
        "50. Kxh5 d5": "Things look a lot different now, I win because of one pawn.",
        "51. Rf4 Rc4 52. Rf5 d4 53. Rg5+ Kf3 54. Rg4 Ke3 55. Kh4 Rc2 56. Rg3+ Ke4 57. Rg4+ Kd5 58. Rg5+ Kc4 59. Rg4 Kc3 60. Rg3+ d3 61. Kh3 Re2 62. Rxd3+": "White told me he was hoping for a stalemate, since he knew their was no way he could stop that pawn.",
        "62... Kxd3 63. Kh4 Re5 64. Kg4 Kd4 65. Kf4": "I slowly have to corner him. It took me a long time to find a checkmate.",
        "65... Kd5 66. Kf3 Re4 67. Kf2 Kd4 68. Kf3 Kd3 69. Kf2 Re3 70. Kf1 Re2 71. Kg1 Ke3 72. Kh1 Kf3 73. Kg1": "This was the checkmate I was looking for. My plan worked.",
        "73... Re1+": "Only one move for white.",
        "74. Kh2 Rf1": "One move left, this looks good for a puzzle.",
        "75. Kh3 Rh1#": "Checkmate, what a neat game. So many ups and downs, lots of sacrifices and gains. Thanks for taking the time to read this. If you have any input, please feel free to say it, I'd like to hear what others think."
    },
    "url": "https://gameknot.com/annotation.pl/would-you-like-another-one?gm=28351",
    "gameName": "Would you like another one?",
    "players": "royzilla (1368) vs. chesswizz95 (1312)",
    "opening": "King's gambit (C30)"
}