{
    "moves": {
        "1. c4": " ",
        "1... Nf6": "Flank vs flank.",
        "2. Nc3": "This move looked strange the first time I saw it, but attacking d5.",
        "2... g6": "So I'm thinking black may Fianchetto his bishop, but I have been fooled here before. I am wondering if black will move d5 and cause me to change plans. ",
        "3. e4": "Normally, I would move g3 and prepare my fortress, but I'm suspicious of a d5 pawn move, which I am not sure how to handle, so I take the initiative. I do really prefer to be on the assertive side.",
        "3... d6": " ",
        "4. Be2": "Reducing the chance of a black Bd4 queen threat and preparing the castle.",
        "4... c5": " Now that is a nice looking pawn chain black has. My pawns look a little weak.",
        "5. d3": "Remedied the weak pawns. I like this configuration as well. Opens up both sides. However, the rear pawn requires constant defense with those pesky knights roaming about.",
        "5... Bg7": " ",
        "6. Bd2": "Additional defense of the knight and opening up the possibility of the long castle. Although with the black pawn chain, I don't think I'll castle queen side.",
        "6... Nc6": "Black must really like d4.",
        "7. Qa4": "Temporary fix for the growing pressure on d4.",
        "7... O-O": "Well, I did say temporary. White queen is not thrilled about that, but I guess it's to be expected.",
        "8. Nf3": "Didn't like blocking in my LSB, but I thought the black Kd4 move would not be fun either.",
        "8... Rb8": "Not sure what Rb8 signaled. Black b5 to threaten queen? ... or a future LSB move? ",
        "9. O-O": "Seems like a good time.",
        "9... Bg4": "Not sure what this is called, but looks like he pinned my knight.",
        "10. Rae1": "Want to cover  my bishop so I can move the knight to discourage black's Nd4 (which I really think he wants at this point). However, my b2 pawn looks a bit helpless.",
        "10... a6": "b5 appears imminent. Must move queen, must move queen.",
        "11. Nd5": "Or the knight.",
        "11... Nd7": "b2! Get out of the way!!!",
        "12. Ng5": "Um, who did that. I didn't move that piece. Well, what I thought I would do is sacrifice my knight to break up the fortress a bit. What I actually accomplished was to lose the game... by this one move.",
        "12... Bxe2": " ",
        "13. Rxe2": " ",
        "13... Nd4": " ",
        "14. Re3": " ",
        "14... e6": "Now, I was still considering Nxh7, but Terence talked me down from the move. He walked me through the scenarios: b5 and Nxh7. In addition, he indicated that, while the knight on g4 was lost, I could still save the other knight and my queen by moving...",
        "15. f4": "f4",
        "15... exd5": "Ouch.",
        "16. exd5": "Now this is another error. I should have moved cxd5 instead. Moving pawns toward the center.",
        "16... b5": "There's the b5 as promised.",
        "17. Qd1": "\"Well, be that way, your king is on the other side anyway!\" - unhappy white queen",
        "17... bxc4 18. Nxh7": "Not sure why, but that knight had a suicide mission since he was moved there.",
        "18... Kxh7": "Seems like with the rooks and queen almost lined up with that open file, white would be able to do something.",
        "19. Rh3+ Kg8 20. f5": "Now, I truly thought I was onto something here. I just didn't factor in the black knight on d7.",
        "20... gxf5": " ",
        "21. Qh5": "This looks really encouraging.",
        "21... Nf6": "Pesky knight!!!",
        "22. Qg5": " ",
        "22... cxd3 23. Qh4": "I want the bishop to come up and help",
        "23... Rxb2 24. Bg5": "Just hoping for a black error here.",
        "24... Re8": "That pretty much clinches it, the game is all downhill from here.",
        "25. Bh6": " ",
        "25... Ne4": " ",
        "26. Qh5 Ne2+ 27. Kh1 Nf2+ 28. Rxf2 Rb1+ 29. Rf1 Rxf1#": "Thanks Terence for the game. I learned a lot."
    },
    "url": "https://gameknot.com/annotation.pl/wtw-challenge-from-elyhim?gm=52059",
    "gameName": "WTW Challenge from elyhim",
    "players": "russ20124 (1236) vs. elyhim (2350)",
    "opening": "English opening (A16)"
}