{
    "moves": {
        "1. d4": "Just out of the opening, Black tries a speculative piece sacrifice that opens up a whole hive of possibilities on the Queen side.  For the piece, Black gets two pawns, his mobilization proceeds apace, and a temporary bind is clamped over White's Queen wing.  All very well for Black, but then what?  Black's game proceeds by threats, swarming all over the board, White having to fend off attacks here, there and everywhere.  ",
        "1... Nf6 2. c4 e6 3. Nc3 c5 4. d5 exd5 5. cxd5 d6": "The real game begins here, those so far played being compulsory for this MT.",
        "6. g3": "The 'Fianchetto Variation'.  The general idea for White is to develop quickly and quietly, remaining uncommitted for the nonce in the centre.  Once castled, his broad plan is likely enough to bring the King's Knight to d2 then c4, where it attacks d6; then begin breakthrough operations with e2-e4.",
        "6... g6": "Thematic - Black's routine over the next moves can hardly be bettered.",
        "7. Bg2 Bg7 8. Nf3 O-O 9. O-O Nbd7": "At this point, Black has a number of possibilities: 9...a6; 9...Qe7 (I might have played this on another day); 9...Na6.  The text move has certain transpositional possibilities - it may turn into one of the other lines...",
        "10. a4 a6": "...Which in fact it does.  These pawn moves on the extreme flank are, of course, Black's attempt to mobilize his big asset, the Q-side pawn majority, and White's response to restrain their advance.",
        "11. Nd2": "Continuing his plan, heading for c4.",
        "11... Re8": "Of course the half-open e-file beckons Black's heavy pieces as a daisy does the bees.  However, there was a good alternative in 11...Rb8, lighting the fuze of the rocket on b7 (i.e. getting set to advance b7-b5).",
        "12. h3": "According to Bill Hartston - his book now long out of date, I dare say - gave this as one of the responses that had been tried at this point, the other being 12.Nc4 at once.  Does White have to apprehend a possible ...Ng4 followed by ...Bd4 at some point?  ",
        "12... Rb8": "Just about a gimme: this rook is there to support the advance of the Q-side pawns.",
        "13. Nc4": "Completing the Knight's journey?  Black has to do something about the attack on d6.  I guess it is worth pointing out that d6 is the major strategic weakness that Black has to accept when playing a Modern Benoni.  That is the price he pays for the dynamic strengths of the whole opening, and it is not a cheap one.",
        "13... Nb6": "Had Black played the line 11...Rb8  12.Nc4 Nb6, then White would have played 13.Nxd6! here, with the idea 13...Qxd6 14.Bf4 and a skewer.  The game is starting to warm up!",
        "14. Na3": "So why does White not play 14.Nxd6 now?  The e8-Rook supplies the answer: 14.Nxd6 Qxd6  15.Bf4 Re5, and white has no way to augment the pin at e5.  White might take the rook right off - 16.Bxe5 Qxe5  and play on with R and P vs B and N; or retain the pin as long as possible whilst building up elsewhere, e.g. 16.e4 Qe7  17.Qe2 Bd7 and the b8-Rook moves of next turn, whereupon White takes the Exchange.  This might actually be a playable line for White, but I reckon I'd prefer the Black pieces in the ensuing game.",
        "14... Bd7": "The way things are looking, you would think that Black's b-pawn would never get to move: a Knight blocking his path, and the hazards to be encountered upon the b5-square...  I might have played 14...Bf4, but why invite the thematic e2-e4?  Be it noted, the g4-square isn't available neither.  So this restrained development seems to be indicated.  Sometimes ones choice of move is arrived at by a process of elimination.  But there was more to it than that. In my explorations of this line, I had found an intriguing possibility...",
        "15. e4": "White carries on with his strategic plan.",
        "15... Nxa4": "[!?] This was the 'intriguing possibility' that had drawn my attention.  It had been played before once or twice, with mixed results.  Black sets off a dynamite charge to get the log jam rolling down the b-file.",
        "16. Nxa4 Nxe4": "Before throwing forward the b-pawn, Black wants to get as much material for the Knight as he can.  So we snap up the loose e-pawn.",
        "17. Qc2": "Threatening to take the knight (Bxe4)...",
        "17... Nf6": "... so he must perforce retreat.  Why not protect the Knight by ...f5 or ...Bf5, then?  The latter is unplayable: 17...Bf5 18.g4 puts paid to that.  But 17...f5  18.Nc3 actually costs Black time that White can use to bring his Knights back to safety and into the centre.  Apparently paradoxically, moving the Knight again gains time - by striking at the d-pawn, but also the threat to gain several tempi with the advance of the b-pawn striking at the White Knights.",
        "18. Nc3": "Hastily racing towards the centre.",
        "18... b5": "And now the pawn thunders forward, as the white knights scramble out of his way.  I know I'm making this sound as though Black has the advantage.  Certainly the initiative lies with Black, at least for the moment.  But bear in mind Black has given up a knight, even if he has two pawns for it.  So Black has to  play actively even just to retain the initiative and stay on level terms.",
        "19. Ne2": "The Knight is lucky to have the protection of his Queen on this square, as the Black rook at e8 'owns' the e-file - for the moment at least.",
        "19... c4": "Establishing a sort of bind on the Q-side.   This is much better than chasing the Knight by 19...b4? as it would then simply move happily into c4, a snug spot from which to menace d6.  After the text, the Knight can escape via b1, but White prefers to develop.",
        "20. Bf4": "Striking at d6.  If White can come up with enough threats he might be able to wrest from Black the initiative.  If that happens, then Black is in trouble.",
        "20... Bf5": "A dual-purpose counterblow.  Black protects the d6-pawn, and takes a shot at the White Queen.  From this point on White finds himself subject to pin-pricking threats from all directions, each easily enough dealt with, but with the cumulative effect of driving White further and further onto the defensive.",
        "21. Qd1": "The only alternative: 21.Qd2 looks none too attractive after 21...Ne4  21.Bxe4 Bxe4  22.Re1 Qc8 -(threatening to take on h3, but, possibly more dangerously to white, to shove the c-pawn)- 23.Nc3 Bxc3!  24.bxc3 ... -(not with the Queen, on account of 24.Qxc3 b4) 24...Qxh3. ",
        "21... Qd7": "Suddenly striking towards the K-side: ...Bxh3 is threatened.",
        "22. Kh2": "[?!] It is here that possibly White could have made a serious bid for the initiative.  The most obvious, and the move I expected, was 22.g4 with the possibility 22...Bd3 23.Re1 Ne4 and a complicated and unclear position.  Possibly even better was to get in 22.Nc2 first, with a counter-strike against a6.  If Black then tried 22...Ra8, then back to the 23.g4 gig.  ",
        "22... Bd3 23. Re1": "Unpinning and protecting at the same time.   It is economical defensive moves like this that makes an attacker's job hard.",
        "23... Nh5": "[!] This reminds me of squad infantry tactics, storming a bunker.  Whilst the fire support team (the Black bishops) lays down a machine-gun fire, the assault team (the Black Q-side pawns) moves in.  All sorts of threats are present here - ...Bxb2; ...Nxf4; ...b4...  How can White defend?",
        "24. Bc1": "This retreat seems to cover the bases, but perhaps something more active was called for.  Worth a look, I think, would have been 24.Nc2! Bxb2!?  25.Rxa6 Nxf4  26.Nxf4 Rxe1ch  27.Nxe1 Bf5  28.Nc2.  Although Black has a well-supported pair of passed pawns, White still has the extra Knight.  I'd probably be reasonably happy with such a position as Black, but the issue would still be very much in doubt.",
        "24... Qf5": "[?!]  Showing a real interest in the f2-square.  It was too much to hope for 25.g4, but 25.f4 was the move I expected, and, as it turns out, probably White's best chance, as Black would really have had to do something about the threat g3-g4.  I have a feeling I got the move order wrong, here, as 24...b4!  25.Nc2 Qf5!  26.Ne3 Qxf2  27.Ng4 Qb6 and with material now about level, and still well placed, Black must have had the edge.",
        "25. Kg1": "[?] As already observed, 25.f4 was best.  Possibly White didb't want to weaken his pawn structure around his King, and felt that f2 would be sufficiently protected by the King.  He was right about that, but now Black was free to carry out what he should have done a move earlier.",
        "25... b4": "Bang.  There is no good immediate Knight move to escape entrapment on a3.  But what about 26.g4, hoping to trade Knights?  Comes 25.g4 Qe5 and both White knights are attacked for Black's one.  About to lose a piece after being subjected to a flurry of blows for the last half-dozen moves or so, White resigned.   I think he could have played on a little: Black's edge was not yet decisive.  But the decision to call a halt here was at least understandable."
    },
    "url": "https://gameknot.com/annotation.pl/wtw-modern-benoni-mini-tournament-viii-swarm?gm=50762",
    "gameName": "WtW Modern Benoni mini-tournament VIII: Swarm",
    "players": "caveman1960 (1777) vs. ionadowman (2098)",
    "opening": "Nimzo-Indian defence (E20)"
}