{
    "moves": {
        "1. d4 Nf6 2. c4 e6 3. Nc3 c5 4. d5 exd5 5. cxd5 d6 6. e4": "So, here we go",
        "6... g6": "following the main line",
        "7. Nf3 a6": "To prevent Bb5, probably not the best option but an okay move and black's idea is to advane on the queen side.",
        "8. Bf4 b5 9. Bd3": "White reinforces his center and prepare to castle.",
        "9... Bg7": "Time to prepare castle for black as well",
        "10. O-O O-O": "So, both Kings are safe but the developpement is not yet completed.",
        "11. Re1 Re8": "Both rooks on the e file, like often in the Benoni. The situation is equilibrated.",
        "12. h3": "preventing Bg4 (which I surely would have plaid)",
        "12... b4": "At this point, I leave the database. The plan was to oblige white to set his knight aside (wether on a4 or b1) so that it wouldn't protect the d5 pawn any longer when e5. would come.",
        "13. Na4 Qc7": "To control b3 and d6 and able the LSB or knight to come on d7",
        "14. e5 Nxd5": "That was black's idea when playing 14. Nxd5",
        "15. Bh2": "I was sure that whote would have plaid 15. eXd6 RXe1+ 16. QXe1 17. Qd7 so that this move completely surprised me. The line choosed by Stalhandske is in a way more dangerous for black  because it's more complicated and harder to follow.",
        "15... Be6": "The d knight has no place to retreat and will soon be attacked by both LSB and queen (if white plays 16. Be4, for example). The only solution I found (after long thinking)  was to protect it by both queen and bishop. Of course it will enable black to play eXd3",
        "16. Be4": "As I feared.",
        "16... Qc6": ".Protecting the d knight but pining it to the queen and preventing  17. Nb3",
        "17. Rc1 Nd7": "Protecting the c pawn, menacing black's e pawn and joining the rooks.",
        "18. Nd4": "Everybody is on the center.",
        "18... Qb7": "The queen still plays the same protecting role and is still pined.",
        "19. Nxe6 fxe6": "annoying but 19. ... Rxe6 would have let the d knight with only one protection against two attacking pièces.",
        "20. exd6": "It had to come",
        "20... Rac8": "To protect the c pawn.\nMaterial is equal, the black king is less safe because  the f pawn is taken and white has a passed pawn while black has an isolated one. Further more black pièces are cramped but after 20 moves, I considred it was not to bad a situation against a player 600 points above me, if I manage to gain some intiative allowing me to get rid of the d pawn.",
        "21. Bf3": "Allowing the e rook to menace e3",
        "21... Kh8": "Necessary to avoid 22. Rxe6+ Rxe6 23. Nxd5 pining the rook to the king. I saw no other move and couldn't get he initiative.",
        "22. Rc4": "White carries on attacking but it's the first move for long that black is not under direct menace.",
        "22... Qb5": "This diagonal seemed good to take control of (although white can menace the queen by Be2 but it would block his e rook. Furthermore, the black queen menaces the a knight if the white queen moves.",
        "23. Rce4": "Menacing the weak e pawn",
        "23... Nf8": "protecting the e pawn.",
        "24. b3": "protecting the knight and thus allowing the queen to move. Also allowing the knight to move on b2",
        "24... Nf6": "attacking the rook, putting the knight on a less exposed place and controlling d3, thus freeing the f knight or the queen from that job.",
        "25. Rh4": "I couldn't find the reason of this move and against Stalhandske it made me feel very uncomfortable. Anyway after a big rush on the center until the 18th move, everybody has left it. i prefer open games but I know that it's also the case of my opponent.",
        "25... Nf6d7": "I longely hesitated before this move because I was afraid to miss something with white's last move and because, for the first time since the begining of the game I had the impression of having several options. The other candidates moves were Rd8, 25. ... g5 or 25. ... e5 but 25. ... Nd7 seemed safer and wouldn't prevent the other moves further. Nd7 has the advantage of controling b3 and thus preventing the white knight on a4 to come there.",
        "26. Be2": "I had anticipated this move and thought it had the advantage for black to mask the e rook.",
        "26... Qb8": "Letting white take the a pawn. But it's a trap. For if 27. Nxa6 Rxc6 28. Nc4 e5 29. Rhe4 Rxd6. So that black exchanges a pawn not involved in the game against a dangerous passed one and directly menaces the queen, thus getting the initiative. At least that's what I expected but...",
        "27. Bxa6": "Black's tactic seems to work",
        "27... Rc6": "Next step of black's tactic to take d6",
        "28. Bc4 e5": "There, I was sure to take the d pawn.",
        "29. Qd5": "But... Fork attack",
        "29... Re6": "Not much to do to prevent the mate by 30. Qg8 (29. Ne6 would have let the pawn unprotected).",
        "30. Qxc6": "I could have submit at this point but wanted to see how Stalhandske would do and how many moves I culd hold against a master.",
        "30... Rxd6 31. Qf3 Rf6 32. Qd5 Re6 33. Nxc5 Nxc5 34. Qxc5 Nd7 35. Qb5 Qxb5 36. Bxb5 Nc5 37. Rc4 Bf8 38. Bxe5+ Bg7 39. Rxc5 h5 40. Bxg7+ Kxg7 41. Rxe6 Kh6 42. Bd3 h4 43. Rxg6+ Kh7 44. Rh5#": "So, I have the impression that I did a good defense until I made a blunder by trying a counterattack overseeing something. 12. ... b4 doesn't seem a good option, anyway. No surprise if it's not in the database."
    },
    "url": "https://gameknot.com/annotation.pl/wtw-modern-benoni-mini-tournament-viii?gm=49913",
    "gameName": "WtW Modern Benoni mini-tournament VIII",
    "players": "stalhandske (2120) vs. ptitroque (1669)",
    "opening": "Nimzo-Indian defence (E20)"
}