{
    "moves": {
        "1. d4 Nf6 2. c4 e6 3. Nc3 c5": "The set moves for this MT: the Modern Benoni Defence, a very double edged line.",
        "4. d5 exd5 5. cxd5 d6 6. e4": "Much the usual move by White at this juncture.",
        "6... g6": "Black is very interested in the central dark squares (e5 and d4) and fianchettos his King's Bishop according.  In conjunction with a general advance of his Q-side majority this is a major plank of Black's strategy.",
        "7. f4": "The Pawn Storm Variation.  According to Bill Hartston, this is 'the most direct refutation attempt of the Modern Benoni. White prepares at once to set his central pawn roller in motion.'",
        "7... Bg7": "Thematic and best.  Again, Bill Hartston: 'Attempts by Black to halt the advance are doomed to failure...'  E.g. 7...Qe7   8.Nf3 and now [A] 8... Nbd7?  9.e5 dxe5  10.fxe5 Nxe5   11.Bb5ch Nd7ch   12.Kf2 Ng4ch  13.Kg3! with a winning game for White.  [B] 8...Nxe4   9.Nxe4 Qxe4ch  10.Kf2 ... threatening 11.Bb5ch.  [C] Black's best is to continue as in normal lines, ...Bg7 and ...0-0, but even so White seems to come out with an edge.",
        "8. Bb5+": "This is the notorious, and dangerous, 'Flick-knife Attack.'  With the White pieces against 'caveman1960' I went for the Mikenas line 8.e5!?  According to a book I have on the Skopje Olympiad, it was there that were heard the last dying moans of Mikenas's version of the Pawn Storm Attack.  It seems, after these 40 years, it is still kicking... That will be the subject of a future annotated game.",
        "8... Nbd7": "(!?) This was the move that had long been discredited, on the grounds that it lost a piece after 9.e5, followed soon after by e6.  But there is more to this than meets the eye!",
        "9. e5": "(!) The critical test, of course.",
        "9... dxe5 10. fxe5": "A mighty looking centre!  Black seems to be about to lose a piece, and he does.  So what can Black do to save the situation?  ",
        "10... Nh5": "Opening up lines, in particular, a diagonal for his Queen.",
        "11. e6": "Carrying on with the central theme: winning the d7-knight.",
        "11... Qh4+": "What follows seems to be something of a forcing line.  It turns out to have been played before, and neither of us saw any reason to deviate.",
        "12. g3": "Forcing Black's reply.  But this move was not itself forced, and seems not to be White's best option.  If instead 12.Kd2, Black has to strain every nerve to maintain his attack.  Here's a sample line: 12.Kd2 fxe6  13.dxe6 0-0  14.exd7 Bxd7  15.Bxd7 Bxc3ch!?  16.bxc3 Rf2ch  17.Ne2 Rd8  18.Qb3ch Rf7 with an unclear - not to say murky - position.  This line was played in the Club Forum between brigadecommander and elyhim though Black chose 18...c4 as an improvement over ...Rf7.",
        "12... Nxg3": "Now White just about has to take on g3 sooner or later or lose his rook at an even higher price.",
        "13. hxg3 Qxh1 14. exd7+": "Perhaps this could have waited a little longer and 14.Be3 played, developing and defending at the same time.  Something to think about for future games, perhaps?",
        "14... Bxd7 15. Bxd7+ Kxd7": "This latest flurry of exchanges have left an open board, most of the active pieces have been gunned down in the shoot out.  Black has rook and 2 pawns for 2 Knights - nominally a pawn's worth ahead, but in practice thought to be pretty much even.  At the moment the game is hard to call, as the two knights can be hard to break down.  However, Black has a majority on both wings, and White's central passed pawn is isolated and vulnerable.  Meanwhile, White has to do something about the pinned Knight at g1.  Could Black have improved in the meantime?  It seems that Queen checks at e2 or a4 or g4 might have to be examined in future games.",
        "16. Kf1": "Sensible: gets the King off the open e-file as well as protecting the Knight.",
        "16... Bd4": "A dual purpose move.  It renews the attack upon the g1-Knight, and there is but one defence available.  At the same time it cuts off the White Queen's protection of the d-pawn, and deflects away the c3-knight from the same task.  White's d-pawn is doomed.  ",
        "17. Nce2": "Forced.",
        "17... Qxd5": "Black now has Rook and 3 pawns for 2 Knights.  But White is able to claw back one of the pawns...",
        "18. Be3": "Attacking the pinned Bishop.  Black can not arrange betimes any further defence for the d4-square.",
        "18... Rhe8": "Forcing the issue.  White has to resolve the tension in the centre.",
        "19. Bxd4 cxd4 20. Qxd4": "(!?) Could White have taken with the Knight?",
        "20... Qxd4 21. Nxd4": "Now we enter the end game proper.  What are the prospects?  Black must have the edge and the initiative, I think, based upon the mobility of his rooks, and of the 3-1 majority on the K-side.  But the knight pair ought not to be underestimated.  Capable of mutual protection, they can be a real problem to break down.",
        "21... Re4": "A tempo gainer.  That the 'mutual protection brotherhood' is thereby established can't be helped.",
        "22. Ngf3 Rd8": "Building up pressure upon the d4-Knight.  The King intends to step over to 'his own' side of the board in support of the pawn majority.",
        "23. Rd1": "(!?) I think 23.Rc1 might have been the better option, in the interests of counter-attack (Rc1-c7ch to come).",
        "23... Ke7 24. Kg2": "(?!) The first sign that White is unsure how to proceed.  Broadly speaking, the idea seems right, but methinks Kf2 was the better choice.  As a result I was very tempted indeed to play 24...Re2ch  25.Nxe2 Rxd1, reducing the ending to simpler terms.  But I thought to gain a bit of time by beginning a K-side advance straight away.",
        "24... f5": "(!) The King will slot in nicely at f6.  Instead 24...g5 didn't seem nearly so good.",
        "25. Kf2": "(!) Sensible, in my view, even if a move late.  White has a bit of a problem with his pieces right now.  The d4-Knight is pinned, and his other pieces committed to its defence.  In effect, they have been immobilized, and it is not so easy, perhaps, to hit upon a plan to re-mobilize them.  This move seems to be essential - after all, without it Black could still have gone in for the ...Re2ch line, having stolen a march (...f5) on the K-side.",
        "25... Kf6": "As planned.  That White was threatening Re1 was incidental.",
        "26. b3": "(?) It is my belief that White needed as a matter of urgency to break the bind on his pieces.  That suggests one of two moves: 26,Rd2, to place the rook under protection of Knight and allow the d4-Knight to move; or 26.Rd3, with the idea of bringing the rook across to b3 or a3,  and give up the knights for rook and pawn.  It is doubtful that White could hold the endgame, but at least he could go down swinging.",
        "26... h5": "(!) Ordinarily I would prefer ...g5, but I wanted to hold back White's g-pawn.",
        "27. Rd3": "It is too late for this, now that a pawn stands on b3.  Instead, Rd2 was indicated.",
        "27... g5": "So far have Black's K-side pawns advanced in 4 moves, whilst White has been unable to find a way to break out of the bind.",
        "28. Rd2": "(!) At last - but it is really too late.  The Black pawns charge into the attack.",
        "28... f4": "I had originally intended 28...g4, and, as it turns out, that would have been OK.  But having arrived at this position this move at once imposed itself upon my awareness as even better.",
        "29. gxf4 Rxf4": "The threat is to pin and win the Knight (...g4).",
        "30. Kg2": "If 30.Kg3, then ...h4ch  31.Kg2 g4  32.Nxh4 Rfxd4  And now White pretty much has to exchange rooks: 33.Rxd4 Rxd4  34.Kg3 Kg5  35.Ng2 Re2  36.Ne3 Rd3  37.Kf2 Rxd3  38.Kxd3 g3  39.Ke2 Kg4  40.Kf1 Kf3 and wins.",
        "30... g4": "Forcing away one of the guards of the d4-Knight.",
        "31. Kg3": "(!) A neat try, but Black has one winning move available.",
        "31... Re4": "(!) There was only one other possibility, but that left White with a fine drawing chance: 31...gxf3?  32.Kxf4 f2  33.Rxf2 Rxd4ch  34.Kd3ch Ke5  35.Rf7.  But now White must lose a knight.",
        "32. Kh4": "(?) An oversight in a position already lost.  So White loses both Knights... So how could White improve his defence? I spent a lot of time looking at 32.Nb5 as the most obvious try. It looks as though Black might have to exchange rooks, doesn't it? Having looked at 32.Nb5 Rxd2 33.Nxd2 Re5 34.Nxa7 Rxa5 35.Nc8 Rxa2 as a 'working line', I felt there just had to be something better. Sure enough, there is. It did not take long to find: 32.Nb5 h4ch!! The pawn can not be taken without loss of Knight or Rook, so the King has to retreat. He has but one reasonable square: 33.Kf2 g3+! 34.Kf1 Rxd2 - Now's the right moment! - 35.Nxd2 g2+! 36.Kg1 Re1ch 37.Kxg2 Re2ch 38.Kh3 Rxd2. This whole 6-move sequence is forced. White continues: 39.Kxh4 Rxa2 40.Nd6 Rb2 41.Nxb7 Rxb3 and Black wins a not-very-difficult ending.",
        "32... gxf3+": "(0-1) It's check, the King has to move, and so the d4-Knight, so long in the forefront of battle, at last bites the dust.  Possibly White had intended 33.Kxh4 here, but 33...Rh8ch would have been mate.  May I congratulate my opponent, who, in losing, still played well above his 1337 rating."
    },
    "url": "https://gameknot.com/annotation.pl/wtw-benoni-mt-viii-last-stand-of-the-white-knights?gm=50163",
    "gameName": "WtW Benoni MT #VIII: Last Stand of the White Knights",
    "players": "last_archimedean (1337) vs. ionadowman (2085)",
    "opening": "Nimzo-Indian defence (E20)"
}