{
    "moves": {
        "1. e4": "Hi everyone!\n\nMyevilluck is certainly bombing towards his next goal, that is to become a Gameknot Master with a rating north of 2200.  If he keeps this up he will certainly get there because he achieved an IM Draw with the mighty Klauno (Klaus).  So how did this happen?",
        "1... c5": "1. ..... c5 - Klaus may have gathered that Myevilluck is an absolute connoisseur of the King's Gambit, so he gives him the Sicilian rather than play e5.  It will be interesting to see just how Myevilluck shapes up against this one!",
        "2. Nf3 d6 3. d4 cxd4 4. Nxd4": "4. Nxd4 - usual Sicilian play.",
        "4... Nf6 5. Nc3": "5. Nc3 - out come the cavalry!",
        "5... a6 6. Bg5": "6. Bg5 - white brings his pieces out rapidly.",
        "6... e6 7. f4 Be7 8. Qf3 Qc7 9. O-O-O": "9. 0-0-0 - allo, allo, allo - are we gonna get the classic Sicilian castle on opposite wings followed by a mating attack race.  Yup, last one there cops Old Matey!",
        "9... Nbd7": "9. ...... Nbd7 - solid.",
        "10. g4": "10. g4 - looks like the race is on, will this wall of pawns dissuade Klaus from castling kingside I wonder?",
        "10... b5": "10. ..... b5 - and now we get the standard Sicilian Naijdorf pawn push to b5 followed by b4 chasing away the c3 knight leaving the WK more vulnerable to a mating attack.  Usually in the Sicilian, the WK almost always goes to b8 because black usually plonks a BQ on the c column or a black rook, leaving the possibility of a very strong attack of heavy artilliary on the a, b and c column.  Sometimes, particularly in the Sicilian Dragon, an exchange sac on c3 occurs to bust up white's pawn structure and leave the WK open to hostile castle fire and an attack from a dsb from the a1-h8 diagonal.  In this game the black dsb is on the a3-f8 diagonal but there is still a possibility of that prelate coming in to a3 at a later date, so, Myevilluck - beware! ",
        "11. a3 Rb8 12. Bh4 h6 13. Bg3": "13. Bg3 - Myevilluck puts his bishop on the same diagonal as the BQ and a BR on b8.  There is potential for a skewer if Klaus does not watch out!",
        "13... Nc5 14. g5 hxg5 15. fxg5": "15. fxg5 - hmm, the h column is now open, but to whose advantage?!",
        "15... Nfd7": "15. .... Nfd7 - sneakily threatening Bxg5+.",
        "16. g6": "16. g6 - now threatening Qf7+ and now Klaus does castle, but is he castling into it?",
        "16... O-O 17. Qe3": "17. Qe3 - I did wonder whether Qh5 was a good move here, although the WQ can be chased away with Nf6 - although white can play gxf7+ to avoid losing a pawn before retreating the queen.",
        "17... Ne5 18. gxf7+ Rxf7": "18. ..... Rxf7 - black does not want to risk putting his king on the open f file to be checked by the WQ.",
        "19. b4 Bd7 20. Be2": "20. Be2 - why not PxN?",
        "20... Rc8 21. Be1 Bf6 22. Kb1 Nb7": "22. ..... Nb7 - black retreats his knight and now there is a potential threat of Qxf2+ should both white steeds be lured away.",
        "23. Bh5 g6 24. Rg1": "24. Rg1 - pin.",
        "24... Rg7 25. Be2 Nc4 26. Qc1": "26. Qc1 - the WQ evades the black knight's attack.  Suddenly white's position looks a bit like a jstevens1 position in the middlegame - this player seems to have a tendency to batten down those hatches and now Myevilluck is having to do so.  Now Klaus is really trying to open up white's already draughty castled position.  ",
        "26... a5 27. Ncxb5 Bxb5 28. Nxb5": "28. Nxb5 - aha, a plethora of exchanges puts white temporarily at least one pawn ahead.",
        "28... Qb6 29. Rf1 Be5 30. a4": "30. a4 - necessary to back up the knight on b5.",
        "30... axb4 31. Bg3 Bxg3 32. hxg3": "32. hxg3 - material is even but white's pawns are weaker.",
        "32... Ne3": "32. .... Ne3 - fork!",
        "33. a5 Qc5": "33. ..... Qc5 - why not QxP?",
        "34. a6 Na5 35. Nxd6 Ra8 36. Rfh1": "36. Rh1 - only one rook can dodge the knight fork, the other will perish.",
        "36... Nxd1 37. Rxd1 b3 38. cxb3 Nxb3 39. Qc4 Qxc4 40. Bxc4": "40. Qxc4 - after the queen trade white is the exchange for a pawn down.  This could prove decisive in black's favour, but white fights on.",
        "40... Nc5 41. Kb2 Rc7 42. Nb5 Rc6 43. a7": "43. a7 - trying to tie black down.",
        "43... Na4+ 44. Kb3 Rxc4 45. Kxc4": "45. Kxc4 - I wonder why black returns the exchange?",
        "45... Nb2+": "45. .... Nb2+ - answer - another fork!",
        "46. Kc5 Nxd1 47. Kb6": "47. Kb6 - but white has counterplay in that little pawn on a7.",
        "47... Nf2 48. e5 Ng4 49. Kb7 Rxa7+ 50. Kxa7 Nxe5": "50. .... Nxe5 - black has been forced to give up his rook to stop the a pawn crowning but he takes off another white pawn.  White must get his king back towards the centre or he is toast!",
        "51. Kb6 Kf7 52. Kc5 Kf6 53. Kd4 g5 54. Ke4": "54. Ke4 - white manages to get his king back to the centre and as he does so, offers a draw.  Klaus accepts and despite being a pawn light, Myevilluck has triumphed in the endgame.  Kudos to both players for an exciting game!  Kind regards - Joanne"
    },
    "url": "https://gameknot.com/annotation.pl/wtw-challenge?gm=48380",
    "gameName": "WtW Challenge",
    "players": "myevilluck (2158) vs. klauno (2419)",
    "opening": "Sicilian (B99), Najdorf, 7...Be7 main line"
}