{
    "moves": {
        "1. c4": "I should also clarify, as we begin, that the title is not meant to imply that my opponent or I are Masters--just that the game itself is worthy of serious consideration because of the complexities involved! Personally, I don't think either of us were equipped to deal with the positions we created!",
        "1... b6": "Black immediately pulls me out of my opening repertoire with this move, transposing from the English Opening to the English Defense...",
        "2. d4 e6": "...usually reached from 1.d4 e6 2.c4 b6. I've never encountered this before, but I can infer from basic principles that Black will try to attack the center from the wings, especially the light squares d5 and maybe e4.",
        "3. Nc3": "That in mind, I contest those squares. Also possible was 3.e4 but I was worried about creating an overadvanced, undersupported pawn center.",
        "3... Bb7 4. a3": "Essentially adding a little support to d5, by preventing ...Bb4.",
        "4... d5": "Of course Black can simply occupy d5 directly.",
        "5. Nf3 Nf6 6. cxd5 Nxd5": "Black continues to hold the his own in the center just fine.",
        "7. e4": "?! My idea was to gain time to develop my light-squared Bishop by giving up a pawn, and to bolster d4 at the same time (after ...Nxc3 bxc3). This works, but I don't know if the compensation is actually worth it.",
        "7... Nxc3 8. bxc3 Bxe4": "Black gains his extra pawn.",
        "9. Ne5": "The Knight holds a strong point in the center of the board, threatening c6 and f7, as well as letting the WQ out to g4 should she choose that path later on.",
        "9... Qh4": "?! Personally, I don't think this accomplishes anything. Black doesn't have enough pieces in the field to make this a legitimate attack, and the Queen can be easily chased away here.",
        "10. g3": "If Black's goal was to weaken the White kingside, though, he's certainly succeeded at that task. This jab foreshadows things to come--White puts a Rook in danger in order to stab at a more valuable Black piece. The tactics and counterattacks only increase from here.",
        "10... Qd8 11. Bb5+": "!? White puts off dealing with his Rook for another turn, in order to take advantage of the opportunity to develop with tempo...",
        "11... c6": "Now two White pieces are hanging...",
        "12. f3": "This is the only way to avoid losing material.",
        "12... Bd5": "And likewise for Black, any other retreat for this Bishop loses the c-pawn (and 12...cxb5? 13.fxe4 gives White a massive center).",
        "13. Bd3": "White seems to have eked out some compensation for the pawn after all. Black's only developed piece is centrally-placed, but restricted by its own pawns and could be won outright by c3-c4!",
        "13... f6": "Since Black would rather not lose his only active piece, he pushes the Knight back to make room for ...e6-e5. I'm pretty sure 13...c5 was playable here, as well, and perhaps preferable as it frees up c6 for a Knight, but it does open the a4-e8 diagonal again, so perhaps pushing the Knight off of e5 first was best after all.",
        "14. Ng4": "White doesn't want to move to c4, since that would negate his threat against the Bishop.",
        "14... e5": "14...c5 was still playable, and personally I still prefer that move to the text. Here White actually has a chance to simply win back his pawn with 15.dxe5.",
        "15. O-O": "White chooses to get his King off the e-file before it opens, but loses the chance to win the pawn.",
        "15... Nd7 16. Ne3": "Striking the Bishop to gain tempo to reposition, since this Knight is no longer useful on g4.",
        "16... Be6": "Black threatens to swing down to h3.",
        "17. Qa4": "White hits the newly-undefended c-pawn. I'd also considered playing 17.Bf5!? where 17...Bxf5 18.Nxf5 gives the White Knight a reasonably strong position, but I was hoping to create a way to land on d6 first (to make 18...g6 less appealing).",
        "17... Qc7 18. Be4 b5": "White pins the pawn to the Rook and threatens to win it, so Black responds with a kick to the Queen, which must now retreat to c2.",
        "19. Qc2": "Even this retreat is an attack, pointing the battery at h7 (though capturing that pawn is a mixed bag, as it would release the Black Rook into the White kingside).",
        "19... Nb6": "Black prevents White's other threat, which was c3-c4.",
        "20. Rb1": "White responds with a promise: if Black advances the c-pawn, he'll lose the b-pawn in exchange.",
        "20... exd4": "So Black initiates an exchange to create a white isolani that he can perhaps win at a later date. The danger is that now the e-file is open, with his King still right in the center.",
        "21. cxd4 Rc8": "More to unpin the c-pawn than anything else. I think I would have preferred to castle here, though.",
        "22. Bxh7": "!? This move seems innocuous enough, even strong. But like I said earlier, letting the King Rook out of its cage is a whole bag of worms unto itself, and this move will prove to have huge consequences for the rest of the game. For White: the g6 square is now available to play on with his Bishop, Queen, and/or Knight. For Black: a direct line to the White King has opened up, to compliment the view his Queen already has.",
        "22... c5": "! The pawn advance is really an incidental part of this move: the point is that it challenges the d4 pawn and sets the stage for opening the c-file and placing the dark Bishop on c5.",
        "23. Re1": "White ignores (perhaps unwisely) the threat to his isolated d-pawn and glares down at the Black King with a reminder: the e-file is open, and you are a sitting duck! My plan at this point was to respond to 23...cxd4 with a check on g6, perhaps followed by a Queen trade or a Knight hop to d5/f5 depending on the situation. I can regain my pawn with Rxb5 whenever it's convenient.",
        "23... Kd7": "? Still, I think 23...cxd4 was best. This just seems to invite an attack. I fretted about my next move here for a solid week. Should I play 24.Bf5 to incite a trade in the center and get my Rook into the action? Should I simply advance with 24.d5 and push the Bishop out of the way first, (Black can't reply with a capture, e.g. 24...Nxd5? 25.Nxd5 Bxd5 26.Qf5+ and White is up a piece) or perhaps play 24.Rxb5 directly in preparation for cutting across the center? The possibilities are tremendous.",
        "24. Bf5": "I eventually decide on this, which I'm reasonably happy with. I was torn mostly between this move and 24.d5, and was unable to find a compelling reason to play the latter. I chose the move you see here because I was worried I'd overlook my Bishop up in the corner and lose it by moving my Queen carelessly (or getting it chased away).",
        "24... cxd4": "! I was really hoping for 24...Bxf5 25.Qxf5+ where White has a great attack. Unfortunately, my opponent plays solid chess and did not give me an easy time of it. Still, the GK computer gives White a solid lead here (but more on that in a moment, for why I don't trust the GK engine at all...)",
        "25. Bxe6+": "This is best, I'm pretty sure. The Black King is drawn onto the e-file, prime checking real estate. Here's a funny bit--just before this move, the GK computer gives White an edge of about one and a half points. Once I take this Bishop--clearly a move it should have considered!--White's perceived advantage jumps to +4.15!",
        "25... Kxe6": "This is essentially forced, but I spent another very long time staring at this board. I'm glad I wasn't faced with this position in an over-the-board game! Once more, there are a terrific number of possibilities. The main things to consider were: the discovered check from moving the Knight; the hanging WQ once the Knight moves; the fact that the Knight is hanging if it stays; the undefended Black pawn on b5; and the threat of a check or pin via ...Bc5. Plenty to think about while trying to calculate variations!",
        "26. Nf5+": "Unfortunately, I chose a subpar move, but I'm not too disappointed with myself. Fritz found this very deep and counterintuitive continuation to gain a big advantage for White: 26.Nd5+! Kxd5 27.Qe4+ Kc5 28.a4! (threatening Ba3+ with mate to follow) ...b4 29.Ba3! (Black cannot take lest he fall to Rb5+) ...a5 30.Rbc1+ Nc4 (forced, or the BQ falls) 31.Qe6 (threatening Rxc4+ winning the Queen anyway) ...Qd6 32.Rxc4+ Kb6 33.Rxc8 where White has *finally* won some material and has a winning game.",
        "26... Kf7": "This is absolutely Black's best move. The other options leave his King much too exposed.",
        "27. Qxc7+": "White's undefended Queen has nothing better to do at this point.",
        "27... Rxc7 28. Rxb5": "Material has equalized. The Black King is actually looking pretty safe. White has more activity, but Black has that powerful passed d-pawn for White to worry about. I considered playing 28.Nxd4 (Bc5 29.Be3) for a while, but I decided on the text move as being more aggressive (and therefore more fun!)",
        "28... Rc2": "! Nasty! Remember how I said the missing Black h-pawn would be important? Well, here it is! White now has to weigh his attacking options against Black's. I concluded that I could always play Nh4 if anything nasty happened on the kingside, so I proceeded with my attack...",
        "29. Ra5": "Quiet-looking threat upon quiet-looking threat. I hadn't calculated all the variations when I played this, but Rxa7+ looked strong enough that I figured I could get away with it. I still think I was right, though it also looks like I was right to have been afraid of 29...d3! As my opponent mentioned around this point: a good position for a tactics masterclass, but too much for either of us!",
        "29... Bc5": "!? The tactics are piling up. Both sides now have potent mating attacks prepared, but who can pull his off first? Too close to call, in my opinion. I choose the \"obvious\" line here in deference to my sanity, but before you go on, let me call your attention to the other line I was considering: 30.Rxc5?! Rxc5 31.Nxd4 where White has a Bishop and pawn against Black's pocket Rook.",
        "30. Rxa7+": "Black technically has lots of ways to respond to this, but only one doesn't end in mate.",
        "30... Kf8 31. Nxg7": "?! Threatening Re8# but now the initiative is in Black's hands, and the Knight has given up control of e3. There might yet be a win in this for White if I'd continued 31.h4 instead (cutting out the Rh8 from my kingside), but as it stands, Black can now force a draw.",
        "31... d3+": "Black advances with check; White really has only one move.",
        "32. Be3 Bxe3+ 33. Rxe3": "All of this I had forseen. What I hadn't noticed, though, is that I never get a move to myself again.",
        "33... Rc1+": "Check.",
        "34. Kg2": "Of course not 34.Kf2?? Rxh2#!",
        "34... Rc2+ 35. Kg1": "Look familiar?",
        "35... Rc1+ 36. Kg2 Rc2+": "And damalfi and I agreed on a draw after this insane battle. I hope you enjoyed reading it and wading through those mind-boggling midgame positions. Many thanks to damalfi for a terrific game, and thank you all for reading!"
    },
    "url": "https://gameknot.com/annotation.pl/wtw-mt3-tactics-masterclass?gm=49477",
    "gameName": "WTW MT3: Tactics Masterclass",
    "players": "bwaa (1782) vs. damalfi (1768)",
    "opening": "English opening (A10)"
}