{
    "moves": {
        "1. d4": "1. d4 is an opening I like, because I'm a lover of closed, positional games. 1. e4 on the other hand, guides you (mostly) to open, tactical positions.",
        "1... Nf6": "A waiting ànd developing move ! He prevents me from playing 2. e4, thus I can't occupy the whole center. Nevertheless, this wasn't my intention, as said before.. ",
        "2. Bf4": "Going on with my development, some sort of \"London System\".",
        "2... c5": "Mmm, only faced this once before while playing this opening. A very aggressive move ! ",
        "3. e3": "Making space for my light-squared bishop.",
        "3... Qb6": "He's giving a double threat: both on d4 and b2.",
        "4. b3": "The best way to keep his queen away from b2. But now, my c-pawn is getting weak..",
        "4... Nc6": "Triple-attacking d4. The pressure is rising ! ",
        "5. Nf3": "Defending d4 and developing a piece in the same move. ",
        "5... h6": "Preventing me to play Bg5 or Be5. And also preparing to play g5 sometime ? ",
        "6. h3": "So I play h3, to give my dsb a field to run to, once Nh5 or Nd5 would be played.. ",
        "6... d6": "Probably his next idea is to play e5; giving more pressure to d4.. Also, the diagonal c8-h3 is now open for the lsb.",
        "7. Be2": "Bringing my bishop to his best field. Both 7. Bd3 Nb4 and 7. Bc4 d5 would benefit black.. ",
        "7... Bf5 8. Nbd2": "In some way I was trying to get a hold on c4 with my knight. So I would gain some sort of controlled space in the center.",
        "8... g5": "Gaining space ànd forcing me to retreat with my bishop. ",
        "9. Bg3": "I'd rather like to move this bishop to g3, because I was trying to keep the h-line free for my rook.",
        "9... cxd4": "It's nice to see how the mind of a higher-rated player works.. If I was in Stalhandske's place, I would've played something like 9. ... Bg6, followed by castling kingside. But my opponent is choosing for a straightforward battle, no time to loose ! Interesting !! ",
        "10. exd4": "Both 10. exd4 and 10. Nxd4 were going to the same result.",
        "10... Nd5": "This move came as a surprise. My first thought was black would go for a 10. ... Nxd4 11. Nxd4 Qxd4-move, with the win of a pawn. But nevertheless, the pawn can still be taken ! And now, he has pressure with Nc3 ! ",
        "11. Nc4": "Gaining a little bit extra time and space, by attacking black's queen. Surely he can come with a check on b4, but since then, I could be leaving my cramped position.. ",
        "11... Qb4+ 12. Qd2": "Offering a trade of queens. If 12. ... Qxd2+ 13. Kxd2 and the c3-square would be under my control (but for how long ??).",
        "12... Bg7": "Sure, no need to hurry. He leaves the choice to white. But I can't comfortably take on b4: 13. Qxb4 Ndxb4 and both the c2- and d4-square are attacked twice ! ",
        "13. Bd3": "Probably not the best move.. But by now, around move 10-20, I'm falling empty regarding new idea's. Let's say the middle-game isn't my best phase of the game. ",
        "13... Bxd3": "Forced moves.. ",
        "14. Qxb4 Ndxb4 15. cxd3 Nc2+": "Ow yes sir ! Maybe I've should've castled earlier, but when ? ",
        "16. Kd2": "16. Ke2 Nc6xd4+ 17. Nxd4 Bxd4 and things are getting depressing for white.. With the textmove, the only advantage I'm having is I'm not in check, when black takes on d4. ",
        "16... Nxa1 17. Rxa1 Kd7": "How further the game is elapsing, the better it is to give the king a more central position !",
        "18. Re1": "I wanted to have my rook out of the a1-h8-diagonal, and giving him some things to do in the center, on the semi-open e-file. ",
        "18... Nxd4": "Expected this move a few moves earlier, buth black has no hurry.. ",
        "19. Nxd4 Bxd4 20. Re2": "The idea behind this move is to play 21. f3 , and challenge black's dsb by 22. Bf2. ",
        "20... f5": "And again, the difference between higher- and lower-rated players become obvious.. First, I would've settled my rooks behind some pawns and/or open lines: 20. ... Rhe8 and 20. ... Rac8 were contenders. ",
        "21. f3": "Following my first idea.. ",
        "21... f4": "And with every move, black is gaining a lot of space ! ",
        "22. Bf2 Bxf2 23. Rxf2": "The exchange went as I wanted it to go, but by now, black possesses a whole lot of space of the board ! ",
        "23... Rac8": "Ok, black is following my move 20-idea, but only after his superior pawn-moves. ",
        "24. d4": "Making space on d3 for my king, so afterwards my rook could go to c2. I'm down the exchange, but I'm sure he has to fight for a victory ! ",
        "24... Rc7": "Getting ready to double his rooks on the c-file.. ",
        "25. Kd3 Rhc8 26. Rc2 b5": "Scaring away my knight. The only field of any importance I can go to is a3, offering the rook-exchange. ",
        "27. Na3 Rc7xc2 28. Nxc2 a5": "And again, gaining space !! I guess that's the best lesson to be learned from this game.. It's shown for a dozen times or so. So keep that in mind: \"if possible, gain space !!\" ",
        "29. a3": "So I had to stop him from playing 29. ... b4 (at least for free). If 29. ... b4, then 30. ... Rc3+ would follow, with the loss of my b-pawn.",
        "29... b4": "Again a little surprise.. My 5 cents were going to a d- and e-pawn-march.. ",
        "30. axb4 axb4 31. Nxb4": "So I accept to win a pawn ! ",
        "31... Rc1": "But now the whole puzzle is falling on it's place ! He was tempting my knight away from c2, so the rook could get on the back ranks.. Nothing I can do to prevent him taking my g-pawn ! ",
        "32. d5": "This isn't a move of big value, but for the time which was left for me, I was trying to keep at least as much place as I could afford to keep.. By now, my king has a route to get closer to the kingside-pawns. If black had the opportunity to play e6, followed by d5, my king would be stuck on the back ranks.",
        "32... Rg1 33. Ke4 Rxg2": "Actually, game over.. 33. ... Rg3 and 34. ... Rxh3 are the next moves.. ",
        "34. Nd3": "I've played a little bit further, just to see how my opponent would finish this game.. \nWith this knight-move, my b-pawn is saved for a little while. ",
        "34... Re2+": "Unexpectedly ! ",
        "35. Kd4 Re3": "Aha ! That's why my king had to go away ! Pawn f3 is dead meat , so is the h-pawn. \n\nThanks Stalhandske for this game.. It was a nice way to enter the \"Walking the Walk and Learning to Run\"-club !"
    },
    "url": "https://gameknot.com/annotation.pl/wtw-1-advancing-pawns?gm=52961",
    "gameName": "WtW 1 - Advancing pawns !",
    "players": "taufiq (1629) vs. stalhandske (2175)",
    "opening": "Queen's pawn game (A45)"
}