{
    "moves": {
        "1. e4": "So, I start with the King's Pawn Opening.",
        "1... e5": "And, he responds with the King's Pawn Game.  Like our last game, it will become a Ruy Lopez.",
        "2. Nf3 Nc6 3. Bb5 Nf6": "In this position, he is trying to develop.",
        "4. O-O": "But, that is not going to stop me from castling.  Of course, I am not implying that he wants to prevent me from doing that.  However, there is an important fact about tucking the monarch away.  According to tactical-abyss, castling is considered a developing move.  ",
        "4... a6": "And, this is how he responds.  Now, I learned that ...a6 is often played after the Ruy Lopez.  Believe it or not, GM Morphy came up with the idea because white can keep pressure, even with the loss of tempo.",
        "5. Bxc6": "This time, however, I decide to exchange.  But, according to either inadowman or elyhim, 5.Ba4 is the best response to 4...a6.  However, there is nothing wrong with this move.",
        "5... dxc6 6. d4": "In this position, I either want to exchange pawns or get my DSB out to pin his Knight.  In this game, I am not interested in playing a fianchetto.  When, I talked to my mentor about a fianchetto, he asked me why.  I told him that I was instructed to fianchetto, as much as, possible by Jack Stockel.  After my game against the Master Mater, my opponent said, \"There is only certain systems where a fianchetto is a good move. It's almost never good on white unless you are doing a King's Indian Attack, or playing against a King's Indian defense. When I look at that game against Freddy, you did the same thing against me. You tried to take your bishop away from my attack which is nonsense. On black, they fianchetto in Sicilian Dragons, Benoni, King's Indian Defense, and maybe a Ruy Lopez. They do this because it is the only way to develop the bishop quickly and such. I can show you a million games where the original line the bishop is on aids in a attack of the king. At your level you should be looking at the basics; not playing higher level moves that are very situational. It's not practical, and you can't improve without learning attacking. When you look at games you play against Freddy and I how much fianchettos does we do on white? I bet you won't come across to many because it just isn't as good. On black, you'll only see use do it in specific systems. Chess is situational, and you can't finite your moves because that's how you were taught. There is a time and a place for everything. There is a correlation to what I taught you. You have to have a good reason to make your moves, and your reasons for the fianchetto is never a good one. \"  ",
        "6... exd4": "So, my opponent decides to accept the exchange.",
        "7. Nxd4 Bc5": "At this point, he is trying to win my N.  But, \"I cannot allow that\", as Jack Stockel would say.",
        "8. Be3": "Therefore, I have to protect it.  2.c3 was also possible, but I don't like it as well.  Why? Advancing my c pawn will give my b1 N less room to develop.  It's kind of crammed, if you were to play Nd2, as opposed to, Nc3.  And, Na3 places it on the rim.  Therefore, I protect with my DSB, as opposed to, pinning his Knight.",
        "8... Qe7": "I understand the logic behind this move.  Normally, it's considered too early to bring the Q out, at this time.  But, in this position, he is trying to win my e4 pawn, and I cannot drive his piece away.  Therefore, I have to figure a way to protect my P.",
        "9. Nc3": "It took me some time to figure things out, but this is White's best move, as it turns out.  The reason being is that 9.f3 places a whole around my K.  However, I do not want to do that, unless it is absolutely necessary, and 9.Qd3 is ineffective.  That's because he can still capture my e4 pawn, and I can't take back, due to his f6 N.  This move, however, defends, and I do not have to worry about anything.  In fact, it is another developing move, so you basically get the best of both worlds. ",
        "9... O-O": "In the meantime, my opponent decides to castle.  I'm just surprised that he did not do this earlier.  ",
        "10. Nf5": "? After he castles, I decide to kick his Q.  I felt that he did not develop properly, so I wanted to gain tempii from him.  However, this is my first blunder.  I subconciensly placed my N in a spot, where it's directly attacked by his LSB.  ",
        "10... Bxf5 11. exf5 Bxe3": "In this position, best is to take back with 12.fxe3.",
        "12. Na4": "?? Of course, I don't recapture.  That's because taking back will put a hole around my K and I remember my first game against dmaestro.  What happened?  I opened my K by moving a pawn right near it.  Believe it or not, that was the losing blunder, so I did not want to make the same mistake again.  In a different annotation, however, l-d-j said that, \"material is more important than king safety.\"  In that, this move is a serious blunder, as it gives away a free piece.",
        "12... Rad8": "After making the decision, he decides to kick my Q.",
        "13. Qe1": "Normally, that's not a problem because I just pull it away.  But, there is a little more to this then meets the eye.",
        "13... Bc5": " ",
        "14. Qxe7": "Of course, I should have retreated to 14.Qc1 or 14.Qb1, but I was only thinking about exchanging.  The problem is, however, that I'm down in material.  When you're behind, it's generally a bad idea to exchange, but I forgot that, in this game.",
        "14... Bxe7 15. Rfe1": "At this point, I decide to bring my rooks together.  BTW, I have no intention of winning his DSB.  Instead, I want to activate and mobilize the Rooks, and this accomplishes my goal.",
        "15... Rfe8": "Of course, he has no choice but to protect his B.",
        "16. c3": "?? In this position, I am only interested in promoting a pawn, but he is not going to allow that.",
        "16... b5": "Instead, I just gave away another piece which is why I marked 16.c3 with two question marks.  Now, I thought that I had a place to retreat my N, but it's too little, too late.  It is gone, after 17...Bxc5.",
        "17. Nc5 Bxc5 18. b4": "However, I thought that I could win something back, after he decided to take.  But, that is not the case because he finds a place to retreat his B.  Of course, I will try just about anything because I am aware that he has a winning edge.",
        "18... Bb6 19. Rxe8+": "After he retreats, however, I decide to exchange.  This is not a good choice, but I thought that I could win something back after we exchanged rooks.  But, how is that going to happen?  He has ways around that, so I miscalulated.  When I talk about miscalulations, I mean that I plan ahead, but in an inaccurate matter.  It does, however, have the same consequences of not thinking ahead.  When you make the plans and patterns, you want to be completely accurate, or it could mean disaster.  Unfortunately, disaster will strike, later on.",
        "19... Rxe8 20. a4": "So, I am still interested in winning material, but he will prevent that.",
        "20... Re2": "?! Ok, I don't why he moved here.  But, I feel that it's pointless because it doesn't achieve anything.  As far as I'm concerned, he does not have a good reason for this move.",
        "21. Rd1": "? Therefore, I do not hesitate to make this choice.  Of course, I did not want to play 21.axb3 for two reasons.  First, it's usually a bad idea to exchange when you're behind.  Second, if 21.axb5, 21...cxb5, so he eliminates his doubled pawns.  Now, Jack Stockel told me that it's generally a bad idea to allow your opponent to get rid of his or her doubled pawns because it usually gives him or her an edge.  However, I am now in worse shape becuase this move gives away a free pawn, after 21...bxa4.",
        "21... bxa4 22. Rd8+": "Because I know that the game is now lost, I don't resign right away.  Instead, I decide to place him in check, at once.  Afterall, I do not have any more to lose since I do not stand a chance.  My goal is to pull a swindle.  But, I am not going to be successful, especially against one of my mentors.",
        "22... Re8": "Of course, this is how he gets out of check, as I predicted.",
        "23. Rxe8+": "Therefore, I try to catch him off guard by taking his R.  At first, I thought that I had some compensation by winning this piece.  However, I did not realize that he could retake with his N, so this becomes an even exchange.  Consequently, I have no way to compensate for lost material.  But, I was willing to try because of what I mentioned, on my last move.",
        "23... Nxe8 24. c4": "In the meantime, I am still interested in promoting.",
        "24... a3": "But, so is he.",
        "25. c5": "So, I decide to keep pushing my pawn.",
        "25... a2": "At this point, I realize that he is going to promote, and there is nothing that I can do about that.  Therefore, I resigned.  After this game, myevilluck told me that I played quite well.  He said that I should be able to make significant improvements in my games.  And, he would be disappointed, if I could not.  Then, I solved the mystery by telling him that I have problems with consistency.  Afterall, this is my main weak area.  It's because I remember everything in one game but forget all of them in the next game, so it goes back and forth.  After that, he told me that paying attention is the solution.  If I pay better attention, my rating should easily reach 1400.  Why?  I know too much information for my rating to stay like this.  In that, the moral of this story is to focus and concentrate on the game because all of the positions are extremely important. "
    },
    "url": "https://gameknot.com/annotation.pl/wtw-mentoring-game-paying-attention?gm=50157",
    "gameName": "WTW Mentoring Game-Paying Attention",
    "players": "jkarp (1159) vs. myevilluck (2117)",
    "opening": "Ruy Lopez (C65), Berlin defence, 4.O-O"
}