{
    "moves": {
        "1. d4 Nf6 2. c4 e6 3. Nc3 c5 4. d5 exd5 5. cxd5 d6 6. Nf3": "Not the most common move but good as well.",
        "6... g6": "main line",
        "7. e4 Bg7 8. Be3": "Quiet variation.",
        "8... O-O": "Main line.",
        "9. Bc4 Re8": "The most logical move",
        "10. Qd3": "A doubtfull move but I cannot exactly explain why I think so. Anyway, the queen is rather exposed and has little space available if attacked.",
        "10... a6": "Black's plan is to attack on the queenside. It prepares b5.",
        "11. Bb3": "To avoid the menace of b5",
        "11... b5": "Now white is in trouble for black can attack wether by 12. ... c4, taking the LSB or by 12.b4, menacing the c knight. If 13. Nd1 Nxe4. Maybe white opts for 12. Nxb5 axb5 13. Qxb5 and white is only one pawn down... but white's e pawn hangs.",
        "12. Bc2": "White chooses to retreat the bishop",
        "12... c4": "Another candidate move was b4 but I prefered to menace the queen because the c knight is already block and I'm planning to attack e4 as soon as possible.",
        "13. Qe2 Nbd7": "developping",
        "14. Rb1": "I do not see the point of this move. May be to prepare 15. b3",
        "14... Ne5": "Attacking on the center",
        "15. Nxe5": "White trades",
        "15... Rxe5 16. f4": "Obliging black to drawback but the e4 pawn loses one potential protection and, in case of a castle, the white king will be weaker",
        "16... Re7 17. f5": "White attacks the kingside.",
        "17... Bxf5": "White has king and queen on the same line and black has a rook in front. If white takes, black only has to attack the DSB wether by Ng4 or by Bd4 and white will be in great trouble, so that this positionnal sacrifice seemed good. Anyway, I had no proper place for the LSB",
        "18. exf5": "White (mis)takes.",
        "18... Qe8 19. Kd2": "Now white cannot castle anylonger but it protects the bishop, drives the king out of the dangerous line and joins the 2 rooks.",
        "19... Re5": "Menacing the d5 pawn",
        "20. fxg6": "Not dangerous for black but allowing the h rok to come on f1.",
        "20... hxg6": "May be 20. fxg6 would have been better (opening the f file for rook or queen) but, even with a better position, I didn't felt sure enough of myself to risk it (because of the late in material)",
        "21. Qf3": "To protect the d pawn.",
        "21... b4": "Now, I see a tactic which leads to a mate.",
        "22. Na4": "Saving the knight",
        "22... Nxd5": "menacing the DSB and, controling c3. White cannot repel both menaces",
        "23. Rbe1": "White protects the DSB",
        "23... c3+": "I believe that white is doomed now.",
        "24. bxc3": "trading",
        "24... bxc3+": "If 25. Nxc3 Nxc3 26. Kxc3 Rf5+ 27.... Rxf3 and white has lost his queen.",
        "25. Kd3": "White sees the danger and moves his king to save his queen. If 25. Kd1 Nxe3+  if 25. Ke2 Rxe3+ if 25. Kc1 Nxe3",
        "25... Nb4+": "carrying on attacking.",
        "26. Kc4 Qb5+": "White makes a time out. I add the mate.\nif 27. Kb3 Nd3+ 28. Ka3 Qb4#",
        "27. Kd4 Rf5+ 28. Ke4 Qe5#": ""
    },
    "url": "https://gameknot.com/annotation.pl/wtw-modern-benoni-mini-tournament-viii?gm=50527",
    "gameName": "WtW Modern Benoni mini-tournament VIII",
    "players": "ezogelin (1607) vs. ptitroque (1736)",
    "opening": "Nimzo-Indian defence (E20)"
}