{
    "moves": {
        "1. e4 e5 2. Nf3": "Everything is standard.",
        "2... Nf6": "I could've allowed the Ruy Lopez or Guaco Piano with 2...Nc6, and after he answers with 3.Bb5, I'd stick with the Berlin Defense.  But, as noted, it's about trying different things.  In response we into a different phase of the Exchange Variation.",
        "3. Nxe5 Nxe4": "?? But, this is the first blunder.  As now, he is going to win a piece.  Much better was to go out of book and pin his Ne5 with 4...Qe7.  Then, he's forced to defend with 5.Qe2.  Afterwards, I'd attack again with 5...d6  The problem was that I hyperfocused (spent too much time) on trying to prevent the loss of a pawn.  In doing so, I missed the overall picture because the real threat was the win of a piece. ",
        "4. Qe2": "Threatening to win my N.",
        "4... Nf6": "?? Figuring that it could still be defended, I pull back.  This, however, is the losing blunder, as now he will win my Queen for a Knight with his next move.  Although I don't like anything tied down or pinned, much better was 5.Be7  First, it develops.  More importantly, however, is that it was the only way to prevent the ruinous loss of material, and thus, stay in.  However, because of the Supplemental Talking the Talk Rules, resignation is out of the question.  One of the ideas is seeing how last I'll without the Queen.  And, I do quite well, regardless.",
        "5. Nc6+ Qe7 6. Nxe7 Bxe7 7. d4": "Opening up lines for his Bc1.",
        "7... Nc6": "Given that his already a lost position, I don't care.  Instead, I'll just keeping digging out my bag of chess quotes for the rest of the game, as opposed to, trying to see the overall picture.  Or, another way of saying it is figuring the entire story that the board is telling me.  In general, I'll follow bhidragon's advice since he told me not to do it.  But, as teardrop34 noted, you have to take into account when the advice works or not since I mentioned about if N or B was worth more based on TA's advice.  If this were level, it'd be one thing.  But, since I'm lost, I decided that what bhidragon told me, in our last game, does not work here.  Therefore, my play will, solely be guided by chess bits and wisdom until I'm forced to resign.  And, that is also how I lasted, as long as, I did here.",
        "8. Qd1": "My plan was advancing my d7 playing followed by ...Bg4 to win his Queen.  And, if he stopped that with f3 and I had to pull back, plan B would be castling, and then, putting pressure onto his c2 with ....Bf5",
        "8... O-O": "With that being said, I decided to castle as the idea is getting the K to safety.",
        "9. Be2": "He continues with his development.",
        "9... Re8": "And, I centralize my Rook since the idea is having one of them in the center.",
        "10. O-O": "Like me, he also castles.",
        "10... d5": "Since the focus is chess quotes I advance the other center pawn as this will enable to complete my development on the next move.",
        "11. a3": "Preventing me from 11...Nb4, but it's of no concern to me since I was not going to play that one way or another.",
        "11... Bf5": "Instead, I follow up on my earlier plan.  Not only have I completed my development, but I've put that pressure on his c2 pawn since my LSB is well placed.",
        "12. g4": "Attacking my Bf5.",
        "12... Be6": "So, I defend.",
        "13. Nc3": "And, he continues with his development.",
        "13... Nxd4": "?? Figuring that he made a mistake and missed something that the board was telling him, I took.  But, I was the one that missed it, as because I overlooked that white's d4 was defended by his Queen.  In doing so, I lose another piece.  But, as noted, resignation is not an option, yet.",
        "14. Qxd4 c5": "I do this for thrills and giggles of gaining tempo.  As anticipated, it works since it must be protected.  My attitude is that this will also help me last those 36 moves because, even though he's going to win.  I'm making things, as difficult as, possible for him since I'll continue to do these one move attacks against him.  Even if they don't work, I've got nothing to lose here. ",
        "15. Qd3 c4": "With that being said, I reattack his Queen.  And, as noted before, he must protect.",
        "16. Qd1 Rad8": "As I then use that time to centralize my other Rook since both are in the center.",
        "17. Nb5": "Bringing his N to a better out post.",
        "17... Bd7": "But, this move shows that I don't care since it's attacked.",
        "18. Be3": "Completing his development.",
        "18... Bxb5": "In general, when stronger players give things away, you should ask why.  In general, I agree that, \"To take is a mistake\" especially against someone of this strength.  Like with the chess bits and wisdoms, as opposed to, the overall picture, that quote does not apply to me either for the same reason.  My model is when you're lost, you might as well try anything.  And, I go back to what I originally thought, based on what's outlined by TA and redfoxrising, even if were not a WTW game.  Don't give up.  And, not resigning is why I'm not following other advice, which is in general, important.  And, it's also why I have the attitude that things which should normally be done doesn't matter.  As now, I'm feeling more and more confident.  One thing for sure is that it's lost, I'll admit that.  But, I'm confident with the fact that, at the very least I'll tie, and could possibly, break the record, in terms of, how long I'll last, which is my goal here.  As lasting longer also shows improvement since it's something that easy19 emphasized which is one of the few things that I deem to be applicable.",
        "19. Bxa7": "Not surprised to see this played.",
        "19... Rda8": "So, I attack his Ba7.  Once again, it gains tempo since he must retreat, anyhow which is something I kept in mind.  In fact, I'd anticipated 19.Bxa7, after having had played 18...Bxb5 because my plan was that he'd capture, which would enable this move and for the same reason.  But, the real plan behind this one move attack is because of what's coming.",
        "20. Bd4 Ba4": "Which is this move, as now, his c2 is pinned.",
        "21. b3": "Believe it or not, I had anticipated and also planned for this move.",
        "21... cxb3 22. cxb3": "And, this was also anticipated.  Sure, the pin is gone and can't tempo for now, but part of the plan behind this was not directly (since I don't take over a week) but it's indirectly stalling a lost game.  In this context, stalling does not mean taking more time, but simply delaying it.  My take is to do just the one move attacks.  When he breaks the real plan, I'm still going and haven't been defeated.  It's not about being, \"Mr. Know it all\" as some might think.  But, it's still boils down to how much longer I'll last.  So far, I'm doing better then expected.  Initially, I thought I'd only survive 25 moves, but mate is not in sight, yet.  In fact, I also keep in mind that it'll take much longer for white to have a mate.",
        "22... Bc6 23. b4": "Getting a solid pawn chain.",
        "23... Bd8": "So, I decide to put some pressure on his Be2.",
        "24. a4": "Adding to his pawn chain which is, in general, useful in endgames.",
        "24... Ne4": "So, I decide to do something similar to Hope Chess.  It's not because there's no threat that I'm hoping to counter without calculation.  Instead, I'm hoping to create a threat against him, even if, it's easy to drive off.  My long term plan is trying to find a way to drive off his DSB from the d4 diagonal to enable ...Bh4 threatening to win his Rook for Bishop since the threat is ...Bf2+",
        "25. a5": "Given that I can't get his Bd4 off of that diagonal, and that, he's advanced the a pawn, I realized that it won't work. ",
        "25... Be7": "So, I hit his b4.",
        "26. b5": "Which he defends by reattacking.",
        "26... Bd7": "So, I defend.",
        "27. a6": "Threatening to exchange, at once.  I would've taken that bait, but he has semi open file.  However, his Ra1 does not appear too mobile, and I'd like to keep it that way.  Therefore, I don't want to chance him taking back the Rook.",
        "27... Bc8": "? So, I add a defender, instead.  That, however, was a mistake as white will take advantage of his passer on the next move.",
        "28. a7 Be6": "So, I align my Bishops in the center.",
        "29. b6": "Adding to his passer, though.  However, I'm not intimidated since I don't see a forced mate, yet.  Plus, I'm going to leave my Rook on a8, so that his passed pawn cannot advance further.",
        "29... Bd8": "With that being said, I try to come up with a plan to win his b6.",
        "30. Bb5": "Doesn't hold out because of this threat, which I'm now forced to defend against.",
        "30... Re7 31. Re1": "Putting pressure on his Ne4.",
        "31... Ng5": "Once again, it's of no concern since my N isn't pinned.  Plus, I have the same attitude of just trying to last, as long as, possible.",
        "32. Bc5": "Attacking my Rook.  But, this time, however, it cannot be defended.",
        "32... Bxg4": "Therefore, I prevent the loss of a Rook for Bishop by giving Bishop for pawn.  Same values, except that I felt that my Rook was more mobile.  So, I didn't want the material win to involve the piece that's more mobile.  Since my LSB was semi cramped, I decided to let him have that, instead.",
        "33. Qxg4 Rxe1+ 34. Rxe1 Ne6": "Still determined to hang in there, I attack his Bc5.",
        "35. Rxe6": "But, this time, he takes.",
        "35... fxe6": "Normally, I would not have recaptured since, \"To take is a mistake.\"  But, as noted before, I was not going to apply it here because there's nothing else to learn.  Even if I didn't take, he'd mate.  The other reason for taking back was to prevent 36.Re8#  Though looking at it, I might have lasted a little longer, and would therefore, have broken the record.  But, it's perfectly because as noted in the intro, I last another move which still ties the record.  It's pretty good that it did this well against a non otb runner.",
        "36. Qxe6+": "And, I resigned here because 36...Kh8 is forced, and then, he has 37...Qe8#  The main way that I went wrong was by blundering my Queen early.  But, what I learned is that even though you have to listen to advice and not be pompous by getting out of your comfort zone, there's also, as teardrop noted, times where helpful advice does not apply.  The perfect example was after the Q blunder as I completely ignored what I was told for years which was looking at the overall picture and not taking just because you can.  Although I went overboard with the Rook, by taking and constantly showing the chess bits and wisdoms (going into one my largest bags of chess quotes ever) I wound up playing better then expected.  In fact, I tied the record for how long I lasted against someone of stronger opposition."
    },
    "url": "https://gameknot.com/annotation.pl/wtw-reversions-open-fire?gm=61311",
    "gameName": "WTW-Reversion's Open Fire!",
    "players": "lacinko (2205) vs. jkarp (1350)",
    "opening": "Petrov (C42), Damiano variation"
}