{
    "moves": {
        "1. e4 e5 2. Nf3 Nc6 3. Nc3": "Normally, I'd play the Ruy Lopez, but I following reversion's advise of trying things different.  Afterall, this is why he wanted the tourney.  The idea being is that 1.e4, e5 and 1.e4, c5 are my main openings.  So, the idea is learning through different moves.  Therefore, although rare, I answer with the 2 Knights Opening.",
        "3... Nf6": "This has now become the Four Knights Defense.",
        "4. Bb5": "Now, I play it, as though, it were the Ruy Lopez.",
        "4... Bc5": "I understand why he brought the N out but don't know why he didn't play 4...Bb5  At that point, I wouldn't know what to do. ",
        "5. O-O": "Generally speaking, ...Bc5?! is considered an inaccuracy because white can generally follow through on the c2-d4 which is c3, and then, d4.  But, in the context of this game, that is not possible due to my Nc3 blocking my c pawn.  So, I castle, instead, which is the thing I like to do early, anyhow.",
        "5... O-O": "He has the same idea in mind.  However, I'm going to take on e5.  Normally, I don't because the original idea was just to double his pawns.  And, in the Ruy Lopez, it's considered not very effective.  But, I took here because, when he takes back, I will get a pawn, this time around.",
        "6. Bxc6 dxc6 7. Nxe5 Re8": "At first, I thought that he was trying to win my pawn.  But, I quickly realized that it's defended by my Nc3.",
        "8. Nd3": "?! So, I reattack, in the process.  But, this is an inaccuracy, as he goes after my Queen, in return.  Afterwhich, I have no idea what to do.",
        "8... Bg4 9. Qe1 Bd4": "I thought that he was trying to exchange my Nc3 for B.  That is what he wants, afterall.  I decline to avoid having doubled pawns forgetting a lesson from TA.  Turns out that doubled pawns would not have been of an asset here.  The big picture is that he wants because if I accept it, black will win back a pawn with ...Nxe4, since my Nc3 is no longer around, and due to his Re8, I would not be able to recapture.  I find that out on the next move.",
        "10. Ne2": "? Not only does he get the pawn back, but by playing this, he will be able to tie down my Ne2, in the process which leaves in rough shape.  One thing you don't want is your own pieces restricted, like this.  Much better was to accept the exchange, and yes, it's where hyperfocusing on the small things becomes costly. ",
        "10... Rxe4 11. c3": "?? If my f2 weren't pinned, I would've played 11.f3 to pin his Bg4 and Re4.  Since it is, I try to come up with something different by attacking his Bd4.  This, however, is the losing blunder, as now, black will win a piece, without compensation due to the pinning motif.  I actually studied a similar with GM Susan Polgar in the book, \"Chess Tactics for Champions.\"  ",
        "11... Rxe2 12. Qd1": "At this point, however, I thought that I was safe.  But, that isn't so because what I overlooked is that, when he takes on f2, white has a discovered attack on my Queen.  That will, not only win a pawn, but he will force liquidation while behind.  Plus, my King will become badly exposed.",
        "12... Rxf2 13. Qb3": "Thinking that I had some fight left, I go after b7.  I thought he'd defend, anyhow, but instead, forces the liquidation, and as noted, leaves my monarch exposed.  In addition, I missed what the board was indicating, similar to my game against bhidragon.  That's because I knew his pieces were damaging, but thought that, in a sense, they were useless.  By useless, I meant that I didn't they he could use them to deliver mate, in this position.  I was planning on how to counter that.  But, his pieces are much worse then they appear.",
        "13... Rxf1+ 14. Kxf1 Ne4": "Organizing his pieces for the mate.",
        "15. cxd4": "?? This is where I really go wrong, as now, it's mate.  I knew that his B and N would work together.  But, it's not a B and N mate since I've got material to.  Without showing off, I thought that if he wanted to mate with just two pieces, black will have to try harder.  In other words, I'd have defenses when he tries.  That was also wrong because once he brings the Queen in, it's game over.",
        "15... Qxd4 16. h3": "?? Thinking that it would be, virtually, impossible to mate me right away, I kick his B since I felt that he was using for the devastating attack.  That was wrong because of...",
        "16... Ng3+": "This move.  At first, I was thinking along the same lines.  My initial thought was that once I'd get out of check, I would have some counter play.  Turns out that it isn't.  I was attempting to play through variations, but the reality is that 17.Ke1 is forced, after which 17...Qg1# is a back rank mate.  The lesson to be learned is that seeing the overall picture requires more then it looks.  It's not just thinking about what the board is telling you or thinking about what the opponent, but also, calculating through them.  For example, I must start thinking after the check, like not just ok, I have a way out.  But, something like, and yes, what happens afterwards, when getting out of check and what other pieces can be used into the fray of arrays, I guess you can say.  Had this been done, I would've played better and lasted longer."
    },
    "url": "https://gameknot.com/annotation.pl/wtw-reversions-open-fire?gm=61256",
    "gameName": "WTW-Reversion's Open Fire!",
    "players": "jkarp (1350) vs. izscha2014 (2348)",
    "opening": "Four knights (C48), Bardeleben variation"
}