{
    "moves": {
        "1. e4 e5 2. Nf3 Nc6 3. Bc4": "So, it starts off with the Guaco Piano.  That's because, as per reversions advice in the tourney to try different things.  Now, I've played the Ruy Lopez many times, and it's what I'm most used to.  But, this is the second or third time that I've played the Guaco Piano.",
        "3... Nf6": "I was wondering how he's answer, but once he played the Berlin Defense, I decided to do some of the other WTW games involving this mini tourney.",
        "4. Nc3": "Instead of sticking to main lines, I deviate.  I assume, based on what happened in my game against nuntar that he won't know what to do.  That's because it's so unusual to have 4.Nc3 played.  The most common continuation is 4.0-0, followed by, 5.Re1  But, similarly to my first game against elyhim, I want to take lacinko out of his comfort zone in order to give him more to think about.  However, he does to his next move.  So, this wasn't the best choice, as now, after 4...Bc5, I won't be able to answer with 5.c3, which as reversion told me is the most common response.  The plan with 5.c3, is that white can then play 6.d4, and this is where the pawn chain becomes a liability, as he told me in our training game.",
        "4... Bc5 5. O-O": "Since I can't push c2-c3, I for the alternative which is castling.",
        "5... d6": "Opening up a line for his Bc8.  Not sure, but I also assume that this was played for a pawn chain.  But, in this position, I don't know if it really matters.  That's because I'm thinking about what cplusplus11 said about pawn structures and where they apply.  And, that's a weakness I have is knowing the positions, in which, they become important this early.",
        "6. Re1": "So, I attempt to go back to mainlines by centralizing my Rook since Re1 is often played.",
        "6... O-O": "Meanwhile, he castles.",
        "7. Nd5": "And, keeping in mind that my e4 is safe, I attempt to exchange.  That's because I don't like his Nf6.  I ask myself what it's capable of doing and apply what apply what tactical-abyss mentioned about Knight Visualization counts.  But, unlike a previous game against Jack Stockel, it applies here that there are just 4 squares to worry about.  And, on those squares, this N would not have been concerned.  Instead, my N, which he'll take was worth more, so this was not the best move.  The plan works, but it just isn't a good plan.  That's because this is a time where I shouldn't have exchanged just for the thrills of it (being that I was previously taught to exchange often against stronger players.)  The real motif behind this was to attack his Nc6 for tempo gain.  The problem is that my LSB will be semi blocked by my pawn, and I wind up with doubled pawns in the center which is not good, in this position.  Normally, it would be ok this early, except that I'm against a much more experienced player, and therefore, need to play more accurately.",
        "7... Nxd5 8. exd5 Nd4 9. Nxd4": "But, I figured that I compensated here, for once lacinko takes back because I anticipated his next move but felt that it would block his center due to his e5.  I didn't count on the fact that it doesn't, and when he does recapture, I'm already at a disadvantage due to the lack of center control from white.",
        "9... Bxd4 10. c3": "? This is where I start to go wrong.  Come to think of it, the idea behind this move was the same as what we saw with Jack Stockel.  It was to kick his Bishop for tempo gain.  And, I wish this game happened after the loss against Jack as I wouldn't have thought this way.  It happened before being given advice from archduke_piccolo and cplusplus11.  The problem here is that his Bd4 is in the center which is where we want it to be.  By playing this, it gets out of the center, and then, my monarch winds up exposed.  Best was 10.Qf3, as now, I have added protection to my Kg1, which is directly under attack with his forces.",
        "10... Bxf2+ 11. Kxf2": "And, the reason for giving me a piece for pawn is due to the monarch being exposed which puts me in rough shape, especially with what will happen on the next move.  In fact, this isn't a real gambit because he gets back a piece, and I'm at a big disadvantage with what was noted.",
        "11... Qh4+ 12. Kg1": "I considered 12.g3, but trying to last, as long as, possible, at this point, I didn't want to lose a pawn.  So, this prevents him from playing 12...Qxh2+.  But, there's something much bigger then this move which is my Bc8 which puts me down a pawn, anyhow.  In other words, I can't prevent the loss of a pawn.",
        "12... Qxc4 13. Qf3": "Protecting my d5.",
        "13... Bg4": "Attacking my Queen.",
        "14. Qe4": "Which I protect, as well as, d5.  The downside is that he'll liquidate, when I'm behind.  But, that's better then losing another pawn, without compensation.  ",
        "14... Qxe4 15. Rxe4": "I also kept in mind that, after exchanging, his Bg4 is attacked.  However, that's not the reason for taking back.  If it were, I'd, most likely, not play it.  It was about doing what I had to prevent the loss of material.",
        "15... f5": "Protecting his Bg4, whilst, counterattacking.",
        "16. Re1": "So, I protect.",
        "16... f4": "Trying to get a passed pawn.  If successful, a promotion would be impossible.",
        "17. h3": "Which I, temporarely, stop by attacking his Bg4.",
        "17... f3": "But, he advances, anyway.  Now, I thought about and almost took his Bg4.  Except that, \"To take is a mistake\" here.  That's because I almost overlooked what would've happened, had I played 18.hxg4, which was something cplusplus11 mentioned in reachforgoals annotation about playing through those variations.  And, it is not only critical to prevent blunder because, I recently discovered that it's also part of thinking steps ahead.  But, if I taken, I had to think about what happens after 18...f2+, as I was thinking along the lines of 19.Kxf2  The problem is that it's not possible due to being an illegal move.  This is due to his Rf8, which means that 19.Kh2 is needed to prevent mate, but he promotes and win's a Rook without compensation, anyhow, with 19...fxe1=Q which would be enough to resign.  And, the real idea is how to save the position which I'm not ignoring but am still in some trouble because, despite not being a passer, his f3 is dangerous.  As I've learned, you don't need a passer for a pawn to be dangerous.  Back in the day, I only thought they were dangerous, if we were talking about a passed pawn, but pawns like this can also be very problematic.",
        "18. gxf3": "So, I take before he can do any damage.",
        "18... Bxf3": "And, he takes back.",
        "19. Kh2": "? Now, I follow a tactic that I learned about from GM Susan Polgar about endgames, which I also learned in some of those complicated mates that we know about.  The idea is triangulation, and moving the monarch in a triangle since this is an endgame.  The idea is here, and then on g3.  So, traveling from g1-g3 is part of the triangulation method, and you generally associate with trigonometry which comes to mind since the position is complicated for white.  However, this is a mistake as I'm about to lose another pawn.  Much better was 19.c4.",
        "19... Bxd5 20. b3": "?? And, this is where I decide to fianchetto my Bc1.  But, I missed the overall picture, as now, he has a mating sequence against me.  I didn't know that, until the 21st move, but the game is now lost for white. 20.Re2 was the only way to save this position, and if he answered with 20...Bf3, I'd respond with 21.Rf8, with the idea being to exchange his more active Rf8 for my less active Re1.",
        "20... Rf2+ 21. Kg3": "I figured, however, that I'd gotten out of trouble here because it appeared that 20...Rf2+ was a nuicanse.  This is where I learned that it's serious and leads to mate.  ",
        "21... Rg2+ 22. Kh4 g5+ 23. Kh5 Bf3+": "And, I resigned here because it's mate in two.  For one thing, my only options are 24.Kh4, or 24.Kh6.  After that, black answers with 24...Rf8 and now my monarch is pinned so that it can't get out danger, which means that he'll use his Ra8 to mate on h4 or h6."
    },
    "url": "https://gameknot.com/annotation.pl/wtw-reversions-open-fire?gm=60921",
    "gameName": "WTW-Reversion's Open Fire!",
    "players": "jkarp (1355) vs. lacinko (2183)",
    "opening": "Two knights defence (C55)"
}