{
    "moves": {
        "1. e4 e5 2. Nf3": "So, I play my usual, after 1...e5.",
        "2... Nc6": "Wasn't sure how he'd respond to 2.Nf3, but after playing, I stick with my norm by answering with the Ruy Lopez.",
        "3. Bb5 Nf6": "Threatening e4.",
        "4. O-O": "I also could've deviated from the mainlines with 4.Nc3 since that nuntar had to struggle, after being caught off guard.  However, a thought came to mind that Tim might have studied some of my past games.  If, that's true and he saw 4.Nc3 played, my opponent would know how to answer, after which, I'd be in worse shape.  Well, I wasn't going to take chances so the idea, as elyhim puts it, \"Stick with what you know.\"  Since I read those comments in my annotation against Jack Stockel, I know what to do, when he takes.  ",
        "4... Nxe4 5. Re1": "That is centralizing my Rook right then and there.  Not only gaining tempo, but with this, I win back a pawn.  And, when Tim takes, I'll take back and place him in check.  I'm in the long run, attempting to pin his DSB, since 7...Be7 will be forced.",
        "5... Nd6 6. Nxe5 Nxe5 7. Rxe5+ Be7 8. Ba4": "It might appear so, but I was not worried here.  I could've developed my Nb1, with the idea of exchanging.  However, kenneth_fiore_3 told me that it's generally not a good idea to exchange against a stronger player just to develop.  And, as noted in milly64's WTW annotation, it's important to evaluate the position.  So, it boils down to open v. closed positions.  But, because of what Ken noted, I know the difference.  And, without any pawns surrounding my LSB, this is, indeed, an open position.  Therefore, it's better not to exchange.  Given that, I decide that it's important to deviate by moving back.",
        "8... O-O": "Meanwhile, Tim castles.",
        "9. Re1": "Despite not wanting to move the same piece more then once in the opening, I remember what happened in my training game with reversion.  Since Be7 is no longer pinned, he could attack with ...Bf6 or ...f6, after which, he could reattack.  To avoid complications, I move back.  But, the idea behind this is after being safe, I'll use that time to develop another piece.  ",
        "9... Nf5": "I'm not sure he played this or see the point here.  There's no threat.  So, as far as I'm concerned, this is a waste of tempo.  Therefore, I'll use that time to continue with my development.",
        "10. Nc3 d5": "Advancing a central pawn, but the idea is opening up a line for his Bc8.  However, there's more to this then meets the eye, as he is threatening my Nc3.  Therefore, his plan is to play 10...Nd4 which would cost me more time since I'd be force to retreat.  Then, he'd complete his development and get a lead in center control.",
        "11. d4": "So, I put a stop a to his d5.  And, my idea is also to develop my Bc1, as we're about to see.",
        "11... c6": "Getting a pawn chain which is another common theme in chess.  ",
        "12. Bd2": "But, that does not bother me, as my development is now complete.",
        "12... a5": "Tim's plan is 12...b5, and after 13.Bb3 (to protect my LSB), he hits again with 13...b4, which would result in the loss of two tempii.  Not only that, but his chain on a and b files would be more nasty.",
        "13. Bb3": "So, I prevent that.",
        "13... Bd6": "I also did not understand the point of this move, so my inference is that he was threatening to expose my King.  The idea is having to open up to prevent mate since his Bd6 is on the b8 to h2 line.  As now, h2 is a potential target.",
        "14. Be3": "Although kenneth_fiore_3 told me to forget about hope chess, it's very applicable here because I'm hoping to counter the threat, without any calculation.  Since this was a closed position, with my DSB blocked by my Nc3, his Nf5 is worth more.  I'm hoping that he'll exchange, which would, be to my advantage.",
        "14... Qh4": "But, Tim played the move that I was worried about.",
        "15. g3": "?? To show the world what I was made of, I kicked his Queen.  I figured that black waisted time with the threat.  But, that attitude is the costly mistake.  With his next move, I'm now in trouble.  Best was 15.h3, to prevent what's coming.",
        "15... Qh3": "As now, Tim has a real threat that will prove to be overwhelming.  So, 13...Bd6 was more damaging then I could've imagined.  I was calculating lines on how it appeared to be disputed, but it was more important to see the big picture, as emphasized by bhidragon.",
        "16. Bf4": "?? Knowing how difficult the position has become, I attempt to swap off bishops.  But, this loses due to his next move.  Best was 16.Bg5",
        "16... Nh4": "But, Tim declines with this move because, if I take, he mates on g2.  I'd rather not take his Nh4 because it leaves my monarch exposed, but there's no choice, in this position as it's the only way to prevent mate.  And, when that happens, I get in worse trouble.  That's how white is dead.",
        "17. gxh4 Bxf4": "As now, I looked at other options.  I asked myself what could be done to prevent mate, aside from, giving up my Queen.  As it turns out, there's no option.  Anything else will result checkmate.",
        "18. Qd3": "But, I did not know that, until his next move.  I figured that this was the only other alternative because if he takes, I'll recapture the Queen.  I also calculated an outpost, after 18...Qxh2+, 19.Kf1, Qh1+  But, this would've happened regardless.  I had to play 18.Qf3, and accept the loss because of what's about to unfold with a mate in 4.",
        "18... Bxh2+": "What came to mind, though, was 18...Qxh2+, after which I'd easily get out.  That's why I also figured that 18.Qd3 was the other option.  But, checking this way is where that discovery started.  Yet, I had no idea that mate is inevitable.",
        "19. Kh1 Bg3+ 20. Kg1 Qh2+": "But, that changed here.  Like with my loss against bhidragon, I calculated what could be done.  I know that 21.Kf1 is forced but (originally) anticipated 21...Qh1+, after which, I'd answer with 22.Ke2.  However, I soon figured out that his next would be 21...Qxf2# which is mate.  Knowing this, I resigned.  With that I learn something else which has to do with attitude adjustment.  Part of seeing the big picture is trying to see the point of every move.  In other words, before this loss happened, I thought a lot of Tim's moves were pointless.  But, that's not true since they proved to be disastrous.  So, when you don't see the point behind certain moves, it's important to calculate where he or she is getting at and what they accomplish.  After which, that's when one can figure what's going on, in that position, and the best way to respond. "
    },
    "url": "https://gameknot.com/annotation.pl/wtw-reversions-open-fire?gm=60640",
    "gameName": "WTW-Reversion's Open Fire!",
    "players": "jkarp (1356) vs. oddlord (2198)",
    "opening": "Ruy Lopez (C67), Berlin defence, open variation"
}