{
    "moves": {
        "1. e4": "I didn't know how Sasha was going to open.  All I knew was that she defeated stalhandske, which you don't see often.  And, what she did in response to Joann's opening.  ",
        "1... c5": "Not surprisingly, Julio answered with the Sicilian Defense.  It is my favorite defense, but I know that easy-win also plays this a lot because he's played it against me, as well.",
        "2. Nf3": "Of course, there was always the option of the Open or Closed Sicilian.  Sasha chose the Open Variation which is also what I do.",
        "2... e6": "But, I am surprised to see this played.  I expected 2...d6 which is what I do, as then I play the Sicilian Nadjorf since it continues with 3.d4 cxd4 4.Nxd4 Nf6 5.Nc3 a6.",
        "3. d4": "In contrast to what I posted above, this is what I also would've played.  And, it's just the fact that black advanced his pawn one square.  Since it works, I'd just treat as if it were the first move, and black only advanced the pawn one square.  As d4 is the most common reply.",
        "3... Nf6": "I was not surprised to see Julio developing.",
        "4. e5": "I would've pinned with 4.Bg5 first.  But, I like this move better because instead of breaking it passively, which is what I do, black could do it aggressively with 4...h6.  And, I learned that taking a more aggressive approach to breaking a pin is usually better in a training game with kenneth_fiore_3.  But, this gives Sasha a tempo right away since Julio will be busy defending.",
        "4... Nd5": "Protecting his N and avoiding exchanges, but it's going to give Sasha another tempo.",
        "5. c4 Nb4 6. dxc5": "And, Sasha exchanges right away since it was her center pawn.  This gives brings her closer to controlling the center.  Plus, it will give her, yet, another tempo when all is said and done.",
        "6... Bxc5 7. a3 Nb4c6 8. Nc3": "Meanwhile, Sasha continues with her development.",
        "8... O-O": "And, this is also what I would've played as black.  Since I try to castle, ASAP.  In fact, that's one reason that I still play the Spanish Opening, as opposed to, the Guaco Piano.  The thing I don't like is after 3.Bb5, black can play 3...a6 which forces white to exchange N for B.  But, if black plays the Berlin Defense with 3...Nf6, 4.0-0 is the most common move.",
        "9. Bd3": "In the meantime, Sasha is preparing to do the same thing by continuing with her development.",
        "9... f6": "On the other hand, I don't like this move.  In fact, I don't know why Julio played this, but it leaves his K vulnerable to exposure after Sasha exchanges since this is his weakest pawn on the chess board.  Instead, I would've fianchettoed with 9...b6 to allow 10...Bb7.  ",
        "10. exf6 Qxf6 11. Ne4": "As one example of my last post, the Q is forced which allows Sasha to complete her development at once, whereas, Julio still has 2 pieces undeveloped.  And, she'll take advantage of that to attack his Q, again.  In return, blacks K will, officially, be exposed.",
        "11... Qe7 12. Bg5 Bxf2+": "?? Julio played this because he thought that it won a piece.  I'm familiar with that method as it's very similar to how I thought against blitzkov during the misstep, which he annotated.  But, like that game, black had no backup for the B.  So, it was just one attacker against 2 defenders, and the result is that this will cost him a piece for pawn.  That's a major advantage for white, especially at her rating.",
        "13. Nxf2 Qc5 14. b4": "And, Sasha increases her advantage by attacking the Q ahead.  And, when he retreats, she'll go back on the attack again.  Not only is she 2 points up, but as noted before, Julio is yet to develop his other pieces.",
        "14... Qb6 15. c5 Qc7 16. O-O": "And, Sasha uses that time to castle.",
        "16... Ne5": "Julio played this because it forks.  However, that fork also allows Sasha to exchange which is to her benefit since she is ahead.  With that being said, she plays the exact same move that I also would've played, as white, in this position.",
        "17. Nxe5 Qxe5 18. Qh5": "I am very familiar with this move.  As we saw with 2 annotations, first bhidragon played something like this for a winning attack.  Then, Stanley did that last Friday when I took the B.  While it might not seem so since Julio will attack the Q, this is a winning attack for Sasha.  As this will allow her to swarm in with her other pieces against his monarch.  ",
        "18... g6 19. Qh4": "With that being said, I would've continued with 19.Qh6, but I like this move just as well, especially since her Nf2 is about to become a monster.",
        "19... Nc6": "Continuing with his development, but it's too little too late because of Sasha's next move.",
        "20. Ng4": "And, it's not just because the Q is attacked.  But, the overall picture is that Sasha going after Julio's K in a very similar manner to how Stanley went against my K.",
        "20... Qd4+": "Julio tries to stop it by placing Sasha in check...",
        "21. Be3": "But, Sasha fights back by interposing with her DSB.  What's more is that she's giving up her Bd3 for an inevitable mating sequence.",
        "21... Qxd3 22. Rxf8+ Kxf8 23. Qf6+ Ke8 24. Qh8+ Kf7 25. Nh6+ Ke7 26. Bg5#": "This was an exciting game to watch.  And, I think that Julio played very well against someone he was up, as she's a runner.  But, I think that his first big mistake was advancing his weakest pawn with 9...f6??  Overall, that allowed Sasha to bring her other pieces against the K.  Then, came the final blunder from an oversight with 12...Bxf2 which allowed white to win a piece for pawn.  From that point on, it went downhill for black until we reached this position."
    },
    "url": "https://gameknot.com/annotation.pl/wtw-another-lesson-please?gm=64950",
    "gameName": "WTW-Another lesson please",
    "players": "clashofpawns (2273) vs. easy-win (1346)",
    "opening": "Sicilian (B40), Marshall variation"
}