{
    "moves": {
        "1. h4": "So, this is already something that I do not.  I always viewed this as a mistake because it is a non developing move.  As we will see later on, that is sort of the point of this game.  And, players like Fred can sometimes deviate from standard openings, as I mentioned in different annotation.",
        "1... Nf6": "In the meantime, I am just going to start developing, as I do best.  This is a standard move, according to this opponent.",
        "2. h5": "I am not sure why he moved there.",
        "2... Nc6": "But, that is not going to stop me from continuing with development.  According to Fred, this is still standard.",
        "3. h6": "And, he is still going to push, but how am I going to respond, this time?",
        "3... gxh6": "? By taking.  Up until now, I was following Expert IONS and Jack Stockel's style of advice by thinking ahead and calculating the positions.  By this move, however, I switch and follow easy19's advice, as the position is starting to overwhelm me.  What is the masters style?  Well, he doesn't think but lets things come naturally by knowing the best move.  I thought that I just knew.  I actually made this move because I thought figured I had won a free pawn.  That, however, was the logic behind 3.h6.  In fact, this is why the game was called, \"Walking The Plank\".  Afterall, he walked one of his pawns, to its demise.  However, this is my first mistake.  He told me that best was 3...e5 here.",
        "4. d4": "I understand the point of this move, it is developing and will enable white to get his DSB out and give him more options with some of his pieces.  However, I think that it is too little and too late, in this position, as white is behind in development, or is he?",
        "4... Bg7": "? In general, you are not supposed to fianchetto your bishop, unless it is absolutely necassary, according to Master myevilluck, my WTW mentor for that group.  However, this would be an extenuating circumstance, as it is the only way to get that bishop out.  But, my opponent told me that this is another mistake.  The proper response was actually 4...d5.",
        "5. Nf3": "In the meantime, he is still in the process of developing.  But, I feel that he is too far behind to do that.  However, that is not the case, as we will see later on.",
        "5... O-O": "Therefore, my decision is made to castle Kingside.  Afterall, I like to castle, ASAP in my games.  On the other hand, he told me that this is another mistake.  BTW, I mentioned that his first few moves were non developing.  Well, here's the thing, his goal was to try and get me out of the basic principals.  In other words, he wanted me to disregard General Opening Principals.  I failed to because my primary goal was to develop, as it is my comfort zone.  According to Fred, best was 5...Ng4, or 5...d4, in this position.  In that, he implied that the game is lost, with best play.  I learned something from him.  What was that?  ...\"i just make you abandon the principals of chess. and you will keep doing that as long as you do know them whiteout thinking\", is what he said.  So, here's the moral.  Like real life, it's important to be flexible and adjust to different positions in chess, even if you are not comfortable with them.  It basically falls into the same category as the glass being half full.  But, there is more to this game then meets the eye.  What else is there to learn?  The Master Mater also said, \"practice practice prectise before i played my first real chess game i only played and learnt basics for about 2 years. things like how many squares are on the board. how strong is a rook on the b rank do i move a knight before a bishop and in what direction. do i play 1 piece twice or not etc etc..\"\r\n        ",
        "6. Bxh6": "Now, he won back a pawn.  I actually thought that this was a blunder and would, therefore, lose a piece.  But, I overlooked something.  After 6...Bxh6, 7.Rxh6, so everything is even, but as he noted earlier, he has a winning edge.  The reason being is that after we exchange, my WK is left more open then his K.  That openness is eventually going to expose it.",
        "6... Bxh6 7. Rxh6 b6": "In the meantime, I am just going to develop my LSB.  Normally, I would have played ...Kh8, but what happens if I do?  First, he brings his Queen to d3, which might not seem so bad.  But, then what?  Second, he moves his N to g5.  From then on, he plans a mate, so I was not going to take that chance.  Normally, I would not have to worry about things like that, but with this opponent, you do.  As jstevens1 mentioned in a thread, it is important to do your HW on this guy, or he can really take you out.  I learned that from a different game against game, and believe it or not, that was the first game I lost to Fred.  ",
        "8. d5": "So, he attacks my Knight.",
        "8... Na5": "This time, I find a safe place for him,, in this position.  That's right, I will either lose this piece, or it will get attacked, if I place it anywherelse because if 8...Nb4, 9.b3, or 9.Qd2.  Well, there is one more option, but I don't like it because 8...Nb8 undoes all the work that I spent.  BTW, even if this wasn't the best move, I have nothing to lose, except for the game itself.  ",
        "9. Qd3": "I know what's going on.  In this position, he is starting to plan a mate.  At the time, however, I did not realize it.",
        "9... Bb7": "So, I decide to finish with development.  My goal is just to win a free pawn, but that was never going to happen.  What else am I going to do?  I am in real trouble, and when that happens, I do things that I would not normally attempt like unsound aggression, at this point.  Once in a while, that has gotten me out of trouble.",
        "10. Ng5": "At this point, I now realize that black is totally lost, but I am not going to give up yet.  Why?  Sometimes, you can actually win or draw, in a lost position if you really concentrate on the positions.  I just want to stay for as long as I can.",
        "10... c6": "Therefore, I am hoping to distract him because I absolutely have nothing better to do.  When you know that a game is lost, you can generally try just about anything, even if it involves cheapo tactics.  Afterall, this is why you are sometimes able to turn a loss into a win.  I actually did something like that in a different game, where I was six points down and should have lost because I did played badly.  However, I managed to swindle my around that, when I deliberately gave up another piece, to successfully deliver mate. ",
        "11. Rxf6": "So, he decides to take my Knight, and this is really a test.  Can I take his Rook immediately?  And, why or why not?  In this position, I have to be very careful, in order to avoid the mate in one (12.Qxh7#.)  Therefore, my only option is 11...Kg7, which completely exposes my King.  Any other move, however, would immediately guarantee mate.",
        "11... Kg7 12. Qg3": "Just because I avoided his mate in one does not mean anything.  He is still trying to find another way to deliver mate.  As chesskingdom64 mentioned, \"There is always another way of doing something.\"  However, that is not going to stop me from taking, this time.  Once again, I have absolutely nothing else to lose, so pretty much any move is as good or bad as any other.",
        "12... exf6 13. Ne6+": "So, he decides to throw in a double and discovered check.  Very dangerous.  I actually thought that he would take my Queen with this family fork, but he is going to do something far worse then that, as we will see shortly.",
        "13... Kh6": "Now, I only have two options.  The other feasibility was 13...Kh8.  However, that gives him a mate in one, on the grounds of 13...Qg7#.  So, this is my only safe move.",
        "14. Qg7+": "But, that is not going to stop the inevitable.  That's right.  At this point, I saw a mate in three, so I resigned.  On the other hand, he actually would have mated me in two.  14.Qg7+, Kh5 (forced) 15.Nf4+, Kh4 (forced), 16.g3#."
    },
    "url": "https://gameknot.com/annotation.pl/wtw-meeting-the-change?gm=49222",
    "gameName": "WTW-Meeting the Change",
    "players": "easy19 (2068) vs. jkarp (1165)",
    "opening": "Anti-Borg (Desprez) opening (A00)"
}