{
    "moves": {
        "1. e4": "In this game my opponent gets an advantage, but I fight back and manage to draw, a rather lucky draw! It was played on chess.com my first game from that site to be annotated, and I will use the assessments from that site.",
        "1... c5": "Sicilian Defence",
        "2. Nf3": "Main line",
        "2... d6": "What I usually play now.",
        "3. d4": "Open variation",
        "3... cxd4": "I take",
        "4. Nxd4": "He takes back.",
        "4... Nf6": "I attack the e pawn",
        "5. Nc3": "He defends",
        "5... Nc6": "I opt for the main line.",
        "6. Bg5": "The Richter–Rauzer Attack",
        "6... e6": "For the time being I prevent the doubling of my pawns.",
        "7. Qd2": "Vsevolod Rauzer introduced the plan of Qd2 and 0-0-0 in the 1930s.",
        "7... a6": "Preventing a piece from getting to b5 and also preparing b7-b5",
        "8. O-O-O": "Castles",
        "8... Bd7": "Of course the Nc6 needs protecting before b7-b5 can be played.",
        "9. f4": "He will match my queen side expansion with advances on the king side and/or the centre.",
        "9... b5": "The advance comes",
        "10. Bxf6": "He takes.",
        "10... gxf6": "This looks strange, but taking with the queen is bad. Qxf6 11. e5! dxe5 12. Ndxb5! with massive advantage to white.",
        "11. Kb1": "The king tucks himself away near the and avoids any tactics on the c1-h6 diagonal and makes attacks along the c file less likely.",
        "11... Qb6": "Threatening exchanges on d4. Black's king is far less secure than the white queen and an exchange of queens makes a successful attack on the black king less likely.",
        "12. Nxc6": "White exchanges",
        "12... Bxc6": "Black takes back",
        "13. f5": "And the attack continues.",
        "13... Qc5": "The black queen aims for e5. My opponent afterwards said that he wondered if this move was sound - whether black had time for this? However it is the most commonly played move here, and I pointed out that white has to sacrifice a pawn to prevent the queen occupying the e5 square with the queen.",
        "14. fxe6": "He takes. This looks a bit strange too, voluntarily undoubling black's f pawns, but it does loosen black's king position.",
        "14... fxe6": "Black takes back.",
        "15. Bd3": "and the bishop finally comes out",
        "15... h5": "With a plan of developing my Bf8 to h6, but it doesn't turn out too good. I wonder if 15. ....Qe5 was better to prevent what happens next.",
        "16. e5": "This is considered a star move by chess.com",
        "16... fxe5": "Taking this way strengthens the centre \"Always take towards the centre\"",
        "17. Ne4": "Part of the idea is this - it is a clearance sacrifice for the knight.",
        "17... Bxe4": "So I take.",
        "18. Bxe4": "He takes back.",
        "18... Rc8": "The usual square that the Ra1 goes to in this variation.",
        "19. Rhf1": "Taking control of the open file.",
        "19... Be7": "Finally developing my bishop.",
        "20. Qa5": "A star move, attacking a6",
        "20... Qa7": "This was the only way I could see of protecting a6, but as it turns out I can't protect it anyway. d6-d5 was better.",
        "21. a4": "Another star move, attacking b5.",
        "21... Rc5": "Again, I thought this was the only way to protect b5, but as we shall see, this doesn't really protect it. d6-d5 was better.",
        "22. axb5": "Oops! I can't take back with the rook as there is a bishop fork on c6 and I can't take back with the pawn on a6 as the pawn is pinned against the queen.",
        "22... d5": "At last!",
        "23. Bg6+": "White throws in a check, it looks very natural, but in fact this move is not the best, simply retreating the bishop to d3 was better. I was quite pleased when I saw this move as, at the right moment, I may be able to play e5-e4 cutting off the Bg6 from play on the queen side.",
        "23... Kd7": "Forced! The only square the king can move to.",
        "24. Qa4": "Another star move, according to chess.com, threatening nasty discovered checks with the b5 pawn.",
        "24... Kc7": "So getting out of the way of the queen's diagonal.",
        "25. Rf7": "Rook comes in threatening the bishop.",
        "25... Kb6": "While a few moves ago I was really worried, I was now thinking I was doing OK.",
        "26. Rxe7": "I didn't think this worked.",
        "26... Qxe7": "I wasn't 100% sure that I was OK, but recapturing is virtually forced.",
        "27. Qxa6+": "He takes the pawn with check.",
        "27... Kc7": "King drops back. He had a long think and eventually came up with the move chess.com gives as the star move.",
        "28. Rf1": "With the threat of Rf7 winning the queen.",
        "28... Rf8": "Virtually forced, another star move.",
        "29. Rxf8": "He takes.",
        "29... Qxf8": "I take back. I later set up this position on Fritz and at first it thought b6+ was winning here, but then saw the defence - 30.\tb6+\tKc6\n31.\tb7+\tKc7\n32.\tQa8\tQb8 and black is OK, and then it saw 32. Qa7! and white wins.",
        "30. Qxe6": "chess.com gives this a double question mark. ",
        "30... e4": "And black offered a draw, which white accepted. Computer analysis does show that the position is level now, but there is play left in this position. Many thanks for reading, please leave a comment or two and rank the annotation with the star system to let me know how I am doing, until next time dear reader!"
    },
    "url": "https://gameknot.com/annotation.pl/yorkshire-v-cheshire-north-wales-online?gm=68077",
    "gameName": "Yorkshire v Cheshire & North Wales Online",
    "players": "Simon Smith (1871) vs. Charles L Higgie (1922)",
    "opening": "Sicilian (B68), Richter-Rauzer, Rauzer attack, 7...a6 defence, 9...Be7"
}