{
    "moves": {
        "1. d4": "This is the first of two games vs payam_eagle and I'm sure he is as upset as I am about this game.  However, I've learned quite a bit from reviewing this game. My hope is that you will take something out of this game as well. By the time this game ended in a draw I had 3-0 for my tourney this makes my score a 3.5 which is pretty good. If you would like to look at the other 3 wins which are pretty neat you can view them here: http://gameknot.com/analyze-board.pl?bd=14099627&rnd=0.2591759961626843 features an opening trap; http://gameknot.com/analyze-board.pl?bd=14100315&fb=1&rnd=0.9084254376000573 A poisoned pawn; http://gameknot.com/analyze-board.pl?bd=14099101&rnd=0.7170149447687891 and a discovered attack on the queen.",
        "1... d5": "Typical queen pawn opening.",
        "2. e3": "After reading a few annotations from Freddy's The stone wall project I decide to try a game with a similar set up.",
        "2... e6": "Mirroring my movements c5 would probably be blacks best try creating a QGD structure for white.",
        "3. Nd2 Nf6 4. Bd3 c5 5. c3 Nc6 6. f4": "We've reached the stone wall position here.",
        "6... Be7 7. Qf3": "I was looking at a few games in the db in the previous position and thought I would try this one out. The game in the db with this structure ends in a draw.",
        "7... a6 8. Ne2 Qc7 9. O-O O-O 10. g4": "I figured I would start with this aggressive idea, I planed to play g5 or f5 if needed after black defends from mating threats.",
        "10... e5": "?! at first I thought this was a wonderful move but now that I've been able to look at with the add of some technology this move was not all that good.",
        "11. fxe5 Bxg4": "The best move in the situation. though it does have a very big down side of leading to a minor exchange sac two pawns for a Knight.",
        "12. Qg2 Bxe2": "?? best according to the computer and what I had expected in the games was Nxe5 dxe5 Qxe5 this just loses a piece and I didn't notice at the time because I was distracted by my rook being under fire. This shows the importance of checking out all the possibilities.  Here exf6 wins the knight because of the mate on g7.",
        "13. Qxe2 Nd7 14. Rf3": "My threat is Bxh7+ Kxh7 Rh3+ Kg8 Qh5 leaving black with little chances.",
        "14... g6": "Blocks the threat.",
        "15. e4": "? this move gives black the chance to break open the center which is very bad for my weakened king position here Bc2 or Nf1 would have been better.",
        "15... cxd4": "taking back with cxd4?? Nxd4 and white is in big trouble but white is still playable in this position.",
        "16. exd5": "Forcing the c6 knight to e5.",
        "16... Ncxe5 17. Rg3 Nxd3": "Here I thought oh look at that I can win the e7 bishop. However this was a poor choice the best was probably either Rxd3 which I like or Qxd3.",
        "18. Qxe7": "?? I was thinking black would play Nxc1 here but after I played this move I was like oh no what have I done.",
        "18... Rae8": "Now white must deal with the attack on the queen.",
        "19. Qh4 Re1+ 20. Nf1 Nxc1": "?? This turns out to be a mistake for black. I had seen a way to win a pawn and took it but it turns out threatening mate is devastating.  Rh3!! Black must now deal with the double threat of Qxh7# and Qxe1.  The computers best line for this was 21. Rh3 Ne2+ 22. Kf2 Rxf1+ 23. Kxf1 Qf4+ 24. Kxe2 leaving white with an exposed king but a material advantage and an unclear position slightly favoring white just a bit.",
        "21. Rxg6+": "Winning the pawn.",
        "21... fxg6 22. Qxe1 Nd3 23. Qe6+ Kg7 24. cxd4": "Now it is as if I lost a pawn for a knight but my doubled d-pawns will be a problem.",
        "24... Qd8 25. Qe3": "I didn't want black to be able to try to force a queen exchange.",
        "25... Nb4 26. Qb3": "Protects d5 and attacks the b4 knight.",
        "26... Qb6 27. Rd1": "Defends d4 from Qxd4+.",
        "27... Nf6": "Double attack on my d5 pawn. I decided to push it though its pretty much lost.",
        "28. d6 Nbd5": "I think black could have done better here Qxd6 seems logical.",
        "29. Qxb6": "Why would I trade queens when I'm down well one the queen really didn't have any good squares to go to and two do to my kings exposed position; I'm better off with the queens off the board.",
        "29... Nxb6 30. Rc1": "My plan is to play Rc7+ Rxb7 if possible.",
        "30... Rd8 31. Rc7+ Rd7": "Stops Rxb7 but I noticed that maybe I could make the trade of rooks good for me.  At this point I was trying my best to make my opponent give me as many chances back into the game as possible.",
        "32. Ne3": "Trying to make a queen if Rxc7.",
        "32... Ne8": "My rook can no longer hold this position I decide to exchange so I don't lose a pawn.",
        "33. Rxd7+ Nxd7 34. Nc4": "Protects d6 and creates the possibility of Ne5 trying to queen still.",
        "34... Kf6": "Black brings the king into action.",
        "35. Kf2": "I bring my king closer as well because a centralized king is best in the endgame. I also hoped that black would force me into e5 with b5 and that's exactly what happened.",
        "35... b5 36. Ne5": "Black has no reason not to exchange but black may have been better of with Ke6.",
        "36... Nxe5 37. dxe5+ Ke6": "Note Kxe5 d7 and I queen!",
        "38. Kf3": "attempting to come to the defense of the e5 pawn.",
        "38... Ng7": "I would think blacks best would be to exchange knight for two pawns here but I think that may actually give white chances the computer shows this move as best.",
        "39. Kf4": "I was hoping to lure blacks knight to h5 but black can punish me here with Kd5.",
        "39... h6": "My king can't attack the pawns now.",
        "40. Ke4": "Keeping blacks king out of the game.",
        "40... Nf5": "I wanted to wait a move and try to get black to play g5.",
        "41. b3 a5 42. a3": "I finally get it to be blacks turn.",
        "42... g5": "?? sure enough I get g5.",
        "43. d7": "!",
        "43... Nd6+": "The best move as it keeps blacks king close to the passed pawns and pulls the white king further from the king side pawns.",
        "44. exd6 Kxd7 45. Kd5": "I offered a draw here and that's exactly what this position boils down to. Though with all the possibilities it would take me a long time to explain them all. So I'll try to do my best. I still wonder if I had played Ke5 if it would have made any difference in the long run but I would think it doubtful.",
        "45... h5": "The best move in the position white can't go for the queen side pawns because of black's king side pawns; would win the race.  Any king move would be bad for black also either a4 b4 or b4 a4 leads to just enough time for white to win the queen race by one move allowing white the chance for perpetual.  Work it out yourself it's rather interesting. The last move g4 would also lead to a draw but this one is quite a bit more complex. 45... g4 46. a4 bxa4 (forced) 47. bxa4 white forces black to move! h5 48. Kf5 h4 49. Kf4 g3 not allowing white to win the race and the game. 50. hxg3 and here the game diverges into two paths.  Black can play h3 or hxg3 lets look at h3 first. 51. Kf3 h2 52. Kg2 Kxd6 53. Kxh2 Kc5 54. g4 Kb4 55. g5 Kxa4 56. g6 Kb4 57. g7 and as you can see white queens before black even 52... h1=Q+ doesn't help because black doesn't queen in time for even a check. Going back to 50... hxg3 51. Kxg3 and now black seems to have the win but white has a clever draw. Kxd6 52. Kf2 Kc5 53. Ke1 Kb4 54. Kd1 black now has two tries both end in draw. Ka3 55. Kc1 Ka2 56. Kc2 Ka3 57. Kb1 and white finds the corner. Or 54... Kxa4 55. Kc1 Ka3 56. Kb1 and white finds the corner point is that black cannot force the pawn to a1 because the white king just keeps going back and forth between a1 and b1 eventually black traps the King on a1 and either gives up the pawn for draw by insignificant material or stalemate.",
        "46. Ke5": "! forcing the draw.",
        "46... b4": "white can exchange here. Blacks best try is to play h4 here in that case white would lock the queen side pawns when the opportunity arises.",
        "47. axb4 axb4 48. Kf5 Kxd6": "Note: g4 Kg5 leads to no tempo loss the position remains the same.",
        "49. Kxg5 Kc5 50. Kxh5 Kd4 51. Kg4": "Draw is agreed upon here because the race ends with a queen on h8 and a queen on b1 with white to move but neither side has any hope of victory. Note: after black gets 53...  Kxb3 54. h3 Kc3?? would be a major mistake because white would queen with check giving a critical tempo white would be winning here. Work out the win with a computer or for yourself it's a rather important knowledge just force the king in front of the pawn and move the white king closer and closer. Side note: In the case of white queening first and the king is near the pawn on the rook2(7) and bishop2(7) pawns the game would be drawn."
    },
    "url": "https://gameknot.com/annotation.pl/yosharks-mini-tournament-ii?gm=32292",
    "gameName": "yoshark's mini-tournament II",
    "players": "yoshark (1484) vs. payam_eagle (1714)",
    "opening": "Queen's pawn (D00), stonewall attack"
}