{
    "moves": {
        "1. e4": "Beans and I discussed annotating this one after it was over, and now she's being lazy about doing it, so here we are. ",
        "1... e5 2. c4 Nc6 3. g4": "This opening doesn't make a ton of sense to me currently, but she did a pretty good job through a lot of this game. I still feel like d3, Nf3, or Nc3 would all be better moves than this one.",
        "3... g6": "Looking to fiancetto, of course. Not sure what I was thinking at the time, but I don't see a problem with it yet.",
        "4. d3 Bg7 5. g5": "Poor development here. That pawn isn't leading to any advantage that I can see and now she's given up tempo to black by moving it twice.",
        "5... Nge7 6. c5": "Moving a second pawn twice. Six moves in and only four pawns have been moved. Develop the minor pieces!",
        "6... O-O 7. Nc3 d6 8. cxd6 cxd6 9. f4 a6 10. a3 Nd4 11. Nd5": "Offering the trade Nxd5 and then exd5, but it leads to white stacking pawns. Be3 would have been better.",
        "11... Nxd5 12. exd5 exf4": "Opening the file on white's King to hopefully break the castle. Also going to try to take advantage of the N's threat on e2. ",
        "13. Bxf4 Re8+ 14. Ne2 Nxe2 15. Bxe2 Bg4": "Decent pin, but not much to do with it yet.",
        "16. Rc1": "Taking the rook to the empty file, always a good practice. This move overlooks Bxb2, though, so black wins the pawn.",
        "16... Bxb2 17. Rc2": "Black wins another pawn shortly with Qa5+, with the choice of either a3 or d5. ",
        "17... Qa5+ 18. Bd2 Qxa3": "I notice my mistake. Qxd5 would have been the stronger move due to the central Q and the additional threat on the R at h1. This move wins a pawn, sure, but threatens nothing and motivates white to potentially take control.",
        "19. Rc7 Qxd3": "Moving to make good on all the threats to e2. ",
        "20. Be3": "Good move, Beans. Negates all my threats and forces the Q to retreat. Black still has a material advantage, but the positions can be pretty swiftly reversed if played right from here on out.",
        "20... Rxe3 21. Qxd3 Rxd3 22. Bxd3": "I see nothing wrong with white's play here. Black should have Qxd1 first and come away with Bxd1 followed by Rxd3+. I messed up again and now have very little in the way of material advantage and white has the slightly stronger position.",
        "22... Re8+ 23. Kf1 Bf3 24. Rg1 Bd4 25. Rg3 Re3": "All solid moves through there...",
        "26. Kf2": "...but this was a mistake. If black were a better player, he would capitalize with the discovered check and be up a B...",
        "26... Bxd5": "...but he makes this stupid move instead. ",
        "27. Rxe3 Bxe3+ 28. Kxe3": "Black has managed to blunder his way into a bad position and a material deficit. Great job.",
        "28... Kf8 29. h4 Ke8": "White just needs to clear out some space and protect those pawns. ",
        "30. Kd4 Bh1 31. Rxb7": "Fatal mistake. This is the one bad move that undoes all the previous good ones.",
        "31... Bxb7 32. Bc4 a5 33. Kc3 d5 34. Bb5+ Ke7 35. Kb3 Kd6 36. Ka4 Bc6 37. Bxc6 Kxc6": "This game is now effectively over. White played a good game through to move 30 and just made a bad move. Throughout, though, Beans did a good job of capitalizing on my mistakes and protecting her territory. ",
        "38. Kxa5 Kc5 39. h5 d4 40. hxg6 fxg6 41. Ka6 d3 42. Kb7 d2 43. Kc7 d1=Q 44. Kb7 Qd7+ 45. Ka6 Qb5+ 46. Ka7 Kc6 47. Ka8 Qb7#": ""
    },
    "url": "https://gameknot.com/annotation.pl/you-have-your-auto-decline-set-to-at-least-10-days-per-move-so-take-your-time-and-really-look-over-your-moves?gm=59002",
    "gameName": "You have your auto-decline set to at least 10 days per move, so take your time and really look over your moves.",
    "players": "jeanybeany (1075) vs. atom842 (1219)",
    "opening": "King's pawn game (C20)"
}