{
    "moves": {
        "1. e4": "AN elegent game that is over quickly",
        "1... e5 2. d3 d5": "Black pushes for an advantage unbalancing the board",
        "3. Qf3 d4": "with this move, black establishes control of territory deep in my end",
        "4. b3": "I prepare my house for the king",
        "4... Bb4+": "check",
        "5. Nd2": "my homebuilding plans are disrupted",
        "5... Nd7 6. Bb2": "but undeterred, I continue",
        "6... Nb6 7. g3 Nh6 8. Bh3 Qg5": "This move begins the series of moves that traps the queen",
        "9. O-O-O Bg4 10. Bxg4 Nxg4 11. h4 Qg6 12. a3 Bxd2+": "an exchange by black to thin the ranks",
        "13. Rxd2 O-O 14. a4 c5 15. Ba3 Nd7 16. Kb1 a6 17. Nh3": "I begin to shift my forces to king side and try to stop the advance of his army",
        "17... b5 18. a5 b4 19. Bb2 Rab8 20. Ka2 Rb5": "I see the threat and bring my castle",
        "21. Ra1 Rxa5+ 22. Kb1 Rb5 23. Ng5 Nh2 24. Qg2": "The idea is to trap the queen and kill her....by bringing the knight across and locking her escape route down",
        "24... Ng4 25. Qh3 Ndf6": "The first stage of the mission is accpomplished",
        "26. Bc1 a5 27. c4 Rb7 28. Rxa5": "Balance restored and attack repelled",
        "28... Rc7 29. Rda2": "By bringing my castle over I protect the rank against a double castle exchange and a certain loss. ",
        "29... Rcc8 30. Ra5a6 h6": "with this move, black ensures that I have to move and my plan begins to break down...",
        "31. Nf3 h5": "this move guarantees that I capture the queen",
        "32. Ng5 Kh8 33. Qf1 Rfe8 34. f4": "by taking the pawn, I lose the innitiative. any other move is the wrong move",
        "34... Ne3": "So he moves the knight...now I have to decide to take the knight or if instead I cover my queen. ",
        "35. Qf3": "I decide to cover my queen because I need the bishop to cover teh black diagonal",
        "35... Neg4": "the retreat is forced. ",
        "36. f5": "I push my pawn threatening the queen who really has nowhere to go, and faces certain capture now",
        "36... Nh2": "A natural threatening reaction that is easily repelled",
        "37. Qg2": "thus",
        "37... Qxf5": "This decision sped up the end game. Why black never captured the knight here I do not understand",
        "38. exf5 Nhg4 39. Nxf7+": "check",
        "39... Kg8": "fork",
        "40. Nd6 Ne3": "so what?",
        "41. Bxe3 dxe3": "which castle to take? I do not want his knight protecting the pawn in front of the king so I choose the far castle",
        "42. Nxc8 Rxc8 43. Ra6a7": "The beginnings of a mate surface. If I can get the queen onto the 7th row, its mate. ",
        "43... Rd8": "Not seeing the danger, the castle moves over...",
        "44. Qb7": "Success!!",
        "44... Ne8": "Damn knight....hmmm OK so mate is still imminent...mate in 4",
        "45. Qf7+ Kh7 46. Re7 Rxd3 47. Qxh5+ Kg8 48. Rxe8#": "Mate it is..."
    },
    "url": "https://gameknot.com/annotation.pl/your-turn-to-be-white-i-think?gm=2318",
    "gameName": "your turn to be white, I think...",
    "players": "opus692 (1252) vs. daverap (1259)",
    "opening": "KP (C20), Indian opening"
}