{
    "moves": {
        "1. e4 e6 2. d4 d5 3. Nd2": "Tarrasch",
        "3... Nf6 4. e5 Nfd7": "Moves into the closed game.",
        "5. Bd3 c5 6. c3 Be7": "Normal is Nc6 I had the idea of Nf3 Qb6 O-O sacrificing the d4 pawn for a powerful initiative.  cxd4 cxd4 Nxd4 Nxd4 Qxd4 Nf3.",
        "7. Qg4": "Beginning piece development to the king side.",
        "7... O-O 8. Ne2": "Adding support to d4 and allowing the knight to come to f4.",
        "8... cxd4 9. cxd4 Nc6 10. O-O f5": "!? better might have been f6 however this isn't a bad move seeing as white takes e.p. exf6 is bad for white.",
        "11. Qh5 Qe8": "I don't want to trade queens since black is cramped and I have better attack chances.",
        "12. Qh3 Nb4 13. Bb1": "Maintaining the bishops pressure on the diagonal. ",
        "13... Nb6 14. a3": "Kicking the knight back and freeing up my ls bishop.",
        "14... Nc6 15. Kh1": "My plan is to play g4 at some point so I'm opening the g1 square for my rook.",
        "15... g6": "?! weakens blacks dark squares significantly around his king.",
        "16. Nf3 Qd8 17. Qh6": "?! This doesn't really do anything for white g4 I believe puts more pressure on blacks game.",
        "17... Rf7 18. Nf4": "Creating the possibility of a knight sac on g6 and putting pressure on e6.",
        "18... Bf8 19. Qh3 Qc7": "Trying to create queen side play.",
        "20. g4 Na5 21. Ng5": "! pressures e6 and defends against blacks threat of Nb3.",
        "21... Re7": " Creates a target :).",
        "22. Bd2": "knight must move",
        "22... Nac4": "? Nc6 was the move.  Bb4 is devastating.",
        "23. Bb4 Rg7": "?? loses big material Bxe8 is devastating to bad I missed it :(.",
        "24. Nfxe6": "I saw the fork but missed that Bxf8 would put the king in the fork :/.",
        "24... Bxe6 25. Nxe6 Qd7 26. gxf5": "I'm sure this was unexpected on my part but starts to open up blacks king side.  I'm not sure this is the best move but I felt Bxf8 Rxf8 Nxg7 Qxg7 and black is holding on.",
        "26... Re7": "I'll take that :)",
        "27. Bxe7": "Black resigns.  fxg6 is going to be hard to deal with."
    },
    "url": "https://gameknot.com/annotation.pl/zigis-mini-tournament-v?gm=47251",
    "gameName": "zigi's mini-tournament V",
    "players": "zwarwiz (1757) vs. zigi (1563)",
    "opening": "French (C05), Tarrasch, Botvinnik variation"
}