{
    "moves": {
        "1. e4": "Zivomir challanged me to a game earlier today. I accepted the challange, somehow feeling it would be unlike most of my previous games. I was correct, and that is why I am sharing this game. Throughout it, you will see a varying in who is winning at what times. ",
        "1... e5": "I went against my usual Sicillian Defense. I have been using the Sicillian so much lately that it became what I used to think 1... e5 was. I played 1... e5 to get a game that I wasn't as familiar with in my studies in case I ever feel the need to once more play it in a tournament game like I used to.",
        "2. Nf3": "2. Nf3 is something that is seen in almost every 1. e4 opening. It is the penutbutter to the jelly that is 1. e4.",
        "2... Nc6": "2... Nc6 is the best option, or at least for me. I once knew the Pitroff with the ability that I know the Sicillian today, but I haven't employed it since I became more serious in my studies of chess. That is another reason this game turned out with a strange position, because my studies are mostly for 1... c5 rather than 1... e5. I wish to one day know how to play almost every opening with the skill of a master, and a few with the skill of a Grand Master. Of course, that will be many years away. \"An amateur practices until he gets it right; a master practices until he never gets it wrong.\" Sounds like many years to me.",
        "3. Bc4": "He decides to play 3. Bc4. 3. Bc4 is still one of the best moves. You will see it from begining level to masters. I used it towards my early years of chess, but have lately been quite fond of the Schotch Gambit (1. e4 e5 2. Nf3 Nc6 3. d4 exd4 4. Bc4 ....). Even though in the Schotch Gambit, it is just a move later that Bc4 is played, attacking oppertunities are far greater.",
        "3... Nf6": "I play here, inviting the upcoming move of 4. Ng5. The Fried Liver is a move played by many club players and begining tournament players. It is probably played at higher levels, but probably less frequently.",
        "4. Ng5": "I have seen this in countless games before this, and probably countless after this, and that is one reason why I learned the Sicillian. This move happens too often, and usually leads to some dull play. However, this game is quite fun and sharp.",
        "4... d5": "The best move I believe. Or so I think...",
        "5. exd5": "He takes the pawn, so now I have the choice of taking it back and getting into a highly tactical game (5... Nxd5 6. Nxf7 Kxf7 7. Qf3+ with sharp play to follow), or playing my Knight over to the rim, losing the pawn, but pulling off a nice gambit-type move (5... Na5 6. Bb5+ c6 7. dxc6 bxc6 8. Qf3 keeping his extra pawn).",
        "5... Na5": "I decide to go with the less tactical game. I was more familiar with playing Black from this standpoint anyways. As White, I am more familiar with the Nxd5 line.",
        "6. Bb5+": "As I previously stated, this line allows him to keep his pawn.",
        "6... c6": "It is only natural to block a check.  6... Bd7 may have been better, but I am not completly sure...",
        "7. dxc6": "Moving the Bishop away simply allows Black to regain the pawn.",
        "7... bxc6": "I'm not going to let him get up two pawns, now am I?",
        "8. Qf3": "This makes it not possible to take the Bishop. (8... cxb5? loses to 9. Qxa8)",
        "8... Be7": "I want to be able to castle soon. This move does give up a second pawn though.",
        "9. Bxc6+": "He seizes up the pawn, willing to exchange the Bishop for my Knight.",
        "9... Nxc6": "A bad Knight for a good Bishop sounds good, right? Too bad I lost a pawn to it though...",
        "10. Qxc6+": "The only good move here. Leaving the Knight would be almost idiotic.",
        "10... Bd7": "Any other move gives up the Rook.",
        "11. Qc4": "Threatening Qxf7#. Black must choose the correct moves.",
        "11... O-O": "Any other move hurts Black furthermore.",
        "12. Nc3": "I wouldn't call it a blunder, but not the best move (I think). It allows me to reposition my pieces and force him to move his Queen off the nice c4 square.",
        "12... Rc8": "This move gets my Rook active, and forces him to move his Queen.",
        "13. Qe2": "I would say that this move was not his best. It will later haunt him.",
        "13... h6": "I want his Knight out of my territory. This also creates an escape square for my King.",
        "14. Nf3": "14. Nge4 may have been better, but I am not entirely sure... I would have played that, if only to trade down pieces to further show my advantage in material.",
        "14... e4": "I try to create some counter-play for myself.",
        "15. Ne5": "15. Nxe4 gives Black the chance to snatch up the c2 pawn with 15... Rxc2",
        "15... Be6": "I want to keep my Bishop pair.",
        "16. f4": "This move is his blunder. It allows me to make him wish he had put his Queen elsewhere.",
        "16... exf3 e.p.": "I want fewer pieces in the middle.",
        "17. Nxf3": "Much better is 17. Qxf3, breaking up my plan.",
        "17... Re8": "My Rook is now lined up with the King and Queen.",
        "18. d3": "Stops Bc4, which was what I was hoping to do.",
        "18... Bf5": "Makes for one piece less in the way, and moves it to a better diagonal.",
        "19. Qd2": "I think 19. Kd1 would have been better.",
        "19... Bb4+": "Clearly the best move.",
        "20. Kd1": "Here is blunder two. 20. Kf1 would have been better.",
        "20... Nd5": "Threating to win a piece.",
        "21. Re1": "This was the best move for him.",
        "21... Bxc3": "Better than Nxc3, but by how  much I am not sure. This move just forces his Queen to move later.",
        "22. Rxe8+": "His best move.",
        "22... Qxe8": "Any other move would have been horrible.",
        "23. Qf2": "23. bxc3 Nxc3+ 24. Qxc3 Rxc3 would have ended my onslaught, but would have lost him his Queen.",
        "23... Bxb2": "I almost didn't see this. It is the last key to my attack.",
        "24. Bxb2": "He logically takes.",
        "24... Ne3+": "And now I have checkmating threats coming up.",
        "25. Ke1": "I think that 25. Qxe3 Qxe3 may have been slightly better, but not by much.",
        "25... Rxc2": "I even up the material, but am in the winning position.",
        "26. Qg3": "And decides his Queen is more important than his King I guess...",
        "26... Rxb2": "This lets me get up in material and position.",
        "27. Nd2": "Here he comments \"bravo bravo\". It shows to me that he no longer wishes to fight off my attack. I thank him for the compliment, and thank him for playing against me.",
        "27... Bxd3": "This allows me to threaten mate in a few.",
        "28. Nb3": "He gives up.",
        "28... Re2#": "I was happy with the result of the game. I felt that the game would be different and fun, and I was right. Thanks zivomir for the game, and thanks to all who view and comment on this. :)"
    },
    "url": "https://gameknot.com/annotation.pl/zivomir-v-pcshark11-april-23-2011?gm=38278",
    "gameName": "ZIVOMIR v PCSHARK11 April 23, 2011",
    "players": "zivomir (1574) vs. pcshark11 (1651)",
    "opening": "two knights defence (C58), Bogolyubov variation"
}