{
    "moves": {
        "1. e4": "Honeybrook: I thought it would be interesting and helpful to post a game by the great Alexander Alekhine, many times world chess champion and in my mind probably the greatest player of all time.  But who can say?\r\n\r\nMany notes are Alekhine's and can be found in his book of his best games. Where my notes are added I will specify as 'Honeybrook' or 'H'.",
        "1... e5 2. Nf3 Nc6 3. Bb5": "Honeybrook:  The beginning of the Ruy Lopez. An opening, according to www.chessgames.com's database, white wins 35%, black 22% and draws 42%. It's greatest popularity was enjoyed during the first two decades of the 20th century.  But it is by no means forgotten, Bobby Fischer often employed the opening with great success... but then he was Bobby Fischer.",
        "3... a6": "H: The usual challenge...",
        "4. Ba4": "H:  ...and the most common response:  retreat.  Though certainly taking down the knight (exchange variation) is a viable option.",
        "4... Nf6 5. O-O": "H: We now see the Ruy Lopez-Russian Defense (C79).",
        "5... d6": "Alekhine begins:\r\nThis permits white to start an immediate action in the center without being obliged to protect first the King pawn by Re1 or Qe2 which would have been the case after 5...Be7.\r\n\r\nHoneybrook: this to me is a sophisticated note that requires some thought to appreciate. For in truth the King pawn is now unprotected and easy prey for black's knight. But anticipating the freeing of the bishop on c1 to attack black's queen from g5, the black knight is reluctant to abandon its post just to capture the king pawn.  The knight would stand on an unprotected square and have to retreat in the face of Re1 or d3 thus giving up a tempo.",
        "6. c3": "H: Laying groundwork for a solid white center while black's will be dismantled. ",
        "6... Bd7": "H: Unpins the knight and moves the bishop to a much more active square.",
        "7. d4": "H: White's space grows, yet if black responds with exd white is ready to seize the e-file with Re1.",
        "7... Be7": "H: Knight on f6 freed from potential pin while room made for castle.",
        "8. d5": "A: This blockade maneuver was introduced by Bogoljubow against me in Rotterdam 1929. Its peculiarity leads generally to slow positional battles of heavy calibre.\r\n\r\nH: Where can the knight go? There are no excellent homes for it to land, retreat is forced.  Meanwhile white's position has room to move while black's suffocatingly cramped.  Plus, the d5 knight controls e6.",
        "8... Nb8": "H: Total retreat but designed ultimately to get the knight onto d7.",
        "9. Bc2": "H: A trade of bishops would benefit black by trading a cramped black bishop for a mobile white one and do much to relieve black's cramped position.  So white's bishop takes up a post aimed at h7.",
        "9... Bg4": "A: Keres tried against me, in 1935, a more aggressive line of play involving the renunciation of 0-0 in favor of 9...h6 10. c4 Qc8 11. Ne1 g5 12. Nc3 Nh5.\r\n\r\nH: Penetrating white's space and pins the knight against the queen.",
        "10. c4": "H: White advances, stakes out more of the queenside and leaves c3 open for the knight.",
        "10... Nbd7 11. h3 Bh5 12. Nc3 O-O 13. g4": "H: Opens the king's defensive wall asserting control over h5 and f5.",
        "13... Bg6": "H: The bishop is running out of places to dwell.",
        "14. Qe2": "A: Preparing for Nh4 which if played instead of Qe2 would be met by 14...Bxe4.\r\n\r\nH: White's formidable structure has weaknesses, namely the pawns on c4 and e4.",
        "14... Ne8": "H: Five of black's pieces are on contiguous squares.",
        "15. Bd2": "H: The rooks can see each other.",
        "15... h6": "A: The seemingly more aggressive 15...h5 would have been met favorably by Nd1-e3-f5.",
        "16. Kg2": "H: White wishes to move Rh1 preparing for a h-file assault.",
        "16... Bh7": "H: Wants to advance the knight pawn and claim his share of the kingside space.",
        "17. Rfh1 g5": "A: By this pawn blockade, black temporarily at least eliminates any danger that threatens his king.\r\n\r\nH: The black king orders up some breathing space of his own.",
        "18. h4 f6 19. Nd1": "H: The knight's march to the juicy f5 square begins.",
        "19... Rf7": "H: Black's knight is hungry for f4 and will travel via f8-g6. Black labors to match white's advances.",
        "20. Ne3": "A: The knight must be exchanged at f5 before black has a chance to move a knight to f4 via g6.",
        "20... Nf8 21. Nf5": "H: Black will be obligated to take the offending knight.  It is too dominant on f5 to ignore.",
        "21... Bxf5 22. gxf5": "H: Two goals have been accomplished.  The kingside bishop is no more and the pawn on f5 owns the e6 and g6 squares, effectively building a wall against the black king.",
        "22... Rh7": "A: One must admit that black defends his position logically. He still succeeds in bringing a knight to f4 via another route: g7-h5. But it is his bad luck that his other pieces are so poorly place that he can mount an effective defense.",
        "23. Rag1": "H: The bulk of white's guns are now pointed at the black king.",
        "23... Ng7 24. Kf1": "H: The king becomes bystander and feels no heat from black's forces.",
        "24... Qe8": "H: Black takes control of the e8-h5 diagonal and offers protection for the knight when it lands on h5.",
        "25. Nh2": "H: White's queen now pressures h5 and white's knight is poised to jump to g4.",
        "25... Nh5 26. Ng4": "H: The position appears to be deadlocked.",
        "26... Nf4": "H: Black has reached his goal, f4.",
        "27. Qf3": "A: Threatening 28. Bxf4 e5xf4 29. QxP gxQ 30. Nxh6 which is double check followed soon by mate.",
        "27... Kg7": "A: The only parry that saves the game.  For 27...Kh8 would soon lose to 28. Nxh6 RxN 29. hxg, etc.",
        "28. hxg5 hxg5 29. Rxh7+ Nxh7 30. Rh1 Kh8 31. Rh6 Qf7 32. Bd1 Rg8 33. Qb3": "A: As all of black's pieces are more or less engaged on the kingside, the queen undertakes a promenade on the queen side, not for sightseeing, but to grab anything insufficently protected. This material gain, by no means accidental, is the logical consequence of persistent initiative. which kept black from protecting all of his weak points.",
        "33... b6 34. Qa4 Bf8": "A: If 34...a5 35. Qd7 winning rapidly.",
        "35. Qxa6 Bxh6 36. Nxh6 Qg7 37. Nxg8 Kxg8": "H: This game features several carefully calculated sacrifices/trades that serve to expose and undermine black's position.",
        "38. Qc8+ Nf8 39. Bxf4 exf4 40. Qe8": "A: After gaining the material advantage, the attack, as so often, vanishes, and white must be particularly careful against a counter attack. Possible black threat: 40...Qe7 and ...Qe5.\r\n\r\nH: This is true advice.  To get ahead in material and then plunge headlong into an attack that backfires and surrenders the carefully accumulated advantage.",
        "40... g4 41. Qh5 f3 42. Ba4": "H: The bishop freezes the black pawns and links with the queen at e8.",
        "42... Nh7 43. Bc2": "A: The necessary preparation for the surprising assault in the middle.",
        "43... Nf8 44. e5": "A: !! This was the sealed move at the adjournment. This simple move transforms a complicated technical problem into a sharp, short, winning procedure.",
        "44... dxe5 45. d6": "!",
        "45... c5": "For cxd 46. c5! threatening 47. Bb3 and finishing the work.",
        "46. Be4 Qd7 47. Qh6": "More exact would be 47. Qxg check.  Anyway, black resigned at this point."
    },
    "url": "https://gameknot.com/annotation.pl/zurich-tournament?gm=17068",
    "gameName": "Zurich Tournament",
    "players": "Alekine, A  vs. Johner, H ",
    "opening": "Ruy Lopez (C79), Steinitz defence deferred (Russian defence)"
}