{
    "moves": {
        "1. e4 e5 2. Nf3 Nc6 3. Bc4 Nf6 4. Ng5 d5": "다시 생각해보니 별로 좋은 수가 아닌 것 같다. 비슷한 수준의 상대에게 생각없이 밀어붙이는건 좋은 행동이 아니다.",
        "5. exd5 Nxd5 6. Nxf7": "White는 Knight 하나를 희생시켜 Black의 킹을 위험한 곳으로 유인한다.",
        "6... Kxf7 7. Qf3+": "이 수는 전혀 생각하지 못했기 때문에 당황스러웠다. White의 Queen은 Black의 King과 Knight를 동시에 공격한다. (fork)",
        "7... Qf6 8. Bxd5+ Be6": "여기서 White는 Qxf6를 취하지만 좋은 수가 아니다.\n\n내가 생각하는 최선의 수는 8. Bxc6  bxc6  9. Qxc6 다. 이렇게 게임이 진행되면 White는 추가적인 이득을 얻을 수 있고 Black은 진형을 추스르기 전에 King 반대편 진형이 초토화되는 것을 막는데 전력을 쏟아야 한다.",
        "9. Qxf6+ gxf6 10. Bxc6": "내심 Bishop끼리 자폭하길 바랬지만 내 진형이 더 나빠지는 쪽으로 White는 교활하게 움직였다.",
        "10... bxc6 11. Nc3": "기물은 White가 하나 앞서 있다. Black의 Pawn Structure와 King의 위치도 엉망이다.\n\n하지만 White는 중앙 쪽으로 전혀 기물이 배치되지 않은 반면, Black은 Pawn과 Bishop이 중앙을 어느정도 장악하고 있다. 게임 당시에는 절망적으로 느껴졌지만 생각보다 내가 할만한 국면이었던 것 같다.",
        "11... Rg8 12. O-O Bb4 13. Ne4 Bd5": "White은 체스에서 초반에 여러 기물을 움직여 중앙을 장악하는 것이 얼마나 중요한지 잘 모르는 것 같다. Black은 White의 약점을 조금씩 찌르며 4-5 라인의 점유율을 높이고 있다.",
        "14. c3": "White의 실수다. g2의 약점 때문에 Black이 Pawn 하나의 이득을 보게 된다.",
        "14... Bxe4 15. cxb4 Bxg2 16. Re1": "내가 유리한 상황이기 때문에 시간을 많이 써서 이득을 취할 방법을 생각했다.\n\n1. Checkmate가 가능한가? -> 힘들 것 같다.\n2. 그러면 이 상황을 이용해서 Rook을 하나 없애보자.\n",
        "16... Be4+ 17. Kf1 Bd3+ 18. Re2 Bxe2+ 19. Kxe2": "여기까지는 강제된 이동이다. White로서는 Rook과 Bishop의 교환을 허용할 수 밖에 없었다.",
        "19... Rg1": "상대의 남은 두 개의 주요 기물을 묶어둘려는 의도였다.",
        "20. d3 Rag8 21. a3 Rg8g4 22. f3": "치명적인 실수다. Black은 두 수에 Checkmate가 가능하다.",
        "22... Rg4g2+ 23. Ke3 Re1#": "실수가 있어도 꿋꿋하게 두면 승산이 있다는 교훈을 주는 한 판이었다."
    },
    "url": "https://gameknot.com/annotation.pl?gm=39602",
    "gameName": "긍정적 마인드",
    "players": "mikey19@chesscube.com (1547) vs. nsh3389@chesscube.com (1444)",
    "opening": "two knights defence (C57), Fegatello attack, Leonhardt variation"
}