{
    "moves": {
        "1. e4": "Hello everyone, and today I will annotate a game I finished recently. \n\n\nWhite starts with e4",
        "1... e5": "I choose the open games. ",
        "2. Nf3 Nf6": "the petrov's defence. Most opponents played Nxe5, and after d6, they could play 4.Nf3 or 4.Nxf7!?\nAfter 4.Nf3 Nxe4, the most common move is Nc3. The move I hated to see was the very dull 5.d4.",
        "3. Nc3": "Petrov 3 knights. 3...Bb4 is supposed to be really OK for black. I choose the 4 knights game.",
        "3... Nc6 4. Bc4": "A perfectly reasonable move, but I don't like it because black can play 4...Nxe4 with equality.",
        "4... Nxe4 5. Nxe4": "the intermezzo Bxf7ch?! is inferior because I get a strong center, and my king can artificially castle.",
        "5... d5": "the point",
        "6. Bxd5": "the best continuation is Bd3, keeping the 2 bishops.",
        "6... Qxd5 7. d3 Bg4": "my pieces are rather active. ",
        "8. h3": "another move in the DB was 8.Bh6, but this lacks a direct threat, and after something simple, like long castling, the bishop will have to go again.",
        "8... Bh5 9. Qe2": "I really don't like this move. Black can get instant edge with Nd4",
        "9... Nd4": "now white's position is totally inferior no matter what he plays. ",
        "10. c4": "a counter attack.",
        "10... Qa5+": "according to my instant analysis, white's best try will give him a much inferior endgame.",
        "11. Qd2": "a mistake. Loss of material is inevitable.",
        "11... Bb4 12. Nc3": "now I pick up a piece easily. Hopefully you can spot in a few seconds at most.",
        "12... Bxf3": "the bishop is immune, and white is still in great difficulty.",
        "13. O-O": "Now I see a simple way to win.",
        "13... Ne2+ 14. Kh2 Nxc3": "both captures lose.",
        "15. bxc3": "it doesn't matter anymore, white's position is completely destroyed.",
        "15... Bxc3 16. Qe3 Bxa1 17. Qxf3": "The smoke has all cleared, and I am up a rook and a pawn.",
        "17... O-O-O 18. Be3 Bd4": "trading the bishops are fine.",
        "19. Bc1": "horrid, but it really doesn't matter.",
        "19... f6": "securing the chain.",
        "20. Qg4+ Rd7": "I plan to double rooks, win more material, trade, and win.h",
        "21. f4 Rhd8": "now the king goes to b1, and my pieces are all better, I am also a rook up.",
        "22. Rd1 Qxa2 23. Bd2": "I'll give the rest without comments..",
        "23... Kb8 24. h4 Qc2 25. Bb4 exf4 26. Kh3 Be5 27. Qf3 Rd7xd3": ""
    },
    "url": "https://gameknot.com/annotation.pl/4-knights-tactical-disaster?gm=33128",
    "gameName": "4 knight's tactical disaster",
    "players": "billyjblues1 (1560) vs. chessboard12 (????)",
    "opening": "Petrov three knights game (C42)"
}