{
    "moves": {
        "1. d4 Nf6 2. Bf4": "Accelerated London system. Resembling the Colle System, white develops the Bishop to Bc1-f4 the hallmark of the London. The orthodox move order has always been on the 3rd move, e.g., 1. d4 2. Nf3 3. Bf4 to what ever Black plays. The Accelerated London develops the bishop on move 2. I'm not a Londoner so I'm not going to write the pros and cons of The orthodox London vs the accelerated London system and how it is meant to deal with Black's moves. I just know it's really in vogue right now and a hot opening for White because Magnus Carlsen has played it. I will add black will face a blunted King's Indian Defense if both sides were to develop their own system, i.e., The london system vs the King's Indian Defense. For example, 1. d4...Nf6 2. Nf3...g6 3. Bf4...Bg7 4. e3...d6 5. Be2..0-0 6. 0-0.",
        "2... c5": "Gambit line ...c5. Black can bring out the queen too. ",
        "3. e3 Nd5 4. Bg3 cxd4": "probably not advisable to capture right away....",
        "5. Qxd4": "This move as well is perhaps not good. \nI played this as to attack the unprotected Knight....",
        "5... Qa5+ 6. Qd2 Nc6 7. Qxa5 Nxa5 8. c3": "to prevent any Nb4 fork tricks",
        "8... b6 9. Nf3 Bb7 10. Be2 e6 11. O-O": "White has 4 pieces developed to Black's 3 pieces. \nWhite is castled as well. ",
        "11... Bc5": "?",
        "12. b4": "fork. ",
        "12... Nxb4 13. cxb4 Bxb4 14. Rd1": "?! probably not the best file for the rook to be on. Perhaps, Rfc1 was called for to control the open file. ",
        "14... d5 15. Bb5+": "Check with tempo. ",
        "15... Bc6 16. Bxc6+": "It's best to trade pieces since I already won a Knight for 2 pawns. \nTrading pieces down to the endgame is a sound strategy ",
        "16... Nxc6 17. Rc1": "Wining a tempi ",
        "17... Na5": "?",
        "18. Rc7": "!! A rook on the seventh rank is always good!",
        "18... Bc5 19. Nc3": "My C7-Rook is not trapped! \nand my Knight is now free to roam the board. ",
        "19... O-O 20. Na4 Rfc8 21. Nxc5": "! reducing pieces for a won endgame. ",
        "21... bxc5 22. Rxc8+ Rxc8 23. Rb1 c4 24. Rb8": "!\nWhite pins the rook against the king. Absolute pin! This goes with my plan to reduce pieces on the board for a won endgame. \nWhite has enough time to stop the c-pawn from promoting. \nIf, 24...Rxb8 25 BxRb8...c3 26. Ne1 and black doesn't have enough support to advance the pawn. White's bishop can return in time to help. ",
        "24... Rxb8": "forced",
        "25. Bxb8 Nc6 26. Be5": "The power of the London bishop!\nThis provokes black to trade pieces as well as preventing any Black pawns from moving forward. ",
        "26... f6 27. Bc3 e5 28. Kf1": "now the King joins the fight to win. ",
        "28... Kf7 29. Ke2 Ke6 30. g4 g6 31. Kd2 e4 32. Nd4+ Nxd4 33. Bxd4 a6 34. Kc3 f5 35. h3": "And here I saw my opponent had counter play for a win!\n35...fxg4 36. hxg4...h5! 37. gxh5 forced....gxh5 and White has to worry about the h-pawn promoting. And I think black can play for a draw. Lucky for me black didn't play this. My king would have to chase the h-pawn as the Bishop needs to guard the a1-h8 diagonal.  ",
        "35... g5": "??\nlosing move?",
        "36. Kd2 f4 37. Kc3": "ha! Now my King can go after the lonesome a6-pawn!",
        "37... Kf7 38. Bb6 Kg6 39. Kd4 h5 40. Kxd5 c3 41. Ba5 c2 42. Bd2 fxe3 43. fxe3 hxg4 44. hxg4 a5 45. Kxe4 Kf6 46. Kd3 Ke5 47. Kxc2 Ke4 48. a4 Kf3 49. Kd3 Kxg4 50. Bxa5 Kf3 51. Bc7 g4 52. a5 g3 53. Bxg3 Kxg3 54. a6": ""
    },
    "url": "https://gameknot.com/annotation.pl/4-accelerated-london-the-london-bishop-endgame?gm=69159",
    "gameName": "4. Accelerated London the London Bishop endgame",
    "players": "freeman8201 (1907) vs. cantonabest (1713)",
    "opening": "Queen's pawn game (A45)"
}