{
    "moves": {
        "1. e4 d6": "Hi all. Here I try King's Indian defemce. I'm not good in this defence but \"to try is to learn\" :)\r\n..and sorry for my poor English",
        "2. d4 g6 3. c3 Bg7 4. f4 Nf6 5. Bd3 O-O 6. Nf3 Bg4 7. O-O c5": "I wasn't sure this move will create a Black structure weakness in, but thought it was more correct than Nc3 for example. But maybe c6 would been the best continuation",
        "8. Be3 b6 9. Nbd2 Nc6 10. d5 Na5": "Bad place for the knight but what else could I do",
        "11. Qc2 a6": "Preparing to attack the white pole bishop with b5 following by c4 and strong position",
        "12. h3": "Logic move, White decides the moment for atatcking black structure has become ",
        "12... Bd7 13. g4 Bxg4": "This sacrifice is logic too - a bishop for two pawns and pressure on e3 pole with threatening Q-R fork. But Black hasn't good development yet. Maybe ...e3 would been better",
        "14. hxg4 Nxg4 15. Bf2 e6 16. Rae1 b5": "The old theme with attacking the bishop..",
        "17. b3": "to prevent it",
        "17... Nb7": "Not a good place for the knight but it has come into battle somehow",
        "18. Bh4 Qc7 19. Ng5 exd5 20. exd5": "Create an open line for white but black can use it too",
        "20... Rae8 21. Be4 a5": "Black has a good defence position on kingside and a good attacking options on the queenside. ",
        "22. c4": "A mistake. This gives a chance to Black to make a good attack",
        "22... Bd4+ 23. Bf2 Nxf2 24. Rxf2 h6": "The exchange bishop for rook isn't give a real positional advantage for Black. At the other hand white's g-knight is dangerous so close to black castle",
        "25. Ngf3 f5": "The best continuation I think. Now Black exchanges bishop for knight and bishop and totally unfold White's King position",
        "26. Nxd4 cxd4 27. Rg2 Qf7 28. Qd1 fxe4 29. Nxe4 Kh7": "Maybe the critical moment in the game. All of white's and black's pieces are ready for attack",
        "30. Rf2 bxc4 31. bxc4 Nc5": "An exchange of queens will leave material even on the board with options to promote pawns for both sides. I thought (wrong - how it'll be seen) that this exchange will leave me better chances to promote  ",
        "32. Nxd6 Rxe1+ 33. Qxe1 Nd3 34. Nxf7 Nxe1 35. Ne5 d3 36. Kf1 Nc2": "The game seems totally lost for black",
        "37. d6": "Maybe that move was the first big mistake for White in the game. d6 instead Nxd3 losses tempo and allows Black to consolidate it's pieces for last and how it shows, deadly attack :)",
        "37... Ne3+ 38. Ke1 Rxf4": "If 39.Rxf4; 39...Ng2+ with good chances to promote for black",
        "39. c5": "The second big mistake. Much better is 39.d7;Rd4; 40.Rf7+;Kg7 41.c5...etc and winning game. ",
        "39... Nc2+ 40. Kf1": "White has no choice",
        "40... d2": "I'm proud with this move :) if 41.Ke2;Rxf2+ 42.Kd1;Ne3+ and promote",
        "41. Rxf4 d1=Q+ 42. Kf2 Qe1+ 43. Kg2 Qxe5 44. Rf7+ Kg8 45. d7 Qd5+": "White resigns. \r\n"
    },
    "url": "https://gameknot.com/annotation.pl/40-black-play-and-win?gm=23227",
    "gameName": "40...? Black play and win",
    "players": "rudlarah (1607) vs. luni4av (1524)",
    "opening": "Pirc defence (B07)"
}