{
    "moves": {
        "1. e4": "Stringplayer92 (annotator) (1701)  ---- tobiasverhulst (1801)\n\n44th Gameknot Tournament\n\nThis game features many different material imbalances, errors, plans, and tactics.\nI started with 1.e4.  I just recently switched from the Reti, so the Classical variations are very different compared to what I am used to.",
        "1... e5": "He responded with the symmetrical 1...e5, turning down the opportunity to play the Sicilian.  This gives me some information as to what type of player he is and how he regards me.",
        "2. Nf3": "I continue with 2.Nf3 heading for the Ruy Lopez, as the King's Gambit is too risky.  These seem to me the only reasonable moves in this position as a move like 2.Nc3 in the Vienna, hands the initiative to black and loses the \"advantage\" of white being first to move.",
        "2... Nc6": "No Russian game for him.",
        "3. Bb5": "The technical beginning of the Ruy Lopez.",
        "3... a6": "I personally play the Berlin wall, 3...Nf6 in order to push white out of their known lines, and because I think that black is actually comes out better in the queen-less endgame (I have some bias, as I beat my first expert with the Berlin).",
        "4. Ba4": "I like to test my opponents on their opening lines in correspondence since it is easy to find mistakes...  So I don't go for the simpler exchange variation (4.Bxc6). ",
        "4... Nf6 5. O-O Be7": "He does not take the chance to play the open, so I know I am going to have to use the \"Spanish torture\" and try and positionally squeeze black.  (That does not happen at all...)",
        "6. Re1 b5 7. Bb3 O-O 8. c3 d6 9. h3": "All main line, we are in the Chigorin closed Ruy Lopez.",
        "9... Na5 10. Bc2 c5 11. d4 Qc7 12. Nbd2": "Still main line....",
        "12... Bd7 13. Nf1": "This is a common theme in the Spanish.  The knight can go to g3 then f4, or e3 and help control the central squares.",
        "13... cxd4 14. cxd4": "He opens the c-file, from which he will conduct his operations on the queen side.",
        "14... Rac8 15. Ne3": "The tension remains in the center, as neither player wants to have to take.  If black takes he will be left with a queen backwards pawn on an open file.",
        "15... Rfe8": "Almost always good to develop rooks to files that might open up soon.",
        "16. b3": "Trying to activate my queenside, maybe not the best move.",
        "16... Nc6 17. d5": "I finally close the center.  Maybe it was best to keep the tension with Bb2, but after Nb4 I am getting a little tied up.",
        "17... Nb4 18. Bd3": "The white bishop is bad here.  Also my position seems a little cramped !? (Even though I have more space in the center...) so I will try to trade pieces to relieve this. ",
        "18... a5": "He advances his queen side.  So far I have been so distracted with the queen side, I can't conduct any of my own plans.  So much for the Spanish torture.",
        "19. Bb2": "Finally developing that bishop.  Now if only I could get my rook out",
        "19... g6": "This was a strange plan by black to get space on the King side with f5.",
        "20. Bb1": "I should have played 20.Rc1 here then after 20...Qb6, 21.a3 Nxd3 22.Qxd3 and I am starting to get out of this.",
        "20... Nh5": "I wonder if he should have stuck the knight in to that f4 hole instead of where he later puts it?",
        "21. a3": "Kicking the annoying knight.  I felt like I was starting to get back into this game.  If I were to open the center my two bishops could come alive as he has some king side weakness (which I can't make use of right now)",
        "21... Na6 22. Bc2": "Denying penetration on the c-file.  I am going to post the a1 rook behind it.",
        "22... Ng7": "Continuing with the f5 plan",
        "23. Rc1": "As planned.  Finally all my pieces have developed.",
        "23... Qb7": "The Queen gets off the x-ray of the rook",
        "24. Qd2": "I started to try and take some of the dark squares on the queenside, and provoke the pawns forward where they might become weak.",
        "24... b4": "Sure enough he advances.",
        "25. a4": "I close off the queen side so that his only plan is down the c-file.",
        "25... Nc5": "So now the knight.  It is good, but is it really?  What is it actually doing?  Maybe it would be more beneficial to double on the c-file.  I think activating the rooks is more important than one knight.  Just a thought. ",
        "26. Nc4": "Closing down the c-file.  Now the queenside play he had from the early middlegame is non-existent.",
        "26... Qa7 27. Nfxe5": "Here was one of the material imbalances.  I did calculate wrong.  But I was hoping to get control of the a1-h8 diagonal to create mate threats, along with a passed d-pawn to give him trouble. ",
        "27... dxe5 28. Bxe5": "Here is the passed d-pawn.",
        "28... Nxa4": "The problem is that.  I didn't see that...",
        "29. Bd4": "tempo the queen.",
        "29... Nc5 30. Qh6": "Threaten mate.",
        "30... Bf8 31. Qe3": "And tie the knight, bishop, rook, and queen down.",
        "31... Nf5": "Here again, I give up material.  I guess I just wasn't afraid of sacking during this game.  Can you guess what I played?",
        "32. exf5": "Not the best move, but everything was going the wrong way.  Many times giving up material will help gain the initiative, which is better than just letting your opponent slowly kill you (Karpov style).",
        "32... Rxe3 33. Rxe3": "If 33...gxf5 34.Rg3  Bg7 35. Rxg7  is not good for black.  (same thing with Bxf5)  But all his pieces are inactive.  The queen is in the corner doing nothing.  The rook is on a open/closed file.  Though I am down a Queen for a Rook and a pawn, maybe just maybe I am still in the game?  What do you think?  Objectively I am lost, but I think there is still hope.",
        "33... Qa8": "Trying to get rid of that pesky passed d-pawn.  But at the cost of an exchange.",
        "34. fxg6": "Get rid of the hanging pawn first.  He has to recapture, because letting me have a protected passer at h7 is no good.\n\nedit: And as heinzkat pointed out it just so happens gxh7 is mate also, I think he was more worried about the passer....",
        "34... hxg6 35. Nb6": "Fork.",
        "35... Qb7 36. Nxc8 Qxc8 37. Bd3": "the counter ^^^ says I am only down a pawn... I don't know about that.  But my pieces are more active then his.  My main problem is if he gets a passer on the queen side.",
        "37... Qb7": "So I am not sure why he made this exchange, giving me two pieces for a rook and the two bishops to boot!",
        "38. Bxc5 Bh6 39. Be4 Bxe3 40. Bxe3 a4": "Now by standard material counting (which really means nothing) I am \"even\".  But he is starting to push that queen side majority.  What can I do about that?  Not much, push the d-pawn I guess.",
        "41. bxa4 Bxa4 42. Rb1 b3 43. g4": "Getting those pawns rolling as quickly as possible.",
        "43... Qb4 44. f3 Qc3": "That Bishop on e4 that protects the rook is very handy so that I can control the queening square.",
        "45. Bf2 b2": "Now he is threatening ...Bc2.  So I give hi something to worry about with, d6 after which he must play ...Kf8",
        "46. d6 Kf8": "Next I am going to activate the bishop through tempoing the queen.",
        "47. Be1 Qc1 48. Kg2": "Get out of the pin.  If 48...Bc2 49.Bb4 Ke8 50.Bc6  Kf8 51.e7  Kg8 52.e8=Q  or something along those lines.  ",
        "48... Ke8 49. Bb4": "Still he can't play ...Bc2 because of Bc6 .",
        "49... Kd7 50. Ba3": "So he removes the threat of the d-pawn, and I take out the b-pawn.  What a trade!",
        "50... Qc3": "Black tries to set a little trap here.  See if you can find what he was thinking, and how I \"escaped\" from it",
        "51. Bxb2 Qd2+ 52. Kh1 Bc2": "This is the trap, now after 53.Bxc2 Qxc2 I am forked and I lose a piece.",
        "53. Bc3": "But this tricky move gets me out of it.",
        "53... Qxc3 54. Rc1": "Now pin the piece.  Black best move here though is 54...Qh8 because then 55.Rxc2 Qxh3  56.Kg1 Qg3  57.Kf1 Kxd6 when black still has winning chances if his king can get in.",
        "54... Kxd6 55. Rxc2 Qe1+ 56. Kg2 Ke5": "Now he offered me a draw, which I gladly accepted.  I wonder though if maybe his king could get in?  What do you think?  If you have any analysis (stick your silicon beasts on it) , feel free to post it in the comments section and maybe we could come to a good conclusion as to whether it is really a draw.\n\n\nThanks for looking, I hope you enjoyed the game."
    },
    "url": "https://gameknot.com/annotation.pl/44th-gk-tournament?gm=16537",
    "gameName": "44th GK tournament",
    "players": "stringplayer92 (1701) vs. tobiasverhulst (1801)",
    "opening": "Ruy Lopez (C97), closed, Chigorin, Yugoslav system"
}