{
    "moves": {
        "1. e4": "This is taken from the 49th GK tournament\n\nThe ratings difference suggested I had little hope",
        "1... e5 2. Nf3 Nc6 3. Bb5": "Ruy Lopez",
        "3... f5": "My intention was to try to stake some claim in the centre. I knew I wanted my knight to be on f6 pretty quickly to protect h5 from his queen and to prevent any pawn advance from f5. It would also pressure the centre.",
        "4. Nc3": "Schliemann defence, Berger variation. Though I am unsure of the full implications of that. This move is probably to protect the bishop and the pawn on e4",
        "4... Nf6 5. exf5": "He was forced to do something about that pawn. With it here I can attack it with my lsb and it can't be too easily defended, as g4 wouldn't be good for king castling and B d3 blocks in his d pawn as well as limiting his dsb",
        "5... Bc5": "I did this for two reasons, firstly it seemed a reasonable developmental move and allowed the possibility of d6. Secondly it got us out of the Gameknot database",
        "6. O-O": "Standard development, note that if I do the same I am slightly more exposed",
        "6... d5": "Trying here to be agressive and to stake further claim on the centre, with the option of pressuring one of his knights later. However this was possibly the first of my many mistakes, I'm not clear what would have been better apart from perhaps castling",
        "7. Bxc6+": "He had been waiting for me to move that pawn, however although my pawns will be doubled on c, I have reasonable cover of the centre and a semi open b file for my rook to move to. It also gives my lsb a little more room to play with",
        "7... bxc6 8. Nxe5": "Threatens the c6 pawn",
        "8... O-O": "This seemed the safest option, although it potentially loses a pawn it was a bit of a panic reaction. It also exposes my king a little on the a2-g8 diagonal",
        "9. d4": "I figured here that this was purely to defend the knight. It is very well placed to cause maximum nuisance. and that for now my bishop was safe",
        "9... Re8": "Claims the open file. I was pretty sure here he wouldn't want to lose the knight and my bishop was still safe for now",
        "10. Nxc6": "apart from forcing me to move my queen and gaining the pawn I'm not sure of the point of this",
        "10... Qd7 11. Ne5": "This is a good place for whites knight as it is difficult to remove",
        "11... Qxf5": "I still doubted he would take my dsb as he would then lose his knight",
        "12. Re1": "My bishop is now feeling a little more threatened",
        "12... Bd6": "Pressuring the knight",
        "13. f4": "I have nothing left to throw at his knight",
        "13... c5": "So I try to undermine its defences. Again I guess that he wont take the pawn",
        "14. Nb5": "Threatening my dsb",
        "14... Ne4": "This was to try to protect my dsb and to remove one of the defenders from the white knight and to generally make things more complex, however ...",
        "15. Rxe4": "It was now I realised the flaw in my logic as taking my dsb means he forks my queen and rook and my lsb",
        "15... Re6 16. Nxd6 Rxd6 17. dxc5": "Threatening to exchange rooks which I can ill afford",
        "17... Rf6 18. Qxd5+": "At this point I had enough as I seem to lose at least a rook\n\nThanks for reading"
    },
    "url": "https://gameknot.com/annotation.pl/49th-gk-tournament?gm=19217",
    "gameName": "49th GK tournament",
    "players": "slpowers (1718) vs. elwoos (1553)",
    "opening": "Ruy Lopez (C63), Schliemann defence, Berger variation"
}