{
    "moves": {
        "1. e4 c5": "My favourite Sicilian",
        "2. Nf3 Nc6 3. d3": "I had expected d4, the main line- the Open Sicilian. White instead opts for the Closed Sicilian",
        "3... g6 4. g3 Bg7 5. Bg2 e6": "Both sides continue with their development. I was thinking of maybe playing N(g)-e7 and d5",
        "6. O-O Qc7": "I wanted to play d5 without allowing white to play e4-e5. I later found out that this move is not in either of the Gameknot opening databases.",
        "7. Bf4 e5": "Weakening my d5 square, but gaining time",
        "8. Bc1": "I'm not convinced that this retreat is best. I would have thought Be3 was best.",
        "8... d6 9. Nbd2": "I would have been tempted to play Nc3 and maybe later to d5 at some point.",
        "9... Nge7 10. Re1 O-O 11. Nf1 f5": "I think he was rather wasted time with N(b)-d2-f1, so I decide to attack!",
        "12. c3 f4": "I was dreaming of a sort of King's Indian attack with g5, h5, Ng6 etc. Slightly ironic, as white normally tries to play that sort of attack against black in the closed sicilian. I rather expected him to exchange on f4 and play d4. I thought that c3 was played preparing d4. However he had another plan.",
        "13. Qb3+ Kh8 14. Ng5": "Now I went in for an interesting pawn sac that worked out well. Probably just Ng8 to prevent the knight check on f7 is best, or maybe Na5 hitting the queen. After 15. Nf7check, Kg8, 16. Nh6 check, Kh8, White HASN'T got 17. Qg8 mating, as instead of taking the queen with rook - which does allow Nf7 mate, black can capture the queen with N(e7)",
        "14... f3": "Now probably best for white is to take with the knight. Black can continue with h6 and g5 try and muster up an attack down the f file. Black probably hasn't enough compensation for the pawn, but in a Rapid Play tournament like this, probably has reasonable chances. If white takes the pawn with the Bishop, after 15. Bxf3, h6 16. Nf7check Kh7 white is in serious danger of getting his knight trapped on f7. White didn't take the pawn though.",
        "15. Nf7+ Rxf7 16. Qxf7 fxg2 17. Kxg2 Qd7": "White has gone into this line, but black's bishop and knight are better than white's rook and pawn. Qd7 is an interesting move, normally the bishop is in front of the queen on the diagonal, but in this case there is nothing to stop the black queen from invading the white position. As we shall see, this move also contains a threat to the white queen.",
        "18. f4": "White makes a fatal mistake. Retreating the queen was necessary, although white would have been very much on the defensive.",
        "18... Qh3+ 19. Kh1 Be6": "Oops! Checkmate to the white queen! White resigns. Don't forget to rate this game and leave some comments!"
    },
    "url": "https://gameknot.com/annotation.pl/4th-round-wrexham-rapid-play?gm=34645",
    "gameName": "4th Round Wrexham Rapid Play",
    "players": "Mike A Lee  vs. Charles Higgie ",
    "opening": "Sicilian defence (B30)"
}