{
    "moves": {
        "1. e4 d6 2. d4 Nf6 3. Nc3 Nbd7 4. Nf3 e5 5. Bg5 c6 6. dxe5 dxe5 7. Qd2 Qc7 8. Bc4 b5 9. Bb3": "White decides to tempt Black with the e pawn, in exchange for a strong attack.",
        "9... b4 10. Bxf6 Nxf6 11. Ne2 Nxe4": "11 Nxe4!? Black takes the bait and the pawn, a risky move, and then tries to hang on...",
        "12. Qe3": "A move that is not as strong as it appears. Now white can only hope the Knights retreat, leaving White with a better position and a very strong attack after Nxe5! etc.",
        "12... f5": "12...f5! A surprisingly strong move. Black counterattacks, leading to complications.",
        "13. O-O-O": "If 13 0-0 Bc5! 14 Qd3 (Qc1 Ba3 with a strong attack) Nxf2 15 Rxf2 e5 etc. ",
        "13... Bc5": "13 Bc5! exploits the position of the knight. ",
        "14. Qd3 Nxf2": "A triple fork! White still has a strong attack though.",
        "15. Qc4": "Potential mate threats at f7 and threatens the bishop as well.",
        "15... Be3+": "A useful interposition. Not only protects the bishop but deters the threat of Ng5 with tempo. ",
        "16. Kb1 Nxh1": "Takes the far rook. If white recaptures, it takes the rook off of the d-file",
        "17. Nxe5": "Nice tactical shot,since the knight can't be taken because of mate at f7. White taking the h1 knight was to be considered though to avoid losing too much material.",
        "17... Nf2": "Black puts the question to the other rook.",
        "18. Qxb4": "Desparation. ",
        "18... Nxd1": "Simply ..QxN is sufficient to win. Black decides to take the rook to end threats along the d-file and allow the check at f7.",
        "19. Bf7+ Kd8": "Forced.",
        "20. Ng3": "I had expected 20 Qh4  g5! Now I can capture the knight... ",
        "20... Qxe5": "White resigns, there is nothing left to try. Black was able to hold on."
    },
    "url": "https://gameknot.com/annotation.pl/hanging-on-for-victory?gm=18409",
    "gameName": "Hanging on for victory",
    "players": "mokru (1502) vs. dmaestro (1509)",
    "opening": "Pirc defence (B07)"
}