{
    "moves": {
        "1. e4 c6 2. d4 d5 3. e5 Bf5 4. Nf3 e6 5. Be2 Ne7 6. O-O Nd7 7. Nc3 Ng6 8. Be3": "That does make it harder to play c5, which would be my normal breakout move.",
        "8... Bb4": "It's either this move or Qb6. I liked Qb6 a lot, but my thinking is that this is supposed to be a stronger move. I'm threatening to trade that knight for a bishop, and in a closed game, knights are better than bishops. But I hate to trade off this bishop, because my pawns are on white squares, and this bishop is used to protect the dark squares. So I really would prefer not to make that trade. What I really want to do is play Be4 and trade off my white-squared bishop for his knight. But giving up the bishop pair is like giving up a half a pawn. Hard decisions.",
        "9. Ne1": "Well, he took away one of those hard decisions. I can't play Bg4 to trade that bad bishop. Instead, I've got to worry about him playing g4 and trapping my bishop. I think I'll counterattack on the queenside with c5.",
        "9... c5 10. g4": "I didn't expect g4 on the next move already. Talk about a complicated position. I can play Bxc3 or cxd4. Bxg4 doesn't look good to me. \nIf I play Bxc3, I'm most worried about gxf5. If his bishop weren't on d3, I could play Qg5+ and stir things up, which leads me back to cxd4 as my next move.",
        "10... cxd4 11. Bxd4 Bxc3 12. Bxc3": "How did I get into this position anyway. \nI remember: I played c5 instead of Ne7, and now my bishop's trapped. Even after Be4, he finished the trap with f3. It might be time to use the Desperado tactic and play Bxg4 to get two pawns for the bishop. And I'll look for a chance to pin his bishop with Qg5 after he plays Bxg4.",
        "12... Bxg4 13. Bxg4 Ndxe5 14. Qd4 Qg5 15. Qa4+ Kd8 16. h3": "I can't play h5 because he plays f4. \nI think I have to trade pieces, and I'll stay down a pawn. That's bad; I should be avoiding piece trades because I'm behind.",
        "16... Nxg4 17. Qxg4 Qxg4+ 18. hxg4 f6 19. f4 Rc8": "Running out of things to do. I'll send my rook up to c5 to bother his kingside pawns. My only chance is to create a passed pawn.",
        "20. g5 e5 21. fxe5 fxe5 22. Rd1 d4 23. Bb4 b6": "Nothing looks very good. Time to put the pawns on dark squares to slow down his bishop.",
        "24. c3 a5 25. Ba3 Rc4 26. Nf3 Kc8 27. cxd4 exd4 28. b3": "Why didn't he just take the pawn? This seems to give me some hope. Or, I keep expecting Rc1 to force me to trade rooks and then play Nxd4.",
        "28... Rc2 29. Nxd4 Rxa2": "He's only got two pawns left. I'm feeling like I can hope for a draw. I've got a rook on the 7th rank trapping his king. His bishop is under attack. If I can trade the rooks and my two kingside pawns for his pawn there and my two queenside pawns or his queenside pawn, then he won't be able to mate me. I don't know why he hasn't played Rf7 yet, unless he's waiting for me to move my king out so he can go there with check.",
        "30. Nb5": "This is bad. There's no square on the back row that I can move the rook to.",
        "30... Kb7 31. Rf7+ Kc6 32. Na7#": "That's what I get for not paying close enough attention! "
    },
    "url": "https://gameknot.com/annotation.pl/hard-decisions?gm=37298",
    "gameName": "Hard decisions",
    "players": "mzumbi (2023) vs. chuckbo (2013)",
    "opening": "Caro-Kann (B12), advance, Short variation"
}