{
    "moves": {
        "1. g3 e5": "So he's going for the fianchetto.  I prefer a more direct attack of the center.  Game on!",
        "2. e4 Nf6": "Attack!  Attack!",
        "3. Bg2": "Although this move protects the e4 pawn, I don't like the bishop's limited attack here.",
        "3... Bc5": "Attacks f2, although I'm not crazy about being so aggressive so early.",
        "4. c3": "Another interesting move that's setting up d4, but it takes away from Nc3.",
        "4... O-O": "Run away!  Run away!  I castle as soon as I can.",
        "5. Ne2": "Further reinforcing d4.",
        "5... d5": "Attacking the center once more.",
        "6. exd5 Nxd5": "So far, so good, but I don't have a good answer for c4.",
        "7. d4 exd4": "I'm not liking this.  He's going to have a pawn in the center, now, although it will be isolated.",
        "8. cxd4 Bb6": "I hate to retreat, and he's gained a serious advantage in time here.",
        "9. O-O Nc6": "Attacking his pawn and forcing him to defend it.  Take the fight to him.",
        "10. a3 Be6": "Freeing up my queen to attack the d4 pawn.",
        "11. b4 Qf6": "He'll be able to defend with Be3, but perhaps I can tie up his bishop in the pawn chain.  I've got to do something about his advancing pawns, though.  12. ....a5 13 bxa5 Bxa5 draws me off my attack on the d4 pawn.",
        "12. Bb2 a6": "Ah, very nice!  12. Bb2 was a better move than 12. Bc3.  a6 is kind of a wussy move, but I don't want to leave my right flank exposed.  My rooks have a date with the center.",
        "13. Nd2 Rfe8": "??  Developing rook toward the center, but 13 ... Nxd4 or Bxd4 would have been better.",
        "14. Ne4 Qg6": "Ouch.  That hurt!  ",
        "15. Qd2 Rad8": "Continuing deployment of rooks to center to attack d4.",
        "16. Ng5 h6": "Chasing away that knight.",
        "17. Nxe6 Qxe6": "He took one knight's defender, but I still have the rook and queen.",
        "18. Rfe1": "Danger!  Setting up an attack on the queen.",
        "18... Nf6": "Uncovers attack against the d4 pawn.",
        "19. Rac1 Qd6": "One more attacker on d4, but he can answer that with Rd8 or, better yet, d5.  I'll have to retreat the knight to e7 then.",
        "20. Bf3 Bxd4": "I'd love to see 21. Nxd4 Nxd4 22. Bxb7 Nf4 , but that's a wet dream.",
        "21. Nxd4 Nxd4": "Trading pieces now.",
        "22. Bxd4 Qxd4": "Daring him to take the queen.  I don't know him well enough to know if he'll take it or not.",
        "23. Qa2 Rxe1+": "Trading rooks.  \n\nHe's preserved the queen, leaving me with my queen occupying the center, but he still has control of the d5 square.  He has enough big guns left to implement his plan.",
        "24. Rxe1 b5": "Protecting the b pawn.  Right now, he has a better position than I do.  His queen has a direct bead on my king, and his rook is in a good position to raid my back rank.  He still needs to swing his bishop around.  Perhaps 25. ... Ng4 26. ... Ne5 is in order (I'd love to fork his rook and king at f3, but that's another wet dream.)",
        "25. Rd1": "Nice work.  My queen is toast.",
        "25... Qxd1+": "Better than moving the queen out of the way, but if my knight hadn't been on f6, I could have saved the queen and the rook.",
        "26. Bxd1 Rxd1+": "Well, all things considered, that could have gone much worse.",
        "27. Kg2 Rd8": "I need to provide some support for the c7 pawn.  If I'm going to win this, I must use my pawns to their fullest.  I really don't like this scenario.",
        "28. Qe2": "This seems random.  He's not attacking anything just yet, and my back rank is guarded for now.  I could attack him at e4, but that accomplishes nothing.  I'd like to get my knight involved, especially since he's the only piece that can attack the queen without being directly in the line of fire.\n\nFor now, I'll stick to the plan and reinforce the c pawn.",
        "28... Rc8 29. h4": "Advancing on my king's position.  We're all gonna die!",
        "29... c5": "If he responds with Qc2, I can respond with c4.",
        "30. bxc5 Rxc5 31. Qe3 Rc8 32. Qb6 Rc2": "What I wouldn't give right now for a second rook...",
        "33. Qxa6 Ne4": "Going for a Rxf2, but my opponent has other plans.\n\nThis was a terrible move on my part.  Better perhaps would have been Ra2 or Kf8.",
        "34. Qa8+": "Behold the awesome power of the queen!  G'bye, little knight and rook.  Big mistake on my part to put them both on the same parallel.",
        "34... Kh7 35. Qxe4+": ""
    },
    "url": "https://gameknot.com/annotation.pl/harms-mini-tournament-2?gm=16175",
    "gameName": "harm's mini-tournament 2",
    "players": "daveyr18 (1412) vs. macbone (1356)",
    "opening": "Benko's opening (A00), reversed Alekhine"
}