{
    "moves": {
        "1. e4": "Hi everyone! I have just got back from freezing cold Hastings, where I was competing in the Weekend Longplay tournament, in the U120 ECF grades section. Although only graded 99, I was very pleased with my performance, since I ended up with 3.5 points out of 5. I am going to annotate my games, in no particular order. This last-round game was the quickest out of all my games: it only lasted 1 hour 20 minutes or so. White, an ungraded opponent, opened with the King Pawn.",
        "1... e6": "So I replied with my usual French Defence, allowing White to take the centre temporarily with 2.d4, and then striking back at the centre with 2...d5.",
        "2. d4": "White's usual second move, placing two pawns in the centre in order to pave the way to quick development. Another feasible option for White is to play 2.Nf3. Also respectable is 2.d3, leading towards a King's Indian Attack.",
        "2... d5": "So I continued with Black's crucial 2nd move, striking back against White's centre. The onus is now on White to decide what to do with his e-pawn. He can advance it forwards, locking the central pawn-structure and grabbing a space advantage - 3.e5, the Advance Variation - and Black will then try to undermine White's structure on the queenside. White can also exchange pawns on d5, the Exchange Variation 3.exd5, although this is quite a quiet and (for me) boring opening, in which White's only advantage is that of moving first. Or, White can defend the pawn and develop a piece with 3.Nc3 (main line) or 3.Nd2 (Tarrasch Variation).",
        "3. Nc3 Bb4": "White plays the main line 3.Nc3, so Black renews the pressure on White's e-pawn by pinning the defending knight, signalling the start of the lively Winawer Variation. Here, White's most usual choice is to advance the e-pawn: the main line runs 4.e5 c5 5.a3 Bxc3+ 6.bxc3. Another feasible option, which several tournament opponents have played against me, is to transpose into an Exchange Variation with 4.exd5. However, White's next move is one that I have never played against before.",
        "4. Bd2": "(?!) This move sacrifices the e-pawn after 4...Bxc3 5.Bxc3 or 5.bxc3 dxe4. I could see nothing wrong with grabbing the pawn, so I moved accordingly.",
        "4... Bxc3 5. Bxc3 dxe4": "The most obvious continuation I could see for White was 6.f3, turning the pawn sacrifice into a gambit: 6...exf3 7.Nxf3 and White has a lead in development of 2 minor pieces to 0. However, I did not feel that White had compensation for his sacrificed pawn. Another idea I could see for White was 6.d5, discovering an attack against Black's g7-pawn, but 6...Nf6 and I did not feel that this attack had any real bite. White may ruin Black's pawn-structure in the future with Bxf6 when Black's queen is not defending, but that's all.",
        "6. d5 Nf6": "Blocking White's attack, and also developing a piece. This move also puts pressure on White's over-zealous d-pawn.",
        "7. Bb5+": "Again, this aggressive move might look a bit worrying, but it really has no bite whatsoever. In fact, it may even be a mistake, as Black's blocking move paves the way to a queen exchange, which is the best way for Black to consolidate his extra pawn.",
        "7... c6 8. dxc6": "White chooses to exchange his pawn off: this is the only way to avoid losing even more material. However, Black can now exchange queens, which greatly lessens the counterplay that White might try.",
        "8... Qxd1+ 9. Rxd1 Nxc6": "I recaptured the pawn, reaching a middlegame in which the queens have been exchanged off and Black is up a pawn. I was now expecting White to start trying some counterplay against my extra pawn: for example, building up pressure on it with Ng1-e2-g3, Bxf6. I might simply have returned the pawn to White, so as not to get too hung up defending it.",
        "10. Ne2 Bd7": "Breaking the pin on Black's knight, and preparing for even more exchanges. My main idea here was to exchange as much off as possible, and go into a winning pawn endgame with one extra pawn.",
        "11. O-O O-O-O": "No way was I going to castle kingside, because if 11...O-O 12.Bxf6 gxf6 and Black's king is very vulnerable to White's rooks attacking down the g-file. 11...O-O-O is much safer. 11...O-O-O also has the benefit of placing a rook automatically on the d-file, which prepares for - you guessed it - more exchanges!",
        "12. Nd4": "(?) I would give this move a question mark, because it is extremely tame and plays right into Black's hands. I was expecting 12.Ng3, threatening 13.Bxf3 gxf3 14.Nxe4 winning the pawn back. White's choice here is tamely allowing all the pieces to be exchanged off. Looking at this move, it does not even look as if White is trying to win the game.",
        "12... Nxd4": "I gladly took White up on his offer, initiating a series of exchanges.",
        "13. Bxd7+": "Forced, otherwise White loses the bishop.",
        "13... Rxd7 14. Bxd4 Rhd8": "This is a strong move that forces most of the remaining pieces to be exchanged off. White's only chance to avoid losing material is 15.Bxf6",
        "15. Bxf6 Rd7xd1 16. Bxd8 Rxd8": "16...Rxd8 is stronger than 16...Rxf1+ 17.Kxf1 Kxd8, followed by a \"king race\" into the centre. After the text, Black is threatening 17...Rd2, placing his rook in a very powerful position on the 2nd rank: White's rook will then be tied down defensively on c1, and White's king will also be prevented from charging into the centre. I don't think White can actually prevent this move.",
        "17. b3 Rd2 18. Rc1 Kd7": "Now it's time for my king to jump into the action. I was looking to lodge my king on either c3 or a3, to start hoovering up White's queenside pawns. Then Black's more active king and rook will win the endgame.",
        "19. Kf1 Kc6 20. h3": "(?) Surely it is far better for White to chase away Black's powerful rook with 20.Ke1 - the text does absolutely nothing for White.",
        "20... Kc5": "I take advantage of White's waste of a move by advancing my king further, aiming at the golden spot of c3.",
        "21. a3 Kd4": "This stops my king from landing on a3, but this is a futile move. White cannot stop Black's king from reaching both c3 and a3, so he is better off not trying - instead, 21.Ke1 to chase Black's rook away.",
        "22. Ke1 Kc3": "Too late, White. Now Black's king is so far advanced that he does not have to retreat the rook, he only has to defend it with the king. However, I was not planning to capture White's pawn with 23...Rxc2 as this is met by 24.Rd1 preparing for 25.Rd7 and hoovering up all my vulnerable pawns on the 7th rank. I had far too much to lose if I allowed that to happen.",
        "23. Rd1": "Black must exchange rooks, as otherwise he surrenders the 7th rank to White's rook.",
        "23... Rxd1+ 24. Kxd1 f5": "Now Black can win very quickly. Black's 5 kingside pawns will easily break through against White's 3 kingside pawns. White has a queenside pawn majority, but it is immobilised by Black's perfectly placed king. If White moves his king to defend the kingside, Black's king kills all White's queenside pawns and pushes his own queenside pawns home. If White's king tries manoeuvring Kd1-c1-b1-a2 in an attempt to push his queenside pawns, Black plays ...Kxc2 and then pushes his kingside pawns: White's plan is too slow.",
        "25. Kc1 g5 26. a4 a5": "Black's only deviation from his plan. This move holds White's queenside pawns firmly in place.",
        "27. Kd1 h5 28. Kc1 g4": "White's king is being completely indecisive: he has lost 4 moves out of the last 5. Black's tidal wave of kingside pawns is unstoppable and will break through easily.",
        "29. hxg4 hxg4 30. g3 e5 31. Kd1 f4": "White resigns. Black has an easily won endgame and will queen very quickly."
    },
    "url": "https://gameknot.com/annotation.pl/hastings-congress-weekend-u120-rd-5?gm=28576",
    "gameName": "Hastings Congress Weekend U120 Rd.5",
    "players": "G.Willson (??) vs. fatcat2 (99)",
    "opening": "French (C15), Winawer, fingerslip variation"
}