{
    "moves": {
        "1. e4": "A mini-tournament game, playing a teammate of mine from the Cynical Cynics. Open Game.",
        "1... c6 2. d4": "The Caro-Kann. Yuck! The more I play against it, the more irritating I find it. It hobbles us gung-ho attackers. I think I'm going to start playing the Anti-Caro-Kann from now on... ",
        "2... d5 3. e5": "The Advance Variation. I find it comical that the description in Wikipedia says \"has gained popularity after having previously been widely regarded as inferior for many years, owing chiefly to the strategic demolition that Aron Nimzowitsch (playing as White) suffered at the hands of José Capablanca in one of their games at the New York 1927 tournament.\" But that happened over 80 years ago, and it's only just now gaining popularity? Maybe that wiki article was written back in the 1930s?",
        "3... Bf5 4. Nf3 Bg4 5. Nbd2": "Wiki recommends 4. ... e6 to shore up the center followed by 5. ... c5 to challenge the center. Black instead opts to pin the white knight, losing a tempo by moving his bishop a second time. In return, white defends with the queen's knight, a move I got, no doubt, from the GK DB, though I don't like it much myself. Now white's queen's bishop is blocked. More to my taste would have been 5. Bf4 followed by 6. Nbd2. I don't see anything wrong with that move order, but the DB doesn't favor it. ",
        "5... e6 6. h3 Bh5 7. Be2": "Probably should have just played 5. Be2 and been done with it, without trapping the queen's bishop. I guess I better get myself some good analysis of the Caro-Kann and find out why white is supposed to play all these moves that don't sit well with me, then figure out whether I should just learn to accept them because they're the best moves, or whether white has alternatives that are more my style.",
        "7... Nd7 8. Nb3": "About time. This move has the advantage of challenging c5, though with black's knight on d7, it's not enough of a challenge.",
        "8... Bxf3 9. Bxf3": "8. Bxf3 seems really strange to me. It's the 4th time in the first 8 moves that black moved that bishop, and he could have just played that on move 6 and been done with it, and saved a tempo in the process. I have no analysis of this opening to tell me whether black is following sound opening theory or not, but the move seems strange to me.",
        "9... c5 10. c3 cxd4 11. cxd4": "Now we've opened the c-file, and black seems better suited to seize it for himself. Grrrrr. At least white has the lead in space and in development.",
        "11... Ne7 12. O-O Nf5 13. Qd3": "Black isn't really threatening much with his knight on f5. Still, white finds no sound attacks so I make a subtle threat. Or maybe not so subtle, but in this game, it worked well enough.",
        "13... Be7 14. Bxd5": "This move works because the pawn on e6 is doing double duty. It cannot simultaneously defend the pawn on d5 and the knight on f5. Black's pieces are getting in their own way - the knight on d7 block's his queen's defense of d5.",
        "14... exd5 15. Qxf5": "There, now I think I might like this Caro-Kann a little better now that white is up a pawn and has isolated black's pawn on the d-file. OK, OK, I'm fairly sure we've left the main lines of the opening by now.",
        "15... O-O 16. Qg4": "Threatening 17. Bh6.",
        "16... Kh8 17. Bf4": "Not so much because I want the bishop on f4, but more because I want a rook on c1.",
        "17... b6 18. Rac1 Re8 19. Qf3": "Hunting pawns. What a degrading thing for a queen, but game after game, she seems to like it.",
        "19... Nf8 20. Be3": "Black's pieces keep getting in each other's way. f8 is not a happy square for a knight.",
        "20... Ne6 21. Qxf7": "Black found a happier square for his knight, but he missed the fact that his f7 pawn was en prise. And now so is his happy knight.",
        "21... Bg5 22. Bxg5": "Black offered the trade, and white's bishop was doing very littl eon e3, and white is up two pawns, so white is glad to accept.",
        "22... Nxg5 23. Qc7 Qe7 24. Qxe7": "Another favorable trade.",
        "24... Rxe7 25. Rc6": "Thinking to double the rooks on the c-file, and fully expecting black to do something about his pawn on d5.",
        "25... Rae8 26. Rd6": "Black doubled his rooks on a file they can't really use, so even though it means giving black the open c-file, white seizes the chance to eliminate black's only center pawn, creating a pair of adjacent passed center pawns for white. Even if I didn't know how this game ends, it would be a sure bet to assume that these two center pawns will win this game.",
        "26... Ne4 27. Rxd5 a5 28. Re1": "Chasing the knight back - it has no good squares except to return whence it came.",
        "28... Ng5 29. Rd6 Nf7 30. Rxb6": "Black keeps leaving his pawns laying around, it would be rude not to clean them up.",
        "30... a4 31. Nc5 Ra8 32. Nxa4": "Black defends his pawn, but it's not really a defense. Now if 32. ... Rxa4???, white wins instantly with 33. Rb8+.",
        "32... h6 33. Nc3 Ng5 34. d5": "Time to win the game.",
        "34... Kg8 35. e6 Rae8 36. h4": "White wants to play d6! but there are one too many attackers aimed at e6. Time to chase one away.",
        "36... Nh7 37. d6": "And now the winning move.",
        "37... Re7xe6 38. Rxe6 Rxe6": "Final position. Black had been counting on the pin to prevent 39. d7 but he resigned after playing 38. ... Rxe6. In his resignation comment he noted that after 39. d7! Rxb6, 40. d8=Q+ forks black's king and rook and wins back the rook, leaving white ahead by queen and three pawns. Black could try 39. ... Re1+ 40. Kh2 and now black has nothing to stop white's pawn promotion, and queen+knight vs. rook+knight will not end well for black, especially since white has three pawns to the good and can gladly trade his queen for the black rook if he wishes."
    },
    "url": "https://gameknot.com/annotation.pl/hating-the-caro-kann?gm=23056",
    "gameName": "Hating the Caro-Kann",
    "players": "blake84120 (1899) vs. madik (1537)",
    "opening": "Caro-Kann (B12), advance, Short variation"
}