{
    "moves": {
        "1. e4": "I'm a king's pawn kind of guy.  It's what I do.",
        "1... e5": "So is Dave.",
        "2. Nf3": "I chose the king's knight this time to pressure e5.  I thought I was conceding d5.  I thought I knew Dave.",
        "2... d6": "I don't.",
        "3. d4": "The smarter move here would have probably been Nc3.  I usually don't make the smarter move.",
        "3... exd4": "and Dave gains the advantage.",
        "4. Qxd4": "I tried something different here.  I usually don't overuse my queen, especially so early in the game.  I'm still learning from every game I play though, so I thought this gave me a chance to do a little something different.\n\n....there also may be a few curse words after this.  Nothing major.  Just forewarning you.",
        "4... Nc6": "Naturally dave would respond while developing at the same time.",
        "5. Qd5": "I'm just pushin wood around.  I know I'm not in a good spot and this is costing me development of my own pieces, but I'm playing a superior opponent so I have to do things to take him out of his game.",
        "5... Nf6": "The logical next step for Dave.  He's gaining a real advantage on me at this point.",
        "6. Qb3": "I retreat.  It was fun while it lasted.",
        "6... Be7": "Dave developing and preparing to castle.",
        "7. Bf4": "I start developing some of my own here.",
        "7... O-O": "Dave gets castled.  He's out in front.",
        "8. g3": "Preparing to castle.",
        "8... Nxe4": "Dave gets pushy.  He can spot by now that I'm thinking a kingside castle and he's gonna try to muff that up.  He's a hater that way.",
        "9. Bc4": "I go on about my business.  I can't afford to lose anymore ground.",
        "9... Bg4": "Dave gets even MORE pushy.  Being that I'm still in the learning stages of the game, I can't use knights really well.  My knight is guarded, so this doesn't really scare me.",
        "10. Na3": "Dave is my friend.  He really let me have it for this move.  I don't know that I've ever seen an initial knight move to the a or h file that was annotated as smart.  My thoughts were of planning an attack up the a side at some point, plus guarding my bishop with something other than my queen.  Not wise to guard more 2 pieces with one I'm told.",
        "10... Bxf3": "Dave takes the knight.  I'm not sure if he meant to concede the bishop or if my queen had slipped his mind.  We chat while playing, and he questioned why I'd just give up a knight and allow him to pressure my rook.  He does this to play mind games sometimes, so I just played dumb (it wasn't hard to do) and said oops.  So he took my knight.  I considered it a victory to get one of his bishops off the board.",
        "11. Qxf3": "Dave acted surprised.  I don't think he really was.",
        "11... d5": "He's just pushing me around and trying to gain territory I figure.",
        "12. O-O-O": "I end up castling queen side.  This protects my bishop and puts me in a fight for the d file that I'll gladly lose to get daves queen off the board.",
        "12... Bxa3": "Before dave made this move, he told me he was going to 'school' me on how to break up my pawn structure.  He hadn't factored in my queen.  He may have been aware of her when he lost the first bishop, but he wasnt aware on this one.  At this point I've lost both knights, but the tradeoff for both his bishops would be huge for me.   Still it smells of a trap.  I hate jumping on a piece when it looks like I'm supposed to do it.",
        "13. Rxd5": "I decided to pressure his queen.  I felt I had his black square bishop if I wanted it.  I'm sure this isn't a 'book' move, but throwing Dave off his game is the only way I can gain advantage.",
        "13... Qf6": "This is when I knew Dave's attack wasn't the best put together.",
        "14. Qxa3": "Getting my queen out early turned out to be the smartest move I've made in this game.",
        "14... Nxf2": "Nothing more than a pawn grab to me.  The pressure on my rook didn't bother me, I was thinking e file the whole time.  This does restrict my king momentarily.",
        "15. Re1": "This is probably the most comfortably I've ever owned the center of a chess game against Dave.  He has no bishops, and even though I'm down a material point, I sure don't feel like it.  I remind him of his 12. Bxa3 move that was going to wreck me.  I laugh.  I tell him thats what he gets for being an asshat.",
        "15... Rfe8": "Dave is trying to gain some ground.  I never know what to do in cases like this.  The pressure is certainly applied on me.",
        "16. Be3": "I'm just guessing at somthing to do.",
        "16... Ne4": "This puts dave back in better shape.",
        "17. Rf1": "so I'm gonna apply some pressure of my own",
        "17... Qg6": "poor dave.  This was forced, but it looked so girly.",
        "18. Rd7": "To the chess world this was probably dumb.  To me it was staking out new territory!",
        "18... Ne5": "Dave apparently doesn't like my territory grab, and puts me in a fork.",
        "19. Rd4": "I concede the bishop.",
        "19... b6": "WTF??!!  Dave doesn't take it!  I have dodged a fork!  I don't understand why I'm not out a light square bishop, but I'm lovin it at this point.",
        "20. Bd5": "I'm thinking about Daves queen at this point, trying to put something together to take some of his pieces and gain an advantage.  I've got firepower pointed at his king so I've got some room for error.",
        "20... c6": "Dave takes away some of my room for error.",
        "21. Bxe4": "I'm grinning at this point.  I don't usually feel in control much during a match with a superior opponent, but here I do.  Dave calls me a queen hater.  I call him an asshat.",
        "21... Qe6": "he had to do something.  Right now I feel as if he's reacting to me.  It's a good feeling.",
        "22. b3": "This may not have been smart, but it felt smart at the time.  I could see I was a move away from being checked by dave's knight, and with his queen looking at me I felt I needed to create an escape route.",
        "22... a5": "This move makes me think I was right.  Dave is now applying the pressure.",
        "23. Rf5": "so I think it's my turn.  I fully expected a g6.",
        "23... g6": "I was right.",
        "24. Rd6": "so I applied some more pressure.",
        "24... Qc8": "and Dave ran home like a little girl.",
        "25. Rff6": "I'm all up in Dave's bidness at this point.  I'm calling him names and insulting his king (his king was a real asshat in this game.)",
        "25... Qa6": "Dave looking to get back in the mix.\n",
        "26. Bd4": "Just trying to mix up Dave's plans.  I've got a lot of firepower aimed at his king, but am still too new at the game to understand mating moves from this far out.",
        "26... Ng4": "Dave hates my rook.",
        "27. Bd3": "I hate his queen.",
        "27... Qb7": "His queen knows it.",
        "28. Rf4": "Trying to screw with Dave.  The more of his pieces I can get off the board, the better I'll be.",
        "28... Nxh2": "Dave runs like a girl.",
        "29. Bc4": "I've got a mate in mind here, but I really need my queen to be out and about and she's not.  I'm lining it up anyway.  A better player could probably squash the black king in 2 or 3 moves.",
        "29... Re7": "Dave makes it even rougher on me to try to make a kill shot at this moment.",
        "30. Qb2": "I thought this was a pretty good move, it was the beginning of me putting the screws to dave.",
        "30... c5": "This move made me think Dave didn't know what I was planning.",
        "31. Bh8": "I'm pretty sure that at this point, Dave KNEW what I was planning.  I had come up with a mating move, and probably had done so earlier than I ever have in a game with a player of Dave's caliber.",
        "31... Qh1+": "Knowing he was one move from checkmate, he mentions that he has to keep me in check or knock my queen out of line so he can 86 the bishop.",
        "32. Bf1": "I play it cool.",
        "32... Re1+": "Dave  is sweating.",
        "33. Rd1": "even moreso now.  He's throwing pieces out just trying to survive.",
        "33... Rxd1+": "virtually forced",
        "34. Kxd1": "heh heh heh.  The only bad part was my king was exposed",
        "34... Qd5+": "see?",
        "35. Bd3": "I'm pulling [what appear to be] awesome chessmoves out of my ass.  Dave is cussing.  He is a hater.  He hates.  It's what he does.",
        "35... f6": "This was a good move, It frustrated me.",
        "36. Qxf6": "I adapted.  I overcame.",
        "36... Qb7": "Dave blocks my mating move.  I am sad.  I'm struglling for things to do to salvage a mate.  I've way ahead of dave, but I'm nervous instead of thinking clearly.  I'm too focused on how I can't get the queen to g7, and I completely miss that I have him mated with Bc4.   This sort of thing is why I'm still an rookie.",
        "37. Qe6+": "Dave really gave me hell, and as you can see it's gonna cost me a bishop.",
        "37... Kxh8": "see?  NOW look at the fine shape I'm in.",
        "38. Be4": "So now I'm lost.  Just looking to clear the 7 or 8 so I can get a rook or queen on one of them\n",
        "38... Rd8+": "Dave begins attacking.  My blunder has breathed new life into his game.",
        "39. Kc1": "I didn't figure him to dare bring his queen or rook south with all the ammo I had bearing down on him.",
        "39... Qd7": "Fascinating move on Daves part.  I know he'd have rather taken a piece from me.",
        "40. Qe5+": "But I wasn't letting it happen.",
        "40... Kg8": "Nows when I was wishing I hadn't pushed his queen.  I'd have him mated.",
        "41. Bd3": "So I clumsily blunder around trying to get back.  This is a pretty climactic moment (if you can have one of those after you should have won the game already) because I figure Dave's queen is gonna dive on the grenade.",
        "41... Ng4": "I was wrong.  I forgot how big an asshat Dave really is.",
        "42. Bc4+": "...but I only had to wait a few more seconds to see his queen sacrifice her self.",
        "42... Qf7": "Heh heh heh. Die you black bitch!",
        "43. Bxf7+": "All over but the shouting (dancing in Daves case)",
        "43... Kf8": "Now to back the bishop (the one coated with the blood of Dave's queen) back out and hold the diagonal.",
        "44. Bc4+": "A lesser man would have resigned here.",
        "44... Nf6": "Not Dave.  I don't blame him, I'm the same way.",
        "45. Qxf6+": "It was the only play.",
        "45... Ke8": "As was this for Dave.",
        "46. Qf7#": "I have so many people I want to thank for this victory....\n\n\n\n\nActually no I don't.  I did it by capitalizing on Dave's mistakes.  Thats about the only way I can beat a player THAT superior to me.  He made the mistake early on and I didn't make mine until it was too late for him to do anything about it.  My little diatribe hasn't done this game the justice that it deserves, as annotating doesn't show the comments left at the top of the page, nor the instant messages that added the real flavor for the match.  Think of it in \"Down goes Frazier!!\" terms, and I hope you've enjoyed! =)"
    },
    "url": "https://gameknot.com/annotation.pl/hats-of-america?gm=1936",
    "gameName": "*** Hats of America!",
    "players": "dieselengine9 (1129) vs. graderguy (1476)",
    "opening": "Philidor (C41), Boden variation"
}