{
    "moves": {
        "1. d4": "So I start with the usual.",
        "1... d5": "He replies in the same fashion.",
        "2. c4": "I play a Queen's gambit.",
        "2... c6": "He replies with the respected Slav Defence.",
        "3. Nf3": "This is the usual 3rd move for white, designed to prevent the Slav Gambit (3.....e5), although the Slav Gambit is rarely played and is not more successful than other 3rd moves by black.",
        "3... Nf6": "He develops.",
        "4. Nc3": "As I do.",
        "4... dxc4": "And he finally takes.",
        "5. e4": "I threaten his c pawn",
        "5... b5": "He protects.",
        "6. a4": "I threaten to take twice on b5",
        "6... b4": "So he puches forward",
        "7. Na2": "Now both his b and c pawns are hanging",
        "7... a5": "He protects the b pawn. Now if I take on c4, he can take on e4, so I play....",
        "8. e5": "Hitting his knight first",
        "8... Nd5": "Knight moves.",
        "9. Bxc4": "I regain the pawn",
        "9... e6": "He gives more support to his knight, and prepares to develop his Bf8. I now had a good, long think. 10. 0-0 is of course the logical move here, presumably he replies with Be7 followed by 0-0 and it is hard to see any advantage for white. So I started looking at Bg5, then what? If he replies Be7, I can exchange bishops, and maybe my knights can manoeuvre to d3 and/or e4 and maybe into c5 and/or d6. This may be hard to counter. If he doesn't play Be7, how on earth is he going to develop his Bf8 and play 0-0? Yes Bg5 looks good....",
        "10. Bg5": "Hitting his queen, he avoids Be7 for the reasons stated already.",
        "10... Qb6": "This is the best square for the queen. From this square there is pressure on d4, for instance I can't play Nd2 with the idea of Ne4, as my d pawn will be hanging after Nd2. After the game I found there was one game on the world database with Qd7, but white won.",
        "11. O-O": "I found out later than 11.Nc1 was more often played in this position, but this seemed more natural.",
        "11... h6": "After a long think he hits my bishop. I found out later that there was a game Hauchard, Arnaud (2485) vs. Bricard, Emmanuel (2350)  1997.08.19 12. Be3 Ba6 13. Nd2 Bxc4 14. Nxc4 Qa6 15. Qc2 Nd7 16. Nc1 N7b6 17. Nxb6 Qxb6 18. Nb3 Be7 19. Rac1 Rc8 20. Qe4 Kd7 21. Qg4 Rhg8 22. Qf3 Rgf8 23. Qg4 Rg8 24. Qf3 Rgf8 25. Rc4 Kc7 26. Rfc1 Kb7 27. Qg4 Rg8 28. Qf3 Rgf8 29. Qe4 Rfe8 30. Qc2 Ka7 31. Rxc6 Rxc6 32. Qxc6 Qxc6 33. Rxc6 Bd8 34. Kf1 Kb7 35. Rc2 Kb6 36. Ke2 f6 37. exf6 Bxf6 38. Rc5 Rd8 39. Rb5+ Kc7 40. Rxa5 e5 41. Rc5+ Kd6 42. Na5 Ke6 43. Nc6  1-0. What do you think? is 12. Be3 better than what I played?\r\n ",
        "12. Bh4": "I just drop the bishop back one square, trying to prevent Be7 again.",
        "12... Bb7": "So he develops his Bb7.",
        "13. Rc1": "Trying to prevent c6-c5",
        "13... Nd7": "Now he really is threatening to free his position with c6-c5, so after another long think, I decide to take on d5",
        "14. Bxd5": "Taking off his best placed piece.",
        "14... cxd5": "He takes back this way, rather than leave a weak backward pawn on a semi-open c file, with exd5.",
        "15. b3": "Blocking up the position. As he has 2 bishops, I don't want the position opening up. In particular I wanted to stop him playing b4-b3 and maybe Bf8-b4.",
        "15... Be7": "This rather surprised me, but of course with the closed position his king is going to be quite safe on e7 and his rooks will be connected. I could play something else rather than exchange, but then he can play 0-0, contest the open c file - I don't think there is anything better.",
        "16. Bxe7": "So I take",
        "16... Kxe7": "He takes back.",
        "17. Qd2": "I connect the rook, preparing for exchanges on the c file. I think round about here I first offered a draw.",
        "17... Rhc8": "He can't allow me uncontested control of the c file.",
        "18. Rxc8": "So I take.",
        "18... Rxc8": "He takes back.",
        "19. Rc1": "For similar reasons I can't allow him uncontested control of the c file.",
        "19... Rc6": "He delays the exchange.",
        "20. Rxc6": "So I take.",
        "20... Qxc6": "He takes back.",
        "21. Qc1": "I contest the c file again.",
        "21... Qxc1+": "He takes.",
        "22. Nxc1": "I take back.",
        "22... Ba6": "He improves the position of his bishop.",
        "23. Ne1": "I plan to put a knight on d3, threatening to go to c5.",
        "23... Nb8": "He threatens to re-position his knight to c6, hitting d4.",
        "24. f4": "My Ne1 will have to return to f3, the main reason behind this move was to make f2 available for my king.",
        "24... Nc6": "He hits d4",
        "25. Nf3": "I protect.",
        "25... f6": "And this time he offers a draw, which I accept. There doesn't seem much either side can do.\r\n\r\nMany thanks for reading my annotation. I hope you found it interesting, educational and enjoyable. Please rate it on the star system and leave a comment or two."
    },
    "url": "https://gameknot.com/annotation.pl/hayles-owen-v-kidderminster?gm=44143",
    "gameName": "Hayles Owen v Kidderminster",
    "players": "Charles Higgie (BCF156) vs. Mark Bithel (BCF166)",
    "opening": "QGD Slav (D15), Tolush-Geller gambit"
}