{
    "moves": {
        "1. e4": "I'm a relative newcomer. Annotating this on the fly to show what I was thinking during the game. Might add hindsight commentary afterwards. So there will no doubt be errors in my analysis but I hope it might help someone who plays at a similar level as I do. (1200)\n\ne4 they say is one of the best openings for a beginer to learn. Often followed by 1 ..e5",
        "1... e5 2. Nf3 Nc6 3. Bb5": "We have a typical Ruy Lopez opening here. Center of action is black's e5 pawn. Both black and white can get pieces like Q and B into action quickly, and white can castle quickly.",
        "3... a6": "Popular reply, known as the Morphy Defense anfter a famous 19th century American player (from New Orleans, believe?).",
        "4. Ba4": "Still by-the-book Ruy Lopez opening.",
        "4... Nf6": "ditto",
        "5. Qe2": "most common move is 5. O-O but I thought I'd get my queen into play, cover the center pawn. Almost did 5. d4 to threaten black pawn, liven things up and make room for both queen and bishop. Having moved queen and written that I almost wish I did. Will probably castle soon.",
        "5... b5 6. Bb3": "Had no choice but to move the bishop really.\n\nChess is an old game, played long enough that people have been able to note patterns. We're on the six move but it's following a fairly common opening pattern (tho moving my queen was a little unusual.) It's still a kind of Ruy Lopez. Moving the black pawn in the 3rd move to threaten the white bishop made it a Morphy Defense. Moving the white queen in 5 Qe2 branched off the standard Ruy Lopez/Morphy line and made it a \"Wormald Attack.\" Sounds like a sci-fi B movie.\n\nBoth of us have a lot of pieces able to be put into play and neither has castled.",
        "6... Nb4": "okay, we have definitely left the standard opening.\nThis move took me by surprise. I had expected Be7 or maybe Qe7 or Bb7.\nAt first I thought I had fallen into a trap. It was so surprising I must have overlooked something. I might get forked, put in check and lose a rook for example.\nBut soon, to my albiet inexperienced eyes, it looks like a mistake. Maybe he thought he was setting something up, but most moves by his knight can be easily countered. Of course I could be overlooking something, but I'm gonna take advantage of what appears to be a mistake.\nNote also if I Nxe5 and take his center pawn, I can put pressure on f7, check, maybe get the rook or force a move.\nOne thing I'm not happy about is I'd like to get more pieces into play. But heck, it's still early.",
        "7. Nxe5 d6": "Threatens my knight obviously. 8 Knf7 would put a fork on him, threatening his queen and rook.. An exchange might follow, he could threaten my queen by moving his queen to e7 then taking the d4 pawn. If I took his queen he'd snatch it with the knight, if I didn't I'd be in check. Still, if I 8 Nxf7, my white bishop will protect the knight. There might be some exchanges but I can probably come out ahead. \n\nI expect him to Qe7 next. He might expect me to jump for the chance to grab his rook, but then he can do the above scenario of taking my queen. So I'll let my knight sit, covered by my bishop, and advance my e4  pawn to d5 where he won't want to take it with the queen because the Knight that moved to f7 covers it. ",
        "8. Nxf7 Qe7 9. d3": "ok, he kind of did what I expected.\nI moved d3 in order to cover the center pawn and in effect protect my home base of queen and king.\nI can move e5 later.\n\nIf he's not paying attention he might Nxd3 , but he'd immediately lose the N with no gain. His other gut reaction might be to take the knight on f7 (probably a bad idea.) He might move the rook to safety, good idea for him, negating the threat of my knight attack. Now that I'm analyzing my move I wonder if e5 wouldn't have been better after all. Hmm, yes it  would have. Oh well.\n\nLet's hope he does something silly then.",
        "9... Rg8": "Hmm, seems like my knight harassment came to naught.\n\nThat's ok, I think between my forward knight, the b3 bishop and my queen I can mess with him. I hadn't planned it this way but I see some opportunities now.",
        "10. e5 dxe5 11. Nxe5": "seemed kinda obvious. Besides being a pain in his ass, I have a slight materal lead, 3 pawns taken vs 2. Chess is obviously not just about a tit for tat exchange of pieces, but for players at our (low) level, I think material differences can have a big effect, and kind of snowball too.\n\nHis rook is threatened, if he moves it I can attack it again with my knight, keeping him all blocked up in that neck of the woods. If he then takes the knight on f7 with his queen, he'll lose her to my bishop. He can't get his bishop out, can't castle, can't use the queen effectively. Of course I have to make sure my own queen is ok too.\n\nI'm guessing he'll 11.. Nb4-c6 to pressure my knight and in effect my queen too.\n\nMy options include sacrificing my knight and taking his rook, or moving my bishop f7 to put him in check. My black bishoip is available -- to go to g5 and threaten his knight/queen. I'd like to castle when I get a chance but not until this plays out more.\n\nI don't know if anyone will read this notes or find them useful, but they also help me clarify to myself what my plans are.",
        "11... Bg4": "First I thought, okay, I can just f3 to block his bishop. \n\nThen I thought, wait, I can move my white bishop to f7 and put him in check, threaten his rook, move the knight to c3 and check the king again and so on. But I think the end result of that would be I'd win a rook and end up loosing a queen and or bishop. For example his b4 knight could take my potential c6 knight risk free. Bad idea for me. So it's premature.\n\nNow f3 doesn't look so bad after all. I still might be able to set up those other moves if I keep the pressure on.",
        "12. f3 Bf5": "Ok, I admit it. I was a little smug. Whether by chance or design he's got a decent setup now. \n\nFor example, my queen is kind of stuck on the e column in order to hold things together. I can't do so much with the white bishop because he7s covering the c2 square, which keeps hom from forking my rook. (Nc2 , I move king, he gets rook.) So at present not much I can do with Q or white B. \n\nBlack's probably gunning to get his queen on c5, especially after I castle. Maybe that's why he did the little dance with his white bishop; in order to get the awn out of the way, opening up a shot at the castled king and threatening the d3 pawn and therefore queen.\n\nI can block him preemtively with Be3 but then my queen can't protect the center knight.\n\nIn other words, he is now projecting a lot of noise into my neck of the woods, just as I thought I was doing to him.\n\nI think my best bets now are to either castle (more freedom for my queen) or a preemptive Qe3?",
        "13. Qe3": "I can cover my knight & king, preemptively block black queen attack on my king if I castle, and if I Qd4, block escape of his king should I check with my white bishop. \n\nAs for his next move, I wonder if he'll Nd5 or maybe Nxc2 gambit? His a8 rook can be brought into play too... I feel like Im using only half of my pieces.",
        "13... a5": "I'm writing this as I play, so you can see I didn't expect it. Maybe he's trying to pressure my wite bishop out of the way so he can check with his knight?",
        "14. Qd4 Qc5": "okay I went away to a big reunion for the weekend and am just coming back to the game, so I've kind of forgotten the dynamics. But it looks like I'm in a bit of a bind too.\n\nThe game is tight enough that we're both putting pressure on the opponent's home camp, yet open enough that there's plenty of opportunity for grabbing material too. His 2 knights are really doing a good job of limiting my options. Knights are tricky too, it's easy for a beginner for me to overlook their danger. For example Qd7  is easily solved by his Nf6xQ. Same goes for me trying to get his rook with my white bishop.\n\nThe options I've considered are: castleing (NG - lose my queen), c3 (cover the queen), Qf4 (protect my queen, pressure him, but leaves him too many options, Be3 (protect queen, get 2nd bishop into play, not bad) or Bf7 .\n\nI'm choosing the last one. He might be able to squirm out of it, but I should end up with a material advantage (namely his queen) and if he makes a mistake, even a checkmate in 2 moves. When he moves his king out of check, his only choice is e7, which blocks his bishop that's covering his queen.",
        "15. Bf7+ Ke7": "Gee, what should I do?\n\nOh, this is gonna feel good.\nNot only that but it'll hold off his ability to put me in check with Nxc2 ",
        "16. Qxc5+ Kd8": "Ok, he's on the run and can probably eventually get himself out of this \"groundhog day\" endless cycle of mate and escape. But in the meantime I can probably grab some material and by forcing his move, have more say in the outcome.\n\nI'd like to get more of my pieces into play. Taking out that pesky knight on b4 sure would be nice too. At this point castling is not so important to protect my king, but rather to get a rook into play. In fact castling could endanger my king by leaving him exposed to blacks black bishop, and also by blocking myself in with the corner pawns, creating the possiblility of getting trapped by an attack of his rooks on the 1st rank. So I'll hold off on that.\n\nBut the way things are now, with him on the run, and a material deficit that's not a big worry. The number one task for me now is to, um, god save the queen. If we were chess geniuses, who knows, there might be some advantage to sacrificing the queen to avoid a trap, but at the moment that's obviously not the case.\n\nI'm going to take his b5 pawn. The queen will still be in a position to threaten the king and protect my pieces. I'm guessing he'll Kc8 to find an escape route. I'd be delighted it if he does Ke7.",
        "17. Qxb5 Nxc2+": "after 17..Nxc2 \n\nokay, as you can tell by my notes, I wasn't expecting that. Frankly I was too caught up in my attack to notice. So let that be a lesson to fellow beginners: don't forget that the other guy has plans too.\n\nMoving my king to d2 might be a bad idea. If he checks with Bb4 I can just scoot the king over and grab his knight, which would be nice. But he might not do that. He might just grab my a1 rook instead. If his f6 knight were out of the way I could check with my queen easily -- but the knight is there, so I'd like to take it with my black bishop. But if my king is on d2 as above, he's in the way of my black bishop.\n\ne2 might also be bad. picture this scenario: king goes to e2, safe for now. He moves his c2 knight to d4, check again. I move king to safety, he takes my queen with the knight.\n\nso I'm thinking d1. It threatens his knight, who will probably just take my rook. Then I can get my black bishop into play and try to get rid of his damn knight on f6. One good thing that will come out of this is I can get my other pieces into play finally (like the h1 rook), but I wish the circumstances were a little different.\n\nOther things I'm thinking about are taking his g8 rook in a sacrifice bid (but probably a bad idea) or now that his forward (c2) knight is out of the way, checking with Nc6 using the knight and queen to mess with him.",
        "18. Kd1 Nd4": "Once again c6 is no-go zone. It's amazing how much territory 2 knights can cover. I bet a lot of beginners blunder by moving an important piece to a spot like c6 or e8 that's covered by a knight.\n\nI need to move my queen both to safety and to somewhere where she can be effective. That's my immediate priority. My guess is he'll start applying pressure with his forward night, white bishop and maybe finally get the black bishop into play. I hope to do the same to him first.\n\nI think 19 Qb7 accomplishes that. He might move his rook to safety, attack my knight with his black bishop or do something funky with his forward knight.\n\nNotice too that all I talk about is 1 or 2 move ahead tactics. That's because I'm not a great player. But my opponent isnt ranked 1800  either, so it's ok.",
        "19. Qb7 Rc8 20. Bg5 Rh8": "I toyed with the idea of sacrificing my e5 knight by checking at c6, but I think I can use that combination later.\nInstead I'm going ahead with the original plan and taking out his knight on f6. I'm not sure if it's a better move, but I think it will get one of his troublesome pieces out of the way and keeps my e5 knight in a useful spot, both locking in his king and protecting my white bishop. I expect him to takeback with a pawn. If not, he might block with Be7 but if he does that I could checkmate with Qd5  .",
        "21. Bxf6+ Be7": "Sorry if this is unclear. It's 2am and my friend visiting from another country just left after several beers, weird herbal chinese liquor, single malt scotch, and cheap japanese gingerbread cookies. Anyway,...\n\nI'm surprised. I expected him to take my bishop (g7xf6). He'd still have some options. He takes my bishop, I check with my queen (Qd5), he moves the king to safety (Ke7) I check with my knight (Nc6) he takes said knight (Nxc6)... it's still a bad situation for him but with every move there is the chance that I'll make a mistake and he can stay in the game. \n\nSo blocking with his bishop seems like he's not paying attention. I can easily checkmate. To his credit, he's playing a dozen games at the same time, while I've only got two. So I guess he overlooked something. Or maybe I have...\n\nAnyway, I think it's 22 Qd5  ..Bd7 (he blocks w white bishop) and 23 Qxd7  ",
        "22. Qd5+ Bd7": "Game over. \nBlack (jason2141) resigned and said \"good game.\" (otherwise 23 QxBd7 checkmate)\n\nOff the top of my head, I'd say some key points were when he lost his queen, and early in the middle game when he managed to presure my side, and when I first checked with my white bishop 15. Bf7 . The bishop-knight combination really held things together for me. For his part, he really kept me off balance by making good coordinated use of his 2 knights. My feelings towards the game from start to finish went \"I'm gonna win this, this guy is moving strangely... oh jeez I didnt see that, maybe I've left myself vulnerable... okay, tables have turned again and if I keep the pressure on I'm set.\""
    },
    "url": "https://gameknot.com/annotation.pl/heat-wave?gm=8940",
    "gameName": "Heat Wave",
    "players": "scott_linyard (1200) vs. jason2141 (1209)",
    "opening": "Ruy Lopez (C77), Wormald attack, Gruenfeld variation"
}