{
    "moves": {
        "1. c4 e6 2. Nc3 d6 3. g3 c6 4. Bg2 a6": "Black is playing the notorious Hedgehog Defense which was pretty popular in the 1980s and early '90s. The idea is that Black can build a shell nigh-impossible to crack if he keeps all his pawns close to home and doesn't do anything \"crazy\" ...like develop his pieces beyond the 2nd or 3rd ranks. As weird and unchesslike as all this sounds, the Hedgehog actually is a difficult defense to overcome. White's soundest plan requires patience: it's simply to develop normally and to gradually play to gain space, controlling the first 5, and then 6, ranks of the board, constricting Black like a big python and working for an unstoppable breakthrough. If Black can survive this process, he can generally catch White napping at some point, and suddenly start playing \"real chess\" with pawn breaks and piece-led attacks of his own. Back in the 80s, the Canadian GM Duncan Suttles was a virtuoso of the Hedgehog, and occasionally used it to beat or draw with world-class players much better than himself.",
        "5. d4 Be7 6. e4 h5 7. h4 Nf6 8. Nge2 Ng4 9. O-O Bxh4": "A very un-Hedgehog-like sacrifice. A little too optimistic too, although at subsequent points you wouldn't know it from White's play.",
        "10. f3": "!0. gh4 Qh4 is curtains, of course. The text gives White his choice of piece captures.",
        "10... Bxg3 11. Nxg3 Nh2": "Resourceful. If 12. Kh2 (a plausible move) Qh4, winning the N on g3.",
        "12. Re1 h4": "After 12. ...Qh4  13. Kf2, Black has nothing.",
        "13. Nf1 h3 14. Bh1": "Blacks's pieces look funny. White's pieces look funny. Everybody's pieces look funny.",
        "14... Nxf1 15. Kxf1 h2 16. Qe2 b5 17. e5": "Although the idea is good - to keep Black's QB at home with nothing to do - this move is too passive. What White needs most here is energy, for example 17. Qg2, taking control of the sensitive g-file.",
        "17... Qh4 18. Qf2": "Guarding the d-pawn.",
        "18... Qh3+ 19. Ke2": "-- ! -- Getting the King out of Dodge. Black's current attack will fade if he can't threaten to Queen the h-pawn AND harrass White's King at the same time.",
        "19... bxc4": "-- ! -- Look what happens if Black can get his Q to d3 in the current position.",
        "20. exd6": "-- ? -- Inconsistent. Instead, Qg2! draws all the sting from Black's delusions of grandeur.",
        "20... Rh4 21. Be3 Nd7 22. Rad1 Bb7 23. Ne4 Rxe4": "Despite White's weak play, Black has still reached the point where he's virtually run out of useful moves, resulting in this somewhat all-eggs-in-one-basket attempt to fertilize the attack. Sure, a sacrifice netting 3 pawns for a piece almost always looks like a good investment; but then you have to be able to *do* something with your extra pawns to make the speculation worth the risk. Now Black goes from a starting point of being a minor piece down for 3 pawns to being a Rook down for 2 pawns.",
        "24. fxe4 O-O-O 25. e5 f6 26. Bf4 fxe5 27. Bxh2": "Even more accurate was 27. Qh2!",
        "27... Rf8 28. Qg3 Qh5+ 29. Kd2 Qh6+ 30. Kc2 Qh7+ 31. Kc1": "Had I not been very short of time I would have noticed 31. Be4.",
        "31... Qh6+ 32. Kb1 Rf4 33. Re4 Qh7 34. Ka1 Rh4": "-- ?? -- Black finally cracks in a big way.",
        "35. Rxh4": "Black's attack has vanished and White is now 2 Rooks to the good, so Black throws in the towel. Far from a perfect or even pretty game (what with White playing just weakly enough to keep the fires of hope bright in Black's breast), yet still fun to play as blitz games go."
    },
    "url": "https://gameknot.com/annotation.pl/hedgehog-defense-blitz-game?gm=46317",
    "gameName": "Hedgehog Defense (Blitz game)",
    "players": "Avocet (1200) vs. mikebutcher (1610)",
    "opening": "English opening (A13)"
}