{
    "moves": {
        "1. d4 d5 2. c4": "The Queen's gambit.",
        "2... e6": "This the Classic variation, other possibilities are c6: the Slav, dxc4: accepted Queen's Gambit, Nc6: Tsjigorin, c5: Austrian defence and the ambitious e5, Albin's Counter Gambit.",
        "3. Nc3 Nf6 4. Bg5": "These are all very typical moves.",
        "4... Be7": "Another pretty cool variation is 4. ... Nd7, The Cambride Springs. If white is so stupid to think he wins the pawn on d5, he's wrely mistaking! Because after 5. cxd5 exd5 6. Nxd5? Nxd5! 7. Bxd8 Bb4  white has lost a minor piece.",
        "5. e3": "A logical move.",
        "5... h6 6. Bh4 O-O 7. Nf3 Nbd7": "Now he comes! The variation I didn't find in the books! The idea is simpel,  b6, Bb7 and c5 with an attack to the center. ",
        "8. Bd3 b6": "I'm following my plan.",
        "9. Qc2": "This is a bad move. Now it becomes equal, and before this move he stood better. He could play a active and a strong move like Rc1. If my rook can come to c8, he will have problems with the c-line.",
        "9... Bb7 10. h3": "This is a typical bad move. What's the point of a move like h3? g4 is impossible, because I can win a pawn with taking c4. ",
        "10... c5": "A good move! I take the advantage!",
        "11. Nd2": "A really very bad move! I can win the pawn on g2, bud I didn't...",
        "11... dxc4 12. Nxc4 Qc7": "A dubious move, I can take the pawn on g2 and have an easy win, but I was scared about Rg1, but that doesn't give me any danger. This was really paranoid of me!",
        "13. f3": "He doesn't give me a chance to do it  now! The proof that it was possible!",
        "13... Rac8": "I want to prepare b5 with a6, but he does a blunder!",
        "14. O-O-O": "??? after cxd4 I have the advantage an can I win easly.",
        "14... cxd4": "This is a problem, because after Nb5 Qc5 follows.",
        "15. exd4 Qf4+": "A double attack on king and bishop.",
        "16. Kb1 Qxh4 17. Qe2 Nh5": "A bit naive, evryone sees the double attack on g3, but you never know...",
        "18. Qc2": "He goes back, I think he likes a draw. But who won't in this position?",
        "18... Bb4": "I want to play Bxc3 and after the queen takes, he loses his night on c4, so he has to take with the pawn, and I don't think he likes to pay something like that.",
        "19. Qa4 Qe7 20. Qxa7": "Desperately...",
        "20... Bxc3 21. Qxb7": "This is a bad move, he gives me chances to finish it fast.",
        "21... Qb4": "This is a strong move! Tricking Rxc4...",
        "22. Kc2": "Better was 22.a3 Qb3 23.Rc1",
        "22... Rxc4": "A beautiful move! I'm preparing a second sacrifice... b2 is his killing weakness...",
        "23. Bxc4 Qxb2+ 24. Kd3 Nc5+": "The second sacrifice! This must be painful for him...",
        "25. dxc5 Rd8+": "The rook helps the other pieces!",
        "26. Ke3": "After Ke4, I play f5  with the same end.",
        "26... Bd2+ 27. Ke2 Bf4+ 28. Ke1 Bg3+ 29. Kf1 Qf2#": "Checkmate! I think this is a game to be proud of it! Still, I made some mistakes, by example 12.Qc7?"
    },
    "url": "https://gameknot.com/annotation.pl/hengelo-2008?gm=19867",
    "gameName": "Hengelo 2008",
    "players": "Van der Ham, Mark (1758) vs. Van den Heede, Dorian (1716)",
    "opening": "QGD (D53), Lasker variation"
}