{
    "moves": {
        "1. d4": "I have been playing D4 for four months now after 20+ years of E4 I don't know why I didn't try it earlier",
        "1... Nf6": "A typical response (infact I play this myself)",
        "2. Bf4 d5 3. Nf3 c5": "Black goes on the offensive",
        "4. c3 Nc6 5. e3 Qb6": "I debated offering the queen exchange here",
        "6. Qc1 Bf5 7. Nbd2 e6 8. Nh4": "I decide that I want the d3 square for my bishop",
        "8... Bg4 9. Bd3": "Mission accomplished",
        "9... Be7 10. h3": "Now to chase the bishop and give my black squared bishop an escape square",
        "10... Bh5 11. O-O cxd4": "I was surprised by this but it does open the c file for black",
        "12. exd4 O-O": "I suspect black is planninng rook to c8. I need to bring my knight back to a more active square",
        "13. Nhf3 Rac8": "Sure enough the Rook comes accross",
        "14. Qb1 Bxf3": "Black exchanges his bishop",
        "15. Nxf3 Rfe8 16. Re1": "All is even at the moment but white has a little more pressure",
        "16... h6 17. a4": "Time to switch focus to the queenside",
        "17... Qd8 18. Qd1 a6 19. Ne5 Nxe5 20. Bxe5 Nd7 21. Bf4 Nf6 22. a5 Bd6 23. Qf3 Bxf4 24. Qxf4 Qc7 25. Qe3": "I don't want to exchange just yet",
        "25... Nh5": "I will deprive the knight of squares",
        "26. g3 Nf6 27. Kh2 Kh8 28. Kg2": "Should have moved there before",
        "28... Kg8 29. Ra3 Nd7 30. Raa1 e5 31. dxe5 Rxe5 32. Qd4": "Now we are moving towards an end game which I believe will favour white because of the isolated Queens pawn",
        "32... Rce8 33. Rxe5 Rxe5 34. f4 Re7 35. Qxd5": "The pawn falls",
        "35... Nf6 36. Qc4 Qd8 37. Rd1 Nd5 38. Bh7+ Kxh7 39. Rxd5": "Ouch",
        "39... Qe8 40. Kf2 Kg8 41. Qd3 Qc6 42. Rd8+ Re8 43. Rxe8+ Qxe8 44. Qd5": "It is a matter of time, blacks best hope is to avoid the exchange of queens and try to steal a pawn back",
        "44... Qe7 45. b4 Qc7 46. c4 Kf8 47. Kf3": "White is pressing forward",
        "47... Ke7 48. Qe5+": "The queens must come off and now it is a formality",
        "48... Qxe5 49. fxe5 Kd7 50. Ke4 Ke6 51. b5 Ke7 52. Kd5 Kd7 53. b6 h5 54. c5 g5 55. g4 h4 56. c6+": "Black resigns. This was a hard fought game and I was very relieved to get the point."
    },
    "url": "https://gameknot.com/annotation.pl/her0-vii?gm=23877",
    "gameName": "her0 VII",
    "players": "dwardman (1987) vs. dickes (1817)",
    "opening": "Queen's pawn game (A45)"
}