{
    "moves": {
        "1. e4": "The only move I play as White.",
        "1... e6": "I silently prayed that my opponent wouldn't play The Sicilian and to my pleasant surprise he played The French! Which gave me confidence because at the time I was very obsessed with The French. ",
        "2. d4 d5 3. Nd2": "Amusingly enough, at the time I only knew the Advance Variation well. But I had been recently told that it was an inferior opening, so I opted for the Tarrasch variation for the first time ever.",
        "3... Nf6 4. e5 Nfd7 5. Bb5 c5 6. c3 Nc6 7. Ngf3 Qb6 8. Qa4": "\"An odd attack\" as my brother described it. I liked it though!",
        "8... Be7 9. Nb3 c4 10. Bxc6 bxc6 11. Na5 Nb8": "Something about this position makes me feel like Kerry Xing made a mistake. Perhaps it was 9...c4?",
        "12. b4 cxb3 e.p. 13. axb3": "13 Rb1 is definitely better since it allows me to control the b-file.",
        "13... O-O 14. O-O c5": "Now Black has serious counterplay, pushing me out of his territory and developing his tangled up pieces swiftly.",
        "15. Be3 Bd7 16. Qa2 Nc6 17. Rfb1 Rfc8 18. Nxc6": "My knight wasn't doing anything. His was putting pressure on my pawns. So I liked this exchange.",
        "18... Bxc6 19. Qa5": "I just wanted to trade down pieces and ease all pressure off my pawns.",
        "19... Bd7 20. h3 Qxa5 21. Rxa5 cxd4 22. Bxd4": "I decided to do this, rather than 22 cxd4 because I didn't want to open up the c-file. Although it wasn't pretty how my bishop was stuck there defending my C and E-pawns, I was confident in being able to defend the position.",
        "22... a6 23. b4": "If I could somehow trade my knight for the dark-squared bishop, my bishop would have a beautiful fort at c5.",
        "23... Bb5 24. Rc1": "? Horrible rookie mistake. But this is not the worst of it.",
        "24... f6": "? He misses my error! Now I have a chance to fix it with 25 Re1.",
        "25. g4": "? But no, I realize the silliness of my position immediately after making this move. I was mostly shocked that the State Champion hadn't noticed it! ",
        "25... Bxb4": "Sadly, when one player notices something obvious on the board, so does the other player.",
        "26. Rxb5": "?! At this point my position is horribly destroyed and Black would have eventually won. So I decided to do a Hail Mary play, and hope for some sort of draw.",
        "26... axb5 27. Rb1 Bxc3 28. exf6": "Not the hottest move. I should have just taken the b-pawn immediately. It may have continued 28 Rxb5 Bxd4 29 Nxd4 fxe5 30 Nxe6 and then I would only have to worry about two advancing pawns, not three!",
        "28... gxf6 29. Rxb5 Ra4": "I wanted Black to trade bishops with me. But he refused.....",
        "30. Be3": "So I preserved my bishop, hoping to sack it to get rid of these troublesome pawns.",
        "30... Rb4": "Kerry Xing shows his marvelous endgame skills. This move forces me to trade rooks, which is a crushing blow to White.",
        "31. Rxb4 Bxb4 32. Bd4 e5 33. Nxe5 fxe5 34. Bxe5": "Only one pawn left to worry about! If only it were on the e-file.",
        "34... Bc3 35. Bf4 d4 36. Kg2 d3 37. Kg3": "?? I was planning a hopeless pawn storm, when I made this blunder.",
        "37... Be5": "And Kerry Xing denys me the ability to sacrifice my bishop for his pawn with this beautiful move. Kerry Xing went on to gather two draws, gaining the title of \"Former State Champion\""
    },
    "url": "https://gameknot.com/annotation.pl/high-school-state-individuals-championship?gm=29236",
    "gameName": "High School State Individuals Championship",
    "players": "Micah Losee (1461) vs. Kerry Xing (2107)",
    "opening": "French (C05), Tarrasch, Botvinnik variation"
}