{
    "moves": {
        "1. c4 Nf6 2. g3 g6 3. Nc3 Bg7 4. Bg2 O-O 5. d4 d6 6. e4 c6 7. Nf3 Bg4 8. h3 Bxf3 9. Qxf3 Nbd7 10. O-O a6 11. e5": "? This is something of a blunder, costing me a pawn and giving black's knights access to central squares which can threaten my queen.  I wasn't thinking when I played it, but I recover well:",
        "11... dxe5 12. d5": "My QB on the long diagonal is made more powerful by having pawns clear the way.",
        "12... cxd5 13. Nxd5 Nb6 14. Nxf6+ Bxf6 15. b3": "?  Again, I'm wandering into traps.  To save the threatened pawn, an offensive is in order - 15. c5 and my attack would have gained momentum.",
        "15... e4": "Black's capitalizing on my blunder.",
        "16. Qxe4 Bxa1 17. Qxb7 Rb8 18. Qxa6 Bg7 19. Be3 Qc7 20. c5 Nd7 21. c6 Rba8 22. Qb7 Qxb7 23. cxb7 Rab8": "? If 23. ... Rxa2 I probably would have resigned in short order, but this gives me an exchange in return and fine attacking chances.  I have three passed pawns (one set doubled, but still passed) threatening to crown right under the influence of my bishops.",
        "24. Ba7 Ne5 25. Bxb8 Rxb8 26. a4 Nd7 27. Rc1 Be5 28. Rc8+ Kg7 29. a5 Bd4 30. Rc7 Nc5 31. b4": "Perhaps a blunder after 31. ... Na6 32. Rxe7 Nxb4, but my pawn is doubled to begin with.",
        "31... Na6 32. Rxe7 Nxb4 33. Rc7 Ba7 34. g4 h6 35. Rc4 Nd3 36. Rc2": "Guarding f2.  I was concerned about Ne1, but it works out about the same way as the line played.",
        "36... Nf4 37. a6 Nxg2 38. Kxg2 Kf6 39. Kf3 Ke6 40. Rc8 Kd7 41. Rc2 Kd6 42. Ke4 Bc5 43. f3": "Black tries to establish a \"bridge\" under which his king can attack my passed pawns.  I simply move my pieces to light squares where the bishop can not attack them.",
        "43... Ba7 44. Kd3 Bg1 45. Rc4 Ba7 46. Rf4 Rd8 47. Kc4 Ke6 48. Kb5": "This idea was ill-conceived and short-lived.  I thought my king could join in the protection of the passed pawns, but after 48. ... Rd5+  49. Kc6 Rd6  50. Kc7 Bb6  checkmate can not be avoided.",
        "48... Rd5+ 49. Kb4 Bc5+ 50. Kc4 Ba7 51. Kb4 Bc5+ 52. Kc4 Ba7 53. Re4+ Re5 54. Kd3 Rxe4 55. Kxe4 f6 56. h4 g5 57. hxg5 hxg5 58. f4 Bb8": "If black had attacked, I might have had realistic winning chances by placing my king on f4.  His move, however, is much more intelligent.",
        "59. fxg5 fxg5 60. Kd4 Kd6 61. Ke4 Ke6": "I offered a draw because this was indeed a drawn position.  My pawns can not move or the bishop will take them, the bishop can not go far or my pawns will crown, neither king will let the other pass, and the pawns are, of course, locked.",
        "62. Kd4 Bh2 63. a7": "63. Ke5! and again, I have winning chances!  Black's 62. ... Bh2 does not compromise his position, but it weakens his defences and practically forces the draw, if no more, into my hands.  However, I moved 63. a7??, a game-compromising blunder, because I didn't think to examine the whole board before leaping.",
        "63... Bg1+ 64. Ke4": "A shame too, because the rest of this game had been fascinating, active top-level (for me, anyway) play.  At this point, though, Black simply converts his material advantage and crushes my feeble remainder.",
        "64... Bxa7 65. Kf3 Ke5 66. Kg3 Ke4 67. Kh3 Kf3 68. Kh2 Kxg4 69. Kg2 Kf4 70. Kh2 Kf3 71. Kh1 g4 72. b8=Q Bxb8 73. Kg1 Ba7+ 74. Kh1 Bc5 75. Kh2 g3+ 76. Kh1 g2+ 77. Kh2 g1=Q+ 78. Kh3 Qg3#": ""
    },
    "url": "https://gameknot.com/annotation.pl/highs-and-lows?gm=12339",
    "gameName": "\"Highs and Lows\"",
    "players": "erlepettus (1374) vs. kbg0 (1634)",
    "opening": "English, 1...Nf6 (Anglo-Indian defense) (A15)"
}