{
    "moves": {
        "1. Nc3": "1. Nc3 - Freddy kicks off with his favourite opening, The Dunst Opening.  It is surprising just how many attacking possibilities Freddy has conjoured up against me over our many games with this opening.  There is a Gameknot Analysis version for you to refer to here which will help as you go through this game.  http://gameknot.com/analyze-board.pl?bd=13966533&fb=1&rnd=0.07685759369442413",
        "1... d5 2. b3": "2. b3 - almost transposing into a Larsen's Opening.",
        "2... Nf6 3. e3 e5": "3. ....... e5 - hmm, Freddy is allowing his opponent a lot of space in the centre.",
        "4. Bb2 Nc6 5. Nf3 Bg4": "5. ...... Bg4 - pin.",
        "6. Be2": "6. Be2 - develops a piece, breaks pin and prepares to castle.",
        "6... a6 7. d4 e4 8. Ne5": "8. Ne5 - this move triggers off a few exchanges.",
        "8... Bxe2 9. Qxe2 Bd6 10. Nxc6 bxc6": "10. ...... bxc6 - now one pair of knights has disappeared from the board.",
        "11. Na4 Nd7 12. Qh5": "12. Qh5 - now Freddy moves his queen to an aggressive square, but how is he gonna follow it up I wonder?",
        "12... O-O": "12. ...... 0-0 - Darren doesn't seem too fazed by Freddy's queen and castles kingside.",
        "13. c4": "13. c4 - an attempt at undermining Darren's pawn chain.",
        "13... f5": "13. .... f5 - this move blocks out the attack from the WQ onto the pawn on d5 which was twice attacked and only once defended prior to this move.",
        "14. Rc1 f4 15. O-O f3": "15. ..... f3 - pawn storm.",
        "16. cxd5 fxg2 17. Kxg2 Nf6 18. Qg5 h6": "18. ..... h6 - Darren has a pawn minus but is having fun chasing Freddy's queen around.",
        "19. Qf5 Nxd5 20. Qe6+ Kh8 21. Qxe4 Qg5+": "21. ....... Qg5+ - now Darren's queen comes into play and makes use of the open g column to attack Freddy's king.",
        "22. Kh1 Rae8 23. Qg2 Qh4": "23. ...... Qh4 - Darren decided not to trade queens here, I probably would have done.",
        "24. Nc3 Re6 25. f4": "25. f4?? - this move loses firstly the e3 pawn but more importantly Freddy's queen and KR find themselves caught in a knight fork!",
        "25... Nxe3 26. Qg3 Qh5": "26. ...... Qh5 - so Darren eschews QxQ followed by NxR, interesting decision.",
        "27. Rf3 Nf5": "27. ..... Nf5 - Freddy's queen is still given the runaround!",
        "28. Qh3 Qf7 29. Rg1 Rfe8 30. Rf2 Bb4 31. Qg4": "31. Qg4 - Freddy is putting pressure on g7 but now Darren is up to some serious skulduggery and starts off with planting a rook in Freddy's camp with Re3.",
        "31... Re6e3 32. Nd1 Re3e1": "32. ...... Re1 - hmm, will Freddy now trade rooks?",
        "33. Rgf1 Qd5+ 34. Kg1 Re8e6": "34. ..... Re8e6 - preparing a rook swinger to g6 perhaps?",
        "35. Qf3 Re1e4 36. Qh5 Kh7 37. Qh3 Rg6+": "37. ..... Rg6+ - at last, here is the swinger - now guys and dolls, just take a look at that h1-a8 diagonal and what is lined up on that, a BR and a BQ, so if Kh1?? here then Freddy will drop his queen to a move such as Re3 disc ch.",
        "38. Rg2 Ree6 39. a3 Be1": "39. ..... Be1 - Darren is not afraid to put yet more pieces in Freddy's camp.  ",
        "40. Rg5 Nh4 41. Qg4 Qe4": "41. ...... Qe4 - there is a lot of cat and mouse going on here.",
        "42. h3": "42. h3 - Freddy is making his king very draughty now but I just wonder how Darren is gonna take advantage of this.",
        "42... Qc2 43. Bc3 hxg5": "43. ..... hxg5 - ouch, Freddy is now fleeced of a rook!",
        "44. Bxe1 gxf4": "44. ..... gxf4!! - Double and Treble Ouch! - Freddy's queen is pinned to his king and that can only mean one thing!  His queen is gonna drop.",
        "45. Bxh4 Rxg4+ 46. hxg4": "46. hxg4 - so, Darren now has a 4 point material advantage over Freddy, but can he convert it to victory?",
        "46... Rh6 47. Bf2 Qe2": "47. ....... Qe2 - the first mate threat rolls up, i.e. Qxg4+, Bg3 then Qxg3#.",
        "48. Ne3": "48. Ne3 - stops the mate but only temporarily, Freddy now falls further behind in material.",
        "48... fxe3 49. Kg2 Qxg4+ 50. Bg3": "50. Bg3 - the only move but black is not finished with him, not by a long chalk.",
        "50... Qe2+ 51. Kg1 Rh3": "51. ..... Rh3 - closing in.",
        "52. Rf3 Qxf3": "52. ...... Qxf3 - this is absolutely anhilating - for Freddy.",
        "53. Bh2 Qf2+": "53. ...... Qf2+ - #2.",
        "54. Kh1 Qf1#": "54. ..... Qf1 MATE!!!! - so the Master Mater is ....... MATED!  So Darren the Pawnbandit steals Master Freddy's king in broad daylight and bags a 16.4 rating point swag!  Congratulations and Well Played, Darren!"
    },
    "url": "https://gameknot.com/annotation.pl/highway-robbery?gm=32542",
    "gameName": "Highway Robbery!",
    "players": "easy19 (2222) vs. pawnbandit (1965)",
    "opening": "Dunst (Sleipner, Heinrichsen) opening (A00)"
}