{
    "moves": {
        "1. e4": "Team match, I'm white, and I begin with the open game. Again. Seems a common theme for me, but I like the attacking potential of the open game, and the Ruy Lopez in particular.",
        "1... c5 2. Nf3": "Of course, the Sicilian slows me down some. Usually.",
        "2... d6 3. d4 cxd4 4. Qxd4": "The Checkhover variation. I have been playing 4. Qxd4 in both the Philidor and the Sicilian. Probably too aggressive, and sooner or later, someone will put me in my place for it, but so far it's been fun bringing out the big gun so early.",
        "4... Nc6 5. Bb5 a6 6. Bxc6+": "Forced to capture. If I retreat back toward f1, I lose the queen. If I retreat to a4, black plays 6. ... b5 and now I have to decide whether to lose bishop or queen.",
        "6... bxc6 7. Nc3 Bb7 8. O-O": "Just developing and following opening principles - except the one about early deployment of the queen.",
        "8... h6 9. Qa4": "Thinking that if I pin the black pawn on c6, I can play a knight to d5.",
        "9... e5 10. Rd1": "Pinning another pawn, this time with a direct threat against the pawn on e5 that isn't really defended by the pinned pawn on d6.",
        "10... Nf6 11. Nxe5": "Black didn't see the threat, so I am obliged to show him.",
        "11... Qc7 12. Nc4": "Black unpinned his pawn on d6 and simultaneously threatened my knight on e5 - I must retreat him. This puts some good pressure on the d6 pawn, and I plan to add more.",
        "12... O-O-O 13. Bf4": "More pressure on d6, but black's castle brought a rook into the defense. Now the pawn is pinned by the white bishop on f4 and cannot immediately advance. Of note, it might have been imprudent for black to castle queenside with white having 4 pieces already on the queenside bearing down on a broken pawn formation.",
        "13... Nd7 14. Nxd6+": "Black's knight on d7 blocks his rook's defense of the pawn on d6. Three to two, time to pounce. I'm now up by two pawns, so I feel a little liquidation is in order. Black will either recapture with his bishop, or I will be free to take the bishop on b7 next move. Either way, I'll trade this knight for a bishop.",
        "14... Bxd6 15. Bxd6": "As planned. The black queen only has one move.",
        "15... Qb6 16. Ne2": "En route to d4 to threaten the isolated pawn on c6. I am not worried about the pawn on b2. It is very well defended.",
        "16... Qxb2 17. Rab1": "I have to give 16. ... Qxb2?? a pair of question marks. Black has no choices now, his queen must die.",
        "17... Qf6 18. Qa5": "Instead, black ran to the only square on the board on which his queen doesn't die, leaving a beautiful hole for the white queen. Black now has some ugly choices. 18. ... Qxd6 saves him from checkmate, but he loses his queen to a mere bishop when he's already a pawn down. 18. ... Nb6, 19 Qxb6 Kd7 gives the black king a little running space, but 20. Be5  still wins the black queen, and white picked up the black knight along the way. So black resigned at this point. Perhaps my footnote after black's 12th move, regarding the prudence of castling into an attack, may have borne some relevance."
    },
    "url": "https://gameknot.com/annotation.pl/his-queen-must-die?gm=22052",
    "gameName": "His Queen Must Die",
    "players": "blake84120 (1579) vs. graf (1577)",
    "opening": "Sicilian (B53), Chekhover, Zaitsev variation"
}