{
    "moves": {
        "1. e4 c5 2. Nf3 e6 3. d4 cxd4 4. Nxd4 Nc6 5. Nb5 d6 6. c4 Nf6 7. Nb1c3 a6 8. Na3 Be7 9. Nc2": "Partiiks ette valmistades nägin, et teooriat teadnuks vastane päris korralikult, kuid millegipärast otsustas ta hakata laua taga midagi uut leiutama. ",
        "9... b6 10. f4 Bb7 11. Bd3 Rc8": "Sihikul on ettur c4.",
        "12. Qe2 Nd7 13. O-O Nc5": "Mustal on nüüd meeldiv võimalus valida hetk, millal vahetada välja valge rünnakuoda d3.",
        "14. Be3 O-O 15. Rfd1": "Valge eelnev mäng viitas justkui soovile alustada pealetungi kuningatiival... see käik ei lähe f2-f4-ga muidugi üldse kokku.",
        "15... Qc7 16. Rac1 Bf6": "Mustal on juba ähvardus Ra5 ning valgel on raskusi etturite e4 ja c4 kaitsmisega.",
        "17. Bxc5": "Jällegi hea uudis mustale. Väli d4 kuulub nüüdsest musta viguritele ning mustaväljalisele odale pole enam oponenti.",
        "17... bxc5 18. Ne3 Nd4": "Kohe pärast selle käigu kämist sain aru, et kiirustasin pisut. Parem olnuks algul 18... g6 ning valgete võimalused kuningatiival rünnata on päris pisikesed.\n",
        "19. Qf2 Rce8": "Kartsin siin 19... g6 peale 20. f5 Le7 21. Rg4, kuid sellele olnuks olemas tugev vastumäng  21... Oh4! 22. g3 exf5!\n",
        "20. Ng4 Qd8": "Kulutasin eelmisel käigul olles uue plaani leidmiseks päris palju mõtlemisaega ja ei raatsinud enam seda kulutada variantide 20... Od8 21. f5 h5 vmt peale. Tegelikult kuluks mustal mustaväljaline oda kindlasti ära...",
        "21. e5": "Pidi loomulikult lööma 21. Rxf6+ Lxf6, partii ajal pidasin musta seisu pisut paremaks variandis 22. Ve1 e5 23. f5 Vb8. Õige ta ju on, aga suurem ülekaal olnuks kahjuks ikkagi hajunud.\n",
        "21... Bh4": "! Äärmiselt ebameeldiv torge. Valge ei soovi järgnevalt liigutada oma g-etturit, mis nõrgestaks pikka diagonaali.",
        "22. Qe3": "Mustal on korralik paremus ka variandis 22. g3 Of3 23. Oe2 Rxe2+ 24. Rxe2 Oxg4 25. gxh4 Lb6.\n",
        "22... dxe5 23. Nxe5 f6": "Nonii, musta etturid alustavad edasitungi - vankrite toel jõuavad nad üllatavalt kiiresti 2. reale (!).",
        "24. Ng4 f5": "Ratsut ei pidanud üldse e5-le tagasi laskma, kuid kartsin pisut oma kuninga eest kõigi etturitega plagama panemist - siiski 24... h5 25. Lh3 g5 26. Rf2 f5 oli tegelikult väga tugev.\n",
        "25. Ne5 g5 26. Ne2 gxf4 27. Nxf4 a5": "Paljudes variantides kummitas vastulöök b2-b4. ",
        "28. Bb1": "? No odal pole b1-l küll midagi teha. Punkti g2 ja 2.rida pidi kaitsma näiteks käiguga 28. Vd2, sellele plaanisin vastata 28...Lg5 29. Vf1 Lh6 ning ei kõlba näiteks 30. Rd7 e5! 31. Rxc5 Oc6 32. Rd5 Lxe3+ 33. Rxe3 Oe7 34. Ra6 Og5 võiduseisuga mustale.\n",
        "28... Qg5 29. Kf1 Qg7 30. Ned3": "Taas väike kingitus mustale. Visam oli 30. Vd2 Og5 31. Ve1 Lh6 32. g3.",
        "30... e5 31. Nd5 Bg5 32. Qg3 f4 33. Qh3 f3 34. g3 Bc8 35. Qh5 e4 36. Nxc5 e3": "Must ei taha isegi vankrit - pisut tuli lugeda vaid varianti pärast 37.Oh7+",
        "37. Bxh7+ Qxh7 38. Qxg5+ Kh8": "Musta strateegia täielik võit.",
        "39. Rxd4 e2+": ""
    },
    "url": "https://gameknot.com/annotation.pl/hof-2010-jyv-skyla?gm=32606",
    "gameName": "Hof 2010, Jyväskyla",
    "players": "Järvenpää Jari  vs. Lauk Ülar ",
    "opening": "Sicilian, Szen, hedgehog variation (B44)"
}