{
    "moves": {
        "1. d4 Nf6 2. Bf4 d6 3. Nf3 g6": "The fianchetto's option is a good one agains the London. ",
        "4. e3": "Uncovering too early my scheme is bad. I don't want to push for e4, but I'll go with a kingside pawnstorm instead. ",
        "4... Bg7 5. Nbd2": "Nothing happens here...",
        "5... O-O 6. h4": "I have to move things on. This pawn is just a test: let's see what he does. ",
        "6... h5": "Well, ok. I'll have to work on a sac on g6, once the g column is opened. Can you see how?",
        "7. Nh2": "Preparing g4. It doesn't matter if black will get a piece there: the issue is about opening the g column. ",
        "7... c6": "Slow enough to test my idea. He was expecting Be2, but as I told I didn't intend to win the exchange, just provoke it!",
        "8. g4": "Which one would hsve you chosen?",
        "8... Nxg4": "Not bad. Now, I'm not forced to go on with the exchange. ",
        "9. Nxg4 Bxg4 10. f3": "This is not a good plan I followed. This squares closes in my own pieces. On the other side, I'll have an impressive center, easily supported if handled with care. ",
        "10... Be6": "Well.. I'd calli it bad, but I'm not so sure. Black gives up the pawn's fight for the center, but is not clear how white can take inmediate advantage from it. ",
        "11. c3": "Allowing e5. c4 is still controlled by me. ",
        "11... Nd7": "Increasing the tension. ",
        "12. Ne4": "I do this just because I can, that's all. Not really good, I know, but I didn't see any advantage in Nc4 or Nb3. ",
        "12... Nb6": "He does. ",
        "13. Qc2": "INviting him to play Bf5, and counter it with Bd3. Not that I liked it.",
        "13... Nd5": "Normally, white does want to keep the dsb in this position. But I have to assume it: Bg3 is not wise due to Nxe4, and Bg4 just provokes f6... or not. Very intrincate. At last, I decided to use the tempo for...",
        "14. O-O-O Nxf4 15. exf4": "Ok, Now it is time to demostrate I have something on the kingside. But black has his own counterattack. ",
        "15... Bf5 16. Bd3": "Still ok. I have Nf6+, maybe it can be useful later. If a R is on g1...",
        "16... Qa5": "Here it comes. ",
        "17. Kb1": "a3 will be for later, if needed. ",
        "17... b5": "Now, my defence is hard. I have to let him in as much as possible, and try to get there first. It seems impossible...",
        "18. Rhg1 b4 19. Nd2": "Ng5 didn't lead anywhere. Here I have a N move to threaten the BQ. ",
        "19... Bxd3 20. Qxd3": "It's ok. ",
        "20... bxc3 21. Nb3": "This was the idea to survive. ",
        "21... Qb6": "Passive but what else?",
        "22. Qxc3": "My Q is pinned, and he will have c5. But at least I have some breath. ",
        "22... a5": "Very nice. I won't debilitate my king without fighting. ",
        "23. f5": "If the Bb7 is pinned, I have an extra mean of defence. ",
        "23... a4 24. Nc1": "Just this. ",
        "24... c5": "Here it comes. Now, I had dxc5 (BxQ, cxQ...). I went on...",
        "25. fxg6 cxd4": "If BxN, gxf7+ provides some counterplay to white. ",
        "26. gxf7+": "Pinned bishop. ",
        "26... Rxf7": "Pinned bishop, so I can...",
        "27. Qxd4": "This is to threaten his Q at the same time. If Rxd4, the Rg1 hangs. ",
        "27... Qxd4 28. Rxd4": "Oddily enough. ",
        "28... Kf8": "Unpins the bishop, but the R can fly. Now, where? I have to be aware of the attack on b2 that is about to come. ",
        "29. Rd3": "I don't want to lose f3 in the process to defend. ",
        "29... Rb8": "Here it comes. ",
        "30. Rg2": "And here was my last resource. Now let's see if it holds!",
        "30... Rb4": "Ok, Rh4 is just depressing... so I try to grab a little advantage I have, due to the king's position. ",
        "31. Rc2": "This is to get some action of my own. But my rook will be doing little up there. ",
        "31... Bf6": "Now, if my pawns are going to fall, how will I save the game? My knight's inactivity has this residual downside I couldn't take care of on time. ",
        "32. Rc8+ Kg7 33. Ne2": "Here, I blundered. b2 must (and could) be defended. I throw the game away, I'm sorry. ",
        "33... Rxb2+ 34. Kc1 Rxe2": "Now black's advantage is overwhelming. One I couldn't save, for a change. But still, an interesting midgame (for my standards).\n "
    },
    "url": "https://gameknot.com/annotation.pl/hold-and-lost?gm=56889",
    "gameName": "Hold and lost",
    "players": "damalfi  vs. olingus ",
    "opening": "Queen's pawn game (A45)"
}