{
    "moves": {
        "1. d4": "So I do the same as before.",
        "1... Nf6": "So does he.",
        "2. c4": "I do my usual.",
        "2... e5": "And he plays the Budapest again.",
        "3. dxe5": "I take.",
        "3... Ng4": "He plays the same variation.",
        "4. e4": "I continue following our earlier game.",
        "4... h5": "And so does he.",
        "5. h3": "I continue with the note from my annotation.",
        "5... Nxe5": "This seems best for black. Now I was originally going to continue with 5. f2-f4, but I realised that in that position Qd8-h4 check is very strong for him. However I though so what? I can develop a little and then play it at a later stage.",
        "6. Be3": "So I continue my development.",
        "6... Bb4+": "He throws in a Bishop check.",
        "7. Nd2": "I block in such a way that he can't destroy my pawn formation with by taking my knight, which he could have done if I'd played Nc3.",
        "7... Qe7": "I think this is wrong. I think the trust h7-h5 more or less means black has to castle on the queen side. As such he should be developing his queen side pieces and preparing to castle queen side.",
        "8. a3": "So I hit the bishop.",
        "8... Bxd2+": "He takes.",
        "9. Qxd2": "I take back.",
        "9... d6": "He develops.",
        "10. f4": "I hit the knight.",
        "10... Ng6": "Knight drops back.",
        "11. Bd3": "I protect e4",
        "11... Qh4+": "He throws in the check.",
        "12. Kd1": "My king wanders. It is heading to c2 where it will be completely safe.",
        "12... Nc6": "He develops.",
        "13. Ne2": "I prepare g2-g3, driving his queen back.",
        "13... Bg4": "This move takes advantage of a pin on the h pawn. If 14. Hxg4?? then Qxh1+",
        "14. Kc2": "but now that my rooks are connected, I really am threatening h3xBg3.",
        "14... Bxe2": "So he takes. He offered a draw here, which I declined. I think white is better here, with the two bishops and the greater space advantage. Plus I out-rated him and didn't want to lose the grading points. Also I am in the frame for \"Player of the Season\" in this division, and I wanted to keep alive my hopes of that. Also I was aware that they out-graded us on the lower boards, and the team rather needed a win from me (in fact as it turned out, this win was crucial, as we drew the match 2.5 points each.",
        "15. Bxe2": "So I take back.",
        "15... Qe7": "The queen drops back, attacking e4 again.",
        "16. Bd3": "I protect it again.",
        "16... O-O-O": "He castles.",
        "17. Qc3": "I hit g7, planning to meet f7-f6 with e4-e5, discovering an attack on his Ng6 from my Bd3. I was expecting f7-f5, but then he played....",
        "17... Qf6": "This virtually forces the exchange of queens, as otherwise I cede the d4 square to him. But what of it? I weaken his pawn formation.",
        "18. Qxf6": "So I take.",
        "18... gxf6": "He takes back.",
        "19. g3": "I secure f4, releasing Be3 for action. I was thinking in terms of B2-b4-b5 and maybe taking in a7 if I can do so safely, or playing Bd4 with pressure on f6.",
        "19... Rde8": "I was thinking now, b2-b4 is well met with f7-f5, so I protect Be3 first.",
        "20. Rae1": "Like so.",
        "20... a5": "He slows down b2-b4",
        "21. Kc3": "I prepare it again.",
        "21... Rhg8": "Moving this rook to the semi-open file seems to make sense.",
        "22. b4": "So here I come!",
        "22... b6": "He tries to keep the queen side closed.",
        "23. b5": "With hindsight, I think this was a mistake. I thought it led to a concrete advantage for me, but I am not sure it does, and the knights prefer a closed position, and this move closes up the queen side, making his knights better. I wondered if c4-c5 was better, trying to open up the position for my bishops, with Bd3-b5 in the air. I set up this position on a computer. At first it liked b4-b5, but then looked at Bc2 (presumably en route to a4. In the ned the computer settled on 23. Rh1-g1, and assessed the position as about plus 1 - equal to about a pawn up - for white.",
        "23... Nb8": "So the knight drops back.",
        "24. Bd4": "This was the point - driving the knight away so the bishop can go to this square. The computer prefers Be2 hitting h5, but I am not convinced.",
        "24... Nd7": "Knight re-emerges, protecting f6.",
        "25. Re3": "Part of the point of this is to be able to play Be2, but still have e4 protected.",
        "25... Ngf8": "The knight is heading to e6 to exchange my bishop.",
        "26. Be2": "I hit the h pawn.",
        "26... Rh8": "He protects.",
        "27. g4": "I wanted to remain active....",
        "27... h4": "He tries to keep the king side closed.",
        "28. g5": "With a threat to f6",
        "28... Ne6": "He continues with his plan.",
        "29. Bg4": "And me with mine.",
        "29... Nxd4": "He takes.",
        "30. Kxd4": "I take back.",
        "30... fxg5": "He can now take here.",
        "31. fxg5": "I take back.",
        "31... Rhg8": "He attacks my pawn.",
        "32. Rf1": "I counter attack on f7.",
        "32... Kd8": "He unpins his knight, threatening to play Ne5, protecting f7.",
        "33. Rxf7": "So I take while I can, attacking Nd7 again.",
        "33... Ne5": "The knight moves, attacking my rook.",
        "34. Rh7": "I attack his pawn.",
        "34... Nxg4": "He takes the bishop.",
        "35. hxg4": "I take back.",
        "35... Rxg5": "He takes the pawn.",
        "36. Rxh4": "I take his. I am a pawn up, but his rooks are active now, so it is quite hard to win.",
        "36... Reg8": "Attacking the pawn again.",
        "37. Rg3": "So I protect it again.",
        "37... Ke7": "He mobilises his king. Now my team mate Peter Lovatt thinks this is a mistake, and thinks that if maybe he keeps moving his king between d8 and c8 I can't make any progress, but I am not convinced.",
        "38. Ke3": "This is a mistake, I didn't really consider his reply.",
        "38... Rc5": "He attacks my c4 pawn.",
        "39. Kd4": "So the king returns.",
        "39... Rcg5": "The rook returns, with the idea of repeating the position, and getting a draw, but I am not sure that this is best, as the rook on c5 was very strong, attacking c4 and protecting c7.",
        "40. Rh7+": "I finally get back on the right track.",
        "40... Kd8": "He protects c7.",
        "41. Rf3": "I threaten to play Rf3-f7, and my doubled rooks on the seventh rank are very strong.",
        "41... Rg5g7": "So he decides to exchange rooks.",
        "42. Rf8+": "This is the best way of exchanging.",
        "42... Rxf8": "He takes.",
        "43. Rxg7": "I take.",
        "43... Rf3": "He counter attacks.",
        "44. Kd5": "I decide to give up the pawn, in order to get my king more active and push my g pawn.",
        "44... Rxa3": "He takes the pawn.",
        "45. Ke6": "I threaten mate!",
        "45... Kc8": "So this is more or less forced.",
        "46. Rg8+": "I throw in a check to drive his king further away.",
        "46... Kb7": "This is forced too.",
        "47. g5": "I advance!",
        "47... Rc3": "Computer now says a5-a4 is best for black and assesses the position as equal!",
        "48. g6": "So I allow my c and e pawns to go, in order to push my g pawn.",
        "48... Rxc4": "This is his losing mistake.",
        "49. g7": "I push again.",
        "49... Rxe4+": "He takes. Now in this position, I have one move that wins, I think all others lose!",
        "50. Kf5": "And it is this move, preventing his rook from getting to the g file.",
        "50... Re1": "He retreats his rook.",
        "51. Rf8": "Rh8 or d8 also wins. Forced to give up his rook for the g pawn, his position is now hopeless, and he resigned. Many thanks for reading my annotation. Please add a comment or two and rate it on the start system. Until next time dear reader!"
    },
    "url": "https://gameknot.com/annotation.pl/holywell-v-malpas-whitchurch?gm=60186",
    "gameName": "Holywell v Malpas & Whitchurch",
    "players": "CharlesHiggie (ECF177) vs. Dewi Jones (ECF128)",
    "opening": "Budapest (A52), Alekhine variation"
}