{
    "moves": {
        "1. e4 c6": "Caro Kann: unpretentious and solid.  Beware.",
        "2. d4 d5": "Challenging the centre.  You will note that the French Defence has an analogous opening sequence: 1.e4 e6 2.d4 d5.",
        "3. Nc3": "A popular third move (as it is in the French, as well).  Almost equally popular are 3.e5 (the Advance Variation) and 3.exd5.  The latter has been something of a favourite of mine, leading to the Panov-Botvinnik Attack (3.exd5 cxd5 4.c4) with some similarities to a QP opening.",
        "3... dxe4": "'Surrendering the centre' the wiseacres used to sneer when they saw this move.  It does nothing of the kind, of course!",
        "4. Nxe4 Bf5": "A very popular development, forcing White to move the knight a third time.  White COULD defend the knight by 5.Bd3 or 5.Qf3, but there is no compelling need to do so...",
        "5. Ng3": "... as this retreat attacks the bishop in turn.  ",
        "5... Bg6": "Normal, by a large margin.  The bishop standing on the h7-b1 diagonal leaves White wondering what to do with his own light-square bishop (LSB).  There is little attraction in defending the bishop where it stands.  But there is an interesting try in the strange-looking 5...Nf6?! 6.Nxf5 Qa5ch 7.c3 (or Bd2) Qxf5 - unclear but maybe White gets more out of this line than Black does.  For one thing White would still have his LSB.",
        "6. h4": "Marking the g6-bishop as a target.  White hopes that this apparently crude  thrust will lead later on to better things in the way of a K-side attack.  Things don't quite go that way.",
        "6... h6": "The usual response, though ...h5 has been tried.  Black wants to keep his bishop, even though it may be forced to make a third move.",
        "7. Nf3 Nd7 8. h5": "'In your face!'  Forced the bishop back to h7, but there the bishop is quite snug, its gaze firmly fixed down the h7-b1 diagonal.",
        "8... Bh7": "Forced, but Black won't be unhappy about that.",
        "9. Bd3": "A very difficult decision, in my view.  The Black LSB having moved three times already, is being invited to make a fourth move to exchange itself off for the White one, which has just made its first move.  In effect White is offering a trade, with (four minus one equals) three tempi to sugar-coat the deal for herself.  There isn't much Black can do about it, neither, but fall in with the trade.  It turns out, though, that the absence of White's LSB subsequently tends to deprive White of a valuable attacking resource.  Black therefore has something to throw onto the bottom line to offset the 'lost' three tempi.",
        "9... Bxd3": "There really is no sensible alternative, here.  The bishop is going anyway - might as well get that over and done with.  There is nothing to be gained by 9...Ngf6 10.Bxh7 Nxh7 with even more loss of time for Black.",
        "10. Qxd3": "Of course, nothing good can come of 10.cxd3(?), with doubled and isolated pawns stuck on a file half-open for Black's rooks.",
        "10... Ngf6": "White has a very slight lead in development, but no real threats so far.  Black is solidly placed - no real weaknesses - but perhaps feeling just a little constrained by White's greater control of the central regions.",
        "11. Bf4": "A good square and diagonal (h2-b8) for the dark-square bishop (DSB).  Could this make Black think twice about castling Q-side? ",
        "11... Nd5": "At once drives the bishop off the sensitive diagonal.  Since the bishop was so easily thrown off f4, does that mean White was wrong to move it there?  By no means.  Black has been induced to place his knight on d5, where it will become a target for the White c-pawn.  So of course...",
        "12. Bd2": "...White keeps the bishop on the board.  The insignificant loss of time will be recovered.... eventually.",
        "12... Nd7f6": "Possibly a risky development in the light of the exposure of the other knight to attack.  More circumspect seems 12...e6.",
        "13. O-O-O": "This seems logical enough: place the king onto safety, and bring a rook onto a central file, leaving the other - the e-file - for the other rook.  But I feel sure I would have played 13.c4, here, and after 13...Nb6, castled long with the prospect of opening up the d-file for the activated rook.  The move order can not be reversed...",
        "13... e6": "[!]  Blunting the c2-c4 thrust as 14.c4 Nb4! is now possible, disrupting White.  ",
        "14. Rhe1 Bd6": "White is fully mobilised (developed); Black very nearly so.  There doesn't seem to be much in it, eh?  But White does have a move that might have occasioned Black something of a headache...",
        "15. Ne5": "[?!] This isn't it, though it's an OK move.  Instead 15.Nf5!  attacking the g-pawn and threatening the bishop would have placed Black in some difficulty.  Could he contemplate undeveloping the bishop (...Bf8)?  The line is extremely complicated and hard to see: 15.Nf5! Nh5!  16.g4! ... (16.Nxd6 would be OK if White was prepared to settle for a game little more than equal) 16...Nf4! 17.Qb3!  ... The string of fine, unexpected, moves leaves White attacking b7 and g7, and still with the c4 thrust to consider.  However unclear and murky the position arising from 15.Nf5, I reckon White must have had an edge.",
        "15... Qc7": "Castling K-side came into consideration.  Now that Black has established communications with both his rooks, White has to concern herself about her willingness to commit to one sector at a time when Black can switch his King to somewhere less exciting.",
        "16. Ne4": "Talk about centralisation!  You can not get pieces more centralised than White's right now.  Even so, I still like 16.c4 here: 16...Ne7  17.c5 Bxe5  18.dxe5 Rd8  19.Qa3, with a White knight likely very soon to come in at d6.",
        "16... Nxh5": "Decentralisation in the face of White's plan looks like a misjudgement.  Possibly Black hoped to unbalance the game, pick up a pawn and trust in the vagaries of blitz play to survive an attack. Maybe.  At any rate, White obtains a small edge.",
        "17. Nxd6+": "[?!] More forcing would have been 17.c4.   White's game seems to be crying out for this move to be played.  White's game is healthy enough that without it she can still keep Black under constraint.  Yet 17.c4 Ne7 (evidently Black loses the knight after ...Nf6 or ...Nb6)  18. c5 Bxe5  19.dxc5 0-0 20.Nd6 ... led to a fine game for White.",
        "17... Qxd6 18. a3": "'Preparing' c4?  But that oft-mentioned thrust was playable immediately, as 18.c4 Nb4?? 19.Qb3 would be horrible for Black.  Instead of 18.c4, also possible would have been 18.Qf3, with threats against the knight at h5 and the pawn at f7.",
        "18... Qc7 19. g4 Nhf6": "Also possible was ...Nhf4.  The text seems the more circumspect, though.",
        "20. Qf3": "Also 20.c4 was still good.  But White seems now poised to bash her way through the centre to come at Black's King.  In the light of that, Black's next is understandable.",
        "20... O-O-O": "[??] A terrible misjudgement.  Black has been keeping up, pretty much, for the whole game so far, though 16...Nh5 did some self-inflicted damage. With 20...b5! Black could finally have stymied White's delayed c2-c4 thrust, and been left with a reasonable game.",
        "21. c4": "[!] At last!  And still strong.",
        "21... Nb6": "The only retreat, as after 21...Ne7, 22.Nxf7 would have been good enough to win.",
        "22. Bf4": "Creating what I call a 'masked battery' against the Black Queen.  The idea is that the masking piece - the e5-knight - moves aside to attack something else (Ng6 attacking the h1-rook), exposing the bishop's attack on the Queen.  The unmasking of a battery is usually so deadly, the defender has to do something about it before the unmasking.",
        "22... Qe7": "On this occasion, there was in fact nothing to be done about it about White's threat ...Ng6.  By saving the Queen in this way, Black will lose his King!  22...g5 would not have helped much (23.Bg3! and the threat remains), but Black might have been able to contain the damage in this line: 22...h5! 23.g5 Ng4  24.Nxg4 hxg4  25.Bxc7 gxf3 26.Bxd8 Kxd8, leaving White the Exchange ahead in the end game.",
        "23. Nxc6": "[!] One of those moves that 'leaps to the eye' of a tactician.  Black is busted.",
        "23... Qe8": "Abandoning her consort.  No good was 23...bxc6 24.Qxc6ch and mate nest move.  But it is mate in two, now, as well.",
        "24. Nxa7+ Kd7 25. Qxb7#": "A sudden and drastic finish.  During the course of the game, at no time was White under any real pressure or at a disadvantage.  Possibly that explains the strong opponent's lapses in tactical and strategic judgement.  A fine win to White."
    },
    "url": "https://gameknot.com/annotation.pl/homeric-nodding?gm=63409",
    "gameName": "Homeric nodding",
    "players": "penelope80 (1769) vs. Really strong opponent (22xx)",
    "opening": "Caro-Kann (B19), classical, Spassky variation"
}