{
    "moves": {
        "1. e4": "Well, there was a little real chess, but most of it was hope chess as I did not calculate.  But, that is how I won to stand up for myself against Dave, lol.  So, I open with the typical.  One thing worth noting, btw, is that it was a training game because I was trying to train him.  Now, I asked him which color he wanted to be, and he wanted to be black. ",
        "1... e6": "So, my opponent decides on the French Defense.",
        "2. d4": "Of course, I'm used to playing against it.",
        "2... b6": "Now, as I told him, this is a fianchetto because he's forming a flank for that B since it is prepared to go on a long diagnol.  By that, I allude to b7 or a6, pointing right in that direction which is why it's said to be on the flank.  But, as I noted, better was to develop with that d pawn since it's right on the center squares needed to control the center, though it's slightly.  However, even better then that was to develop right away by bringing that DSB or g N into play.  Between the two candidate moves, I'd say that best was 2...Nf6 because you know where the N go, but don't where to place that B.",
        "3. Nf3": "So, I go right for it with this move.  Of course, it involves the usual goal, to castle early.",
        "3... Bb7": "So, he develops and goes for my e pawn.",
        "4. Bd3": "Also possible was 4.Qe2, but I won't do that.  I always emphasize to my students to develop your pieces, get the K to safety, and control the center.  And, bringing the Q out early won't help.  So, to set a good example, I don't.  I could've also played 4.Nbd2, but it's kind of crammed and in an uncomfortable.  Plus, it would make it difficult for my DSB to come out.  So, I played this, with the idea of course, to castle.  Worth noting, that right now, we're in the process of a little hope combined with real chess.  The part where I didn't want to cram my N or set a bad example was real chess.  But, there was hope since the plan is to castle soon, and I'm not even calculating to reach that moment.",
        "4... Bb4+": "Of course, this delays my ability to castle but not for long.  ",
        "5. Bd2": "Well, there was a plan behind this move, but it didn't require me to think.  The idea is getting out of check by developing another piece.  Plus, the idea is a strong B pair, which you do by having your B's aligned, not always, but usually vertical to one another in the center.  This blends in with center control.  ",
        "5... Bd6 6. O-O": "This was the plan behind 5.Bd2  But, more to it then meets the eye.  The idea is that I went after his B, forcing him to waste a move by moving it again, while I got to use that time to get my K to safety.  While everything is even, with my last move, I already feel that I have an advantage.  But, I'm not getting overlyconfident, as I just know how to keep my advantage, this time.",
        "6... Nf6": "?? I understand why he played.  The idea was to continue with development and castled K side.  But, he could've developed.  But, what I pointed out, however, is also true.  In it, I said, This is an exception to the guideline. While developing your pieces is important, more important is keeping your material safe. And, this move allows a fork, where I attack two pieces with one, and win something, in return.  In this case, a piece for a pawn.  All of this was based on hope chess, btw.  ",
        "7. e5": "So, it starts with this move.",
        "7... Ng4": "In this case, I feel he made the right choice.  Generally speaking, a B is worth more then a N.  But, in this position the N is worth more because black can do more with his N then the B.  That's because the B has limited squares, whereas, the N is more mobile.",
        "8. exd6": "As noted, I take.",
        "8... cxd6": "He takes back, but the idea is that he lost a piece for a pawn.  And, he has doubled pawns right in the center which is generally the worse place for them, even worse then doubled pawns away from that area. With that, black's advantages are growing, especially when you also count the fact that black has another piece to develop and needs to tuck his monarch away.",
        "9. Bb4": "Seeing that I have the advantage, I get right to it, by going after his d pawn.  However, there's more to it because if it was just to win that pawn, I wouldn't play it.  The other idea is that N isn't crammed when, I develop my last piece.  ",
        "9... d5": "As I expected he defends his pawn.  Of course, he also could've defended with 9...Qc7  What it implies is that he had other ways to defend it, so what I'm saying is that no matter how did it, my next move would be, no matter how you slice it, 10.Nc3",
        "10. Nc3": "As I know, 10.Nd2 was also an option, but it looks kind of awkward because that N would be crammed.  Additionally, if 10.Nd2 I can't put on Ne4 or Nc4 because of that pawn, so then real chess would be needed.  However, my idea is still hope chess, so I played this.  That way, there would be nothing to calculate.",
        "10... Nc6": "Of course, he doesn't waste time to develop another.  Plus, he goes right after my B.",
        "11. Bd6": "Seeing all of it, this is my response.  The reason being is that I know that this move puts pressure right in the center, as I'm attacking the center square, making it more difficult to control the center.  The idea is exploiting his weakness since I've already castled and have that contested the center.  I put pressure on it by making it impossible for him to castle K side because, if he does so, I win a R for my B.  Like before, I didn't have to think about it.  ",
        "11... Nb4": "?? Don't know why he played this, but it's another blunder as it loses a piece with my next move.",
        "12. Bxb4": "Once again, I did not have to think about this.  And, from this point on, I knew that I could easily win by doing what I've been doing, hope chess.",
        "12... a5": "To go for my B.",
        "13. Ba3": "But, I remembered, by heard, this is how most GM's responds.  Now, I also could've played 13.Bd6, but this doesn't make a difference as he still can't castle without losing his R.",
        "13... h5": "To keep his N, in case I moved f N. ",
        "14. Nb5": "But, I don't do it right away, as I have other ideas.  BTW, this was the one of few times time where everything was Real Chess, but this is not going to last long.  That's because I have a plan here which is going to be difficult for black to do anything about.  And, the plan isn't to win anything else right now, but something even worse, seeing black's weakness.",
        "14... Bc6": "Ok.  It protects the B, but as noted, that's not what I had in mind.",
        "15. Nd6+": "However, 14.Nb5 this was my last move.  And, the reason being is that now that I checked him with my N, he loses castling rights.  Since I developed my pieces, castled, and controlled the center, not being able to castle, is going to add insult to injury, for black.  But, now that it's easy, I go completely back to for a long while.  There will not be anymore Real Chess, until we're near the end.  And, the next time move that involves real chess will also have hope chess.  In other words, this is the only time where there isn't any hope chess.",
        "15... Ke7": "?? Blunder.  First, this exposes his K.  But, mainly it loses his Q with my next move, due to the discover.  Instead, 15...Qe7 was best.",
        "16. Nb7+": "BTW, I very nearly overlooked this move.  Instead, I was thinking about where to put the N, in order to prevent black from getting back a piece.  The only way, then, would've 16.Nb5, which is the move I almost played.  But, at the very last moment, only a few seconds did I see this opportunity.",
        "16... Kf6": "The only other move was 16...Kf8",
        "17. Nxd8": "But, even if he had played, this is how I would've his Q for my N.",
        "17... Raxd8 18. Qd2": "The real reason behind this move was to get my remaining piece out and connect the R's.  However, I also could've done that with 18.Qe2, so why didn't I play that?  Well, this is where I mix hope with real chess.  So, it's no coincidence.  With this move, there is a mate threat.  And, I analyzed if it was easy to drive off or not.  For if it were, then I would've answered with 18.Qe2  However, by analyzing, I realized that mate is impossible to drive off, now because of my N, and the fact that his K is pinned and can't move, so mate cannot avoided because in order to do so, he'd have to move it.  I actually saw an example, and a GM won by doing this.  And, I applied the same thing in another game, that by pinning the K like that, you have an easy mate.  Additionally, this is how I realized that archduke_piccolo and andywm would mate in one, which was why resigned.  The only way to hold off mate for one move is would be 18...e5, in which case, I'd mate almost right after as then, 19.Qg5+, Ke6 (forced) 20.Qf5#  So, waisting no time, I get right into it, and played this.  In addition, I didn't have to calculate this mate, despite analyzing and studying the position.",
        "18... b5": "But, with this move, I mate immediately.  The only option was 18...e5 because of what I noted above.",
        "19. Qg5#": "And, there you have it.  One lesson though is that it's important to complete development, get the K to safety, and control the center.  But, there are exceptions to that guideline, and sometimes, you have to ignore them to avoid losing material.  Even more important, however, is that studying things are important.  Sometimes, however, it is better to just know the best moves and not calculate.  And, as Dave puts it, this is hope chess.  My point is that hope chess is the way to go.  So, @Dave: When you look at this game, based on why moves were played, we can conclude that there was far more hope chess then my game against geniusacamel, and that is how and why I played so well.  Afterall, this game involved more then hope chess, as I didn't attempt the calculations, and look at the result.  As you see, it was in my favor, this time. "
    },
    "url": "https://gameknot.com/annotation.pl/hope-chess-the-real-deal?gm=56797",
    "gameName": "Hope Chess-The Real Deal",
    "players": "jkarp (1275) vs. jl145061 (955)",
    "opening": "French defence (C00)"
}