{
    "moves": {
        "1. c4": "English Opening...",
        "1... e5": "Bremen System...",
        "2. g3": "Accelerated fianchetto.",
        "2... d6 3. Bg2 f5": "This is my favorite response to the English, a kind of \"Dutch Defence\" system that has in mind a K-side attack.",
        "4. d4 Nf6": "Black could instead play 4...e4, but 5.f3! inducing 5...exf3 6.Nxf3 is very good for White.",
        "5. Nc3": "Also playable is 5.dxe5 dxe5 6.Qxd8+ Kxd8, though the displacement of the King is of only minor inconvenience to Black.",
        "5... Be7": "Also to be considered were 5...c6 and 5...e4.",
        "6. dxe5": "(!?) Rather an odd decision, I find, given that Black doesn't have to retake on d8 with the King.",
        "6... dxe5 7. Qxd8+ Bxd8": "Retaking with the King might not be so very inconvenient, but the bishop recapture seemed preferable, all the same!",
        "8. Nf3 Nc6": "Preferable to the immediate 8...e4, which cedes White the d4-square.",
        "9. O-O e4": "Now that d4 is covered, this pawn advance seems to be indicated.",
        "10. Ng5": "Possibly preferable was 10...Nd2, as on g5, this piece becomes a target.",
        "10... O-O 11. Rd1": "In no position right now to challenge White's possession of the open file, Black elects to gain space on the K-side.",
        "11... h6 12. Nh3 Be6": "The attack on c4 gains Black a bit of time...",
        "13. b3 g5": "Placing a considerable constraint upon White's K-side, especially the h3-Knight.  A good deal of Black's play in this game involves the motif of \"constraint\".",
        "14. f4": "(!?) To prevent ...f4, or to induce the e.p. capture at f3?  Black ignores it and places a bit of a clamp on White's K-side.",
        "14... g4": "Playable indeed was 14...exf3 e.p. 15.exf3 Be7 with an OK game for Black.  But I preferred to place White's K-side under constraint.",
        "15. Nf2 Be7": "It has taken Black a while to get this bishop off d8, but that time has been put to good use.  The game seems about even.",
        "16. Bb2 Rfd8": "Development complete, now is the time to challenge White's tenure of the d-file.",
        "17. Nb5 Ne8": "This odd defence for c7 came to mind owing to my reluctance, having brought the bishop of the d8-square, to have it return there (17...Rc8 18.Rxd8 Bxd8).  Although White's b2-bishop can see clear to h8, it has no useful targets or squares on that diagonal.",
        "18. Nd4": "Inducing a string of exchanges more protracted than White might have anticipated...",
        "18... Nxd4 19. Bxd4 Rxd4": "(!) What?  Has Black gone berserk?",
        "20. Rxd4 Bf6": "(!) ...No.  It's hard to know whether this is a skewer or a pin.  At any rate, Black gets his Exchange back at once.",
        "21. Rad1": "White treats it as a pin...",
        "21... Bxd4 22. Rxd4 Kf7": "To challenge the d-file again, d8 needs to be covered.  But already Black was more interested merely in covering the potential invasion points on the d-file before embarking on a Q-side counter-action.",
        "23. Nd1 c5 24. Rd2 Ke7 25. Kf1 Nd6": "Black decided he had a better future for the rook than simply to exchange it on d8.",
        "26. Ke1": "Centralising the K for the endgame.   Many would regard this position as an endgame: Queens gone, and there are just 3 pieces a side as well as several pawns.  In my view, the position retains a \"middle game\" feel, and 11 men remaining per side out of 16 is scarcely endgame country...",
        "26... a5": "(!) Planning to break into the Q-side.  But it transpired that White had nefarious schemes of his own.  The battle flares up between Black's Q-side action and White's central counter.",
        "27. Nc3 a4": "(!) With the idea 28.bxa4? Nxc4 with advantage to Black.  Nor does 28.Nxa4 Nxc4 look healthy for White.",
        "28. e3": "(!?) Locking up the K-side, but in the hope that the g2-bishop will eventually find freedom via f1.",
        "28... axb3 29. axb3 Ra3": "All per spec and according to plan.  But now comes White's spectacular counter-attack...",
        "30. Rxd6": "(!!) Wham! Black can not take the rook on account of the knight fork at b5.  Black has to follow through with his own attack.",
        "30... Rxb3": "Now White's knight and rook are both under attack, and 31.Nb5 is met, not by 31...Rxb5?? 32.Rxe6+, but by 31....Bxc4! 32.Rxh6 Bxb5 and advantage to Black.",
        "31. Rxe6+": "(!) The best chance.  Now the game enters an endgame in which Black has R and P; White, B and N.  Which, if either, will prevail?",
        "31... Kxe6 32. Nd1": "A sensible choice, but 32.Nd5 certainly came into consideration.  A possible continuation might have been 32.Nd5 Kd6 33.h3 h5 34.hxg4 hxg4 35.Bf1 b5 and Black has the initiative.  From here on, White might have found it hard to keep both minor pieces, e.g. 36.Be2 (what else?) bxc4 37.Bxc4 Rb1+ 38.Ke2 (can't afford to lose touch with his g-pawn!) ...Rb2+ 39.Kf1 Rc2 and [a] 40.Nb6 Kc6 or [b] 40.Bb3 Rc1+ 41.Ke2 c4 etc.",
        "32... Rb1": "Now is the time to assess this asymmetrical ending.  Black has rook and pawn for bishop and knight: nominal equality.  But for the moment, White's mobile corps of K, B and N is penned up behind his own infantry trench line.  Black wants to maintain that constraint whilst his own King gradually makes his way by a long, circuitous route into the scene of the action.  How the lone rook - Horatius at the Bridge - keeps White bottled up for so long was for me the most exciting and intriguing part of the game.  Check it out...",
        "33. Bf1 Ra1": "Maintaining \"checking distance\".",
        "34. h4": "White has time for this.  For some time I considered locking up the K-side by 34...h4, but then decided it would keep until a more opportune moment.  I really needed the King up at the sharp end.",
        "34... Kd6": "(!) The beginning of the long march...",
        "35. Be2": "Maybe there was something to be said for 35.h5, here.  Unless the rook managed to fight its way through to h1, the pawn would be no more vulnerable on h5 than h4.  ",
        "35... Kc6 36. Kf2": "Unpinning the knight.  Now the King has to interrupt his march as the rook manouevres to keep White bottled up.",
        "36... Ra3": "A knight move to b2 was much less inconvenient to Black than the alternative, to c3. So the latter had to be stopped.",
        "37. Ke1": "If instead 37.Nb2, then 37...Ra2 38.Nd1 Rc2 39.Ke1 Kb6 40.Nf2 h5! very like the game continuation rather later on, but with the Black King still uncommitted on the Q-side.",
        "37... Kb6 38. Kd2": "The White King pokes his nose out to check the weather...",
        "38... Ra2+ 39. Ke1": "... Still raining... White has to protect his bishop.",
        "39... Rc2": "Deprives the White knight of both b2 and c3.",
        "40. Nf2": "(!) ",
        "40... h5": "(!) Now is the time!  White was threatening a mass jail break, thus: 40...Ka5? 41.Bxg4!! fxg4 42.Nxg4! Kb4 43.Ne5 and White's counterplay might well be good enough to save the game.",
        "41. Kd1": "Now the piece sac on g4 is much less likely to yield drawing chances...",
        "41... Ra2": "... And White remains just as imprisoned as ever, much like General Butler's army at Bermuda Hundred - in a \"bottle strongly corked\", or the army of Lars Porsena, surging back and forth on the brink of the Tiber.",
        "42. Ke1 Ka5 43. Kf1 Kb4": "As Black's King closes in, it looks all up for White, but now he turns at bay once more, and shows his teeth.",
        "44. Nd3+": "(!) Bold and beautiful - this represents White's best chance to free up his game!  Was he just waiting, all this while, just to spring this surprise?  But it came as no real surprise to Black, as something like this was always on the cards if White couldn't break out by other means.  Nor are White's's chances as dismal as might first appear, as events were to show.",
        "44... exd3 45. Bxd3 Rd2": "Admittedly, this might have been too committal by Black.  45...Ra6, adopting a defensive stance until the situation could be stabilised (46.Bxf5 Kxc4), might have been a better policy.  But the move retains the edge for Black all the same.",
        "46. Bxf5 Kxc4 47. Bg6 b5": "The bishop, free from constraint and running amok on the K-side is a cause for concern.  But once Black's Q-side pawns get up some momentum, it must be all up for White, surely?",
        "48. e4 Kd4 49. e5 Ke3": "(!) Looks risky, but the threat of mate reins in White's e-pawn: If now 50.e6? Kf3 51.Ke1 Re2+ etc.  The King dare not retreat to g1: 51.Kg1? Kxg3 52.Kf1 Kf3 53.Kg1?? Re1+ 54.Kh2 g3+ 55.Kh3 Rh1#.",
        "50. Bxh5": "(!) Nor did this interesting line help White: 50.e6 Kf3 51.Be4+(?!!) Kxe4! 52.e7 (how is the pawn to be stopped? Simple.) 52...Kf3 53.e8=Q Rd1+ 54.Qe1 Rxe1+ 55.Kxe1 Ke4 and wins.  Black will shove his Q-side pawns as far forward as he can until the White King stops them, and then bring his own King across, confident that he can queen first and stop the White f-pawn betimes.",
        "50... Kf3": "The sheer low cunning of White's aggressive defence would have been seen had Black prematurely tried for promotion: [a] 50...c4? 51.e6 c3 (for 51...Kf3, see the [b] line) 52.e7 Rd1+ 53.Kg2 Rd2+ and a repetition; or [b] 50...b4? 51.e6 Kf3 52.Bxg4+ Kxg4 53.e7 Kf3 54.e8=Q Rd1+ 55.Qe1 Rxe1+ 56.Kxe1 Kg4 and it might well be White who has the winning chances!  E.g. 57.Kd2 c4 58.Kc2 b3+ 59.Kc3 Kf4 60.h5!  So close has White come to saving the game.",
        "51. Ke1 Rd7": "(!?) I admit to worrying about this move after I played it.  It seemed counter-intuitive to induce the e-pawn forward in the circumstances.  51...Ra2 followed by ...Ra6 or ...Ra7 might have been better, but this move suffices, as it turns out.",
        "52. e6 Rd3": "Preventing 53.e7.  The plan 52...Re7 53.Bf7 proved, on reflection, to be not so enticing.",
        "53. f5 c4": "Having waited patiently for so long to advance, The Q-side pawns resume their tentative steps towards their goal.  White has just about exhausted his resources...",
        "54. f6 Re3+ 55. Kd2 Rxe6 56. f7": "Almost! But not quite.",
        "56... Rd6+": "More precise, I think, than 56.Rf6, which would have allowed White some chances based on the rapid advance of the h-pawn.  I had worked out a defence against that line, but then realised that the text move was much simpler.",
        "57. Kc3 Rd8 58. Bg6 Kxg3 59. Bf5": "I expected 59.h5, here, but White realises that the rook now prevents all chances of his pawn breaking through.  Black at last has a winning game.",
        "59... Kxh4 60. Be4": "... and here I thought he would try 60.Bd7, but of course after 60...Rf8 61.Be8 Black's pawns run home easily.",
        "60... Kg3 61. Bc6 Rf8": "0-1 - White resigned.  A real thriller, only this time Horatius didn't have to cast himself into the Tiber ..."
    },
    "url": "https://gameknot.com/annotation.pl/horatius-at-the-bridge-a-r-p-vs-b-n-game?gm=24811",
    "gameName": "Horatius at the Bridge: a R+P vs B+N game.",
    "players": "karelploeger (1997) vs. ionadowman (2034)",
    "opening": "English opening (A20)"
}