{
    "moves": {
        "1. e4": "This game is me vs Perfect Chessmate custom personality Fletch2280. This is a Windows98 era computer game which is being run on Linux using Wine. The game has computer AI opponents, but also provides custom opponents that can be made with various capabilities. A rating is created as you dial in opponent features. \n- - -\nI created this opponent as follows (numbers are percentages except search-depth): search-depth=9, center-control=69, aggressiveness=69, experience=100, randomness=50, mobility=60, king-safety=61, pawn-safety=61, draw-contempt=50, for a total strength of 2280 per the game.\n- - -  \nI begin the game with my standard 1.e4 looking for a fight.",
        "1... c5": "Black plays the beginning of a Sicilian indicating a reciprocal desire to fight. This opening provides an unbalanced position which provides both sides opportunities for play.\n",
        "2. Nf3": "Following the standard main line of the Sicilian. The knight is played for development and for center control.",
        "2... g6": "Fletch2280 steps out of the standard book move of [2... Nc6, d6]. The text move begins the fianchetto position typical of a Dragon, but without the normal move sequence. This move does not offer an advantage because it is a tempo behind the action that takes place at d4 after [3. d4].\n",
        "3. d4 Nf6": "Fletch2280 makes an out of sequence move which attacks the e4 pawn. Better perhaps is [3...cxd4  4.Nxd4 Nf6  5.Nc3].\n",
        "4. Nc3": "Protecting the e4 pawn. There is little fear from [4...cxd4] because of [5.Nxd4].\n",
        "4... cxd4 5. Nxd4": "The recapture with the knight seems more appropriate than with the queen because of [5...Nc6]. It is true that if instead [5.Qxd4 Nc6] there could follow [6.Qa4], but this seems to offer little positional advantage and the queen is played off sides and not able to influence the center files d and e effectively.\n",
        "5... e5": "This move attacks the knight and should be okay if followed by [6...d6].  The idea [6.Bg5 exd4  7.Qxd4] where the pinned knight is recaptured by force fails to [6...h6  7.Bh4 g5] and the pin is broken.\n",
        "6. Ndb5": "Played by Kasparov in many Sicilians, this move presents the tactical attack on d6 where if [7.Nd6 Bxd6  8.Qxd6] and black finds unbearable positional pressure with no kingside castling and no easy counterattack.",
        "6... Bb4": "A positional blunder. This move overlooks the tempo gained by [7.Nd6 ], and the followup positional pressure that white is able to maintain.\n",
        "7. Nd6+": "\n",
        "7... Bxd6": "\n",
        "8. Qxd6": "What options are available for black at this point?  Consider [8...Qb6  9.Nb5! Qxd6  10.Nxd6 ] if then [10...Kd8 to protect the bishop, then [11.Nxf7 !] and the rook is lost. Not effective for black is [8...Qb6  8.Nb5! a6?  9.Nc7 ]. No better is expecting [8...Qe7  9.Qxe7 Kxe7], because there is still the knight move [8...Qe7 9.Nb4! a6?  10.Nc7  Kf8  11.Qxe7  Kxe7  12.Nxa8] and white stands better. Another bad try [8...a6  9.Bg5!] and the knight is both pinned and lost with a queen attack pending and mate to follow. The real problem for black in this position is the serious bind placed on the d and f pawns, the lack of development, lack of a black squared bishop. The text [8...Nc6] is an attempt to clear some pieces on the back rank to activate the rook, but there is not enough time.",
        "8... Nc6": "\n",
        "9. Bb5": "Here I overlook completely the better [9.Bb5!]. The text move does little to contribute to the attack.\n",
        "9... h5": "A blunder because the knight needed to be safeguarded against the pin by 9...h6]. Even a move like [9...Qe7] would have been better. I am very happy to see this move.\n",
        "10. Bg5": "I finally find the correct idea and place the bishop accordingly.",
        "10... Nxe4": "This move is a blunder. Fritz7 suggests the line [10... Qe7 {desperation} 11. Qxe7  Kxe7 12. Nd5  Ke6 13. Bxf6 Rh7] gaining a piece. The text move has the appearance of mixing it up with tactics, but all the tactics favor white.\n",
        "11. Nxe4": "Eliminating the threat while protecting the bishop.\n",
        "11... Qa5+": "A last effort at counterplay.",
        "12. c3": "A good move.  Better than [12.Kf1?? Qxb5 ]. An alternative [12.Kd1? Qxb5] is not as good because castling is ruled out.",
        "12... Qxb5": "Fritz advises that the alternative is also unfavorable: [12... f6 {does not win a prize} 13. Qxf6 Qc7 14. Qxh8  Kf7 15. Qh7  Kf8 16. Bh6  Ke8 17. Qg8  Ke7 18. Bg5#]\n",
        "13. Nf6+": "This move appears to be the correct path as the knight participates in the attack and a tempo is gained.",
        "13... Kd8": "The problem for white to solve now is: where can white successfully move to create a mate? The queen has no attacks. The d7 pawn is well guarded. There is no secondary objective of creating a double attack on king and queen by the knight. So the answer was to find a way to move the king to e8 and also to remove the knight at c6 so that the queen can finally use the e7 square for mate. The answer involved repositioning the knight at f6 while producing check.",
        "14. Ng8+": "Fritz suggests an alternative variation: [14. Nxd7  Ne7 15. Bxe7  Ke8 16. Nf6#] which is actually quite nice, but I had a plan and stopped calculating once it appeared successful and so did not see this variation.\n",
        "14... Ke8 15. Ne7": "Continuing with the simple plan of removing the knight so that e7 is free for mate.\n",
        "15... Qxb2": "Fritz comments that the alternative variation: [15... Rh7 {doesn't get the bull off the ice} 16. Bf6 Qc4 17. Nd5 Qe4  18. Kf1 Qxd5 19. Qxd5].  At this point I notice that my king may need to seek refuge so that I can continue the attack.\n",
        "16. O-O Qxc3": "There is not much to suggest because the position is already won. Just a note, black really needed [...Qb4], but the c3 pawn prevented it.\n",
        "17. Nxc6": "Eliminating the defender of e7.",
        "17... Qxa1": "Losing with the least point differencial.",
        "18. Qe7#": "A surprising mate in 18 against the dreaded computer. I really had no expectation of achieving this, even though I always play for a win, even against the AI. The main failing of black in this game was overlooking the knight incursion [6.Ndb5] and [7.Nd6 ]. The position leans heavily to whites favor after the BxN QxB exchanges. There were other weaker moves made also which contributed to the win.\n- - -\nIt is possible that the Nb5 maneuver was not in fashion back at the time this program was created and so maybe it was not in its book. I was lucky to have considered it because of seeing it in some Kasparov games that I have been studying. This was a very pleasing win considering how many times the AI has beaten me. I am going to enjoy this while I can in case it is my only win against this level.\n- - -\nI can of course dial the level down to a lower elo, and do play at lower levels. But I wanted to see what would happen if I played up some. This game will play some crazy stuff at the lower levels which can tend to demolish me. Much different play than any other chess software, and good for keeping me sharp - I hope."
    },
    "url": "https://gameknot.com/annotation.pl/how-not-to-play-a-sicilian-perfect-chessmate-game?gm=18711",
    "gameName": "How not to play a Sicilian - Perfect Chessmate Game",
    "players": "ChessKnave (1400) vs. Fletch2280 (2280)",
    "opening": "Sicilian (B27), Hungarian variation"
}