{
    "moves": {
        "1. e4 e5 2. Nf3 d6": "Philidor Defense!\n\nActually I like to play against it since I can move my Bishop to c4 (Steinitz variation) while the Black's darksquared bishop is locked.",
        "3. Bc4 Nf6": "Transposition into Petrovs defense (Italien variation)",
        "4. Nc3": "I decided on 4 Nc3 which is still quite common as far as I know. Obviously d3 would allow white to bring his second Bishop in.\n(The game DB statistics says Nc3 is the most common, however d3 seems to be more successful. Another option listed there is d4 which looks really interesting to me :))",
        "4... Bg4": "This move seems to be rather uncommon in the db. I'm not sure why. :) Perhaps Be7 is preferred because it strengthens the safety of the King.  ",
        "5. d3": "My opponent had no threats against me, so I choose not to castle and instead allow the Bishop to develop.",
        "5... Bxf3 6. Qxf3": "I think trading the Bishop for the knight was possible but I think it weakens Black's position. Now black is obviously behind in development, gave me the freedom to think about castling on the queen's side and thereby to strengthen an attack on his king's side. ",
        "6... h6": "Preventing Bg5, however I always think it is a move that is encouraged by fear. It weakens the pawnstructure, especially if one desires to castle on this side.",
        "7. g4": "This move was just damn tempting to me. The knight can't move so let's try to attack it. (Note that this attack was only made possible because black traded his bishop for my knight.)",
        "7... Qe7": "Black sees the problem and strengthens f7. Now his Bishop is totally locked up and I thought that perhaps he wants to castle on the queen's side. ",
        "8. h4 Nc6 9. g5": "And this is a blunder! I did not see it, but I'm sure you will find out.",
        "9... Nd7": "I expected or hoped that xg5 would follow, but well... \nNote that Black's queen has only 2 squares available: d8 and e7.",
        "10. Be3": "Safety first! I thought about Nd5, but feared Nd4... a double attack on c2 with a fork and the Queen on f3... ",
        "10... O-O-O 11. Bxf7": "Blacks castling left this pawn free to pick...\nNote: The black queen can't move!\nNote 2: I could have done 11 0-0-0, and I would have been good to go for Nd5...",
        "11... Nb4 12. O-O-O Kb8": "A one move threat and black is afraid of loosing his pawn on f7. However in my opinion this is a mistake. \nNb6!?",
        "13. a3": "a3! Black looses the only piece that defends the critical square on d5.",
        "13... Nc6": "?? Saves the knight but looses the queen.",
        "14. Nd5": "! et rien ne va plus!",
        "14... Nd4": "\"Only delays the inevitable\"",
        "15. Bxd4 Qxf7 16. Qxf7": "Now the queen is mine and from here on the game continued endlessly since I only wanted to get the points safely. :)\n\n",
        "16... exd4 17. f4 c6 18. gxh6 Rxh6 19. Nb4 Rf6 20. Qb3 Nb6 21. f5 c5 22. Nd5 Nxd5 23. Qxd5 Re8 24. Rdg1 Re5 25. Qg8 Re8 26. Rg6 a6 27. Rxf6 gxf6 28. Qf7 Rc8 29. Qxf6 Ka7 30. h5 Re8 31. h6 Be7 32. Qg6": ""
    },
    "url": "https://gameknot.com/annotation.pl/how-to-catch-a-queen?gm=41328",
    "gameName": "How to catch a queen",
    "players": "thedeafone (1537) vs. ranks2000 (1466)",
    "opening": "Philidor (C41), Steinitz variation"
}