{
    "moves": {
        "1. d4 d5 2. Nf3 Bf5 3. e3 Nf6 4. Bd3 e6 5. O-O Bd6": "Here black wasn't paying attention and white pulled off a tactic that messed up his position.",
        "6. c4 dxc4 7. Bxf5 exf5 8. Qa4+ Nc6 9. Nc3 O-O 10. Qxc4": "Now white has both center pawns, and black only has one on the side.",
        "10... Ne4 11. Nb5 Qf6 12. Nxd6 cxd6 13. b3 Rfc8 14. Bb2 Qe6 15. d5": "Whoops.  Black should have paid closer attention.",
        "15... Na5 16. dxe6 Nxc4 17. exf7+ Kxf7 18. bxc4 Rxc4": "At this point black thought, \"Well, I'm a pawn down, but at least I do have one advantage: I have a rook on the open column.\"  Then white proceeds to liquidate half the material in trades.",
        "19. Rac1 Rac8 20. Rxc4 Rxc4 21. Rc1 Rxc1+ 22. Bxc1": "At this point black very nearly resigned.  It's so depressing to play a knight against a knight and a bishop.  Then he noticed a fancy fork against white's bishop and king to win a pawn.",
        "22... Nc3": "Of course, if white doesn't move the bishop, black can fork it on the next move (N-e1).",
        "23. Ba3 Nxa2 24. Bxd6": "Well, ok.  So white managed to get his pawn back. BUT! NOW there are two beautiful isolated pawns on the edge of the board. In the worst case, white can probably sacrifice a knight or a bishop and get both of them, but who knows, maybe black can work it into some other kind of advantage.",
        "24... b5 25. Nd4 b4": "And the pawn is off.",
        "26. Nb3 Ke6 27. Bc5 a6 28. Kf1 Kd5 29. Bd4 Kc4 30. Nd2+ Kd3 31. Ke1 Kc2": "Wow, this is going really well (for black).  By chasing white's pieces around, black was able to get his king to the other side of the board before white did.  White may still be able to trade a piece for both pawns, if he tries hard.\nIncidentally, black could have defended the pawn on g7, but it seemed more valuable to get the king to c2 (and keep white's king out) than to save the pawn on g7.",
        "32. Nc4 Nc3 33. Bc5 b3 34. Na3+ Kd3": "Check is not always the best thing.  Black's king is actually better positioned now,  so if white DOES manage to sneak his king in and get both pawns, black can quickly get his king to the other side of the board and start capturing pawns.  Playing back and forth between the left and right is an important part of the endgame.",
        "35. Bd4": "This time black is willing to take a move to save the pawn.",
        "35... g6 36. Bxc3 Kxc3 37. Ke2 b2": "Now it is getting more desperate for white.  He may not be able to trade the knight for both pawns, he may have to trade it for a single pawn.",
        "38. f3 a5 39. Nb1+ Kc2 40. Na3+ Kb3 41. Nb1": "At this point, black (who was me) counted, it would take him 4 (unanswered) moves to get a queen, and if he tried for a queen by P-e4, e5, e6......it would take 5 (unanswered) moves.  Otherwise black would have been forced to move my king back to d5 to protect against the white pawn getting a queen.  It's an advantage to have your pawns closer to the other side of the board!!(unless the other king is close enough to capture them)",
        "41... a4 42. Nd2+ Kc2 43. e4 a3": "Black ignores the offer of the pawn.  There will be plenty of time to get all the pawns when black has a queen.",
        "44. Nc4": "One final attempt at a tactic, if P-b1, then Nxa3 forking the king and (new) queen.",
        "44... a2": "And resignation."
    },
    "url": "https://gameknot.com/annotation.pl/how-to-win-with-less-material-why-you-should-never-give-up?gm=20470",
    "gameName": "How to win with less material: why you should never give up.",
    "players": "pliko (1710) vs. phantomfive (1715)",
    "opening": "Queen's pawn game (D02)"
}