{
    "moves": {
        "1. e4 c5 2. Nf3 d6 3. d4 cxd4 4. Nxd4 Nf6 5. Nc3 a6 6. Be2": "Here we start off with a Sicilian Defense, which takes the Najdorf variation. This variation aimed for a small, but stable advantage.",
        "6... e5": "This attempts to exploit the weakness of the d5 square as well as exploiting pawn weakness on the queenside via a4 and a5. The next logical moves for me are Nb3, then O-O, and I do just that as well as play some stabilizing moves.",
        "7. Nb3 Be7 8. O-O O-O 9. Be3 Be6 10. Qd2 Nbd7 11. a4": "Pretty standard stuff, although the queenside is a bit congested with the two knights. Here, I plan to do a5 if my opponent does Nb6.",
        "11... Rc8 12. Rfd1": "He doesn't, and this is the first of my blunders. Instead of somehow putting pressure on the queenside, I choose to passively move my rooks, which is a no-no. Question mark worthy. I should have just continued with a5.",
        "12... Qc7 13. a5": "I then do a5 a move too late, but black already has such an advantage. I only give myself a half question mark here (?!), as that move was still not the best of moves.",
        "13... Rfe8 14. h3": "Here, I attempt to hopefully expose the queenside by preparing for a Bg4. However, this is wrong because I give up any advantage I might still have on the queenside. Full question mark move here. A much better move would be Bf3 to reinforce defense here.",
        "14... Bf8 15. Bd3": "Another full question mark worthy move here. Still oblivious to the wisdom of Bf3, I hope to reinforce the queenside instead of going through with my original plan. Again, at that point, I saw that h3 was dumb, but didn't think of Bf3 at the time.",
        "15... h6 16. f4": "Question mark and a half move here. I significantly weaken the kingside to try to get the e5 space free. Qe2 would have been a MUCH better move here. I will soon pay for that mistake.",
        "16... exf4 17. Bxf4": "Simple pawn exchange, which accomplishes my twisted illogical goal here. At that point, I didn't know what I was doing (due to a lack of sleep) and really set myself up for a fall here. I give myself a ?! here.",
        "17... Ne5 18. Bxe5": "A question mark and a half here, as Bishops are NOT worth trading for Knights in most cases. My bad reasoning was that I wanted to simplify the game here in order to weaken defenses. However, I end up doing much more damage to myself. A MUCH better move would have been Nd4 to pressure Black's bishop.",
        "18... dxe5 19. Qe3": "*TWO* question marks and a half here. This blunder leaves me open to a pin by the bishop, which is only prevented by the knight. This protection is gone when black uses his other bishop to capture the knight. ANYTHING is better here. For me, I would to with Na4 to prevent that very scenario.",
        "19... Bxb3 20. cxb3": "Here, I only thought of the exchange and didn't see the pin. I could have moved the queen out of her perilous way here in exchange for a lost knight. I give myself a single question mark move here.",
        "20... Bc5": "And here is the bear trap. I decide to just take the bishop, but all is still lost. The queen can now take mine, AND leave me in check, leaving me with no initiative whatsoever. I don't see any tricks, swindles, exchanges, or checks that could POSSIBLY give me back what I lost. And the player is above 1900, which means it is highly unlikely for him to blunder at all. So I decide to call the game as a lost cause and resign. Would you have resigned in this case? Or have continued due to a possible way to turn the tide? Thank you for watching a PRIME example of what NOT to do in the middle game.",
        "21. Qxc5": "Just my pathetic response before resigning the game."
    },
    "url": "https://gameknot.com/annotation.pl/how-to-lose-a-game-in-10-blunders?gm=54818",
    "gameName": "How to lose a game in 10 blunders.",
    "players": "kapak44 (1875) vs. quintilianor (1961)",
    "opening": "Sicilian (B92), Najdorf, Opovcensky variation"
}