{
    "moves": {
        "1. e4": "A very interesting NOT BLITZ game, specially the final position and its tactics. It would be interesting, I think, to share thoughts about the game. ",
        "1... d5 2. exd5 Nf6 3. d4": "The wisest answer, I almost never face. Now, taking the pawn is recommended, but I also tried Bf5, even if it not in the spirit of the opening. ",
        "3... Nxd5 4. a3": "A solw move, many would say. But it is true that Nb4 can be soon a threat. White is not at ease coping with this knight unless with some theory behind. ",
        "4... Bf5 5. Nf3 e6": "Uncommitting developement moves. Black is not in a hurry to play e5 and open the column, since it not any ahead in reaching castling. ",
        "6. c4": "Finally. ",
        "6... Nf6": "...or Nb6. I can't decide which is better, but I am not too experienced with c5 and this \"can't be bad\". Even so, the game is pretty \"slow\" for our standards. ",
        "7. Nc3 Be7": "This is a move I consider almost as a defeat, since it doesn't threaten anything. But I have to castle if I want some attacking chances. ",
        "8. Be2": "Testing my cool blood? :-)",
        "8... Nbd7": "Now that I know I can castle whenever I want, I better take care of my complete developement. This knight goes here because I want to keep the c pawn free to defend (c6) or attack (c5) at any moment. ",
        "9. O-O c6": "Well, now I feel really safe. White has some more space, but it is not clear how to take advantage of it right now. ",
        "10. h3": "A profilactic move... my, this is going to be slow. But I think that white should have taken the chance to occupy the black diagonal with Bf4 at once. So maybe this was not a good move. ",
        "10... Qc7": "Of course, I go into the diag myself!",
        "11. Be3": "Not that the dsb is misplaced here. ",
        "11... O-O-O": "!? Falling just into the enemy's fire. A mistake, I would say, but black's position seems able to stand it. I've played successfully against such attaks in a number of games. ",
        "12. b4": "Here it goes. ",
        "12... Ne4": "Reducing white's forces. ",
        "13. Nxe4 Bxe4": "Solidifying c6. ",
        "14. Nd2 Nf6": "I give up my bishop, but white's attack it's being distracted for the moment. I'm not progressing in attacking white's kinside, of course, but hey, I'm black...",
        "15. Nxe4 Nxe4 16. Qb3": "If f3, Nc3. This move piles up to b5 and b7, and looks frightening. ",
        "16... Bg5": "Again: I have to exchange my good pieces for the even better white one's. ",
        "17. Bxg5 Nxg5": "Now my knight is deflected to the battle area. It can came back into the game with simply Ne4 again (looking to d2). Moreover, my rook is threatening d4. So I won an active rook, but still b5 is weak. I'm sweating. ",
        "18. Qe3": "b5 at once coul have been worth a look. ",
        "18... h6": "If h4, Nh7, then Nf6. Or even g5. I want to give my kingside pawns some life - that's why I am struggling with my queenside...",
        "19. d5": "Taking advantage of the naked a7. ",
        "19... exd5": "I decided to take anyway. White can take a7, with probably a winning attack, but it is not a straightforward win, just a pawn storm. Black can stay calm and play something like Re8 or Rf8 (to f5 if Bg5+). ",
        "20. Qxa7 f5": "Preventing the bishop's check. ",
        "21. cxd5": "B5 was the move, I think, but I couldn't see a clear win. ",
        "21... Rxd5": "My rook is more active now. ",
        "22. Qa8+": "That's all white can do, unfortunately for her... or I am missing something?",
        "22... Qb8": "Forced. ",
        "23. Qxb8+": "Coming to another stage. Maybe Qa4...",
        "23... Kxb8 24. Rfd1": "This is what I most fear: in this kind of moves, the strategy is very important. What do I should want to achieve? The following are several lines I explored during the game, but it takes too much time to review them in depth. If someone likes it, they are interesting, IMO...\n(Note: I saved some lines for future analysis, but I am far from have time to \"decode\" them. They have some nice tactic in them...)\n\nh8-d8\n25.\td1-d5\tc6-d5\n26.\ta3-a4\td5-d4\n27.\te2-d3\tg7-g6\n28.\tb4-b5\td8-c8\n29.\ta4-a5\tc8-c3\n30.\td3-f1\td4-d3\n31.\ta5-a6\tb7-a6\n32.\tb5-a6\td3-d2\n33.\ta1-d1\tc3-c2\n34.\th3-h4\tg5-e4\n35.\tf2-f3\te4-g3\n36.\tg1-f2\tf5-f4\n\n\nh8-d8\n25.\td1-d5\tc6-d5\n26.\th3-h4\tg5-e4\n27.\ta3-a4\td5-d4\n28.\te2-d3\td8-c8\n29.\ta1-e1\te4-c3\n30.\te1-e7\tg7-g6\n31.\te7-d7\tc3-a4\n32.\td7-d4\tc8-c1+\n33.\tg1-h2\tc1-d1\n34.\tb4-b5\ta4-b2\n35.\td4-d8+\tb8-c7\n\n",
        "24... Rhd8": "Taking the tempo to develop. ",
        "25. Rdc1": "What is left of white's attack is just b5. Not much. Now, it's my turn. ",
        "25... Rd5d2": "White shouldn't allowed this but true is that no inmediate danger is in sight, provided white plays...",
        "26. Bf1": "Any other square was worse. It's white king now that sweats. ",
        "26... Rd8d6": "...and with this move I defend c6 and plan a nasty trheat in g6.",
        "27. b5": "White goes on with the only attack she has. With a more move, she would have played Ra-b1, probably, but there is no time. \n\nd6-g6\n28.\tb5-c6\tg5-h3+\n29.\tg1-h2\th3-f2\n30.\th2-g1\tb7-c6\n31.\ta1-b1+\tb8-c7\n32.\tf1-a6\tf2-h3+\n33.\tg1-h1\tg6-g2\n34.\tb1-b7+\tc7-d6",
        "27... Rg6": "Nxh3 is the first, naive threat. ",
        "28. g3": "...but now, I have to be wise. Nf3+, Kh2, Nh4+, Kh1... is hardly a serious threat for white. The \"unbalancing element\" can be only one... the f pawn. \n\nf5-f4\n29.\tg3-g4\th6-h5\n30.\tg4-h5\tg5-h3+\n31.\tg1-h2\td2-f2+\n32.\th2-h3\tg6-g3+\n33.\th3-h4\tf2-h2+\n34.\tf1-h3\th2-h3#",
        "28... f4": "Now it is different: gxf5, Nf3+, Kh1, Rg1#.",
        "29. bxc6": "White sees it, and also sees that I can't really win so quickly, so plays a devilish move. I could have played Rxc6, but much more \"funny\" was...",
        "29... fxg3": "...of course... black should win, now, shouldn't he?",
        "30. c7+": "!! ",
        "30... Kc8": "Forced. ",
        "31. Bg2": "!! White shields her king and threatens Bxb7+, winning!!!\nIf I don't play carefully, I can be busted in the last minute!\nThis was a real \"high voltage game\"...\n\n31.\tf1-g2\td2-b2\n32.\tf2-g3\tg5-f3+\n33.\tg2-f3\tg6-g3+\n34.\tg1-h1\tg3-h3+\n35.\th1-g1\th3-f3\n\n---\n\n32.\tg1-h1\tf2-f1+\n33.\tg2-f1\tg5-f3\n\n----------------\n\n31.\tf1-g2\tg3-f2+\n32.\tg1-f1\tg5-f3\n\n-----\n\n31.\tf1-g2\td2-b2\n32.\ta1-b1\tb2-b1\n33.\tc1-b1\tc8-c7\n34.\tb1-b7+\tc7-c8\n35.\tf2-g3\tg5-h3+\n36.\tg1-h2\th3-f2\n\n----\n\n31.\tf1-g2\td2-b2\n32.\th3-h4\tg5-e6\n33.\th4-h5\tg6-g5\n34.\tg2-h3\tg3-f2+\n35.\tg1-h1\tg5-h5\n\n----\n31.\tf1-g2\td2-b2\n32.\tc1-d1\tg5-f3+\n33.\tg2-f3\tg3-f2+\n34.\tg1-h1\tc8-c7\n35.\ta1-c1+\tc7-b8\n36.\td1-d8+\tb8-a7\n37.\td8-d7\tb2-b3\n38.\tf3-g2",
        "31... Rb2": "! A quiet move, but no other could lead me to victory (:-)(I'm not all that sure, of course!). After Kh1, I have no way to really break in. So I have to defend and pressure. If fxg6, Nf3+, BxN, Rxg6+, recovering the bishop along with the h3 pawn. ",
        "32. h4": "! I was taking into account this move, and the knight sac (Nf3+) can work only in specific conditions. ",
        "32... gxf2+": "...being this the first of them. ",
        "33. Kf1": "... I play better against this than against Kh1. This gives me the chance to get rid of the knight's problem. Now, I can play Nf3 because BxN, Rg1#, but I can't because of Bh3+, winning!... \nA really devilish position!",
        "33... Ne6": "So this seems to be the best move available. Now, Bh3, and the fight will continue. White won't be able to keep the pawn in the long term, and neither will I. It could have been a long endgame. But...",
        "34. Ra2": "...white tried to deflect the rook from b7's defence, overlooking...",
        "34... Rxg2": "White can play KxRb2, RxR, Rf1, Ra3, and black will have an isolated and free pawn to play with, with two more against one on the other side. Enough to win. But white went...",
        "35. Rxb2": "...allowing",
        "35... Rg1+": "Black will emerge with a knight and the game in his pocket. A very exciting game!",
        "36. Kxf2 Rxc1 37. Kg3 Rc3+ 38. Kg4 Rxa3 39. Rb6 Ra6 40. Rb4 Kxc7 41. Kf5 Nf8 42. h5 Ra5+": ""
    },
    "url": "https://gameknot.com/annotation.pl/how-about-a-game?gm=51549",
    "gameName": "how about a game?",
    "players": "cheeky_knight (1617) vs. damalfi (1782)",
    "opening": "Scandinavian (B01), Marshall variation"
}