{
    "moves": {
        "1. e4": "Hi all, and here is a game from a nearby Longplay Cup, which I won, against all the odds, just after I completely blundered my own queen! Yes, you DID read that correctly: not sacrificed, not lost against a tricky tactic - just an out-and-out complete blunder! I could hardly believe it after I saw it! The title, if nothing else, should make this game interesting to comment on!",
        "1... e6": "My opponent opens with the King Pawn, so I reply with my characteristic French Defence.",
        "2. Nf3": "The usual move for White against 1...e6, as well as against 1...d6, 1...c6, 1...h6!? and anything else like that, is to occupy the centre with his central pawns, and play 2.d4. Clearly my opponent does not know the French Defence particularly well. Having said that, this move can sometimes transpose back into main line French Defence positions.",
        "2... d5": "A crucial move in the French Defence: 2...d5 to strike back at White's central control. This should be easier, since he has not yet placed a pawn on the d4-square, to form a classical pawn centre.",
        "3. exd5": "OH NO!!!!!! My opponent chooses the ghastly, boring Exchange Variation of the French Defence! This is a drawish, slow-moving, symmetrical variation in which the pawn-structure is fixed, and both sides develop normally - this often results in a draw. Given my ambitions to win (I wanted my initial ECF Longplay rating to be as high as possible) this was not good for me.",
        "3... exd5 4. d4": "Transposing straight back into a boring Exchange French position.",
        "4... Nc6": "I usually go for 4...Nf6 5.Bg5 c6 as Black. However, I think that the text is fine.",
        "5. Bb5 Nf6 6. Nc3 a6 7. Ba4 Bf5": "An immediate 7...b5 would have been better, forcing White's bishop further back and expanding on the queenside with tempo. This would also lock White's bishop out of the game for the moment. I was more concerned with developing quickly, and hopefully livening up the position with a middlegame attack.",
        "8. O-O Be7 9. Re1 O-O 10. Bg5 h6 11. Bh4 Ne4": "Now, I reasoned, with all minor pieces developed, it was the start of the middlegame, and I should start looking to make this dull position more exciting. I decided that placing an outpost in my opponent's side of the board would be a good idea to start, and claim some space. There was also the possibility that my opponent would overlook the discovered attack on his bishop...although, that was unlikely.",
        "12. Bxe7 Nxe7 13. Bb3": "At this point, I was jubilant - my opponent had moved his bishop to the inactive square b3, and I didn't even have to play ...b5 to effect this! This essentially gives me a free move - or would have, if I had been planning ...b5 in the near future.",
        "13... c6": "Shoring up my d5-pawn, and ensuring that White's bishop remains out of the game for now.",
        "14. Nxe4 Bxe4 15. Qe2 Re8": "I wanted to maintain my bishop outpost on e4 - which, I reasoned, was my best chance of gaining an advantage over my opponent. So, I took steps towards preventing material loss after Nd2 by White.",
        "16. Rad1 Ng6 17. h3 Nf4 18. Qd2": "I spent a full 10 minutes on my next move. This makes it even more inexcusable. I first looked at 18...Bxf3 and after 19.Qxf4 Bxd1 or 19.gxf3 Qg5+! forcing checkmate. However, then I decided that 19.Rxe8+ Qxe8 20.Re1 followed by 21.Qxf4 lets White off the hook. I did not, for some reason, notice 18...Nxh3+, winning at least a pawn, if not a strong attack as well. The move which I eventually decided on...having spent 3 minutes looking at the consequences of this move...was the horrific, inexcusable",
        "18... Qg5": "...Qg4?? The horror speaks for itself. I couldn't believe I had played that. I nearly had a heart attack.",
        "19. Nxg5": "At this point, I was seriously considering resigning on the spot. I decided to play on - just in case.",
        "19... hxg5 20. f3 Bf5 21. Rxe8+ Rxe8": "And, my opponent forces a rook exchange. I thought I was done for. However, then my opponent erred himself. Complacent in probable victory? Perhaps.",
        "22. c3 Re2 23. Qc1 Rxg2+": "Snap! Suddenly, I had invaded on the 2nd rank, White's king was beleaguered, and White's position didn't look so easy to win after all.",
        "24. Kf1 Bxh3": "Even at this point, I didn't think I had winning chances. I just thought I could cause some trouble, and maybe my opponent would get flustered and miss something. A nice example of complicating a lost position.",
        "25. Qe3": "I confess I was hoping for 25.Ke1?? Re2# - however, White's text move isn't so good either. I win his queen for absolutely nothing, and end up a knight ahead, with a strong attack on his position too:",
        "25... Re2+ 26. Kg1 Rxe3": "My opponent, having been ahead a queen for a knight, is now completely and utterly lost. The game continued:",
        "27. Bc2 Re2 28. Bb1 Rg2+ 29. Kh1 Rxb2 30. Re1 Bg2+ 31. Kg1 g6 32. Bd3 Nxd3 33. a4 Nxe1 34. c4 Nxf3#": "Black wins. I hope you felt this game was interesting enough to look at, and comment on. I apologise for my horrific blunder, and yet I thank \"whatever gods may be\" for my eventual win. Again, thanks for your comments!"
    },
    "url": "https://gameknot.com/annotation.pl/how-to-win-after-blundering-a-queen?gm=24523",
    "gameName": "How to Win, After Blundering a Queen!",
    "players": "Joseph F (48) vs. fatcat2 (-)",
    "opening": "French (C00), Wing gambit"
}