{
    "moves": {
        "1. d4 d5 2. Bf4 Nc6": "This N should not be moved there, IMO... not a great deal, but it's much easier to play without c5 from black. ",
        "3. Nf3 e6": "...blocking his own lsb. Good for me.",
        "4. Nbd2 f5": "This implies I have to play g4 at some point in order to break in. ",
        "5. e3 Nf6 6. h3 Be7": "Still passive... but my edge is already in the air. ",
        "7. c3 O-O": "...right into danger. ",
        "8. Bd3 Bd7 9. Rg1": "This is the first \"surprise\" for him. Not going for castling.",
        "9... a6": "? Still passive! Good!",
        "10. g4 fxg4 11. hxg4 Be8": "Finally taking seriously the threates I am creating.",
        "12. Qc2 g6 13. Ng5": "...aiming to the weak e6, but also eyeing a sac in h7 in the future. ",
        "13... Qd7 14. Ndf3 b5": "Too slow, too late. Now castling queenside is not the priority.",
        "15. Ne5": "...this goes right into the point. ",
        "15... Nxe5 16. dxe5 Ne4": "...here, I cannot castle because my N is threatened. I thought for a while about Nxh7, KxN, BxN, dxB, Qxe4, threatening Ra8, and Qh1+... but I wasn't sure. Also Rh1+, Kg8 (otherwise Bh6+ wins the exchange), and then trying to sum my Q and the other R into the attack after Ke2. Well, too long a sequence for a blitz game for me. Probably I missed some chance here. ",
        "17. Nxe4 dxe4 18. Bxe4 Rd8": "...but now I can't break into his king's guard so easily. So...",
        "19. Rd1 Qxd1+ 20. Qxd1 Rxd1+ 21. Kxd1": "...and we enter an endgame, (sort of), with 4 bishops, a pawn and a cramped R for him, which I try to exploit. ",
        "21... c5": "Bb7 doesn't win a pawn.",
        "22. Ke2": "...but this defends my f2 pawn. You'll see why. ",
        "22... Kg7": "He saw it, and tried to activate his K, guarding h6.",
        "23. Rh1 Kg8": "Rh8 was better, IMO.",
        "24. Bh6 Rf7 25. f4": "...his dsb is almost blocked in. The only way to free his R is Bd8. ",
        "25... c4": "...or this, but on c5, his dsb has not much perspectives. Now it's time for a little tactic. ",
        "26. f5 exf5 27. gxf5 gxf5 28. Bd5": "...an exchange is always an exchange. ",
        "28... Kh8 29. Bxf7 Bxf7": "...here Rg1 threatens Rg7, winning one of the two bishops. I didn't see it. Moreover, I blundered. ",
        "30. Rd1": "?? Bh5+ and he gets his quality back. ",
        "30... Be6": "...but he doesn't see it. Bad for both of us. ",
        "31. Kf3": "Now I can improve my K. ",
        "31... Kg8": "Kind of a mistake. It loses h7.",
        "32. Rg1+ Kf7 33. Rg7+ Ke8 34. Rxh7 Bd5+": "The edge becomes greater. ",
        "35. Kf4 Be4 36. Bg7": "I plan Bf6, and if he takes, my pawn will promote on dark square.",
        "36... Bc5 37. Rh8+ Kd7": "Useless check, since I can't play Ra8 afterwards. ",
        "38. Rh6": "Trying another plan to advance my pawn. Even if I have a strong edge, it's a kind of edge that I can easily throw away.",
        "38... a5 39. e6+ Ke7 40. Bd4": "He can't exchange, or my pawns will become monsters. ",
        "40... Bd6+ 41. Be5 Bc5 42. Bc7": "with tempo. ",
        "42... a4 43. Ke5": "...My K helps. I have to choose: keep an eye on e3, or going for a promotion. ",
        "43... Bxe3 44. Rh7+ Ke8 45. e7 Bf2": "...looking for a skewer with Bg3+. Here, Ke6 and the game was over, but nobody's perfect!",
        "46. Bd6 Kd7": "Ok now or never!",
        "47. Kf6": "He can't prevent me from promotion!",
        "47... f4": "If I play Kf7, Bd5+ or BxR and I win all the same. But more precise, IMO, was...",
        "48. Rh8": "My opp. resigned. Wow, almost a high win! "
    },
    "url": "https://gameknot.com/annotation.pl/how-can-he-too-miss-it?gm=64055",
    "gameName": "How can HE TOO miss it!",
    "players": "damafi (1549) vs. LevonSimonyan1950 (1641)",
    "opening": "Queen's pawn, Mason variation (D00)"
}