{
    "moves": {
        "1. c4": "Normal c4 opening",
        "1... Nf6": "Fairly common Nf6",
        "2. c5": "LOL Attack of the pawns",
        "2... d6": "Swap?",
        "3. c6": "NEVER!!!",
        "3... bxc6": "Awwwww",
        "4. d4": "Queen pawns turn",
        "4... Ba6": "Trying to stop my bishop coming out without dying",
        "5. d5": "CHARGE!",
        "5... Nxd5": "Dang. He killed 2 pawns already. Time to play properly",
        "6. g3": "If my bishop cant have ur diagonal i'll go for the other.",
        "6... e5": "Controlling the centre.",
        "7. Bg2": "Threatening to gain a pawn through Bxd5,cxd5, Qxd5 threatening the rook ",
        "7... Bb7": "Defends the pawn",
        "8. Qb3": "I continue attack on knight and now add pressure to bishop and looks across to the kings weak pawn",
        "8... Qc8": "Only move to defend ",
        "9. Bh3": "Attacks the queen",
        "9... Nd7": "Simple block but now it's pinned",
        "10. Be3": "An accidental move by me and what black should do is to take the bishop and try to close the game with a two pawn advantage",
        "10... Be7": "Developing his bishop",
        "11. Nd2": "developing the knight",
        "11... g6": "not too sure why he did this",
        "12. Bh6": "stops him castling kingside",
        "12... f5": "ahh thats why. To stop the annoying pin",
        "13. e4": "Lets add more pressure to the pin",
        "13... Nc5": "oooo thats an annoying move",
        "14. Qc2": "Safe retreat",
        "14... Qe6": "Not too sure about this move by him. Surely Nb4 would have been better",
        "15. exd5": "oh well i'll take the knight",
        "15... cxd5": "Guess what!! i'm now drawing on points!!! already a comeback",
        "16. Ne2": "Developing the knight and making sure the rook is able to move if d4 is played",
        "16... O-O-O": "Castling queen side to get his king into safety... Or so he thinks. Now his king is in a file that my queen and rook can attack down. Also this creates a painful pin on the king and queen.",
        "17. O-O": "i castle too",
        "17... Ne4": "Tries to swap off pieces ",
        "18. Rac1": "No thanks i'd rather attack ur king",
        "18... Rd7": "oooo this is painful now his king rook and queen are on the same file as my bishop. All hiding behing a pawn",
        "19. Nxe4": "I'll take that knight now. ",
        "19... dxe4": "Obvious",
        "20. b4": "Trying to push pawns against the kingside",
        "20... g5": "Traps bishop in OH NO",
        "21. f3": "Take the pawn instead as a sacrifice. ",
        "21... e3": "Weirdly he refuses",
        "22. Bxf5": "hahaha take that!!! ",
        "22... Qxh6": "takes a bishop accepting two bishops for a rook and a pawn is fine",
        "23. Qxc7#": "Too bad i wasn't going to take the rook. This game shows that if you play someone hard start with random moves and sack pieces. This confuses your opponent as they don't know how to combat it. I know the opponent made several bad moves but the opening throws off the opponent and they don't play properly because they think your bad. This puts their guard down for you to strike when the times right.  Hope you enjoyed it. Rate if you want to see more of these game plays!!!!"
    },
    "url": "https://gameknot.com/annotation.pl/how-to-beat-good-players?gm=57796",
    "gameName": "How to beat good players",
    "players": "shankarr (1200) vs. ??? (~1600)",
    "opening": "English, 1...Nf6 (Anglo-Indian defense) (A15)"
}