{
    "moves": {
        "1. d4 g6": "A rather tricky way to reply to 1. d4. If I would have played c4 and tried to go for a KID setup, my opponent would have had the chance to delay the development of the Ng8 until he would have played f5 or f6, thus saving quite a few tempos in a normal position.",
        "2. e4": "Lucky for me, I love semi-open position and decided that the c-pawn could stay in its place for now.",
        "2... Bg7 3. Nc3 Nc6": "A rather strange plan. The early development of the Queen's Knight is rather rare because the pressure on d4 can be easily parried and Black is left with a lack of space and means to attack my pawn centre.",
        "4. Be3": "I wanted to keep the possibility of playing f4 and there is no danger on the long diagonal since Black's c-pawn isn't taking part in the struggle for the centre.",
        "4... e6": "I recently read a post on a chess forum about the Universal Attack, which would be best summed-up by developing pieces behind pawns. I've played and crushed plenty of players that would try to develop on this way. But they were patzers and my opponent wasn't, so I needed to be careful and not overextend myself.",
        "5. f4": "I just love pushing the pawn to f5 in these kind of positions. It usually means your attack is on its way and your opponent is soon going to be in deep trouble.",
        "5... a6": "Black sure is taking his time. The plan with a6 and b5 works better when there is pressure on e4. That isn't the case here, so playing like this seems a little artificial.",
        "6. Nf3 b5 7. Bd3": "Since b4 isn't a real threat, there is no need to weaken to Q-side with moves like a3, giving my opponent opportunities to open lines there. Especially since I planed to castle that way in a bit.",
        "7... Nge7 8. Qd2 O-O 9. O-O-O": "The Kings have signalled that it's going to be an all out war. I felt really good about my position because thanks to Black's first move I should have the upper-hand in opening lines first. On top of that, I am better developed, so any active operations would find me better placed to seize the advantage.",
        "9... b4 10. Ne2": "No problem. Black doesn't have any pieces to attack with and I can start to push the K-side pawns soon. My Knight will be more useful there.",
        "10... d5": "Fixing the centre before a flank attack. I still don't trust Black's position. It just seems too slow.",
        "11. e5 a5 12. Kb1": "Perhaps it wasn't necessary here but in most cases this King moves proves its usefulness later on.",
        "12... a4 13. g4": "Time to get my own pawn storm going.",
        "13... b3": "Trying to open lines.",
        "14. a3": "This is way moving a3 earlier would have proved wrong. There is an old saying in chess that has been proven time and again. Don't make needless pawn moves on the flank where you are weaker. Because my pawns were on their starting squares, I can block the position and deflate Black's attack, while he can't do the same about my pawn-thrusting ideas.",
        "14... Na5 15. c3": "Now there are two rows of pawns protecting my King.",
        "15... Nc4 16. Qc1": "Taking on c4 would have just given Black good ideas for counterplay. He would have gotten the long diagonal open for his unopposed Bishop, the d5 square for his Knight and the idea to play c5, pressuring my centre.",
        "16... Qd7": "Probably to come to b5 and to hold f5, after he develops his Bc8.",
        "17. Ng3": "Preparing for f5.",
        "17... Ba6 18. f5": "Always a nice move to make in such positions. The threat of f6 forces Black to open up lines for me.",
        "18... exf5 19. gxf5 f6": "A rather sad move to make but almost forced. 19...gxf5 loses right away to 20. Bg5, while the attempt to exchange pieces then capture on f5 still leads to disaster 19...Nxe3 20. Qxe3 Bxd3+ 21. Qxd3 gxf5 22. Nh5!",
        "20. Bh6": "Exchanging the best defender of the King. The fact that Black can win a pawn here is unimportant as that would only expose his King to all sorts of threats and gluttony would soon prove a deadly sin.",
        "20... Bxh6 21. Qxh6 fxe5 22. dxe5": "Better than 22. Bxc4, since this position is much more dangerous with Queens on the board for Black than it is for me.",
        "22... Nxa3+": "The only way to expose my King and create some counterplay. Otherwise, Black would just be forced to watch his King get squashed.",
        "23. bxa3 Bxd3+ 24. Rxd3 Nxf5": "Black has two pawns for a piece but my pieces aren't on their best squares and I'll need some time to regroup. Also, if he can expose my King, he'll have enough counterplay to balance the small material disadvantage.",
        "25. Qh3": "I didn't want any more pieces being exchange for now.",
        "25... Qe7": "Escaping the pin and attacking my weak pawn on a3.",
        "26. Kb2": "Forced.",
        "26... Ng7": "Preparing to blockade the pawn on e6 and hopefully advance the central pawns and open some lines on the Q-side.",
        "27. Rf1": "Overprotecting the Knight and bringing more piece into play.",
        "27... Rad8": "Now that the d3 Rook wasn't tied to defence, Black needs to defend his pawn as well.",
        "28. Rdd1": "Again not the most obvious move, I was still aiming to improve the position of my pieces, while avoiding exchanges.",
        "28... c6": "I think this was my opponent's last mistake. It's just too slow. 28...c5 was better, since then Black's pawn chain the Q-side could be secured and the d4 square was not available for a White Knight.",
        "29. Qg4": "Now the a4 pawn cannot be defended properly.",
        "29... c5": "Almost an admission of mistake. After 29...Ra8 30. Nd4 Black's counterplay stops.",
        "30. Qxa4": "A double-edged decision since now the a-file is open but that pawn chain had to be dismantled.",
        "30... Ne6": "Now Black is ready to activate his pieces at the expense of my King and Queen.",
        "31. Ne2": "Putting another piece in control of d4.",
        "31... Qb7": "With the idea of Ra8, while not allowing Qc6.",
        "32. Qg4": "Retracing my steps and hitting the Ne6.",
        "32... Qa6": "Moving on the a-file, protecting the Ne6 and attacking a Knight of my own.",
        "33. Nd2": "Now a3 could be defended by a Knight on b1 and the tension on the f-file makes Ra8 less of a threat.",
        "33... c4": "Defending the b3 pawn but also giving me the the d4 square.",
        "34. Rf6": "Forcing the exchange of a pair of Rooks even if that means the e5 pawn will soon be lost.",
        "34... Rxf6": "Forced, because Rxg6 was a less obvious but more deadly threat.",
        "35. exf6 Nc5": "The Knight is closing in on my King.",
        "36. Nxc4": "The pawn chain is dismantled once again.",
        "36... Qxf6": "Black still has ideas of Rb8 and Na4 so it's time to exchange the Queens.",
        "37. Rd2": "This small Rook lift makes sure there won't be any threats on the e-file. ",
        "37... h5": "A pawn advance with tempo that might prove useful later on. The Nc4 still can't be capture because of Qxc4+ and the piece is recaptured immediately after 37...dxc4 38. Qxc4+ Kg7 39. Rxd8+ Qxd8 40. Nd4! (a strong intermediate move) If. 38...Kh8 then 39. Rxd8+ Qxd8 40. Qxc5 and the threat of mate on f8 doesn't give Black time to recapture the Ne2 with Qd2+.",
        "38. Qf4": "Proposing the Queen exchange.",
        "38... Qe6": "I had a long thought at this position and decided that now was the time to return the material and enter the endgame.",
        "39. Ne3": "I think this is the only move that wins consistently. After everything else, Black has good chances to secure a draw.",
        "39... Rf8": "After 39...d4, I had analysed 40. Nxd4 Na4+ 41. Ka1 Qe7 42. Nd1 Qxa3+ 43. Kb1 Nxc3+ 44. Nxc3 Ra8 45. Nc2 bxc2 46. Kxc2 Rab 47. Qd4 and Black can't keep the Queens on the board for much longer. ",
        "40. Qd4": "This line that was played is almost forced and made it easier in choosing it and in evaluating the resulting endgame.",
        "40... Ne4": "The Knight was under attack and this was the best place it could go.",
        "41. Rd1 Rf2 42. Re1 Ng5": "With the idea of Nf3.",
        "43. Qxd5 Qxd5 44. Nxd5 Nf3": "Now Black equalizes in material but is left with a worse endgame. That's what I thought. In fact, White is winning after...",
        "45. Rd1 Rxe2+ 46. Kxb3 Rxh2 47. a4": "This was as far as I'd gone with my analysis of 39. Ne3 and I knew that the passed pawns supported by the King were much more dangerous that Black's pawns. In fact, I am almost playing a piece up because my King is taking part in the game, whilst Black's isn't doing anything.",
        "47... Nd2+ 48. Kb4 h4 49. a5 Ne4": "Black already has problems in keeping my a-pawn from promoting.",
        "50. Re1 Nd6 51. Kc5": "The final touch. A King is a great supporter of passed pawns, while a Knight is poor at stopping their advance.",
        "51... Nb7+": "After this move my opponent resigned. After 52. Kb6 he doesn't have anything better than 52...Nxa5, after which the c-pawn will start marching down the board. Here is a sample line of what could have followed 53. Kxa5 h3 54. c4 Rg2 55. Rh1 Rg3 56. c5 Rg5 57. Rxh3! (the Knight is redundant, the King is more important piece) Rxd5 58. Kb6"
    },
    "url": "https://gameknot.com/annotation.pl/how-to-liquidate-into-a-won-ending?gm=32502",
    "gameName": "How to liquidate into a won ending",
    "players": "nyctalop (2128) vs. eekan (2250)",
    "opening": "Modern defence (A40)"
}