{
    "moves": {
        "1. e4 d6 2. d4 e6 3. Nf3 Bd7": "Mainline for black was 3...Nd7. 3...Bd7 instead results in excessively passive play for black, with little centre dominance",
        "4. c4": "Although GK's analysis shows that 4Nc3 was best, I played this to capitalise on black's lack of centre control",
        "4... c6": "This issue with this move is that it traps in both black's bishop and knight, and wastes a tempo (move)",
        "5. Nc3 h6 6. Bd3 Be7 7. O-O Qc7 8. Bf4": "Here it is evident that white is playing for central dominance and piece development, while black is playing 'quietly' and is building a relatively solid defence. \n\nGiven black's higher rating, I think black should have played more aggressively and played for a win.",
        "8... Qc8": "Black does so to remove the pin on the d6 pawn by the f4 Bishop",
        "9. Re1 Nf6": "White's best move is to now play 10. e5, dxe5 11. dxe5 allowing white's centre to further expand",
        "10. Rc1": "However I did not see 10. e5 so I instead played to develop my last unmoved minor piece",
        "10... O-O 11. e5": "White now plays e5, albeit a tempo too late to have gained maximum advantage",
        "11... dxe5 12. Nxe5 Be8": "The issue with Be8 is it traps in the f8 rook. Better was to first play 12...Rd8",
        "13. Qf3 Nbd7": "A solid move by black in an attempt to rid white of the dominant e5 knight",
        "14. Qh3 g5": "A potentially game ending blunder, as if play continues 15. Qxh6 white mounts a near-unstoppable kingside assault. 15...gxf4 allows mate in five: 16.Nxd7! Ne4, 17Nf6+ Nxf6 18. Re5 Ne4 19. Rh5 ... and I'll leave it to you to work out the rest ;)",
        "15. Be3": "Sadly, I did not see this, so instead saved my bishop. ",
        "15... Kg7 16. f4": "White attempting to throw open black's kingside defence",
        "16... Nxe5": "A mistake by black as 17. fxg5 Nf3+ 18. Qxf3 would have been devastating for black (had I seen it!)",
        "17. dxe5 Nh7 18. Bxh7 Kxh7": "An error by black, in that the h6 pawn is now pinned",
        "19. fxg5 Rh8": "This is where black's magic begins. Rh8 has allowed for the rook to later fire down white's kingside, and also potentially to attack the white queen",
        "20. Ne4 Kg6": "Kudos to black for attempting to rapidly free up the rook and remove the pin, but this was a blunder as it allows 21 gxh6, which leaves the black king stranded in no-man's-land",
        "21. gxh6 Kh7": "Black now has to undo their previous move in order to salvage their king",
        "22. Nf6+": "A lost opportunity as white. Better was 22. Bg5 which would lead to more piercing play for white rather than simply trading off pieces",
        "22... Bxf6 23. exf6 e5": "Black's attempt to offer a queen trade and dampen white's attack. Upon white's decline of the trade offer, the black queen is now mobilised. \nGK's analysis does show that 23... Rg8 would have been superior. However, given that this is a lost position for black, best is to play with the intention of creating a sharp middle game, which occurs upon black's queen becoming active.",
        "24. Qg3": "White declines the swap offer, simultaneously attacking the e5 pawn and threatening Qg7#",
        "24... Rg8": "Black seizes the opportunity to line their rook up with the g2 pawn and to bounce the white queen",
        "25. Qxe5 Qg4": "A simple (but easily deflected) mate in one threat. The real purpose of this move was to further involve the black queen in a sharp counter-attack",
        "26. g3 c5": "Fantastic move by black; it makes space for Bc6",
        "27. Qf4 Qh3 28. Bxc5 Bc6": "Black develops the bishop, threatening mate in one - causing loss of tempo for white, who must prevent the threat",
        "29. Qf2": "White's subsequent defence allows black to perform a sneaky tactic - can you spot it?",
        "29... Qxh6": "The answer to the above problem was 29...Rxg6+! as 30. Qxg3 allows Rg8 - skewering white's king and queen, and 30. hxg3 allows 30 ... Qh1#\nAlthough black did not see this tactic, the opportunity to perform such a tactic arose from black's excellent kingside counter-attack \n\nAs a side note, black is still playing well in this position as a sequence such as 30. Qf5+ Kh8 31. Rcd1? allows 31... Rxg3+! 32. hxg3 Qh1#",
        "30. Rc2": "This is to free up the e1 rook, which was pinned down protecting the c1 rook from the black queen. However this still fails to address the threat of 30 ... Rxg3+! - a combination which neither player sees in the following 2 moves per side!!",
        "30... Rad8 31. Rce2 Rd3": "An error by black, as it allows 32. Qf5+ - which forces 32...Qg6 to prevent uncompensated loss of the d3 rook",
        "32. Qf5+ Qg6 33. Qh3+ Qh6 34. Qxh6+ Kxh6": "Can you spot white's best move here? I didn't during the game.",
        "35. Re2e3": "The answer was 35. Bxa7, as although it initially appears that 35...Ra8 will skewer the bishop and a2 pawn and resin a pawn for black, white could play 36. Be3+ followed by 37. b3 - allowing the e2 rook to defend the a2 pawn.",
        "35... Rxe3 36. Rxe3 b6 37. Bd4 Rd8 38. Bc3": "The resulting position is clearly winning for white, but not without some difficulty - black maintains a solid defence on all fronts. For white to win would require careful planning as to how to advance the three extra pawns.",
        "38... Re8": "An interesting move by black; whilst swapping off material when behind is typically not advisable, black has likely foreseen that the two remaining pieces would be opposite coloured bishops - which are notoriously conducive to draws despite material inequalities. ",
        "39. Rxe8 Bxe8": "White must now embark on a slow grind to a win. Any of black's chances for a win are now lost, but given my low 1600's rating, it wouldn't be uncommon for a player in my position to fail to capitalise on the material advantage. ",
        "40. b4 b5 41. cxb5 Bxb5 42. Kf2": "The game thus transitions from one of tactics to one of strategy. Can you see what each side's objective is in this position?",
        "42... Kg5 43. Ke3": "Answer: white is attempting to march the king to c5 to allow a push of the b pawn, while black is using their bishop to counter white's b-pawn push and also using their king to potentially erode white's g and h pawns.",
        "43... Kg4 44. Be5 a6": "Both sides have temporarily negated each other's strategies, as the a6 pawn defends against b5 regardless of white's king support, and white's g and h pawns are protected as white's next move will be 45. h4",
        "45. h4 Bd7 46. Kd4": "Now that black has no useful moves to play, white continues to march the king to support the b pawn",
        "46... Kf5 47. a3 Bb5": "Can you see white's winning move? GK's computer couldn't! In fact, even the supercomputer stockfish initially evaluates white's next move as only +1.7, but after white plays the move and stockfish is left for several minutes to compute the position, it gives an evaluation of +6.4. \nThis is where human strategic intuition trumps computational grunt!!",
        "48. h5": "!!! Regardless of black's play, white will be able to gain an advantage in one way or another from this position. ",
        "48... Kg5 49. g4 Be2 50. a4 Bxg4 51. b5 axb5 52. axb5": "From here white has a clear win, as white can push the b pawn to the 7th rank, at which point a bishop-pawn trade by black will leave white with a decisive bishop advantage",
        "52... Bf3 53. Kc5 Kxh5 54. Kd6 Kg6 55. Kc7 Kf5 56. Bc3 Ke6 57. b6 Bd5 58. b7 Bxb7 59. Kxb7 Kd7 60. Bb2 Ke8 61. Kc7 Kf8 62. Kd7 Kg8 63. Ke7 Kh7 64. Kxf7 Kh8 65. Ke8 Kh7 66. f7 Kg6 67. f8=Q": "And thus, black resigned. \nDespite a series of errors in the opening by both players, and some missed middle game tactics with black's opportunity of Rxg3+!, black played in a way that meant white could easily lose in the middle game, and that draws were not out of the question in the endgame. \n"
    },
    "url": "https://gameknot.com/annotation.pl/how-to-play-defensively?gm=63828",
    "gameName": "How to play defensively",
    "players": "ineedaname (1619) vs. muzzykezzy (1754)",
    "opening": "Pirc defence (B07)"
}