{
    "moves": {
        "1. c4": "This is the 8th of my long running series of how not to play chess. In this particular game I felt as though I successfully managed to grasp defeat from the jaws of victory.\n\nThis is a genuine case of a game of two halves. It was a ladder game which resulted from a challenge from armorpawn. I find it's common in ladders to get challenges from much higher rated players, my challenge in these cases is to give them something to think about. The action starts with the English opening.",
        "1... e5 2. Nc3 Nf6 3. e4 Bc5 4. f3": "This isn't a move I often play in the English and the computer calls it a mistake preferring d3. In the gameknot databases there are only two games both of which were won by white.",
        "4... Nc6": "This takes us out of the Gameknot database where Bxg1 is preferred",
        "5. Nge2 a6 6. Ng3 d6 7. d3": "I've been experimenting with d3 in the English and I'm still not sure how sound it is, the hole it tends to create in d4 makes me uncomfortable.",
        "7... Nd4 8. Bg5 c6 9. Be2": "The computer calls this a mistake due to 9. Be2 h6 10. Bd2 O-O 11. Rb1 Be6 12. b4 Ba7 13. a4 Qd7 14. h4 Nxe2 15. Qxe2 b5 16. h5 bxa4 17. Nxa4 but I can't see anything in there which makes it so bad",
        "9... h6 10. Bxf6": "This wasn't the best exchange for me as I have now lost my good bishop",
        "10... Qxf6 11. Qd2 b5 12. Bd1 O-O": "I'm reluctant to castle kingside due to the black bishop staring down the diagonal",
        "13. Nce2 Qxf3": "This threw me at first then I realised that taking the queen results in a royal fork. The computer calls this a blunder … Qxf3 14. Nxd4 Qf6 15. Nxc6 bxc4 16. dxc4 Bd7 17. Nb4 Qh4 18. Nd5 Bd4 19. Bf3 Rac8 20. Rc1 f5 21. exf5 Bxf5\n\nFortunately for me I spotted some of this sequence myself as we will see",
        "14. Nxd4": "Suddenly the game has swung in my favour",
        "14... Qf6 15. Ndf5": "Although the computer prefers Nxd6 I like this move here. my other knight, bishop and queen can easily get into the action and I can push my two kingside pawns in support, I have the makings of an assault on the black king. The idea is to tempt g6 which fails to Qxh6.",
        "15... g6": "Although this was in my plan I was suprised to see it played, the coomputer agrees, calling it a mistake",
        "16. Qxh6 Bb4+ 17. Ke2": "Kf2 is better as it doesn't block my lsb",
        "17... Bxf5 18. Nxf5 bxc4 19. g4": "The analysis calls this a mistake preferring 19. dxc4 d5 20. cxd5 cxd5 21. Bb3 Rfd8 22. Qh4 Qxh4 23. Nxh4 dxe4 24. Nxg6 Rd2+ 25. Ke3 Rd3+ 26. Kxe4 Rxb3 27. axb3 fxg6 28. Kxe5\n\nMy plan was to turn up the pressure around the black king",
        "19... d5 20. g5": "The computer calls this a mistake -  20. g5 cxd3+ 21. Kf2 Qh8 22. Qxh8+ Kxh8 23. Ng3 Bc5+ 24. Kg2 Rfb8 25. Rb1 Rb4 26. Kf3 Rab8 27. Bb3 Rxb3 28. axb3 Rxb3 29. Rbd1 Kg7\n\npreferring  20. Bc2 Rfd8 21. g5 Qh8 22. Qxh8+ Kxh8 23. Ne3 cxd3+ 24. Kxd3 Ra7 25. exd5 cxd5 26. Bb3 Rad7 27. Rhc1 Kg7\n\nMy idea was to push the black queen away if I could",
        "20... Qh8 21. Qxh8+ Kxh8": "At this point I felt I had been close to pulling off a suprise result but it had started to slip out of my hands and that I needed to try to maintain my material lead in order to stand a chance of maybe getting a draw.",
        "22. Ne7": "And it was all thrown away by this move which I can only describe as temporary madness.",
        "22... Bxe7": "Now life is a lot more comfortable for black who deservedly punished me for this.",
        "23. h4 cxd3+ 24. Kxd3 Rab8 25. h5 Kg7 26. hxg6 fxg6 27. exd5 cxd5 28. Bb3 d4 29. Rag1 Rf5 30. Rg2 Rxg5 31. Rgh2 Rf8 32. Rh2h7+ Kf6 33. Bc4 Rg3+ 34. Ke2 Re3+ 35. Kd2 e4 36. Rf1+ Rf3 37. Rc1": "This is a blunder as it allows black to force my king back with Rf2 which he takes full advantage of",
        "37... Rf2+ 38. Ke1 Rxb2 39. a4 Bb4+ 40. Kd1 Rd2+ 41. Ke1 Rh2+": "By this point I'd had more than enough. \n\nCongratulations to black for a thoroughly deserved victory\n\nThanks for reading please comment."
    },
    "url": "https://gameknot.com/annotation.pl/how-to-lose-at-chess-pt-8?gm=55187",
    "gameName": "How to lose at chess pt 8",
    "players": "elwoos (1482) vs. armorpawn (1763)",
    "opening": "English opening (A22)"
}