{
    "moves": {
        "1. e4 e6 2. d4 d5 3. Nd2": "I have picked up the Tarrasch as white in the French, as I feel it offers white better chances since it allows the pawn to move to c3. Plus, it avoids the Winawer, which has some annoying and somewhat drawish lines. ",
        "3... Nd7": "?! Allows white to transpose. As black ended up exchanging on e4 next move, now would have been the time to do it in the Rubenstein.",
        "4. Bd3": "In my mind the most flexible response. With the black knight on d7, there's no doubt that the white bishop belongs on d3 since there is no way to harass it. ",
        "4... dxe4 5. Nxe4 b6": "When I used to play the Rubenstein, I found that b6 early on weakened the light squares considerably. Moves like Ngf6 or Be7 are more common to strike at the center.",
        "6. Bf4": "Aiming to discourage c5. Black has little control of the center at the moment and this seals both of his breaks: e5 and c5, at least for the moment. Maybe not the best square for the bishop but it can be moved later when I know where it belongs.",
        "6... Bb7 7. Nf3": "The computer recommends Qf3!? here, with the threat of Nf6+ ... Qxb7 to weaken the light squares on the queenside even more. However Nf3 surely cannot be bad, and as shown later in the game maybe the queen belongs elsewhere.",
        "7... Ngf6 8. Qe2 Nd5": "Simply begging for a later c4.",
        "9. Bg3 Qc8": "?! Dubious. Black should be aiming for 2 things here: central control and development, both of which he is severely lacking in. Plus, black is no closer than 2 moves from castling either way.",
        "10. O-O": "Perhaps c4 ... d5 would have been good, but after O-O and Re1 white is undoubtedly ready to attack",
        "10... h6": "?! According to the computer, c4 ... d5 is good for white, but not winning. Re1 is solid and allows for more aggressive play since Black cannot escape the center anyways. The intention of the move is to stop Ng5xe6 sacrifices, but it is way too slow right now. Black probably should have just played Be7 and dealt with sacrifices when they happened.",
        "11. Rfe1 Be7 12. Rad1": "?! Missing the opportunity to seize the initiative with c4 ... d5. One of my only inaccuracies the whole game.",
        "12... O-O 13. c4": "Finally the move is played, albeit too late for a significant advantage. If ...Nb4?! white has no trouble after 14.Bb1! followed by a3, Qd3 with Nd6, Nc5, and Ng5 threats.",
        "13... Nd5f6": "The most sound place for the knight, but is still passive.",
        "14. Nc3": "!? The knight is better placed on c3 where it aims at b5 and d5, and vacates the e-file for the queen and rook, increasing the power of d5.",
        "14... Re8 15. Nb5 Bd8": "?! Not like the bishop was on a stellar square on e7, but d8 really diminishes all power the bishop has, and begins to block in other pieces.",
        "16. d5": "!? Best to play before it's too late. White's pieces are much more active and are more ready to exploit the open center should black accept this.",
        "16... exd5": "Note that 17. Qxe8+ Nxe8 18. Rxe8+ Nf8 has chances for white, but being down the queen for the rook + minor piece is a tough exchange to get compensation for.",
        "17. Qc2": "! The best place for the queen, allowing the rooks to ravage the e-file and Black's last active pieces: the e8 rook and the f6 knight.",
        "17... a6": "? Rxe1 is the only move that keeps black's activity",
        "18. Rxe8+ Nxe8 19. Nc3": "Note that the d5 pawn was never lost, as if 19...dxc4? 20. Bf5 wins back much more than the pawn. So, technically speaking, for temporarily being a pawn down white has de-activated all of black's pieces, and activated all of his own.",
        "19... c6": "My improvement would be Nef6, to at least try to minimize the power of Bf5",
        "20. Bf5": "The computer recommends Bh7+ first, but even if the king is less safe on h8 or f8 it's not so easy to get to the king at the moment.",
        "20... Bc7 21. cxd5": "Accepting doubled pawns to get rid of black's only active piece (should he exchange), and to get back the pawn.",
        "21... Bxg3 22. hxg3 Qc7": "Escaping the pin. Technically cxd5 would have regained the pawn, albeit temporarily, but black needs to be focused on repairing his position at the moment. The pawn is not enough for the pain he is in.",
        "23. Qd3": "Threatening to push the d-pawn or to capture on c6. Also relieving the knight of the pin on the c-file after cxd5. ",
        "23... Nc5 24. d6": "! Black cannot accept the queen on d3 or white forces a win after 24...Nxd3? 25. dxc7 Rd8! ",
        "24... Qd8 25. Qd2": "Aiming for f4. Once again black's pieces are miserable thanks to c6, which really just ended up blockading black's own bishop on b7.",
        "25... Nf6 26. b4": "!? Forcing black's knight to a lesser square at the cost of allowing out the b7 bishop.",
        "26... Ncd7 27. Re1": "! The play is on the e-file, specifically e7.",
        "27... c5 28. Qf4": "!? Re7 is inevitable, this move seeks to allow cxb4 in exchange for Ne4, or even just Qxb4 should be fine.",
        "28... g5": "?? Loses on the spot",
        "29. Nxg5": "! Accepts black's challenge of king safety.",
        "29... cxb4 30. Nce4": "Not worried about the knight on g5. Now the attack is everything.",
        "30... Bxe4 31. Bxe4": "Maybe slightly inaccurate. Nxe4 could have proved powerful as well. The resulting endgame after 31...hxg5 32. Qxg5+ Kf8 33. Bxa8 Qxa8 is difficult for both sides, or perhaps 33. Bd3!? could prolong the attack.",
        "31... Rc8": "However this surely loses for black.",
        "32. Nxf7": "Totally annihilating black's pawn structure.",
        "32... Kxf7 33. Bd5+ Kg6": "The best square for black's king.",
        "34. Re7 h5": "The losing move. The resulting endgame after 34...Qxe7 35. dxe7 Nxd5 36. Qe4+ Kf7 37. Qxd5 Kxf7 would have favored white, but is certainly unclear. However 34. h5 is suicide after...",
        "35. Be4+": "!! If the knight isn't enough, let's sacrifice the bishop too! Now the black king's defense is totally gone.",
        "35... Nxe4 36. Qf7+ Kg5": "If 36...Kh6? 37. Qg7#",
        "37. f4+ Kg4 38. Qg6+ Ng5 39. Qxg5#": "And the end of a beautiful, crushing attack. Hope you enjoyed the game!"
    },
    "url": "https://gameknot.com/annotation.pl/how-not-to-play-the-french-rubenstein?gm=54859",
    "gameName": "How Not to Play the French Rubenstein",
    "players": "CheapShotFail (1809) vs. Anonymous (1754)",
    "opening": "French (C03), Tarrasch"
}