{
    "moves": {
        "1. d4": "In the process of \"end of year\" reports and intensive summer courses, I'm  not playing at my best, but just for taking a break. Anyway, with this opponent, I see that one must be very careful. He is probably underrated, and will use me (sigh!) to get near to his real rating. ",
        "1... Nf6 2. Bf4 c5": "Finally someone who plays the best move. ",
        "3. e3": "? A mistake! White must play c3 here, so to open the way to his Q to b3, in case of Qb6. Any other move is just bad (in my view and experience).",
        "3... Nc6": "I still have time to correct my mistake with c3 now, but I missed it again. ",
        "4. Nf3": "? It allows...",
        "4... Qb6": "Now b2 is attacked and d4 is pressed, and I can't play c3 anymore, because of Qxb2. I know by bitter experiences that b3 just falls against black's pressure on qside dark squares. \nTo avoid this was all the point for an earlier c3, and I didn't play it. Now: this is the opportunity to explore once for all what will come out of all this \"if it was intentional\".\nI will \"bet\" that b2 is poisoned because of a spectacular combination: 5. Nc3. If Qxb2, 6. Nb5!?, and black can't prevent Nc2+, with heavy threats. Black can counter with Nb4, threatening the same to white, where white has the fantastic 7. Ne5!, \nfen=\"r1b1kb1r/pp1ppppp/5n2/1Np1N3/1n1P1B2/4P3/PqP2PPP/R2QKB1R b KQkq -\"\nand if Nxc2+, 8. QxN!, QxQ??, Nc2+, 9. Kd8, Kxf2#. \nfen=\"r1bk1b1r/ppNppNpp/5n2/2p5/3P1B2/4P3/P1q2PPP/R3KB1R b KQ -\"\n\nOn a different perspective, after 5. Nc3, Qxb2, 6. Nb5, d6!? leads to 7. Bc4, and the BQ is trapped after Rb1. \nfen=\"r1b1kb1r/pp2pppp/2np1n2/1Np5/2BP1B2/4PN2/PqP2PPP/R2QK2R b KQkq -\"\nNe4 is the only hope, then \n5.\tb1-c3\tb6-b2\n6.\tc3-b5\td7-d6\n7.\ta1-b1\tb2-a2\n8.\tf3-e5\td6-e5\n9.\tb5-c7+\te8-d7\n10.\td4-e5+\td7-c7\n11.\te5-e6+\tc6-e5\n12.\tf4-e5+\tc7-c6\n13.\tf1-b5+\t\nThis is a wonderful checkmate, but unfortunately, black has other responses, too, like the following: 8... QxR+, 9. Kd2! (no more checks, and Ne5+, QxN doesn't compensate black nor avoids the threatened checkmate). d6 seems a good move, but look: 10. Nc2+, Kd1 (forced), 11. Nxf2+!, KxN? (Kd7??, Bb5+!), 12. Qxc5+!, \n\nfen=\"r1b2b1r/ppk1pNpp/3p1n2/2Q5/3P1B2/4P3/P2K1PPP/q4B1R b - -\"\nKb1, 13. Nxd6!? (preventing the fork Ne4 and threatening Qxc1#, but...) Qb2+ will start a king chase that I'm not sure where will lead to! My king can escape BQ's checks via f3, and then nothing can save black from disaster: say the position is this: \n\nfen=\"rkb2b1r/pp2p1pp/3N1n2/2Q5/3P1B2/4PK2/Pq3PPP/5B1R b - -\"\nHow can black avoid Qxc1#? Escape via a6 is not possible because of Bf1, Bf1 is trapped, and of course exN, Bxd6#. The only way out is moving the B, and Bg5+ seems the best. White has to play Kg3. Black's Ne5+ is parried by NxN+(disc.), e4, Bxe4#. So black has only Nh5+, and it leads to mate anyway. \nDoes it seem complicated enough? Well, you've not seen more than a bit of it. ",
        "5. Nc3": "So I went for it. Any other alternative was spiceless and not good, or at least leading to a defensive and difficult game for white. This \"must\" work. At this point, the game became SO complicated, move after move, that I seriously think I need analysis lessons: \"how to analyze an overcomplicated tactic melee like this without being 1) overwhelmed, 2) lost\". If I could, I would pay for it... :-)",
        "5... d6": "Black, sensibly, doesn't go for the pawn. And now, the mate threat is no more. \nHere, a simple way of thinking would be: \ndxc5. If Qxb2, Nb5, etc. \nIf Qxc5 instead, I will have to expect e5 with pressure on d6, a well-known kind of game. \nAnother route is Na4, protecting b2 and kicking the Q: Qa5+, c3 (protecting the N), b5, kicking the N... another well known game which I didn't like too much. \nAnway, it is clear that the possibility to open the d column would favour me, but it was not so easy as I thought. \n\n\n5.\tb1-c3\td7-d6\n6.\td4-c5\tb6-c5\n7.\tc3-a4\tc5-b4+\n8.\tc2-c3\tb4-e4\n9.\tf3-g5\t\n\n------\n\n5.\tb1-c3\td7-d6\n6.\tf1-b5\tc8-d7\n7.\ta2-a3\tc6-a5\n8.\td4-c5\td6-c5\n9.\tb5-d7+\tf6-d7\n10.\tc3-d5\tb6-b2\n11.\td5-c7+\te8-d8\n12.\tf3-g5\t",
        "6. dxc5 Qxb2": "Black went for Qxb2! Now or never: all my plan is based on the fact that the BQ will be in troubles and possibly trapped - or, at least, the threat to do so must help me. \n",
        "7. Nb5": "This threats the fork check on c2, but has the heavy counterside of allowing e5 by black. But I couldn't lose a tempo defending Nc3 other than moving it. Now ir Qb4, c3 and the BQ begins to feel with few squares. By this time, I already spent a lot of analysis time. ",
        "7... e5": "Ouch - my opponent is good, and he always finds a good move. I heavily analyzed Nxe5 or Bxe5, but the best thing black can do is retaking on d5 with pieces, not the d pawn, and everything will hold, when cxd6 seems so good for white, but in fact it will be hard to retain this pawn, and Bd7 will efficently block it.  \nBc5 prepares the deadly Rb1, trapping the BQ, but after Nb4, with the threat of Qxc2 if Rb1, black keeps the spare tempo needed to cash the Bf4. \nI can just retire it to g3 or g5, true. \nBlack should defend c2, but Kd8 or Kd7 will put the K in front of my Q...\nBut black had another elegant way to defend: Nd5, provided that white can't take or QxRa1. White would move that R to b1, and Qxa2... defend the Nd5 (wow!). \nIn the meantime, white's B is still \"en prise\". \nIN the midsts of all this, I came out with this move: \nGiving the initiative to black, leading to Bg4, I have to defend with Be2, then Ne4... ",
        "8. Nd2": "Nc4 is a strong threat. Qb4+, c3 traps the Q (but for Qxc5, which I missed!). If QxNb5, Nc4xd6+ will win the Q for two minor pieces, minus the Bf4 (which will be taken after BxQb5), which leaves me with material advantage and a decent position. \nI gave up the second N's threat on f7... but just for a moment!",
        "8... Nd5": "Still not cashing the B, probably seeing too much danger in Nb3, Rb1, Qxa2, (another way to trap the BQ, but after exB, white needs to play c3 or Qf6), black, as usual, plays the best: I prevented (Ne5 - which I feared), but this, aiming to c3, is the very best because now I can't play c3 after Qb4 anymore...\nResuming: \nBeing a2 not defended after Rb1, the BQ can't be really trapped (This were hours of lines, because black can at any moment exchange his Q for two minor white pieces then cash the B, accept the fork, and then try to retake my N... which leads to advantage for white!), I just have to retreat my B... but black has a stunning answer to that: \n9. Bg3, Nc3b5!!, threatening the lethal check Nxc2...\n",
        "9. Nc4": "There are a lot of motivs here. I had to check for lines like this one: \n9...\tNc3, 10. NxQ, NxQ, 11. Rd1, e5xf4, 12. Nb5c7+, Kd7, 13. c5xd6, Rb8, 14. c2-c4, Bxd6, 15. c5, Kc7, 16. c5xBd6+, Kd7, 17. e3-e4\nWhite wins the N if used to Exchange Q, but black will revenge on the Bf4. After that, e4 looks good, as White can position his R on d1 in a couple of moves... maybe too much. ",
        "9... Qb4+": "Of course, QxN falls to Nxd6+, followed by BxQ. \nHere my opponent threatened to win the B cleanly... and he will do that. I can only seek for the best possible outcome for me. This was a hard task!\nI can interpose the pawn or the Q. Ke2 is out of question. \n10.\tc2-c3, Nxc3, 11. Qd2, Nd5, this way black ensures the same position without the pawn c3 in the way. And White has no tricks like...\n12. Bxe5, because of Qd2+, 13. KxQ, d6xBe5, 14. e3-e4, Nf4, 15. Nc7+,  Kd8, 16. NxRa8,  Bxc5, 17. f2-f3, Nb5, 18. Nxe3, a7-a6, 19. g2-g3, Ne6, 20. a2-a4, b5-b4, 21. a4-a5, b4-b3, 22. Nb6, b3-b2, 23. Rb1, Na5, 24. Rxb2\n\nToo many sidelines in the middle, with a good opponent... I stick for the simple this time. \t\n\n1.\nfen=\"2bk3r/5ppp/pN2n3/n1b1p3/4P3/4NPP1/1R1K3P/5B1R b - -\"\n\nOr:\n9.\td2-c4\tb2-b4+, 10.\tc2-c3\td5-c3, 11.\ta2-a3\tb4-b5, 12.\td1-d6\tb5-c4, 13.\tf4-e5\tc4-c5, 14.\td6-c5\tf8-c5, 15.\te5-c3\t\n\n2.\nfen=\"r1b1k2r/pp3ppp/2n5/2b5/8/P1B1P3/5PPP/R3KB1R b KQkq -\"\n\nAll disastrous for me. \n\nor:\n\n9.\td2-c4\tb2-b4+, 10.\tc2-c3\td5-c3, 11.\tc4-d6+\tf8-d6, 12.\ta2-a3\tc3-d1+, 13.\ta3-b4\td6-b8, 14.\tf4-g3\ta7-a6, 15.\te1-d1\tc6-b4, 16.\tf1-c4\tc8-d7, 17.\td1-e2\tb4-c2, 18.\ta1-a2\tc2-b4, 19.\ta2-a4\tb4-c6, 20.\th1-d1\te5-e4, 21.\tg3-b8\tc6-b8, 22.\tb5-c7+\te8-e7, 23.\tc7-a8\td7-a4, 24.\td1-b1\tb7-b5, 25.\tc5-b6\tb8-d7, 26.\ta8-c7\t\n\n3.\nfen=\"7r/2Nnkppp/pP6/8/b1B1p3/4P3/4KPPP/1R6 b - -\"\n\nHoping in (but black K must not lose a tempo):\n\n9.\td2-c4\tb2-b4+, 10.\tc2-c3\td5-c3, 11.\tb5-c7+\te8-d7, 12.\td1-d6+\tf8-d6, 13.\tc5-d6\td7-d8, 14.\tc4-e5\tc3-b1+, 15.\te1-e2\tc8-g4+, 16.\te5-g4\tb4-d2+, 17.\te2-f3\tf7-f5, 18.\tf4-g5+\td8-d7, 19.\tc7-a8\tf5-g4+, 20.\tf3-g3\td2-d6+, 21.\tg5-f4\td6-g6, 22.\tf1-e2\th7-h5, 23.\th1-d1+\td7-e7, 24.\tf4-d6+\te7-f6, 25.\th2-h4\tg4-h3+, 26.\tg3-h3\tg6-f5+, 27.\th3-h2\tg7-g5, 28.\te2-d3\t\n\n4.\nfen=\"r1b1kb1r/pp3ppp/2np4/1NPnp3/1qN2B2/2P1P3/P4PPP/R2QKB1R b KQkq -\"\n\nFinally, this is the chosen one:\n\n9.\td2-c4\tb2-b4+, 10.\tc2-c3\td5-c3, 11.\tb5-c7+\te8-d7, 12.\ta2-a3\tc3-d1+, 13.\ta3-b4\td7-c7, 14.\tc5-d6+\tf8-d6, 15.\ta1-d1\te5-f4, 16.\tc4-d6\tc6-b4, 17.\td6-f7\th8-f8, 18.\td1-c1+\tc7-b6, 19.\tf7-d6\tc8-d7, \n\n5.\nfen=\"r4r2/pp1b2pp/1k1N4/8/1n3p2/4P3/5PPP/2R1KB1R w K -\"",
        "10. Qd2": "As I said: if c3, black just wipes it out. Black still can't take the Nb5 with the Q because of Nxd6+, winning the Q. The BQ is not trapped because it has Qxc5, that I should better avoid at all costs. ",
        "10... Kd8": "!! Very nice move. All my threats are based on Nc7+ and Nxd6+, so this move removes both of them. It does leave BK behind my Q, but it is not a problem while black can Exchange it. White won't start the Exchange because after NxQb4, black will win the important tempo with the Nxc2+ threat. ",
        "11. Nbxd6": "Time to go for THE OTHER R instead!",
        "11... Bxd6 12. Nxd6": "Here, black has a tempo to take the B, but it will cost him an Exchange. ",
        "12... Be6": "Sensibly! I can't grab the b column yet, but it gives me a tempo to save my B, or...\n\nIf I go for e4...\n\n10.\td1-d2\te8-d8\n11.\tb5-d6\tf8-d6\n12.\tc4-d6\tc8-e6\n13.\te3-e4\td5-f4\n14.\td6-f7+\td8-e7\nI can't castle queenside...\n15.\te1-c1\tb4-a3+\n16.\tc1-b1\te6-a2+\n17.\tb1-a1\ta2-b3+\n18.\ta1-b1\ta3-a2+\n19.\tb1-c1\ta2-a1#\n\nFantastic:\n\n17.\tg3-f4\tg6-f4\n18.\tc2-c3\tb4-c5\n19.\td6-f5+\te6-f5\n20.\te4-f5\tc5-f5\n21.\te1-c1\ta8-d8\n22.\td1-e1+\tf4-e6\n23.\td2-g2\tf5-f6\n24.\tg2-g3\td8-d2\n25.\tg3-c7+\te7-e8\n26.\tc7-c8+\te8-e7\n27.\tc8-b7+\te7-f8\n28.\tc1-d2\tf6-f2+\n29.\td2-d1\tf2-f3+\n30.\tf1-e2\tf3-c3\n",
        "13. e4 Nxf4 14. Nxf7+": "? Getting the Exchange at the cost of the B. Probably better was simply Bg3, but then Qxc5 and White has almost nothing. ",
        "14... Ke7": "Nxd5 seems interesting, but after QxQ+, I will lose that N!\n\n14.\nd6-f7+ d8-e7 \n\n15.\nf7-g5 h7-h6 \n\n16.\nc2-c3 b4-c5 \n\n17.\ng5-e6 e7-e6 \n\n18.\ng2-g3 a8-d8 \n\n19.\nd2-c2 f4-g6 \n\n20.\nf1-h3+ e6-f6 \n\n21.\na1-c1 \n\n\nor:\n\n\n14.\nd6-f7+ d8-e7 \n\n15.\nf7-h8 b4-d2+ \n\n16.\ne1-d2 a8-d8+ \n\n17.\nd2-e3 c6-d4 \n\n18.\na1-b1 d4-c2+ \n\n19.\ne3-f3 e6-c8 \n\n20.\ng2-g3 f4-d3 \n\n21.\nf1-d3 d8-d3+ \n\n22.\nf3-e2 d3-c3 \n\n23.\ne2-d2 c3-c5 \n\n24.\nh1-c1 e7-f8 \n\n25.\nc1-c2 c5-c2+ \n\n26.\nd2-c2 f8-g8 \n\n27.\nb1-d1 \n",
        "15. Nxh8": "Well, now Qxe4+ gives black a strong position!",
        "15... Qxd2+": "I would say it is not the best, but anyway, black won...",
        "16. Kxd2 Rxh8": "I feared black would have gone for Rd8+ at once, with strong possibilities of a mate net. ",
        "17. g3": "...to be followed by f3!",
        "17... Rd8+ 18. Kc3": "The place from where my K controls Nb4, that forces me to lose a pawn. Nevertheless, Ke3 was better, in hindsight. ",
        "18... Nh5 19. Be2": "? Careless plan. Better was Rb1 at once. This only helps him to relocate his N!",
        "19... Nf6 20. f3": "Trying to build a fortress. ",
        "20... Nd7": "Now, black's Ns are much stronger. ",
        "21. Bc4": "? Again, a R move was indicated: Rb1 or Rd1. ",
        "21... Nxc5 22. Rhf1": "Preventing threats from Nd4. ",
        "22... Na4+ 23. Kb3 Bxc4+ 24. Kxc4 Rd2": "c2 is not attacked, since after Rxc2+, Kb3 seems to win a N. ",
        "25. h4": "So I defend the other pawn. ",
        "25... Nd4": "...without seeing that this seals my fate. ",
        "26. Kd5": "Almost any move gets black the possibility of a check forking my K and a R. ",
        "26... Kf6": "...and the position is hopeless, since one of my R will fall to a fork soon, no matter what I do. ",
        "27. Rad1": "?? ... but other moves just delayed the same result. Sigh!",
        "27... Nc3+": ""
    },
    "url": "https://gameknot.com/annotation.pl/how-to-analyze-this?gm=59142",
    "gameName": "How to analyze this?",
    "players": "damalfi (1769) vs. bert1bell (1615)",
    "opening": "Queen's pawn game (A45)"
}