{
    "moves": {
        "1. b3": "So once again, I get the chance to play my Goddess, the most perfect, wonderful being that ever walked on Earth. Now I have to be careful, I need to avoid winning, a draw would be best, leading to another game, but I must be careful and not make it too obvious.",
        "1... e5": "But why did she have to play such rubbish openings and make it hard for me?",
        "2. e3 d5 3. Bb2 Bd6 4. f4 exf4": "Oh gosh, here we go again, she is playing the same rubbish set-up. Even with the extra move, White has problems.",
        "5. Bb5+": "At least she avoids 5. Bg7 Qh4 check and Black is winning.",
        "5... c6": "Quite an instinctive way to meet the check, but in fact simply Kf8 protecting g7 seemed better, but I wanted to play good - but not winning - moves!",
        "6. Bxg7 Qh4+ 7. Kf1": "Now the White king has f1 to go to, it is not so bad for White. Quite honestly, I am not sure what is going on in the position, it seems pretty wild!",
        "7... cxb5 8. Bxh8 f6": "I am the exchange down, I have her bishop and she has my rook, but her bishop is now out of play and vulnerable.",
        "9. Nc3 fxe3": "Threatening mate on f2 after nine moves - can't be bad! I am sure she will see it.....",
        "10. Qf3 Be5": "I thought that this stopped the knight from moving, but.....",
        "11. Nxd5 Bxa1 12. Nc7+ Kf8 13. Qxe3": "And now its white's turn to threaten mate - on e8! I can't allow that.",
        "13... Ne7 14. Nf3 Qh5 15. c3": "And now it is her turn to trap in my Black squared bishop!",
        "15... Nf5": "Now that my queen covers e8, I can move this knight again.",
        "16. Qc5+ Kg8 17. Kf2": "White had to avoid Ng3 winning.",
        "17... Nd7 18. Qd5+ Kxh8 19. Nxa8 Bb2": "Now the easiest way for White to win is just to round up the bishop on b2, with moves like b4 and Rb1. Qxb5, threatening Qc4 looks good too. My opponent played something else though.",
        "20. g4 Qxg4": "Taking is forced, otherwise I lose the Nf5",
        "21. Rg1": "This position looks hopeless for Black, if the queen moves off the g file there is Qg8 or Rg8 mate, so I counter-attacked her queen.",
        "21... Ne7 22. Qf7": "Now if the Black queen leaved the g file, g8 is covered by the Ne7, but Qg7 is mate. I did spot a way I could turn the tables. Can you spot it? Message charleshiggie if you can. But she sat in front of me, so lovely. Krystal now thought she was winning and was obviously becoming excited. She smiled broadly and her eyes shone brighter than ever. Instead of playing the winning move, I said \"\"You have me there. I must lose my queen or get mated. I resign.\" To see the joy in her pretty face was well worth it."
    },
    "url": "https://gameknot.com/annotation.pl/how-not-to-win-part-2?gm=17076",
    "gameName": "How not to win, part 2",
    "players": "Beauty  vs. Baron ",
    "opening": "Nimzovich-Larsen attack (A01), modern variation"
}