{
    "moves": {
        "1. d4 e6 2. Nf3 Nf6 3. h3": "A not recommeded move. ",
        "3... d5 4. Bf4": "But I just want to protect this bishop.",
        "4... Bd6 5. Ne5 O-O 6. Nd2": "But this is a mistake, better was c3 right now. ",
        "6... c5": "Better than Nc6, it opens the way for the queen.",
        "7. e3": "Better again was c3, even at a cost of cxd, cxd. It leaves my king without the queenside castling, but I will lose it anyway, and o-o-o is not a \"must\", anyway...",
        "7... Qb6": "b3 seems suspect, but probably it was right. ",
        "8. Rb1": "A half-blunder, but my unfortunate Nd2 move has to be paid.",
        "8... cxd4 9. Nb3": "exd4 means Qxd4, but this is not good either. ",
        "9... Bb4+": "It seemed an ok attacking move for black, but he should have better played dxe3, since I had to recapture with fxe3, creating a weakness on e3 (BxN, BxB, Qxe3, Qe2, and I am in big trouble. ",
        "10. c3": "I welcome to lose another pawn to get rid of the d4 menace. ",
        "10... dxc3 11. bxc3 Bxc3+ 12. Nd2 Qc7": "Bad square for the queen. I had Rc1, but I choosed for the risky one.",
        "13. Ng6": "e5, NxR, exB, and I was lost. ",
        "13... Bxd2+": "Thank you.",
        "14. Qxd2": "The black queen is still under attack. ",
        "14... Qd8": "For some reason, black didn't want to play e5!",
        "15. Nxf8 Qxf8 16. f3": "Whew! Better to control the knight, the rest is routine. ",
        "16... Nc6 17. Qc3": "Again, better to control the pawns advance first.",
        "17... e5": "er... now?",
        "18. Bxe5 Nxe5 19. Qxe5": "Ok, but at cost of my good bishop. Oh, well...",
        "19... Be6": "Gives me another pawn. ",
        "20. Rxb7 Nd7 21. Qd4 Rb8 22. Ba6": "If Nc5, RxR first and everything's ok. ",
        "22... Nb6": "Trapping my rook, but no problem, since I can exchange it. ",
        "23. O-O": "At last! Now I am relieved...",
        "23... Qd6 24. Rxb8+": "Overlooking Rxa7. Anyway, I don't know if it is good. ",
        "24... Qxb8 25. f4": "I don't want to open the way for the bishop with e4. ",
        "25... Qd6 26. Rf3": "To cover Qa3, or counter it with Rg3 with mate threat, then we'll see. ",
        "26... h6 27. f5": "Why not?",
        "27... Bd7 28. e4": "The pawn is pinned...",
        "28... Qc7 29. e5": "I felt it better than exd4, separating the pawns, since the bishop cannot defend it easily. ",
        "29... Bc6 30. e6": "Just plain advance. ",
        "30... f6 31. Re3 Nc4": "Qe7 was the right move. ",
        "32. Bxc4 dxc4": "I can take it, but more sadistic was...",
        "33. e7": "Setting Qd8+ threat.",
        "33... Kf7": "It seems a defence, but it isn't - this is the nice part. ",
        "34. Qd8": "Qf8#, and there is no defence...",
        "34... Be8 35. Qxc7": ""
    },
    "url": "https://gameknot.com/annotation.pl/how-to-lose-after-a-crushing-opening?gm=39297",
    "gameName": "How to lose after a crushing opening.",
    "players": "damalfi  vs. bluebirdone ",
    "opening": "Queen's pawn (A40)"
}