{
    "moves": {
        "1. d4 d6 2. Nf3 f6": "Weird, but playable (?). It strikes right to the center, but cramps black a lot. ",
        "3. Bf4": "My \"standard\" following, maybe not the best. ",
        "3... g5 4. Bg3 h5": "Wow! ",
        "5. h4": "Wrong move, in this context. h3 was much better. ",
        "5... g4 6. Nh2": "Nd2 was playable and good. But it slowed white's developement, and I wanted a witty game.",
        "6... b6 7. Qd3": "...so I can play this at once (not after Nd2). After Rh6, Bf4 and white has an edge, despite the useless knight. ",
        "7... c5 8. Qg6+ Kd7": "Reached goal. Now, what? This is the dangerous moment. White is not ready for a real attack, so I must be careful. ",
        "9. dxc5 bxc5 10. e3": "Opening lines for the lsb without blocking a possible queen's replacement.",
        "10... Qa5+ 11. Nc3": "I calculated that after o-o-o, black has not enough developement to take advantage from the b column, so my knight will be free soon. ",
        "11... Bb7": "The plan f3 was the most logical, but I wanted to play aggressively, and without giving it a good thinking (you know, blitz, unrated games :-)...",
        "12. Bc4": "If Bxg2, Qf7 \"must\" get something in return for the rook. Of course, not sure at all.",
        "12... d5": "Smart, but...",
        "13. O-O-O": "smarter. I love when I can castle attacking. ",
        "13... e6": "Letting me in. ",
        "14. Qf7+ Be7": "this or Ne7, to save the bishop. ",
        "15. Qg7": "Pretty dull and naive, but I couldn't figure out so quickly another way of attack. I was thinking about Nxd5, taking advantage of the pin, but I wasn't sure about it at all.",
        "15... Nc6": "?? NOW it was Nxd5, for sure. ",
        "16. Qxh8": "Bleah, the naive one... still I couldn't see any countertrick, but in fact there was one. ",
        "16... Bd6": "If Q gives check, it only helps his knight to e7. ",
        "17. Bxd6 Kxd6": "Again, it was Nxd5. ",
        "18. Qxh5": "Well, at least I can try to free my knight. I was really unsure about how to go on, but now Nxd5 seemed even more dangerous.",
        "18... f5": "Hmpf. Ok, now what is the B plan? (Nxd5 was still good). ",
        "19. Qg6": "Now it is Rxd5+. ",
        "19... Ne5": "Gloam, this happens only in blitz games. ",
        "20. Qg7 Nxc4 21. Qxb7": "Keeping the material advantage... but feeling ashamed. ",
        "21... Nb6": "No danger of a blocked queen... just now. ",
        "22. e4": "Open lines at all cost.",
        "22... fxe4 23. Nxe4+ Ke5": "Ahh.. the kind of position I love to play. What's the mate net here? I didn't have time to think, remember.",
        "24. Qc7+": "Attraction. By taking the knight, my other rook can enter into the game. ",
        "24... Kxe4 25. Rhe1+": "Maybe better was Qf7, after which this is mate. ",
        "25... Kf5 26. Qf7+ Nf6 27. Qxe6+ Kg6": "Nxg4 was obvious, but I love attraction. ",
        "28. h5+": "If Kxh, Re5+ brings more material into the net. ",
        "28... Kg7 29. Qe7+ Kh6": "Better was Kg8, but with no hopes. ",
        "30. Qxf6+ Kxh5 31. Re5#": "So I felt the emotion of a tactical win. Good for the morning... now, back to work, to reality and... to \"good\" chess :-)"
    },
    "url": "https://gameknot.com/annotation.pl/how-to-go-on?gm=39975",
    "gameName": "How to go on?",
    "players": "damalfi  vs. ginges ",
    "opening": "Old Indian (A41), Tartakower (Wade) variation"
}