{
    "moves": {
        "1. e4 c6": "By the way, what is your view on this opening? Can you give a good plan for what both sides are trying to achieve and their future middlegame plans with good play? To play an opening effectively, you must understand the plans of both sides that will happen in the middlegame, and their goals in the opening. Black here is trying to gain a solid grip upon the center without having to block in the light bishop. On the other hand, he falls by a tempo in development. So white should not waste time, but play aggressively in most of the lines. Black should hold his position using a favorable pawn structure, and his stronger light squared bishop will help him later on if he gets out of the opening without concessions. But the position is only at move 1, so really it is a bit early to say. But the rule stands- *If you don't deeply understand an opening, it is not really part of your repertoire: you only memorized the moves, which is not as useful.*",
        "2. d4": "White is gaining the central space, and helping out development. By the way, you saw that the black's move of 1...c6 did not help development in any way. In the opening, we should mainly play moves of the pawn to help our pieces develop. Of course, in many situations in the opening, pawn moves are adequete and even good. But if we don't know the theory or the opening at all, and have a seemingly equal choice between pawn and piece move, we should move the piece. Of course, 1...c6 is totally fine and book, but I am saying in general.",
        "2... d5": "So black plays the idea of countering the central control. Now white has many ways to play. In most openings, we have the 3 goals to play for that I have mentioned in previous games. 1.Develop Minor pieces 2.Castle 3.connect rooks. Very rarely can you survive the opening if you do not accomplish 1 or 2 quickly. So we should do that before our opponent if we can.",
        "3. exd5 cxd5 4. Bd3": "We should use the knights to develop, since they are the least active, and usually go to only f3 or c3. But the Bd3 move has an idea to counter the development of the black's bad light squared bishop. Therefore it's the best move. By the way, I know there are other options, including the move 4.c4. But it is more thoery intensive, and needs a deeper understanding of the specific ideas. ",
        "4... Qc7": "Now black plays a strange looking move. The best move was just 4...Nf6, to develop and prepare ...Bg4, with a decent game by black. The idea of black with this strange move is to cut off the dark squared bishop's Bf4 move. That would be the bishop's only useful square. However, this move will run into some problems. So we met a new move that we don't know the theory to. Here is the approach---When there is a move we don't know the theory to, we need to first always 1.Assess the move. The ...Qc7 brings out the queen prematurely. It could be punishable. 1a-If the move is strange looking or questionable, then 2a-Find out the weaknesses it creates, and just think about how you could possibly refute the idea that it has. The ...Qc7 idea tries to refute Bf4, and it weakens d5 control. We already see we can try to attack the pawn with 5.Nc3. That is how a candidate move can be generated from this. 3a-After coming up with moves that are attempting to refute the idea as well as sound moves catering to the opening goals and principles, we use our thought process to pick the best one. The other step 1b-If the move looks fine, then just don't take a whole lot of time. You can think about refutation shortly, but just follow your main development process. It is only when the move is dangerous looking or more radical that we need to take it critically. Otherwise, take a shorter amount of time, like 2 or 3 minutes in 2 hour game.",
        "5. Nc3": "The move is the best, since it plans to attack both d5 and Nb5,Bf4. The move is different from the natural theory line of 5.c3, which was also an idea. But since black has played unorthodox move, we can forget about our normal opening moves. ",
        "5... e6": "Black needs to protect the pawn, but he did it in the wrong way. 5...Nf6, developing the bad piece was best. Now the light squared bishop is locked, and black has not gotten the knight out. ",
        "6. Nb5": "Although this moves the knight again, it does so with tempo, so it really loses no time at all, and helps the develop the bishop to f4. Otherwise black could restrict the knight with move ...a6, when black, although behind a lot in development, holds the position due to a solid pawn structure that restricts the white pieces.",
        "6... Qc6 7. Bf4": "White now generates the opening initiative, and starts to force the black pieces onto the awkward looking squares. It was all by using the opening approach, and finding the weaknesses of the black's strange move. The initiative gained means that our idea is successful.",
        "7... Na6 8. Qe2": "To hold the initiative, we should make a constant stream of threats, while making beneficial moves. By the rule of using the least active piece, 8.Nf3 is best, which also threatens Ne5. However, this queen move is also quite natural for the queen, and is also a good idea.",
        "8... Nf6": "(?) This move is a quite bad one, losing to a quite easy tactical maneuver. My opponents on the level 1800 USCF and above would usually never make such mistake, so it was rather surprising. However, the opening approach led to an initiative, and the opponent is already struggling to find a way to clean it up. That is probably his reason for missing the move.",
        "9. Nxa7": "Simple and clean, winning a pawn for absolutely no compensation for black. As you see, white's approach against an unorthodox play by black leads to a permanent advantage, which is what we are trying to achieve. If you have looked at my previous games, you can realize that white has now an advantage in both solid activity(material) and piece activity(position). By grabbing material, you are securing a permanent advantage in activity really, while the piece activity is much more fluid and dynamic. The main goal when one has an advantage in piece activity is to convert it to a permanent advantage or attack before it disappears.",
        "9... Qb6 10. Nb5 Bd7": "Here I got a bit overconfident, since I had such huge advantage in overall position. I made very natural looking move, but turns out, it allows black some counterplay. I really did not carefully examine the black response, thinking that one variation would suffice to refute it, but I was too hasty. ",
        "11. Nf3": "(?)This move is quite inaccurate, even though it follows all the principles. However, to take real advantage of this move, black must show a strong willpower as well as decent calculation abilities. He had the right idea, but his calculation was probably not good enough to show him the line where he could stir things up. I was saved by that.",
        "11... Nh5": "The best move, but he needed to understand why to find the best continuation.",
        "12. Be5": "It's not the best move, but it is the most testing idea. 12.Be3 Nb4 would give black a bit of compensation for his lost pawn, in the form of counterplay against my queenside. If black plays properly, I will likely be reduced to a small advantage in a complicated position.",
        "12... Nf6": "(??)Showing a complete lack of will to counterattack white, and a lot of timidity. Black had to counterattack, even if he could not fully calculate the variations. 12...f6! was best, even though it seems like 13.Ng5! refutes this idea. The natural capture of the bishop leads to a quick kill, but the quiet 13...g6! 14.Nxh7 fxe5 15.Bxg6+ Kd8 16.Qxh5 Qxb5 with a complicated position. White may have an very small advantage, but it is very tactical. I would be in a good position, since tactics and calculation are my stronger points, but he would have plenty of fighting chances there. I saw this variation and shook myself awake in the game, vowing to not make another careless move. However, my opponent thought for a long time and played this weak move 12...Nf6.",
        "13. a4": "The common mistake happens all the time by the way, among class players. They understand the problem, and can find the right ideas, but then after a long think, they play something ridiculous, like 12...Nf6(It is the second best move, but 12...f6 was the only move that black had to play to save his position). I think the reason is that they get scared by certain moves in the variations they calculate, or they just think too much. When a position is complex, and you have a choice that needs a lot of thought, your intuition is often right. Of course calculate and think as much as you can, but if you cannot find what the best move is, just trust your chess intuition and instinct. Your instinct is the first move/idea that comes to mind when you look at a position. For example, if black is to move in the position, my instinct is 13...Be7, since I have yet to complete my development. ",
        "13... Be7": "And certainly black does play the move. He is getting ready to castle.",
        "14. O-O O-O": "It is certainly the best move, but now comes a very important idea concerning planning: *Except in locked pawn structures, after you have taken control of or successfully completed a plan on one area of the board, you must transfer your attack onto another area, and play on that area. The reason is that you are already dominating on one area-It will be hard to keep going, and one area is not enough for a win usually. Also, when you dominate an area, there are usually no more targets there, so you need a different area to target. The new attack will be easy, since you are already winning on one area. By the way, this great rule is the reason for many others, like the principle or 2 weaknesses, for example. ",
        "15. Ng5": "I have stabilized the center, so black cannot play there and counter me. By the way, I already had a concentration of pieces over by the kingside, so no need to gather more force. The next step is to create threats, which my move certainly does. White is ready to keep outplaying the opponent. My opponent makes a reasonable, but weak move.",
        "15... g6": "The reasoning behind the move is clear- the d3 bishop is just far too strong, and threats to h7 must be stopped. But now the dark squares are weaker, and the d3 bishop is still not totally out of the attack. Now white begins an assault on the king. 15...h6 16.Bxf6 wrecks the pawn structure in front of the kingside, but there is no real good defense. Perhaps the best variation is 15...h6 16.Bxf6 gxf6 to keep the bishop pair, although white still has continued his plan and has already made weaknesses on the kingside.",
        "16. Qf3": "A solid move, attacking, and moving forward. Now black must play 16...Bxb5! 17.axb5 Nd7 when white still has a major advantage(due to a pawn up and more active pieces) but the kingside attack is repulsed. I will simply win by a positional grind, and gain other advantages.",
        "16... Kg7": "Of course, my opponent obviously does not apply a safety check to most of his moves. On move 9, Nxa7 is a nice tactic putting the knight on the far edge of the board. Let's do the same to the other side! ",
        "17. Nxh7": "Wins a second pawn, and crushes the opponent. You can see that when you play good positionally, the tactics just flow out of a position. When most players rated about B USCF play, so many games that last 4+ hours end up totally drawn, or a win for one side in the final stage of the endgame. These positions are usually closed or static. It proves the club players do not know how to plan very well or have a great positional understanding either. It is true: Most modern club players are weak positionally, and the key to improvement is an increase in the understanding of chess. When one has a better positional understanding, the need to calculate so many variations goes down. A simple realization of a plan in the middlegame in static or closed positions can lead to a clear advantage in just a couple of moves, by the way. The better understanding you have of chess, the easier it is to find good plans. It is the truth. Anyways, this game is not really much planning, since I won material by move 9, but it is still very important.",
        "17... Kxh7 18. Bxf6 Bxf6 19. Qxf6": "Now white is winning easily, and with some help from the opponent...",
        "19... Nb4": "(??)Well, it ends the game right away. Certainly white can win a third pawn with 20.Bxg6+, but there is far stronger move. It should not be too difficult to see.",
        "20. Ra3": "Tells the opponent that there is no more hope in the position, and he resigns."
    },
    "url": "https://gameknot.com/annotation.pl/how-to-play-vs-unknown-opening-diversion?gm=45632",
    "gameName": "How to Play vs Unknown Opening/Diversion",
    "players": "Me (2096) vs. Opponent (????)",
    "opening": "Caro-Kann (B13), exchange, Rubinstein variation"
}