{
    "moves": {
        "1. e4 b6": "Oh dear, one of the weaker defences.",
        "2. d4 Bb7 3. Bd3 f5": "This is really interesting. In an old 1960s edition of the magazine \"Chess\" they ran a \"How good is your chess\" column and this move was given maximum marks. In fact latest theory considers it to lose quickly.",
        "4. exf5 Bxg2 5. Qh5+ g6 6. fxg6 Nf6": "Bg7 is a better move for Black, but after 7. gxh7, Kf8, 8. Nf3!! has been shown to give White a clear advantage in all lines.",
        "7. g7+ Nxh5 8. gxh8=Q Bxh1": "And so we get to this strange position, where both sides have exchanged their king side rooks. Now White has several ways of winning now, taking on h7 with queen or bishop threatens mate, or Bh6 is also strong. Then I glanced across the board at my angel. I couldn't do it to her. I played 9.f3, which also seems a good move, trapping the Bishop on h1 in.",
        "9. f3 Nc6 10. Be4": "10. Be4 is again the perfect move for my strategy. Taking on h7 or Bh6 is still strong, but I wanted to play plausible moves, which didn't win, but didn't lose, but seemed reasonable.",
        "10... Nxd4": "And now 11. Qxd4 looks good, however......",
        "11. Bxa8 Nxc2+ 12. Kd1 Nxa1 13. Be4 d5 14. Bxh7 Qd6": "Preventing the killing check on g6",
        "15. Bh6 Qf6 16. Qxf6 Nxf6 17. Bxf8 Kxf8 18. Bd3 e5": "Although White is in theory a pawn down, I am still in control of this position, as the Na1 and Bh1 are out of play.",
        "19. Nd2": "I am pretty sure that this position is a win for White, and she can't stop me me playing K-c1-b1 and taking the knight on a1, but I didn't actually want to win, so I leaned forward and said \"Well I know that I am a pawn down, but I think I have compensation. Do you want a draw and then we can see if we get a result with colours reversed?\" She nodded her lovely little head and held out her soft warm hand. I once again had the pleasure of shaking it. I had done it! I had got the results I wanted!"
    },
    "url": "https://gameknot.com/annotation.pl/how-not-to-win-a-game?gm=17075",
    "gameName": "How not to win a game",
    "players": "Baron  vs. Beauty ",
    "opening": "Guatemala defence (B00)"
}