{
    "moves": {
        "1. d4": "In my OTB experience, I have played exclusively 1.e4. I like open position with attacking prospects and I don't mind giving counter-chances as long as there is lively piece play. Closed games are very much different. It's much harder to organize an early attack against the Black King in case Black plays something wrong and very often most of your play will be on the Q-side. That's just not my style but in correspondence, it's much easier and a lot better to have a wider opening repertoire since it will be difficult for opponents to prepare special lines against you.",
        "1... Nf6 2. c4 e5": "I think this was my first serious game in the Budapest. The only previous knowledge I had of the line was some NiC articles and a few blitz games with a club mate.",
        "3. dxe5": "Not taking the pawn gives Black a very easy game.",
        "3... Ne4": "3...Ng4 is the main move, hitting both the e5 pawn and f2. This is less critical and gives White extra options to limit Black's early initiative.",
        "4. a3": "Preventing a very disruptive check on b4. Since the e5 pawn isn't under direct threat, White can play this quiet move. Also in case the Black Bishop should come to c5, b4 could be played with tempo to drive it back from the good diagonal, provided that f2 is defended, of course.",
        "4... Qh4": "Threatening mate in one. Still such kind of empty attacks don't justify sacrificing a pawn, especially since the Queen is rather exposed now and can provided \"free\" moves for any White piece that attacks it.",
        "5. g3": "The other move was 5.Nh3 but that would leave the e5 pawn without a good defender.",
        "5... Qh5 6. Qd5": "I couldn't find this move in GK database but I did find it in my own database. It's less played than 6.Bg2, which gives back the pawn for initiative. It scored 90% in 5 games, just slightly bellow 6.Bg2. Needless to say I like it more because of aesthetics. A Queen in the center is very powerful, even in the opening, if it is on a secure spot that can't be attacked by the enemy pieces.",
        "6... Qf5": "Black moves his Queen again, to protect the Ne4 and to threaten f2 once more. Three consecutive Queen moves in the opening can't promise anything good.",
        "7. f4": "Bolstering e5 and shutting the Queen off from any more threats. There is a drawback to this move and Black exploits it at once.",
        "7... Bc5": "Not much of a threat now since at best Black can give a check to uncastle the White King or trade two light pieces for a Rook, which is a bad trade even if you're not a pawn down.",
        "8. Bg2": "Protecting the Rh1 and attacking the Ne4. Since g3 was played this is a nice cosy place to put the Bishop.",
        "8... Nf2": "Black could have also played 8...Bf2+ 9.Kf1 Nc5 10.Kxf2 Nb3, trying to exploit White's 4th and capture the unprotected Rook. But White can use again the precarious position of the Qf5 and play 11.Be4 Qe6 12.Be3 Nxa1 13.Nd2 and the Knight is going to be captured soon.",
        "9. Qxc5 Nxh1 10. Bxh1": "Black's little flurry of activity is over and he is material down and undeveloped.",
        "10... d6": "Using the pin on the fifth rank to gain a tempo on the White Queen and undermine e5.",
        "11. Qe3": "I didn't want to play 11.Qxc7, although objectively it might be the strongest move because I didn't want to sharpen the position any further since I was material up.",
        "11... O-O 12. Be4": "Blocking the e-file and targeting h7. ",
        "12... Qh5 13. Nf3 dxe5 14. Nxe5 Qxh2": "I was happy to trade a pawn for development and especially a pawn on a file that could be used for a castle assault.",
        "15. Nc3 c6": "Blocking the long white diagonal and controlling d5.",
        "16. f5": "Trying to take advantage of my advanced pawn to wedge the Bishop in, since now that c6 is played, it doesn't have any active square to develop. The f5 pawn could also serve as a kamikaze against the castled position of the Black King. I'm also preparing to bring my Bc1 into play.",
        "16... Re8": "Perhaps 16...f6 would have been slightly better but Black wanted to play something more active.",
        "17. Ng4": "The poor Black Queen seem stranded on the K-side not really attacking anything just lost in a sea of White pieces.",
        "17... Qh5 18. Qf4 Nd7 19. Be3": "I was hurrying to castle long and missed the best move, 19.Bf3! trapping the stranded damsel on the h-file.",
        "19... Nb6": "Besides the material deficit, Black has a very cramped position and is having serious problems just completing normal development.",
        "20. O-O-O": "Now that the Rook can come to h1, Black has to make room for his lady to rejoin the main bulk of the remaining army.",
        "20... f6 21. Rh1": "Finally punishing Black for taking the h-pawn.",
        "21... Qf7": "But now the Queen is in another perilous spot, on the same diagonal with the King.",
        "22. Bxb6": "So I execute a short combination to give material back to have a direct attack on the King.",
        "22... axb6 23. Nd5": "Black must have seen this is coming after 22.Nxb6 but there wasn't much he could do about it. The Knight is untouchable because of the subsequent pin on the Queen.",
        "23... Rxe4": "Better was 23...Kh8 but that would only prolong resistance.",
        "24. Ndxf6+": "An intermediate move to destroy the pawn shelter of the Black monarch.",
        "24... gxf6 25. Qxe4": "Black's two remaining pieces are still on their starting squares after 25 moves, his King's castle is full of holes and on top of it all a Queen for is threatened.",
        "25... Qg7": "Saves the Queen but allows a forced mate.",
        "26. Qe8+ Qf8 27. Nxf6+": "The forced mate line runs like this 27...Kg7 (27...Kh8 28.Qxf8#) 28.Rxh7+ Kxf6 29.Qxf8+ Ke5 (29...Kg5 30.Rg7+ and 31.Qh8#) 30.Qe7+ Kxf5 (30...Kd4 31.Rh4#; 30...Be6 31.Qxe6+ Kd4 32.Rh4+ Kc5 33.Qe7#) 31.Rh5+ Kg6 (31...Kg4 32.Qh4#) 32.Rg5+ Kh6 33.Qg7#. The first game I won with White where I didn't move my e-pawn."
    },
    "url": "https://gameknot.com/annotation.pl/how-to-win-against-offbeat-defenses?gm=25610",
    "gameName": "How to win against offbeat defenses",
    "players": "nyctalop (1798) vs. rocowo (1673)",
    "opening": "Budapest (A51), Fajarowicz variation"
}