{
    "moves": {
        "1. e4": "Team Match. I am playing white and open with the Open Game.",
        "1... c5 2. Nf3": "Sicilian. /sigh.",
        "2... d6 3. d4 cxd4 4. Nxd4 Nf6 5. Nc3": "Main Line so far.",
        "5... Nc6 6. Bg5": "Richter Rauzer attack.",
        "6... e6 7. Qd2 a6 8. O-O-O": "White is castled and almost fully developed. Black only has two pieces developed and is not ready to castle. This seems like a good time for white to look for attacks.",
        "8... Bd7 9. f4": "A main part of Sicilian games is opposite side castling, where white will rain pawns down upon the black castle. No time like the present to get started on that plan.",
        "9... b5 10. a3": "Black, of course, will want to rain pawns down on white's castle too. White missed a bit of an opportunity here to win a pawn or ruin black's kingside castle.",
        "10... Be7 11. Nxc6": "White found that missed opportunity.",
        "11... Bxc6 12. Bxf6": "The black bishop and queen are defending the pawn at d6. If black recaptures on f6 with his bishop, the pawn will fall. If not, black's kingside castle is in ruins.",
        "12... Bxf6 13. Qxd6 Qxd6 14. Rxd6": "If a rook on the 7th is heaven, is a rook on the 6th limbo?",
        "14... Rc8 15. e5 Be7 16. Rd2": "Ah, sigh.",
        "16... O-O 17. Bd3": "Black castled. Well he should since he sacrificed his d-pawn to maintain an intact kingside castle.",
        "17... Bb7 18. Be4": "Up by a pawn, might as well reduce pieces. Black's bishop cannot dodge left or right - he must fight.",
        "18... Bxe4 19. Nxe4 a5 20. Rd7": "Forget limbo, let's try heaven...",
        "20... Rfe8 21. Nd6": "Forcing another trade.",
        "21... Bxd6 22. Rxd6": "Back to limbo.",
        "22... h5 23. Rhd1": "Only one open file, time to own it.",
        "23... h4 24. Rd1d3 Rc4 25. Rd3d4 Rxd4 26. Rxd4": "Black initiates a trade. It's not favorable to the player who is behind in material, so white is glad to oblige (not that black gave white any choice in it).",
        "26... Rb8 27. Kd2": "Now I'm fumbling for what to do. The kingside is a wash, but here on the queenside white has a 3-to-2 pawn majority. Time to find a way to push that through to a promotion, though I'm not entirely sure how to do it.",
        "27... Kh7 28. Ke3": "Keeping the king centralized so black cannot use his king to gain an advantage kingside.",
        "28... Rc8 29. c3 Kg6 30. Rd7": "Back in heaven.",
        "30... f6 31. Rd6 fxe5 32. Rxe6+": "31. ... fxe5? was a miscalculation by black. It only cost him one more pawn, but going from down 7-to-6 to being down 6-to-4 is a big step toward a lost endgame.",
        "32... Kf7 33. Rxe5": "Now white has a pawn majority on both sides of the board.",
        "33... b4 34. Rxa5": "Playing 34. axb4 or 34. cxb4 seems to win another pawn for white, but after black plays 34. ... axb4 and white recaptures on b4, white has doubled pawns on the b-file and black responds with 35. Rc2, forking the pawns on b2 and g2 and regaining the lost pawn immediately. Worse, black then has his own slice of heaven with a rook on his 7th rank.",
        "34... bxc3 35. bxc3 Rxc3+ 36. Kd2": "Keeping black off of c2. How hard can it be? White is up by two pawns and has a passed pawn. Each side only has a rook to play with. Should be an easy endgame, right?",
        "36... Rb3 37. Kc2": "This is where I realize white is in trouble. I want to advance the a-pawn and promote him, but my rook is in the way. How I wish that rook were on a2 right now. White cannot force a promotion on the kingside with the pawn majority because black's king is over there. In fact, if I'm not careful, that king could destroy white's pawns if allowed to - fortunately white's rook dominates the 5th rank, shutting out the black king. White's king cannot run to the support of the kingside, because if he makes one move away from b2, he let's black play Rb2 followed by Rxg2 and Rxh2 and then he'll have no kingside to support. In fact, I worried that black might be able to play for a 3-move-repeat draw by bouncing back and forth between b3 and e3. Up by two pawns, and I'm faced with a draw?",
        "37... Re3 38. Kd1": "As I feared.",
        "38... Rb3 39. a4": "OK, no point in letting him have his draw. Besides, I think I found a way to get a queen. I spent lots of time here. If this had been a timed game in a tournament room, my time would surely have run out. Well, I would have spent less time and gone with my gut much sooner. I decide to let black have his slice of heaven back.",
        "39... Rb2 40. Rg5": "The rook defends g2, and is defended by a pawn so black cannot dislodge the rook with anything other than his own rook, such as from g6, which would be suicide - his king is too far away to stop the white a-pawn from promoting.",
        "40... Kf6 41. a5": "Never have 4 little steps looked so far. The pawn takes the first step.",
        "41... Ra2 42. h3": "Black attacks the pawn, but he's well enough defended. Of course, now the pawn can't take those last three steps that are looking even farther away, now. Black might want to break up the white kingside by playing his pawn to h3, so white prevents it.",
        "42... g6 43. Kc1": "Now it's time to get the white king involved in driving black out of heaven.",
        "43... Ra4 44. Kb2": "More time spent. White is sacrificing a pawn here, more than one in fact, but it seems worth it.",
        "44... Rxf4 45. Rg4": "The key move. I have to give 45. Rg4! an exclamation. Black cannot get back behind the white pawn now, no matter what he tries.",
        "45... Rf5 46. Ra4": "Back on move 37 I was wishing my rook were on a2. Well, wish granted (somewhat) since a4 is, now, just as good. Well, almost as good, since on a2 the rook could prevent black's next two moves.",
        "46... Rf2+ 47. Kb3": "By moving to the third rank, white prevents black from simply playing 47. ... Rf3+ and then playing for perpetual checks or 3-move-repeats. Further, it's possible that later in the game, there may become a power struggle over the a8 square and white will need his king to help.",
        "47... Rxg2 48. a6": "Now white has sacrificed two pawns, but at least the little guy on a2 knows he can finally put on the royal gown and reign as queen, even if only for a moment. Black should not have captured with 47. ... Rxg2?. Instead, 47. ... Re2, 48. ... Re8, and 49. ... Ra8 to block the white pawn and initiate that power struggle over a8 that I previously mentioned. Capturing with 47. ... Rxg2? loses the tempo he needs to reach a8 before the pawn promotes.",
        "48... Rg3+ 49. Kc4": "Same as with 47. Kb3, again white prevents black from simply putting him right back in check with 49. ... Rg4+. Black must play 49. ... Re3 and 50. ... Re8 so he can capture white's queen on a8.",
        "49... Rxh3 50. a7": "49. ... Rxh3?? seals black's doom. It's doubtful that black could survive a King+rook+pawn vs. King+2 pawns endgame, but it's far more doubtful that he can survive once white's queen promotes without immediate recapture. Moving his rook immediately to e8 was his only chance at a draw. It's interesting to note that six moves ago white had a two pawn material advantage, and now black has a one pawn advantage. Three white pawns gave their lives so their king could find a new queen.",
        "50... Rf3 51. a8=Q": "See? The royal gown looks good on him!",
        "51... Rf4+ 52. Kd3": "52. Kd3 once again prevents black from putting the white king in check. All black can do is play some kind of waiting move, and if he moves his rook off of the 4th rank he will lose his pawn to 53. Rxh4. Nothing for it but to trade rooks.",
        "52... Rxa4 53. Qxa4 g5 54. Qg4": "Total control. Neither black pawn can move.",
        "54... Kg6 55. Ke4": "Time for a king+queen checkmate, even though the white king must realize this guy in the gown is not the queen he began the game with... This is the point that black resigned. A fun endgame, one for the books (well, my books anyway), and my third longest game on GameKnot (would have been my longest game if we played out the eight or ten moves to a checkmate). I doff my hat, white_knight_03, you gave me two good games (our first was a draw)."
    },
    "url": "https://gameknot.com/annotation.pl/how-hard-can-it-be?gm=22485",
    "gameName": "How hard can it be?",
    "players": "blake84120 (1727) vs. white_knight_03 (1581)",
    "opening": "Sicilian (B68), Richter-Rauzer, Rauzer attack, 7...a6 defence, 9...Be7"
}