{
    "moves": {
        "1. e3": "When this tournament game started, my opponent was a good 100 points north of my rating. If I'd won he would be the highest ranked player I had beaten for some considerable time. The game started when my confidence was high. I had just completed reading Sierawans Strategy book which for me consolidated and added to some of the ideas I had already and which resulted in my rating skyrocketing by about 100 points to the highest its ever been, so I was optimistic. \n\nThe tournament itself was meant to be KGA but very few games started like that. this is Van't Kruijs opening which I'm not familiar with",
        "1... g6 2. a3": "Computer analysis calls this an inaccuracy but I can't really see how to take advantage of this.",
        "2... Nf6 3. b4 Bg7 4. Bb2": "As I'm not familiar with this opening at all I'm going for early safety and aiming to castle soon. This should give me a little time to see what my opponent is up to",
        "4... d6 5. c4 e5": "This takes us out of the Gameknot database. The aim is prohylaxis, it limits the white dsbs threats into my kingside. As it happens this is maintaned for much of the game.",
        "6. d3 O-O 7. Nc3 Nc6 8. Nf3 h6 9. Be2 b6 10. O-O Bb7": "the double fianchetto has been successfully used against me in the past so I thought I would try it here. This seems a good spot for my lsb",
        "11. d4 Re8 12. d5": "I was quite pleased by this as I don't want to damage my little pawn chain, the problem of course is that my lsb is now not so well placed which I'm sure is whites intent.",
        "12... Ne7 13. b5 Bc8": "Trying to keep the lsb active.",
        "14. h3 Nf5 15. Na2 Ne4 16. Nb4 Bd7 17. Nc6 Qc8 18. a4 Ne7 19. a5 Bxh3": "analysis calls this a mistake. I was more generous and thought of it as a high risk move that was intended to open up whites king and scare him a little, I can get my queen and both knights into the attack and push my kingside pawns, even though white has space he has little scope for manoeuvre just at the moment, though of course that can change quickly.",
        "20. gxh3 Qxh3 21. Nh2 h5 22. Bf3 Ng5 23. Bg2 Qh4 24. Qe2": "I'm unsure that I can see the point of this move. Interestingly the analysis calls it a mistake preferring 24. axb6 cxb6 25. Ra4 Nf5 26. Qe2",
        "24... Nh3+": "Analysis also calls this a mistake but my aim was to get rid of a defender and bring my other knight in .",
        "25. Bxh3 Qxh3 26. e4 Bh6": "my dsb can now support a pawn push ",
        "27. Qf3 Qxf3 28. Nxf3 g5": "Analysis calls this a mistake preferring  … Kf8 29. Kg2 Ng8 30. Bc1 Bxc1 31. Rfxc1 Nf6 but for me at the time it was part of my plan",
        "29. axb6 cxb6 30. Rxa7 Rxa7": "I was hoping to avoid the rook exchange but white has forced it.",
        "31. Nxa7 g4": "The white knight has limited options and can then be threatened by my dsb",
        "32. Nh4 Bg5 33. Ng2 Ra8 34. Ra1 h4 35. Nc6": "Analysis calls this a mistake. I would prefer to keep a rook",
        "35... Rc8": "I'm unsure about this move, the idea was to reduce the risk that white would exchange knights as he would lose a pawn. Better may have been Rf8",
        "36. Ra4": "not ideal for white but the only way he can protect his pawn on c4",
        "36... f5 37. exf5 Nxf5 38. Ne3": "This is a blunder due to 38. Ne3 Bxe3 39. fxe3 Rf8 40. Ra1 Nxe3 \nUnfortunately for me I didn't quite see that...",
        "38... Nxe3": "... and I blundered too ( 38. Ne3 Bxe3 39. fxe3)",
        "39. fxe3": "Luckily for me white didn't spot it and blundered too.  This gave me some hope that I may be able to push the white king into a corner and make life difficult for him",
        "39... Bxe3+": "Analysis puts black significantly ahead for the first time in the game",
        "40. Kg2 Rf8": "The white king is trapped into a corner and I have three passed pawns, things are looking up. At this point I was optimistic that I might win or at worst draw.",
        "41. Bxe5": "this is obviously a gamble for white ",
        "41... Rf2+": "I got hesitant as I didn't want to give white a passed pawn. \n\nAnalysis here prefers  … dxe5 42. Nxe5 h3+ 43. Kg3 Bf4+ 44. Kxg4 h2 45. Ra1 Bxe5 46. Rh1 Rf4+ 47. Kh3 Rxc4 ",
        "42. Kh1 g3 43. Ra8+": "Obviously this was coming, I just hoped I could hold my nerve long enough to ride it out",
        "43... Kf7 44. Ra7+ Kg6 45. Rg7+ Kf5 46. Bxg3 hxg3 47. Rxg3 Rf1+ 48. Kg2 Rg1+": "At this point my slim chances of winning had all but evaporated. All of my checking suggested that the game could now be drawn, so I somewhat reluctanly aimed at a draw.",
        "49. Kf3 Rxg3+ 50. Kxg3 Ke4 51. Nb4 Bc5 52. Na6 Kd4 53. Kf4 Kxc4": "By this point I had convinced myself that this was a draw",
        "54. Nc7 Kd4 55. Kf5 Kc4 56. Ke6": "I couldn't see here what was was attempting",
        "56... Kb4": "I didn't realise at the time but this was the single move that meant I lost. Best is … Ba3 57. Ne8 Kxb5 58. Nxd6+ Kc5 59. Ne4+ Kc4 60. d6 Bxd6 61. Nxd6+ Kc5 62. Nb7+ Kd4 63. Nd6\nwhich I would have been very happy with.",
        "57. Kd7": "I think it was about here when I finally realised what white was doing but it was too late.",
        "57... Kc4 58. Kc6 Kb4": "This was my final blunder. analysis suggests … \n",
        "59. Na6+": "Once again I have proved to myself that one move can lose a game, I just need to remember that lesson now!"
    },
    "url": "https://gameknot.com/annotation.pl/how-to-lose-at-chess-pt-15-a-bit-of-a-roller-coaster?gm=68111",
    "gameName": "How to lose at Chess pt 15 - a bit of a roller coaster",
    "players": "cetst11 (1881) vs. elwoos (1632)",
    "opening": "Van't Kruijs opening (A00)"
}