{
    "moves": {
        "1. d4 Nf6 2. Bf4 d6 3. Nf3 g6 4. Nbd2 Bg7 5. e4": "As for now on, when black doesn't play d5, I always go with e4. It gets space in the center, \"it can't be bad\" :-)",
        "5... Nbd7 6. c3": "Overprotecting d4, but more than that opening the lines for my Q to b3.",
        "6... O-O 7. Qb3": "Some inmediate shadows get on black's castling. Nothing black can't handle, anyway.",
        "7... c6": "c5 is better, IMO. ",
        "8. Bc4": "\"Naive\", true, but... ",
        "8... h6": "Black is playing \"too seriously\". d5 was good and enough. ",
        "9. Bg3": "Securing my dsb against any countertreat after (say) e5-Nh5. Also opening the way for a future f4.",
        "9... b5": "Of course. ",
        "10. Bd3": "Now, e5 is my aim, but I can't play it lightly or d5 and the e4 square can't be occupied by my minor pieces. ",
        "10... Nh5": "Good. If NxB, I'll open the h column for my R, and this can't be bad. ",
        "11. Nh4": "Directly threatening Nxg6, and if g5, Ng6 anyway, or Nf5. Now I kind of play e5 in order to open the diagonal for my lsb to g6. ",
        "11... Kh7": "Defending g6, but getting even worse perspectives for his K. ",
        "12. O-O-O": "Maybe Qc2 was better.",
        "12... a5": "...Of course, his pawns get over my K. ",
        "13. Ndf3": "My plan is to play e5 and, if he exchanges, I have Bxg6+ winning his Q. If he doesn't take, Qc2 and my pressure on g6 is considerable. ",
        "13... Qb6": "He defends the previous plan, but this gives just two steps away from a wonderful combination. A very obvious one. ",
        "14. e5": "First step. ",
        "14... Nxg3": "He removes one of the defenders of e5, thinking he tricked me since now he wins the exchanges. But in doing so he makes the second step in my direction. Can you spot what am I aiming for?",
        "15. hxg3 dxe5 16. Ng5+": "Can I give myself a !, ? The only move for black is Kg8, allowing Nxf7, RxN, Bxg6. Otherwise...",
        "16... hxg5": "What a juicy position! How could a 1669 player miss the following?",
        "17. Nxg6+": "Only move for black is Bh6, but even so, NxR++, Kg7, Ne6+, exN, Qxe6 seem to give me the victory threatening RxBh6. Probably black has to play something like c5 in order to cover the threat, but RxBh6, QxQ, RxQ and I'm up. Instead (and it's a pity, but a great satisfaction for a poor player like me...)",
        "17... Kg8": "??",
        "18. Nxe7#": "Wow!!! This is my \"Tal's night!\". Thank you for reading, and please have a laugh at my enthusiasm. I have so many things on my head that to being able to make a game like this is whorty."
    },
    "url": "https://gameknot.com/annotation.pl/how-could-he-miss-this?gm=64037",
    "gameName": "How could he miss this??",
    "players": "damafi (1527) vs. sdrowles (1658)",
    "opening": "Queen's pawn game (A45)"
}