{
    "moves": {
        "1. e4": "This game is a perfect example of how misjudging a position can make you lose a won game. The term \"won game\" in and by itself is something one needs to be careful with. If you think of a match as having won it already, you're prone to make errors which can be costly. In the case of this match it was an innocent looking move, and one I didn't put much thought into because I had \"won\" already, that led to my demise.",
        "1... e5 2. Nf3 Nc6 3. Bc4 d6 4. c3 a6": "I'm not too sure why my opponent played a6, considering I had already put my bishop on c4. Maybe he's planning on playing b5 and possibly put his bishop on b7.",
        "5. Qb3": "This targets the weak f7 pawn.",
        "5... Qf6 6. d3": "Strengthening e4 and freeing the dark square bishop.",
        "6... h6 7. Be3 b6 8. Bd5 Na5 9. Qa3": "9. Qa4+ would be answered with 9...Bd7, and my Queen would immediately have to move again. That'd be silly.",
        "9... Bb7 10. Qa4+": "Black can't block with knight or bishop because c6 is attacked twice. 10...c6 is possible but weakens Black's queenside pawns. It hangs b6 immediately.",
        "10... Kd8": "Black chooses to move his king which is definitely a success because he can't castle anymore.",
        "11. c4": "The idea behind 11. c4 is to take back with the c-pawn if Black decides to trade bishops on d5. This way I'd be opening up a file for my rook to attack the enemy king.\n\nNote that 11...c6 is not a threat because of 12. Bxb6+",
        "11... Ne7 12. b4": "I'm pushing pawns to pressure the defenses around Black's king.",
        "12... Bxd5 13. cxd5 Nb7 14. O-O": "Having castled, my position is now quite a bit better than Black's. I can double up rooks on the c-file and start storming his king.",
        "14... b5 15. Qc2 Rc8 16. Rc1 g5": "Black started a counter-attack on my kingside. I didn't think he'd have enough time to become dangerous, so I didn't worry about it.",
        "17. a4 g4 18. Ne1 h5 19. axb5 axb5 20. Ra7": "The Black knight is lost. The rook on c8 can't come to the defense because c7 would fall.",
        "20... c5 21. Rxb7 Bh6 22. Bxh6": "Not wanting to lose a tempo, I traded down.",
        "22... Rxh6 23. Qa2 h4": "Black's two pawns, queen and rook are getting menacingly close to my king. But my next move will be Qa5+, and what could Black possibly do about MY oncoming attack, right?",
        "24. Qa5+ Ke8 25. Qxb5+ Kf8 26. Rb8 Rxb8 27. Qxb8+ Kg7 28. b5": "28. b5 - in retrospect I consider this a questionable move. Why not play bxc5 instead? The pawn would have a rook behind, my queen could come back to b2 in case she needs to defend. But I don't need to defend, remember? I'm up a minor piece and a pawn, I've chased the Black king across the board, and my b-pawn will queen. I've won.",
        "28... g3": "28...g3, so what? Easy to deal with. I'll play f3, lock his queen out and continue pushing my b-pawn. Black is completely lost, grasping at straws.",
        "29. f3": "This is the move that cost me the game, even though I didn't know it at the time. 29. Rc2 would have been the correct way to defend.",
        "29... gxh2+": "Yeah, sure, trade down a bit. It'll just make the win easier for me. I'll take back with the king and... oh wait. I can't take back with the king because of 30...Qf4+ which wins my rook. Um, okay, I didn't see that one when I played 29. f3. But what's the big deal. I'll put the king in the corner and Black won't get anywhere.",
        "30. Kh1 Qf4": "Black is getting annoying now. Does he not know that I've already won? Let's see, I gotta stop his queen from going to e3 and g1 to defend against mate. Alright, no problem. Put the rook on d1. Once my knight moves out of the way, the rook will be guarding g1. My rook in turn can be guarded by a knight on c3. And I can always bring back the queen. I'm golden.",
        "31. Rd1 h3": "Okay, I've got to start watching out now. g2 is defended by the knight. If Black's queen goes to e3, I'll play Kxh2. But I really need my queen to defend now. Let's bring her back.",
        "32. Qa8 Qe3": "When looking at this position I initially still thought I could defend. I had already won the game earlier, so how could I possibly be facing defeat now? But when looking at all my options it started to dawn on me that no matter what I do, Black will bust my king wide open and mate me.\n\nThe immediate threat is Qg1# of course. And both defensive moves are insufficient.\n\nIf 33. Nc2 hxg2+ 34. Kxg2 Rg6+ and 35. Kf1 Rg1# or 35. Kh3 Qh6#\nIf 33. Kxh2 hxg2+ 34. Kxg2 Rg6+ and Black mates me the same way as above, no matter where I go\n\nWhy did this happen? Mostly because I was in the wrong state of mind. I didn't take my opponent's threats seriously until it was too late. I learned a lot from this game, and hopefully I won't make the same mistakes again."
    },
    "url": "https://gameknot.com/annotation.pl/how-to-lose-a-won-game?gm=29954",
    "gameName": "How to lose a won game",
    "players": "cts001 (1655) vs. paxel10 (1598)",
    "opening": "King's pawn game (C50)"
}