{
    "moves": {
        "1. d4 e6 2. c4 c5": "I don't think I've seen this exact move order before.\n",
        "3. Nf3 Nf6 4. Nc3 cxd4 5. Nxd4 Be7 6. g3": "A key decision. It's either this or 6.e4, turning the game into a Sicilian with a Maroczy bind by transposition. I go for the fianchetto.\n",
        "6... O-O 7. Bg2 Nc6 8. O-O a6 9. b3": "The most common move in the Gameknot and World databases. I had no idea what to play so I listened to them. (Not a good strategy, generally speaking.)\n",
        "9... Bc5 10. Nxc6": "Planning 10...bxc6 11. Bg5, but...\n",
        "10... dxc6": "Black captures away from the center and offers a trade of queens.\n",
        "11. Bf4": "Trying to prevent ...e5, although Black is going to be able to play it if he wants to.\n",
        "11... Bd4 12. Qd2": "Instead of 12.Rc1, I maneuver my queen and rook onto the open file.\n",
        "12... e5 13. Rad1 Qe7": "Releasing the bishop on d4 from the pin (e.g. 13...Bxc3?? 14. Qxd8!)\n",
        "14. Be3 Rd8 15. Qd3": "Wanting to maintain the battery and not sure what else to play, I make this rather pointless move.\n",
        "15... Bg4": "Finally connecting his rooks, so I make the bishop trade.\n",
        "16. Bxd4 exd4 17. Ne4 Nd7": "Clearing the way for ...f5 which would win the e2 pawn with a bishop fork of White's rooks.\n",
        "18. f3 Ne5": "Zwischenzug! ('In between move'--I just felt like saying that)\n",
        "19. Qc2 Bf5": "Now I have to worry about the possibility of a shattered pawn structure.\n",
        "20. h3": "Preparing 21.f4, which if played immediately allows 21...Ng4 and a guaranteed fork on e3.\n",
        "20... Qd7 21. f4 d3 22. exd3 Qd4+": "Black's second straight 'in-between' move! Actually this check must have been the point to 21...d3. I feel like I'm getting pushed around just a little bit, but I always do against higher rated players. I haven't forgotten about his back rank yet, though.\n",
        "23. Nf2": "Shouldn't 23.Kh2 be better here?\n",
        "23... Nxd3 24. Qd2": "Avoiding any discovered attacks and realigning the queen and rook, as Black must continue to watch his back rank.\n",
        "24... Qb6 25. Kh2": "Un-pinning the Nf2 and now Black's Nd4 is in trouble.\n",
        "25... Nb4": "This move doesn't particularly help the knight avoid its fate. It puts the a2 pawn on notice, but perhaps 25...Nc5 is better.\n",
        "26. Qe2 Rde8 27. Qd2 Rad8": "I remember going through the entire sequence starting with 25.Kh2 as a possible variation here. Black thinks he has centralized his rooks by kicking the queen around, but the back rank threats still loom.\n",
        "28. Rfe1 h6": "Black sees fit to finally give his king luft. 28...Rxe1 and 28...Rxd2 both fail to back rank mates! After mostly reacting to Black, at this point I feel like I have an initiative. But how to use it?\n",
        "29. Rxe8+ Rxe8 30. g4 Bh7": "Black wants to keep as many squares for his knight as possible, but this allows the bishop to be shut in with f4-f5, and, for what it's worth, reintroduces back rank ideas for White. Anyway, I was expecting 30...Bc2.\n",
        "31. a3 Nc2 32. f5 Ne3 33. Re1 Qxb3 34. Nd1 Qxa3": "The knight is lost, but Black gets to gobble up a couple pawns and obtain the first passed pawn of the game. This is important later.\n",
        "35. Rxe3 Rxe3 36. Qd8+": "Getting the queens off the board while ahead in material. While generally advisable, I considered whether I really wanted to do so in this situation, but ultimately plowed ahead.\n",
        "36... Qf8 37. Qxf8+ Kxf8 38. Nxe3": "So this is a pretty complicated endgame. Both of us screw it up.\n",
        "38... g6 39. c5": "Freezing Black's b-pawn.\n",
        "39... a5 40. Bf1": "The plan here is to meet an eventual ...f6 with Bc4.\n",
        "40... gxf5 41. Nxf5 Bxf5": "But instead, Black exchanges his last piece. While that's generally inadvisable, the particulars of the position make it hard for White to exploit. Especially since this is me controlling the white forces.\n",
        "42. gxf5 Ke7": "Now, I obviously have to protect the f-pawn right? I only have three pawns left and they are all weak. I need as many chances to promote as possible. And yet...\n",
        "43. Bc4": "A stupid move. For some reason, playing around on the analysis board I thought it would be more difficult to win with the f-pawns on the board.\n",
        "43... Kf6 44. Kg3 Kxf5 45. Bxf7 Ke5": "Black goes for the c-pawn to free his queenside pawns, but abandons his h-pawn. He needs to stay in the vicinity of the h-pawn. White can't exactly make progress if Black does that, but now White regains the advantage.\n",
        "46. Kg4 Kd4 47. Kh5 Kxc5 48. Kxh6 Kb4 49. Kg5 c5": "But I see what Black is doing with this move, I completely panic. The c-pawn is running interference for the a-pawn. The right thing to do, is...well, it's not TOO hard to figure out.\n",
        "50. Kf4": "Clearly I must get my king in the area of his pawns! And look how far his king is from my pawn still! Actually, this move blows the advantage. 'Pushing the passed pawn' is the correct play. And when Black plays ...c4, Bxc4 is the correct reply as White is going to win the queening race and even control Black's queening square while doing so. But now Black's king is fully capable of getting back to the h-pawn if needed.\n",
        "50... c4 51. Ke3 a4 52. Kd2": "I offered a draw, which was accepted. Strangely, the GK computer changes its assessment of the position from +1.05 for White to -8.23 with 52.Kd2, but since it's the last move of the game, there's no explanation. Did White really go from a win to a loss in two moves, or is the computer being wacky? (What is clear even to me is White's best case scenario is now a 'bishop and wrong rook pawn' ending.) As for the rest of the computer analysis, it finds the play on both sides rather sharp through move 20, and declares the rest of the game pretty much a mess of errors. The computer's analysis is at http://gameknot.com/analyze-board.pl?bd=21568775&rnd=0.8942676745355129\n"
    },
    "url": "https://gameknot.com/annotation.pl/how-to-blow-an-endgame?gm=55469",
    "gameName": "How to Blow an Endgame",
    "players": "hscer (1745) vs. aussiem (1876)",
    "opening": "Queen's pawn (A40), Keres defence"
}