{
    "moves": {
        "1. e4": "I wanted to play a classical opening, something computers are excellent at dealing with. ",
        "1... e5 2. Nf3 Nf6": "We begin with a Russian Opening. Excalibur seems to love countering e4 with this.",
        "3. Nxe5": "My response is the most logical, the e-pawns are exchanged, and both sides have playable positions.",
        "3... d6 4. Nf3 Nxe4 5. d4 d5": "Here we see how Black decides to entrench the knight on e4, a key feature of the classical Russian. ",
        "6. Bd3": "This line already offers the potential to follow the path of the game Browne-Bisguier (US Champ. 1974) whereby Browne played the aesthetic and amazing 14.Bh6!... In response the line stemming from 6...Be7. If you haven't seen this game, please research it - it's an amazing demonstration of chess skill.",
        "6... Bd6": "Black pursues the most common line, and shoots at my kingside. The bishop also compromises f4, and controls several queenside sqaures. 6...Be7 would follow the Browne-Bisguier line.",
        "7. O-O": "Although the best line, you can't help but feel a little uncomfortable with a bishop and an active knight crawling nereby the kingside.",
        "7... O-O": "Black replies in kind. However, it should be noted that as Black's dark-squared bishop attacks h2, My light-squared bishop attacks h7 in an 'x-ray' attack through the knight.",
        "8. c4": "My prediction is a swap-off on c4 (in the future when Black either solidifies or saves the e4-knight) due to Excalibur's - and indeed several computers - tendency to create isolated pawns. Nonetheless, this move undermines Black's knight's defender.",
        "8... Be6": "Black deviates from the main line, as computers do. More common and preferred here is the Marshall trap - ( 8...Bg4 9. cxd5 f5 10. Re1 Bxh2+) which is seen as hugely powerful for Black, but still advantageous in some positional aspects for White.",
        "9. Re1": "Continuing to pressure Black's naturally advanced yet fragile Russian centre.",
        "9... Bb4": "Black starts the fun. Playing 10. Re2... would compromise position, and one variation leads to the loss of the d-pawn (10. Nbd2 Bxd2 11. Bxd2 Nxd2 12. Nxd2 dxc4 13. [B/N]xc4 Qxd4 -/+) leaving Black with a material bonus. In my opinion, this move lays out a dwonfall for Black positionally. 9...f5 looked more tantalising, and the e4-knight would have held under it.",
        "10. cxd5": "I choose on complicating matters, and attacking two minor pieces in exchange for a rook appears positive given my central minor-piece positioning.",
        "10... Nxf2 11. Kxf2 Bxe1+ 12. Kxe1": "Recapturing with the king is superior than 12. Qxe1... which would cause the queen to be displaced soon enough by a Black rook on e8. Also, recapturing with the f3-knight would essentially 'undevelop' the piece, and open up the king drastically.",
        "12... Bxd5": "At the end of the exchange, I have given a rook and a pawn for a knight and a bishop. This exchange is usually beneficial, since two minor pieces should in theory control more squares than a rook, and are also more manoeuvreable. \n    Secondly, Black threatens material gain with 13...Bxf3 followed by 14...Qxd4. However, an exchange on f3 would leave me with several far-reaching pieces in the centre of the board, attacking at both the kingside and queenside.",
        "13. Be3": "Development of the bishop not only defends the vulnerable d4-pawn, but also continues to aim at the kingside. ",
        "13... Re8": "A wise move on Black's part. Since Black has no viable central pawns to advance, he makes the most of the open d+e files and attacks down them. The rook move renders the e3-bishop useless. Whilst I attack from the centre, Black fires upon me from afar. ",
        "14. Kf2": "Oddly enough, I would count this as a development move. My king can't waste time to escape behing the g + h pawns, so I make the most of him. He holds the centre together.",
        "14... Bxf3 15. Qxf3": "Black completes my vision of three long-ranged pieces, with potential across the board. The centre is under my command, with the exception of the d5-sqaure which is attacked by both queens. Potential targets are b7, f7 and h7, all potentially realised by my three pieces.",
        "15... Qh4+": "Black scrambles for position, and develops his queen to an active post.",
        "16. Kf1": "16. Kg1?... would lead to 16...Qe1+ and a forsaken piece on e3, costing the game. However, If Black plays the poor 16...Qxh2? , it results in 17. Qxb7... and if 17...Rxe3?? , 18. Qc8+... wins the game. Black has improved, but not as much as you might think.",
        "16... Qe7": "Black forms a much stronger battery, and the forcing of my king to f1 leaves the e3-bishop weak. If I move my king to f2, a perpetual check is an option for Black - not the worst option for the computer considering my positional potential. If I played 17. Kd2... the e3-bishop would be rendered useless, and Black would gain an advantage.",
        "17. Bd2": "I chose this over 17. Bf2... becuase it is more active, and still aims at the kingside. Also, I have deduced that since I can soon develop the knight, the rook will defend e1 adequately, and my pieces can return on the positional advantage. ",
        "17... c6": "Black finally stakes a pawn in the centre. He has seized control of the d5-square, occupiable by his knight. Also, he has eliminated the potency of my queen across the a8-h1 diagonal. In return however, I can release my rook and develop my knight. This has implications of Re1. Furthermore, if Black's knight chooses the d7-square, its range is limited by my d4-pawn.",
        "18. Nc3 Nd7": "Both knights are now developed, but you will notice that they are both restrained by the other's opposing pawns.",
        "19. Ne4": "My intentions are to to stump Black's battery on the e-file, now quelled. Another bonus of this move is that I can now occupy c3 with my d2-bishop, further threatening the Black king's position. One potential sequence is to move my queen to g3, and the dark-squared bishop to h6, tearing the king open.",
        "19... b5": "(?!) An interesting if dubious move. Black ignores my central knight, and pursues a queenside push. He does succeed in limiting my d3-bishop however, and 20. Bc3... is now impossible due to 20...b4 with a good infiltration on Black's part.",
        "20. Qh3": "My first real 'danger' move. Black should take notice.",
        "20... a5": "(?) In my opinion, this was one 'free' move too far. Black disregards the urgency on his kingside, with four pieces ready to strike. In terms of attack on my part, 21.Nf6+...is clever but purely aesthetic, as 21...Nxf6 clears the attack and ruins any potential for further threats. Another favourable move is 21. Ng5... but this doesn't force an openong on the king.",
        "21. Nd6": "(!) The key move of the game. After spending 25 minutes thinking over the posistion (attack is not my forte, and I rarely am able to pull them off against computers!), I came to this move. I calculated these variations - \nV1 - 21...Qxd6 22.Qxh7+ Kf8 23.Qh8+ Ke7 (V1i- 24.Bg5+...) V1ia- [24...Nf6 25.Qxg7 +/-], V1ib- [24...f6 25.Rxe8+ +/-], V1ic- [24...Ke6] and Black can't hold off 25.Re1+ +/-.\n(V1ii- 24.Re1+...) V1iia- [24...Nd5 25.Rxd5+ +/-], V1iib- [24...Kf6 25.Rxd8 +/-], V1iic- [25...Kd8 26.Rxd8 +/-]\nV2 - 21...Nf6, V2a [22.Bg5+ Qxd6 23.Bxf6 Qxf6+ -/+], V2b- [22.Nxe8 +/-]\nThis analysis was painstaking, but it proved successful. ",
        "21... Qxd6 22. Qxh7+ Kf8 23. Qh8+ Ke7 24. Re1+ Ne5": "Black gives back the material. If worse comes to worse, I will have two bishops for a rook (meaning I gained a pawn back, and am left with two bishops rather than a bishop and knight) - a VERY playable middlegame and endgame. This move is the only one available to Black that doesn't spell total disaster - materially, but still doesn't remove my tempo.",
        "25. Rxe5+ Qxe5": "(!?) Black plays an interesting move. Although the transition signifies a poor endgame position for Black, it does force me to enter with an isolated central pawn.",
        "26. Qxe8+": "The only response that will do.",
        "26... Rxe8 27. dxe5": "My advanced position and two bishops for a rook are all plusses in this game.",
        "27... Rh8 28. h3 Rh5": "Black is willing to trade a flank pawn for my isolated central pawn, a positionally good move since it temporarily banishes my bishop to the side of the board, but in my opinion, is not good enough to salvage the negatives.",
        "29. Bxa5 Rxe5 30. Kf2": "My goal is to advance and press the Black position backwards. the advantage of two bishops is that if Black tries to obstruct one of them with pawns, the other triumphs. Also, note how crucial squares for Black's rook such as c2, e2 and f5 are controlled by my light-squared bishop.",
        "30... Kd6": "Black tries to game central prowess.",
        "31. Bc3": "Now the centre is fully mine. Black's g7-pawn is skewered by the c3-bishop.",
        "31... Rg5": "Although this is the only move to avoid instant material loss, Black will now feel the strangling effects of my dominant advancing position.",
        "32. Kf3 Rd5": "A last-ditch attempt to gain power, in some ways a  mistake. 32...Rh5 would have provided an escape route for the rook. Instead, he is now stranded in the centre.",
        "33. Be4": "Note how the crucial squares on the d+e files are patrolled by my bishops.",
        "33... Rg5 34. g4": "Black's rook is now stuck fast. After 35. h4... Black is forced to 35...Rc5 with 36. Bb4... +/- sealing the game.",
        "34... f6": "At the very least, Black stumps one of my bishops.",
        "35. h4 Rc5 36. Bb4": "Now Black will endure suffering. You may have thought that Excalibur would resign by now....... but that is one defect with the model I use - it NEVER resigns. Nonetheless, this does mean my endgame skills are always tested!",
        "36... g6": "My position has slowly creeped up the board, and Black cannot retreat efficiently. It's last move is a testament to chess computers. Most chess engines start to throw material away in desperate attempts to break a position open. In this case, it lures my bishop to free d5 for the Black king.",
        "37. Bxg6 Kd5 38. Bxc5": "And now Black loses.",
        "38... Kxc5 39. h5": "My h-pawn can waltz home.",
        "39... Kd6 40. h6 f5": "Another aesthetic if useless move, Black tries to divert attention.",
        "41. gxf5 c5 42. h7 c4 43. h8=Q Kc5 44. a3": "Cuts off a sneaky escape path.",
        "44... Kd5 45. Bf7+ Kc6 46. Qf6+ Kb7 47. Bd5+ Kc7 48. Qc6+ Kd8 49. f6": "Black is trapped in a bubble.",
        "49... b4 50. Be6 bxa3 51. Qd7#": "This game was won  by the moves lasting from 19-24. We see how Black (a computer!) doesn't heed the dangers of my kingside rally. To defend properly, Black should have staked central pawns, perhaps on f5 or c5 to challenge my centre. Also, the computer should have realised that 9...Bb4 didn't improve development or position, and materially it proved malevolent towards Black itself. My advice would be 9...f5, a more attritional yet effective tactic.\n   I hope you enjoyed this game!"
    },
    "url": "https://gameknot.com/annotation.pl/human-v-computer-game-3?gm=55211",
    "gameName": "Human V Computer Game 3",
    "players": "Honza88888 (1505) vs. Excalibur(Level70) (???)",
    "opening": "Petrov (C42), classical attack, Tarrasch variation"
}