{
    "moves": {
        "1. e4": "This game was played on Yahoo Chess; Ax2kool being me and a4det2008 being white. ",
        "1... e5": "I choose to play a open game. ",
        "2. Nc3": "Okay, I wasn't so familiar with this line. I had no clue what to do. I know...I have been playing against Nf3 a lot :$. ",
        "2... Nf6": "I chose to do what looked logical to me",
        "3. h3": "Seems like white wants to restrict black knights movements but this move i think i premature. ",
        "3... d5": "Idea of centralizing my knight",
        "4. exd5 Nxd5 5. Nxd5": "? I did not understand this. Now, I have a tempo to bring my Queen out and develop faster than white. ",
        "5... Qxd5 6. c4": "Trying to attack my queen, I did not know this opening, so i chose to play what looked logical. ",
        "6... Qe4+ 7. Ne2": "Not Be7 because Qxg2. But Qe2 would have been the best and given white the tempo. ",
        "7... Nc6 8. f3": "hmm after this move, i directly looked at g3 square. I hoped to utilize it somehow after i displace the knight somehow. ",
        "8... Qg6": "This move was done because after Nb4, there is no defence against Nc2",
        "9. a3": "Naturally he saw that, but did he see the threat on g3?",
        "9... Bf5": "I continue to threathen the c2 square",
        "10. d3": "This move allows me to amplify my attacks all the more",
        "10... O-O-O": "! Now I have three pieces aiming d3 pawn",
        "11. Nc3": "? This move leaves g3 square unguarded. Thank you very much.",
        "11... Qg3+": "I use the square. ",
        "12. Kd2": "Forced. ",
        "12... Qf2+": "! Not taking the pawn right away because the bishop is guarding it. ",
        "13. Ne2": "Qe2 helps white live a little bit longer",
        "13... Rxd3+": "obvious continuation",
        "14. Kc2 Re3+": "Rxd1 would give white a definite advantage but I thought of finishing the game instead. ",
        "15. Kd2": "Forced",
        "15... Bb4+": "! Sacrifice of the bishop, white must take, there is no alternative",
        "16. axb4 Rd8#": "!! There are 7 squares between the rook and the stranded king! I had 3 seconds left on the clock when i made this move. "
    },
    "url": "https://gameknot.com/annotation.pl/yahoo-chess?gm=20756",
    "gameName": "Yahoo Chess",
    "players": " a4d4et2008  vs. ax2kool ",
    "opening": "Vienna (C26), Falkbeer variation"
}