{
    "moves": {
        "1. d4": "An unusual opening leads to approximate opening equality, but Black gets an edge in the middlegame when White fails to fix his defects efficiently and wins late as a direct result of early issues.",
        "1... e5 2. dxe5": "The Englund Gambit Accepted.  White could have \"opted out\" with 2.e4 with a counter gambit offer (The Danish/Goring/Scotch Gambit complex).  Interesting also is 2.d5.",
        "2... Nc6": "Black's options include 2...f6 and 2...d6.  The latter can transpose to a gambit line of Black's in the Philidor.  The Englund Gambit coplex is actually three or four different gambits.  The Soller (2...f6), the Englund (2...Nc6), the Hartlaub (2...d6) and the Blackburne which arises out of the Hartlaub.  I have also experimented with 2...Bc5, then 3...Qe7 and perhaps 4...Nc6, but this is sometimes cumbersome against best play by White and definitely difficult to play under such circumstances.  If white hesitates however...",
        "3. Nf3": "If White wants to test Black, then a different third move is probably needed.  A favorite is 3.Qd5.",
        "3... Qe7 4. e3 Nxe5 5. Nxe5 Qxe5 6. Nc3": "Maybe 6.c4 is better?",
        "6... Bb4 7. Bd2": "Wisely unpinning the Queen's Knight immediately before Black can build any significant pressure.",
        "7... Nf6 8. Bd3 d5 9. O-O O-O": "The opening is pretty much over and in taking stock we see Black has a healthy bit of the center and a Queen that might be attacked while White is solid and ready to push e3-e4. If White gets the e4 push in soon the Black Queen may need to take time to move to a safe square.  Dynamic equality? ",
        "10. a3 Bd6": "Initially 10.a3 moves Black's Bishop to a very threatening position.  Which is not particularly strong as White easily parries the mating threat. Most likely the Black Bishop is going to eventually need to re-position so maybe 10.g3 to counter the expected ...Bd6 is convincing? A different plan with Re1 and e4 is in order too.  I suspect 10. a3 is to help implement e3-e4.",
        "11. f4": "Black loses a tempo now, but White has weaknesses to attack.  Question is do you think the position at 9....0-0 or 11...Qe6 is easier for White?",
        "11... Qe6 12. f5": "An interesting solution!",
        "12... Qe5": "Maybe 11.g3 (or even 10.g3) was better since White now ends up playing it to stop another mating threat? Seems like it is always easier to see stuff after the fact.",
        "13. g3 Ne4": "Dreaming of ...Nxg3 sacks....",
        "14. Bxe4": "Apparently White was also dreaming of knight to g3 sacrifices!  White makes certain all I can do is dream about those sacks. I expected 14. Bxe4 however.  White's pawn structure will soon be inferior to Black's. Depending on your viewpoint you might say the same situation existed at move 8.",
        "14... dxe4 15. Qg4 g6 16. Nxe4": "White wins a pawn...",
        "16... Bxf5": "For a second...",
        "17. Rxf5": "Exchange sacrifice!",
        "17... Qxf5 18. Qh4": "Now 18.Qxf5 gxf5 19.Nxd6 cxd6 gives Black a bad pawn structure too.  I do not think it would matter however since the two Rooks will probably be better than the Rook and Bishop in this position.",
        "18... Be5": "Stopping the Nf6+ right away.  Maybe the b2 pawn can soon become lunch...",
        "19. Rf1": "Now 19.Ng5 does not seem convincing to me. The game move seems best for White.",
        "19... Qd7 20. Bc3 Bxc3 21. bxc3 f5": "Again trying to keep the Knight off f6.",
        "22. Nf6+": "Obviously I did not do so, but at least now the Nf6+ is not as unfavorable for Black.",
        "22... Rxf6": "One exchange sacrifice deserves another!",
        "23. Qxf6 Qf7 24. Qd4": "Dynamic equality again?  Not quite this time.  Black still has the better pawns, but a better pawn structure does not confer much as far as winning a game at this point. The weakened pawns do however give Black a target and an ability to formulate clear plans against those targets.  I think I would have traded Queens if I was White.  There would be less in the way of pieces to work against the weaker pawn structure.  The White King and Rook should then be able to hold the draw.",
        "24... b6 25. e4 c5 26. Qd5 Qxd5 27. exd5": "I will argue the earlier Queen (the road not taken) trade would have left an easier to defend pawn structure for White.",
        "27... Rd8 28. c4": "The option was 28.Rd1.  Maybe this was better? My hunch is to say affirmative. Hard to say.  For example 28.Rd1 Re8 29.Kf2 b5 still leaves White with some problems to solve.",
        "28... Re8 29. Kf2 Re4": "It was going to be hard to defend the c4 pawn after Black gained control of the e-file.  Obviously contesting that control is important to White's survival.  At this point it is too late and White needs to conjure up a dynamic reply.",
        "30. Re1 Rxc4 31. Rd1": "Maybe 30.Rd1 was better? White is unable to defend the c2 pawn now. The pawn structure is going from bad to gone.  After 30.Rd1 White could defend c2 although his position would be fast becoming very non-dynamic.  Lacking dynamic counterplay when down material is not a good thing! ",
        "31... Rxc2+ 32. Ke3 Kf8": "The idea is to stop White's only winning chance right away...the supported d5 passer.",
        "33. d6 Ke8 34. h4 Rc4": "White should try to avoid the Rook trade!",
        "35. Rd5 Kd7 36. Rd3 Rd4 37. Rxd4 cxd4+ 38. Kxd4 Kxd6": "Game over.... a passed pawn on both sides means White can not stop Black from advancing to Queendom on at least one side of the board!",
        "39. Kc4 a6": "Again, the defects in my opponent's position allow me to formulate clear and effective plans to further irritate the sore spots.",
        "40. a4 h5 41. Kd4 b5 42. axb5 axb5 43. Kc3 Kc5 44. Kb3 b4 45. Kb2 Kc4 46. Kc2 b3+ 47. Kb2 Kb4 48. Kb1 Kc3 49. Kc1 b2+ 50. Kb1 Kd3": "The loyal Queenside pawns complete their mission by sacrificing for the greater good.",
        "51. Kxb2 Ke3 52. Kc2 Kf3 53. Kd2 Kxg3 54. Ke2 Kxh4 55. Kf3 g5": "Resigning would be the best move, but perhaps a stalemate is possible.... You can not get a draw by giving up!",
        "56. Kg2 Kg4 57. Kh2 Kf3 58. Kg1 h4 59. Kh2 g4 60. Kg1 g3 61. Kh1 h3 62. Kg1 Ke2 63. Kh1 f4 64. Kg1 f3 65. Kh1": "The stalemate is not likely. ",
        "65... Ke1 66. Kg1 f2+ 67. Kh1 g2+": "The only constant was White's inferior pawn structure and Black's ability to keep the problem at the forefront.  If White's game is to be improved most likely the first goal would be to avoid the bad structure or at least efficiently correct the issues as soon as possible."
    },
    "url": "https://gameknot.com/annotation.pl/yasur-3?gm=53639",
    "gameName": "yasur 3",
    "players": "negoflor (1463) vs. a50tango (1578)",
    "opening": "Queen's pawn (A40), Englund gambit"
}