{
    "moves": {
        "1. d4": "Primera Victoria sobre Torres.",
        "1... e5": "El Gambito Grunfeld.\n\nLa mayoría de partidas que hemos jugado Torres y yo se inician con el peón de Rey (e4), pero aquí Torres inició con el peón de Reina... una salida muy común en torneos y que requiere conocer muy bien los primeros pasos de respuesta, que empiezan casi siempre por sacar el caballo de rey a Cf6...\n\n... lo que no se suele hacer es lo que hice yo, sacar el peón de Rey desprotegido. Pensé que Torres se conocía muy bien la otra salida y opté por hacer una salida poco estandar y no recogida en grandes partidas.",
        "2. dxe5": "El blanco se lleva un peón fácil... pero por contra su peón queda muy adelantado y desprotegido. Pensé que atacarlo le obligaría a concentrarse en defenderlo y podría desproteger los flancos.",
        "2... Nc6 3. Nf3 Qe7": "Sacar la dama a pasear no es lo más recomendado nunca... para él, lo mejor sería sacar la dama a Dd5... pero eso va en contra del principio de tener la dama protegida hasta que acabe la apertura.",
        "4. Bf4": "... la maniobra más lógica es esta, sacar el álfil a defender el peón. Un peón de más, 2 piezas desarrolladas por una sola del negro y además éste a sacado la Dama, pero...",
        "4... Qb4+": "Este golpe es importante. Recien levantado de la cama, un jaque que amenaza además el álfil de f4 y el peón de b2, con una amenaza velada a la torre de a1.",
        "5. Bd2": "Lo más lógico parece salvar el álfil a cambio de perder un peón. De todas maneras la reina negra puede meterse en un atolladero de difícil salida.",
        "5... Qxb2": "Peón recuperado, amenaza a la Torre y amenaza de llevarse el peón de e5 doblemente amenazado.",
        "6. Bc3": "Hay 2 opciones para defender la Torre. Sacar el Caballo a Cc3 o mover el álfil Ac3 y amenazar la dama. Parece más agresiva esta jugada, pues obliga a la dama a alejarse del terreno enemigo, pero...",
        "6... Bb4": "El golpe de gracia. El álfil negro en Ab4 inmoviliza al álfil blanco.",
        "7. Qd2": "Para defender la torre:\nA) o se saca el caballo, con lo que se pierde un álfil 7. Cc3 Dxc3\nB) se puede desbloquear el álfil tapando con el caballo de f3 -> 7. Cfd2 Axc3, con lo que se acaba perdiendo también 1 pieza\nC) se saca la dama a d2, con lo cual todas las piezas quedan defendidas.\n\nC) parece la mejor opción y es la que Torres tomó, pero...",
        "7... Bxc3": "Ahora si come con el caballo, pierde la torre y otro peón, el de a2. Y si come con la dama es JaqueMate...\n\n... a Torres no le debió gustar la situación en la que quedaba, así que se rindió.\n\nVictoria Relámpago, Blitzkrieg!"
    },
    "url": "https://gameknot.com/annotation.pl/yo-tb-quiero-plegar-a-las-3?gm=31627",
    "gameName": "Yo tb quiero plegar a las 3!!!",
    "players": "charlycec (1408) vs. kandahar (1214)",
    "opening": "Queen's pawn (A40), Englund gambit"
}