{
    "moves": {
        "1. e4 e5 2. d4 exd4 3. c3 dxc3 4. Nxc3 Bb4 5. Bc4 Nf6 6. Bxf7+": "?! - an ambiguous sacrifice. Black loses his castling rights, and if 6...Kxf7 7 Qb3+ regains the piece. ",
        "6... Kf8": "Preferably taking the piece would have been better - 6...Kxf7 7 Qb3+ d5 8. Qxb4 Nxe4 9. Re8 and Black has a good game.",
        "7. Bd5 Qe7 8. Bg5": "White is going all out and trying to see how long it takes for Black to crack under the pressure. Maybe 8. Nge2, completing developing and castling, before launching this attack.",
        "8... Qc5": "even c6, driving the bishop, is better",
        "9. Bxf6 gxf6 10. Qh5": "?! - such a risk - White is hoping for 10...Bxc3+ 11. bxc3 Qxc3+ 12. Ke2 Qxa1?? 13. Qf7#. ",
        "10... Bxc3+ 11. bxc3 Qxc3+ 12. Ke2 Ke7": "Quite. ",
        "13. Qf7+ Kd8 14. Rc1": "?! - Another decoy! This time the threat is 14...Qxc1?? 15. Qxf6+ Ke8 16. Bf7+ Kf8 17. Bg6+ Kg8 18. Qf7#.\n\nRd1 is probably safer.\n",
        "14... Qb2+ 15. Kf3 c6 16. Nh3": "White starts to go offtrack. Bring the bishop back with 16. Bb3 still keeps deadly threats whilst keeping the deficit to a minimum. ",
        "16... cxd5 17. exd5 Qa3+ 18. Kg4 d6+": "Ruh Roh...Black himself makes a huge error that could give White a huge advantage, but unfortunately, White immediately crumbles. 18...Qf8! keeps Black's advantage - White would be a piece down and would have to trade queens to avoid being mated.",
        "19. Kf4": "(??) - White makes a bad error. He should have played 19. Kh4! and Black is faced with his problems, including Qxf6+, Qe6 and Rxc8#. He would give up the knight and in the long run, would be a rook down - White would have a big advantage. ",
        "19... Qa4+ 20. Kg3": "(??) White now loses. He should have played 20. Kf3. In the resulting analysis, he would have to give up his queen, but his first blunder made his position hopeless.",
        "20... Qg4#": ""
    },
    "url": "https://gameknot.com/annotation.pl/sacrifices-king-hunts-and-king-walks?gm=53901",
    "gameName": "Sacrifices, King Hunts and King Walks",
    "players": "moistcomrade (1502) vs. gokmen (1461)",
    "opening": "Danish gambit (C21), Collijn defence"
}