{
    "moves": {
        "1. h3": "If you see the possibility of making a good play by sacrificing a rook against  a minor piece, then if you see that your plan can be stopped by  certain choice but that if you can sacrifice another rook then you can go with your plan which is nevertheless actually obscure at its end,  what will you choose ? You will tell me when we reach the critical position in this game. As for me, I take the risk whenever I understand that I am playing against a player who is much more able to see beyond what I can see ( Black : 1800 White : 1600) and that my only hope is try push the game beyond our both visibility fields.",
        "1... e5 2. a3": "The Potato Opening. Refer to these games that was also played with the same strategy :\nTotal Attack following a Potato Opening (http://gameknot.com/annotation.pl/total-attack-following-a-potato-opening.pl?gm=23743)\nAttack Plan (http://gameknot.com/annotation.pl/attack-plan.pl?gm=23712)\nMy first annotated game (http://gameknot.com/annotation.pl/my-first-annotated-game.pl?gm=23489)\n\n",
        "2... d5 3. e3 Nf6 4. d4 e4 5. c4 c6 6. cxd5 cxd5 7. Bb5+ Bd7 8. Bxd7+": "Exchanging the bishop is a rule in this opening, in order to rapidly castle and reclaim the center development.",
        "8... Nbxd7 9. Nc3 Be7 10. Nge2 O-O 11. O-O Bd6 12. Bd2": "I would automatically choose f3 here. But due to recent Blitz games I am now having the habit of preparing the Bc1 to rapidly enter the king-side zone whenever Black chooses to attack taking advantage of the e4 support position.",
        "12... a6 13. Qb3 Nb6 14. Nd1": "Would you be able to guess my plan here ? Pinning Nb6 or hope to win d5 after Nc3 and that B takes b6 ? Why not if Black plays bad. But this is not it. Nd1 is there to protect e3 and b2 after Nc4 and enables the queen to go to d3 after f3 if Black takes the pawn.",
        "14... Nc4 15. Be1 Qd7 16. Nec3": "A change of plan ! Let's secure ourselves from Rf8, place the queen at c2 and be prepared for Qe2 whatsoever be the outcome of f3.",
        "16... Rfc8 17. Qc2 b5 18. f3 exf3 19. Rxf3 Qc6": "Now we reached our position. Try take your moment in analyzing White choices.\nDo you see e7 ? Waw ! what an ideal position for our Nc3 if it manages to go there through d5. How can we travel that distance if we are not going to do that at the cost of time ! So we need to gain time. How's that ? Material. Let us gain time by losing material then invest time to get to that space. Nevertheless it is still not obvious : 20. Rxf6 gxf6 21. Qf5 threatening Nxd5.\nIf Nxd5 then f6 will be won with a check. h6 also is in hand. White is unable to go to  d7 lacking a defending piece and if B retreats to f8 then White mates with Nxf6+ followed by Qxh6#. \nUnfortunately, Nb6 changes all this since it protects d5 and d7. But another way to go to f6 by the Knight is through e4 which is protected by d5. However this can be possible if Ne4 discovers Rc1 attacking the queen. So let's prepare it.\n\n",
        "20. Rc1 a5": "Now we will sacrifice the rook f3, Queen goes to f5, Blacks would naturally choice Nb6, then we play Ne4 which sacrifices the rook c1. But then the outcome is not very obvious. after Nxf6+ Blacks would choose Kf8. Because of the depth of this we can suppose, that independently of White's choices to play Nh7+ or Qg8+ Black may choose to get his king out of that side into the queen-side through e7 d8 and c8, then White loses because after the material loss, the only hope is with a mate or a forced draw. It was really unclear. And I had to find solution to the e7-d8-c8 escape path before any decision to play Rxf6. Bh4 entering the battlefield looked promising but the queen c1 is really a problem. Bh6 closes the path for Black's king and even when Black's king reaches d8, Nf6=>d5 is a discovered check that will brings it back since the Nd5 also closes c7. I connected three time and in the third I noticed Qg4 which protects d1 from blacks queen, allows for Bh6. Moreover Black's position is somehow static : It was not obvious how Black could invest the time White would spend on Qg4 and Bh6. So the conclusion is Rxf6 !?",
        "21. Rxf6 gxf6 22. Qf5 Nb6": "As expected. Now as the king-side position got simplified, I tried to see if there is any attack alternative to Ne4 (like Bh5) that is less expensive in term of material.",
        "23. Ne4 Qxc1 24. Nxf6+ Kf8": "Not that if Qg7 then I would force it to f8 by Qg5 then Q go to g4 as planned.",
        "25. Qg4 Be7": "I connected to the internet expecting Qc2 or h5 then Qc2 and in both Qd3 after I close the diagonal through e4. Too bad for the game. For a moment I suspected my opponent of playing this move deliberately so to make the game ugly. And yes, it is ugly.",
        "26. Qg8#": ""
    },
    "url": "https://gameknot.com/annotation.pl/sacrificing-two-rooks-and-winning-the-game?gm=23934",
    "gameName": "Sacrificing Two Rooks and winning the game",
    "players": "potatosoftware (1656) vs. morandini (1822)",
    "opening": "Global opening (A00)"
}