{
    "moves": {
        "1. d4 d5 2. c4": "The Queen's gambit. I hate playing against this, as it usually gives an obvious spacial advantage to White early on.\n",
        "2... dxc4": "The Queen's gambit accepted. I could try, sometime, Nf6 or e6 instead or even (this is looking at the DB) e5, which could lead to some interesting play\n",
        "3. e4": "immediatly gaining control of the centre - the point of the Queen's Gambit\n",
        "3... Nc6": "developing, and possibly preparing e5 to challenge the centre.\n",
        "4. Be3": "I didn't get this move from White at first, but it was actually good foresight from White which stops e5 from being as effective as it could be...\n",
        "4... Nf6": "developing with a threat to the e-pawn. Not a big problem...\n",
        "5. Nc3": "since it's easily defended. White also develops a piece of his own (which makes the move superior to alternatives such as f3, and Qc2 wins a pawn after Nxd4)\n",
        "5... e5": "Black's only centre pawn strikes at the centre, hoping to loosen White's centre control\n",
        "6. d5": "White wants none of that, of course, and this move keeps the centre as well as chasing away the knight. White couls have tried taking the pawn as well, which would result in White's rook occupying the d-file (6.dxe5 Nxe5 7.Qxd8+ Kxd8 8.0-0-0+, or 6.dxe5 Qxd1+ 7.Rxd1 Nxe5... though it also involves the knight protecting the pawn on c4, which could hinder the white bishop's development)\n",
        "6... Ne7": "it seemed to be the only logical move for me here - Nd4 loses a pawn (7.Bxd4 [justifying White's fourth move] 7...exd4 8.Qxd4), Na5 isn't a good square for the knight (though it is safe there) and Nb4 is the worst move here (7.a3 Na6, and the knight's in a horrible position)\n",
        "7. Bxc4": "Now's a good a time as any - White continues his rapid development while regaining material. White has the upper hand here\n",
        "7... Ng6": "One of the things I like about Black's position here is that his bishops are in no way restricted, so it will be easy to develop them\n",
        "8. Nf3": "This move pretty much leaves the DB (save one game, which ended in a draw)\n",
        "8... Bg4": "A waste of a move [well, in this game it was], as White can easily drive the bishop back with tempo. It did seem natural at the time - this pin happens all the time in chess games\n",
        "9. h3": "Black can't respond with Bh5 because of 10.g4, which wins material... or can he? I could have tried a knight sac with 9...Bh5 10.g4 Nxg4 11.hxg4 Bxg4, and Black wins the knight after 12...Qf6\n",
        "9... Bd7": "Luckily for White, I didn't see that in the game, and opted to retreat my bishop instead\n",
        "10. O-O": "White castles kingside, thereby securing his king (for now, at least)\n",
        "10... Bb4": "Of course, there's no pin on the knight here, but nevertheless there's a threat in this move; Black threatens to win a pawn with 11...Bxc3 12.bxc3 Nxe4\n",
        "11. Qd3": "White sees the threat and moves to stop it, while bringing his queen out in the process\n",
        "11... Qe7": "Black does likewise, and now he has a choice of whether to develop kingside or queenside\n",
        "12. Bg5": "The bishop pins the knight to the queen...\n",
        "12... h6": "so I immediately challenge it, forcing the bishop to move again; retreat, or capture?\n",
        "13. Bxf6": "White chooses to capture, but I'd say it benefits Black more than White, as the other knight can now reach the f4 square, which is a good square for the knight\n",
        "13... Qxf6 14. Nb5": "This move is actually pretty powerful. Of course, the immediate threat is Nxc7+, and the immediate reaction would be to take the knight with the bishop, but I don't really like the look of 14...Bxb5 15.Bxb5+ c6 16.dxc6 bxc6 17.Ba4, with the next move being a rook to the d1 square - in that line, White pretty much dominates queenside. I could have moved Qb6, but....\n",
        "14... O-O": "I choose to let the knight have the pawn. I see that after White takes the pawn, I can get in a lot of tempo attacks, improving my position so that it (hopefully) compensates for my lost pawn (actually, taking the pawn should have been a mistake in the game, though I don't take advantage of it)\n",
        "15. Nxc7 Rac8": "Only one place for the knight to go...\n",
        "16. Nb5 a6": "and the knight now has to move even further back!\n",
        "17. Nc3 Nf4": "! now White ought to lose a piece, as the queen cannot keep its defence of the bishop...\n",
        "18. Qe3 Bc5": "? but, I had seen something else, another attack that broke open the defence of the king with a sacrifice. Unfortunately, I was so focused on that that I missed the free piece (and even blocking the path with one of my own pieces!) I guess in other words, I wanted to attack so bad that I missed a chance to attack\n",
        "19. Qd2": "In hindsight, I should have played, first, b5, driving away the bishop (seeing as I foolishly let him live), hoping that the bishop would retreat to the b3 square. You'll see why later...\n",
        "19... Nxg2": "but for now, the sacrifice! :)\n",
        "20. Kxg2 Bxh3+": "This is actually an exchange that gets me back a pawn, as the king was the only piece protecting the knight\n",
        "21. Kxh3 Qxf3+": "and now Black has achieved what he wanted; White's king has been exposed, and his defence stripped (all his pieces are on the wrong side of the board, save the f-rook, who still needs a couple of turns to defend the king)\n",
        "22. Kh2": "Kh4?? g4#\n",
        "22... Bd6": "? What I really wanted to do, here was 22...f5, so that my rook could get into the action against the king (though it turns out f5 would have been bad as well). However, I saw the move 23.d6+, and I was worried about that pawn, which could have been troublesome for Black (was this overcautious thinking?). I played this move so that the d-pawn would be blocked, but the problem is that it gives White a tempo, and as it turns out that a tempo was all White needed to drive Black back (heck, I even forced White to move the right piece, as the rook threatens the bishop) I should have played Qh5+, followed by f5\n",
        "23. Be2": "! This move drives my queen back, and she only has one square to retreat to (this was why f5 would have been bad for Black earlier, as if this move had been played in that situation would force a queen trade; 22...f5? 23.Be2! Qf4+ 24.Qxf4 exf4, which also doubles up my pawns... though they are supposedly powerful when advanced - I'm unclear with that concept)\n",
        "23... Qf6": "Black is forced to block the f-pawn, making it all the more difficult to get my pieces into the attack\n",
        "24. Qe3": "White needed only two moves to rush to his king's defence, and now my sac seems to have been for nothing...\n",
        "24... Qh4+": "nevertheless, I wasn't going to give up on my attack just yet! This tempo check allows me to test out my strategy of f5\n",
        "25. Kg2 f5 26. Rfh1": "! White drives me out yet again - the queen and bishop control the right diagonals here\n",
        "26... Qf6 27. Raf1": "another piece comes to the king's aid. Black's attack has been successfully repelled (I'm not sure whether the was a combination, starting with Qg6+, that could have been successful here)\n",
        "27... f4": "Since I had given up on the attack, I decide to push my pawn forward, threatening a king/bishop fork\n",
        "28. Qf3": "Forced\n",
        "28... g5": "? Creates a gaping hole in my defence, which White immediately takes advantage of\n",
        "29. Qh5": "! Also threatening to take my pawn. Black can't allow that.\n",
        "29... Kg7": "The only reasonable move I could see (Kh7 pins the h-pawn, which could have been problematic) also, the king-and bishop pawn fork would not have worked here\n",
        "30. Bg4 Rc4": "I launch an attack with my rook, aiming at chasing away the knight, then taking the e-pawn\n",
        "31. Bf5": "Nope, not gonna happen. I think White was planning to move the bishop there anyway. My pieces around my king are enough (for now) to repel White's attack\n",
        "31... b5": "Going ahead with my plan anyway - It was the only thing I could think of doing anyway\n",
        "32. Rh3 b4": "As I played  this, I was trying to work out how best to launch an attack on the king, and had all sorts of crazy ideas. However, they all involved the move f3+, and counting on it being recaptured with the king. Since there were two other pieces who could do that, I wasn't going to try. I was wondering whether this game would become a draw, but I saw getting my rook to c2 was powerful, giving me a chance to create one, if not two passed pawns\n",
        "33. Na4": "escaping and protecting the b2 pawn\n",
        "33... Bc5": "hoping to provoke an exchange... (it's strange - I never noticed the material deficiency in this game at all, except perhaps that my knight would have been useful in this situation) the problem with this is the passed d-pawn, which comes into play later\n",
        "34. b3 Rc2": "and after an easily averted threat...\n",
        "35. Nxc5": "White complies.\n",
        "35... Rxc5": "I'm hoping to now get my rook attacking the two pawns , creating a passed pawn\n",
        "36. Rfh1": "I get distracted, however, by White setting up the Alekhine's gun  on the h-file, and now my h-pawn is once again under threat (one of the first things I learned about the Alekhine's gun, by the way, is that it has nothing to do with scientific terms :P) \n",
        "36... Rh8": "The only move\n",
        "37. Qe2": "! Black's rook can no longer reach the 2nd rank\n",
        "37... a5": "of course, the a pawn wasn't really threatened anyway, I just didn't know what else to move\n",
        "38. Rd1": "Relieving a bit of the pressure on the pawn, and I immediately break free one of my own pieces...\n",
        "38... Rhc8": "though I miss White's true intention. I should have played Qd6\n",
        "39. d6": "!\n",
        "39... Rd8": "defending, and threatening to take the d-pawn\n",
        "40. Qa6": "! Man, I really love this move from White - this move really screws me over). Black's next move should have been Qf7 to stop White's next combination, but I simply assume that it protects the d-pawn. I don't know whether White saw the combination before this move or not, but if he did, it's great play!\n",
        "40... Rc2": "I knew that this move left the a-pawn hanging, but if White took it, I could get rid of the passer.\n",
        "41. Qa7+": "At first, I just saw this as a waste of time...  I didn't want a queen exchange as it dropped a pawn (41...Qf7 42.Qxf7+ Kxf7 43.Rxh6) but it would have, in fact, been the best move here, I think...\n",
        "41... Kf8": "Working towards the dangerous d-pawn, and I figure that I can (just barely) keep the pawn in check...\n",
        "42. Rxh6": "This was a nasty surprise to me - White sacrifices a rook! I never saw this coming\n",
        "42... Qxh6": "I decide to accept it and see where it plays out (I didn't think I could handle the pressure if I left the rook there) but White now has a forced mate in five....\n",
        "43. Qe7+ Kg8 44. Be6+ Kh8 45. Qxd8+ Kg7 46. Qg8+ Kf6 47. Qf7#": "Check...and...Mate! I'll use this game to show the difference between a sound sacrifice and an unsound sacrifice. The first sacrifice, from Black, was unsound as it was too slow - White had time to defend. The second sacrifice, from White, was sound as White could not fight back at all. Anyway...a really enjoyable game. I take my hat off to my opponent :) \n"
    },
    "url": "https://gameknot.com/annotation.pl/sacs-from-both-sides?gm=27953",
    "gameName": "Sacs from both sides",
    "players": "gorockies1 (1429) vs. x-machine (1301)",
    "opening": "QGA (D20), 3.e4"
}