{
    "moves": {
        "1. e4": "He started with e4. i am a 1.d4 player but as black i am used to play against e4 obviously.",
        "1... d5": "And here is d5, going into the Scandinavian Defence. I used to play the Sicilian with quite good results but now i changed the opening to avoid the tones of variation that Sicilian has! I played Scandinavian for few reasons, otherwise i had to choose between e5, e6, c6, g6 and so on.",
        "2. exd5": "He took it, i think its the most common reply to that defence. Others are e5 and d4.",
        "2... Qxd5": "I took it too. I avoid Nf6 cause sometimes its more dangerous and i am not used to it.",
        "3. Nc3": "Common reply too.",
        "3... Qa5": "Qa5 i think its the most playable and accepted reply to Nc3. Going back to d8 does not help and Qe5+ i think its not so good. Other reply is Qd6 but i didnt manage to play it too.",
        "4. d4": "d4 is logical",
        "4... Nf6": "Nf6 is more correct to c6.",
        "5. Bd2": "I think its quite early for White to threat the Queen. Anyway its a playable move. Others here are Nf3 and Bc4.",
        "5... Bg4": "According to my books this is the best reply. Bg4!? is quite tricky cause it's an aggressive one. Larsen play that move against Karpov and win the game! Maybe Bf5 is more correct but Bg5 usually forces White to play f3. Anyway black may lose a tempo here, but here has to be careful too.",
        "6. f3": "f3 as i said is a common reply.",
        "6... Bf5": "And Bf5. No White has to play Bc4 and Ne2 or Bc4 and Qe2 going for 0-0-0. Black has to play c6 and e6 to compete the pawn on d4.",
        "7. Nb5": "Nb5 is quite out out of theory i guess and not a common reply. My first thought was that White did not know how to play the Scandinavian Defence after the early moves and the other thought was that White wanted to deviate from main lines etc.",
        "7... Qb6": "Qb6 is the only logical move here.",
        "8. Bf4": "Now Bf4 is threatening the c7 pawn. My opinion is that White should go on with his development and then try to be more aggressive. White moved his DSB on d2 and then on f4 without a clear plan. Of course me, as black played Bg4 and the Nf5 but that was into a GM level play. Anyway maybe i am wrong too. But look White's Kingside is quite disable so far.",
        "8... Nd5": "Nd5 is logical move threatening the Bishop on f4 and protecting the c7 pawn.",
        "9. Bg3": "Bg3 is the best here.",
        "9... c6": "With c6 now the c7 square is not in danger anymore. And i dont think he's gonna exchange his Bishop for my Knight on b8.",
        "10. c4": "c4 a good move here, and i expected that.",
        "10... cxb5": "Taking on b5 is the best reply here. What do you think?",
        "11. cxd5": "He takes on d5 and now is a critical decision for me, what is the best move here.",
        "11... e6": "So i think e6 is good here opening the line for my Bishop and threatening on d5 too.",
        "12. Rc1": "Rc1 is good taking the c-file with the rook. But i have to notice still his Kingside is bad structured. This is beacuse of my Bg4 at the opening and his f3 move. Also he cant castle anymore i guess!",
        "12... Bb4+": "Going for check is good here, developing my piece and also displacing his King.",
        "13. Kf2": "Kf2 is one of his ways.",
        "13... exd5": "Now i am taking on d5 and opening the e-file too. I knew he's gonna play Qe2+ so i find out some defences to that.",
        "14. Qe2+": "I predicted that.",
        "14... Be7": "So Be7 is better that Be6 i think. Now my the b5 pawn is unprotected.",
        "15. Qxb5+": "So he take it with check. ",
        "15... Nc6": "I played Nc6. I dont know what is gonna happen after Bd7 Qxb6 axb6 a3 0-0 Bd3 ..... The analysis shows that i am +1.04.",
        "16. b3": "b3?? is tragic here forcing him to lose the match. Now a nice attack will come to his unconstructed Kingside.",
        "16... Qxd4+": "Of course i am going for the check and taking the pawn too.",
        "17. Ke2": "Ke2 he played. ",
        "17... a6": "i was between a6 and Qb2+. I finally decide to play a6. The analysis says its a mistake but i insist that is not. He provides 0-0 as the best here.",
        "18. Qa4": "Qa4 is a bad place to go.",
        "18... Qb2+": "Now Qb2+ is coming forcing a strong attack.",
        "19. Kd1": "Kd1.",
        "19... Bb4": "Bb4 is good. ",
        "20. Be1": "Be1 is not helping.",
        "20... Qd4+": "Qd4+! ",
        "21. Ke2": "Ke2.",
        "21... Bd3+": "Bd3+! Now a funny attack is coming.",
        "22. Kd1": "Kd1.",
        "22... Bxf1+": "I took the bishop with check.",
        "23. Kc2": "Kc2.",
        "23... Bd3+": "Bd3+! again.",
        "24. Kd1": "Kd1.",
        "24... Bb5+": "Bb5+! and check!",
        "25. Kc2": "Kc2. He continues to play.",
        "25... Bxa4": "I took his queen. The game is lost.",
        "26. bxa4": "He took the bishop.",
        "26... O-O": "0-0 is ok here. Maybe is too much.",
        "27. Ne2 Qc4+": "Qc4+",
        "28. Nc3 Bxc3 29. Bxc3 Qxa2+": "Another check.",
        "30. Kd3 Rfe8": "Now i took the e-file.",
        "31. Rc2 Qc4+": "Another check.",
        "32. Kd2 Re2+": "Another check and the checkmate is coming.",
        "33. Kc1 Rxc2+ 34. Kxc2 d4": "d4! is good.",
        "35. Rb1 Qxc3+": "Another check!",
        "36. Kd1 Re8": "Re8 is logical here to mate.",
        "37. Rxb7": "Nothing wrong.",
        "37... Re1#": "And checkmate. I hope you like it, feel free to comment!"
    },
    "url": "https://gameknot.com/annotation.pl/samostads-mini-tournament-i?gm=44954",
    "gameName": "samostad's mini-tournament I",
    "players": "mchesster (1591) vs. mariodag (1672)",
    "opening": "Scandinavian defence, Lasker variation (B01)"
}