{
    "moves": {
        "1. c3": "Saragossa opening (A00). I wasn't at all familiar with that opening.",
        "1... d5": "I felt d5 was the best response.",
        "2. Na3": "Odd move to me, but since c3 is occupied deliberately perhaps there is a plan I can't see yet.",
        "2... Nf6": "I continue to develop as usual.",
        "3. d4": "Push for center control.",
        "3... e6": "Looking back I'm not sure this was the best choice. I wanted to get control of the diagonal and didn't dare move e5 but perhaps I could have been more patient with it.",
        "4. Nc2": "I think there was an early plan to defend d4 with a knight at c2.",
        "4... Nc6": "I chose to develop as usual.",
        "5. Bg5": "Knight pin.",
        "5... e5": "Now that I have my Knight in place to capture back I challenge the d4 pawn. I lost tempo here I suppose.",
        "6. dxe5": "dxe5 as expected.",
        "6... Nxe5": "I felt that I gained space after the exchange and was happy to open up another diagonal in an area controlled by my Knights.",
        "7. h3": "Protects against a likely Bg4.",
        "7... Bc5": "Starting to put pressure on f2. I expect an eventual 0-0 if Bxf6...Qxf6 I'll be in a good position.",
        "8. f4": "White realizes the weakness and advances and additionally threatens my Knight although potentially weakens the pawn.  ",
        "8... Nc4": "I felt this would be a good spot for my Knight and I liked the control I had over e3.",
        "9. b3": "Chases away my Knight.",
        "9... Ne3": "I am forcing a trade of Knights. To some degree it seems silly to have my Knight chased around just to trade it away but I really liked my Bishop on e3. I figured I could defend it well and it would cramp the King and make it difficult to maneuver.",
        "10. Nxe3": "Nxe3 as expected.",
        "10... Bxe3": "I like the control here and like the possibility of potentially snagging a free pawn.",
        "11. Nf3": "White developes the Knight. I imagine he also didn't want to trade the Knight and loose the chance for a later 0-0.",
        "11... h6": "I want to force the trade here. I knew if I removed the pin on my Queen he would take my Knight and force me to take back unfavorably with my g pawn.",
        "12. Bxf6": "Bxf6 as expected.",
        "12... Qxf6": "I like that my Queen is in play, that I threaten a fork with Qxc3+ and that I might get that f4 pawn.",
        "13. Qd3": "Defends c3 and threatens e3.",
        "13... Bxf4": "I get my pawn for all the trouble although I deviate from my plan to keep the e2 pawn cramped. I probably should have tried to defend the Bishop with my Queen until I could get Rook support but I also wanted to keep the c3 fork threat alive. ",
        "14. e4": "Qxd4 is no good because c3 needs to be defended. e4 threatens instead.",
        "14... Be6": "Be6 to protect d5.",
        "15. exd5": "exd5 as expected.",
        "15... Bxd5": "I take back with Bxd5. My Bishop is still safe because I still threaten a nasty fork on c3.",
        "16. Be2": "Be2 protects the Knight and opens up for a Castle.",
        "16... O-O-O": "I thought there were a lot of interesting options here but nothing that I could use to create an advantage. I could have tried to prevent White from Castling but felt I should save my energy and control the d and e files.",
        "17. O-O Rhe8": "Control of the files.",
        "18. Nd4": "Protects the Queen from Rook threat. ",
        "18... Be3+": "I thought this was a strong move. My plan was to attack h3 with my Queen and my Bishop on e3 kept his Queen out of the way. Looking back perhaps I should have delayed and play Qh4 first. White may have not have seen the eventual pin I planned for him at g2.",
        "19. Kh1 Qh4": "I threaten mate since the g2 pawn is pinned.",
        "20. Bg4+ Kb8 21. Bf3": "My plan has been undermined. I don't want to lose my Bishop and g2 pin and I don't want to open up the board with a Bishop exchange. ",
        "21... Bxd4": "My hope is that White will take cxd4 and not Bxd5 but if so I figured I'd at least save the d4 Bishop and have a pin on his Bishop against his Queen.",
        "22. cxd4 Re4": "I thought this was a clever exchange offer. I lose material but get to keep my Bishop and figure I'll get the d4 pawn later to help material wise.",
        "23. Bxe4": "Bxe4 as expected.",
        "23... Bxe4": "I threaten mate again if I can shoo the Queen away from defending h3.",
        "24. Qe3 Rxd4": "I get the pawn I wanted, bring another attacker to the battle and can force mate if I catch White sleeping with 25. Qxd4...Qxh3+ 26. Kg2...Qxg2#",
        "25. Kh2": "White makes the best possible move moving the pin and using his King to help defend h3.",
        "25... Rd3": "Threaten the Queen and add pressure to h3.",
        "26. Qe2": "Qe2 protects g2 and still threatens my Rook and Bishop making it difficult to move away my Queen and Bishop defenders.",
        "26... Rg3": "I feel this is my best possible move. I prevent g3 threaten g2.",
        "27. Rf2": "Solid move. I may have traded the Rook, Bishop for a Pawn, Queen otherwise.",
        "27... g5": "I like my position and can't improve it much with my pieces. I figure my best bet is to force White to come up with a response to my eventual g4.",
        "28. Qb5": "Qb5 threatens mate with 29. Qe8#. \n\nI thought about b6 but wanted to keep his Rook at a1 out of play for a little longer so decide against it and choose to attack the Queen with Bc6 instead. There's actually a much better move that I miss, but I'll let you try to figure out what it would be.",
        "28... Bc6": "Bc6 protects against mate and threatens the Queen.",
        "29. Qe5": "Qe5 at first looked to be pretty scary. It threatens mate at h8 and looks like it should at least get a Rook out of it. If it weren't for the threat to my Rook I might have overlooked the opportunity afforded to me when his Queen left his Rook at f2 unguarded a move earlier. ",
        "29... Rxh3+": "Rxh3!+\nForced mate, White resigns.\n30.gxh3...Qxf2# or 30.Kg1...Rh1#\n\nI just wished I had seen it a move earlier."
    },
    "url": "https://gameknot.com/annotation.pl/saragossa-opening-a00-1-c3?gm=27793",
    "gameName": "Saragossa opening (A00) 1.c3",
    "players": "tag1153 (1566) vs. monkeyhouse (1478)",
    "opening": "Saragossa opening (A00)"
}