{
    "moves": {
        "1. f4": "[%clk 0:05:04] Rarely faced by me as black!\n",
        "1... d5 2. b3 Bf5 3. Ba3": "More and more interesting. It's not so easy as it appear move the e pawn without losing the castling rights.",
        "3... Nd7": "Not enough: if c5 now, Bb5 is coming...",
        "4. e3 Ngf6": "Bad move in a crytical moment. It's developement, ok, but I'm not addressing the e7 pawn's issue. ",
        "5. Nf3 a6": "This prevents Bb5 after c5, so now I'm doing something at least!",
        "6. Nc3 c5": "Whew, a breath!",
        "7. Ne2": "Strange move, but this N is aiming to harass my lsb, and it's dangerous: after Ng3, I can't play Bg6, or f5 will win it.",
        "7... Qa5": "I'll see later. Now I'm developing with tempo, threatening lsb and pinning the d pawn in return to white. ",
        "8. Ng3": "Here it comes. Now, what can I do? If I save my B on g4, he will save his on b2 - a very strong B! while mine will be fatally exchanged badly for a N after h3. So, the answer was only one: the risky one, as always.",
        "8... Bxc2 9. Qxc2 Qxa3": "...so I won a pawn in the process. But my developement problems are not solved!",
        "10. Be2 e6": "Finally! but still, my dsb has no good place to go to...",
        "11. O-O": "[%clk 0:04:56]\n",
        "11... Rc8": "This is a doubled-edged move, but I felt I had to do something or languish. I won't be able to take anything with the c pawn until the R is protected, but he won't because of the pin on the Q. If he releases it, I'll use the tempo. At any exchange, I have b5, and if the Q is still on c, the piece will be pinned. Very interesting, for my standards. ",
        "12. Qc1": "Looking for a Q's exchange, after which the game changes and looks pretty equal and very technical. Nope...",
        "12... Qb4 13. d3": "Self-blocking his lsb, but depriving me from the e4 square. Anyway, if Ne4, NxN and even after dxN, Nd2, f5, I don't feel I achieve too much. ",
        "13... c4": "!? I want space. I can't take, but I can still push it, for example...",
        "14. bxc4": "Good! The threat of Rb1 is stronger than my grip on the g column. I can lose b7.",
        "14... dxc4": "? In sight of Rb1. ",
        "15. dxc4": "But my opponent is not any better than me, so he played...",
        "15... b5": "...and this gave me tempo to defend, somewhat, b7. In fact, I think I'm lost here with accurate play from white. ",
        "16. a3": "White gives me a tempo to take away my Q from the dangerous colum, a tempo I can spend...",
        "16... Qa4": "The idea is that if Bd1, Qxc5 becomes possible. ",
        "17. Nd2": "I seriously considered Kd8, in order to defend the R in one movement, but hey, I couldn't be so sure, the situation looks complex and a slip can come any moment. Now white kind of threats Bd1, and this is a problems since after Qa5, a5! will crush my position. ",
        "17... Nd5": "...playing with the pinned pawn once again! The target, of course, is e3, and once defended... I'll see. But another tactic was in the air, and I realized it too late. The good move here was Bc5! The threatened check makes impossible any idea of cxb5, and even after Kf2, Nd5! is playable, for the same check with discovered threat on the Q. ",
        "18. Qd1": "Not defending e3, though... I can't lose my chance here, since after the exchanges my Q remains unprotected. Only one move, here...",
        "18... Qxd1 19. Rfxd1": "Retaking with the other rook would have allowed a fork.",
        "19... Nxe3 20. Rdc1": "Now I should have exchanged, and resing myself to a boring endgame. bxc4, and let it by.",
        "20... Bd6": "? Bc5 now, threatening Nc2+ doesn't work because of Kh1, and now I can't take the Ra1 or RxR+, losing the two of them.",
        "21. cxb5": "!! A precous tempo will allow his pawn to become a goner.",
        "21... Rxc1+": "[%clk 0:02:27]\n",
        "22. Rxc1": "[%clk 0:02:29]\n",
        "22... Ke7": "I can't see anything better. Rc8+ was too much a threat.",
        "23. bxa6": "Now look what I've got: if he manages his lsb into f3, I lose a minor piece or so. Bx a3 is a mistake, it just helps his R into a1, looking to a6. ",
        "23... Ra8": "My R can guard it excellently from a7. ",
        "24. a4": "He gives me a spare tempo. Probably, he sees he can't defend them easily.",
        "24... Bc5": "? I had to do my homework, and play Nc5 instead, try to grab both pawns, and then go for a slowly win wiht my extra pawn on the kingside. This in a serious game. But I was looking for some way to take advantage, finally, from my former attack plan. I am not threatening too much, here: only Nxf5 after the check. But I smelled some tactic somewhere, and this makes HIS movement very painful, looking for all the discovered check's consecuences...",
        "25. Kh1": "Well, so what? Best square for my N is d5, threatening f5 that can't be defended, but by the R. But this deprives my N from the pawn's grabbing c5 square. ",
        "25... Bd6 26. Nh5": "Oh, my... the only defence, and it doesn't work. Note black is having a better game ignoring the a pawns. The cost is to immobilize my Ra8, who has to be ready to control a7 even after Bf3 by white.",
        "26... g6": "Hit the road, Jack! :-)",
        "27. Ng3 Bxf4": "NOW I feel good. ",
        "28. Nge4": "Many pieces on a free board are often very trick to play. I had  good idea about controlled exchanges, but this N here is an annoyance to that plan. So, kickass2 comes!",
        "28... f5": "Fly, Robin, fly... :-)",
        "29. Nc5": "Ok, the time has came.",
        "29... Nf1": "? Novice's error. The idea works in itself, because Nd2 is pinned to the R. BUT, after the fuzz, white has a grip on d7. See...",
        "30. Bxf1 Bxd2 31. Rd1": "...and I am the one who ends without a B! ",
        "31... Nxc5 32. Rxd2 Nxa6": "Still, I feel I'm better. ",
        "33. Bb5": "Targeting d7, and h7.",
        "33... Nc5": "Targeting a4. ",
        "34. Rc2": "Targeting c5... if Nxa4, Ra2 and I'm in trouble!",
        "34... Rd8": "Taking advantage of the back rank mate...",
        "35. h3": "[%clk 0:00:59]\n",
        "35... Ne4": "I see a tiny chance to create threats by sarifying h7. Was I right?",
        "36. Rc7+ Kf6 37. Rxh7 Rd1+": "[%clk 0:01:29]\n",
        "38. Kh2 f4": "!! The key move I had in mind since some moves. I think this seals white's fate. Do you agree, dear reader?",
        "39. Rh4": "Which one?",
        "39... e5": "This?? I think that g4 wins, too, after Rh6+, Kf5, g4+ fxg3+ep#!!, or Rh6#, Kg7, Rxe4, Ng3 and there is no defence against Rh1#. If g4, Rg5 instead, Nf2! and white has to play g3, NxR, hxN, d2+, Kmoves on rank 1, fxg3, wiht strong advantage I's say.\nBut this one leaves him g3, and no mate is in sight.",
        "40. Rh8": "?? ...unless white fails answer adequately. Anyway, Kg4 was coming and it was lethal. ",
        "40... Ng3": "Death's sentence is signed. White is lost. ",
        "41. Rf8+ Kg7": ""
    },
    "url": "https://gameknot.com/annotation.pl/saved-by-the-bell?gm=61706",
    "gameName": "Saved by the bell",
    "players": "Abu_19 (1303) vs. damafi (1360)",
    "opening": "Bird's opening (A03)"
}