{
    "moves": {
        "1. d4": "This was one of my favoraite games that I played in the tournament. It features solid play from both sides and ebbs and flows based upon typical closed catalain ideas. ",
        "1... e6 2. g3 Nf6 3. Bg2 d5 4. Nf3 Nbd7 5. O-O Be7 6. c4 c6 7. Nbd2 O-O 8. Qc2": "this is the beginning point of the tournament. Nowadays white does not play 8. Qc2 as this tournament bares out white has difficulty getting any real advantage from it. Matter of fact I feel that black has the better chances. Black has strong play on the queenside and sometimes along the c-file if it ever opens up. \n\nThis openning is characteristic of closed positions in that it features sutble manouvers that slowly build up over time. ",
        "8... b5": "Black has other alternatives but this one is by far the most active. I like it because the follow up a5-a4 can create some serious problems for white if he does not meet it correctly. ",
        "9. c5": "Cxb5 is also playable for white but 9. C5 has the advantage of a slight plus in space and making black feel cramped in this position white enjoys a slight plus. With 9. Cxb5 cxb5 chances are equal. ",
        "9... h6": "!? a bit off tempo and not provoked. Better is 9. ...A5 with a double edged game. ",
        "10. a3": "this is kind of a preventive move that discourages a b5-b4 thrust that is a typical black sorte. ",
        "10... a5 11. Re1": "supporting a e4 thrust. ",
        "11... Re8": "? not the best move for me as it deprives me of blacks main manouver against e4-e5 which is Ne8-Nc7. the best way to keep the whtie e4 thrust in check was 11...Bb7. ",
        "12. e4": "I am running into a bit of a space issue. my problem is that I do not have any good developing squares for my peices. So the up coming 13. E5 is very good for white and sets me on my heels a bit. In such positions where you are cramped it is easy to go array. The best way to handle the cramping feeling is to exchange peices without creating pawn weaknesses.  ",
        "12... Qc7": "eek black is in a bit of trouble as white is going to have a huge central wedge. But having said that there is no open lines for white to exploit. The key is that if your opponent has a space advantage keep things closed because his pieces will not be able to make use of the space. ",
        "13. e5 Nh7": "looking for the exchange of pieces on g5",
        "14. Nf1": "this knight is going to e3 and also adds influence on g5",
        "14... Ng5": "I decide to go ahead with the plan to create some breathing room for my pieces at the cost of a minor pawn weakness. This has the plus of exchanging a weak knight for a stronger one. ",
        "15. Nxg5 hxg5": "The pawn capture is a most because \n15. ...Bxg5 is met with \n\n16.Bxg5 hxg5 17.h3 f5 18.Nh2 Qd8 19.Qd2 Nf8 20.Bf1 Nh7 21.Bd3 \nwith a clear advantage for white. ",
        "16. Be3": "?? The knight clearly is better here. ",
        "16... f6": "??\nan overly aggressive move that gives white winning chances.  Perhaps the quieter 16. ...Qd8 is in order. ",
        "17. Nd2 Qd8": "I played 16. ...f6 more out of instinct than looking at it. This causes me to loss my nerve and abandon my orgrinal idea of 16. ...f6 17. ...fxe5 with white's centre showing signs of fatigue. However, if I follow through with this plan it must work or I am dead. In the end, I decided to go for a draw and see if I can clog up the kingside so white can not mate me. ",
        "18. Qg6": "17. ...f5 would have prevented 18. Qg6 but after 18. h3 white succeeds in breaking through anyway. ",
        "18... Nf8": "This shores up some of the light square weaknesses around the king",
        "19. Qh5 f5": "this is the most stiff defence because it is easier for black to fight on the light squares of g6 and h7. Rather on the dark squares of g7 and h6. ",
        "20. Nf3": "bring another piece into the attack. It looks as though g5 is going to fall but black has a unnerving defensive strategy",
        "20... g6": "! This is the only way to repel white's attack. Black effectively sets up a defensive pawn structure that can only broken by a piece sacrifice. ",
        "21. Qh6": "Keeping the queen as close to the action as possible. ",
        "21... g4": "Black has developed a pretty strong fortress on the kingside but it still has major holes on the dark squares. ",
        "22. Ng5": "a natural place to put the attacking knight but dispite it's annoying presence I think I can live with it. During the game I was confident that I could hold for a draw because I have enough pieces on that side to counter any threat. Also to my advantage is the superior space on the king side due to my pawn structure. ",
        "22... Qd7": "x-raying on the 7th rank. ",
        "23. f3": "? I am sure this is not the way for white to fight for a break through. 23. h3 is clearly a better alternative because the open h-file would work perfectly with the rooks. ",
        "23... gxf3 24. Bxf3 Bd8": "I am going for the exchanges now to nulify the attack",
        "25. h4": "White thinks he has the breakthrough idea, but prehaps he himself was not totally convinced",
        "25... Qg7": "Forces the exchange of queens and ensures the draw",
        "26. Qxg7+ Kxg7 27. h5 gxh5": "an agreed draw because after 28. Bxh5 Ng6 there is no way white can get in"
    },
    "url": "https://gameknot.com/annotation.pl/saving-the-day?gm=36578",
    "gameName": "Saving the day",
    "players": "fortsask (2203) vs. elyhim (2233)",
    "opening": "Queen's pawn (A40)"
}