{
    "moves": {
        "1. e4": "Despite a late blunder from my opponent, the game was extremely interesting as a fight of a rook vs. bishop and pawns final... I think I could have won in an earlier stage, but I didn't find the way. ",
        "1... d5 2. exd5 Qxd5 3. Nc3 Qe5+ 4. Be2 c6 5. Nf3 Qc7 6. d4 Bf5 7. O-O e6 8. Re1 Nf6 9. Ne5 Nbd7": "All these are standard moves in my experience. White seems to have an edge, but if black plays carefully, it all cames to nothing. ",
        "10. Bf4 Bd6 11. Bf3 Nb6": "The first \"new\" move.",
        "12. Bg3 O-O-O": "The key of black's game: to castle queenside in order to threath a future attack on the white king. ",
        "13. Qe2 h5": "Starting a futile but annoying attack.",
        "14. h3 g5": "Tense situation... white's pressure is hot, but black is solid. ",
        "15. Be4 Nxe4 16. Nxe4 Bxe4 17. Qxe4 f5": "The purpose to the exchanges. To weaken e3 is normally a mistake. But I thought I had to create attack, and my pawns are there for something. ",
        "18. Qe2 f4 19. Bh2 c5": "BxK blocks the center, or proposes a pawn exchange (e3 - d5), that didn't convinced me much... c4 is a thematic move, here. It weakens black's king fortress, but opens the black diagonal to the queen or bishop in the future.",
        "20. c3": "The right defence, of course... ",
        "20... Rh6 21. Rad1 Rf8": "All to block the white's knight.",
        "22. f3": "So why to take it now? ",
        "22... Bxe5 23. Qxe5 Rf5": "The BxK exchange seemed to be a mistake, but I foresaw this position, and I thought that the black position becomed more prominent this way. In fact, my dsb had few places to go, and his knight was annoying. ",
        "24. Qxc7+ Kxc7 25. b3": "With the black bishop in this corner, black has a slight edge here, in my opinion. Of course, I was looking for the way to push g4 safely, but I didn't find it. But my knight has a lot of possibilities, here...",
        "25... Nd5 26. Kf2": "I cannot take the pawn safely... Rc8 and white takes the pawn back, improving his position. ",
        "26... cxd4 27. cxd4": "22.\tf2-f3\td6-e5\n23.\te2-e5\tf8-f5\n24.\te5-c7+\tc8-c7\n25.\tb2-b3\tb6-d5\n26.\tg1-f2\tc5-d4\n27.\tc3-d4\td5-b4\n28.\te1-e2\tb4-d5\n29.\te2-c2+\tc7-d7\n30.\td1-c1\t\n\n\n27.\tc3-d4\tc7-d7\n28.\te1-e5\tf5-e5\n29.\td4-e5\td7-e7\n30.\td1-c1\th6-h8\n31.\tg2-g3\th8-d8\n32.\tg3-f4\td5-f4\n33.\tc1-c7+\te7-e8\n34.\th2-f4\tg5-f4\n35.\tc7-b7\td8-d2+\n36.\tf2-e1\td2-a2\n37.\tb3-b4\ta2-h2\n38.\tb7-a7\th2-h3\n39.\tb4-b5\th3-f3\n40.\tb5-b6\tf3-b3\n41.\tb6-b7\tf4-f3",
        "27... Kd6 28. g4 hxg4 29. fxg4 Rf7 30. Kg2": "I would say first mistake. Ok, I cannot play Ne6+... does he believes I would fall in this trap?\nWhite should have tried to occupy the c column. Or maybe he wanted me to fall in the trap and advance the pawn, in order to free his bishop and, eventually, take my pawn. It was what happened...",
        "30... Kd7": "In order to play f6+, or Ne6+",
        "31. Bg1 f3+ 32. Kg3 Nc3": "Probably, the best plan here was Nf4. This plan almost forces the win of a quality, but... does it win?",
        "33. Rd2 Ne2+": "My trap. If Kf7, Rxh3, and if Kh2, f7. Black has to take the pawn to prevent queen... ",
        "34. Rdxe2 fxe2 35. Rxe2 Rhf6": "Played without thinking. Black's advantage is almost useless, here, due to the weak pawns. A good lesson. Rf-h7 was the right move, in order to keep white anchored to the defence of h3.",
        "36. Re5 Rg6 37. Be3 Rfg7 38. a4 Kd6 39. Bd2 b6 40. Bb4+ Kc6 41. Bd2 Rd7": "The only way to progress I saw. It is dangerous, but gives me a free pawn. But TWO to white...",
        "42. Bxg5 Rxd4 43. Kh4 Kd6 44. Re3 e5 45. Kh5 Re6 46. h4 Rd5": "Trying to exploit the self-made white king trap.",
        "47. Bh6": "A pawn's square, in this position, is essential!",
        "47... e4+ 48. g5 Rd3 49. g6 Re5+ 50. Kg4 Ke6": "With my king nearer the white pawns, I think all is beareable.",
        "51. Bf4 Rxe3": "A blunder! If black plays Bxe5, I cannot take the bishop or the pawn goes to g8... and I cannot prevent it easily. I must go to g1 with my rook, and let's see if I can stop the pawns!\n",
        "52. Bxe3 Rd5": "Trying to create room for my rook. The idea is to \"use\" the d pawn in order to take the white's b one. A very weak plan, compared to my strong attack in the previous moves. ",
        "53. h5 Kf6 54. Bc1": "Too late. With my king on h6, I'm safe.",
        "54... Kg7 55. Bb2+ Kh6 56. Bf6 e3 57. g7 Kh7 58. Kf3 Rd3 59. b4 Ra3 60. a5 bxa5 61. bxa5 Rxa5": "Can I win this final? Probably not. But white doesn't see a tactical...",
        "62. h6 Rf5+": "Over. But probably a drawn. "
    },
    "url": "https://gameknot.com/annotation.pl/scand-my-qs-pawns-storm-blunders-in-the-endgame?gm=23388",
    "gameName": "Scand, \"my\", Qs pawn's storm, blunders in the endgame",
    "players": "aramberber (1732) vs. damalfi (1715)",
    "opening": "Scandinavian defence, Lasker variation (B01)"
}