{
    "moves": {
        "1. e4": "A strong attack for black, but... Per adesso, solo una posizione in cui... non so cosa fare!",
        "1... d5 2. exd5 Qxd5 3. Nc3 Qe5+ 4. Be2 c6 5. d4 Qa5 6. Nf3 Nf6 7. O-O Bf5 8. Bd2 Qc7 9. Ne5 e6 10. Bf4 Bd6 11. Re1 Nbd7 12. Bd3 Bg6": "All this is \"typical\", for me. This is a weak defence for black, but it comes that I won several games with it. Now, white is playing really good...",
        "13. Qf3": "...and I became nervous. ",
        "13... Bxd3 14. Qxd3": "Now, what I want is to castle queenside, and spent some time analyzing it. \no-o-o, Kxf7, BxB, KxRd1, Bxa2 , Kh1 (looking to grab my bishop after g3), Kg4! (threatening Kxf2), but after Qe2 or Qf3, what? His knight can escape taking e6, making my position very weak (and trheatening my queen). \nIf Qe2, Kd8-f6? Qe6 , for instance. \nIf after o-o-o, Kxf7, BxB, KxRd8, Bxh2 , Kh1, Rf8 (instead that RxK), Kxe6, Kg4, KxQ, Kxf2 , KxBh2, KxQ, c2xKd3, KxKc7, I am a rook under!\nIf after o-o-o, Kxf7, BxB, KxRd8, Bxh2 , Kh1, RxKd8, g3, Kg4, and white can easily defend f2 with the queen, the rook and the c3 knight, so... I will eventually lose my bishop. For instance: Rf1 (but not Qe2, because of Bxg3, and if f2xBg3, Qxg3 and I have a playable game with a quality less but two free pawns and the white king very exposed. Anyway, if Qe2, Bxg3, QxKg4, Bxf7, Rxe6, and it looks no good at all for black), Rf8, Qe2 or Ke4 and the black attack vanishes, even after Rf6, QxKg4, Rh6, Qxg7... nothing to do. \n\nSo I had to wait. ",
        "14... Nh5 15. Bg3 Nxg3 16. Qxg3 O-O": "Yeah, this is what I sweared I wouldn't do in this scheme. The idea is to castle queenside, hold the attack against my king and be ready for a countergame, mainly on the black diagonal aiming to a2. But, with this move, I found no compensation with o-o-o, Qxg2, KxKe5, d4xe5, and the bishop has to retire to c5 or b4, then he has one precious time to defend Rd8-g8, Qmoves, Rg6, Qmoves, Rh8-g8, and my main attack line, the black diagonal, is closed. \n",
        "17. f4": "Now I saw dark clouds approaching...",
        "17... Nf6": "It is more importan to block the white knignt's advance, and of course I wouldn' give him two chained pawns in the center. ",
        "18. Rad1": "Come continuare? cosa si avvicina?",
        "18... a6": "Ok, the natural one, Ra-d8, just holds. But I wanted to advance my c pawn so to free my pieces, and I had to prevent Kb5 after c5. ",
        "19. Rd3": "Aiming to double the attack over my king. ",
        "19... c5": "A resource in the later stages of \"my\" Scandinavian.",
        "20. dxc5 Bxc5+": "I realized later I should have taken it with the queen, since my threat over the diagonal is based on the bishop. ",
        "21. Kh1 Rad8": "Just looking for a piece exchange in order to slow down the pressure.",
        "22. Rf3": "Of course, I was naive. ",
        "22... Bd4": "Now, my \"good\" bishop is doing something. ",
        "23. Qg5": "Oh, very funny. But...",
        "23... h6 24. Qh4": "I was really frightened, here. I had to wait, resourceless, and wait to see what attack line he would chose.",
        "24... Kh7 25. g4": "Ah, THIS one. Ok, but it gives some chances to me, also!",
        "25... Bxe5 26. Rxe5": "The only one. If f4xe5, Qc6, and after defending the rook (that would be blocked), my knight can escape, and I have some threats (R1-e3 ((or R1-f1), Kd5!, Rd3, Kf5! Re3!, Kg6 and I can hold on, among others). ",
        "26... Qc6": "Of course.",
        "27. Ree3 Nd5": "Now, it looks much better... what will happen?",
        "28. Nxd5 Rxd5 29. Rec3 Rc5 30. Kg1 Rxc3 31. Rxc3 Qb6+ 32. Kg2 Qxb2 33. Qh3 Qxa2 34. g5 Qd5+ 35. Rf3 Rc8 36. gxh6 Rxc2+ 37. Kg3 gxh6": ""
    },
    "url": "https://gameknot.com/annotation.pl/scand-my-no-sac-won-for-a-slight-margin?gm=20285",
    "gameName": "Scand, \"my\", no sac, won for a slight margin",
    "players": "bravura (1658) vs. damalfi (1661)",
    "opening": "Scandinavian defence, Lasker variation (B01)"
}