{
    "moves": {
        "1. e4": "This game shows how I exploited my opponent's overextended position, when he tried to kingside pawnstorm me.",
        "1... c6": "Me, and many others consider this opening passive, but I guess it's playable.",
        "2. c4": "Slightly better is d4, leading to classical Caro-Kann positions, but since I'm familiar with this variation, and don't study the Caro-Kann much, I decided to play c4 which will lead to a wide open tactical game if Black plays d5, exactly what I want.",
        "2... g6": "Instead of playing d5 leading to a position I'm more familiar with, Black plays g6, which will transpose into an entirely different opening that HE is more familiar with.",
        "3. Nc3": "I think d4 may be better, because it stops e5, which will lead to a somewhat equal position. I should've played d4 on the second move to try for an advantage.",
        "3... Bg7": "Black probably didn't want to block his dark bishop, but he ended up playing e5 anyway.",
        "4. d4 d6": "Threatening an e5 boost.",
        "5. h3": "Not completely necessary, but I don't want Bg4 to force a trade when I play Nf3. Another strategy for White in this opening is to play Be3 Qd2 (f3 if necessary) and O-O-O, with ideas to push the kingside pawns, leading to an attack similar to what is commonly played against the Sicilian.",
        "5... e5": "Now the position is like the King's Indian Defense, played against 1.d4, but where Black hasn't played Nf6.",
        "6. dxe5": "This is the exchange variation. Nf3 leads to positions similar to the English (1.c4), and d5 leads to the normal variations of this opening.",
        "6... dxe5": "Bxe5 isn't the main variation, but also playable since it threatens to take on c3 leaving me with isolated doubled pawns.",
        "7. Qc2": "Trading queens is drawish, because Black's king can get to safety on c7, and Black's position will be completely solid.",
        "7... Ne7": "Nf6 is a more common position, but Ne7 is better in this particular move order.",
        "8. Nf3 O-O 9. Be2": "White usually fianchettoes this bishop to add to control of d5, but I don't need to because Black doesn't have a d-pawn to threaten a d5 breakthrough.",
        "9... Qc7": "The best position for Black's queen in this opening.",
        "10. O-O h6": "Black's plan is to play f5-f4 and g5 to pawnstorm my kingside, but he ends up overextending his position, giving my forces access to his king.",
        "11. Rd1": "Places rook on open file, but Be3 may be more accurate.",
        "11... Be6 12. c5": "Gaining space on the queenside while taking claim to Black's weak d6 square.",
        "12... Nd7 13. Be3 f5": "Black starts his pawnstorm on my king's position, but overextends his own king's position.",
        "14. Rd6": "Black's overextended pawns have weakened the squares near his king, which I exploited nicely.",
        "14... Bf7 15. Qd2": "Not only do I threaten Black's knight, but also have a sneaky attack on the h6 pawn.",
        "15... Nf6": "Threatens my e-pawn to counter my threat on his h-pawn.",
        "16. Bxh6 fxe4": "Taking with the knight allows me to trade my unimportant c3-knight for his kingside defending knight.",
        "17. Bxg7 Kxg7": "If exf3, then Bxf8 wins an exchange.",
        "18. Qg5": "This counterthreat is much stronger than passively moving my knight.",
        "18... Be8 19. Nh4": "I'm not interested in taking on e5, which complicates the game. I'd much rather play it safe while I have an attack going.",
        "19... Ned5": "Black wants to block my rook's escape path and challenge it's defender, the c5-pawn, but my attack will be complete before then.",
        "20. Bc4": "Putting more pressure on d5.",
        "20... b6": "Black is underestimating my kingside attack, and will lose quickly.",
        "21. Nf5+": "I don't need to answer Black's threats when I have strong piece play against his king.",
        "21... Kh8 22. Nxd5 Nxd5": "Taking with the pawn allows me to win a piece by taking on f6.",
        "23. Qh6+": "Attacking the king and rook.",
        "23... Kg8 24. Rxd5": "Black may as well resign now. I'm threatening discovered check, and once he takes my rook, it's mate in 2.",
        "24... cxd5 25. Bxd5+ Rf7": "Bf7 and Qf7 leave Black with the same fate.",
        "26. Qg7#": "If you didn't see this mate, then you should probably start practicing to recognize pinned pieces better."
    },
    "url": "https://gameknot.com/annotation.pl/sccf-championship?gm=2881",
    "gameName": "SCCF Championship",
    "players": "bakerbaker (1795) vs. Haochi (1791)",
    "opening": "Caro-Kann (B10), anti-Caro-Kann defence"
}