{
    "moves": {
        "1. d4 Nf6 2. c4 g6 3. Nf3 Bg7 4. Nc3 d6": "Black could have made a more aggressive with a more common move of d5.  Although d6 is not bad.",
        "5. Bg5 Nbd7": "Black should look at h6 as an option.  This move would force White to withdraw his bishop or better, trade the bishop for the Black's knight.  Although this trade would create a weakened king side castle position (if Black decides to take that route) he does ensure that White will not maintains the bishop pair as the game develops.",
        "6. e3 c5 7. Qd2": "White is looking to begin attacking along the king side in anticipation that Black with castle that direction due to the advancement of the c pawn which creates a weakened pawn structure to defend the queen side castled position.",
        "7... O-O 8. e4": "White now begins his attack of the Black king's position by controlling the c1 - h6 diagonal.",
        "8... e5 9. Bh6 exd4": "Black looks to clear the c file while establishing control over the e and c3 squares.  ",
        "10. Nd5 Nxe4 11. Qf4 Re8 12. O-O-O": "This is a very questionable move.  With this, White gives up another pawn which gives Black a large advantage if he can avoid the current attack on his king.  It also puts the White King in a precarious defensive position with very little in defensive pieces.  Be2 would be a stronger move as it opens the king side castle opportunity and removes the threat of the discovered check if Black moves the e4 knight.",
        "12... Nxf2": "Black captures the hanging pawn and creates the rook fork.",
        "13. Bxg7 Kxg7": "Black has the option to grab the rook on h1 which should leave him in a stronger position than the Kxg7 option.  (13. ...  Nxh1 14.  Nf6  Kxg7 15. Nxe8 Qxe8 16. Bd3 Nf2 which creates another fork of White's remaining rook and the WSB. )",
        "14. Ng5": " ",
        "14... Ne5": "Black commits to this move to prevent the complications from either Nxf7 or Qxf7.  Although these lines are not conclusive, strong play must be had to ensure that Black does not lose any major material or the advantages already created.  In addition to preventing these complications, this knight move will work to derail the attack being established by White.",
        "15. Qh4 h5": "Black decides to trade the knights (with check) and being to press an attack against the weak defense of the king.",
        "16. Qxf2 Qxg5+ 17. Kb1 Qf5+": "With his material advantage and strong pawn structure, Black is happy to trade down the queens and remove any current threat against his king.",
        "18. Qxf5 Bxf5+ 19. Ka1": "White locks his King on the a1 square putting it completely out of play when we near the endgame.  A better move would have been to c1 which would center his king and allow him to work against the three center black pawns.  ",
        "19... Ng4": "Black begins to maneuver the knight to fork the rooks (again).  At this point he is more than willing to trade down all material and even allow his knights to get forked.  If White does try to fork the rooks, he will end up losing his own rook and his knight with only one rook for compensation.",
        "20. Bd3 Bxd3 21. Rxd3 Nf2 22. a3 Nxd3": "Black could have captured the h1 rook but that would have put his knight out of play for a few moves.  By capturing this rook, he can also force the rook trade with Re1 .",
        "23. Nc7 Rac8": "Black is willing to trade a rook for a knight at this point as he will still be able to force a rook trade which would allow him to move into the end game up three pawns and a knight.  ",
        "24. Nb5 Re1+ 25. Rxe1 Nxe1 26. Nxd6 Rc6": "Black is beginning to be a bit cautious as he doesn't wish to lose his rook to a knight fork with the king.  The next few moves of Black are more defensive to ensure this does not occur.",
        "27. Ne4 d3": "Black begins the pawn march.",
        "28. Nd2 Re6 29. Kb1 Nxg2": "Re-positions the knight to bring the rook down.",
        "30. b3": "White is making stalling moves at this point and could easily resign his position.  ",
        "30... Re1+ 31. Kb2 Nf4 32. b4 cxb4 33. axb4 Ne2 34. Nf3 Rc1 35. Nd4 Rxc4": "At this point, Black could have taken the knight at d4 which would resulted in the White king capturing the rook.  Either way, Black still has a winning position unless he blunders multiple times.",
        "36. Nxe2 dxe2 37. h4 e1=Q": "White Resigns."
    },
    "url": "https://gameknot.com/annotation.pl/seafarer-ii-charlotte-chess-club-rd-2?gm=18335",
    "gameName": "Seafarer II - Charlotte Chess Club - Rd 2",
    "players": "Lee Moore (1126) vs. Charles Carerros (1281 (P))",
    "opening": "King's Indian, 3.Nf3 (E60)"
}