{
    "moves": {
        "1. Nf3 Nc6 2. e4 e5 3. Bb5 Nf6 4. Bxc6 bxc6": "This has been seen before in \"T Gharamian vs Ara Minasian, 2001 1-0\"",
        "5. Nxe5 Qe7 6. d4 Ba6": "Ba6??  \r\n\r\nThis move will prevent white from castling for a while but it might have been better to play Bb7 to prepare for d6.  ",
        "7. Bf4": "White might have been better with Bg5.  With the knight pin white does not lose the e pawn and will develop the bishop to a strong square.",
        "7... Nxe4 8. f3 Nd6 9. a4": "Little if anything is gained by the a4 push.  White should have used this opportunity to develop the knight on b1 or perhaps push the b pawn to b3 in preparation to c4 which would allow the castle.  White would then have a strong center.  This move allows black to continue the attack.",
        "9... f6 10. Kf2 fxe5 11. Re1": "The rook move is a critical move in this game.  White would have been better served by capturing the pawn with the bishop and then making the rook move in followup.",
        "11... exf4": "Black decides to sacrifice his queen for the rook and the bishop.  As black is already up in material this provides a good advantage.  ",
        "12. Rxe7+ Bxe7": "In addition to the material advantage, the bishop is used to capture the rook which opens up the possibility of castling.",
        "13. Qe1 Nf5 14. c3 O-O": "With black safely castled, he can now begin a three piece attack on the white king.",
        "15. Qe5": "White moves to attack the c7 pawn.  He might have been better served to develop his knight which would also allow the possibility of bring the rook into the center of the board.",
        "15... Bh4+ 16. Kg1 Rae8 17. Nd2": "Nd2??  This is an obvious blunder that hangs the queen.  Other options",
        "17... Rxe5 18. dxe5 Rb8": "This move does not gain anything for black.  The attack on the b pawn is easily defended and in fact allows white to make the good move.  Re8 would be much better with white not being able to defend the pawn on e5 and allowing black the ability to centralize his rook.",
        "19. b3 Re8": "Black finds the good square for his rook.",
        "20. Nc4 Bxc4": "Black trades off the bishop for the knight and also degrades White's pawn structure.",
        "21. bxc4 Rxe5 22. Rb1": "Very little is gained by this move as the rook must remain on this rank to prevent Black's Re1  .  White might have been better with h3 to give the king some breathing room.  ",
        "22... Re1+": "Black decides to trade off the rooks.  ",
        "23. Rxe1 Bxe1 24. h3 Bxc3 25. Kf2 d5 26. Ke2 d4 27. Kd1 d3 28. Kc1 Ne3 29. h4 d2+": ""
    },
    "url": "https://gameknot.com/annotation.pl/seafarer-i-charlotte-chess-club?gm=17456",
    "gameName": "Seafarer I - Charlotte Chess Club",
    "players": "Shirlen, Joseph (987) vs. Charles Carerros (1168 (P))",
    "opening": "Reti opening (A04)"
}