{
    "moves": {
        "1. d4 Nf6 2. Nf3 g6 3. c4": "In my tournament experience I don't like playing any type of Colle/London setup against the King's Indian, as I usually end up with a position I don't like to be in, and I don't play any type of anti-indians with the dark bishop; Ergo my reason to play the Classical KID.",
        "3... Bg7 4. Nc3 d6 5. e4 O-O 6. Be2 e5 7. O-O Nc6 8. d5 Ne7 9. b4 Nd7": "This move came a little shocking to me and I didn't know how to proceed.  Even at my stage I expect the player to make the moves he \"needs\" to make!  LOL!  What kind of chess player am I?  I thought I could play this game on auto-pilot.",
        "10. Bb2 f5 11. Ng5 Nf6 12. Bf3 h6 13. Ne6 Bxe6 14. dxe6 c6 15. Re1": "I don't know if this was the way to proceed the game.",
        "15... g5": "  ?!/!?/!  I don't which one to grade it but it sure shocked me?  Indeed I even panic some and decied I need to move the game in my direction even more.",
        "16. exf5": "I don't if this was good.",
        "16... Nxf5 17. Ne4": "I don't know what my plan was as this game is over a year old now.",
        "17... Nxe4 18. Bxe4 Qf6 19. b5": "I was thinking along the lines of other games and I remember the common theme of White's wins is the attack on the Queen-side. lol",
        "19... Rac8": "I don't know if he could have deflected his Knight on f5.",
        "20. bxc6 bxc6 21. Qf3": "Neutralizing my opponent's threat.",
        "21... Qxe6 22. Bxc6": "Again, I am playing the game the way I want it to head towards.",
        "22... Ne7": "I should have knew better.",
        "23. Qd5 Nxd5 24. Bxd5 Qxd5 25. cxd5 Rc2": "!! I knew this started the end of my game.  ",
        "26. Rab1 Rfxf2 27. Ba3": "What was I going to do know?",
        "27... Rfxg2+ 28. Kh1 Rgxh2+ 29. Kg1 Rcg2+ 30. Kf1 Rgxa2 31. Kg1 Bf8 32. Rb8 Kg7 33. Rxf8": "I didn't know how to proceed. What else was there?",
        "33... Kxf8 34. Bxd6+ Kf7 35. Bxe5 Rhg2+ 36. Kh1 Rgd2 37. d6 Rde2 38. Rd1 Rad2 39. Rf1+ Ke6 40. Bg3 a5 41. Ra1 a4 42. Kg1 Reg2+ 43. Kf1 Rxg3 44. Rxa4 Kxd6 45. Ra8 Rgd3": "I would say, from move 38 or so, I continued to play, so I could view this young boy's technique with his rook play.",
        "46. Ke1 Ke6 47. Rh8 Rh2 48. Re8+ Kf7 49. Ra8 Rb3 50. Ra7+ Kg6 51. Ra6+ Kh5 52. Rd6 Rbb2": "I resigned."
    },
    "url": "https://gameknot.com/annotation.pl/seattle-c-c-spring-open-09?gm=31992",
    "gameName": "Seattle C.C. Spring open '09",
    "players": "freeman  vs. Feng, R. (1432)",
    "opening": "King's Indian (A48), East Indian defence"
}