{
    "moves": {
        "1. e4": "If you don't know, this is an over-the-board game I played in Seattle.",
        "1... c6 2. d4 d5 3. exd5 cxd5 4. Bd3 Nc6 5. c3 Nf6 6. Bf4 Bg4 7. Qb3 Na5 8. Qa4+ Bd7 9. Qc2 Bg4": "I was out of book and I didn't know what to do.  LOL",
        "10. Nd2 Rc8": "I remember this being a common move in this line.",
        "11. Ngf3": "aahh... My opponent didn't want to double his pawns on the f-file.  Very obvious once he made the move.",
        "11... Bh5": "?? I wanted to trade White's Bishop-d3 right away.  A bad move now that I review it.",
        "12. Ne5": "argh!  stopping 12...Bg6.",
        "12... Qb6": "?! Again playing a move that I knew was common in this line.  ",
        "13. O-O Nc6 14. Qa4 e6": "It's only now that I think: I should castle right away.",
        "15. Rab1 a6": "Protecting the a6-square as I analyzed a lot of potential threats by White and thought a6 would neutralize the threats.",
        "16. Rfc1": "! Boy! White sure develop his pieces.",
        "16... Be7": "oh!  I need to caslte right away.\r\nI thought of this being better than Bishop-d6.",
        "17. Be3": "I don't know what he was planning with this move.",
        "17... Ng4": "By this time I had spent over 70 minutes on my clock in a 2 hour game.\r\nMy opponent spend about 45 minutes of his clock",
        "18. c4 Nxe3 19. fxe3 f6": "Well, I couldn't castle for obvious reasons and I thought this to be the best way to rid the Knight-e5.\r\nWhat do you suggest?",
        "20. cxd5": "!",
        "20... fxe5": "!? A little crazy,  but in way I believe I am diving into my opponents lion den and I tell him to bring it!\r\nLOL! This is how I play sometimes.\r\nPlus I wanted to Castle.",
        "21. dxc6 O-O": "!!",
        "22. cxb7 Rxc1+ 23. Rxc1 Qxb7": "I believed my postion to be okay as I had the Bishop pair.  According to Fritz 9 my postion was losing.",
        "24. Qc2 exd4": "25-minutes left on my clock.",
        "25. Bxh7+ Kh8 26. exd4 Bg5": "Hey! I thought I was still in the game.",
        "27. Be4 Qb4 28. Qc5": "And my opponent goes in for the Queen swap.",
        "28... Be3+ 29. Kh1 Qxc5": "I thought it was best to swap Queens and bank on a draw.",
        "30. Rxc5": "But I didn't see my hanging Bishop!",
        "30... Be2 31. Nf3 Bxd4 32. Rc2": "During post analyses, my foe stated that he didn't see any way to proceed the game; as he saw Rook-h5+ but didn't know see anthing good afterwards.\r\nWhat do you see?",
        "32... Bxf3": "Creating an engame with opposites colored Bishops.\r\nI had 18-minutes left.\r\nhe had 36-minutes.",
        "33. gxf3": "!?",
        "33... Rb8 34. b3 Kg8 35. Rc6 Rb6 36. Rxb6 Bxb6 37. Kg2 Bc7 38. h4 Kf7 39. Kh3 a5 40. Kg4 Kf6": "Both of us received an additional hour.",
        "41. f4 Bd6 42. Kf3 Ba3 43. Ke2 Bc1 44. Kf3 Ke7 45. Bd3 Kd6 46. Ke4 Bb2 47. h5 Bf6 48. Bb5 Bb2 49. Kf3 Bc1 50. Kg4 Bd2 51. f5 exf5+ 52. Kxf5 Kc5": "I thought it to be better to head to the other side.",
        "53. Bc4 Kb4 54. a4 Bc3": "draw."
    },
    "url": "https://gameknot.com/annotation.pl/seattle-c-c-spring-open-2009?gm=31995",
    "gameName": "Seattle C.C. Spring Open 2009",
    "players": "Narayanan, S.  vs. freeman ",
    "opening": "Caro-Kann (B13), exchange, Rubinstein variation"
}