{
    "moves": {
        "1. e4 e5 2. d4 exd4 3. c3": " and from now players make their moves in the game.",
        "3... dxc3": "Black captured the pawn at c3 with his d4 pawn.",
        "4. Nxc3": "White captured back with his knight.  So now white is in control of the centre.  But I am sure it won't be for long.",
        "4... Bb4": "Black develops his DB to b4 and is attacking white's knight at c3.  White is still going to have a fight to maintain his monopoly on the centre.",
        "5. Bd2": "White moves his DB to d2 to avoid using his pawn if the knight is captured.",
        "5... Qf6": "Now black moves his queen to f6 and attacks the knight again.",
        "6. Qf3": "White decides to get right to it and also brings out his queen to avoid the queen hitting the square f2 which could also have been a target if black was interested in sacrificing his queen.",
        "6... Qd6": "Black moves his queen to d6 and is now attacking the DB at c2 which is protecting the knight.",
        "7. Bd3": "White brings out his LB to d3 with the queen protecting it.",
        "7... a6": "Black moves his pawn to a6 which protects the square b5 in case white's knight tries to extricate itself from c3.",
        "8. Bf4": "White decides the pawn can be used in the case of the capture of the knight at c3 and now moves his DB to f4 and is attacking the queen at d6.",
        "8... Qd4": "Black moves his queen to d4.  Black does not seem to be developing many pieces just moving his queen around.  White has 4 pieces developed and black has developed only 2 pieces.",
        "9. Nge2": "White now develops his final piece to e2 and the king can now castle short or long but I think short may be preferable with the threat of the queen and bishop on the queenside.",
        "9... Bxc3+": "Now black decides to capture the knight at c3 with the DB.",
        "10. bxc3": "White recaptures with the pawn as the knight gives this pawn protection and it leaves the knight covering the DB at f4 too.  Now the pawn is attacking the queen at d4.",
        "10... Qb6": "Black moves the queen to b6.",
        "11. Be3": "White moves his DB to e3 to provide protection to f2.",
        "11... Qb2": "Black's queen now comes to b2.",
        "12. O-O": "White castles and the rooks are brought together so the black queen cannot capture anything on the squares adjacent as they are all protected.  The only piece that was unprotected before was the rook at a1 but this is also now protected.",
        "12... Qa3": "Black queen now moves to a3 and is purely an object for white to attack should the opportunity arise.  I would think black would perhaps now try to develop and make his plan of attack on the white king.  However I think white's king is pretty well protected at present.  Whilst the black king is left in the middle with a weak square in front of him which perhaps black would like white to attack but white is no rush.",
        "13. Bc1": "White wants to remove the black queen so moves the DB to c1 attacking the queen at a3.",
        "13... Qe7": "Finally the black queen gets the message and retreats to e7 but not sure for how long.",
        "14. a4": "White pushes a pawn to a4 which does not allow the queen to return to the a file as all the squares are protected.",
        "14... Nf6": "Black develops his knight to f6.",
        "15. Nf4": "White moves his knight to f4 attacking squares e6 and g6 which may be more relevant to creating an attack than other squares.",
        "15... d6": "Black pushes a pawn to d6.",
        "16. Re1": "White moves his rook to e1 to protect the pawn at e4 which is also protected by LB at d3 and queen at f3.",
        "16... O-O": "Black now castles short.",
        "17. Ba3": "White moves his DB to a3 onto the diagonal to f8 with the black queen at e7.",
        "17... Qe5": "Black's wandering queen is on the prowl again as now comes to e5.",
        "18. Bb2": "White moves his DB to b2 to protect the pawn at c3.",
        "18... Bg4": "Black brings his LB to g4 and is attacking white's queen at f3.",
        "19. Qe3": "White's queen moves to e3.",
        "19... Nbd7": "Black now develops his final piece with knight to d7 protecting his other knight at f6.",
        "20. g3": "White pushes his pawn to g3.",
        "20... g5": "Black pushes his pawn at g7 to g5 and is attacking white's knight at f4.  Black is leaving his king wide open now and g7 could be used by white as it is a weak square.",
        "21. Ng2": "White moves his knight to g2 hoping to give cover to squares around the king while sheltered within the pawns protecting the king.",
        "21... Nc5": "Black moves his d knight to c5 and is attacking the LB at d3.",
        "22. Qd2": "White moves his queen to d2 as the pawn at e4 is under attack by the 2 knights.  Now the rook at e1 is protecting the pawn and the LB at d3.",
        "22... Rae8": "Black brings his 'a' rook to e8 making a battery on the e file with the queen at e5.",
        "23. f3": "White provides more protection to the pawn at e4 with pawn to f3.  This is also attacking the LB at g4.",
        "23... Bxf3": "Black captures the pawn at f3 with the LB as it did not have any protection and now the knight at g2 is under attack.",
        "24. Bf1": "White moves his LB to f1 protecting the knight at g2.",
        "24... g4": "Black pushes his pawn to g4 giving protection to the LB at f3.",
        "25. Nf4": "White moves his knight to f4 creating a barrier between the queen and the g3 pawn, the pawn is protecting the knight so cannot be taken without loss.",
        "25... Ne6": "Black now attacks the knight at f4 with knight to e6.  It could also be a redirection of his knight.",
        "26. c4": "White pushes a pawn to c4 allowing the DB to attack the queen on e5.",
        "26... Ng5": "Black moves his 'e' knight to g5.",
        "27. Bxe5": "So white captures the queen with the DB as it was left en prise and the DB may now be recaptured.",
        "27... Rxe5": "Black recaptures the DB with the rook at e8.",
        "28. Nd3": "White moves his knight to d3 and is attacking the rook at e5.",
        "28... Ngxe4": "Black moves his knight to e4 and is now attacking the white queen at d2.  This will mean that white will have to leave the rook for now as the queen will need to be removed from the knight's clutches.",
        "29. Qb4": "White moves the queen to b4 where the queen can still support the rook at e1 and the pawns at a4 and c4. The queen is in position to take the pawn at b7 if it is not moved.",
        "29... b6": "Black moves pawn to b6.",
        "30. Nxe5": "Black left the rook at e5 en prise in order to move the pawn so white quickly captured this.",
        "30... dxe5": "Black's knight was recaptured by the pawn at d6.  Black has opened the d file with this capture.",
        "31. Ra3": "With the LB at f3 and the knight at e4 it was difficult to move the a1 rook to the open file from the 1st or 2nd rows so white moved the rook to a3 with the intention of moving it to d3 without any hindrance from the black pieces. ",
        "31... Kg7": "Black moved his king to g7 perhaps to give his rook a chance to move across and come down the 'h' file.",
        "32. Qb2": "White sees there is a pawn which could be captured at e5 and moved his queen to b2.",
        "32... Nc5": "Black moved his knight over to c5  looking to attack the pawn at a4.  Since the white queen was on b2 diagonal to h8 and the black king was now at g7.  The knight at f6 would be pinned once the pawn was captured.",
        "33. Be2": "White wanted to remove the LB from the square f3 and decided to offer an exchange protected by the queen and the rook at e1.",
        "33... Bc6": "Black did not want to exchange and moved his LB to c6 to join the knight at c5.",
        "34. Qxe5": "White captured the pawn at e5 with the queen and now the knight was pinned to the king.",
        "34... Ncd7": "Now black brought his knight to d7 and was attacking the queen at e5.",
        "35. Qf4": "White moved the queen down to f4 as white was not ready to check the king as there was not much support on hand to assist.",
        "35... Nc5": "Black returned his knight to c5.",
        "36. Re3": "White moved his rook to e3 taking over the 'e' file but black's plan may be to block the e4 square with the 'c' knight which would join the knights up and it would be hard to remove the e4 knight without loss of material.",
        "36... Bxa4": "White's move allowed the capture of the pawn at a4 by black's LB.",
        "37. Bxg4": "White was not to be outdone and also captured a pawn at g4 with the LB.",
        "37... Nxg4": "Black recaptured the LB with his knight at f6 but white can check the king with the capture of this knight.",
        "38. Qg5+": "White did not capture the knight but did still check the king on g5 and once the king has moved can capture the knight quite safely.",
        "38... Kh8": "Black's king moves to h8 and any plans of the rook moving over to the 'h' file are ended.",
        "39. Qxg4": "White captures the knight at g4 with the queen.",
        "39... a5": "Black pushes his pawn to a5 and he has a pawn chain from c7 to a5.  In total black has 5 pawns but the king's pawns are useless as they are not joined since the g pawn has now been captured.  White only has 3 pawns and one of these is an isolated pawn at c4.  The other 2 pawns are in front of the king still.",
        "40. Re3e7": "White now moves his rook up to e7 and has a pawn at c7 he could capture whilst the pawn at f7 is protected by the rook at f8.",
        "40... Bc6": "Black moves his LB to c6 and is on the diagonal to the h1 square.",
        "41. Qd4+": "White moves the queen to d4 and is taking control of 2 files, d and e.  With this move it also checks the king at h8.",
        "41... Kg8": "Black moves his king over to g8.",
        "42. Rxc7": "White now captures the pawn at c7 and if the LB is left at c6 this may be captured.",
        "42... Be8": "Black moves his LB to e8 with white's rook at e1.",
        "43. Qf6": "White moves his queen to f6 keeping the f7 pawn on its square. With the LB at d8 this also keeps the rook at f8.",
        "43... Ne6": "Black moves his knight to d6 and I expect this will be a sac for white here.",
        "44. Rxe6": "White sacs the d1 rook and captures the knight at e6.",
        "44... a4": "Black now pushes his a pawn to a4.",
        "45. Rxe8": "White continues with the move Rxe8 which will mean the rook needs to recapture as the king is unable to move with the queen at f6.",
        "45... Rxe8": "Black recaptures white's rook.",
        "46. Qxf7+": "Now the queen captures the pawn at f7 and is checking the king.",
        "46... Kh8": "The king moves out of check to h8.",
        "47. Qxe8#": "With the last move which is white's queen capturing the rook it is checkmate."
    },
    "url": "https://gameknot.com/annotation.pl/sebfraysses-mini-tournament-vii-gambit?gm=62281",
    "gameName": "sebfraysse's mini-tournament VII Gambit",
    "players": "milly64 (1030) vs. alanmp (1313)",
    "opening": "Danish gambit (C21), Collijn defence"
}