{
    "moves": {
        "1. e4 c5": "Sicilian",
        "2. Nf3 d6 3. h3": "Stopping any chances of a pin (never really had played against sicilian prior to this game)",
        "3... a6": "Stopping the White bishop from going to the b5 square which is a threat toward the Sicilian opening...",
        "4. d4 cxd4 5. Nxd4 Nf6 6. Bd3": "I prefer 6 Nc3 e5 7 Nf5 Bxf5 8 exf5. Giving White more attacks on both sides of the board. (my brother tells me he's played this, and it doesn't work out so well for him at least against quality opponents)",
        "6... e5 7. Nf3": "Since in the Sicilian the fight is mostly focused on the queen-side I like 7 Nb3. This move just makes me feel sad since the knight was there just two moves ago...",
        "7... Be7 8. O-O b5": "Starting the attack on the queen-side. Also probably looking at Bb7 to put some nice pressure on the e pawn.",
        "9. Re1": "Getting another defender on the e pawn. This move is a little premature, White should be focusing on developing their queen-side. In fact, castling was also a bit early. Coach Johnson stressed castling as very important, which is probably why Sam castled so early.",
        "9... Qc7 10. Nc3": "Finally developing the queen-side!",
        "10... Bb7 11. Bg5": "Looking to ease the pressure off of the e pawn by eliminating the Black knight.",
        "11... Nbd7": "Good developing move! Finishes Black's development (though they need to castle!) and annoys White because 12 Bxf6 would be pointless due to 12...Nxf6",
        "12. a3": "Stopping the advance of the b pawn.",
        "12... Rc8": "Lining up the rook and queen. Though really it isn't much of a threat at all. Not with the Bishop at d3...",
        "13. Nd2": "? Getting another knight to defend the e pawn? And clearing a way for the queen to develop possibly?",
        "13... O-O": "Finally the Black Monarch arrives at his palace!",
        "14. f4": "? What does this move do exactly? Black's e pawn isn't doing much...",
        "14... Nb6": "! A good move since this gives Black's Knight a home at c4 after the massive trade soon to come.",
        "15. fxe5 dxe5 16. Qf3 Nxe4": "Black strikes swiftly, realizing the material advantage offered.",
        "17. Bxe4 Bxg5 18. Qh5": "Threatening Checkmate!",
        "18... Bxe4": "Completely Forced",
        "19. Ndxe4 Be7 20. Ng5": "Threatening mate again. White is begging Black to trade pieces.",
        "20... Bxg5": "Since Black is winning in material, trading suits him fine.",
        "21. Qxg5 f6 22. Qg3 Rfd8 23. Rac1": "Allowing his knight to move finally.......",
        "23... Nc4 24. Ne4": "A nice little move....",
        "24... Kf7": "Forced! 24...Nxb2 25 Nxf6+ Kh8 giving White an advantage",
        "25. b4": "! Instead of wasting time on a one move attack on Black's knight with 25 b3, (beginners would almost definitely do such a move) Black creates a nice camp for his Knight at c5.",
        "25... Nd6": "Moving the knight to a more effective position and offering to trade knights...",
        "26. Nc5": "White is not a fool. He puts his knight right were it was meant to go.",
        "26... Qb6": "Pinning the knight. A feeble move really. Perhaps 26...Nb7 would have been more effective?",
        "27. Kh1 Nb7": "Offering another trade.",
        "28. Ne4 Rc4": "? Preparing to threaten the knight with two pieces. Looks strong but easily stopped.",
        "29. c3": "Stopping all but Qc6 or Nd6 threats against the White knight. Nd6 most likely would make it a draw by repetition...",
        "29... Qc6 30. Qf3 Ke7": "? There is no danger from 31 Ng5+ Kh7 only allows a queen trade which favors Black....",
        "31. Qe3": "! Putting the Queen in position to penetrate Black's territory.",
        "31... Qd5 32. Kh2": "! Necessary for the combo White sees and Black does not",
        "32... Qd3": "? Black walks right into it. Exactly what White wanted him to do!",
        "33. Qa7 Rd7 34. Rcd1": "The reason for 32 Kh2. So if Black takes 34...Qxd1 Rxd1 35 Rxd1 and there is no check that allows Black to come back and protect his knight!",
        "34... Nc5": "Black's best move",
        "35. Qxc5+ Rxc5 36. Rxd3 Rxd3 37. Nxc5 Rxc3 38. Nxa6 Rxa3 39. Nc5 Ra2 40. Rd1 Rb2 41. Rd7+ Ke8 42. Rxg7 Rxb4 43. Rb7": "??? White could have gobbled another pawn with no ill effects....",
        "43... e4 44. Nxe4": "Worried about the both of Black's past pawns, White sacks his knight for two pawns.",
        "44... Rxe4 45. Rxb5": "Even now White has the advantage with his connected pawns. This game was a winner for sure if only White moved 43 Rxh7. My brother was (understandably) extremely intimidated by the rating of his opponent and settled for a draw.\r\nThis game was played on the first round on board two at the Washington State Team Tournament in 2006. Where his opponent's team went on to take 3rd place at State! Jeremy Jusak finished that year as the 4th best Senior in the State of Washington!"
    },
    "url": "https://gameknot.com/annotation.pl/sehome-vs-stanwood?gm=27593",
    "gameName": "Sehome VS Stanwood",
    "players": "Samuel Losee (1069) vs. Jeremy Jusak (1521)",
    "opening": "Sicilian (B50)"
}