{
    "moves": {
        "1. e4": "Another short game in this King's Gambit tournament. Analysis can be found at http://gameknot.com/analyze-board.pl?bd=19859834&fb=1\n\n",
        "1... e5 2. f4": "Starting point",
        "2... exf4": "I think this was the first game where I took the pawn and it worked out well for me",
        "3. Bc4 Nc6 4. Nf3 Bc5": "The computer prefers Nf6 here but I wanted to hinder whites ability to castle",
        "5. d3": "Computer calls this an inaccuracy preferring d4 which is what I was expecting.",
        "5... Qf6": "This may seem premature but I didn't want to play g5 as it blocked my queens access to h4",
        "6. Nc3 Nge7": "Preparing to castle. The knight can also be brought in to defend the f4 pawn if needed",
        "7. a3": "The computer calls this an inaccuracy preferring 7. Na4 Be3 8. Bxe3 fxe3 9. Qe2 Rb8. Personally I can't see the real point of it.",
        "7... d6": "opens the diagonal for my lsb to come to g4 pinning the white rook to the queen",
        "8. Bd2": "The computer calls this an inaccuracy preferring 8. e5 Nxe5 9. Ne4 Qf5 10. Nh4 Qd7. I think white was feeling a little cramped here",
        "8... Bg4": "If the white knight stays pinned I can threaten it with Nd4. I can get my queen in to h4 which I am hoping will cause big problems for white.",
        "9. Qe2": "The computer calls this a blunder, at the time it helped me with my plan",
        "9... Nd4 10. Qd1": "Computer calls this a blunder preferring 10. e5 Qh6 11. Qe4 Nxc2+ 12. Ke2 Bxf3+\n\nI was quite happy, my biggest problem was should I take the white knight with my knight or the bishop",
        "10... Nxf3+": "I eventually went with the knight, note that the knight is immune to gxf3 as we will see",
        "11. gxf3": "Unfortunately for white he didn't see it and it's now mate in 2 -  11. gxf3 Qh4+ 12. Ke2 Qf2#\n\nThe computer prefers  11. Qxf3 Bxf3 12. gxf3 Qh4+ 13. Kd1 Qf2 14. Kc1 Qxf3 15. Rd1 Qf2 16. Nb5 Rc8 17. b4 Be3 18. Bxe3 Qxe3+",
        "11... Qh4+": "Thanks for reading please comment and rate"
    },
    "url": "https://gameknot.com/annotation.pl/seirawrooks-king-s-gambit-vii?gm=50969",
    "gameName": "seirawrook's King´s Gambit VII",
    "players": "kingsrook3 (1534) vs. elwoos (1570)",
    "opening": "KGA (C33), bishop's gambit, Maurian defence"
}