{
    "moves": {
        "1. d4": "In between reading the writing on TV adverts and the Sun newspaper, I happened across the Queen's Pawn opening in a book. A little knowledge is a dangerous thing and it is exclusively how I open as white.\n",
        "1... Nf6": "A45 Indian Defense. The immediate development of the Knight is the most supple response to the Queen's Pawn opening, allowing transposition into virtually every type of defense at Black's disposal.\n",
        "2. c4": "Click-whirr...auto-pilot engaged.\n",
        "2... c5": "Uh? You're not supposed to do that. Apparently, this is the Benoni Defence.\n",
        "3. d5": "A56 Indian Defense / Modern Variation 2.c4 c5.\n\nGlad this has a name - I didn't want to relinquish the centre.\n",
        "3... b5": "A57 Indian Defense / Benko Gambit. The Benko Gambit is a distinct pawn-offer, promising long-term pressure on White's Queenside.\n\nWon't he leave that pawn alone?\n",
        "4. Nc3": "Out of Opening Book. cxb5 would have been in the Indian Defense / Benko Gambit book opening. Slightly better is cxb5. \n\nBack to click-whirr...",
        "4... bxc4": "Slightly better is b4.\n\nI figure I can pick that back up later with my bishop.",
        "5. Bf4 d6 6. Nf3": "I ought to have moved my pawn to E4.",
        "6... g6 7. e4": "Attacks Black's pawn at c4.\n\nAh, did it finally.\n",
        "7... Qa5": "Pins White's knight at c3.\n\nChessmaster wasn't a big fan of this move. Keep an eye on his bishop on C8.",
        "8. Ng5": "Leads to 8...h6 9.Nf3 Nxe4 10.Bxc4 Nxc3 11.bxc3 Qxc3+ 12.Nd2 Qf6 13.Be3 Bg7 14.Rb1 O-O 15.O-O, which wins a knight and a pawn for a knight and two pawns. Better is Nd2, leading to 8...Qb4 9.Bxc4 Nh5 10.Be3 Qxb2 11.Nb5 Na6 12.Rb1 Qf6, which wins a pawn for a pawn. This was white's most significant mistake, but white was still able to manage a draw. \n\nTo add to that last comment....\"because it guarantees a win overall for his opponents team\" ;-)",
        "8... Nbd7": "As soon as I had moved my knight, I realised he should have done H6. It would have forced me to move my knight again and I would have lost the pawn on E4. I didn't move the knight though - why not compound mistakes?",
        "9. Bxc4": "Blocks Black's pawn at c5 and makes way for a castle to the kingside. White wins a pawn. Material is even.\n\nInstead, Chessmaster says I should have brought my knight down to F3 and then D2.",
        "9... Rb8": "Threatens White's pawn at b2.\n",
        "10. Qd2": "Frees White's knight at c3 from the pin, protects White's pawn at b2, and clears the way for a queenside castle.\n\nI agonised over this move. Things felt like they were going downhill fast from here.",
        "10... Bg7": "Enables the short castle.\n\nMore pressure on the A1 diagonal. I desperately wanted to get rid of that bishop of his.",
        "11. O-O O-O 12. Rfe1": "Slightly better is Qc2.\n",
        "12... Nh5": "I think this is where I started to implode. I was beginning to feel like those cans that have all the air sucked out of them and they suddenly crush to nothing -- all my pieces start to get withdrawn.",
        "13. Be3 Ne5": "Threatens White's bishop at c4 and blocks White's pawn at e4.\n",
        "14. Bb3": "Slightly better is Be2.\n",
        "14... c4": "Threatens White's bishop at b3.\n\nAt this point, I just began smiling. What a lovely move - where do I go now? How did I get in this mess?",
        "15. Bd1": "Leads to 15...Nd3 16.Na4 Qxd2 17.Bxd2 Nxe1 18.Bxe1 Nf4 19.Bc3 Bxc3 20.bxc3 e5 21.dxe6ep fxe6, which wins a queen, a bishop, a knight, and a pawn for a queen, a rook, and a bishop. Better is f4, leading to 15...Ng4 16.Bd1 Rxb2 17.Qxb2 Bxc3 18.Qc1 Nxe3 19.Bxh5 Bxe1 20.Qxe1, which wins a rook, a bishop, and a knight for a rook, a bishop, a knight, and a pawn.\n\nI was now expecting his knight on E5 to pay me a visit on D3.\n",
        "15... Nf6": "Leads to 16.Be2 Bg4 17.f3 Bd7 18.Rab1 h6 19.Nh3 Bxh3 20.gxh3 Rfc8 21.Bf2, which wins a knight for a bishop. Better is Nd3, leading to 16.Na4 Qxd2 17.Bxd2 Nxe1 18.Bxe1 Nf4 19.Bc3 Bxc3 20.bxc3 e5 21.dxe6ep fxe6, which wins a queen, a rook, a bishop, and a pawn for a queen, a bishop, a knight, and a pawn. This was black's only significant mistake, but black was still able to manage a draw. \n",
        "16. Rb1": "Slightly better is Be2.\n",
        "16... Nd3": "Attacks White's rook at e1.\n\nIt's nice when people accept invitations ;-)",
        "17. Re2": "Moves it to safety.\n",
        "17... Nd7": "Slightly better is Ng4.\n",
        "18. Na4": "Attacks Black's queen.\n\nI needed to relieve pressure so a) hoped he wouldn't notice the discovered attack (I also believe in fairies so give me some slack) and b) needed to get rid of his queen so was happy to exchange.\n",
        "18... Qxd2": "Partially pins White's bishop at e3.\n",
        "19. Rxd2": "Frees White's bishop at e3 from the pin. White wins a queen for a queen. Material is even.\n\nNot the bishop for 2 reasons - 1. I would prevent my rook from defending B2 but 2. was hoping he wouldn't notice the attack on A7.",
        "19... a5": "Moves it to safety.\n\nDrat. This sums up how I was feeling. I felt really outclassed playing Paul. All my schoolboy hopes and tricks squashed to nought!",
        "20. Be2": "Hoping to win a pawn.",
        "20... Ba6": "His bishop finally moves.",
        "21. b3": "The game ends in a draw. \n\nI was really stuck at this point and didn't know really where to go next. I had other pressing problems though: I was in some distinct pain, desperately needing to go to the toilet, I had only 19 minutes left on the clock (he had 47) and my ability to make glorious mistakes rises exponentially the quicker I move!\n\nHe offered a draw and secured a win for his team leaving me wondering whether I should have carried on."
    },
    "url": "https://gameknot.com/annotation.pl/semi-finals?gm=23190",
    "gameName": "Semi Finals",
    "players": "Fatbrit (75) vs. PB (94)",
    "opening": "Benko gambit (A57)"
}