{
    "moves": {
        "1. d4": "The \"slow\" way to start the game. I'm rather partial to the other central pawn thrust, mainly because it can lead to an overwhelming position in a very short span of time if only one move isn't accurate.",
        "1... Nf6": "I guess the only reason to still play 1...d5 is to reach the QGA as Black, which isn't such a bad deal, provided you're willing to suffer through the middlegame.",
        "2. c4": "The other \"slow\" move. White seizes the d5 square but does nothing for his development.",
        "2... g6": "Black prepares to fianchetto the Bishop. If I'd had to chose between this and 2...e6 in terms of objective strength, I'd go with the the latter, but in matter of preference, I'm going to stick with this one.",
        "3. Nc3": "Finally White develops a piece. But he's still a long way from castling.",
        "3... Bg7": "Relinquishing control of e4, Black speeds up development and postpones the central struggle.",
        "4. e4": "The whole point behind White's move order, to control the center with pawns. Stenitz would have been appalled at Black's play but dogmas have a short lifespan in chess.",
        "4... d6": "Preventing an early e5 and preparing for a central pawn push.",
        "5. f4": "Not having chosen a specific line against the KID, I decided to go with the 4-pawn attack and see how it turns out.",
        "5... O-O": "Black castles and is ready to hit the center.",
        "6. Nf3": "White really needs to complete development and secure the King.",
        "6... c5": "The classic way to meet White's central pawn mass.",
        "7. d5": "After this, the games moves towards a Benoni structure.",
        "7... e6": "Black wants to open the e-file to pressurize the e-pawn. This approach is highly risky, because if Black lets his guard down and allows White to play e5, he'll have a very hard time coordinating his pieces.",
        "8. Be2": "Closing the e-file and preparing to castle.",
        "8... exd5": "The typical pawn exchange. Black wants to use Q-side pawns to achieve counterplay and secure a balanced game.",
        "9. cxd5": "The symmetrical recapture doesn't promise White anything.",
        "9... Bg4": "I think 9...Re8 would have been stronger here, but this Bishop is notoriously bad in Benoni structures so I can't blame Black for wanting to exchange it ASAP.",
        "10. O-O": "Finally, my King is safe. Somewhat... Black can still use tricks on the a7-g1 diagonal.",
        "10... Nbd7": "This is why Black is happy to exchange the lsb early on, his pieces would have a bad case of claustrophobia.",
        "11. Re1": "I was just following theory at this point. The aim of this move is to prepare e5.",
        "11... Re8": "Black does the same, but his goal is the opposite, to prevent me from achieving my desired pawn thrust. This move is also safer now that my Rook has left the f-file and f7 isn't under any kind of potential attack.",
        "12. h3": "Gaining the Bishop pair and over-defending e4. The problem is that without the King's Knight, the e5 push won't have as much strength.",
        "12... Bxf3": "Forced, but Black was more than willing to go through with this exchange. Now he can focus on other things, like getting his Q-side pawns rolling and generate pressure there.",
        "13. Bxf3": "If I would have had the time, I would have loved to play Bf1 and keep this Bishop covering c4 and d3. It is much more less active of f3.",
        "13... Qa5": "With my Bishop stranded on f3, Black has a much easier time pushing b5 than in normal lines. I'd say he has equalized here.",
        "14. Be3": "I wasn't very happy with this move, mainly since there isn't much point behind it. This Bishop is usually kept on c1 when f4 is played, at least until White manages to push either e5 or f5. It's kinda loose on e3.",
        "14... b5": "Black is always happy to play this, since he can control c4 and d3 now and can start shuffling pieces on the Q-side to attack my pawns. In many a line, this pawn is swapped tactically for White's e-pawn, giving Black an easy game. Also note that Black hasn't wasted time with a6, which means that there will be fewer pawn exchanges and that that pawn will be slightly less weaker in the endgame.",
        "15. a3": "A pretty meager reply. I've taken care of the direct b4 threat but now c4 will be chronically weak, along with all the white squares on my Q-side.",
        "15... Nb6": "The strategic reply to my last move. Since I don't have any direct control over c4, Black sends his Knight to that square. The only drawback is that e5 has lost of one its protectors.",
        "16. e5": "A flank attack is best countered by a strike in the center. Black allowed e5, but it isn't so bleak, he has managed to created enough resources for counterplay. It's worth noting that more slow replies, like 16. Qe2 would have quickly lost the initiative, since Black would have had time to regain control of e5 and start operations on the Q-side with 16...Nfd7, followed by Rab8 and Nc4, with a very good game.",
        "16... Nc4": "Remember what I was saying about the Be3? The Nc4 is ideally placed to take care of many problems, it defends d6 and e5, it attacks e3 and b2. The alternative variation 16...dxe5 17. fxe5 Rxe5 18. Bxc5 Nfd7 19. Bb4 Qa6 20. b3, would have Black lacking coordination between his forces which are almost cut in half by my d-pawn.",
        "17. exf6": "This tactical line wins me two pieces for a Rook and pawn but Black has enough prospects on both flanks to secure a balanced game.",
        "17... Nxe3": "Lines like 17...Bxf6 18. Bd2 Nxb2 19. Ne4 Bd4+ 20. Kh1 Rxe4 21. Bxa5 Nxd1 22. Raxd1 Rxf4 23. Bd2 are needlessly hectic and not very good for Black.",
        "18. Rxe3 Rxe3 19. fxg7 Rae8": "Things have settled and Black has good reasons to be happy with his position. His Rook pair is in complete control of the e-file, his King is safer than mine and he still has a menacing Q-side pawn majority. But I still have a few tricks up my sleeve.",
        "20. f5": "Inviting Black to win my Queen for his active Rooks with 21...Re1+ 22. Qxe1 Rxe1+ 23. Rxe1 gxf5, when Black has a lot of pawns and a lonely Queen against my small but more than adequate army. An ending such as this can only be dangerous for Black.",
        "20... a6": "Black replies very coolly, ignoring the apparent material gain and consolidates his pawn phalanx. He's not ready to push the pawns and is waiting for me to decide where I place my Queen.",
        "21. Qc2": "Here I missed my chance to go for the Black squares around the Black King with 21. Qd2! After a possible continuation 21...Qd8 22. Rf1 Kxg7 23. Bg4 R8e5 24. f6! and I'm the one who's on the attack. After my chosen move, Black is faced with considerable less problems.",
        "21... Qd8": "The Queen wasn't doing much on a5 and now that b5 is defended, it's time to send her to the other flank.",
        "22. fxg6": "This wasn't an immediate necessity and could have been postponed for a few more moves. The release of tension only eases Black's choices in what follows.",
        "22... hxg6 23. Rf1": "The f-file is my only source of counterplay, but thanks to my hasty pawn exchange, Black has a good rebuke to my plan.",
        "23... Qh4": "An excellent place for the Queen. This simply highlights the strategic drawbacks of playing f4 and h3 early in the game.",
        "24. Nd1": "Recycling the Knight and sending it for more endeavors on the other flank. ",
        "24... Re3e5": "Black is wise to reject exchanges, because my King will feel a lot more safe without his pair of Rooks on the board.",
        "25. Qc3": "Setting up a would-be pin. This also highlights my wrong decision at move 21 on choice of squares for the Queen.",
        "25... f5": "Taking care of all problems on the f-file. Black could even dream of launching a pawn storm on the K-side.",
        "26. b3": "Seeing as things have stalled on the K-side, at least for me, I turn my attention to the other flank, but I don't have high hopes of accomplishing anything without my opponents assistance.",
        "26... Kxg7": "Black can stand the tension no longer and finally gobbles the g-pawn.",
        "27. Nf2": "A very risky decision but I couldn't stand my passive Knight any longer.",
        "27... Qf6": "Breaks the pin and aims the Rook at the third rank.",
        "28. Qa5": "I was going for broke at this point. I really think that with precise play, Black could achieve a significant plus from this position.",
        "28... Re5e3": "Very justly played. With my Queen loitering on the edge of the board, all Black needs to do is mass his pieces around my King and winning should only be a matter of time.",
        "29. Qxa6": "In for a penny, in for a pound.",
        "29... Rxb3 30. a4": "I wanted at least to exchange these pawns then I could have start to set up some for of defense.",
        "30... b4": "Refusing the exchange and gaining a strong passed pawn. My a-pawn is its white and pale shadow.",
        "31. Be2": "I wanted to be able to defend my a-pawn in case Black would decide to attack it, but that would mean one less defender on the K-side. Black is very close to winning here.",
        "31... Qd8": "I don't like this move at all and I can't find a decent reason behind it. I guess Black was concerned about me pushing a5 but that pawn is almost smelling like dead meat. 31...Rb2! would have consolidated Black advantage and all that Black would have to do to win is trade Queens.",
        "32. Bb5": "Defending the a-pawn. ",
        "32... Ree3": "Doubling on the third rank can be very effective, especially in this position when the pawn shelter around my King is as flimsy as a house of straws.",
        "33. Nd3": "I finally get a route for a decent spot, e6, but by now it's too late. Black is active enough to force a perpetual.",
        "33... Qh4": "Preparing to sacrifice on h3. I can't prevent this without major concessions, so I have no choice but to allow it.",
        "34. Nf4 Rexh3 35. gxh3 Rxh3": "At the expense of two heavy pieces, my King is bare and defenseless against harassment by the Black Queen.",
        "36. Qb7+": "One last try and hope that Black might play something to give me reason to play on.",
        "36... Kh6": "Such as 36...Kf6 after which I could have played 37. Qe7+! Kxe7 38. Nxg6+ Kf6 39. Nxh4 Rxh4 40. a5 Ke5 41. a6 Rg4+ 42. Kf2 Rg7 43. Bc6, winning for White. But Black could not be swayed. Draw agreed. ",
        "37. Nxh3 Qg3+": ""
    },
    "url": "https://gameknot.com/annotation.pl/sense-of-danger?gm=30046",
    "gameName": "Sense of danger",
    "players": "nyctalop (2032) vs. rlcpw (1956)",
    "opening": "King's Indian (E76), Four pawns attack, dynamic line"
}