{
    "moves": {
        "1. e4 c5 2. Nf3 Nc6 3. c3": "Ett drag som tvingar kamp om centrum, vilket inte är typiskt för Sicilianskt spel.\r\nFördelen är alltså att man slår hål på svarts förhoppning att få spela den typiska strategin.\r\nNackdelen är att b-springaren får svårare att komma ut.",
        "3... d6 4. d4 cxd4": "Vanligare är att hålla centrum stängt. Nu gav motståndaren mig centrum och min b-springare kan utvecklas normalt.",
        "5. cxd4 Nf6 6. Nc3 a6 7. h3": "Förhindrar Löpare g4",
        "7... e6": "Motståndaren vill uppenbarligen spela defensivt inledningsvis.",
        "8. Bd3 Be7 9. a3 O-O 10. Bg5": "Om jag har möjlighet utvecklar jag gärna alla pjäser innan jag gör rockad. Jag ser inga komplikationer här.",
        "10... Qc7": "Bättre drag här för motståndaren är förmodligen b5.",
        "11. O-O b5 12. d5 Na5 13. b4": "Tövligt av mig att glömma bort att b-bonden är det enda som skyddar min springare på c3",
        "13... Qxc3 14. bxa5 Qxa5 15. a4": "Här förväntade jag mig b4 som svar. Jag funderade att det är lättare att attackera hans bönder om de är lösgjorda från varandra.",
        "15... bxa4 16. Rxa4 Qb6 17. Qe2": "Sätter press på a6, skyddar e4 bättre och ger rum åt tornet på f1.",
        "17... exd5": "Och mitt drag förhindrar motståndarens drag exd5 att vara lika effektivt.",
        "18. exd5 Qd8 19. Re1 Bd7": "Hotar mitt torn istället för att skydda sin löpare.",
        "20. Bxh7+": "Ett drag jag är stolt att jag såg. Om Kxh7 så Th4+ innan jag tar hans löpare på e7 med damen.\r\nOm Kh8 så Th4 och fortfarande omöjligt att vinna löparen utan att jag får hans löpare också.",
        "20... Nxh7 21. Bxe7 Re8": "Hans enda möjliga goda drag här gissar jag.",
        "22. Re4": "En mycket vacker dominans av e-filen.",
        "22... Qb8 23. Bh4": "Jag måste erkänna att jag var nära att göra bort mig totalt. Jag trodde att min löpare kunde ta d6 och tog tag i min löpare före jag såg hur dåligt draget var. Som tur är så fanns det ett vettigt ställe att flytta löparen till, som jag enligt reglerna måste flytta på eftersom jag har rört pjäsen.",
        "23... Qb7 24. Qd2 Rxe4 25. Rxe4 Bf5 26. Re7": "Hans bästa svar här är förmodligen att gå 26. Db1+ för att vinna ett viktigt tempo i hans pressade situation. Mitt svar skulle förmodligen ha varit 27. Kh2",
        "26... Qc8 27. Qf4": "Ett mycket bra drag från min sida. Hotar löpare (vilket tvingar hans Dam att hålla kvar skyddet på den) och bonde på d6. Märk att draget även sätter press på f7 så att löparen inte kan gå någonstans annat än möjligen g6. Bonden på d6 är mao förlorad. Min motståndare har här ca 4 minuter kvar på sin klocka och måste göra tre drag till innan han får 30 minuter extra betänketid. Själv har jag en hel kvart på mig att göra två drag till.",
        "27... Bxh3": "Blunder i tidspress från motståndaren.",
        "28. Qxf7+": "Här ger motståndaren upp. Efter tvingat drag 28. Kh8 följer 29. Dg7++"
    },
    "url": "https://gameknot.com/annotation.pl/seriematch-i-roslagen-rond-4?gm=53919",
    "gameName": "Seriematch i Roslagen, rond 4",
    "players": "Ronnie Aspbäck (1481) vs. Claes-Åke Andersson (1492)",
    "opening": "Sicilian defence (B30)"
}