{
    "moves": {
        "1. e4": "e4 {trumpets blaring}",
        "1... c5": "Standard Sicilian defense from black. This is apparently one of the most common and statistically successful defenses against e4. The strategy black has with 1..c5 is to inhibit white's ability to maintain a central pawn majority. You can see if white moves 2. d4, he will be at a 2-1 central pawn disadvantage after a quick exchange in the first two moves of the game. In addition, this exchange results in the queen coming out, where she will undoubtedly be harassed while black develops.",
        "2. c3": "This is the MT starting position.\n\nTypically, white would accept the temporary disadvantage at d4 by playing 2. Nf3 (headed to the \"open Sicilian\"). In my view, this is a really sexy move, one of my favorite opening chess moves. Nf3 allows white to develop the knight, provides white control of the remaining center squares (pressured only at d4), allows for a potential d4 (or e5) push in the future and is one step closer to castling. In addition, notice the scope of the white LSB and queen, compared to black's. This scope difference creates delays in black development. Quite a return on investment for one move!\n\nHowever, if white follows 2. Nf3 d6 with 3. d4, this will again result in the exchange of a flank pawn for a central pawn, albeit with development advantages.\n\nSo, by countering with 2. c3 (\"Alapin Sicilian\" or \"c3 Sicilian\") instead, white provides the future d4 pawn a \"buddy\" to back him up. Let's call him Buddy. I'm sure the d4 pawn feels all warm inside. Buddy allows white to maintain the central pawn status quo. However, with all good things there are drawbacks. The primary white weakness is the limited mobility of the queen side knight, which makes the e4 pawn more vulnerable to immediate attack.\n\nI may be missing some key elements in description, but this is what I notice.",
        "2... Nc6": "Here black is putting additional pressure on d4, which is most certainly the early battle ground.",
        "3. d4": "But white is undeterred and occupies d4. Two attackers, two defenders, the attacker loses.",
        "3... cxd4": "Black takes.",
        "4. cxd4": "White continues to stick with the plan. Buddy jumps in and saves the day! Now things are looking pretty good for white. There are two white pawns on the 4th rank and it looks like black has only developed a knight.",
        "4... d5": "So, black challenges the e4 pawn. I think Nf6 might have been better here to capitalize on the fact white cannot readily defend with the queen side knight AND develop a minor piece. D5 is a similar tactic but moves a pawn instead of developing a minor piece, but opens a line up for the black LSB. Not really sure which is better.",
        "5. exd5": "5. e5 seemed to me to allow white to expand deeper, but I noticed it also gave the black c6 knight two separate targets meaning I would have to defend d4 rigorously and I'm just not sure up for that in this game.\n\nIn addition, the only way black can exchange is with the queen. I think I may be able to capitalize on this later.",
        "5... Qxd5": "And black obliges.",
        "6. Nf3": "White continues development with the knight and adds a d4 defender. This isolated pawn normally is troublesome, but not in this game. Buddy is my hero. Also, check out the open lines on the white side! \n\nNote: analysis shows we are back in book again, but white has successfully avoided the c3 attack taking advantage of the white queen side knight weakness. White is in rapid development which is a key to defeating the Sicilian defense. If white can maintain rapid development, the black queen side pieces will be quickly marginalized.",
        "6... Bg4": "Here's the advantage to the earlier d5 pawn move, black bishop is free to pin the knight",
        "7. Nc3": "Soooo, now I harass the lady!",
        "7... Qe6+": "Removes the threat and gains a move",
        "8. Be3": "Black uses this opportunity to develop the DSB. I think the the Queen check actually unintentionally assisted in white's development.",
        "8... O-O-O": "Another d4 attacker, but black ignores the pawn fork at d5",
        "9. d5": "Buddy is really a scrappy little guy! Another high return on investment move! The fork is actually a bluff, the black d8 rook pins the pawn. However, I can still harass the queen. This will remove the e3 bishop pin and threaten the a7 pawn all at once!",
        "9... Qf6": "Black Queen side steps the attack, but presents no real threat in return. Looking back, I now believe 4...Nf6 was better than 4...d5.\n\nAt this point, it's more obvious how the white queen side pieces are limited. Rapid white development is a main strategy for defeating the Siciilain defense.",
        "10. Qa4": "I debated whether to take a7 with the bishop directly, but didn't see anything other than a quick material gain. However, I can remove the remove the pin on f3 and threaten with my queen, I think that would be tactically better. ",
        "10... Bxf3": "White seems in trouble here, another d5 attacker. To take the bishop I need to open the g file and the white queen is looming. The h1 rook's future is grim.\n\nI spent a longtime here. Thoughts from some notes I took:\n\nBlack is focused on d5. The black queen is posed and salivating. I had planned on castling, but I decide to use the castling move to further my attack. Therefore, white really can't use the h1 rook for traditional purposes given the castle decision. It's unlikely white will be able to connect the rooks as well.\n",
        "11. gxf3": "Take",
        "11... Qxf3": "Take... -1. Yuk!\n\nBlack rules the diagonal. Black queen so close makes me nervous. But then when I take a close look, the only thing really in danger is the rook. Maybe he has a purpose.\n\nFocusing on the queen side attack, I need to dispense the knight to put the queen in place.",
        "12. dxc6": "Buddy kills the knight, this looks pretty good. Except I lose the rook.",
        "12... Qxc6": "Black had to kill Buddy, he was close to promotion. What a great pawn.\n\nI notice the knight fork potential at a7.",
        "13. Nb5": "My Knight is avenging Buddy! This block defends the white queen and threatens a fork. I also noticed the queen lined up with the king. Would be nice if I could pin it with Rc1  \n\nWait! I now notice the quiet, shy rook sitting alone in the a1 corner.",
        "13... Qxh1": "Missed the Queen pin, but now I'm paying attention to the a1 rook. Taking the h1 rook was the game loser for black.",
        "14. Rc1+": "Its always the quiet ones! I'm pretty sure the game is over.",
        "14... Kd7": "Black runs",
        "15. Nc7+": "Discovered check, defended knight.",
        "15... Kd6": "Black runs",
        "16. Qd4+": "Queen centered, black resigned. Thanks for the game lanceman_uk!\n\nPlease leave me your comments."
    },
    "url": "https://gameknot.com/annotation.pl/shambobalas-beat-the-c3-sicilian?gm=60550",
    "gameName": "shambobala's Beat the c3 Sicilian",
    "players": "russ20124 (1522) vs. lanceman_uk (1772)",
    "opening": "Sicilian (B22), Alapin's variation (2.c3)"
}