{
    "moves": {
        "1. e4": "Black opens with KP.\n\n",
        "1... c5": "This is the opening of the Sicilian defense. I've used this a several times and had good success. Conversely have been defeated almost every time I've faced it. Here black intends on denying white control of the center or exchanging a flank pawn for a center pawn. From Wikipedia, \"17% of all games between grandmasters, and 25% of the games in the Chess Informant database, begin with the Sicilian.\".. so it should probably be something every serious chess player should study. ",
        "2. c3": "From my studies, I understand this to be the one of the most effective responses to the Sicilian. I know I have never intentionally played that move as white. Looks a little strange but has some interesting play. Here are a few references that I thought were helpful describing how well things can work for white. There are probably many more out there:\n\nhttps://m.youtube.com/watch?v=1vaTT8jcDf4\nhttps://m.youtube.com/watch?v=HjIt_88BLHE\nhttps://m.youtube.com/watch?v=SUWBZLMIPu4",
        "2... g6": "White wants early control of the center and has the initiative, so black concedes that for now. I thought giving up the the center early might be unexpected for my opponent. (Note: I've tried this strategy on 2000+ players and it NEVER works). The idea will be to attack the center from the flank later with force later. The DSB and the queen side knight will apply pressure on the d4 square, since the e file pawn has passed and can't defend. Black's DSB turns out to be pivotal to this game once it is in fianchetto position. ",
        "3. d4": "White confronts the black pawn on c5 which is undefended. The first instinct might be to defend. However, there are several reasons I decided to leave it undefended. (1) I need to stick to my strategy, (2) I already pushed g6 and weakened the future king-side castle, so I need to fianchetto, and (3) if white takes on c5, then my original goal of weakening white's center is accomplished, albeit at a material expense. A white pawn on c5 would be difficult to defend. I couldn't think of a good reason for defending the c5 pawn other than 1 point of material.",
        "3... Bg7": "Following the plan to flank attack. Starting to apply pressure to d4. Analysis showed this as a black Inaccuracy and that I should have taken at d4. But the computer doesn't know my strategy.",
        "4. Bc4": "White's LSB puts pressure on the weak f7 pawn and prepares for a future attack on the castle. ",
        "4... cxd4": "I want to bring the queen side knight out, but white has the d4 pawn that could immediately threaten and push me around, so I take d4. ",
        "5. cxd4": "...and white takes it back. I live the fact that the DSB is staring down at the white queen side rook; although this really doesn't materialize into anything. More importantly I think 4...cxd4 leaves the white d4 pawn needing defense by a minor or major piece. Probably inconvenient for white.",
        "5... Nc6": "Black knight puts more pressure on d4.",
        "6. Ne2": "White needs to add a defender to d4. I think 6. Nf3 would have been better, but I'm not sure. This moves also solidifies white's intent to castle kind side.",
        "6... d6": "I need to get the king side knight in play. However, if I need to ensure white cannot move to e5 and push my knight around, so I made this pawn move. This also opens up my bishop lines a bit. However, does allow white to pin my knight... we'll see.",
        "7. O-O": "white decides to castle instead of pin. ",
        "7... Nf6": "so I put the knight in play. This has the temporary affect of reducing the tension on d4, but changes white's focus to the hanging pawn on e4.",
        "8. Nbc3": "and white defends e4. At this point, I see my queen and DSG lining up at e4.. I just need to get all those other pieces out to of the way  :)",
        "8... O-O": "but first defend and work towards connecting the rooks.",
        "9. f4": "During the game, this move struck me as a bit unusual. My first thought was white had overextended his pawns. I can't ignore the wall of white I'm facing, but they really aren't well supported. Post game analysis confirmed 9. f4 to be a mistake and the game turning point. The computer thinks the best move would be to defend d4 with the DSB.",
        "9... Nxe4": "I took the pawn thinking noticing a potential fork at d5 if white retakes.",
        "10. Nxe4": "Leaves black down -2, but this moves leaves an isolated queen pawn on the d4 square I've been targeting the whole game. In addition, there's a fork at d5. Not sure what else white should do here.",
        "10... d5": "haven't done that many pawn forks, always fun.",
        "11. Bb3": "Analysis shows white should have taken the pawn.. not sure I would have done that either. Apparently white really wants the a2-g8 diagonal. I might have backed it up to d3.",
        "11... dxe4": "take.",
        "12. Be3": "this move is necessary, but really limits white's DSB for now. I think white now knows my plan, but I think its too late. I see the queen staring at d4 now and my earlier diagonal scheme seems like it might materialize.",
        "12... Bg4": "pinned the defender and connected all the big guys! At this point, I was fairly certain I had this game. I really like the way everything connected up and was achieving my original goal of d4. ",
        "13. Qd2": "white attempts to remove the pin.. but I'm ahead in material, so...",
        "13... Bxe2": "take.. now white has to move the queen from defending d4 to handle the bishop.",
        "14. Qxe2": "white complies leaving d4.. there's blood in the water.",
        "14... Nxd4": "I see the end now... I just need white to take the knight and we're done.",
        "15. Bxd4": "Yes!! Not sure if white could have done anything else here, but I think that's the right move for white here.",
        "15... Qxd4+": "Check. White has successfully implemented a flank attack and now controls d4 with tempo. Look at how important the DSB has become. White has no counter attack potential on the black king and black has really taken center control. Note: If black takes d4 with the bishop instead of the queen, it sets up a potential pin opportunity for the white rook. The queen is much more adept here.",
        "16. Kh1": "forced move.",
        "16... e6": "I thought about taking on b2 and offering a queen trade. However, this left e7 vulnerable and the white LSB still staring at my king. 16...e6 seemed like a good way to use the extra tempi. ",
        "17. Rad1": "still leaves the b2 pawn hanging and I was going to offer the exchange anyway. I don't like the fact that white owns the d file, but that doesn't really matter that much now. I notice the king is buried behind his pawns and see a potential tactical queen sacrifice if white doesn't choose the exchange.",
        "17... Qxb2": "offer the exchange.",
        "18. Qxe4": "but white wanted the pawn instead. Not sure if white sees the queen sac tactic.",
        "18... b5": "b5 keeps the LSB bishop from interfering with the queen sac.",
        "19. Rd7": "white doesn't see it... white is interested in lining up his queen and rook along the 7th row, but too late for that.",
        "19... Rac8": "Rook to position, maybe white sees it now. If he moves his queen back, have to think of something else.",
        "20. Rxa7": "no, he is intent on the 7th row attack. Just not enough time left for that.",
        "20... Qf2": "There's the queen sacrifice. I owe this one to my club (WoW)... we were just talking about queen sacrifices for advantage in a discussion list and started me thinking. \n\nIn the best case scenario for white, he loses the a7 rook. Worst case the game is over.\n\nWhite chooses to resign. I would have liked to play this out, but white would have been seriously behind in material. \n\nThanks for the game shambobala and setting up this MT. I am looking forward to playing this tournament as white!"
    },
    "url": "https://gameknot.com/annotation.pl/shambobalas-beat-the-c3-sicilian?gm=60515",
    "gameName": "shambobala's Beat the c3 Sicilian",
    "players": "shambobala (1645) vs. russ20124 (1496)",
    "opening": "Sicilian (B22), Alapin's variation (2.c3)"
}