{
    "moves": {
        "1. e4": "Hi again everyone!\n\nSo you were pleased to see Henry and Glenda again!  Great!  In the middle game you will see Glenda take central stage, but will she do enough to win our game.  If you do not want to see the GA spoiler then read on.  Here is the GA. http://gameknot.com/analyze-board.pl?bd=26691742&rnd=0.6955509062582315",
        "1... e5 2. Nf3 d6": "2. ..... d6 - black chooses the Philidor Defense in response to the double KP opening and my knight move.  As I lost a few games against the Philidor it is not a defense you should knock!",
        "3. d4 exd4 4. Nxd4": "4. Nxd4 - exchange variation.",
        "4... Nf6 5. Nc3 c5 6. Nde2 h6 7. f3": "7. f3 - this game starts to transpose into something akin to the Sicilian Naijdorf.",
        "7... Nc6 8. Be3 b6 9. Qd2 a6 10. g3 Be6 11. Bg2": "11. Bg2 - clearing the decks.",
        "11... Rb8 12. O-O": "12. 0-0 - not sure I like the black line-up on the queenside though.  It looks as though black intends to go kingside and I now think that Henry will be safer there too.",
        "12... b5 13. Nd5 Be7 14. Nef4 Bxd5 15. Nxd5": "15. Nxd5 - this knight trade brings my remaining knight to d5 and it is beginning to look like the Naijdorf set up but with my king on the kingside and not the queenside.",
        "15... b4 16. Rab1 a5 17. Rfd1 Ng8 18. Nxe7 Ngxe7": "18. ..... Ngxe7 - I know this means that my knight's outpost on d5 is forfeited but it gives me the bishop pair and now the backward pawn on d6 comes under the hammer.  I overlooked this fact though.  Luckily my opponent gives me a second chance on the next turn.",
        "19. f4 O-O 20. Qxd6 Qb6 21. Qxc5 Qa6 22. Qh5 Qc4": "22...... Qc4 - nasty, nasty.  BQ attacks two pawns and must regain one.  The next few moves are spent trying to trap the BQ.",
        "23. Qc5 Qxa2 24. e5 Rbc8 25. Bd5 Nxd5 26. Qxd5": "26. Qxd5 - knight trade.",
        "26... Qa4 27. b3 Qa2 28. Qe4 a4 29. Rba1": "29. Ra1 - I manage to go two pawns up again thanks to that skewer but my QR is a bit out of play.",
        "29... Qb2 30. Rxa4 Rfe8 31. Rd2 Qc3 32. Qd3 Qb2": "32. .... Qb2 - black continues to decline my offer to trade queens.  Will he regret this?  Read on.",
        "33. Ra6 Red8 34. Qe2 Qc3 35. Rxd8+ Nxd8": "35. ..... Nxd8 - rook trade to relieve pressure on my position.",
        "36. Rd6": "36. Rd6  - it looks as though my c2 pawn is a gonner but if black takes it, I will trade queens and he has to take second.  This will then cost him his knight on d8.",
        "36... Ne6 37. Rd2 g6 38. Kf2": "38. Kf2 - although the queens are still on the board, Henry bravely decides to help hold things together.  Critically Fou Lenoir is now doubly defended by my royal couple and is now only attacked by the BQ.",
        "38... Kg7 39. g4": "39. g4 - now that I have consolidated my position, the seed of a kingside attack is starting to germinate but will black be able to deal with what is coming if he sees it?  Read on.",
        "39... f6 40. exf6+ Kxf6": "40. ...... Kxf6 - this pawn trade leaves King Rui exposed!  I now exploit this on the next move.",
        "41. h4 Re8 42. f5 Nf4": "42. ...... Nf4 - this move looks strong but now Glenda moves from her defensive position to give a very nasty .........",
        "43. Qa6+": "43. Qa6+ ......... CHEEECK!  Well, now that King Rui must deal with the check the knight on f4 is horsemeat!",
        "43... Kf7 44. Bxf4 Qc5+": "44. .... Qc5+ I anticipated this spite check but ascertained that Henry is safe from checks at least for one move on f1.",
        "45. Kf1 gxf5 46. Rd7+ Re7 47. Rxe7+ Qxe7": "47. ..... Qxe7 - rook trade and now another check from Glenda.",
        "48. Qc4+ Kg6 49. Qg8+": "49. Qg8+!!  This move kills black stone dead.  He will either cop Old Matey in a few moves or end up down a queen.  Do you see how?  My opponent did and waved the white flag."
    },
    "url": "https://gameknot.com/annotation.pl/sharp?gm=63954",
    "gameName": "Sharp!",
    "players": "jstevens1 (1701) vs. manhente (1521)",
    "opening": "Philidor (C41), Berger variation"
}