{
    "moves": {
        "1. d4 d5 2. c4 c6 3. cxd5": "So often in chess, we begin with the thought \"What happens if I let him achieve what he seems to want to acheive here?\"  At other times, we say, \"He wants it, so I want to deny him it.\"  Here it was something between these alternatives: He spent some time fortifying the square with a pawn, I would like that move to have been wasted or come along a line he was not intending.  I actually do not know that he felt ill at ease with cxd5, but I do get to retain a certain control of the game flow with this play.",
        "3... Qxd5": "I really expected cxd5, but this does confirm that he preferred the solid pawn structure of the declined exchange to the potentially isolated queen pawn granting play of cxd5.  White would like to force the IQP without incurring one as well which precludes the offer of e4 after cxd5.  I suspect this move could have even been motivated by an examination of my public annotations and recent games which reveal the use of Bg2.",
        "4. Nc3 Qd8": "Understandable, but also suspect.",
        "5. e4": "White had several logical choices: Nf3, e3, e4, and Bf4.  I believe that e4 is most aggressive.",
        "5... e6 6. Nf3 g6": "The interesting choice of the fianchetto here is the seeming ease with which white can limit its scope by e5.",
        "7. Bd3 Ne7": "Is black considering castling kingside with a kingside attack?",
        "8. O-O Bg7 9. Be3 a6 10. Rc1 O-O 11. e5": "As mentioned earlier.",
        "11... b5 12. Ne4 Nd5": "I would love to play Bg5 in response to this, but he has f6 controlled well.",
        "13. Bd2 a5 14. Nd6 Ba6 15. a4 bxa4": "I had made a mistake in my thinking, but it was not too dangerous.",
        "16. Bxa6 Rxa6 17. Qxa4": "Black's queenside thrust has been diffused.",
        "17... Qb6 18. b3 Rd8": "I really do not like the way the game is shaping up--which happens to be the reason to shift gears.",
        "19. Rc2": "?",
        "19... Nb4": "Annoying and accurate.  My placement of the rook was off.",
        "20. Rc4": "20.Bxb4 axb4!",
        "20... Bf8": "21.Bxb4 axb4 22.Qxb4 Bxd6!? ",
        "21. Ne4": "A trade here would somewhat favor black as his bishop was not very active, but the trade also can have unforseen consequences when black may have trouble defending the dark squares around his king.",
        "21... h6": "?  This move weakens the white kingside.  It tempts white to shift the battlefield.",
        "22. Nfg5": "An offer of material as a clearance sacrifice.  Here, I thought, \"He doesn't want me to place a piece on g5; what if I do?\"",
        "22... hxg5": "22... Nd7 deals with the White idea.  Black should reconsider 22... hxg5 because the eventual knight check will make White's attack faster.  Refusing to take the material can be potentially risky too.",
        "23. Bxg5": "I debated about Nf6+ first.  One reason to play the bishop move first is that it can appear at a quick glance to be nothing more than a harassment of the Black rook.  If Black takes the bait, white gains time, and his attack gets rolling.  The reason to play the knight move first is to blockade Black's f pawn preventing an escape avenue for the black king.",
        "23... Rc8 24. Nf6+": "I guess the argument is pointless now about Bxg5 or Nf6+ first.  Black should remove the white knight or pay the ferryman.  White will continue to build a fast attack.  Black cannot prevent the eventual Rh4.  As an aside, http://en.wikipedia.org/wiki/Charon_(mythology) shows the origin of the phrase.",
        "24... Kg7 25. d5": "Once again white offers material to speed up his attack.  Consider instead white's moves f4, Rf3, and Rh3.",
        "25... exd5": "25... Bc5 prolongs the game, but better is Be7 with the idea of killing the knight.",
        "26. Rh4": "Game over.",
        "26... Bc5 27. Bh6+ Kh8 28. Bf8#": "And checkmate by a discovered check."
    },
    "url": "https://gameknot.com/annotation.pl/shifting-the-battlefield?gm=25470",
    "gameName": "Shifting the battlefield.",
    "players": "mokru (1586) vs. monitache (1475)",
    "opening": "QGD Slav defence (D10), exchange variation"
}