{
    "moves": {
        "1. d4": "Notes by sicilianunleash",
        "1... d5 2. c4": "I'm deciding to play Queen's Gambit - my second favorite opening overall (first being Sicilian of course! (duh))",
        "2... c5": "Wow! Esthetically speaking, this just looks so cool! I didn't even know what the opening was called back then. Now that I look it up, I learn that it is called Austrian defence. ",
        "3. Nf3": "Here, the database shows cxd5 as the most popular move. Maybe because after Qxd5, white plays Nf3 and is ahead in developing minor pieces. Or the game can also progress like this - 3)cxd5 Qxd5 4) Nc3! Qxd4 5)Qxd4 cxd4 Nb5! - I think this variation is dynamic and very good for white. But regardless, I chose to play Nf3 because I didn't want to mess up the four pawn structure on the left side of the board. It's something like a deadlock between soldiers before the commence of a HUGE battle!",
        "3... Qa5+": "did I say a deadlock?! The black queen pounces right in to attack my king",
        "4. Nc3": "Here I also had Bd2, but I think Nc3 makes more of a statement in saying that \"You shall not pass\" (sorry had to quote Gandalf here :P ). Bd2 is decent but two knights standing guard to your fortress just has some kickassness to it :P. ",
        "4... e6": "Black wants to open up the bishop diagonal and break white's pawn structure by doing cxd4",
        "5. Bd2": "Here, I just make a threat for black's queen. If my knight moves, the bishop will be ready to snipe the queen. It's best for the black queen to retreat from my black bishop's \"line of fire\". ",
        "5... dxc4 6. e3": "Going to avenge the fallen soldier on c4!",
        "6... Bd6": "I don't know about the placement of bishop here. Black could have tried to hit the white wall by doing cxd4 or something",
        "7. Bxc4": "\"Revenge is the sweetest thing next to getting...\" (sorry had to quote Tupac - Hail Mary here! :P)..but my pieces look awesomely (<-- wow that's a word) positioned right now. ",
        "7... cxd4": "White should develop some more artillery before trying to invade the white camp at this point. A bishop and both knights are still sitting at home squares.  ",
        "8. Nxd4": "Fancier than exd4! :P",
        "8... e5 9. Ne4": "The black queen is in danger now",
        "9... Bb4": "The bishops face off - eye to eye. ",
        "10. Nf5": "The knight makes an incredible jump! It has been sacrificed (not really) to accomplish ulterior motives of capsizing the enemy king. \n\nThe move really helps open the d file for some white queen invasion ",
        "10... Bxf5": "ouch! NOT now I can play Nd6! and avenge my fallen knight!",
        "11. Nd6+": "so i play it...hehehehe",
        "11... Kd7 12. Nxf5": "I could have gone for the rook in the corner, but I was thinking of keeping my knight on the battlefield. ",
        "12... g6": "an attack on the knight?! But is black aware of the lethal attack on the king?!",
        "13. Bxb4+": "BAM, the King has been checked!",
        "13... Kc6": "The king took the wrong step - doesn't matter a lot because the queen falls next turn regardless but Kc8 would have let black king live a bit longer. ",
        "14. Qd6#": "BAM! The black King - very close to his queen - falls. The battle has ended. \n\n\nOHH and comments are welcome guys, please correct me if I have missed out on something. Always something to learn. Hope you guys like the annotations :D. See ya! (Not really, More coming soon)"
    },
    "url": "https://gameknot.com/annotation.pl/short-and-sweet?gm=6604",
    "gameName": "Short and Sweet",
    "players": "sicilianunleash (1200) vs. jperkinsok (1108)",
    "opening": "QGD (D06), symmetrical (Austrian) defence"
}