{
    "moves": {
        "1. e4 e5": "Before this game, both me and my opponent were undefeated, so I didn't know quite what to expect. 1...c5 is my most common response to 1.e4, but sometimes I play other moves.",
        "2. Nf3 Nc6 3. Bc4 Nf6": "I believe that the Two Knights Defense is the most principled response to the Italian Game.",
        "4. d3": "4.Ng5 (The Fried Liver Attack) is of course critical, but most top players today prefer this d3 move, which normally gives a more quiet game. Grandmasters looking for a sharp fight will choose the Ruy Lopez instead.",
        "4... Be7": "4.Bc5 used to played a lot but leads to very quiet, symmetrical positions where white may claim a tiny edge. The text move is more flexible as black can sometimes play d5. Also, there are plans with h6, Nh7, Kh8, f5 and so on.",
        "5. Ng5": "?!  This is dubious at best. The only logical plan connected with it is the advance of the f-pawn. As it follows, that was not white's intention.",
        "5... O-O 6. O-O": "6.f4? was consistent, but black could then strike powerfully in the centre with 6...d5!.",
        "6... Na5": "!  This is the correct punishment of white's opening play, as the e-pawn isn't attacked and white hasn't found time for c3.",
        "7. Nc3 Nxc4 8. dxc4": "Black has obtained the bishop pair and somewhat compromised the white pawn structure. However, at the moment, white has good control of the d5 square and the c5 lever can often be a resource, as we will see later.",
        "8... d6 9. Be3": "?  But this is giving away too much. With the following sequence of moves black will inflict a more serious positional damage.",
        "9... Ng4": "\"Wins\" another bishop, but importantly, e3 will become a major weakness.",
        "10. Nf3 Nxe3 11. fxe3 f5": "?!  I lashed out this move because, to be honest, I thought I would win easily at this point. There was no hurry to open up the position. After, for instance, c6 and Be6, keeping a static game, it would be clear that black has all the positional advantages. One could always play f5 later, after some preparatory moves.",
        "12. Qd5+ Kh8 13. c5": "!  I was only counting on 13.exf5 Bxf5 (c6 might be even stronger) 14.Qxb7 Rb8 15.Qxa7 Rxb2, when black has the better game due to his strong rook on the second rank. With the text move, white is fighting back.",
        "13... c6": "The only serious try for an advantage. After 13...fxe4 14.cxd6! cxd6 15.Nxe4 black might even be worse.",
        "14. Qb3": "After 14.Qd2 I was planning ...d5!? 15.exd5 Bxc5 16.Nxe5 f4! when white is struggling.",
        "14... fxe4": "This was interesting from a psychological point of view. As sometimes happens during a normal game of chess, I decided to go for this move when I saw a beautiful variation attached to it. This time I also thought it was objectively best, since I completely missed white's 16th move. I could definitely have used more time in this critical phase of the game. After 14...f4 there is all to fight for. My feeling is that black is still better in that position.",
        "15. Nxe4": "On 15.cxd6 I had planned the following variation: 15...exf3 16.dxe7 Qxe7 17.gxf3 Qg5  18.Kf2 (18.Kh1 Bh3 19.Rg1 Qh5 wins on the spot) 18...Rxf3 ! 19.Kxf3  Bg4  which is winning in all variations, for instance 20.Kg2 Be6 , winning the queen.",
        "15... d5 16. Nxe5": "!  All of a sudden, white gets an attack with a draw in hand.",
        "16... dxe4": "There is nothing better.",
        "17. Rxf8+": "After a long thought, white eventually played this move, which leads to a forced draw. The attack looked dangerous, but I was hoping he would play on. Let's examine the alternatives: 17.Nf7  Rxf7 and now A) 18.Qxf7 Bg4! and black is fine, since 19.h3 fails to 19...Bxc5 (or possibly even stronger 19...Be2 20.Rf2 Ba6).  B) 18.Rxf7 Bxc5 Now the point is that on 19.Qc3 black has 19...Qg5, while after the more challenging 19.Raf1 black is fine after he finds the accurate 19...b6! 20.Qc3 Qg8 which keeps the material advantage.",
        "17... Qxf8 18. Nf7+ Kg8 19. Nd6+ Kh8 20. Nf7+": "A draw was agreed. A short, but interesting, fight."
    },
    "url": "https://gameknot.com/annotation.pl/short-exciting-draw?gm=14629",
    "gameName": "Short, exciting draw",
    "players": "sandsaver (1534) vs. icehawk (1200)",
    "opening": "Two knights defence (Modern bishop's opening) (C55)"
}