{
    "moves": {
        "1. f4": "This is the miniature of mini-games.  Since most people here seem fascinated with miniatures or spectacular and/or unusually mates, I figured this is a good one to feature.  It is so simple it is often overlooked.  It is both quick and spectacular.  Hopefully you won't see this or any variant of it while playing an experienced player.  I certainly hope you are never on the receiving end of one of these!  It is usually referred to as the \"Fool's Mate\".\r\n\r\nHas this simple mate ever really been played?  Yes, plenty of times.  I've even delivered a number of variants before...because I enjoy teaching people how to play chess.\r\n\r\nIf you haven't come across a variant of this game in real life before, then you have not played enough chess.  When playing beginners, it is not an everyday occurrence but nonetheless it is quite common.\r\n\r\nThe problem arises from white voluntarily opening his e1-h4 diagonal to attack by Black's Queen.  1. f4 is not so bad, but the follow up of 2. g4 is disastrous.",
        "1... e6": "1. ... e6 may not be the best move in of itself, but it does opens an important diagonal for a Queen attack at h4.  He could have played 1. ... e5 too, but that would likely prompt fxe5 and the game would have lasted longer than it did.  Longer versions of this mate are played quite often, but the weakness that creates the opportunity is always the same.",
        "2. g4": "Always be careful when playing the g pawn, especially in combination with the f pawn.  Carelessly playing the king-side pawns can get many players into trouble quickly.  This can happen at most anytime during the opening...so be careful.",
        "2... Qh4+": "Does this need further explanation?\n\nIf it ever happens to you, let it be a lesson so that it never happens again. \n\nThe King cannot move out of check, the attacking piece cannot be captured, nor can another of White's pieces move to block the attack.  It's checkmate.   It's usually not a good idea to move the f and g pawns out together like this. \n\nEither side can perform this mate (likely with additional moves) when those two pawns are move out together.   An open e1-h4 or e8-h5 diagonal when the King is block in by its own pieces provides the opportunity."
    },
    "url": "https://gameknot.com/annotation.pl/shortest-game-possible?gm=10095",
    "gameName": "Shortest Game Possible",
    "players": "Patzer  vs. Alert ",
    "opening": "Bird's opening (A02)"
}