{
    "moves": {
        "1. d4": "Starts conventionally enough.",
        "1... Nf6": "I prevent e2-e4.",
        "2. c4": "This is the most commonly played move.",
        "2... g6": "I usually play this.",
        "3. Nf3": "Perfectly playable, but Nc3 is more common.",
        "3... Bg7": "I completely my fianchetto. ",
        "4. g3": "And he starts his.",
        "4... c5": "Why not invite a Benoni structure? https://en.wikipedia.org/wiki/Benoni_Defense He has ruled out the sharpest lines for white and if his d4 pawn can be induced to advance to d5 then his Bishop on g2 will be blocked.",
        "5. Nc3": "At first he doesn't advance.",
        "5... O-O": "So I castle.",
        "6. d5": "Now he does advance.",
        "6... d6": "So I block any further advance.",
        "7. Bg2": "he completes his fianchetto.",
        "7... Na6": "I have a plan for play b7-b5.",
        "8. O-O": "He castles.",
        "8... Bd7": "All part of the plan.",
        "9. e4": "He grabs the centre.",
        "9... Nc7": "I am threatening b7-b5 now.",
        "10. a4": "So he stops it.",
        "10... b6": "I would have preferred to play a6, but then he has a4-a5! and he can meet b7-b5 with pxp en passant. So I play this first to stop him.",
        "11. h3": "He wants to play e4-e5 but if he plays it immediately then after Nf6-g4! his e pawn is attacked three times (by pawn on d6, bishop on g7 and knight on g4) and he is forced to exchange it and his central thrust has come to nothing. So he plays this first to stop Nf6-g4.",
        "11... a6": "I continue with my plan.",
        "12. e5": "And he with his.",
        "12... Nfe8": "My knight drops back.",
        "13. Bf4": "He supports e5.",
        "13... b5": "I get in my advance.",
        "14. axb5": "He takes.",
        "14... axb5": "I take back.",
        "15. Rxa8": "He exchanges again.",
        "15... Qxa8": "And I take back.",
        "16. Ne4": "My computer prefers b3 or Nd2 to protect c4.",
        "16... f5": "And here my computer prefers the immediate capture on c4. I thought now that 17. exf6 e.p. Nxf6 was good for black as the pressure on d6 has gone and I have a lovely diagonal for my bishop on g7. However my computer points out that white can play 18. Nxc5! with advantage.",
        "17. Neg5": "Thankfully my opponent missed that tactic too. Even so, I think 17. Ne-d2 was better, protecting c4.",
        "17... bxc4": "So I take the offered pawn.",
        "18. exd6": "He takes. Building up the pressure with Re1 was better.",
        "18... Nxd6": "Although exd6 is better for my pawn structure, I wanted to get my knight back into play and connect my rook and queen.",
        "19. Bxd6": "This again is a slight inaccuracy, giving up his attacking bishop and improving my pawn structure.",
        "19... exd6": "So I take back.",
        "20. Ne6": "His knight comes in.",
        "20... Nxe6": "My computer prefers taking with the bishop, but this looked good.",
        "21. dxe6": "He takes back. Now if Bxe6 then 22. Ng5 attacking both my queen and bishop, forcing say Qc8 or Qe8 then 23. Nxe6 Qxe6 24. Bd5 and I am losing my queen, but I have a far better move.",
        "21... Bc6": "This, and his queen is tied to protecting f3.",
        "22. e7": "He attacks my rook.",
        "22... Re8": "I move my rook.",
        "23. Qe2": "He protects his pawn.",
        "23... Bxb2": "This looked good. My computer points out a fascinating variation here. 24. Qe6+ Kh8 25. Ng5 Bxg2 26. Qf7 Bg7 27. Ne6 Rg8 28. Nc7 Qe4 29. e8=Q\tRxe8 30. Nxe8 Qb7 31.\tNxd6\tQxf7 32. Nxf7+ Kg8 33. Kxg2 Kxf7 and white has a rook for bishop and two pawns - probably a drawing balance. For this reason, my computer doesn't like Bxb2 and prefers Kh8, Bf6 or e5.\n",
        "24. Qxb2": "Luckily my opponent didn't see that!",
        "24... Bxf3": "So we go in for this line.",
        "25. Bxf3": "He takes.",
        "25... Qxf3": "I regain the piece.  ",
        "26. Re1": "He protects the pawn.",
        "26... Kf7": "I attack it again.",
        "27. Qb5": "Attcking c4",
        "27... Qd5": "My queen is nicely centralised now.",
        "28. Qd7": "His queen doesn't achieve much here, but it is getting hard for him now.",
        "28... c3": "So I just push.",
        "29. g4": "Rather a desperate king-side fling.",
        "29... c2": "So I push again.",
        "30. g5": "And so does he. I would love to play Qd1 now, but he has 31. Qe6+ Kg7 32. Qf6+ Kg8 33. Qe6+ with a perpetual check and a draw. My computer now suggests the stunning moves Qe4! or Qe5! as the quickest ways of winning.",
        "30... f4": "But this looked good too.",
        "31. Qa4": "Qg4 or Kh2 were better, but black has a massive advantage now.",
        "31... Qxg5+": "So I take.",
        "32. Kh2": "King moves.",
        "32... f3": "Threatening mate.",
        "33. Qa2+": "White throws in a check.",
        "33... d5": "Easily blocked - mate is threatened again.",
        "34. Rg1": "So he stops it.",
        "34... Qxg1+": "Stunning queen sacrifice to finish him off!",
        "35. Kxg1": "He takes.",
        "35... c1=Q+": "I get my queen back.",
        "36. Kh2": "Forced!",
        "36... Qg5": "And another precise move, threatening mate and protecting d4. \n\nMany thanks for reading! Please rate the annotation on the star system and leave a comment or two to let me know how I am doing. Until next time dear reader!"
    },
    "url": "https://gameknot.com/annotation.pl/shropshire-2-v-wood-green-mm-2?gm=62457",
    "gameName": "Shropshire 2 v Wood Green MM 2",
    "players": "Chirag Guta (1922) vs. Charles L Higgie (1945)",
    "opening": "King's Indian, 3.Nf3 (E60)"
}