{
    "moves": {
        "1. e4 c5": "No-one plays this with the idea of Q-side castling, surely?",
        "2. b3": "So, on the basis that the King's going to g8, I get ready to claim the long diagonal towards it. The usual open line 2.Nf3 d6 3.d4 cxd4 seems to help Black out: he's happy to give up his c-pawn for a central pawn. White has also deprived his e-pawn of a pawn defender and must defend with f3. After 4.Nxd4 not only has White moved his one developed piece twice but after it's attacked he must move it a third time, often to b3, since going back to f3 means the e-pawn can't be defended by a pawn at all. You see why I'm confused? But to continue...",
        "2... Nc6": "Since I've advanced my b-pawn Black isn't bothered by 3.Bb5, since the Bishop can be driven back unless White wants to exchange it so early.",
        "3. Bb2": "Clearly the logical follow on from my last move.",
        "3... d6": "Black develops in a more traditional fashion.",
        "4. Nc3": "My plan is to castle Q-side and advance my K-side pawns against what I expect to be the enemy King's defence, so it makes sense to get my Q-side pieces out quickly.",
        "4... Nf6": "Since Black is attacking a pawn that's already defended I kind of get a free move here.",
        "5. h3": "I suppose more logical is 5.Nf3, and this is a little passive. But it stops the Bishop or the Knight going to g4 and, in any case, I want my Knight behind the f-pawn, not in front of it.",
        "5... e6": "Black is playing cautiously in the face of a line that isn't one of the main ones. He could have played 5...g6, getting his dark-squared Bishop onto g7 to challenge along the long diagonal. It's hardly going to find many squares anywhere else!",
        "6. Bd3": "Hoping to be able to push the e-pawn at some point and reveal an attack against h7. Once the central pawns have gone my Bishops will be quite strong, I'm hoping.",
        "6... Be7": "Having kept his g-pawn on g7, this was the only place for this Bishop.",
        "7. f4": "Now I start my pawn advance, and am ready for Nf3 at some point.",
        "7... Bd7": "Black completes his development a little before me, and he can castle next move, while I have to get my Knight out. Despite all this, I'm fairly happy with how the game's going.",
        "8. Nf3": "Curiously, we've now reached a 'book' position, albeit in a roundabout way.",
        "8... Qb6": "I think the point of this is that, should I castle K-side then 9...c4 wins the Bishop with a discovered check. The analysis prefers a more direct attack on the Bishop with 8...Nb5, which rather ties my Queen to defending my c-pawn if I don't want to give up the Bishop and prevents my next move...",
        "9. Qe2": "Getting ready for castling.",
        "9... h6": "Rather a curious move. Possibly Black has decided K-side castling is a little suspect and is preparing to counter my pawns. 9...Nb4 was still on too.",
        "10. g4": "Finally I make my aim crystal clear...",
        "10... O-O-O": "And Black scuttles off to the Q-side. This has quite foiled my plan and maybe I should have kept the K-side pawn advances to a minimum for a little longer.",
        "11. Nb5": "Instead of completing my plan and castling Q-side, I launch this rather foolhardy Knight sortie. My idea was to threaten 12.Bxf6 and if 12...Bxf6 I win the d-pawn and then get a nasty fork on c7. This overlooks lots of other options at Black's disposal, not least that he doesn't have to capture on f6 with the Bishop at all, and that he can in fact just advance the threatened d-pawn. I'm expecting him to attack my Knight with the a-pawn though, after which I can retreat to a3 and look for a post on c4.",
        "11... a6": "He obliges, which rather weakens his already rather ropey defence",
        "12. Na3": "And I stick my Knight on this rather dubious square, when in fact a simple retreat to c3 was better.",
        "12... d5": "And going to c4 is no longer an option; like many players I forget that my opponent gets moves too. I've handed Black a rather dangerous initiative.",
        "13. Ne5": "But he's left a hole for my own Knight. Maybe I can tempt him into giving up one of his King's defenders?",
        "13... Nxe5": "Yes, I can!",
        "14. Bxe5": "Now my Bishop seizes a good central square. Or is it?  14...c4 wrecks my defence; after       5. Nxc4 dxc4 16. Bxc4 Bc6 17. Bd3 Nd7 18. Bxg7 Rhg8 19. Bc3 Nc5 the analysis has Black significantly ahead.",
        "14... Bd6": "However, Black thinks my Bishop is nicely placed, and offers to exchange it.",
        "15. Bxd6": "I'm happy to oblige, since it removes another defender.",
        "15... dxe4": "Craftily, Black takes the opportunity to mix things up a little.",
        "16. Nc4": "But it gives me the chance to get to c4 with a tempo, since I'm attacking the Queen. I've made a few errors, but so has my opponent.",
        "16... Qc6 17. O-O-O": "Finally, I castle, but this is quite wrong; I thought the Bishop on d3 was lost, but 17.Qg2 pins the pawn. Instead I've handed back my material.",
        "17... exd3 18. cxd3": "Ugly, but 18.Qxd3 Ne4 looks dangerous.",
        "18... b5": "Black has the upper hand again, driving away the Knight and opening lines against my King. Nasty.",
        "19. Be7": "Since the Bishop is looking hard to maintain in enemy territory, I offer it as part of an exchange.",
        "19... bxc4 20. Bxd8 Rxd8": "Curiously, Black doesn't play 20...cxd3 first, leaving me a pawn down and with a vulnerable pawn on d2.",
        "21. dxc4": "Instead, he's rather let me close the gap a little.",
        "21... Ng8": "This retreat is a bit of a missed chance, since I get the chance to bring the rather threatened Rook on h1 to a very useful square.",
        "22. Rhe1 Qc7": "Now Black is chasing pawns...",
        "23. Qe4": "I normally find it a little dubious to be defending a pawn with my Queen, but it seems the best option. Remarkably, this is once again a position that has been reached a number of times.",
        "23... Ne7": "More serious mistake than usual; Black really needed to plug that long diagonal with 23...Bc6",
        "24. Qa8+": "Now my Queen has penetrated. I thought the game had swung my way now, as indeed it had, but I still didn't make the best of it...",
        "24... Qb8 25. Qxa6+": "At least I get to nick a pawn. A shame, really, that my King is on the Q-side; my planned advance of K-side pawns has got nowhere and I'm looking at a Q-side pawn advantage!",
        "25... Kc7 26. d4": "Sensing my advantage, I decide to open a file, but 26.Qa3 was more threatening.",
        "26... cxd4 27. Rxd4": "Too soon - 27. Qa5+ Qb6 28. Qxb6+ Kxb6 29. Rxd4 gives me a fine advantage.",
        "27... Nc6": "Instead, Black gets counterplay...",
        "28. Rd2": "And I help him by putting my Rook on the wrong square; it's usually better to have Rooks on the same file or rank, thus 28.Rde4, which I shied away from because of 28...f5 But on d2 it invites 28...Qb4 and the threat of 29...Bc8 is alarming.",
        "28... Bc8": "Instead, Black plays this first, and hands me what ought to have been a winning advantage. Now I can exchange Rooks...",
        "29. Qa3": "Except I don't, getting my Queen out of the line of fire first, and quite missing that after 29.Rxd8 Black must recapture the Rook, since taking my Queen results in the loss of his! Now Black is back in the game...",
        "29... Rxd2 30. Kxd2 Qb4+": "However, not back in so much he can afford to exchange Queens! I guess he imagined that my extra pawns would not be any match for his pieces. Maybe he was right, even though the analysis gives me a big advantage through the Queen exchange.",
        "31. Qxb4 Nxb4 32. a3": "Harrying the Knight seems a good way to start advancing my Q-side pawns.",
        "32... Nc6 33. b4": "Another heads forward!",
        "33... Nd4": "The Knight, however, is determined to cause chaos in my defence; the possibility of forks abound and I must be very careful. Threatened is 33...Nf3+",
        "34. Re4": "This avoids the fork, but not the check, while 34.Kc3 would do both - and defends my c-pawn.",
        "34... Nf3+": "Now I must be very careful where I go.",
        "35. Ke3": "Possibly the worst square I could have picked! Intent on avoiding checks I quite miss the dangers of 35...Bb7 and my Rook has nowhere to go.",
        "35... Ne1": "Fortunately, in this game of errors, my opponent misses it too. The win is still on...",
        "36. Kd2": "I want to trap the Knight, but it can hop around an easily elude me...",
        "36... Nf3+ 37. Ke3": "To blunder once is forgivable; to miss the same threat twice...!",
        "37... Ne1": "Is possibly not so unusual... Black is clearly wanting to draw by repetition.",
        "38. Kd2": "And I have made so many errors and feel so inept at endgames I collude with him and repeat the moves; after the way the game has gone I'm just happy not lose; the better line of 38. Kd4 Nf3+ 39. Kc5 Nd2 40. Re3 is rather beyond me, and even now I'm not convinced I could have played that to win.",
        "38... Nf3+ 39. Ke3 Ne1": "And it was a draw. Possibly we both made so many errors neither of us deserved the win!"
    },
    "url": "https://gameknot.com/annotation.pl/sicilian-defence-and-why-i-dont-understand-it?gm=66237",
    "gameName": "Sicilian Defence - and why I don't understand it!",
    "players": "feathered_tiger (1867) vs. cougarbait (1723)",
    "opening": "Sicilian defence (B20)"
}