{
    "moves": {
        "1. e4 c5 2. Nf3 d6 3. d4 cxd4 4. Nxd4": "A common opening shape for Sicillian with pawns exchanged on d4.",
        "4... Nc6 5. Nc3 Nf6 6. Be3 a6": "with Be3 White develops and protects the d4 Knight. Black defends b5 square.",
        "7. Be2 e5": "Black choses a Najdorf variation, kicking the d4 Knight.",
        "8. Nf3 Be7 9. O-O Bg4": "Black develops pieces actively, hoping to gain compensation for White lost time.",
        "10. Nxe5": "White initiates a Combination, attacking c3 and the g4 square twice. ",
        "10... Bxe2 11. Nxc6": "White has to keep going with this plan,  11.Qxe2 Nxe5 and White sacifice will be in vain.",
        "11... Bxd1 12. Nxd8 Bxc2": "Material may be even, but the game is loosening up.",
        "13. Nxb7 Bxe4": "That's the position after the end of the capturing.",
        "14. Na5 d5": "White needs to be aware of the Knights on the same diagonal, with a DSB lurking.  Black chooses to keep the Bishop up the board.  Also the d-pawn is vunerable and Black needs to get something for it.",
        "15. f3 Bd3 16. Rfd1 Bc4 17. b3 Bb4": "White may have been in a better position with NxBc4",
        "18. bxc4 Bxc3 19. Bb6 Bxa1 20. Re1+": "White at least tries to get a centralised King out of the loss of Exchange",
        "20... Kd7 21. Rxa1 dxc4 22. Nxc4 Rac8": "Black is aware that there are forking opportunities for a roaming Knight.  It doesn't help Black that a King, two Rooks and some pawns will be close together. Black is concious of where to place the rooks in relation to each other and the King.",
        "23. Ne5+ Ke6 24. Re1 Rhe8": "With a discovered check coming Black wanted to threaten immediately after the King moved. An unprotected d6 would be perfect for a White Knight.",
        "25. Ng6+ Kd7 26. Rxe8": "Maybe with two threatened pieces he had to exchange",
        "26... Rxe8 27. Nf4": "Maybe Kxe8 was better?",
        "27... Rb8 28. Bd4": "Another error, White was trying to protect the a-pawn by protecting the a1 and b2 squares but has put his unprotected  B and Knight on same rank.",
        "28... Rb4 29. Bxf6 gxf6": "Some debate about qualities of the Bishor and Knight in Endgame.  For Black,they didn't want to lose a pawn in the Exchange, however White cleverly put paid to that schemme with some quality fork moves, showing the advantages of a Knight in a small area.  The disadvantages came later in try to defend the whole board.",
        "30. Nd5 Rb1+ 31. Kf2 Rb2+ 32. Kg3 Rxa2": "Black clears the way for his a-pawn, Whit King is brought into the action.",
        "33. Nxf6+ Ke6 34. Nxh7": "Whites shows what the Knight can do.",
        "34... a5 35. h4": "because Black has two separate pawn groups,White ",
        "35... a4": "Black maybe getting greedy, 35.Kf5 might put a hole in Whites progress.",
        "36. Ng5+ Kf6 37. Ne4+ Kg6 38. Nc3 Ra1 39. Nxa4 Rxa4": "Black is happy, maybe White could have delayed a capture and tried to sneak some of his pawns further up the board.",
        "40. Kh3 f5": "Black wanting to whittle down White's defence.",
        "41. g3 f4 42. g4": "White has only two active pawns and running out of moves.",
        "42... Ra3 43. Kg2 Ra2+ 44. Kh3 Rf2 45. h5+ Kg5 46. h6 Rxf3+ 47. Kg2 Rg3+ 48. Kh2": "Blockade is broken.",
        "48... Kxh6 49. g5+ Kxg5 50. Kh1 Kg4 51. Kh2 Kf3 52. Kh1 Rg6 53. Kh2 Rg7 54. Kh1 Kf2 55. Kh2 Rh7#": ""
    },
    "url": "https://gameknot.com/annotation.pl/sicillian-najdorf?gm=46789",
    "gameName": "Sicillian Najdorf",
    "players": "1700  vs. 1600 ",
    "opening": "Sicilian (B54)"
}