{
    "moves": {
        "1. e4 c5 2. b4": "Left wing gambit - uncommon but good for white players who do not like the sicilian",
        "2... cxb4 3. a3": "Common line",
        "3... d5": "Black doesn't take",
        "4. exd5": "... so that white does.",
        "4... Qxd5": "Queen on the center",
        "5. Bb2": "Occupying the big black diagonal",
        "5... Nc6": "developping",
        "6. Nf3": "developping as well",
        "6... e5 7. c4": "Challenging the queen, the aim is to get advance in developpement.",
        "7... Qe4+": "Probably not a good move. It doesn't prevent white's developpement and the queen will quickly be under menace",
        "8. Be2": "enabling the castle",
        "8... Nd4": "Black carries on attacking, moving twice the same piece for the second time.",
        "9. Bxd4": "Exchaning a piece that moved twice against a piece that moved once.",
        "9... exd4": "Black is better on the center, has material advantage but is in late in developpement",
        "10. d3": "To fire the queen, protect c4 and block d4",
        "10... Qf4": "Black keeps his queen in white's territory, pressuring but dangerous.",
        "11. O-O": "King in safe",
        "11... bxa3": "Moving the same piece twice for the third time",
        "12. Nxa3 a6": "to prevent 13. Nb5",
        "13. Nc2": "menacing d4, it's white's next target",
        "13... Bc5": "The following moves will all be aiming at d4, wether for attack or for defense",
        "14. g3": "To fire the queen",
        "14... Qf6": "Carrying on protecting d4",
        "15. Re1": "I longly hesitated befor playing this move.",
        "15... Ne7": "enabling the castle",
        "16. Bf1": "The bishop can come and protect the f knight and frees the e rook",
        "16... O-O 17. Ncxd4": "If 17. ... Bxd4 18. Nxd4 Qxd4 Rxe7 and white wins the trading sequence",
        "17... Nf5": "Challenging d4",
        "18. Nc2": "Lancelot is brave but not foolhardy. retreat is sometimes better.",
        "18... Be6": "To free the a rook.",
        "19. d4": "Now that white has get rid of d4, he wants to conquier the center.",
        "19... Nxd4": "Mistake",
        "20. Ncxd4": "Logical",
        "20... Rad8": "Pinning the knight to the queen",
        "21. Re4": "Protecting the knight to keep the material advantage.",
        "21... Rxd4": "Trading but white will conserve his advantage",
        "22. Nxd4 Rd8": "The knight is still pinned but white has material advance",
        "23. Rf4": "\"Best defense is attack",
        "23... Qe5": "Only place if black wants to carry on pressuring the central knight.",
        "24. Ra5": "Not dangerous, for white has material advantage and cn afford to trade a rook against a bishop.",
        "24... b6": "Mistake",
        "25. Rxa6": "25. Rxc5 was also available. But this move is very dangerous for black because it the black rook moves, 26. Ra8+ and there is mate in 3 moves...",
        "25... g5": "... So that black gives space for his king, menacing the rook.",
        "26. Nxe6": "! The game is finished, black is doomed and submits because the mate is unavoidable for\nif 26. ... Rxd1 27. Ra8+ and black is mate in 3 moves.\nif 26. ... Qxe6 or 26. ... fxe6 or 26. ... gxf4, 27. Qxd8+  with huge advantage for white and mate to follow."
    },
    "url": "https://gameknot.com/annotation.pl/sicilian-left-wing-gambit?gm=53543",
    "gameName": "Sicilian - left wing gambit",
    "players": "ptitroque (1817) vs. logus (1833)",
    "opening": "Sicilian (B20), wing gambit, Marienbad variation"
}