{
    "moves": {
        "1. e4 c5 2. Nf3 g6": "Signalling Black's intention to play the Accelerated Dragon",
        "3. Bc4 Bg7 4. c3 Nc6 5. d4 cxd4 6. cxd4 a6 7. O-O b5 8. Bb3 Bb7 9. e5 e6": "Not only supports the d5 square but also closes down the diagonal for White's light squared Bishop",
        "10. Be3 Nge7": "Eyeing both f5 and d5",
        "11. Nbd2 Nf5": "I took the decision to win the Bishop pair",
        "12. Re1 Nxe3 13. Rxe3 Qb6": "Putting pressure on White's centre.  The d-pawn cannot advance with hanging the e-pawn",
        "14. Nf1 O-O 15. Ng3 Ne7 16. Rc1 Rac8 17. Rec3 Nd5 18. Bxd5 Rxc3": "Clearly not 18. Bxd5?? losing to Rxc8",
        "19. Rxc3 Bxd5 20. a3": "Not really necessary",
        "20... Qb7": "Allowing the Rook to come to c8 and perhaps some potential for play along the a8-h1 diagonal",
        "21. Ne2 Rc8 22. Nf4 Rxc3 23. bxc3 Bxf3 24. Qxf3 Qxf3 25. gxf3": "Exchanging into an endgame with the better minor piece; with play on both sides of the board the Bishop should be able to outplay the Knight",
        "25... Bf8": "Pushing the a-pawn and thereby allowing Black to capture it is an unstoppable passed pawn that will eventually Queen",
        "26. Nh5": "?? but I missed it!",
        "26... Bxa3 27. Nf6+ Kg7 28. Nxd7 Bb2 29. Nc5 Bxc3 30. Nxa6": "The position is now easily won for Black",
        "30... Bxd4 31. f4 Bc3 32. Kg2 b4 33. Nc5 Kf8 34. Kf3 Ke8 35. Ke4 Kd8 36. Kd3 Kc7": "A better plan for White may have been to create counter-play on the kingside",
        "37. Kc4 Bd2 38. Nd3 Kc6 39. Nxb4+": "The last mistake after which White could have resigned",
        "39... Bxb4 40. Kxb4 Kd5 41. f3 Kd4 42. h4 Ke3 43. Kc5 Kxf3 44. Kd6 Kxf4 45. Ke7 Kxe5 46. Kxf7 Kf5 47. Kg7 e5 48. Kxh7 e4": "White resigns"
    },
    "url": "https://gameknot.com/annotation.pl/sicilian-accelerated-dragon?gm=51079",
    "gameName": "Sicilian; Accelerated Dragon",
    "players": "sonny575  vs. Iohannes7 ",
    "opening": "Sicilian (B27), Hungarian variation"
}