{
    "moves": {
        "1. e4 c5 2. Nf3 g6 3. d4": "White immediately challenges Black's central control.",
        "3... cxd4 4. Qxd4": "Black cannot play Bg7 lazily without thought or else he loses both bishop and rook.  With the knight immediately threatened, black cannot trap the queen in the corner depriving white of the queen for the immediate future.  The problem is that the queen provides a tasty target once the forced Nf6 is played.",
        "4... Nf6 5. e5 Nc6": "And the f6 knight gets away.",
        "6. Qa4 Nd5 7. Qe4": "If 7... e6, then 8. c4.",
        "7... Nc7 8. c4": "Oddly enough white plays c4 anyway.  Three possible reasons for the move exist.  These include limiting the scope of the c7 knight, hoping for a knight outpost at d5/b5, or c5 followed with bringing the bishop to bear upon f7 via Bc4.  Black has enough tempo to easily escape the bishop threat.  And without preparation, black could drive a knight from either of the potential outposts with simple pawn moves.",
        "8... Bg7": "Planning on challenging the advanced e pawn while preparing to castle.  Advancing the e pawn further only gives it away for free.  If the e pawn falls, then White's b pawn becomes painfully pinned.  White is controlling more space, but black is more secure in the immediate future.",
        "9. Bf4": "The b pawn was already secure for the moment.  I would have preferred development.  Because there isn't a good place for White's light-squared bishop, the knight on b could be developed.  White might be tempted to castle queen-side, but the likelihood of black eventually placing a rook on c8 should temper this desire.",
        "9... O-O": "I perhaps should have considered b6, but there is nothing wrong with the move here.",
        "10. c5": "One promising, plausible alternative is 10. Qe3 threatening to exchange dark squared bishops.  The pawn on c4 would prevent Nd5 challenging the Queen (without the pawn, the continuation would probably favor White, but without the pawn White could not force the exchange).",
        "10... Ne6": "This primarily accomplishes two things:  The Black queen has been freed, and it forestalls for some time --maybe even permanently-- exchanging dark-square bishops.  If white plays Qe3 threating to exchange, black can simply play Nxf4.",
        "11. Bc4 Qa5+": "Capturing the pawn with the queen undermines the hold on e5.  Black can bring pieces to capture it faster than white can support it.  I like bringing out the queen when she cannot easily be captured and when she helps reduce the power of the opposing queen.",
        "12. Nbd2": "I was expecting Bd2.  The e pawn is already lost.",
        "12... Qxc5 13. O-O Nxf4 14. Qxf4 Nxe5 15. Rac1": "Anticipating this move made me think quite a bit before I played Nxe5, but I had a solution in mind.",
        "15... Nxf3+": "I didn't like exchanging the perfectly good knight, but defending it seemed complicated.  Now there is nothing to defend, and I can simply try to find the best square for the queen before Bxf7 .",
        "16. Nxf3 Qb6 17. Rc2 e6": "I didn't want to walk into a nasty pin after 17... Bxb2 18. Rb1!,  so I had to find something to improve the position.  My advantage so far is the dark square bishop, so I decided to attempt to minimize the influence to White's only bishop.",
        "18. Re1 d5 19. Bb3 Bd7 20. Ne5": "I didn't anticipate this, and it almost cost the advantage I had.  Perhaps I should have traded, the dark square bishop for the knight, but I really wanted its power to be felt...",
        "20... Bc6": "It's hard to call this a mistake because even now I see problems after 20... Bb5 21. Rec1, but it certainly wasn't the game I was hoping for.  Closing the c file seemed like a good way to give me time to manuever my rooks into play, and I was hoping he wouldn't exchange.",
        "21. Nxc6 bxc6 22. Qd6": "Well, Qxc6 was impossible, but even so that queen is marginalizing any advantage I have.  I want her gone.",
        "22... Rac8": "My c6 pawn is holding for now.",
        "23. Rec1": "I could see before this that saving the pawn wasn't an option which ironically ends up saving the pawn.  I came up with a crafty challenge to his queen that maintains rough equality and possibly an advantage, and although I didn't find the best line which definitely brings about an advantage until later analysis, it's clear my opponent did see the bigger threat.",
        "23... Rfd8": "The continuations are as follows.\r\n24.Rxc6 \r\n[a] 24... Rxd6 \r\n[a1] 25.Rxc8  Bf8 is very good for Black netting 3 points for a total of 5 points up.\r\n[a2] 25.Rxb6 Rxc1 ! producing a forced mate.\r\n[b] my original 24... Qxc6?? which leads to rough equality.\r\n",
        "24. Qg3": "A queen move was definitely forced.",
        "24... c5 25. Ba4 Bd4 26. Qd3 c4 27. Qd2 Bg7": "Better was Rc7.  Cautious play can be dangerous too!",
        "28. b3 Rc7": "There's more to this move than at first glance.",
        "29. bxc4 Rxc4 30. Rc2xc4 dxc4 31. Qe2 c3 32. Bc2": "The final mistake.",
        "32... Rd2 33. Qf3 Qb2": "White resigns."
    },
    "url": "https://gameknot.com/annotation.pl/sicilian-almost-losing-control?gm=18078",
    "gameName": "Sicilian - almost losing control",
    "players": "eweng (1476) vs. mokru (1493)",
    "opening": "Sicilian (B27), Hungarian variation"
}