{
    "moves": {
        "1. e4": "This game was played in Sicilian Dragon mini-tournament, which I founded in order to learn something of this opening.",
        "1... c5 2. Nf3 d6 3. d4 cxd4 4. Nxd4 Nf6 5. Nc3 g6": "This was the initial position of the tournament.",
        "6. Be3 Bg7 7. f3": "White chooses a sharp continuation, the Yugoslav Attack.",
        "7... Nc6": "Black can play 0-0, but my opponent had something different in his mind.",
        "8. Qd2 Ne5": "!? This is by no means a 'book-move' (as far as I know!). It seems a little suspicious to move queen's knight second time when king is still in centre and queen bishop in his original square. In my view, the best part of this move is that it should take the game out of well-studied theory of the Dragon.",
        "9. h4": "White's standard plan is to play h4-h5xg6 and Bh6, so this move is necessary in many cases. Maybe solid 0-0-0 would have been slightly more accurate, but in this game it would've came sown in exactly the same thing.",
        "9... a6": "Preparing to advance b-pawn and denying b5-square from white pieces. Maybe black is trying to keep white's light-squared bishop out of a2-g8 diagonal, so in case of castling and white playing h4-h5xg6 black can take back with f-pawn, keeping a-file closed. However, I think black should've castled or moved his bishop, since now he drops behind in developement. ",
        "10. O-O-O Bd7 11. g4": "White doesn't want to commit his king bishop yet and continues the pawn-storm. ",
        "11... Rc8": "With this natural move black shows that he isn't afraid of white's pawn storm and tries to make nonsense of it by keeping his king in the centre. ",
        "12. h5": "Chancing plan in this stage would make no sense at all",
        "12... Nc4": "?! This is a bad move, and I'd like to think that the whole game is just showing how much lose of two tempi effects in the Dragon. After this move, the game transposes in a sharp line of Yugoslav attack with 9.Bc4, with white having two extra tempi and black having played h6 instead of 0-0. \n\nIn the line with 9.Bc4, black often want's to exchange it by ...Ne5 and after white had played Bb3 only then force the exchange with ...Nc4.",
        "13. Bxc4": "White is happy to part with his king bishop, since he gets quite an attack as compensation.",
        "13... Rxc4 14. hxg6 fxg6": "Black now hopes to get to castle, move his queen and play Rc8",
        "15. e5": "! But he never gets the time. White hits in the centre and all of a sudden, black king isn't feeling very safe at all",
        "15... Nxg4": "Black obviously can't play 15...dxe5 in view of 16.Ne6, but this sacrifice just can't give him enough compensation. The alternative ...Ng8 would hardly be satisfying either.",
        "16. fxg4": "white has no reason not to take the knight",
        "16... Bxe5": "16...Bxg4 would not have frustrated white's plan, although it may have been slightly stronger.\n\nNow it seems that black gets three pawns for the piece and try to exchange pieces and advance his kingside pawns. I felt that although black had sacrificed, I shouldn't give him the initiative for free, and decided to play actively instead of going passive with 17.Rdg1 or something.",
        "17. Qd3": "This move looks quite modest, but is actually quite good, since it improves queen with tempo.",
        "17... Qc8": "Black isn't willing to retreat his active rook, but maybe 17...Qc7 would have been bit safer. ",
        "18. Rxh7": "! This is what I was planning when I played my last move.",
        "18... Rxh7": "Black has nothing better",
        "19. Qxg6+ Rf7 20. Rf1 Bxd4": "A blunder, but black was lost anyway. 20...Bf6 and white has a pleasant choise between 21.Ne4 and 21.g5 (I think Ne4 is bit stronger). The problem is, for black, that he just can't step out of the pin and his rook is gone: 20...Kf6 21.Bh6 ; 20...Bf6 21.Ne4 and white has too much threats, for example Rxf6 followed by Nxd6  pocketing the queen.",
        "21. Qg8+": "It's mate next move."
    },
    "url": "https://gameknot.com/annotation.pl/sicilian-dragon?gm=3329",
    "gameName": "Sicilian Dragon",
    "players": "moppa (1774) vs. newbrad (1850)",
    "opening": "Sicilian (B75), dragon, Yugoslav attack"
}