{
    "moves": {
        "1. e4 c5 2. Nf3 Nc6": "Slightly less common than 2...d6; both prevent the further advance of the e-pawn, but this develops a piece, albeit one that can be attacked - and probably exchanged, if White wishes - by 3.Bb5.",
        "3. d4": "But I'm in orthodox mode today.",
        "3... cxd4 4. Nxd4 e6": "A bit passive, I would have thought; 4...Nf6 attacks the pawn and 4...e5 attacks the Knight; this just prepares the way for the dark-squared Bishop and cuts off the diagonal to f7.",
        "5. Nc3": "Clearly the best square for this Knight, defending the e-pawn, even though it can be pinned by the Bishop.",
        "5... a6": "Instead Black plays this little pawn move made famous by Nadjorf all those years ago. It guards against a Knight going to b5. But does it always?",
        "6. Be2": "There's nowhere else reasonable for this Bishop; with the pawn on e6 6.Bc4 is rather pointless.",
        "6... g6": "This creates rather a lot of holes on the dark squares. It doesn't look too bad to me, though the computer loves 7.Nxc6 dxc6 (why not bxc6) 8.Qxd8 Kxd8 9.Bf4",
        "7. Bf4": "I just play the Bishop to f4. I'm not keen on early Queen exchanges; I have rather a decent attack building and it seems a shame to dissipate it.",
        "7... Nge7": "Maybe Black has seen some danger in the previously quoted line and wants to cover the Knight on c6. But this is a serious error.",
        "8. O-O": "However, I just get my King to safety - surely only a computer would work out  8. Ncb5 axb5 9. Nxb5 Qa5+ 10. Bd2 Qb6 11. Nd6+ Kd8 12. Nxf7+ etc, proving that the pawn on a6 can't always be relied upon.",
        "8... Bg7": "Black plugs the hole on g7 and threatens my centrally placed Knight.",
        "9. Be3": "Sometimes you just have to go forward, instead of wasting a tempo guarding a piece just because it's in the middle of the board; there was nothing wrong with 9.Nxc6 Nxc6, even if it did rather give Black what he wanted.",
        "9... O-O": "Black has got his King away, and his position isn't bad, if a bit cramped.",
        "10. Qd2": "Preparing to go, in rather knee-jerk fashion, to h6 to attack the Bishop.",
        "10... Nxd4": "Black has other ideas, though; he'll surrender the dark-squared Bishop, but remove my central Knight. Not sure this is good for Black.",
        "11. Bxd4 Nc6 12. Bxg7 Kxg7 13. Rad1": "I get my Rook behind the Queen and those dark squares beckon, especially d6.",
        "13... b5 14. a3": "Maybe I could have gobe to d6 right away, but I wanted to nip in the bud any ideas of driving away my Knight, which doesn't have too many places to go.",
        "14... Qb6": "Black is trying for some counterplay on the Q-side.",
        "15. Qd6": "But it has let my Queen into his territory.",
        "15... Rb8": "Getting ready for a pawn push, perhaps?",
        "16. b4": "I stop that, but I'm worrying unneccesarily; I have a strongly placed Queen that should be supported by 16.e5. Black should now play 15...f6 to stop such an advance.",
        "16... Qd8": "Instead he scuttles back to the back rank, and slowly I get a grip on the game.",
        "17. f4": "I have other options; 17.Rd3, getting ready to build up in the centre perhaps.",
        "17... Qe7": "Understandably, Black wants a Queen exchange.",
        "18. e5": "If he wants one, it will be at the cost of a rather annoying pawn or Rook.",
        "18... Qh4": "This was a surprise, and I'm not sure what the idea was.",
        "19. Ne4": "Those dark squares beckon again, especially f6.",
        "19... Qe7": "Perhaps Black was hoping for 19.g3, just to weaken my position? Anyhow, he's back, after that exchange again.",
        "20. Nf6": "While I leap happily into the black hole.",
        "20... Rb7": "Black needs to bite the bullet and exchange Queens.",
        "21. Bf3": "For now I pin the Knight and force his hand and win a pawn...",
        "21... Ra7 22. Bxc6 Qxd6 23. Rxd6 dxc6 24. Rxc6": "Better to keep my Rooks united with 24.Rfd1, but I'm happy with my pawn.",
        "24... Rd8": "Even though it means the Black Rook seizes the open file.",
        "25. Rd6": "However, I tempt Black into an exchange that doesn't win him the Knight as he perhaps hoped...",
        "25... Rxd6 26. Ne8+ Kf8 27. Nxd6": "And my Knight has a wonderful post. Once again, the computer saw 25. Rf3 Bb7 26. Rc7 Bxf3 27. Rxa7 Bc6 28. Rxa6 Rc8 and I didn't, but allowing that Bishop to skewer through the Rooks is possibly something no-one would have fancied?",
        "27... Rc7": "Black has little going for him but to attack my undefended pawn.",
        "28. Rc1": "I defend it; I don't think of allowing it through with 28.c4 bxc4 29.Rc1 and it falls anyway. I want all the pawns I can keep.",
        "28... Bd7": "The Bishop doesn't have too many ways to get out.",
        "29. c4": "Now I advance the pawn.",
        "29... bxc4 30. Rxc4 Rxc4 31. Nxc4": "I'm only a pawn ahead, but it should be enough even for an endgame duffer like me.",
        "31... Ke7 32. Kf2": "The Kings head for the middle of the board, as they should.",
        "32... Bb5 33. Nd6": "My Knight gets back onto that lovely square. I have nearly all my pawns on black squares, so I can't see the Bishop being much of a threat.",
        "33... Bc6": "I get a few things wrong now...",
        "34. Kg3": "Keeping my pawns apart is one. 34.g5 keeps them together.",
        "34... f6": "Obviously, Black needs to reduce my pawn count.",
        "35. Kh3 fxe5 36. fxe5": "Fortunately I have another ready to step into its place.",
        "36... h5": "May advantage is on the Q-side, so I try to eliminate the K-side pawns.",
        "37. g4": "Again, the analysis prefers a rather counter-intuitive measure of 37.Kh4, giving up the g-pawn to the Bishop in order to head forward with the King.",
        "37... Bf3 38. g5": "I take an opportunity to put my final pawn on a black square. It's going to be difficult for the Black King to get through soon.",
        "38... Kd8": "It must head to the Q-side, leaving my Knight to roam.",
        "39. Kg3": "I chase away the Bishop...",
        "39... Bd5 40. h4": "And those K-side pawns aren't going anywhere. I'm aware I have a big advantage, but I need to Queen a pawn to win.",
        "40... Kc7 41. Ne8+": "I'm driving the King to where it wants to go, but I'm aiming at that h-pawn; with the Black e-pawn blocking the Bishop's route to g8 I can give up the Knight for the pawn on h5.",
        "41... Kc6 42. Nf6 Bb3": "I don't really pay much attention to the Bishop going here...",
        "43. Nxh5 gxh5 44. g6 Bc2 45. g7 Bh7": "Until I realise how it can manouvre to cover the Queening square. For a moment I was a little worried that yet again I'd blown a won end game. But I needn't.",
        "46. Kf4": "The KIng can advance unhindered to assist.",
        "46... Kb5": "Black's King is also going to win my pawns, but I will Queen first by some margin.",
        "47. Kg5 Ka4 48. Kxh5": "Important to take this first.",
        "48... Kxa3 49. Kh6 Bg8 50. Kg6 Kxb4 51. h5": "Now the two wing pawns start to advance...",
        "51... a5 52. h6 a4 53. h7 Bxh7+ 54. Kxh7 a3 55. g8=Q": "As I expected, mine Queens first.",
        "55... a2 56. Qg4+ Ka3 57. Qxe6": "I can actually afford to allow the Black pawn to Queen...",
        "57... a1=Q 58. Qa6+ Kb2 59. Qxa1+ Kxa1": "Why try to stop it when I have another one ready?",
        "60. e6 Kb2": "Black chases but the game's over.",
        "61. e7 Kc3 62. e8=Q Kd4 63. Qc6 Ke5 64. Kg6 Kf4 65. Qd5 Kg3 66. Qe4 Kf2 67. Kg5 Kf1 68. Qc2 Ke1 69. Kf4 Kf1 70. Kf3 Ke1 71. Qe2#": "Finally it's over!"
    },
    "url": "https://gameknot.com/annotation.pl/sicilian-defence?gm=66246",
    "gameName": "Sicilian defence",
    "players": "feathered_tiger (1881) vs. friedrich_chess (1769)",
    "opening": "Sicilian (B32), Flohr variation"
}