{
    "moves": {
        "1. e4 c5": "1...c5. The Sicilian.  Depending on White's response, good second moves include 2...Nc6, and 2...d6.  But as you can see from the next sequence, the best way to defeat the early Bc4 is with a slow build-up of strong pawns.",
        "2. Bc4": "2. Bc4?  The early Bishop.  White attempts to stake a further claim to the pivotal d5 square while ignoring the fact that neither of his developed pieces are defended.  This isn't a preferable second move, as most continuations follow 2. Nf3, developing the Knight to a natural square and still claiming a part of the centre.",
        "2... e6": "A move with a double purpose.  2...e6 both defends the weak f7 and threatens 3...d5, an encounter that will leave Black a bishop up and much more developed.",
        "3. Qf3": "3. Qf3?  A bad move.  The early Queen would be a danger if 2...e6 had not been played to protect f7.  Now the Queen has taken a natural square from the Knight and, although worth keeping an eye on, is not actually an active threat.",
        "3... Nf6 4. Ne2": "With the f3 square occupied by the Queen, White's Knight is forced to make an odd move.  Not bad in itself, but leaving few good next moves.",
        "4... a6": "4...a6.  Building up towards forcing away White's bishop.",
        "5. d4": "5. d4.  White ignores the impending threat to his bishop and instead makes a good thrust to the centre with the d pawn.  In most Sicilian games, the d4 is played much earlier on (with the Queen still on the d-file) in order to destablise Black's pawn structure.",
        "5... b5": "5...b5.  Black ignores the d4 pawn to finally press on White's Bishop which now has very few good options (and in fact will be lost no matter where he retreats).",
        "6. Bb3": "Forced.",
        "6... c4": "6...c4!  Bearing similarities to the Noah's Ark trap, Black has forced White's bishop into a corner from which he cannot escape.",
        "7. Bxc4": "The only good move.  White ensures that the Bishop at least goes down fighting, leaving Black with an eventual hanging pawn.",
        "7... bxc4": "7...bxc4.  The pawn chain pays off. Black is two pawns and at least two tempos up, although the pawn on c4 is hanging, and his pieces are hardly developed.",
        "8. Nec3 Nc6 9. Be3 Bb7": "9.  Bb7?  A risky construction for a later discovered attack;  Black does not notice that if White plays 10. e5 to threaten the Knight and Bishop simultaneously, Black will lose his material advantage!",
        "10. Qe2": "Thankfully, White does not press the pawn forward but retreats his Queen from the threat (and prepares to remove the hanging pawn).",
        "10... Qa5": "10...Qa5?!  On the face of it, a bad move.  Black attempts to pin the Knight to the King, but the Queen itself is hardly threatening enough.  However, her real purpose will become clear shortly.",
        "11. O-O": "The sensible move.  White sidesteps the pin and places his King into a solidly defended castle.",
        "11... d5": "11...d5.  Black attempts to set wheels in motion by claiming the heavily fortified d5 square -- normally pivotal in Sicilian defences.",
        "12. exd5 Nxd5 13. Nxd5 Qxd5": "13...Qxd5!  The Queen's purpose revealed.  Black aligns the Queen and light-square bishop with White's castle, preparing for a possible mate in two.",
        "14. Nc3": "A good move, but not as solid a defence as 14. f3 or the Queen exchange.  White attempts to threaten Black's Queen, but does not expect...",
        "14... Nxd4": "14...Nxd4!  A double discovered attack.  If White has not spotted the threat to his King and plays 15. Bxd4 to protect the Queen, Black wins with Qxg2#.  ",
        "15. Nxd5": "And if White ignores the threat to his own Queen to take Black with 15. Nxd5...",
        "15... Nxe2+": "15...Nxe2!  Black responds in kind, at the same time placing White in check.",
        "16. Kh1 Bxd5": "16...Bxd5!  Black justifies the Queen exchange by solidifying his advantage in material.",
        "17. Rfe1": "A good move.  The Knight now has nowhere to go, and so Black abandons it to play...",
        "17... c3": "17...c3.  At first glance the pawn is not a threat, and White continues with the Knight capture.",
        "18. Rxe2 cxb2": "18...cxb2!  The pawn threatens bxa1 and promotion, followed by a back rank mate in three.",
        "19. Rb1": "Practically forced.  The Rook blockades the pawn, but will now have to babysit it for the rest of the game.",
        "19... Ba3 20. Bd4 Rb8 21. Bxg7": "21. Bxg7??  White lashes out, threatening Bxh8 and preventing the castle, but what he has really done is...",
        "21... Rg8": "...bring the second Rook into play...",
        "22. Be5": "...by creating an open file for...",
        "22... Bxg2+": "22...Bxg2 !!",
        "23. Kg1": "Forced.  Black now dangles the option of retreating the Bishop to f3, placing the King in a discovered check while winning the Rook on e3.",
        "23... Rd8 24. f4": "24. f4??  White tries to threaten Rxg2, but opens the diagonal for...",
        "24... Bc5+": "24...Bc5 !  White's only option now is to block the check.",
        "25. Rf2": "Forced.  Black no longer has to worry about the threat to his light-square Bishop, and practically all of White's pieces are immobilised.",
        "25... Rd2": "Black now threatens Bxf2#.",
        "26. Rbf1": "The only reasonable move.  White attempts to reinforce the f2 square, at the risk of leaving the b2 pawn free to promote itself.",
        "26... Bxf2+": "26...Bxf2 !  The final nail in the coffin; White resigns.  If he recovers with Rxf2, Black promotes the pawn on b1 into an immediate check, blockable only by Rf1, which inevitably leads to Qxf1#.\r\n\r\nThe early Bc4 essentially leaves White a piece and several tempos down from the opening, which allows Black to establish a strong discovered attack and gain another piece advantage.  Finally, the errant pawn of the original defensive chain proves to be the key piece of the game by both keeping White's Rook out of play and by continually threatening promotion and check.\r\n\r\nPlease feel free to message me with any comments about this game or the annotation!"
    },
    "url": "https://gameknot.com/annotation.pl/sicilian-game-defending-against-2-bc4?gm=3808",
    "gameName": "Sicilian Game: Defending against 2. Bc4",
    "players": "peck (1306) vs. bzbright (1269)",
    "opening": "Sicilian defence (B20)"
}