{
    "moves": {
        "1. e4": "(Forgive me, this was a real-time game and I accidentally closed out the window after I copied it down, so I lost my opponents name. Anywho, the game)\nKing's Pawn Opening, standard stuff.",
        "1... c5": "The Dynamic Sicilian",
        "2. Nf3 d6 3. d4": "My opponent opts for the Open Sicilian, thank god as I despise playing almost all anti-Sicilian lines.",
        "3... cxd4 4. Nxd4 Nf6 5. Nc3 g6": "The Dragon Variation, my favorite cut-throat variation.",
        "6. Be3": "Signals the Yugoslav Attack variation. In this variation of the Dragon, white often aims to play f3 first to prevent any ...Ng4 ideas to trade off the DSB. Then white will play Qd2, O-O-O, and Bh6, removing the vital kingside defender. After all this, he will launch a devastating pawn storm with g4, h4, etc., opening up files to the Black king. However black shall not simply sit back and let this happen, and he wants to play moves such as Nc6 and Bd7 to develop, and then Rc8 (utilizing the half open c-file), move the queen to the queenside and then play b5, looking for counter-play on the opposite flank. This almost certainly leads to very dynamic and fun games, where it can end up being who gets to the king first!",
        "6... Bg7 7. f3": "Preventing Ng4 as I said.",
        "7... O-O 8. Qd2 Nc6 9. g4": "!? This is a less played move here, as white usually plays either Bc4 or O-O-O. However this is a very playable line, as it often turns out to be very positional and dare I say, drawish. Now I didn't play the Sicilian Dragon variation to look for a draw, and seeing as this was a fun game I decided to try out a newish and controversial move in this line",
        "9... Bxg4": "!? I sacrifice my lesser than bishop to try to blow open White's defenses and play for the win. Now might I say this line is probably not sound at all, as with good defense White will come out winning once Black's attack fizzles. But this line requires a decent knowledge of the theory that follows, and very natural moves often end up getting rolled over by Black's fast attack.",
        "10. fxg4 Nxg4": "The critical position. I have 2 pawns for the piece, as well as a great pawn chain, and I am now ready to exchange off White's dear e3 bishop. Plus development is extremely easy, and soon enough, my attack will hopefully run as a smooth engine.",
        "11. O-O-O": "?? Nononono, my opponent did not consider carefully enough the dangers of this position. Surely he didn't think I was going to sacrifice my piece for merely 2 pawns! Here White should have tried 11. Nb3!, which gets out of the powerful a1-h8 diagonal my \"dragon bishop\" is radiating over, and regrouped from there. However, now I get to play a nice tactic which all but seals up the game. See if you can spot it!",
        "11... Nxd4": "This move seems silly, as 1) exchanging when you are down material is rarely a good option and 2) now White can challenge my control of the strong diagonal. How will I achieve any counterplay now?! Well you see, at this very moment the a1-h8 diagonal isn't quite the most important one, and diverting White to that diagonal allows me to take the one he previously occupied.",
        "12. Bxd4": "? Had white seen the following move he would have simply realized he dropped a piece and continued playing, but now the game is done",
        "12... Bh6": "!! One of the great points of this piece sacrifice is the knight on g4 now supports the bishop possibly coming to this diagonal, and in this case it does so in a convincing fashion. With the queen pinned, my win is virtually inevitable.",
        "13. Kb1 Bxd2 14. Rxd2 e5": "Taking control of the center with tempo",
        "15. Bg1 Qg5": "Bringing my pieces into action. Simply being up material isn't enough to be able to kick back, enjoy a beverage and forget the game! No, you must use your advantage and bring out your extra pieces to the fight!",
        "16. Rd1 Ne3": "White is forced to exchange off this knight for one off his bishops. When you are up material, it is often good to exchange material and then go into an endgame, where your material will be significantly more pronounced than in the middlegame.",
        "17. h4": "Hoping I hang the knight.",
        "17... Qf4 18. Bxe3 Qxe3 19. h5": "A decent attempt to try and get some sort of play, now he hopes I take this pawn, opening up dangerous files to my king.",
        "19... g5": "Of course I avoid this.",
        "20. Rxd6": "Yes he has won a pawn back, but he is down 4 points anyway, and now he is forced to exchange off this rook after...",
        "20... Rad8": "! Now white must take on d8, which would be utterly losing anyway, as I would still be up major material, but now with an open d file and back row mate possibilities.",
        "21. Rh6": "?? The game is lost anyway, but this simply leads to mate in two",
        "21... Qe1+": "Here my opponent resigned, as after 22) Nd1 (the only legal move) either 22)...Qxd1# or 22)...Rxd1 is checkmate.",
        "22. Nd1 Qxd1#": "For example. I really hope I get more experience in this line, as this seems like a decent surprise tactic when I really want a good game. Sacrificing on g4 will surely wake White up and force him to play accurately, or he will perish very quickly. I hope you enjoyed the annotation, thanks for viewing!"
    },
    "url": "https://gameknot.com/annotation.pl/sicilian-dragon-interesting-piece-sacrifice?gm=44820",
    "gameName": "Sicilian Dragon, interesting piece sacrifice",
    "players": "? (???) vs. go4broke (1450)",
    "opening": "Sicilian (B76), dragon, Yugoslav attack, Rauser variation"
}