{
    "moves": {
        "1. e4": "This is my first annotated Game, plz feel free to comment... Enjoy !!",
        "1... c5": "I really hate it when someone plays against me the Sicilian Def...",
        "2. b4": "And this is why I intend to reply in an uncommon way; the Sicilian wing gambit... \n",
        "2... cxb4 3. a3 e6 4. f4": "Sicilian defense wing gambit doesnt get the atention it deserves, its maybe not the best opening in Sicilian but is best way to get your oponent out of his comfort zone.",
        "4... Nc6 5. Nf3 Nf6 6. e5 Nd5 7. axb4 Nxf4": "I think that this was his first mistake, I believe that Bxb4 was a very good move for black, now I have two moves (b5 , d4 ) which force him to defend and give me the control of the center.",
        "8. b5 Ne7 9. d4 Nfg6 10. Bd3": "Preparing for 0-0.",
        "10... d5 11. exd6 e.p. Qxd6": "I thought that this trade would open a lot of lines ,giving me a lot of advantage especially that his K-bishop is paralyzed even buried.",
        "12. O-O Bd7 13. Nbd2": "His queen is a little bit vulnerable so I develop my pieces while targeting his... I must say that now i think that 13.c4 is a little bit superior.",
        "13... Nd5 14. Nc4 Qb8": "... Qc7 was better i guess.",
        "15. Ng5": "And I saw an attacking chance that would uncover the black king ... Started by targeting the weak K-pawn.",
        "15... f6": "And he did play f6?? :)",
        "16. Qh5": "There is no defense... (16...f5 17.Nxh5 Nde7 18.Ba3 very powerful attack)",
        "16... fxg5 17. Bxg6+": "hxg6 is devastating for Black.",
        "17... Kd8 18. Bxg5+ Ne7": "18... Be7 instead of ...Ne7 would have prevented the following sacrifice.",
        "19. Qxh7": "And here it is, Plz comment if you feel that it is an unsound sac. ",
        "19... Rxh7 20. Rxf8+ Kc7 21. Bf4+": "Mate in one to follow...\nI hope you enjoy, as I did."
    },
    "url": "https://gameknot.com/annotation.pl/sicilian-wing-gambit?gm=47165",
    "gameName": "Sicilian Wing Gambit",
    "players": "joseph88 (1843) vs. ??? (???)",
    "opening": "Sicilian (B20), wing gambit, Marshall variation"
}