{
    "moves": {
        "1. e4": "First move for the Sicilian Defense.",
        "1... c5 2. Nf3": "Stopping him from taking e5.",
        "2... d6 3. d4": "Challenging him on c5.",
        "3... cxd4 4. Nxd4": "Took his pawn to capture control of the center.",
        "4... Nf6 5. Nc3": "Reinforcing e4.",
        "5... g6 6. Be3": "Reinforcing d4 and blocking moves on his king-side.",
        "6... Nc6 7. f3": "Reinforcing e5 with the pawn.",
        "7... h5 8. Qd2": "Super reinforcing all my pieces (c3, d4, e3, g2)",
        "8... Nxd4 9. Bxd4": "Took his knight since he was trying to take back the center, which he won't. ",
        "9... Bh6 10. Qf2": "He tried to take my queen, but that isn't going to happen.",
        "10... O-O 11. Bc4": "Pushing for his king's pawn at f7, but not really. Just trying to put the pressure on him.",
        "11... Nh7 12. Bxa7": "Trying to keep queen-side open, hoping he will move his bishop to give me room to try and checkmate.",
        "12... Be6 13. Bb6": "I am hoping he moves his queen with all this pressure I am putting on his side.",
        "13... Qb8 14. Bxe6": "Getting rid of his pieces. He doesn't need them right? :p",
        "14... fxe6 15. O-O": "Castled.",
        "15... Bg7 16. a4": "Making a move to reinforce my position on his side at b6.",
        "16... e5 17. Nd5": "Protected my bishop on b6.",
        "17... Nf6 18. Nc7": "He now sees what I am doing and is trying to stop me.",
        "18... Nxe4 19. Qe2 Nf6 20. a5 Kh7 21. b4 Ra7 22. Ne6 Ra8 23. Nxf8+ Qxf8 24. Bf2 Qe8 25. c4 Qd7 26. h3 g5 27. b5 e6 28. a6 Rb8 29. a7 Ra8 30. Qd3+ Kg8 31. Qg6 Qf7 32. Qxg5 Kh7 33. Qd2 Bf8 34. b6 Kg8 35. c5 dxc5 36. Qg5+": "First check of the game. (He is bending to the pressure. )",
        "36... Qg7 37. Qxe5 Nd7 38. Qe4 Nf6 39. Qxe6+": "Second check. He can't seem to stand the Dragon Variation at all. ",
        "39... Qf7 40. Qe5 Nd7 41. Qc7 Kg7 42. Qxb7": "Trying to capture his rook.",
        "42... Rb8 43. axb8=Q": "He made a big mistake, letting me get a second queen.",
        "43... Nxb8 44. Qxb8": "Of course he took it because he realized he messed up.",
        "44... Kg6 45. Ra7": "Challenging his queen.",
        "45... Qg7 46. Qe8+": "Third check of the game.",
        "46... Kh6 47. Be3+": "Fourth check.",
        "47... Kh7 48. Qxf8 Qxa7 49. bxa7": "He messed up again, taking his queen.",
        "49... Kg6 50. a8=Q": "Getting a third queen of the game. My win is inevitable now.",
        "50... h4 51. Qe4+": "Fifth check. Boxing him in.",
        "51... Kh5 52. Qxc5#": "Checkmate! \n\nThe Sicilian Defense is the most popular defense for black against the e4 push from white. The Dragon Variation is the most aggressive and sharpest line that black has in the Sicilian Defense.\nWhite has many options that he can respond with. The most common is the Yugoslav Attack but this is a double edge sword. White will castle on the queen side, black will castle on the king side and both will have very sharp options to attack their opponents king. This is one of Magnus Carlsen’s favorite lines and has had much success playing as black, opening up the defense white has on the queen side.\nSome of the other options white has are the Classical Variation, the Levenfish and the Harrington-Glek.\nMy personally favorite line is the Levenfish. With the idea in mind to attack the king side of black, white makes an early aggressive push with his f pawn to f4. This poses many problems for black and is forced to mix up his normal developement to defend the e pawn from white pushing forward.\nThere are so many exciting lines in the Dragon Variation of the Sicilian Defense, it is a must study for any chess player.\n\nI highly recommend using this at any level of chess play. But do be cautious as it is very hard to use, and one wrong move and you're giving the game away."
    },
    "url": "https://gameknot.com/annotation.pl/sicilian-defense-dragon-variation?gm=63554",
    "gameName": "Sicilian Defense - Dragon Variation",
    "players": "Kluskie  vs. guest3453 ",
    "opening": "Sicilian (B72), dragon, 6.Be3"
}