{
    "moves": {
        "1. e4 c5 2. Nf3 d6 3. d4 cxd4 4. Nxd4 Nf6 5. Nc3 a6 6. Be3": "one of the most dangerous setups against the Sicilian. White is very clear about his intent to over run black on the king side with a quick g2-g4-g5. ",
        "6... e6 7. Be2": "developing the bishop and supporting the g2-g4 push. This also prevents black from playing Nh5-Nf4 which you see occurring in many Sicilian games. ",
        "7... Be7": "The a solid but semi passive approach that develops the bishop and prepares to castle king side. Which in my opinion is risky because white's whole game is on the king side so often if black does not play accurate can get crushed very quickly. If I were playing this game I would have opted for the alternative 7. ...Qc7 with the plan of mobilizing the queen side as quickly as possible and planting a knight on c5. For example, 7...Qc7 8. Qd2 Nbd7 9. g4 h6 is relatively unexplored territory. Which is kinda weird for the Sicilian. ",
        "8. f4": "a very active move that takes advantage of the fact that black is playing somewhat passive. Furthermore, there is some major dangers for black in ignoring his queen side development. Especially since the most common way for black to handle white's king side attack is to create a strong attack on the queen side. When playing the Sicilian one must take on the attitude of the boxer. When your opponent punches right you punch left. So sitting back and playing \"sound positional\" chess usually lands you in hot water. For me the warning signals are already going off for black here because g4 is coming and black has virtually no counter play against it.   ",
        "8... O-O": "Standard move but castles into the up coming storm. However, the alternatives are slightly less successful in practice. They are ...Qc7 and ...Nc6. Perhaps this speaks volumes about this whole 7...Be7 line for black. ",
        "9. g4": "White is almost completely developed compared to black whose whole queen side is still on the bench.  ",
        "9... d5": "The best way to deal with a wing attack is to counter in the center. The only issue I have about this move for black is that it deflects a key defender away from the king and gives almost no hope for a win. Black is essentially playing for a draw. ",
        "10. e5 Nfd7 11. g5": "white keeps up with the pressure and methodically continues with his plan. Still unless white can manage to create a chink in black's armor there is no winning formula. ",
        "11... Qc7": "developing the queen but I think the more active 11...b5 is preferable. At very least black has a chance to create some much needed activity on the queen side with for example, 11. ...b5 12. a3 Bb7 13. 0-0 Nb6+=",
        "12. Bd3": "This sets up brilliant tactic on h7 in combination with Qh5. ",
        "12... Nc5": "Hum, at first glance this looks like a good move. But White's follow up refutes this as it exploits black's king safety issue. I have to admit that it is very hard to provide an improvement to this move. However, based upon the results of this game and my over the board analysis perhaps black can hope for 12. ...Rd8 13. Qh5 g6 14. Qg4 Bb4 15. h4 Bxc3 16. bxf3 Qxf3+ 17. Ke2 being unclear. But the main point of 12...Rd8 is that it allows the d7-knight to go to f8 defending the king side. In such situations the knight is a much better defender than the rook. ",
        "13. Bxh7+ Kxh7 14. Qh5+": "White gives up the bishop for a very powerful initiative and advantage on the king side. ",
        "14... Kg8": "It looks like black will walk away with 2 pawns in his pocket. But in Sicilian initiative counts for a lot. ",
        "15. O-O-O Ne4": "The oh no moment for black as I am sure he realized that 15...g6 fails to the 16. Qg4 and 17. h4 combination. This move leads to a clear advantage for white. Best in my opinion is to allow white to try his luck on the king side via. 15...Rd8( takes real ball to play this) 16. g6 fxg6 17. Qxg6 Bf8 aiming for the queen exchange later on. As exchanging the queens would reduce white's chances of a win. ",
        "16. Nxe4 dxe4 17. Rhg1": "now black is forced to play ...g6 with major holes on the king side and no real defenders are in sight. ",
        "17... g6 18. Qh4": "planning the Rg3-h3 to threaten mate on h8 ",
        "18... Rd8": "black has to move his rook to give the king an escape route",
        "19. Rg3 Bf8": "meeting the direct threat with ...Bg7 next move. But the bishop is in a tomb",
        "20. Rh3 Bg7 21. Bf2": "Bf2 is to give white the option of playing Rc3 after Qh7+",
        "21... Nc6 22. Qh7+": "it is all over, white has a decisive advantage on both sides of the board. ",
        "22... Kf8 23. Rc3": "In summary, black played a near perfect game. White just simply was able to take advantage of a couple slight oversights that lesser mortals would have gotten away with. The most telling feature of this game was the issue of king safety as black through out the game did very little to slow the white advance on the king side. While at the same time doing little to create counter chances on the queen side. This necessarily does not mean black should loss but it does mean that his life is made much harder if he ignores whites' king side overtures. It is telling that for most of the game black's queen side forces remained undeveloped. Finally, it is difficult to pin point the exact point where black went astray but maybe the line 7. ...Be7 needs to be reexamined in favor of 7...Qc7 8. Qd2 Nbd7 9. g4 h6. Another possible improvement may come on move 12 where black played 12. Nc5 going for activity but ultimately taking a key king side defender away from where it is needed the most. This is why I suggest 12...Rd8 allowing the d7-knight to come back to the defense of the king quickly via f8.      "
    },
    "url": "https://gameknot.com/annotation.pl/sicilan-keres-at-its-best?gm=61533",
    "gameName": "Sicilan Keres at it's best!",
    "players": "high (2651) vs. trickyknight (2637)",
    "opening": "Sicilian (B90), Najdorf, Byrne (English) attack"
}