{
    "moves": {
        "1. e4": "A Karpov once quoted \"learn from your mistakes\". So, I decided to annotate all my loses - in the hope I can learn from those that have won against me.\nAnnotation starts at move 7 as all moves prior to this are book anyway.",
        "1... c5 2. Nf3 Nc6 3. d4 cxd4 4. Nxd4 Nf6 5. Nc3 d6 6. Bg5 e5 7. Ndb5": "ECO - B33 - all standard moves so far.\nA major alternative here is Bxf6 - B60.",
        "7... a6": "Standard, just about any other move here fails. Reason? \n7. ... Be6 allows white to play Bxf6 with Nd5 - fork on c7. Taking knight allows white to play exd5 - cramping blacks position.\nh6 - why? white is going to take the knight anyway. Wasted tempo.\n7. ... Be7 8.Bxf6 - looses the d pawn. Black has to play gxf6 otherwise white takes the d pawn and the black bishop is \"stuck\" behind the pawns.\n7. ... Bg4 8.f3 any bishop move, Nd5 ... same problem as stated. \nLeaving the knight on b5 usually leads to trouble.",
        "8. Na3": "Two main lines here:\nNa3 or Bxf6.",
        "8... b5": "Be6 is the main line here. Wish I had played it now.\nBe7 is another alternative.\nh6 as noted previously\nNd4 - seems premature to me as black has not finished piece development.\nLesson: after this game, it seems to me, that the d5 square is the critical one. (Be6)",
        "9. Bxf6 gxf6 10. Nd5": "Why not! There is lots of potential for Knight forks.",
        "10... f5": "One of the key moves for black in this line.\nOther moves tried are Be6 & Bg7.",
        "11. Bd3 Bg7": "11. ... Be6 appears to be the main line here. 11. ... f4 looks like an interesting alternative.\nFrom a 1.5 million game search I could only find 8 games. \nResults 4, 3, 1 (white wins, black wins, draws)\nA good point about 11. ... Be6 is exf5 fails to Bxd5.\nIMO Bg7 achieves little as it will be a long time before the h8 - a1 diagonal \"opens up\".",
        "12. exf5": "A good response to Bg7.\nSeems to me that Black is a pawn down for little gain.\n\nI found the following game:\n[Date \"1994.??.??\"]\n[White \"Gonzalez Alberto H\"]\n[Black \"Del Carril Jose Maria\"]\n[Result \"1-0\"]\n[ECO \"B33\"]\n1. e4 c5 2. Nf3 Nc6 3. d4 cxd4 4. Nxd4 Nf6 5. Nc3 e5 6. Ndb5 d6 7. Bg5 a6 8. Na3 b5 9. Bxf6 gxf6 10. Nd5 f5 11. Bd3 Bg7 12. exf5 Qa5  13. c3 b4 14. Be4 bxa3 15. b4 Qd8 16. f6 Bh6 17. Qh5 Bf8 18. Ne7 Nxe7 19. fxe7 Bxe7 20. Bxa8 Qc7 21. O-O Bb7 22. Bxb7 Qxb7 23. Rab1 Rg8 24. g3 Qe4 25. Rb3 Rg5 26. Qd1 h5 27. Re1 Qc6 28. Rxa3 h4 29. Qa4 Qxa4 30. Rxa4 hxg3 31. hxg3 f5 32. Kf1 d5 33. Rxa6 e4 34. b5 Rh5 35. b6 1-0",
        "12... Qa5+": "The problem here is that I have to keep any \"eye\" on c7 - i.e. Nc7 & Nxa8 if the Queen moves from the d8-a5 diagonal.\n \nOtherwise Qg5 would be great!\n\n0-0 is no good as the Qf3 would create a dark squared bind around the black king - & f6 looks awful.",
        "13. Qd2": "I was expecting c3.\n",
        "13... b4": "12. ... b4 is my first major mistake. Fritz10 plays Qxd2 in this position.\nI had my mind fixed on Qxd5, but as played by Beefyness, Be4 keeps the pawn and stops Black's attack dead.\nFritz10: (with a comment \"this is the best way to fight back\")\n13... Qxd2  14. Kxd2 Ra7 15. f6 Bh6  16. Ke1 Bb7 with a slight advantage to white.\n",
        "14. Be4": "This is not good for me, the Knight on c6 is hanging and there is a potential skewer or pin on rook at a8.",
        "14... Bh6": "This shame sacrifice doesn't work as it leaves Whites Queen in a too good a position. I had completely missed 16. b4\nBetter would have been \n14... bxa3 15. Qxa5 Nxa5 16. Nc7 Ke7 and accept being the exchange down.",
        "15. Qxh6 bxa3+": "There is not a lot else to do as Black is a piece down.\nI was a tad lazy in my analysis of this position. I had only considered c3.\n16. b4 is a very good move in that it forces black to play Nxb4 leaving the rook vulnerable to the bishop on e4.\nAND Nf6, Qg7 as other \"goodies on offer\".\nFritz10 gives this position  - \n",
        "16. b4": "Ouch!",
        "16... Nxb4": "Just about any other move is slow death. \n(e.g 16... Qd8 leaves 17. Nf6  & 18. Bxa8)",
        "17. Nf6+": "Hmm .... free rook - tasty!",
        "17... Ke7": "Forced - Kd8 18. Qg7 & Qxf7 / Nxe8 (assuming rook is moved here) to follow",
        "18. O-O": "Good move, now I really do have no attack and the rook is hanging.\nKing in the centre, 3 white pieces about to weave a mating attack ... I could have resigned at this point.",
        "18... Bxf5": "18... Bxf5?\nHoping for a mistake (or two)\nThe main threat here (as far as I can see) is 18... Rb8 19. Qh4 / Qg5 or Qg7 with  a potential mating attack.\nFritz10: \n18... Rb8 19. c3 Qd8 20. cxb4 Qf8 21. Qh4 Kd8 with  - (White is a minor piece up & has a good attack. Note that all of Black's pieces are on the back rank).\n\n18... d5 was the only other real try here. I didn't like the idea as it opened up the centre allowing White's rook(s) access to my king.\n19. c3 and I lose a piece anyway (or get mated or lose the k-side rook & king still has no place to hide)\n18... d5 19. c3 Nc6 20. Nxd5  King move & Rd1, Qg7 OR Q - h4/g5\nAnd all of this because 11... Bg7  / 14... Bh6",
        "19. Bxf5 Nd5": "I figured that if I could swap the Knights off then I might have a chance at a draw. ",
        "20. Rab1 Ra7": "20... Ra7?\nAnother losing move ... the last! \nRb8 was the only move here.",
        "21. Nxd5+ Qxd5 22. Qg5+": "22... f6 fails to Qg7 & Ke8 / Kf8 fails to Rb8  "
    },
    "url": "https://gameknot.com/annotation.pl/siclian-pelican-sveshnikov-b33?gm=14471",
    "gameName": "Siclian : Pelican - Sveshnikov (B33)",
    "players": "beefyness (2309) vs. sermillion (1721)",
    "opening": "Sicilian (B58), classical"
}