{
    "moves": {
        "1. Nf3 d5 2. c4 Nf6 3. e3 e6 4. a3 Be7 5. d4 O-O": "Early castling. So, hoping to attack the white side quickly.",
        "6. b4 b6 7. Bb2 Ba6 8. Nbd2 Ne4": "Bit offensive !",
        "9. b5 Bb7 10. Nxe4 dxe4 11. Nd2 a6 12. a4 axb5 13. axb5 Rxa1": "Attacking the white side.",
        "14. Qxa1 Nd7 15. d5 exd5 16. cxd5 Bxd5 17. Bxg7": "White side is offensive too !",
        "17... Re8 18. Bd4": "Here, do not need to move the Bishop. A move is wasted. If black side Bishop will be moved to f6 then they can be exchanged.",
        "18... Bf6 19. Be2 Bxd4": "As expected it happened. Bishops will be exchanged !",
        "20. Qxd4 Nf6 21. O-O Qd6 22. f4": "Too aggressive ! Black side may get little advantage.",
        "22... exf3 e.p. 23. Bxf3 Rd8 24. Bxd5 Nxd5 25. Qg4+": "Not  good move ! Black Queen can protect the King and may be pawns will get better positioning.",
        "25... Qg6 26. Qxg6+ hxg6": "yes, it happened. Now, black side is ina better position to attack the opposition.",
        "27. h4": "Missed ! Forgot about e3, Horse is looking to kick it away.",
        "27... Nxe3": "Not only that but also white rook has to move. Otherwise, ... ",
        "28. Rf2 Ng4": "Further attacking !",
        "29. Re2 Rd7": "It looks like Black is protecting c7 and f7 from the white rook. That time I do not want to change my structure. White pieces got locked somewhat and if white rook is moved black rook will do with the white horse.",
        "30. Ne4": "Bad move ! Leaving the black rook to threaten the white King ! ",
        "30... Rd1+ 31. Re1": "Nice ! White side has only option of moving a piece without quiting the game.",
        "31... Rxe1#": "It's all over. kapila is on top with steering the Black side. I think it is a nice game. Apart from the simple mistakes I think both sides did well but black side is smarter ! "
    },
    "url": "https://gameknot.com/annotation.pl/simple-mistake-would-give-big-troubles-in-a-chess-game?gm=37074",
    "gameName": "Simple mistake would give big troubles in a chess game",
    "players": "jbknijff  vs. kapila ",
    "opening": "Reti opening (A09)"
}