{
    "moves": {
        "1. c4": "Unlike with Jack or someone like me, I don't know how Nathan will open.  Usually, he also plays the KPO, but has played QPO where I played the Slav with his QG.  If I recall correctly, I think he once played the Rita Opening.  But, this time, he opted for the English Opening.",
        "1... e5": "Of course, I knew how to respond, as well with what I know about the Sicilian.  Of course, that dates back to my agenda with Precalc.  So, it then became a question of what he would play next.",
        "2. g3": "This sort of took me by surprise, but I see the point since it develops.  I anticipated 2.e4 for the same reason.  But, I like what Nathan plays better since I would like a nice long diagonal for my B.  This is why I often like to do a fianchetto.",
        "2... Nc6": "But, I've got my mind on developing a piece, right away.",
        "3. Nc3": "Nathan's also thinking along the same line.",
        "3... Nd4": "I didn't even realize that I played this.  The truth is that I didn't even think about or remember this game, until I went into my notebook.  I played this just to get the N in the center, as I was thinking in terms of space advantage.  But, I don't like the choice I made since I could've spent the time developing something else, as opposed to, just moving the N for that reason.  It's not a good reason since mate wasn't threatened, and nothing else was being attacked here.  I also had plans of playing ...d6, as the idea behind that, would be to allow ...Bf5 where I'm threatening to fork on c2.  Of course, that idea came from Jack as noted in my profile which isn't good.  If I had this position, nowadays, I'd quick play 3...Nf6, in this position.",
        "4. Rb1": "But, Nathan saw what was coming and rightly protected.",
        "4... Bb4": "Feeling like I was starting to fall behind in development, I quickplayed this.  I don't know how wise this is since I was corrected a while back for doing something like it.  But, I was thinking in terms of terms of Spanish Opening since, of course, 3.Bb4 is played.  The only reason I switched to the Italian Opening is that I don't like what I think is the Stalz defense, where black plays 3...a6  As the only way to prevent having to exchange LSB for N is for white to quick play 4.Be2 which loses time and didn't end well for me.  I just wasn't comfortable with that, but the Italian is similar but in a more passive way.  And, I don't have to deal with that nuicanse.  Plus, there are other things that I like as well.  Instead of, for example Jack's bad advice of 4.Ng5?!, after 3...Nf6, I simply like the idea of castling.  As it's the same factor of doing it right after black plays the Berlin Defense which I understand from the wrong person (the one that I'd later block.)  In part, I like castling early, but it's mainly that after 4.0-0, I don't lose a pawn.  For, if 4...Nxe4, I remembered that white can play 5.Re1, ending his problems.  But, the concept here is that it appears, as aggressive as, the Ruy Lopez.  And, if Nathan was to play 5.a3, I would not have that same inconvience that I'd have in that opening. ",
        "5. Nd5": "But, there was a small surprise that he had for me.  As noted above, I had anticipated 5.a3, but he did it this way.  Naturally, I considered retreating since I generally don't like exchanging.  On the other hand, I was comfortable doing so here since I'm up a Q, as my logo is, of course, liquidation which Susan also noted in her commentary with Alexandra Botez.  That is why I decided to protect with 5...c5, instead.",
        "5... c5 6. e3": "Not surprisingly, Nathan isn't willing to let me do that which is why he attacks again.  This is what I thought that Nathan would do on his previous move, as I mentioned.  And, my response would've still been the same.  As I generally protect by going back to the original square where I developed it.",
        "6... Nc6 7. a3": "Having said that, I'm not surprised that Nathan played this.  What I also meant by I would not have that same inconvenience that I'd have in that opening is that I had a ready answer.  So, this was the equivalent to a conditional move.  As I was prepared for when he did this, and my thinking was, right then and there, that if Nathan attack, I'll just retreat to a5 which is what happened.  ",
        "7... Ba5 8. b4": "As this was what's known as a conditonal move if you do it online.  For some reason, we don't call it that in OTB games, except for me.  I call it that because I'm just ready for it, and I anticipated him play b4, right after I retreated to a5.  The idea being is that when he'd do this, I'd be ready to exchange pawns on b4.  And, after he answers with axb4, then I'd go back to c7, where I have both of my B's well placed on the c file.  I got this idea from a training game between adivela and steppenwolf, where adivela used a very similar idea to teach chess.  The idea that I developed from this was having both of my B's, right on top of each other.  I was also trying to allure Nathan into liquidating his Nd5 since I walked right into the attack.  But, I sort of knew that he wouldn't budge being behind.",
        "8... cxb4 9. axb4 Bc7 10. Ne2": "I anticipated 10.Nf3 here, but I think that Nathan made the right decision.  As I would've quickplayed 10...e4, which would force him to bring his N on the rim with 11.Na4 in order to avoid losing another piece.",
        "10... Nge7": "My natural response is to continue developing and prepare to castle, in such a way that it threatens liquidation.  Actually, that'll be forced, and it's something that I considered after Nathan develops and prepares to castle.",
        "11. Bg2 O-O": "But, I decided to get my K to safety first.  It's hard to know which is better, but when by my gut which told me to do this.  The reason being is that after 11...Nxd5 12.cxd5, I'm either forced to bring my N on the rim with 12...Na5, or undevelop it back to it's original square.  Even on the rim, I felt that Nathan might be able to find a way to prevent me from castling.  He probably wouldn't have, especially since I also have ...Ne7 which will happen. But, I asked myself why I should even chance it.  As he has played moves that have taken me by surprise.  In one or two cases, his surprises is what stopped me from doing so which just wasn't good.  I figured that this, however, would stop Nathan from bringing his K to safety.  As my anticipation was that he'd play 12.Nc3 to prevent what I'm about to do, liquidate.  And, my answer to that would've likely been 12...a6 to open up a file for my R and prevent 13.b5  I realize now that attacking on b5 would've been of no concern because Nathan would've done so earlier, if it were.  But, once he castles, that's when go forward with my liquidation plan.",
        "12. O-O Nxd5 13. cxd5 Ne7": "As now, even if Nathan did have something else planned, my K is tucked away which is what I like, even if, I'm go to overboard with castling early.",
        "14. Bb2": "Completing his development.",
        "14... d6": "And, I'm prepared to do the same.",
        "15. f4": "I was surprised to see this move played.  I would not have even taken this or f3 into consideration because of what I know about TA's blitz Q sac and the Domiano's Defense.  That is with the f pawns which is critical, but I have seen the f pawn advance in the KG.  And, although I don't know what the opening is called, I've also seen 1.f4 played.  So, it then becomes a question of when else it works, but this is one of those times.  Now, I thought about exchanging f4, but the idea of liquidation does not apply with pawns.  And, I would've captured in hope that he recaptures with 16.gxf4 or 16.exf4  But, he could and probably would do it with 16.Nxf4 which I didn't want.  As I believe that his N would be better placed, giving him a more comfortable position which I wasn't going to allow.",
        "15... Bf5": "So, I decided to go after his R, instead, keeping in mind that my development is also complete.  And, once he protects, I'm ready to half pin keeping in mind that he's queenless.  For a split second, I thought that I'd win more material, but I also kept in mind that Nathan will very likely have a way to prevent that, which he does.",
        "16. Rc1 Bd3 17. Rf2": "And, when I looked at how, I realized that he could move his R.  That was also the equivalent to a conditional move.  As I figured out that I had a discovered attack on d5 with 17...e4  It's important to note that I usually miss something like this but not here.  As I'm still thinking in terms of making things difficult.  I was wondering how Nathan would handle this.  There's also a little more to this as I thought about exchanging on e2.  But, doing this would've allowed Nathan to win back a pawn right away which is also went into my following move. ",
        "17... e4 18. Nc3": "By playing this which makes perfect sense since e4 is now attacked twice.",
        "18... Nf5": "I wondered what to do here.  But, I decided to mobilize my Q or Rf1.  As I was thinking that if Nathan takes on e4, I'd be ready to either get the pawn back or win something else.  I calculated a variation that started with 19...Re8, and I asked myself what would happen now.",
        "19. Nxe4 Re8 20. Ng5": "It's this move.",
        "20... Qe7": "So, I get my Q involved since I have the similar idea.  Of course, I'm thinking about what I can do with his e3 pawn and trying to come up with a way to unleash an attack.  I didn't think it would work, but I had something like ...Bb6 in mind, as well.",
        "21. Rc3": "But, first Nathan attacks.  On the other hand, I play continue with my plan on my 22nd move.",
        "21... Bb5 22. Nf3 Bb6 23. g4": "But, this stops me.  Now it's about what to do, and I generally wouldn't even consider bringing my N on the rim.  On the other hand, I decided that it works here if I'm trying to get Nathan to further liquidate.  I thought that he would prevent that with 23.Ng5  But, to my surprise, he allows it and exchanges it.  Although I shouldn't be, I felt pretty comfortable of getting, at least, a draw here if nothing else.  But, I wasn't going to make the same mistake that I've made before, by getting my hopes up.  As that's where I've gone wrong by becoming overly confident.",
        "23... Nh4 24. Nxh4 Qxh4 25. g5": "I didn't know what Nathan intended to do here.  I thought that he might try to get a passed pawn, and then, perhaps, protect with his Bg2.",
        "25... Qg4": "Therefore, I pin, to prevent that.",
        "26. Rc1": "Stopping a threat that I intended to make.  It's important to note, however, that I had 26.Rc8?? notated.  I then realize, wait, that's not possible, but it would against Jack since he's made blunders like that.  But, Nathan wouldn't, and I looked at what else was played after that which wouldn't have been possible with that move.  And, that's where I realized that this is what he played which makes perfect sense. ",
        "26... Ba4": "As I was thinking in terms of trying to come up with a threat against Nathan.  In particular, it was walking into the same pin that he has now.  As I was thinking in terms of 27...Qd1??  But, I then remembered that his Rc1 stops this, and it wouldn't have worked out, anyhow.  Even without it, he can use his other R and play Rf1.  I also considered saccing my B for 2 pawns with 26...Bxe3, where he's left with an isolated pawn.  But, I just didn't know how well this would work out and wasn't going to chance it.  As I'd rather have all of my pieces on board, if possible. ",
        "27. h3": "He goes on the attack, and this is where I realized that the sac would've, more then likely, been worth it.  The question is still about how well this would work out, but something tells me that I didn't play the best move.  With this, I think that better was probably 27.Bxe3  I generally ask myself when a sac like that should be made, and I'm against the idea more then being with it. ",
        "27... Qg3 28. Rf3": "Still going after my Q.  Once I retreat, Nathan gets his K into action.  I'm not sure why since mate's not immediately threatened, and we're not, yet, in the endgame since there are still, too many pieces.",
        "28... Qh4 29. Kh2 Re4": "But, I prepare to go on an attack since my plan is to double up my R's on one file.",
        "30. Bc3": "But, this changes my mind, and I decide to bring my Q back in an attempt to put pressure.  I'm thinking in terms of how bhidragon did it in our rated game, which Susan recently saw.  ",
        "30... Qh5 31. Rg3": "This is the opposite of what usually happens.  But, I was just thinking that he was trying to do something with his pawns with variations.  And, the irony is that I figured out what he was really up to in the game which was the discovered attack.  It's not good that I thought along the wrong lines, but the timing, however, was right since that didn't happen a year ago.",
        "31... Qe2": "So, I stop it with this pin.",
        "32. Kh1 Qf2": "And, that's when I attack again.  Of course, I'm not surprised to see Nathan counterattack.",
        "33. Rf3 Qh4": "That's why I played this.  But, right after this move, it was noon, and I had to go.  So, there was just no way that I could continue with this game since I had to get ready for work.  And, at the time, we both agreed that it would be very difficult for either side to win.  The reason for me is that it would now take very little for me to go wrong and lose which I've done in this situation against either Carl or Tom Walsh..  With past unfinished games, Nathan would take a picture of the position, but the problem is that we'd forget where we were.  Thus, the game would just remain as unfinished with no end.  Keeping that in mind, along with how difficult it would be for either side to win, Nathan offered me a draw.  And, I, promptly, accepted the offer. "
    },
    "url": "https://gameknot.com/annotation.pl/simultaneous-exhibition-match-q-odds-game?gm=68026",
    "gameName": "Simultaneous Exhibition Match-Q Odds Game",
    "players": "Nathan Resika (About 2200 FIDE) vs. Joe ",
    "opening": "English opening (A20)"
}