{
    "moves": {
        "1. e4 f5": "Mira que Cuartas, antes de empezar advirtió a todos en su catalán de Cali: \"Posin les peces on no les pugui menjar\", y voy yo y no le hago caso. Tras la salida habitual del peón de Rey, intenté quitar su peón ofreciéndole el sacrificio del peón del álfil que posteriormente podría recuperar comiendo con el Álfil de Reina... ésta, desde luego, no es una salida estándar y por ejemplo, en esta página de salidas no está contemplada:\nhttp://www.eudesign.com/chessops/epin-01b.htm ... y pronto supe por qué.",
        "2. exf5 Nf6": "Mi siguiente movimiento iba a ser d5, avanzar el peón de reina para liberar el álfil y amenazar el peón blanco... pero me di cuenta que si Cuartas sacaba la Reina para hacerme jaque ( 2. d5 Qh5+ ), esta situación me iba a dejar muy descolocado el flanco de Rey, pues a 3. g6 seguiría 3. ... fxg6, perdiendo otro peón.\nAsí que decidí evitar la situación del jaque con 2. Kf6 ... lo cuál iba a ser el final de la partida como veréis a continuación.",
        "3. Be2": "Aquí ya empecé a ver que se me estaba complicando el flanco de rey. Aún así seguí con mis planes iniciales y adelante el peón de Reina, dejando una posible salida al Rey y liberando el Álfil de Dama.",
        "3... d5 4. Bh5+": "Primer problema serio. Si le como el Álfil con el Caballo\n 4. ... Hxh5\n 5. Qxh5+ g7\n 6. fxg7\ny volvemos al mismo problema de antes, el flanco del rey hecho trizas. Así que decidí la otra opción posible que era mover el Rey, pese a perder el enroque.",
        "4... Kd7 5. d4 b6": "Tras jugar Cuartas 5. d4, pensé que ya se había recuperado el pulso de una partida normal y que pese a tener el rey descolocado podría recuperarme. Mis planes eran abrir un hueco en el flanco de Dama, por donde sacar el Álfil y poder meter el Rey a buen recaudo, dejando salida para la Torre por la línea de fondo... vamos, un enroque en 3 tiempos... pero el Rey nunca llegaría a su destino. El peón blanco de d4 era un dardo envenenado.",
        "6. Nf3": "Aquí ya vi lo que se proponía Cuartas... mierda! ese Caballo acabaría llegando tras el jaque a f7 amenazándome doblemente a dama y torre. Quizás lo mejor hubiera sido jugar Hc6 y si subía el Caballo cambiarlo, pero en una desafortunada decisión decidí mover el Rey a d6 para evitar que el Caballo blanco me hiciera jaque... luego ya movería la Dama para evitar la doble amenaza en f7",
        "6... Kd6 7. Ne5": "Horror!!!! Qué he hecho! Le he puesto en bandeja una triple jaque a la Reina, al Rey y a la Torre... lo que es peor, la Reina no puedo moverla, el Rey tampoco... en esta jugada decidí acojerme al único pasa palabra que podía hacerse. Cuartas me dijo: \"Uy, parece que vas a perder una Reina\", juas, como si tuviera más.",
        "7... Be6": "Después de una vuelta de reflexión, encontré lo que Cuartas calificó como: \"Parece que has encontrado la única solución del problema\"... ",
        "8. fxe6 Kxe6": "Como mal menor, pensé que sería mejor comer el Peón y perder una Torre en la siguiente jugada, pero Cuartas ya había olido la sangre y no se contentaba con ir comiendo piezas... y el puto peón de d4 dando cobertura a ese Caballo.",
        "9. Bg4+": "Para evitar de nuevo el triple jaque no quedaba más remedio que comer con el Caballo ese Álfil.",
        "9... Nxg4 10. Qxg4+ Kd6": "Buah! Dama por Álfil, jaque y mi única respuesta posible conducía al triple jaque!!! Era momento de abandonar, pero tras echar un vistazo al resto de mesas pensé que no sería bonito ser el primero en rendirse.",
        "11. Nf7+": "Arrrggg!!! El triple jaque!!!",
        "11... Kc6": "En este momento, no sólo Cuartas había olido la sangre, mis compañeros de mesa también y el PS Pous (PequeñoSaltamontes, título que se otorga antres de GM, GranMaestro) me dijo: \"Parece que has sacado al Rey a pasear\"... de qué me sonaba a mí aquella frase???",
        "12. Nxd8+": "Y por si fuera poco que me comiera la Reina, Cuartas miró 2 segundos más y dijo:\"Juas, además mate en 3\"... y siguió su despiadada ronda.",
        "12... Kb5 13. Qe2+": "Cuartas: \"Tres y Jaque\"",
        "13... Ka5 14. Bd2+": "Cuartas: \"Dos y Jaque\"",
        "14... Ka4 15. b3#": "Cuartas: \"Uno y JaqueMate\". Aquí en este momento, y tras haber visto como Cuartas iba dedicando a la gente los bonitos comentarios de \"Me has caído mal\" y demás, pensé. \"ahora gritará Me he cargado al primero\" y la gente saldrá corriendo despavorida, pero todo quedó en un Estrechón de manos y la foto de la prensa... \n\n... ah! ya recuerdo quien dijo aquello, nuestro amigo Leoncho: \"... y el imprudente aficionado sacó el Rey a pasear\", \"recuerden, por su bien, el Rey a buen recaudo\"."
    },
    "url": "https://gameknot.com/annotation.pl/simultaneas-de-jaimecuartas-en-santcugat?gm=24846",
    "gameName": "Simultaneas de JaimeCuartas en SantCugat",
    "players": "Jaime Cuartas (GM) vs. Mkandahar (PS)",
    "opening": "Fred (B00)"
}