{
    "moves": {
        "1. e4 c5": "As I do my usual.",
        "2. d4": "And, he opts for the Morra Gambit which I accept right away.",
        "2... cxd4 3. c3": "That's because he gives another pawn.  I think that the idea is that if you take, Nathan will get an advantage as he'll get a piece developed right then and there.  That's due to how he recaptures which you'll see on his next move.",
        "3... dxc3 4. Nxc3 e5": "Meanwhile, I go for a center break here.",
        "5. Bc4": "Which enables Nathan to continue developing.",
        "5... Nf6": "So, I'm thinking that I might as well get a head start, but as Nathan shows, he's already improving his position faster then I am.",
        "6. Nf3 Nc6": "I do want to catch up, and it is like what the rules were for the WTW games.  That was to try your best against the runner, which is what I'm doing.  But, Nathan shows that he's ready for action by deciding to pin my Nf6.",
        "7. Bg5 h6": "I try to break it in a more aggressive way.  As I told that, sometimes, breaking a pin in a more aggressive way is better then being passive about it.  But, I believe that 7...Be7 was to be preferred here since he'll exchange here.  Personally, I don't mind since I view it as liquidation.  That's especially since I'll recapture with the Q, as opposed to, ruining my K side pawn structure.  But, considering that he just does it, I think that it'll give him better mobility here.",
        "8. Bxf6 Qxf6 9. Nd5": "But, I didn't count on this move, nonetheless, I figure that now is the time to throw in the check.  The idea behind it is to continue developing as it'll bring me one step closer to castling.",
        "9... Bb4+ 10. Kf1": "I was surprised to see this move, however.  As my anticipation was 10.Nd2, as then, I'd probably exchange due to being ahead.  The question is how much liquidation would work here, and I think it would.  That's why Nathan doesn't allow it here.  And, naturally, I'm now ready to pull my Q back.",
        "10... Qd6 11. a3": "Going after my B.  But, I was unprepared for his next move, but I knew what had to be done, anyhow.",
        "11... Ba5 12. b4 Bd8": "I did consider 12...Bb6 or 12...Bc7, but considering why Nathan didn't exchange earlier, I didn't want to do it here.  I know it's still liquidating, but I figured that my DSB was more mobile then his Nd5.  And, I don't like to mess around with mobility, knowing just how important it really is.",
        "13. g4": "I'm not sure why Nathan played this.",
        "13... Qg6": "Not seeing the point, however, I go on the offense.",
        "14. h3": "I know that Nathan wouldn't just miscalculate since it protects one pawn.  But, seeing that e4 was en-prise, I decided to grab it while I could, especially since, I'm still a R up.",
        "14... Qxe4 15. Ne3": "I'm not sure why Nathan played this.",
        "15... Nd4": "But, I was ready to liquidate.  Instead of retreating Nathan will attack.",
        "16. Bd5 Qf4 17. Nc4": "I didn't see the point which is why I castled right away.  But, I now realize that this was played to attack e5 twice.  Not seeing any mate or loss of material, I made the wrong decision to tuck my monarch away, as he will get a pawn back.",
        "17... O-O 18. Nfxe5 Bh4": "Redeveloping my B.",
        "19. Nd3": "I'm not surprised to see Nathan go after my Q.",
        "19... Qc7 20. Nde5": "I wasn't sure what to do here, so I tired to allure Nathan into liquidating my Nd4 with my next move.  Not surprisingly, however, it doesn't work.",
        "20... Ne6 21. Qf3": "As he brings his Q into action.  I think that Nathan wants to be able to attack my monarch.",
        "21... Ng5": "So, I figured that this stops him from doing that.  But, after his next move, I'm thinking about if or how Nathan can still attack my monarch with his army.",
        "22. Qe3 Re8": "Not wanting to take chances, I try to tie his pieces down.",
        "23. Qf4": "But, it doesn't quite work out.",
        "23... Kh7": "I was concerned that after 24.Bxf7+ Nxf7 25.Qxf7+ would be mate which it isn't.  So, I went by what Jack told me which is that it's generally a good idea to bring the K to the corner.",
        "24. Bxf7 Nxf7 25. Qf5+": "I would've played 25.Qxf7, but I like this move better.",
        "25... Kg8": "At first, 25...g6 looked better, but I was thinking that the other way hands Nathan back additional material that he lost.  I, however, forgot about his Ne5.  On the other hand, I'm now thinking that this still might have been better because after something 25...g6 26.Qxf7+ Kh8 instead of 27.Qxe8+, 27.Nxg6# would be mate.  And, that's something that didn't even occur to me, but that's, exactly what he would've done. ",
        "26. Qxf7+ Kh7 27. Qg6+ Kg8 28. Qxe8+ Kh7 29. Qg6+ Kg8 30. Nd6": "I wasn't sure what to do here.  And, I couldn't think of anything better besides placing Nathan in check.  Now, if this weren't a R odds game, however, I wouldn't have played my next move.  Instead, I would've threatened mate with 30...Qb6, to try and buy some time since he'd have to answer that threat. ",
        "30... Qc1+ 31. Kg2 Qf4": "I figured that I didn't have anything better, anyhow.  But, this will buy Nathan some time, instead when he places me in check.",
        "32. Qe8+ Kh7 33. Rhf1": "Not seeing the point to this move, I decided to go after his Nd6 which I don't think was wise because of how he'll respond.  It doesn't look so bad, but the problem is running out of time as one can forget that it was so close to noon.  So, I'd have to leave, within the next 5 minutes here.",
        "33... Qd4 34. Qg6+ Kg8 35. Qe8+": "And, it happened here.  Sometime before this game, Nathan snap shot the remaining position with his Iphone in an unsuccessful attempt to resume a game.  I hope that starts happening again with the other members.  As now that Jack and others involved here, and with me excluded from his club; I think that there just might be a way to enable them to finish the unfinished games that had to be adjourned.  That would still involve Nathan taking pictures of the remaining position on his Iphone.  But, the idea would be to have someone forward it to me here.  If so, I would create a thread with the position from that game or even another, if there's multiple on one day since that gets forwarded to Susan's computer with her involved.  But, that would also involve replacing me with a laptop in Jack's club; as I'm thinking that the same position could then be forwarded from her computer onto the computer, in chess club, where others can finish that said game.  It's a question of if she has enough time to do that and if there would be enough room to fit the computer in his club.  But, I'd personally be ok doing it for Nathan and other members of his club.  Having said that, given that material is level against this opponent, I only saw things getting worse here.  And, I wanted to be able to say that we finished, so I resigned."
    },
    "url": "https://gameknot.com/annotation.pl/simultaneous-exhibition-match-r-odds-game?gm=68130",
    "gameName": "Simultaneous Exhibition Match-R Odds Game",
    "players": "Nathan  vs. Joe ",
    "opening": "Sicilian (B21), Smith-Morra gambit, Chicago defence"
}