{
    "moves": {
        "1. e4": "Perhaps hoping to draw his opponent into a Ruy Lopez, where Canal's own theoretical innovation is now immortalized as the Canal Variation.",
        "1... d5": "The amateur starts the fireworks immediately, choosing the aggressive, if not entirely theoretically sound, Center Counter Defense.",
        "2. exd5": "The natural move.",
        "2... Qxd5": "The immediate recapture, exposing the Queen to danger.",
        "3. Nc3": "Development with gain of time, attacking the Queen.",
        "3... Qa5": "The usual move, setting up a potential pin on the White QN.",
        "4. d4": "Canal's move activates the pin but seizes central space.",
        "4... c6": "Creating a potential line of retreat for the Q.",
        "5. Nf3": "Canal resumes his development and guards the QP.",
        "5... Bg4": "The amateur develops another piece and establishes a second pin.",
        "6. Bf4": "Canal seizes an open diagonal for his Bishop.",
        "6... e6": "The amateur opens a diagonal for the development of *his* Bishop.",
        "7. h3": "Canal \"puts the question\"...",
        "7... Bxf3": "...and gets an answer.",
        "8. Qxf3": "Canal completes the exchange and clears the way for potential Q-side castling.",
        "8... Bb4": "The amateur develops a piece and adds force to the pin on the QN.",
        "9. Be2": "Canal clears the last minor piece off his first rank.",
        "9... Nd7": "The amateur prepares to castle Queen-side.",
        "10. a3": "Now Canal \"puts the question\" to the other Black Bishop.",
        "10... O-O-O": "The amateur sees that 11 PxB can be answered by 11...QxR ch, and ignores the threat in favor of castling.",
        "11. axb4": "Canal plays PxB anyway.",
        "11... Qxa1+": "The natural response.",
        "12. Kd2": "Canal could have interposed with his B or N at Q1, but prefers the \"two-Rook sacrifice\".",
        "12... Qxh1": "The amateur, naturally, accepts the sacrifice. He silently tells Canal, \"Prove it!\"",
        "13. Qxc6+": "Another sacrifice! First both Rooks and now the Queen.",
        "13... bxc6": "Forced.",
        "14. Ba6#": "Who needs Rooks or Queens when you can mate with Bishops? Well done by Canal."
    },
    "url": "https://gameknot.com/annotation.pl/simultaneous-exhibition?gm=33264",
    "gameName": "Simultaneous Exhibition",
    "players": "Esteban Canal  vs. Amateur ",
    "opening": "Scandinavian defence, Lasker variation (B01)"
}