{
    "moves": {
        "1. d4": "I think this game in itself is fairly standard and would be uninteresting - except that it was played in a simultaneous display in which Danny Gormally took on 14 opponents simultaneously and beat everyone - apart from this game!",
        "1... Nf6": "I very nearly didn't play him at all. I had arranged the match, and I didn't think that I could both play and organise. I felt that I had to be on hand if there were any problems, any late comers etc. However one person Danny beat very quickly and easily and offer a re-match, and when he opponent accepted, I asked if I could join in, and he agreed.",
        "2. c4": "Danny was most charming and after the match he came back with some of us and entertained us at The Old School Tea Rooms with interesting anecdotes about his life as a Grandmaster.",
        "2... e6": "Danny has recently won the title of \"English rapid Play Champion\" and is the only person to have ever held the title. His rapid play grade is much higher than his ordinary rating (2555). His ability to calculate fast and make good moves quickly of course is a great asset when playing a simultaneous match.",
        "3. Nc3": "Incidentally he said afterwards as well as playing this as black, he also plays the Benko Gambit https://en.wikipedia.org/wiki/Benko_Gambit",
        "3... Bb4": "So it has turned into a Nimzo Indian. https://en.wikipedia.org/wiki/Nimzo-Indian_Defence",
        "4. e3": "I play the Rubinstein System (named after Akiba Rubinstein) ",
        "4... O-O": "Both sides follow the Main Line for the next few moves.",
        "5. Bd3": "I keep it flexible as to whether to put my Ng1 on e2 or f3.",
        "5... d5": "Now that he has played this, there is no fear of him doubling my c pawns with bishop takes knight so I can develop my Ng1 to its natural square of f3.",
        "6. Nf3": "Which I do.",
        "6... c5": "He strikes at my centre again.",
        "7. O-O": "And I castle.",
        "7... dxc4": "He takes.",
        "8. Bxc4": "I take back.",
        "8... cxd4": "He takes back.",
        "9. exd4": "I take back. I now have an isolated queen's pawn. In one sense my pawn on d4 is weak, in that it is isolated and can be attacked by black along the open d file, but on the other hand I have greater central control.",
        "9... b6": "He opts for the Karpov variation named after former World Champion Anatoly Karpov, one of Black's most reliable defences to the Rubinstein System. For the moment, White has an isolated pawn in the d-file, even so, Black plans to play ...Bxc3 at some point and follow up with ...Bb7, ...Nbd7, ...R(a)c8 and ...Qc7 to restrain White's c- and d-pawns. ",
        "10. Bg5": "I develop my bishop to its most natural square.",
        "10... Nbd7": "Black gives greater support to the Nf6, freeing the black queen to move away to say c7 without the fear of me doubling his f pawns with Bg5xf6.",
        "11. Rc1": "I felt it was time for me to develop my rooks. At first glance it looks easy - the queen side rook belongs on c1 and the king side one on e1. However I have a plan to play Nf3-e5 and if he takes on e5 then the king side rook belongs on d1, or if he doesn't I may play f2-f4 and then I may want that rook on f1. So I decided to move the queen side rook first, until it becomes clearer where I want my king side rook.",
        "11... Bb7": "He continues to develop.",
        "12. Ne5": "And I carry out my plan. If I were playing for a win, maybe Qe2 followed by Rd1 or instead Re1 may have been better moves, but as I am happy to draw, I play this, allowing an exchange of knights.",
        "12... Nxe5": "He takes.",
        "13. dxe5": "I take back.",
        "13... Qxd1": "He takes again.",
        "14. Rfxd1": "I take back. Now in my databases I can find four games with this position. In all of them balck now played Bxc3 - the points being that if then white takes the knight black can recapture with the bishop, and if white takes the bishop with the rook black has the nasty knight fork Ne4 attacking the rook on c3 and the bishop on g5. My opponent however did a different move.",
        "14... Ng4": "Attacking e5 and if f2-f4 he has Ne3 forking rook on d1 and bishop on c4. I have Rd4 protecting the rook, but then he has Bc5 winning.",
        "15. Bf4": "So this is best.",
        "15... Bc5": "Attacking f2.",
        "16. Bg3": "Protecting.",
        "16... Rfd8": "He wisely challenges my control of the completely open d file.",
        "17. h3": "I drive his knight back.",
        "17... Nh6": "Back it goes.",
        "18. Rxd8+": "I trade rooks.",
        "18... Rxd8": "He takes back.",
        "19. Rd1": "I challenge the d file again.",
        "19... Rd4": "Rook advances.",
        "20. Rxd4": "I take.",
        "20... Bxd4": "He takes back.",
        "21. Nb5": "I attack his bishop.",
        "21... Bxb2": "He takes.",
        "22. Nxa7": "I take back.",
        "22... Nf5": "He threatens to take on g3 then e5.",
        "23. Bf4": "So I avoid that.",
        "23... h6": "He threatens g7-g5 driving my bishop back.",
        "24. g4": "But I strike first.",
        "24... Nd4": "Knight takes up a strong central post.",
        "25. Be3": "But this is an annoying pin, eyeing the pawn on b6 should the knight move, and the b6 pawn can't advance because of my knight and bishop.",
        "25... Nf3+": "But it moves away with check.",
        "26. Kf1": "More or less forced.",
        "26... Nxe5": "My e pawn goes, attacking my bishop on c4 in the process.",
        "27. Bb5": "Preventing his knight from going to d7 to protect his pawn on b6.",
        "27... Bd5": "He attacks my a pawn.",
        "28. a4": "So I push it.",
        "28... Nc4": "Knight comes to protect the pawn on b6.",
        "29. Nc8": "But I simply attack it again.",
        "29... Nxe3+": "He takes my bishop.",
        "30. fxe3": "I take back, and my pawn handily covers the d4 square preventing his bishop coming back to defend.",
        "30... Ba3": "Maybe with thoughts of playing Bc5 ",
        "31. Nxb6": "I snap the pawn off, threatening to take his bishop on d5 and reaching a drawn opposite coloured bishops ending.",
        "31... Be4": "So he moves the bishop.",
        "32. a5": "My a pawn advances again.",
        "32... Bc5": "Attacking e3, and preventing any immediate advance of my a pawn as that would leave my knight on b6 en prise to his bishop.",
        "33. Kf2": "I play here, rather than to e2, to stop his bishop coming in to g2 to attack my pawn on h3 (he would probably play g7-g5 first)",
        "33... g6": "Preparing to mobilise his king side pawn majority.",
        "34. Be2": "I also wanted this square for this bishop, as I want to challenge his control of the h1-a8 diagonal and then I can threaten to promote my a pawn.",
        "34... f5": "He advances.",
        "35. gxf5": "I take.",
        "35... exf5": "He takes back.",
        "36. Bf3": "I challenge his bishop.",
        "36... Bd3": "He avoid the exchange.",
        "37. Be2": "I challenge it again.",
        "37... Bc2": "He avoids the harrassment of his bishop. I decide to give up a pawn to push my a pawn again.",
        "38. Nc8": "With this.",
        "38... f4": "He advances again.",
        "39. a6": "So do I.",
        "39... Be4": "He tries to get control of the vital diagonal again.",
        "40. Bf3": "I challange again.",
        "40... Bd3": "He attacks the pawn.",
        "41. a7": "So I push again.",
        "41... Bxe3+": "He takes with check.",
        "42. Kg2": "King moves.",
        "42... Bxa7": "He is forced to take the pawn.",
        "43. Nxa7": "I take back.",
        "43... Kg7": "His king advances.",
        "44. h4": "I play this, offered a draw, which he accepted. Fritz agrees that this position is a dead draw. Many thanks for reading, please rate this annotation on the star system and leave a comment or two to let me know how I am doing with my annotations. Until next time dear reader!"
    },
    "url": "https://gameknot.com/annotation.pl/simultaneous-match?gm=63612",
    "gameName": "Simultaneous match",
    "players": "Charles Higgie  (1941) vs. Daniel Gormally (2474)",
    "opening": "Nimzo-Indian (E48), 4.e3 O-O, 5.Bd3 d5"
}