{
    "moves": {
        "1. g3 Nf6 2. Bg2 e5": "Agaianst Kasparov's Hungarian Opening, Sting makes common-sense moves to seize the center.",
        "3. d3 Bc5 4. Nf3 d6 5. O-O O-O": "So far so good for the musician. Both men still have to develop their Q-side pieces before the middle-game proper can begin.",
        "6. c4": "With Sting's position oriented towards seizing K-side space, the champion counters with a Q-side thrust.",
        "6... Nc6 7. Nc3 Bg4": "No fear. If anything, Sting has the advantage in space.",
        "8. h3 Bxf3 9. Bxf3 Qd7": "Sting's development is complete. He has a slight advantage in space and time.",
        "10. Bg2 a6 11. e3 Bb4 12. Ne2 Rae8 13. a3 Bc5": "Both men maneuver for advantage.",
        "14. Qc2 Re7 15. b4 Ba7 16. Nc3 Rfe8": "Kasparov has caught up in development and neutralized the musician's former advantage in space. The position is roughly even.",
        "17. Bd2 d5": "The first error from Sting. This move loses a Pawn without significant compensation.",
        "18. cxd5 Nd8 19. e4 h6 20. Be3 b6": "Down in material, Sting wisely refuses the exchange of Bishops.",
        "21. Ne2 Nb7 22. g4 Rc8 23. Ng3": "Kasparov maneuvers his Knight to the K-side. N-B5 is now a positional threat, as it would force ...P-N3, weakening the Black K-position.",
        "23... Nd6": "Guarding the outpost square KB5.",
        "24. Qc6 Qxc6 25. dxc6": "With the Queens gone, the position assumes an endgame-like character. Kasparov's extra Pawn is a larger advantage with every exchange of pieces.",
        "25... Rd8 26. a4 Nc8 27. Rfd1 Re6 28. b5 a5": "Locking the Q-side Pawns in place, but completely trapping his KB. This piece is now useless.",
        "29. Bf3 Red6 30. Be2 Nh7 31. h4 Ne7": "Sting is defending with pluck. However, Kasparov's extra Pawn and Sting's imprisoned B are huge handicaps.",
        "32. Nf5 Nxf5 33. gxf5 f6 34. Ra3 Kh8 35. Rd2 Rg8": "Sting brings his available forces to the K-side.",
        "36. h5 Ng5 37. Kf1 Nh3 38. Bg4 Nf4 39. d4": "Kasparov's pressure finally forces a mistake.",
        "39... exd4 40. Bxf4 Rdd8 41. Ke2 Rge8 42. Kd3 Re7": "Sting still holds out hope.",
        "43. Bd1 Rde8 44. f3 Rd8 45. Bb3": "The musician, effectively down 2 pieces, finally resigns. A hard-fought game."
    },
    "url": "https://gameknot.com/annotation.pl/simultaneous-exhibition-2000?gm=35985",
    "gameName": "Simultaneous exhibition, 2000",
    "players": "Garry Kasparov  vs. Gordon M. T. Sumner ",
    "opening": "Benko's opening (A00)"
}