{
    "moves": {
        "1. e4 c5": "The important thing to remember when playing the sicilian is that black's major strength and source of counterplay will be on the queenside, while white will rule the kingside.  Notice how the first moves already dictate that this will be the case.",
        "2. Nf3 g6": "The accelerated dragon.  Black's plan is usually to delay d6 so that in some variations he can play d5 immediately, gaining a tempo over the main line.",
        "3. d4 cxd4 4. Nxd4 Nc6 5. Nc3": "An interesting alternative at this point is c4, setting up a formation known as the Maroczy bind.  I personally (as white) prefer the line I chose in this game.",
        "5... Bg7": "White must address the threat to d4.",
        "6. Be3 Nf6": "e4 is pressured now.",
        "7. Qd2": "Bc4 is more normal here, to force black to play d6 instead of giving him the d5 option.",
        "7... O-O 8. f3": "This allows black the option of transposing back into the main line of the sicilian dragon with d6, or he can try opening up the game while white is still uncastled with d5.",
        "8... d6": "Main line it is.",
        "9. O-O-O": "This move, while quite playable, has fallen out of fashion at the top level.  More common is Bc4, which prevents d5.  \n\nCommonly, black will play d5 now, which is why I was somewhat surprised that, having played the accelerated dragon, black didn't play d5 back on his 8th.",
        "9... a6": "Looks Najdorf-esque to me; I typically don't see a6 here -- it's not like white is threatening piece-to-b5... white's typical plan will be to assault black on the kingside.",
        "10. Bc4": "This move prevents d5, but its real purpose is that it pressures the kingside and pins the f7 pawn, which turns out to be important later.",
        "10... Nxd4": "This exchange doesn't favor black, as it doesn't help him develop and it half-opens the d-file, where white has major pieces already posted.",
        "11. Bxd4 b5": "Forcing the bishop to move.",
        "12. Bb3": "!  This is the best square for the bishop.  Look at what white is doing.  His bishops are in great shape, sniping at the enemy king.  If he can get his kingside pawns rolling, black won't have much chance for counterplay before he gets crunched.",
        "12... Bb7": "Consistent, but perhaps the defensive Be6 (forcing off the light-squared bishops) was better -- the bishop isn't really threatening much at this point.",
        "13. h4": "And here come the kingside pawns!  White's goal in dragon positions is often to castle long, pawn storm, and mate down the h-file.",
        "13... Qc7": "Trying to activate the queen.  Notice how black has been focusing on the queenside with his last 5 moves, and as a result, he is ill-prepared to defend his king.",
        "14. g4": "!  This move allows white to play h5, where black can do very little about that without losing a piece.",
        "14... Rfd8": "Again, focusing on the queenside and oblivious to the danger on the kingside.\n\nWill black really just allow white to proceed with his plans?",
        "15. h5": "Testing the waters.  How will black respond?  White has a winning advantage here...",
        "15... e5": "So black sees the threat  on the kingside now, and tries to drive the bishop away.  But e6 was probably better, although white clearly has an advantage here.",
        "16. Be3": "Fine by me.  White typically aims to exchange off the Bg7 by playing Bh6.  I had to move the bishop to d4 and back to take the knight and run from the pawn, but black didn't gain anything from that.",
        "16... b4": "Playing on the queenside, still... this push doesn't do black any good.",
        "17. Ne2": "White is still poised to attack black's kingside, and black's position is even worse than it was a few moves ago.  The pawn on b4 is hanging, the d-pawn is permanently backwards, and black's queenside presence is a minor threat at most.  On the other hand, white is totally geared up for a kingside attack now that black's counterplay attempts have been squashed.",
        "17... Rac8": "This would be quite a threat if it weren't for the Qd2 and the Bb3, which play both offensive and defensive roles.  White decides it's time to rip open black's king's position.",
        "18. hxg6": "!  (although obvious)  Black needs to keep the h-file closed, but he can't.   He can't recapture with the f-pawn due to the pin by the Bb3, and not recapturing just leaves white with a protected passed pawn on the 7th rank.",
        "18... hxg6": "Practically forced, but white has too much for black at this point.",
        "19. Bh6": "As I said earlier -- white will try to exchange off the Bg7 by playing Bh6, and mate down the h-file.  It's rare that things go according to plan in chess, but, here it is!",
        "19... d5": "\"The best way to meet a wing attack is with a counterattack in the center.\"  Not here, buddy -- the kingside attack is overwhelming.\n\nIn all fairness, it isn't like black had anything significantly better at this point, but now white forces a mate in three.",
        "20. Bxg7": "!  If black doesn't recapture with the king, white will play Rh8  followed by Qh6#.",
        "20... Kxg7": "So he does.  But now white will play 21. Qh6 , forcing black to play Kg8, allowing white to mate with 22. Qh8#.\n\nSo, to recap, this is a typical white plan in the sicilian, and for once, things went according to plan!  Feel free to message me if you find good counterstrokes for black or even better moves for white!",
        "21. Qh6+ Kg8 22. Qh8#": "1-0"
    },
    "url": "https://gameknot.com/annotation.pl/slaying-the-dragon?gm=3729",
    "gameName": "Slaying the Dragon...",
    "players": "ethansiegel (1793) vs. alabamaboy (1635)",
    "opening": "Sicilian (B27), Hungarian variation"
}