{
    "moves": {
        "1. e4 d5 2. exd5 Nf6 3. Bc4": "It went like a \"normal\" Scandinavian, but this move is seldom faced. This bishop will run for a while. ",
        "3... Bg4": "I've seen this idea recently (Portuguese Gambit?) played and commented here on GK, and I gave it a try.",
        "4. Nf3": "The N is pinned, so I could have gone for Nd7, threatening Ne5.",
        "4... Nxd5": "The problem with Bc4 is that it prevents white to play c4 instead, so this N take is just fine!",
        "5. h3": "OH, well, of course... backwards? Never! :-) (just joking, don't play chess like that, please! :-D",
        "5... Bxf3 6. Qxf3": "It looks dreadful, because if Nf6, Qxb7. ",
        "6... e6": "But this simple move saves it all. Because white can't play c4 now. ",
        "7. d3": "Here I could have gone for the complications of Nb4 (allowing Qxb7 for Nxc2+, cashing the R after saving my own... oh, I already played this one, and it's very complicated!)",
        "7... c6": "This saves it all, because now even if white manages to play c4, my N can safely leave this square, since b7 is defended. ",
        "8. O-O Bd6": "Very important: I have to use my dark squares to create pressure. ",
        "9. Bg5": "?? I don't think that QxB gave some compensation to white. It was just a blunder and I...",
        "9... Qb6": "?? I played authomaticly this move, without even realizing that the WB was \"free of charge\", so concerned I was about b2's AND c2's weaknesses..",
        "10. b3": "? This stops forever the c4 option for white, and allows for a future b5 threat...",
        "10... Nb4": "? The threat on c2 must control white, because he has very dangerous sacs like Bxc6. On the other side, I will spend a tempo castling ONLY if absolutely needed. I need my tempoes for my own attack. BUT much more important was Be5, forcing c3, and only then Nb4, where if cxN, BxR. ",
        "11. Qe2": "! Now white's threat is even worse! And, besides, Be5 is not possible anymore!!! Time to castle?",
        "11... Nd5": "NO! This is many times more efficient to stop white's threats.",
        "12. a3": "? White has to go on, and Kh1, allowing f4 - f5 would have been black's next challenge. But this move goes for a slower plan. ",
        "12... Nd7": "If I am not forced to castle, why to concede a tempo? Better is to develop.",
        "13. b4": "white is going for a pawn storm on the Qside! Wow! Very interesting, but not for a blitz. The correct procedure for black (IMO!) is a5. b5 by white is just ok, bxc6, bxc6 goes in black's favour and doesn't concede anything. ",
        "13... Be5": "This is now very strong, but it comes too late. ",
        "14. Ra2 O-O": "Now. White can't develop the N or Nc3 will fork his Q and R. He has to find a way to attack my kingside, but this will force him to abandon his pawn's storm ideas. ",
        "15. Kh1": "! Now! Ok, he plans f4. Time to do something. ",
        "15... Nc3 16. Nxc3": "\"forced\"",
        "16... Bxc3": "...and this B has a very nice view from there, controlling white's pawns, and preventing Re1. Now white has...",
        "17. Bxe6": "!! Very nice! But I saw the defence - or so I believe!",
        "17... fxe6 18. Qxe6+ Rf7": "Despite all his power, white has no clear way in! This was what I spotted. ",
        "19. f4": "!? Well, does this allow h6? I didn't think so, ",
        "19... Nf8": "This N had better perspectives controlling the central black squares with the B, but I thought that the  won tempo whorted the investment. My N will relocate on g3. ",
        "20. Qg4": "! The strongest, but g7 is covered!. ",
        "20... Re8": "If  Bh6, it doesn't matter because g7 has one extra protection. ",
        "21. f5": "! Now this can be a problem, since after f6 white does have Bh6, no matter what I do, so I went for counterattack. ",
        "21... Re1": "?? MUCH stronger was Ne6!, where fxN was impossible due to RxR+, Kh2, and lines similar to the game's. ",
        "22. Rxe1 Bxe1": "...and where is the point?",
        "23. f6": "Oh, My, so I am supposed to parry this with g6, etc.??? Very boring! I have to exploit my own attack. ",
        "23... Ng6": "Well, this was to stop Bh6's threat, you know, the downside of playing f6. ",
        "24. fxg7": "? h4 was the most pressing move, but even so, white missed the threats on his own king! I just love to leave this pawn there, protecting my K... So, Rf1+ was obviously the best move, but I was just wondering some line, when my fingers...",
        "24... Qb5": "SLIPPED! Oh, no! My Q far from the black squares! (on the other side, on Qe5 it will be unstoppable! Let's see if I can make a cake from dry bread...)",
        "25. c4": "? I loved the difficulties that this opponent created to me, but the game was far too complicated for a blitz. d4! instead, controlling e5, could have been the idea. ",
        "25... Rf1+": "At last!",
        "26. Kh2": ".",
        "26... Qe5+": "...and wthe BQ has control of the black diagonal. The following sequence is forced.",
        "27. g3": "Again, I am not only the attacker, but I NEED to attack and avoid Re2 at all costs!",
        "27... h5": "The only reasonable threat comparable to Re2. White has to escape via Qc8+, hoping for a perpetual. ",
        "28. Bf4": "...or this. Now, black controls the exchanges. ",
        "28... Nxf4": "Mind that Rf2+, RxR won't return anything for black...  ",
        "29. Qc8+": "Finally, the perpetual way. Unfortunately, if I want to keep my attack, I can't stop it so easily!",
        "29... Kxg7 30. Qxb7+ Kg8 31. Qc8+ Kf7 32. Qd7+ Kf6": "I decided that the N will be my shield. a flanked N is an excellent bodyguard against a Q.",
        "33. Qxc6+ Ne6": "! NO more CHECKS, and the N is saved. And Qxg3# is threatened...",
        "34. Rg2": "I like the way white finds the last resource over and over...",
        "34... h4": "...and this simple \"excercise-like\" move cash the point! White resigned.",
        "35. Qe4 hxg3+": ""
    },
    "url": "https://gameknot.com/annotation.pl/slow-but-unstoppable-http-gameknot-com?gm=59152",
    "gameName": "Slow but unstoppable, http://gameknot.com/",
    "players": "acrobaticskater  vs. damalfi ",
    "opening": "Scandinavian defence (B01)"
}