{
    "moves": {
        "1. e4": "Standard King Pawn opening.",
        "1... e5": "Standard response.",
        "2. b3": "Mix it up a little, go for fiachetto",
        "2... f5": "Black tries a little reverse Kings Gambit action.",
        "3. f3": "White protects King Pawn.",
        "3... Qh4+": "Black Queen comes out in aggressive style.",
        "4. g3": "White blocks the check.",
        "4... Qf6": "Blank Queen is forced to retreat.",
        "5. d3": "White continues to push pawns.  Notice the white king is becoming naked and rather exposed to the elements.  ",
        "5... Bb4+": "Black continues in his aggressive ways.  This is the second check of the white king and its very early in the game.",
        "6. Bd2": "White blocks the check in a very acceptable way.",
        "6... a5": "Rather than swapping Bishops, black decides to just maintain the pressure and protect the Bishop.  Notice that if white decides to swap Bishops then the Black pawn structure will be a little messed up.  Black takes this chance as an acceptable risk.  If it does happen, the Black Rook opens up his file which is not a bad thing.",
        "7. c3": "White decides to shoe away the black Bishop.",
        "7... Bc5": "Black bishop is forced to retreat.  Notice that white keeps moving pawns and the white pieces are more and more exposed.  The King and Queen are becoming embarrassed as if the shades are open in the bathroom.",
        "8. c4": "White Pawns continue to march forward.  Black is thinking, my opponent is some kind of \"wood pusher.\"",
        "8... Nc6": "Black develops normally.",
        "9. Bh3": "White Bishop comes out from under cover and makes a threat upon a pawn.",
        "9... fxe4": "Black pawn says the heck with you and instigates a swap.",
        "10. dxe4": "White swaps pawns as expected.",
        "10... d6": "Black opens a path so that we now have Bishop against Bishop.  Some may say this is a bad idea for black because a bishop swap will eliminate any chance for a queen side castling.",
        "11. Bxc8": "White goes for the Bishop swap.",
        "11... Rxc8": "Black completes the swap as expected and now Black has lost the chance to castle on the Queen side.",
        "12. f4": "The \"wood pusher\" continues pushing wood.  The white King feels almost naked now.",
        "12... Bd4": "Black Bishop makes a threat on white rook.  The white rook can not move, so it is a pretty nasty threat.",
        "13. Bc3": "White bishop is able to block the threat on the rook.",
        "13... Qg6": "Rather than performing a meaningless Bishop swap, Black puts a threat upon a completely unprotected white pawn.",
        "14. f5": "White blocks the threat and forces Black to move queen to safety.",
        "14... Qg5": "Black queen moves out of trouble and sticks her nose into a place that is beginning to penetrate the enemy lines. The teeth of the White King begin to chatter nervously.  ",
        "15. Bxd4": "White Bishop executes a swap in order to decrease the overall pressure that is building.",
        "15... Nxd4": "Black swaps bishops using Knight rather than pawn.  This keeps the black pawn structure happy and brings in some more fire power.  The black King is really starting to like the looks of this.  He is very proud of his army and he can not believe how white pawns have abandoned the white king.",
        "16. Nd2": "White knight decides that the emperor has no clothes, and decides to provide some protection.",
        "16... Qe3+": "Alas, the feeble attempt at protecting the white king has failed.  Black executes another check.  ",
        "17. Ne2": "Now both white horses are playing the role of body guard because the white pawns have abandoned their post.",
        "17... Nf6": "Black feels pretty confident.  Time to develop more fire power.",
        "18. Nf1": "White tries to scare away the black queen.",
        "18... Nf3#": "Its all over.  Rather a short game.  The white wood pusher left his royalty exposed and black came easily behind enemy lines to deliver the death blow."
    },
    "url": "https://gameknot.com/annotation.pl/slow-ladder?gm=54247",
    "gameName": "Slow Ladder",
    "players": "marinsjd (1290) vs. jutterback (1449)",
    "opening": "King's pawn game (C20)"
}