{
    "moves": {
        "1. e4": "It may be scary to play a game of chess with someone who is significantly higher rated than you but there are some advantages to it as well. Firstly, you can only improve your game to the level of your competition. Secondly, a higher rated play can provide valuable feedback about your game and areas of need improvement. \n\nI usually play 1.d4 but when faced against a lower rated player I play 1.e4 which is more familiar to them. ",
        "1... e5 2. Nc3": "most common is 2. Nf3 moving into Spanish games",
        "2... c6": "?! this is inferior to 2. ...Nf6 because it hinders piece development. The general rule to keep in mind when playing through the opening is to develop knight before bishops, bishops before queen and Queen before rooks. If you follow this rule you will have a good position coming out of the opening 80% of the time. ",
        "3. f4": "Normally I would only recommend this move only after the majority of your pieces have been developed. However, this is an exception because 2. ...c6 has left ...e5 undefended. If black decides to capture with 3. ...exf4. Then white recaptures with e3 and Bxf4 to follow. \n\nStrategically speaking 3. ....exf4 is very good for white because it weakens black's center by deflecting the e pawn away from the center while white's center pawns remain in the center. It also will give white the plus of rapid deployment of his pieces. ",
        "3... Bd6": "?? putting your bishop in front of a unmoved center pawn is never a good move. This move hems in black's queen, LSB and Knight. Alternative suggestions to defend the pawn would be ...d6 to keep the center semi closed or go for broke with ...exf4",
        "4. fxe5": "...d6 would have prevented me from capturing ...e5 right way. Had black played 3. ...d6 I would have followed up with Nf3. ",
        "4... Bxe5": "retreating the bishop to c7 or e7 was safer. Now I can setup a very powerful center. ",
        "5. Nf3 f6": "?? I am sure he was thinking, \"If he takes with the knight I take back with the pawn.\" but...",
        "6. d4": "!! For the win. I win a pawn. ",
        "6... Bd6 7. e5 fxe5 8. dxe5 Bb4": "a good pin",
        "9. Bd3": "developing a piece and preparing for castling. ",
        "9... h6": "?? never move this pawn unless your forced because of a check on h7.",
        "10. Bg6+": "and this why playing ...h6 is almost always bad",
        "10... Kf8 11. O-O": "The cannon is all lined up and ready to destroy",
        "11... Ne7 12. Ng5+ Kg8 13. Bf7+ Kf8 14. Ne6+": "mate in two. "
    },
    "url": "https://gameknot.com/annotation.pl/slow-ladder?gm=39069",
    "gameName": "Slow Ladder",
    "players": "elyhim (2222) vs. tootsmel (1110)",
    "opening": "Vienna game (C25)"
}