{
    "moves": {
        "1. e4": "My traditional opening.",
        "1... e5 2. f3 Nf6 3. Nc3 Nc6 4. d3": "The game is starting off well.",
        "4... Bb4": "He's ready to take my knight with his bishop.",
        "5. Bg5": "So am I.",
        "5... h6 6. Bxf6": "Guess I'll make the first move.",
        "6... Qxf6 7. a3 Bxc3+": "We all knew that was gonna happen.",
        "8. bxc3 O-O": "His defenses are pretty good. ",
        "9. g3": "Mine are decent, but could be better.",
        "9... b6 10. Bh3": "I'm preparing to castle king-side.",
        "10... a5 11. Ne2": "I moved my knight out, ready to castle, but I didn't notice my f3 pawn was completely defenseless. ",
        "11... Qxf3": "I failed to see that coming, thus castling was no longer an option at this time. Along with that, I'm a piece behind now.",
        "12. Rf1": "I needed to save my rook.",
        "12... Qe3": "With his queen deep in my territory, I needed to be careful.",
        "13. a4 Rd8 14. Bg2": "I'm just trying to find a way to get the queen to back up some.",
        "14... Ba6 15. Rf3": "That will work.",
        "15... Qg5 16. h4": "This didn't help as much.",
        "16... Qg4 17. Qb1 d5": "Usually I make another move and let my opponent attack my pawn on their next turn.",
        "18. exd5": "Not this time.",
        "18... Rxd5 19. Qa2": "I go for the rook.",
        "19... Ne7": "He nicely protects it.",
        "20. c4": "I use a different approach.",
        "20... e4": "I wasn't willing to give up my rook.",
        "21. dxe4": "Now we're evenly matched again.",
        "21... Rd4": "Well we were. I know he wasn't wanting to give up his rook either, but he overlooked my knight.",
        "22. Nxd4": "Now I have a big advantage! He's gonna have to work hard now.",
        "22... Rd8": "To me, knights can be very useful, so he wasn't getting it that easily.",
        "23. O-O-O": "This definitely helps me out. I castle queen-side and defend the knight.",
        "23... Qxe4": "That pawn was a goner anyway.",
        "24. Qb2": "Not the best move.",
        "24... Bxc4": "Now I lost that pawn.",
        "25. c3 c5": "Not the best move for him. True my knight is at risk, but his b6 pawn is a goner now.",
        "26. Qxb6": "On top of that, his rook is in danger now.",
        "26... cxd4": "??? His rook is gone now! He may have my knight, but the only powerful piece he'll have left is his queen. Any move that defended his rook would of been way better than the move he just did here.",
        "27. Qxd8+": "On top of another rook gone, his king is now in danger.",
        "27... Kh7 28. Rxd4": "My advantage continues to grow.",
        "28... Qe1+ 29. Rd1 Qe5 30. Bf1": "I go for his bishop.",
        "30... Bb3": "His king is in quite a pickle and he doesn't realize it.",
        "31. Bd3+ g6 32. Rdf1": "I prepare to attack hard.",
        "32... f5": "He defends, stopping my attack.",
        "33. Qa8 Bxa4": "I'm not really worried about my pawns at this point, for I see opportunity for checkmate.",
        "34. Bc2": "But first his bishop again.",
        "34... Bc6": "Darn, I didn't see that coming. Of course I save my queen, but now I lose one of my rooks. My advantage is shrinking some.",
        "35. Qd8 Bxf3 36. Rxf3": "Well I got the bishop. I'm getting ready to end this now.",
        "36... Qe1+": "But he'll make me work for it.",
        "37. Kb2 Ng8 38. Rd3": "About to attack hard.",
        "38... Qf2": "Two pieces lined up like that should give you a hint that a attack is coming. That move didn't help his situation at all.",
        "39. Rd7+ Kh8": "The knight is gonna hinder progress.",
        "40. Qc7 Nf6 41. Qc8+ Ng8 42. Qf8": "Checkmate is inevitable, at least I thought, but my opponent was not gonna give up easily.",
        "42... Qb6+ 43. Kc1 Qe3+ 44. Kb2": "Repetition occurs a little here.",
        "44... Qb6+ 45. Kc1 Qg1+": "I realized here that he was going to keep putting me in check relentlessly, trying to do anything to prevent checkmate. I realized that if I stayed around the bishop, the game could eventually end in a threefold repetition. I knew I could win this so I was gonna have to leave those pieces and plan a new strategy. ",
        "46. Kd2 Qf2+ 47. Kd1": "I try to change it up some here.",
        "47... Qf1+ 48. Kd2 Qf2+ 49. Kd3": "I must head for my strong pieces.",
        "49... Qf3+ 50. Kd4 Qf2+ 51. Kd5 Qd2+ 52. Bd3": "I get desperate here. Definitely not a great move. My bishop is completely unprotected.",
        "52... Qa2+": "A much worse move by him! He should of taken my bishop!",
        "53. Bc4 Qd2+ 54. Kc6 Qg2+": "Again, he should of taken my bishop when he had the chance.",
        "55. Bd5": "This move now prevents him from putting me in check, and the c3 pawn makes intervention impossible, thus my next move, Qg7# was inevitable. kraaifontein resigned and this wonderful game was over. I hope you enjoyed this annotation! "
    },
    "url": "https://gameknot.com/annotation.pl/slow-ladder?gm=53990",
    "gameName": "Slow Ladder",
    "players": "joveyboy1 (1033) vs. kraaifontein (1243)",
    "opening": "KP (C20), King's head opening"
}