{
    "moves": {
        "1. Nf3": "I normally play d4 or c4 but I thought I would try something different",
        "1... g6 2. d4 d6 3. c4 Bg7 4. Nc3": "transformed into a Kings Indian defense style of game",
        "4... e5 5. d5": "it really is a matter of preference you can either play d5 or dxe5",
        "5... Nf6 6. Bg5 O-O 7. e4 Bd7 8. Qd2 Na6 9. Bd3": "? I don't like this move because I will be forced to move it twice which results in a loss of tempo. An improvement would be 9. Be2",
        "9... Nb4 10. Bb1 Bg4": "taking good advantage of the fact that white's light square bishop is over on the other side of the board",
        "11. Ng1": "a weaker move but the idea is to play f3 to evict the bishop off of g4 and support e4",
        "11... c6": "a good move that does not allow white to achieve the ideal pawn structure",
        "12. f3 Bd7 13. a3 Na6 14. Nge2 cxd5 15. Nxd5": "I can not play cxd5 because of ...Bb5",
        "15... Nc5 16. Ba2": "not a good spot for the bishop but my position is starting to show signs of wear and tare",
        "16... Ne6 17. Nxf6+": "with my space advantage going up in smoke I wanted to exchange some of black's most active pieces.",
        "17... Bxf6 18. Be3": "I am betting that chase is going to play Bh4+ so I over support on d4 so that I can defend against the check without weakening my pawn structure even more",
        "18... Bh4+ 19. Ng3": "playing g3 is to much of a concession. ",
        "19... Ba4": "a good restricting move that prevents b3",
        "20. O-O Bg5 21. Ne2": "again ensuring that black can not enter d4",
        "21... Bxe3+ 22. Qxe3 Qb6": "forcing the queens of the board. However it comes at the cost of a doubled pawn that hinders black from winning. although black does not have any real good alternatives",
        "23. Qxb6": "Hin sight being 20/20 the queen less game is in black's favor. ",
        "23... axb6 24. Nc3 Bc6 25. Kf2": "I am heading toward the end game and want to get my king into the action first",
        "25... Kg7 26. Rfd1 Rfd8 27. Rd2": "I would like to double my rooks but I am sure that my opponent would not allow that. So this is more of a waiting move. ",
        "27... Ba4 28. Nd5": "Threatening to win a pawn and fork the rook and bishop",
        "28... Ra6 29. Rc1": "This game is a very closed position. In such tight games it is easy to go astray without even relieving it. The key is to play small moves that slightly build your position. Do not play over committed or aggressive moves. ",
        "29... Nd4 30. f4": "if I was ever going to get this move in it was now. So did not see any real reason why I could not play it. The interesting thing about this move is that it creates an immediate imbalance in the position. ",
        "30... Bc6 31. Rdd1 h6 32. Ke3 g5 33. g3 Bd7 34. h4 Bg4 35. Rxd4": "a good scarfice that gives me more control over the center and creates a powerful mobile pawns on the king side. ",
        "35... exd4+ 36. Kxd4": "I am very comfortable in my position",
        "36... Rc8 37. Ne7": "?? the first blunder. I should have played my gut move which was to restrict the bishop with 37. f5! At least then black would have a terrible time trying to figure out how to get his bishop back  in the game",
        "37... Rc5 38. Rf1 f6 39. Nd5 Be6 40. hxg5": "I was kinda at a lost to how to proceed. I still feel that there is a better move than this. But because I could not find it I played it safe. ",
        "40... hxg5": "Black has managed to neutralize the king side",
        "41. Nc3": "I dont want to allow black to play ...Ra4",
        "41... Ra8 42. b4 Rc6 43. Rf3": "?? If I remember right I played this move at 3:00 am. Which is never a good idea. I should have played a4 instead. ",
        "43... Rxa3": "! why not! like omg now I am in serious trouble. By the way this is where the doubled pawns on the b file start to save the game for white. The real learning value in this game is how I restrict the strenght of my opponents peices by setting up a blockaid. ",
        "44. b5": "This is it! it is an easy draw from here. Black will try but he will be unable to break through the wall of pawns. Technically black is up by a pawn but because they are doubled they cancel each other out. ",
        "44... Rc8 45. Rd3 Bf7 46. Rf3": "prevoking ...g4 which will prevent the black bishop from entering through via h4",
        "46... g4 47. Rd3 Be6 48. Re3 Rc5": "This forces 49. F5. I can not allow the rook access to the h file. ",
        "49. f5 Bf7": "Now if black has any chance to win he will have to do it on the h file",
        "50. Re2": "This move prevents black from breaking through from both flanks",
        "50... Rc8 51. Rh2": "the only move that holds",
        "51... Rca8 52. Kd3": "now all I have to do is make king moves until the cows come home. ",
        "52... Rh8 53. Rxh8": "after Kxh8 black has no chance so it is a draw. In the game black continues to try to break through for another 20 moves but to no avail",
        "53... Kxh8 54. Bb1 Ra1 55. Kd4 Kg7 56. Kd3 Ra8 57. Kd4 Rh8 58. Bd3 Rh3 59. Ne2 Rh1 60. Ke3 Rf1 61. Nd4 Rg1 62. Ne2 Ra1 63. Nc3 Rc1 64. Ne2 Re1 65. Kf4 Rd1 66. Ke3 Kf8 67. Nc3 Rc1 68. Ne2 Rf1 69. Nd4 Re1+ 70. Ne2 Ke8 71. Kf4 Rd1 72. Ke3 Rf1 73. Nd4 Rc1 74. Ne2 Ra1 75. Nc3": ""
    },
    "url": "https://gameknot.com/annotation.pl/slow-ladder?gm=30294",
    "gameName": "Slow Ladder",
    "players": "elyhim (1997) vs. chase103 (2173)",
    "opening": "Reti opening (A04)"
}