{
    "moves": {
        "1. e4 d5": "1.......... d5 - this response to white's e4 is called the Centre Counter or the Scandinavian.",
        "2. exd5 Nf6": "2.......... Nf6 - the old fashioned response used to be to recapture the pawn with the queen but chessplayers are not encouraged to bring their queen out too early.",
        "3. d4 Nxd5 4. Nf3 g6 5. c4": "5. c4 - I try to re-establish a commanding centre after black regained his pawn and I hit out with the knight.  On the previous move black has played g6 preparing Bg7 which he does play on move 6.",
        "5... Nb6 6. Nc3 Bg7 7. h3 O-O 8. Be3": "8. Be3 - I continue to get my pieces out as quickly as possible especially as black has now castled.",
        "8... c5": "8......... c5 hits out at the pawn centre.  I have some big decisions to make real fast.",
        "9. b3": "9. b3.  For the first 8 moves I have been following the database but I accepted these moves because they do have a clear purpose.  The database is very thin, in fact there is only one illustrative game with this move in the 1500  database and not in the 1900s.  It suggests I take on c6 but after doing an analyse the board I find that my pawn structure will be broken up.  I therefore decide to give my c pawn pawn backup.",
        "9... Nc6": "9. ........ Nc6 - develops a piece and piles up on d4.  I now back up d4 by moving my knight to e2.",
        "10. Ne2 cxd4 11. Nexd4 Nxd4 12. Bxd4 Bf5 13. Bxg7 Kxg7": "13. .......... Kxg7 (over the last few moves there have been a plethora of exchanges in the centre).  I try to complete my development and prepare to castle by playing Be2 on move 14.",
        "14. Be2 Qc8": "14. ....... Qc8 - black does not wish to exchange queens - he is preparing to put his rook on d8.  I now castle in order to prepare a contest of the d file.",
        "15. O-O Rd8 16. Qc1 Qc5 17. Qb2+ f6 18. Rfd1": "18. Rfd1 - I now contest the d file.",
        "18... e5 19. Rxd8 Rxd8 20. Rd1 Rxd1+ 21. Bxd1 Nd7": "21. ........ Nd7 - both sets of rooks have been exchanged.  I now try to exchange bishops but black does not wish to do this and plays his bishop to e6.",
        "22. Bc2 Be6 23. Be4 b5 24. cxb5 Qxb5": "24. ....... Qxb5 - one pair of pawns have been exchanged and I have a queenside pawn majority.  This looks good for the endgame so I now try and exchange queens.  This happens a few moves later on move 28.",
        "25. Qd2 a5 26. Bd3 Qc5 27. Qc2 Qxc2 28. Bxc2 f5 29. Nd2": "29. Nd2 - the start of a bad plan here.  Moving the king to f1 on this move or the next two moves was indicated to prevent what black had in mind.  It only becomes clear when he plays 31. Nb6.",
        "29... e4 30. Bd1 Kf6 31. Be2": "31. Be2?? or whatever question marks you choose to give this losing move.  The plan was to play Bc4 and try and exchange bishops.  I would then put my knight on the c4 outpost hitting at the a pawn.  31. Kf1 should have been played.  I play it next move but it turns out to be one move too late and I get caned well and truly by my Master opponent.",
        "31... Nb6 32. Kf1 Ke5 33. Ke1 Kd4 34. Kd1 Nd5": "34. ...... Nd5!! - killer move threatening Nc3  forking king and a pawn.  I try and stop the knight from going to c3 by playing 35. Nb1 but he has another stinger up his sleeve - 35......... Nb4!!",
        "35. Nb1 Nb4 36. Nd2 Nxa2": "36. ....... Nxa2 - bang goes my a pawn.  I play on a couple of moves but that knight is more than pesky!!",
        "37. Kc2 Nb4+ 38. Kb2 Nd3+ 39. Bxd3 Kxd3": "39. ........ Kxd3!! This move forces resignation from me on the grounds of ruinous loss of material.  I can move the knight away to b1 for example but he will then play his king to e2 next move, cleaning up all the pawns on the kingside.\r\n\r\nMoral here:  If you can safely do so here is this principle:-  \r\nIn the endgame, if in doubt - get king out!!"
    },
    "url": "https://gameknot.com/annotation.pl/slow-king?gm=13154",
    "gameName": "Slow King",
    "players": "jstevens1 (1500) vs. chrisobee (2196)",
    "opening": "Scandinavian (B01), Marshall variation"
}