{
    "moves": {
        "1. e4": "1.e4 Bobby Fischers favourite opening move \"best by test\" in his view. Maybe the favourite opening move in chess and certainly one of the best.",
        "1... c5": "The Sicilian is personally my favoured answer to 1.e4. It unbalances the position and creates dynamic, positional, and tactical opportunities for both sides. ",
        "2. Nf3 d6": "The first step to creating the strong compact Sicilian Najdorf pawn structure ",
        "3. d4": "Challenging the strong c5 pawn which will be exchanged off to create the typical open Sicilian pawn structure. ",
        "3... cxd4": "The pawns are exchanged as planned...",
        "4. Nxd4 Nf6": "Black develops king side knight with tempo against e4...",
        "5. Nc3": "...and white defends while developing the queen side knight",
        "5... a6": "This move creates the Sicilian Najdorf which is possibly the most analysed position in chess and in my opinion Blacks best chances for a win against 1.e4. The alternative 6..g6 leads to the famously sharp Sicilian Dragon which has many adherents. But I prefer the Najdorf \n\nFrom here there are many continuations for White including 6.Bg5 and 6.Be3 which are probably the strongest continautions for White.",
        "6. Bc4": "This is a respectable continuation favoured by many. 6.Bc4 attacks the weakest most vulnerable f7 pawn...",
        "6... e6": "...but e6 blunts the bishop attack and typically the bishop will have to move again costing time and it remains vulnerable. This is why I personally do not rate 6.Bc4 very highly. But it is a respected move with many adherents and white has had many good wins from here.",
        "7. Bb3 b5": "A thematic move taking some additional space on Queenside and restricting white light squared bishop. This pawn can (and in this game will) move forward to b4 to disrupt Nc3",
        "8. O-O": "Castling to put the King safe....",
        "8... Be7": "Preparing in turn to castle...",
        "9. Qf3": "A common move in this position. The Queen develops and looks intimidating, but it can also (and in this game does) become a target.",
        "9... Qc7": "Developing the queen to a useful secure square and waiting to see how white continues...",
        "10. Be3": "Developing the dark squared bishop to a useful square. But this has the slight disadvantage of restricting the queens movement. Black will plan to harry the queen with future developing moves.",
        "10... O-O": "Castling to bring the black King to safety. It might look like black is castling into danger but in fact the position is secure and safe for black. ",
        "11. Qg3": "The queen moves again with a mating threat of Bh6 next move. But unfortunately for white it is now blacks move...",
        "11... b4": "...disrupting the c3 knight which is the only defender of e4....",
        "12. Nce2": "...the knight moves but takes another retreat square away from the white queen....",
        "12... Nxe4": "...taking the free undefended pawn and hitting the white queen which must move again. There are not many safe squares for the queen and increasing threats of discovered attacks from blacks two dangerous bishops. This enables black to develop quickly with each move bringing a new threat.",
        "13. Qg4": "...the queen attacks the knight....",
        "13... Nc5": "...which moves to a safer square and hits the light squared bishop. Notice that the queen now stands on the diagonal of blacks light squared bishop.",
        "14. c3": "...creating space for Bc2 and attacking black kingside with another piece...",
        "14... f5": "...black plans to exchange on b3 but first hits the white queen which has to move yet again. The black pawns on f5 e6 and d6 are now becoming a mobile, strong, and threatening unit....",
        "15. Qh3": "....the queen retreats but has few safe squares. She remains on the diagonal of blacks light squared bishop which creates future tactical opportunities for black.",
        "15... Nxb3": "...black exchanges the bishop before it can move to c2 and threaten black king side.",
        "16. axb3": "...recapturing with the knight was much better. The doubled pawn on b3 is weak and...",
        "16... e5": "...the knight will now be hit with e5. Moving the d pawn forward creates an additional new threat. Notice the queen is still on the c8 h3 diagonal and threatened by the c8 bishop with a xray...",
        "17. Qf3": "...so the queen moves to threaten the undefended rook on a8. But...",
        "17... Bb7": "...this is easily covered. The queen is hit yet again so must move...",
        "18. Ne6": "...a cute try but unfortunately...",
        "18... Qc8": "...black queen easily moves to safety attacking the knight. Now with two pieces en prise white is in serious danger...",
        "19. Qg3": "...yet again the queen moves and...",
        "19... Qxe6": "....the loose knight drops. The Qxb3 pawn capture and pawn f5 forking queen and bishop are now both threatened...",
        "20. Qh3": "...yet another queen move to avoid the fork. The white queen continues to have very few safe squares..",
        "20... g5": "...so I decline the free b3 pawn and restrict the white queen still further. Going for a mating attack now...",
        "21. g3": "...maybe giving the queen a retreat square but it opens the a8 h1 diagonal...",
        "21... Qd5": "...black queen immediately exploits this to create a battery with the light squared bishop and threaten mate on h1 so...",
        "22. f3": "....the mating threat is blocked but...",
        "22... Qd3": "...black queen forks knight and bishop...",
        "23. Kf2": "...forcing the king to defend but...",
        "23... g4": "... the g pawn moves forward disrupting the queen yet again and starting to create a mating net. Black must of course be careful because his king side is open. But white is busy dealing with all the threats so cannot yet exploit this vulnerability.\n\nCapturing f pawn does not help. After 24.fxg4 fxg4+ creates a discovered check from the f8 rook and attacks the queen which falls next move.",
        "24. Qh5": "The queen moves to one of the few safe squares available. She looks menacing but has very little backup. Blacks dark square bishop covers the most important dark squares around my king and the h7 pawn covers g6. So black's King is still safe despite being in the open.",
        "24... gxf3": "Capturing the f pawn is creating a mating net. f3 pawn is attacked twice but well defended by the b7 bishop so...",
        "25. Nc1": "...the knight retreats coveringthe e2 mating square. But now...",
        "25... Qc2+": "....queen checks...",
        "26. Ke1": "...black is now down material and in serious trouble. The white queen has been kicked around to an ineffective square and is cut off from defending the king by the well defended f3 pawn...",
        "26... bxc3": "...bxc3 creates new threats..",
        "27. bxc3": "...the recapture bxc3 results in Qxc3+ forking the loose rook...",
        "27... Qxc3+ 28. Kf2": "The a1 rook is undefended but...",
        "28... Qb2+": "...first I try another check. The king has just two moves. Kg2 and Qg2# so...",
        "29. Ke1": "...now the rook can be taken... ",
        "29... Qxa1": "...with the added benefit of pinning the c1 knight",
        "30. Bg5": "White tries to get a counter attack going but...",
        "30... f4": "...f pawn moves forward cutting of the defence of the pinned knight. My powerful mobile pawn chain d6 e5 f4 cut the board in half and the f3 pawn is a monster. Its does not matter that my e7 bishop is undefended because...",
        "31. Bxe7": "....the loose c1 knight falls with check...",
        "31... Qxc1+ 32. Kf2": "...driving the king to the mating square...",
        "32... Qe3#": "...my doubled f pawns co-ordinate beautifully with my queen to finish the game."
    },
    "url": "https://gameknot.com/annotation.pl/slow-ladder?gm=66842",
    "gameName": "Slow Ladder",
    "players": "flysco (1543) vs. henrycrun (2562)",
    "opening": "Sicilian (B90), Najdorf, Lipnitzky attack"
}