{
    "moves": {
        "1. e4": "\"Best by test.\" -- Bobby Fischer; \nOne drawback of this logical and probably most-played first move by White is that you have to face lots of responses (1...c5, ...e5, ...e6, ...c6, ...d6, ...g6, ...d5, ...Nf6, ...Nc6 are the most important possibilities for Black, sorted by popularity according to the GameKnot Database [World]). However, I like open games and have been to lazy to study queen-pawn openings (1. d4) so far to be honest ;-) Of course, another tempting possibility is the English opening (1. c4) which seem to transpose in a reversed Sicilian quite often. Maybe I'll experiment with it in the future.",
        "1... c5": "Some chess players argue that the only reason why 1. d4 is probably better than 1. e4 is because of this very strong reply by Black called the Sicilian defence, which can be avoided this way.",
        "2. d4": "Trying out an opening that I always find quite annoying and uncomfortable being Black, called the Smith-Morra gambit. The usual move here would be 2. Nf3.",
        "2... cxd4 3. c3": "Offering the gambit.",
        "3... Nf6": "My opponent declined the gambit. On 3... dxc3 White would of course take back with the knight to develop: 4. Nxc3 (another possibility is 4. Bc4, sacrificing two pawns) -- at this position, White is a pawn down, but has already developed a piece and a pawn in the center; the next step would be to place to bishop on c4 to put some pressure on f7.",
        "4. Qxd4": "Probably better and more usual here would have been e5. Bringing the queen out so early in the game breaks the opening rules and reminds me of the Scandinavian defence.",
        "4... Nc6": "Of course, Black uses the opportunity to develop with a gain of tempo.",
        "5. Qa4": "I thought, placing the queen on a diagonal pointing to the opponent's king can't hurt, and it seems to be quite a safe place - and in case, I can easily escape to c2 to d1 because the c-pawn has already advanced. In the Scandinavian defence (1. e4 d5 2. exd5 Qxd5 3. Nc3) Black also usually places the queen on this square: 3... Qa5.",
        "5... d6 6. Bb5": "Increasing the pressure towards the opponent's king.",
        "6... e6": "? The only move I expected here was Bd7, defending the c6 square.",
        "7. Bxc6+": "Of course, I take advantage of the poorly defended c6 square to win a pawn. It seems Black is the one who wants to offer a gambit this time -- I guess he could get quite a strong queen-side attack in exchange for the pawn, considering the open b- and c-files which provide nice homes for queen and rook.",
        "7... bxc6 8. Qxc6+ Bd7": "Again developing with a gain of tempo. No single minor piece of mine is developed so far and my queen is being hunted, I have to be careful!",
        "9. Qc4": "<refuted>Qa6 would also have been an option (maybe the better?), eying a7 and d6.</refuted> EDIT: Of course, Qa6 would lose a pawn! Thanks to nuntar for noticing.",
        "9... Rb8": "For example, *this* could have been avoided if my queen stood at the a6 square. Of course, black aims for a queen-side attack.",
        "10. Nd2": "The original intention was to place that knight on b3 to defend b2 -- my bishop wants to get into action!",
        "10... Bb5": "The happy queen hunting goes on.",
        "11. Qd4": "Seems to be the only safe square to me, not wanting to place queen on the b-file where the opponent's rook is watching me. Apart from that, it attacks the lonely pawn of a7.",
        "11... Qc7": "Defends the pawn and seizes the c-file.",
        "12. c4": "I changed my mind and planned to defend my queen-side with the pawn-chain a2-b3-c4. The knight is probably better used for a king-side attack!",
        "12... e5": "Delaying the bishop retreat by attacking my queen.",
        "13. Qd3 Ba6 14. b3": "Building a defence wall on the queen-side and opening two squares for the bishop which could be useful in the future (however, they weren't in this game).",
        "14... Qc5": "Puts pressure on f2. Being Black, I guess I just would have preferred developing my bishop on e7 to prepare castling.",
        "15. Ne2": "This knights target square is f5 which can be reached via g3.",
        "15... Bb7": "The opponents brings the light-squared bishop to a much more active place where it puts some pressure on e4.",
        "16. O-O": "Nf3 would have been tempting to finally let out my bishop on the king-side, but that would lose the pawn on e4. So my plan to that point was to castle and place the rook on e1, defending e4.",
        "16... Be7 17. Ng3": "f5 is already waiting!",
        "17... O-O 18. Nf5": "This now well-placed knight will proof to be useful soon.",
        "18... Rfe8": "Defending the bishop.",
        "19. Kh1": "As I planned advancing the f-pawn for launching a king-side attack, I had to get out of the pin.",
        "19... d5": "? Another pawn free of charge.",
        "20. exd5": "One more pawn is won, my queen-side pawn chain is getting stronger and the e-file was opened - I really can't complain. The only price for that is losing my support point for my beloved knight on f5.",
        "20... Rbd8": "The rook won't be very active on this file either.",
        "21. Qg3": "Creating a mate threat on g7.",
        "21... Nh5": "Attack is the best form of defence!",
        "22. Nh6+": "The magic knight coming into action. Black has two valid moves here, on either case I take the pawn on e5.",
        "22... Kf8 23. Qxe5": "Winning another pawn, attacking the knight and avoiding the loss of my own (23... gxh6? 24. Qh8# 1-0).",
        "23... Bf6": "Tempting, because it seems to guarantee a win of material on the first sight.",
        "24. Qxh5": "Thankfully, after taking that knight with my queen, another mate threat is created (I didn't even see that first and feared a loss of quality)...",
        "24... Bxa1": "... which my greedy opponent overlooked.",
        "25. Qxf7#": "That's it. Actually it's my first annotated game here on GameKnot, but it seems to be great fun and a good possibility for discussing games and learn from other chess players. So feel free to comment!"
    },
    "url": "https://gameknot.com/annotation.pl/smith-morra-declined-and-the-magic-knight?gm=30604",
    "gameName": "Smith-Morra declined and the magic knight",
    "players": "thestack (1446) vs. ramons44 (1493)",
    "opening": "Sicilian (B21), Smith-Morra gambit"
}