{
    "moves": {
        "1. e4": "Hi everyone, I have the first of a set of 3 recent games where my opponents have fallen to a Snap Mate.  Two were against the same opponent - in fact this match was in the Barmy Army Mini-Tournament and in the return challenge which will be part 2, this opponent met the same fate!  The third game was an unrated game against a 1500  player.  Note the ratings.  These 2 players are intermediate players so this fate can befall anyone - usually this happens when you are so wrapped up in your own plans you overlook your opponent's and you find yourself down a king, yikes!  I hope you have a good read.  Cheers - Joanne",
        "1... d5": "1. .......... d5 - this is the Scandinavian Defense or Centre Counter - black decides to counter in the centre.  Although it does bring out the queen a little early it is playable.",
        "2. exd5 Nf6": "2. ......... Nf6 - black does not bring out the queen - he develops and may recoup the doubleton later - in this game, however, he gambits the pawn for quick development and gets a strong middlegame attack, but it does not materialise.",
        "3. d4 Bg4 4. f3 Bf5 5. Bb5+ Nbd7": "5. ......... Nbd7 - eschews c6 as that will enable me to get rid of my doubled d pawn and be a clear pawn up.",
        "6. c4 a6 7. Bxd7+ Qxd7 8. Ne2 O-O-O": "8. ............ 0-0-0 - black has an enormous lead in development for the pawn, I spend the next two moves catching up.",
        "9. Nbc3 h6 10. Be3 g5 11. Ng3 Bg6 12. Nce4 Bg7 13. Nxf6 exf6 14. O-O": "14. 0-0 - As the e file has been opened after the exchange of knights I must finally decide where to put my king.  I castle short but have I castled into it?",
        "14... h5 15. Ne2 Rde8 16. Bf2 g4 17. fxg4 hxg4 18. Bg3": "18. Bg3 - the h file has been opened, danger, danger, danger!  My move Bg3 protects the h pawn against a possible doubling of rooks on the h file.",
        "18... Re3 19. Nf4": "19. Nf4 - this move is played to try and blockade a pawn push down the f file trapping or driving off Frere Lenoir from g3.",
        "19... Bf5 20. Re1 Re4 21. Rxe4 Bxe4": "21. ........... Bxe4 - but the pressure came down the e file and black allowed an exchange of a pair of rooks.  This cuts down black's chances of a mating attack along the h file but I must still be careful.",
        "22. Qd2": "22. Qd2 - Glenda clears a path for my queen rook to come into play.",
        "22... f5 23. Rd1 c6": "23. ........ c6? - helps me get rid of doubleton and I am now a clear pawn up.",
        "24. dxc6 Qxc6 25. b3 Bh6 26. d5": "26. d5 - queenside pawn structure now more solid and the Wicked Witch of the West is now en prise.  The passed d pawn also cuts communication between the witch and light squared bishop.  The witch moves away to d7.",
        "26... Qd7 27. Qd4": "27. Qd4 - suddenly Glenda moves onto a central square and hits out at the h8 rook.",
        "27... Rh7 28. Nh5": "28. Nh5 - threatens knight fork on f6.",
        "28... Be3+ 29. Qxe3 Rxh5 30. Qf4": "30. Qf4 - Glenda tries to camouflage herself between the black pieces and is backed up by Frere Lenoir.  Black must move his queen off d7 to prevent the mate threat on b8.",
        "30... f6 31. Qb8#": "31. Qb8# - but he misses it by playing his pawn up to f6, purpose of f6??? unknown, but there you are - warning, it can happen to anyone, be vigilent because Old Matey can strike from an apparently clear sky!  I got a 7 point rating haul from this venture.  It was time for round two ..........."
    },
    "url": "https://gameknot.com/annotation.pl/snap-mate-part-1?gm=19577",
    "gameName": "Snap Mate - Part 1",
    "players": "jstevens1 (1707) vs. NN (1603)",
    "opening": "Scandinavian defence (B01)"
}