{
    "moves": {
        "1. d4": "This time, however, white starts off with the QP opening.",
        "1... Nh6": "And, this is where he starts.  In general, it's considered weak to bring the N on the rim, but there's more to this then meets the eye.  It has a lot of theory, and remember he has a lot of skills.  Don't forget that understanding theory is also good for learning purposes.  Therefore, it boils down to one thing.  He plays moves like this to test your understandings in that and see if you can maintain the advantage which I'm used to seeing.  A lot of times, they don't, and that's where one can learn. ",
        "2. Bxh6": "Meanwhile, white decides to exchange on h6.  ",
        "2... gxh6 3. e4": "White now decides to open up the center in preparation for his LSB.",
        "3... Na6": "Meanwhile, Joe decides to place his other Knight on the rim.  In fact, this is the Sodium Attack.  And, with that, the lecture begins.  In it, Joe said, \"The opening move Na3 for white or even Na6 (if playing the black side)is the origin of the words...\"Sodium Attack\",since NaCl is considered the symbol for \"sodium\"in chemistry.When I add the move Nh3 as white or Nh6 as black,this has a partial symbol of hydrogen in chemical terms...thus,those openings then become the...\"Sodium/Hydrogen Attack games\".",
        "4. Bxa6": "?? By exchanging the other N for B, however, the game is now lost for white with best play, according to Joe.  It appears closed, but this position is actually opened, so by eliminating both of his Bishop's, TA will coordinate his Bishops and other material to deliver a devastating attack against white.",
        "4... bxa6 5. Nc3": "White goes back to development.",
        "5... Rb8": "But, Joe has other ideas, as now, he maintains an open file, by attacking b2.",
        "6. Rb1": "Which chesplyr protects.",
        "6... Bg7": "Joe Fianchetto's his B.",
        "7. Nf3": "Without the Bishop's, chesplyr finishes his development.  ",
        "7... d6": "Opening up another line for his LSB.",
        "8. O-O": "White then castles, as the final step in development.",
        "8... Bg4": "Pinning white's Nf3 with his B.  As noted which I'll show later on, Joe has the initiative, which is irreversible, as we'll see later on.  In fact, although not presented, I'm just starting to see it here as this pin happens to be quite nasty.  That's because black will, temporarly, pick up a pawn.",
        "9. Qd3": "Breaking the pin, but white cannot prevent, what's coming.",
        "9... Bxf3 10. Qxf3 Bxd4 11. Rfd1": "Hitting Bd4.",
        "11... Be5": "Which Joe defends.",
        "12. Qh5": "Threatening to get a pawn back, which Joe allows.  As, otherwise, he would defend with 12...Bg7  This is also where, in general, you don't want doubled pawns.  But, as he notes, it will benefit Joe, in this particular position.",
        "12... e6 13. Qxh6 Rg8": "Indirectly attacking the g file.  However, this does more then that.  As now, the his open file is a monster, no matter what white does.  That's because, we're already seeing the consequences of white's choice to grab his Knight's for Bishops.  The idea being is that with his Rg8 and Be5, white's already in rough shape because Joe now has complete control of the center.",
        "14. f4": "Despite white counterattack.",
        "14... Qf6": "So, Joe decides to exchange Queens, as white has no way out, but to take.",
        "15. Qxf6 Bxf6 16. Rd3": "Preparing to double, as white believes that he has center control, as Joe also notes.  But, what's also mentioned is that this will, believe it or not, add to TA's initiative.",
        "16... Rb4": "So, Joe threatens to win a pawn.  The threat is 17...Bxc3, and after white takes back, he can grab e4 since white's Nc3 would come off.",
        "17. a3": "But, white stops that by firing back, for now.",
        "17... Rc4 18. Rbd1": "Doubling up which, as noted, improves Joe's position even more.",
        "18... Ke7": "Starting with this move.",
        "19. e5": "I'm not sure why white played this, but this will give Joe a pawn.  And, taking back, which white will do, further exacerbate his position.",
        "19... dxe5 20. fxe5 Bxe5 21. Rd3d7+": "But, placing Joe in check with two Rook's also makes the situation worse, for white.  The idea being is that black will move his monarch to the back rank, waiting for white to deliver check.  When that happens, TA will continue to benefit.",
        "21... Kf8 22. Rd7d8+ Kg7 23. Rxg8+ Kxg8 24. Rd8+ Kg7 25. Ra8": "The idea is to win back a pawn.",
        "25... c6": "And, Joe allows it.  That's because it boils down to the same thing as we what we saw in one of reversions games, which I recently annotated.",
        "26. Rxa7": "?? As it turns out, this was a poisoned pawn.  So, by taking back...",
        "26... Bd4+": "Joe will win the Rook due to this skewer.",
        "27. Kf1 Bxa7": "Afterwhich, white resigned.  Now, that I've gotten into small parts of the lecture, it's time to present the main part as I have for a little.  But, that was before he showed the PGN of this game.  So, another of putting it is that now, you'll see, pretty much, the entire lecture.  And, what Joe outlined is the moral of this story.  In it, he said, \"Why is it so important for my chess adversaries to take those Knights of mine on squares a3 and h3 as white or squares a6 and h6 as black??They do it all the time like a cliche'.Are they thinking that they are weakening my pawn structure by forcing doubled pawns on the a and h files?If so,then my adversaries way of thinking lacks some basic chess theory.Let me ask you:What has more theoretical value in an open game...the Knight or the Bishop?Is the opening game closed above by move # 4?No,it is not closed.So,exchanging your Bishop(s)in yet,an open game is not theoretically sound.Is doubling of my pawns in the opening creating weakness?No it is not.Perhaps later in the game or creating doubled pawns in the center of the board by mid or endgame,it forces weakness...but not in the opening!Is it creating open files for my Rooks to compensate for any slight pawn weakness in the opening?You bet!You are actually providing me with more positional strength,not weakness,by taking those Knights of mine...either one or both,does not matter. \n\nYet,time and time again,players love to take both of my Knights by move #4.The result?Total destruction,even to 2400 rated players!But if a 2300-2400 player took those Knights in my weird opening,i'd be a bit surprised because they should know better.I have had this happen,and yes,they were destroyed as well.Perhaps they were just experimenting,who knows. \n\nNotice,by move 13 the file control already in the works by my black Rooks.Then notice how white thinks he is in control later on by attempting to come behind my forces and checking my King on my first rank and feeble attempts to capture my pawns?Then finally notice my poisoned pawn on a7.White takes the bait and forces an \"absolute skewer\"on himself.I just call it an ex-ray attack on whites King.I take his Rook and the game is over...opponent resigns in only 27 moves.Ok,say white would NOT have taken my poisoned pawn?He was still down one pawn at that juncture and still would have lost in the end,I promise.Trust me on that. \n\nHow to avoid most if not all of this? \n\nStop taking those Knights of mine by move #4!!!!They are deadly poison in the right hands.And my \"hands\"are as tuned in to the chess symphony as Mozarts Requiem in D minor. \n\nBut that \"mass of the dead\"is for you,not me,if you take those Knights!!!\"\n"
    },
    "url": "https://gameknot.com/annotation.pl/sodium-attack?gm=60403",
    "gameName": "Sodium Attack",
    "players": "chesplyr (1780) vs. tactical-abyss (2370)",
    "opening": "Queen's pawn (A40)"
}