{
    "moves": {
        "1. c4 Nf6 2. Nc3 e6 3. e4 Nc6": "one of the most popular ways to handle the english is to allow white to build up his center and then attack it from the flank. ",
        "4. d4 Bb4": "develops a piece and puts pressure on e4 by pinning the knight",
        "5. f3": "!? ",
        "5... d5 6. cxd5 exd5 7. e5": "A good move that forces the knight to a bad square",
        "7... Nh5 8. Be3 f6": "I have to attack the center quickly before white has a chance to cement his strength in the center",
        "9. f4": "Defending the pawn at the cost of a slightly overextended pawn structure",
        "9... Nxf4": "Sacrificing the knight for open lines and rapid mobilty",
        "10. Bxf4 fxe5 11. dxe5": "Anaylsis of the position:\n\n1. center control: Both players have equal control of the center. However, while the isolated e-pawn can be a future strong asset for white it is at present weaker than black's center pawn. no one has the advantage.\n2. Piece development and position: Both players have the same amount of pieces developed and are well centralized. No one has the advantage\n3. King Safety: Black is clearly better here because black is ready to castle while white still is two or three moves from castling to safety. Advantage for Black\n4. Tactical threats and open lines: White has strong pressure on d5 but at present has no real way to exploit it. While black has more tangible pressure on e5 because Black can use of the f-file to gain tempo against the undefended bishop. Also at black's disposal is the possiblity of d5-d4 thrust creating a uncomfortable pinch on c3. In conclusion based on the fact tha black has more tangible tactical threats, better use of the open lines, and stronger initative black is clearly better. ",
        "11... O-O": "So based upon the for mentioned analysis I have deviced the following play. 1. Increase the safety of my king and gain tempo on the undefended bishop. 2. liquidate my only weakness(the d-pawn) by forcing the exchange on c3. 3. complete my development 4. fight for control of the centre by centralizing my remaining peices. ",
        "12. Bg3 d4": "the best move as everything else allows white to build reinforcements. ",
        "13. a3": "Leads to very sharp play and complications",
        "13... dxc3 14. axb4 cxb2": "This is good and bad for black. It is good because black will have superior endgame based upon pawn structure. However, the pawn moves have caused serious weakness to emerge in Black's position. With 15. Qb3+ white can take control of e6 which is important for advancing the e pawn. To compensate for this weakness black has direct threats against the rook on a8, 15. ...Be6 attacking the queen if 15. Qb3+ and finally the c6 knight is checking both of White's weak pawns. In conclusion, black now has a clear edge but is not winning. In order to clarify the position black must gain a material advantage, retain his superior pawn structure and exchange pieces to a king-pawn or king-bishop-pawn ending then black wins. ",
        "15. Qb3+": "We have arrived at a very unclear position in which I think black is better. ",
        "15... Be6 16. Qxb2 Qd5": "Do you remember my plan: \n1. increase safery of king; 2. liquidate pawn weakness; 3. complete development; 4. fight for control of the center.\n\nI now enjoy a clear edge because on my greater control of center, greater mobilty and less exploitable weaknesses. ",
        "17. Ne2 Qe4": "Improving the position of the queen, side stepping 18. Nc3 and pinning the knight to hamper with white's kingside development. ",
        "18. Qb1": "White's only move is to force a draw by continuely checking the queen. ",
        "18... Qc4": "Of course I want to avoid the exchange ",
        "19. Ra3": "!? Had white continued with Qc1 I am not sure if I could have made any head way. ",
        "19... Rad8 20. Nf4 Qd4": "threatening mate in 1 and saving the bishop. I think white's intention for 19. Ra3 is to challenge 20. Qd4 with 21. Rd3 supported on the strong point of d3. However, that loses another pawn after 21. ...Qe5+ and black retains his attack.  ",
        "21. Rd3 Qxe5+ 22. Kd2 Bc4": "Bishop saved, the rook is pinned, black has virtual dominance in the center and white is not even completely development yet! Hin sight being 20/20 perhaps 21. Re3!? defending the e pawn would have might have hampered black's attack. ",
        "23. Kc1 Rxd3 24. Bxd3 Qe3+ 25. Kb2 Qd4+ 26. Kc1 Rxf4": "wins a bishop and kight for the rook. However, it also allows white to get in a spite attack. ",
        "27. Bxh7+ Kh8 28. Re1": "threatening mate in 1",
        "28... Bf7": "defending against the mate and threatening ...g6 traping the bishop",
        "29. Be4 Qc3+ 30. Qc2 Qxb4": "with a major material advantage the rest is elementary. Exchange pieces and head into a superior king-bishop-pawn ending. Now my superior pawn structure retained from move 14 becomes clear ",
        "31. Qd3 Nd4 32. Bxf4 Qxe1+": "The beginning of some back and forths that force the exchanges",
        "33. Kb2 Qb4+ 34. Kc1 Nb3+ 35. Kc2 Qc5+ 36. Kd1 Qg1+ 37. Kc2 Qf2+ 38. Bd2 Qxd2+ 39. Qxd2 Nxd2 40. Kxd2 b5": "A clear win for black since he can queen on both sides. If white plays to capture pawn on the queenside then Black plays on the opposite side. The white king is not able to defend on both sides at once",
        "41. Bc6 b4": "putting the pawn on squares that do not hinder the moblity of my bishop but out of reach of my opponent's",
        "42. Ke3 a5 43. Kd4 Kh7 44. g3 Kg6": ""
    },
    "url": "https://gameknot.com/annotation.pl/some-times-you-just-have-to-throw-mud?gm=40796",
    "gameName": "Some times you just have to throw mud",
    "players": "abitibipower (2083) vs. elyhim (2222)",
    "opening": "English (A18), Mikenas-Carls, Kevitz variation"
}