{
    "moves": {
        "1. c4": "English opening",
        "1... e5 2. g3 g6": "unsual for black to play this move here. Typical defenses with e5 are Bb4, Nf6 & 0-0...",
        "3. Bg2 Bg7 4. Nc3 f5": "...black seems to have an aggressive plan. Playing of f5 is normally expected as a counter act to whites queenside attack in the English but black is far to underdeveloped to attempt this now.  Developing the Queen side is needed first ....",
        "5. d4": "...i decided to attack this in light of the exposed king and underdeveloped route to queenside in case black thought of 0-0-0 eventually.\r\nWhites plan is straighforward. 0-0 and position pieces to zoom in on the Kingside.",
        "5... exd4 6. Nb5 c5": "..in protecting this pawn, in this manner, black has allowed a nasty attack to happen quickly. Underdevelopment is a cost for black here....",
        "7. Bf4": "...i maybe a pawn down for the moment but i will be the exchange up, if not a piece shortly and the black king will be in the middle from here in..",
        "7... Na6": "Necessary to prevent losing a complete piece.",
        "8. Nd6+ Ke7 9. Nxb7 Qb6": "Black can't take the knight as the long bishops will take out the Rook.",
        "10. Nxc5 Nxc5": "...black will win the pawn on a & b but this only activates my position more. Nf3 and 0-0 and black will be in trouble win all my pieces quickly in game there in....",
        "11. Bxa8 Qxb2 12. Rb1 Qc3+": "...thought Qxa2 was better. This only gains a tempo.",
        "13. Bd2 Qxc4 14. Nf3": "...still not worried about the a pawn. Black still has to take it and this will misplace his queen.",
        "14... Nf6 15. O-O": "...safety first.....",
        "15... Nfe4 16. Bb4": "...little pin...looking to bring in the queen to the game and the white bishop....lets strangle the position a bit...?",
        "16... d6 17. Bxe4": "...looking at Qa4.",
        "17... Nxe4 18. Qa4 Qa6 19. Qc2 Rd8 20. Rfd1 Qb6": "..just building pressure around the king..",
        "21. a4": "...make the queen uncomfy....",
        "21... a5 22. Ba3 Qa7 23. Qc6": "...here i will look to get the queens off the board. Pile up on d4 and see what happens....",
        "23... Rd7": "...this was a blunder i thought. blacks threat is d3 and Qxf2  trying to guide the d pawn home...but the king has h1. Black could have considered Nc3 with the winning of an exchange and this holds off the continuation Rb8 after Qc8 ....threatening Qe8  and Bb2 which is now blocked.",
        "24. Qxc8 d3 25. Rb8": "My mating threat is Qe8  with Bb2. Maybe Nc3 is still on...as dxe2 is awkward",
        "25... Qxf2+ 26. Kh1 Qxe2 27. Qe8+ Kf6 28. Bb2+": "...as flagged...",
        "28... Qxb2": "..forced...",
        "29. Rxb2 Nf2+": "...token resistance ..",
        "30. Rxf2": "Blacks position is gone."
    },
    "url": "https://gameknot.com/annotation.pl/some-fun-for-your-lunchbox?gm=10407",
    "gameName": "Some fun for your lunchbox!!",
    "players": "shambobala (1629) vs. cootzy (1556)",
    "opening": "English opening (A20)"
}