{
    "moves": {
        "1. d4 Nf6 2. Nc3 d6 3. e4": "Pretty standard opening for the Queen's pawn game. ",
        "3... g6": "This is the most popular option for black, you create an easy pocket to the attack the center pawn and you open the door for an easy king side castle. ",
        "4. Nf3": "Nf3 is a good counter I think, white developments further and covers the center. ",
        "4... Bg7": "Preparing the castle, but move is not as threatening. ",
        "5. Be2": "white responds by opening the door to his own king side castle. Be2 is better than Be3 because black can no longer pin the knight with Bg4. ",
        "5... Bg4": "As predicted.",
        "6. O-O O-O 7. Bg5": "At this moment the position is a mirror image of the other, neither black or myself holds an advantage. That",
        "7... Nbd7": "This is I think the first mistake black makes. Nc6 would cutoff e5, which is where I want to push the offensive: right down the center. ",
        "8. e5 dxe5 9. dxe5": "From here on in, things start to get messy. ",
        "9... Ne8": "I think this move is also a mistake, Nh5 would be a better option because black doesn't have to surrender the initiative so much.   ",
        "10. Nd4": "The pawn is not worth so much but e6, fx6, Nx6 leaves white in a pretty good place... or so it seems. If black takes the pawn, he removes a strategic threat but loses the bishop. Again the foresight of Be2, queen and bishop combinations work well together. But it was not meant to be; I made a mistake here. From here on in, black puts together a good combination to get the pawn off the table ",
        "10... Bxe2": "Forcing the trade",
        "11. Qxe2 Nxe5": "Black has gained a pawn, this was an error on my part since there is no way to easily recoup the material lose. Time to put together a counter attack",
        "12. Qe3": "supporting the bishop",
        "12... c6": "Not sure why black makes this move. Maybe to protect the pawn so his queen can move out? But there isn't much of a threat to the pawn in the first place. ",
        "13. Rfd1": "I am down material, but perhaps wining in terms of position.",
        "13... Qc7": "Forcing blacks hand. ",
        "14. f4 f6": "This move is a serious mistake for black and gave me a chance to get back in the game. Moving the pawn invites a pin with the knight",
        "15. fxe5": "i think this is actually the right move, white can either realize the pin or blast a hole through black's defense. ",
        "15... fxg5 16. Ne6": "realizing the pin ",
        "16... Qxe5 17. Qxe5 Bxe5 18. Nxf8 Kxf8": "This sequence of moves evens us out material. Black did a good job here of preventing me from establishing a blow out lead in material. Still white is better because of black's messy pawn structure on the right. ",
        "19. Rde1 Bf6 20. Re6": "Mistake on my part. The rook can't do anything here.. basically threw the move away. ",
        "20... Rd8": "seizing chance, black gets the other rook out. white can play Rd1, but will lose a pawn if he does (rd1, rxd1, nxd1, be2). ",
        "21. Re2": "Decided to cover the pawn and in doing so pave the road for the exchange. ",
        "21... Kf7 22. Rb1": "Mistake again, but not a vital one. Rd1 is the best move, this was just a plan to free up the knight. ",
        "22... Nd6 23. Ne4 Bd4+ 24. Kh1 h6 25. c3": "pressure on the bishop; still jockeying for position in this middle game stage. ",
        "25... Bf6 26. Nxd6+": "with the pawn moved out, bishop can't do as much damage. I decided getting a knight off the table was a better move. ",
        "26... exd6 27. Kg1": "I will soon trade away for the other rook, recognizing that I wanted to get the king moving. ",
        "27... d5 28. Rf1": "pinning the bishop. ",
        "28... Kg7 29. Re6": "Rf2 is an option, but I want to be able to eventually get the rook on the ole 7. ",
        "29... Rf8": "defense. ",
        "30. g3 h5 31. Rf2 d4 32. Kg2 dxc3": "I decided that it was acceptable to throw away a pawn to get the black rook off the table. The deficit is soon made up anyways. ",
        "33. bxc3 Bxc3 34. Re7+": "This move is very important, it allows white to trap the king on the ole 8' and allow white's king a free hand against those pawns. ",
        "34... Kg8 35. Rxf8+ Kxf8 36. Rxb7": "equalizing. ",
        "36... Bd4 37. Kf3 Bb6 38. Ke4": "the bishop can cover one and only one spot. white can get rid of the c pawn, but this frees up the king. The better option is to remove those pesky right side pawns. ",
        "38... c5 39. Ke5 c4 40. Kf6 Ke8 41. Re7+ Kf8 42. Re4": "Black's king is still trapped. ",
        "42... c3 43. Rc4": "the pawn frees the king up finally but white's king is already in position. ",
        "43... Ke8 44. Kxg6 h4 45. Kxg5 hxg3 46. hxg3 Ba5 47. Kf5 Ke7 48. g4 Kf7 49. g5": "the bishop is stuck to the pawn; which works just fine. I push the pawn into black territory. ",
        "49... Kg7 50. g6 Bd8": "having little choice; black lets go of the pawn. ",
        "51. Rxc3 a5 52. a4 Bb6 53. Rc6 Bd8 54. Rd6": "The position is still difficult for white to resolve. The bishop can keep dancing around squares and even Rd7 won't quite resolve the matter. ",
        "54... Be7": "Black hands white a big opportunity; pinning the bishop. ",
        "55. Rd7": "the king has to withdraw to the last line. ",
        "55... Kf8 56. Ra7": "threatening the pawn, Bb4 keeps this game running by Bd8 leads to defeat. ",
        "56... Bd8 57. Ra8": "AUGH THE PIN. The King has to move to cover...",
        "57... Ke8": "Freeing up the pawn at last to get to the that pesky 7. ",
        "58. g7": "with his last major piece now inevitably lost to prevent the promotion, black resigns. Would like to thank him for an excellent game. "
    },
    "url": "https://gameknot.com/annotation.pl/some-mistakes-some-good-stuff-the-queens-pawn?gm=37592",
    "gameName": "Some mistakes, some good stuff. The Queen's Pawn",
    "players": "big_red (1512) vs. Anon ",
    "opening": "Queen's pawn game (A45)"
}