{
    "moves": {
        "1. d4": "Thomas always plays 1. d4 as white...",
        "1... Nf6 2. c4 e6 3. Nf3": "And what will black choose?  The Bogo-Indian (Bb4 )?  The QGD (d5)?",
        "3... b6": "No, it's the Queen's Indian Defense.  I'm pretty sure Thomas is unfamiliar with this, but he played some solid developing moves over the next few.",
        "4. Bg5": "Sound and aggressive, pinning the knight and trying to force the bishop to develop weakly to e7.",
        "4... Bb7": "I like this better than Ba6, which is also playable.",
        "5. e3 h6": "Since this is white's \"bad bishop\" (all his pawns on the same color), Thomas is happy to give it up for the knight. ",
        "6. Bxf6 Qxf6": "Much better than recapturing with the pawn.  White must be careful, as black now has the two bishops and has some pressure against the white kingside.",
        "7. Be2": "I think this is the best move.",
        "7... d6": "Preparing to develop the knight to d7, but this makes his hard for black to use his dark-squared bishop.  I would prefer d5 in this position, I think, challenging the center and opening a line for my dark bishop as well.",
        "8. O-O": "Solid.",
        "8... Nd7 9. Nbd2": "I first thought Nc3 would have been stronger (supporting a d5 push -- if black won't take it, why not white?), but I like this square for the knight, as it helps defend the kingside.",
        "9... c5": "Having been stymied on the kingside, black tries to make something happen on the queenside.",
        "10. Qc2": "I didn't see the point of this move initially, but at least this puts the queen on an active diagonal and connects the rooks.  In a closed position, tempi aren't as important as on an open board.",
        "10... Be7": "There really is no better square for this bishop at this point, and black is ready to get his king out of the center.  It looks like the lines are drawn, and the battle will take place on the queenside.",
        "11. Rfd1": "!  The d-file will be at least half-opened at white's leisure, and white assesses (correctly) that a second rook will be better placed on c1 than e1.",
        "11... O-O 12. dxc5": "Now the point of Qc2 is clear -- it defends the b2 pawn.",
        "12... Nxc5 13. b4": "10. Qc2 also prevents the knight from infiltrating at e4 on this move.  I have to wonder if white saw all this when playing his 10th?",
        "13... Na6": "?!  I'm not sure about this, as, while it forces white to defend b4, it takes the knight away from the action.  I think black may be better served by retreating to d7, where he can fight for the center with Ne5.",
        "14. a3 Rfc8": "Black loads up on the half-open c-file...",
        "15. Rac1": "As does white.  But notice how white's second rook is much better placed than black's.  Still, white has to be careful about the possibility of a d5 break...",
        "15... d5": "! This looks pretty good for black to me.",
        "16. Qb3": "A good move, and I like it better than Qd3, which blocks the white bishop in.",
        "16... dxc4 17. Rxc4": "Did white recapture with the wrong piece?",
        "17... Bd5": "?  At first glance, this looks like a bad pin, but \"check\" is such a powerful thing...",
        "18. Rxc8+ Rxc8 19. Qa4": "This wins white a pawn.  But black will get something for it... white's queen will be out of position.",
        "19... Nc7": "Now the folly of 13. ... Na6 is clear.",
        "20. e4": "People often love in-between moves, but this one isn't so strong.",
        "20... b5": "A good move!  After Qxa7, black's b-pawn is safe now.",
        "21. Qxa7 Ba8": "Of course, black must save the bishop.",
        "22. e5": "The one benefit to having played e4 earlier -- white can harass the queen and prevent black's dark-squared bishop from roosting on d6.",
        "22... Qf5": "Although there wasn't much choice, leaving the Be7 undefended let's white set up a nice tactic!",
        "23. Bxb5": "Sacrifice the bishop for a pawn...",
        "23... Nxb5 24. Qxe7": "Take the Bishop on e7...",
        "24... Qc2 25. Re1": "Defend against checkmate, although it's worth noting that the rook can remain anywhere on the back rank and do that, as white can always defend by playing Nf1!",
        "25... Nxa3": "And although black has some pressure, white not only is up a pawn, but he is up a PASSED pawn.",
        "26. Qa7": "Driving the knight back.",
        "26... Nb5 27. Qa6": "This square threatens a lot of things... plus it sets up a trap.  If black plays Nd4, then the following (not forced line) wins for white: 28. Nxd4 Qxd2 29. Qxc8  Kh7 30. Rc1 (*not* 30. Nf3? Bxf3! with a big plus to black) Qxd4 31. Qxa7 Qxb4, and white is up a rook.",
        "27... Qc6": "Sidestepping the trap, but letting white go to an endgame with a big plus.",
        "28. Qxc6 Rxc6 29. Ra1": "I don't like this move -- it accomplishes little for white unless he plans to follow it up with Ra5 -- which he can't because his back rank is weak.",
        "29... Bb7 30. Nb3": "Allowing the black rook to penetrate.  Maybe Ne4 offered more winning chances?",
        "30... Rc3 31. Nfd4": "Allowing the b4 pawn to fall.",
        "31... Nxd4 32. Nxd4": "Now, black will play Rc4, winning back the b-pawn.  This leads to a dead-even endgame, so both players accept a draw.  Just goes to show that when you step onto a chessboard, everyone starts with the same 16 men, (err, 15 men and one lady), and anything can happen!"
    },
    "url": "https://gameknot.com/annotation.pl/southern-chess-fall-invitational-2006?gm=3320",
    "gameName": "Southern Chess Fall Invitational 2006",
    "players": "tag1153 (1385) vs. longinus (1901)",
    "opening": "Queen's Indian defence (E12)"
}