{
    "moves": {
        "1. d4": "My standard.",
        "1... e6": "I just don't see this often, and quite honestly - I don't like it a bit. I know remy well enough to know that he probably has been using this defense a lot lately, and is just wanting to spring it on his team captain as some sort of cruel joke.",
        "2. e4": "So I take what he gives me - a solid center.",
        "2... d5": "No brainer here folks - push e5 to restrict his Ng8 and lock in his Bc8.",
        "3. e5 c5": "And it suddenly hit me that we were playing the Advance Variation of the French. I despise the French. How did this happen? Ok - the question here is to whether or not exchange the light squared bishops. That's why I hate the French. White's \"comfortable\" response of trading these bishops lets black off the hook with his \"bad\" bishop. I decide to oblige (ceding initiative and tempo) in order to prepare for a quicker than normal endgame that - if I start planning now, I can win. We'll see.............",
        "4. Bb5+ Bd7 5. Bxd7+ Qxd7 6. c3": "And here we are. A typical French pawn structure. In this position, I just envisioned the c file with no pawns on it. I sure would like to own the first file of the game, so I encourage their exchange.",
        "6... cxd4": "remy accepts:)",
        "7. cxd4 Bb4+": "hmmm.......maybe we can do a similar exchange of the other bishops? If he accepts again, I'm still liking my pawn structure.",
        "8. Bd2 Bxd2+": "remy accepts again:)",
        "9. Qxd2 Ne7": "Logical development in preparation for castling.",
        "10. Ne2": "Likewise.",
        "10... O-O 11. O-O Nbc6": "Black finishes development.",
        "12. Nbc3": "And white does the same.",
        "12... a6": "?! A little too passive for me. Probably better was a move to control the c file.",
        "13. Na4": "Looking to fork enemy pieces.",
        "13... Nc8": "Yeah - I know. This move protects the vulnerable b6 square, but it is made running away. This has to be punished - but how?",
        "14. Rac1": "Well, let's start by jumping on that c file I've had on my mind.",
        "14... Nxe5": "?? Perhaps black saw something more deadly hitting him sooner than I expected, so he lashes out. I know my knight on a4 is hanging, but no need to panic. His knight will still be there in a minute. Let's throw the jab at his queen and get her distracted.",
        "15. Nc5": "! White now starts taking back the initiative.",
        "15... Nf3+": "?! Interesting move. The more I think about it, the more I appreciate it. So far, this game hasn't been strictly about maintaining material equality. It has been equally stubborn surges of initiative. Since his knight had already compromised its own integrity by that last \"unsound\" capture, remy decides to let him live fast and leave a good looking corpse:) This royal fork must be dealt with immediately, and the resulting position will severely hurt my pawn chain that I have so carefully nurtured. My kudos to you remy! This really was a strong move. Not content to just play Nc6 and slowly build on a  1 advantage, you send the message that you are still in control. I like that!",
        "16. gxf3": " 2, but at what cost? With my pawn chain now completely busted, I consider the g file as a potential weapon.",
        "16... Qe7": "Black saves his queen, and gets her ready to swing into attack on the kingside.",
        "17. Qb4": "Seeing a way to encourage the trade of queens, therefor pressing material advantage to a quick endgame.",
        "17... Qg5+": "Black's having none of that, so he maintains his aggression. At this point, I wasn't too worried, as the enemy queen is out hunting alone, while the the rest of her army is still chilling out in the barracks.",
        "18. Kh1 b5": "remy plans to hold his own on the queenside.",
        "19. Rfg1": "I just knew that g file would come in handy:) Time to start harrassing her majesty!",
        "19... Qe7": "? Qf5 was probably the play. Now white can yet again encourage the exchange of queens.",
        "20. Nd3 Qxb4": "remy accepts:) Every major exchange this game has resulted in a favorable position for white. Black probably should have played Nd6.",
        "21. Nxb4": "Mission objective accomplished.",
        "21... Ne7": "Black now prepares to utilize his space.",
        "22. Rc7": "! Seventh rank outposts can be deadly. Black now must either move or protect his knight. White is hoping to establish a lasting initiave here.",
        "22... Nf5": "Where else?",
        "23. Rgc1": "A double barrelled shotgun makes a very distinct noise:)",
        "23... Nh4": "Another lone hunter has come into my neck of the woods. Since the only protecting move is a retreat, white simply advances his problem.",
        "24. f4 Nf3": "? Ng6 was much stronger.",
        "25. Kg2": "Ok mister invader - let's set some ground rules here. Time to keep you moving and try to put you on a worthless square.",
        "25... Nd2": "ok - you're not going to cause too much trouble there..........",
        "26. Nc6": "Attacking space, and eying e7 with a check.",
        "26... h5": "!Perhaps fearing a weak back rank, black establishes a flight square and presses his pawn advantage on the kingside. Strong move.",
        "27. Na7": "Hoping to get all 4 rooks off the board on c8.",
        "27... Ne4": "remy gets his knight back onto a better square.",
        "28. Nc8": "A somewhat threatening looking move. Black can't take, and d6 and e7 are properly hit.",
        "28... g5": "Since he was already committed, remy surges ahead on the kingside.",
        "29. fxg5": "Given the chance to lose a doubled pawn, who wouldn't?",
        "29... Nxg5 30. h4": "! Not giving that black stallion time enough to breathe, white locks the position he wants to defend. The concern here, however, is that black must not be allowed to get a rook to the g file.",
        "30... Nh7": "Ne4 was much stronger.",
        "31. Kh3": "Preparing the g file for a rook.",
        "31... Kg7": "? This move just hastens white's plan.",
        "32. Rg1+": "Glad to get this rook in play faster than anticipated, I eagerly jump on it.",
        "32... Kf6": "Black just seems to be running right at his grave.",
        "33. Rgc1": "White had to protect his Nc8 or move it. Since it is doing such a nice job of disconnecting the enemy rooks, white lets it sit right there for the time being.",
        "33... Kg7": "I'm not sure if black has a plan here. Moving into danger on the g file, as well as walking into a pin.",
        "34. Nf4": "White figures that another gun in the fight can't hurt, so he lunges forward.",
        "34... Kh6": "Black's king seems to be walking through a minefield wearing a blindfold.",
        "35. Nd6": "It's about to hit the fan. White is threatening total mayhem after he gets  back on the g file.",
        "35... f5": "?! While this may seem natural and fluid, it ultimitely fails to.........",
        "36. Nf7+": "! Black is forced to walk right into a discovered check OR a direct check.",
        "36... Kg7 37. Rg1+": "And black resigns, after 37...Kf6 fails to 38. Rg6  . Nice game remybear! Good luck in the rest of the tournament:)"
    },
    "url": "https://gameknot.com/annotation.pl/southern-chess-winter-invitational-2007?gm=4487",
    "gameName": "Southern Chess Winter Invitational 2007",
    "players": "tag1153 (1345) vs. remybear (1439)",
    "opening": "Queen's pawn (A40)"
}