{
    "moves": {
        "1. e4 c5 2. Nf3 Nc6 3. d4 cxd4 4. Nxd4 Nf6 5. Nc3 d6 6. Bc4": "The Sozin Sicilian, a line that regained popularity in the 1960's as the Richter-Rauzer attack was analyzed to seeming exhaustion.",
        "6... e6 7. Be3 Be7 8. Qe2": "A relatively new idea, the Velimirovic attack leads to very sharp play.",
        "8... O-O 9. Bb3 Qc7 10. O-O-O a6 11. Rhg1": "An excellent move, taking away Black's primary drawing resource [11... NxN] and avoiding early endgames.",
        "11... b5": "At the time this game was played, this was considered the sharpest move.",
        "12. g4 b4 13. Nxc6 Qxc6 14. Nd5": "Based on the weakness of the long diagonal.",
        "14... exd5 15. g5": "The only way to continue the attack.",
        "15... dxe4": "Considered the best move, both then and now.",
        "16. gxf6 Bxf6 17. Bd5": "Splitting Black's forces.",
        "17... Qa4": "It was thought at the time this was played that Black stood well. If 18 BxR. 18... B-K3! 19 B-Q4 BxB 20 RxB QxRP is good for Black.",
        "18. Qh5 Be6": "Black has no choice (18... P-N3? 19 RxP ch! RPxR 20 QxP ch B-N2 21 B-Q4!)",
        "19. Rxg7+ Bxg7 20. Rg1 Rfc8 21. Rxg7+ Kxg7": "If 21... K-B1, 22 RxP ch forces mate.",
        "22. Qh6+ Kg8 23. Bxe4": "Here is the quiet move. White stops the mate on his QB2 and takes aim at KR7. A few variations will show the depth of White's conception: (a) 23... RxP ch 24 BxR R-QB1 25 QxP ch K-B-1 26 Q-R8 ch K-K2 27 B-N5 ch K-Q2 28 QxR ch Any 29 BxQ. (b) 23... QxP ch 24 BxQ B-B4 25 B-Q4 RxB ch 26 K-Q1 P-B3 27 QxBP and wins. (c) 23... R-B4 24 BxP ch K-R1 25 B-B5 ch K-N1 26 B-Q4 R-K4 27 BxR PxB 28 Q-R7 ch K-B1 29 BxB PxB 30 Q-R8 ch and after winning the Rook White has the better of the Q and P ending.",
        "23... b3": "This sets up counterplay based on ...PxRP.",
        "24. Bxh7+ Kh8 25. Bf5+ Kg8 26. Qh7+": "Going for the jugular.",
        "26... Kf8 27. Bh6+ Ke8 28. Qg8+ Ke7": "Black is trying to avoid walking into a pin.",
        "29. Bg5+ Kd7 30. Qxf7+ Kc6 31. Bxe6": "Here Black is lost despite the lively appearance of his position. On 31... QxP, for example, White wins by 32 Q-Q7 ch K-N3 33 B-K3 ch K-R4 34 B-Q2 ch K-N3 35 QxP ch R-B3 36 B-K3 ch K-N2 37 Q-Q7 ch R-B2 38 B-Q5 ch K-N1 39 Q-Q8 ch R-B1 40 Q-N6 mate. Another way to go is 31... R-B2 32 B-Q5 ch K-N3 33 B-K3 ch R-B4 34 Q-N7 ch K-R4 35 B-Q2 ch winning everything. The Bishops are sheer murder.",
        "31... Kb6 32. Be3+ Ka5": "There is no longer any viable defense.",
        "33. Bxc8 Rxc8 34. Qf5+ Rc5 35. Bxc5 Qb5": "The only practical try.",
        "36. Bb4+": "36 RPxP was good enough, but this simplification ends all Black's potential counterplay.",
        "36... Kxb4 37. a3+ Kc4 38. Qxb5+ axb5 39. cxb3+ Kd3 40. Kd1": "White seizes the opposition. Black resigns at once, as the K and P ending is hopeless."
    },
    "url": "https://gameknot.com/annotation.pl/soviet-preliminary-tournament-1969?gm=55351",
    "gameName": "Soviet preliminary tournament, 1969",
    "players": "Dimitriy Ostapenko (IM) vs. Pavel Jarchev (IM)",
    "opening": "Sicilian (B58), classical"
}