{
    "moves": {
        "1. e4 e6": "One of my most unsuccessful openings. Almost all the games in which I chose it led to my defeat -- fortunately, there weren't that many of them. Those I can remember now were with A. Bannik (USSR Championship, Riga 1958) and L. Portisch (at the European Team Championship, Oberhausen 1961). At that point my 'French Career' came to an end, I feel the losses were not accidental. Black, in the French, has to play with great accuracy, and this is a quality I never had a great measure of, neither now nor in my earlier days.",
        "2. d4 d5 3. Nc3 Bb4 4. e5 c5 5. Bd2": "It is not out of any desire to avoid early complications that Nezhmetdinov avoids the sharpest line approved by theory, namely, 5.a3 Bxc3+ (possibly I would have tried 5...Ba5 as in my game with Robert Fischer at 1960 Leipzig Olympiad) 6.bxc3 Ne7 7.Qg4 cxd4 with very complex play. The old move chosen by White does not have a very good reputation, but he had had a number of fine wins with it. One should note that, as a rule, the talented master did not try for a 'theoretical advantage'. He was normally interested in getting a tense and intresting position in which one could just play chess.",
        "5... Ne7 6. a3": "It is well known that in this position there is no harm for Black in permitting the knight to come in at d6 by 6.Nb5 Bxd2+ 7.Qxd2 0-0.",
        "6... Bxc3 7. Bxc3 b6": "At that time the latest word in theory. Furman had played the move two months earlier against Krogius in a game in the USSR Championship Semi-Final. Krogius's attempt to play along normal lines by 8.Qg4 Nf5 9.Bd3 h5 10.Qh3 Qg5 let Black get an excellent game. Nezhmetdinov preferred to vary.",
        "8. b4": "The idea behind Black's last move had been to reinforce c5. White in his turn tries to undermine this point.",
        "8... Qc7 9. Nf3 Nd7": "Black could also consider 9...cxb4!? 10.Bxb4 a5 when White can not stay on a3-f8 diagonal since 11.Bd6 is met by 11.Qc3+. Nor does a preliminary Bb5+ change this state of affairs. After 11.Bd2 Black can play either 11...0-0 or 11...Ba6. Admittedly, in this line Black has to take account of a weakness at b6. The text is certainly not bad.",
        "10. Be2 Nc6": "The struggle for the center is in full flight.",
        "11. O-O": "Sacrificing a pawn, the acceptance of which is risky in view of the central position of the king, e.g. 11...cxd4 12.Nxd4 Ncxe5 (12...Ndxe5 is met by 13.Nxc6 Nxc6 14.Bxg7) 13.Nb5 Qb8 14.f4 Ng6 15.f5 Nge5 16.fxe6 fxe6 17.Bh5+ g6 18.Bg4 with a dangerous attack.",
        "11... O-O": "Now Black intends to win the pawn so White's reply is more or less forced.",
        "12. bxc5 bxc5 13. dxc5": "Naturally, after the lapse of 18 years, it is hard to reproduce the full course of my thoughts at the time. I remember examining the position arising from 13...Nxc5 14.Bd3 Ne4 (the threat was 15.Bxh7+ while 14...Nxd3 lets White have the initiative) 15.Qe1 and I decided that Black would either have to exchange on c3 or weaken his position by 15...f5. In neither case did I like the look of my position. Then, while examining 13...Nxc5, I found myself distracted by the vague idea that capturing the e-pawn must in fact be much stronger. I worked through one variation and came to the conclusion that I would be able to occupy the center with my pawns. I stopped analysing beyond the 20th move, and this very position arose in the game! According to all rules, which I already knew quite well those days, to have a pawn center was a good thing. Now I am inclined to think that I was also influenced by the tournament position - I had made a good start and scored 4.5/5 before this game, so I was even more inclined than usual to an optimistic view of things.\n\nAfter the game it was established that 13...Nxc5 would have given Black a fine game. The point is that after 14.Bd3 Ne4 15.Qe1 Black has the quiet but strong move 15...Bb7. Since the pawn is taboo - 16.Bxe4 dxe4 17.Qxe4 Ne7 - Black holds the e4 point and can look to the future with confidence. The move I actually played was probably a decisive mistake though it takes White's exemplary play to demonstrate this.\n",
        "13... Ncxe5 14. Nxe5 Nxe5 15. Qd4 f6 16. f4 Nc6": "As I already indicated, Black was playing in accordance with a fixed plan and made all those moves quickly. However, even after 16...Nd7 17.f5 White has a considerable advantage - taking the c5-pawn is not playable because of the pin on the a3-f8 diagonal. ",
        "17. Qe3 Rd8": "Possibly the lesser evil was to go in for passive defence by 17...Ne7, but by preparing c2-c4 White would be in complete control.",
        "18. Rad1 e5": "This would seem one of those instances where the saying 'Better a bad plan than no plan at all' is inappropriate. Once Black achieves his aim of getting a pawn center his position, surprisingly, becomes quite hopeless.",
        "19. fxe5 fxe5 20. Bb5": "This move too had figured in my original calculations. The attempt to win a piece by 20...d4 fails to 21.Qe4 (Not so clear is 21.Bc4+ Kh8 22.Qg5 h6! 23.Qg6 Ne7) when the bishop cannot be taken because of 22.Bc4+ Kh8 23.Qxc6! while after 21...Bb7 22.Bc4+ Kh8 23.Rf7 Rd7 (Sacrificing the queen is not good enough: 23...dxc3 24.Rxc7 Rxd1+ 25.Kf2 Rd4 26.Qe3) 24.Rdf1 is very good for White.",
        "20... Bb7": "Now, however, I was satisfied with my position. White cannot win the e-pawn because of the little piece of tactics 21.Bxc6? d4! and Black keeps his pawn center intact. Unfortunately, I had missed one vital point - the pawn center although in no danger, is also of no value. This was underlined by White's next move.",
        "21. Qg3": "Suddenly I realised my opponent had assesed the position much more deeply than I had. The pressure on the e-pawn will, sooner or later, force Black to advance one of the center pawns, thus destroying the harmony of the two pawns abreast. Advancing the d-pawn always lets White play Bc4, thus taking part in an attack on the king. If the e-pawn is advanced then it is the other bishop which comes to life. For the moment, however, I did not consider my position to be too bad, and further defended g7.",
        "21... Rd7 22. Rf2": "Such quiet moves often make a stronger impression than a wild combination with heavy sacrifices. The threat is 23.Bxc6 Qxc6 24.Qxe5, thus revealing one of the points of the move - the c5-pawn will not taken with check. Another point is seen in the variation: 22...d4 23.Bc4+ Kh8 24.Rdf1.",
        "22... Re8 23. h3": "This is a quiet move, which opens a bolt hole for the king in case of emergency, and is the simplest way to underline the fact that Black's position is hopeless. I thought for about an hour here without finding a decent plan, and there finally came the eloquent move ...",
        "23... Ba8": "... with the vague hope of gaining a tempo later by attacking the bishop at b5.",
        "24. Ba4": "White rules out even that possibility. Moreover, he now has the option of Bb3.",
        "24... Bb7 25. Kh1": "White has no need to hurry.",
        "25... Ba8": "\"Pass.\"",
        "26. Rf5": "After a short introduction we now get a stormy finale. The concentrated threats now become unanswerable. No doubt I would have lost the game even if I had two hours left on my clock, but, as it was, I only had two minutes - the agony was not prolonged.",
        "26... e4": "The e-pawn could no longer be guarded and 26...d4 is met by the thematic 27.Bb3+ Kh8 28.Rdf1 Qd8 29.Rf7 Rxf7 30.Rxf7 Rg8 31.Bd2 and the entry of the dark-squared bishop into the attack is decisive.",
        "27. Qxc7 Rxc7 28. Rfxd5": "Not so much winning a pawn as opening the way for the bishops. The difference in the effectiveness of the first player's pieces and his opponent's is now clearly seen.",
        "28... e3 29. Rd5d7 e2": "Clearly a blunder, but if 29...Re7 then 30.Rxc7 Rxc7 31.Rd6 and Black can resign.",
        "30. Bb3+ Re6": "Otherwise it is immidiate mate.",
        "31. Bxe6+ Kf8 32. Bxg7+": "I feel it would have been more correct to have resigned several moves earlier, or to play 32...Ke8 and let White have the pretty 'aerial' mate 33.Bf7\n\n\nShortly after these notes were written the chess world heard with regret of the death of the great chess artist Rashid Nezhmetdinov. Players die, tournaments are forgotten, but the works of great artists are left behind them to live on for ever in memory of their creators.\n\n\nLet this game and notes remain as my modest tribute to the memory of a fine player.\n\n\nDedicated by M. Tal, 20th June, 1974\n"
    },
    "url": "https://gameknot.com/annotation.pl/soviet-championship-1957?gm=49781",
    "gameName": "Soviet Championship, 1957",
    "players": "Rashid Nezhmetdinov (IM) vs. Mikhail Tal (GM)",
    "opening": "French (C17), Winawer, advance, Bogolyubov variation"
}