{
    "moves": {
        "1. e4": "As round three of the Space City Open begins, I find myself with 1 point out of 2, and in the middle of the early pack. My opponent this round is a 12 year old kid who I am totally unfamiliar with. He is rated 1237, but has already taken down the #3 guy in the section (a 1512) so I can't take him for granted like I almost did with my last opponent. I vow not to lose this game. I want to end this first day of the tourney with at least an even score. He opens with the popular 1. e4.",
        "1... d5": "After several tournaments of experimenting with the Caro Kann, I decide to return to my old favorite the Scandanavian.",
        "2. e5": "The advance variation, which I feel is the most aggressive way to deal with the Scandi.",
        "2... c5 3. Nf3 Nc6": "Also playable is 3...Bg4, but I feel that this way better deals with the threat of white playing Bb5.",
        "4. Bb5": "Which he does.",
        "4... Bd7": "There are several ways to deal with this pin, including a6 and Qc7, but I like this one best as it may yield my LSB play on the long diagonal.",
        "5. Bxc6": "?! White starts swinging first, and trades bishop for knight. I was expecting something a little more developmental, such as d4.",
        "5... Bxc6 6. O-O": "White castles to safety immediately.",
        "6... d4": "As I have the bishop pair, I want to open up as many lines as I can to accentuate it. This move also prevents Nc3.",
        "7. d3 e6 8. Nbd2": "White develops nicely, and answers the question of where this knight will be most effective. I see him going to b3 or even e4 once Re1 is played.",
        "8... Ne7": "I have similar ideas for my knight as well.",
        "9. b3": "?! I didn't like this move for white, and went into a deep think. I was trying to figure out a way to punish what I considered to be a slow move. ",
        "9... b5": "I opt to shut down c4 for his knight while claiming some nice space on the queenside.",
        "10. Ba3": "!? This is a sneaky move. White tempts me to play b4, thereby reopening c4 for his knight.",
        "10... Nd5": "This is just a natural square for this knight. c5 is now protected, and c3 is looking juicy.",
        "11. Re1": "White now secures e4 for his knight once I vacate d5.",
        "11... Nc3 12. Qc1 Bxf3": "?! I have no idea what prompted me to do this. I trade bishop for knight and allow him to reposition his knight in such a way that opens up more scope for his DSB. Bad play.....",
        "13. Nxf3 b4 14. Bb2 Nd5": "Trying to regroup a llittle after my mental slip, I reposition to the center to avoid being forced to double my pawns on the c file.",
        "15. Nd2": "! Good move kid....white now has two tasty outposts to consider.",
        "15... Qg5": "?! I walked outside to smoke while I considered this move. I'm considering ways to assault his king immediately as most of his pieces are over on the queenside. The problem is, I just don't have enough ammo. I'm thinking Nf4 with possibly some help from h5. However, I didn't correctly analyze my position after he played......",
        "16. Ne4": "16...Nf4 fails miserably to g3. After Nh3  Kh1 I can't take on f2 as his knight protects it. I didn't see this clearly.",
        "16... Qxc1": "As my queen was threatened, she obviously had to move. I decide (once again somewhat foolishly) to remove the queens from the board - but this allows his DSB to get back into the action. I just did him a favor. I start to lose some confidence in my position, as my DSB isn't really doing much.",
        "17. Bxc1 Be7 18. Bg5": "Decision time. I spent about 25 minutes on this one. Option #1 - BxB NxB 0-0 Ne4 and we are equal but his knight is better. Option #2 - Rc8 BxB KxB Nd6 and he is permanently posted deep in my territory. Option #3 - f6 exf gxf Nf6  and there are just too many threats near my king. Once again, I go smoke and curse this game......",
        "18... Bxg5": "I choose what I considered to be the lesser of three evils. I'm convinced white will wind up with the better position.",
        "19. Nxg5 O-O 20. a3": "?! Whoa....maybe he didn't see how strong Ne4 was.",
        "20... a5": "21. axb axb and I can hold the position.",
        "21. Ne4": "White re-establishes the threat on c5 with this powerfully placed knight.",
        "21... Rfc8 22. Ra2": "White plans to double down the a file, forcing my c8 rook to a8 and winning my c pawn.",
        "22... a4": "I attempt to confuse the issue. As my knight can't get to c3 without hurting my pawn structure, I encourage him to take on b4 to get my knight to b4 and looking for targets.",
        "23. Rea1": "White sticks with his plan.",
        "23... f5": "A gamble. If I can kick him out of e4 I may be able to get some offense going, thereby slowing down his potential attack. I can handle him taking e.p., as gxf is protected and f5 would follow. ",
        "24. Nd6": "White evades the danger and jumps on a nice post which threatens my rook.",
        "24... Nc3": "Once again, I confuse the issue. I may end up dropping a pawn, but I feel that I'll have some good counterplay.",
        "25. Nxc8": "White says \"OK - prove it to me.\"",
        "25... Nxa2 26. Rxa2 Rxc8 27. bxa4": "I've dropped a pawn, but now entertain ideas of a back row mate.",
        "27... c4": "I don't want to give my opponent any time to reinforce, so I press the issue.",
        "28. g3": "White stops any ideas of a back row mate.",
        "28... cxd3": "It's looking like I'll still be a pawn down, but I'll have plenty of room to manuever.",
        "29. cxd3 bxa3": "In post mortem, I was shown 29...b3 30. Rb2 Rc2 by my friend, and truth be told I missed it completely.",
        "30. Rxa3 Rc3": "I can now win back the pawn.",
        "31. Ra1 Rxd3 32. f4": "I think white is envisioning a board minus both rooks and both passers (which we eventually get) and strives for the better advancement.",
        "32... Rc3 33. Kg2": "Continuing his plan to be better placed after rooks and passers come off.",
        "33... Rc2+ 34. Kh3": "With his king now safe, white digs in his heels for a king and pawn endgame.",
        "34... d3 35. a5 d2 36. Rd1 Ra2 37. a6 h6": "It's obvious that his passer is not of any concern, so I prep g5 as I really want to keep any chance of winning alive.",
        "38. Kh4": "White sees my idea, and puts a stop to it immediately.",
        "38... g6": "I made this move with the thought that under no circumstances am I going to lose this game. If worse comes to worse, I'll simply barricade myself into a nice little box that he can't penetrate and we will draw. I'm really tired by this point, and my brain is fried. I have visions of margaritas dancing in my head, but put them aside as I challenge myself not to blow this game after all of this thinking.",
        "39. h3": "White keeps winning chances alive for himself, and preps g4.",
        "39... Kf7": "Once rooks and passers go, all I see is barricading myself in this corner.",
        "40. a7 Rxa7 41. Rxd2 Ke7": "With hopes of removing the rooks.",
        "42. Rd4": "! Nice move. Any hope I had of play against his f pawn is now mute. Little does he realize I'll be happy with a draw right now:)",
        "42... Rd7": "And I offer him a draw.",
        "43. Ra4": "White declines, and most likely sees play along my back rank.",
        "43... Kf7": "Puposefully showing my intent to draw.",
        "44. Ra6 Re7": "I have no intent of moving any of my pawns, and am content to just simply protect them.",
        "45. Ra3 Rd7 46. g4": "White makes one last attempt to open things up.",
        "46... Kg7 47. gxf5 gxf5 48. Kh5": "Looking to get his rook to g6 if I don't prevent it.",
        "48... Kh7 49. Rg3 Rg7": "I'll remove the rooks if he doesn't, and if he plays along the 3rd rank I'll simply play Re7.",
        "50. Kh4 Rxg3 51. Kxg3 Kg6 52. Kh4": "And I gladly accept his draw offer. Whew!....this little monster sure took a lot out of me. At the end of day #1, I'm sitting at 1.5/3. It's going to take a big day #2 to secure any prize money, but by this time of the night I'm really not thinking too much about that. My favorite restaurant in Huntsville closes in an hour and half, and my friend and I both are finally going to get those margaritas we have been thinking of all day:)"
    },
    "url": "https://gameknot.com/annotation.pl/space-city-open-07-reserve-rd-3?gm=11154",
    "gameName": "Space City Open 07 (Reserve - rd #3)",
    "players": "Erick L. (1237) vs. Thomas G. (1456)",
    "opening": "Scandinavian (centre counter) defence (B01)"
}