{
    "moves": {
        "1. e4": "Welcome to day two of the Space City Open. After a night of tequila, a lumpy hotel mattress, and a roomate whose snores can be heard from space, I am sufficiently hung over, sore, and tired enough for some more chess. I enter the tourney room, and immediately check out the wall chart. I'm struck by two interesting facts - one, I have the black pieces yet again (I had figured on playing white in round 4), and two, my opponent is yet another kid of about 12. Believe me when I say I really want to win this game - for two reasons. The obvious - I need the full point to have any chance to cash; the other reason is that this kid yesterday exhibited some of the worse sportsmanship I've ever seen at a chess tournament. Some of the things that came out of this kids mouth were just shameful - especially comments directed towards opponents he had beaten (he was 2/3 entering round 4). I won't go into specifics, but suffice it to say that every player in the Reserve section was rooting for me. This kid needed to be put down hard, and I was just ornery enough on this morning to do it. He drops a rook early, and I tell myself that if given the opportunity I will give him a taste of his own medicine. Call me insensitive - or a bad guy - if you like, but circumstances dictated that I crush him to teach him a lesson. While I take no real pride in the quality of the game, it was satisfying to put him in his place. White opens with 1. e4.",
        "1... d5": "Once again, I play the Scandi.",
        "2. exd5 Qxd5 3. Nc3 Qa5": "My favorite Scandi variation, which I have seen 1000's of times.",
        "4. d4": "This is now REALLY my favorite line. Black's d pawn may very well end up being a target.",
        "4... c6": "Creating an escape route for my queen, which may give me the chance to pick up his d pawn.",
        "5. Nf3 Bg4 6. Bd2 Qd8": "I couldn't have scripted this any better. Little does my opponent know that of all of the opening variations possible in chess, this is the one that I am most familiar with.",
        "7. Bf4": "Moving a piece twice in the opening....another good omen for me.",
        "7... Bxf3": "A simple tactical victory.",
        "8. Qxf3 Qxd4 9. Rd1": "Ahead in development, white gains tempo with an attack on my queen. One of the intersting things about the Scandinavian is that white usually can gain a developmental edge, but black can neutralize it quite easily with correct play and just sit back and wait him out.",
        "9... Qb6": "Protecting my queen and keeping his DSB out of c7.",
        "10. Qd3": "White is apparently seeking a quick knockout down the d file, but he will come up short, as blacks developmental catch up protects his vulnerable squares.",
        "10... Nf6 11. Na4": "Trying to somehow trap or otherwise harrass my queen. However.....",
        "11... Qa5+": "Slows him down.",
        "12. c3 Nbd7": "Circles the wagons and introduces the idea of 0-0-0 that white must consider.",
        "13. b3": "Protects the hanging piece while giving it a new square to jump to.",
        "13... e6 14. g3": "I felt that his 10th was a little premature, and this move (in his mind IMHO) goes to answer the question of his LSB. However, it does open a line towards his Rh1.",
        "14... Qd5": "d5 is such a sexy square in the Scandinavian Defense. Blacks queen and both knights have access to it rather quickly, and here I utilize it to force an exchange of queens.",
        "15. Qc2": "?? Thinking this discovered attack on my queen is powerful, my opponent totally misses his hanging rook.",
        "15... Qxh1": "Being given the gift of such an enormous early advantage, I tell myself to refocus, get pieces off of the board, and put him away.",
        "16. Qd3": "? Is he focused on d7 for some reason? My opponent now gives me yet another gift as I can remove the queens.",
        "16... Qe4+ 17. Qxe4 Nxe4 18. Bg2": "My opponent offered me a draw here. Remembering his antics of the previous day, I stifle my natural response of \"Are you effing kidding me?\" and very politely say \"No thank you\".",
        "18... Ndc5": "My knights are working extremely well in tandem anchored around the protected c5 square.",
        "19. Nb2": "Trying to get repositioned....",
        "19... Nxc3": "....at the cost of yet another pawn. I'm thinking of my opponents comments to a player that he beat yesterday. \"I took all of your pieces! Hahahaha....You're not any good are you?\" Take a wild guess where I'm heading with this...........",
        "20. Rd4": "Protecting his rook and keeping it active.....",
        "20... Nxa2": "....but dropping another pawn.",
        "21. Bd2": "I assume with the intent of preventing me from playing back Nb4.",
        "21... Nxb3": "I'm now officially trying to run the table.",
        "22. Rc4": "Once again protecting the rook.",
        "22... Nxd2 23. Kxd2 O-O-O+": "Be7, rooks get vertical, and it's a shutout.",
        "24. Kc2 Nb4+ 25. Kb3": "Once again, I get a draw offer. I don't say a word.",
        "25... Rd2 26. Be4 Rxf2 27. h4 Be7 28. Rc1 Rd8 29. Ra1 Na6": "I'm not going to give him anything, and threaten Nc5.",
        "30. Nc4 Nc5+": "Another piece bites the dust.",
        "31. Kc3 Nxe4+ 32. Kb3 Rf3+ 33. Kc2 Rf2+ 34. Kc1 Rf1+": "Bye bye rook.",
        "35. Kb2 Bf6+": "No, I'm not going to trade rooks. I'm going to win a rook.",
        "36. Kb3 Rxa1 37. Kc2 Rdd1 38. Nb2": "?? The game is lost anyway, but why just give away pieces?",
        "38... Bxb2 39. Kxb2 Rdc1": "White's king is now safely trapped on the b file.",
        "40. g4 a5 41. h5 a4 42. h6 a3+ 43. Kb3": "Obviously forced.",
        "43... gxh6 44. g5 Rc3+ 45. Ka4 b5+ 46. Ka5 Rb1": "A spite queen is coming just for good measure.",
        "47. g6": "You guessed it - draw offer.",
        "47... hxg6 48. Ka6 Kc7": "Shutting down b6.",
        "49. Ka7 a2 50. Ka6 a1=Q#": "I shake a dead fish hand, say \"Good game\", and promptly go record the result. Junior pitches a fit and runs to momma. Three people offer to buy me beer. I forget about this game quickly, and avoid talking about my opponent although several other players are obviously pleased. I, however, have other things to consider. To my pleasant surprise, I now calculate that if I can win round 5, and another player wins her game, she and I will tie for 2nd place, and we will split $300. We chat for a bit, wish each other luck, and prepare for the last round. She studies an opening book. I smoke cigarettes:)"
    },
    "url": "https://gameknot.com/annotation.pl/space-city-open-07-reserve-rd-4?gm=11155",
    "gameName": "Space City Open 07 (Reserve - rd #4)",
    "players": "Dennis D. (1215) vs. Thomas G. (1456)",
    "opening": "Scandinavian defence, Lasker variation (B01)"
}