{
    "moves": {
        "1. d4": "I am going to annotate a game played in the 70s by Kasparov, the strongest player in chess history. This consisted of a pawn sacrifice(pure) in the opening. the compensation black gets is not very clear, and white gets an edge, but Kasparov uses his skill to win back the material and after some more tactics, he emerges with a decisive material advantage.",
        "1... Nf6 2. c4 g6": "after this, we can predict Kasparov will go for a gruenfeld or king's indian.",
        "3. Nc3 Bg7": "he goes for the king's indian.",
        "4. e4": "the standard opening strategy here. Black fights for the center with pieces, and white occupies it with pawns.",
        "4... d6": "restraining white's pawn center.",
        "5. h3 O-O": "development first! ",
        "6. Be3 e5": "the strike in the center. ",
        "7. d5": "the best choice, maintaining a space advantage in the center. Right now, these center pawns decide the strategy for black and white. Black has more space on the kingside, and he should attack there, which he usually does with a pawn storm. White should try to make gains on the queenside.",
        "7... Nh5": "very logical. Black immediately plans ...f5",
        "8. Be2 f5": "the defining moment of the sacrifice. Black ignores the attack on his knight and plays f5 immediately.",
        "9. Bxh5 gxh5 10. Qxh5": "black is now down a pawn. However, the compensation he gets is unclear. he averts time loss by not retreating the knight, but a closed position like time has little meaning. He does gain the bishop pair, and he can make the remaining white bishop very passive. These factors may compensate him, as they are long term advantages in this closed position.",
        "10... f4": "making the white bishop passive.",
        "11. Bd2 Nd7": "now black gets his pieces out normally.",
        "12. O-O-O Nf6 13. Qe2": "black's compensation for the pawn is very long term.",
        "13... Qe8": "very logical, the queen will be useful on the light squares.",
        "14. Nf3 c5": "black will want to attack on the queenside, so he makes space there.",
        "15. Kb1 a6": "black is ready to strike with pawns on the queenside.",
        "16. g4": "white's attack is on the kingside.",
        "16... Bd7 17. Nh4": "the square f5 is an interior weakness. White's knight can go to it.",
        "17... b5": "space on the queenside.",
        "18. Nf5": "a mistake. It's very obvious that after b4 the white knight on c3 is trapped.",
        "18... b4": "now white gets back the material with an edge.",
        "19. Nxd6 Qe7 20. Nf5 Bxf5": "this equalizes material.",
        "21. exf5 bxc3 22. Bxc3 Nd7 23. d6": "the pawn is well blocked by the knight and is easier to attack here.",
        "23... Qf7 24. f3": "this fixes the black pawns on the dark squares.",
        "24... Rab8": "facing the white king.",
        "25. Rd5": "this targets the black pawns, but black can win more material.",
        "25... Nb6 26. Rhd1": "This exchange sacrifice is best. retreating with Rd2 loses the important c4 pawn.",
        "26... Nxd5 27. Rxd5 e4": "threatening to win a piece.",
        "28. f6 Bxf6 29. Rf5": "another move with a tactical flaw. Black gains a decisive advantage here.",
        "29... Bxc3": "the sham queen sacrifice goes to a winning endgame.",
        "30. Rxf7 Rxb2+ 31. Qxb2 Bxb2 32. Re7 exf3": "now white has no time to get the bishop.",
        "33. Re1 f2 34. Rf1 Bd4": "this is crushing for black. White resigns."
    },
    "url": "https://gameknot.com/annotation.pl/speculative-pawn-sacrifice-in-the-kings-indian?gm=33611",
    "gameName": "Speculative pawn sacrifice in the King's indian",
    "players": "pavlenko  vs. Kasparov ",
    "opening": "King's Indian (E71), Makagonov system (5.h3)"
}