{
    "moves": {
        "1. e4": "Playing for the loss",
        "1... e5": "Returning the favor",
        "2. Nf3 Nf6": "My standard reply",
        "3. d4": "I think this is slightly better than Nxe5",
        "3... Nxe4 4. dxe5": "Rather unusual. I think Bd3 is stronger",
        "4... d5 5. exd6 e.p.": "This allows Black easy equality",
        "5... Bxd6 6. Bc4 O-O 7. O-O Bg4": "A blunder. I had some kind of optical illusion that 8.Bd5 doesn't work here for White, but clearly after ...Nc5 White can play b4 and win material. 8... Bxh2+ doesn't work because of 9.Kh1! Nxf2+ 10.Rxf2 c6 11.Bxf7+",
        "8. Be3 Nf6": "A waste of time. I was still worried about Bd6, but I should have just gone ahead and developed with ... Nc6.",
        "9. Nbd2 Nc6 10. a3": "Apparently he was worried about ... Na5 but I think this was a waste of time.",
        "10... Re8 11. c3 Ne5 12. Ba2 c6 13. Re1 Qc7 14. h3 Bh5 15. g4": "This loosening move really surprised me.",
        "15... Bg6 16. Nxe5 Bxe5 17. Nf3 Bf4 18. Qe2": "This surprised me as well as it saddles White with an isolated pawn and further loosens the Kingside.",
        "18... Bxe3 19. fxe3 Be4 20. Ng5 Qg3+ 21. Kf1 Bd5 22. c4 Qh4": "In retrospect this was probably impatient. ...Bh1 or even ...Be6 would have worked better.",
        "23. cxd5 Nxd5": "I had this sac in mind already when I played my 22nd move. Now White must lose the h pawn as well.",
        "24. Bxd5 cxd5 25. Nf3 Qxh3+ 26. Qg2 Qh6 27. g5": "White's Kingside is incredibly loose, but the g pawn ends up being a thorn in Black's side.",
        "27... Qb6 28. Re2 Rac8": "... Rxe3 was better but I didn't want the simplification that would follow",
        "29. Nd4 Re4 30. Qh3 Rce8 31. Kf2 Qg6 32. Rg1 Re4e5 33. Nf3 Re5e7 34. Nh4 Qb6 35. b4": "White is having trouble making progress but this simply weakens the a pawn",
        "35... Qa6 36. Nf5 Re7e5 37. Rg3 Qg6 38. Rf3 d4": "Black takes the opportunity to get rid of his weak d pawn and also remove the annoying White g pawn",
        "39. Nxd4 Rxg5": "The wrong way! I should have taken with the Queen. Now Black loses.",
        "40. Qd7": "Caught me by surprise. I didn't think White could allow the Rook check.",
        "40... Rg2+ 41. Ke1 Qb1+ 42. Kd2 Qb2+ 43. Kd3 Qxa3+ 44. Kc4 Qa6+ 45. b5 Qa4+ 46. Kc3 Qa1+ 47. Kb4 a5+": "This loses. But if Black plays an immediate ...Qb1+, then 48. Kc4 Qc1+ 49. Nc2 and Black is out of checks",
        "48. bxa6 e.p. Qb1+ 49. Nb3 Qe4+ 50. Ka3 Re7 51. axb7": "Defeated at last by a lowly pawn."
    },
    "url": "https://gameknot.com/annotation.pl/speculative-piece-sac-that-fails?gm=47105",
    "gameName": "Speculative piece sac that fails.",
    "players": "cracae (1765) vs. fkohn (1808)",
    "opening": "Petrov (C43), modern attack, Symmetrical variation"
}