{
    "moves": {
        "1. e4 c5 2. f4": "Beginning the so-called Grand Prix Attack, popular for its inaugurating a K-side attack.",
        "2... d5": "... Possibly this is the response that means that the Grand Prix will never supersede White's main lines of the Sicilian!",
        "3. Nf3": "An unusual response that gambits White's e-pawn.  But White has something more spectacular already in mind...",
        "3... dxe4": "Why not? ",
        "4. Ng5": "According to plan.  Also possible was 4.Ne5.",
        "4... Nf6 5. Bc4": "A straightforward attack on f7.  Black could simply block this with 5...e6, but there's nothing wrong with developing a piece to drive back the c4-bishop, is there?",
        "5... Bg4": "Apparently White must play 6.Be2 if he doesn't want to give up more material...",
        "6. Qxg4": "(!!?)  Giving up the queen for the sake of keeping his attack on f7!?  White's development has hardly begun. too!  Incidentally, 6.Bxf7+  would have transposed into the game continuation.  Either way, White is speculating very heavily!",
        "6... Nxg4": "There's no real choice.  Black has to test White's idea.",
        "7. Bxf7+ Kd7 8. Be6+": "Forking K and N, which will ensure White at least gets a second minor piece for his queen.  Still, he needs a third to restore the material balance!",
        "8... Kc7": "(!?) One has to ask, what would White have played had the king returned to e8?  Would White have settled for a perpetual (9.Bxf7 ) or taken the fork (9.Nf7?! Qd4!, say)?  It seems the latter course would have been very risky -  too risky perhaps?  The game might have ended in a draw right here!\r\nHowever, Black was not wrong at this point in fancying her chances of surviving to win.",
        "9. Bxg4": "Time to assess the position.  White has N B for the Q.  Although a long way from completing his development, White has two pieces in action, with forking threats at e6 and f7.  Black, meanwhile, pretty much has to begin all over again, just to activate her game.  White has gained a great deal in time for his large material investment. ",
        "9... Qe8": "(!?) Dodging both forks at once - a sensible plan.  But another idea was to allow one of the forks to happen: 9...Qd6!? 10.Nf7!? Qxf4 11.Nxh8 Qxg4 12.0-0 Nc6.  Since much of White's temporal and spatial advantage would disappear with the win of the exchange, it would seem he might have had to come up with a different plan, 10.Ne6 , say.",
        "10. Ne6+ Kb6": "Probably safest.  Had she played 10...Kd6, this might have happened: 11.Nc3 Qg6  12.h3 Nd7  13.f5 ... 14.Nxe4  with a strong-looking attack.",
        "11. Na3": "Aiming for c4 and check.",
        "11... a6": "Creating a hidey-hole for himself...",
        "12. b4": "(!?)  Trying to open a file directed at the Black King.  Maybe White felt that 12.Nc4  Ka7 13.Nc7 Qg6 14.Bh3 offered insufficient return.",
        "12... Ka7": "Again, playing safe.  But taking on b4 was worth a look: 12...cxb4 13.Nc4  Ka7 14.d3 Nc6 15.Be3  Kb8 16.Bb6 (threatens Bc7 ) ...a5 (an attempt to create room for the BK) 17.Bc7  Ka7 (17...Kc8 18.Nb6#) 18.Bb6  Kb8 (18...Ka6 19.Nc7#) and what seems to be a perpetual.  Had White more than this if Black took the pawn?  I haven't found anything so far!",
        "13. b5": "Charging onward!  See how Black is being given no time to bring out her pieces. But White's game is developing almost as slowly: yet to castle, and still to bring out the Q-side pieces.  Meanwhile, what might have been the consequences of opening the b-file? 13.bxc5 Qc6 (say) 14.Rb1 Nd7 15.Nc4 Qa4 and Black has some threats of her own.",
        "13... Qg6": "This queen is just about Black's only active piece, and it looks difficult to bring the others into play.  What is intriguing about all this is that it's hard to see how White can make good the loss of his queen; and equally difficult to fathom how Black can survive the bind on her game.  Are both losing??",
        "14. Bh3": "The most logical consolidation.  But can White accelerate his attack on the other flank by offering more material?  14.b6  Kxb6 15.Nc4  (15.Rb1  might be worth a look) 15...Ka7 (no choice) 16.Ne5  Qe8 (...Qh4  seems to lead nowhere) 17.Rb1 Nc6 (17...Nd7!? 18.Nxd7!? Qxd7 19.Nxc5 Qc7 20.Rxb7  Qxb7 21.Nxb7 Kxb7 22.Bf5 with an ending difficult to assess)  18.Nxc5 Nd8 19.Bd7 Qh5 20.Nxe4... and White looks to have a fine game. ",
        "14... Nd7": "Developing a piece at last.  Black's problem has been that White has given her little chance to bring out her pieces...",
        "15. O-O": "...but in saying that, one has to admit that White has had to employ pieces already developed.  Now comes a lull in the battle as reserves are called up.",
        "15... Qh5": "(!?) So far, Black has done nothing wrong that I can see, but one feels a bit uncomfortable with this move.  However, Black had to do something about her K-side, and this move frees the g-pawn, should she get the chance to advance it and bring out her bishop.  But maybe ...h6 was worth a look, keeping the knight out of g5, and thereby making it harder for White to bring the h3-bishop into e6.  Such a  regrouping by White does happen later on.",
        "16. Bb2": "Pinning the g7-pawn and tying down Black's K-flank.",
        "16... Rg8": "(?!) Now, had White chosen, he could have carried out at once the regrouping earlier mentioned: 17.Ng5 Nf6 18.Be6.",
        "17. Rad1": "(!?)  A 'mysterious' rook move.  Did White envisage breaking out with his d-pawn, or was this played against a possible 17...Qd5, attacking d2?  A difficult move to understand, I find.",
        "17... Nb6 18. Kh1": "Playing almost as if he hadn't a care in the world... ;-)",
        "18... Rc8": "(!?) Possibly Black ought to have been seeking ways to unravel her K-side.  18...g6 or maybe 18...h6 offered some prospects of breaking out of the bind.",
        "19. Rde1": "I suspect a rethink has taken place since White's 17th...",
        "19... Qd5": "Good: centralisation - but also eyeing a couple of loose White pawns...",
        "20. Ng5": "Discovering an attack against Black's c8-rook, and threatening a fork against her other major pieces -  this looks devastating.  Does that mean Black's previous was a mistake after all?  I'm not sure it does.  It was looking likely that to free up her game, Black would have to give back something.  Now with 20....Qxd2 21.Bxc8 Nxc8 22.Bc1 Qd5 Black might have gained time enough to complete her development.",
        "20... Qxa2": "(?) Wrong pawn, methinks...",
        "21. Reb1": "(!) Now Black must shed material.  How best to do this?",
        "21... Qxb1": "(?) Quite understandable attempt to cut her losses, but it might have been better to have kept her most active piece, and let a rook go instead.  After 21...Qd5 22.Be6  Qxd2 23.Bxg8 e3, Black at least has some counterplay.\r\nAfter this capture, it is hard to see how Black can survive.",
        "22. Rxb1 Ra8 23. bxa6 bxa6 24. Be6 Rh8": "Although material parity has been approximately restored, White has retained his spatial and temporal advantages.  Black's K-side is so tied up that White is effectively playing with a rook and bishop extra.",
        "25. Nf7 Rg8 26. Be5": "(!) Centralisation! Also good was 26.Ne5, but the move played is more effective, and the more visually pleasing.",
        "26... h6 27. Bc7": "Closing in for the kill.  Black is busted.  I gather Joanne considered resigning hereabouts, but agreed to play out the mate.",
        "27... Na4 28. Bd5": "Heralding a mate in 5...",
        "28... Re8 29. Rb7+": "According to the mating sequence already envisaged.  It turns out that Black's previous move allowed a different, slightly quicker one.  Can you find it?  [Answer: 27.Nb5  mates in three.]",
        "29... Ka8 30. Rb8+ Ka7 31. Rxe8": "A non-check, but mate can't be stopped.",
        "31... g6 32. Ra8#": "A very difficult and tense game, for both players I suspect.  White had to make good a large material investment; Black to find ways to free up her game.  Maybe White has the most fun in this kind of game?  I think Black was doing fine up until her 20th move (...Qxa2?).  It shows how double-edged games like this can suddenly capsize into a disaster for one side.  "
    },
    "url": "https://gameknot.com/annotation.pl/speculate-to-accumulate?gm=21163",
    "gameName": "Speculate to accumulate",
    "players": "easy19 (2244) vs. jstevens1 (1756)",
    "opening": "Sicilian (B21), Grand Prix attack"
}