{
    "moves": {
        "1. d4 d5": "A mini-tournament game. I'm playing black. My opponent starts out with 1. d4 and I'm not feeling very modern, so I give him the Queen's Pawn game to see what he does with it. Black's first move here is not the abosolute best of choices, at least not according to the World DB. 1. ... d5 is significantly less successful for black than 1. ... Nf6 or 1. ... e6. ",
        "2. c4 dxc4": "I'm usually willing to accept a good gambit. Having deliberately chosen an opening that fails to maximize black's chances, Black follows up with the most successful move in the world DB here, though we're already heavily favoring white 37% to 25% with a whopping 36% draws.",
        "3. Nf3 a6": "This move prepares to hang onto the won pawn. At least until black wants to give it back for good reasons. This is the Alekhine Defense. No, not the famous one. Just a variation in the QGA.",
        "4. e3 e6": "28% to 28% with 42% draws now, for what it's worth. Not that any of this DB analysis means too much, but it still is somewhat valid. These are games from experts, masters, GMs, IMs, and even world champions in this DB, but nobody less than Expert. So they probably know what they're doing, and probably know what works, and the outcomes of 1 2/3 million games builds a strong case of which lines tend to lead to what outcomes. Of note, despite preparing for b5 to defend c4, bleck declines to try to save the pawn. Doing so usually leads to superior white development.",
        "5. Bxc4 c5 6. O-O Nf6": "Developing and challenging the center.",
        "7. Bb3 b5": "Inevitable. This validates 3. ... a6 and prepares to build a solid pawn chain to claim huge territory on the queenside. White's move, 7. Bb3 prevents black's 7. ... b5 from gaining a tempo so now white has time to prevent 8. ... c4.",
        "8. a4 b4 9. Nbd2 Be7": "Normal development.",
        "10. dxc5 Bxc5": "White's capture retroatively makes black's 9. ... Be7 a waste of a tempo. Hindsight. In retrospect, I might have preferred some other 9th move. Maybe 9. ... Bb7 instead, though the DB gives much better success rates for black with the move as played. Now, on black's 10th move, I failed to follow the DB's advice. Up until now, black had chosen the best moves according to the DB except for 1. ... d5. White had done the same, choosing his #1 move in the DB every move. On move 10, black has a choice between 10. ... Bxc5 which gives a 66% to 0% winning percentage favoring white, or 10. ... 0-0 which gives a 25% to 50% winning percentage favoring black. It's been a couple months and I don't remember what analysis led me astray here, so now I have nothing other than surprise that I made such an odd choice. Database aside, I like the look of 10. ... 0-0 better than 10. ... Bxc5. This may have been a critical turning point, giving white a strong advantage going into the middlegame ahead in time and development.",
        "11. e4 Bb7 12. e5 Nd5 13. Ne4 Be7": "Back and forth. This poor bishop has moved three times and yet is only one square from home.",
        "14. Bg5 O-O": "Fianlly. 4 moves late.",
        "15. Nd6 Bc6 16. Bxe7 Qxe7": "At this point I feel every even exchange benefits my opponent for I am well over a hundred rating points above him. I should be accumulating advantages and building toward a win. Instead, I'm playing catch up and letting him set the pace, trading down my pieces before I can use them to build any kind of winning game.",
        "17. Rc1 Nf4 18. Re1 Bd5": "This allows another trade, but the bishop was en prise and pinning the black knight down to defense duty on b8. I saw no other way to set that knight or his adjacent rook free.",
        "19. Bxd5 Nxd5 20. Qd3 Nd7 21. Ne4 a5": "Securing b4, but more importantly, getting out of the line of fire so the black rooks can get more active on the open files.",
        "22. Neg5 g6": "Preventing checkmate, of course.",
        "23. Ne4 Rac8 24. Qb5 Rca8": "Black thought occupying the open file sounded good, but he has to run back and save his queenside pawns.",
        "25. b3 Rfb8 26. Qd3 Rbc8": "Black tries again.",
        "27. Rc4 Rxc4 28. Qxc4 Qd8 29. Rc1 Qb6": "Black is really getting nowhere. White has dominated the center, and is dominating the open c-file. I can find no flaw in white's play for me to exploit. Just spinning my wheels. ",
        "30. Qe2 Rd8": "Well, if white wants the c-file, black will take the d-file.",
        "31. Qb2 Qb8": "Spinning.",
        "32. h3 Rc8": "Aha! C-file at last...",
        "33. Rxc8+ Qxc8 34. Qe2 Qc1+": "Now for a little fun.",
        "35. Kh2 Kg7": "Anticipating some trouble from the white queen on the back rank.",
        "36. g3 Qb1": "Look! Black is making a threat against white. Is it the first real threat of the game for black? This move forks the white knight and the undefended pawn on b3. It would be easy for white to carelessly let one of them fall.",
        "37. Ned2 Qb2": "But he didn't.",
        "38. Qe4 Qc3 39. Qd4 Nc5": "White threatens to trade queens on c3. Black would like to see how that plays out with him getting a passed pawn only 2 squares from promotion.",
        "40. Kg2 h6": "Keeping the white knights off of g5.",
        "41. h4 h5": "But, keeping the white pawns off of g4 and h5 is more important.",
        "42. Kh2 Nd7 43. Qa7 Nxe5": "We trade pawns. 43. Nxe5?! may have been the nail in black's coffin as far as hoping to win this game is concerned. I don't think the move loses, but it almost certainly ends black's chances of winning. This pawn trade gives a 4-3 pawn advantage on the kingside (almost impossible to force a promotion) and surrenders a 2-1 pawn advantage on the queenside (much more likely for white to promote a pawn here). Suddenly black is playing catch up again. Still, for the last several moves, both players were just spinning their wheels, going nowhere, and I had been considering offering a draw. At least this might get something to happen...",
        "44. Nxe5 Qxe5": "And we trade knights.",
        "45. Nc4 Qc3 46. Nxa5 Nf6": "Headed to g4. From there, this knight can hold white largely at bay on the kingside.",
        "47. Kg2 Ng4 48. Qb6 e5": "Well, black has the majority on the kingside, might as well use it. I'm still thinking about offering a draw, but still holding back. Secretly, I'm hoping my opponent blunders. A forlorn hope given his rating, but I wasn't ready to throw in the towel and offer the draw too easily.",
        "49. Nc6 Qxb3": "And then he did blunder. 49. ... Nc6? loses a pawn.",
        "50. Nxb4 Qxa4": "OK, black is clearly ahead by a pawn, but this position is still almost a certain draw. Bad play by white might give black a chance to win, but so far, white has only blundered once in 50 moves. So I'm estimating a 2% chance for black to turn this into a win...",
        "51. Qc5 Qa3": "Pinning the knight.",
        "52. Qc4 Qb2": "Forking pawn and knight.",
        "53. Nc2 Qb6 54. Qe2 Qc6+": "White is consolidating his forces, fending off black's simple tactics and bringing his far-flung soldiers home to defind the kingside. This game has narrowed down to only four files that matter, e, f, g, and h. And those files are choked with enough pawns and pieces that nobody is going anywhere.",
        "55. Kg1 Qc3 56. Ne1 Qd4": "This move was just a safety. I could see no breakthrough. I considered pushing f and e to see what might happen, but sooner or later white will just trade one or two pawns, then sacrifice his knight to remove a pawn, then we'll have a K+Q+N vs. K+Q which is a draw. Instead of playing it out, I offered a draw and black accepted. I give all the credit to my opponent. He put black on his heels right from the opening and never let up. Even his 49th move that lost a pawn merely turned the game from one kind of draw into another. Well played."
    },
    "url": "https://gameknot.com/annotation.pl/spinning-my-wheels?gm=24733",
    "gameName": "Spinning my Wheels.",
    "players": "xellos_9 (1748) vs. blake84120 (1979)",
    "opening": "QGA (D22), Alekhine defence, Alatortsev variation"
}