{
    "moves": {
        "1. e4": "Hi everyone!\r\n\r\nIt's back to the board, I have done my Saturday afternoon chores - got that hoovering out of the way and my mother-in-law a birthday present, so I can now sit down and do some more chess study.  I recently played an unrated game with a near-IM.  He is fairly new to gameknot.  I ended up challenging him after he put a thread in the gameknot forum about unrated games which sparked off quite a debate!  I kicked off with 1. e4 and he responded with the Reversed Grob, g5.",
        "1... g5 2. d4 h6 3. Nc3": "3. Nc3 - a good pawn centre and a knight developed on c3.  So far so good.",
        "3... d6 4. Bc4 Nf6 5. Nge2 c6 6. O-O": "6. 0-0 - fast development here, I castle on move 6.",
        "6... d5 7. exd5 cxd5 8. Bb5+": "8. Bb5+ - I decide to leave the database behind here.  This check looks OK but it is in fact the first step towards perdition for me.",
        "8... Nc6 9. Be3 Bg7 10. f3 Qb6 11. Rb1 a6 12. Bxc6+": "12. Bxc6+?? - here is where I started to go south.  The trouble with this move is, is that black's lsb could go onto the b1-h7 diagonal and cut across my position like a knife.  All this is hindsight.  My opponent stated in a post-match pm that Fou Leblanc should have gone to d3.  This would have preserved the bishop and controlled that b1-h7 diagonal.  Now see how this reasonable position gets more and more cramped.",
        "12... Qxc6 13. Re1 Bf5 14. Ng3": "14. Ng3? - in fact this was a bad move.  This knight should have in fact gone to c1 and then perhaps d3 screening out that black dsb's line.  In fact my opponent also recommended a3.  I guess this pawn would not have been such a target later on.",
        "14... Bg6 15. Bf2": "15. Bf2 - would Bd2 have been an improvement here?",
        "15... e6 16. Rc1 O-O 17. Qd2": "17. Qd2 - protecting the c2 pawn.",
        "17... Rac8 18. Re2 Ne8 19. Nd1": "19. Nd1 - preparing c3.",
        "19... Qa4": "19. ....... Qa4 - but, sssss and double sssss here's the Wicked Witch of the West!",
        "20. a3": "20. a3 - six moves too late.",
        "20... Nd6 21. c3 Nc4 22. Qe1": "22. Qe1 - the only square for Glenda.",
        "22... Qb5 23. Be3": "23. Be3 - preparing Nf1-d2 but I don't get that far.",
        "23... f5 24. Nf1 f4 25. Bd2": "25. Bd2 - it is getting far too cozy in white's centre.",
        "25... e5 26. dxe5 Bd3 27. Rf2": "27. Rf2 - the only square for my rook.",
        "27... Rf5": "27. ...... Rf5 - much to my horror it dawned on me that the black rook would go to e5 next move.  Poor Glenda is trapped and the only way to save her is for either Fou Lenoir or one of the horsies to give up their lives for a humble pawn to save her.  That is probably just for starters though.  With my pieces all cramped up as it is I decided to wave the white flag.  It just shows how some fairly small innacuracy by an intermediate player is well and truly punished by a near-IM."
    },
    "url": "https://gameknot.com/annotation.pl/squashed?gm=23657",
    "gameName": "Squashed!",
    "players": "jstevens1 (1779) vs. winds_of_wisdom (2384)",
    "opening": "Reversed Grob (Borg/Basman defence/macho Grob) (B00)"
}