{
    "moves": {
        "1. d4 e6 2. Bf4 d5 3. Nf3 Nf6 4. c3 c6": "Extra conservative play by me. ",
        "5. Nbd2 Bd6 6. Ne5 O-O 7. h3": "More accurate was e3. ",
        "7... Qc7 8. e3 Nbd7 9. Ndf3": "Standard asset, in which black has gotten a solid position near to equality. ",
        "9... Ne4 10. Bd3": "? this deprives my Ne5 from his natural square after f6. ",
        "10... f6 11. Nxd7": "Improvising. If black goes BxB, NxR wins the exchange. ",
        "11... Bxd7 12. Bxd6": "Only sensible way to avoid the pawn scrambling if BxBf4. ",
        "12... Nxd6": "Plans to shield with f5, but I still have the g pawn. ",
        "13. Qc2 f5 14. g4": "Not really threatening something right now. Black should have played now f4, and I have to cope with my Nf3, undefended after the f column gets free. ",
        "14... Ne4": "Pressing f2 if the f column is opened. ",
        "15. Ne5": "Blocking the way and controlling Black's lsb. ",
        "15... b5": "Attacking my weak side I planned to shield in. Black is good. ",
        "16. a3": "Necessary. Initiative is to black. A poor result. ",
        "16... a5": "Going on with the attack. Now I have to attack myself or I'll be slowly crushed in. ",
        "17. f3": "Yes, why not. If Ng3, Rg1 and black has no way to defend it in the long run and will have to lose the exchange somewhere along the way. Say Ng3, Rg1, f4, exf4, Rxf4, RxN. And if Ng5 instead, h4, Nf7, f4! and even if my N is exchanged, the center is still mine, and my attack on the kingside guaranteed. ",
        "17... Nd6": "Now it's clear: MY N is better than his, because of f3. White can't move the f pawn now without being exposed to Bxh7+. But I can't take it either, or I will activate his lsb. And NxB, QxN doesn't solve the problem. So?",
        "18. Qg2": "Switching the attack to the g column. I'm threatening to open it. ",
        "18... Nc4": "Black goes with a fork, but I have foreseen it. There is only one sensible answer. ",
        "19. Bxc4 bxc4": "Leave black a nice column to press on, but I can easily defend b2 with Q, K and R. Now, gxf5 seems indicated. But I wasn't incisive enough. ",
        "20. Rg1": "? Losing an extraimportant tempo to attack! now, black can play f4 and prevent the opening of the g column!",
        "20... Bc8": "Black chooses to guard g7 with the Q and K, keeping an eye on e6, just in case. Be8-Ra7 seemed a better plan. ",
        "21. gxf5": "Not wasting any more time. ",
        "21... exf5 22. f4": "Blocking the lsb for a long time, and making of my N invulnerable. ",
        "22... Bb7": "Instead of making pressure on the b column, black uses it to blind his own b, guarding c6. How to proceed? I almost lost the path earlier, and the truth is I have not many clear ways to the win. ",
        "23. Qg5": "This is a slow plan: the idea is Qh6, aiming to e6, and giving time to the second R to came over. ",
        "23... Rae8": "If my N leaves, Rxe3 could be annoying. ",
        "24. Qh6": "I go on with my plan all the same. Rf6 is not playable (QxR)",
        "24... Qe7": "If Nxc6, Qxe3+ will be the end. ",
        "25. Kd2": "First step in the protection of e3. ",
        "25... Rf6": "Now Rf6 is defended. ",
        "26. Qh5 Kh8": "Unpinning the pawn, and exposing himself to Ng6+, RxN, for a good reaong: RxR? Qxe3+. I can play Rg6 now, but I didn't see it at first. ",
        "27. Rg5": "? I saw this one, building pressure against f5 and providing the tempo needed to double R on g. ",
        "27... Rh6 28. Qf3 Rf8 29. Rag1": "I losts some chances, but my pressure is increasing slowly but unstoppably. Still, I have no clear way in. ",
        "29... g6 30. Rh1": "So I found a slow plan: push the h pawn should cause the collapse. It's slow, but what can Black do? Nothing!",
        "30... c5 31. h4 cxd4 32. exd4": "Everything's solid as steel. Black's dsb is just useless!",
        "32... Qd6": "? But what to do? ",
        "33. h5 gxh5": "How to take back? ",
        "34. Rgxh5": "This forces black to retake, and after all I'll threat f5 with the R, so it' can't be bad. Black doesn't have time to occupy g. ",
        "34... Rff6": "?? Under so much pressure from all sides, black blundered. For once it wasn't me!",
        "35. Rh5xh6": "The R is poisoned now... ",
        "35... Rxh6 36. Nf7+": "A fair win against a higher rated player (on blitz) with less mistakes than usual. "
    },
    "url": "https://gameknot.com/annotation.pl/squeezing?gm=61049",
    "gameName": "Squeezing",
    "players": "damafi (1392) vs. Demetris (1483)",
    "opening": "Queen's pawn (A40)"
}