{
    "moves": {
        "1. c4": "A Walking the Walk club - Big Peta Students club hybrid game.  Pete wanted to try an opening beginning 1. c4 e5, 2. Nc3 Nf6.  Unfortunately, a mistake by black at move 14 made the experiment less useful than it could have been.  Then a bad idea at 16 landed black in a position with severely restricted mobility and no solution being found.",
        "1... e5 2. Nc3 Nf6": "The specified opening comes together.",
        "3. g3 Bb4 4. Nf3 Nc6 5. Bg2": "White plays a straightforward English Bremen opening.  I've played this a lot as white but have not played against it.",
        "5... O-O 6. O-O Re8": "6. ...Re8",
        "7. Nd5 Bc5 8. d3 Nxd5 9. cxd5 Nd4 10. Nd2": "10. Nd2, opening the diagonal for white's light square bishop.",
        "10... d6": "10. ...d6, for the moment, closes down that diagonal. ",
        "11. e3 Nf5": "11. ...Nf5.",
        "12. Ne4": "12. Ne4",
        "12... Bb6": "12. ...Bb6.  Note that white's kingside pawns do not move at all from move 11 to the end of the game.",
        "13. Bd2": "13. Bd2",
        "13... c6": "13. ...c6",
        "14. dxc6": "14. dxc6",
        "14... d5": "Here, I lost focus, thinking I'd push the knight back and keep the diagonal closed but completely overlooking that white didn't have to move the knight.  the first of a game losing pair of moves.",
        "15. cxb7": "White takes advantage of my oversight and plays the correct move.  And it is on the b-file where the concluding action occurs, 20 moves later.",
        "15... Bxb7": "15. ...Bxb7.  not looking terrible for black, though he is down a pawn.",
        "16. Nc3": "...but, black follows 16. Nc3 with...",
        "16... Re6": "...this problematic 16. ...Re6.  I had a vague idea that lateral mobility for the rook could be used to some positive end.  but that rook NEVER leaves that square and this contributes to an oddly immobile game for black.  In keeping with this theme of the game being \"locked up,\" I'll point out that the black pawns on e5 and d5 do not move from move 14 to move 30, a not awful aspect of a fairly awful game.  I say not awful (those pawns put some limits on white), but Pete will have no trouble working in the limited real estate along c and b.",
        "17. Na4": "From here, white plays a nice systematic game and slowly breaks down black's position.  Here, black can't take the protection off c5.",
        "17... Rb8": "17. ...Rb8.  This move is intended to support removing white's lsb from the board, an idea that never pans out.  see next.",
        "18. Rc1": "Black probably should have grabbed the c-file the previous move.  Comments?",
        "18... Ba6": "18. ...Ba6",
        "19. Nc5": "19. Nc5.  ",
        "19... Bxc5": "BxN",
        "20. Rxc5": "RxB",
        "20... Ne7": "puts a second defender on d5, but further limits that poor rook, ...not to mention drifts black more into a defensive mode.  yes, white has an unprotected pawn, but...",
        "21. Ba5": "21. Ba5",
        "21... Qd6": "now the queen is at HER final resting place.  candidate name for this game: \"the sealed fate.\"",
        "22. b4": "further shuts down black's options while getting in position for the final 12 moves.",
        "22... Rc8": "22. ...Rc8",
        "23. Rxc8+": "RxR",
        "23... Bxc8": "BxR",
        "24. Qb3": "24. Qb3",
        "24... Bb7": "before I killed my chances, Pete had been trying to get me to remove the white lsb, ...a lesson in creating a weakness in a fiancetto'd position.  but I never came close to following through on that, though this move is a remnant of that idea.  Plus it frees the knight.",
        "25. Rc1": "reload.",
        "25... a6": "how to remove white's b-pawn?  second theme: let's watch the master player advance and promote that pawn.",
        "26. Rc7": "26. Rc7",
        "26... Bc6": "26. ...Bc6",
        "27. a4": "27. a4. sets up replacing the first b-pawn.",
        "27... g6 28. b5": "28. b5",
        "28... axb5": "PxP",
        "29. axb5": "PxP",
        "29... Be8": "29. ...Be8.  one chance to remove that pawn lost.",
        "30. b6": "and white is two squares from promoting.",
        "30... Nc6": "30. ...Nc6",
        "31. Bd2": "31. Bd2",
        "31... e4": "inhibiting the bishop.",
        "32. Rc8": "White finds a nice safe square on black's home rank.",
        "32... Kg7": "as Pete pointed out during the game, I should have played Nd8 here if I was to have any chance of mitigating the cost of the coming promotion and exchange.",
        "33. b7": "33. b7",
        "33... g5": "a few moves earlier, I had noted that white could play RxN.  but another mental lapse and that got away from me.  so while I am thinking I can play NxP next move, I proceed toward the idea of a clash at the white king's fortress.",
        "34. Rxc6": "RxN.  black resigns.  a bit of a shirk here as the WTW Rulez say play on.  but as this was a hybrid WTW / BP Students game, I took what at the moment felt like a luxury.  Later thought that I should have hung in and tried to engineer a stalemate.  I expect however that bigpeta would have none of that and would have closed things out before too long.  Thank you to bigpeta for playing."
    },
    "url": "https://gameknot.com/annotation.pl/st-andrews-vs-dundee-round-2?gm=46259",
    "gameName": "St. Andrews vs Dundee - round 2",
    "players": "bigpeta (2083) vs. hogfysshe (1725)",
    "opening": "English (A22), Bremen, Smyslov system"
}