{
    "moves": {
        "1. e4 d5": "En bilan, une ouverture désastreuse dès le 6ème coup. Je m'en sors sur une erreur et une boulette de l'adversaire. C'est donc même pas la peine de trop analyser. Hop au boulot ouverture.___je viens d eme rendre compte que c'est contre loopy que j'ai eu aussi la même ouverture. Lui non plus il n'a pas bossé :-))",
        "2. e5 c5 3. Nf3": "Et bien me voilà déjà à la fin de la théorie que je connais. Pas terrible, il y a du boulot.",
        "3... Nc6 4. Bb5 e6 5. d3 Bd7": "Flute, je me rends compte que je peux jouer Qa5 (comme la partie précédente). Quelle nouille ! je m'en veux sur le moment....mais j'ai une super excuse, j'ai mal à la tête, je suis sous antibio :-)",
        "6. O-O Be7": "je ne suis pas spécialement convaincu par ce coup. 6...f6 c'est peut-être mieux. Bon je viens de regarder avec un module. 6...Nxe5 ça m'aurai bien plu de penser à ce coup. C'est donc le coup que je reprendrais bien pour cette partie.",
        "7. a4": "suite à ce coup son fou va forcément être échangé. je pense que c'est bien pour moi d'avoir la paire de fous.",
        "7... a6 8. Bxc6 Bxc6 9. c4": "j'ai pas mal hésité avec 9...dxc en supposant la ligne 9...dxc 10.dxc Qxd1 11.Rxd1 Rd1 et je suis finalement parti sur 9...f6 qui  m'a mis dedans quelques coups plus tard.",
        "9... f6 10. cxd5 Bxd5 11. Nc3 Bc6 12. Bf4 fxe5": "c'est la panique, je ne sais pas comment répondre, je suis complétement étouffé, les cavaliers blancs sont très menaçant. Je vais me prendre 13.Nxe5, la misère. Faut vraiment que je bosse cette ouverture.",
        "13. Bxe5": "oooouuuuffff",
        "13... Nf6 14. Ng5": "e6 va ramasser.",
        "14... Bd7 15. Qb3 Qc8 16. Ne2": "Ca va être difficile de mettre plus de pièce pour défendre e6 après Ne2-f4, alors je tente ma chance d'essayer de faire reculer les blancs. Je ne calcule pas trop, on verra bien.",
        "16... h6 17. Nf3 O-O 18. Nh4": "Là je crois que j'ai ma chance. Comment il va défendre 2 pièces en l'air ?",
        "18... Ng4 19. Nf3": "Je pense qu'il s'est planté dans la défense, je vais avoir 2 pièces mineures pour la tour. Mais surtout je fais un gros calcul car si il joue Bxg7, Qc3 et Bh8, il faut absolument que mon cavalier puisse revenir sur la diagonale a1-h8. Je pense que ça va tenir, non pas grâce à mon cavalier mais grâce à e6-e5.",
        "19... Rxf3 20. Bxg7 Rxf2 21. Rxf2 Nxf2 22. Qc3": "Et voilà, on est en plein dans la ligne dangereuse. j'espère avoir bien visualisé. Un peu de stress là ! c'est ce que j'aime en live par rapport en différé.",
        "22... Ng4 23. h3 e5": "Voilà la fin de ma visualisation, en voyant la position au présent, j'ai l'impression que je vais tenir. La dame blanche va m'embetter mais je suppose que je vais pouvoir contenir et échanger cette pièce.",
        "24. hxg4 Kxg7 25. Qxe5+ Bf6 26. Qe4 Bxg4": "J'ai un petit doute, allez à la pèche au pion ce n'est peut-être pas le meilleur moment. Mais je pense que ça va surtout affaiblir son potentiel d'attaque aile roi et aussi dénudé son roi.",
        "27. Nf4": "Ralala, il va me faire c***r avec son cav, c'est sur.",
        "27... Bd4+ 28. Kh1 Bf5": "pour les coups suivant je souhaite arriver à échanger les dames.",
        "29. Qe7+ Kg8 30. Qd6 Qc6 31. Qxc6 bxc6 32. Rb1": "Et voilà, maintenant je crois que les blancs n'ont plus rien. Mais c'est loin d'être gagné pour autant. Juste jouer zen, sans forcer les choses, échanger au maximum et surtout ce cav qui peut faire des fourchettes (que je pleure si ça m'arrive à cette partie,^^). et mettre une douce pression sur ses pions.",
        "32... Rb8 33. b3 Be5 34. g3 Bxf4 35. gxf4 Bxd3": "hop, plus de cav, un pion en moins, la maintenant je commence à me sentir serein (mais méfiant quand même)",
        "36. Rd1 Rxb3 37. Kh2 c4": "là je pense que c'est complétement fini. Il va jouer au bout, c'est sur. Alors juste à éviter le pat.",
        "38. Rg1+ Kf7 39. Kg2 Rb8": "histoire de voir si je peux échanger les tours.",
        "40. Kf2 c3 41. Rc1 c2 42. Ke3 Bf5 43. Kd4 Rb1 44. Rxc2 Bxc2 45. Kc5 Bxa4 46. f5 Rb5+ 47. Kd6 c5 48. f6 c4 49. Kc6 c3 50. Kd7": "pendant que j'avance mon pion je visualise le mat, Re5+ à la découverte puis Qc5",
        "50... c2 51. Kd8 c1=Q 52. Kd7 Re5+ 53. Kd6 Qc5#": ""
    },
    "url": "https://gameknot.com/annotation.pl/st8pmu-internet-chess-club?gm=49387",
    "gameName": "st8pmu, Internet Chess Club",
    "players": "loopy (1452) vs. mrtoduvet (1442)",
    "opening": "Scandinavian (centre counter) defence (B01)"
}