{
    "moves": {
        "1. d4 d5 2. c4 c6 3. e3 Nf6 4. Nc3 Bf5 5. Nf3 e6 6. h3 Nbd7": "Maybe I should've played h6 in case of Nh4.",
        "7. Ne5": "Here's where it gets interesting, as we are leaving the opening lines. White begins to get aggressive.",
        "7... Nxe5 8. dxe5 Ne4 9. Bd2 Nxd2 10. Qxd2 Qc7 11. g4 Be4 12. Nxe4 dxe4 13. O-O-O": "If I take the pawn right away on e5, I'd be faced with an immediate checkmate: 14. Qd7# ",
        "13... Be7": "At least now my king has an escape square on f8 for the mate threat.",
        "14. Bg2 Rd8 15. Qc2 Rxd1+ 16. Rxd1 Qxe5 17. Bxe4": "If I would have played this on move 14, I might have saved my e4 pawn, but I guess if I didn't wait I'd be losing my b pawn instead to Qd7+.",
        "17... g6": "Protecting h7.",
        "18. f4 Qc5 19. Qd3 O-O 20. f5 Rd8": "Again, I repeat the process of distroying White's battery. It looks remarkedly similar to move 14.",
        "21. Qe2 Rxd1+ 22. Kxd1 Qe5 23. Qc2": "I now saw my opportunity...",
        "23... exf5": "I did not want to let my e pawn go to waste if he took on g6 first.",
        "24. gxf5 Qg3": "...And now I fork his e and h pawns.",
        "25. fxg6 hxg6 26. Qg2 Qxe3": "I now have an advantage, but one must be very cautious when playing queen endgames.",
        "27. Kc2 Qd4": "Now I had to take care of the threat against my g pawn.",
        "28. Kb3 Kg7 29. Qf3 Bf6": "Threatening b2",
        "30. Qe2 Qb6+": "Here was where my opponent sighed in regret. I win the b pawn. Ka3 leads to Be7+ and later Qb4#",
        "31. Kc2 Qxb2+ 32. Kd1": "Note that Kd3 leads to mate on c3. I thought a moment before exchanging queens, to see if I could win more material later, but I usually prefer simplicity when I have a big advantage.",
        "32... Qxe2+ 33. Kxe2 Be7 34. Kd3 f5 35. Bf3 Kf7 36. Kd4 Ke6 37. a4 c5+": "I do not want the white king in my territory, obviously. ",
        "38. Ke3 b6 39. Kf4 g5+ 40. Kg3 Ke5 41. h4": "White is willing to sacrifice a pawn to separate my paired passed pawns.",
        "41... gxh4+ 42. Kh3 Kf4": "My king is swift to advance.",
        "43. Bh5 Ke3 44. Kg2 f4 45. Bg4 Bf6 46. Bh5 h3+": "I believe this sacrifice was the only way to get my other pawn to advance.",
        "47. Kxh3 f3 48. Kg3 Bh4+": "If he takes it, I promote.",
        "49. Kh3 Be1 50. Kh2 f2 51. Kg2 Kd3 52. Bf7 Kc3 53. Be8 Kb4": "A better move would have been a6.",
        "54. Bb5 Ka5 55. Bc6 Kb4": "Better would have been, again, a6. But we will return to a similar position later.",
        "56. Bb5": "I was dissapointed in the fact that I might have reached a draw despite my clear advantage, but I wasn't about to give up. All the other boards were finished, the score  2-2, and this game would decide the league champion. We needed a win.",
        "56... Kb3 57. Kf3": "From this point on the notation is only approximate. I was running low on time.",
        "57... Kc3": "I was too dumb to notice, on two occasions, that I could have promoted this turn. Maybe he went to f1 that first time.",
        "58. Ke2": "Note that just because a pawn is on the 7th, protected by a bishop, doesn't mean it'll promote. White's king is free to roam about the e2, f1, and g2 squares.",
        "58... Kd4 59. Kf3": "This was that 2nd dumb occasion. White's bishop would have to oscillate between a6 and b5 or my king would get to e2 and I would promote. Neither of us realized it, though.",
        "59... Kc3 60. Ke2 Kb4": "Seeing as this apparently failed, I decided to go back.",
        "61. Kf1 Ka5 62. Bc6 a6 63. Bb7": "And then I found the move...",
        "63... b5": "If I would have taken the a pawn, the position would be hopelessly drawn. Although I was at first skeptical about this move, I finally realized its importance. White must now take the pawn on b5 or face a deadly threat of promotion, but afterward the a6 pawn will recapture and be saved. Black's position is clearly won.",
        "64. Bxa6 bxa4 65. Bb5 a3": "White resigns with less than 3 minutes on the clock for both of us. This was truly a long and exciting game. With this win, Kamiak won the WESCO league by a single point*, and for the first time ever. I hope you enjoyed viewing this as much as I enjoyed sharing it.\r\n\r\n*It was actually 1.5 points, since Stanwood had to make up a match against Monroe, for which we expected them to win 5-0 (no offence to Monroe), but instead they went 4.5-0.5."
    },
    "url": "https://gameknot.com/annotation.pl/stanwood-kamiak-bd-3?gm=29042",
    "gameName": "Stanwood @ Kamiak bd.3",
    "players": "Jeff Tasky (1091) vs. Travis Olson (878)",
    "opening": "QGD Slav defence (D10)"
}