{
    "moves": {
        "1. e4": "Strongest move",
        "1... c6": "Most likely the necessary move at this point of the game.",
        "2. d4": "Centre play!",
        "2... d5": "Centre play at its strongest.",
        "3. exd5": "Now some forced moves follow.",
        "3... cxd5 4. c4": "Strongest!",
        "4... Nf6 5. Nc3 Nc6": "!? Of course, Anatoly Karpov plays the best move in this position: 5...e6",
        "6. Bg5": "! 6.Sf3 is not as strong as the text move. But \"Endspielingenieure\" prefer to play calmly.",
        "6... e6": "Only move. Qa5 was played by myself on previous occasions but my last success was a loss. It was time to change!",
        "7. c5": "White follows the normal plan.",
        "7... Be7 8. Nf3 Ne4 9. Bxe7 Qxe7 10. Bb5 Bd7 11. O-O Nxc3": "Other moves are possible here.",
        "12. bxc3 O-O 13. Rb1": "The critical position of the line. Study the games on chessbase.com if you like to know more.",
        "13... Na5": "Not even a novelty.",
        "14. Bd3": "!",
        "14... Rab8 15. Ne5": "Novelty! Whte is slightly better here because the black knight is out of play.",
        "15... b6": "Strongest",
        "16. cxb6 axb6 17. Qh5 h6 18. Rfe1": "? Better was 18.f4 with attacking chances on the f-file. Still, the black knight is out of lay and this fact gives white a better position. I think this is why 13.-Sa5 was not good enough.",
        "18... Nc6": "Only move - the return of the knight.",
        "19. Nxc6 Bxc6 20. Qf5": "Childhoodish play!",
        "20... g6": "Only move",
        "21. Qe5 Qg5 22. f4": "22.Qxg5 hxg5 23.Re5 !?",
        "22... Qxe5 23. fxe5 Rfc8 24. Kf2 b5": "Also the immediate Ra8 or Bd7 are alternate moves here. I opted for b5 because I thought it was best. ",
        "25. Re2 Rba8 26. Rc2": "Although white has two weaknesses (a2 and c3) and black has got only one b5 along with the bad bishop I would say that the position is drawish. Black can hardly open the postion with Kg7 and f6. It would give white also chances."
    },
    "url": "https://gameknot.com/annotation.pl/status-quo-vs-mot-rhead?gm=133",
    "gameName": "Status Quo vs. Motörhead",
    "players": "willibald (2037) vs. idimor (1745)",
    "opening": "Caro-Kann (B13), Panov-Botvinnik, normal variation"
}