{
    "moves": {
        "1. d4 Nf6 2. Bf4 e6 3. Nf3 d5 4. Nbd2 Be7 5. e3 c5 6. c3": "Here, most black players would go Nc6. This time, he pressured me.",
        "6... c4": "Everybody says that after this, b3 is getting advantage. But black can easily exchange the pawn and then press the c column, while my c pawn is weak. I don't like it.",
        "7. Bxb8": "? Bad move, since my B is stronger than his N. Very bad move. ",
        "7... Rxb8 8. Qa4+ Bd7": "....and here I sensed too much danger by taking the a pawn with the Q. After Ra8, Qxb8, Rb8, my Q has to move, and then Rxb2... So I went back.",
        "9. Qc2 b5": "Now he will take advantage of my bad plan by attacking my Qside, so I have to do something. \"When attack comes from the flank, answer with an attack on the center\". This is a hice rule that is whorthy to take into account, and here it suits perfectly.",
        "10. e4 Bc6": "By exchanging, his lsb takes too much activity. Since I have developement problems, it is better to close than to open the board. ",
        "11. e5 Ne4": "Same here: I don't have to take it. ",
        "12. h4": "...but prevent his incursions on the dark squares. ",
        "12... O-O 13. Ng5": "Now I sacrifice a pawn in order to open the h column. My N was not doing anything anyway. True is that his Q on g5 would be annoying, but on the other side, my lsb is still guarding g2.",
        "13... Bxg5 14. hxg5 Nxg5": "It's a pity: f4 doesn't work, since the N can go back to e4, and nothing happens. ",
        "15. Nf3 Ne4 16. g4": "The idea is g5. If Nxg5, NxN threats Qxh7#.",
        "16... f5": "If I allow this pawn to stay there, all my faint advantage of being eyeing h7 vanishes.",
        "17. exf6 e.p. Rxf6": "I'd like to jump to e5, but then Rxf2 threats my Q badly. Be2 to cover it, and he has to move his undefended lsb or NxB, forking Q and R is annoying for him. If not for the Nf3, I can even castle queenside (Nxf2, Qxh7# is still there).",
        "18. Be2": "I expected here Qf8, and I'd play Rh3. ",
        "18... Qe7 19. O-O-O Rbf8 20. Ne5": "I accept Rxf2, but NxB with tempo on his Q (Qg5+, Kb2) seems reasonable.",
        "20... Be8 21. f3": "f3 is better defended than f2. ",
        "21... Ng5": "...and here I was low on time, and, frankly... wihtout hope. ",
        "22. Rdf1 Bg6 23. Nxg6 Rxg6": "Now I think I missed a tactical shot here: What if Rxh7? If NxR, QxRg6 If KxR, Rh1+ and the K has to move g8, and again QxRg6! I now see it clearly, but during the game...",
        "24. Rh5 Qf7 25. Qd2 h6 26. Rf2": "Low on time, I just played thinking in winning back some seconds ",
        "26... Qf4 27. Qxf4 Rxf4 28. Kd2 Rgf6 29. Ke3": "As planned, my K comes just in time not to lose the crucial f3 pawn. ",
        "29... a5 30. Bd1 b4 31. Rh1 bxc3 32. bxc3 Ne4 33. Rc2": "Of course my f3 pawn is pinned.",
        "33... Nd6 34. Rb2": "...but now he allows my R to grab the column. ",
        "34... Rf6f8 35. Rb6": "He can't defend his N with the R, since he'll lose Rf4. And there is no pin now, so the N has to retire and allow me to grab the e6 pawn. ",
        "35... Nc8 36. Rxe6": "Material is even, his position is preferable, but the game can still be played. ",
        "36... Rf4f6 37. Rxf6": "I was low on time. Re5 seems now a better move.",
        "37... Rxf6 38. Rh5": "The quickest way to create threats. ",
        "38... Ne7 39. Re5 Kf8 40. f4 Rb6 41. g5": "Since he will now grab the b column, I have to create problems on the Kside. This is not \"to cause problems\", but still...",
        "41... hxg5 42. fxg5 Rb2 43. a4 Rg2 44. Bf3": "Excellent, he gives my the chance to activate my B!",
        "44... Ra2": "Bd1 could have been a drawn call, and, probably, the most intelligent thing to do. ",
        "45. Bxd5 Nxd5+ 46. Rxd5 Rxa4 47. g6": "Rc4 was more sensible. Anyway, he can't promote his a pawn, IMO.",
        "47... Ra3 48. Kd2 Ra2+ 49. Kc1": "Certainly not  by helping me this way to bring my K closer to a1.",
        "49... a4 50. Rc5 a3 51. Kb1 Rh2": "Rg2 was better, of course. ",
        "52. Rxc4 Ke7 53. Ra4": "I was now even dreaming of winning this with the two connected pawns! Unfortunately, HE timed out. Now my question is: was this a drawn position or a won one for white? Thank you for answering, if you can!"
    },
    "url": "https://gameknot.com/annotation.pl/still-a-high-win?gm=65549",
    "gameName": "Still, a high.win",
    "players": "damafi (1656) vs. juanalbertovelez (1764)",
    "opening": "Queen's pawn game (A45)"
}