{
    "moves": {
        "1. d4": "I challenged untateve to a revenge match after my defeat in the Annotation Project :)",
        "1... g6": "Robatsch Defence. A more restrained line in which White is allowed to form the classical centre, while Black starts building a citadel for his monarch, aiming to put pressure on White's centre later.",
        "2. e4 Bg7 3. Nf3 d6 4. Nc3": "Normal development so far.",
        "4... a6": "Interesting move. The database recommends 4... Nf6, continuing with development. The move played prevents Nb5 and Bb5 (irrelevant, since I was not planning on making either move) and also prepares for the advance of the queenside phalanx.",
        "5. Be2 b5 6. O-O Bb7": "Ah yes, the double fianchetto. There is already a threat of 7... b4 8. Nb1 Bxe4.",
        "7. Re1": "This move was recommended by the database; to be honest I wasn't yet thinking about the threat mentioned in the previous note. Still, out of eight games reaching this position 7... b4 was never played, so perhaps it isn't so good if played immediately. Can anyone help me out here?",
        "7... Nd7 8. a4": "Okay, now we give the knight a bolt-hole so it doesn't have to retreat to b1. As well as not blocking the rook, a2 is a better square for it as it hits the b4 pawn, preparing to leap right back into action.",
        "8... b4 9. Na2 a5": "Black departs from the only previous game with this position, cheshco v jaburr (1-0 in 28 moves). Black played 9... c5, with the same idea of defending the pawn.",
        "10. c3": "And this seems a logical response, since I don't want that knight to remain entombed for ever.",
        "10... b3": "(?) Gives away the pawn, since bad things happen if Black tries to grab the e4 pawn in return. Better is 10... bxc3, as in chescho v jaburr.",
        "11. Qxb3 Bxe4 12. Bc4": "And this little tactic is why White was happy to make the usually disadvantageous exchange of a centre pawn for a flank pawn. Both e4 and f7 are attacked.",
        "12... e6": "Black chooses to lose the bishop rather than the f7 pawn, probably since 12... Bb7 13. Bxf7+ Kf8 14. Ng5 with the threat of Ne6+ is nasty for Black. But 12... d5 could have been played, preventing Bxf7+ at the cost of a pawn rather than a piece. Whether the attack White gets is enough to justify 13. Rxe4 in response... I'm not sure.",
        "13. Rxe4 Ne7": "Black refrains from the fork 13... d5 since the e6 pawn would be pinned. This move threatens the fork in earnest, so I hastily retreat the rook. Not all the way back, since leaving it on the second rank makes doubling easier (when the time comes).",
        "14. Re2 d5": "Cutting off any thoughts of Bxe6, which could have been an attractive sacrifice if White could have got more pieces out before Black castled.",
        "15. Bd3 Nb6 16. Qc2": "The queen retreats to make room for the pawn, so that the knight can be freed.",
        "16... O-O 17. b4 axb4 18. Nxb4 Qd7 19. a5": "\"Passed pawns must be pushed\", but White has other things than promotion on his mind. The pawn was three times attacked; the only way to add another defender on this move was 19. Bb5, but after 19... c6 the bishop must move again. The pawn is more easily defended on a6 since I already have three pieces aimed at that square; also, the advance clears space for my pieces to get into action, now that it has become clear the queenside will be the focus of the next phase of the game.",
        "19... Nbc8 20. a6 Qd6": "Black increases the pressure on the a6 pawn, but is not yet anywhere near creating a threat of capturing it.",
        "21. Ba3": "So I have time to bring out another piece, with nothing concrete in mind as yet, but various tactical possibilities may arise from Black's queen and rook on the same diagonal.",
        "21... Re8": "This may be why Black immediately steps aside.",
        "22. Qa4": "One more piece enters the fray, and the path is cleared for the rook to join in. This threatens 23. Nc6, forcing Black to allow an exchange of material.",
        "22... Nb6 23. Qa5": "I had seen Nb6 coming, and decided that the queen was also well-placed on a5. White threatens Nxd5, winning a pawn and forcing two piece exchanges, or Qc5, threatening the queen exchange and driving Black's queen into passivity unless he accepts.",
        "23... Nc4": "Inevitable, but it does allow White to exchange off Black's most active piece.",
        "24. Bxc4 dxc4 25. Ne5": "White throws yet another attacker into the fray and Black is forced to accept another exchange, since 26. Nbc6 was threatened.",
        "25... Bxe5 26. Qxe5 Qd7": "White finally forces the passive queen retreat I mentioned several moves ago. Now the focus suddenly changes, since Black has exchanged a fianchettoed bishop for a knight, always a dangerous move. It's time to storm the citadel.",
        "27. Bc1 Reb8": "Black's next reveals that the intention behind this move was to give his king somewhere to flee. I thought the intention was to play 28... Rb5, quite a good defensive move as it interrupts White's plans. I pondered for some time and decided my best option was to go ahead anyway with the planned 28. g4, robbing Black's knight of the f5 square so that it cannot defend against Bh6.",
        "28. g4 Kf8": "Black's king sees that the citadel walls are crumbling and tries to run. But a royal robe isn't an easy garment to run in, and he's left the back door unlocked.",
        "29. Qh8+ Ng8 30. Bh6+ Ke7 31. Bg5+": "All forced so far. Now 31... Kd6? or 31... Ke8? allow mate in one; 31... Nf6 loses the knight, with mate to follow; 31... f6 is the least bad, since I can't see a checkmate and would have taken the queen exchange, but the endgame is a dead loss for Black. The only other option is for the king to return to the ruins and await events.",
        "31... Kf8 32. Bf6": "The swiftest way, I think, of forcing a conclusion.",
        "32... Qd6": "If 32... Qc8, giving the king d6, he can't get any further: 33. Qg7+ Ke8 34. Qxg8+ Kd7 35. Qxf7+ Kd6 36. Be5#",
        "33. Qg7+ Ke8 34. Qxg8+ Kd7 35. Qxf7+ Kc8 36. Rxe6": "The last few moves were all conditional, and in my hurry to input them before my opponent moved, I missed 36. Qe8+ Qd8 37. Qxd8#. The move played is, however, almost as forcing. Black can delay mate by sacrificing the queen and rooks, but he chooses the gentlemanly way out.",
        "36... Qxe6 37. Qxe6#": "And the neat little finishing touch is that the pawn I advanced to a6 earlier has a vital role to play in the final checkmate. Untateve is so far the highest-rated player I've won against, but as he's beaten me once as well it's no big deal. I'll just enjoy my victories as they come, one at a time."
    },
    "url": "https://gameknot.com/annotation.pl/storming-the-citadel?gm=25801",
    "gameName": "Storming the citadel",
    "players": "nuntar (1630) vs. untateve (1691)",
    "opening": "Modern defence (A40)"
}