{
    "moves": {
        "1. g3": "\"Don't make me steamroll you. Steamroller!\"  \r\n-Doug McKenzie- (from the movie 'Strange Brew')\r\n\r\nThis game was not a fair contest.  I've annotated it in order to show mistakes common to inaccurate and disjointed play.   I'm sure some of that poor play was mine.  \r\n",
        "1... d5 2. Bh3": "2. Bh3\r\n\r\nThis move is not to my taste.  The Bishop has been placed on a square that leads to a favourable capture for Black (2...Bxh3) since the subsequent White recapture of material (3. Nxh3) means a poorly developed Knight ('dim') on the outside edge of the board ('rim').  ",
        "2... Bxh3 3. Nxh3 e5 4. e3 Nf6 5. c3": "5. c3\r\n\r\nThis pawn move hinders future development.  It also fails to assist in White's fight for the centre.  5. d4 seems to be a better move.  5. 0-0 is another option.\r\n",
        "5... Bc5 6. Qa4+ c6 7. b4 Bb6 8. f3": "8. f3?  \r\n\r\nAgain, further weakening White's pawn structure and removing a valuable defender. ",
        "8... O-O 9. Ba3": "9. Ba3 \r\n\r\nNotice how White's own pawns prevent him from developing his Knight and maximizing his Bishop.  His pieces are scattered along the outer edges of the board in an uncoordinated fashion. ",
        "9... d4 10. f4": "10. f4?\r\n\r\nIn essence, inviting Black to open up the centre and begin a vicious assault.  Six out of White's first ten moves have been pawn moves.  His lack of development will have dire consequences.  ",
        "10... dxe3": "10...dxe3\n\nInvitation accepted.  ",
        "11. dxe3 Bxe3": "11...Bxe3!  \n\nThe Bishop on e3 assumes a very powerful, if only temporary, post.  ",
        "12. fxe5": "12. fxe5?\n\nThe pawn White just captured was doing him a favour by helping to keep the centre closed.  Since the White king is in the open centre and lacking pawn shelter Black will be able to exert a lot of pressure on him.",
        "12... Re8": "12...Re8!  \n\n13. exf6? by White will be met with a discovered check (by the Rook on e8 when Black moves his Bishop).  The crushing attack/mate will more than compensate for the Knight.  Notice how Black's Queen and Rook seem to own ('pwn') the d-file and the e-file.  Indeed, the White King is looking down the barrel of a loaded gun.  ",
        "13. exf6": "13 exf6??\n\nWhite takes the bait and in doing so he gives away his King's final scrap of defensive shelter.  ",
        "13... Bc5+": "13...Bc5  !\n\nGiving a discovered check while continuing to attack the g1-a7 diagonal.",
        "14. Kf1": "14. Kf1\n\nOnly move.",
        "14... Qd3+": "14...Qd3  !\n\nDriving the king to the corner.",
        "15. Kg2": "15. Kg2\n\nOnly move.",
        "15... Re2+": "15...Re2  !",
        "16. Kf1": "16. Kf1?\n\n16. Nf2 would have prolonged the game and given the King a flight square on h3.  Regardless, Black holds a far superior position.   ",
        "16... Rxh2+": "16. Rxh2  !\n\nGiving discovered check and corralling the king into mate.\n\n",
        "17. Ke1": "17. Ke1\n\nOnly move.",
        "17... Qe2#": "Qe2#...\r\nAnd there was much rejoicing.\r\n\r\n\"Jeez, 2 minutes for elbowing!\"  \r\nBob McKenzie"
    },
    "url": "https://gameknot.com/annotation.pl/strange-brew?gm=2751",
    "gameName": "Strange Brew",
    "players": "NN (?) vs. diemjay (1592)",
    "opening": "Benko's opening (A00)"
}