{
    "moves": {
        "1. e4": "Gledaj, ovako napadaju samo početnici koji su naučili da treba napadati polje f7 i samo su na to skoncentrisani. Zato redovo upadaju u zamke, zaostaju u razvoju i nema više nikakve šanse da se odbrane. ",
        "1... e5 2. Nf3 Nc6 3. Bc4 Nf6": "Crni razvija svoje figure i izaziva belog na privlačno polje g5.",
        "4. Ng5": "Beli je zagrizao mamac.",
        "4... d5": "Ovo je sad forsirano. Beli nema bolji potez nego da uzme pešaka.",
        "5. exd5 Na5": "Crni preuzima inicijativu. Svaka nebranjena figura na tabli je poziv protivniku da preuzme inicijativu forsiranjem igre.",
        "6. Bb5+": "Šah izgleda kao najlogičnije rešenje za belog.",
        "6... c6": "Ovo je novi mamac na udici. Beli ima priliku da zadrži pešaka više i usput potpuno rasturi pešačku strukturu crnog na toj strani. \nSve ovo izgleda belom kao veoma opasan napad.",
        "7. dxc6 bxc6": "Ovo je ključni momenat zamke. Belom najprivlačnije i najlogičnije izgleda potez Ba4.\nMogućnost da se uzme pešak c6 i viljuškom napadne kralj i top deluje zaslepljujuće na belog. Samo treba oterati crnog konja i eto....Ništa lakše od toga. ( :",
        "8. Ba4": "Beli nastavlja sa realizacijom svog genijalnog plana da uzme topa.\nSamo mu još taj konj smeta, ali najuriće ga on. Ima vremena.",
        "8... h6 9. Nf3": "Ovo je samo malo odlaganje plana. Još uvek ima vremena na pretek.",
        "9... e4": "Crni postaje malo dosadan sa ovim pešacima. ",
        "10. Ne5": "Sad je beli prividno povratio inicijativu i napao još opasnije pešaka c6\nBeli je ustvari nateran na ovaj potez. Jedina alternativa tom potezu bilo bi vraćanje konja na početnu poziciju. Odluka o tome koji je od ova dva poteza bolji je veoma laka za belog.",
        "10... Qd4": "Grom iz vedra neba. Istovremeni napad na dve figure. \nako - 11. Nxc6  Qxa4     12. Nxa5  Qxa5\nako - 11. Bxc6  Nxc6     12.  Nxc6  Qd5   13. Nxa7 Bg4  14. Nc3  Qh5  15. Ne2  Rxa7\nbilo koji od ova dva poteza belog vodi u poraz.\nZato je najbolji nastavak za belog  ovo što sledi...... >\n",
        "11. c3 Qxe5 12. b4": "Beli je napokon dočekao priliku da ostvari svoj plan i napadne tog konja koji mu smeta.",
        "12... Bxb4": "Ali iznenađenjima nikad kraja.\nCrni bi dobio ovu partiju i potezom - 12. Ba6 koji je možda i bolji, ali ja volim da pojednostavljujem stvari i ovo je sasvim solidna igra.",
        "13. cxb4 Qxa1 14. bxa5 Qxb1 15. Bxc6+": "Napokon je beli dočekao da uzme tog topa.  ( :\nTreba samo biti dovoljno uporan.",
        "15... Bd7 16. Bxa8 O-O": "Opet problemi. ) :\nSad beli lovac nema gde da pobegne.\nŠah je igra puna iznenađenja.",
        "17. O-O Rxa8": "Jasno je ko dobija ovu partiju i i dalja analiza je nepotrebna.\nOd 12og poteza ova partija se mogla razvijati u nekoliko pravaca.\nNije moralo baš ovako, ali to je sad preširoka analiza.\nU svakom slučaju crni drži sve konce u svojim rukama i pobeda ne dolazi u pitanje.\nGotovo sva otvaranja kriju ovakve ili slične zamke. Zato je potrebno polako učiti te varijante. Ono što je za decu tablica množenja, to su za šahiste varijante u otvaranju.\nUz pomoć game DB to može veoma brzo da se nauči kao pesmica.\nJa takvu mogućnost nisam imao kada sam učio šah.\n\n"
    },
    "url": "https://gameknot.com/annotation.pl/studija?gm=26558",
    "gameName": "Studija",
    "players": "srdjand  (1200) vs. srdjand (2000)",
    "opening": "two knights defence (C58), Bogolyubov variation"
}