{
    "moves": {
        "1. e4": "This is an annotation of my favourite opening, the \"Max Lange Attack\". It's out of fashion nowadays, because there are several simple moves against it that put White in a crappy position. With some practice, even those situations are playable and can lead to victory. This is an example that proves my point.",
        "1... e5 2. Nf3 Nc6 3. d4 exd4 4. Bc4 Nf6 5. O-O": "Up until this point all is going according to the book. Obviously this is also the point where moves like 5....d6 or even 5....h6 can mess up your bright idea.",
        "5... d5": "To continue the infamous Max Lange Attack, black is supposed to play 5....Bd5 to defend his pawn, keep his material advantage and to give pressure on f2. This would continue: 5....Bd5, 6. e5 - d5 7. exf6 - dxc4",
        "6. exd5": "Having failed in my beloved Max Lange Attack I decide to sacrifice my Knight to draw out Black's King after taking the pawn... see ahead.",
        "6... Nxd5 7. Ng5 Be7 8. Nxf7": "Black's king will be totally exposed with his Knight on d5 blocking a threatening Bishop.",
        "8... Kxf7 9. Qf3+": "The obvious move with several options for black to respond",
        "9... Ke6": "And there he goes!",
        "10. Nc3": "(In retrospect) another beautiful sacrifice to win time to get the a1 Castle out and to get rid of the blocking d4 pawn.",
        "10... dxc3 11. Re1+": "From here Black's moves are pretty much forced, it's Material Advantage Vs. Position and it keeps getting worse.",
        "11... Ne5 12. Bf4 Bf6 13. Bxe5 Bxe5 14. Rxe5+": "Here goes the next sacrifice to keep getting rid of pieces blocking the centre. Although the idea was to win Black's Queen by checking the King with a Castle, the possibility of a checkmate slowy creeps in.",
        "14... Kxe5 15. Re1+ Kd4": "Black still has little choice in the matter is forced to keep running around with his King.",
        "16. Bxd5 cxb2 17. Re4+": "By letting Black take the Bishop, the final sacrifice, it's a free run by simply forcing the King all the way to the a-line moving the Queen and Castle step by step.",
        "17... Kxd5 18. Qd3+ Kc6 19. Rc4+": "Here ends this funny and interesting \"failure\" of the Max Lange Attack!"
    },
    "url": "https://gameknot.com/annotation.pl/succesfully-failed-max-lange-attack?gm=24474",
    "gameName": "Succesfully failed Max Lange Attack",
    "players": "moorsoes (1840) vs. steve2 (1719)",
    "opening": "Scotch gambit (C44), Dubois-Reti defence"
}