{
    "moves": {
        "1. f4": "The Bird opening. Advocates of this move are usually Dutch players that like to employ the same setup as White. A leading Dutch exponent, GM Malaniuk, was asked why he didn't play 1.f4 as White given his excellent results as Black in the defense. He replied: \"The extra move would hurt me\".",
        "1... Nf6": "I use a Grunfeld setup to most offbeat White openings.",
        "2. d3 d5 3. h3 g6 4. Nf3 Bg7 5. d4": "White should have continued with the plan to play e4. Now he has wasted a tempo and weakened e4 in one move.",
        "5... Ne4 6. e3 Ng3": "Maybe a little hasty but this was more positional in nature, I wanted to get rid of White's \"good\" Bishop.",
        "7. Rg1 Nxf1 8. Kxf1 b6": "Trying to develop with tempo. The White King is pretty safe nonetheless.",
        "9. Nc3 Ba6+ 10. Kf2 Nd7": "A bad move from a pure chess point of view but from a psychological point a view, losing a pawn can really throw some opponents off their game. I regularly beat the city veteran champion with a similar approach. I either gambit or simply lose a pawn in the opening. Once he sees he's gained material, he starts playing bad for no reason at all. My current score against him in official competitions is 4-0. My opponent in this game seems to have the same belief that once you've gained material, you have to defend it at all costs.",
        "11. Nxd5 c5": "At least I have the Bishop pair, might as well try to open the position and hope for an attack against the uncastled White King.",
        "12. dxc5 Nxc5 13. Re1": "Making room for the King to reach the safety of g1.",
        "13... Ne4+ 14. Kg1 Qd6": "I was trying to prevent Nb4 and keep the Queens on the board. Also I'm preparing to bring the rooks into play.",
        "15. c3": "A good defensive move, but White's Bishop is now hemmed in behind pawns.",
        "15... O-O": "If 0-0-0 White can save the piece with Qa4. Still maybe this was a stronger move, since after the forced 16.Qa4 Nc5 17.Qa3 Qxd5 18.b4 Bb7 19.bxc5 Qxc5 20.Qxc5 bxc5, Black has regained the pawn and has a large positional advantage.",
        "16. Nb4": "Forcing the exchange of Queens. Incidentally, this is forced since other moves leave Black better. ",
        "16... Bb7 17. Qxd6 Nxd6": "The Queens have been exchanged but White still has some problems to solve. e4 and c4 are weak spots, his Bishop is bad and his piece coordination isn't quite so good.",
        "18. Nd2 a5 19. Nd3 Rfd8 20. Nf2": "Trying to take control of e4 and removing itself from the Rook skewer.",
        "20... e5": "Opening more lines for the Bishops. I'm also hoping this pawn will come to e4 so that the White Bishop won't have a good square to develop.",
        "21. Ng4 e4 22. Nf2": "White missed his last chance to play Nb3 and bring the Knight to the center.",
        "22... a4 23. a3": "Stopping Black from playing a3 himself but now the White squares are chronically weak and the Bishop is doing life without the possibility of parole.",
        "23... f5": "That pawn was a great investment, I really liked my position here. There isn't much White can do in his two back rows of the board, while Black can sing and dance in his fields of glory.",
        "24. g4 Ba6 25. g5": "Better was to keep the tension or ever exchange and try to do something on the g-file. White is praying that a miracle will happen and his jailed Bishop might get a presidential pardon. ",
        "25... Nb7 26. Rd1 Rd6 27. Nf1": "Forced, or else the doubled Black Rooks will be sure to win a fat chunk of material.",
        "27... Rxd1 28. Nxd1 Rd8 29. Nf2 Nc5 30. Nd2 Bc8": "Rerouting to a different spot where the Bishop will be more active.",
        "31. Kf1": "Not much for White to do. Still waiting for that presidential pardon...",
        "31... Be6 32. Ke1 b5": "It's 2 vs 3 and the Black team is winning.",
        "33. h4 Kf7 34. Nf1 Bd5": "34...Nb3 was a lot stronger but why not torment White for being greedy a little longer?",
        "35. Ng3 Nb3 36. Rb1 Bc4 37. Ne2 Bxe2": "I didn't want this Knight to reach d4 but instead 37...Bd3 was stronger.",
        "38. Kxe2 h6": "Opening another line of attack.",
        "39. Kf1 hxg5 40. hxg5 Bf8 41. Ke2 Bc5 42. Nd1": "Over protecting e3 but now the killer comes through the backdoor.",
        "42... Rh8 43. Nf2 Rh2": "White is now in zugzwang.",
        "44. Kf1 Nxc1 45. Rxc1 Bxe3 46. Rc2 Ke6 47. Kg1 Rxf2 48. Rxf2 Kd5 49. Kf1 Bxf2": "The king comes to c4 and it's all over. White had enough and resigned."
    },
    "url": "https://gameknot.com/annotation.pl/suffering-for-a-pawn?gm=25499",
    "gameName": "Suffering for a pawn",
    "players": "bone1 (1614) vs. nyctalop (1739)",
    "opening": "Bird's opening (A02)"
}