{
    "moves": {
        "1. e4 e5 2. d4": "The center game. exd4 is pratically forced. ",
        "2... exd4 3. Nf3": "An interesting idea, as after 3.c5 4.c3 4.dxc3 5.Nxc3 white has now sacrificed a pawn in a line similar to the Marshall Gambit in the center game with an extra tempo, which is very useful. ",
        "3... Nc6": "Black decides to transpose back into normal King Pawn openings. ",
        "4. Bc4": "The Scotch Gambit. From here italian games and 2 knight defenses can be reached  depending on black's move. ",
        "4... Nf6": "Now the game has become a line in the 2 knights where white sacrifices a pawn after 0-0. ",
        "5. c3": "Though white tries to mix things up in the center. Black can win a pawn in many ways here but black decides to get into the italian game where black equalizes instead of having to get barraged by an attack, even if it might not be sound. ",
        "5... Bc5 6. cxd4 Bb4+ 7. Bd2": "Known to be the safer choice as after Nc3 Nxe4 white is struggling for equality. ",
        "7... Bxd2+ 8. Nbxd2 d5": "A crucial move as it destroys the strong white center. ",
        "9. exd5 Nxd5 10. Qb3": "Pressuring d5 and b7. ",
        "10... Nce7": "All of the moves up to now have been theory and black has obtained an equal game. ",
        "11. O-O-O": "?! A bold move as the white king will definiltly come under fire in the near future. One very basic idea for black is kingside castling and a queenside pawnstorm, when white's half open c- file and misplaced queenside pieces should cause the attack to accelerate. ",
        "11... c6": "Cementing the d5 square and preparing b5. ",
        "12. Ne4": "Placing the knight on an active square and threatening to go to c5. ",
        "12... O-O 13. Ne5": "Now white's knights look powerful so black decides to slowly drive them back. ",
        "13... f6 14. Nd3 Kh8": "Taking the king off of the annoying pin on the a2 g8 diagonal. ",
        "15. h3": "Preparing a kingside pawn storm with g4 and f4. G4 also locks out my light squared bishop. ",
        "15... Nc7": "?! A tricky move and I'm unsure if it's a good one. The logic is that b5 wins the bishop so the d3 knight has to move again and then after b5 and a5 black will win tons of tempo on the misplaced queenside pieces. ",
        "16. Nf4 b5 17. Be2 a5": "But black still has to figure out what to do with the light squared bishop .  ",
        "18. Nc5": "Jumping on the tasty c5 square. ",
        "18... Ncd5": "?! An intersting exchange sacrifice based on the idea that white has been moving his knights almost every move for the last 8 moves. Black thinks that by getting rid of  white's only two active pieces, the black knights on d5 and c4 will be more powerful than the enemy rook and bishop.",
        "19. Nfe6 Bxe6 20. Nxe6 Qd6 21. Nxf8": "Accepting the challenge. ",
        "21... Rxf8": "White has won the exchange but already black's queenside attack is looking menacing. ",
        "22. Bf3": "Trying to trade the much stronger knight for the lowly bishop. ",
        "22... Nb6": "Not allowing the exchange as it would diminish black's attacking chances. ",
        "23. Qc2": "White already feels uneasy about the pawn front and retreats his queen. ",
        "23... Nc4": "Placing the knight on the excellant c4 square. ",
        "24. Rhe1": "Trying desperatly to drum up some counterplay along the e file. ",
        "24... a4": "Advancing the pawn front. Now a3 , after b4 is a serious consideration as it rips apart the white queenside. ",
        "25. Qe4": "White still tries to attack , but this allows the knight to come to d5, something that white should have prevented. ",
        "25... Nd5": "Now it's clear that the knights are extremely powerful and white should try to dislodge them immediatly. ",
        "26. Qh4 Nxb2": "! A good move as after Kxb2 black has  perpetural check with Qb4 . After Bxd5  Nxd1 white would return the exchange with black being better. ",
        "27. Be4": "White tries for mate on h7.",
        "27... f5": "After Bxf5 Rxf5 Re8  Rf8 Rxf8 Qxf8 Kxb2 black still has the perpetural  by Qb4 . ",
        "28. Bxd5 Nxd1 29. Qe7 Qxe7 30. Rxe7 cxd5": "Pratically forced as after a knight move white eats up all the queenside pawns. ",
        "31. Kxd1 b4": "Black tries to create a passer. ",
        "32. Rd7": "Black can't avoid losing a pawn. ",
        "32... b3 33. axb3 axb3": "One interesting try would have been a3 when Ra7 Rb8 Rxa3 g6 and black sells the pawn for a better price. ",
        "34. Rxd5 Rb8 35. Kc1 g6 36. Rc5 Kg7 37. Rc7+ Kg8": "Now white is winning due to his plan of rounding up the b3 pawn with Kb2 and Rc3. ",
        "38. Kb2": "White, being short of time, and not seeing the idea of rounding up the b pawn agreed to a draw! This game was very exciting with the exchange sacrifice and I was surprised it even almost worked. "
    },
    "url": "https://gameknot.com/annotation.pl/super-cup-1-2006?gm=1755",
    "gameName": "Super Cup 1- 2006",
    "players": "Victor K. (1750) vs. Grant N. (1700)",
    "opening": "Centre game, Kieseritsky variation (C21)"
}