{
    "moves": {
        "1. d4 d5 2. Bf4 g6": "Seldom played, but very good, in my view. It becomes difficult to work the pawn storm I normally plan here. ",
        "3. Nf3 Bg7 4. e3": "My aim is not d4. I want to break in into the kingside with g and h, while defending d4 even at cost of c3. ",
        "4... Nd7": "I can't avoid e5 forever, but it holds for now. ",
        "5. c4": "Taking a risk. This is not bad, of course, but leads me out of my \"confort zone\". I decided blitz are for dare.",
        "5... e6 6. Nc3 Ne7 7. g4": "No, you won't put this knight on f5, to go to h4 supported by the queen... and I am free to play this now, I have to take it, now or never. ",
        "7... c5": "This kind of Tartakower's move always baffles me. But I wanted to enjoy myself. ",
        "8. Bd6": "Once a d5 defender is removed, it becomes vulnerable. ",
        "8... cxd4 9. Bxe7": "If Nc3-b5, he castles, and I would have a hice Nc7, Rg8, Qa4. -- If now Qh5, b4.  --- But the  previous sequence have a downside I didn't note. Can you see it?",
        "9... Qxe7 10. Nxd4": "If cxd5, dxN, and d6 is not enough to compensate (bxce, Bxce+, forking the rook...). exd5 was dangerous, with the black queen still there, and e5 coming soon...",
        "10... Nb6": "...and this allows black time to defend d5. Now what?",
        "11. c5": "?? A blunder, of course!",
        "11... Qxc5": "Well, IF THIS MOVE WAS A PLANNED STRATEGY, which would have been the plan?",
        "12. Rc1": "This one, for sure. ",
        "12... O-O": "Black allows the discovered queen-check. Ok, now, which is the best square to move the knight on? I was trying to trap the black queen, or at least to force her to retire in a bad position, but it didn't seems possible. Can you see why?",
        "13. Ncb5": "? Very bad move. It allows...",
        "13... Qb4+": "...and for this reason, I should have played a3. The problem was that this allowed e5 by black, a threat I have to keep my eyes on. My position is lost. I am at the very bottom...",
        "14. Qd2": "By exchanging queens, my king is not too badly placed, and the game takes a slower pace. ",
        "14... Qe7": "...so my opponent doesn't fall for it. Very good. I have a tempo to reorganize myself. Can this queen cause harm? Yes, on h4 it will be annoying. So, don't rush for some piece in c7, be wise...",
        "15. h4": "... this also blocks a future Ba6. It becomes dangerous in some lines. ",
        "15... e5": "Ok, now let's see if I can be a Phoenix...",
        "16. Rc7 Qd8 17. Nb3": "I couldn't see any point in losing the kinght. But now I am in serious danger. ",
        "17... a6 18. Qa5": "...but I have this resource. It is disastrous, since after axNb5, QxNb6, Rxa2, causing serious damage to my queenside. ",
        "18... Bxg4": "Black spares me a tempo, but not without multiple threats. ",
        "19. Qxb6": "I have to take, or I'll lose my rook. I could have escaped with Rxb7, but it was dangerous to leave the c column to black. d4 is coming, if ever I allow it. ",
        "19... Bf3": "Right place to move the rook, pleas?",
        "20. Rg1": "Let's say I am tempting black to go Qxh5, allowing me some nasty trick on the queenside... and I can defend f1 in one tempo against the queen and the black's lsb, if needed. Of course, I expected axNb5, here, freeing my lsb for my good. But instead...",
        "20... d4": "It had to come, sooner or later. I'm sure this was not the right timing. I can't allow black to open the e column, or I'll be lost! By the way: if you asked why I didn't take before b7, this can be part of the answer. The oher is Rb8. ",
        "21. Nd6": "I have to point all my cannons against f7: it's the only way to survive. And miracolously enough, black spared my knight, that now blocks the black queen's action on the d column. My position is still lost, but... my opponent is not playing accurately enough to take full advantage of it.",
        "21... dxe3": "yes, yes, now I take it back, and Bh6 blocks my queen to the defence of e3... no, no, I have to drive the game to MY way. Can I? Maybe... yes, maybe...",
        "22. Rg3": "Rh3 should have been played before. But now it has an extra meaning. ",
        "22... exf2+ 23. Kxf2": "...and that's it! Black now can play Qxh5, but I'm not sure he will get enough after KxB, Qf4+, Kg2...",
        "23... Bc6": "Cutting the kinght out of the defence of the queen. ",
        "24. Rd3": "Weird, but it's a way to make useful the lsb on f1. Now, another discovered queen threat is set. This is becoming pretty complicated. Black can play e4, because of Nxe4, Qxh5+, Ng3, Qh2+, Ke1, Bxb2... very, very dangerous. ",
        "24... Qxh4+ 25. Ke2 Qg4+": "More dangerous was e4, in my view. White can still use the queen to retire, in case of emergency. ",
        "26. Ke1": "Where to move the king? It can be a great difference. ",
        "26... Qh4+ 27. Kd1 Qg4+ 28. Be2": "Fantastic! This alows me to cover, getting into the game my last piece. ",
        "28... Qg2": "A free tempo! Yuppie!!!!!!!",
        "29. Nxf7": "Chess is not for chickens, you see? Moreover: a more passive move, and black's Rd8 will be coming... can you calculate how things will be after Rd8?",
        "29... Bb5": "Pretty. ",
        "30. Re3": "? Qe6 was the right move, threatening the classical smothered mate with Nh6++, Qg8+...",
        "30... Qg1+ 31. Kc2": "Note that my rook e3 is pinned to my queen. Black can't play Rd8+ right now, but after the knitgh is taken... so I'm not out of danger, at all...",
        "31... Rxf7": "An assassin would have preferred Rc8, I'd say... but it is all very confusing. ",
        "32. Qe6": "...but not as much as confusing as not to see this mate threat! Now, this will become a deadly fight for f7.",
        "32... Raf8 33. Rf3": "Yes, this is a \"superpin\", indeed... two hanging rooks pressuring a pinned f7... and a BLACK bishop... but wait, the white's king is still exposed... isn't it?",
        "33... Be8": "Please count...",
        "34. Bc4": "add one...",
        "34... Qg2+": "and now, the winning move!",
        "35. Nd2": "! Foreseen. White's position holds until Bh6 is played... ",
        "35... Qg5": "...but unfortunately for the beauty of the game, black delays it one move. An useless move, I'd say...",
        "36. Rfxf7": "No way out...",
        "36... Bxf7 37. Rxf7 Qd8": "The losing move, but what else was possible?",
        "38. Rd7+": "Somebody I know would call it a resignation based of \"ruinous loss of material\"... :)"
    },
    "url": "https://gameknot.com/annotation.pl/superpin?gm=53224",
    "gameName": "Superpin",
    "players": "damalfi  vs. vdarknight ",
    "opening": "Queen's pawn, Mason variation (D00)"
}