{
    "moves": {
        "1. c4": "The English opening.",
        "1... e5": "Black chooses a reversed-Sicilian, which suits me fine, and frequently (in my experience) leads to very sharp play--perfect for blitz chess.",
        "2. g3": "My preferred continuation. 2. Nc3 is perfectly playable here as well.",
        "2... c6": "This move has the potential to transition many different ways. Most importantly to me, it indicates that Black plans to seriously contest control of d5.",
        "3. Nc3": "Other popular moves here are 3. b3, 3. d4, 3. Nf3 and 3. Bg2. I chose the text move to show a confrontational stance--I'm not giving Black d5 without a fight.",
        "3... b6": "Planning to fianchetto the Bishop, to compete with me along the a8-h1 diagonal. I haven't seen any theory supporting this move, but I don't necessarily dislike it.",
        "4. Bg2 Bb7 5. Nf3": "We both continue our development, and I begin to prepare for an eventual d4.",
        "5... d6": "This is about the only way to shore up e5, so Black's ...d5 push will have to wait.",
        "6. b3": "I feel like e5 is weak, so I get ready to pressure it and support my coming advance to d4.",
        "6... Nf6": "Black needs to catch up in development, so this is logical. 6...Nd7 would be fine as well, I think.",
        "7. Bb2 Be7": "Preparing to castle. This is the best spot for that Bishop at the moment, since Black's d-pawn can't get out of the way just yet.",
        "8. d4": "I have a slight edge in development and initiative, so I want to break the position open before he can catch up.",
        "8... e4": "This is a solid move, as ...d5 is coming and that advanced pawn will be well defended.",
        "9. Ng5": "Threatening e4, mostly as a formality.",
        "9... d5": "White cannot remove this defender efficiently.",
        "10. f3": "I attack the pawn chain head-on, planning 10...exf3 11. exf3 followed by O-O and f4.",
        "10... c5": "! Lending the Bishop's support to e4 and increasing the tension in the center. He wants to complicate the situation so I'll make a misstep--the same general idea that I favor in blitz games. Things are about to get really hairy; one wrong move on either side could spell disaster.",
        "11. O-O": "Given the complicated nature of the position, I feel it's wise to get my King out of the way. I'm also starting to think about sacrificing my Knight on f7 if Black doesn't castle soon, in order to attract the Black King into the path of my Rook.",
        "11... h6": "Black tries to kick my Knight back to a dismal post at h3, giving him a clear advantage in the center and the initiative.",
        "12. Nxf7": "I think I can get compensation for the Knight. I have a slight developmental advantage and 12...Kxf7 13. fxe4 dxe4 14. Nxe4 Rf8 15. d5 Kg8 looks promising.",
        "12... Kxf7": "Pretty much forced.",
        "13. fxe4": "As planned, pinning Black's Knight.",
        "13... Kg6": "?! This surprised me a little. Obviously Black wants to avoid letting me play 14. e5, and 13...Kg8 would trap his Rook, but g6 feels like a very exposed path to h7.",
        "14. exd5": "I decide to stuff Black's dangerous LSB, while claiming a third pawn in exchange for my Knight and opening up the b1-h7 diagonal for my Queen and/or Bishop.",
        "14... Rf8": "? This feels out-of-place, and Black can't afford the tempo. He needed to play 14...Kh7 here, because now he's about to lose his chance.",
        "15. Qd3+": "I force Black's King back into the pin, and free my a1 Rook.",
        "15... Kf7": "Black pulls back (not that he had much choice) and is now only a move away from relative safety on g8. ",
        "16. Qh7": "I want to keep Black tangled and keep the pressure on; the loss of my d-pawn is worth keeping the King out of his safehouse.",
        "16... cxd4": "Black accepts the proffered pawn, threatening to open a line for the dark Bishop to the White King. ",
        "17. e4": "! After 17...dxc3 18. Bxc3, the Black King must retreat to e8 (allowing Qxg7 and a strong position) to avoid my pawn advancing to e5 and winning a piece.",
        "17... dxe3 e.p.": "Black sees it and decides to deny me the powerful center pawns. Now he threatens ...Bc4 and ...e2.",
        "18. Ne4": "Black can't play 18...e2 to any effect right now, so I centralize my Knight and unchain my Bishop, bringing up more pieces to renew my attack.",
        "18... Nbd7": "Black needs reinforcements as well, and extra support for the f6 Knight doesn't hurt.",
        "19. Rae1": "At this point, I have a feeling Black is about ready to give up on g8 and bring his King back to e8, freeing his Knight against my Queen. There are a lot of pieces between e1 and e8, but only the Bishop defends d6, and e8 seems awfully cramped. Thus, this move. ",
        "19... Ke8": "? And there it is. Black needed to get his King someplace a little safer, though looking back I actually think this move is Black's biggest misstep, for reasons that will become clear soon. For now, the White Queen is in danger again, and White has a few options to deal with it. Without looking ahead, what would you play?",
        "20. Rxe3": "20. Qxg7 or 20. Qg6+ are strong as well, but frankly I think this is the flashiest way to go about protecting my wayward Queen (and pressing the assault, and setting a trap--remember, this is blitz!).",
        "20... Nxh7": "Black, under time pressure and grasping for useful moves, doesn't see the danger! He has very few better choices here as his position is, to put it mildly, cramped, and the huge number of variations to follow is a serious concern with only a few minutes left on the clock. The BK can escape with his life after 20...Qc7, after which Black may be able to trade down to a livable (but difficult) endgame. 20...Nxe4 loses to 21. Qg6+ Rf7 22. Qxf7#, and 20...Nc5 looks promising at first, but the situation becomes hopeless after 21. Nd6+ Kd7 22. Qf5+ Kc7 (22...Kxd6 Be5#) 23. Nb5+ Kb8 24. Be5+ Bd6 25. Bxd6+ Qxd6 26. Nxd6.",
        "21. Nd6#": "And there you have it, a couple sacrifices resulting in a neat little Knight mate on the BK's home square. This game was great fun to play; I hope you enjoyed it. Comments on the game/annotation are greatly appreciated. Thanks for reading!"
    },
    "url": "https://gameknot.com/annotation.pl/swordplay-and-sacrifice?gm=45017",
    "gameName": "Swordplay and Sacrifice",
    "players": "bwaa (??) vs. bobervig (??)",
    "opening": "English opening (A20)"
}