{
    "moves": {
        "1. Nf3": "Trainingsspiel im Team Synergie. Kommentare sind \"live\" aus der Partie.\r\nThis is a training game of team Synergie. Sorry, annotations in German language only.",
        "1... d5 2. g3 Nf6 3. Bg2 Nbd7": "arabsalam: \"ich möchte meine weitere Bauernstruktur (e6-e5, c6-5) immer noch nicht festlegen und entwickle eine Figur. Der positive Aspekt bei Sbd7 ist, daß er nach e5 schaut, negativ, daß nun Dd8 und Lc8 versperrt sind.\"",
        "4. d3": "Vorbereitung von e4, Rochade kann jederzeit erfolgen.",
        "4... e5": "(arabsalam) Mit e5 habe ich ein ideales Bauernzentrum und etwas Raumvorteil in der Mitte erreicht. Die Stellung sollte ausgeglichen sprich der weiße Anzugsvorteil neutralisiert sein.",
        "5. O-O Bc5": "(arabsalam) Um zu rochieren muss ich meinen Lf8 entwickeln.\r\n1) Le7 entfesselt prophylaktisch (bei Lg5) die Dd8 vom Sf6. Andererseits entfaltet Le7 keine Zentrumswirkung und steht eigentlich ungezwungenermassen passiv, denn mit d6 und c5 hat er aktivere Optionen. \r\n2) Ld6 überdeckt e5, so daß auf Lg5 einfach h6 folgen kann (und Lxf6 Sxf6). Nachteilig ist die fehlende Perspektive auf dieser LDiagonale Richtung Königsflügel (g3!). Zudem verstopfen jetzt Ld6 und Sd7 die d-Strasse.\r\n3) Lc5, für das ich mich entscheide, sieht optisch sicher am überzeugendsten aus, vor allem die Diagonale a7-f2 ist so viel schöner als c7-d5 bei Ld6. Allerdings hat er auch den Nachteil, dass er eine bestimmte Abwicklung zulässt",
        "6. Nbd2": "(brulla) Kontrolle über e4.",
        "6... O-O": "(arabsalam) König raus aus der Mitte",
        "7. e4": "(brulla) Damit ist der Standardaufbau des KIA erreicht.",
        "7... c6": "(arabsalam) Mit c6 festige ich das Feld d5 und öffne die d8-a5 Diagonale für meine Dame.",
        "8. exd5": "(brulla) Es starten die Zentrumsaktivitäten: Feld d5, e-Linie usw.\r\n",
        "8... cxd5": "(arabsalam) cxd5 und mein Bauernzentrum bleibt erhalten. Mein Plan ist es das Zentrum zu halten und demnächst den Lc8 ins Spiel zu bringen",
        "9. Re1": "(brulla) So, der Turm macht nun Druck auf der e-Linie. Klar, Du willst Deinen Läufer entwickeln, also muss ich Dich beschäftigen, damit Du das nicht realisieren kannst. Falls Du den Läufer über b7 entwickeln willst halte ich mal Ausschau nach kleinen Gemeinheiten über die lange Diagonale.",
        "9... Qb6": "(arabsalam) Tatsächlich bindet Te1 meinen Sd7 an die Deckung von e5 und mein Vorhaben, etwas für den Lc8 zu tun rückt in weitere Ferne. Andererseits ist das noch nicht so dramatisch, weil es um deinen Lc1 augenblicklich nicht besser steht. Sollte ich den Lc8 einmal entwickeln können, geschähe das eher nach f5 oder g4 als nach b7. \r\nTe1 hat aber auch einen Nachteil, denn jetzt deckt nur noch der Kg1 den Bauern f2. Mein nächster Zug macht sich das zunutze.\r\n*******\r\n(brulla) Außerdem schaut Deine Dame nun nach b2. ",
        "10. Qe2 Ng4": "(arabsalam) Sb4 gibt es nicht, aber Sg4: \r\nDas attackiert f2 (und deckt e5) und forciert Tf1, womit dieser wieder auf seinem Ausgangsfeld landet und die e-Linie räumen muß. Andererseits ist fraglich, wo mein Sg4 hin soll, wenn du h3 spielst. auch bleibt mein Lc8 immer noch beerdigt.",
        "11. Rf1": "(brulla) Richtig! Diesen \"Tanzschritt\" mit dem Turm hätte ich mir sparen können, wenn ich gleich 9.Qe2 gezogen hätte. Wieder was gelernt! :)",
        "11... f5": "(arabsalam) Du sagst es, Tanzschritt, ein Schritt nach vorn, einer zurück, und nicht nur dein Tf1e1, sondern auch wahrsch. mein Sf6g4f6 (wenn du h3 spielst), mit dem Unterschied, daß ich den \"sidestep\" f5 einschiebe und so ein wichtiges Tempo im Zentrum gewinne. Nach f5 ist für S in solchen Stellungen oft die Diagonale g8-a2 ein Problem. In dieser konkreten Stellung ist das aber nicht der Fall, weil da erstmal keine W Figuren hinkommen. Nach 12...Sf6 oder später steht mein Sf6 hinter dem f-Bauern und nicht vor ihm, ich denke, das ist eine bedeutende Verbesserung meiner Position. Ich sollte hier mindestens gleiches Spiel haben, und das ist wahrscheinlich eine pessimistische Schätzung. ",
        "12. h3 Ngf6": "(arabsalam) Sf6 ist hier der einzige Zug und Sh6 keine Alternative",
        "13. Nb3": "(brulla) Alles nachvollziehbar. Ich versuche jetzt, meine Figuren, insbesondere den Läufer c1 und den Springer f3 ins Spiel zu bringen. Damit könnte auch mein Läufer g2 Platz bekommen.",
        "13... Bd6": "(arabsalam) Sb3 gegen Lc5 wäre ein schlechter Tausch für mich, denke ich, daher Ld6",
        "14. Bg5 e4 15. Nfd4": "(brulla) 14...e4 ist ein guter \"Dominierungszug\". Ich war erst versucht, 15.Nfd2 zu spielen, aber dann fielen mir die schwarzfeldrigen Diagonalen auf. dxe4 kam für mich nicht in Frage, da ich Deinen Springer nicht auf e4 haben will! Wie gut, dass Deine Bauern auf den Linien c und e schon \"vorbei\" sind.",
        "15... Ne5": "(arabsalam) Mit meinem nächsten Zug zentralisiere ich meinen Sd7 und befreie endlich den Lc8 aus seinem Kerker. Anders als Läufer sind im Mittelspiel Springer im Zentrum am stärksten positioniert. Nachdem ich die Zentrumsfelder dominiere, bin ich nun bestrebt Zentrumsnahe Felder wie f3, d3 oder c4 zu erobern sowie die c-Linie mit meiner Artillerie zu bestücken.",
        "16. Bxf6": "(arabsalam) einziger sinnvoller zug hier",
        "16... Rxf6 17. dxe4 fxe4": "(arabsalam) fxe ist besser als dxe weil es dem Lc8 und Tf6 die Diagonale bzw Linie öffnet und zudem die Kontrolle über das Feld c4 (via d5) erhalten bleibt.",
        "18. a4": "(brulla) Ziel: Raumgewinn am Damenflügel. Etwas Sorge macht mir Deine Beherrschung des Feldes f3....mein Springer d4 steht zwar gut, weg darf er aber von sich aus auch nicht.",
        "18... Nf3+": "(arabsalam) a4 gefällt mir sehr, nachdem du im Zentrum und Königsflügel beengt stehst, versucht du am Damenflügel vor allem mit Unterstützung der d4-b3 Kavallerie Druck zu machen. Mit a6 oder Ld7 könnte ich jetzt Gegenmaßnahmen ergreifen und meine Position weiterverstärken. Aber am Königsflügel kann ich mit einer taktischen Abwicklung das Spiel verschärfen",
        "19. Bxf3 exf3 20. Qe8+ Rf8 21. Qh5 Kh8": "(arabsalam) Der Vorführeffekt hat mich erwischt, Dh5 hatte ich gar nicht auf dem Schirm, meine taktische Abwicklung ist nach hinten losgegangen. Anstatt 18...Sf3 ? hätte ich mit dem ruhigen Ld7 meine Position verstärken müssen. Jetzt stehe ich ziemlich blöd da.",
        "22. Rfe1": "(brulla) Insbesondere auf meine Springer bin ich ziemlich stolz. Aber \"die Messe ist noch nicht gelesen\", jetzt kommt die große Frage: wie weiter? Ich will mal eine weitere Figur aktivieren. Da scheint immer noch einiges an Taktik drin zu sein.\r\n",
        "22... Bd7": "(arabsalam) Jetzt kommt leider verspätet Ld7.",
        "23. a5": "***",
        "23... Qc7": "(arabsalam) Viele Felder hat meine Dame ja nicht. c7 ist oft ein gutes Feld für sie, vor allem wenn die Linie halboffen ist und nicht etwa Tc1 sie direkt wieder vertreiben kann. Zudem kann nicht Sb5 kommen, was auch unangenehm wäre. Desweiteren verstärke ich die Diagonale b8-h2.",
        "24. c3 Bxg3": "(arabsalam) Mit Lxg3 zerschlage ich jetzt den Bauernwall um deinen König. Wenn man es abzählt, sind es nur deine Dh5 und der Sd4, die deinen König beschützen (f3 u h3), während meine beiden Läufer, der Turm und die Dame deinen Königsflügel anstrahlen. Die Verwicklungen habe ich nicht durchgerechnet, ich opfere aus strategischen Erwägungen heraus.\r\n"
    },
    "url": "https://gameknot.com/annotation.pl/synergetisches-scharm-tzel?gm=11601",
    "gameName": "Synergetisches Scharmützel",
    "players": "brulla (1626) vs. arabsalam (1994)",
    "opening": "Reti (A07), King's Indian attack, Yugoslav variation"
}