{
    "moves": {
        "1. e4": "Kadhim starts with the King's Pawn Opening.",
        "1... e5 2. Nf3 Nf6": "This is my favourite opening, Petrov's Defence. Black wants to open up the position, but his symmetrical moves are unlikely to lead to an active position.",
        "3. Bd3 d5 4. O-O": "Note that Black's pawn on e5 was still en prise. White could have taken it with the knight with little worry, but castling was his first mistake.",
        "4... dxe4": "This move forks White's bishop and knight, as Black's pawn is backed up by the knight on f6.",
        "5. Bb5+": "White temporarily looks to have regained some flow, but that is not the case.",
        "5... c6": "White must once again choose which piece to save.",
        "6. Bxc6+ Nxc6 7. Nh4 Nd5": "Black could have won White's knight with 7. ... g5, but he still succeeds anyway.",
        "8. Re1": "Mistake number two. White could have defended the knight with 8. ... g3.",
        "8... Qxh4 9. g3": "White plays the move too late.",
        "9... Qh6": "Black can't save both the queen and the pawn on e4 at once.",
        "10. Rxe4 Qg6 11. d3 Bf5": "Black's position is now very dominating.",
        "12. Ra4 b5 13. Ra6": "White's third mistake. The rook can now be trapped.",
        "13... Nc7 14. Ra3 Bxa3 15. bxa3": "At this point, one has to wonder how in the world could Black stuff things up.",
        "15... Qf6 16. c4 e4 17. Bf4": "Mistake number four by White. His rook is en prise due to Black's previous pawn push. Black needn't waste time on defending the knight.",
        "17... Qxa1 18. Bxc7 exd3": "Black wins a pawn and also places one of his own deep into White's territory. The pawn is immune to capture by the White queen since it's backed up by the bishop.",
        "19. Qe1+ Be6 20. cxb5": "White makes up for the previous pawn loss, but his resulting pawn position is not quite as powerful as Black's. However, though it may not look like it, this is the pawn that will later give Black tremendous fear.",
        "20... Rc8": "Black favours attacking the bishop over saving the knight. However, White doesn't comply with his plan.",
        "21. Bd6 Rd8 22. bxc6 Rxd6 23. c7": "This is the critical moment. White has a pawn on its way to promotion, but it can be easily stopped. Black, on the other hand, is as oblivious as ever. Note that Black's bishop is pinned. It can't move as that would place the Black king in check.",
        "23... d2": "This looks pretty alright for Black, as he presumes that he'll get another queen too.",
        "24. c8=Q+": "And now Black's troubles begin. He thought that he would be able take White's new queen but failed to appreciate the pin placed on the bishop. This would still not be so bad if the move didn't place Black's king in check, but that is not the case.",
        "24... Rd8 25. Qc6+": "For a great deal of time, White simply harasses the Black king.",
        "25... Ke7 26. Qb7+ Rd7 27. Qb4+ Ke8 28. Qd1": "This is Black's chance. He has to do something that will let him stay in the game.",
        "28... Bxa2": "This looks like a wasted opportunity, but pressure is now building up around White's knight. Note that Black still has the pawn on d2.",
        "29. Qe2+": "White now resumes his harassment of Black's king.",
        "29... Be6 30. Qbb5 Kd8 31. Qa5+ Ke8 32. Qab5": "Another break in White's series of checks. Black can now try to get something underway. It is of high interest that Black hasn't simply resigned. He has two rooks in place of an extra queen, though one of his rooks is tucked away on h8 doing nothing.",
        "32... Kf8 33. Qb8+ Ke7": "Black no doubt longs for White to capture the exposed rook on h8, as he can then play 34. ... Qxb1+ or 34. ... d1=Q+ or even 34. ... d1=R+, since he would threaten so much. However, Black has forseen this and decides against taking the rook.",
        "34. Qb4+ Rd6": "Black's hopes of glory are now wiped away. The rook, in addition to the bishop, is pinned against the Black king, and the pawn on d2 is now open to capture.",
        "35. Qexd2 Qxb1+": "What in the world? Black has just sacrificed his queen. Interestingly, this move is pretty solid, as after 36. Qxb1 Rxd2 Black has two rooks and a bishop against a queen, which is pretty good.",
        "36. Kg2": "Making a move even more amazing than the last, White rejects the sacrifice.",
        "36... Bd5+": "Black now takes action. It is his turn to harass his opponent's king. This looks fine, but in reality, Black's bishop is open to capture by White's queen on d2, as the rook is pinned. However, White fails to appreciate that.",
        "37. f3 Bxf3+": "Black is very daring. Sacrificing his bishop, this move looks like insanity, but, in truth, Black gains an advantage in attack.",
        "38. Kxf3 Qf1+ 39. Kg4 h5+ 40. Kh4": "White's king must be starting to feel quite unsafe.",
        "40... Qf6+ 41. Kh3 Qf5+ 42. Kg2 Rhd8": "With this, Black defends against White capturing the rook on d6.",
        "43. Qe3+ Kf8 44. Qxa7": "White goes for a petty pawn grab which, in all honesty, is probably his undoing.",
        "44... Kg8": "A very good move by Black, as his rook on d6 is no longer pinned to the king.",
        "45. Qac5": "And after all that, this is White's fifth and final mistake.",
        "45... Rd6d2+ 46. Kg1 Rd2d1+ 47. Kg2 Rd8d2+": "Black now has two options, but both of them lead to ruin.",
        "48. Qxd2 Rxd2+ 49. Kg1 Qb1+": "Black now forces White's next move.",
        "50. Qc1 Qxc1#": "A beautiful game, not just in the moves, but in the astonishment it conjures up as well. Black was essentially down a queen but still won, with White giving up both of his queens to prolong checkmate. And, curiously, it all happened in exactly fifty moves. If you wish to leave me a suggestion for an annotated game, or want to leave me feedback, please drop me a message. Your help is appreciated."
    },
    "url": "https://gameknot.com/annotation.pl/kadhim-anonymous-chess-com-2010?gm=33953",
    "gameName": "Kadhim-Anonymous, Chess.com 2010",
    "players": "Ayad Kadhim (unknown rating) vs. Anonymous (unknown rating)",
    "opening": "Petrov's defence (C42)"
}