{
    "moves": {
        "1. e4 d6 2. d4 Nf6 3. Nc3 g6 4. f3": "An unusual move; Nf3, f4, or Be3 are far more common here.",
        "4... Bg7 5. Be3 Nbd7 6. Qd2": "Aiming to trade off Black's fianchettoed bishop with Bh6.",
        "6... h5": "This prevents that trade, but at what cost? Black's kingside is severely weakened, and suddenly castling seems a lot less safe. Moves like h4 and g4, seeking to pry open files on the kingside, are suddenly in the offing after White castles queenside.",
        "7. O-O-O b6": "This is a mistake. Black does not have time to take this liberty.",
        "8. e5": "I actually had one of my 2006 tournament games, in which I was also White against the Pirc, analyzed by GM Lev Alburt, analyzed in the May 2007 issue of Chess Life. There, Alburt pointed out that I could have repeatedly gotten an advantage by playing the e5 pawn push because my opponent had allowed it. He said that this move is thematic in this opening and that White should play it. I wasted no time, seeing that Black's knight doesn't really have any good squares.",
        "8... Ng8": "Maybe h7 would have been a better square for the knight, seeking to castle.",
        "9. e6": "Seeing that I am much superiorly developed, I decided to sacrifice this pawn to weaken his kingside.",
        "9... fxe6 10. Bb5": "This may not have been as good of a square as d3; I'm not sure. I didn't want Black moving his knight to f8 to defend the e6 pawn, and to subsequently start pushing his center pawns. No doubt that would have been very weakening, but I don't like being material down, and I was most interested in trying to regain my pawn by aiming my forces at g6. Thus, this pin.",
        "10... Bb7 11. Qd3 Kf7 12. Nh3": "This is a better launching point for the knight than e2 because of the move ...e5, which robs the knight of the f4 square. Here, the knight can also go to g5.",
        "12... Bf6": "As horrible as it looks, I have to wonder about ...Nf8 here instead, defending the g6 pawn. Now, White has a chance to snap the knight off.",
        "13. Bxd7 Qxd7 14. Nf4 Ke8": "This gives up the pawn without a fight. Since Black ends up sacrificing the exchange with Rh6 the next move anyway, if he was going to do this, this move would probably have been a much better time to do so, because it is not so easy to win an exchange that way, seeing that White's knight cannot safely advance any further.",
        "15. Nxg6": "Some of my friends thought that I should have captured with the Queen instead, but I would rather win the Exchange here than have my Queen deep in the position and worry about getting it trapped.",
        "15... Rh6 16. Bxh6 Nxh6": "My next plan was to get this knight out. In retrospect, perhaps it was unnecessary to do so, as it was very strong in its position. Still, 17.Nf4 looks very good here. However, I was sidetracked by a cheap trap that I tried setting.",
        "17. Nh8": "This is a bad move because of my opponent's excellent follow up. Obviously, I had been hoping for 17...Bxh8?? 18. Qg6 , and if 18...Nf7??, 19.Qg8#. It's tempting to try to cash in quickly after winning material, but it's not that simple here. Nf4 would have been a much better square for the knight.",
        "17... Nf5": "Now how is the knight going to get out?",
        "18. Ng6": "An admission that the past move was a horrible mistake, and that I have wasted two moves.",
        "18... Bg5+": "This cuts out f4 as a retreat square for the knight with tempo.",
        "19. Kb1 Kf7 20. Rhe1": "If 20...Rg8, 21.g4 regains the piece, albeit probably at the cost of a pawn.",
        "20... Rg8 21. g4 hxg4 22. fxg4 Rxg6 23. Ref1": "The knight is pinned; it isn't going anywhere.",
        "23... Rf6 24. gxf5 exf5 25. h4": "If 25...Bxh4, 26.Qh3 looks good for White.",
        "25... Bh6": "If 25...Bxh4,  26.Qh3 will win the pawn back (via R",
        "26. h5 e6 27. Rfg1 Bf4 28. d5": "The d-pawn is worth blocking off the bishop in order to get the queen to f3 then g2.",
        "28... e5": "This pawn roller could become a serious problem for White. My opponent was very inventive and found several moves and ideas throughout the game that I simply did not foresee. This was one of them.\n\nIt is worth mentioning that I started to realize that I was in the running for the tournament's prize money, and that I started to get very stressed, especially after a meltdown in a similar situation in the Reserve Section of last year's Missouri Open, when I blundered a rook on Board 1 in a winning position, costing myself $150. This, plus the fact that both of us were down to about 30 minutes, had me almost a nervous wreck. For this reason, some of the next few moves were not too accurate.",
        "29. Qf3 Kf8 30. Qg2 Qh7 31. Rgf1 Qxh5 32. Rfh1 Qg4 33. Rh8+ Ke7 34. Qh1 Rf7": "Shredder likes 34...Ba6 better.",
        "35. Rg1": "According to my computer, 35.Rb8 would have been virtually winning. It attacks the bishop on b8, and clears out h8 for the Queen to enter! This would have made things much easier, especially if my opponent would had seen the proper move two moves from now.",
        "35... Bg3 36. Qh6": "Threatening mate on e6.",
        "36... Bxd5": "This is a blunder. 36...f4 would have made matters much more difficult for me, bringing the queen into the defense of e6.",
        "37. Nxd5+ Kd7 38. Nf6+ Rxf6 39. Qxf6 f4 40. Rh7+ Kc6 41. Qf7 f3": "I can't underestimate this pawn, especially because I have a weak back rank.",
        "42. Qxc7+ Kb5 43. Qd7+": "My computer doesn't think this is the strongest move, but I don't regret making it; I didn't want to get into any messy queen endgames, and just try to simplify as much as possible. If I have to, I can give up one of my rooks to prevent a promotion.",
        "43... Qxd7 44. Rxd7 f2 45. Rf1 Kc5 46. Rg7": "Once this bishop is gone, Black will find it much more difficult to advance his pawns.",
        "46... Bf4": "46...Bh4 would have been met with 47.Rg4, achieving the same goal.",
        "47. Rxf2 a5 48. Rxf4": "Now the game is over. Black's pawns are no longer any serious threat.",
        "48... exf4 49. Rf7": "Here, my opponent resigned."
    },
    "url": "https://gameknot.com/annotation.pl/kansas-open-lindsborg-ks?gm=9451",
    "gameName": "Kansas Open, Lindsborg, KS",
    "players": "Holmes, Dan (1515) vs. Rolfe, Adrian (1609)",
    "opening": "Pirc defence (B07)"
}