{
    "moves": {
        "1. d4": "d4, This opening is one I'm sure most of us are familiar with so I won't bore you all too much with the details.....",
        "1... c5": "I will however introduce you to the Old Benoni defence. One which immediately asks a question of white instead of allowing him the luxury of a nice peaceful opening sequence...",
        "2. c3": "White ignores my jibe and quite sensibly decides to maintain a passive stance, for now.",
        "2... e6": "I cover my pawn and prepare to play d-5",
        "3. e3": "Forming a \"wedge\" shaped pawn chain ensuring all is secure...",
        "3... d5": "So I push my d-pawn to it's limit and secure the boundaries..",
        "4. Be2 Nf6": "Because the c1-h6 diagonal is blocked I don't have to worry about an annoying pin right now.",
        "5. Nf3 Be7": "Both preparing to castle...",
        "6. Ne5": "Instead of castling white decides to throw a knight forward maybe thinking of a sac on f3, I remain cautious..",
        "6... Nc6": "I decided to challenge the knight immediately I didn't like the idea of it lingering....",
        "7. Nxc6 bxc6": "Some may see this as a bad exchange for black, having doubled the c pawns, however in many cases I find the open B-file sufficient compensation..",
        "8. O-O O-O 9. Qa4": "Having both castled white wastes no time and strikes out at the loose pawn on c6...",
        "9... Bd7 10. Qc2": "May have been more efficient to have just put it there a move ago, white may have lost his tempo lead but I need to take advantage of that for it to be an issue...",
        "10... c4": "I decided to deaden the scope of whites Bishop on e2...",
        "11. Nd2 a5 12. b3": "White begins to chip away at the advanced c pawn.....",
        "12... Bd6": "This was bad on reflection, I should have just taken the pawn but I wanted to line my bishop up with the h2 pawn and maybe swing my Queen in front or behind the Bish....",
        "13. bxc4 Qc7": "Like so...",
        "14. c5 Be7": "And after getting my queen behind the bishop I go and wimp out of Bxh7+, why? I have no idea is the honest answer, but something about it didn't \"feel\" right at the time of play so cut my losses and retreated. :(",
        "15. Nf3": "At this point the momentum begins to swing in whites favour as the previous concession exposed my reluctance to commit to a plan, which is one of the basic rules of chess, \"you should always stick to your plan\"! My opponent seizes his chance...",
        "15... Rfe8": "Trying to rally the troops into a usable position...",
        "16. Bd3": "Now white begins to exert real pressure on my K'side and a real struggle ensues...",
        "16... Bf8": "Preparing my defences and opening up some room for my rook to add support to the e-pawn..",
        "17. Ng5 g6": "......",
        "18. f3 e5 19. e4": "Now we are engaged in a battle of wills, the tension in the centre of the board could snap at any moment with each player trying to figure out how the release of the tension can benefit them...",
        "19... h6": "I felt I was safe enough to allow my h pawn to nudge the menacing Knight out of earshot...",
        "20. Nh3": "The only safe spot...",
        "20... Bxh3": "After much deliberation I felt this to be Ok, doubling whites h pawns and opening up lines toward the white king, this must be weighed up against the very real possibility of white being able to sidestep with his king and take hold of the g file with a rook and my confidence in being able to defend against such a threat. 50/50.",
        "21. gxh3": "Now the white king is exposed and I need to find a way to capitalise..",
        "21... Qd7": "An idle threat really...",
        "22. Kg2": "Easily parried..",
        "22... Nh5": "I think about making inroads toward the white king but all I can see ahead atm are exchanges, which is not what I want right now..",
        "23. Qf2 Qd8": "Threatening + on g5...",
        "24. Rg1": "Ok, that stops that!",
        "24... Kh7": "Trying to wriggle out of the line of sight....",
        "25. Kf1": "Now I'm in a bit of a tight spot, g6 is under intense surveillance and the white king seems to have evaded any immediate threats.",
        "25... Qd7": "I throw this in as an irritation but it achieved little, a wasted move I feel..",
        "26. Qh4 Qe7": "I offer up an exchange of queens and an open invite into a quiet endgame, politely exchanging off pieces and courteously racing to promote maybe...",
        "27. Qg4": "Which my opponent is having none of, my confidence is waning but I continue...",
        "27... Qf6": "Trying to defend as best I can really whilst always keeping attacking ideas in mind, white now has to defend f3..",
        "28. exd5 cxd5": "Can you spot what I spotted here? I won't spoil it.....",
        "29. Qxh5": "As expected although I'm sure my opponent regrets this move now...",
        "29... e4": "Ensuring I get my piece back....",
        "30. Bxe4 dxe4": "Suddenly, whites attack appears to have run out of steam and is now on the defensive!",
        "31. Qg4": "Remember, white has to defend f3...",
        "31... exf3": "Of course it falls anyway and I have a real chance of an all out attack...",
        "32. Rg3": "This was a bad move, I had calculated that g3 was whites escape route, now he is doomed with a mate in 3.",
        "32... Qa6+": "And there it is, the Kansas city shuffle! This is where the game is right now but I see no defence. 33. Kf2 Qe2+ 34. Kg1 Qe1# or 33. Kg1 Re1+ 34. kf2 Qe2# Could prolong either sequence by 1 move by playing c4 but other than that...."
    },
    "url": "https://gameknot.com/annotation.pl/kansas-city-shuffle-q-a-com?gm=32485",
    "gameName": "Kansas city shuffle (Q.A.com)",
    "players": "Toin (1923) vs. zolaweed (1892)",
    "opening": "Old Benoni defence (A43)"
}