{
    "moves": {
        "1. d4 Nf6 2. c4 g6 3. Nc3 Bg7 4. e4 d6": "Standard King's Indian white now has a wide variety of choices.   \n",
        "5. Bd3": "It seems a little unusual to block the d file.  I think it might make it easier to play e5 and on d5 the bishop has little scope and black has less to fear if the pawn on d6 should become backward.  It's time to castle before black starts something.\n",
        "5... O-O 6. f4 e5": "White can try to win the e pawn but after 7. fxe5, dxe5 8. dxe5, Ng4  and black will get the pawn back with an easy game.\n",
        "7. fxe5 dxe5 8. d5 Nbd7 9. Nf3 h6": "Black does not like the possible pin with Bg5.\n",
        "10. O-O Qe7": "Protects the e pawn to allow the knight to move and post at c5.\n",
        "11. h3": "I was not sure this was necessary although it does make Be3 possible without Ng4 as a reply.\n ",
        "11... Nc5 12. Bc2": "White couldn't chase the knight with 12. b4 because 12. b4, Nxd3, 13. Qxd3, Qxb4, 14. Nxe5, Nd7 leaves white with a weakness on the long diagonal.  Trading the well placed knight for the LSB is something Black should not do though so I don't think white needed to retreat the bishop.  ( Please let me know if I am wrong about this. )\n\n",
        "12... a5": "Trying to secure the knight outpost.",
        "13. Be3": "If white captures the knight the Queen recaptures with check wins the c pawn and the black squares will be weak so black does not have to respond to the move and can go ahead with his plan.",
        "13... Nh5": "The knight has a possible post at f4.  If the knight gets to f4 and is exchanged then Black's bishop at g7 is open and there are now possibilities of using the dark squares and a threat of Qc5 ch followed by Qxc4.\n",
        "14. Qd2 Kh7 15. Kh2": "The knight could go back as white has defended both possible posts.  But if black is passive I think he gets squeezed, so...\n",
        "15... f5 16. Qf2": "Threatening the knight but the knight can be relocated.\n",
        "16... Nd7 17. g4 fxg4 18. hxg4": "I like black's position now.  17. exf5, gxf5 does not look good either the e and f pawns supported by the pieces seem dangerous.\n",
        "18... Nf4 19. Qg3": "Trading might have been better but the rook recapture puts pressure on the g pawn.\n",
        "19... Nf6": "At first it looks like white can trade on f4 and win a pawn but Nxg4ch and black actually wins a pawn.\n",
        "20. g5 Ng4+": "Black calls it quits - he will lose the bishop on e3 with a threat on the rook at f1 and white's king side is very open.\n"
    },
    "url": "https://gameknot.com/annotation.pl/ki-four-pawns-attack?gm=63551",
    "gameName": "KI Four Pawns Attack",
    "players": "Mo7475 (2004) vs. JMD1952 (1200)",
    "opening": "King's Indian (E70), Kramer system"
}