{
    "moves": {
        "1. d4": "A few days ago, I started a mini-tournament, in which all games start with the King's Indian Defence: Four Pawns Attack. All participants have to annotate at least 2 of their finished games, and ideally I would like all completed games to be annotated by mini-tournament. Incidentally, there is still one slot open in this 11-player mini-tournament, so if anyone wants to enter, could you please contact me - particularly if you are rated between 1600 and 1900, as there are no players so far within this rating range. The mini-tournament table can be viewed here: http://gameknot.com/mt.pl?id=41731",
        "1... Nf6": "Since all moves 1 - 5 are forced/thematic, I will not make any more comments until the players are free to make their own moves.",
        "2. c4 g6 3. Nc3 Bg7 4. e4 d6 5. f4 O-O": "This is the starting position of the KID:4PA. White has taken advantage of Black's hypermodern play - Black has not yet committed to a central formation - and grabbed a large share of the centre, in exchange for a very slight advantage in development for Black. Black will try to work against White's central control in the sharp variations that can ensue from this position. I personally am hoping to play above my rating in this tournament, since I have done quite a lot of preparation on the 4PA! I am also hoping to gain valuable experience of this sharp opening in this tournament.",
        "6. Nf3": "White's most common move, developing a knight to help support his broad centre.",
        "6... c5 7. d5": "Black makes his first move into the centre: White, as usual, advances his d-pawn in order to keep his strong centre together. Incidentally, in a normal (non-thematic) game, the last 2 moves are interchangeable: Black can equally choose to proceed 5...c5 6.d5 O-O 7.Nf3, transposing into the text.",
        "7... e6": "The main line of the 4PA. Another note-worthy option for Black is 7...b5, sacrificing a pawn for Volga Gambit-style queenside counterplay against White's strong centre. After 8.cxb5 a6 9.a4 I feel perfectly happy with White's position, although this would bypass all my preparation work. ",
        "8. Be2 exd5 9. cxd5": "Again, White must keep his centre together, and therefore usually recaptures with the c-pawn. The one drawback of this main line is that it gives Black a queenside pawn majority: in most following variations, Black aims to make the queenside the theatre of battle.",
        "9... b5": "Here, Black separates from the main line with this unusual pawn move. He also separates from my opening preparation, leaving me on my own. As far as I could see, White has two main options: the obvious move is to capture the pawn with 10.Bxb5, but after 10...Nxe4! 11.Nxe4 Qa5+ 12.Qd2 (12.Bd2 Qxb5 gaining a tempo with an attack against White's b2-pawn) 12...Qxb5 13.Nxc8 and I am not to comfortable with White's position, with his centre in tatters, even though he is one pawn up. The other option is 10.e5, and after 10...dxe5 11.fxe5 my consolation is that the position is similar to that reached after 9...Re8 10.e5 dxe5 11.fxe5, which contains some known drawing variations.",
        "10. e5 dxe5 11. fxe5 Ng4 12. Bg5": "I had prepared the more dynamic 12.e6 fxe6 13.d6 in the \"similar position\" I detailed above, but I was - for some reason - unwilling to risk this in an unknown position, and I simply opted for the line that, I knew, pointed towards drawing variations.",
        "12... Qb6 13. O-O Nxe5 14. Nxe5 Bxe5": "Black wins one of White's central pawns, however White has compensation in the form of his mobile, passed d-pawn, and the bishop which he is about to lodge in Black's position, like a thorn in his side.",
        "15. Be7 Re8 16. d6": "Strengthening my hold on Black's position and cementing the bishop in place.",
        "16... b4": "(?) I think this is an error by Black. This move allows the obvious and very strong 17.Nd5, planting another thorn in Black's position and winning at least an exchange due to the fork on c7. More usual for Black is 16...c4+, making use of the queenside pawn majority.",
        "17. Nd5 Qb7 18. Nc7": "Black's position is now extremely cramped because of White's powerful d6-pawn and his two minor pieces on the 7th rank. He has also lost at least an exchange, although I was (greedily?) hoping to win more than that.",
        "18... Bd7 19. Qb3": "Putting pressure on Black's f7-pawn, and threatening 20.Qxf7+ Kh8 21.Nxe8, winning a whole rook.",
        "19... Nc6": "Black develops a piece, threatening the expulsion (excommunication?) of White's bishop on e7, and also opens up another line of defence on his e8-rook. White now has to play forcing moves to convert his advantage into a win, otherwise Black will start liquidating material. This isn't as hard as it sounds, because White has a forced win/checkmate here.",
        "20. Qxf7+ Kh8 21. Bf6+ Bxf6 22. Qxf6+ Kg8": "All Black responses are forced.",
        "23. Nxe8 Rxe8 24. Bc4+": "Black's king is immobile, and the game will conclude 24...Be6 25.Bxe6 Rxe6 26.Qf8#, or 24...Re6 25.Qf8#. Black resigned."
    },
    "url": "https://gameknot.com/annotation.pl/kid-four-pawns-attack-thematic-invitational?gm=28369",
    "gameName": "KID: Four Pawns Attack Thematic Invitational",
    "players": "fatcat2 (1456) vs. tonybelgium (1209)",
    "opening": "King's Indian (E76), Four pawns attack, dynamic line"
}