{
    "moves": {
        "1. d4": "Once again I lost the toss and had to defend with black",
        "1... Nf6": "So I play my usual.",
        "2. Nf3": "And he does this, fairly standard, but ruling out certain variations, such as the 4 pawns attack or the samisch against the King's Indian. Maybe I should have played a King's Indian, with g6, Bg7, 0-0 and d6, but I played something else, which I have been playing in some Gameknot games.",
        "2... e6": "Heading for either the Queen's Indian or Nimzo-Indian.",
        "3. c4": "Keeping his choices of how he will develop his Bf1",
        "3... b6": "So I go into the Queen's Indian",
        "4. g3": "This is a common reply by white",
        "4... Bb7": "I develop",
        "5. Bg2": "So does he",
        "5... Bb4+": "I throw in a check, rather expecting Bd2 or Nbd2 transposing into The Bogoljubow Defence or Bogo-Indian.",
        "6. Nc3": "But he played this. I would now call this the Nimzo/Queen's Indian hybrid, but Gameknot calls it Queen's pawn (A46), Torre attack, although that normally means playing 3. Bg5 by white.",
        "6... O-O": "So I castle",
        "7. O-O": "So does he.",
        "7... d6": "My plan is to exchange off my Bb4 and put my pawns on black squares. Not a bad plan, but it is better to play BxNc3 immediately, rather than give white a chance to avoid doubled pawns.",
        "8. Qc2": "Now I can't double his pawns.",
        "8... Nbd7": "I continue to develop.",
        "9. Rd1": "So does he.",
        "9... c5": "Now in the database, there are 3 moves, Qe7, Re8 and Bxc3. I think all these moves are better than what I played.",
        "10. Nb5": "Now I have problems, defending d6 and there is also risks to my Bb4.",
        "10... Qe7": "So I defend d6",
        "11. a3": "Now if I retreat my bishop to a5, he can take on c5. I take back with my d pawn (rather than lose my d pawn for nothing. His knight comes into d6. I defend or move my bishop on b7, then say Rb1 threatening b4 winning my bishop. Although I can save this bishop, with, say b5, I lose a pawn. I decide to offer the pawn immediately and play...",
        "11... a6": "Counter-attack!",
        "12. axb4": "He takes",
        "12... axb5": "I take",
        "13. Rxa8": "He takes",
        "13... Rxa8": "I take",
        "14. bxc5": "He takes",
        "14... Be4": "I hit his queen",
        "15. Qc3": "He moves",
        "15... bxc5": "I take back",
        "16. dxc5": "He takes",
        "16... Nxc5": "I take back. Now I was expecting cxb5 and I am a pawn down. I had expected this position when I played my 11th move, and thought I may be able to hold the position as his extra pawn is doubled, but he played....",
        "17. Bf4": "Hitting d6, but my simple reply forces his bishop to move again",
        "17... e5": "and now he isn't getting the pawn!",
        "18. Bg5": "The best square for it.",
        "18... bxc4": "I take",
        "19. Qxc4": "He takes back",
        "19... d5": "I advance in the centre. I would say black has a small edge here.",
        "20. Qb5": "He has to move the queen of course.",
        "20... Ne6": "Centralising the knight, and hitting his bishop",
        "21. Bxf6": "He takes. Now which way would you re-capture?",
        "21... gxf6": "I thought this was best, re-enforcing the centre, and allowing my queen to move (otherwise it is rather tied to the defence of e5). What do you think dear reader?",
        "22. e3": "I'm not convinced this is best, although I am not sure what is better.",
        "22... Qa7": "Preparing to take over the open files on the queen side",
        "23. Nh4": "Perhaps trying to take advantage of my weakened king position.",
        "23... Rb8": "So I hit his queen",
        "24. Qe2": "He retreats",
        "24... Qa2": "I hit b2. Of course, I could see that he was going to take my bishop, but I thought \"so what, my doubled pawns control a lot of central squares, his king side is weaker after this exchange.\"",
        "25. Bxe4": "So he takes",
        "25... dxe4": "I take back",
        "26. Rd2": "He protects b2",
        "26... Ng5": "Protecting e5 and watching f3 and h3",
        "27. Kg2": "He prevents knight checks on f3 and h3",
        "27... Qe6": "and now my queen sweeps back to probe his weakened king side. He admitted later that he didn't see this move.",
        "28. Kg1": "So he goes back",
        "28... Qh3": "My queen comes in",
        "29. f4": "He needs to give his king side position some air - also allowing his pieces to defend along the second rank.",
        "29... exf3 e.p.": "I take",
        "30. Nxf3": "He takes back",
        "30... Ne4": "Rather than exchange my active knight, I hit his rook.",
        "31. Rc2": "Rook moves.",
        "31... Ra8": "I threaten to check on a1",
        "32. Rc1": "He defends",
        "32... Ra2": "Rook hits b2 again",
        "33. Qc2": "hitting Ne4 and also threatening a check on c8",
        "33... Nxg3": "I thought this led to 3 pawns for the knight - 34. hxg3 Qxg3+ 35. Qg2 Qxg2+ 36. Kxg2 Rxb2 is what I expected.\r\n",
        "34. Qc8+": "But he has this check",
        "34... Qxc8": "I take",
        "35. Rxc8+": "He tasks back, critically with check.",
        "35... Kg7": "Forced",
        "36. hxg3": "He takes",
        "36... Rxb2": "I take back",
        "37. Nh4": "Knight up",
        "37... h6": "I was frightened by moves like Nf5+, g4 and Rg8mate. Of course, I have moves in between, and my king can just walk up the board, but down to the last 10 minutes, I was starting to have pessimistic delusions.",
        "38. Nf5+": "So he checked. As I had less than 10 minutes left, I stopped recording now. I think the position is lost, but I didn't defend very well. He played g4 and I played Rb4 going after the pawn, and that let his king off the back rank, and he marched his king up and won very easily from here. Many thanks for reading, please leave a comment or two and rate the annotation on the star system."
    },
    "url": "https://gameknot.com/annotation.pl/kidderminster-club-championship?gm=44481",
    "gameName": "Kidderminster Club Championship",
    "players": "Maurice Bissell (ECF155) vs. Charles Higgie (ECF156)",
    "opening": "Queen's pawn (A46), Torre attack"
}