{
    "moves": {
        "1. e4": "Kings Gambit game. Opening that has always fascinated me. Hope you find the game of some interest.   Please feel free to comment.",
        "1... e5 2. f4 exf4": "accepted. (more fun that way)",
        "3. Nf3 d5": "Modern defense",
        "4. exd5 Nf6 5. Bb5+": "Prob most stern test in this line.",
        "5... c6": "best move as 5... K(b)d7  6. c4, a6. 7. Bxd7+, Bxd7. 8. 0-0   Leave white with an advantage. ",
        "6. dxc6 bxc6": "This move is quite commonly played although Kc6 seems stronger.",
        "7. Bc4": "Be2 is an alternative which allows white to advance central pawns.",
        "7... Nd5": "Alternative is Bd6 which white should prob reply with Qe2+.",
        "8. O-O": "Maybe Nc3 is better? This would stop black developing Bishop to d6 and make f pawn even weaker.",
        "8... Bd6": "Against Be6 white should play Bb3 with the idea c4 & d4",
        "9. Nc3 Be6": "If black castles white can attack d5",
        "10. Ne4 Be7": "Obviously black wanted to keep bishop but this move means he can only defend f4 using extreme measures",
        "11. Bb3": "Making room for d4 & c4",
        "11... O-O 12. d4 Nd7 13. Qe2": "White is looking like winning a pawn by c4",
        "13... g5": "?  13....Re8, 14. c4, Bf8! 15. cxNd5, Bxd5. 16.N(f)d2, f5. 17. Rxf4, fe. 18. Rxe4, Nf4 gives black compensation but white still has the better of it and would have been far more fun :)",
        "14. c4 Nd5b6 15. h4": "! White starts to open up Kingside",
        "15... h6": "15...g4 16. K(f)g5",
        "16. hxg5 hxg5 17. Nfxg5": "White wins 2 pawns in exchange for knight. White also permanently damages blacks pawn defense and is able to get more pieces into the Kingside to attack. ",
        "17... Bxg5 18. Bxf4 Bf6": "exchanging both would leave black totally exposed.",
        "19. Rad1": "protecting pawn and getting him into the action",
        "19... Bf5 20. Be5": "White is happy to exchange all minor pieces as it will allow the big guns into do a number on blacks King",
        "20... Bxe4 21. Qxe4 Bxe5 22. dxe5 Qg5 23. Rf5 Qg7 24. Qf4": "Spells end for black. ",
        "24... Rfe8 25. Rg5 Nxe5 26. Rxg7+ Kxg7 27. Rd6 Ng6 28. Qf6+ Kg8 29. Bc2 Nxc4 30. Rd7": "Black resigns. "
    },
    "url": "https://gameknot.com/annotation.pl/kings-gambit-g29?gm=27003",
    "gameName": "Kings Gambit (G29)",
    "players": "???  vs. ??? ",
    "opening": "KGA (C36), Abbazia defence, Botvinnik variation"
}