{
    "moves": {
        "1. e4 c5 2. Nf3 d6 3. Bc4": "Wishing to avoid the Nadjorf or dragon,  I intend to play a closed Sicilian and first get the bad bishop outside the pawn chain, before playing d3.",
        "3... e6 4. d3 Nf6 5. O-O Be7 6. Bb3 O-O 7. c3 Nc6 8. Re1 b5": "Black rapidly occupies the Queenside. ",
        "9. Nbd2": "My default plan, maneuver the knight to the kingside via d2, f1 and then either e3 or g3.",
        "9... Bb7": "9...d5 10.e5 is often played here.",
        "10. Nf1 Qc7 11. Ng3": "With no contact between the sides, both sides seem on autopilot.",
        "11... a5 12. a4": "Standard move in these type of positions, keeps Black from dominating the Queenside.",
        "12... b4 13. h3": "preparing to maneuver the f3 knight.",
        "13... Rad8 14. Bf4": "I was trying to provoke ...e5 from Black which would transpose to the modern Italian.  A position which could also be reached with the d3 Spanish.  The move also prevents...d5. ",
        "14... Qb6": "Black is not interested in transposing, and moves the Queen off of the diagonal.  Black is probably planning an eventual ...d5. ",
        "15. Bc2": "The bishop is biting on granite on the a2-g8 diagonal and moves to support the White center. ",
        "15... Nd7 16. Be3": "making the queen uncomfortable and preparing for d4.",
        "16... Qc7 17. d4": "White makes his move in the center and starts to clear a path for the c2-Bishop.  ",
        "17... h6": "This weakens the kingside,  I wonder if Black had thoughts of kingside action, or perhaps he is trying to provoke action from White.",
        "18. Nh2": "It had been part of my plan to maneuver this knight to g4, and now I have a target on h6.",
        "18... Kh7": "I not sure what Black is thinking.  Possibly he wants to play ....Rg8 and g5.  He also could be trying to provoke e5.  If White ever loses the initiative after playing e5, Black is ready to detonate the center which would be overextended and has three stress points.   ",
        "19. e5+": "I can't resist the discovered check, but I know I have to proceed resolutely from now on, as Black is ready to destroy the White center and his pieces are poised for a counter attack once he breaks through the center.",
        "19... g6": "This is just plain bad, Black's best move was 19...Kh8.",
        "20. Qh5": "I don't know if Black didn't see this or underestimated it.  It is possible he played for it and hoped to trap the queen.",
        "20... Rfh8": "This move loses, although it may be part of Black's strategy to lure the White Queen to its destruction.",
        "21. Ng4": "The immediate 21.Bxg6! would have worked.  This move (Ng4) cuts off any retreat for the White Queen and allows Black to offer more resistance.",
        "21... Kg8": "This  loses, but was probably part of Black plan to trap the White Queen.  21...Bf8 would have offered more resistance for instance:  22.Nxh6 Bxh6 23.exd6 Qxd6 24.Qxh6 Kg8 25.dxc5 Qe5 +-",
        "22. Bxg6": "Its all over now.",
        "22... Rf8 23. Nxh6+ Kg7 24. Bxf7 Ncxe5": "Desperation, but White has a forced mate.",
        "25. Ngf5+ exf5 26. Nxf5+ Kf6 27. Bg5+ Kxf5 28. g4+ Nxg4 29. hxg4#": ""
    },
    "url": "https://gameknot.com/annotation.pl/king-hunt-internet?gm=45086",
    "gameName": " King Hunt, internet",
    "players": "blake78613 (1896) vs. SW (1746)",
    "opening": "Sicilian (B50)"
}