{
    "moves": {
        "1. e4 e5 2. f4 exf4": "Here we go...",
        "3. Nf3": "To stop 3...Qh4+, though White sometimes allows this with 2.Bc4.",
        "3... d6": "Fischer's defence. Prior to this, 3...g5 was the usual continuation, but Fischer, having lost to Spassky in the early 60s, decided that 3...d6 was the correct move. But he didn't really lose because 3...g5 was bad; he lost due to later errors. Nevertheless, this move \"busted\" the gambit, according to Fischer. And it does stop the White Knight's foray onto e5, so I play it.",
        "4. d4": "Now the pawn is under attack...",
        "4... g5": "So g5 is still needed.",
        "5. Bc4": "The trouble with amateurs like myself playing Fischer's defence is I don't really know what he had in mind. In depriving the Knight of the e5 square it makes sense to follow up here with 5...g4, when the Knight doesn't really have a good square: 6.Nd2? blocks the Bishop; 6.Ng1 is a little pointless. In the spirit of the opening White often plays 6.Bxf4 and leaves the Knight to the mercies of the pawn",
        "5... Bg7": "But I'm thinking of development instead, and so immediately go astray.",
        "6. h4": "White is allowed to attack my pawn chain...",
        "6... h6": "And I further weaken my K-side by defending it.",
        "7. Qd3": "I didn't expect this. A Queen sortie so early? I expected something like 7.Nc3",
        "7... Nc6": "Since my K-side pawns are loosened I decide my best plan is to castle Q-side, something else that usually lands me in trouble.",
        "8. d5": "I was pretty sure this was wrong, creating a nice hole on e5 and forcing White to give up his K-side defender.",
        "8... Ne5": "Into the hole I go.",
        "9. Nxe5 Bxe5 10. hxg5": "Another move I was confident wasn't good, White presumably expecting 10...hxg5 11.Rxh8 Bxh8 and my position is rather in pieces.",
        "10... Qxg5": "But recapturing with the Queen is far stronger; White's King is still in the open and his lone K-side pawn is under attack. White needs to bring his Queen back to defend it. And 101.Qf1 suits me fine.",
        "11. O-O": "Instead, he castles into my oncoming attack, and surely for once I'm going to bust the King's gambit in the way it deserves?",
        "11... Bg4": "Silly. 11...Nf6 followed by 12...Rg1 puts White under even more pressure. I played this with the idea of supporting a pawn advance to f3, not noticing until too late that the pawn is pinned. I need to get my Queen out of the line of fire before it can advance.",
        "12. Nc3": "With the idea of going to b5, I expect. But White doesn't really have the luxury, I felt, of a Q-side attack, and the Knight would be better off heading towards f3 via d2.",
        "12... Nf6": "I often find I'm making the right move but a move later than I should. But better late than never.",
        "13. Rf2": "13...Nb5 is probably better, having brought out the Knight to c3. But White is getting belatedly prudent and defends his lone K-side pawn. Now I can play 13...a6 to stop Nb5, or continue the attack with 13...Nh5, which really poses questions to White.",
        "13... O-O-O": "But I'm getting prudent as well. Castling Q-side was always my intention.",
        "14. a4": "White immediately starts a pawn advance now he knows where my King is going to be.",
        "14... h5": "I decide on a pawn advance of my own, taking up the square my Knight ought to have occupied; 14...Nh5 followed by 15...Qh4! What can White do but simply advance his h-pawn?",
        "15. a5 h4": "We both continue our pawn advances, and now the h5 square is free again for my Knight.",
        "16. a6 b6": "At this point I was so confident that my attack would pay off I didn't give much thought to the hole created on c6 ready for the Knight. It could attack my Q-side position if need be, but my attack was still better.",
        "17. Nb5 Kb8 18. c3": "This seemed like a gift, played to block off the line of my Bishop's attack, but really just giving me a tempo.",
        "18... h3": "Which I gratefully accept!",
        "19. Nd4": "I'd expected 19.g3 here, and that is probably White's best? But he's in attacking mode, and only now do I spot that hole on c6.",
        "19... h2+": "Very very silly, missing the chance to remove that lone pawn and allowing the King to escape into the corner to avoid mate. I was preoccupied by the threat of 20.Nc6+ but after 19...hxg2 White doesn't have time for 20.Nc6+ and taking the Rook because of 20...Ka8 21.Nxd8? Rh1 followed by mate. But I am not good at spotting mates, it seems, as will be seen.",
        "20. Kh1 Qh4": "Keeps the attack going, but prudence demanded 20...Bd7 to cover those white squares. Or, if I wish to stay in attacking mode, 20...Nh5. This concedes a little breathing space to White, but should not be critical; I still have an overwhelming attack.",
        "21. Nc6+": "Here comes the fork.",
        "21... Kc8": "Sillier still, handing White the a-pawn and opening the file for a very advanced pawn. I wasn't paying attention to my defense, thinking I could afford to lose an exchange with that attack.",
        "22. Nxa7+": "Painful. White even has the luxury of nicking my f-pawn with 22.Bxf4 and if 22...Qxf2 23.Rf1. But this gives him another luxury, that of a more obstructive pawn and the chance of a second bit at the fork...",
        "22... Kd7": "Which I don't allow. But it's crucial I get my King to a8; even 22...Kb8 23.Nc6 Ka8 24.Nxd8 is better than what follows.",
        "23. Bb5+": "White gets to drive my king even further away from a8. The tide is slowly turning.",
        "23... Ke7 24. Nc6+": "White even gets his fork as well. That hole on c6 has proved costly.",
        "24... Kf8 25. Nxd8": "Even so, better is 25.Bxf4 Qxf2 26.Rf1 first. This gives me a second chance...",
        "25... Qxf2 26. Bxf4 Bxf4": "Passed a-pawn or not, my attack is back in action.",
        "27. a7": "27.Rf1 was more pressing, but White sees the chance to Queen. \n\nOr what if 27....Bd1 28.Rxd1 Ng4 29.Ne6+ Ke7 30.Qf3 Be3 31.Qf6+ Qxf6 32.Rf1 Qxf1+ 33.Bxf1 Nf2# Does it work?",
        "27... Nh5": "The wrong time to do this: 27...Be3 and White cannot Queen because 28.a8=Q Qg1+ and mate next move; White would have to give up his Queen instead. But I thought 28...Ng3 would be so strong if only the Queen weren't there I thought I could allow a8 and still win. Maybe I can?",
        "28. a8=Q Ng3+": "White must give up his Queen, but it doesn't matter since he has another. And there was no reason for this; just getting the King out of the way on g7 would have held the advantage.\n\n\n ",
        "29. Qxg3 Bxg3 30. Nxf7+": "30.Ne6+ is even stronger, but it's over now wanyway.",
        "30... Kxf7 31. Qxh8 Bf3 32. Be8+ Ke7": "Remarkably, at this point I still had hopes, thinking White had to play 33.Qh3 to stop the mate and threaten 34.Qe6+and that 33...Bxg2 forcing an exchange gave me hope. But there isn't any...",
        "33. Qg7+ Kxe8 34. Ra8#": ""
    },
    "url": "https://gameknot.com/annotation.pl/kings-gambit-accepted?gm=68202",
    "gameName": "King's gambit (Accepted)",
    "players": "shadetree (1942) vs. captain_shannon (1723)",
    "opening": "KGA (C34), Fischer defence"
}