{
    "moves": {
        "1. e4 e5 2. f4 exf4 3. Nf3": "I'm not brave enough for 3.Bc4...",
        "3... g5": "Black goes for the more usual support for the pawn.",
        "4. Bc4": "With the e5 square free I begin the attack on f7.",
        "4... d6": "We seem to have transposed into Fischer's line after all.",
        "5. d4": "Since the f-pawn is defended this probably is not good, and it would have been better to hit the g-pawn with 5.h4.",
        "5... g4": "I had played 5...Bg7 to develop a piece in my game against the gambit, but this, immediately giving White some awkward choices to make, is probably better.",
        "6. Bxf4": "Leaving my Knight to the mercy of the pawn, as I commented in my previous annotation.",
        "6... gxf3": "A Knight Black swiftly gobbles up.",
        "7. Qxf3": "Once I have castled, there is going to be an awful ot of pressure on f7. Which is the whole idea of the gambit, I guess.",
        "7... Nf6": "It's easy for Black to go wrong against the King's gambit, as I have found many a time, and Black goes astray here. With the f3 Knight out of the way the route is clear for 7...Qh5+ 8.g3 Qg4 and White really doesn't want to exchange Queens so has to beat a bit of a retreat.",
        "8. O-O": "Actually, 8.Bg5, pinning the Knight first and castling on the next move is even better.",
        "8... h6": "Black sees the threat of the pin and guards against it, but he's way behind in development, and 8...Bg7 would at least get a piece out. Or 8...Be6, even though it does allow White to bust open the K-side with 9.Bxe6 fxe6.",
        "9. e5": "I've been almost handed an extra move to attack the Knight, and if it moves f7 is there for the taking.",
        "9... c6": "Cutting off the diagonal to b7, but that's not where the threat is; I would have thought 9...dxe5 essential.",
        "10. exf6 Qxf6": "Now I have won back the sacrificed material and am way ahead.",
        "11. Re1+": "11.d5 seemed counter-intuitive when the open file to the King cried out for a check. But this does rather deviate from the plan of hitting f7 and the Rook was nicely lined up against the Queen, so this is likely not best.",
        "11... Kd8": "11...Be6 gets a piece out, but instead Black sidesteps the King. ",
        "12. Qe4": "I have plenty of time to bring out the Knight to d2, but thought I'd tempt Black to play the fork 12...d5, which loses to 13.Qe8#. But 12...Bf4 followed by 13...Nd7 and Black's problems have eased a little.",
        "12... Qe7": "Instead, Black tries to take the sting out of my attack by exchanging Queens. Moving out of the way allows 13...Qxe1# and I'm hoist on my own petard, so to speak. But I can develop the Knight to recapture following 13...Qxe4",
        "13. d5": "Instead I decide to recapture with the Rook, with the option of isolating Black's d-pawn at some point after. Really, with good play, Black's game might be salvagible now. I haven't followed up my good position well at all.",
        "13... Qxe4 14. Rxe4 Bf5": "Natural follow-up move.",
        "15. Re2": "Necessary to defend the c-pawn.",
        "15... Bg7": "Some nasty looking attacks along long diagonals, fortunately not aimed at my K-side. 16.Nc3 blunts the dark-squared Bishop's line of fire, but again I tempt my opponent into an error.",
        "16. dxc6": "Leaving the d-pawn isolated, as intended. Black can take the pawn with the Knight, getting out his last minor piece, or play 16...Bd4+ first. I'd still be on top, but Black has some play. He can't play 16...Bxb2 because of 17.cxb7",
        "16... Bxb2": "But he does.",
        "17. cxb7": "He sees the problem too late and resigns. Nice to get a win with the King's gambit, but my opponent let me in for the win, and I didn't follow my initial attack up that well really."
    },
    "url": "https://gameknot.com/annotation.pl/kings-gambit-accepted?gm=68211",
    "gameName": "King's gambit (Accepted)",
    "players": "captain_shannon (1706) vs. krla5 (1562)",
    "opening": "KGA (C37), King's knight's gambit"
}