{
    "moves": {
        "1. e4": "an old game that i enjoyed playing",
        "1... Nf6": "Alekhines defence",
        "2. e5 Nd5 3. d4 d6 4. Nf3 Bf5": "!? unusual, more normal is dxe5, the bishop doesn't belong on the diagonal.",
        "5. Bc4": "taking advantage of blacks unprotected knight, usual in Alekhines defence",
        "5... Nb6": "forcing the bishop to move again",
        "6. Bb3": "keeping hold of the diagonal, which pressures f7",
        "6... e6": "sencibly blocking the diagonal",
        "7. Nc3": "slight inaccuracy blocking the c pawn, i feel O-O is a better move",
        "7... d5": "taking advantage of my immobile c pawn and threatening c5 which would leave my e pawn weak. transposing to a kind of french defence, well sort of.",
        "8. Ne2": "planning to meet c5 with c3",
        "8... c5 9. c3 c4": "?! relieving the tension to early. prehaps motivated by the desire to trade off his 'bad' bishop but here it is developed outside the pawn chain so is not as bad as it normally is in a french type setup",
        "10. Bc2 Bxc2 11. Qxc2 Be7": "the central pawn structure suggests white should play for a kingside attack while black should look to pressure whites queenside, however white has much more space and blacks b6 knight has difficulty finding something useful to do",
        "12. Be3": "clearing the back rank",
        "12... Nc6 13. Ng3 O-O": "castling into an attack, white has a huge majority on the kingside which isn't likely to change soon and blacks king is fine in the centre anyway. black should probably castle queenside",
        "14. h4": "grabing the only squares on the kingside black has control over",
        "14... f6": "attempting to break free, but this doesn't quite work perfectly",
        "15. exf6 Bxf6 16. Ng5": "forcing the h file open for my rooks",
        "16... Bxg5": "forced as the e6 pawn hangs",
        "17. hxg5 g6": "although blacks dark squares are weak it is difficult for white to exploit it even with his dark square bishop on the board!",
        "18. O-O-O": "bringing in the last piece before trying to increase the presure on the kingside, its always better to attack with all you forces",
        "18... Nd7": "? wrong knight, i felt Nc6-e7-f5 would have given black quite a secure position",
        "19. Rh6": "preparing to double on the h file",
        "19... Rf7": "it appears black is trying to get his knight to f8 which makes his position appear quite secure. however he doesnt have enough time to play it",
        "20. Rxg6+": "?! not a strong sac but white will have a local majority as blacks a8 rook isn't going anywhere fast and so i will have chances against the black king. one slip and it'll be game over",
        "20... hxg6 21. Qxg6+ Rg7": "? much better is 21....Kf8 22.Rh1 Ke7 when the king escapes safely to the queenside, this would be a more stubborn test for whites dubious sacrifice",
        "22. Qxe6+": "gains a 3rd pawn for the rook",
        "22... Kf8": "the king now does come to f8 but its escape route is blocked by the white queen. white can also bring his other pieces into position with threat. compare to 21...Kf8 22.Qxe6? Qe8!",
        "23. Rh1": "threatening Rh8 ",
        "23... Ne7": "defending the threat and bring another piece to protect its king",
        "24. g6": "opening lines for the bishop, with the pawn back on g5 the bishop had no way towards the black king. and im going to need all my pieces if this attack has any chance of success",
        "24... Rxg6": "?? loses the rook. now white is clearly winning. Nxg6 is much less clear eg. 25.Bh6 Qe8 26. Bxg7  Kxg7 27.Nf5  Kf8 28.Rh8  Nxh8 29.Qh6 Ke7 30.Nd6  when white has a queen and 2 pawns for 2 knights and a rook",
        "25. Rh8+ Rg8": "?? loses the king. 25....Ng8 26.Qxg6 Nf6 and black is still breathing although whites positional and material dominance will easily secure the win. prehaps the black king wanted a quick death as opposed to a long drawn out one. ",
        "26. Bh6+": "1-0 the finish is 26....Ke8 27.Rxg8 Nf8 28.Rxf8#"
    },
    "url": "https://gameknot.com/annotation.pl/kingstuart?gm=3122",
    "gameName": "kingstuart",
    "players": " (1500) vs. Dutch12 (1600)",
    "opening": "Alekhine's defence (B04), modern variation"
}