{
    "moves": {
        "1. d4 Nf6 2. c4 g6 3. Nc3 Bg7 4. e4 d6 5. Nf3": "Starting position of thematic mini tournament. \nKing's Indian (E90), 5.Nf3",
        "5... O-O 6. Be2 c5 7. O-O cxd4 8. Nxd4 Nc6 9. Be3 Bd7 10. Qd2 Rc8": "Nxd4 is more common here.  Allowing white's knight to remain in the center of the board hinders black's play.",
        "11. f3 Ne5 12. b3 Nc6": "Notable that black has now moved that knight 3 times and it is on the same square as it was first moved too.",
        "13. a3": "Beginning to move my queenside pawns",
        "13... a6 14. Bh6": "?? offering an exchange of bishops",
        "14... e5 15. Nxc6": "Retreating with my knight may have been a better play, but i tend to exchange rather than retreat.",
        "15... Rxc6 16. Bg5": "Pins the black knight",
        "16... Be6 17. Nd5": "attacking the pinned piece, and putting my knight on a square where he disrupts black's ability to move his other pieces.",
        "17... Bxd5": "Exchanging the bishop for the knight.  Leaves white with the bishop pair but removes the powerful knight.",
        "18. cxd5": "Instead of exd5 because it leads to a more open position which favors the bishop pair.Also completely blocks in black's bishop as the e pawn can not advance.",
        "18... Rc8 19. Rfc1 Rxc1+ 20. Rxc1 Qb6+ 21. Qe3 Qxe3+": "Queen exchange may not be the best idea given the position of black's minor pieces.",
        "22. Bxe3": "I now have my bishops in perfect position to support my pawns and my rook on the only open file.  Black's knight only has 3 safe squares to move to and black's bishop has one",
        "22... Rb8 23. Bb6": "wasted bishop move.",
        "23... Nd7 24. Be3 Bf8 25. b4 Be7": "This is a poor move, although black doesn't really have any great options.  Loses 2 pawns and slows black down dramatically by allowing the knight to be pinned to the bishop.",
        "26. Rc7 Rd8 27. Rxb7 Kf8 28. Bxa6 Nb8 29. Bd3 Rc8 30. Bd2": "my bishop pair is able to keep black off the open file, and all together my pieces guard 7 of the 8 spaces on the open file.",
        "30... Bd8 31. a4 Ke8 32. a5 Bc7 33. a6 Nxa6 34. Bxa6 Kd8 35. Bb5 Rb8 36. Rxb8+ Bxb8 37. Be3 f5 38. Bb6+ Ke7": "exhanging bishops may have been better here as black's bishop is now completely trapped and cannot be reached by his king.",
        "39. Kf2 f4 40. h3 g5 41. Ke2 h5 42. Kd2 Kf6 43. Kc3 g4 44. h4": "after g3 or gxf3, gxf3 black's only mobile piece will be his king.  Here black resigned. "
    },
    "url": "https://gameknot.com/annotation.pl/kings-indian-main-line?gm=23768",
    "gameName": "Kings indian main line",
    "players": "acrewboy02 (1481) vs. afef1017 (1588)",
    "opening": "King's Indian (E91), 6.Be2"
}