{
    "moves": {
        "1. c4 Nf6 2. Nc3 g6 3. e4 Bg7 4. d4 d6 5. Nf3 O-O 6. Be2 e5 7. O-O Nc6 8. d5 Ne7": "based position for the tournament.",
        "9. b4": "my first choice, as it is the most efficient way to show that white intends to attack.",
        "9... Nh5 10. Re1 Nf4 11. Bxf4": "i consider this move as a positive move, as black knight has already moved three times and was much more aggressive than my bishop.",
        "11... exf4 12. Rc1 a5 13. b5": "white has definitely more space and the only weakness (e4) is not in real danger",
        "13... b6 14. Qd2": "attacking the pawn; let's eat what's on the menu",
        "14... f5": "opening the game, but the computer considers it as an inaccuracy",
        "15. Qxf4 fxe4 16. Qxe4": "black is now with the advantage of an open column. But white has lost his weakness and is a pawn ahead.",
        "16... Nf5 17. Bd3": "this move was supposed to give some air to the queen.",
        "17... Bd7 18. Qe2": "the computer does not say anything, here, but considers white loses its 0,50 advantage.",
        "18... Qf6": "not quite sure this attack is valuable. the computer sees it as an inaccuracy again.",
        "19. Ne4 Qb2": "proposing the exchange, i guess.",
        "20. Rc2": "the queen is confined, now...",
        "20... Qa3 21. Rb1 Rae8 22. Rb3": "though I saw this move as the completing one to enclose the queen, the computer does not give me a real advantage.",
        "22... Qa4 23. g4": "Mistake! the computer sees it well, but not wwgia. He could have played Ng3, followed by 24. hxg3, then Bxg4 recuperates the piece and win 2 pawns.",
        "23... Nd4 24. Nxd4 Bxd4 25. Qd1": "mistake, according to the computer, but i am not convinced by his reasoning.",
        "25... Rf4 26. h3 Ref8": "the best according to the computer was here to take the knight and the bishop for a rook.",
        "27. Kg2 h5 28. gxh5 g5": "probably the computer proposed the best solution as playing Bf5, threatening many things.",
        "29. h6": "the computer consider this as a mistake. Once again, its line is not convincing and he avoids my next move h7+ which i considered since the beginning of my attack, here. This may be the best shot of this game, if I can say that.",
        "29... g4 30. h7+": "I think this is decisive. I don't think king can take, as it exposes itself to a check \"à la découverte\", with a direct threat on the d7 bishop.",
        "30... Kh8 31. h4": "i think this was the right move to play: avoiding more threat on the g column by refusing the g4 offer...",
        "31... Rf4f3": "threatening Rh3, I guess.",
        "32. Qc1": "considering Qg5 or Qh6.",
        "32... Rf8f4": "the computer proposes instead Bf5. It would eliminate a good defensor, but is it the thing to do?",
        "33. h5": "the pawn is now safe...",
        "33... Rh3": "this is of course a tragic mistake, but i am not sure Bf5 -again- can save the day.",
        "34. Qxf4": ""
    },
    "url": "https://gameknot.com/annotation.pl/kings-indian-mainline?gm=39074",
    "gameName": "Kings Indian Mainline",
    "players": "thitho (1745) vs. wwgia (1612)",
    "opening": "English opening (A16)"
}