{
    "moves": {
        "1. e4 e5 2. f4": "This is a great game with immediate aggression from White, that once started could not be stopped. Only continued forced Check moves kept me alive.\nThere were many places where the wrong aggressive play would have backfire into a Checkmate against me. \n\nI thought I would try to understand the King gambit by playing it\n",
        "2... Nc6": "declined...OK, I'll just play it as if it was taken",
        "3. Nf3": "which is this move",
        "3... d6 4. Bc4": "maybe I'll sacrifice my bishop to eliminate his castle option",
        "4... Bg4": "but then what...",
        "5. c3": "This will constrict my bishop, but my queen can keep pressure on",
        "5... Nf6": "this doesn't change my plan",
        "6. Bxf7+": "I went for it",
        "6... Kxf7": "forced",
        "7. Qb3+": "as planned...",
        "7... d5": "simple block",
        "8. Ng5+": "Why not...",
        "8... Kg6": "Whoa...I expected a retreat.\nI took a couple of days to calculate the next move.\n\nAdvancing the f pawn for check was enticing, hoping he would go to h5 for a triple fork.\nEven taking my knight COULD work out...\n\nThat move would have been risky---I found several ways for this to backfire into a checkmate for myself.\nBishop taking that pawn was would have been the best counter to that move, but other responses were shaky for me as well.",
        "9. d3": "so, I'll just protect what I have so far...\nand having this bishop diagonal open is crucial in the long run",
        "9... h6": "OK, the knight has to move",
        "10. f5+": "now his King can't take the knight",
        "10... Bxf5": "but there's that bishop",
        "11. exf5+": "I had to take it. It isolates the pawn, but I can't castle with that bishop there and I won't do well against 2 bishops with this pawn structure",
        "11... Kxf5": "hmmm, if he had left that hanging pawn there, he probably would have taken it eventually...",
        "12. Nf7": "Now the fork is available\nI was worried that I was taking out a rook that might not threaten anytime soon.\nWould have been better off getting my pieces out?\n\nIF I can continue play, this play will be worth it",
        "12... Qd7": "Queen to a WHITE SQUARE would have guaranteed taking back that knight  ",
        "13. Nxh8": "I might actually be able to keep this knight\nIf so, I'll consider his a dead man walking and see if he can Kamikaze something else in the center",
        "13... Rb8": "preventing an easy pawn grab by my Queen (though I wasn't looking at doing that anytime soon)",
        "14. O-O+": "King is more protect and Check again--keeping the pressure on",
        "14... Ke6": "the only free and protected square",
        "15. Ng6": "If he moves the bishop, I have some plans",
        "15... Qe8": "Is he going for the Knight or does he want on the g/h files?\nI expected the Bishop to Check me. While I had plenty of blocks and counters planned, the Check would have kept it alive and would have been vital to a win.",
        "16. Nxf8+": "Boom! my Knight just grabbed a rook and the second most dangerous piece for me in this position (Black squared Bishop)",
        "16... Qxf8": "priceless\n(I did not realize the the added value of this Queen pin at the time)",
        "17. d4": "If he takes, I take it back thus locking 2 opposing pawns on the d file (which  I wanted to keep closed)\n",
        "17... e4": "declined.\n",
        "18. c4": "If he takes, I just take it with the Queen and Check\n",
        "18... Kd7": "He sees that.\nI was ready for him to try to bump out my queen with Knight to a5 (then pawn takes pawn--Check; King takes pawn, then Queen to b5--Check, then regardless I take his Knight on a5)",
        "19. cxd5": "Again, Knight retreat to a5 turns into a Check and me taking the Knight (several ways).\n",
        "19... Nxd4": "The f Knight is pinned, so it couldn't take.\nA full Knight retreat would have been better",
        "20. Qa4+": "Check and I'm taking that knight",
        "20... Nc6": "I'm still taking that knight",
        "21. dxc6+": "Check",
        "21... bxc6 22. Qxa7": "easy pawn AND I can secure this diagonal (from pawn advance on e3 or Queen Check on c5) \nIt doesn't force him to move the Rook, but it locks his Queen on the 8th rank for now",
        "22... Qd8": "I think this is the last gasp...Knight to g4 and Queen eventually to h2?",
        "23. Qd4+": "I just need to get back to center",
        "23... Nd5": "not many options. I was ready to trade queens and he needs that Queen to have any last chance",
        "24. Qxe4": "it allows an easy pawn take and final clearing of the center",
        "24... Nf6 25. Qd3+": "I still want to trade queens",
        "25... Ke8 26. Qxd8+": "Done. Resigned\n\nThis was a fun game that started with an aggressive attack that was initially well managed. It was feed-forward... I had no choice but to continue the forced attack or otherwise have things backfire into a Checkmate for myself.\nThanks."
    },
    "url": "https://gameknot.com/annotation.pl/kings-gambit-declined-attack?gm=48442",
    "gameName": "Kings Gambit Declined attack",
    "players": "scottbphillips (1200) vs.  (1350)",
    "opening": "King's gambit (C30)"
}