{
    "moves": {
        "1. e4": "This was a training match against c1pe and is being annotated for general audiences as a way to learn/improve.  c1pe had never played against King's Gambit before, so I thought I'd give him a run through the game.  I promised him it would be lots of early, furious attacking.  I believe he said something akin to , \"Bring it.\"  :)",
        "1... e5 2. f4 exf4": "All standard book fare so far.",
        "3. Nf3 Nf6": "A decent progression, but off of book.  Good intuitive play early for someone new to chess.",
        "4. e5": "a little aggravation to see how he handled the press.",
        "4... Ne4": "According to book play, Nh5 is the best continuation move, but now he allows for some counterplay.",
        "5. d4": "It would have been better to play d3 here to force his knight away and give me a tempo move.",
        "5... Nc6 6. Bd3": "now forcing a retreat, as any pawn coming forward can be captured via en passant.",
        "6... Ng5 7. Nxg5": "Forcing him to bring his queen into play.",
        "7... Qxg5 8. O-O": "Now I have king protection and leverage against the pawn, to allow me to equalize play soon.",
        "8... Nxd4": "Taking advantage of no defenders.  For a new player, c1pe shows great promise with natural attacking patterns.",
        "9. Rxf4": "Better than Bxf4, as I now threaten his knight and a discovered attack on his queen.",
        "9... Bc5": "I think moving his queen may have been better, but Bc5 is a good move to threaten discovered check on my king, always a good play.",
        "10. Kh1": "Moving my king to safety.",
        "10... b6": "This move was a blunder.  Far better to move his queen to safety, perhaps e7 or d8.  Now \nI get to take his knight.",
        "11. Rxd4": "going up a piece, effectively.",
        "11... Qxe5": "This move is the type you might make in a speed chess game or perhaps when you are rushing moves.  For all beginners, working through chess games, if there is an open rook file, never ever ever put your queen in front of your king, because the opponent will get you every time.",
        "12. Re4 Bd6": "Although not a bad response, this move allows me to do some more bad things.  When you are forced to make an exchange, make sure that the exchange is as much on your terms as you can allow it.  Because of 10. ... b6, the next move is possible.",
        "13. Bf4": "Some people might look at this move and call it a mistake, but I think it's good play under the circumstances.  We'll explore the possible options in a moment.",
        "13... Qxe4 14. Bxe4": "Now black is left with some ugly choices.  Save a rook and trade bishops, or trade a rook for a bishop.  In retrospect, I think black made the right choice.  If 14. ... Rb8, 15. Bxd6.  If black retakes 15. ... cxd6, then 16. Qxc6 leaves black in an ugly ugly place.",
        "14... Bxf4 15. Bxa8 O-O 16. Nc3": "An important point in all development is to ensure your rooks can get into the game.  I needed to get that knight out to free up the rook.",
        "16... Re8 17. Bf3": "Wanted to get my bishop back into play.",
        "17... Ba6": "The thought process of getting your bishop into the game is sound, but not at the expense of going down more material.  Much better to play Be5 and start some pawn pushing on the queenside.",
        "18. Qxd7 Rf8 19. Nd5": "I have eyes on his king, wanting to see if I can make something happen, based upon black's responses.  This move also threatened his bishop.  An important point for all players.  Once someone is ahead, the presumption of many early players is that it's to your advantage to trade, as the fewer pieces your opponent has, the harder it is to mount a comeback.  However, the fewer pieces you have, the harder it is to checkmate.  If you have an overwhelming material advantage, yes, trade away on even terms.  If you're only up by a knight, if you trade even the rest of the game, it's a draw, as a king + knight can't checkmate squat.",
        "19... Bg5 20. Qg4 f6": "This move was a big mistake.  I have two pieces that can threaten on white squares.  If you must defend a bishop like this, use the h pawn instead.  Far safer.  ",
        "21. Qe6+": "Now that Black's bishop is tied up and unable to come to the rescue, I wanted to see if I could induce a bad move.  If Black makes the right move, I'll just use my knight to scarf c7 and threaten some new mate action.",
        "21... Rf7": "Better to go to the corner.  For new players, an important point is that playing fast doesn't do you any good.  Although it is highly unlikely Black will come back in this game, it's important to work through the moves.  Kh8 is the only move you can make here that doesn't give up a mate.",
        "22. Qe8+ Rf8 23. Ne7+ Kh8 24. Qxf8#": "All in all an interesting game with a great start, but an early blunder cost him the game.  If you find yourself mistake prone, then odds are if you just slow down and analyze a little better, you'll make better moves.  I think that with a little patience and some games under his belt, c1pe will be a 1500 player in no time."
    },
    "url": "https://gameknot.com/annotation.pl/kings-gambit-accepted-training-game?gm=56462",
    "gameName": "King's Gambit Accepted Training Game",
    "players": "evilgm (1660) vs. c1pe (1200)",
    "opening": "KGA (C34), Schallop defence"
}