{
    "moves": {
        "1. e4": "This is one game of a team match (the other may be found here: http://gameknot.com/annotation.pl/complications?gm=45162 ). I find myself on the receiving end of a King's Gambit, an opening I'm quite fond of with the White pieces despite its instabilities and apparent \"refutations\". My opponent quickly gambits two additional pawns in a manner I've never seen, resulting in my pawns being very overextended but White hard-pressed to actually win them and complete his development. I eventually manage to turn my spatial advantage into a developmental one, and engineer a strong push down the center of the board. Enjoy!",
        "1... e5 2. f4": "The King's Gambit, one of the game's oldest documented openings. No longer very popular at high levels, it nonetheless retains some stalwart Master and Grandmaster supporters. White offers the f-pawn in exchange for a strong center and developmental lead.",
        "2... exf4": "Black accepts the gambit. This is probably the most common response, though many ways of declining it, or offering countergambits, exist, such as 2...Bc5 and 2...d5.",
        "3. Bc4": "White continues with the Bishop's Gambit, a particularly aggressive line. Slightly more common is 3.Nf3, preventing ...Qh4+, but 4.Kf1 and 5.Nf3, driving the Queen away, is considered fine for White, and his developmental advantage will continue to grow.",
        "3... Nc6": "3...Nf6 is much more common. Instead, Black chooses a waiting move--the Maurian Defense. The Knight may become a target for White's d-pawn, but White may risk overextending.",
        "4. Nf3": "The standard continuation is 4.d4, but this is perfectly playable (transposing into more of a King's Knight's Gambit). White prepares to castle and d2-d4 is still an option.",
        "4... g5": "Black reinforces f5 and prevents White from castling immediately: 5.O-O g4! 6.Ne1 and White's position is looking ugly. Of course, White can play 6.d4 gxf3 7.Nc3 fxg2 8.Bxf7+, with an attack similar to the Muzio Gambit.",
        "5. d4": "White establishes a strong center and threatens to move on the Black Knight.",
        "5... Bg7": "Black develops the Bishop to a natural location, leaving e7 open in case he decides to get his Knight over to g6.",
        "6. Nc3": "White continues development and defends his e-pawn, as e7 could soon host a Black Queen.",
        "6... d6": "This move gives a position something like the Fischer Defense, freeing the Black LSB and preventing a White Knight from landing at e5.",
        "7. e5": "?! White wants to press the attack while leaving the a2-g8 diagonal open for his Bishop. This seems premature to me though; he could afford to castle first and get a Rook onto the e-file, making this thrust much more potent.",
        "7... dxe5": "Black invites the trade, since he's already ahead a pawn and if he can remove some of White's pieces from the board, his advanced kingside pawns may be difficult to hold back.",
        "8. Ne2": "??! Apparently White was only bluffing about the trade he offered on e5--now he wastes a move getting his Knight out of harm's way instead of simply retaking. This additional two-pawn gambit does nothing, as far as I can see, to weaken Black's position besides potentially overextending his center, and certainly does not improve White's development. 8.Qe2 might have been a stronger way to decline retaking the pawn right away.",
        "8... exd4": "Black's center pawns are seriously overextended, but thanks to his Nc6 and powerful DSB, they're adequately defended for now and the positional advantage White strives for in the King's Gambit is nowhere to be seen.",
        "9. Bb5": "Seeing his pieces in disarray, White relinquishes pressure on f7 and instead threatens to win the d-pawn.",
        "9... Nge7": "Black defends his Knight, preparing to castle and preventing White from doubling his pawns on the queenside. The d- or g-pawn is forfeit, but Black can afford to give back a little material in exchange for consolidating his position somewhat.",
        "10. O-O": "The WK decides it's time to get out of dodge, though this allows Black to save his advanced d-pawn.",
        "10... O-O": "The BK escapes his pin and the dangerous open e-file.",
        "11. Nxg5": "White reclaims a pawn and threatens to pick up another, while opening the f-file for his Rook.",
        "11... Ng6": "! Black defends his lonely f-pawn with a threat to White's Knight. The f-pawn is especially valuable as it limits the possible scope of White's DSB.",
        "12. Bxc6": "White can now double the Black pawns, or at least remove d4's defender.",
        "12... Qxg5": "Preferring to keep his pawn structure reasonably intact, Black scoops up the Knight and further defends f4. White cannot take it yet, as he cannot afford to lose his LSB.",
        "13. Bf3": "I think 13.Be4 might have been stronger. This block's White's Rook from its continued assault on f4.",
        "13... Be5": "Black lends f4 additional support, looking to get his Queen out of the pin.",
        "14. Qe1": "?! White slides over to take aim at e5, but the Bishop is well-defended, has another pawn available as defense, and the White Rook would be better on e1 anyway. White should also be looking to prepare b2-b3, for when Black excuses himself from the Bishop's pin, White needs to be able to get that Bishop into real action as soon as possible, and a3 looks like a decent place to do so.",
        "14... c6": "Black stymies the White Bishop from its attack on the b-pawn, and denies it the d5 square. Black's own LSB is now free to roam, and looking dangerous to White's pinned g-pawn and trapped Rook.",
        "15. Kh1": "White wisely removes his King from the pin.",
        "15... Bf5": "So instead of g2, Black takes aim at White's undeveloped queenside as he brings his second Bishop to bear.",
        "16. Ng3": "! The c-pawn is gone, but White finally brings his Knight up to a more active post and unblocks his Queen. Perhaps he can untangle his pieces after all.",
        "16... Bxc2 17. Ne4": "This is a strong position for the Knight, and invites a bittersweet exchange--Black is three pawns ahead, but White needs to lessen the pressure to gain time for consolidation.",
        "17... Qf5": "Black finally ends the pin on his f-pawn, threatening to bring his a8 Rook into play and then make good on the e4 exchange and follow up by pushing one or both of his forward pawns.",
        "18. Nd2": "? White doesn't want to deal with the trade now that the BQ is free to roam and can defend d4-d3, but this move blocks in his DSB and doesn't accomplish much of anything, in my opinion. 18...Bxe4 19.Bxe4 gives White the initiative; there was no reason to avoid that trade for now.",
        "18... Rae8": "All of Black's pieces are now developed, and aimed at the White Kingside. In contrast, White's pieces have very little space to maneuver and several are not participating at all.",
        "19. Qf2": "The WQ flees the Rook's gaze to a slightly more active location.",
        "19... c5": "Black defends his passed d-pawn. With the demise of White's pawn on c2, it has become a much more valuable asset.",
        "20. Re1": "I think 20.Nc4 or 20.b3 are much more potent here. White's other Rook would be strong on e1, if only it could get there--he needs to get the Bishop into play.",
        "20... Kh8": "With d5 now available once more for a White Bishop, The BK slides away from that diagonal, while opening g2 for his passive-looking Rook.",
        "21. Ne4": "?! White's multiple threats force this trade, finally, but I think his time for the last few moves would have been better spent developing his Queen's Bishop and Rook.",
        "21... Bxe4": "Black's mounting attack looks formidable. His pieces show a tremendous amount of activity compared to White's passive, defensive posture.",
        "22. Bxe4 Qf6": "Maintaining defense of f4 and preventing the WQ from invading via Qh4 (after Bxg6).",
        "23. Bxg6": "? This seems like a clear mistake to me. White closes the g-file, but trades an active Bishop for a relatively out-of-the-way Knight and allows Black to get his Rf8 into action behind the powerful f4 pawn. I think 23.Bd2 or 23.b3 (23...d3 24.Rb1 with a sort of implied pin from the threat of Bb2) would have been much better choices.",
        "23... fxg6 24. b3": "This is probably still the best move, but it's SO LATE.",
        "24... d3": "The powerful d-pawn begins marching for glory.",
        "25. Rb1": "The only move, but now, with no White Bishop on e4, Bb2 is a poor option after 25...Bd4: 26.Bb2?? Bxb2 27.Rxb2? Rxe1+ 28.Qxe1 Qxb2 and Black wins easily.",
        "25... Bd4": "This is a waiting move more than anything else. Black wants to either bait 26.Bb2?? or simply position the Bishop on the g1-a7 diagonal and get it off the e-file in preparation for the final assault.",
        "26. Qf1": "I don't see anything much better. The Queen cannot relinquish defense of the Re1.",
        "26... Rxe1": "Pulling the WQ from her defense of f3.",
        "27. Qxe1 f3": "The f-pawn joins his brother on the third rank.",
        "28. Qf1": "The particular choices White makes at this point are somewhat irrelevant; he is pretty well lost. 28.Be3 might hold out the best, though (obviously he cannot take the pawn, 28.gxf3?? Qxf3#).",
        "28... fxg2+": "Black forces the final set of exchanges on his terms, his two advanced pawns from early in the game rampaging down the last few ranks of the board.",
        "29. Qxg2 Qf1+ 30. Qxf1 Rxf1+ 31. Kg2 d2": "! Now White is entirely lost. Preventing the promotion ceremony fails to 32.Bxd2 Rxb1, and taking the Black Rook is no better (and is, in fact, much worse).",
        "32. Kxf1": "This is mate in 6 (32...d1=Q+ 33.Kg2 Qg1+ 34.Kf3 Qf2+ 35.Kg4 h5+ 36.Kh3 Qf3+ 37.Kh4 Qg4#). I don't see a faster alternative than 33...Qg1+, but it certainly might exist.",
        "32... d1=Q+ 33. Kg2 Qc2+": "? There's actually a mate here that I missed at the time (see above), but winning the Rook was enough to convince White to resign anyway. White's early pawn sacrifices failed to net him the positional compensation he needed, as Black was able to hold onto his dangerously overadvanced pawns long enough to smash them down the board into the unprepared White pieces. It may be worth noting that White's DSB never moved even once, while White's Queen Knight took six moves to get to e4--a space reachable in just two jumps from b1.\n\nThanks very much to lochess-monster for the good game! Comments on the analysis or the game itself are much appreciated, and if you leave a star rating, please mention in a comment what I did well or need to improve on. Thanks for reading!"
    },
    "url": "https://gameknot.com/annotation.pl/kings-gambit-i-accept?gm=45099",
    "gameName": "King's Gambit: I Accept!",
    "players": "lochess-monster (1564) vs. bwaa (1666)",
    "opening": "KGA (C33), bishop's gambit, Maurian defence"
}