{
    "moves": {
        "1. e4 e5 2. f4 exf4 3. Nf3 g5 4. h4 g4 5. Ng5": "This is the famous and ancient Allgaier Gambit - considered by many to fall short of real 'soundness'.  White's Knight is trapped, and must be given up.  Can White get enough for the material?  That is what the MT is designed to discover.  An alternative gambit line, by the way, is 5.Ne5, the Kieseritzky.  It is considered a deal less compromising than the Allgaier.",
        "5... h6": "Trapping the Knight.  There is no turning back for White now!",
        "6. Nxf7": "At least Black's king gets displaced and lured into a position where he may be attacked.",
        "6... Kxf7 7. Nc3": "[!?]  The GK engine mislikes this move, on account of 7.Nc3 f3  8.gxf3 Be7 -(a line my old MCO11 describes as 'yet unexplored and unclear')- 9.Bc4ch Kg7  10.0-0 g3  11.d4 Bb4  12.Kg2 Bxc3  13.bxc3 Qxh4 -(and now 14.Rh1 looks fine to me)-.  Instead, the engine prefers 7.Qxg4 Qf6  8.Nc3 h5  9.Bc4ch Ke8  10.Qg5.  Can't say I go a bundle over this line at all for White.  My MCO10, by the way, also suggests 7.d4 and 7.Bc4ch at this point.",
        "7... Nf6": "Not interested in the 7...f3 line.  I'm not sure I would be either!",
        "8. d4 Bb4": "Showing that Black's previous move did not mean he was going to sit back and defend.  Black is now attacking White's centre, threatening ...Nxe4.",
        "9. Bxf4": "White is out for blood, too!",
        "9... Qe7": "[?!]  This move is difficult to understand.  Possibly he was hoping to induce 10.e5, or maybe simply wished to subject White's centre to greater pressure.  However, I would have thought 9...Nxe4 or the GK engine's suggestion, 9...d5 might have been more forceful.",
        "10. Be2": "[?] Jo comes within an ace of slipping into passivity - a little bit of a tendency she still has to overcome.  Nor would 10.Bd3 have been much chop.  The GK engine offers a fine continuation in 10.Bc4ch! Ke8  11.0-0 Bxc3  12.bxc3 d6  13.e5 dxe5  14.Bxe5 ... and White's game looks great to me!  Instead White wants to blunt Black's pawn wedge on the K-side, but Black can maintain that useful salient.  White's gaze should be directed at and focused upon the Black King.",
        "10... Qxe4": "...Or 10...Bxc3  11.bxc3 Qxe4.",
        "11. O-O": "Castling with malice aforethought!  The Black Queen is at once attacked, and the rook directs a basilisk stare down the f-file.",
        "11... Bxc3": "A well motivated exchange that has been on the cards since move 8.  Although Black has to give up one of his few active pieces, its scope was not huge, and the White Knight was showing a tendency to improve its prospects at e4, d5 or even b5.  ",
        "12. Be5": "[!] In my view a clever intermezzo.  Objectively speaking 12.bxc3 was probably no worse, but now Black has to contend with a situation that has suddenly become very complicated.",
        "12... Bxb2": "A courageous continuation, in the light of the threats White has mounted down the f-file.",
        "13. Rxf6+": "[!?] Consistent and logical, but the GK engine pans it in favour of 13.Rb1 Bc3  14.Bxf6 Re8  15.Rb3 and an even but lively game.  Possibly this is correct, but Jo is beginning to play 'out of character' here, and really wanting to take the fight to her opponent.",
        "13... Ke8": "Instead, 13...Kg8 would have got axed by 14.Bc4ch ... -(14.Qf1 would also have won)- 14...d5  15.Bxd5ch Qxd5  16.Qd3!",
        "14. Rb1": "[?] But this really is wrong, as will become apparent... sort of.  Time - timing - is of the essence in games like this.   However, it is not easy to see how White ought to proceed here.  No good seems 14.Rf4 Qe3ch  15.Kh1 Bxa1 -(or 15...Nc6!).  The engine suggests 14.Rf1, but maybe 14.Rf2 is an improvement, depriving Black of a checking move.  After 14.Rf2 Bxa1  15.Bxh8, White's active game seems to compensate for the piece deficit.",
        "14... Ba3": "[?] Returns the compliment.  But again, it is not so easy in a roller coaster ride like this to discern how the game is like to go.  Instead 14...d6! would have placed White in real trouble: 14...d6!  15.Rxb2 dxe5  16.Rf1 ... (16.dxe5 Qxe5 attacks both rooks)  16...Qxd4ch  17.Qxd4 exd4 and White's attack has been blunted for good. ",
        "15. Bd3": "[!?] This looks very good indeed, but the simple 15.Rb3 was probably even better, bringing the rook into action with a gain of tempo, ready to slide over to the e-file, say.  A possible continuation would have been 15.Rb3 Bc5(!)  16.Kh1 Be7  17.Rf4 Qh7  18.Bd3, with a huge attack.",
        "15... Qe3+": "The Queen has very few squares available -  pitiable, lamed creature that she is.",
        "16. Kh1 Be7": "[??] A terrible move, as the GK engine observes.  Up until now, White has been fighting hard to make good on her gambited material, but after this slip by Black, she has a big edge.  Instead, 16...d6  17.Bg6ch Kd8  18.Rb3 Qc1! would have forced the Queens off, reducing thereby White's attacking resources.",
        "17. Bg6+": "[!?] Fine, but White had as good an alternative in 17.Qxg4!  Considering the complexities of this game, it is surprising how often there is more than one good move available in a given position.  That sort of thing can actually make the attacker's task much harder.  It's none too comfortable for the defender, neither!",
        "17... Kd8 18. Rf7": "Now was a good moment to mobilize her last reserve, the b1-rook, who is feeling a little left out of the fun right now.  After 18.Rb3! the Black Queen would have been trapped!  The game might then have continued 18.Rb3! Qxb3  19.axb3 d6! -(not 19...Bxf6??  20.Bxf6 with a 2-bishop mate!)- 20.Rxd6ch cxd6  21.Bxh8 ... Although material would then be roughly level (Q for R and N), White's superior mobility - Black Q-side as yet unmoved - would probably have been decisive. ",
        "18... Rg8": "At last getting out from under the attack from the bishop at e5.  The game is still +/- at this point.",
        "19. Qf1": "'Hoping' for 19...Rxg6  20.Rf8ch Bxf8  21.Qxf8#.  That's too simple a threat for Black to overlook, of course.  But see how White exploits that threat to improve her attacking resources and gain time.",
        "19... d6": "[??] In avoiding the Scylla of ...Rxg6?? Black, in his hurry to undertake the long postponed mobilization of his right wing, falls into the clutches of the text move Charybdis.  However, the situation is already pretty dire, as after 19...Nc6  20.Bf6 d5  21.Rb3 (or 21.Re1) looks horrible for Black, e.g.: 21.Rb3 Qe6  22.Bxe7ch Nxe7  23.Rf8ch Rxf8 - White's close assault is incurring heavy casualties, but it's in a good cause - 24.Qxf8ch Kd7  25.Be8ch Kd6  26.Qf4ch Qe5  27.Qxe5#.",
        "20. Re1": "[?!]  Laudably introducing her last reserves.  However, with two pieces 'en prise', White could have thrown in a third, with decisive results:  20.Rxe7!! and now [a] 20...Kxe7  21.Qf7ch! Kd8  22.Bf6ch and mate next.  That is easy to see,  but what if... [b] 20...Bd7, then?  Answer: 21.Bf6! ... -(a battery unmasked whilst setting up another!) 21... Qxe7  -(there is no way to save the king and Queen both!)  22.Bxe7ch Kxe7  23.Qf7ch etc.",
        "20... Qxe1": "This is of course what White had in mind with her previous move.  Black had no sensible alternative: 20...Qc3  21.Rxe7.  This rook move becomes something of a key motif of the play hereabouts!",
        "21. Qxe1 dxe5": "At this point, Black might well have been thinking that he had reasonable drawing chances, as, to balance his underused Q-side, White is running out of troops.  However...",
        "22. Qxe5": "[?]  The obvious move, but suddenly Black can seriously entertain hopes of a draw.  Yet a more tactically minded player of the White pieces would certainly have seen at once the possibility of, and given serious consideration to, 22.Rxe7.  I did say it was something of  central motif of the game hereabouts, didn't I?  After 22.Rxe7!! we have [a] 22...Kxe7  23.Qxe5ch Be6  24.Bf5 ... winning a piece at least; [b] 22...Rxg6  23.Qxe5 Bd7  24.Rh7.",
        "22... Nc6 23. Qd5+ Bd6": "[!] Not 23...Bd7?  24.Bf5!, or (worse)  23....Ke8?? 24.Rf8ch!! Kxf8  25.Qf7#.",
        "24. h5": "Really too slow.  It was probably difficult after such an already eventful game to appreciate that White still had attacking resources available.  After 24.Rd7ch! Kxd7 -(Not ...Bxd7; Qxg8ch winning the other rook as well)  25.Qxg8 Ne7  26.Qe8ch Ke6  27.c4!",
        "24... Re8": "[!] Black is back!  The threat (...Re1#) throws White back.",
        "25. Rf1": "Only move!",
        "25... Ne7 26. Qf7": "White threatens mate-in-one in her turn.  But Black has consolidated, and enjoys a slight material edge: Rook, Bishop and Knight for the Queen.  From here on, White is fighting to save the game.  Such a turnaround!",
        "26... Bd7": "[?!]  Better was ...Nxg6, to reduce still further White's attacking potential.  The passed pawn White would have obtained would not have been dangerous, as events will reveal.",
        "27. Qh7": "Going after black's K-side - and it looks like a plausible way to go.  White is still trying to extract the full point out of this game, but it is getting to be high time to shelve such ambitions and look to saving the draw.  It seems possible to achieve that much at this point, after 27.Qf6 Rg8  28.Bh7 Re8  29.Bg6 Rg8 and a repetition.  Maybe Jo had this in mind with this move, but...",
        "27... Nxg6": "... Black has this exchange, which would not have been available after 27.Qf6.",
        "28. hxg6": "Now White can pin her hopes upon promotion.  The problem is that the Queening square is well covered (or soon will be) and White lacks the resources to diversify her attack.",
        "28... c6": "At last preparing to connect the rooks and complete his development.",
        "29. Qxh6": "I think I would have been inclined to try 29.g7 at once in the hope of tying down Black's defences.  It would have had the added virtue of covering the h8-square against possible pins along the file.",
        "29... Kc7 30. g7 Be6": "The g8-square is now well guarded against an intruder.  What else can White try?",
        "31. Rf6 Bxa2": "[!] Some interesting tactics appear hereabouts.  Has Black blundered a piece?",
        "32. Rxd6 g3": "[!] No.  The threat to the back rank forces White to return the equivalent of the material just won.",
        "33. Rxc6+": "The saving clause.  This was the least expensive way to prevent the back rank mate.",
        "33... bxc6 34. Qf4+": "[!] Not bad! A tempo gainer to pick up the menacing g-pawn.  ",
        "34... Kb7 35. Qxg3": "Restoring the status quo as it existed at White's 30th move: a -2 material deficit.",
        "35... Bg8": "Cautious consolidation once again.  White has too few points to attack.  Black can afford to slow down the pace.",
        "36. Qd6 a5": "The bad part for White is that there is only one piece available even to slow down this pawn.  White's own pawns are pretty much move bound - they are in no position to exert any leverage at all.  The g-pawns are simply blockaded, and for the moment the c- and d-pawns can not advance either.",
        "37. Qa3 a4": "Nailing down the Queen.",
        "38. Kh2 Ra5": "Not the best, by the look, though White still hasn't enough seriously to discommode Black. ",
        "39. c4": "[!] Hoping to decoy the Bishop (39...Bxc4??  40.Qb4ch).  A clever try, when it seemed as though these pawns were completely stymied.  Unfortunately the more direct 39.Qb4ch at once doesn't improve things much after 39...Rb5  40.Qf8! Rh5ch!  41.Kg1 Ra8  42.Qe7ch Kb6  43.Qb4ch Rb5  44.Qf8 Ka7  45.Qe7ch Ka6  46.Qf8 Rab8! and after 47...Bd5 Black will have consolidated totally, presenting no discernible weakness for White to target.",
        "39... Kc7 40. d5": "If 40.Qf8, Raa8 would have held everything for Black. ",
        "40... cxd5 41. cxd5 Raa8": "At this point the players agreed to share the honours (1/2 - 1/2).  Could White indeed have checked Black indefinitely?  Let's see: 42.Qc5ch Kd7  43.Qc6ch Ke7  44.Qc7ch Kf6  45.Qf4ch! Kxg7 -(It seems inconceivable that Black might escape without taking this pawn!)-  46.Qg5ch and now [a] 46...Kf7  47.Qf4ch! Ke7  48.Qc7ch; or 46...Kf8  47.Qf6ch Bf7  48.Qh8ch Ke7  49.Qe5ch Kd7  50.Qf5ch.  Now, as 50...Ke7 51.Qe5 repeats the position, Black will have to sacrifice his bishop: 50... Kd6  51.Qxf7 a3 -(what else?)- 52.Qg6ch (say) Kxd5  53.Qd3ch, and with all Black's troops standing at the edge of the board, they are in no position to intervene against White's roaming Queen.  So the GK engine notwithstanding, the final position, objectively speaking and with best play, should lead to a draw anyhow.  Note my wording here.  It would be wrong to call the position 'drawn' and I consider the GK engine's evaluation probably about right in the circumstances.  It would have been so easy for White in particular to have fallen into a losing line - she would have had to walk a narrow path to safety.  What a game:  high quality, hard fought and combative.  Well done, both!\n"
    },
    "url": "https://gameknot.com/annotation.pl/kingda-ka-walking-the-walk-learning-to-run-welcome-mt-pt-9?gm=51472",
    "gameName": "Kingda Ka: Walking the Walk & Learning to Run Welcome MT Pt 9",
    "players": "jstevens1 (1830) vs. itchynscratchy (1976)",
    "opening": "KGA (C39), Allgaier, Blackburne gambit"
}