{
    "moves": {
        "1. e4 c5": "Another sicilian, but no 2.Ne2 nonsense from me this time\n",
        "2. Nf3 Nc6": "The move I play, so the one I'm happiest to see.\n",
        "3. d4 cxd4 4. Nxd4 g6 5. c4": "Without playing ...Nf6 first this allows me to play the Maroczy Bind.  Once quite the feared weapon from White, indeed at one point it was  considered a positional blunder from Black to allow it! However since then  play has been found for Black and in 1995 John Nunn and Joe Gallager write,  \"Although the Maroczy Bind is slightly passive for Black, players such as  Larsen, Petursson and Velimirovic have shown that by patiently waiting for a  lapse of concentration from White this line can offer winning chances for  Black. The theoretical opinion is that White should maintain a slight  advantage, but no one should believe that this is a line in which White  cannot lose.\" and in the 15th MCO Nick de Firmian says that, \"With 5.c4  White...leads to a quiter, positional type of game, yet Black will get  strangled if he/she cannot find active play\".\n",
        "5... Bg7 6. Be3 Qa5+": "A move that I  have not seen before, it seems to only help White develop, but I am concious  of the ability for the Queen to quickly reach the Kingside and for the pin to  leave e4 undefended.\n",
        "7. Nc3 Qb4": "After this move I felt that I must win the  game, this early sortie from Black's Queen now cannot be condonded. I sat at  the board and convinced myself that I should win after two seeming  tempo-losing moves from Black. I forced myself to try to continually press  Black and bust open the position to use my lead in development.\n",
        "8. Rb1": "In  fact this move is not necessary as after a3 the b2 pawn cannot be captured\nAlternative variation: 8. a3 [and the pawn cannot be captured] Qxb2 (8. ... Qa5 9. Be2 [Continue  with the same plan to count on White's lead in development.] ) 9. Na4 [The  queen is trapped.] Qxd4 10. Bxd4 Bxd4 [Black is active and it isn't all over,  but White's material advantage should prove winning.] \n",
        "8... Nh6": "Again another  odd move, Black doesn't want to restrict their DSB but optimal development is  more important currently, the diagonal is a long-term idea not immediately  tactically helpful unless White mis-steps and now this knight is misplaced.\n",
        "9. Be2": "Leaving the knight stranded for the time being.\n",
        "9... O-O": "Now I'm looking  for a way to take advantage of the fact that the knight has no safe squares!\n",
        "10. O-O": "My first thought was for King safety since I often charge into  attacks before I take care of this and pay the price. However in this case  had I kept searching there was a way to exploit the weak Knight faster!\nAlternative variation: 10.  Nb3 Qd6 (10. ... Bxc3+ 11. bxc3 Qxc3+ 12. Bd2 Qg7 13. Qc1 ) 11. Qc1 g5 12.  Bxg5 Qg6 [White is ony up a pawn but has a very strong position, and the  space around Black's King will start to tell soon.] 13. O-O d6 14. c5 dxc5  15. Nxc5 \n",
        "10... e6 11. a3": "The idea is to get the Queen away from the action,  trade Knights on c6, and then play Qc1\n",
        "11... Qa5 12. b4": "Again Nb3 is far  stronger, this hangs the Knight on c3 and gives Black some tactics to save  their Knight on h6.\nAlternative variation: 12. Nb3 Qe5 13. Qd2 Nf5 [Since the Queen has not been  given time to get to f6, and the Knight on c3 is still protected by the pawn,  there is now no choice but to give up the Knight.] \n",
        "12... Qd8 13. Nxc6 dxc6 14. Qc1": "All according to plan but missing...\n",
        "14... Qf6 15. Nd1": "Allows\nAlternative variation: 15. Rb3 [A  strong way to protect the Knight, since the g-file will soon open and Black's  King will be exposed.] g5 16. Bxg5 Qg6 [Close to the text since Black missed  the best line] \n",
        "15... g5": "But my opponent misses their ...Qh4 resource and our  game gets close to 15. Rb3\nAlternative variation: 15. ... Qh4 [Allowed now since the pawn on e4 is  now longer defended] 16. f3 [Need to protect the pawn, and White still has a  small advantage, but not nearly as much pressure as before] (16. Bg5 [The  resource which traps the Queen if Qh4 is played after 15. Rb3, but now the e4  pawn is undefended] Qxe4 ) \n",
        "16. Bxg5 Qg6 17. Rb3": "No need to guard the pawn  since White can start to severly attack Black's open King! Black is in  serious trouble now.\n",
        "17... f6 18. Bd2": "A bit better is Bf4 since now 18... Qxe4 is  met with 19. Bd3 and the Queen cannot go to h4, but Bd2 is still plenty  strong, many roads lead to victory now. Even the ...Qh4 doesn't save much for  long!\nAlternative variation: 18. Bf4 Qxe4 19. Bd3 Qd4 20. Bxh6 \n",
        "18... Nf7": "Alternative variation: 18. ... Qxe4 19. Bd3 Qh4  [But Black is still] 20. Bxh7+ Kxh7 21. Rh3 Qe4 22. Bxh6 e5 23. Bxg7+ Kxg7  24. Qh6+ [Starting to look pretty hopeless for Black.] \n",
        "19. Rg3": "Commencing  the attack on Black's King, Black is nearly forced to capture on e4, but this  just allows White's Bishops to fully enter the game, and Black's LSB is  playing absolutely no role!\n",
        "19... Qxe4 20. Bd3 Qe5": "...Qd4 is better so that the  Queen can retreat to d8 and help hold f6\nAlternative variation: 20. ... Qd4 21. Bc3 Qd8 22. Qc2  [White still has a great attack however.] \n",
        "21. Bc3 Qd6 22. Bxf6 Qxg3": "Not  capturing leads to mate.\nAlternative variation: 22. ... e5 [The longest try, but still...] 23.  Bxh7+ Kh8 (23. ... Kxh7 24. Qc2+ Qd3 25. Qxd3+ e4 26. Qxe4+ Bf5 27. Qxf5+ Kh8  28. Bxg7+ Kg8 29. Bf6+ Ng5 30. Qg6# ) 24. Bxg7+ Kxh7 25. Qc2+ e4 26. Qxe4+  Kg8 27. Be5+ Bg4 28. Rxg4+ Ng5 29. Rxg5+ Kf7 30. Bxd6 Rfe8 31. Qg6# \n",
        "23. fxg3": "Now just a matter of technique from White not to screw up.\n",
        "23... Bxf6 24. Rxf6 Kg7 25. Rf2 e5 26. Nc3 Be6 27. c5 Rad8 28. Bc2 Bc4 29. Ne4 h6 30. h3 Rd4 31. Nd6 Rd8": "Time for the finishing touch\n",
        "32. Nxc4 Rxc4 33. Rxf7+ Kxf7 34. Bb3": "Black resigns. Some inaccuracies and somewhat better variations possible  from both sides in the last 11 moves, but White has more than enough of an  advantage the whole way through.\n"
    },
    "url": "https://gameknot.com/annotation.pl/kings-island-round-4-mason-oh?gm=53450",
    "gameName": "King's Island Round 4, Mason OH",
    "players": "MWebber (1747) vs. DavidGilchrist (1883)",
    "opening": "Sicilian (B38), accelerated fianchetto, Maroczy bind, 6.Be3"
}