{
    "moves": {
        "1. e4 c5 2. Nc3": "I am not a favorite of this move to open for white.  It leaves too many holes.  Lets see how it plays out.",
        "2... Nc6 3. f4": "Ok...weakens the king side.  Me likey.  ",
        "3... g6": "setting up for the king bishop fiancetto",
        "4. Nf3 Bg7 5. d3 d6 6. h3 Bxc3+ 7. bxc3 b5": "Computer says my best move is bringing the knight out, but doesn't rate me bad here.  I thought about bringing my king's knight here but wanted to strengthen my queen side considering his questionable pawn formation there.  Although the computer didnt like it, i thought this move was a key to my victory actually",
        "8. g4 Bb7 9. h4": "his pawns are strong but hes is being a little too aggressive with them i thought.  I thought he should have fiancettoed his bishop there, which he eventually does later.",
        "9... e6": "trying to prevent a disaster.  Computer agreed this was a good move.  ",
        "10. h5": "still attacking which i respect completely.  I need to be careful here.",
        "10... d5": "ok, lets resolve the centre.  Daring move, but the computer liked it, and who i am to argue?? ",
        "11. Bb2": "Questionable move but not bad.  Look at that diagonal for him.  Im in a touch of a bad spot here and feeling anxious, but i still dont see anything great for him.  I thought he should have exd5 here.   ",
        "11... dxe4": "I got a bit aggressive here but it didnt hurt me or him.  The board leans in his favor at this point but not by much. If he takes the bait and strikes with the pawn i have a strategy to make him uncomfortable.   ",
        "12. dxe4": "He took it.  Now the game begins.  I thought he should have moved the knight and attacked that poorly placed pawn with this kings bishop or queen.  He would have won it eventually, especially if he started wreaking havoc with his earlier pawn push, which for some reason he gave up on.  ",
        "12... Qc7": "this was part of my plan if he attacked he took the pawn with his.  Ive been anticipating his king side pawns to start attacking but he backed off on that strategy, leaving me feeling better and more comfortable taking chances. ",
        "13. c4": "Finally, the move i have been waiting for.....lets see what happens.",
        "13... Rd8": "again, part of my strategy with opening that rank.  This was my best move of the game and the computer has us dead even again.  Good job by me!!! ",
        "14. Qe2 Nd4": "attack!  ",
        "15. Nxd4 cxd4 16. cxb5 Qxf4": "Now, the weakness was exposed in that pawn push from earlier.  ",
        "17. Bg2": "Bad move.  I thought at this time he should have started breaking down the wall on the kings side.  Not sure why he didnt just charge ahead there.  All of his pieces are in postion",
        "17... Nf6": "Finally able to free up my knight as you will see i need him. ",
        "18. Rf1 Qg3+ 19. Kd1": "Game over on that move.  He should have blocked with the queen lady.  He has to resign soon",
        "19... Nxg4": "threatning",
        "20. Bc1 Ne3+ 21. Bxe3 dxe3+ 22. Kc1 Rd2": "Good game.  "
    },
    "url": "https://gameknot.com/annotation.pl/king-george-i-s-mini-tournament-vi?gm=47106",
    "gameName": "King George I 's Mini-Tournament VI",
    "players": "cnd250661 (1503) vs. kiss_the_king (1282)",
    "opening": "Sicilian (B23), Grand Prix attack, Schofman variation"
}