{
    "moves": {
        "1. c4": "English opening. Please rate or type a message on this game.",
        "1... Nf6 2. Nc3 g6": "Transposing into A King Indian Defense",
        "3. e4": "I believe Nf3 would be stronger than e4. Playing the flank attack moves",
        "3... d6 4. d4 Bg7": "The main line, also know as the Mar del Plata",
        "5. Nf3 O-O 6. Be2": "The Classical variation",
        "6... Nbd7": "hhmm? Is not he suppose to play e5?",
        "7. O-O e5 8. d5": " Petrosian System, one move behind though. Well because black played Nd7 instead of the orthodox e5. I restrict my opponent to any counter play by locking the pawn formation. This is very safe for white.",
        "8... Nc5": "?! not sure if this was good",
        "9. Qc2 Ne8": "preparing the thematic f5 break. If you do not know King Indian Defense setups. Black plays to the king side and white plays the queen side.",
        "10. b4": "The bayonet attack! b4 is the start of my expansion on the queen side. Ignoring blacks counter play on the king side.",
        "10... Na6 11. Rb1": "hah! two birds with one stone. I protect the b pawn and get out of the a1-h8 diagonal if it becomes open. Watch my rooks in this game",
        "11... f5 12. a4": "Continuing my annexation of my enemy's territory ",
        "12... c5": "?! I think this is the start of his down fall. he is supposed to play king side. Nf6 double attacking my  e pawn would have been better or fxe opening the f file. Even f4 for black would be fine. Playing the king side",
        "13. dxc6 e.p. bxc6": "Now I have a queen side pawn majority. Taking into account that he has a backward D pawn",
        "14. Rd1": "Pointing my rook to his queen. Rooks belong on open files.",
        "14... fxe4 15. Nxe4 Bf5 16. Bd3 Bg4": "?! what was he thinking?",
        "17. Ned2 Nf6 18. h3 Be6 19. Ng5 Qd7 20. Nxe6 Qxe6 21. c5": "hah! preparing to pin his queen. This combination helps me win the game",
        "21... d5": "The best move?",
        "22. Bxa6": "Now I am ahead in material. If played correctly I have a won game",
        "22... Kh8 23. b5 e4 24. Bb7": "Another combination! fork attack",
        "24... Rab8 25. Bxc6": "quick bishop ",
        "25... e3 26. Nf3 exf2+ 27. Qxf2 Ne4 28. Qe1 Qf5 29. Rxd5": "I do not know if he seen this. He should have",
        "29... Qe6 30. Rb4": "!! his knight is pinned",
        "30... Ng5": "The best move?",
        "31. Rxg5 Qa2": "After my second win of Material I decided to to liquidate the pieces on the board to a winning end game.",
        "32. Qd2 Qf7 33. Bb2 Rbd8 34. Bxg7+": "A \"Zwinenshoe\" or a in-between move",
        "34... Qxg7 35. Rd5 Qa1+ 36. Kh2 Kg8 37. Rxd8 Rxd8 38. Qxd8+ Kg7 39. Qd4+ Qxd4 40. Rxd4": "black resign finally"
    },
    "url": "https://gameknot.com/annotation.pl/king-indian-defense-classical-petrosian-system?gm=16962",
    "gameName": "King Indian Defense Classical/Petrosian System",
    "players": "freeman8201 (1610) vs. krurico (1642)",
    "opening": "English opening (A16)"
}