{
    "moves": {
        "1. b3": "Larsen's Opening. I don't have much experience with it.",
        "1... e5": "This is the Modern Variation, the only line I have any familiarity with in this opening. Black aims to limit the scope of White's DSB and occupy the center directly.",
        "2. Bb2 Nc6 3. e3 d5 4. Bb5 Bd6 5. Nf3": "This is the first deviation from the main line, which would continue with 5. f4 before playing Nf3. ",
        "5... Qe7": "Defending the e-pawn and looking at a3. I think 5...f6 might be better here.",
        "6. d4": "? This seems like a mistake to me. White has spent a lot of time building pressure on e5 and trying to open the lane for his Bishop, and now he allows me to shut it down almost entirely. This is the advantage of 5. f4; it leaves the a1-h8 diagonal gloriously free.",
        "6... e4": "This seems like the most logical move. After the Knight retreats, I need to be ready to try to prevent c4, which White will play as soon as he can to reopen the position. At this point, I'm planning to drive White's Bishop away and then get a pawn on b5 to restrict c4.",
        "7. Nfd2": "Basically forced; the Knight is more useful supporting c4 than spending two tempi moving Ng1-e2.",
        "7... Bd7": "I need to prevent White from pulling my b-pawn off its file, or I won't be able to stop him from playing c4.",
        "8. a4": "This introduces possible complications after ...a6 and ...b5, but frankly I'm not sure what the point of this move is at the time. White will clarify his idea shortly.",
        "8... a6": "Asking the question.",
        "9. Bxc6": "White decides to trade a Bishop for a Knight, given the closed position. The LSB wouldn't have many prospects on e2 either, but perhaps he could swing a kingside attack that way.",
        "9... Bxc6 10. Ba3": "Black reveals the point of 8. a4: he wants to get his stuffed Bishop into action. Evidently he's not as sure as I am that playing c4 will solve his troubles relatively efficiently.",
        "10... b5": "White can *still* play c4 here, but at least now I can remove one defender without moving the d-pawn. 10...b5 also gives me the option of getting my Bishop to b7 (or a8 if the a-file opens up and Rooks are exchanged), allowing ...c6. At this point, though, I'm starting to think an open center wouldn't be such a bad thing--I need to make use of my Bishops.",
        "11. Bxd6": "Make that 'Bishop', singular.",
        "11... Qxd6": "As White now has no Bishops left, I absolutely need to open up the game, or his Knights may be able to run circles around me.",
        "12. Nc3 Nf6": "With the threat of the a-file opening up, I decide it's high time to finish developing minor pieces and prepare to connect my rooks. This does lose a pawn for me, but I'm hoping my extra space and mobility will make up for it.",
        "13. axb5 axb5": "I'm not too happy about putting my Bishop on a8, but I think I can open up the game and I'd rather have BN vs NN than N vs N. Besides, I don't actually have a choice (13. ...Bxb5?? 14. Nxb5 and I can't retake without losing both Rooks).",
        "14. Rxa8+ Bxa8 15. Nxb5 Qb6": "I need to keep c7 defended, and I'd like to chase this Knight far away with 16. Nc3 Qb4 17. Na2 Qa5.",
        "16. Qa1": "White preemptively defends c3 for his Knight's retreat.",
        "16... O-O": "If 16...Qxb5??, White has 17. Qxa8+ followed by Qxh8. My late castling has seriously limited my options.",
        "17. Nc3": "Now White retreats. A stronger play, I think, was 17. c4!, which Black cannot answer effectively with 17...c6 18. c5 and White's passed pawns are a huge threat.",
        "17... Qb4 18. Na4": "The Knight searches desperately for a useful home where it doesn't tie the WQ to passive defense. 18. Ne2 might have been better.",
        "18... Bc6": "I attempt to continue to lock the WQ into a passive role (19. Nb2 Qc3). White can play 19. c3 here instead, breaking the pin on his d2 Knight.",
        "19. Qd1": "White feels like he can give back the pawn, and I agree with him. He clearly wants to castle, so he chooses to defend the Nd2 in preparation for that. 19. c3 would accomplish much the same thing, but of course the BQ can simply retreat to b5 and prevent castling anyway.",
        "19... Bb5": "White is telegraphing his desperation--if he's willing to give up a pawn for the opportunity to castle, I'm certainly not going to give him that opportunity if I can help it.",
        "20. f3": "White decides to try to break my pawn center while preparing to castle artificially through f2.",
        "20... Re8": "There's still no reason for me to trade off my Bishop for White's miserable Knight on a4, and White can't force the issue, so I turn my sights to the kingside. 20. f3 left White's e-pawn very weak, so I bring up another heavy piece to drill it as soon as the center opens.",
        "21. Nc5": "White tries to get his Knight into play, ineffectually attacking e4 and little else. I think 21. Kf2 was better here, getting out of both pins (the direct one from b4-e1 and the indirect one from e8-e1).",
        "21... exf3": "It's go time. White loses at least a pawn now.",
        "22. Qxf3 Qxd4": "I finally let up the pin on the Ne2, but it has nowhere to go. The WK still can't castle out of his predicament, and now I'm threatening both ...Qxe3+ and ...Qxc5. White can't defend adequately.",
        "23. Kf2": "?? White was under time pressure here, but this move loses a lot more than the Knight.",
        "23... Qxd2+ 24. Qe2": "? Overlooking the Bishop, but it doesn't matter. The WQ is actually done for anyway after 24. Kg3 Rxe3 (or 24. Kg1 Qe1+ 25. Qf1 Qxf1#).",
        "24... Qxe2+": "And White resigns, as mate is inevitable. Thanks for a fun game, leapingtrout, and thank you, dear reader, for reading. Comments on the analysis or on the game itself are greatly appreciated. Until next time!"
    },
    "url": "https://gameknot.com/annotation.pl/knights-and-bishops-in-a-closed-game?gm=45037",
    "gameName": "Knights and Bishops in a Closed Game",
    "players": "leapingtrout (??) vs. bwaa (??)",
    "opening": "Nimzovich-Larsen attack (A01), modern variation"
}