{
    "moves": {
        "1. Nf3": "white opens with a plan to attack a lower rated player. The names have been changed. I was checking on a game a friend I know played. I just wanted to share what I found. Please add comments to this short game.\n",
        "1... f6": "Black moves up a pawn. This does protect e5 and g5. ",
        "2. e4": "e4 up the center",
        "2... Nc6": "black brings out a knight!",
        "3. d4": "white brings out another center pawn 2 spaces to d4.",
        "3... d5": "black does same to d5",
        "4. exd5": "white takes pawn with pawn, and now has 2 pawns on the d-file.",
        "4... Qxd5": "Black accepts and recaptures a pawn. The queen is out early. This can be trouble bringing out your queen before development of your minor pieces.",
        "5. Nc3": "white Nc3 which deveops and attacks the queen in the open!",
        "5... Qd6": "Queen has chosen to move out of harm.",
        "6. Nb5": "White is attacking with Nb5. In this case it is acceptable to do so as the Black Queen is attacked!",
        "6... Qe6+": "Black checks with Qe6+",
        "7. Ne5": "Check is blocked with Ne5 which can be taken with a pawn by black or the queen, and yet blacks knight. A better move by white could of been moving a lsb or dsb to block the check. Even the queen to e2 could have been played. What do you think of whites pay?",
        "7... Kd8": "?King moves to d8, seeing a threat from the white knights! That is why Black should have kept the queen back and developed the minor pieces! The f7 square is protected by the queen for now but she will be forced to move again. Do you think Nh6 would of been a better move? I see a move to take the Knight on e5 with a pawn. ",
        "8. Bc4": "LSB to c4 attacking queen!",
        "8... Qf5": "queen is forced to move",
        "9. Nf7+": "Nf7+, would not have been possible if the King would not have moved",
        "9... Ke8": "?king moves out of check. kd7 looks better to me?",
        "10. Nxc7+": "other knight puts black in check!",
        "10... Kd7": "king is forced to move!",
        "11. Nxa8": "white knight takes rook!",
        "11... Qe4+": "Black checks with Queen!",
        "12. Kf1 b6": "pawn to b6 in hopes a future  capture of the knight on a8.",
        "13. Nxh8": "white takes other black rook. Black throws in the towell game over!"
    },
    "url": "https://gameknot.com/annotation.pl/knight-attack?gm=49829",
    "gameName": "Knight Attack",
    "players": "Sir Knight (1177) vs. Black (1038)",
    "opening": "Reti opening (A04)"
}