{
    "moves": {
        "1. d4": "I like to vary my openings. Being placed in a group of five, so four games with each colour, I played 1. d4 twice and 1. e4 twice.",
        "1... Nf6 2. c4 g6 3. Nc3 d5": "Black chooses the Gruenfeld Defence. I don't think I've ever played against it before.",
        "4. Bf4": "After doing a little cursory research, this appealed to me more than the complexities of 4. cxd5. (As of 31/12/08) Wikipedia describes this move as \"a safer continuation\" for \"less adventurous players\".",
        "4... c6": "Less common -- and perhaps also less adventurous -- than 4... Bg7 5. e3 c5.",
        "5. Nf3": "Faced with an unknown position, I make sensible developing moves. We seem to be in some sort of Slav Defence now, in which Nf3 is often played early on.",
        "5... Bg7 6. e3 O-O 7. Bd3": "More standard development. This moves offers Black the chance to gain a tempo with dxc4, although then his pawn on c6 is no longer supporting the centre.",
        "7... Re8": "Black instead continues his own development, seemingly happy to leave the centre closed.",
        "8. O-O Nh5": "This move attacks the bishop and threatens to inflict doubled pawns.",
        "9. Be5": "A zwischenzug; White accepts doubled pawns but gets Black to block his fianchettoed bishop. This was played in Euwe-Alekhine, 1935 World Championship, although that was after 4... Nh5.",
        "9... f6 10. Bf4 Nxf4 11. exf4 e5": "An aggressive strike, perhaps premature with Black's development lagging.",
        "12. fxe5": "White must of course take; otherwise the pawn comes to e4.",
        "12... fxe5 13. dxe5 Bxe5 14. Nxe5": "I jump at the chance to exchange off Black's fianchettoed bishop, leaving his king somewhat exposed.",
        "14... Rxe5 15. cxd5": "Here I made a strategic decision that determined the course of the rest of the game. Black must recapture with the pawn, so he will have an isolated queen's pawn (isolani), but it will also be a passed pawn. While White tries to attack this pawn, Black will be trying to promote it. Is its weakness greater than its strength?",
        "15... cxd5 16. Bc4": "The first offensive is launched. The bishop cannot be taken while the queen is undefended.",
        "16... Be6": "Naturally.",
        "17. Bb3": "A pre-emptive retreat that prevents the possibility of a double attack on the bishop and another piece later on.",
        "17... Nc6 18. Re1": "Black is forced to exchange rooks due to the skewer on the bishop. This eliminates a defender of the pawn, while Rd1 will allow me to keep the same number of attackers.",
        "18... Rxe1+ 19. Qxe1 Bf7 20. Rd1 d4": "Black decides to advance to a better-defended square rather than retreat into the trenches. 20... Ne7 21. Qe5 Nc6 22. Qg3 Ne7 23. Qe3 would win the pawn.",
        "21. Bxf7+": "To avoid Black doubling my queenside pawns. Black's king comes into the open, but we are now in a near-endgame where this is unlikely to be a factor.",
        "21... Kxf7 22. Qe4": "Threatening to round up the pawn with Ne2.",
        "22... Qe8": "Black could also consider the exchange 22... dxc3 23. Rxd8 Rxd8 24. g3 cxb2 25. Qf3  and any king move allows a fork picking up the b2 pawn. White would emerge nominally one point up, but with little real chance of winning.",
        "23. Nb5": "Continuing with the plan.",
        "23... Qxe4": "Black decides to take off one of the attacking pieces.",
        "24. Nd6+": "Naturally, White did not leave the queen unguarded for no reason!",
        "24... Kg7 25. Nxe4 b6": "Denies White's knight the c5 square, in view of 25... Rd8 26. Nc5 (threatening b7) b6 27. Ne6 ",
        "26. f3": "Offering the king a route to the centre. White will need the cooperation of all three pieces to win the d-pawn.",
        "26... Rd8": "Naturally, the rook goes behind the passed pawn, both to defend and to help it advance.",
        "27. Kf2 h6": "This move is unclear to me. Perhaps Black wanted to deny the knight a route to e6 via g5, but there seems no danger in waiting until after it moves to g5 and playing Kf6.",
        "28. Ke2 g5 29. a3": "Taking a leaf from Black's book, I take a precaution to deny his knight b4, since my king intends attacking the pawn from d3.",
        "29... Kg6": "At last Black's king starts to advance towards the action.",
        "30. Ng3": "Hindering the advance of Black's king, and also eyeing the e2 square.",
        "30... Kf6 31. Kd3": "Objective attained.",
        "31... Ke5": "But Black's king has arrived in time to defend.",
        "32. Rc1": "I considered both this move and Re1 . I didn't see much promise in lines such as 32. Re1  Kd5 33. Re4 Ne5 , so I decided to knock the knight away first.",
        "32... Na5 33. Rc7": "When in doubt, grab material. Taking the rook away from the action is risky, but it does put a psychological burden on Black, in that he now has to prove himself, otherwise he is simply down a pawn.",
        "33... Nb3": "Of course Black does not allow himself to fall into passivity with 33... Ra8 34. Rh7.",
        "34. Rxa7 Nc5+": "Now the king must retreat, and the pawn gets one square closer to promotion.",
        "35. Kd2 d3 36. Re7+ Kd4": "The moment of truth.",
        "37. Ne2+": "Instead, 37. Re3 Nb3  38. Kd1 Rc8 looks very dangerous. I decided to offer Black an ending one \"point\" up, in which, however, I would have a pawn majority on both flanks and a fair chance at drawing just by swapping off the pawns.",
        "37... Kc4": "Black either refused, or failed to notice that the knight was en prise, perhaps because it just seemed so unnatural that I would do that.",
        "38. Nc1": "And now the knight reaches its optimum square, both defending (b3) and attacking (d3).",
        "38... b5": "This move is unclear. After 38... Nb3  39. Nxb3 Kxd3 40. Re3 Kxb2 41. Rxd3 Rxd3  42. Kxd3 Kxa3 43. Kc2 Ka2 Black wins, so I would instead have to take the draw with 40. Rb7 Kc4 41. Rc7  Kb3 etc.",
        "39. Rc7": "! I first looked at 39. b4 N~ 40. Rc7  forcing the king to block the rook's defence of the pawn, but since the knight can move to a6 (40. Ra7 Rd6, or 40. Re6 Nb8) this move order is more effective.",
        "39... Kd4": "Naturally, Black must evade the pin; otherwise 40. b4 wins the knight.",
        "40. b4 Ne6": "Now the d-pawn is hanging, so Black must use this tempo move to stop White taking it.",
        "41. Re7 Nf4 42. g3": "Unfortunately, I have this resource, taking away the only square on which the knight defends the pawn.",
        "42... Nd5": "The same plan, but this move does have one slight drawback. Instead 42... Ng6 allows 43. Re4  Kd5 44. Nxd3 (and not 43. Rg7 Ne5 with good chances).",
        "43. Re4#": "The king is caught in the centre: a picturesque finish."
    },
    "url": "https://gameknot.com/annotation.pl/knightmare?gm=20864",
    "gameName": "Knightmare!",
    "players": "nuntar (1553) vs. simonspera (1496)",
    "opening": "Gruenfeld (D82), 4.Bf4"
}