{
    "moves": {
        "1. e4": "White plays e4, about as basic as it gets (I like basic for strategic purposes and find absurdly complicated openings suit more tactical play)",
        "1... c5": "I like the Sicilian myself, and find that its only downfall is that a lot of people are very good at combating it.  Sometimes when I play it I feel like I'm giving my opponent an edge because he may have a strong counter.  This is personal and in no way documented, as I have not spend much time studying openings (feedback?)",
        "2. Nf3 e6 3. c3 Nf6 4. d3 d6 5. Nbd2": "I don't think this is such a good by white, because I locks in his WSB. ",
        "5... Nc6": "A nice clean opening, giving my a slight edge via whites poor Nd2",
        "6. Nc4 d5 7. exd5 exd5 8. Nce5 Qe7": "White hands me a nice easy pin.",
        "9. d4 Ng4": "I am quite happy with this move and the following combination, effectively winning me the center. ",
        "10. h3 Ngxe5 11. dxe5 Nxe5 12. Nxe5 Qxe5+": "!",
        "13. Be2 Bd6": "This is where things start to pile up in my favor, I am increasing my hold on the center and white...is not.",
        "14. g3": "I am not sure why he did this... perhapses for lack of anything better to do (In which case this would be a weak move by him brought on by my superior position)  Personally I would be attacking my queen, even if it cost me some king safety.",
        "14... O-O 15. O-O": "White feeds me a pawn, making g3 even worse.",
        "15... Bxh3": "I accept",
        "16. Bf4": "White has finally decided to attack my queen.",
        "16... Qe6 17. Bxd6": "I love it when opponents do this, I am already at +2 and he has traded away a major piece...nothing for me to do but gain advantage.",
        "17... Qxd6 18. Re1 a6": "So here, because of whites blunder with 14.)g3, he has lost tempo because he had to move his rook and I am centralizing like an angry Russian Marxist.  \n\nThis is what I LOVE about good positional play.  When you play good position opponents tend to make bad moves that you didn't even see.  This compounds, while my hold strengthens.",
        "19. Bc4 Rad8 20. Qh5 Be6": "Central domination = easy attack turning",
        "21. Rad1 b5": "This may be zugwsang, from this point the game is mine.",
        "22. Bd3 g6 23. Qf3 c4 24. Bf1 h5": "I know this is dangerous, weakening my king, but with f5 my strategic python has its coild securely wrapped around whites deer.  Also , white has no way to break through ( I would challenge anyone to find one)",
        "25. a3": "white has finally realized that he needs to gain some space, but it is too little too late.",
        "25... f5 26. b4 f4 27. Qg2": "White is pushed yet farther back into himself.",
        "27... f3": "and again!",
        "28. Qh2 Bg4 29. Bh3 Bxh3": "I take the trade, happily increasing my share of the board.",
        "30. Qxh3 Qf6": "I'm looking to c3, but of course white see's this.",
        "31. g4 h4": "!",
        "32. Rdc1 d4 33. Qh2": "A terrible move, leaving my dangerous d pawn to his own devices.",
        "33... d3": "I couldn't believe that white let me push this pawn this far..",
        "34. Red1 Qf4 35. Qxh4 g5 36. Qh5 Kg7 37. Rca1": "I couldn't believe this either!  Whites queen has no where to go!!!\n\nThis is a good example of good strategic play forcing your opponent to blunder.  I did not even see this possibility but because white is so lacking for good places to go, he panics and looses the game.",
        "37... Rfh8 38. Qxg5+ Qxg5 39. Kf1 Rh1#": "Any and all feedback is greatly appreciated."
    },
    "url": "https://gameknot.com/annotation.pl/knights-of-honor-iv-1200-to-1499-rating-tournament?gm=28942",
    "gameName": "Knights of Honor IV 1200 to 1499 rating Tournament",
    "players": "cblazi1 (1269) vs. thegoodbishop (1305)",
    "opening": "Sicilian defence (B40)"
}