{
    "moves": {
        "1. e4 e5 2. Nf3 Nf6": "2. ........ Nf6 (the Petrov's defense, instead of defending his e pawn he attacks mine and develops a piece).",
        "3. Nxe5 d6 4. Nf3 Nxe4": "4. ......... Nxe4 (moves 3 and 4 are very standard classical Petrov).",
        "5. d3": "5. d3 chases the knight away and opens a diagonal to the queen bishop.",
        "5... Nf6": "5. Black backs his knight off to f6 and the position looks very symmetrical.  I bring my other knight out next move and this hits at e4 and d5.",
        "6. Nc3 d5": "6. ............... d5 (centralises a pawn so I do likewise next move and clear a diagonal for the king bishop).  On moves 7 and 9 we continue the symmetry",
        "7. d4 Bd6 8. Bd3 O-O 9. O-O c6": "9. ....... c6 (breaks the symmetry and defends the d pawn)",
        "10. Re1": "10. Re1 (I take control of the e file)",
        "10... Bg4": "10. To which my opponent responds Bg4 pinning my knight.  I kick it away with  h3 and his bishop moves to h4.  I wondered about the feasibility of breaking the pin with g4 as it does weaken the kingside castling position - I decided to click on the database button just to see if there was a position recorded - luckily there was and the percentage was favourable to white - the next few moves were made in conjunction with the database which ended with the exchange of bishops on d3.  They were all good solid moves, involving harassing the light squared bishop - so much so that in order to avoid a possible pawn bust up on the kingside, or if black is not careful his bishop could be trapped, the bishop exchanges itself and the white queen looks safe on d3 - I did look at the possibility of Ktg5 later on ganging up on the white h pawn but this did not materialise).  I therefore decided to accept the recommendation of the 1900s database.",
        "11. h3 Bh5 12. g4 Bg6 13. Ne5 Bxd3 14. Qxd3 Nfd7": "14.......... Nfd7 dislodges my knight back to f3 (I did consider exchanging knights but then thought that it would only help him develop the other knight and there was also the possibility of the black queen coming to h4 which could be dangerous, especially with a dark squared bishop bearing down on h2)",
        "15. Nf3 Na6": "15. Na6 threatens an incursion to b4 attacking the white queen on d3 so I prevent this with a3",
        "16. a3 Nc7 17. Bd2": "17. Bd2 (I develop my last piece and connect the rooks)",
        "17... Ne6": "17...........  Ne6 threatens Nf4 attacking the white queen)",
        "18. Qf1 Nb6 19. b3": "19. b3 (on move 18 the queen moves to f1 to shore up the kingside) - the move to b3 prevents a knight incursion on c4)",
        "19... Bf4": "20. B x f4 (there now follows a plethora of exchanges on f4)",
        "20. Bxf4 Nxf4 21. Ne2": "21. Ne2 trying to exchange knights.  Now here it comes - Rob plays the queen to f6 defending his knight.  Rob and I agreed in the chat that I should have exchanged knights here but I go and play c3?? (  whatever more question marks should be added) to back up my d4 pawn.  This takes away the defence of the d3 square allowing his knight to go to d3 and discover an attack on my hanging f3 knight and threatens the rook on e1 - I give up the exchange and play on for just a few more moves but I resigned when I knew that I was going to be at least 3 material points behind with no counterplay) - it is such a shame that the game had to end in this way and I hope I can give Rob a better show later on.",
        "21... Qf6 22. c3 Nd3 23. Nh2 Nxe1 24. Rxe1 Rfe8 25. f4 Qe7 26. a4 Qa3 27. Rb1 Qa2 28. Ng3 Re3": ""
    },
    "url": "https://gameknot.com/annotation.pl/knights-and-oversights-part-1?gm=11790",
    "gameName": "Knights and Oversights Part 1",
    "players": "jstevens1 (1525) vs. rt4sm (2037)",
    "opening": "Petrov (C42), French attack"
}