{
    "moves": {
        "1. c4 Nf6 2. Nc3 g6 3. g3 Bg7 4. Bg2 O-O 5. d4 d6 6. Nf3": "All book so far ...",
        "6... c6 7. O-O": "What started as an English opening has transposed into the fianchetto variation of the King's Indian. Black's normal KID plan of attacking on the K-side is very difficult against the white fianchetto setup, so instead black should look for play on the Q-side in this variation",
        "7... Qa5": "Next black wants to play ...Nd7 and ...c5, opening up the a1-h8 diagonal where his B on g7 will support his play on the Q-side.",
        "8. e4 Bg4": "If 8...Nd7, black will have issues with the development of his light-square bishop, so we swap him for white's N of f3, with the added benefit of weakening the d4 square.\n",
        "9. h3 Bxf3 10. Bxf3": "10.Qxf3?! Nfd7 followed by 11...c5 is fine for black, for example, 10.Qxf3 Nfd7 11.Be3 c5 12.d5 Ne5 13.Qd2 Qb4 with good play for the black pieces.\n\n\n",
        "10... Nbd7 11. Qe2": "I was expecting 11.Be3, after which 11...c5 gives black a comfortable position. I've played that position dozens of time in OTB tournaments, but that was probably before my opponent was born ;)  11.Qe2 throws a wrench into black's plans, as now 11...c5 fails miserably to 12.e5! and if black is lucky, he'll only lose the b7 pawn.",
        "11... e5": "?! Lame attempt to substitute the e-pawn for the c-pawn. Instead I should have played the simple ...Ne8, after which ...c5 is back on.\n",
        "12. d5 cxd5 13. cxd5 a6": "?! Weakening the Q-side dark squares. I was concerned with Nb5, going after the weak d6 pawn, but I think I can play 13...Rfc8 right away, and on 14.Nb5 Bf8. \n",
        "14. a3": "This similarly weakens the light squares on white's Q-side. Unfortunately for me, I don't have a LSB to take advantage of them.\n",
        "14... Rfc8 15. Be3 Qd8": "I decided the dark-square bishops had to go, otherwise, thanks to my lame ...a6 move, I'd be saddled defending the Q-side dark squares the rest of the game.\n",
        "16. Rac1 h5": "The plan is ...Nh7 / ...Bf6 / ...Bg5.\n",
        "17. Kg2 Nh7 18. Qd2 Nc5": "White's previous move gives me some tactical possibilities.\n",
        "19. Qc2 b5": "? Total waste of time, and gives white good play on the Q-side. The other moves I considered were ...Ng5, putting pressure on e4, and ...Bf6 continuing with my original plan to swap DSB's. I discounted 19...Ng5, since after 20.Bd1, taking on e4 loses material for black, and now my N is in the way of exchanging bishops, and after 19...Bf6 20.b5 Nd7 21.h4 I wasn't sure I liked 21...g5. Later on, I found 19...Qf8!?, with the idea to play either ...Bh6 or ...f5, for example, 20.b4 Nd7 21.Qd2 f5!? which should give black good play.\n",
        "20. Qd1 Bf6 21. h4 Be7": "? I was giving a lot of consideration to ...g5, and took advantage of the closed position to make \"waiting moves\" that would give me a couple of extra days to think it over and maybe come up with a workable plan. Playing without a plan sucks.\n\n",
        "22. b4": "White takes advantage of my passive play to grab some initiative on the Q-side.",
        "22... Nd7 23. a4 bxa4 24. Nxa4 Rxc1 25. Qxc1 Rc8 26. Qd2 g5": "I don't have any choice now, but I'm pretty sure I can hold the position if the DSB's get swapped, as I'll have two N's and a compact pawn fortress on the central dark squares, and white will only have the single N to challenge it.\n",
        "27. Bxh5 gxh4 28. Bg4": "?! I think a better try for white is to open the g-file with 28.gxh4 Bxh4 and now 29.Bg4, intending Rg1 and Bf5 before black can untangle his pieces.\n",
        "28... Rb8 29. Rc1 hxg3 30. fxg3": "Now the g-file is sealed, so white will have a hard time making anything happen on the K-side.\n",
        "30... Bg5": "Finally forcing the exchange of bishops!",
        "31. Bxg5 Nxg5 32. Bf5 Kg7 33. Nb2 Nb6": "Keeping the white N out of c4. Black's d-pawn is still a worry.\n",
        "34. Rh1 Qe7 35. Nd1 Rh8 36. Rxh8 Kxh8 37. Qe2 Kg7": "Now black builds a fortress. If I can exchange queens, the extra white b-pawn will be meaningless as it can be blockaded on b6 and white will lack sufficient material to control that square.\n",
        "38. Qxa6 Qc7 39. Qe2 Kf8 40. Qe3 f6 41. Qc3": "It's hard to keep the Q's on the board when black controls the c-file, for example 41.Nf2 Ke2 42.Qd3 Qc4. After the Q exchange, I was pretty confident that the game would end in a draw.\n",
        "41... Qxc3 42. Nxc3 Ke7": "Black's plan is dead simple: keep as many pieces on dark squares as possible, and use the N's to prevent the white K from infiltrating.",
        "43. Kf2 Kd8 44. Bg4 Nc4 45. Ke2 Kc7 46. Kd3 Nb2+": "Driving the W king back from whence it came.\n",
        "47. Kc2 Nc4 48. Be2 Nb6 49. Kd3": "\n",
        "49... Kd7 50. Bg4+ Ke7 51. Nd1 Na4": "White would like to put black in zugzwang so that her K can go to c4, but black just has too many squares to play on.",
        "52. Ne3": "Note that white has to be careful not to blunder away her e-pawn, otherwise it's black that has the winning chances!",
        "52... Nb2+ 53. Kc2 Na4 54. Nf5+ Kd7": "There's no good discovery.\n",
        "55. Be2 Kc7 56. Bb5 Nb6 57. Kd3 Nc8 58. Ke3 Nb6 59. Ne7 Kd8 60. Nc6+ Kc7 61. g4 Nf7 62. Be2 Na4 63. Ne7 Nh6": "Keeping the white N out of f5.",
        "64. Kd3 Nb6 65. Kc3 Nc8 66. Nf5 Nxf5 67. gxf5": "Now black's task is even easier!\n",
        "67... Nb6 68. Kd2 Kd8 69. Bb5 Kc7 70. Ke3": "Draw agreed.\n"
    },
    "url": "https://gameknot.com/annotation.pl/koh-tournament-v11-masters-tourney?gm=37051",
    "gameName": "KOH Tournament V11 Masters Tourney",
    "players": "brigadecommander (2211) vs. hityerclock (2184)",
    "opening": "English opening (A16)"
}