{
    "moves": {
        "1. d4": "So after a win in round 2 (see my last annotated game,) I eventually managed to win on time in round 3, so with 2.5 out of 3 I was paired against this guy, the tournament's strongest player, who went on to win the tournament outright with 4.5 out of 5, conceding a draw to the second highest ranking player in the last round. I was the third highest ranked player in the tournament, and so to lose the last two rounds and only finish on 50% was a bit of a disappointment, although the games are not sent for grading or anything.",
        "1... Nf6": "We both rattled out the first few moves.",
        "2. c4": "Incidentally this was reconstructed after the game, and I am not 100% sure of the move order.",
        "2... g6 3. Nc3 Bg7 4. e4": "Reaching a standard King's Indian Position. https://en.wikipedia.org/wiki/King%27s_Indian_Defence",
        "4... d6 5. f3": "As usual I play the Sämisch Variation, named after Friedrich Sämisch, who developed the system in the 1920s. This often leads to very sharp play with the players castling on opposite wings and attacking each other's kings.",
        "5... O-O 6. Be3": "Standard development.",
        "6... Nc6": "Black plays the Panno Variation: 6...Nc6, named after Oscar Panno, is a sharp and highly theoretical system which can lead to very complicated play. Black holds back the c-pawn for the time being, and aims to put the knight on d4. The immediate plan is to prepare queenside counterplay with ...a6, ...Rb8 followed by ...b5.",
        "7. Nge2": "The usual way of meeting it, so that if 7...e5 black can't play Nd4. After 7. Qd2 e7 8. d5 Nd4! with advantage to black because if 9.\tBxd4?\texd4\n10.\tQxd4?\tNxe4",
        "7... a6": "Again the usual move.",
        "8. Qd2": "White prepares to play 0-0-0 in some variations.",
        "8... Rb8": "Black is preparing b7-b5 should white castle on the queen side.",
        "9. Nc1": "Opening up the diagonal for the Bf1.",
        "9... e5": "Taking advantage of the white knight moving away from e2.",
        "10. Nb3": "I played this quickly without thinking. I thought it was the standard move in this variation, but I see now that 10. d5 is more commonly played, and does get better results.",
        "10... exd4": "He takes.",
        "11. Nxd4": "I take back.",
        "11... Nxd4": "He takes again.",
        "12. Bxd4": "I take back.",
        "12... b5": "He is trying to open files on the queen-side.",
        "13. c5": "Played with the hop of keeping the a and b files closed.",
        "13... b4": "He hits my knight.",
        "14. Nd1": "Knight retreats.",
        "14... Re8": "Rook develops.",
        "15. Bc4": "I thought that I was developing the Bf1 to an attacking post, but this may very well be a losing error. What does black play now?",
        "15... Nxe4": "Black also had an alternative in 15.....d6-d5 but it \"only\" seems to win a pawn after 16. Be2 dxe4 17. 0-0 and Fritz regards the position as plus .74 for black, and indeed, after a few minutes prefers 15.... Bb7 as the second best move for black (+.77) while it regards the position as +2.37 for black after this move. Now if I take the knight 16. fxe4 Rxe4 and if I save the bishop on d4 with 17. Be3 Rxc4. So I thought that if he is winning the knight back anyway, I may as well take the pawn with check to maintain level material.",
        "16. Bxf7+": "So I take.",
        "16... Kxf7": "He takes back.",
        "17. Qf4+": "I threw in a check. I was rather surprised that he just didn't retreat the knight with a discovered check, but what he played was good enough.",
        "17... Kg8": "Which was simply to retreat the king. Firitz actually thinks this is the best move.",
        "18. fxe4": "I took his knight.",
        "18... dxc5": "I am not sure why he didn't simply take my bishop on d4.",
        "19. Bxc5": "So I take back. This is in fact a mistake. Black could have kept his deficit to managable proportions by just giving up a pawn and exchanging on g7 and then castling.",
        "19... Qd3": "Threatening to take the e pawn and stopping me from castling. Fritz prefers 19....Rb5 or 19....Qd5",
        "20. Nf2": "Protecting e4 and attacking the queen. What would you do as black now?",
        "20... Qb5": "Again Fritz prefers 20....Bc3+! 21. bxc3 Qxc3+ 22. Ke2 Be6 and black has a raging attack.",
        "21. Qxc7": "And this is yet another mistake! Best for white according to Fritz is 21. Qe3 Bxb2 22. Qb3+ Be6 23. Qxb2 Qxc5 24. 0-0 and white is still in the game, a pawn down. Fritz also prefers 22. Qc1",
        "21... Rb7": "He attacks my queen.",
        "22. Qd6": "I try to stay protecting my bishop, but....",
        "22... Bf8": "And white has to give up the bishop. I would normally resign here, but at 25 minutes each, and no increment, who knows what may happen? I played it out quickly, until I was mated eventually. I the last round against Jacek Bylica I evenutally lost, trying too hard to win. Thanks for reading, please leave a comment or two and rate this annotation on the star system. Until next time dear reader!"
    },
    "url": "https://gameknot.com/annotation.pl/krakow-quick-play-round-4?gm=63425",
    "gameName": "Krakow Quick Play Round 4",
    "players": "Charles L Higgie (1918) vs. Andrzej Gbyl (2221)",
    "opening": "King's Indian (E84), Saemisch, Panno main line"
}