{
    "moves": {
        "1. e4 c5": "east-indian.",
        "2. Nf3 d6 3. h3": "unknown variation to me. Not sure I see the point for this move.",
        "3... Nc6 4. c3": "considerably breaks the knight moves.",
        "4... Nf6 5. Bd3": "that is a complete surprise.",
        "5... e5": "I felt comfortable with this, though d6 seems weak: white is so closed, that black has to take advantage of it and move on",
        "6. Bc2": "bishop has already 2 moves and does not seem to be clearly pointing something interesting. ",
        "6... Be7 7. O-O O-O": "well, yes, both bishops and the queen are pointing to king side, but with so much obstacles, and pointing to h6 and 7, is it really pointing?",
        "8. d3": "one more obstacle for lBc2",
        "8... Be6 9. Nbd2 h6": "preventing",
        "10. Bb3": "probably discovering his bishop is worthless; tries to exchange with advantage by queen development. I won't help",
        "10... Qd7": "actually my idea was to take back with f7 if ever needed, to open f column.",
        "11. a3": "??",
        "11... b5": "well, let's go: white seems not to have any  plan. Mine was to take advantage of my own progression.",
        "12. Bc2": "getting back home? Is White some kind of a hedgehog?",
        "12... a5": "f won't open => let's open a-b-c",
        "13. Qe1 a4": "preparing b4",
        "14. Nh2": "Ah, finally, proposing an opening on f4?",
        "14... Nh5": "closing it",
        "15. Ndf3": "?? that was the idea?",
        "15... f5": "then I open f-column; i also have all my officers ready to point there, except Nc6",
        "16. Be3": "pointless",
        "16... f4": "the space is getting darker",
        "17. Bd2 Rf6": "preparing Rg6 or, if Nh4, then g5. I calculated Bxh3 was prematurate",
        "18. Qe2": "i guess Black saw a potential Nxe5 dxe and Qxh5",
        "18... g6": "with the idea to get back to Ng7, then g5, g4",
        "19. g4": "but it won't be necessary: white offers me the opening.",
        "19... fxg3 e.p.": "if fxg, then Nxg3",
        "20. Ng4": "at least gains one more pawn",
        "20... Bxg4 21. hxg4 Qxg4 22. Bd1": "surprise, but not a bad one: this really underestimates the next move.",
        "22... gxf2+ 23. Kxf2": "the less worse.",
        "23... Rf7": "i considered Rxf3, but it lead to equalizing, without profit.",
        "24. Rg1": "pretty sure Ke1 was better",
        "24... Bh4+": "then if Kf1, Ng3+ Rxg3 Qxg3 is the best solution, but...",
        "25. Ke3 Qf4#": ""
    },
    "url": "https://gameknot.com/annotation.pl/krikkes-mini-tournament-iii?gm=57099",
    "gameName": "krikke's mini-tournament III",
    "players": "chief_huerta (1529) vs. thitho (1635)",
    "opening": "Sicilian (B50)"
}