{
    "moves": {
        "1. d4 b6 2. Bf4 Bb7 3. Nf3 e6 4. Nbd2 h6": "Passive play by black allows me...",
        "5. e4 g5 6. Bg3": "It's interesting to see what I'll play against g4... maybe Bh4 and Ng1? But he went for...",
        "6... Bg7 7. c3 Nf6": "Here, my e4 pawn is threatened, and Bd3 seems the most natural move. Instead, I went for something else.",
        "8. h4": "This is a mistake, since after g4, Nh2 I'll be squeezed by black pieces. But he played...",
        "8... Bxe4": "...that was exactly what I thought he'd have done. So...",
        "9. hxg5 hxg5 10. Rxh8+ Bxh8 11. Nxg5": "...and I'm fairly satisfied. The lsb is threatened, and maybe d5 was the better move. Still, black can now hardly defend his kingside, and if Nf6 is used in the exchanges, Qh5 will be very annoying for black.",
        "11... Bg6": "Here, I envisaged a plan to catch the Nf6. Let's see if it works:",
        "12. Qf3": "Threatening Ra8, so I have a tempo.",
        "12... Nc6 13. Bh4": "This is the key move: now, after Ng-e4, black loses a piece.",
        "13... Qe7 14. Nge4": "Got it! Black's N is pinned and attacked 3 times...",
        "14... Bxe4 15. Nxe4": "...all the same.",
        "15... Nxd4": "Good try. Now, he wants to put me in trouble with his Q's check. I considered it and accepted it, since after Ne4xNf6+, I win the Ra8 with check. But I'm not so good at this, so I played...",
        "16. cxd4": "??",
        "16... Qb4+ 17. Nc3": "Allows Qxb2, but QxRa8+ is also coming. I won't have played it, nevertheless: 17... Qxb2, 18. QxRa8+, Ke7, 19. QxBh8, QxRa1+, 20. Kd2 etc. and he can get some annoying series of checks with the Q. Still, I'll be up and threatening BxNf6#.",
        "17... Nd5": "It won't be a nice game if my opponent wouldn't play the best moves. Now my best answer is...",
        "18. O-O-O": "! He can still play Bxd4, and probably it was winning! It is a little complicated to me to figure out how the game could have gone.",
        "18... Rc8": "Still dreaming of an attack...",
        "19. Nxd5 exd5": "Qe3+ comes to mind, but then I couldn't see the winning sequence, so I went for...",
        "20. Qxd5 c5": "...since I saw a nice move here: ",
        "21. Bc4": "! ... Qxf7#, so the attack following cxd4 was not good enough. Moreover, this move prevents BQ to defend e7.",
        "21... Qxc4+": "Only move.",
        "22. Qxc4 Rc6": "Best move now was d5. I played, naively...",
        "23. Re1+": "If Re6, RxR and the game is over. Still, to prevent it with d5 was more accurate.",
        "23... Kf8": "Not rushing into Be7+, Kg8...",
        "24. d5 Rg6 25. Be7+ Kg8 26. g3": "Black is busted, of course. ",
        "26... Bd4": "Attacking my f2 pawn? Seriously?",
        "27. Bh4": "Opening the way to my R.",
        "27... Bxf2": "? It was more difficult for me to win after Kf8, looking for a repetition.",
        "28. Re8+ Kh7 29. Re7 Kg8 30. Qf4": "...and here he threw the towel. Thank you for reading!"
    },
    "url": "https://gameknot.com/annotation.pl/fairly-good?gm=65344",
    "gameName": "Fairly good...?",
    "players": "damafi (1523) vs. chessbell (1608)",
    "opening": "Queen's pawn (A40), English defence"
}