{
    "moves": {
        "1. e4 e5 2. f4 d5": "The voting started right here.  supersparksky: OK Guys,\nit's our move! any suggestions?  archduke_piccolo: Accept...\n... the counter-gambit: 3.exd5.\n\nI find that GM Magnus Carlsen was playing King's Gambits ten years or so ago.  thewrongreason: That's also my vote. ",
        "3. exd5 e4": "archduke_piccolo: Move 4...\nI suggest (and vote for) 4.d3, here, forcing the exchange of Black's advanced pawn. This is the 'standard' move in this line. One could play 4.Nc3, developing a piece, and I won't object if the vote goes that way. But the QP advance also goes to development, as after the pawn exchange, all White's minor pieces will be free to move.\n\nIt is extremely unlikely that Black will play 4...Qxd5, as THEN, 5.Nc3 will attack the Queen, and pick up the e-pawn with the knight. In that case White will have a lead in development, and much the greater hold on the centre.",
        "4. d3 Nf6": "supersparksky: Ok Guys Black Plays 4....Nf6\nsuggestions with analysis welcome!  redfoxrising: 5. Nc3 development on Q side, She has 2 open Bishops and can castle 0-0 quickly.\nDoes anyone see a line for us to get castled?  supersparksky: I feel we need to remove her e-pawn now before it becomes a nuisance this also undoubles our pawns on the d-file and reduces her threat with ...Bg4.  redfoxrising: I'll agree to 5 pxe4.  archduke_piccolo: Ditto...\nThe purpose of the move to d3 was to exchange off the Black e-pawn, so let's have at it.  thewrongreason: I'm glad to participate, Ron. The main reason is because ION's involved. Having said that, I would agree with Ron's assessment with 5.Nc3. If it weren't for the votes, and I had this position, this is what I would play as white. But, because of why ION voted for the previous move which was to exchange, the only way we can do this is with 5.dxe4, so that is also my vote.",
        "5. dxe4 Nxe4": "archduke_piccolo: A couple of goodish moves here.\na] 6.Nf3 - the 'natural' move;\n\nThis move obviates any shenanigans arising from 6...Qh4ch (though we can look at the consequences of that anon).\nA likely continuation is:\n\n6.Nf3 Bc5 (placing pressure on f2)\n7.Qe2 Bf5\nDisplacing the King by 7...Bxf2ch seems a bit risky playable on account of 8.Kd1 f5 9.Nd2 Bc5\n10.Nxe4 fxe4 11.Qxe4ch ... and White emerges from the ruck with two extra pawns. If instead 8...Qxd5, then White plays the KING's Knight to d2: 9.Nfd2! f5 10.Nc3 Qd4 11.Nxe4 ... with a pretty tactical sort of game ensuing.\n\n8.Nc3 Qe7\n9.Be3 ... Looks OK for White.\n\n\nb] 6.Be3 - a provocative move. This might be fun:\n6...Qh4ch\n7.g3 Nxg3\n8.Nf3 ...\nNow Black has two options, here:\n\nb1] 8...Qe7\n9.hxg3 Qxe3ch\n10.Qe2 ...\nAfter which, one way or another the queens come off, and (in my view) White is left with the more active position .\n\nb2] 8...Qh5 (this looks like fun...)\n9.hxg3 Qxh1\n10.Qe2 Bh3\n11.Nbd2 Bxf1\n12.Nxf1 ...\nFor the exchange, White has a very active looking position, with all sorts of interesting chances.\n\nI'm going to vote for 6.Be3, but I won't complain if the team prefers 6.Nf3.  redfoxrising: Team vote option 6.Nf3\nI'm voting for 6. Nf3 as this option is the least complicated and most natural move. The move 6.Be3 is explained well and it may come up by move 9 in Ion's projection. I want our next move to be considered by Joe that both moves are goodish and that Ion is not going to complain if we op for the natural move. Conversely I'm interested in what Dave's suggested vote might be. I'm ok with what ever the vote is. As I see it, the 2 choices are both acceptable to avoid Qh4+.  thewrongreason: So, I was looking at this. And, in most cases, I'd prefer 6.Nf3, but this is how I learn, which ION's familiar with. So, I had to play through, ION's variations. I had a little bit of a difficult time fully understanding the 6.Nf3 variation. The reason being is that after 6.Nf3 Bc5 7.Qe2 7...Bxf2 is not playable because a capture cannot be made on f2. 7...Bf5 is, but after 8.Nc3 Qe7 9.Be3, I don't know where else we'd go or what it will lead to. ION did say it would be ok, but there's more variations to play with, after 9.Be3. I see where that would go and how, we might even end up with a small advantage. That is why I'm going to vote for 6.Be3.  redfoxrising: After a goods nights sleep it was refreshing to review\nThe options for our next move 6 are still on the table and I stay with my vote. Ion thanks for the clarity you provided. I'm still looking at xg3 followed by Qxe3+. I'm posting now, but will still review more.  supersparksky: @ Ion\nI have Studied your analysis on our position and still feel our best option is Main line 6.Nf3, after your line 6.Be3 I don't feel black will reply Qh5+ but more likely to reply 6...Be7. with a view to early castling.",
        "6. Nf3 Bc5": "redfoxrising: 7. Qe2\nneed to combat the threats to the f2 square 7. Qe2 is my suggested vote.  supersparksky: 7.Qe2\n7.Qe2 is our only move  redfoxrising: I agree\nWe should discuss our next moves... Qe2 and then what ifs moves she makes.   looking at future moves...\n7.Qe2\nBf5\n\n8.Be3 or another move...\nO-O She could castle\nNot so sure that we should Castle 0-0-0.\nWe might be able to castle 0-0. if we get our LSB out.  archduke_piccolo: 7.Qe2 Bf5\nI suggest build up against e4 by\n\n8.Nfd2.\n\nWhy the king's knight instead of the queen's? We want the other knight to go to c3 when (if?) Black plays 8...Qxd4. To be sure, Black will want to play ...Bf2ch, but that's fine. Off to d1 our king goes.\n\nThe line, in summary:\n7.Qe2 Bf5\n8.Nfd2 Bf2ch\n9.Kd1 Qxd5\n10.Nc3  thewrongreason: If I had this position and were white, I'd answer with 7.Bd3, and when the N would retreat, I'd then castle. But, I agree with the others for a completely different reason. So, my vote is 7.Qe2, simply because it pins her Ne4 with a not so easy way out.\n",
        "7. Qe2 Bf5": "supersparksky: Continue with Main line 8.Nc3  redfoxrising: I agree\n8. Nc3 is my vote to continue.  thewrongreason: I also concur and vote for 8.Nc3",
        "8. Nc3 Qe7": "thewrongreason: I'm not sure what the best move is. But, my vote, for now, is 9.Qb5+ which appears to win the b7 pawn, unless it's poisoned. My thinking is that, if it's not, it'll be difficult for Janet to keep her Ra8 protected. Then, again, there's something I might be missing which could make it unsound. But, what's going through my mind is what damage we might be able to cause for Janet.  archduke_piccolo: Just about...\n... the only thing that's played here is 9.Be3.\n\nThe idea is to obviate further threats against f2. The justification is 9...Nxc3 10.Bxc4 Nxe2 Bxe7.\n\nSo I'll be voting 9.Be3.  thewrongreason: In that case, I change my vote to 9.Be3  redfoxrising: As previously discussed move 9.\nmy vote for 9 is Be3.  archduke_piccolo: The problem...\n... with 9.Qb5ch is that 9...c6 is such a strong reply. The pawn at b7 gets protection from the queen at e7, and White's queen is under attack. And 10.dxc6 would not be possible on account of 10...Nxc3ch, winning the queen. The queen would have to go back to e2. I seems that 9...Nd7 would also be strong, as after 10.Qxb7?? ...Nd7ch or ...Nc6ch is curtains for White.",
        "9. Be3 Bxe3": "thewrongreason: This is different then what ION mentioned in the variations, since it would be if Janet took with the N, instead. And, if she did, I would've still voted for 10.Nxe4 since he discussed. But, because the capture was different then I anticipated, I vote for 10.Qxe3. Of course, this would likely change, if ION thinks that we should play something different.",
        "10. Qxe3 Nxc3": "redfoxrising: my thoughts\nTrade Q's\n\n10.Qxe7+ Kxe7\n11.bxc3  supersparksky: 11.Qxe7 is our only feasible move!  thewrongreason: It appears that we also have 11.Qe5 because of our Nf3. But, I like 11.Qxe7+ the best since Janet will lose her right to castle. So, taking there is also my vote. And, I agree with Ron's variation when she recaptures.  supersparksky: @jkarp\nIf we play 11.Qe5??..Qxe5+ 12.Nxe5..Nxd5 and we are a piece down!  thewrongreason: Yeah. I overlooked 12...Nxd5 Exchanging is all we can do, anyhow.\n",
        "11. Qxe7+ Kxe7": "redfoxrising: 12. bxc3 taking the minor piece  thewrongreason: I agree with Ron. Taking back on c3 is our only move. It's then a question of what we'll be able to do with the doubled pawns, later on. But, for me, nothing else comes into consideration, besides, 12.bxc3, so that's my vote.",
        "12. bxc3 Bxc2": "thewrongreason: My vote is for 13.Be2 Even if we don't play that, I think that getting our Bf1 into play is very important. As, I think that we should focus on castling short. Then, we can focus on something like Re1 later on, where the R will be in a dangerous spot.  redfoxrising: few ideas\nbc4 protects pd5\n\nto allow castling....\n\n------------------------------------\n\nNe5 to attack the center for a better outpost position Kd6 unlikely but … then Nxf7 ch\nNe5 then I suspect her to reply Nd7 opposed to Na6 on the rim.\n\n--------------------------------------\n\nKd2 gets us closer to linking our Rooks if we decide not to castle, and immediately attacks the LSB limiting it relocate to a4,e4,f5,g6.  supersparksky: 13.Kd2 for me\nQueens are off so best position for Kings are centre board  thewrongreason: I generally wouldn't want to play something like this since it's not quite an endgame yet. And, we haven't castled. But, I change my vote to 13.Kd2 because of what Dave just posted.  redfoxrising: I agree with 13 Kd2\nmy vote will be 13. Kd2",
        "13. Kd2 Bf5": "thewrongreason: Unless Dave thinks otherwise, my vote for now is 14.Bd3. I feel that our Bf1 is less then active then Janets Bf5 since we're undeveloped. So, my idea behind this move is to exchange, which I feel would benefit us.  redfoxrising: Move 14 suggestions\nfew move suggestions...\n\nKe3 stay move up as our Queens are off the board!\n\nBd3 as Joe suggested will link our Rooks then get then to open files. Not sure if exchanging is a benefit to us at this point, might lead to a draw.\n\nNe5 to get a better outpost  supersparksky: Lets take charge of the e-file first,\n14.Re1+  archduke_piccolo: I'm easy...\n... except that I'd rather keep the bishops on. So I'm not keen on 14.Bd3, though it is quite playable.\n\n14.Re1ch Kf6 (say) 15.Ne5 looks OK for White. But I'd be happy enough with 14.Nd4 or Bc4. Even Be2 has its points.  thewrongreason: Well, I like to agree with ION, but I would not object to 14.Re1+ due to what Dave mentioned. By, I change my vote to 14.Bd3 redfoxrising: I'll support 14. Re1ch\nGo for the e-file\nMy vote 14. Re1ch  thewrongreason: Wait, I misread, ION didn't say 14.Bd3, actually. He said, 14.Nd4 or 14.Bc4. And, of those 2 moves, I'd say 14.Nd4 which is my vote. If I didn't see the point, I'd agree with Re1ch, but bringing the N to d4 attacks the B. But, having said that, the only other move I'd take into consideration would be checking on e1. My real question is where do we go after checking with the R?",
        "14. Re1+ Kf6": "redfoxrising: 15. Bc4\nlost my suggested votes so instead of 4 ideas I'll go with 15. Bc4 to get our LSB protecting our pawns and linking our R's\n\nI was looking at a mess from playing 15. Ke3 Re8 ch it put us in and I thought we might get mated while going thru the analysis of the board. That did not happen but I was just making sure.  thewrongreason: I like what we played, but I usually go by what ION said. I considered Dave's suggestion but just didn't see where we would go, afterwards. Having said, I'm thinking about what to do right now. And, I like the idea of 15.Nd4, actually. But, I'm going to agree with Ron here, so my vote is for 15.Bc4 simply to complete our development. That might change, if ION or Dave come up with another suggestion.  supersparksky: How about 15.Ne5...  redfoxrising: I'll go with 15. Ne5 as well  archduke_piccolo: Yes.\nI like 15.Ne5 as well. But I would have no mortal objection to 15.Bc4.  redfoxrising: both are decent moves with that said and Joes comments looks like we should make our move. ",
        "15. Ne5 h5": "supersparksky: My suggestion is now 16.h3  archduke_piccolo: Quantifiable advantage...\nAt the moment White has imposed a bind on the Q-side, unless Black is prepared to risk minor piece exchanges on a6. But it's not easy to find a positive plan. The suggestion by supersparksky offers the possibility of a general advance on the K-side, with, of course, suitable preparation: h3, Bc4, g4 is the basic idea, I think.\n\nI'll go with 16.h3.  thewrongreason: It's something that I don't understand with that operation. And, it's a similar position to what I saw in Charles annotation with his draw against the Master. But, with that comes my vote for 16.h3 for the reason that the other 2 mentioned.  redfoxrising: 16. h3 for sure!!!",
        "16. h3 c6": "supersparksky: I propose we play 17.d6  redfoxrising: Can someone do some analysis?\nc4\nd6\nAnything else?  thewrongreason: I was wondering that to, Ron. And, for me, that's a good thing because asking for analysis means that your lost. When I get lost, it means that I'd already be lost, if this were not a consultation game, and I was playing the game. Anyhow, I am also going to vote for 17.d6  archduke_piccolo: After looking at...\n... 17.c4 and 17.Bc4, I'm beginning to like the look of 17.d6! Though it looks vulnerable at first sight, it is more robust than it appears. E.g., if Black tries 17...Re8, we have 18.g4.\n\n17.d6 Rd8!?\n18.g4 Rxd6ch\n19.Kc1 Be6 (not wanting to open the h-file)\n20.f5 Bxa2\nalternatively, 19...Be6, 20.Rg1.\n\n20.Rh2 Bb3 (say)\n21.Rb2 Rd1ch\n22.Rxd1 Bxd1\n23.Kxd1 Kxe5\n24.Rxb7 ...\nAnd White still looks to have something of a bind on the Q-side.\n\nIs Black likely to seek an alternative?\nProbably\n\n17...Nd7!?\n18.Bc4 ... (exchanging knights looks good for Black)\n18...Nb6\n19.Bb3 Rhd8\nand we can choose from 19...Nxf7 or 19...gxh5 (19...g5 doesn't seem to give us much)\n\nI'll cast my vote for...\n17.d6.  redfoxrising: I'll support 17. d6\n",
        "17. d6 Rd8": "supersparksky: 18.g4 is my sugestion  archduke_piccolo: Seconded...\n18.g4 was what I reckoned as well.\nSee possible line in my posting 21 Apr 20, 15:02.  thewrongreason: 18.g4 is also my vote.  redfoxrising: 18. g4 as well as line shown above",
        "18. g4 Rxd6+": "redfoxrising: 19. Kc1 as discussed is my vote",
        "19. Kc1 Be6": "brigadecommander: Black is in deep trouble.Well played  thewrongreason: As I know by myself, I have little experience. And, I would already be mated as white, if I were playing this side since it was at professional level. So, with what Janet posted, combined with, what I saw in a game with TA, and what I studied with Coach Stockel, I'm going to vote for 20.g5+. As it shows how important pawn chains are, as they are well connected, as opposed to, isolated. But, my vote, of course, will change if ION or Dave think that we should do something else.  archduke_piccolo: Two options...\n20.f5 and 20.Rg1.\n\nI don't go for 20.g5, as that tends to give the Black bishop some squares - especially f5. I think I'd rather keep control of that square, OR, if we are to let it go, play 20.gxh5 instead. But I think we can do better than either.\n\n20.Rg1 is unexceptionable, and if others prefer that move, I won't object.\n\nBut I'm going to plug for 20.f5. I've actually run through the likely continuation before:\n\n20.f5 Bxa2\nBlack is not blessed with an overabundance of choice, here. Neither retreat moves look enticing; ...Bd5 wouold be met by 21.c4. So...\n\n21.Rh2 ...\nMobilizing the rook with tempo. Now, if 21...Bd5, 22.c4 seems to win us the bishop, so...\n\n21...Bb3\n22.Rb2 ...\nA skewer on the b7-square.\n\n22...Rd1ch\nA spectacular method of forcing exchanges to save the bishop. Instead, ...Ba4 takes the bishop off the a2-g8 diagonal, whereat 23.Rxb7 gains a tempo, od White might consider 23.Bc4.\n\n23.Rxd1 Bxd1\n24.Kxd1 Kxe5\n25.Rxb7 ...  In this position, White is for the moment a pawn down, but has a bind on the Q-side. This can be broken, but only at the cost of Black's K-side being annihilated.\n\nI think this line offers promising chances.  thewrongreason: That also appears to have a better pawn connection. And, that's without going through enough variations. So, I'll change my vote to 20.f5  redfoxrising: my vote is 20. f5 ",
        "20. f5 Bxa2": "thewrongreason: Complicated position which will make it great for sleeping tonight. I would've voted to exchange LSB's, but I don't think it's a great idea. With me getting to the lost, or what someone once called the boring moment, I'll vote to complete our fianchetto with 21.Bg2. As that way, we can also get our Rh1 into action which I think will later be dangerous for the monarch.  archduke_piccolo: Well...\n21.Bc4, as suggested Joe tentatively suggests could be worth a look. It does force off the bishops-\n\n21.Bc4 Bxc4\n22.Nxc4 Rd8\nI think this rook retreat might be forced, to prevent 23.Re8, but what then for White? I keep looking at pawn sacs for a K-side attack, but there doesn't seem to be the weight. Otherwise, I can't yet find a follow-up.\n\nAgainst that, we would quite like to see our bishop settle on c4 - and survive the hazards. That means that Bg2 is contra-indicated. It also means forcing the enemy bishop from the a2-g8 diagonal. At the same time let's get our most idle piece, the h1-rook into motion:\n\n21.Rh2 ...\nattacks the bishop on a2, which will have to move. 21...Bb3 is the likeliest, as Black won't feel too chuffed about 21...Bd5 22.c4. And after...\n\n21...Bb3\n...let's thump it again:\n\n22.Rb2.\nAfter this, Black can force a series of exchanges, but we get to equalise the material, and in the ending have the bishop vs knight on an open board, with the more active pieces besides.\n\nMy vote: 21.Rh2.  thewrongreason: I change my vote to 21.Rh2, and it's not just because it's ION votes. I like the idea of 21.Rh2 since B is attacked, and I'd love to get material back.  supersparksky: 21.Rh2\nlooks good to me!  redfoxrising: I vote for 21.Rh2\nThanks for analysis by Ion!",
        "21. Rh2 Bb3": "redfoxrising: 22. Rhb2 is my vote  archduke_piccolo: Seconded. Skewers the b7-pawn.",
        "22. Rb2 Rd1+": "thewrongreason: My vote is for our only legal move, 22.Rxd1. Although, I forgot, but it should be a good thing because of what ION noted a couple of moves back.  archduke_piccolo: Only move...\n... 23.Rxd1\n\nI don't think Black had any good alternative to the coming exchanges.  redfoxrising: 23. Rxd1 is all that can be played",
        "23. Rxd1 Bxd1": "redfoxrising: 24. Kxd1 Kxe5\n\n25.Rxb7  thewrongreason: Unless the other commentators think otherwise, I will also vote for 24.Kxd1.  archduke_piccolo: There is...\n... an alternative in 24.Nxf7, but I don't think that it gives us much:\n\n1. Nxf7 Bf3\n2. Rxb7 hxg4\n3. hxg4 Bxg4\n4. Nd6 Ke5!\nNot 4...Bxf5?? as then 5.Ne8ch will win material for White.\nBut White would have to move the knight somewhere: [A] 6.Nc4ch Kf6, or [B] 6.Ne8 Nd7\nBoth lines seem to hold for Black.\n\nSo I'll vote for 24.Kxd1.\n",
        "24. Kxd1 Kxe5": "redfoxrising: 25. Rxd1 is still my suggestion  thewrongreason: Despite how little experience I have, in the position that Janet showed, 25.Rxd1 isn't feasible. I think you meant 25.Rxb7, Ron, which would also be my vote.  redfoxrising: correct thanks Joe that was our last move\n25. Rxb7 is what i meant!",
        "25. Rxb7 hxg4": "thewrongreason: Very difficult since we have isolated pawns. I like the idea of 26.h4 to advance our pawn. Unless ION or Dave thinks otherwise, I'm going to vote for 26.hxg4. As it does prevent loss of material. But, more importantly, despite inexperience, I'm absolutely thinking about GM Susan Polgar noted which is that it's better to have the pawns connected, as opposed to, isolated. If we recapture on g4, that will happen. And, although it's extremely unlikely, I believe that there's a slight possibility, in the long run, much later on, that this will give us a passed pawn if we take back.  redfoxrising: 26. Rxf7 looks the best choice  thewrongreason: I overlooked it, but I agree with you Ron. So, unless ION or Dave think differently, I'll change my vote to 26.Rxf7.  archduke_piccolo: I much prefer...\n26.hxg4, keeping alive the threat on f7.\n\nInstead 26.Rxf7 gxh3 27.Rxg7 h2 28. Rh7 a5, and Black can enter an ending a pawn down, but with reasonable drawing chances.\n\nI vote for 26.hxg4,  supersparksky: I agree with Ion,\n26.hxg4, connect the pawns and keep the threat of Rxg7  thewrongreason: What Dave posted is how I originally felt. I hate to tell you this Ron, but I disagree with taking on f7, for the reason that others mentioned. So, I'll go back to my original vote with 26.hxg4.  redfoxrising: 26. hxg4 is my suggested vote as per discussion\nmuch better than what I first suggested  ",
        "26. hxg4 a5": "thewrongreason: Now, I go by Ron's earlier vote. I'm keeping in mind about our passed pawn, and if we take, we're one step closer to a passed pawn with the R right in front of it. So, as of now, I will vote for 27.Rxf7  archduke_piccolo:  Instead of...\n...\n27.Rxf7,...\nIs there any percentage in 27.Re7ch Kf4 28.Re8 Kxg4 29.Bd3 ...?\nOn the plus side, this establishes a bind on the undeveloped Black pieces. On the down side, Black's king and a-pawn might be active enough to neutralise that bind.\n\nThoughts?  thewrongreason: It's an interesting idea, ION. And, perhaps it would be a draw soon after that, although, it is hard to say for sure.  redfoxrising: 27. Re7ch looks might better than Rxf7 game seems draw-ish  archduke_piccolo: No, on reflection...\n... I think my concerns about Black's a-pawn are correct. Tying down Black's Q-side ties down our own pieces.\n\nI'll vote for 27.Rxf7.  redfoxrising: I'm also good with 27.Rxf7  thewrongreason: I agree and will stick with 27.Rxf7. ",
        "27. Rxf7 a4": "supersparksky: My suggestion is\n28.Bc4  archduke_piccolo: Yes...\n28.Bc4 develops the bishop and prepares to blackade the a-pawn by Ba2. The alternative is to move the King across. I do not recommend 28.Rf8 -\n\n28.Rf8?! a3\n29.Bc4 a2\n30.Bxa2 Rxa2\n31.Rxb8 ,,,\nas the rook ending is a likely draw.\n\nMy vote: 28.Bc4.  thewrongreason: I'll also vote for 28.Bc4  redfoxrising: 28. Bc4 is my vote",
        "28. Bc4 a3": "thewrongreason: I was real concerned about her a pawn since that's why Charles opponent resigned. But, the Bc4 stops it. I'm a little concerned about Janet playing 29...Kf4 which would appear to win our g4 pawn which would also disrupt that pawn chain. As such, I'm going to vote for 29.Rxg7 so that if she's comes down with her monarch, the pawn is protected.  redfoxrising: I like Joe's suggestion I'll support 29. Rxg7 as well  archduke_piccolo: I don't think...\n... that a win is possible with the piece sacrifice suggested:\n\n29.Rxg7 a2\n30.Bxa2 Rxa2\nNow Black's King is very close to the passed pawn pair; the knight will soon become active; and the White King is cut off from the action on the back rank. We could draw this, but not win it.\n\nI think the obvious\n\n29.Ba2 ...\nto blockade the pawn, is mandatory. THEN we may think about taking the g-pawn.  thewrongreason: I'll change my vote then to 29.Ba2  redfoxrising: I'll change my vote then to 29.Ba2 after Ion's post  ",
        "29. Ba2 Na6": "thewrongreason: If it's safe to do so, I'll now vote for 30.Rxg7.  archduke_piccolo: I can't...\n... think of anything better right now, so I'll go for 30.Rxg7 as well. That will give us two joined passed pawns, with the rook on hand to assist, and our bishop is reasonably placed to support them.  redfoxrising: I agree with 30 Rxg7  supersparksky: How about\n30.g5 followed possibly by f6 and Re7+  thewrongreason: I see why you vote for that, supersparksky. Although I still like 30.Rxg7, I'm gonna have to change my vote to 30.g5 I normally wouldn't because of what ION mentioned, but in the aftermath of Dave's variations, I would want to follow up with f6. As now, we have a dangerous pawn chain since they're well connected. One isn't passed, but with our R right there, it's just about useful.",
        "30. g5 Nc5": "supersparksky: Move 31\nour next move should be 31.f6  thewrongreason: I concur with 31.f6, Dave. And, I would, likely, want to follow up with 32.Re7+, as you noted above.  redfoxrising: 31. f6 is my vote",
        "31. f6 Rd8+": "supersparksky: My suggestion is\n32.Ke2....  thewrongreason: I agree and will also vote for 32.Ke2 But, it's, mainly, because it gives us the opposition which is useful in the endgame.  archduke_piccolo: Actually, Joe...\n... it doesn't give us the 'opposition'. Instead 32.Ke1 WOULD give us the opposition - what's called the 'distant opposition'. You have the opposition if there is an odd number of squares on the same rank, file or diagonal, between the Kings, and it is your opponent to move. If there is just the one square between, it is the '(direct) opposition'; if more than one, the 'distant opposition.'\n\nThe opposition really only counts if the opponent has no good alternative to playing a king move. For instance, if our opponent can simply 'mark time' with some kind of 'waiting move' that doesn't hurt her game, then suddenly SHE would have the opposition!\n\nIn this position, we want to bring the king into action, and the 'distant opposition' doesn't really help us all that much (even apart from an annoying knight check at d3). We are in check and must move the king. First of all, do want the king on the K-side or the Q-side? 32.Kc2 has the virtue of protecting the c-pawn, but after that there is nowhere for the K to go. He'll be pretty much jailed.\n\nI reckon 32.Re2 is the go, all right, and, as it is unlikely that Black will play 32...Ke4, we can (unless we find a better course of action) establish the 'opposition' by 33.Ke3.\n\nI'll vote for 32.Re2.",
        "32. Ke2 g6": "thewrongreason: This is very difficult, but I'll vote for 33.Kf3 to prevent black from playing 33...Kf4 My idea would be to keep g5 protected.  archduke_piccolo: Joe, you have the right idea...\n...but may I suggest a refinement: 33.Re7ch.\n\nThe idea is to drive the king away from the K-side pawns. Black is unlikely to advance the King up the boardto e4 or f4, on account of 34.f7, whence Black will be hard put to it to stop the promotion without loss. So Black will play 33...Kd6, and THEN we bring our King to f3:\n\nSo:\n\n33.Re7ch ...\n(A) 33...Kf4 (or...Ke4)\n34.f7 ...\n\n(B) 33...Kd6\n34.Kf3 ...  redfoxrising: 33. Re7+ is my suggested vote",
        "33. Re7+ Kd6": "thewrongreason: Thanks for the clarification ION. If we still had time, I also would've changed my vote to what white played. And, in this position, I'm thinking long term strategy which might not work because of the refinement. But, this is somewhat similar to the position that I had in the chess dream on Wednsday which you'll see in my next annotation. That's where I overlooked the opportunity to take a pawn which then became passed. In doing that, I almost allowed a draw by rep which is what, finally, made me realize that my draw with the Master Mater was a waisted game. Having said that, I'm thinking about that game. And, with that, I'm torn between 2 candidate moves involving the K with one being 34.Ke3. But, my gut's telling me that we should play 34.Kf3, so that'll be my vote. And, ION mentioned something about that to. My idea here is to be able to, at some point when it becomes a legal move, to get the monarch to e6 where the f6 pawn will be unstoppable. redfoxrising: 34.Kf3 ... is my suggested vote  archduke_piccolo: 34.Kf3\nThere is a subtle difference between this move and the other that comes into consideration, 34.Ke3.\n\nIf 34.Ke3, Black will play 34...Rh8, with the idea of giving check and taking out the c-pawn or maybe the bishop. Now, after\n\n34.Kf3 Rh8 we can play...\n35.Ra7 Rh3ch\n36.Kg4 ... gains us a tempo. If now\n36... Rxc3 (?)\n37.f7 ... wins.\n",
        "34. Kf3 Rh8": "thewrongreason: My thinking would've been 35.Kf4, but the idea behind it is not possible, would involve illegal moves, in this position. As we just can't sneak it up to e5, let alone, e6-e7 due to her monarch, which is where I'd want it. Thus, I'll base it on ION's earlier variation and vote for 35.Ra7.  archduke_piccolo: Yes...\n... I don't think 34.Kf4 is quite the thing, as Black could play 34...Rh2, attacking our bishop. We can't push the f-pawn for the moment as our rook would be left 'en prise' to the Black king.\n\nSo we want to move the rook off e7. Moving it across to a7 threatens the Black a-pawn, and indirectly, the bishop as well, so 34...Rh2 loses much of its force. Possibly we could retire the rook along the e-file (34.Re2, say), but she might get a skewer on out c-pawn. After 34.Ra7, we have good prospects I think of winning the a-pawn for nothing. That will deprive Black of a valuable countervailing asset, without compromising our own attacking prospects on the K-side.\n\nMy vote: 34.Ra7.  supersparksky: I don't like the look of 34.Ra7\nAfter 34.Ra7..Rh3+. 35.Kg4..Rh1. 36..Rxa3..Rg1+! we will lose our g pawn or succumb to a 3 move repetition draw.  thewrongreason: In that case, I'll change my vote to 34.Re2.  redfoxrising: 34. Re2 is my vote",
        "35. Re2": "brigadecommander: I Resign\nIt's hopeless. You guys played a fine game. Let me know if you want to play another. Maybe a similar game with me as black again. This time maybe we can try a Berlin Defense against the Ruy Lopez!. Let me know. Thank you all for the game. I enjoyed it. BC 👍  supersparksky: Thanks BC,\nI am up for another, just let me know.  brigadecommander: Dave\nYou need at least 2-other players.Message them and let me know.  redfoxrising: hope to see another game\nIon, Joe,, I'm interested too  supersparksky: One more player needed\nto start another game. Any takers?  thewrongreason: With more time allowing me to do so, yes, I'd be in."
    },
    "url": "https://gameknot.com/annotation.pl/falkbeers-war-consultation-game?gm=67932",
    "gameName": "Falkbeers War Consultation Game",
    "players": "supersparksky (2412) vs. brigadecommander (2460)",
    "opening": "KGD (C32), Falkbeer, main line, 7...Bf5"
}