{
    "moves": {
        "1. e4": "This win prompted my opponent to seek an immediate rematch. Looking at his profile, I see why! I was the lowest rated player ever to beat him.  Let's see how...  I started by eschewing my normal policy and giving 1.e4 a rare test (outside themed tourneys) against higher rated opposition.",
        "1... c5": "My opponent responds with my favourite Sicilian.",
        "2. Nf3 d6 3. d4 cxd4 4. Nxd4 Nf6 5. Nc3 a6": "and my favourite Najdorf Variation",
        "6. Bg5": "Since Short's match against Kasparov, I've tended to favour 6. Bc4 but my recent experiences as Black have convinced me that 6. Bg5 is White's strongest response.",
        "6... e6 7. f4 Be7 8. Qf3 e5": "This took me by surprise and out of my \"book\".  White the point of an early ...a6 is often to allow ...e5, this isn't usually played in two moves.  Giving White this extra tempo ought to work out badly for Black in such a sharp line.",
        "9. fxe5 dxe5 10. Nf5": "White immediately attacks the uncastled kingside.",
        "10... Bxf5 11. Qxf5 h6 12. Bxf6": "Determined to exploit my extra tempo, I swap rather than retreat.",
        "12... Bxf6 13. Bc4 b5": "The usual thrust against the Bishop on c4, but because of the earlier swap on f6, White has a more active response than usual.",
        "14. Bd5 Ra7": "Black's undeveloped knight prevents the Rook from going to its normal c8 square.  However, from a7 it is ready to double at the first opportunity.",
        "15. O-O": "With the B on d5, I could now have castled Queenside as is normal after 6. Bg5 etc.  This would have created the nasty threat of Bxf7+ followed by Rxd8+, winning Q+P for B+R.  I can't remember now why I opted for this quieter continuation, which offers Black an instant checking opportunity.",
        "15... O-O": "Black opts for safety first.",
        "16. Rad1": "White sets up the threat a move later but Black can easily sidestep with tempo.",
        "16... Qb6+ 17. Kh1 Nc6": "At last the QN is out and there's not much between us at this stage.",
        "18. Rf3": "? A standard \"rook lift\" to the third rank, from where it can either double on the d-file or f-file, or prepare a frontal assault on Black's King.  However, this was the wrong rook...",
        "18... Nd4": "Black immediately forks Rook and Queen with his knight.",
        "19. Rxd4": "White is forced to go the exchange down and chooses to do so immediately rather than move the Queen.",
        "19... Qxd4 20. Rg3": "White threatens to win the Bishop on f6.",
        "20... b4": "? Black counter-attacks by pushing at White's knight.",
        "21. Qxf6": "but Black's counter-threat was toothless because after the Bishop is captured, mate is threated on g7.  Black resigned immediately.  Mate can't be prevented even by advancing the g-pawn to g6, the standard method in such positions, because of the pinned f-pawn.  Advancing to g5 would slow White down slightly but after Qg6+ and Qxh6+, Rxg5+ would win.  Black can't even play any useful back-rank checks, because the Nc3 covers d1 and Qg1+ is no use without support.  I was lucky that Black made the last mistake!!"
    },
    "url": "https://gameknot.com/annotation.pl/fast-ladder?gm=26507",
    "gameName": "Fast Ladder",
    "players": "rjacobs (1522) vs. jonb1 (1674)",
    "opening": "Sicilian (B98), Najdorf, Browne variation"
}