{
    "moves": {
        "1. e4": "hello everyone, and today I will annotate a french  exchange between 2 C-B level players on GK. \n\n",
        "1... e6": "the french defence. In this opening, black will usually have strong central point on d5 that can last very long, but he will usually have trouble activating his light squared bishop. However, the exchange variation gives a symmetrical and very drawish position.",
        "2. d4": "THIS IS white's most common 2nd move choice.",
        "2... d5 3. exd5": "the exchange variation. This is a great choice if one wishes to get a draw. White is rated lower than his opponent, so this is a perfectly reasonable choice.",
        "3... exd5 4. Bd3": "Okay, but the best line by the book is 4.Nf3 Bg4!  5.Qe2ch! Qe7  6.Be3! when a draw is the most common result. I have played a this line in a short game which followed 6...Qb4ch?!  7.Nc3 Qxb2?? 8.Bc1ch 1-0  \nU14 tournament, Me vs. D class player 2007. This is the most common beginner's trap in the exchange, and although I played this a long time ago, I remember this because it was so short and simple.",
        "4... Nf6 5. c3": "this is just like a rubenstein exchange variation in the caro-kann, except black's e pawn is gone in exchange for a c pawn.",
        "5... Bd6": "preparing castling",
        "6. Bg5 O-O 7. h3": "This is move has a purpose, denying black use of the g4 square for his bishop, which he may try and play:\nBg4-h5-g6, exchanging white's good bishop. ",
        "7... Re8+": "Black, who is ahead in development, may try c5 at some point before playing Nc6, trying to break down the opponent's pawn structure. However, this is just an idea to be implemented later maybe.",
        "8. Ne2 c6": "I don't like this because it impedes the black development. Black may have had a setup Be6, Nd7,Rc8,c5, but I don't see what c6 really does, as it denies the black knight  a good square, and the d pawn can be well protected",
        "9. Qd2 Nbd7": "followed maybe by Nb6",
        "10. O-O Qc7": "if black wants a kingside attack, he will need more pieces.",
        "11. g3": "black had no immediate threats. It is unnecessary and even bad to weaken the king like this, without developing.",
        "11... b5": "I don't see black's plan, if he has one. Can someone tell me what they see? All I see is maybe a4, then b4, attacking the pawn chain.",
        "12. b4": "this leaves a c4 hole. ",
        "12... a5": "black is going to get an open a file for the rook.",
        "13. a4 axb4 14. cxb4": "now black can win a pawn.",
        "14... bxa4 15. Na3": "the knight really doesn't have prospects here, but I don't think white wanted to lose another pawn with Nc3.",
        "15... Ne4": "the knight is excellently placed here.",
        "16. Qe3 Ndf6 17. Bxe4": "now white gives up his good bishop to take off the e4 knight just to find that the f6 knight takes it's place.",
        "17... Nxe4 18. f3": "a really disgusting move, in my opinion, because of black's next move.",
        "18... Bxh3": "now black wins more material, and his position will still be better.",
        "19. fxe4 Rxe4": "black has 3 pawns for the piece, and white's kingside is shattered.",
        "20. Qf2 Bxf1": "now black will easily win. White gives up."
    },
    "url": "https://gameknot.com/annotation.pl/fast-ladder?gm=32917",
    "gameName": "Fast Ladder",
    "players": "darkforce65 (1508) vs. maximusxmeridio (1632)",
    "opening": "French (C01), exchange, Svenonius variation"
}