{
    "moves": {
        "1. d4 Nf6 2. c4 d5": "The Grunfeld.  I don't think we've played this one between us before.",
        "3. cxd5": "I vary from my usual response of 3. Nc3.  The experiment works out quite well.",
        "3... Nxd5 4. e4 Nb6": "Instead of swapping on c3, the N retreats to a not particularly useful square.  The computer gives me the slightest edge after this.",
        "5. Nf3 Bg4 6. Be2 e6 7. O-O Be7 8. Nc3 O-O 9. Bf4 c6": "Identified by the computer as an inaccuracy.  It prefers \"… Nc6 9.  Be3  Bf6  10. e5 Be7  11. Qb3 Qd7  12. Rac1 Bf5  13. Rfd1 Rad8  14. Bd3 Bxd3  15. Rxd3. +0.23\"  Odd that it gets the move-numbering wrong.  Black's pawn structure is typical of the Slav defence, which is very sound, so I think Sheridan can be forgiven this :-) ",
        "10. h3 Bh5 11. g4": "Now the computer gives me a whole pawn advantage!... but it doesn't last long :-(  This is the start of a sustained attack on Black's kingside which, I feel, should have been more successful than it ultimately was, whether due to Sheridan's defensive skills or my attacking errors remains to be seen.",
        "11... Bg6 12. Qd2": "Curiously, my advantage drops to +0.49 with this move, though the computer suggests no alternative.",
        "12... Nb8d7": "Black continues to try to catch up on development.",
        "13. Rad1": "It would be standard policy to park this R on c1, controlling the half-open file but it bites on granite at c6.  On d1, the R supports a potential later central thrust and opposes Black's Q.",
        "13... Bb4": "Now Black starts to try to undermine White's impressive looking centre by pinning the QN against White's Q and thus threatening to capture the e4 pawn.  I had to think quite hard about how to deal with this threat, eventually opting to bolster e4 with my LSB.",
        "14. Bd3": "Now my \"advantage\" drops to +0.24, so presumably the computer doesn't like this, though does not suggest a better move.",
        "14... Nf6": "Black renews the threat to e4 and establishes even tighter control over d5.  If White is tempted to play e5, Black will have a lovely outpost for the rest of the game.  Nevertheless, the computer doubles White's advantage again!",
        "15. Qe2": "Now the e4 pawn is over-protected and the N is no longer pinned.  Blacks DSB is looking superfluous, so...",
        "15... Bxc3": "Black swaps.  The computer doesn't like this, again doubling White's advantage to +0.98, but in this sort of position, Black's Ns are likely to more than match White's Bs.",
        "16. bxc3": "Now White has a typical Grunfeld pawn structure but Black still has two Ns.",
        "16... Qe7": "Black gets his Q off the d-file, allowing a R to occupy d8 and apply further pressure to White's centre.",
        "17. Rfe1": "Again, White opposes the enemy Q with a R.  White's development is now complete and it is time to develop a plan.",
        "17... h6": "Black creates a hole for his K (or B if it is attacked) but also provides a target for White.",
        "18. Ne5": "White's N seizes a key central square from which to dominate Black's position.  I was in two minds whether to follow this up with Nxg6 if Black allowed.  I generally like to swap Ns for Bs but in this position White's N looks much stronger than Black's B, so it would be an odd swap unless there were some concrete tactical advantage to be gained.",
        "18... Bh7": "Black retreats anyway, so I don't need to choose.",
        "19. g5": "This is a double edged move: if Black swaps pawns I get a nice pin on his Nf6 and can follow up with a full-scale kingside attack with minor and major pieces.  On the other hand, White's king is looking exposed, so, if the attack fails, Black will probably mate White quickly (but such possibilities are a long way down the line at this stage).",
        "19... hxg5 20. Bxg5": "I was quite pleased with this position, though unsure how to proceed.  The computer has dropped bmy advantage by 0.1 to +0.90 now.",
        "20... Rad8": "?  The computer nails this as a mistake because it allows \"… Rad8 20.  Ng4  Qc7  21. Bxf6 gxf6  22. Nxf6+ Kh8  23. Qh5 Rg8+  24. Kh1 Rg7  25. e5 Na4  26. Nxh7 Nxc3 (+3.54)\".  However I saw an even \"cleverer\" move ...",
        "21. Qh5": "!??  I had my heart in my mouth as I played this picturesque move, apparently putting the Q en prise but exploiting the pin on the Nf6 against the Qe7.  It's the kind of move that would cause a lesser opponent to panic but Sheridan reacted calmly.  Of course the prosaic computer sees none of the beauty in my concept and has Black launching a Queenside frolic with his own Q:\n\nBlunder: +0.62 » 21.  Qh5  Nbd7  22. Qf3 Qa3  23. Bb1 Qb2  24. Ng4 Rc8  25. c4 Nxg4  26. hxg4 c5  27. Re2\nBest: +4.20 » 21. Ng4 Qa3 22. Bxf6 Rc8 23. Qd2 gxf6 24. Nxf6+ Kh8 25. e5 Rg8+ 26. Kh2 Nd5 27. Nxh7 Nxc3 28. Ra1\n",
        "21... Nbd7": "Now, even though Black plays the computer's preferred move, White's advantage has apparently climbed to +1.47, so even after my \"blunder\" I have still improved my advantage.",
        "22. Nxd7": "Played with the objective of maintaining the pressure on the h4-d8 diagonal by removing one of the Nf6's defenders.  The computer, of course, identifies this as another mistake, though now its preferred move is 22. Qh4 rather than 22. Qf3 as in the earlier note.",
        "22... Qxd7": "Black recaptures with the Q, thus releasing the pin for a lesser pin.  The computer prefers the Rook capture followed by ...e5.  Curiously, the move-numbering errors only occur on Black's moves, not White's:\n\n\"Mistake: +2.14 » … Qxd7  22. Qh4 Bg6  23. e5 Nh7  24. Bxd8 Bxd3  25. Rxd3 Qxd8  26. Qg4 Qg5  27. Rg3 Qxg4  28. hxg4\nBest: +0.59 » … Rxd7 22. Qh4 e5 23. Be2 Qe6 24. Bf3 exd4 25. Rxd4 Rd5 26. Bxf6 gxf6 27. exd5 Qxe1+ 28. Kg2 cxd5 29. Bxd5\"",
        "23. Bxf6": "Now this is identified as an inaccuracy: I guess because, in human chess terms, it releases the tension too early.  By delaying the exchange a couple of moves, White could have gained another point advantage, according to the computer:\n\n\"Inaccuracy: +1.18 » 23.  Bxf6  gxf6  24. Qh4 Kg7  25. Re3 Bg6  26. Rg3 e5  27. dxe5 fxe5  28. Qg5 Qc7  29. h4 Kg8  30. h5 Rxd3\nBest: +2.16 » 23. Qh4 Bg6 24. e5 Nd5 25. Bxg6 fxg6 26. Bxd8 Qxd8 27. Qxd8 Rxd8 28. Rd3 g5 29. c4 Nf4 30. Rb3 b6\"\n\n",
        "23... gxf6 24. e5": "This move threatens mate in one, so Black has to do something about it.  I expected ...Bxd3, when I could lift my R to d3 and then deliver mate from g3 but the computer recommends the much better ...Bg6.",
        "24... f5": "? Black blocks the threat but relinquishes control of g5, which the computer advises White should use immediately, eventually winning the B:\n\n\"Mistake: +3.33 » … f5  24. Qg5+ Kh8  25. Qf6+ Kg8  26. h4 Rfe8  27. Kh2 Bg6  28. Rg1 Qe7  29. h5 c5  30. Qxe7 Rxe7  31. hxg6 cxd4  32. gxf7+ Kxf7  33. cxd4 Rxd4\nBest: +1.11 » … Bg6 24. Bxg6 fxg6 25. Qxg6+ Kh8 26. Re4 Qh7 27. Qxh7+ Kxh7 28. Rd3 fxe5 29. Rxe5 Rf6 30. Rg3 Rd5 31. Kg2 Rxe5 32. dxe5\"",
        "25. Kh2": "?  Played with the laudable intent of checking from g1 but not as good as the immediate Qg5+:\n\n\"Mistake: +0.68 » 25.  Kh2  Qe7  26. Rg1+ Kh8  27. Rde1 Rg8  28. Rg4 c5  29. Rh4 Rg7  30. Rg1 Rdg8  31. Rg3 cxd4  32. cxd4 Qb4\nBest: +3.47 » 25. Qg5+ Bg6 26. h4 Rfe8 27. h5 Qe7 28. Qxe7 Rxe7 29. hxg6 fxg6 30. Kg2 g5 31. Rh1 Kg7 32. Kf3 Red7 33. Rb1\"",
        "25... Bg6 26. Reg1": "Rather than retreat the Q in the face of aggression, White instead pins the B.",
        "26... Kg7 27. Qg5 Rde8 28. Qf6+ Kh7 29. h4": "If White can divert than B off g6 he can deliver mate on g7.",
        "29... Qe7": "... but Black stymies that plan by forcing a Q swap.",
        "30. Rg3": "White prepares to either double rooks on the g-file or get behind the pawn on h3.  By now the computer has reduced White's advantage to a mere +0.25 so the attack is fizzling out without a concrete advantage gained.",
        "30... Qxf6 31. exf6 Rfg8": "This moves looks natural but the computer once again doubles White's advantage to +0.47.  However, no alternative is suggested.",
        "32. Rdg1": "These doubled rooks look pretty but present little danger.",
        "32... Bh5": "Black offers to swap rooks.  The sting gone from the attack, Black's superior endgame skills make him favourite from now on.",
        "33. Rg3g7+": "I reasoned that the swapping would be less wholesale on this square than on g8 and that I could apply some pressure to f7 and along the 7th rank.  Again, the computer doesn't seem to like it, as my advantage drops from +0.44 to +0.14 but no analysis to back this up.",
        "33... Rxg7 34. Rxg7+": "Now my advantage has frittered away to +0.02 :-(",
        "34... Kh8": "but shoos back up to +0.57 with this move, so perhaps 34.... Kh6 was better?",
        "35. Rg5": "and now I'm back to the heady heights of +0.76, so I think this must be a good move! (though it's pretty obvious so hardly worthy of an exclamation mark)",
        "35... Bd1": "This was a bit mysterious and had me worried for a while.  It's not clear what Black plans to do with this B.  Perhaps it's a question of putting it somewhere safe where White won't bother to molest it.  If he'd just played it to g6, I'd have harassed it with the h-pawn.  If he'd played it to g4, we might have settled for a draw by repetition if I'd gone 36. Rg7 Bh5 37. Rg5 etc",
        "36. Kg3": "Now I had visions (hallucinations?) of marching the king via the dark squares to c7 or e7 and harassing Black's pawns but this was never to be.",
        "36... Rg8 37. f4": "?! and the computer would have preferred me to continue at least part-way with my plan:\n\n\"Inaccuracy: +0.25 » 37.  f4  Bh5  38. Kf2 Bg4  39. Bc2 Kh7  40. c4 Rg6  41. d5 cxd5  42. cxd5 exd5  43. Bxf5 Bxf5  44. Rxf5 d4  45. Rd5 Rh6  46. h5\nBest: +0.85 » 37. Kf4 Kh7 38. Rxg8 Kxg8 39. Kg5 Kh7 40. h5 Bf3 41. Bc2 b6 42. Bd3 Bd5 43. c4 Bf3 44. a3 a5\"\n\nNow my K is doomed to lurk at the back so long as Black's B occupies d1.\n",
        "37... Rg6": "? but now it is Black's turn to make a mistake.  The pawn on e6 should be about to become a weakling as a result of this move:\n\n\"Mistake: +2.24 » … Rg6  37. Rxg6 fxg6  38. Bc4 Kg8  39. Bxe6+ Kf8  40. c4 Be2  41. d5 cxd5  42. cxd5 Bc4  43. a4 Bb3  44. a5 Bc4\nBest: +0.26 » … Kh7 37. c4 Bg4 38. Kf2 Rg6 39. d5 Rxg5 40. fxg5 exd5 41. cxd5 cxd5 42. Bf1 d4 43. Bg2 b5 44. Bd5\"",
        "38. Rxg6 fxg6 39. Kf2": "?? Arguably the losing move.  We don't often describe failures to win material as \"blunders\" in the way that we describe moves that lose material; but this move surely qualifies as such.  I completely failed to see the weakling at e6 and was still obsessed with my King's scope for activity (a worthy obsession in the endgame but unforgivable when it blinds one to match-winning opportunities):\n\n\"Blunder: -1.36 » 39.  Kf2  Kg8  40. Be2 Bxe2  41. Kxe2 Kf7  42. a4 Kxf6  43. c4 b6  44. Kd3 c5  45. Kc3 a6  46. d5 Ke7  47. Kd3 Kd6\nBest: +2.34 » 39. Bc4 Bc2 40. Bxe6 Bd3 41. c4 b6 42. Kf3 Bb1 43. a3 Bd3 44. Ke3 Be4 45. Bf7 Kh7 46. h5 gxh5 47. Bxh5 Kg8\"",
        "39... Kg8": "Now the score is -1.75 as the pawn on f6 is domed and White's pawn structure is a complete mess.  Black's win is easy from here.",
        "40. Be2 Bxe2 41. Kxe2 Kf7 42. Ke3 Kxf6 43. c4 Ke7": "?!  Nevertheless, Black can still make life more difficult for himself, apparently:\n\n\"Inaccuracy: -1.64 » … Ke7  43. c5 Kf6  44. Kd3 b6  45. cxb6 axb6  46. a4 Kg7  47. Ke2 Kg8  48. Kd3 Kf7  49. Kc3 Ke7  50. Kb4 Kd7  51. a5 bxa5+  52. Kxa5 Kd6\nBest: -2.42 » … b5 43. d5 exd5 44. cxb5 cxb5 45. Kd4 Ke6 46. Kc5 d4 47. Kxd4 Kd6 48. Ke3 Kd5 49. Kd3 b4 50. Ke3 a5 51. Kf3 Kc4 52. Ke3\"",
        "44. d5": "?? but White is now determined to give the game away, it seems.  I thought my best chance lay in giving Black an isolated d-pawn but of course I was soon to run out of waiting moves that would give me the opposition usefully.  The computer shows how I could at least have made Black fight for a win:\n\n\"Blunder: -5.02 » 44.  d5  exd5  45. cxd5 c5  46. a4 Kd6  47. Kd3 Kxd5  48. Kc3 b6  49. Kd3 a6  50. Kc3 b5  51. Kb3 Ke4  52. a5 Kxf4  53. Kc3 Ke4  54. Kb3\nBest: -1.72 » 44. c5 b6 45. cxb6 axb6 46. Ke2 Kd6 47. Ke3 Kd5 48. Kd3 c5 49. dxc5 Kxc5 50. Kc3 Kd5 51. Kd3 b5 52. a3 e5 53. fxe5 f4 54. h5\"",
        "44... exd5 45. cxd5 cxd5 46. Kd4": "?! If I wanted to gain the opposition, I might have done better to delay my arrival on this square by first playing 46. d3, as now I am forced to play the first waiting move.",
        "46... Kd6": "The computer now scores this position -7.65.  White can resign with a clear conscience.",
        "47. a3 b5": "! (-9.27)  At a stroke, Black renders White powerless as he is in zugzwang.  Every moves enables Black to increase his advantage.  I resigned."
    },
    "url": "https://gameknot.com/annotation.pl/fast-ladder?gm=32010",
    "gameName": "Fast Ladder",
    "players": "rjacobs (1559) vs. sdr46 (1776)",
    "opening": "Queen's pawn game (A50)"
}