{
    "moves": {
        "1. d4 Nf6": "Ok I'll play the waiting game and see how white wants to progress with his d4 opening.",
        "2. f3": "I admit I had to look up what this opening was called. Apparently the Paleface Gambit...so I guess I'm the natives then looking to break through the circle of wagons.",
        "2... g6": "I'll carry on with a King's Indian sort of defense, no offence but against a Paleface gambit in retrospect it seemed rather appropriate.",
        "3. Bf4": "Bishop development but attacking my c7 square...",
        "3... d6": "....so best way to defend for now and allow development of my opposing bishop",
        "4. Nc3 Bg7": "I complete the classic King's Indian opening putting my bishop of g7.",
        "5. e4": "Taking the centre with his pawns but my knight on f6 is not too worried as there are still options for his to flee and attack against advance to e5",
        "5... Nc6": "So I just bring my second knight out to apply more pressure on the middle of the board",
        "6. Nd5": "Bit early for white to move this knight ahead of the advanced pawns!",
        "6... Nxd5": "So I'll exchange off, double the pawns at least for a brief moment.",
        "7. exd5 Nxd4": "May as well isolate the d5 pawn as only the queen was protecting it as I disclosed a second piece attacking the backward of the doubled pawns.",
        "8. c3": "More or less forced to chase my knight away as ...Bc5, ...Nxc2 would have caused issues. Ne2 from white would not have taken away that threat.",
        "8... Nf5": "Keeping my knight in the centre of the board",
        "9. Qe2": "Only reason I can think for this move now is that he was worried I'd play Ne3 immediately which was not my intention.",
        "9... b6": "Potential to pin his queen with my white bishop after a5",
        "10. O-O-O": "Castling queen side but after the c3 move to force my knight away unto an already weakened side of the board that I will seek to exploit later.",
        "10... a5": "There's the a5 move to threaten the pin",
        "11. Qd2": "White is scared of it and moves off his queen off the diagonal.",
        "11... Bd7": "Give my bishop options to go whichever side of the board he will be needed.",
        "12. Nh3": "Would have though N32 would have been better for white as it give him more options while still protecting the bishop. Here it has only one advancement opportunity which can be repelled by a pawn move.",
        "12... O-O": "Maybe I shouldn't have castled just here. h6 with a threat of e5 threatening the bishop looks strong while the file is devoid of rooks and queen. ",
        "13. g4": "Maybe seeing the threat to his bishop gets in the attack on my knight first",
        "13... Nh4": "Only safe square but still has attacking options and the rook on h1 is immobile for now as Rh2 leads to Nxf3 forking rook and queen.",
        "14. Ng5": "Protection for that weakness on f3 while bringing the knight into the attack, but relieving the pressure of the c1-h6 diagonal couple of queen and bishop. \n\nMaybe Be2 would have been better at this point, iving more freedom to the h1 rook while still protecting that weakness of f3.",
        "14... h6": "So time to stamp my own authority on that diagonal even if only in a small way and making my black bishop passive as a result.",
        "15. Be2": "What I thought he should have played the move before now it is merely adding further protection to that weak f3 pawn freeing the knight up, though there isn't much for it to do from g5, but also connecting white's rooks.",
        "15... e6": "Inviting the exchange of pawns so I can apply pressure on a2 with my bishop",
        "16. Ne4": "White is not keen on the exchange but instead retreats the knight reopening the power on the c1-h6 diagonal.",
        "16... Ng2": "I can't allow that strength to remain to force the Bishop to declare its intention.\n\nActually this is an error as 17. Bxh6 Bxh6, Qxh6 allows the knight to move to g5 forcing the Black queen to capture or else Qh7 mate",
        "17. Bg3": "I'm fortunate that white also failed to see that mate in 4 and retreated.",
        "17... e5": "Although I prevent any immediate thoughts along that diagonal by trapping white's bishop further.",
        "18. Bf1": "White doesn't like my knight that advanced and wants it out of there.",
        "18... Nf4": "I'm prepared to give it up as well as my gained pawn advantage from earlier if it opens up the long black diagonal.",
        "19. Bxf4 exf4 20. Qxf4": "So here we are with only two of white's pawns between me and control of the long diagonal, though that queen is looking dangerous after those exchanges.",
        "20... g5": "Easy to move her off the f file.",
        "21. Qg3": "Although she adopts the most passive option she could have taken. Better would have been e3 to claim the blank file, although I would have responded Re8 to pin the knight.",
        "21... c5": "Inviting the en passant capture as my bishop can come into play.",
        "22. Bg2": "But instead get this, the third move from this bishop and not once has it moved more than one square away from its home square. But it is trapping most of white's pieces behind a balance queenside pawn structure to try and get at my king and not giving queen or bishop much room to manouvre.",
        "22... Ba4": "Pushing my bishop to here I'm hoping to eventually get full control of the long diagonal, especially if he uses the pawns to push me away.",
        "23. b3": "And white starts the pawn push to get rid of the wrong bishop threat",
        "23... Bb5": "So I withdraw one rank to see what white does next",
        "24. c4": "The push continues",
        "24... Ba6": "So I retreat my white bishop to the a file in the future hope of b5 trying to breach that line of pawns it needed.",
        "25. Nxd6": "At this point I couldn't believe my luck, there was no immediate threat and I could get my queen safely unto the black diagonal supported by my bishop straight away.",
        "25... Qf6": "Which is just what I do...Qb2 is my best next move but surely Qf2 prevents that and I have to go Qc3+, Qc2, looking to force an exchange of Queens and possibly pick up a knight of rook depending on his next move.",
        "26. Ne4": "OOPS!!! A second nothing move with the knight merely returning to whence he came for a greedy grab of the protected back pawn but committing regicide...",
        "26... Qb2#": "Two moves have opened up the b2 square for my queen to shake the white king by the hand as he is trapped."
    },
    "url": "https://gameknot.com/annotation.pl/fast-ladder?gm=52737",
    "gameName": "Fast Ladder",
    "players": "oldfossil (1093) vs. spglenn (1179)",
    "opening": "Paleface attack (A45)"
}