{
    "moves": {
        "1. e4": "In this game I sacrifice a bishop to queen a pawn and deliver checkmate.  I noticed that my opponent moved his f knight at least 6 times losing many tempos.",
        "1... c5": "My strongest opening",
        "2. Nf3 e6 3. d4 cxd4 4. Nxd4 Nf6 5. Nc3 d6": "This move prevents an advance of the e pawn",
        "6. Nf3": "Thats twice hes moved the f knight",
        "6... Nc6": "I thus gain a lead in development",
        "7. Bb5 Bd7 8. O-O Be7 9. b3": "b3?  better i think would be to place his bishop on g5",
        "9... O-O 10. Bb2 e5": "I strategically block the a1-h8 diagonal",
        "11. h3 a6 12. Bd3 Be6 13. Nh2": "Thats the third time hes moved his f knight",
        "13... d5": "Trying to hold the center",
        "14. Nf3": "This is the fourth time he moves his f knight",
        "14... d4": "Now the diagonal is effectively blocked and I have a firm control of the center",
        "15. Ne2 Qd7 16. Ng5": "He protects the h pawn from a bishop sac and attacks my lsb",
        "16... h6": "Since the bishop really cannot retreat I force him to take it",
        "17. Nxe6 Qxe6 18. Ng3 Nb4": "Now i threaten his bishop for endgame equality",
        "19. a3 Nxd3 20. Qxd3 b5 21. b4 Rfd8": "I back up the center pawn",
        "22. Rfd1 Qc4": "I offer to exchange queens for better pawn structure",
        "23. Nf5": "He refuses and gains an outpost at f5",
        "23... Bf8": "I retreat my bishop here to bolster defense of g7",
        "24. Rac1 Qxd3": "Qxd3?  Locks up the center for white",
        "25. cxd3": "Now white has an open c-file backed by a rook",
        "25... Rdc8": "I challenge white for crucial control of this file",
        "26. Nh4": "He moves the other knight again when he was on a good square.",
        "26... Nh5": "Im going for the outpost on f4 now",
        "27. g3": "He comprimises his kingside to prevent this",
        "27... g6": "I make the same mistake.",
        "28. Nf3": "He moves this knight again to attack my e5 pawn which I easily defend",
        "28... Bd6 29. Nh2": "He moves the knight again!",
        "29... f5": "This move was a mistake as I try to bust up his kingside",
        "30. g4 fxg4 31. Nxg4 Kh7 32. f3": "Im not sure why he made this move.",
        "32... Nf4": "I take advantage of it by gaining the outpost and attacking his h3 pawn.",
        "33. Kh2 Rcf8": "A wasted move methinks",
        "34. Rc6 Rfd8": "I protect my bishop",
        "35. Bc1 g5": "to lock in a closed position around his kingside",
        "36. Bxf4 gxf4 37. Rdc1": "Not sure what doubling up his rooks does here",
        "37... a5": "I double attack the pawn",
        "38. Rb6": "As you will soon see I am not worried about his rook taking my b pawn",
        "38... axb4 39. Rcc6": "This is where I sac my bishop to queen my b pawn",
        "39... bxa3": "Now I have a protected passed pawn!",
        "40. Rcxd6": "He takes the bishop and I have to take it because 41. Rxh6+ Kg8 42. Rg6+ and im in big trouble",
        "40... Rxd6 41. Rxd6 a2": "I advance the pawn because 42. Rxh6+ is just a check",
        "42. Rxh6+ Kg7 43. Re6": "Its too late for white to start gobbling up pawns because im going to queen the pawn on the next move.",
        "43... a1=Q 44. Rxe5": "Mate in two",
        "44... Ra2+ 45. Nf2 Rxf2#": "In this game I sacrifice a bishop to Queen a pawn and deliver checkmate.  I noticed that my opponent moved his knights over six times in the game losing a lot of tempos."
    },
    "url": "https://gameknot.com/annotation.pl/fast-ladder?gm=30174",
    "gameName": "Fast Ladder",
    "players": "mrx3419 (1428) vs. dungeonking (1284)",
    "opening": "Sicilian (B40), Pin variation (Sicilian counter-attack)"
}