{
    "moves": {
        "1. d4 d5 2. c4 dxc4": "According to theory, dxc4 is not the best move.  This isn't really a gambit you want to bite on.",
        "3. e4": "At this point, white has an advantage in space.  Your d and e pawns control the center -- c5, d5, e5, and f5.",
        "3... e5 4. d5": "You should have played Nf3, but d5 is also ok. Generally speaking, the tension you had before d5 was working in your favor.  The player who breaks that tension usually suffers by doing so.",
        "4... Nf6 5. f3": "Why not Qc2?  You get your queen off the back rank and threaten the pawn on c4. Actually, f3 is a mistake (not a blunder). You hinder the development of your knight and your bishop. Ne2 closes you bishop in, unless of course you take the pawn on c4.",
        "5... c6 6. Bxc4 Bb4+ 7. Nc3": "Nc3!",
        "7... O-O": "Black could have played cxd5, which would have been a pain for you.",
        "8. Bg5": "While there is nothing wrong with Bg5, Be3 was stronger.",
        "8... cxd5 9. Bxd5": "This shouldn't have been a surprise.",
        "9... Nbd7": "You are very much in this game.  Black has a slight edge and Nbd7 wasn't the strongest move out there.",
        "10. Qb3": "A better move would have been Nge2.  Now you are almost done developing. ",
        "10... Nc5": "This is okay, but Qb6 is even better.",
        "11. Qc4": "The queen should have gone back to c2.",
        "11... Bd7": "Now black is got a definite advantage.",
        "12. O-O-O": "This is a mistake.  You're castling into the lion's den.  Rd1 was a better option.",
        "12... Bxc3": "This was a very strong move for black!  He's threatening to ruin your defenses. bxc3 leaves a gaping hole.",
        "13. bxc3 Rc8": "At this point, you are losing and almost lost.  Look at how coordinated blacks pieces are.  He is in a great position to wipe out most of your queen-side. ",
        "14. Qb4": "What were your thoughts here?  This is a big boo-boo. Black should have played Nxd5 and you would have played Bxc8 and then Nxd4 and then Be7 and then Nxa2+ and you're a goner.",
        "14... a5": "This is one of black's bigger mistakes!  You could have clawed back into it by playing Qa3.  Next for black would have been Qb6, Bb3, h6, Bxf6, Qxf6 and you still have a chance.",
        "15. Bxf6 Qxf6": "Qxa5 is not worth your time.  Qb1 and then c4 would have been better.",
        "16. Qxa5 Qg5+": "You'll drop a piece with this move -- your knight.",
        "17. Kb1 Qxg2 18. Ne2": "T",
        "18... Qxe2 19. Rhe1 Qxf3": "Resigning here was a wise decision.  Black only made one obvious error (a5).  If you look at what's left of your position, you see that your king is very vulnerable. Black's knight on c5 is menacing.  His white bishop is poised to put the hammer down and the rooks will soon join in on the fun.  Black's defenses are rock solid.  You don't have any chance of breaking through there."
    },
    "url": "https://gameknot.com/annotation.pl/fast-ladder?gm=28245",
    "gameName": "Fast Ladder",
    "players": "bunnyrabbitz (1722) vs. chesspony (1837)",
    "opening": "QGA (D20), 3.e4"
}