{
    "moves": {
        "1. e4 e5 2. d4 exd4 3. Qxd4 Nc6 4. Qa4 Nf6": "Book play so far.",
        "5. Bb5 Bc5 6. c3 O-O 7. Bxc6 dxc6 8. Bg5 h6": "Forcing a decision.",
        "9. Bxf6 Qxf6 10. Nf3 Bb6 11. O-O Be6 12. Qc2 Rad8": "I have a slight edge in development and use it to seize the open file. Now the game really begins, as the preliminaries are over.",
        "13. Nbd2 Rfe8": "Centralizing my other Rook.",
        "14. b3 Ba5": "Pressuring White's QBP.",
        "15. Nc4 Bxc4": "I was expecting 16 PxB QxP 17 QxQ BxQ 18 R moves, with a Pawn ahead and a long endgame to come where I have a slight, possibly winning, advantage.",
        "16. b4 Bb6": "I'm not sure why my opponent didn't simply recapture the piece but I'll be happy. 16... BxR winning the Exchange was even stronger than the text but I simply overlooked it.",
        "17. Rfe1 Rd3": "Once again focusing on the QBP.",
        "18. Rad1 Qxc3": "I augment my material advantage by one Pawn.",
        "19. Qxc3 Rxc3": "My opponent should have kept the Queens on the board with some such move as 19 Q-N1. With my material advantage any simplifications help me.",
        "20. Nd2 Bxa2": "Winning another Pawn.",
        "21. Re3 Rxe3": "I gladly exchange a pair of Rooks, especially since...",
        "22. fxe3 Bxe3+": "... I win another Pawn into the bargain...",
        "23. Kh1 Bxd2": "...and get to exchange off another set of minors to boot!",
        "24. Rxd2 Bc4": "With the material flying off the board fast and furious, my advantage has become greatly augmented. Now it's an easy win.",
        "25. Rd4 Bb5": "Securing the B in a safe spot.",
        "26. g3 f6": "Planning to tuck my K where it can't be checked.",
        "27. Kg2 Kh7": "I do so.",
        "28. Rd7 Rxe4": "Winning first one...",
        "29. Rxc7 Rxb4": "...and now 2 loose Pawns. As 30 RxQNP is met by 30... B-B8 ch! 31 KxB RxR, White graciously resigns."
    },
    "url": "https://gameknot.com/annotation.pl/fast-invitational-177?gm=40015",
    "gameName": "Fast Invitational 177",
    "players": "badbadboy (1159) vs. last_archimedean (1335)",
    "opening": "Centre game (C22)"
}