{
    "moves": {
        "1. d4 d5 2. c4 Nc6": "This is the Chigorin Defense",
        "3. Nf3 Bg4 4. e3": "My move here according to book is 4. cxe5 and it makes a great deal of sense to me but I was unaware of the standard continuation and the game is into the unknown for me now.",
        "4... e5": "Seeking counterplay and control of the center",
        "5. h3 Bxf3": "5. ... Bf5 6. Nxe5 winning a pawn",
        "6. Qxf3 e4": "I'm not sure about this move. It does push my Queen back and locks up my pawns but I felt it weakened Black's middle. Perhaps I'm incorrect.",
        "7. Qd1": "Black has a slight developmental advantage now but has lost the light squared Bishop",
        "7... Bb4+ 8. Nc3": "I wanted to keep open the possibility of the Bishop pair and did not play 8. Bd2 offering an exchange.",
        "8... dxc4": "Generally in the Queen's Gambit Declined it is best not to take this pawn before White moves the Bishop to d3. I gain back my Tempo lost by retreating the Queen and develop a piece into a strong position now that Black's only central pawn is pushed forward",
        "9. Bxc4 Nf6 10. O-O Qe7": "I'm again not sure about this move. It does setup a longside castle but Black eventually makes a kingside castle. The Queen does support the forward e-pawn in the case of 11. Qc2 but 10. ... 0-0 11. Qc2 Re8 does as well",
        "11. a3": "The Bishop doesn't have the e7 square anymore",
        "11... Bxc3": "This gives me the Bishop pair and further fortifies the d-pawn. I thought 11. ... Bd6 was probably better",
        "12. bxc3 a6": "Preventing my Bishop from getting to the b5 square and eventually taking the Knight and doubling Black's pawns. I wasn't particularly interested in such a minor gain for the loss of my Bishop pair and think this was a further waste of time.",
        "13. a4 O-O": "Not seeing the trap and walking right into it.",
        "14. Ba3 Qd7 15. Bxf8 Kxf8": "I'm feeling pretty good at this point with good development and up an Exchange",
        "16. a5": "I'm hoping to get my Queen to either a4 or b3 threatening to penetrate the Queenside",
        "16... Nd5": "This forces me to protect the c-pawn as I do not want that Knight marauding around in my defense",
        "17. Qb3 Nxa5": "A good looking move at face value attacking both my Queen and Bishop but overlooking my Rook",
        "18. Rxa5 Nb6": "Again attacking the Bishop which is in a very strong position now",
        "19. Be2 Rd8": "Black doesn't really have very many moves available",
        "20. Bg4": "Getting my Bishop back into play as quickly as possible.",
        "20... Qd6 21. c4 Na8": "Anticipating 22. c5 but putting the Knight into a miserable square. However, 21. ... Nc8 22. Bxc8 Rxc8 with Exchanges favoring the player with a material advantage. Probably best is a Queen move like 21. ... Qg6 but my Rook on the fifth rank reduces the Queen's escape routes.",
        "22. Qxb7": "Picking up a pawn",
        "22... Qb6": "Offering the Queen trade as my Queen on the seventh rank is extremely dangerous.",
        "23. Qxa6": "The Queen trade is fine by me but I'll take another pawn first thank you very much",
        "23... Qxa6": "This far arrears in material I think Black is better off avoiding the Queen trade with something like 23. ... Qb2 threatening some damage in the future although White has 24. Rb5 pushing the Queen around",
        "24. Rxa6 Nb6 25. Rc1": "Now the Knight is going to have an extremely difficult time penetrating into White's defensive area and with my material advantage Black decided that it was time to resign. There are no immediate threats but it will be very difficult to prevent White from using the Rooks to force a trade losing Black's last effective piece. I was pleased with my play in this game particularly because I was coming off of two games where I played relatively poorly. "
    },
    "url": "https://gameknot.com/annotation.pl/fast-ladder?gm=29341",
    "gameName": "Fast Ladder",
    "players": "tomlib (1452) vs. viejo (1471)",
    "opening": "QGD (D07), Chigorin defence"
}