{
    "moves": {
        "1. e4": "I realize neither this game nor I am particularly good. I just wanted to annotate something for my own benefit.",
        "1... c5": "The best response to e4 in my opinion. e5 tends to turn into an uninteresting game.",
        "2. d4": "A bit unexpected, but playable. Better would be to stick to theory and play Nf3.",
        "2... cxd4": "Natural move.",
        "3. Qxd4 Nc6": "Develops with tempo.",
        "4. Qe3 g6": "Preparing to fianchetto the bishop, seems like a sound decision.",
        "5. Bb5": "? Not completely sure what this accomplishes, although it does develop a piece and applies pressure towards the king.",
        "5... Bg7": "Following through.",
        "6. Bxc6": "Better to develop more pieces than to trade mindlessly.",
        "6... dxc6": "Opens up a file for the queen, and later the rook. As well, keeps the pawn islands.",
        "7. e5": "Slightly premature pushing of the pawn, although it does block off the bishop nicely.",
        "7... Bf5": "Develops other bishop while attacking at the same time.",
        "8. Na3": "Awkward way of defending the pawn.",
        "8... Qc7": "Threatening the e pawn as well as making way for the rook to come through.",
        "9. Nf3": "Solid move, prepares to castle, defends the pawn, develops a piece.",
        "9... O-O-O": "I decide the queenside is safe for castling, and since it activates the rook at the same time, it seemed like a good move.",
        "10. Ng5": "Threatening a fork that is hard to defend against.",
        "10... Nh6": "I debated playing Bg6 instead, but thought the bishop would have a strong diagonal once the e pawn is gone.",
        "11. Nxf7": "Blunder as far as I know.",
        "11... Nxf7 12. f4": "Best way of defending the pawn.",
        "12... Bh6": "Puts pressure on the f pawn.",
        "13. g3": "Defends f pawn, but it didn't need defending. Castling looks less appealing after this though.",
        "13... Nxe5": "Comic relief:\nThe f pawn's pinned so I can take the e pawn for free! [Yes I blundered].",
        "14. Qxe5 Qd7": "and the attack begins! Black still seems better after that blunder, as black has a strong bishop pair, connected rooks, and a potential attack.",
        "15. Qc5": "?? attacking the a pawn?",
        "15... Qd1+": "Ouch.",
        "16. Kf2 Qxh1": "White should probably resign just about here. That was a pretty big blunder.",
        "17. Qxe7": "Takes a \"free pawn\" =/",
        "17... Qxh2+": "There wasn't much white could do to prevent check and loss of pawn anyhow.",
        "18. Kf3": "Probably not the best square to retreat to, although the back rank doesn't look too appealing either.",
        "18... Bg4+": "!? Bishop sac. If white plays Ke3, Re8 wins queen. If Kxg4...",
        "19. Kxg4 Qh5#": "Mate. I've always liked piece-sac mates. I admit this wasn't much of a game though... but interesting to analyze, as I am not so great at fast attacks."
    },
    "url": "https://gameknot.com/annotation.pl/fast-attack?gm=7321",
    "gameName": "Fast attack",
    "players": "  vs. zephyravatar (1200)",
    "opening": "Sicilian (B21), Andreaschek gambit"
}