{
    "moves": {
        "1. e4": "Hi everyone! This was one of the most interesting games I have ever played, so I thought I might share it with you. My favorite style of play is sacrificial play with forced lines, but as I am a very low level chess player and new to this game, I rarely get the chance to play them myself. However, in this game an opportunity presented itself where i could sacrifice a piece, and if the bait was taken - as far as i could see, but i actually made a couple of blunders on the way according to the postgame analyzes, giving him the opportunity to escape  - every move after that would lead to me winning the end game, and in many variations if he should make the wrong move, check mate. ",
        "1... c5 2. Bc4 Nc6 3. Qh5": "He begins with an opening i was not very familiar with (he is white and I am black). Queen straight to h5 pointing at checkmate at f7 if no action is taken. At his rank i thought it odd to go for such an obvious line, but then again he was probably expecting me to see this move, yet hoping to capture pawn at c5 if i played g6. ",
        "3... e6": "Instead I play e6, preventing checkmate and protecting pawn.",
        "4. Nh3": "knight to h3 is also a move i rarely see used, instead of f3. Probably he was leaving f3 open for queen in anticipation of g6..",
        "4... g6 5. Qf3": "g6 and f3 comes.",
        "5... Nf6 6. c3 Ne5 7. Qe2": "at this point i feel that his initial attack is fended off well and i am slightly ahead in development as a result.",
        "7... Bg7 8. f3 O-O 9. d4 cxd4 10. cxd4 Nxc4 11. Qxc4 d5 12. exd5 exd5 13. Qb3": "Here i see that his king is very vulnerable, so i make an effort to remove his castling rights, which becomes cruicial later on. ",
        "13... Qa5+ 14. Bd2 Re8+ 15. Kf2 Qa6 16. Nc3 Ng4+": "And here comes the sacrifice. Had he not taken the bait and moved 17. Kg3 instead then i think he would have been better after 17. ..Qd6+ 18. Bf4 although he would still have a vulnerable position. ",
        "17. fxg4": "From here on and out, a long line of forced play resulting in me getting the win at move 25. takes place. ",
        "17... Bxd4+ 18. Kg3 Qd3+ 19. Kh4 Bf6+": "This was my first blunder. Because after 20. Bg5 he would have managed to escape. Correct move would have been 19. ..Qxd2",
        "20. g5": "Luckily he makes this move instead, and the checking continues.",
        "20... Qd4+ 21. Bf4 Bxg5+ 22. Kxg5 Re5+ 23. Kh4 Bxh3": "Once again i make a mistake! Had he played 24. Rf1 now, he would have managed to escape.",
        "24. Kxh3": "Luckily he takes the bait once more, and now the deal is sealed.",
        "24... Qxf4": "here he has to prevent checkmate at 25. ..Rh5, and the only play available is his next move;",
        "25. g3": "g3. threatening queen and opening g2 for his king to escape.",
        "25... Qf3": "But here comes the nail in the coffin. After this move, he has no option but to sacrifice his queen to prevent 26. ..Rh5 checkmate. The game goes on for 25 more moves, but it is already clear that if dont make any mistakes, this game is won. I probably could have played a more effective end game, but my mind was already considering this a win (never a good idea i guess), so i focused on my other games and just made sure not to lose my advantage.",
        "26. Qxd5 Rxd5 27. Nxd5 Qxd5 28. Rhd1 Qf3 29. Rdf1 Qh5+ 30. Kg2 Re8 31. Rf2 Re2 32. Raf1 Qd5+ 33. Kg1 Rxf2 34. Rxf2 Qd4 35. Kg2 Kg7 36. b3 Qc5 37. g4 a5 38. a4 Qd5+ 39. Rf3 Qe4 40. Kg3 Qb4 41. h3 b5 42. axb5 Qxb5 43. Kg2 h5 44. Kg3 hxg4 45. hxg4 Qg5 46. Rf4 f5 47. Kf3 fxg4+ 48. Rxg4 Qd5+ 49. Re4 Qxb3+": "To me this was a very fun game, and despite some mistakes that could have ruined my plan, I think it is a good example of how important it is to think of the possibilities you have many moves ahead, not just the obvious ones that are right in front of you in plain sight :)"
    },
    "url": "https://gameknot.com/annotation.pl/fast-ladder?gm=61413",
    "gameName": "Fast Ladder",
    "players": "smallfry425 (1624) vs. isakheim (1543)",
    "opening": "Sicilian defence (B20)"
}