{
    "moves": {
        "1. d4": "This is a strange game that vacillated between Queen's Pawn Gambit Declined and Accepted and ended up not really conforming to anything that I can find. ",
        "1... d5 2. c4 e6": "Looking like QPG Declined",
        "3. Nf3": "I go back and forth between this and Nc3",
        "3... dxc4": "Now the Gambit is accepted and I'm flummoxed",
        "4. e4": "I like e4 when the Gambit is accepted by as far as I can tell we are out of book at this point",
        "4... Bb4+": "Development with check",
        "5. Nc3": "I like my dark squared Bishop in the accepted gambit and this also develops my Knight",
        "5... Bxc3+": "This surprised me. Black loses his one developed piece and my control of the center is very strong now",
        "6. bxc3 b5": "I think trying to save the c pawn in the Gambit Accepted is usually a dangerous idea.",
        "7. a4": "I remember when I first learned about a4 in this situation (from books) and was very happy.",
        "7... c6 8. Ne5": "I decided on a second knight move here because it puts pressure on the back c pawn and prevents devopment of black's queen side knight. It does delay my development for a move and 8. ... f6 is possible to drive me away although weakining the King side.",
        "8... Nf6": "Developing and attacking my e pawn",
        "9. Ba3": "I was eager to prevent the castle and completely overlooked my hanging e pawn. Ooops.",
        "9... Ba6": "Missed the free pawn and continues to support the b pawn. I'm guessing my opponent is hoping for eventually opening of the diagonal but I think this puts the Bishop in a poor position.",
        "10. Qc2": "I thought this was a better spot for my Queen to cover the formerly hanging e pawn rather than 10. Qe2 because she can develop if the e pawn ever moves forward",
        "10... Qb6": "I think hoping for eventually 11. ... Nbd7 12. Nxd7 Nxd7 to get rid of my well placed knight",
        "11. Rb1": "Pinning the b pawn",
        "11... Nbd7": "Because of the pin I don't have to exchange or retreat anymore",
        "12. Nxc4 Qc7": "Preventing 13. Nd6+. Also available was 12. ... Qb8. Both 12. ... Qb7 and 12. Qc8 run into 13. Nd6+ Royal Fork",
        "13. Bd6": "I'm thinking eventually e5 makes that Bishop difficult to dislodge. It also continues to prevent the Kingside Castle and threatens the Queen preventing black from 13. ... bxc4. I also thought about 13. e5 now but I'm still several moves from castling on my Kingside and I didn't want the knight heading in that direction",
        "13... Qc8": "The fork threat is now gone because my dark squared Bishop occupies the d6 square",
        "14. Ne5": "I was just thinking that moving forward and keeping the initiative is good here.",
        "14... bxa4": "I think anticipating 14. Bxa6 Qxa6 and winning a pawn",
        "15. Nxd7": "This is a crucial move. There are a lot of variations including 15. ... Nxd7 and 15. ... Kxd7. I think 15. ... Nxd7 is the best because it keeps the light squared Bishop covered by the Queen although allows 16. e5 and keeps the king stuck in the center. Also possible for white after 15. ... Nxd7 is 16. Bd3 Bxd3 17. Qxd3 Nf6. It is a bit too complex for me to fullly analyze. ",
        "15... Qxd7": "I suppose thinking that the pawn gain is secure after 16. Bxa6 Qxd6 but overlooking the eventually game continuation",
        "16. Bxa6 Qxd6 17. e5": "This is the move I think my opponent overlooked which gains me a piece. Prior to this move I'm still down my Gambited pawn but have had the intiative all game.",
        "17... Qa3 18. exf6 c5": "I guess forgetting about the hanging g pawn",
        "19. fxg7 Rg8 20. O-O": "Getting my king to safety and connecting my rooks ",
        "20... cxd4": "I'm not sure why not 20. ... Rxg7 here. If 21. dxc5 my doubled pawns are both weak this move also allows me 21. Qxh7 Ke7 22. cxd4. However, I choose a different line hoping for more.",
        "21. cxd4 Rxg7": "Either not seeing 22. Qc6+ Ke7 23. Qxa8 or hoping that getting the Queen to h3 will result in a mate before my material advantage comes into play",
        "22. Qc6+ Ke7 23. Qxa8 Qh3 24. Qxa7+": "I pick up a loose pawn with the check keeping a wary eye on the mate at Qxg2",
        "24... Kf6 25. Bb7": "My light squared Bishop is going to be difficult to dislodge from this protecting diagonal",
        "25... h5": "I thought 25. Kf6 Qxa4 26. f6 Be4 might be better hoping to continually push my Bishop around because it cannot leave the diagonal",
        "26. Qxa4 h4": "I guess thinking of lining up the rook and queen and getting the pawn to h3.",
        "27. Qb3": "This forces a queen trade. 27. ... Qf5 28. Qf3 Qxf3 29. Bxf3 or 27. ... Qxb3 Rxb3, or the game continuation",
        "27... Qg4 28. Qf3+": "With the queen now off the board and a rook, bishop and pawn material lead black has almost no hope of gaining a draw or mate and resigns."
    },
    "url": "https://gameknot.com/annotation.pl/fast-ladder?gm=28566",
    "gameName": "Fast Ladder",
    "players": "tomlib (1421) vs. joak (1168)",
    "opening": "QGD Slav (D30)"
}