{
    "moves": {
        "1. e4": "Hard on the heels of my thousandth win, here's the thousandth loss.  Again, nothing remarkable: just a few errors and an inevitable decline.  The Fast Ladder has exposed me to many more good players, who simply milk me for the wins necessary to keep them at the top of the table.  The last time I played dawnjones, he strangled me to death. This time is less extreme.",
        "1... c5 2. Nf3 d6 3. Bb5+": "I have a book on the Bb5 Sicilian by Richard Palliser.  I've never read it, though: maybe I should.  This is the Moscow Variation.",
        "3... Bd7": "This seems to me to be the most robust response and, according to Palliser, remains the main defence.",
        "4. Bxd7+ Nxd7 5. O-O Ngf6 6. Qe2 e5": "Played in response to a perceived threat to advance the e-pawn, though I suspect White would have proceeded more circumspectly.",
        "7. Nc3": "This N, developing normally, threatens to exploit Black's weak white squares.",
        "7... a6": "So Black covers one of them.",
        "8. d3 Be7 9. a4": "White deters Black's natural ...b5.  If he can get a5 in, he will then cramp Black's queenside and be able to run the game to his liking.",
        "9... O-O": "Black concentrates on his King's safety, allowing White to play the threatened advance.",
        "10. a5 b5": "I reasoned that if White didn't take en passant I would have a pleasant pawn front.  If White did take, the cramp would be eased immediately by the N recapturing.",
        "11. axb6 e.p. Nxb6 12. Bd2 Qc7 13. Ra2": "Now White threatens to double on the half-open a-file.  White is playing simple, logical chess, forcing Black to respond. Eventually, Black will crack and White win.",
        "13... Ra7 14. Rfa1 Rfa8 15. h3 h6 16. b3 Nh5": "?  Here it is.  Black misses a simple trick that wins a pawn.",
        "17. Nxe5": "!",
        "17... dxe5 18. Qxh5 Qc6": "?  Now Black unaccountably gives another pawn away.  18...Qd6 would have defended both h6 and e5.",
        "19. Qxe5 Bf6 20. Qf5 Nd7 21. Nd5": "! White dominates the centre, with ideas such as delivering check from e7 and forking Black's Q (not immediately feasible due to the Bf6, but what if Black were tempted to win the exchange on a1?)",
        "21... Qe6": "Black covers e7 and offers to swap Queens: not very good when 2 pawns down.",
        "22. Qxe6": "Naturally, White accepts the swap.",
        "22... fxe6 23. Nxf6+": "Now N for B, as the B was now threatening to win the exchange after all.  Black's pawns look pathetic.",
        "23... Nxf6 24. Be3 Nd7 25. b4": "Now, unless Black gives up the exchange, the c5 pawn can't move and Black's rooks are overloaded, so, if one of them tries to defend c5, the a-pawn falls.",
        "25... Nb8": "Black gives up the c-pawn, over-defending the a-pawn so that the Ra7 can move when attacked.",
        "26. Bxc5 Rf7 27. b5": "Once again, a black pawn is over-powered.",
        "27... Nd7": "defence by counter-threat..",
        "28. Ra2xa6 Rxa6 29. bxa6": "Now White has a remote protected passed pawn.  Black might as well resign, even if he can take the Bc5.",
        "29... Nxc5 30. a7 Rxa7 31. Rxa7": "Three pawns and the exchange up, the game is effectively White's now.  I played a couple more token moves then resigned.",
        "31... Kf8 32. f4 g6 33. Kf2": ""
    },
    "url": "https://gameknot.com/annotation.pl/fast-ladder-my-thousandth-loss-on-gk?gm=29433",
    "gameName": "Fast Ladder - My Thousandth Loss on GK",
    "players": "dawnjones (2127) vs. rjacobs (1509)",
    "opening": "Sicilian (B52), Canal-Sokolsky attack, Bronstein gambit"
}