{
    "moves": {
        "1. e4 c5": "The Sicilian.  I play it myself but don't necessarily do very well against it ...",
        "2. Nf3 d6 3. d4 cxd4 4. Nxd4 Nf6 5. Nc3 g6": "The Dragon Variation, not something I know much about, though I am doing alright in a tourney devoted to it on Gameknot at present.",
        "6. Bc4 Bg7 7. Be3 Nc6": "Both sides are developing as quickly as possible at this stage.  There are, of course, many options at each move but I think this is a main line.",
        "8. f3": "Supports e4 and prevents the annoying ..Ng4",
        "8... O-O 9. Qd2 Bd7 10. Nde2": "White keeps his options open as to which side to castle for as long as possible.",
        "10... a6": "Is this to prevent White's N or B from moving to b5 or to support ...b5?  Or both?",
        "11. Bh6": "Fulfilling the purpose of 9. Qd2 but is the timing right?  White doesn't seem to have a convincing follow-up and is still slightly vulnerable due to being uncastled.",
        "11... Ne5": "Black counters with an attack on the undefended Bc4.",
        "12. Bb3": "So the B retreats to its predetermined refuge.",
        "12... Rc8": "A standard developing move occupying the half-open c-file, typical of the Sicilian.",
        "13. h4": "With the g7-h6 situation unresolved, White sees an opportunity to increase the pressure with a kingside storm.  This rather commits White to either castling queenside or not castling at all, which both seem high-risk options, given the way that Black's pieces are arranged.",
        "13... Nc4": "The N forks White's Q and bP.  The threat on the Q undermines her support of the B on h6.  I his uncastled position, White needs to be v careful.",
        "14. Bxc4": "So White swaps the long-term asset, the WSB, for the immediately threatening N.",
        "14... Rxc4 15. O-O-O": "... and finally commits to the Q-side.  I think White's K-side attack is slightly more advanced than Black's Q-side attack.  Let's see...\n",
        "15... Qa5": "An immediate riposte.",
        "16. Kb1": "A standard defensive move when castled Q-side - but isn't it a bit slow?  I always find these decisions very difficult but I think the Ns were too tied down while the a-pawn was not defended by another piece.",
        "16... Rfc8": "Black proceeds to increase the pressure on the recently castled K.  White's decision doesn't look too wise at present.  Since the castling, Black has made 2 seriously attacking moves, White is on the defensive.",
        "17. Bxg7": "Time to resume the offensive before it's too late ...",
        "17... Kxg7 18. g4 b5": "Classic attack and counter-attack on opposite wings.",
        "19. h5 b4 20. hxg6": "White allows bxc3 in order to deliver Qh6+, intending to deliver mate before Black can.",
        "20... fxg6 21. Qh6+ Kg8 22. g5": "To dislodge the N that protects h7",
        "22... Nh5 23. Rxh5": "Now White commits fully to the attack by sacrificing the exchange.  It's win or bust!",
        "23... gxh5 24. Nd5": "Another critical decision.  The N moves from defence, where it was attacked, to attack, threatening a fork on e7.  Black has no immediately obvious attacking responses so ... ",
        "24... Qd8": "Black protects e7 but his attack loses its sting.",
        "25. g6": "Threatens immediate mate or crushing opening of lines and a future mate.",
        "25... hxg6 26. Qxg6+ Kf8 27. Rg1": "Black resigned as mate could not be prevented."
    },
    "url": "https://gameknot.com/annotation.pl/fast-ladder?gm=48477",
    "gameName": "Fast Ladder",
    "players": "rjacobs (1523) vs. srbijajan (1920)",
    "opening": "Sicilian (B70), dragon variation"
}