{
    "moves": {
        "1. d4": "Some games just kind of 'spring to life' in the middle game after what seems to be a pretty routine opening. In this game it suddenly occurred to me that all my pieces were trained on a key square; I hadn't quite planned it like that. In fact, all I'd played were natural opening moves. I'm black, by the way. Can you guess the key square? (Clue: Traditionally the weakest square on white's side of the board).",
        "1... d5 2. Nf3 Nf6 3. e3": "3.e3 always strikes me as handing the initiative to black immediately. Of course, it can lead to the Colle System opening, but that brought terror to black 80 years ago. These days for white, if black knows what he is doing, it hardly offers any advantage. ",
        "3... e6 4. Bd3 Nbd7 5. Nbd2 b6": "I thought about 5...c5, but it seemed more dynamic to prepare the advance of the c-pawn so after a dxc5 capture I could recapture with the b-pawn (and give the bishop an outlet on b7). Just a matter of taste, I suppose.",
        "6. O-O Bb7 7. Re1 Ne4": "I played this to prevent 8.e4.",
        "8. c3 Bd6 9. Bc2": "So white can follow up with 10.Nxe4 and 11.Nd2",
        "9... f5": "Logical, so a recapture on e5 (with the f-pawn) would open the f-file and give black chances on the king side. Already black's position seems preferable.",
        "10. Nf1": "My guess this was to add extra protection against a possible f4, and maybe to play N3d2 and f3 to evict the e4 knight.",
        "10... c5 11. Ba4 O-O 12. Bxd7": "With this move white loses three tempi (the bishop has moved to d3, c2, a4 and d7 (four moves) to capture a black knight that has made just one move (to d7). It also gives black the two bishops, and gets rid of white's best bishop (the one on c1 is still hemmed in by a phalanx of pawns on black squares (f2, e3, d4, c3 and b2) that aren't going anywhere in a hurry).",
        "12... Qxd7 13. dxc5": "Not the best idea. Now black has a majority of pawns in the centre (c5, d5, e6 and f5) to white's c3, e3 and f2.",
        "13... bxc5 14. Qc2 c4": "Taking control of d3. The temporary loss of control of d4 will be offset as soon as e5 is played by black. At this point I really began to like my position, which has got steadily better without white making obvious mistakes (though Nimzowitsch would not have approved of sacrificing time with the white-squared bishop).",
        "15. Rd1 Rac8 16. Ne1 e5 17. Rb1": "Contrast white's first rank with the harmonious arrangement of black's pieces.",
        "17... Bc5": "To support a d4 push.",
        "18. Nf3 Qe6": "Moving the queen off the x-ray attack from the white rook on d1.",
        "19. Nf3d2 d4 20. cxd4 exd4 21. Qxc4 Bd5 22. Qe2": "And this is the key moment. Up until now I'd been thinking only really of a central breakthrough, but now I spotted that everything was pointing towards white's f2 square. The next move took some calculating . . . actually the start of a combination 7 moves long; but not a terribly difficult combination because the number of branches ('Think Like A Grandmaster'!) were pretty few.",
        "22... Nxf2": "A thunderbolt. Now 23.Qxf2 runs into 23...dxe3.",
        "23. Kxf2 dxe3+": "And so does 23.Kxf2!",
        "24. Nxe3 f4": "The knight is pinned.",
        "25. Nf3 fxe3+ 26. Bxe3 Bxf3": "A crucial move in the combination, as we shall see . . .",
        "27. gxf3 Rfe8": "Triple attack on a pinned piece.",
        "28. Rd3": "Three defenders.",
        "28... Bxe3+ 29. Rxe3 Qxe3+": "And white now resigns. The key element is the pawn at f3 which, after 30.Qxe3 Rc2+ prevents the king moving there to protect the queen. Black ends up a rook ahead.\n\nAn interesting game, I think; notice that all black's space and time advantages, plus some logical play in the centre, set up a winning combination quicker that you can type Kirsan Ilyumzhinov! "
    },
    "url": "https://gameknot.com/annotation.pl/fast-ladder?gm=34257",
    "gameName": "Fast Ladder",
    "players": "dennissharp (1827) vs. sligunner (2117)",
    "opening": "Queen's pawn game (D05)"
}