{
    "moves": {
        "1. e3": "An unusual, slow opening for White.",
        "1... e5": "I respond with the natural move.",
        "2. Nf3 Nc6 3. Bc4 d5": "Cutting off the potential attack at KB2, the natural weak spot in all K-side openings.",
        "4. Bb3 Nf6 5. d4 e4": "I lock the center and drive his King Knight away from KB3.",
        "6. Nfd2 Be6 7. c4 Bb4 8. cxd5 Bxd5 9. Bxd5 Qxd5": "The first skirmish of the game yields an even exchange.",
        "10. a3 Bd6 11. Nc3 Qg5 12. Ndxe4": "Wins a Pawn.",
        "12... Nxe4 13. Nxe4 Qxg2": "I win it back. 15 N-N3 saves both attacked pieces.",
        "14. Rf1 Qxe4": "Now I'm up a Knight.",
        "15. Bd2 Nxd4": "And a Pawn.",
        "16. Qa4+ Nc6": "Curiously, neither of us notices I've just left my Queen en prise.",
        "17. Bc3": "I could now effectively end the game -- and save myself 90 moves of trouble -- with 17... QxQ.",
        "17... O-O": "Whoops...",
        "18. Qxe4": "Now he notices.",
        "18... Rad8": "Given the way we're both blundering away material I feel I have a chance he'll throw his Queen away at some point.",
        "19. Rg1 g6 20. Qh4 Rd7 21. Qh6 f6": "I may have given away my Queen but I'm not going to overlook the mate threat on KN2.",
        "22. O-O-O Rff7 23. h4 Ne7 24. h5 Nf5 25. Rxg6+ hxg6": "This enables him to simplify down.",
        "26. Qxg6+ Kf8 27. Bxf6": "27 QxN was better, but this should still be good enough to win.",
        "27... Ng7": "I save the piece.",
        "28. h6 Ne8 29. Rh1": "That passed Pawn looks threatening...",
        "29... Rfh7": "...so I block it.",
        "30. Bd4 a6 31. Qf5+ Kg8 32. Qxd7 Rxd7": "What do you know, he *did* blunder away his Q! Now I'm back about even. The passed Pawn is still a concern though.",
        "33. f3 Rh7 34. e4 Bf4+": "Not anymore it isn't...",
        "35. Kc2 Rxh6": "With White's two connected passed Pawns this game still has a lot of fight left.",
        "36. Rg1+ Kf7 37. Kc3 Rh3 38. Kc4": "An error. R-KB1 guarding the P was the right move.",
        "38... Rxf3 39. a4 Be3 40. Bxe3 Rxe3": "I didn't expect him to swap down so agreeably easily.",
        "41. Kd4 Re2 42. b4 Rf2 43. b5 axb5 44. axb5": "A pair of Pawns fall on the Q-side.",
        "44... Rb2 45. Kc5 Re2 46. Rf1+ Ke6 47. b6 c6": "Naturally not 47... PxP? 48 KxP threatening my final Pawn.",
        "48. Rh1 Rxe4 49. Rh7 Nd6 50. Rh6+ Ke7": "White fights tenaciously. Here he wins my Knight with a nice tactical maneuver.",
        "51. Rxd6 Re6": "I'm hoping for 52 RxR KxR with a book win.",
        "52. Rd1 Re5+ 53. Kc4 Ke6": "I have to slowly push White back.",
        "54. Ra1 Rb5 55. Re1+ Kd6 56. Rd1+ Rd5": "Now if 57 RxR PxR 58 K-Q4 K-B3 59 K-K5 KxP 60 KxP I have a book win.",
        "57. Rh1 Re5 58. Rh6+ Re6 59. Rh8 Re7 60. Rb8 Rd7 61. Kd4 c5+": "I finally advance a Pawn.",
        "62. Kc4 Kc6 63. Rf8 Kxb6": "White's last Pawn falls.",
        "64. Rf6+ Kc7 65. Kxc5 Re7 66. Kb5 Re5+": "The King must retreat.",
        "67. Kc4 b6 68. Rf7+ Kc6 69. Rf6+ Kb7 70. Kd4 Rc5 71. Rf7+ Rc7": "With 71 RxR KxR 72 K-B4 K-B3, White could here obtain a book draw.",
        "72. Rf6 Ka6 73. Kd5 Ka5 74. Rf3 b5 75. Ra3+ Kb4": "Now that my King is in front of my Pawn, White can no longer obtain a book draw by trading the Rooks.",
        "76. Ra1 Rc3 77. Rb1+ Rb3 78. Ra1 Rc3 79. Rb1+ Ka4 80. Kd4 b4 81. Rb2 Ka3 82. Rb1 Rc2": "I slowly gain ground.",
        "83. Kd3 b3 84. Ra1+ Kb2 85. Ra6 Kb1 86. Rb6 b2": "Finally. Now I just have to move my King out of the way.",
        "87. Rb3 Kc1 88. Rxb2 Rxb2": "The rest is, as they say, but a matter of technique.",
        "89. Kd4 Rb3 90. Kc4 Kc2 91. Kd4 Rd3+ 92. Ke4 Kc3 93. Ke5 Rd4 94. Ke6 Kc4 95. Ke5 Kc5 96. Ke6 Rd5 97. Kf6 Kd6 98. Kg6 Ke6 99. Kg7 Rf5 100. Kg6 Ke5 101. Kg7 Rf6 102. Kh7 Kf5 103. Kg7 Kg5 104. Kh7 Rg6 105. Kh8 Kf6 106. Kh7 Kf7 107. Kh8 Rg5 108. Kh7 Rh5#": "And... finally.... finis."
    },
    "url": "https://gameknot.com/annotation.pl/fast-ladder?gm=53399",
    "gameName": "Fast Ladder",
    "players": "scoutyscout (1332) vs. last_archimedean (1412)",
    "opening": "Amsterdam attack (A00)"
}