{
    "moves": {
        "1. d4": "Another game from fatcat2's mini-tournament.",
        "1... Nf6": "Black has chosen the move that could branch into many main line queen pawn openings, such as the Nimzo-Indian Defence, Benoni Defence and King's Indian Defence, or transposing back to Classical Queen's Gambit Declined.",
        "2. c4 e6 3. Nc3 Bb4": "Black opts for the Nimzo-Indian.",
        "4. e3 Bxc3+ 5. bxc3 Ne4 6. Qc2 f5": "Black has a pawn formation faintly reminiscent of the Dutch Defence.",
        "7. Bd3 Nf6 8. Ne2": "I have a lead in development, and I am trying to prevent Black from catching up.",
        "8... d6": "A move like this can only increase White's lead in development. If Black wants to get his bishop out that way, he has a whole chain of pawns to move! By contrast, he can develop his bishop far more quickly by fianchettoing it, or even placing it on a6.",
        "9. O-O Nc6 10. Ba3 Bd7 11. Rab1 b6 12. Rfe1": "Let me be honest here: I had completely run out of ideas. I fell into a vicious circle of simply playing solid, \"waiting\" moves and hoping my opponent would do something exciting.",
        "12... g5 13. f4": "I think this can be classed as \"something exciting\"! I was hoping to break open Black's kingside pawn shell, then if he decided to castle there (unlikely!) I could perform a bold sortie for the king's head...!",
        "13... Ng4 14. Ng3 h6 15. h3 Nf6 16. e4": "Let's open up the centre a little. White's powerful four advanced pawns are a thing of beauty, but how long will they last?",
        "16... gxf4 17. Ne2 f3 18. gxf3": "I can see nothing wrong with accepting the pawn. Clearly it divests my king of any protecting pawns, but if, say, ...Rg8  Kh2, followed by Rg1 if necessary to cover the g-file.",
        "18... Nh5": "Opening up a route onto the kingside for Black's queen, to say nothing of an offensive knight and rook.",
        "19. Kh2": "I didn't wait for ...Rg8  or ...Qg4 . I went for immediate protection. I did not want White to have an extra attacking move while I brought my king out of check.",
        "19... Rg8 20. Reg1": "Now the rooks are eyeballing each other down the g-file. Hopefully I can get an exchange: after 21...Rxg1 22.Rxg1 I have a rook on the open file and he doesn't...",
        "20... Rxg1 21. Rxg1": "This relinquishing of the open file was Black's long-term error. It cleared the way for a devastating tactic...",
        "21... Qh4 22. Rg8+": "...like this one, winning a rook.",
        "22... Ke7 23. Rxa8 Qf2+ 24. Kh1 Qxf3+ 25. Kg1 Qxh3 26. Kf2 fxe4 27. Bxe4 e5 28. d5 Nd8 29. Rxa7 Nf7 30. Rxc7 Kd8 31. Rb7 Ng5 32. Qd3 Qh2+": "At around this point, while shoving my king around mercilessly, my opponent exclaimed, \"There has to be a forced mate somewhere!\". I sincerely hoped he was wrong.",
        "33. Ke1 Nxe4 34. Qxe4 Ng3 35. Nxg3 Qxg3+ 36. Kd2 Qf2+ 37. Qe2 Qxe2+ 38. Kxe2": "Exchanges, exchanges, exchanges...what does my opponent get out of them? Less than nothing.",
        "38... Ke7 39. Rxb6 h5 40. Rxd6 h4 41. Rh6+": "Black's position is hopeless, and he resigns."
    },
    "url": "https://gameknot.com/annotation.pl/fatcat2s-mini-tournament?gm=20812",
    "gameName": "fatcat2's mini-tournament",
    "players": "fatcat2 (1389) vs. bennythoms (1337)",
    "opening": "Nimzo-Indian (E40), 4.e3"
}