{
    "moves": {
        "1. e4": "Carlos Chepillo es un jugador ordenado,pero a veces esto decanta en ser pasivo, por lo que desde el principio, busqué un juego que me diera oportunidades de ataque.",
        "1... e6": "Aps, una defensa francesa",
        "2. d4 d5 3. Nd2": "la \"mal llamada\" variante Tarrasch",
        "3... dxe4": "Parece que iremos por senderos más tranquilo de los que yo esperaba, tal vez era mejor utilizar la variante del avance o bien la variante del cambio",
        "4. Nxe4 Be7 5. Bd3 Nf6 6. Nf3 Nbd7": "\"amenazando\" con cambiar todo... si bien es perfectamente posible (se obtiene el control de \"e5\" por un buen rato) preferí mantener las piezas en el tablero",
        "7. Ng3 b6": "Ya me dieron ganas de realizar algo en el flanco de dama... las casillas blancas, como en la memorable Capablanca - Nimzovitch. ",
        "8. O-O O-O 9. Qe2": "Apuntando a las susodichas casillas blancas y preparando el paso a la torre en \"d1\". Claro, todo esto ya se había jugado, pero en ese momento no lo sabía. ",
        "9... Bb7 10. Rd1 Qc8": "Rayos... mi invasión tendrá que esperar, por otro lado, tácticamente hablando, el alfil de \"e7\" está un instante en el aire... se ve venir un Cf5. Evalué que, si lo hago de inmediato, seguiría 11 Cf5, ef; 12 De7, Af3; 13 gf, Te8; 14 Da3 y no me convencía la posición de las blancas. ¿Por qué no llevar las piezas al centro? ",
        "11. Ne5": "11 c3 con idea de Ag5 y Ce5 se había jugado en 1920 (!!) ",
        "11... c5": "¡Chepi está vivo! y reacciona en el centro",
        "12. Nxd7 Nxd7 13. Nf5": "Pensando que en todas quedo mejor, pero igual existirán ciertas complicaciones. 13 Dh5 también es una opción viable. El tema es que las blancas tienen más piezas participando en el flanco, pero faltan debilidades",
        "13... exf5 14. Qxe7 Nf6": "Defendiendo f5 y no permitiendo que mi dama se vaya al flanco de rey. Ahora tenía la opción de tomar en c5 o desarrollar primero el alfil dama. Al parecer, el negro no tiene opciones o son remotas, de realizar algo contundente por la diagonal h1-a8",
        "15. dxc5 bxc5 16. Be3": "En fin, decidí hacer ambas. ",
        "16... c4 17. Bxf5": "Ok, hasta acá había calculado, solo que omití que ahora el peón negro de \"c\" estaba en 4 y no en 5. O sea, después de Df5; 18 Db7, Dc2 no tengo la maniobra Tac1 y Tc5. Claro, la posición sigue ofreciendo lucha, pero será por gusto, no me llamaba tanto la atención. Si no conseguía eliminar el peón de \"c\" mi mayoría en el flanco de dama no daría fruto. Sin embargo, Carlos Chepillo realizó...",
        "17... Qc6 18. f3 Nd5": "En esta linea yo pensaba jugar Dc5, pero ví..",
        "19. Qh4": "y pienso que las blancas están bien.",
        "19... g6 20. Be4 Rad8": "Ahora es posible matar el último hombre del flanco de dama: 21 Aa7. Estuve a punto de jugarlo, pero algo cruzo por mi mente, claro, las casillas negras están débiles; Ah6 gana un tiempo, porque amenaza ganar calidad, entonces, lo único que se debe lograr es sacar a la dama negra de \"c6\" para que sea posible un Df6 con mate imparable. 21 Ad5, Td5 22 Td5, Dd5; 23 Ah6 Te8?; 24 Df6 lo consigue, pero es mejor 23.., Tad8 para dar jaque en d4 y cambiar las damas. Tozudamente, intenté",
        "21. Bh6 Rfe8 22. Bxd5": "Con idea de si 22.., Td5?; 23 Td5, Dd5; 24 Df6 :D La defensa del negro, simplemente es dar un jaque en b6, manteniendo la dama en sexta fila y tomando de alfil en d5. ¿Qué hubiese pasado si tomo primero de torre? es lo mismo, solo que hay un detalle: 22 Td5, Db6?; 23 Tc5! Dc5; 24 Rh1 ¡ganando! Eso es lo que calculé en el momento, pero no es cierto, porque, simplemente, las negras dan jaque en d4, apoyadas por la torre de d8, cambiando las damas... esto es prueba del mal estado de mi cálculo...",
        "22... Qb6+": "Ahora, la dama está tomando en b2. Puedo cambiar las damas con Df2, me olvido del flanco de rey y después de los cambios, mi rey controla la entrada de la torre a \"e2\". El problema, el final resultante es de alfiles de colores opuestos, en igualdad de condiciones. No es muy atractiva esta alternativa. Lo otro es mantener las piezas, a costa del peón de b2, pero conservando las damas. Peligroso...",
        "23. Rd4 Rxd5 24. Rad1": "Otra muestra de mi deplorable estado en el cálculo, ahora pensé que Tee8 pierde, por 25 De8 (??) Simplemente, las negras toman, 26.. Td8 y la torre está clavada. Además, se puede tomar de Dama 26.. Dd8 y sigue siendo dama de menos. ",
        "24... Rxd4": "Ok, ya había visto antes, pero pensé en ese momento que el cambio de damas era inminente; o sea, quería entrar en esta linea por si las negras terminaban tentándose con el peón b2 y mantener así las piezas. Pero aquí no puedo tomar de dama. (25 Dd4, Te1!) Molesto por las continuas equivocaciones, me aboqué al análisis de la única opción",
        "25. Rxd4 Qxb2": "En parte, se llegó a lo que esperaba. Si pestañeo pierdo los peones del flanco de dama y el de \"c\" se convertirá en un peligroso verdugo. Mmm, pero las debilidades en el flanco de rey de las negras continuan... ",
        "26. Rd1": "La idea es que si la dama sale de la diagonal negra (a1 - h8) viene 27 Dd4 y por fin hay mate en g7.",
        "26... Qc3": "\"Chepi\" defiende \"c4\" y mantiene el control de la crítica diagonal. Tengo el tiempo para simplificar.. ¡cuidado! si 27 Td8?, Da1 ¡y las negras ganan! hay que \"darse un aire\"",
        "27. h3 Qe5 28. Rd8": "Ahora sí",
        "28... Bc6 29. Rxe8+ Bxe8 30. Qxc4": "Claramente, mi alfil crea más amenazas. ¿Podré crear una segunda debilidad? es necesaria para progresar, ya que las piezas negras están atadas. Tal vez el peón de paso \"c\". Hay que tener cuidado con los jaques de dama, pero como son en casillas negras, tendré la posibilidad de bloquear con mi alfil. ",
        "30... Qe1+ 31. Kh2 Qe5+ 32. f4 Qd6": "\"Chepi\" está atento, cualquier desliz me permite jugar Dd4 o Dc3 y dar mate. La dama ahora se mantiene en la sexta y permite realizar la jugada de bloqueo \"f6\". Ahora evaluaba 33 Dc3, f6 34 Dc4, para obligar al rey a irse al fondo del tablero, 34.., Rh8. (no 34.., Af7?;35 Dc1 y el mate es imparable)",
        "33. Qc3 f6": "Aquí me apareció otra opción, o nuevamente me apareció la opción ¡de acabar con el peón de a7! Mi intuición me decía que mi alfil de h6 estaba quedando encerrado... pero con dos peones libres...",
        "34. Qe3 Kf7 35. Qxa7+ Ke6": "¡Sorpesa! el rey se pasea por las casillas blancas... en este momento ocurrió algo curioso, con el silencio de la sala de juego, ¡se escuchó sonar el estómago de mi rival! claro, ya era hora de almuerzo.. ¿Será por eso que Chepi jugó tan intrépidamente. Era imposible no recordar una partida de Nigel Short, con un rey que se pasea hasta apoyar el mate. ",
        "36. Qxh7 Kf5 37. Qa7": "Ya en apuros de tiempo, solo pensaba en tejer un mate. La idea, De3. ",
        "37... Bc6 38. Qe3": "Ví lo que venía, pero me llamó la atención un detalle en los cambios",
        "38... g5 39. Qg3 Qxf4 40. Bf8": "por fin mi alfil se libera y el final se aclara un poco más para el blanco. Los peones pasados aunque separados pueden ser defendidos por el rey blanco. Se podría pensar que si las negras mantienen las piezas en la misma posición, no hay forma de avanzar, pero las blancas forzarán el cambio con Ad6 en algún momento. ",
        "40... Qxg3+ 41. Kxg3": "Este final probablemente se iguala, manteniendo el alfil de casillas blancas en la diagonal a4 - e8. Aunque, claro, con pocos minutos en el reloj, las cosas cambian.",
        "41... Be4 42. c4 Bc6 43. Kf2 Ke4 44. g4 f5 45. gxf5 Kxf5 46. Kg3": "Al final conseguí pasar el peón de h (!!) forzando al alfil de casillas blancas a la sobrecarga clásica de las dos diagonales y gané en el filo de la caída de bandera."
    },
    "url": "https://gameknot.com/annotation.pl/festival-arica-2010?gm=29143",
    "gameName": "Festival Arica 2010",
    "players": "Mamani, Héctor  vs. Chepillo, Carlos ",
    "opening": "French (C03), Tarrasch"
}