{
    "moves": {
        "1. e4": "5imon is the highest rated player I've managed to beat so far.  So I admit being pleased how this game turned out.",
        "1... d5 2. exd5": "Scandinavian defense.  I think I examined the player's game history to see which opening he was weakest against--I don't remember.  And I'm certainly no expert at any of them--this seems like a waste of a good pawn but I figured I didn't really have much to lose.",
        "2... Qxd5": "Made the pawn back.",
        "3. Nc3 Qd6": "This apparently is the \"Pytel-Wade\" variation of the Scandinavian Defense.\n",
        "4. d4 Nf6 5. Nf3 c6 6. Ne5 Nbd7 7. f4 Qc7": "This, I think, is off book.  Part of the reason I chose it--time to explore new frontiers.\n",
        "8. Bc4": "White now has vexing power on f7.",
        "8... Nxe5": "Countered.  The bad news is white is well developed, while black ends up with a knight and queen barely out in the field.",
        "9. fxe5": "White also has nice strong pawns, and dominates the center of the board.",
        "9... Bg4": "This lets black develop one piece, given white must withdraw to interpose, or move the queen.",
        "10. Qd2 Nd5": "Black should drop a pawn with this exchange, AND have to move the queen.",
        "11. Nxd5 cxd5 12. Bxd5": "Again black is poorly developed, at a big disadvantage positionally, and down a pawn.",
        "12... e6 13. Be4 O-O-O 14. O-O Rd7": "This lets black move the queen off the second rank without losing the f pawn.  But really this was a wasted move.  White's d pawn is vulnerable.",
        "15. b3": "And black suddenly realizes it.",
        "15... Rxd4 16. Rxf7": "Turnabout is fair play.  Had white snatched QxRd4, Bc5 would pin the queen.",
        "16... Qb6": "Black is thinking there has to be a free piece around here somewhere.",
        "17. Qc3+ Rc4+": "Discovered check, but white can interpose a bishop",
        "18. Be3": "Now it's queen for queen, but black gets white's black bishop.  The cost is doubled pawns, and e without any support.  But that bishop--totally worth it.",
        "18... Rxc3 19. Bxb6 axb6 20. h3": "I kept thinking b7 was lost.",
        "20... Bh5": "Even more encouragement for white to snag b7.",
        "21. Rff1 Re3": "White has to move a rook to the e file to save e5.",
        "22. Rae1 Rxe1 23. Rxe1 Bg6": "Black is ahead two points--all even trades count in his favor.  If white doesn't trade the c pawn doesn't actually fall because Rc1 pins BxPc2.  Very bad for black.",
        "24. Bf3": "White thinks black is going to fall for the baited pawn.  Actually, black could take it and interpose Bc5+ to wiggle out of the trap.  I don't remember why I did that first, and lost my opportunity.",
        "24... Bc5+ 25. Kh1 Rd8": "Why didn't I take the pawn?  I wanted to take e5 off the board.  And I realized that with Bc5, white pins the black bishop with b4.  Really painful.  White's c pawn remains toxic bait.  I had to keep reminding myself not to seize it.",
        "26. Be4 Bf2 27. Rf1 Bg3": "With these bishop moves I get to attack e5 while keeping the white king in the corner.  Pe5 is dead.",
        "28. Bxg6 hxg6 29. Kg1 Bxe5 30. Re1": "Now I'm in white's bishop/pawn predicament.  Except the bishop can still count coup on the white king, and then bishop/pawn bond in the middle of the board.",
        "30... Bd4+ 31. Kh2 e5": "So that pawn is safe.  All white's pawns are invisible to black's black bishop.",
        "32. Kg3": "White announces he will send his king out into the fray.  (He really messaged me about this--it was an amusing exchange).  Black decides to protect the only open file from naked white aggression.",
        "32... Rf8 33. Kg4 Kb8": "There was a good reason to scurry the black king out of the way.  So I thought.  In hindsight, this was probably a wasted move and I should have sent my king into the center of the board too.",
        "34. Kg5 Rf6 35. c4": "All potential pressure is off the bishop now.  I played out dozens of scenarios, worried white had some trick up his sleeve to snatch victory from black's jaws.  Black realizes that to push the pawn the rook must get behind it.",
        "35... Re6 36. Re4": "White realizes that to keep black from pushing the pawn, the rook should move in front of it.  Black now has to coax the rook back, or off the file.  All the white pawns remain invisible to the black bishop, and the black rook is tied down defending the lead g pawn.  With the pawn behind it the white king cannot advance any further.",
        "36... Kc7": "Time to follow white's lead, and send out the king.",
        "37. g4 Kc6 38. h4": "White's moves are scary but black has played this out many times--those pawns aren't going to get through.",
        "38... b5": "To move the king any further the c pawn must move.",
        "39. cxb5+ Kxb5": "The black king can now lean on the white rook (once he staggers over there).",
        "40. a3": "The a & b pawns are scary, but they must pass a rook and pawn, as well as the black king.  It seems an empty threat, barring really bad black blunders.",
        "40... Kc5 41. h5": "Black will have to trade, but can lean on the rook first.",
        "41... Kd5 42. Re2 gxh5 43. gxh5 e4": "Black gets two pawn moves.",
        "44. Kf5 e3 45. Kf4 Rf6+": "Black instructs the white king to step away from the pawn.",
        "46. Kg3": "Rf2 will move the white rook.",
        "46... Rf2 47. Re1": "Here the bishop fans the king out of the black rook's corner.",
        "47... Be5+ 48. Kg4 e2": ""
    },
    "url": "https://gameknot.com/annotation.pl/fiat-lux-first-invitational?gm=66796",
    "gameName": "Fiat Lux First Invitational",
    "players": "5imon (1978) vs. lord_shiva (1782)",
    "opening": "Scandinavian (B01), Pytel-Wade variation"
}