{
    "moves": {
        "1. d4": "Come tutti gli chiedevano, Anand cambia apertura passando a 1.d4 e, come tutti speravano, imposta una linea della Nimzo-indiana aggressiva e tagliente ma Carlsen si difende da par suo (e cioè alla perfezione!) fino all’errore del Campione del Mondo (28.Cf1?),  che lo Sfidante punisce immediatamente portando a casa la terza vittoria (a zero) nel Match. Il Numero Uno al Mondo si avvicina così, in sole 28 mosse, a mezzo punto (da ottenere in tre partite!) dal naturale congiungimento con la Corona Mondiale!\nL’andamento di questa partita ci spiega forse il perché del comportamento di Anand nei due precedenti incontri. Probabilmente, e i fatti gli hanno dato ragione, l’indiano non si sentiva in grado di affrontare “Carlsen-Houdini” in una battaglia tattica.  In conferenza stampa si è poi visto un Anand inaspettatamente (visto il grave errore) rilassato, quasi che il Campione del Mondo si sia sentito, finalmente, liberato dal dovere di provare a difendere un Titolo ormai divenuto troppo “pesante”.\n",
        "1... Nf6": ".",
        "2. c4": ".",
        "2... e6": ".",
        "3. Nc3": ".",
        "3... Bb4": ".",
        "4. f3": "Consolida e4+g4\nAltra variante: 4. Nf3 Nc6\n",
        "4... d5": "oppure: 4... c5 5. a3 Ba5 6. dxc5 Bxc3+ 7. bxc3\n",
        "5. a3": ".",
        "5... Bxc3+": ".",
        "6. bxc3": ".",
        "6... c5": "Altra variante 6... O-O 7. e3\n",
        "7. cxd5": "Si poteva anche giocare: 7. e3 O-O\n",
        "7... exd5": ".",
        "8. e3": ".",
        "8... c4": "L'alfiere bianco ha una posizione ristretta e passiva\n",
        "9. Ne2": ".\n",
        "9... Nc6": "L'idea è Cb8-c6-a5-b3\n",
        "10. g4": ".",
        "10... O-O": "altra continuazione possibile 10... Na5 11. Bg2\n",
        "11. Bg2": "era buono anche: 11. Nf4 Ne8\n",
        "11... Na5": "Il cavallo bianco è malintenzionato",
        "12. O-O": ".",
        "12... Nb3": "Il Nero minaccia di guadagnare materiale: Cb3xa1. Una casa molto attiva per il cavallo nero.\n",
        "13. Ra2": "Anand, nonostante la veemenza iniziale, sembra molto impacciato.",
        "13... b5": "Carlsen poteva giocare anche: 13... Bd7 14. e4\n",
        "14. Ng3": "Perché non giocare : 14. a4 bxa4 15. Rxa4 h6 ? \n",
        "14... a5": ".",
        "15. g5": "Un attacco affrettato.",
        "15... Ne8": ".",
        "16. e4": "Il Bianco mina la catena di pedoni\n",
        "16... Nxc1": "Il cavallo è arrivato a segno. Comunque c'era l'alternativa di giocare: 16... Nc7 17. Be3\n",
        "17. Qxc1": ".",
        "17... Ra6": ".",
        "18. e5": "Il Bianco conquista maggior spazio\nUn'altra possibilità era: 18. f4 dxe4 19. Nxe4 Rb6\n",
        "18... Nc7": ".",
        "19. f4": "Il bianco incrementa il suo attacco togliendo lo sguardo da quanto sta succedendo sul lato di donna.",
        "19... b4": ".",
        "20. axb4": ".",
        "20... axb4": ".",
        "21. Rxa6": ".",
        "21... Nxa6": "Uno scambio tutto a favore del nero che si trova, come nelle partite vinte in precedenza, con un pedone in più nel lato più debole della scacchiera.",
        "22. f5": "Anand sperava di sorprendere Carlsen con questo massiccio attacco di pedoni. Sul blog sono subito apparsi messaggi tipo, \"Oggi Carlsen di becca lo scacco matto\" ecc. Ma, secondo me, per l'ennesima volta, Anand ha sottovalutato Carlsen.",
        "22... b3": "E' fatta, ora il Nero ha un nuovo pedone passato protetto: b3\n",
        "23. Qf4": "Meglio era: 23. Nh5 Nc7\n",
        "23... Nc7": "Il cavallo nero corre in aiuto. Tutto dipende da lui, e nelle mosse successive ce ne accorgeremo.",
        "24. f6": ".",
        "24... g6": "Controlla f5+h5\nun'altra possibile mossa era: 24... gxf6 25. Nh5 Ne8 26. gxf6 $15\n",
        "25. Qh4": "Secondo me la regina ha fatto molto male a isolarsi in un attacco non studiato a puntino.",
        "25... Ne8": "Ecco la cavalleria, senza di essa il bianco avrebbe vinto.",
        "26. Qh6": "Forse era meglio giocare: 26. Ne2 Qa5 27. Nf4 Be6 28. Nxe6 fxe6\n",
        "26... b2": "Il pedone se ne va",
        "27. Rf4": "Perché non giocare: 27. Ne2 Qa5 28. Nf4 Be6 (28... Qxc3 29. Nxd5 Qxd4+ 30. Kh1 Qxd5 31. Bxd5) 29. Nxe6 fxe6 ?\n",
        "27... b1=Q+": "Il nero si è costruito un Harem",
        "28. Nf1": "Pessima mossa: 28. Bf1 era molto meglio, seguita da Qd1 29. Rh4\n",
        "28... Qe1": "Anand abbandona. La sua sorte è segnata, dopo: 28... Qe1 29. Rh4 Qxh4 30. Qxh4 Qa5 il finale per il nero è vincente.\nUna partita difficile da spiegare. L'indiano nel momento più decisivo della partita ha fatto l'errore più madornale, quasi come quello che successe a Hubner nelle eliminatorie di Abano Terme credo nel 1979.\n"
    },
    "url": "https://gameknot.com/annotation.pl/fide-chennai-game-9?gm=52764",
    "gameName": "FIDE Chennai Game 9",
    "players": "Anand, Viswanathan (2775) vs. Carlsen, Magnus (2870)",
    "opening": "Nimzo-Indian (E20), Kmoch variation"
}