{
    "moves": {
        "1. e4": "Superando nettamente (6,5-3,5) Viswanathan Anand, il 22 Novembre 2013 Magnus Carlsen diventa il Sedicesimo Campione del Mondo, titolo raggiunto con una precocità seconda solo a quella di Kasparov!\nConsiderando solo i Campioni del Mondo “classici”.  Carlsen ha conquistato il titolo a 8 giorni di distanza dal suo 23° compleanno con cinque mesi (per la precisione 147 giorni) di ritardo rispetto a Kasparov (Campione a 22 anni e 210 giorni). Se consideriamo anche l’infelice stagione dei Mondiali KO FIDE, il record di precocità spetta invece a Ponomariov (18 anni e 106 giorni), record che molto probabilmente resterà imbattuto ancora a lungo.\n Dopo aver respinto gli assalti di Kramnik, Topalov e Gelfand, alla quarta difesa ‘Vishy’ cede dunque la Corona allo ‘yankee’ che viene dalla Norvegia. Carlsen ha spazzato via senza particolari difficoltà le presunte insidie che molti pensavano avrebbe dovuto affrontare nel suo primo match, facendo invece pesare tutti i suoi 95 punti Elo in più.\nSecondo molti, oggi inizia di una “Nuova Era” fatta di “giocatori al silicio”, quasi privi di anima e di passione per il bel gioco ma “acrobaticamente” freddi e precisi. Noi la pensiamo diversamente. “Mozart” e “Macchina” degli scacchi sono appellativi già attribuiti, quasi  100 anni fa, ad un altro Campione del Mondo, Jose Raul Capablanca, anche lui osannato per il suo gioco preciso, naturale e senza rischi, anche lui criticato per gli stessi identici motivi! Non molto di nuovo sembra dunque scorrere sulle 64 caselle …\nPassando al Campione detronizzato, dopo un inizio che aveva lasciato ben sperare (sull’incertezza del match) Anand è stato surclassato da Carlsen che, oltre a vincere tre partite, ha sempre dato l’impressione di essere in pieno controllo della situazione. Questo risultato, deludente per chi si aspettava un match più equilibrato, non può però incrinare la figura del Quindicesimo Campione del Mondo che, è bene ricordarlo, è stato tale per oltre 6 anni!\nPrima di concludere, rivolgiamo una “preghiera” al Nuovo Campione del Mondo perché non privi gli appassionati dell‘ultra-centenaria tradizione dei Match Mondiali. In passato, Carlsen ha dichiarato di preferire un Torneo al Match, che a suo avviso concede troppi privilegi al Campione in carica. La speranza è che il norvegese cambi idea e perciò  lo abbiamo “consacrato” XVI Campione del Mondo, perché senta la responsabilità di portare una Corona che è stata di Steinitz, Lasker, Capablanca, Alechine, Euwe, Botvinnik, Smyslov, Tal, Petrosjan, Spassky, Fischer, Karpov, Kasparov, Kramnik e Anand. In cambio, vi garantiamo sin d’ora che non lo criticheremo per aver cambiato idea!\n",
        "1... c5": ".",
        "2. Nf3": ".",
        "2... d6": ".",
        "3. Bb5+": ".",
        "3... Nd7": "Altra variante 3... Bd7 4. Qe2\n",
        "4. d4": ".",
        "4... cxd4": ".",
        "5. Qxd4": ".",
        "5... a6": ".",
        "6. Bxd7+": "Altra variante della siciliana: 6. Bc4 Ngf6\nMa a quanto pare Carlsen vuol forzare il gioco e non perderne l'iniziativa.\n\n",
        "6... Bxd7": ".",
        "7. c4": "Altra variante: 7. Nc3 e5 8. Qd5 Qc7\nE' mia impressione che Carlsen, anche se è presto da dire, vuole tenere sotto pressione Anand. Con questa tattica pensa di raggiungere almeno una patta, e con essa  il campionato del mondo.\n",
        "7... Nf6": "Alfiere f8 è ancora inattivo.\nPreferibile era : 7... Rc8 8. O-O\n",
        "8. Bg5": ".",
        "8... e6": "Il nero poteva cominciare a ridimensionare la pressione del Bianco con : 8... Qa5+ 9. Nc3 Bg4 10. Bxf6 gxf6 11. Nd2\n",
        "9. Nc3": ".",
        "9... Be7": ".",
        "10. O-O": ".",
        "10... Bc6": ".",
        "11. Qd3": "Era possibile anche : 11. Rad1 Rc8 \n",
        "11... O-O": ".",
        "12. Nd4": ".",
        "12... Rc8": ".",
        "13. b3": "Il Nero ha una posizione troppo compatta. La pressione del Bianco ha effetto.\nVariante: 13. f3 Bd7\n",
        "13... Qc7": ".",
        "14. Nxc6": ".",
        "14... Qxc6": "Una mossa debole anche se la cattura di pedone avrebbe causato un indebolimento nel lato di regina... e Anand ha imparato a sue spese che a Carlsen questo vantaggio è meglio non darlo.",
        "15. Rac1": "La linea c deve essere rinforzata",
        "15... h6": ".",
        "16. Be3": ".",
        "16... Nd7": ".",
        "17. Bd4": "Mossa debole. Consigliabile: 17. f3 Rfe8\n",
        "17... Rfd8": "La linea d è sotto controllo da parte di ambedue i giocatori.",
        "18. h3": ".",
        "18... Qc7": ".",
        "19. Rfd1": "Tutti sulla d",
        "19... Qa5": "Una mossa attesa da tante mosse, anche se a questo punto poteva giocare: 19... Bg5 20. Rb1\n",
        "20. Qd2": ".",
        "20... Kf8": ".",
        "21. Qb2": "oppure: 21. Rc2 b5 22. cxb5 axb5\n",
        "21... Kg8": "Un buon modo per perdere un tempo prezioso. Probabilmente Anand è molto indeciso.",
        "22. a4": ".",
        "22... Qh5": ".",
        "23. Ne2": ".",
        "23... Bf6": ".",
        "24. Rc3": ".",
        "24... Bxd4": "Non era il momento di forzare lo scambio: 24... Be5 25. Re3 sarebbe stato più incisivo.\n",
        "25. Rxd4": ".",
        "25... Qe5": "Altra possibilità: 25... Nc5 26. Re3 b6 27. Qc2\n",
        "26. Qd2": "Torna a rafforzare la linea d",
        "26... Nf6": "Una mossa telecomandata",
        "27. Re3": ".",
        "27... Rd7": "Altra possibilità: 27... g5 28. f4 gxf4 29. Nxf4\n",
        "28. a5": "Buona mossa",
        "28... Qg5": "Mossa debole. Migliore alternativa era: 28... Kh7  29.e4-e5 Nf6-e8 30. Ne2-c3 Rc8-c6 31.b3-b4 Rd7-d8 32.f2-f4 Qg5-e7 33.f4-f5 Qe7-c7 34.c4-c5 d6-d5 35.Re3-e1 Kg8-h7 36.f5-f6 g7-g6 37.Nc3-a4 h6-h5 38.Na4-b6 Kh7-g8 39.Qd2-g5 Rd8-b8 40.Re1-d1 ed il Nero avrebbe potuto sperare di giocare ancora\n",
        "29. e5": ".",
        "29... Ne8": "Ora sappiamo perché 26. ... Nf6 era debole.",
        "30. exd6": "Brutta mossa di Carlsen. Avrebbe dovuto giocare 30.Ne2-c3 Rc8-c6 31.b3-b4 Rd7-d8 32.f2-f4 Qg5-e7 33.f4-f5 Qe7-c7 34.c4-c5 d6-d5 35.Re3-e1 Rd8-d7 36.f5-f6 h6-h5 37.f6xg7 Ne8xg7 38.Qd2-f4 Qc7-d8 39.Re1-d1 Ng7-f5 40.Nc3xd5 Rd7xd5 41.Rd4xd5 e6xd5 \nAnche: 30. Nc3 Rc8-c6 31.f2-f4 Qg5-d8 32.Re3-d3 Rc6xd6 33. Rd4xd6 Rd7xd6 34.Rd3xd6 Qd8xd6 35.Qd2xd6 Ne8xd6 36.Kg1-f2 Kg8-f8 37.Ne2-c1 g7-g5 38.Nc1-d3 Kf8-e7 39.Kf2-e3 Nd6-f5+ 40.Ke3-e4 f7-f6 41.f4xg5 h6xg5 42. Nd3-c5 Nf5-d6+ 43.Ke4-e3 Nd6-f5+  avrebbe reso la vita molto più facile al Bianco\n",
        "30... Rc6": "Il Nero minaccia di guadagnare materiale: Tc6xd6\n",
        "31. f4": ".",
        "31... Qd8": ".",
        "32. Red3": "Tutti sulla d!!",
        "32... Rcxd6": "Anche : 32... Nxd6 33. b4 Nxc4 34. Rxd7 Qxd7 35. Rxd7 Nxd2 36. Rxd2 non era male\n",
        "33. Rd4xd6": "Comincia la carneficina. Ma per Carlsen, meno pezzi ci saranno nel finale sulla scacchiera e più semplice sarà raggiungere il suo obiettivo.",
        "33... Rxd6": "Perché non: 33... Nxd6 34. c5 Kf8 35. cxd6 ?\n",
        "34. Rxd6": ".",
        "34... Qxd6": ".",
        "35. Qxd6": ".",
        "35... Nxd6": "Si è giunti ad un finale di cavalli\n",
        "36. Kf2": "Ora comincia l'avanzata dei Re",
        "36... Kf8": ".",
        "37. Ke3": ".",
        "37... Ke7": ".",
        "38. Kd4": ".",
        "38... Kd7": ".",
        "39. Kc5": "Il bianco è arrivato prima",
        "39... Kc7": ".",
        "40. Nc3": ".",
        "40... Nf5": ".",
        "41. Ne4": ".",
        "41... Ne3": ".",
        "42. g3": ".",
        "42... f5": ".",
        "43. Nd6": "Si poteva anche giocare: 43. Nd2 Nd1\n",
        "43... g5": ".",
        "44. Ne8+": ".",
        "44... Kd7": ".",
        "45. Nf6+": ".",
        "45... Ke7": "Altra possibile variante: 45... Kc7  46. fxg5 hxg5 47. b4\n",
        "46. Ng8+": "Brutta mossa di Carlsen. Era meglio giocare  46.Nf6-h5 che sarebbe stato seguito da: Ke7-d7 47.b3-b4 g5-g4 48.h3xg4 f5xg4 49. b4-b5 Kd7-c7 50.Kc5-d4 Ne3-f5+ 51.Kd4-e5 Kc7-d7 52.b5xa6 b7xa6 53.c4-c5 Kd7-c6 54.Ke5xe6 Nf5-d4+ 55.Ke6-e5 Kc6xc5 56.f4-f5 Nd4-c6+ 57.Ke5-f4 Nc6xa5 58.Nh5-f6 Na5-c6 59.Nf6xg4 h6-h5 60.Ng4-e5 Nc6-d4 con vantaggio per il bianco\n",
        "46... Kf8": "Il Nero minaccia di guadagnare materiale: Rf8xg8\n",
        "47. Nxh6": ".",
        "47... gxf4": "Interessarsi troppo per il cavallo con il Re, avrebbe compromesso la difesa del lato di Regina dove il bianco è nettamente in vantaggio.",
        "48. gxf4": "Il Bianco ha un nuovo pedone passato: h3\n",
        "48... Kg7": "Il cavallo è perso, ma ha distrutto il vantaggio di pedoni neri nel lato di Re.",
        "49. Nxf5+": "Ultimo acuto prima della fine\n",
        "49... exf5": "Il Nero guadagna un pezzo. \nOra l'idea è: 49... Nxf5  50. Kb6 Nd6 51. Kc7\n",
        "50. Kb6": "Il Bianco minaccia di guadagnare materiale: Rb6xb7\n",
        "50... Ng2": "Il nero non è da meno. Cxf4\n",
        "51. Kxb7": ".",
        "51... Nxf4": ".",
        "52. Kxa6": ".",
        "52... Ne6": ".",
        "53. Kb6": ".",
        "53... f4": ".",
        "54. a6": "Il bianco ha un forte pedone\n",
        "54... f3": "Il nero non è da meno",
        "55. a7": ".",
        "55... f2": ".",
        "56. a8=Q": ".",
        "56... f1=Q": "Il Nero ha un pezzo in più\n",
        "57. Qd5": "Il Bianco minaccia di guadagnare materiale: Dd5xe6\n",
        "57... Qe1": ".",
        "58. Qd6": ".",
        "58... Qe3+": ".",
        "59. Ka6": ".",
        "59... Nc5+": ".",
        "60. Kb5": ".",
        "60... Nxb3": ".",
        "61. Qc7+": "Ora comincia il gioco del bianco per costringere il nero a fare lo scambio di Regine. Dopo di che la partita non può avere altro risultato che patta.",
        "61... Kh6": ".",
        "62. Qb6+": "Fatto",
        "62... Qxb6+": ".",
        "63. Kxb6": "E' fatta!",
        "63... Kh5": "Ultimi preliminari.",
        "64. h4": ".",
        "64... Kxh4": ".",
        "65. c5": ".",
        "65... Nxc5": "Re e cavallo contro re non lascia nessuna possibilità di vittoria per nessuno."
    },
    "url": "https://gameknot.com/annotation.pl/fide-chennai-game-10?gm=52798",
    "gameName": "FIDE, Chennai Game 10",
    "players": "Carlsen, M. (2870) vs. Anand, V. (2775)",
    "opening": "Sicilian (B51), Canal-Sokolsky (Nimzovich-Rossolimo, Moscow) attack"
}