{
    "moves": {
        "1. e4 c5 2. f4": "the sequence 1. e4 c5, 2. f4 is usually classified under B21; Morra Gambit and relatives... this setup mostly leads to versatile play for white to counter most of Blacks' play; one of the main features is the absence of an early d4, to compromise c5...",
        "2... e6 3. Nf3 d5": "in the Sicilian, Blacks' main object is to conquer d5; but at this stage is too soon... ",
        "4. e5 Nc6 5. Bb5": "under normal circumstances, I would have played c3, to block Nb4/Nd4, followed by g3, Bg2, 0-0, and start developing... this one works better, since d7 is now on d5...",
        "5... Qb6 6. a4 a6": "not the best way to handle this; Nge7 was much to be preferred...",
        "7. a5 Qc7": "not good is Qxb5, Nc3, Qb4, Ra4, c4, Rxb4, Bxb4, 0-0, Bxa5, d3!",
        "8. Bxc6+ Qxc6 9. O-O": "Black spent a lot of tempo on that one...",
        "9... Ne7 10. Nc3 Nf5 11. Na4 Bd7 12. Nb6": "with this last three Knight moves, White has compromised Blacks' center pawns... it is clear to see here, that after c3 and g4, Black loses the center to d4...",
        "12... Rd8 13. d3": "mainly to prevent c4 at this stage, and prepare g4...",
        "13... Be7": "allows White to postpone c3... Ne7 at this stage, might have been safer...",
        "14. g4": "White has a very tiny edge here; after Nd4, f5, h6, Rb1, Nb5, f6 white has the initiative...",
        "14... Nh4": "not directly a losing move, but clearly a mistake...",
        "15. Nxh4 Bxh4 16. g5": "sadly enough, this Bishop will spend the rest of this game on h4...",
        "16... h5": "against directly Qg4; after c4, simply d4...",
        "17. Rf3 Qc7 18. Qe2 f5": "again, c4 followed by Bb5/Qc5+ was some way out of this... this last desperate attempt to free Bh4 - exf6, gxf6, gxf6?, Bxf6 - loses instantly...",
        "19. exf6 e.p. e5": "Black loses control; after Kf7 - covering for g7 - Rh3, gxf6, Rxh4, Bc6, there is still room to fight...",
        "20. Nxd5": "White would have played this anyway, with e6 and Ke8 still in place, since the e-pawn is pinned... now, this Knight will bring mayhem...",
        "20... Qd6 21. fxg7 Rg8 22. Nf6+": "total devastation...",
        "22... Kf7": "slightly tougher was Ke7, fxe5, Qc6...",
        "23. fxe5 Qd4+": "whatever the odds, Qc6, Nxd7+, Ke7, Nf6, Rxg7, Rh3, Rxg5+, Bxg5, Bxg5, looks more promising...",
        "24. Be3 Qxb2": "best move was Rxg7, followed Bxd4, cxd4 or Nxd7+, Ke7, and sit this out... this will lead straight to mate...",
        "25. Nd5+ Kxg7": "tougher was Bf5, Rxf5+, Ke6...",
        "26. Rf7+ Kxf7 27. Qf3+": "the Fierce Queen is entering the building, and all is over; Black resigns... the nicest mate is Ke6, Qf6+, Kxd5, c4 and mate..."
    },
    "url": "https://gameknot.com/annotation.pl/fierce-queen-vs-sicilian-reprised?gm=62805",
    "gameName": "Fierce Queen vs. Sicilian reprised...",
    "players": "fiercequeen (2018) vs. ribrahim (1903)",
    "opening": "Sicilian (B21), Grand Prix attack"
}