{
    "moves": {
        "1. Nf3": "Nella prima partita con l’insolita apertura del „Fianchetto Grünfeld“ ,un Carlsen timoroso ha cercato di mettere in difficoltà un tranquillo Anand che, alla fine, è riuscito a mettere in difficoltà lo sfidante. Carlsen, alla fine, ha preferito optare per una parità che, a quanto riportato dai media, ha reso felice anche Anand, per il quale, una patta con il nero, vale qualcosa di più del punteggio effettivo.\nA mio parere, questa prima partita, come quasi tutte le prime partite delle sfide mondiali,  può essere considerata solo uno studio reciproco in attesa di affilare le armi al momento giusto.\nQualitativamente una partita piatta giocata con schemi ben conosciuti e dai quali, nessuno dei due contendenti, ha preferito uscire.\n",
        "1... d5": ".",
        "2. g3": ".",
        "2... g6": ".",
        "3. Bg2": ".",
        "3... Bg7": ".",
        "4. d4": ".",
        "4... c6": ".",
        "5. O-O": ".",
        "5... Nf6": ".",
        "6. b3": ".",
        "6... O-O": ".",
        "7. Bb2": ".",
        "7... Bf5": ".",
        "8. c4": ".",
        "8... Nbd7": ".",
        "9. Nc3": "In tutte queste continuazioni tratte da partite dove è stata giocata questa apertura, si nota come il risultato finale non poteva essere altro che quello sortito.\n(9... Ne4 10. Nh4 {1/2-1/2 (10) Asanov,B (2400)-Begun,F Azov 1991) \n(10. e3 Nxc3 11. Bxc3 Be4 12. Qe2 Qb6 13. Rfd1 Rfd8 14. Bh3 Bxf3 15. Qxf3 Nf6 16. Qe2 Ne4 17. Bb2 e6 18. Bg2 (1/2-1/2 Huzman,A (2580)-Nunn,J (2615) Amsterdam 1995) \n(10. Nd2 Nxc3 11. Bxc3 c5 12. cxd5 cxd4 13. Bb2 Nb6 14. Nf3 Nxd5 15. Nxd4 Nb4 16. a3 Bxd4 17. Qxd4 Qxd4 18. Bxd4 Nc2 19. Rad1 (1/2-1/2  Ivanovic,A (1905)-Zelic,M (2330) Portoroz 1995)\n(10... Nxc3 11. Bxc3 Be6 12. Qd3 Nf6 13. Rfd1 Qc7 14. Rac1 Rad8 15. c5 Qc8 16. Bd2 h6 17. b4 g5 18. Nf3 Bf5 19. Qb3 Ne4 20. Be1 a6 21. a4 Bh3 22. Bh1 f5 23. Ne5 Bxe5 24. dxe5 Qe6 25. f3 {Lapertosa Viana,J (2130)-Miller,A ICC INT 2009 1/2-1/2)",
        "9... dxc4": ".",
        "10. bxc4": ".",
        "10... Nb6": ".",
        "11. c5": ".",
        "11... Nc4": ".",
        "12. Bc1": ".",
        "12... Nd5": "1. volta Nd5",
        "13. Qb3": "1. volta Qb3",
        "13... Na5": ".",
        "14. Qa3": ".",
        "14... Nc4": "Il nero gioca per la parità",
        "15. Qb3": "Il bianco a questo punto ha accettato",
        "15... Na5": "Con questa mossa la partita è terminata senza vincitori.",
        "16. Qa3": ".",
        "16... Nc4": "."
    },
    "url": "https://gameknot.com/annotation.pl/fife-chennai-game-1?gm=52594",
    "gameName": "FIFE Chennai Game 1",
    "players": "Carlsen, Magnus (2870) vs. Anand, Viswanathan (2775)",
    "opening": "Reti (A07), King's Indian attack, Pachman system"
}