{
    "moves": {
        "1. b4": "This is a league game played in 2003. I am putting in on GameKnot because I feel that the game overall (especially opening) is very instructive and shows a good recipe for Black against this rare opening. My opponent was a strong master candidate and one of a few prominent Sokolsky players in Croatia. Fortunately for me, I played against another proponent of this opening (interestingly, also a strong MK) a relatively short while before this game so I had some experience to rely on. I was a clear underdog but had accumulated enough wins against strong players by that time to be relatively confident in myself.",
        "1... e5": "This move is one of the 2 main continuations (the other one is 1...d5). The idea is that Black is willing to give his e pawn for White's b pawn, but for compensation he will get good development and some central pressure.",
        "2. Bb2 Bxb4 3. Bxe5 Nf6": "This is the position that Black intended with 1...e5. Black has a slight lead in development, and eventually Be5 will have to move (losing another tempi) or be exchanged for a Knight (giving Black a pair of Bishops).",
        "4. Nf3 O-O 5. e3": "Last move both players played moves that are \"mandatory\" (the most natural). This allows maximum flexibility regarding the middlegame - but now choices have to be made, which will define the later play. 5.c3 is possible here, but then after 5...Ba5; 6.d4, d5; 7.e3, Ne4 Black is in great shape and even has a slight advantage. The main problem is that White is passive so can't really play for a win.",
        "5... d5": "The most active move, taking advantage of the chance to occupy the centre. In my first Sokolsky game I played 5...Nc6 and had a good game (lost in heavy time trouble in an equal ending), but in analysis I concluded that Black should play c5 before Nc6, thus gaining more influence in the centre. This game was a good chance to see how this idea will work in practice. 5...d6 is also OK but a little passive.",
        "6. Be2": "Preparing to castle and free the d pawn to move. Since Black will likely play Bg4, e2 is the best place for the Bishop.  ",
        "6... Bg4 7. O-O c5": "And here it is. In the analysis of the previous game I concluded that this position is great for Black. Actually it is objectively equal but Black has active piece play and a clear plan, qualities that I like in my positions :)",
        "8. c4": "Staking a claim in the centre, but also allowing Black to open the d file for himself. After some thought I decided to ignore it for now and finish development.",
        "8... Nc6": "This is the situation I mentioned earlier. White either has to retreat the Bishop (losing time) or lose it to a Knight (giving the Bishop pair advantage to Black). In either case I like Black's position.",
        "9. Bb2": "Here I was calculating 9.Bf6, Qf6; 10.cd5!?, Qa1; 11.dc6, bc6 and decided that this is pretty unclear, but since Black is an exchange up and has a pair of Bishops it is looking promising enough.",
        "9... Re8": "Starting to pressure the central files. The idea is to play Qd6 (to keep protection of both d5 and Nf6) and Rad8 to maximize the pressure. All Black's pieces are coordinated and concentrating on this part of the board. Meanwhile, White still has to catch up with development. This is why I think Black has a slight practical edge here, although to be fair the position is still objectively even. Time spent from the clock: 4 minutes",
        "10. cxd5": "Otherwise Black can wait for Nc3 and then push d4, or just take dc4 when it is opportune.",
        "10... Nxd5 11. h3": "Creating an outlet for the King and putting a question to Bg4 (Bf3, Bh5 or Bf5?), but also slightly weakening the castling position. ----- I need to clarify that - since Black's pieces are active this is a potential weakness. If Black was passive or White equally active, this would not be a weakness.",
        "11... Bh5": "I decided to maintain the pressure on d1-h5 diagonal. I had some vague ideas about White's pieces on d1, e2 and f3 :)",
        "12. Qb3": "A solid multipurpose move - getting away from Bh5, allowing 13.Nc3 without break-up of pawn structure, potentially threatening b7 and clearing d1 for a Rook if necessary.",
        "12... Qd6": "Still following the game plan while additionally defending b7 (13.a3, Ba5; 14.Qb7??, Rab8). Time spent: 7 minutes",
        "13. Na3": "?! I think White knew this was not best, but since he was the favourite in this game he didn't want to allow mass exchanges - 13.Nc3, Bc3 (13...Nc3?!; 14.dc3 with Rad1); 14.Bc3 (14.dc3, Nf4=), Nc3; 15.Qc3, Bf3; 16.Bf3 and the game is most likely a draw. Time spent: 17 minutes",
        "13... Nf4": "Seizing the chance immediately.",
        "14. exf4": "Slightly better is 14.Bd1 (14.Qd1?, Ne2; 15.Qe2, Ba3; 16.Ba3, Nd4! with big advantage), when Black has a pleasant choice between 14...Nd3 and 14...Na5.",
        "14... Rxe2 15. Nc4": "?? White started to lose his composure. Relatively best is 15.g4 (15.Rfe1, Re1; 16.Re1, Na5 and 15.Be5, Ne5; 16.fe5, Qa6! with advantage for Black), Bg4; 16.hg4, Qf4 and the position is unclear. Black has compensation for the piece but probably not more than that.",
        "15... Qxf4": "Taking the pawn while increasing pressure against Nf3 and d2. I think Black is winning here. Time spent: 24 minutes (I usually start to play slowly when I feel the position is critical)",
        "16. Ne1": "? This is just too passive to be good. Now the game is turning into a rout. Computer analysis suggests 16.Rac1, but then obvious and simple 16...Bf3; 17.Qf3, Qf3; 18.gf3, b5; 19.a3, bc4; 20.ab4, Rd2 wins for Black. It is hard to find anything better though.",
        "16... b5": "! Hitting the Nc4 and taking more space on the queenside with tempi.",
        "17. Ne3 c4 18. Qd1": "A sad move but relatively best, preventing 18...Rd2 with threat against Bh5.",
        "18... Rd8": "Bringing the last inactive piece to the fight. There is no need to hurry, since White has no counterplay. Time spent: 45 minutes",
        "19. Bc1": "What else? White could have pretty much resigned with clear conscience now, but it was a league game so he fought on to the bitter end (as would I in his place).",
        "19... Bxd2": "The simplest move. 19...Qe5, 19...Bd6 and 19...Nd4 are also possible, but there is no need to overcomplicate things.",
        "20. g4": "Trying to reduce the pressure, but creating horrible weaknesses around the King. Alternative is 20.Bd2, Rdd2; 21.Qc1, Nd4 and White is helpless.",
        "20... Rxe1": "Again the simplest move, reducing the material while keeping White passive.",
        "21. Rxe1 Bxe1 22. Qxe1 Qe5": "Trying to get White to play 23.Rb1 so 23...Bg6 is played with tempi.",
        "23. Ba3": "Time spent: 39 minutes - White was playing faster now (since he is lost here anyway, his best chance was to hope for Black's inaccurate play in time trouble).",
        "23... Bg6": "Now Black has 2 winning motives - direct attack on the weakened castling position and pushing the queenside pawn majority. Time spent: 1:13",
        "24. Rd1": "Trying to exchange active Rd8 for his passive Rook.",
        "24... Bd3": "Refusing the exchange and blocking f1 square for the White's King. I decided to go for the kingside attack, leaving the queenside pawn majority for reserve if the attack fails but most or all pieces get exchanged.",
        "25. Bb4": "Hoping that Black will exchange his dangerous Knight for the Bishop.",
        "25... Nd4": "Again refusing to exchange active piece for a passive one, this move marks the start of an attack on weakened light squares.",
        "26. Kg2": "Defending against Nf3, but with no control over the light squares there is no chance of really repelling Black.",
        "26... Qe4+ 27. Kg3 Qf3+ 28. Kh2": "Time spent: 43 minutes",
        "28... Re8": "Since d file is closed, the Rook is going to more promising e file - in some variations Re3 could come in handy. Besides, on e8 there is no need to worry about the White's Bishop. This move also sets a semi-trap in which White falls. Time spent: 1:25",
        "29. Bc5": "?? This was the trap - White loses the Bishop immediately. After 29.Bc3 I was preparing to play 29...Ne2 with tempi, transfering the Knight to f4, when Re3 is a mating threat. Time spent: 49 minutes",
        "29... Qf4+": "Since White can't ever play Kg1 due to Nf3, the Queen will easily reach e5 and take out the Bishop.",
        "30. Kg2 Qe4+ 31. Kg3 Qe5+ 32. Kg2 Qxc5": "In normal circumstances White would most certainly resign now, but again this was a league game so he fought on a little while longer.",
        "33. Qa5 Qc6+ 34. Kg1 Nf3+ 35. Kg2 Nh4+ 36. Kg3 g5": "Preparing the mate.",
        "37. Kh2 Qd6+": "Taking control of d8, so there will be no check after Re3.",
        "38. Kg1 Rxe3": "Time spent: 1:41",
        "39. Qxb5": "Time spent: 58 minutes",
        "39... Nf3+": "White resigned. I hope you enjoyed the game. What is (I hope) the learning point here? 1. Black equalised easily with a well-played opening. 2. White allowed his role as a favourite to affect his judgement, avoiding best continuation only because it is potentially drawish. This happens often and is usually a good chance for an alert underdog. 3. White was not sufficiently psychologically prepared to handle Black's initiative, missing few crucial moves in a delicate position. This is connected to the second point. 4. The Queen manoeuvre is very typical and should be remembered. This motive appears relatively often and should be \"seen\" rather than calculated. --- Thank you for looking over this game, I can answer any questions on private. Regards, Marin Vukusic"
    },
    "url": "https://gameknot.com/annotation.pl/fighting-the-sokolsky-opening?gm=8765",
    "gameName": "Fighting the Sokolsky opening",
    "players": "White player (2189) vs. marinvukusic (2077)",
    "opening": "Polish (Sokolsky) opening (A00)"
}