{
    "moves": {
        "1. d4 d5 2. c4 e6 3. Nc3 c5 4. cxd5 cxd4": "[Filipp Frenkel:\n\tThis game is a demonstration of the difference in efficiency between active and passive pieces. If the objective is mate then one needs to retain only the bare minimum to fulfill the goal of checkmate. But only limited favorable situations can lead to the tightened noose around hostile king's neck. We frequently encounter a dilemma where inferior material side furiously prevails over superior forces due to more effective performance of their pieces, creating tricks available to them. Here I was ready to give away one of my pawns for superior position increasing the scope of fire power of my pieces which give opportunity of obtaining not decisive, but a noticeable advantage in the placement of my pieces.]",
        "5. Qa4+ Bd7 6. Qxd4 exd5 7. Qxd5": "[Filipp Frenkel:\n\tHaving offered one pawn, why not be generous and offer another one? Let's get the king (or queen) at any price. Why should we tighten our purse-strings when we can get so much for so little?]",
        "7... Nf6": "If 8.Qxb7?! Nc6! with a lead in development, e.g. 9.Nf3? Rb8 10. Qa6 Nb4 11.Qc4 Be6 threatening 12...Nc2 checkmate\n\n[Filipp Frenkel:\n\tI played this game more than 40 years ago, when theory of chess openings was measured in reams of paper, not gigabytes. No matter how it is measured, opening theory is nothing more than a compilation of some, but never all, the idiotic garbage spiced with some nice gems there and here in rare corners of the ocean of mixture of slime, that was played by players who thought much more about what they were doing than whoever compiled the theory. There is so much richness in the uncounted trillions of possibilities that no chess player can hope to memorize enough to cover even a limited area. And by trying to specialize in memorized openings, woodpushers (even titled and high-rated woodpushers) blind themselves to new and creative ideas.\n\t7...Nf6 is an important innovation which even now is rarely if ever played. One point, aside from offering the b7-pawn, is that white now has no time for Bg5, which is otherwise a main response to 7...Nc6. \n(7 ... Nc6 8. Bg5 Nf6 is one common move order today, rendered obsolete 43 years ago by 7...Nf6.) ]\n\n\n",
        "8. Qd1": "White has made 4 queen moves in the opening.",
        "8... Nc6": "[Larry Parr & Frenkel:\n\tBlack is down a pawn and ahead in development. The routine 8... Bb4 and 9... 0-0 would permit white to play g3 and Bg2, and to castle. After which, black will suffer and lose.] ",
        "9. e3": "A mistake. This move weakens the d3 square. Better is 9.Nf3.",
        "9... Qa5 10. Bd2 O-O-O 11. Rc1 Kb8 12. a3": "White plays to trap black's queen.",
        "12... Ne5 13. Nb5 Qxb5": "!!\nThe value of pieces is relative to the position. White's knight and light squared bishop are worth more than black's queen.\n\n[Filipp Frenkel comments: \tPeople are thrilled by exceptions rather than by rules. Imagine: a pawn is worth one dollar, a knight $3.25, a bishop $3.50, a rook $5.30, a queen $10.30, and the king is priceless. Chess is a mirror of life, and the prices of goods change. Now, the price of white's knight and bishop is higher than black's queen.\n\n\tIt's known that three pieces can often overplay a queen positionally, even in the absence of some combination which regains the queen. Sacrifice of queen for only two pieces is much rarer and more spectacular- looking. I had seen this idea before, in some few other games, and the pattern had suggested itself to me once 12. a3 revealed white's intentions. Queen for two pieces is really only the equivalent of sacrificing a piece, and we do know often enough the value of sacrificing a piece. ]\n ",
        "14. Bxb5 Bxb5": "The first threat is 15...Nd3+ which would win back the queen with a discovered check on the following move.",
        "15. Qb3 Nd3+ 16. Kf1": "If 16. Kd1, then 16...Ba4! 17.Qxa4 Nxb2+ and black will be a piece up after recapturing white's queen.\n16. Ke2 Nxc1++ is even worse.",
        "16... Ba6": "!\nFrenkel was an attacking player and it was very hard for him to play quiet moves.",
        "17. Ne2 Ne4 18. Rc2 Nc1 19. Qxf7": "The knight is immune from capture\nIf 19.Bxc1, 19...Rd1 is checkmate.\n19. Rxc1",
        "19... Nxd2+ 20. Ke1": "20. Rxd2 Rxd2 21.Qe8+ Kc7 22.Qe5+ Bd6 23. Qxg7+ Kb6 24. Ke1 Rxe2+ 25. Kd1 Rc8.",
        "20... Nd3+ 21. Kd1 Nxf2+ 22. Kc1": "22. Qxf2 Ne4 discovered check",
        "22... Nd3+ 23. Kd1 Nc4 24. Nd4 Nxe3+ 25. Kd2 Nxc2 26. Kxc2 Rxd4": ""
    },
    "url": "https://gameknot.com/annotation.pl/filipp-frenkels-queen-sacrifice?gm=22550",
    "gameName": "Filipp Frenkel's Queen Sacrifice",
    "players": "Luss  vs. Frenkel, Filipp ",
    "opening": "QGD (D32), Tarrasch, von Hennig-Schara gambit"
}