{
    "moves": {
        "1. e4": "My game with this 80-year old guy is an excellent example of how a simple lead in development can totally annihilate your opponent's king.",
        "1... e5": "In double king pawn positions, and other open games, development is the most important thing.",
        "2. d4": "Instead of playing Nf3 like normal, I decided to see if this old guy knew the importance of development, by playing this risky opening that can crush someone (like Mr. Vinecour) or anyone else who isn't familiar with it. But if Black knows what to do against this opening, then it really isn't dangerous.",
        "2... exd4": "Not taking the pawn leads to very boring positions.",
        "3. Nf3": "Taking the pawn will lose a tempo to an eventual Nc6 attack on the queen.  Instead I develop another piece while I test this old guy's knowledge of development. If he's smart, he'll know not to try and hold the d4-pawn.",
        "3... c5": "Apparently this guy hasn't learned the importance of development in his alleged 70 years of playing. Although Black is winning a pawn, c5 is a serious weakening move since Black can no longer play the defensive c6, and Black is neglecting his development, allowing me to gain more.\nFor those of you who know this opening, you know that 3...d5 is a much stronger move by Black.",
        "4. c3": "The sacrifice for development.",
        "4... dxc3 5. Nxc3": "This gambit is a lot like the dubious Danish Gambit (e4 e5 d4 exd4 c3) except that Black has played c5, which makes a HUGE difference. Because in the Danish Gambit, Black can hold onto his extra pawn by playing c6 securing a solid position, but now Black's position will fall apart due to this weakness. His d-pawn is backward and I have strong control of the d-file. I'm also ahead in development.",
        "5... d6": "This is the only good square for Black's backward pawn. Notice how Black has a hard time finding good squares for his undeveloped pieces, while I'm developing strong and have lots of active squares for my pieces to develop in the future. This is because I was developing while Black was greedily holding onto a measly pawn.",
        "6. Bc4": "I have such strong piece play in the centre. If Black plays correctly, then the game will reach ultra-complicated positions where I must use my development initiative to crush his passive position. All it takes is one inaccurate or pointless move by Black and he will be totally lost.",
        "6... h6": "There it is, the inaccurate move. Black is too worried about me playing Ng5 (which isn't a dangerous threat) and makes a losing move. Black has no idea what the importance of development is, otherwise he would've played a move like Be7, which stops Ng5, while also DEVELOPING a piece. I searched for this position on the Gameknot database, and not one of the 7 players who've had this position found my next winning move.",
        "7. Bxf7+": "I can afford to sacrifice this piece, because I have strong piece play in the centre, while Black's extra piece will be sitting passively undeveloped on the back rank. However, after this sacrifice, I must be extremely careful to play tactically correct, or else Black may find a way out of my attack and hold onto his extra material.",
        "7... Kxf7": "Accepting the sacrifice is totally losing. Black's only chance was to not take the bishop. Material would be even, but it would take longer for me to rip open Black's passive position. Black probably thought his only chance was to try to hold onto his extra piece, but he is sadly mistaken.",
        "8. Ne5+": "My queen's domination of the d-file and the fact that White's undeveloped pieces block the rook from protecting his queen are what make my move possible.",
        "8... Kf6": "The king cannot go back to e8 because I will play Qh5 check, followed by mate on f7. If Black played Ke7, then I can fork the king and rook with Ng6, and I'll be up the exchange. (His rook for my bishop).\r\nAnd 8...Ke6 is also losing because of 9.Qd5  Kf6 (Ke7 Qf7#) 10.Qf7  Kxe5 11.Bf4  Kd4 12.Qd5#\r\nBlack's best chance was to just simply give me the exchange, which avoids immediate mate.",
        "9. Qf3+": "You may think I'm crazy for sacrificing my e5 knight when I'm already down a bishop, but White's last moves are pretty much forced, and his two extra pieces haven't even moved yet. Also, sacrificing a second piece is the only way I can win this position. ",
        "9... Kxe5": "Forced, since the other two moves get mated.\r\n\r\nKe6: 10. Qf7  Kxe5 11. f4  Kd4 12. Qd5#\r\nKe7: 10. Qf7#",
        "10. Qf7": "Here I am cutting off the king's escape square e6, and I am also threatening to play Bf4  with Qd5 mate to follow. Although my win is completely forced, please note that I did NOT calculate the final mating position on move 16 when I played Bxf7. Once I calculated up to this position from move 7, I couldn't calculate anymore, and I knew there had to be a forced mate somewhere, because my pieces have easy access to Black's humorously exposed king, and also Black has absolutely no counterplay in his underdeveloped position.",
        "10... Nf6": "This is Black's only move that stops my checkmating threat of f4  then Qd5# and g5 or Qh4 don't stop it since after f4  I can simply replace the pawn with my bishop. But Black is only further prolonging the mate, because whenever there's a centralized king on an open board, which is surrounded by enemy pieces, there is almost always a forced mate.\r\n",
        "11. f4+": "I have taken away another square from White's king, drawing him further into my territory.",
        "11... Kd4": "I sacrificed my pawn on e5 because I didn't want White to play c5 and retreat his king to c4 where it would've been safe.",
        "12. Ne2+": "This is a very important move, because if I get too hasty in trying to mate Black, then he can play c4 and escape to c5 where he safeguards his king and I will be down two pieces for nothing. Ne2  draws the king to a square where his only escape path will also get him mated.",
        "12... Kxe4": "Kd3 was the only other move, but also gets mated by Qb3  Kxe4 Ng3  Kd4 Be3#.",
        "13. O-O": "All I need now is another piece in play to finish off the exposed king. With my rook accessible to the open centre files, White will soon be mated if he doesn't move his king (like in the game). And there is also a forced mate in 7 waiting for Black if he tries to escape with his king. Mate is inevitable.",
        "13... Qe7": "Black plays a passive move and allows my immediate mate in 3. If Black had tried escaping with Kf5, then I have (Ng3  Kg4 Qg6  Kh4 Nf5  Bxf5 g3  Kh3 Qxf5  Ng4 Qh5  Qh4 Qxh4#)\r\nI've calculated a lot of possible mating sequences in this annotation, as a result of Black's exposed king and his lack of developed defenders.",
        "14. Ng3+": "The first move in my mate in 3 attack.",
        "14... Kd3": "Kd4 gets mated immediately with Rd1#",
        "15. Rd1+ Kc2": "Just look at Black's helpless king in my territory that's about to get mated, and Black's undeveloped pieces in his own territory can't do anything. Development played a big role in my game.",
        "16. Rd2#": "This mate is slightly nicer looking than my other choice of Qb3#\r\nHopefully Black learned a valuable lesson from my crushing attack.\r\nDevelop as quickly as possible, don't waste tempo with pointless moves like h6, and don't waste moves holding onto 'free' pawns!"
    },
    "url": "https://gameknot.com/annotation.pl/final-round-of-la-open?gm=2903",
    "gameName": "Final Round of LA Open",
    "players": "bakerbaker (1795) vs. Twain Vinecour (1843)",
    "opening": "Centre game, Kieseritsky variation (C21)"
}