{
    "moves": {
        "1. d4 Nf6 2. Bf4 g6": "One of the best countering my usual attack. ",
        "3. Nf3 Bg7 4. c3": "My intention is not to play c4, contrary to the normal play. But I had no need to compromise to it right now. Nd4, preparing e4 (if d5 is not payed) would have been a slightly better. ",
        "4... O-O": "Giving me a second chance to try e4.",
        "5. Nbd2": "I go for it. Now he can stop me with d5. He can also  exchange my dsb by Ng5.",
        "5... c5": "A good player will do the right thing. This is a very good  move. I don't think taking the pawn will be good. I won't be able to stop e5, later. ",
        "6. e3": "I'm not forced to play e4. I have attack lines from here too. ",
        "6... cxd4 7. exd4": "He is a move behind using the white squares, but I can. Of course, If I'd studied theory, all this must find familiar. I'm not on the GK db, and to look around is something I rarely allow myself to spend time on. I'm not a good student, I know :-)",
        "7... d6": "Black doesn't bo for d5. Is he planning to fianchetto the lsb?",
        "8. Qb3": "I think the only sensible move for black is Nc6, preparing Na5 in case of Bc4-Ng5. ",
        "8... Nh5": "Hard decision. Be3 seems good, but this will allow e5 and the Bg7 will be very strong. ",
        "9. Bg3": "Maybe wrong. I planned to live with NxB, hxN. ",
        "9... e5": "I though that after dxe5, dxe5, Nxe5, black had Re8, and it was difficult to be sure I could save it. This was blitz. ",
        "10. Bh4": "So I decided to come with this surprise. Black can't interpose a piece, ot it will be pinned for a move. He must move the Q. ",
        "10... Qc7": "Good, defending f7 and threatening to open too soon the c column (before I castle).",
        "11. d5": "I intended to play a surprise move. I'm giving up the useful pin on the f pawn, and now he can play a pawn storm on my kingside. But this considerably losens the strenght of his dsb. The pin model is still on: if black plays e4, and I dare Nxe4, Re8 will lose me a minor piece. ",
        "11... Nd7": "I'd say \"?\". He should have definitely played e4. ",
        "12. Be2": "A weak move I discarded earlier because of Nf4, forcing me back to f1. ",
        "12... Nf4": "I have a strategy, that is to try to make mistakes appear as intentional. This sometimes lead to good sacs. But this time, I just sensed that I could find no advantage by it, and the best was to admit my mistake, and humbling defend. ",
        "13. Bf1": "Ugly. And I am aware I will suffer now a strong attack against d3. I have to open a \"zen umbrella\". ",
        "13... Nc5 14. Qc2": "? Just inviting Bf4 (Edit: Bf5). ",
        "14... Bf5 15. Qd1": "A tempo lost. Still, black has to prove his win. ",
        "15... Ncd3+": "The idea could be to allow Qc4 at some point. Otherwise, the attack is just premature. ",
        "16. Bxd3": "I lose control of the white squares, but his Q is not in yet. ",
        "16... Nxd3+ 17. Ke2": "Ok, let's play around. You've won a pawn, ok. You can't play Qc4. You can play Bg5, but h3 and the exchage helps me to losen the pressure. Black has still work to do. ",
        "17... Nxb2 18. Qb3": "Accepting Bd3+, Ke1. The \"zen\" defence. ",
        "18... Nd3": "This, instead, surprised me. f2 is defended, and my dsb is safe. It is guarding against any Bh6 black idea until the Nf3 supports it, and if e4, Ng5 and it still has Ne6 stopping f6 and in case of h6, Nxe4. Not bad...",
        "19. Rhd1": "I thought about Ra-b1, pressing b7, but I felt that I must be prepared to retreat the K on f1 without being closing in my own R. So I put it here, with a shadow of a pressure on 3 that will help later. ",
        "19... Rac8": "Black threatens c3, and I can't defend it. I didn't see it coming, I admit it. On the other side, it was difficult to find something better. But I had to defend. The \"zen defence\" was called for again...",
        "20. Nb1": "Squeezed but not squashed! :-)",
        "20... Nf4+": "Oh, yes, as you desire, sir...",
        "21. Kf1": "Now, what? My K can run up to h1, f2 as a bodyguard, and yes, d3 is weak, so come on, get me!",
        "21... Qc4+": "That's all? You do want to use your pressure to close me in, and win the endgame? Ok, let's prove it!",
        "22. Qxc4": "I was playing with a 1800+. I was almost sure that allowing the Q to survive would have brought me some mate with N, Q and B. I wasn't sure then, and I won't be sure until the game will be published, so I'll see it through the board. I just decided not to risk and hold the storm. ",
        "22... Rxc4 23. Be7": "Ok, I played this last card I had. My lsb's weird position at last found some justification.",
        "23... Rfc8": "It is obvious that black want to play e4, but I have to accept the loss of c3 (as long my a1 R is not trapped in by the Bdsb). I have a nice compensation, though...",
        "24. Bxd6": "Maybe not the best, but I have now a d runner. If I can hold, this will play at my favour. ",
        "24... Bd3+": "Yessir, come in. Let's see how you will harm now. ",
        "25. Kg1": "Ne2+ Nxc3 would have been the logical following. My position would have collapsed. ",
        "25... Bxb1": "Right, taking c3, but offering another pawn in compensation. I still think black could have won by playing e4, and if BxNf4, exNf3, winning. ",
        "26. Raxb1": "e4 now is still good, but white can escape via Ne5, and Rxb7 is threatened, so there is still game to go. Black should have considered the strenght of his pawn's mayority on the Kside and play f6. White doesn't have any lsb to harm trough the white squares, and c3 can't be defended, so there is no hurry in taking it. ",
        "26... Rc4xc3": "Now I have two chances of compensate the pawn. e5 is the more dangerous by far (note that the black diagonal is now empty, so black' dsb is half that powerful. Still, e4 can be annoying. On the other side, Rxb7 offers a very nice control of the 7th. Black will have the same control of the second row in any case. I shouldhave palyed a defensive move, like Rd2, but I felt far more important...",
        "27. Nxe5": "Ok, right pawn... right piece? I didn't really want to force the dsb's exchange anymore. Now mine is stronger than his (I could consider myself a very good defender, and a very nice strategist... :-). I thought in threatening Nxf7, without seeing Ne2+ as the in-between saving move for black. This is the sad truth!",
        "27... b6": "As I hoped, black took care of his weakness, but Rc2 at once would have been far more aggressive and better. ",
        "28. Nxf7": "?? Nc6 was far better!!!! Now I realize. Black must save the N on f4 and the fork check on e7. Ne2+, Kf1 and nothing changes. I just lost my chanche. ",
        "28... Ne2+ 29. Kf1 Kxf7 30. Kxe2": "I am not down, ok, but I exposed my K for a pawn, when a piece was given to me. ",
        "30... Rc3c2+": "Now the punishment. ",
        "31. Kf1": "I calculated that with Bg3 I had the good condition to push the d pawn. I knew it won't have been easy, though... Anyway, this move is better than the tempting Rd2. I have to be aware that this R is guaranteeing me the Bg3 retirement by defending the d pawn. It can't be compromised in an exchance, or d - and the game - will be lost. So this apparently bad move I think was sound. ",
        "31... Rxa2 32. Bg3 Rd8 33. Rbc1": "Black is winning with his a and b pawns, now. So I have to play at the best my d pawn. And quickly. As for the pawn's defence, my R are now misplaced. d1 and e1 would have been their best places, but the reasons that lead me to bring Rh1 into the game were valid, I think. ",
        "33... Rd7": "Stopping Rc2+ (Edit: Rc7). ",
        "34. d6": "He can't attack with Bf8, because of Rc7. ",
        "34... b5": "? Based on the fact the situation on the d column is stalled, but it is not!",
        "35. f4": "What is this for? You'll see. ",
        "35... Bf8 36. Rc7": "Must he defend the R with the K? He has Rc2 to block the promotion...",
        "36... Ke6": "And this seems to win the pawn for free. BUT...",
        "37. f5+": "A pawn's sac. This is the winning tempo I need. I uncover the black diagonal, preventing the K from taking on d6 if Rd moves... and it will do!",
        "37... gxf5": "If Kxf, RxR. ",
        "38. Re1+": "...but now black can't avoid the loss of a full R. My opponent resigned here. I think that I made a lot of mistakes, but I had a decent defence, and as a prize, a nice intuition - not really calculated, just instinctive - that gave me the win. I felt exacly like David Ferrer against Johnson, today (Saturday 25th)... :-D"
    },
    "url": "https://gameknot.com/annotation.pl/final-shot?gm=60006",
    "gameName": "Final shot",
    "players": "damalfi  vs. Big Asb ",
    "opening": "Queen's pawn game (A45)"
}