{
    "moves": {
        "1. f4": "I am Black in this mini-tournament game",
        "1... g6 2. Nf3 Bg7 3. g3 Nf6 4. Bg2 O-O 5. O-O": "Both sides have completed kingside development almost symmetrically, the only difference is that White has advanced his f4-pawn early, signifying that he wants a space advantage on the kingside. I should look for a plan on the queenside. Here my idea was to place my pawns along the f8-a3 diagonal to strengthen my fianchettoed bishop and undermine White's b2 pawn. But that is a long-term plan, so I need to complete development and prepare to advance those pawns",
        "5... d6 6. d3 c5": "Here I thought White would play e4 and go for an attack on the kingside, but he delayed it for several moves, and I continued with my maneuvers on the queenside",
        "7. c3": "White also has the option of going into a stonewall setup with e3 and d4 to try and undermine my fianchettoed bishop, but that would make d3 a waste of tempo",
        "7... Nc6 8. Qc2 a5": "Since my plan is to place my pawns along the f8-a3 diagonal, I advance a queenside pawn. I also wanted to maneuver my rook to a6 to take it off the diagonal of the bishop.",
        "9. Nbd2 Ra6 10. Nb3": "A dubious move, because I get a tempo with a4, so White has wasted time with that maneuver. I gain some time advancing my pawns on the queenside, so I get a slight initiative. White has delayed attacking on the kingside, so my attack comes first.",
        "10... a4 11. Nbd2 b5": "Once I complete the pawn chain on the dark squares, White's pawns on the dark squares will be undermined, and my fianchettoed bishop will become active.",
        "12. e4 b4": "Although I am giving White's knight the c4-square to help fight for an e5-boost, an e5-boost isn't very dangerous for me. If White plays a3 stopping me from completing my pawn chain, then it will take me a lot longer to make progress on the queenside. I will have to complete development with Bd7 and try maneuvering my kingside knight to the queenside with Ne8-c7-b5",
        "13. Nc4 a3": "If bxa3, then I play bxc3 with a lot of pressure on the dark squares, and I still have the idea of maneuvering my f6 knight to b5. ",
        "14. e5": "I don't have to capture e5 immediately, I can slightly weaken the a-file and long diagonal with axb2, threatening to promote",
        "14... axb2 15. Bxb2 dxe5 16. Ncxe5": "If fxe5 then Ng4 and the e5-pawn is very weak. If White tries defending the pawn with d4, then I start a chain reaction with bxc3 followed by cxd4 where I have more attackers than White has defenders.",
        "16... Nxe5": "During the next sequence of moves, White used his b2-bishop like a pawn to defend the dark squares I weakened, so now I don't seem to have an advantage anymore.",
        "17. Nxe5 Nd5 18. Qd2 bxc3 19. Bxc3 Nxc3 20. Qxc3 Qd4+ 21. Qxd4 cxd4 22. Nc6": "White has a lot of advantages in this middlegame/endgame. He has a strong passed a-pawn, while I have a weak backward e-pawn. White's isolated d-pawn seems to have enough potential defenders. I should be lucky to draw this ending, but I swindled him at the end because of my superior endgame calculation.",
        "22... Re8 23. Rfe1 Be6": "Here I should've played Kf8 instead of attacking White's pawn. My bishop doesn't need to be pinned to my e-pawn, when my bishop pair is one of my few advantages. I had to waste a tempo playing Kf8 and then moving my bishop again",
        "24. a4 Kf8": "I wanted to defend my e-pawn with my king so that my bishop doesn't have to stay on e6, I can play Bd7 and ",
        "25. a5 Bd7 26. Nb4 Ra7 27. a6": "White is making a lot of progress on his passed pawn, and his fianchettoed bishop has gotten much stronger since the opening. My fianchettoed bishop has been weakened because of my badly placed d-pawn. My d-pawn would be stronger on d5 supported by e6, but unfortunately pawns cannot move backwards",
        "27... e6 28. Bc6": "White wants to trade bishops to get rid of my bishop pair and go into a simpler ending, I need to get my king in the action and stop the passed pawn.",
        "28... Ke7 29. Rec1 Rc8 30. Bxd7 Rxc1+ 31. Rxc1 Kxd7": "Exchanging pieces was not good for White. I have better drawing chances now, and because of White's faulty play, I got some hope to maybe win in this ending since I happen to play very well in most endgames.",
        "32. Ra1 f6": "I'm not sure why I made this move, but I should've made the Bf8-Bc5 maneuver I made on the next moves. f6 seems pointless",
        "33. Kf2 Bf8 34. Nc2 Bc5 35. Kf3 f5": "It is taking me 4 pawns to neutralize 3 pawns on the kingside, so it's like White is up a pawn, which is his passed a-pawn. It seems as if I am successfully containing the pawn, so I was sure that I could draw this, and maybe win if my opponent screws up",
        "36. g4 Kc6": "I ignore White's dubious pawn advance and head toward White's passed pawn. Now that White realizes he will lose his passed pawn, he has to threaten my pawn.",
        "37. Re1 Rxa6 38. Rxe6+ Kb7 39. gxf5 gxf5 40. Re5 Kc6": "Here If White takes f5, then Ra2 followed by Rxh2, and it seems like that variation gives White the best winning chances rather than the variation he played, which is drawn, but I managed to outplay him based on his miscalculation",
        "41. Ne1 Ra1 42. Kf2 Ra2+ 43. Kg3 Ra1": "Here I was thinking I should just repeat moves since White seems to have better winning chances, but White didn't want to, and instead went into an ending where I am better",
        "44. Kf2 Ra2+ 45. Re2": "This is a blunder. White maybe thought his knight would be better than my bishop because it can attack my light-squared f-pawn, but bishops are almost always better than knights in dynamic endgames like this. but this is probably still drawn, White just severely decreased his winning chances with the rook trade",
        "45... Rxe2+ 46. Kxe2 Kd5 47. Kf2 Be7": "Here I want to restrict White's knight from coming to g5 or h4. Another good thing about bishops is that they can waste moves and still attack the same diagonal, unlike knights which cannot control the same squares when they move.",
        "48. Nf3 h6 49. Kg3 Bf6": "Here it seems like the ending is pretty much drawn. White can safeguard his f-pawn with his king and later his knight, and I cannot breakthrough at all.",
        "50. Nh4": "After Ke6 I can try to fight for a win, but I wasn't confident that I could win that ending. Instead, I go for a cheapo that isn't easy to see for someone who doesn't calculate thuroughly",
        "50... Bxh4+": "After the minor pieces go off the board, I will maneuver my king to capture White's d-pawn, while White captures my h-pawn, and then it will be a pawn race, where White has a drawing move. White's losing plan is to defend his d-pawn with his king, where I can simply waste moves until White is in zugswang and must move his king away from defending his pawn",
        "51. Kxh4 Kc5 52. Kh5 Kb4 53. Kxh6 Kc3 54. Kg5": "54.Kg5?? is a losing blunder.\r\n54.Kg7?? is also losing.\r\n54.Kg6 is White's only drawing move (you'll see after the pawns promote)\r\nIf White had calculated thoroughly, then he would've seen that Kg5 is losing. White probably only calculated that his pawn promotes right after mine does, so he thought he would have an easy draw in the resulting queen ending, and that it didn't matter where his king was. After the pawn race, you'll see why Kg6 was the only drawing move",
        "54... Kxd3 55. h4 Ke4 56. h5 d3 57. h6 d2 58. h7 d1=Q 59. h8=Q": "This position is lost for White because after Qg1  White's king is forced to the h-file since Kf6 loses to Qd4  skewer. After the king moves to the h-file, I have Qh1  skewer forcing a queen trade, then my king just takes f4-pawn and I promote the last pawn and win. If White's king was on g6, then I wouldn't be able to force a queen trade and the ending is drawn. If White's king had moved to g7 then Qa1  forces a queen trade.",
        "59... Qg1+ 60. Kh6 Qh1+ 61. Kg7 Qxh8+": "White resigned, I win easily after taking White's pawn and White's king is not in a position to interfere with my promotion. If White's king was in front of my pawn, like around f1, then it would be a draw."
    },
    "url": "https://gameknot.com/annotation.pl/find-jennifer-kesse?gm=9499",
    "gameName": "FIND JENNIFER KESSE",
    "players": "schauerhammer (1701) vs. byakuugan3 (1885)",
    "opening": "Bird's opening (A02)"
}