{
    "moves": {
        "1. d4": "This is another game from the Knights of Honor Upper Level Tourney.  This game became wildly tactical early on.  ",
        "1... g6": "Black goes with his favorite defense-The Modern/Robatsch.",
        "2. e4 Bg7 3. f4": "With 3. f4, White initiates the aptly named Three Pawns Attack.",
        "3... d6 4. Nf3 c5": "Here, Black seeks to begin undermining White's center.  ",
        "5. dxc5": "5. dxc5.  This move surprised me a bit.  I fully expected 5. d5",
        "5... Qa5+": "Black didn't want to take c5 with d6 as it likely would have led to an exchange of Queens and pull the d-pawn out of the center.",
        "6. Nc3": "Here again, White surprised me as I expected Bd2",
        "6... Qxc5": "And material is even.",
        "7. Nd5 Nf6": "7...Nf6  Fritz gave this move a ? and recommended 7.\t... Qa5+  8.\tBd2  Qd8  That never crossed my mind but in hindsight, that would have certainly led to a calmer game.  Additionally, I think it was only an oversight by White that I didn't lose my Queen for his LSB in the next couple of moves.",
        "8. b4 Qc6": "This was a relatively simple move as every other move lost the Queen.",
        "9. Ne5": "9. Ne5  I'm hesitant to offer a ? on a move when my opponent is 250 rating points better.  However, I believe that 9. Bb5  Qxb5  10.\tNc7+\twins Black's Queen.  I didn't see this possibility until after 9. Ne5 as I was certain that a 2000+ player simply didn't see that dxNe5 was possible.  I was literally ready to move 9. dxe5 three times but each time did not click on 'Submit' as I was certain that I was missing something.  Once I saw I could lose the Queen, I came up with a different move.",
        "9... Bg4 10. Nxc6": "Black Queen gone.",
        "10... Bxd1": "White Queen gone.",
        "11. Nc7+": "This was expected but there was little I could do about it.",
        "11... Kd7 12. Nxa8 Nxe4": "12. Nxe4  My thought here was that I was attacking Ra1 and if e1xd1, then Nf2 forks the K and R.  However, my friend fritz gave this move two ?? and suggested 12...Nxc6 13. b5 Nb4",
        "13. Ne5+ dxe5": "and material is getting closer to equal.  \n",
        "14. Bd3 exf4": "And again Black's DSB eyes Ra1.\n",
        "15. Bxe4 Bxa1 16. Kxd1 Nc6": "Now Na8 is in danger as is b4.",
        "17. b5 Nd4 18. b6 f5": "18...f5.  fritz gives this a ? and recommended e5.  I think if I had seen this, I would have been happier.  With 18...f5, I was thinking that if Bxb7, my R can go to b8 and win a piece.  ",
        "19. Bxb7 Rb8": "19. Rb8??  I miss the tactic completely and with this move, the game is essentially over.  Much better would have been 19...axb6",
        "20. bxa7 Rxb7 21. Nb6+": ":tears:",
        "21... Rxb6 22. a8=Q Rd6": "Better may have been Nc6 but Black is busted at this point.  ",
        "23. Bxf4 Rc6 24. Qb7+ Ke8 25. Bg5 Kd8 26. Bxe7+ Ke8 27. Bg5 Kf8 28. Qe7+ Kg8 29. Bh6 Rxc2 30. Qg7#": "For a brief time, I felt like I was in this game.  I take solace in the words of Capablanca--\"One can profit more from a single loss than a hundred wins.\"  My thanks to jonstherealdeal for the game.  Even though I lost--and still feel pain over 19...Rb8, this was an enjoyable (and interesting) game.  As always, comments/critiques are most welcome "
    },
    "url": "https://gameknot.com/annotation.pl/fireworks-early-and-often?gm=29575",
    "gameName": "Fireworks!  Early and Often.",
    "players": "jonstherealdeal (2026) vs. untateve (1756)",
    "opening": "Modern defence (A40)"
}