{
    "moves": {
        "1. e4": "Today I finished my first GK game and would like to annotate this. The game was not too exciting, but there were some instructive points. My opponent starts out e4.",
        "1... c5": "I play the sicilian defence, a solid line that gives black plenty of chances for advantage. Against this line I employ the Grand Prix Attack. ",
        "2. Nf3": "white is probably going for an open sicilian.",
        "2... Nc6": "I play Nc6. The other 2 main moves here are d6 and e6. ",
        "3. d4": "white does go for the open sicilian. It is a very dynamic and sharp game.",
        "3... cxd4 4. Nxd4 g6": "I play the accelerated fianchetto. This dragon variation is a lot like the traditional one, but black has not played d6 yet, and should wait until it is necessary to play d6 to keep the game in the accelerated territory.",
        "5. Nc3 Bg7 6. Be3 Nf6": "this move is to be prefered over d6, as the pawn move is \"inflexible\" as the game shows.",
        "7. Be2": "white plays the classical variation. the other line is to play the yugoslav attack. ",
        "7... O-O 8. O-O d5": "exclam(!). this is the reason why d6 was not played earlier. Most dragon players know that black's key move in the non maroczy variations is the freeing d5. In the traditional dragon, the d pawn takes 2 moves to reach d5, but in accelerated territory, the pawn move is accomplished in 1, thus saving an entire tempo, and here, I think black has a small edge. And the statistics for master games shows that black scores a very nice 59%",
        "9. Nxc6": "one critical line.",
        "9... bxc6 10. e5": "after this, black has 2 moves that give him an equality at least.",
        "10... Nd7": "this is double attacking the pawn, forcing f4.",
        "11. g3": "a bad choice. The pawn on e5 is central and should be protected.",
        "11... Nxe5 12. f4": "this is very weakening on the kingside. ",
        "12... Nd7 13. a3": "not necessary at all.",
        "13... Nf6": "Here, I have the extra material and \"compensation\".",
        "14. h4": "these moves all weaken his king. When kings are castled opposite, pawn storms in open positions are usually bad. ",
        "14... Bh3": "taking control of the light squares.",
        "15. Rf2 Qd7": "now I have the control of the light squares.",
        "16. g4": "losing another pawn.",
        "16... Nxg4 17. Bxg4 Bxg4": "now the white king's weakness is obvious. Also. there is the fork threat.",
        "18. Qd3 d4": "winning a piece.",
        "19. Nd1 dxe3 20. Nxe3": "20.Qxd7?? exf2+ followed by recapturing.",
        "20... Rfd8 21. Rg2": "The game is over at this point.",
        "21... Be6 22. Rh2 Qxd3 23. cxd3 Rxd3 24. Nd1": "white is down positionally and materially.",
        "24... Rad8 25. Nf2 Rg3+ 26. Kf1": "now it is mate in 2.",
        "26... Bc4+ 27. Ke1 Re3#": "mate."
    },
    "url": "https://gameknot.com/annotation.pl/first-game-on-gk?gm=33592",
    "gameName": "first game on GK",
    "players": "peace-hope (1263) vs. crtexxx12345 (1200)",
    "opening": "Sicilian (B35), accelerated fianchetto, modern variation with Bc4"
}