{
    "moves": {
        "1. d4 d5": "My opponent allowed she wanted to practise playing the Colle System.  I thought I would respond with a mutual Queen's Pawn opening, but I could equally well have played just about anything else.",
        "2. Nc3": "But this is not a Colle.  It is called the Richter Opening: quite playable, but leading to an entire different type of game.  instead, the Colle System goes... well, we'll see how it goes...",
        "2... Nf6 3. e3": "Consistent with the idea of playing a Colle, but rather a conservative line.  I half expected White to play 3.Bg5 - the Veresov Attack.  You might notice that the thing would have looked like a left-handed Ruy Lopez: quite playable.  Otherwise, White might have played a quiet developing line like 3.Nf3, or even something wild and woolly: 3.e4!?, the dreaded Blackmar-Diemer Gambit (3.e4 dxe4 4.f3 exf3 5.Nxf3 ... with quick development for White).  Developing players wishing to hone their attacking skills could do worse than try out the Blackmar-Diemer.",
        "3... e6": "My opponent having inadvertently slipped off the Colle line, I figured I would play the System as if I had the White pieces.  Hence my choices for the next several moves.",
        "4. Bd3 c6 5. Nf3 Bd6 6. O-O Nbd7": "Except for the 'misplaced' knight at c3, White has stayed with the Colle set up.  Now she figures the time is right for the plotted breakout.",
        "7. e4": "Good move, and this is the point of the Colle.  White threatens to advance the pawn to e5 (the double attack on knight and bishop is a bonus), at the same time freeing the dark-square bishop.  White often starts thinking about K-side attack, from here on.",
        "7... dxe4": "Pretty much forced if Black doesn't want the pawn to continue to e5.  Believe you me, he doesn't!",
        "8. Nxe4 Nxe4 9. Bxe4 Nf6": "Changing the guard at f6 and gaining a tempo.  But you might already be noticing something about Black's light-square bishop.  Where is it going?  Its scope is pretty limited.  Recalling that Black has been playing a 'colours reversed' Colle system, we see here the downside of the System if the e-pawn doesn't make it to the fourth rank.  The c8-bishop won't be developed for another seven moves...",
        "10. Bd3 h6": "Not a very good move.  Normally I hold this sort of thing back until an enemy piece lands on g5, and then I might hit it with the ...h6 move.  But take a look at Whites Queen and bishops.  Their focus is very much on the K-side.  It seemed to me as well to keep the White minor pieces back for the time being whilst I completed my development.",
        "11. Be3 Qc7": "A little bit of a counter action: eyeing h2.  Already Black was planning to fianchetto the c8-bishop, and was considering castling on that wing as well.",
        "12. Qe2": "OK...ish...! But I really thought that 12.Qd2 was more in keeping, aiming the guns towards the K-side.  To illustrate the potential for K-side operations, had White played Qd2 and Black castled, this might have happened: 12.Qd2 0-0  13.Bxh6!? gxh6 14.Qxh6 Be7 (defending the attacked Knight) 15.Ng5 Qd8 16.Bh7ch Kh8 (NOT 16...Nh7 17.Qxh7#) 17.Bg6 Kg8 18.Bh7ch ... and a draw by threefold repetition.  If a snap attack like that was good enough to draw the game, who knows what White might have developed with more preparation?",
        "12... b6": "Pursuing the plan.",
        "13. Ne5": "White has just about completed her development and casts about for a plan.  But this sortie is premature, and costs a pawn.  Not disastrous, White does obtain some compensatory activity for her developed pieces.  But better would have been to bring the rooks into more active positions (C-, d- or e-files) and/or to play 13.c4.",
        "13... Bxe5 14. dxe5 Qxe5 15. Qf3": "Good: attacks the undefended c-pawn.  ",
        "15... Nd5": "Blocking the Queen's attack.  A good alternative was to play ...Bb7 now.  Black had no time, though, for 15...Qxb2?? (16.Qxc6ch and White wins).",
        "16. Bc1": "Defending the b2-square.  But White had a better alternative, 16.c4! Ne7 (keeping guard over the c6-pawn)  17.Rb1 0-0  18.Bd2 ... (relocating) 18...Rd8 19.Bc3 Qg5.  Although a pawn behind, White would have got quite a lively sort of game.",
        "16... Bb7": "Even so, the game is no more than roughly even right now.  ",
        "17. Bd2": "A change of mind that should have cost a tempo and a pawn.  But White has discovered that her pieces are in a little bit of a tangle.  Probably Rb1 or c3 would have enabled White quickly to unravel her Q-side.  Otherwise it is hard to tell whether this was an oversight, or White figuring that to get her pieces working properly was worth dropping a second pawn.",
        "17... O-O": "Doesn't matter:  Black doesn't take the b2-pawn!  There was no particular reason not to do so, but I think I was simply anxious to get my own development completed.  After all, I am a pawn ahead!",
        "18. c3": "Understandable, but it does have its risks, mainly on account of the bishops on the d-file having no shelter there.  Black at once starts menacing them.",
        "18... Rad8 19. Rfe1": "Placing the rook on a half-open file with a gain of tempo... Well, not quite.  Black was happy to bring his Queen back...",
        "19... Qd6": "Threatening a tactical shot based on the clump of under-protected bishops on the d-file.  How should White respond?",
        "20. Bc1": "This turns out to be insufficient.  It is clear, though, that White saw something brewing!  The bishops could have been defended by tactical means: 20.Rad1! ... when 20...Nxc3?? doesn't work: 21.Bxc3 and suddenly the d3-bishop is quite comfortable and snug, thank you very much!",
        "20... Nxc3": "This wins a second pawn.",
        "21. Bc4": "Well played, though Bc2 would have been slightly safer.  White keeps her bishop pair, and the integrity of her structure intact.  Two pawns behind, though, is a big handicap.",
        "21... Nd5": "Returning from a profitable cavalry raid to its fine outpost. ",
        "22. Bd2 Rd7": "There are two points to this.  Black is planning to treble the heavy pieces on the d-file; and this rook also protects the bishop.  Black is planning soon to unmask the b7-bishop's battery against the White Queen, and that of the heavy pieces against the bishop at d2.  Throughout this game so far, Black has been playing a solid, more or less risk-free positional style in the face of the active White pieces.\n",
        "23. b3 b5": "I have my doubts about this move, now.  It was a bit of a spur of the moment decision.",
        "24. Be2 c5": "Setting up a crossfire along the light long diagonal and the d-file.  But it would have been better played a move earlier, I now think.  ",
        "25. Bxb5": "Nothing wrong with this!  Grabs a pawn and attacks the rook.  Now comes a tactical flurry.",
        "25... Nf6": "Unmasking batteries against the White Queen and the d2-bishop.  Does this win material for Black?",
        "26. Qe3": "It turns out that White had quite a strong defence: 26.Bf4! Bxf3  27.Bxd6 Rxd6  28.gxf3 ... and a reasonable game.",
        "26... Qxd2": "Now, after 27.Bxd7 Qxf3 28.Rxf3 Nxd7 Black will have two minor pieces plus pawn vs rook.",
        "27. Red1": "Nice idea - a skewer against Black's Queen and Rook, but Black can now exchange Queen for both White Rooks and the Bishop.  Much better would have been 27.Bxd7 Qxe3  28.Rxe3 Nxd7.  This would still have been a considerable advantage for Black - Bishop, Knight and Pawn for a Rook - but there would still have been work ahead.\n",
        "27... Qxd1+ 28. Rxd1 Rxd1+ 29. Bf1 Ba6": "Wins the pinned bishop.  White's Queen will be no match for Black's pair of Rooks and two minor pieces.",
        "30. h3 Rxf1+ 31. Kh2 Rc8": "At this point, the GK engine gives ...Rd8 as better, and it is true I spent a lot of time on that move.  I decided to take the conservative line as (more or less) simpler.  ",
        "32. a3 Rc6 33. f3 Nd5": "Black is making sure everything is protected (When ahead 'Think defence'.  That does not mean 'play defensively' though...)",
        "34. Qd2 c4 35. Qb2": "White would have been better off exchanging pawns.  But really, White's game is now lost.  A material deficit of minus-8 is way too much to overhaul.",
        "35... c3 36. Qc2 Re1 37. Qf2 Re2 38. Qd4 c2": "This pawn could not have been stopped anyhow, once it got past the enemy pawns.",
        "39. Qxa7 c1=Q 40. Qa8+ Rc8 41. Qxa6 Qf4+ 42. Kg1 Rc1#": "So good was White's start that even the loss of a pawn didn't compromise her game. After the loss of the second pawn, White began to lose ground.  It was not until move 20 that Black could point to an edge of any sort, and moves 26 and 27 that the collapse really began."
    },
    "url": "https://gameknot.com/annotation.pl/first-challenge?gm=61214",
    "gameName": "First Challenge",
    "players": "knightrider62 (1012) vs. archduke-piccolo (2103)",
    "opening": "Blackmar-Diemer gambit (D00)"
}