{
    "moves": {
        "1. c4": "The English?",
        "1... b6": "I like having my Bishop in charge of the long diagonal.",
        "2. d4 Bb7 3. Nc3 Nf6 4. Bd2 e6 5. e3 Be7": "If I am lucky he will move his King Bishop out before shielding g2.",
        "6. Nf3": "No such luck!!",
        "6... d6 7. Be2 Nbd7 8. O-O O-O": "We both seem to have reach an initial position in which we are somewhat comfortable.  (But having been away from the board for some months I was not really comfortable with any position!)",
        "9. b4": "He begins struggle by undertaking some action on the Queenside.",
        "9... c5 10. bxc5 bxc5 11. Rb1": "Apparently he does not like my long diagonal Bishop.",
        "11... Bc6": "But I do.\r\n",
        "12. Bc1": "I am not sure where he was going with this repositioning move.",
        "12... Rb8 13. Ba3 Ne4 14. Nxe4 Bxe4 15. Bd3 Bc6": "I still want my Bishop on this diagonal.",
        "16. Nd2": "I felt this was preparatory to Qh5 but was comfortable I should be able to handle such an advance.",
        "16... Bf6 17. Bb2": "To me, this did not seem all that good of a spot for his Bishop.",
        "17... d5 18. cxd5 Bxd5 19. Nb3": "Perhaps a3 or a4 may have been better.  Though the Knight on b3 does provide some additional support for d4 I believe Black could play to give White isolated queenside pawns.",
        "19... cxd4 20. exd4 h6": "This seemed appropriate to me for a number of reasons.",
        "21. Nc5": "A miscalculation?  I usually look to see if the gift is real or a Trojan horse.  Since it appears to be real I never look a gift horse in the mouth.",
        "21... Nxc5 22. dxc5": "Hmm, I guess it will be a gift Bishop.",
        "22... Rxb2": "When I gain a material advantage, simplifying the position seems to be in order.",
        "23. Qc1 Rxb1 24. Qxb1 Bd4 25. Qb5 Qc7 26. Rc1 Bxa2": "This had been in my line of fire for several moves but now that my own \"a\" pawn has a guard I decided I could take it.",
        "27. c6 Bd5": "I had no wish to leave my Bishop unprotected and I did not want his Queen to be able to reach the Kingside laterally.",
        "28. Qb4": "I really did not expect him to do what I wanted him to do thus when he did so on this move I was rather happily surprised!!",
        "28... Qf4": "Now I draw a bead on his c1 Rook and threaten a discovered attack on his Queen as well as posing a mating attack against his King.",
        "29. Qe1": "A limited defense ( I don't believe an adequate defensive move was available.)",
        "29... Bxf2+": "Adding at least the exchange to my material advantage.",
        "30. Qxf2 Qxc1+ 31. Bf1": "Perhaps Qf1 would have been better but at this point the position and the game was really Black's.",
        "31... a5": "Moving the pawn out of harm's way.",
        "32. Qb6 a4": "And again.  (It is also moving toward its queening square.)",
        "33. c7": "So White does the same.  However, at the moment White's queening square is under the observation of both Black's Rook and Queen.",
        "33... Bc4": "OUCH!!!!  The power of the pin is demonstrated rather painfully to White.",
        "34. Qf2": "While this prevents the immediate mate, the forthcoming piece exchange will leave Black with an unstoppable \"a\" file pawn.",
        "34... Qxf1+": "White elected to resign."
    },
    "url": "https://gameknot.com/annotation.pl/first-complete-game-after-my-computer-crash-hiatus?gm=17703",
    "gameName": "First complete game after my computer crash hiatus.",
    "players": "pjoern (1458) vs. throneseeker (1492)",
    "opening": "English opening (A10)"
}