{
    "moves": {
        "1. e4": "This is the first team match game I have finished so far, and the game is quite one sided, but it is still kind of nice. ",
        "1... e5": "I almost never see this reply in my OTB or online chess games anymore. About 10% of the time this move is played against me by my opponents. The overwhelming favorite is the Sicilian defense, then the French. ",
        "2. Nf3 Nc6 3. d4 exd4 4. Bc4": "So the game is a Scotch Gambit. Although the computer doesn't like it, it is probably the perfect choice against a human player-Gains activity early on, which is definitely the right idea, and totally solid fundamentally. Even at the expert level this is a great choice.",
        "4... Nf6 5. e5 Ne4": "This line is almost never seen. For most of my experienced opponents, ...d5 is automatic. However, this move is acceptable.",
        "6. O-O d5": "The move order change favors white, because now taking the pawn forces black to take back awkwardly with the knight, not the bishop, and so black does not gain any development advantage there. Anyways, white is better developed, so it should be obvious.",
        "7. exd6 e.p. Nxd6 8. Bd5": "It's the best move, maximizing the bishop's activity. Now white should have very nice compensation for the pawn. My opponent makes a big mistake on the next move.",
        "8... Ne7": "A terrible move that blocks in the dark squared bishop. In open positions, this kind of thing cannot be acceptable. So now white has a major lead in development, his goal is to create maximum contact between the pieces, creating tactics. Such tactics must be in white's favor, for he has more activity.",
        "9. Re1 c6 10. Bb3 Bg4 11. h3": "Here I totally forgot about my previous analysis and instantly played this inaccurate move. The move I had planned to make was 11.Bf4, to me clearly the best move. For some reason, the Gameknot analysis engine suggested the rather odd line starting with 11.Qxd4(looks impossible to be the best move). Although the computer says it is best, I just can't bring myself to believe it at all. Black can ruin the kingside pawns(although that is the least of matters), and with Ndf5 can untangle his position on the queenside at least. White still has a clear advantage in this line, and I can see why the computer likes it, but my line is probably better. With the game comtinuation, now black should just take the f3 knnight, ...Qa5, then castle long, with a holdable position, although white has more than enough compensation.",
        "11... Bh5": "Very poor move. Now I breathed a sigh of relief, as the win is safely in my pocket-I have a huge initiative, and the black's pieces are very poorly placed and backwards.",
        "12. g4": "This move really is automatic, and playing it instantly has no risk. Piece activity can compensate for anything.",
        "12... Bg6 13. Qxd4": "Now white is just winning, and the game is over quickly-Black cannot untangle any of his pieces. He is playing without a rook and bishop, and perhaps 2 rooks.",
        "13... Nb5 14. Qf4": "Clearly best, targeting the f7 square. My opponent's next move made things very easy.",
        "14... Qd6": "Wants to trade queens, and that is fine with me. A simple safety check would have prevented him from making the move. ",
        "15. a4": "Simple and effective, picking up the piece. By the way, it is cool to see that the general principles work even in the open tactical positions- Here, we should keep up the pressure, as releasing it helps the opponent, and tactically it works. Is it a coincidence? Probably not. The most fundamental princniples are usually working in all kinds of posiitons.",
        "15... Qd7 16. axb5 cxb5 17. Ne5": "Now it is a matter of time before black suffers serious material loss.",
        "17... Qc8 18. Nxf7": "A blunder, according to the engine analysis, but it is still winning.",
        "18... Bxf7 19. Bxf7+": "Now my opponent resigned, since he must lose his queen."
    },
    "url": "https://gameknot.com/annotation.pl/first-team-match-game?gm=46007",
    "gameName": "First Team Match Game",
    "players": "tiger_lilov (1876) vs. kexall (1838)",
    "opening": "Scotch gambit (C44), Dubois-Reti defence"
}