{
    "moves": {
        "1. e4": "This is the game that finally got me over 1800 rating. The fourth in a series of games with alira22. I lost the first and won the last three. ",
        "1... e5 2. Nf3 Nf6": "Petrov's Defence",
        "3. Nxe5 Qe7": "I don't really like this move. It blocks the dark squared bishop's development.",
        "4. d4 d6 5. Nf3 Nxe4 6. Be2 d5 7. O-O Be6 8. b3 Nd7": "I am behind in development but I have castled already and I can strike at the black center soon. He does have a well placed knight on e4 but with my next move I begin to weaken that square.",
        "9. c4": "Attacking the center. If 9... dxc4 10. Bxc4 Bxc4 11. bxc4, I end up with two pawns that control central squares, and his knight facing the possibility of a pin. If 9...dxc4 bxc4, I end up with two central pawns but I wasn't sure of my light squared bishop's activity in this line. If he castles queenside, I don't even remember what I thought of doing if he castled queenside, but right now I think I could have pawn stormed my way to his king.",
        "9... c6 10. cxd5 Bxd5 11. Bc4": "Offering the pretty much inactive light squared bishop for the possibility of central control with the c and d pawns.",
        "11... Qe6": "He declines at first.",
        "12. Re1": "Pinning the knight on e4 and possibly winning the game. I thought about 12. Ng5, for a while, there were some tactics involved there that I don't quite remember, but I remember not liking the end result as much as Re1's end result.",
        "12... h6": "Now my knight can't go to g5, but it can go to d2 and it will.",
        "13. Nfd2": "I consider this to be a bit of an underdevelopment, but this underdevelopment weighs less than the loss of a piece. Now my f pawn is free and can attack the knight, plus I am already threatening to win the knight since 13... Bxc4 Rxe4 loses the queen, 13... Nxd2 loses the queen, and any moves other than 13... f5, 13... Nf6 lose the knight immediately since the d5 bishop should not take whichever piece captures on e4, for it is pinned by the c4 bishop to his queen.",
        "13... O-O-O 14. Rxe4": "I didn't take with my knight because after 14... Bxc4 15. bxc4 Qxc4, I'd have been +2 instead of +3, and I haven't looked that deep into it but I think that maybe I couldn't have developed as quickly as I did in the game.",
        "14... Qf5": "Unpinning his light squared bishop so that he can attack my rook.",
        "15. Bxd5": "Getting rid of the light squared bishop's threat and simplifying the game since I'm a full piece ahead. Allowing him to keep that bishop could have been detrimental to the safety of my king as well.",
        "15... Qxd5": "If cxd5 then his king is on an open file and if I develop quickly he could be in a lot of trouble.",
        "16. Nc3": "Developing with tempo.",
        "16... Qa5 17. Bb2": "My development of minor pieces is complete. I also considered Nc4, but if 17. Nc4 Qxc3 18. Bd2 Qd3, finding a safe square and attacking my rook at the same time. Maybe if I looked deeper into it there was a way of trapping the queen if it took on c3.",
        "17... Nf6 18. Nc4": "Placing my knight on a better square, with tempo as well.",
        "18... Qc7 19. Re1": "Getting my rook out of harm's way.",
        "19... Bb4 20. a3": "Trying to get rid of the pin.",
        "20... Bxc3": "I don't really think trades favored him at this point, but there was no way of avoiding this trade after 19... Bb4, unless he wanted to put his bishop on e7 or on f8, squares on which the bishop will be hardly active.",
        "21. Bxc3 Qf4": "Here, I was sensing a bit of danger towards my king. I needed to make a good move here to prevent my f and h pawns from being forked with 22... Ng4",
        "22. Ne5": "I thought this was one of the best to prevent such things, plus it would get my knight in a nice square in the center of the board, and if he was not careful, I could fork his rooks.",
        "22... h5": "I could have forked his rooks here, at the cost of my king being exposed. I didn't calculate too deeply into the lines where my king could be attacked, and decided that offering my queen for his queen could nullify his attack on my king, and I think that I was right.",
        "23. Qf3 Qxf3 24. gxf3": "I doubled my pawns on purpose, maybe this wasn't the right move, but I wanted to keep my knight on it's active square on e5.",
        "24... Nd5 25. Bd2": "Saving the bishop and taking away squares for his knight, also preventing an immediate advance by the g pawn to g5.",
        "25... Rhf8 26. Be3": "Offering my bishop in order to get my pawn structure fixed. Also a bit of a defensive move to defend the d pawn which could have been subject to a discovered attack by moving the knight on d5.",
        "26... f6 27. Ng6": "Preventing a pawn storm and keeping my knight close to his king and his rooks.",
        "27... Rf7 28. b4": "Attempting a minority attack.",
        "28... f5": "This is probably a mistake.",
        "29. Bg5 Rd6": "Not sure that Rg8 was better, his rook would have been doing close to nothing on g8, even though it would have avoided further material loss.",
        "30. Re8+": "Now he is forced to lose an exchange, I believe.",
        "30... Kd7": "If 30... Kc7 31. Ne5 wins the exchange.",
        "31. Rd8+": "The king is forced into c7 anyway, because if 31... Ke6 32. Re1+ Ne3 33. Nf4#",
        "31... Kc7 32. Ne5": "The exchange is lost, and now he can give up.",
        "32... Rff6": "Maybe he was giving it a last shot, to see if I took the d6 rook now and he could re-capture with his f6 rook.",
        "33. Bxf6": "Disallowed.",
        "33... gxf6 34. Rxd6": "Important, otherwise I would only be the exchange up.",
        "34... Kxd6": "Now I was up a rook and he resigned."
    },
    "url": "https://gameknot.com/annotation.pl/first-time-rated-over-1800?gm=49815",
    "gameName": "First time rated over 1800",
    "players": "rickypr18 (1804) vs. alira22 (1721)",
    "opening": "Petrov (C42), French attack"
}