{
    "moves": {
        "1. d4": "I'm playing black and I'm using the \"Fisher\" (Reti) opening again.",
        "1... Nf6 2. Nc3 g6 3. e4 d6 4. Nf3 Bg7 5. Bc4 O-O 6. e5": "An early attack by white.",
        "6... dxe5": "If white takes the pawn, it opens up the early queen exchange.",
        "7. dxe5": "It's always a tough decision to exchange queens, but I must have been happy with my early castle and feeling confident about my chances, so I take his queen.",
        "7... Qxd1+ 8. Nxd1": "White wisely preserves his ability to castle.",
        "8... Ng4": "Pressuring the e5 pawn.  I expect a pawn attack, which would result in stacked pawns.\n9. e6 Bxe6\n10. Bxe6 fxe6",
        "9. Bf4": "I get a bit lucky in that he chooses to defend the e5 pawn.",
        "9... Nc6": "More pressure on e5.",
        "10. O-O Ngxe5": "A no brainer.  Go up one.  I fantasize about exchanges ...\n11. Nxe5 Nxe5\n12. Bxe5 Bxe5\n13. c3 b6\n14. Bd5 Rb8\n... but he recognizes the situation.",
        "11. Nd2": "I look at this now, and I wonder why I didn't exchange the bishop for a knight, but I must have seen the chaos of a pair of knights in the middle of the board.  (I doubt I actually knew how successful this next move would be, but maybe by subconscious knew.)  :-)",
        "11... Nd4 12. c3 Nxc4": "I set up a trap.  I expect ...\n13. Nxc4 Ne2 \n14. Kh1 Nxf4 ( 4)",
        "13. cxd4": "But he sees the trap!",
        "13... Nxd2 14. Bxd2 Bxd4": "My big trap didn't work, but the small one does.  I'm still up 2 points and move into conservative play.",
        "15. Bb4 c5": "I get lucky and he lets me gain a tempo.",
        "16. Bd2 Bg4 17. Nc3": "Up 2 points, I'll take a trade, even a knight for a bishop.",
        "17... Bxc3 18. Bxc3": "Here, I should be thinking about moving pieces into white squares where possible.",
        "18... a5 19. h3 Be6 20. Rfe1 b5 21. Re5 b4 22. Be1 c4 23. Rc1 Rfd8": "Control the open file.",
        "24. f3 Ra6 25. Bh4 f6 26. Re4 Rd2 27. Rb1": "A lucky break again, the pressure on the b2 pawn sets up diagonally stacked rooks.",
        "27... Bf5 28. Rxe7 Bxb1 29. b3 Rd1+": "I'm expecting a block.  \n30. Be1 cxb3\n",
        "30. Kh2 c3 31. Re1 c2 32. Rxd1 cxd1=Q 33. g4 Qxf3 34. Bxf6 Rxf6 35. g5 Bxa2": "A little late game sloppiness here, but no great harm.",
        "36. gxf6 Qxf6 37. h4 Qxh4+ 38. Kg2 Bxb3 39. Kf3 a4 40. Ke3 a3 41. Kd3 a2 42. Kd2 a1=Q 43. Kd3": "Avoid the stalemate, keep him in check.",
        "43... Qc3+ 44. Ke2 Qh2+ 45. Kf1 Qc1#": ""
    },
    "url": "https://gameknot.com/annotation.pl/fisher-reti-for-black-beware-of-a-pair-of-knights-in-the-middle-of-the-board?gm=3962",
    "gameName": "Fisher/Reti for black, beware of a pair of knights in the middle of the board",
    "players": "crunch8 (1452) vs. rpilaud (1447)",
    "opening": "Queen's pawn game (A45)"
}