{
    "moves": {
        "1. d4 Nf6 2. c4 e6 3. Nc3 Bb4": "I usually don't play that with white. However I've seen that position many times and had the enthusiasm to play something new for me. ",
        "4. Qc2 O-O 5. Bg5": "Here I was just having fun while playing what seems ordinary ",
        "5... d5 6. e3": "Black, however, took the center and now we are in Queens gambit. ",
        "6... c5 7. a3": "I'm not sure about the accuracy of that move. As I see it, it's almost certain that the black bishop would be exchanged for my knight so I don't have to force it. I wanted to play that before black plays Nbd7, cause then he would have the Qa5 move. Now if the black Queen goes to a5, I will take on f6 and black will have a bad pawn structure. ",
        "7... Bxc3+ 8. bxc3 cxd4": "Here, I had a few extra seconds to decide with wich pawn to take. I saw that if 9. cxd Qa5+ 10. Qd2 Qxd2+ 11. Kxd2 Ne4+ and I lose a bishop ",
        "9. exd4 Bd7": "Here I asked myself if I should develop my bishop or my knight first. I wasn't certain if I should play my knight on f3 or on e2. So I decided to liave it like that for know and keep my plans a surprise. ",
        "10. Bd3 h6": "You see, I was threatening to take on f6 and h7. The h6 move prevents that. ",
        "11. Bh4 dxc4 12. Bxc4 Bc6": "That's interesting cause we more often see the knight go on c6. Now the Black attacks my g2 pawn, also tries to take over e4 square (maybe with g5 and Ne4). ",
        "13. f3": "So I keep the pawn and the square. This is one of the reasons it was good not to play my knight on f3 that early. Now it will go to e2. What I like here is that also after eventual g5 I might place my bishop on f2. ",
        "13... Nbd7 14. Ne2 Qc7": "The treat here is 15. 0-0 Bxf3 16. Rxf3 Qxc4 winning a pawn. So I had to defend or move my bishop. I didn't played Qd3 cause I thought that there would be many pins after some rook goes to d8. So I decided to move the bishop and I needed it to be behind my queen so that I can manage a mate attack or something in the future. Thats why I played it on a2. ",
        "15. Ba2 Rac8": "Again preventing me from castle. The treat here is Bb5, attacking my c3 pawn and one of it's defenders. I got prety scared of that move, cause I didn't want to play Rc1 right now. ",
        "16. a4": "Seems like a tricky solution, but I needed more calculations... ",
        "16... Qa5": "... Cause of this. Now if I play Bb3, I've lost a tempo. If I play Bb1, my rook from a1 happens to be inactive. However, I had thought that I might sacrifice the a4 pawn. It, at least, means that black had spent one more move with his bishop before placing it on b5. Move that I might use to attack. ",
        "17. O-O Bxa4 18. Qd2": "Now see the folowing I have a pawn less, but if my opponent moves his queen or his bishop, I might return it by Bxe6. At the same time my treat is Bb3. Eventully I might take on a4 and black would have a doubled a pawns. I played my queen on d2, cause I expected g5 to be a clash point. Wait and see. :) ",
        "18... a6 19. g4 Rfe8 20. Bb3 b5": "I would have first playd Bb3 to fixate and then g4, but now it's the same position. Notice that a move before black queen had the potential to jump on the kingside and now the queen is kinda blocked by it's own pieces. ",
        "21. g5 hxg5 22. Qxg5": "I take with queen cause that way I treaten to take on a4 (you see the pin on the 5 file? ). Also, that way I join more pieces in my kingside attack. Not to mention that it was doing nothing on d2 cause my e2 knight is enough to defend the c3 pawn. ",
        "22... e5": "Tries to open the e-file and make presure on my bishop and c3. If I take, his rook would attack my queen with tempo. ",
        "23. Kh1": "I thought that such plans for black are very slow if I do a mate attack. After Rg1 , g6 wouldn't help, cause I will just play Qxg6. My bishop from b3 also does work. ",
        "23... Nh7 24. Qh5": "I have to treat something so that my opponent doesn't have time to take exd or make an adequate defence. That was better than 24. Qf5 Ndf6 ",
        "24... Ref8 25. Rfg1 Rc6": "Black is forced to defend and tries to join all his pieces. ",
        "26. Qg4": "He might have succeded if it wasn't for that move. ",
        "26... g6 27. Qxd7": "So, now I have a light pice more and still hold the initiative. ",
        "27... Qb6 28. Bxa4": "Just exchanging while having a material advantage. ",
        "28... exd4 29. Bb3 dxc3 30. Be7 Rfc8": "Here's the last key moment. I was just about to play Bd5 when I saw the following... ",
        "31. Bxf7+ Kg7": "If 31... Kxf7 32. Bd6+ Kg8 (32... Kf6 33. Qe7 + Kf5 34. Qe5#) 33. Rxg6+ Kh8 34. Qg7# ",
        "32. Bxg6 Rxg6 33. Rxg6+": "If 33... Qxg6 34. Rg1 losing a queen. ",
        "33... Kxg6 34. Rg1+": "35... Ng5 36. Rxg5+ Kh7 37. Bf6+ Kh6 38. Qh3+ "
    },
    "url": "https://gameknot.com/annotation.pl/flank-attacks-and-positional-sacrifice-to-injure-my-opponents-mobility?gm=59567",
    "gameName": "Flank attacks and positional sacrifice to injure my opponent's mobility",
    "players": "urnesthemingouey (1890) vs. somecooldude (unknown)",
    "opening": "Nimzo-Indian (E32), classical, Adorjan gambit"
}