{
    "moves": {
        "1. d4": "I am annotating this game for Zhanna - Zhannetka-84. This opening move, 1. d4 is fine. I usually play it myself!",
        "1... d5 2. e3": "2. e3 is a bit passive. I would play 2. c4, and enter the Queen's Gambit. There are opening databases on Gameknot which can help you play the openings without making any major mistake.",
        "2... e6 3. c3": "3. c3 is often played in this system, although I prefer to play Bd3 or Nf3, to develop a piece, or 3. f4 is more aggressive. ",
        "3... c6": "Black seems to be playing follow my leader!",
        "4. Nf3": "4. Nf3 is good, developing a piece. However it does block the f pawn. I quite like the idea of playing f2-f4, Nf3, Bd3, 0-0 and then the Bc1 can come into play Bc1-d2-e1-h4. If black wasn't careful white would build up a good attacking position. In this game white's bishop on c1 is not very well placed.",
        "4... Bd6": "Black breaks the symmetry!",
        "5. Nbd2": "5. Nb1-d2 is another sound developing move, but doesn't help the problem of what to do about this bishop on c1. b3 followed by Bc1-a3 was another option, but by moving the knight from b1 this is no longer an option as the knight defended a3.",
        "5... f6 6. Nh4": "Nh4 is a bad move, just wasting time. Bd3 or Be2 was better. ",
        "6... g5 7. Nhf3": "7. Nhf3 is a good move. It was the only square the knight could move to.",
        "7... g4 8. Nh4": "It is better to put the knight here than retreat it.",
        "8... Ne7 9. b3": "b3 is a good move, if followed up by Bc1-b2 and c3-c4",
        "9... b6 10. f3": "But white's attention switches back to the king's side. Bb2 was better, or continuing development with moving Bf1. Generally it is better to open up the position after developing pieces and castling. f3 allows black to open up the position.",
        "10... gxf3 11. Qxf3": "Nothing wrong with this move. I think it is best followed up with Bd3, 0-0 and e3-e4, if possible, to free the Bc1.",
        "11... O-O 12. Qg4+": "This check shouldn't achieve anything. Black should retreat the king to h8 and then play Rf8-g8. It is not a good move by white.",
        "12... Kf7 13. Qh5+": "But this is a good check, as it is hard to attack the white queen while it is on h5",
        "13... Kg8 14. Bd3": "bd3 is an excellent move, it develops a piece which needs developing and threatens Qh7 mate!",
        "14... Rf7 15. g4": "g4 is an interesting attacking move, but I prefer 0-0 perhaps followed by e3-e4",
        "15... b5 16. Bxh7+": "This is a very weak move. White gives up a bishop, worth 3 points, for a pawn, worth one point.",
        "16... Rxh7 17. Qxh7+": "And this move is very weak too. White gives up her most valuable piece, the queen, worth 9 points, for a rook, worth 5 points. White is clearly losing here.",
        "17... Kxh7 18. Ndf3": "This is a good move, advancing the knight to a better square.",
        "18... Nd7 19. Rg1": "This is a good move too, moving the rook to a better square.",
        "19... f5 20. gxf5": "This is good, as it opens up the g file for white to attack down.",
        "20... Nxf5 21. Ng5+": "This is an excellent move, as no matter where the black king moves to, white will be able to check to win the black queen. If the black king goes to the g file then white can play Ng5xe6 and give a discovered check to the black king from the white rook on g1, while simultaneously threatening Ne6xd8. Black can't save the queen.",
        "21... Kh6": "Because if the black king moves here or to h8 then white plays....",
        "22. Nf7+": "this wonderful move, attacking the king and the queen together!",
        "22... Kh5": "Black moakes the most of it and attacks the white knight.",
        "23. Nxd8": "White takes the queen, an excellent move!",
        "23... Kxh4": "Black takes the rook.",
        "24. Nxe6": "White briefly goes a pawn up, another good move.",
        "24... Bxh2 25. Rf1": "This is a good move too, the rook had to move.",
        "25... Ng3 26. Rf4+": "The rook was attacked again, this seems the best solution.",
        "26... Kh3 27. Ng5+": "This is a good move attacking the king.",
        "27... Kg2 28. Rf6": "This is a terrible move! Black could just take the rook with the knight on d7. I think the best move was Rf4-f2 check. There are only two squares the black king can go to. If the black king goes to g1 then white wins with Ng5-f3 check, forcing the king to h1 and then white can play rook takes Bishop mate. If black plays Kh1 immediately, I think black is still mated. It takes a bit longer, but basically white moves her bishop to b2 or a3, plays Nf3 and Ke2 to discover an attack by the Rook on a1 and white eventually plays Ra1xBg1 in most variations.",
        "28... Bg1 29. c4": "This another bad move. Oh Zhanna, I hope your opponent does not see he can take your rook!",
        "29... dxc4 30. bxc4": "He has given you another chance, and you have given him another chance too!",
        "30... bxc4 31. Rxc6": "Thank goodness you move the rook at last!",
        "31... Bf2+ 32. Kd1": "I don't think it makes much difference if the king goes to d1 or d2",
        "32... Nf1 33. Rxc4": "This is good, picking up a pawn.",
        "33... Ba6 34. Rc7": "This is good, attacking the knight.",
        "34... Rc8 35. Rxc8": "This is a bad move. White should simply have taken the knight.",
        "35... Bxc8 36. e4": "This move saves the e pawn.",
        "36... Nb6 37. d5": "and this move saves the d pawn.",
        "37... Bg4+ 38. Kc2": "This was the only square the king could move to.",
        "38... a5 39. Rb1": "White at last gets the rook into play. This is a good move.",
        "39... Nd7 40. Bf4": "This is a good move. If white can queen one of these pawns, she should win.",
        "40... Ne3+ 41. Kd2": "Kd2 is not a bad move, but I prefer Kd3 immediately.",
        "41... Nc4+ 42. Kd3": "Probably best under the circumstances.",
        "42... Na3 43. Rb3": "This is a reasonable plan, but there is a drawback.",
        "43... Nc5+ 44. Kd2": "I tend to prefer Kc3 so if black takes the rook on b3, white can take back with the king, attacking the other knight on a3. This then gives white time to advance one of her pawns.",
        "44... Nxb3+ 45. Kc3": "Another terrible move. White should just take the knight on b3 with the pawn on a2.",
        "45... Nc1 46. Bxc1": "This is a great move, reducing White's material deficit.",
        "46... Nb5+ 47. Kd3": "Kd3 is as good as anything, as Kc4 is met with Be2 check.",
        "47... Bh4 48. Bd2": "Bd2 is a good move, attacking the pawn on a5.",
        "48... Nd6 49. e5": "This is good too, attacking the knight and advancing the pawns.",
        "49... Nb5 50. Bxa5": "This is a mistake, as the bishop was guarding the knight on g5. She has to move the knight before taking the pawn. Kc4 to support the advancing pawns was another good move.",
        "50... Bxg5 51. a4": "It is a good idea to advance pawns in an endgame like this.",
        "51... Na3 52. Bb4": "and good to keep attacking ht eknight.",
        "52... Bd8 53. Bxa3": "White has played well to get back to being equal on material, and her pawns should even give her winning chances.",
        "53... Kf3 54. d6": "so these pawns have to be pushed...",
        "54... Kf4 55. Bc1+": "But know white just throws one of them away.  bb2 or Kd4 would have protected it.",
        "55... Kxe5 56. d7": "and now white throws away another one. Ba3, protecting the pawn was called for.",
        "56... Bxd7 57. Bb2+": "It is not a bad idea to check black. The last white pawn is doomed. However the position should be drawn.",
        "57... Kd5 58. Bc3": "Keeping the king and bishop together is a good idea.",
        "58... Bxa4 59. Bg7": "so moving it away is not a good idea.",
        "59... Bb5+ 60. Ke3": "It doesn't matter what white does, the position should be drawn.",
        "60... Bb6+ 61. Kf4": "Any king move is ok.",
        "61... Bd7 62. Kg5": "Any king move will do again.",
        "62... Bd8+ 63. Kh6": "Position should be drawn.",
        "63... Ke4 64. Bh8": "It is still a drawn position. I can say that with certainty, as there are free endgame chess databases which which you can analyse endgames with 6 or less pieces. I am using one for these annotations. ",
        "64... Kf5 65. Kh5": "This should be a losing move! Black should play Bg5  and then Be8 is mate. See http://gameknot.com/chess-puzzle.pl?pz=127358",
        "65... Be8+": "But black plays the moves in the wrong order!",
        "66. Kh6": "Kh6 is of course forced.",
        "66... Bg5+ 67. Kh7": "It doesn't matter if the king goes to h7 or g7, this position should be drawn again.",
        "67... Bg6+ 68. Kg7": "This is a dead draw.",
        "68... Bf6+": "Now white comes up with a clever way of showing how drawn it is!",
        "69. Kh6": "This moves looks silly, allowing black to take the bishop on h8, but...",
        "69... Bxh8": "But white had cleverly spotted that if he takes the bishop, the final position is a stalemate. many thanks for reading this. I hope you enjoyed it. Please leave a comment or two and rate it on the star system."
    },
    "url": "https://gameknot.com/annotation.pl/for-zhanna?gm=55657",
    "gameName": "For Zhanna",
    "players": "zhannetka-84 (922) vs. tricky1981 (1006)",
    "opening": "Queen's pawn (D00), stonewall attack"
}