{
    "moves": {
        "1. e4": "So, he starts conventionally.",
        "1... c5": "And, I also answer with my usual.",
        "2. c4": "Ted usually answers with 2.Nf6, and then, which ends up in an Open Sicilian.  Similar to my first game with elyhim, I'm normally not used to that and wouldn't know how to handle the situation.  But, I studied one or two annotations with charleshiggie, where 2.c4 was played.  From that experience, I know that we're talking about the Closed Sicilian.  And, I don't have a problem since I know some of what Charles did.  But, I start after my next move.",
        "2... d6": "That's because I want to continue conventionally with this move.  But, after Ted's next move, I know what do.",
        "3. Nc3 Nc6": "As charleshiggie answered with this.",
        "4. g4": "Fianchettoing, but I was surprised to see this played.  My model used to be, \"Expect to be surprised\" but as cplusplus11, that's not a good approach.  So, I developed a different model which I learned from ION.  However, he did not directly state this.  Instead, it was implied but it was to learn how to handle different responses and things you might not be used to or did not anticipate.  This is one of those times because I have not seen this played from white before.  The only time is in the Basman Defense, but that's with black since it starts off with 1.e4, g5",
        "4... g6": "Since I did not know what to do, I tried something different.  As now, the idea is doing something that I'm not comfortable which is the logic behind this fianchetto.  I've done it before but am not comfortable doing with something that I haven't see.  However, my model is that thinking about what the contestants had to do on American Idol to be successful on that show.  They also had to get out of their comfort by trying different methods that they weren't used to.  It boils down to trial and error.  Were I to stay in my comfort, I would've played 4...Nf6 to mobilize the K side, at once.",
        "5. d4": "? I understand that he wanted to develop.  And, the idea was also putting pressure on my Nc6.  But, it is a mistake, as this move is going to cost him a pawn and tempo since his N will come under fire.  Just about anything was better then this.  As white, though, I would've either developed my Bf1 or played 5.Nf3.  Like with black, the idea would be to mobilize the K side and castle.",
        "5... cxd4 6. Nb5 a6": "? Figuring that I had gained tempo, however, I attack.  But, I overlooked his next move, however, as this move gives him back the pawn.  Best was 6...e5.  In capturing, however, I will retake.  This forces him to play 8.Qxd4 to avoid losing a piece.  Normally, we just expect it and doesn't seem important.  But, there's more to it then meets the eye as it is significant.",
        "7. Nxd4 Nxd4 8. Qxd4": "And, it's the fact that Ted's Queen is forced into action before continuing development.  Consequently, I will harrass it with my center pawn and use that time to continue developing.  That is an important concept of why we don't bring the Queen out too early.  In this case, however, there was no choice, but the consequences are still the same.  ",
        "8... e5 9. Qd1 Bg7": "My idea of that development is the B, as now, it has a nice long flank where it covers the longest diagnol.  And, it is why I also enjoy fianchetto's before that.",
        "10. f4": "? Instead of continuing to develop, Ted advances his f pawn.  Normally, I just give it as a slight inaccuracy.  But, in this context, it's a mistake in my books because of what tactical-abyss emphasized in his Q sacs.  Just like when black takes the Knight in the Damino's Defense, the idea is the same.  That's because this is his weakest pawn.  By playing this, I'll remove his that by exchanging.  Consequently, white is now in trouble.  In fact, that is one way in which Joe forces those wins in his early Q sacs.  And, I'm using a very similar tactic for this game.",
        "10... exf4 11. Bxf4 Nf6": "Preparing to castle by developing on the K side.",
        "12. h3": "? I was shocked to see Ted play this since he hasn't castled, yet, and his K side is not developed.  More importantly, this loses a pawn.  With those two being said, best was 12.Bd3, developing, whilst, keeping his e4 protected.  Unlike before, after my next move, I'm not going to allow Ted to to get back a pawn.  That's because there will be no more lucky mistakes from me.",
        "12... Nxe4 13. Ne2": "?? This also develops, but I view it as an inaccuracy.  First, his Knight is now crammed here which I will take advantage of.  More importantly, he could've pinned my Ne4, after which, I'd have no idea what to do from there.  Better would've been 13.Nf3, or 13.Bg2.  Best, however, would've been 13.Qe7 which pins the N.  After which, I'd be clinging.  Although I don't like it for a similar reason to what I mentioned, I'd answer with 13...Qe7, to protect my N and break the pin.  But, this move, makes things quite easy for me, as I'll treat, as though, black took the N in the Damiano's with the same responses.  But, this move loses his right to castle, gets his King exposed, and loses a piece.  So, it is, in my books, the losing blunder because as noted, I'm not going to allow him counterplay. ",
        "13... Qh4+": "But, I was keeping in mind that Ted's position was cramped, and thus, took advantage of that.  Although there's actually a little more to this story, that's how I was thinking.  The reason being is that white can no longer castle which is why he should've done so, earlier.  BTW, I'm not trying to be pompous, as it might sound, but I'm, believe it or not, basing my commentary on what Jack told Ted.  It was last week after a similar mistake, and he Mr. Stockel said, \"You used to castle, Ted.  Why didn't you do that in your game with Joe?\"  He was pointing out how Ted wrong.  I kept that, combined with the GM game in mind since both failed to castle on time and were punished.  The same is true here.",
        "14. Ng3": "Due to my nasty Ne4 he can't get out of check.  Whether he played this or 14.Bg3, the result is the same (the loss of a piece) since I will take on g3, regardless.",
        "14... Nxg3 15. Bxg3 Qxg3+ 16. Kd2": "After which, I will deliver a series of checks, in an attempt to force a mating sequence.  I did, however, overlook one thing, but black still has a winning advantage which I will not ruin.",
        "16... Bh6+ 17. Kc2 Qf2+ 18. Qe2+": "This was the move that I overlooked, as now, I'm in check.  But, it does not matter because I will liquidate, while a piece up which is to my benefit.",
        "18... Qxe2+ 19. Bxe2 O-O": "Without an immeidate mate, I calculate what to do.  The idea is to force a mate.  So, I'm doing something similar to what bhidragon did in our rated game.  It's adding another attacker.  The plan is to get my Rook mobile and move it down to the fourth rank where there is more pressure against Ted's monarch.  The idea is that my developed pieces are what's targetting what will continue to target his exposed King.",
        "20. Rad1": "This is the only thing I did not know.  It boils down to which Rook.  I believe it was this, but unlike with other games, it does not matter since my next move is the same.",
        "20... Bf4": "The plan though is an eventual Rf8-e4, followed by ...Be5  Since white would be forced to protect his Be2 (as it's attacked with ...Re8 which I'd play first), white would have a difficult time defending, since afterwards, I'd bring the other Rook (so my Ra8 into the attack.)  Organizing both Bishops (or bishop pair) and both Rooks would make it very difficult for him to prevent mate.  And doing so would put a lot of compromises on his position due to my edge.  Again, I'm just calculating but could be things that I am overlooking as well.  But, the plan is the same by organizing Bishops and Rooks for a nasty attack due to the Kingside being weakened.",
        "21. Rxd6": "?? But, this is Ted's final blunder.  Feeling that white compensated for lost material, he took my pawn. ",
        "21... Bxd6": "And, I took his Rook.  After this, Ted resigned.  The final blunder was 21.Rxd6  But, he got himself by not following the general guidelines which I was then able to exploit by harrassing his Queen, removing his weakest pawn, and taking away his right to castle which also lost a piece.  So, as usual, the moral of this story is to develop, control the center, and get the King to safety.  White's failure to do that is what led to this outcome."
    },
    "url": "https://gameknot.com/annotation.pl/for-real-this-time-general-guidelines?gm=61307",
    "gameName": "\"For Real This Time\"-General Guidelines",
    "players": "Ted  vs. Joe (1350)",
    "opening": "Sicilian (B20), Gloria variation"
}