{
    "moves": {
        "1. e4 e5 2. Nf3 Nc6 3. Bb5": "A regular Ruy Lopez opening\n",
        "3... a6 4. Ba4 Bc5": "This move is not the most commonly played move, but it works out just fine, I think\n",
        "5. c3": "By the look of it, preparing a d4 break\n",
        "5... Nf6": "Black ignores the potential d5 break and continues development\n",
        "6. Qe2": "now Black need not worry about the d4 break anymore... he now need to worry about what plans White may have for the queen\n",
        "6... b5": "Black plans to castle next move, so he feels perfectly safe playing this move. It gives Black a head-start on a future queenside pawn storm, if he chooses to do so.\n",
        "7. Bb3 O-O 8. d3": "knowing that d4 won't work, White chooses d3 while opening the diagonal for Black's dark-square bishop\n",
        "8... h6": "Black denies White the chance to play Bg5. Perhaps he should now be thinking about what to do with his d-pawn...\n",
        "9. Be3": "but first he must do something about his bishop. Simply defending it (e.g. 9...Qe7) isn't the best idea, since White doesn't need to exchange. Instead, he might play a move like 10.d5!, and White seems to have the better position then. Also, the other squares for the bishop didn't look like they suited it, so...\n",
        "9... Bxe3": "I decided to exchange here.\n",
        "10. fxe3": "!? A surprising move, but I saw the point of it; White has doubled pawns, but their presence in the centre of the board can be seen\n",
        "10... d5": "Black gets aggressive, thrusting his second centre pawn forward while opening up a diagonal for his light-square bishop\n",
        "11. exd5": "White opts to get rid of it as soon as possible, which is actually sensible, as it rids White of the doubled pawns\n",
        "11... Nxd5 12. Nbd2 Be6 13. O-O Qd7": "Over the last couple of moves, both sides have undergone smooth development. I did look at a way to attack White's uncastled king before he did castle, but could find nothing. \n",
        "14. Ne4": "White strikes first! the knight is obviously heading towards the c5 square, ready to exchange knight for bishop. It can't be stopped if White is determined to get there (14...Qe7 15.d4!), so Black might be better off letting it get there. So with the move he has before that, what can he do?\n",
        "14... Kh8": "?! There are probably better moves than this in the position, but I was concerned about king safety. This does, however, take the king off the diagonal of White's remaining bishop. The Gameknot analysis didn't mark this move as an inaccuracy, but the advantage (which had been pretty close up until now) jumped from -.36 to -.76, which means that White has the advantage.\n",
        "15. Nc5": "As planned by White...\n",
        "15... Qd6 16. Nxe6": "Although Gameknot has nothing bad to say about this move, I wonder whether White may have been better off playing 16.d4. After all, c5 was a good outpost for the knight, and with this exchange Black has the knight pair, whereas White has a bishop and knight, and the knight pair is better than that, I believe.\n",
        "16... fxe6": "!? Following in White's footsteps on his 10th move. Black hopes to use the f-file to his advantage\n",
        "17. Rae1": "White brings his last piece to where the action is - kingside\n",
        "17... Rf5": "With the idea of doubling up on the f-file, and, if White decides to move the knight then play Rxf5, Black can recapture with the pawn and improve his pawn structure\n",
        "18. d4": "White wants something to be done about Black's e pawn...\n",
        "18... e4": "If I played this game again, I don't think that I would choose this move, though again GK analysis doesn't fault it. What moves would have been better then? One option is 18...Raf8, letting White initiate the exchange; 19.dxe5 Nxe5 20.Nxe5 Qxe5, but here the e6 pawn becomes weak. Another option would be exd4, and I can't see anything wrong with that!\n",
        "19. Nd2": "White retreats his knight, but now targets my e4 pawn...\n",
        "19... Raf8": "?! This marks the first inaccuracy of the game, according to Gameknot. Nf6, the only move that saves the pawn on f4, was best, but I had hoped that the pawn sac would be justified by the action that Black gets down the f-file\n",
        "20. Nxe4 Qe7": "obviously going for f7...\n",
        "21. Bc2": "but White sets up a tactical trick of his own!\n",
        "21... Qf7": "Black now has a very strong influence over the f-file now, and should White have insufficient defence on f1, Black can mate. Not that he's forgotten about the other areas of the board...\n",
        "22. Ng3": "a double attack on the rook on f5, and Black's next move is forced... \n",
        "22... Rf6 23. Qd3": "! Nice! To save a pawn (and stop Qh7#, of course) Black needs to relinquish the pressure on the f-file...\n",
        "23... g6": "? Black misses the trick - 24.Rxf6 Qxf6 25.Qxg6, and it starts to look a little desperate for Black... 23.Qg8 would be the move to make here.\n",
        "24. e4": "? Fortunately, White also misses the trick, and inevitably allows Black to improve his position...  \n",
        "24... Nf4": "the knight is very aggressive in this position, and I had ideas of a a move like Ne2+ or Nh3+ later on to achieve mate...\n",
        "25. Qe3": "but White is not done with his own threats yet!  here, White threatens 26.e5! winning the rook (or just the exchange, but 3 points down is not good!)\n",
        "25... e5": "forced. Black would love the pawn exchange to get his knight into the action...\n",
        "26. d5": "but White simply advances it instead\n",
        "26... h5": "?? Now here's where things start to get interesting! I though that this could turn into a mere exchange (because if the knight moves, Black will have this; 27.dxc6 h4 28.Ne2?? (Nf5 is another variation I considered, but I just want to highlight the mate) ...Nh3+! 29.gxh3 Rxf1+ 30.Rxf1 Qxf1# [I always like playing through possible mates in my games, even if they don't work out... it gives me confidence for the particualar game :)] However, White has a trick that refutes this and leaves Black down a knight... Best was Na5, which puts the advantage 0.70 in White's favour - of course, that means that Black would be in no way losing!\n",
        "27. dxc6 h4": "? Qxa2 lets Black salvage something from the mess he put himself in...\n",
        "28. Bb3": "! and now the queen must vacate the f-file and White's knight is safe to move out of harm's way.\n",
        "28... Qg7": "Gameknot prefers Qe7, but I was still looking for opportunities to attack. If I was four points down with absolutely no prospects of attack whatsoever, I may have been tempted to resign, but here I still have some considerable pressure on the kingside\n",
        "29. Ne2": "White threatens to exchange, which suits him because of his material advantage...\n",
        "29... g5": "But I was actually happy for the exchange! The reason for that is simple; it opens up lines for my pieces to put pressure on White's king.\n",
        "30. Nxf4 gxf4 31. Qh3": "White threatens my pawn...\n",
        "31... Rxc6": "so I turn it into the exchange - now the h-file will become partially open as well!\n",
        "32. Qxh4+ Rh6 33. Qf2": "The only square for the queen.(Interestingly enough, this was exactly the line that Gameknot gave when it labelled Qg7 as an inaccuracy)\n",
        "33... Qh7": "Black's target has now switched from f1 to h2!\n",
        "34. h3": "the natural way to defend h2...\n",
        "34... Rg6": "and I counted on it! (White's extra piece, the bishop, proves to be quite a thorn in Black's side, preventing the f8 rook from easily getting into the action)\n",
        "35. Qc5": "White launches a double attack on e5 and f8...\n",
        "35... Re8": "meaning that this moved was forced.\n",
        "36. Red1": "?! White overlooked the fact that his g-pawn was pinned...\n",
        "36... Qxh3": "and Black capitalises - the open h file can now be extremely useful for Black!\n",
        "37. Rd2": "preventing Rxg2#\n",
        "37... f3": "as I've said, Black wants to attack down the h-file. This pawn move will force White to defend the pawn again... \n",
        "38. Rff2": "with this move. However, the f2 square would have been a very useful escape square for the king...\n",
        "38... Qh4": "and now Black threatens 39...Rh6!, and the forced line; 40.Rxf3 Qe1+ gives Black the advantage.\n",
        "39. Qe3": "The threat is stopped...\n",
        "39... Rf8": "and renewed....\n",
        "40. Bd1": "! and stopped again. I guess it might have been here where Black's attack is officially at an end, but Black isn't giving up yet!\n",
        "40... Rh6": "According to the GK database, Rxg2 was the best move to make here... though I believe that it's just analysing that in terms of material. The line that Gameknot gives trades off both rooks, and then Black has no attack. Here, Black still may have chances to pull off a surprise win here...\n",
        "41. Rxf3": "Forced\n",
        "41... Qh2+": "I didn't play Qh1+ here because White could rebuff the attack; 41...Qh1+ 42.Kf2 Rg8 43.Rg3!. With this move, Black prevents this....\n",
        "42. Kf1": "but the king now doesn't need to block the d2 rook!\n",
        "42... Rg8": "forced in my view (I still didn't want to trade material) but after White's next move, I wished I had traded material. I had a vague plan here involving a rook to h4 and rook to g3... I can't remember what I was planning...\n",
        "43. Rh3": "!! but this move just brings everything crashing down to the ground! The exchange of the rook and queen is forced, and Black has nothing. Here I resigned. So what makes this game so interesting to me? there are two things; 1) Despite the material defect, Black was the one putting the pressure on White, and White had to respond to Black's threats quite a few times. [Question: is that keeping the initiative?] 2) As I played through the games, I honestly thought that I could pull off a surprise win, until White's final move (and that win would have been my highest on Gameknot). Still, it was a great game - thanks very much to my opponent! :)\n"
    },
    "url": "https://gameknot.com/annotation.pl/for-your-entertainment?gm=31991",
    "gameName": "For Your Entertainment",
    "players": "schurl (1881) vs. x-machine (1480)",
    "opening": "Ruy Lopez (C70), Classical defence deferred"
}