{
    "moves": {
        "1. d4": "This was a fun game with a nice forced checkmate at the end.  Black fought well and only really made one big mistake... ",
        "1... d5 2. c4": "c4 attacks",
        "2... dxc4": "accepted ",
        "3. e3": "I used E3 this time instead of E4.  I give up control of d5 and f5 and block my dark bishop in exchange for the strenght of protecting d4.",
        "3... Nf6 4. Bxc4": "Quickly white has nice postion and development.",
        "4... e6 5. Nf3": "preparing to castle",
        "5... Bb4+": "check threat.  I don't mind the impending exhange as it move my bpawn closer to the centre and supports the d4 square.  Since I am castleing kingside, its all good.",
        "6. Nc3 Bxc3+ 7. bxc3": "The predicated exhange is done.  Black can now castle and beat white to it!",
        "7... O-O 8. O-O Qe7": "Interesting.  I was expecting Nc6",
        "9. a4": "I try this attempt to open up the double pin with Ba3",
        "9... a6": "Here is the big mistake.  I believe black may not have realized the threat.",
        "10. Ba3": "There it is.  Attack!",
        "10... Qd8 11. Bxf8": "Wins the rook",
        "11... Qxf8": "In exchange for the bishop.  Black is still in the game but never recovers..",
        "12. Rb1": "Attack the file",
        "12... b6 13. Qc2": "freeing up the second rook and putting some pressure on h7",
        "13... Nc6": "black is developing the last of his power players",
        "14. Rfd1 Na5": "Attacks the bishop",
        "15. Bd3": "More pressure on h7",
        "15... Bd7": "Black clears the back row.",
        "16. Ng5": "Even more pressure on h7.  3 attackers and 2 defenders...",
        "16... Qe8": "Avoids an attack on the Q with the knight and potential mate",
        "17. Bxh7+ Kh8 18. Be4": "back to attack Ra8",
        "18... Bxa4": "look familiar???  Good move but I have a few options.",
        "19. Qd3": "This leads to rook exchanges",
        "19... Bxd1 20. Bxa8 Bb3 21. Be4": "even steven but white still has position and up those 2 points from the earlier rook/bishop exchange",
        "21... Nxe4 22. Qxe4": "I questioned black's willingness for this exchange as it put white in a potential mating postion.  It seeems usual to exchange players so willingly when black was behind.",
        "22... g6 23. Qe5+ Kg8 24. Qxc7": "Captures pawn and puts the Q in a position of power on the 7 rank",
        "24... Bc4 25. Rxb6": "white is very strong here as Rb8 threatens to capture the black Queen",
        "25... Kg7 26. Rb8": "This is a forced checkmate from this postion unless the black Q captures the attacking white rook.  Can you spot the mate if Qa4?",
        "26... Qa4": "I know the game is won at this point.  Its 3 move to mate.",
        "27. Qxf7+": "1",
        "27... Kh6 28. Rh8+": "2",
        "28... Kxg5 29. Qf4#": "3 Checkmate!"
    },
    "url": "https://gameknot.com/annotation.pl/forced-mate-see-26?gm=469",
    "gameName": "Forced Mate -  See #26",
    "players": "superglue (1507) vs. fastbnow (1471)",
    "opening": "Queen's gambit accepted (D20)"
}