{
    "moves": {
        "1. e4 c5 2. Nf3 d6": "this game took place, during the Hoogovens Tournament 1974/1975; Sosonko at that time, was one of the stronger players in the world and always a strong contender for the Dutch national title. He had fled from Russia - just like Korchnoi did not long after him - to the Netherlands; at that time a blooming place for chess players all around the world. Browne at that time, was a very strong Australian born American settled Grandmaster. To me, it makes this game a part of chess history...",
        "3. d4 cxd4": "so far, Black has been avoiding 2. ... g6; while White has been avoiding the logical 3. Bc4: in stead of cxd4, Black could also have chosen Nf6, Nc3, cxd4...",
        "4. Nxd4": "in this stage of the game, there was a lot to be won in Qxd4, Nc6, Bb5!...",
        "4... Nf6 5. Nc3 g6": "there it is...",
        "6. Be3 Bg7 7. f3 Nc6 8. Qd2 O-O": "enter, the Sicilian Dragon: Yugoslav Attack; classified as B78, for the freaks...",
        "9. Bc4": "not too favourable for White: better 0-0-0, Bd7, g4!...",
        "9... Bd7 10. O-O-O Qb8": "Sosonko is fishing in murky waters: Black has nothing... Russian style...",
        "11. Bb3 a5 12. a4 Rc8 13. Ndb5": "quiet and accurate play from Browne: White is a little bit better...",
        "13... Nb4 14. Kb1 d5": "Black plays the Holy Grail of any Sicilian - d5 - at a rather awkward moment, no doubt under pressure; in fact, Black had nothing better than Na6, or the obligatory Bxb5...",
        "15. exd5 Bxb5": "forced: among other moves, Na7 would have been very bad for Black...",
        "16. Bf4": "jumping at the Queen is a bit of a shame, Shawn: after Nxb5, Nfxd5, c3, Nxe3, Qxe3, Nc6, f4, you would have been better...",
        "16... Rxc3": "this astonishing Queen/Rook/Bishop sacrifice in one, gives Sosonko a last chance to force himself a way into Whites' position; after bxc3, Qe8!, axb5, a4!, Bc4 (Ba2, Nxa2), Qc8, Black has regained (some) control...",
        "17. Bxb8 Rxb3 18. Be5 Bd3": "worth looking at however, was Bd7, Rc1 (cxb3?, Bf5+), Bf5, g4, Nxg4, Bxg7, Ne3!, Bc3, Nexc2, Bxb4, Nd4+, Ka2, Rxb4, Rc3...",
        "19. cxd3 Nfxd5 20. Bxg7 Kxg7": "at this point, Sosonko bluntly offered a draw: with only two Knights for the Queen; Browne could not find the right move in due time, so he had no other option than to accept: understandably, under much inner turmoil; how can a Queen not win, against two Knights?",
        "21. Qc1": "this astonishing move, to be followed by Qc4 in most variations, solves all problems for White: due to the bad position of Rb3; after b5, axb5, a4, Qc4 (there it is), Nc3+, Qxc3+, Rxc3, bxc3, Nd5, Rc1, Rc8, c4!, Nf4, Kc2, Nxg2, h4!; after Nxd3, Qc4, Rxb2+ (Nc3+, Qxc3), Ka1; after Rb8 (support b5), Rd2, b5, axb5, Rxb5, Qc4 (always), Nc3+, Ka1, Nbd5, Rc1, R5b4 (Rd3b4, bxc3), bxc3, Rxc4, dxc4, Ne3, Ra2; after Nc3+, just Qxc3... after Nb6 (Timman), Rd2, Rc8, Qd1, Rcc3, Qe2; after Ra6 (threatening Rc6), Qc4!, Nc3+ (Rc6, Qxb3), Qxc3+...",
        "21... Rd8": "leaving only this: the only variation left, in which Qc4 is no real option...",
        "22. Rd2": "Qc4, Nc3+, Qxc3+, Rxc3, bxc3, Nd5!...",
        "22... Nc6": "Nc3+, Ka1...",
        "23. Qc5": "ending all opportunities for Black: could it have been, that this chess enthusiast from Emmeloord owned the first chess computer ever?"
    },
    "url": "https://gameknot.com/annotation.pl/forced-draw-from-the-sicilian-dragon-or-not?gm=63631",
    "gameName": "Forced draw, from the Sicilian Dragon. Or not?",
    "players": "Walter Shawn Browne  vs. Gennady Sosonko ",
    "opening": "Sicilian (B75), dragon, Yugoslav attack"
}