{
    "moves": {
        "1. e4 e5": "My favorite kinds of openings come from the King's Pawn games.",
        "2. d4": "My friend, Clark showed me this opening and its ferocious power. It is the unusually played Center Game.",
        "2... Qh4": "My opponent, I don't think, knows this opening and decides to attack my e4 pawn and threaten the four move mate, but I will hold him at bay.",
        "3. Nf3": "I play the wrong Knight for sure because I could have used this move's purpose at a later time. 3.Nc3 exd4 4.Qxd4 and the game is equal.",
        "3... Qxe4+": "I try plotting to get my pawn back while I'm being vibrated with these checks.",
        "4. Be3": "This move and 4.Be2 are equal, but I start getting concerned about the future of my d-pawn.",
        "4... Bb4+ 5. c3": "I have other uses for the Knight besides getting pinned by the Bishop.",
        "5... Be7": "Now, I get my pawn back because he showed too much aggression.",
        "6. Nxe5 Qf5": "I just about had it with his Queen invading my position, so I attempt to ward him away. ",
        "7. Bd3 Qe6": "Now that I hindered his developement, I can now finish mine.",
        "8. Qf3": "After moving there, I start thinking about 8.Nd2 instead.",
        "8... Nh6": "Inaccurate. If I were Black, I would have played 8...Nf6, or Nc6.",
        "9. Bxh6": "Inaccurate. Better was either a developing move (preferrably 9.Nd2), or castling.",
        "9... f6": "I guess he wants me to win an extra point and get chased, but that's fair enough, right?",
        "10. Qh5+": "Inaccurate. 10.Bxg7 was the only average move I had. The rest (except this move) are mistakes.",
        "10... g6 11. Bxg6+": "A reasonable move that could lose points.",
        "11... Kd8": "11.Bf7 and Black better abandon his Kingside and give it his farewell.",
        "12. Bf7 Qd6 13. Bg7 fxe5": "Forget about that pawn for now. I will rob Black of his Rook first.",
        "14. Bxh8 c5": "Now, I'll rob his weak pawn.",
        "15. Bxe5 Qa6": "I don't care if I don't castle. Black already has a growing fear: checkmate.",
        "16. c4": "I feel the desire to castle, but I don't feel too much fo the need for castling, but I'll do it anyway.",
        "16... Qa5+": "I will start making a wish, \"I wish to capture Black's Queen.\"",
        "17. Nc3": "Here's my plan: Castling, then Nd5.",
        "17... Nc6 18. O-O d6 19. Rfd1": "Forget about Nd5! Plan B is to encourage him to rob my Bishop so that I can check him for the rest of the game until his end.",
        "19... dxe5": "He falls for it.",
        "20. dxe5+ Kc7": "What was wrong with Nd4? Use your resources.",
        "21. Nd5+ Kd7": "Qf5 wouldn't hurt me hopoefully.",
        "22. Nxe7+": "I possibly could have done a different move, but I don't see that \"different move\".",
        "22... Kxe7 23. Bd5": "I felt like having my Queen take my Bishop's place, which should explain why I move there. At the same time, I saw Bg8 as a better move.",
        "23... Nb4": "Mate in three, unless otherwise.",
        "24. Qf7+": "Move #1.",
        "24... Kd8": "Never mind the \"unless otherwise\" part because that's a total lie, especially when I say that this was a forced move.",
        "25. Bc6+": "Discovered check with mate to follow.",
        "25... Bd7": "The \"unless otherwise\" part applies if I take the Bishop with the Rook or the Bishop, but I don't want to go there.",
        "26. Qxd7#": "That's the game. Black's critical mistakes began when he unnecessarily checked me with the Bishop. Then when his Queen was doing nothing on a5, he could have moved it in the sense that something bad was going to happen. Also,the openings are always on proper development (well, almost always), and use what you have even if you are down material. Finally, when you're down material, you are forced to defend your position. What you do in the opening will affect you in the mid-game; what you do in the mid-game will affect you in the endgame and what you do then will affect the results. Chess is a colossal chain reaction and you better be careful about your moves. This is why you need to look at your move before comfirming it."
    },
    "url": "https://gameknot.com/annotation.pl/forgotten-histories?gm=42932",
    "gameName": "Forgotten Histories",
    "players": "chesskingdom64 (1021) vs. lindaj (926)",
    "opening": "Centre game (C21)"
}