{
    "moves": {
        "1. e4 Nc6": "Team match, I am playing black. Tired of the Sicilian, I try something new. The Nimzovich. New to me, anyway. Interesting note: Apparently GameKnot changed some things in the Game Annotation Screen. The old link at the bottom of the window to edit the title is gone and there is a new link at the top of the window to replace it. Also, until today, the ratings of the players displayed their ratings at the start of the game (1506 for white, 1504 for me) but today it displays our current ratings (1448 for white, 1706 for me) - I liked the old way so I edited it back to the initial ratings.",
        "2. Nf3 e5": "Hmmm, now it's just becoming an Italian, or Spanish, with a wierd move order.",
        "3. a3 Nf6": "3. a3 seems to be just wasting time, so I'll develop with an attack on e4.",
        "4. Nc3 d5": "We have transposed into a Gunsberg Variation of the Four Knights Defense, and with 4. ... d5, the opening should equalize quite nicely for black.",
        "5. d3 dxe4 6. Nxe4 Bf5": "Developing with pressure in the center.",
        "7. Nxf6+ Qxf6": "White made 3 almost consecutive moves with the queen's knight, losing tempo, and combined with the 3. a3 waiting move, white has fallen behind in development.",
        "8. h3 Bc5 9. g4 Be6": "Not 9. ... Bg6 where the bishop will be glaring at the white pawn on d3 for some time to come. On e6, however, he has options to play to either side as needed.",
        "10. Bg5 Qg6": "Scared me for a minute when I thought 11. Nh4 would win my queen, until I realized that would leave no defenders on the white bishop at g5. Still, it got my heart racing a for a moment.",
        "11. Bh4 Bd5": "11. Bh4 seems an odd choice. It doesn't have much scope on h4 that it didn't already have on g5, and white saved me a tempo by not having to advance a pawn to chase the bishop off of g5. I respond by pinning the white knight on f3 to the rook on h1.",
        "12. c4 Bxf3 13. Qxf3 O-O": "Not sure why I traded for the knight, other than I didn't want to retreat the bishop. Now white has the bishop pair.",
        "14. Be2 Nd4": "White gave me the obvious fork, so I take it. The move attacks the white queen and, thanks to 14. Be2?, she cannot get back to defend c2. So the real fork here is the queen on f3 and the fork on c2 - black is forking the fork. As a result, 14. ... Nd4! will win black the exchange.",
        "15. Qd5 Nc2+": "White threatens the black bishop on c5, but he is very well defended.",
        "16. Kd2 Nxa1": "Winning the exchange, as promised. Now if white plays 17. Qxc5??, black responds with 17. ... Nb3+ and 18. ... Nxc5 winning the white queen.",
        "17. Rxa1 Qb6": "Eyeballing the fork of king and rook with 18. ... Qxb2. If white protects b2 by playing 18. Qxe5, black responds with 18. ... Bd4, blocking the queen's defense and attacking the queen. White cannot both save the queen and prevent the fork. ",
        "18. b4 Bxf2": "Time to trade down a bit of material.",
        "19. Bxf2 Qxf2": "White shouldn't play 20. Qxe5? because black's response would be Ra8e8, skewering the white queen to her bishop on e2.",
        "20. Qxb7 Qd4 21. Rf1 Qb2+": "A little fork. No big deal, yet, since white's going to capture a pawn too. But he won't capture as many as black will.",
        "22. Ke3 Qxa3 23. Qxc7 Rac8": "What fun, now blakc gets two pawns for one. I am expecting white to take the black pawn on e5.",
        "24. Qe7 Rxc4": "Instead, white defends his pawn on b4. That's OK, white wasn't going to capture that one first anyway. Since the pawn on d3 is pinned to the king, the black rook can safely capture on c4, putting a double threat on b4.",
        "25. Kd2 Qxb4+": "White broke the pin, and black gobbled the b4 pawn, creating a passed pawn for black on the a-file. 25. Qxb4+! is much better than the passive 25. Rxb4 since it gives black a royal fork (forking the white king and queen). This forces white to trade queens with 26. Qxb4 Rxb4, leaving black ahead by the exchange and two pawns, with a passed pawn for black on a7 and an isolated pawn for white on d3. At this point, black can coast in for an easy endgame, but white failed to respond before the 3-day time limit expired, so black won due to time out. The white player had less than 1/2 of 1% of all his games end due to time out, so I assume the time out wasn't deliberate."
    },
    "url": "https://gameknot.com/annotation.pl/forking-the-fork?gm=22323",
    "gameName": "Forking the Fork",
    "players": "bukopie (1506) vs. blake84120 (1504)",
    "opening": "KP (B00), Nimzovich defence"
}