{
    "moves": {
        "1. e4": "My standard opening move.",
        "1... e5": "Having played jkedzie before (and if you look at her profile), she 'always' plays 1...c5. She knows my opening moves and I'm happy to play them for a second chance to see if I can play my opening better against her.",
        "2. Nf3 Nc6 3. Nc3": "I'm used to seeing 3. Bb5, 3. Bc4 or 3. d4 here.",
        "3... Nf6": "All four knights are out!",
        "4. Nxe5": "The Halloween Gambit - I'm not sure how it gets the name, but I find it really scary.",
        "4... Nxe5": "Yay, I'm winning!?",
        "5. d4": "Pushing back the knight and giving White the initiative to attack.",
        "5... Ng6 6. e5": "More pressure on my knight... and a critical juncture in the game. ",
        "6... Bb4": "The obvious move is 6... Ng8 but having played my opponent several times before, I didn't like the idea of giving her time, space and the lead in development. My original thinking is that I can give up the knight to have three pieces active on the board.",
        "7. exf6": "White happily accepts his piece back.",
        "7... Qxf6 8. Bd3": "In my previous game, these double bishops turn out to cause me a massive amount of trouble. ",
        "8... d5": "Trying to get a grip on the centre and open up a line for my LSB. Maybe I could have pinched the pawn...",
        "9. a3": "Forcing the bishop to do something.",
        "9... Bxc3+": "9... Bd6 could be considered, I suppose, but Black gives up a pawn and gives up nice squares for the knight to operate in.",
        "10. bxc3": "This is a problem for Black - not only does he have to contend with a double bishops but this half-open b-file causes him too many problems. ",
        "10... Nh4": "Black's third problem in this opening is the lack of co-ordination of his pieces. This is an attempt to co-ordinate my pieces and, honestly, Nf4 looks much better for that now.",
        "11. O-O": "Protecting the weak pawn at g2 and taking his king to safety - I should have taken note.",
        "11... Bf5": "Trying to dispose of those nasty double bishops view on my king-side.",
        "12. Qh5": "Could probably have played 12. O-O but thought I was safe to play 12. Bxd3. I missed the weakness at...",
        "12... Bxd3 13. Re1+ Be4 14. Qxd5": "d5! Now I'm in a lot of trouble. My pieces are in a horrible state and it'll only get worse!",
        "14... O-O": "Too late. Far too late.",
        "15. Qxe4": "Recovering the lost piece and returning with an extra pawn.",
        "15... c6": "Trying to defend the pawn at b7. 15. b6 was possibly better, considering the half-open b-file.",
        "16. Rb1 b5": "Trying to protect my pawns from further losses.",
        "17. a4 Nf5": "Threatening 18. axb5 cxb5 19. Rxb5 Nd6.",
        "18. Ba3 Rfc8": "Forcing the rook to move and making my king look even lonelier.",
        "19. g4": "Moving the knight before grabbing the pawn at b5.",
        "19... Nd6": "Attacking the queen at e4 and defending b5 momentarily...",
        "20. Bxd6 Qxd6 21. axb5 Rab8": "A terrible move due to my weak back rank. I'm trying to challenge for the rank that will soon be open as the pawn is lost anyway, but it turns out to be really bad.",
        "22. bxc6": "If 22... Rxb1, then 23. Rxb1 Qxc6 24. Qxc6 Rxc6 25. Rb8#. Many other lines that result in the same thing.",
        "22... f5": "I can't even remember why I played this.... desperation?!",
        "23. gxf5 Rxb1 24. Rxb1 Qxc6": "Recovering the pawn I sacrificed at f5.",
        "25. Qe6+ Kf8": "I'm three pawns down and I'm going to need to keep my pieces, and 25... Kh8 26. Qxc6 Rxc6 27. Rb8+ Rc8 28. Rxc8#.",
        "26. d5 Qc4": "Trying to threaten a draw by perpetual check.",
        "27. f6": "Revealing the g4 square to the White queen's protection.",
        "27... gxf6 28. Rb7": "All lines lead to forced mate or white going a queen up. This is a wonderful example of how not to play the Halloween Gambit. The bad opening, combined with bad moves, led to a horrible position that White capitalised on very well."
    },
    "url": "https://gameknot.com/annotation.pl/four-knights-halloween-gambit?gm=39893",
    "gameName": "Four Knights - Halloween Gambit",
    "players": "jkedzie (2003) vs. gcah2006 (1696)",
    "opening": "Four knights (C46), Schultze-Mueller gambit"
}