{
    "moves": {
        "1. e4": "This is my 100th annotation, and it's a wild one. A mini-tournament game, I'm playing white. I recently annotated a game titled \"Three Sacrifices\" on 3/30/09 in which I won in 30 moves as white, making three sacrifices to win the game. So I felt the need to upstage my own annotation. Here, white wins in 21 moves, with four sacrifices.",
        "1... c6 2. c4": "English Variation, aka the Accelerated Panov-Botvinnik Variation.",
        "2... d5 3. cxd5": "Evidently, this was a mistake, according to my opening analysis. White should play 3. exd5 and 4. d4 to reach the Panov Attack. I have no analysis that supports 3. cxd5.",
        "3... cxd5 4. exd5": "Isolated doubled pawns by the 4th move. That's planning ahead...",
        "4... Nf6 5. Nc3 Nxd5 6. Nf3": "Black courteously solved the issue of white's doubled pawns, but white is still saddled with an isolated pawn on the half-open d-file.",
        "6... Nc6 7. Bc4 Nb6 8. Bb3 e5 9. O-O": "Developing. The calm before the storm.",
        "9... Bd6 10. d4": "The d2 pawn is in the way, so let's move it with tempo, since black will recapture. Sacrifice #1.",
        "10... Nxd4 11. Bg5": "Now the gloves come off! It's been peaceful until now, but the next ten moves will take us through the middlegame in a whirlwind of exchanges culminated by a short king hunt and a checkmate in what, on move 21, will almost look more like an endgame finish than a middlegame. Sacrifice #2 (that poor bishop is already doomed on g5).",
        "11... Nxf3+ 12. Qxf3": "Black captured on f3 giving check, removing the only defender of the DSB out on g5.",
        "12... Qxg5 13. Qxf7+": "Evidently black thinks he can survive the upcoming wild slug fest, so he snarfed up the free bishop. Was it really free?",
        "13... Kd8 14. Ne4": "A sneaky little fork.",
        "14... Qe7 15. Nxd6": "Black seeks to exchange queens to solve his problems. White accommodates his request, capturing the bishop on d6 and equalizing material. Now if black plays 15. ... Qxf7, white replies 16. Nxf7 and wins black's rook on h8 outright (the usual tactic of moving the king and bishop off the back rank and recapturing the knight fails here thanks to white's LSB on b3 covering f7, leaving white's knight a way back out of black's bank rank).",
        "15... Rf8 16. Nxb7+": "Black saves the rook, but nothing can really save him now. He's doomed to lose material. Black's king stands on an open file, but the white knight is in the way. He needs to move with check. So he does. Sacrifice #3.",
        "16... Bxb7 17. Rfd1+": "Boom. Bring on the big guns. If the black king moves away, white plays 18. Qxe7 and wins the black queen.",
        "17... Nd7 18. Rxd7+": "Another sacrifice. Nothing works here for black. If 18. ... Kxd7, 19. Rd1+ forces black's king to move away from the queen, and 20. Qxe7 wins black's queen. Sacrifice #4.",
        "18... Qxd7 19. Qxf8+": "Gets the rook back, with check. 19. ... Qe8 loses to 20. Rd1+ Kc7 21. Qd6+ Kc8 22. Be6+ Qxe6 23. Qxe6+ Kc7 24. Qd6+ Kc8 25. Qd8# ",
        "19... Kc7 20. Rc1+": "Black is still out of choices. Blocking with the queen loses the queen for the white rook. Blocking with the bishop, 20. ... Bc6, allows white to play 21. Qxa8 and win with a crushing material advantage, but this was black's best alternative.",
        "20... Kb6 21. Qc5+": "Black chose to save the rook and flee, but this walks right into a checkmate in 3. White announced the mate and entered the conditional moves after 21. Qc5+ (21. ... Ka6 22. Bc4+ Qb5 23. Qxb5#) but black resigned after the first move. Stay tuned, I'm working on a 15 move game with 5 sacrifices and an 11 move game with 6 sacrifices... No, really, I am.\r\n\r\n"
    },
    "url": "https://gameknot.com/annotation.pl/four-sacrifices?gm=22895",
    "gameName": "Four Sacrifices",
    "players": "blake84120 (1839) vs. centerctrl (1769)",
    "opening": "Caro-Kann (B10), anti-anti-Caro-Kann defence"
}