{
    "moves": {
        "1. Nf3": "Hi everyone!\r\n\r\nHere is yet another awesome performance from the Master Mater against the extremely unfortunate Master Bastalex who resigned on the grounds of unavoidable mate.  My own tactical play is very hit and miss at the moment and there is much room for improvement so I hope I can spot some tactics and hidden tactics in this one.  Freddy starts off with the Reti Opening where he brings his knight out to f3 straight away.  This move holds back 1. ..... e4 so black usually plays d5 in this position.  The Reti usually transposes into a QP opening or even occasionally a Sicilian should black respond c5.  In this game Master Bastalex responds with d5.",
        "1... d5 2. c4": "2. c4!? - interesting move - Freddy just lurves gambits!  The purpose of this move is to divert the d5 pawn on to c4 where it can be recaptured after playing 1. e4.  Master Bastalex, however, declines the gambit and responds with c6 which has shades of the Slav Defense in the Queen's Gambit Declined.",
        "2... c6 3. e3 Nf6": "3..... Nf6 - development.",
        "4. Nc3 e6 5. d4": "5. d4 - yup, it is transposing into a Queen's Gambit Declined, Orthodox and Slav combined!",
        "5... Nbd7 6. Bd3 dxc4 7. Bxc4": "7. Bxc4 - pawn trade - note the d4 pawn prevents black from expanding by playing Nc5 or Ne5.",
        "7... b5": "7. ........ b5 - attack from the flank and preparing a possible fianchetto of his light squared bishop.",
        "8. Be2": "8. Be2 - a retreat but Freddy will think of something.  Indeed he acts on it by playing 9. e4 which gives him his desired pawn centre and opens a diagonal for his dark square bishop.",
        "8... a6 9. e4 b4 10. Na4": "10. Na4 - on the rim but probably not for long!",
        "10... Nxe4": "10. ...... Nxe4 - Master Bastalex grabs a pawn, but as grabbing pawns is not recommended in Bruce Pandolfini's Traps and Zaps, is that wise?  We shall see.",
        "11. Qc2 Ndf6": "11. ..... Ndf6 - Master Bastalex now supports his advanced steed with Nf6.  Hmm, wonder where his light square bishop is going?",
        "12. Bd3": "12. Bd3 - putting the question to that advanced knight.  Black answers with Nd6.  Note that there is a line up of WQ and white lsb on the b1-h7 diagonal.  That means a knight must remain on f6 to avoid some nasty checks on h7.",
        "12... Nd6 13. O-O Bb7": "13. ..... Bb7 - black answers my question re this bishop, he places it on b7.",
        "14. Nc5": "14. Nc5 - now Freddy gets and outpost for his knight and as that knight cannot be attacked by pawns, this one is a strong one.",
        "14... Qb6 15. Bf4": "15. Bf4 - Freddy clears the decks and develops his dark squared bishop.  I wonder where black is gonna castle?  With the queen side looking rather draughty I would hesitate to put Henry on that side, hmm, I know Freddy usually gets him in the end but why make it Easy for him!",
        "15... Nd5 16. Bg3": "16. Bg3 - Freddy's dsb sidesteps the black knight.  Interestingly enough, white is in a position to play Bxh7 after black responds with Nb5 but it is not a good move, can you the jury see why?",
        "16... Nb5 17. Be5": "17. Be5 - Freddy's pieces take up more aggressive posts, although I suppose black could play f6 here (I wonder why not?), but it is his knight that goes to f6 and not the pawn.",
        "17... Nf6 18. Rfc1 Rc8 19. Qb3 Nd5": "19. ....... Nd5 - interesting, the knight goes back to d5.",
        "20. a4 Nd6": "20. ....... Nd6 - I wonder why he did not play bxa3 e.p?",
        "21. Ng5": "21. Ng5 - hits at the vulnerable f7 square, although at the moment Freddy cannot yet swing his queen over to the kingside.  Now comes a crazy passage of play.",
        "21... h6 22. Ngxe6 fxe6": "22. .... fxe6 - black accepts the sacrifice but now Freddy shows the point of it by bringing his bishop over to g6 with check.  Black now loses the right to castle.  That e6 pawn looks really vulnerable to a move like Nxe6.",
        "23. Bg6+ Kd8 24. a5 Qa7": "24. ...... Qa7 - Black's queen takes on a Glenda-like (defensive!) position.  For the benefit of any new members of the Inquest Jury, my king is called Henry and my queen is called Glenda and my bishops are called Fou Leblanc and Fou Lenoir because of the light and dark squares they stand on!  Anyhow, back to Freddy's game, that vulnerable e6 pawn now drops off.  Although Freddy is a whole piece down he has an overwhelming position. ",
        "25. Nxe6+ Kd7 26. Qh3": "26. Qh3 - at last Freddy's queen goes to the kingside with devastating effect.  Just for starties Freddy is threatening a nasty discovered check with his knight.  Black completes his development, on Move 26 would you believe, but it will avail him naught.",
        "26... Be7 27. Rc5 Ba8 28. Rac1": "28. Rac1 - here come the rooks, carrion methinks!",
        "28... Nf6 29. d5": "29. d5 - pawn stab, those carrion are espying a nice tasty dinner.  Freddy hangs fire on that discovery though.",
        "29... Nxd5 30. Rxd5 cxd5 31. Ng5+": "31. Ng5+ - now comes the discovery.",
        "31... Kd8 32. Nf7+": "32. Nf7+ - here Master Bastalex waves the white flag despite being 5 whole material points up, why, well here is Variation A.  32. Nf7+ Nxf7 33. Rxc8#.  Now for Variation B.  32. Nf7+ Ke8 \r\n33. Nxd6+ Kf8 \r\n34. Qxc8+ Bd8 \r\n35. Qxd8# .   And here is Variation C - 32. Nf7+ Ke8 \r\n33. Nxd6+ Kd8 \r\n34. Rxc8# \r\n\r\nSo, for the second time Master Bastalex, because of his esteemed Master Status has been allowed to avoid being Freddied by resignation, lucky him.  Anyhow, well played Freddy!\r\n \r\n",
        "32... Ke8 33. Nxd6+ Kd8 34. Rxc8#": ""
    },
    "url": "https://gameknot.com/annotation.pl/freddy-does-it-again?gm=28920",
    "gameName": "Freddy does it again!",
    "players": "easy19 (2269) vs. bastalex (2137)",
    "opening": "Reti opening (A09)"
}