{
    "moves": {
        "1. e4": "I play e4 pretty much exclusively as it fits my style of play (aggressive, attacking).  Certainly there are many good first moves for white.  Players of e4 must be prepared to face a very wide array of black responses including the standard e5 and it's ensuing variations, as well as the Sicilian (tons of lines!), the French, Scandinavian, etc.",
        "1... e5": "A very common response to 1. e4 leading to some of the most popular openings among GMs today including Petroff and Ruy Lopez to name two.",
        "2. Nf3": "Natural play, developing and attacking the pawn.",
        "2... Nc6": "Again, natural play.",
        "3. Bc4": "More common moves are Nc3 and Bb5 (Ruy Lopez or Spanish).  I typically play Bc4 because it fits my aggressive playing style and can lead to many gambit lines.  I find opponents at my level are often less familiar with how to proceed facing this move than the other two.",
        "3... Nf6": "The natural move, reaching the Two Knights Defense.",
        "4. O-O": "There are many available moves here such as Nc3 and d3 which are solid but a bit too stodgy for my personal style.  The move I played appears to lose a pawn, but after Nxe4 black can not actual retain the pawn advantage.  White can play 5. Re1 or 5. Bd5 and regain the pawn in short order.  One of the reasons I play O-O is to give black the chance to play Bb5, a common move that leads to variations I enjoy playing (such as the Max Lange attack).  Other move options include 4. d4!? which is the original Max Lange gambit, and of course 4. Ng5 for the the infamous Fried Liver Attack!  Perhaps Hurnavich would disagree, but personally I think that the Fried Liver is a great opening for beginning and intermediate players to look at because it helps develop tactical thinking and an understanding of mating attacks.  One thing is sure, you will face it sooner or later as black if you play the Two Knights!",
        "4... Nxe4 5. Bd5": "The most direct move to regain the pawn.  Re1 also effective.",
        "5... Nf6": "Retreating to f6 is the best move.",
        "6. Bxc6": "Bxc6 ensures that white will recoup the pawn.",
        "6... dxc6": "I have had opponents play bxc6, but I feel dxc6 is better.  It gives both the queen and the light-squared bishop more scope on the board.",
        "7. Nxe5": "Nxe5 capturing the pawn.  Assessing this position, I would have to say white has not accomplished anything significant from the opening.  White is not worse but certainly not better.  Perhaps the 4. Nc3 line suggested by Iansky is more promising.",
        "7... Bd6": "Definitely the strongest and most natural continuation.",
        "8. d4": "Defends the knight and allows for the development of the dark bishop.  Re1 would be premature, as after BxN RxB white has a misplaced rook that will have to be moved again; meanwhile his other minor pieces are sitting on the back rank.",
        "8... O-O": "Castling is certainly a reasonable move here.  BxN is playable but it is to black's advantage to hang on to the bishop pair.",
        "9. Bg5": "Develops a piece and creates and pins the knight.  White is fantasizing about playing Qf3 and then Nd2 and Ne4.  Of course there are a lot of moves on black's part, but that is the working plan.",
        "9... Be7": "This move does break the pin, but I prefer it's prior position on d6 eying the h2 square.  It does thwart the plan of Qf3 etc for white.  I think better would have been to continue development with Be6 or to challenge the bishop with h6.",
        "10. Nc3": "White develops his last piece putting pressure on d5 and e4.  White will be looking next to centralize the queen with a move such as Qd3 followed by bringing the rooks to the central files.",
        "10... h6 11. Bh4 Be6": "Good move, completing development and placing the bishop on an active square.",
        "12. Qd3": "Centralizing the queen and connecting the rooks.",
        "12... Nd5": "Places knight on a good post but does give white the option of eliminating black's bishop pair.  It's hard to suggest a significantly better move.  Perhaps Re1 placing the rook on an open file (no pawns).",
        "13. Bxe7 Nxe7": "I think capturing with the queen would be better, as this retreats the knight to a less active square.  Also capturing with the queen would connect the rook and get the queen out of the way to bring them into the center as needed.",
        "14. Rfe1 Nd5": "Knight returns to it's better post.  I think this is the best move, but it emphasizes black's loss of time in capturing with the N on the previous move.",
        "15. Ne4": "White is not anxious to trade down pieces further since that would lead fairly quickly to a drawn position.  This move puts the N on a very active central square and moves it closer to the enemy king.",
        "15... Bf5 16. Qg3 Bxe4": "Black elects to trade down further which is probably fine.  Black will have to be careful that white does not mount too much pressure on his king-side, however.",
        "17. Rxe4 Nf6": "This move attacks the R and brings a piece closer to the king to aid in defense.  Just to note that this knight has now made a circuit from f6-d5-e7-d5-f6.  That is a lot of moves for one piece, and as a result black still has queen and rook in starting position while white has queen and rook active.",
        "18. Rh4": "Threatening Rxh6 and generally threatening mayhem on black's king-side.  White has to keep in mind the black queen x-raying the rook through the black night, but there is no danger in that regard at present. ",
        "18... Kh7": "The best and I think only good move to deal with Rh4.",
        "19. Re1": "Activating the final piece in white's arsenal.  White will be looking to increase pressure on black's king.",
        "19... g5": "While a move like this is tempting to pressure the rook, it doesn't turn out well for black.  Black had a fairly safe king-side structure prior to this move, and dramatic pawn moves in front of the king should only be made with very careful consideration.  In this case, the problem for black is that the pawn on h6 is pinned by white's rook, so although the pawn advanced to g5 appears to be guarded it in fact is not.  Black needed to look for ways to get his queen and a8 rook into the game.",
        "20. Qxg5": "Serious trouble now for black, with white threatening Rxh6# next move.",
        "20... Ng8 21. Qf5+ Kg7 22. Rg4+ Kh8 23. Nxf7+ Rxf7 24. Qxf7 Qf6": "Qf8 would have held temporarily.",
        "25. Rxg8+": "Removing the defender of the queen with check.  Removing the defender of a piece is always worth investigating.  In this case the result is crushing."
    },
    "url": "https://gameknot.com/annotation.pl/freedom-team-training?gm=36912",
    "gameName": "Freedom Team Training",
    "players": "sarajevoking (1834) vs. paulguay (1400)",
    "opening": "Giuoco piano (C55), Rosentreter variation"
}