{
    "moves": {
        "1. e4 e6": "The French defence.  Not an opening I play often and, as will become apparent, with good reason.  ",
        "2. d4 d5 3. Nc3 Nf6": "The Classical Variation.    ",
        "4. Bg5 Be7": "The Burn Variation (4...dxe5) is probably more popular.  Here, I played 4...Be7 simply to break the pin on Black's queen.  ",
        "5. e5": "Perhaps this is why the Burn Variation is more popular!  Here, this move leads to the exchange of Black's \"good\" bishop.    \r\n",
        "5... Nfd7 6. Bxe7 Qxe7 7. f4": "An unexpected move.  White tries to bolster his centre, but perhaps it would be better to develop his minor pieces.      ",
        "7... c5": "I played this move quickly, aiming to undermine e4. I was expecting the standard 8. Nf3  Nc6, which looks good for Black due to the pressure on the centre and the lack of a supporting pawn on c3.  However, 7...c5 is actually a bad positional blunder, which White quickly exploits.   \r\n\r\n",
        "8. Nb5": "All of sudden, it's clear that Black is being embarrassed.  White now threatens either 9.Nc7+ (winning the rook on a8) or Nd6+ (preventing Black from castling and creating a monster of a knight).  A difficult choice and, even at this early stage, I thought about resigning.   \r\n",
        "8... O-O": "Deciding to play on and accept the loss of material.  Although the rook is doomed, I hoped to compensate by generate counter-play in the centre.  At worst I thought that I would be the exchange down with a playable position.   \r\n",
        "9. Nc7 Nc6 10. Nxa8 Nxd4": "A rook down, but now Black has some initiative in the centre.    \r\n",
        "11. Nh3": "A strange move from White.  11. Nf3 seems more logical, challenging Black's knight on d4, and after 11...Nxf3 12. Qxf3 White is fine.  Perhaps my opponent had in mind the manoeuvre Nh3-f2, but, as they say, \"a knight on the rim is dim\".   ",
        "11... f6": "Trying to open the f-file by playing for 12...fxe5, when the recapture 13. fxe5 allows Black's rook to blast down the f-file.  If 13. fxf6, then Black can play 13..Nxf6 followed by 14...d5.       \r\n\r\n",
        "12. c3": "First kicking the knight.  ",
        "12... Nc6 13. exf6": "White attempts to block the f-file, but now weakens his central grip. ",
        "13... Nxf6 14. Bd3": "Preparing to castle.  ",
        "14... e5": "A key move for Black.  Now if 15. 0-0, then 15...Bxh3 leaves White with doubled h-pawns and an exposed king.   The alternative, 15. fxe5 is no better, since 15...Nxe5 threatens capturing the bishop on d3 with discovered check.  \r\n",
        "15. f5": "White attempts to prevent an exchange on h3, but now allows Black's e-pawn to advance.  ",
        "15... e4": "I was starting to like my position.  Although a rook down, I had a good lead in development and a strong central attack.  After White's pawn on f5 dropped I could renew my threat of Bxh3 and perhaps have a go at White's king.  ",
        "16. Bb5 Bxf5 17. Qa4": "Preparing to castle queen-side.  \r\n\r\n",
        "17... Ne5": "I thought a while before playing this move.  The simple 17...Rxa8 allows 18. Bxc6 bxc6 19. Qxc6, with no clear benefit to Black.  17...Ne5 allows 18. Qxa7, saving the Knight on a8, but risking 18...Nxd3+.  ",
        "18. Qxa7": "In my view, a mistake.  White attempts to hold onto his knight at the expense of protecting his king.  18. 0-0-0 would have been better.  ",
        "18... Nd3+": "Now White's king is feeling the heat.  If 19. Bxd3 exd3+ followed by 20...Qe2+ is very dangerous.  \r\n\r\n",
        "19. Kf1": "Not sure if this was the best square, but 19. Kd1 allows 19...Bxh3 20. gxh3 Nf2+ winning back material with advantage (if 20 Bxd3 then 20...exf3+ threatens Qe2+ mating).  19. Kd2 provokes 19..e3+, but this may be best.  ",
        "19... Bxh3": "Clearing the f-file and taking out White's only defender. ",
        "20. gxh3 Ng4+": "Things are looking grim for White.  Suddenly his king is looking very exposed...",
        "21. Kg1": "If 21. Ke2, then 21...Rf2+ 22. Kd1 Ne3 mate.  \r\n\r\n",
        "21... Ne3": "Trapping the White king and threatening Qg5 mate.  There is nothing White can do to prevent this and so here he resigned.  A swindle perhaps?  Possibly, but a good example of how the French can be dangerous (to both sides!).  I don't expect 7...c5 will catch on, but it certainly led to an exciting game.     "
    },
    "url": "https://gameknot.com/annotation.pl/french-fancy?gm=27355",
    "gameName": "French fancy",
    "players": "robert13 (1921) vs. prcpower (1578)",
    "opening": "French (C14), classical, Steinitz variation"
}