{
    "moves": {
        "1. e4": "This game is from a Mini tournament, I do not typically \"choose\" to play the French Defence. Playing as white I do encounter it enough to know that I want to play for black having an isolated pawn on d5. Let's see what breaks first.",
        "1... e6 2. d4 d5": "Opening possition from the tourney.",
        "3. Nd2": "Tarrasch",
        "3... Be7": "He might not play a typical line like: 3...Nf6 4.e5, Nf-d7... (or 3...c5 4.Ng-f3,a6...), but it could transpose.",
        "4. Ngf3 Nf6 5. Bd3": "5.e5 is normal in any line where black plays Nf6 early, but he will play Nf-d7, then f6 and c5, try to see that instead of black getting an isolated pawn on d5 he will get center domination in this line. Most openings where white over extends early in the opening he will be giving up the center completely soon after. Take a look at the Alekhine to see this point. ",
        "5... Nc6": "Blocking the c pawn is not normal, now I feel better. Now this will give me every good thing that could come from the Exchange Variation. ",
        "6. exd5": "Pushing the pawn would have been what I call \"not playing the possition.\" At around this time in any chess game you need to start playing against any mistake or passivity.",
        "6... exd5 7. c3": "Or 7.h3, O-O 8.O-O, a5!...\r\nI played to open up space for the queen, obvious huh? With no problem from 7....Bg4 8.Qb3 (Qa4, or Qc2) the knight is replacable with the other \"non-active\" knight. So he won't play to trade off his Bishop for that Knight. So he is wasting time with Bg4. But he played....",
        "7... Bg4 8. h3 Bh5": "Could he want to place his bishop on g67?",
        "9. O-O Qd6 10. Re1 O-O": "O-O?",
        "11. Qc2": "Hang in there. There are going to be some interesting moves coming.",
        "11... Rfe8": "He knows that I could play Ne5 and then Nd-f3. Plus, he has a good game if he gets Bf8 in.",
        "12. Ne5": "He can't take it with the knight because of dxe5. So, what is the c knight going to do?",
        "12... Nd7": "Ah, he plans to battle the knight anyway, but he overlooked hanging the pawn on h7. ",
        "13. Bxh7+ Kf8": "With Kh8 I only win a pawn and then I have to spend another tempo backing the Bishop out before g6 is played. So, it would go 13....Kh8 14.Nxd7, Qxd7 15.Bf5! with the pawns still good for me. 14.g4 would work very nicely too.",
        "14. Qf5": "When in Rome... attack romans. Attacks d-Knight twice and the Bishop on h5. Can Nf6 save both?",
        "14... Nf6": "Can't take the knight with either knight, because I take back with the pawn threatening the Queen. He would move the Queen and lose the Bishop.",
        "15. g4": "A win is forced here. If he takes the Bishop then I take the Knight and threaten mate and the bishop. If he plays 15....Bg6 he loses another pawn, which should be enough to get the win.",
        "15... g6": "This is strange, can I take that pawn and still win a pawn when it all settles? I see much more. ",
        "16. Ne4": "I haven't played such a beautiful move in over a year. 16...NxN,17. QxP   or 16....pxN or QxN or Ng8 or BxP or NxN allows mate 17.Bh6  .\r\n\r\nHe played gxQ giving me a nice Queen sacrifice win.",
        "16... gxf5 17. Bh6#": "And I hate the French!?!"
    },
    "url": "https://gameknot.com/annotation.pl/french-defence?gm=891",
    "gameName": "French Defence",
    "players": "madcapsb (1553) vs. tjbuege (1641)",
    "opening": "French (C03), Tarrasch"
}