{
    "moves": {
        "1. e4": "I played white against a stronger opponent and was probably lucky to achieve a draw, sustaining very weak pawns away from my king in a minor-piece endgame.\n\nAllow me to annotate a correspondence game for the first time, in a personal view with the help of an engine.",
        "1... e6 2. d4 d5 3. Nc3 Bb4 4. e5 c5 5. a3 Bxc3+ 6. bxc3": "As mentioned, black will gradually exploit the weakened queen-side pawns of this very usual variation. Note that they will never move again, forcing fellow pieces into comic defensive moves.",
        "6... Ne7 7. Qg4": "Main line. Queen comes out early in a modern style.",
        "7... O-O 8. Bd3 f5": "Still a common position. White rather takes en passant, giving black a half-open file while trying to expose the black king.",
        "9. exf6 e.p. Rxf6 10. Bg5 Rf7 11. Qh5": "White spends a few queen moves in order to open dark squares via 11... g6.\n\nBlack knows 11... h6 is inferior, allowing 12. Nf3! with the threat of Ne5 or even 13. Bh7+! Kxh7 14. Qxf7. If the bishop is taken, black is under too much pressure. One interesting line is 12... hxg5? 13. Nxg5 g6 14. Qh8+! Kxh8 15. Nxf7+ recovering the queen, and white wins.",
        "11... g6 12. Qd1": "Her home was indeed the better square. White has compensation for giving up the lead in development.",
        "12... Nbc6 13. Nf3 Qa5": "The black queen ties a lot of white material to the defense of weak pawns!",
        "14. Qd2 c4": "Black perfectly releases central tension, getting this bishop off the nice diagonal and making it block the half-open e-file.",
        "15. Be2 Qc7": "15... Nf5 seemed slightly better, assuming the queen on a5 disturbs white more. In fact, black could probably have reached this exact position with black to play instead of white, via previous 13... c4 14. Be2 Qc7 15. Qd2.",
        "16. O-O Bd7": "Contrary to mainstream play against the French Winawer, I preferred to leave the h-pawn untouched, afraid of failing aggression with king-side pawns. Black finishes development, preparing the queen rook to come over.",
        "17. Rfe1 Nf5": "This move allows 18. Bf4 Qa5 (back to her former action!) 19. Ng5 Rf6 20. Bg4 aiming rook, knight and bishop at black's backward pawn. White would stand slightly better, but that line wasn't chosen.",
        "18. Bf1 Raf8": "It is clear now that white has lost some position and won't scare black's backward pawn. 19. Bf4 is still possible, but not with the same effect: 19... Nd6 20. Bg3 and it seems to me that, having the g-pawn blocked, white's light-square bishop would have very few prospects.",
        "19. Ne5 Nxe5": "I tried to double rooks by exchanging knights. That plan itself won't be effective.\n\nHere I considered retaking with the pawn, settling a pawn majority on the king side and making f6 an outpost for the bishop. However, the remaining black knight can always maneuver to cover that square: 20. dxe5 Ng7 is fine for black.",
        "20. Rxe5 Nd6": "Now white really needs to guard e4, making a horrible pawn structure for the light-square bishop, which otherwise wished the f1-h3 diagonal available.",
        "21. f3 Rf7f5 22. Rae1": "This move does not much, because retaking on e5 with the rook will leave white's queen side even weaker. White should have retreated the rook or even exchanged on f5.",
        "22... Rxe5 23. Rxe5": "Mistake, as mentioned. Black can now go 23... Nf7 24. Re2 (quickly supporting c2) Qd6 and white will lose the a-pawn: 25. Qc1? is useless, overloading herself.",
        "23... Rf5": "Black misses the best line, the game is about equal.",
        "24. Qe3 Rxe5 25. Qxe5 Ne8": "The best move! Exchanging rooks was fine for white, but black now, besides watching important dark squares, offers a deadly exchange of queens. 26. Qxc7? Nxc7 and the white bishops look awful trying to defend weak pawns: 27. Bc1 Ba4 or 27. Be2 Nb5, any line will lose a pawn.",
        "26. Qe1 Qd6 27. Qb1": "Given nothing on the king side, she quickly maneuvers to her own side. Defending a3 was also possible, but I prefer the counter-attack with potential play in the file.",
        "27... b6 28. Qb4": "Incredibly loses a pawn! But this move is hard to be qualified as bad. In the game, I thought the exchange of queens would solve my structure problem. But my bishops are suddenly overloaded.\n\n28... Qxb4 29. cxb4 Nd6 threatens 30... Nb5, forking a3 and d4. White is forced into 30. Bc1 Nb5 31. Bb2 c3 (otherwise white will play 32. c3 and relax) 32. Ba1 and black can choose which pawn to take:\n\n32... Nxd4 33. Bxc3 Nxc2 34. Bb2 and black has not much to show with the extra pawn. White will eventually exchange the light-square bishop for the knight, leaving only opposite-colored bishops on the board, an easy draw.\n\n32... Nxa4 33. Bxc3 Nxc2 seems better, but the knight can't avoid being exchanged for the light-square bishop. For example, 34. Kf2 Kf7 35. Bd3 Na3 36. Ke3 Bb5 is tricky, but 37. Bb2! forces opposite-colored bishops endgame.\n\nIn conclusion, I don't see a win for black in any line.",
        "28... a5 29. Qxd6": "Exchange! I didn't mind my bishops having to hold three debile pawns. But of course I was counting on necessary forcing moves, as follows.",
        "29... Nxd6 30. Bd8 Nc8": "The white bishop ties the knight to this awkward defense, until the black king comes to drive it away. Meanwhile, I had also planned to try and move my king to the queen side, to support all three pawns at once. But that was not possible.\n\nCuriously, this is the third time that this knight sits on a different light square of the 8th rank, and all for perfect reasons.",
        "31. Be2 Ba4 32. Bd1": "This sad bishop maneuvers to defend c2.",
        "32... Kf7 33. Kf2 Ke8 34. Bg5": "White could have delayed this retreat, via 34. Bc7 Kd7 35. Bf4 and the black king is further from action.",
        "34... Nd6 35. Bc1 Nb5 36. Bb2": "Both bishops have maneuvered just in time to defend all three guardless pawns. Now I was all for keeping the black king away from my \"tall pawns\". An easy task after all.",
        "36... Ke7 37. Ke3 Kf6 38. Kf4 g5+ 39. Kg4 Kg6 40. h4 h5+ 41. Kh3 gxh4": "My opponent offered a draw, which I took since black pieces can always be there to force my bishops back to looking like pawns. White holds no prospect of queening.\n\nBlack could still be tricky after 42. Kxh4 Kf5! when white must decline the pawn or else struggle for life after the black king penetrates."
    },
    "url": "https://gameknot.com/annotation.pl/french-winawer-c18?gm=55267",
    "gameName": "French Winawer (C18)",
    "players": "drakulo (1770) vs. utopia15 (1939)",
    "opening": "French (C19), Winawer, advance, poisoned pawn variation"
}