{
    "moves": {
        "1. e4": "This is my first mini-tournament I have played on Gameknot. I wanted to choose a thematic one to try out new openings instead of my standard king pawn opening...\n\nReal play doesn't start after 6. h4",
        "1... e6 2. d4 d5 3. Nc3 Nf6 4. Bg5 Be7 5. e5 Nfd7 6. h4": "Here is the start of the theme named French defence - Alekhine-Chatard.",
        "6... Bxg5": "There is the book way and the greedy-pawn-grabber way. I choose the greedy-pawn-grabber way and got hammered badly as you will see.",
        "7. hxg5": "White retakes and opens up a lane for the rook at h-file.",
        "7... Qxg5": "Here comes the greedy queen. To my defense I must say that I choose to be greedy just to see if I could get away with it. This was the fourth game in the tournament and I had lots of more games to play so I wanted to find out if this line was any good. It's not any good ;-)",
        "8. Qd3": "White has a smart Queen. She develops with a threat. It took me a while to see Rxh7 (or to be truthful I only saw it after consulting the online DB...).",
        "8... h6": "The easiest response. But I should have considered Qg7 trying to remove whites best offensive weapon, but at the time I just whipped out the pawn.",
        "9. Nh3": "Developing with threat. Bringing another attacker on to the king side.",
        "9... Qe7": "White has four pieces developed. Three of them aimed at the king side, and can castle long at any given time. Black has two pieces barely developed and is no where close to castle to safety (i.e. queen side).",
        "10. Qg3": "Threating again and moving aside so another piece can join the attack.",
        "10... g6": "You know now how I react to threats to take my pawns. I push them, making them weaker...",
        "11. Bd3": "Look who took the queens place. The white bishop. Now white has five against two. What a bully ;-)",
        "11... Nf8": "Here I am afraid of a sac on g6 attacking the king which is still in the middle. But the text isolates my own rook at h8. This is an important feature, keep it in mind. \n\nThe text move is lousy. I know... At this point I should have given up the defense of the g-pawn and started running the other way with my king (i.e. queen side).",
        "12. Nf4": "Three guys hitting g6 and I start to get seriously worried.",
        "12... f5": "Hit back (I was thinking at the time), expecting exf e.p. and when I retake with my queen she is closer to the action.",
        "13. exf6 e.p.": "As I expected.",
        "13... Qxf6": "And now my queen acts as a defender and is not only a passive bystander.",
        "14. O-O-O": "White castles to safety and develops another piece. That half open e-file with the backward pawn looks very tempting... Black is still nowhere close castling. Any votes for a short castle? No? I didn't think so ;-)",
        "14... Nc6": "Usually you should try to move c5 before the knight, but I wanted to castle badly!",
        "15. Nb5": "White attacks the weak pawn at c7.",
        "15... Kd7": "(?) I wanted my king removed from the king side and I was protecting c7 at the same time. You have seen not so strong moves from black before, but this is the loosing move. Starkestaffans own words here was \"I was having so much pointed at blacks king so there just had to be a good move!\".\n\nScroll down for a hint:\nThere are two key squares in the position: c7 and d6. If white could get the queen to c7 he would mate in two with Qxc7  Ke8 and Nd6#.",
        "16. Nxd5": "(!!) I'll give this move two exclamation marks, it is simply brilliant! What would happen if I take the sacrifice? Please take one or two minutes and calculate the combination.\n",
        "16... Qg5+": "If I would have taken the knight with 16... exd5 I would loose my queen with 17. Qxc7+  Ke8 18. Nd6+ . Now the only way to stop a mate is QxN and then QxQ and a easy win for white.\n\nIn retrospekt 16... Qd7 might have been smarter. Or to have stayed on the other side with the king in the first place. :-)",
        "17. Qxg5": "White takes queen.",
        "17... hxg5": "Black takes queen and gives up the rook...",
        "18. Rxh8": "My poor rook, and my poor knight. The knight has nowhere to run (those damn black pawns...), and the king can't protect it...",
        "18... exd5": "I take what is given.",
        "19. Rxf8": "And so does white.",
        "19... a6": "Why don't I give up? Well you should never give up! That is the reason. You might get your opponent to stalemate you or a miracle might happen to make you draw... \n\nBut, what can I do here? My king is blocking my bishop. My bishop is pinned to my rook. My rook is blocked by the bishop. What a mess. \n\nI wanted the knight moved so I could get my king out of the way and eventually inside under the paws. A small miracle would do fine at this point :-)",
        "20. Nc3": "The knight retreats and at this point I realize two of my pawns are under attack.",
        "20... Ne7": "What a brilliant move. I protect them both ;-) Well it's just death rattles, nothing more :-)",
        "21. Re1": "White proceeds close my king in.",
        "21... Kd6": "I remember thinking at my twentieth move that I should protect d5 with my king, but realized that Rf6  would loose me a pawn. So I dismissed Kd6 at move 20, and here (only one move and ten minutes later) I am doing it... not that smart. :-)",
        "22. Rf6+": "Here comes the rook check and I expect to loose a pawn.",
        "22... Kd7": "Forced, there is no where else to go.",
        "23. Rf7": "I didn't loose a pawn. I lost a knight. At this point I resigned.\n\nBut loosing to such a nice knight move... I can live with that. :-)\n\nThanks to starkestaffan for a nice game. And I hope you (the reader) have enjoyed the game as well."
    },
    "url": "https://gameknot.com/annotation.pl/french-defence-alekhine-chatard?gm=9735",
    "gameName": "French defence - Alekhine-Chatard",
    "players": "starkestaffan (1725) vs. claespiper (1456)",
    "opening": "French (C13), Albin-Alekhine-Chatard attack"
}