{
    "moves": {
        "1. e4 e6 2. d4 c5": "Transposition in sicilian is possible.",
        "3. d5": "But white does not take",
        "3... exd5": "trading",
        "4. exd5 d6": "Black is up in developpement",
        "5. Nf3 Nf6 6. Nc3 Be7 7. Be2": "Logical moves, developping",
        "7... Bf5 8. O-O": "King in safe",
        "8... Nbd7": "Only proper place for the knight with white pawn on d5",
        "9. Re1": "The most logical move, although, playing the DSB was an option",
        "9... O-O": "Both kings are safe",
        "10. Nh4": "Knight on the h file is generally considered as bad but it attacks the LSB which has few squares available.",
        "10... Bg6 11. Nxg6": "So that black gets a double pawn and weakens his king but i'm not sure it's a very good move, for it let the center free for black.",
        "11... fxg6": "Now white's plan is to attack using the a2g8 diagonal",
        "12. Bf3": "protecting the d pawn and opening the way for the e rook",
        "12... Ne5": "Closing the way and menacing the LSB",
        "13. Bf4": "Developping and menacing the anoying e knight",
        "13... Nfd7": "To protect the e knight and menace white's DSB",
        "14. Re4": "Protecting the DSB and enabling to double the rooks on the open file.",
        "14... Bg5": "The DSB is seriously menaced and Dame Guenièvre cannot protect both bishops, so that...",
        "15. Bxe5": "I take the annoying knight.",
        "15... Nxe5": "which  reappears...",
        "16. Bg4": "To go on a safer place and menace a further Be6+ (White's plan is still to attack the king using the a2 g8 diagonal)",
        "16... Bh4": "Attacking f2",
        "17. g3": "defending. It doesn't weaken the king that much because black has no more LSB",
        "17... Bf6": "The black DSB goes back in his domain",
        "18. Qe2": "To enable 19. Re2 and protect the rook",
        "18... a6": "Preparing b5. I do not like the position : material is equal, white controls the open file but black's knight prevent movement, White's pawn structure is slighly better, the kings are safe. The center is contested but white has far less possibilities of action, particularly on the queenside. The main problem is the powerfull blak knight on e5.",
        "19. a4": "To counter black's queenside attack.",
        "19... Qa5": "With the queen so far away from her husband and feeling that the situation on the queenside will be difficult to handle and the black knight controlling many important squares, white decides energic action.",
        "20. f4": "To get rid of the anoying knight and get a strong attack, I thought it was ok to sacrifice my king safety. If necessary, Arthur can hide on h3. ",
        "20... Nxg4": "Black chooses to exchange. Beginning of a bloodbath. The board will be clearer within 3 moves.",
        "21. Qxg4": "Good place for the queen",
        "21... Bxc3 22. bxc3": "weakening the pawn structure",
        "22... Qxc3": "The black queen is dangerous but isolated, it cannot give mate.",
        "23. Qe6+": "First setting the queen on the center. A very good place to establish a camp. No pawn can annoy Dame Guenièvre, Black has no more bishops and no more knight, so that the queen will be hard to dislodge.",
        "23... Kh8": "Black could have plaid 23.Rf7, maybe better",
        "24. Rae1": "Now white is one pawn late, has a bad pawn structure, a weak king but controls the open file and the center. I estimate that the situation is equal.",
        "24... Qf6": "Defending.",
        "25. Qd7": "To menace e8, b7 and g7",
        "25... h6": "providing an escape for the king. White will have to attack along the 7 line.",
        "26. Re4e7": "menacing g7.",
        "26... Qd4+": "Of course, black can harass the poor king Arthur, unguarded in his weak castle because most of his armies are at war in foreign territories.",
        "27. Kf1 Qxd5": "Black let g7 fall, prefering to take the central pawn.",
        "28. Rxg7": "At this point the black king is in serious trouble. If 29. Rh7+ Kg8 30. Qg7 mate.\nIf the black queen stays on the a1 h 8 diagonal, it's a bit longer : 29. Rh7+ Kg8 30. Rh6 menacing mate by 31. Qh7 Black plays 30. ... Qg7 31. Qe6+  and the black queen will be lost.\n\nSo that black has to give perpetual chess to draw.\n\nHe still has 2 way to win : fork attack between the white king and the g rook and mate, using his f rook if the white king comes on the e file. \n\nBoth players have to be very carefull.",
        "28... Qc4+": "Mistake. 28. Qh1+ would have been better for...",
        "29. Re2": "... black cannot give chess (except with rook sacrifice by 29. ... Rxf4 30. gxf4 Qxf4+)",
        "29... Qd4": "aiming at g7, thus preventing the mating menace 30. h7+ Kg8 31. Qg8 mate",
        "30. Rh7+": "it seemed the most logical move with mat threat. The GK computer points it as a blunder. Rxg6 was far better.",
        "30... Kg8": "Only move",
        "31. Ree7": "Black must give perpetual chess, which may be possible in such a situation",
        "31... Qd1+": "let's go",
        "32. Re1": "I didn't find anything else to do. If the king comes on g2 to gain h3, black can bring his queen on h5. ",
        "32... Qf3+ 33. Kg1": "Black cannot harasse Arthur anylonger.",
        "33... Qc3": "The black queen goes back to her guarding postl and menaces the rook. Allanchessw proposes a draw.",
        "34. Kf1": "Draw offer sent and accepted. 34. Kf1 is a blunder. The GK computers \"sees\" a forced mate in 6 for white.\nI couldn't find it; Can you ?"
    },
    "url": "https://gameknot.com/annotation.pl/french-w?gm=52330",
    "gameName": "French (w)",
    "players": "ptitroque (1763) vs. allanchessw (1747)",
    "opening": "French defence (C00)"
}