{
    "moves": {
        "1. e4": "I don't normally play 1.e4, and doing so was one of the most interesting experiences of this French mini-tournament. This game is imperfect like so many of mine, but it was a good slugfest. Analysing it was interesting and I was surprised at the depth of some of the variations.",
        "1... e6 2. d4 d5 3. Nd2": "I experimented with this and the advance variation. I think 3.e5 is too primitive. With the Tarrasch, white aims for positional pressure. Whilst it will never refute the French, it causes headaches for French players as if Black isn't careful he will find himself in a joyless position.",
        "3... c5": "The most principled reply, aiming to liquidate the centre.",
        "4. exd5": "4.Ngf3 is the other main move.",
        "4... exd5": "!? Nowadays 4...Qxd5 is the main line with Watson analysing this in some depth in Play the French. The move played accepts an isolated pawn in return for free and easy development. Uhlman won some terrific games with this line, but I think with best play, Black has a lifeless and dull position.",
        "5. Bb5+ Nc6": "5...Bd7 is the other main move after which 6.Qe2  gives white a pleasant position.",
        "6. Ngf3 Nf6": "? - Apparently this is a mistake. Black needs to keep the option of ...ng8-e7 open  so ...Bd6 was better, despite the potential loss of tempo.",
        "7. O-O Be7": "!? I am not sure about this as white gains a tempo for his development. However, I think making it tell is another story: 7...Be6 keeping the e-file closed is an alternative.",
        "8. dxc5 Bxc5 9. Nb3": "White exploits the tempo to develop his knight. We now have a standard French defence isolated queen pawn position (IQP) position. White has more space, but black is sound and has harmonious piece development and often targets the white king whereas white plays to create a second weakness on the king-side. The person who understands the nuances of IQP positions will fare best.\n\nHowever I think the open e-file (rather than white having a pawn at e3 or e2 in Queens Gambit positions with IQPs which black can target)  means that if white can securely blockade the d-pawn he should be better. Korchnoi and Uhlmann are experts on the black side, Karpov on the white.",
        "9... Be7": "I am unsure about what follows and think the play could be improved on by both sides. 9...Qb6 is the theoretical move, but after 10.Qe2  Ne4 11.c4, Black is toiling as the exchange on d5 will force concessions.",
        "10. Ne5": "!? I thought about 10.Nbd4, but I wanted to get the two bishops by forcing 10...Bd7",
        "10... Qc7": "?! I think after 11.Nd4 white is clearly better. However, I thought I had a winning position and went for it with...",
        "11. Bf4": "? This has a tactical flaw which with correct play creates a material imbalance with unclear play. 11. Nbd4 would have given white a clear plus: the IQP would be securely blockaded and white would have more space and a lead in development.",
        "11... Bd6 12. Nxc6 bxc6": "!? After 12...Bxf4 13.Nxa7  Kf8 14. Nxc8 Bxh2  15.Kh1 Be5 16.c3 Qxc8 17.Re1 Bd6 white has a slight plus based on his superior pawn structure, but his drafty king will make him nervous, especially in the event of a well-timed ...h5-h4-h3 push. Whether 12...bc6 is correct or not depends on the assessment of the resulting material imbalance arising from two pieces versus a rook and pawn.",
        "13. Re1+ Be6": "Blocking the e-file is perfectly logical.\n\n13...Kf8 14. Bxd6  Qxd6 15. Bd3 Ng4 16. g3 Qh6 17.h4 Qf6 18.Qe2 g6 19.f3 Nh6 20. Qe5 and after the queen exchange, white is for choice, but with reduced material it will be a hard task to win, especially if black can keep the rooks on.",
        "14. Nd4": "! The point being 14...cb5?? 15.Nxe6 fe6 16. Rxe6  Kf7 17.Bxd6 with 18. Re7  to follow and Black's king is too exposed to live.",
        "14... Bxf4 15. Bxc6+ Ke7 16. Bxa8 Rxa8": "I originally thought 16...Bxh2  was better but the problem is that after 17.Kh1 Rxa8 18.g3 Bxg3? 19. fg Qxg3? 20.Nf5  win the queen.\n\nNow we have a rook and a pawn versus two bishops. If white can activate his rooks he will be not worse but black's pieces are all very active.",
        "17. g3 Bd6 18. c4": "? After 18.Nb5 white eliminates the two bishops. 18...Qc4 19.Nxd6 Kxd6 20.b3 Qc3 21. Re3 Qb2 22. a4 Kc7 23. Rb1 Qa2 24.Qc1 d4 25. Rd3 and white will win the queen is a rather fantastic if unlikely variation. 18...Qc5 and neither side has anything better than the draw by repetition via 19.Nd4 as 19.Nxd6 Qxd6 gives Black a safe king and more active pieces. 19.Nd4 Ne4? 20.b4! Qc4 21.f3 gives white the better game.",
        "18... Re8": "?? The losing move. \n18...dc4 19.Nb5 Qc6 20.Nxd6 Qxd6 21.Qf3 Qd5 22.Qa3  is a draw\n18...Qxc4!? 19. Nf5  (I can't make 19.b3!? work) Kd7 20.Nxd6 Kxd6 21. b3 with an initiative for white although there is lots of play left in the position and if Black was playing to win, this would be my suggestion.",
        "19. cxd5": "White now has an overwhelming position.",
        "19... Nxd5 20. Nxe6 fxe6 21. Qxd5": "I thought this was a rather cheeky finish - White exploits the pin on the e-file."
    },
    "url": "https://gameknot.com/annotation.pl/french-defence?gm=15063",
    "gameName": "French Defence",
    "players": "richard_pitts (1928) vs. koozzy_1999 (1763)",
    "opening": "French (C08), Tarrasch, open, 4.ed ed"
}