{
    "moves": {
        "1. e4 d5 2. d4 c6 3. exd5 cxd5": "my orginal intention was to play into classical caro-kann positions but you did well in keeping me on my toes. This is the caro-kann exchange varation which is fine for black. ",
        "4. Nf3 Nc6 5. Bb5 Bd7 6. Nc3 Nf6 7. Bf4": "good development so far white is only slightly better because of the his space advantage. ",
        "7... e6": "completing the caro-kann defensive structure with ...e6 very good for black. However, white has two major positional victories #1 strong and mobile pieces and creating a weakness on ...c6. The drawback of the exchange varation for white is that he has a weak centre. It is instructive how black manages to undermine it. ",
        "8. O-O Bb4": "intending to wreck whites pawn structure with Bxc3 which weakens whites control of the important d5 and e4 squares. ",
        "9. a3": "!? this provokes the ideal exchange for black. Because of his limited mobilty it is better to avoid exchanges and restrict the mobility even more for black. I would think Ne5 would be more to the point. ",
        "9... Bxc3 10. bxc3": "black is doing better now because is weakness on c6 is well covered whereas white's c3 and b5 are not. To add to this e4 is now available for a knight. Because e4 is now available the black knight the balance of power in the centre as shifted in black's favor. ",
        "10... Qa5": "double attack!",
        "11. Bxc6": "?? the critcal mistake that completely abandon the centre. ",
        "11... Bxc6": "Bxc6 is a more active way to defend against a possible attack on d5 via c4",
        "12. Bd2 Ne4 13. c4 Nxd2 14. Nxd2 Qc3 15. Nf3 dxc4": "notice how black has complete control of d5 and e4 and the result is that white's center is gone. ",
        "16. Ne5 O-O": "I am willing to tolerate a doubled pawn weakness in order to gain complete dominance of the center. ",
        "17. Nxc6": "oubl",
        "17... bxc6 18. a4 Rfd8": "d4 pawn is toast",
        "19. Rb1 Rxd4 20. Qh5 Rad8": "never underestimate the power of controlling the center. Black threatens to play ...Rd5 ",
        "21. Rb7 g6 22. Qc5 Rd4d1": "wins the rook because of the threat of a back rank mate",
        "23. h3 Rxf1+ 24. Kh2 Qxc2 25. Qe7 Rh1+ 26. Kg3 Rd3+ 27. f3 Rxf3+ 28. gxf3 Qh2+ 29. Kg4 Rg1+ 30. Kh4 Qg3#": ""
    },
    "url": "https://gameknot.com/annotation.pl/friendly-match-from-an-old-friend?gm=33517",
    "gameName": "Friendly match from an old friend",
    "players": "benkogambit (1520) vs. elyhim (2154)",
    "opening": "Scandinavian (centre counter) defence (B01)"
}