{
    "moves": {
        "1. d4 d5 2. e3": "Queen's pawn (D00), stonewall attack.",
        "2... Nc6 3. c4 Nf6 4. a3 e5 5. b4": "Här lämnar vit Queen's pawn (D00), stonewall attack, där 5.Nc3 hade varit i den linjen.",
        "5... exd4": "Då börjar vi sabba hans \"stenmur\" av bönder, även om han tillfälligt kan reparera den med exd4. I såfall fortsätter jag bara med dxc4 och knäcker upp en bräcka i mitten av muren. Går han då upp och slår Bxc4 , så går jag upp med Nxd4 och då är min S säkrad av min D.",
        "6. b5 Ne5 7. exd4 Nxc4": "Sådärja, nu är stenmuren spräckt och mitt läge i centrum ser bra ut.",
        "8. Bxc4 dxc4 9. Qe2+ Be7 10. Qxc4": "Materiellt står vi förvisso lika, men jag är betydligt mer utvecklad. Vits pjäser ligger långt bak och skräpar, medan jag har en rockad inom räckhåll.",
        "10... Be6 11. Qc3 O-O 12. Be3": "Här bryter han mot regeln att S bör utvecklas före L, så jag ligger bättre till positionellt.",
        "12... Qd5 13. f3 Qxb5 14. Ne2 Nd5": "Här får jag en snygg gaffel mellan D och L, även om den inte är särskilt stark.",
        "15. Qc1 Nxe3 16. Qxe3 h6": "Ett medelmåttigt drag, men preventivt för eventuella attacker mot g5. Dessutom frikopplar draget min L på e7, så att den kan ägna sig åt mer offensiva uppdrag.",
        "17. O-O Rad8 18. Nbc3 Qc4 19. Rfd1 c6": "Blockerar vits S på b5 och d5, samt frikopplar min D från bevakningen av de rutorna.",
        "20. h3": "Dags att flytta fram positionerna, och spontant ser jag att mina bönder ligger långt bak. Får se upp med att inte låsa in damen bara.",
        "20... b6 21. Rdb1 Bg5": "Sätter lite press på hans D, och luckrar upp hans försvar. Det börjar bli dags att närma sig hans K.",
        "22. Qf2": "Det finns inga säkra kapt. så jag får tänka lite långsiktigt taktiskt. Eftersom han saknar löpare, så kan det vara säkert att aktivera kungstornet. Sedan avtäcker jag e-filen med L och har den säkrad med T.",
        "22... Rfe8 23. f4 Bf6 24. Rb4 Bxd4 25. Nxd4": "Här trodde jag att han skulle ta min D med T, men desto bättre att han osäkrar bägge sina S. ",
        "25... Qxc3": "Nu börjar min D bli mäktig, och det är dags att se om det finns kombinationer som ger vit större materialförluster.",
        "26. Nf3": "Här borde han ha tagit min L, men trevligt med ett T gratis, och jag tvingar även upp vits K längs h-filen.",
        "26... Qxa1+ 27. Kh2 Qxa3": "Nu har jag både det materiella och positionella övertaget. Med så många bönder kvar, så borde någon av dom kunna promoveras om vit är segmattad.",
        "28. Rb2": "Här resignade vit alldeles för tidigt enligt min mening. Eftersom misstag alltid sker, så hade jag väntat med att ge upp."
    },
    "url": "https://gameknot.com/annotation.pl/frnz571s-51st-mini-tournament-lii?gm=29054",
    "gameName": "frnz571's 51st mini-tournament LII",
    "players": "frnz571 (1330) vs. chekof (1256)",
    "opening": "Queen's pawn (D00), stonewall attack"
}