{
    "moves": {
        "1. e4": "This game starts a Najdorf sicilian.",
        "1... c5 2. Nf3 d6 3. d4 cxd4 4. Nxd4 Nf6 5. Nc3 a6": "As usual I play the Najdorf. So far I haven't refrained from the Najdorf and only adopted other openings in speed play.",
        "6. Bg5": "Bg5 - This promises a tough fight. He chooses the sharpest line.",
        "6... e6 7. Bc4": "7. Bc4 combined with Bg5 is unknown to me, though I have encountered it in speed games, but never looked it up in libraries or saw it in pros games.",
        "7... Be7": "I decide to play the usual suspects.",
        "8. Qf3": "This leaves the d4 knight unprotected and prevents f4. I feel relieved. Business stuff severely reduces my thinking time these days.",
        "8... Nc6": "I know this is strange with a6 and no bishop or queen aside to take back on c6. So I have a battery of pawns on the 6th range \"doing the same job\". Still I opt for this to strengthen my center.",
        "9. Nxc6": "Of course my opponent goes for this scenario.",
        "9... bxc6": "An additional benefit is the newly opened b-file. Of course ...a6 was wasting time now.",
        "10. O-O-O": "Still my rival is keen for double edged play. Now his rook is opposite my queen, attacking the d-pawn. But I feel one single center pawn is not enough.",
        "10... Qb6": "Some calculation assures the d-pawn is poisoned. So I can forcefully develope my queen.",
        "11. Bxf6": "It seems my opponent goes for the d-pawn.",
        "11... Bxf6": "I leave the pawn en pris because taking it just helps me.",
        "12. Rxd6": "There is a direct line winning the exchange plus keeping the pressure towards the queenside.",
        "12... Qc5": "Forking rook and bishop.",
        "13. Qd3": "Naturally defending both.",
        "13... Be7": "Taking away the squares of the rook.",
        "14. Rd4": "Wrongly trying to keep the exchange. I guess, 14. Rhd1 was way better.",
        "14... e5": "There goes the rook!",
        "15. Bxf7+": "Instead of giving the rook white correctly gives the bishop and causes some stir. ",
        "15... Kxf7": "No point in sidestepping.",
        "16. Qf3+": "The maneuver to save the rook and frighten me with a brief queen - king vis-à-vis.",
        "16... Bf6": "Usually I never keep a piece (especially the king) opposite an attacker, but here opting for blocking with the bishop seems better.",
        "17. Rd3": "Saving the rook and preparing to double along the d-file.",
        "17... Rf8": "Preparing castling by hand and leaving the rook face to face with white's queen.",
        "18. Qg3": "Stepping away from the rook.",
        "18... Rb8": "Alright. Time to go from defence to attack. The little struggle around the poisoned d-pawn actually decided the game. I am up one piece for two pawns and in an excellent attacking position.",
        "19. Rhd1": "The d-file is \"lost\" for sure. But my play will be along the b-file anyway.",
        "19... Be6": "...and along the a2/e6-diagonal.",
        "20. h4": "Attacking my kingside is way too slow. I'd go for tense defending moves only.",
        "20... Kg8": "\"Castling\" brought to an end.",
        "21. h5": "This is useless. All white's power is along the d-file(, where is nothing to attack).",
        "21... h6": "This does not only stop white's h-pawn from advancing, it also sets up a lethal attack with my dark-squared bishop along the c1/g5-diagonal.",
        "22. Rd3d6": "White makes use of the d-file by finally attacking something. (The e6-bishop.) But this allows a beautiful finish. Did he say \"finish\"? Yes, finish. Can you spot it? I either win further material with keeping tense pressure or checkmate. I am luckily allowed the latter.",
        "22... Bg5+": "My first move of a sequence to drive the king to the vulnerable b-file and control c1.",
        "23. Kb1": "I guess, 23. R6d2 was better. Can you spot the lethal attack?",
        "23... Rxb2+": "Here it comes - a classic tin opener. Standard shot. Everything is forced now.",
        "24. Kxb2": "\"Okay, show me what you got!\"",
        "24... Rb8+": "The next cannon comes into play.",
        "25. Ka1": "The only choice possible.",
        "25... Qa3": "Threatening checkmate on b2.",
        "26. Rb1": "This must be prevented. But only 26. Rd8+ parting with further material would have accomplished this. 26. Rb1 leads to checkmate.",
        "26... Rxb1+": "Check. Both answers to this don't defend. My three pieces left threaten checkmate on two squares.",
        "27. Kxb1 Qc1#": "Thank you! \nWith my e6-bishop en pris and the other two pieces giving checkmate this makes a nice picture."
    },
    "url": "https://gameknot.com/annotation.pl/from-defence-to-lethal-attack?gm=33742",
    "gameName": "From defence to lethal attack",
    "players": "BLANKED (1589) vs. cptblackbeard (1779)",
    "opening": "Sicilian (B95), Najdorf, 6...e6"
}