{
    "moves": {
        "1. d4 Nf6 2. c4 g6 3. Nc3 Bg7 4. e4 d6 5. f4": "I like the 4 pawns attack against the KI.",
        "5... O-O 6. Nf3 Na6": "Seems an odd move, but it can come to b4, often to exchange off for a Bishop on d3.  At c6, it blocks c5 and can be chased away with d5.  So, I play a3.",
        "7. a3 e5": "The thematic move is c5.  This way the bishop on g7 gets blocked off.",
        "8. fxe5 dxe5 9. d5": "Of course, I could have taken it, but I was a bit worried about a potential counter attack before my king was castled.  I'm comfortable with this position.",
        "9... Nc5": "Seems logical, but threats to e4, d3 and b3 are easily dealt with.",
        "10. Qc2 Re8": "Pretty dull for a Rook to be tied down to defending a Pawn.  Perhaps better was to give up the threat on e4 and re-route the f6 Knight via e8 or d7.",
        "11. Be2 a5 12. Be3 Nfd7 13. O-O Rf8": "I guess black decided that would be the better idea after all.",
        "14. b4 Na6 15. Qb3": "Of course, I could have taken the pawn, but black will win it back, and will strengthen on c5.  I want to play c5 before b5, and to do this, I need to protect b4 first.",
        "15... Qe7 16. c5 Kh8": "Presumably black is preparing for f5, and wants to get his King off that diagonal first.  I have a couple of options here - perhaps 17.d6 cxd6  18.Nd5 Qe8 19.cxd6.  Or perhaps 17.c6 bxc6  18.dxc6 and if Black wants to avoid the Bishop skewer on c5, he needs to defend his Knight with the ugly 18...Ndb8.  But I chose a different option.",
        "17. Bxa6 Rxa6 18. b5": "Now, 18..Nxc5 fails to 19.Qc4 (and not 19.Bxc5?)",
        "18... Ra8": "Again, d6 is playable, and possibly the best option.",
        "19. c6 bxc6": "Which way to take?",
        "20. bxc6 Rb8 21. Qc4 Nb6 22. Qc5": "Black can exchange, but White's attack will still be strong.",
        "22... Qd8": "Here, I missed that after 23.d6, black cannot take, as 24.c7 wins the rook.  This would probably have left me able to get the pawn on to d7.  I could also have increased the pressure by bringing a rook to b1 or d1, but I was getting a little impatient with my inability  to turn the screw, so I played B-g5? with the next move in mind.",
        "23. Bg5 f6 24. Nxe5": "Of course, Black cannot take the Knight, and taking the bishop allows the exchange to be taken (although Black is then fine).   But Black wants more.",
        "24... Qe8": "What now?  N-d7 may be best, allowing the bishop to come back to f4, and attack c7, but it looks like it will all fizzle out.",
        "25. d6": "In for a penny, in for a pound.  Black has a couple defences, I think.  25...cxd6  26.Qxd6 Qxe5 defending the rook on b8, but allowing 27. Qxf8+ Bxf8  28.Bxf6+ winning back the queen and roughly evens.  Or he could play 25...fxg5 and White can choose between dxc7, d7 or Nb5 (N35 is invulnerable because dxc7 allows dual threats on b8 and f8).  But he chooses Qxe5?.",
        "25... Qxe5 26. Qxe5 fxe5": "If 27.d7 black will be more than happy to give back a piece for the two Pawns.",
        "27. dxc7 Rxf1+ 28. Rxf1 Ra8 29. Rb1": "Suddenly the Knight is hanging, as moving it will result in Rb8.  29...Bf8 may have been worth a shot, forcing the accurate 30.Be3.",
        "29... Ra6 30. Nd5 h6 31. Be7 Nc4": "If Black had taken on d5, then Rb8 is not immediately playable, but White still wins with exd5.",
        "32. Rb8 Rxc6 33. Rxc8+ Kh7": "How to win (most accurately) from here?",
        "34. Nf6+": "!",
        "34... Bxf6 35. Bxf6 Rxf6 36. Rh8+ Kxh8 37. c8=Q+": "Neatly picking up the Knight in the process."
    },
    "url": "https://gameknot.com/annotation.pl/from-chester-charity-congress-a-few-years-back?gm=46909",
    "gameName": "From Chester Charity Congress a few years back",
    "players": "Madthinker  vs. Paul S ",
    "opening": "King's Indian (E76), Four pawns attack, dynamic line"
}