{
    "moves": {
        "1. d4 d5": "Dame-pionspel, ook wel het Collesysteem.\n",
        "2. Nf3 Nf6 3. Bf4 e6 4. e3 Bd7 5. Bd3 Bd6": "Eerste keuze die je moet maken, bezorg ik hem een dubbelpion ja of nee! Heb dat toch gedaan, want zijn loper op d7 is slecht!\n",
        "6. Bxd6 cxd6 7. Nc3 a6 8. h3 b5 9. a3 h6": "Dit lijkt af te stevenen op een zeer tamme en angstige partij, maar schijn bedriegt.....",
        "10. Qd2 Nc6 11. e4 dxe4": "Nu is het tijd voor actie! Niet rochade, maar de beuk erin. Anders bloedt de partij inderdaad dood.",
        "12. Nxe4 Nxe4 13. Bxe4 d5": "Kijk nu eens naar zwarts loper, die kijkt tegen zijn eigen pionnen aan, daar heb ik op gespeeld.\n                     Zoiets is een kleine nuance, maar o zo belangrijk richting eindspel! De slechte en de goede loper....\n",
        "14. Bd3 Qf6 15. Qe3 O-O 16. O-O Rae8": "Tae8?  Vond ik niet zo goed, je sluit de F- toren toch op?",
        "17. Rfe1 Re7": "Zo lost ie het op, maar natuurlijk was ie van plan om e5 door te drukken.....En ja dan maakte het inderdaad niet zoveel uit welke toren hij hiervoor speelde.\n",
        "18. c3 Rfe8 19. Ne5 Rd8": "Ik wilde wel dat ie afruilde, de dame komt dan ook in het nauw. Ze kan niet terug.",
        "20. f4 g6 21. Qg3 Nxe5": "Net op tijd, want ik dreigde te offeren op g6, met allerlei gevaren voor zwart.\n",
        "22. fxe5 Qg7 23. Ref1 Rf8 24. Rf6 Be8": "De omsingeling is begonnen. Ik heb nu alle geduld en wacht het juiste moment af om toe te kunnen slaan.\n",
        "25. Raf1 Kh8": "En nu niet in de verleiding komen om toch Lxg6??? want dan speelt ie Tg8....nu staat mijn loper gepend.. Mooie valstrik, maar ik trapte er gelukkig niet in.\n\n",
        "26. Qh4 Rg8 27. Rf1f3 Rd7 28. Rg3 Qh7 29. Qf4 Rg7": "Niet g5??? Want dan kan ik gewoon Lxh7 - gxf4 en Txg8+ spelen! Met torenwinst.",
        "30. h4 Kg8": "Aan de opmars van de h-pion is niks meer te doen.\n",
        "31. h5 Qh8 32. hxg6 Kf8 33. gxf7": "Zwart gaf op, maar ging ook door de vlag! \nMaar ook al had hij tijd, dit is onhoudbaar.... Op bv. Txg3 volgt fxe8(d)++ en dan Kxe8 - Dxg3, winst loper. Op Tdxf7 volgt Txg7 - Dxg7 en ik speel daarna Dxh6!\nMet een stand van 2 pionnen meer en een slechte stelling voor zwart.\n \n"
    },
    "url": "https://gameknot.com/annotation.pl/fsb-competitie-rijs-vs-heerenveen-2-9-11-2012?gm=47482",
    "gameName": "FSB Competitie Rijs vs Heerenveen 2 (9-11-2012)",
    "players": "Chris draijer (1789) vs. Wiebe Oppenhuizen (1415)",
    "opening": "Queen's bishop game (D02)"
}