{
    "moves": {
        "1. e4": "So they decide to open with the usual King Pawn opening.",
        "1... c5": "And once again, I decide to break my usual muscle memory by responding with e5. Instead, I try to work toward a more unusual Najdorf Sicilian.",
        "2. f4": "And- right there. I was trying to take the game into a direction I wasn't familiar with by at least playing a Najdorf by the main lines. Instead, my opponent beats me to it, by trying something even more bold on their end- the Grand Prix! The moment I saw f4, I knew I was in for a complicated game. As a King Pawn player, with White, I have main line experience against the Sicilian. I rarely ever attempt one myself, but this is my first time ever seeing a Grand Prix. I would never be able to pull one of these off as of now, and now I have to think of ways to defend against it?! Luckily for me though, the high rated players on Gameknot absolutely love this opening, and I was able to find plenty of helpful annotated games to give me ideas on how to defend, what to expect, and just what exciting turns this game could have unfolding into the battlefield...",
        "2... d5": "Apparently, this move is why you don't normally see e4-f4 in the first two moves. Especially not among the masters- they normally try e4, c5, Nc3, Nc6, f4! Personally, I don't see why either line aids or impairs either color, but that's just due to lack of experience on my end. I was still at least interested in seeing where this game was going. What line will White try to lead me down for their attempt at victory?",
        "3. exd5": "(?) - They take the d pawn! Now we're transposing into Scandinavian lines... and now to say I'm overly uncomfortable would be the massive understatement of the year. As White, I love playing the Scandinavian, regardless if we go into the main line or not. I never touch it as Black. But now Black must play the Scand, after trying Sicilian and meeting the Grand Prix. This game's stakes just got raised on my end.",
        "3... Nf6": "I really don't have much choice about Nf6. I have a lot of experience with the Scand, and I know all too well how easy it is to punish Black after Qxd5 (like say, with Nc3?). This game can still go anywhere, and I can only hope that White here doesn't know this line of Grand Prix too well either...",
        "4. c4": "We have now made a full transition into the Scandinavian main lines.",
        "4... e6": "So I decide to stick by them and see where White wants to go with this.",
        "5. dxe6": "(?) - Except this line of the Scandinavian works better when there is NOT a c5 pawn in play.",
        "5... Bxe6": "Now I've got the better development. GK database has this position set to equal or strong chances for Black at this point, in spite of being down a pawn.",
        "6. d3": "(!?) - White decides to open up even more. I don't agree with this move. White continues to delay back rank piece development, and d3 didn't even free the DSB all that much. If my opponent isn't careful, they will allow Black to easily win the centre if this keeps going...",
        "6... Nc6": "So I decide to make good on my threat and develop my back rank pieces even further. Black now presents very clear threats to seize control of the board at this rate.",
        "7. Nf3": "Finally! Out comes a back rank piece. But I still favor my chances.",
        "7... Bd6": "Now I establish a fortress for Black, and enable O-O.",
        "8. Be2": "The Q-side isn't developed nor safe enough for the exposed king to hide. The sooner, the better.",
        "8... Qc7": "(!) - I've now enabled O-O-O while launching well aimed attacks on f4-g3-h2. If White plans O-O, then this threat has to be addressed at once.",
        "9. Qd2": "If O-O, then Bxf4 at no material loss. If g3, then eventually Bh3 deters O-O. Probably White's best.",
        "9... O-O": "So I just keep up with the patience and wait to see what will happen next.",
        "10. O-O": "The king finally hides away into the kingside. The problem is, he isn't even remotely safe yet...",
        "10... Nd4": "(?) - There was probably a better move, but I opted for the move that caused White the most disturbance to rub some more salt into the wounds of grief...",
        "11. b3": "(?) - I actually don't see a point to this move. Maybe White plans to fianchetto the DSB, but isn't it needed to guard the f4 pawn right now?",
        "11... Rfe8": "I opted for creating more threats in winning control over the center, targeting the weak LSB.",
        "12. Nxd4": "White decides that maybe the black knight is in a dangerous spot after all.",
        "12... cxd4": "And I'm more than happy to remove a strong knight from the list of White's defenders. I'm also happy to see what direction White plans on taking now.",
        "13. Bb2": "So now the DSB takes the square on b2, realizing the dangers that the lone pawn presents.",
        "13... Qb6": "I decide that Black can let the f4 pawn live a little longer, dominating the king's diagonal squares. White is forced to try something else a little bit different now.",
        "14. Bf3": "(?) - I actually don't know why White did this. Maybe they didn't like the rook on e8. Maybe they want to threaten b7. Perhaps both, but the threat doesn't appear all that real at the moment.",
        "14... Bb4": "(?) - This was a mistake. The attack on the Queen was a bit premature. Better would have been Bf5, and when I play Bb4 here, then the queen retreats, d3 is won, and White's Q-side defenses unravel faster than a ball of yarn on a sewing machine.",
        "15. Qf2": "She retreats in front of the king here. My diagonal on the king is even stronger.",
        "15... Bc5": "This basically resets the position, but I realized that I can't continue with my plans if I allow White to play a3! here. I see what I need to do BEFORE trying Bb4 again (if the queen returns to d2).",
        "16. Nd2": "(?) - The knight was trapped from the start. The problem isn't being fixed here (all of its squares are weak or occupied!) and now punishment is in store for my unfortunate opponent.",
        "16... Bf5": "I launch an attack on the weak d3 pawn.",
        "17. Be2": "So White must defend the pawn or lose potentially more than just material advantage.",
        "17... Re3": "I increase the pressure on the pawn.",
        "18. Kh1": "(?) - Perhaps they saw some danger to the pressure on the diagonal, but maybe this wasn't White's best? Was my attack on d3 not going to work?",
        "18... Rae8": "I decide to develop my final rook, to dominate the e rank.",
        "19. Rfe1": "So White decides to answer with a rook of their own to challenge my control over it.",
        "19... Bg4": "Irritates both the queen and the bishop in one attack.",
        "20. Nf1": "(??) - Clear blunder. White wanted to attack the rook on e3, but it's already about to move...",
        "20... Re3xe2": "(!) - because this bishop was down too many defenders!",
        "21. Qg3": "The queen is feeling a little too exposed here. White decides to move her to a much more safe square where she guards basically everything- the rook, the K-side pawns, and the king.",
        "21... Qc6": "I did see Rxb2, but I saw a more deadly attack by moving my queen to this active square.",
        "22. h3": "(??) - and White clearly did not notice the danger my queen now presented. The long diagonal has the king horribly exposed, even with the White Queen right there.",
        "22... Rxg2": "(!) - The White Queen is now lost.",
        "23. Rxe8+": "Or is it? If Black plays Qxe8, White can play Qxg2 and the day is saved!",
        "23... Nxe8": "Except, even if the knight weren't there, I still had Bf8, and had White exchanged further, I'm still about to win the White Queen, who guards the White King!",
        "24. Qxg2": "So White reluctantly pins the queen to the king.",
        "24... Bf3": "And I finish her off. ",
        "25. Qxf3": "I wondered about Re1, but threatening the knight is probably pointless. There are too many moves for Black, so perhaps getting rid of the bishop was wiser.",
        "25... Qxf3+": "Hello!",
        "26. Kg1": "Forced.",
        "26... h6": "(?) - This move wasn't necessary, but I wanted to be certain that my king wouldn't be threatened by that rook, because to lose this game over a simple oversight like that would be too much.",
        "27. Bc1": "Prevents both Qe3+ and Qxf4.",
        "27... Qxd3": "Oops! White forgot another dropped pawn. :)",
        "28. Kg2": "(?) - Probably wanted to get the king off the back rank with that ridiculously strong back rank threat (also removes the threat of discovered check), but...",
        "28... Qe2+": "...why let yourself drop a knight over it?",
        "29. Kg3": "Keeps the king away from the g1 mating attack.",
        "29... Qxf1": "I claim my prize.",
        "30. Bb2": "Launches an attack on the queen and activates White's remaining two back rank pieces... but the queen wants to move away anyway. The king is wide open.",
        "30... Qd3+": "Going up or down, Mr. King?",
        "31. Kh4": "Up it is. Let's build a mate on the h file then.",
        "31... f5": "That hits g4....",
        "32. Rg1": "Stops the queen from coming in along the g rank.",
        "32... Kh7": "Protects h6 and opens the door to g6.",
        "33. Bc1": "Not sure why this. Ba3 would have delayed me an extra move, wouldn't it?",
        "33... Be7+": "This gets played a move early.",
        "34. Kh5": "Another missed move. Rg5 would have delayed me longer, again. Mate in 1.",
        "34... Qxh3#": "Well, thanks for reading, folks! To be honest, I was a little hopeful this game would have turned into the thrilling games you normally see out of the Grand Prix. Ah well, one can always hope to dream, but I still had fun in this match! Please rate this annotation, and thanks for any feedback! :)"
    },
    "url": "https://gameknot.com/annotation.pl/full-speed-ahead?gm=49713",
    "gameName": "Full speed ahead!",
    "players": "brosio (1305) vs. rickdaily12 (1274)",
    "opening": "Sicilian (B21), Grand Prix attack"
}