{
    "moves": {
        "1. e4 e5 2. Bc4": "Checking up on my opponent's other games, I found he was quite the devotee of the Bishop's Opening. There's nothing especially wrong with it, but it's a long time since Weaver Adams was optimistically claiming it as a forced win for White.",
        "2... Nf6 3. Nf3": "Unusual. I figured I might as well take the pawn as go straight into the Two Knights' Defence by transposition (3. ... Nc6).",
        "3... Nxe4 4. O-O Nc6 5. d3 Nf6": "With his dark bishop free and having castled, White seems to have a couple of tempi for his pawn sacrifice. On the other hand, a pawn is a pawn, and I was expecting 5. d4, leading into Canal's Attack after 5. ... exd4; 6. Re1, d5; 7. Bxd5, Qxd5; 8. Nc3, when White recovers all his material with a good game (though the position's quite defensible for Black).",
        "6. Ng5": "And this, for my money, is a poor move. In the Two Knights' proper, it comes a couple of moves earlier, while White still has his e-pawn. Then Black is more or less obliged to give up a pawn with 4. ... d5; 5. exd5, Na5; as the recapture 5. ... Nxd5 invites the dangerous \"Fried Liver\" attack with 6. Nxf7, Kxf7; 7. Qf3 , Ke6. But now I can play 6. ... d5 safely, and White's extra tempi vanish.",
        "6... d5 7. Bb5 Be7 8. Nc3 O-O 9. Qd2": "There was the threat to drive the White knight back and pin it with 9. ... h6 and 10. ... Bg4, which would be troublesome as the White KB is offside and can't break the pin. But the position is surprisingly dangerous now Black has caught up in development and has a strong centre.",
        "9... Nd4 10. Ba4": "White is reluctant to give the two Bishops, but there is a worse threat.",
        "10... h6 11. Nh3": "After 11. Nf3, Nxf3; 12. gxf3, Bh3 Black has a dangerous attack on the White King, but the text loses a piece.",
        "11... Bxh3 12. Qe3": "And not 12. gxh3, Nf3 ! winning the Queen. But no matter the twists and turns, Black keeps his extra piece.",
        "12... Bd7 13. Qxe5": "Alternatively 13. Bxd7, Nxd7 and Black keeps both his centre pawns, as the threat of 14. ...Nxc2 prevents 13. Nxd5. But the text allows Black to pick up two more pawns.",
        "13... Bxa4 14. Nxa4 Nxc2 15. Rb1 Nb4 16. a3 Nxd3 17. Qf5 Nxc1 18. Rbxc1 c6": "A piece and two pawns ahead, Black need only play steadily - but with the White Knight far removed from his King, White has to fear a mating attack.",
        "19. Nc5 Bxc5 20. Rxc5": "Black was happy to exchange both because of his existing material superiority and the prospect of gaining further time by kicking the White pieces around some more.",
        "20... Qd6 21. b4 Rae8 22. g3": "Making a loophole for the King and relieving most of the threats associated with the back rank. But Black now gains even more time to improve his position.",
        "22... Re5 23. Qc2 Ne4": "Taking advantage of White's last, which leaves the Rook on c5 quite shut in. There is only one safe square.",
        "24. Ra5 Qb8 25. Re1 b6 26. Ra4 Qc7 27. b5 c5": "White's Rook now has an egress along the rank, but no squares available to it as yet. Meanwhile Black now has a pair of connected passed pawns which would win the game out of hand if the pieces were traded off.",
        "28. Ra6 Rfe8 29. Qa4": "This loses.",
        "29... Nc3 30. Rxa7": "Or 30. Rxe5, Qxe5; when probably 31. Qf4 is best, allowing Black to exchange Queens into an easily won ending. Any attempt to keep Queens on seems to allow a mating attack beginning with 32. ... Qe1  and 33. ... Rf2, etc.\r\n\r\nWhite resigned, leaving me to wonder if he'd noticed that 30. ... Rxe1 was Check.",
        "30... Re5xe1+": ""
    },
    "url": "https://gameknot.com/annotation.pl/fun-with-knights?gm=19103",
    "gameName": "Fun with Knights",
    "players": "jobrando (1225) vs. gil-gandel (1200)",
    "opening": "Bishop's opening (C24), Berlin defence"
}