{
    "moves": {
        "1. e4": "One of my first games on GK and first games in years. Its been over 2 years since I played the game, I remember it been a real sucker punch so I thought I'd try to annotate it and recap some of my thinking! \r\nEven worse is the fact this match was for records, if I won I got £30 worth of records if I lost then I had to give him £10 of records, as well as the others in the RR!!",
        "1... e5 2. Nf3 Nc6 3. Bc4": "Looking for the fried liver attack i remember from been 11years old",
        "3... h6": "blocked",
        "4. O-O": "castled nice & early.",
        "4... Nf6": "attacking e4",
        "5. d3 a6 6. c3": "cant remember what was going on here. maybe creating some room for a queenside queen attack? Or stopping bishop getting trapped and allowing him a little escape route?",
        "6... d6 7. h3": "blocking Ng4",
        "7... b5 8. Bb3 Be7 9. Qe2": "queen trying to work way free",
        "9... O-O 10. Bc2": "looking at H7. Infact I'm going to go all out for it. ",
        "10... Bb7 11. d4": "Going to blow open the centre, rid knight and nail him on H7 with my Queen ",
        "11... Re8": "Centre is mounting up with pressure",
        "12. Rd1 Qc8 13. dxe5": "here we go",
        "13... Nxe5 14. Nxe5 dxe5 15. f4": "At all cost I must clear E4",
        "15... exf4 16. e5": "And now I've got rid of knight. I'm a pawn down but am going to take that tempo and slam the game shut. \r\n\r\nplease note lack of defense",
        "16... Nd7": "Ive backed him up, I'm going forward nothing can stop me.",
        "17. Qd3": "Looking good :)",
        "17... Bc5+": "Oh thats annoying. ",
        "18. Kf1": "?? would H2 have been better? THought if i led him into the open would be harder to pin down. ",
        "18... Nxe5": "Surely a weak attack on my queen wont stop me..",
        "19. Qh7+": "yes! (what do I do now??)",
        "19... Kf8 20. Bxf4": "rid knight and apply pressure on G7. ",
        "20... Bxg2+": "here comes the sucker punch!",
        "21. Kxg2 Qb7+ 22. Kf1 Qf3+ 23. Ke1 Qf2#": "A lesson for everyone. Make sure your defence is solid before you attack. \r\nNo defence, blinkered going forward with no concrete mate insight, chucking pieces in the general area with no real plan, left myself wide open. "
    },
    "url": "https://gameknot.com/annotation.pl/funk-round-robin-for-records?gm=22704",
    "gameName": "funk round robin for records!!",
    "players": "daddyk (1526) vs. soul_flavour (1440)",
    "opening": "King's pawn game (C50)"
}