{
    "moves": {
        "1. e4 e5 2. d4": "Partita del centro",
        "2... exd4 3. Nf3 Nc6": "Ora siamo in una Scozzese",
        "4. Bc4": "4. c3 è il cosiddetto gambetto Goering\n",
        "4... Bc5 5. c3 Nf6": "E siamo rientrati in una classicissima Italiana",
        "6. cxd4": "Il nero ha gioco soddisfacente dopo 6. e5 d5!",
        "6... Bb4+ 7. Nc3": "Il seguito di Gioacchino Greco detto il Calabrese, grande giocatore del 1600. 7.Ad2 è il seguito abituale oggi.\n",
        "7... Nxe4 8. O-O": "Il bianco non teme di sacrificare materiale!",
        "8... Bxc3": "Il nero non deve essere troppo avido. Greco vinceva facilmente dopo 8... Cxc3 9. bxc3 Axc3 10. Aa3 Axa1 11. Te1+\n",
        "9. d5": "Questa prosecuzione dell'attacco è stata ideata dal danese Moeller. Nella prima e terza partita del suo secondo match contro  Lasker , Steinitz ha giocato 9. bxc3 d5 10. Aa3!?, ma nulla ha potuto contro il gioco preciso di Lasker",
        "9... Bf6 10. Re1 Ne7 11. Rxe4 d6": "il nero ha giocato con prudenza e precisione, accontentandosi di un pedone.  Ora però deve stare attento per non concedere chances al suo avversario. Se 11... O-O 12. d6 cxd6 13. Ag5 con compenso per il materiale sacrificato\n",
        "12. g4": "Il bianco attacca alla baionetta. Il seguito più usuale è 12. Ag5",
        "12... h6": "Evidentemente il nero non si fidava a giocare 12... O-O, che peraltro sembra sostenibile\n",
        "13. h4": "Una volta che hai detto A, devi pure dire B (vecchio proverbio russo)",
        "13... Kf8": "\n",
        "14. h5": "Il bianco punta tutto sull'attacco\n",
        "14... g5": "Blocca l'avanzata dei pedoni bianchi e offre la casa g7 al re",
        "15. Nd4": "Probabilmente era migliore  15. Ad2 e se 15... Axb2 16. Tb1 Ag7 17. Cd4 con compenso per il materiale sacrificato\n",
        "15... c6 16. Qf3": "Il bianco esagera. Buona o cattiva che fosse, bisognava giocare 16.dxc6",
        "16... Nxd5 17. Bd2 Nc7": "Ecco il momento critico! Il nero pensa che la minaccia di spinta in d5 sia in grado di tarpare le ali del bianco. L'idea in sé non è illogica ma si rivelerà perdente.  Alcuni commentatori dell'epoca hanno suggerito 17... Cb6 ma dopo 18. Tae1 il bianco ha un forte attacco. La mossa che smonta l'attacco è invece 17... Ae5!\n",
        "18. Rae1": "Il bianco ha completato lo sviluppo ed è pronto a colpire",
        "18... d5": "Le alternative dimostrano quanto il nero è sotto pressione Il bianco minaccia anche Cxc6!\na) 18... Ad7 19. Aa5! (la donna è sovraccarica, non può difendere  c7 e f6 contemporaneamente) 19...Rg7 20. Te7!\nb) 18... Rg7 19. Te7! Tf8 20. Ac3 e la pressione è intenibile\n",
        "19. Bb4+": "Una manovra elegante e in grande stile\n",
        "19... Kg7": "Se invece 19... Rg8 20. Ae7 Axe7 21. Rxe7 Df8 22. Ad3 e il nero collassa\n",
        "20. Re4e7": "Primo sacrificio. Occupa la settima traversa e taglia il collegamento tra la regina e l'alfiere f6",
        "20... dxc4": "Se 20... Axe7 21. Txe7 Tf8 22. Cxc6 e lo scacco d'alfiere in c3 decide\n",
        "21. Nxc6": "Il secondo sacrificio. Il bianco libera la diagonale all'alfiere attaccando nel contempo la regina nera",
        "21... Qd3": "Forzata. Se 21.... bxc6 22.Dxf6+!! con matto in tre",
        "22. Rxf7+": "Il terzo sacrificio!",
        "22... Kxf7 23. Re7+": "Al bianco non interessa il guadagno della donna con 23.Ce5+",
        "23... Kg8 24. Qxf6 Rh7 25. Re8+": "Una chiusura degna. Il nero abbandona\n"
    },
    "url": "https://gameknot.com/annotation.pl/cafe-de-la-regence-parigi-1909?gm=65998",
    "gameName": "Cafe de la Regence Parigi 1909",
    "players": "Lazard  vs. Gibaud ",
    "opening": "Centre game, Kieseritsky variation (C21)"
}