{
    "moves": {
        "1. e4 c5 2. Nf3 e6 3. d4 cxd4 4. Nxd4 a6 5. c4 Nf6 6. Nc3 Bb4 7. Bd3 Qc7": "Both white and black are performing their 3 opening goals in these moves and the next, so everything is going fine. Black plays to prevent white's e5 thrust, which would disrupt black's game.",
        "8. O-O Nc6 9. Nxc6": "The correct idea when 2 pieces are in contact is to not take, but to keep up the pressure. This move releases the tension, and gives black a solid game. However, it does not waste time.",
        "9... dxc6 10. Kh1": "White's idea is to go with f4 and e5 and advance on the kingside.However, this move should not be played, because it does not develop the queen or help with the opening goals in a position that could become open. To be most active, the white bishop can go to g5 and the rooks can be developed to the open files. Black suffers no problems here, because he will be able to play e5 and develop nicely as well.",
        "10... e5": "Now the bishop is opened. Castling can be delayed for one move.",
        "11. f4": "This move tries to take advantage of the white's slight edge in development. It is failing however, because it allows black to take the initiative, and develop with tempo. Before conducting an attack, the best preparation is always necessary. Developing another piece would be the best move.",
        "11... Bg4 12. Qe1 Qd7 13. Qg3": "(?)Now this is a concrete tactical mistake, but takes some efforts to find why. This move creates tactical motifs that black can exploit. The d3 bishop is hanging by a thread, since the queen has difficulty holding on to it. The f4 pawn is also under attack after ...Nh4 hitting the queen. If you use the right method of calculation here, I am sure you can find the best move and the reason why. Here, I used quite a lot of time, and calculated the game right out to the line that happened in the game.",
        "13... O-O-O 14. fxe5": "The correct challenging continuation for white, as other moves lose the initiative and black starts getting the advantage. It is not tactically sound however. ",
        "14... Nh5": "(!)The correct first move in the sequence, which wins the game by getting a decisive material advantage. Here, by using the right method of calculation, you will see that black wins nicely in the most challenging line, with a nice trick at the end. Try to STOP and do it now. If you remember especially to calculate the most forcing moves at each variation, the shocker to the opponent will not shock you very much.",
        "15. Qh4 Be7 16. Bg5": "This is absolutely forced. ",
        "16... Bxg5 17. Qxg5 h6 18. e6": "(!)White plays in the most challenging way possible, although this loses far more than other moves would. The winning move comes next. A shocking one, but can be spotted easily once you calculate the most forcing moves first. As a note, 18.Qh4 g5 wins decisive material as well. In the current position, 18...hxg5 19.exd7+ Rxd7 wins at least the exchange. This should win the game as well, but is not nearly as good as the best move.",
        "18... Ng3+": "(!!)And the opponent resigned, since the queen is lost, while the black queen escapes. The opponent here was rated 2100. It proves that you don't need to be able to visualize 10 moves ahead. The right way of calcualtion will help you play this way even if your absolute limit is 4 or 5 moves."
    },
    "url": "https://gameknot.com/annotation.pl/calculation-tactics?gm=44725",
    "gameName": "Calculation: Tactics",
    "players": "Opponent (2103) vs. Me (2096)",
    "opening": "Sicilian (B41), Kan, Maroczy bind - Bronstein variation"
}