{
    "moves": {
        "1. e4 c5 2. Nf3 e6 3. d4 cxd4 4. Nxd4 Nc6": "Nothing too special so far, though I should mention that my opponent took a rather long time before making these moves which should be openingpreparation. Maybe he was trying to figure out what the specifics of the e6 Sicilians are as they're played less often. In contrast I play rather quickly, trying to gain a small time edge while I still can as I knew my opponent is a long thinker.",
        "5. Be3": "Not the main line, but an understandable choice. That being said, the dark squares of Black's position are usually very weak and in the e6 Sicilians a common theme for White is to take advantage of that. I can't say that this move accomplishes this. He doesn't have to be afraid of Nxd4 either since it was protected by his queen. Nc3 would have been played had we followed the main lines.",
        "5... Qc7": "Slightly confusing my opponent. This particular opening is called the Taimanov variation of the Sicilian defense and sadly not a lot of Sicilian players play it as they tend to favor either d6 variations of the Sicilian or play the Khan Sicilian. The Taimanov and the Khan share very similar ideas, but the queen on c7 can sometimes become a weakness rather then an asset after Nb5. It's pointless to play this now as after 6. Nb5 Qb8 7. Nc3 a6 8. Nd4 black is fine and it can even be said to be a better position. The queen on c7 controls the b8-h2 diagonal and indirectly glares at the c-pawn on c2. Often the queen comes in handy for a minority attack on the queenside or we use both the a8-h1 diagonal and the b8-h2 diagonal to exert enormous pressure on his castled king. Of course if you've never played against the Taimanov then this is tricky to understand without losing too much time.",
        "6. Nc3": "Going back in main theory for as far as I know and looking over the d5 square before I get any ideas. ",
        "6... a6": "One of many ideas in the Taimanov is to first play a6 to restrict White's bishop and cover the b5 square. Afterwards you usually end up playing b5 and playing Bb7 which is surprisingly hard to deal with.",
        "7. a3": "My opponent plays this after a long think. It's not a bad move, but it doesn't help all that much either. Granted after the main line Qd2 there are some theoretical lines with Bb4, but if you know the theory by head then you realise that White can come out fine. That being said Bb4 which I was planning in the near future isn't an option anymore.",
        "7... b5": "One of the main ideas behind the Taimanov, more or less killing a lot of his options for his knights and his bishop.",
        "8. Be2": "Bd3 is far too passive and it can't go anywhere but e2. It can get new life in the middlegame, but for now doesn't really do much for him aside from enabling him to castle.",
        "8... Bb7 9. b4": "A mistake in my opinion. The forcing sequence isn't that difficult to spot, but there's quite a bit to calculate. Black can win a pawn with 9. Nxb4 10. axb4 Qxc3+ which is fairly obvious and there's little that White can do about it. That being said it isn't as simple as it appears since after 9. Nxb4 White has the fascinating response of Nxb5! doing the exact same thing. It took me a long time to calculate whether or not Nxb5 works, but found that after 9. b4 Nxb4 10. Nxb5 axb5 11. Nxb5 you have the cheeky Nxc2+. Taking it with the queen means that 12. Qxc2 Qxc2 follows with a very easy game for Black. Therefore the only option for White is to move the king. If 12. Kf1 then you meet that with 12. Nxe3+ 13. fxe3 and without the dark squares bishop you can play Qb6, escaping the Nb5 threat. If the king goes to d2 then you have 12. Qa5+. 13. Kxc2 Rc2+ and with the pawn on e4 also falling in the future with Bxe4 it seems grim. Checkmate seems inevitable. It seems rather easy when you have an analysis board next to you, but calculating everything OTB was surprisingly difficult. After running everything through my head a few more times I decided to go on with my plan, although I felt like something wasn't entirely right.",
        "9... Nxb4": "Winning the pawn as planned. Now my opponent goes into a long think ( 20ish minutes I believe ), obviously also calculating Nxb5 or any other way to refute this.",
        "10. Qd2": "My opponent finally plays Qd2, realising that he doesn't want to allow Qxc3 and that Nxb5 doesn't work. He knows he loses a pawn, but finds comfort in Black's underdevelopment.",
        "10... Nc6": "Realising a pawn is the most I'll get from this, I decide to retreat my knight. I'm 1 pawn up, but at the same time I'm underdeveloped. You can argue that White has adequate compensation.",
        "11. O-O": "Bringing the king to safety as the queenside isn't too safe anymore. White's plan for here is rather obvious, and I start to think on ways to counter it. White would like to play Rfd1 and target my d7-pawn. Sadly that's not possible yet as I have 2 defenders on it ( queen and king ). That being said, White has definite ideas of Nxb5 after Rfd1, winning him back the pawn at the very least and even cramping my position.",
        "11... Nf6": "I realise that I not only need to get another piece in to support an eventual d7-d5 push, but also one that can watch over the d7 square. The knight is the perfect fit.",
        "12. Nf3": "This move took him a long time to make, but it's logical enough. White wants to get his rook on the open-file and move his knight away. He moves to f3 with the idea of maybe pushing e5 in in the future or occupying this square with his knight.",
        "12... Ne7": "I wanted to win the e-pawn and quickly secure my win. You can draw an endgame with 1 pawn down, but with 2? The plan is easy. Play Nxe4, win the pawn, trade all my pieces off and go into an easy endgame. I'm not too scared of e5 either since I can always just play Nfd5 getting a really strong knight in the center.",
        "13. Bf4": "Perfectly timed. Black wants to consolidate the position so White needs to find a way to not only move Black's queen, but also in such a way that it doesn't defend d7 anymore if possible.",
        "13... Qa5": "I decide to go to a5 rather then for example c6 ( which didn't feel that well ) or c8 where my rook won't be able to reach d7 anymore. I opt for a5 as I start growing suspicious of a future Nxb5  which feels rather strong. Nxb5 axb5 Bxb5 and Black's position can't possibly get more cramped. Qa5 stops Nxb5 ideas because of axb5, and now both queens are looking directly at each other and it's in Black's best interest to remove White's queen as it's a powerful attacker in this position. All that being said, I can't help but feel like this is a mistake, but find it hard to suggest an alternative.",
        "14. Rfd1": "Adding more pressure on the d7 square.",
        "14... d5": "An attempt to close the position once and for all. as White was about to get a checkmate in 1.",
        "15. Bg5": "Pressuring a knight that defends the d5-pawn and also possibly creating doubled pawns. That being said I'm fine with doubled pawns. Black's position will never allow the rook and bishop to get into play so an additional open file can potentially give them activity again. I think ( haven't looked into it yet, but I have a feeling ) that White could have played Nxb5 here instead. 15. Nxb5 Qxd2 16. Nc7+ Kd7 17. Rxd2. White will line up both his rooks and the knight on c7 is troublesome. Additionally the White bishop will enter the attack as soon as I move my rook with Bxa6. This position seems very scary.",
        "15... Qb6": "Making an end to the Nxb5 ideas, confusing my opponent ( I use that phrase a lot ). I'm pretty sure he didn't notice Nxb5 and it might not have been an issue anymore now that the bishop is on g5, but it still seemed like Nxb5 would be possible in the future so I opted for this. Now I can respond with axb5 to Nxb5 without having the fear of losing my queen.",
        "16. Bxf6 gxf6": "After a long think he opts to trade. Apparently he has confidence in his ability to force something here. A lot of trading ensues. We both have about 10-15ish minutes left on the clock.",
        "17. exd5 Nxd5 18. Nxd5 Bxd5": "The position seems great for black now, although that's just how it looks since White has a rather cheeky move here.",
        "19. c4": "I can't take with my bishop because of Qd7 checkmate. Taking with the pawns is asking for trouble too after Bxc4, threatening my bishop who holds the position together and making my pawnstructure Swiss cheese.",
        "19... Bc6": "The only good reply in my opinion. We start to play a lot quicker from here, though we still think quite a bit, trusting the 30 second increment per move to keep us from having no time left.",
        "20. cxb5": "I still can't take the pawn because of 20. cxb5 Bxb5+ ",
        "20... Bd5": "And my bishop is rock solid, never moving ever again at the cost of a pawn. Another option was 20. cxb5 Bxb5 21. Bxb5 Qxb5, but that gets scary after Rb1, making me have to move the queen, but it still needs to guard the d7 square. ",
        "21. bxa6": "Threatening the pawn to promote. After a relatively long think, I realise that this pawn will probably never ever promote, because I have both bishops that can guard over both a7 and a8 and as such I was only slightly worried at this point.",
        "21... Bc5": "Looking over the a7 square if I was interested to move my queen and threatening Bxf2+.",
        "22. Bf1": "Now the queen defends the f2-pawn, but his position is very cramped.",
        "22... O-O": "I wanted to get my king out of there as soon as possible and had a clear plan. Play Kh8, play Rg8, take on f3, etc. It might have been better to just play Rg8, accomplishing the same thing but not putting my king in danger, although computers seem to agree with my castling idea.",
        "23. Bd3": "My opponent realises I have new exploitable weaknesses and is preparing all sorts of plans since my king has very little room to escape. I can play Bxf3 here, doubling the pawns but if he plays Kh1 then he could put a rook on g1 and probably checkmate me.",
        "23... f5": "Closing off his plans to play Bxh7+, but weakening the dark squared in the process. His knight will get newfound activity in the future.",
        "24. Qg5+": "From here he has a draw by repetition after 24. Qg5+ Kh8 25. Qf6+ Kg8, etc. My opponent however was convinced that he had a winning plan here. ",
        "24... Kh8 25. Qf6+": "He uses up 5 of his 6 minutes here to come up with a plan. and it's pretty straightforward.",
        "25... Kg8 26. Ng5": "Threatening a checkmate in 2 after 27. Qh6 28. Qxh7+. Black has to immediately stop the threats.",
        "26... Bxf2+": "I begin by giving a check and winning a pawn. Since my opponent hadn't played the draw by repetition I was sure that we were going to play this out, thus I opt to play this move first before making my defending move.",
        "27. Kh1": "Kf1 isn't bad either, but I think this move is better. If only I had my queen on c6 about now. That would have been a really nice checkmating pattern.",
        "27... Be3": "Bh4 does the same thing. They're the only defenses in this position. I maybe should have played Qc6 here instead, threatening checkmate. It can be stopped, but considering he only had a minute left on his clock, I could maybe have lucked out. ",
        "28. Rdf1": "Trying a few more things.",
        "28... Qd4": "Making it pretty impossible for him not to trade. There are also ideas of Qxd3 if he allows it so he's better of trading.",
        "29. Qxd4 Bxd4 30. Rab1": "With the ideas of maybe promoting the pawn, but he can't ever push his pawn to a7 because of my bishop though.",
        "30... Rfb8": "Offering a trade to try and speed this up.",
        "31. Nf3 Bxf3 32. gxf3": "Rxf3 loses so gxf3 is correct. He still has 1 minute on his clock due to time increments.",
        "32... Rxb1 33. Rxb1 Kg7": "And a draw is finally proposed by my opponent as he couldn't find a winning plan anymore. Being exhausted by this fast paced half an hour and not seeing a winning plan I accept. My opponent seemed frustrated as he muttered to himself that he thought he had a forced checkmate with saccing the knight on h7. At this point I don't really care anymore, being satisfied with my draw. I'm pretty sure there were a lot of inaccuracies in this game, but given the many threats White had I think this result is fair. With this I'm currently 1.5/4 which isn't bad considering 90% of all players competing are higher rated then myself, but there's still 5 matches to play. My next opponent is another 1800 elo player ( the 3th one so far ) and seems to play the old benoni. It'll be interesting to tackle the beast that the benoni is."
    },
    "url": "https://gameknot.com/annotation.pl/calm-before-the-storm?gm=59237",
    "gameName": "Calm before the storm",
    "players": "Laporte Erik (1659F) vs. Goris Jeremy (1369N)",
    "opening": "Sicilian defence (B44)"
}