{
    "moves": {
        "1. e4": "After an uninspiring start, this game really came to life at move 13.",
        "1... c5 2. Bc4 Nc6 3. Nf3 Nf6 4. Ng5": "White's attack is premature.  4. d3 or 4. Nc3 is simpler, although it offers little hope of immediate advantage. ",
        "4... e6 5. Nc3 h6 6. Nf3": "Already White is no better than equal, although without open lines on which to develop, Black's task is far from easy. ",
        "6... d5": "The simplest method - open the centre and grab as much space as possible. ",
        "7. exd5 exd5 8. Bb5 d4": "Black grabs space before White can castle.  Despite the option being open to him (technically) as early as move 4, he never achieves it. ",
        "9. Ne2 Bd6 10. Bc4": "10. d3 is more obvious, although Black has more space and the prospect of queenside expansion.",
        "10... O-O 11. a3": "Again, this is insipid. ",
        "11... Bg4": "I toyed with Bf5, but the pin on the d1-h5 diagonal intrigued me.  I was well aware that I might have to sacrifice on g4 at some point, but that's the beauty of on-line chess.",
        "12. d3 Re8": "12. ... Bxf3 ruins the pawn structure, but Black will be on for a long grind.  He's well ahead in development and space, so it's time for an attack.",
        "13. h3 Bh5": "13. ... Bxf3 gives Black a clear position advantage but the open g-file might come back to haunt him.  I was already looking at the following combination. ",
        "14. g4 Nxg4 15. hxg4 Bxg4": "With pressure on f3, e2 and d1, the bishop is a beauty.",
        "16. Nfg1": "Ugly, but what else is there? Black has huge compensation for his investment. ",
        "16... Ne5": "?!  In my analysis, I'd looked at 16. ... Qf6 17. Bd5 Re5 with the threat of Rae8 but somewhere between brain and keyboard, I transposed moves and had to get creative. ",
        "17. Bd5": "The well-travelled bishop might yet be White's saviour. If he can play 18. f3, he might even choose to develop with Bxh6, just to give himself the chance to 0-0-0 away from the attack.  ",
        "17... Qf6": "Probably the only way to continue the attack at this stage, particularly given that I should have played it a move earlier. ",
        "18. Bf4": "I think White was pinning his hopes on this move.  If he can play Qd2, then everything holds (just about) and he might be able to 0-0-0 and counter-attack on the kingside.  Black has other ideas. ",
        "18... Qxf4": "Come on, you've got to give it an exclamation mark, even if it is obvious with hindsight.  The queen is soon recovered, although Black still has to take care.\r\n18. ... Nf3+ 19. Bxf3 (19. Kf1?? Nxg1) allows White some breathing space, but 19. Nxf3 is even stronger: 19 ... Bxf3 20. Bxf3 Qxf4 21. Bxb7 Rab8 22. Be4 is winning for White. \r\n18. ... Nxd3+ is not as good as the game line. White can play 19. Qxd3 and Kf1 or 0-0-0 if he gets the chance and the attack starts to fade, although Black still has some compensation. ",
        "19. Nxf4 Nxd3+": "And again!  Simply taking on d1 achieves very little, but with another bold move, White's position is stormed through the front gate. \r\n",
        "20. Kf1": "20. Kd2 is better, keeping the queenside pawns under control, but you can understand why White thought f1 was safer.  20. Kd2 Bxd1 21. Nxd3 Bg4 22. Bxb7 Rab8 23. Bf3 Bf5 gives reasonably good compensation for Black. ",
        "20... Bxd1 21. Nxd3 Bxc2": "Somehow I now have 4 pawns for the piece, together with a bishop pair and a lead in development. ",
        "22. Ne1 Ba4 23. Bxb7": "Opening the b-file can hardly help White, but it is hard to see what else he can try.",
        "23... Rab8 24. Bd5 Rxb2": "13 moves after the attack on the g4-d1 diagonal, Black transfers his attention to the f2 square.",
        "25. Ngf3 Bb5+ 26. Kg1 Ree2": "26 moves into the game and White is yet to move his rooks, has managed to develop his knights to e1 and f3 and managed one move combined with his queen and dark-squared bishop.  The end is swift. ",
        "27. Rh5 Rexf2 28. Rf5 Rf1#": "Akin to beating the keeper at the near post, a pretty finish to an attack that I'm pretty pleased with."
    },
    "url": "https://gameknot.com/annotation.pl/cameroon?gm=25180",
    "gameName": "Cameroon",
    "players": "etame (1595) vs. dsb13 (1636)",
    "opening": "Sicilian defence (B20)"
}