{
    "moves": {
        "1. d4": "Yo siempre d4.",
        "1... Nf6 2. c4 e6 3. Nc3 Bb4 4. e3": "Justo la apertura que había repasado en mi clase de esa semana. Algo así da mucha confianza.",
        "4... O-O 5. Bd3 d5 6. cxd5": "Primer error de concepto: le doy vida a su alfil malo si retoma de peón.",
        "6... Nxd5": "Por suerte para mí lo hace de caballo lo que me da ventaja.",
        "7. Nge2": "Sigo con mi desarrollo normal.",
        "7... Nc6": "Ésta jugada me pareció flojilla y me dio más confianza aún.",
        "8. O-O e5": "Oh, esto no lo esperaba.",
        "9. a3": "A ver qué hace este alfil.",
        "9... Bxc3": "¡Gracias!",
        "10. bxc3 Re8": "Aquí debería haber olido el peligro... (amenaza cerrar el centro y yo tengo ahora pareja de alfiles).",
        "11. Bd2": "Jugada mala y pasiva. Debería haber evitado 11...e4 jugando Dc2 o hasta Cg3.",
        "11... e4": "Grrr. ¿Ahora qué?",
        "12. Bb5": "Esta jugada es mala. Debería haber jugado Ac2 por concepto (mantenerme en la diagonal que he elegido) e intentar atacar e4 más adelante. Sin embargo, como estaba tan positivo y harto de que me dijeran que me quedo siempre atrás me fui para adelante ya que al menos clavaba el caballo...",
        "12... Rb8": "Bueno, no pasa nada.",
        "13. c4": "Esta jugada la hice pensando en hacer después d5 creyendo que ganaba el caballo clavado en c6...",
        "13... Nde7": "Pero ahora me di cuenta de que no valía así que...",
        "14. Rb1": "Bueno, luchemos por la columna semiabierta.",
        "14... Bd7 15. Qc2": "Y pongámosle presión a e4.",
        "15... Nf5 16. Nc3": "Ésta la hice pensando en Cd5 a la siguiente si ahora defendía el peón con la dama...",
        "16... Qe7": "Cosa que hizo.",
        "17. Nd5": "Allá voy. Ahora amenazo a la dama y a c7 con lo que si vuelve a d8, pensé, no sé si tendré algo pero él está muy pasivo.",
        "17... Qg5": "¡Pero se fue a g5! Vale, sacrifica c7 y va a por el mate pero pensé que lo defendía fácil con g3 y me daba tiempo a volver hasta Cf4 (sin ver que su Cf3+ era mortal). Así, mi razonamiento fue: yo como, él mueve la torre atacada de e8 y yo vuelvo tranquilamente a f4 a tiempo.",
        "18. Nxc7": "Ahora es mate en nueve para el negro según mi ordenador, empezando por 18... Ch4 19 g3 Cf3+ supongo...",
        "18... Re7": "Pero por suerte para mí hace lo que yo había previsto.",
        "19. Nd5": "Y atacando de nuevo la torre me da tiempo a volver.",
        "19... Re6 20. Nf4": "Y ahora mi caballo defiende todo de maravilla.",
        "20... Rh6 21. Qxe4": "Y de paso me regala otro peón centralizando la dama.",
        "21... a6": "Con dos peones de ventaja ni me lo pensé: a cambiar. Es un error porque quedamos con alfiles de distinto color lo que es darle opciones de tablas si algo va mal.",
        "22. Bxc6 Re8": "Ups. Aquí sin razón aparente empecé a jugar rápido e hice la peor jugada posible.",
        "23. Qd5": "Ay. Infeliz de mí hice esta jugada sin pensar. Me dije: ahora ataco el alfil con dos piezas y me lo gano...",
        "23... Bxc6": "Pero no, claro. Y ahora sí que tengo un problema: el alfil apunta a mi punto débil en g2. Pensé hasta en hacer Ch3 intentando cambiar damas, pero no quería quitar el caballo de f4, así que...",
        "24. Qc5": "A ver qué pasa ahora. La cosa no llega a mate pero con algún sacrificio por ahí seguramente me pueda hacer mucho daño...",
        "24... Ree6": "No se puede comer esta torre por que sería mate en g2 pero, mira tú por dónde, ahora puedo cerrar la diagonal y dar un doble.",
        "25. d5": "¡Toma ya!",
        "25... Reg6": "¿Me como la torre o el alfil?",
        "26. dxc6": "El alfil y así amenazo coronar con mate.",
        "26... Qh4 27. h3": "Única, aunque por un instante pensé que sacrificando la dama daba mate. Suerte que vi enseguida que no porque podía retomar con la torre.",
        "27... Qxh3": "¿Y esto? ¿Tendrá mate forzado? Creo que no, que se dejó llevar por el que yo no podía retomar de peón.",
        "28. Nxh3": "¡Pero sí de caballo! Adiós partida.",
        "28... Rxh3 29. Qxf5": "Cambio caballos y amenazo mate.",
        "29... Rh4": "Pero él sólo ve que amenazo la torre, así que...",
        "30. Qc8#": "... fin de la historia."
    },
    "url": "https://gameknot.com/annotation.pl/campeonato-regional-de-murcia-por-equipos-de-clubes-2-divisi-n-int-totana-chess-club-b-vs-c-a-lorca-alblanca-totana?gm=56873",
    "gameName": "Campeonato Regional de Murcia por Equipos de Clubes. 2ª División. Int. Totana Chess Club B vs C.A. Lorca Alblanca, Totana",
    "players": "Julián Martínez Molina  vs. Ricardo Gómez Hernández ",
    "opening": "Nimzo-Indian (E48), 4.e3 O-O, 5.Bd3 d5"
}