{
    "moves": {
        "1. e4 e6 2. d4": "The french defence it is good that Locvim played to his strenghts. However, the line that he chooses suffers from lack of counter attacking chances and is only good for a draw. This can be problematic for locvim because closed positions are tougher to play. In game we talked about the importance of patience as black to wait for white to over commit. However, it is black who get impatient a tries to make something happen. \r\n\r\nIn this game Locvim did several things right:\r\n1. He keep the centre closed for as long as possible\r\n2. he exchanged his pieces for white's major attacking pieces, Thus neutralizing white's ablility to mount an attack. \r\n\r\nIn the end Locvim could ahve easily earned a draw had he kept following #2",
        "2... d5 3. e5": "This thrust gives white an enduring edge in space. The main idea of the french defence is to lure the e pawn to e5 where he then goes about proving that this pawn is overextended here. ",
        "3... Nd7": "In game I talked about how 3. ...C5 is best IMO for black here. But this move is fine for black except it leads to a very passive game for black. Locvim played to his strenghts and preferred to play defensively. \n\nthe trade off this move is that Black will have difficulty mounting an counter attack and developing the LSB. The major criticism of the french is that he can have difficulty developing the LSB playing ...Nd7 makes that task of developing the bishop twice as hard. In the end, black is almost forced to play ...b6 and Bb7 in order to break life to the bishop. \n\n",
        "4. Nf3 a6": "!? I never liked this move if it is not provoked because it creates unnecessary weakness and is a bit of a tempo waster. Which for Locvim who likes to play defensively is a big deal because in defending it is imperative that you have time to make the move you want. ",
        "5. Be3": "supproting the weak point in the centre",
        "5... c5": "a very good move",
        "6. Nc3 cxd4 7. Bxd4": "Nxd4 drops the e pawn. this exchange is good for black because the bishop is in an awkward spot and the e-pawn will now be in danger of falling. Thus, it will need constant defending. ",
        "7... Bc5": "another good move that continues to weaken e5. ",
        "8. Bxc5 Nxc5 9. Nd4": "Qd4 would have been more active. ",
        "9... Qc7": "a great square for the queen since it defends c5 and attacks e5",
        "10. f4": "Defending e5. ",
        "10... Ne7 11. Qd2": "with the absence of the DSB I need to put the queen on the dark squares in order to compensate. ",
        "11... Bd7 12. Be2 g6": "? Nc6 is better by far",
        "13. O-O O-O 14. Qe3 b5": "It is at this point in the game where Locvim begins to loss his way abit. had he continued with Nc6 everything would be in control and he would have breezed to an easy draw. The text move however allowes me to open lines which serves me better. ",
        "15. a3 Na4": "? this was black's last chance to equalize with ...Nc6",
        "16. Nxa4 bxa4 17. b4": "gaining space",
        "17... axb3 e.p. 18. cxb3": "Black is still ok but all the attacking chances belong to white. ",
        "18... Kg7": "?? unnecessary move that wastes tempo. Qb7 to attack b3",
        "19. Rfc1 Nc6": "?? ...Qby is a must. The queen must concede the c-file. This gives two minor pieces for the rook\n",
        "20. Rxc6 Bxc6 21. Rc1 Qe7 22. Rxc6 Qxa3 23. f5 exf5 24. e6 Qe7 25. Qc3 Kg8 26. Bf3 fxe6 27. Nxe6 Qa7+ 28. Kf1 Rfd8 29. Rc7 d4 30. Qc4 Qb6 31. Ng5+ Kh8 32. Rxh7#": ""
    },
    "url": "https://gameknot.com/annotation.pl/canadain-bacon-club-mini-tournament-vi?gm=36707",
    "gameName": "Canadain Bacon Club mini-tournament VI",
    "players": "elyhim (2235) vs. locvim (1231)",
    "opening": "French (C02), advance variation"
}