{
    "moves": {
        "1. e4": "In the following game I hope to teach you how to execute an effective attack. After this game you shold know how to:\r\n1. Identify the key elements that you need to have present in order to launch a successful attack\r\n2. How to execute a successful attack?\r\n",
        "1... d5": "This is known as the counter gambit openning. The advantage from black's prespective is that he gains rapid development and good use of open lines. ",
        "2. e5": "very good! Bobervig plays to his strenghts and avoids playing into something he does not know.",
        "2... Bf5 3. h3": "?? not so good Bobervig should have continued to develop pieces toward the centre. The game of chess is in many ways about time. In chess books this is often referred to as \"initative\" or \"tempo\". What this means is that the one who is ahead in development or ahead by a move. \r\n\r\nto remember this idea, think of is as if Bobervig just forfeited his turn. H3 has no value as a move because it does not threaten anything, develop a piece or challenge for the centre. Therefore, he might as well have waved his right to play and allow black to play two moves to his one. \r\n\r\nFor the rest of this game bobervig is essentailly playing behind by two moves.",
        "3... e6": "I am not in the business of slaughtering but prompting growth. Therefore I play an inferior move to allow bobervig a chance to play things through. A better move is Nc6 develop a knight or C5 adding to my control of the center. However, 3. ...C5!? is risker becaue it invites 4. Bb5+\r\n\r\nHere is a question for you? If black plays 3. ...C5!? and white replies with 4. Bb5+ what should be black's next move?",
        "4. a3 Nd7": "Playing Nd7 here is a classical example of simple attacking dynamics \r\n\r\nQ.what is an attack?\r\nA. An attack is the threat of winning material or checkmate. Most successful attacks begin with the simple plan of winning material i.e. a pawn. From there it builds to gaining control of open lines, superior space, winning minor pieces, winning major pieces and then finally winning the king. The number one reason for failed attacks is over estimating or going for more than what is possible. For example the odds of you winning a rook(major piece) within the first 20 moves is very rare. So set the goal of winning a pawn, as your first attacking objective. \r\n\r\nIn this position I am threatening to win a pawn with ...Nxe5. So white is forced to defend the threat in order to keep the balance. ",
        "5. d4": "An ok move that supports e5 but in my opinon Nf3 is better. ",
        "5... c5": "!! This is a great move that puts alot of pressure on white's centre. \r\n\r\nThe attacking dyanmic at play here is that black is threatening to win space. ",
        "6. c3": "?? This is wrong on several fronts\r\n1. it hinders the white knight by denying it.s natural developing sqaure\r\n2. too many pawn moves, white need to get his pieces out. Does he expect to win the game with just his pawns?\r\nBetter is Nf3 which defense the centre and develops a piece.\r\n\r\nIf after 6.Nf3 is 6. ...cxd4 good to play for black, give a supporting line to support your answer?",
        "6... Qc7": "...Qc7 is following simple attacking dyanmics. Also please note the influence that the e5 pawn has had on my king side. My kingside is completely undeveloped. So my goal as black is to attack e5 by undermining it with cxd4 and create some space to place my king side pieces. The idea of queen side castling is too risky because I have already weakened c7,g7,and h7 by playing ...c5. ",
        "7. Bb5": "good bobervig is finally moving his peices out! this is a great pin that slows black's developmet down a bit.",
        "7... Ne7": "Looking to find a home on c6. From there is puts a lot of pressure on d4",
        "8. Nf3": "very good develops a peice and supports the centre. ",
        "8... Nc6 9. b4": "?? there is no way that this will work because half his army is still at home. The rule is do not attack until you have completed your development. \r\n\r\nThis is a great place to talk about the KEY ELEMENTS of a successful attack.\r\n\r\n1. Piece superiority in the area of attack\r\n2. Space advantage in the area of attack\r\n3. control of open lines in the area of attack\r\n4. Harmonious communication between pieces in the general area of attack\r\n\r\nIn this case white plays the attacking move 9.b4. For him none of the key elements exist. However, the situation is the exact opposite for black!\r\n\r\n1. Black has piece superiority-3 pieces to white 1 that directly influence the c5 sqaure\r\n2. Black clearly has a space advantage on the queen side\r\n3. there is no open lines in the area so this is equal for both sides( this is the only thing that black does not have)\r\n4. Black's pieces are in harmony- Black has 4 active pieces in the area of attack verses white's 1 piece. \r\n\r\nSo if black has 3 out the 4 conditions then...",
        "9... cxd4": "...cxd4! works because it creates open lines that meet the final key element of a successful attack. Control all open lines in the area of attack.",
        "10. cxd4": "with 9. ...cxd4 I have weakened white's centre, openned the c-file for use meeting the final condition for an attack. ",
        "10... a5": "BLack launches into his attack by threatening to win a pawn. \r\n\r\nThis leads us to the next phase: How does one execute a successful attack. Here is the step by step process:\r\n1. Create threats\r\n2. Increase your space advantage by marshalling all or most of your pieces to attack squares that force your opponent to push pawns up to create weaknesses\r\n3. Restrict the mobilty and influence of your opponents pieces\r\n4. force through a breakthrough that usaully results in a mating attack on the king or massive lost of material. \r\n\r\nIn this position I execute the first step in the attacking plan. My threat is to win a pawn via ...axb4",
        "11. Bxc6": "good defending move by white. When being attack it is a good plan to exhange key attacking pieces. Here white deals with the threat of black winning a pawn by removing a key attacker of b4. ",
        "11... bxc6": "not ...Qxc6 do you know why?",
        "12. bxa5 Qxa5+": "White has perried the threat of ...axb4 but now black has just executed step 2 of the attacking plan. Increase your space advantage in the area of attack and iincrease the influence of your pieces in the area of attack",
        "13. Nbd2": "dealing withthe the check but maybe Bd2 was better as it threatens to win the black queen.",
        "13... Qa6": " A move that supports the execution step 3 in the attack plan. Restrict the mobility and influence of your opponent's pieces. Here black that prevents white from castling and developing his rook. ",
        "14. Bb2 Be7": "Increase the influence of the bishop and marshall black's last piece into the fight. ",
        "15. Qe2 Bd3": "...Bd3! This effectively divides white in half and drives a terrible wedge into his position. With this move black has all but completely executed the third step in attacking. Increase your space advantage and restrict the mobility and influence of your opponents pieces. ",
        "16. Qe3 c5": "Black finally gets in c7-c5 and now turns his attention to step 4. Forces a breakthrough that usaully results in direct lines to the king or the loss of massive material. ",
        "17. Rc1": "good move that prevents cxd4. If black plays ...cxd4? how does white play to equalize?",
        "17... c4": "! This seals everything up and now white is suffering from a wedgy, lol",
        "18. Rc3": "white has to do eveything he can to stop black from invading on the queen side. However, his beginning moves have now come to haunt him as there is no way he can castle or mobilize his piece in time. It is like as if black is playing two moves and ahead now. ",
        "18... Rb8": "the final breakthrough moment has in textbook attacking style\r\n\r\n1. Create threats\r\n2. Increase your space advantage by marshalling all or most of your pieces to attacking squares that force your opponent to push pawns up to create weaknesses\r\n3. Restrict the mobilty and influence of your opponents pieces\r\n4. force through a breakthrough that usaully results in open line directly to the king or massive lost of material. \r\n\r\nI have accomplished steps 1-3 and now I have to work on step 4 which in my opinoin is always the toughest because it requires patience and planning. ",
        "19. Bc1 O-O": "Once you have accomplished steps 1-3. You can just simple build up your forces without fear. My playing style has in the past been described as being like a boa constrictor ",
        "20. Ng1": "as you can see white is desperating trying to reorganize his pieces. He is doign well here because he is following strong defending principles. \r\n\r\n1. Avoid weaknesses and safegaurd the king. \r\n2. harmonize the communication of your pieces so that they are all supporting each other and covering all holes in your position. \r\n3. exchange pieces not pawns! exchange to remove key attacker. This results in great mobility for your remaining pieces.\r\n4. Blockaid by putting your pieces in front of advanced pawns, fixate the centre and make it static\r\n\r\nSo why is Ng1 a good move...\r\n1. It goes along way to harmonizing the communication of his pieces\r\n2. it avoids creating futher weaknesses and allows white to castle out of immedaite danger\r\n3. results in greater mobility for his pieces",
        "20... Rfc8": "rooks belong behind advanced pawns",
        "21. Ne2": "It has taken two moves but now white can finally castle. For the moment white is defending very well has every hole covered. ",
        "21... Nb6": "Black's attack has stalled so as often is the case you have to redo the 4 step process. Here I am increasing my space advantage and increasing the influence of my pieces. ",
        "22. O-O": "good move as it safegaurds the king. ",
        "22... Na4": "This is the acheivement of the breakthrough moment which is the final step in the 4 point attacking forumla. White is finally forced into a lose-lose situation where he can not avoid massive loss of material. ",
        "23. Rxd3": "White is forced to give up a rook!",
        "23... cxd3": "Oh beautiful, beautiful pawn! Further restriction",
        "24. Nf4 Bg5": "protecting the pawn and restrict white. As a result of the piece exchange white's pieces ahve become more active. So in order to tame the beast I have to tighten the skrews againt. ",
        "25. Qxd3": "in defending it is a situation where you are behind in material it is adived to avoid exchanges. This is because as pieces are removed from the board the material advantage increases in strength and influence. ",
        "25... Qxd3 26. Nxd3 Bxd2": "Therefore, Black in order to increase his material advantage forces the exchange of pieces and simplifies the positon. this process is like boiling the game down to its essense which is clearly  in black's favor. ",
        "27. Bxd2 Rc2 28. Bb4 Nc3 29. Bc5 Rb1 30. Rxb1 Nxb1 31. Bb4 Rc4 32. Bc5 Nd2 33. Nb2 Rc1+ 34. Kh2 Nb3": "forcing the exchange of another peice. ",
        "35. a4 Nxc5 36. dxc5 Rxc5": "with the vast majority of the pieces gone the picture become very clear. It is a pawn race but black will win because white is behind in moves because he has to make at least two moves in order to advance his pawn. ",
        "37. f4 d4": "elementray dear watson!\r\n\r\npush the pawn and support it with the rook ",
        "38. g3 Rc2+ 39. Kg1 Rxb2 40. Kf1 d3 41. Ke1 Kf8": "good game Bobervig"
    },
    "url": "https://gameknot.com/annotation.pl/canadain-bacon-mini-tournament-i?gm=34401",
    "gameName": "Canadain Bacon mini-tournament I",
    "players": "bobervig (1591) vs. elyhim (2212)",
    "opening": "Scandinavian (centre counter) defence (B01)"
}