{
    "moves": {
        "1. e4": "This game was the second home game of my new team \"Carden Arms\". As you will see, I was very lucky to get a draw against a player rated lower than me. Part of the problem nay have been that my best player dropped out in the afternoon, so I had spent the hour or so before the match desperately trying to get an extra player. I also had a technical problem with my clock - more about that later!",
        "1... c5": "So I reply with my usual, the Sicilian Defence",
        "2. f4": "Nowadays this is slightly unusual, but perfectly playable. The Grand Prix attack. In the 1970s this was one of the most common replies to the Sicilian.",
        "2... d5": "This move is the main reason why it is no longer so popular.",
        "3. e5": "This is probably not best, releasing the tension too early. Nc3 or taking the pawn on d5 are more common and better. Nf3 is an interesting gambit, much in vogue at the moment, but I don't think it is really any good.",
        "3... Bf5": "So I develop. I plan to go into a sort of advanced variation of the French defence, where my white squared bishop, instead of being inactive behind my pawn chain on c8 or d7 is active outside my pawn chain.",
        "4. Nf3": "So he does the logical developing move.",
        "4... e6": "And I continue with my plan.",
        "5. Be2": "He develops.",
        "5... Nc6": "And I do the logical developing move.",
        "6. O-O": "He castles. In the Gameknot database of over-the-board games, there are 2 games. a6 led to a win for white in Dubansky, Bohuslav (2165) vs. Sabol, Marian (2310) and h5 led to a win for black in Sulejmanova, Ava (2241) vs. Gordon, Viktoria (2149). I was looking at this position, and thinking really both my Bf8 and Ng8 want to go to e7. What about playing c4, allowing my Bf8 to go to c5 with check, then Ng8 can go to e7.",
        "6... c4": "This has been played in a Gameknot mach before, woolfighter (1562) vs. doktorn (1781), which continued 7. d4 cxd3 e.p. 8. cxd3 Bc5+ 9. Kh1 Nge7 10. Nc3 O-O 11. b3 Nd4 12. Nxd4 Bxd4 13. Bb2 Rc8 14. Na4 Bxb2 15. Nxb2 b5 16. d4 Qb6 17. Qd2 Rc2 18. Qe3 Rxb2 19. g4 Be4+ 20. Kg1 Rc8 21. f5 Rcc2 22. f6 Rxe2 and white resigns.\r\n ",
        "7. d4": "As in woolfighter (1562) vs. doktorn (1781), ",
        "7... cxd3 e.p.": "I want the c5 square for my Bf8",
        "8. Bxd3": "This is probably an improvement on woolfighter (1562) vs. doktorn (1781), ",
        "8... Bc5+": "So I throw in the check",
        "9. Kh1": "King moves",
        "9... Nh6": "Now I was dreaming of Ng4 threatening Nf2 picking up the exchange.",
        "10. Nc3": "He develops.",
        "10... a6": "I stop his knight coming to b5",
        "11. Ne2": "I presume is idea was to play c3 and put a knight on d4.",
        "11... Ng4": "This is a blunder. I was thinking that he can't take my bishop on f5 as I reply with Nf with check. Of course, after doing the move I realised that that 12. Bxf5 Nf2+ 13. Rxf2 Bxf2 14. Bd3 and white has bishop and knight for rook, and a clear advantage. It was at this point, after I played Ng4, I pressed my clock and realised that my clock had not stopped and was ticking away alongside his. I had to drive a couple of miles back to Malpas to borrow a friend's clock.\r\n",
        "12. Bxf5": "So he just takes",
        "12... exf5": "I take back",
        "13. Ned4": "He continues with his plan.",
        "13... Qb6": "I hit his knight.",
        "14. c3": "He protects it.",
        "14... O-O-O": "I castle queen-side. I thought that I have positional weaknesses. My d pawn is isolated, my f pawns are doubled. My only chance is to go for a tactical melee, where positional factors are less important. What is your view dear reader?",
        "15. h3": "He hits my knight",
        "15... h5": "Instead of retreating, I try this. Of course, if he takes the knight, I take back with the h pawn and he loses his Nf3. Unfortunately he doesn't have to take.",
        "16. b4": "He throws up his queen-side pawns, which is usually the best course of action if players have castled on opposite sides.",
        "16... Be7": "So I retreat my bishop.",
        "17. a4": "He advances again",
        "17... f6": "I hit his centre.",
        "18. a5": "He hits my queen.",
        "18... Qa7": "Queen retreats",
        "19. Nxc6": "He takes my knight, also hitting Qa7 and Rd8.",
        "19... bxc6": "So I take back.",
        "20. Nd4": "He blocks the a7-g1 diagonal again",
        "20... fxe5": "I take his central pawn",
        "21. Nxc6": "He takes.",
        "21... Qf2": "This is what I had been planning the last few moves. I was hoping he would let me play Qg3 at some stage, such as 22. Nxd8 Qg3 23. hxg4 hxg4+ 24. Kg1 Rh2, he protects g2 and then I play Qh4 followed by Ra1 mate. The big question is, \"Is Qf2 actually sound?\" Your comments would be appreciated!",
        "22. Nxe7+": "He takes my bishop with check. Now King to b7 or d7 allows Qxd5 with check and Kc7 allows Nxd5 with check, so I try the one remaining square.",
        "22... Kb8": "Now Nxf5 prevents Qg3, but black has R(d)-f8 (the other rook is needed on the h file), and after say 23. Nxf5 Rdf8 24. Ba3 Rxf5 25. Rxf2 Nxf2+ 26. Kg1 Nxd1 27. Rxd1 Rxf4 28. Rxd5 black has a slight material advantage. He wisely tries something else.\r\n",
        "23. Nc6+": "He throws in a check",
        "23... Kc7": "The king comes up. If now 24. Nxd8 Qg3 25. hxg4 hxg4+ 26. Kg1 Rh2 followed by Qh4 and Rh1 mate. So he does something else. \r\n",
        "24. Rxf2": "He takes.",
        "24... Nxf2+": "I take back",
        "25. Kg1": "King comes across",
        "25... Nxd1": "I take his queen.",
        "26. Nxd8": "He takes my rook.",
        "26... Rxd8": "I take his knight.",
        "27. fxe5": "He takes my pawn.",
        "27... Nxc3": "I take his - and remarkably material is even!",
        "28. Bb2": "He hits my knight. I was thinking here of Ne2 check, followed by Nf4 and Nd6, firmly blockading his passed pawn on e5. This may well have been better than what I played.",
        "28... Ne4": "I thought it was nice and centrally placed here.",
        "29. Bd4": "He centralises his bishop, with a little threat of Bb6 check winning the exchange. Rc8 is probably my best move, I make another mistake.",
        "29... Kd7": "I am hoping to play Rc8",
        "30. Rc1": "But now I find Rc8 is met by e6 check which wins for white.",
        "30... g5": "So I move a pawn up",
        "31. Bb6": "He hits my rook. I still can't play Rc8",
        "31... Re8": "So I hit his pawn.",
        "32. Rc7+": "He throws in a check",
        "32... Ke6": "This is forced",
        "33. Bd4": "He protects his pawn.",
        "33... Ra8": "I played this and offered a draw, which I was delighted when he accepted. White now has an edge, but can white win? If so what is his winning plan? Your comments would be welcome! Many thanks for reading, please rate my annotation. Until next time, dear reader!"
    },
    "url": "https://gameknot.com/annotation.pl/carden-armsvchester6-chesterleague?gm=47065",
    "gameName": "Carden ArmsvChester6,ChesterLeague",
    "players": "Clive Tickell (EFC144) vs. CharlesHiggie (ECF162)",
    "opening": "Sicilian (B21), Grand Prix attack"
}