{
    "moves": {
        "1. e4": "Today's entertainment is a fun game I completed recently against odisant, who has been putting up steadily tougher resistance in our games, despite the discrepancy in our levels of experience. This game is no exception, with opportunities to learn from the mistakes of both sides. I make a questionable positional decision in the hopes of making the game 'interesting', and it sure does work!\n",
        "1... e5 2. f4 Nc6": "osidant declines my King's Gambit, choosing instead to defend his e-pawn.\n",
        "3. Nf3": "This Knight plugs the hole in White's defenses, and asks of Black whether he's truly ready to commit to a fight over the defense of e4.\n",
        "3... Nf6": "By far more popular choices are 3...exf4 (accepting the gambit a move late) or 3...f5. The text gives White a chance to begin a Knight hunt!\n",
        "4. fxe5 Nxe4 5. d3": "Chasing the Knight. This seems to block in White's light Bishop, but since the Black Knight only has one refuge--c5--this pawn will get another chance to advance with tempo, so the momentary blockage is acceptable.\n",
        "5... Nc5 6. d4 Ne4": "With no pawns left to kick it away, e4 is now a relatively safe haven for Black's Knight--at least for the moment. If White attacks it with a piece, e.g. 7.Bd3, Black can respond with ...d5, significantly solidifying his position.\n",
        "7. d5": "...So White kicks the other Knight, while blocking the d5 square! \n",
        "7... Nb4": "? This Knight probably should have retreated to e7 or even b8. Now White can force Black's Knights practically off the board, after all their movement, and be left with a great position, e.g. 8.a3 Na6 9.Qe2 Nec5 10.Nc3 (covering the a4 square and threatening to trap the Knight with a pawn thrust) 10...Nb8 (vacating a6 for the other Knight's retreat) 11.b4 Nca6, leaving Black with one developed piece--a Knight on a6--and White with the initiative, an advanced center, and a huge lead in development.\n",
        "8. a3 Nxd5": "?! Then again, even all that might have been preferable to just giving up the Knight immediately. On the plus side, this move does have the benefit of breaking up White's pawn center.\n",
        "9. Qxd5 Nc5 10. b4": "White continues to chase Knights with pawn moves. It's getting a little frivolous now; probably development was better. The computer suggests 10.Bc4, threatening mate on f7 and forcing Black to move his Knight yet again, to interpose on e6.\n",
        "10... c6": "Black has had enough, and starts a chase of his own.\n",
        "11. Qc4": "Perhaps 11.Qd1 would have been preferable, over the coming shenanigans. Now it's Black's turn to gain some space with pawn moves while harassing a White piece.\n",
        "11... b5 12. Qf4 Ne6 13. Qf5 g6 14. Qe4": "The White Queen has finally landed on a safe space, after much running around. White's developmental and spatial edges are slightly diminished now, and his isolated e-pawn feels weak.\n",
        "14... Bg7": "Black hits the weak pawn, pinned to the Ra1, but gives up a pawn of his own in the process. Probably 14...Rb8 was better.\n",
        "15. Bxb5": "Black cannot recapture, since the Rook on a8 would hang.\n",
        "15... Qb6": "Instead, he brings his own Queen to bear, threatening the intruding Bishop and denying White a safe castling place.\n",
        "16. Bd3 O-O 17. Nbd2": "This move serves two purposes: White is considering castling queenside, and this Knight wants is now poised to leap to c4 once ...d5 is no longer a threat. Of course, Black may simply play 17...d5 immediately, and he should. White probably would have been better off playing the awkward-looking 17.Ra2, to get out of the pin on the e-pawn.\n",
        "17... Ba6": "Black puts the pressure on, but this allows White to trade down. When behind, trading pieces is not usually such a good idea. Instead, 17...d5! forces the White Queen out of the center (as 18.exd5 e.p. leaves the Queen exposed to tactics down the open e-file) and gains Black some much-needed space.\n",
        "18. c4": "The idea is to 'prevent' ...d5, or answer it with c4-c5, but Black can just play it anyway. Better was 18.Bxa6 Qxa6 19.Bb2, but I wanted to keep things 'interesting'... well, I'll get my wish, all right...\n",
        "18... Rae8": "18...d5! was the right way to go here. With the White King stuck in the middle of the board on a half-open file, Black can thrust ahead with the d-pawn to break open the center, and therefor he absolutely should. \n",
        "19. Bb2": "? White continues to disregard Black's central dangers. ...d5! is still very strong here (as is ...f5!), and White probably should have just played 19.c5! to block the Black Queen's sight into the White Castle. But once again, I wanted to make it 'interesting'...\n",
        "19... c5": "Objectively not as strong as pushing the d- or f-pawns. However, perhaps my opponent was simply baiting me into a trap...\n",
        "20. O-O": "My response to the a7-g1 diagonal being momentarily closed is... to castle directly into the line of fire! There are worse moves, but there are certainly also better ones, 20.Qe3 looks promising, for instance.\n",
        "20... cxb4+": "Of course!\n",
        "21. Nd4": "? \"This is a good place for a Knight! I'll be able to get out of the pin eventually!\" Almost any alternative was better than this. Complications with this Knight positioning will haunt me for pretty much the rest of the game.\n",
        "21... Ng5": "I think 21...Nc5 was stronger, as here White could play 22.Qh4 and get out of danger while gaining time against the undefended Knight, whereas on c5, the Knight is not in danger, and also threatens White's Bishop on d3.\n",
        "22. Qd5": "? Oy vey. Not feeling like he's in trouble enough yet, White now tries to see if he can get his Queen trapped as well.\n",
        "22... Rxe5 23. Qxd7 Rd8": "The White pieces are all undefended and lined up on the d-file for Black's convenience. 23...bxa3 would have been a little more accurate, as White would have to give up the Bishop on b2 (24.Rxa3 Qxb2) or else lose endless piles of material down the d-file after 24.Bxa3?? Rd8 25.Qg4 Rxd4! 26.Qd1 Rxd3+! and so on.\n",
        "24. Qg4 Bc8": "24...bxa3 was good here, too.\n",
        "25. Qh4 Ne6": "25...bxa3 still was the best choice. The text allows White a move to breathe.\n",
        "26. Nd2b3": "White adds a defender to the hapless Nd4, and blocks the BQ's access to the Bishop.\n",
        "26... bxa3": "The right idea, but slightly too late, now that the Bishop is behind a guardian Knight.\n",
        "27. Rxa3 Rh5": "This is actually inaccurate, but I didn't realize it at the time--I thought White was just barely hanging on here, but the computer actually puts White at nearly +4, because of 28.Qe7! threatening f7 and supporting a c4-c5 advance to break the deadly pin.\n",
        "28. Qf2": "Sadly, I missed 28.Qe7! and instead went for a stab at f7 while breaking the pin (momentarily). Still, this position is full of poison.\n",
        "28... Rxd4": "?? This actually blunders into a tricky mating net; Black needed to play 28...Nxd4 instead. Can you spot the forced mate from here? It's nine moves long!\n",
        "29. Qxf7+": "The White Queen pounces!\n",
        "29... Kh8 30. Qe8+": "With no Rook on Black's back rank, the White Queen is free to run rampant.\n",
        "30... Nf8": "30...Bf8 held out longer: 30...Bf8 31.Bxd4+ Qxd4+ 32.Nxd4 Rf5 (blocking the f-file against Rxf8+) 33.Nxe6 (removing the defender) 33...h5 (giving the King room) 34.Bxf5 Bxe6 35.Qxf8+ Bg8 36.Bxg6 a5 (or anything) 37.Qf6#.\n",
        "31. Rxf8+ Bxf8 32. Qxf8#": "That's it! Thanks for reading; comments are appreciated!"
    },
    "url": "https://gameknot.com/annotation.pl/careful-what-you-wish-for?gm=55288",
    "gameName": "Careful What You Wish For",
    "players": "bwaa (1754) vs. odisant (1279)",
    "opening": "King's gambit (C30)"
}