{
    "moves": {
        "1. e4": "The essential observation from this annotation is based upon taking the initiative.  \r\n\r\nWhat we will see from this match is white avoiding a useful trade and forfeiting the initiative.  If you opt not to trade, and you move a piece out of attack arbitrarily, you lose time.  You sacrifice at least a move, which could be used to press the initiative, build your game, or enable a defense to be set up, and you might be sacrificing even more than that. ",
        "1... c6": "The following position comes from the Caro-Kann Defense, and how the not taking advantage of one move places you in great danger to a famous trap. \r\n\r\nThe Caro-Kann Defense is a common chess opening characterized by the moves: 1.e4 c6",
        "2. d4": "2. d4 ",
        "2... d5": "The usual continuation (position shown) is 2. d4 d5 followed by 3. Nc3, 3. Nd2, 3. exd5, or 3. e5 (the Advance Variation). \r\n\r\nThe Caro-Kann, like the Sicilian Defense and French Defense, is classified as a \"semi-open game\", but it is thought to be more solid and less dynamic than either of those openings. It often leads to good endgames for Black, which has the better pawn-structure.\r\n\r\nThe opening is named after the English player Horatio Caro and the Austrian Marcus Kann who analyzed the opening in 1886.",
        "3. Nc3": "The Classical or Traditional Variation is the most common way of handling the Caro-Kann Defense, \r\n\r\n3.Nc3 (or 3.Nd2) dxe4 \r\n4.Nxe4 Bf5 \r\n5.Ng3 Bg6 \r\n\r\nThis was long considered to represent best play for both sides in the Caro-Kann. White usually continues\r\n\r\n6.h4 h6 \r\n7.Nf3 Nd7 \r\n8.h5 Bh7 \r\n9.Bd3 Bxd3 \r\n10.Qxd3 \r\n\r\nAlthough White's pawn on h5 looks ready to attack, it can prove to be a real weakness in an endgame.",
        "3... dxe4": "Much of the Caro-Kann's reputation as a solid defense stems from this variation being so hard to crack. Black makes very few compromises in his pawn structure, and plays a timely c5 to contest the d4 square. Black has the options of castling queenside, castling kingside, and even leaving his king in the center. Should things proceed to an endgame, Black often stands well thanks to his solid pawn structure and kingside pawn majority.",
        "4. Nxe4": "4. Nxe4",
        "4... Nf6": "The \"true\" Exchange Variation begins with 4. Bd3, e.g. 4. . .Nc6 5 .c3 Nf6 6. Bf4 Bg4 7 .Qb3. White isn't thought to possess much of an advantage at the highest levels. \r\n\r\nAfter Nf6 White's knight is threatened, and the best way to cope with the threat is to exchange knights, when White maintains the initiative. ",
        "5. Ng3": "5. Ng3? \r\nAn interesting move, White's chooses to ignore the exchange and passes the tempo to Black. White falters to take the initiative.  Best is 5. Nxf6  exf3 (or gxf3) creating a double pawn on the F file, exf3 captures the white knight and opens the a3 f8 diagonal for Black's king bishop, gxf3 would create a double pawn on the F file as well but would hinder Blacks game with the lack of the defensive pawn if chose to castle king side.\r\n\r\nRemember do not allow the situation to stand if it lets your opponent control the exchange.",
        "5... h5": "The retreat of Whites knight 5. Ng3, though playable, enables Black to become aggressive.  A famous trap ensues with 5...h5.",
        "6. Bg5": "White decides to take advantage too late with Bg5 threatening Black's Knight at f6. White can take the pawn with the knight at h5 with protection from the queen.\r\n\r\nTrade to maintain the initiative, and do not retain pieces for subjective reasons if the position requires exchanges. ",
        "6... h4": "6...h4 Black pushes the pawn threatening the knight at g3, White decides to start the exchanges. ",
        "7. Bxf6": "7. Bxf6? \r\nBetter is 7. N3e2 with Black to follow with Qb6.  ",
        "7... hxg3": "7...hg3",
        "8. Be5": "White has now moved the bishop three times in a row, neglecting development of any other pieces. Black continues to push a single pawn down White's throat.  White looks now to get caught up in a feeding frenzy. 8. Be5 attacks Black's knight at b8 and the lone marching pawn.\r\nThe correct move here is 8. fx3 exf6.",
        "8... Rxh2": "8...Rxh2 ",
        "9. Rxh2": "White looks to even out the material with 9...gxh2 10. Bh2.  After the exchange neither White nor Black have any developed pieces.",
        "9... Qa5+": "9...Qa5  Black now has full control of the game.  ",
        "10. Qd2": "10. Qd2",
        "10... Qxe5+": "10...Qxe5 ! a great move. The elimination of White's bishop clears the way for the pushed pawn to take advantage of the march, White in check has no way of preventing this from happening. ",
        "11. dxe5": "11. dxe5",
        "11... gxh2": "Black now gets the queen back with interest.  White has an over extended pawn and no developed pieces. \r\n\r\nWhite's mistake by deciding to retreat the knight to g3 cleared the path for Black to win. Remember if you move, try to do so with a threat, so that your opponent can't build his game at your expense. \r\n\r\n\r\nTaken from \"The Chess Doctor\" by Bruce Pandolfini."
    },
    "url": "https://gameknot.com/annotation.pl/caro-kann-defense-a-lesson-of-initiative?gm=7030",
    "gameName": "Caro-Kann Defense - A Lesson Of Initiative",
    "players": "  vs.  ",
    "opening": "Caro-Kann (B15), Alekhine gambit"
}