{
    "moves": {
        "1. e4 c6 2. d4": "Center game",
        "2... d5 3. Nc3 dxe4 4. Nxe4 Bf5 5. Ng3 Bg6 6. h4": "I found this line funny.",
        "6... h6 7. h5 Bh7": "White develops",
        "8. Be3": "Now, white has to ocupate the open field.",
        "8... e6": "Black unblocks his DSB",
        "9. Nf3": "developping",
        "9... Nf6": "For white, the question is now where to castle ?\nThe queen side pawn structure is intact but most white pieces are on the kingside so that I choose to caste short (or maybe, not to castle at all).",
        "10. c3": "Advancing the kingside",
        "10... Be7": "Black will probably castle short.",
        "11. Bd3": "Menacing the kingside",
        "11... Bxd3": "Black chooss to trade (having little other choice anyway).",
        "12. Qxd3": "Queen aiming at the kingside",
        "12... Nbd7": "Developing but white occupates more space now.",
        "13. Rd1": "To prevent 13. ... Nc5 14. dxc5 Qxd3",
        "13... Nb6": "Not a very efficient move. 13. ... a5 or 13. ... b5 would have been better, I think.",
        "14. Qc2": "To prevent 14. ...Na4 and set the rook in direct opposition with the black queen.",
        "14... O-O": "King in safe. Both players are very powerfull on the king side, material is equal, white's pawn structure is weaker because of the h pawn, white controls the center, no open file. I have the impression that the position is almost equal.",
        "15. Ne5": "White attacks",
        "15... Nbd5": "Black contests the center",
        "16. Qd2": "To protect the DSB",
        "16... Nxe3 17. Qxe3": "Trading",
        "17... Nd5 18. Qe4": "Queen on the b1-h7 diagonal",
        "18... Bd6": "enabling the queen to come on g5",
        "19. O-O": "White finally opts to castle ",
        "19... Nf6": "menacing the queen",
        "20. Qf3": "The queen has to drawback and white is not very satisfied of the position because it's very equilibrated except the weak h pawn. But the knight and queen protects t.",
        "20... Qc7": "To attack the e knight.",
        "21. Rfe1": "To rotect the e knight - natural move.",
        "21... Rad8": "Rook on the half open file.",
        "22. Re3": "Preparing to double the roof on one of the half open files.",
        "22... Nd7": "To attack e5 with numeric superiority. The doubled rooks will be on the e file.",
        "23. Rde1": "It seems the obvious move to do.",
        "23... c5": "Black is on attack on the center. ",
        "24. Nxd7": "At this moment, white lauches a complex tactical plan. The knight trade has little importance in itself but it opens the e line and prevents black to take an initiative there for it menace the f rook so that black has to take now.",
        "24... Rxd7": "Qd5 was another candidate but the queen would not have be aimed anylonge at g3 and h3.",
        "25. d5": "White's plan was to fully open the e file which he already controls and is ready to pay the price for it.",
        "25... exd5 26. Nf5": "Everybody on attack !",
        "26... Bf4": "One stratege said : \"attack is the best defense\", but in this case, i's a mistake. Black probably oversaw the conséquences of the next move.",
        "27. Qg4": "Menacing mate",
        "27... Bg5": "If 27. ... g6   hxg6 28 hxg6 and white is in serious trouble.\nIf 27. ... Bxe3  28. Qxg7+ mate",
        "28. g3": "To prevent a counterattack by the queen and far more important, to prepare 29. f4",
        "28... Kh7": "Probably to avoid being in chess by 29. Ne7 but thee was no risk becuse I didn't see where it could lead. so that this is a weak move.",
        "29. f4": "\"I said anybody on attack\".",
        "29... Bf6": "No other place to avoid 30. fxg5 or 30. Qxg7+#",
        "30. Re3e8": "Now white can play the trade but there is risk because the white ing is naked, black is now ahead in material and the black queen seriously menaces the white king.",
        "30... Rxe8": "Almost no choice.",
        "31. Rxe8": "The black king is surrounded.",
        "31... d4": "\"La meilleure défense c'est l'attaque\" said the other one and I was afraid becaus I  was not sure at all to have enough moves to se black in real trouble before he promote one of his pawns.",
        "32. Nxh6": "Beginning of a complicated tactical sequence.",
        "32... Rd8": "Avoiding 33. Nxf7 ... 34. Qxg7#mate",
        "33. Qf5+": "white has two possible answers",
        "33... Kxh6": "The other line went : 33. ... g6 34. hxg6+ fxg6 35. Qh3+#, so that black plays the proper move, being now one knight ahead but having his king totally blocked which was white's idea.",
        "34. Re2": "White has no interest to trade. The rook is necessary to counter black's attack.",
        "34... d3": "Black's attack...",
        "35. Rd2": "... Countered. But the rook is now blocked.",
        "35... c4": "Blunder, it permits white to advance but I do not see what black could have plaid.",
        "36. g4": "Now black  has little to do.",
        "36... Qb6+": "It had to come.",
        "37. Kf1": "Black cannot set white in chess the next move...",
        "37... g6": "...So that he tries something else",
        "38. g5+": "Fork attack.",
        "38... Bxg5": "Black exchanges the bishop against a pawn... better than noting.",
        "39. Qxg5+": "Natural move.",
        "39... Kg7 40. Qe5+": "If 40. ... Kh8 41. hxh6 and black is quickly mate by 42. Rg2+ etc.  or Rh2+etc. depending on black's option.",
        "40... Kg8": "So that black plays 40. ... Kg8 which is even worse...",
        "41. h6": "Mating menace. Yhe only move to avoid it is 42. ... f6 but 43. Qe7 with forced mate by 44. Qg7+#"
    },
    "url": "https://gameknot.com/annotation.pl/caro-kahn-w?gm=50077",
    "gameName": "Caro Kahn (W)",
    "players": "ptitroque (1673) vs. juanitovc (1673)",
    "opening": "Caro-Kann (B19), classical, 7...Nd7"
}