{
    "moves": {
        "1. e4": "Find here is a game that illustrates a Caro-Kann Defense: Advance Variation (B12).\n\nnota: This opening has been more and more played since 1990.\n\n",
        "1... c6": "Caro-kann advance variation's stats:\nWhite wins 40.0%\nBlack wins 27.3%\nDraws 32.6%",
        "2. d4": "c6 doesn't mean you abandon the center. You are even not late. It is like a call on whites cards and intentions.",
        "2... d5": "There are some N variations of the Caro-Kann my knowledge of them are limited.\r\n\r\nAlso Tarrash responded (1889) e5 on d4 played by Amos Burn.\r\n",
        "3. e5": "Caro-Kann Defense advance variation position\nBlacks have options (Bf5/C5/F6!/etc.) even if there is an advanced e5.\nThis position gives me focus on e5 and d4. Once d5 is down whites are mostly done as I know that many players can not resist to play e5.",
        "3... c5": "The first step to get ride of e5 is to attack strongly d4.\nThe game between V. Promyshlyanskiy vs Daniel Fridman during the LGA Premium Cup (09/08/2006) illustrates it.\n",
        "4. c3 cxd4 5. cxd4 Nc6 6. a3": "a3 is so soon... Oh well I guess I won't play Bb4 . I played a useless Bc5 instead.",
        "6... Bf5 7. f3 e6 8. h4 Qb6": "I still don't know whites intention,\n",
        "9. Ne2": "the first mistake is not to target Bf5 ...",
        "9... Bxb1": "I must admit that I didn't see the coming combination firstly...",
        "10. Rxb1 Bxa3": "1 pawn down. whites would not let the quality and a messed Queen's side ",
        "11. b3 Bb4+": "Bb4 file is a very strong position up in the opponent's camp.",
        "12. Kf2": "The King is moving on f3 in order to let the Q and the N to protect d4. ",
        "12... Nge7": "N e7 is a silly move as I had an other free pawn ... and not the least important ... e4 ( Nxe4)",
        "13. Be3": "Nxe4 is no more reasonably playable.",
        "13... Nf5": "I didn't notice the strengh of this move and I had no idea how to attack here.",
        "14. g4 Nxe3 15. Kxe3": "only now I understand what I said earlier...\nshooter56 brings his King to e3. Not the best place to be for a King... and now I won't miss Nxe4... ",
        "15... Nxe5 16. Bh3": "shooter56 shows me that if I castle (0-0) he could have a strong attack on the K's side.",
        "16... Nc6 17. f4": "as often I have no idea of what to do against this strange position ",
        "17... O-O-O": "0-0-0 could not hurt right now.",
        "18. Qd3 Kb8": "Kb8 could mean a lost of time but I prefer to have a look at what are shooter's ideas at this point.",
        "19. g5 e5": "A simple e6-e5 will open the situation. Opening up e files and adding pressure on d4.",
        "20. Bg2 exd4+ 21. Kf3 Bc3": "I didn't play Rhe8 as I didn't want to let the h7 pawn",
        "22. Rhd1 g6 23. Nxc3 dxc3 24. Qxc3": "the balck Bishop was meant to be let down here",
        "24... Rhe8": "I must say that I put shooter back in the game. I have no real advantage on the e files in fact.",
        "25. Kg3": "But King g3 is miracle for me ... and the last mistake for whites",
        "25... Re3+": "Re3 ; Shooter56 resigned after this fork."
    },
    "url": "https://gameknot.com/annotation.pl/caro-kann-defense-advance-variation-controled-by-blacks?gm=2902",
    "gameName": "Caro-Kann Defense: Advance Variation controled by blacks",
    "players": "shooter56 (1285) vs. ukuyo (1200)",
    "opening": "Caro-Kann (B12), advance variation"
}