{
    "moves": {
        "1. e4 c6": "The caro kann defense. My early favorite. I already expect my more inexperienced opponent does not know how to play it and will be over aggressive, because I saw how he played against the 2000+ player.",
        "2. Nf3": "This does not offer White any advantage. ",
        "2... d5": "Now Black breaks open the center.",
        "3. exd5 cxd5": "Already Black has a position that would be ideal in the Sicilian, the open c file and firm control of d5.",
        "4. Ne5": "? This is weak. Much better is to develop.",
        "4... Nf6": "Black does not fear the check.",
        "5. Bb5+": "Here my opponent over estimates the value of the attack. This just helps black develop.",
        "5... Nbd7 6. Nxd7 Nxd7 7. d4": "Here White probably thinks they have the advantage. But the pin is ineffective.",
        "7... a6 8. Ba4 b5 9. Bb3": "The White LSB will bite on granite. Black is already contemplating a minority attack.",
        "9... Nb6": "Here Black wants to free the LSB as is typical in the Caro Kann.",
        "10. O-O Bf5 11. Bd2": "Bf4 was more active.",
        "11... e6": "Continuing with the plan. A solid center and pressure on the Q side.",
        "12. Nc3 Nc4": "Black seizes c4.",
        "13. Bxc4": "White exchanges, but Black now has the bishop pair.",
        "13... bxc4 14. b3 Rc8": "According to plan. ",
        "15. bxc4": "? This capture only favors Black.",
        "15... Rxc4 16. Re1 Be7": "? Black should just take the d pawn. But I was hoping for more by exerting pressure on the c file.",
        "17. Rc1 Qc7 18. Bf4": "?? My opponent does not realize the Bishop is unprotected.",
        "18... Qc6": "? Black wants something in the way of a useful lesson.",
        "19. Re3": "?? This does not protect the N. It was necessary to retreat it.",
        "19... Rxc3": "Black takes the piece now.",
        "20. Rxc3 Qxc3 21. Rb1 O-O 22. Qh5": "This accomplishes nothing. ",
        "22... Bxc2 23. Rc1 Ba3 24. Rf1": "Black has calculated this position out. White's rook has retreated and Black has complete control.",
        "24... Qxd4 25. Be5 Qe4": "Sets a trap if White tries Qg5.",
        "26. Qg5": "? This does not work, it loses yet another piece.",
        "26... f6": "Of course, now Black must give up the Bishop",
        "27. Qd2 fxe5 28. Re1 Qb4": "As planned. ",
        "29. Qxb4 Bxb4": "After the exchange the game is totally over. Black is expecting White to take the \"free\" pawn.",
        "30. Rxe5 Rf6": "Black now has overwhelming threats.",
        "31. Re3": "Black is going to Queen a pawn, but this makes it easy. ",
        "31... d4": "the pawn can't be stopped except by ",
        "32. Re2 d3 33. Re4 d2": "Of course, Black now queens. White resigns. "
    },
    "url": "https://gameknot.com/annotation.pl/caro-kann-challenge-with-jkarp?gm=45710",
    "gameName": "Caro Kann challenge with Jkarp",
    "players": "jkarp (1085) vs. dmaestro (1529)",
    "opening": "Caro-Kann defence (B10)"
}