{
    "moves": {
        "1. e4": "Hi everyone, welcome to another match between me and Coach Ion where I was the loser.  Unfortunately in this one there is no pretence of equality as there was between me and Master Freddy (easy19).  I did try to conquer my disease, passivitis, but I had to go the wrong way about it, didn't I?  Ion gives me an opportunity to build a strong pawn centre and get some play with a hypermodern opening such as the Robatsch Defense.  This Defense by black is designed to undermine white's strong pawn centre and to place his dsb on g7 raking down to the white a1 rook, so the b pawn is pinned to that rook unless black moves a knight to f6.  Anyhow, on with the game.",
        "1... g6 2. d4 Bg7 3. Nc3 d6 4. f4": "4. f4 - this transposes into a the pseudo-Austrian attack of the Pirc Defense.",
        "4... b6 5. Nf3 Bb7": "5. ........ Bb7 - a double fianchetto - this lsb also proves to be very strong, and will be a nightmare piece later on!",
        "6. Bc4 c5 7. Bb5+ Nd7 8. Be3 Ngf6 9. e5": "9. e5 - I had several options to deal with the attack on my e pawn?  Was this the correct one?  You the jury decide.",
        "9... Ng4 10. Qe2": "10. Qe2 - clears both paths and gives Henry a choice of where he wishes to move to.  Glenda also defends Fou Lenoir.",
        "10... a6 11. Bxd7+ Qxd7 12. dxc5 bxc5 13. h3 Nxe3 14. Qxe3": "14. Qxe3 - after this plethora of exchanges it is 2 knights v 2 bishops.  Ion will now demonstrate that 2 bishops are definately stronger than 2 knights.",
        "14... O-O 15. O-O-O": "15. 0-0-0? - here it is, Ion stated in the chat when the game had moved on a little further that he thought my later king move to d2 was my downfall but I do not think that I helped myself by moving Henry to an area where black had a perfect column, the b column to funnel his heavies down.  Maybe Rd1 followed by kingside castling was better.  The rook part of the move puts pressure on black's d pawn.",
        "15... Bc6 16. Ne4": "16. Ne4 - all well intentioned, this move threatens to win either the c pawn or the d pawn due to the pin of the d pawn to the Wicked Witch of the West.  Also hoping for Bxe4 getting rid of one of those bishops, but hope chess is a bad bad thing!  However, that Witch now waves her wand and kaboom she jumps out of the pin and ends up on that bally b file!  Now dxc6 cannot be played due to Qxb7  - notice how the e5 pawn is actually pinned to b2!",
        "16... Qb7 17. Rhe1 Rfb8 18. b3 Qb4": "18. ......... Qb4 - the Wicked Witch creeps closer and closer to Henry.",
        "19. Nc3 a5 20. a4 c4": "20. ......... c4! Undermines protection on my a pawn.  I now try to evacuate Henry from the queenside but Ion thinks this is a mistake.  Can you the jury suggest a better alternative for me here?",
        "21. Kd2 cxb3 22. cxb3 Qxb3 23. Rdb1 Qc4 24. Qd4": "24. Qd4? - another well-intentioned move, to exchange queens to relieve the pressure on Henry but, when my knight moves to d4 my b pawn will be left hanging.  I now drop another pawn.",
        "24... Qxd4+ 25. Nxd4 Bxg2 26. h4 Rxb1 27. Nxb1 dxe5 28. fxe5 Rd8": "28. ........... Rd8 - Ion still keeps up the pressure.  The game now lasts only 1 more move.",
        "29. Kc3 Rd5": "29. ......... Rd5 and white resigns.  I resigned because I could not avoid the loss of a third pawn.  I have two knights against his two bishops.  There is just no juice left in the position so I wave the white flag.  Well played Ion!"
    },
    "url": "https://gameknot.com/annotation.pl/castling-into-it?gm=20912",
    "gameName": "Castling Into It!",
    "players": "jstevens1 (1745) vs. ionadowman (2056)",
    "opening": "Robatsch defence (B06), Pseudo-Austrian attack"
}