{
    "moves": {
        "1. e4": "I played this game at my club a couple days ago and decided to annotate it today. I sacrificed a pawn in the opening for superior development.",
        "1... Nf6": "Alekhine's defense, I want to entice White's central pawns forward so I can undermine them while White's centre will be left with weaknesses",
        "2. Nc3": "This is the best move against Alekhine, because e5 is overextensive.",
        "2... d5": "This is the most active move. All others will yield White the advantage.",
        "3. exd5": "Other choices are Nxd5 and e5.",
        "3... Bg4": "Instead of recapturing, I decide to develop another piece.",
        "4. f3": "Althought it seems White has won a tempo, f3 weakens the a7-g1 diagonal, and takes away the knight's best square.",
        "4... Bf5": "I can simply move, while White's weakness stays",
        "5. Bc4": "White holds onto the pawn.",
        "5... c6": "My sacrifice.",
        "6. dxc6 Nxc6": "For compensation for the pawn, I  have superior development and more control of centre.",
        "7. Nge2 e5": "It's easy for me to make good developing moves as a result of my sacrifice.",
        "8. O-O Bc5+": "White wouldn't have been able to castle if he'd waited a move becauase of the weakness on the g1-a7 diagonal.",
        "9. Kh1 h5": "preparing a kingside attack.",
        "10. d3": "White is about to complete development, so I need to do something drastic while I still have a lead in development",
        "10... Ng4": "This move threatens Nf2  so White must accept my knight sacrifice.",
        "11. fxg4 hxg4": "For compensation for the knight, I now have an open h-file to White's king, and I have another threat Rxh2 followed by Qh4 mate.",
        "12. g3": "This stops Qh4, and it was here I realized I was losing, and that my attack wasn't as good as I envisioned it to be. \r\nNow I'm down a knight for nothing, and it must take a miracle to win now.",
        "12... Kd7": "Sometimes all it takes is an odd-looking move to throw your opponent off. My opponent had a defensive move here d4 which would have given him time to defend properly. I guess White was thrown off by my obscure move it caused him to blunder.",
        "13. Rxf5": "White greedily snaps off another of my pieces, not seeing the real reason I played Kd2.",
        "13... Rxh2+": "It's too late now.",
        "14. Kxh2 Qh8+": "Kd2 cleared the back rank.",
        "15. Kg2 Qh3#": "White felt really stupid for falling into this mate, not to mention I am minus 10 in material."
    },
    "url": "https://gameknot.com/annotation.pl/casual-club-game?gm=6126",
    "gameName": "Casual Club game",
    "players": "Him (1545) vs. Me (1800)",
    "opening": "Alekhine's defence (B02), Scandinavian variation"
}