{
    "moves": {
        "1. f4": "Most mature chess players open with a central Pawn move. The move in and of itself is not bad -- Bird's Opening is a respectable line -- but obviously, you don't expect a child to know the intricacies of offbeat chess openings.",
        "1... b6": "I'm guessing that this youngster had learned about something called a \"fianchetto\" and because of its exotic name, thought it must be really cool to do. My 6-year-old son often thinks things about games are \"cool\" even when they worsen his chances, like getting sent back to Start in the game \"Sorry!\"",
        "2. Nh3": "Who knows what goes through a child's head? It does protect the Pawn, so in a weird way it has a logic to it.",
        "2... Bb7": "Completing the fianchetto, and probably feeling like nothing better could happen than to do so.",
        "3. Nc3": "This one has the rudiments of the idea of development down, anyway.",
        "3... Na6": "I'm assuming so as not to spoil the really cool maneuver by blocking the Bishop.",
        "4. e4": "Hey, it is guarded by the Knight. Again, what makes sense to an adult is not necessarily what makes sense to a 5 or 6 year old. I know!",
        "4... f6": "Preparing to attack the White KBP.",
        "5. Bc4": "Preparing to castle. Presumably the child's instructor had said something about the importance of castling.",
        "5... e5": "Following up...",
        "6. O-O": "...and doing likewise.",
        "6... Nc5": "Again, i'll have to hazard a guess that at some point the child was told it's agood thing to attack Pawns. This double attacks the KP.",
        "7. fxe5": "By adult standards, this move is obvious. To a 5-year-old, perhaps they were taught that it's important to open a line for a Rook.",
        "7... fxe5": "Acting on the basic principle of recapturing.",
        "8. Qh5+": "I can picture the excited squeal of \"Check!\"",
        "8... g6": "What else?",
        "9. Qxe5+": "Again, the excitement of checking. Even to me it's a thrill when I launch an attack. To a youngster, they can barely sit still.",
        "9... Ne7": "No adult would do this, as it blocks in the King. But again, the 5-year-old probably just blocked the check with the first move they saw.",
        "10. Bf7#": "Finis. The father of one of my son's friends in school supplied me with this game. His son was Black, but he wasn't upset by the loss -- he just wanted to play more games. "
    },
    "url": "https://gameknot.com/annotation.pl/casual-game?gm=34463",
    "gameName": "Casual game",
    "players": "\"Patzer\"  vs. \"Duffer\" ",
    "opening": "Bird's opening (A02)"
}