{
    "moves": {
        "1. e4 e6 2. d4 d5 3. e5 c5 4. Be3": "Weak.\n",
        "4... cxd4 5. Bxd4 Ne7 6. Nc3 Nbc6 7. Bc5 Nxe5 8. Bd4 Ne7c6 9. Bxe5 Nxe5 10. Bb5+": "This bishop move is always bad against the French because it will end up trading off White's good bishop.",
        "10... Bd7 11. Bxd7+ Qxd7 12. Nge2 Bc5 13. O-O": "Not a lot to think about up to this point.\n",
        "13... Rc8": "Or castles.\n",
        "14. a3 O-O 15. Nf4": "Developing the black king rook is a good idea, but so is ... ",
        "15... Nc4": "In the actual game, White simply hung his queen by playing 16. Qd2.  Instead what follows is computer analysis of how the game should have continued, which I found instructive.\n",
        "16. b4": "16. Rb1, Ra2 and Qc1 leave white in about as bad of shape.  I will look at 16. Rb1 in another game.\n",
        "16... Be7": "Black can do just as well with 16. ... Bb6 or 16. ... Ne3!\n",
        "17. Nce2 Nd6 18. Ra2 Rc4 19. Nd3 Bf6 20. Nb2 Rc7 21. Qd3 Rfc8 22. Nd1 Qa4 23. Ne3 Nb5 24. Ng4 Be7": "Or 24. ... Bd8 or 24. ... Bg5.\n",
        "25. Ne3": "Now  25... Bxb4 26. axb4  completely does not work.",
        "25... Nc3": "\n",
        "26. Nxc3 Rc7xc3 27. Qd1": "Computer analysis seems to want to take its time and not hurry.  It prefers moves like 27. ... h6 or Rc7, although Bg5 is also O.K.  Since I didn't really understand the other moves, I went with Bg5.",
        "27... Bg5": "27... Rxa3 Is clearly winning, but it allows just a touch of counterplay. 28. Rxa3 Qxa3 29. c4 Qxb4 30. cxd5 Rd8 is not quite as good.\n",
        "28. Qh5 Bxe3 29. fxe3 f5": "Now if 30. g4 Rxa3 31. Rxa3 Qxa3 32. gxf5 Qxe3+ 33. Rf2 Qe1+ 34. Kg2 (34. Rf1 Qxb4 35. fxe6 Qb6+) 34... Qe4+ 35. Kg1 Rf8",
        "30. Qe2": "\n",
        "30... Rc8c4": "This ends all counterplay.  31. g4 was a minor concern.\n",
        "31. Rf4 Rc3xc2 32. Rxc2 Rxc2 33. Qd3 Qc6 34. h3 Rc3 35. Qd4 Rxa3 36. Qe5 Qc1+ 37. Kh2 Rxe3 38. Qb8+ Kf7 39. Qxb7+ Kf6": "With the idea of Rxh3+.\n",
        "40. Qb8": "Black could play 40. ... h6 or 40. ... Re1, or ... ",
        "40... Qe1": "Now if 41. Rh4 h6 42. Rd4 (42. Qf8+ Kg6 43. Rxh6+ Kxh6) 42... Re2 43. Rd3 Rxg2+ 44. Kxg2 Qe2+ 45. Kg1 Qxd3 46. Qxa7 $6 Qg3+ 47. Kf1 Qxh3+ 48. Kf2 Qh4+\n\nAlso 41. Qf8+ Is a mistake, although it takes some calculation to see that. Kg6 42. Qe8+ Kg5 43. Rf3 Rxf3 44. gxf3 Kf4 45. Qh5 (45. Qb8+ Kxf3 Forcing mate.) 45... Qd2+ 46. Kg1 Kg3 And all the check squares are covered.",
        "41. Rd4": "\n",
        "41... Rc3": "The simple beauty of this move is that it prepares for Qe5+.  The computer thought this was slightly better than 41. ... Ra3 although I am not sure why.  It is possible that the rook on c3 could go to c4, and it also might control more squares the white queen could go to.",
        "42. Qf8+ Kg6 43. Qd6 h5": "This is about to be the last nail in the coffin.  Now if 44. h4 black's plan is 44. ... Kh7 followed by Rc1 followed by Qg1+ and and Rc3+.  If black plays 44. ... Rc1 immediately, then white can trade queens with Qg3+, which is still just as lost, but maybe takes longer.\n\nSo after 44. h4 Kh7 45. Qf4 Rc1 46. Rd3?! Qg1+ 47. Kg3 Rc4 48. Qf2 Rg4+ 49. Kf3 Rf4+\n",
        "44. Qf4 e5 45. Rd1 Qxd1 46. Qxe5 Rc1 47. Qe6+ Kg5": "47... Kh7 is almost as good. 48. Qxf5+ Kg8 49. Qe6+ Kh8 50. Qe8+ Kh7 51. Qe3 (51. Qe5 h4 52. Qf5+ Kg8 53. Qe6+ Kh8 54. Qe8+ Kh7) 51... h4\n",
        "48. Qe7+ Kf4 49. Qd6+ Ke4 50. Qe6+ Kd4 51. Qxf5 Qg1+ 52. Kg3 Rc3+ 53. Kh4 Qxg2 54. Qf4+ Qe4": ""
    },
    "url": "https://gameknot.com/annotation.pl/casual-game-http-www-itsyourturn-com?gm=58965",
    "gameName": "Casual Game, http://www.itsyourturn.com",
    "players": "NN  vs. John Coffey ",
    "opening": "French (C02), advance, Steinitz variation"
}