{
    "moves": {
        "1. d4 g6": "1. g6 - keeping my options open.",
        "2. e4 Bg7 3. e5": "ID  3.e5 is probably too committal too soon. 3...d6 looks like a fine reply (rather than the text move 3...d5). ",
        "3... d5": "3. d5 - I try to bust white's centre.",
        "4. Nc3 e6 5. Nf3 Ne7 6. Bg5 c6": "ID - 6...c6 looks like a loss of tempo, but the subsequent moves fit very well with it. Reserving the ...c5 break for the nonce?",
        "7. Qd2 Qc7": "7. ... Qc7 moves out of awkward pin and doubly protects Kt.",
        "8. g4 b6 9. Bh6": "9. Bh6 - nasty, nasty.  I don't want his Q to go to h6 after B trade, nor do I want him to take my bishop and force my King Rook to move to g8 preventing king side castling and allowing the WQ to follow to h6.  So I castle and hope for the best.",
        "9... O-O 10. Bg2 Bb7 11. O-O Nd7": "11.  ... Nd7 - I complete my development as quickly as possible.\r\n\r\nID - I'm not sure what to make of the ...Ne7-c8-d6 regrouping, but seemed to work out OK. I would have looked seriously at ...c5 at some point hereabouts, but Black does have to worry about that backward pawn on the half-open e-file... The White knight is masking it for the moment, but he can build up his heavy pieces on the e-file. I think White has the edge, but Black certainly has plenty of play for the moment.",
        "12. Bg5": "12. .... f6 looks a little dubious but my king knight is en prise and I want to get rid of that annoying queen bishop!!!",
        "12... f6 13. exf6 Nxf6 14. h3 Nc8": "14. .... Nc8 begins a circuitous route to f7 to try and trade off the annoying white bishop.",
        "15. Ne5 Nd6 16. f3": "ID - 16.f3?! I don't really understand this move, unless it was a fingerslip for 16.f4 (how easy it is to do that?). Is the entry of Black's knights at e4 really to be apprehended? 16.f4 Nfe4 17.Nxe4 Nxe4 18.Bxe4 dxe4 19.Rxe4 c5 20.Re2, say, though the final position looks fairly even (how long can White hang on to that extra pawn?). Maybe 16.Bf4 ought to be looked at?",
        "16... Nf7 17. f4 Nxg5": "17.  ..... Nxg5 - mission accomplished.",
        "18. fxg5 Nd7 19. Rxf8+ Rxf8 20. Nxd7 Qxd7": "20. ...... Qxd7 - that's cleared away some wood - black's position is just that little tidier.",
        "21. Rf1 Rxf1+ 22. Bxf1 e5": "ID - 22...e5! After all these exchanges, and after this move, Black suddenly emerges with the better chances. This move sensibly transforms a weakness into a strength: the backward pawn becomes either a protected passed pawn, or by exchanges mobilises a Q-side majority. The bishop pair might come in useful, too.",
        "23. Ne2 Ba6": "ID - 23...Ba6!?. Not sure how to assess this. I much prefer to clarify the pawn situation. Although 23...e4 gives Black a protected and advanced passed pawn, I prefer 23...exd4 24.Nxd4 c5 and after the knight moves, Black can get greedy and grab the b-pawn, or simply advance ....d4. \r\nAfter the text move (23...Ba6), Black ought to avoid exchanging this bishop for the knight, if he can. With Bishops of opposite colours (squares) the game would look drawish. Black ought to be playing to win, here.",
        "24. c3 exd4 25. Nxd4 Bxf1 26. Kxf1 Bxd4": "ID - The position after 23...Ba6 has turned out well enough for Black. I don't think Black ought to have exchanged off the last minor pieces (26...Bxd4), however, even though it leaves White with an isolated pawn. Much preferable (in my view) is \r\n26....c5 27.Nf3 (say) d4, which gets the majority into decisive action. After 28.cxd4 cxd4 Black can bring the queen to d5 with a strong game.",
        "27. cxd4": "27. cxd4 - now more wood is burned leaving an intriguing Q and P ending.",
        "27... Qf7+": "ID - For all the caveats in my previous note, This queen ending has begun very well for Black. The queen manoeuvres (27...Qf7ch! 28....Qe6!, 29...Qe4!) have left her well centralised, and the Q-side majority is still sufficiently mobile. I'm not saying Black is winning here, but Black has the initiative and the positional edge at the moment.",
        "28. Kg2 Qe6 29. b4 Qe4+": "29. .... Qe4  - it is vital to centralise my Q in this type of ending.",
        "30. Kg3 b5": "ID - 30...b5? I think this move reduces Black's advantage to almost nil. Sure it immobilises White's (3) pawns, but only at the cost of immobilising Black's 4! Worse, it seals off potential breakthrough points for the Black king. Black probably can't contemplate ...c5 yet, so a king move is indicated. Can he run the gauntlet of the f-file? 30...Kf7 31.Qf2ch Ke7 32.Qf6ch Kd7 33.Qf7ch!? Qe7 and White suddenly finds his b-pawn \"en prise\". However, it seems White might be able to conjure enough counterplay by 34.Qg8. Maybe Black has to try and keep White pinned down with something like 30...Qe7, protecting his own vulnerable points, whilst attacking White's, and then to look to improving the king's position. The position is difficult for both sides!",
        "31. h4 a6 32. h5 Qe7": "32 .... Qe7 - black queen senses danger to her other half so she backs off to e7 to be near him (but has her beady eye on the b pawn so that if the WQ moves to f4 - which she does next move, the pawn drops off and the black queen stays in touch with her beloved hubby by being able to move to f8 should the white witch plonk herself on b8 which she does on move 34).",
        "33. Qf4": "ID - 33.Qf4?! looks very risky, as Black can, and does, snip off the b-pawn at once. White pretty much has to get a perpetual in return... ",
        "33... Qxb4 34. Qb8+ Qf8 35. Qb6": "35. .... Qb6 - out to gobble up my queenside pawns - eh? Oh dear, it looks as if I will have to resort to perpetual check/mate threat on h2 and this will result in a draw by repetition (and loss of grading points, grr, grr).",
        "35... Qa3+ 36. Kh4 Qd6": "ID - 36...Qd6! Fine move! Directly protects the c-pawn, and indirectly the a-pawn: 37.Qxa6??  Qh2# White has no checks available, so 37.Kh3 is indicated. Now, Black can force a draw if so desired by 37...Qa3ch (38.Kh4 Qd6, or perpetual checks along the 1st and 2nd ranks). A more aggressive (and possibly more risky) plan is this: 37...gxh5 38.gxh5 Kf7 39.Qb7ch Qe7 hoping for 40.Qxc6?? Qe6ch! 41.Qxe6 Kxe6 when Black's far distant majority should carry the day: 42.g6 hxg6 43.hxg5 (43.h6 just gives white passed pawns on both flanks) 43...b4 44.Kg3 a5 45.Kf3 a4 46.Ke3 b3 wins. Or White can fly for the Q-side at once: 42.Kg3 b4 43.Kf3 a5. 44.Ke3 a4 45.Kd3 Kf5 (46.g6 hxg6 47.hxg6 Kxg6 [- ] or 47.h6 Kf6 [- ]. Is the situation, then, a draw? Black is in a position to decide: to force the draw at once, or to make White fight for it a little longer. Whether White can indeed survive is hard to say!\r\n\r\n\r\nJS - I now expected tofuman to play Kh3 and braced myself to offer him a draw, but ......",
        "37. Qxa6": "37. Qaxa6?? (allows mate on the move!) Kh3 would have most probably drawn by repetition.",
        "37... Qh2#": "37.   .... Qh2#.  A snap mate.  Sometimes it can be so easy to be too focused on one area of the board and not take in the whole picture and overlook things.  Only a few years ago I was the victim of an over the board snap mate so it can happen to anyone."
    },
    "url": "https://gameknot.com/annotation.pl/caught-in-the-corridor?gm=8644",
    "gameName": "Caught in the Corridor",
    "players": "The Dentist (1210) vs. jstevens1 (1645)",
    "opening": "Modern defence (A40)"
}