{
    "moves": {
        "1. e4": "Hi everyone!\r\n\r\nIt is the same old story - with quite a few of my expert games and even some of my master games I manage to get to 30 odd moves and am doing alright and then bang, summat goes wrong and I lose.  This is a classic example.  Before this game, which is a Sicilian, Antagonistknight my opponent warned me that going on the defensive against the Master Mater was not a good idea but what does Jo do, she gives Antagonistknight a classic example of defensive play right on a plate!  As before, here is the Gameknot Analysis link to this game:- http://gameknot.com/analyze-board.pl?bd=13852792&rnd=0.8263391849920074 -I may refer to it in my commentary, now on with the game.",
        "1... c5 2. Nf3 g6 3. d4 cxd4 4. Nxd4 Nc6 5. c4": "5. c4 - something a little unusual here.",
        "5... Nf6 6. Nc3": "6. Nc3 - to defend my e4 pawn and develop a piece at the same time.",
        "6... Nxd4 7. Qxd4": "7. Qxd4 - knight trade.",
        "7... d6 8. Be2 Bg7 9. Be3": "9. Be3 - that clears the decks and gives me a choice as to where to put Henry.....",
        "9... Be6 10. O-O": "10. 0-0 - ..... on the kingside.  Black follows suit.",
        "10... O-O 11. Qd2 Rc8 12. b3": "12. b3 - protecting c4.",
        "12... Re8 13. Rac1 Qa5": "13. ..... Qa5 - here comes the Wicked Witch of the West, I must watch out here.",
        "14. f3 a6 15. Rfd1 h5 16. Na4": "16. Na4 - I decided to trade queens.  I am always wary of my opponent's queen and want to remove her even at the cost of Glenda the Defender.  Perhaps Bh6 was worth considering but then black could have avoided the exchange of bishops by playing Bh8.",
        "16... Qxd2 17. Rxd2 Kh7": "17. ..... Kh7 - black has a plan of centralising his king, via the kingside.  It will not become apparent however until both dsbs are swapped off.",
        "18. Rcc2 Bh6 19. Bxh6": "19. Bxh6 - bishop trade.",
        "19... Kxh6 20. Nb6 Rc6 21. Nd5": "21. Nd5 - a reasonable outpost for my knight but unfortunately he will not stay there.",
        "21... Kg7 22. Kf2 h4 23. Nxf6 Kxf6": "23. ...... Kxf6 - and I help black centralise his king.  Maybe Ke3 was preferable here.",
        "24. h3": "24. h3 and again Ke3 here perhaps.",
        "24... g5 25. Ke3": "25. Ke3 - I play it now.",
        "25... Ke5 26. Bd3": "26. Bd3 - boy I could do with Fou Lenoir here.  He would surely lurve to reside on the a1-h8 diagonal, sadly he just ain't here and I am gonna suffer from my opponent's king walk.",
        "26... Rec8 27. a3 f6 28. Rcb2": "28. Rb2 - rather planless.",
        "28... Rb6 29. Rdc2 a5 30. b4 axb4 31. axb4": "31. axb4 - pawn trade.  Now black occupies the a column.  I would like to play Ra2 but unfortunately that would result in the loss of the c4 pawn after a rook trade on the a column.",
        "31... Ra6 32. c5 Ra3 33. cxd6": "33. cxd6 - gameknot did not class this as an innaccuracy, blunder or mistake but the red bar got just a little bit bigger all the same.",
        "33... Rxc2 34. Rxc2 Kxd6": "34. .... Kxd6 - hmm, he takes with the king and then retreats it by doing so.  But he has an idea up his sleeve and I do not see it until it is too late.",
        "35. Rb2 Bc4 36. Rd2 Kc6 37. Kd4": "37. Kd4?! - here gameknot classed this king move as an innaccuracy and suggested e5 instead. Please refer to the link in my intro speech.  Hmm, I suppose although that gives up a pawn it does split up black's kingside pawns and make them easy targets for Henry or my rook perhaps.",
        "37... e5+ 38. Ke3 Kb5": "38. ..... Kb5 - my b pawn is about to drop off and black will have a passer on the b column so I decided to wave the white flag here.  Well played antagonistknight.  The only plus point about this game is that at least I did get into an endgame with a near master with even material so that is a little encouraging.  I hope you have all had a good read.  Bye for now - Joanne"
    },
    "url": "https://gameknot.com/annotation.pl/caught-on-the-queenside?gm=32018",
    "gameName": "Caught on the queenside!",
    "players": "jstevens1 (1836) vs. antagonistknight (2193)",
    "opening": "Sicilian (B27), Hungarian variation"
}