{
    "moves": {
        "1. e4 d5 2. e5 Bf5 3. d3 e6 4. Qf3": "Strange move, and I'd say it's no a good one. But I couldn't see the point in an inmediate Nh3, for Bg4, so I went on normally. ",
        "4... c5 5. h4": "He want to trap my bishop. That was the plan, and now I am a move too late to prevent it. Will I be able to do it?",
        "5... h6": "?? h4 is indicated, instead. This \"small\" blunder caused me a wound that made me suffer for the rest of the game...",
        "6. g4 Bh7 7. g5": "Now, what to do better? Very complicated (pending)",
        "7... Nc6": "I opted for ignoring it. ",
        "8. c3": "Contolling my N's jumps, but...",
        "8... Nxe5": "The most important wasn't controlled!",
        "9. Qg3": "Uh, this is dangerous... for him!",
        "9... Bd6 10. f4": "Uh-oh, white is playing aggressively. I was careless...",
        "10... Ng6": "Ugly. ",
        "11. h5 Ng6e7": "...looking to f5.",
        "12. gxh6": "Probably not the best, but it carries a great danger if I take. Qxg7 would be deadly. ",
        "12... g6": "A try. ",
        "13. hxg6": "Now, again, the best move seems very unwise. ",
        "13... fxg6": "I have to use the pawn to block it. Nxg6, and I still can't take f4, while g7 will be free for a supported queen if ever my N moves - and it will.",
        "14. Nf3 Nf5": "The cavalry comes at the rescue. ",
        "15. Qg5 Be7": "No exchanges, sir. ",
        "16. Qg4 Nf6": "Run, Q, run!",
        "17. Qg2": "With the help of my opponent, I have solved a great deal of my developement problems. ",
        "17... Qb6": "?! Supporting d6 while preventing white's dsb to move. I'm not sure about it. ",
        "18. Ne5 Rg8": "Incredibly, due to the h6 white pawn, black can hold!",
        "19. Nd2 d4 20. Ndc4": "Returning me the cavalry attack. ",
        "20... Qc7 21. cxd4 cxd4": "I was greatly in doubt about Nxd4 instead, threatening c2+ at once (if the Q moves).",
        "22. Be2 b5": "?? The N has to go, and has no good squares to go, but...",
        "23. Qxa8+": "Uh-oh! I plainly blundered a full R. ",
        "23... Bd8": "...and the better way to stop the attack is this ugly move!! My pieces are not playing!",
        "24. Nd2": "Ok, let's see what I can take in return... this is a mistake, since it allows...",
        "24... Ne3": "Maybe Ng3 was better. Do you see why I was in time pressure? :-)",
        "25. Bd1": "Stopping the fork. ",
        "25... Nfd5": "Stopping the Q! and threatening f4, after which, d3...",
        "26. Qc6+": "The last attempt to loose my attack. ",
        "26... Qxc6": "Honoured. ",
        "27. Nxc6 Bb6": "I was -5. And with few pieces active, I didn't want to lose this good B. ",
        "28. Ne4": "Now, the other WN comes with danger. Again, which is the best way to defend?",
        "28... Rf8": "If Nd6+, Kd7 will fork the N!",
        "29. Bxe3": "Again, a doubt. ",
        "29... dxe3": "...to give more action to my lsb... difficult to asses. ",
        "30. Rh4 Nxf4": "Helpless defense of this pawn. White overlooks (and I did, too!) that with this move, a mate threat was cast over white. Can you see it? This is the tactic I saved the game for. ",
        "31. Nd6+": "? Mistake! Nothing changed with respect as before...",
        "31... Kd7": "Forked Ns... ",
        "32. Nxb5": "Greedy, he didn't see...",
        "32... Ng2+": "Another nice fork... ? No, much more than that.",
        "33. Ke2 Rf2#": "Very elegant, with a minimum material (the dsb can be removed and it's still mate). Thank you for reading. "
    },
    "url": "https://gameknot.com/annotation.pl/cavalry-revenges?gm=57346",
    "gameName": "Cavalry revenges...",
    "players": "alto111  vs. damalfi ",
    "opening": "Scandinavian (centre counter) defence (B01)"
}