{
    "moves": {
        "1. Nf3 d5 2. c4": "The Reti can be a dangerous weapon when Black chooses to occupy d5 with a pawn.",
        "2... c6 3. g3 Nf6 4. Bg2 e6": "Black adopts a Semi-Slav set up against the Reti set up.  Other moves are Bf5 (known as the New York System), Bg4 (the Capablanca), dc (pure Slav) and g6 (the Bled system).",
        "5. b3": "White plans to concentrate a crossfire on the center squares with a double fianchetto.",
        "5... Be7": "Bd6 followed by 0-0, Re8 and Nbd7, aiming for a quick e5 is Black's most popular continuation.",
        "6. Bb2 O-O 7. O-O dxc4": "Black opens the d-file, however, positional imbalances once recognized, must be used.  His hesitation in this game allows white to build up a devastating attack. More often seen are moves like ...Nbd7 and ...Re8.",
        "8. bxc4 Nbd7": "Here Qc7 or Qa5, intending Rd8 would have been a consistent line of play.",
        "9. d3": "9. d4 is objectively stronger, however, I wasn't so sure I wanted the hanging pawns after 9...c5.  9. d3 also gives the dark-squared bishop some squares.",
        "9... Ng4": "Where is the knight going? Black can take control with 10.h3 and the knight will just have to retreat to where it came. If 10...Bf6 then 11. d4 and the knight will have to go to a very unpleasant square on h6. Now white plays 12. d4 and has a Catalan with a lead in development and better placed pieces. I decide against kicking the knight around and play for rapid development and exploitation of the fact that black isnt taking control of the d-file, his main positional trump.",
        "10. Qc2 Bf6 11. d4 e5": "This just loses a pawn.  Relatively better is, 11...c5 12. e3 cd 13. ed Qc7 14. Nbd2 Be7 15. Rfe1 or 15. a4 gives White a spacial plus and while he has the hanging pawns, they are well defended.",
        "12. h3 Nh6 13. dxe5 Be7 14. Rd1": "Since Black hasn't used the open d-file, White decides he better grab it.",
        "14... Bc5": "Here Qc7 is much better.",
        "15. Nc3 Qc7": "Qe7 keeps the Knight out of g5, now its over.",
        "16. Ng5 g6": "...f5 17. Ne6 loses the exchange and white still has control.",
        "17. Nce4 Be7 18. e6": "and with 18...fxe6, black has to lose at least the exchange to stay alive. With his next move black will lose a piece and the white pieces will bear down on the white king.\n",
        "18... Bxg5 19. exd7 Bxd7 20. Qc3": "Mate threat.",
        "20... f6 21. Nxg5": "The knight is immune due to mate on g7.",
        "21... Kg7 22. Ne4 Ng8 23. Rd6 Qd8 24. Nxf6": "The coup de grace.",
        "24... Rxf6 25. Rad1 Qe7": "And Black resigns in view of the coming 26. Rxd7 Qxd7 27. Rxd7 , with mate not too far away."
    },
    "url": "https://gameknot.com/annotation.pl/ccc-2-mini-tournament?gm=631",
    "gameName": "CCC # 2 mini-tournament",
    "players": "mybookrunsdeep (1914) vs. kh1066 (1569)",
    "opening": "Reti opening (A09)"
}