{
    "moves": {
        "1. e4": "This game will illustrate typical plans for Black in the Closed Sicilian.",
        "1... c5 2. Nc3 g6": "Known as the Hyper-Accelerated Dragon this allows Black to side-step the annoying Bb5 lines and still keep some nasty surprises for an unsuspecting White player.",
        "3. g3": "White still had a chance to transpose into an open Sicilian with 3. Nf3 followed by d4 or 3. Nge2 and d4, however, 3. g3 indicates his willingness to keep the position closed.",
        "3... Bg7 4. Bg2 Nc6 5. d3 d6 6. f4": "The pawn structures are forming up and so are the respective plans, White erects a pawn front on the King-side and will play for a kingside attack, or in the center with a planned d4, and Black will play on the Queenside or in the center.",
        "6... e6": "Dzindzi and Perelshtyn recommend 6...Nf6, however, players like Dorian Rogozhenko advocate this flexible move as Black doesn't have to use a tempo moving the knight later on to play f5, a move that will be necessary to take the steam out of White's attack.",
        "7. Nf3 Nge7 8. O-O O-O 9. Rb1": "I have seen this played at master level, however, unless you are 2300  I wouldn't recommend it. Strategically, removing the rook from the long diagonal, preparing to re route the Queens knight, is a sound idea. However, you have to be able to check Black's initiative in the center and Queenside, at the same time preparing an attack on the Kings wing. In my book this is just too slow. The more popular main line with Be3, prepares a central advance and also prepares to swap dark squared bishops with Qd2 and Bh6.",
        "9... Rb8": "Black, however, has all of his chances on the Queenside, where his pawn chain is directed.  Here I prepared the thematic b5 advance, preparing to drive the c3 Knight from its post on c3 and gaining space for the Queenside breakthrough.",
        "10. Be3 b5 11. g4": "11. d4 is objectively better as White comes out with more center control although Black's position is without weaknesses.  As a rule, a move like g4 in this position needs to be prepared a little better with moves like Qd2 and h3, completeing development and preparing to open the h-file if Black plays f5 and fg.",
        "11... b4 12. Ne2 f5": "Black puts the brakes on White's attack and probably has a slight advantage here to to his well coordinated pieces and lack of weaknesses.",
        "13. exf5": "The first real mistake. The e-pawn is more valuable as just that, an e-pawn. White is giving up his center control and the series of pawn exchanges that occurs gives Black a mouth-watering outpost for his knight on f5. White's kingside attack is going to wither.",
        "13... exf5": "Black still has the advantage, but objectively stronger is 13...gxf5, opening the g-file on White's weakened King. Black will then play Kh8, Rg7 and bear down on White's king.",
        "14. gxf5": "Compounding the previous error. Isolated pawns create outposts for your opponents pieces on the square directly in front of the pawn. The only move here was 14.g5 when white has to attempt to lock things up or watch his position disintegrate. Even so, after 14.g5, White's play on the kingside is at an end, and Black is clearly in the drivers seat.",
        "14... Nxf5": "The Black Knight takes the outpost square and White's attack is officially at an end.",
        "15. Bd2": "Bf2 is a more active placement of the Bishop, when the Queen could step into d2 should f4 come under attack.",
        "15... Nce7 16. Ng5": "Rerouting the this Knight is a waste of time, as the Queens Knight sleeping on e2. 16. Ng3 is stronger.\r\n",
        "16... h6 17. Ne4 Qb6": "A consequence of moving the Bishop off of the a7-g1 diagonal.  Now the light-squared bishop falls.",
        "18. Kh1 Nh4 19. Ne2g3 Nxg2": "Removing an important King-side defender.",
        "20. Kxg2 Be6": "Without its opposite number, watch as the light-squared bishop dominates the field.",
        "21. Qe2 Bxa2 22. Rbe1 Bxb2": "Now in the event of an endgame, Black's superior pawn structure would decide the game.",
        "23. Nxd6 Qxd6 24. Qxe7 Bd5+": "Exploiting the newly created light-square weakness.",
        "25. Kh3": "Kg1 is met with Bd4  and White can't block on the e-file as the Queen hangs.",
        "25... Qc6 26. Rf2": "Loses immediately. The queen had to come back to e2 so it could defend the king. Now it will be driven offsides and Black is essentially attacking with an extra queen.",
        "26... Rbe8 27. Qxa7 Rxe1 28. Bxe1 Bd4": "White faces forced mate, or decisive material loss.",
        "29. Re2 Qc8+ 30. Kh4 Rxf4#": ""
    },
    "url": "https://gameknot.com/annotation.pl/ccc-2-mini-tournament?gm=628",
    "gameName": "CCC # 2 mini-tournament",
    "players": "marillion (1591) vs. mybookrunsdeep (1893)",
    "opening": "Sicilian (B23), closed"
}