{
    "moves": {
        "1. Nf3 f5 2. b3 Nf6 3. Bb2 e6 4. d3 d5 5. e3 Bd6 6. g3 O-O 7. Bg2 c6": "Black has set up a Stonewall Dutch, while White has fianchettoed both bishops.  Usually the fianchetto is trustworthy against the Dutch.",
        "8. Nc3 Nbd7 9. Qd2 Bb4 10. O-O e5 11. a3 Ba5 12. b4 Bc7": "Black has good central control and with the Dutch is usually trying for a direct Kingside attack.  I think I inadvertently drove his Bishop to a better square.",
        "13. Ne2 e4 14. Nfd4 Ne5 15. Rad1 Qe8 16. Nc3 Qh5 17. Qe2 Nfg4 18. h3 Nf6 19. Qxh5 Nxh5": "White tries to exchange off some of the attackers.  Black has more space, however, and better pieces.",
        "20. b5 Bd7 21. bxc6 bxc6 22. Bc1 Bb6 23. Nde2 g5 24. f4 exf3 e.p. 25. Bxf3 Nxf3+ 26. Rxf3 f4 27. Rdf1": "This is a blunder.  I had looked at Kg2, which is necessary to cover the h3 pawn.  The continuations after that move are still favorable for Black, so I mentally discarded it.  However, covering the h3 pawn is not optional.  White's position is already bad and completely falls apart after Bxh3.  Just goes to show that blunders, although less common in correspondence chess, can still happen in slow games.",
        "27... Bxh3 28. Rf1f2 Bg4 29. Kg2 Bxf3+ 30. Rxf3 fxe3 31. d4 Rae8 32. Rxe3 Rxe3 33. Bxe3 g4": "There are no good continuations here for White, down the exchange and a pawn.  White's King is restricted and there are plenty of files for Black's Rook to create havoc.",
        "34. Bf2 Nf6 35. Nf4 Ne4 36. Nxe4 dxe4 37. Be3 Bc7": "Ne6 trades off the Knight for Bishop, but still leaves Black an easily won endgame.",
        "38. Kf2 Bxf4 39. Bxf4 Rxf4+": "This wasn't necessary, but it works too.  ",
        "40. gxf4 Kf7 41. c4 Ke6 42. a4 a5 43. c5 h5": "The passed pawn on the h-file wins easily.  Black has three passers and White cannot stop them all.  If Black makes the mistake of advancing his King too far, White's c pawn can sneak through.",
        "44. f5+ Kxf5": "I resigned here.  Black would have to blunder badly (like moving the King to f4) to lose this endgame.  The e and h pawns are too widely separated for White to stop."
    },
    "url": "https://gameknot.com/annotation.pl/cedricparkers-mini-tournament-ii?gm=62331",
    "gameName": "cedricparker's mini-tournament II",
    "players": "mmoody95 (1831) vs. damsh (1829)",
    "opening": "Reti v Dutch (A04)"
}