{
    "moves": {
        "1. d4 d5 2. Bf4 Bf5 3. Nf3 Nc6 4. c3 e6 5. h3 h6 6. g4 Bg6 7. Nbd2 Bd6 8. Ne5 Nxe5 9. dxe5 Bc5 10. e3": "One of the possible lines for the London. Black needed to play c5, but he is betting on a strong attack on e3. At the present moment, invulnerable. ",
        "10... a6 11. Nf3": "I had to prefer to develop, but I really needed the knight to be guarding h4 and have a look on d4. ",
        "11... Ne7": "Slow and logical developement. Black doesn't seem to have  an attack plan right now. ",
        "12. Qa4+": "Just stupid, since Nc6 was on black's agenda anyway. I don't want to exchange lsbs, I want to leave his uselessly dominating all this diagonal. If Be4, Be2 and Rh2, and all this is just developement for me. I'm not planning to castle kingside anyway. ",
        "12... c6": "Profilactlcly. lt blocks a lot black's position, though. ",
        "13. Nd4": "If the black knight moves, I'll consider Nxc6 (just consider).",
        "13... Qb6": "Nice, I didn't \"see\" it, even if it one of the moves white should be always aware of. I can go b4, of course, and after BxN, exB, the game becomes very closed for my taste. ",
        "14. Nb3 Be4": "Ah, ok, but I already have the answer for it.",
        "15. Rh2": "The good plan by black I overlooked is that by removing with tempo the lsb, now he can play g5, and once my bishop is not defending e3 anymore, a sac comes into consideration. ",
        "15... Ng6 16. Bg3 Bxe3": "Here it is. I have to accept the loss of a pawn, period. And try to get the most of it. How? Good question. I found a poor answer. ",
        "17. Qa3": "This prevents castling kinside (not very importan), and takes away my queen from Bc2, a possible threat. More important, leaves guarded b2 so the knight can fly. Nd2 assures a bishop's exchange, and this is good for white. ",
        "17... O-O-O": "This move I adore brings the rook into the attack and connects rooks and shields the king. ",
        "18. Rd1": "This looks ugly for white, but I must remain calm and just be careful. Now I do \"threaten\" Nd4.",
        "18... Bf4": "Threatening e5. ",
        "19. Bxf4": "I couldn't find nothing better, but incredibly enough, white's position seems to hold. What is black missing? He should win!",
        "19... Nxf4": "Fortunately, my lsb is well placed where it is. ",
        "20. Nd4": "To c5, Ne2, and go on eliminating pressures of minor black pieces. The problem is that the endgame is down a pawn for me, but a lot of pawns are on the table, still...",
        "20... Ng6": "And this gives me a nice idea: ",
        "21. f3": "\"The bishop is trapped\". Incredible. On a blitz, we both saw things too late. But black has a way to go out of it. ",
        "21... c5": "Of course. But a Knigt for the dominating lsb is a good exchange. ",
        "22. fxe4 cxd4": "A pawn mess in the center as you seldom see in actual games. I had very few seconds to think, so I decided that a defended chain on the black squares could be defended on the basis I have already the rook in the second row, and that I could took morea advantage that him on the c column due to the check, AND that the e4 black pawn that will remain was a nice target for my lsb, once \"in action\". I don't know if I did the right thing. ",
        "23. cxd4 dxe4 24. Rc2+": "I couldn't resist, but it really useless, except for a strange idea it came to me. I couldn't focus it very well, but I went on.",
        "24... Kb8 25. Bg2": "I planned here to retake the e4 pawn after the exchanges, and thanks to the check these exchanges will leave me with a pawn in d6 and two well placed rooks to defend it. It can be an interesting way to overcome the -1 pawn I am actually. ",
        "25... Rxd4 26. Rxd4 Qxd4 27. Qd6+": "This was what I saw before. Now my opponent blundered, and he really didn't deserve it. I will try to go on with the game so you can tell, if you want, who you think can be the winner. ",
        "27... Qxd6 28. exd6": "Black moves. Two choices: \n1) Try to save e4 with f5. \nWhite wouldn't want to exchange and leave so many black free pawns on the border. But then e3 and f4.\n\n2) Try to grab d6 with Rd8. \n\nWhite's defence of d6 seems possible, but not easy. Rd8, Rd2. Black can take a tempo with e3, Rd4 (Rd3, Nf4)... I can't see farther. It seems an exciting fight, maybe white can get a drawn. Kf2-e3 on the agenda, with care because of the knight... black will attack g and h...\nWhite's countergame is Rc7, threatening f and/or g 7 pawns. Defence for black is possible, but not easy...\n\nSo, what would you say?",
        "28... Rd8 29. Rc7 Rxd6 30. Rxf7 Ne5 31. Rxg7 Nd3+ 32. Kf1 Nxb2 33. Bxe4 Rd1+ 34. Ke2": ""
    },
    "url": "https://gameknot.com/annotation.pl/central-pawns-mess?gm=45739",
    "gameName": "Central pawns' mess",
    "players": "damalfi  vs. mynox ",
    "opening": "Queen's pawn, Mason variation (D00)"
}