{
    "moves": {
        "1. e4": "Sandre started with my favorite opening as that's what I play, as white.",
        "1... Nf6 2. Nc3": "Similar to me, he starts developing.  The only difference is that I would've played 2.Nf3 first, and that would be followed by my Bf1 to enable castling short.  After which, I'd play this move.  Still, it's very interesting.",
        "2... Ng8 3. Bc4": "Continuing with his development.  This time, Sandre switches to the K side.",
        "3... Nf6 4. d3": "Opening up a line for his Bc1.",
        "4... Ng8 5. Nf3": "Preparing to castle.",
        "5... Nc6 6. a3": "I, however, do not know why Sandre played this.  As white, I would've castled, at once.  Not to mention that this doesn't develop.  It's also worth noting, based on what Joe has mentioned and I agree with that TA can afford to not develop or play normal openings because he's a lot more experienced.  But, if someone with less experience doesn't follow those guidelines, it can get that said person into a lot of trouble.",
        "6... Nf6 7. h3": "Likewise, I don't know why Sandre played this.  As noted, I would've castled.",
        "7... Ng8 8. Qe2": "And, now it's more then just castling as Sandre has brought his Queen out before that or completing his development which would be bringing his Bc1 into play.",
        "8... Nb8 9. b4": "Presumably, Sandre is going for a pawn chain since he's not ready to bring his Bc1 into play, yet.",
        "9... Nc6 10. Qe3": "Once again, I don't why Sandre played this.",
        "10... Nb8 11. Ng5": "Bringing his N into what appears to be a better place.  So, reposting the N.  I think it's a little late for that because of...",
        "11... e6": "This move, as now, Joe starts developing.  The idea is waiting for the opponent to feel comfortable like this, and then, go for it, by playing the standard developing moves.  What it boils down is that it's just a matter of time before he does that.",
        "12. Bb2": "As now, Sandre completes his development.",
        "12... Be7": "Meanwhile, Joe continues developing.  Whilst, threatening to exchange white's more passive piece which is something that GM Susan Polgar outlined. ",
        "13. Nf3": "Not to my surprise, Sandre retreats to prevent that.",
        "13... d6": "Although it blocks his Be7, I like this move.  My guess is that he's still giving Sandre a chance because of how confident white is.  Yes, Joe is also known to this, and it's something else that I like about him.",
        "14. a4": "Getting a semi open file.",
        "14... Nc6": "So, Joe goes on the offense, but, \"For Real This Time\".  Not only won't that N retreat back, again.  More importantly, however, is the fact Sandre's b4 is now attacked.  And, when he defends, Joe will continue developing with his other N.  Just like here, he won't undevelop it, this time around.",
        "15. Ba3 Nf6 16. Nd4": "Sandre wants to exchange, but in my opinion, it's a mistake.  And, that's also based on what Susan Polgar mentioned exchanging the more active piece, as this will benefit Joe.",
        "16... Nxd4 17. Qxd4 O-O": "After which, Joe castles.",
        "18. O-O": "As does Sandre.",
        "18... d5": "But, Sandre overlooked this move, as his Bc4 is attacked which is a significant gain of tempo, as we'll see when he takes.",
        "19. exd5 c6": "And, that's because of the fact that Joe does not take back.  With that being said, it reminds of the same difficult chess problem that GM Judit Polgar once posted.  That's because white had a forced draw, but the solution was giving up the Rook for free as now, he had the time needed to force the stalemate.",
        "20. d6": "Giving that Sandre can't take, lest, he lost he gave up the Queen, white advances to attack the Bishop.  I mean, that pawn was a goner, one way or another, as we're about to see.  Not only that, but he'll face some difficulty.  That's because when Joe takes, he is going to threaten the win of material.",
        "20... Bxd6 21. Qe3": "Which Sandre had to prevent since Joe was threatening a skewer with 21...Be5.  If, he played it now, however, white has 22.d4.",
        "21... Nd5": "So, Joe plays this, instead, to attack the Queen.",
        "22. Nxd5": "Which forces Sandra to take to avoid the loss of material.  However, I would've played 22.Bxd5, because N's were exchanged but Susan Polgar in answer to that issue said that it's generally Knight for Bishop.",
        "22... exd5 23. Bb3": "Protecting his B since it was attacked.",
        "23... Re8": "Attacking the Q, whilst centralizing his R, which is, in general, a good idea.",
        "24. Qf3 Qe7": "Bringing his Q in front of the R which is also a good idea.",
        "25. Rfe1": "?? This is, in my opinion, the losing blunder.  Up until now, I think that Sandre was playing fine.  But, this move, however, enables a mating net which Joe is going to take advantage of.",
        "25... Qxe1+ 26. Rxe1 Rxe1#": "The moral to this story is something that Jack Stockel taught me, some time ago.  So, it's more then just being overly confident which is also how and why I learn from Joe's games, like this.  When it appears equal, or you have an advantage then the question is does the position hold.  In other words, can you keep that draw or initative.  And, it's not just luck.  Instead, you need to try your best and not make a mistake.  Otherwise, you lose the edge and/or don't keep that draw.  In general, that means that it changes from a win or draw to a loss.  That's what happened in this game, as Sandre fought hard but made a mistake that overlooked this mating net.  From then on, it was game over."
    },
    "url": "https://gameknot.com/annotation.pl/challenge-from-tactical_abyss?gm=61570",
    "gameName": "Challenge from tactical_abyss",
    "players": "sani-san (1501) vs. tactical_abyss (2460)",
    "opening": "Alekhine's defence (B02), Scandinavian variation"
}