{
    "moves": {
        "1. e4 e5 2. Nf3 Nc6 3. Bc4 h6 4. d4 exd4 5. Bf4 Bc5 6. Na3 a6 7. Bd5 Nce7 8. Ne5": "8. Ne5? Et håpløst trekk. Dette trekket var lite gjennomtenkt. Ikke bare flytter jeg samme brikke to ganger, men det eneste jeg ”tjener” på trekket er at jeg prøver meg på et utrolig lettsett angrep ved lage fork på tårn og dame. \r\n\r\nHer burde jeg nok heller ha castlet mot kongesiden for å unngå videre forviklinger som fører til at jeg gjør en ny feil etter 10… Qe7+!",
        "8... Nxd5 9. exd5 d6 10. Nd3 Qe7+ 11. Be3": "11. Be3? Her aner jeg virkelig ikke hva jeg gjorde. Eneste jeg kan tenke meg er at jeg tenkte at det nok ville være smart å ofre løper for å kunne castle og beskytte kongen senere i spillet. Regnet med at hvis jeg heller tok 11. De2 så kom 11… Dxd2 12. Kxe2 og dermed var muligheten til å castle ute.\r\n\r\n Jeg burde nok heller gjort dette for etter 13. Te1 videre fulgt av f eks 14. Kf1 så ville jeg omtrent havnet som ved rokkade.",
        "11... dxe3 12. fxe3 Bxe3 13. g3": "13. g3? Jeg tenker at jeg skal castle dronningside og etter å ha lest om utvikling av bønder så fikk jeg det for meg at siden jeg ikke skulle castle mot kongeside så kunne jeg utvikle bonden. \r\n\r\nEt mye bedre valg her hadde vært 13.h3! ved å blokkere løper på c8 til å sette dronningen under press og senere føre til at kongen blir fanget mot kongeside hvor det verken er brikker eller bønder til å stå imot et angrep. \r\n\r\nJeg tror også at 13. Sf2 hadde vært et greit alternativ ved at jeg blokkerer g4 for løper samtidig som jeg mulig kan friste motstander til å gjøre et bytte av Springer mot Løper. ",
        "13... Nf6 14. Qe2": "14. De2 er også et forferdelig hastetrekk gjort for å åpne opp til dronningside castling som faktisk ikke går pga Løper på e3. ved 13. Sf2 kunne det også åpnet opp til at 14. Sc4 ville kommet så sant ikke trekket 13. Df6 kommer.",
        "14... Bg4 15. Qf1 Bg5+ 16. Kf2 Qe3+ 17. Kg2 Qe4+ 18. Kg1 O-O 19. Nf2": "19. Nf2? Nok et dårlig trekk som låses når 19.Be3 kommer. \r\n\r\nHer ville nok kanskje 19. Te1 vært et bedre alternativ, selv om jeg nå tror jeg er såpass fastklemt i hjørnet uten dekning fra verken bønder eller løpere som nok kunne vært viktig. Dermed føler jeg at ofringen av løper tidligere i spillet var et utrolig dårlig valg. Bør det sørges for at man har en løper så fremt dronningen fortsatt er på brettet? For her er det jo så å si løperene som sperrer av og videre setter pin på Springer som fører til at dronningen kan gå på å gjøre som den vil.",
        "19... Be3 20. h3": "20. h3 er nok et relativt godt trekk ved at det frigjører h2 plassen til tårnet som jeg bruker for å ta Løper som ofrer seg for å ta Springer på f2 og deretter fører til et bytte av dronninger.",
        "20... Bf3 21. Rh2 Nh5 22. Qc4 Bxf2+ 23. Rxf2 Qe3 24. Qd3 Qxd3 25. cxd3 Bxd5 26. Re1 Nxg3 27. Re7": "27. Te7? Her kommer det altfor offensive spillet mitt godt frem. Selv med -6 i materialt tap. Dårlig utvikling av bønder. En usikker konge og en Springer som er litt fastlåst til a3 gjør dette trekket enda dårligere.",
        "27... Rae8 28. Rxc7": "28. Txc7? Kommer som følge av offensivt spill og rett og slett et forsøk fra å stjele en uslig bonde som ikke er med i spillet på noen som helst måte da denne er på dronningsside og dermed ikke vil hjelpe meg noe i forsvar på kongesiden.",
        "28... Re1+ 29. Kh2 Ne2 30. Nc2": "30. Sc2? Selv om jeg har tapt kunne jeg heller ofret tårnet for å ta Springer som ville utsatt Matt ved, \r\n\r\n30. Txe2 … Txe2+ 31. Kg3 etterfulgt av utvikling av bønder hos deg som ville ført til Matt.",
        "30... Rh1#": ""
    },
    "url": "https://gameknot.com/annotation.pl/challenge-from-strutta?gm=27429",
    "gameName": "Challenge from strutta",
    "players": "kenttm (1249) vs. strutta (1662)",
    "opening": "King's pawn game (C50)"
}