{
    "moves": {
        "1. d4 Nf6 2. c4 e6 3. Nc3 c5 4. d5 exd5 5. cxd5 d6 6. Nf3 g6 7. h3 a6 8. e4 b5": "Best structure for black's queenside pawns",
        "9. Bd3 Bg7 10. O-O O-O 11. a4 b4 12. Ne2 Re8 13. Ng3": "Uncommon situation in a Benoni. White has most of his forces grouped on the kingside but abandons the queenside. So that black's plan is to attack on the queenside.",
        "13... a5": "to advance on the queenside but more important to free a6",
        "14. Re1": "White's attack will definitely take place on the e file.",
        "14... Ba6": "To prepare 15. c4. ",
        "15. Bf4": "To prepare 16.e5 If blacks plays 15. ... Nd7 16.Bxd6 and white has a passed pawn.",
        "15... Nxd5": "The knight has no proper place to go and white is almost forced to take to avoid 16. Nxf4 or 16. NB6.\nBlack's plan is to attack as quick as possible on the queenside while holding in the center. Black's attacking possibilities on the queenside are important. The GK computers considers it as a mistake.",
        "16. exd5": "Logical move",
        "16... c4": "Blunder : The GK computer plaid this move on move 15. Black should have plaid 16. Rxe1",
        "17. Rxe8+ Qxe8": "No choice",
        "18. Bb1": "White chooses the queenside.",
        "18... b3": "To trap the a rook.",
        "19. Bxd6": "White has now a passed pawn",
        "19... Bxb2": "White's a rook is doomed",
        "20. Be4 Bxa1": "mistake. I was looking for an immediate material gain but 20. ... c3 would have been better.",
        "21. Qxa1": "Material is equal, white controls the center, has one passed pawn against 2 for black. The white king is safer. White has all his pieces aiming at the king's surround and, essential for the rest of the game, white controls the a1 h8 diagonal from which black will never manage to disloge him.",
        "21... Nd7": "To free the rook but Qd8 would brobably had been better",
        "22. Qc3": "Menacing the a pawn and, more important, preventing 23. ...c3",
        "22... Rc8": "To enable c3 if the white queen moves.",
        "23. Ng5": "White construct a very powerfull attack.",
        "23... h6 24. Nh5 f6": "Black has little other choice available  : if 24. ... gxh5 25. Bh7 mate if 24. ... hxg5 25. Qg7 mate",
        "25. Nxf6+": "fork attack on the royal couple",
        "25... Nxf6": "No choice",
        "26. Qxf6 hxg5": "One attaquant less",
        "27. Bxg6 b2": "Only way to protect the queen and prevent 28. Qf7+ Rh8 29. Qh7 mate",
        "28. Be5": "But white has several mating menaces",
        "28... Qxe5": "Useless move",
        "29. Qf7+ Kh8 30. Qh7#": "Well done Rednif_tap. Thanks for the lesson."
    },
    "url": "https://gameknot.com/annotation.pl/challenge-from-rednif_tap?gm=51480",
    "gameName": "Challenge from rednif_tap",
    "players": "rednif_tap (1923) vs. ptitroque (1758)",
    "opening": "Nimzo-Indian defence (E20)"
}