{
    "moves": {
        "1. e4 e5 2. Nf3 Nc6 3. Bc4 Bc5": "The game starts off with the Giucco Piano.  Bc4 usually beckons this position, and I rarely enjoy the awkward situations that 3. ... Nf6 brings (with Ng5, threatening the f7 pawn).  \n\nThe opening was convenient, because I was in the mood for a nice, slow game.  Closed games like these tend to make mistakes and advantages in the game fairly subtle. \n\nWhite has several options available.  Evans Gambit (4. b4) and the Italian Gambit (4. d4) are aggressive options.  Guicco Pianissimo (4. d3) is a tender approach where both sides rely on middle-game creativity.  Main line (4. c3) prepares to control the center on d4.",
        "4. d3": "White chooses Giuocco Pianissimo.",
        "4... Nf6 5. c3 d6 6. O-O O-O 7. b4": "A nice, aggressive move by white.  7. h3 tends to be more common, but there's really little difference between the two options.\n\nNo move is without its disadvantages, though.  Finding those disadvantages is important to developing good strategy.\nOne disadvantage in this move is that it weakens a relatively clumsy white c3 pawn.  Initially pushed in order to support the d pawn's march to d4, the c-pawn now has to protect the b-pawn from the black knight while receiving little protection itself (presuming that white wants to develop the queenside knight).",
        "7... Bb6 8. a4": "White continues an admirably aggressive approach, hoping to trap the black-square bishop.\n\nPawn rushes like these must be treated carefully.  Even though the danger is somewhat minimized by having the kings castled on the same side, the strategy can succeed in disabling black's development or fail by overextending white's pawns.  The difference between success and failure in pawn rushes is subtle.",
        "8... a6": "The best solutions are often the simplest ones.",
        "9. a5 Ba7 10. Bg5 h6 11. Bh4 Bg4": "Black's pawn being pushed to g4 is an inevitability, because white's pin on the knight is beginning to make black's position uncomfortable.\n\n11. g4 is withheld because, although Nxg5?! is unsound, it's not unsound by very much.  \n\nThis move brings the board to a position that could have happened anyway, but had much better odds of happening when performed in this order.  It has the advantage of developing the white-square bishop, and getting rid of the potential stickiness of having to prove a sacrifice wrong.",
        "12. h3 Bh5 13. Nbd2": "That knight had to develop, but white runs the risk of making that c-pawn a target.",
        "13... g5 14. Bg3": "Ultimately, this is the safest position for black after white's dangerous Bg5 attack.",
        "14... Qd7": "This position had precedent on GK, in the 1st Master Tournament.\n\nThe match is between flight2000it (white) and papani (black), and can be found on:\nhttp://gameknot.com/chess.pl?bd=7038723\n\nThe queen move to d7 commits the d2 Knight to its current position (otherwise, ... Bxf3, gxf3, ... Qxh3 for a pawn advantage).  It also sets up black's queenside Knight for a long travel to a very powerful post on f4.",
        "15. Qc2": "White's queen gets out of the way of the pin.  White may be hoping to open up the center with an eventual pawn push to d4.  An interesting move along the same idea would have been Qa4, especially considering black's plan involving the knight.",
        "15... Nd8 16. Bh2": "Pre-emptively retreating the bishop is a bit passive.  Part of black's plan involves papani's innovation of black coordinating with Bg6, Nh5, and Nf4.  So the bishop would likely have to move anyway.\n\nPerhaps white was planning to play g4, for a more symmetrical (usually translating to even) game?\n\nAlternatively, this could have been a good opportunity for white to take advantage of the knight's retreat.  16. d4 is now a feasible option that opens the game up a bit (notice white's queen is out of the game, otherwise), and makes white's white-square bishop less bad.",
        "16... c6": "I hoped to create a back-up plan in case my knight didn't make it to its final destination.  Concerned about Bxe6 in the future, I planned the possibility of redirecting my attention towards the power-struggle in the center should things go awry.\n\nLooking back, the move wasn't very wise.  It allows white another opportunity to temporarily distract black from his knight's plan, by playing 17. d4.",
        "17. Bb3": "White wishes to keep the pawn pinned against the king (as I had done a few moves before).  This is also a better spot for the bishop to reside, compared to the c4 square.",
        "17... Ne6 18. Rae1": "Taking the knight may have been better, to deny black a rather strong post on f4 (especially after I committed all that time spent with the black knight on the back row, doing nothing).\n\n18. Bxe6 Qxe6 19. Re1, and I'd say the game would stay even.",
        "18... Nf4 19. Bxf4 gxf4": "The black knight found its destination, and white reasonably had to remove it from the board.  The new threat against white is now the half-open file, and most of white's pieces are cordoned off by an unfortunate pawn structure.\n\nWhite's best move here is d4.  It takes away the defender of the now-overextended f-pawn, and take away the initiative that could be used to manipulate the half-open g-file. ",
        "20. Qb1": "This is white's only concrete mistake.  The plan is to allow Bd1 to eliminate black's white-square bishop.  However, this puts a majority of white's pieces on the back rank, and gives the rooks even less room in an already tight position.  Furthermore, there's nowhere that the knight on f3 can go, except perhaps h2.\n\nThe mistake isn't game-breaking, and it's certainly playable given what transpires in the next few moves (20. ... Kh8 21. Kh1 Rg8 22. Nh4 Rg5 23. Bd1), but there are better and more offensive moves available.\n\nI find that the alternative of d4 is the best alternative move to make.",
        "20... Kh8 21. Kh1 Rfg8 22. Nh4": "Black's plan is clearly to double the rooks on the g-file and bully a way into an advantage.  This position gives the interesting dilemma of where black will place the rook in order to advance the plan.\n\nIf Rg2, then Nf5.  This blocks black's queen from targeting the potential weakspot, h3.\n\nIf Rg5, then Nf3, and white attacks the rook before being able to double.\n\nIf the rook moves anywhere else on the g-file, it gets captured by either a knight or a pawn.\n\nIf black doesn't double the rooks on the g-file right away, white will win an irreversibly strong outpost on f5 (effectively stealing black's original plan!).",
        "22... Rg5 23. Ndf3 Bxf3 24. Nxf3": "The knight has to capture the bishop instead of the pawn, otherwise Qxh3#.\n\nAt this point, the rook could retreat to g7 and double the rooks as previously planned.  However, the problem that black faces is a return to Nh4, where the knight is difficult to remove.",
        "24... Rxg2": "So the rook becomes impatient!",
        "25. Kxg2 Rg8+ 26. Kh2": "A game-deciding move (26. Ng5 prolongs the game.  A hypothetical line would be:\n26. ... Rxg5  27. Kf3 Qxh3  28. Ke2 Rg2 29. Kd1 Ng4 30. Kc1 Nxf2 31. Bc2 Be3  32. Kb2 Nxd3  33. Kb3 Nxe1 34. Rxe1 Bd2 35. Rh1 Qxc3  36. Ka4 Rg3, with a win on the horizon for black).\n\nAt this point, black can declare \"Mate in 9\".\nDo you see how it can be ended?\n\nCheck out Puzzle #788 to see, or just continue watching the game...\n\nhttp://gameknot.com/chess-puzzles.pl?u=chessnovice",
        "26... Ng4+ 27. hxg4 Qxg4": "White resigns at Mate in 2."
    },
    "url": "https://gameknot.com/annotation.pl/challenge-from-jstevens1?gm=12203",
    "gameName": "Challenge from jstevens1",
    "players": "jstevens1 (1525) vs. chessnovice (1815)",
    "opening": "Giuoco Pianissimo (C50)"
}