{
    "moves": {
        "1. e4 c5": "I prefer the Sicilian Defense over any other response to 1. e4.  \n",
        "2. Nf3 d6 3. d4 cxd4 4. Nxd4 Nf6 5. Nc3 g6": "I choose the dragon when my opponent obliges.    \n",
        "6. Be3 Bg7 7. f3 O-O 8. Qd2 Nc6": "Neither player has yet deviated from book.  To assess the situation from black, I have caught up in development.  I have three pieces developed and have castled to his four pieces developed.  My knights are on good squares influencing the center and my dark squared bishop supports my f6 knight and influences the central dark squares.  My long term chances are in my central pawn majority after trading my c-pawn for my opponent's d-pawn.  My opponent has more central space, controls my d5 square, and will have a battery along his half open d-file after castle long.    \n",
        "9. O-O-O": "As expected.   \n",
        "9... d5": "My book knowledge ran out at 8...Nc6.  I know that is poor on my part with an opening I play so often but I do not enjoy studying the openings....I prefer getting right to the middle game and looking for tactics.  As it turns out, this move is still in book.  My analysis told me this loses a pawn but I went with it anyway due to seeing great activity for my army at the end of it.  I have been studying the difference between analysis and evaluation.  Analysis is calculating the material left after all the possible lines while evaluation is looking at the position after the captures are over.  Analysis put me down a pawn but evaluation gives compensation for the pawn.  Here is what I saw.....10. Nxd5 Nxd5 11. Nxc6 bxc6 12. exd5 cxd5 13. Qxd5.....nets a pawn for white.  \n",
        "10. exd5 Nxd5 11. Nxc6": "As expected so far.   \n",
        "11... bxc6 12. Bd4": "This surprised me.  I asked caveman why he didn't go get the extra pawn and he agreed that my activity was too much for the pawn.  In our next game, he takes the black pieces and shows me how to use the activity.   \n",
        "12... Be6": "I felt I should develop my army more before initiating exchanges.   \n",
        "13. Ne4": "I missed this idea and don't like my position.  I see that white can go Nc5 next which would threaten to exchange knight for bishop giving white the bishop pair with an open center.  I also don't like my queenside pawns being isolated.  It looks like either 9.....d5 or 12.....Be6 was an inaccuracy.   \n",
        "13... f5": "This was an effort to give my light squared bishop an escape square from Nc5.  Looking at this after the game I realize that 13...Bxd4 is much better.  For some reason during the game I could not get away from the idea that I needed to keep my light squared bishop.  \n",
        "14. Nc5 Bf7 15. Bxg7": "Now my dark squares are terribly weak but too late now.\n",
        "15... Kxg7 16. Qd4+ Kg8 17. Bc4": "White pressures my d5 square.  \n",
        "17... Rb8": "I wanted to get my rooks onto the half open b-file for some counter play.  White already owns the open d-file which is a huge positional advantage.  \n",
        "18. Rhe1": "White threatens 19. Ne6 forking my queen and rook forcing me to exchange bishop for knight.  \n",
        "18... Qd6": "I defend the e6 square with my queen and connect my rooks.  I feel like it is an improvement.  \n",
        "19. g3 Rfe8": "I don't know what I was thinking here.  This is a waste of a tempo.  I wanted to double on the b-file but lost my nerve or something.  \n",
        "20. f4 Rb6": "Back to my original plan of doubling on the b-file.\n",
        "21. Rd3 Reb8 22. Rb3 Nf6": "I was hoping white would capture the rook or queen and help me fix my isolated pawns.    \n",
        "23. Bxf7+ Kxf7": "I feel ok about this.  Nd7 forking my rooks is covered by the f6 knight.  Any exchange connects my pawns.  \n",
        "24. Qc4+": "I didn't expect this.  White does not exchange and has control of my e6 square.  \n",
        "24... Qd5": "I really didn't like the idea of his knight getting to e6.  \n",
        "25. Qxd5+ cxd5": "White still pressures e6.\n",
        "26. Rxb6": "White speeds to an endgame where I feel like my e-pawn will be a weakness.\n",
        "26... Rxb6": "I wanted to keep my rook on a half open file rather than take with the pawn and be behind it.  \n",
        "27. c3 Rc6": "I wanted to push the knight away from it's pressure on the e6 square.  I don't know why I was so worried about that during the game, but I was.\n",
        "28. b4": "I thought this was a big mistake for white.  \n",
        "28... Ne4": "Now I can either create a passed pawn or pick up the b-pawn.  29.  Nxe4 fxe4 ....if white does not take my e4 knight, I take his on c5 and pick up the pawn.  \n",
        "29. Nxe4 fxe4 30. Kd2": "Now it is a rook endgame that I feel I can do some nice things with.\n",
        "30... Ra6": "Forcing his rook to defend due to 31...Rxa2+.  \n",
        "31. Ra1": "Now I make a couple of mistakes to lose the game.  \n",
        "31... Rb6": "This does nothing for me.  My thoughts were all wrong.  I thought I was stopping white from pushing his c-pawn....but that was not what white was doing.  Another waste of a tempo.\n",
        "32. Ke3": "His king is improving.  In the endgame the king is a fighting unit worth about 4 pawns.  He is activating his king.\n",
        "32... e6": "I shut my own king out of the center with this.  Again, I thought I was supporting my passed pawn, but this lost me my chances of winning.  \n",
        "33. a4 Rc6": "Finally, I see the way to play this is to keep his king from improving.   \n",
        "34. Ra3 Rc4": "I feel good about this....his king is shut out and I will rush mine over to the queenside to stop the pawn majority over there.  \n",
        "35. Rb3 Ke7 36. a5 a6": "I felt I needed to stop the white pawns from advancing.  \n",
        "37. Ra3 Kd6": "My chances of winning just went away.  I keep making one endgame mistake after another.  My intentions are to improve my king position, but I mis-calculate and allow my opponent to turn the tables. \n",
        "38. b5 axb5 39. a6": "My king can't get there in time to stop the pawn promotion and I am lost.  My rook now has to go defend the promotion and his king will control the center.  \n",
        "39... Rc8 40. a7": "I must\n",
        "40... Ra8 41. Kd4 Kc6 42. Ra6+": "Now I am overrun.  Definitely need work on my endgame.  \n",
        "42... Kb7 43. Rxe6 Rxa7 44. Kxd5 Kc8 45. Rxe4 Rc7 46. Kd4 Kd7 47. Re5 Rb7 48. Kc5 Rc7+ 49. Kb4 Rc4+ 50. Kb3 Kc6 51. Re7": ""
    },
    "url": "https://gameknot.com/annotation.pl/challenge-from-jeich-http-gameknot-com-http-gameknot-com-http-gameknot-com?gm=54665",
    "gameName": "Challenge from jeich, http://gameknot.com/, http://gameknot.com/, http://gameknot.com/",
    "players": "caveman1960 (1902) vs. jeich (1773)",
    "opening": "Sicilian (B76), dragon, Yugoslav attack, Rauser variation"
}