{
    "moves": {
        "1. e4 e5": "We move up our kings' pawns to give our queens and kingside bishops freedom...",
        "2. d3 d5": "...then we free up our other bishops...",
        "3. exd5 Qxd5": "...and trade pawns.",
        "4. Nc3": "As he moves up his knight...",
        "4... Qe6": "...my queen must retreat.",
        "5. Qf3": "He develops his queen...",
        "5... Bb4": "...and I develop my bishop to pin the knight down...",
        "6. Bd2": "...but his bishop unpins it...",
        "6... Nc6": "...so I bring up my knight to launch a potential attack...",
        "7. Nd5": "...and as he moves his knight away...",
        "7... Bxd2+ 8. Kxd2": "...we trade bishops...",
        "8... Qh6+": "...and I move my queen to give the king the runaround...",
        "9. Ke1 Qd6": "...then move my queen back to cover the c7 square, and prevent a potential fork.",
        "10. Nh3 Nd4": "Now I eye up a possible fork...",
        "11. Qg3": "...but as his queen eyes up my kingside rook, exposing the knight...",
        "11... g6": "...I delay taking the knight, and instead move up the g-pawn to protect the rook and knight...",
        "12. Rc1": "...and as his rook moves out of the way to prevent that fork...",
        "12... Qxd5": "...I remove the knight.",
        "13. c4 Qe6 14. Ng5 Qf5 15. h4 Qf4": "Now I line up the queen and rook...",
        "16. Qe3 Qxe3+ 17. fxe3": "...but he enforces the exchange...",
        "17... Ne6": "...so I line up his remaining knight...",
        "18. c5": "...but as he does not move his...",
        "18... Nxg5 19. hxg5": "...we trade our knights...",
        "19... c6": "...and I blockade his c-pawn...",
        "20. Rh4 f6 21. gxf6 Nxf6": "...then we trade our pawns so I can remove that troublesome pawn high up...",
        "22. d4 exd4 23. Rxd4": "...and again...",
        "23... O-O": "...and I castle kingside to bring my rook into play...",
        "24. Bc4+ Kg7": "...but the king has to move up to hide from the bishop.",
        "25. b4 Bg4": "I bring up the bishop to control the higher squares, and to prevent him doubling his rooks on the d-file, connecting my own rooks...",
        "26. Rc2 Rad8": "...so I contest the open d-file...",
        "27. Rd6": "...and he advances his rook to free his pawn...",
        "27... Rxd6": "..so I capture his rook...",
        "28. cxd6": "...and he does likewise to mine, freeing his pawn.",
        "28... Rd8": "So my other rook covers the bottom rank...",
        "29. Rd2": "...and his rook covers the pawn from behind...",
        "29... Ne8": "...and my knight attacks the pawn...",
        "30. d7": "...and as it advances into the path of my bishop...",
        "30... Rxd7": "...I capture it with my rook...",
        "31. Rxd7+": "...which is removed my his rook...",
        "31... Bxd7": "...and I capture his with my bishop. I always had that situation under control, gaining a pawn in these rook-for-rook exchanges (the second of which was invited) to add to my advantage.",
        "32. Kf2 Nd6": "I move up my knight to attack the bishop and to line up an attack on the king...",
        "33. Bb3 Ne4+": "...and now I attack him...",
        "34. Ke2 Bg4+": "...and again, with the bishop...",
        "35. Kd3 Nf2+": "...and again, with the knight.",
        "36. Kd4": "Now as the king moves onto a square that neither the bishop or knight can cover...",
        "36... Kf6": "...I move my king towards the centre to get into the action...",
        "37. Kc5 Ke5": "...and I box him in further...",
        "38. Bg8": "...and although he puts his bishop deep into my territory to line up my flank pawn...",
        "38... h5": "...I advance it so it's protected by my bishop...",
        "39. Bf7": "...and although he lines up my g-pawn...",
        "39... Be2": "...I line up a potential checkmate...",
        "40. Bxg6": "...and taking my pawn...",
        "40... Ne4+": "...allows my knight to attack the king, and as he cannot move...",
        "41. Bxe4": "...the bishop must capture my knight...",
        "41... Kxe4": "...so I capture the bishop, leaving me with the extra piece, a bishop, which can gobble up pawns that move onto light squares, to help my king and pawns. Being ahead by a three-point piece from move 12, with a pawn thrown in between moves 30 and 40 meant I had a slight edge.",
        "42. Kd6 Kxe3": "Now I capture his sole passed pawn...",
        "43. Kc7 Ba6": "...and move my bishop to cover my b-pawn...",
        "44. Kd6 Kf2 45. Ke5 Kxg2": "...and capture his g-pawn to make my h-pawn passed...",
        "46. Kf4 h4": "...so it can advance."
    },
    "url": "https://gameknot.com/annotation.pl/challenge-from-aspiemikey?gm=24418",
    "gameName": "Challenge from aspiemikey",
    "players": "sinziana (1285) vs. aspiemikey (1271)",
    "opening": "KP (C20), Indian opening"
}