{
    "moves": {
        "1. e4 e6": "I'm glad he played this.  Now, here's a thing.  I'm used to many things like the Siclian, and recently which is something that I had a lot of learning with, up until recently the Caro Kann, as I originally learned about from elyhim.  With the Caro Kann, I did not master it, until recently, when I defeated my coach who, for the first time in a long while, played north of his current rating.  So, in order to pull that victory, as he noted, I had to think like a GM.  And, it was the first time, in history, where I did not make any mistakes against a much stronger player, let alone, Mr. Stockel.  However, there is still a lot to learn with this defense, and when I play it against my coach, I often tend to blunder early.  This, unfortunately, was no exception.  This time, that one blunder will prove fatal, which shows just how much more there really is to learn.  Note: as caveman1960 said in that Caro Kann game for my club, \"The less you know, the more you realize how little you know.\"",
        "2. d4": "Standard.",
        "2... d5 3. exd5": "Of course, an exchange variation, since pawns are being exchanged.  Now, everything, for a while will be standard.",
        "3... exd5 4. Nc3 Nf6 5. Bg5 Be6 6. Bxf6": "?! In my past games with Jack Stockel, in postions like this where a N is pinned, I generally exchange.  However, it is a slight inaccuracy because Masters and GM's don't play this.  And, my coach advised me to play things that masters and gm's analyze.  This is why he also told me not to play the Dunst opening.  In the past, I did this with the same idea as the Ruy Lopez, and a couple of occasions it actually, transposed into that.  But, the reason they don't analyze it as much is that, unlike the standard 1.e4 openings, it's known to put compromises on the center.  With that, best was 6.Nf3!, and that's something that I did consider.  In fact, there were two choices for candidate, what I narrowed to be the two best choices.  One was this 6.Nf3, and the other was this move.  Of these two, I thought that best was the move played, but it actually would've been the other candidate that I almost chose.  BTW, the computer analysis proves that this is inaccurate because of what's about to happen.",
        "6... Qxf6": "With that slight inaccuracy, black now has a small advantage.",
        "7. Nf3 Nd7 8. Bd3 c6 9. O-O": "This was my plan since move 7.",
        "9... Bd6 10. Re1": "?! My idea here was to pin the LSB, but there's more to it then meets the eye.  In, \"The Deeper Chess Theory Club\" I learned that one way to control the center is by attacking it from wrecking_ball in, \"The Snap Shot Analysis\", thread.  So, I was trying to apply the same concept and strategy here as that's also a part of theory.  The problem here is that this is another inaccuracy, and with it, black's advantages are increasing.",
        "10... O-O-O": "Most of the time, black would castle in this kind of position.  Due to my last inaccuracy, however, he castles Q side because I now have a weaknesses which he's starting to exploit with this move.",
        "11. Ne2": "I don't like having to cram my N like this.  But, in this position, there is no choice.  Afterall, this move was difficult to find. I saw his intention.  The strategy here is to win my pawn, pin my f N, or get a half pin on my c N, and I could not allow that. If he didn't have that plan, I wouldn't have used my N as a shield.  But, this is an example of the consequences affiliated with my last inaccuracies.",
        "11... g5 12. h3": "? A mistake.  While it doesn't show on the analysis this is a bad move.  My whole idea here was to prevent him from winning my N  I figured that here, he could not play ...g4 as I'd just take.  However, in this position, he can and will play ...h6, establishing the connected pawns, henceforth, pawn structures, and be able to do damage.  Eventually, this will enable him material, no matter what I do.  The only option here was 12.Nd2 to prevent any further damage.  I don't like it because it really jams in the N and crams the Q.  But, it's better then what black does next.",
        "12... h5": "As noted, the threat of ...g4, which wins material is back, and there's no way to stop it.",
        "13. Nh2": "In this position, however, I attempted to and actually thought that I could put an end to that threat, but it's too little, too late because the damage has been done.",
        "13... g4 14. hxg4": "?? I figured that all I have to was exchange to get out of this situation, since I figured that the his most dangerous pawn was on g4.  However, this unleashes a whole can of worms, as they say, as it's just the beginning of my problems.  As it turns out, and according to the analysis which is absolutely correct, this is an outright blunder.  The reason being is that because of what black does next which is listed as a mainline in the analysis, I'll have to lose a piece or get mated quickly.  Either way, black is now clearly winning and almost has a won game.",
        "14... Bxh2+ 15. Kxh2": "?? I had two choices.  This was one of them.  And, the interesting thing is that with this move, I regained all of my confidence back, given that I was behind and going for anything.  However, while I was lost with my last move, this instantly loses.  I figured that all I had to do was take back, and by doing so, I'm no longer nervous, at this point.  In fact, I felt here that with best play, I had a shot at getting a draw.  And, I'm now out of good moves.  Having said that, the only other option was 15.Kh1!, and that would've prolonged the game.  Yes, I would be a piece behind, but there would be no immediate sequence against me.  With this move, however, I have to lose something worth more or get mated.",
        "15... hxg4+ 16. Kg3": "?? I don't know what the best move was, but with this move, it's over now.  That's because, at this point, black now has an inevitable mate in 3, with no way out of it.",
        "16... Qh4+ 17. Kf4 Qxf2+ 18. Kg5 Qf6#": "One thing I did learn, however, and it's a good thing.  Remember when I said that one should not become overlyconfident, if you're winning.  Well, this especially applies when your opponent has the advantage.  Once he had a winning advantage only shortly then did my confidence grow.  In fact, I got overlyconfident and that's why I took the bishop.  Well, I did use analyze the board to determine if it was good or not, why, and what makes it good or bad.  So, I did evaluate the position, figuring that no matter what he plays, there was nothing he could do to mate me, as I remembered from the master mater, when I took and did not even study to see if there was a threat, affiliated with it.  But, here I did and discovered the threat I missed.  Therefore, when you're at a disadvantage, especially against a stronger player, instead of being aggressive, this is where one must be more defensive and really spend more time analyzing the position.  And, usually if you blunder or make a inaccuracy, there is a way around it.  But, when you're up against a much stronger, that is, at expert level or higher, one flaw will generally make or break a game.  So, the idea is don't do something that will get you in trouble, in the first place.  BTW, I would like to thank geniusacamel for giving me this game."
    },
    "url": "https://gameknot.com/annotation.pl/challenge-from-geniusacamel?gm=55691",
    "gameName": "Challenge from geniusacamel",
    "players": "jkarp (1268) vs. geniusacamel (2086)",
    "opening": "French (C01), exchange, Svenonius variation"
}