{
    "moves": {
        "1. e4": "geniusacamel gives me the chance to avenge my loss. I decide to go back to an old favourite especially as I predict a French Defence after scouting his games.",
        "1... e6": "Preparation rewarded. Part 2 of the plan retain the initiative even if it means sacking material.",
        "2. d4 d5 3. Nc3": "3.Nc3 is the most active move in this position I think. 3.Nd2 is more of a restraining black type of move and 3.e5 though gaining space can get stodgy whilst still allowing black counterplay",
        "3... Bb4": "I guessed camelagenius would choose this most dynamic of variations,",
        "4. e5 c5 5. a3 Bxc3+ 6. bxc3 Ne7 7. Qg4": "The most aggressive continuation and in line with my desire to seize the initiative. Here I was hoping to channel the spirit of Tal inspired by Game 1 1960 World Chess Championship Tal v. Botvinnik",
        "7... O-O": "This surprised me. I was expecting/hoping for 7......Qc7 sacrificing the g7/h7 pawns for counterplay",
        "8. Bd3": "8.Nf3 is also popular but the move played is more direct with the B targeting the k-side.",
        "8... c4": "8.....Nbc6 and 8.....f5 are more usual and probably better.",
        "9. Bh6": "Targeting the king and retaining the initiative",
        "9... Ng6": "Forced but also getting rid of whites good white squared bishop.",
        "10. Bxg6 fxg6 11. Be3": "I like this better than 11.Bd2 as it protects f2 though the B can become the target of a N on f5.",
        "11... Nc6 12. h4": "Keep the initiative. Attack.",
        "12... Qe8": "Providing protection along the e8/h6 diagonal",
        "13. h5": "Targeting g6.",
        "13... gxh5 14. Rxh5 Ne7 15. Nf3": "geniusacamel suggested that 15.Ne2 was an interesting alternative",
        "15... Qg6 16. Rg5 Qh6": "17.......Qf7 may be better",
        "17. Qg3": "Here I was tempted by 17.Rh5 offering to repeat positions. My opponent suggested that the position offered more than a draw for white so I played on.",
        "17... g6": "17.....Qh1 loses",
        "18. Nh2": "Redirecting the knight towards g4 to put more pressure on blacks king",
        "18... Qg7": "I preferred 18.....Nf5 here",
        "19. Ng4 h6 20. O-O-O": "?? Blunder.I was hoping to get more pieces into the attac at the cost of a rook sac.20.Nf6 should have been played. After 20.......Rxf6 21.exf Qxf6 22.Re5 I didn't think white had anything really special so I went for the R sac. I should have analysed the line furter as white has quite a good game",
        "20... hxg5 21. Bxg5 Nf5 22. Qf4": "22.Qh3 was a little better though black is still winninh",
        "22... b5 23. Rh1 Kf7 24. Bf6 g5": "Missed this. Now white is kaput.",
        "25. Bxg5 Rh8 26. Rxh8 Qxh8 27. Bf6 Qh1+": "white resigns a rook down. Once again frustrated by geniusacamel who gave chances in the opening/middlegame which once again failed to capitalise on"
    },
    "url": "https://gameknot.com/annotation.pl/challenge-from-geniusacamel?gm=55716",
    "gameName": "Challenge from geniusacamel",
    "players": "caveman1960 (1881) vs. geniusacamel (2144)",
    "opening": "French (C19), Winawer, advance, poisoned pawn variation"
}