{
    "moves": {
        "1. d4 d5 2. c4 c6": "Slav defense\r\n",
        "3. Nf3 Nf6 4. Nc3 Bf5": "This move would waste time if White followed up with 5.Qb3 as in the next note. 4...Bg4 is often played here and leads to a more open aggressive game.",
        "5. e3": "Qb3! would lead to a better game for White. Then if 5...Qd7 6.Ne5 follows, and if 5...Qc7 6.cxd wins a pawn. Black would have no better than 5...Bc8 wasting 2 tempos and leading to White gaining an edge in development.  ",
        "5... e6 6. cxd5": "White doesn't gain anything here by releasing the tension in the center.",
        "6... cxd5": "6...exd5 seems like a better choice here as black's queenside now becomes vulnerable.",
        "7. Be2": "7.Bb4  puts more pressure on Black's position.",
        "7... Bd6 8. O-O": "8.Nb5 carries the attack to Black. If then 8...Bb4  9.Bd2 and White can try trading his locked in bishop for Black's freer one. ",
        "8... O-O 9. Bd2": "9.b3 followed by 10.Bb2 seems like a better way to position the locked in bishop. At some uture time, White then may be able to free it when exchanges occur on e5.",
        "9... Qb6": "Searching for some way to build on Black's position.",
        "10. b4": "Too agressive a move. 10.Na4 followed by 11.Rc1 and possibly a future Nc5 is a better choice.",
        "10... Bxb4": "Obviously",
        "11. Rb1": "Leaving his rook en-pris.",
        "11... a5": "Black misses the gift White handed him.",
        "12. Rb2": "gift has been taken back.",
        "12... Qc7": "Freeing the queen from the pinned bishop, and attacking the knight.",
        "13. Qb3 Nc6 14. a4": "14.Rc1 is better. White would contest the open file and prepare for a future Nb5.",
        "14... Qe7": "Not much point in this move. 14...Rc8 adding pressure on the c file is better.",
        "15. Ne5": "I still like Rc1 better,",
        "15... Rab8": "Wrong file for this rook. Rooks should be placed on open files.",
        "16. Kh1": "What's the pirpose of this move?",
        "16... Ba3": "This doesn't help at all as it leads into White's plans to open the file for his queen and rook.",
        "17. Nxc6 bxc6 18. Qxb8 Rxb8 19. Rxb8+ Ne8 20. Nb1": "Rc1 is still indicated here.",
        "20... Bd6 21. Ra8 Qb7": "Leaves the knight unprotected.",
        "22. Rxe8+ Bf8 23. Nc3": "23.e4! looks like it may work. If 23....bxe4 24.Bf4 with the threat of Bd6 is strong. And if 23...dxe4 24.Rb1 brings the other rook into play.  When ahead and on the attack, try to open lines.",
        "23... f6": "Trying to ease the pin and surround the rook.",
        "24. Rd8": " 24.e4 may still be a plan.",
        "24... g5": "Needlessly opening his position. 24... Kf7 is indicated here.",
        "25. Re8": "e4 is needed again",
        "25... Kf7 26. Bh5+ Bg6 27. Rb1": "Finally getting the rook into action!",
        "27... Qa6": "Now we see the folly of 16.Kh1 . White can't play R1b8 because of the backdoor mate threat. ",
        "28. Be2 Bd3 29. Reb8": "The other rook needed to be moved here. Doubled rooks on a rank are much better than on a file. And that way Black's 29.Bxe2 could be answered by 30.Rxf8 ",
        "29... Bxe2 30. Nxe2 Qxe2 31. Rb8b7+ Kg6 32. Bxa5": "this pawn can wait. 32.Kg1 first would save the f pawn.",
        "32... Qxf2 33. Rb7b3 Qa2 34. Bb4 Bg7 35. a5 Kf5 36. Kg1 e5 37. Rb3b2 Qa4": "37...Qc4 looks better here as it keeps pressure on White's pawn at d4.",
        "38. Rb2b3 exd4 39. exd4": "39.Ra3 should come first before taking the pawn back. Then the threat of a6, a7, a8 would keep the pressure on Black.  ",
        "39... Ke4 40. Ra3 Qc2 41. Rab3": "41.Rba1 is better. Why accept a draw here? White's 'a' pawn is a big threat?"
    },
    "url": "https://gameknot.com/annotation.pl/challenge-from-freakio?gm=13804",
    "gameName": "Challenge from freakio",
    "players": "freakio (1251) vs. jow76 (1585)",
    "opening": "QGD Slav (D15), 4.Nc3"
}