{
    "moves": {
        "1. d4": "My first attempt at annotating! A friendly game in which an exchange sac brings about a position that I would play from either side. Here we go....\r\n\r\nA computer will help out with analysis,but I will do most of the work,as I need the study time! I will not have many \"lines\" of analysis-I perfer to talk generally about my thoughts during the game. Comments are most welcome!",
        "1... Nf6 2. g3 e6 3. Nf3 c5 4. c3": "A little passive,in my opinion. I like  Bg2 or c4.",
        "4... Nc6 5. Bg2 d5": "One of my favorite formations for Black",
        "6. Ne5": "Moving a developed piece again (?). Why not 0-0 orBf4.",
        "6... cxd4": "Not the best,as the pawn recapture repairs White's pawns,giving C3 back to the N. Better is Be7 or d6,or even Nxe5, 7 dxe5;Nd7 hitting the e5 p and forcing white into either f4 or bf4",
        "7. cxd4 Bd6 8. Nxc6": "3 moves with the same piece by move 8 is not to be recommended but something had to be done.",
        "8... bxc6 9. Nc3 O-O 10. O-O Rb8": "Off the long diagonal,even though it's \"clogged\" for now.",
        "11. a3 c5 12. dxc5 Bxc5": "Interesting. A semi-open position,where White has a majority of pawns on the Q side verses more pawns in the cenre for Black. White for choice here,due to a slightly worse  black Q bishop ",
        "13. b4 Be7": "Bd6 is better,protecting the R on the b8-h2 diagonal",
        "14. Bb2": "This strike me as passive. I prefer Bg5 or f4,chasing away the R. The computer likes Qd4 and keeping the B on the c1-h6 diagonal.",
        "14... Ba6": "Only game in town.",
        "15. Rc1 Bc4 16. Na4 a5": "I likes this move. Getting rid of an isolani,and getting a good result back.",
        "17. Bxf6": "I was surprised by this. The necessary recapture really strengthens my B square B. e5 is a weak square in my camp,and the Bishop there ( for White) would force me to make a decision about my R",
        "17... Bxf6 18. Qd2": "Best",
        "18... axb4 19. axb4 Be7": "Not the best! Bg5 would force f4,weakening White's K side. I could then go to the plan I use now. Amazing the things I miss!",
        "20. Nc5 Rb5": "Just piling up....the white bishop needs to get to work somehow!",
        "21. Na6": "An errant mission! Better is  21 Nd3. Then ...Bxd3 22 Qxd3; Rxb4 does lose a pawn,but White certainly can defend. The bishops are of opposite color,a potential end game factor.",
        "21... Qb6": "Slam",
        "22. Nc5 Rxb4": "Now I decide to experiment. Of course there is an easier way to get the pawn,and I saw the N fork....but I wanted to play...",
        "23. Nd7": "Why not? I would!",
        "23... Qb5 24. Nxf8 Bxf8": "OK, time to asses. This is a position that I would like for either side. But in my opinion,I like Black better because of the potential of a passed d pawn. White has slightly less active pieces....the K rook needs to get into the game and use the open lines.  The computer like White to the tune of 1/2 pawn advantage. For some REALLY  instructive games with this type of material imbalance,check out Fischer-Larsen, match game 5 1971, and Spassky-Tal, Tallin 1973. Incredible games!",
        "25. Bf3": "At first I thought this an ugly move,but it provides air for the King and protection for the  p.",
        "25... g6": "My original plan was to move Rb2,but after Rc2 I thought that I would have to trade rooks. In my opinion,this type on position requires Black to keep the heavy pieces on. Q  R B verses Q B B makes it easier for the side with the R. Comments?",
        "26. Rfe1 Bg7 27. e4": "?! This allows a monster passed pawn. I think better is e3,guarding the d4 square and allowing the B to roam around and offset the Blk B on c4",
        "27... Bb2 28. Rc2 d4": "Board up the windows,the zombies are coming!",
        "29. Rb1": "Pretty much the only move",
        "29... Bc3": "Things are kind of forced around here.",
        "30. Rxb4 Qxb4 31. Qc1": "Qg5 does not help much. Everything that follows flows from getting a passer on d4. Maybe 27 e4 was the decisive mistake.",
        "31... e5": "No rush....",
        "32. Be2 Bb3 33. Rxc3": "Really bad. The computer \"thinks\" a move like Kg2 is better. I would of course take the R,but then there are opposite colored B's,and white covers the d3 square 2x.....very hard,if not impossible to win.",
        "33... Qxc3": "A blunder by me! p takes is MUCH better. ",
        "34. Qg5": "The final mistake. Qb1 would allow me to force a Q exchange,but the resulting B P ending is tough!\r\n34. Qb1 Qc2  35.Bd3 Qxb1  36.Bxb1 Bc4 37. Kg2 g5  38.g4     (Analysis by Crafty) is a little better for Black",
        "34... Qe1+ 35. Bf1 Bc4": "White resigns.  My first attempt at annotating. Again,comments are welcome."
    },
    "url": "https://gameknot.com/annotation.pl/challenge-from-patzerman?gm=15425",
    "gameName": "Challenge from patzerman",
    "players": "fatbrit (1638) vs. patzerman (1842)",
    "opening": "Queen's pawn game (A45)"
}