{
    "moves": {
        "1. e4 e5 2. Nf3": "fairly standard type of opening - attacking my pawn and developing a piece.",
        "2... Nc6": "I could have used the queen's pawn to defend but chose to develop my Knight instead.",
        "3. d3": "securing white's King's pawn and opening a diagonal for the black square bishop",
        "3... d6": "respond in kind",
        "4. h3": "? questionable (slow) move.  It's only merit is it creates an escape square for the king should he castle on his side.  Too early to really need that though.\r\nBetter to developthe queen's knight or one of his bishops.",
        "4... Nf6": "I continue to develop my pieces.  This gives me better coverage of the centre of the board.",
        "5. Bd2": "still a very conservative developing move for his bishop - only one square.",
        "5... Be6": "Taking advantage of white's hesitancy I push for more room - usually black does not have this luxury.",
        "6. Be2": "Another conservative developing move.",
        "6... d5": "I decide to press early to try and achieve dominance over the centre.",
        "7. Nc3": "At last the knight comes out.",
        "7... dxe4": "I go for the pawn exchange.  Note that if white re-captures with his knight it will be unsupported by a pawn which makes it vulnerable.",
        "8. dxe4 Bb4": "Pin that knight to a bishop (and potentially his king).",
        "9. Nd5": "??? after being so timid white advances his knight agressively with only a pawn supporting it.\r\nIt does unmask an attack by the bishop as well as attacking with his knight.  My bishop only has one defender so I must either retreat, exchange or protect it eg with a pawn.",
        "9... Bxd2+": "! I exchange.  Note that I have my eye on his lone pawn in the centre.  It is also his only support for his knight.  Moving a piece into danger unnecessarily is only wise if you believe you can force the play to your advantage.",
        "10. Qxd2": "White completes the exchange but note his lone pawn is now vulnerable to my knight.  This wins a pawn and attacks his queen whilst his advanced knight is vulnerable.  One must go!",
        "10... Nxe4": "I go up by a pawn with more to come.  ",
        "11. Qe3": "He counter attacks with his queen, but my bishop can take his knight an then protect mine.",
        "11... Bxd5": "Up by a pawn plus knight.  My aim now is to continue to pressurce white now that he is down.  Forcing exchanges until I can queen a pawn is my aim.",
        "12. Rd1": "White attacks the bishop with a more powerful piece.  As long as the bishop has some support (eg my queen) then it is ok (better would be to attack it with a pawn on c4).  White has, however, pinned my bishop to my queen.\r\n  Note that white's queen side pawns are left quite exposed now.",
        "12... f5": "I provide more support for my advanced knight with a pawn (the best support).  This relieves my bishop from his defensive role.  First step in consolidating my advantage.  Note that this clears space on f6 for my knight to retreat without leaving my centre pawn unsupportable by another pawn.",
        "13. g3": "? weakening pawn move.  much better to castle, giving his rook support and providing some defense given white is down by 4 points.",
        "13... Nf6": "I decide to use the extra time to extricate my queen from the pin.  I first protect my bishop.  Note that I could have done so with a knight on b4 but that would be vulnerable to a pawn attack and I would prefer white leave those pawns unmoved at this stage.",
        "14. O-O": "finally white gets his defenses in order.",
        "14... Qe7": "My queen is free!  I rejoice!",
        "15. Qg5": "?? White decides to pin my knight to my queen, but with the worst possible piece.  His queen is too valuable for such tasks.  Also he is at risk of being cut off and maybe losing his queen altogether.",
        "15... f4": "I threaten white's already weakened pawn defense and also trap his queen - the net is not complete though.",
        "16. g4": "? white attempts to avoid exchanges but this further restricts his queen's potential movements.",
        "16... O-O-O": "queenside castle gets my king away from danger.  Also provides added protection for my bishop.  I can use this to force exchanges of pieces.",
        "17. c4": "Finally a pawn attack on the bishop.  This should have been done to start with.",
        "17... Bxf3": "I go for exchanges.  Maybe better would have been to retreat to e6 and place further pressure on white's queen.  The reason I took this approach is the f3 is a perfect spot for a knight (forks king and queen!).",
        "18. Bxf3": "white retakes.",
        "18... Nd4": "I now move my knight into position, threatening his bishop.  Note I ensured my knight has pawn support.",
        "19. Bh1": "White retreats his bishop.  It is now going to be very difficult to lure his bishop away from defending this square (he has no other diagonals to move away from.",
        "19... Rhe8": "I provide support for my queen in case of the need for an exchange.",
        "20. Rfe1": "pins pawn to queen, but the pawn is unlikely to move off this file.",
        "20... Ne2+": "! If white captures with his rook (an easy mistake) then black can take white's rook on d1\r\nI had given up on the king/queen fork given the position of white's remaining bishop.",
        "21. Kf1 Rxd1": "I use this opportunity to force exchange of rooks.",
        "22. Rxd1": "white retakes.  Note the positioning of white's bishop, king and rook.  His pawn on f2 defends two possible knight fork squares on e3 and g3.",
        "22... Nd4": "Black's knight retreats to his pawn support.",
        "23. a3": "pawn move?  White should be more concerned about his queen.",
        "23... Ng8": "Black forces a queen exchange.  Any space that the queen can move to is being attacked except h5.  If Q-h5 then p-g6 wins the queen.  This could be an easy mistake to make if white were to try and retain his queen and some chance of a win.",
        "24. Qxe7 Nxe7": "retake with the knight, not the rook as it leaves the back rank unprotected.",
        "25. b4": "a pawn push.  White may be attempting to knock down black's kings pawns.",
        "25... Nc2": "fork of two pawns.  Not a big threat in itself but it's a case of continuing to put on pressure and retain the initiative.",
        "26. Rd3": "A rook is not the best piece to use for defense.  It and the queen are best suited to offense (the rook from a distance).",
        "26... Rd8": "attack the rook!",
        "27. Be4": "White then has to commit another piece to a defensive role.  With fewer pieces remaining this will inevitably fail unless black makes a mistake.",
        "27... Rxd3": "exchange the rooks which will leave the pawn on a3 undefended.",
        "28. Bxd3 Nxa3": "and the pawn falls.",
        "29. c5": "White is moving the pawn away from danger so his bishop is free to attack the pawn on h7 - a chance to take some initiative.  White may not have realised this yet though.",
        "29... a6": "? Black has missed the unprotected pawn and has started a pawn advance with the aim of promotion to a queen.",
        "30. c6": "?? White hasn't taken the pawn yet and has offered up his pawn for naught.  Black at this point realises he has the unprotected pawn.",
        "30... Nxc6": "! Black is happy to take with his Knight and also force the loss of the white's pawn on b4 in exchange for one pawn on h7 ending up another pawn up instead of a pawn down.",
        "31. Bxh7 Nxb4 32. Bf5+": "White attempts to take the initiative with an easily evaded checking move.",
        "32... Kd8 33. Be4": "And now attacks the unprotected pawn.",
        "33... b5": "which can easily move to safety.  Bishops and Knights are nowhere near as useful as rooks in the end game because they are much poorer at protecting or attacking a pawn that is attempting to promote.",
        "34. h4": "white attempts his own pawn advance on the other side.  Perhaps his last chance.",
        "34... Nc4": "Black spots the risk and commits a Knight to the cause.  Black is keeping his king free to help with pawn promotion, confident that he can manage the g and h pawns with the knight.",
        "35. Ke2": "White starts to move his king into action given the reduced risk of mate now.  Pawn promotion has clearly become both sides goal.",
        "35... a5": "Until white moves his pawns further black is pursuing promotion as far from the enemy king as possible.",
        "36. h5": "Here comes white's attempt.",
        "36... Nd6": "and black's knight is moved into position to block.  This also threatens white's bishop.",
        "37. Bg2": "If instead of the bishop fleeing, 37 p-g5 then 37 .... Nxe4 38 p-h6  then 38 ... pxh6 39 pxh6 N-f6 still prevents the pawn promoting.  If 38 p-g6 then 38 ... K-e8 39 p-h6 pxh6 40 p-h7 K-f2 and black's pawn promotion fails again.",
        "37... a4 38. g5": "white now moves forward.",
        "38... Nf7": "Black's Knight is moved into position for defense.",
        "39. g6 Nh6": "Pawns are easily blocked and with white's bishop on white squares unless his king can attack the pawn on g7 he is powerless.",
        "40. f3": "? White should have moved his King to attempt to prevent the pawn promotion.  If he can get his king into the square formed by a4, a1, d1 and d4 then he can stop the a4 pawn promotion (except for interference from black's knight and other pawn.  Alternatively B-h3 then to e6 may stop the advance temporarily.",
        "40... a3": "Promotion is now inevitable.",
        "41. Bh3": "White sees a chance to use his bishop for defense but it will arrive one move too late.",
        "41... a2 42. Be6 a1=Q": "and the pawn is promoted to a queen.",
        "43. Kf2 Nd3+ 44. Kg2 Qb2+ 45. Kh3": "white continues to retreat",
        "45... Nf2+ 46. Kh4 Qe2 47. Kg5": "White's king is now heading towards a trap - it can't retreat any further.",
        "47... Nh3+": "?? in an attempt to force an end to the game black makes a mistake.",
        "48. Bxh3 Qxf3": "Black's capture of the pawn is just an easy way to get to g3 - a mating square.",
        "49. Kh4": "white attempts to protect his bishop with his king but it is too late.",
        "49... Qg3#": "game over.  I hope you enjoyed this annotated game."
    },
    "url": "https://gameknot.com/annotation.pl/challenge-from-paul_nicholls?gm=1160",
    "gameName": "Challenge from paul_nicholls",
    "players": "paul_nicholls (1334) vs. michael_seymour (1200)",
    "opening": "King's pawn game (C44)"
}