{
    "moves": {
        "1. b3": "I illustrate this game to emphasise- never give up. \r\nOn move 26  I lost a bishop due to sloppy playing. After that I concentrated on attacking his king by advancing a pawn right up and by getting my queen and 2 rooks over. Sure, a player of 1700 rating would have seen through it, but for some of us whose rating hovers between 1550 and 1600 will enjoy this game.\r\n(More entertainment than education )\r\n",
        "1... e5 2. Bb2 Nc6 3. e4 Bb4 4. Nf3 d6 5. Nc3 Nf6 6. d3 Bg4 7. Be2": "pretty routine so far",
        "7... Nd4 8. a3 Bxc3+ 9. Bxc3 Nxe2 10. Qxe2": "his exchanges so far have not made much sense",
        "10... O-O 11. h3": "I want to drive his bishop away",
        "11... Bxf3 12. Qxf3 c5 13. O-O b5 14. Bb2 a5": "Unfortunately I wake up late to his pawn advance into my territory",
        "15. Qe3": "I move my queen out of the way to advance the f pawn",
        "15... Qc7 16. f4 Nd7 17. f5 Rab8 18. Rf3": "the rook lift",
        "18... c4 19. d4 f6 20. Rg3 Rf7": "bad strategy on my part- see my bishop locked in ",
        "21. Rc1 Nb6 22. Qc3 Ra8 23. d5 Qa7": "masked attack on my king",
        "24. Kh2": "I move my king out",
        "24... Rc8 25. b4": "now it is getting messy for me",
        "25... Na4": "knights are my weak point, I have lost my bishop",
        "26. Qd2 Nxb2 27. c3 Na4 28. h4": "pawn advance starts and a plan is forming in my desperate brain- will it work",
        "28... axb4 29. axb4 Nb6 30. h5": "pawn goes up, up",
        "30... Ra8": "I have to be careful about his moves on the left flank",
        "31. h6": "what will he do, this pawn must be beginning to annoy him",
        "31... Qe7": "Not sure why he does that- now he feels a bit of pressure",
        "32. Rf1": "rook comes over to join attack",
        "32... Ra3": "he is putting pressure on my c pawn- I lose that, his pawn will become queen",
        "33. Rg4 Qa7 34. Qe3 Ra2 35. Rh4 Qb8 36. Rf3": "attack on his king building up",
        "36... Qc7": "He reinforces his g7 pawn",
        "37. Rfh3": "rooks line up- ",
        "37... Na4 38. Qf3": "I plan queen move to h5- have you spotted what that would do?",
        "38... Qa7 39. Qh5": "if my q can get in on e8",
        "39... Nb2 40. hxg7": "Too late for him- if he takes the pawn with his rook, my queen will move to e8 and mate him",
        "40... Kxg7 41. Qxh7+": "only a matter of time now",
        "41... Kf8": "the end is near",
        "42. Qh8+": "if he moves king to e7, my rooks will come to h7. He resigns. gctbob and I have had good games. This game shows never give up- sometimes you can cook up a strategy that the other wakes up to, too late. Hope you enjoyed this."
    },
    "url": "https://gameknot.com/annotation.pl/challenge-from-dmisra?gm=16409",
    "gameName": "Challenge from dmisra",
    "players": "dmisra (1600) vs. gctbob (1563)",
    "opening": "Nimzovich-Larsen attack (A01), modern variation"
}