{
    "moves": {
        "1. c4 c6": "An odd move which is not even mentioned in the oddments columns of MCO14 Should be an interesting game This is where depending on sound guidelines for the opening rather than blindly following an opening book scores.\n",
        "2. Nc3 d5 3. e3": "Normally I would exchange cxd5 but the odd opening would have put ne in a bad position so e3 defends c4 with the B This precludes my fav Bremen variation - g3 Bg2\n",
        "3... Nf6 4. Nf3 e6 5. a3 Bd6 6. Be2 dxc4 7. Bxc4 Nbd7 8. O-O O-O 9. Qc2 c5 10. Rd1 b6 11. d4 Bb7 12. dxc5 Nxc5 13. Nb5 Nce4 14. Bd2 Bc5 15. Bd3": "Up to here my use of general opening guidelines had served me well but now i moved the wrong B. Better was Bc3 aligning Q & both Bs on the K defenses\n",
        "15... Nxd2 16. Rxd2 Qb8 17. Nc3 h6 18. Qa4": "According to Rybka this was the 7th best move i could have chosen!!! Correct was Ne4 threatening Nd7 forking Q R & B so keeping the black N stuck on guard duty for a while\n",
        "18... a6 19. h3 b5 20. Qd1 Qc7 21. Rc1 Qe7 22. b4 Bb6 23. e4 Rac8 24. e5 Nd5 25. Ne4 Rxc1 26. Qxc1 Nf4 27. Bb1 Rc8 28. Qd1 Bd5 29. Rc2": "A pointles move as shown by the next move back to d2 to avoid losing a N. By now a series of 2nd best moves against a sharp opponent had put black ahead by a whole pawn on Rybka's scoring\n",
        "29... Rd8 30. Rd2 f5": "At last less than perfect play from black gives me back a big piece of my -ve score and allows exchanges which break up black's Kside pawns offering a chance of attacking that side.\n",
        "31. exf6 e.p. gxf6 32. Kh2 f5 33. Nc5 Bxc5 34. bxc5 Qxc5 35. g3 Ng6 36. Ba2 Kf7 37. Bxd5 Rxd5 38. Rxd5": "The move which sets black up to create the winning Qside attack. Better to keep the R on the board and play Qe2 giving the Q good coverage of most of the board.\n",
        "38... Qxd5 39. Qe2 a5 40. h4 b4 41. h5 Nf8 42. axb4 axb4 43. Ne5+ Kg8 44. Qb2 b3 45. Qc3 Qb7 46. Nd3 Nd7 47. Nb2 Qb5 48. Kg1 Ne5 49. Qc8+ Kf7 50. Qc7+ Ke8 51. Qc8+ Ke7 52. Qc7+ Nd7 53. Qc3 e5 54. Qe3 Nf6 55. Qxh6": "desperately trying to get some play on the Kside but only succeeding in putting the Q in a bad spot Better was either Qa7+ or Qc3\n",
        "55... Qe2 56. Qg7+ Ke6 57. Qc7 Qxb2 58. Qc6+": "beginning a string of checks hoping to salvage at least a draw from the game\n",
        "58... Ke7 59. Qc5+ Kd7 60. Qb5+ Kd6 61. Qb6+ Kd5": "But black's K finds the one escape square which will eventually allow it to help the Q promote the b pawn.\n",
        "62. Qxf6 Qc1+ 63. Kg2 b2 64. Qf7+ Ke4 65. Qb7+ Kd3 66. Qb5+ Kc2 67. Qc4+ Kd1 68. Qd5+ Qd2 69. Qf3+ Kc1": "better was Kc2 which would prevent the following pin\n",
        "70. Qa3 e4 71. h6 Qxh6 72. Qc3+ Kb1 73. Qc8": "From here i worked out that black could force a position where he could give check on c2 thus forcing the exchange of Qs and finally the promotion of the b pawn\n"
    },
    "url": "https://gameknot.com/annotation.pl/challenge-from-hityerclock-http-gameknot-com-chess-pl-b?gm=42457",
    "gameName": "Challenge from hityerclock, http://gameknot.com/chess.pl?b",
    "players": "bigpeta (1865) vs. hityerclock (2243)",
    "opening": "English (A11), Caro-Kann defensive system"
}