{
    "moves": {
        "1. e4": "It's often nerve-wracking to play someone rated so much lower than you -- because you're expected to win; yet you both start off equal, and the higher-rated person is expected to make something happen!",
        "1... e5": "Pretty much standard for me and many other gameknot players, although many people prefer the sicilian defense (1. ... c5), the french defense (1. ... e6 followed by 2. ... d5), the caro-kann (1. ... c6 followed by 2. ... d5), or the pirc defense (1. ... d6 followed by g6, Nf6 and Bg7).  All of these variants are sound, and choosing one is merely a matter of taste.",
        "2. Nf3": "The best move, in my opinion, as it develops a piece and threatens black's pawn on e5.",
        "2... Nc6": "The most logical response, defending the e5 pawn and also developing.  White has a lot of choices now, from 3. Nf3 to 3. Bc4 (the italian game) to 3. Bb5 (the ruy lopez).  What will he choose?",
        "3. Bc4": "The italian game it is.",
        "3... Bc5": "Solid, and daring white to play (his choice) of the evans gambit, the guioco piano, or a different variation. The alternative is for black to play Nf6, which usually leads to white playing 4. Ng5!?, which is the speculative fried liver attack.",
        "4. O-O": "More common is either 4. b4 (the evans gambit) or 4. c3 (preparing d4, guioco piano, which means quiet game, although it's often anything but) -- either way, castling is okay, just not as aggressive as either of those.",
        "4... d6": "Opening the c8-h3 diagonal for the bishop to develop.  I didn't want to commit to Nf6 yet, as threatening the pin Bg4 may be more important right now.",
        "5. d4": "?  This opens lines for white, but does this really favor him?  Sure, his Bc1 is now free and his Bc4 isn't trapped outsite the pawn chain as it would be after 5. d3, but this just gives black the d-pawn for free.",
        "5... Nxd4": "My preferred recapture, as I'd rather have undoubled pawns and a bishop instead of a knight here.",
        "6. Nxd4": "White chooses to exchange pieces.",
        "6... Bxd4": "Again, keeping the pawns undoubled.",
        "7. Bb5+": "?  While a check is nice here, this is white's only developed piece -- why move it twice in the opening?  Furthermore, after black's most logical response (7. ... c6, which also supports an eventual d5 push), white must move the bishop a *third* time in the opening.",
        "7... c6": "Forcing the bishop to move again.",
        "8. Bd3": "This works out alright, as it anticipates 8. ... Nf6 and defends the e4 pawn.  White is down a pawn and now it's black's move -- black definitely has the edge now.",
        "8... Nf6": "Now that Bg4 is ineffective (there's no knight on f3 to pin) and f5 is a bad move (with the pawn on e4 in a battery with the Bd3), Nf6 is logical, simple development.",
        "9. Qd2": "I had kind of hoped for Bg5 (allowing Bxb2), so I had to think about this move for white.  It \"develops\" the queen, but this is to a bad square, since it blocks the bishop in, and the queen doesn't do much more on d2 than it was doing on d1.  More reasonable would've been c3, which kicks the Bd4 back onto black's side of the board.",
        "9... d5": "I decide that it's time to take over the center; after 10. exd5 cxd5, white has nothing in the center.",
        "10. Nc3": "Consistent, but white has to be careful.  Black has much more central control than white, and although challenging the center is a good idea, it may be too late, as these pieces may just get rolled up.\n\nA better plan for white, last move, might have been 9. c3 followed by Bg5 and Nd2.  Qd2 really wound up hampering white's development!",
        "10... O-O": "I was antsy to take over the center -- but had to secure my king first.  This also allows me to bring my rook over to the center, where the action's going to occur.",
        "11. a3": "White needs to be developing his pieces, and this doesn't help with that.",
        "11... Re8": "While black brings another piece towards the center.  Take stock here, after 11 moves.  Black controls more space, is up a pawn, and after a move like Bg4 or Be6, will have completed development.  White is almost as developed, but it's a lot more difficult for his Bc1 to join the fray.",
        "12. b4": "??  A very bad move.  During the game, vhhsawb asked me about where he went wrong and I pointed to this as the losing move.  Whenever a pawn or piece is moved, I like to check how this effects the rest of the board.  Here, moving the pawn from b2 to b4 turns the knight, which was protecting e4 and attacking d5, into a horribly pinned piece.  Only the queen protects it, and now black has a good shot...",
        "12... dxe4": "Now, white cannot recapture, as the pin on the knight is too strong, so he's got to move the Bd3 to either e2 or c4.",
        "13. Bxe4": "?  But white doesn't see that Bxe4 is impossible.  Now white loses a piece.",
        "13... Nxe4": "If white recaptures, black is free to play Bxa1.",
        "14. Nxe4": "There was no good option here -- moving the queen allows either Nxc3 or Bxc3, and either way white is down a piece with black's pieces swarming the queenside.  This way, black's pieces are awkwardly positioned, but white is down a full rook!",
        "14... Bxa1": "And now black is up a rook.",
        "15. Qxd8": "Exchanging queens only brings black closer to a won endgame.",
        "15... Rxd8": "...so I'm more than happy to oblige.  Now, white can threaten to win some material back with Bg5, which puts a double threat on the Rd8 and the Ba1.",
        "16. Bg5": "!  White's best chance.  But I find the right counterstroke...",
        "16... Rd4": "Rd4 threatens the knight, removes the threat on the rook, and prevents white from winning any material back.  Note how this is better than f6, which loses a pawn.",
        "17. Rxa1": "Allowing the exchange of pieces is all in black's favor here.",
        "17... Rxe4": "And with two rooks and a bishop against one and a bishop, the end is near.",
        "18. h3": "Allowing the rook to move off the back rank.",
        "18... f6": "And this bumps the bishop out of black's territory.",
        "19. Bd2": "Maybe Be3 was slightly better.",
        "19... Bf5": "Preparing to load up on the c2 pawn.",
        "20. Re1": "When you're down material, exchanging pieces is frowned upon -- the goal should be to exchange pawns but to keep as many of your own pieces on the board as possible.",
        "20... Rxe1+": "Of course, when you're up material, it's hard to resist an exchange like that.",
        "21. Bxe1": "Of course.",
        "21... Bxc2": "Winning a second pawn, in addition to the rook.  At this point, I see that either I'm going to have to mate white in the corner with something like Be4 and Rh1, or wipe out white's pawns on the queenside and march one of my pawns to get a new queen.",
        "22. g3": "Hope for mate in the corner!  Time to move the rook into the action.",
        "22... Rd8": "Threatening to win the bishop with 23. ... Rd1 24. Kf1 Bf1  25. Kg2 Rxe1",
        "23. Kg2": "White parries that threat.",
        "23... Rd1": "Getting the rook down here anyway, forcing Bc3.",
        "24. Kf1": "?  I said it was forcing Bc3!  Now white loses his last piece.",
        "24... Bd3+": "Forcing Kg1 (which is bad) or Kg2 (which is bad, but less so)",
        "25. Kg2": "The better choice, but it's too late for white to have any hope of salvaging a draw.",
        "25... Rxe1": "Now, the threat is Be4  followed by Rh1#.",
        "26. a4": "What else?",
        "26... Be4+": "If 27. Kh2, Rh1# mates the king.  If 27. f3, white lives a little longer and forces black to go with the secondary plan of promoting a queenside pawn to mate the king.",
        "27. f3": "Good call, although the game has been over for awhile at this point.",
        "27... Re2+": "Winning the f3 pawn.",
        "28. Kf1": "Not a bad square to move to, but there's nothing white can do here.",
        "28... Bxf3": "There's no good move for white anymore.",
        "29. g4": "Why not?",
        "29... Rb2": "White has no good defense against Rxb4 followed by the marching of the c-pawn down to c1.\n\nThanks to vhhsawb for the game, and hopefully the annotations are instructive!"
    },
    "url": "https://gameknot.com/annotation.pl/challenge-from-vhhsawb?gm=9117",
    "gameName": "Challenge from vhhsawb",
    "players": "vhhsawb (1050) vs. ethansiegel (1714)",
    "opening": "Giuoco Piano (C50)"
}