{
    "moves": {
        "1. e4": "The comment below is a prequil to this.  We'll now do it like a game and start the chat.  bhidragon: OK, let's start.\n\nThinking about the Sicilian from Black's point of view, what is the purpose of the opening? In other words, what advantages does the Sicilian bring to Black? How should Black use these advantages in the game?\n\nForget memorizing moves, start understanding the dynamics of the opening.\n\nWhen you've answered the questions (nothing fancy, just the basics) we'll start a Najdorf and take it from there.  thewrongreason: I agree, so what I had to do was with the practice board. And, the simple part was just the first 2 moves from black. When, I just those, after 2...d6, the Bc8 has a lot of mobility. In fact, I think about how many squares they cover because easy19 once emphasized it. And, a lot of times, when the B is first developed, they cover some squares. I believe the most is 2, but when the Sicilian is played, the B covers 5 squares which gives it a ton of mobility. Mobility is an important factor, and as far as, how to use it, I haven't done it before.\n\nSo, now my thinking is coming on because there's something I really like which I, previously, did not even consider. It has to do with later pinning the Nf3, with ...Bg4 Now, that way might be premature, but someonelse once rightly noted not to tie down your own pieces. And, even in an indirect pin that's easy to break, the N would still be tied down to the B. I just don't know how much merit that adds or if this way of thinking is premature since I've gone wrong that way. But, what I like the most is that when the Sicilian is first played, the LSB has a lot of options, more then I once realized.  bhidragon: Let’s continue with a different approach.\n\nThe Sicilian “works” well for a couple of reasons.\n\nFirst, Black can often prevent White from building a “big center” with pawns on e4 and d4. That’s what 1 ... c5 is all about, to kill the possibility of White playing d4 and keeping the pawn there. That can become a significant advantage in the middle-game, since Black has an easier time keeping his e and d pawns in play.\n\nSecond, in many Sicilian systems Black has a half-open c-file which greatly speeds up his attack against White’s Queen-side, an attack which Black needs to get going pretty quick.\n\nThird, white usually gains a space advantage in the early opening and Black needs to equalize by expanding, normally on the Queen-side.\n\nFourth, and the background to all Sicilian games, is that this is a very non-symmetrical and dynamic family of openings. Speed is absolutely critical for both sides. Speed, speed, speed! Anything can happen, and every mistake is there waiting to be made.\n\nWas that helpful?\n\nI’m sending a challenge, you get to play the Black side of the Najdorf.",
        "1... c5": "thewrongreason: That definitely was. And, some of what went into that part was difficult, but to make it easier, I'll start an annotation that just won't be made public. When this entire game is finished, then it'll be public and the complete annotation. As this is the kind of thing that Susan wants to see.",
        "2. Nf3": "bhidragon: See, starting to understand the basics of an opening is much, much more important than memorizing a list of moves.\n\nThat was by no means the complete theory of the Sicilian of course, just enough to get us going.",
        "2... d6": "thewrongreason: That definitely was. And, some of what went into that part was difficult, but to make it easier, I'll start an annotation that just won't be made public. When this entire game is finished, then it'll be public and the complete annotation. As this is the kind of thing that Susan wants to see.",
        "3. d4": "bhidragon: So, why should Black play 3. ... cxd4 in our game position?  thewrongreason: I wondered that to. But, the reason is because if white allows 3.dxc5, white either has to lose a pawn. Or, if black recaptures with 3...dxc5, white exchanges with 4.Qxd8+ and takes away blacks right to castle.  bhidragon: True to some extent.\n\nBut, think about the fundamental concepts behind the Sicilian we talked about a couple of days ago.\n\nRemember?\n\n1. Prevent White from putting pawns on e4 and d4 (the big center)\n\n2. Open attacking lines on the Queen-side\n\n3. Aggression and Speed\n\nSo then, Black MUST play 3. ... cxd4. Absolutely must make that move. Why?\n\nIt takes White’s d-pawn off the board. Concept 1 instantly satisfied.\n\nIt opens the c-file as an attacking line for Black’s a8 Rook. Concept 2 satisfied.\n\nYou must always come back to the first concepts of any opening system you play to help guide your opening play.  thewrongreason: That's something that I didn't realize, but it makes sense.  It's going back and reviewing where that concept applies.\n",
        "3... cxd4 4. Nxd4 Nf6 5. Nc3 a6": "thewrongreason: What I now have here is what Jack made me memorize. But, he didn't mention anything else after this position from the first 6 moves. I guess I still base it on concepts, but I'm sure that there's a lot more to the Nadjorf then just this.  bhidragon: There is indeed much more to the Najdorf than this, lol.\n\nI’m going to try to develop a concept here that is simply something I’ve come to realize over the years, and it all boils down to this: How do you rationalize the move 5. ... a6 in the Sicilian Najdorf.\n\nTruth be told, my computer melted down two days ago (thanks for the crappy update Microsoft) and I’m having to type on my iPad, which I absolutely hate to do.\n\nSo, if it’s OK with you I’m going to hold that discussion till my new desktop gets delivered.\n\nI’ll slow down the play of this game a bit (within the 3-day time limit of course), so we don’t have to make too many “not discussed” moves.  thewrongreason: That's fine. There is one question, when you ask about rationalizing, do you mean, why is it played? Or is it, about what concept goes into it?  bhidragon: By rationalize I mean how can you argue that this is a good move.\n\nSo, I think both of your definitions are somewhat accurate  thewrongreason: Makes perfect sense. What I like about 5...a6 is that it prevents 6.Nb5 (which I wouldn't be too worried about) or 6.Bb5+. But, I would not want to be placed in check there, even if it's a mere nuisance. And, the reason why is because even if I don't move my K where I'd be able to castle, one of the pieces would be directly pinned. Even if the pin isn't of concern, I don't enjoy having my pieces tied down like that. 5...a6 puts a stop to that.  bhidragon: Avoiding the pin is one of the major reasons for a6. Others are more subtle.",
        "6. Bg5 Nbd7 7. Qe2": "thewrongreason: I'm not sure what to play against you here. I was thinking in terms of 7...h6 to force your Bg5 back. But, that way of thinking isn't all that much better then when I did unsound aggression a few years back, as you remember. My concern is that you would, instead, exchange one of my N for your B. And, my thing is not exchanging, unless it's absolutely necessary to do so. I'm also thinking in terms of fianchettoing one of my B's. But, if so, I'm not sure which one as I like nice long diagonals. And, I'd normally just fianchetto my DSB so that I could castle short. But, I'm worried that my K side might be crammed up. So, the other candidate is to do it Q side. As I'm thinking in terms of attacking your e4 pawn again, but it's well defended by your Q. So, I'm just not sure where to go from here. The real question is what should I do? With how complex the game is, I just want to be sure that I'm thinking along the right lines. That's especially since I just lost my last game and overlooked a very basic checkmate threat against Simon by thinking along the wrong lines.  bhidragon: Well, h6 is first in the theory tree. Would White really trade Bishop for Knight without the possibility of messing up Black's K-side pawn structure? That's the beauty of Black's Knight on d7. If White plays Bxf6 then Black plays Nxf6 and White gives up the boshop pair and Black keeps the pawns intact.\nNext, g6 is playable, but that turns into a Najdorf/Dragon hybrid which I've played before but seems a little slow for a Sicilian. Maybe e6 or e5 would be a better choice to free the DSB. And those two e-pawn moves also support Black's central superiority.\nA last thought is b5. Black will play that anyway after White plays 0-0-0, which is typical for this position. Would that convince White to play 0-0 instead? Black would be able to fianchetto the LSB whatever the case.\nAnyway, those are probably your best shots.  thewrongreason: It is convincing. You mentioned about e6 or e5. I like ...e5 and have played it before because it hits the N. And, I like the idea of freeing the DSB. So, this is what I will play, as there is something that I still have to learn from it. I once played it against Charles, but there was some line shortly after that where I went wrong. Of course, he's got more experience to. So, I'll have to see where it takes me after the N move and to which square, of course.",
        "7... e5 8. Nb3": "thewrongreason: I usually ask myself what to do. And, unless it's a mistake, I'm thinking of 8...Be7 so that I can castle soon after. My idea of a good time, which isn't always so good, is to castle, ASAP. But, there is a thread of this KOH club, and I was once corrected by nuntar for doing it as he quoted a GM who posted about where it's better to sometimes delay it.  bhidragon: Castle early if the Queens are still on the board!\n\nWith that in mind, move the Bishop as you suggested",
        "8... Be7 9. O-O-O O-O 10. h4": "thewrongreason: I'm not so used to seeing the h pawn advance so soon. I'm thinking that you probably played this to get an open file for the R. But, there's a smaller thought process based on our last game. As it's also possible that you might be trying to surround and even attack the K side. I didn't want to play this, but I have a feeling that 10...h6 is necessary to prevent something like 11.h5. As my fear is white being able to play 12.h6, where I feel there would be problems because of something similar that happened in our last game after our blunder. The idea being that the same B was sacked for a devastating attack, and I'm looking into what variations would come in that could be devastating here.  bhidragon: If you remember back to our discussion of the fundamental concepts of the Sicilian, we mentioned speed. White is now going to throw a bunch of stuff at the Black King to see if anything sticks.",
        "10... h6 11. Bxf6 Nxf6 12. f3": "bhidragon: OK, so I want to get a little esoteric here, and touch on a way of looking at the game of chess that is new to me. Hang with me a little while I touch on the highlights of this way of thinking.\nLet's start by looking at the first moves of the Spanish and Italian games.\n1. e4 e5\nI'll make the claim that these moves are understandable to even novices. They grab a piece of the center and open development lines for the bishops.\n2. Nf3 Nc6\nAttacks and defends, while putting more pressure on the center.\nThis resulting position is understandable! We know what each piece is doing. You can play these moves comfortably, knowing that they make sense and form the basis of a good position.\nHowever, let’s take a look at the start of the Indian defenses.\n1. d4 Nf6\n2. c4 e6\nI’ll claim that these moves are not as intuitively correct as the first couple of moves in the Spanish. To the untrained eye, they do not really answer the fundamental requirements of a good opening position. So why play them?\nWe play the first few moves of the Indian openings because we understand (have been taught or learned through experience) the pros and cons of the future, EVOLVING positions. Rather than looking at a specific position at a specific point in time, we are looking at the POTENTIAL of the position to evolve along certain paths.\nLet’s look at our Najdorf position.\nWhite is setting up an attack on the King-side. How should Black THINK ABOUT his response? First off, let’s not invent a checklist. Let’s just consider things.\nWhat are the general objectives for Black in the Najdorf? Control of the center, and attacking chances against White’s Queen-side especially using the half-open c-file, and speed. So, your central pawns are probably in good shape. The question you have to answer is who has the advantage in speed? Can White’s attack do real damage before Black can get a significant attack going. That should guide how you approach the next few moves.  thewrongreason: I like this new way. For me, there was always something different that I just wasn't used to which would take me off guard, and I now realize that it is because of how a position evolves which can be sudden. With that, there's a lot that I didn't realize right here which shows how little I know. As far as, who has the advantage, it's very hard for me to guess. I'm thinking that white has a very small edge because of how things evolved with the a pawn. That would've been easy for me to overlook the attack, but before my last move, my thought process was that if I didn't do something, you could sac your B and get that devastating. With that, I think that white can do quite a bit of damage before black develops an attack. And, I'm thinking about the pawn chain that you now have with your last move. I'm just not quite sure what to do, as I don't have a candidate move to consider yet, in this position. But, I'll really have to give it thought.  ",
        "12... Qb6 13. g4 Be6 14. g5": "bhidragon: So, is White’s attack a real threat or not?  thewrongreason: If I'm to only look at the small stuff, I'd say no. As I can take and exchange pawns. But, the overall picture tells me that it is because you can get your Q ready for action. And, then if white takes, you have a similar attack against my monarch.  The real issue is allowing Qg2, and I have no idea how to stop it, either.  I'm now thinking that the only thing I can do about the threat you have is to answer with 14...Ne7, and then if 15.Qg2, 15...hxg5 seems ok for black. But, I think that anything else and black might very well be busted.  bhidragon: I'm not sure I'd consider the question \"Is White's attack real or not?\" to be 'small stuff'. I think it may be central to how you play the next part of the game. Well, you do probably need to move the Knight somewhere, so do so and let's see how the game progresses from there.",
        "14... Nd7 15. gxh6": "thewrongreason: I don't know if I have anything better then taking on g6. I don't want the Q swarming in, but then, if I take my K side is destroyed. By how it's playing out, I think that the position is looking very bad for black here.  I meant on h6.  I won't take since I'm starting to see what happens afterwards, and your attack would be devastating. With that, I think ...g6 is required here.  The reason I won't annotate for a while after this is because I was specifically looking at what how to prevent Joe from landing his Q+R on the g file due to his h6 pawn.  I was thinking about what all of that can do to my monarch based on the overall picture with our last game, in mind.",
        "15... g6 16. Bh3 Bxh3 17. Rxh3 Qc6 18. Rg1 Kh7 19. Qe3 Rae8 20. f4 exf4 21. Qxf4 Nf6 22. h5 Nxh5 23. Rxh5 Rfg8": "I didn't take now because if I had responded with 23...gxh5 Joe could and probably would answer with 24.Rg7+  And, after 24...Kh8, instead of 25.h7?? right away, he would play 25.Qg4.  And, I was thinking 26.h7, which I thought lost but there are ways out of it.  In contrast, 26.Qg6 would be curtains since Joe would mate, just similar to the last game.  With this move, I thought that everything's fine since my Rg8 now protects me from a K side attack.  That is, in contrast to the last game, but what I didn't realize is that I'm not in the clear.",
        "24. Nd5 gxh5": "?? Joe didn't say anything until now.  But, after this move, he said, \"Welcome back\", and I know from the last game with what it means since he said, \"Happy Birthday\" there.  So, all I said was thanks on my next move.  That was, 16 days after I had come back from vacation.  I moved my R over and thought that, now, I was protected from a K side attack and became.   By taking now, I didn't see any immediate danger since I was, in a different context thinking about the big picture.  As with our last game, however, I still missed it because of what's coming.  But, as with before, I was, extremely confident with the move played, and I went overboard, at that.   ",
        "25. Qxf7+ Kxh6 26. Rxg8 Bg5+ 27. Rxg5 Kxg5 28. Qf6+": "It wasn't until now that I made me realize that I'm really lost in all variations.  As Joe will keep checking, perpetually and not in way that'll end in a draw by rep.  As the position are not going to repeat, so what I'm alluding is that I have no shred of counterplay.  ",
        "28... Kg4": " ",
        "29. Ne3+ Kg3 30. Qg5+ Kf2 31. Qf4+ Ke2": "Now, the chats are over, so I had three spots to move the monarch.  And, I was trying to figure out where.  Other moves, I saw a quick mate, and I saw it here.  But, for me this appeared a little easier to miss a mate, so I was hoping that Joe wouldn't play his next move.  My hope was 32.Qf1+?? where it's not mate.  But, only a second after this move, I realized that this won't happen since I overlooked that this would allow me to compensate with 32...Kxe3 which is how I would've answered.  So, his next move was what predicted since it wins quickly.",
        "32. Nd4+": "And, when he plays it, I resigned.  This was in my resignation note, followed by a chess puzzle starting with Joe's previous move.  With that, 32...Ke1 is forced, and he would've responded to that with 33.Qf1# which is mate.  The problem is that I became, as Carlsen would call it a, \"greedy patzer\" and knabbed his R which is how I missed this overall picture."
    },
    "url": "https://gameknot.com/annotation.pl/challenge-from-bhidragon?gm=67978",
    "gameName": "Challenge from bhidragon",
    "players": "bhidragon (1649) vs. thewrongreason (1330)",
    "opening": "Sicilian (B94), Najdorf, Ivkov variation"
}