{
    "moves": {
        "1. Nf3": "The game progresses to the 4th opening move without incident ",
        "1... d5 2. d4 Nf6 3. Nc3 g6 4. Ne5": "White moves the knight to e5 which is not as strong a move as Bishop to f4 ",
        "4... Bg7 5. Bg5 h6": "The move of Black to advance the pawn to h6 is a weaker move than simply castling at that moment ",
        "6. Bf4 g5 7. Bg3 Nbd7 8. Nxd7 Bxd7 9. e3 O-O 10. Bd3 Bg4": "Black moving the Bishop to g3 is a weaker move than advancing the pawn to c5 which would eventually lead to exchanging queens and leaving black in a stronger board position ",
        "11. Qb1": "This move is a mistake by White, moving the queen to the b1 square gives up a much better position by moving the pawn to f3. ",
        "11... e6 12. O-O": "White castling at this point again overlooks the stronger position gained by moving the pawn to f3",
        "12... a6 13. Be5 Ne4": "Black moving the knight to e4 loses the position that is gained by reserving the knight by retreating instead to d7",
        "14. Bxe4 dxe4 15. h3": "Moving the pawn to challenge the Bishop is a mistake where the much stronger position is gained by Bx g7",
        "15... Bh5": "This position gives up the center of the board where as had the bishop retreated to g5, a much stronger position is gained with control over more of the center of the board ",
        "16. g4": "This is a mistake, and a much stronger position is gained by bishop x g7",
        "16... Bg6 17. Na4": "This move is a mistake, where a much stronger board position is gained by a3",
        "17... Bxe5 18. dxe5 Qd7 19. b3 b5": "This is a mistake. A better position is to move the queen to e7",
        "20. Nc3 f5 21. Rd1": "This is a blunder. The correct move by white is to take the paw en passant to both get the double rank pawn into its own row and also to open a row to the king",
        "21... Qc6": "This is a mistake, the queen would be in a better position with Q-g7  ",
        "22. Ne2 f4 23. exf4": "This is a blunder. The correct move id Q to c1",
        "23... gxf4": "This is a mistake. The preferred move is to advance the pawn to e3",
        "24. Nd4": "This is another blunder. The better move is to advance the pawn to b4",
        "24... Qb7": "This is also a blunder. The more aggressive move would be to move the queen to c3",
        "25. Rf1": "This move is a mistake with a better move being to advance the pawn to b4",
        "25... e3": "This is an inaccurate move. It is attacking but the better choice would be instead to advance the queen to d5",
        "26. Nxe6": "This is a blunder. The correct move is Q to e1 which allows capture of the two advanced pawns",
        "26... Rf7": "This is a blunder. The correct move which changes the board dramatically is q to f3",
        "27. fxe3 Be4": "This is a blunder. The correct move to pawn takes pawn e3",
        "28. Rxf4": "This capture is a mistake that leads to the loss of the castle. The preferred capture would be by the knight ",
        "28... Rxf4 29. exf4": "This is a blunder. The correct move is to use the knight to capture the castle which creates a much stronger board position and two pawns ahead ",
        "29... Kf7": "This is a blunder. The best move dramatically improves the board position Qto b6 check captures the knight",
        "30. Nd4": "This move is a mistake. The better move would challenge the Queen and the bishop -  N to c5 which leads to an exchange ",
        "30... Bh1": "This is actually a blunder. The best move is Castle to d1 which leads to an exchange that equalizes the number of pawns but leaves the black side down a bishop to a rook",
        "31. Qf1 Rd8 32. Rd1 Rd5 33. Kxh1 Rxd4+ 34. Kh2 Rxd1 35. Qxd1 Ke7 36. f5 Qe4 37. f6+": "This is a blunder that costs the white side major board position and an ideal pawn alignment with e6 ",
        "37... Ke6 38. Qf1 Qxe5+ 39. Kg2 Qd5+": "This is a mistake. The better move is K to f7 which allows capture of most of the white pawns",
        "40. Kg3 Qe5+ 41. Kh4 Qxf6+": "This is a blunder. The correct move is Q to g5 check ",
        "42. Qxf6+ Kxf6 43. Kh5 Kg7": "This is a blunder - the better move is K to f7 ",
        "44. c4": "This is a blunder with the better move being pawn to b4",
        "44... bxc4 45. bxc4 c5 46. g5 hxg5 47. Kxg5 Kh7 48. Kf5 Kg7 49. Ke5 Kf7 50. h4 Ke7 51. h5 Kf7 52. Kd5 Kg7 53. Kxc5 Kh6 54. Kb6 Kxh5 55. c5 a5 56. c6 a4 57. c7 a3 58. c8=Q Kg5 59. Qf8 Kg4 60. Qxa3 Kf5 61. Qe7 Kf4 62. a4 Kf5 63. a5 Kf4 64. a6 Kf5 65. a7 Kf4 66. a8=Q Kf5 67. Qaf8+ Kg6 68. Qeg7+ Kh5 69. Qfh8#": ""
    },
    "url": "https://gameknot.com/annotation.pl/challenge-from-opus206?gm=69255",
    "gameName": "Challenge from opus206",
    "players": "tolkinghorn (1155) vs. opus206 (1244)",
    "opening": "Reti opening (A06)"
}