{
    "moves": {
        "1. d4": "Black played well enough to recover from a mistake and force white to resign. ",
        "1... d5": "Standard queen opening",
        "2. Nf3 e6": "The opening progresses",
        "3. e3 Nd7 4. b3 g6 5. Bb2 Bg7 6. g3 Ngf6 7. Ba3": "I thought this a good move by white taking advantage of the Bishops long reach",
        "7... c6": "I continue my opening sequence undaunted",
        "8. Qd2": "I thought this an interesting move by white. The Queen gains control of black territory on balance putting white in control of the game",
        "8... a5": "my counter is to regain some lost territory and prevent the Queen from gaining an even stronger foothold. ",
        "9. Qc3": "With this move, the Queen is setting up to attack my King by attacking the C5 square and potentially threatening a checkmate. ",
        "9... Ne4": "My Knight to the rescue. I simultaneously threaten the Queen and protect against the aforementioned threat. ",
        "10. Qd3": "The Queen bails out losing the momentum white has gained with the Queen moving three times and my development progressing. ",
        "10... b5": "I decide to push a pawn attack on the flank because the Bishop is preventing me from Castling. ",
        "11. Qd1": "The Queen moves yet again, now for the fourth time. White has lost momentum and position. The control of the game has shifted to Black with more of the white side of the board under Black control than the other way around. ",
        "11... b4": "I press my attack with the view to allow me to Castle ",
        "12. Bb2": "Success! And with the retreat of the Bishop, the Bishop is moved a second time forcing White to lose time and space. The board clearly favors Black at this time. ",
        "12... O-O": "I get to Castle as I desired as part of my opening sequence",
        "13. Bg2": "White follows suite",
        "13... Re8": "I fall comfortably back into my opening sequence. ",
        "14. O-O": "the rhythm of the game continues. ",
        "14... Ba6": "I position my Bishop to threaten the F1 square. ",
        "15. Re1": "I am happy with the board at present and believe that the game will go on a while. ",
        "15... Ndf6": "I continue to open, to bring my pieces across the board to threaten the King and to protect my advanced pieces. ",
        "16. Ne5": "I thought this the strongest move by white. The Knight is well positioned and I have no way to combat the deep threat that the Knight poses. ",
        "16... Nh5": "I threaten an exchange",
        "17. c3": "White builds the pawn formation",
        "17... Ra7": "This move is designed to protect the pawn on F2. I cannot move my queen up without placing her under threat and I don't recognize the fork that white punishes me with. I blame move this on low blood sugar!",
        "18. Nxc6": "DARN",
        "18... Qb6": "So I accept the loss and decide that the Knight capture is worth the exchange.  At least that is what I am telling myself. ",
        "19. Nxa7 Qxa7": "So here we are, I am three points down and still feel like the board favors black. ",
        "20. c4": "This is an interesting move. White pushes a Pawn to gain a territorial advantage. ",
        "20... Nhf6": "I respond by retreating. Remember, I like the long reach of the Bishop and will happily trade Pawns. ",
        "21. a3": "But White pushes another Pawn that makes me rethink my strategy. ",
        "21... dxc4": "SO I capture the Pawn and set up an interesting situation ",
        "22. Bxe4": "White reacts by capturing my Knight",
        "22... Nxe4": "I accept the exchange and capture the Bishop. Although still behind in points, I am comfortable with the board. ",
        "23. f3": "White has pushed her Pawns again",
        "23... Ng5": "I retreat to a position that I can attack from. ",
        "24. Kg2": "This is a wasted move. I do not know what White was thinking about here. There is no board development, and nothing is gained by the move as far as I can tell. ",
        "24... Rc8": "So I have an idea. If I can get my pawn to the last row I can threaten to Queen and if I am challenged before, I can accept a Pawn for a minor piece exchange, and if I am really lucky, a Queen for a Pawn exchange....so I protect my Pawn with the Castle. ",
        "25. h4": "Not seeing the danger, White threatens the Knight. ",
        "25... c3": "I offer an exchange. ",
        "26. Nxc3": "White accepts by unusually offering to sweeten the pot for me by throwing in the Knight for a Pawn exchange as part of the bargain. ",
        "26... bxc3": "I oblige, and ",
        "27. Bc1": "White retreats anticipating capturing the Knight on g 5 later. ",
        "27... c2": "But I change her order of priorities. ",
        "28. Qd2": "A natural move. ",
        "28... Qb7": "My answer is seemingly innocuous, but it is designed to give me access to a forced check and a series of checks to mate. If White was to prevent the ensuing loss, she would have to at this juncture take the Knight.",
        "29. Ra2": "Instead, my pawn got her attention",
        "29... Qxf3+": "So here the game comes to a quick and forced end point. Check!",
        "30. Kg1 Qxg3+": "Check!",
        "31. Kh1 Qxh4+": "Check! (and a Pawn)",
        "32. Qh2": "So White offers her Queen in exchange",
        "32... Qxe1+": "I turn her down with check! (and a Castle)",
        "33. Qg1": "Once again the offer of the Queen exchange",
        "33... Bb7+": "This time a Bishop check that ensures the capture of the Queen on the way to mate. White sees the writing on the wall and resigns. "
    },
    "url": "https://gameknot.com/annotation.pl/challenge-from-opus692?gm=2722",
    "gameName": "Challenge from opus692",
    "players": "toomanydogs (1119) vs. opus692 (1278)",
    "opening": "Queen's pawn game (D02)"
}