{
    "moves": {
        "1. e3 e5 2. Nc3 Nf6 3. Nf3 e4 4. Nd4": "Whites position looks good :) ",
        "4... d5 5. f4 c5": "Black is playing aggresive. really interesting play from both sides :)",
        "6. Nb3 c4 7. Nd4": "White is back in its strong position again :)",
        "7... Nc6 8. Nxc6 bxc6": "Not sure what black can do ones white playd b3 here. White we getting a nice open a file and white will shut down the b file. Looks strong and aggresive on blacks queensite. Cause of the pawn on f4 white is also able to build up a nice attack on the kingside.",
        "9. d4": "Its a bit passive but good side from this move is the control in the center, also white still will be able to play b3. Downside is that black doesnt have to react on it. and the center is a bit blocked now. the e5 square looks attractive for white now. Im wondering what white will play.",
        "9... h5": "Not surprised tbh black obviously dont want white to play g4 and this is a easy to wait to avoid that. then again, queen side is a bit inactive, kingside castling will be a bit risky and white doesnt get under pressure. I would put my bets on the white pieces here",
        "10. Be2 Bg4 11. Bxg4 Nxg4 12. O-O": "still looks solid. ",
        "12... Qh4 13. h3 f5": "Looks good but white is allwed to take. 14. g4x Qh1+/Qh2 15. Kf2 and white is fine",
        "14. Na4": "T",
        "14... Rc8": "A",
        "15. c3": "K",
        "15... Bd6": "E",
        "16. b4": "G",
        "16... O-O": "4! specially now.. Rook is not on h8 anymore.. So no problems at all.",
        "17. Qe1": "okay i give up :P",
        "17... Qe7 18. hxg4": "hmmm one move after i did so he took it :P",
        "18... hxg4 19. g3 g5 20. Kf2": "Funny that the King ends up on f2 anyways ;) Still its a good position",
        "20... gxf4 21. exf4 Qh7 22. Rh1 Qd7 23. Rh5 Qf7 24. Rg5+ Kh8 25. Qh1+ Qh7 26. Rh5": "Nice movement for white ",
        "26... Qxh5 27. Qxh5+ Kg7 28. Ba3 Rfh8 29. Qg5+ Kf7 30. Qxf5+ Kg7 31. Qxg4+ Kf7 32. Qf5+ Kg7": "Black is looking for his white flag here",
        "33. Qd7+": "Good he found it ;)"
    },
    "url": "https://gameknot.com/annotation.pl/challenge-from-skippert?gm=42906",
    "gameName": "Challenge from skippert",
    "players": "ombrzeenamaha (1227) vs. skippert (1127)",
    "opening": "Amsterdam attack (A00)"
}