{
    "moves": {
        "1. e4": "Although e4 is a common opening move I tend to prefer d4. This game was an experiment for me. We will see how it turns out",
        "1... e5 2. Nf3 Nc6 3. Nc3": "Three knights game. Though I am unsure of the full implications of that",
        "3... Bc5 4. Bc4": "This seemed a good outpost for my lsb",
        "4... Nf6 5. d3 Ng4": "Possibly a little premature.",
        "6. O-O": "Getting the king safe early while that knight is on the prowl",
        "6... Nxf2 7. Rxf2 Bxf2+ 8. Kxf2": "Standard exchange though my development is now much better than blacks. I need to try to take advantage of this",
        "8... h6": "We are now out of the gameknot database. This is to cover g5 which is being pressed by my knight and my dsb",
        "9. Be3": "This was to prevent Nd4 which could become annoying",
        "9... d6": "Opens the diagonal for blacks dsb and still keeping his castling options open",
        "10. Nd5": "This seems a much better place for my knight, it's almost impossible to budge at the moment and causes maximum inconvenience for black, his queen now can't move on the d8-h4 diagonal",
        "10... Ne7": "Trying to budge my knight, black is clearly feeling the pressure here",
        "11. Qd2": "This seems a better location for the queen.",
        "11... Be6": "Pressuring my knight further but I dont want to move it. if he wants it he will have to take it\n",
        "12. Rf1": "Occupying the partially open row",
        "12... a6 13. Kg1": "Pushing the king into safer territory",
        "13... b5": "This is still pressuring the knight on d5\n\nAt this point I was looking at Nf6  and the possibilities that might open",
        "14. Bb3 a5 15. a4": "I'm not sure if this is better than a3. If 15 ...,bxa3 16 Bxa3 then I have a nice diagonal for my bishop, otherwise I am happy with it where it is",
        "15... c6": "At this time I am still considering some sort of knight sacrifice with 16 Nf6#, gxf6. 17 Bxh6 though I can see no clear way to force a win from there as the king still has an escape on the queen's side. ",
        "16. Bb6": "The queen has a number of options here, however I am looking at getting my knight to c7 which will lose black the right to castle and I think give a slight gain in material",
        "16... Qb8 17. Nc7+ Kd7 18. Bxe6+": "This is to put him under even more pressure, he almost has to take with his pawn which will mean doubled pawns restricting the kings mobility. Moving my f3 knight then clears the half open file towards his king",
        "18... fxe6 19. Nxa8 Qxa8 20. Bxa5": "Gives my queen a way to get around the back of all those black pawns",
        "20... bxa4 21. d4": "Looking to create a hole in the middle with something like 21 ... exd4, 22 Qxd4 then looking at getting my knight to e5",
        "21... Rb8": "trying to gain a passed pawn",
        "22. dxe5": "ignoring the threat and making some of my own",
        "22... d5 23. exd5 exd5 24. Qd4": "I think this may be a mistake, though it does defend the b pawn. I was looking at pushing the king further back with Qg4  and then bringing my knight and rook into the attack",
        "24... Qxa5 25. Qg4+ Ke8 26. Qxg7": "Looking at e6 which would trap the black king in",
        "26... Rxb2": "Black takes advantage of the slight lull in my attack and gains himself a passed pawn",
        "27. e6": "threatens the black rook",
        "27... Qc5+ 28. Nd4": "I now have RF8#",
        "28... Kd8 29. Rf8+ Kc7 30. Qe5+": "trying to tighten the noose on the black king",
        "30... Qd6 31. Qxd6+": "This turns out to be a fatal mistake. I'm not sure here what I could have done better. My thinking was that Ra8 could prevent black promoting.\r\n\r\nWould I have been better with something like 31: Nb5 , cxb5 32:qxb2 ",
        "31... Kxd6 32. Rf6": "Another error on my part. Ra8 was surely better",
        "32... a3 33. Kf2": "The end is looking near and my options are limited. ",
        "33... a2 34. Nb3 Rxb3": "At this point I'd had more than enough and resigned. This loss took my rating back below 1600. Only time will tell if I can raise it again"
    },
    "url": "https://gameknot.com/annotation.pl/challenge-from-cmatic?gm=19780",
    "gameName": "Challenge from cmatic",
    "players": "elwoos (1552) vs. cmatic (1541)",
    "opening": "Three knights game (C46)"
}