{
    "moves": {
        "1. e4 e5 2. Nf3 Nc6 3. d4": "The Scotch Game - sacrificing a pawn for development and an attack on f7.  White can choose 4. Nxd4 to continue with the Scotch Game, 4. c3 for the Goring Gambit, or 4. Bc4, the Scotch Gambit",
        "3... exd4 4. Bc4": "I like attacking so therefore I choose to play the Scotch Gambit, a dangerous opening if played incorrectly against",
        "4... Bc5": "...Bc5, one of the more common replies as it defends the pawn on d4.  4...Bb4  or transposing into the Guicco Piano with 4...Nf6 are also common",
        "5. c3": "\"sacrificing\" a second pawn to open the d-file for the queen ",
        "5... dxc3 6. Bxf7+": "Bxf7.  Much more exciting than 6. Nxc3 and also prevents Black from castling.  Still in main line",
        "6... Kxf7 7. Qd5+": "Regaining the bishop",
        "7... Ke8": "...Ke8.  Although it is an okay move, Kf8 seems to be a better choice.  In this game, it is a wasted move as the Black king goes to f8 anyway",
        "8. Qxc5 cxb2": "...cxb2.  Black elects to keep his pawn advantage, but gives my bishop a nice diagonal.  Bxg7 is now threatened",
        "9. Bxb2 d6": "Driving away the White queen and opening lines for the light-squared bishop",
        "10. Qh5+": "Qh5, keeping the queen in action on the kingside and opens up possibilities of a mating net on f7",
        "10... Kf8 11. Nbd2 Nf6": "Both trying to finish development",
        "12. Qh4 Bd7": "This move was a bit too passive for me.  12...Be6 seems fine and controls d5",
        "13. O-O": "Finally getting my king to safety...now the attack can commence",
        "13... Qe7 14. Rfe1": "Preparing e5",
        "14... Kf7": "...Kf7?  Trying to get the king's rook into action, but a bad time to do it.  This move is the beginning of the end for my opponent as the Black king walks into my attack.",
        "15. e5": "e5.  Forcing the win of material or an overwhelming position",
        "15... dxe5 16. Bxe5 Nxe5": "...Nxe5?  Better was Qd8; giving up the e-file but keeping the one pawn advantage",
        "17. Nxe5+": "If ...Ke8, ...Kf8 or ...Kg8, then 18. Ng6 winning material",
        "17... Kg8 18. Ng6 Qd6": "Choosing to keep the queens on the board",
        "19. Qc4+": "Qc4 !",
        "19... Nd5 20. Ne7+": "Ne7 .  Not Nxh8 as there is no point trading an active knight for a dead rook",
        "20... Kf8 21. Qxd5": "Offering to trade queens for an easy endgame",
        "21... Qb4": "...Qb4??  Better was to trade queens and push the queenside pawns down White's throat.  This move walks into a forced mate.  Can you find the move?",
        "22. Qf3+": "Qf3 .  Black can go quietly or prolong the game as much as possible.\r\n\r\nIf 22...Ke8, then 23. Nc6  ...Qe7 24. Rxe7  \r\nIf 22...Ke8, then 23. Nc6  ...Be6 24. Rxe6  ...Kd7 25. Qf7  ...Kc8 26. Re8  ...Rxd8 27. Qxd8  ",
        "22... Ke8 23. Nc6+ Qe7": "Choosing the quicker path",
        "24. Rxe7#": "Hope you enjoyed!  Feel free to leave comments"
    },
    "url": "https://gameknot.com/annotation.pl/challenge-from-black?gm=20786",
    "gameName": "Challenge from Black",
    "players": "myreaper8 (1483) vs. Black (1498)",
    "opening": "Scotch gambit (C44), Anderssen (Paulsen, Suhle) counter-attack"
}