{
    "moves": {
        "1. e4": "once again I'm aiming for the classic vienna game, get the quick attack and snap crackle and pop fun!\r\nThat or I may just try a quick bishop  knight aimed assualt",
        "1... e5": "typical response, I've played this roughly about 1500 times. the result..........varies every time. Better than the sicillian I guess. now vienna or bishop's.",
        "2. Bc4": "The blind bishop Strolls down the diaganal aisle to the alter",
        "2... Qf6": "Urk......Trying for a scholar's mate probably, easily blocked",
        "3. Nf3": "Counter attack puts pressure on the center and adds an attack to the e pawn also blocks any chance of the \"scholar's mate\"",
        "3... Nc6": "Developmental opening here. I've played a lot of games, but not many like tihs, I think he's trying to throw me off my guard here with something flashy or is it fancy?",
        "4. d3": "haha! Let's get my black bishop in play and aim for an assualt on the queen and f pawn!",
        "4... Bb4+": " Beginning move easily defendable. Here's a lesson for you simron don't do checks when they can be blocked by pawns and force you to retreat",
        "5. c3": "This is getting funner by the minute, yet I'm still on edge probably the cause is her royal majesty sitting off on f6, preparing a wonderful little royal checkmate just for me",
        "5... Bc5": "ah ha, the attack is sprung perhaps there was a reason for that bishop check after all, move my knight.........and i'm history, partner",
        "6. Bg5": "zap! !!!!!!!!!!!!!!!1Qd6 or bust,cowboy.....",
        "6... Qg6": "ah, forgot about that now didn't I. At this point I looked up in the sky and said god help me and give me some wisdom. The response, well I actullay just took a step back and said commandment number 1 : look at the whole position first and from there decide your best course of action. The best course of action here. Play it safe and don't push your foot into the ground hog's hole, it might not come out again.",
        "7. O-O": "brilliancy in the stroke of possible diaster",
        "7... d5": "? a blunder , free pawn for the taking. now that i'm looking at i'm laughing at myself. If i take pawn. he could of just done h6, i move my bishop off and then he does bh3. .......i don't know i think he should of thought it over a bit more before making his next move following my pathetic capture.",
        "8. exd5": "rushing moves. ",
        "8... Na5": "ah, looks like our long tall texan bishop just met with death ..........or did he. Believe it or not this knight move is a blunder.",
        "9. Qa4+": "AhHAH! The knight falls into enemy clutches, a near queen trap follows and its a dead knight man",
        "9... Bd7": "yep, have to block the check or never castle again",
        "10. Qxa5": "He shot the horse!",
        "10... Qb6": "forced queen exchange, weird point to do so, lesson number 342 B : never exchange material when your down.",
        "11. Qxb6": "Sweet, the more you trade , the more you win",
        "11... cxb6": "for once i have nothing to say other than that looks like cassiopea laying diagonal on the upper left, carry on",
        "12. Nxe5": "The center is taken, fall back, fall back!",
        "12... Bf5": "look out roadrunner is running roads again",
        "13. d6": "here comes wiley coyote and porky pig",
        "13... Bxd6": "MUHAHah! Oh sorry did I just manically cackle......",
        "14. Nxf7": "Z pawn is dead!",
        "14... h6": "Hagar the horrible coming downhill, watch out or the falling caveman will get you............!",
        "15. Nxh8": "who cares about the caveman I just got lunch!",
        "15... Rc8": "Lesson number 47Z: take when ever possible when it won't kill you of course.",
        "16. Be3": "The jailbird just made a break for it and made it out alive",
        "16... a6": "no need for pawn moves here, you need to attack the castle!",
        "17. Nf7": "ok, now that's brilliant.......{snort} I miss the fact I could of had that knight .................again and I move the totally fine knight in front of my attack on the other knight, now that's brilliant or what.",
        "17... Bg4": "not sure the point of this move, centralizes bishop threatens an attack on the rook? probably a waste of time that or just became a blind donkey who keeps hawing at his own jokes",
        "18. Nxd6+": "now it's about time I find out what I'm suppose to be doing, oh yeah,checkmating. nice fork and discovered attack. ",
        "18... Kd8": "only decent move",
        "19. Nxc8": "yep. textbook manuever that was",
        "19... Kxc8": "capturing the mad horse thief",
        "20. Bxb6": "and I settle for a wimpy peasant instead of the majestic sir.lancelot. I may not be too worried about losing at this point, but still forgetting that knight exists is pretty pathetic on my part indeed",
        "20... Be2": "counterattack. Better was Ne7 that would of saved his knight and kept him in the running a little longer. I'm glad here that he decided to contiune playing and not just resign. It's a great self teaching tool to continue playing even when all hope is lost",
        "21. Re1": "The only reasonable move,counter attack the bishop, sets up for possible mating threat on the back row with bishops and that rook.",
        "21... Bg4": "good move, really good seeing my bishop coming over and taking that diagonal and then the rook coming down for the mate",
        "22. h3": "chasing away the protector",
        "22... Bh5": "great move blocking the mating square",
        "23. Be6+": "check, ok, now how am I going to get my rook over to the back row?",
        "23... Kb8": "only possible move unless your a trapeeze daredevil",
        "24. Bd7": "ok coming over and now again how am I getting the rook over there?",
        "24... Nf6": "yep, great defense adds yet another protection on the mating square and an unpredicted attack on the bishop. i'm saying to myself right now, wow this guy is the number one in defense in the league.",
        "25. Bf5": "logical. Poor doctor McCoy , he doesn't get to say he's dead Jim.",
        "25... Bf7": "again great d there's a problem with this move though, re7 then bishop backs up and r goes over to c7 for a vicious almost unstoppable mating attack",
        "26. Re5": "ok, i went for the less brilliant option and like a caveman yawned and happened to move my rook foward 4 or is that 5?",
        "26... Nd7": "best D in the world here, only problem is that knight just jumped off the cliff and into a nuclear testing range",
        "27. Bxd7": "zap. BOOM! The bomb just went off and the attack becomes invincible",
        "27... g5": "pawn move? relaizing all hope is lost and now all that is left if to postpone the meeting with the reaper",
        "28. Rc5": "yep. mate in ! now,",
        "28... Bd5": "{grin} Take me, take me instead!",
        "29. Rc8#": "Nope sorry bro, I've got a date with the mob boss out of town in 5 minutes and I can't be late. Good game simron, well played especially near the end. I hope you look at this annotation and learn a good deal from it, the beginning and end were especially brilliant. i hope my annotation was entertaining and this is Gator the Warrior signing off until next time on the Guppet Show!"
    },
    "url": "https://gameknot.com/annotation.pl/challenge-from-gatorwarrior?gm=27483",
    "gameName": "Challenge from gatorwarrior",
    "players": "gatorwarrior (1440) vs. simron (833)",
    "opening": "Bishop's opening (C23)"
}