{
    "moves": {
        "1. c4": "I've always like the English Opening. White will aim to control the light squares in the center of the board.",
        "1... c5": "Black responds symmetrically. The game could easily transpose into a variation of the Sicilian at this point.",
        "2. Nc3 g6": "Black plays for a flank attack, keeping his center Pawns in reserve for the moment. Very Hypermodern-like.",
        "3. Nf3 Bg7": "I, too, hold back my center Pawns. Black follows up with the completion of the fianchetto.",
        "4. g3 Nc6 5. Bg2": "If Black were to develop his King Knight, the position would be entirely symmetrical. I'm not afraid of playing for a draw and trying to squeeze a win in the endgame.",
        "5... e5": "The first center thrust...",
        "6. e4": "...and I parry. Black still has the option of going for symmetry.",
        "6... Nge7": "Now the game really begins, as symmetry is broken.",
        "7. O-O f5": "Black wants to seize a central advantage...",
        "8. d3": "...which I prevent.",
        "8... Nd4": "Black offers to trade Knights. This would plant his Pawn at d4, but I feel I get sufficient compensation by being able to place my Queen Knight at d5 after the exchange.",
        "9. Nxd4 cxd4": "This capture leaves me with a Queen-side advantage in the potential endgame. I would have used the e-pawn instead.",
        "10. Nd5 O-O": "Black completes his development. The Knight on e7 is vulnerable to the pin...",
        "11. Bg5": "The pin, they say, is mightier than the sword. I'm not sure how Black can escape without material loss. 10...Nxd5 was probably a better alternative, to be followed by 11...O-O.",
        "11... Rf7": "The best Black can do now is end up down the Exchange.",
        "12. Nxe7+": "The logical follow-up. I was expecting 12...Rxe7 13 Bxe7 Qxe7, which would have left me with an exchange up but still some work to do to secure the win.",
        "12... Kf8": "Catastrophic. Now the killer discovery seals things quickly.",
        "13. Nxg6+": "Black resigns, as he loses his Queen if he plays on."
    },
    "url": "https://gameknot.com/annotation.pl/challenge-from-thehellion?gm=26836",
    "gameName": "Challenge from thehellion",
    "players": "thehellion (1278) vs. x-machine (1181)",
    "opening": "English (A34), symmetrical variation"
}