{
    "moves": {
        "1. d4": "basic opening ",
        "1... d5 2. c4": "queens gambit ( played this a few times.... got a feeliong he'll take this )!!",
        "2... dxc4": "oh i'm surprised - not lol",
        "3. e4": "thought of knight c3 but then thought try to gain control of the centre with king pawn",
        "3... b5": "expected this move had it recently against other player.  not keen on it hence my previous thought knight c3 which i have played before. obvious he's defending his pawn",
        "4. a3": "did this to allow my knight out to c3 without him being able to force me to move it again by moving to b4",
        "4... g6": "wasn't expecting that - i think this is to attack a1 rook with bishop whilst defending h8 rook",
        "5. Nc3": "continue with my knight c3 move attack his pawn forcing a defensive move and protects king pawn as secondary measure",
        "5... Bd7": "i suspect this is to protect pawn whilst keeping pawn defense intact",
        "6. Qf3": "perhaps not the best move but bring this out for a cheeky attack on king via f7 pawn.  mproviding of course i can get some kind of back-up without him noticing",
        "6... c6": "mmmm think now that this was previously planned on bishop move---I think now he may have expeceted queen move. i think this is to protect an attack on his a8 rook with my queen",
        "7. a4": "maybe another ambitious move to attack pawn forcing either a take or bypass to allow me to capture c4 pawn with my bishop or if he leaves it i'll take it anyway pawn for pawn and expose my rook in process",
        "7... Qa5": "not at all what i wanted traps my knight. This has put a bit of pressure on me now. I assume this is the intention. This will now also prevent me taking his pawn.",
        "8. Be2": "Best bet now for me is to make room ready for castleing and try to see his intentions---",
        "8... Bg7": "expeceted this move soon",
        "9. e5": "Needed to protect d4 pawn also c3 knight and a1 rook. I think this is best way as it also pushes me up the board sort of attack and defense in one",
        "9... e6": "Not sure on this move i think this is just to stop my pawn advancing any further",
        "10. Nh3": "speaks for itself allowing room for castling",
        "10... Ne7": "oh i see should have realised really allows knight out---is this to castle or attack c3 knight ?? I'll assume castle as i have queen to protect knight and can still move bishop to d2",
        "11. O-O": "alas i can castle !! will he ?",
        "11... O-O": "that'll be a yes then",
        "12. Bd2": "allows rook to protect rook and in turn pressure his queen into moving",
        "12... Qb4": "good expecting this now plan attack on his a8 rook with my knight expecting to lose my black bishop and pawn on levelling then points and opening up the game",
        "13. Nd5 Qxd2 14. Nc7 Qxd4 15. Qc3 Bxe5 16. Nxa8 Qd6 17. Rad1 Bxh2+ 18. Kh1 Nd5 19. Qa5 a6 20. g3 Qe5 21. Rfe1 Bxg3 22. Bg4 Qf4 23. fxg3 Qxg4 24. Kh2 e5 25. Qd2 Qxh3+ 26. Kg1 Qxg3+ 27. Qg2 Qxg2+ 28. Kxg2 f6 29. a5 Re8 30. Re4 f5 31. Rh4 Ne3+ 32. Kf2 Nxd1+ 33. Ke2 Nxb2 34. Nb6 Be6": ""
    },
    "url": "https://gameknot.com/annotation.pl/challenge-from-willikizz?gm=18810",
    "gameName": "Challenge from willikizz",
    "players": "dardon (1327) vs. willikizz (1438)",
    "opening": "QGA (D20), 3.e4"
}