{
    "moves": {
        "1. d4 f5": "I don't play the Dutch Defense anymore, after getting a cramped position from this game, now I think that 1...c5 is the sharpest move against 1.d4",
        "2. e3 e6 3. Qh5+ g6 4. Qd1 Nf6 5. f4": "This move locks the center and kingside from expanding, so most of the expansion ideas will lie on the queenside. ",
        "5... c6": "Creates flexible ideas such as a b5-boost, a Na6-Nc7 maneuver, and also secures control of the light squares.",
        "6. Nf3 a5": "This almost forces White to stop b5, because if I take control of the queenside and get to have maneuvering space there, then White doesn't have much maneuvering space on any other side of the board, so White shouldn't allow b5",
        "7. a4": "c4 might be a better way to stop b5, but White wanted the pawn on c3 to secure the dark-pawn chain. ",
        "7... Na6": "Bxa6 is worth consideration since knights are usually better than bishops in closed positions, but I think this just frees up a lot of space on the queenside, and I can eventually make a b5 breakthrough and my bishop pair will become active later.",
        "8. c3 Nc7": "In closed positional positions, you should always keep track of which squares are weakened after certain pawn advances, and try to post a knight there. White's a4 inaccuracy has weakened b4, even though c4 also weakens b4, c4 controls d5, and now if c4, then b4 becomes extremely weak, so a4 not only weakens b4, but also weakens d5 since the c-pawn is stuck securing b4.",
        "9. Bc4 Ncd5 10. O-O b6": "I intended Ba6, trading my bad bishop for White's good one. If White doesn't want to trade, then my bishop is good on the a6-f1 diagonal, so White should just allow the trade.",
        "11. Qe1": "The only reason I can see for this move is to play Qh4 if i castle kingside, but I haven't castled yet, and never castled in the game, so this wasn't really an active move.",
        "11... Ba6 12. Bxa6 Rxa6 13. Qe2": "Yes, my rook looks oddly placed on a6, but rooks don't have much influence on closed positions, and it might actually save a tempo if I plan to double or triple my major pieces on the a or b-file once the queenside is opened up",
        "13... Qc8 14. Ne5 Qb7": "There isn't really much else to do in this position, and the only chance of breaking open would be to fight for a b5 boost",
        "15. Na3 Bg7": "The only way I can try to make progress is to get my h8-rook to b8 to try the b5 boost. But this probably wasn't the best place to move my bishop, because now White can eye the d6 weakness.",
        "16. Nac4 Ne4 17. Nd2 Ndf6": "My knights are posted in the center, and White cannot take advantage of my d6-weakness, so I have nothing to worry about, and can continue to think of queenside expansion ideas.",
        "18. Ndf3": "This allows b5, but b5 might be too risky to play now, since my queen and rook are the only pieces on the queenside.",
        "18... d6 19. Nc4 Ke7": "King safety is most important in dynamic open tactical positions, but here my king is perfectly fine on e7, and is probably the best place for my king. ",
        "20. Ncd2": "White keeps giving me the chance to play b5, but I just thought it was too risky to play it, since it might permanently weaken my position.",
        "20... c5": "The only way to break open this drawish position is to challenge White's iron grip on the dark squares. My idea was Nd7 e5, but opening up the center would probably benefit White, who is developed in a more orthodox fashion. If the position never gets opened, then both sides will just be maneuvering pointlessly unable to find some way to generate play, often in lifeless positions, one side will get tired of the boring position, start making pointless maneuvers, and allow the opponent to make progress",
        "21. Nxe4 Nxe4 22. Nd2 Nf6": "The knights have been removed from blocking the center, so now White has a new plan of expanding with e4.",
        "23. Re1 d5": "Since opening the position will be horrible for my king, I decided to just completely lock the center, and hope that I will somehow progress with my queenside space.",
        "24. b3": "Ba3 is nothing to be afraid of, Nd7 will defend the pawn",
        "24... h5": "I couldn't really see any way to do anything in this position, so now I was just trying to secure the kingside. Playing lifeless positions like this can be tiring and make you want to destroy things, but positions like this can get interesting toward the end when one side finally does generate play.",
        "25. Ba3 Nd7 26. Rac1 Kf7": "Getting my king off the diagonal is all there is to do.",
        "27. Nf3 Ra7": "The only way I could possibly generate play would be to maneuver my major pieces around and make a b5 boost effective, otherwise this position is a dead draw.",
        "28. Qb5 Bf6": "Just controlling the knight's possible squares and making my bishop more flexible.",
        "29. h4": "Now White has really locked the position, and stopped all play on the kingside.",
        "29... Qa6": "This is the only way to get the queen off b5 and to continue planning a b5 boost. If White trades, then that frees up space for my rooks to double on the b-file, play b5, and then dominate the b-file with the rooks.",
        "30. c4": "White allows me to make the trade, so now that a pawn is going to move, finally some play has been created in the position.",
        "30... Qxb5": "This trade clears up more space for White's pieces than for mine, so it probably wasn't good, but I couldn't resist finally opening up some space",
        "31. cxb5": "axb5 was probably better, which brings a pawn on the edge toward the center. axb5 threatens cxd5 exd5 dxc5, but I can gain dynamic control of the a-file after a4, but whichever way White had recaptured, at least the position is not locked and drawish anymore.",
        "31... Rc8": "Defending the c-file is important, because I have no open files, but White has an open c-file, ",
        "32. dxc5": "White wanted to give me a very weak c-pawn that can be taken advantage of with Rc2 Rec1,",
        "32... bxc5 33. Rc2 Rac7 34. Rec1 c4": "After this boost, I should have a slight advantage, but not a huge one",
        "35. bxc4 Rc7xc4 36. Rc2xc4 Rxc4 37. Rxc4 dxc4": "Endgames with only minor pieces tend to be less common than the frequently occuring rook endgames, since minor pieces are usually traded off before rooks. In endgames with only minor pieces, the maneuvering is usually slower and more strategic than most endgames.",
        "38. Kf1": "Having an active king is probably the first rule of endgames that most players are taught. Here White's king should be on the kingside, to contain my passed pawn and to help his passed pawn advance later.",
        "38... Nb6": "I take this opportunity to snatch off the a-pawn",
        "39. Nd2": "This move hangs the h-pawn, but also threats the c-pawn if Nxa4, but I'm not sure if losing the h-pawn is better than letting me snatch the a-pawn",
        "39... c3 40. Nb3": "but White ",
        "40... Nxa4 41. Nxa5 Bxh4": "Now I'm up a solid pawn, which is usually enough to win in minor piece endgames where the bishops are on the same color, but here White might be able to hold a draw, since my king doesn't have an easy path to activity. All I need to worry about is not letting White promote, and not letting him win my c-pawn for free",
        "42. Ke2 Bf6 43. Kd3 Nb6 44. Nc4": "My advantage here is my extra h-pawn, which can't be taken advantage of yet, since I can't create a passed pawn with it, I need to worry about getting my king active first",
        "44... Nd7 45. Bb4": "White will win my passed pawn, so he can probably get a draw after all, but perhaps I could win the b-pawn and win with my majority on the kingside",
        "45... e5": "for now all i can do is free up some space and get my king active",
        "46. Bxc3 Nc5+ 47. Ke2 exf4 48. Bxf6 Kxf6": "Here, White should just take my f-pawn and he can probably draw since I will have to contian his passed pawn, but watch how he loses by getting impatient and trying to rush things.",
        "49. Na5": "?? this is a blunder, and his next move is even worse. Passed pawns are not that strong in minor piece endgames, and you shouldn't rush to advance them. Advancing a passed pawn in a minor piece endgame may only win a piece, and a piece is only equal to about 2 pawns in endgames like this, pawns are valuable, and White is neglecting his pawns",
        "49... fxe3": "Here White should probably take the pawn and maybe draw if he's lucky, but White thought his only chance to draw was to rush the passed pawn and win my knight quickly, but that brings his knight far away from the action, while i can make progress with my pawns",
        "50. b6 f4 51. b7 Nd7": "rather than taking immediately, this makes white waste another move",
        "52. Nc6 g5 53. b8=Q Nxb8 54. Nxb8": "A minor piece can usually hold a draw against a three-pawn majority, but here the knight is far from the action and my pawns are already advanced, so I don't think he can hold a draw",
        "54... h4": "White can't make progress with his king since it's stuck sotpping my passed e-pawn, while I have enough time to create another passed pawn with g4-h3, and the king won't be able to stop both of them, the only question is, can White's knight stop the pawns, or am I unstoppable even if the knight was closer?",
        "55. Nd7+ Kf5 56. Nc5": "If the knight was a light-squared bishop, then maybe White could draw by shifting the bishop along the a8-h1 diagonal, but the knight is slow and can be kicked around, so I don't think White has a chance here.",
        "56... g4 57. Nd3 h3": "Now all of my pawns will be passed after White trades, and his pieces aren't in a position to stop them",
        "58. gxh3 gxh3 59. Kf3 h2 60. Kg2 f3+": "White took on h2 here, but actually his best chance is to take on f3 and then take the e-pawn after I promote, which goes into the endgame of queen vs. knight, which is an easy win to a skilled player, but can be tricky if you don't know the technique. Hoping that I can't win queen vs. knight is just about all White can hope for now.",
        "61. Kxh2 Ke4 62. Nc5+ Kd5": "My king needs to attack the knight from a non-checkable square in order to make progress",
        "63. Nd3 Kd4 64. Ne1": "After Nf4, I play e2 and White cannot stop promotion",
        "64... f2 65. Nf3+ Ke4 66. Kg2": "This is the only move that doesn't allow immediate loss, and my pawns cannot promote safely, so I think there is only one winning line here, but I could be wrong.",
        "66... f1=Q+ 67. Kxf1 Kxf3": "Now I have the opposition, and I win. If it was my turn to move in this position, then White can hold a draw by shifting his king on e2 and e1, and then moving two squares above me whenever my king goes to the same rank as the pawn, and e2 Ke1 is also a draw since leaving the pawn defended is stalemate, but since it's White's turn here, he can't hold a draw since I have the opposition, and I can force promotion",
        "68. Ke1 e2": "White resigned, an exciting ending to a boring opening"
    },
    "url": "https://gameknot.com/annotation.pl/challenge-from-doconnie?gm=10484",
    "gameName": "Challenge from doconnie",
    "players": "doconnie (1768) vs. byakuugan3 (1789)",
    "opening": "Dutch (A80)"
}