{
    "moves": {
        "1. c4": "This is a game that I played against Umberto15.  He very kindly challenged me to a game. We played before and I probably did not give him a match but hope I put up a bit of a fight this time.",
        "1... a5": "After c4 I went with a5.  This pawn will be protected by the knight when it goes to c6. ",
        "2. Nf3": "White develops his knight with the move Nf3.",
        "2... Nc6": "Black now develops his knight with the move Nc6 and protects the a5 pawn along with the rook.  The knight along with the pawn is also covering the b4 square.",
        "3. Nc3": "White develops his other knight with Nc3.",
        "3... e6": "Black moves pawn to e6 and allows the DB to access the diagonal to a3.",
        "4. g3": "White goes with pawn to g3 to fianchetto his LB.",
        "4... d5": "Now black is creating some tension with pawn to d5 and white's pawn at c4.  This square is also being attacked by white's Nc3.",
        "5. cxd5": "White removes the tension with cxd5.",
        "5... exd5": "Black replies with exd5.  The pawn is protected by the queen on d8.",
        "6. Nxd5": "White captures the pawn with Nxd5.",
        "6... Qxd5": "Black recaptures with Qxd5.",
        "7. Bg2": "White fianchetto's his LB and is pointing to a8 and the black queen is on this diagonal at d5.  At present white's knight is at f3.",
        "7... Bd6": "Black develops his DB to d6 and is covering 2 diagonals to a3 and h2.",
        "8. O-O": "White castles short.",
        "8... Nf6": "Black develops his knight with the move Nf6 and this will enable him to castle.",
        "9. d3": "White moves pawn to d3 allowing his DB to access the diagonal to h6.",
        "9... Nb4": "Black moves Nb4 and is using his pawn at a5 provides a useful protector should white push a pawn to attack the knight.",
        "10. Nd2": "White moves his knight at f3 to d2 and the LB at g2 is attacking the black queen on d5.",
        "10... Qf5": "White moves the queen to f5 and the queen is now on the same diagonal as the LB at c8.",
        "11. Ne4": "White moves his d2 knight to e4 and is attacking both the knight at f6 and the DB at d6.  Not sure I had expected this or gave much consideration to where the knight was going after d2.  I just took the queen out of the way of the LB so I could not really do much about the knight.",
        "11... Ng4": "Black moves one of the pieces attacked ie, the knight to g4 I am attacking h2.",
        "12. h3": "White pushes pawn to h3 trying to move the knight away.",
        "12... Be7": "Black is now able to remove the DB with the move Be7 and is now not able to be captured by the e4 knight.",
        "13. hxg4": "But after white moves the DB white still captures the knight at g4 and this gives access to the h file for black.  Also white has doubled pawns on the g file.",
        "13... Qxg4": "White captures the pawn at g4.",
        "14. a3": "White pushes another pawn out to remove b lack's knight on b4.",
        "14... Nc6": "Black moves Nc6 and removes his knight from capture.  Its not clear whether black will castle short as it may be useful to keep the rook on h8 since the file is open.",
        "15. Bf4": "White now develops his final piece to f4.  This piece is on the diagonal covering the squares h6 and c7",
        "15... Bf5": "Black develops his LB to f5 and is attacking the knight at e4.  This also now leaves black able to castle long.",
        "16. Nc3": "White moves his knight from e4 to c3.",
        "16... Rc8": "Black moves his a8 rook to c8 to cover the attack on black's c7 pawn and this means black won't be castling long.  There was a weakness on the king side since the pawn had been pushed out to a5 already.",
        "17. e4": "Now white pushes a pawn to e4 and is attacking black's LB at f5.",
        "17... Qxd1": "With the pawn moving out it left white's queen available so black captured the queen knowing that this would be recaptured by white.",
        "18. Raxd1 O-O": "After white recaptured black's queen black castled short.  This may not have been the best move in fact it probably could have spelled the end for black.  Since it all looks very even at this point.",
        "19. exf5": "A better move by black instead of castling may have been Be6.  But black's LB was still on f5 and white captured it with the pawn at e4.",
        "19... Nd4": "Another move is made by black and it again seems to have been a mistake.  Black moves his c6 knight to d4 to avoid capture by the LB maybe but forgot about the pawn at b7 which is now ripe for the taking and no protection.",
        "20. Bxb7": "White captures the pawn with his g2 bishop but he is now attacking the rook at c8.  Black could move the rook but the rook is protecting the pawn at c7 which is now under attack by the DB at f4.  It never rains but it pours.",
        "20... g5": "Black decides to divert the attention of white's LB at b7 with a counter-defence moving pawn to g5 attacking the DB at f4.",
        "21. Be5": "Black's plan halted the LB's attack but it only sent the DB onto e5 and white's DB is now attacking both d4 knight and c7 pawn.  Whilst the LB is still attacking the c8 rook!  White is attacking 3 pieces at once.  But he can only take one at a time thankfully.",
        "21... Nxf5": "So I remove one of the targets from white's clutches which enables me to protect the DB with Nf5.",
        "22. Bxc8": "I left the rook under threat on c8 as the attacker could be recaptured.  White did capture the rook at c8.",
        "22... Rxc8": "I recapture the LB.",
        "23. Nd5": "White brings his knight to d5 and is attacking my DB at e7.",
        "23... f6": "I attempt an attack on the DB which is proving very powerful but this may backfire.",
        "24. Nxe7+": "With white's move Ne7 he checks the black king and this means that black is unable to continue his threat on the DB.",
        "24... Nxe7": "However black is able to capture the knight but this is leaving the DB with an attack on pawn at f6.",
        "25. Bxf6": "As expected white captures the pawn at f6 and is now attacking pawn and knight on g5 and e7 respectively.  Aaargh  I think umberto is giving me a free lesson on how to use your pieces wisely and effectively.  I will try to use this lesson in my future games, why attack one piece when you can attack 2!",
        "25... Nd5": "Black brings his knight to d5 and is attacking the DB.",
        "26. Bxg5": "But white is able to move out of the knight's grasp with the capture of white's pawn at g5.  Now my poor king has 1 pawn to protect it!",
        "26... Kg7": "Black decides he has to use his king now to fight alongside his forces so the king moves to g7.",
        "27. Rdc1": "White moves his d rook to c1 and is attacking the pawn at c7 which is protected by the knight and rook.",
        "27... Rb8": "Black decides he needs to reduce the white pawn count and with Rb8 is attacking pawn at b2.",
        "28. Rc5": "White moves Rc5 and is attacking 2 pieces (again), the pawn at a5 and knight at d5.",
        "28... c6": "White moves his pawn up to c6 and is protecting the knight but is still at threat of capture.",
        "29. Rxa5": "White captures the pawn at a5.",
        "29... Rxb2": "Now black captures the pawn at b2.",
        "30. Rc1": "White moves his f rook to c1 and is attacking the pawn at c6 which is unprotected.",
        "30... Nb4": "Black moves his knight to b4 and is protecting the pawn but is at risk from capture by the pawn at a3 but this move would result in capture by black's rook.  However this will leave black's pawn to be captured by the rook at c1.",
        "31. axb4 Rxb4 32. Rxc6": "After the moves were made black was left with 1 pawn and 1 rook and is minus a knight and a pawn.  White has 2 rooks, DB and 3 pawns.  Does not look good for black.",
        "32... Rb7 33. Re5 Rf7 34. Re7": "Black moves his rook down to b7 thinking that the white rooks cannot check the king at least while the rook is on the same rank.  White moves his rook along to e5.  Black moves his rook along to f7 alongside the king.  White moves his rook to e7 and black decides it is time to resign.\n\nThanks umberto for showing me some great moves which I will try to incorporate in my games and give my opponents a hard time.  On the whole you allowed me to play a game and not shut me down completely but helped me to gain some knowledge.  I cannot say at any time I expected to beat you but had a fun time trying. "
    },
    "url": "https://gameknot.com/annotation.pl/challenge-from-umberto15?gm=62421",
    "gameName": "Challenge from umberto15",
    "players": "umberto15 (1596) vs. milly64 (1046)",
    "opening": "English opening (A10)"
}