{
    "moves": {
        "1. e4": "This time, I acceded to Freddy's desire to teach me a lesson on Alekhine's Defence.  We follow my recent Oxford & District League game for a short while.",
        "1... Nf6 2. d4 Nxe4 3. Bd3 d5 4. c4 Nc6": "! Freddy varies first.  In my previous game, Black never even go to move this N.  Black immediately counter-attacks.",
        "5. Ne2": "rather than 5. Nf3 when 5.... Bg4 would pin the defending N",
        "5... Nf6": "an unexpected retreat, but entirely consistent with Freddy's rope-a-dope strategy.",
        "6. Nbc3": "developing another piece and resuming the attack on d5",
        "6... dxc4": "so Black swaps",
        "7. Bxc4 e6": "and calmly develops",
        "8. O-O": "Now I seem to be well ahead with my development, at the cost of a pawn, so the gambit still appears to be working at this stage.",
        "8... Bd6": "an aggressive square, the full implications of which I don't stop to consider.",
        "9. Bg5": "?",
        "9... Bxh2+": "and pay the price.  Now if 10. Kxh2 Ng4  11. K moves, Qxg5.  I see no point in swapping bishops when two pawns down, so decline.",
        "10. Kh1 Bd6 11. Ne4": "Trying to attack while Black is still uncastled",
        "11... Be7": "Black maintains his shape",
        "12. Nxf6+": "pretty much forced",
        "12... Bxf6": " ",
        "13. Be3": "but another swap seems pointless",
        "13... O-O 14. g3": "played with a view to playing Kg2 and then using the half-open h-file to attack Black's newly castled king but Black quickly shows the folly of such thinking.",
        "14... Qd7 15. Kg2 Rd8": "lining up an attack on my Q to worsen the effect of the threat to h3",
        "16. Bb5": "?? pinning the N against the Q but inviting a fork with check",
        "16... Qd5+ 17. f3 Qxb5 18. Rb1 Ne5": "exploiting the pin on the d-file",
        "19. Nf4": "freeing my Q from defending the N",
        "19... Nc4": "attacking both e3 and b2",
        "20. Qe2 Nxe3+ 21. Qxe3 Bxd4": "another pawn ...  I could safely resign but Freddy likes to play to the end.  It's good for his opponents' souls!",
        "22. Qe4 e5 23. Nd3 Be6 24. Rfh1": "at last implementing my attack!",
        "24... f5": "easily shrugged off",
        "25. Qe2 Bc4 26. Rhd1 e4": "Black piles on the pressure",
        "27. fxe4 fxe4 28. Qg4": "at least avoiding the pin after 28. Qxe4",
        "28... exd3 29. b3 Qc6+ 30. Kh2": "I think it was around here that Freddy announced Mate in 9.  No doubt his notes tell us exactly when!",
        "30... Rd6 31. bxc4 Rh6+ 32. Qh3 Rf8 33. Rd2 Rxh3+ 34. Kxh3 Qh6+ 35. Kg4 Qe6+ 36. Kh4 Bf6+ 37. Kh5 Qf5#": ""
    },
    "url": "https://gameknot.com/annotation.pl/challenge-from-rjacobs?gm=21313",
    "gameName": "Challenge from rjacobs",
    "players": "rjacobs (1501) vs. easy19 (2244)",
    "opening": "Alekhine's defence (B02)"
}