{
    "moves": {
        "1. e4": "1. e4 establishes foothold in the center of the board and opens diagonals for both the kingside bishop and queen.  Strong first move.",
        "1... e5": "1...e5 responds symmetrically, refusing to concede space to white.  While symmetric moves maintain space, white still has the initiative.  Black needs to be careful not to fall into a trap.",
        "2. Nf3": "Strong 2nd move, developing a minor piece to it's most centralized square and threatening the undefended black e pawn.  Developing a kingside piece also speeds castling.",
        "2... Nf6": "Petroff's defence, sometimes called the Russian defense, maintains symmetry.  The e pawns are usually cleared leading to an open game where black tries to maintain a central knight on e4.",
        "3. Nxe5 Nxe4": "? (Bad move)\n\nEven though this seems to maintain symmetry, white either gains material or a positional advantage with 4. Qe2 (ie 4...Nf6?? 5. Nd6  winning black's queen, or 4...d5 5. d3 Qe7 6. dxe4 Qxe5 7. exd5 winning a pawn).\n\nThe main line is d6, forcing the white knight to retreat.",
        "4. Bc4": "Developing move, threatening f7.",
        "4... d5": "! (Good move)\n\nEstablishing a center, attacking the bishop and defending the knight.",
        "5. Bb5+": "?! (dubious move).\n\nThis was a pointless and allows black to create a pawn chain with tempo.",
        "5... c6 6. Ba4 b5": "Development would be better.",
        "7. Bb3 Bc5": "Attacking f2.",
        "8. O-O O-O 9. d3": "The thought was to drive away the knight, but d4, attacking the bishop and defending the d5 knight, is better.",
        "9... Bxf2+": "!? (interesting move - may not be the best)\n\nTrading bishop and knight for white's rook and pawn.  Materially, it's an even trade, but since black is trading away his developed pieces, I feel the trade is better for white (assuming white takes advantage of the situation).  If black can get his other minor pieces developed and take control of the open e file with his rooks, he may get a winning attack considering white's exposed king.",
        "10. Rxf2 Nxf2 11. Kxf2 Qf6+": "This is early considering black has nothing to support the attack and the knight isn't in danger since it can be pulled back to interpose and defend the king.",
        "12. Nf3 Nd7 13. Nbd2": "Overprotecting the knight (from 13...Ne5), but unneccessary.  It also blocks white's dark bishop.  Better would be c3, blocking the a1-h8 diagonal, supporting d4, and allowing the white squared bishop back into play.",
        "13... Ne5 14. c4": "? (Bad move)\n\nI was expecting the pawn trade, but overlooked Nxd3 .  I tend to play too quickly, especially when tired.  :)",
        "14... Nxd3+ 15. Kg1 Nxb2 16. Bxb2": "13. Qc2 Nd3 (or Nb4) 14. Rb1 followed by Bb2 after removing the knight would probably have been better.  Not sure why I decided to trade instead.",
        "16... Qxb2 17. Rb1 Qf6 18. cxd5 Bd7": "Clearing the back rank.  Black needs to post a rook on the e file.",
        "19. Qc2": "I was probably trying to clear the back rank to allow my rook to move to the e or f files, but overlooked ...Bg5",
        "19... Bf5 20. Ne4 Qe7 21. Re1 Rae8 22. d6": "White attacks the queen to remove her from the e file.  I expected something like 22...Qd7 23. Nc5 Qxd6 24. Qxf5.\n\nNfd2 would have further protected the knight on e4, but I didn't see it at the time.",
        "22... Bxe4": "? (Bad move)\n\nOverlooking the intermediate move 24. exf8=Q .  Though even without the check, black still has trouble recapturing the pawn after 24. Bxc3.",
        "23. dxe7 Bxc2 24. exf8=Q+ Rxf8": "Kf8 is better, contesting the e file.",
        "25. Bxc2 f5": "?! (Dubious move)\n\nWeakens the king, though after ...g6 26. Bb3 Kg7 27. Re7 followed by Ne5, black can't hold onto the pawn.  This pushes the king into the corner though.",
        "26. Bb3+ Kh8 27. Re7": "Intending to trap the king on the back rank.",
        "27... c5": "Pushing passed pawns during the endgame is usually the best strategy.",
        "28. Ne5 c4": "Blocking the bishop.",
        "29. Nxc4": "I decided it was worth trading a piece away to prevent trouble from the pawns, though white should have a won game in either case.",
        "29... bxc4 30. Bxc4 Rc8 31. Bb3 g5 32. Rxa7 f4 33. Bd5 g4 34. Ra8": "Trading away rooks to prevent counterplay with plans to push the a pawn.",
        "34... Rxa8 35. Bxa8 Kg8 36. a4": "Black can't stop the pawn from queening since the tempo used to move the bishop is compensated by the protected b7 square. \n\nAn easy way to tell if a king has time to stop a pawn is to draw a box from the pawn with sides equal to the distance to the back rank.  In this case, the pawn gets an extra step due to the initial move, so the box would be drawn from a4 to e4 to e8 to a8.  The black king can't step into the box, so wouldn't be able to capture the pawn if the bishop weren't in the way.",
        "36... Kf7 37. a5 Ke7 38. a6 Kd7 39. a7 Kc7 40. Be4 Kd6 41. a8=Q Ke5 42. Qd5+ Kf6 43. Bxh7": "Qf5 or Bf5 may have been slightly better, but I was looking to lure the king toward the h8 corner.",
        "43... f3 44. Qd6+ Kg5 45. Qg6+ Kf4": "...Kh4 46. g3  Kh3 47. Qh5#",
        "46. Qe4+ Kg5 47. Qf5+ Kh6": "...Kh4 48. g3  Kh3 49. Qh5#",
        "48. Qg6#": "1-0\n\nIf you see any mistakes in my annotations, have comments or questions, please feel free to message me."
    },
    "url": "https://gameknot.com/annotation.pl/challenge-from-scottlysan?gm=4312",
    "gameName": "Challenge from scottlysan",
    "players": "anotherminorpawn (1200) vs. scottlysan (1200)",
    "opening": "Petrov (C42), Damiano variation"
}