{
    "moves": {
        "1. e4": "King's pawn. Nothing strange about this",
        "1... e5": "Expected/usual response.",
        "2. Nf3 d5": "I opt for the QP counter (elephant) gambit. Apparently it can be quite risky, so I'll try to stick to the conventional opening from here and see where it goes.\n\nI also have to remember that if he goes exd5, I'll be a pawn down, but he will a very far advanced, unprotected pawn. ",
        "3. exd5": "Accepts in Marcozy Gambit fashion.",
        "3... Bd6": "This is as far as the Marcozy gambit goes in the GK chess opening database. But I oblige, protecting the e pawn and affecting some control on the center squares. I like having control of the center. ",
        "4. d3": "I presume he is opening up, affecting some control in the center while freeing up his DSB",
        "4... Ne7": "I opt to go for Ne2. Attacking d2 while developing and allowing King's side castling, while also allowing f6, in order to affirm center control.",
        "5. Nc3": "Developing, while protecting d2. He is careful here, as he does not want to advance to many of his pawns to protect d2 and screw up his pawn structures while limiting development.",
        "5... O-O": "Get the King safe, early on. I sincerely hope this doesn't come back to bite me in the ass, as he has the option of advancing his DSB and Queen to my King's side since my knight on e2 doesn't attack the traditional h5 and g4 squares. ",
        "6. Bg5": "Pinning my knight and developing. I dislike the pin. The usual way of discouraging the oin is threatening with h6, but it weakens the king's side pawns.",
        "6... Bf5": "His DSB does not really present a threat at present, so I will develop my LSB to the logic and traditional f5.",
        "7. Ne4": "Moving one piece twice before moving every piece once, which is a rule I like to stick to unless another move offers greater advantage. He aims to gain control of the center, challenge my DSB that supports my pawn, allows to develop c4 to support d5. I see this as a good move.",
        "7... f6": "Support e5, while unpinning my knight freeing it up for attack on d5. Now he has the option of trading his knight for mt DSB. I don't mind that, as he would trade a strong/active piece for a defensive one.",
        "8. Bh4": "Retreats. Still maintains pressure on the h4-d8 diagonal. ",
        "8... Nxd5": "Material + support for my h6 pawn.",
        "9. h3": "Avoiding a pin on his Nf3. I never play this move. Personal preference really. Weakens the pawns in front of your king. I don't like. \n\nHe is hoping I overextend myself by going for g5, but he has too much fire power aiming at my knig's side. No go",
        "9... Nd7": "So I develop, get some backing behind the pawn on f6. I have read somewhere that you should always try to develop such that you don't use your pieces to support the pawns, but rather the pawns to support the pieces. But here I try to develop towards the king's side for protection as well as offense. ",
        "10. a3": "Don't know why he does this, I don't understand the tactic.",
        "10... Nc5": "This is usually the point in the game where I make my mistakes. I have played an opening, gotten some okayish position, but the problem here lies in what to do next. How to develop my attack. I no longer wish to trade my DSB, but I need to get his e4 knight moving as it limits my movement. I'll even take the trade (Nxd6), if it means getting that strong piece off the board.",
        "11. Nfd2": "He goes defensive, threatening the fork on e4 with his pawn if I take the trade, Nxe4. Danger Danger.",
        "11... Bg6": "Go on the passive here. But the position he is hold on my f-pawn with his DSB is limiting. I he pushes up with his c pawn and force my knight out of the way he can force my hand w.r.t. position on the king's side.",
        "12. Be2": "Developing, getting ready to castle king's side. It would suit me, as I have most of my pieces aiming that way.",
        "12... Qe8": "Unpin my queen, waiting move, I want to see what he does first.",
        "13. Bf3": "supporting that knight, better position for the LSB I suppose. ",
        "13... f5": "Position, getting control of the center. Just the way I like it. And it brings my f-file rook into the game.",
        "14. Nc3": "Sensible retreat, forcing my Nd5 to trade or do something",
        "14... Nxc3": "Take the trade. Also doubles his queen's side pawns. ",
        "15. bxc3 c6": "Waiting move, also protecting my pawn on b7, enforcing some center control.",
        "16. O-O e4": "This is where I start to struggle. I have to start mounting my attack on the king's side. I have my DSB pointed at your king's side, but I tend to get side tracked and miss his own attack. Let's see.\nOpen up the dark squares for my bishop.\nTry ti get my queen to e5 threaten Qh2#. He can pin my pawn on e4 and I can still get my queen to e5, attack the pawn on c3 and the LSB.",
        "17. Re1": "The pin, which turns out better for him than for me.",
        "17... Qe5": "Threaten Qh2#",
        "18. Bg3": "Not the option I would have gone with. I thought he would play g2. But I didn't really give it much thought.",
        "18... f4": "Attacking two of his bishops at once. Good for me!",
        "19. Bh2 Qxc3": "Material, unpinning my queen and attack his bishop all at once. I am smiling.",
        "20. Bxe4": "Oops, didn't quite see that.",
        "20... Rae8": "I should have traded the Nc5xe4, and saved my king's side pawn structure, but I wanted control of the e-file. Mistake from me.",
        "21. Bxg6": "So he trades, destroys my king's side pawns by doubling up my pawns",
        "21... hxg6 22. Ne4": "He attacks my DSB",
        "22... Nxe4": "We trade.",
        "23. dxe4 Be5": "This is my personal favorite move of the game. Getting my DSB behind my queen on the long diagonal. Turns out, this was the winning move. ",
        "24. Qc1": "The mistake I reckon he made, he missed the trade of the my queen and DSB for his rook and queen.",
        "24... Qxa1": "Trade is materially in my favor. ",
        "25. Qxa1 Bxa1 26. Rxa1 Rxe4": "No, I have won, and it plays out like that.",
        "27. Kf1 Rc4 28. Ra2 Re8 29. g3 f3": "Also a good move, avoiding the trade, restricting movement of his king and keeping the king at bay with my rook controlling the e-file.",
        "30. g4 Re2 31. Bf4": "Blunder",
        "31... Rxf4 32. Kg1 Rc4 33. Rb2 Rcxc2": "He should trade here.",
        "34. Rb1": "doesn't",
        "34... Rexf2 35. Rxb7": "he is tired now, I have already won. Forced check mate in two.",
        "35... Rfg2+": ""
    },
    "url": "https://gameknot.com/annotation.pl/challenge-from-checkmateu2?gm=41648",
    "gameName": "Challenge from checkmateu2",
    "players": "checkmateu2 (1583) vs. rooiphil (1317)",
    "opening": "QP counter-gambit (C40), Maroczy gambit"
}