{
    "moves": {
        "1. d4": "I've annotate this game which is a bit long and the second part (after move 20) seems to me the more interresting one (3 sacrifices in total). If you have any comments (mistakes I've made, moves I didn't see), don't hesitate. I cannot see what I missed, had the impression of playing very well (which might well be only an impression...) but couldn't win.",
        "1... Nf6 2. Nf3 g6 3. c4": "Queen's gambit, very classical but solid.",
        "3... Bg7 4. g3 d6 5. Nc3": "So that I can play d4-d5 in case if c5 or e5.",
        "5... O-O 6. e3 Nc6": "All these moves are very classical.",
        "7. Bg2": "Preparing the castle",
        "7... e5 8. d5": "As planned (cf. move 6)",
        "8... Ne7": "From now on, my plan is to set pressure on black's king side to prevent his developement.",
        "9. e4 Ne8": "Black will probably play f7-f5 which will weaken his king and doesn't seem too dangerous for white.",
        "10. O-O f5 11. exf5 Bxf5 12. Bg5": "Developping a piece that never moved and pinning the knight on e7 and ",
        "12... Nf6": "I probably would have play the black bishop instead.",
        "13. Nh4": "Attacking the f5 bishop so that black takes back with his g6 pawn and weakens his king or with the e knight, pining the f knight.",
        "13... h6": "Weakening the king",
        "14. Bxf6": "I carried on with my plan : set as much pressure as possible on the king to prevent developpement.",
        "14... Rxf6": "Once agaiin, I would have taken with the knight.",
        "15. Ne4": "preventing the e pawn to come on e4 and attacking the rook",
        "15... Rf8 16. g4": "? Probably a mistake because it considerably weakens the white king but I had no other idea to carry on my plan and thought his kingside pawns were weak.",
        "16... Bd7 17. h3": "Must secure my attack",
        "17... g5": "It had to happen.",
        "18. Nf3": "Both sides are blocked",
        "18... Ng6": "And black gets the initiative",
        "19. Qc2": "Now the developpement is almost completed",
        "19... Nf4": "Dangerous and embarassing but the black king is naked",
        "20. c5": "As it didn't seem possible to carry on the pressure on the black king, I decided to attack the center to isolate the e5 pawn",
        "20... Rc8": "blocks white's plan",
        "21. c6": "Attacking the bishop on d7 to oblige black to set it on e8",
        "21... bxc6 22. dxc6 Be6 23. Rfd1": "I wanted to carry on the attack on the center",
        "23... Qe7 24. b4": "To support the c6 pawn and protect the knight if attacked on e4",
        "24... d5 25. Nc5": "It seemed a good place for the knight because black cannot attack it with a pawn.",
        "25... e4 26. Nd4": "The last comment is valuable for this knight as well and know, the e6 bishop is under menace",
        "26... Bxd4 27. Rxd4": "Isolates the black king but  the black center is getting dangerous",
        "27... Bf7": "Preparing e4-e3 which is very dangerous for the white because of the menace on f2 and the black tower on f",
        "28. Nd7": "It attacks the tower and permits to the white Queen to protect the c pawn.",
        "28... Rfd8": "The black pawn on e4 is still very dangerous",
        "29. Bxe4": "The danger is out but every good think has a price.",
        "29... dxe4 30. Re1": "White has lost a bishop but has got a fine attack.",
        "30... Nxh3+ 31. Kh2": "That's part of the price to pay for the good position of the rooks and the queen.",
        "31... Nf4 32. Rexe4": "Know, white gets the initiative again.",
        "32... Ne6 33. Re3": "to open the diagonal to the queen and block blacks pieces",
        "33... Rxd7 34. Rxd7": "Black makes a positional sacrifice to get some space",
        "34... Qxb4 35. Rxf7": "White's turn to sacrifice a piece to get a strong attack",
        "35... Kxf7 36. Qf5+ Kg7 37. Qxe6": "Attacking the black tower, menacing the king and both pieces protect each other",
        "37... Qf4+ 38. Kh3": "Black's queen cannot carry the attack on because of the menace on the tower. So, little danger.",
        "38... Rf8": "The situation is now almost equal",
        "39. f3 Rf6 40. Qe7+ Rf7 41. Qe8": "menacing rook e7",
        "41... Qf6 42. Kg2": "So that the white rook can move",
        "42... Qb2+": "unseen by white",
        "43. Kg3 Qxa2 44. Qe5+ Kg6 45. Qe4+ Kg7 46. Qe5+ Kg8 47. Qe8+ Kh7": "Blacks wants to escape the draw",
        "48. Re7 Kg7 49. Rxc7": "The b6 pawn seemed to be white's best chance. White had to take black's c pawn.",
        "49... Rxc7 50. Qe5+ Kg6 51. Qxc7": "Now the c pawn has a free way and black need's two moves from the queen to attack white's king.",
        "51... Qa1 52. Qd6+ Kg7 53. Qd2": "If blacks attacks the king, white will try to exchange the queens to promote the c pawn (only two moves to when black's king needs four moves to catch the pawn) ",
        "53... Qg1+ 54. Kh3": "I prefered the white queen on g2 so that if black's queen came back to attack the c pawn, it coud do on c7 and being protected.",
        "54... Qh1+ 55. Qh2 Qf1+ 56. Kg3": "White offered draw since black could have taken white's pawn in two moves and white would have do the same whit the black a pawn. Black accepted the draw"
    },
    "url": "https://gameknot.com/annotation.pl/challenge-from-ptitroque?gm=47922",
    "gameName": "Challenge from ptitroque",
    "players": "ptitroque (1570) vs. jawas (1514)",
    "opening": "King's Indian (A48), East Indian defence"
}