{
    "moves": {
        "1. e4": "So this was another game against one of the lovely ladies from the Sixth Sense Gameknot team.",
        "1... c5": "So it starts conventionally",
        "2. Nf3": "She continues with the main line.",
        "2... Nc6": "I develop too.",
        "3. Bb5": "Playing the Sicilian a bit like a Spanish Opening - it is not a bad plan.",
        "3... e6": "I prepare to support Nc6 with Ng-e7",
        "4. O-O": "She castles",
        "4... Nge7": "I continue with my plan.",
        "5. Re1": "She move her rook to a more active square.",
        "5... a6": "I hit the bishop.",
        "6. Bxc6": "She takes.",
        "6... Nxc6": "I take back, opening up the squares e7 and maybe even d6 for my Bf8.",
        "7. d4": "She opens the centre.",
        "7... cxd4": "I take.",
        "8. Nxd4": "She takes back.",
        "8... d6": "I have a slight weakness on d6, but on the other hand I have good control over f5, e5, d5 and c5. Chances are about equal.",
        "9. Nc3": "She continues to develop.",
        "9... Be7": "I prepare to castle.",
        "10. Nxc6": "She takes.",
        "10... bxc6": "I take back.",
        "11. Qg4": "This is her reason for exchanging - she couldn't play this move before as otherwise her Nd4 would be hanging. Protecting g7 is a bit of a problem.",
        "11... Bf8": "This anti-developing move is a mistake. Kf8 was probably best.",
        "12. b3": "We are both following Bertholee, Rob (2340) vs. Amesz, Jaap (2185) which ended in a draw. White threatens to place her bishop on b2, adding to the pressure on g7",
        "12... e5": "So I block the long diagonal, and open up an attack on her queen.",
        "13. Qg3": "She retreats to the best square, maintaining the pressure on g7. Laura is playing this very well so far.",
        "13... Be6": "With no easy way of developing my King side I decide to develop my Bc8.",
        "14. Bb2": "Now in Bertholee, Rob (2340) vs. Amesz, Jaap (2185) the Bishop came out to a3, so I was now thinking for myself.",
        "14... Qf6": "Played with the idea of playing Bf8-e7, without leaving my g7 pawn hanging.",
        "15. Rad1": "She continues to mobilize. Laura continues to play well, and has a slight edge here.",
        "15... Be7": "I continue with my plan.",
        "16. Ba3": "Laura finally puts her bishop on its best square, adding to the pressure on d6.",
        "16... Rd8": "So I protect d6 again.",
        "17. Rd3": "She prepares to swing  a rook over to the King side.",
        "17... O-O": "I castle.",
        "18. Bc1": "She prepares to redevelop her bishop. The post match computer analysis (PMCA) doesn't like this, and prefers 18. Qe3 Qh4 19. Qb6 c5 20. Nd5 Bxd5 21. exd5 Rb8 22. Qa7 Ra8 23. Qd7 Rad8 24. Qf5 Qg5 25. Qxg5 Bxg5 as best for both sides.",
        "18... Rfe8": "PMCA doesn't like this move either, and prefers … Rd7 19. Red1 Rfd8 20. Be3 Rb7 21. a3 a5 22. Kh1 h5 23. h4 Qxh4+ 24. Qxh4 Bxh4 25. Rxd6 Rbd7 26. Rxd7 Rxd7 27. Rxd7 Bxd7",
        "19. h4": "This is a bit of a wild thrust. PMCA still likes 19. Qe3 with Rb8 20. Ba3 c5 21. Nd5 Bxd5 22. Rxd5 Qg6 23. Qd3 Rb6 24. Rd1 Qg4 25. Qc4 Kh8 26. Bb2 Bh4 to follow.",
        "19... Bc8": "This is a mistake too - I should have just taken on h4.",
        "20. Rf3": "Now she forces me to take!",
        "20... Qxh4": "White is just a clear pawn down now.",
        "21. Qxh4": "She takes.",
        "21... Bxh4": "I take back.",
        "22. Na4": "She very cleverly now starts probing my weaknesses on the queen side. ",
        "22... Be7": "I move my bishop back to a safer square.",
        "23. Be3": "She redirects her bishop, also at my weak black squares on the queen side.",
        "23... f6": "My plan is to advance d6-d5, but I want to make sure e5 is firmly protected first.",
        "24. Bb6": "So she hits my rook.",
        "24... Rd7": "This is the only square it can go to.",
        "25. c4": "She makes d6-d5 harde - this is an excellent move!",
        "25... d5": "But I decide to play it anyway.",
        "26. Nc5": "Her knight comes in.",
        "26... Rd6": "My rook shuffles up the board again.",
        "27. b4": "Since dropping the pawn, the lovely Laura has played really well, but this just drops another pawn.",
        "27... dxc4": "Which I snatch off, opening up the d file for my rook too.",
        "28. Rc1": "She goes after my c pawn.",
        "28... Bd8": "I decide I can't protect that pawn, so I try to exchange her active bishop.",
        "29. Na4": "This is a mistake too - far better to exchange bishops and take on c4.",
        "29... Be6": "Sp now I protect c4 and I am just two pawns up. ",
        "30. Bc5": "This is a good move attacking my rook.",
        "30... Rd2": "So I advance it, threatening a2.",
        "31. Nc3": "She protects a2, but PMCA prefers 31. Ra3 a5 32. bxa5 Bxa5 33. Nc3 Bxc3 34. Rcxc3 Rb8 35. Ra6 Rd3 36. Rc2 Rc8 37. Rb6 Kf7 38. a4 Rd1+ 39. Kh2 Rcd8 40. a5",
        "31... Be7": "So I try again to exchange that powerful bishop of hers.",
        "32. Na4": "This is another mistake dropping the a pawn for no compensation.",
        "32... Rxa2": "So I take.",
        "33. Bxe7": "She takes.",
        "33... Rxe7": "I take back.",
        "34. Nc5": "Her knight comes in.",
        "34... Bf7": "and my bishop drops back. With three pawns down and no compensation, she resigned. Many thanks for reading, please rate this on the star system and leave a comment or two! Until next time dear reader!"
    },
    "url": "https://gameknot.com/annotation.pl/challenge-from-penelope80?gm=60155",
    "gameName": "Challenge from penelope80",
    "players": "penelope80 (1648) vs. charleshiggie (2037)",
    "opening": "Sicilian (B30), Nimzovich-Rossolimo attack (without ...d6)"
}