{
    "moves": {
        "1. e4": "I normally open with 1. e4 unless I have a specific reason not to.",
        "1... e6 2. d4": "A standard response to the French (1. ... e6).",
        "2... c5 3. Nf3": "I've played this move before, but the position was usually reached via:\n1. e4 c5 2. d4 e6",
        "3... h6": "I've only seen 3. ... h6 once before as far as I know.",
        "4. d5 Qe7": "We're off the beaten path now.",
        "5. dxe6 fxe6 6. e5": "My Pawn's a bit vulnerable on e5, I'm hoping that I will be able to make some use of it's cramping effect before it is eventually taken.",
        "6... Nc6 7. c3 g5 8. Bd3 Bg7 9. Bg6+": "Simply to stop Black from being able to Castle.\nIt will be more awkward for him to develop his Rooks now.",
        "9... Kd8 10. Qe2": "My e-Pawn is vulnerable and I don't want to lose it.",
        "10... g4 11. Nfd2": "It looks like I'll lose that e-Pawn after all.\nI may b able to get Black's g-Pawn as compensation.\nBlack's Kingside looks a bit ragged, but on the other hand my King doesn't look like it would be that safe if I castled Kingside.\nI don't like having my DSB (Dark Square Bishop) blocked in by my Knight, but I don't have any choice.",
        "11... Nxe5 12. Be4 d5 13. Bc2 a6 14. O-O Bd7 15. f3": "I don't like my Kingside being so cramped, I intended to be the one attacking on the Kingside.",
        "15... Bb5 16. c4 Bxc4 17. Nxc4 gxf3 18. gxf3 Nxc4 19. Bb3 Nf6 20. Bxc4 dxc4 21. Rd1+ Nd7 22. Qxc4 b5 23. Qe4": "Now Black is the one with a vulnerable e-Pawn.",
        "23... Ra7 24. Nc3 Ke8 25. Re1 Ne5 26. f4 Ng4 27. Qxe6 Qxe6 28. Rxe6+ Kd7 29. Rg6 Bd4+ 30. Kg2 h5 31. Rb1 Rf8 32. h3 Nf2 33. Ne2": "I'd like to skewer Black's Rook on a7, but his DSB is covering g7 at the moment.",
        "33... Bh8 34. Kxf2": "I'll take the Knight...\nIf I get the chance I'll move my Rook to h6; I'd still like to skewer Black's a-Rook, but I might get a free Pawn out of it if I'm lucky.",
        "34... Ke8 35. b3 Raf7 36. Rxa6 Bf6 37. Ra8+ Bd8 38. Be3 Rc7 39. Rd1 Ke7 40. Rd5 Rd7 41. Bxc5+ Ke8 42. Rxd7 Kxd7 43. Bxf8 Bb6+ 44. Kf3 Kc7 45. a4 bxa4 46. Rxa4 h4 47. Be7 Kb7 48. Bxh4": "With Black's last Pawn gone I can concentrate on trying to get rid of his Bishop, I'd like to get it for free of course... but I certainly don't want to give up anything more than my own Bishop for it.",
        "48... Kc6 49. Rc4+ Kb5 50. Nc3+ Ka5 51. Ra4#": "This was purely opportunistic, and I only noticed the Mate when it was my turn. I initially just wanted to put Black's King under more pressure."
    },
    "url": "https://gameknot.com/annotation.pl/challenge-from-sudarshan_v2?gm=56357",
    "gameName": "Challenge from sudarshan_v2",
    "players": "ghyltarvoke (1555) vs. sudarshan_v2 (1360)",
    "opening": "French defence (C00)"
}