{
    "moves": {
        "1. b4": "White plays the polish opening , gaining queenside space but creating a weak b4 pawn.",
        "1... Nf6 2. Bb2 e6": "Black plays conservite to force the b pawn to advance or become a target after a5. ",
        "3. a3 a5 4. c3": "Defending the b- pawn.",
        "4... d5 5. d3 Nc6": "Black is already much better as the bishop on b2 is weak and white has many queenside weaknesses.",
        "6. b5 Ne7": "Rerouting the knight to g6.",
        "7. g3": "Preparing  a double fianchetto.",
        "7... Ng6 8. Bh3": "Really weak as 8:Bh3 weakens white's kingside and at any time black can play e5 and gain center space while threatening to exchange light squared bishiops.",
        "8... b6": "Black fixes the b5 pawn so it becomes a target.",
        "9. Nd2 Bb7": "Black decides that the misplaced h3 bishop and threat of d4 will leave him with a long initiative. ",
        "10. d4": "Stopping the potential threat of d4. But this  fixes the b2 bishop on a horrible square and white will have to waste 3 tempo redeveloping his misplaced bishops.",
        "10... Qd7": "Eveying the b5 pawn.",
        "11. a4 Rc8": "Preparing a c5 push as this gains queenside space and after c5 puts his rook on an active post.",
        "12. Ngf3": "FINALLY.... Developing , but now it's too late as black will play c5 and have queenside initiative. ",
        "12... Bd6": "Developing black's last piece. ",
        "13. O-O O-O": "Both players protect the king's and have all their pieces developed but the quality of white's development is poor and for that black dictates play for the rest of the game. ",
        "14. Ng5": "Not doing anything , white wastes an important tempo. Better would be Bg2 trying to redevelop his misplace pieces.",
        "14... c5 15. bxc6 e.p.": "? This move leaves white with a backward c pawn and though black has a matching one on b6 all of black's pieces are much more active and can take advantage of the c3 weakness. ",
        "15... Qxc6 16. e3": "Still not developing , Ba3 trading bad for good bishop is one idea or even Bg2. ",
        "16... h6 17. Ngf3 Ne4": "After 18: Nxe4 dxe4 19:Nd2 f5 Black has a huge bind on the white position .",
        "18. Nb1": "? But this undevelops another piece and increases black's advantage. ",
        "18... b5": "As white's army is unprepared to battle , black blasts open lines. Always remember : If you're ahead in development blast open lines as it's almost like you're up material.  ",
        "19. Nbd2": "??? White develops his knight back to where he put it before and loses even more time.",
        "19... Ba6": "Black prepares to play b4 snatching a pawn due to the double attack on c3 and f1.",
        "20. Re1": "Stopping the threat.",
        "20... Nxc3": "But Black still wins a pawn and Black's position is still much better. ",
        "21. Bxc3": "Trading off white's horrible bishop.",
        "21... Qxc3 22. Bf1": "! This pins my b- pawn and trys to develop a piece. Though now white is too behind.",
        "22... Qc6": "Releasing the pin and now white can win his pawn back with 22:axb5 Bxb5 Rxa5 Bxf1 Rxf1. But black owns the c- file and after Qc2 will still be winning.",
        "23. Nb3": "White misses his opportunity.",
        "23... Bb4": "Attacking the rook and defending the a5 pawn.",
        "24. Rc1 Qb6 25. Re2": "Now White loses a piece after bxa4 due to the double attack on b3 and e2.",
        "25... bxa4 26. Rec2 Rxc2 27. Qxc2 axb3 28. Qxb3": "Black's up a piece and will exchange off the bishops.",
        "28... Bxf1 29. Kxf1 Qb7": "This prepares Rc8 trying to not let white get the c-file.",
        "30. Kg2": "Better was 30: Qc2 when at least white has the c file.",
        "30... Rc8 31. Ra1": "Trying to win a pawn on 32:Rxa5 due to the pinned Bishop. ",
        "31... Qb5 32. Rb1": "This does nothing but white's position is so bad anyways. ",
        "32... Nf8": "The knight sees e4 through d7 , and f6.",
        "33. Ne5 Nd7": "Offering to exchange off the knight when white has no hope of winning.",
        "34. Ng4": "Declining the exchange but putting the knight in a precarious position with no escape squares.",
        "34... Qe2": "Gaining time while attacking the g4 knight  so Rc2 can be played. ",
        "35. h3": "Defending the knight and giving it an escape square",
        "35... h5": "Softening up the f2 square by removing it's defender.",
        "36. Rb2": "Trying to stop the disaster on f2.",
        "36... Qc4": "Allowing a trade of queens when Qxc5 dxc5 gives black two deadly passers along with an extra piece. ",
        "37. Ne5 Nxe5 38. dxe5 Qe4+": "This move trys to create more kingside weaknesses after f3 while at the same time picking up the e pawn.",
        "39. f3 Qxe5 40. Re2 h4": "Trying to destroy the white kingside. ",
        "41. gxh4": "And white accepts , now black just has to get his pieces to the kingside and I'll win. ",
        "41... Qf6": "Eyeing the h4 and f3 pawns.",
        "42. e4": "Trying to mix it up in the center but this just makes the white king more weak. ",
        "42... Rc3 43. Qd1": "And now it's forced mate.",
        "43... Qxf3+ 44. Kg1": "If Ka2 black will play Qxa3  and after kg1 play Bc5. ",
        "44... Bc5+": "Now White resigns as Ka2 Qa3# is mate. This is a good game showing how bad development can cost you. "
    },
    "url": "https://gameknot.com/annotation.pl/challenge-from-sosg?gm=923",
    "gameName": "Challenge from sosg",
    "players": "sosg (1427) vs. cheetah08 (1677)",
    "opening": "Polish (Sokolsky) opening (A00)"
}