{
    "moves": {
        "1. e4": "Annotation updated November 15, 2010. This was a non rated game for tutoring purposes, between myself, Scott Miller (faithfulltrav) and my new friend (starforce49). So I want to start by letting you know a little about where I am coming from when I tutor chess, my favorite game. First I want to say, there are varying ideologies and styles of play. I for one am a fairly aggressive, very calculating player. I am a much stronger tactical player than I am strategic. For the difference, imagine a general in a war. He may say to his men \"OK, there are 10,000 of us. I want 9,000 men to lay in wait at the top of this hill. The other 1,000 of you go make like you are attacking the enemy town down below. When they come out after you, flee to the cave at the bottom of the hill. Then the 9,000 at the top attack them by bow and arrow. That is strategy. It is an overall plan. Then the general may say, \"When you engage in hand to hand combat, use the long swords, as you can strike from a greater distance. Keep your daggers ready though.\" That is a tactic, not a strategy. Strategies give general direction, tactics are more specific. So tactics are the processes used to apply the strategy. A more strategic player may look at one of my comments and say, \"This guys is leading you wrong.\" It's not that I'm leading you wrong, but that I can only lead based on my own style. A strategic player will lead differently than a tactical player. A passive player will give different advise from an aggressive player. That's not to say anything bad about passive chess players, as I've met passive players who I could not beat. I had a friend in college named Pablo. He'd sit back, making very passive moves. He'd set up a very solid position you can't break through and if you slip up, then all of a sudden he'd get aggressive! So when taking advise, (from me or anyone else) take it all in from as many sources as possible, then make a rational decision for yourself, based on your own style and abilities, what is for you.",
        "1... e6": "So 1. e4 e6 marks the Pirc Defense, a very tactical defense filled with potential for both sides. As the moves developed, we moved far away from the Pirc Defense.",
        "2. Nc3 d5 3. exd5 exd5 4. d4 Nf6 5. Nf3 Bb4 6. Bd2 O-O 7. Be2 Nc6 8. a3 Ba5 9. O-O Ne4 10. h3 f5 11. b4 Bb6 12. Bg5": "Here, you did not notice that I had a knight attacking the g5 square, thus you give up a piece. We had 7 days per move, so there really is very little reason for quick rushed moves. I'd suggest analyzing very in depth to see what is attacked and defended, before making each move.\n\nA one piece advantage is usually more than enuf to win.",
        "12... Nxg5 13. Nxg5 Qxg5 14. Nxd5": "So here you get a pawn back in exchange for the piece. Still a won game for me.",
        "14... f4": "Threatening to play Bxh3.",
        "15. Nxb6 axb6 16. Bg4": "It is to your disadvantage to trade (or offer trades) here. When your opponent is ahead in material (in this case a knight), it only leads to an endgame where you are behind. If we keep trading equal items, I will have a knight lead in the end game. Your best chance for a win or a draw is to aggressively try to win back material.\n\nIn addition, you get doubled pawns after the trade. They are bad because they can't defend each other.",
        "16... Bxg4 17. hxg4 Rad8 18. c3 h5 19. f3 hxg4 20. fxg4 Rf6 21. Qf3 Rdf8 22. Rae1 Rg6 23. Re4 Qxg4 24. Qxg4 Rxg4 25. Rf3 g5 26. Kf2 Kg7 27. a4 Rf7 28. b5 Ne7": "So my biggest advantage is the knight lead, so I need to bring him to where he can do damage on the kingside.",
        "29. Kg1 Ng6 30. c4 Nh4 31. Rf2 Rg3": "I moved the rook forward so that I can push the f-pawn.",
        "32. Re1 f3 33. Re3 Rxg2+ 34. Kf1 g4 35. d5 Nf5 36. Re4": "Always watch out for the forks.",
        "36... Ng3+": "Always watch out for knight forks. With the knight on f5, The knight can go to g3, h4, h6, e7, d6, d4 & e3. When a opponents' knight or any other piece moves too a square, look at each that piece can go to, and consider if it can do damage.\n\nThanks for the game!"
    },
    "url": "https://gameknot.com/annotation.pl/challenge-from-starforce49?gm=35023",
    "gameName": "Challenge from starforce49",
    "players": "starforce49 (1580) vs. faithfulltrav (1758)",
    "opening": "French (C00), Pelikan variation"
}