{
    "moves": {
        "1. e4 e5 2. d4": "And again with the centre game. I do this to free up as many pieces as possible, that is the queen and bishops, as the knights are already free to move onto the 3rd rank.",
        "2... d6": "I wouldn't have minded 2... exd4, as my queen can gain a tempo and possibly sit nicely on the 3rd rank, but with this move I could potentially force both off the board if we trade pawns on e5...",
        "3. dxe5": "...and although I capture his pawn, threatening to open up the queens' file, so I can trade them, so he can no longer castle...",
        "3... Nc6": "...he declines to take mine, getting ahead on development with his knight...",
        "4. exd6": "...so I capture his second pawn to double my advantage...",
        "4... cxd6": "...and he recaptures, isolating his pawn, making it a potential target.",
        "5. Nc3": "Now with the odd pawn advantage, I develop my own knight to draw level on development...",
        "5... Ne5": "...and as he moves his queenside knight into the middle of the board, developing it a second time...",
        "6. Nf3": "...I attack it with my kingside one, hoping for an exchange...",
        "6... Nxf3+ 7. Qxf3": "...which is exactly what I get, and my queen sits nicely on the 3rd rank. I'm ahead on development again, with two pieces at least on the 3rd rank, to his none.",
        "7... g6": "He's hoping to fianchetto his bishop with this move, no doubt hoping to surprise me on the long diagonal...",
        "8. Bb5+": "...but with his queenside bishop's pawn leaving its staring file, after capturing my queen's pawn on d6, I can develop my kingside bishop to check his king...",
        "8... Bd7": "...but although he blocks with his own bishop...",
        "9. Qe3": "...I decline to take it, hoping he'll take mine, so I can recapture with my knight.",
        "9... a6": "But as he attacks my bishop with his pawn...",
        "10. Bxd7+ Qxd7": "...I initiate the exchange, meaning that light squares are now less threatened, now that both of those bishops have departed the scene.",
        "11. Qb6": "I bring my queen to the 6th rank, hoping to wreak havoc...",
        "11... Ne7": "...but his knight helps to see to that, as it can attack her if placed on c8, although I control the d5 square...",
        "12. Nd5": "...which is where I place my knight, to try to help her out...",
        "12... Nxd5 13. exd5": "...but we end up exchanging again, opening up the e-file...",
        "13... Qe7+": "...so his queen can check my king...",
        "14. Qe3": "...and I opt to block with mine, pinning the queens to their kings...",
        "14... Qxe3+ 15. Bxe3": "...and we exchange the queens, with my dark-bishop emerging.",
        "15... Bg7": "He finally fianchettos his remaining bishop...",
        "16. O-O-O": "...so I castle queenside to protect the threatened pawn on b2, and for my rook to cover the d4 square, should his bishop remain on the long dark diagonal, so my bishop can move there.",
        "16... O-O": "As he castles kingside...",
        "17. Bd4": "...I can threaten his bishop with mine, which is covered by my rook. If he makes the first capture, my rook controls the 4th rank...",
        "17... Rac8": "...but he declines to take my bishop...",
        "18. Bxg7 Kxg7": "...so I initiate the exchange. I went in for these five like-for-like exchanges because I am ahead by the odd pawn since move 4, and that is the advantage I have in this all too familiar double-rook endgame. If I exchange both pairs of rooks without a single pawn being dropped (the last time this happened was on move 4), then I should make the most of my extra pawn to win the game.",
        "19. Rhe1": "I bring out my inactive rook to take control of the only open file on the board, hoping to advance it to the 7th rank...",
        "19... Rc5": "...but as one of his rooks lines up my pawn on d5, my other rook is now in a passive position...",
        "20. b3": "...so I move up my knight's pawn on the queenside, hoping to create a chain that would protect the d5-pawn...",
        "20... Rfc8": "...but he doubles his rooks on the c-file. An attack on c2 looks on the cards...",
        "21. Re2": "...so I move a rook up one rank to protect the pawn. I probably moved the wrong rook, as its twin is still in a passive position.",
        "21... b5": "A four-pawn chain is now out of the question, as the bishop's pawn would be captured by the knight's pawn on c4...",
        "22. b4": "...so I stop the knight's pawn with mine...",
        "22... Rc5c4": "...and as my pawn is now under attack from the rook...",
        "23. a3": "...I cover it with my rook's pawn...",
        "23... Rc4c3": "...and as the rook lands on my 3rd rank, lining up my rook's pawn...",
        "24. Kb2": "...I move my king up one rank, to cover it...",
        "24... Rc3c4 25. Rd3": "...and I move one of my rooks to cover the 3rd rank, so my pawn can land on c3 and give the one on b4 extra protection...",
        "25... h5 26. c3": "...which is what I do here...",
        "26... g5 27. f3": "...and I move up my kingside bishop's pawn to help get an exchange if necessary...",
        "27... f5 28. Re7+": "...but as the king is now exposed to a rook attack, I can check him...",
        "28... Kf6 29. Rde3": "...and double up on the e-file myself, threatening mate in one move...",
        "29... f4": "...but he moves the wrong pawn forwards, as my bishop's pawn blocks off the escape route through e4 and g4...",
        "30. Re3e6+": "...and my lower rook can check the king...",
        "30... Kf5": "...forcing him onto the only available square...",
        "31. Rf7#": "...and my higher rook can move in for the kill, giving a two rook and two pawn checkmate. The moral of the story? You don't have to exchange all your best pieces in order to win. Also notice that since move 4, no more pawns were sacrificed, with me having seven, and my opponent six."
    },
    "url": "https://gameknot.com/annotation.pl/challenge-from-sinziana?gm=25464",
    "gameName": "Challenge from sinziana",
    "players": "aspiemikey (1356) vs. sinziana (1203)",
    "opening": "Centre game (C21)"
}