{
    "moves": {
        "1. e4": "I have been asked to annotate this game, which is quite interesting. I play a sacrifice, which may not be the best move in the position, but it throws my opponent off track. He doesn't find the best defence and loses quickly, in just 17 moves.",
        "1... c5": "So my trusted Sicilian Defence",
        "2. Nf3": "The usual reply",
        "2... Nc6": "and the same from me.",
        "3. Bc4": "3. d4 is more common, but this is often played by players of Michael's standard",
        "3... e6": "So I blunt the scope of his Bc4",
        "4. Nc3": "He continues to develop",
        "4... a6": "I threaten to drive the Bc4 back. This is actually given as a mistake by the post-match computer, but it is the most common move.",
        "5. a4": "He wisely prevents this.",
        "5... Nf6": "So I continue to develop",
        "6. Bd3": "This is a mistake. You shouldn't move pieces twice in the opening without a good reason. It is not given as a mistkae by the post-match computer, although its assessment of the position changes from slight advantage for white to slight advantage to black.",
        "6... d5": "So I advance in the centre.",
        "7. exd5 exd5": "he takes",
        "8. O-O": "I take back",
        "8... Be7": "he castles, I develop",
        "9. Re1": "He develops",
        "9... O-O": "and so do I. He now needs to develop his queen side, maybe with b3 followed by Bb2, but he plays.....",
        "10. Ne5": "This exchanges off his best protector of the white king side.",
        "10... Nxe5": "So I take",
        "11. Rxe5": "He takes back",
        "11... Bd6": "I improve the position of my bishop",
        "12. Re1": "he retreats",
        "12... Bxh2+": "and I sac. I am not sure that this is the best move, but I was very certain my opponent would not find the best reply.",
        "13. Kxh2": "Taking is the best chance",
        "13... Ng4+": "I continue to attack",
        "14. Kg3": "Although this looks daft, it may well be the best chance",
        "14... Qd6+": "Post-match computer analysis gives this as a mistake and gives the line… h5 15. Rh1 Qd6+ 16. f4 g5 17. Ne2 h4+ 18. Kf3 c4 19. Bh7+ Kxh7 20. fxg5 Nh2+ 21. Kf2 Bg4 22. Kg1 Bxe2 23. Qxe2. Is Qd6 really a mistake? What do you think dear reader?\r\n",
        "15. f4": "Best",
        "15... g5": "Continuing to attack",
        "16. Rf1": "This is a mistake, computer gives 16. Nxd5 Qxd5 17. Qf3 gxf4+ 18. Qxf4 Qh5 19. b3 f6 20. Bb2 Qh2+ 21. Kf3 Ne5+ 22. Ke3 Ng4+ 23. Kf3 as fairly even\r\n \r\n",
        "16... h5": "so I continue to attack",
        "17. Kh3": "and he plays a dreadful move and then resigns. Thanks for reading, please rate my annotation, and leave a comment or two! "
    },
    "url": "https://gameknot.com/annotation.pl/challenge-from-michael333?gm=41074",
    "gameName": "Challenge from michael333",
    "players": "michael333 (1274) vs. charleshiggie (2111)",
    "opening": "Sicilian defence (B30)"
}