{
    "moves": {
        "1. d4": "Joe's preference is to open with 1.d4  In his thread, playing style, or styles of play, he said that.  He said that many players like 1.e4, and for someone at my level, that was probably the best, but at his level he likes the QPO lines because different variations which he is more accustomed to.",
        "1... d5": "Not surprised to see this.  But, against his strength, I would've played 2.Nf6  And, that's because of what was mentioned in an ongoing consultation game.  The thing is that Joe isn't going to play the QG.  So, I think that with his next move, black might, in the long run, find himself in a little bit of true.  Generally speaking that isn't true, and I know better then to conclude, but I'm only basing it on what dynamic_dv mentioned in a consultation thread since 1...Nf6 is actually the most common response in the world database, whereas, 1...d5 is the second most common.  So, when I and someonelse voted 1...d5 early on, he said be careful because it's hard to win but easy to lose.  And, if you make a mistake against someone of that strength, you could go wrong very easily.",
        "2. Nf3": "As anticipated.",
        "2... Nf6": "I am not surprised to see Jim play this, as afterall, we're still in book.  That's not an opinion, but rather a fact.  Although, I don't play too many d4 openings, I know some of the fundamentals there.",
        "3. c4": "This time, gambiting the pawn since white will give up the pawn.  But, I like his strategy as the plan is to play something like the Colle System.  By that, I am implying 4.e3  It is often known, from what I learned from both GM Susan Polgar and the same consultation thread that I mentioned, also with Dave, that the Colle System has been known to give you a slight edge in the opening, especially do to the pawn chain, so early on.",
        "3... dxc4 4. e3 a6": "? I am not sure why he played, but I think this is a mistake.  First, not wanting to deviate due to who Jim is up against, it doesn't develop.  But, that's not as important since I have seen plenty of examples where strong players deviate.  The thing, however, is that white gets back a pawn.  With that being said, I either would've played 4...Nc6, or 4...b5  Given that it was a QPG and the c pawn hasn't been exchanged, I think that I would've fiachettoed right away with 4...b5 ",
        "5. Bxc4 b5": "I am surprised to see black play this now since white took back.  However, it does gain some time with the idea being that after white retreats, black has a nice long diagonal.",
        "6. Bd3 Bb7 7. a4": "This does show that strong players like these two can deviate.  I like this tactic, as white is trying to win the pawn because if Joe is able to play 8.axb5, and black 8...axb5, after 9.Rxa8, Bxa8 white has an open file which, as I saw with one of my recent annotations, involving a Q sac that would give him an edge.  In fact, in that game, despite the sac, he won by opening up the a file, as I explained here.",
        "7... b4": "But, black does not allow it.",
        "8. Nbd2": "Since that N had no other safe spot and he has a bad bishop, anyway, I think that Joe made the right choice.  The other thing to think about is the fact that white will find a better outpost for this, so what he played is very good, in my opinion.",
        "8... Nbd7": "It appears that black has the same idea in mind.  But, the only problem is that there is no good outpost for the N, as otherwise, he would play ...Nb3, at some point.  That leaves Jim's N on c7 crammed, and with it, I already favor white's position.  In other words, I believe that white already has a small advantage.\n",
        "9. O-O": "At last, Joe gets his monarch to safety.",
        "9... g6": "I like this second fianchetto a lot, as now, black get's rid of his bad bishop, as we're going to see shortly.",
        "10. Nb3": "As noted on the white's eighth move (8.Nbd2) the N is better placed.",
        "10... a5": "Getting a solid pawn chain.",
        "11. Re1": "But, white aims right at the center.  And, as I've learned from tactical-abyss, one way to control the center is by attacking it.",
        "11... Bg7": "What I mentioned with black's second fianchetto which has become a reality.",
        "12. e4": "This time, I have no idea why white played this.  I think the idea is putting some more pressure on the center.",
        "12... O-O": "But, black now tucks his monarch away, regardless.",
        "13. e5": "To prevent Jim from placing his other N on b3, Joe plays this.  Once again we have nice pawn chain, and since it's further up on the rank, I think they're in a better spot and will do damage.",
        "13... Ne8": "I would've played 13...Nd5, as I like it's placement better.  Afterall, I unless I am directly forced, I don't bring my N near it's homesquare.",
        "14. e6": "Adding pressure with this fork.  ",
        "14... fxe6": "However, I, most likely, would've played 14...Nb6, and if 15.fxe6, I'd would seriously consider 15...Rxe6  Though, that's an option.",
        "15. Ng5": "But, since Joe didn't play that, this is better.  And, for a change, I know the reason behind it.  Afterall, why take, if there's a chance that you'd be able to win something worth more.",
        "15... Bd5": "With that being said, Jim defends against the threat.",
        "16. Nxe6": "Therefore, I was, at first surprised to see this move.  But, when you look at what's really going on, the tactical motif is quite good, so I understand.  It turns out that this captures wins back a pawn.",
        "16... Bxe6 17. Rxe6 Nd6": "Redeploying his N.  I like the looks of 17...Nb6, in this case, given that both are back out, I favor this move.",
        "18. Bg5": "Completing development and putting pressure on the e7 pawn.",
        "18... Nf6": "So, as you'd expect, black protects that pawn.",
        "19. Qc2": "Not to my surprise, Joe's plan is to double up.  That's because the Q was blocking the R, but with this move that will change, as we're about to see.",
        "19... Rf7": "In addition, Jim has the same goal.  In addition,  I am getting more and more interested.",
        "20. Rae1": "As I noted on his previous move.  It's worth noting that doubling up is important, and I often see it in games like this.  Jack told me it's importance and people do win from doubling up, first.",
        "20... Qd7": "This is more evidence that black wants to double up.",
        "21. Nc5": "That can especially be said here since this move delays that.  Therefore, it's interesting to see what black will play next as there are options.",
        "21... Qe8": "I would've played 21...Qc6 bearing in mind that if white made a discovery attack by moving the N, I would exchange, at once with ...Qxc2  That way, I would be able to double up shortly with ...Rf8  So, with that being said, given the players strength, it can't be as good, but I do wonder why.",
        "22. h4": "Adding protection to his DSB.",
        "22... Kh8": "I am not sure why Jim moved his K.  It's not an endgame and it wasn't in danger.  Usually, when it comes maneuvoing the monarch, lest I lose my opportunity to do so and want the K safe with the R's, I don't do it.  But, as noted earlier, this is where more theory gets involved.",
        "23. Re6e2": "I am not completely sure why Joe retreated as the R did not appear en-prise.  Of course, there's also a saying which caveman1960 taught me, and marcusleus noted, \"The more you learn, the more you realize how little you know.\"",
        "23... Qc6": "This time, black does not intend or will double up.  But, I know why Jim played this.  The idea behind it.  It puts pressure right on the c file, as now there's tension on the c7 square.",
        "24. Rc1": "Of course, Joe puts the pressure right back on with added protection.",
        "24... Nd5": "Trying to counter balance with pressure on the same square.  So, now it's like a battle on c7.",
        "25. Ne6": "However, Joe attempts to exchange to take off the pressure.",
        "25... Qb7": "But, Jim does not allow that.",
        "26. h5": "So, white comes up with a different plan.  It involves sacking the h pawn for, I believe, a long term plan to with a semi open h file.",
        "26... b3": "But, black stops this cold in his tracks.  I have studied some similar positions with GM positions, and this is when they will attack the opponents Q with their P.  The idea being is to stop a plan like this since their opponent will have to get out of harm's way, and when they do, they get out of a situation like this.  As much as I hate to say this, though, it is, too little too late.",
        "27. Qd1 gxh5": "?? I am pretty sure that this was a blunder that will seal his fate because by taking, black gets more then he bargained for.  Instead of an open file, white's next move will be disastrous for Jim.  However, unlike usual, I am not sure what black's best move would've been here.",
        "28. Re5": "With that being said, Jim resigned.  Now, I was wondering why he did, and about a week or two ago viewed resignation as premature.  The reason being is that it appears that, with this move, white will lose his R for a B.  Normally, I keep guessing, but I know Joe's style too well to believe that due to studying his Q sacs and Double R sac and applying that knowledge in a couple of games, including one against my coach to win in a resignable position.  So, like what I have done before, I really studied this Homework, as I did with two other games.  I will tell you that this was one of the most difficult assignment I did.  Despite it only being a few moves, this was, as difficult as, the one where ...Re1 was the solution with the idea of a draw when black promotes, as you might have seen when doing the most difficult assignment by annotating Susan Polgar's win against Karpov and trying to figure out each move which helped.  In addition, I will often do HW with TA's games.  So, with further studying, I realize that resignation was not premature.  And, even I, who does not resign and believes that one shouldn't would've done so here as, no matter what, white will mate in four or five moves.  So, there are two scenarios that I played.  The first one is if Jim takes with 28...Bxe5  After that, we have something like 29.dxe5, Nc8 30.Qxh8, Kg8 31.Bxh7+, Kh8, and after 32.Qxf7 white will mate with either 33.Qf8# or 33.Qg7#  The second scenario is if black finds the best move, after which it's still mate.  So, 28...h6 29.Qxh5, Kg8 30.Nxg7, Rxg7 31.Bxh6, Rf7 32.Bf8, e6 and after 33.Rxe6 white will mate the same way, so either on f8 or g7 with his Q."
    },
    "url": "https://gameknot.com/annotation.pl/challenge-from-pandemonium_666?gm=59943",
    "gameName": "Challenge from pandemonium_666",
    "players": "tactical-abyss (2357) vs. therealjimfriar (2155)",
    "opening": "Queen's pawn game (D02)"
}