{
    "moves": {
        "1. e4 e5 2. Nf3 Nc6 3. Nxe5 Nxe5": "Ora il Nero ha un cavallo per un pedone e un lieve svantaggio di sviluppo.. comunque a gioco corretto dovrebbe essere vinta per il N.\n",
        "4. d4 Nc6 5. Bc4 Qh4": "Non mi aspettavo questa mossa.. generalmente è sconsigliato muovere la donna troppo presto in apertura, qui però mi ha dato qualche fastidio..\n",
        "6. O-O d5 7. Bxd5": "Alternative variation: [Mi sembrava migliore di] 7. exd5 [, anche se analizzando sembrano entrambe giocabili per il B. Se] Qxd4 [segue] 8. Qe2+ Ne5 [con parità]\n",
        "7... Nf6 8. Bxc6+ bxc6 9. Nc3": "Non avevo considerato la forte risposta del N.\n",
        "9... Ba6": "Con vantaggio marcato per il N.\n",
        "10. Ne2": "Alternative variation: [ Altra imprecisione.. forse era meglio] 10. e5\nAlternative variation: 10. Re1 Ng4 [e il N. vince]\n",
        "10... O-O-O": "Alternative variation: [Si poteva prendere il P. con] 10... Nxe4\n",
        "11. f3 Bc5 12. c3 Rd7": "Alternative variation: [Era meglio] 12... Bd6 13. g3 Qh5\n",
        "13. Re1 Rhd8 14. Be3 Bb6 15. Qc2 Qh5": "Così si perde un pezzo, come indicato nella nota seguente\n",
        "16. b4": "Alternative variation: [ Restituisce il favore.. si vinceva con] 16. a4 Bc4 17. Nf4 Qa5 18. b4 Qa6 19. a5\n",
        "16... Qb5": "Alternative variation: [Il N. è \"generoso\" e vuole proprio restituire il pezzo, che si teneva invece con] 16... Bxe2 17. Qxe2 Kb7 18. a4 a6\n",
        "17. a4": "Di colpo la partita diventa vinta per il B.\n",
        "17... Qd3 18. Qxd3 Bxd3 19. a5 Bxd4 20. Bxd4 a6 21. Bxf6 gxf6 22. Kf2 Bxe2 23. Rxe2 Rd7d2": "Una norma generale consiglia al giocatore in svantaggio di cambiare meno pezzi possibile.. quindi Td2 è un errore perchè facilita il compito nel finale al B.\n",
        "24. Rae1 Rxe2+ 25. Rxe2 Rd3 26. Rc2 Kd7": "Un altro errore, dopo questa mossa il cambio anche della seconda coppia di T è forzato, il finale di R risultante è senza speranza\n",
        "27. Ke2 Rd6 28. Rd2 Rxd2+ 29. Kxd2 Ke6 30. Ke3 Ke5 31. f4+ Ke6 32. Kd4 h5 33. Kc5 Kd7 34. g3 Ke6 35. Kxc6 f5 36. e5 f6 37. exf6 Kxf6 38. Kxc7 Ke6 39. c4": "E il N. abbandona, perchè il pedone c è inarrestabile. Una partita istruttiva, dove entrambi i giocatori hanno avuto occasioni vincenti, anche se la minore esperienza del N. ovviamente ha pesato sul risultato finale. E' in corso la rivincita su Gameknot, vi terremo aggiornati!\n"
    },
    "url": "https://gameknot.com/annotation.pl/challenge-from-javannanda-http-gameknot-com-chess-pl?gm=51081",
    "gameName": "Challenge from javannanda, http://gameknot.com/chess.pl?",
    "players": "javannanda (1813) vs. saintex (1200)",
    "opening": "Irish (Chicago) gambit (C44)"
}