{
    "moves": {
        "1. d4": "This was one of my first loses on Gameknot. At the time both of us had much lower grades - I was 1711 and she was 1774.",
        "1... d5 2. c4": "The standard queen's gambit. If black takes, white quickly recaptures the pawn.",
        "2... e6": "The queen's gambit declined.",
        "3. Nc3 Nf6 4. Bg5 Be7 5. e3 O-O": "This is all pretty standard stuff",
        "6. Qc2": "This is slightly unusual however. At the time I was playing a line 6......h6 7. h4!? and if hxg5, 8 hxg5 and if the knight goes to anywhere other than e4 white has Qh7 mate! after Ne4 white captures twice on e4 and has two pawns and an attack for the bishop - I am not sure if it really sound, but it is an interesting line. Black here decides on another option.",
        "6... dxc4": "This again is slightly unusual. Normally black waits until white has moves the Bf1 before taking here - thus saving a tempo.",
        "7. Bxc4 Nc6": "And now with this move, black takes us out of the opening databases.",
        "8. Nf3 Nb4 9. Qd2 b6 10. e4": "With the wonderful gift of hindsight, I think now that this is over-optimistic. Perhaps white should just play 10. 0-0 here, perhaps followed by Ne5 and f4. What do you think dear reader?",
        "10... c5 11. d5": "Again d5 seems too aggressive, especially with the king still in the centre. 0-0 seems best still, although it is hard to see any advantage for white. Any thoughts dear reader?",
        "11... Nxe4": "I hadn't seen this.",
        "12. Nxe4 exd5 13. Bxe7 Qxe7 14. Bxd5 Rd8": "White position is poor. I thought now, if I have to return the piece, I may as well get a pawn for it, and played Bf7+, rather hoping for Kxf7, Qf4+ and then I can castle at last. My opponent finds an improvement however! Perhaps Bxa8 is best here - giving up the queen for two rooks? After 15. Bxa8 Rxd2, 16. Kxd2 perhaps white can still make a fight of it. What do you think dear reader?",
        "15. Bxf7+ Kh8": "and Kh8 was the unexpected improvement. If now 16. Qf4 then Nc7 wins a whole rook, as 17. Ke2 is met by Ba6 mating, so white would have to play Kf1.",
        "16. Qe2 Nd3+ 17. Kf1 Qxf7": "So now black restores material equality, but the poor position of white's king, makes it very hard for white.",
        "18. Neg5 Qd5 19. Ne5": "I was rather hoping here for Nxe4, 20. Qxe4 Qxe4 21. Nf7+ Kg8 22. Nxe5 and white is not so bad, with the exchange of pieces, the poor king position is less of a handicap. Unfortunately she doesn't fall for those!",
        "19... Nf4 20. Qe4": "Ok black to play and mate in 6!",
        "20... Qd1+": "Did you find it? Of course, if I take the queen, she recaptures with the rook, giving mate, so my next move is forced.",
        "21. Qe1 Ba6+": "I guess actually a computer would suggest Nc4 or d3 now, as it delays mate by one move, but I am not a computer!",
        "22. Kg1 Ne2+ 23. Kf1 Nc1+": "and now I throw in the sponge, before she plays 24. Kg1, Qxe1 mate!"
    },
    "url": "https://gameknot.com/annotation.pl/challenge-from-charleshiggie?gm=27164",
    "gameName": "Challenge from charleshiggie",
    "players": "charleshiggie (1958) vs. renniemay (2281)",
    "opening": "QGD (D53), 4.Bg5 Be7, 5.e3 O-O"
}