{
    "moves": {
        "1. e4": "Advancing the king's pawn up two squares is highly useful because it occupies a center square, attacks the center square d5, and allows the development of White's king's bishop and queen",
        "1... e5": "As black my normal response to 1.e4 is 1...c5, but this time I chose 1...e5.",
        "2. Nf3": ".",
        "2... Nc6": ".",
        "3. Bc4": ".",
        "3... h6": "? Losing a tempo in development. Because I normally play 1...c5 I would not guard the g5-square at this time and could face the unpleasant  Ng5 with attack on unprotected f7. But here h6 is not necessary because blacks queen is controlling g5. A general rule is also that moving the rank pawns is not the best because it later can turn out to be an attacking point in order to weaken the castled king side. Personally I often find it hard to not move h6/a6 or a3/h3 because I'm not too happy about the bishop on g4/b4/g5/b5. ",
        "4. d4": "I think this is the best move now! Challenging control for center of the board.",
        "4... exd4": ".",
        "5. Bf4": "5 Bf4 was probably the best, which give black temporarily a chance to keep the d4 pawn and white has to spend time and effort to win back the pawn. Better would be Nxd4..",
        "5... Bc5": "I decided to defend the pawn. Equally good or better is probably Bb4+.",
        "6. Na3": "?! I don't follow the idea/continuation of Na3. If looking at general/beginners opening rules this is a poor move. But maybe white has a longer plan for it? Knights doesn't like to be ranked, which give them less influence in controlling squares",
        "6... a6": "Again black make a poor move. The idea is to prevent white Nb5 with help from Bf4 will attack on c7. But far better and still protecting c7 is 6...d6, with healthy development for black by opening the d7-h3 diagonal",
        "7. Bd5": "Again I don't follow what black has in mind. Personally I think castling would be the natural continuation.",
        "7... Nce7": "7...Nge7 would have been better and continued the development for black.",
        "8. Ne5": "This is what I would call the first mistake for white. Again I would like to hear what white had in mind. Black immediately took advantage of this...and played Nxd5",
        "8... Nxd5": ".",
        "9. exd5": ".",
        "9... d6": "Best continuation. E.g. Qe7 pinning down the knight to king is easily answered by white castling.",
        "10. Nd3": "Sensible move!",
        "10... Qe7+": "I was not sure about this move, but didn't find any better move. Nf6 was into consideration, but for unknown reason I didn't like White response Qe2+. Bxa3 was also interesting without me finding a likable continuation",
        "11. Be3": "?? First blunder! Why not Qe2? Or possibly better was Kd2. After making some lighter mistakes it is preferable to keep the queen in the game. I think this move kind of ruined the game for white.",
        "11... dxe3": "Jeg synes ikke partier er så interessant etter tabben 11.Le3??, men jeg vil raskt gå gjennom resten av partiet for å se på generelt spill/brikkeføring. For jeg synes å huske at du viser tegn på langt dypere spilleforståelse enn hva åpningen viste.",
        "12. fxe3": ".",
        "12... Bxe3": "Jeg tar med løperen fordi jeg ønsker å konstruere trusselen om avdekkersjakk(discovered check). Aldri undervurder slike taktiske disposisjoner, hverken når du har muligheten til å gjøre det selv eller når du risikerer å bli utsatt for det. \r\n\r\nHer må du tenke gjennom hvordan du kan unngå/stoppe effekten. ",
        "13. g3": "Tror Qf3 hadde vært bedre her, gir kongen 2 felter å gå til i stedet for ett. ",
        "13... Nf6": "Jeg har fortsatt avdekkersjakken tilgjengelig og ser ingen grunn til å oppheve den. Her forutså jeg mulig 14. Qe2 og da tenkte jeg at min fortsettelse vil bli litt ubehagelig. Generelt: Jeg bruker tiden til å utvikle egne brikker og posisjon, mens du prøver å komme deg ut av en litt låst stilling",
        "14. Qe2": "Bra!",
        "14... Bg4": ".",
        "15. Qf1": "Her ser jeg at din dronning støtter h3, Lh5, g4 og løser litt av problemene dine",
        "15... Bg5+": "Kongen din er avdekket for angrep, men jeg kan avsløre nå at jeg hadde et bedre trekk, sjølv om også dette er nesten like bra.\r\n\r\n15...Bd4+ 16.Ne5 Qxe5+ 17.Kd2 Qe3# \r\n",
        "16. Kf2": ".",
        "16... Qe3+": "?? En skikkelig tabbe av meg. Strengt tatt burde jeg ha funnet sjakkmatt her også\r\n\r\n16...Be3+ 17.Ke1 Bd4+ 18.Ne5 Qxe5+ 19.Kd2 Qe3# \r\n\r\n\r\n\r\n\r\n\r\n",
        "17. Kg2": ".",
        "17... Qe4+": ".",
        "18. Kg1": ".",
        "18... O-O": ".",
        "19. Nf2": ".",
        "19... Be3": ".",
        "20. h3": ".",
        "20... Bf3": ".",
        "21. Rh2": ".",
        "21... Nh5": ".",
        "22. Qc4": ".",
        "22... Bxf2+ 23. Rxf2 Qe3 24. Qd3 Qxd3 25. cxd3 Bxd5 26. Re1 Nxg3 27. Re7 Rae8 28. Rxc7 Re1+ 29. Kh2 Ne2 30. Nc2 Rh1#": ""
    },
    "url": "https://gameknot.com/annotation.pl/challenge-from-strutta?gm=27412",
    "gameName": "Challenge from strutta",
    "players": "kenttm (1246) vs. strutta (1655)",
    "opening": "King's pawn game (C50)"
}