{
    "moves": {
        "1. e4 Nc6": "The so called Nimsovitsch defence. It usually transposess into something more mainstream.",
        "2. d4": "As good as any. Takes control of the centre.",
        "2... d5": "Offering to transpose into a sort of centre counter defence.",
        "3. Nc3": "This is all book of course but as I've never faced a nimsovitsch defence in my career its new to me as well.",
        "3... e5 4. dxe5 dxe4 5. Qxd8+ Kxd8 6. Bf4": "The other choice I looked at was Bg5  but I prefer to keep my forward centre pawn. My belief, rightly or wrongly is that your e4 pawn is more difficult to defend than my e5 pawn. If you look at this position in a simple way the following is true. the weak pawns are c2/c7, f2/f7, e4/e5. Pretty much the same strengths and weaknesses. The real difference is that I can castle long getting my King to safety and developing my Q rook. I can get my other rook to the centre easily enough. You cannot get your K to safety without trapping a rook or compromising your position in some manner. These are probably the reasons why Black doesn't play this sort of stuff at the highest levels.",
        "6... Bf5 7. O-O-O+ Ke8 8. Bb5": "I looked at several games where d6 was played instead either here or within the next couple of moves, basically swapping the difficult to defend pawn on e5 for the c7 pawn. With the Qs off the board the resulting 3 vs 2 pawns on the Q-side could eventually allow me to get a passed pawn on the Q-side. However I prefer to either double your pawns or keep your pieces tied up, so I played Bb5.",
        "8... Bc5": "seems sensible, attack the weak pawn",
        "9. Bg3 a6": "I thought you should play h5 at this point. Your Nh6-g4 manouevre is the only way to get play and you need to get your R out via h6. I thought 9....h6 10.h4 (if 10h3 h4 11.Bh2 Bxf2) Nh6. Forcing h4 means that there is one less pawn defending the B on g3. This doesn't mean much right now but it allows tactics based on a future Bg4 hitting the R on d1 then the N on h6 goes to f5 hitting the B on g3. If the N can take the B on g3 then my pawn structure will be pawns on g2,g3,h4 which means your pawn on e4 is a passed pawn. look at this possible line. 9...h5 10.h4 Nh6 11.a3 Bg4 12.Nge2 e3 13.fxe3 Bxe3  14.Kb1 Nf5 and black has a bit of play. Of course White must be careless to allow this but you would be giving yourself more opportunities by forcing small weaknesses on your opponent. Perhaps even something like this Bc5 \r\n9. Bg3 h5 10. h4 Rh6 11. Re1 a6 12. Bxc6  Rxc6 13. Nxe4 Bb6 14. Nf3 Nh6",
        "10. Bxc6+ bxc6": "Looking at the position now you have 3 pawns on the Q side which cannot support each other. With the Qs off you are unlikely to be able to use the open b file to mate me.In the long term your Q side pawns represent a winning position for me. AT this point I looked at 2 ways to play this position. Firstly to go for the Q side pawns by Na5, Nge2,c4-c5, Nd4. Secondly to go for the e4 pawn. ",
        "11. Re1 Bb4": "Best move although h5 again could be considered",
        "12. Re3 Nh6 13. Nxe4 Rd8": "I was under the impression that 13.....Ng4 14.Re2 just left me a pwn up for nothing. This way it gets more complicated. ",
        "14. Ne2": "I looked at all kinds of moves here;a3, c3, Nc3, f3 before deciding this was the way to do it. I was mostly concerned with the variations along the one outlined in the next move. One I found the idea of Rd1 swapping Rooks and threatening Rb8 I was happy.",
        "14... Ng4 15. Rb3 a5": "Again the best I think. 15.....Bxe4 16.Rxb4 Bxg2 17.Rd1 and you will lose a piece eg 17.......Rxd1  18 Kxd1 and your N on g4 is hanging and I am also threatening Rb8  winning the h8 rook",
        "16. a3 Bxe4 17. axb4 a4": "I was pleasantly surprised that you found this. Did you see that 17.....Bxg2 18.Rg1 Bh3 19.Bh4 wins a piece.",
        "18. Ra3": "I couldn't decide whether I wanted to play Rc3 or Ra3. Rc3 stops you moving your B to g6. All in all I thought I'd just win your a4 pawn. It isn't doing any damage at the moment but a pawn is a pawn and I can't see you doing any damage while I waste time picking it up.",
        "18... Ra8": "Apart from the obvious point that this loses a piece to f3, in itself this is a little pointless as I could still win the pawn by playing b3 as your pawn is now pinned to the rook. ",
        "19. f3": "Nothing more worth adding now.",
        "19... Bxf3 20. gxf3 Nh6 21. Nd4 Kd7 22. Rd1 Rhd8 23. Nf5+ Ke8 24. Rxd8+ Rxd8 25. Nxh6 gxh6 26. Rxa4 Rd4 27. Ra8+ Kd7 28. Rh8 h5 29. Rxh7 Ke6 30. Rxh5 Rxb4 31. Rh6+ Kd7 32. Rf6 c5 33. Rxf7+ Kc6 34. e6 Rb8 35. Rxc7+ Kb5 36. Rxc5+": ""
    },
    "url": "https://gameknot.com/annotation.pl/challenge-from-chris1rae?gm=18855",
    "gameName": "Challenge from chris1rae",
    "players": "moskowa12 (1200) vs. chris1rae (1221)",
    "opening": "KP (B00), Nimzovich defence, Bogolyubov variation"
}