{
    "moves": {
        "1. c4": "The English opening. Against this I normally try to transpose to the King's Indian, which is what happens here.",
        "1... Nf6 2. Nc3 g6 3. Nf3 d6 4. d4 Bg7 5. e4 O-O": "We have now reached the mainline of the King's Indian Defense",
        "6. h3 e5": "a typical move, inviting white to close the center with d5. Then black will attack on the kingside with an eventual ...f5, while white will try to make progress on the queenside.",
        "7. d5 Nbd7 8. Be2 Nc5": "putting pressure on e4",
        "9. Qc2 a5": "this move is necessary to prevent b4, driving off the knight",
        "10. O-O Ne8": "clearing the way for f5",
        "11. Be3 b6 12. a3": "preparing b4 again\r\n",
        "12... f5 13. Bxc5 bxc5 14. Bd3 f4": "i decided to close the center even more with this move to prepare g6-g5-g4 opening lines on the kingside. In some lines a Bxh3 sac might be possible also.",
        "15. b4": "white breaks through on the queenside",
        "15... axb4 16. axb4 Rxa1 17. Rxa1 cxb4 18. Na2": "white will now regain the pawn and can put his queenside files to use. If i didn't have an attack i would be worse.",
        "18... g5 19. Nh2": "preventing g4",
        "19... h5": "preparing it once more",
        "20. Nxb4 Bd7": "putting an end to both Nc6 and Ra8",
        "21. Be2": "once again restraing g4",
        "21... Nf6": "and preparing it again!",
        "22. Ra3 g4 23. hxg4 hxg4 24. Bd3": "this slight inaccuracy lets me clamp down on the kingside with g3. White's king is then short of escape squares",
        "24... Qe8": "preparing Qh5 and then Kf7 and Rh8 with a decisive attack",
        "25. Nf1 Qh5 26. Nd2 g3 27. fxg3 fxg3": "now if the white king flees via the f file Nxd5  wins material. white's king is therefore trapped",
        "28. Nf3": "the threat was Qh2  Kf1 Nxd5 . this is just about the only move covering h2 and closing the f file",
        "28... Kf7": "preparing Rh8",
        "29. Kf1 Qh1+": "invading on the kingside.",
        "30. Ng1": "forced. Ke2 Qxg2  and the knight is lost as Ke3 Ng4 is mate",
        "30... Ng4": "threatening both Ne3  winning the queen and Nh2  winning the knight",
        "31. Be2": "Qc1 seemed to stop both threats but Kg8  wins with a rook invasion. The rest is easy.",
        "31... Nh2+ 32. Ke1 Qxg1+ 33. Kd2 Bh6+ 34. Kc3 Qe1+ 35. Kb3 Rb8 36. Bh5+ Ke7 37. Ka2 Qxb4": "I am now 2 clear pieces up and white's king is in a mating net. I really enjoyed that attack!"
    },
    "url": "https://gameknot.com/annotation.pl/challenge-from-kermit_zap?gm=2214",
    "gameName": "Challenge from kermit_zap",
    "players": "kermit_zap (1703) vs. goldaxe2006 (1616)",
    "opening": "English opening (A16)"
}