{
    "moves": {
        "1. e4": "After a recent draw against master easy19 (which jstevens1 annotated here: http://gameknot.com/annotate.pl?id=40260&rnd=0.8769076898578284 ), she challenged me to a friendly unrated game which I gladly accepted.\nGK analysis found here http://gameknot.com/analyze-board.pl?bd=16385680&fb=1&rnd=0.6430096417965941",
        "1... c5": "Gotta love the sicilian.",
        "2. f4": "The grand prix attack, a variation I do not face as much although interestingly I had read an annotations of jstevens1 on another game where she played this just before our game commenced!",
        "2... d5 3. Nf3": "The mainline of course being 3. ed5 This move tempts black to play 3... de4 but after either 4. Ng5 or 4. Ne5 white has a very solid knight in the center that will take time to remove meanwhile cramping black's development severely. ",
        "3... e6": "Wary of \"allowing\" that knight to take the time to find a good post I play this move instead. ",
        "4. Nc3": "Now we've transposed into a position more commonly reach as a closed Korchnoi sicilian. The move order usually used to reach this position is 1. e4 c5 2.Nc3 e6 3. f4 d5 4.Nf3 White has a lead in development but the pawn structure is certainly weaker, a point exploited by my next move. ",
        "4... dxe4 5. Nxe4 Nc6": "Finally black develops a piece! All these moves are typical for this type of position. While black has allowed white a knight in the center it is certainly not as strong as the earlier variation would have allowed and can be easily threatened with Nf6. ",
        "6. g3": "Given white's already poor structure around the king this move surprised me and the GK engine agrees, allocating me a +.37 advantage, although with no variations. Unless black plans to move e6 any time soon (unlikely) then the LSB is certainly going to be developed to either b7 or a6, this move seems to just help black to decide which route to take. And after the bishops have been traded there is one less defender on White's kingside whereas black's queenside will not be hurting. That being said it is the second most common continuation in this position (6. Bb5 being the major alternative) and has the best score in the DB. However one we get to a crucial position I chose a strong lesser-played variation that really tests white's setup.",
        "6... Be7 7. Bg2 Nf6 8. Nf2": "The main idea in all the lines around g3, to castle Kingside and keep many minor pieces surrounding the king to cover the gaps. ",
        "8... Rb8": "! Probably not worth an exclamation but certainly the most logical move to me in this position, remove the threat of the b2 bishop and support an eventual black bishop on b7, trade off the LS bishops and attack white's plan, to use minor pieces to protect the king, and white's king!",
        "9. O-O b6 10. Re1": "The DB game has 10. b3 so we've reached a novelty. I'm not too threatened by this move, my king is ready to castle and get off the e-file when necessary, no need to slow the plan. ",
        "10... Bb7": "Natural.",
        "11. c3": "I had assumed at the time that this move was to support an eventual d4 push but we don't see that until move 24 in this game. Perhaps the idea was to play Qa4 and add a pin to the knight? ",
        "11... O-O": "Whatever the case it's time for black to castle and complete his development. ",
        "12. d3": "We've started to reach a middle game now and I certainly feel as though I've at least equalized as black. Despite starting with three pawn moves I've finished my development before white. The center is still up for grabs but I have the semi-open d-file and hope to trade off the LS Bishops soon. +.3 from the GK engine.",
        "12... Ne8": "GK engine doesn't like this move, dropping us back to an even keel but my idea was to help activate the DSB and get it on the a1-h8 diagonal. I also want a knight at d5, either entice c4 and strengthen that bishop's diagonal or let white decide to leave it there, but I don't want to play 12... Nd5 yet because I'm still looking to trade off those bishops so I eye the Ne8-Nc7-Nd5 path. ",
        "13. Ne5": "Again another move I'm not so sure of from white, I'll gladly take and trade bishops. If white takes on b7 first my rook my be momentarily misplaced there but it's an easy fix after ...Rd7",
        "13... Nxe5 14. Rxe5 Bxg2 15. Kxg2 Bf6": "Getting my bishop where it wants to be while gaining tempo on white. ",
        "16. Re1 Nc7": "I could have played g7 and aimed to keep my bishop on the board but there are still a lot of pawns hanging around and the board is fairly closed, this could turn into a great position to have a K v B",
        "17. Ne4 Nd5 18. Nxf6+ Qxf6 19. Be3": "White finally develops her last piece. 19. c4 and the bishop is tied to the defense of b2 for a while. ",
        "19... Rfd8": "I don't want to trade off in this position, I love my knight and white's bishop doesn't seem to have much to say other than supporting d4, a push which would have lots of complications and I'm not sure my opponent wants to get into just yet. ",
        "20. Bf2": "Giving the e-file back to the rook. ",
        "20... Qg6": "Starting to look for ways my queen can invade and do damage, adding an attacker to d3 and pinning f4. ",
        "21. Qf3": "Nicely bringing the queen into play and maintaining defense of both pawns. ",
        "21... Rd7": "Obviously my way in is down the d-file and I decide to double up my rooks. ",
        "22. Rad1": "More defense",
        "22... Rbd8": "Following through. The game is pretty even here but not a boring draw for sure! Plenty of unbalance and dynamics left in the position. ",
        "23. Kf1": "Getting the king off the hazardous diagonal and attempting to offer it some protection. ",
        "23... h6": "Making sure I won't be foiled by a bank-rank, especially watching the queen on a8 check. ",
        "24. d4": "Now we get to open the position a little more, let's see if White can make that bishop toll.",
        "24... cxd4": "GK engine goes from +.19 to -.01, I suppose I am helping white to improve her bishop with this move but I hadn't really considered any alternatives, perhaps 24...c4, really keep that bishop locked in behind it's pawns? But then my rooks start to look idle on the d-file, although 25. b3 cb3 26. ab3 Qc2 looks nice for black",
        "25. Bxd4 Qc2": "Invading into the position, I had decided not to play nice any more and told jstevens1 that I would try to see if I couldn't stir up some tactics!",
        "26. Qe2 Nb4": "Opening the rooks up and discouraging 27. Qc2 Nc2 which has lots of potential for black.  ",
        "27. Rd2": "Forcing me to retreat. ",
        "27... Qf5": "Not back to g6, keeping an eye on trying to quickly switch and get in the open kingside via h3. ",
        "28. a3": "Not wanting to give me full control on the d-file after 28. cb4 Rd4 29. Rd4 Rd4 30. a3 Qd5! threatening to play ...Qh1 or ...Rd2",
        "28... Nc6": "Not back to d5 as I want to keep the rooks open on the d-file and considering to trade off the bishop if it gets too pesky. ",
        "29. Be3": "Offering to trade down",
        "29... Rd7xd2 30. Bxd2 Qh3+": "Trying to peek in through the kingside",
        "31. Kg1 e5 32. Bc1": "Removing the threat on the bishop, looking to re-develop it onto b2. ",
        "32... Re8": "supporting the advance on the e-pawn",
        "33. Qf3 Qd7": "Protecting the knight, and re-claiming the d-file. I played here as opposed to f3 thinking that I coud look to play ...f5 and support ...e4",
        "34. Qf2": "Now I don't have to wait",
        "34... e4 35. Qc2 f5": "Now I'm very happy with my position, now I want to try to maneuver my knight to d3",
        "36. Qb3+ Kh7": "I wasn't worried about the check but this is probably the weakest response, I thought at the time that 36... Qe6 gave up my what little advantage I may have had but looking at 37. Qe6 Re6 black still looks okay, if 38. Rd1 I would probably play ...Na5 immediately and try to improve that piece, if 38. b4 then I would play 38... Rd6 and play the knight back to d8 and over to the kingside, supporting those pawns first on e6 and later f4 or g5. The white bishop would have time to play Bb2 and finally truly enter the game but I think I'd rather play on as black, at least while the rooks are still on the board. ",
        "37. Rd1 Qe7": "Playing to e6 wouldn't have been as good now as I would have allowed White time to play both Rd1 and b4. But perhaps it was better than the text. Alternatively if I had played the king to h8 after the check then a take on f5 doesn't come with check. ",
        "38. Qd5 Rd8": "The first real large mistake of the game by either side, I had missed that Qf5 came with check and thought that I had just been allowed to skewer white. GK recommends Qf6. ",
        "39. Qxf5+ Kh8 40. Qg4 e3": "And the mistakes keep coming, GK recommends trading rooks and repositioning the knight but I may have tried to save my rook for a little longer, this move essentially gives white another pawn. ",
        "41. Rxd8+ Nxd8 42. Qe2 Nb7": "So I decide to try to tie up White's queenside, The bishop still does not have a large scope, perhaps I can get some counterplay, the king is very open as well and this may provide me with some opportunities. ",
        "43. Qxe3 Qd7": "Trading the queens off certainly wouldn't help",
        "44. Qd4 Qf5 45. Qd2 Nc5 46. b4 Nb3": "A fork, but I'm not going to remove the minor pieces, hoping I may be able to get the queen to attack the bishop as well. ",
        "47. Qb2": "protecting the crucial b1. ",
        "47... Qd5": "Protecting the knight, but the queen on b2 is somewhat limited and this move also gets Black's queen to the center. ",
        "48. Qc2 a5": "wanting to protect the knight with a pawn and free up my queen. ",
        "49. bxa5": "GK engine doesn't like this, much preferring Be3, almost forcing Black to undefend the a5 pawn or get a worse queen position. It wanted black to proceed by trading the minor pieces, but this seems hopeless to me. At least if I keep the knight on the board I can hope for some complications down the road. ",
        "49... bxa5 50. c4": "GK labels this an inaccuracy over Be3 again",
        "50... Qc5+": "The engine also much preferred Qd4, and keeps wanting me to take on c1. ",
        "51. Kf1 a4 52. Bb2 Qe3": "Hoping to maybe corner the king and win some material ",
        "53. Qc3": "A mistake now from white, throwing away the advantage and allowing me to force a perpetual! GK wants Bc3 to protect the undefended d2 square my knight needs. ",
        "53... Nd2+ 54. Kg2 Qe2+ 55. Kh3 Qh5+ 56. Kg2": "And a draw is agreed to. Overall I was very happy with my play until I let f4 drop, but even afterwards I was able to keep pressure on and exploit the undeveloped bishop of White until I could take advantage of a misstep. A fun game to play :) "
    },
    "url": "https://gameknot.com/annotation.pl/challenge-from-jstevens1?gm=42159",
    "gameName": "Challenge from jstevens1",
    "players": "jstevens1 (1769) vs. concordborn (1558)",
    "opening": "Sicilian (B21), Grand Prix attack"
}