{
    "moves": {
        "1. e4 e5 2. Nf3 Nc6 3. d4 exd4 4. Nxd4 Nxd4 5. Qxd4 d6 6. Bc4 Be6 7. O-O h6": "Je pensais que ce coup sortait de la théorie mais apparemment non, on est encore dans une variante de l'écossaise.",
        "8. Nc3 c5 9. Qd3 Nf6 10. Re1": "Je pense que ce coup n'est pas génial.Dans la phase de développement, mieux aurait valu sortir le fou C1...Le fait qu'il reste toute la partie en C1 m'a gêné.",
        "10... Nd7": "Pas bon, car tu perds un temps précieux dans cette phase en rejouant la même pièce.\nIl aurait été préférable de jouer Fou en E7 pour roquer ensuite, ou dame pour faire ensuite le grand roque.",
        "11. Bxe6": "J'élude la menace potentielle du cavalier e5 en 2 temps....\n\n1 la prise du fou....",
        "11... fxe6 12. f4": "....2 f4 pour protéger la case e5",
        "12... Qb6": "Je pense que quelque chose comme Cavalier b6 pour ensuite pousser pion d5 aurait été un meilleur plan....Mais bon, pas simple du fait du retard de dvlmt",
        "13. Qc4 O-O-O": "L'enchaînement me donne un pion, à cause de la faiblesse sur case blanche (plus de fou sur cases blanches), ainsi que du retard de développement.",
        "14. Qxe6 Kb8": "Le retard de devlpt est maintenant clair : Ma dame bloque la suite....(sortie du fou)",
        "15. Nd5 Qa5 16. c3 h5": "A mon avis, un temps de perdu.",
        "17. b4 cxb4 18. cxb4 Qb5 19. a4 Qd3 20. Ra3 Rh6": "Répondre à une menace par une menace est à peser méticuleusement.....",
        "21. Qxh6": "\"Chiche\" :))))))",
        "21... Qxa3 22. Qg5": "Et paf, la menace de mat me permet de dégager la Dame -> Soit tu perds une Dame, soit tu es mat..\n\n",
        "22... Qc3 23. Nxc3": ""
    },
    "url": "https://gameknot.com/annotation.pl/challenge-from-zorglub39?gm=30890",
    "gameName": "Challenge from zorglub39",
    "players": "oduesp (1631) vs. zorglub39 (1200)",
    "opening": "Scotch (C45), Ghulam Kassim variation"
}