{
    "moves": {
        "1. e4": "This game starts as a wild King's Gambit. After some fascinating tactics in the early mid-game, the game settles down into a level position, and eventually a level pawn ending. But just when my colorful opponent has a draw within his sights, he blunders and then there is no way back. Enjoy!",
        "1... e5": "So I copy his move",
        "2. f4": "He opts for the King's Gambit. \"White offers a pawn to divert the Black e-pawn so as to build a strong centre with d2–d4. Theory has shown that in order for Black to maintain the gambit pawn, he may well be forced to weaken his kingside. The King's Gambit is one of the oldest documented openings, as it was examined by the 17th century Italian chess player Giulio Polerio. It is also in an older book by Luis Ramirez de Lucena.\"\r\nhttp://en.wikipedia.org/wiki/King's_Gambit",
        "2... exf4": "So I take",
        "3. Nf3": "He prevents Qh4 check",
        "3... g5": "I protect the extra pawn.",
        "4. h4": "He aims to break up my king side pawns.",
        "4... g4": "So I push again",
        "5. Ne5": "Knight comes forward. There is an interesting variation now, 5...h5, 6. Bc4 Rh7 (to protect f7). I don't know any other opening when the first piece developed in the black army is his king's rook! I opt for something else.",
        "5... d6": "I am giving back a pawn, but his pawn on h4 is going to be weak.",
        "6. Nxg4": "So he takes the pawn",
        "6... Be7": "I attack h4.",
        "7. h5": "There is a logic to this, hanging onto his h pawn. However the post-match analysis gives this as a mistake. On the world opening database on Gameknot, there are 19 games with this position, only 1 continued with h5 and black won that. Kleifges, Matthias (2175) vs. Meyer, Gerd1 (2055) continued with 7. h5 Bh4+ 8. Nf2 Qg5 9. d4 Nf6 10. Qf3 Ng4 11. g3 Bxg3 12. Qxg3 fxg3 13. Bxg5 Nxf2 14. Rh4 Rg8 and black is a clear pawn up.",
        "7... Bh4+": "So I throw in the check",
        "8. Nf2": "His wandering knight retreats.",
        "8... Qg5": "I continue as in Kleifges, Matthias (2175) vs. Meyer, Gerd1 (2055)",
        "9. d4": "So does he",
        "9... Nf6": "I continue. As his knight on f2 is pinned by my bishop on h4, I am now threatening Ng4 or Nxe4",
        "10. Qe2": "He protects e4, but not g4. Can't he see that I can just play Ng4 and win his knight? Post-match analysis claims this is a mistake and suggests 10. Qf3 Ng4 11. Rxh4 Qxh4 12. Bb5+ c6 13. Bc4 Ne3 14. Bxe3 fxe3 15. Qxe3 Qxh5 16. Nc3 Qh2 17. O-O-O Qxg2",
        "10... Ng4": "So I continue with my plan. Post match analysis suggests Nc6 11. d5 Ne5 12. Nc3 Nxh5 13. Qd2 Ng4 14. Ncd1 Bd7 15. Qd4 O-O 16. Qc4 Ng3 17. Bxf4 as best for black. I didn't see his next move!\r\n \r\n",
        "11. Qb5+": "Oops! Now I have a fight on my hands. If I take his queen, he takes back with his bishop with check. Say I reply to the bishop check with c6. After 13. Rxh4 cxb5 my \"attack\" is coming to nothing and my pawns are split. Fortunately I don't have to take his queen.",
        "11... Nc6": "So I just develop instead. I am now threatening Bxf2 check, so his reply is forced.",
        "12. Qxg5": "He takes my queen",
        "12... Bxg5": "I take his.",
        "13. c3": "He protects d4. He now threatens Nh3 followed by taking on f4. Only one way to stop going a pawn down.",
        "13... Ne3": "So I lob in the knight",
        "14. Na3": "He protects c2",
        "14... Bd7": "I continue to develop",
        "15. Nh3": "He hits my bishop",
        "15... Bh6": "I retreat, keeping an eye on f4",
        "16. Kf2": "He threatens 17. Nxf4 Bxf4 18. Bxe3 Bxe3+ 19. Kxe3 winning a pawn.\r\n",
        "16... Nd1+": "So I throw in a check",
        "17. Kg1": "He retreats",
        "17... Ne3": "I go back. He could now play Kf2 and repeat, and presumably the game ends in a draw. He carries on playing for a win however.",
        "18. Nc4": "Knight challenges my knight",
        "18... O-O-O": "I castle",
        "19. Nxf4": "He takes my pawn, removing a defender of my knight.",
        "19... Nxf1": "So I take his bishop",
        "20. Kxf1": "He takes back",
        "20... Rde8": "And now the only way he has of defending e4 is Nd2, which drops the knight on f4, so he loses the pawn back.",
        "21. Nd5": "So he advances with his knight",
        "21... Bxc1": "I take his bishop",
        "22. Rxc1": "He recaptures",
        "22... Rxe4": "I get my pawn back. If now Nf6 - seemingly forking my rook and bishop, I have Rf4check picking up his knight on f6. He can't allow my domination of the e file to to unchallenged, so he plays.",
        "23. Re1": "Challenging my rook",
        "23... Rhe8": "I protect, and threaten his rook",
        "24. Kf2": "He finally links his rooks",
        "24... Re4e6": "I drop my rook back",
        "25. b3": "He protects d4. The game is fairly level now",
        "25... Ne7": "I challenge his advanced knight.",
        "26. Nxe7+": "He takes",
        "26... Re8xe7": "I take back",
        "27. a4": "He continues with his mysterious queen side pawn moves.",
        "27... Re6xe1": "I take his rook",
        "28. Rxe1": "He takes back",
        "28... Rxe1": "I take again",
        "29. Kxe1": "He takes back",
        "29... Be6": "I hit his knight.",
        "30. Kf2": "He ignores it",
        "30... Bxc4": "So I mess up his pawns.",
        "31. bxc4": "He takes back.",
        "31... Kd7": "I advance my king",
        "32. d5": "He stops my king coming to e6 or c6",
        "32... Ke7": "So I play it to e7",
        "33. Ke3": "He moves his king up",
        "33... f5": "I advance my pawn.",
        "34. Kd4": "And just when it looks like a draw, he goes badly wrong. His king is needed on the king-side to protect his pawns and counter attack my pawns. There is no way through for his king on the queen-side and he has to make an embarrassing retreat, but by then the position is lost. Computer analysis gives 34. Kf4 Kf6 35. a5 c5 36. dxc6 e.p. bxc6 37. c5 dxc5 38. c4 a6 39. h6 Ke6 40. Ke3 Ke5 41. g3 Ke6 42. Kf3 Ke7 43. Ke3 Kf7 44. Kf3 as best.",
        "34... b6": "So I put paid to any ideas he may have of playing c5",
        "35. Ke3": "So he comes back.",
        "35... Kf6": "I advance",
        "36. Kf4": "his king comes up",
        "36... h6": "I block his pawn. Because I can play a7-a6-a5 I can make his king move first, and then I can come in and either win the pawns on the king-side or the queen-side, depending which way he turns. The position is lost.",
        "37. g3": "So he wastes a move.",
        "37... a6": "and so do I",
        "38. g4": "He advances again",
        "38... fxg4": "I take",
        "39. Kxg4": "He takes back",
        "39... Ke5": "I advance",
        "40. Kf3": "He stops me from winning his queen-side pawns.",
        "40... Kf5": "But now his pawn on h5 is a gonna",
        "41. Ke3": "He moves his king",
        "41... Kg5": "I go after the pawn",
        "42. Ke4": "King comes up again",
        "42... Kg4": "I decide to try and drive his king to an inferior square before taking the pawn.",
        "43. c5": "He throws a pawn - there is nothing better.",
        "43... bxc5": "So i take",
        "44. c4": "He wastes a move",
        "44... a5": "and so do I. His king has to retreat now",
        "45. Ke3 Kxh5": "The pawn finally goes",
        "46. Kf4": "His king comes in",
        "46... Kg6": "My king comes back. This is a simple win now.",
        "47. Kg4": "King comes across to block my pawn.",
        "47... h5+": "I advance with check.",
        "48. Kf4": "King moves out of check",
        "48... Kf6": "I move my king across. Now if it wasn't for the queen-side pawn, this would be a draw. A lone h pawn would not win in a king and pawn ending. However, in this game, while he is taking my h pawn, I can round up his other pawns.",
        "49. Ke4": "King goes across",
        "49... Kg5": "My king goes up",
        "50. Ke3": "His goes back.",
        "50... Kg4": "My king goes up.",
        "51. Kf2": "His goes back.",
        "51... Kf4": "Mine comes across",
        "52. Kg2": "He goes over to stop my h pawn",
        "52... Ke3": "Mine goes further into his territory",
        "53. Kg3": "His comes up",
        "53... Kd4": "And I attack his d pawn, and he finally throws in the sponge. Many thanks for reading this, I hope you enjoyed it. Please leave a comment or two, and rate the annotation on the star system. Until next time dear reader!"
    },
    "url": "https://gameknot.com/annotation.pl/challenge-from-9422m?gm=46979",
    "gameName": "Challenge from 9422m",
    "players": "9422m (1890) vs. charleshiggie (2114)",
    "opening": "KGA (C39), Kieseritsky, Kolisch defence"
}