{
    "moves": {
        "1. e4": "A good solid move from White...releasing the f1 Bishop and the Queen whilst establishing a strong centre.",
        "1... e6": "French Defence",
        "2. d4": "most common move vs the French Defence.",
        "2... d5": "Theory furthermore.",
        "3. Nc3": "Winawer Variation...a very common line for White.",
        "3... dxe4": "a rather dubious approach from Rory(Black)",
        "4. Nxe4": "a player of the White pieces is very happy here as from his point of view he has a good,strong lead in development.",
        "4... Nc6": "I wouldn't agree with this line...perhaps Nd7-Rubinstein Variation is more logical",
        "5. Nf3": "A good logical move on white's part",
        "5... Nf6": "this position looks quite solid for both players and Black has solidified his position but the c6 Knight belongs on d7 in this position as it covers Nxf6 whereby Black's d7 Knight is allowed into the game and white has to exchange a good solid central Knight which just gives Black a free tempi.",
        "6. Bd3": "Black cannot take the pawn on d4(... Nxd4 7.Nxd4 Qxd4?? 8.Bb5 !!) this discovered attack as you can see wins a Queen and makes it 1-0 on the spot.\r\nA pawn such as the pawn on d4 in this position is called \"A Poisoned Pawn\" for obvious reasons.",
        "6... Be7": "A good solid move from Black;developing his pieces logically.",
        "7. c3": "supporting the central d4 pawn whilst opening lines for the Queen.",
        "7... O-O": "0-0 obviously!!",
        "8. O-O": "...",
        "8... b6": "Black is preparing to Fianchetto on the Queenside-which can become very effective as the Bishop is striking out at the centre from afar.",
        "9. Qe2": "Qd2 allows the Rook to have more space. Therefore, White is aiming to develop the Bishop in order to connect his rooks- a very useful and effective technique.",
        "9... Bb7": "Bb7! Fianchetto-ing the Bishop is very good in this position as it strikes out at the centre from afar...as you can see the Bishop has a good scope and it is threatening many squares.",
        "10. Bg5": "A strong,logical move; connecting the Rooks whilst developing into a good position.",
        "10... h6": "Trying to deflect the Bishop but h6 is a bit passive as it creates organic weaknesses in Black's King-Side making Black vulnerable at a later stage.",
        "11. Bh4": "obviously.",
        "11... Na5": "To be quite frank with you, I think that this move is a bit passive...Black might argue that the scope of the b7 Bishop has become quite effective but in my view,Black's Knight isn't doing which weakens his position...a move such as b4 forces the Knight to move back to its previous square which just gives White a free tempi.",
        "12. Rad1": "Ra-d1! Good solid move!",
        "12... Nxe4": "Exchanging pieces.",
        "13. Bxe7": "...",
        "13... Nxc3": "going into an exchange.",
        "14. bxc3": "only move",
        "14... Qxe7": "Only move once again",
        "15. Rfe1": "A good solid move! Giving the Rook a good scope.",
        "15... Rfe8": "A reasonable reply from Black.",
        "16. c4": "c4 is a good solid move which strengthens White position furthermore. In this position it is quite clear that White is better/stronger.",
        "16... Rad8": "A good strong logical move but note that the d pawn is not under attack because say White plays a passive move such as h3 then a continuation is: 17... Bxd3 18.Qxg3 Rxd4 19.Bh2 !!",
        "17. d5": "Now black is really starting to feel the heat. White is clearly winning in this position.",
        "17... Kf8": "A bit passive. There are more logical replies such as c6!?",
        "18. Qe4": "The threat is obvious but Black has to waste some time in order to thwart White's threat.",
        "18... Qf6": "Black is starting to whither here. A forced move like Qf6 shows that White is controling the game.",
        "19. Nd4": "Nd4!? I am not sure how this works after: 19. ... exd5 20.Qh7 Rxe1  21.Rxe1 g6!? After g6 the mating threat on h8 is no longer available but to be fair White has a huge positional advantage.",
        "19... exd5": "this is where things start to get complicated;this is a critical point in the game as both players will need to try to tactically outplay his/her opponent.",
        "20. Qh7": "Very nice idea from White... the threat of Qh8 mate is obvious! Qh7 deserves an exclamation mark as Black is now in deep trouble.",
        "20... g5": "the only move that avoids a loss in material. Despite black being ahead in material, White clearly has a better position-this is an important point to note...\"NEVER RELAX WHEN YOU ARE MATERIAL AHEAD\" Unfortunately, it seems like Black has deliberately tried to disobey this Golden Rule in this game.",
        "21. Nf5": "Nf5! Threatening both the H pawn and Ng7",
        "21... Rxe1+": "Black is running out of moves here!",
        "22. Rxe1": "The only move...duh!",
        "22... Re8": "This looks like a reasonable move but White has to be congratulated on his little combination coming up...",
        "23. Qg8+": "Qg8!! MARVELLOUS Kxg8, Rxe8  Kh7 and Black has a discovered attack by moving the Knight away. White has played superbly in this game; developing his pieces well, blockading Black's position and finally coming up with a superb combination such as this one. 10/10 for White.",
        "23... Kxg8": "This move is forced.",
        "24. Rxe8+": "This is where the fun starts!",
        "24... Kh7": "Now Black is DOOMED!",
        "25. Ne7+": "Discovered Attak giving Black all sorts of problems.",
        "25... Qg6": "The only move as any other reply ends up in mate.",
        "26. Nxg6": "Black really oughta resign now as he is going into a losing end-game.",
        "26... fxg6": "Once again, The only reasonable move.",
        "27. cxd5": "White is slowly going to pick the pawns off now.",
        "27... Bxd5": "To be quite frank with you, Black is pointlessly playing on now.",
        "28. Re7+": "Winning a pawn and severely crippling Black's position.",
        "28... Kg8": "Black really oughta resign now."
    },
    "url": "https://gameknot.com/annotation.pl/challenge-from-goldaxe2006?gm=3434",
    "gameName": "Challenge from goldaxe2006",
    "players": "goldaxe2006 (1740) vs. dragonfist (1200)",
    "opening": "French (C10), Fort Knox variation"
}