{
    "moves": {
        "1. Nf3 Nf6 2. Nd4 Ng8 3. Nc6 Nf6 4. Nxb8 Ng8 5. Nc6 Nf6 6. Nd4": "As you see Kirill (chessbrok) is giving a horse forward to me.",
        "6... e5": "..but not letting to put it to initial state.. my horse start jumping",
        "7. Nf3 e4 8. Nd4": "don't want to go home g1",
        "8... c5": "Also thinking it will be only bad to him that he moves pawns forward playing without knight",
        "9. Nf5 d5 10. Ng3 Bd6": "he allows me to breath now ;)",
        "11. d3": "\"program movement\" - triing to detonate his brave pawns",
        "11... exd3 12. cxd3": "changed flank pawn to center one - count good",
        "12... O-O 13. Bg5": "strong move - any exchange works for me, and this move forces exchange anyways",
        "13... Be5 14. e4 Bxb2": "really mislooked it :( but finally it was np",
        "15. Nd2 Bxa1 16. Qxa1 dxe4 17. Ngxe4": "I'm on equal material, but having 2 minor pieces for his rook.\nAlso strong position as I count",
        "17... Re8 18. Be2 Re6": "triing to keep material",
        "19. Bxf6": "I'm ok just to make his pawn structure worse",
        "19... gxf6 20. Nxc5 Re8 21. Nce4": "going to make castling so need to get bishop safer",
        "21... Kg7": "mighty atack",
        "22. O-O Kg6 23. Rc1 f5 24. Ng3 f4 25. Nge4 f5 26. Nc3 b5": "preparing b4 and my horse must stop defending bishop",
        "27. Rb1": "preventing b4",
        "27... Rb8": "b4 possible again",
        "28. Kf1": "horse is free to go now",
        "28... b4 29. a3": "going to change 2 knights for a rook",
        "29... bxc3 30. Rxb8 cxd2 31. Qc3": "going to get dangerous pawn",
        "31... Qe7 32. Qxd2": "got 1 more pawn at the moment, in general think my position is much better",
        "32... Qxa3 33. Qd1": "I mean to give a check to h5",
        "33... Rd8": "he is not agree",
        "34. d4": "not sure strongest... but I should give my bishop go (really not good to keep queen in line with opponent's rook )",
        "34... Qc3": "pawn d4 need help",
        "35. d5": "it saves itself",
        "35... Qc5 36. Rb5": "finally my rook leaving to keep moveless his rook and bishop",
        "36... Qc7": "if I lucky to change queens it'd me much easier\n\nhe don't allow further pawn's movement",
        "37. Qd4 Ba6": "he forces exchange.. not good to me",
        "38. Rc5 Bxe2+ 39. Kxe2 Qb7": "now I'll make tricky combination that gives me a pawn and rook exchange",
        "40. Rc6+ Kh5 41. Rh6+ Kxh6 42. Qf6+ Kh5 43. Qxf5+ Kh6 44. Qf6+ Kh5 45. Qxd8": "nice how you think ? but now his checks starting",
        "45... Qb2+ 46. Kf3 Qc3+ 47. Kxf4 Qd4+ 48. Kf5 Qxf2+ 49. Ke6 Qe2+ 50. Kf7 Qe5": "I'm running ok here I'm not sure more.. \n\nhe repated it is a draw it is a draw, I kept on playing",
        "51. d6 Qf5+ 52. Ke7": "I thought I will get save position on queen's side (left) ...",
        "52... Qe5+ 53. Kd7 Qb5+": "now I got that there is no safe place and started to count is there a place on another side.. now I think there is no such place and this is a draw.\n\nBut at the moment black resigned - not stand up to my certainty..\n\nImpressive game to me!"
    },
    "url": "https://gameknot.com/annotation.pl/challenge-from-al_ya?gm=10606",
    "gameName": "Challenge from al_ya",
    "players": "al_ya (1362) vs. chessbrok (1439)",
    "opening": "Reti opening (A05)"
}