{
    "moves": {
        "1. e4 e5 2. Nf3 Nc6 3. Bb5 a6 4. Ba4 b5 5. Bb3": "Ruy Lopez (C70), Graz variation",
        "5... Nf6 6. O-O Be7 7. Re1 d6 8. c3 Be6": "And now were out of the book. I don't have a solid defense worked out against the Spanish game, so I decided to try the strategy of removing the LSB in an attempt to reduce white's minor pieces.",
        "9. d4 exd4": "Capturing the pawn seemed like a bigger priority for if I had taken the LSB then my center blockade would be more vulnerable.",
        "10. Bxe6 fxe6": "And now I have a pawn in place of the bishop for blockading and a tempo I believe for not initiating the capture.",
        "11. cxd4 O-O 12. d5 exd5 13. exd5 Nb8 14. Nc3 Nbd7": "I'm seeking to position the knight on to the e5 or c5 square. The computer analysis says this is the first mistake of the game and suggests ...Re8 as better.",
        "15. Nd4 Rf7": "I push the rook to prevent the knight fork at e6.",
        "16. Nc6": "the white knight has reached an advanced post, blockading my c7 pawn and forking my queen & DSB. The computer analysis says this is a mistake and suggests Ne6 as better.",
        "16... Qf8 17. b4 h6": "To prevent blacks DSB from attacking my knight.",
        "18. h3 Ne8 19. Rxe7": "Computer analysis says this is an inaccuracy and suggests Ne2 as better",
        "19... Rxe7 20. Nxe7+ Qxe7 21. Bf4 Nef6 22. Qd3 Ne5 23. Bxe5 Qxe5 24. Rd1 Re8 25. a4": "At this point I became frustrated. In my mind I had developed reasonably, but still couldn't prevent the outright loss of a pawn. Somewhere my philosophy had betrayed me.",
        "25... Ne4": "Ne4! So I analyzed a little bit and decided that losing the exchange would actually be ok in this position because of my pawn majority on the queen side. Computer analysis says this is a mistake and suggests bxa4 as better.",
        "26. Re1": "As anticipated.",
        "26... Qxc3 27. Qxc3 Nxc3 28. Rxe8+ Kf7 29. Ra8 Nxd5 30. axb5": "Computer analysis says this is a mistake and suggests Rxa6 as better.",
        "30... axb5 31. Ra7 Kf6": "The idea here is that my king will beat out the white king to the queen side action and working in junction with the knight will win out over the rook.",
        "32. Kf1 Ke5": "Computer analysis says this is an inaccuracy and suggests g6 as better.",
        "33. Ke2 Kd4 34. g3 Kc4 35. Ra1 Kxb4 36. Kd3 c5 37. Ra6 c4+ 38. Kd4 Ne7": "Honestly I retreated with the idea that Rxd6 then I could fork, if not then I could at least let the rook chase my knight around and distractedly gobble up my king side pawns.",
        "39. Ra7": "I never considered or even noticed the fork at c6 until I viewed the computer analysis! Apparently neither did white. Computer analysis says this is a blunder and suggests Ra1 as better.",
        "39... Nf5+": "Computer analysis says this is a blunder and suggests Nc6+ as better.",
        "40. Kd5 c3 41. Rc7 Kb3 42. g4": "playing into my initial plan. Computer analysis says this is a mistake and suggests Ke4 as better.",
        "42... Nh4 43. Kxd6": "this move was a surprise and I knew it was a mistake. Computer analysis says this is a mistake and suggests Ke4 as better.",
        "43... g5": "not realizing the promotion was inevitable I temporarily reinforce the king side for good measure. Computer analysis says this is a mistake and suggests c2 as better.",
        "44. Rxc3+": "and white checks out of spite and yet good sportsmanship.",
        "44... Kxc3": "White resigns. Thanks for watching my game. Feedback is welcome."
    },
    "url": "https://gameknot.com/annotation.pl/challenge-from-porygon?gm=52359",
    "gameName": "Challenge from porygon",
    "players": "gfrancis (1710) vs. porygon (1646)",
    "opening": "Ruy Lopez (C70), Graz variation"
}