{
    "moves": {
        "1. f4 d5 2. Nf3 Nc6 3. e3": "This is the K-side counterpart to the English opening. In that opening, White plays to control the light squares: in this one, White plays a dark-square game.",
        "3... Qd6": "A little premature to bring out the Queen. 3...B-N5, pinning, is a better choice. ",
        "4. Bb5": "I take my own advice, and also make K-side castling possible.",
        "4... g6 5. d4": "Another move to control the dark squares. I am eventually aiming to place a piece on K5.",
        "5... e6": "Black, in turn, tries to take the light squares.",
        "6. Nbd2 Bg7 7. Nb3 Bd7": "Black's development is nearly complete. The game begins to pick up in tempo here.",
        "8. Ne5": "I plant my piece on K5, as planned.",
        "8... Bxe5": "A tactical interlude comes here. If I immediately respond with 9 BPxB, Black can reply with 9...Q-N5ch winning the White KB. So I have to play BxN first, before retaking the Black B on K5.",
        "9. Bxc6 Bxc6": "Now it is safe for me to capture the Black B.",
        "10. fxe5": "The Q must move.",
        "10... Qe7 11. O-O": "I finally get around to castling... also taking the half-open KB file.",
        "11... Nh6": "Black clears his back rank. He can now castle on either side.",
        "12. Bd2": "I prepare to connect my Rooks with 13 Q-K2. But Black's 12th move makes me postpone this plan.",
        "12... f5": "I'm not sure what the point of this move is. It lets me create a passed Pawn and puts me a Pawn up.",
        "13. exf6 e.p.": "I naturally capture en passant, presumably forcing Black's Queen to retreat.",
        "13... Qxf6": "Wow! A monumental oversight that ends the game instantly. Did he not see that the Pawn was guarded by the Rook on KB1?",
        "14. Rxf6": "I seize the opportunity, and Black resigns."
    },
    "url": "https://gameknot.com/annotation.pl/challenge-from-thehellion?gm=30551",
    "gameName": "Challenge from thehellion",
    "players": "thehellion (1260) vs. lovronix (1133)",
    "opening": "Bird's opening (A03), Lasker variation"
}