{
    "moves": {
        "1. e4": "The Caro Kann is supposed to be a very defensive opening for black but Zendenball is a remarquable attacker.",
        "1... c6": "Caro Kann ! ",
        "2. d4": "Most common line",
        "2... d5 3. e5": "Classical answer",
        "3... Bf5 4. Nf3": "protecting the central pawns",
        "4... e6": "Blocking the center",
        "5. Be2": "Preparing the castle",
        "5... Nd7 6. O-O": "King in safe",
        "6... h5": "offensive move but black weakens both sides in case of castling.",
        "7. b3": "to prepare 8. c4",
        "7... Be7": "aiming at the kingside",
        "8. c4": "Classical in Caro Kann",
        "8... g5": "A pawn storm is coming.",
        "9. Nc3": "The GK computer points it as a mistake. The machine prefers 9. cxd5 which indeed would have been better. 9. Nc3 is too passive. it doesn't create any serious menace and doesn't prevent black's progression on the kingside.",
        "9... Nf8": "The black knight is aiming at g6. All the black army is on white's castle side.",
        "10. Bd3": "to menace f5 but unprotecting the f knight. I think that 10. cxd5 would still have been better. For if 10. ... cxd5 11. Bxb5+ Nd7 - pinned. and if 10. ... exd5, black's center is weakend and the LSB looses one protection.",
        "10... Nh6": "King near the edge is usually considered as bad but in this case it protects the LSB and takes control of g4",
        "11. Bxf5": "to prevent 11. ... Bg4",
        "11... Nxf5 12. Bd2": "To prepare a further Qc1 to attack the g pawn but it's too slow.",
        "12... g4": "Attacking the brave Lancelot who wanders beneath the caslte wall.",
        "13. Ne1": "Only move",
        "13... Nxd4": "I oversaw this move. White is now in serious trouble.",
        "14. Bf4": "Protecting what's left of white's center",
        "14... Nf5": "The evil black knight goes back to his place after his raid.",
        "15. f3": "To get rid of the g soldier who is ranging under the castle wall.",
        "15... Ng6": "The black cavalery is all out, charging the unprotected DSB.",
        "16. Nd3": "The brave knight comes to protect the archery. A mistake. 16. Qd2 would have been better.",
        "16... Nxf4": "Black takes",
        "17. Nxf4": "trading",
        "17... Ne3": "I oversaw this fork attack when playing 16. Nd3.",
        "18. Qd3": "As black has no more LSB, better being on a light square.",
        "18... Nxf1": "\"My king, our castle tower just fell\"",
        "19. Kxf1": "White is now seriously in late of material and his pawn structure is bad.",
        "19... Qc7": "Attacking the unprotected e man at arms",
        "20. Qe3": "To protect the center.",
        "20... O-O-O": "rook on the d semi open file.",
        "21. Qxa7": "Last chance",
        "21... Qxe5": "menacing both kinghts and the a rook.",
        "22. Qa8+": "Last attack.",
        "22... Kc7": "22. ... Kd7 was possible but then 23. Qxb7+",
        "23. Nb5+": "The knight is condemned, better dying after a nice charge.",
        "23... cxb5": "The black king is seriously weakened but white has not enough material left to take profit of it.",
        "24. Qa5+": "hoping a mistake from black.",
        "24... Kb8": "Good move. White cannot carry on attacking the black king.",
        "25. Re1": "Saving the rook.",
        "25... Qxf4 26. cxb5": "A very last menace, in case if black were too confident.",
        "26... Qb4": "Good move, white must trade.",
        "27. Qxb4": "so that...",
        "27... Bxb4": "Black's advantage is considerable, i still play a couple of moves more without any hope, just to see which strategy my able opponent will elect.",
        "28. Rc1 gxf3 29. gxf3 Rdc8 30. Ra1 Rc2 31. a3 Bc3 32. Rd1 Rg8": "White submits here. (forced mate in 2) Well done Zendenball ! I have to study the Caro Kann because I early in the game couldn't imagine what to do and plaid a couple of fruitless moves which let black lead a dangerous attack."
    },
    "url": "https://gameknot.com/annotation.pl/challenge-from-ptitroque?gm=53149",
    "gameName": "Challenge from ptitroque",
    "players": "ptitroque (1826) vs. zendenball (1806)",
    "opening": "Caro-Kann (B12), advance, Short variation"
}