{
    "moves": {
        "1. d4": "I always think Gruenfeld",
        "1... Nf6 2. e3 g6 3. a3 d5 4. Nc3": "still using the same idea.  the one recent time kentwood played the main line, I missed the hanging pawn after d5.  Here, white blocks the c-pawn.  I'm still aiming at d4.",
        "4... Bg7 5. h4 O-O": "this avoids the annoying bishop check.  h4 is a little mysterious.",
        "6. f3": "five pawn moves in the first six",
        "6... c6 7. g4": "guess he's not castling k-side",
        "7... Na6": "usually, sticking to my opening plan, I want Nc6, but off the line now and I've seen some big guns put the knights \"on the rim.\"",
        "8. g5 Nh5": "guess I'll just move that piece.  Black is way behind in development and this will cost him.  he certainly has more space, though and a lot of players who don't play by the principles are downright lethal as far as tactics.  This fellow gave me a run for my money before",
        "9. Be2": "finally",
        "9... Ng3": "Steinitz says attack!",
        "10. Rh2 Nxe2": "I wasn't sure about trading a very active N for a somewhat lazy, no matter how good.  There's also the psychological element; letting white know I'm not afraid of confrontation",
        "11. Qxe2": "good as it develops besides captures.  the Ng may have been better",
        "11... c5": "back to the gruenfeld ideas, fighting for d4 and breaking up the center",
        "12. Qd3": "and he doesn't take",
        "12... c4": "the Q must retreat now.  before moving the Q, white could have at least pretended to be concerned with development and aimed at q-side castling.",
        "13. Qe2 Bf5": "black has found a chink in the \"armour\" such as it is",
        "14. f4": "hmm, is e4 better here?  it certainly forces me to act whereas now I keep the target in my sights, breath, squeeze..",
        "14... Qd7": "2B reminded me that moving the Q, even one square to get the rooks connected is a good choice.",
        "15. h5 Bg4": "respond in kind, or actually with a much more forcing move",
        "16. Qg2": "that got your attention, but of course now, by taking the pawn I cover the B as well.  two for the price of one shopping at gameknot",
        "16... gxh5 17. Nxd5": "yeah, yeah, yeah...we'll just see about that.  With the exception of the a-rook, black is developed and the king is fairly secure.  White's king practically wears a bull's eye and has three pieces looking quaint.  white still has space and arguably a better pawn structure.  even though this grabs a pawn, 17. Bd2, 18. 0-0-0 might have proved better for white.",
        "17... Qe6": "now what, mr. ed",
        "18. Nc3 Bxd4": "pin=snack",
        "19. Nge2": "breaks pin, threatens B and covers N.  not bad",
        "19... Bxe3": "unless I do this.  black's material edge is growing but this isn't as much of an asset as the B-B-Q coordination",
        "20. Kf1": "you better run, but that not safe that way",
        "20... Rad8": "The master 2B also said to bring in reinforcements for the attack.  This rook is happy to take charge of the d-file.  This is instead of trading Bs on c1 and does indeed leave b7 hanging, a lovely spot for la dame, as mentioned in another game.",
        "21. Bxe3": "I have been chastized for trading when down in points.",
        "21... Qxe3": "what else",
        "22. Re1": "this was good, but castling early would take care of all this mess.  Is Nd5 good for white? ...Rxd5,23. Qxd5 Bh3+24. Rxh3 Qxh3 check and this isn't good.  could be 23....Qf3+ and white probably won't exchange Qs but I admit that I might.",
        "22... Rd2": "the R puts pressure on e2 and this can be followed with ...Rfe8.  The poor knight isn't such a big gun on a6, but black has enough initiative and more space.  there are a couple hanging pawns but there is only one thing that matters now:  the death throes of the black K.",
        "23. Nd5": "a good fork.  watch out for the tactical fellows.  unlike kodiakjack, I'm not a knight fan because of this.  ...Nxe7 is easily dealt with but does give a move of the most forcing kind",
        "23... Bxe2+": "really only one thing to do: force right back",
        "24. Rxe2": "sure",
        "24... Rd1+": "now, if 25. Re1, the only move, Qxe1#.  the moves were conditional after this. Soltis says that ideas spark combinations and forcing moves fuel them.  once things get rolling, just keep going.  at least chess is played in Botswana",
        "25. Re1 Qxe1#": "As Mcdonald says, just in time for a miniature."
    },
    "url": "https://gameknot.com/annotation.pl/challenge-from-roan99?gm=27807",
    "gameName": "Challenge from roan99",
    "players": "billy16 (1280) vs. roan99 (1339)",
    "opening": "Queen's pawn game (A45)"
}