{
    "moves": {
        "1. e4": "This start to a game does it work......????",
        "1... e5 2. Qh5 g6 3. Qxe5+ Qe7": "Massive blunder my me !!!!! What about Nc6 0r Nf6....has to be better tha Qe7 right....lols. I pay the penalty...:-).",
        "4. Qxh8": "Or is it, know he wants Qxh8, however it could proove costly.....",
        "4... Nf6": "Nf6, I like this move know his queen is trapped an needs help.....",
        "5. d3 d6 6. Bh6": "Good to attack the black squared bishop it's pinned, know what will white do next..",
        "6... Nbd7 7. Nc3 c6 8. d4 b5 9. b4 Bb7 10. Rd1": "Castling has it saved the day for me, certainly helps my bishop big time.....:-).",
        "10... O-O-O 11. Bg5": "This move will cost white.....",
        "11... Bh6 12. Bxf6": "This move to attack my queen has left my bishop an open line right thru whites position. My bishop on h6 will know sit.",
        "12... Nxf6": "Nxf6 is the move could've missed this by taken with my queen would've not have benefited me.....:-).",
        "13. Qxd8+": "White Queen has no option but to capture the rook...",
        "13... Kxd8": "Know i'm back in the game.....:-). My opponent although lesser ranked has made a start that has cost him is queen, like i said before is it a good way to start a game of chess, against a higher ranked opponent, risky....",
        "14. f3 d5 15. e5 Nh5 16. Be2 Qxb4": "I choose to pin his knight, as an attack on the left can be followed by an attack on the right. Also how can he know protect his knight, only the rook to d3, leads to big problems for white, play an see if you want.....",
        "17. Rd3 Nf4 18. Kd2 Nxg2+ 19. Kd1 Ne3+ 20. Kd2 Nc4+ 21. Kd1 Qb2": "My Queen joins in the attack on the White King.... ",
        "22. Ke1 Qc1+ 23. Rd1 Qxc2 24. Nb1 Ne3 25. Nh3": "Mistake by white what about Kf2, know his rook is doomed an the Knight on b2.",
        "25... Nxd1 26. Bxd1 Qxb1 27. f4": ""
    },
    "url": "https://gameknot.com/annotation.pl/challenge-from-bluey123?gm=32637",
    "gameName": "Challenge from bluey123",
    "players": "bluey123 (1048) vs. bogota (1441)",
    "opening": "KP (C20), Patzer opening"
}