{
    "moves": {
        "1. e4": "A very common and logical first move. ",
        "1... d5": "The Center Counter Defense.",
        "2. exd5": "Taking the pawn is practically forced, because defending with 2.Nc3 gives me more central space by attacking the knight with 2...d4. And advancing the pawn with 2. e5 is also good for Black because I can play 2...c5 with a strong centre.",
        "2... Nf6": "Instead of taking back with the queen, I develop a piece and attack the pawn twice, reserving the option of taking the pawn with my queen or my knight.",
        "3. c4": "White doesn't give me that option, and instead decides to defend his attacked pawn, making it impossible for me to get my pawn back. Although this is what I wanted White to do when I played Nf6.",
        "3... c6": "I'm not worried about being down a pawn. This is a normal pawn sacrifice in this opening.",
        "4. dxc6": "His pawn is attacked three times and only defended once, so he must exchange it.",
        "4... Nxc6": "Although I am down a pawn, now I have two pieces developed, and my opponent has none. Also, my queen is powerful on the d-file, because it stops my opponent's d-pawn from advancing far. And my opponent's pawn on c4 is a weakness for him because it blocks part of his bishop's path, and the squares d4 and d3 are severely weakened because the c-pawn can no longer defend either of them.\r\nEven though I am down a pawn, I still believe that my positional superiority is more than enough compensation for it.",
        "5. h3": "A very bad move. This does nothing to control the center or aid in the development of pieces. All it does is take away the g4 square for my pieces, which isn't really important right now. Making wasted moves like this is exactly how my opponent lost this game. And the move h3 turns out to be a weakening move at the end of the game.",
        "5... e5": "I need to add to my lead in development as fast as possible. Otherwise, White might catch up in development and retain his extra pawn.",
        "6. a3": "What?? My opponent has wasted another move. Some players don't see the importance of developing your pieces and controlling the center. This move does nothing to control center, and my opponent has just made himself further behind in development.",
        "6... Bc5": "I have four active units attacking the center (especially d4) and getting prepared for attack, while my opponent has only moved pawns. My opponent's wasted moves and greediness for a pawn will soon lead to his loss.",
        "7. d3": "I am threatening to play 7.Ne4, with a double attack on the f2-pawn, which cannot be defended comfortably, so this move is pretty much forced. My move Bc5 gave me another developing tempo because White had to take time to counter my threat of Ne4.",
        "7... Bxf2+": "The best way of exploiting my lead in development. None of my opponent's pieces are developed, and I have so many active pieces and control of the center, which are much more important than losing a bishop.",
        "8. Kxf2 Ne4+": "My queen's domination of the d-file and the fact that White's undeveloped pieces block the rook from protecting his queen are what make my move possible.",
        "9. Kf3": "The king cannot go back to e1 because I will play Qh4 check, followed by mate on f2. White's h3 move turns out to be a weakness, because now the g3 square can no longer be defended by it.\r\nIf White played Ke2, then I can fork the king and rook with Ng3, and I'll be up the exchange. Again, White's h3 move turns out to be a weakness.\r\nAnd if White plays Ke3, then I can play Qd4, White would have to play Kf3, and then we'd have the exact same position here, except my queen would be powerfully placed in the center.\r\nSo Kf3 is White's only chance for survival.",
        "9... Qf6+": "You may think I'm crazy for sacrificing my e4 knight when I'm already down a bishop, but White's last moves are pretty much forced, and his two extra pieces haven't even moved yet.",
        "10. Kxe4 Qf2": "Here I am cutting off the king's escape square e3, and I am also threatening to play Bf5  with Qd4 mate to follow.",
        "11. Nf3": "This is White's only move that stops my checkmating threat, but he is only prolonging it. Whenever there's a centralized king on an open board, which is surrounded by enemy pieces, there is almost always a forced mate. ",
        "11... f5+": "I have taken away another square from White's king, drawing him further into my territory.",
        "12. Kd5 Ne7+": "I sacrificed my pawn on e5 because I didn't want White to play c5 and retreat his king to c4 where it would've been safe.",
        "13. Kxe5": "Kd6 was the only other move.",
        "13... O-O": "All I need now is another piece in play to finish off the exposed king. With my rook accessible to the open centre files, White will soon be mated.",
        "14. Qe2": "I don't think White saw my mating threat, but I don't think there was any way he could've defended against it.\r\n\r\nThe next few moves are forced.",
        "14... Ng6+": "Boom!",
        "15. Kd6": "Kd5 gets mated faster",
        "15... Rd8+": "Boom!!",
        "16. Kc7 Qb6#": "BOOM!!!!\r\n\r\n"
    },
    "url": "https://gameknot.com/annotation.pl/challenge-from-bakerbaker?gm=1559",
    "gameName": "Challenge from bakerbaker",
    "players": "miromcduck (1569) vs. bakerbaker (1574)",
    "opening": "Scandinavian gambit (B01)"
}