{
    "moves": {
        "1. d4": "I usually strive for a Stonewall, as it is the opening that I've studied the most.  ",
        "1... e6": "Black's play is ideal for the Stonewall set-up.  What I don't like to see is a play by the c8 Bishop to g4, which complicates matters.  Nor do I like to see g7-g6, which blunts the power of the Stonewall Attack.",
        "2. e3": "White's move makes the c1 Bishop a problem Bishop, but is part of the overall Stonewall strategy which is to build a pawn wall at c3, d4, e3 and f4.  ",
        "2... d5 3. Bd3": "White wants to get in c3, f4, Nf3 and 0-0.  Black's play makes White's task easy as he has yet to develop a piece.  Often, White wants to play Nb1-d2 to prevent a Knight coming in at e4 and to prepare for an eventual pawn push in the center.",
        "3... a6": "Black still hasn't developed a piece, and this move seems to waste time.",
        "4. f4": "White seizes firm control of e5, the hoped for home of the g1 Knight. ",
        "4... Nc6": "White doesn't want the Knight to come to b4",
        "5. c3": "The Stonewall Formation is complete.",
        "5... b5": "A waste of time.  And now the Knight is hanging.  ",
        "6. Nf3": "White's development is natural.  0-0 is next.",
        "6... Bd6": "The Bishop is \"biting on granite\" as the f4 pawn is well defended.",
        "7. O-O h6": "Black is dilly dallying.  He may be seeing ghosts or thinking of an ill-advised pawn push on the K-side.",
        "8. Nbd2": "I'm not sure what I was thinking at the time.  An alternative is Ne5, with an opening of the f-file in the offing.  The text may be better as it develops a piece, takes control of e4 (with e3-e4 contemplated), and would be available to defend the N on e5.",
        "8... Nge7 9. Ne5 Bxe5 10. fxe5": "All according to plan.  White has control of the b1-h7 diagonal, Black is still in the center, and Black's Bishop is \"entombed.\"",
        "10... O-O": "How can White intensify the attack?",
        "11. e4": "I'm not sure whether this move deserves a ! or a ?  It frees up the opponent's Bishop, but maybe I can get control of the a8-h1 diagonal, or get an attack going that is overwhelming. ",
        "11... dxe4": "This was probably a mistake.  Better would be to let White capture on d5 and recapture with the pawn to free the c1 Bishop.  White considers which piece is best for the recapture.",
        "12. Nxe4": "White has an overwhelming Kingside attack.  ",
        "12... Nf5": "The Knight threatens little or nothing, and abandons its brethren.",
        "13. Qg4": "Keeps the Black queen from imagining a post on h4, pins the g7 pawn.  ",
        "13... Kh8": "To break the pin.",
        "14. Qh5": "White crosses the \"frontier\" with his lady.  This pins the h6 pawn, and makes it easier to think about Rxf5.",
        "14... g6": "This move caught me a little by surprise as it weakens the K side, which is already under such attack.",
        "15. Qh3": "Maintaining the pin and threatening RxN",
        "15... h5": "This move was pretty much forced.  Maybe ...Qh4 was better to hope for an endgame only a pawn down (after the exchange of Qs, the h6 pawn would fall).",
        "16. Bg5": "Developing with a wallop.",
        "16... Qd5": "The hapless Q looks longingly at g2, but her army is left at home.",
        "17. Bf6+": "Now Black is in serious trouble.",
        "17... Kg8 18. g4": "The pawn is still pinned!  If Black takes it is mate on h8.",
        "18... Ng7": "Where else?  Black hopes for gh and Nxh5.  ",
        "19. Bxg7": "Removing a defender.",
        "19... Kxg7 20. gxh5 Rh8": "I'm not really playing all that well because I remember being caught off guard by this move.  ",
        "21. Qf3": "A very strong reply that forces Black's next few moves.",
        "21... Qd7 22. Qf6+ Kh7": "White's play has been easy and natural, and he still has the resources of all four minor pieces that can join in.",
        "23. hxg6+": "The N and B spring to life.",
        "23... fxg6 24. Ng5+": "At this point I made a \"conditional move\" that showed the two mate in ones.",
        "24... Kg8 25. Qf8#": "I must say, this was one of my most satisfying games.  Apologies to my opponent for making it public like this, but  few mis-steps in the opening led to a demonstration of the power of the Stonewall Attack."
    },
    "url": "https://gameknot.com/annotation.pl/challenge-from-halfairchild?gm=24675",
    "gameName": "Challenge from halfairchild",
    "players": "halfairchild (1621) vs. timothy0505 (1638)",
    "opening": "Queen's pawn (A40)"
}