{
    "moves": {
        "1. e4": "Apertura española (Ruy-López).",
        "1... c5": "Defensa siciliana.",
        "2. Nf3 Nc6 3. Bb5 e6 4. Bxc6": "Las blancas pretender debilitar la estructura de peones del adversario.",
        "4... bxc6 5. O-O": "Dada la apacibilidad del juego, las blancas enrocan.\n\n\n",
        "5... Nf6 6. Re1 Be7": "Las negras toman ventaja en desarrollo...",
        "7. e5": "...pero las blancas prosiguen en su objetivo de lograr ventaja en la estructura de peones...",
        "7... Nd5": "...a la vez que provocan pérdida de tiempos haciendo danzar al caballo de rey.",
        "8. c4 Nb6 9. d3 O-O": "Las negras siguen con ventaja en desarrollo de piezas menores y enrocan de forma ortodoxa en el 9º movimiento.",
        "10. Nc3 Bb7 11. Be3 d6 12. b3 Qd7 13. Bf4 Rfd8 14. Rc1 d5 15. Ng5 Qe8 16. Qf3 Rd7 17. Qh3 Bxg5 18. Bxg5 Nc8 19. f4 Ne7 20. Ne2": "Con este salto de caballo se inicia un plan de gran profundidad que las negras no llegan a entrever.",
        "20... Nf5 21. Ng3 Nd4 22. Nh5 Nf5 23. g4 Ne7": " ",
        "24. Nxg7": "! El caballo de reina blanco culmina su carrera entregándose al rey negro como ofrenda envenenada...",
        "24... Qf8": "... pero las negras se dejan amedrentar por la osadía del caballo blanco y no lo capturan, sospechando que a este movimiento subyace la urdimbre de una celada (a 24 ... K x N seguiría 25. Qf6+ ...). Un análisis minucioso muestra que el rey negro debería haber capturado al caballo, pues tendría escapatoria con ... Qd8, dejando libre la celda e8.",
        "25. Bh6 Qd8 26. f5 exf5 27. gxf5": "El rey negro no puedo intentar la huida atravesando f8 ya que con Ne6 el rey quedaría en jake del alfil y la dama negra capturada por el caballo.\nAsí, el rey negro ha quedado confinado a un reducido habitáculo, con sus vasallos atados de pies y manos, en posiciones muy restringidas provocadas por el dominio posicional de las blancas.",
        "27... Kh8 28. f6 Ng6": "Las blancas están en clara ventaja posicional, pero esta jugada requiere un profundo análisis ya que puede ser decisiva.",
        "29. Ne6 Qe8 30. Bg7+ Kg8 31. Ng5": "Y las negras abandonan ya que solo podrían demorar en un movimiento el mate (avanzando el peón g2), pues Qh7 es inevitable. "
    },
    "url": "https://gameknot.com/annotation.pl/challenge-from-spain?gm=56736",
    "gameName": "Challenge from Spain",
    "players": "auuuu (1438) vs. woods123 (1392)",
    "opening": "Sicilian (B30), Nimzovich-Rossolimo attack (without ...d6)"
}