{
    "moves": {
        "1. e4": "still hate openings... ",
        "1... e5": "i have to force me to do this.\n",
        "2. Nf3 Nf6": "the only one i know best",
        "3. Nc3": "three knights... hate that...",
        "3... Nc6": "for once i decided to play the four knights.",
        "4. Bc4 Bb4 5. Ng5": "well this is a very old trap...",
        "5... O-O 6. d3 h6 7. Nf3": "and back... you lost a move",
        "7... d5": "first good move",
        "8. exd5 Nxd5 9. Bxd5 Qxd5 10. O-O Bxc3 11. bxc3": "for now, i have a better pawn structure... that is all... maybe i should reconsider 4-knights for later games... :-) (just kidding, i know he made mistakes)",
        "11... Bg4": "i hoped to double another pawn",
        "12. c4 Qe6": "i have hesitated with Bxf3, but i finally lose...",
        "13. h3 Bh5 14. g4": "another hesitation... but nothing good against an opponent that can study the game",
        "14... Bg6 15. Bb2 f5": "of course",
        "16. Nh2 fxg4 17. hxg4": "the best move, i think All the others were a catastrophy",
        "17... Rf7 18. f3 Raf8 19. Kg2 h5 20. Qe2 hxg4": "not very good...",
        "21. fxg4 Qd6 22. Rxf7 Bxf7 23. Re1 Re8 24. Nf3 Nd4 25. Bxd4 exd4 26. Qf2 c5 27. Rxe8+ Bxe8 28. Qg3 Qxg3+": "i counted that my bishop was better than his knight: i can force him to stay by his c2 and a2 pawns and go to explore by myself... On the other side, he will try to force my king to stay on my side... And by succeeding this, it is a draw.",
        "29. Kxg3 Kf8": "avoiding a e5+",
        "30. Kf4 Ke7 31. Nd2": "intending to play Nb2 in case i attack on a4, which was my goal in case his horse went to close to my king",
        "31... Bc6 32. Nb3 b6": "i don't want his horse on this side of the board",
        "33. Nd2 Ke6": "let us go now",
        "34. Nb1 Kf6 35. Na3 a6": "still don't want him :-)",
        "36. Nb1 b5 37. cxb5 axb5": "have to be very careful to avoid the draw or the free a-pawn",
        "38. Nd2 g5+": "he has to withdraw.",
        "39. Kg3 Bd5": "pointing a2? no: c4!",
        "40. a3 Ke5": "but first I approach to protect d4... And here, in case of Nf3, i planned to take the horse, install the king on d5 and go on with c5. Unstoppable.",
        "41. Nb1 c4 42. Nd2": "this is the defense i did not expect, but it didn't change my plan.",
        "42... c3": "Yes! i guess he did not expect this one!",
        "43. Nf3+ Bxf3 44. Kxf3 Kd5 45. Ke2 Kc5": "i expected the meeting on a3 by \n46 Kd1 Kb6 (not b4 that leads to a draw) 47. Kc1 Ka5 48. Kb1 Ka4 and force him to zugzwang after 49 Ka2 b4 50. axb Kxb4 and I go back to his g-pawn...",
        "46. Kf3": "but he eased my mind",
        "46... b4 47. axb4+ Kxb4 48. Ke4 Ka3 49. Kxd4 Kb2": "i am first...",
        "50. Ke5 Kxc2 51. Kf5 Kxd3 52. Kxg5 c2 53. Kf6 c1=Q 54. g5 Qc8 55. Kg7 Ke4 56. g6 Kf5 57. Kh7 Kf6 58. g7": "next is my Q on 7th line... it is over..."
    },
    "url": "https://gameknot.com/annotation.pl/challenge-from-thitho?gm=31713",
    "gameName": "Challenge from thitho",
    "players": "alira22 (1637) vs. thitho (1722)",
    "opening": "Petrov three knights game (C42)"
}