{
    "moves": {
        "1. d4 d5 2. c4 c6": "This opening is a QGD Slav Defense.",
        "3. cxd5": "I exchange pawns to open lines with the idea of playing my queen rook to c1 later on - Joanne",
        "3... cxd5 4. Nc3": "Develops a piece and puts pressure on the d pawn.  Joanne",
        "4... Nc6": "Bolle brings out a knight with the same idea so I defend with Nf3 developing another piece - Joanne",
        "5. Nf3 g6 6. e3": "Bolle intends to pile up on my d pawn by playing 6. Bg7 so I decide to protect it with a pawn, opening up a diagonal for my king bishop.  Joanne",
        "6... Bg7 7. Be2": "I develop my bishop to e2 so that if an enemy bishop comes down to g4 the knight can move if it wants to.  Joanne",
        "7... Nf6 8. O-O O-O 9. Bd2": "Over the last 2 moves we have both got on with the job of bringing our pieces out and safeguarding our kings.  Joanne",
        "9... Re8 10. Re1": "Opposing rooks on e-file.",
        "10... e5 11. dxe5 Nxe5 12. Nxe5 Rxe5": "12. ........ Rxe5 (over the last 3 moves there has been a plethora of exchanges).  Now follows a knight manoeuvre.  Joanne",
        "13. Nb5 Ne4 14. Nd4 Bd7 15. Rc1": "15. Rc1 - after bolle gets out all his pieces I bag the open c file first.  Joanne",
        "15... Qb6": "15. ........ Qb6 - attacks my b pawn so I decide to advance it.  Joanne",
        "16. b3 Ree8 17. Bc3": "17. Bc3 - I put a triple guard on the d4 knight - a good outpost for this piece I think.   He takes my bishop with his knight (one pesky piece I think) and I have to recapture with my rook  - Joanne.  ",
        "17... Nxc3 18. Rxc3 Qa5": "18. ........ Qa5 (nasty, nasty - doubly attacks rook and a pawn so I back my rook off to c2 and black exchanges his g7 bishop for my d4 knight.  Joanne",
        "19. Rc2 Bxd4 20. exd4": "After 20. exd4 there follows an exchange of rooks on the c file and unfortunately this results in my opponent grabbing it! - Joanne",
        "20... Rac8 21. Rxc8 Rxc8 22. Bf3": "22. Bf3 - I open up the e file and if black's queen takes my a pawn then I will swipe his d pawn. - Joanne",
        "22... Be6 23. Re2": "23. Re2.  Looking to challenge the c file and at the same time defend my a pawn. - Joanne",
        "23... Rc3 24. Qf1": "24. Qf1.  Oh, Oh, I now see that the black queen could deliver mate on e1 if I follow through with my earlier plan so my queen snuggles up to her other half (ah!) but this allows the Wicked Witch of the West (black's queen) to double up on the c file - to think I was once the proud owner of it!! - Joanne",
        "24... Qc7 25. Re3": "25. Re3?  I think I should have moved up the h pawn here but the thought of challenging his rook and trying to get rid of it is just too tempting! - Joanne",
        "25... Rc2 26. Re2 Qc3 27. Rxc2 Qxc2": "28. ........ Q x c2 - I finally exchange rooks but this does not relieve the pressure.  Here again I should have made luft with my h pawn and if black swipes my a pawn then I could have countered with Qb5! attacking his b pawn and protecting my own. - Joanne",
        "28. Qa1": "28. Qa1 - this is tragi-comical I think - my Queen does a \"Little Jack Horner\" and she stays passive for the next 10 moves when she delivers a spite check just one move before my resignation.",
        "28... h5": "28. .... h5 - black now starts a pawn roll on the kingside.",
        "29. g3": "Ionadowman gives his thoughts on this move - I reckon 29.h3 is much better than 29.g3, though. I can see your reasoning, and in general one does try to place the pawns on squares opposite to those your bishop (or the enemy bishop) can visit. However, with the pawn on g3, one thing you would have to watch for is the enemy Q getting to your back rank (whilst your own is off counterattacking, say), checking your king. Your bishop interposes at f1, whereat the enemy bishop settles on h3 with mate to follow. The second consideration is safe squares for the bishop - squares protected by a pawn. Often bishops need such an anchor near the middle of the board in order to operate effectively. Finally, the h3 pawn will give some protection should Black try to dislodge the bishop by advancing his K-side pawns. For that, he would have to advance his king. Yes, 29.g3 did good things for the bishop's mobility (though that proved to be a double-edged sword in the game!), but even after 29.h3 the mobility of your bishop would have been superior to that of your opponent's. After 29.h3, I'd be tempted to have just played Kg1-h2-g1-h2, and waiting for him to disclose his plan (seizing any oppotunity to capitalise if Black does something silly, of course). At some point, though, White might have to be prepared to abandon the Q-side pawns in the interests of counterattack. This would have to be very carefully timed - almost certainly not before Black places his king on a dark square like g7 or h6. Passive defence alone is rarely sufficient for successful defence. ",
        "29... a5": "29. ....... a5 - and now a similar roll on the queenside.",
        "30. Bg2 b5 31. Bf1 b4 32. Bg2 Qc3": "32. ........ Qc3.  Ouch - if I exchange queens here then nothing in the world is going to stop him from crowning his pawn.  In the next few moves I will be saying goodbye to my d pawn.",
        "33. Qd1 Bg4 34. f3 Bf5 35. Bf1 Bc2 36. Qe2 Qxd4+": "36. ......... Q x d4  Bye bye d pawn!",
        "37. Kh1 Bd1 38. Qe8+ Kg7": "38. ..... Kg7 (unfortunately I have no follow up checks)",
        "39. Bg2 Bxb3": "39. ....... B x b3 - here I throw in the sponge because I am just two clear pawns down which are quite close to queening at that.  If I take the bishop then Qe1  followed by Qxf1#.\r\n\r\nSo my dear readers, I have certainly learned how not to play an Queen and Pawn ending and if I get in one next time at least I will know what to do.  Safeguard king first with appropriate luft then counterattack by keeping my queen active even if it means dropping a pawn or two - that way at least I might get the pawn/s back!"
    },
    "url": "https://gameknot.com/annotation.pl/challenge-from-jstevens1-how-not-to-play-q-p-endings?gm=10391",
    "gameName": "Challenge from jstevens1 - How not to play Q + P endings",
    "players": "jstevens1 (1564) vs. bolle1 (2063)",
    "opening": "QGD Slav defence (D10), exchange variation"
}