{
    "moves": {
        "1. e4 c5": "I wanted to try a different opening this time.  e5 is a pretty \"classical\" response and it leads to a more normal type of chess game.  c5 is called the Sicilian defense and it leads to a different type of game.\n\nWhat happened in our game is pretty typical, I traded my c-pawn for your d-pawn which is generally good for me because I potentially have more center control.  On the other hand, you got a pretty big lead in development and had more space to work with.  In general, the Sicilian is a \"dynamic\" opening, which means that there are lots of imbalances in the position and different advantages for both sides.  It's also pretty double-edged and often leads to complicated positions (like in this game).",
        "2. Nf3 d6 3. d4 cxd4 4. Qxd4": "Usually white plays Nxd4, but this move is a fine way to play as well.  I would love to play Nc6, chasing your queen away, but then you could pin the N with Bb5.  Nc6 is a still a good move, but I chose to prepare it a bit with a6.",
        "4... a6 5. b3": "This is a pretty unusual move and I have a feeling it's a slight mistake.  Because you have more pieces out you should be trying to create some initiative and attacking chances.  I think it's better to try to keep getting pieces out and castling as fast as possible, then trying to launch an attack.",
        "5... Nc6 6. Qe3 Qa5+": "Like I said in the game, this is a fairly provocative move.  Basically I'm giving you a free move, but I think that free move is actually not useful for you.  For example after Bd2, it seems like the b3 move is a bit of a waste.\n\nI'm not actually sure that it was the best idea though, maybe simply Nf6 or e6 would have been best.",
        "7. Bd2 Qc7": "At this point I was feeling like I had good long-term potential, but at this point I was pretty far behind in development.  I think you should have really pressed for an attack, maybe putting the bishop on a more aggressive square like c4 or maybe playing Bc3 and aiming to open the position up with e5 eventually. ",
        "8. Bd3 Nf6 9. O-O e6 10. Nc3": "I think c4 was another option as well.  Right now white has a lot more space, meaning that you control more of the board and have more squares to use for your pieces.  Black's main options to free up his position are d5 or b5.  c4 stops both of them and generally clamps down on the position.\n\nc4 would have been aiming for a slower game.  If you wanted got get some things happening now, Bc3 and e5 seemed like a good option.\n\nI was pretty happy with Nc3, it seemed like you were just getting your pieces out without a larger plan.  This is a pretty common mistake. ",
        "10... Be7 11. h3 O-O": "At this point, I felt like my opening problems were over and I was about to start getting the initiative.  You are basically finished with your development, but it's not clear what active plans you have.",
        "12. a4": "This move is pretty interesting, it makes sense to prevent me from playing b5.  On the other hand, it leaves a juicy square on b4 for my N.",
        "12... Nb4": "Here I was a little worried about the fact that it was unprotected, and your B on d2 could potentially attack it, but I didn't see a good way for you to take advantage of it.  Did you analyze Nb5 and Nd5?  I don't think there work out in this particular position, but they certainly are moves that you want to check out.",
        "13. Ne2": "I really wanted to play Nxc2 here, but it just doesn't work out.  For a long time I thought about Rac1, Nxe3, Rxc7, then I have a lot of good moves, including the simple Nxf1.  I was close to playing it, then I realized that if you played the less obvious Rfc1 I wouldn't have that option at the end and, in fact, my N would be trapped on e3.",
        "13... d5": "This is a pretty good move too though.  Black is starting to get some more space and using his 2 center pawn to get more control of the center.",
        "14. e5": "Definitely the right choice.  This pawn might become weak, but at this point it is controlling some good squares and keeping my game slightly cramped.",
        "14... Nd7 15. Nfd4": "Definitely a mistake because you needed the N to protect the e-pawn.  Maybe Ned4 would be a move.  You could follow it up with Rfe1, which would have given the e-pawn some solid protection (prophylaxis).  Bc3 is also an idea to shore up the e5 pawn.\n\nAfter giving the e5 pawn some more protection, I think you should have tried to launch a kingside attack.  One difficult part of my position is that many of my pieces are on the queen side, and because you have more space, it's hard for me to transfer them to the kingside.  This gives you good chances to go on the offensive there.  I didn't see a good plan for you to get something going there though, maybe moving the N off of f3 then playing f4-f5.",
        "15... Qxe5 16. Qxe5 Nxe5 17. Bxb4 Bxb4 18. a5 Nxd3 19. cxd3": "It might not look like black has a big advantage here, but I think that it's actually quite large.  Black is up a pawn and has some nice center control.  Right now white's 2 Ns are more active than Blacks 2 Bs, but the structure of this position is very nice for Bs because it's pretty open.  In a couple moves the Bs should be very strong.  Because of that I decided to play e5, which is a bit aggressive.  It gains some space and opens up by B on c8, but on the other hand it makes my center pawns a bit loose.\n\nI think it was a good decision, but I could have also played things a bit slower with Bd7, then putting to get a R on the c-file.",
        "19... e5 20. Nc2 Bd6 21. f4": "Nice move.  If I get a couple moves to consolidate, then I would be in a great position.  It's important to keep black occupied, which I think you understood.",
        "21... f6 22. f5 Bd7 23. Ne3 Bc6 24. d4 Bb4": "You've played well, but like I said on move 19 I think black had a basically winning advantage.  Now it seems like black has the center under control and is ready to start pressing his advantage.  The next couple moves are pretty big tactical mistakes, but I couldn't see a good way for you to press on.\n\nNote how the 2 bishops are starting to look better to than the Ns.  Especially the b4 one.  It keeps your Rook on a1 tied to the a-pawn and stops you from putting a R on c1.  After a few more moves I think they would have been even better.",
        "25. Rfc1 Bd2 26. Rxc6 Bxe3+": "This really seals the deal, but I felt like it was over a while ago.\n\nThis game was a much more complicated than the last one.  I think the main lesson is that asymmetrical pawn structures often result in a lot of imbalances in the position and it's really important to be aware of them.  I think the difficulties you felt as we approached the middlegame were caused by inaccurate moves in the opening.\n\nIn this game, the main thing you had going for you was a lead in development.  When you have that, it's critical to understand that it won't last forever, because eventually the other person will catch up.  Therefore you need a plan to convert that development into something else, often an attack on the king.  If you didn't want to play for an attack, I would recommend playing for c4 and trying to create a long-term space advantage by keeping my position cramped.\n\nOn the plus side, I think you did well trying to create counter-chances once I started to get an advantage.  It might have seemed like your f4 and d4 moves didn't get you much, but I think if you didn't play them then I would have taken over the game without any problems.\n\nGood game, looking forward to our next one.",
        "27. Kh1 bxc6": ""
    },
    "url": "https://gameknot.com/annotation.pl/challenge-from-bobggood?gm=25514",
    "gameName": "Challenge from bobggood",
    "players": "bobggood (1312) vs. ishiputnam (1200)",
    "opening": "Sicilian, Chekhover variation (B53)"
}