{
    "moves": {
        "1. e4": "This game was a random challenge from a significantly higher ranked player. Coming at what I hoped would be the end of my 130+ point slide down the ratings it has helped to boost my confidence. Duke1968 kindly agreed to annotate the game",
        "1... d5": "Playing as black against a significantly higher ranked player the odds are already stacked up against me. I decided that sitting back and defending would mean I would just lose faster.",
        "2. exd5": "In this game I suspected that the pawn would be too good to refuse. My challenge therefore was to make as much of the position as I could and draw comfort from that, after all for me, anything less than complete obliteration would be nearly as good as a win",
        "2... Nf6 3. Bb5+ Bd7": "This seemed the obvious option to me as it developed my bishop. Using either knight would simply block up my lsb",
        "4. Bc4": "This seems a good option for white, bXd7 for example allows something like Nbd7 which develops the knight with tempo",
        "4... c6 5. dxc6": "This move suprised me a little I would have expected something like Nf3 which would give white good control over the centre as well as preparing for castling",
        "5... Nxc6": "Develops the knight with tempo. It was here I realised that I perhaps had a very slight edge in development and should try to take advantage of that if I could",
        "6. d4 e5": "White seemed unlikely to take the pawn as dxe5, Nxe5 and white is forced to move his lsb again",
        "7. Ne2": "This is the first move that takes us out of the gameknot database. At this point I think black has a slight edge in development, though white is ready now to castle. I wanted to try to pressure white and was looking at b5 but first I needed to get my knight out of the way",
        "7... Nxd4": "I suspect this move is considered out of order as exd4 might be more normal. I'm not entirely sure why that is though I suspect I may find out why very soon.\n\nMy thinking was that despite being a pawn down any exchange of pieces would not be all bad. ",
        "8. Nxd4": "As far as I can see this is whites only practical option. As otherwise b5 will cause problems for white.",
        "8... exd4 9. Qxd4": "The thought of that queen lining up on the d file with a white rook scared me. It was about this time I decided to try to exchange queens",
        "9... b5": "But first lets try to shift that pesky bishop",
        "10. Qe5+": "This move again suprised me as it seemed white was happy to exchange queens",
        "10... Qe7 11. Qxe7+ Bxe7": "Now the differences in development looked significant to me but how can I take advantage of it? I have the initiative as white must move his lsb",
        "12. Bb3 a5": "Maintains the pressure on the white lsb with the threat of a4. I was expecting a3 in response. Later on the game the forward position of this pawn proved important",
        "13. a4": "Again this move suprised me and it took me some time to decide what to do.",
        "13... b4": "I wanted to restrict whites ability to develop as much as I could and possibly even stop him from being able to castle though I knew it was unlikely i would achieve that. I considered Bb4 though in the end I wasnt' comfortable with that. b4 had a similar effect in that white couldn't develop the knight to c3 and it would take a while to get his rook active",
        "14. O-O O-O": "I decided to go for the safe option here, the biggest problem with the move being that my f pawn is pinned. It's going to be hard to move the white lsb so I may need to move my king at some point",
        "15. Bf4 Bc5": "Pins the f pawn. Looking at it now I think perhaps Ne4 would be stronger",
        "16. Nd2": "White completes his development and I must say that at this point I think any advantage I may have had was gone",
        "16... Rfe8": "Laying claim to the e file and some of the centre",
        "17. Rfe1": "There is no point at the moment in white taking my rook and I am certainly not going to take his as the exchange would mean that his a rook became active",
        "17... Rac8": "Looking at the position now I think this was not the best move. I should have been pressuring whites b pawn with Bd4. At the time I was looking at trying to regain my lost pawn by exchanging lsb's and grabbing the white c pawn. Though I am sure white would not have allowed that",
        "18. Nf3": "Prevents Bd3, also threatens Ng5 or Ne5 pressuring the f pawn",
        "18... Ne4": "Threatens to regain my pawn. I figured that white wouldn't defend the f pawn with his rook",
        "19. Be3": "Pretty much white's only option",
        "19... Bxe3": "I slightly reluctantly decided to exchange as I figured that white would retake with his rook, thereby unlinking his rooks, though opening the possibility of doubling them on e. On my next move I was considering Be6 in an attempt to exchange lsb's and regain my pawn",
        "20. Rxe3": "fxe3 is pointless as it only isolates a white pawn",
        "20... Bc6": "A slight change of plan as white can apply a lot of pressure to my knight, ideally I think I would have preferred f6 here to try to keep his knight where it is, though I also wonder if I should have been doubling my rooks too or opening a small escape hole for my king. If needed my knight can go back to f6 or d6.",
        "21. Rd1": "I don't understand this move at all, and frankly that worries me. I was expecting Rde1 which to me looks stronger, though my rook on e8 is quite well defended at the moment. Perhaps he is planning to double his rooks on d, or more likely he just wanted to grab the open d file and make a stronger claim on the centre",
        "21... Nc5": "I continue with my plan to attack his bishop, also opening the possibility of Rxe3, fxe3 which I am certain he won't allow as it will give him an isolated pawn. As his pawn looks very strong to me I think he will do something to defend it but I can't see anything obvious",
        "22. Ne5": "I managed to completely overlook this as I was concentrating too much on his lsb. This looks a clever move to me. As I see it that lsb is now poisoned, with something like ... Nxb3, Nxc6 (threatening a fork on e7), both black rooks then have to stay on the 8th rank or I am in very deep trouble.\n\nHaving looked at it further I am tempted to exchange bishops as Kf1 prevents the fork.\n",
        "22... Nxb3": "here goes",
        "23. Nxc6": "As well as the fork on e7 the white knight is also looking at a5 which would gain a passed pawnl",
        "23... Kf8": "preventing the fork as planned",
        "24. Rxe8+ Kxe8": "Pretty much forced, the alternative Rxe8 loses material (and essentially the game) to cxb3. Note also that I am currently happy to leave my knight where it is as long as the white knight is under direct attack as cxb3 doubles whites pawns and they then cannot progress until he shifts my a pawn.\r\n\r\nNote also that my king has very little scope for movement despite its apparently open position, I need to start moving some pawns soon",
        "25. Re1+ Kf8": "Kd7 loses my knight e.g. Kd7, Ne5+, I am forced to move my king and then white can pick up my knight.",
        "26. Nxb4": "Now I think I am in more trouble than I have been for all of the rest of the game. There was a small chance I could regain my gambited pawn but there is no way I will regain 2. \r\n\r\nExchanging knights now gives white a passed pawn that he can defend with his rook so I am wondering if I should try to exchange rooks and ideally knights quite soon",
        "26... Nd4": "After a lot of thought I decided that for the moment I wanted to keep my a pawn where it was, with this move he is pretty much forced to defend his pawn with c3 and that will give me a couple of options",
        "27. c3": "Now for me it's starting to get really interesting to see how white will win. I think my best options are either Nb3 which effectively splits whites pawns and means he will have to work to advance them, or alternatively there is something like axb4, after that I feel the most likely move from white would be cxd4 which gives him an isolated pawn that is hopefully too near my king to be able to queen on d and a pawn on a that is passed but tricky to defend all the way to queening",
        "27... Nb3": "I decide to go for blocking tactics, the knight is tough to extricate from here. Though I do wonder if something like axb4, cxd4, Rc4 would have been better",
        "28. Nd3": "This move worried me as I couldn't see the real point of it yet though it does prevent my Nc5, whatever it is white is going to have to make one or two moves yet so I can try to take the advantage",
        "28... Rc4": "Threatens to regain one of my lost pawns, the a pawn is difficult to defend so white will have to come up with something else, the question is what.",
        "29. Ne5": "A nice move, if I take the a pawn as planned then its mate in 2 for white with ... Nd7+, Kg8,Re8#. Fortunately for me the a pawn is going nowhere yet so I have some other options",
        "29... Rc7": "The only way I can see to prevent the knight move",
        "30. Rd1": "I'm not sure what he is planning here, all I can see is Rd7 to try to force the exchange",
        "30... f6": "This is meant to push that knight out of the centre, most likely to g4 or f3 and also give my king an extra escape square",
        "31. Rd7": "Looking to exchange rooks. ",
        "31... Rc8": "If I exchange rooks I think I won't last much longer. \r\n\r\nWith my rook on c8 the knight is still restricted from attacking my a pawn. The white rook can only attack my a pawn and my knight at the same time from b5 so I may need to try to cover that, probably with Rb8",
        "32. Nd3": "Prevents my knight from attacking his a pawn",
        "32... Rc4": "Still trying to grab his a pawn, he can't really defend it now as far as I can see. Nabbing this would be a big boost to my confidence and perhaps more importantly would allow the threat of Ra1 so he may give up on this pawn and do something else, I am thinking perhaps he will move one of the pawns in front of his king",
        "33. Rb7": "This move really surprised me and at first sight I thought it was a mistake though I can't yet see why it might not be. I still have Rxa4 and the threat of Ra1+ leading to mate and that is why he cannot take my knight.",
        "33... Rxa4": "For me the regaining of a pawn is very significant. although I still have no doubt I won't win, I am starting to dare to wonder if there could be a draw here",
        "34. h3 Ra1+": "gains me a tempo and allows me to defend my knight",
        "35. Kh2 a4": "I seem to have suddenly gained a little initiative and I think I might now be able to regain my gambitted pawn, if I can get my rook to d2 white may still have a fight on his hands to win",
        "36. Kg3": "Bringing the king into the attack while my rook is tucked away in a corner?",
        "36... Rd1": "I can only see three options here for white, Nb4 which doesn't really achieve much. Rd7 which just pins his knight and allows me Nc5, so I think he is almost forced to play Nf4",
        "37. Nf4": "Looking at Ne6 which will gain white the g pawn",
        "37... Nc5": "Prevents Ne6 and forces the rook to move, Ra7 loses to Rb1 so I am unsure what he will do.",
        "38. Rb8+": "My options are limited to 2 neither of which greatly appeal. what I am considering now for the longer term is a rook exchange then taking his c pawn with my knight. Ne4 is seriously tempting me. ",
        "38... Kf7 39. f3": "Allows white to move his knight without the threat of check from my rook, also prevents Ne4",
        "39... Rd2 40. h4": "I suspect this is a waiting move",
        "40... Nd7 41. Rb7 g5": "Looking to shift the knight and to try to restrict whites king a little",
        "42. hxg5 fxg5 43. Ne2": "Tempting an exchange. I'm still not sure if it would have been better to accept it",
        "43... Kg6 44. Nd4 Nc5": "Defends my pawn",
        "45. Rb6+ Kf7": "The only place where I can't be checked next move by the knight",
        "46. Nf5": "Restricts my kings movement. I can't see white's plan now which worries me. I was looking at Nb4 so I could take the pawn, it was then that I realised that I have (what I think is) a vastly better move with Nd4, not only threatening to finally regain my gambitted pawn (on b2) and increase my chances of a promotion. Perhaps more importantly it threatens Nf4 which is dangerous for white as that threatens Rxf2# which at the moment he can easily prevent with Ne3. Unfortunately I am sure he has seen this so I will be very content with regaining my gambitted pawn. Even if I get no closer to mating my opponent I will be very happy",
        "46... Nd3": "This as it turns out is a fatal mistake, I was too distracted by my efforts to regain a pawn to see any of what is to come",
        "47. Rd6": "Pins my knight to my rook, I did consider Rxb2!, Rxd3, a3 but white can hold my pawn back with c4 which allows his rook to return to the a file. ",
        "47... h5": "Looking to restrict the white kings mobility, though with hindsight this only delays the inevitable",
        "48. Rd4": "Defending the rook and threatening my pawn",
        "48... h4+": "I doubt white will make a mistake however I figure that this will at least apply some pressure. \n",
        "49. Kh2": "Pretty much forced as all the other options lose material",
        "49... Rd1": "I had this in mind as my only way to save my knight and rook, I now have the option of Nxb2, or even better Nf2, threatening Rh1#. It's nice to have dreams like that",
        "50. Ne3": "In my excitement I missed this and it looks as though I am in deep trouble now ",
        "50... Rd2": "Pretty much forced",
        "51. Nc4 Rd1": "Rd1 pretty much seals my fate as we will see. Is Rxb2 slightly preferable here?",
        "52. Ne5+": "Ouch, now I'm in deep trouble.",
        "52... Nxe5": "I'm not sure this is the best option though I am now expecting a pawn exchange soon",
        "53. Rxd1 Nc4 54. Rb1 Ke6": "Looking to bring my king over to help",
        "55. Kh3 Ne5": "Preventing Kg4 though I think this was a miscalculation on my part as it tempts Ra1",
        "56. Ra1 Nd3": "Looking at Rxa4,Nxb2 harassing the white rook",
        "57. Rxa4 Nxb2 58. Ra5": "My pawns are impossible to defend now",
        "58... Nd1": "This is the only way I can get any compensation for losing another pawn",
        "59. Rxg5": "I'd like to thank Duke1968 for the game I learned a lot from it. I think I was doing ok up to about move 46. It all went downhill from then.\n\nI welcome any comments"
    },
    "url": "https://gameknot.com/annotation.pl/challenge-from-duke1968?gm=28019",
    "gameName": "Challenge from duke1968",
    "players": "duke1968 (2091) vs. elwoos (1470)",
    "opening": "Scandinavian defence (B01)"
}