{
    "moves": {
        "1. e4 c5 2. Bc4": "Un coup inhabituel, mais probablement jouable.",
        "2... e6 3. Nf3 g6 4. d4 b6 5. Bg5": "Les blancs développent leurs pièces pendant que les noirs n'ont joué que des pions. Je me suis demandé dans cette position si les blancs n'auraient pas fait mieux de continuer leur développement différemment, vu que les cases noires des noirs sont un peu faibles. Ce coup permet aux noirs soit d'échanger les fous sur cases noires, soit de forcer les blancs à retraiter le fou. Il est souvent plus profitable de laisser en suspens une faiblesse adversaire (ici les cases noires) pour l'exploiter plus tard, que de tenter de l'exploiter tout de suite lorsqu'on n'en retire pas d'avantage immédiat. À part cette subtilité, le coup blanc est correct.",
        "5... Be7 6. Bxe7 Nxe7 7. Nc3 d5 8. exd5 exd5 9. Bb5+ Bd7 10. dxc5 Bxb5 11. Nxb5 bxc5 12. O-O O-O": "Les blancs conservent un léger avantage. Pourquoi? Ils ont une pièce de plus de développée, les pions noirs au centre pourraient constituer une cible, le pion g des noirs est avancé (mais les fous sur cases noires sont partis, donc c'est moins grave), les pions blancs sont plus compacts. Tous de légers avantages, mais qui démontrent que les blancs ont bien réussi leur ouverture.",
        "13. Qd2": "Rien à redire sur les derniers coups. Les blancs continuent d'avoir un léger avantage.",
        "13... a6 14. Nc3 Nbc6": "Une petite réflexion-question ici. Pourquoi ce coup serait-il meilleur que e4 par exemple? Parce que ce coup développe une pièce, qui protège l'autre cavalier en plus, permet de libérer la tour. e4 sera toujours possible si les blancs jouent leur tour en d1, bien que les blancs pourront placer leur cavalier en e5 où il est plus menaçant.",
        "15. a3": "Meilleur était R(a1)d1. Ceci force l'avance du pion noir. Bien que ce ne soit pas nécessairement mauvais pour les noirs, les deux pions noirs du centre peuvent constituer une cible plus tard (avec le danger de se retrouver avec un pion isolé). Le pion b2 devient maintenant une cible pour les noirs.",
        "15... Rb8": "Attaque le pion maintenant faible en b2.",
        "16. Rab1 Re8 17. Ng5": "Est-ce que cette manoeuvre va profiter aux blancs ou est-ce une perte de temps? Les blancs pensent-ils à suivre avec Qf4?\r\n",
        "17... h6": "Avec ce coup, les noirs font perdre du temps aux blancs puisque le cavalier doit reculer. Mais les noirs vont aussi perdre du temps puisque le roi devra venir protéger le pion h6. La question est de savoir si la structure des pions devant le roi noir sera meilleure pour autant. Je crois que oui, parce que la faiblesse sur les cases noires devant le roi n'existe plus, et le roi noir a plus d'espace pour manoeuvrer. D'un autre côté. il faut faire attention de ne pas trop avancer le roi et ses pions en avant, parce le roi peut devenir plus facile à attaquer, notamment par les pions en avant du roi blanc. Donc, je crois que la manoeuvre du cavalier commencée au 17ème coup par les blancs est erronée.",
        "18. Nf3 Kg7 19. Rfe1": "Correct! Mais valait-il mieux mettre cette tour en d1 et forcer le pion d5 à avancer ? ... La réponse suit...",
        "19... d4": "Les noirs décident de pousser ce pion malgré tout. Il faudra l'avancer tôt ou tard, alors pourquoi pas maintenant? Donc, la tour blanche est maintenant mieux placée en e1 qu'en d1.",
        "20. Ne4 Qd5 21. Qf4 Nf5 22. g4 g5": "Une erreur significative. Je me suis dit : le pion ne peut pas prendre le cavalier, et la dame doit reculer.",
        "23. Qxf5": "Mais nulle part je n'ai réalisé que la dame pouvait simplement prendre le cavalier. ",
        "23... Qxf5 24. gxf5 Rb5": "Je ne peux pas me permettre de perdre ce pion en plus.",
        "25. Ned2 Reb8 26. Nb3": "Permet le coup suivant des noirs. a4 était probablement mieux.",
        "26... d3 27. a4": "Bon, mais pas aussi efficace maintenant.",
        "27... dxc2 28. axb5 cxb1=Q 29. Rxb1 Rxb5": "Les noirs ont pris un pion, et ont encore des chances de s'en tirer.",
        "30. Nbd2 Ne7": "Un deuxième pion en vue.",
        "31. f6+ Kxf6 32. Ne4+ Kg7 33. Nd6": "La stratégie des blancs ici doit être de libérer leur tour de la protection du pion b. Il faut que cette tour devienne beaucoup plus active si les blancs doivent espérer l'emporter. C'est donc un cavalier qui devra prendre la relève.",
        "33... Rb3 34. Ne5": "Excellent!",
        "34... f5 35. Ndc4 Ng6": "Les noirs tentent de briser cet étau des deux cavaliers blancs au centre (le centre est évidemment la position idéale pour des cavaliers de toute façon).",
        "36. Na5": "Aurait-il été mieux d'échanger une paire de cavaliers? Je le crois.",
        "36... Rb5 37. Nec4": "La différence est que les deux cavaliers blancs ne sont plus aussi bien centrés.",
        "37... Ne5": "... et les noirs peuvent encore menacer l'échange.",
        "38. Ra1 Nxc4 39. Nxc4 Rb4 40. b3 Rxb3 41. Rxa6 Rb4 42. Nd6 Kf6": "Décision courageuse de se mettre en position d'échec à la découverte, mais les noirs se disent qu'il y a plusieurs mauvaises façons pour le blancs de faire cet échec.",
        "43. Nc4+": "Je crois que Ne4 échec était meilleur pour capturer tout de suite le pion c5. J'aurais probablement joué Ke5 et après la capture du pion, mon roi serait au moins au centre.",
        "43... Kg7": "Le roi noir est relégué au fond, mais le pion c est toujours vivant. Il y a toujours de l'espoir pour les noirs.",
        "44. Ne3 f4 45. Nf5+ Kf8 46. Rf6+ Ke8 47. Rxh6 f3": "Tout à coup les blancs ne verraient pas le mat sur la première rangée!",
        "48. h3": "Fallait pas rêver en couleurs!",
        "48... c4 49. Re6+ Kd7 50. Re4 Kc6": "Le seul espoir des blancs est le pion c. Le roi doit s'approcher pour l'aider à passer à dame.",
        "51. Ne3": "Suit une série de manoeuvres pour contrer l'avance du pion. Le choix des coups peut être discutable, mais les blancs réussiront à empêcher le pion noir de trop s'approcher de son but.",
        "51... Kc5 52. Nc2 Kd5 53. Rg4 Rb1+ 54. Kh2 c3 55. Kg3 Rb2 56. Ne3+ Ke6 57. Rxg5": "Les blancs ont maintenant une victoire facile. Je continue juste pour voir comment les blancs vont conclure l'exécution.",
        "57... Rb1 58. Kxf3 Rb3 59. Rc5 Kd6 60. Rc4 Ke6 61. Ke4 Ra3 62. f4 Rb3 63. f5+ Kd6 64. h4 Ke7 65. Nd5+ Kf7 66. Rc7+ Kf8 67. Ke5 c2 68. Kf6 Ke8 69. Ke6 Kd8 70. Rxc2 Rh3 71. f6 Rxh4 72. Nb6": "Une conclusion pleine d'élégance.",
        "72... Re4+ 73. Kf7 Rc4": "Et si les blancs jouaient trop vite...et prendraient avec la tour ???",
        "74. Nxc4": "Fallait pas croire aux miracles. C'est le temps pour les noirs d'abandonner. Une seule erreur des noirs a suffi. Les blancs ont été impitoyables. Rien de spectaculaire, mais des coups efficaces jusqu\"à la fin. Bravo!"
    },
    "url": "https://gameknot.com/annotation.pl/challenge-from-gt-90?gm=2146",
    "gameName": "Challenge from gt-90",
    "players": "gt-90 (1492) vs. guy04 (1776)",
    "opening": "Sicilian defence (B20)"
}