{
    "moves": {
        "1. Nf3": "So 1.Nf3. the reti. as i said previously i seen that most common was d5 then c5. however i played 1.c5 as this guy did in his match basically to see what this guy on the website was talking about. he said that the opening upto 8. O-O was strong and gave black a good position for advancement on whites queenside.",
        "1... c5": "should say i played this opponent previously and he started with reti, kings indian attack so i assumed after 1. Nf3 he would do the same so it would give me time to set the opening up.",
        "2. g3 Nc6 3. c3": "preventing advancement of knight, opening diagonal for queen and giving support for d4.",
        "3... g6 4. Bg2 Bg7": "I was worried about going for this type of defence as i very seldom use it but as i was curious about the opening and as it seemed a strong opening i decided just to do what was written down and see where it took me win, lose or draw. this does put pressure on d4 but if white moves d4 black simply moves d6 then e5.",
        "5. O-O": "perhaps a bit early white should have put more pressure on center here. makes no diffence this early on though.",
        "5... e5": "gives black the upper hand in the battle for middle earth.",
        "6. e4": "prevents future torment to the knight with e4 if necessary!",
        "6... Nge7": "again something i never usually do. only if i am under threat do i play Ng-e7 usually go for Nf6. after this game however i use this more frequently.",
        "7. d3 d6 8. Bg5 O-O": "Thats me finished with the opening now, a nice defensive situation for black dont particularly like the dark squared white bishop on g5 as i can be a nuisance to get rid of i could move h7 to chase it but that weakens the pawn structure defending my king. (from now on i play my own game with the advice of going for a queen side attack)",
        "9. Nbd2": "white has full development now. i was toying with idea of pinning knight with bishop as whte has done to me however i thought i'd put pressure on white by advancing my queenside pawns.",
        "9... a5 10. Ne1": "redeploying the troops to cope with the advancement. dont think this is necessary at this stage.",
        "10... b5": "applying more pressure to white queenside with a plan to gain territory and hopefully have a file free for my rook. ",
        "11. Nc2 Be6": "positioned so 12.....,b4 13.cxb4, axb4 14. either qb1 rendering it useless for a while or b3. giving me a territorial advantage and giving white less room to maneuver.",
        "12. Na3": "not a problem as b4 was always on the cards. however does give some food for thought in a moment or two.",
        "12... b4 13. Nac4": "doesn't fancy the swap so moves knight. i really dont like the position of the knight but bxc4 results in Nxc4. also if he moves dxc4....so no sir i dont like it!! bishop for knight out of the question.",
        "13... bxc3": "decided to get that file open i wanted, not the one i intended though but chess is all about readjusting strategy.",
        "14. bxc3 a4": "wanting to move queen to a5 and put more pressure on. feel that so far the opening and attacking queenside is working for me.",
        "15. Ne3": "thought this was a nothing move didn't look to long into it however white gets tempo through this \"nothing move!\" should have looked into it more.",
        "15... h6": "since i want the queen on a5 i have to chase the bishop contrary to what i said about potential weakening of the pawn structure. could have moved Qa5 but white c4 didn't appeal to me.",
        "16. Bxe7": "2 options here. i decide to put my plan of Qa5 on hold and take with the queen. this does not help with trying to get tempo back but it does keep my d6 pawn well protected.",
        "16... Qxe7 17. Nd5 Qd8 18. Nc4": "with white having tempo this makes the game more even than i wanted it to be thanks to the nothing move and now with white wanting to move his knight to b6 i have to get rid of that threat.",
        "18... Bxd5 19. exd5 Ne7 20. Ne3": "this is not needed as bishop is covering d5 pawn. rb1 would be better.",
        "20... Qa5": "threating c3 hoping for whites response to be c4, again contrary to what i said before however it gives the knight a longer route, and setting up a battle for the b file.",
        "21. Qc2": "not what i wanted. I still need a positional advantage perhaps the only down side to the opening....or am just rubbish....probably the latter!\r\nanyway back to the battle of the b file!!!",
        "21... Qa7 22. Rab1 Rab8": "and so it begins!",
        "23. Nc4": "eh? wasn't supposed to do that......Mmmm threating d6.",
        "23... Rxb1": "after quite sometime frodo and sam...sorry! i decided to take the rook. simplify things for the end game coming up. also i have a plan now worked out. i think white feels that d6 is the cornerstone of my defence.....which it is but i know that if i can disrupt his kingside i have a great chance of winning this game and perhaps he wont mind the knight bishop swap if he gets d6. 24.rxb1 Nf5, 25. g4 (chasing knight and definitely getting d6), Nh4, 26.Nxd6, Nxg2. this then allows my queen to rip tempo from white!",
        "24. Rxb1 Nf5 25. g4 Nh4 26. Nxd6 Nxg2 27. Kxg2": "as expected. ok am a pawn down but not for long.",
        "27... Qd7": "black rips tempo back forcing white to move knight.",
        "28. Ne4 Qxd5": "i decide against Qxg4  as it leads to nothing where this give much more options and keeps tempo within the black camp.\r\n",
        "29. f3": "setting up to free the pinned knight.",
        "29... c4": "instead of losing a pawn freely after Rb5 i thought i'd give its death some meaning. a swap and allowing the defence of the lonley pawn on the a file, or have it march on depending on whites choice.",
        "30. Rd1": "interesting......bad move covered with rd8 and gives me a nice option in attack.",
        "30... Rd8": "from here i hatch a plan which if you look at it for a while is obvious, infact the higher rated players would probably see it a few moves back where i had just stumbled across. I say stumbled across it as i did not work positions of pieces i played the best move for the situation i was in without looking for an opening, yeah cardinal sin i know!!!. the fact is my opponent made some bad moves.",
        "31. d4": "Nf2 is by far the better move. this now allows me to go a pawn up and control the end game.",
        "31... exd4 32. cxd4 Qc6": "i like this move it makes it look like i am defending the pawns where in atcual fact i am just about to win the match if the plan comes off. here is where the blood started to pump fast.",
        "33. Nc5": "YAS! this allows a pawn advantage and offers the rook swap with a view to pinning the knight if white is greedy for material.",
        "33... Rxd4": "rook swap offered...",
        "34. Rxd4": "accepted!",
        "34... Bxd4": "now this is where the plan needs to work. its  more obvious he'll take the a4 pawn as he wont want to lose his knight if he plays Qxc4.",
        "35. Nxa4": "YAS! ",
        "35... c3": "at the time this was the move in my head that won the game. Pins whites knight.",
        "36. Kg3": "At this point i was now trying to work the king into a position without disrupting my good work.",
        "36... g5": "prevents the king from popping out and threating the bishop. also stops h or f pawns from being pushed to protect king from the heavy weoponary!",
        "37. h3": "Bad move. this gives me an idea of moving king off of g3 and getting my queen in there for a  mate?????",
        "37... Qc7+": "wont push pawn so only one place he can move.",
        "38. Kg2 Be5 39. Kf1": "what i eventually do i could have done from this position but i was drained mentally after to much chess so it took me a little to see how to finish the game.",
        "39... Bd4": "pointless!",
        "40. Kg2": "white probably feels comfortable just now, well as much he can  in the situation he is in.",
        "40... Kg7": "was going to move f7 after this, had to move king first or white could have got back in with Qg6  but as i hit submit i seen a way to finish the game.",
        "41. a3 Be5": "If he follows what he did last time Kf1......",
        "42. Kf1 Qc4+": "ok i can still keep the pawn safe and if he moves Ke1, Bg3 , Kd1, Qf1# how did i not see that????",
        "43. Kg2": "this works out just as good as with the sequence that follows it make the queen swap inevitable and the pawn promotion also.",
        "43... Qf4": "if Nxc3, Qh2  game over. so.....",
        "44. Qd3 Qd2+": "opponents resigns. after Qxd2, cxd2 there is no way of stopping promotion. then losing his knight. This came from a few mistake by my opponent. also the opening did stop me from playing my usual game and did make me think harder than most of the games i play due to the fact i had tried a lot of new things in this game which is never a bad thing! the opening was good i perhaps did not do it justice, i did find though although it prevented me from my usual game play it did give more options than my opponent on this occasion. I have not used it since.....perhaps i should. I hope you enjoy looking through my annotation and perhaps it may encourage you to try different styles."
    },
    "url": "https://gameknot.com/annotation.pl/challenge-from-aaelarar?gm=10390",
    "gameName": "Challenge from aaelarar",
    "players": "aaelarar (1592) vs. klondyke (1820)",
    "opening": "Reti opening (A04)"
}