{
    "moves": {
        "1. d4 f5 2. Nf3 Nf6": "At this point my knowledge of theory ended. The only thing I know is that I am heading for the Leningrad variation (g6, Bg7, 0-0). Against 3.g5 I planned 3...e6 with the Stonewall variation.",
        "3. g3 g6 4. c4 Bg7": "Before playing 4...Bg7 I checked if 5.Ng5 0-0 6.Qb3 is safe for me (e.g., 6...d6 7.c5+ and if 7...Kh8 then 8.Nf7+ is winning for white), but saw I can play 6...Qe8 and then 7...h6.",
        "5. Bg2 O-O 6. Nc3 d6": "I spent a lot of time on this move. I stand a bit worse, because white has more space and freedom for his pieces. I'd like to play ...e5, but to prepare that I need ...Qe8, which however leaves the pawn c7 undefended. So I'll need to play ...Na6, but what then? I will also need to play ...c6 to make space for the knight at c7. So, I played 6...d6 to prepare ...e5, but with 7...c6 in mind and then either ...Qe8 or first ...Na6 and then ...Qe8. The only thing I need to watch out for is for example 7.0-0 c6 8.d5 and after 9.dxc6 Nxc6 my pawn on d6 is weak, but I freed my pieces, can play ...e5, so I decided this is the price I pay for playing an opening that gives me counterattacking possibilities. I also thought for a while about a plan involving ...c6, ...d5, and ...e6, but then Ne5 would be too strong, and if I capture it, recapturing pawn at e5 will completely hem in my g7 bishop.",
        "7. O-O c6": "As planned last move; I want to avoid 7...Qe8 8.Nb5. After 8.d5 I can play 8...e5 9.dxe6 Bxe6. If 8.c5 I plan 8...dxc5 9.dxc5 Qc7 and I like the resulting position: bishop g2 is biting on granite, I took away squares from the c3 knight, I can play ...e5, and have a square for my rook (d8).",
        "8. Bg5 Na6": "I did not expect 8.Bg5 and it confused me. It seems white only has a slight space advantage, but I could not decide on a good plan. I did not know what to do here. I was tempted by 8...Ne4, but after 9.Nxe4 fxe4 10.Nd2 d5 (10...Bxd4 11.Nxe4 loses, because white's pieces are more active) 11.cxd5 cxd5 12.Nb3 I cannot prevent f3, which will destroy my center, and white is better developed. I thought about 8...Qe8, but then 9.d5 and I cannot play 9...e5, because after 10.dxe6 Bxe6 I am no longer defending the d6 pawn. So I decided I will continue developing pieces (planning Nc7). I also thought about 8...Nbd7, because if 9.d5 e5 10.dxe6 Nc5 regaining the pawn with a nice game. But if not 9.d5, the knight only blocks the bishop c8. So 8...Na6 planning ...Nc7, even though this does not help me achieve ...e5.",
        "9. Qb3 Rb8": "I had no clue what to do. I calculated 9...Ne4 10.Nxe4 (I thought that after 10.c5+ d5 I stand very well with the knight at e4) fxe4 11.Nd2, but did not find anything good this position. 11...d5 does not work anymore, and after 11...Bxd4 12.c5+ looks bleak for me. I thought about 9...Nc7, but my problem is that I cannot move the c8 bishop (e.g., to answer 10.d6 with 10...e5, and after 10...cxd5 11.cxd5 the f3 knight has the e4 square). I thought about 9...Qc7, but did not choose it because of 10.d5 cxd5 and again white knight gets the e4 square plus the queen looks bad at c7. After 9...Rb8 I calculated 10.c5 d5 and then either ...b6 or preparing ...e5, and against 10.d5 I planned 10...e5 11.dxc6 (11.dxe6 Bxe6 looks good for me) Qc7 12.cxb7 Rxb7 and I think my pressure on the queenside compensates for the lost pawn.",
        "10. c5+ Kh8": "I thought about 10...d5 (as planned last move), but rejected it for two reasons: first, white knight gets an outpost at e5 that I cannot attack down the e-file (and also white can play 11.Ne5 Nd7 12.f4); second, after 11.Bf4 I need to either move my rook away or get into the pin. After 10...Kh8 I calculated 11.cxd6 exd6 (11...Qxd6? 12.Bf4) 12.Bf4 (12.d5 Nxd5 13.Nxd5 Be6 or even 12.d5 c5 and then I'd push the pawns down the queenside with the help from my g7 bishop) Nh5 and I like the resulting position: I can generate some counterplay (open e file, open diagonal for the g7 bishop, ability play the pawns on the queenside). Still, white has the advantage, mainly because of the space advantage.",
        "11. cxd6 exd6": "11...Qxd6 does not work, so 11...exd6 was forced.",
        "12. e4 Qc7": "12.e4 was a surprise and I have to admit it's a strong move. My pieces lose coordination (the \"cluster\" on the queenside looks really bad). I need to break the pin on the f6 knight, but I cannot afford to open up the position: 12...fxe4 13.Nxe4 Qc7 and I was not not happy with the prospect of Re1 (threatening 15.Nxf6 Bxf6 16.Bxf6+ Rxf6 17.Re8+ Kg7 18.Qg8+ and I am lost). I thought about 12...Qe8, but was again worried about Re1. So I decided to play 12...Qc7 calculating 13.e5 dxe5 14.dxe5 Ng4 and 15.e6 does not work after 15...Nc5 attacking both the queen and the e6 pawn; 13.exd5 Bxf5; 13.Bxf6 Bxf6 14.e5 dxe5 15.dxe5 Bxe5 16.Nxe5 Qxe5 and I am a pawn up, bishop g2 is not that strong, and I thought this position looks good. Now I felt that 9...Rb8 was a terrible waste of time and I am paying for it.",
        "13. Rae1 Nxe4": "I cannot afford to let white play 14.e5 dxe5 15.dxe5, when I cannot stop the e pawn, so capturing is obligatory. The question is how. I feel like my position is worse, so it does not make sense to look for a \"saving\" combination. I decided to play 13...Nxe4, because after 14.Nxe4 fxe4 15.Nd2 (15.Rxe4 Bf5 and my game is worse, but maybe I'll get a chance to play Rbe8 and exchange rooks, which will ease the pressure on me) d5 (exchange sacrifice) 16.Bf4 Rxf4 17.gxf4 Qxf4 and I have compensation for the lost exchange (plus the pawn at d4 is hanging). And if 13...fxe4 then after 14.Nd2 I cannot play 14...d5, because after 15.Bf4 there is no ...Rxf4.",
        "14. Nxe4 fxe4 15. Rxe4 Bf5": "It's getting very dangerous. White not only threatens 16.Re7, but also 16.Be7 Re8 (16...Rg8 17.Ng5 is bad for me) 17.Ng5 threatening smothered mate. I need to disentangle my queenside pieces to get my knight over to c7 and let the rook b8 into the game. To be able to do that, the queen must move, but I cannot allow 16.Re7 Qd8, because of the bishop on g5. I thought about 15...Bd7, but then 16.Be7. Now I force 16.Re7 and then my plan is to play 16...Qc8 (making space for Na6-c7-d5, cutting white's queen off and attacking e7).",
        "16. Re7 Qc8": "Only move. 16...Qd8 loses after 17.Rxg7 when I lose my bishop. Now I was expecting 17.Bf4, when it's difficult to protect the pinned d pawn. If possible, I'd like to play Nc7.",
        "17. Rfe1 Nc7": "I had the feeling that either white is letting me off the hook or I am missing something. I thought rooks have nothing to look for on the e file, I can play ...Nd5 and ...Bf6 and am on a good path to disentangle my position. At any rate, I did not see anything bettern than 17...Nc7 (e.g., 17...Bf6 18.Bxf6+ Rxf6 19.Re8+ Qxe8 20.Rxe8+ Rxe8 21.Qxb7 and I lose a pawn, need to protect the a6 knight, and I have no counterattack in sight). After 17...Nc7 I am afraid of 18.Bf4, but then I plan 18...Qd8 (19.Bg5 Qc8) and then ...Nd5.",
        "18. Nh4 Bxd4": "I did not care about the pawn, but about the f2 square, especially in connection with perhaps Qxf5 later on. I calculated that 19.Rxc7 Qxc7 20.Nxf5 Rxf5 is safe (21.Bf6+ Rxf6; 21.Re8+ Rxe8). Now I am mostly afraid about the a1-h8 diagonal, so my f8 rook is key, and it's good to keep the bishop on that diagonal, too. So, probably the worst move for me is 19.Bf4, against which I planned 19...Bc5 (and if 20.Bg5 Bd4). I would also like to play ...Nc7-b5-d4 (my planned ...Nd5 does not work because of Bxd5). If white does not play 19.Bf4 then maybe I will find a \"chance\" combination involving f2 and discovered check attacking white's queen on b3.",
        "19. Nf3 Bg7": "Now I finally understood white's idea. If now 19...Bc5 then I lose after 20.Qc3+. My black squares are very weak and I will likely lose. The only defence I came up with was (after 20.Bh6, which I am expecting) 20...Bxh6 21.Qc3+ Kg8 22.Ng5 Ne8! 23.Rxh7 (23.Nxh7 Bg7 and then ...Kxh7) Bg7 and I hope this saves my game (I also plan ...d5 to cut off the queen from the g8 square). If 19...Bg7 does not work, then nothing else works (and I also calculated 19...Nb5 20.a4!; 19...Be6 20.R1xe6 Nxe6 21.Rxe6 and I have the same problem plus the pawn at d6 is hanging). Maybe I should have played 18...Nb5 last move intending to capture d4 with the knight (I could have supported it with ...c5).",
        "20. Rxg7": "I missed that move completely. Now it's all over. My black squares are hopelessly weak and I am getting mated: 20...K:g7 21.Re7+ Kh8 (21...Rf7 22.Qxf7+ Kh8 23.Qh8#) 22.Qc3+ Kg8 (interposition is useless) 23.Qg8#."
    },
    "url": "https://gameknot.com/annotation.pl/challenging-a-stronger-player-1?gm=68639",
    "gameName": "Challenging a stronger player #1",
    "players": "larryphoen (2136) vs. ciastekx (1915)",
    "opening": "Dutch (A80)"
}