{
    "moves": {
        "1. e4 c5": "Not knowing what to play as Black, I decide to go with the Sicilian.",
        "2. Nf3 Nc6 3. d4 cxd4 4. Nxd4 e5": "Having read the Wikipedia article on Sicilians, I figured I liked the Kalashnikov Sicilian the best and took it out for a spin.",
        "5. Nb5": "White threatens 6.Nd6  Bxd6 7.Qxd6. The Old Lowenthal Sicilian allows this but the Kalashnikov has a different way of dealing with it.",
        "5... d6": "Protected by Black's Queen and Bishop, the threat of Nd6  has been deflected.",
        "6. Nb1c3": "Most common moves for White in this position are 6.c4, preventing a later b5 by Black, or 6.Nc3, taking immediate aim at the hole created on d5. This particular Sicilian variation allows this hole in exchange for more active piece play.",
        "6... a6 7. Na3 Be7": "Development move choices were Nf6, Be6/d7, and Be7. The move 7...Nf6, threatening the e4 pawn was probably the better choice as it would have discouraged an immediate 8.Nd5 by White. ***** (Edit for Wakefield - 7...b5 is indeed more thematic and I miscalculated the value of playing it a turn earlier then I did. I was perhaps overly concerned about 8.Nd5 or a wierd piece sac on b5 since White attacked the square 3 times.",
        "8. Nc4": "Had c4 been played earlier, White could have played Nc2 into the pocket behind the c3 Knight. However, this would have left d4 unguarded by a pawn, possibly allowing Black to park his own Knight there if given the chance.",
        "8... b5 9. Ne3": "The open d-file and the placement of the Knights are White's compensation for the earlier loss of tempo from the Knight on Ne3 which has had to move 6 times in the last 9 moves.\n\nBlack must attempt to use his lead in tempo and space and translate it into a developmental or positional advantage before White finishes his own development and takes advantage of the d5 hole by parking a Knight on it.\n",
        "9... Nf6 10. Bd3": "Best square for the light Bishop, though it blocks the use of the d-file for the Queen. The triple coverage of the hole prevents Black from playing d5 for the time being.",
        "10... Be6": "Covering the hole again so that an exchange will leave a White pawn on d5, plugging up the hole which would be favorable to Black.",
        "11. O-O O-O 12. a4": "I notice that with White's c1 Bishop still on its original square, if I allow White to take on b5 and then take back with the a6 pawn, White will be forced to deal with the hanging Rook on a1. The c1 Bishop is in an awkward position pinned in as it is. The move a4 may have been premature.",
        "12... Nb4": "I leave the a4 pawn alone and step my Knight forward in an attempt to get the Bishop pair.",
        "13. axb5 Nxd3": "Black plays a 'zwischen' move before taking back on b5. The first book I ever read on chess was Weapons of Chess by Bruce Pandolfini. The zwischen or inbetween move and other tactical concepts I learned from that book played a large part in shaping my early chess.\n\nHad White played Bd2 earlier, he would have been forced to recapture with the pawn, creating an isolated b-pawn.",
        "14. Qxd3": "The better choice rather then allow an isolated b-pawn.",
        "14... axb5": "I take back, revealing the attack on the a1 Rook.",
        "15. Rxa8 Qxa8": "The b5 pawn is undefended but I now attack the e4 pawn with my f6 Knight and with the Queen along the h1-a8 diagonal.",
        "16. f3": "To facilitate the taking of Black's b5 pawn, White guards the e4 pawn a third time.",
        "16... Bc8": "I plan to move Ba6 for a pin or skewer along the a6-f1 diagonal in anticipation of the capture of my b5 pawn which I can't defend. It is my hope that either the pin or skewer will help me win material and so this may be analogous to a \"Poisoned Pawn\".",
        "17. Qxb5": "I had expected 17.Nxb5 instead. It is possible that White wanted his Knights to remain where they were to take advantage of the d5 hole and/or to more easily prevent d5. I am not sure whether or not this constitutes as a blunder.",
        "17... Ba6": "I skewer the Queen and the Rook behind it. I will get one or the other in exchange for my Bishop which is worth the sacrifice of one of my last Queen side pawns as long as I can eliminate White's majority on that side later. ",
        "18. Qb3": "Still covering d5 with the Queen.",
        "18... Rb8": "I have considered a plan at this point on how to trade down for an advantage. I attack White's Queen one more time to see where he will put it.",
        "19. Qa2": "Still covering the d5 square. However, with White's Queen now on the a-file, I feel I can move ahead with my idea.",
        "19... Bxf1": "I really appreciate the Bishop's Pair when I have it and though the idea of raking bishops along the a6-f1 and a7-g1 diagonals appealed to me I knew that trading down would be better in the long run if I was to get material back for my pawn.",
        "20. Kxf1": "I had only considered Nxf1 but Kxf1 makes much more sense, bringing the King closer to the middle in anticipation of the approaching Endgame. White still controls d5 4 times so I have my work cut out for me.",
        "20... Qxa2": "I begin by exchanging Queens. This takes advantage of the double duty on the c3 Knight and draws it away from protecting d5, further reducing White's control of that square.",
        "21. Nxa2 d5": "I now play d5 and sacrifice my last Queen side pawn to gain time to move my Bishop before White's King gets any closer to his pieces.",
        "22. exd5": "White accepts my pawn offering, clearing the way for Bc5.",
        "22... Bc5": "The c1 Bishop which still hasn't moved this game is currently doing two jobs at once. I intend to overload that Bishop by exchanging off the e3 Knight and picking up the pawn back on b2 with my Rook. Playing the sacrifice of d5 was necessary because if I had I taken more time to get to the a7-g1 diagonal with my Bishop, the opportunity would have passed as White's King would be sitting on e2 or f2.",
        "23. c4": "To prevent Black from sniping off the d5 pawn after the exchange on e3, White throws up his c-pawn. 23.Nc3 was another possibility but after the exchange on e3, there would have been no way to save the c-pawn now stuck behind the Knight after 24...Rxb2.",
        "23... Bxe3 24. Bxe3 Rxb2": "Threatening the Knight. Had 23.Nc3 been played, Black would have been able to pickup a second pawn the next move on c2.",
        "25. Nc3 Rb3": "Threatening both minor pieces at once.",
        "26. Bd2": "Which is easily enough defended against.",
        "26... Kf8": "With two passed pawns on the Queen side, Black begins moving his King over.",
        "27. Ke2 Ke7 28. c5": "White wishes to deny d6 to my King and creates a miniature pawn wall.",
        "28... Kd7": "I move in front of the pawns and begin planning my next moves. I've noticed that if White moves Ke3 or Kd3, he will self-pin the Knight to his King. It becomes my plan to take on d5 the moment this happens.",
        "29. Kd3 Nxd5": "I must confess that while this move looks brilliant on the surface it is in fact a blunder that went unpunished... While I had counted on Kc4 and had worked out how to eliminate White's Bishop by sacrificing my Knight and a pawn for it, I had not counted on Kc2 which would have left me with two undefended pieces that were simultaneously threatened. I could do one of three things:\n\n1). Go for a Rook vs Bishop and Knight endgame where I had 4 pawns to White's 3 after a sequence like 30.Kc2 Rb4 31.Nxd5 Rc4  32.Kd3 Rxc5, \n\n2). I could trade away all the pieces with 30.Kc2 Rxc3 31.Bxc3 Nxc3 32.Kxc3 Kc6 and settle for blockading the c5 pawn with my King with only a slight positional advantage of an extra King side pawn, or \n\n3). I could go for a Knight vs Bishop endgame with equal amounts of pawns using the sequence 30.Kc2 Rxc3 31.Bxc3 Kc6 and then followed by Kxc6 the next move. Of the three, the largest chances of a draw would come from this one.\n\nNone of these really appealed to me though. Would 29...Nxd5 30.Kc2 have cost me the game? Maybe, maybe not. But Kc2 would have equalized for White in most of the scenarios I envisioned and I would have thrown away my two point advantage I had worked so hard for. As the old saying goes, Once you find a good move, find a better one.",
        "30. Kc4": "The lure of protecting c5 and getting the fork must have been fairly appealing and so White passes over 30.Kc2 and goes for 30.Kc4. The move 29...Nxd5 was perhaps my weakest move in the entire game and is the one move I am most dissatisfied with despite how it cleverly exploited the self-pinning of the c3 Knight.",
        "30... Rb4+": "Sacrificing the Knight to save the Rook and setting up Rd4  to win the Bishop. White optionally could have played Kd3 but it would likely have meant forsaking the c5 pawn.",
        "31. Kxd5": "White goes for the Knight, setting up Rd4 .",
        "31... Rd4+": "Interestingly, if the f-pawn had been on f6 instead of its original square, this would have been checkmate. Opportunity lost I suppose.",
        "32. Kxe5": "Only move, stepping away from c5.",
        "32... Rxd2": "Between White's two remaining minor pieces I wanted to eliminate the Bishop the most and so this combination came in handy.",
        "33. g4": "A good move, saving the g-pawn so that the remaining White King side pawns will be linked rather then isolated.",
        "33... Rd3": "I threaten the Knight and the f3 pawn. I knew that Ne4 would eventually be played and had seen the possibility of the Ng5 fork but had worked out that Rxf3 would still be safe.",
        "34. Ne4": "Protecting the c5 pawn and moving towards the protection of the King.",
        "34... Rxf3": "I take the f3 pawn,",
        "35. Ng5": "White goes for the fork, and ...",
        "35... f6+": "gets 'forked' by the f6 pawn. Its more of an intermezzo then a true fork since White can still save the Knight.",
        "36. Ke4": "Of the three available King moves, only this one saves the Knight.",
        "36... Rc3": "I move away and threaten the c5 pawn. With White's King now sitting on e4, the Knight can not return in time to guard the pawn which would force Kd4 to save it.",
        "37. Nxh7": "Rather then get cut off from the remaining pawns, White leaves his King where it is, and takes on h7. This pawn was bait and is part of a trap I had worked out to eliminate White's last minor piece.",
        "37... Ke7": "I have now successfully corralled the Knight with two pawns and my King. At the earliest possible moment, I will swing over with Rh3 to capture it. White's c-pawn is three squares away from promotion but Rh3, Rxh7, and Rh8 allow me to cover the promotion square before it arrives.",
        "38. g5": "Of White's available moves, I felt moving the King over towards the Knight would have given me the most trouble. I knew that if gxf6  was played, I could maintain the trap by taking back. If White's King were parked on f5 however it would another story. ",
        "38... Rh3": "I figure I will have enough time to take on h7 and so I move over. Yet another possibility for White I noticed at this point would have been to push 39.g6 but this would have given me a passed pawn of my own.",
        "39. gxf6+ gxf6 40. Nxf6": "Three pawns for a Knight is fairly reasonable.",
        "40... Kxf6 41. Kd5": "White protects his pawn and threatens to cut me off by playing 42. Kd6.",
        "41... Ke7": "I match White's King movement with my own. By forcing White to walk in front of his pawn, I give my Rook time to capture on h2 and swing over to the c-file.",
        "42. Kc6 Rxh2": "Moving Kd8 is unnecessary as there is enough time to capture and then intercept the c-pawn by the time it reaches c7.",
        "43. Kb7 Rc2 44. c6 Kd6": "Once the pawn moves down, the Black King steps in.",
        "45. c7 Rxc7+ 46. Kb6 Rc5": "Cutting off the King from escaping. Here were some checkmate sequences I had worked out from this position. If I had worked out other sequences for Ka6, or Ka7, I must have lost my notes on them.\n\n47. Kb7 Rb5  48. Kc8 Rb6 49. Kd8 Rb8#\n47. Kb7 Rb5  48. Ka6 Kc6 49. Ka7 Ra5  50. Kb8 Ra6 51. Kc8 Ra8#\n47. Kb7 Rb5  48. Ka8 Kc6 49. Ka7 Ra5  50. Kb8 Ra6 51. Kc8 Ra8#\n47. Kb7 Rb5  48. Ka7 Kc6 49. Ka6 Rc5 50. Ka7 Ra5  51. Kb8 Ra6 52. Kc8 Ra8#\n\n",
        "47. Ka6 Kc6": "The King sitting on c6, c3, f6, or f3 in a Rook and King vs King endgame is fairly powerful. Something to remember.\n\n48. Ka7 Ra5  49. Kb8 Ra6 50. Kc8 Ra8#.",
        "48. Ka7 Ra5+ 49. Kb8 Ra6 50. Kc8 Ra8#": ""
    },
    "url": "https://gameknot.com/annotation.pl/challenge-from-yttrio?gm=18804",
    "gameName": "Challenge from yttrio",
    "players": "yttrio (1889) vs. geiss83 (1463)",
    "opening": "Sicilian (B32), Labourdonnais-Loewenthal (Kalashnikov) variation"
}