{
    "moves": {
        "1. d4 d5 2. Nc3 c5": "First glimpse of differing strategies here: White is developing minor pieces, while Black is favoring a pawn push.",
        "3. e3 c4 4. e4": "Black threatens a pawn blockade, so White challenges it.",
        "4... e6 5. Qf3": "White pursues control of the center, while Black seeks to barricade the center.  The pawn wall is complete.",
        "5... Bb4 6. Bd2": "Black finally shows some aggression; White meets him piece for piece.",
        "6... f5 7. exd5": "Black advances the wall, and White has had enough and moves to break it.",
        "7... exd5 8. Nxd5 Bxd2+": "Black tries a largely benign attack, though it does serve to prevent White from castling.",
        "9. Kxd2": "A few exchanges later, the board is clear - only now Black is left with stranded pawns and nothing else, while White controls the center with both a queen and a knight, as well as having an open path for his rook.",
        "9... Nf6 10. Nxf6+ Qxf6": "Black attempts to challenge White for the center of the board; White aggressively denies him.  Knights are exchanged.",
        "11. Re1+": "As the dust settles, White begins his assault on Black's king.",
        "11... Kf7": "Had Black blocked the check with his bishop, White would have answered with d5.  However, Black chose evasion (potentially looking to get his rook into the game).",
        "12. Bxc4+": "White is relentless, taking a pawn and continuing the pressure on Black.",
        "12... Kf8": "Black could have prolonged the game with Kg6, forcing White into a battle along the edge of the board and possibly opening up with one of his pieces.  However, he retreated instead, sealing his fate.",
        "13. Qa3+": "White drives the dagger in.  Black's only option is to block with his queen, and instead of losing another piece, he resigns."
    },
    "url": "https://gameknot.com/annotation.pl/challenge-from-gamer2k4?gm=60653",
    "gameName": "Challenge from gamer2k4",
    "players": "gamer2k4 (1200) vs. blood_knight (1268)",
    "opening": "Queen's pawn (D00), Chigorin variation"
}