{
    "moves": {
        "1. d4": "I said I'd try the queens pawn one day! You beat me to it!",
        "1... d5": "there's only one answer to d4, isn't there?",
        "2. Nf3 g6": "now this is not standard queens opening, but I do like to prepare the fianchetto for castling king side... Even if I don't end up using it.",
        "3. h3": "knight out at f3 and cannot now be threatened by the bishop.\r\n\r\n(though this is really a wasted move giving me time to take the advantage)",
        "3... Bf5": "ok I'll develop to f5 - see if you'll bring king side pawns forward",
        "4. g4": "yes, you do? \r\ncould always retreat to d7 - no shame in that..\r\nafter all you've now committed your pawns on the king side",
        "4... Be4": "... but this could be better ?\r\ncan't really budge the bishop except with the queens knight.\r\nand Its stopping you castling on the kings side... You'll have to start developing your queens side... (come to think of it - need to develop some major pieces meself)",
        "5. Bg2": "ok thats logical but you still can't move the knight 'cept to go backwards h4 Nxg2\r\n\r\nthough Nc3 will still budge me and you can now recapture with bishop nicely.",
        "5... Bg7": "ok time to develop and apply some pressure in the center.\r\nknight currently pinned on f3 so can leave that situation till Nc3\r\nlets apply pressure to the easily defendable d4.\r\nAnd build that Fianchetto at the same time....",
        "6. g5": "ok totally open on kings side now..\r\nmay switch my castling plans to the queens side..\r\nf5 can now be met with en-passant (might be a good option?) exf6 stops the knight progressing forwards... if it ever could...\r\n\r\n(another wasted move? whats your plan John?)\r\n",
        "6... Nc6": "lets apply some more pressure to the pawn.\r\nHmmmmm how did I get so aggressive here - I'm black\r\nshould be taking things easy!",
        "7. Be3": "ok you're forced to the defence of the poor solitary pawn.\r\nIf I could attack with remaining knight? e7 f5 two moves to get there (threatening bishp on e3)\r\n-- hmm there is also, of course Nb4 attacking c2 and rook in corner!!\r\n",
        "7... f5": "ok, did some thinking around Nb4 ... but it's too easily defendable by Na3 ...\r\nlooks like it leads to attacking possibilities but nothing too promising.\r\nLike the idea of offering John en-passant, and if he takes I'll shift e pawn -> f6\r\nlooking also to open up the d file ... castle on the Queens side... and have queen, rook, bishop and knight bearing down on poor d4.",
        "8. gxf6 e.p.": "ok took e.p\r\nI'll recapture with pawn - and look to d4.\r\ncould end up with a pawn on e4 if John decides to take the bishop",
        "8... exf6": "still looking strong! ",
        "9. Nh4": "ok. So you got fed up waiting on that knight and bishop trapped in the corner!\nThis may not be the way to shift things.?\n\nI'm sure Nc3 is a much better move ... Looks like I'll have something to exploit here...",
        "9... f5": "ok, its still on to open up the d file and put godawful pressure on the easily defendable d4 ... but in the meantime I also threaten the knight with queen which will have to retreat ... losing some time ... wheres he gonna castle??",
        "10. Bxe4": "frustration over.",
        "10... dxe4": "Now to continue with the plans of a few days ago .. I belive this is sound.. and looking at it now John cannot now defend the pawn as that ill advised knight move to h4 now causes problems! gotta retreat and the pawn is lost.\r\nJust what is the correct order to take?",
        "11. Ng2": "You did what you had to do!\nNow I have looked at the order in which to win the pawn only to find that things are a little tricky in the pawn taking department ...\n\nespecially with c3....",
        "11... Qd7": "Need more ammunition - so to proceed...\n- with correct placement of Queen so as to not come under threat from bishops or knights. and ...\n- look to castle on Queens side.. bringing more pressure on d4 or ?d5?\nremember!!!  be patient wait for a crack to appear.... ",
        "12. c3": "now I said it was easily defendable didn't I?\nYou knew that all along didn't you?\n\nand that long bishop of mine into b2 is looking less threatening also :-(",
        "12... b6": "oh well, we'll be needing to stop your bishop taking on a7 'before' casteling. \r\nMay create a save haven for knight on a5.\r\nSettling for easy option after wild sacrificing fantacies !!",
        "13. Qa4": "wow! very sexy indeed :-) didn't see that one ...\nI play a quiet move and you get all haughty. hmmm have to think ... doubt setting in. If I move the knight to a5 Im asking for trouble (either queen swap and kiss castleing goodbye) or b4!?\nthough might be forced to, if you are looking to progress d5..? ",
        "13... Bh6": "ok - there's alot going on and you are just too dangerous as you are currently setup - especially worried about your two knights attaining b5 (Qn) and d5 (Kn) and then c7 having a very dangerous set of linked knights right in my castled den... supported by queen and bishop is disaterous for me ... So I'm gonna weaken your bishop and not give you incentive for progressing the knight on b1 to a3 and b5 ...\r\nGotta keep my kings options open here! might need to go back to the open kings side?",
        "14. Nf4": "well you don't have to take my bishop of course \r\nAnd as mentioned earlier your advance of both this knight and other knight to d5 and b5 is worrisome ...\r\n",
        "14... Nf6": "so .. protection of d5 is paramount - may well castle on the kings side soon to connect the rooks.\nyour best moves here? - what I'm really worried about? na3 and 0-0-0\nthe pressure could become unbearable.",
        "15. c4": "Now, I know things have shifted and you are in the driving seat!\r\nNow, I know that your itching to push d4-d5\r\nNow, I know that this enables you to progress your kinght to c3- enabling you to 0-0-0\r\nThink I'm atall worried?",
        "15... Bxf4": "not atall....\n'cos I'm sure your impatience may have cost you a pawn!\njust for a *moment* you don't have enough to protect d4 ... and your easily defendable pawn becomes mine ??\n- I've also thrown some conditional moves in here to disconcert you :-) though you really *must* take with bishop and then decide on whether to keep the queen or not?",
        "16. Bxf4 Nxd4": "d4 !!\n\ndidn't think I'd get it but .... the pressure is off! c4 was a serious mistake\nok, wheres the Queen goin?",
        "17. Qxd7+ Nxd7": "take with knight to protect against dangerous bishop to e5",
        "18. Na3": "ok you had to protect your rook somehow!\nthis also opens up knight to b5 ... but I have enough to protect my pawns now and consilodate surely?",
        "18... O-O-O": "protecting pawn on c7 and connecting rooks...\none of my conditional moves ... not analysed too deeply but need to protect the pawn somehow.\nI need to leave it where it is as it stops your knight travelling to f7 !!",
        "19. Rd1": "freeing up your knight to move...\n",
        "19... Ne6": "Now this move is truely awsome! and may win more material.\nnot being fooled into leaving the knight there and protecting with the pawn to c5 ... this gives you too many attacking opportunities...\nfrom this 'white' square I'm protected from your bishop and control many important sqaures within my own boundaries, including c7...\nYou may end up with your bishop back on h2 and fully blocked in too..",
        "20. e3": "ok, you didn't like the idea of being forced into the corner with your bishop - with my pawn to f4? supported by knight?\nYou may well then lose both bishop and protecting pawn before too long then..",
        "20... Ndc5": "ok, this knight now becomes attacking to d3... \nWhats the term for attacking two pieces at once with a knight? there's a term for it ... gone completely out of my head!\nI'll quite happily swap off rooks here too; but either rook -or- knight to d3 is strong.\nof course if you allow me to take your rook on d1 then when your king retakes ; both king and rook will be just in the right place for me to threaten knight to d3 and f2... ",
        "21. O-O": "but this is the best reply !\nthis stops most of the trouble my knight to d3 could create...\nand you want to retain the d file understandably.\n\nyou will not retain the d file !!",
        "21... Nxf4": "ok, you didn't retreat the dangerous bishop when you had the chance ... so I will take and target your defending pawn ...\nhopefully I'll be 2 pawns to the good and game over!\n\nconditional moves thrown in to scare you!? but the knight *is* coming in to d3 attacking pawns on b2 and undefendable f4. ",
        "22. exf4 Nd3 23. Rd2": "ok J, now your in damage limitation! I'm not worried yet concerning d file.\nEven if you do manage to double up your rooks - I can retreat the knight to the awesome e6. and begin to think where to apply pawn pressure.",
        "23... Nxf4": "but you don't have time to double up the rooks in any case! before going further behind on h3.",
        "24. Rfd1": "At this juncture we played 24-36 in quick succession 'live' during google chat ... but this doubling of rooks definitly gives me that 3 pawn advantage I was talking about - and I'll hopefully consolodate during the rapid play.",
        "24... Nxh3+": " 3",
        "25. Kg2": "allowing me to check again dring retreat\r\nand getting you king into the game of course :-)",
        "25... Nf4+ 26. Kg3 Rxd2": "now you wren't expecting that ...\r\nbut as I'm now 3 ahead the quicker I can swap off the material the better.\r\nI've still got the awesome Ne6 to come.",
        "27. Rxd2 Ne6": "Awesome :-)",
        "28. f3": "now this is good splitting up my pawns and leaving one isolated on e4.\r\nof course I could take but don't like the thought of your rook dominating the e file, phile",
        "28... Rd8": "so I don't take the pawn - simply ask you what your gonna do with that rook?",
        "29. Rxd8+": "ok - that'll do nicely",
        "29... Kxd8": "recapture with king ... may need the knight to defend isolated pawn",
        "30. fxe4 fxe4 31. Nb5": "c3 looks good for you here and I may well lose the pawn in the center.\r\nbut then again I have both flanks ... If only I can get rid of your troublesome knight your king wouldn't know wich way to turn...",
        "31... Nc5": "now this is a *mistake* defending my pawn too early and giving the pawn on a7 away too. \r\nyou may have won 2 pawns back during this rapid play.?",
        "32. b4": "but you didn't take (phew!) \r\nbut this is a nice move too - didn't see it!? maybe my knight should have been protecting on the other side?",
        "32... a6 33. Na7": "now this is a strange move - your under as much time pressure as me here :-) if only I could trap you now! but c6 is your escape route.",
        "33... Nd3 34. a3": "ok you defend with pawn instead of Nc6",
        "34... Kd7": "So I'll try and build a jail there for you!",
        "35. b5": "not a very secure one obviously.",
        "35... axb5 36. Nxb5 h5": "ok, nows the time to make these 3 pawns count...\r\nforce the knight off the board in defence of rampaging pawns.\r\nThis move also stops you approaching solitary pawn on e4 ...\r\n- wow is that still there ??? hopefull back to 3 days per move now - that was frantic - nearly lost it in the corner..",
        "37. c5": "ok back after a little time off and I'm really not atall sure what your idea is here?! ",
        "37... Nxc5": "thankyou",
        "38. Kf4": "ok, if it was a scrifice to allow your king into the center and the g pawn, you are forgiven. But it's not gonna do you any good!",
        "38... c6 39. Nc3 Kd6": "ok my king can enter the fray too - needs to to help pawns reach thier destination.",
        "40. Kg5 Ke5": "take the g pawn and watch the h-pawn fly :-)",
        "41. a4": "ok - I've still go to win it apparently.",
        "41... Kd4 42. Ne2+ Ke3 43. Nf4 Kf3": "Now I'm totally prepared to march the e pawn home.!!\r\nThis was a very good game on your part - one mistake at c4 was the downfall! otherwise you were way on track to apply horrible pressure after my early dominance. Solid till that mistake, and from there your opportunities were limited as you know?"
    },
    "url": "https://gameknot.com/annotation.pl/challenge-from-felius?gm=5680",
    "gameName": "Challenge from felius",
    "players": "felius (1200) vs. kiev53 (1200)",
    "opening": "Queen's pawn game (D02)"
}