{
    "moves": {
        "1. e4": "Las aperturas de peón de rey abren enseguida las diagonales del alfil blanco y de la dama, lo que suele dar lugar a partidas agresivas desde el principio. Por el contrario, la jugada 1.d4 hace que la apertura sea mucho más tranquila, al tener menos flexibilidad para sacar piezas, al tiempo que lleva a posiciones más sólidas, sobre todo debido a la función defensiva que adquiere la dama.    \n",
        "1... e5": "Es la respuesta clásica, que da lugar a aperturas tan tradicionales como la española, la italiana o la escocesa.    \n",
        "2. Bc4": "Tenía ganas de experimentar con la apertura del alfil, que nunca he llevado a cabo en partidas serias. La apertura del alfil era muy jugada en tiempos antiguos, pero luego fue perdiendo popularidad. Sin embargo, en los últimos años ha vuelto a ponerse de moda. Al sacar el alfil a c4, se presiona el centro y el peón más débil de las negras, que es el f7, al tiempo que se controla la diagonal a2-g8.    \n",
        "2... Nf6": "Una jugada muy natural. Evita que el peón débil de f7 pueda seguir siendo atacado con la dama, y además ataca el peón en e4.    \n",
        "3. Nc3": "Otra jugada de control del centro. Se evita 3... d5, que sería una jugada bastante fuerte.    \n",
        "3... Nc6": "Las negras continúan presionando sobre el centro.    \n",
        "4. d3": "Es habitual que las blancas hagan d3 en las primeras jugadas de las aperturas de peón de rey, ya que permite que se desarrolle el alfil de casillas negras a la vez que se defiende el peón e4. Lo bueno es que la apertura del alfil ha permitido evitar de forma sencilla que el alfil de casillas blancas quede semi-encerrado en las casillas f1-e2.    \n",
        "4... Na5": "Es una continuación habitual, molestando al alfil que salió al principio, al que prácticamente se le obliga a cambiarse por un caballo. Aún así, esta jugada tiene el inconveniente de que aleja el caballo del centro, que es donde suele ser más útil, mientras que al estar el alfil c4 defendido, no impide que las blancas continúen desarrollándose.    \n",
        "5. Bb3": "Evita 5...Cxc4 6.dxc4, que resultaría en una estructura de peones algo incómoda: en ese caso el peón e4 dejaría de estar defendido por otro peón, y además el peón de la fila d se alejaría un poco del centro, lo cual es ligeramente malo. Sin embargo, las blancas tenían una alternativa interesante: 5.b3. Esto les hubiera permitido evitar violar uno de los principios de la apertura (no mover dos veces la misma pieza en las primeras jugadas), a la vez que se daba una posibilidad de sacar el alfil de negras por otro lado.    \n",
        "5... Nxb3": "Las negras deciden cambiar caballo por alfil, lo cual es positivo tratándose de una apertura abierta, donde los alfiles suelen ser ligeramente más útiles que los caballos. Además, el caballo no haría nada importante quedándose en a5.    \n",
        "6. axb3": "...pero este cambio de piezas también tiene una consecuencia que más tarde pueden aprovechar las blancas a su favor: se abre una salida interesante para la torre.    \n",
        "6... Bb4": "Esta es seguramente la mejor jugada, pues se desarrolla el alfil de casillas negras antes de que pueda quedar encerrado por el avance del peón d7 a d6. Por otra parte, el caballo c3 queda clavado, y gracias a la ausencia de peones blancos en la columna a, el alfil no puede ser atacado de forma eficaz (si 6. Ta4, las negras pueden defenderse con 6...a5    \n",
        "7. Nf3": "Las blancas atacan el peón central de las negras. Aquí las blancas tenían otras alternativas interesantes, como desclavar el caballo (7.Ad2) o clavar el caballo de las negras (7.Ag5)     \n",
        "7... O-O": "Las negras ignoran el ataque a su peón central.    \n",
        "8. Nxe5": "Las blancas aceptan el regalo, aunque no está del todo claro que esta haya sido la mejor idea. A cambio del peón de menos, las negras tienen la iniciativa, lo que les permitiría contraatacar.   \n",
        "8... d6": "Esta es la jugada correcta para contraatacar. A la vez que se ataca el caballo en e5, se abre la diagonal del alfil de casillas blancas.  \n",
        "9. Nc4": "Probablemente hubiera sido mejor 9.Cf3, a lo que se podría continuar con 9...Ag4 10.0-0 h6  \n",
        "9... Bg4": "Las negras se equivocan haciendo una jugada que permitirá a las blancas cortar el ataque interponiendo un peón que a su vez amenaza el alfil g4. La mejor jugada (y muy interesante) hubiera sido 9...d5!, a lo que las blancas tienen difícil una buena respuesta. Si 10.e5 Te8 y las blancas no pueden impedir que las negras recuperen el peón perdido y el control del centro. Las blancas únicamente podrían evitar perder un peón con 10. exd5 Cxd5 11.Ad2 Ta8+ 12. Ce3 Dg5 13.0-0 Ah3, pero el ataque de las negras es muy difícil de contrarrestar.  \n",
        "10. f3": "El alfil de casillas blancas está obligado a retroceder, perdiendo con ello las negras la iniciativa. La estructura de peones blancos se ha vuelto muy sólida.  \n",
        "10... Bh5": "Habría sido mejor llevar el alfil a d7, donde tendría mayor libertad de movimiento y posibilidad futura de ataque, o a e6, donde al menos se apunta hacia el centro del tablero  \n",
        "11. O-O": "Por fin las blancas pueden enrocar y proteger a su rey.  \n",
        "11... b6": "Es difícil saber cuál era aquí la intención de las negras. La jugada no parece muy buena por quitar libertad de movimiento al alfil en b4, que está cada vez más desprotegido.  \n",
        "12. Bg5": "Las blancas clavan el caballo negro. Es un golpe más en el proceso de complicar los movimientos de las piezas negras.  \n",
        "12... Bc5+": "Muy mala jugada, que pondrá al alfil en una situación muy comprometida.. Aquí lo adecuado hubiera sido 12...Axc3, cambiando un alfil que apenas puede moverse por un caballo blanco que es muy fuerte controlando el centro del tablero. Después, la continuación lógica sería 13.bxc3 h6 14.Axf6 Dxf6, y las posición de las negras solo es ligeramente peor que la de las blancas.  \n",
        "13. d4": "Es la jugada lógica: para el jaque y encierra más aún al alfil de c5.  \n",
        "13... Bb4": "Las negras intentan salvar su alfil de casillas negras desesperadamente.  \n",
        "14. Nd5": "Las blancas utilizan el caballo que antes las negras no quisieron comerse para atacar simultáneamente alfil y caballo, aprovechando que este último está clavado.  \n",
        "14... a5": "Las negras condenan a muerte definitivamente a su alfil. Hubiera sido mejor 14...c5 15.c3 b5 16.cxb4 bxc4 17.bxc4, y las blancas solo habrían conseguido un peón extra.  \n",
        "15. c3": "Se consuma el encierro del alfil.  \n",
        "15... Bxc3": "Quizá una mejor alternativa sería 15...b5, seguido de 16...c6. El alfil de b4 seguiría siendo capturado en el futuro, pero los caballos se hallarían en situaciones menos peligrosas, y además al hacer cxb4 quedaría una estructura de peones mucho menos favorable para las blancas. \n",
        "16. bxc3": "En esta posición, las blancas no solo tienen un caballo de más, sino que también tiene sus piezas menores en una posición muy ofensiva. No parece mucho que las negras puedan hacer. \n",
        "16... h6": "Seguramente, las negras esperaban provocar aquí 17.Axf6 gxf6, librándose así de tener piezas clavadas, pero...  \n",
        "17. Nxf6+": "Las blancas buscan simplemente ganar un peón más. \n",
        "17... gxf6": "Única jugada no absurda. \n",
        "18. Bxh6": "Las blancas han conseguido su objetivo, amenazando además la torre, y lo que es más importante, dejando abiertas las columnas g y h para poder atacar directamente al rey negro. El único defensor de la posición del rey es el alfil que ahora está en h5. \n",
        "18... Re8": "¡Ojo con la amenaza 19... Txe4 (el peón de f3 está clavado)! \n",
        "19. Qe1": "En principio, esta no parece la mejor forma de desclavar el peón f3, puesto que a su vez otro peón, (el e4, que para colmo puede ser atacado por dos peones negros distintos) queda a su vez clavado por la torre e8. Sin embargo, las blancas van más allá: han colocado la dama en e1 para buscar un ataque rápido contra el rey negro. \n",
        "19... d5": "Las negras intentan aprovechar la nueva clavada, atacando al mismo tiempo el caballo blanco. \n",
        "20. Qg3+": "Las blancas inician el ataque directo. Se pospone el problema del caballo atacado gracias a que primero se obliga a las negras a salir del jaque. \n",
        "20... Bg6": "Es la única jugada legal que impide el mate Dg7# en las jugadas 21 o 22. \n",
        "21. Nd2": "Es la jugada natural. No solo hay que retirar el caballo, sino también defender el peón e4. Ahora, ese peón está defendido por el mismo número de piezas que lo atacan, siempre que no se tenga en cuenta el alfil g6 por estar clavado. Si en algún momento ese alfil se desclava, el peón e4 será débil. \n",
        "21... dxe4": "Con el alfil clavado y el resto de las piezas inactivas, a las negras ya les es difícil encontrar una buena jugada. Esta jugada no es muy buena porque permite a las blancas abrir la columna F, dejando vía libre a las torres para atacar.\n",
        "22. fxe4": "Ahora el peón f6 esta debilitado, y esa puede ser una buena puerta de entrada para el ataque al rey negro.\n",
        "22... c5": "El peón d5 está clavado, así que no puede comer, pero sí avanzar. También puede ser defendido con una de las torres.\n",
        "23. d5": "Mediante el avance, las blancas consiguen un peón pasado, que por ahora no puede ser fácilmente capturado por estar ligado con el otro peón central. Sin embargo, se crea una debilidad en la casilla 35, que no es grave porque el caballo puede defenderla cuando sea necesario.\n",
        "23... b5": "Bien jugado. Las negras tratan de compensar el ataque que reciben en el flanco de rey a su vez atacando con peones el flanco de dama, donde las negras son en este momento algo más fuertes.\n",
        "24. Rf4": "Las blancas intentan darse más prisa que las negras en atacar. Otra posibilidad interesante hubiera sido 24.h4, con la intención de atacar el alfil clavado con el peón. La opción de intentar parar primero el ataque de peones de las negras no parecía buena idea, por ejemplo 24.c4? bxc4 25.bxc4, y entonces el peón pasado h5 podría volverse peligroso. Volviendo a la partida real, después de 24.Tf4 hay dos planes posibles: doblar las torres (es decir, ponerlas en la misma columna) o hacer 25.Tg4 (amenazando 26.Txg6+ fxg6 27.Dxg6, seguido de 28.Dg7#). la única defensa buena ante esto último sería difícil de ver, pero existe: 25... De7! \n",
        "24... Qd6": "Por suerte, era el turno de las negras, y encuentran una jugada que elimina el fuerte ataque de 25.Tg4, pues en ese caso las negras pueden simplificar la posición cambiando damas. En realidad cambiar damas podría no ser la mejor solución, puesto que no conviene cambiar piezas cuando se está en desventaja material; la alternativa hubiera sido  24... Te5\n",
        "25. Raf1": "Las blancas realizan el otro plan anteriormente mencionado, consistente en doblar las torres.\n",
        "25... a4": "Las negras continúan muy bien con el ataque del lado de dama. La alternativa hubiera sido mejor intentar parar el ataque de las blancas, por ejemplo mediante 25... Ta6 26.Txf6 Dxf6 27.Txf6 Txf6.\n",
        "26. Rf4xf6": "Con esto las blancas ganan un peón y obligan a las negras a cambiar damas.\n",
        "26... Qxg3": "Única opción buena. Si por ejemplo se hubiera hecho 26... De7 entonces 27.Txg6+ y las negras tienen que entregar la dama para evitar el mate 27...fxg6 (si 27...Rh7 28.Tg7+ Rh8 29.Tfxf7 Dxf7 30.Txf7 Tg8 31.De5+ Tg7 32.Dxf7#; y si 27...Rh8 28.Ag7+ Rg8 29.Af6+ fxg6 30.Dxg6+ Rf8 31.Ae7+ Rxe7 32.Df6#)  28.Dxg6+ Rh7 29.Tf7 Dxf7 30.Dxf7\n",
        "27. hxg3": "De nuevo, única jugada no absurda.\n",
        "27... axb3": "Esta jugada es un error. Con ella, las negras desperdician el último cartucho de su cagador: el peón de la columna a, que podría haber obligado a las blancas a abandonar el ataque para esforzarse en impedir que dicho peón se convirtiera en dama. Por ejemplo: 27... a3!  28.Ta1 a2 29. Tf2 Ta6 (con la idea de doblar las torres) 30.Ae3 c4 31.bxc4 bxc4 32.Cxc4 Axc4, y aún así las blancas no tienen facil comerse el peón sin perder alguna otra pieza. Es curioso el hecho de que el caballo no puede hacer mucho aparte de estorbar a pesar de ser la pieza más cercana al peón a.",
        "28. Nxb3": "Es lo que las blancas tienen que hacer a pesar de dejar el peón e4 sin defender.",
        "28... Rac8": "Las negras deberían haberse comido al menos un peón: 28.Txe4. Ese peón no es recuperable por las blancas: si 29...Cxc5 30.Te3 y las negras capturan como mínimo otro peón más.",
        "29. d6": "Interesante. Las negras se ven forzadas a mover una torre para evitar el ataque doble del peón si este avanza hasta d7, y después se van a tener que emplear a fondo para evitar que se convierta en dama.",
        "29... Re7": "Las negras se suicidan. La continuación correcta hubiera sido 29...Ted8, con lo que se impide por el momento que el peligroso peón pasado continue avanzando (si 30...d7 31.Tc7).",
        "30. dxe7": "A partir de aquí, las negras ya no tienen mucho que hacer.",
        "30... Re8": "La torre amenaza el peón al mismo tiempo que bloquea su avance. Si las blancas quisieran defenderlo, tendrían que hacerlo indirectamente, mediante 31.Ag5 (si 31... Txe7 32.Txg6+ fxg6 33.Txe7 y las negras se quedan sin piezas).",
        "31. Rxg6+": "Las blancas rematan con un bonito sacrificio.",
        "31... fxg6": "Hubiera sido preferible no aceptar el sacrificio, y mover en su lugar 31...Rh7, amenazando al mismo tiempo la torre y el alfil. Aunque, a decir verdad, esto solo hubiera prolongado la agonía.",
        "32. Rf8+": "Ahora sí que no hay manera de evitar que las blancas saquen dama.",
        "32... Kh7": "Las negras abandonan la torre a su suerte, pues la otra opción conducía a un mate más rápido: 32...Txf8  33.exf8=D+ Rh7 34.Dg7#",
        "33. Rxe8": "A partir de aquí, el mate ya solo es cuestión de tiempo y la partida ya no tiene mucho interés.",
        "33... Kxh6 34. Rh8+ Kg7 35. e8=Q Kf6 36. Qd8+ Ke5 37. Qe7#": "¡Bonito mate en el centro del tablero y usando solo la dama y peones! Las negras podrían haber retrasado el mate una jugada más si 36...Rf7 o 36...Re6. En todo caso sería mate después 37.Th6 y 38.Dh7#."
    },
    "url": "https://gameknot.com/annotation.pl/challenge-from-diegofg-http-gameknot-com?gm=58037",
    "gameName": "Challenge from diegofg, http://gameknot.com/",
    "players": "diegofg (1769) vs. reina_78 (1200)",
    "opening": "Bishop's opening (C24), Berlin defence"
}