{
    "moves": {
        "1. e3": "This is a training game with me and a new player to my over-the-board club! We live in neighbouring villages! I am annotating it to help him learn!",
        "1... e5": "e3 is not a bad opening move. It makes it hard for black to attack f2, and prepares to develop the Bf1.",
        "2. b3": "This is not a bad follow-up either.",
        "2... d5": "I take the centre.",
        "3. Bb2": "He continues to develop - this is the logical follow-up to his previous move.",
        "3... Bd6": "I protect the e5 pawn.",
        "4. c4": "This is a good move, chipping away on the black centre.",
        "4... c6": "So I protect d5.",
        "5. cxd5": "Taking isn't bad, but I think it improves black's position more than white, as now Nb8 can go to c6.",
        "5... cxd5": "I take back.",
        "6. Qe2": "This is a truly dreadful move. It blocks the diagonal for the bishop. White shouldn't be thinking of developing the queen so early. Instead 6. Nc3 and Bb4+ have been played before.",
        "6... Nc6": "I play the knight out - partly because it is good development, but also because he was threatening to come to b5 with check.",
        "7. Qb5": "He goes to b5 anyway. Although the computer doesn't give it as a mistake, I think it is. He really needs to develop his knights and Bf1.",
        "7... Nge7": "So I protect d5.",
        "8. a3": "Again not given as a mistake by the computer, but I think it is - he needs to develop his knights and Bf1.",
        "8... O-O": "I get my king to safety.",
        "9. h4": "This is not given as a mistake by the computer, but I think it is. He really needs to develop his knights and Bf1",
        "9... Qc7": "I want to move Bc8 without losing b7.",
        "10. b4": "Yet another wasted move in my view!",
        "10... Bd7": "Now I am threatening to move my Nc6, opening up the diagonal for my Bd7 and so attacking his queen.",
        "11. Qe2": "So the queen wisely retreats.",
        "11... d4": "I try to open up the centre to his king.",
        "12. e4": "Computer says this is a mistake, but there is some logic in trying to keep the centre blocked with his king in the centre.",
        "12... Kh8": "Computer doesn't like this move. I am preparing f7-f5",
        "13. g4": "White is still trying to attack before developing!",
        "13... Ng6": "Computer doesn't like this move, but I think it is good, heading for f4.",
        "14. d3": "I think Nh3 is better, preventing my next.",
        "14... Nf4": "So I hop in.",
        "15. Qf3": "Qd1 or even Qd2 was better, allowing f2-f3, defending the g pawn.",
        "15... Qc8": "I put an additional attack on the g pawn. Computer prefers Nxb4",
        "16. Ne2": "At last he develops a knight! Well done!",
        "16... Bxg4": "But the pawn falls.",
        "17. Qg3": "Queen moves.",
        "17... f5": "I return to my older plan. Computer still likes Nxb4.",
        "18. f3": "Computer rightly prefers Nd2.",
        "18... Nxd3+": "So I take the pawn.",
        "19. Kd2": "This is better than d1.",
        "19... fxe4": "I take, with the plan that 20. f3xg4 is met with e3+ and 21. Kxd3 is met with e5-e4+ opening up the diagonal for my Bd6 to his queen on g3.",
        "20. fxe4": "But he takes this way instead.",
        "20... Nxb2": "I take, although computer points out that Rf3 is stronger.",
        "21. Bh3": "This is an excellent defensive move, trying to exchange my attacking pieces, but it is too late.",
        "21... Nxb4": "This opens up his king.",
        "22. axb4": "There is nothing better.",
        "22... Bxb4+": "I take with check. His king has no squares, he is forced to block with a knight.",
        "23. Nbc3": "He at last develops the knight!",
        "23... dxc3+": "I take!",
        "24. Nxc3": "He takes back. He is lost!",
        "24... Bxc3+": "I take again!",
        "25. Qxc3": "This is a mistake, in a lost position.",
        "25... Rf2+": "I played this to win the queen.",
        "26. Ke1": "Now I see a way of winning the king instead!",
        "26... Re2+": "This check drives the king onto the f file.",
        "27. Kf1": "Forced!",
        "27... Qf8+": "I am mating now!",
        "28. Kg1": "Nearly over!",
        "28... Qf2#": "And now mate finished him off! Many thanks for reading this, please rate it on the star system and leave a comment or two!"
    },
    "url": "https://gameknot.com/annotation.pl/challenge-from-charleshiggie?gm=59839",
    "gameName": "Challenge from charleshiggie",
    "players": "caestriaig (1272) vs. charleshiggie (2035)",
    "opening": "Amsterdam attack (A00)"
}