{
    "moves": {
        "1. e4 c5": "In reply to the king's pawn opening, black plays the Sicilian defence.",
        "2. d4": "Although not so powerful (as I learned later), white plays the Morra gambit.",
        "2... cxd4 3. c3 dxc3": "Black accepts the gambit.",
        "4. Nxc3": "White sacrifices a pawn but gains control of the centre and develops attack opportunities.",
        "4... Nc6 5. Bc4 e6 6. Nf3": "A form of Siberian variation is played, which could later develop in the famous \"Siberian Trap\" (where black captures white's queen), but otherwise still with potentially a better game for black.",
        "6... Bb4": "Black pins the knight, but does not threaten anything significantly (a Bxc3 exchange would leave black's knight in c6 with even less mobility).",
        "7. O-O": "White naturally castle and the knight is free to move.",
        "7... Nge7": "Black reckons it's time to castle as well, though Ne7 leaves the knight with few options to further develop.",
        "8. Be3": "White pre-empts a possible Qb6 development. ",
        "8... O-O": "As expected, castling.",
        "9. a3": "White begins to harass.",
        "9... Bxc3 10. bxc3 b6": "Preventing white's Bc5 attack.",
        "11. Qd3": "White brings the queen into the game and contemplates a potential attack on king's side.",
        "11... Bb7": "Black needs to start developing the game, but does not have too many options.",
        "12. Rfd1": "White aims to exchange queens, while capturing a pawn and leaving the rook in an uncomfortable setting for black.",
        "12... Bc8": "Black defends the weak pawn, but has wasted a move.",
        "13. e5": "Pushing the pawn to increase the pressure, while opening the white diagonal for the queen, in view of a deadly attack.",
        "13... Nf5": "Black has to block and the knight move is his best option. (Pushing the f7 pawn would have weaken the defence of the king).",
        "14. Bg5": "But that's exactly what white wants, thus attacking the queen.",
        "14... Qc7": "Black secures the queen while seeking to annihilate white's offensive by capturing the pawn in e5. NB. white's bishop remains problematic.",
        "15. Rde1": "White knows the pawn is vital, and thus defends with the rook.",
        "15... Bb7": "There's less pressure on d7 now, so black can develop his bishop (as per the original plan). ",
        "16. Rad1": "White threatens again to break the 7th row.",
        "16... Bc8": "And black wastes another move.",
        "17. g4": "White attacks, leaving few options for the knight.",
        "17... Nfe7 18. h4": "Now white is relatively free on the king's side and pushes fiercely h4.",
        "18... h6": "Black needs to remove the push white's bishop back.",
        "19. Bf4 Na5": "Gains a tempo and attacks the bishop.",
        "20. Ba2": "Note now, that Bb1 next would be a bold message.",
        "20... Rd8": "IMHO, this should have come much sooner. Nonetheless, one of the few options at hand for black.",
        "21. Bb1": "Sticking to the plan.",
        "21... Bb7": "Now the bishop is finally free to move.",
        "22. Bxh6": "White is ready to sacrifice the bishop and corner the king.",
        "22... Ng6 23. h5": "Of course, the knight is the last thing white wants on g6, hence pushes the pawn.",
        "23... Bxf3": "Black weaken's the defence of the e5 pawn, but..",
        "24. hxg6": "...loses the knight and could lead white closer to victory.",
        "24... f6": "Natural move, leaving the dangerous diagonal unusable. ",
        "25. Qxf3": "Though white's queen has more options now.",
        "25... gxh6": "I argue this was probably not the best move for black, but the mate was anyhow imminent. ",
        "26. Qxf6": "The queen captures and black resigns, seeing the mate in 2 moves."
    },
    "url": "https://gameknot.com/annotation.pl/challenge-from-paulpatras?gm=53036",
    "gameName": "Challenge from paulpatras",
    "players": "paulpatras (1484) vs. liebermann (1510)",
    "opening": "Sicilian (B21), Smith-Morra gambit, Chicago defence"
}