{
    "moves": {
        "1. e4": "I've seen rpilaud's annotations, here are my own.  This game is a reminder that in a dangerous position with both kings exposed and the queens still on the board nothing is safe",
        "1... c5 2. c3": "the alapin variation, a solid line",
        "2... Nc6 3. d4 cxd4 4. cxd4 e6": "white has centre controll for now",
        "5. Nf3 g6 6. Nc3 Bg7 7. Be3 Nge7": "simple development",
        "8. a3": "a wasted move. better is 8. d5",
        "8... O-O 9. Qd2 d5 10. e5 Nf5 11. Bd3 Nxe3 12. Qxe3 Qb6": "12...f6 is probably better",
        "13. b4 f6": "black has a slight advantage at this point",
        "14. exf6 Bxf6 15. O-O": "15. Na4 is better because it forces the queen away and heads for the c5 square",
        "15... Nxd4": "blunders a pawn",
        "16. Rac1": "fritz says this is really bad.  Better, but still losing, is 16. Nxd4 Bxd4 17. Qe1",
        "16... Nxf3+ 17. gxf3 Bd4": "17. d4 is better but black is winning by miles here",
        "18. Qh6": "an attempt at a draw.  If the Bd4 moves then after a bishiop sacrifice there would be a perpetrial check.  I forgot about my own pieces though",
        "18... Rxf3 19. Kh1": "more material blundered",
        "19... Rxd3 20. Ne2": "heading for the f4 square.  I knew that a Q and N work well together.  I thought there might be something there.",
        "20... Bxf2": "a bit risky.  To be really safe 20...Bg2 and black has no counterattack",
        "21. Nf4 Be3 22. Rce1 d4": "This is the losing mistake.  It allows white counterplay.  Correct was 22...e5!",
        "23. Rxe3": "This takes the B away for a sacrifical attack",
        "23... Rxe3": "Bad.  Fritz says that 23...Rd1 followed by capture on e3 is better.  White is better at this point.",
        "24. Nxg6": "although this looks amazing, it is only the 2nd best move.  There is astonshingly, a mate in 6. Basicly Nto h4 threatning mate on g7 abd f8.   24. Nh4 Qc6  25. Kg1 Qg2  (just to delay the mate) 26. Kxg2 Re2  27. Kg1 Rg2  28. Kxg2 gxh5 29. Rf8 mate",
        "24... Qc6+": "this sets up the Q and K which rpilaud thinks is what lost him the game.  I disagree.  As well as showing the mate in 6, he is already out of this game by a long way at this point.",
        "25. Kg1 Rf3": "it's still a mistake",
        "26. Ne7+ Kf7 27. Nxc6 Rxf1+ 28. Kxf1 bxc6": "This is a won endgame for white",
        "29. Qxh7+": "picking up a few pawns",
        "29... Kf6 30. Qh8+ Ke7 31. Qxd4 Bd7 32. Qg7+ Kd6 33. h4": "advancing the h pawn.  There is little black can do",
        "33... a5 34. Qd4+ Kc7 35. h5 axb4 36. Qxb4": "this leaves the past pawn on the -a file",
        "36... Be8 37. Qe7+ Bd7 38. h6": "keeps advancing",
        "38... Re8": "black loses controll.  The pawn will queen",
        "39. Qxe8 Bxe8 40. h7 Kd6 41. h8=Q Bd7 42. a4 c5 43. a5 Bc6": "a pawn race.  White's queen is ready for capure on c3 if needed",
        "44. a6 Kd5 45. a7 e5 46. a8=Q": "whites 3rd queen to win a B",
        "46... Bxa8 47. Qxa8+ Ke6": "this blunders a pawn",
        "48. Qc6+ Kf5 49. Qxc5 Ke4 50. Ke2": "now it is just about winning the pawn and mating the black king",
        "50... Kf4 51. Qd5 e4 52. Qd4": "zugzwang",
        "52... Kf5 53. Ke3 Ke6 54. Kxe4": "simple K Q endgame",
        "54... Ke7 55. Qb6 Kd7 56. Ke5 Ke7 57. Qc7+ Ke8 58. Kf6 Kf8 59. Qb8#": "a very good game.  Any questions to sf115"
    },
    "url": "https://gameknot.com/annotation.pl/challenge-from-sf115?gm=11780",
    "gameName": "Challenge from sf115",
    "players": "sf115 (1494) vs. rpilaud (1502)",
    "opening": "Sicilian (B22), Alapin's variation (2.c3)"
}