{
    "moves": {
        "1. d4 d5 2. c4 c6 3. e3 Nf6 4. Nc3 e6 5. Nf3 Nbd7 6. Bd3 dxc4 7. Bxc4 b5 8. Bd3 Bb7 9. O-O a6 10. e4 c5 11. e5 cxd4 12. Nxb5 axb5 13. exf6 Qxf6 14. Bxb5 Bxf3 15. Qxf3 Qxf3 16. gxf3 Bd6 17. Rd1 Bc5 18. a3 Ke7": "Crni odvezuje konja...\r\n",
        "19. b4": "Bijeli logično razvija pješaka i napada lovca..\r\n",
        "19... Ba7 20. f4": "Slab potez bijelog: sada crni konj ima puno više prostora za manevar a i nepotrebno ",
        "20... Nf6 21. Bb2": "Bijeli vrši pritisak na centralnog piješaka- ispravno!",
        "21... Rhd8 22. Kg2 Ne4": "Trebalo je  prvo 22....Rac8 i nakon 23.Bd5 h6",
        "23. Rd3": "Lovac na d3 je bilo bolje..(crni konj se mora vratit na f6 da čuva pješaka, a bijeli dobiva slobodan prostor za napredak pješaka po a i b liniji)",
        "23... Rac8 24. Re1 Nd6": "Velika pogreška crnog,sada se lovac izvlači i lagano otvara prostor pješacima...",
        "25. Ba4 Nc4 26. Re2 Nb6": "Ponovo greška crnog.sada bijeli povlači lovca i ima veliku priliku pješacima realizirati partiju",
        "27. Bb3 Nd5": "Crni pokušava jeftino zaradit :)",
        "28. Kf3 Nc3 29. Rc2 Nd5 30. Bxd4": "Bijeli se polakomio za piješaka i napravio ključnu grešku koja je prelomila partiju:crni u idućih par poteza lijepom kombinacijom vraća piješaka i to sa b linije koja je predstavljala izuzetnu opasnost!",
        "30... Nxb4": "Uzimanje pješaka sa b linije-odličan potez! Na 31.axb4 RxC8 32.Bxc8 Rxd4 crni opet vraća piješaka i bolje stoji!",
        "31. Rxc8 Rxc8": "Crni mora jest sa kulom: na 31...Nxd5 32.Rxd8 Kxg8 33.Bxa7 i bijeli ostaje s figurom više",
        "32. axb4 Bxd4 33. Ba4": "Bijeli ispravno ne želi razmjeniti lovce jer su raznobojni ,medjutim teško je sada u ovoj poziciji parirati crnom",
        "33... Rc4 34. Rd2": "Velika greška bijeloga s kojom potpisuje poraz,trebalo je 34.Rb3 Bc3 35.b5 ",
        "34... Rxb4 35. Bc2 h6 36. Kg4 Be5 37. f3": ""
    },
    "url": "https://gameknot.com/annotation.pl/challenge-from-tomoa?gm=26291",
    "gameName": "Challenge from tomoa",
    "players": "vedrano (1596) vs. tomoa (1873)",
    "opening": "QGD Slav defence (D10)"
}