{
    "moves": {
        "1. e4": "Classic opening",
        "1... e5": "My Normal response",
        "2. Nf3": "He is developing a knight and attacking my black pawn",
        "2... Nc6": "I defend my pawn and develop a knight as well",
        "3. Bc4": "Never bad this one, develops another piece and could be of use for an attack on f7 later on",
        "3... Nf6": "I choose to develop another knight and attack whites pawn at e4",
        "4. Ng5": "I have played this move a lot and want some comment on it plz???I never had an opponent playing it but here ashim does.\r\nThis move defends the white pawn on e4 and creates danger on f7 if combined with the bishop",
        "4... d5": "Blocking the bishops way and attacking him. Good move I think",
        "5. exd5": "capturing the pawn he clearly wants to maintain the pressure on f7",
        "5... Nxd5": "Capturing his pawn at d5. this block the way of his bishop and attacks his knight at g5 with my queen",
        "6. Nxf7": "He will win eventually a pawn thanks to this move",
        "6... Kxf7": "I have to capture or loose my queen or rook",
        "7. Qf3+": "He is Giving check and building pressure on my knight on d5 which I cannot move thanks to his bishop at c4",
        "7... Qf6": "I decide to move my queen between. Is he willing to exchange them??",
        "8. Qxd5+": "No he isn't he chooses to capture my knight instead I don't care as..",
        "8... Be6": "I now can attack his queen and bishop with this move",
        "9. Qd3": "He moves his queen away but defends his bishop",
        "9... Nb4": "I decide to attack  the queen to try to undo the defence of the bishop",
        "10. Bxe6+": "Exchanging the bishops sounds best now because he can't defend him proper so",
        "10... Qxe6": "I recapture with my queen notice the danger from 11...N*c2 So he cant do much with his queen",
        "11. Qe4": "Blocking the pawn move e4 which would force his queen to move now he attacks my knight Which still can't take the pawn at c2.\r\nNotice that his queen is the only piece which is developed. While I have two pieces developed but my king is exposed",
        "11... Bc5": " attacking the pawn at f2 and developing another piece",
        "12. Nc3": "He eventually thinks it is time to develop some pieces .he starts with developing his knight No real danger from him but he is developed",
        "12... Rad8": "so I decide to move one of my rooks to the center this can become dangerous. I  want to move this rook to d4 so he can no longer defend c2 and I can play 14...N*c2 and gain a pawn.",
        "13. a3": "He wants my knight gone but this move is incorrect to achieve this",
        "13... Rd4": "Know this is a good move I think I force his queen to go away and he can no longer defend c2. Now this will eventually result in mate as I saw right now.",
        "14. Qf3+": "he has to remove his queen but gives check so I cant yet take his pawn at c2",
        "14... Rf4": "I expected this move so I move my rook in front of his queen. Now he is forced to move his queen and I still threaten to take his pawn at c2",
        "15. Qh5+": "Giving again check then so I still cant take c2 ",
        "15... g6": "knew that he was going to give check there so had time to prepare my move I choose to Move a pawn in front so he has to move again with his  queen",
        "16. Qd1": "YEees he Moves his queen back to its starting position as this defends c2 and his queen is no longer threatened. notice that his knight is his only developed piece while I have got 4 developed pieces",
        "16... Bxf2+": "So I decide to use them by taking my pawn at f2 with my bishop and giving check.",
        "17. Ke2": "He Moves his king to e2 it is obvious that he shouldn't move Him to f1",
        "17... Qg4+": "Now I use my queen to give check.and build up pressure Looks rahter good now",
        "18. Kf1": "he has to go to f1",
        "18... Be3+": "So I decide to give again check",
        "19. Ke1": "He has to go back to e1",
        "19... Qxg2": "Threatening mate with the capture of whites rook at h1 and after 21e2 playing 21..Qg2 check and  22..Rf1 mate",
        "20. dxe3": "He hasn't seen it and captures my bishop",
        "20... Qxh1+": "Giving check to give mate in 3",
        "21. Ke2": "only possible move",
        "21... Qg2+": "giving check again he now clearly sees he has to go to e1 which will be followed by Rf2 mate. So he resigns. thanks for the nice game ashim.\r\nThe funny thing about this game is that I play against a guy who uses my usual starting moves with white and i defeat him. So this gives me some stuff to think about. But it was clearly that I developed much more pieces and this granted me victory."
    },
    "url": "https://gameknot.com/annotation.pl/challenge-from-ashim13?gm=12700",
    "gameName": "Challenge from ashim13",
    "players": "ashim13 (1410) vs. wouter357 (1357)",
    "opening": "two knights defence (C57), Fegatello attack, Leonhardt variation"
}