{
    "moves": {
        "1. e4": "New to the network of chess and having not played in years, I go with the tried and true (and later I find out it was Fischer's favorite) e4.",
        "1... c6": "To my untrained eye this is a curveball.  No doubt intended to set up d5.",
        "2. d4": "I jump into the middle with both feet.",
        "2... Nf6 3. Nc3": "e4 contested and defended.",
        "3... e6": "Prepares for d5 and to do battle for the middle.",
        "4. Nf3": "Nice looking fortress I've built but will it hold?",
        "4... d5": "A minor explosion to happen in the Battle of Center Squares.",
        "5. exd5 exd5": "We end up in the opening: French Exchange Variation (C01). For the moment both kings are exposed.",
        "6. Bd3": "Develop my bishop and make room for coming O-O.",
        "6... Bb4": "The old pin the knight against the king trick.",
        "7. Qe2+": "Push the Queen to the second rank and harass the king a bit.  Arguably should have developed the bishop to d2 to parry Bxc3.",
        "7... Be6 8. O-O Bxc3": "Now I wish I had my bishop on d2 so as to not to have to double up my pawns.",
        "9. bxc3": "Not so pretty.",
        "9... Qc7": "? Queen properly positioned on second rank with two diagonals available.  But should have castled first?",
        "10. Ba3": "Aiming to complicate her efforts to castle and now own the long a3-f8 diagonal.  As a bonus, my rooks now connected.",
        "10... Nbd7": "Maybe a queenside castle...",
        "11. Rfe1": "Pointing my rook at his king and making a claim on the e-file.",
        "11... O-O-O": "Gives PINK a claim on the d-file but king a bit exposed.   We've castled to opposite ends of the board which usually suggests some exciting attacks on the kings no doubt simultaneously.",
        "12. h3": "Guarding g4 from unwanted intrusion.",
        "12... Kb8": "PINK's king digs in but loses a tempo.",
        "13. Ng5": "Threatens fork and the heart of black's network.  At this point black's position is cramped and largely immobile. I believe white has a slight lead in development, space and position.",
        "13... Rde8": "Doubles protection of e6.",
        "14. Nxe6": "? Bold move that may only help black, loosening up PINK's cramped position and giving up a strong knight.",
        "14... Rxe6": "Black has the upper hand for the moment.  The knight attack seems now ill-timed.",
        "15. Qd2": "? My fine position has been reversed.  My queen's stuck in a closet and PINK has equal access to the e-file. Black has options: Ne4.  For white, Qf3 may have been the better choice making e4 & h5 uninhabitable for black's knight.",
        "15... Rxe1+": "? Gives the e-file back to white.  Why not Rhe8?",
        "16. Rxe1 Ka8": "King goes all the way down the rabbit hole.  Another tempo lost? Looks like Black queen getting ready to engage the enemy.",
        "17. c4": "If he takes my pawns are undoubled and my B advances to c4.",
        "17... h5": "Can't use the e-file so will lift rook via the h-file while preparing for a future pawn assault on white king's defense.",
        "18. Qb4": "Queen takes aim at b7, e7 and d6.",
        "18... g5": "Storm brewing on the eastern front.  Do I engage and or let it come to me?  After analysis I elect to parry PINK's attack as it comes.",
        "19. Bf5": "Add's pressure to black's middle. Black's knight's vulnerable on f6.",
        "19... Qf4": "Threatens undefended pawn on d4 and eventual attack at f2.",
        "20. Bxd7": "It's the beginning of a series of exchanges.",
        "20... Nxd7 21. Qe7": "I should get at least a pawn and freeze black's rook because of threatened mate.",
        "21... Nb8": "A shield?",
        "22. Bd6": "Aiming to to back the black queen away from white's king while threatening two-pronged attack on king.  Now PINK's rook and knight are pinned to king's defense.",
        "22... Qxd4": "Steals a pawn and opens up a golden opportunity for Be5.",
        "23. Qxf7": "But white is so focused on what he's doing he does not see Be5. Black teals a pawn back - the score is still zero.",
        "23... dxc4": "Black cleverly gets a pawn and attacks my undefended Bishop.  But we are both missing the obvious:  Be4.",
        "24. Bxb8": "All I can say is I am totally focused on mounting some combination against the king I cannot see Be4.  Lesson learned... scan the table, every piece, every potential attack, every turn!",
        "24... Rxb8": "This is where I wanted to go.  Now my rook threatens w e8.  We exchange rooks and I mate with Queen. But...",
        "25. Qxh5": "I know PINK won't hit my rook first for that would be mate.  If I attack RxR.  At best I can chase the king around the table for he escapes to c7. So I nab a pawn to keep the score even.",
        "25... Qd2": "My attack has run out of gas for the moment so PINK pressures white.",
        "26. Re8": "I decide to give it go and hope for a blunder.  But Qe2 would be interesting.  After an exchange of queens I might beat black to the pawn promotion. Another more provocative option is Qe8, offering my queen to black.  A temptation that will lead to mate for white if indulged.",
        "26... Qxc2": "Instead black kills another pawn.",
        "27. Qh8": "I hope now to gain black's rook.",
        "27... Qd1+": "A check is always a beautiful way to buy time and reposition your defense.",
        "28. Kh2 Qd6+": "Now we are between a rock and hard place.  My attack is thwarted and all remaining pieces are locked up in attack and defense.",
        "29. Qe5": "Seeing no option, I go for the queen exchange.",
        "29... Qxe5+ 30. Rxe5": "Now to push pawns and stop his.",
        "30... b5": "Black sees the prize and begins the race. Black has what is now a huge one pawn advantage.  Sometimes grabbing a pawn early pays big later.",
        "31. Rc5": "My best effort to complicate things for black. But all I did was lose a move.  Better to jump to e1 then cut left to block any promotion.  But the black pawns outnumber my own and are further advanced.  A bad combination.",
        "31... Rb6": "Black may have done better to bring out the king to dislodge my rook and run her rook to the d-file.",
        "32. Rxg5": "Clear the way for my own.",
        "32... c3": "You can see the sweat on white's brow now.",
        "33. Re5": "Not far enough this time.  Should have gone to c5 making black's pawn progress difficult while my own raced unimpeded up the sidelines.",
        "33... Ra6 34. Re1 Rxa2": "This is a game where pawns made the difference (and missed opportunities on my part).  I resigned here but later analysis says I should have a gone a few more moves to sees black's plan.  Who knows, with a little help from black I may have salvaged a draw or better.  Certainly my rook is better positioned to defend and block than block's."
    },
    "url": "https://gameknot.com/annotation.pl/challenge?gm=16533",
    "gameName": "Challenge",
    "players": "honeybrook (1200) vs. prettyinpink17 (1372)",
    "opening": "Caro-Masi defence (B12)"
}