{
    "moves": {
        "1. d4 Nf6 2. Nf3 g6 3. h3": "A loss of time, probably. The idea is I can play Bf4 and then retire it on h2 after Nh5, because I don't want to exchange it in my scheme of playing. \nNow, it works with some black schemes, but not with the one used my opponent in this game. So the move is useless. More specificly, when black plays d5 and e6, my black square bishop has a strong action on the diagonal h2-b8, but he hasn't played those moves yet.\n\nProbabilmente una perdita di tempo. L'idea è quella di giocare la mia solita Af4 potendo poi ritirare l'alfiere in h2. ",
        "3... Bg7 4. Bf4 d6": "Still the bishop on f4 prevents e7-e5, so it is not useless in this square. ",
        "5. Nbd2": "This move works on schemes where the black's black-squares bishop can act on the f8-h3 diagonal, because it leaves the possibility of c3, creating a strong pawn wall. But this is not the case. Still, c3 is a good move for white to block the g8 bishop. But the style of playing is too passive for white. \n\nGiocata irriflessivamente. Dato che l'alfiere nero è lontano dalla diagonale a3-f8, non è necessario essere così passivi. Sarà questo lo sbaglio?",
        "5... c5 6. e3": "After c5xd4, e3xd4 allows white to build, with c3, the block against the g8 bishop. But it leaves the diagonal open to the black's white square bishop in b7 (this happened in this same game). White should have had the ability to reply d5 to this move, so Nc3 was needed, no matter the pressure on the black diagonal.\n\nL'idea è sempre quella di costruire la fortezza complementando questa con c3, e poi giocare a spingere i pedoni sul lato di re. Ha funzionato molte volte. ",
        "6... O-O 7. Bd3": "Against the black scheme, the white bishop is useless in this square. I played it just to avoid black's Bf5, but I have lost the initiative already, since I am defending (with white pieces, and in the 7º move!).\nMoreover, the black's white squares bishop has a much better place to go. \n\nI have already \"lost\" the game, strategically speaking!\n\nForse qui non si vede bene il piano d'attacco del bianco. Evidentemente, voglio impedire Af5.",
        "7... b6 8. c3": "The only reasonable move here would have been c4, in order to fight for d5!",
        "8... Bb7 9. Qc2": "Looking for an attack via the h pawn, aiming to h7. But it is a bad idea, because  to build it it takes too much moves.\n\nQuesta \"doppietta\" si schanta contro un muro, ma l'idea è, prima o poi, spingere il pedone in h ed eventualmente sacrificare la torre per il cavallo in h5.",
        "9... Nbd7 10. O-O-O": "Unaware of my disadvantage, I secure my king on the wrong side, with the idea of getting both my rooks on the h5 diagonal (and even to play h5, and if Nxh5, RxN).\n\nProseguendo il mio piano, devo portare l'altra torre in posizione e mettere al sicuro il mio re. Evidentemente, il piano è fasullo. Normalmente, in questa posizione l'alfiere nero in b7 è bloccato dal mio pedone in d5, ma qui non l'ho portato. E adesso la gran diagonale soffre. Ho già quasi perso. ",
        "10... Rc8": "But the black tempo advantage is clear. He comes first to attack.\nc4 gets my white squares' bishop away of the desired diagonal, so I had to look for another way to use it.",
        "11. Bb5 Rc7": "Having changed my plan, I should have taken some initiative by playing Qa4, taking it away form the weak c column. It is not a good plan, but better than the one I choosed.\n\nAltro piano fasullo, scambiare l'alfiere bianco. Dovevo giocare Da4, approfittando che non poteva subito fare a6. ",
        "12. Bxd7 Nxd7": "Now I am helpless on the queen side. \n\nAnche qua ho considerato Da4, ma adesso sí che poteva rispondere bene con a6.",
        "13. Kb1 Qa8": "Probabilmente, questa mossa è più tematica di quanto pensavo. ",
        "14. Rhe1": "Piano fasullo, perché comunque non posso spingere il pedone in e4 per C5xd4.",
        "14... Rfc8 15. Ng5": "Disperatamente, ho cercato qualche sbocco.",
        "15... h6 16. Nge4 b5 17. f3": "\"devo\" perdere tempo per consolidare la mia posizione, quando l'attacco del nero diventa inarrestabile. ",
        "17... a5 18. dxc5 Nxc5 19. Nxc5 Rc7xc5": "Cerco di scambiare pezzi per smorzare la situazione, ma non ci riesco. Ho voluto sbloccare il mio cavallo...",
        "20. Nb3 Rc5c7 21. Nd4": "This was a move that took a lot of thinking. I made up a plan to exchange pieces and take time in order to counterplay. I was calculating that he cannot play the fork e7-e5, because of Nxb5, etc. But he replied with another move I didn't see, that leaves me resourceless.\n\nQuesta mossa è epica. Ho perso moltissimo tempo a calcolare e7-e5, e ho visto che riuscivo a sopravvivere decentemente. Immaginiamoci il rischio... e i miei calcoli sono stati buoni! Infatti, NON ha risposto e7-e5. Ma quello che non ho visto è stata la semplice...",
        "21... Ba6": "E adesso sì che minaccia e7-e5. E io, cos'ho ottenuto?\nQuesto l'insegnamento (oltre all'apertura).",
        "22. Bg3": "Triste, ma non sono riuscito a vederne una migliore. ",
        "22... b4 23. Qe4": "Cambiare le donne, anche a costo di un pedone raddoppiato, con l'idea di spingerlo, eventualmente, in e5, anche perdendolo, pur di accecare l'alfiere nero. ",
        "23... Qxe4+ 24. fxe4 bxc3": "Ormai sono perduto. Se b2xc3, scopro il re, e con gli scacchi di torre e l'alfiere bianco... però, avrei resistito comunque meglio. Non guardiamo, per favore, la seguente mia mossa, perché mi vergogno. ",
        "25. b3 c2+": "E qui non mi sono arreso per il pezzo di meno, ma perché comunque non avevo sbocchi né speranze di fronte all'attività dei pezzi neri. "
    },
    "url": "https://gameknot.com/annotation.pl/challenge-from-damalfi?gm=17144",
    "gameName": "Challenge from damalfi",
    "players": "damalfi (1675) vs. ddusa (1782)",
    "opening": "King's Indian (A48), East Indian defence"
}