{
    "moves": {
        "1. e4 e5 2. Nf3 Nc6 3. Bc4 Nf6 4. Ng5 d5 5. exd5 Nxd5 6. Qf3": "A lot of theory was written about this kind of game. I don't know it as I should, but it is normal to think about 6. Nxf7 first. If the king takes the knight, Qf3+ recovers the piece. If you play something like Qf6, 7. BxNd5, and I think it is worse for black. \nBlack should think about something like 5. ..., Na5. \nA very tactic position. I don't play it because if I want to, I know I have to read a lot.",
        "6... Qxg5 7. Bxd5 Qg6 8. Be4": "Probably better for white BxN, leaving black's pawns doubled and isolated (with or without the queens).",
        "8... f5": "Pure adrenalyne. ",
        "9. Bd5": "Same as before. I don't see what other advantage can white have from the position. ",
        "9... e4 10. Qc3": "Or Qb3, to press on b7 and/or f7. If black answers Na5, Q+, and it is the same story - getting a doubled + isolated pawn.",
        "10... Bd7": "Black has considered Bb4, for sure... would the queen chasing lead to somewhere? :-). Maybe just some developement. ",
        "11. Bxc6": "Too late. White sees Qe4+, since after it the queen can take g7 or c7, but...",
        "11... Qxc6 12. Qe5+ Be6": "Smart, but it kind of demostrates Bd7 was a waste of time. ",
        "13. Nc3 O-O-O": "Of course.",
        "14. Nb5 Bc5 15. b4 Qxb5": "Losing a piece, since white has a check. Better would have been the \"quiet\" Bb6. White would have had a nice attack, here. ",
        "16. Qxe6+ Kb8 17. bxc5 Qxc5": "A piece is lost. Nevertheless, black has some compensation, and now it is his turn to attack. ",
        "18. Bb2": "Isn't white seeing Qxc2, threating Qxd2+?",
        "18... Qxc2 19. Bc1": "Horrible, being possible to play Bc3.",
        "19... Rhe8": "Hmmm... with the couple of white's inaccuracies, the black position starts to be very interesting.",
        "20. Qf7 e3": "White realizes he cannot take the pawn: fxe3, Rxe3+ and white cannot take it back because of Rd1#. ",
        "21. O-O": "Interesting is e2, 22. Re1, Qd1, 23. Bb2, but fails because now black cannot play Rxd2 due to Qxe7+...",
        "21... exd2 22. Bxd2 Qxd2": "And the piece is back, with advantage...",
        "23. Qxf5": "Just a pawn, and the position is open. Incredibly, the storm vanished but black can be proud ;-)",
        "23... g6 24. Qf7 Qd7 25. Qb3 b6 26. Rad1 Qe7 27. Rdc1 a5": "I think that black must have tried to get the 2º row. \nIn case he wants to throw its pawns, c5... but it is not really relevant. Still...",
        "28. g3 Kb7 29. Rfe1 Qg5 30. Qc3": "Black must react to the c2 threat, here... Maybe he thinks that it leads nowhere, and just wants to simplify (the best way to win, here).",
        "30... h5": "So, probably this move is a way of tempting him. But Qxc7+, then simply retreat, is just a plain pawn loss. ",
        "31. Rxe8 Rxe8 32. Qc6+ Ka6": "And white loses his chances to recover the pawn. ",
        "33. Qxe8 Qxc1+ 34. Kg2 Qc2 35. a4 Kb7 36. Qg8": "...and now he loses another one. He can recover it, but on the wrong side... black's pawns are equal to a rook, in value...",
        "36... Qe4+ 37. Kg1 Qxa4 38. Qxg6 Qd1+ 39. Kg2 Qg4 40. Qd3 a4 41. f4 c6 42. Qh7+ Ka6 43. Qd3+ b5 44. f5 Qg5 45. h4 Qh6 46. Qd4 Qc1": "It is difficult to see the followings. By now, the game is even, since the distance to promotion is the same for both pawns!",
        "47. f6": "Can white support this pawn?",
        "47... Qc2+ 48. Kh1 a3 49. f7": "Can white support this pawn? Has he another choice?",
        "49... Qb1+ 50. Kh2": "Not with this move. With Kg2, Qa2+ would be answered with Qf2, and black... is lost, I think! Funny, isn't it?",
        "50... Qa2+ 51. Kh1 Qxf7 52. Qe3 b4": "Black must be careful with a perpetual trap. Qf1+, Kh2, a2 doesn't work because Qa3+...",
        "53. Qd3+ Ka5 54. Qd8+ Kb5 55. Qb8+ Kc5 56. Qa7+": "A pity. It would have been a good lesson for black to go on until the win. Overall well played, thoug. ",
        "56... Qxa7": ""
    },
    "url": "https://gameknot.com/annotation.pl/challenge-from-davidwh86?gm=31037",
    "gameName": "Challenge from davidwh86",
    "players": "davidwh86 (1331) vs. pawnstar2010 (1462)",
    "opening": "two knights defence (C57), Lolli attack"
}