{
    "moves": {
        "1. e4": "Normal.",
        "1... e5": "Normal",
        "2. Nf3": "Normal.",
        "2... d6": "Still normal, though Nc6 is more common.",
        "3. Bc4": "Developing. ",
        "3... h5": "? This is where black starts to go wrong - I prefer Nf6, attacking the undefended e-pawn. Perhaps he was thinking about attacking down the kingside.",
        "4. Nc3": "Again, developing.",
        "4... Qd7": "?! Again, I prefer Nf6 or Nc6 or even Bg5 - this odd queen move blocks in the bishop and leaves a chance of a pin on the diagonal.",
        "5. Nd5": "! I give this move an exclamation since it ties the queen down to defending c7. ",
        "5... Qa4": "?? Oh dear - this leaves c7 vulnerable and wins a rook - but it also wins the queen. Not 6. Nxc7!? which looks obvious but ...",
        "6. Bb5+": "The perfect fork - watch out for this in your games, it comes across a lot.",
        "6... Qxb5": "Black has no choice, but to take.",
        "7. Nxc7+": "And Nxc7! - winning a pawn and queen for the bishop - a lovely tactic: I came across this in 'Chess Tactics for kids' and it is rather good. And a rather good family fork.",
        "7... Kd7": "I prefer Kd8.",
        "8. Nxb5": "And the knight chomps away the queen.",
        "8... a6": "No surprise, but I think black should be thinking about developing here.",
        "9. Nc3": "I retreat.",
        "9... h4": "Again, a pointless move - why not play Nf6?",
        "10. d4": "I open up the centre.",
        "10... h3": "I think black is seriously into attacking the kingside. ",
        "11. g3": "gxh3 is okay, but it opens the line for the rook, so I just played g3. ",
        "11... Be7": "Finally developing.",
        "12. dxe5": "I take the pawn, and the pawn can't take back since it is pinned.",
        "12... Ke6": "I think the king is just waiting to be attacked.",
        "13. Qd5+": "This bold queen move makes the king retreat.",
        "13... Kd7 14. exd6": "Note if Bxd6 then e5! wins the bishop.",
        "14... Bxd6": "Unfortunately, he doesn't see this.",
        "15. e5": "e5!",
        "15... Ke8": "The king retreats - probably the safest move.",
        "16. Qxd6": "So I take the bishop.",
        "16... Ra7": "This leaves the knight undefended - I could have gobbled it up, but I was more focused on a mate.",
        "17. Nd5": "This subtle move threatens 18. Nc7#.",
        "17... Nd7": "I think this move was just to save the knight, but this annoyingly prevents mate, since the king as d8 as a flight square - ",
        "18. Bg5": "- so I take it away.",
        "18... Ndf6": "An outright blunder - first of all, the pawn could take it, and, though I am not criticising my opponent, this falls for Nc7#. Which I gladly played.",
        "19. Nc7#": "Nc7# - thank you for watching - please give any constructive comments if necessary. @oodle3#"
    },
    "url": "https://gameknot.com/annotation.pl/challenge-from-oodle3?gm=57336",
    "gameName": "Challenge from oodle3",
    "players": "oodle3 (1200) vs. tk29560 (597)",
    "opening": "Philidor (C41), Steinitz variation"
}