{
    "moves": {
        "1. e4 c5": "So Ladies and Gents, my first annotation at Gameknot... comments appreciated, but go easy on me ;-)\nI'm opening against Russ who kindly challenged me to a game; playing it safe with e4; against someone who is +300 odd rating points, I'm not going to be experimenting. Russ suggested we try out the Sicilian. ",
        "2. Nf3 d6 3. d4 cxd4 4. Nxd4 Nc6 5. Nc3 e5 6. Nb3": "Retreating queenside after 5... e5. I had expected an exchange variation with 5... Nxd4 forcing me to get my queen out which black could use to gain time",
        "6... Nf6 7. Be3 Be7 8. Bd3": "Both sides preparing to castle kingside. Apart from that I'm adding protection to e4. Reflecting though, e4-e5 are locked and e5 is pretty secure for the moment with protection from c6 and d6. Basically relies on ... Nxe4 in order to free up the bishop on the kingside. That said, the position of the knights is blocking any support for Bc4. Bb5 just ends badly. Perhaps Be2?",
        "8... Be6": "At this point in time I didn't see it, but the bishop positioning by black ends up skewering my queen-side once the game opens up",
        "9. O-O O-O 10. Nd2": "Both sides completed castling. I wasn't happy with the position of both knights queenside. Controlling a lot of squares, but I couldn't see any plan how to advance. Was also worried about doubled pawns after ... Bxb3",
        "10... Nb4": "...and leaving a hole for ... Nb4. Nice offensive position for the black knight. With hindsight it would have been to kick it immediately with b3.",
        "11. Nc4 Rc8": "11. Nc4 Potentially attacking blacks pawns, but not a solid position for the knight. Black claiming the semi-open file and putting pressure on the newly occupied c4 square",
        "12. b3": "I thought protecting the knight with a pawn would defer Bxc4. Black has taken the initiative.",
        "12... d5 13. exd5 Nfxd5 14. Nxd5": "forced after b2-3 leaving the knight unguarded",
        "14... Qxd5": "Giving up a very good position to the black Queen",
        "15. a3 Nxd3": "15. a3, Now finally deciding to kick the black knight (but probably too late).\nWith a fairly open structure and well positioned bishops, the exchange was probably attractive for black",
        "16. cxd3": "shying away from the potential queen exchange and hoping that if the exhange between rook or bishop would occur I could close down on the open file. Qxd3 would have still led to a split in the pawn chain after an exchange of queens",
        "16... b5 17. Nb2": "...b5 forcing a retreat for the knight. the only real option I think, but not a good one!",
        "17... a5": "This caught me off guard. It was about now that I really noticed just how much pressure I was under. In 2 moves black has gained an enormous amount of space and those bishops are bearing down a3&b3",
        "18. a4": "Desperate to halt the rush",
        "18... Rc3": "losing b3",
        "19. axb5": "miscaluclation. trying to cut down the advancing pair and allow my rook to put pressure on a5. but after Rxb3 I will lose b5 and the influence my rook has there",
        "19... Rxb3 20. Qd2": "choosing to use the queen to cover the knight and simultaneously put pressure on a5",
        "20... Bb4": "which of course allows the dark squared bishop to take an active part. ",
        "21. Qc2": "not a wise move. With the light squared bishop guarding Rc8, all I've done is given black an opportunity to lay claim to another open file",
        "21... Rc8 22. Nc4": "The idea was to take the knight to a protected square and block the open file",
        "22... Rxd3": "although when the support gets taken out...",
        "23. Rfd1": "trying to pin the rook",
        "23... Rxd1+ 24. Rxd1": "Exchanging and putting pressure on the black queen. Although I missed the following exchange",
        "24... Qxc4": "Losing material",
        "25. Qxc4 Bxc4": "putting both bishops right in the thick of things. Also making it virtually impossible to stop the a-pawn advance. Barring a blunder or outright mistake from black, I can't see a way to eke out a draw now",
        "26. Rc1": "pinning the bishop. trying to for the bishop exchange with Bd2 would have been an option, but it would just lose out to ... Rd8",
        "26... a4": "and the advance begins",
        "27. b6 Ba6": "b6, trying to force the rook off the c-file. The bishop retreats halting the pawn advance, but the rook exchange is terrible for me",
        "28. Rb1": "moving on to the b-file, trying to kick the bishop, advance my pawn.",
        "28... Be7 29. b7": "28.... Be7, bishop retreating. b7, Pawn advancing. Bxb7 is not possible for white at the moment, he needs Rb8, which would temporarily give me reprise from his rook.",
        "29... Rb8": "but not with enough time to remove the a-pawn (Ra1 Rxc7 leaves my rook pinned on the 1. rank to avoid mate)",
        "30. Ba7": "desperation",
        "30... Rxb7": "from here we are just going through the motions. As long as the dark squared bishop covers f7, even a lucky punch getting my rook onto the 8th rank won't lead to mate.",
        "31. Bb6 Bd3 32. Rb2 a3 33. Rb3 a2 34. Rxd3 a1=Q+ 35. Rd1 Qxd1#": "congrats and thanks to Russ for taking the time to play me. All in all I'm not entirely disappointed with my performance in the game, I was throroughly outmanouevred in the middle-game only realising Russ's plan when it was too late. But I'll need to go back to the opening position, it left me in a real quandry how best to proceed with the attack"
    },
    "url": "https://gameknot.com/annotation.pl/challenge-from-russ20124?gm=61030",
    "gameName": "Challenge from russ20124",
    "players": "bitter_man (1342) vs. russ20124 (1788)",
    "opening": "Sicilian (B54)"
}