{
    "moves": {
        "1. e4": "As usual - good move - but make sure you have a plan based on e4",
        "1... e5": "equal position with foothold in the centre - but white has the move",
        "2. Nf3": "development with a threat",
        "2... Nc6": "development with defense",
        "3. Bc4": "good developing move, opens up for 0-0",
        "3... Bc5": "likewise development - note black is still a move behind on the Kside",
        "4. d4": "Probably too aggressive too early. Bxp wins N and p for the B,  I'd prefer you to play a specific opening understanding the moves, their sequence, and their intent. Ask yourself - is this move part of my opening plan ! If not why are you playing this. If it is part of a plan, you need to reconsider that plan, or else force some advantage in the next sequence of moves.",
        "4... exd4": "This was thoughtless at best and I apologise. It is bad because 1. I give up a hold in the centre 2. it blocks the B 3. it semi-opens the e file 4. f6 becomes vulnerable to e5",
        "5. Bg5": "always good to develop with a threat - it cuts down options for a response",
        "5... Nf6": "best of a bad lot !  If white exploits this advantage the black position will be messed up, and worse, if not defended accurately.",
        "6. O-O": "e5 straight away maintains the pressure. \"Strike while the iron is hot\" \"Never look a gift horse in the mouth\" or even \"Don't give a sucker an even break\" spring to mind",
        "6... h6": "I have the time now to defend",
        "7. Bxf6": "Not bad - but I think I did well to swap a dodgey N for a good B.",
        "7... Qxf6": "Not out of the woods yet, but I can see more daylight",
        "8. a3": "I expected e5 again. You really are not exploiting your advantage at all.",
        "8... d6 9. Bd5": "B was fine on c4 - you need to develop your other N, and look at the vulnerability of b2 and R on a1",
        "9... Ne5 10. b4": "The B on c5 is not great because it is blocked by d4 - you are opening a vulnerability on b2 and a1, pushing pawns making them weaker, moving Bc5 onto a better square ???",
        "10... Nxf3+ 11. Qxf3 Qxf3 12. gxf3 Bb6": "Now your pawns are messed up, structure is weakened, K is exposed, N not developed, c2 is a problem, etc.",
        "13. f4": "You should be looking at Nd2, or Re1, or even c3. In a position like this, think about moves that improve the situation, develop your N, get R on e or g file, connect Rs, resolve the constraint of d4, etc.  I presume you are preparing for e5, but even if you play e5 next after pxp, pxp, you will have an unsupported p on e5, and you don't want to play f4 to support it.  Re1 would be better ",
        "13... c6 14. Bc4 O-O 15. b5": "Again a pawn move achieving little. You really need to think about N development and activating Rs. When you are not sure what to do, resist pushing pawns !  I know you are hoping for pxp but it is always better to improve your own position than hope your opponent will disimprove theirs.",
        "15... Bh3": "develop with a threat and accentuate the hidden pin on f2",
        "16. Re1 Rfe8": "now threat is d5 and the R on e1 is vulnerable",
        "17. Nd2": "at last N into action and the two Rs connected - but it is a pity about 15. b5 opening the black diagonals",
        "17... Ba5 18. Red1": "Ra1-d1 might be worth a look but black is beginning to ask more and more questions and it all comes from your weak pawns and slow development",
        "18... Bxd2 19. Rxd2 Rxe4 20. bxc6 bxc6 21. f3": "At this point your pawns are unconnected and will be easily picked off, you are down 2 pawns, you are worried about Ra8-d8, so not too many good options, but I'll not repeat again about pawn moves. ",
        "21... Rxf4 22. Rad1 c5 23. c3": "I think there are two lessons here - one, about not pushing pawns and two, always try to play the strongest move (never a speculative, lay a trap, hope for a blunder type move).  When you are not sure of the position, look harder (and resist pawn moves) !  \r\nHere, your f3 is vulnerable, your B is vulnerable, you must have looked at Bd5 ? ",
        "23... dxc3 24. Rd2xd6": "When you realised you had made a mistake and the B looks lost, you should have looked hard to soften the damage. If you didn't have Bd5 to threaten R on a8, or if you didn't see that, you should have played Bxf7  before Rxd6 ",
        "24... Rxc4 25. Rd6d8+": "and here goes more material off the board - so black's advantage grows by the move",
        "25... Rxd8 26. Rxd8+ Kh7 27. Kf2": "You needed to play Rd1 to stop ther advancing c3",
        "27... c2 28. Kg3": "This is not going anywhere. If you are to delay mate, you should consider what is coming now c1=Q and Qg5 and Rh4   ",
        "28... c1=Q 29. Kxh3 Qg5 30. f4 Rxf4 31. Rh8+ Kxh8": "Thank you for the game. I hope you found the comments helpful. Did you check my annotation of the game ?  You did not ask any questions as we played, but feel free to check back over the game and ask any question. \r\nGoing forward, I strongly recommend a few points to you. \r\n1. Try to play one recognised opening all the time. Get to know the reason for those moves, recognise the positions that arise, understand the strength and weakness of those positions. This will help you play to a plan through the opening and into the middle game. \r\n2. Write down the moves you are considering. Note the good/bad points you see for each move. Turn the board and look at each move from the other side. Most important, double check your move is not a blunder BEFORE you submit it.\r\n3. Stop moving pawns unless/until there is a definite advantage on offer. Think of  your pawns as a power unit, much stronger side-by-side, a team that offer mutual support, weak when isolated or forward. When you are tempted to move a pawn now, look hard at piece moves that strengthen your position, look for weaknesses on the otherside that you can exploit, even indirectly. Pay attention to your overall position.\r\n4. Give more time and concentration to your moves. In practice, you may need to analyse with particular care and depth at particular times in every game. For example, at the end of a familiar opening sequence, when your opponent makes an unexpected move, when you make a mistake, if you get a sense that there is an opportunity or challenge, and, of course, when you are not sure what to do.  \r\n"
    },
    "url": "https://gameknot.com/annotation.pl/challenge-from-tanp?gm=15702",
    "gameName": "Challenge from tanp",
    "players": "elevinski (1192) vs. tanp (1973)",
    "opening": "Giuoco Piano (C50)"
}