{
    "moves": {
        "1. e4": "A \"Walking the Walk\" club game.  A notable aspect of this game is that black's king moved a total of ONE time the entire game.  Up until move 36 (the point at which white would have resigned in a non-club game), white's king moved 7 times.  That contrast along with a few other time-wasting and questionable moves by white played a large part in the game.  Black slowly developed a stronger position and then gained the initiative, probably over the course of moves 12 to to 20, with white's move 16 perhaps being the turning point. ",
        "1... c6": "Having never played against a Caro-Kann defense, I am immediately in foreign territory. ",
        "2. d4 d5 3. Nc3 dxe4 4. Nxe4 Bf5 5. Ng3 Bg6 6. Nf3": "An interesting but strange opening.  ",
        "6... Nd7 7. h4": "a standard move suggested by the game database.  very non-intuitive for me.  tried for some time to understand the value of the move.  Other than the influence on black's lsb, it will also hinder black's pawns and therefore limit space.  a potential support post and can also attack. comments?",
        "7... h6 8. Bd3": "another standard move.  I didn't really want to give up the B.  but I planned to castle long and so didn't mind removing black's B, lifting Q off back rank in the process.",
        "8... Bxd3 9. Qxd3 e6": "this kingside pawn fortress holds unchanged to the very end of the game.",
        "10. Bd2": "prevents Qa5+.",
        "10... Ngf6 11. O-O-O Be7": "If black is setting up to castle opposite, and wasn't a master, I'd think it was a bad idea.  White has 6 pieces to deploy in that direction.  On the other hand, that same number of black pieces could be bearing down on white soon enough.",
        "12. Bc3": "thought about putting rook on e.  but I can do that anytime and e is pretty closed down at the moment.  Bc3 puts some general pressure on black's kingside, ...could perhaps influence black to castle same side, though at this point I'd be happy with either game.  also thought about Be3, and then bringing rook in behind. Passed on Ne4 to conserve pieces.  Plus that might have been playing in to an endgame that black may be working toward.  Is the Caro-Kann known for having a small middlegame?   ---around this time (moves 12 to 17), black perhaps comes to have a better position.  this by subtle moves on his part and subtle mistakes on mine (or not so subtle?).  how did black's better position come about?  ---I note that this move, 12. Bc3, does turn out to be no good and only wastes important time that could have been put to better use.  ",
        "12... O-O": "signs of trouble.",
        "13. Rde1": "saw no better move here and reasoned that this rook could be happy practically anywhere on e, ...with the 4th and 5th rank having \"some\" \"potential\" for lateral travel.  white's overall position appears good from the standpoint of mobility and influence on center.  a bad assessment of white's position?  I can see that black rooks are now free to cause white trouble.",
        "13... c5": "amazing all the game-changing possibilities that COULD follow this move.  pxp looks like a bad idea that would open up black's game and put white on the defensive.  meanwhile, there are temptations elsewhere on the board (14. Ng5 hxg5, 15. hxg5 and similar) ...that the master would never fall for. ",
        "14. Ne4": "frees up white's pawns to advance, which they never do.",
        "14... Nxe4 15. Qxe4": "chose queen's greater mobility over rook for recapture.  don't like that it invites a reload of black's knight to f6, ...with associated improvement of black's overall position (more centralized N; d-file now open for Q) and harrassment of white's queen.  black's b-pawn is a temptation but could be tainted. ",
        "15... Nf6": "as expected.",
        "16. Qxb7": "even though I didn't want the complications and lost time associated with extricating myself after this capture (not to mention that the b-file will soon be controlled by black), I reasoned that the benefits of breaking black's queenside pawn chain would outweigh the negatives.  I expect black was no more concerned with my capturing the pawn than he would have been if I had stayed away from it (perhaps he wanted me to take it, and maybe the a-pawn as well).  having castled \"into trouble\" before, I note that my king is somewhat well positioned to move to the center or right (I realize the folly of this, now).  better to leave black's pawns alone here, ...to inhibit his heavy pieces?   ",
        "16... Rb8 17. Qa6": "...some interesting but never realized possibilities for the white Q along 6.  ",
        "17... Nd5": "white has to choose among less than great options here.  perhaps, as already noted, 12. Bc3 was a bad move.  and perhaps 16. Qxb7 did little but give black ownership OF b.  ...wastes of time w/assoc'd costs?  still, the two sides seem relatively even here.  comments?",
        "18. Bd2": "lost time from 12.",
        "18... cxd4": "black completes paving on a nice stretch of two-lane highway along b and c.  ",
        "19. Re4": "while useful for defense and for potential attack, this move also proves to be a liability as the rook comes to need inconvenient protection later.",
        "19... Qc7 20. Nxd4": "NxP. ",
        "20... Rfc8": "expected.  and nullifies one attack idea, 20. ...not-Rfc8; 21. Nxe6, fxe6; 22. Qxe6+, Kh7; 23. Qxd5.",
        "21. Qd3": "the white Q has to come back, letting go of the interesting option to cross along 6 (preceded by capture of e and/or h pawns) in an attack sequence.  nice job by black keeping such plans suppressed just enough that they NEVER come about.",
        "21... a5 22. a3 Qb7": "cripes, 5 black units trained on b4.  ---from move 18 to 25, I wanted to take out black's e & h pawns, ...for the resultant weakening of the king's position.  a pricey undertaking, I couldn't quite get to where the cost was worth it.  throughout those five moves, I felt black could avoid checkmate and that the exchange would be slightly unfavorable to white.  ",
        "23. b3 Bxa3+": "BxP.",
        "24. Kd1 a4": "my last chance to launch an attack on the black king's position.  I really did not want to spend the next move on the king...    ",
        "25. Ke2": "...but I decided there was a potential exposure risk, black potentially attacking the king from a, b, c and d, ...and from the side.  razor thin that I didn't leave the king on d1, ...Bxh6 being among alternatives.  perhaps a mistake.  other alternatives?",
        "25... Nb4": "another painful decision....  ",
        "26. Bxb4": "...I let go of the bishop primarily on the grounds that moving the Q would have resulted in a more precarious situation for the white king, Qe3 or Qf3 being the alternatives (Qg3 would lose the rook).  the white king never does gain the safety I was hoping for.",
        "26... Bxb4": "bxb.",
        "27. c4 Rcd8": "pins knight.",
        "28. bxa4": "pxp. tough choice.  I looked at various attack setups, ...coordinating rooks and queen in attack on the black king, but was about one move too slow to beat black's pawn promotion, ...and subsequent move by black bringing the new queen into play.  expecting Bc5 to follow. not considered here is the trouble black could cause with e5!  had I not wasted moves at 12 and elsewhere would I be more well positioned to attack now? or would I have already attacked, going ahead with Bxh6 as I wanted to from move 19 to 25?!!!",
        "28... Bc5": "expected.  but now a possible 29. ...e5 causes me trouble. I can find no move that saves the knight w/o an unfavorable aftermath...",
        "29. Re1": "so I move with a priority on gaining some king safety, ...resolved that the knight is lost. queen move either loses forward rook or exposes king.  king advance problematic.  f4 interesting but also no good here (though may help in a move or two by encouraging pawn capture of N); ...g2 vulnerable.  Rd1 not as good as Re1./?  Aack!",
        "29... Bxd4": "hmm.  recapture is the obvious choice. ---also looked at some strange alternatives, 30. f3 Bf2  31. Qxd8+ Rxd8  32. Kxf2 for example.  can one of white's passed pawns be nursed to promotion ahead of black?",
        "30. Rxd4": "RxB.",
        "30... Qb2+": "ah, clever.  I hadn't recognized that this move would be an attack on the white king AND rook.  effectively prevents Kf1.  had expected the black queen to travel the long diagonal for Qxg2.  black is seeing further into the position than I am and has me fully dead here.",
        "31. Ke3": "threat of RxR# prevents black from playing Rb3 pinning queen. but again, black is patient and I'm sure already sees where he wins the white queen.",
        "31... Rxd4": "threat done away with.",
        "32. Qxd4 Rb3+": "setup for nice pin a few moves along.",
        "33. Ke4": "forced.",
        "33... Qc2+ 34. Ke5 Qf5+": "and viola, a nice roundabout route and black has the white queen.",
        "35. Kd6 Rd3": "35. ...Rd3",
        "36. Qxd3": "well worth the two rooks...",
        "36... Qxd3+": "chompp!  played on, per club \"rulez.\"",
        "37. Kc5 Qf5+ 38. Kc6 Qxf2 39. Rd1": "it will be a feat to hang on to the rook and both pawns.  note black's fine pawn fortress, still unchanged since move #9.  30 moves!",
        "39... Qxg2+ 40. Kb5 Qb2+ 41. Kc5": "should have moved to a5...",
        "41... Qa3+": "no way to save the rook.",
        "42. Kb5 Qb3+ 43. Ka5 Qxd1": "white resigns.  probably the best of my four WTW games.  fewer major blunders. plenty of smaller mistakes though.  The personality of the game - castling opposite and white's king safety issues - contributed to black's win.  Between move 11 (when white castled) and move 36 (when white lost his queen), the white king moved 6 times, ...good initiative for black and little opportunity to improve position for white.  these checks/king moves began at move 24.  I expect I will be taking a close look at moves 12 to 23.\n\nas for where I went wrong, 12. Bc3 wasted two moves.  16. Qxb7 is questionable but probably not bad on its own (otoh, perhaps time could have been better spent on engineering an attack).  19. Re4 also probably not bad on its own.  25. Ke2 perhaps a waste of time.  26. Bxb4, hmm. prevents loss of c-pawn but loses bishop, reducing attacking options.  28. Bxa4.  perhaps should have made queen safe and let N deal with black's a-pawn.  29. Re1 a wasted move.  Also, from 22 to 25 (and even 19 to 22), white is somewhat well positioned to initiate an attack.  perhaps not proceeding was another mistake.  will have to see how these comments line up with what the computer has to say.\n\nThanks very much to hityerclock for the game.\n\nwill look forward to hearing any comments."
    },
    "url": "https://gameknot.com/annotation.pl/challenge-from-hityerclock?gm=42075",
    "gameName": "Challenge from hityerclock",
    "players": "hogfysshe (1636) vs. hityerclock (2248)",
    "opening": "Caro-Kann (B18), classical, Flohr variation"
}