{
    "moves": {
        "1. d3": "I'm going to try to annotate most of this game as it is played. The opening is an unusual one and so may be of some interest",
        "1... d5": "Staking a claim in the centre, also prevents e4 which loses white the ability to castle 2 e4, dxe4, 3 dxe4, Qxd8, 4 Kxd8",
        "2. c4": "This move completely threw me and ifn fact strays out of the gameknot database. ",
        "2... Nf6": "Attempting to defend the pawn and to develop, perhaps better would have been to simply take the pawn as described earlier which would mean that white would lose the ability to castle",
        "3. cxd5 Nxd5 4. Nf3 g6 5. e4": "Looking to shift the knight though I tend to think this is a poor move even though it gains tempo as the backward (therefore weak) d pawn is on the half open rank that the black queen is on",
        "5... Nf6 6. b4": "This move is a complete mystery to me at the moment, it seems to serve no purpose other than perhaps to give the white dsb even more room to manoeuvre",
        "6... Bg7": "preparing for castling. At the moment I think white's development is much better however my lsb has a nice open diagonal to move along and I am looking for a pawn charge on the queens side",
        "7. Bb2 O-O": "Putting my king safe, it will be a move or two before white can do the same so I will now look to pressure him and hopefully prevent castling",
        "8. g3 Nc6": "simple threat while continuing to develop",
        "9. a3 Ng4": "Looking to move a knight to e5, but which one? In the mean time white is likely to exchange bishops. I'm not sure if this is wise on my part as I suspect the dsb could be a useful weapon in the future",
        "10. Bxg7 Kxg7": "As expected.\r\n\r\nWhite looks to have better control of the centre but I am hoping that his backward d pawn will become a vulnerability. He is likey to fianchetto his lsb. My problem now is what to do with my lsb, e6 is probably the best place but that blocks my e pawn, d7 simply obsrtructs my queen",
        "11. Bh3": "I'm not sure of the point of this move as it seems to acheive littleas this doesnt' seem to me a be a good position for the lsb, but where is?",
        "11... Nce5": "Looking at Qxd3 and a queen exchange which should also get a knight check meaning that white will not then be able to castle. I think whites best option here is to go for the exchanges of knight and bishop. If white isn't careful he will lose material here",
        "12. Nxe5 Nxe5 13. Bxc8": "So far as expected",
        "13... Nxd3+": "I'm still not sure this was wise, or at least too early. My idea was to prevent white castling",
        "14. Ke2": "I'm not clear here if Ke2 or Kf1 is better",
        "14... Qd4": "I have a feeling about this position, that white could be in big trouble if he isn't careful, my queen is looking at f2, if I can get my rook to d8 then it could be curtains for white I think. At the moment I am expecting 15 Ra2 which will give me time for Rd8 with a mate threat of Qxf2",
        "15. Nd2": "Probably better than the Ra2 I expected, however this gives me time too",
        "15... Rd8": "White has a couple of options here, though I think I would be tempted with Rf1. I am hoping he will try to hang on to his lsb. We have played many times before, so I know I am taking a little gamble here",
        "16. Bxb7": "A fatal mistake",
        "16... Qxf2#": "After the game he said that he just hadn't seen it at all. Note that one of the keys to this mate is the position of the white queen which hasn't moved at all through the game"
    },
    "url": "https://gameknot.com/annotation.pl/challenge-from-spirit1?gm=19997",
    "gameName": "Challenge from spirit1",
    "players": "spirit1 (1506) vs. elwoos (1566)",
    "opening": "Mieses opening (A00)"
}