{
    "moves": {
        "1. e4": "Sicilian Defense, Kan Variation, B42",
        "1... c5 2. Nf3 e6 3. d4 cxd4 4. Nxd4 a6 5. Bd3 Nf6": "The main line here is 5...Bc5.  This is the secondary line, and it is not as good for Black as the main line...",
        "6. O-O Qc7 7. Qe2 d6 8. c4 g6 9. Nc3 Bg7 10. Rd1 O-O 11. Nf3 Nc6 12. h3 Nd7 13. Bf4 Nde5": "13...Bxc3 is more common...",
        "14. Rac1 b6 15. Bg5": "Other moves that have been played more often here include 15. b3, Bb1, and Qe3.  It appears we are now out of book...",
        "15... Nxf3+ 16. Qxf3 Ne5 17. Qe3 Bb7 18. Be2 f5 19. Bf4 Rad8 20. exf5 Qc6 21. f3 gxf5 22. Qf2 Kh8 23. b4 Rfg8 24. b5 axb5 25. cxb5 Qc5 26. Kf1 Qb4": "This move gives White a very powerful and very influential passed b-pawn...",
        "27. Rd4 Qb2 28. Na4 Qxa2 29. Nxb6 Qb2 30. Rdd1 Bf6 31. Qe3 Rg6 32. Rcb1 Qc2 33. Bxe5 Bxe5 34. Rbc1 Qa2 35. Nc4 f4 36. Qb6": "Conversely, White's queen foray deep into queenside penetration bears much more fruit than Black's fruitless queen foray...",
        "36... Rdg8 37. Rd2 Qa8": "This move gives White the d6 pawn, and Black does not get enough compensation for it by capturing the g2 pawn, due to White's subsequently powerful centralized queen...",
        "38. Nxd6 Bxd6 39. Rxd6 Rg6xg2 40. Qd4+ e5 41. Qxe5+": "So now White is a pawn up with a beautifully centralized queen that is exerting much discomfort upon Black's position...",
        "41... Rg2g7 42. Kf2 Qa3 43. Rc3 Qa1": "Black's queen never was able to exert any influence on White's queenside, despite repeated attempts...",
        "44. Rd1 Qa7+ 45. Rc5 Rc8 46. Rdc1 Qb6 47. Bd3 Qd8 48. Rc5xc8 Bxc8 49. Rc4 Bxh3": "This loses quickly, but Black was lost anyways...",
        "50. Rxf4": "White's bishop is en prise!",
        "50... Qe7 51. Bc4": "White's queen is en prise!",
        "51... Qd8 52. Rd4": "The end begins with some very sick rook moves...",
        "52... Qf8 53. Rh4 Bf5 54. b6 Bc8 55. Rxh7+": "!",
        "55... Kxh7 56. Qh5#": ""
    },
    "url": "https://gameknot.com/annotation.pl/challenge-from-prophylaxiss?gm=28834",
    "gameName": "Challenge from prophylaxiss",
    "players": "prophylaxiss (2133) vs. milne (2223)",
    "opening": "Sicilian (B42), Kan, Gipslis variation"
}