{
    "moves": {
        "1. e4": "This is a game I played when I was new to Gameknot, it has a few interesting tactics in it and I think it is a good example of how to win a game when in a strong position.",
        "1... e6": "The French, my favorite opening for black.",
        "2. e5 d5": "2...c5 might have been a stronger move but I wanted to head towards the French advance because I know it well.",
        "3. d4 c5 4. c3": "All of these moves so far are fairly normal.",
        "4... Nc6 5. Bb5 Bd7 6. Nf3": "A mistake, leaving his wsb unprotected allows me play a simple combination to nick a center pawn as we will see.",
        "6... Nxe5": "If PxN then BxB.",
        "7. Bxd7+ Nxd7": "Now a central pawn up and equally developed, I plan to control the center of the board at some point soon.",
        "8. Qa4 Qb6 9. Ne5": "Whites speculative attack here is too premature and is just wasting valuable moves.",
        "9... Ngf6 10. O-O Bd6 11. dxc5": "A bad idea, after taking the pawn with the bishop, white now has no central pawns at all now and it will be hard to exert any influence in the game.",
        "11... Bxc5 12. Nd3 Bd6 13. Be3 Qc7": "Forcing the first weakness to whites king position.",
        "14. g3 O-O 15. a3 Ne4": "I consider this knight to be in a strong outpost because although white can drive it off by playing f2-f3, that would further weaken her kings position to a drastically bad one.",
        "16. Bf4 e5 17. Be3": "I now have total control of the center of the board, an attack is now imminent.",
        "17... Rfe8 18. Bxa7": "?? That pawn was so poisoned that I never thought that my opponent would ever think of capturing it. The bishop is now pinned to the queen and will be taken.",
        "18... b6": "Naturally.",
        "19. Qb3": "White at least is taking a central pawn for the bishop. not much compensation, but better than nothing.",
        "19... Rxa7": "?In retrospect 19...N(e)f6 would have been stronger as it would have allowed me to hold onto my d-pawn and still win the bishop.",
        "20. Qxd5 Ndf6 21. Qb5 Ra5 22. Qb3": "Whilst further developing my pieces, I have driven the white queen out of the way, and away from my planned attack of whites king.",
        "22... Ng5": "This move has opened up the game for me, firstly  it allows Nf3 , and it also frees the e-pawn to advance which will open the diagonal for my bishop and queen.",
        "23. f3": "Not good at all, white needed to protect f3, but could have done it much better by Nd2 or Ne1, whites kings defense is just opening up like a tin can.",
        "23... e4 24. fxe4 Rxe4": "Now both rooks are free and active, white is in trouble.",
        "25. Nd2 Nh3+ 26. Kh1 Qc6": "! The killer move.",
        "27. Nf3": "27 NxR? would have led to checkmate with...QxN , 28 Rf3, QxR Mate.",
        "27... Re3 28. Qd1 Rf5 29. Nb4": "?29 Nd-e1 would have been better as it protects f3.",
        "29... Bxb4 30. axb4": "Whites idea now seems to counterattack at my back rank, but it is well defended.",
        "30... Rexf3": "of course.",
        "31. Qd8+": "completely pointless as it achieves nothing at all, white is clutching at straws.",
        "31... Ne8 32. Kg2 Rf3xf1+ 33. Kxh3 Rh5+": "Both of whites  possible responses here lead straight to checkmate-if 34 Kg4, then Qg6 ,35 Qg5 (forced), Q Q mate.",
        "34. Qh4": "Forced.",
        "34... Rxh4+ 35. gxh4 Qf3#": "I was quite pleased with my play in this game because it was tricky finding the moves but I was never in trouble myself, and I think that the way I kept increasing the pressure on whites king showed a high level of skill as well as patience, however I am in no doubt that my opponent was playing well below par when you consider their rating."
    },
    "url": "https://gameknot.com/annotation.pl/challenge-from-hewhomateswins?gm=11792",
    "gameName": "Challenge from hewhomateswins",
    "players": "lauracj (1403) vs. hewhomateswins (1592)",
    "opening": "French (C00), Steinitz attack"
}