{
    "moves": {
        "1. d4": "In this game I will continue to use the d4 opening which has proven to be effective against most players here on GK, I want to thank eesther for the challenge, as he is undefeated to everyone here besides myself.",
        "1... d5": "d5 is a solid move for center control",
        "2. c4": "This is a book move and is made most of the time, depending on how black plays, Nf3 was considered also. ",
        "2... c6": "protects the center pawn",
        "3. Nf3": "Now I play the other move now, Nc3 was also a move I liked more than c5.",
        "3... Nf6": "Black continues to develop Nf6",
        "4. Nc3": "my second N is developed to Nc3",
        "4... a6": "a6 is played by black, I thought developing another minor piece would have been better, But He had a reason for this move I am sure.",
        "5. e3": "I play e3 protecting my d4 pawn and opening way for my lsb to be developed.",
        "5... b5": "b5 played protected by pawn on a6 and c6. This also allows Black to develop his pieces on his Q side.",
        "6. c5": "I now advance pawn  to c5 and have a fine wall of connected pawns. My other thought was to get castled quickly by developing my lsb.",
        "6... Nbd7": "develops his N in front of his Q. I thought he might of played Bg4 here.",
        "7. b4": "I add another protector to my c5 pawn.",
        "7... a5": "a5 is played which attacks pawn on b4",
        "8. bxa5": "I decide to take here thinking to take is a mistake. By taking here I actually shift tempo to his favor I believe.",
        "8... Qxa5": "Q takes pawn  and I wonder how I can defend this move. he took this move over taking with his rook, which could have been played and not getting his Q out early. The Q takes seems to be best. ",
        "9. Bb2": "this simple move does the job to protect the loss of my R if I had left his attack of a skewer not stopped. ",
        "9... e5": "e5 is played attacking the center.",
        "10. Be2": "lsb is developed and now gives me a way to castle if I decide too. Right now I question if this is best place for my piece. My N is pinned and Bfd3 was my other move I had to choose from",
        "10... Ne4": "I believe I said nice move after Ne4 was played. thinking I should have had my lsb on d3 here to take his N.",
        "11. Qc2": "Q moved  Qc2  I had thought about castling 0-0 here.",
        "11... b4": "b4 is advanced attacking my Nc3",
        "12. Nxe4": "I take his Bxe4",
        "12... b3+": "b3+  discovered checks and attacks my Q.",
        "13. Qd2": "I offer Q exchange, Qc3 was also considered. ",
        "13... dxe4": "dxe4  was played taking back N.",
        "14. Ng5": "I moved my N from attack Bg5",
        "14... exd4": "exd4 pawn takes pawn",
        "15. Qxa5": "Ok I finally take his Q off the board  Qxa5",
        "15... Rxa5": "Rxa5 takes back Q",
        "16. axb3": "Why not axb3 offering exchange of Rooks",
        "16... Rxa1+": "Rxa1+ expected move made",
        "17. Bxa1": "Bxa1 takes back his R.",
        "17... dxe3": "dxe3 pawn takes pawn ",
        "18. b4": "I decide to protect my c5 pawn by advancing b3 to b4.",
        "18... exf2+": "exf2+ expected",
        "19. Kxf2": "I have to take Kxf2",
        "19... f5": "f5 protects e4 pawn.",
        "20. Bh5+": "Now I get to attack! Bh5+ I down in score -1 but my pieces are developed especially my R.",
        "20... Ke7": "Ke7  moves out of check",
        "21. Nf7": "Bf7 attacking his R.",
        "21... Rg8": "Rg8 expected forced move or it is taken.",
        "22. Nd6": "another attack!",
        "22... Kd8": "Kd8 played ",
        "23. Bf7": "attacking a piece",
        "23... Rh8": "R moves back, tempo is in my favor.",
        "24. Nxc8": "Why not I think trade a N for B.",
        "24... Kxc8 25. Be6": "I pin his N",
        "25... Kc7": "K break the pin",
        "26. Rd1": "Rd1 on d file attacking",
        "26... Bxc5+": "B checks",
        "27. bxc5": "bxc5",
        "27... Nxc5": "N takes pawn attacking my lsb.",
        "28. Bxg7": "dsb takes pawn attacks his R.",
        "28... Re8": "R attacks lsb  (double attack)",
        "29. Bxf5": "I have to retreat my lsb.",
        "29... Re7": "R attacks dsb",
        "30. Bd4": "dsb attacks his N",
        "30... Rf7": "R attacks lsb.",
        "31. g4": "pg4 protects my lsb",
        "31... Nd3+": "N checks",
        "32. Ke3": "K used as an attacked moves of check",
        "32... c5": "c5 attacks dsb",
        "33. Kxe4": "Kxe4    (I am up +3)  Black resigns "
    },
    "url": "https://gameknot.com/annotation.pl/challenge-from-eesther?gm=61703",
    "gameName": "Challenge from eesther",
    "players": "redfoxrising (1949) vs. eesther (2066)",
    "opening": "QGD Slav (D15), 4.Nc3"
}