{
    "moves": {
        "1. c4": "My standard opening with white\n",
        "1... e5 2. Nc3 Nf6 3. g3": "Bremen variation\n",
        "3... d5 4. cxd5": "This is almost a reflex move as the English opening allows black to build a centre before destroying it.  So this is the most direct application of that idea\n",
        "4... Nxd5 5. Bg2 Nxc3 6. bxc3": "and black has effectively exchanged his centre pawn for my b-pawn.  Not a great idea in my opinion\n",
        "6... Nc6 7. Nf3 e4": "much better was Bc5\n",
        "8. Ng1": "opening the diagonal for the B and allowing the N to find a safer home\n",
        "8... f5 9. Nh3 Be6 10. Rb1": "much better would have been d3 to further open the diagonal  Or 0-0 and get the K to safety\n",
        "10... Rb8": "slightly better was Qd7 giving teh chance of 0-0-0 getting the K to safety and making a much more complex game\n",
        "11. d3 Bxa2 12. Rb2": "should have played Rb5 hitting a target that could not just move away\n",
        "12... Bf7 13. Qa4": "Qa4 temporarily dissuades black from exd which would break up my centre pawns and expose the K before it castled\n",
        "13... Qf6 14. O-O": "Alittle late but now i can relax and plan\n",
        "14... Qxc3": "i commented to my opponent about pawn pinching and he said 'what have i got to lose?'  well as we shall see with the Q isolated out of place - quite a lot\n",
        "15. Ng5 Bg8": "why guard a pawn that is well protected?  Qa5 would have forced the issue and prevented the moves that follow\n",
        "16. dxe4 Qc4": "offering the exchange\n",
        "17. Qa1": "but i prefer to keep my Q on the a-file as part of my attack\n",
        "17... h6": "attacking a piece that is not even involved in the action.  Qa6 would have prevented the threatened carnage\n",
        "18. exf5": "and realising the size of the attack black resigns.\n"
    },
    "url": "https://gameknot.com/annotation.pl/challenge-from-bigpeta-http-gameknot-com-chess-pl-b?gm=48053",
    "gameName": "Challenge from bigpeta, http://gameknot.com/chess.pl?b",
    "players": "bigpeta (2070) vs. battlefleet (2079)",
    "opening": "English (A22), Bremen, reverse dragon"
}