{
    "moves": {
        "1. d4 d5 2. c4 Nf6 3. Nf3 e6": "Défense Marshall...",
        "4. Nc3 b6": "J'ai l'impression que ce coup sort de la théorie...",
        "5. e3 Bd6": "Fe7 me semble préférable pour un meilleur contrôle du centre.",
        "6. Bd3 Bd7": "Peut-être pour empêcher Cb5.\nMais il aurait été préférable de le placer directement en b7, en fianchetto, ce qui est une position classique et bien protégée, derrière les pions. De plus cela donne du poids sur la grande diagonale h1-a8 et sur le centre",
        "7. O-O": "Je continue le développement classique et il me reste le fou C1 à sortir + la dame, pour que le développement de début de partie soit fini pour les blancs, il reste alors au moins 3 coups à effectuer pour les noirs : le roque + le cavalier Cb8 + la dame à sortir.....",
        "7... Bc6": "Pas bon, car bloque la possibilité de pousser le pion c7 ou  de sortir ici le cavalier Cb8. Se place sur la grande diagonale mais en 2 coups au lieu de 1 et avec une position inférieure.",
        "8. Bd2 O-O 9. Rc1": "Placement de la tour sur la colonne C, position typique des blancs dans les gambits dames",
        "9... Nbd7": "Fin du développement noir, mais avec un peu de retard et avec une position problématique au niveau du fou Fc6",
        "10. Nb5": "Début des hostilités sur l'aile dame, et/ou échange du cavalier pour briser la paire de fous.",
        "10... Bxb5 11. cxb5": "la colonne C m'appartient, la paire de fous noirs est cassée, ça me va...",
        "11... Re8": "bon coup, dans la stratégie logique des noirs de trouver du contre jeu au centre/ aile roi pour répondre à l'attaque des blancs sur l'aile dame.",
        "12. Qb3": "Idée de se placer sur la diagonale qui pointe sur le roi, et de libérer la ligne 1 pour éventuellement doubler les tours sur la colonne C",
        "12... e5": "Le jeu adéquat",
        "13. dxe5 Bxe5 14. Nxe5 Nxe5 15. Bb1": "Je ne suis pas sur de la qualité de ce coup, car s'il a l'avantage de garder le fou sur la colonne qui pointe sur l'aile roi, mais limite l'action du fou sur un seul côté. Peut-être plus de poids en e2.",
        "15... Qd6 16. Bb4 Qd7 17. a4 a5 18. Bc3 Rac8 19. Rfd1": "La position s'égalise, les blancs n'ont pas su attaquer sur l'aile dame, peut-être pour avoir pointé les fous sur l'aile roi...",
        "19... c5": "Je pense que c'est l'erreur stratégique : Le plan naturel des noirs est d'attaquer sur l'aile roi, ouvrir ainsi sur l'aile dame remet le plan d'attaque des blancs en selle.",
        "20. bxc6 e.p. Rxc6": "Le pion d5 est isolé, la dame est en face de la tour Td1...",
        "21. e4": "Le piège ! Car le pion d5 est perdu",
        "21... Rd6": "Aïe !",
        "22. f4": "Les noirs perdent une pièce mineure.",
        "22... Nf3+ 23. gxf3 dxe4 24. Bxf6": "Permet d'éviter de perdre les pions du centre, et casse le roque noir.",
        "24... gxf6 25. fxe4": "Il ne reste plus qu'à gérer l'avance de matériel pour les blancs en échangeant au max.",
        "25... Rxd1+": "et les noirs sont un peu obligés de le faire...",
        "26. Rxd1 Qc7": "Toutefois le travail n'est pas fini et les noirs savent bien trouver du contre-jeu en position d'infériorité.",
        "27. Qg3+": "Mauvais coup qui aide le jeu noir. Idéalement, Df3 aurait été mieux.",
        "27... Kh8 28. Kf2": "du coup, obligé de réagir...",
        "28... Rg8 29. Qe3": "...et de réagir encore",
        "29... Rg4 30. e5": "Bon coup qui va nécessairement mettre en difficulté les noirs, soit avec l'échange des dames, soit en fixant un pion blanc en f6, idéal pour un mat...",
        "30... Qc6": "encore du contre-jeu, les blancs ne doivent pas mollir....",
        "31. Be4": "Ce coup tolère la perte du pion a4 car si la dame prend, les noirs vont au mat.",
        "31... Qxa4": "Aïe.",
        "32. Rd8+ Kg7 33. exf6+": "Tous les chemins mènent à mat.",
        "33... Kxf6 34. Qc3+ Ke7 35. Qc7+ Kf6 36. Qe5#": "Une des suites possible...."
    },
    "url": "https://gameknot.com/annotation.pl/challenge-from-oduesp?gm=31538",
    "gameName": "Challenge from oduesp",
    "players": "oduesp (1632) vs. zorglub39 (1384)",
    "opening": "QGD (D06), Marshall defence"
}