{
    "moves": {
        "1. Nf3": "The Reti... don't really know it, I guess I'll just wing it.",
        "1... Nf6": "Was this a good move?",
        "2. Nc3 Nc6": "Okay this is a little weird",
        "3. d4 d5 4. Bg5 Bf5 5. e3 e6 6. Bd3 Bxd3 7. Qxd3 Bb4 8. a3 Bxc3+ 9. Qxc3 O-O 10. O-O": "At this point I don't think either side has made any mistakes. I could be wrong however and if you notice something please tell me.",
        "10... h6 11. Bf4 Ne4": "Attacks the enemy queen and lets my queen go to f6",
        "12. Qe1": "Probably not the best square.",
        "12... g5": "It attacks the bishop but removes the kingside cover, so I don't think it's great.",
        "13. Be5 g4": "Might as well",
        "14. Nd2 Qh4": "I've got some pieces looking at the WK",
        "15. Nxe4 dxe4": "Now I have doubled pawns, but I don't think they're much of a liability.",
        "16. b4 f5 17. Bxc7 Rf6 18. f3 Qxe1": "I don't really like this trade now. I lose my active queen for my opponents inactive one.",
        "19. Raxe1 Rc8 20. Bg3 b6 21. f4 a5 22. b5 Na7 23. Rec1 Nxb5": "We're equal again.",
        "24. a4": "Poking the knight.",
        "24... Nc3 25. Rfe1 Nxa4": "Now I'm up a pawn, and have a passed a pawn.",
        "26. c4 Nb2 27. Bh4 Rg6 28. Rcb1": "Attacks me, but I can escape and take a pawn at the same time.",
        "28... Nxc4 29. Kf2 h5 30. Rec1 Nd6 31. Rxc8+ Nxc8 32. Rc1 Na7 33. Rc7 Nb5 34. Rb7 Rg7 35. Rxb6": "Right now I offered a draw. Now I don't think I should have. I expected white to soon take my a pawn, after which I would have had an advantage with my knight over the bishop in the closed kingside. on the other hand my rook was blocked by pawns, while my opponent's rook was active. So, overall was my draw offer justified?",
        "35... Na3": "It was declined.",
        "36. Rxe6": "material equality ",
        "36... Rb7": "Grabbing the open file.",
        "37. Ra6": "going for the a pawn",
        "37... Rb5 38. Kg3 Kg7 39. Bd8 Nc4 40. h3 Nxe3": "pawn trade. ",
        "41. Bxa5 Rb2 42. Bc3 Rxg2+": "Ahead by a pawn again.",
        "43. Kh4 Nd5 44. Bb2": "Oops.",
        "44... Rxb2 45. Kxh5 gxh3": "Here my opponent will have to exchange the rook for the pawn after it promotes.",
        "46. Kg5 h2 47. Rh6": "Trying to stop it.",
        "47... Ne3": "preparing to go to f1. Here my opponent resigned. Until the bishop blunder I thought it was a close game. As always, comments are appreciated. "
    },
    "url": "https://gameknot.com/annotation.pl/challenge-from-porcho?gm=49906",
    "gameName": "Challenge from porcho",
    "players": "calvinballrules (1268) vs. porcho (1045)",
    "opening": "Reti opening (A05)"
}