{
    "moves": {
        "1. c4": "I wasn't sure what Henry was going to do.  But, he started off with the English Opening.  ",
        "1... e5": "But, I'm very used to it.  Fiercequeen's first annotations involved the English Opening.  But, before that happened, I've played against it and knew exactly what to do being that it is also the Reversed Sicilian.  So, I follow up accordingly with the most common response.",
        "2. g3": "I was a little surprised to see this.  Usually, white answers with 2.Nf3.  But, to my knowing, this is very unusual.",
        "2... Nc6": "I figured that Henry would play his next move, anyway, by completing his fianchetto.  But, not knowing what else might follow, I decide to play this.  Although it does develop, it is unusual for me to develop Queen's N this early.  I usually develop my K's N.  However, I wasn't sure what to do.  And, I was applying what I learned from Kenneth_fiore_3 which led to our second training game.  It boils down to the fact that openings can be intense, and not knowing what to do can get you in trouble.  With that, I thought Henry knew exactly where else to go and what to do, and I also have reason to believe that he's studied plenty of my openings.  Since I didn't have experience with his early fianchetto, I decided to play something for a first time with the idea of trying to take him off guard.  If I had more experience with 2.g3, and 3.Bg2 this wouldn't have happened.  Instead, I would have played what I have before being 2...Nf6.",
        "3. Bg2 Nd4": "In response to threatening to exchange, I decided to break the guideline of not moving the same piece twice in the opening.  It does not mean a thing to me here.  As I felt that refusing to exchange takes precedence.  Not only didn't I see an immediate advantage, but I thought that allowing the exchange would only favor Henry's position.  That's because I'd wind up with doubled pawns which I was determined not to allow.  I also considered a couple of other moves, but I was not going to undevelop my N, or cram in my Bf8 with 3...Ne7.  With that being said, the only other move that I was interested in was 3...Nb4, but I wanted my N right in the center.",
        "4. e3": "Of course, I kept in mind that Henry might play this.  But, I had a back up plan, just in case he did.",
        "4... Nf5": "As now, I'm thinking about what I can do with my N.  It boils down to what deeper_insight taught me about N visualization counts based on what it can do and how many squares it can travel or cover.  Part of the idea was damage it can cause with it, so this boils down to mobility.",
        "5. Be4": "Of course, I also kept this in mind.  As now, I can and will do better then just defend my N, by reattacking.  As now, I'm going after his Be4.",
        "5... Nd6 6. c5": "?? Henry must not like my N.  But, it does not matter, as this is a blunder.  In fact, I'm surprised that he played this, as I thought he'd realize that this situation.  With that being said, it was absolutely necessary for him to retreat his LSB.  By playing this, I can and will capture it which gives me a free piece.",
        "6... Nxe4 7. b4": "Fianchettoing his other B in an usual way since 7.b3 is a more common way to do it.  But, he's not so interested in his DSB.  It really boils down to this pawn chain which is what Henry has in mind.",
        "7... Ngf6": "However, I decide to develop another piece at once.  This time, it's what I generally play on my second move, as noted earlier.",
        "8. f3": "?! Deciding to kick my N again.  However, this is his weakest pawn on the board.  With that, and the first thing that I'm keeping in mind is that Henry's K is somewhat exposed.  And, I will try to take advantage of that later on.  Slightly better was, therefore, 8.d3 which launches the same attack but does not leave the King vulnerable.  However, I would've completed my fianchetto at once because 8.Bb2! would've eventually gotten a pawn back as compensation.  For example, 8.Bb2 d6 9.d3 Ng5 10.f4 Ne6 11.fxe5 dxe5 12.Bxe5 ",
        "8... Ng5 9. f4": "Still interested in my Ng5.  ",
        "9... exf4": "Instead of retreating right away, I exchange first.  Even though they're pawn, it's still liquidation since I am a piece up.",
        "10. gxf4 Ne6 11. f5": "Henry still wants my N.  ",
        "11... Ne4": "This looks promising, but I missed something important.  Instead of retreating, I do some reverse psychology where I hand it back to him.  Yes, it is a planned sacrifice, as I have something nasty in mind.  What I'm specifically thinking about here is the Domiano's Defense since white sacs his N for pawn for something worse.  It's with the check that's coming which is the same as what follows after black takes the N there.  So, it's the same move.  I looked at all but one variation to see what follows after 12...Qh4+.  ",
        "12. fxe6 Qh4+ 13. Ke2 Qf2+ 14. Kd3 Qg2": "One of the variations that I kept in mind is what's coming.  But, I was thinking a little bit about what happens if he sees this.  But, even then, it looked like I was, at the very least going to win an extra R without anything in return.  But, the one variation that I did not think about would've foiled my plan.",
        "15. Nf3": "?? That move would've been 15.Nh3 which was needed here.  Although, I would capture with 15...Qxh3, and the threat is back, but Henry could defend.  However, I'd still be a piece up.  But, one of the main things I kept in mind is what would happen if Henry missed all of that.  In other words, if he didn't play 15.Nh3 or moved his King up.",
        "15... Nf2+": "And, that is what I was alluding.  The last time I was able to pull of a family fork was a number of years ago when I played against anitam at my second lowest.  Though, I made mistakes, allowed her to win the Q back in a similar way, and lost the game by underestimating her strength.  Well, that's not going to happen this time.  As after I take Henry Q, I have a plan, when he takes back.  So, the next few moves are conditional, even though, I didn't set it up as a conditional move.",
        "16. Ke2 Nxd1+ 17. Kxd1 Qxf3+": "It's this move as I had considered grabbing his R first.  But, the N is more mobile.  And, if 17...Qxh1+ first, he has 18.Ke2 which defends the N.  By playing this, Henry has no valid defense.  As now, I am also going to get his R with this fork for free.  With that being said, what I kept in mind and applied is a very important chess quote.  \"When you see a good move, look for something better.\"  ",
        "18. Kc2 Qxh1": "With that being said, I would resign right here.  In fact, I might have even done so, after 16...Nxd1+, although with the material and against someone of near equal strength, I'd feel that there was something worth playing for.  But, after getting his N+R right after, I'd feel differently.  However, Henry is not going to resign at all.",
        "19. Bb2": "As he develops his B.",
        "19... Qe4+": "I also could've played 19...Qxh2.  However, this was played instead, as I still have to be a very little careful.  Although, white is lost, I can't underestimate him, as otherwise, Henry could pull a swindle.  What I'm being cautious about is his e6 pawn.  As he might try to do something with it like threaten to promote or play Bf6.  So, the idea is that when white gets out of check, I will take his e6 pawn leaving him with, pretty much, nothing left.",
        "20. Kc3 Qxe6 21. Na3": "Developing his final piece.  Of course, the idea is trying to get counterplay.  But, being this far ahead and taking his e pawn, I know that I've got a won game.  Yet, I still need to be on the lookout because as Coach Stockel emphasized in one of his annotations, \"When you think that you have won or are in a winning position, be very careful and do not underestimate your opponent.  Otherwise, you might start making mistakes and losing the game.\"",
        "21... a6": "I was worried that 22.Nb5 would allow it.  As now, I was wondering and asking myself how I'd be able to prevent 23.Nxc7+ which appears to fork and win back a R.  And, I thought that there was no way around it which is why I played this move.  As the idea was to prevent Henry from doing that.  What I didn't realize is that after 22.Nb5, I have 22...Qc6 which not only stops the threat, but at the same time, attacks white's N.",
        "22. Nc4 g6": "I'm preparing to develop my Bf8 to a good spot.  As the idea is castling.  That is, until Henry's next move.",
        "23. Kb3": "But, I do understand the idea as Henry is trying to get counterplay with this move by threatening my R.  For a while, I asked myself what to do.  If I let my guard down, he might succeed so I had to be very careful.",
        "23... f6": "Given that 23...Bg7?? would give Henry back a piece, I was trying to work out other alternatives.  It was very difficult for me to decide, but the only other alternatives which would not have lost anything would be to move my King.  I, however, decided against it to leave my option of castling open.  After this move, I asked myself what Henry was going to do.",
        "24. Rf1": "?? As he threatens my f6 pawn.  I thought that he would break the pin by moving his K.  But, I ignore the threat because I'm about to win his other N for a pawn.",
        "24... b5": " The reason for ignoring that threat is because I thought that if Henry had played 25.Rxf6 25...Qxc4+ was checkmate.  Even though it isn't, I would still win that N.",
        "25. d3": "Although it appears to defend the N being that 25...Qxc4?? is unplayable, I can win it due to my last move.  In fact, I kept this move in mind which is why I played 24...b5 being that his Nc4 has no way out.",
        "25... bxc4+ 26. dxc4 Qxe3+ 27. Bc3": "Instead of moving out with his K, Henry interposes with his B.  But, this helps me out since it is now pinned.  And, with the extra material that I have, I will, eventually, win that B as I have no intention letting it go.",
        "27... Qh3": "But, I had to take caution, though.  Some people might not see the point of this move, but 28.Re1! is a real threat.  And, had I not moved my K, I am sure that Henry would've played.  That would allow Henry to get his Q back for my R because my Queen would be pinned.  And, that has happened to me too often.  So, I had no intention of letting white compensate.  Thus, I go after his R, instead.",
        "28. Rxf6": "Thinking that he's gotten a pawn back and has prevented me from winning his B, Henry plays this.  ",
        "28... Bg7": "But, I can still win his B.  Not only is it still pinned, but his R is under siege, and if white move's it, I'll take with check since I'd use my Queen.",
        "29. c6": "I think he's still hoping for counterplay since his intention is to play 30.cxd7+ with the idea of his R playing a role.  This move, however, allows me to get his R and then some, even when he captures.  ",
        "29... Bxf6 30. cxd7+ Bxd7": "Although I could've recaptured with my K, I played this, as I see a mating pattern soon.  And, that starts by winning his last piece.",
        "31. a4 Qxc3+": "I thought about what to do when Henry gets out of check.  Of course, 32.Ka2 is his only option.  I had considered 32...Bxc4 which wins another pawn and forces mate with 33...Qb2#.  But, I quickly figured out that there's no need to win another pawn because 32...Qb2# is mate at once.  And, that is exactly what I had played.",
        "32. Ka2 Qb2#": ""
    },
    "url": "https://gameknot.com/annotation.pl/challenge-from-henry10?gm=63497",
    "gameName": "Challenge from henry10",
    "players": "henry10 (1314) vs. jkarp (1333)",
    "opening": "English opening (A20)"
}