{
    "moves": {
        "1. d4": "dame pion",
        "1... Nf6": "indian",
        "2. c4 e6": "queens indian?",
        "3. Nf3 b6": "ja",
        "4. a3": "petrosian",
        "4... Bb7 5. Nc3 d5 6. cxd5 Nxd5 7. e3 g6": "Vanaf hier is het een andere variant - eentje die ik niet ken. \nDit is een beetje een hybride vorm van Kings Indian defense",
        "8. Bb5+ c6 9. Bd3": "tempoverlies",
        "9... Bg7 10. O-O O-O 11. Ne4": "ik denk dat dit niet goed is omdat de zwarte loper wordt ingesloten. Misschien was Ke2 met e4 sterker geweest voor center control",
        "11... Re8 12. Re1 e5": "Ruilen is het sterktst",
        "13. dxe5 Bxe5 14. Nxe5 Rxe5 15. Bd2 c5 16. Qc2 Nf6": "ik moet slaan met kansen op Qxf6 \nBc3 (bij onoplettendheid een toren) - Qc6 met kans op Qxg3# dus e4",
        "17. Nxf6+ Qxf6 18. Bc3 Qg5": "Blunder, na f4 verliest zwart de toren",
        "19. f4 Qh4": "blunder, hij had dames moeten ruilen door Qxg2+ en dan Qc2xQg2, Bb7xQgs en dan verliest hij alsnog de toren, maar heeft hij wel een pion extra",
        "20. Bxe5 Nd7 21. Be4": "toren voor, gewoon alles afruilen en het eindpel in",
        "21... Bxe4 22. Qxe4 Rd8": "Verleiding is groot om direct Lc7 te spelen (met \nRc8\n24.\tQb7\tRe8\n25.\tQxa7\t\n) maar eerst mijn koning even veilig stellen",
        "23. Kh1 Nxe5": "hij ruilt, om te voorkomen dat ik zijn damezijde leegplunder denk ik. ",
        "24. Qxe5 Rd2": "ultieme poging om nog tot mat te komen als ik een fout maak (bijvoorbeeld Ra1. \nRxb2 - \nRd7 Qxe1#\n)\n\nmaar daar moet ik dus niet intrappen. Zelf ook matkansen nu, door Re1-d1\nRxb2 \nRd7 (mat kansen op Qf7) ",
        "25. Red1 Qf2": "# op g2! \nEerst schaak op e8, dan torens ruilen\n",
        "26. Qe8+ Kg7 27. Rxd2 Qxd2 28. b3 Qc3 29. Qe5+": "afruilen, en met een toren extra naar het eindspel",
        "29... Qxe5": ""
    },
    "url": "https://gameknot.com/annotation.pl/challenge-from-dekaasploeg?gm=40201",
    "gameName": "Challenge from dekaasploeg",
    "players": "dekaasploeg (1347) vs. forzaholland (1249)",
    "opening": "Queen's Indian (E12), Petrosian system"
}