{
    "moves": {
        "1. e4 e5 2. Nf3 Nc6 3. Bc4": "I'm more accustomed to playing Bb5 \r\nin this position.  But Bc4 seems good.  \r\na2-g8 is a strong diagonal. ",
        "3... a6 4. O-O d6 5. d3 Bg4 6. h3": "I don't like the Bishop pinning \r\nmy Knight down on f3.  So with\r\n h3 I attempt to drive it away.",
        "6... Bh5 7. g4": "The bishop is still pinning my Knight, \r\nso I try again to drive it away. \r\nThis move seriously weakened my\r\nkingside, though I didn't see it \r\nat the time. A better way to \r\nrelieve the pin would have been\r\nto move the queen off the diagonal.",
        "7... Bxg4 8. hxg4": "Black decided to take the pawn,\r\ngive up his Bishop in the process,\r\nand rip open White's kingside\r\ndefenses.  I take the bait.\r\nNow White is up 2 points in\r\nmaterial, but the h-file is open to \r\nattack and the g pawn is isolated \r\nand week.  The f pawn is also \r\nisolated from other pawns, though \r\nprotected for now by the Rook and \r\nthe King.  \r\nPlaying as White, I began to feel \r\nlike this game was coming apart \r\nalready and was not quite sure \r\nhow I got into this mess. (note \r\nto self: you got into this mess\r\nby playing 7. g4)",
        "8... h6 9. Be3": "Developing my Bishop, just \r\non general principles.  Now \r\nit commands two diagonals.  \r\nAlso clearing out my home \r\nrank with the object of \r\nconnecting the rooks as \r\nsoon as possible.  ",
        "9... Be7 10. Nc3": "I see that Black's Bishop and \r\nQueen are aiming at h4,\r\nthreatening mayhem.\r\n\r\nNot seeing any defense, I\r\nContinue my development \r\nand aim a second piece at d5,\r\nwhich I hope to seize.",
        "10... Bg5 11. Re1": "Black's bishop attacks White's bishop\r\non e3, which is defended only by the\r\nf pawn.   I don't want want to use the\r\n fpawn in Bishop defense because if \r\nI do then I'll have doubled pawns on \r\nthe e file and no chance of ever relieving \r\nthe isolation of the pawn on g4.\r\nSo I defend the Bishop with my rook.",
        "11... Bxe3": "Black initiates the trade.  \r\nLosing his Bishop may not be \r\nsuch a bad idea for Black, since \r\nit is \"bad\" (i.e. has limited \r\nmobility beause it is on the same \r\ncolor square as most of Black's \r\npawns.)",
        "12. Rxe3": "I take the Bishop and begin \r\nto assert myself on the e-file.   \r\nI'm feeling better about my \r\nposition, but still haven't dealt \r\nwith the vulnerability of my kingside, \r\npartiularly the h file.",
        "12... Nd4 13. Nxd4": "I accept Black's offer of a Knight-swap.  \r\nConsidering that I'm ahead in material, \r\neven swaps of pieces tend to favor me.  \r\nAlso, in this case I have given my rook \r\nmore scope for movement on rank 3.",
        "13... exd4 14. Re1": "Black's pawn on d4 was attacking\r\nboth the rook on e3 and the Knight\r\non c3.   \r\nBy moving the rook out of harm's \r\nway I lose the Knight, and Black \r\nloses only the pawn, but I will open \r\nup the b file for my rook or my Queen.\r\n\r\nMy moves at this point seem reaonable, \r\nbut the initiative is clearly Black's.  I am \r\nmainly responding to Black's threats, \r\nrather than advancing any plans of my \r\nown.",
        "14... dxc3 15. bxc3": "I lose the exchange, so material is now even, but I have gained an open b-file.",
        "15... Qg5": "This move gives me a queasy feeling that I'm going to lose the game.  My g pawn is hanging out there without protection, and my King looks very vulnerable.  I consider protecting the g pawn by moving my f pawn to f3, which would also add strength to e4.  But that would cut off the scope of my Queen and reduce my chances of developing a counter attack.  ",
        "16. Qf3": "So I move my Queen instead. The Queen on f3 protects the g pawn for now and also has potential to dominate the a8-h1 diagonal when and if the time is ripe.",
        "16... Nf6": "Of course, the folly of protecting a pawn with a Queen is that if there's a double attack on the pawn you can end up losing your Queen.  Now Black brings out the Knight to threaten the g pawn also.  If Nxg4 I can hardly respond with Qxg4 because that will lose my Queen.  On the other hand, however, I can respond by using either  my c4 bishop or my Queen to take black's pawn on f7 and deliver check.  Whichever one I use will be protected by the other.  I'm glad now that I developed that Bishop to c4 when I had a chance, even though I had no specific plans for it.",
        "17. d4": "I've been obsessing inwardly about the fate of the g4 pawn, but there seems to be nothing to do about it unless or until Black strikes, so I turn my attention to the center.  By pushing the d pawn I hope to prepare the way for e5, attacking the Knight and attempting to fully open the e file to my rook.",
        "17... O-O-O 18. Bxf7": "With the King no longer protecting f7 \r\nafter Black castles, I grab the pawn.",
        "18... h5 19. e5": "If 19...hxg4, my King will be in great danger. I can think of no particular defense against this, however, so I proceed with the idea of taking e5.  This also finally opens up the a8-h1 diagonal so that my Queen can live up to her potential.",
        "19... hxg4 20. Qg2": "As feared, Black grabs g4. \r\nIf  Black were allowed to play g4xf3\r\nI'd not only lose the Queen but would\r\nbe in check.  In that case my only legal\r\nmove would be Kf1, and it seems likely I \r\nwould be mated within just a few \r\nmoves.\r\nTo avoid all this, I move the Queen. \r\nalso giving some protectionto my \r\nKing.  \r\nBut my heart is sinking.  \r\nIs this game lost?",
        "20... Nh5": "Black moves his Knight to avoid \r\ncapture by the e5 pawn.  But h5 \r\nis not a good square for the Knight, \r\nand at least temporarily the power \r\nof the h8 rook is blunted as well.  \r\nI see some light at the end of the tunnel.",
        "21. Rab1": "Way back at move 15 I had opened \r\nthe b file by moving using the b pawn \r\nto capture on c3.  Now, I finally take \r\ncontrol of the b-file by moving my \r\nRook into place.",
        "21... c6 22. Be6+": "I give check and also add a little protection to g4.",
        "22... Kb8 23. d5": "When in doubt I advance my pawns \r\ntoward the opposite rank.  if 23 ... cxd5 then  \r\n24 Bxd5, and the c file would be a little more \r\nopen to me, as would the a8-h1 diagonal.",
        "23... Nf4 24. Qe4": "Black renews the attack on my Queen\r\nand moves closer to delivering checkmate\r\nagainst my King.\r\nI move the Queen, but keep it on the same \r\ndiagonal, hoping against hope for more \r\nattacking chances on that diagonal.",
        "24... Qh4": "My panicky feeling here was that Black \r\nthreatened to mate me at Qh2.  I now \r\nsee that there was actually an escape \r\nroute for my King at f1 and that mate \r\nwas not as imminent as I thought.  \r\nNevertheless, in this case fear was a \r\ngood motivator.  ",
        "25. Rxb7+": "No reasonable defense against the\r\nperceived mate threat occurs to me.  \r\nIn desparation, I decide that the only \r\nhope is to begin a relentless counter-\r\nattack.  I want to keep Black in check \r\ncontinuously until I can either deliver \r\ncheckmate or remove some of the Black \r\npieces that threaten my King.  \r\nI deliver check and give up my rook.  \r\nNot really seeing a clear path to victory, \r\nI nevertheless commit myself to keep \r\non checking as long as I can.\r\nWithout this motivating fear, who knows\r\nhow long I would have waited to attack?",
        "25... Kxb7 26. dxc6+": "Now I'm glad that I had placed a pawn on d5.  I had thought it might come in handy.  Also glad that my Queen is on that diagonal, backing it up. ",
        "26... Kc7 27. exd6+": "The checks keep coming.  ",
        "27... Kxd6 28. Qb4+ Kxc6": "Black takes my pawn, preventing \r\nit from moving closer to promotion.  \r\nBut does he know that my only \r\n\"plan\" right now is to keep on \r\nchecking?  ",
        "29. Qe4+ Kd6": "This feels like a gift.  I can now take\r\nBlack's Knight AND deliver another check \r\nat the same time.  The Knight has \r\nprevented my King from even thinking \r\nabout a flight to e2 to get away from check, \r\nso now I hope that I may be able to \r\nsurvive even if the opportunities \r\nto give check run out.",
        "30. Qxf4+ Kc6 31. Qc4+ Kb7": "Now I can crowd the King over to the a-file",
        "32. Rb1+": "The Black King has nowhere to go but a7 or a8",
        "32... Ka7 33. Qc7+": "The only place left for the Black King is a8.  \r\nIf he goes there, I will follow up with \r\n34. Qb7 mate.  \r\nBlack neither moves nor resigns, \r\nbut lets the clock run out.  \r\nWhite wins."
    },
    "url": "https://gameknot.com/annotation.pl/challenge-from-richquaker?gm=14952",
    "gameName": "Challenge from richquaker",
    "players": "richquaker (1122) vs. doychester (1447)",
    "opening": "King's pawn game (C50)"
}