{
    "moves": {
        "1. g3": "Decided to annotate this game just to show what I'm thinking as I play. I'm an average player and know little about classic opening strategies and I'm often baffled reading 2000+ rated player annotated games. \n\ng3 opening as plan to fianchetto my Bishop as it's sometimes missed by opponents and can sometimes win the a8 Rook if they're careless.",
        "1... d5 2. Bg2": "Continuation of my planned opening",
        "2... c6": "Not sure what my opponent is planning here yet",
        "3. d4": "d4 stop further pawn advance by him and to allow my bishop out",
        "3... h6": "guarding g5 from my bishop?",
        "4. Bf4": "Planning on Bxb8 to deny him castling long",
        "4... Nd7": "foiled!",
        "5. Nc3": "Just developing another piece",
        "5... e6": "Looking at pinning my knight i presume",
        "6. Nf3": "Preparing to castle kingside",
        "6... Bb4": "Pinning my Knight as expected",
        "7. Qd2": "In case he plays Bxc3 as I don't want to mess up my pawn structure when taking his Bishop",
        "7... Qa5": "Doubling up his attack",
        "8. a3": "To force his Bishop to move or to trade once I have castled.",
        "8... Ngf6": "Eyeing e4 to add pressure to my c3 Knight I think",
        "9. O-O": "Done for Kings safety and and so I can take his b4 bishop now.",
        "9... O-O 10. axb4": "As planned",
        "10... Qxb4": "b2 needs defending here",
        "11. Ra2": "a2 as want to stay on open file",
        "11... a6 12. b3": "To cover a4 for Rook attack on Queen",
        "12... Qe7": "I guess he spotted it!",
        "13. h3": "keeping his Knight off g4",
        "13... b5 14. Ne5": "Hoping for a Knight trade here as my retake with dxe5 will threaten his f6 Knight",
        "14... Nxe5 15. dxe5 Nd7 16. e4": "hoping for pawn trade here",
        "16... Bb7 17. b4": "making room for Rook on 3rd rank as planning to get across to f file with it.   This was a mistake I missed at the time I played it as it is an undefended piece.",
        "17... Rfc8 18. Ra3": "As planned",
        "18... Qxb4": "I missed that move as concentrating on my idea too much!",
        "19. Rb3": "Threatening queen",
        "19... Qe7 20. Ne2": "Making room for castle to cross board",
        "20... Nc5": "Attacking Rook",
        "21. Rb4": "Rf3 would have been better here but I rushed the move.",
        "21... a5 22. Rd4": "Only safe place without losing my chance to cross the board",
        "22... a4 23. exd5": "Making room for Rook to move again. Plan here was to sacrifice Bishop with Bxh6 and hope for gxh6 to expose his King for Rg4+",
        "23... cxd5 24. Bxh6": "A sacrifice to hopefully expose his King",
        "24... g6": "Didn't fall for it!",
        "25. Bg5": "Plan now is to get Bishop to f6 to restrict Kings options",
        "25... Qd7 26. Bf6": "As planned",
        "26... Kh7": "Kf8 would not have worked any better for him here as Qh6+ would have been my next move. Now Rh4+ has same result though.",
        "27. Rh4+": "Got him now",
        "27... Kg8 28. Rh8#": "One of my better games where I actually had a plan that came to fruition!\n\nTwo mistakes and one blunder according to the computer so a decent game for me. "
    },
    "url": "https://gameknot.com/annotation.pl/challenge-from-tonyforell?gm=68711",
    "gameName": "Challenge from tonyforell",
    "players": "andy221 (1409) vs. tonyforell (1375)",
    "opening": "Benko's opening (A00)"
}