{
    "moves": {
        "1. e4 c5 2. d4": "Smith-Morra Gambit--something I like to try to open the game up right away. White gives up a pawn to get very active pieces on good squares.",
        "2... cxd4 3. c3 e6": "But Black isn't having it!",
        "4. cxd4": "cxd4? Nf3 was probably best to keep the gambit alive.",
        "4... d5": "Striking back at the center for equality, although taking the pawn before is better just to make me prove I know what I'm doing.\r\n",
        "5. exd5 exd5 6. Nf3 Nf6": "I'll play with this isolated pawn as White. e5 is my set-up point and the e file is the avenue for attack.",
        "7. Nc3 Bb4 8. Bd3 Qe7+": "Qe7?! Not good--probably looking to trade queens.",
        "9. Ne5": "Ne5! ",
        "9... Nc6 10. O-O O-O": "Black couldn't afford to keep the king out in the open any longer, and now his bishop at b4 is doing nothing.",
        "11. Re1": "Now his misplacement of key pieces will be a problem.",
        "11... Nxe5 12. Rxe5 Be6 13. Bg5": "Bg5! and now Black is completely tied up and pinned.",
        "13... Bxc3 14. bxc3": "This to stay active, I suppose, but the king-side is the probem.",
        "14... h6 15. Bh4 Rac8 16. Qd2 a6 17. Rae1 Rfe8 18. f4": "The kind of position I always try to  get: action on one side of the board, quiet on the other and a safe king.",
        "18... Qa3": "Qa3? Still moving in the wrong areas.",
        "19. Bxf6 gxf6 20. Re5e3 Qf8 21. Rg3+ Kh8 22. f5": "And as a result, the wasted move by the queen and the smashed king position should decide things.",
        "22... Bd7 23. Rf1 Kh7 24. Rh3 Qg7 25. Rf4 Qg5 26. Rg3 Qh5 27. Rfg4 Ba4": "Ba4?",
        "28. Rh3": "Rh3! Qxg4 leads to mate. The early queen move to e7 and the resulting pins led to a quick loss by Black in an equal position early in the opening."
    },
    "url": "https://gameknot.com/annotation.pl/challenge-from-jhfit?gm=37561",
    "gameName": "Challenge from jhfit",
    "players": "jhfit (2016) vs. bozzoh (1869)",
    "opening": "Sicilian (B21), Smith-Morra gambit"
}