{
    "moves": {
        "1. e4": "Sicilian, Richter-Rauzer Attack, B63/B60",
        "1... c5 2. Nf3 Nc6 3. d4 cxd4 4. Nxd4 Nf6 5. Nc3 d6 6. Bg5 Qb6": "As Yogi Berra would say, there are reasons why non-main lines are not main lines...here, the main line is 6...e6 or 6...Bd7.",
        "7. Nb3 e6 8. Qd2 Be7 9. O-O-O O-O 10. f3 a6": "10...Rd8 is more often played here, or on move 11...or 12...",
        "11. h4 Qc7 12. h5 h6": "It seems that with 12...h6, Black does not get enough compensation for the pawn...",
        "13. Bxf6 Bxf6 14. Qxd6 Qb6 15. Qc5 Qc7 16. Kb1 b6 17. Qd6 Qb7 18. Qg3 Bxc3 19. bxc3 Qe7": "Black hopes to take advantage of White's weakened queenside pawn structure in front of the castled king, but White has control of the all-important blockade point at d6.",
        "20. Rd6 Qc7 21. e5 Rd8 22. Bd3 Bb7": "Note that it took Black 22 moves before his rooks were joined.  Capablanca was perhaps the best (along with Morphy) at joining his rooks on the back rank faster than anyone else, especially from the White side, playing all of those Queen's gambit openings...and it was primarily because he, like Morphy, valued the time principle in chess very much.  His writings place great emphasis on time, especially in the endgame.  More on this on move 50.",
        "23. Rd1": "Further overprotecting d6 and taking control of the only open file on the board.",
        "23... Ne7 24. c4": "Prophylactic move on the d5 square.",
        "24... a5 25. a3": "...and another one on the b4 square.",
        "25... Nc6 26. Be2 Ne7 27. Qf2": "Time to exchange heavy pieces and transition to a good chance for a winning endgame for White.",
        "27... Bc6 28. Rd6xd8+ Rxd8": "Black's queenside rook, as Lasker would say, did no useful work in this game.",
        "29. Rxd8+ Qxd8 30. Qd4 Qxd4 31. Nxd4 Ba8 32. Bd3": "Another prophylactic move that Nimzowitsch declared was more important than accumulating small advantages, but is not a prophylactic move itself not an accumulation of a small advantage?!",
        "32... Kf8 33. Kb2 Kg8": "Black loses an important tempo with this move...the rest of the game could easily go into any endgame tome under the bishop vs. knight endgame literature...",
        "34. Nb3 Kf8 35. a4": "Fixing the a5 pawn as a target for White's knight, and Black's bishop is helpless to defend it.",
        "35... Nf5 36. c5 bxc5 37. Bxf5": "Eliminating Black's last true defender, doubling the f-pawns, and entering into a good knight vs. bad bishop ending with still a pawn up.",
        "37... exf5 38. Nxa5": "Gaining the all-important remote outside passed pawn...",
        "38... Ke7 39. Kc3 Ke6 40. Kc4 Kxe5 41. Kxc5": "...and now creating a second queenside passed pawn...",
        "41... g5": "This move forces White now to take a look at at least four different possibly winning candidate moves.  It is interesting to note the positions of the knight and the bishop here.  We are familiar with the saying that a knight on a rim is grim.  But could it be that a bishop on a rim is even more grim?!",
        "42. Nc6+": "This move brings the knight back into the center of the board rather than keeping it hanging out on the west coast on a5.  It also enables White to keep the pawn on the all-important h-file, thereby fixing the pawn on h6 as a probable target for the knight, rather than exchanging it for Black's g5 pawn as in 42.hxg6 e.p.  If White can capture Black's pawn on h6, the game will soon be over, since White can then push the a-pawn AND the h-pawn, and even a bishop in the center of the board will not be able to stop one of the pawns from promoting.",
        "42... Kf4 43. Nd4": "What a significant difference with the knight positioned here in the center of the board rather than remaining on the a-file!",
        "43... Kg3 44. Nxf5+ Kxg2 45. Nxh6": "Mission accomplished!  A knight can travel completely from the west coast to the east coast in just four moves!  Who said that a knight is better than a bishop with pawns on just one side of the board?!  Now White's rook file passed pawns decide the game.",
        "45... Kxf3 46. a5 Kf4 47. Ng4": "Willing to sacrifice its ego for the success of the team!  Ala Bill Russell, the greatest team  championship winner of all-time!",
        "47... Kxg4 48. h6 Be4 49. a6": "Which rook pawn will emulate its fallen brother knight and immolate itself in order to save the other?!  ",
        "49... Kf4 50. a7": "Here's a perfect example of what Capablanca was talking about when he repeatedly emphasized the importance of time in the endgame, since Black does not have enough time to stop one of the pawns from queening, and thus resigns.  And yet, even though he placed much emphasis on the element of time, Capa placed his overall emphasis on the element of position. \r\n\r\nHe wrote, \"The fact is that chess consists of...three elements [material/force, space, and time] plus the inherent element of position, and that position is first, last, and foremost.  Position...is generally valued by the greater or lesser mobility of the pieces, plus the pressure that these pieces may exert against different points of the chessboard, or against certain pieces of the opponent...you may be behind in...material, space, and time, and yet have a winning position...you should give pre-eminence to the element of position\" (pp. 66-67).\r\n\r\nLocated in \"A Primer of Chess\" by Jose Capablanca, 1995 ed.\r\n\r\n"
    },
    "url": "https://gameknot.com/annotation.pl/challenge-from-prophylaxiss?gm=28528",
    "gameName": "Challenge from prophylaxiss",
    "players": "prophylaxiss (1974) vs. supercriticality (2100)",
    "opening": "Sicilian (B58), classical"
}