{
    "moves": {
        "1. d4 Nf6 2. Bf4 g6": "A serious and kin of \"timored\" set, but perfectly valid. ",
        "3. Nd2 Bg7 4. e4": "In sight of black's passivity, I push my pawn in the center. This square controls Bf5 by white, making a little problematic for him to develop it. ",
        "4... d6 5. c3": "Just blinding black's dsb. I want to attack the kingside, and I need to have a fierce barrier on the queenside. ",
        "5... O-O": "\"Come and get me\". ",
        "6. Be2": "Slowly. ",
        "6... c6": "This move enables Qb3, that forces me in thinking about all the \"poisoned pawn's stuff\" (Qxb2!?). It is not my intention to go this way. Maybe, more engaging would have been c5 instead. This gives me one precious tempo to go on with the attack. ",
        "7. g4": "The problem for black is if Nh5, BxN forces him to open the g column, and this is potentially very dangerous. Black's knight should find a good square to fly, and soon. ",
        "7... b5": "...so this move seem a little optimistic. ",
        "8. g5 Nfd7": "Well, ok, but that means your pieces are far from the king and all blocking each other...",
        "9. Ngf3": "I can take my time and do things properly. ",
        "9... Bb7": "c5 is countered by a final Bxb5 by white, so a good idea would have been to play a6 or Ba6. ",
        "10. h4": "I won't care: if he sees it, better for him. Otherwise, I'll start my assault, that is not granted at all. ",
        "10... e5": "Ok, delicate. The game is becoming interesting. ",
        "11. Bg3": "I wanted to target d6 even sacrifying a pawn on the queenside. I looked to many lines, very complicated, involving discovered threats on my Rh1, and a Bxd6 that threatened the R but of little use after Re8. It was already complicated. Be3, the \"wise\" one, just leads to exchanges and pressure over me. ",
        "11... a5": "Black counterattacks on the queenside. Now, c5 can be answered by d5, and this blocks black's plans on the queenside (well, that may be not be completely accurate, black keeps some chances of disrupting actions on the queenside after it). Anyway, this looks a little slow. ",
        "12. a3": "I honoured my opponend by defending. In fact, this may be not the best move, when h5 seemed so aggressive. ",
        "12... Nb6": "Black is playing very accurately to unravel his pieces and seriously threat my queenside. It was not that slow, after all. Now, Na4 sticks my queen or my rook to the defence of b and c, and I can't avoid that. I realized it was my h5 plan the \"too slow one\". Maybe just in time. \nSo I though to \"go a little crazy\".\nWe are already in a very complex position, with a lot of possible lines that goes long for many moves before they fix into a definite win, that is true for either side.\nAs an example: \n\n13.\td1-b3\ta5-a4\n14.\tb3-b4\tc6-c5\n15.\tb4-b5\tb7-c6\n16.\tb5-d3\te5-d4\n17.\tc3-d4\tc5-d4\n18.\tf3-d4\tf8-e8\n19.\td4-c6\tb8-c6\n20.\tg3-d6\tg7-b2\n21.\ta1-b1\tb2-d4\n22.\td2-f3\tc6-e5\n23.\tf3-e5\td4-e5\n24.\td6-e5\td8-d3\n25.\te2-d3\te8-e5\n26.\tb1-b6\t",
        "13. Qb3": "The idea behind this move is to tempt black in playing a4, forbidding this square for his knigth. ",
        "13... a4": "...which my opponen does. I'd call it an inaccuracy. My queen is not threatening anything, but x-raying two undefended black pieces, if the c pawn is moved. So black thinks he has to kick it even at this high price. I could have kept the queen on the white diagonal from a2, but the real pressure for the queen was on the b column. Here, an interesting tactic can make the game very interesting. I am planning to lose my queen. ",
        "14. Qb4 Na6": "...as predicted. ",
        "15. Qa5": "Self-trapping me? The problem is that the Na6 has not a good place to go, in order to trap my queen under the rook's fire. I bet he won't be able, but I may be wrong. And, in that case, I'll go for QxR, grabbing one of these knights in the process. Let's see if it works. ",
        "15... Re8": "Well, a passive move? ... or a manouver to trap my king with the help of the dsb? Anyway, I can improve my position a little. ",
        "16. O-O-O": "Now, an x-ray R attack is pending on the BK. ",
        "16... Bf8": "Black chooses to go on trapping my queen. ",
        "17. dxe5": "Now, I can take advantage from the discovered threat over the black queen. ",
        "17... dxe5": "This pawn is mine, but I have to take care of my queen. ",
        "18. c4": "Opening a safe square, at the price of weakening my king. Black now CAN go for something like Bb4, axB, Nc5, trapping the queen at the cost of a piece. Then, QxR, BxQ, and the game could have been very interesting, with all games with unbalanced forces. \nBut my opponent went for...",
        "18... b4": "I wanted to play interestingly in an interesting position. Lines are very funny. \n\n18.\tc3-c4\tb5-b4\n19.\td2-b3\tf8-d6\n20.\tc4-c5\ta6-c5\n21.\ta5-c5\td6-c5\n22.\td1-d8\ta4-b3\n23.\td8-e8+\ta8-e8\n24.\tf3-d2\t\n\n\n18.\tc3-c4\tb5-b4\n19.\td2-b3\td8-d1+\n20.\th1-d1\ta4-b3\n21.\ta5-b6\te8-b8\n22.\tg3-e5\tb4-a3\n23.\tb2-a3\tf8-a3+\n24.\tc1-b1\ta3-c5\n25.\tb6-a5\t",
        "19. Nb3": "I opted for this very odd-looking move. It is not really a sac, but black could have gone QxR+, RxQ, axN... and there is still game to play. ",
        "19... Nxc4": "This move forces the queen's exchange, that's all... ",
        "20. Rxd8 Nxa5": "It is very interesting to determine the correct move order from some moves ago. I have to be sure I'd come out well. Which move is the correct one? Some \"extra circumstances\" makes the solution very odd. ",
        "21. Nxa5": "This is the only one, because after RxR (any), NxN is check, so I plainly lose a knight. This way, I lose the rook, but I also threat the Bb7 (another extra circumstance)... so I come out in a great material advantage. The game is almost decided. ",
        "21... Be7": "It could have been an interesting try, but anything changes after NxB. And besides, this allows white to win a neat rook, in fact. ",
        "22. Rxe8+": "This forces black's next's move. ",
        "22... Rxe8 23. Nxb7": "...and I am +5. The only tension point left is a3. ",
        "23... Nc5": "Forces the exchange ot to allow Nb6+. The main target for black is to make his pawns to be as deadly as they can before dying. ",
        "24. Nxc5 Bxc5 25. axb4 Bxb4": "This way, the black pawn is not a threat anymore. ",
        "26. Bd3 a3 27. bxa3 Bxa3+": "No pawns to push, no game for black. ",
        "28. Kc2 c5 29. Nxe5 Ra8 30. Bc4 Kf8 31. Nxf7 Ke7 32. h5 Ra4 33. Bd5 Bb4 34. hxg6 hxg6 35. Rh6": "Black can defend with Ra6, but with no perspectives of any kind. A valiant game from my opponent: I won, but as you can see I made my homework and I had to take the game very seriously. Any comment welcomed. \"I can be wrong\". "
    },
    "url": "https://gameknot.com/annotation.pl/challenge-from-vocihc?gm=56051",
    "gameName": "Challenge from vocihc",
    "players": "damalfi (1805) vs. vocihc (1468)",
    "opening": "Queen's pawn game (A45)"
}