{
    "moves": {
        "1. d4": "I annotated this game as it proceeded. The annotations therefore don't have any retrospective analysis, and are only the thoughts going on in my mind while I was playing.",
        "1... Nf6 2. c4 e6 3. Nc3 b6 4. Nf3 Ba6": "Although this move is part of a book opening, I don't understand what it tries to achieve. The bishop would probably have to move back to b7 anyway, so isn't that like loosing a tempo?",
        "5. e4 Bb4 6. Bd3 Bb7 7. Qc2 O-O 8. O-O Ng4": "huh? what does this achieve? the N will have to go away anyway after h3.",
        "9. Bg5": "weakens g6 for black. the h7 pawn is already potentially attacked by white's B.",
        "9... f6 10. Bh4": "other option was Bd2, but this is probably better. now white can do a number of interesting things, like e5",
        "10... c5": "good move. aims at breaking up white's pawn center.",
        "11. e5": "had to think a lot for this move. still unsure whether this was the best option. Other options were d5, a3 and h3. The ones I had to decide between in the end were e5 and d5. Both look good for white, but e5 has various very tactical lines. d5 locks the position, and the game develops slower. i think that the advantage is more sure with d5, but would be slow to convert into anything tangible. it would most probably be followed by d6, and exchange of the bishop for knight by black on c3. With e5, black's best reply seems to be cxd4. Bxf3 is also good. After Bxf3, white's pawns double, exposing the king on an open g file. After cxd4, white could play exf6 or Bxh7, both of which look good. Probably moving the c knight at some point would be a good idea, to avoid black exchaninging it for a useless bishop.",
        "11... Kh8": "interesting move. i did not expect it. prevents white from taking on h7 with check. however, i think that it is a 'slow' move, and black needed a 'fast' move at this time. now white can simply play exf6, and black would be forced to play Nxf6 or gxf6 (otherwise white wins the black Q). Nxf6 definately looks the better of the two. After that white can decide about what to do with black's threat of cxd4. Options would include Ne4, Ne5, a3, Bxh7 etc..",
        "12. exf6 Nxf6 13. Ne4 cxd4 14. Nxf6 gxf6 15. Nxd4 Qc7": "the space around black's king has opened up. however, black now also has open files to place his rooks on to attack white's king in conjunction with his bishops. however black's N is still undeveloped.",
        "16. Bg3 Qd8": "maybe Qc5 would have been better",
        "17. Nb5": "with the aim of lodging in at d6. black should next play a move which blocks white's black B, or opens space around his rook, otherwise white can win the exchange by playing Nc7. 17..f5 looks to be the best for black. This sequence of moves leaves white's white B weaker.",
        "17... a6": "opens space around rook, and scares the N off",
        "18. Nd6 Bxd6": "Black exchanges his weak black B for white's N which would have cramped things for black had it stayed on d6. However, white is now left with 2 bishops, which could work well to dominate the board",
        "19. Bxd6 Rg8 20. f3 Rg7": "to protect Bxh7. But now black cannot play f5 (which would have reduced white's white B's mobility and strengthened the f-pawn) since black's rook and king are on the same diagonal.",
        "21. Rad1": "rook to semi-open file.",
        "21... Nc6": "black develops N at last!",
        "22. Be4": "pins N. opens up space for R to exert influence. Cheekily invites f5 from black. Black's camp is now quite cramped. The N can't move, the Q has few squares to go to, and must protect f6. Black has to think of a way to liberate himself, and white has to think of a way to use the space he has to attack.",
        "22... Rc8 23. b3": "protects the c-pawn against a potential Na5. The 2 general concepts in my mind at this time were to weaken the black pawns by moving my f-pawn up the board. This threat is quite real and near, so black should move his king and play f5 as soon as possible. If white had played f4 immediately, then 23..Na5 24.b3 Bxe4 25.Qxe4 f5, and black is now less cramped, and white hasn't succeeded in weakening black's center pawns as he would have wished. The other thing I wanted to do was to double up on the d-file, and exert pressure on black's backward d-pawn.",
        "23... Na5": "Black most probably played this to make his position more 'fluid' - to free his pieces. However the N has no squares where it is currently at. Black would be aiming to exchange bishops, and then play the N to b7, or maybe even c6.",
        "24. Rf2": "With the aim of doubling on the d-file. Once the rooks are doubled, white can move the B from d6, and bring it to the long diagonal where it would be powerful. Also, the Q would be protecting both, d7 and f6, which could cause black problems.",
        "24... Bc6": "makes room for the N. Alternatively black could have played 24..Bxe4",
        "25. Rfd2 Nb7": "At this point I had to make a few important decisions. First of all I had to decide whether I wanted black to take my B. Nxd6 would leave me without my dark bishop. In this position, the dark bishop appears to be quite powerful. Placed on the a1-h8 diagonal, it could cause black problems. However if I moved the bishop, after a few moves black could advance the d-pawn (but if Nxd6, then Rxd6 keeps the d-pawn back, and weak). And there were also 2 options if I decided to move my B - I could either bring it to the b2 square through a3, or I could take it to f4, and then play Bh6 at some point. So at this junction, I was considering 3 moves: Ba3, Bf4 and a move in which I wouldn't move my B, probably Qb2",
        "26. Ba3": "This was a very difficult decision for me. I didn't play Qb2 because e5 by black didn't look good. I also didn't want to exchange much material right now, because I fealt that the pressure was on black, and exchanges would let some of the steam off. I didn't play Bf4 because it didn't seem to do much. Now black may be able to play d5 at some point, which would give him space, and strengthen his d-pawn. However white's bishop would be strong at b2.",
        "26... d5 27. cxd5 Bxd5 28. Qb1 Rd7 29. Bb2 Rc5 30. Qd3": "Attacks a6, and threatens Qe3. After Qe3 white could play Bxd5, with the white Q eventually taking on e6, and leaving the black king in real danger. Maybe it was a bit premature for black to resign - the position however, does favour white quite heavily."
    },
    "url": "https://gameknot.com/annotation.pl/challenge-from-bittersweet_ballad?gm=119",
    "gameName": "Challenge from bittersweet_ballad",
    "players": "bittersweet_ballad (1855) vs. aqeel (1893)",
    "opening": "Nimzo-Indian defence (E20)"
}