{
    "moves": {
        "1. Nf3 d5 2. g3 Nc6": "'A questionable move. It is usually not a very good idea to obstruct the c-pawn in a Queen's Pawn Game, because the c-pawns are what you use to gain a better center by challenging opponent's d-pawn.",
        "3. d4": "1.d4 is not a very good move on move 1, but now it is OK because opponent can no longer challenge it with c5!",
        "3... h6": "wasted time",
        "4. Bg2": "I get bishop to best diagonal, typical of a Catalan",
        "4... e6": "bolstering d5 trying to",
        "5. O-O": "I have a lead in development",
        "5... Nf6": "two Knight's defense similarities",
        "6. c4": "Queen's Gambit similarities",
        "6... dxc4": "Queen's Gambit Accepted Similarities",
        "7. Qa4": "I think I have a winning position because I won a central pawn for flank pawn. Black did not understand that obstructing c-pawn is bad in a queen's pawn game. I exploited that principle quite nicely, yielding a neat pawn center for myself, and Black's position is left in shambles where his pieces will hardly have anywhere to amble.",
        "7... Bd7": "challenges my queen",
        "8. Qxc4": "but I get the center",
        "8... a6": "trying to challenge again with b5",
        "9. Rd1": "I challenge Black queen my moving rook to d-file where it is scary",
        "9... b5": "trying to get queen away",
        "10. Qc2": "calm retreat",
        "10... Nb4": "the knight moves to a bad square trying to chase the Q",
        "11. Qd2": "calm retreat",
        "11... Ne4": "the knight moves undefended trying to chase",
        "12. Qf4": "so queen attacks not worried about c2 because two knights are stronger than rook in every single variation.",
        "12... Nf6": "so get out",
        "13. Nc3": "I develop more",
        "13... Nbd5": "the knight is extra",
        "14. Nxd5": "usually unprincipled to capture an extra piece but I decided that it is OK to employ my center properly. ",
        "14... Nxd5": "so knight attacks my queen,",
        "15. Qd2": "and queen batteries",
        "15... Bb4": "attacks again really has a thing for her",
        "16. Qc2": "calm retreat again only for display not for capturing",
        "16... Bd6": "so get out",
        "17. e4": "and i improve on my center control of center most important thing in chess",
        "17... Nb4": "and downgrades his knight position to get another look at the fine bikini clad queen",
        "18. Qe2": "calm retreats again",
        "18... O-O": "castles",
        "19. Be3": "and develops another piece to control the center, ON TOP of that I also have prospects of bringing a knight to c5 and major pieces along the c-file to replace that knight and win the c7-pawn later",
        "19... Nc6": "knight retreats",
        "20. Rac1": "developing last piece to optimal location. It is very bad that Black obstructed c-pawn in the opening. This is a good example of how to win against an opponent who does so. I will channel all pieces along the c-file and win the c7-pawn in the future.",
        "20... e5": "a blunder, Black allows me to exploit superior advantage in the center",
        "21. Rxc6": "I win 2 pieces for rook, a resignable advantage",
        "21... Bxc6": "takes",
        "22. dxe5": "winning pinned bishop along d-file",
        "22... Bxe4": "takes",
        "23. exd6": "takes",
        "23... cxd6": "takes",
        "24. Bc5": "attacking pinned pawn",
        "24... Re8": "x-ray to my queen",
        "25. Bxd6": "winning pawn",
        "25... Bxf3": "trade",
        "26. Qxf3": "take",
        "26... Rc8": "move",
        "27. Qd3": "battery",
        "27... Qf6": "intent",
        "28. Ba3": "retreat",
        "28... Rcd8": "attack",
        "29. Qf1": "retreat",
        "29... Rxd1": "exchange",
        "30. Qxd1": "ok",
        "30... Rd8": "attack",
        "31. Qf3": "ok calm",
        "31... Qxf3": "trade? not so good because bishops become more valuable after a queen trade",
        "32. Bxf3": "bishops more valuable now",
        "32... Rc8": "so he tries to win some pawns",
        "33. Kg2": "intent center",
        "33... a5": "tries to win a piece",
        "34. Bd6": "get out",
        "34... b4": "move",
        "35. a3": "threatening to win pawn",
        "35... Rd8": "allows",
        "36. Bc7": "skewer",
        "36... Rd2": "pig in the 2nd",
        "37. Bxa5": "takes",
        "37... Rxb2": "takes",
        "38. Bxb4": "Black cannot compete with the extreme complementarity of my pawn and bishops, so Black resigned."
    },
    "url": "https://gameknot.com/annotation.pl/challenge-from-7bees?gm=64692",
    "gameName": "Challenge from 7bees",
    "players": "hexchess (1661) vs. 7bees (1436)",
    "opening": "Reti (A07), King's Indian attack (Barcza system)"
}