{
    "moves": {
        "1. d4 d5 2. c4 dxc4 3. Nf3 Nf6 4. e3 b5 5. a4 Bd7 6. axb5 Bxb5 7. Na3 c6 8. Bxc4 Bxc4 9. Nxc4 e6 10. Bd2 h6 11. Na5 a6 12. Rc1 Ne4": "When black takes the bishop, white's knight is lost.  White could stave off impending doom by advancing the pawn to b4.  Better yet, just move Na5-c4.  Black can't press a pawn against any piece in the c file.  Best, though, is NxPc6.  It's a free pawn, as NxNc6 would be followed by RxNc6.\n",
        "13. Bc3": "\n",
        "13... Nxc3 14. bxc3 Qxa5 15. O-O Ba3 16. Rc2 Bd6 17. Qd3 Qb5 18. c4 Qf5 19. e4": "Black's queen bouncing back and forth allows white's pawns to advance free of charge.",
        "19... Qa5 20. e5 Be7 21. d5": "This exchange doesn't work out so well for white, especially when black had already proposed queen swapping several times.",
        "21... cxd5 22. cxd5 Qxd5 23. Qc3 O-O 24. Qe3 Nc6 25. Rd2 Qb5 26. Qe4 a5 27. Rd7 Rfe8 28. Rc1 Bc5 29. Qf4 Re7 30. Rd2 Ba3 31. Rcd1": "The bishop feints seem a bit pointless, as though black is trying to force white into a position white would prefer.",
        "31... Qb7": "From a post game discussion white conceived of a plan to capture the black queen with this move.  Personally, I couldn't see it.  There is far too much material for white to clear out of the way to pull off any such long range plan.",
        "32. h4 Bb4": "Black again pushes white to a more favorable position, though in this case I understand the desire to promote the a file pawn.",
        "33. Rd2d3 a4 34. Ng5": "Part of white's plan involves a knight sacrifice.  Seems foolhardy when white is already down four points.",
        "34... hxg5": "Down seven!  Though really, the exchange makes the difference six.",
        "35. hxg5 a3": "Now black is two moves from a pawn/rook exchange, for another four point (-10) material advantage.",
        "36. Qh2": "White actually makes an excellent move here.  Qh4 would leave the e pawn undefended against the black knight.",
        "36... f6 37. g6": "Declining the pawn was wise.  Neither I nor white saw the resulting force mate.  White was still inconceivably (to me) eying the black queen.",
        "37... Ree8": "Black may be defending against the potential threat of white's lined up rooks.  Except why?  Black can take Rd8+ with NxR.  Rd1xN would be followed by Ra1xR.  Barring all that, black can still interpose Bf8.  The real threat is Qh7+.  Maybe black was making space for Ne7, or so that the queen could also protect Pg7?",
        "38. Qh7+ Kf8 39. Qh8+ Ke7": "Now here I was thinking PxP, then somehow promoting g6.  White, however, was focused on the black queen.",
        "40. Qxg7#": "Oh, right!  That white rook is there.\n"
    },
    "url": "https://gameknot.com/annotation.pl/challenge-from-worldtraveler?gm=39813",
    "gameName": "Challenge from worldtraveler",
    "players": "worldtraveler (1379) vs. dokimos (1315)",
    "opening": "QGA, 4.e3 (D25)"
}