{
    "moves": {
        "1. e4 Nc6 2. d4 e5 3. Nf3 exd4": "Scotch",
        "4. Nxd4 Nxd4 5. Qxd4 c5 6. Qa4 a6 7. c4 Bd6 8. Be2 Nf6 9. Nc3 O-O 10. Bg5 Be5 11. f4 Bxc3+ 12. bxc3 Qb6 13. Qc2 Qe6 14. Bxf6 Qxf6 15. O-O": "White has a formidable centre and the doubled c-pawn is not a weakness as it provides open b& d files.",
        "15... d6 16. Rab1": "Utilising the open file and preventing Black bishop from developing",
        "16... Rb8 17. Rb6": "Blokade b-pawn and pinning d6 pawn",
        "17... Rd8 18. Qd3": "White has to protect c-pawn and f-pawn so the rook at f1 can move. Ideal square will be g3 which threatens Blacks king as well",
        "18... Ra8 19. Qg3 a5 20. Rfb1": "Again to prevent Black Bishop movement. ",
        "20... a4 21. a3": "Blacks pawns are blocked and Black  bishop has become a 'bad' one",
        "21... Rb8 22. Ra6": "...axb6(R) will lead to Rxb8(R), entry for the rook to 8th rank",
        "22... Bd7": "Black avoids it. But d6-pawn loses support from R at d8",
        "23. e5": "take advantage of the pin at d6.",
        "23... Qg6": "Grab the d6 pawn after exchange at g6. If ....Qf5 then Bd3",
        "24. Qxg6 hxg6 25. Rxd6 Bc6 26. Rbd1": "do not give up control of open file",
        "26... Rde8 27. Kf2": "Centralize the king as endgame is approaching",
        "27... Re6 28. Bg4 Rxd6 29. Rxd6": "echange is all the better for white",
        "29... f5": "Black did not expect en passent",
        "30. exf6 e.p. gxf6 31. Rxf6": "another pawn falls",
        "31... Kg7 32. Re6": "Laying trap if ...Bd7 then Re7  wins the bishop. If ....Rd8 then Ke3",
        "32... Re8": "Black did not fall for the trap. But exchange will favor white as he is two pawns up",
        "33. Rxe8 Bxe8 34. Bf3 b5": "Interesting position!. If 35.Bd5 b4! 36.cxb4 cxb4 37.axb4 Bc6!!\nBxc6 is a taboo. If 38Bxc6 a3! and the Black's a-pawn is unstoppable. White's Bishop can not stop a-pawn due to its own pawn at c4.\nIf White avoids capture by Be6 Black will play Bd7. Any other move, black will simply push a-pawn",
        "35. cxb5": "So White captures the pawn. With 2 pawns up it is a sure win",
        "35... Bxb5 36. Ke3": "bringing king to centre for active play",
        "36... Kf6 37. Be4": "Prevent Black king's advance",
        "37... g5 38. fxg5+ Kxg5 39. Bd5 Kf5 40. h3 Kg5 41. Ke4 Bf1 42. Ke5 Kh4 43. Kd6 c4 44. Kc5 Kg3 45. Kb4 Bxg2 46. Bxg2 Kxg2 47. h4": "h-pawn is unstoppable! 1-0"
    },
    "url": "https://gameknot.com/annotation.pl/challenge-from-vijayendra?gm=1697",
    "gameName": "Challenge from vijayendra",
    "players": "vijayendra (1200) vs. udayabhat (1200)",
    "opening": "KP (B00), Nimzovich defence"
}