{
    "moves": {
        "1. e4": "I always start with e4, its a weakness of me ...",
        "1... c5 2. c3": "Nf3 is the normal answer, or Nc3 (closed variation). This move gives faster an open center.",
        "2... e6 3. d4 d5 4. exd5 Qxd5": "Too soon to come out with the Queen. e x d5 was better",
        "5. Nf3 Nf6 6. Na3 cxd4": "Why ?? Black should develop. Be7 or Nc6. Also to consider is retrieving the Queen and accepting the tempo loss with Qd8",
        "7. Nb5": "I am forcing the black Knight to the side",
        "7... Na6 8. Qxd4": "I want to avoid that e5 is played and i want to keep the center.",
        "8... Bc5": "Good move! Now i have to take position",
        "9. Qxd5 exd5": "I would have taken with the Knight. The d-pawn stands not connected and is weak.",
        "10. Be2 O-O 11. O-O Bg4": "Good move. Re8 was also good",
        "12. a4 Rfe8": "Good! Forcing me into tempo loss",
        "13. Bd1 Rad8": "Difficult choice. Not a bad move, but without spirit. I would have played Bd7 or h6",
        "14. Bg5 Bxf3": "No, not good. You activate my Bishop. ",
        "15. Bxf3 Re6": "Better was Be7",
        "16. Rfd1": "I start to put pressure on the weak pawn.",
        "16... Rde8": "I know that theory would advise to take the open line ...but you are ruining your pawn position",
        "17. Bxf6 gxf6": "I mentioned this already. You hang on to that open line, but you cannot accomplish anything with this line for the moment",
        "18. b4 Bf8 19. Bxd5": "There goes the d pawn",
        "19... Re6e5 20. Bxb7": "Loosing more material. Actually the game is already over now.",
        "20... Nb8 21. f4": "Making room for the Bishop on f3 whilst gaining a tempo",
        "21... Re5e7 22. Bf3 a6 23. Nd6": "Coming to the King side and luring to f6 pawn",
        "23... Rd8 24. Ne4": "Never exchange pieces when you are behind in material. Its lost but why not Rc8 ",
        "24... Rxd1+ 25. Rxd1 f5 26. Nf6+ Kg7 27. Nh5+ Kg8 28. Rd8 Nd7": "Allowing a \"petite combination\"",
        "29. Rxd7 Rxd7 30. Nf6+ Kg7 31. Nxd7 Bd6 32. g3": "I secure the King side and will go to promote a pawn on Q side.",
        "32... a5 33. bxa5": "a pawn cannot be stopped. Game over."
    },
    "url": "https://gameknot.com/annotation.pl/challenge-from-chess-knot?gm=22981",
    "gameName": "Challenge from chess-knot",
    "players": "esmet (2217) vs. chess-knot (1698)",
    "opening": "Sicilian (B22), Alapin's variation (2.c3)"
}