{
    "moves": {
        "1. e4": "I played this move knowing that my opponent was going to play the Sicilian! I know this because \"goldaxe2006\" is one of my friends in real life...not just on gameknot. The bad thing is...he knows 25 moves of Theory for the Dragon...",
        "1... c5": "As I expected...",
        "2. Nf3": "I chose to play Nf3(fully knowing that I could go into some highly theoretical lines where he is the favourite)",
        "2... d6": "d6 can lead into many lines such as the Scheveningen,Acc Drag,Dragon,Najdorf(etc).",
        "3. d4": "I was prepared to play the Open Sicilian.",
        "3... cxd4": "He takes...obviously.",
        "4. Nxd4": "Nxd4!? I was willing to let him play his pet line because I had a novelty in store for him...",
        "4... Nf6": "Alas! Dragon it is!",
        "5. Nc3": "Nc3 is White's best choice here...the alternative Bd3?! doesn't command as much space as Nc3. This relates back to the general Opening Rule: \"Knights before Bishops\".",
        "5... g6": "with g6, Black aims to fianchetto his Bishop and then to castle king-side; setting up the main line of the Sicilian Dragon",
        "6. Be3": "Be3 is the most logical and theoretical move here.",
        "6... Bg7": "Black Fianchetto's his Bishop very logically.",
        "7. f3": "f3! A very common move in the Sicilian Dragon. f3 supports the e pawn which can come under massive threats in the next couple of moves, it also allows White the option of playing g4!? after he has developed his Queen to d2 and castled Queen-Side. The variation where g4!? is played is known as the \"Yugoslav Attack\" and I believe it is very effective for White.",
        "7... Nc6": "Nc6 is theoretical once again on Black's part.",
        "8. Qd2": "Qd2, My aims are clear, To prepare a huge king-side attack, with moves such as g4,h4 and Be2.",
        "8... Bd7": "In the Sicilian Dragon, White aims to attack on the King-Side whereas Black will always try to attack on the Queen-Side - This can lead to some very entertaining play and lots of games end in a quick finish. Bd7 portrays Black's ideas of attacking on the Queen-Side as it allows moves such as Rac8(etc).",
        "9. O-O-O": "White brings his A rook into the game by castling Queen-Side, now White will try to attack on the King-Side.",
        "9... Rc8": "Rc8...The most theoreticalk move here, note that Black has chosen to not castle here as he is aware of my knowledge and understanding in the Yugoslav Attack Line.",
        "10. g4": "g4! I have been preparing this for several moves...You can see how White has a commanding lead on the King-Side!!",
        "10... Ne5": "This is a very common move, which threatens many different ideas such as Nc4 for instance?",
        "11. h4": "I continue my attack on the King-Side!",
        "11... h5": "Black knows this line well out of experience so he counters with h5.",
        "12. gxh5": "instead of playing g5 which leads to Nh7 and my attack on the King-Side is thwarted, I chose to play the novelty of gxh5! Not only does this open up my position slightly but it leaves my opponent bewildered. Goldaxe2006 knows lots of Theory on this line so this novelty left him wondering what to do.",
        "12... Nxh5": "Nxh5 seems to be the most logical reply.\r\n",
        "13. Rg1": "Rg1, in my view is a strong,logical move as it prevents dangerous advances of the f-pawn at a later stage.",
        "13... Qa5": "Black immediately attacks on the Queen-Side, typical of Black in the Sicilian Dragon.",
        "14. Nb3": "Nb3 immediately questions the motives of the Queen on a5! A good move, the only draw-back here is perhaps that now the c3 Knight is open to some strange and timely sacrifices.",
        "14... Qc7": "The best Queen for the square, if the Queen were to retreat to d8, I would have just won a couple of free moves and the short expeditions of the Queen would have been quite pointless.",
        "15. Nd5": "Nd5! I like this move because it averts potential sacrifices on the c3 square by black, it also tries to cramp up Black's position and forces Black's Queen onto a square which is not in the game.",
        "15... Qb8": "Black's Queen retreats to b8, as you can see it is not doing anything at all on this square.",
        "16. Be2": "Be2! Supporting the f3 pawn and developing the Bishop, a very logical reply from myself.",
        "16... Nc4": "Black tries to gain some counter-play by offering the exchange.",
        "17. Bxc4": "In exchanging the pieces, I believed that my position was a little superior to my opponent's.",
        "17... Rxc4": "Black takes...What else can he do?",
        "18. Kb1": "I chose to play Kb1 to avoid potential threats of the Black Bishop coming to h6 if a few pieces are swapped off, so eventually my Queen could have been pinned to the king or some pieces would have been in some very awkward positions.",
        "18... Nf6": "Black chooses to bring his in-active Knight into the game...a very logical move on Black's part.",
        "19. Bd4": "I immediately aim to pressurize Black's position!",
        "19... Be6": "Be6?! Immediately putting the motives of my d5 Knight to question.",
        "20. Nxf6+": "I choose to exchange, believing that after a series of exchanges, I come out with a slightly superior position.",
        "20... Bxf6": "Taking with the f-pawn would have severely worsened Black's position.\r\n",
        "21. Bxf6": "I choose to exchange...quite logically.",
        "21... exf6": "Black has to take.",
        "22. Qxd6": "forcing the exchange of Queens.",
        "22... Qxd6": "Off they come:-):-D",
        "23. Rxd6": "If the Rook doesn't take, I might as well resign...but I am sure that you all know that.",
        "23... Rxh4": "Black equalizes the material.",
        "24. Rgd1": "With Rg-d1 I know completely control the very important d-file, so I believe that I have a slightly superior position now.",
        "24... Rh2": "Black tries to attack my Queen-Side pawns...A fair enough reply from Black.",
        "25. Nd4": "Nd4! Centralising the Knight is very good from White I do believe, as it cannot be hacked off of this strong square by the Black Bishop or by a pawn.",
        "25... Bd7": "Bd7...Where else can Black go without getting destroyed down the d and e files.",
        "26. c3": "I support my centralised Knight while repelling potential threats on c2.",
        "26... Ke7": "Black chooses to bring his King closer to the centre.",
        "27. Rd5": "I did not want to lose the power of my centralised Knight here, so I decided to bring my Rook back to d5, on d5 it is still on a very commanding square.",
        "27... Rf2": "Black goes on the pawn hunt but White has a clearly better position here.",
        "28. Kc1": "Black now has the option of Ba4 but after Rd3, White has a better position and is threatening to reak havoc on Black's Position.",
        "28... Rc8": "Black chooses to try to do something with his Rook, perhaps aiming to bring it to the h-file where it is more commanding.",
        "29. Ra5": "Ra5! Threatening the Pawn and preventing potential threats of the Bishop coming to a4.",
        "29... a6": "Black's only reasonable move, Ra8?? just puts the Rook on a bad square.",
        "30. Rd2": "Aiming to exchange Black's most active Rook.",
        "30... Rxd2": "Black accepts my offer of exchanging.",
        "31. Kxd2": "In taking back the Rook, I believe that I have gained a superior position. Hopefully, my 2 king side pawns will be able to contain his doubled f-pawns and his g pawn while my 3 Queen-side pawns can create a passed pawn out of my opponent's 2 Queen-Side pawns. White has at least a draw here(assuming he plays at least half sensibly).",
        "31... Rh8": "Rh8! Is a good move from Black, it aims to bring the black Rook into the game, despite his efforts...their is not much Black can hope for here(other than a draw).",
        "32. Ke3": "Ke3! I chose to bring my King into the game for the end-game, this game is White's to be won!",
        "32... Rh2": "Rh2 threatens a pawn siege on b2.",
        "33. b3": "b3, halting Black's hopes along the 1st and 2nd ranks.",
        "33... Rb2": "Black is just being passive here...looking for the draw. A move such as Rb2 is basically saying \"Would you like a draw?\". I know that I have at least a draw here so I should play on. GMs say that anyone under 2200 level should always play for the win and they should play on if they think they have a slight chance of winning. What is the point in taking a draw if I know that the draw is in the bag and I have a slight advantage!?",
        "34. c4": "Preparing to advance my Queen-Side Pawns(Looking for the win)...",
        "34... Be6": "Be6!? Again another passive/drawish move my Black, Black has no plans of winning here...all of the winning chances are for White.",
        "35. a3": "a3! Taking the oppurtunity to advance on the Queen-side.",
        "35... Bd7": "Here we go again...Black is totally dumbfounded here, he has been forced into making passive moves. A draw is virtually guaranteed here! So I can afford to play on for a few moves in order to see if I can win.",
        "36. b4": "b4! Making further advancement on the Queen-Side.",
        "36... Bc8": "As you can see, Black's last 4 or 5 moves have not done anything at all, they are basically accepting a draw in the position. Most players would accept a draw here as White but you should ALWAYS play for the win if the draw is in the bag...White has quite strong winning chances if he plays well here.",
        "37. c5": "c5! Making further advancement on the Queen-Side and preventing the threat of b6!?",
        "37... Bd7": "The Bishop moves ONCE again. Notice that Black has done absolutely NOTHING to improve his position in the last couple of moves - allowing White to further his plans.",
        "38. c6": "c6! Forcing the exchange of some pieces and some pawns.",
        "38... Bxc6": "The Bishop takes, forcing the Knight to exchange it!",
        "39. Nxc6+": "As I do...",
        "39... bxc6": "The Pawn HAS to recapture...obviously.",
        "40. Rxa6": "I have managed to create a passed a pawn!",
        "40... Rb1": "Rb1.. a passive move...forcing me to swap off the a pawn for the c pawn! This is quite good for me though as a Rook on the c-file cuts the King off from getting to the passed B Pawn! White's chances of winning look very good now!",
        "41. Rxc6": "I snap up the pawn without hesitation!",
        "41... Rb3+": "I saw this coming...",
        "42. Kd4": "Kd4! Perhaps the winning move...Bringing the King into the game aids the chances of the B Pawn promoting.",
        "42... Rxa3": "If Black takes the F-Pawn it is basically game over but to be fair, It is probably won for White now anyway.",
        "43. Rc3": "If the Rooks are exchanged, Black loses on the spot, White will eventually manage to Queen one of his pawns.",
        "43... Ra8": "Black is getting desperate now!",
        "44. Rc7+": "This move wins on the spot, the King can't come to d6 because the f pawn dies. If black moves the King out of the way, the B Pawn is going to advance very easily.",
        "44... Ke8": "Ke8?! What else can Black do here!?",
        "45. b5": "b5.......Black resigns now, the b pawn is going to promote and force Black to give up his Rook and White will be able to win easily.\r\n\r\nAll in all, White's 2 King-Side pawns managed to contain Black's doubled f pawns and his g-pawn while my Queen-Side pawns were allowed to promote. A very well played game by White!"
    },
    "url": "https://gameknot.com/annotation.pl/challenge-from-rocksy123?gm=3994",
    "gameName": "Challenge from rocksy123",
    "players": "rocksy123 (1523) vs. goldaxe2006 (1722)",
    "opening": "Sicilian (B75), dragon, Yugoslav attack"
}