{
    "moves": {
        "1. e4 c5": "Clearing the black diagonal in preperation for Bg2",
        "2. Nf3 g6 3. d4 Bg7 4. Bc4": "Brett threatens Ng5 attacking f2",
        "4... e6 5. dxc5 Qa5+": "Classic beginner's mistake, \"don't bring out the Queen too early\", the rest of this game demonstrates why.",
        "6. c3 Qxc5 7. Bd3 Nf6 8. Be3 Qc7 9. O-O O-O": "Now we're all tucked up in our castles, but look at the difference in development and space control.  Brett's bishops dominate the board and his e-pawn is about to become the pivot for subsequent attacks.",
        "10. e5 Nd5 11. Bd4 Nc6 12. Bc5 Re8 13. Re1": "At this point I really should have played Ne5 ",
        "13... b6": "But instead tried to dislodge the bishop",
        "14. Bd6": "Not the result I'd hoped for",
        "14... Qd8 15. Bc4 Nf4 16. Nbd2 Bf8 17. Ne4": "Still want to shift the bishop, but don't want his knight in it's place!",
        "17... Be7 18. Bxe7 Rxe7 19. Qd2 Nh5 20. g4": "Opening up the white king's defence like that looks like a bad move, Qh6 would have been a more substantial threat",
        "20... f5 21. exf6 e.p. Nxf6 22. Nxf6+": "Now I have a knight and bishop to deal with, along with the impending threat of the half open e file and Brett's rooks.  Why did I have to move that Queen??!",
        "22... Kg7 23. g5 Bb7": "The pawn on f2 looks like a potential weak point - I line up the bishop and prepare for either Qf1 or Rf2.  Which of these would be better,  or is there another possibility altogether?",
        "24. Qf4 Rf7": "Pinning the knight",
        "25. Rad1": "This puts pressure on my e-pawn, need to come up with something good NOW",
        "25... a6": "This isn't it.  Brett flings his bishop into the fray, I'm running out of possiblities.",
        "26. Bxe6 Re7 27. Nh5+": "Rg8 may have been a better move, but by this time I think it would just be delaying the inevitable.",
        "27... gxh5 28. Qf6#": "Check mate and cheers, mate.  Remember now, children, leave the Queen moves till last unless there's a VERY good reason not to."
    },
    "url": "https://gameknot.com/annotation.pl/challenge-from-raziell?gm=23636",
    "gameName": "Challenge from raziell",
    "players": "raziell (1464) vs. lumenator (1473)",
    "opening": "Sicilian (B27), Hungarian variation"
}