{
    "moves": {
        "1. e4": "So, I start off with my usual.",
        "1... e5": "I'm not surprised that he played this, as it's the most common.  I wasn't sure what to expect since this was my first time against Michael.  However, after seeing this and my next move would be, I anticipated that this would become a Ruy Lopez which is what happened.",
        "2. Nf3 Nc6 3. Bb5 a6 4. Ba4 Nf6 5. Nc3": "However, better was to castle.  This is what reversion has noticed before playing this.  The only thing to note is that this move was played before my game against Jack Stockel.  Therefore, I was only remembering what tipsyjourneyman said which is that it's preferable to hold off on castling until later.  He recommended this move.  However, I base things on what cplusplus11 has also noted.  And, after that game, he said, to learn some theory because, after this variation (which you most often see) 5.0-0 is most often played.  Like that game, I was worried about losing a pawn, after ....Nxe4.  The truth, however, is that black would not be able to hold onto it, after white plays Re1.  Had this happened after my game with Jack, I would've stuck to mainlines.",
        "5... Bc5": "Consequently Michael develops, whilst, punishes me for my last move since I can no longer gain tempo with 6.c3, followed by 7.d4.",
        "6. d3": "But, as chesskingdom64 has noted, \"There's always another way of doing something.\"  The idea behind, \"the c3-d4 plans\" involves a pawn chain.  I remember this based on comments from reversion.  Now, I considered 6.d4 with an exchange, except even afterwards, I'm down a pawn.  With this move, however, not only do I have an open line for my Bc1, but white now has a solid pawn chain.  The only question is if it holds.",
        "6... O-O": "Meanwhile, Michael castles.",
        "7. O-O": "So do I.  Part of it is because I was worried about the possibility of 7...Ng4, which would threaten the fork.  7.Be3 was playable, but I was not going to exchange bishops, as I'd lose my weakest pawn.  When that happens, you're in a lot of trouble, as I learned from TA.  For one thing, it would make castling short unsafe, but there's more to it because, afterwards, you're vulnerable.  Make one error, and it's generally over.  Well, I wasn't going to take a risk of being caught in that situation.",
        "7... Re8": "Centralizing his Rook which is generally good.",
        "8. Nd5": "After studying an annotation with elyhim, I realize that this could be dangerous.  So, why take chances?  In addition, this is also becoming a closed position since his pawns are blocking the center.  Now, it boils down to which N is stronger.  I figured that his Nf6 is more of a liability, so I decide to play right away.  Of course, I'm aware that it will result in doubled pawns.  But, in this position it's of no asset since we have not reached the midgame, yet.  And, major pieces haven't been exchanged, as I've learned from tactical-abyss.  In addition, I accurately calculate the gain of tempo for white since black must retreat, keeping in mind what reversion said when it came to c3, followed by d4, when a bishop is near there.  Although a different position, it's still applicable, to me.",
        "8... Nxd5 9. exd5 Ne7 10. Nxe5": "So, I decide to exchange, knowing that when he takes back, the doubled pawns are gone.  This is something that TA also outlined when determining if they're a liability, or not.",
        "10... Nxd5 11. d4": "Part of the plan involved the gain of more time, btw.",
        "11... Ba7 12. Bb3": "Going after his Nd5.",
        "12... d6": "Michael has the same idea, adding a pawn chain and gaining tempo, himself.",
        "13. Nf3": "I did consider 13.Bxd5, with a, supposed idea, of winning a pawn, after 13...dxe5, 14.dxe5, but figured out that he would play 14...Rxe5 (afterwards).  The only reason behind this move was the win of material.  So, after figuring out how he'd win that, I determined that taking would be pointless, and thus, decided to protect.  Afterall, as kenneth_fiore_3 noted, you don't just exchange for the thrill of it.  Instead, there has to be a good reason.  It appeared there was earlier but not in this position.  That, is especially because, by not doing so, I'm going to gain time.",
        "13... Nf6 14. Bg5": "Which enables me to complete my development, whilst pinning his N.",
        "14... Bg4": "So does Michael.  Thus, the saying, \"a pin for a pin\".",
        "15. Qd3": "Therefore, I decide to break the same pin.  And, at the same time, if Michael takes, I can also recapture with the Queen, leaving me with a better structure.",
        "15... d5": "I'm not sure why Michael played this.  But, I viewed it as pointless since that pawn chain is gone.  Before, I couldn't play 16.Ne5, so I felt that this left him with a weakness.  That's why, I take that opportunity to attack, as there's no immediate threat, plus, white gains time, in the process.",
        "16. Ne5 Bh5 17. Rae1": "Which I use to centralize one of my Rooks.",
        "17... c6": "I'm not sure why Michael played this.  ",
        "18. c4": "? But, figuring that it was pointless, I decide to exchange.  In doing so, however, I missed the picture, as Mike will win the pawn.  I thought I could win it back by exchanging, but this is where calculating deeper into the variations was important, as reversion told me.  And, it's important to note, that I lost a recent Wizard Chess Game with that mistake, so it's really something to work on.  ",
        "18... dxc4 19. Bxc4 Qxd4 20. Qxd4 Bxd4 21. Nd3": "Knowing that my N was en-prise, however, I retreat.",
        "21... Ne4": "Except, that I'm in more trouble, then I could've realized.  Michael going for a Knight fork, which turns out to be inevitable.  ",
        "22. Nf4": "But, at the time, I didn't think it was.  So, I do what I can to defend against the threat.  The idea is that Michael wants to my Re1 for a Knight which is only worth 2.  This would add to a total of 3, do to being a pawn down.  Therefore, I go right after his Bh5, knowing that if Michael takes, I equalize by capturing his LSB, for free.",
        "22... Bf3": "Michael wisely retreats with a counterattack.  It was then that I realized my fate.  ",
        "23. Bh4": "I considered taking on f3.  But, then I thought about it, and with Michael leaving en-prise (deliberately) there must be a good reason for giving away.  As we saw with the Damino's Defense when training someone, stronger players don't just blunder things away.  It was then that I figured out something important.  Michael wants me to take because doing this means exposing my King.  However, he was not going to fool me because I made a similar mistake against Jack Stockel (in our last game each other) which resulted in a different plan.  So, the decision was made to keep my DSB aligned, knowing that if he takes, I've got a defender.  In other words, I'll be able to take, without exposing my monarch.",
        "23... Bg4": "Knowing this, he retreats.",
        "24. g3": "In case, Michael has any mating ideas, in the long run, I open up.",
        "24... Nd2": "As anticipated.   Afterall, Michael has a winning advantage.",
        "25. Rxe8+": "So, I do whatever possible to prevent that.  Without much to lose, I'm just hoping that he'll go wrong, somewhere.  But, I'm also bearing in mind that he won't.  Instead, the plan is using memory techniques, based on what archduke_piccolo when he was losing against redfoxrising which is just being aggressive.  The other plan is what comes after this.  So, when you're losing, it pays off to be overconfident.  In some cases, I've managed to pull swindles by being optimistic.  Against stronger players, however, that usually does not work.",
        "25... Rxe8 26. Rc1": "Figuring that I might have dodged the bullet, I play this.  As noted, even though I don't like liquidating when behind, this was part of my plan, behind 25.Rxe8+  However, this was to an extent, Hope Chess since I overlooked a bigger threat.  I don't know if it's the full definition because it boils down to hoping that you've met a threat without calculating.  Well, white wasn't hoping but missed a bigger threat, anyhow.  Instead, I'd call it Flip Coin Chess because, in reality, I didn't take quite enough time and wound becoming overly confident since there didn't appear much else to lose.  Either way, white is busted.",
        "26... Bf3": "This was played to trap my monarch.",
        "27. Bd3": "Trying to prevent a mating sequence.  The threat was 27...Ne4, followed by 28...Bxf2#  But, Michael will, however, win more material, with his next move.  This time, however, there was no way out.",
        "27... Bxb2": "That's because no matter where I go, he's going to get my Rook.",
        "28. Rf1": "But, this way, however, I get something, in return.",
        "28... Nxf1 29. Kxf1 h6": "Advancing one of his pawns, as this will win more material.",
        "30. Bc4": "Which I attempt to stop.",
        "30... Bc3": "Going on the offense, though.",
        "31. Ng2": "Knowing what kind of trouble I might be in, this is where I try to liquidate.  If I can eliminate his Bf3, there might be a chance to save this game.  Remember the club game that happened with stalhandske and brigadecommander, where I was given Homework over why a move was bad.  The idea being that the bishop would be blocked, so white, I believe would lose a piece for a pawn.  In this position, however, there was no way out.  It's definitely resignable, at this point.  But, resignation, however, isn't going to be option because of what GM Judit Polgar said which is, \"Fight Til the End.\"  In fact, I annotated a game that I won in a lost position with that title.  Moreover, I've told my students not to resign.  And, one of them was able to pull a swindle, on two occasions, by remembering my advise.",
        "31... g5 32. Bxg5": "At least, I get a pawn, in return.  It's true that I'm being overoptimistic, but with no way out, I think positive, as opposed to, negative.  It's also important to note that being this way has helped me to improve, as well.",
        "32... hxg5 33. Ne3": "In addition, my position is no longer cramped, for now.",
        "33... Kg7": "I'm not sure why Michael played this.  ",
        "34. Nf5+": "But, I will stop at nothing to place him in check since the idea is trying to get counterplay.  ",
        "34... Kg6 35. Nd6": "?? But, this is the final blunder.  My focus was going after my N, reattacking and gaining tempo.  However, Michael has a back rank mate threat that I overlooked.  By playing this, he will mate.  35.Ne3 was forced, as it was only the way to protect my Knight, whilst, the back rank.",
        "35... Re1#": ""
    },
    "url": "https://gameknot.com/annotation.pl/challenge-from-nuntar?gm=60478",
    "gameName": "Challenge from nuntar",
    "players": "jkarp (1356) vs. nuntar (1697)",
    "opening": "Ruy Lopez (C77), four knights (Tarrasch) variation"
}