{
    "moves": {
        "1. e4 e5 2. Nf3 d6": "I am told this is Philidor's Defense.  I guess I need to review that in the database sometime.",
        "3. Be2": "I always find the pin on my King's Knight somewhat annoying.",
        "3... Nf6 4. d3": "Defending e4 and opening a line for my Queen's Bishop.",
        "4... h6": "To stop a pin on his King's Knight.",
        "5. O-O Be7 6. Nc3 O-O": "While I am not completely developed, I like my development better than Black's.",
        "7. d4 exd4 8. Nxd4 c5 9. Nf3 Bg4 10. h3 Bxf3 11. Bxf3": "I do believe I lost some tempos in those exchanges.",
        "11... Nbd7 12. Bf4": "Threatening to pick up a pawn.",
        "12... g5": "Black either missed the loss of his pawn or felt he had sufficient compensation for it.",
        "13. Bxd6 Bxd6 14. Qxd6 Re8 15. Rad1": "Well, other than a pawn, it doesn't seem I had gained all that much at this point.  I did have my eye on the b7 pawn at this point, and was considering e5 as my continuation.",
        "15... Qe7 16. Nb5": "Advancing my Knight into an attacking position.",
        "16... Qxd6 17. Rxd6": "My post-game analysis shows NxQ may have been better.  One potential alternative could have gone as follows: 17. NxQ, Reb8; 18. e5, Ndxe5; 19. Bxb7",
        "17... Rec8": "Stopping the fork I was hoping to deliver.",
        "18. e5": "This threatens the Knight at f6 and a Bishop fork at b7.",
        "18... a6 19. Nc3": "A knee-jerk reaction!!  I think 19. Bxb7 was better.",
        "19... Nh7 20. Rxd7": "Taking an immediate three while maintaining the threat on b7. ",
        "20... Rcd8 21. Rxb7 Rd2 22. Rc1 Re8 23. Rb6": "I am willing to trade pawns at this point, particularly as my e5 pawn is fairly vulnerable anyhow.  My real concern was Re6, fortunately Black elected to exchange pawns.",
        "23... Rxe5 24. Rxh6": "The h6 pawn was definitely the more attractive of the two for me as I now attacked the h7 Knight with a potential Bishop fork at e4 if Black was able to capture at c2 somehow.",
        "24... Re6": "Now comes Re6!!  But now I spot something I probably should have seen sooner, so...........",
        "25. Rxe6 fxe6 26. Na4": "This is the move I should have seen earlier.",
        "26... c4": "Avoids the unnecessary loss of the c pawn but still allows the fork on the a and e pawns.",
        "27. Nc5 Rd6": "Presumably protecting both pawns.  However, only the a file pawn is truly protected.",
        "28. Nxe6 Rxe6": "Black takes the bait.  It was better to lose a pawn than a pawn and the exchange.",
        "29. Bd5 Kf7 30. Bxe6+ Kxe6 31. Rd1": "And Black resigned."
    },
    "url": "https://gameknot.com/annotation.pl/challenged?gm=10173",
    "gameName": "Challenged",
    "players": "P L Michael (GK 1200) vs. Khaled Radwan (GK 1438)",
    "opening": "Philidor's defence (C41)"
}