{
    "moves": {
        "1. d4 d5": "Je joue principalement d4 au premier coup et je suis 3 objectifs fondamentaux dès le début de la partie: 1 Le centre; 2 Le centre; 3, le centre.",
        "2. Nf3 Bf5": "Mon adversaire joue son Fou avec les cavaliers, ce qui est contraire au lois générales d'ouverture. En fait, les cases des cavaliers sont connues d'avance. De plus, ils auront à bouger plus que les Fous. Alors autant commencer rapidement.",
        "3. e3 Nf6 4. Bd3 Ne4": "Avec ce coup les Noirs violent à nouveau une autre règle: Ne pas jouer deux fois la même pièce dans l'ouverture. \r\nC'est une perte de temps.",
        "5. O-O e6 6. Nbd2 Nxd2": "L'échange est défavorable aux Noirs. Ils consomment encore un temps pour la prise… ",
        "7. Qxd2 Be4": "Les Noirs jouent à nouveau leur Fou, oubliant de se développer. Sur 7 coups, ils ont joué 3 fois le cavalier (qui a disparu) et deux fois le Fou. \r\nLes blancs n'ont jamais joué deux fois la même pièce, se sont développés et ont déjà roquer…",
        "8. Qe2 Bd6 9. Bxe4 dxe4": "Le retard de dévelopement des Noirs est flagrant (avec un pion doublé)",
        "10. Nd2 f5 11. Qb5+ Nd7": "Bon, là, je me suis dit: J'ai une meilleure position, je suis mieux développé, la faiblesse du pion b7 est flagrante. Allez, j'y vais !! Mieux valait Cç6",
        "12. Qxb7 O-O 13. c4 c5": "ç4 me donne un peu d'air. Néanmoins, il faut que je fasse attention à ne pas me faire enfermer la Dame…",
        "14. Qa6 Nb6": "Da6 n'est pas super. En fait, j'ai croqué un pion, mais je redoute la faiblesse de ma Dame sous l'attaque des Noirs. Je pense à l'enfermement.",
        "15. b4 Qc7": "avec b4, je cherche à ouvrir les lignes… Dç7 perd une pièce, ouf !!",
        "16. bxc5 Bxh2+": "A la mémoire de Fischer peut-être…",
        "17. Kh1 f4": "Les Noirs gaffent. F4 est désastreux. Les noirs ont désormais deux pièces en prises. Dommage que les blancs ne jouent qu'un coup.",
        "18. Nxe4": "Et un pion central, un !",
        "18... f3 19. g3 Bxg3": "Après g3, je suis assez content de ma position. Je vais croquer au moins une pièce, et donc, tout va bien pour moi. En fait, après g3, les blancs sont totalement perdants !! En effet, le pion en f3 empêche toute fuite du Roi. Si la Dame s'immisce sur l'aile Roi, les blancs sont contraints de donner leur Dame pour éviter le mat. 19...Df7, et le sort est réglé pour les Blancs !! Les Noirs n'ont plus qu'à transférer leur Dame sur la colonne h et donner le mat. Inutile de vous préciser que ma propre Dame est carrément hors-jeu !!",
        "20. Nxg3": "Reprendre du Cavalier est encore une erreur, pour les mêmes raisons que le coup précédent...",
        "20... e5 21. cxb6 axb6 22. Qb5 exd4 23. Qd5+ Kh8 24. Qxd4 Rf6 25. Qg4 Raf8 26. Bb2 Rh6+ 27. Nh5": "La pression sur g7 est à son comble…",
        "27... Rxh5+ 28. Qxh5 Qd7 29. Rad1 Rf5 30. Qxf5": ""
    },
    "url": "https://gameknot.com/annotation.pl/championnat-fsgt-ronde-6-le-25-janvier-2008?gm=13530",
    "gameName": "Championnat FSGT. Ronde 6.Le 25 janvier 2008",
    "players": "Christophe Gruhn (1620) vs. Largier Eric (1250)",
    "opening": "Queen's pawn game (D02)"
}