{
    "moves": {
        "1. e4 e5 2. Nf3 Nc6 3. Bb5": "Ruy lopez. One of the first lines I learnt.\n",
        "3... Bc5": "Ok this is different. Either my opponent is unfamiliar with this line, or is playing a little known subvariation. Notice two pieces aiming to control the d4 square, one of which can inevitably be bumped away. Another reason to play this could be to develop the black square outside the pawn chain\n",
        "4. c3": "Common Ruy move. Leaves a posy for my white squared friend, and threatens a pawn push to d4",
        "4... a6 5. Ba4": "Better is Bxc6, dxc6, Nxe5\n",
        "5... b5 6. Bc2": "We are now well and truely out of book. The opening thus far is A70 Ruy Lopez: 3...a6 4 Ba4, Norwegian and Delayed Schliemann, which I can confidently say I have no knowledge of. Black has a eaked out a little queenside space, and fares reasonably well in the development race.\r\n",
        "6... d6": "Not sure about this move. His white squared bishop could already be flanked at b7\r\n",
        "7. d4": "Taking control of the center\n",
        "7... exd4 8. cxd4": "I now have fairly uncontested control of the majority of the central squares which will be able to use to my advantage in the middle game, if can maintain this formation\r\n",
        "8... Bb4+ 9. Nc3": "developing a further piece\n",
        "9... Bg4": "Nice move here... I rather hash up this pin which cannot be thwarted immediately. The threat is Bxf3 removing both defenders from the defense of the D pawn\r\n",
        "10. Qd3": "Although removes the pin on my queen, this doesnt help my d pawn.. better is Be3\r\n",
        "10... Bxf3 11. gxf3": "Doh! Ugly, but necessary to avoid dropping the d pawn.\r\n",
        "11... Nf6": "aiming to castle. Misses the chance to pile up on my vulnerable d pawn with Qf6\r\n",
        "12. Bg5": "responding with a pin of my own. I figured that this would either open his kingside like a tin of sardines or take time to twart. If the later I should have time to castle queenside and create pressure down the g file\r\n",
        "12... h6": "he responds by clarifying the pin\n",
        "13. Bh4": "showing that I'm in for the long haul. g5 appears his only solace.. but at the cost of an overextended pawn position\n",
        "13... g5": "breaks the pin and confides my dark sq bishop to g3.. fairly even chances for both sides at this stage\r\n",
        "14. Bg3": "I would assume we're both aiming to castle queenside here. Black should pressurise the weak pawns starting with d4. My plan will be to support my pawn structure castle queenside, and aim to consolidate upon my central advantage\r\n",
        "14... Nh5": "Not sure its worth a move to threaten a correction to my pawn structure\r\n",
        "15. O-O-O": "With the horsie falling off the edge of the board, provides me with some time to castle\n",
        "15... Nf4": "Wow.. I really didnt expect that. Cant allow establishment of an outpost in such cushy territory... Instead I'll have that file to your uncastled kingside thankyou very much\r\n",
        "16. Bxf4 gxf4 17. Nd5": "With black handing over the initiative on a plate, he should aim to trade pieces. So instead of keeping in the firing line I activate my stead and grab this great posy which threatens squares all round from hither.\r\n",
        "17... Ba5": "Quite simply best move here (I think). Removes bishop threat, removes horses duty to safeguard bishop, safeguards the c pawn, and removes her majesties duty of safeguarding the c pawn, and can switch the bishop over to b6 and threaten the d pawn eventually... gasp\r\n",
        "18. Rhg1": "hitting the open file\r\n",
        "18... Qh4": "threatening pawns and aiming for queenside castling\n",
        "19. Rg4": "Kind of a decoy :) Offering a few pawns for an all out attack. If the queen wimps out and returns to d8 I double on the g file. Here I could have played the solid positional Rg2 instead but what they hey!\r\n",
        "19... Qxh2": "queen squirts around like pac man. Yum!\r\n",
        "20. Nf6+": "I take away blacks castling privileges, and my pieces are poised to come alive",
        "20... Ke7": "? Inadverantly walking into danger. Kf8 to bolster the g file is probably better\r\n",
        "21. e5": "I'll give myself a ! for this move. Opening lines and exploiting blacks exposed position\n",
        "21... Qxf2": "Gulp her majesty munches on another, to be fair its difficult for black to get his queen back into play... I gather he's playing for a future Qe3 with the intention of trading queens from here",
        "22. Qf5": "Building my forces for an all out blitzkreig.. the second of three really punishing positional attacking moves by me!",
        "22... Rad8": "protecting against the non intended threat of Qd7... however kind of missed the point\r\n",
        "23. Rg7": "bam! and black is overrun and facing multiple mating tactics... the f pawn is now pinned and I'm threating Qe6ch or Nd5ch amongst other threats\r\n",
        "23... Kf8": "fleeing isnt always surviving here. But somewhat unfortuanately for my own efficicacy sake I managed to not see the various mating from here on in... possibly oweing to lack of time on the clock (I'm going to stick to that excuse!)\r\n",
        "24. Rxf7+": "radical!? However i missed the simple  Nh7ch, Rxh7, Qxf7#. however on the bright side I've regained a pawn!\r\n",
        "24... Kxf7": "of course\r\n",
        "25. Ne4+": "one of the worst queen grabbing discovered checks I've played since it misses e6ch, Ke7, Nd5ch, Ke8, Qf7#...but proved enough to force resignation. Hope you enjoyed the game, as I did playing it.\r\n"
    },
    "url": "https://gameknot.com/annotation.pl/chaotic-speedchess-miniature?gm=10683",
    "gameName": "chaotic speedchess miniature",
    "players": "kiwino8 (1276) vs. navydas (1266)",
    "opening": "Ruy Lopez (C64), classical defence, 4.c3"
}