{
    "moves": {
        "1. d4": "In this game, we enter a doubled-edged, but known position, where white has sacrificed a pawn but in return has ample compensation. My opponent is the first to deviate from the opening databases I am using. I try to prove his deviation wrong, by a bold attack on his rook by my bishop. He ignores this attack and offer the rook which I take. He offers a second pawn which I also take, and then a third which I also takes. He then finds a stunning bishop sacrifice, which leads to mate in 5 if I take. I decline the bishop, and he quickly regains all his sacrificed material and my position is a wreck. I struggle on, but it is hopeless!",
        "1... Nf6": "If you want annotation on these early moves see this game. http://gameknot.com/annotation.pl/shropshire-2-v-wood-green-mm3?gm=62262",
        "2. c4 g6 3. Nc3 d5": "So it starts out as a Grünfeld Defence https://en.wikipedia.org/wiki/Gr%C3%BCnfeld_Defence.",
        "4. cxd5 Nxd5 5. e4 Nxc3 6. bxc3": "Which white has countered with the exchange variation - the most popular way of meeting it, but certainly not the only way.",
        "6... Bg7": "Reuben Fine in his excellent book \"The idea behind Chess Openings\" (1943) stated that black had to play 6....c7-c5 before white could stop it with Ba3. However soon afterwards it was found that Ba3 could be met with Nd7! followed by c7-c5! and white's pawn formation is shattered if the pawn is accepted. Playing Bg7 and 0-0 before c7-c5 does also have the advantage of avoiding lines where white checks on b5 with the Bf1 - not that those lines are particularly good for white - but it saves me from having to learn the theory! ",
        "7. Nf3": "For decades, theory held that the correct method of development was with Bc4 and Ne2, often followed by 0-0 and f4–f5, playing for a central breakthrough or king-side attack. It was generally thought that an early Nf3 was weak in the Exchange Variation because it allowed Black too much pressure on the centre with ...Bg4. In the late 1970s, however, Karpov, Kasparov and others found different methods to play the Exchange Variation with White, often involving an early Rb1 to remove the rook from the sensitive a1–h8 diagonal, as well as attempting to hinder the development of Black's queen-side. So this move rather signals that he will adopt one of these more modern approaches.",
        "7... O-O 8. Be2 c5 9. Rb1": "From my point of view, we are now moving into the second phase of the game. Up to now I had been playing what I always play in this position, but now my moves are guided by the opening databases. Incidentally this variation is officially known as \"the modern exchange variation\".",
        "9... cxd4": "This is the most popular.",
        "10. cxd4": "Clearly the strongest recapture, otherwise the pawn on c3 is weak - isolated and open to attack on open c file.",
        "10... Qa5+": "Similar to this game. http://gameknot.com/annotation.pl/shropshire-2-v-wood-green-mm3?gm=62262",
        "11. Bd2": "White boldly sacrifices the a pawn rather than submit to an exchange of queens - and the loss of attacking possibilities which goes with it - by Qd2. ",
        "11... Qxa2": "This is a known pawn sacrifice. White has attacking chances in return for the pawn. The position is unbalanced with opportunities for both sides. If black can weather the storm, the extra pawn may be vital in an ending.",
        "12. O-O": "White completes the development.",
        "12... Bg4": "I decide to offer the return of the pawn, in order to activate my pieces - a decision based on the fact that this seems to be the most widely played move in this position.",
        "13. Bg5": "He attacks my e pawn.",
        "13... Qe6": "Queen hurries back to defend. h6 is actually the most popular move in this position, but Qe6 is second most popular and seemed to score better.",
        "14. Re1": "He centralised his rook as in San Segundo Carrillo, Pablo (2483) vs. Alonso, Salvador (2339). From my point of view, this is where I had to start to think for myself - I didn't want to follow the game above, with h6, as white won! Of course I can't take on e4 as he has Ba6! discovering an attack on my queen and after my queen moves he has Bxb7 and BxRa8. I wanted to develop my knight to c6, but of course to play it immediately allows the fork d4-d5, so how about Qe6-d7 keeping the protection of e7, protecting b7 and preparing to develop the knight to c6.",
        "14... Qd7": "So I played it!",
        "15. d5": "And he stops it again. ",
        "15... Bc3": "This seemed to me to be a very logical move - I thought either he was forced to move his rook back to f1 or to block my attack with knight or bishop to d2, allowing exchanges which are favourable to me, the side with the extra pawn. Foolishly I didn't even consider other moves where white sacrifices the exchange. Gameknot gives 15. Bc3 as a mistake and recommends Na6 and I think its right.\narchduke_piccolo: H'mmm. Bold and unexpected. There are so many ways to respond to this aggression. Which to choose...? Big think time me-erm-thinks...",
        "16. Qb3": "So this is the stunning offer of an exchange. Now if I don't take he will play his rook on e1 to d1 or c1 with advantage.",
        "16... Bxe1": "So I took.",
        "17. Ne5": "This is another excellent move by my opponent, which again I hadn't really looked at. I had rather expected him to take back on e1 with his rook, and then white hasn't got compensation for the sacrifices material.",
        "17... Qc7": "Gameknot gives this as another mistake and recommends Qd8, and is probably correct, but I wanted to keep b7 protected.\narchduke_piccolo: Fascinating position. I have very active pieces, plenty of space , all sorts of possibilities...\ncharleshiggie: Yes, you have! But you have given me the Christmas presents of an exchange and pawn...\n(I think it was about 26-12-2016 now)",
        "18. Nxg4": "So he recaptures this bishop rather than the Be1.",
        "18... Ba5": "And my other bishop runs away. Ideally I would have loved to return to c3 and then g7, but 18....Bc3 runs into 19. Rc1 (win with the pin!) Rc8 20. Bd2 and I'm losing material.",
        "19. d6": "archduke_piccolo: Here, have another pawn.  ",
        "19... Qxd6": "charleshiggie: Many thanks! It would be rather rude not to accept Christmas presents..",
        "20. Qb2": "At this point I was rather concerned about him playing Bh6 threatening my rook and a mate on g7. ",
        "20... f6": "So I played this - my third mistake. I should have returned a pawn with e5! Gameknot gives the line  e5 21. Bf6 Re8 22. Bxe5 Rxe5 23. Nxe5 Qb6 24. Nc4 Qxb2 25. Rxb2 Nc6 26. Rxb7 Nd4 27. Bd3 with a slight advantage to white of 0.61 \nGenerally I was far too over-confident in this position. I didn't realise that Bc3 had been a mistake and that white actually had an advantage here - I thought that white didn't have enough for the sacrificed material. Knowing when a side has sufficient compensation or not is a key skill that separates somene like me - a good club player - from a master.",
        "21. e5": "Another excellent move by my opponent!",
        "21... fxe5": "charleshiggie: And another, you really are too kind...\nThis in fact is my fourth and final mistake and white soon proves to have a winning position. \nGameknot gives Qe6 22. exf6 exf6 23. Bxf6 Rf7 24. Nh6+ Kf8 25. Nxf7 Kxf7 26. Qxb7+ Kxf6 27. Qxa8 Qxe2 28. Qxb8 Bb6 29. Qh8+ Kf5 30. Qxh7 Qxf2+ as the best continuation for black - but still white has an advantage of 2.56",
        "22. Rd1": "He hits my queen.",
        "22... Qc7": "My queen runs.",
        "23. Bc4+": "My first thought when I saw this was it was a mistake, and I could just take it. Then I realised that if I took it, it is mate in 6. http://gameknot.com/chess-puzzle.pl?pz=183350\nIt now dawned on me, that far from having inadequate compensation for the sacrificed material, white was winning easily.\nI have to start giving back material, starting with the e pawn so that my queen can protect along the 7th rank.\ncharleshiggie: Bc4+! is a wonderful move! Congratulations on finding it!\n",
        "23... e6": "So the e pawn goes.",
        "24. Bxe6+": "He takes with check.",
        "24... Kg7": "King comes up. If it went to h8 instead, then 25. Nxe5 threatens Nf7 or Nxg6 mate.",
        "25. Bh6+": "Throws in another check.",
        "25... Kh8": "King retreats to the corner.",
        "26. Bxf8": "White now has a material advantage and a much better position - all his pieces are in play and my Ra8 and Nb8 are still unmoved. However, Gameknot says even better was 26. Nxe5 Bc3 27. Nf7+ Kg8 28. Qa3 Bg7 29. Bxg7 Nc6 30. Bxf8 Rxf8 31. Ng5+ Kg7 32. Rd7+ Qxd7 33. Bxd7 Rf6 34. Ne4 Rf4 35. Qb2+ Kh6 36. Qxb7",
        "26... Nc6": "My knight finally comes out.",
        "27. Rd7": "Looks good - attacking my queen - but Gameknot says even better was 27. Bd6 Qg7 28. Bxe5 Nxe5 29. Nxe5 Rf8 30. Rd3 Rf6 31. Rd7 Rxe6 32. Rxg7 Kxg7 33. Qxb7+ Bc7 34. Qxc7+ Kf6 35. Ng4+ Kg5 36. Ne3 h6 37. Qxa7",
        "27... Rxf8": "The position is completely won for white. I played on, but no further comment is needed. According to Gameknot neither side made any more mistakes.",
        "28. Rxc7 Bxc7 29. Bd5 Bd6 30. Bxc6 bxc6 31. Nxe5 Bxe5 32. Qxe5+ Kg8 33. Qe6+ Rf7 34. Qxc6 Kg7 35. f3 Re7 36. Kf2 Kg8 37. f4 Kg7 38. g4 Rf7 39. Kf3 Kg8 40. Qe8+ Rf8 41. Qe6+ Rf7 42. Ke4 Kg7 43. f5 gxf5+ 44. gxf5 Rf6 45. Qe7+ Rf7 46. Qg5+ Kf8 47. Qd8+ Kg7 48. Ke5 Rb7 49. f6+ Kh6 50. Qd2+ Kh5 51. Qe2+ Kh4 52. Qe4+": "With my rook on b7 falling, it is time to give up.\nMany thanks for reading. Please rate this annotation on the star system and leave a comment or two to let me know how I am doing. Until next time dear reader!"
    },
    "url": "https://gameknot.com/annotation.pl/charleshiggies-christmas-new-year-tournament-2016?gm=62404",
    "gameName": "charleshiggie's Christmas/New Year Tournament 2016",
    "players": "archduke_piccolo (2103) vs. charleshiggie (2049)",
    "opening": "Gruenfeld (D85), modern exchange variation"
}