{
    "moves": {
        "1. e4": "In this game I played the Marshall Gambit line of the Ruy Lopez. This has been analyzed all over the place. But I like this line and don't get to play it often so I thought I'd write up my thoughts on it as well. I also play what I think is not the currently \"in style\" line so you can catch people unaware (though not my opponent this game, who played quite well except for one little mistake) I hope you enjoy. ",
        "1... e5 2. Nf3 Nc6 3. Bb5": "Going into the Spanish. Black can go into mainline Spanish with a6 or to the Berlin with Nf6.",
        "3... a6": "And as I don't want to play \"boring\" Berlin games I don't play the Berlin. The line is very popular a high levels but leads to a lot of draws and it isn't that fun to play. I'm also not great at endings...so I try to avoid them. ",
        "4. Ba4": "White can take if they like and go into exchange versions or play this. ",
        "4... Nf6": "d6, Nge7 are possible. There are a few other possiblities as well that are not played at the highest level but can work for fun, like f5. ",
        "5. O-O Be7": "An interesting line is 5..Nxe4 6. d4 b5 7. Bb3 d5 8. dxe5. I don't like it as black because the pawn on e5 really cramps blacks position but it is more open and interesting to try if you're interested in that type of position. ",
        "6. Re1": "Once we reach this position I aim for d5 and playing the Marshall. ",
        "6... b5 7. Bb3 O-O 8. c3": "This move is white's last move to avoid the Marshall by playing 8. h3. h3 seems like it wastes a tempo and provides a target for black to aim at but it also prevents black's knight from coming into g4, which i one of black's ideas after playing d5. h3 then is quite double edged. another possible move that has been tried recently is a4. I have little experience with these types of lines but it also gives both sides chances and high level players often try it. c3 though is the most common move with the obvious idea of playing d4 at the right moment and the less obvious idea of giving the bishop the c2 square should black play Na5 trying to trade for the knight. Mostly commonly black will respond with d6 and there will be a long closed game with both sides having trumps and ideas but needing to be very careful with the other sides pieces. There is a lot of theory in this position if you are interested. ",
        "8... d5": "And the move signifying the Marshall counter-attack. The idea is to give up a pawn for a strong attack on the kingside. White can accept the pawn and try to hold on or play d4 and watch the center dissolve toward an evenish endgame. ",
        "9. exd5": "Accepting the gambit.",
        "9... Nxd5 10. Nxe5 Nxe5 11. Rxe5": "And white is a pawn up. ",
        "11... Nf6": "The knight is attacked twice and defended once. c6 is actually a more common move and gives black a slight advantage with compensation for the pawn, but less of an attack. This move seems to be a quiet retreating move but actually have quite a bite to it with the pressure that is about to exist against h2. ",
        "12. d4": "Black is guaranteed to have compensation for the pawn. Maybe more. ",
        "12... Bd6 13. Re1 Ng4": "And pressure seemingly from nowhere. White needs to be very careful not to get mated. I'd like to try Bxh2 at some point as well with this as the follow up, as that also seems dangerous. ",
        "14. h3": "This is the most trying move, suggesting black move back and play a pawn down position. g3 seems too weakening and Qf3 gives the pawn back and a slightly worse position. ",
        "14... Nxf2": "! Sacrificing the knight (kind of).  The other possible move is Qh4, with pressure along the file. If white takes then black will flush the king out and kill them in the open board with good technique. ",
        "15. Qf3": "Kxf2 is met by Qh4+ and black is basically winning. The king is undefended and black's bishops look great. ",
        "15... Qh4": "This move defends the knight. It seems like black should lose the knight but actually if white takes it they are losing. ",
        "16. Re2": "The best move in this position. Black is better or winning after basically everything else. Black will give up the knight now for both pawns and play for a long term compensation given by 3 connected past pawns and an endgame. Well found by my opponent. ",
        "16... Nxh3+ 17. gxh3 Bxh3 18. Re4": "This move forces the endgame black is aiming for, but if they don't play it then black keeps queens on with a very exposed white king, which is dangerous. Black is looking for Re8 and getting all the pieces in. Note white's queenside. Totally undeveloped. And not really going anywhere that soon. It's tied up and they need to defend the passed pawns. ",
        "18... Qg3+": "Forcing the queen trade. ",
        "19. Qxg3 Bxg3 20. Re3": "Wait...doesn't black win a bishop? ",
        "20... Bf4": "Nope. this move is a saving resource and is what black has been aiming for since move 16 now. Black is trading pieces and going to start the pawns moving toward victory. ",
        "21. Rxh3 Bxc1 22. Rh2": "Forced or black is winning a bunch of queenside pawns also and will be winning. ",
        "22... Rae8": "with the not so subtle threat of Re1+ winning...well basically everything. check that variation out if you like. a4 Re1+ kf2 Rfe8 with threats against everything. ",
        "23. Kf1": "Stopping that threat. But white is still not developed.",
        "23... g5": "Getting those pawns rolling. White isn't lost but they are in trouble. They need to unwind somehow. ",
        "24. a4 Kg7": "Preparing f5 and h6. ",
        "25. Nd2": "This gives up some pawns for development. This is a mistake (Komodo thinks white on move 24 has a tiny advantage with black having compensation for the piece and now Komodo thinks black is much better - about +2)",
        "25... Bxb2 26. Re1 Rxe1+ 27. Kxe1 Bxc3": "Pinning the knight, threatening the d4 pawn, and it looks like an endgame where black has 3 or 4 pawns and a rook against a rook and bishop. This would be winning with good technique. ",
        "28. Bc2": "With a threat against h7.",
        "28... h6 29. axb5 axb5 30. Bb3": "And white resigns. Seems a little premature but black is going to take on d4 and have 5 pawns for the piece. 3 connected kingside and 2 queenside. Defending here seems hard to impossible. Black is the only one who can win this and the computer confirms they are winning. After taking on d4 they can go f5 Kf6 or push c5 c4 or both. White just has to try to complicate this. I find the marshall to be fun to play and think you should give it a go. Give up a pawn in the center for great attacking chances. But if white defends well early you can still give up a piece for a chain of pawns. A little technique and those pawns become queens. 5 pawns is still a ton of pawns with diminished materiel. "
    },
    "url": "https://gameknot.com/annotation.pl/charleshiggies-christmas-new-year-tournament-2016?gm=62422",
    "gameName": "charleshiggie's Christmas/New Year Tournament 2016",
    "players": "deaderfish (1577) vs. tombulous (1850)",
    "opening": "Ruy Lopez (C89), Marshall counter-attack, 11...c6"
}