{
    "moves": {
        "1. e4": "He starts with the usual.",
        "1... c5": "and I do my usual defence",
        "2. e5": "This is rather unusual. Better to get more pieces out rather than move peice again.",
        "2... Nc6": "I develop and attack the pawn.",
        "3. f4": "He defends, but again another pawn move rather than get his pieces out.",
        "3... d6": "I undermine his pawns and prepare to develop my bishop",
        "4. Nf3": "He protects e5 again.",
        "4... Bg4": "by pinning his knight, I increase the pressure on e5 and I develop a piece.",
        "5. exd6": "The pressure becomes too much for him. He takes.\r\n",
        "5... Qxd6": "I take with the queen, as in catalinmf (1587) vs. wotan_spears (1759) (black won in 47)",
        "6. d3": "He protects the pawn on f4 which was attacked by my queen.",
        "6... e5": "I open up the centre, as I am ahead in development. I am also following catalinmf (1587) vs. wotan_spears (1759) ",
        "7. Qd2": "He would be better off following catalinmf (1587) vs. wotan_spears (1759) with 7. fxe5 Nxe5 ",
        "7... Bxf3": "I take",
        "8. gxf3": "He takes back",
        "8... Nd4": "This is hard to meet. I am threatening the pawn on f3, but also to take on f4 and he can't take back as I play Nxc2. I think this wins a pawn.",
        "9. Bg2": "So he protects f3",
        "9... exf4": "and I take",
        "10. Qxf4": "and he takes back. Now the question is, should I exchange queens or take on c2 first? I decided it would be best to take on c2 first, as if I exchange queen first, his king can come to d2, and after I take his rook, he moves his knight and he is threatening to take my knight on a1 already. If I take on c2 first I prevent that.",
        "10... Nxc2+": "So I take the pawn.",
        "11. Kd2": "A dreadful blunder because...",
        "11... Qxf4+": "Oops!",
        "12. Kxc2": "At least he gets a knight in return for the queen, and my queen is now attacked.",
        "12... Qe5": "So I retreated.",
        "13. Bd2": "He threatens my queen with Re1, pinning my queen against my king",
        "13... O-O-O": "So I castle",
        "14. Re1": "He hits the queen",
        "14... Qd4": "I take up a nice, centralised post threatening d3",
        "15. Re4": "He hits the queen",
        "15... Qxd3+": "So I take the pawn",
        "16. Kd1": "King walks into a self-pin. Kc1 may have been better.",
        "16... Bd6": "I develop, hitting h2",
        "17. f4": "He blocks the attack and opens a diagonal for his bishop",
        "17... Nf6": "I hit his rook",
        "18. Re3": "He retreats",
        "18... Qd4": "Queen takes up another nice central role. Qxb2, Bxf4 and Qxf4 are all threatened",
        "19. Nc3": "This meets one threat, but removes a defender of d2",
        "19... Bxf4": "I take here. He resigns, it is hopeless. If he moves his Re3 his Bd2 is lost. Many thanks for reading this, please rate the annotation and leave a comment or two! Thanks!"
    },
    "url": "https://gameknot.com/annotation.pl/charleshiggies-easter-training-tournament?gm=49464",
    "gameName": "charleshiggie's Easter Training Tournament",
    "players": "chrisforbes21 (1202) vs. charleshiggie (2079)",
    "opening": "Sicilian defence (B20)"
}