{
    "moves": {
        "1. d4 e6 2. Bf4 b6 3. Nd2 Bb7": "...alowing e4 at once. I could have played it. ",
        "4. Ngf3": "? [edit] Now, IF ...Nf6, e4 is not possible anymore. ",
        "4... d6": "This remembers me a lot a previous game. I was taught: \"it's dangerous to play b6 with d6 because of the weakened white squares. ",
        "5. e4": "I better play d4 now, while I still can. ",
        "5... Nd7 6. Bb5": "? Too impulsive. Black can easily play c6 and kick it. ",
        "6... a6": "...this way his lsb is not blinded. ",
        "7. Ba4 b5 8. Bb3": "I developed a piece, but black won a lot of space on the Qside. I have c4 in mind. ",
        "8... Qf6": "!?? This just looks bad because f6 is a good square for the N. So the Q's hunt starts. ",
        "9. Bg5 Qg6": "Threatening e4, but it doesn't mind. ",
        "10. Qe2 h6": "I know. But after the B retires, g2 is poisoned... or isn't it?",
        "11. Bh4": "If Qxg2, o-o and black will have a hard time taking care of his Q. ",
        "11... Be7": "Sensible. I sure can play Bg3, but it was just very passive. ",
        "12. O-O-O": "Now for sure black wouldn't dare to take on g2. And...",
        "12... Bxh4 13. Nxh4": "...is not a problem. Note that I tried to find a plan to trap the BQ, but without the lsb it was hard to achieve. ",
        "13... Qg5": "Pinning Nd2, but...",
        "14. Nhf3": "Againg forcing a Qmove, and temping for Qxg2?",
        "14... Qf4": "Still trying to \"defend\" the early Q's outcome, black just gives me a lot of developing tempoes. ",
        "15. g3 Qg4 16. h3 Qg6": "f4 was my original plan, but now it doesn't look very good. My white diagonals can become weak. ",
        "17. d5": "!? Not sure. The idea is to get squares for my lsb or exchange it for his. ",
        "17... e5": "I can still play c4, but again, it was very hard to say if it was safe or not.",
        "18. Nh4": "So the Q chase starts again, planning Nd4 in order to take advantage from the aligned Q and K...",
        "18... Qg5 19. Nf5 Ne7": "Developing his last minor piece and preparing to castle. ",
        "20. h4": "Chasing the BQ again. I want it out from the back diag in order to use Nd2. ",
        "20... Qg6 21. Nf3": "? Just drops a pawn! NxN, KxN would have connected his Rs and the K was relatively safe behind the pawn's shield. ",
        "21... Nxf5 22. exf5 Qxf5": "Of course. But now e5 is pinned...",
        "23. Nd4 Qf6 24. Nc6": "Black's lsb is not a problem anymore. ",
        "24... Bxc6 25. dxc6 Nc5": "Would you try to save the lsb from the exchange? Is there anything better to do?",
        "26. Bd5": "Let's keep the B and let's protect against a possible e4. ",
        "26... O-O": "Castling into the attack. Good boy... :-)",
        "27. g4": "Thematic infantry attack. It reminds me of a recent game (much nicer)...",
        "27... Qf4+": "Finally, back could \"do someting\" with his Q. As you can see, black has attack on my Kside, but mine is quicker. ",
        "28. Kb1 Na4": "The N is safe here (b3??, Nc3+), and b2 would be attacked soon. ",
        "29. g5": "Never mind. ",
        "29... Qb4 30. Bb3": "Played instantly. Black needs a pawn, not a N on a4 to bother me. ",
        "30... Nc5": "Preparing it. ",
        "31. gxh6": "Deadly. ",
        "31... g6": "Black's \"secret weapon\" is not enough. ",
        "32. Rdg1": "The trheat is Qh5. ",
        "32... Kh7": "Prevents it. ",
        "33. h5": "I can't count on my lsb, virtually unexistant after NxB. I also set Rg4, chasing the Q again, and allowing R to double on g. ",
        "33... Nxb3": "If Qd3, e4!, so I have to be careful or my attack will vanish into exchanges. ",
        "34. hxg6+ fxg6": "Qg4 looks very nice, but QxQ...",
        "35. axb3": "Something better?",
        "35... Qc5": "Hitting f2. Does it matter?",
        "36. Qe4": "?? Qg4 was the killah here.",
        "36... Rfg8 37. f4": "I have other soldiers... can black survive this, in you opinion?",
        "37... Rae8": "?? Ra-f8 puts much more resistance. A pitiful blunder. ",
        "38. f5 Qf2 39. fxg6+": "If Kh8, g7+ was enough. ",
        "39... Rxg6 40. Qxg6+ Kh8 41. Qg7#": ""
    },
    "url": "https://gameknot.com/annotation.pl/chasing-a-q?gm=60827",
    "gameName": "Chasing a Q",
    "players": "damafi (1376) vs. sippycupthug (1342)",
    "opening": "Queen's pawn (A40)"
}