{
    "moves": {
        "1. d4": "That's a standard opening move, so it's good. You want to control the centre of the board and this also allows your black bishop to move out. ",
        "1... d5": "That's the standard response. ",
        "2. c4": "That's a little unusual. Most people would move the king's pawn out or perhaps a knight. ",
        "2... dxc4": "I thought I might as well take it. ",
        "3. Nf3": "That's a good move. You want to get your knights and bishops out at this stage. ",
        "3... Nf6": "So I'm doing the same. ",
        "4. Ne5": "One rule of thumb at this stage is not to move a piece more than once. You're trying to get all your pieces out into the middle. You would be better off moving out the other knight or a bishop. ",
        "4... e6": "This will allow my bishop to come out. ",
        "5. Nxc4": "Ok, fair enough. You've moved that knight three times now, so you're behind on 'development'. ",
        "5... Be7": "Out comes my bishop. I can castle now. ",
        "6. e3": "Not bad, your white bishop can come out now. ",
        "6... Nc6": "I'm getting my other knight out, which is what you should be doing at this stage. ",
        "7. h3": "That's a good defensive move. It stops my knight going to g4. ",
        "7... O-O": "I have castled. In most games you will want to do this to protect your king. ",
        "8. Nba3": "Ok good, your other knight is out. ",
        "8... b6": "My idea is to put the bishop on b7 next. ",
        "9. Nxb6": "Oops, a mistake. You've gained a pawn, but now I can take your knight, which is much more valuable than the pawn. ",
        "9... cxb6": "Got your knight. ",
        "10. Nb5": "I guess that's ok, but you should focus on getting your other pieces out. ",
        "10... a6": "Threatening the knight. I want it to back off. Knights make me nervous when they're too close!",
        "11. Na3": "It's back where it was, so you've wasted time. ",
        "11... Bb7": "Bringing my bishop into play. ",
        "12. Nc2": "More time wasting. ",
        "12... Qd5": "Bringing my queen out into the centre. Quite a bold move because it's vulnerable there, but I felt like it was time to attack. ",
        "13. Qd3": "Fair enough, but your bishops still haven't joined the party. ",
        "13... Rfd8": "The rook is now supporting the queen on the d file. ",
        "14. Nb4": "Your first big mistake. Before you move a piece check that it's going to be safe on that square. ",
        "14... Nxb4": "Got your other knight and threatening your queen. ",
        "15. Qc3": "Your queen is still quite vulnerable there. ",
        "15... Ne4": "Threatening your queen again. ",
        "16. Qxb4": "A massive error. The knight was protected by my bishop. ",
        "16... Bxb4+": "It's pretty much all over for you now. ",
        "17. Ke2": "Ok",
        "17... e5": "I'm hoping you'll take that pawn because I could win the game next move by going to d1. ",
        "18. b3": "Not sure why you did that. I guess you could finally move the bishop to b2 next move. ",
        "18... exd4": "I want to come down the middle with my queen.",
        "19. exd4": "I guess you don't have many options there. ",
        "19... Qxd4": "I should be able to end the game pretty quickly from here. Note that I'm also threatening your rook on a1. ",
        "20. Kf3": "That was your only choice I think. ",
        "20... Nxf2+": "I'm attacking the other rook on h1. ",
        "21. Kg3": "Not much choice again. ",
        "21... Nxh1+": "Got your rook. ",
        "22. Kh2": "I decide to let you have the knight and... ",
        "22... Qxa1": "take the other rook. ",
        "23. Kxh1": "I'm not that bothered because now I've got your bishop. ",
        "23... Qxc1": "Your other bishop is trapped now. You can't move it out of the way because you will expose the king to check. ",
        "24. Kh2": "You could have moved your king to g1 to protect the bishop. ",
        "24... Qxf1": "Now it's dead and you're helpless. ",
        "25. h4": "It's all over now I'm afraid ):",
        "25... Qxg2#": ""
    },
    "url": "https://gameknot.com/annotation.pl/chat-with-the-chess-noob-that-is-don-jorginho?gm=67434",
    "gameName": "Chat with the Chess Noob that is Don Jorginho",
    "players": "donjorginho (1200) vs. wil2711 (1572)",
    "opening": "Queen's gambit accepted (D23)"
}