{
    "moves": {
        "1. e4": "Another game from the Chelyabinsk tournament. Black had difficulties from quite early on as we will see.",
        "1... c5 2. Nf3 Nc6 3. d4 cxd4 4. Nxd4 Nf6 5. Nc3 e5": "Tournament starting position",
        "6. Ndb5": "I have played this now a few times in this tournament and it has served me well",
        "6... d6": "Probably the best response. It tries to prevent the b5 knight causing problems",
        "7. Nd5": "Again my standard move in this tournament, threatens N c7 which means the black king will lose the right to castle as well as losing his rook",
        "7... Nxd5 8. exd5": "pressures the c6 knight",
        "8... Ne7": "I'm still not sure what the best move is here, probably Nb8. It seems to me that the move here crowds the king",
        "9. c3": "Opens a line for the queen d1-a4. I prefer this to c4 as here I still have f1-a6 for my lsb",
        "9... a6": "Black has to be very careful now, this move could lose the rook (or the game) as we will see",
        "10. Qa4": "Note here that if white takes the knight he loses his rook. More dangerously I am looking at Nc7#",
        "10... Nxd5": "This is where we left the Gameknot database. The move is almost forced due to my mate threat. Black will still lose material",
        "11. Nc7+ Ke7": "Forced",
        "12. Nxd5+": "I didn't take the rook as it isn't doing much and my knight is a lot more useful out in the open as it is here",
        "12... Ke6": "forced",
        "13. Qg4+": "Black can't take the knight due to 13 ... KxN 14 Qc4 . At this point I knew black was in big trouble but wasn't sure how to finish him off. ",
        "13... f5 14. Qc4": "Blacks pieces have limited mobility now, both bishops and both rooks are pretty well confined, If I can maintain momentum things look promising. Both my bishops can easily get into provide reinforcement, and after letting my dsb out I can get my a rook onto the half open d file which could be very useful",
        "14... Kd7": "prevents the discovered check",
        "15. Qa4+": "I decided to force him back and bring my lsb into play",
        "15... Ke6 16. Bc4 b5": "I'm not sure this helps black at all",
        "17. Bxb5": "Clearly if he takes the bishop he loses a rook",
        "17... Bb7": "I looked at Bd7 which would gain me a rook for a knight with  18 Bd7 , Qxd7 19 Qxd7 , Kxd7, 20 Nb6  forking the rook.\n\nI also looked at Be8 but couldn't see how to turn that into a big advantage.\n\nIf I could get his king onto a black square I had a threat of Bg5  gaining the queen",
        "18. Bc6": "In the end I went for what is probably the simplest option",
        "18... Bxc6 19. Qxc6 h6": "Prevents Bg5",
        "20. Nc7+": "At this point black resigned.\n\nThanks for reading"
    },
    "url": "https://gameknot.com/annotation.pl/chelyabinsk-variation?gm=20153",
    "gameName": "Chelyabinsk Variation'",
    "players": "elwoos (1555) vs. pioko5 (1573)",
    "opening": "Sicilian (B33), Pelikan, Bird variation"
}