{
    "moves": {
        "1. e4": "Another taken from the Chelyabinsk Variation tournament",
        "1... c5 2. Nf3 Nc6 3. d4 cxd4 4. Nxd4 Nf6 5. Nc3 e5": "Starting position",
        "6. Ndb5": "This opens up some interesting possibilities, the b knight has an eye on d6 and c7 the c knight is looking at d5, note also the white queen has a half open file.",
        "6... d6": "Almost forced, black now has the d6 square defended by his queen and his dsb",
        "7. Nd5": "Applies some considerable pressure to c7",
        "7... Nxd5 8. exd5": "The knight choices are limited now, if he moves to b4 for example I can chase it around a little while developing some of my pieces, so gaining some tempo",
        "8... Ne7": "Probably the best option however blacks dsb now cannot develop without moving another piece first",
        "9. c3": "Opens the line to a4 for my queen, note that there is a nice line to the king - a4-e8, I did consider c4 but felt that restricted my lsb too much",
        "9... a6 10. Qa4": "threatens mate with Nxd6. Black is under some severe pressure now and will surely have to lose material to save the game",
        "10... axb5": "Possibly the only option that allows black to survive",
        "11. Bxb5+ Bd7 12. Bxd7+ Qxd7": "forced, I can now gain the rook",
        "13. Qxa8+": "Up to this point we were still in the Gameknot database!",
        "13... Nc8": "Unsurprisingly black declines to exchange queens",
        "14. O-O Be7 15. Qa5 b6": "Trying to pressure my queen but I think this is a mistake as it allows my queen to get into a slightly better position. Should black have castled instead?",
        "16. Qa6 O-O 17. Be3 Bd8": "My development is finally complete and I am ready to throw my pawns forward on the queens side",
        "18. b4 Qf5": "This move is a bit of a mystery to me ...",
        "19. a4": "So I continue with my plan ...",
        "19... e4": "However the purpose of it now becomes clearer.\n\nI think this is a mistake as he now has 3 weak pawns and I can easily cover mine",
        "20. Qc4 Ne7": "Still going for my d pawn",
        "21. Rfd1": "I used this rook as the other was supporting the pawn push and my f pawn is protected by my dsb",
        "21... h5": "Trying to counter",
        "22. a5 bxa5 23. bxa5": "I decided to take with my pawn as a8 is white and black has no lsb, it is also more tricky to get his knight into a useful position on that side, which meant that I thought this pawn had some good chances to cause problems",
        "23... Ng6": "Continuing the counter effort",
        "24. a6": "For now I ignore it",
        "24... Ne5": "I wasn't sure what the big benefit of this move was at the time, though we will see later",
        "25. Qb5 Bc7": "Allows his rook to protect the a8 square",
        "26. a7": "Continuing the push. The pawn here is well defended",
        "26... Nf3+": "This move scared me, if I take with the pawn I am in big trouble, 27 gxf3, exf3 means that my king is potentially trapped on the back row by his pawn.",
        "27. Kh1": "f1 would have lost my h pawn, there is little he can do now though to threaten my king even though it is cornered",
        "27... Qe5": "Threatening mate with Qxh2",
        "28. gxf3": "Black threw in the towel.\n\nThanks for reading"
    },
    "url": "https://gameknot.com/annotation.pl/chelyabinsk-variation?gm=19807",
    "gameName": "Chelyabinsk Variation'",
    "players": "elwoos (1561) vs. aramis (1584)",
    "opening": "Sicilian (B33), Pelikan, Bird variation"
}