{
    "moves": {
        "1. e4": "Another game from the Chelyabinsk Variation mini tournament. This is quite a long game and I made a number of mistakes.\n\nI would appreciate any comments about the end game, in particular anything I could perhaps have done better",
        "1... c5 2. Nf3 Nc6 3. d4 cxd4 4. Nxd4 Nf6 5. Nc3 e5": "Tournament starting position",
        "6. Nf3 Bb4": "Possibly a little too aggressive, though I am now ready to castle",
        "7. Bd3": "protects the e4 pawn as the knight is now pinned",
        "7... d5": "More pressure on the centre and the e pawn, the d pawn also has one eye on d4 which will cramp whites position a little",
        "8. exd5 Nxd5": "Applies extra pressure to the knight and extra support for my dsb",
        "9. Bd2 Nxc3": "Trying to double whites pawns on c which will restrict his queens options ",
        "10. bxc3 Bc5": "This move takes us out of the gameknot database.\n\nMy idea here was that this looked like a good place for my bishop as when he castles his f pawn will be pinned",
        "11. O-O Ne7": "My first big mistake. ",
        "12. Nxe5 O-O 13. Qf3": "All of a sudden he has some pressure on my f pawn but with his queen there I also cannot move my lsb without losing another pawn",
        "13... Qc7": "Guards my dsb and allows me to move my lsb, completing development and linking my rooks",
        "14. Bf4": "Presumably this is to try to make me move my queen again which means I lose tempo",
        "14... Bd6": "trying to turn the tables",
        "15. Rae1": "Did he move the right rook here? I think I would have been tempted to put my f rook there and then allow the other rook onto b or d",
        "15... f6": "Pressuring the knight further. however this was perhaps unwise as it opens up a nice diagonal to my king for his lsb and his queen that is currently on a light square.",
        "16. Qh5": "Further protecting the knight but also threatening mate with Qxh7",
        "16... Bf5": "Loses material but seemed preferable to Ng6 or g6",
        "17. Bxf5 Nxf5 18. Qxf5 fxe5": "Trying to nick his dsb",
        "19. Qe6+": "I completely overlooked this move which of course allows his dsb to escape",
        "19... Kh8 20. Bxe5": "and in fact gain a pawn",
        "20... Rfe8": "Still trying to pressure the dsb (and failing as we will see)",
        "21. Bxd6": "However I again missed this move, things are looking bad now",
        "21... Qc6 22. Be7 Qxc3": "At this point I decided to try to grab as many pawns as I could",
        "23. Bb4 Rxe6": "Forced",
        "24. Bxc3 Rc6": "Still trying to gain a pawn",
        "25. Re3 Rac8 26. Ba1 Rc6xc2": "His bishop is pinning my g pawn which could prove nasty",
        "27. Re7 Rc2c7 28. Rxc7 Rxc7 29. Bd4 a6 30. f4 b5 31. Be5 Rc2 32. Rd1": "threatening mate with Rd8",
        "32... Kg8 33. Rd7 g6": "Trying to save my pawns...",
        "34. Rg7+ Kf8 35. Rxh7": "... and failing",
        "35... Rxa2": "Though this seems reasonable compensation as I now have 2 passed linked pawns",
        "36. Rg7 b4 37. Rxg6 b3 38. h4": "And he has three!",
        "38... a5 39. h5 b2 40. Bxb2": "Clearly game over by this point. I only carried on so that I could look at the game later to see if at this point I could have done any better. Any comments would be appreciated",
        "40... Rxb2 41. h6 Kf7": "Would a4 have been better?",
        "42. Rg7+ Kf6 43. Kh2 a4 44. Ra7 Kg6": "The idea here was that if he took my pawn I could at least get his h pawn and possibly his f one too",
        "45. h7 Rb8 46. Kg3 a3 47. Kg4 a2 48. f5+ Kf6 49. g3 Rh8 50. Rxa2 Rxh7": "I'm trying to limit his kings movement a little which I hoped may give me a chance for a draw",
        "51. Kf4 Rh5 52. Ra6+ Kg7 53. g4 Rh4 54. Kg5 Rh1": "giving me more options for my rook",
        "55. Ra7+": "forcing me back again",
        "55... Kf8 56. Kg6 Rh4": "This is an attempt to distract my opponent, in the hope that he will push his f pawn forward and trap my king ",
        "57. g5 Rc4": "Looking to push his king away with c6 possibly gaining another pawn",
        "58. f6": "he is now threatening mate with Rh8 ...",
        "58... Ke8 59. Kg7 Rc5 60. g6 Rc6 61. f7+": "Thanks for reading"
    },
    "url": "https://gameknot.com/annotation.pl/chelyabinsk-variation?gm=19631",
    "gameName": "Chelyabinsk Variation'",
    "players": "rinaldi (1607) vs. elwoos (1557)",
    "opening": "Sicilian (B33), Pelikan (Lasker/Sveshnikov) variation"
}