{
    "moves": {
        "1. f4": "I was black playing this game in the North Essex league club KO competition.\r\nOh! What's this? When did I last see Bird's openning in a match?",
        "1... e6": "Without the benefit of Gameknot's openning data base I choose one of black's poorer alternatives....",
        "2. Nf3 Nf6 3. e3 b6 4. Be2 Bb7": "So whaite has control of e5, but I have e4 as compensation.",
        "5. O-O d5 6. b3 Bd6": "Starting to contest e5 and discouraging f5 from white.",
        "7. Bb2 Nbd7 8. Ne5 c6 9. Qe1 Qc7": "Now I can capture on e5",
        "10. d4": "White builds the strong e5 so I can't take, but blocks the action of his bishop on b2.",
        "10... Ne4 11. Nd2 Ndf6": "Consolidating e4. ",
        "12. Rc1 Qe7": "I really don't like the idea of castling on either side now.",
        "13. a4": "Not sure what white's thinking was behind this move. At least my not castling is preventing his whole-hearted K-side attack.",
        "13... Rc8 14. Ndf3 h6": "Preventing Ng5.",
        "15. Qh4 Qf8": "A tough decision after thinking for too long and now I'm getting into time trouble.",
        "16. Qh3": "Perhaps not the strongest for white, but I beed to be careful of the attack on c8.",
        "16... Rc7": "Defending f7 and removing the R from potential attack by white's queen.",
        "17. c4 c5": "c4 was a long time coming and I need to respond in kind otherwise my position is lost.",
        "18. cxd5 Bxd5 19. Bb5+ Kd8 20. Nc4 g5": "Now that my bishops are finally active I can counterattack on the King's side.",
        "21. Nfe5 gxf4 22. Rxf4": "Taking with the pawn would be better for White, with the aim of openning the central files for attack on my king.",
        "22... cxd4": "Surely a mistake by black? but only 5 minutes left to the time control. Also white's rook on c1 is not defended so the c4 knight is pinned.",
        "23. Bxd4 Rg8 24. Rc2 Ng5 25. Qh4 Nfe4 26. Ra2": "Unpinning the knight?",
        "26... f6": "Now my knight is also unpinned and the 7th rank is available.",
        "27. a5 Bc5 28. axb6 Bxb6 29. Bxb6 axb6 30. Nd3 Qg7": "Playing on instinct, black easily makes the time control with nearly 60 secs to spare.",
        "31. Nxb6": "White wins a pawn, and can remove the strong bishop on d5 next move...but a what cost?",
        "31... Ra7": "Does white have an answer to this move? I haven't found one.",
        "32. Ra4": "This was certainly not it! He needed to maintain the defence on g2, but if 32.Rc2 then black plays Ra1+ followed by 33....Rx+ on c1 if white interposes either the N or R. Or if white plays 33.Rf1 then Nf3+ wins the queen. 32.Rf2 is no better.",
        "32... Nf3+": "and white resigns being mated next move."
    },
    "url": "https://gameknot.com/annotation.pl/chess-game?gm=36506",
    "gameName": "Chess game",
    "players": "Keith (141) vs. eddeebee (147)",
    "opening": "Bird's opening (A02)"
}