{
    "moves": {
        "1. e4": "I did my normal opening.",
        "1... d5": "He attacked my pawn with his queen's pawn.",
        "2. exd5": "I decided to take the pawn.",
        "2... Qxd5": "He obviously took my pawn.",
        "3. Nc3": "I attempted to make him retreat his queen by getting my knight out.",
        "3... Qe5+": "He checked me with his queen.",
        "4. Be2": "I blocked the check with my bishop.",
        "4... Bf5": "He got his bishop out. At this point, it looked like he had the control of the centre of the board.",
        "5. d4": "I decided to attack his queen with my pawn so that I could move my bishop from the line of check.",
        "5... Qe6": "I couldn't as he only moved his queen one square back.",
        "6. Nf3": "That is when I began to get my pieces out a bit more.",
        "6... Be4": "He attacked my knight so if he took it, I would have to take the bishop with my pawn rather than my bishop because my bishop is pinned.",
        "7. O-O": "To stop my bishop being pinned, I castled.",
        "7... Bxf3": "He swaped of his bishop for my knight.",
        "8. Bxf3": "I took his bishop. At the same time I was threatening to take his rook.",
        "8... c6": "To stop that he moved his pawn to c6.",
        "9. d5": "I moved my pawn one forward so that I was attacking his queen and pawn at the same time.",
        "9... Qg6": "He moved his queen away so it could not be taken.",
        "10. dxc6": "I took his pawn.",
        "10... bxc6": "He took my pawn back.",
        "11. Ne4": "I now began to put my knight in more action.",
        "11... e6": "He moved his pawn one forward so he could bring his bishop out.",
        "12. Nd6+": "I checked him with my knight.",
        "12... Bxd6": "He took my knight with his bishop.",
        "13. Qxd6": "I then took his bishop with my queen, leaving my pawn unguarded.",
        "13... Qxc2": "As I guessed, he took my pawn.",
        "14. Rd1": "I moved my rook to d1 to threaten checkmate.",
        "14... Na6": "He moved his knight out to stop my checkmate.",
        "15. Bxc6+": "This is when my opponent resigned because the only move he could do was to take my bishop with his queen which would result me being up by several points. ",
        "15... Qxc6": "This is what he would have had to do.",
        "16. Qxc6+": "I then took his queen.",
        "16... Ke7": "To stop a checkmate happening earlier, he moved his king forward one.",
        "17. Bg5+": "I have got a forced mate from this posistion.",
        "17... Nf6": "To delay it he blocks with his knight.",
        "18. Rd7+": "I check him with my rook.",
        "18... Ke8": "He moves his king one back.",
        "19. Rxa7+": "I move my rook out of the way to check him and threaten his rook.",
        "19... Nd7": "He blocks with his knight.",
        "20. Qxd7+": "I take it with my queen.",
        "20... Kf8": "He moves his king to the only place he can. ",
        "21. Qxf7#": "This is my checkmate. The inevitable."
    },
    "url": "https://gameknot.com/annotation.pl/chess-game?gm=38474",
    "gameName": "Chess game",
    "players": "lastav (1-0) vs. playaholic ",
    "opening": "Scandinavian defence, Lasker variation (B01)"
}