{
    "moves": {
        "1. e4 c5": "Sicilian Defense. I usually play this against 1. e4.",
        "2. Nf3 Nc6": "Old Sicilian Variation. I played this line expecting 3. d4. But..\n",
        "3. Bc4": "...he played 3. Bc4. I immediately assumed that he would play 4. Ng5 followed by 5. Bxf7, so I played ",
        "3... e6": "to stop it.",
        "4. c3": "I believed here he was trying to play d2-d4, and probably wanted to keep a pawn on the d-file.",
        "4... d5": "The reason behind 3. e6 instead of 3. g6. ",
        "5. exd5 exd5 6. Bb5": "I would have played 6. Be2 myself, as Black is stronger on the kingside and will most likely castle there. Also, there is no used for the bishop on b5, other than pinning the knight.",
        "6... Bd7": "Breaking the pin.",
        "7. Bxc6 Bxc6 8. O-O": "Black swaps the light-squared bishop for the knight and castles kingside. It seems natural, as black has zero pieces on the kingside developed, but will start developing them around now.",
        "8... Nf6 9. d4 Qc7": "Opening up long castling, and puts some pressure on h2.",
        "10. Bg5": "As I was planning not to castle kingside, I would not have minded the doubled pawns after 11. Bxf6. But I played 10...Be7 anyway",
        "10... Be7 11. b4": "I was expecting him to swap, but instead he played this. I assumed he tried to strenghen the c5 square, a decent square for the knight.",
        "11... cxd4 12. cxd4": "Creating the isolated pawn on d4, and a free pawn on b4.",
        "12... Bxb4 13. Bxf6 gxf6": "As I said before, I did not mind the doubled pawns.",
        "14. a3": "Kicking away the bishop.",
        "14... Be7": "I should have played Bd6, but figured that I should support the h4 square, where the pawn shall go eventually.",
        "15. Nc3 O-O-O": "Even with an open c-file, I castle long anyway.",
        "16. Qd3": "!? I see no purpose...",
        "16... h5": "There it is. The pawn will now try to rip open the kingside.",
        "17. a4 h4 18. Nb5": "I guess this was the reason behind 17. a4, but I didn't see any problems. As my king has access to d7, I didn't care about opening up the a-file.",
        "18... Bxb5 19. axb5": "Here I blundered, opening up the c-file to pin the queen, but miraculously escaped.",
        "19... h3 20. g3": "Trying to keep the kingside closed. (He missed Rc1 again!)",
        "20... Rdg8": "Putting pressure on g3, where I will sack a bunch of pieces to rip open the kingside. (That was the plan)",
        "21. Rxa7": "I give away a pawn for more time to develop. Now I relaxed a little, as Rc1 is not possible.",
        "21... Bd6": "Still more pressure on g3.",
        "22. Rb1": "Probably trying to push the pawn up. However, here comes...",
        "22... Bxg3": "!? The best I could think of. ",
        "23. fxg3 Rxg3+": "! Now comes the rook.",
        "24. hxg3 Qxg3+": "Now the Queen.",
        "25. Kf1 Qg2+ 26. Ke1 Re8+": "Now the other rook.",
        "27. Kd1 h2": "I was expecting him to sack the knight, after which I would play Rg1. But...",
        "28. Ra8+": "He swaps rooks first.",
        "28... Kd7 29. Rxe8": "?? Now for a Zugzwang. (promotion with check, then recapture)",
        "29... h1=Q+ 30. Ne1 Kxe8": "Now I am winning. The plan now is to stack everything against e1. ",
        "31. Qe2+": "?? I immediately spotted Qe4+, winning the rook.",
        "31... Qxe2+ 32. Kxe2 Qe4+": "There it is. ",
        "33. Kd2 Qxb1 34. Nd3": "White should have resigned, but played on until he blundered his knight.",
        "34... Qxb5 35. Nf4 Qb2+ 36. Kd3 Qb1+ 37. Kc3 Kd7 38. Nxd5 Ke6 39. Nc7+ Kd6 40. Ne8+ Ke7 41. Ng7 Kf8 42. Nf5 Qxf5": ""
    },
    "url": "https://gameknot.com/annotation.pl/chess-game?gm=65217",
    "gameName": "Chess game",
    "players": "Bostony (1143) vs. Slickboy166 (1186)",
    "opening": "Sicilian defence (B30)"
}