{
    "moves": {
        "1. e4": "This was a game I enjoyed playing on an iPhone app that I thought was just too great and had to save it here for review.  A little background:  This was my 4th game against this particular opponent from Atlanta.  He played well and provided good competition each game, which is hard to find in some of the cell phone apps.  I had won the first two games where we played traditional offensives and defenses.  On the third game, my opponent started off the game playing only with his pawns and locked up the middle of the board and we each had control of different colored squares.  This threw me off since I haven't played this way much, and it cost me the game.  What you'll see here is the 4th game, and he tried the same technique.  This game ends with a beautiful mate combo.",
        "1... e5 2. Nf3 d6 3. d4 f6": "Here I realized he was ready to lock up the middle, just like the previous game.",
        "4. Be2": "Developing, ready to castle, and preventing a pin on my knight.",
        "4... Nd7 5. Nc3 c5": "An attack at my center.",
        "6. d5": "I decide to play along with his style and lock up the middle.",
        "6... b6": "More pawns, more control of the dark squares for Black.",
        "7. O-O": "I'm ready to play...",
        "7... g5": "Pawn storm on my position, or just another way to say he likes pawn defenses?  I'll have to find out...",
        "8. a4": "Trying to open up the queenside, but more importantly I'd like to be able to bring my knight or bishop to b5 without worry of a pawn attack.",
        "8... a5": "B5 is now mine.",
        "9. Bb5": "Pinned knight",
        "9... Ke7": "Black unpins his knight, and decides to keep his king in the center of the locked up board.",
        "10. Qe2": "Developing and placing an attacker underneath Black's king... always a good idea for when the board opens up.",
        "10... h5": "Unusual play based upon all the other pawn moves.  I can only determine that a pawn storm is coming to break up my defense.",
        "11. h3": "I was reluctant to break up my pawn defense, but wanted to defend against the pawn storm.",
        "11... h4 12. Nd1": "I determined I'm going to need more support on the Kingside for the oncoming attack, and f5 looked like a good square.  That's all I concentrate on for the next few moves.",
        "12... Bg7": "Black must make a spot for his d7 knight to move to.  It isn't doing much where it is.  He's going to swing it over to my kingside to help with the attack.",
        "13. Ne3 Nf8 14. Nf5+": "I'm on a nice square with my knight, and its supported and free from pawn attack.  Bonus: Black is in check.   If Black eats it with his bishop, I'll be able to start opening up the middle, directly underneath his king.",
        "14... Bxf5 15. exf5": "And that's what happens.",
        "15... g4": "Attack continues in order to chip away at my defense.  Black is much safer than I am.",
        "16. hxg4": "I decide I'll open up the h-file and give up a pawn in order to be a little safer.",
        "16... h3 17. gxh3 Rxh3": "That's the pawn I gave up.",
        "18. Kg2": "Black doesn't have much backup for this attack, so I feel safe here, even though my defense is broken.",
        "18... Rh8": "Black retreats after claiming a free pawn and is now up in material, has a safe king, and has a rook on an open file next to my king.  Things can't be worse for me here, lol.  After looking at this position for a long while, I knew I had to open up the middle of the board and get my rooks into play.  Black has a great advantage, but half his pieces aren't in use.  If I could open up the board a little bit and get my pieces into play faster than Black, I may have a chance.",
        "19. g5": "Attempting to open up the defense around Black's king.",
        "19... Nh7": "Protecting the f6 square, but more importantly, I think this move was terrible for black.  What has happened here is that Black has closed off his control of the h-file...",
        "20. Rh1": "...and I jumped on the opportunity to grab the h-file.",
        "20... Qc8": "Black attacks my pawn of f5.",
        "21. Qe4": "Support added.",
        "21... fxg5": "Black decides to trade here, rather than let me eat and check.",
        "22. Nxg5 Ngf6": "The knight finally comes into play, but I thought recapturing with his other knight would have been better as he would have been attacking my queen and rook at the same time.  Also, moving the bishop down would have attacked my unprotected knight.",
        "23. Qf3": "I move away from the threat, but keep protection on my d5 pawn.",
        "23... Nxg5": "Black chooses to trade knights and pushes forward with the attack, threatening my queen or a trade of rooks.  In doing so, he has opened up the h file for himself again.  Black still has a superior position, so trading pieces isn't too bad of an idea at this point.",
        "24. Bxg5": "By trading knights, Black ends up with his other knight pinned.  Also note that I have now connected my two rooks.  If Black decides to swap rooks, I'll end up with my other rook on the H-file.  Trading rooks isn't really an option for either of us right now.  There is a lot of tension on the h-file, but whoever eats the other's rook first will lose control of it.",
        "24... Qb7": "Black chooses not to trade rooks on h1.  Instead, Black brings the focus to the center of the board, attacking the d4 pawn, but this will only work after he unpins his knight.  Another mistake here:  The obvious skewer which I play on the next move.  It was so obvious I determined it to be bait, and a sacrifice of his rook, so I hesitated for a very long time before I made the move because I thought something may be fishy.  I'll explain on the next move...",
        "25. Bc6": "Here's the skewer.  Here I thought Black was going to give up his rook, which isn't even in the game, so that he can sneak his queen past the pawn line and into my sacred area.  His next move would be to move his queen to a6, letting me eat the rook, and then his queen can slide right in.  I decided that I may be able to tolerate this because I have enough defense at the moment to hold off the queen, so I accepted this position.",
        "25... Qa6 26. Bxa8": "Here is where Black's queen can sneak in and do some damage, but Black is now down in material and decides to try and keep the game equal as possible by taking my Bishop...",
        "26... Qxa8": "Black now has a great diagonal, and my king is on it.  Black's position is actually pretty good here and was keeping me worried.  I wanted to try and swing my queen around thru the g and h files for an attack, but now I'm stuck defending the d5 pawn unless I give it other support.  I need more pieces in play...",
        "27. Rae1": "Purely positional, placing my rook under Black's king.  Here I started trying to find a way to sacrifice a piece by eating on e5.  Right now, I see this as my only way to Black's king.  The positions of both sides here are starting to look more equal, and I'm able to breathe again.",
        "27... Rb8": "I think that here is where Black blew it.  He gives up control of the H-file again, and places his rook in a terrible spot.  My only rationale for this is that he is trying to attack on my very weak side, probably ready to push the b5 pawn forward and open up that side of the board.",
        "28. Rh7": "I pin yet another piece of Black's, so now I have 4 pieces in play against Black's rook and queen, who are nowhere near to defend his King.  Things are looking great for me.",
        "28... Kf7": "This move is almost forced, to prevent my rook from taking the bishop.  Other option would have been to swing the rook back to g8, which would have been better.  I looked at this position for a very long time, playing out many scenarios in my head.  I had a couple of great ideas.  First, moving my e1 rook over to h1 would give me a powerful attack on the right side of the board.  My other idea was to get my queen around the corner to join the attack, but any wrong move I made would allow Black's queen to eat at d5 and put me in check.  I also nearly played c4 in order to prevent that, but that may have lost me a tempo and allowed Black to swing his rook back to the defense.  I wanted to continue my attack while Black's strong pieces were away from the action.  I could have also eaten the knight with my bishop, saving my rook from an attack while chipping away at his defense, but then I saw the greatest combination that I've ever played.  It is a mate in 9 moves.  Can you see it?  Here it is...",
        "29. Rxg7+": "Impossible to resist, Black will take this rook.",
        "29... Kxg7 30. Bh6+": "A free bishop?  Black probably thought I made a careless mistake.  Impossible to resist.",
        "30... Kxh6": "Now I'm down in material and any wrong move will let Black's queen come thru the middle and finish me off.  I've just sucked Black's king against the side of the board so I must continue to pound on him.",
        "31. Rh1+ Kg7": "Black may have been better off coming to g5 as that would have ended my forced move combination, but when I saw this position a few moves back, I thought the risk of that was really low and Black would not want to bring his King closer in towards me, especially with my queen so close to him.",
        "32. Qg3+ Kf7 33. Qg6+ Ke7 34. Qg7+ Kd8 35. Rh8+": "Game over.  Black resigned here.  He can not prevent the mate even though he has more material.  There is just no defense available for Black.  Also note how effective my earlier pin on his knight was.  The knight is still in the same spot it was.  That pin essentially removed the knight from the game.\n\nHope you enjoyed."
    },
    "url": "https://gameknot.com/annotation.pl/chess-game?gm=43886",
    "gameName": "Chess game",
    "players": "???  vs. ??? ",
    "opening": "Philidor's defence (C41)"
}