{
    "moves": {
        "1. e4 e5 2. Nf3 Nc6 3. Bb5": "Ruy Lopez",
        "3... Nf6": "Berlin Defense, striving to take the initiative.",
        "4. O-O": "The main line response.",
        "4... Nxe4 5. d4 Nd6 6. Bxc6 dxc6 7. dxe5 Nf5 8. Qxd8+ Kxd8": "This is the main line starting position of the Berlin Defense in the Ruy Lopez.  Black has taken a slightly unhealthy pawn structure for the bishop pair.  The Berlin is a super solid defense and has a reputation of almost most being too solid!  When Kramnik won the World championship from Kasparov he employed the Berlin Defense several times to blunt Kasparov's attacking prowess.",
        "9. Rd1+": "A weak move in my opinion.  The minor pieces should be developed first, and I wanted to play Ke8 anyways.",
        "9... Ke8 10. Bf4": "Again not the strongest setup for white.  A more common line is: 10.Nc3 Ne7 11.Nd4 Ng6 12.Ne4 Be7 13.Re1 c5 14.Nb3 b6 15.Nf6+ (15...gxf6 16.gxf6 then fxe7 winning piece back) Kf8 16.Nd5 Bd8 17.Nd2 c6 18.Ne3 when Black appears to be tangled up but is fine.",
        "10... h6": "This protects the e6 square for the light-squared bishop.  The bishops are black's advantage and it is ok to take some tempi to maintain the two bishops.",
        "11. Nbd2 Ne7": "Maneuvering the knight to g6.  Black's target right now is the e5 pawn which Black will try to blockade then attack. ",
        "12. h3 Ng6 13. Bg3 Bf5": "Trying to provoke a weakness with c2-c3.",
        "14. Nd4 Bd7 15. Nd2f3 c5": "Gaining space with the \"weak\" doubled pawn.  Maybe it will prove to be quite strong after all?",
        "16. Ne2 Ba4": "Again attacking c2, trying to get white to push his pawns.",
        "17. Rd2 Rd8 18. Rxd8+": "Allowing the Black king back over to the queen side.  It is odd that the Black has moved e8-d8-e8 and now back to d8 and will go to c8!",
        "18... Kxd8 19. Rd1+ Kc8 20. Rd2 b6 21. Nf4": "I am not sure why White wants to trade pieces, but I was rated almost 600 points below my opponents so I was all for trading pieces.",
        "21... Nxf4 22. Bxf4 Be7": "Finally getting my king side out.",
        "23. Ne1": "He is so tired of my pesky bishop attacking c2, he retreats to the back rank to defend c2.  It is obvious that White does not have a plan.",
        "23... Rd8 24. Rxd8+ Bxd8": "This is the key position of the game.  This is where the endgame and planning skills are important.  Black's light squared bishop is good, and is other one is passive.  Both of white's minor pieces are passive and defending right now.  Black has more space on the queen side while White has his territory in the center thanks to the e5 pawn. The king side is undecided with The pawn structures exactly the same.  The kings are on opposite sides of the board leading to an odd endgame.",
        "25. Be3": "Retreating the bishop in order to play f4 and get the king side rolling.",
        "25... Kd7": "The king must be active in the endgame.  I want to place my king on e6 or even d5.",
        "26. b3": "Finally kicking the bishop and stopping the c5 pawn.",
        "26... Bc6 27. f4 g6": "Controlling f5.  White could think about 28.f5 gxf5 29.Bxh6 Ke6 When he has a outside passed pawn, but e5 is weak.",
        "28. Kf2 h5": "Trying to keep white from playing g4.",
        "29. g3 a5": "Planning to make weaknesses on the queen side to attack.",
        "30. Ke2 a4 31. Nd3 axb3 32. axb3 Bg2": "I want White to play h4 when his pawns are locked and I can play on the queen side.",
        "33. Nf2 Ke6 34. Kd2 Be7 35. c3 Bf1 36. h4 Bb5 37. c4 Ba6 38. Kc3 Bb7 39. Kc2 Bf3 40. Bd2 Bc6 41. Bc3 Bb7 42. Kb2": "Finally I have the white pieces where I (think I) want them for my c6-b5 attack.",
        "42... c6 43. Ka3 b5": "Stopping the invasion of the king, and liquidating my doubled pawns.  Now Black is winning.",
        "44. Ka2 Ba6": "! Forcing white to trade, giving me a semi-passed pawn on the queen side.",
        "45. cxb5 cxb5 46. Bd2 Kd5 47. Kb2 Kd4 48. Kc2 Bc8 49. Bc1 c4 50. bxc4 Kxc4": "I wanted to keep the passed pawn as far to the left as possible to distract the white pieces if needed to attack the king side.",
        "51. Be3 Bf5+ 52. Kb2 f6 53. Nd1 Kd3 54. Bb6 fxe5 55. fxe5 b4": "Here White resigned.  He could have continued, but he was very low on time and was so frustrated after playing like this to a 1400.  I hope you enjoyed this endgame.  I think it would be beneficial to analyze it in more depth out to the end."
    },
    "url": "https://gameknot.com/annotation.pl/chess-game?gm=23903",
    "gameName": "Chess game",
    "players": "Purdy (2015) vs. Lesslie (1437)",
    "opening": "Ruy Lopez (C67), open Berlin defence, l'Hermet variation"
}