{
    "moves": {
        "1. e4": "Kings pawn opening. The most noble of openings!",
        "1... e5": "He responds with kings pawn as well. It is clear that Zakmo is up against a noble, and exceptionally cerebral opponent!",
        "2. Nf3": "My noble knight leaps into the battlefield!",
        "2... Nc6": "His knight quickly flies to the aid of the kings foot soldier! ",
        "3. Bc4": "I continue the aggression, making the pawn of f7 the target of my assault!",
        "3... Bc5": "jagun is truly wise and recognizes my plan of action. He prepares an appropriate defense!",
        "4. Nc3": "I continue my attempt to gain control of the battlefield by sending the valiant Knight of B1 into battle!",
        "4... Nf6": "He continues to mirror me, competing valiantly for control of the war zone!",
        "5. d3 O-O": "Observing the battlefield, their king sees fit to retreat into his castle!",
        "6. Be3": "My bishop prepares for a sacrifice, ONE THAT WILL SET OUR GLORIOUS ASSAULT INTO MOTION! His sacrifice will not be forgotten! ",
        "6... Bxe3": "HIS BISHOP SWEEPS IN!",
        "7. fxe3": "THE STAGE IS SET! thanks to the valiant sacrifice by the Bishop of Black Square!",
        "7... Na5": "His knight foolishly leaves his post in his futile attempt to assault my remaining Bishop! YOU HAVE LEFT YOUR PAWN OPEN FOR ATTACK! ",
        "8. Nxe5": "HIS PAWN IS SLAIN AT THE HANDS OF THE NOBLE KNIGHT OF G1!",
        "8... d6": "jaguns queen pawn advances onto the battlefield, threatening the noble Knight of g1! The noble Knight of g1 and the Bishop of White Square have both fought gloriously, and they prepare for the ultimate sacrifice! One of which that shall win me the battle!!",
        "9. Nxf7": "the noble Knight of g1 STRIKES!",
        "9... Rxf7": "His rook sweeps into battle, slaying the noble Knight of g1! his sacrifice was not in vain!",
        "10. Bxf7+": "The Bishop of White Square glides away from the threatening knight and slays the kings rook! An ultimate sacrifice that takes out one of the most powerful of opposition!",
        "10... Kxf7": "Alas, their king is a mighty warrior, ending the threat of my Bishop of White Square!",
        "11. O-O": "Zakmo enters his castle and allows his Rook passage to Glory!",
        "11... Kg8": "His king sees that danger approaches and retreats into his castle! ALAS, YOUR WALLS ARE CRUMBLING AND YOUR PROTECTOR IS SLAIN!",
        "12. Ne2": "My valiant Knight of b1 sees opportunity at the other side of the battlefield and leaps towards glory!",
        "12... Bg4": "ALAS, his Bishop of White Square sees the knights plot, and attempts to foil it! He pins the valiant Knight, who must now remain a stationary bulwark defense of the Queen!",
        "13. Qd2": "The queen sees her position is interfering with the movement of the Knight and quickly moves away. This move relieves the valient Knight from his defending post!",
        "13... c5": "HIS MINIONS BEGIN THEIR ADVANCE!!",
        "14. c3": "ALAS, i see your plans you devilish rogue! DEFEND THE LEFT FLANK MY MINIONS!",
        "14... c4": "HE CONTINUES HIS ADVANCE?! This was not anticipated by me...",
        "15. d4": "ALAS, YOU CAN NOT HAVE MY PAWN! But wait... I have committed a blunder! In an attempt to protect my ranks... i have left the Kings pawn undefended!",
        "15... Nxe4": "His Knight STRIKES! He quickly defeats the noble Kings pawn and threatens my noble queen!",
        "16. Qc2": "My queen hastily removes herself from harms way... but it is a hollow move as the kings pawn has been slain... he will be mourned.",
        "16... Qe7": "His queen moves into the battlefield, aiding the knight who slayed the kings pawn! ALAS, HIS DEED WILL NOT GO UNPUNISHED!",
        "17. Rf4": "The Kings Rook, our Stalwart of nobility glides into the field and threatens both jagun's bishop and knight!",
        "17... Bxe2": "The bishop is forced to sacrifice itself, doing battle with the Valiant Knight of b1!",
        "18. Qxe2": "My queen quickly defeats him. ",
        "18... d5": "HIS MINIONS CONTINUE THEIR ADVANCE! HE IS UNAWARE OF THE ASSAULT THAT IS ABOUT TO TAKE PLACE!!!",
        "19. Raf1": "And the Battering Ram of truth is completed as the Rook of a1 slides into the f column!  THE F COLUMN IS  UNDER MY COMPLETE CONTROL!",
        "19... Nc6 20. Qh5": "My queen glides, gracefully onto the battlefield! Threatening the f7 square along with the battering ram of truth! The opposing d5 pawn is also threatened!",
        "20... Nf6": "His knight catches on to my threat! He retreats back to cover both the threatened positions!",
        "21. Qg5": "My queen quickly forces him to defend his queen!",
        "21... Rf8 22. Rf4xf6 Rxf6 23. Rxf6": "The battle rages on as both of Zakmo's stalwart rooks sacrifice themselves for glory!",
        "23... Qxf6": "The Battle of the F column dies down! A war full of sacrifices that gains Lord Zakmo astounding position!",
        "24. Qxd5+": "My queen glides gracefully and swiftly ends the d5 pawn, threatening both jagun's king and the c4 pawn!",
        "24... Kh8": "THEIR KING RETREATS FARTHER INTO HIS CASTLE! WE HAVE THEM ON THE RUN!",
        "25. Qxc4": "DIE EVIL MINION!",
        "25... h6": "The kings castle is crumbling! He makes an escape hatch!",
        "26. b4": "ADVANCE MY MINIONS!",
        "26... Qf5": "His queen sees an opportunity to control the bank rank! Alas, i see your tomfoolery!",
        "27. h3": "COMMENCE OPERATION ESCAPE HATCH! ",
        "27... Kh7": "His king moves into his escape hatch, seeking protection from his queen! ALAS... your fate is already sealed!",
        "28. a4": "CONTINUE YOUR ADVANCE MY SOLDIERS! ONWARD FOR GLORY! OUR DAY HAS COME!!!",
        "28... a6": "His own foot soldiers prepare for battle! Alas that battle will not commence, for his resignation will come far before battle takes place!",
        "29. d5": "His knight is threatened as my minions continue their advance!",
        "29... Ne5 30. Qf4": "My noble queen prepares herself for the ultimate sacrifice!",
        "30... Qb1+": "But their queen is a coward! RUN YOU EVIL SUCCUBUS! RUN AROUND LIKE THE WHORE THAT YOU ARE!",
        "31. Kh2 Ng6": "His knight threatens my noble queen! ",
        "32. Qd4": "But my swiftly glides from danger, and comes to aid my minions advances!",
        "32... Qf5 33. d6": "ADVANCE MY MINIONS!",
        "33... Qd7": "YOU WILL NOT STOP MY ADVANCE EVIL SUCCUBUS!",
        "34. e4 Nf8 35. e5 Qxa4": "The succubus slays one of my minions! IT IS TOO LATE! YOU CAN NOT STOP MY MINIONS ADVANCE!",
        "36. e6": "MY MINIONS CONTINUE FORWARD!",
        "36... Nxe6": "His knight slays a foot soldier! Alas, it was a blunder! YOUR FATE IS SEALED!",
        "37. Qe4+": "VICTORY! \n\nJagun fought a glorious fight, but is forced to resign after both his king and knight is endangered. My minions have advanced far into enemy territory, too far to be stopped. The war is won!"
    },
    "url": "https://gameknot.com/annotation.pl/chess-game?gm=38516",
    "gameName": "Chess game",
    "players": "zakmo (1200) vs. jagun (1965)",
    "opening": "Giuoco Piano (C50), four knights variation"
}