{
    "moves": {
        "1. d4 d5 2. e3 Nc6": "this is probably the most common response. I took some advice from quite a few people not to push c4, maybe I'll save that if i need to confuse the crap out of someone.",
        "3. Nf3": "my replacement move to c4",
        "3... Qd6": "? ",
        "4. Nc3": "I wasn't 100% sure of this move, sure it's a good move, and it's attacking the d5 which is easy enough to remove the guard from, but it slows down what is supposed to be an aggresive game",
        "4... e5": "not a bad move, but not a good one either. ",
        "5. Bb5": "this has happened to me so many times, I decided it was time I started using it more.",
        "5... a6": "this is my response to this too.",
        "6. Bxc6+": "a chance to screw with pawn structure? ok. surely he won't remove the only guard on e5...",
        "6... Qxc6": "!?!? what!? not bxc6!? madness!",
        "7. Nxe5": "this is kind of obvious, but I'm up a pawn so there.",
        "7... Qd6": "\"realizing the utter stupidity of his previous actions, the south brazilian black chess player retreats to it's natural habitat.\" this one isn't much better. anyone else see the lovely practically unguarded f7?",
        "8. Qf3 c6": "!?!?!?!? ok, I'll admit that this pawn structure bothers me for awhile, but this move was terrible.",
        "9. Qxf7+": "free pawns taste so good, check just adds to the flavor.",
        "9... Kd8 10. Qf4": "this is not a pointless retreat, f7 now has an even BETTER move that i am shooting for",
        "10... Nh6": "darn. this stinks. oh well. ",
        "11. Qg5+": "I was hoping for a Be7 block, that's when the fun begins. unfortunately, that never happens. ",
        "11... Kc7": "sweet spot has shifted to e8",
        "12. e4": "that pawn structure bothered me. I should mention that his is 5 min. game with 5 sec delay, which explains some errors.",
        "12... dxe4 13. Nxe4 Qxd4": "I have to admit, I didn't see that coming. ",
        "14. Qf4 Bb4+ 15. Bd2 Qxb2": "OUCH OUCH OUCH.... for black. White takes queen with discovered attack in one move. ready?",
        "16. Nc4+": "OUCH. but the guy is a good sport about it. ",
        "16... Kd8 17. Nxb2 Be7": "evil motives behind this move? can someone explain besides blocking me getting a check fork with g7?",
        "18. Ba5+": "this bishop really comes in handy",
        "18... Ke8": "I can almost hear the shouting of my team mates in my head \"Pin the Bishop!\" I like this move better",
        "19. Nd6+ Bxd6 20. Qxd6 Nf7": "a desparate attack on my queen? it is actually very effective given that stupid c8 bishop",
        "21. Qd2": "method to the madness",
        "21... g6": "?!!!!!!!!!!!!!!!!!!!!!!!?!?!?!?!?!?!?!?",
        "22. Qe3+ Kf8 23. Bb4+ Kg7 24. Bc3+": "this is the end of the game. g8 is mate, f8 is free rook and great position, this game is over either way",
        "24... Kg8 25. Qe8#": "this game is a perfect example of this agressive opening, but I would like to have castled, but I had too much of an attack going to slow down for a turn"
    },
    "url": "https://gameknot.com/annotation.pl/chess-game?gm=35485",
    "gameName": "Chess game",
    "players": "???  vs. ??? ",
    "opening": "Queen's pawn (D00), stonewall attack"
}