{
    "moves": {
        "1. e4 c5 2. Nf3 d6 3. d4 cxd4 4. Nxd4 Nf6": "The standard Sicillian Opening, that players like to mix move order or use other Variations, c3, Bc4 Nc6 so the opponent doesn't get too comfortable.\nHere Nf6 is attacking undefended e4 pawn.",
        "5. Nc3 a6": "White develops and defends, Black move protects b5 square from B and N and also prepares a Queenside pawn attack.",
        "6. Bg5 e5": "Black was in two minds to move pawn e6 or e5. Black is rethinking his opening repertoire and moving from Scheveningen (e6) to a more aggressive Najdorf (e5) (pron. Najdorf).  Black also believes a player shouldn't use openings where you have to look up the spelling for.",
        "7. Nf3": "A few options for the White Knight.  So Opening books prefer Nb3, for a while I din't understand why the Knight would run so far away from the action (a Knight that's now moved 3 times aswell).  Someone like András Adorján may applaud Nf5.  But on this occasion Black saw that the d1-h5 diagonal was blocked, so attempted to take advantage.",
        "7... Be7 8. Bd3 Be6": "Some developing Black in particular is defending the hole on d5 with 8.Be6.",
        "9. O-O Ng4": "Is Ng4 too early? still a couple of obvious development moves Black can do.  If Black has undeveloped two Rooks and one Knight and a central King, where can White get some compensation?",
        "10. h3": "I would have preferred the forcing 10. Bxe7",
        "10... Bxg5 11. Nxg5 Qxg5 12. hxg4": "White has to keep up with captured material.",
        "12... Bxg4 13. Be2 h5": "Black invites the h-file to be opened.  White still has some counter-play",
        "14. Bxg4": "Leave well alone.  An alternative 14. Qxd6 keeps Black thinking and puts a hole in an open h-file plan.",
        "14... hxg4 15. Qxd6": "Black had to think was there enough time for White if Black moved the Queen to the h-file.",
        "15... Qh4": "Unbelievably Black moved to the wrong square.  15....Qh5 protects the e5 pawn and stops immediate safe checks.  White has no time for anything else. 16.f3 g3, 16.Rfd1 Qh1#.  After the game Black said they wanted to be pretty and keep everything on the dark squares.",
        "16. f3 g3 17. Qxe5+": "Rightly White starts they're bid was at least a draw.",
        "17... Kf8 18. Qc5+ Kg8 19. Qc8+": "Nicely done.",
        "19... Kh7": "If White next moves 20.Qh3 and the following exchanges.   It may not equalise positionally, but White will still have good chances.",
        "20. Qf5+ g6 21. Qxf7+ Kh6": "Again, White needs to move the Rf1 somewhere else.  And survive a King hunt.",
        "22. Qxb7": "Perhaps hoping Black missed the Checkmate.  It does happen.  Black missed earlier moves.",
        "22... Qh2#": ""
    },
    "url": "https://gameknot.com/annotation.pl/chess-game?gm=46762",
    "gameName": "Chess game",
    "players": "Player A  vs. Player B ",
    "opening": "Sicilian (B94), Najdorf, 6.Bg5"
}