{
    "moves": {
        "1. d4": "Queens Pawn opening",
        "1... d5 2. c4": "Queen's pawn gambit!",
        "2... e6": "Gambit denied",
        "3. Nc3": "Attacking the d5 pawn, putting more pressure",
        "3... Nc6 4. Bf4 Bb4 5. e3": "Protecting d4 pawn from Nc6 Knight",
        "5... e5": "Forking pawn and bishop, forcing bishop to move due to the Nc6 Knight protecting it.",
        "6. Bg3 exd4 7. exd4": "Traded pawns",
        "7... Nf6 8. cxd5 Nxd5": "Good Move! Nc3 knight is pinned, so Black gets a free pawn!",
        "9. Bc4 Nxc3 10. bxc3": "Good move. It's the best you can do in this situation. Although the bishop can fork the King and the Rook, giving it 2 free points, the Knight attacked the Queen, losing 6 points.",
        "10... Bxc3+": "And the Bishop forks the Rook and Knight",
        "11. Kf1 Bxa1 12. Qxa1 Nxd4": "Free pawn, due to the Black Queen protecting the Knight.",
        "13. Qe1+ Be6 14. Bxe6 Nxe6": "Traded Bishops\n",
        "15. Nf3 O-O": "Castling for the King's safely and helping the Rooks get out of their corner",
        "16. Bh4 Qd3+ 17. Kg1": "King is now stuck into the corner, can be a big weakness for White right now",
        "17... Rfd8": "Uh oh! The h4 Bishop is attacking the Rook! Bad move alert!",
        "18. g3": "Another bad move! White didn't see the Bishop attacking the king, and proceeded to give some space to the king, instead of getting 2 points and probably ending Black's attacks.",
        "18... f6": "Black finds out, and protects the Rook",
        "19. a4": "Very bad move. Should have done 19. h3 20. Kh2 to give King more room",
        "19... Qxf3 20. Kf1": "Another bad move! Should have done 20. h3 21. Kh2",
        "20... Rd7 21. h3": "There is the h3 move I was talking about. But it might be too late!",
        "21... Rad8 22. a5": "Bad Move! Kg3 it the best choice, so in when 22... Rd1 23. Kg2, having the rook protecting the Queen, because the King's safety will be in jeopardy.",
        "22... Rd7d1 23. a6": "White is currently not thinking of his moves! But now, it's too late. The game is over, due to the White's mistakes and failure to scan the board for good pieces to capture.\nEven with 23. Qxd1 Rxd1#",
        "23... Rxe1+ 24. Kxe1 Rd1#": "Good game!"
    },
    "url": "https://gameknot.com/annotation.pl/chess-practice?gm=59810",
    "gameName": "Chess Practice",
    "players": "???  vs. superandy ",
    "opening": "QGD (D31), 3.Nc3"
}