{
    "moves": {
        "1. d4": "So I start conventionally..",
        "1... d5": "He replies with the same.",
        "2. c4": "Standard Queen's Gambit.",
        "2... Nf6": "This is a weak way of continuing. Better is e6 or c6 or just taking on c4.",
        "3. cxd5": "I exchange, giving me a pawn majority in the centre.",
        "3... Nxd5": "My opponent recaptures.",
        "4. e4": "I seize the centre.",
        "4... Nb6": "The knight retreats.",
        "5. Nc3": "I develop.",
        "5... Nc6": "Very provocative! Challenging me to advance my pawns again.",
        "6. d5": "I don't shirk this challenge!",
        "6... Ne5": "So the knight comes up.",
        "7. f4": "I hit it again.",
        "7... Bg4": "He hits my queen.",
        "8. Qc2": "Queen moves. Be2 was possible, but I don't want to encourage the exchange of pieces, as I have the big pawn centre and its cramping effects are stringer with more pieces on the board.",
        "8... Nec4": "So the knight is forced to move yet again.",
        "9. h3": "I hit his bishop.",
        "9... Bd7": "Bishop drops back.",
        "10. Nf3": "I develop my other knight.",
        "10... e6": "Black starts to try to undermine white's pawn centre.",
        "11. b3": "I hit the knight again.",
        "11... Nd6": "It retreats.",
        "12. dxe6": "I take the pawn.",
        "12... Bxe6": "The bishop recaptures. Presumably black wants to keep the f, g and h pawns together to allow king's side castling with an intact pawn formation in front of the castled king. Taking back with the f pawn also gives black an isolated e pawn.",
        "13. Bb2": "This seemed the best square for the bishop.",
        "13... a6": "I think a6 is a mistake. Black should concentrate on getting pieces developed and king safely castled. Black has a plan to exchange some minor pieces, to lessen the cramping effects of White's powerful pawn centre, but Black just don't have time for this.",
        "14. O-O-O": "With the threat of e4-e5 winning the knight on d6 as the White rook on d1 pins it against the Black queen.",
        "14... Bd7": "So the bishop drops back, breaking this pin.",
        "15. g4": "I want to play e4-e5 without allowing the Black knight on d6 onto the f5 square.",
        "15... Qe7": "Queen moves to break the potential pin on the d file, but I am not sure this is best. I think Black must just accept further cramping with 15.... Be7 16. e5 Nc8. Black is horribly cramped, but is still in the game and maybe can play 0-0 if necessary, although White seems to have a ready made attack on the king side, with Bf1-d3 attacking the pawn on h7 and White's king side pawns are already advanced and so ready to open up files if Black weakens the king side with g7-g6 or h7-h6. Basically Black has got a bad position, due to faulty opening play, going back as far as move 2!",
        "16. e5": "So I push on.",
        "16... Nb5": "Encouraging the exchange of minor pieces.",
        "17. Nxb5": "I was tempted to take with the bishop, but I wanted to open up the c file.",
        "17... axb5": "I rather expected the bishop to recapture, to exchange a pair of bishops, which may ease the Black position slightly. White would still be better, but Black is still in the game. Note that White can't take on c7 immediately, as Black as Ra8-c8 wins the White queen. Notice how although White is better, I still have to be very careful!",
        "18. Kb1": "So now I really am threatening the c7 pawn, and at the same time I protect my a pawn. The downside is that I put my king on a white square, with interesting consequences.",
        "18... g6": "This is a mistake. I think Black need to play c7-c6. the Knight on b6 can then come back into play onto d5 - although not immediately as white can play Bf1 x b5 and if Black captures the bishop on b5, the knight on d5 is capture by the rook d1. But Black can prepare Nb6-d5 with Bd7-e6.\nNow White's simplest win is e5-e6, attacking the bishop on d7, but also opening up the diagonal for my bishop on b2 to attack his rook on h8. Unfortunately, I had become fixated about taking the c pawn with my queen. This is quite a common mistake in chess. One gets a plan in the head and doesn't spot another opportunity which has arisen.",
        "19. Qxc7": "So I take on c7. Having played it, I suddenly thought \"oh dear, he can now win my queen with 19.... Bd7-f5 check, and after 20. gxf5 Black wins the White queen with Qxc7.\" But then in my mind I started to study that position. White is actually still winning, even though I have just lost my queen! I can play 21. Bf1xb5 check. Now if Black blocks this check with Nb6-d7, then 22. Rxd7 wins, for instance, 22...Qxd7, 23. Bxd7 check, and if Black recaptures on d7 with 23.... Kxd7 then White has e6-e7 check, opening up the long diagonal for my bishop on b2 to take the Black rook on h8, and White is materially ahead. \nAfter 19. Qxc7 Bf5+ 20. gxf5\tQxc7 21. Bxb5 check, apart from just throwing away the queen with Qc6 or Qd7 the only other way out of check by Black is to play Ke8-e7. But then the king is starting a march up the board which will be disastrous. 22. f6+ Ke6 23. Ng5+ Kf5 24.\tBd3+\tKxf4 25. Rhg1 and Black's king is caught in a mating net!",
        "19... Ra6": "Unfortunately, he didn't play it and found a way to protect his knight. However this move just loses. 19..... Qe7-c5 is probably the best move, but White is still winning, as I have e5-e6 at some stage. Notice that now that White has moved the queen from c2 to c7, e5-e6 is no long so good, for instance 20. e6 Qxe6 21.\tBxh8\tQe4+ 22. Ka1 Qxf3 and Black is still in the game.",
        "20. Bxb5": "This is crushing! I pin his bishop on d7 against the Black king, so that Bf5 check is no longer playable. The Rook on h6 is attacked. If the rook moves the knight on b6 drops. It is just hopeless, but what if the bishop is just taken?",
        "20... Bxb5": "So he takes the bishop. OK stop - what did White play now?",
        "21. Qb8+": "And he rather unsportingly disconnected as he is getting mated. Many thanks for reading this annotation, please leave a comment or two and rate it on the star system!"
    },
    "url": "https://gameknot.com/annotation.pl/chess-game?gm=59624",
    "gameName": "Chess game",
    "players": "me (2061) vs. mikilschreenan  (2037)",
    "opening": "QGD (D06), Marshall defence"
}