{
    "moves": {
        "1. Nc3": "My favorite opening",
        "1... e5 2. Nf3": "Pawn in trouble",
        "2... d6 3. e4 d5": "You'll notice that in this game, black makes lots of little mistakes that cost him pieces. This is the first.",
        "4. exd5": "Well, when you threaten my pawn like that, I'm going to take yours.",
        "4... Qxd5": "And this is what changed the tone of the game entirely.",
        "5. Nxd5 Be6 6. Nxc7+": "Another mistake by Black allows me to take a pawn and make this move. A better move might have been Bd6 to protect that space until he could move the other pieces (mostly the knight that blocks the rook) to prevent this move.",
        "6... Kd7 7. Nxa8 Kc6": "It's anybody's guess as to what the king is doing here.",
        "8. Ng1": "At this point, I'm just making a random move to see what my opponent will do.",
        "8... Nd7 9. d3 b5": "I still don't know what my opponent is doing.",
        "10. Be3": "My objective: The pawn on a7.",
        "10... a6": "My opponent saw right through it.",
        "11. Nb6": "Time to get my knight back into play.",
        "11... Nxb6": "Here is where I make a crucial mistake and forget that the king can also take pieces as long as he is not in trouble himself.",
        "12. Bxb6 Kxb6 13. Nf3": "Since my first knight did great things upon the field of battle, so shall my second.",
        "13... g5": "What is he doing with that pawn? (I could have easily taken that pawn with my knight, but I ended up finding a better set of moves.)",
        "14. Be2 g4 15. Nd2 Bb4": "I think my opponent is trying to regain control of the board, but at this point, I'm not sure of anything anymore.",
        "16. h3": "Getting his pawn out of my way.",
        "16... Nh6": "Not the best move for his knight to make; a better one would have been Nf6.",
        "17. hxg4": "Good-bye pesky pawn!",
        "17... Nxg4 18. Bxg4": "At this point, there is no harm in trading my pieces for his. ",
        "18... Bxg4 19. Qxg4": "And I gain back the three-point advantage I lost earlier.",
        "19... Rc8 20. Qxc8": "He resigned after this. "
    },
    "url": "https://gameknot.com/annotation.pl/chess-game?gm=52487",
    "gameName": "Chess game",
    "players": "me (914) vs. don't know username (1200)",
    "opening": "Dunst (Sleipner,Heinrichsen) opening (A00)"
}