{
    "moves": {
        "1. e4 c5": "No ano passado eu enfrentei tarcísio,se nao me engano também na quarta rodada,de pretas.Na ocasião eu refleti \num bocado pra jogar 1-Cf6 e convidá-lo a entrar numa Alekhine.O convite foi prontamente recusado com um 2-Cc6,e \nentramos numa empatosa abertura dos 4 cavalos,onde erro de cá e erro de lá,dividimos o ponto.\nAgora,minha preparação psicológica mandava eu jogar uma variante Nimzovich,com 2-Cf6. Num torneio em abril\n em comemoração ao aniversário da PM,salve engano,sob o tempo de reflexão de 15 minutos nocaute,empreguei \ncom suceso essa variante contra ele, embora eu tenha penado um pouco.A primeira partida pensada que \njogamos foi num Cimax de 2007,eu,de pretas,joguei uma Pirc e entreguei uma peça de graça.A primeira partida\n decisiva de torneio entre nós foi jogada em 2005,nos jogos estudantís da serra(JES) e foi ele quem empregou \na dragão!A partir daí e de umas partidas com Adenílton que hoje está em alguma cidade satélite do DF,comecei \ntentar domar esse animal mitológico que segundo a história deu nome à abertura por causa do Mestre Russo Fiodor\n Dus chotimirski que era astronomo e se encantara com a constelação a ponto de homenageá-la com uma abertura de\n xadrez,e vice-versa.Tarrasch Também já jogou isso e venceu;só não sei se ela já tinha sido batizada . Foi esse \ntorneio por acaso, o primeiro torneio que eu vencí, vencí invicto e nem ví o troféu.o pessoal da escola não me \nfalou da data da cerimônia de entrega da premiação quando fiquei sabendo já tinha passado.Fui lá na secretaria\n municipal de educação buscar a premiação mas parece que já tinham  dado pra outra pessoa!!!que sacanagem!\nEu pensei em jogar um gambito Marshall,mas fiquei em dúvida se ele aceitaria.Uma petrov provavelmente levaria a uma\n outra abertura dosquatro cavalos e eu não estava muito a fim de empatar.Há algum tempo levei minha francesa pra \noficina e ainda não fui buscar.Só me restou a velha carcamana.\n",
        "2. Nf3 d6 3. d4 cxd4 4. Nxd4 Nf6 5. Nc3 g6": "Um lance característico da \"Escola Serrana\".Não sei se o fianqueto do rei preto contra o peão do rei\n começou com Benigno ou com Bianchi,porque quando apareci eles já jogavam isso.Só sei que de uns tempos pra cá \no pessoal daqui tá gostando de se defender assim,seja com a india do rei com a moderna ou com a pirc.\nDesde minha partida na final do municipal de 2005 onde iniciei com 1.a3 e Hudson respondeu com 1.g6,ele também \nvirou um cara índio do rei na sua versão mais radical.Só joga isso tanto e brancas quanto de pretas.Interessante\n que  isso deve ser contagioso,porque Paulo César Vieira seu companheiro de pings da madrugada e até Humberto\n de Vila Velha aderiram a esse sistema de brancas.\nAqui eu enfrentei mais um dilema:Pensei que meu dragão estivesse muito manjado,e não sabia se jogava \na6,e6 ou Cc6 pra fugir da rotina.Não resistí à tentação.",
        "6. Be3 Bg7 7. f3 O-O 8. Qd2 Nc6 9. O-O-O Bd7": "Aqui eu costumo jogar 9...d5! vide a partida contra Carlos Alberto em postagem anterior.Não o fiz por causa \nde uma sequenciazinha chata que tarcísio joga e que eu tive preguiça de estudar com 10-Cxc6,seguido de  e e5.Deixa \npra próxima...",
        "10. g4 Qa5 11. h4": "h4:Nosso último encontro anterior a essa partida foi numa copa Serrana de 21 minutos.respondi \ncom 11...h5 e venci",
        "11... Rac8 12. Kb1 Ne5 13. h5 Rxc3": "Já sou doido;o cabelo ajuda...",
        "14. Qxc3 Qxc3 15. bxc3 Nxf3": "Por essa ele não esperava.Interessate é que eu joguei isso com esevandro numa copa serrana \nque tarcísio não estava presente.Josielton,ao final da partida,fez um comentário engraçado sobre \nos dois únicos peões brancos que sobraram,e que estavam dobrados em c2 e c3.\n",
        "16. hxg6 hxg6 17. Nxf3 Bxg4 18. Bg2 Nxe4 19. Rd3 Nxc3+ 20. Rxc3": "Tudo igual aqui.A única maneira de as brancas conseguirem vantagem é preservando a qualidade;\nmas a sombra que esse cavalo tava fazendo aí era de fazer medo mesmo.\n",
        "20... Bxc3 21. Bxa7 e5": "Aqui,o GM inglês Christopher Ward que na época tinha um Elo de 2490 jogou 21...b6 \ne empatou em 54 lances com o Gm chinês Wang Zili,de 2530,no ENG-CHN,disputado em londres,no ano de 1997.\n",
        "22. Ng5 Ra8 23. Bb6 Ra4 24. Bd8 Rb4+ 25. Kc1 Bb2+ 26. Kd2 Rd4+ 27. Ke3 Bh5": "Bh5? eu estou louco para jogar f5,e podia fazer isso.aqui o fritz dá um = de (0.12) \nO lance do texto me dá um certo conforto psicológico,mas o fritz diz que é um erro grave,\nque dá uma vantagem de (1.09) pras brancas.Nesse ponto minha cabeça já estava quente.",
        "28. Bf6": "Bf6?!-Aqui ele trava tenta literalmente cercar o meu rei;eu fiquei tão preocupado que não vi que Tf4,\nsegundo o fritz,iguala pra = (0.06)",
        "28... Bc3": "(0.91) de vantagem pras brancas",
        "29. Ne4 Ba5 30. Bf3": "vantagem de (-0.78) pras pretas.",
        "30... Bb6": "as pretas viraram o jogo e agora tem (-1.37)",
        "31. Ke2": "Há males que vem pra bem.Se não fosse o erro do Bh5 eu não teria ganho agora\n\\o/  \\o/  \\0/  \\0/ \\o/ \\o/ \\o/ \\o/ \\o/ \\o/ \\o/ \\o/ \\o/ \\o/ \\o/ \\o/ \\o/ \\o/ \\o/ \\o/ \\o/ \\o/ \\o/ \\o/ \\o/ \\o/ \\o/\n\n/ \\  /\\   ||   / \\ / \\ /\\  / \\ /\\  / \\ / \\  /\\ / \\ /\\  / \\ / \\ / \\  / \\ / \\ /\\ / \\ / \\ / \\ / \\ /\\   /\\  /\\  /\\\n",
        "31... Rxe4+": "Brancas abandonam e mais uma vez a teoria do karpov se confirma,quando ele diz que no xadrez vence \nquem comete o penúltimo erro,já que o único geralmente é decisivo.\nWelington ,que circundava a mesa e assistia à partida,havia pensado que Tarcísio\n havia ganho até o momento dos cumprimentos.Torrezani,que também assistia perguntava quem havia ganho.\nDepois desse jogo,Todos Pensavam que o torneio havia sido decidido ali."
    },
    "url": "https://gameknot.com/annotation.pl/chess-game?gm=35370",
    "gameName": "Chess game",
    "players": "???  vs. ??? ",
    "opening": "Sicilian (B76), dragon, Yugoslav attack, Rauser variation"
}