{
    "moves": {
        "1. e4 e5": "Most of my chess playing was done in my younger years. I started playing with my dad at a very young age and played my first rated tournament when I was about 12. I peaked my senior year in high school, and then started to lose interest until when I was in my early twenties I hardly played at all. A few years ago I started playing again, and found that my temperament has changed quite a bit. I'm not sure I ever answered 1. e4 with e5 in my whole tournament career!",
        "2. Nf3 Nf6": "And I'm quite sure I never played this. It has become quite a staple for me recently, though.",
        "3. Nc3": "Surprisingly, I get this response quite often. It is the most passive of white's common responses, and nothing to be afraid of in my opinion.",
        "3... Bb4": "Of course, black can continue with ... Nc6 which leads to a four knight's, but this response is more aggressive as well as more keeping with the spirit of the Petroff's.",
        "4. d3": "Very passive, although surprisingly I also see this quite often as well. Better alternatives are Nxe5 or Bc4",
        "4... d5 5. exd5 Nxd5 6. Bd2 Nxc3 7. bxc3 Bd6": "Black is already at least equal.",
        "8. Rb1 Nc6 9. Be2 O-O 10. O-O b6 11. Re1 Be6": "Bb7 was probably better, but I couldn't resist the opportunity to hit white's a pawn.",
        "12. a4 h6": "To prevent Ng5",
        "13. h3": "As opposed to black's last pawn push, this one simply wastes time and is weakening.",
        "13... f5 14. Nh2": "It is already difficult to suggest moves for white. This ugly move may actually be white's best bet.",
        "14... Qf6 15. c4": "A terrible move. Of course, an immediate Bf3 would have been much better.",
        "15... Rae8 16. Bf3 Ne7 17. Qc1": "Bc3 looks better to me.",
        "17... e4": "Mixing it up right away. I suppose I could have played an immediate g5 but I was still worried about Bc3",
        "18. Bd1": "This doesn't work out very well. On 18. dxe4 fxe4 19. Rxe4 I had planned ... Bxh3, but I think even this is better for white than what actually happened",
        "18... g5 19. Bh5": "Forcing me to play what I intended to play anyway.",
        "19... Ng6 20. Bxg6": "White didn't have to play this immediately.",
        "20... Qxg6 21. f4": "White is desperate for some freedom, but this just opens things up for black",
        "21... gxf4 22. Bxf4 Kh7 23. Kh1": "The final blunder. Re2 would have held for a while.",
        "23... Rfg8 24. Re2 exd3 25. cxd3 Bd5": "Exclam! White missed this move when he played Kh1",
        "26. cxd5 Rxe2 27. g3 Bxf4 28. Qxf4 Qxg3 29. Qxf5+ Rg6 30. Qd7+ Rg7 31. Qf5+ Qg6 32. Qxg6+ Rxg6": "And black managed to win the endgame :-)"
    },
    "url": "https://gameknot.com/annotation.pl/chess-game?gm=43072",
    "gameName": "Chess game",
    "players": "N. N.  vs. fkohn ",
    "opening": "Petrov three knights game (C42)"
}