{
    "moves": {
        "1. e4 c5 2. Nc3": "I opt for the closed Sicilian, as I believed my opponent will outplay me in the more popular lines of the open Sicilian. I wanted to avoid too much theory.",
        "2... Nc6": "the most natural response.",
        "3. f4": "The Grand Prix Attack. This line has relatively simple ideas, and offers good attacking chances for White, which is the reason why I went that route.",
        "3... g6": "also natural, preparing to fianchetto the DSB. With white unable to play c4, this move becomes stronger.",
        "4. Nf3": "developing the knight behind the advanced f pawn.",
        "4... Bg7 5. Bb5": "threatening to capture the knight and double black's pawns.",
        "5... Nd4": "avoiding the attack and centralizing the knight.",
        "6. O-O": "capturing the knight is inferior, because then black can get two tempi with 6...cxd4 and 7...Qb6, with 8...d5 soon to follow.",
        "6... a6": "To be honest, I was afraid of Nxb6 more, in which case I would lose my bishop pair. This is a better move for me.",
        "7. Bd3": "bishop has served his purpose and now retreats to a more active square.",
        "7... d6 8. Nxd4": "to get rid of the well placed knight",
        "8... cxd4": "To my surprise, Black doubles his pawns, instead of taking with the bishop. Black does gain a tempo though with this move.",
        "9. Ne2 Nf6": "black catches on in development.",
        "10. c3": "this is the main move. It actually took me some time to figure out why Nxe5 is bad. The answer is that this happens because of 10..Qb6, pinning the knight to the king and eventually attacking him with pawn pushes.",
        "10... dxc3 11. dxc3": "now I get a semi-open d file. I also have more space on the kingside. Black has a nice centre on the other hand and my king can be attacked by the queen or the DSB. Black needs to castle now.",
        "11... O-O 12. Kh1": "making my king a little bit safer.",
        "12... b6": "preparing to fianchetto the LSB as well.",
        "13. Nd4": "centralizing the knight",
        "13... Bb7": "attacking the e pawn as well.",
        "14. Qe2": "developing the queen, protecting the e pawn and putting pressure on the a6 pawn.",
        "14... Nd7": "opening up the DSB, the f pawn and maybe thinking of jumping to the c5 square.",
        "15. Nb3": "preventing the black knight from landing on c5 and harassing my LSB.",
        "15... Qc7": "There are many ideas with this move. Qc6 establishes a battery aiming at the white king. A battery with the rook on the c file is also possible, as well as trying to trade knights without altering the pawn structure.",
        "16. Be3": "developing the DSB,  connecting the rooks and putting more pressure on the c5 square. Both armies are developed now.",
        "16... f5": "black strikes first! my move is almost forced.",
        "17. exf5 gxf5": "This move weakens the black king's defenses, and thus I believe I am already better.",
        "18. a4": "discouraging b5.",
        "18... e5": "Black strikes at the center as well!",
        "19. fxe5 dxe5 20. Bxf5": "after all these, Black has a passed pawn, but it is isolated and not easy to be pushed, at least for now. My bishops are very active as well being a pawn up.",
        "20... Nf6 21. Rad1": "claiming the open d file",
        "21... Bd5": "?? This move attacks my knight, but it falls to a tactical shot which I immediately spot.",
        "22. Rxd5": "!",
        "22... Nxd5 23. Be6+ Kh8 24. Bxd5": "Gaining two minor pieces for the rook, very advantageous under almost any position.",
        "24... Rxf1+": "Black gains a small initiative, which does not improve his position.",
        "25. Qxf1 Rf8 26. Qxa6": "Gaining one more pawn. Pawn grabbing felt dangerous, but I eventually decided to go for it, under the premise that my pieces can protect the king if they coordinate in the next few moves.",
        "26... Qd7 27. Qc4": "defending the bishop, indirectly preventing the black queen from infiltrating and protecting the a pawn.",
        "27... Qf5": "threatening to infiltrate. Note that my DSB prevents mate.",
        "28. Nd2": "bringing the knight back to where the action happens. Also defends the vital f1 square.",
        "28... Qc2": "black queen finally manages to infiltrate",
        "29. Nf3": "blocking the rook from doing anything.",
        "29... Qxb2": "black gains back one pawn.",
        "30. h3": "I don't see any immediate move, so I decide to create some luft for my king.",
        "30... Rd8": "Probably intending to discourage me from moving my LSB. Note that after all these moves, black's passed e pawn only serves to prevent the black DSB from entering the battle.",
        "31. Ng5": "Threatening Nf7+ winning the rook.",
        "31... Qb1+ 32. Kh2 Rf8": "Intending to infiltrate with the rook as well.",
        "33. Bf3": "...and I object to that!",
        "33... Qg6": "A move that only makes queen a target.",
        "34. Be4": "now this pawn is totally blocked (and so is the black bishop)",
        "34... Qh5 35. Ne6": "double attack on the rook and the bishop.",
        "35... Re8 36. Nxg7 Kxg7 37. Qc7+ Kh8 38. Qxb6": "And here black resigns. There is no good way to attack my king and my passed a pawn will give me victory."
    },
    "url": "https://gameknot.com/annotation.pl/chess-game?gm=68072",
    "gameName": "Chess game",
    "players": "Aeraaa (1811) vs. NN (2106)",
    "opening": "Sicilian (B23), Grand Prix attack, Schofman variation"
}