{
    "moves": {
        "1. d4": "So, we start off with a standard game.  Note: we do play one last game, but I will not annotate it since it was with Random Fischer Control, so the position, ironically is different.  But, the former member like's a lot of openings.  One thing he was known to do was give a lesson with a few QPO's games.  I think that one of them leads to the Owen's defense.  But, he will not play that, however, since he wants me to stick to basics.  Even though he does not tell you directly, it's implied, as we'll see with his next move.",
        "1... d5": "Now that said Owen's Defense would've been a little different, but I bet that had I played it, I might disagree.  That's because, against a stronger player, as WB also emphasized, sticking with the basics is better, as noted earlier.  So, this is my response.",
        "2. c4": "The QG, of course.  Now, like I said in isaiah11's annotations, I have better luck declining the gambit, which I am going to do.",
        "2... c6 3. Nf3": "Standard.",
        "3... Nf6": "Also standard.",
        "4. Nc3": "Normally, it would make sense behind this move for development.  But, in reality, I don't know why he played, only because he and cplusplus11 told me in a previous annotation that in the QP's games, one should not develop the C N.  However, I also know that not every single needs or should be followed because they contradict one another and cause confusion.  It's about development, controlling the center and K safety.  So, last Friday, I spoke to Jack Stockel on if I should 4.Nc3 with that unfamilar principle and told him about it.  He said that it is not a bad move and that playing that is a good idea for the same reason I thought.  Ironically, I won that game, later on. ",
        "4... Bg4": "Meanwhile, because I am not used to that website, I do different things.  First, development, but I waste no time in putting pressure against the N.  Since I have spoken to about this by previous commentators, I wouldn't have played this, but as noted, where this game was played involves the only website where I am not a serious.  Consequently, I don't play anymore on that site.",
        "5. Ne5": "At first, I wasn't sure why he played this and viewed it as pointless.  However, for the reasons outlined earlier, I didn't even look at or consider threats made by opponent, which in general, is a big mistake.",
        "5... g6": "My goal is two things.  First, development since I fianchetto to get my DSB into play.  And, since my e pawn has not moved, yet, it does not waste time.  Second, it's to exchange because, I stick to this after what Jack taught me, but when you are up against a stronger player and things are even, it's better to exchange early and often.  Now, when GAC was here he said that my assessment was right in a PM.  In fact, in the message he told me that the reason I almost lasted 40 moves against him in our last game on this website was the fact that I exchanged early and often.  Even better is the fact that I don't end up with doubled pawns, after the exchange.",
        "6. Nxg4 Nxg4 7. e4": "At first, I only thought that his goal was to develop.  But, this is where I start to go wrong, and my concentration is quickly fading away.  If I had looked more carefully, I would've seen that my N is en-prise through a discover attack.  Note: I am also trying to accommodate him, as well since he wants me to move quicker.  Now, unlike a lot of people, I never felt like he was trying to rush because of the way he said which wasn't something like, hurry up or else.  But, just asked if I could keep moving and I didn't mind.  In part because when I rushed on GK, as a mentor told me, I was, occasionally, moving even quicker then I did in my games against him.  That changed when I was told to slow down and give more concentration.  But, I was not going to do so, on the website that we were playing, in part, because you could not drag the pieces like you can here.",
        "7... dxe4": "?? This is the first blunder.  Now, if had I seen the threat, I would've responded with 7...Nf6, but in this case, I got greedy as I figured that I had won a pawn.",
        "8. Qxg4 Bg7": "Now, I decide to go back to development.",
        "9. Qxe4": "This leads to an interesting exchange.  And, since it's pawns, as opposed to pieces, it's of no real asset to liquidate.  At first, however, I thought I had lost a pawn.",
        "9... Bxd4": "But, I found the significance of this move as my Q protects the B.",
        "10. Bg5": "At first, I did not know why he played this, but there is a tactial motif.  If 11.Bxe7, 11...Qxe7, 12.Qxe7+, Kxe7  However, that would be prevent me from castling and would, potentially, expose my K, which is what he wants.    ",
        "10... O-O": "But, I won't allow it.",
        "11. O-O-O": "I don't know why he castled on opposite on opposite wings.  Instead, I would've played 11.Bd3 with idea of castling short on the next move, so 12.0-0  So, there has to be a reason why castling long is better then castling short.  But, I don't know what the reason is.  However, it's still worth annotating because it is important to try and figure out why as that is part of theory.",
        "11... Re8": "?? Meanwhile, I decide to put pressure on the center.  They say that one to control to center is to attack it.  However, this is another blunder because of what he does, next.  ",
        "12. c5": "Now, I must lose a piece.  That's because, if I move my B, I lose the Q, so this situation is starting to turn up bad.  Once again, I did not think hard enough before playing 11...Re8 for the same reason.",
        "12... Nd7": "Knowing this, however, I do not waste time in completing development.",
        "13. Qxd4 Qc7": "Now, I am trying to prevent the liquidation of another piece since I am, for someone this strong, far behind.  However, it is too little, too late because of his next move.",
        "14. Qxd7 Qxd7": "?? An outright blunder.  The worst one in the entire.  Once again, a miscalculation, as I thought that I had won something back, and therefore, did not have to liquidate.  But, what I overlooked was his R on d1.  And, with it, I now lose my Q.  Normally, I would resign after his next move, but I felt it'd be better to wait, especially against, perhaps, the best player in the world.  That's because the longer you hang around, the more you learn.  GAC agreed as he implied while on GK, before getting booted, that while we were playing I was making the right choice by not resigning.  Instead, it was better to let him mate me.  The idea is the same as to why you don't resign in the Supplemental Talking the Talk game. ",
        "15. Rxd7 b6": "? So, getting more desperate, I do what I can to stay in, and at the very slightest chance which is, in reality 0, is to get counterplay.",
        "16. Bxe7": "Therefore, we exchange pawns.",
        "16... bxc5 17. Bc4": "Developing his final piece.  However, it's more then just that, as he is threatening mate.  I know because this is very similar to a double bishop mate where it's just both bishops and K against the K.  So, I have to be very careful.  I will only one make more attempt, before all is said and done.  In other words, resignation is soon to come.",
        "17... h5": "The idea is more then just a set of pawn chains.  Should he check, I can get out with, say, 19.Kh7  There is a mistake here, however, as that would lose a R.  But, I am trying to prepare for the worst.",
        "18. Bf6": "Until, he plays this.  I now know that mate is soon to come with no way out of.  It might not be around, but he is going to mate sooner or later.  In addition, he wants to get started right away on our last game against each other, involving the Random Fischer Controls.  So, we both agreed that I would resign, at this point.  Now, normally, I would not have taken the time to annotate a game like this, but first, it's a background history between geniusacamel and me which is another reason that I was so patient with him.  Second, I pm'd archduke_piccolo over what a good job he was doing.  I also told him that since I am done with GAC, I was, for a while, looking for a replacement to help me improve the way geniusacamel did.  Now, ION is ideal because the way he teaches is very similar to the way that GAC taught the game, and he is very friendly with opposite personality as GAC.  For example, I studied a lot of ION's variations in a recent annotation, and doing that enabled me to create a chess puzzle, as of last night.  Not to mention that he is and was my first friend on this website who's helped me improve and is also a reason that I coach and mentor.  Plus, he gave me some good advice to annotate more games.  At the time, GAC gave the same advice by asking me to annotate his games.  Finally, as GAC once called it, this is, \"public education\".  The idea being is that I'm up against, presumably, the world's best player.  That's why he did not lose a single game, until the boot.  So, it involves a lot of theory.  And, as noted from previous annotations knowing a lot of theory is a good way to learn, develop, and become a better player."
    },
    "url": "https://gameknot.com/annotation.pl/chess-game?gm=58860",
    "gameName": "Chess Game",
    "players": "GM geniusacamel  vs. jkarp ",
    "opening": "QGD Slav (D15), 4.Nc3"
}