{
    "moves": {
        "1. e4 g6": "dont usually play against this opening very often, continued with a plan for a strong centre ",
        "2. d4 Bg7 3. Nf3 d6": "in an effort to play e5 to start undermining the central pawns",
        "4. Nc3 Nf6": "i thought this was weak because it allows e4 which removes the knight and blocks the bishop in",
        "5. e5 dxe5 6. Nxe5": "this move secures blacks knight in place and it cannot be attacked, this move allows me to build a very rapid attack as black needs to both attack this piece and defend his own",
        "6... O-O 7. Bc4": "continuing the attack in particular f7 which has now become another worry for black, im now considering queen f3 which agains threatens f7, black needs to defend fast and correctly",
        "7... e6": "not a bad move but it leaves black a little undeveloped and traps a good defensive piece, the bishop on c8!",
        "8. Bg5": "now anchoring that knight in place adding to the threats",
        "8... Nbd7": "i kind of blew my advantage here and the computer agreed",
        "9. Nxd7": "the computer said\n\n(+0.54) ALTERNATIVE - You slipped from a better position to an equal one. You should have played 9. O-O\n\ni now agree because if he took on e5 i would be attacking a pinned piece in a weak defensive structure",
        "9... Qxd7 10. O-O b6": "finally trying to get the bishop out",
        "11. Qf3": "queen f3 now threatening bxf6, it also stop the development of the bishop and he is forced to defend or move his rook",
        "11... c6": "blunder! traps the bishop, fails to defend the threat ,need i say more",
        "12. Bxf6 Bb7": "threatens my queen, and finally gets the bishop to a square where it can maybe develop by using a mild tempo of c5. but its a little too late im the exchange up and im going to take my advantage right into the end of the midgame",
        "13. Bxg7": "just trading down",
        "13... Kxg7 14. Rad1": "supporting my advanced pawn",
        "14... b5": "attacking the bishop on the queen side his pieces arent well developed enough to support these attacks and i simply neutralise the threats",
        "15. Bb3 a5 16. a4": "a4 and he resigned, the position is pretty much neutralised now. the attack on the queenside didnt deter my attacking initiative and the piece advantage would have secured me an easy win.\n\nContinuation:\nb4, Ne5, C5, D5, exD5...."
    },
    "url": "https://gameknot.com/annotation.pl/chess-game?gm=24088",
    "gameName": "Chess game",
    "players": "???  vs. ??? ",
    "opening": "Robatsch defence (A41), Rossolimo variation"
}