{
    "moves": {
        "1. e3": "I am not crazy about this opening.  As I noted, when I was in the KOH club and testing different openings to see what would happen, which is ill advised at where I stand, someone told me that this was not a good idea.  I was, of course, thinking in terms of the French Defense but in reverse since that starts off with 1.e4 e6.  That's when shamash said that white shouldn't play as black, and black shouldn't play as white.  ION, however, that this move is ok, but what I don't like is that it will comprise the mobility of whites Bc1, unless he fianchetto's it.",
        "1... e5": "Having said that, this is how I would've responded.  But, I would've done it just to inconvenience white and put him into unfamiliar territory.  ",
        "2. c3": "I don't know why white played this or see the point.  It would only make sense to me after the Spanish or Italian Opening, if black then played 3...Bc5.  But, by my books, it's the cornerstone of where he pushes pawn.  Instead, I would've developed with 2.Bc4 with the idea of 3.e4 and then 4.Nf3 which enables white to castle shortly afterward.",
        "2... d5": "I would've developed with 2...Nf6, but I like this move just as well since it opens up a line for Charles Bc1, as well as, claim a stake in the center.  ",
        "3. e4": "I don't like this move too much because of what Charles plays next.",
        "3... dxe4 4. Qa4+": "?! Having said that, I would not be troubled with this check.  Instead, I would respond with 4...Bd7 as after white retreats, I'd then answer with 5...Nf6  But, I like Charles next move just as well since he's continuing with his development, whereas white's Q will be prone to harrassment since he developed this before his other pieces.  In return, that will give black a space advantage.  As far as, I'm concerned, this is where white starts to go wrong, even though, it's not a losing move.",
        "4... Nc6 5. Qxe4": "?! Preventing the loss of a pawn.  But, white got greedy and will pay with Charles next move since this puts him further behind in development.  Better for white was to continue with his development and pin with 5.Bb5 attacking Charles Nc6 twice and threatening to win a pawn.  elyhim won material in our second training session during reversion's open fire.  I was in unfamiliar territory, and he was able to attack a piece twice, whereas, I only had it defended once.  From that point on, I went down a piece, and my position became resignable soon after.  Of course, Charles would defend again with 5...Bd7 after which, white can stop what's coming with 6.b4, and then, it would be safe to grab with this move.  Having said that, 5.b4 or 5.h3 were also worth considering, but I would've pinned in an attempt to catch up in development.  Thus, Charles space advantage is increasing since he's about to further harass white's Q by continuing with development.  And, that will enable black to target critical square, f7, with 6...Bc5 which is part of the, \"overall picture\", as bhidragon put it in my game against him. ",
        "5... Nf6 6. Qc2 Bc5 7. Ne2": "? White suddenly becomes interested in development, but I consider this to be a mistake.  Although he's not lost, white's in worse shape.  Timing was important as 7.h3 was essential here to stop what black's about to do.  As now, white will have to lose, at least, a pawn to prevent mate.",
        "7... Ng4 8. h3": "?? Having said that, this loses right away.  As noted above, this would've been ideal a move earlier, but it's a blunder now.  8.d4 was critical, and after that, black has 8...exd4 and after 9.cxd4 Bxd4 10.Nxd4 Nxd4 and black has also liquidated.  But, with this move, it's now mate in 2, and this is where the chess puzzle began.  In other words, this blunder, led to this moment, and I saw something just like this in a training game between penelope80 and her student, duke69.  And, without Charles notation, this annotation would not have been possible, so I'd like to thank him for showing this game.",
        "8... Bxf2+ 9. Kd1 Ne3#": ""
    },
    "url": "https://gameknot.com/annotation.pl/chess-game?gm=66819",
    "gameName": "Chess Game",
    "players": "???  vs. charleshiggie ",
    "opening": "Amsterdam attack (A00)"
}