{
    "moves": {
        "1. d4 d5 2. c4": "The upcoming battle will revolve on the liability white takes on c4.",
        "2... dxc4 3. e3": "White immediately aims to recapture.",
        "3... Nf6 4. Nc3": "White foregoes the recapture, and the choice might be permanent.",
        "4... Be6": "Black's grip on c4 is strong.  White has spent many pawn moves strengthening the dark squares, so he cannot easily trade away his light square bishop with 5.Bxc4 Bxc4 6.Qa4+ recapturing with check.",
        "5. Qa4+": "Fritz believes that Nf3 is worth a look.  It at least creates some central pressure that black cannot immediately neutralize.  Also worth a look is g3 pressuring the a7-g2 diagonal.  For example, 5.g3 Bd5?! 6.Nxd5 Qxd5 7.Nf3, and white has an easy plan for completing his kingside development.",
        "5... Qd7": "Now white is not so much in trouble, but has to be careful when the potential of his position can begin to be overshadowed by black activity.",
        "6. Qb4": "I think that the queen exchange may have been called for, but such an early exchange calls into question either Qa4 or allowing the c pawn to fall.",
        "6... Qc6 7. b3": "White offers black bait which will allow Bb5 pinning the black queen to the king.",
        "7... Na6": "White will now have to move the Queen a third time in the opening.  Black's position is improving while white's position stalls.  Black is better.",
        "8. Qa3 O-O-O": "And suddenly the bait pawn is fair game and proves pivotal for black.",
        "9. Nf3": "Perhaps too late.  Ne5 can exert some influence, but can it compensate for the tempi that black gains?",
        "9... cxb3": "What does white have for the two pawns?  Owing to Be6, Qxb3 is inelligible.  10.axb3 drops the knight.  Not even 10 moves in and black has gone from better to clearly winning.",
        "10. Bd2 bxa2": "White is trying to avoid losing more time by delaying moving the bishop on f1, but the delay is keeping his king in the center of the board.",
        "11. Nxa2 Ne4": "Black feels no need to exchange and chooses an active position.",
        "12. Nb4": "The move forces a trade, but how strong the idea is is debatable.",
        "12... Nxb4 13. Qxa7": "My first thought was Bxb4 pressuring e7 and buying white time.  The white idea seems to be 14.Qa8+ Kd7 15.Ne5+ Ke8 16.Qxd8+ Kxd8 17.Nxc6+ cxc6, but white misses black's next move.",
        "13... Nc2+": "Suddenly white seems to have dropped two pieces without sufficient compensation.",
        "14. Ke2": "It seems like there ought to be a forced mate here, but after having Fritz double check, there is not one.",
        "14... Nxa1": "White is now down a queen.",
        "15. Qa8+ Kd7 16. Ne5+ Ke8 17. Nxc6": "Qxd8+ gives more while still leaving white with the worse game.",
        "17... Rxa8 18. Ne5": "White resigns."
    },
    "url": "https://gameknot.com/annotation.pl/chesscube-game-www-chesscube-com?gm=34472",
    "gameName": "ChessCube Game, www.chesscube.com",
    "players": "medstudent@chesscube.com (1727) vs. nikolaseric@chesscube.com (1723)",
    "opening": "Queen's gambit accepted (D20)"
}