{
    "moves": {
        "1. e4 c5 2. Nf3 Nc6 3. d4 cxd4 4. Nxd4 Nf6 5. Nc3 d6": "So far a very standard opening - the Open Sicilian",
        "6. h3": "But this move is very unusual, and for good reason. In an open position like this, white can't afford to waste moves like this.",
        "6... e5": "So I strike out in the centre. My d pawn is backward on a semi-open file, and can potentially be attacked by his rooks and queen along the d semi-open d file. But in return black gains a measure of central control.",
        "7. Nde2": "I don't think this is the best square to put the knight.",
        "7... Be7": "So I carry on with my development",
        "8. Ng3": "So this is his plan. The e pawn is protected by his Ng3 so he can play Nc3-d5 and he can also play Bc1-e3 without fear of me playing Nf6-g4 in reply. The downside is that he has wasted so many moves with his knight now at g3. Black is ahead in development.",
        "8... O-O": "So I continue to develop",
        "9. Bc4": "He takes control of the d5 square.",
        "9... a6": "So I prepare to hit his bishop",
        "10. a3": "He prepares a retreat square",
        "10... b5": "I ht the bishop",
        "11. Ba2": "He retreats",
        "11... Be6": "I contest the a2-g8 diagonal",
        "12. Nd5": "He throws the knight in. Now I have to be careful. I want to play Nc6-a5-c4, but Na5 immediately loses to Be6-b6, which is one reason for my next move, to cover the b6 square again",
        "12... Rc8 13. Be3": "Now I have to be careful. I want to play Nc6-a5-c4, but Na5 immediately loses to Be6-b6, which is one reason for my next move, to cover the b6 square again",
        "13... Nd7 14. c3 Na5 15. O-O Nc4 16. Qe2": "Now he can't recapture on d5 with a piece, so I can exchange on d5 and my weakness on d6 is shielded by a pawn on d5.",
        "16... Bxd5": "So I take",
        "17. exd5": "He takes back",
        "17... f5": "And this is another benefit of exchanging on d5, my f5 pawn is free to advance, and I am threatening f5-f4",
        "18. f4": "He blocks that move. Now after the game I was thinking I should play 18....g7-g5 immediately. What do you think dear reader?",
        "18... Bh4": "This is the move I actually played, which is also very strong",
        "19. Nh1": "This is a dreadful square for that wandering knight!",
        "19... g5": "So I continue",
        "20. fxe5": "He takes",
        "20... Nxe3": "I take",
        "21. Qxe3": "He takes back",
        "21... f4": "I hit the queen again",
        "22. Qd4": "His queen has to move",
        "22... dxe5": "I hit the queen again",
        "23. Qe4": "Queen moves",
        "23... Qb6+": "I throw in a check",
        "24. Nf2": "Knight blocks",
        "24... Rce8": "And now I am all ready to hit his queen with my knight and start my pawns rolling",
        "25. Qe2": "But he moves his queen first",
        "25... e4": "So I just advance",
        "26. Kh1": "He breaks the pin on his knight",
        "26... f3": "I advance again. If he takes on f3, I take back with the pawn and the knight on f2 is dropping, for instance, if he then plays Qe2-d2 or Qe2-c2 I have Re8-e2. He has to keep his queen protecting f2, and Qd2 or Qe1 runs into e4-e3, so his only move is.....",
        "27. Qc2": "This... and now I open up his king a little",
        "27... fxg2+ 28. Kxg2 Qe3": "With a horrible threat of Qe3-g3 which drives his king back to h1, and then I can take his knight on f2, so he has only one defence to this",
        "29. Nh1": "The knight returns to this dreaful square",
        "29... Rf3": "With a threat to his h pawn. White is lost",
        "30. Rxf3": "He takes",
        "30... exf3+": "I take back",
        "31. Kf1": "King moves. Now at first I was going to play Qe2+ 32.\tQxe2\tfxe2+ 33.\tKg2\te1=Q\n34.\tRxe1\tRxe1 with an easily won ending, but then I stopped something even better...",
        "31... Qe1+": "White resigns, because if Rxe1, Rxe1 mate! Many thanks for reading, please rate this game on the star system and leave a comment or two, let me know how I going on..."
    },
    "url": "https://gameknot.com/annotation.pl/chester-e-v-malpas-wirral-league?gm=54053",
    "gameName": "Chester E v Malpas, Wirral league",
    "players": "Ray Williams (ECF142) vs. Charles Higgie (ECF166)",
    "opening": "Sicilian (B58), classical"
}