{
    "moves": {
        "1. d4 Nf6 2. c4 g6 3. Nc3 Bg7 4. Bf4 d6 5. e3 O-O": "He has a very strong grip on e5 which is a square that black intends for a pawn in the King's Indian Defense.\n",
        "6. Nf3 Nc6": "This idea was speculative. If white allows, black will get to transfer the knight to the kingside with tempo; last book move\r\n",
        "7. d5": "White bites. I think black's idea is unsound, but with near a 100 point difference between players (and in real strength there is a good chance that I have more than a 100 points on him because I have been rated as high as 1730 on that site), I thought it was a good time to try the idea.. White threatens to win material: d5xc6\n",
        "7... e5": "Black's idea is to allow white to open up the game as black does the same. Once attacking lanes open up, the white king will be exposed in the center; Black threatens to win material: e5xf4\r\n",
        "8. dxc6": "I actually think that accepting the black idea can be done, but it offers black quite a bit. Probably safer is allowing the flipside to black's idea to come alive, the quick transfer of the c6-N to e7.  (8. Bg5 seems to be the best option White has: 8...Nb8 9. Be2 +/=)\r\n",
        "8... exf4": "-+",
        "9. cxb7": "? (9. exf4 bxc6 10. Qd2 Re8+ 11. Be2 -+)",
        "9... Bxb7 10. Qb3": "White protects the e pawn with the threat against the bishop.\r\n(10. Qd2 fxe3 11. fxe3 Ng4 -+)\r\n",
        "10... Bxf3": "I normally prefer retaining both bishops, but the prospect of defending the bishop seemed a real liability. Also white cannot hope to control the b file with the queen, and castling kingside seems out of the question for white.  (Fritz says: 10... Rb8 ends the debate with 11. Qa3 Re8 -+)\r\n",
        "11. gxf3": "This position allows white room to go wrong even though he seems fine.\n",
        "11... Re8": "This move is probably a mistake as it prevents white from exf4, but the exf4 idea has some bite if white can manage f5 while keeping his king safe. It's a fair amount of caveats, but interesting enough to be worth a try once.  (11... fxe3 12. fxe3 Qe7 13. Kd2 -+)",
        "12. e4": "-/+ Or not.\r\n",
        "12... c6": "Black attempts to control d5, and makes the move that it also seems to control another candidate square for the white knight.\n",
        "13. O-O-O": "I suppose I should have anticipated this as it makes it easier for white to control his rooks. I do not think this is good or bad. It is good as far as the black plan is disrupted, but it may be bad, as the new black plan can come rather quickly.\n",
        "13... Rb8": "There are really two candidate moves that I considered, and I played them both. I am not certain about the prefered order, or if order even matters here. \n",
        "14. Qc2 Re5": "This move really accomplishes two things. It allows the quick transfer of the rook to the queenside, and it keeps the center closed.\n",
        "15. b3": "He is shoring up defenses, but the move creates the possibility of a tactic.  (15. h4 Rh5 -/+)",
        "15... Qc7": "The queen eventually wants to go to a5, but the rook needs to transfer there too. All of this might come to nothing if black cannot deal with the white knight.  (15... Rh5 16. Na4 -+)\r\n",
        "16. Qd2": "The white idea is the dual threat against d6 and f4. When white captures on f4, the queen still pressures d6. If white can lift his rook, he may be able to open the center.\n",
        "16... Ne8": "The problem with white's plan is black is able to mount a defense of the square with Ne8 and Be5.\n",
        "17. Qxf4": "Of course, the idea that black really wants to play are the tactics that follow.  (17. h4 Rh5 18. Bg2-/+)\r\n",
        "17... Ra5": "Black is pressuring the a2 pawn. -+",
        "18. Kc2": "?? White avoids the pin on c3 that Kb2 creates, but this move is inadequate. White probably assumes as usually is the case that a player who spends extra moves fianchettoing a bishop will not lightly exchange that bishop.  Fritz says, \"White has lost his nerve... understandable when you consider his position.\" (18. Qe3 Bxc3 19. Qxc3 Rxa2 20. Bd3 -+)\r\n",
        "18... Bxc3": "If his assumption is that black will not lightly exchange the bishop, then unfortunately he is right. The a2 pawn is lost. The b3 pawn has become rather weak. The queen will get to move to a5. White faces some tough puzzles to solve, and his position seems to be worsening.",
        "19. Kxc3 Rxa2 20. Bh3": "If not for Qa5 Bd3 would be best.\n",
        "20... Qa5+": "White resigns because there are many forced mates:  \r\n\r\na1: 21. b4 Qxb4+ 22. Kd3 Qb3+ 23. Kd4 c5+ 24. Kd5 Qb7#\r\na2: 21.Kd3 Rxb3+ 22.Kd4 Qc5#\r\na3: 21.Kd4 Qc5+ 22.Kc3 Rxb3+!  23.Kxb3 Qa3#\r\n\r\n"
    },
    "url": "https://gameknot.com/annotation.pl/chesscube-game-www-chesscube-com-http-gameknot-com?gm=34478",
    "gameName": "ChessCube Game, www.chesscube.com, http://gameknot.com/",
    "players": "khamini@chesscube.com (1480) vs. jdkuyken@chesscube.com (1564)",
    "opening": "King's Indian (E61), Smyslov system"
}