{
    "moves": {
        "1. e4 c5": "In the game that I could not find, JP was black, and like here, it involved the Sicilian Defense.  And, her opponent played the Open Variation, just like what we're going to see.",
        "2. Nf3 d6 3. d4 cxd4 4. Nxd4 Nf6 5. Nc3 a6 6. Be3": "I would've played 6.Bd3 in order to castle on the next move.  But, if a GM plays something else, then he or she has kept castling in mind, but this is better.  The question is why?  I think that without a pawn in between, it puts pressure on black's center.",
        "6... e6": "To develop and open up lines for his DSB.  However, I would've preferred 6...e5, so that black would gain time needed to continue development, while white would be forced to protect.  In addition, this appears to create a bad bishop for Anand.  But, with 6...e5, however it appears stronger.  Now, under no grounds am I calling this a blunder or inaccuracy, as I don't know what's going in their minds, but I'm just giving my preference and how I would've responded.",
        "7. f3": "Acheiving a pawn chain, which as I recently learned from Susan, during that course, in the opening, one of the most important things about openings, in addition to, what we already know, are pawn chains.",
        "7... b5": "The main idea was turning one of his bad bishop into a strong one with fianchetto.  In addition, like with JP, it's about acheiving a pawn chain which, as noted, is essential during the opening.",
        "8. g4": "I would've played 8.Bd3, but I like this fianchetto a little more.  Actually, this is, somewhat similar to what I saw in that recent annotation with charleshiggie and brigadecommander.  The idea is that fianchettoing does, to an extent, add to that chain, which would be the logic for 8.g4, as opposed to, 8.g3  But, when that B comes out, it can become mean and nasty, just like what I saw in there.",
        "8... Nfd7": "I liked where it was before.  But I understand why Anand played this, though.  The idea is finding a better square for his N.  That is, on b6, which he will do, on his next move.",
        "9. Qd2": "The idea is so that white can castle Q side.  Personally, I don't see anything wrong with bringing the LSB into play, but I like this move better.  And, this time, I agree that castling long is better then castling short.  That's because of how open the K would become after 0-0, whereas, with 0-0-0, it is enclosed by the pawns, and thus, well protected.",
        "9... Nb6": "As noted, black finds a better outpost for his N.",
        "10. O-O-O Nb8d7": "Yes.  No good was 10...N8c6, due to white's N on d4.  In addition, even if it weren't for that problem, I still like the arrangement better as black will be able to bring onto c5 or e5.  Both of those squares appear stronger then on c6.",
        "11. Bd3": "But, white now plays the move that I noted earlier.  Not only are the R's connected but are bound to be dangerous.  While we have only gone through 11 moves and are in the early mid game, I'd say that this is, already, almost as interesting as the game between charleshiggie and brigadecommander which I really enjoyed, especially with 4 Q's.  While it won't happen here, the position has become a little different then unusual for both sides.  First, with GM games, I typically see them castle K side, though the other way is not unusual.  What makes it different, however, is that both of white's bishops are side to side which I don't often see in a game like this.  Second, normally, I would've already seen black place his d N on the other outpost.  But, he is not going to do it on the next move.  Most importantly, in all other games, even with GM, right after a fianchetto, I see the player develop his or her B right away, either on the longest diagnol (which I see most often) or on h6 or a6.  This, however, is the first game where I see someone prolong it for several moves.  And, the fact that we're in a, somewhat, unusual position at GM level between some of the best players adds value to the game, in my opinion.",
        "11... Bb7 12. Kb1": "Normally, I wouldn't understand this as we're not in an endgame which is when you'd use the K as a weapon.  But, it makes sense here as the K is safer.  The long term plan that black had was weakening her K with an eventual ...d5 followed by ...Bc5 and ...Qc7, putting pressure on white's K.  By playing this, Judit stops that, in her tracks.",
        "12... Rc8": "As we're about to see, this put's pressure on white's c N.",
        "13. Bg5": "As usual, you typically see a GM attack a piece against his or her opponent.  The idea, of course, is gaining tempo because with grandmaster, time is more important then your average chess game.",
        "13... Qc7": "And, when he or she attacks, the opponent often reattacks or puts extra pressure when retreating.",
        "14. Rhe1": "Attacking the center in another way.  But, personally, I would've played 14.Rc1 because like what I saw in a recent annotation, yes, I would be worried about my N on c3.  However, with further analysis, it wouldn't have helped since the R is behind the pawn, so I like this move for the reason outlined.",
        "14... Ne5": "Although it seems protected, from white's next move, we can infer that the idea behind this was to put pressure on the white pawn.  But, I would've played 14...Qxc3  Here's the thing, as it is what I was alluding to by pressure on the c N.  Before this move was played, which was the plan, black could not play 13...Rxc3 because it would lose a R for N, due to white's Q.  But, now, there's added protection so that risk exists because after 14...Qxc3, white dare not take back with 15.Qxc3??, or 15...Rxc3, 16.bxc3, not only losing a piece, but her K would become exposed.  And, this time, against one of the best players, white would lose.  However, I gather that the plan would not work because grandmasters do not just overlook moves like that, so something tells me that taking on c3 would be a blunder since Anand will not play that, in this game.",
        "15. f4": "But, with this move, now if black played 15...Qxc3, supposing that it wouldn't be a blunder, he doesn't win a piece back because of this, as white would, sooner or later, take back on e5.  It makes sense because Anand was intending to, when it was safe, take on c3.  So, this prevents him from doing so.",
        "15... Nec4": "With that being said, not only is the N safe, but black finds an even better square for it.  Now, I would've looked at 15...Nf3?? as it appears to win, at the least, a R for N with an ugly fork.  But, after analyzing it, I wouldn't play it because the N on d4 stops it so that if white dared played, white would win that N.  I also looked at 15...Ned7, where now, it would be crammed.  Most importantly, however, is that I remember that homework by charleshiggie in his annotation which, as usual, was and is good to do for improvement.  So, that if Janet took with the R, as opposed to N, she would've lost a pawn.  Well, a similar thing could be said because the plan behind this move is when the Q retreats, 16...b4  And, after 17.Ne2 (as other moves lose the N), comes 17...Na4, 18.b3, Nxc3 19.bxc3, bxc3 winning a pawn.   Therefore, I think this is the best, in this position.  ",
        "16. Qc1": "But, not suprisingly, white sees the threat and does not allow it.  The reason for this threat was if the Q moved from the dark squares from the Q side, where she castled.",
        "16... h6": "Putting pressure on her B and gaining time, in the process.",
        "17. Nd5": "Not surprisingly, as noted, she reattacks.",
        "17... Qc5": "I would've considered 17...exd5, but that would've gotten answered with the immediate 18.exd5+, which loses a R shortly after due to a skewer.  18...Kd7 (forced), 19.Bf5+  So, that is another example of where getting greedy would be problematic.  Therefore, despite considerating that, I definitely would not have taken, either.  But, I would not know what to do here.  However, it appears that Anand found the best way out of this, by reattacking the N, and gaining time, which he will need.",
        "18. Nb3": "While 18.Nf3? would seem good, the problem is that it runs right into 18...Qf2 which would lose a pawn with the fork.  And, 18.Ne2 would result in the same problem.  Anywherelse just loses the N, so while I don't like the way it looks as well since it appears to jam in the K structure this is, indirectly, forced.  ",
        "18... Qf2": "Nontheless, Anand still plays this.",
        "19. Ref1": "Hitting the Q, and black dare not take with 19...Qxh2, or he will lose his Q after 20.Rh1, Qg2 21.Rg1, Qf2 22.Bh4, as his Q would now be trapped.",
        "19... Qg2": "Indirectly forced, as anything else, would've lost the Q.  So, white now takes advantage by exchanging black's stronger N.  The reason that the N on c4's weaker is because it's, more or less, boxed by not only white's LSB, but her pieces on the first rank.",
        "20. Nxb6 Nxb6 21. Qe3": "But, that exchanges benefits white, and with it, while material is, technically even, I give white a slight edge because of this move, as now, black will have to figure how to protect his N, and he also can no longer complete development or castle.  In addition, his strong N is gone, leaving with his weak one.  However, white's pieces are better placed.  ",
        "21... Nc4": "In this position, I would've considered 21...Nd7 but that would cram it.  Plus, it's a weak N, so retreating to b7 would make it weaker.  Therefore, I believe that attempting to get rid of that N is the right choice.",
        "22. Qa7": "In my opinion, however, this is better.  Not for attacks or gain of tempo, but rather, this attack is a fork.  And, while black will take back, he has a pawn chain, whereas, she does not.  And, his is quite nasty.  This will weaken it so when an exchange occurs, her advantages will increase.  However, it gets much worse for black, as we're about to see.  And, with that, I now believe that the game is lost for black.  Even though it doesn't appear so, the position is deteriorating, much quicker then one would think.",
        "22... Bxe4 23. Qxa6 Rb8": "Having to protect the b pawn, which was her plan.",
        "24. Rfg1": "And, that's because of this.  So, with best play, assuming he finds it, white will, at the very least, win a piece, without compensation.",
        "24... hxg5": "?? Although GM's generally don't blunder things, I call this an exception.  Sure, black was going to lose something.  But, I believe that better was 24...Qf2, and best was 24...Qxh7, not only protecting the Q, but despite winning a piece 25.Bxe4, black has got a pawn, in return.  By playing this, however, he will lose his Q for a R.  And, right after that, white will add insult to injury by liquidating.  It is worth noting that black will only be down by 1 point, but considering that he's losing the Q, makes it irrelevant as Anand is already in big trouble.",
        "25. Rxg2 Bxg2 26. Bxc4 bxc4 27. Qa4+": "Seeing that black is going to lose another and his K will become exposed, lest, he loses a R, Anand resigns.  As noted, this game started to become very interesting by the 11th move.  And, the peak of it started on white's 24th move, making it the most interesting game I've studied, in about a month, since I studied two GM annotations by favorite annotator which both involved game with Carlson.  But, what we learned, like that of the private annotation is the importance of completing development and getting the K to safety.  Like then, Anand could've used the time to develop his remaining piece, and advance the d pawn one more square so that it wouldn't be his bad bishop.  And, he also could've protected his K.  If black had done this, I don't think that black would've gotten himself in trouble.  So, what this shows is that, even at GM levels and with, for that matter the best players, it's important to develop your pieces, control the center, and get the K to safety.  Failing to do so, could and often will get yourself into trouble, as we saw here.  "
    },
    "url": "https://gameknot.com/annotation.pl/chess-game?gm=59418",
    "gameName": "Chess game",
    "players": "Judit Polgar  vs. Viswanathan Anand ",
    "opening": "Sicilian (B90), Najdorf, Byrne (English) attack"
}