{
    "moves": {
        "1. d4": "So my second match of the season, with black against a player with a slightly higher grading.",
        "1... Nf6 2. c4 g6 3. Nc3 d5": "I play a Grünfeld Defence. https://en.wikipedia.org/wiki/Gr%C3%BCnfeld_Defence",
        "4. cxd5": "He plays the exchange variation.",
        "4... Nxd5": "I take back.",
        "5. e4": "He claims the centre.",
        "5... Nxc3": "I take.",
        "6. bxc3": "He takes back.",
        "6... Bg7": "I complete the fianchetto.",
        "7. Bc4": "He plays the old main line. An alternative, not necessarily better or worse, is the combination of Be2, Nf3 and Rb1.",
        "7... O-O": "I castle.",
        "8. Ne2": "The usual follow-up to Bc4. White prevents the pin Bc8-g4, which can now be simply met with f3, which white couldn't do if the knight went to f3.",
        "8... c5": "I hit his centre.",
        "9. Be3": "The bishop needs to move to e3 to give greater support to d4, but it may have been better to play 0-0 first to avoid the simplification that now follows.",
        "9... cxd4": "I take.",
        "10. cxd4": "He takes back.",
        "10... Qa5+": "This is why he maybe should have castled on move 9.",
        "11. Qd2": "Queen blocks.",
        "11... Qxd2+": "I take.",
        "12. Kxd2": "King takes back. In the endgame it is better to keep the king in the centre.",
        "12... Nc6": "Attacking d4 again.",
        "13. Rhd1": "Preparing to tuck the king away on e1.",
        "13... Na5": "Attacking the bishop.",
        "14. Rac1": "All white's peices are developed to sensible squares. I need to cath up on development.",
        "14... Bd7": "First the bishop.",
        "15. Bb3": "On my database, there are only moves where the bishop moves back to d3. ",
        "15... Rac8": "I have to prevent his Rc1 rolling into c7.",
        "16. d5": "Discovring an attack on a7",
        "16... b6": "So I stop that.",
        "17. Nd4": "White controls the centre. I need to relief my position with exchanges. I thought the best way was to exchange rooks first.",
        "17... Rxc1": "So off one goes!",
        "18. Rxc1": "He takes back.",
        "18... Rc8": "I contest the c file again.",
        "19. Rxc8+": "And the other rooks come off.",
        "19... Bxc8": "I take back.",
        "20. f4": "This has the threat of e4-e5, cutting off my Bg7. I know take the chance to swap off to an opposite coloured bishop ending, which are notoriously drawn. Instead he could have given me more problems with Nb5 threatening a7. If I reply a6 he has Na7 and both my Bc8 and b6 are hanging. However I think I can hold the draw with active defence - 20. Nb5 Ba6 21. Nxa7 Nxb3 22. axb3 Bf1 23. g3 Bg2 and black gets the pawn back as pawn on e4 can't be protected by the white king, without allowing a repetition - 24. Kd3 24. Bf1+ etc. White can still hang to the extra pawn with 24. Nc8 Bxe4 25. Nxb6, protecting d5, but it is hard for white to convert the extra pawn, given the reduction in material.",
        "20... Bxd4": "I take his knight.",
        "21. Bxd4": "He takes back.",
        "21... Nxb3+": "I take the bishop.",
        "22. axb3": "He takes back.",
        "22... f6": "I played this, and offered a draw, which he declined. It is very hard for either side to win now.",
        "23. Kc3": "So his king comes up.",
        "23... Kf7": "And so does mine.",
        "24. e5": "Trying to push and generate a passed central pawn.",
        "24... Bb7": "Attcking d5 and if he advances it, I have the pawn on g2.",
        "25. Kc4": "So he protects with his king.",
        "25... Ba6+": "I check his king.",
        "26. Kc3": "He offered a draw, which I accepted. Many thanks for reading, please leave a comment or two, and rate the annotation on the star system, to let me know how I am doing. Until next time, dear reader!"
    },
    "url": "https://gameknot.com/annotation.pl/chester-3-v-malpas-oswestry-1?gm=63533",
    "gameName": "Chester 3 v Malpas & Oswestry 1",
    "players": "Colm Buckley (ECF178) vs. Charles L Higgie (ECF176)",
    "opening": "Gruenfeld (D87), exchange, Spassky variation"
}