{
    "moves": {
        "1. e4": "This game played in the Chess coaching club mini-tournament is not so much an analytical annotation of a game in the usual sense but more just my personal (and very brief) thoughts at various points. \n\nThe aim of the tournament (and these 'annotations') is to allow the players taking part to discuss the strategic and tactical factors of the finished games. The stronger players then being able to help those whose weaknesses may become apparent through the annotations (like me and my bad thought processes!) and the weaker players to have a chance to learn from the stronger players thoughts throughout their games.\n",
        "1... e5 2. Nf3 d6": "At this time I would have been hoping for Guico Piano - but Philador would have done! ",
        "3. d4": "I would prefer not to let things get too congested, so a challenge to e5..",
        "3... exd4 4. Qxd4": "I was torn between this and Nxd4. I felt that he would almost certainly play Nc6 to try and develop with tempo if I played Qxd4. But the advanced d-pawn would allow for a pin the consequnce of which would be that the queen, in an active position, would actually be quite stable for the moment.",
        "4... Nc6 5. Bb5": "Removes the attacker of d5...",
        "5... Bd7": "Breaks the pin and re-adds the attacker of d5...",
        "6. Bxc6": "Exchange to maintain the stable queen.",
        "6... Bxc6 7. Bg5 f6": "I was expecting Nf6 here.",
        "8. Bf4": "I had a couple of other options here: Be3/Bh4 Qd7 - I felt Bf4 maintained more activity for the bishop, I feel this may have been a weak move actually.",
        "8... Qd7 9. Nc3": "Concluding development and giving the choice of castling either side.",
        "9... O-O-O": "I sat and looked at this position for quite a while, I was trying to decide whether the a7-pawn was bait for a queen trap or whether the capture would result in loss of control of the centre. In the end I couldn't see a concrete reason not to take the pawn...",
        "10. Qxa7": "I was a bit nervous at this point, I was hoping I hadn't missed something major.",
        "10... Qg4 11. Bg3": "Blocks the attacked g2 pawn and moves the attacked bishop to a defended square",
        "11... Re8": "I was expecting Bxe4 to for material equality, black may prefer the bishop pair.\n",
        "12. h3": "Hoping to boot the queen away from the attack on e4.",
        "12... Qe6": "Queen and Rook doubled on the e-file - get the king out of there!",
        "13. O-O-O": "Maybe kingside would have been safer, but I felt simultaneously bringing a rook to an open file and moving the king to relative safety was better.",
        "13... Bxe4": "I felt I was happy for this to happen as the resulting pins and related tactics on the e-file should more than compensate.",
        "14. Rhe1": "Administers the aforementioned pin..",
        "14... f5 15. Ng5": "Forking queen and bishop (attacked a 3rd time) maybe Ne5 would have been better, covering d7 and creating a mate threat. Recapture by the d-pawn would not have been possible since it is pinned to d8 - another mate threat.",
        "15... Qh6": "Absolute pin.",
        "16. Bf4": "Only defends the knight, doesn't actually break the pin as the Bishop is undefended...unless the knight can move with check, which it can't.",
        "16... Be7": "...attacks the knight again.",
        "17. Ncxe4": "Here I aimed to exchange on e4 so that I can recapture with my Rook and resume the pin on the e-file.",
        "17... fxe4 18. Rxe4": "Pins the bishop, the knight is safe for now.",
        "18... Qf6 19. g3": "I think the reason why I didn't play my next move here instead was simply because of the threat to the bishop itself meant that I got tied up thinking defensively.",
        "19... h6 20. Bxd6": "I initially noticed this move when I started thinking about the board schematically, saying to myself what needs to be changed to be able to force a mate? I thought I either needed the e-file opened with tempo, the c-7 pawn removed (or moved) to allow Rc4  or the Bishop to move so that my queen can safely move onto the back rank. With these thoughts in mind Bxd6 didn't seem so bad afterall! Capture with the Bishop results in mate in two:\n20...Bxd6 21. Qa8  Kd7 22. Qxe8#.\nRecapture with the pawn results in mate in three:\n20...bxd6 21. Rc4  Kd8 22. Qb6  Kd7 23. Qc7#\nor\n20...bxd6 21. Rc4  Kd7 22. Qxb7  kd8 23. Qc7#.\nNot capturing the Bishop would result in a decisive material gain"
    },
    "url": "https://gameknot.com/annotation.pl/chess-coaching-club-mini-tournament?gm=82",
    "gameName": "Chess coaching club mini-tournament",
    "players": "mattdw (1490) vs. haratta (1680)",
    "opening": "Philidor (C41), Boden variation"
}