{
    "moves": {
        "1. e4": "Jim has told me that he was an e4 player, who stuck to main lines, so I was expecting an Open Sicilian.",
        "1... c5": "According to plan.",
        "2. Nf3": "I expected this.",
        "2... Nc6": "And this is my usual.",
        "3. c3": "Already slightly unusual, but perfectly playable. DeepBlue chess computer beat Kasparov with this line.",
        "3... Nf6": "I have also played e6 in this position, transposing into the French Defence, and also d5, both without great success, so I play this now (with some success!). I was interested to find out later, that Nf6 does indeed score better on the opening databases.",
        "4. Bd3": "This was unexpected, but I have seen it before. I remember an article in an old \"Chess\" magazine recommending this move. The idea is to later retreat the bishop to c2 and play d4, with a strong centre, and to handle it a bit like a Spanish Opening, or a Ruy Lopez as we English often call it.",
        "4... d5": "But this moves seems to me to cut across White's plans. If White exchanges on d5 it will be hard to force d4 and White is left with a backward d pawn. I was pleased to see on the opening databases after the game that this is indeed Black's best reply.",
        "5. e5": "So he doesn't take, but advances.",
        "5... c4": "I wanted to play Ng4, without allowing him to play Bb5 followed by d4, securing his centre. I was pleased to see that my reply is in fact the most popular, although perhaps not the most successful",
        "6. Bc2": "So he retreats",
        "6... Ng4": "I carry on with my plan.",
        "7. Qe2": "He protects e5",
        "7... Qc7": "So I attack it again",
        "8. Ba4": "and he protects it indirectly by pinning my knight. I spent a while looking at this position. I looked at Bf5 with the idea of Bd3. The problem is that he has 9. Nd4 and then Bd3 is met with Qxg4. I also looked at 9. Nd4 Nxe5 10. Nxf5 Nd3+ but came to the conclusion that Black has not enough to justify the sacrifice. I was interested to find out later that there were a couple of over-the-board games with Bf5 9. Nd4 Bxb1 10. Qxg4 Bd3 when f4 was 0-1 in Davydov, Sergey… (2249) vs. Weetik, Vjaches… (2436) and e6 was 1-0 in  Moreda, Lucas (2329) vs. Della Morte, Pa… (2350) ",
        "8... a6": "So I played this move instead, threatening to play b5, lifting the pin and winning the pawn e5. In the Gameknot opening databases there are no examples of this move, although there are two with Bd7, with similar ideas.",
        "9. Bxc6+": "I think this is more-or-less forced.",
        "9... bxc6": "I thought it better to take back with the pawn and strenghten my centre and keep the pressure on e5.",
        "10. O-O": "he castles",
        "10... a5": "I play this move to delay, or stop, d4 or d3, which can be met with taking on d3, followed by Ba6.",
        "11. h3": "So he kicks the knight.",
        "11... Nh6": "I retreat",
        "12. d4": "And he makes a beginner's mistake",
        "12... cxd3 e.p.": "So I take",
        "13. Qxd3": "He takes",
        "13... Ba6": "Thanks for the exchange!",
        "14. Qd4": "He advances",
        "14... Bxf1": "I take",
        "15. Kxf1": "He takes back",
        "15... g6": "and now I make a big mistake. I was afraid of him exchanging on h6 and ruining my pawn formation. However I should have played Nf5",
        "16. e6": "Now I have problems completing my development.",
        "16... f6": "More or less forced, if I still have dreams of castling one day.",
        "17. Bf4": "Hitting my queen",
        "17... Qa7": "So I offer an exchange of queens. When material ahead, it is usually good to exchange pieces but not pawns.",
        "18. Qa4": "He avoids the exchange",
        "18... Qa6+": "I throw in a check",
        "19. Kg1": "He moves to the logical square",
        "19... Qb5": "I offer another exchange of queens. Now according to the Shredder program, after 20. Qxb5 cxb5 21. Na3 the position is even. It prefers Nf5 and Black still has the upper hand.\r\n",
        "20. Qc2": "But he didn't exchange!",
        "20... Nf5": "So I re-centralise my knight",
        "21. g4": "This seems poor, helping my knight on its way. Computer likes Bh6 now, but I played....",
        "21... Nd6 22. Nd4": "So he hits my queen",
        "22... Qa6": "I retreat",
        "23. Qa4": "He attacks c6",
        "23... Nb5": "And now everything is holding on Black's queenside",
        "24. Nd2": "He develops",
        "24... Nxd4": "I exchange before he can re-inforce his knight with Nd2-f3",
        "25. Qxd4": "He takes with the queen",
        "25... Bg7": "I continue to develop",
        "26. Nb3": "Still dreaming of queenside activity",
        "26... O-O": "I finally castle",
        "27. Nc5": "In comes the knight",
        "27... Qe2": "and I attack with the queen",
        "28. Bd2": "He finds a slightly strange way of protecting b2",
        "28... f5": "I attack his queen, also with threats of exchanging on g4 and opening up the f file against his king. He is more or less forced to exchange queens, into a lost ending",
        "29. Qe3": "So he moves the queen",
        "29... Qxe3": "I take",
        "30. Bxe3": "He takes back",
        "30... f4": "I hit his bishop",
        "31. Bd2": "He retreats",
        "31... g5": "I secure the pawn on f4",
        "32. Re1": "He mobilizes his rook",
        "32... Rfb8": "Now I have to be careful with his knight, as it can jump into d7, but I play around it so to speak",
        "33. b3": "He saves the pawn on b3",
        "33... Rb5": "I attack his knight",
        "34. Nd7": "It duly jumps into d7",
        "34... c5": "and now it is me with massive queenside pressure",
        "35. Rb1": "So his rook comes across to help",
        "35... c4": "But it is actually completely lost for him!",
        "36. Rb2": "To quote Shredder \"Black has a decisive advantage.\"",
        "36... Ra6": "e6 is a goner now",
        "37. Rc2": "But he decides to surrender his b pawn instead.",
        "37... cxb3": "Thank you",
        "38. axb3": "He takes back",
        "38... Rxb3": "I take the pawn",
        "39. Kg2": "One last try. If now Rxe6? Nc5 gives him a glimmer of hope",
        "39... Rc6": "but now c6 falls, and he decides to throw in the sponge. Thanks for reading this, please leave a comment or two, and rate me on the star system!"
    },
    "url": "https://gameknot.com/annotation.pl/chess-game?gm=41874",
    "gameName": "Chess game",
    "players": "Geoffrey Herbert (170BCF) vs. me (158BCF)",
    "opening": "Sicilian defence (B30)"
}