{
    "moves": {
        "1. d4": "This was the last match of the 2016-7 season.",
        "1... d5": "It is a sweet little game, where I mate him on move 21.",
        "2. c4": "So I play my usual.",
        "2... Nf6": "This is the third or fourth time I have met this, this season, so it is obviously popular, at least at this level. See this game http://gameknot.com/annotation.pl/colwyn-bay-v-malpas-oswestry?gm=62362",
        "3. cxd5": "So I take again.",
        "3... Nxd5": "He takes back.",
        "4. Nf3": "I deviate from the above mentioned game. The reason is on Wednesday April 12 I played in a quick-play tournament in Krakow. I was playing Julia Wiszniewska, 1054. She is just 9 years old. I had white. This was how the game started: 1. d4 Nf6 2. c4 d5 3. cxd5 Nxd5 4. e4 Nf6 5. Bd3 Nc6 6. Ne2 I was quite happy with this, I seemed to have control of the centre.\nBut then came this\n6..............e5\n7.\td5\tNb4\n8.\tNbc3\tBc5\n9.\tBb1\tNg4\n10.\tO-O\tQh4\n11.\th3\tNxf2\n12.\tRxf2\tBxf2+\n13.\tKh2\tO-O\nAnd I am just a pawn and the exchange down without any compensation. But after \n14.\ta3\tNa6\n15.\tBa2\tNc5\n16.\tQc2\tf5\n17.\tb4\tNxe4\n18.\tNxe4\tfxe4\n19.\tBb2\tBf5\n20.\tBxe5\te3\n21.\tQxc7\tRf7\n22.\td6\nI had at least equalised, and after \n........................Qe4??\n23.\tQxf7+\tKh8\n24.\tBxg7#\nI had won a game I really should have lost.",
        "4... e6": "I tend to think g6 going into a Grunfeld- type position is better.",
        "5. e4": "Now I do take the centre.",
        "5... Bb4+": "He throws in a check.",
        "6. Nbd2": "I thought it better to keep pieces on as I have the space advantage. I was slightly surprised to find out later that Bd2 is more common.",
        "6... Nf6": "Knight retreats. My e pawn is now attacked, as my Nd2 is pinned. ",
        "7. Bd3": "So I protect it.",
        "7... Nc6": "Attacking d4. c4 is probably better, maybe leading to  c5 8. Qb3 Nc6 9. dxc5 Bxc5 10. O-O O-O 11. Nc4 Qc7 12. e5 Ng4 13. Bf4 f6 14. Rae1 fxe5 15. Bxe5 Ncxe5 16. Nfxe5 Bxf2+ 17. Rxf2 Nxf2 18. Re3 Qc5 19. Be2 Ne4 20. Kh1 Nf2+ 21. Kg1 Ne4 22. Kh1 Nf2+ 23. Kg1",
        "8. a3": "If he takes on d2 I was going to take back with my queen, and if he then plays Nxd4 I can exchange knights and then win his queen with Bb5+",
        "8... Ba5": "He drops back. I think Be7 was better, but he said he wanted to re-route the bishop to attack d4.",
        "9. b4": "So I attack it again.",
        "9... Bb6": "He drops back.",
        "10. Nb3": "I give d4 more protection",
        "10... O-O": "I think this is a mistake. What would you play now?",
        "11. e5": "Opening up a diagonal to his king.",
        "11... Nd5": "Knight moves of course. What would you play now?",
        "12. Bxh7+": "Did you find it? The so-called \"Greek Gift\" attack.",
        "12... Kh8": "If he takes, Ng5+ gives me a winning attack.",
        "13. Ng5": "Preparing Qh5",
        "13... g6": "So he stops it.",
        "14. Qg4": "But my queen can still get to the h file.",
        "14... Kg7": "So he moves his king off the h file",
        "15. Qh4": "I am planning a second piece sacrifice.",
        "15... Rh8": "He is trying to prevent a disaster on the h file. But luckily my knight can move out of the way with check.",
        "16. Nxe6+": "Like this. Now if he takes with the bishop Qh6 is mate.",
        "16... fxe6": "So this is the only other move he has, but it is soon mate. Can you see how yet?\n",
        "17. Qh6+": "His reply is forced.",
        "17... Kf7 18. Qxg6+": "Driving his king to a dark square so that my bishop on c1 can join in.",
        "18... Kf8": "He chose this way.",
        "19. Bh6+": "And the bishop check comes in.",
        "19... Ke7": "Forced. I can win his queen here with Bg5+ but why take the queen when you can mate him?",
        "20. Qg7+": "Like this.",
        "20... Ke8": "Forced!",
        "21. Bg6#": "And this! Many thanks for reading. Please leave a comment or two and rate the annotation on the star system, to let me know how I am getting on. Until next time dear reader!"
    },
    "url": "https://gameknot.com/annotation.pl/chester-6-v-malpas-oswestry-2-board-1?gm=62984",
    "gameName": "Chester 6 v Malpas & Oswestry 2 Board 1",
    "players": "Charles L Higgie (ECF166) vs. Jixin Yang (ECF140)",
    "opening": "QGD (D06), Marshall defence"
}