{
    "moves": {
        "1. d4": "Not surprised, as like with anyone, for her the QPO is very common.  In fact, from what I studied, this is her main opening.  She does play 1.e4, a lot as anyone would, but from what I studied in some of her past games, I've seen her open with 1.d4 more.",
        "1... Nf6": "I would've played 1...d5, with that white plays the QG, in which case, I'd decline it.  But, this is just as good.  In fact, in a very recent e-mail, Susan mentioned about the Colles Opening or Colle-Zukertort system which starts with the QPO.  But, will we see this here?",
        "2. c4": "No, for this to happen, white would've responded with 2.Nf3.  After 2.Nf3, if white plays 3.e3, then it's the Colle's Opening.  However, this is unusual, but it reminds me of the Owen's Defense.  It's similar to a QG, so 1.d4, Nf6  But, then comes 2.Nf3, c5  So, it's basically a gambit.  In this case, it's more similar to a combination because it is a real gambit, where white gives up a pawn.  But, once black takes, he or she benefits.  This is a little different, then a reversed Owen's because, first, there's no sac.  Second, there's no sac, and Karpov will play 2...e6  Now in the Owen's, the e pawn does not advance this early.  On the other hand, it's a similar idea, as Susan, however, will play 3.Nf3",
        "2... e6": "I am presuming, since part of the assignment, even if I'm wrong, is to try and figure it out.  So, I presume that Karpov is thinking along the lines of and is playing this, as though it were the French.  Which if so, it makes sense because by doing so, it would appear that he gets a more comfortable position.",
        "3. Nf3": "In general, however, except for circumstances which would be more then what we're used, they don't deviate from guidelines whatsoever.  As noted Susan's opponent, in this case, when he was, at the time, the champion lost by deviating from the general guidelines.",
        "3... b6": "Could never figure why that's so, as I would've just developed a central pawn, and then, brought the B out.  But, GM's like to fianchetto because the flanks are important.  And, white's next move proves that.",
        "4. g3 Ba6": "This is why they fianchetto.  And, I used to be surprised by this kind of play, but that's no longer the case.  That's because as you saw in recent annotation, Bert played this move against me.",
        "5. b3": "As noted before, GM's like to Fianchetto.  What surprises me, even at GM level is that one can fiachetto both sides, this soon.  I only saw this once, with Charleshiggie in one of my annotations, but back then, I thought it was unheard of.  Now, that I see this, I know, otherwise.  However, I am shocked, but at the same time, amazed that, as jstevens1 would say, as per one of her threads at WTWLTR club; and while this is in a different context, it's very applicable here.  But, \"It Can be Done\".",
        "5... Bb4+": "I am surprised to see this at GM level.  I have seen it before, but with players of my strength or lower, including Mariann, who I've coached.  But, I didn't know that GM's deliver this kind of check, so soon.",
        "6. Bd2": "Normally, this would make sense, as I used to get out, this way.  But, in this case, I'm not sure why this is better then other moves.  The only reason being is that I got criticized for playing this to get out of check.  No, it's not bad or what you might think.  When I say criticized, I'm not offended in any way.  It just means, that as someone told me, it was a mistake when I did it.  So, I am not sure why she got out this way.  I think that best was 6.Nbd2  While it looks awkward, white develops another piece, plus, the N appears to be better placed as I believe that, sooner or later, you can find a better outpost because that's why, as noted, you would generally develop the N to d2, as white.",
        "6... Be7": "Black does not want to exchange.  Therefore, we know that it would hurt Karpov's position.  At first, I wasn't sure how and, likely, would've made an inaccuracy with 6...Bxd2?!  But, it makes sense, though, as I know what's really going on, and as noted, part of the HW is trying to figure it out, which I just was able to do.  It would not be good to exchange because Karpov's DSB is stronger then white's DSB, so taking would lose a strong B pair, and thus, put him a slight disadvantage.  By refusing to exchange, it still remains, in my opinion, even, as he keeps his stronger bishop pair.  As noted, just because things are level doesn't mean it's even.  And, even at that, if you exchange your stronger B pair for the opponents weaker, then you're placed at a disadvantage.",
        "7. Bg2": "I like forming the longest flank, which is why I used to fianchetto my B.  But, more often then not, when I've done this, it was at the cost of tempo which I needed.  A perfect example was one of my last games against the one that I don't like anymore but have annotated.  Fianchettoing meant disaster for the same reason that GM elyhim mentioned.  Before this, however, myevilliuck advised against this, but the only reason I didn't continue listening to him was that therealjimfrior, said not to use the word avoid because, if it works good, if not, don't play it.  What changed my mind again, however, is that ION said that fianchettoing costed time and, thus, to really be careful, unless there's no way to get it out.  That was the case against GAC, but it still lost time.  Therefore, although I won't mark since you don't really know if it's best or not, I, just based on my negative experiences with fianchettos would call 4.g3, as well as, this move, extraordinarly brilliant.  And, if this weren't with GM's, I'd give it two exclamation points.",
        "7... c6": "Karpov is thinking in a very similar manner to white.  As noted, the c pawn, like with QG, often gets advanced early in the Owen's Defense.  Although it's nothing like it, anymore, I believe when doing the HW the idea is similar.  Note: It's not a fact since it's beyond our level, but this is my personal opinion.",
        "8. O-O": "I'm not surprised with this move because, as with any game, K safety is important.  In fact, while I already knew this, it is something that Susan has illustrated that you have to get your K to safety.  But, that's something her sister, Judit, as well as, Carlson, and another GM have all emphasized.",
        "8... d5": "Advancing the other central pawn for development.  And, since a GM did this, I no longer agree that one should not break open the center before developing because that is exactly what Karpov just did.  Worth noting is that, if he didn't play this, I'd still agree.  But, that is one reason for doing this HW.  It helps one learn more which is also how to become a better chess player.",
        "9. Ne5": "One could argue that the same piece shouldn't be moved twice.  But, this, however, is an exception because, while not now, the f7 square is a potential target.  And, I bet, that this is Susan's plan based on the course planning and strategy, and about finding forcing moves which is more then safe to infer that white is looking for this, as that's how GM's think.",
        "9... Nfd7": "I would've played 9...Nbd7  But, I understand why he moved here.  Once they exchange, not only does black develop, but his N is in a much better place.  I think, it's stronger then N on b8, if he moved that, instead.  Also, the reason it would be in a better place is due to the fact that, on more then one occasion, black can find a very good outpost for his N which is an important part of strategy.",
        "10. Nxd7 Nxd7 11. Bc3": "To put pressure on her long diagonal with her dark square.  In my opinion, she bears in mind that 11...dxc4?! is risky because instead of taking right away, white has 12.d5, and should Karpov dare take, white will, at the very least win a R for B after 13.Bxg7, which is why she would make the combination with a pawn.",
        "11... O-O": "Taking no chances with what I mentioned, Karpov gets his K to safety.",
        "12. Nd2": "Finding a good outpost for her N as this makes, as this, at the very least, enables white to play 13.Nf3, so that it's better placed.  No good, of course, for the reason we all know about was 12.Na4 because of his DSB.",
        "12... f5": "While I generally wouldn't play this, like what everyonelse would say, in this case, it's not a big deal that there is, what I consider to be a whole around the K.  Although he doesn't do this, I think his plan is to mobilize his f R.  I believe, that the real goal (long term plan) is for him to be able to play ...Rh6.",
        "13. Rc1": "Adding an overload to her DSB.",
        "13... Ba3": "So, he goes on the attack.  From more experience, I know that his main target is his R.  I know I said that GM's like to attack pieces, but as cdeburca once said, really strong players don't just play moves to attack pieces.  The big picture as also noted in the intro is why, which is the most common chess question.  I'd say that the goal is not the R, instead, he plays this to put pressure on the c file.  I think the idea being is that putting pressure on a specific file, rank, or for that matter a square, will benefit his or her position.  I'm not sure how, but this would make sense, nonetheless.",
        "14. Rb1": "She must defend.  Not as good, in my opinion, which is the only other option there was 14.Ra1, but then the R appears to be stuck in the corner.  And, when that happens, the mobility is more limited.  As we know, though, mobility is vital.",
        "14... Bd6": "I was a little surprised to see this move.  But, I think that Karpov didn't want to take any chances with getting into trouble with the DSB.  That's because this is his strong B as the mobility of black's DSB is higher then the mobility of his LSB.",
        "15. b4": "The plan here is a pawn chain, but not for the reason you mentioned.  White intends to gain tempo and enclose the center, as we're about to see.  As a hint, and to an extent, a spoiler, I followed the same strategy with knightrider62, so it will make sense pretty soon.",
        "15... Qc8": "Adding an overload to his c pawn.",
        "16. Qb3": "So, white adds pressure to the c file.  Normally, I wouldn't see the point, but it does a lot more then it appears which I was sort of implying a little earlier.  But, there is still a little more to the story.  As awkward as might sound, the reason I add this is that she has a plan, and as we know, GM's can think well ahead due to their experience.  Sometimes, it's, at least, 30 moves in advance, from what I've been told.",
        "16... b5": "Black wants to get rid of the danger, so the idea is, either force an exchange or win a pawn.",
        "17. c5": "But, Susan does not have to decide between the two.  And, this was, all along, the plan behind 15.b4, with the pawn chain, and 16.Qb3 with the added pressure.  Now, not only is the B attacked, which wasn't the real goal.  But, the question about the attack is what does it do.  The pressure on the d file is greater then one, Karpov, could imagine.  That's something he was also trying to prevent.  But, this pressure loses tempo for black.  And, with that, I believe that white, although no where near winning, has a very slight advantage.  The point is that timing's critical.",
        "17... Bc7 18. e3": "Adding to her pawn chain.",
        "18... Qe8": "But, black has ideas of his own.  I think the reason he played this is that, should Karpov be able to put pressure of his own with the N, the Q will add to that pressure.  Not now, but sometimes you have threats of mate.  That is, when the N is on somewhere like g4, and the Q is directly behind it on h5.  I know because, although it happened several years ago, not only did I have to study this with Jack, but I've made mistakes like that, including with a game on this website and payed the price.  Although there won't be that danger, it is still the same idea that black, presumably, wants to put pressure on white with his N and Q, close to each other.",
        "19. f4": "I believe that the intention is to prevent black from putting pressure on f4.  If that happened, white would be in a little trouble, and thus, would lose that small edge that she currently has.",
        "19... h6": "I believe to open up if white were to play Qc2 with a possible idea of exchanging pawns from the d to f files with the plan being Be4.  It's unlikely, but if that were to happen, black is now protected.",
        "20. Nf3": "Finding a better place for her N, as noted on white's 12th, which was, also a part of her plan.  The reason she couldn't do this sooner is that some of black's plan got in the way of her plan because of what we know with forcing moves.  The idea here is that white had to do something before black could come up with nasty threats which might give him a winning edge.  Don't think that would be true, but white just had to be careful to prevent that since the idea is, as she also noted, what C++ has said which is, \"Consider all threats, checks, and captures.\"",
        "20... Kh7": "As of now, we're not in an endgame, so the K hasn't become a weapon, as of the moment.  And, there's no major threats, yet.  But, I think the potential still excists.  Although it's slight, why take the chance?  In addition, the danger I'm thinking of involves the same threat I mentioned on his last move.  I could be wrong, but against GM's, even the slightest threats are something to be weary because, as noted, they can think well in advance.",
        "21. Kf2": "I think the same could be said for white, as to, why she played this.  It looks like black's idea would be getting rid those pawns from the d to h files, so that his threats would, potentially, be the same, after ...Qh5  So, the idea would be to eliminate that danger.",
        "21... Nf6": "It appears that my instinct's about black were spot on.  This is also why it's good to do HW.  By doing so, you learn which, in turn, helps one to become a better player.  This is also why mentors give their students HW.  The idea being that their goal is to help you learn and teach which is why their called mentors.  So, the way you do is by getting HW assignements that you, as the student have to give an answer and try to figure out.  Examples, as noted are asking why player A resigned against player B or seeing if you can find the move that will lead to a draw.  Well, this makes sense because one can also be his or her mentor.  It's called being your own spectator as the master mater puts it.  At this point, I understand because by being your own spectator you spot your mistakes and teach yourself chess which is how you can be your own mentor, including but not limited to giving yourself HW.  And, since mate is no longer threatened, I think that with, the same idea, he intends to win a pawn and pin the B, with the plan being ...Ng4, followed by ...Qh5, vica versa.",
        "22. Ne5": "Not surprisingly, however, white does not allow it.  In addition, the N looks nasty here.",
        "22... Bxe5": "This is why he takes.",
        "23. dxe5": "Well, white had to take back, in order to avoid the loss of a piece.  Now, one think that doubled pawns are quite nasty, but in this position, I don't think there of any asset, whatsoever.  That is, in part, because there is now pressure on the f6 square which gains more time.  With that said, I think it goes from just minor to white having a noticeable, edge, at this point.  And, what's more interesting is that both sides have been and are still flawless, in my opinion.",
        "23... Ng4+": "Not surprised that he moved here as he now gains some time.  In addition, despite a perfect, as implied above, this move also wins a pawn since it is, afterall, a fork.  That's why he played this, more then the other reason.  The idea is tactics, with the plan also being that he found a forcing a move which is how he winds up a pawn.",
        "24. Ke2 Nxh2 25. Rfh1": "With where the N, however, is placed, now we can say that Susan puts pressure on Karpov.  So, despite winning the pawn, while she won't win anything back, as of the moment, it does get tempo, in return.  And, that's why despite being a disadvantage with the loss, it's very slight.  It is, so small that it appears, pretty much, even.",
        "25... Ng4 26. Bf3": "Not at all surprised.  Given how black captured, she wants to get rid of his N, one way or another.  Since she already knew that black would see the threat, this was part of her plan.  That, once he played 25...Ng4 this was how she would respond.  So, although it was OTB, I think, it is still, nonetheless, a conditional move because, under the condition that Karpov retreats, this was white would do.",
        "26... Qg6": "Not surprisingly, with what happened, in terms of 24...Nxh2 black will not allow an exchange.  What white had in mind before this move was that ...PXB, was allright.  However, 27.Bxg4? would be Susan's first mistake because she would lose a pawn due to a nasty fork, after 27...Qxg4+",
        "27. Rh4": "With how many moves they think, it's obvious that Susan anticipated that.  So, this was her conditional move, as it adds pressure to g4  It's not attacked with the pawn, but that's not the point.  The idea is that you now have another offender, so while the N is under seige, it is, nonetheless, vulnerable which is what I mean by under pressure.  While I wouldn't think, it's also safe to infer that she might be planning on a mating attack, as well.  With that R there, although it wouldn't happen now, the plan would, likely be, putting the Q on a square like (e.g., the plan might be getting rid of some her pawn's as noted earlier to allow Qf4, and with her R there, that would pose as a real threat.)  The threat would involve pressure against the K, and thus, mate.",
        "27... Kg8": "So, black does not take any chances.",
        "28. Qc2": "White might have other ideas.  Perhaps, a Q sac on f5  Note: it wouldn't necessarily be true because of f5, but just as an example, you might be talking about an eventual Q sac on f5.  That's one of the things that the Polgar sisters are known for are sacking their Q.  And, when they do so, it often leads to mate.  If not, the position, at the very least would be lost for their opponents.",
        "28... Qe8": "As it's safe to infer that Karpov has studied their games, he will not allow that which is why black brings an overload to e6.",
        "29. Rbh1": "So, white doubles up because the idea being is that two R's on one file are known to be very dangerous.  ",
        "29... Bc8": "?? Of course, black has other ideas which is why he remobilizes his B and adds, yet, another defender to e6.   Now, on a normal basis, I wouldn't mark it as you don't really know if it's an error or not.  But, I believe that this is blacks first mistake.  And, it appears to be worse then that.  I think that, up to this point, no one made a single mistake, but this, however, seems to lose the game, as we will see later on, which is why I give it two queries.  Instead, best appeared to be 29...Qg6  After white exchanges, which was, also, part of her, Susan is going to win back a pawn.  That's, also why she planned that.",
        "30. Bxg4 fxg4 31. Rxg4 Kh8": "Well, white was threatening 32.Rxh6 which would win a pawn, this time around, as Karpov would not be allowed to take back.  the reason being is that 32...gxh6 would, in fact, be an illegal move, as the g pawn is pinned.  At least for now, however, this move protects the pawn.  But, how long will it last?",
        "32. Rg6": "In this position, white is threatening mate, believe it or not.  It would start with a combination, by saccing her R.  The idea being 33.Rgxh6+, with mate one or another because if 33...Kg8, 34.Qh7+, Kf7 (forced) 35.Qxg7#  And, if, instead, 33...gxh6, 34.Rxg6, Kg8 (forced) 35.Qh7#  ",
        "32... Qf7": "But, this move, however, prevents that because if 33.Rgxh6+, gxh6 34.Rxh6+, Kg8 35.Qh7+?? doesn't work.  In fact, it would be now be a blunder due to his Q, which would, at the very least, lose a R.  35...Qxh7, 36.Rxh7, Kxh7, and black would now have a winning edge.",
        "33. g4": "Having said that, white comes with other ideas.  While it would take a very long, say, at least, 10 moves (as per, once again, how far they can think), the long term plan would be to figure out a way to promote.  And, while black doesn't have a passed pawn, yet, my inference is that this is what she intends to do.",
        "33... Kg8": "So, Karpov isn't taking any chances.  But, it's now safe to say that this is his first mistake because black is going to lose a pawn, at this point, with no way around it.",
        "34. Rhxh6 a5": "Seeing how dangerous her b pawn might become due to the DSB guarding it, black intends to exchange.  However, white will not accept, as there are bigger threats to worry about, in this position.",
        "35. Rg5": "The reason for this move is that the threat of mate is more obvious.  Her Q was effectively blocked by the g6 R,  as it could not go to h7.  But, by moving it, the threat is there, and if Karpov isn't careful, white will mate.",
        "35... axb4": "I would've said that he thought he'd won the pawn back with his idea being 36.Bxb4, 36...Rxa2, but I quickly realized that it isn't so because of 37.Qxa2 losing a R.  So, why did black play this?  Black thought that he had stopped a, potentially, dangerous pawn, as noted on his last move.  But, this loses immediately because Karpov had a much bigger threat that he needed to weary of.  By missing it, white will mate immediately.  However, it was still lost mate, no matter how you look at this.  But, black would've lasted a move longer.  If 35...g6, to prevent white from mating on h7.  36.Rxg6+, Qxg6 37.Qxg6+, Kh8 (forced) 37.Rh5#  ",
        "36. Qh7#": ""
    },
    "url": "https://gameknot.com/annotation.pl/chess-game?gm=59362",
    "gameName": "Chess Game",
    "players": "GM Susan Polgar  vs. GM Anatoly Karpov ",
    "opening": "Queen's Indian (E15), Nimzovich variation (exaggerated fianchetto)"
}