{
    "moves": {
        "1. e4": "I prefer 1.E4 from white to 1.D4",
        "1... c5": "I began playing the Sicilian only after I familiarized myself with the English as white.  Before, I had thought the lines of the Sicilian were too complex, and I favored the French Defence or the Caro Kann.  I would be interested to learn some of the systems where black plays 2.Nc6 or 2.E5 and then Nc6.",
        "2. d3": "I think this is not the most attractive move, closing down the f1-a6 diagonal.",
        "2... Nc6": "I believe this is a standard move in the Sicilian, just as 2.Nc3 is in the English. ",
        "3. Nc3": "The first inkling that white has in mind to castle queenside and hack black on the kingside.",
        "3... d6": "I am not sure if this is still a standard Sicilian, because I am playing the lines of the English Opening in reverse.",
        "4. Be3": "Maybe it would have been better to play for Bb2.",
        "4... Nf6 5. h3 g6": "I am not sure, but I think this line may be the infamous Dragon variation.  However, I am still going with lines from the English.",
        "6. d4": "An interesting move, I think.  I would be interested to know what you think white has in mind here...",
        "6... cxd4": "I think this exchange will maintain basic equality...Against a strong opponent, I was playing conservatively.",
        "7. Bxd4 Bg7": "Do you think Nxd4 was stronger...?",
        "8. Bxf6 Bxf6": "I have the two bishops, and reasonable control of the center.  However, by now it seems clear that white is going to castle queenside and try to smash black up on the kingside.  I have a good defensive bishop, but I am worried white might play something like g4.",
        "9. Qd2": "I though Qh6 would have been an unpleasant harassment.  ",
        "9... O-O 10. Bd3": "It now seems likely that white will play f4 and e5.",
        "10... a6": "Ne5 may have been stronger, preparing to collect the two bishops.",
        "11. O-O-O b5": " ",
        "12. b3": "A dubious move...?  Without the dark-squared bishop, white has some very weak squares around his king.",
        "12... e6": "Hoping to play Bg5...",
        "13. Kb1 b4": "I wonder whether this move was premature...",
        "14. Nce2": "Do you think this is stronger than Na4?",
        "14... Nd4": "I think black will have a stronger position if Nxd4 and Bxd4.",
        "15. Nxd4 Bxd4 16. Qxb4": "I am not really down a pawn here, because I can play Bxf2.  Alternatively, Bc5 may have been a good move, too.",
        "16... Bxf2 17. Nf3 Bc5 18. Qc3 e5": "With this move, white's bishop is looking to be a low-quality piece, whereas both of black's bishops are active. ",
        "19. Nxe5": "Tell me if you think this knight sac was clever, or arrogant...",
        "19... dxe5 20. Qxe5 Bd6 21. Qc3 Bd7 22. e5 Be7": "Rc8 may have been the stronger, but more tactical move.",
        "23. h4 Rc8 24. Qb2 Qc7": "I am pretty sure black had some better options here, but I wanted to get the queen off the d-file.  Black does have the possibility of Qa5 followed by Ba3, trying to play on the dark squares around white's king.",
        "25. Rdc1": "This looks like a very weak move; the c-file is only semi-open, and white's c2 pawn is looking secure enough without the rook.  Nor does C4 look playable for white... ",
        "25... a5 26. h5 a4 27. hxg6": "I remember having a good reason for not taking FxG, but I cannot recall...  Do you agree that HxG is stronger...? ",
        "27... hxg6 28. e6": "Black is suddenly in dire straits with the threat of Qh8#.",
        "28... f6": "So I am forced to sac a bishop.  Here, at move 28, white looks to be winning...",
        "29. exd7 Qxd7 30. Bxg6 axb3 31. cxb3": "White's king appears to be quite secure to long as white can maintain control of the b1-h7 diagonal.  I did not want to allow white the crushing Rh7.",
        "31... Rxc1+ 32. Rxc1 Kg7 33. Be4 Qe6 34. Bf3": "And here white abandons that crucial diagonal...",
        "34... Bd6": "I am trying to untangle my pieces and get some sort of attack going, perhaps with Be5.",
        "35. Qc2 Rc8": "Although black is down two pawns, I have finally regained the initiative; white has no playable checks.",
        "36. Qd2 Qf5+": "I think this was the right time to play this check, but please let me know if you see a stronger continuation in this highly-tactical position.",
        "37. Kb2 Rxc1": "Time was running low, and I was mostly trying to keep the initiative, but I would be curious to know if there was a knockout blow here...",
        "38. Kxc1 Ba3+": "A terrible blunder; Bf4 would have won the queen.  But it was a blitz game, and both players had around 30 seconds left.",
        "39. Kd1 Qb1+ 40. Ke2 Qf5": "I am trying to make sure white has no checks; time was so low that each move had to be made within two or three seconds...",
        "41. Qe3": "A defensive move from white; black's king remains secure.",
        "41... Bc5 42. Qc3 Qe6+ 43. Kf1 Qd6": "I think the idea here was just to hang on to the bishop, and try for a win on time...",
        "44. Qc4": "Now there is a threat of white playing Qg4#.",
        "44... Be3": "An odd-looking defensive move, played under severe time pressure.",
        "45. Qg4+ Bg5": "And once again, white has no useful checks.",
        "46. b4 Qd3+ 47. Kg1 Qe3+ 48. Kh2 Qe5+": "And in this position white ran out of time, up by two pawns, but unable to keep up enough pressure to win on time.  I had about 9 seconds on my clock...Please let me know what you think of this game.  Thanks, Omar."
    },
    "url": "https://gameknot.com/annotation.pl/chevy-to-the-levee?gm=38668",
    "gameName": "Chevy to the Levee",
    "players": "s_syaiful@chesscube.com (1900) vs. Omar Kitrich (1842)",
    "opening": "Sicilian defence (B20)"
}