{
    "moves": {
        "1. e4 c5 2. Nf3 d6 3. d4 cxd4 4. Nxd4 Nf6 5. Nc3 g6": "The thematic tournament position.",
        "6. Be3 Bg7 7. f3 O-O 8. Qd2 Nc6 9. Bc4": "Modern practice tends to favor 9.0-0-0. However it was this precise line that was considered a practical refutation of the Dragon back in the '80s. Fischer and Karpov were the main exponents of the White side, winning almost every encounter. Support of the variation dwindled. Fashion plays a big role in chess openings. Everyone plays what GMs play. Entire openings are deemed untrustworthy only because current practice focuses on more positional lines and so the state of mind is created.",
        "9... Bd7 10. O-O-O Rb8": "The hot debate was between 10...Rc8, the 'positional' approach and 10...Qa5, the 'attack' approach. Both seem lacking currently, while this small Rook shuffle has impressed the likes of Radjabov and Carlsen. Amongst other things, Black intends to play b5 and Nc4 and after Bxc4, recapture with the pawn and create a strong focus fire on b2.",
        "11. Bb3": "An almost necessary move and a strong reason why delaying the development of this Bishop might be indeed better. With the Bishop on f1, White doesn't waste 2 tempos to recapture the Black Knight that is bound for c4.",
        "11... Ne5": "Preparing b5 and Nc4. A typical Dragon maneuver.",
        "12. f4": "White changes the position at once, not giving Black time to reach the desired setup with b5.",
        "12... Neg4": "On the other hand, g4 has been weakened now and can be used a great defending post by three of Black's pieces.",
        "13. Bg1": "13.h3 might be worthy of investigation. After 13...Nxe3 14.Qxe3, Black must find an active plan and be complacent and relax now that he has the Bishop pair and his DSB is unopposed. My opponent didn't want to part with his Bishop so soon and retreated, knowing that he will have time to regroup and regain the g4 square with tempo. The problem is that if White tries to open the h-file, g4 will again be weak.",
        "13... b5": "Otherwise the Rb8 has been played for nothing.",
        "14. h3": "White follows his plan as well.",
        "14... b4": "The only move to keep the initiative going. White can't retreat the Knight because Black can play Nxe4 hitting the Queen and after that he has time for Ngf6.",
        "15. hxg4": "Opening the h-file but weakening g4. His Bg1 isn't so ideally placed either.",
        "15... bxc3": "My turn to open the b-file.",
        "16. Qxc3 Rc8": "Another possible move was 16...Nxe4, with the likely continuation 17.Qh3 h6 18.f5 g5 with a very complicated position. But since I could activate my Rook on the c-file with tempo, I went for the this instead.",
        "17. Qg3": "17.Qh3 fails to Bxg4. White is tempting me to go for the center pawn.",
        "17... Nxe4": "Which I did. Instead, more safe was Bxg4. Now the position is full of complications.",
        "18. Qh3": "White misses the slightly stronger 18.Qh4, the point of which is that the Queen isn't eyed by the Bd7 and f5 is a lot stronger.",
        "18... h6": "Forced.",
        "19. f5": "Still very strong. g6 is under a lot of pressure.",
        "19... Nc5": "So I intend to remove the pesky Bishop that aims for my King.",
        "20. Kb1": "Letting the attack slip. 20.Be3, activating the Bg1 was a lot stronger.",
        "20... Nxb3 21. Nxb3": "Black isn't out of the woods yet. White still has a looming presence on the h-file.",
        "21... Qc7": "Attack is always the best defense.",
        "22. Rc1": "Passive again. Now I get the chance to use the space on the Q-side to activate my pieces and generate threats of my own.",
        "22... Qc4": "Taking care of the fxg6 threat, since after the cool reply by Black fxg6, White can't defend on g4.",
        "23. Be3": "Finally connecting the Rooks and getting the Bishop of the back rank but now Black has an adequate reply thanks to the active Queen.",
        "23... h5": "Using the pin White created on move 18.",
        "24. Qh2": "In case of 24.fxg6, Black replies with fxg6 and the g4 pawn is a goner. Black would also have opened the f-file and active his LSB with direct threats against the King.",
        "24... Qxg4": "Closing the h-file and putting a hold on White's attack.",
        "25. fxg6 fxg6": "My King is actually safer and my pieces coordinate better than my opponents.",
        "26. Bxa7": "An ill-advised pawn grab but White must have been out of ideas at this point.",
        "26... Bf5": "The threat is Bh6!",
        "27. g3": "Protecting c2 but now I can use the stranded a7 Bishop to regroup and attack on the a-file.",
        "27... Rca8 28. Qf2 Qa4": "Winning a piece.",
        "29. a3": "One bad move follows another is an old saying in chess and from my own experience there is more truth in it than I would like.",
        "29... Qxb3": "Not wanting to play the masochistic 30.Qb6, White resigned."
    },
    "url": "https://gameknot.com/annotation.pl/chinese-dragon-lives?gm=26171",
    "gameName": "Chinese Dragon Lives!",
    "players": "eddeeagle (1713) vs. nyctalop (1927)",
    "opening": "Sicilian (B78), dragon, Yugoslav attack, 10.O-O-O"
}