{
    "moves": {
        "1. d4 d5 2. Bf4 e6 3. Nf3 c5 4. e3 c4": "Not often played, but normal. I can't assess it, but I know black can cause white some trouble. ",
        "5. c3 h6": "A loss of tempo, but it is true that g5 can eventually become a target. ",
        "6. h4": "Taking space inmediately. I have to attack the kingside. That's the plan in this opening. ",
        "6... Bd6": "Normal, but...",
        "7. Ne5": "...and this knight is not easy to remove, since after f6, Qh5+. Instead,after...",
        "7... Bxe5 8. dxe5": "Not with the bishop, that can be easily harassed with f6 (Qh5+ is not so dangerous, now, without the white knight), or simply allows black to develop Nf6, then Nc6 will kick or exchange the bishop. ",
        "8... f6": "...or f6 directly before the exchange (even worse), allows...",
        "9. Qh5+": "The beginning of a fall. But white still have to be careful. Adequate defence can still equal the game. ",
        "9... Kd7 10. g3": "Not Qf7+, that just leads to queen's exchange. I am looking to activate the lsb in h3. ",
        "10... Qe7 11. Bh3 f5": "Ok, I provoked this. Now, black must be weak on the dark squares, right? So let's exploit that...",
        "12. Bg5 Qe8": "...and here, the obvious QxQ, then the bishop can be saved... leads to a good but boring game. ",
        "13. Qf3": "Let's sac the bishop. ",
        "13... hxg5 14. hxg5 g6": "Black should have tried to exchange the queens with Qh5, but white has g4. Interesting to look deeper. ",
        "15. b3": "Against logic, but I have to act quickly if I want to get something for my bishop. The uneasy black king position must help me and should make possible this \"unwise\" opening of the queenside. ",
        "15... b5": "Black defends.",
        "16. bxc4 bxc4": "Ok, now, who will take advantage of the white squares? Black... if white allows him to. ",
        "17. Nd2": "I threaten Nxc4, since the d5 pawn is pinned to the rook. ",
        "17... Nc6": "This is a good move, and incidentally prevents me to play Nxc4. ",
        "18. Qf4": "I must defend e5, period. ",
        "18... Ba6": "hmm... where else?",
        "19. O-O-O": "!???. I am threatening again Nxc4. I have just a tempo before the black queen gets to my king, but doing otherwise would have meant not to connect the rooks (remember that my bishop is pinned, unless he goes to g2). ",
        "19... Nge7": "Catching up in developement, but allowing me to complete my plan. Kc7 was needed. ",
        "20. Nxc4 Bxc4 21. Qxc4": "Black runs out of his inactive bishop for an active knight, but my queen is now into the fry. ",
        "21... Nxe5": "Ok, and Qd5 is not good after N7-c6, so...",
        "22. Qb5+": "If black covers with a knight, Qb7+... look scary. ",
        "22... Kd8 23. Qa5+ Kc8": "Now, not Qc5+ (Qc6!), but use the tempo to bring the reinforces...",
        "24. Bf1": "I liked it. If RxR, Ba6+ will recover the rook (the least). This is the nice moment I wanted to save. Sadly, my opponent went for that line. But what else? If Nc4, BxN seems deadly. After dxB, white surely wins. ",
        "24... Ne7c6": "Yes, but it's too late. ",
        "25. Ba6+ Kd7 26. Bb5": "Pinning the knight. ",
        "26... Rxh1": "Trying to distract my rook from the king's column, but it gives me another very nice one...",
        "27. Rxh1 Qg8": "...that now black has to control. But I have to control black's Nd3+, since it is not possible for me to take it with the bishop because of the hanging queen, so I can't enjoy the pin coverage anymore. ",
        "28. Qa6": "...and now white's edge is overwhelming, without any material recovering, or stunning forced tactic. So it was just a speculative sacrifice, probably not resisting a serious analysis, but very fun to play and to review. Hope you enjoyed that. ",
        "28... Kc7": "maybe Rb1 was better, because now...",
        "29. f4": "I recover the piece and I win the game. Note the knight can't check me. ",
        "29... Qc8": "Desperately, but...",
        "30. Rh7+ Kd8 31. Rh8+": "... and here it's curtain for black. Thank you for reading and for your comments. "
    },
    "url": "https://gameknot.com/annotation.pl/chocking-my-opponent?gm=51676",
    "gameName": "Chocking my opponent",
    "players": "damalfi  vs. player ",
    "opening": "Queen's pawn, Mason variation (D00)"
}