{
    "moves": {
        "1. e4 c5 2. Nf3 d6 3. d4 cxd4 4. Nxd4 Nf6 5. Nc3 a6": "The Sicilian Najdorf.  Literally the most common opening in the world.",
        "6. Bg5 e6 7. f4 Qb6 8. Qd2 Qxb2 9. Rb1": "Alternatively 9. Nb3.",
        "9... Qa3": "Poisoned Pawn Variation, accepted.  The idea so far is for white to crash through the center with either f5 or e5.  In late years, the f5 line has been shown to be drawish (basically analyzed the entire game down to a draw; i.e. Vallejo Pons–Kasparov, Moscow 2004).  e5 is the only way for white to play to a win in this Sicilian line.",
        "10. e5 dxe5 11. fxe5 Nfd7 12. Ne4 Qxa2 13. Rd1": "Alternatively 13. Rb3.",
        "13... Qd5 14. Qe3 Qxe5 15. Be2": "The game is all book, up until this point.  Black has a significant material advantage in exchange for every white piece being developed.",
        "15... f5": "15... f5?\n\nThis move forces black to give up his advantages.  [16. Nxe6 Bb4+ 17. c3 fxe4 18. Nxg7+ Kf8 19. O-O+ Kxg7 =]\n\nNot the immediate [16... fxe4 17. Nxg7+ Kf7 (the alternative leads to a mate in 5) 18. Bh5+ Kxg7 19. Bh6+ Kf6 20. O-O+ Ke6 21. Bg5] and mate is unavoidable.",
        "16. Bh5+": "16. Bh5+??\n\nThis move is just dumb.  When I was playing, I saw an illusion of some sort, but there's really no excuse to blunder a piece for nothing.",
        "16... g6 17. Nxe6": "I had actually looked at Nxe6 on my 16th move, but was for some reason I was convinced Bh5+ was better.  At this point in the game, Nxe6 is desperation play.\n\nO-O is more solid, but black can force off several exchanges of pieces, while keeping his large material advantage.",
        "17... fxe4 18. Bg4 Bb4+ 19. Ke2": "We can see white is looking pretty screwed, now that Black has the tempo.",
        "19... Ba5": "A passive move in an incredibly complex situation.  Black is trying to cover the c7 square which is a vulnerability in some lines.  He also wants to use his queen in a more offensive, rather than defensive manner.\n\nThe proper response is to take aggression immediately with [19... Qb5 20. Kf2 Rf8+].",
        "20. Rhf1 Qb5+ 21. Kf2 Bb6": "My opponent had this sequence of moves in mind, which is probably another reason why he played 19... Ba5.  At first glance, it looks like white is helpless, but I read much further than my opponent in this line.",
        "22. Ng7+": "Exploiting the vulnerability at g7 that was present in earlier lines.",
        "22... Kf7 23. Kg3+ Nf6": "23... Kxg7 24. Bh6+ Kg8 25. Be6#",
        "24. Rxf6+ Kxg7": "Kg8 prevents immediate mate.",
        "25. Bh6+ Kxf6 26. Qc3+": "My opponent resigned.",
        "26... Qe5+ 27. Qxe5+ Kxe5 28. Bg7#": "This is honestly one of the coolest mate positions I have ever seen, let alone played.  Material-wise, I am down a rook+knight+pawn, yet the black king is checkmated in the center of the board."
    },
    "url": "https://gameknot.com/annotation.pl/class-a-otb-tournament-game?gm=37543",
    "gameName": "Class A OTB Tournament Game",
    "players": "cliang  vs. unknown ",
    "opening": "Sicilian (B97), Najdorf, Poisoned pawn variation"
}