{
    "moves": {
        "1. e4 e6 2. d4 d5 3. Nc3 Nf6 4. e5 Nfd7 5. f4 c5 6. Nf3 Nc6 7. Be3 cxd4 8. Nxd4 Bc5 9. Qd2 O-O 10. O-O-O a6": "Sooo... this is one of the starting theoretical position of the French Classical Defence (3...Nf6) - (Steinitz Variation)\n\nIn fact a rare case in point in the French, and a great resemblance with many lines of the Sicilian because we have a race for mate with opposite castling. It surely explains why this line is popular among top attacking players like Shirov or Morozevich ",
        "11. h4": "The oldest and most tried plan, the Rook on h1 will be transferred on the third rank (Rh3) where it will be capable of defending laterally White queen-side castle while attacking Black's king-side. Others moves have been tried, and notably two of them are less direct and more poisonous by defusing first Black's attack on the queen-side : 11.Qf2 (Kramnik) and 11.Nb3 (Nijboer, Anand)",
        "11... Nxd4": "This exchange is forced if Black wants to push his b pawn as quickly as possible",
        "12. Bxd4 b5 13. Rh3 b4 14. Na4": "Much more annoying for Black than the Knight retreat on e2, White will  consolidate greatly his castle by following by b3.",
        "14... Bxd4 15. Qxd4 f6": "A move devised by Short vs. Kasparov. Usually a5 is played.",
        "16. Re1": "A new move. Here Kasparov took Pawn b4 and Short Pawn e5, on the complicated position that ensued Kasparov crushed Short. Later it has been proven by GM Brynnel on many occasions that Short's move was perfectly playable and that white has to take the draw before getting into trouble.",
        "16... Qa5": "This move is an error it blocks my pieces on the queen-side, as I will need a lot of time to develop my Bishop by Bb7-c6-b5. Much smarter were 16...a5, 16...Qc7 keeping the tension or the safe and sensible 16...fxe5 17.fxe5 a5 with a very slight plus for Black as he will have better control of the position through the pawn target on e5. Note that the Queen is great on d8 as it is eyeing the weak h5 pawn as soon as White try to move the h3 Rook. ",
        "17. b3": "For the next two moves White is securing his king's hole",
        "17... Bb7": "There begins the long Bishop's journey to b5...",
        "18. Kb1 Bc6 19. Nb2 Bb5 20. Bd3 f5": "Apparently closing the gates for a future White attack, but in fact it is a false impression.",
        "21. Rg1": "Very good and essential move",
        "21... Rac8 22. Bf1": "This move came as a relief for me. Had White continued his idea initiated by his last move and played 22.g4! he would have possessed all the trumps for a raging attack on my King.",
        "22... Nc5": "Now it is a question of time. The arrival of a Knight on e4 will spell an end to any Advantage for White in the Classical French. ",
        "23. Bd3 Ne4": "There it is...",
        "24. Bxe4": "The threat of 24...Nc3  helped this exchange bringing one passed pawn in the center.",
        "24... fxe4 25. g4 Rxf4 26. Qe3 Rff8 27. Qg5": "White was in a difficult situation, with a pawn less and no more concrete threats on my King. But here the Queen is going to far...",
        "27... Rxc2": "I just saw that my Queen will take on a2, and then my Rook will check the King on c8 and that the White King will have to defend against a Queen, a Rook, a Bishop and 2 passed pawns. Also the Rooks are laying not protected on the back of White's camp.",
        "28. Kxc2 Qxa2 29. Qd2": "Perhaps not the best move but the position was not defensible.",
        "29... Rc8+": "Threatening mate on the first rank, so the returning of the material invested is forced.",
        "30. Rc3 bxc3": "Loses at least one more piece, so White resigned. I was quite lucky to win this. Has my opponent followed up 21.Rg1! with 22.g4, I will have had all the trouble in this game. As the Sicilian, the French is a strategical and sexy defence where one misstep can spell quickly the end for one of both sides."
    },
    "url": "https://gameknot.com/annotation.pl/classical-french-defence-steinitz-variation-opposite-castling?gm=14357",
    "gameName": "Classical French Defence - Steinitz Variation - opposite castling",
    "players": "nightlooser (1619) vs. ifuinsist (1638)",
    "opening": "French (C11), Steinitz, Boleslavsky variation"
}