{
    "moves": {
        "1. e4 c5 2. Nf3 Nc6 3. a3 e5": "Sicilian Defense. I didn't know what to make of 3. a3 (heck, maybe that's a main line for white that I don't know) so I just forged ahead on general opening principle.",
        "4. Bc4 d6 5. O-O Bg4 6. Nc3 Nf6 7. Bb5 a6": "Pawn Steamroller. I had my eye on chasing away the knight at c3 so I could win the pawn at e4.\r\n\r\nI should have paid more attention.",
        "8. Ba4 b5 9. Bb3 b4": "? I really hadn't thought about white counterattcking my own knight. White keeps me reeling for a quite a while after this dubious move.",
        "10. Ba4 Qc7 11. Nd5 Qb7": "Not 11 .. Nxd5? because after 12. Pxd5 there is no escape for black's pinned knight at f6.",
        "12. axb4 Nxe4": "Not 12. ... cxb4 because 13. Nxb4 let's white put two minor pieces on the black knight at c6. I would have to bring back my bishop with 13. ... Bd2 which feels like undeveloping. Black couldn't play 13. ... Qxb4 because of 14. Bxc6  and 15. Bxa8.",
        "13. bxc5 Nxc5 14. Bxc6+ Qxc6": "After all the exchange, white lets up a little of the pressure he had put on black, but my plan to come out a pawn ahead has fallen very flat.",
        "15. c4 e4": "Well, I didn't get to win the pawn at e4, so I attack the pinned knight. This move doesn't really work, because white has 16. Ne5 or 16. Nd4 to threaten the black queen. It looks like an even exchange, with the added threat that black's queen is the only defender preventing white from playing Nc7  followed by Nxa8.",
        "16. Qe2 O-O-O": "The pinned pawn can't take the knight yet, but it doesn't seem to be going anywhere. However, white still has Ne5 (prevents black from playing Qd7).",
        "17. Ra3 exf3": "White missed his chances to save the knight so it's time to take it. To be fair, I hadn't considered the counterattack option myself or I would have taken it sooner.",
        "18. gxf3 Be6": "Wanting to dislodge the knight from its camp in my territory.",
        "19. d4 Nd7": "Not 19. ... Bxd5 because after 20 Pxd5 black has two threatened pieces and can only save one. Athough, up in material, trading a bishop for two pawns wouldn't be a game breaker, but it's best to be avoided. If I had known what those pawns had in store for me later, I might have seriously considered liquidating them.",
        "20. c5 Bxd5": "I couldn't resist that free knight. It almost cost me the game. White has a decent attack forming, and those white pawns will be key players.",
        "21. Bg5 Nf6": "This turns out to have been a dubious move. I was thinking along the lines of 22. Bxf6 (to break pawn structure) Pxf6 23 Qxa6 Qxa6, 24 Rxa6 Rg8  25 Kh1 Bxf3  . Or some other variation involving a rook on the open G file if white exchanged with 22 Bxf6.",
        "22. cxd6 Re8": "White doubled his pawns on the D file. I figured I had the material to take them whenever I wanted. I was hoping to nudge him into setting up the checkmate I described previously. Which is precisely what he did (or at least the first part of it. Bxf6 is also required).",
        "23. Qxa6+ Qxa6 24. Rxa6 Bxf3": "The plan is underway. Now I expect white to chase my king around for a while but once I get him out of danger, maybe I can find that checkmate. However, I began to notice that now white as both rooks in powerful places (or soon will) and they support his pawn advance against my one rook. My other rook and bishop are on their starting squares with nowhere to go. There are a lot of variations from this point that end up with white promoting his advanced pawn, or forcing black to give up material to prevent it. I'm working out variation after variation and they're almost all bad for black - I have to play very carefully here.",
        "25. Rc1+ Kb7": "25. ... Kd7 looks like it might have cost me a whole lot of material, and might have ended up with white promoting his pawn after 26 Rc7 . So I thought I might prevent the issue by threatening his rook on A6. If he tried 26 Rc7  Kxa6 then any pawn or rook move that doesn't put black in check allows black to play Re1  .",
        "26. Ra3 Bd5": "After 26 Ra3 I was suddenly very afraid. Everything I was considering ended with white playing Rb3  and Ra1  . I condisdered Nd5 so I could block the checkmate but that would cost me my bishop. I almost didn't see 26 ... Bd5 until the last moment when I was about to play Nd5. I guess I was panicking a bit, after all the variations I had been running through where white promotes pawns or crunches half of my pieces. \r\n\r\nLesson learned: panic is bad...",
        "27. Rc5 Re1#": "Out of the clear blue sky. I was expecting some effort by white to double his rooks and try to promote his pawn. It was so annoying that we were approaching 30 moves and my bishop was still sitting on his starting square, locking my rook on his starting square too. And then white completely forgets about his bank rank. Maybe that hole at g2 lulled him into a false sense of security.\r\n\r\nWhat I didn't expect was white to leave his back rank unprotected."
    },
    "url": "https://gameknot.com/annotation.pl/clear-blue-sky?gm=20707",
    "gameName": "Clear Blue Sky",
    "players": "jmbr (1195) vs. blake84120 (1354)",
    "opening": "Sicilian defence (B30)"
}