{
    "moves": {
        "1. e4": "Hi everyone!\r\n\r\nA great start to my weekend with a victory.  This victory nicely rounds off my inter-continental mini-tournament in which I finished with 6 points out of 8 games with 4 wins and 4 draws so nice to come out unbeaten in a mini-tournament!  In this game an early tactical shot wins me the exchange, then up an rook for pawn and then more, in other words my advantage snowballs until I am more than 10 points up in material, but my opponent does not wave the white flag.  This means I have to work out a way to checkmate him.  Well, I think the Master Mater's lessons and encouragement to do some puzzles has come in very handy here and there will be a nice puzzle for you to solve at the end.  We start with a double king pawn opening, e4 e5.",
        "1... e5 2. Nf3 Nc6 3. Bb5": "3. Bb5 - I play the Ruy Lopez against him - I seem to have scored quite well with it in my personal db so if I get a double king pawn opening and Nc6 in a rated game I will play this.",
        "3... Qf6": "3. ...... Qf6 - unusual.",
        "4. Nc3 Bb4 5. Nd5": "5. Nd5 - recommended in the db - strong move, hits out at the Wicked Witch of the West and threatens Nc7+.  The Witch moves to d6.",
        "5... Qd6 6. c3 Bc5 7. d4": "7. d4 - hits at the black dsb and opens up the diagonal for Fou Lenoir.",
        "7... exd4 8. Bf4": "8. Bf4 - develops and attacks the Wicked Witch.  Notice how Fou Lenoir is defended by the knight on d5!",
        "8... Qg6 9. Nxc7+": "9. Nxc7+ - black's last move threatened my g and e pawns.  As it is check I can ignore the threat for just one move and grab the c7 pawn.  Pretty violent stuff here, eh?",
        "9... Kd8 10. Bg3": "10. Bg3! - screens off the g2 pawn from the Wicked Witch.  My e4 pawn is hanging but I anticipate the Witch picking that one off.  Note that the rook on a8 is still vulnerable to a Nd6+ exchange winning discovery should he choose to move to b8.",
        "10... Qxe4+ 11. Qe2 Qxe2+ 12. Kxe2": "12. Kxe2 - queen trade.",
        "12... d6 13. Nxa8": "13. Nxa8 - the a8 rook is now toast.",
        "13... Bg4 14. Bxc6": "14. Bxc6 - I have a little plan for maintaining a huge material advantage here.  Firstly I exchange Fou Leblanc for the horsie on c6.",
        "14... bxc6 15. b4": "15. b4! - Secondly, the black dsb is trapped, well, not exactly, he can move to b6 but I will then trade my knight on a8 for it and be a whole rook up.",
        "15... Bxb4 16. cxb4": "16. cxb4 - pawn trade.",
        "16... Kd7 17. Kd3": "17. Kd3 - breaks pin and attacks passer on d4.",
        "17... Nf6 18. Nxd4 Rxa8": "18. ....... Rxa8 - the knight on a8 falls but I am still nearly a whole rook up.",
        "19. f3 Bh5 20. Rac1": "20. Rac1 - attacks pawn on c6.",
        "20... Nd5 21. Nxc6 Bg6+ 22. Kd2": "22. Kd2 - I choose this square for Henry in order to avoid annoying checks from the black horsie.",
        "22... f6 23. Rhe1 Bf7 24. a3": "24. a3 - consolidation - supports b5 pawn and avoids an attack from black's lsb.",
        "24... Nb6": "24. ..... Nb6?? - this move really opens up the Hoover Dam to my e1 rook here.  He steems off down the e file onto e7 for a really nasty check which will pick up the hapless lsb on f7.",
        "25. Re7+ Kc8 26. Rxf7": "26. Rxf7 - and this is just for starters!",
        "26... Nd7 27. Ne5+": "27. Ne5+ - this move will ensure more black wood is shed!",
        "27... Nc5 28. bxc5 dxe5": "28. ...... dxe5 - knight trade.",
        "29. Rf8+ Kb7 30. Rb1+": "30. Rb1+ - this move really sticks the knife in, now the rook on a8 is toast.",
        "30... Kc6 31. Rxa8 Kxc5": "31. ...... Kxc5 - the BK gobbles up my c5 pawn.  He ain't gonna wave that white flag, is he now?!  I must therefore work out how to checkmate him.  Ah, first things first, I must ensure that the BK does not sequester himself behind his pawn shield.  Ah, very easy that, simply move my a8 rook to the d column.  The BK is all alone.  Ah!",
        "32. Rd8 a5 33. a4": "33. a4 - ending hopes of getting a passer here.",
        "33... Kc4 34. Rc1+": "34. Rc1+ - I have just worked out how to nail him now.  A lawnmower mate perhaps?",
        "34... Kb3 35. Rb8+ Ka2": "35. Ka2 - the BK is now restricted to the a column.  Now how do I find a mate here.  I know ......",
        "36. Kd1": "36. Kd1 - ....... space clearance!",
        "36... h5 37. Be1": "37. Be1 - black now finally resigns after I announced mate in 3.  Now, I leave it to you to send me your answers in a pm.  Spot the checkmate!"
    },
    "url": "https://gameknot.com/annotation.pl/clean-up?gm=24964",
    "gameName": "Clean Up!",
    "players": "jstevens1 (1783) vs. -genius- (1571)",
    "opening": "Ruy Lopez (Spanish opening) (C60)"
}