{
    "moves": {
        "1. d4": "My club mates know full well that I am a master at the caro-kann. So no doubt they played 1.d4 to avoid it. However, can they avoid playing into the benoni system which is another favorite of mine?",
        "1... c5": "My whole idea here was to play with their head and keep them guessing as to what my ultimate goals were. Truth be told I was heading by way of transposition to the benoni at this time, but later on I had to switch my plans to a grunfield system. One of the hallmarks of a master is to be flexible and don't tip your hand too quickly. All ways play moves that keep your opponent guessing as too what your planning. Having said that, it is not a license to play stupid and unsound moves. 1...c5 though off beat is logical and sound because it challenges the centre and creates an immediate threat to win a pawn. Whereas, a stupid move like 1...a5 does absolutely nothing. ",
        "2. d5": "Perfectly playable for white is 2. dxc5 expecting 2...Qa5+ winning the pawn back. The idea of 2.d5 and why I think it is better is that it gives white long term strategic benefits. Whereas in the 2. dxc5 white is simply exchanging a center pawn for a wing pawn which may not be so good later on. ",
        "2... g6": "One consequence of the white pawn on d5 is that the long dark diagonal is free for black to use. It will be almost impossible for white to shut out the black bishop. Strategically my plan is to fight for control of e5 and d5. The first step is to gain control of e5 in order to ensure a draw. It is important to note that in fianchettoed positions like this one it is critical for black to maintain the balance on the central dark squares. This is why you will often see black try to exchange his LSB for white's f3 knight. As doing so limits white's ability to fight for e5. ",
        "3. Nf3 Bg7": "All too often I see lower rated players play ...g6 without the immediate ...Bg7. This is wrong! if you play ...g6 then you should play ...Bg7. Otherwise what is the point of ...g6! ",
        "4. e4 d6": "In such positions black often benefits from delaying the development of the kings knight. In this game I intend to get my knight into the game via e7 or h6. The idea is to plan and prepare for f7-f5 attacking white's weak e-pawn. Of course that is a long ways a way from now. ",
        "5. Be2": "Bd3 is much more popular these days as it is believed that white has nothing to fear from a potential ...c5-c4 by black. However, again white(the club) chooses the path of long term gain over immediate return.  Which in my books is the best way to play chess. ",
        "5... e6": "An almost necessary move that attacks white's center and gives black room to complete his king side development. Which is all part of my master plan to create a king side pawn storm. But for now I am following through with my plan of keeping my card close to my chest. For all my opponents may know are that I maybe expecting 6.c4 with the hope of transposing to favorable benoni systems. If 6. dxe6 then 6...Bxe6 give black the strong active bishop pair.  ",
        "6. c4 exd5": "forced",
        "7. exd5": "now white avoids the benoni system at the cost of a strategic disadvantage in the center. However, what white gets if he can use it is a long term space advantage. ",
        "7... Nh6": "Here I was hoping to surprise my club mates again as surely ...Nf6 is better right! Well they are probably right. As there is the possibility that the knight can get shut out on h6. However, I was dreaming of two knight standing side by side on e5 and f5! And at the bare minimum a powerful knight on f5 working beautifully with the DSB on g7.    ",
        "8. Nc3 O-O 9. Bf4": "A tricky move that hinders my ultimate plans of a knight on e5. Not only that the defense of d6 can be a bit tricky to handle for unprepared black players. I of course am very adept at defending d6. ",
        "9... Bg4": "This move is preferred over ...Re8 for two reasons. First it has the direct threat of BxN giving me greater control of e5 as stated at the beginning. Second, ...Re8 allows white to play Qd2 forcing the premature ...Nf5. Why premature because the knight can be kicked with the likes of a prepared g4 and saddles black with a bad bishop on c8. ",
        "10. O-O Nf5": "Now that ...Bg4 has been played I do not have to worry about a bad bishop on c8. These little details are what masters think about. Had I played ...Re8 white can force black to play ...Nf5 hindering his LSB development. ",
        "11. h3 Bxf3 12. Bxf3": "White gains the strategic advantage of the bishop pair which may be important later on. However, right now the position favor knights as the center is closed and the position is getting congested. Also note that white has played h3 which may seem insignificant but to a master a small pawn move in front of the enemy king may be all he/she needs to deal a decisive blow. ",
        "12... Re8": "Rooks belong on open files. ",
        "13. Ne4": "White finally gets around to attacking ...d6. Which should never be taken lightly. Of course, I had seen this threat all the way back at move 9. Which is why I played 11....Bxf3 and ...Re8 so that I can interpose my bishop on e5. Directly meeting the threat head on! Also at the same time I am thinking that there is a possibility of ...Nd5 followed by ...f5 with tempo. But I am getting ahead of myself. ",
        "13... Be5 14. Qd2": "14. Bxe5 is met with ...Rxe5 with a slight advantage to black. ",
        "14... h5": "This is what you call a prophylaxis move. It prevents any future possibilities of  white exchanging his bad light bishop for black's strong knight. Second, it is the infant step of a long series of small pawn moves on the king side that set the stage of a spectacular finish. ",
        "15. Rae1 Nd7": "Developing a piece and if white dares to exchange on e5 then black's knights will rule the known world!",
        "16. Bd1 Nf6": "improving the position of the knight and directly threatening the knight on e4. So white has to move it. ",
        "17. Ng5": "A nice idea that sets up an very good tactic later on. ",
        "17... b5": "I am in a bit of a small hole and am trying to keep white distracted. The idea is to draw away a center pawn from the center thereby creating a weakness on d5. I willingly go down a pawn(albeit the pawn is a double pawn) to force white to play defense. ",
        "18. cxb5 Kg7": "Getting all my pieces into the game. And yes! even my king has to pull his own weight. Here he defense the holes on f6 and h6. More importantly h6. It also clears the back rank for the future possibility of a rook going to h8 if the h-file opens on in the future. Maximizing your piece potential is a big part of master level chess.    \n",
        "19. Bxe5 dxe5": "A weird pawn structure. That white D-pawn passer concerns me but if I can get my king pawns going. It is white who will wake up tomorrow wondering what happened! ",
        "20. Bb3": "White is obliged to defend d5. ",
        "20... Rc8": "directly threatening ...c4 with the purpose of making the white bishop a glorified pawn. ",
        "21. Bc4 Rc7": "I got a pawn on e5 that is ready be pushed. So this rook is going to e7. ",
        "22. b3": "White is in a bit of wait and see mode. ",
        "22... e4": "threatening ...e6 after Re7. ",
        "23. Qc3": "nice move by white that sets up a beautiful deflection tactic on f6.  ",
        "23... Rce7": "Nothing I can do on f6 so I setup a threat of my own on the e-file. ",
        "24. Nh7 Kxh7 25. Qxf6": "Nice combo. ",
        "25... Qb6": "only move! when defending it is best to exchange queens. ",
        "26. Qc3": "I thought that 26. Qc6 was white's best chance to fight for a win. ",
        "26... Qd6": "Improving the position of the black queen and blockading d5. For now the threat of d5-d6 is not available to white. Though he has a lot of hope with a4-a5. However, white's pieces are not as harmonious as black's they are less centralized and the black knight is far better than the white bishop. The position is very dynamic and increasing in complexity. Which favors the stronger player. ",
        "27. a4 f6": "Like 14...h5 this is one small step leading to a fantastic finish. The point is that black now threatens to play ...g5 with strong initiative ",
        "28. a5": "White has to maintain their active play on the queen side. But I wonder are they aware of the danger lurking on the king side?",
        "28... Kg7": "Why ...kg7? Well I am betting that after ...g5-g4 the h-file is going to open. At which point I plan to plant a rook on it!",
        "29. Re2 Nd4": "Leads to a draw but ...g5 is no better. ",
        "30. Re3 g5": "This is it the moment we have been waiting for! After all the positional jostling I finally lay down the gauntlet. I knew that this was drawn with best play by white but there were many landmines that white has to avoid. What makes this a difficult position for white to play is that they are really quite passive and uncoordinated. Verses black who has greater influence in the centre, harmonious piece play and active pawns.   ",
        "31. Qc1 Re7e5": "Avoiding the immediate draw...g4 fails to 32.Rc3 Re5 33. Re1 Rg5 34. Kh1 Nf5 35. Kg1 Nd4 and repeat",
        "32. Rfe1 Nf5": "Avoiding the draw again after ...g4",
        "33. Rc3 e3": "very complicated and dangerous move by black. ",
        "34. fxe3 g4 35. h4": "When I saw this move my heart started to skip a bit. It was the small mistake that I was looking for. Though it does not lose the game as white has to make further mistakes it does give black a dangerous pawn majority on the king side. I actually felt that 35. b6!? axb6 36. axb6 Qxb6 37. hxg4 hxg4 38. Qd1 Re4 39. d6 was enough for a draw.  ",
        "35... Nxh4 36. Qd2 Nf5 37. Qf2": "hitting at f6 and defending e3",
        "37... Qd8": "defending f6. I also plan to reorganize the queen to ...e5 via e7. ",
        "38. Rd3 Nd6": "preventing d6 and threatening Rf5",
        "39. Ra1 Re5e4": "This was instinctual to me as ...f5 felt premature. Also e3 is a serious weakness and if I can play ...Qe7 followed by ...Qe5 white may have a real hard time stopping the pawns. ",
        "40. Rc3": "?! the fatal flaw. White either did not understand the power of ...Qe7 and ...Qe5 combined with the connect king side or did not see it. The drawing move was 40. b6 I think distracting black from his plans",
        "40... Qe7 41. Rf1 Qe5": "This is why Rc3 was so bad. As it is now under attack. ",
        "42. Qe1 h4": "The last bastion of the white king's pawn wall is about to get destroyed",
        "43. Bd3 h3": "It has been a very long journey for the little black pawns but they come up big! As I tell all my chess students, queens do not win games pawns do!",
        "44. Rxc5 hxg2 45. Kxg2 Rh8": "finally 28...Kg7 makes sense",
        "46. Rc7+": "spite check",
        "46... Nf7 47. Qg3 Qxg3+ 48. Kxg3 Rxe3+": "wins the bishop and the game. ",
        "49. Kg2 Rxd3 50. Rxa7 Rhh3 51. a6 Rdg3+ 52. Kf2 Rgxb3": "white resigns as black will just continue to eat pawns for lunch. thanks for reading and please comment. "
    },
    "url": "https://gameknot.com/annotation.pl/club-verses-elyhim?gm=56607",
    "gameName": "Club verses Elyhim",
    "players": "caveman1960 (1817) vs. elyhim (2481)",
    "opening": "Old Benoni (A43), Franco-Benoni defence"
}