{
    "moves": {
        "1. e4 a6": "The least common opening I've seen so far, but it's book, and so far, there is no concern of a mistake.",
        "2. Nf3 f6": "Once I puzzled together what Black was trying to do, I decided that I have no problem with central advancement.",
        "3. d4 g5": "Analysis advise Black to play 3...e6 instead, but I am concerned about Nxg5 on move 4 like analysis wanted me to. Analysis abhorred my next move.",
        "4. Bc4": "Confusing story #1: Analysis called this a blunder, but yet, 4...d6 5.d5 gives me further control and if 4..b5, I won't mind moving my Bishop to d3. If I played 4.Nxg5, sure, it would pin Black's pawn to his Queen, but like in the Damiano Defence, what is the logic of taking when it causes the loss of a win? Which side should I be more concerned about?",
        "4... e6 5. Nc3 b5 6. Be2 c6 7. e5": "That finicky analysis said all these moves were mistakes or blunders. I can't believe it! The only thing I'm concerned about is this game and how Black responds to my moves, and that's how mistakes are born.",
        "7... h6": "I don't know how Black is going to get away with this move, but it's okay.",
        "8. Qd3 f5 9. g4 f4": "Mistake. The aftermath is actually very frightening for Black.",
        "10. Qg6+ Ke7 11. Nxg5": "A sacrifice for even material would be great (of course, Black takes with his h-pawn).",
        "11... hxg5 12. Qxg5+": "It's easy to figure out what Black is going to do because Black thinks that my plan is no where in sight (the plan is right in front of him).",
        "12... Nf6 13. Qxf6+ Ke8 14. Qxh8": "Black's in Danger Ave., but so am I. Black's knight is stuck there at b8 with nowhere to go and his LSB can only go to b7. Analysis thinks that this was a blunder and to have done 14.Qg6+ in which I can bring my DSB into the scene.",
        "14... b4": "I had a chance to play the game of \"check\", but I selfishly cared about my threatened piece.",
        "15. Na4 a5": "Same thing, but only this time if I moved my Queen to h5, I would trigger a 10 move mate!",
        "16. g5 d5 17. Bh5+": "3 move mate plan: 17.Bh5 Ke7?? 18.Qh7+ and the rest is a piece of cake.",
        "17... Kd7": "I was determined to end the game, but I wasn't thinking hard and I was not considering to bring my other pieces to the action.",
        "18. Bxf4 Kc7": "I have lost my critical advantage and I struggle through the game.",
        "19. Qh7+ Nd7 20. Bg4 Qe8 21. O-O-O": "I could have resumed from my lost advantage with 21.g6.",
        "21... Kb8 22. g6 Ra7 23. g7": "Wrong idea. The right idea: 23.Qg8.",
        "23... Bxg7 24. Qxg7": "I judged too much about my strongest advantage, but here, I helped out...my enemy!",
        "24... Nb6 25. Qh6 Nxa4 26. b3 Nc3": "Only now did I care about losing the advantage. I, throughout the game, develop a plan to start up another one, but every time I do so, I only receive interruption. ",
        "27. Rdg1 Nxa2+ 28. Kd1 Nc3+ 29. Ke1": "I created a brief break to do what I want to do.",
        "29... Ne4 30. Bh5 Qd8 31. Rg7 Qh4": "Here's my problem: I keep moving the wrong piece. Fortunately, Black's only chance for an advantage, is too risky for even his good position right now!",
        "32. Rg8 Qxf2+ 33. Kd1": "Black just cannot accomplish delivering the final blow to my king!",
        "33... Qxd4+ 34. Kc1 Nc3": "Remember readers: Don't carry out an advantage too much like we did. Let all of your pieces join the fight before it's too late!",
        "35. Qxe6": "By the time I played this move, I realized I created another advantage, this time, more fatal. Still, analysis believes this to a mistake. Why?",
        "35... Qxf4+": "Black lost his target believe it or not.",
        "36. Kb2 Rc7 37. Bg4 Kb7 38. Rxc8": "Black's only chance is to maneuver the sleeping knight to b5, but his knight wouldn't quit and became too lazy to defend.",
        "38... Rg7": "Forced win in 2!",
        "39. Qxc6+ Ka7 40. Ra8#": "Like with the previous annotation, I did not like this chaotic game. This game got a nickname (this goes for my previous annotation too). The nickname: the \"Lazy and Sleeping Knightmare\" game. I hope you enjoyed this anotation."
    },
    "url": "https://gameknot.com/annotation.pl/clumsy-advantages?gm=40320",
    "gameName": "Clumsy Advantages?!",
    "players": "chesskingdom64 (875) vs. bird45 (1012)",
    "opening": "St. George (Baker) defence (B00)"
}