{
    "moves": {
        "1. e4 e5 2. f4": "The initial set up of a themed mini tournament. White had better know what he's doing, as the KG often leads to quick action, and he has a potentially weak kingside.",
        "2... exf4": "I feel this is the most aggressive way to deal with the KG. Let's see if white is on his toes......",
        "3. d3": "?! 3. Nf3 is probably the better route. By trying to regain the pawn immediately, white hinders his LSB while allowing the brutally strong........",
        "3... Qh4+": ".....which gives black all kinds of attacking chances.",
        "4. Kd2": "4. g3 loses two pawns and decimates white's kingside. White chooses to start running.",
        "4... Bc5": "Claiming more dark squares around the enemy king.",
        "5. Qe1": "White desperately attempts to repel the invaders at a cost of a pawn. White is attempting to ease the pressure by exchanging queens, which may just be a good idea in theory in this particular situation, even though he is temporarily down in material. Black's c pawn is not totally immune from danger yet. However, black is not obliged to accept this offer, and responds.......",
        "5... Bf2": ".....deflecting the white queen back to the light squares, which is a nice tempo gain in furtherance of bringing another piece in to the fray.",
        "6. Qe2": "?! The white queen is about to be in a world of hurt. 6. Qd1 was better, as 6...d6 7. Be2 starts to get white untangled. Now she is two moves away from being a target.",
        "6... d6": "Threatening Bg4 trapping the white queen.",
        "7. Nh3": "!? Very creative. White sees 7...Bg4 8. QxB QxQ 9. NxQ.",
        "7... Bxh3": "I figured out that Bg4 wasn't quite as sexy now, and decide to just press forward in my attack. I'm looking to double up his pawns on the a file and get my knights into action. Unusual game.....black hasn't made a knight move yet.......",
        "8. gxh3 Nc6 9. Qg4": "White still has the idea of trading queens rapidly to simplify his position, but black, of course......",
        "9... Be3+": "....wants to keep forcing tough decisions, and attempts to drive the king away from defenders.",
        "10. Kc3": "? Wrong choice. The apparent escape only seals white's fate. 9. Kd1 was the only play, and perhaps then some clearance captures for white. By playing 10. Kc3, white has opened himself up to an all-out assault.",
        "10... Qf6+": "This check simply serves the purpose of driving the black king closer to the edge. Notice how d2 is not available?",
        "11. Kb3": "It may be academic at this point, as I don't see any better move for white. ",
        "11... Nd4+": "Ouch....Once again, black is forced to evade.",
        "12. Kb4": "12. Ka3 Nxc2 !, and 12. Kc3 Nc6 !, as well as 12. Ka4 b5 ! all lead to pain for white as well. White has no good alternatives.",
        "12... a5+ 13. Kc4": "Walking into the pin would have lengthened the game a bit, and 14. Ka4 gets ugly also -  but just as well. Black now drives the point home.",
        "13... b5+ 14. Kd5": "White apparently has had enough......",
        "14... Qe5#": ".....and is euthanized. Not playing 3. Nf3 in the King's Gambit is just too unsound IMHO. Thanks for the game terribyte1!"
    },
    "url": "https://gameknot.com/annotation.pl/cmbermans-mini-tournament?gm=11562",
    "gameName": "cmberman's mini-tournament",
    "players": "terribyte1 (1296) vs. tag1153 (1445)",
    "opening": "King's gambit accepted (C33)"
}