{
    "moves": {
        "1. Nf3": "This is playable, though, not recommended at our levels.  That's because a certain someone, as well as, Jack Stockel and tactical-abyss said that 1.Nf3 is normal.  But, at our ratings, it shouldn't be the first move since it's more difficult to control the center.  However, you often see with the much more (2000+) rated players.  I do make note of it later.",
        "1... Nc6": "Not to use to seeing that move, I play this, as though, it were a Reti Defense since it starts off with 1.e4, Nc3.",
        "2. g3": "Mike Fianchettos.",
        "2... e5": "And, I advance a center pawn, as I'm preparing to continue developing and control the center.",
        "3. Bg2": "This gives Mike a nice long flank for his LSB.",
        "3... Nf6": "Mike: My opening is strutchered.",
        "4. O-O": "Joe: Not familiar with the name. But, I have played 1.Ne4 which is why when seeing it, I knew how to respond. It's not an inaccuracy, at all. But, my advice isn't to play it, yet. Yes, 1.Nf3 is a solid opening, but in general, more experienced players open with that. Before reaching a 1300, I was told to hold off on playing 1.Nf3.",
        "4... Bc5": "Mike: The one who showed it to me is a 2300. We play it well in blitzgames. I mess up in the eND game.  Joe: As you saw with our last game, endgames are very difficult.  They must be played accurately because one mistake, in that stage, will often make or break the game.",
        "5. d3": "Opening a line for his Bc1.  I was thinking about what he might do with his DSB, and figured out that he was going to pin my Nf6.  I asked myself, if I should allow that pin or try to prevent.  In the end, I decided to allow it since it's not serious, given that I can break with ...Be7  As my idea of a good time is getting the King to safety, at once.",
        "5... O-O 6. Bg5 b6": "Meanwhile, I'm treating this, as though, I were playing against the KID with this fianchetto.  Since, similar to my first game against elyhim and the game against Ken, being that I'm not used to this opening, I decide to experiment, as per reversion's advice when he told me to try different openings.  I also kept in mind that it didn't cost any more time to play this then advancing the d pawn.  If I did, I would've considered this an inaccuracy, and thus, wouldn't play it.  But, I don't see anything wrong with it when tempo isn't an issue.",
        "7. Nc3": "Completing his development, as do I since I'll have that nice long flank for my DSB.",
        "7... Bb7 8. Nh4": "I have no idea why Mike placed his N on the rim.  I almost felt like telling him that it was an inaccuracy but wasn't sure, in this position.  As I saw no way to gain tempo or make the N worthless, so I don't say anything.  It's per archduke_piccolo's advice because he told me that if you can't prove it be inaccurate you shouldn't say anything.  I agree with that because, were I to correct it, and it turned out to be wrong, then I'd wind up giving my students incorrect information which is a pet hate of mine.",
        "8... Be7": "Feeling, however, that it might be inaccurate but not wanting to take chances, I decided to break that pin at once.  I also asked myself if Mike might be having multiple threats with our last move since I'm starting to feel the same way that I did with Kenneth_fiore_3 which is pressure.  My opinion is that he might be coming up with threats.  If so, I was determined to stop it before that started.",
        "9. e4": "Opening up the other center pawn which gives him control of the center.  I also think that Mike intended to stop e5 from advancing which wasn't going to happen.  I analyzed a variation that I thought might fail, and now I'm glad that I'm thinking this way because of what Ken taught Sue in their first training session. I was originally thinking that if 8...e4, 9.dxe4, Nxe4  But, then I thought about what Ken told because that was only one variation, so I looked at two.  Which was, oh yes, but then, something else happened that would win a pawn because of 10.Nxe4  But, now that I thought this way, I've got to look at something even bigger and it was based on that game because I missed something even bigger which is similar to the mistake that I made against superandy.  And, that was, the loss of my Q for a B because Mike wouldn't have played 10.Nxe4, when he has the immediate 10.Bxd8 which would've come close to me resigning. ",
        "9... Nd4": "So, I decide to do something that Ken did in our game by putting pressure on him, so that, Mike wouldn't know what to do.  As we know, this is what pressure is all about.",
        "10. Nd5": "I figured out that Mike wants to exchange.  Now, this was before I asked GM Susan Polgar about the exchanges.  But, I felt that the N could pose as a threat, so I take, as at the very least, an exchange is forced here.",
        "10... Nxd5 11. Qg4": "Joe: ?? This is your first blunder as white now winds up a piece down. Therefore, best would've been to exchange with 11.Bxe7, and after 11...Qxe7 comes 12.exd5 where it remains even because I cannot then recapture with 12...Bxd5?? due to your Bg2 which would allow 13.Bxd5 losing a piece for pawn. So, black wouldn't have got anything for that. But, by playing this that changes.",
        "11... Bxg5": "Mike: I thought I blundered a long time ago.",
        "12. Nf5": "Joe: Up until the 11th move, you were free of errors.  In fact, I thought about that more and it sounds like you felt pressure and weren't sure what to do which is some of what chess is about. But, it caused you to get nervous when I played 10...Nxd5 My advice, based on what Jack said is, \"Don't get nervous.\" Instead, my model is to think of that pressure as an obstacle which then becomes a figuring out a way around and overcoming that obstacle.  It's also worth that because he's two pieces down, I will take advantage by forcing some liquidation.",
        "12... Nxc2 13. exd5 Nxa1 14. Rxa1": "Mike: I often go with my first instinct. The pressure seems to cause me to doubt and that makes it worse. Consider I have PTSD; triggers of being told not to doubt myself because it's not the right attitude  Life sucks. Chess helps me figure things out (somehow). Perhaps it has to do with algorithms  I just got pressured in another game. I thought about the best move. I doubted it at first and felt like crap  Joe: I was going to mention it as I know how you feel. In fact, what you mentioned has been a general problem for me. It's called going by instincts are acting on impulse. That is something, however, that you don't want to do. So, you're in a situation and ask yourself what to do. When not knowing how to handle, you just go by what the instincts tell you. The bad part is that it can be very costly. For example, in our last training game I played two fianchettos against the KID which got me into trouble, as kenneth_fiore_3 mentioned. A better example was something that happened in a game where I played against the Colle's System which boiled down to most common problem of not controlling the impulse to move which led to rushing, followed by my downfall. My advice is that when you want to play something, think about it and see if it really works. And, ask yourself what can get in the way of that move, as that's how you'll determine if it'll work or not. And, chess is helpful in life. So, figuring things out in the real world is what motivated to want to become a better player, which I later use that time to coach and mentor players like you as you can use some of that stuff outside of chess. And, as for the last paragraph, as this happened to me sometime ago which was later annotated, don't let a different game affect you. Yes, we all make mistake and the idea is to learn from them. But, don't get so upset with yourself that it affects another game. A way to remember is that every game is different. This is also helpful in life because, one time, I was distracted at work due to a blunder I made in a chess game. So, the idea is to think about what you've learned and how to prevent that mistake. It is, however, not a good idea to let it get to you, though.",
        "14... g6": "I looked at everything.  Despite not having threats against my monarch, this was played to force further liquidation, at the very least.  But, Mike made a mistake that's going to lose, yet, another piece.",
        "15. Nh6+": "Mike: I get more from chatting than reading outcomes, later.  Chess is psychological. One could handle so much pressure (for those in my caliber). I feel that in the pre-end game that I caculate where these patterns are going. It totally takes me away from the fun of it.  I put you in check so that I coud take your bishop that seems to be a free piece  Oops. I just noticed it's not free   Joe:  Yes, I was going to say that. What you were thinking is allright I'll play this because that check would force me to move the King which would lose a piece. A different student of mine had that problem. But, unless the move is forced, it's not, if I do this, he or she must do that. Instead, it's about asking what your opponent can do. And, then it boils down to what you might be missing. In this case, I can take the N. So, the lesson is to think about how that opponent is going to respond and really analyze. Not just analyze the board but going deeper is there might be things underneath that are more important. With that being said, best was either 15.Nh4 or 15.Ne3, after which, you exchange the N for B. It is liquidation, nonetheless, but it's better then losing another piece. Another example happened in my game against Jack Stockel. I made a move in which I thought I'd win his N with no way to protect in any variation. I overlooked one move that not only protected the N but won, as now, my King was exposed when he protected which enabled a quick mate.  I also agree that chess involves psychology, and it's good to calculate. But, similar to here, it's also important to be aware of the immediate threats.",
        "15... Bxh6 16. Qh3": "Mike: Moved the queen to an open file.  Joe: Which is generally a good idea.  What I think, to be truthful is that he should resign as there's, pretty much, nothing to learn.  But, I wasn't going to tell him that because my belief is not making my students feel rushed or uncomfortable.  I was worried that telling Mike to resign would do that.  So, I'm hoping, instead, that my student is ready and decides to resign which is going to happen but much later.",
        "16... Bg7": "One other thing is that I play with honesty which is similar to what Ken also believes.  And, that's not giving the student a chance to get anything back.  Once in a while, I've made that mistake, which on two occasions resulted in the student getting back his advantage, despite failing to win.  Out of those two times, I took a break from teaching chess for about a month to get more experience from Jack Stockel.  So, I'm not happy when it happens because I feel that it's still bad for learning.  Plus, I also view as the equivalent to giving them the wrong information which, as noted, is something that I try to avoid.",
        "17. Qg4": "Trying to mobilize his Q with B.",
        "17... d6": "In case, Mike had any plans to get a passed pawn or promote, I put a stop to that.  As noted in one of TA's games, part of keeping that advantage is not underestimating your opponent.  So, I'm also not taking chances here.  One of the reasons I think Mike by trying to get a passed pawn is due to his d5 being protect by his Bg2.",
        "18. Qf3": "So, I think that he's trying again since the Queen is near it.  But, it won't work.",
        "18... Qf6": "Getting into his thought process, I put a stop to that by threatening to liquidate Queens, since it's to my benefit.",
        "19. h3": "Mike: I need my Queen; both are protected. But I know that bishop on b7 seems to be a potential threat.  Joe: But, this move enables me to liquidate Queens, which is the goal. Better would've been to retreat it.  Mike: Again, that was my first instinct. Been getting some practice at the street chess thing.  Both Queens are protected.  After this, however, the chat stops.  And, I don't say anything else because archduke_piccolo told me not to be too critical when one has a forced win.  I agree with that because I don't want the student to feel uncomfortable.  In other words, I don't want their learning to be a bad experience.",
        "19... Qxf3 20. Bxf3 Ba6": "So, I threaten to win another pawn, since this was not protected by his Bf3.",
        "21. Rd1": "Not to my surprise, though, Mike protected by centralizing his Rook.",
        "21... e4": "In general, I don't give my opponent a chance to undouble his or her pawns.  But, this was played because once we exchange, I'm going to be closer to getting a passed pawn.  Now, it's about figuring out how to do it.",
        "22. dxe4 Bxb2 23. e5": "? I don't know why he played this, but it's another mistake as it'll lose a pawn.  In addition, although not right away, this is going to guarantee a passed pawn, as we will see.",
        "23... Bxe5 24. Rc1": "Threatening my pawn which I'll protect.",
        "24... Rac8 25. a4": "Advancing a pawn.  Maybe, he thought it was a passed pawn.",
        "25... b5": "But, this move shows that it isn't because my pawn is right next to his.  And, whether I exchange or not, once the white pawn is knabbed, I wind up with a passed.  But, saw something like this occurring, once Mike played 23.e5?",
        "26. Rc6": "Instead of exchanging pawns, he attacks my pawn.  So, I reattack his Rook with my attacked piece.  After that, though, I win a pawn and get a passer.",
        "26... Bb7 27. axb5": "?? I said that because this move is a blunder that enables me to get a Rook for B.  But, there are no good moves left which is why Mike should've resigned.  Yet, I didn't know how to tell him that without him feeling rushed.  I think the only one who knows how to say that is reversion since he explained in such a way that didn't make me feel rushed.",
        "27... Bxc6 28. dxc6 Rcb8": "So, I attack his pawn.",
        "29. Kg2": "Not sure why Mike played this, but I'll get another pawn.",
        "29... Rxb5 30. Be2": "Attacking my Rook.  But, it doesn't bother me.",
        "30... a6": "As this, is where I apply one of TA's method.  Similar to how he gives what some call, \"Queen odds\" I give Mike the Rook for my Bishop.  His Be2 was the only thing that was stopping my a pawn from promoting.  So, by letting him have my Rook for B, it is going to promote.  And, that's something that Joe was also teaching which, just because he gave something up or let his opponent get something back doesn't mean that he's going to lose.  And, I had a, somewhat similar exercise with GM Judit Polgar because there was a HW question based on a dream she has where JP gives up her Q.  And, when the opponent takes, it's mate.  Well, no mate yet, but it's very similar.  For once, he takes the Rook and I take his Bishop, my passed pawn will be killer.",
        "31. Bxb5 axb5": "And, this is where Mike is ready to resign.  He knows that I'll promote, and when that happens, it's mate.  Right after that, I gave him the moral to this game which is something that he told me about and we discussed earlier.  So, what I said was, the moral to that game is to not act on impulse. Instead, you want to take your time and when not sure, ask yourself and analyze all of the possibilities. This is going to help you become a better chess player. "
    },
    "url": "https://gameknot.com/annotation.pl/coaching-game?gm=61497",
    "gameName": "Coaching Game",
    "players": "pagmatic68 (900) vs. jkarp (1356)",
    "opening": "Reti opening (A04)"
}