{
    "moves": {
        "1. d4 g6": "This is the Grunfeld.  Though not irregular, it is an unusual opening, but this is the mainline.",
        "2. c4 Bg7": "Sticking with the mainline.",
        "3. Nc3": "So, Ken starts his development.",
        "3... d6": "And, this is a very interesting move by Sue as it opens up a line for her Bc8, even though, it is not in play, yet.",
        "4. Nf3": "Continuing his development.",
        "4... Nd7": "And, Sue develops in an interesting manner.  It would normally be an inaccuracy since the N is cramped.  But, in this case, it's a very solid move by black.  First, no good was, obviously, 4...Na6 and for the obvious reason.  But, more importantly, however, was 4...Nc6 which normally be, perhaps, the best move.  That, however, isn't so here because white played 1.d4, as opposed to, 1.e4  And, in 1.d4 openings, the N should not block the c file until the pawn has advanced.  Now, after the lesson with bhidragon on figuring out what the board was trying to tell me and not getting fixated on principles, I regarded it as irrelevant in one of charleshiggie's annotation.  But, in that instance, I misinterpreted.  As, the board was telling something, for that was the losing blunder, especially when black brought his N back to c6 without advancing the pawn.  It was later on that I found out that the c pawn was needed, and in blocking it off, charleshiggie had an advantage which he exploited and forced the win.  ",
        "5. e3": "Like with the Colle's System, London System, or KID this is also common.  In part, we have a pawn chain, but more importantly, as with black, there are good placed for his Bf1.",
        "5... c5": "I'm not sure why, but Sue wants to exchange c pawns.  As black, I would've played 5...Ngf6 with the idea of castling shortly after.",
        "6. Bd3": "With that being said, that is Ken's intention.  And, he is now ahead in development, but that doesn't mean anything for black's position, yet.",
        "6... Ndf6": "?! As she has brought her N to a better outpost.  But, better was 6...Ngf6 as castling is now an option.  Though, black is allright, white now has a space advantage with the gain of tempo.  That's because she'll have to move it back to in order to bring her other N to that square later, when she could've brought it there at once.",
        "7. dxc5": "Afterwhich, Ken goes for it by exchanging here.  I would've castled with 7.0-0, but have no problem with this move because his center is now opened up which gives white a lead in center control.  With that being said, white will castle, on his next move.",
        "7... dxc5 8. O-O Nd7": "Her intention is to develop her other N to that square with the idea of castling.  But, as noted it should've been left there, as 6...Ngf6 would've been possible right then and there.",
        "9. Qe2": "Not needing to worry about the DSB, Ken brings his Queen out at once.  I'm not sure what's happening now, but it is going to become pretty dangerous, later on.  That's especially because of the move that Sue will play at once with her next move.",
        "9... Ngf6 10. h3": "I wouldn't have even considered this move because it advances a pawn right near the K with no apparent reason.  But, I can see why as it was to prevent 10...Ng4.   However, there's more to this as meets the eye as white now has a dangerous plan against black.  It wasn't obvious to me, but I'll see the plan later on which is why this move plays an important role, as Sue must be very careful here.  Even slight inaccuracies can cost her the game here.",
        "10... O-O": "Meanwhile, like with Ken, Sue, gets her monarch to safety, at once.",
        "11. e4": "At first, I wondered why Ken played this.  But, he has a dangerous plan not just against the N but against black's pawn.  Now, even more then before, caution is essential.",
        "11... b6": "? Which Sue doesn't see, and it's her first error.  By that, I don't just mean inaccuracy, but it's a mistake.  As now, Sue will have to misplace her Knight on the rim to save her piece.  I'd normally just call it an inaccuracy, but a very similar position happened with tactical-abyss where he, once again, went out of book early and won.  I even think it was a Q sac, but if not, it was one of the others that I annotated where he moves his N out, and then, back to the original post, rather then following development.  But, one of the big mistakes from his opponent, however, was placing the N on the rim.  From there, Joe just left it there as it kept losing value until the opponent faced ruinous loss of material, which he resigned.  And, now a similar pattern will happen with Sue, if she defends accurately.  Thus, best was 11...Ne5 to prevent what Ken is about to do.  Worth noting was that seeing this line, 10.h3 was played keeping in mind that 11...Ng4?? is no longer an option.",
        "12. e5 Ne8": "?? So, she moved it back here.  But, in doing so, Sue will lose material with white's next move as 13...Rb8 is forced to prevent the immediate loss of a piece.  However, she will still go down a piece in a couple of moves afterwards, which will give Ken a winning advantage, at this point.  So, best, as noted above, was 12...Nh5.",
        "13. Be4 Rb8 14. Rd1": "As this does more then just centralize his Rook.  That's because black's Nd7 is indirectly pinned with this move.  And, in doing so, he will add another attacker which is how white is about to win a piece for a pawn.  That's because 14...Bxe5 is forced, which gives white the piece.  But, if she doesn't take on e5, 15.Bc6 gives white a free piece.",
        "14... Bxe5 15. Nxe5 Ng7": "Redeploying her N, but Ken forces another exchanges, which will tie down black's Bc8.",
        "16. Nxd7 Bxd7 17. Bc6": "That is because of this move.  As now, not only is her Bd7 pinned, but there is another attacker to it which leaves it trapped.  Now, if black doesn't take, 18.Bxc6 is another free piece.  When she does take, however, black gets a Queen for a Rook and pawn.  Therefore, she's in just as much trouble.  Either way, white is lost here.  However, I think she does the right thing by not resigning yet, as there is still more to learn, similar to my first game against him.",
        "17... Bxc6 18. Rxd8 Rfxd8 19. Qxe7 Rde8": "Trying for counterplay, Sue attacks the Queen.  And, not to my surprise, not only does Ken protect, but he goes after her B which she then is forced to protect.",
        "20. Qc7 Bb7 21. Bh6": "Going for further liquidation, by attacking the N.",
        "21... Kf8": "I do not know why she played this, as 22.Qxf7+?? would not work out for white.  I believe that Sue was worried about which I was back then.  But, Ken doesn't have a Rook near it yet, leaving black with an attacker against a defender.",
        "22. Rd1": "Not to my surprise, this was played, as Ken is about to bring another attacker.",
        "22... Kg8": "I can understand this move, as it appears to be mate after something 23.Rd7, followed by 24.Rxf7+, at the very least, winning another piece since after 25.Rxg7, black cannot take back as it would be an illegal move.  But, with this move, white further liquidates.  Therefore, I would've 22...Rbd8 with idea of Hope Chess.  I'd be hoping that white wouldn't see the opportunity.  With the idea that, maybe, you exchange N's and then, mate with 23...Rxd8+, with the idea of 24.Rxd8, Qxd8# which would win a lost game.  But, I'd come to the realization that this wouldn't work since white would exchange with 23.Rxd8, first, and then exchange N's with the same effects.  But, in this position, I can't think of anything better then Hope Chess since white is busted because I wouldn't be ready to resign yet, since there still appears to be more to learn.  ",
        "23. Bxg7 Kxg7 24. Rd7": "Now only that, but Ken is trying to threaten mate.",
        "24... Ref8": "Which Sue Stops for now.",
        "25. Nb5": "So, Ken adds another attacker.",
        "25... a6": "Not sure what Ken is trying to accomplish, Sue attacks which I can understand as that's how I used to think.  ",
        "26. Nd6": "But, with this move, however, Ken's attack is overwhelming.  At the very least, he is going to win more material.  However, it's about to take a turn for the worst. ",
        "26... Kf6": "Not sure of what's going on, Sue moves the K as it is attacked.  But, 26.Nd6, was more damaging then one could ever imagine, as we're about to see since he's going to win another pawn and piece.",
        "27. Rxf7+ Rxf7 28. Qxf7+ Ke5 29. Nxb7 g5": "As black, I would resign here, as now, I'd feel that there's nothing else left to learn since Sue is too far down.  But, I can understand her intentions to stay in since I used to believe, and thus, would not resign until mate was forced which will happen here.",
        "30. Qc7+ Kd4 31. Qxb8 Kxc4 32. Qe5 Kd3 33. Nd6 Kc2 34. Qc3+ Kb1 35. Nc4 Kxa2 36. b4 cxb4 37. Qb2#": "The moral of this game is something that I learned from chesskingdom64 which I used to annotate a couple of games.  But, it applies here Sue, and remembering this will help you to become a better player since I have problems with this myself.  Well, first is to be prepared for common openings like this.  What goes into it, however, as he said was, \"The openings must be used with the greatest care.  What you do in the opening will affect you in the midgame; what you do in the mid game will affect you in the endgame; what you do in the endgame will affect the final results.\"  With that mistake in the opening, Ken was able to tie down your pieces, and thus, win material which is what enabled white this win."
    },
    "url": "https://gameknot.com/annotation.pl/coaching-game-3?gm=61897",
    "gameName": "Coaching Game 3",
    "players": "kenneth_fiore_3 (2198) vs. knightrider62 (925)",
    "opening": "Beefeater defence (A40)"
}