{
    "moves": {
        "1. e4 e5 2. d4 exd4": "!? - An interesting opening choice by Coach Adams. The Center Game is an old opening. It was mostly abandoned by 1900 because no advantage could be demonstrated for White.",
        "3. c3": "This introduces a Danish Gambit variation.",
        "3... d5": "According to the ECO, this is classified as the Soerensen defence. Hard to pronounce (for me at least), but I find the coach's choice of opening against me very interesting. Of course who am I to question what a higher rated player is thinking?\n",
        "4. exd5 Qxd5 5. Qxd4 Qxd4": "And by move 5, the queens come off the board.",
        "6. cxd4 Nc6 7. Bb5": "Protecting d4 by pinning the knight. A lot of beginners who play like this miss the mistake of allowing white to push the pawn and being down material.",
        "7... Nge7": "But that's not me. A seasoned veteran of the game myself, I stop the pawn advance, protect my knight at the cost of blocking my bishop on f8. ",
        "8. Ne2 a6 9. Ba4 Bg4": "Alternative: 9...b5?! 10. Bb3 Nf5 11. Be3 Bb4+ 12. Nbc3 Na5 13. Bd5 c6. I don't like this variation though, as this at least gives me the option to castle if I feel the need to go queenside.",
        "10. Nbc3 Rd8": "?! - I considered castling, but looking down the line I think this was the better option. Alternative: 10...O-O-O 11. Bb3 Bh5 12. Be3 Bg6 13. O-O Na5 14. Bd1 Bd3 15. a3 looks playable but I felt I could adequately protect my king without castling.",
        "11. Bb3": "?! - Attacking f7 since I chose not to castle, but this move gave me an idea.",
        "11... Bxe2 12. Nxe2 Nf5": "Putting as much pressure as possible on d4.",
        "13. O-O": "?! - An interesting choice by white. Allowing my attack and electing to activate his rook instead.",
        "13... Nfxd4 14. Nxd4": "White elects to accept to open the e-file and attack my king.",
        "14... Nxd4 15. Re1+ Be7 16. Bf4 Nxb3 17. axb3": "Simplifying the position even further. Being up a pawn and doubled pawns in this position seems to benefit me to trade. ",
        "17... Rd7": "Protecting both my bishop and c7 squares. After this move, white pondered his next move for about 10 minutes.",
        "18. Rad1": "...Before deciding to just trade off my rook.",
        "18... Rxd1 19. Rxd1": "A move I accept given I am up a pawn and he has a doubled pawn. But now I think about my next move. Bd6? evens the board out as white will win his pawn back and put his rook in great position to gain more space.",
        "19... c6": "So I instead weaken my pawn structure to save c7. Though since I have not castled, defending against the open file rook is not a problem.",
        "20. Re1": "Once again, white took his time in making his next move. He has to be careful or the position will slip further and further away.",
        "20... Kd7": "Escaping the pin and bringing my king in preparation for an endgame.",
        "21. Bd2 Re8 22. Bc3": "Attacking the g7 square. White is trying hard to get the pawn back he lost",
        "22... g6 23. Rd1+ Bd6 24. g3": "As this heads toward an endgame, I have to say I like my chances here. A pawn up and his doubled pawn should make this a win for black.",
        "24... c5": "Allowing my king a space, also controlling the dark squares along the way.",
        "25. f4": "White's trying to regain lost position, but will find it difficult here.",
        "25... Kc6 26. Kf2 f5": "Controls e4 and g4. Trying to force a zugzwang, which for those that don't know is a position in which you would rather pass than make a move.",
        "27. h4 h5 28. Rd3 Bc7": "And here white resigned, realizing his position was a lost cause."
    },
    "url": "https://gameknot.com/annotation.pl/coaches-mini-tourney?gm=54313",
    "gameName": "Coaches Mini-Tourney",
    "players": "L. Abrams (2165 (USCF)) vs. Myself (1986 (USCF))",
    "opening": "Danish gambit (C21), Soerensen defence"
}