{
    "moves": {
        "1. d4": "Joe: Now that we discuss each move, first, I was torn between KP and QP opening. The reason why I'm inclined to play 1.d4 is because I'd be inclined to follow up with the Colle's Franketort System, as recommended by GM Susan Polgar. But, as I saw in the Chicoboy's Legacy Forum, black can prevent that. However, I'm most used to 1.e4 openings. So, I think that sticking to what I know is probably the best idea.  Ken: I mean't NOT too often. Ken: Either is fine, sticking with what you know best is always good, but trying new things is more educational. I have opened mostly 1.b3, but have also played 1.c4, 1.d4, 1.f4, 1.g3, 1.b4, 1.Nf3, and even 1.e4, but not too often.  Joe: That answers my question. I want the more educational approach.",
        "1... g6": "Ken: Any preference on my defense. My usual are King's Indian, Queen's IndiaN & the Dutch Defense?  Joe: I think that the King's Indian is a good approach because archduke_piccolo suggested that I get practice, after annotating my loss against reversion with the King's Gambit.  Ken: Okay, King's Indian it is. I like to slide into it by transposition. It gives my opponents more to think about, and to worry about.  Joe: That makes sense. I like thinking about many things. Overtime, I've learned that it's a good way to improve.  I had a little bit of a difficult time deciding between 2.Nf3 and 2.e3 This would go into the Colle System. With 2.e3, it transposes as the mainline starts with 2.Nf3 My preference is to get my Ng1 into play for development. However, this will have to wait until tomorrow (when I come back from work) because I must log off for the rest of the night.  Ken: If we're heading to a normal KID Nf3 is the move, the only other choices you should consider as white in this position are Nc3, c4, or e4. e3 is far too passive at this stage  Joe: I agree here. e3 should hold off, and possibly be prevented which if so. Then, the Colle System would not work because the actual sequence involves e3 being played. As far what move next, after discussion, it'll take some more though now that there are other moves to consider. I could do a normal KID, if it's your recommendation, but I also like the looks of Nc3 and e4 which not only allow me to develop but help to control the center. It's hard to know if I should do it normal, or if it's better to transition into something else. Both are very educational since I haven't explored through any variation of the KID, yet.  Ken: take your time to decide, any of the moves I mrntioned will work, albeit slightly differently.",
        "2. Nf3": "After giving this a lot of thought, taking several hours and thinking about what he said, I played this due to being new at the King's Indian Defense.  Ken: an excellent move, now after my move you need to think about pawn structure, namely what type of center you want.",
        "2... Bg7": "Joe: A new lesson. I always, until today, thought it was just about center control. Now, I know that there are different centers and it's hard to decide. If it's no longer too passive, I was thinking of 3.e3, as now, it is the Colle's System. But, if that's too passive, then I need a lot more time to think. This is where I really start comparing chess to a spin class, and it's like being in a difficult level of gear.  Ken: If you play e3 right now, you tell me that I don't have to fight the three pawn attack, and you block your DSB from coming to f4 or g5. Now maybe that's OK, maybe you never intend either of these, but these Indian games are all about flexibility and keeping options open. If I was white, I'd be thinking about playing g3, and fianchettoing the B on g2. This is a Viktor Korchnoi favorite, or my choice might be to delay decioding by playing c4 and adding to my central control. As black my next move will be d6, aiming at a future e5 or c5, depending on what you do. Yes there are different centers, depending on the pawn structure, so take your time thinking. If I can find the reference book, I'll send you diagrams for each structure or model games showing how to play each structure.  Joe:  I agree, and I need my Bc1. So, what comes to mind is what you mentioned about the fianchetto with b3. I'm also considering Nbd2 That's because in my recent game against Jack Stockel (which I annotated yesterday), I played the Colle's System. And, after Queens Pawn Opening, c4, followed by Nc3 were played. But, they said that better then advancing the c pawn is bringing the Nb1-d2 Of course, as you and a mentor mentioned, it all depends on the position. I'm not convinced that it's such a good idea in the Nimzo Indian because I don't want to have a cramped position. Come to think of it, as you mentioned, playing Nbd2, at all, would also block in my DSB. I also like the looks of just bringing my Bc1 to f5. But, I like the Viktor Korchnoi because my bishop would have a longer diagnol, and I also enjoy the longest diagnol. It also doesn't work out in every position. But, when they do, I like it, so I'm leaning towards 3.b3  Ken: b3 is playable, challenging me on the diagonal. Give some thought about what your response would be if after you play b3, I immediarely p[lay c5. If you like the resulting position, then play b3, if you don't like it think some more",
        "3. b3": "Joe:  I don't mind. I looked at other moves, most would've been the same thing. There's one that didn't being 3.Nc3, which I think also would've resulted in 3...c5, followed by the loss of a Knight and Rook, if I took. That would leave me in a very uncomfortable and stressful situation. Then, I'd be thinking the same way that Magnus thought which becomes impulsive. And, that's not a good way to go. Before playing this, I looked at variations, and I like the way this is going. And, with your next move, there's a lot that's going through my thought process as I think about the overall plan and how to fit that situation, as per advice by bhidragon.",
        "3... c5": "Joe: As noted, I was thinking about what to do before this was played. Now, here comes the thought process, as what went through my mind, at first, was so bad that you would've so said no. But, I quickly ruled it out as an option on the last move while planning. So, what came to mind, at first, was 4.dxc5?? because it appeared to win a pawn. But, then I saw that the goal is to deflect that away due to my Ra1 being en-prise. I looked briefly at 4.Nc3, which loses a piece after you capture on c5. The other I looked at was 4.Na3, but in general, I don't like placing the Knight on the rim. Plus, you still win a pawn after 4...cxd4 But, as per your advice, I analyzed all of this before I played 3.b3. So, the next move that comes to mind, which I really like is what I mentioned earlier of 4.Bb2 for a nice long diagonol. Plus, I have an extra defender, so that I don't lose material since your Bg7 is a threat. This is a good way to take care of it. I also like the looks of 4.c3 but not as well because it doesn't develop. So, I'm thinking of 4.Bb2.  Ken: sounds like you have thought it out fairly well",
        "4. Bb2 cxd4": "Joe: Ok, we've reached a tough think about. But, this is how far I planned, just before playing b3. I must take to avoid losing a pawn. I'm thinking of how. I was, at first, interested in Bishop for N. So, taking with 5.Nxd4 But, I studied more about open and closed positions. And, tactical-abyss gave me insights, in general about 1.d4 So, it applies here, that it's better to exchange Bishop for N. That's because it's a closed position because of how the opening started. He said that in 1.d4, a Knight is generally worth more then a Bishop. So, I think that 5.Bxd4 is the way to go.  Ken:  It's an okay way to go because I have no intention, nor should I of playing Bxd4",
        "5. Bxd4 Nf6": "Joe: Only now am I starting to think about what to do. This is going to be difficult for me to decide. I know I'm not losing anything. What makes it difficult is that I'm on the fringe between playing 6.Nbd2, or 6.e3 Although it shouldn't have, 6.e4 came into consideration, except that I'm losing a pawn if that happens. I also think that 6.e3 is worse now then before. Not only is it passive but, having my Bd4 blocked would be worse. I was also thinking about fianchettoing my other Bishop with 6.Bg2, but that seems a little too slow. The idea would be to develop and castle, at once. But, I think that developing sooner would be something that I'd want to do. And, for that, I feel that 6.Nbd2 would be the way to go.  Ken: 6.e3 is a good choice. This position is the whole point of this type of defense. There are at least 6 plausible moves here. Is one very much better than the others? My advice here is think some more, and think about where you want your pawns to be. Examples: are you going to push the q-side pawns or the k-side? or none? Are you aiming at a piece led attack? Does exchanging benefit you at this point? Castling k-side, q-side or not at all? How do you stand on the board? equality??  Joe: Yes, I'll take all the time I need, even if it's the last minute (which would mean being down to the last few hours.) Afterall, despite getting better, I still need some work on channeling the impulse to move. And, there's a lot of Homework that I need to do here, as you point out.  Ken: no problem, take your time and ask questions as needed.  Joe: I've almost made up my mind but do have a question. The two candidate moves I have are 6.g3, and 6.e3 I'm not not sure which one is better, though. If I fianchetto on g2, my only issue is the bishop being blocked by the Knight. But, I see that it's happening with you, so my guess is that it's not too problematic, in this position. 6.e3, you said was a good move, but my Bd4 is semi blocked. So, I don't know if it's better to have a pawn blocked or a bishops diagonal blocked.  Ken: 6.e3 is better. Experience Indian systems over the years shows that it is best to fianchetto only one of the B pair. Since you have already fianchettoed the DSB the typical plan revolves around control of the dark squares. In practical play it is just too ambitious to try to control all the squares, both light and dark.",
        "6. e3 Nc6": "Joe: I'm shortly on, but only to look at possiblities. That means that I'll be using just about as much time. And, it's due to the work schedule, tomorrow. Monday nights and Tuesdays, in general, is where I have the least amount of time to be on the computer, due to the work schedule. In this position, I considered 7.Nbd2 to complete development, except that I don't want to exchange my Bd4 since that seems more important, stronger, then your Nc6. The question is where to retreat it. I'm thinking on c3. If I went back to b2, you could bring your Nc6-b4 which I'm afraid might have threats. It's certainly not immediate, but what I'm trying to work on is figuring out what the board is telling me. What's indicated, to me, is that 7...Nb4 could get nasty. I think that to avoid complications, 7.Bc3 might be the way to go. The only thing I don't like is the same, as if Nc3 was played being that the c pawn is blocked which is why the General Guidelines says that in 1.d4, openings, white shouldn't play Nc3 before the c pawn's been advanced. But, I feel that Bc3 would do the same. While there are still questions and things to think about, with the work schedule coming tomorrow, which is typical on Tuesdays, this is where I, especially, need more time.  Ken: You definitely want to avoid exchanging the DSB. It's not wekk placed on c3 it is also unprotected there.  Joe: I have given this a little more thought and realize that I don't have to let 7.Bb2 block in my Bishop since the plan is to get my Nb1-d2 at some point. This is tough to think about the best move, but I've limited my candidate moves to 7.Bb2 or 7.Bc3 especially with what you noted about not wanting to exchange my Bd4 which was the last thing I'd want, anyhow, due to what tactical-abyss has previously outlined on the 1.d4 openings.  Ken: my vote would be Bb2, leaving open the possibility of playing c4 at a later time  Joe:  I agree. In fact, that move was the same as what I was coming to mind, anyhow.",
        "7. Bb2 d6": "Joe: I gave this some thought, but this time, came up with a move that I like. I want to develop my Bf1 in order to castle. But, where to? I was thinking of playing 8.Bb5 to pin your Nc6. Of course, I know you can break with 8...Bd7 (which is my anticipation), but that's when I usually castle, at once. Now, one other thing I like the pin is because I thought of 8.Bc4, but then, you can attack me at will with 8...d5 and then what? So, I like 8.Bb5 the best, so far.  Ken: Bb5 is a very reasonable choice, study the variations after Qa5+ to make sure you have defenses before playing it  Joe: I don't think I do. I only saw move after 8...Qa5+, being 9.Nc3, but after 9...Ne4, I'm in trouble. Therefore, I can't allow 8...Qa5+, so I believe that 8.Bc3 is a better move.  Ken: before you commit to Bc3, exam,ine the positions you'd have after playing Bd2 or Be3, and then decide",
        "8. Bd3 O-O": "Joe: I was worried that you'd play ...Qa5+ anyhow. I think that castling makes things easier for me. Like before, there's not quite enough time to calculate, but I'm the kind of person that enjoy's castling early. So, I think that 9.0-0 would be the way to go, especially, when you count the fact that in most QPO's, castling long is usually a bad idea.  Ken: now is an appropriate time to castle. not too early or too late",
        "9. O-O d5": "Joe: With your d5 around, I can't play 10.Nc3, but I'm thinking along the line of 10.Nbd2 to complete my development.  Ken: why can't you play 10.Nc3??  Joe: The problem is that if 10.Nc3, you have 10...d4. Now, I can play 11.Nb5 to be chased again by 11...a6 But, if I'm to avoid this, I'm forced to cram my N with 11.Ne2, and I don't like being in that situation.  Ken: okay, good answer",
        "10. Nbd2 Qd6": "Joe: I'm not sure what to do here. One move that I'm taking into consideration, though, is 11.Qe2 to mobilize my Queen and connect my Rooks.  Ken: There is nothing to attack at all. You need to play what the professional players call a 'high class waiting move.  Joe: I know about waiting moves, but what is High Class?  Ken: very good  Joe:  Then, I think that a High Class move, which just came to mind, is 11.Re1 It centralizes the Rook, but also adds a defender, should I decide to play e4. If I did that, it would mean the loss of a pawn, but the Rook there, they just get exchanged.  I'm not sure, but I'd say that it's the best move, unless there's one that I'm missing which often happens to me.  Ken: It's reasonably good choice. I don't see anything that stands out as very much better.  ",
        "11. Re1 Be6": "Joe: I am thinking, believe it or not, 12.Qe2 to get the Rooks connected. The long term plan would be to double up, but I'm not sure if it works here.  Ken: sounds like another good waiting move slightly bettering your position until lines of attack become clearer.",
        "12. Qe2 Rfd8": "Joe: The Rook added to the center, I'm thinking along the lines of alleviating the pressure without leaving my Rook without the Queen. So, it's about what Rook, and I think that the best move, in this position, is 13.Rad1.  Ken: those are good chess thoughts.",
        "13. Rad1 Nb4": "Joe: I am now thinking along the line of Ba3 to pin your N.  Ken: a worthwhile thought, I've been trying to decide what I will do if you do that  Joe: Yes, I'm thinking along the same lines, of how you'd answer which is why I'm cautious. It's like I don't know but then try to do some difficult math. I would like to also get my Nd2-g3, at some point. But, if I were to play Nf1, if I did that right away, I'd be worried about tying down the Knight. There is so much to think about that nothing is easy. But, I like positions that are difficult to figure out, like this.",
        "14. Ba3 Qb6": "Joe: I'm thinking of exchanging with 15.Bxb4 The idea is trying to exchange N for B, but I'm not sure if this will work out or not.  In fact, I think it's the way to go, for if I don't take, you're going to knab my c2 or a2 pawn which I don't want to happen, as I wind up a pawn down.  Ken: you are right that I will take if you don't",
        "15. Bxb4 Qxb4": "Joe: This is a difficult position. As usual, I'm not completely sure what to do here. So, I will go by a rule of thumb, in terms of strategy by Susan Polgar. I'm considering 16.Nd4, keeping in mind that it's safe. And, the plan behind this move is to enable my Nd2 to go to the f3, where it's in a better outpost due to strategic reasons since she mentioned that this is an important part of strategy.  Ken: sounds solid and quite safe",
        "16. Nd4 Bd7": "Joe: Don't if it's time with this move. But, I don't see it affecting my decision too quickly as there's no immeidate danger. Kind of a bizzarre comment, but that's because I'm thinking of 17.Nf3, for the reason outlined on the move above as my Nd2 will be better placed.  Ken: that's what chess is all about, getting your pieces to the right squares. You do that a lot, you win a lot. If you don't, you lose a lot.",
        "17. Nd2f3 Qd6": "Joe: I'm thinking along something unusual. As you might have seen in charleshiggies, most recent annotation, my thought process was wrong there. It started off with a Grunfeld Opening so I thought that a N was worth more. When, I said that, teardrop accurately pointed out that you need to decide when that advice is right. I'm not sure if it's works, in this position, but I am considering 18.Bb5 (to exchange that for my other N). The awkward part, however, is that I've exchanged one Knight for Bishop, and question if I should do the second one, or keep my LSB. I say that since an alternative would be 18.Nb5.  Ken: This is the correct question B or N. It is unclear to me which is better here. Sometimes it is a matter of taste. Which piece are you more skilled at using and what's your comfort level.  Joe: I'm more skilled with the N. For after the exchange, it's not clear for me what my LSB can do and where I go from there. But, with the Knight, however, Queen is under attack. But, that's not even close for anything to be considered. But, what is considered is the N maneuvered. Most importantly, however, is the pressure against your e5 pawn. Right now, it is well defended. But, if and when your Bd7 comes off the board and I've got the N there is the threat of pinning your Queen. It can be defended, but there's still that added pressure. One of the things I was taught was to keep the pressure. With that being said, although the second part is difficult to answer, I am also more comfortable with the Knight, in this particular position.",
        "18. Bb5": "Ken: Trading either the B or N eases you task, so at least for now, I won't exchange pieces. A judgement of a type that all players face in almost every game  ",
        "18... Bc8": "Joe: Since they won't be exchanged, it's a case of not really knowing what to do. But, I'm thinking, for a similar reason along the line of Ba4 The only thing I don't like about this is that it appears to be a waste of tempo, but my plan is to renew the threat of the pin since my plan involves bringing my Nd4 to where my Bb5 is. Not really sure how to put it, but I guess you can say reconfiguring those two pieces.  Ken: clearly such a re-positioning will be vital  Joe: In that case, I think that Ba4 is the way to go because, if I play Bd3, there is an interference, as my Rd1 is blocked by own bishop. And, the Rook is where the pin threat is taking place.  Ken: sounds like you've thought it out well",
        "19. Ba4": "Ken: things are getting more complicated. this is the main reason I refused the trade of B's, to make things difficult. When this possible, you don't exchange.",
        "19... a6": "Joe: I just learned something new. What I learned is that, when things become complicated, you don't want to exchange because you need those pieces.  For me, it's also difficult because the pin is gone. Not to my surprise, at all, you read my mind. Now, to calculate what to do. I think that I might be able to renew that threat, though with 20.c4 Sure, it can be prevented, but there would be some pressure then towards the center.  Ken: It is a complicated path now, much more so since I did accept the possible exchange of B's. It does revolve around c4, so take the time you need and think it through.  Joe: Don't need much more time. Although the thinking was good to an extent, know it's important for you to know this, as I was just starting to take things too far which is why I liked the advice of taking time. I realized that I had a similar impulsiveness with what you've seen, which would've resulted in the loss of material. My thought was originally, as noted, trading pawns on c4, so that my Nd4 could move to c2 and threaten the pin. But, what I almost overlooked there was something similar to what stalhandske made me do as Homework in the WTWLTR club during a vote game. As the problem here would be 20...b5, which at the very least, loses a piece for a pawn since my Ba4 would be locked in. The bad part, though, is that I'm losing pawn since the only way to protect this is 20.b4 Were the d pawn not on d5, I'd have another option with the Queen. Therefore, I'm still going down a pawn, but it's better then a piece.  It's because, I feel that the only way around this is 20.b4  Ken: make sure before you move. Like I said earlier, this type of position is wh trading pieces down is the wrong idea sometimes. If you've got pressure on an opponent, trading eases things for the opponent.  Joe: You are right, and I see it can be defended though with 20.c4 because if you play 20...b5, I can take with the c pawn. And, everything would still hold.  By still hold, I mean that it remains level. In other words, I don't lose anything.  Ken: I knew what you meant. ",
        "20. c4": "Ken: I'm turning up the heat a bit more. Now it's even more complicated after ..e5",
        "20... e5": "Joe: I can see why. I am under attack and will need to think about how to prevent the loss of material. Difficult situation.  Were it not for the loss of a pawn, I'd reattack your Queen with c5 since GM's and charleshiggie have done that. Of course, that's overgeneralizing. So, what else? I think that my only option is to cramp my Nd4 with Nc2.  Ken: playing c5 doesn't actually cost you a pawn right away because if you play c5 and I capture, you can play Nxe5!  Joe:  Yes, that's true. The question is if it will work here or if I have a better move. I do like that, as now, the Knight isn't cramped. But, I think there's more to the story then meets the eye as my original goal was to pin the Queen. The question is am I going to lose that goal. With Nc2, there's still potential, but the I ask myself what happens, if your answer with e4 As of now, there's more questions for me then answers until I unravel the mystery, bits by bits. As you noted, it's a very difficult position.  Ken: That's the whole point, the stronger players increase the complexity of the position, and challenge their opponents to figure it out.  Joe: So, I gave this a little more thought. Both Nc2 and c5 are optional. I think that playing c5 is a better option because if 21.Nc2, black has 21...e4, which forces me to answer with 22.Nd2 And, now both of my N's are cramped. After a loss combined with a different game, I feel that this would give you a space advantage. But, c5 should stop that in it's track.",
        "21. c5": "Ken: I am not trading my e-pawn for your c-pawn. St least not at the moment. That would ease the tension in the position, and if anything, I want to increase tension, so... Qe7",
        "21... Qe7": "Joe: And, my thought process was decreasing it. For all moves, there's always something different. That does force me to cram my Nd4, though. As much as, I hate being pesstimistic, it's about reality which only gives me one option. That is 22.Nc2.  Ken: Certainly true that the N can't stay on d4 and c2 is the only available square. I'd call that completely forced.  Joe: I concur that it's forced.",
        "22. Nc2": "Ken: The pressure stays on.",
        "22... Ne4": "Joe: Believe it or not, I don't feel so stressed anymore. I felt that the pressure was on before which would've led to some stress. My concern was 22...e4, after which, I'd be forced to pull back. But, the N moving there, I think it's easy for me. Shouldn't be, but that's how I feel. However, I know why you played this as there is a N fork against my Q+R. That can easily be defended against with 23.Rd3  Ken: there's more to look at.  Joe: I'm definitely going to spend more time. I'd do it tonight but am going to have to log off because I need to get early tomorrow. But, come tomorrow, I'll spend, possibly, 2 hours trying to figure out what's going on here. I don't know what happens ...Rd3 is played, but I sense that it cannot be good.   I agree actually, as it also leaves my Nf3 pinned, since black can play ...Bg4 And, Qd3 leads to a half pin with ...Bg4 So, that needs to be dealt with to. Despite that, I think it could be a nuicanse. I believe that there's still more to look at, but the main move I'm considering, as of now, is Rc1 so that if you play ...Nc3, I can still get out. But, my thought is what happens if you pin the N. My take, as of now, is that, there are more questions then answers here.  Ken: there are more questions than answers. That my friend is what pressure on your opponent is all about.  Joe: Ok, what I discovered with this pressure is that, I can't completely avoid the pin, unless I give up my Queen or Rook to a Knight fork. But, there is only option that prevents the worst of the fork, as otherwise, my Nf3 would be pinned to the Queen. But, one move only leaves it pinned to the Rook, which I guess you call a Half Pin. That move is Qd3.  Ken: keep thinking, especially about what comes after your intended move Qd3.  Joe: After Qd3, I'm going down a pawn. I did look at another move with a bunch of variations, but I'm not convinced that they work, either. The move would be 23.Nb4, to allow the anticipated 23...Nc3 as a conditional move. For then, I'd play 24.Nxd5, and after 24...Nxd5, I'd play 25.Qc4 to try and get something. The question is, if I sacked, would I be successful in getting something back with that line. One of my main problems which reversion PM's me, and then, cplusplus11 noted in an annotation is go through those lines and seeing if they can fail.  Ken: Materially the two lines will yield similar results. It then becomes a matter of judgement, which do you prefer. One may lead to more exchanges than the other, let's say. Is that good or bad?  Joe: That is good advice.  Yes, that's the question. I don't think it's quite as good. Jack Stockel once told me to exchange when possible against stronger players. I ruled that out. That's tactical-abyss said that in most cases, you shouldn't. I guess it's preference. I don't know if more exchanges is good or not.  Ken: After you've checked the varaiations for a while, look at the mobility you have left. If one variation appears promising, but leaves yopur pieces unable to",
        "23. Rd3 Nxc5": "Ken: When you can, and here i could you should always try to play duaL purpose attacking moves. That's the reason I played Ne4 in the first place, I have a primary threat on c3, and also a secondary threat on c5.  Joe: Does dual mean multiple? I ask because I have not term used in this context.  Ken: Yes it does mean multiple purpose. As you can see here, my refusal to exchange pieces a few times is increasing the degree of difficulty. You are now facing four separate threats. I will let you analyse that a bit.  You cansee now very clearly ehy I refused exchanging pieces. The degree of difficulty has jumped so high that you have to analyze 4 distinct threats: I can play 24...NxR 24...NxB, 24..e4, or 24...b5. That is a lot for you to chew on since only 3-4 moves ago the pressure was minimal.  Joe: That means that I've had to have made a mistake with that c pawn. Yes, and this will take time.  What I know right now is that I can't prevent a total loss. Meaning: That I'm going to lose something. But, I can minimize the damage and prevent you from getting anything for free. It would be at the cost of a pawn. I think that 24.Nd2 is the way to go here.  Ken: Consider what would happen after 24.Nd2 b5 before you decide about this sequence  And consider that if I play 24....NxR I can still play b5 after you recapture on d3.  Joe: You are right. There's more cons then pros. The only way to prevent that is b4. In fact, that's the best move because say you play that, and I pull back, then you take the Rook, and I capture the N, then white has lost another piece, yet. Though, the trouble's there. My thought is alleviating the problems.  Ken: You will need to be your best at damage control here. I suggest you count the pieces carefully and assess each variation, writing it all down in a note to yourself before you decide.  Joe:  I will, but in starting to calculate variations, I think that Nb4 is probably the way to minimize the damage.  Ken: It is your decision, my advice is to be careful & methoidical.",
        "24. Rdd1 Ne4": "Joe: Believe it or not, I'm starting to feel more comfortable about this position. I was worried about you playing ...Nxa4. But, I can defend here. The only problem now is this threat. But, I think that it's not serious, as of the moment.  Ken: well, be sure before you move  Joe: Not completely out of the woods, but I think I can save the position with Qd3.  Ken: you are right, the woods are still thick and mysterious. Qd3 is unclear if it's the best, but it is reasonable in a position where most choices are bad. ",
        "25. Qd3 b5": "Joe: With my B blocked in, which is the move that I anticpated, at some point. The only way to keep damage minimal is Bxb5 For, if I don't take, that Bishop is a freebie and I don't like giving anything without something, in return, which is already what happened with the pawn.  Ken: you will get some compensation, probably not enough, but make the best you can out of it. Joe: I agree. Yes, it's not enough, but I can get two pawns, though, with that move.",
        "26. Bxb5 axb5": "Joe: This is going to be a difficult one to analyze, as we're not talking about pieces here. It's a question if 27.Qxb5 or 27.a3 are better. 27.a3 protects the a pawn. But, if I capture on b5, it becomes an exchange. It's pawns, but the question is should I exchange or not, as it boils down to those 2 moves.  Ken: there's more, you should also analyze whether a move such as Ba6 will bring harm to you Q after she takes on b5. I've been looking at that and trying to decide how well it actually works.  Joe: That would cause a lot of harm, as at the very least, I'm forced to liquidate Queens. The only way to stop that is by giving up another pawn 27.b5 For, if you played 27...Ba6 that pawn won't be able to advance further and threaten the Queen like that.  Ken: I was thinking more in terms of trying to trap your Q  Joe: Yes, and I don't want that Queen trapped. I think that b4 might be the only way to stop it. There might be other alternatives. But, I see a very limited amount of options, in this position.   I'm also thinking of 27.Qxb5 to prevent you from trapping my Queen. A possible continuation would be 27...Ba6 28.Qb6, Rdb8 29.Qc6, Bb7 30.Qb5, Ba6 The only problem with this line is that my Queen must constantly run back. I think that b5 might be better to keep the Queen safe, without loss of tempo.  Ken: I'm not surprised that you knew that about the comments. In this type of attack there are multiple threats even now. That is what makes the attack particularly effective. How you noticed that even withe threats revolving around b5 there are still other threats lurking, for example, what happens if I play Bf5? This is a type of attack you need to understand to advance as a player. Single variation attacks are too easy to defend, but multiple variation attacks are much more powerful.  Joe: You are right, but no matter how bad the situation is, ironically, I've learned, overtime, not to be afraid. As that has triggered the Fight or Flight syndrome which has caused me to rush. So, although I don't like exposing the K, as per what Jack has outlined. I'm thinking of 27.g6 to that attack. And, now if 27...Ba6, I can stop Ba6, as well, with 28.Nb4 And, I feel much safer. The only issue is the exposed K, but I'd take it over losing my Queen.  Ken:  I think you have mistyped here, you can't play g6 to stop my B from going to f5  Joe: It was because I reversed colors. In that case, it's going to have to be 27.Qxb5, as they stop both threats. That's because if 27...Bf5 is no longer a threat against the Queen. And, if 27...Ba6 I run back with the same moves. So, I thinking taking puts an end to what's coming.  Forgot to mention, but if after 27.Qxb5, you played 27...Ba6, my answer would be to attempt to exchange Queens with 28.Qb4 since it's not lost with my Nc2, which is something that I overlooked when commenting, earlier.   I hope that I'm not missing anything, at this point.  Ken: I always hope that!",
        "27. Qxb5 Ba6": "Joe: As noted, yes, this move was anticipated. But, this is where I realize that Qb4 keeps me safe, for now. I absolutely don't like liquidating when behind. But, when you mentioned about the Q before and those variations, that's when I figured out that there weren't options here.  There actually is a move that I missed, over what happens if one of your Rooks is brought to b8 to attack my Queen. But, my answer would later be Qa4 as keeps it safe.  I meant Qa3 as that's where the N would protect it.  Ken: Now another decision, where doesthe Q go? I would say you be looking at b4, b6, and c6 mostly  Joe: Yes. The move that I looked at was b4. But, I thought I overlooked one of your Rooks going to b8. Except, that if it did that, I'd get a free Queen. Which I know you're not going to do. If, however, I played I brought it to b6 or c6, however, then you could attack it with your Rook. And, that is me trying to calculate many variations, with the way that you mentioned. So, I think that best Qa4 here.  Edit: I meant Qb4.  Ken: I have not doubt that you meant Qb4.",
        "28. Qb4": "Ken: I am stubbornly sticking to my no exchanges plan.  At least no equal exchanges.",
        "28... Qe6": "Joe: Which makes the threats worse then anticipated. With that being said, another problem I have, on top of not calculating multiple variations, is that I've been known to underestimate how bad the situation is. A good example was in my most recent game against bhidragon. I was hyperfocused on center control and developing my Nb8-c6 in the Semi Slav QGD. Now, that hyperfocus is what led to me underestimating how bad the situation was with his attacking forces against my monarch. In doing so, my opponent gave me a B for pawn as he had a mating attack. The advice was the overall seeing the overall picture of how the game is developing after annotating that game. But, part of what hinders is thinking that the situation isn't, as bad as, it is. I'm afraid that's what might have happened here.  In theory, I might be able to change that, and force an exchange, by attacking your Queen with Ng5. I am afraid, though, of Qf6. This is a very interesting position.  Ken: In aiming for g5 you are forgetting that my N can move from e4 backwards to g5. This is quite a common error. I've done it myself a few times. You can get so locked in on pieces moving forward that you forget they can move backward to good effect as well.  Joe: Yes, so I've ruled it out. I'll try to find a better move. Normally, I'd calculate right away and try to find something then. In fact, I don't want to exchange now due to being behind, which is why I'm glad that you played ...Qe6. But, as you said, it's a difficult position. This is pressure, as I don't know what move to do here. And, you noted that this is what's all about which I'm feeling here.  Allright, as I have more time. I've given this a little more thought. Believe, though quite terrible, 29.Rd3?? came into considertation with the idea of trying to put pressure on your Nd3 as the plan would to be coordinate my Q and Rd1. With that being said, yes, I almost overlooked Bxd3 So, although I dislike exchanging when behind, the only move I can think of is 29.Nd2 And, if we exchange, I feel that the pressure would be off. As otherwise, I don't know what to play.  Ken: If you ploay 29.Nd2, my response won't be an immediate capture, I will play 29..Bf8, which will cause you some trouble.  Joe: I don't want that since my Queen is badly attacked. That means that the overall picture is how to prevent that. It doesn't help the pressure much, but I think that 29.Qa3 would be the way to go. And, if you discovered attack by moving your Ba6, I can quick play 30.Qc1  Ken: just make sure you understand all this before you pick your move.  Joe: Ok. Gave it more time, and realized that I'd lose a piece, though. But, I found one move that gets me out of trouble.",
        "29. Na1": "Ken: I am still playing Bf8. I look forward to seeing how you are going to handle this.",
        "29... Bf8": "Joe: Not exactly sure where to move. But, what I know is that the Q will go to the a file to avoid losing it.  Ken: Absolutely correct Q to a4 or a5 only choices, neither pleasant.  Joe:  I've got no idea which is better, however.  Ken: Neither is good.",
        "30. Qa4 Bc4": "Joe: Didn't see this coming, as now, my Queen is a goner. I can take Bishop, but you get my Queen, either way.  Ken: you will have some compensation, but not enough.  Joe: Yes, I can with bxc4, but it won't do much. I'll continue, unless you think I should resign. And, I say that because of what you noted in one of my recent annotations. In that case, even though I said lasting as long as possible, it was to sastisfy the WTW rules in order to avoid being questioned by the mods, as it happened in one case when I felt that there was nothing to learn. But, this is not one of those games. So, if you think I should, I will resign. If not, I'll stay in.  Ken:  If you consider that you are still learning, don't resign yet. Just don't regard the length of the games as particularly meaningful. I assume you will most likely play Qxa8 followed by bxc4 which would give you some experience with R and B for the queen. I will still be ahead Q for R, but the change in material status will be educational for you.  Joe:  I was actually considering bxc4 with ...Rxa4 to follow. But, I made a similar mistake against easy19. Taking right away does limit the damage because, as you noted, I get a Rook, in return.",
        "31. Qxa8 Rxa8": "Joe: Now, I'm thinking of taking your Bc4 with my b pawn. Don't know if it's good or not. But, when this far behind, I'll try just about anything.  Ken: I don't think you have a better option",
        "32. bxc4 dxc4": "Joe: I was interested in what you'd play. I don't know what to do here. I am, however, considering Nc2 as my N is a little more active. That's the best that I can think of, in this situation.  The question is, what can I do here. One move that I was considering was Nd2. Except, that I don't want to exchange when behind. I would've, however, played Rc1 in an attempt to win your c4, which you just defend after ...c3 It really boils down to what to do. I'm considering either Nc2 or Nd2.  Ken: At some point you will have to play Nc2, but it isn't required just yet  Joe: I realized though, that, in this position, Re2 is required, as my a3 is en-prise. And, that's also due to the fact that Rd2?? doesn't work because of your Ne4. So, bringing the Re1 to the second rank, from how I see it, is a must.  Ken: If you play Re2 my response will be Nc3  Joe:  Then, the pawn cannot be protected. So, the move I'm now considering is Rb1 with the idea being Rb7 on the next move to attempt to put pressure on your f7 pawn.  Ken:  You are right the pawn cannot be saved, but it does have one use. If you move it to a3 or a4, you slightly delay my R going to a2, and that helps a little. The position is very difficult for you at this point, nearly hopeless. At this point you defense is based on the term I disliked many months ago, \"hope chess\". You will need a crude blunder from me to get to equality.That might happen in blitz at times, but when I have several days to check out each move the chances of a crude blunder are very small. I have made one such blunder here on gameknot. I misread my notes and moved a R to c4 when I meant c5, even then I did not lose the game. I you still feel you are learning something, play on further, by all means. Don't think of the length of the game as important, though. What's important from this game is that you are learning to think about your future moves in regards to multiple threats, and that you have learned not to exchange pieces as readily as you sometimes have done in the past. See if you can get Yuri Averbakh's \"Chess Endings Essential Knowledge\" from your local library. You may never use some of the endgame knowledge in it, but it will help you to know which endgame positions are won, and which are not. This knowledge will help you make better decisions when faced with exchanges.",
        "33. a4 Rxa4": "Joe: Allright, I'll play on a little longer but am almost ready to resign. I'll move to a4. But, once the pawn goes, that's when I'll resign.  In fact, I'll continue, until you feel that there is nothing for me to learn, anymore.  Since you took anyway, I'll play Rc1. It's hope chess, allright, as I'm I will attempt to complicate the position.  In fact, I'll continue, until you feel that there is nothing for me to learn, anymore.  Since you took anyway, I'll play Rc1. It's hope chess, allright, as I'm I will attempt to complicate the position.  Ok, I misread the note. I don't think there is anything left to learn, unless we discuss other moves, and maybe I get something out of that, just like before. Otherwise, I'm probably going to resign. I wasn't going to, except that taking on a4 wasn't delayed, so I think that, if anything, there's not much to learn anymore from this game. I like this moral, and if you check out my most recent annotation, not only didn't I see multiple threats. But, I did not even attempt to consider more then one variation because I underestimated the position. And, he had pressure that I didn't realize or feel since it's about not knowing what to do. But, I figured and was condident that I did which is why variations weren't considered. But, that ultimately sealed my fate and got me mated very quickly.  Ken: You are right that there is nothing left to be learned in this game.  we can start another after I take some time to think about lesson number 2.  Joe: Ok. Resignation for me is imminent. I don't mind starting another one.   "
    },
    "url": "https://gameknot.com/annotation.pl/coaching-game?gm=60920",
    "gameName": "Coaching Game",
    "players": "jkarp (1355) vs. kenneth_fiore_3 (2175)",
    "opening": "Modern defence (A40)"
}