{
    "moves": {
        "1. c4": "Mr Kitrich brought his legendary class to the chessboard in what can only be described as a cold, reptilian dispatching of his larger opponent.",
        "1... d5": "A lazy reply to the English.  The subsequent forcing sequence will leave black behind in development.",
        "2. cxd5 Qxd5 3. Nc3 Qd8 4. Nf3 e6": "Early though it is, white not only leads in development, but retains considerable scope for transpositions or creativity. ",
        "5. d3": "Kitrich played the seemingly timid 5.d3 as against the bolder 5.d4.  It is clear white will fianchetto his light-squared bishop. ",
        "5... Bb4": "Predictable play from black.  The pin has no practical implications.",
        "6. g3 Bxc3+ 7. bxc3": "White is now clearly better.  Kitrich enjoys asymmetrical pawn structures.  The dark-squared bishop already looks like a classy piece, with possibilities of Ba3 or Bb2. ",
        "7... Nf6 8. Bg2": "Kitrich did not like 8. Bg5 in light of 8...h6.",
        "8... O-O": "With 8...0-0, and blacks lack of the dark-squared bishop, the first implications of white's icy attack may be discerned. ",
        "9. Bb2": "The possibility of an attack along the long diagonal is now apparent.",
        "9... Nc6 10. O-O": "Question: did white have any stronger moves here?  Mr Kitrich considers 10. 0-0 to be \"effete\".  ",
        "10... Bd7": "Where 7...b6 followed by Bb7 may have been stronger.",
        "11. c4": "Question: is 11. c4 strong?  Though it opens the diagonal, does it invite 11...Nb4 or 11...e5?",
        "11... Qe7": "The threat of Qa3 does not intimidate.",
        "12. Rb1 b6": "Kitrich considers this move to be \"unappealing\" and \"quite beside the point\".",
        "13. a3": "Against the threat of 13...Nb4.",
        "13... Rab8": "Seemingly preparing b5, but is black better off with 13...e5, solving the problem of the d7 bishop?",
        "14. Qd2": "White's class begins to announce itself.  Obvious threats of Qc3, followed by an effort to reduce black's f6 knight.",
        "14... Rfd8": "\"This move may not be so bad as it looks,\" said Kitrich, \"but it probably is.\"",
        "15. Nd4": "Question: is this move germane to white's attack?  Kitrich said, \"15 Nd4 looks weak for white\".",
        "15... Na5": "A bafflingly ugly move.  The b3 square is after all protected, is it not...?",
        "16. Rfc1": "White's class excels itself.  The implications of Rfc1 are too subtle to be discerned at this point, but the move will prove crucial in the ensuing continuation.  ",
        "16... c5": "Finally, what can be called \"counterplay\" emerges from black.  After the white knight is evicted, black can look forward to winning the exchange with Nb3. ",
        "17. Nf3 Nb3": "Black is winning the exchange, but his materialistic approach is the antithesis of class, and will prove to be his undoing.",
        "18. Qc3": "White's battery is assembled.  However, he will have to dislodge the f6 knight, and find the g7 square undefended.  Question: does black have anything with Nd4, leading to a discovered attack upon the white queen?",
        "18... Nxc1 19. Rxc1 a6": "Though down material, white begins to press home a sub-zero attack.",
        "20. h4": "A classy move, no?",
        "20... b5": "Black's counterplay was calculated by Kitrich to be \"anemic and lagging\".",
        "21. h5": "The class may begin to make one blush.",
        "21... b4 22. Qe5": "Kitrich finds a beautiful square for his queen.",
        "22... bxa3": "\"Black is after peanuts,\" said Kitrich, \"when in reality he has all kinds of 'tsuras'.\"",
        "23. Bc3": "Superior to 23. Ba1, where black could return the exchange, and take the polar sting out of white's attack. ",
        "23... h6": "Question: can black hold the position after this move, or is he lost...?",
        "24. g4": "Kitrich said of the pawn storm, \"some the most enjoyable moments in chess are when the game plays itself.\"",
        "24... Qf8": "I ask again, Is black busted, or has he a defense?",
        "25. g5 hxg5 26. Nxg5": "Question: do you not agree that 26. Ng5 is stronger than 26. Qg5.  Said Kitrich, \"I had not calculated all the variations, but my intuition told me to get that knight into the attack.\"",
        "26... Nh7": "This move of black's sets the stage for a continuation devastating in its coldness, as the north wind lays waste the garden.",
        "27. Nxh7": "Question: can black hold the position if 27...Kh8?",
        "27... Kxh7 28. Be4+ Kg8 29. h6": "Kitrich reckons that black is now completely busted.  Do you agree?",
        "29... f6 30. Qg3 g5 31. h7+": "A move of absolutely surpassing class.  But does black have a chance if 31...Kf7?",
        "31... Kh8 32. Qxg5": "Where the pin on f6 proves decisive.",
        "32... Bc6": "Had black a better try?",
        "33. Bxf6+ Qg7 34. Qxg7#": "Said Kitrich, \"The strategy of the game was straightforward, but I put myself through a few contortions to press home that battery.  The mate was satisfying, but as always, I knew there were times when black could have wriggled out.\" "
    },
    "url": "https://gameknot.com/annotation.pl/cold-crush?gm=43500",
    "gameName": "Cold Crush",
    "players": "O. Kitrich (1607) vs. E. Karsten (1774)",
    "opening": "English opening (A10)"
}