{
    "moves": {
        "1. d4 d5": "respondo d5, entonces quedan los puntos e4 y c4 dominados por mi peon y los puntos e5 y c5 dominados por el peon de el ",
        "2. Nf3": "desarrolla el caballo",
        "2... Nf6": "hago lo mismo",
        "3. Bf4": "presiona sobre el centro. su dominio de la casilla e5 es muy bueno, porque tiene el peon, el caballo y el alfil. ",
        "3... e6": "con mi alfil refuerzo mi dominio en la casilla c5. la casilla c5 en este partido va a tener una importancia decisiva. ahora no se nota. pero despues esta casilla hace que yo gane el partido.",
        "4. Nbd2": "no se que hace ese caballo ahi. porque en e4 y en c4 no logra nada. a el le hubiera convenido avanzar el peon del rey . entonces si yo hacia c5 el hacia c4. y quedabamos parejos. ",
        "4... c5": "esto viene a ser un gambito. donde aprovecho que mi alfil esta incidiendo en la casilla. porque saque el peon del rey y le di jugada a mi alfil . puedo avanzar el peon porque tengo la diagonal del alfil y tengo la diagonal del alfil porque avance el peon del rey. el ahora tiene el problema de comer y desarrollar mi alfil o no comer y perder el centro. esto es porque perdio el tiempo con el caballo en lugar de avanzar su peon en el centro. ",
        "5. e3": "tarde",
        "5... cxd4 6. exd4": "queda mi columna del alfil dama abierta y su peon solo en el centro",
        "6... Nc6 7. c3 Bd6 8. Ne5 h6 9. h3 Bxe5 10. Bxe5 Qe7 11. Bd3 Bd7 12. Qf3 O-O": "me conviene enrocar para ese lado para poder poner la torre en la columna abierta",
        "13. O-O-O": "me entrega el rey en la columna abierta del alfil  eso es un error grave ",
        "13... a5 14. a3 Rfc8": "ocupo la columna con la torre",
        "15. h4 Nxe5 16. dxe5 Ne8 17. h5 b5": "llevo el peon al ataque, para abrir esa columna",
        "18. Qf4 b4 19. Nb1 bxa3 20. Nxa3 Ba4 21. Rd2 Rxc3+ 22. Bc2 Rxa3 23. Kb1 Bxc2+ 24. Rxc2 Rb8": "el enroque se desarmo. la posicion es muy mala "
    },
    "url": "https://gameknot.com/annotation.pl/columna-del-alfil-dama?gm=2511",
    "gameName": "COLUMNA DEL ALFIL DAMA",
    "players": "phenomenon (1551) vs. miperralaica (1519)",
    "opening": "Queen's bishop game (D02)"
}