{
    "moves": {
        "1. c4": "Hi all! This is the second game in this team match (the first can be found here: http://gameknot.com/annotation.pl/kings-gambit-i-accept?gm=45099 ). I open with the English, and after a lot of quiet posturing early on, some convoluted action starts happening in the center, eventually culminating in a frenzy of activity ranging all across the board. I come out of it ahead in material, but my opponent has surprising resources left to him and my pieces are scattered all over.",
        "1... Nf6 2. g3 g6": "This is the Anglo-Indian: Black intends to fianchetto his King's Bishop and attack the White center from the flanks. Of course, as yet, White doesn't have a center to attack.",
        "3. b3": "White proclaims his intention to compete with the Black Bishop for the a1-h8 diagonal.",
        "3... Bg7 4. Bb2 d6 5. Bg2": "No one has set foot in the center yet, but the squares are already hotly contested. White's King's Bishop has a strong diagonal supported by the pawn at c4, but he's going to need to move his Knights sometime.",
        "5... e5": "Black makes the first claim to own a center square, snubbing White's DSB's reach somewhat and giving Black some space on the kingside.",
        "6. e3": "White puts some more holes in his pawns--as long as he doesn't lose his LSB, they'll be okay. The point is that he can now develop his King's Knight without blocking the Bishop's reach.",
        "6... Nbd7": "Black's QB can't move out yet, as it must guard b7, and ...Nc6 would allow White to exchange on that square, inflicting doubled pawns on Black's formation (though again, White must not give up his KB lightly with all the holes on his kingside light squares.",
        "7. Nc3 c6 8. Nge2 O-O 9. d4": "Both players are continuing their development logically. Black's position is a little more reserved than White's, but by no means is it significantly inferior. With this move, White places a piece of his own in the center of the board, and challenges Black to do something about it.",
        "9... Re8": "Significantly increasing the threat posed by opening the board while the WK is still on his home square.",
        "10. Qc2 exd4 11. Nxd4 Ne5": "Now each player has a Knight on a good center square. Black still has a little development to complete, but after some preparation again e3-e4 and driving the White Knight away with ...c5, he may be able to bring his Bishop out with tempo to f5.",
        "12. O-O c5": "Kicking the Knight, but this does make the d-pawn backwards, and therefore weak.",
        "13. Nde2": "13.Nf3 would also be okay, but it invites 13...Bg4, developing Black's QB and forcing the Knight to move again.",
        "13... Rb8": "Getting off the long diagonal and preparing ...b5.",
        "14. Rad1": "Black's d-pawn is backward, so White begins to direct his fire at it.",
        "14... Bg4": "Pinning the Knight, but this Bishop has no future this far across the board.",
        "15. f3": "Played with the intention of supporting e3-e4, but as self-adjoint pointed out, 15.h3 might have been better, allowing the Bishop to maintain a line through the center.",
        "15... Bc8": "? This seems awfully underwhelming for the Bishop's second move--surely 15...Be6 would have been better.",
        "16. Nf4": "White brings up his Knight, aiming to entrench a Knight in the hole at d5 and blockade Black's backward pawn.",
        "16... Bf5": "? The Bishop moves a third time along the same diagonal, with a paltry threat, easily parried with yet another gain of tempo.",
        "17. e4 Be6": "This Bishop has now spent four moves to arrive at a square it only needed one move to reach.",
        "18. Nb5 Nfd7": "Black wants to open a diagonal for his DSB, and he doesn't actually have any way to defend d6 anyway, so this move prevents White from playing Rxd6 with tempo against the BQ.",
        "19. Nxd6": "Instead, tempo is gained harassing the Rook. This move marks the beginning of the bloodiest phase of the game--pieces of both colors, waiting on the flanks, fly to the center to kill and be killed.",
        "19... Re7 20. Nd5": "This is a very strong square for a Knight; however it isn't meant to last. This move forces Black to trade off his Bishop, but more importantly for White, it allows a free Rook lift to the fifth rank.",
        "20... Bxd5 21. Rxd5 Qc7": "The d-file is becoming a dangerous place to be. Black also has the problem of dealing with the threats to his Ne5 and pawn at c5. This answers both, for the moment.",
        "22. Bh3": "White's King's Bishop is no longer useful on the long diagonal, so it moves to become dangerous again.",
        "22... Nf6": "? Black denies his Ne5 two crucial defenders, thinking it safe while the WR is responsible for the defense of White's Nd6, but he overlooks this intermezzo:",
        "23. Nb5": "! The White Knight is out of harm's way and the BQ cannot stay to defend her own loyal Knight.",
        "23... Qa5": "Thinking to play ...Qxa2 and pin the DSB, but there's no time to actually get it done.",
        "24. Rxe5 Rxe5 25. Bxe5 Ng4": "??! Black throws several pieces to the wolves at once, striving for counterplay with the threat to White's Bishop and the fork at e3, but it is not enough.",
        "26. Bxb8": "White is having none of Black's shenanigans; now the back rank is cleared out, though White is about to lose his other Rook as well, to this marauding Knight.",
        "26... Ne3 27. Qe2": "Keeping control of d2 and a2.",
        "27... Nxf1 28. Kxf1 a6": "Black kicks the Knight to try to get his Queen back into play.",
        "29. Bc7": "But White is going to ensure that she's as trapped as possible before he leaves.",
        "29... b6 30. Nd6 Qc3": "White is now in a curious situation. He is vastly ahead in material, but his King and Queen are relatively trapped behind a wall of pawns, with the BQ glaring angrily at them. Slipping the WQ out should ensure a speedy mate on the Black King, but only if White can avoid the BQ's nasty checks.",
        "31. Bxb6": "? These queenside pawns were not doing anything for anyone, and now White's DSB is at least two moves from doing anything productive. White underestimates Black's chances for counterplay with only a Bishop and Queen, and this move wastes valueable time. Better is 31.e5! Bxe5 32.f4 Bd4 (or 32...Qa1+ 33.Kg2 Bd4) 33.Qe8+ Kg7 34.Nf5+ gxf5 35.Be5+, simplifying to a winning endgame for White and keeping a firm hold on the initiative. The text move allows Black to claw his way into the driver's seat.",
        "31... Bd4": "! This seemingly-simple move is the first in a series of tricks that Black has up his sleeve. The d-file is now closed off, so nothing can get across to attack the Black King, and nothing can get home to defend the White King.",
        "32. Bc8": "?! I think it was more accurate to play 32.f4. White needs an escape route for his King through this forest of \"friendly\" pawns, or the BQ will start rampaging through the White queenside. The text gives the King some luft, but 32.f4 would prevent ...g5! after 32...Qa1+ 33.Kg2 Qg1+ Kf3, whereas the text offers no defense against the Black pawns.",
        "32... Qa1+ 33. Kg2": "If 33.Qe1, Black can start chewing through White pawns as he pleases.",
        "33... g5": "!? This pawn thrust is surprisingly dangerous, cutting off the escape square h4, and threatening ...h5 to lock the WK away in his corner.",
        "34. Nf5": "White hopes in vain to trade off the cruel Bishop.",
        "34... Qg1+ 35. Kh3 Be5": "Somehow, black's important pawns are still defended, and the WQ is no closer to her Black-crowned target across the board. White's two Bishops each wish they could be nearly as useful as Black's single one.",
        "36. Qd2": "? 36.f4 would be much stronger here, but again White's inaccuracies give Black just enough breathing room to fight on and keep setting up traps. White still hasn't really comprehended how many ways Black can almost mate him--one more misstep, and he'll be done for despite the material lead.",
        "36... Qf1+ 37. Kg4": "White is still reluctant to attempt to trade off the Queens with 37.Qg2, even though it would give him a clearly won endgame.",
        "37... h5+": "! Black maintains his hold on the initiative and pulls the WK away from his pawns and away from his Queen.",
        "38. Kxg5": "38.Kxh5 Qxf3+ 39.Kxg5 Qxe4 leaves White *still* unable to catch the BK.",
        "38... Qxf3 39. Nh6+": "White has to be extremely careful now. For instance, 39...Kg7 40.Qd8?? Bf6+ 41.Qxf6+ Qxf6+ 42.Kxh5 Qxh6+ 43.Kg4 Qxb6 and Black has an easy win, or 39.Kg7 40.Bf5?? (to defend e4 and cut off the BQ from the BK) 40...Bf6#!",
        "39... Kh7": "? This allows the White Bishop to interpose on f5 with check, preventing mate on f6. Better was an immediate 39...Kg7.",
        "40. Bf5+ Kg7": "The Kings glare at each other, surrounded by their most trusted soldiers. The position is extremely sharp; each one knows that a single misstep will mean their demise.",
        "41. Bd8": "This is actually one of very few ways for White to avoid significant material loss or checkmate (eg. 41.Qd7?? Bf6#). ",
        "41... f6+ 42. Kh4": "Of course White cannot recapture with the Bishop, or he loses immediately.",
        "42... Bxg3+": "The last hurrah, but there are no more serious mate threats left--now it's just a question of how much material he can force White to give up before the BQ finally runs out of steam.",
        "43. hxg3 Qh1+ 44. Bh3 Qxe4+ 45. Qf4": "White finally figures out that he should have traded Queens long ago.",
        "45... Qxf4+ 46. gxf4 Kxh6 47. Bxf6 Kg6": "1-0. Black put up a terrific fight at a significant material disadvantage, and graciously resigns when he runs out of complications. Many thanks to lochess-monster for the excellent games! Comments on the analysis or the game itself are greatly appreciated. If you leave a star rating, please give me a comment as well telling me what you liked or what I should improve. Thanks for reading!"
    },
    "url": "https://gameknot.com/annotation.pl/complications?gm=45162",
    "gameName": "Complications!",
    "players": "bwaa (1676) vs. lochess-monster (1566)",
    "opening": "English, 1...Nf6 (Anglo-Indian defense) (A15)"
}