{
    "moves": {
        "1. c4 b5 2. Qa4 bxc4 3. Qxa7 c3 4. Qxa8 cxb2 5. Qxb8 bxa1=Q 6. Qxc7 Qxa2 7. Qg3 Qxb1 8. Qxg7 Qg6 9. Qxg8 Qxg2 10. Qxh7 Qxg1 11. Qxf7+ Kxf7 12. f4 Qc5 13. e4 Qxc1+ 14. Kf2 Qxd2+ 15. Kf3 Qd3+ 16. Kg4 e5 17. fxe5 Ke6 18. Bxd3 Ba6 19. Bxa6 d6 20. exd6 Bxd6 21. Rc1 Rxh2 22. Rc8 Rf2 23. Rxd8 Rf4+ 24. Kg5 Rxe4 25. Kg6 Ra4 26. Kg7 Rxa6 27. Rb8 Ra4 28. Rb2 Rf4 29. Ra2": "This is the starting position of the endgame study, just ignore all the moves before this. In the case of a lone rook vs. a rook and bishop, the game is usually a draw. In this case, Black can win this game because White's king is under attack by Black's remaining pieces. If White's king was in the center or Black's pieces weren't well coordinated, then White can fight and get a draw.",
        "29... Be5+": "It's important that Black keep the pressure on the king, before the White rook can come in to try to save the king. Studying winning endgames with a slim amount of material is a good way to improve your overall endgame, and work better with your pieces. Even in positions that are draws, a lot of players suck at endgames, and you can outplay them for the win.",
        "30. Kh6": "Black's job is to use his rook to get White's king trapped on one rank or file of the board (the 8th rank, 1st rank, h-file, or a-file). The bishop defends the king against possible rook checks, while also combining in the attack against the king. It doesn't matter where White moves, Rg4 seals the king's escape route in any case.",
        "30... Rg4 31. Re2": "White's best chance to draw is to pin the bishop here, because after moves that are not Kf5, White can disrupt the Black attack and escape into a drawn position, Kf5 secures the win by not letting White's rook disrupt the attack",
        "31... Kf5 32. Rf2+ Bf4+": "The bishop demonstrates it's power to both defend and attack. Bishops show their full power in extremely open positions like this. White has a much better chance of drawing if the bishop was a knight, since knights aren't as powerful in open positions. ",
        "33. Kh7": "White would lose quicker after 33.Kh5, because Rg1 threatens mate with Rh1 thanks to the bishop cutting off White's escape. White would have to sacrifice his rook for Black's bishop to stop immediate mate, but a king and rook vs. a king is a very simple win.",
        "33... Kf6": "In this position, Black threatens to play Kf7 and White's king is dead because of the Rh4 threat. White's rook needs to get to a square where Black can be checked after Kf7.",
        "34. Rb2": "Now Kf7 would draw, because Rb7  disrupts Black's attack.",
        "34... Rg7+ 35. Kh8 Rg1": "The winning process is complicated, but it gets simpler once you reach a key position explained later. Black's rook effectively restricts White to the h-file, but it needed to be moved because of White's Rb6  threat that wins the Black rook, and then it's Black who is fighting for the draw. Now that the rook serves its purpose restricting the king, it's time for the bishop and king to position accurately to reach the key position.",
        "36. Rf2": "White's rook needs to be as annoying as possible to make Black work the hardest for the win, otherwise Black has an easier time setting up the key position.",
        "36... Rg4": "Other ways of defending the bishop disrupt Black's formation. Defending with the rook still restricts the White king, without having to change the position of the king and bishop. If you ask, \"why not just play Rg4 immediately instead of Rg1?\" then the answer is that the position of White's rook makes a huge difference in the position and how Black needs to finish the attack. Black has to make sure that the rook isn't in a position to mess up his formation, and it takes a lot of patience. ",
        "37. Rb2": "Black was threatening Kf7, which would've mated White very quickly, so White puts the rook in a position to mess up Black's formation if Black tries Kf7.",
        "37... Be3": "This bishop move prevents any rook checks, while also getting one step closer to reaching the key position. If all of this seems complicated to you, don't worry, this is a very complicated endgame, and studying it and reviewing it will help you to play endgames like this, and using the ideas will improve your overall endgame, even if it doesn't seem like it will.",
        "38. Rb3 Re4": "In this position, Black wants to play Kg6 with a quick Re8 mate in mind. The bishop is excellent in stopping rook checks, and White's king is still cornered despite the rook's absence on the g-file. ",
        "39. Rc3": "This move makes Black's win the most complicated since the rook threatens a check. Ra3 also threatens a check, but Black mates quickly with Kf7 and the bishop defends the rook check. Rb1 is another move that threatens a rook check, but Kg6 stops the rook check and Black has an easier time setting up the key position.",
        "39... Bf4": "This critical move defends the c7 and g3 squares, so now Black can play Kg6 or Kf7 against a passive move, which heavily increases the pressure on White's king while not allowing rook checks.",
        "40. Ra3": "White must make Black work for the win, so he threatens potential rook checks on the a-file. ",
        "40... Re8+": "If White had tried Rc8 a move ago, preventing this check, then Kf7 wins easily and Black just needs to find a quick mate.",
        "41. Kh7 Be5": "When a king is trapped on a back rank or rook file, then the bishop is usually strongest when it's on the central rank or file corresponding to the rank or file the king is trapped on. For example, if the king was trapped on the a-file, then the bishop would be strongest on the d-file. If the king was trapped on the 1st rank, then the bishop is strongest on the 4th rank. The key position of this endgame is where your king is on the 3rd rank, 6th rank, c-file, or f-file, in front of the bishop, and Black is threatening to acheive the key position",
        "42. Ra2": "Other defensive attempts lose faster.\r\nRa6  allows Kf5, reaching the key position where White cannot effectively stop Rh8#.\r\nRf3  allows Kg5, where White still cannot effectively stop Rh8#\r\nRa7 allows Kf5, where Black reaches the key position, and I'll explain the winning process later, when Black forces White into the key position. White can still stall Black's win for longer with the move played, since 43.Rf2  is threatened if 43...Kf5 is played, drawing the game since Black's formation is disrupted.",
        "42... Re7+ 43. Kg8": "If Kh8, then White has forced mate with Kg6  Kg8 Re8#\r\nIf Kh6, then Kf5 reaches the key position I'll explain later.",
        "43... Rg7+": "If 44.Kf8 in this position, then 44...Bd6  45.Ke8 Ke6 (threatening mate) 46.Re2  Be5 reaches the key position.\r\nThe text move holds on the longest since it takes Black more moves to force White into the key position.",
        "44. Kh8": "This position is a demonstration of where the attacker's pieces are the strongest in this endgame. The bishop is strongest on a central rank or file, while the king is strongest 2 ranks or files away from the edge, and the rook is strongest one rank or file from the edge, since it restricts the king to the back rank.",
        "44... Rg1": "This patient move is necessary because it unstalemates White's king. If it had been White to move in the previous position, then White could draw with perpetual check since taking the rook is stalemate.",
        "45. Rf2+": "Once again, checks by the defender make it a little harder for the attacker to acheive the key position and win.\r\nRa6  doesn't have the same effect because Kf5  already reaches the key position.",
        "45... Kg6+ 46. Kg8 Bd6": "This is a very important position of this endgame, and remembering the concepts is complicated like in the key position, but the key position is more likely to occur. This position is rare, but if you remember it, then you can automatically know you're winning if you reach this position on your opponent's turn. The special thing about this position is that the player to move decides the game. This position (and mirror images of it) aren't hard positions to memorize, but you don't even need to memorize it if you can logically see how both sides would be in zugswang if it was their turn to move. If it was Black's move here, then the position is drawn because Black cannot make a move without disrupting his formation. No matter where Black moves, he'll be allowing the White rook access to a square that was guarded before. In this case, White is the one in zugswang since it is White to move here. No matter where White moves, he will unguard a critical square or set of squares.\r\n47.Rf3 would take away the Rg2  potential checking idea, so Black can play Rc1 with unstoppable mate since the rook no longer has a check.\r\n47.Rf7 would take away the Kf7 potential escape path, so play could continue Kh6  Kh8 Be5 \r\n47.Kh8 would also take away the Kf7 potential escaping route, so play could continue Re1 (threatening mate) Rg2  Kh6 Kg8 Rf1 (threatening unstoppable mate)\r\nTo avoid these quick mates, the rook must move along the 2nd rank, allowing the Black king access to the f-file.",
        "47. Rd2 Kf6+ 48. Kh7 Rh1+ 49. Kg8 Be5": "It doesn't seem as though Black has made much progress, but Black is closer to forcing White to play into the key position. Every move counts, and one slight error could change a winning position into a drawn position. Since the key corner of this variant of the RB vs. R endgame is h8, the bishop's key square of the key position is e5, you'll understand later.",
        "50. Ra2": "Rf2  would lose quickly to Ke6, with the deadly threat of Rh8#.\r\nThis move holds on the longest, since other moves allow ideas like Ke6 or Ke7, getting closer to the key position. With this move, White prevents Ke6 and Ke7 by threatening to check.",
        "50... Rg1+ 51. Kh7": "51.Kh8 would give Black forced mate with Kf7  Kh7 Rh1 \r\n51.Kf8 allows Black to set up the key position with tempo, because after 51...Ke6, Black is threatening to play the crushing 52...Bd6  forced mate with tempo. Play could continue after 51.Kf8, 51...Ke6 52.Re2(to stop Bd6 ) but Black has 52...Rh1 with the deadly threat of Rh8#.",
        "51... Bd4": "This critical bishop move is to stop Rf2  which would disrupt Black's attack and draw the game. I may create another endgame study on how to draw this endgame from a drawn position, but studying how to win it should be enough for you to understand how to draw it.",
        "52. Ra6+ Kf5": "In this position, Black threatens to reach a form of the key position with Rg7  Kh6 Rg8. I'll explain the simpler winning process once Black forces the key position, but for now, the method of forcing is complicated.",
        "53. Rg6": "This stalemate cheapo stops 53...Rg7 \r\nOther moves lose quicker.\r\n53.Rh6 Rg7  54.Kh8 Rg3  55.Kh7 Be5 reaches the key position\r\n53.Rd6 Bf6 54.Rd5  Be5 reaches the key position, and so does 53.Ra5  Be5",
        "53... Ra1": "Rb1 and Rc1 are the same as the text move, because they both have similar threats to Ra7  Kh6 Be3  Kh5 Rh7 ",
        "54. Rh6": "This move stalls the key position the longest. Other moves allow Black to reach the key position quicker. Once I show you what the key position is, then it shouldn't be too hard for you to see quicker ways of forcing the key position against inaccurate defense.",
        "54... Ra8 55. Rh5+": "Checking is the only way to stop Rh8#",
        "55... Kf6": "Black's idea is to get his king to f7 and bishop to f6 to seal in White and force the key position.",
        "56. Rb5": "This stalls the key position longest, simply because the rook is most active here. Other moves allow White to force the key position faster",
        "56... Ra7+ 57. Kh6": "57.Kh8 is met by Kg6  with mate to follow.\r\n57.Kg8 is met by Ra(1, 2, or 3) and Black can force the key position quicker.\r\nI recommend that you review this annotation once you're familiar with the key position, so that you can understand \"how\" when I say \"force the key position quicker\"",
        "57... Be5": "In the Kg8 variation where the king is trapped on the 8th rank, the key position is reached with the Black king on e6, but in this variation with the king restricted to the h-file, the Black king should be on f5 in the key position.",
        "58. Rb6+ Kf5": "Finally a form of the key position has been reached after all that time and effort spent by Black. The key corner is the corner the defending king has been trapped on for the entire ending. In the key position, the bishop should be on the square three diagonal spaces from the key corner, and the attacking king should be next to the bishop as shown in this position, based on which side of the board the defending king decides to get trapped on.",
        "59. Kh5": "This stops 59...Bf4  with mate to follow.\r\n59.Rb5 would also stop 59...Bf4 , but then Black has 59...Ra8! with the deadly threat of Rh8#.",
        "59... Ra1": "Once you've realized that you're within moves of reaching the key position (or a form of it), the first step to winning is to threaten back rank checkmate (in this case the back rank is the h-file).\r\nThe bishop's control of g7 and g3 make the mate threat effective, and White's king is trapped.",
        "60. Rb4": "This is the only way to stop mate",
        "60... Rg1": "This position is another form of the key position, where your pieces are on their key squares corresponding where the enemy king is trapped, and the enemy king cannot move because of mate threats. Looking at this position should tell you how to determine the key squares for your pieces based on which back rank the enemy is trapped on.\r\nThe winning process of the key position consists of getting the White rook in zugswang so that it can no longer defend against mate. The White king is already trapped, so now we focus on the enemy rook.",
        "61. Ra4": "The rook must move along the 4th rank to maintain the defense against Rh1 . If White tries 61.Rh4, then the rook is too passively placed to defend against newly created mate threats, so Black wins by threatening mate with 61...Rg8",
        "61... Rg7": "Now Black has another mate threat, which can only be defended by Ra6. Black's array of mate threats help to eventually put White in zugswang.",
        "62. Ra6": "There are different ways Black can win based on how White plays the ending. If White tries 62.Kh6, then Black's array of mate threats continue starting with 62...Rg8 63.Ra7 Rg3 64.Rf7 (if 64.Kh7 then Rh3  Kg8 Rh8  Kf7 Rh7  wins the rook) 64...Bf6 (Black's threatening Rh3#) 65.Kh7 Rh3  66.Kg8 Rh8#",
        "62... Bc7": "The next step of zugswanging the rook is to make a waste-move with the bishop while preventing the rook from checking.",
        "63. Rc6": "63.Rc6 preserves the defense against Rh7 \r\nIf White had tried 63.Kh6, then 63...Rd7 (threatening forced mate Bf4 ) 64.Kh5 Rd3 and White has different ways of answering the mate threat.\r\n\r\n65.Kh4 Bd8  forces mate quickly\r\n65.Kh6 Be5 66.Kh7 Rd8 and White has no more defenses to Black's array of mate threats.\r\n65.Ra4 Bd8 66.Kh6 Rd7 and there is no effective defense against 67...Bg5  68.Kh5 Rh7 ",
        "63... Bf4": "Notice how ever since the key position was reached, Black's moves have mostly been mate threats, eventually turning into a forced mate. At the beginning of this endgame study, Black had an in-depth forced mate taking 50 moves to carry out. All White can do is play moves that stall the mate the longest.",
        "64. Rc5+ Be5": "This key position is probably the easiest to remember.\r\nIf White plays Kh6, then Rg8 has the deadly threat of Rh8 ",
        "65. Rc6 Rg5+": "Now begins the process of pushing the enemy king toward a square where the enemy rook no longer has a move to stop back rank mate. If White plays Kh4 here, then Rg2 has the deadly threat of Rh2#",
        "66. Kh6 Rg1": "The rook can also move to g2 or g3, since all three moves create the Rh1 mate threat",
        "67. Kh7 Rg7+ 68. Kh6 Rd7": "This important move threatens Bf4  forced mate, and White's only defense is to pin the bishop. White has to give up the rook to stop mate, and Black wins easily.",
        "69. Rc5 Rd8": "Now, after all those mate threats and careful calculations and tactics, Black has finally won. There is no way White can stop Rh8# without giving up his rook. Playing this endgame takes extreme precision and complicated analysis. Getting this endgame is rare, but the concepts and ideas mentioned here can help in other endgames involving rooks and bishops. I will probably make some more endgame studies after this."
    },
    "url": "https://gameknot.com/annotation.pl/complicated-endgame-study-no-2?gm=8809",
    "gameName": "Complicated Endgame Study No. 2",
    "players": "rook (5) vs. rook and bishop (8)",
    "opening": "English (A10), Jaenisch gambit"
}