{
    "moves": {
        "1. e4 d5 2. Qh5 dxe4 3. Qxh7 e3 4. Qxh8 exf2+ 5. Kd1 fxg1=Q 6. Qxg8 Qxh1 7. Qxg7 Qxh2 8. Qxf8+ Kd7 9. Qxd8+ Kc6 10. Qxc8 Qxg2 11. Qe6+ Kc5 12. Qxf7 Nc6 13. a4 b5 14. axb5 Nd4 15. b6 Nb5 16. d4+ Nxd4 17. bxc7 Nb5 18. c8=Q+ Kb4 19. Qxe7+ Nd6 20. Bxg2 Rxc8 21. Qe4+ Nxe4 22. Nd2 Nxd2 23. c3+ Rxc3 24. b3 Rxb3 25. Rxa7 Kc5 26. Bf3 Rxf3 27. Ba3+ Rxa3 28. Kc1 Rc3+ 29. Kb2 Rc2+ 30. Ka1 Ne4 31. Ra6 Nc3 32. Rc6+": "This is the starting position of the endgame I would like to demonstrate. When the remaining pieces left on the board are a rook vs. a rook and knight, the game is almost always a draw. In this case, White's king is completely trapped on a1, so Black can win because of the strong threat of Ra2#. White's king is also stalemated, so White's rook is invincible, and is trying to sacrifice itself for stalemate.",
        "32... Kb4 33. Rb6+ Ka3 34. Rb3+ Ka4 35. Ra3+": "35.Rb4  would've lost quicker to Ka5, where White's rook has no more checks, and Black still threatens Ra2#\r\n36.Rb2 stops Ra2#, but also allows Rc1#",
        "35... Kb4": "Here, White must move the rook along the a-file to hold on the longest. White loses quicker if he keeps trying stalemate attempts, like if 36.Rb3 , then 36...Kc4 37.Rb4  (37.Ra3 Rc1  38.Kb2 Rb1#) Kc5 38.Rc4  Kb5 39.Rc5  Kb4 40.Rc4  Ka3 and the White rook has no more stalemate tricks and White cannot defend against Ra2# without losing his rook.",
        "36. Ra8 Rh2": "The next step in completing the winning process is getting the rook out of the way (the farther the better) to make room for the king to come onto c2. Black's idea is to checkmate with Rh1# once he gets his king to c2 where it is shielded by the knight from rook checks",
        "37. Rb8+ Kc4 38. Rc8+ Kd3 39. Rd8+": "Every move has to be check, otherwise the rook must head back to the a-file to defend Ra2#, but now that Black's king will successfully reach c2, White has to defend the new mating threat of Rh1#",
        "39... Kc2 40. Rh8": "Since the defending king is stalemated in the corner, the attacker must be on the constant lookout of rook sacrificing tricks that exploit the stalemate. This is the only move that defends against Rh1#",
        "40... Rd2": "Since White can move along the 8th rank and challenge the Black rook wherever it goes, the Black rook needs to threaten mate from a square where the knight is prepared to block the path of White's rook.",
        "41. Rd8 Nd5": "Now Black's new mating idea is getting the king to b3, and the knight to b4 with an unstoppable mate. Black will continue an array of mating ideas that White will keep having to defend, until White can defend no longer. The only moves that stop Black from reaching the desired position of Kb3-Nb4, are Rb8 and Ka2.",
        "42. Rb8": "42.Ka2 would lose quicker after 42...Rd4 (42...Nb4  Ka1 Rxd8 doesn't work because that's stalemate)\r\nPlay could continue with 43.Ka3 Rd3  44.Ka4 (Ka2 Nb4  Ka1 Ra3#) Nc3  discovers an attack on the rook and wins it.\r\nAfter 42.Ka2 Rd4, White can try 43.Ra8, but Black wins with 43...Nc3  44.Ka3 (Ka1 Rd1#) Nb5  45.Ka2 Rb4 and Black threatens two different mate in 2's, so the game could end 46.Ka1 Rb1  Ka2 Nc3  Ka3 Rb3#, or 46.Rc8  Nc3  and White must give up the rook to stop Ra4#",
        "42... Rd4": "Now Black threatens mate, and the only way to stop it is 43.Rb2 \r\nOther moves like 43.Ra8 or 43.Rc8  fail to 43...Nc3 where Black has two different mating ideas of Rd1# or Ra4#",
        "43. Rb2+ Kc3": "The Black king's placement here is very important.",
        "44. Rb5": "Moving the rook along the b-file holds on the longest, since moving the rook along the 2nd rank loses quickly to 44...Rd1  Ka2 Nb4  Ka3 Ra1 \r\nIf White moves his king with 44.Kb1 or 44.Ka2, then 44...Nb4 wins because of the horribly placed White rook, and you can easily find winning sequences against all of White's possible replies.",
        "44... Nb4": "The difference with Nb4 in this variation, is that the rook is not horribly placed on b2 anymore, so White can defend the mate threats longer with a rook check.",
        "45. Rc5+ Kb3 46. Kb1": "White's only other defense to the Rd1 mating threat was 46.Rc1, which loses quicker to 46...Nc2  47.Kb1 Na3  48.Ka1 Ra4 and White cannot stop the mate in 2 threats (Nc2  Kb1 Ra1#) and (Nc4  Kb1 Nd2#) without giving up the rook.",
        "46... Rh4": "Black must make room on the d-file by moving the rook along the 4th rank, because Black wants to play Nd3 to guard c1 so that the back rank mate threat is effective.",
        "47. Rc8": "White must maintain the rook on c-file to stop back rank mate. 47.Rc1 loses quicker because play could continue:\r\n47.Rc1 Na2 48.Rg1 Rh2 and White must give up the rook to stop the threat of Nc3  Ka1 Ra2# or Nc3  Kc1 Rc2#",
        "47... Rh1+ 48. Rc1": "This can be considered the key position to winning rook and knight vs. rook when the enemy king is trapped. Even if this ending occurs during a drawn position, you may be able to reach this position against a faulty defense from your opponent. This is an important position to remember, and Black's next move is the first in a complicated way of putting the White rook in zugswang.",
        "48... Rh8": "This stops the rook from coming onto the 8th rank, and you'll see why every move is critical from here. In this key position, there are many ways the game could end. If White's rook moves along the 1st rank, then Rh3 stops a 3rd rank rook check and Black's mating idea is Na2 (Rd3 first if Kc1) Rh2 followed by Nc3  with mate on Rc2# or Ra2#\r\nDuring the mating process, White cannot move the rook off the 1st rank because of many mate threats beginning with Rh1 ",
        "49. Rc7": "This is where Black begins harassing the rook so that he can gain tempo in the attack.\r\nIf 49.Rc5, then 49...Nd3 50.Rb5  Kc3 reaches the same position that occurs on move 55, except that Black's rook is on e8 instead of h8 (which doesn't matter)\r\nIf White moves his rook along the 1st rank on move 49, then Black has the same idea explained earlier of Rh3 (stopping rook check) then Na2 (Rd3 first if Kc1) followed by Rh2 followed by Nc3  with mate to follow (Ra2# or Rc2#). The White rook has to sit passively on the 1st rank during that mating process.",
        "49... Nd5": "Reason for Rh8's 8th rank restriction now becomes clear, because if the White rook had been allowed access to the 8th rank, then Black couldn't have done this tempo move that threatens Rh1  Rc1 Nc3 \r\nIf White plays Rc1 to stop Rh1 , then Nc3  Ka1 Ra8#\r\nChecking on b7 survives the longest.",
        "50. Rb7+ Kc3": "Black has made progress in restricting White's rook to bad squares. Black's new mating idea is Rh1  Ka2 Nb4  Ka3 Ra1#, so the only way White can defend the threat is 51.Ka1 making room for Rb1\r\n51.Ka2 loses to Nb4  where Black has Rh1# or Ra8  next move.",
        "51. Ka1 Re8": "This is a patient move that continues the process of zugswanging White's rook to bad squares. White's rook is forced onto b5, because that's the only way to preserve the defense of Black's mate threats.\r\n52.Rb2 is met with 52...Nb4 and Black mates easily since the White rook has no effective checks.",
        "52. Rb5 Nb4": "Compare this with the variation discussed last where White plays Rb2 instead of Rb5. Black's mate is a little more complicated since White does have an effective check here. The reason Black had to get White's rook to b5 instead of b7 will become clear soon.",
        "53. Rc5+ Kb3": "54.Rc1 here is met by 54...Nc2  55.Kb1 Na3  56.Ka1 Ra8 with the deadly mate in 2 threats of Nc2  Kb1 Ra1# and Nc4  Kb1 Nd2#",
        "54. Kb1 Nd3": "The reason Black had to get White's rook to c5, is because Black needs this tempo move to make progress in the attack, now White's only move is Rb5  because of Black's Re1 threat.",
        "55. Rb5+ Kc3": "The difference in this position and the position with White's rook on the 7th rank, is that White cannot check on the c-file, where White could've checked if the rook hadn't been removed from the 7th rank. Black's patient Re8 move earlier served great purpose, and Black's long-awaited mate is coming closer. White cannot do anything in this position, because there is no defense to Re1  Ka2 Nb4  Ka3 Ra2#",
        "56. Rb7": "Any other move is just as losing. Black's mating attack was able to be carried out by zugswanging the White rook and forcing it onto a bad square where Black can gain tempo in the attack, and the rook isn't in a position to check and stall his death. This shows how proper calculation and choosing the right mating ideas can slowly squeeze an opponent in and endgame like this. I hope you enjoyed viewing this study, even if you never get an endgame like this, just the ideas and technique used to win this ending can still help you in your games.",
        "56... Re1+ 57. Ka2 Nb4+": "White is totally lost, because of 58.Ka3 Ra1#\r\nWhite can sacrifice his rook to stall Black's win for longer, but Black should have no problem winning the simple ending of king and rook vs. king."
    },
    "url": "https://gameknot.com/annotation.pl/complicated-endgame-study-no-3?gm=8815",
    "gameName": "Complicated Endgame Study No.3",
    "players": "rook (5) vs. rook and knight (8)",
    "opening": "Scandinavian (centre counter) defence (B01)"
}