{
    "moves": {
        "1. e4 f5 2. Ba6 Nxa6 3. Qg4 fxg4 4. Nf3 gxf3 5. b4 fxg2 6. b5 gxh1=Q+ 7. Ke2 Qxh2 8. bxa6 d5 9. axb7 dxe4 10. bxa8=R Qxd2+ 11. Nxd2 e3 12. Rxa7 Qxf2+ 13. Kd3 exd2 14. Bxd2 Qxd2+ 15. Kc4 Qxc2+ 16. Kd5 Qxa2+ 17. Ke5 Qd2 18. Rxc7 Bg4 19. Rxe7+ Kd8 20. Rxg7 Be7 21. Rxh7 Ke8 22. Rxh8 Kf7 23. Rxg8 Ba3 24. Re8 Kg6 25. Rb1 Kh5 26. Kf6 Kh4 27. Kg6 Kg3 28. Ree1 Bc1 29. Rbxc1 Kh4 30. Rcb1 Kg3": "This is the starting position of the endgame study. Many players would think that this kind of ending is a draw since Black's material advantage isn't great, but Black wins because the bishop and queen can coordinate well on the open board, while White's rooks are stuck having to support each other. Black's idea is to overcome White's king with a mating attack, that will eventually force White to sacrifice his rook for a bishop, going into a simpler ending.",
        "31. Rb3+": "White can also try Rg1  Kf4 Rgf1  Bf3 but Black can still dodge the rook checks and start a mating attack.",
        "31... Kf4": "You should use your king aggressively in the endgame, since the power of a king increases when there aren't many pieces left on the board to mate an exposed king.",
        "32. Rbe3": "After Rf1  Ke4 White has no more checks, and his rooks are poorly coordinated. In this variation, White's rooks are better coordinated to defend.\r\nSupporting the rooks with Ree3? is a mistake because White isn't threatening any checks. Black gains a lot of tempo in the attack after Qd6  Kg7 Bh5 because White's rooks have to defend instead of threatening disrupting rook checks.",
        "32... Bf5+": "Black's attack is slowly pushing White toward the edge. Once White's king is cornered it should be easy to find a mating tactic. White gets mated if he moves onto the edge, Kh5 gets mated by Qh2  and Kh6 loses after Qg2 threatening unstoppable mate with Qg6# or Qg5#",
        "33. Kf6": "Kf7 and Kg7 lose just as fast",
        "33... Qd6+ 34. Kg7 Kg5": "Black's pieces just continue to surround the king while the rooks are only onlookers who can throw in annoying checks every now and then. Black wants to continue the mating attack with Qh6  Kf7 Qh7  forcing the king to the back rank. A queen and bishop is a powerful attacking combo on the open board.",
        "35. Re3e7": "White's best defensive chance is to place the rook where it can interfere with the queen's attack. Rg1  is just an annoying check, because after Bg4 White has no more checks and cannot coordinate the rooks to defend as well. Even though White is going to lose anyway, it's best to make it as hard as possible for the attacker to finish the attack, because then they are more likely to screw up.",
        "35... Qf6+ 36. Kg8": "White's rook on the 7th rank is a huge speedbump in Black's attack, otherwise Black would have a lot of mating threats. Having 2 rooks is usually redundant in a position where they cannot be used as an attacking combo. Giving up your queen for 2 rooks should only be done if your rooks can become very active. ",
        "36... Qd4": "This move blocks the annoying Rg1 , and Black can easily block Rg7  with Bg6\r\nNow that Black has the White king where he wants it, the idea is to force White to give up the Exchange, going into a simpler endging. If White disconnects his rooks, then Black can sometimes find a tactic involving many checks that will eventually fork the king and rook.",
        "37. Kf7": "After Rg7  Bg6 White has to reconnect his rooks and Black gains more time. It's better for White to move his king closer to the center.",
        "37... Bg6+": "This is where the tactics come in. Endgames without pawns are purely tactical, because you have to exploit the superior attacking capability of a slight material advantage with tactics, rather than exploiting the advantage by winning pawns and promoting.",
        "38. Kg8": "After 38.Ke6 Bh5 Black's idea is to mate with Kg6 and Bg4#, and Black will have a forking tactic to win a rook if White ever disconnects his rooks. White's only check would be 39.Re5  Kg6 (threatening Bg4#) 40.Rd5 Bg4  41.Kd6 Qf6  wins a rook.",
        "38... Qh4": "Black wants to get his king to h6 without there being any rook checks. The queen blocks Rh1 so Black's king is safe and agressively placed on h6. White's king cannot escape since Kf8 loses to Qh8#.",
        "39. Re1e6": "Checking allows Kh6 and an easy win because of the queen's potential to repeatedly check and once the queen gets to the back rank White must block with a rook to where Black's bishop can take. The text move holds on the longest by stopping Kh6, becuase now Kh6 actually loses to Rh7 ",
        "39... Bf5": "The only way Black can make progress is by getting the rooks out of the way. If White moves the rook along the 6th rank, then the other rook will have to support it on that rank since the queen can check repeatedly and eventually fork one of the disjoined rooks.\r\nIf the rook goes to a6, b6, or c6, and the rooks support each other on that file, then Black's king goes to h6 and bishop goes to g6 and Black will be threatening mate on the back rank and if the rook defends back rank mate then Qg7#",
        "40. Rg7+": "Rd6 instead loses a rook after Qc4  Kf8 (If White's king ever goes to g7 then Black  skewers the rooks with Qc5 where the bishop controls both squares the rooks need to support each other on.\r\nIf White moves the other rook along the e-file, then Black's king becomes a very powerful attacker on the 6th rank.",
        "40... Kh5": "Black's pieces will invade the light squares and eventually come up with a tactic to win the exchange. If White's rook moves along the 6th rank, then Black plays Qc4  and creates a tactic to win a rook or mate. Black wins after Rd6 Qc4  Kh8 Qc8  Rg8 Qc7 threatening the rook and threatening Qh7#\r\n",
        "41. Re5": "Black has a lot of tactics on the light squares after 41.Ree7 Qc4  42.Kf8 Bg6 (threatening Qc8 and moving the e7 rook allows queen check on the dark diagonal followed by mate on the back rank. After 42...Bg6 White's only option is to check 43.Re5  Kh6 but White's rook has nowhere to run without losing it to a queen fork anyway.\r\nIf 42.Kh8 instead of 42.Kf8, then Bg6 43.Rc7 Qb4 (threatening Qf8-Qh6) 44.Rce7 Qb8  45.Rg8 Qf4! and White cannot stop Qf6  or Qh6  without giving up the exchange.",
        "41... Qf6": "42.Ree7 and other moves lose to Be6  Kh8 (Kh7 Qh6#) Qf8  Kh7 Bf5 \r\nIf White keeps the bishop pinned along the 5th rank, then Black wins easily after Kh6, where White still has the Be6  idea without the pin.\r\n42.Re8 loses to Kh6 threatening Qxg2# so Black has to play Rge7 to stop Be6  and Black wins with Bb1 because there is nothing stopping Ba2 , White's e8 rook is stuck defending e7, and the e7 rook is stuck defending Qg7#, so neither can interfere with Ba2 ",
        "42. Rge7": "White must stop Be6 without giving Black any other tactics.",
        "42... Kg6": "White's rooks are stuck supporting each other, the queen and king are powerfully placed to stop attacks from the rooks, so there really isn't anything White can do at this point. White's king is stalemated, so all Black needs to do is get in a bishop check, such as a Bd3-Bc4  maneuver.",
        "43. Re5e1": "All White can do is maneuver the rook along the e-file and threaten the annoying Rg1  which makes it so that Black has to spend many extra moves recoordinating his pieces.",
        "43... Bg4": "White's e7 rook is stuck defending against Qg7# and blocking Qd8 , so White can only move his other rook. All Black needs is one bishop check to win, but first he needs to block rook checks and limit White's options.",
        "44. Re1e3": "After R1e5, Bf3 threatens Bd5  and the bishop is invincible since the rooks have to defend each other. After R1e4, Bd1 threatens Bb3  and once again, the bishop is invincible since one rook defends against Qg7# while the other rook defends against Qxe7, Black will win a rook if White takes the bishop.\r\nThe text move doesn't allow the bishop check maneuver since it threatens Rg3  if the bishop moves.",
        "44... Qd4": "Black's superior attacking forces have proven too much for White's pieces to handle. Having a queen and minor piece for 2 rooks is usually a crushing advantage and the rooks will end up defenseless. White's rooks are stuck on the e-file, because if White only has 1 rook on the e-file, then Qd8  will be mate. The e7-rook is still stuck defending against Qg7#, so moving the e3-rook along the e-file is all White can do. Kf8 loses to Qh8#",
        "45. Re3e5": "If 45.Re1 or 45.R3e4, then 45...Qd5  46.Kf8 (or h8) Qd8  47.Re8 Qf6  48.Kg8 Qg7#\r\nWhite's defensive options are quickly slimming down, which is what happens in a lot of pawnless chess endings. The superior pieces have more move options and better coordination, while the weaker pieces are struggling just to find 1 defensive resource. When the weaker side runs out of moves, they often find themself in zugswang. There are a lot of zugswang tactics in pawnless endgames.",
        "45... Qd8+ 46. Re7e8 Qd6": "White's rooks are running out of defensive power. White can only move his e5 rook because if R8e7, then Qb8  Re8 Qb3  Kh8 (Kf8 Qf7#) Qh3  Kg8 Qh7  Kf8 Qf7#\r\nWhite should defend the 7th rank with the e5-rook since other moves along the e-file allow Qd5  Kh8 (Kf8 Qf7#) Qh5  Kg8 Qh7  Kf8 Qf7#",
        "47. Re5e7 Qf6": "This is similar to the positions after move 41, where Black is trying to get in a bishop check, except now White's rooks are forced to defend, unlike after move 41, where White's rooks can be disruptive. White has nothing, because the e8-rook must support the e7-rook, and the e7-rook is defending Qg7#, White's e7-rook can only move along the 7th rank, allowing Be6  so Black's win is clear now. The superior attacking pieces have forced zugswang so that the defenders are forced to disrupt the defense.",
        "48. Ra7": "I will compare the continuation with positions where White's rook is on c7 or b7",
        "48... Be6+": "The long awaited bishop check has finally come in, and Black has won the exchange, going into a simpler ending.",
        "49. Rxe6 Qxe6+ 50. Kf8": "Kh8 loses to Qe8#, so now all Black needs to do is come up with a tactic to win the rook. Queen vs. rook is always a win, but most positions are more complicated where the queen has to use technique to force the king away from the rook, and then the queen can win the rook with a forking tactic. If the rook was on b7 here, then the queen wins the rook with Qc8 .\r\nIf The rook was on c7 here, then the queen wins the rook with Qd6  Re7 Kf6.\r\nThere is almost always a rook winning tactic in queen vs. rook when the king and rook are not supporting each other.",
        "50... Kf6": "Black can win the rook with Qc8  Ke7 Qc5  fork, but if you want to be more accurate, this move mates faster by forcing the rook to a square where it can be won on the 7th rank, so that Black's queen is already in a mating position. Black has forced mate in 3 moves.",
        "51. Rc7 Qd6+ 52. Ke8 Qxc7 53. Kf8 Qf7#": "Endgames without pawns are purely tactical and you must have good tactics in order to play them correctly. Black started with only a 2-point material advantage, but ended up forcibly winning both rooks for only the bishop, because of the tactics the stronger attacking units were able to unleash upon the weaker defensive units."
    },
    "url": "https://gameknot.com/annotation.pl/complicated-endgame-study-no-6?gm=9785",
    "gameName": "Complicated Endgame Study No. 6",
    "players": "2 rooks (10) vs. queen-bishop (12)",
    "opening": "Fred (B00)"
}