{
    "moves": {
        "1. Nf3 e5 2. Nxe5 Nc6 3. Nxc6 a5 4. Nxd8 a4 5. Nxf7 a3 6. Nxh8 axb2 7. Nf7 g5 8. Nxg5 bxa1=Q 9. Nxh7 Qxb1 10. Nf6+ Ke7 11. Nxg8+ Ke6 12. h4 Qxc1 13. Qxc1 Rxa2 14. Qa3 Rxa3 15. c3 Rxc3 16. d3 Rxd3 17. e3 Rxe3+ 18. Kd2 Rh3 19. f3 Rxh1 20. g3 Rxf1 21. Nh6 Rxf3 22. Nf5 Rxg3 23. Nd6 Rh3 24. Nxb7 Rxh4 25. Na5 Rc4 26. Nxc4 d6 27. Nxd6 c5 28. Ke3 c4 29. Nxc4 Bg7 30. Nd2": "This is not a very common endgame, but it could easily happen in one of your games. A lot of players don't have the technique to win this, but even if you never get an endgame like this, the main reason I'm showing this endgame is to better understand how to attack the king with two bishops on a wide open board.",
        "30... Bh6+ 31. Kd3 Ba6+": "In the middlegame, two bishops are usually strongest when controlling adjacent diagonals. In wide open games where control of precise squares is critical, another technique of using the bishop pair is to criss-cross them since they take away a lot of squares from the enemy king, White is forced to head closer to the edge on the queenside",
        "32. Kc3 Bg7+": "The criss-crossing cornering method is demonstrated again. White will be cornered toward the a1-corner, or the a8-corner, depending on which direction White runs in.",
        "33. Kb3 Kd5 34. Kb4 Bd3": "Once the criss-cross method has been used to take away a group of squares from the king, the bishops can use the adjacent-diagonal method to maintain the restriction of the king, while your king gets into another position where you can use the criss-cross method to push the enemy king back further.",
        "35. Nb3": "White wants the knight close by the king, since the knight will be trapped if it ventures off into the range of the bishops (which is what Black is aiming for). Also, if White moves his knight out into the range of the bishops, Black can get cornering tempos while attacking the knight.",
        "35... Bg6": "This ending will also show the bishops' advantages to be able to waste moves. White's king and knight cannot waste moves, so the bishops will be able to zugswang them into the corner until the knight is forced away from the king, and will get killed in the attacking ranges of the bishops",
        "36. Kb5 Bf6": "Black wants to play the restricting Be7",
        "37. Kb4 Bh4": "Black wants to use the criss-cross cornering method with Be1 \r\nAfter Kc3 Be1  White is forced close to a1 since Nd2 Kc5 zugswang would hang the knight.\r\nKb5 allows the restricting Be7, so Black can make progress in all scenarios.",
        "38. Na5 Bh5": "This is a very important move. The bishops want to get to e2 and e1 to force the king closer to the corner, and this is also a waiting move since certain moves by White will allow cornering progress that wasn't able to be made this move. Like if Kb5 or Ka4, then Be8 forces the king down since moving back to b4 allows Be1  winning the knight.",
        "39. Nb3": "Kc3 hangs the knight, and other king moves give Black cornering tempos by either checks or attacking the knight. Nb3 also gives Black cornering tempos, but White is lost in all variations.",
        "39... Be1+ 40. Kb5 Be2+": "White must choose which corner to die in. If Ka4, then Black corners the king easily with 41...Bd1 42.Ka3 Kc4 (attacking the knight) and there is an invisible forcefield restricting White's king to the rectangle of c1-c4-a4-a1 where it is easy to get White into zugswang from there.",
        "41. Kb6 Kd6 42. Na5": "If White doesn't get his knight and king close together, then the bishops will keep harassing the knight and taking away its flight squares until it is trapped.\r\nNc5 loses to Bf2",
        "42... Bf2+ 43. Kb7 Bd4": "This waiting move forces White to allow something Black couldn't have done last move. White moving his king allows Black to tighten the barrier more.",
        "44. Nb3 Bc3": "This takes away the knight's flight square, and Black is threatening to trap the knight with Bc4, and the knight's escape squares will be guarded if it's on c1, so one threat by the non-restricting bishop wins the knight.\r\nKb6 is needed to stop the knight winning threat",
        "45. Kb6 Bc4 46. Na5": "If Nc1 then one threat by the dark-squared bishop wins the knight.",
        "46... Bd4+ 47. Kb7 Be6": "This restricts the c8-square, and White is forced to allow Black to make progress.",
        "48. Ka6": "Kb8 allows the Bb6 cornering tempo, while Nc6 Bd5 loses the knight.",
        "48... Kc5 49. Nb7+": "Forced since moving the king will lose the knight.\r\n49.Kb7 Kb5 50.Nc6 Bd5",
        "49... Kb4": "The text move avoids Black's knight winning tactic, while other knight moves will allow it.\r\n50.N(not d6) Bc8  51.Nb7 Kc4 zugswangs the king away from defending the knight.",
        "50. Nd6 Bc5": "Black can just simply attack the knight. If Nb7, then Bc4#. Moving the knight to a square that isn't b7 allows Bc8# so White has lost the knight. If White had tried moving the knight away earlier, then Black could simply trap the knight using the bishops on the open board.",
        "51. Kb7": "This is the only move that doesn't get mated next move, but White has lost the knight, giving Black an easily won game",
        "51... Bxd6 52. Kc6 Bc5 53. Kc7 Kb5 54. Kd8 Kb6 55. Ke8 Kc6 56. Kd8 Bf7 57. Kc8 Be7 58. Kb8 Kb6 59. Kc8 Be6+ 60. Kb8 Bd6+ 61. Ka8 Bd5#": ""
    },
    "url": "https://gameknot.com/annotation.pl/complicated-endgame-study-no-4?gm=8878",
    "gameName": "Complicated Endgame Study No.4",
    "players": "knight (3) vs. 2 bishops (6)",
    "opening": "Reti opening (A04)"
}