{
    "moves": {
        "1. e4 e6": "1...e6 marks the French Defense.  The opening has a reputation for being solid, but prevents early development of the queenside bishop.",
        "2. d4": "White normally advances the d-pawn to claim the center and open both sides for development.",
        "2... d5": "Initial tournament position.\n\nThis is Black's most common reply.  Black normally focuses on the queenside, while White concentrates on the kingside.\n",
        "3. Nc3": "I relied heavily on the GameDB for most of the games.  This is the Main line and my most common move in the tournament.",
        "3... Nf6 4. e5": "This establishes the pawn structure typically associated with the French Defense.  Black usually pushes the c-pawn at some point to attack the base of White's pawn chain.",
        "4... Nfd7 5. Nce2": "Preparing for c3 to maintain my pawn chain.  \n\nThe normal move, according to the GameDB, is f4 (which I played in other games in the tournament).  This is the 3rd most common, with a winning percentage for players above 1900.  I didn't check the 1500  stats, but perhaps I should have since it shows a slightly higher win percentage for black.",
        "5... c5 6. c3 Nc6 7. f4": "I don't normally like to move my f-pawn early in the game, but I felt safe doing it here.  I can't give the reasons for playing it, rather than 7. Nf3, but it does seem to be a common move.  ",
        "7... cxd4 8. Nxd4": "The GameDB shows a winning percentage of 80% for 1500  players over 5 games, for 8. cxd4, and even odds for Nxd4.  There's no data for 1900  players after 7...cxd4.  I know 5 games isn't enough data to base any decisions on, but it's the only thing I have to compare to.  :)\n\nI believe I played this to help open by bishop and queen.  Either way, this is where I have to stop relying on the database to help and start thinking things through a lot more carefully.",
        "8... Bc5": "I immediately regretted playing my last move.  My knight becomes the focal point for the next 10 moves or so.  It's much better to have a piece attack or defend a focal point rather than occupy it.  I can't move it, since that gives the black bishop too much control, including preventing castling (thanks to my 7. f4 play).\n\nLooking at it again, perhaps 9. Nc2 followed by 10. Be3 would have worked.  Comments are welcome.  :)",
        "9. Ngf3": "Defends and helps clear the way to castle.  In retrospect, Be3 may have been better, since I wouldn't have had to work about my b-pawn.",
        "9... Qb6": "At this point, it's clear that Black has initiative and is forcing me to dance.  My bishop is stuck defending my b-pawn and I still need to do a lot of work to move my king safely out of the center.",
        "10. b3": "Frees my bishop from guard duty, but does nothing else useful.  I thought about playing b4, attacking the bishop, but was afraid of Nxb4 11. cxb4 Bxb4 , stripping away all my defenses and attacking my king directly.",
        "10... O-O": "Black pauses to castle.  Always look to defense before overextending yourself in an attack.  This particular move also positions his rook on the f-file, which he'll quickly open.\n\nStop and examine this position for a moment.  Black is clearly in charge of the game.  All his minor pieces save his c8 bishop are in play, he's castled, and he has a solid pawn structure.  Conversely, I've only moved my knights, can't castle, and my pawns are in disarray.  None of my moves have been *wrong*, but I haven't developed with a solid plan and have an uncertain future at best.",
        "11. Be3 f6 12. Be2": "Preparing to castle before the open f-file locks my king in the center.",
        "12... fxe5 13. fxe5 Ndxe5 14. Nxe5 Nxe5 15. Bf2": "There was little I could do about the previous exchange.  I lost a pawn and in the process, lost the center.  Castling is my biggest concern.",
        "15... Nc6 16. O-O e5 17. b4": "I have no way to protect my f2 bishop, so need to leave my knight in place.  I did a lot of calculation here and decided to attack the bishop since I felt like I had little choice left.\n\nI think something like the following line would have been better for Black (giving him connected passed pawns and possibly winning a piece):\n17...Nxb4 18. cxb4 Qxb4 19. Nc2 Bxf2  20. Rxf2 Qc5",
        "17... Bxd4 18. cxd4 Nxd4 19. Bxd4 Rxf1+ 20. Bxf1 exd4": "Even though Black has a two pawn advantage, it's minimal due to the fact that they're doubled and isolated.  However, they are passed pawns, so I need to watch carefully and blockade them if possible.",
        "21. a3 Bf5 22. Bd3 Be4": "I thought this was a particularly good move.  Black avoids the exchange, instead setting up a situation in which his bishop attacks my king's position.  I can't capture, since that would undouble his pawns and most likely allow him to queen one of them.\n\nThe focus for the next few moves is the e4 square and whether or not I can capture or he can undouble his pawns.",
        "23. Qc2 Qc6 24. Qb3": "This pins Black's d pawn, leaving his bishop unprotected.",
        "24... Bxd3 25. Qxd3 Qc3 26. Rd1 Re8": "During this game, the exchanges and several other plays were setup as conditional moves.  Black setup a series from this position expecting me to take his d4 pawn.  I had also calculated several different possibilities and had expected the moves to take a certain course.  As you may expect from this comment, one of us missed a move.  Try to spot it during the next exchange.",
        "27. Qxd4 Re1+ 28. Kf2 Rxd1 29. Qxd1 d4": "Hopefully, you spotted what neither of us did.  Black's queen was left hanging after 28...Rxd1 and I could have won with 29. Qxc3.  Black missed it when setting up the conditional moves and I missed it when clicking through, since I just responded to the move instead of thinking about each resulting position.\n\nAt any rate, Black now has 1 passed pawn, but his king is too far away to help.  If I can exchange queens, I should be able to capture the pawn and finally even up the game.",
        "30. Ke2 Qe3+ 31. Kf1 d3 32. Qe1 Qxe1+ 33. Kxe1 Kf7 34. Kd2 Ke6 35. Kxd3 Kd5": "Opposition is when two kings face each other and one must move away, allowing the opposing king access to a critical square.  In this case, access would be to the pawns on one side or the other.\n\nBlack starting thinking before I did and positioned his king directly opposite mine.  Since he has the greater number of possible pawn moves, he should be able to lock the board in a favorable position and force my king to step aside.",
        "36. g3 g5 37. h4 gxh4 38. gxh4 b5 39. Kc3": "Since h5 is met with h6, I decided to save the potential move and attempt to trade pawns on the queenside.  If black tries to run for the kingside, I should have enough time to queen first.",
        "39... Ke4 40. Kb3 Kd3": "Instead of attacking my h pawn, he locks my king against the wall.",
        "41. a4 a6 42. h5 h6 43. a5": "At the time, I thought only of gaining opposition and forcing him away from the queenside pawns.  I overlooked the fact that he could play Kc4 and I could not.\n\nIn comments after the game, Black said that trading pawns and allowing Black to capture my b-pawn gives me the opportunity to gain opposition and force a draw.  It would looks something similar to the line below, but could be far more complicated.  The simple rule to maintain opposition is to copy your opponent (move diagonal if s/he does, don't if s/he doesn't).  Opposition switches anytime another piece is moved, so be sure to account for pawns moves to obtain the desired final position.\n\n43.\taxb5 axb5\n44.\tKa3 Kc4\n45.\tKa2 Kxb4\n46.\tKb2 Kc4\n47.\tKc2 b4\n48.\tKb2 Kc5\n49.\tKb3 Kb5\n50.\tKb2 Kc4\n51.\tKc2 b3 \n52.\tKb2 Kb4\n53.\tKb1 Kc3\n54.\tKc1 b2 \n55.\tKb1 Kb3 =\n\nBlack can abandon the b pawn and run to capture my h-pawn, but I should have time to capture his b-pawn and run for h1, where he'll be unable to force a win.",
        "43... Kd4": "0-1\n\nI resigned since I'm forced away from my b-pawn and lose:\n44. Ka3 Kc4\n45. Ka2 Kxb4\n46. Kb2 Kxa5  after which he can control opposition with his a-pawn while pushing his b-pawn.\n\nQuestions and comments appreciated, especially if you find any mistakes.  :)"
    },
    "url": "https://gameknot.com/annotation.pl/conditional-blunders-and-opposition-miscalculations?gm=12955",
    "gameName": "Conditional blunders and Opposition miscalculations",
    "players": "anotherminorpawn (1730) vs. starkestaffan (1810)",
    "opening": "French (C11), Steinitz, Bradford attack"
}