{
    "moves": {
        "1. d4": "Although I like 1.e4 since it's in my style, the stronger players prefer this opening.  Plus, it's what Sue is most used to, so I was outvoted there.",
        "1... Nf6": "This could've also become the QPG with the obvious 1...d5, something tells me that he wanted us to play the Colle's Franketort System since 2.e3 was a unanimous agreement.",
        "2. e3": "Although it is a known, Fritz disagrees with our decision.  Even though I agree that this is solid, but according to them, 2.Nf3  With the main continuation being 2...d5 3.Nc3, e6 4.e3, Nc6 5.Bd3, Bd6 6.0-0, 0-0 7.a3, h6 8.Bd2, Ng4 9.Nb5",
        "2... g6": "He wanted a nice long diagonal for his B, but I think he also wanted to transpose this into the KID since e3 is played later on.  But, we put a stop to that with our next move.  And, according to Fritz's analysis, black didn't play the best move either.  According to Fritz, though, black's best move was 2...d5 with the continuation being 3.c4, e6 4.cxd5, exd5 5.Nc3, c5 6.Nf3, Nc6 7.Bb5, a6 8.Bxc6+, bxc6 9.Ne5, cxd4 10.Nxc6  In addition, Fritz also indicated with the best move of 2...d5, the position is equal.  But, with this move, white now has a 0.03 with the most common move being 3.Nf3 as that should now lead to 3...Bg7, 4.c4 0-0 5.Nc3 d6 6.Be2 c5 7.0-0 cxd4 8.exd4 Nc6 9.d5 Ne5 10.Nxe5 dxe5 11.Be3 Bf5 12.g4 Bd7 13.h3  Therefore, we don't play the most common move since we all agreed on 3.Bd3. ",
        "3. Bd3": "With this move, the advantage increases to 0.04 in our favor according to the analysis, after black's move.  And, now, the analysis agree with us, until our fifth move.  That's because we played 5.c4, but we did discuss about castling.  Actually, I believe it was ION who told us what might happen if we castle which is how 5.c4 was decided upon.  But, according to the analysis, that would've been our best move.  That's because they continue with 5.0-0 d5 6.c4 dxc4 7.Bxc4 Nc6 8.Nc3 a6 9.Ng5 h6 10.Nge4 Nxe4 11.Nxe4 b5 12.Bb3 e5 13.dxe5 Nxe5 14.Bd5.  But, after we play our fifth move, the position is equal.  As now, the main continuation is 5...c5, 6.Nc3 cxd4 7.exd4 d5 8.0-0 Nc6 9.Be3 dxc4 10.Bxc4 Ng4 11.Rc1 Bf5 12.h3 Nxe3 13.fxe3 Rc8 14.g4 Nb4 15.Qe2 Qc7 16.gxf5 Qxc4 17.Qxc4 Rxc4",
        "3... Bg7 4. Nf3 O-O 5. c4 d6": "But, according to them, despite 5...d5 being the most common, there is nothing wrong with this move, whatsoever, and gives this as an equal position.  Now, they say that we should continue by castling with the main idea of 6...c5 7.d5 Bg4 8.h3 Bxf3 9.Qxf3 Nbd7 10.Nc3 Ne5 11.Qe2 Nxd3 12.Qxd3 Nd7 13.e4 Ne5 14.Qe2 e6 15.Be3 Qh4 16.Rad1 Rad8 17.b3",
        "6. e4": "?! Unlike before, however, they give this as an inaccuracy, as now, black has a 0.08 advantage after 6...Bg4 with the continuation being 7.Nc3 Nc6 8.Be2 Bxf3 9.Bxf3 e5 10.d5 Nd4 11.Be3 Nd7 12.0-0 c6 13.Bg4 Nf6 14.Bh3 Qb6 15.Qd2 Qb4 16.dxc6 bxc6",
        "6... Nbd7": "?! But, this move gives us a 0.05 initiative according to them with our next move.  They continue this afterwards with 7...c5 8.d5 Ng4 9.0-0 Nde5 10.Nxe5 Nxe5 11.Be2 f5 12.f4 Nf7 13.Qc2 fxe4 14.Nxe4 Qb6 15.Rb1 Bd4+ 16.Kh1 Bf5 17.Bd2 a6 18.Rfe1",
        "7. Nc3 e5": "?! With that being said, Fritz gives this another inaccuracy.  But, it's not nearly as bad because our edge has diminished from 0.05 to 0.03 starting with our next move.  From there, the line continues with 8...Nc5 9.0-0 a5 10.h3 b6 11.Bg5 Qd7 12.Qd2 Bb7 13.Be3 c6 14.b3 Rac8 15.Rac1 Ra8 16.Bc2 cxd5 17.exd5 a4 18.b4  Even better would be 12.Be3 Bb7 13.Qe2 c6 14.h3 cxd5 15.exd5 Rac8 16.Rad1 Ba6 17.Ng5 Rfe8 18.b3 as now, we have a 0.04 advantage.   ",
        "8. d5 c5": "?! I did lose the links with all of those variations from before, so now, it's just move by move.  However, I believe it changes because the first few moves were similar to the Game DB on this website.  So, Fritz is calling this as another inaccuracy and keeps us a little better after 9.a3  Of course, we don't stick to it as 9.Bg5 is agreed on.",
        "9. Bg5": "?! But, with this move, Fritz says that we lose a little bit of our advantage.  So, we go from a minimum to only a slight edge as black's best move is 9...Qc7  ",
        "9... Nb6": "?! But, with this move, what we lost comes back after 10.b6 or 10.Qe2 which according to Fritz is our best move.  ",
        "10. Qd2": "?! But, with this move, we've lost our initiative.  As now, The position is equal after 10...Bg4.",
        "10... Bd7": "?! However, this also gives us back the initiative, if we play 11.b3, 11.h3, or 11.0-0  In it says that, \"White is minimally better.\"",
        "11. O-O-O": "?! Once again, Fritz does not agree with this decision.  And, it was hard because castling short also came up.  But, according to them, this is inaccurate as we lose a little bit of our intitative after 11...a6 or 11...h6 as we go from minimum to only a slight advantage. ",
        "11... Na4": "But, Fritz says that this move is even better then those other positions as this equalizes the position.  It suggested that we exchange with 12.Nxa4, but 12.Bc2  Let's see what Fritz says about that.",
        "12. Bc2": "?! They're calling this an inaccuracy because black now gets a slight initiative with his next move.  That, in return forces our next move to prevent the loss of a piece.  What this means, which I agree with is that his Na4 is the weak N since it's on our rim.  Whereas, our Nc3 was better placed, and thus, the strong N.  So, this exchange winds up hurting our position.  After that, black penguin_ maintains his advantage after 13...b5 since Fritz also agrees with this.",
        "12... Nxc3 13. Qxc3 b5 14. Nd2": "However, Fritz gives a very interesting line and says that black's advantage increase by sacking a piece.  They suggest 14...Nxd5 after which, \"Black is clearly better.\"  I don't agree with that since I don't see an immediate advantage, but I'm still gonna assume that they're correct because TA outlined that Fritz analysis is an equivalent to an analysis that you'd get from, I believe it is a 2100 or 2200 rated player.",
        "14... b4": "?! But, they gave this as an inaccuracy because after 15.Qf3 or 15.Qe3 black's edge now decreases.  As now, his advantage is slight.",
        "15. Qg3": "?! But, with this move, black's initiative increases a little bit and now ends up with a minimum advantage after 15...Re8",
        "15... a5": "?! With that being said, Fritz disagrees with black's decision and says that his advantage decreases to only slight if white plays 16.h4, 16.Kb1, or 16.f3.",
        "16. Bd3": "But, they said that this was just as good, where black's edge remains slight.  They recommended 16...h4, 16...Kb1, or 16...f3",
        "16... a4": "They also gave this move as just as good and recommended 17.h4, 17.Kb1, or 17.h3 for white.  However, the analysis stops here.  That's because, up until this point, this game was continuing at, \"Chicoboy's Legacy\" Club.  But, at this point, it stops working out.  Therefore, someone, unfortunately, wound up leaving that club.  And, the thread which had the discussion that led to this point got deleted.  So, I used Fritz to fill in the gaps.  If you'd like, I can continue with this analysis, but it would have to be under commented annotations as I'm worried that there will be so much that the game gets deleted.  So, let's start with the discussion here.  So, Qa4 is the move that we mentioned, but that was a typo, so that we don't get confused because Qh4 is what we're alluding to.  Sue: Ion had suggested the following as possible moves before I resigned from the club. Qh4', f3,and h3. I quite. like Q h4.  Joe: I also do. Those other moves are good, but I think that bringing the Queen on that square is more powerful and forceful.  ",
        "17. Qh4": "Sue: Move made by white Qa4.",
        "17... a3": "Sue: Move made by black a3.  Joe: In this position, I did consider exchanging with bxa3, but my fear is, if we played that, instead of taking back with the pawn, he can recapture with the Rook which would give him a passed pawn. A known way to stop this is with b3, as not only haven't we've exchanged, but we prevent a passed pawn with a pawn chain.  Sue: Seems like the best idea my vote also goes with b3.  Ron: I would vote also for b3 for reasons mentioned \n",
        "18. b3": "Sue: We played b3.",
        "18... h6": "Sue: Black has moved h6. My vote is for Be3.  Joe: Be3 is also my vote. I was thinking about Bxf6 which is the only other option that doesn't lose material. But, I don't think that exchanging is the way to go, in this position, because it's unclear if we need the pieces or not. Plus, our Bg5 appears more active then our his Nf6.  Ron: I vote for Be3 seems to be a good choice!  Sue: I have had second thoughts BxP BxB QxB and we are up a pawn. Think about it after that I might be a good idea to play Qg3 and push the h pawn to try and. breakthrough. Or try a Rook lift along the h-file. Blacks bishop is preventing our breakthrough.  I am doing an online chess course at that is where I got my ideas from.  Joe: I agree with Sue. Thing with Be3, is that black can answer with 1... g5. I'm thinking about this because after something like 2.Qg3, Nh5 3.Qg3, g4 4.Qe2 white has lost some tempii which could play an important role at this phase. If we take right away, losing time wouldn't be a problem. And, we prevent black's Nf6 from becoming more powerful.   ",
        "19. Bxh6": "Sue: Move made BxP. Had to move running low on time. Black to move. ",
        "19... Bxh6": "Sue: Black has moved BxB. I suggest QxB as our next move. White to move.  Joe: In this position, which is where we stand, I agree. For one thing, we're a pawn up, as opposed to a piece down for pawn. Plus, with the Q on h6, black is now faced with a lot of pressure against his monarch. It doesn't happen yet, but our Bd3, Nd2, and perhaps, the Rd1 can all become a problem against black's monarch because we're, eventually, talking about buildup against that area. So, not only is it virtually forced, but even if we didn't need it to avoid the loss of material, Qxh6 would still be my vote.  Sue: I am going to move Qxh6 now because it is the only obvious move and has two sufficient votes. Black to move.  ",
        "20. Qxh6 Ng4": "Sue: Black has moved Ng4. Looks like Qh3 is the only move. Black still threatens to fork a pawn. And Bishop., with a double knight fork on the Rooks to follow. The Bishop will threaten our Queen when the knight moves so that is a discover attack. At the very least we will lose a Bishop an Rook.  Joe: That makes the position difficult. Now, it's what can we do to avoid losing the Queen. The only move that I think would prevent this is 1.Qh3, but then 1...Nxf2, forcing 2.Qf3 since the Queen is attacked twice, after which, he's gotten back a pawn, for that reason. But, more importantly is the fact that we lose a Rook for the N because of 2...NXR, either on d1 or h1. As anything else appears to lose the Queen.  Ron: Do you have a suggested move?  Joe: Yes. As much as, I don't like it, Qh3 is the only move that I can suggest. In other words, I'm pretty sure that it's the only way for us to avoid losing our Queen.  Sue: I am going to move Qh3.  Black's move.",
        "21. Qh3 Nxf2": "Sue: Black has move Nxp. It's a choice really between Qh6 and Q f3 I choose Q f3.  Joe: I agree that those are the only options, But, I, believe it or not, like Qh6 the best. After he takes with ...NXR and we take back (which would happen regardless), our Nd2 would become realibility. With the Queen on h6, this would make Nf3 effective later on, as we're now threatening Ng5, which would lose the Queen for N, or get him mated. If he defends against that with ...f6, before that to stop Ng5, we can still play Nh4, which threatens Nxg6, and with the Queen on h6, our threat would remain dangerous. What that indicates is that a Q and N coordinated can become quite dangerous.  Sue: I have tried out your idea on the analysing board and it looks promising. I change my vote to Qh6.  Mike: ?? If I were Black I would not take the rook for N when I can win the B on d3 with check first then go back to f2 and the fork leaves me full rook up.  Sue: Qg3 stops NxB+ so perhaps this is the best move?  Joe: I agree with Mike. I thought he was saying that it was an automatic win for black but, as usual, misunderstood. Yes, I see where and agree with Sue. As now, that won't be possible. Maybe later, Qh6 will be a vote. But, for now, I change it to Qg3.  ",
        "22. Qg3": "Sue: Moved Qg3 for white.  Black to move.",
        "22... Nxd1": "Sue: Black has moved.  Nxd1.  It is out move.  The only move RxN.  Joe: My vote is RNX, as that is best.  Mike: You might want to also consider KxN because the Rook will have to move back to the Kside anyway.  Sue: I was considering KxN and it does seem to save a tempi. I change my vote to KxN.  Joe: It's always the question if which to take with, as Susan Polgar noted. But, after what Mike said, I also change my vote because KXN seems the better of the two options. ",
        "23. Kxd1": "Sue: Move made by us, White KxN. Black to move. ",
        "23... Kg7": "Sue: Black has moved Kg7. I think we should get our knight into the action.  Joe: This is where we're at.  And, I agree with Sue because the N isn't active. As I also learned it's about where to place your pieces and bringing the N to a more active square. So, we have a few choices. But, my vote is Nf3 as that appears the most sensible. Bring it back on the first rank, and it's less active. By bringing it there, it appears to be the most mobile of any other spot. ",
        "24. Nf3": "Sue: No more votes so have decided on Nf3 as that is the best move. Have played it Black's move.  Ron: been following the game  Joe: It now boils down to what black will do.",
        "24... Rh8": "Sue: Black has moved Rh8.  Joe: Now, it's about what to do here.  It is difficult to tell. My vote would be Ng5 to enable our Queen to travel to f3, at some point, with pressure against black's f7 pawn. Were it not for us being behind, I'd find Qg5, with the idea of a Queen exchange to be a good idea. But, it's better not to liquidate here, unless we must. With that being said, I can't find a better move then Ng5.  Sue: I agree with you Joe, especially now black has control of the h file.  Ron: I vote for same Ng5.",
        "25. Ng5": "Sue: Ng5 has been played it is now black to move.  Isaac: I'm sorry I didn't see this.  I realize Ng5 has been played but it's an idle threat. \n\nThere are two striking things about this position. \n\n1. The white bishop is paralyzed. \n2. The white rook is...well, also paralyzed.     \nWhite should try to improve either of those pieces. \n\nNg5 could give the bishop a way out, but I think f7 by black is going to create a nice wall. \n\nThe only way to fight that wall is to get the white queen out of the way of the g pawn and push the pawns on g and h files. \n\nThis will also give room to white's rook. \n\nFurthermore, since the queenside is completely locked up (and white has the only knight) the king should move toward the central kingside. \n\nHowever, ultimately the game looks lost for white. There is only a little play on the kingside, and the only hope is to expose the king. That is why those pawns on h and g need to move forward. \n\nThe queen needs to move out of the way, I think  Sue: @pawntificator thanks for your much needed advice. My. suggested next move will prolly be Qe1.  Isaac: The queen is now the only defender of the knight on g5 against the black queen so you can't abandon it now. Besides I think black will just play f6 ( I accidentally said f7 earlier) forcing the knight to retreat back to f3. After that white might be able to move the queen and push those pawns. \n\nBut look for black to get the rooks on h8 and g8 or maybe f8 and run the king away to start a push of their own.  Sue: I change my suggest next move for white to Nhh3 that way black will get no where by doubling rooks.  We could either do that or move the knight back to f3 and then the Queen to e1.  \n",
        "25... Rh5": "Right after this the next move is made without a vote because I was AFK, as noted.  Sue: Black played Rh5 attacking our knight twice with Rook and Bishop. I moved our knigh back to f3 the only safe square.  Joe: This is where we are.  I'm going away tomorrow, and with a busy work week, I'll have to extend my vacation flag. Therefore, it's unlikely that I'll be able to make it back on for a week. So, I'm probably gonna have to miss a vote for two. For that reason, I'll be leaving Ron in charge of the fen, so that I know where we are when I come back onto the computer. ",
        "26. Nf3 g5": "Sue: Black. Has moved G5 my suggested move is Be2.  Ron: Current Board after 26.  I want to thank Pawn for his brilliant analysis and welcome him to help white out with our next move. While jcarp enjoys his vacation lets do our best and carry on with this game.  Joe: Thanks Ron. I came back and it's starting to settle down. Not completely out of the woods since I switched shifts, and thus, will be working tomorrow morning. Once that sets, it's settled for this week. Because of a tropical development with Tropical Storm Hermine changing it's course, with the new possibility that it'll hit my area, it could change again. But, I've learned, as noted in my annotation about Super Storm Sandy, not to get overworked with things like that. Anyway, I'm thinking about what to play next, in this position. Not sure but think that Qf2 is best here as this would enable us to play h3 followed by g4 later on with the threat against the Rook. There might be ways to stop it, but even then, I currently don't know of a move that's better, or as good as, bringing the Queen back. So, Qf2 is my vote for now but, as usual, could change.  Sue: I am going to move Qf2.  black to move.  ",
        "27. Qf2 Bg4 28. Be2": "Sue: Black has moved Bg4. White moved Be2 \n",
        "28... Bxf3": "Sue: Black has moved Bxf3, my suggested move BxB.  Ron: I also suggest Bxf3 as next move  Joe: I also like Qxf3, as it could threaten a K side attack. What it boils down is if it brings our Queen out of play? I don't think so, but if we take with the Bishop, that'll have more mobility then if we take the other way. As right now, I don't like the placement of our Be2. But, that'll change if that's how we recapture. So, under that ground, my vote is also Bxf3. ",
        "29. Bxf3": "Sue: Move made by white Bxf3.  Black's move.",
        "29... Qf6": "Sue: Black has moved Qf6? My suggested move Qe2.  Joe: We're here.  And, what I know is that we should move our Queen. But, I like the Qe2 the best as not only do we threaten the Rook, but there is another attacker on the same diagnol. So, Qe2 is also my vote since black will be faced with a little pressure. ",
        "30. Qe2": "Sue: I have just moved Qe2.  Black to move.",
        "30... Rh4": "Sue: Black has move Rh4.  My vote us for G3 driving the Rook back.  Joe: This is where we stand.  I like g3 which attacks the Rook and appears to gain tempo, but it is not my vote. As there is more and a bigger picture, being that it would appear to leave our Queen out of play since it wouldn't be able to reach the g or h files. My vote would be Rf1 to break the half pin that black has on our Bf3.  Sue: If we move Rf1, black will take our h-pawn. We are already material down. We need a tie-breaker? I shall ask redfoxrising to vot.  Joe: That is true which I overlooked. What I did was the h pawn since it is our only Rook. It's a common problem called Ghost Vision since I forgot that the pawn was there. Ok, my vote changes to g3. And, since we're nearing the endgame, I don't think that K safety is as much of a concern, at this point. But, I'm interested on Ron's take.  Ron: looked at this and suggest Qg2 now that Black's rook is on h4.  1. Qf2 Rah8 \n2. h3 R8h6 \n3. Qg3 Kg6 \n4. Ke2 Rxh3 \n5. gxh3 g4 \n6. Qxg4+ Kh7 \n7. Rg1 Qh4 \n8. Qg8# \nCHECKMATE \n\n\nMay be hope chess idea but this board is locked up so tight  Sue: What do you think of Ron's idea?  Joe: I like Ron's idea even more.",
        "31. Qf2": "Sue: I have moved Qf2 for us following Ron's idea. Black to move.  ",
        "31... Rh6": "Sue: Black has moved Rh6 I still think we should move h3 followed by Qg3 though.  Joe: This one is very difficult. I was gonna vote for g3 similar to before. But, in comparing the position with Ron's analysis, despite a different move. It's still similar and might lead to a swindle anyway. So, I think that h3 is the way to go.  ",
        "32. h3": "Sue: I have moved h3. Black's intention might be to double Rooks. ",
        "32... Qg6": "Sue: Black has moved Qg6. Not sure what to move now. Possibilities are G3, G4 or Q f3 sooner or later we will need to move our Rook in case black doubles Rooks on h-file.  Joe: I'm not sure what to do. Will need to come up with a vote later on. It is a difficult position.  Sue: I like Bg4 followed by Bf5.  Isaac: Make sure you protect all your pawns while maneuvering.  Joe:  pawntificator is right because if the B moves, white loses a pawn. With that being said my vote is Qe3, as that will enable us to play that sequence without losing more material.  Isaac: Do you have a reason for deciding between Qe2 and Qe3, or possibly even Re1?  Joe: Now that you mention it, I do. I like Re1, so my vote changes to that as it centralizes the Rook. And, this is where I apply what I've learned from elyhim. What he said was, first, centralizing the Rook is the way to control the center. Second, center control isn't just important in the opening. At the time, I only thought it mattered in the beginning, but Terence said that it is also important in the mid and end games. In fact, the annotation, where he said was an example of the importance of center control in the late mid game. And, he maintained a control with, although a different position, the exact same move since it centralized the Rook. This is what helped him to win that game.  Isaac: Black playing f5 seems to be the only immediate challenge to the position.  Joe: You're right. So, the question is what can we do prevent that, whilst, adding a defender to the pawn. What I believe is that if the B stays where it is for much longer, it's left with less mobility. And, as we know mobility plays an essential role. I just don't know what else to do.  Isaac: g4 would do it, but then our bishop loses all mobility until and IF black ever plays f5. \n\nI think protecting the pawn and trying to get the bishop out by Bf4 and Bg5 is the best plan. \n\nIf f5 is played then perhaps just take and get the bishop more mobility by moving to e4. \n\nI'm not great at endgames but it looks like this should be a draw.  although, if the rook moves to e1 then the queen can pin the bishop to the white queen. \n\nI probably shouldn't discuss this, I only look in once in a while. I haven't really been involved in the game.  Ron: We each have a Queen, Black has both Rooks we have a Rook and a Bishop, \nBlack will double the Rooks \n\nWe each have blockades and our Bishop is better at blockading than his rook. \n\nWe should get a draw I keep looking at g4 or Bg4 I support both of these.  Isaac: Bg4 looks really dangerous letting the queen behind enemy lines.  Joe: It's fine.  It doesn't matter the time in which you post for this game.  That's because I continued the game here at a later phase.  I agree, and thus, believe that we might, very well, have to give up the pawn.  It was hard, but Qe3 is indeed my vote. It still doesn't prevent f5 from being played, but the piece is protected, and it prevents black from pinning our Bf3.     ",
        "33. Qe3": "Sue: I moved Qe3 for white. Black to move. ",
        "33... f6": "Sue: Black has moved f6. Our turn.  Joe: My vote is Re1, at this point, to centralize the Rook.  Ron: I'm for blockading..  Bf4 or g4.  Sue: I think we should go along with one of Ron's suggestions what do you think. The the only reason to move the rook is to make it safer. Penguin(don't know his real name) says position looks like heading for a draw. We could manage this with accurate play.  Ron: a draw in our position is good as we are way down. A Rook. Blockcade is just forcing a drawish game \n\ng4 is beter for us  Sue: I will move G4 tomorrow.  Hope you agree Joe.  Joe: I agree with this.  I'm hoping to get a draw, as Ron mentioned.\n",
        "34. g4": "Sue: I have moved G4.  Black to move.",
        "34... Rah8": "Sue: Black played Rah8' I recommend we play Bg2 preventing black from taking h3. ...Rxh3, Bxh3..  Joe: I agree.  What happens in general is the same with this position being that two Rooks on one file is dangerous. So, Bg2 is my vote because that pawn is defended 3 times, if we play that.  Isaac: The position is almost impenetrable. The only way they can get behind the lines is with the queen, probably on h4  Sue: I am moving Bg2.  Black to move. \n\n",
        "35. Bg2 Rh6h7": "Sue: Black has move Ra h8. I suggest we move Rf1 Rf3' Qg1 Q f1 and finally Rxf6. Or shall we offer a draw now?  Joe: I like that plan but think he might be able to stop it. And, if we offer a draw, he'll more then likely, decline since we're behind. So, I think that the plan is the best thing that I see coming, so my vote is Rf1.  ",
        "36. Rf1": "Sue: Moved Rf1.  Black to move.  Joe: Let's see how black answers.  Ron: If I was Black I think I would say it's a draw but If I was to make a move which is the question. double up the rooks Rah8  this could happen... \n\n\n1. ... Rah8 \n2. Rh1 Rh4 \n3. Qf3 Qh6 \n4. Qg3 Rxh3 \n5. Bxh3 Qxh3 \n6. Rxh3 Rxh3 \n7. Qxh3 \nI also tried something else and Black checkmated. \nposition is still playable have to be cautious not to stalemate also. \n\n\nI change my mind and say lets play on until penguin asks for the draw  Joe: Which is why I'm convinced that he was not going to accept a draw, were we to offer it.\n",
        "36... Kf7": "Sue: What do you think of rf3.  Joe: I like Rf3.  I think that's our best option in the situation that we're currently at.  Ron: I favor Rf3 also.",
        "37. Rf3": "Sue: White has moved Rf3.  Black to move.",
        "37... Ke7": "Sue: Black has moved Qg6 . I suggest we make a waiting move with our bishop , if we move our Queen black will take the pawn\"  Ron: I say move up our King, not that,much is going to happen in this locked position  It is our turn to move we are playing white \n\nBlack is up a rook, we have a lsb, pawns are equal, we each have a Q \n\nmy suggestion was to move up our King d2 or e2 \n\nsince we have the lsb maybe d2 is best?  Sue: I am going to move Kd2 to see what black will play.  ",
        "38. Kd2": "Ron: What can Black play\nWhere can he attack? \n\nRxh3 loses \nRh4,Rg3 to protect \n\nThis should a draw. What do you think?  Sue: I agree with you.  Ron: yea just ask for the draw this game is so locked up its the correct thing to do.  Sue: I have offered black a draw offer.  ",
        "38... Rh7h4": "Sue: Black has moved Rh4. We can only move our King. Anything else would cause loss of material. I am surprise he didn't accept draw.  Joe: With what you said, I'm also a little surprised. But, I'm not as much because in a different game that I thought was a draw against my coach, he declined. The lesson there is that, \"you have to play out the draw, first\" as he said. Meaning, that you have to finish it out and be sure that it's a draw, I guess. What he's really getting at is don't go for a draw just because it appears so. Instead, play the rest out because he also mentioned that it can change if one side makes even a single mistake.  Sue: What do you think we should move?  Joe: I think that our best move is Ke2 with the idea of moving our K far enough to the right to allow an eventual Kg3 with the idea that it's not as mobile where it is. The idea behind moving to e2 is in hope of increasing its mobility.  Ron: I'm for Ke2 also.  Isaac: No Our king can only do any good at h2 defending the pawn. The pawn is already completely defended. A king move could be useful, but not as a journey toward the kingside. The game is dead draw and our king is best kept in the center on our side. Our only fear is a push by the f pawn when we might have to defend against the e or g pawn. \n\nA king move is fine but don't go to g3 or we lose all defense. h2 is ok but serves no purpose. Keep the king in the center.  Ron: agree with Pawn game is drawish we need to keep it that way and keep king in center, may be able to get a 3 move repeative draw, will have to do our best with our opponent not accepting the draw.  Sue: I am going to move Ke2.  Black to move.  Black has asked for a draw I have accepted.  "
    },
    "url": "https://gameknot.com/annotation.pl/consultation-game?gm=61990",
    "gameName": "Consultation Game",
    "players": "knightrider62 (947) vs. penguin_ (1602)",
    "opening": "Queen's pawn game (A45)"
}