{
    "moves": {
        "1. d4 Nf6 2. Bf4 d5 3. Nf3 e6 4. Nbd2 b6": "From now on, my priority is not to allow black to dilodge my d4 pawn so to open the diagonal for his lsb. ",
        "5. c3 Bb7 6. e3 Bd6 7. Ne5 Nc6": "? A bold mistake I didn't take advangage of: Bb5 and he loses a piece. Just simple like that.",
        "8. Ndf3 O-O 9. h3 Na5 10. b4 Nc4": "If BxN, he will open the diagonal and my g2 pawn will be unprotected against future threats. ",
        "11. Bd3": "? Bold mistake, due to...",
        "11... Nb2 12. Qc2 Nxd3+ 13. Qxd3 c5": "I don't mind c4, but I don't want to play nothing like dxc5, allowing him to open the diag, specially now that my lsb is gone.",
        "14. a3 a5": "Given the position, to close it is ok for me. I'd take advantage of the b column, but I am not well prepared for it yet.",
        "15. O-O Qe8 16. b5": "? Scared by the threat of a Q's incursion, I omitted that if now c4, i'll have to play Qb1 to defend, then he will be able to ge a4... and my pawns are weak forever. Bad scenario. ",
        "16... cxd4": "Here, Nxd4 was advisable so to give activity to my pieces, but on the other side, my N on d4 will be blocking his d5 pawn, so that if I moved it, he will be free to open the diag with d4. This is a flawed thought, since after Nxd4 I'm almost sure I could play Nf6, blinding his lsb. // ON the other side, cxd4 was also good, so to remove my weak pawn in c3. I choosed probably the worst option.",
        "17. exd4 Qe7": "This is good for me, since it allows me to play...",
        "18. a4": "...assuring my pawns over there. Now, he will try to exploit my weak c3 pawn...",
        "18... Rac8 19. Rab1": "The idea is Nc6, sacrifying a pawn but getting my \"revenge\" on his b6 pawn. Also, to be able to play Rb3. ",
        "19... Ne4 20. Rfc1 f6": "Of course, but I was prepared for this. ",
        "21. Nc6": "His Q is threatened, he has to take. ",
        "21... Bxc6 22. Bxd6": "In-between move, or I lose my dsb. ",
        "22... Qxd6 23. bxc6 Rxc6": "He defends b6, but it will remain still a weakness. ",
        "24. Rb3 Rfc8": "...I am losing the fight for c3. With low time, I went wrong again. ",
        "25. Nd2": "...allowing...",
        "25... Qf4": "! Very strong move. I was very low on time here, and with a lot of threats I had to play with cool blood. ",
        "26. Rc2": "Allowing, on purpose...",
        "26... Qxf2+ 27. Kh2 Qf4+ 28. Kg1": "...and he has (apparently) nothing. Of course, I am down two pawns. ",
        "28... Nxd2 29. Qxd2": "Maybe I was able to play Rxd2, keeping the queens and some possibility of complications, but I was very low on time, as I said.",
        "29... Qxd2": "Good. A pawn for another pawn.",
        "30. Rxd2 Rc6xc3 31. Rxb6 Rc8c4": "Here Rxe6 was due, but...",
        "32. Rb8+": "Another mistake, allowing his K to get into the game. ",
        "32... Kf7 33. Rb7+ Kg6 34. Re2": "The idea was to sac more pawns in order to get my Rs on the seventh.",
        "34... Rxd4 35. Rxe6 Rxa4 36. Ree7": "I'm lost, but... at ours low levels, you can always keep some chance. ",
        "36... Kf5 37. Rexg7 d4 38. Rb5+ Ke4 39. Rxh7": "...please, push the central pawn...",
        "39... d3": "Thank you.",
        "40. Rh4+ Ke3 41. Rxa4 d2": "I'll have to return the R, anyway.",
        "42. Rd5 Rc1+ 43. Kh2 d1=Q 44. Rxd1 Rxd1 45. Rxa5": "...but now, somehow, I am up a pawn!",
        "45... Rf1 46. h4 Rf4 47. g3": "He will need to retire the R from the f column very soon, ormy h pawn will go to the 8th...",
        "47... Rc4 48. Rf5": "...allowing me to play this. ",
        "48... Rc6 49. g4 Ke4": "Here, I should have played h5, so to shield my K, but... another mistake.",
        "50. Kh3 Rc3+ 51. Kh2 Rc2+ 52. Kh3 Rc3+ 53. Kg2": "I'm up, I can try to win. ",
        "53... Rc2+ 54. Rf2": "He lost a lot of time here. If he exchanges R's, he won't be able to stop my h pawn. ",
        "54... Rc3 55. h5": "Obsessed with the escape square for my K, I omitted Rxf6, winning. ",
        "55... Rc8 56. Rxf6": "anyway...",
        "56... Ke5 57. Rf2 Rh8 58. Kh3": "...and now it is very difficult to blunder the game, even for a patzer like me!"
    },
    "url": "https://gameknot.com/annotation.pl/cool-blood?gm=64237",
    "gameName": "Cool blood",
    "players": "damafi (1565) vs. keadd (1571)",
    "opening": "Queen's pawn game (A45)"
}