{
    "moves": {
        "1. d4 Nf6 2. c4 e6 3. Nf3 b6": "(al jugar las blancas su caballo de rey en lugar del de dama, como en la defensa Nimzoindia, las negras optan por el fianchetto -alfil en posición esquinada que influye indirectamente sobre el centro del alfil dama-, entrando así en la llamada defensa India de Dama, cuya idea básica es controlar el punto e4, con un desarrollo elástico de sus piezas)",
        "4. g3 Bb7 5. Bg2 Be7 6. Nc3 O-O 7. O-O d5 8. Ne5 c6 9. cxd5": "(al liquidar la tensión central, las blancas facilitan el juego a su oponente. Parece mejor el ataque inmediato al centro, con p.ej,. 9.e4)",
        "9... cxd5 10. Bf4 a6": "(jugada preventiva que prepara el avance b7-b5)",
        "11. Rc1 b5 12. Qb3 Nc6 13. Nxc6 Bxc6 14. h3 Qd7": "(interesante jugada que amenaza b4. Restringiendo el salto del caballo a  a4)",
        "15. Kh2": "(las blancas entran en un preocupante compás de espera eludiendo la tan vital iniciativa) ",
        "15... Nh5 16. Bd2 f5 17. Qd1 b4 18. Nb1 Bb5 19. Rg1 Bd6 20. e4 fxe4": " (excelente sacrificio posicional. Pieza por dos peones)",
        "21. Qxh5 Rxf2 22. Qg5 Raf8 23. Kh1 Rf8f5 24. Qe3 Bd3": "(Aaron Nimzowitsch se va instalando solidamente bajo un manto de camuflaje imperceptible. El bando negro pronuncia su “Vae Victis” particular)",
        "25. Rce1 h6": "(esta es una jugada de maestría indiscutible. Deja a las blancas sin opciones).\nEn este punto Säemisch se rindió. La amenaza negra en la siguiente jugada de T5f3 condena a la dama a cruzar la laguna Estigia. Aquí, se da claramente el fenómeno de la asfixia total o zugzwang; esto es, cuando la obligación de jugar conduce irreversiblemente al default, o lo que es lo mismo, cuando cualquier jugada conduce inevitablemente a la derrota."
    },
    "url": "https://gameknot.com/annotation.pl/copenhagen-1923-juego-19?gm=53673",
    "gameName": "Copenhagen, 1923 (Juego 19)",
    "players": "Friedrich Samisch (Alemania) vs. Aron Nimzowitsch (Dinamarca)",
    "opening": "Queen's Indian (E17), anti-Queen's Indian system"
}