{
    "moves": {
        "1. e4": "Playing White is my friend Baker, who came up with a brilliant mating combination that I probably wouldn't have seen.",
        "1... e5 2. Nf3 Nc6 3. d4": "This continuation (Scotch) usally leads to an open game. Other moves like Bb5 or Bc4 can lead to closed positions that are more positional.",
        "3... exd4 4. Bc4": "Here, White was hoping for Bb4  c3 dxc3 O-O cxb2 Bxb2 where White has some compensation for his material deficit. Baker usually does well playing gambit openings, but Black did not play into the gambit.",
        "4... Nf6 5. O-O": "White doesn't take the pawn immediately and instead wants to finish development. Black could play Nxe4, leading to Re1 d5 Bxd5 Qxd5 Nc3 where White regains the material with a slight lead in development. Most people play Bc5 here, which holds the pawn and White's compensation usually isn't worth a pawn.",
        "5... d6": "Black doesn't want to hold the pawn and get an advantage. This continuation leads to a form of the Scotch that is probably equal.",
        "6. Nxd4 Be7 7. Nc3 O-O 8. Nxc6": "I'm not sure if this was the best move, even though it disrupts Black's pawn structure (leaving him with 3 pawn islands against 2), but Black also gets a stronger center.",
        "8... bxc6 9. Qe2": "White doesn't want Black to take over with d5, so now Black can't because of d5 exd5 cxd5 Nxd5 Nxd5 Bxd5 Qxd5 Qxe7 and White has won a pawn",
        "9... Nd7": "Black has been playing the opening pretty defensively, so it's time for White to start an attack. bakerbaker has a lot of brilliant attacks in his annotated games",
        "10. f4 Nb6": "The c4-bishop isn't very important since it has low mobility, so White just ignores the threat.",
        "11. Be3 Nxc4": "Black uses 4 knight moves to capture a bishop that has only moved once, so now White has a big lead in development and superior control of the center.",
        "12. Qxc4 Bb7 13. Rad1": "White has completed development because he hasn't wasted any moves. Black's development is defensive and his bishop pair isn't doing him any good because the bishops have limited mobility. All of White's pieces are very mobile",
        "13... Qc8": "Black has a sneaky threat of Ba6",
        "14. Rf3": "White defends against the threat while also preparing an attack with the rook",
        "14... Re8": "All Black can do is try to get his jumbled pieces to active squares,",
        "15. Rh3 c5": "This frees up some space, but now Black has a weakness on d5.",
        "16. Qe2 Bf6": "Here, Black is beginning his own threats. Black is hitting the e-pawn with 2 attacker, and it is only defended by 1 piece, which is being attacked. Black can do serious damage with these threats, so this was where White began his do or die attack. Black is starting to regain activity, and White wants to capitalize on his advantage now.",
        "17. e5": "This is the best way to give up the pawn, because Black has no more threats after that, and White has more time to set up an attack",
        "17... dxe5 18. Qh5": "Despite being down a pawn, White has a nice attack and potential mating chances, plus he can probably win the pawn back since c5 is very weak",
        "18... h6 19. f5": "This great move doesn't let Black further open the center, which would make the black bishops very powerful. ",
        "19... Re7": "Black can only defend in this position, so here he wanted to get the queen to f8 so that h6 is extra defended against any sacrificial attacks.",
        "20. Rf1": "White could've regained his pawn with Bxc5, but Rf1 threatens to sac on h6 with Bxh6 gxh6 Qxh6 Bg7 Qh7  Kf8 f6 forking the rook and bishop.",
        "20... Qf8": "Without Re7, Black's queen couldn't have found this defensive square to defend against the sacrifice, but now Bxc5 wins the exchange.",
        "21. Qg4": "If Bxc5, then the position becomes unclear where Black's bishop pair advantage interferes with White's material advantage. Instead, White threatens the h-pawn to continue with the attack.",
        "21... Ree8": "Black is too concerned about losing the exchange, and maybe should've played Kh7 to stop White's attack. White will still probably be winning after taking the exchange, but White won faster with the kingside attack.",
        "22. Rxh6": "Threatening Rxf6, and if the bishop moves, then f6 could be dangerous because now the f1-rook has the f5 square",
        "22... Qd6": "Qe7 may be better, because now White gets a tempo for his attack",
        "23. Rd1 Qb6 24. Rd7": "Here White has an immediate threat of playing Qh5, which threatens Qxf7# and Rh8#, and if gxh6, then Qxf7  Kh8 Qh7# is still mate.",
        "24... Ref8": "Black defends against the immediate threat, but White's attack is still pressuring and Black will run out of defensive resources.",
        "25. Rh3": "White wants to play Qh5 for a mate on the h-file, but first he must get the rook off h6 since Qh5 would unpin the g-pawn.",
        "25... g6": "Defends against Qh5",
        "26. fxg6": "White has the mate in 1 threat gxf7#, and also if Black takes the pawn, then Qxg6 Bg7 Rxg7#",
        "26... Bg7": "Here it seems like Black has defended against everything. Black is down a pawn, and has a lot of weak pawns, so White is winning. Black is hitting the g-pawn, and h8 is well defended, so White has no mating opportunities on the h-file. It seems like White would have to go into a complicated position with only a small advantage, and win later on, but he found this brilliant way to finish the attack, and win the game quickly.",
        "27. Rh8+": "Sometimes is just requires some out of the box thinking to complete mating attacks. It doesn't matter how much material is sacrificed, as long as the attack leads to mate in the end. Black cannot take with the king, because of Qh5  and White will play Qh7#.",
        "27... Bxh8 28. gxf7+": "Double checks are very strong, because against any double checks, only the king can move.",
        "28... Kh7 29. Qg8+": "This stunning move forces the rook to take the queen, so now the pawn's promotion square is clear.",
        "29... Rfxg8 30. f8=N#": "Like I said before, double checks are very powerful. If White had promoted to a queen, then it wouldn't be double-check, so Black could simply block and White is lost since he sacrificed too much material. Black played too passively in the opening, so White got a quick attack, and finished it brilliantly. Remember to consider all options when you have a potential mating attack, even if there doesn't seem to be a forced mate. Also check out bakerbaker's other brilliant attacks by going to his profile. Baker is the master."
    },
    "url": "https://gameknot.com/annotation.pl/correspondence-tournament?gm=8227",
    "gameName": "Correspondence Tournament",
    "players": "bakerbaker (1987) vs. footyhead (1846)",
    "opening": "Scotch gambit (C44), Dubois-Reti defence"
}