{
    "moves": {
        "1. d4": "My 18th black in my last 20 OTB games....\nCounty Knockout stage Q/F  (unfortunately my Worcestershire team lost the match)\nPleased to finish my role as Captain with a win for the team...",
        "1... e6": "Giving him the option to transpose into a French.",
        "2. c4 f5": "I stick with a Dutch which I've done okay with this year.",
        "3. Nc3 Nf6 4. Bg5 Be7": "\n",
        "5. e3 c6": "Preparing d5 (more common is (0-0)",
        "6. Bd3 d5 7. f3": "Not seen this played here but it seems logical since black nearly always tries to place a Knight on e4 in this opening. This also prepares for e4.",
        "7... O-O 8. Qc2": "Giving extra support to e4 and perhaps eyeing up a later g4?",
        "8... Na6": "Not too sure if this was a good idea, had the idea of Nb4 and possibly Qa5 in response to a3.... but realised that after Rc1 my Queen and Knight would be badly placed.",
        "9. a3": "as expected, stopping Nb4",
        "9... Nc7": "So the Knight has to find another destination.",
        "10. Nge2": "He develops his final minor piece . . .",
        "10... Bd7": ". . . so I do the same.",
        "11. O-O": "Shredder has this about equal.",
        "11... Nce8": "Eyeing up the d6 square.",
        "12. e4": "White is now slightly better according to Shredder  (+0.69)\n",
        "12... fxe4": "I had a few options here but felt that opening the f file would be good in the long term and will also make the g4 square available for my Knight.\n\n",
        "13. fxe4": "He recaptures and score is now (White +0.97) probably due to my unusual Knight manoeuvres?\n",
        "13... dxc4": "I decide to take on c4 to deflect his Bishop from d3 and so that I gain a tempo when I recapture...",
        "14. Bxc4 Nd6 15. Bd3": "Bishop rejoins the b1 - h7 diagonal with the Queen and now white threatens e5.",
        "15... Ng4": "So moving my Knight to g4 as planned seemed like the best option.  (Shredder also likes this move)",
        "16. Rxf8+": "I expected him to play Bxe7 but he had other ideas . . .",
        "16... Qxf8": "I recapture with my Queen but still think my position is too passive.  \nI was thinking I will need to play . . . e5 at some stage giving up a Pawn but blocking the diagonal with his Q & B.  Hopefully then regaining the Pawn later?)",
        "17. Rf1": "What do we think of this move and the position now?!\n. . . after his Rf1 move attacking my Queen....\n\nI thought for several minutes about my next move to make sure it was sound.\n\nCan you guess black's move?",
        "17... Bxg5": "After some thought I decided to give up my Queen because I was confident there must be a forced win.... \nI could not see a defense for him after taking his Bishop, which forces . .",
        "18. Rxf8+": ". . . Him to take my Queen . . . Shredder now has me way ahead (-5.21)\n",
        "18... Rxf8": "I recapture with my Rook and suddenly my pieces have moved in for the finish!  \nNothing White can do here to avoid mate or heavy material loss. (Nf4 may delay things)?",
        "19. g3": "Giving his King an extra square.  (He said he had considered Nd1 but that loses quickly to Ne3+)\nWhen I gave up the Queen I felt I had the insurance of a position like this cropping up where I could restore the material balance with Rf1+ followed by Ne3+ but this would not be winning so instead I quickly played . .",
        "19... Be3+": "\n",
        "20. Kg2": "(Kh1 would be met by Rf1, forcing him to g2 anyway, since Ng1 leads to mate in 1, after Rxg1++)",
        "20... Rf2+": "Didn't have to think for long over this one...",
        "21. Kh3": "(Kg1 would allow me to clean up on his 2nd rank with discovered checks, and Kh1 leads to an even quicker mate)",
        "21... e5": "Protecting my Knight but also adding another threat just in case he tried (Ng1, as this would then be met with\n . . . Nf6+, Kh4 g5++)",
        "22. Qb3+": "He tries a check.",
        "22... Kh8": "but after my King move White resigns as there is no defence to Rxh2++\n\n0 -1\n\nThank for looking.\n"
    },
    "url": "https://gameknot.com/annotation.pl/county-devon-v-worcestershrire-banwell-village-hall?gm=64668",
    "gameName": "County - Devon v Worcestershrire, Banwell Village Hall",
    "players": "Trefor F Thynne (174) vs. John Wrench (160)",
    "opening": "Queen's pawn (A40), Keres defence"
}