{
    "moves": {
        "1. e4": "A team match and I begin with the Open Game.",
        "1... c5 2. Nf3 d6 3. Bc4": "3. Bc4 stumps me a little. I don't see it in my Sicilian book (which is admittedly quite old), nor do I see it referenced in a couple other books I have on general openings. I cannot even find it on wikipedia. I don't know what to call it. However, I do see it in the World DB and it has the highest winning percentage for white and also the highest rating of white players who choose this move. Despite that, it is played barely more than 1% of the time as white's 3rd move in this position. Further, I don't see the purpose. It makes no immediate threats and it doesn't really gain much ground in the center either. I may have just been better off with 3. d4.",
        "3... e6 4. O-O Nf6 5. Re1": "Still following the DB. Black threatened white's king pawn and white defends it with a rook.",
        "5... a6 6. c3 b5 7. Bb3 Be7 8. d4": "All pretty ordinary so far. With 6. ... b5 black left the world DB and now we're on our own.",
        "8... O-O 9. a4 Bb7 10. Bc2": "Again white's king pawn is attacked and defended.",
        "10... Qa5 11. dxc5 dxc5 12. e5 Rd8 13. Qe2": "Black seizes the open file and white's queen escapes to e2.",
        "13... Ne8 14. Bg5": "Laying a bit of a trap. The bishop on g5 seems poorly guarded.",
        "14... Bxf3 15. Qxf3": "Trap is in motion. Now the bishop is unguarded.",
        "15... Ra7 16. Bf4": "Unfortunately for white, black copped to the trap and saved his rook. Not like it was very subtle; chances are, black saw it from the start and simply wanted to exchange pieces.",
        "16... Qb6 17. Nd2 Nd7 18. axb5 axb5 19. Rxa7": "Exchanges all over the place, none of which seem to favor either player.",
        "19... Qxa7 20. Qd3": "Subtle as a chainsaw, but it wins a pawn.",
        "20... Nf8 21. Qxb5 Rb8 22. Qa4": "The only way to save the pawn on b2.",
        "22... Qxa4 23. Bxa4": "Now the black knight on e8 is threatened, so black cannot capture on b2.",
        "23... Ng6 24. Be3": "Not 24. Bg3? which loses a pawn to 24. ... Rxb2 25. Bxe8 Rxd2. I guess white must lose a pawn either way. When I played 20. Qd3, I had expected black to save his knight on e8 at this point. I didn't foresee him counterattacking with 24. ... Ng6!, the move that regains a pawn and saves black from a lost endgame.",
        "24... Nxe5 25. Bf4": "I had thought this move would be really quite clever, but it turns out, it doesn't gain much at all.",
        "25... Ra8 26. Bc2 Ng6 27. Be3 Rb8 28. Nc4": "Just dancing at this point.",
        "28... Nd6 29. Nxd6 Bxd6 30. b3 Ne7 31. Bd2": "Looks like nobody is going nowhere fast.",
        "31... Ra8 32. Rd1": "To spare the bishops from the upcoming skewer with 32. ... Ra2.",
        "32... f5 33. g3": "Analyzing the position, neither side has any exploitable advantage. White has a 2-1 pawn advantage on the queenside and the bishop pair, both of which are advantages, but neither of which is enough to win this position. Black has 4-3 pawns on the kingside, also not enough to win in this position. So I offered black a draw and he accepted. I feel there is a slim possibility that if this game had played out, white might have had an outside chance at promoting one of those two pawns, but in all likelihood, black would have sacced a piece to prevent it (if it even got that far, which it probably wouldn't) and white still wouldn't have enough to win. Very well played by black."
    },
    "url": "https://gameknot.com/annotation.pl/counterattack-overlooked?gm=25661",
    "gameName": "Counterattack Overlooked",
    "players": "blake84120 (2043) vs. irwannapitupulu (1985)",
    "opening": "Sicilian (B50)"
}