{
    "moves": {
        "1. e4": "[On a completely random note....]\n",
        "1... e5": "[just to pass through the moves that you know a lot about....]\n",
        "2. Nf3": "[check out my top rating, in case it's dropped down again - over 1400!]\n",
        "2... Nc6": "[yeehaw! :D]\n",
        "3. Bb5": "Ruy Lopez, Spanish Opening\n",
        "3... Nf6": "I ignore the bishop for now (the popular move here was 3...a6) and threatens the e4 pawn.\n",
        "4. Nc3": "natural. For both sides, the king's pawns are in the centre, and both sides have developed their knight. (White had also developed his bishop, but Black will catch up on that, since it's his turn) Apparently, this is supposed to lead to a quiet sort of game. (or maybe a certain move that arises out of the position, I can't remember... was it d3?....the Halloween Gambit certainly isn't boring, though!)Well, not this time!\n",
        "4... Bc5": "popular choice in the DB was Nd4, but there's nothing wrong with this move, as far as I can see\n",
        "5. Bxc6": "?! I expected 0-0. Usually, it isn't advisable to make these sort of exchanges before being forced to do so first (for example, if Black plays a6). This does leave the e-pawn hanging...\n",
        "5... dxc6": "but Black has a nice move now after Nxe5; Qd4!, winning the knight because White needs to defend against the mate threat on f2\n",
        "6. d3": "forgoing castling for the moment, and opening up a line for the bishop\n",
        "6... Bg4": "usual pin....\n",
        "7. h3": "White doesn't want the pin!\n",
        "7... Bh5 8. g4": "White REALLY doesn't want the pin, by the look of it! However, it also means that kingside castling won't be much of an option for White, with such a busted up position.\n",
        "8... Bg6": "Nxg4 went through my mind here, but White could easily castle queenside before I would be able to get an attack on the king\n",
        "9. Qe2": "seeing that the kingside isn't looking too good, White starts to open up a way for queenside castling. It also (though White doesn't go for it for awhile) that the e-pawn is ripe for the picking!\n",
        "9... Qd7": "Black does likewise, but maybe Qe7 was better, to do something about the e-pawn (though I usually do this so that the queen and rook are lined up after 0-0-0)\n",
        "10. Be3": "not only opening up queenside castling, this move also threatens the capture of the bishop on c5\n",
        "10... Bb4": "!? usually, in my games I tend to avoid trading off pieces this early in the game (unless I've managed to pull ahead with a big lead) - that's just my way of playing :) I was dubious about trading off as well, because after fxe3 White can support a pawn push to d4. In the game, simply defending the bishop never crossed my mind, but there really isn't any good way to do that (b6 - tripled pawns? no way! ** Qe7 - wouldn't have wanted to waste time moving my queen again)\n",
        "11. Bd2": "? White definitely has some sort of pin phobia, but this move loses a tempo. 0-0-0 is better\n",
        "11... O-O-O": "Black could have tried kingside castling (which will most likely reach a state of opposite-side castling) but queenside castling is more aggressive, to me\n",
        "12. Nxe5": "White finally spots the undefended pawn, and snatches it off the board\n",
        "12... Qd6": "of course, the queen had to move, since it was threatened with capture. Might as well chase off the knight while I'm at it!\n",
        "13. Nc4": "!? This move does force the queen to move again, but I think Nxg6 might have been worth looking at (though after hxg6 White's rook will be tied down to the h3 pawn)\n",
        "13... Qc5": "?! Though this does help in my attacking combination later on, it definitely wasn't the best move. Now White can win a pawn...\n",
        "14. O-O-O": "...with Be3, but instead he 'secures' his king. Maybe White plans Be3 next move?\n",
        "14... b5": "! Now that he has a target, Black strikes!\n",
        "15. Ne3": "Forced, if White wants to retain material (15.Na3? Bxa3 16.bxa3 Qxa3+ 17.Kb1)\n",
        "15... a5": "!? deliberately blocking Black's bishop, hoping to give White a reason to attack it. Now it seems that White can force an exchange... \n",
        "16. a3": "...with this move! (actually, the exchange would have been 'forced' anyway even if Black hadn't advanced the pawn, since a3, Ba5, b4 forks the Q and B) In this position, Black has only two options - Bxc3 [White expected this, I think] and...\n",
        "16... Bxa3": "! here we go! The starting move of a crazy position! [made possible as the queen and bishop are lined up for an attack, hence the title of this annotation. I just love this sac - it's worked for me in the past, check out my annotation, 'sacs, pawns and tempo'\n",
        "17. Na2": "Now it is Black's turn to be surprised! He was anticipating here (and had prepared for) 17.bxa3 Qxa3+ 18.Kb1 Rd4! [threatens mate after Rb4+] 19.Na2 Ra4! [threatens mate AGAIN after Qxa2+] 20.Be1 [the king needs an escape square] Qxa2+ 21.Kc1 and Black has a brilliant game! looking at this line, White was right to refuse the sac, but he would have better success with 17.Nb1! [yeah, an exclam for undeveloping your knight - go figure!] Play may have continued 17...Bb4 18.c3 a4, and Black's attack has been repelled (White's c-pawn is pinned to the king, so the bishop can't be pressured. 19.d4 [with the idea of driving the Queen away from the pin) also doesn't work for the same reason, because of the rook on the d-file\n",
        "17... Rd4": "Black decides to bring the rook in anyway - for White, the bishop is still too dangerous to attack\n",
        "18. Bxa5": "yeah, I had overlooked this move from White, but some quick looking at the analyse board led me to play...\n",
        "18... b4": "?! [or ?, but then again, the pawn move helps me later on] but maybe this was made too quickly, because White's next move (which was actually forced in order to retain material) looked like big trouble for Black. I think much better would have been 18...Ra4! then Black would have a great attack after 19...Bxb2! [20.Kxf2 Qa3+ 21.Kb1 Qxa2+ 22.Kc1 Rxa5] Another variation would be 18...Ra4 19.Bc3 b4 20.Be1 b3 21.Nc3 Bxb2+! 22.Kxb2 Qa3+ 23.Kb1 b2, and White can't stop 24...Qa1#. The best way for White to stay in the game then would be 19.Be1, where after going through the first variation, Black won't have Rxa5\n",
        "19. Nc4": "! Ok, back to the game... a good move by White, and now that Black's bishop cannot escape, it looks as if Black's attack has failed. However, Black isn't about to give up yet...\n",
        "19... Nxe4": "Regaining (for a very brief moment) material equality 20.dxe4 Rxc4 puts pressure on the c3 pawn, so it doesn't really look that promising for White...\n",
        "20. bxa3": "so why not just accept the won material? :)\n",
        "20... b3": "Black continues to be aggressive, attacking the a2 knight and allowing Qxa3+ once again [bxa3? ends Black's hopes of getting in an attack]\n",
        "21. Nb4": "Defends against both threats at once. 21.cxb3 is impossible because of 21...Rxc4+ 22.bxc4 Qxa3+ 23.Kb1 Nc5, and Black threatens Bxd3, winning material (Ka1, Nb3#) Though I'll have to admit, White would probably be winning after 24.Bc3, but Black would then bring in his last reserve after Kd7 ((actually, Kd7 threatens mate after Rb8+, so maybe that should be played regardless))\n",
        "21... Rxc4": "Black isn't finished with White yet! He decides against the simple Nc3 (which would leave Black down a material point after the dust has settled, but of course Black would still have chances to win the game) and throws another piece to the wolves to continue his attack; 22.dxc4 Qxa5 23.Kb2 (White has to defend against Qxa3+) c5 24.Nd3 [Nd5, c6 - woah, so doubled pawns DO have a purpose!] Qc3+ 25.Kb1 bxc2+ 26.Qxc2 Qxa3 and Black threatens the crushing Nc3+!, winning the queen, and this time there doesn't seem to be any way to prevent it. Therefore, White would have to, after 23...c5, play 24.Kxb3! cxb4 25.axb4 Qe5, and Black's attack is finally repelled\n",
        "22. Nxc6": "?? White surprises Black once again - though this time, it's a pleasant surprise. Black now has a forced mate (my guess is that White saw Black would win at least a piece - the bishop - after White captures the knight, so he wanted an extra pawn out of it)\n",
        "22... Rxc2+ 23. Kb1 Nc3+": "((here White resigned, but I'll play out the mate))\n",
        "24. Ka1 Qxa3#": "great finish, IMHO - Black's pieces have pinned White's king into a corner, and have surrounded him! :)\n"
    },
    "url": "https://gameknot.com/annotation.pl/cracking-under-the-pressure?gm=29926",
    "gameName": "Cracking under the pressure",
    "players": "dbabbitt (1327) vs. x-machine (1379)",
    "opening": "Ruy Lopez (C65), Berlin defence"
}