{
    "moves": {
        "1. e4 d5 2. exd5 Nf6 3. Bc4": "Not c4, as in the previous games... my usual ...e6 is now bad because of the isolated pawn that will land on e6 after the exchange.",
        "3... Bg4": "...but I have this. ",
        "4. f3 Bh5": "You see. In this scheme, black doesn't really fight for the d5 pawn. The idea is to keep it controlled while developing and attacking around it. Easier to say than to accomplish.",
        "5. Nc3 Nbd7": "d6 by white is not dangerous... still.",
        "6. Nge2 Ne5": "? Better was to b6. Here it is kicked by d4. ",
        "7. Bb3 a6": "Accepting to hold the white push, but avoiding the annoying Nb5 pressure. It was better to open the way for my Q. After c6, my developement seems easier, in spite of the pawn. ",
        "8. d4 Ned7 9. Nf4": "I have to accept the loss of my beloved lsb, but, hey, it's not the end of the word... still!",
        "9... Nb6": "Keeping the pressure on d5, even if after...",
        "10. Nxh5 Nxh5 11. O-O": "...I can't take it yet. And it's still bad to play the e pawn. ",
        "11... Qd6": "? The right idea was g6, fianchettoing the B before Re1, Qe2 and pressure on e7 comes. ",
        "12. f4": "Uncovering the attack on my N. Here I saw the light. ",
        "12... g6": "If g4, Nf6 and white is wide open, and I can take d5, finally. ",
        "13. Ne4": "! Of course, the good one. I have to be very careful, or I'll lose my Q! It's difficult to calculate on a blitz the \"trapped or not trapped\" Q question if, for example, Qb4 (Bd2? Qxd4+!)...",
        "13... Qd7": "Here it controls Qg4 by white. Better than nothing. ",
        "14. c4": "Wow! and I have to handle this pawn's storm...",
        "14... O-O-O": "Yes, let's do it. If e6, exd6, and if c5, Nxd5, so.. why are my legs shaking? White has plenty of moves here, the more obvious...",
        "15. Nc5": "A sacrifice on b7 should win the game for white. If Qe6, Nxb7 forces me to take it back (KxN), and then c5! Qf6 and white wins either with g4 (Ng7 cramps me forever) or cxNb6...",
        "15... Qf5": "Preparing myself for a fork with g4...",
        "16. Bc2": "...but this seems even worse. But it's not. I have a \"hole\" left.",
        "16... Qf6": "...and white lost the chance to fork my Q and N. Now, white wins easily with Ne4, Qh4 (or I'll lose it (Qf5, Nd6+ wins it). But...",
        "17. f5": "...overwhelmed with possibilities, white chooses this one. Now, after the column gets opened (gxf5 or g5!?, QxN as a minimum). So I felt really lost here. My only card in the sleeve was...",
        "17... Bg7": "Simple? Not at all. ",
        "18. fxg6": "White goes for his winning plan. My Nh5, incidentally, is undefended. ",
        "18... Qxd4+": "If QxQ, BxQ+, K moves, BxN. White still has his powerful and nice pawn in g6 (it can take either h7 or f7, and with R and B supporting it... it guarantees at least a black minor piece in return, with two black pawns and a sure win with g and h2. But white didn't seem to think it was enough, so he played...",
        "19. Kh1": "?? A terrible blunder that costed him the game. It took only seconds to check the line, and I couldn't believe that we reached a ture puzzle-like position! No kidding. (If you didn't do it yet, find the move...)",
        "19... Ng3+": "When you play things like that, you feel like... well :-)",
        "20. hxg3 hxg6+": "Not very subtle, but surprising and nice for me. I still overlook too much, but this one..."
    },
    "url": "https://gameknot.com/annotation.pl/crushing-my-crusher?gm=61055",
    "gameName": "Crushing my crusher.",
    "players": "Devukjs (1454) vs. damafi (1402)",
    "opening": "Scandinavian defence (B01)"
}