{
    "moves": {
        "1. d4 Nf6 2. Bf4 g6 3. h3": "My typical questionable move, that provides a square for the bishop to retire, supports an early g4, which denies f5 to the black's dsb... if e3, Nh4 and my dsb will be exchanged. It is not a catastrophe, but I don't like it. ",
        "3... Bg7 4. c3": "The typical c4 allows black counterplay on the diagonal. I want to solid block the queenside and attack on the kingside. I'm a little \"naive\" here, since black can calmly develop and wait. A queenside castling could be advisable later. ",
        "4... d5 5. g4": "No bf4. Plus, a pawn's storm project on the kingside. ",
        "5... Nc6": "Losing flexibility. c5 is a move black should have in mind all the time, specially if he wants to castle kingside disregarding the white clouds approaching.",
        "6. e3": "In order to advance g5, I have to make impossible for the knight to go to h4.",
        "6... O-O": "Black seems to be ok, but in fact he is not. Black's lsb has just d7, and the queen cannot move. ",
        "7. Be2": "Now, no Nh4. It can go to e, but I have to accept it. ",
        "7... Re8": "Preparing a break on e5, of course.",
        "8. g5": "This allows Bf5, but I want to attack. ",
        "8... Ne4": "Despite its prominency, this knight is not all that strong here, unless black manages to sac it. But he has no play on the dark squares...",
        "9. Nf3": "Helping e5. ",
        "9... Bd7": "Good, black has not a plan. As you can see, this move doesn't solve anything to black.",
        "10. h4": "Thinking on h5, of course. But it has the offside that allows...",
        "10... Bg4": "Nb-d2 was ok, but I wanted to manage the situation in another way. ",
        "11. Nh2 Bxe2 12. Qxe2 e5": "...but in the meanwhile, I forgot about the e5 push blacks were preparing. And now, this is really dangerous, since I have a rook in front my queen and king. ",
        "13. Bg3 Nxg3 14. fxg3 exd4 15. cxd4 Nxd4 16. Qd2": "Stay calm. Nh2 covers the nasty fork.",
        "16... Nc6": "No need to take back the knight, since I still have to move my king. But where? I saw that after Nc3, d5 was very dangerous. So I opted for quickness...",
        "17. O-O Qd6": "Aiming to g3.",
        "18. Qf2": "Counterattacking on f7. This is hardly a threat, since I need more strenght to break in, but still gives black something to think about. ",
        "18... Ne5 19. Nc3 Re7 20. Rad1": "Building pressure for both sides. ",
        "20... c6 21. Ne4": "An excellent way to mobilize my knight. I am under 1, here. ",
        "21... Qe6": "Nc5 seemed ok, but after the queen moves again threatening the knight... I don't see anything really interesting for white's attack. ",
        "22. Nf6+ Bxf6 23. gxf6": "I keep more chances with the queen on the board. I am threatening Qg7# soon.",
        "23... Ree8 24. Qf4": "Simple. Can black stop me? Well, the answer is partly positive. ",
        "24... Qd6": "e4 comes into consideration, but probably better is h5!. I didn't see this move was intelligent, since prevented my next one...",
        "25. Qh6 Qf8": "...with this. Ok, I don't want to exchange queens. My attack will vanish. ",
        "26. Qg5": "Now the plan is h5.",
        "26... h6": "Interestingly, black's move has many points. I have no small pieces to sac into the pawns, now (but my knight knows its fate), so they are solid. ",
        "27. Qf4 Nc4": "Threatening e3. Now, I can defend, but more interesting was...",
        "28. Ng4 h5 29. Nh6+ Kh7 30. Nf5": "Opening the king's position should win... ",
        "30... gxf5 31. Qxf5+ Kh8": "If Kh6, Qg5+, Kh7, Qxh5+, Kg8! (if Qh6, Qxf7... to be considered.)",
        "32. Qxh5+ Kg8 33. Rf4": "Mate in one again. ",
        "33... Nxe3": "No problem, sir...",
        "34. Rdd4": "Another rook is ready. ",
        "34... Re4": "So no mate... ",
        "35. Rdxe4 dxe4 36. Rxe4": "but now black has to cover g4 and to defend the knight...",
        "36... Re8 37. Qg5+": "The knight is mine, but...",
        "37... Kh8 38. Rxe8": "...this is a more sadistic way to end the game...",
        "38... Qxe8 39. Qg7#": ""
    },
    "url": "https://gameknot.com/annotation.pl/crushin?gm=44894",
    "gameName": "Crushin'",
    "players": "damalfi  vs. pgeorges ",
    "opening": "Queen's pawn game (A45)"
}