{
    "moves": {
        "1. d4": "Queen opening",
        "1... d5 2. c4 e6": "QBD",
        "3. a3 Nf6": "Developing king side ",
        "4. h3": "I don't recommend this pawn push. Waste of a turn, also creating weakness. Just my perspective. This pawn is my target now. Game is interesting one. ",
        "4... Be7": "Ready for castling",
        "5. cxd5 exd5 6. e3 O-O": "Castled",
        "7. Nf3 Nc6": "Developing my pieces",
        "8. Bd3": "He is ready for castling...",
        "8... Be6 9. O-O Qd7": "My rooks are connected. Opening is over. Now the real battle.",
        "10. Bc2": "He pulled his Bishop back. Wasted a turn. He should have focused on developing.",
        "10... Bd6": "Positioning my Bishop to his king.",
        "11. Nc3": "Now he developed his knight. ",
        "11... Bxh3": "My battle started. A good sacrifice.",
        "12. gxh3 Qxh3": "My calculation is like this...I lost 3 points and he lost 2 points. But his king is vulnerable now. Though no checkmate exist at this position ",
        "13. Re1": "He pushed his rook giving room for king to escape",
        "13... g5": "I pushed my king side pawn forward. Another sacrifice.",
        "14. Nxg5 Bh2+": "I called a check. Making sure if I move my queen. His king won't escape. ",
        "15. Kh1": "King to corner the only square. Ancored his king in a corner.",
        "15... Qh4": "Moved to safety but made mistake. I saw this it is mistake move. I calculated another moves and again I considered the same move I didn't find danger second time. A mistake usually I make ",
        "16. Nf3": "Now I can't save my Bishop. Did I lose hope? No way. His king is still vulnerable ",
        "16... Qh6": "I moved the queen to safety may not be the best move ",
        "17. Nxh2 Kh8": "Preparing my rook to arena ",
        "18. e4": "An attack on my queen. ",
        "18... Qh3": "My queen is safe now",
        "19. e5 Rfg8": "A checkmate threat.",
        "20. Qf3": "He understood that and played a brilliant move. Did I lose the hope? Think how can I continue attack on this position. I was thinking and got a move ",
        "20... Ng4": "Another threat. Game became hot now. ",
        "21. Bf4": "He defended the checkmate. But computer says it as mistake. But now I started thinking. No other checkmate pattern found.",
        "21... Nxd4": "I brought my next knight. His Bishop knight king are locked. Knight was attacking his queen. After the game I analysed in conputer. No checkmate at this position. But I can have material advantage from here on.if opponent king is vulnerable then it is possible to have material advantage.",
        "22. Qxh3": "A blunder. IT is a correspondence game. He might have forgotten the deadlock. ",
        "22... Nxf2#": "Game over. \n\nI would encourage you to sacrifice pieces though you don't find immediate advantage or a checkmate. Don't play just calculating points but weaken the opponent position.\n"
    },
    "url": "https://gameknot.com/annotation.pl/crushing-the-castle?gm=60865",
    "gameName": "crushing the castle ",
    "players": "cope (1507) vs. rock-onn (1501)",
    "opening": "Queen's gambit declined (D30)"
}