{
    "moves": {
        "1. e4": "This is an unrated game with Brigade Commander. Although I had the advantage at various points, the game was extremely sharp and I lost my way in the complications.",
        "1... e5 2. f4 exf4 3. Bc4 Nc6": "This is one of the strongest replies. Black retains the option of Qh4+ while developing.",
        "4. d4": "An alternative is Nf3 Nf6 Nd3 Bg5 and Black stands well. This line produces more complications.",
        "4... Qh4+ 5. Kf1 Nf6 6. Nf3": "White needs to drive the Q back with tempo.",
        "6... Qh6": "This is a good spot for the Q. ",
        "7. Nc3 Be7": "Here ...Bb5 is probably slightly more active. But Black has a good game.",
        "8. e5": "Necessary to try and get some sort of attack going.",
        "8... Nh5 9. Nd5": "! This is the only active move otherwise Black simply consolidates.",
        "9... Bd8 10. Rg1": "Again, white must play actively.",
        "10... g5 11. g4": "This is necessary to maintain the initiative. ",
        "11... fxg3 e.p. 12. hxg3 d6": "!? Black wants to break up the pawns. However the GK computer suggests Rg8 13. Ke1 Na5 14. Bd3 d6 15. g4 Be6 16. Nxc7+ Bxc7 17. gxh5 dxe5 18. Rxg5 Rxg5 19. Bxg5. ",
        "13. g4": "I thought this was stronger than Nxg5. I analyzed it and thought that I was trading 2 pcs for Rook and pawn. However, the GK computer considers that the best move: 13. Nxg5 Bxg5 14. Nxc7+ Ke7 15. Nxa8 Bxc1 16. Qxc1 Qxc1+ 17. Rxc1 Bh3+ 18. Kf2 Rxa8 19. exd6+ Kxd6 20. Rh1 Bg4 21. Bxf7. ",
        "13... Nf4 14. Nxf4": "I did not want to exchange the advanced N but at least I double the Black pawns.",
        "14... gxf4 15. exd6": "?! White must open lines. However g5! as suggested by BC seems better. After say Qh6+ Kf2 White has good prospects.",
        "15... Qxd6 16. Qd2": "At this point I thought I had a good game. ",
        "16... h5": "The GK computer does not favor this move, but I am forced to take. It prefers … Bf6 17. d5 Ne5 18. Qe2 Qe7 19. Bxf4 Bxg4 20. Bb5+ c6 21. dxc6 Bh3+ 22. Kf2 Nxc6 23. Bxc6+ bxc6 24. Be5 Be6 25. Bxf6 Qxf6, with only a tiny advantage for White.",
        "17. gxh5 Bf6 18. c3": "I thought this was best, because I feared Qxf4 Qxf4 Bxf4 Nxd5. The GK computer prefers that line but seems to overlook that the Q exchange is good for Black.",
        "18... Be6": "At this point I think I have a good game. GK computer considers Bh3 stronger, … Bh3+ 19. Kf2 O-O-O 20. Qxf4 Rxh5 21. Qxd6 Rxd6 22. Ng5 Bxg5 23. Bxg5 Be6 24. Bxe6+ Rxe6 25. Bf4 Kd7 with an even game.",
        "19. Bxe6 Qxe6 20. Qxf4": "Here White is better. ",
        "20... O-O-O 21. Ng5": "? This is where I go astray, missing the possibility of a sac on d5. As BC pointed out, after 21. h6! (GK gives Be7 22. Kf2 Bd6 23. Qg4 f5 24. Qg6 Qd7 25. Qg7 f4 26. Qxd7+ Rxd7 27. Rg6 Re7) White is much better.",
        "21... Qc4+ 22. Kf2": "This seems best.",
        "22... Bxd4+": "Crunch! Nxd5 would work as well, White's king is now exposed and Black gains and advantage.",
        "23. cxd4 Nxd4 24. Qg4+": "?? This is the losing blunder, I simply missed that f5 is possible. After the more patient 24. Re1 Qc2+ 25. Qd2 Rxh5 26. Qxc2 Nxc2 27. Bf4 Rg8 28. Ne4 Nxa1 29. Rxa1 Rf5 30. Kf3 Rd5 (GK Computer) White can hold on.",
        "24... f5": "At this point I realized it was time to resign, but I decided to play on for a couple moves.",
        "25. Qf4 Qe2+ 26. Kg3 Rxh5 27. Rg2 Qe1+ 28. Rf2": "? Allows mate or even Ne7+ forking K and Q. The mate is 28. Rf2 Qg1+ 29. Rg2 Ne2+ 30. Kf3 Qf1+ 31. Ke3 Nxf4 32. Rf2 Ng2+ 33. Kf3 Rd3+ 34. Be3 Rxe3#",
        "28... Qg1+": "White resigns."
    },
    "url": "https://gameknot.com/annotation.pl/crushed-by-the-light-brigade?gm=47189",
    "gameName": "Crushed by the Light Brigade",
    "players": "dmaestro (1572) vs. brigadecommander (2226)",
    "opening": "KGA (C33), bishop's gambit, Maurian defence"
}