{
    "moves": {
        "1. d4 d5 2. Bf4 c6 3. c3": "Don't forget this move (or c4), or b2 and the black squares will suffer. ",
        "3... e6": "Closing in his lsb without need. Openiing the way for his dark squared pieces, too. I'd played Bf5. ",
        "4. Nf3 f5": "Black goes for a \"reversed stonewall\". I'm just inventing the term. The issue here is that the f7 pawn was moved, and the white diagonal going from h5 to e8 can be attacked. ",
        "5. e3 Nf6": "This move prevents my Q's entry into g4 or h5. Black needs it.",
        "6. Ne5": "Opening the way for my Q all the same, and provoking.",
        "6... Bd6": "...and this doesn't bother me at all.",
        "7. Be2": "Now, Nf6 can't go on g4 or h5, and I am \"threatening\" Bh5+, and if g6, Nxg6, hxN, Bxg6+. Not a winner right now, but black must be aware of it. ",
        "7... O-O": "This is an awful movement, and it is a clear demonstration of the fact that castling has to be done ONLY when appropriate... and not certainly into the enemy's fire!",
        "8. g4": "Shot one. Nxg4 will lose a pawn and will bring my pieces out. Black has to play very carefully, here, since the g column is a strong attack point for me. He should have played Ne7, so to provoke Nc6, bxN, BxB, Rf7 and try to survive this position, or BxN, dxB, Ne4. ",
        "8... g6": "? A typical novice error, like castling. The issue black should have taken care of was the g column opening. There was no need to defend f5, since gxf5, exf5 was not bad for black (except for the open g column). This move accomplishes nothing. Bd7 (heading for Be8) was \"something\", and if white goes NxB, be welcomed! Now: how to take care of this mistake? Which is the best move to finish black?",
        "9. Bh6": "No, it was not exactly this. But this move is not bad either...",
        "9... Re8": "Rf7 lost the exchange... but made black's live easier. Or BxN, dxB, Nxg4, BxR, QxB, and if BxNg4, fxB and white can't retake because f is protected by the Qf8. I'm not using the analyze board, so all this can be flawed. I'll review it later. Anyway: you don't see the move still?",
        "10. Nxg6": "Of course. But on real timed games, you always think you can be wrong, just lose a piece and... nothing more. Maybe this was premature. Maybe it was wiser 10. g5, closing in the dsb, but forcing Ng4 (and the subsequent BxN, Qxg4...), or 10... Nf6-d7 (but then black would have been completely underdeveloped) or 10... Ne4, f3, winning the N for a pawn (Qh4+ is not possible due to the g5 pawn). Then, a4, a5 will break black. So: was this sac necessary? Was it sound?",
        "10... hxg6 11. gxf5": "Giving away the idea of g5 forever. Still not sure it was the right choice. But the closing-in of the dsb can't be played lightly.",
        "11... exf5 12. Rg1": "A \"must\".",
        "12... Kh7": "Yes, I knew. No problem.",
        "13. Bg5": "Bf4?? BxB for free. Now, his N is pinned, and this will be the losing piece for him. But he was a novice, he didn't play the best. I'm also inviting Bxh2, which will mean he will end losing it for two pawns (Bxh2, Rh1, Qc7, Bf4, Ng4, BxN... but white can't just play f4 because of Rxe3, be aware...)",
        "13... Re6": "Not the proper position for the proper piece. The R belongs to g8 or h8, the Q to f7, and the other N to d7. So this was the square for Bc8. Learn how to get your pieces coordinated, in its best squares. It's not always easy to see where they are, but this is an \"ugly-looking\" move, and for good reasons! Who knows which was the idea behind it!",
        "14. Bh5": "When attacking, be quick. I'm no Capablanca, I'm not able to \"slowly build\"... nor this is the right position to do that. I'll go this way. NxB is impossible, and if gxh, I'm sure the action on the g column will give me enough compenbsation. It was \"hope chess\"... :-)",
        "14... Qg8": "I still think black could have taken the B, but this move has its point, since my Rg1 is not defended, and I can't castle. I looked to Kd2 (but Ne4+), or Ke2 (self-blocking my Q... doubtful!). I don't want to take back my lsb, if possible. I can pin the g pawn by moving my dsb, but if Bh4 I just give black a tempo, threatening Bxg6, but he can just play Ne4, defending it with the R (was it not all that bad? :-)",
        "15. Bxf6": "So, very sadly, I went for this move. ",
        "15... Rxf6 16. Qf3": "This was the idea behind not conceding a single tempo to black (taking the N). Now my threat is Qh3. A weak plan, since black here has e.g. g5. So the soundness of both my sacs is heavily questioned! I didn't want to play the f pawn, for sure, and the simple Nd2 (developement without a plan) is just a losing option. ",
        "16... Nd7": "Black has to develop, true, but he has to unpin g6 all the same! Qf8 will do. Qh6 can shield black's K if Qh3. ",
        "17. Qh3 Nf8": "?? Worser than worse. But why? What is white threatening? What's the only defence against... a double check? Not this: this will only cover g6, but against... ",
        "18. Bxg6+": "You see: if Bf3+, Kg7 and that's all! I like this position; is not usual. ",
        "18... Kg7": "Be aware: white can still throw the game. Which is next's best move? Be8?",
        "19. Bh7+": "If Be8, Ng6 and white's attack is stopped. I'm not heading for mate, but for \"overwhelming material advantage\". But it will come sure. Please note: I didn't defend Rg1, and now it can't be taken. Now my opponent resigned. Kf7, BxQg8+, Ke7... "
    },
    "url": "https://gameknot.com/annotation.pl/crushing-and-crashing?gm=60604",
    "gameName": "Crushing and crashing... ",
    "players": "damafi (1408) vs. morrisette's (1275)",
    "opening": "Queen's pawn, Mason variation (D00)"
}