{
    "moves": {
        "1. e4": "Hi everyone!\n\nIn this game I have been guilty of pawn grabbing and GM Cyrano ensured that my second game against him ended in a rout - in his favour!  I thought it was OK to grab a pawn because the queens were traded off prior to that so I did not have to worry about Henry copping Old Matey.  Still, the rooks were on the board and Cyrano's pieces were better developed than my own and he took full advantage of this fact.  Here is how the drama unfolded.  http://gameknot.com/analyze-board.pl?bd=17572831&rnd=0.30321710962631215",
        "1... d6 2. d4 g6": "2. ..... g6 - this opening has become the Pirc/Robatsch Defense after both the d and g pawns have been advanced one square in response to my e4 and d5.  Afro is gonna allow me to develop a strong pawn centre and then undermine it.",
        "3. Nc3 Bg7": "3. .... Bg7 - a natural follow up to g6.",
        "4. Be3 Nf6 5. Qd2 c6 6. f3": "6. f3 - an OK move here but maybe I should have forced off that black fianchettoed bishop for Fou Lenoir and made him weak on the a1-h8 diagonal.",
        "6... b5 7. g4 h5 8. g5 Nfd7": "8. ..... Nfd7 - his knight blocks in his bishop but this is only temporary.",
        "9. f4 Nb6 10. Nf3 O-O 11. Nh4": "11. Nh4 - this move puts pressure on g6 but it does leave my knight rather dim on the rim.",
        "11... b4 12. Nd1": "12. Nd1 - this knight stays on this square for the rest of the game.",
        "12... c5 13. dxc5 dxc5 14. Qxd8 Rxd8 15. Bxc5": "15. Bxc5?! - Gameknot Analysis marks this move as an innaccuracy and suggested f5 as an improvement.",
        "15... Bb7": "15. .... Bb7 - Afro exploits the undefended e4 pawn.  I defend it with Bg2 - maybe Bd3 was better because if black tried to exploit the pin with f5 then I could bolster my e pawn with Nf2 next move allowing Henry to castle queenside.",
        "16. Bg2 Rc8 17. Bxb6 axb6 18. Kd2": "18. Kd2 - I did not want to displace Henry but alas, he was the only piece that could defend my pawn on c2 and at the same time preventing a rook incursion on that square.",
        "18... Rc4 19. Re1": "19. Re1 - bolstering my e4 pawn.",
        "19... Nc6 20. c3 bxc3+ 21. bxc3 Nb4": "21. Nb4 - this move, taking advantage of the pin on my c3 pawn doubly attacks my a2 pawn.",
        "22. a3 Rd8+": "22. ...... Rd8+!! - this rook move is a killer.  Whichever square Henry chooses to go to it will allow a knight fork, either on c3 or d3.  I realised that one move later and waved the white flag.  It was just so amazing how quickly a seemingly OK position can fall apart in the space of a couple of moves!  I thought I had a telling advantage being a pawn up but Afro made me have another think coming - although my rating is now just 5 points south of 1900 thanks to another Expert timing out on me I still have an awful lot to learn!",
        "23. Ke3": ""
    },
    "url": "https://gameknot.com/annotation.pl/cyrano-punisce-pedina-scippi?gm=45225",
    "gameName": "Cyrano punisce pedina scippi",
    "players": "jstevens1 (1882) vs. cyrano (2627)",
    "opening": "Pirc defence (B07)"
}