{
    "moves": {
        "1. d4 Nf6 2. c4 c5": "A crazy-looking move to a beginner's eyes (well, it was to mine when I first saw it!), but the Benoni lines this move foreshadows are some of the most aggressive lines at Black's disposal.",
        "3. d5": "White's most dynamic response.  Moves like 3.Nf3 or 3.e3 are considered tame - if not downright pusillanimous.",
        "3... e5": "This is the move that usually heralds the Czech Benoni, although from here the game could still transpose into King's Indian Defence lines... White doesn't usually advance the d-pawn here, attractive though the idea looks, as on d6 the pawn becomes isolated and lost.",
        "4. Nc3 d6": "Preventing further advance of White's d-pawn...",
        "5. e4 Be7": "It is this move that really identifies Black's opening as a Czech Benoni (named for the Czech masters who explored it - Hort, Jansa and Kavalek).  Black has in mind to exchange this bishop for White's c1-bishop at g5, given the chance.  The downside is that the thematic break, ...f5, will require considerable preparation to bring about.  This preparation is likely to involve playing ...g6 so as to recapture on f5 with a pawn.  Though Black's manoeuvres are often slow and tortuous, it transpires that it's not so easy for White to take advantage of this.  This game turns out to be in its early stages a good demonstration of the respective strategies, but, later, also of what can happen if Black mistimes his thematic break.",
        "6. Bd3": "White has a big choice here, and the move played is neither the most common, nor necessarily the best.  Also playable were Nf2; Nge2; f3 or f4; or g3 or h3.  Bill Hartston remarked that White's possible plans are numerous, and not easy to categorise. The bishop move is aimed specifically against Black's intended ...f5 break. ",
        "6... O-O": "Also playable was 6...Nbd7",
        "7. h3": "It is more usual here to develop the g1-knight to f3 or e2.  My plan in this game was to play as aggressively as I could on the K-side, just to test how good - or otherwise - Black's defensive prospects really were.  This pawn advance is much less concerned with stopping ...Bg4 than to support the advance g2-g4, aiming at inhibiting the ...f5 break in the short term, and maybe foreshadowing a pawn storm further ahead, or at least the opening of lines for White's rooks.",
        "7... Ne8": "One of the moves recommended by Hartston against White's set up (the other recommendation being the equally thematic 7...Nbd7).  The idea is not only to free the f-pawn, but also, after ...g6, to bring this knight to g7 whence it will also support the f-pawn's advance to f5.",
        "8. Nf3": "g2-g4 can wait...",
        "8... Nd7 9. g4 g6": "An important decision, though its implications have already been discussed.  True, it constitutes a weakening of Black's K-side - the dark squares around the King - but it also presents a target at g6 if ever White gets a pawn roller going.  What are the prospects of that though?  Such a pawn storm proves difficult to arrange, as you will see.",
        "10. Bh6": "Developing with an apparent gain in tempo.  But Black's response is to place a knight precisely where Black wants him.  The pin is no real inconvenience to Black...",
        "10... Ng7 11. Qd2": "(!?) Bolstering the bishop, and with the idea that the Q might eventually gain access to h6.  The Q-move also enables the long castling, or at least bringing the a1-rook into play...",
        "11... Nf6": "(!?) Solid defence.  Possibly this was one occasion that Black might have contemplated some sort of Q-side action - 11...Qa5, say.  But the move played is thematic, and has the potential (as the sequel will show) to force a decision upon the future of the h6-bishop.",
        "12. Ke2": "(!?) The alternative was 12.0-0-0, which might actually be the better choice, as it happens.  But I didn't want a \"castling on opposite sides\" game and in fact felt that the K was probably safer in the middle squares.  ",
        "12... Kh8": "Preparing to drive out the intrusive bishop by 13...Ng8, perhaps?",
        "13. Rag1": "Overt aggression - a.k.a. telegraphing ones punches.  So far White is just heaping up his forces ready to attack, but has no clear plan of attack just yet...",
        "13... Nfe8": "(!?) An unexpected decision.  Did Black apprehend that White might take on g7?  After [A] 13...Ng8 14.Bxg7+!? Kxg7 White might have launched into an all out assault: 15.h4 Nf6 16.h5 Bxg4 17.hxg6 Bxf3+! 18.Kxf3 fxg6 19.Qh6+ Kf7! and it's not easy to discover how White can reinforce his attack.  The WK probably will have to get off the f-file soon (like, now) but after 20.Ke2 Qb6!, White has to think about defence.  What if the h6-bishop retreats, then?  [B] 13...Ng8 14.Be3 f5! - the sought-after pawn break! - 15.gxf5 gxf5 16.exf5 Nxf5 17.Bg5 Nd4+ 18.Nxd4 cxd4 19.Ne4 Bf5 20.h4 ... White doesn't seem to have made a whole lot of progress.  Either way, Black seems to emerge with a roughly even game ... at least.  OK, then, how about White's third alternative, to allow the bishop to be taken?  Let's try a waiting move [C]: 13...Ng8 14.b3!? (there might be a better waiting move, but this will do for our purposes): 14...Nxh6!? 15.Qxh6 Bd7 (developing) 16.h4 f6! 17.Ng5!? fxg5 18.hxg5 Bxg4+! (18...Nh5?! 19.gxh5 does look strong for White) 19.Rxg4 Nh5 20.Rxh5 gxh5 21.Qxh5 Rg8 and although a terrific battle continues to rage on the K-side, Black seems to be holding his own.  This, clearly, must be the crucial point of the game.",
        "14. Qc2": "Anticipating ...f5...  ",
        "14... f5": "(?!/?) ...which duly comes.  During the game I was a little surprised, in view of my previous move, but still thought the move was pretty much OK.  Now I think otherwise.  I identified a couple of later moves that did seem to harm Black's position, but the moves I recommended turned out to be no better, which suggested (in retrospect) that in fact this pawn break had come at the wrong time.  As there was no opportunity to play this earlier, then it had to wait.  For what?  I'm not sure I have a good answer to that question!",
        "15. gxf5": "White certainly does not want to allow Black's f-pawn to advance further!  Black would then have a fine game.",
        "15... gxf5 16. exf5 Rf7": "(!?) For the moment, Black dare not take the f-pawn, owing to 16...Bxf5 17.Bxf5 Rxf5 (17...Nxf5? 18.Bxf8) 18.Bxg7+ Nxg7 19.Rxg7 Kxg7 (20...Rxf3?? 21.Qxh7#) 20.Qxf5 and White emerges from the massacre with an extra piece.  The purpose of this rook move was to unpin the g7-knight, allowing the recapture at f5.  During the game, I thought 16...Rf6 more accurate, as it obviated White's next move.  But 16...Rf6 17.Bg5 with 18.f6 to come would have been similar to a line discussed after Black's next move.",
        "17. f6": "(!) Opens up the b1-h7 diagonal for the Q and B already aligned thereon. White wins a pawn, but also has a strong attack.  ",
        "17... Bxf6": "(!?) After this Black comes in for a lot of pressure.  I thought 17...Rxf6 might have been the better option, but as earlier remarked, now I'm not so sure.  After 17...Rxf6 18.Bg5 Rf7 19.Bxh7 Bxg5 20.Nxg5 Rf8 (20...Rf4 gets exactly the same response) 21.Qg6! doesn't look too flash for Black at all.",
        "18. Bxh7": "When a pair of bishops is buried deep in the enemy position, you know there is some serious missionary work going on!",
        "18... Qd7": "What else is there? Black hopes to bolster his second rank defence line.",
        "19. Bg6 Rf8": "The alternative, 19...Re7, would have got the same response...",
        "20. Ne4": "White has an undoubted advantage now, with plenty of open lines into the Black position, and the White knights starting to pile in, as well.",
        "20... Qe7": "It can't be helped: Black must lose material.",
        "21. Bxe8": "Eliminating one of the defenders of g7...",
        "21... Rxe8": "(?) Relatively speaking, a disastrous move.  But as  Black was already in serious trouble, it really just accelerates his downhill progress.  21...Nxe8 lost at least the exchange (22.Bxf8), and 21....Qxe8 22.Nxf6 was even worse.  No wonder the rook capture would have seemed the least of all evils...",
        "22. Nxf6": "A smashing blow, attacking e8 (Nxe8), g7 (Bxg7+) and h7 (Qh7#) simultaneously, and the BQ dare not take the knight owing to Bxg7+ winning the queen.  ",
        "22... Nf5": "Slender though it is, Black's best hope... Places an extra defender protecting g7, and the h7-square is also protected.  Too bad about the rook...",
        "23. Bg7+": "(!) Played anyway! Much more decisive than 23.Nxe8(?).",
        "23... Nxg7": "Shortening the game.  Black had to capture, but the alternative was not much less lethal: 23...Qxg7 24.Rxg7 (threatens, incidentally, 25.Rh7#) 24...Kxg7 (24...Nxg7 25.Qh7#) 25.Nxe8+ Kf8 26.Nc7 Rb8 27.Ne6+ etc.",
        "24. Qh7#": "Checkmate.  Black was doing fine up until the mistimed pawn break (14...f5?) after which his game went downhill fairly quickly.  Yet the pawn break was exactly what Black aims to play in this opening.  The line suggested after 13...Ng8 14.Be3 f5! looked OK for Black.  Maybe that's the key:  13...Ng8 is to be preferred to 13...Ne8.  It was certainly not obvious during the game that this might be so, but after the latter move, it seems that it might be difficult for Black to arrive at ...f5 safely."
    },
    "url": "https://gameknot.com/annotation.pl/czech-benoni-challenge?gm=23459",
    "gameName": "Czech Benoni Challenge",
    "players": "ionadowman (2042) vs. doctor_knight (1433)",
    "opening": "Czech Benoni (A56), King's Indian system"
}