{
    "moves": {
        "1. e4": "The draw for the first round was done on the usual Swizz system. As I was rated 15 out of the 24 players in the tournament, I near the top of the bottom half, and knew I would get one of the best players in the tournament. Peter was rated 4th in the tournament - the number 2 seed took a bye in the first round, so I played Peter instead of the number 3 seed. As you will see, I was also drawn against the second and thrid seeds in later rounds.",
        "1... c5": "This was the first of my three loses in the tournament - all with the black side of the Sicilian Defence.",
        "2. Nf3": "He heads for the main line.",
        "2... d6": "I've recently changed my move order, to avoid 2....Nc6 3. Bb5",
        "3. d4": "So he plays the open variation.",
        "3... cxd4": "I take.",
        "4. Nxd4": "He takes back.",
        "4... Nf6": "The usual move.",
        "5. Nc3": "The usual reply.",
        "5... Nc6": "And I go back to the main line, (sometimes called the Classical Variation rather than the Dragon with g6 or the Najdorf Variation with a6 or the Scheveningen Variation with e6.",
        "6. Be2": "6. Be2 is perfectly playable, if slightly less aggressive than Bg5 the Richter–Rauzer Attack or 6.Bc4, - the  Sozin.",
        "6... e5": "I play the Boleslavsky Variation.",
        "7. Nb3": "This is the older way of handling this for white. Nowadays Nf3 tends to be played more, as the increased pressure on e5 makes it harder for black to play d6-d5.",
        "7... Be7": "I develop.",
        "8. O-O": "He castles.",
        "8... O-O": "So do I.",
        "9. f4": "Attacking! If I allow the further advance f4-f5 white can build up a good attack against the black king.",
        "9... exf4": "So I take.",
        "10. Bxf4": "He takes back.",
        "10... Ne5": "I secure a lovely post for my knight.",
        "11. Kh1": "Simply moving his king to a safer square and avoiding checks from my queen, if it moves to b6.",
        "11... Be6": "I continue to develop.",
        "12. Nd4": "I was rather frightened by the prospect of him exchanging on e5 and e6 and leaving me with doubled pawns on those squares.",
        "12... Nfd7": "Played with the idea of recapturing on e5 with my knight rather than the pawn. I didn't expect his next move, after which I felt a bit uncomfortable. I think 12....Ng6 or 12....Bc4 are better.",
        "13. Nf5": "With an attack on my d pawn.",
        "13... Nc5": "This move means that my d pawn is now protected by my queen.",
        "14. b4": "But he has this.",
        "14... Na6": "Of course, going back to d7 would lose the d pawn.",
        "15. Nxe7+": "He said afterwards that he was afraid of my bishop going to f6 and enjoying a lovely long diagonal.",
        "15... Qxe7": "I take back.",
        "16. a3": "He protects the b pawn.",
        "16... Nc7": "I thought I was stopping his knight from entering on b5 or d5, but....",
        "17. Nd5": "It comes into d5 any way.",
        "17... Bxd5": "I take.",
        "18. exd5": "He takes back.",
        "18... b5": "I prevent him from connecting up his queen-side pawns with c2-c4",
        "19. Qd2": "He connects his rooks.",
        "19... f6": "I give more support to my knight on e5.",
        "20. Rae1": "He develops his rook.",
        "20... Qf7": "I attack d5. This is my big mistake!",
        "21. Bxe5": "He takes.",
        "21... dxe5": "I take back. I've manged to connect my pawns into 2 groups and prevent his d pawn from being supported by his c pawn. The problem is his d pawn can advance without the aid of his c pawn.",
        "22. Red1": "He prepared to advance.",
        "22... Rfd8": "If only I had another move and could play Rd8-d6 I would be OK but.....",
        "23. d6": "He advances.",
        "23... Ne8": "I attack the pawn.",
        "24. d7": "It advances again.",
        "24... Nc7": "My knight is forced to move again.",
        "25. Qd6": "My knight is rather short of squares!",
        "25... Ne6": "Forced!",
        "26. Bxb5": "So the pawn goes.",
        "26... Nd4": "I block the d file. Find white's next move!",
        "27. Rxd4": "Would you have played that? it is an excellent exchange sacrifice.",
        "27... exd4": "I take back. Find white's next move!",
        "28. Bc6": "Threatening Bd5 winning the queen and also 29. Bxa8 Rxa8 30. d7-d8=queen.",
        "28... Qf8": "So I try this. Again, find white's move.",
        "29. Bd5+": "Usefully driving the king away.",
        "29... Kh8": "Find white's next move!",
        "30. Qxf8+": "He has seen a winning line.",
        "30... Rdxf8": "I take back.",
        "31. Bxa8": "He recaptures the exchange at last.",
        "31... Rxa8": "I take back. OK find white's next move.",
        "32. Re1": "This is the fastest win! Black resigns. Many thanks for reading, please rate this annotation on the star system, and leave a comment or two to let me know how I am doing with my annotations. Until next time dear reader!"
    },
    "url": "https://gameknot.com/annotation.pl/xy-chess-tournament-malta-round-1?gm=63091",
    "gameName": "XY Chess Tournament, Malta, Round 1",
    "players": "Peter Sammut Briffa (2094) vs. Charles L Higgie (1928)",
    "opening": "Sicilian (B56)"
}