{
    "moves": {
        "1. e4": "My opponent was rated third in the tournament and went on to win it.",
        "1... c5": "I played three Sicilian Defences in the tournament - all against players with a higher rating - I lost them all!",
        "2. Nf3": "Conventional so far.",
        "2... d6": "I repeat this move order, designed to prevent 2....Nc6 3. Bb5",
        "3. Bb5+": "But he plays it any way.",
        "3... Bd7": "This seemed the most logical block.",
        "4. a4": "This was all a slight surprise.",
        "4... Nf6": "So I hit the e pawn.",
        "5. Nc3": "He defends.",
        "5... g6": "And I fianchetto.",
        "6. O-O": "He castles.",
        "6... Bg7": "I complete the fianchetto.",
        "7. e5": "He advances in the centre.",
        "7... dxe5": "I take.",
        "8. Nxe5": "He takes back.",
        "8... Bxb5": "I take again.",
        "9. axb5": "He takes back, with pressure down the semi-open a file against my rook.",
        "9... Nbd7": "I develop.",
        "10. Nxd7": "He takes.",
        "10... Qxd7": "I take back.",
        "11. Qf3": "This was a surprise too.",
        "11... O-O": "So I castle.",
        "12. d3": "I'd rather expected this last move.",
        "12... Rfd8": "With the idea of Nf6-e8 then to d6 or c7 without having to break the connection between my rooks.",
        "13. Re1": "He continues to develop.",
        "13... Ne8": "I just carry on with my plan. OK find his next move?",
        "14. Qe3": "My last move was a mistake, maybe I should have played 13....b7-b6. Now he is forking pawns on e7 and c5, I have to take desperate measures to avoid losing material.",
        "14... Bxc3": "Like giving up my powerful dark squared bishop!",
        "15. bxc3": "He takes back.",
        "15... Qxb5": "I take.",
        "16. Qxe7": "He takes.",
        "16... Rd7": "I hit his queen.",
        "17. Qe5": "The queen drops back.",
        "17... Qc6": "I wanted to play f6 and if Qe6+ I can now exchange queens.",
        "18. Bh6": "He threatens 19. QxNe8 RxQe8 20. RxRe8 mate.",
        "18... f6": "Now the question is - can he still play 19. Qxe8+. What do you think dear reader?",
        "19. Qe3": "The answer is, yes he has! We both considered the sacrifice, \n19.\tQxe8+\tRxe8\n20.\tRxe8+\tKf7\n21.\tRf8+\nWe both thought white didn't have enough. Later analysis shows white is winning. At the time of the game, before his 19th move, I was only looking at 22. Rxa7, but 22. Re1+ is more powerful. 21....Ke6 is forced, as after ....Ke7 22. Re1+ Kd6 23. Rxf6 wins the black queen. After 22. Re1+ Kf5 23. h6 threatens mate, so .....g4 then 24. Rg8 stops the black king escape. Black has to give up his queen to avoid mate. ",
        "19... Nc7": "I start to get back into the game. His bishop is better than my knight, but he has got doubles pawns. I should be able to hold this. In an endgame by a pawn could be a valuable asset. I am threatening to play Nd5, hence his next move.",
        "20. c4": "He prevents my threat. It is also quite a reasonable idea for him to put pawns on white squares to allow his bishop to weave in and out of them.",
        "20... Kf7": "Preparing to contest the e file. Of course if 20. Rd8? Qxd8! as before.",
        "21. Qh3": "So rather than being driven from the e file, his queen voluntarily leaves it.",
        "21... a6": "To free up my Ra8",
        "22. Bd2": "Threatening my h pawn and also preparing to put the bishop on c3.",
        "22... h5": "I wondered afterwards if this move was too weakening, but Fritz seems to like it.",
        "23. f4": "Planning f4-f5 breaking up my king-side position.",
        "23... Rh8": "This is my defence, planning on meeting f5 with g5, and of course my rook is needed on h8 to protect my h pawn. Fritz seems to like Ne6 with the idea of meeting f5 with Nd4.",
        "24. f5": "He continues with his plan.",
        "24... g5": "And so do I. Fritz like gxf5 but I didn't like splitting up my king-side pawns. My knight can't advance anywhere now.",
        "25. Bc3": "He improves the placing of his bishop.",
        "25... Re7": "I contest the e file. Fritz seems to like Rd7-d8 but this seems just as good to me?\n",
        "26. Rxe7+": "He takes.",
        "26... Kxe7": "I take back.",
        "27. Qe3+": "His queen returns to the e file with a check. Right, where would you move the king to, dear reader?",
        "27... Kf7": "I go back to the king-side. Fritz prefers Kd7.",
        "28. Ra5": "My opponent afterwards admitted this was a mistake, as he thought b5 was forced.",
        "28... b6": "But I have this move.",
        "29. Ra1": "And his rook comes back.",
        "29... Re8": "Attacking his queen. Maybe Qe8 was better, although Fritz does like this move.",
        "30. Qh3": "His queen attacks my h pawn again. What would you play here?",
        "30... h4": "Fritz prefers Rh8 and I have to agree.",
        "31. Qg4": "And now what would you play?",
        "31... Re3": "I had dreams of playing Re2 at some stage and having a powerful counter-attack on g2, but it just isn't happening. It was not too late for Rh8 and my position is hold-able.",
        "32. Qh5+": "Now he is just winning.",
        "32... Kf8": "I'm not sure any other moves are any better.",
        "33. Qh6+": "Another check.",
        "33... Ke7": "I've got to lose at least a pawn, and that should be enough for him to win, but maybe Kf7 is better as now....",
        "34. Kf2": "And my rook has no squares. Black resigned. Many thanks for reading. Please rate the annotation on the star system and leave a comment or two to let me know how I am doing. Until next time dear reader!"
    },
    "url": "https://gameknot.com/annotation.pl/xy-chess-tournament-malta-2017-rd-4?gm=63149",
    "gameName": "XY Chess Tournament Malta 2017 Rd 4",
    "players": "Marco Viela (2182) vs. Charles L Higgie (1918)",
    "opening": "Sicilian (B52), Canal-Sokolsky attack, 3...Bd7"
}