{
    "moves": {
        "1. e4": "Freddy invited me to Gameknot to play some games in the Bryntse Gambit (or to use the name he made up, the Demolition Derby Attack). I gave a lecture on this variation at ChessLecture.com, called \"Nuke the Sicilian! How to Sac Your Queen on Move Six and Win.\" This game is absolutely a wonderful example of how the attack should go -- but just when you think White is going to win, Freddy plays some great defensive moves and escapes with a draw. I would like to see some comments on where I went wrong. Move 41? 43? 44?",
        "1... c5 2. f4 d5 3. Nf3 dxe4 4. Ng5 Nf6 5. Bc4 Bg4 6. Qxg4 Nxg4 7. Bxf7+ Kd7 8. Be6+": "The \"tabiyah\" position, and the starting point for our game.",
        "8... Kc6 9. Bxg4 e6": "Probably best. Other alternatives are 9. ... Qd4 and 9. ... Qd6, but Black's biggest problem is lack of development. Note that 9. ... e5? is dubious because of 10. Nf7 Qh4+ 11. g3 Qxg4?? 12. Ne5+ -- the first and most basic trap in the \"Demolition Derby Attack.\"",
        "10. Nc3 Na6 11. a3": "So far following Mackenzie-Pruess, Reno 2006.",
        "11... Qd4": "Freddy's novelty. Pruess played 11. ... Bd6 here, and in my many games against Fritz the computer played 11. ... Qf6 every time. Freddy's move looks much more assertive, and so I had to figure out why the computer doesn't like it.",
        "12. Nxe6": "I looked at seven (!) candidate moves: N3xe4, d3, Nxe6, Bxe6, N5xe4, Ne2, and Nf7. I decided on this for two reasons. First, I really don't like having the queen in my face, and second, this seemed like the only way to profit from Black's playing ... Qd4 instead of ... Qf6.",
        "12... Qd7": "This was a surprise, and I realized now that I had been a little too superficial in my analysis on the previous move. I had expected 12. ... Qf6, when White can gain a key tempo after 13. O-O Re8 14. Nxe4. If 14. ... Qg6 15. N6g5! with two key points: 15. ... h6? 16. f5 trapping the queen, or 14. ... Rxe4 15. Bf3 winning the exchange.\r\nThe point of 12. ... Qd7 is to not allow White to win a tempo with Nxe4, so now 13. ... Re8 becomes a serious threat.",
        "13. d4": "My first inclination was to play 13. Bh3, which I still think is okay for White. Then I started looking at this move, almost as a joke, and realized it was no joke! If Black takes either way, White gets lots and lots of piece activity, which is what the opening is all about. If he declines the pawn then White just gets a great bind after d5.",
        "13... exd3 e.p.": "If instead 13. ... cxd4, then 14. Ne2 threatens N6xd4+, winning Black's queen.",
        "14. Bf3+ Kb6": "A little bit of a surprise to me, but 14. ... Kd6 15. Ne4+ Ke7 16. f5 also looks really good for White, with all of his pieces participating in the attack. After 14. ... Kb6 the position takes on a very forcing character, as White gets a long series of checks.",
        "15. Nd5+ Kb5 16. Nc3+": "An interesting moment psychologically. I had not yet worked out how White gets an advantage after c4+, and so I decided to play this move to see if I could tempt Black into either ... Ka5 or ... Kc4. On 16. ... Ka5 I was planning the spectacular line 17. b4+ cb 18. ab+ Kxb4 19. Nd5+ Kb5 20. Rxa6!?! ba 21. N6c7+, with amazing complications. Believe it or not, there is a good chance that Black will get mated on a1.\r\nHowever, Freddy indicates that he is willing to play for a draw by repetition. Interestingly, at this point he still thought that Black would have the advantage if White doesn't go for the draw.",
        "16... Kb6 17. Nd5+ Kb5 18. c4+": "A key point in the game. I think that 18. f5 is too slow, and 18. Nxf8 opens the position up too much. Even now I had not fully worked out the point of 18. c4+ -- but it just seemed like White's only try for an advantage.",
        "18... Kxc4 19. Ne3+ Kb5 20. a4+": "The next key point. When I played 18. c4+, my intention here was to play 20. Bd5. But this gives Black an important tempo to play 20. ... Nc7! Now on 21. a4+ Kb6! 22. Nc4+ Ka6! 23. Ne5 Qxe6! 24. Bxe6 Nxe6, Black has successfully fended off the White attack. Black is a pawn up, but more importantly Black can develop very naturally. White will win the pawn back but the best he can hope for is equality, and maybe even a slight disadvantage. However, this line showed me that it was very important for White to try to get the knight to e5. I therefore thought about 21. Nxc7 Qxc7 22. Qxc7 23. a4+ Kb6 24. Nc4+ Ka6 25. Ne5, which gets the knight to e5 without allowing a queen sac for two pieces. I could not reach a clear assessment after 25. ... Qd6 26. Be3 d2+!\r\nNevertheless, as I sat down in front of the computer I was planning to enter the move 20. Bd5, but then I said, \"Wait a minute, what about ...?\"\r\nAll that analysis of 20. Bd5 turned out to be wasted effort, except for one thing -- it showed me the importance of getting the knight to e5.",
        "20... Ka5": "Forced, as 20. ... Kb6 21. Nc4+ is mate, and 20. ... Kb4 21. Bd2+ Kb3 22. Bd5+ forces Black to give up his queen (for only ONE piece) to stop mate.",
        "21. Nc4+ Kb4 22. Ne5": "This is the point I suddenly realized on move 20 when I was sitting at the computer. Ironically, I had gotten to the position after 21. ... Kb4 previously in my analysis, and concluded there was no way White could play this line. He has two pieces en prise and he can't defend them both. It was only several hours later that I came back to this move and realized White doesn't HAVE to defend them both!",
        "22... Qxe6": "Poor Freddy doesn't have much choice about any of his moves during this part of the game.",
        "23. Bd2+ Kb3 24. Bc3": "Threatening 25. Bd1 mate. If 24. ... Nb4 25. Ra3+ Kc2 26. Bd1+ Kb1 27. Kd2 with mate next move. 24. ... d2+ is a possibility, but after 25. Kf2 Black will still have to give up his queen, plus the pawn on d2 is now a sitting duck. Freddy decides to give up the queen immediately, perhaps hoping that he might be able to hold onto the d3 pawn.",
        "24... Qxe5+ 25. fxe5": "With both queens off the board, you might expect the position to get simpler. But you would be wrong! Black's king remains nearly (but not quite) in a mating net, and one wrong step could mean his rapid demise.",
        "25... Be7": "(!) So far White has had most of the fun, but here Black plays an excellent move. I had assumed Black would play ... Rd8 or ... Nb4 because of the potential fork on b7, but those moves lose quickly to Ra3+ and Kd2, threatening b3 mate. 25. ... Be7 prevents White from carrying out that plan because of the check on g5. Freddy is not concerned about 26. Bxb7 -- he may have to sac the exchange, but he gets a tremendous initiative with his knight, his bishop, his rook, and his pawn on d3. Meanwhile, White gives up his best piece, the bishop on f3. NO DEAL!",
        "26. Kd2 Bg5+ 27. Kxd3": "(Reply to Ionadowman) I briefly thought that 26. Bd5+ c4 27. Bf3 was the solution, particularly in view of the exquisite variation 27. ... Nb4? 28. Ra3+ Kc2 29. O-O Bc5+ (Black can throw this check in or not, it doesn't matter) 30. Kh1 Rhf8. It looks as if Black has wriggled out, but now comes the rook sac 31. Rc1+!! Kxc1 32. Ra1+ Kc2 33. Bd1 mate.\r\nUnfortunately, there are two flaws. First, 26. ... c4 is not forced; Black can try 26. ... Kc2 and I couldn't find a clear win. Second, instead of 27. ... Nb4 Black can play 27. ... d2+ 28. Kxd2 Rad8+ 29. Kc1 Rhf8. You're right that Black has to sac the exchange, but look at the awesome compensation he gets after (say) 30. Bd1+ Rxd1 31. Rxd1 Rf2. How will White ever activate his pieces?\r\nThis move was when I started realizing that this was not going to be an easy win. There are lots of exchange sacs that give Black tons of counterplay. Thus, I also had to reject 26. Bxb7? Nb4! 27. Bxa8 Nc2+ because Black's pieces just take over the board.\r\nAlthough risky, 26. Kd2 was the most consistent with White's principles for playing this opening, because it keeps the coordination of the pieces (keeping the two bishops on the board, connecting White's rooks, and even using the king as a fighting piece) and keeps mating threats alive. The fact that it also eliminates Black's potentially dangerous pawn on d3 is a nice bonus.",
        "27... Rhd8+": "This move surprised me a bit. I thought that Black's best try was 27. ... Rad8+ 28. Ke4 Rhf8, when all of a sudden White's king is very uncomfortable! My intention was to continue Bd1+, Be2+, and Rf1.\nBlack has, of course, many opportunities to go wrong. My favorite mistaken variation was 27. ... Rad8+ 28. Ke4 Nb4? 29. Bd1+ Kc4 30. Ra3 (threatening Bb3 mate) Rxd1 31. Rxd1 Nc2 (it looks as if White has overlooked this shot, winning back the exchange) 32. Rd3!! (but no! White sacs a whole rook instead) 32. ... Nxa3 33. Be1!! and there is no defense to b3 mate. This is the way I was hoping the game would end.",
        "28. Ke4 Rd4+ 29. Bxd4": "A big decision. Freddy thought 29. Kf5 was more principled (according to my ChessLecture on this variation, where I admonish White \"Don't cash in too early\"). However, I thought that after 29. Kf5 Be3 Black's rooks would start getting really dangerous, and I would probably have to accept the exchange sacrifice anyway. The other reason I took immediately was that I was able to work out a long tactical variation that led to a better endgame.",
        "29... cxd4 30. Kxd4 Rd8+ 31. Bd5+ Kc2": "Notice that 31. ... Kxb2?? would lead to instant checkmate with 32. Ra2+! The mating threats never seem to stop in this game. The b-pawn seems to have a charmed life, and White immediately takes advantage of it with his next move.",
        "32. Ra3": "(!) The key move. White seems to ignore the threats of ... Nc7 or ... Nb4.",
        "32... Bd2": "If 32. ... Nb4 33. Rc3+! Kd3 34. Kc4. Now if 34. ... Nxd5 35. Rd3+ and White recovers the piece. It's wonderful how White makes Black's king dance around into all the wrong places! Alternatively, if 34. ... Rxd5 35. Kxb4 Rxe5 36. Kb3, I judged this exchange-up endgame to be a win for White, although it might take a while.",
        "33. Rc3+": "(!) White had to see this resource back on move 29, otherwise the whole line would be unplayable.",
        "33... Bxc3+": "Another amazing line happens if Black declines the exchange with 33. ... Kxb2. Then White plays 34. Rb3+ Kc2 35. Rhb1! and threatens mate with R3b2! Again, this had to be foreseen back on move 29. Black's only defense is to play 35. ... Be3+ (or 35. ... Bc3+, it doesn't matter) 36. Rxe3 Kxb1 37. Rb3+ followed by Rxb7. This ending is completely winning for White, as the bishop and rook dominate the knight.",
        "34. bxc3 Nc7 35. c4": "The b-pawn, after surviving by some miracle and turning into a c-pawn, now comes along and rescues White's bishop in distress.",
        "35... Ne6+ 36. Ke3 Nc5": "This is roughly where I stopped in my analysis on move 29, and thought that White was probably winning. But it is much harder than I thought it was. White's pawns, even though they look imposing, are rather shaky. And if Black can win the pawn on a4 and start pushing his a-pawn, it could be rather hard for White to defend.",
        "37. Rf1": "White ignores the a-pawn for now, and just improves the position of his pieces. The seventh rank beckons, where there are several tasty pawns for White's rook to munch.",
        "37... Kc3": "Another beautiful variation: If 37. ... Re8, attacking the e5 pawn, White plays 38. Rf7 anyway! The point is 38. ... Rxe5+? 39. Kd4! Nd3 40. Be4 winning the knight. Even though the mating threats have finally gone away, the position of Black's king is still a problem! Freddy says, \"Enough already,\" and moves to reunite his king with the rest of his army.",
        "38. Rf7 Re8 39. Kf4 Kd4 40. Rxg7 h6 41. Kf5": "Up to this point I don't think I have made any significant mistakes. However, 41. Kf5 may be my first error. I really wanted to keep my rook on the seventh rank, and I thought that I would just walk my king into g6 and win his rook pawn. However, it isn't so easy, and so now I wonder if I gave up on 41. Rh7 too easily. After all, it *does* give me connected passed pawns on the kingside, even if it misplaces my rook a little bit.",
        "41... Rxe5+ 42. Kg6 h5 43. Bxb7": "This was a painful decision, because I really liked White's battery of bishop and pawn on d5 and c4. The trouble was that on my intended move 43. Rh7, Black has the spectacular resource 43. ... a5 44. Rxh5 Rxh5 45. Kxh5 b5!! If 46. ab White's bishop can never stop the a-pawn. If 46. cb Kxd4 it looks to me as if Black has time to take on a4 and then bring his knight to the queenside.\r\nSo I had to look for a new plan, and I finally decided on this one. There were too many lines where Black's move ... b7-b5 was a key idea, so I decided that getting rid of the b-pawn was the right thing to do. I spent a long time also looking at 43. h3 and 43. h4, but I was not convinced that either of them was a win.",
        "43... a5 44. Bd5": "The main alternative for White is 44. Bf3. I regret to say I did not spend enough time looking at this move, because 44. Bd5 seemed to be completely winning to me. I should have realized that Freddy had one more trick up his sleeve!",
        "44... Nxa4 45. Ra7": "Draw offered and accepted. Only after Freddy played 44. ... Nxa4 did I see his point: If 45. Ra7 Nb6! 46. Rxa5 Nxc4! White has to give up his bishop. 47. Ra7 may be okay for White, but I was going to play 47. Rb5 Nd6 48. Rb4+ (not 48. Ra5? Ne4 followed by 49. ... Nc3 and Black probably wins) 48. ... Kxd5 49. Rh4. Black cannot save his h-pawn, and the endgame R + 2P versus R + N should be a draw.\r\nInterestingly, Freddy thought that 45. Ra7 Nb6 46. Bf7! would still be better for White, though he thought he could hold a draw. I believe that he missed the response 46. ... Rc5! The idea of this move is simply to set up ... Nxc4, which was not playable right away. It's hard to see any way for White to make progress. For example, after 47. h4 Nxc4 48. Kh6 Ne3 49. Bxh5 Nxg2 Black wins both kingside pawns and probably has a won game.\r\nIn view of this line I was happy to have the alternative of taking Black's last two pawns and bailing out into a draw."
    },
    "url": "https://gameknot.com/annotation.pl/dana-vs-freddy-demolition-derby-attack?gm=25796",
    "gameName": "Dana vs Freddy -  Demolition Derby Attack",
    "players": "oddodddodo (1200) vs. easy19 (2269)",
    "opening": "Sicilian (B21), Grand Prix attack"
}