{
    "moves": {
        "1. e4": "You can analyze the game here:\nhttp://gameknot.com/anbd.pl?bd=8140443&fb=1&rnd=0.47384035058167306",
        "1... e5 2. d4 exd4 3. c3 dxc3 4. Bc4 cxb2 5. Bxb2": "We played Danish gambit opening as a theme in a mini-tournament. This is the last forced move. \n\nWhite sacrifices two pawns for a strong attack on the king-side. \nBlacks biggest disadvantage is he is behind in development.",
        "5... d5": "Black sacrifices the queen-pawn, the Schlechter defense.",
        "6. Bxd5 Nf6 7. Bxf7+ Kxf7 8. Qxd8 Bb4+ 9. Qd2 Bxd2+ 10. Nxd2": "All book moves until now:\n* Material is even.\n* Whites doubled bishops are gone but still has a strong dark bishop on the long diagonal. It is aiming straight at blacks king. \n* White has moved his light bishop three times, but black is still behind in development\n* Blacks king is weakened.\n* Both white and black has a passed pawn.\n* White have lots of open files for his rooks.\n\n",
        "10... Nc6": "Challenging whites domination on the dark squares and develops - blacks greatest weakness.",
        "11. Ne2 Re8": "Developing with tempo - white must defend his e4 pawn.",
        "12. f3 Be6": "A more active position than d7.",
        "13. Kf2 Rad8": "Finally black is fully developed. ",
        "14. Rhd1": "Challenging the d-file. \nHowever it allows me to do Nb4. An important part of chess anticipate your opponents moves and suppress his counter-play.",
        "14... Nb4": "Preparing a queen side pawn storm and threatens to swipe the \"evil\" black bishop off the board with Nd3 . \nWhy I don't like the bishop:\n* It is aiming for my king.\n* White can also trade on f6 whenever he wants, making my calculations more complicated.",
        "15. Nc1": "Defends c3.\nTo my opinion a too defensive move - white is giving up territory.",
        "15... c5 16. a3": "Kicking my knight.",
        "16... Nc2": "Better is to fall back 16 .. Nc6, especially since I played c5 before.\nBut I wanted more action :-)",
        "17. Rb1 b6": "Avoiding 18 Bxf6 19 Rxb7 or 17 .. Nd4 18 Bxd4 cxd4 19 Rxb7 and improves the pawns.",
        "18. Ne2": "Threatens the knight d4 retreat.",
        "18... Nd4 19. Bxd4": "19 Bxd4! - White sacrifices his evil dark bishop, a wakeup call for me!\n\nNow I will loose a pawn. I just have to decide the best way to do it. My plan is to improve the light bishop and disrupt his position.",
        "19... cxd4 20. Nb3": "Here it comes - a triple attack",
        "20... d3": "Hard to hit a moving target.",
        "21. Nf4 Bc4": "An aggressive bishop position.",
        "22. Nc1": "A Knight on the rim is dim - but necessary to catch the pawn.",
        "22... Kg8": "22 .. Kg8 improves king safety. The pawn is lost anyway and I can't see any benefits of pushing the pawn again.\n\nMore important: I'm planning to double the rooks on the d-file by moving the inactive rook Re8 in front of d8 Rook. The current king position will ruin my plans because of the loosing combination 22 .. Re5 23 Ncxd3 Rd7 Ne5 . Further 22 .. Re5 or Re6 are pointless since e6 and d5 are guarded.\n\nI'm contemplating Nxe4  sacrifice .. 23 fxe4 Rxe4 at this point. But lets keep it in mind...",
        "23. Nfxd3": "Ncxd3 would have been better - activating the knight and connecting the white rooks.",
        "23... b5": "Cements the bishop on c4. Also keeps the tension, I'm not interested in exchanging a very strong bishop for a pinned knight. \n\nI must keep an eye on the weak backward a7 pawn though. If I need to push it (a4 a6) it can become a target after Nc5.",
        "24. Rb2": "Preparing troublesome double rooks on the d-file.",
        "24... Ref8": "This prevents Rbd2 by threatening 25 Rbd2 Nxe4  with a winning fork - White cannot take the knight with the f3 pawn, which is pinned by the f8 rook to the king, and the knight forks whites king and rook.\n\nBut this is just temporary until white moves his king. ",
        "25. h3": "25 h3? \nPlease note that the e4 pawn is hanging.\nMoving the king is better.",
        "25... Nxe4+": "Suddenly the f6 knight enters the game with a vengeance! Even though black doesn't fork with the knight (as described on move 25 .. Rf8) it wins a protected passed pawn (which is has a great queening potential). Sometimes simple tactics works!\n\nThe knight is a great pawn-stealing piece. Always be on the lookout for discovered attacks against the king or queen, your own and opponents.",
        "26. Ke3": "A very aggressive and exposed King position - a great target for my rooks. ",
        "26... Nc3": "Moves the knight out of danger and more important it deprives white of the troublesome double rooks on the d-file because white must move his d1-rook.",
        "27. Rdd2": "Now the poor thing Rb2 is locked in.\n\nNow what should black do?",
        "27... Rf5": "* The natural move for white is to move the d3 knight - threatening Rd8 and activating his pieces. e.g. an rook exchange on d2 will just activate his b2 rook.\n* Moving a pawn will just give white the initiative.\n* I won't move or exchange the bishop from a very good outpost.\n* The knight is currently safe (Rc2 is toothless) and has a safe haven on d5. It is also very active.\n* A check wins me nothing, better to keep it for a rainy day.\n* I also want to keep my rook at d8 - keeping the knight pin and the tension.\n* Exchanging will make the life easier for white especially since he has got the more active king.\n\nSo I need to do something with Rf8, which also happens to be my most inactive piece. I want to turn the tables with double rooks on the d-file, increasing the pressure:\n* Rf7 is not good because of Rd7 Nc5 or Ne5 which will force an exchange on d2, which I don't want to do.\n* Rf6 is not good because of Rd6 Nc5, threatening a fork on b7 thus forces an exchange on d2...\n* 27 .. Rf5 deprives the white knight of the e5 and c5 squares. Lets see what I think will happen:\n\n27 .. Rf5 28 Ne2 Re8  [29 Kd4 Nxe2  30 Rxe2 Rxe2 31 Rxe2 Rd5  (winning a Knight)] or [29 Kf2 Ne4  (winning the exchange)]\n27 .. Rf5 28 g4 Rd5 (with a good black game) 29 Nf4 Nd1  (winning the exchange)\n27 .. Rf5 28 Nb4! Nd5  (with an equal game)\n",
        "28. Nf2": "Of course he did something else... Still, I think Nb4 is better.",
        "28... Nd5+": "Let the checking begin! Because of the knight at f2 the white king cannot retreat.",
        "29. Ke4 Rf4+ 30. Ke5 Re8+ 31. Kd6 Rf6+ 32. Kc5 Rc8+ 33. Kd4 Rf4+ 34. Ke5": "The loop is complete! Now, why did I do this? \n\nMaybee I'm loopy? \nBut I gave my opponent the opportunity to blunder with 32. Kd7? which will loose quickly after Re7  Rf8# (the e7 square is protected by the knight)\nI also unpinned the d5 knight with tempo when I checked the king. This is crucial for my future plans.\n\nI have the choice to draw the game by making two more loops but I think I've got a chance to win.\n",
        "34... Re8+": "My main idea is to drive the white king as far up the board as possible and then go after it. What is important to avoid exchanges (unless I'm winning material) otherwise the white king will probably survive.",
        "35. Kd6 Ne3": "* I need to move the knight otherwise the king dance will continue.\n* Ne3 opens for Re6 (protected by the bishop) and Rf5 (protected by the knight)\n* Ne3 threatens to grab the g2 pawn, leaving the h and f pawns very weak.\n* I also have the threat after the bishops moves: Nc4 forks the rooks. \n",
        "36. Ne4": "Protects the g2 pawn and activates the knight - but white might loose his king\nThe other option is to flee the king to safety Kc5 - but then white will loose the g2 pawn.\n\nLets see if I'm right.",
        "36... Rf5": "Starts boxing in the king.\nKey moves for black is (in order)\n* Re6, driving the white king towards the board edge, away from his defenses.\n* Nd5, protecting e7 for the rook and closes the in-route for the white d2 rook.\n* Re7 Rf8#\n\nBlack also have the options:\n* Nxg2, a decoy sacrifice when the white knight is on d6 and the king on d7 or e6, then the black rooks can pin and win the knight. \n* Bd5 if white moves a piece to d5 (see below). This keep the white king out of c6, which is an escape route to c5. This leaves b5 hanging and requires the white knight to move a second time.\n\nKey moves for white is\n* Try escaping via Kc5. Black must close this hole and white try to open it.\n* Moving the king vacates the square d6, which is a stronghold square for white. The knight or rook can move in and defend on d6. It also blocks checks on the 6th rank and opens up a route for the king to c5.\n* Kc7, opens up the d-file for the white rook and an annoying check on d8 looms. It also removes a check in the rook  mating pattern allowing a white piece to move freely.\n* Nd6, attacks f7 and e8 which are key checkmate squares. It also threatens to exchange the c4 bishop. The c4 bishop is key to check-mate by supporting Re6.\n* Nc5 protects e6, puts up (with Ne4) a protective wall against rook checking patterns. Also easily protected by N1d3. However it blocks the king escape.\n\nSample variations, king moves first:\n37 Kc6 (Leaving d6 and escapes towards the queenside) Re6  (38 Rd6 Bd5  looses the rook after K7 Rf7 )  38 Nd6 Nxg2 (decoy sacrifice, grabs a pawn, hangs f3, the knight cannot take f5) 39 Rxg2 Rd5 (attacks the pinned knight) 40 Rgd2 Rexd6  (The d2 rook cannot take and will be lost)\n37 Kd7 Re6 38 Nd6! (defends e8 f7) Rff6 (contemplate Nxg2 decoy sacrifice, similar to above)\n37 Kc7  Re6  38 Nd6 Nd5  (39 Kc6  R5f6 or not Kd7 looses knight ) 39 Kd7 Re7  40 Kc6 Rc7# (K?8 Rf8  Ne8 Rfxe8#)\n\nKnight goes first\n37 Nc5 (defends d7 e6, but blocks c5 escape for king) Nd5 (Blocks Rd2 rook a",
        "37. Kd7": "Kd7 is also a good defensive/offensive move. \n* It also removes a check in the rook  mating pattern allowing a white piece to move freely.\n* Like Nd6 forcing the f5 rook to move, and keeps the black rooks out of f7 and e6.\n* However it doesn't open up the d-file for the white rook.\n\n",
        "37... Re6": "Brings the rook to safety and boxes in the king.",
        "38. Nd6": "Nd6 forks the rook on f5, the bishop and the pawn on b5.\nAlso defends f7 and e8.",
        "38... Rff6": "Moves it to safety and prepares Nd5 by defending e6.",
        "39. Nxb5": "Nxb5? - a greedy pawn-grabber that moves the main defender away from the action. White is apparently ignoring the mate-threat Nd5 Re7  Rf8#.\nNow white cannot defend e7 and f8. \n\n39 Nxc4 is worse since Nxc6 forks the rooks.\nMoving the knight is not better: 39 Ne2 Nd5 40 Rxd5 Bxd5 41 Nxb5 Rf7  42 Kd8 Kf8 43 Nc7 Rd6  44 Kc8 Rc6 wins the knight\nA rook sacrifice? 39  Rxb5 Bxb5  40 Nxb5 Nf5 looses \n\nI think the best is: 40 Kc6 Bd5  41 Rxd5 Nxd5 42 Kxd5 Rxd6  - white is two pawns down but still fighting\n\n\n",
        "39... Nd5": "Proceed with my plan.",
        "40. Rxd5": "To avoid mate white must trade off the black knight for a white rook.\n",
        "40... Bxd5": "Lets analyze this position:\n\nBlacks advantages:\n* Black is up a pawn.\n* Black has two rooks against a rook and two knights. i.e. three long-range pieces against one long-range and two short-range pieces in an open game.\n* Black still has formidable mate-threats e.g. Rf7  Kf8 Re8 .\n* Whites knight on c1 is a long way from the action.\n* Whites rook is inactive.\n\nWhites advantages:\n* White has the same number of pieces and one pawn more than black.\n* Black pawn on a7 is hanging.\n* Whites king is more active (but still very vulnerable)\n* White can still defend with the e8 square with Nc7 (but looses after Rf7  [Kc8 Rf8 looses the knight] Kd8 Rd6  [Ke8 Bc6#]  Rc6 pinning and winning the knight)\n\nUnfortunately white cannot capitalize on his advantages, unless black makes a blunder.\n\nBlacks strategy:\n* Force whites king to the 8th rank - here I can mate it but it also blocks rook checks against my black king.\n* Use the mating threats to steal material.\n* Check-mate white, possibly with the kings support on Kf8 or bishop on c6.\n\nWhites defense strategy:\n* Avoid mate (doh!)\n* Activate whites pieces\n* Trade to relieve the pressure against the king.\n* Possibly harass blacks king with a check on Rb8  Rb7 ",
        "41. Rc2": "Seizes the c-file and threatens checks on blacks back-rank.\n\nAlternative is moving the knight to Kd4 - opening the b-file for the rook with tempo but Rf7  44 Kd8 Ree7 leaves white in a desperate situation.",
        "41... Bc6+": "I must admit I didn't see this juicy fork until now.\n\nAlternative would have been to continue with the plan to drive the king to the back rank; Rf7  Kd8 Kf8 but fails after Nc7!",
        "42. Rxc6": "White looses the exchange.\n\nWhites strategy was to trade off the pieces to relieve the pressure against his king. It also increases the value of his pawn majority.",
        "42... Rexc6 43. Nd3": "Finally the knight leaves the back-rank. \n\nNow black must be vigilant against knight forks. Please note that black cannot fork with Rd6 . On the other hand the knight cannot take Nxa7 because of the fork threat.",
        "43... Rcb6": "Black tactics: use the weaknesses \n* both knights are undefended\n* the rook fork on d6\n* the knights cannot defend each other (it will take 3 knight moves).\n\nPlease note it is impossible to fork the two rooks after Rxb5.\n\nVariations:\n44 Nxa7 Rb7  with mate to follow\n44 [Nc7 Nd4 Nc3] Rbd6  all looses a knight\n\n44 a4 a6 kicks the knight with the same result as above or\n44 a4 a6 45 Nb4 looses after axb5 46 Nd5 (a toothless fork) Rbd6 \n\nWhite resigns"
    },
    "url": "https://gameknot.com/annotation.pl/danish-gambit-open-like-life?gm=11603",
    "gameName": "Danish Gambit (open like life)",
    "players": "leibniz (1828) vs. johanpiper (1782)",
    "opening": "Danish gambit (C21), Schlechter defence"
}