{
    "moves": {
        "1. e4": "This is another game from dave1973's mini-tournament which I am annotating.",
        "1... e5 2. Nc3": "The Vienna Game, an uncommon variation of the usual King Pawn Game.",
        "2... g6": "I have never seen this line. It isn't featured in Gameknot's openings explorer either, so I'm assuming it's pretty rare.",
        "3. Bc4 Bg7 4. Qf3": "Out comes the queen. Surely White isn't after a checkmate? (sigh...)",
        "4... Nf6": "Neatly blocking the threat.",
        "5. Nd5": "But now White's conveniently developed knight comes into play. Was he hoping for this all along...?",
        "5... O-O": "Get the king out of danger. Black castles.",
        "6. Nxf6+ Bxf6 7. Qg3": "White will have trouble attacking down the g-file thanks to Black's advanced g-pawn...but the h6-square, which has been weakened by this pawn move, and indeed the whole h-file, offer interesting possibilities...",
        "7... c6": "Black prepares for 8...d5.",
        "8. h4 h5": "A crucial defending move to prevent White opening up the h-file, which would be fatal for Black.",
        "9. Be2 Kh7": "I think here the sacrifice Bxh5 would be useful, as after d3 or d4 White's bishop, queen and maybe soon rook would be ready to invade the kingside...perhaps Bxh5 would have speeded up White's win.",
        "10. d3": "White has the right idea, but fails to make any decisive attacks just yet...",
        "10... d6 11. Qe3 Bxh4": "mmhmm...can anyone tell me...is anything wrong with Qh6  ?",
        "12. Nf3 Bf6 13. Qh6+": "Aha!",
        "13... Kg8 14. g4": "This decisive pawn move ensures the opening up of Black's kingside and a swift death for Black.",
        "14... h4 15. Nxh4 Bg7 16. Qe3": "An irritating inconvenience in the eyes of White.",
        "16... Bf6": "I would have preferred keeping the bisop on g7 to defend the kingside.",
        "17. Nf5 Bxf5": "What would have been wrong with an immediate Qh6 ?",
        "18. gxf5 g5": "Black blocks the diagonal...too late...",
        "19. Qh3": "Black cannot prevent checkmate and resigns."
    },
    "url": "https://gameknot.com/annotation.pl/dave1973s-mini-tournament?gm=19319",
    "gameName": "dave1973's mini-tournament",
    "players": "djazzplay (1153) vs. chimesatmidnight (1388)",
    "opening": "Vienna game (C25)"
}