{
    "moves": {
        "1. e4 e5 2. Nf3 d6": "Philidor's Defense",
        "3. d4 exd4": "Exchange Variation",
        "4. Nxd4": "An interesting fact about this move is that in GK's database, after this move white wins most games continued from this opening.  Must say something about it.",
        "4... Be7": "Black is the first to break main line in this opening. On move 4! Maybe he should have learned his opening better if he wished to not get in trouble.",
        "5. Nc3 c6": "Another strange move out of an unusual defense.  What is the point of c6? White appears to have an advantage here with more development and space.  He has also created a backwards pawn on d6 unless he plans to push with d5, but this wastes time.",
        "6. Bc4 Nf6 7. Bb3": "I did not want to lose some of my center with 7...Nxe4 8 Nxe4 d5, and I wanted to keep pressure on f7.",
        "7... Bg4": "This is a pointless move as f3 is already part of white's development in Philidor's Defense and this gives white tempo.",
        "8. f3 Bd7 9. Be3 Na6 10. a3": "I thought that black's plan was to hit my bishop on b3 with his knight so I provided an escape square, but a better plan for black is 10...Nc7 with ...d5 to remove his weakness.",
        "10... Nc5": "My prediction comes through as black is not noticing the fact that he has a weakness on d6.",
        "11. Ba2 Qc8": "An odd place to develop the queen.  It now only has three spaces to move to an none of them attack.  The only benefit from this move is putting a useless battery on the c8-h3 diagonal.",
        "12. Qd2 b6": "What IS black doing with his pawns?  He now has weaknesses on d6 AND c6 and his c pawn cannot move because of his knight.",
        "13. O-O-O O-O 14. g4": "Pawn storm! this move has been waiting to happen for a while once the king castles kingside right into an onslaught.  Notice that I am completely developed, I have a battery on the c1-h6 diagonal, my rooks are connected, and my light-squared bishop points directly at black's king.",
        "14... Ne8": "Maybe black was trying to open up his dark-squared bishop to attack the storm, but it doesn't help.",
        "15. Rdg1 Bf6 16. f4": "An interesting move.  Pushing my f-pawn removes a defender from g4 but is there a reason?",
        "16... Bxg4": "Black takes the bait.",
        "17. f5": "Cutting the string that connected the queen and bishop in half! The bishop is now going to be stuck on the wrong side of the pawn chain.",
        "17... Bh5 18. h4 Qd7 19. Bg5": "The bishop is the only defender of the kingside that is doing anything, and it seems logical to remove it.",
        "19... Kh8 20. Bxf6 Nxf6 21. Rxg7": "Exclam!  A brilliant sacrifice!  If 21...Kxg7, then 22 Qg5  Kh8 23 Qxf6  Kg8 24 Rg1  Bg6 25 fxg6 and forced mate is coming after 26 gxh7   Kxh7 27 Qg7#, or 22...Bg6 23 fxg6 and forced mate follows.  A quicker death is 25...hxg6 26 Rxg6# all thanks to the bishop in the corner pinning the pawn.",
        "21... Rfg8": "Since capure is bad, this is the only move that can stop the looming pressure on g7.",
        "22. Rgg1": "Not yielding the file.",
        "22... Rxg1+ 23. Rxg1 Rg8 24. Rxg8+ Kxg8": "This is the game losing blunder.  It deserves a big fat ?.  24...Nxg8 doesn't lose a knight after 25 Qg5.",
        "25. Qg5+": "The whole point of the sacrifice has been achieved even though it became a trade!",
        "25... Bg6 26. fxg6 Nfxe4": "Trying to save the knight but missing the deadly gxf7  !",
        "27. gxf7+ Kf8 28. Qg8+": "Black saw no need to continue as I would have two queens and forced mate with 28...Ke7 29 f8=Q#.  That would have been a cool ending."
    },
    "url": "https://gameknot.com/annotation.pl/deadly-pawn-storms?gm=8903",
    "gameName": "Deadly Pawn Storms!",
    "players": "romanlegionary (1553) vs. yanchisin (1505)",
    "opening": "Philidor (C41), exchange variation"
}