{
    "moves": {
        "1. c4": "I am not used to this opening.  I am only accustomed to 1.d4 (when it involves the Queen's Gambit) or 1.e4.",
        "1... e5": "Therefore, I decide to play this move.  Note: I am thinking about the Sicilian Defense but in reverse.  This defense starts with 1.e4, c5.",
        "2. d4": "I am not used to this variation.  It appears that he is attempting a gambit, but it is not the Morra Gambit.  The Morra Gambit only involves the Sicilian Defense, unless gambits also transpose.  I am saying this because I know that openings transpose, but I do not know if this happens with gambits.",
        "2... exd4": "I decide to accept this gambit, but it is not a true gambit.  Why?  After this move, he will win the pawn back, after 3.Qxd4.",
        "3. Qxd4 Nc6": "If you bring your Queen out early, I will shoe it away.  At one point, I was obsessed with attacking pieces, and this game took place, before my game against kabika.",
        "4. Qe3+": "?! He decides to place me in check, but this is a mere nuisance.  I can easily get out of this, with my Knight, Queen, or DSB.",
        "4... Nge7 5. Nf3": "He probably moved his knight for development.",
        "5... g6": "In this position, I am trying to Fianchetto my DSB.  I cannot develop with 6...Bh6.  Note: If 6...Bh6, 7.Qxh6 (loosing my bishop).",
        "6. Nc3": "!? He wants to continue his development.  However, this move is dangerous because it crams his DSB.  If he decides to play Bd2, he won't have any more options with his bishop, due to his c3 knight.  Therefore, 6.Bd2 was better.",
        "6... Nb4": "!! In the meantime, I decide to take advantage, with this choice.  At this point, he has to be careful, or I will play a 3 way fork against him.  What pieces will I fork?  That will be explained momentarily.",
        "7. h4": "?? This turns out to be a very serious mistake.  Now, I will play a 3 way fork between his Rook, Queen, and King.  What is the consequence of this fork?  I am now going to win his queen, for my knight.  BTW, this is the fourth or fifth time that I have been able to play a 3 way fork, against an opponent.  In addition, I will take away his chance to castle and expose his king.  By now, you would think that the game is lost for white, but this is not the case.  That will be explained later in the game, as it will result in a huge turning point.",
        "7... Nc2+ 8. Kd1 Nxe3+ 9. fxe3 Nf5": "At this point, I was not thinking because I am trying to win his e3 pawn.  However, I did not see his DSB, so taking it would loose a piece for his pawn.  At this point, I am beginning to get distracted, and it will go downhill, throughout the rest of this game.  ",
        "10. Ng5": "? I do not know why he played this move.",
        "10... Ng3": "I advanced my knight to fork his LSB and Rook, and I am clearly trying to win his rook.  However, he is going to protect it.",
        "11. Rg1 Bc5": "?! Now, I am a little distracted.  I decided to advance my DSB, in my attempt to win his rook.  However, I overlooked his DSB and e3 pawn.",
        "12. a3": "I do not what he is trying to accomplish.  However, I am going to exchange his LSB, for my knight, after 12...Nxf1, 13.Rxf1.  Note: I am still ahead, so I do not mind even exchanges.",
        "12... Nxf1 13. Rxf1 b6": "? At this point, I am very distracted.  In this position, the goal is to develop my LSB, but this is bad timing.  Instead, I should have played 13...f6 to protect my f7 pawn.  Now, he is going to win a free pawn and fork my queen and rook, after 14.Nxf7.  Therefore, he will win my rook, after he takes my pawn as I will be forced to protect my queen.",
        "14. Nxf7 Qe7 15. Nxh8 Bxe3": "? I respond by taking his pawn.  This is a mistake that I will soon regret.  This is, btw, the disadvantage of having doubled pawns, according to Jack Stockel.  However, cdeburca told me that there is more to chess then doubled pawns.  That will be proven throughout the game.  At this point, I am more distracted now, then I was earlier.  15...d6 was best, and that will be explained shortly. ",
        "16. Nd5": "That is because he decides to fork my DSB, so he will win my bishop as I will be forced to protect my queen.",
        "16... Qd6 17. Bxe3 Qg3": "?? At this point, I am trying to win his f1 rook, so I decide to start by attacking his g2 pawn.  However, this is my loosing blunder.  I will explain the reason momentarily.  In the meantime, I am now as distracted, as you can get.",
        "18. Bh6": "At this point, he is finding a way to mate me, and that is why 17...Qg3 was my loosing blunder.  BTW, I am caught off guard by his mating plan.  How is he planning to mate me, and what is my only move to prevent mate?  That will be answered shortly.",
        "18... Kd8": "I do not what I was thinking, but the game is now lost for black.  Sacrificing my queen was the only way to prevent him from mating me.  At this point, he now has an inevitable mating move and will mate in one, after 19.Rf8#.",
        "19. Rf8#": "Everyone has internal distractions, from time to time.  This, however, can be very harmful in a chess game.  When you are distracted, it is a good idea to take a break, until the distraction goes away.  Sometimes, it can take hours to get rid of the distraction.  However, getting distracted is another way to loose a chess game.  That was illustrated in this game, and it is also the moral of this story."
    },
    "url": "https://gameknot.com/annotation.pl/dealing-with-internal-distractions?gm=45173",
    "gameName": "Dealing with Internal Distractions",
    "players": "onib (1110) vs. jkarp (1087)",
    "opening": "English opening (A20)"
}