{
    "moves": {
        "1. e4": "Team match, I'm white, and I begin with the Open game.",
        "1... c5 2. Ne2": "Faced with the Sicilian, I decide to try the Keres Variation with 2. Ne2. I freely admit I don't see the benefit of e2 vs. f3 (sure, I see differences, but not such that I can say one is better than the other), but this move in the World DB is selected by the highest rated white players out of all possible moves. I guess I had better go look this one up. The evident goal is to fianchetto the king's bishop on g2, and the knight on f3 would be in the way. ",
        "2... d6 3. g3 Nf6 4. Bg2": "Mission accomplished. Not that it was much in doubt. Little did I know that this quiet little fianchetto was going to win this game almost single-handedly.",
        "4... Nc6 5. O-O e6 6. c3": "Preparing d4 to build the strong classical center.",
        "6... g6 7. d4 cxd4 8. cxd4": "Mission Accomplished. White has gained the strong classical center, and his pawns have some support from the queen and minor pieces. Black has more dynamic development and the weak classical center. I'm not sure yet that I favor either side in this position.",
        "8... Bg7 9. Qb3": "Keeping an eye on d5.",
        "9... O-O 10. Nbc3": "And another. I was sorely tempted by 10. Bg5, but figured I could probably play the two moves in either order and this one satisfies old Mr. Lasker by developing the knight before the adjacent biship.",
        "10... Rb8 11. Bg5": "Mission accomplished.",
        "11... Qd7 12. Rad1": "Putting a rook on d4 so the knight on e2 will be free to gallivant off on some knightly errand if needed. Even more interesting is the looming possibility of opening the d-file with tempo by discovering an attack against the black queen.",
        "12... a6 13. e5": "Now if 13. ... dxe5?, 14. dxe5 opens the d-file and wins a pawn after 14. ... Nd5 15. Nxd5 exd5 16. Rxd5.",
        "13... Ne8 14. exd6": "But there is still material to be won.",
        "14... Nxd6 15. d5": "These pawns don't know when to quit. There is no perfect answer for black, but the best answer is to retreat the knight to a5 or d8. After 15. ... Na5, 16. Qb4 threatens both knights (17. dxe6 attacks black's queen and discovers an attack on the knight on d6) and white will win at least a pawn. After 15. ... Nd8, 16. Qb6 keeps up the pressure and black is gradually curling up into a defensive ball to be picked apart by white's concentrated attack.",
        "15... exd5 16. Qxd5": "15. exd5? loses a piece. Now black's knight on d6 is pinned to the queen and doubly attacked. White's bishop on g5 prevents 16. ... Rd8 which otherwise might have held the position.",
        "16... h6 17. Bf4": "Black drives away the bishop, but in return, he ends up with 3 vs. 1 on the besieged knight. Further, after white captures the knight with 18. Bxd6, black's two rooks will be forked.",
        "17... Re8 18. Bxd6": "Black escapes the fork but it cost him his knight.",
        "18... Ne7 19. Qc4 Ra8 20. Nf4": "The threat is against the pawn on g6. The f7 pawn is pinned so the g6 pawn is not defended at all.",
        "20... b5 21. Qe4": "White changes threats. Black exposed his rook on a8 to white's fianchettoed bishop. After 21. Qe4 the rook has no escape. 21. ... Ra7 is met with 22. Bc5 and black must give up his queen or his rook - well, the exchange anyway.",
        "21... Bb7 22. Qxb7": "Evidently black overlooked that white bishop all the way back down on g2.",
        "22... Qxb7 23. Bxb7": "Exchanging queens when down by two pieces is never a good idea; white is glad to oblige.",
        "23... Ra7 24. Bg2 Nf5 25. Bb4 Rb7 26. Bxb7": "It's only been four moves since black forgot about the danger of white's bishop way back on g2, and now he forgets it a second time. I believe this is one of the dangers of playing chess games at the rate of 1 move every 3-4 days. Those four moves represented nearly two weeks, plenty of time to forget, especially if playing several dozen other games at the same time. In any case, black found this to be a suitable time to resign. So it turns out that Keres was a genius, and the 2nd-4th moves of this game set the deadly stage for a lethal fianchetto."
    },
    "url": "https://gameknot.com/annotation.pl/death-by-fianchetto?gm=25386",
    "gameName": "Death by Fianchetto",
    "players": "blake84120 (1893) vs. alexpecam (1773)",
    "opening": "Sicilian (B20), Keres variation (2.Ne2)"
}