{
    "moves": {
        "1. d4": "Hi everyone!\n\nThis game explores how the tactic deflection is used to win material.  In this game it wins heavy material as a result of one player throwing pieces into the mix as a hopeful middlegame mating attack ensues.  Will it be King Henry or King Richard who will end up under the cosh here?  You will have to read on.  GA is below: -",
        "1... d5 2. Nf3 Nc6": "2. …… Nc6 - after a double QP opening both sides develop a knight.",
        "3. c4 e6": "3. ….. e6 - transposes into Queens' Gambit Declined.  I usually accept the gambit but today for some strange reason I decide to decline it.  Ah well, we will see what happens.",
        "4. Nc3 Nf6 5. cxd5 exd5": "5. …… exd5 - pawn trade.",
        "6. a3 Be7 7. e3 Bf5 8. h3": "8. h3 - preparing a possible g4.",
        "8... h6": "8. …… h6 - prepares a hidey-hole for Fou Leblanc.",
        "9. Nh4 Bh7 10. Bd3 Bxd3 11. Qxd3": "11. Qxd3 - bishop trade.",
        "11... Qd7 12. Nf5 Rg8 13. O-O O-O-O": "13. …… 0-0-0 Both sides castle on the opposite side.  This sometimes leads to direct attacks on castled monarchs by pawn storms or other things.  Does this happen here?  We shall see.",
        "14. Nxe7+ Nxe7": "14. ……. Nxe7 - due to my position looking like nothing special and my middlegame tendency for passivitis you may think it would be Henry under fire, wouldn't you?",
        "15. b4 g5 16. b5 h5": "16...…. h5 - the race is on!",
        "17. Ra2 h4 18. f3 Nh5": "18. ….. Nh5 - things are just starting to hot up.",
        "19. Ne2 f5": "19. …… f5 - that seemingly passive knight on e7 supports f5.  I now intend to open up the pawn position surrounding King Richard.",
        "20. Kh2 g4 21. f4 gxh3 22. Kxh3": "22. Kxh3 - pawn trade.  Well, I have opened up King Richard, but how can I exploit it.  There is one answer ……..",
        "22... Qe6": "22. …… Qe6 - Glenda!",
        "23. Rf3 Qg6": "23. …… Qg6 now threatening # on g2.",
        "24. Ng1": "24. Ng1 - opens up a defensive line from the rook on a2 through to g2.  I am not discouraged and I offer up a poisoned pawn.",
        "24... Qh6 25. Qd1": "25. Qd1 - white wisely declines this offering due to a deadly discovered check on the h column.",
        "25... Rg4": "25. ….. Rg4 - prepare to double!",
        "26. Kh2 Rg3 27. Nh3 Rdg8": "27. …… Rdg8 - and put white in trouble!",
        "28. Ng5 Rg7 29. Qf1 Nf6": "29. ….. Nf6 - clears a piece off the h column and prepares to move to e4.",
        "30. Kh1 Ne4 31. Nh3 Rxf3 32. Qxf3": "32. Qxf3 - rook trade, but now another rook lands on g3.",
        "32... Rg3 33. Qf1": "33. Qf1?? - loses large material by a stunning sacrifice!",
        "33... Rxh3+": "33. ….. Rxh3+ - like this!  Wait for it!",
        "34. Kg1 Rh1+": "34. ….. Rh1+!! Wait for it!",
        "35. Kxh1 Ng3+": "35. …. Rg3+ - NOW!!  A deflection followed by a knight fork wins the WQ.",
        "36. Kg1 Nxf1 37. Kxf1": "37. Kxf1 - for now white plays on.  Sooner or later, however, Glenda will demonstrate why a queen is much stronger than a rook.",
        "37... Qh5 38. Re2 Ng8 39. Bd2 Nf6 40. Be1 Ne4": "40. …..Ne4 - bringing up the cavalry - a threatened knight fork on g3 ensues.",
        "41. a4 Ng3+ 42. Bxg3 hxg3": "42. ….. hxg3 - forcing off the pieces and it is now a pure Q V R endgame.",
        "43. Ke1 Qh1+ 44. Kd2 Qa1": "44. …… Qa1 - Glenda shows her strength by going after the a pawn which cannot be defended.",
        "45. Kd3 Qxa4 46. Rc2 Qxb5+": "46. ….. Qxb5+ - another white pawn falls!",
        "47. Kd2 a5 48. Rc5": "48. Rc5 - overlooked that - white will win a pawn back.  However, Glenda has eyes on f1 and g2!",
        "48... Qf1 49. Rxa5 Qxg2+": "49. ….. Qxg2+ and now Glenda zaps off the g pawn and clears a line to Glendadom for my own g pawn.  Time to set the conditionals.",
        "50. Kd3 Qf1+ 51. Kd2 g2": "51. …..g2 - the white rook can give a few spite checks but will then only be able to sacrifice itself for my g pawn.  This will then leave King Richard and his remaining sentries at the mercy or otherwise of Henry and Glenda.  The alternative is to have the white rook up against Glenda and Glenda 2 - not a pleasant prospect!  King Richard sees that any further attempt at continuing the battle will be futile and lets his sword fall to the ground - just like the white king in Harry Potter's Philosopher's stone movie.  I hope you all have had a good read and there will be one more annotation to follow based on tactics very soon.  Kind regards - Joanne"
    },
    "url": "https://gameknot.com/annotation.pl/deflection?gm=65334",
    "gameName": "DEFLECTION!",
    "players": "richardadams (1596) vs. jstevens1 (1809)",
    "opening": "Queen's pawn game, Chigorin variation (D02)"
}