{
    "moves": {
        "1. e4": "The main reason I believe that this is a good trap to commit to memory is because many of the moves I made may not have been the best moves but to me were perfectly logical to me at the time and I believe relaively sound (save a select few) and there is a very good chance that players of all ratings below 1800 might make similar moves.\n\nAgain, just my inexperianced thoughts.  this was my first move.. I think it's pretty popular. ;)",
        "1... e5": "Keep in mind that this is a trap you can set if you play black and the great thing about it is that it involves pretty normal looking moves to set up.  Like this one.",
        "2. Nf3": "Nothing unusual here.",
        "2... Nc6": "Or here.",
        "3. Bc4": "For now, I usually stay with the Epine Dorsale for my 3rd move.  The main thing to remember is that so far no unusual moves have been made.",
        "3... Nf6": "again not unusual, but this is the key piece to this trap and it happens so early in the game that it's likely to be forgotten about, which is what almost happened to me.",
        "4. Nc3": "I'm not any sort of expert on chess openings, but this seemed to me to be a good time to bring out my other Knight creating something that looked like a 4 Knights Defence\n\nI know now, after doing some research for this annotation that my opponent was playing the Two Knights Defence and I actually replied with a transposition into the Italian For Knights. (yay for me!) ;)\n\nThe main point here is that so far, we haven't deviated that far from things you could possibly see in actual play.  Even though I found out that this move is actually an inferior move to many other choices.",
        "4... b6": "It's suggested that Ktxe4 is a better move because it leads to:\n\nKtxKt .. Pd5 (which forks White's Bishop and Knight).  This tends to go the path of:\n\nBd3 .. PxKt\nBxP .. Bd6\n0-0 .. 0-0\n\nWhich ends up with equality, but with good play black probably has the advantage.  However, considering that the standard series of moves leads to equality the following series of moves could work out to be even better.\n\nThis is the one move that I don't quite understand... one explination is probably that Black was not thinking of the \"trap\" at this point.  He is most likely getting ready to fiancetto his Light Bishop.",
        "5. d4": "This also is not that uncommon of a move.  It makes sense for White because it will help him get control of the center.",
        "5... exd4": "Black appears to have  taken the bait and white is confident that he will gain control of the center.\n\nThe expected exchanges take place.",
        "6. Nxd4 Nxd4 7. Qxd4 Bc5": "A solid and inconspicuous move by black.  It's real purpose is to herd White's Queen into position.",
        "8. Qe5+": "White makes a reasonable move and takes the oppurtunity to check Black's King, perhaps hoping to make him move his King and lose tempo.",
        "8... Qe7": "black chooses instead to block the attack with his Queen.",
        "9. Bf4": "Also not a totally crazy move and something you might encounter white doing in this situation.  At the moment White has Black's Queen pinned and now has his own Queen protected.  Black can't castle without losing his Queen so it's reasonable for White to assume that he might be able to get an advantage in the future.",
        "9... Bxf2+": "This is the only move in the whole series that would possibly tip White off that something was strange.  \n\nI did think this was weird and so took a moment to think about the situation and saw Black's dubious plan",
        "10. Kxf2": "Thankfully I did not take the bait (although in the actual game I ended up losing anyway)\n\nHad I taken the bishop sacrifice...",
        "10... Ng4+": "ouch!  My King and Queen are forked\n\nWhat follows is some random moves that could have happened.  Basically White is severly crippled after falling for this trap.\n\nI would be interested in any thoughts some more experienced players have on this trap including, but no limited to variations on how to get there, and perhaps maybe some ways that White could get out of this trap at move 10.\n\nGood luck and have fun!\n",
        "11. Kf3 Nxe5+ 12. Bxe5 Qxe5": ""
    },
    "url": "https://gameknot.com/annotation.pl/deixron-trap?gm=3488",
    "gameName": "Deixron Trap",
    "players": "fycorsia (1276) vs. deixron (1635)",
    "opening": "Two knights defence (C55)"
}