{
    "moves": {
        "1. e4": "I started with natural intentions to create a 4-move checkmate.",
        "1... e5": "He opened commonly with a mirrored move.",
        "2. Bc4": "I continued my mating intentions.",
        "2... Nc6": "He hadn't quite seen through me yet.",
        "3. Qh5": "I gambled to go for the obvious one.",
        "3... g6": "Caught.",
        "4. Qf3": "I dropped back, still in position, hoping he wouldn't notice I was still a threat.",
        "4... Qf6": "A common defense at this point in the 4-move checkmate.",
        "5. d3": "I opened up to sacrifice a bishop for a mate. ",
        "5... Nd4": "He planned a move that I saw coming.",
        "6. Bg5": "I sacrificed...",
        "6... Qxf3": "Denied. Now I have to return the favor.",
        "7. gxf3": "I took the trade.",
        "7... Nxc2+": "And now I couldn't defend it. Unstoppable at this point.",
        "8. Kd2": "I Tried to capture the knight for revenge after he killed my rook.",
        "8... Nxa1": "He is now stuck in place.",
        "9. Nh3": "I moved out my knight, to catch the bishop's attention. That way, I could silently assassinate the enemy knight later.",
        "9... d5": "My plan was working so far.",
        "10. Bxd5": "I allowed for time.",
        "10... c6": "He ignored, still, my attention grabbing plan.",
        "11. Bc4": "I escaped and drew attention AWAY from where I was trying.",
        "11... Bxh3": "Finally.",
        "12. Rg1": "I was catching the other bishop now.",
        "12... Bc5": "Drawing to one side of the board helps when planning attacks on the other. This way, I can make the attack, and have the other side be congested enough to not be able to stop me. Results may vary.",
        "13. Nc3": "I opened for attack.",
        "13... Bxf2": "I drew attention.",
        "14. Rxa1": "I killed. Veni Vidi Vici... Kind of.",
        "14... Bc5": "He drew out and I was making my way out of the hole.",
        "15. Na4": "I threatened his piece.",
        "15... Bb4+": "He moved away and setup a check.",
        "16. Nc3": "A once attacking piece is now a crucial defense.",
        "16... h6": "He threatened me on a Counter-attack",
        "17. Be3": "I drew back.",
        "17... f5": "He sent a protected pawn to kill my e pawn",
        "18. Bxg8": "I made a trade for his unmoved knight.",
        "18... Rxg8": "Traded.",
        "19. exf5": "I attacked him to hold him on his own end.",
        "19... gxf5": "He hit back.",
        "20. Bxh6": "I took a pawn only going -5 now.",
        "20... O-O-O": "He castled on the far side, however, It would have been best to not do that, now he is generally in a corner.",
        "21. a3": "I forced him to take action.",
        "21... Bxc3+": "He traded off.",
        "22. bxc3": "Another fair trade to simplify the game.",
        "22... f4": "A rather pointless move, other than opening his white bishop to the left side.",
        "23. d4": "I moved out to stay on the attacking side.",
        "23... Rg6": "He threatened my bishop.",
        "24. Bxf4": "I was trapped between his rooks. My best move there, would have been to take a piece and at least compensate for my loss.",
        "24... exf4": "He obviously took me.",
        "25. Re1": "I planned an attack, although I was way down. A rook and 2 pawns.",
        "25... Rg2+": "He +'d me.",
        "26. Kd3": "I avoided and continued my plan. This way, I can hide my intentions. Also, In the Endgame, it is best to keep the king away from corners, this blocks movement. Hiding within your own pieces can sometimes even bring you to an end. Especially when your down.",
        "26... Rdg8": "He moved out- rather oddly.",
        "27. Ke4": "I moved forward, still hidden in what my future moves would be. To my opponent, I mean.",
        "27... Rg8g3": "He moved down? It was considered a mistake, or even a blunder. Crucial Mistake.",
        "28. Ke5": "I moved up continuously. Intentions clear now.",
        "28... Rg3g5+": "He put me in check, however moving above me could constrict my movement towards the king.",
        "29. Kd6": "I created a wall between the king and the outside world.",
        "29... Rg5g6+": "He continued to try to check me. No use now.",
        "30. Re6": "I blocked and he should have sacrificed. It would have won him the game.",
        "30... Rg6g5": "No dice. He escaped my 'attack' and lost the game. There is another big mistake.",
        "31. Re8#": "Mate. Proving king's aren't as helpless as they look. However, they look pretty cool. Hope you enjoyed. Thanks, see you next time. Thanks wireless, Good Game."
    },
    "url": "https://gameknot.com/annotation.pl/destruction-streak-3?gm=35330",
    "gameName": "Destruction Streak #3",
    "players": "Destroyer333 (1200) vs. wireless23 (1117)",
    "opening": "Bishop's opening (C23)"
}