{
    "moves": {
        "1. e4": "I had never played Allen before -- a very spirited player (who's big on the spirits, too)",
        "1... e5 2. Nc3": "Asking for the Vienna gambit (2. ... Nf6 3. f4!)",
        "2... c6": "??  This is odd; I expected black to develop a piece.  This move takes the c6 square away from the knight on b8.",
        "3. Bc4": "I don't know what awaits me, so I go for simple development, and guard against black seizing the center with d5.",
        "3... d6": "So instead of d5, black opts for d6.  This opens up the c8-h3 diagonal for the light-squared bishop, but blocks in the dark-squared one!",
        "4. f4": "Trying to open lines, as I've got the advantage.  Black is inclined to take, since otherwise f5 really puts a bind on black's development.",
        "4... exf4 5. Nf3": "Now, I've got a third piece developed -- although this was necessary to dissuade Qh4 , which can be devastating in the related King's Gambit accepted.",
        "5... f6": "?  Alright, at this point, I realize that black is way underdeveloped, and I've got an ideal king's gambit/vienna gambit type setup.  All I have to do is get the rest of my pieces out and focus on attacking the black king.",
        "6. d4": "d3 would have sufficed, but why not grab the extra square?",
        "6... Ne7": "Finally developing his first piece on move 6; this is definitely coming a lot later than it ought.  The knight doesn't have many options, in any case, as white dominates the center.",
        "7. Bxf4": "And now there's a 4-1 edge in piece development for white.  I don't see a breakthrough yet, but there are many useful moves for me in waiting (0-0, for instance), while black has very little in the way of options.",
        "7... b5": "?  Alright, this is just silly now.  There's no reason not to try to develop pieces at this stage.  I took a look at Nxb5 here, since I have such a developmental edge, but white lacks a good follow-up to 8. Nxb5 cxb5 9. Bxb5# Bd7, so I reserve the decision here...",
        "8. Bb3": "Bd3 should also be worth considering, but I didn't want to lessen my presence on black's kingside.",
        "8... g5": "??  Now this is unbelievable.  If I clear the knight out of f3, the queen can deliver a devastating check on h5.  I couldn't calculate all of the complications, but simply thought whether it would be better to have a knight or bishop for the attack, and to sac the other on g5.",
        "9. Bxg5": "Taking with the bishop first, although in hindsight taking with the knight would have been very strong also.",
        "9... fxg5 10. Nxg5": "At this point, it's clear that white is going to go in for the kill, and while black may be able to defend, he certainly has his work cut out for him!",
        "10... h6": "?  If moving pawns has gotten black this far, why change strategies now, I suppose?",
        "11. Qh5+": "Bringing the queen into the attack.",
        "11... Kd7": "Forced.",
        "12. Nf7": "Forking queen and rook, but black has an interesting attempt at defence.",
        "12... Qe8": "Because if white plays Nxh8, he loses his queen.  Check with the queen doesn't help either, because of the bishop on c8.  But don't be fooled, white still has a huge advantage, and black can't dislodge the white pieces easily at all...",
        "13. O-O": "Solidifying the f7 knight.",
        "13... Rh7": "\"development\"?",
        "14. Rae1": "Bringing the second rook into action.  Notice how easy it was for white to bring his pieces into action; notice that five of black's seven pieces are still at home.  If the king steps away from the queen, additionally, a move of the Nf7 discovers an attack on the black queen.",
        "14... Kc7": "...daring me to exploit the last note?",
        "15. d5": "Trying to open the e-file.",
        "15... c5": "Much better than taking, although this left me with an interesting decision.  If black plays c4 next, I go down by a second piece.  While I've certainly got a winning position, I must either mate the king or turn this into a big material gain.  If black can survive this onslaught, he will win with his material advantage.",
        "16. e5": "!  A brave decision, although it's really the only consistent way to play.",
        "16... dxe5": "Better than allowing exd6 ",
        "17. d6+": "!  A very good in-between move!  White could've played Rxe5 now, but this move is stronger, plus it could win back the sacrificed piece immediately if white desires.",
        "17... Kd7": "Other king moves are bad as well, but the king really hinders development here!",
        "18. Rxe5": "White is in no hurry to take the knight on e7.",
        "18... c4": "\"Winning\" the bishop, but at what cost?",
        "19. dxe7": "By removing black's only good piece, while all of white's are positioned for the attack, white sets himself up for victory.",
        "19... Bxe7": "With the bishop pinned to the queen, it's now time to play for big stakes.",
        "20. Rd1+": "Driving the king onto the c-file.",
        "20... Kc7": "alternatively, Kc6 is met by Qg6 .",
        "21. Nd5+": "Offering the choice between Kc6 (still met by Qg6 ) or Kb7.",
        "21... Kb7": "The better choice, but now black loses his queen!",
        "22. Nd6+ Bxd6 23. Rxe8": "At this point, white has a huge material and positional advantage.  Allen, however, hates to resign, and so plays on until mate.",
        "23... Bd7": "To be fair, I do have to be careful, since black still has a lot of firepower on the board if he can coordinate it, and my Bb3 is totally lost.",
        "24. Nf6": "This at least eliminates the pesky revived white bishop.",
        "24... Bxe8 25. Qxe8": "And still threatens the black rook, preventing further development.",
        "25... Bc5+": "I expected Nc6, threatening the white queen and at least showing some fight.  This, however, is easily parried.",
        "26. Kh1 Re7": "?  Overlooking white's 27th, I think.",
        "27. Qxb5+": "Winning the black bishop with check.",
        "27... Kc8 28. Qxc5+": "And threatening the black rook.",
        "28... Rc7 29. Qf8+": "Forcing the king back to b7.",
        "29... Kb7 30. Qb4+": "And now the bishop is no longer lost.  Black is hopeless here, and it's only a matter of time.  At this point, I asked Allen if he wanted to throw in the towel.  Allen said to me \"Well not zactly, Ill run round a little bit. Make ya hit a movin target.\"",
        "30... Kc8 31. Bxc4": "Many things look devastating for white; black will be mated soon.",
        "31... Nd7": "Hastening his demise.  At this point, I saw mate in three.",
        "32. Ba6+ Kd8": "Rb7 would've lasted one move longer.",
        "33. Qf8#": "1-0.  And this is checkmate, as the black knight is immobile due to the rook on d1.  \n\nA good game, but a better example of why you should develop your pieces -- at the very least, your opponent will get a big attack if he's courageous to simply break into the pawn structure.  Hope you enjoyed it!\n\nEthan"
    },
    "url": "https://gameknot.com/annotation.pl/develop-your-pieces?gm=6969",
    "gameName": "Develop your pieces!",
    "players": "ethansiegel (1728) vs. utvols1 (1290)",
    "opening": "Vienna game (C25)"
}