{
    "moves": {
        "1. Nf3": "This game is, thus far, my favorite bloody bout playing the Dutch Defense.  I was very pleased with the king-side storm I manufactured, and the tactical mêlée that ensued.  Settle in for a tour of Devil's Den.",
        "1... d6": "1. ...d6 is a flexible move against 1. Nf3, and is one of my favorites.",
        "2. g3": "Now with 2. d4, which I believe is best after 1. Nf3 d6, I planned on experimenting with 2. ...Bg4!?, The Wade Defense, named after British IM Robert Wade, or 2. ...f5, which will transpose eventually to more standard Leningrad Dutch or Antoshin Dutch lines.",
        "2... e5 3. d3 f5": "I am always happy to get to play these three pawn moves off the bat against KIA/English setups and claim a healthy and solid share of the center.  I call the d6/e5/f5 formation the \"Dutch Wing\" because it resembles a bird's wingspan, and this is the common ideal pawn structure in the classical Dutch.",
        "4. Bg2 Nf6 5. O-O": "White has elected to play the Barcza System, named after Hungarian GM Gideon Barcza.  Basically a King's Indian Defense reversed with a tempo up.  A flexible hypermodern approach, however I'm always comfortable when white gives me a free hand in the center.",
        "5... Be7 6. c4": "6. Nbd2 is a useful \"waiting\" alternative, that doesn't rule out an e4 break in the future.  6. c4 now transposes into a common English Opening formation.",
        "6... O-O 7. Nc3 Nc6": "The knight is well placed on c6 in most lines of the Dutch, often contesting or supporting the d4 and e5 squares, and well placed for re-development ala a Steinitz-ean ...Nc6-d8-f7.",
        "8. a3 Qe8": "Another thematic Dutch move.  The f-pawn's early push opens up a road for black queen Qd8-e8-h4, where it is well placed for king-side operations in the middlegame, as black's development scheme and pawn structure, \"the Dutch Wing,\" positionally points in that direction.",
        "9. b4": "White gets his surplus of queenside space, however I'm not planning on spending much time over there.",
        "9... Qh5": "The position that has arisen is similar to many other Classical Dutch games, with the notable difference that the black e-pawn is on e6 in this position.  Black usually expends two tempi to reach e5, whereas in this opening, I've gotten it for \"free\" in one.",
        "10. Qb3 Nd8": "!? This move anticipates b4, and also \"undevelops\" the knight to actually a very useful square on the back-rank, where it eyes the light-squares at f7 and e6 (and may re-route to them) that the white queen is contesting on the g8=a2 diagonal, and frees up the c-pawn to potentially move.",
        "11. Nb5 Ne6": "Forced to cover the c7 square, however this was a square I wanted the QN to go to in any case, closer to the king-side where I'll be conducting most of my Kingside yang to white's Queenside yin.",
        "12. c5": "White gets his c5 push in, seemingly with tempo, however I wasn't really concerned, since his pressure wasn't enough to force a major positional capitulation from me.",
        "12... Kh8": "Unpinning the knight and taking the King off the g8-a2 artillery range.  A useful and often necessary prophylactic move in such positions. ",
        "13. cxd6 cxd6": "White forces a backward d-pawn from me, however it's well-covered by my DSB and white doesn't have an obvious way to continue loading pressure onto it.  I can potentially push it do ...d5 in the future as well, to support a massive center.",
        "14. e3": "Covers the f4 square, however:",
        "14... g5": "! Another thematic move in the classical Dutch, gaining more king-side space for an attack, and preparing the ...f4 break anyway.  It helps that I've moved my king on h8, and was able to redevelop my QN via Nc6-d8-e6 to support playing just this move!",
        "15. Bb2": "White's QB has a more fruitful existence here on the long diagonal, especially since my King is also on it.  At the moment, e5 is a strong-point blunting it, but that can change in the future.",
        "15... f4": "As advertised, aiming at breaking up the solid Indian Castle white has built.  Some may ask why I haven't bothered with ...a6 over the last couple of moves, and the reason is that I felt that white's knight was a tad misplaced on b5 with little to do, and actually would be more useful if it was withdrawn to c3, where it could eye the central light squares, and maybe jump to d5 in the future.",
        "16. exf4": "The only way white can capture.  Opening up the highway to his king with 16. gxf4 is very bad, since my KR is ready to shift over a square to g8.  He must maintain the structural integrity of his kingside pawns.",
        "16... gxf4 17. Rac1": "Contesting the open file that white wrenched open back on move twelve.  The threat is removing the guard on e6 with Rxc8.  It also gives the b5 knight a mission, at long last.",
        "17... Bd7 18. Nc7": "Since the knight hits both e6 and my a8, I'm obliged to capture.",
        "18... Nxc7 19. Rxc7 fxg3 20. fxg3 Rad8": "In this position, I was initially going to play 20. ...Bd8, with the idea of re-routing both bishops to c6 and b6 respectively, with and a lot of dangerous pressure on the King-side brewing after a subsequent ...Ng4.  However, I saw that white could, and should, simply play the positionally solid exchange sacrifice with 21. Rxd7 Nxd7 22. Qe6, with just as much piece play as Nosferatu, especially with the two cardinals on an open board.  So I decided this was a necessary defensive move before I belted out any more shenanigans.",
        "21. Nh4": "On 21. Rxb7 I planned on: 21. ...Ng4 22. h4 Ne3, and then snapping off white's light-squared holy defender, so my LSB could move to c6 with searing pressure.  Of course, white should counterstrike in the center with 23. d4, but I figured I'd burn that bridge when I came to it.",
        "21... Ng4": "Freeing up the range of my DSB, the f-file, eying white's dark-squared color complex, and basically sharpening the position threefold.  The position is very byzantine.  When I ran it through my alkaline-blooded rat Junior 10 afterward, its evaluations changed a great deal the more it burrowed into the tread of things.",
        "22. Rxf8+ Rxf8 23. Rxd7": "?? But this is not a simple win of a piece, but rather the blunder I've been waiting for so the rest of my army springs into action.",
        "23... Bxh4": "! The bishop cannot be taken, as after 24. gxh4 Qxh4 black's threats are too numerous.  25. Rf7 Qe1ch (and not 25. ...Qxh2ch?? letting white slip away with 26. Kf1 Ne3ch 27. Kf2 and black's attack fizzles; there's no crushing followup) 26. Bf1 Qe3ch 27. Kh1 (or 27. Kg2 Rg8) Nf2ch and black wins.",
        "24. Be4": "!? A good try in a grim position, taking advantage of his rook on my 2nd rank to target my vulnerable h7 point.",
        "24... Nf6": "I make a human oversight and don't find the most crushing followup, which is the zwischenzug 24. ...Be7!! 25. h4 Ne3! when the threat of ...Rf1ch & ...Qe2ch is just too devastating to convincingly meet.  After 24. ...Nf6 black still has a decisive edge, but there's still wiggle-room for a battered opponent to fight.",
        "25. Rxd6": "25. Rxb7 probably didn't occur to my opponent (it didn't to me), as white's counter-chances rest in undermining the central blockade of my pawns to unleash his own DSB.",
        "25... Bg5": "Re-routing the bishop, with the nav point delineated at e3.  Note that white's queen and DSB are poorly placed to aid in repelling invasive piece maneuvers into his king-side by black's army.  I can play ...Be3ch with tempo, so white cannot snatch my e-pawn (Bxe5) scot-free.",
        "26. h4": "White only has bad moves and worse moves in this position.  This hastens the end.",
        "26... Be3+ 27. Kh2 Nxe4": "Removing white's last kingside defender before swooping in for the kill.",
        "28. dxe4": "White staves off mate (and its equivalents) with the computer-like 28. Bxe5ch Qxe5 29. dxe4 Qxd6 30. Qxe3, \"only\" a rook for two pawns down.  Now a series of \"box\", or forced, moves commence as I prod the king from pillar to post.",
        "28... Qe2+ 29. Kh3 Qf1+ 30. Kg4 Rf4+": "!! Probably the prettiest move of the game, and the Coup de grâce.",
        "31. gxf4 Qxf4+ 32. Kh3": "32. Kh5 Qf3 mate.",
        "32... Qf3+ 33. Kh2 Bf4+": "And with my deflective pseudo-sacrifice, I'm able to win the queen.",
        "34. Kg1 Qxb3 35. Bxe5+ Bxe5": "White resigns.  One of the most satisfying attacks I've conducted in a chess game, and so far my favorite Dutch concoction. Don't forget to rate the annotation, good mortal gameknoters, and freely comment."
    },
    "url": "https://gameknot.com/annotation.pl/devils-den-with-the-dutch?gm=36558",
    "gameName": "Devil's Den with the Dutch",
    "players": "keithjoshua777 (1776) vs. -nosferatu- (1819)",
    "opening": "Reti opening (A04)"
}