{
    "moves": {
        "1. d4 Nf6": "Undeterred by recent experiences, I persevered with an Indian defence, though which flavour I hadn't yet decided.",
        "2. c4 g6": "First decision point: I decided to stay on familiar ground, even though I'm now convinced that the Nimzo-Indian is a much sounder defence.  As yet, I'm not sufficiently familiar with the Queen's Indian and Bogo-Indian to risk ending up in one of those, so I stuck with the King's Indian.",
        "3. Nc3 Bg7": "The next decision point: I could have gone for the Grunfeld with 3...d5 but I only really know one line of that and it doesn't usually work out for me to well.",
        "4. Nf3": "An unusual move, indicating that White is probably avoiding the well-trodden lines after 4. e4.",
        "4... O-O": "Since White had not yet played e4, I decided that I could defer the decision on how to structure my pawns and castled immediately, expecting White to reply with 5. Bg5.",
        "5. Bg5": "I felt quite smug seeing this.  It's not often I can accurately predict my opponent's moves!",
        "5... h6": "I'm usually suspicious of playing ...h6 to push a bishop away, since the pawn can become a target after Be3 and Qd2; but in this position I felt that I should put the question to the B while my N was still unpinned, planning to defend the h-pawn with my King if necessary.",
        "6. Bh4": "The first surprise and quite a pleasant one: the h6 pawn is unlikely now to become a target.  On the other hand, the B is still aimed at my Q, so I need to be careful how and when I move my e-pawn and Nf6.",
        "6... d6": "The standard KID move, preparing either ...c5 or ...e5",
        "7. e3": "As predicted.",
        "7... Nbd7": "?! Played after some thought but probably wrong.  In the KID, Black is usually OK playing ...e5 without fully supporting it but not in this position with the B on h4.  Thus the motivation was to support ...e5 with this N.  I didn't want to develop it to the more aggressive-looking c6 because it could be immediately pushed away with d5.  Now, in many variations of the KID, Black tries hard to provoke White into that advance, solidifying the centre so that Black can work around the edges, but I couldn't see a suitable home for the N after 7...Nc6 8. e5.  Black's other possible N development is via a6, which again doesn't directly support ...e5 but does lay claim to b4 and c5, while leaving Black's lsb scope for development.  In this game, my lsb doesn't get to move till move 18, something that preyed on my mind throughout the intervening period.  I could have deferred decisions on the N's development by making a pawn move such as ...c6 or ...c5, ...b6 or ...a6 or ...a5.  7...g5 was considered briefly but I felt it was too risky: White could swap B or N for 2 pawns and then use the half-open files to launch a withering attack on my K.",
        "8. Qc2": "A sensible move, possibly preparing 0-0-0, possibly just Rd1.  With the Black N on d7, there is no risk of it coming soon to b4 to harrass the Q.",
        "8... c6": "With White's pawn still on d4, his N could still occupy d5.  I'd seen in my game against Paxton-Doggett how devastating that could be, so I decided to prevent it while I still had time to, especially if I managed to get ...e5 in.",
        "9. Be2": "White is playing simple, flexible developing moves.  I'd expected 9. 0-0-0 or 9. Bd3, targeting the weakened g6 pawn, but this looks perfectly sensible and prepares 0-0 as well.",
        "9... Qe8": "I decided to get the Q off the d8-h4 diagonal before launching the e-pawn.  The main drawback that I could see was that, after 0-0, White could oppose the Q with Re1, making it risky to advance the e-pawn and provoke multiple exchanges.",
        "10. O-O e5": "After all that preparation, I finally play the thematic advance.",
        "11. Rad1": "!  I found the long-term threats posed by the Rook very troubling.  White gained about ten minutes clock time on me around here.",
        "11... a6": "Played in anticipation of needing to advance the c-pawn and not wanting to allow Nb5, attacking the then-undefended d6 pawn.",
        "12. dxe5": "But White's response makes that concern irrelevant, as the d-pawn now becomes the e-pawn, leaving a raking open file for White's rook.",
        "12... dxe5 13. Nd2": "White prevents the pawn's further advance and possibly prepares an advance by his f-pawn.  I could also see that the N was probably aiming to go via e4 to d6, which looked like a nuisance but I felt I could live with it.",
        "13... Rb8": "A bit of a waiting move with ideas of possibly advancing the b-pawn and developing the lsb to b7",
        "14. Nce4": "Not the N I'd expected to move there but perfectly logical.",
        "14... Qe6": "I wanted to move the Nd7, so I needed to over-protect the Nf6.  I could also have solved that problem by swapping on e4, which might have freed me up a bit, but I didn't think it would help me prevent an eventual Nd6 by the replacement N.",
        "15. c5": "Played quickly.  Now I thought long and hard about how I was going to deal with the N that was sure to come to d6 now.  Eventually I decided that I could just live with it and play around it.  If White wanted to swap his good N for my bad B, so be it.  Otherwise, I just needed to avoid the white squares with my Rooks and keep my Q next to d6.  So then it was a question of seeing what else I could do and I noticed that the pawn move had given me the d5 square, so...",
        "15... Nd5": "! Now I could see relief from my cramped position.  I could advance the f-pawn, move my other N and finally move my lsb.  I could also budge his Q if I liked with ..Nb4.",
        "16. Nd6": "White returned about ten minutes on the clock with this move",
        "16... b5": "! Black chooses the moment when taking en passant is not feasible because it would leave the Nd6 undefended.  This now prevents White from pinning the Nd5 against Black's Q with Bc4.",
        "17. Nb3": "! Unexpected but strong, aiming for a5, whence it will threaten c6 and thence b8.  Once more White's R dominates the d-file.",
        "17... Nd7f6": "I felt it was too early to play ...f5, which is very loosening.",
        "18. a3": "A waiting move by White, with the added bonus that it prevents ...Nb4.",
        "18... Bd7": "finally...",
        "19. h3": "Another waiting move.  White explained after the game that he was suddenly worried by the possibility of Nf6 moves, followed by ...f5 and ...g5 and ...f4 trapping the Bh4.  I have to confess that I hadn't really considered this.  I was still trying to unravel my pieces and not yet thinking about the typical KID kingside pawn avalanche (see move 17).  With all this worrying, White had now used up nearly 20 minutes more than me on the clock and ours was the least advanced game in progress.",
        "19... Ne8": "Now I was considering trying to gain a pawn with 20...Nxd6 21. cxd6 Qxd6 but soon rejected that idea because of 22. e4!, pinning the N against my Q.  However, I could also see other advantages of this retreat, such as once more allowing ...f5 and, possibly, tempting White to swap on e8",
        "20. e4": "A surprise.  I thought White would encourage me to blunder before advancing this pawn!  It is good though.",
        "20... Ndf6": "Now my position is clogging up again.",
        "21. Nxe8 Nxe8 22. Bg4 f5": "The only move to save my Q, trapped as it was in the centre of the board.",
        "23. exf5 gxf5": "Now Black has hanging pawns and three pawn islands, a strategic weakness in a game of attrition, but the pawns are mobile and pushing White back for now.",
        "24. Bh5": "! Or so I thought.  White's Bishops may be on the rim but they dominate Black's centre and back row, preventing him from coordinating his rooks properly.  Over the next 22 moves, White regains his time on the clock and Black achieves precisely nothing!  The position of these Bishops reminds me of one of Anderssen's great games - The Immortal Game?",
        "24... Rb7": "A desultory attempt to improve this rook, hoping eventually to double somewhere, if I could do anything about White's pesky prelates.",
        "25. Na5": "The predicted response from White.  I was hoping that this N would become hors de combat over here.",
        "25... Rc7 26. Bd8": "! I hadn't expected this though.  Now my rook will have taken three moves to do what it could have accomplished in one.",
        "26... Rc8 27. Bb6 e4": "Fnally something more constructive from Black, though I had my doubts about releasing control of f4.  These were outweighed by the perception that White's dsb was now offside on b6 and that my Bg7 could finally have some freedom and influence on the game.  In a few more moves, this pawn might be able to fork White's Rooks!",
        "28. Bxe8": "I had long been expecting this as preparation for White to occupy d6 with his Rook.  In the cold light of day it does look odd, though, to give up this active B for Black's enfeebled N.",
        "28... Bxe8 29. Nb7 Rb8": "The rook returns where it was 6 moves ago.  The main purpose of this move was to make 30. Nd6 less dangerous.",
        "30. Nd8": "Another mysterious move to my back rank.  Clearly my Q has to move but I could see no ulterior motive, so...",
        "30... Qe5": "Now I was starting to feel that I might get some real counter-play",
        "31. b4": "The threatened pawn completes the chain.",
        "31... Qc3": "Now I swap off my newly active Q: seems illogical, but I couldn't see anything better at the time.  Afterwards, Dave suggested 31...Qb2, when Black can hope to hoover up the pawn chain but risks getting his B trapped.  I hadn't considered it at this point but did consider and reject that strategy soon after.",
        "32. Qxc3 Bxc3 33. Rd6 Rf6": "The only move to protect both c6 and h6 at once.",
        "34. Rfd1": "! Of course.  White's doubled rooks dominate the board while Black's are still completely uncoordinated.",
        "34... Rc8": "Black over-defends the c-pawn so that one of the other defenders can move or swap off.",
        "35. Nb7": "Another mysterious manoeuvre by White.  It was difficult to find a constructive plan for either side around here.",
        "35... Kg7": "Black defends h6, preparing to move the Rf6",
        "36. Bd8": "Black's King move was just in time!  The rook has to move now.  I didn't want to swap off, giving White a protected passed pawn on d6, so ...",
        "36... Rf7": "Now the N is forced back onto the rim.",
        "37. Na5 Bb2": "A gesture against the a-pawn but I didn't expect to be able to take it and get away with it because of Rb1, Rdd1 and Rb3",
        "38. Rb1 Be5": "Better to recentralise and harass the advanced rook.",
        "39. Rdd1 Rd7": "Now Black starts to push White back.  I got over-confident now.",
        "40. Bh4 Rd3": "?? The losing move.  I thought I could get a protected passed pawn, forgetting that the Bh4 still covered d8.  Consequently, this move just loses a pawn.  On such details are games won and lost.",
        "41. Rxd3 exd3 42. Rd1 Bf6 43. Bxf6+ Kxf6 44. Rxd3 Ke5": "Both our flags were hanging now and it was clear that I was either going to lose on time or over the board.  I recorded the next few moves but stopped recording at move 46, when it was all but over.  I resigned a few moves later, just before my flag fell.",
        "45. Nb7 Bg6 46. Nd6 Rg8": "The last recorded move on my scoresheet.  I didn't bother getting Dave's more up to date sheet.  Suffice to say that Dave retained control of the d-file, preventing my K from penetrating the queenside, mopped up one of the loose kingside pawns and prepared to march his own kingside pawns to promotion."
    },
    "url": "https://gameknot.com/annotation.pl/didcot-1-v-oxford-city-1-bd3?gm=29453",
    "gameName": "Didcot 1 v Oxford City 1 Bd3",
    "players": "David Scott (UNG) vs. Bob Jacobs (1776)",
    "opening": "King's Indian (E61), Smyslov system"
}