{
    "moves": {
        "1. e4 Nf6": "I don't often meet Alekhine's Defence.  The idea of the opening is for Black to encourage White to overreach himself and then to strike back, exploiting the holes in White's defences.  So in planning to meet it, White either has to guard against over-exuberance or make sure that his attack wins quickly - not an option against a decent player of the Black pieces.",
        "2. e5 Nd5 3. d4 d6 4. exd6 Qxd6": "? Exposing Black's Queen too early in the game.  This contradicts opening principles generally and in the Alekhine particularly.  4...exd6 or 4....cxd6 were much safer.",
        "5. Bc4 Qb4+": "? a second Queen move before Black has developed his other pieces.  However, White must be careful not to try to \"punish\" his opponent too soon or he will also fail to develop quickly.",
        "6. Nd2": "blocking the check, developing the N and defending the B all with one move",
        "6... c6": "probably the wrong pawn as this deprives the Nb8 of its natural square and fails to allow the Bf8 room to breathe.  On the other hand, if Black is making so many mistakes in the opening, why did it take 68 moves for me to finish him off?!",
        "7. c3 Qa5 8. Ngf3 g6": "so now the Bf8 is going to g7 where it will bite on granite.  Another strange choice by my higher-rated opponent.",
        "9. O-O Bg7 10. Re1 O-O 11. Bxd5": "?  An unusual choice by me.  I usually prefer to keep my Bs and swap off Ns.  It removes the defender of e7, but I don't think it is justified for tactical or strategic reasons - only material.",
        "11... cxd5 12. Rxe7 Nc6 13. Re1": "The pawn has cost me the two bishops, allowed Black to develop his N on an ideal square and cost me two tempi.  I don't think I should have grabbed this pawn at all!  On the other hand, black is saddled with an immobile isolated pawn, so it's not all bad.",
        "13... Bf5 14. Nb3 Qc7 15. Bg5": "developing my last minor piece to a good square, controlling d8, the natural square from which to defend d5.",
        "15... Rfe8 16. Qd2 b6": "to prevent my N coming to c5, I think.",
        "17. Nh4 Bd7 18. Bf4 Qb7 19. Nf3": "its work is done on h4.  Time to recentralise as soon as possible.  It also removes the risk of a fork from g5 if my Q is distracted by other duties.",
        "19... Rxe1+": "An interesting decision.  As the defender, Black decides to eliminate the rooks.  I'm happy to swap one pair but would like to keep the other on the board as long as I don't cede the e-file.",
        "20. Rxe1 Re8 21. Ne5 Bf5 22. Re2 Qa6 23. Nc1 Na5 24. b3 f6 25. Ned3 Rxe2": "mission accomplished but now Black has to guard against back-rank threats from my dominant Q",
        "26. Qxe2 h6 27. Bd6 Qc8": "Counter-attacking White's c-pawn while defending the back rank.",
        "28. Qe1 Qd7 29. Bg3 Nc6 30. Nf4 Bf8 31. Qd2 Kf7 32. Nce2 g5 33. Nd3 Qe7 34. f3 Qa3 35. Nf2": "My Q was overloaded.",
        "35... Bb1 36. Nc1 Qa6 37. Qb2 Bf5 38. Qd2 Bb1": "tacitly offering a draw",
        "39. Ng4": "but I'm determined to exploit my material advantage...",
        "39... Ba3 40. Nxh6+ Kg6 41. Ng4 Bxc1 42. Qxc1 Qxa2 43. b4 Qc2 44. Qe1 Qd3 45. Ne3 Ba2 46. h4 a5 47. bxa5 bxa5": "Now Black has a prime asset in his remote passed pawn but while so many pieces are still on the board, it is not yet a winning advantage.  White still has one more pawn and his pieces are well placed.",
        "48. hxg5 fxg5 49. Bd6 a4 50. Ng4 Qb1 51. Qxb1+ Bxb1 52. Kf2 Na5 53. Ne5+ Kf5 54. g4+ Ke6 55. Ba3": "blockading the passed pawn",
        "55... Nc4 56. Nxc4 dxc4 57. Ke3": "Bishops of opposite colours give Black good drawing chances, especially with the remote passed pawn but white's two sets of connected pawns give him hope for splitting Black's King's attention and forcing one pawn home.",
        "57... Bc2 58. f4 gxf4+ 59. Kxf4 Kd5 60. Ke3": "?! The bishop prevents White from playing 60. Kf5  but I think an advance on the black squares would have been OK, supporting the g-pawn.",
        "60... Ke6 61. Kf4 Kf6 62. d5": "As planned, Black's K can't stop both pawns, can he?",
        "62... Bg6 63. g5+ Kf7 64. Ke5 Ke8 65. Kf6 Bf7 66. d6 Bd5 67. g6 Kd7 68. Kg7": "! Avoiding the error of placing the pawn on g7, when White's K would not be able to get next to g8 to defend it when it queens.  Black resigned."
    },
    "url": "https://gameknot.com/annotation.pl/didcot-1-vs-oxford-city-2-oxford-amp-district-league-div-1?gm=20419",
    "gameName": "Didcot 1 vs Oxford City 2, Oxford & District League Div 1",
    "players": "Bob Jacobs (1586) vs. Karl Biswas (1640)",
    "opening": "Alekhine's defence (B03)"
}