{
    "moves": {
        "1. e4": "The first move is 1. e4. I take control of the centre (d5- and f5-squares) and at the same time open diagonals for the bishop at f1 and the queen at d1.",
        "1... c6": "Black plays an opening called Caro-Kann. The idea is to play a pawn to d5 next, when it is supported by the c6 pawn. This challenges the control of the center.",
        "2. d4": "I play the most common move: d4. This move takes control of more central squares (e5 and c5) and opens a diagonal for the bishop at c1.",
        "2... g6": "This move is a surprise to me. Black does not follow the usual plan, but intends to put his bishop on g7 (or h6). This is called a fianchetto. It is possible that Black transposes to another opening via this move order.",
        "3. c4": "Here I had several alternative moves. I could have developed a piece. My knights and bishops are ready to move. But because Black has not yet challenged the centre, I want to make it as difficult as possible for Black to play d5. Move c4 achieves this. In addition, the knight at b1 stands better behind the c-pawn than in front of it.",
        "3... f6": "In my opinion, this is a positional mistake. It weakens the king's protection and does not serve any good purpose. Perhaps Black tries to play a pawn to e5 and wants to protect the pawn. But, in general, protecting the e5-pawn with f6 is bad. The e8-h5 diagonal becomes weak. Now, because of the pawn on g6, it cannot be utilized, but later it can be a problem for Black.\n\nP.S. The computer agrees with me that this is a mistake. 3...d5 was actually possible here.",
        "4. Nc3": "I start developing the pieces. I want to find good squares for all my pieces, so that they play well together and don't step on each others toes. The knight is easy to put here, because it controls the central squares e4 and d5.",
        "4... d6": "So Black opens the diagonal for the light-squared bishop and possibly prepares e5.",
        "5. Nf3": "I continue development. Here the knight controls the d4- and e5-squares.",
        "5... Bg4": "Black decides to develop the bishop and simultaneously pin my knight against my queen. The pin inderectly weakens my control of the d4- and e5-squares, because my knight cannot take on those squares without losing the queen. I expect that Black wants to play e5, challenging the center and freeing squares for the pieces.",
        "6. Be2": "I develop my bishop and break the pin. Now it is also possible to castle kingside.",
        "6... Bxf3": "Black takes the knight. Although it decreases my central control, it is bad for two reasons: it loses the bishop pair and it loses tempos. This might require an explanation. With the bishop pair, I mean that having two bishops on the board is better than having a bishop and a knight or two knights. This is something that a beginner might not know. And by losing tempos, I mean that Black trades a piece that has moved twice for a piece that has moved only once.",
        "7. Bxf3": "I capture with the bishop. I briefly thought about capturing with the g-pawn, although it would shatter the pawn structure, because the e4-pawn would get a supporting pawn on f3. However, I decided to keep the pawn structure intact, which makes the king feel safer if it castled kingside. Look at the board now. I have two pieces developed, the king is one move away from castling, and I control the center. Black has no pieces developed, the king is far from castling, and the central control is modest.",
        "7... Qa5": "Black brings the queen out. This temporarily pins my remaining knight against the king. While this is not such as bad move, it does not help Black's development. Usually it is wise to move knights and bishops first.",
        "8. O-O": "I castle. The king is safer now and there is no pin anymore.",
        "8... Bh6": "Black develops the dark-squared bishop and offers to exchange it with my bishop.",
        "9. Qd3": "I do not want to take on h6, because it helps Black to develop the knight. Moving the bishop along the c1-h6 diagonal seems less effective, because Black can trade it off. I find another useful move. The queen moves away from the back rank, so the rooks are free to move wherever they are needed. I also plan to take the d-file in my control after the center opens up.",
        "9... Bxc1": "And Black trades off the bishop. I think that keeping the tension would have been better.",
        "10. Raxc1": "I capture with the a-rook. Now all my pieces have moved.",
        "10... Na6": "Developing the other knight and making it possible to castle queenside.\n\nI think, I must act now, before Black's king finds a safe place. So what are the possible plans? Breaking the center with e5 would open files. But what if Black plays 0-0-0? I do not like Black's rook on the d-file then. So the first thing I do is prevent the queenside castling.",
        "11. Bg4": "This move takes the c8-square in control. In addition, I might play Qh3 later which threatens Bd7+ after which Black cannot castle.",
        "11... Qg5": "Moving the queen again. It is difficult to see the purpose of this move.",
        "12. Qh3": "I play the move I mentioned in the previous note. The only way to prevent the check is play Nb8 which retreats the knight to its starting square. Black might also try to get to an endgame by playing something like 12...Nh6 13. Bd7+ Kd8 14. f4 Qh5 15. Qxh5 gxh5, but the position seems to favor White.",
        "12... h5": "Kicking the bishop, but we already know where to move it, right?\n\nP.S. Instead of this move, the computer suggest 12...f5!? I thought it would lose a pawn after 13. exf5 gxf5 14. Bxf5, but Black has the option to play 13...Nf6! and recapture the pawn after the bishop has retreated or traded off with the knight.",
        "13. Bd7+": "After this Black cannot castle anymore. I plan to open the position, so the king will be under fire soon.\n\nP.S. Here the computer suggest 13. Bc8 winning some pawns, e.g. 13...Rb8 14. Qd7+ Kf7 15. Bxb7 etc. However, the move I selected also wins.",
        "13... Kd8": "Black moves the king out of check and keeps a contact with my bishop forcing me to keep it protected.",
        "14. f4": "I play this move first, because it helps me break the center. The queen must go to h6 or a5. I think a5 is the better square. My plan is to break with d5 then which threatens to take on c6 and win material. Black has one defensive idea that I must take into account in most variations. That is playing f5, which disconnects the d7-bishop from the h3-queen. If that happens, I am thinking about sacrificing the bishop to get a dangerous passed pawn (exf5, Kxd7, and fxg6+ and g7).\n\nP.S. Again the computer suggest that I play 14. d5! first and only then 15. f4 and the queen must retreat to h6, which was a worse square.",
        "14... Qa5": "Black moves the queen to a safe square.",
        "15. d5": "I play the planned break move.",
        "15... Qc5+": "Black checks. Perhaps the idea is to win the c-pawn, but that is very dangerous, because it opens lines next to the king and allows me to bring more pieces to attack. For example, 16. Kh1 Qxc4? 17. dxc6 bxc6 18. Nd5! Qxe4 19. Bxc6 wins back the sacrificed material.\n\nP.S. Here the computer line goes: 15...Qb6+ 16. Rf2 f5 17. Na4 Qc7 18. dxc6 bxc6 19. Be6 etc. However, I would have tried to make the bishop sacrifice work. ",
        "16. Kh1": "I move the king into the corner.",
        "16... Qxc4": "Black is greedy and takes the pawn.\n\nP.S. The computer shows that this is a blunder. With 16...Qb6 Black could have survived longer.",
        "17. dxc6": "I play the line I mentioned earlier. I expect 17...bxc6 after which I play 18. Nd5! In addition, 18. Nb5! also wins.",
        "17... bxc6": "Black takes back the pawn.",
        "18. Nd5": "And here we go! The queen is threatened, so it must move. Trading the queen for a knight and a pawn just delays the inevitable outcome. Black cannot do anything to the threat of Bxc6.",
        "18... Qxa2": "Black continues to snatch pawns.",
        "19. Bxc6": "This move threatens the rook and checkmate at the same time. There is no way Black can deal with both threats.",
        "19... Qxb2": "Ok. Black simply ignores both threats.",
        "20. Qd7#": "I play the best move in the position. ;-)\n\nSo what did we learn? At least that developing pieces is important. In the final position, Black's rooks and the other knight have not even moved. Another lesson is that you should be aware of your opponents threats. Black simply kept capturing pawns when the king was in danger.\n\nI learned that I should calculate variations more carefully, even in simple positions, because I missed a few lines that would have allowed Black to defend. I also made a simple mistake with move order in moves 14 and 15. Sometimes the moves work better in another order that I though initially."
    },
    "url": "https://gameknot.com/annotation.pl/difference-of-600-rating-points?gm=53067",
    "gameName": "Difference of 600 rating points",
    "players": "samuels (1764) vs. bazzaaa (1142)",
    "opening": "Caro-Kann defence (B12)"
}