{
    "moves": {
        "1. e4": "54th GK Tournament. I'm playing white. I begin with the Open Game.",
        "1... e5 2. Nf3 f5 3. Nxe5": "2. ... f5 is The Latvian Counter-Gambit, aka the Greco Counter-Gambit. Black offers white the choice of two simultaneous gambit pawns. I choose the main line with 3. Nxe5 which threatens 4. Bc4 and 4 Qa5. I am not sure how viable this opening is for black. I suspect, in OTB club play it may take some players by surprise, getting them out of lines they are more familiar with - it certainly would have done so to me. But here, with the ChessKnot and World DB to guide any player through the rough spots, there is no surprise, only a speculative opening that seems to get black into dangerous waters very quickly in this game.",
        "3... Qf6 4. d4": "Main Line. Black brings out the queen to defend against both of white's threats and to attack the white knight. 4. d4 defends the knight and opens lines for white's DSB.",
        "4... d6 5. Nc4": "Still main line. Black opened a line for his LSB and attacked white's knight which now must retreat. c4 offers it a square from which it remains quite active, while f3 will just end up under attack after 5. ... fxe4.",
        "5... fxe4 6. Nc3": "Black regains his gambit pawn in accordance with the main line of the Latvian Counter-Gambit. White's programmed response is 6. Be2 to enable early castling. This alternate line deviates a bit from the main line by developing white's other knight with a direct threat against the black pawn on e4 and also a two-move threat of 7. Nd5, threatening the black queen, followed by 8. Nxc7+, forking the king and rook.",
        "6... Bf5 7. Ne3": "Black is unconcerned about c7 as it is easy enough to defend, so he develops his bishop and defends the pawn on e4. White delays the charge toward c7 to put pressure on black's bishop.",
        "7... Nh6 8. Ncd5": "I am truly not sure what 7. ... Nh6 does for black. If 8. Nxf5 Nxf5?, white wins a pawn with 9. Nxe4 - it may take a lot more analysis than I put into it to figure it white can hold onto that pawn. Likewise, 8. ... Ng4 is not really threatened because of 9. Nxg4 Bxg4 10. Qxg4. I would find this threat more credible if black had first played 8. h5. So white proceeds with the plan, forking the queen and the undefended pawn on c7. Black has only one good response, which finally sheds light on 7. ... Ng6 because black's bishop will need a defender after the queen retreats. Still, black is in defensive mode, planning ahead for defenses rather than making plans for attacks. This gives white a good deal of attacking confidence.",
        "8... Qd8 9. Nxf5 Nxf5 10. Qg4": "Black's queen retreated and white exchanged black's good bishop for one of his knights, and now white's queen forks black's knight on f5 and pawn on e4.",
        "10... Ne7 11. Bc4": "Black's knight retreats and white develops his bishop, creating veiled threats to f7 and g8 and defending the white knight in the process. White now has three pieces aggressively developed to black's one piece defensively developed, and white has the hanging black pawn on e4 free for the taking at any time. I am not familiar enough with the Latvian Counter-Gambit to know where black has gone wrong, but I don't think this was how the first 11 moves are supposed to go for black.",
        "11... Nbc6 12. Qxe4": "Black counterattacks the white pawn on d4, but the counterattack is easily enough refuted by simply capturing the pawn on e4, simultaneously pinning black's knight on e7. What this attack needs now is a DSB and a rook on e1 to really build up the pressure.",
        "12... Qd7 13. Bg5": "Keeping up pressure on the pinned knight on e7. Black no longer has Kd8 to unpin the knight.",
        "13... h6 14. Nxe7": "Black seeks to drive away the white bishop on g5. Instead, white plans on gaining the b7 pawn: 14. Nxe7 Nxe7 15. Qxb7 Rc8 16. Bd2 d5 17. Bb5 c6 18. Qxd7+ Kxd7 19. Bd3 Rb8 and white is up two pawns.",
        "14... hxg5": "Oops. Black miscalculates. He sent me an email explaining that he mistakenly expected to be able to recapture on c6 and overlooked the discovered check. 14. ... hxg5??? is a disastrous oversight that loses immediately to 15. Nxc6+. If 15. ... Be7, then 16. Qg6+ Kf8 (forced) 17. Qf7#. If 15. ... Qe6 then 16. Qxe6+ Be7 17. Qxe7#. All black has left is 15. ... Qe7 16. Nxe7 Bxe7 17. Qxb7 Rd8 18. Qb5+ Rd7 19. Be6 g6 20. Qxd7+ Kf8 21. Qxc7 and white is up by Q+R+3P and wins easily with this crushing material advantage."
    },
    "url": "https://gameknot.com/annotation.pl/disastrous-oversight?gm=24748",
    "gameName": "Disastrous Oversight",
    "players": "blake84120 (1983) vs. zardok (1734)",
    "opening": "Latvian (C40), Nimzovich variation"
}