{
    "moves": {
        "1. e4": "Hi everyone!\r\n\r\nAnother chastening defeat at the hands of the Master Mater.  Just when I thought I was learning to avoid destructive trades, what does The Beginner do?  She goes in for one doesn't she?  In mitigation, it was to rid myself of Freddy's rook that had just got into my area of the board and when a piece like that does that you wanna get shot of it at the earliest opportunity, wouldn't you?  Well, sometimes it is better to just hold your horses a bit.  The game starts off with 1. e5 c5 which is a Sicilian Defense.",
        "1... c5 2. c3": "2. c3 - I decided to prepare d4 by this means rather than the usual Nf3 for a change.",
        "2... b6 3. d4 Bb7 4. f3": "4. f3 - bolstering e4.",
        "4... d5 5. e5": "5. e5 - this move is chosen to reduce the scope of the lsb on b7.",
        "5... cxd4 6. cxd4": "6. cxd4 - pawn trade.  First sign of trouble though - my d pawn becomes backward and this will play a part in my demise later on.",
        "6... e6 7. Bb5+ Bc6 8. Bxc6+ Nxc6": "8. ...... Nxc6 - now the lsb's get traded off.",
        "9. Ne2": "9. Ne2 - develops a piece and backs up my d4 pawn which is en prise to the knight on c6.",
        "9... Nh6 10. Be3": "10. Be3 - developing and bolstering my d4 pawn.",
        "10... Nf5 11. Bf2": "11. Bf2 - maintains protection of the d4 pawn and also stops a possible check on h4 by the Wicked Witch of the West.",
        "11... Bb4+ 12. Nbc3": "12. Nbc3 - I block the check on c3 by developing my remaining knight - clear those decks I say!",
        "12... Qg5 13. O-O": "13. 0-0 - Hmm, gotta save my g2 pawn but is Henry dancing into the fire yet again?",
        "13... Rc8 14. Qc1": "14. Qc1 - I do not like the Witch sitting in front of Henry so Glenda puts the question to her.",
        "14... h6": "14. ....... h6 - hmm, he is allowing the trade!",
        "15. Qxg5 hxg5": "15. ....... hxg5 - which takes place.",
        "16. Rac1 f6 17. exf6 gxf6": "17. ...... gxf6 - pawn trade.",
        "18. a3 Be7": "18. ...... Be7 - Freddy decides to retreat his bishop after a3.  Hmm, maybe b4 was called for asap.  Instead I decided to add another defender to the d pawn.",
        "19. Rfd1 Kf7 20. h3": "20. h3 - at this stage I am more concerned about a doubling of black rooks on the h column.",
        "20... Na5": "20. ...... Na5 - b5 would have prevented that Na5 move, however.",
        "21. Na2 a6 22. Rxc8 Rxc8 23. Rc1 Rc4 24. Rxc4": "24. Rxc4?? - here it is, here it is.  Naievely I expected dxc4 here, but of course, silly me overlooked Nxc4 and I now drop a pawn, duh and double duh!  Would b4 have been a better alternative here?",
        "24... Nxc4 25. Nb4 Bxb4 26. axb4 Nxb2": "26. ....... Nxb2 - I got rid of Freddy's dsb but I still dropped a pawn, now Freddy is gonna make it decisive.",
        "27. Nc1 a5 28. bxa5 bxa5": "28. ...... bxa5 - nothing better than to have allowed the pawn trade.",
        "29. g4 Ne7 30. Kf1": "30. Kf1 - having allowed a remote queenside passer, Henry must go over to the queenside to help round it up, if I can.",
        "30... Ng6 31. Bg3 a4 32. Ke2 a3 33. Kd2 Nc4+": "33. ....... Nc4+ - Henry has moved closer to the a pawn but that rampant horsie is not finished with me by a long chalk!",
        "34. Kc3 e5 35. dxe5 fxe5": "35. ....... fxe5 - and now another forced pawn trade.",
        "36. Na2 Nf4 37. Bxf4 gxf4": "37. ....... gxf4 - and now I have to say goodbye to Fou Lenoir.  Although I do get a knight and an outside passer for it.  Trouble is that passer is only on the third rank and Freddy's king can eat it up should it advance too far.",
        "38. Kd3 Nb2+ 39. Ke2 d4 40. h4": "40. h4 - I do try and advance the pawn though but it is too little too late.",
        "40... d3+ 41. Kd2 e4 42. fxe4": "42. fxe4 - nothing better.",
        "42... f3 43. Ke1 Nd1 44. g5": "44. g5 - again a counter on the kingside but to no avail.",
        "44... f2+ 45. Kf1": "45. Kf1 - forced.",
        "45... d2 46. Ke2 f1=Q+ 47. Kxf1": "47. Kxf1 - again forced but now comes the killer Ne3+ and there is no way of stopping that d2 pawn from crowning so I wave the white flag.  Nul point no. 42 for me against the Master Mater, sigh and double sigh!",
        "47... Ne3+": ""
    },
    "url": "https://gameknot.com/annotation.pl/discernment-in-exchanging?gm=30655",
    "gameName": "Discernment in Exchanging",
    "players": "jstevens1 (1803) vs. easy19 (2282)",
    "opening": "Sicilian (B22), Alapin's variation (2.c3)"
}