{
    "moves": {
        "1. e4": "Just a simple opening, I'm playing Black in this game!\nPlz check the huge mistake the gameknot AnalysisEngine made at move 19\nIt's like a mistake a 1400 rating wouldn't even make.",
        "1... c5 2. Nf3 e6 3. d4 cxd4 4. Nxd4 Bc5 5. Nf3 Nc6 6. Nc3 Nge7 7. a3 O-O 8. Bd3 Ng6 9. Qe2 a6 10. b4 Nd4": "Attacking the queen, knighttrade seems the only option for white.",
        "11. Nxd4 Bxd4 12. Bb2 Qf6": "Putting pressure on the knight and b2bishop.",
        "13. Qd2 Nh4": "Trying to prevent kingsidecastle",
        "14. Kf1 Qg6": "Threatening Qxg2",
        "15. f3 Qf6": "Queen and knight were almost trapped, Qf6 was the only move i think",
        "16. Rb1": "Blunder from white, Knight will take f3",
        "16... Nxf3": "A sacrifice to win a rook.",
        "17. gxf3": "A correct move white limiting damage, Qe2 looks wrong",
        "17... Qxf3+": "Claiming the price.",
        "18. Ke1 Qxh1+ 19. Bf1": "Now black is definitely ahead (5.89 points), but what does the gameknot analysisengine  say?\n\nBe5 20. h3 Bg3+ 21. Ke2 f5 22. Qe3 Qh2+ 23. Kd3 Bf2 24. Qg5 a5 25. Bg2 axb4 26. axb4 Qd6+ 27. Nd5 fxe4+ 28. Bxe4 exd5 29. Qxg7#\n\nMate for white? How could that be???\nI know I played a blunder, by leaving my bishop unguarded playing Qf3, but the mate at Qxg7 seems weird.",
        "19... Qf3 20. Qxd4 f6 21. Ne2 b5 22. Bc1 Bb7 23. Ng3 d5 24. Rb3 Qg4 25. h3 Qh4 26. Qb6 Rab8 27. Qxe6+ Kh8 28. Qg4": "Trading off queens",
        "28... Qxg4 29. hxg4 dxe4 30. Be3 Rbc8 31. Kd1 Rfd8+ 32. Kc1 Bd5": "Cornering the rook, taking it out of play for a while",
        "33. Rb2 Rc3": "Preventing c2 to move",
        "34. Nf5 Rxa3": "Taking a pawn",
        "35. Bc5 g6 36. Nd6 Be6 37. Nxe4 Bxg4 38. Bd3": "A neccesary move to prevent mate of Rd1++",
        "38... f5": "Advancing the pawns to promote eventually",
        "39. Ng5 Rd5": "Taking the rook out of danger, because of Nf7+",
        "40. Rb1 h5": "Advancing more pawns",
        "41. Kb2": "White corners my rook to a4",
        "41... Ra4 42. Kb3 h4": "Advancing more pawns",
        "43. Bf1 Kg7": "Taking the king out of the corner, it looks more safe here at g7",
        "44. c4": "A mistake, I think BD1+ gives nice attackinglines",
        "44... Bd1+ 45. Kc3 Ra3+": "Getting my rook back in play",
        "46. Kb2": "With the rook hanging on d5, I decided to checkchase the king",
        "46... Rb3+ 47. Kc1": "I have to check until my rook is saved",
        "47... Rc3+ 48. Kb2": "Another check",
        "48... Rc2+ 49. Ka3 Rdd2": "Finally the rook is free, and now threatening mate at a2",
        "50. Bd4+": "A check, trying to get out of trouble",
        "50... Kg8": "This looks ok, according to kingsafety, Kf8 will result the knight to e6+ and adding a defender to whites exposed king.\nGameknot analysis gives Kh6, a safer square perhaps",
        "51. Bb2": "Preventing the mate Ra2++",
        "51... bxc4": "Threatening c3 as a next move",
        "52. Ka4": "A huge blunder, b5 should be played, to give white an escaperoute, all is over for white now.",
        "52... Rcxb2+": "I take the bishop, since it's free. The king is in check aswell. ",
        "53. Rxd1": "A blunder, resulting in mate in one. Ka5 looks best, but all is lost.",
        "53... Rba2#": "Checkmate, Hope you enjoyed it."
    },
    "url": "https://gameknot.com/annotation.pl/dl_leonines-mini-tournament-i?gm=41066",
    "gameName": "dl_leonine's mini-tournament I",
    "players": "rodasy (1700) vs. wausman (1671)",
    "opening": "Sicilian (B40), Anderssen variation"
}