{
    "moves": {
        "1. d4 d5 2. Bf4 e6 3. Nf3 c5": "Normal London setting. ",
        "4. e3 a6": "Black looks for attack right away on the queenside, and it is not a bad strategy. ",
        "5. Nbd2 Nc6 6. c3": "I cannot allow black to penetrate too easily. ",
        "6... b6": "Better was B5, for that matter. But now I have a breath I don't fail to take. ",
        "7. Ne5": "The exchange leaves black completely undeveloped, and he must defend the knight. ",
        "7... Bb7": "This slowens a lot black's attack on this side. But black's position is not all that weak, and if allowed to develop, will be as strong as mine. ",
        "8. Qg4": "So I decided to go to attack before the game switches again on the queenside. It was not a good idea Qh5 (threatening f7), black has many good ways to defend. But this move tempted him to...",
        "8... Nf6": ", of course, that is very good. Now let's prove that my queen out there is a threat or a loser. ",
        "9. Qh4 Be7": "Better was h6, probably. ",
        "10. Qg3": "Now I expected Nh5, and my plan gets a question mark.",
        "10... O-O": "If Bh6, Nh5. But fortunately for me, my opponent overlooked Nh5 right now, so I can complete my scheme. ",
        "11. Be2": "Now Bh6 is a threat. ",
        "11... g6": "Good. It weakens his pawns. But this means that g6 is very near to...",
        "12. h4": "h5 would be nasty, but black should have preferred it to...",
        "12... h5": "...because it gives me a ready-made position for a sac. Any other move and black goes NxN and I have to sac the lsb. Now, Bh6 could have been good. Re8, and I would have given a look at Nxf7.",
        "13. Nxg6 fxg6 14. Qxg6+ Kh8": "NOw... what? This should be a winning position for white. I just have to find the right way. And I need more pieces into the attack. ",
        "15. Rh3": "...like a rook. ",
        "15... Qe8": "I expected Rg8. It is interesting to see if black can defend in that line. ",
        "16. Qh6+": "No queen's exchange, my dear...",
        "16... Nh7 17. Bd3": "Bxh5 was enough to win, I think. ",
        "17... Qf7": "Sensible move by black. Bxh5 was better. ",
        "18. Rf3": "If Bg6, Qg7. But now I use the rook. ",
        "18... Qg7": "Another good try, but I don't go for e6.",
        "19. Qxh5": "This is much better, since the queen can't move (but to f7). ",
        "19... Qxg2": "It would have been nice to see if black could have resisted, but this is a sad blunder. ",
        "20. Qxh7#": ""
    },
    "url": "https://gameknot.com/annotation.pl/dont-wait-for-him?gm=49211",
    "gameName": "Don't wait for him",
    "players": "damalfi  vs. about1650 ",
    "opening": "Queen's pawn, Mason variation (D00)"
}