{
    "moves": {
        "1. e4": "I first saw this game on www.chessgames.com as it was game of the day sometime back and took a liking to it as I was studying the Guico Piano at the time.1.e4 The most common opening move and in my opinion the best as I have stated in most of the game that I have annotated.. However it's stats are falling because the surge of the sicilian monster!",
        "1... e5": "Siezes space in the centre like white has done.",
        "2. Nf3": "Attacks the e5 pawn, a pretty standard move.",
        "2... Nc6": "Defends it. Also standard!",
        "3. Bc4": "The Italian game. An old opening that is now thought to be rather dull and boring. Black now has two main options here 3....Bc5 the Giuoco Piano or 3... Nf6 The Two Knight's Defence. The Italian game can evolve into the romantic Evans Gambit if 3...Bc5 then 4. b4!?(This is a very nice gambit which I have a few annotated games of \"Naval Intelligence\" a very nice little game!.) ",
        "3... Bc5": "The Guicco Piano. This is less agressive than the Two Knight's defence. Tartakower now has the chance to play my fave as I have already mentioned, the Evan's Gambit 4.b4!?",
        "4. c3": "THis prepares d4, however has the setback of weakening the e4 pawn as the natural Nc3 to defend the e4 pawn is now impossible. The other main option is 4.b4?! the Evan's Gambit which you can see in the game titled 'Naval Intelligence'",
        "4... Bb6": "This is an old fashioned approach to this opening. This move is an early retreat from the inevitable d4 advance attacking the bishop. The better and more modern approach would be 4... Nf6 attacking the e4 pawn.",
        "5. d4": "The d4 advance seizing space in the centre aiming for the typical Italian centre.",
        "5... Qe7": "This seems a strange move because most people would play 5... d6 here however the chosen move is still adequate.",
        "6. O-O": "Getting his king in a safe place before embarking on attacking the enemy king.",
        "6... d6": "This secures the e5 pawn.",
        "7. h3": "This prevents Bg4 pinning the knight, these kind of moves are often under rated but they can prove very effective for preventing pesky pins.",
        "7... Nf6": "Standard development, preparing for castling.",
        "8. Re1": "Tartakower decides to centralize his rook which increases his massive grasp on the centre. Note that while White's position looks formidable Black's position is still solid and hard to break down.",
        "8... O-O": "This is a typical position from the Giuoco Piano well atleast it would have been in theory 50 years ago. At this point whites position is more agressive in the centre but, but is hard to make progress as Black can retain his central strong point at e4.",
        "9. Na3": "! I think this is a good move because it starts the knight on a long journey Nc2-e3-d5, where it proves to do a very effective job.",
        "9... Nd8": "This move anticipates white moving his knight to d5, it allows ...c6 if White's Knight moves to d5.",
        "10. Bf1": "This looks like a backwards move although it has to move so the Knight can move to c4. it does have the positive that it can prove as a useful defender of the Kingside! However you'll see that Tartakower didn't have the same opinion of the bishop defending the King-side.",
        "10... Ne8": "??This looks like a backwards move and it is inferior as you've probably guessed but its plan itself is not bad. The plan is to support e4 by ...f6.  a better plan would have been 10... exd4 11.cxd4 Nxe4.",
        "11. Nc4 f6": "Black has reinforced his e-pawn.",
        "12. a4": "THis is a typical manoevre taking advantage of blacks dark square bishop's immobility. THe threat of a5 means forces black to move his a- pawn or c-pawn both of which are currently defending the bishop.",
        "12... c6": "Black decides to choose the latter option. ",
        "13. Nxb6": "This is an effective move it exchanges his Knight which is ineffectively placed on the wing for a well placed Bishop that puts pressure on the centre.",
        "13... axb6": "Now black has a semi-open file for the exchange, you'll see that this proves useful later on in the game.",
        "14. Qb3+": "A queen fork! It forks the King and the hanging pawn on b6.",
        "14... Ne6": "Black parries the King with his little horsey!",
        "15. Qxb6": "White takes the hanging pawn. One thing to not though is if you just take all the pieces of the board and just leave the Black pawn structure you can see that it is very solid.",
        "15... g5": "! Black attacks Whites weakened kingside. Even though it weakens his own kingside he feels that he doesn't have anything to lose as he has already had a setback in material.",
        "16. Bc4": "White ignores blacks threat on the kingside. He should have left his bishop on f1 to help defend and play16.g3, preventing Blacks ...Nf4. However if he did that he wouldn't of made this game this entertaining!",
        "16... h6": "This is so if white takes the e5 pawn he can retake with the f-pawn with out the risk of having the g5 Pawn taken by White's Knight on f3.",
        "17. h4": "? Whitebreaks the rule that you should not move the pawns on the side that is being attacked. Better would have been 17.d5 or 17.b3",
        "17... Kh7": "I am not sure what the point of this move was. If you think you know please PM me. Maybe it was to support his Kingside advance.",
        "18. hxg5": "? Another childish move by Tartakower. Why is he opening the h-filefor Euwe to exploit. It makes no sense.",
        "18... hxg5 19. dxe5 dxe5 20. Be3 Rh8 21. g3": "? THis move must have been so frustrating for the people who watched this game. He again weakens his kingside. I think a better move would have would have been to evacuate the king via f1 and e2.",
        "21... Kg6": "Dr.Euwe decides to continue with his King sideadvance by riskily advancing his King, but he's gone this far he might as way go all the way!",
        "22. Kg2": "This is so he can play Rh1.",
        "22... Nf4+": "! This is a terrific sacrifice re-arranging the pawns that defend the white king. ",
        "23. gxf4 Bh3+ 24. Kg3": "24. Kg1 gxf4 and white is in a lost position.",
        "24... exf4+ 25. Bxf4 Qd7": "Now there is a mating threat on g4.",
        "26. Nh2 gxf4+ 27. Kxf4 Rh4+": "Black needs to keep the intiative as his king is threatend with Rg1 ",
        "28. Ke3 Bg2 29. Nf3 Rxe4+": "! This is a great sac. White just thinks he has made his kingsafe but white has opened new lines of attack.",
        "30. Kxe4 Nd6+ 31. Kd3 Qf5+ 32. Kd4 Qf4+ 33. Kd3 Qxc4+ 34. Kc2 Bxf3 35. b3 Be4+ 36. Kb2 Qd3 37. Reg1+ Kf7 38. Rac1 Qd2+ 39. Ka3 Nc4+": "! With this sacrifice and the one one the next move finally destroys the white king's defence on the Queenside once and for all!",
        "40. bxc4 Rxa4+": "!",
        "41. Kxa4 Qa2+ 42. Kb4 Qb2+": "0-1 White resigned here. because after Ka5 black mates with 43... Qa3 , or after 43. Kc5 white loses his queen after Qxf2 . As you can see a very good game. White is in the better position out of the opening, but he ignores blacks threat on the kingside early on in the middlegame an from there on in Whites position goes down hill with the help of a few masterful sacrifices by Max Euwe. I hope you enjoyed this instructive game of chess as much  as I have. I think this is one of my best annotations so I hope you like it! If you have any comments, feedback or you spot any mistakes please PM me. Rate genorously! :-)\nThanks\nTom"
    },
    "url": "https://gameknot.com/annotation.pl/dont-shoot-the-piano-player?gm=4561",
    "gameName": "\"Don't Shoot the Piano Player\"",
    "players": "Saviely Tartakower (?) vs. Max Euwe (?)",
    "opening": "Giuoco Piano (C53)"
}