{
    "moves": {
        "1. d4": "In this game I lose to stonni, only a few minor mistakes by white shows how black can encounter a powerful four pawns attack in the King's indian.",
        "1... Nf6 2. c4 g6 3. Nc3 Bg7 4. e4 d6 5. f4": "The game opening is E76 King's Indian, Four Pawns Attack. This opening gains much space for White. Black needs to respond to avoid losing the center.",
        "5... c5": "Black attacks at the edge of the pawn chain.",
        "6. Nf3 cxd4 7. Nxd4 Nc6 8. Nxc6 bxc6 9. Be2": "Black has a light advantage. The king castle is solid, the rook can get the b file with 9. ... Rb8 and the Queen can look into the white Kings's castle by 10. ... Qb6",
        "9... Rb8 10. O-O Qb6+ 11. Kh1 h5": "Black prepares an attack on the white King's wing.",
        "12. Na4 Qc7 13. Qc2 h4 14. Nc3 h3": "The black pawn h3 will be decisive. It reaches far into the white space and is close to the white King. ",
        "15. g3 c5 16. Bf3 Bg4 17. b3 O-O 18. Bb2": "Both white and black play a balanced game. The pawn structure gives the bishops and the queens much power on the diagonals.",
        "18... Qb7 19. Rae1 Bxf3+ 20. Rxf3 e6 21. Rd3 Rfd8 22. Qe2 d5 23. exd5 exd5 24. Qf3": "? A better move was 24. Nxd5 ",
        "24... Rde8 25. Rdd1": "White is more and more in a bad situation. The pawn center is destroyed and the black d pawn can break through.",
        "25... dxc4": "Black starts an exchange sequence, winning a pawn by a discovered attack on the queen.",
        "26. Qxb7 Rxe1+ 27. Rxe1 Rxb7 28. Na4 Nd7 29. Bxg7 Kxg7 30. Rb1 cxb3 31. Rxb3": "Black has a lone pawn at the c file and will try everything to get through to c1.",
        "31... Rb4 32. Rxb4": "White hopes that a one Knight end game can halt the marching pawn. The white King is needed for help, but unfortunately far away in the corner.",
        "32... cxb4 33. Kg1 Nf6 34. Nc5 Nd5 35. Na6 f5 36. Kf1 Kf7 37. Ke2 Ke6 38. Kd3 Kd6 39. Kd4": "The King appeared in the center. Can white force black to lose the b pawn?",
        "39... b3 40. axb3": "Yes! White has growing hopes, but the black Knight can now take the h pawn at only three moves!",
        "40... Nf6 41. Nb4 Ng4 42. Nd3 Nxh2": "Black is now turning the game and can force White to defend at the h file, while the a pawn is marching, supported by the black King.",
        "43. Nf2 Nf3+ 44. Ke3 Ng1 45. Nh1 a5 46. Kf2 h2 47. Kg2 Ne2 48. Nf2 h1=Q+ 49. Kxh1": "White has defended the h file successfully, but for what a price. The black King and knight are bothcloser to the a file than White. A fierce fight begins. Black can check.",
        "49... Nxg3+ 50. Kh2 Ne2 51. Nd3 Kd5 52. Ne5 Nc1 53. Nxg6 Nxb3": "White has only one pawn left. Is there a chance to halt the black a file pawn?",
        "54. Ne7+ Ke4 55. Nc6 Kxf4": "Now black has two pawns more. The last phase of the fight begins.",
        "56. Kg2 Ke3 57. Ne7 Ke4 58. Nc8 f4 59. Nb6 Nc5 60. Kf2 a4 61. Nc4 Nd3+ 62. Ke2 f3+ 63. Kd1 Kd4 64. Na3 Ke3 65. Nc2+ Kf2 66. Kd2 Nc5 67. Kc3 Kg1 68. Ne3 f2 69. Kb4 f1=Q 70. Nxf1 Kxf1 71. Kxc5": "By taking the knight, the white king is one step too far away from the last black pawn and black wins."
    },
    "url": "https://gameknot.com/annotation.pl/dont-fear-four-pawns?gm=8125",
    "gameName": "Don't fear four pawns",
    "players": "jprante (1753) vs. stonni (1807)",
    "opening": "King's Indian (E76), Four pawns attack"
}