{
    "moves": {
        "1. e4 c5 2. Nf3 d6 3. d4 cxd4 4. Nxd4 Nf6 5. Nc3 g6 6. Be3 Bg7 7. f3 O-O 8. Qd2 Nc6 9. O-O-O": "We arrive at a very well known theoretical position in the Sicilian Dragon with 9.O-O-O; the other main option being 9.Bc4 for white.",
        "9... d5 10. Bh6": "White has several options for his tenth move including Nxc6 and Qe1 and exd5. My opponent opts to exchange off the dragon bishop.",
        "10... Bxh6 11. Qxh6 Nxd4 12. Rxd4 e5 13. Rd2 d4 14. Nd1 Qc7 15. g4 Be6 16. a3 Rac8": "Launching a queenside pawnstorm with a5 and b5 ideas here was also an option. I thought transferring my rooks into more active positions on the queenside was a more solid way to play against white's oncoming h4-h5 kingside attack. ",
        "17. Kb1 Rfd8 18. Bd3 Rd6 19. h4 Rb6 20. h5 Qe7 21. Ka1 Rxb2": "21...Rxb2!!. A move that is too good to resist not playing and possibly one that my opponent missed after 21.Ka1. Nxb2 is not possible due to Qxa3 Qa2 and checkmate on a1. With a3 hanging if the capture is ignored, the game now enters into a 10 move forced sequence.",
        "22. Kxb2 Rc3": "22... Rc3! The point of the last move, hitting a3 again. If white seeks to play 23.Rh2 in order to give the king an escape square on d2 this is met with... 23...Qxa3+ 24. Kb1 Ba2+ 25. Ka1 Rc5 with the idea of Ra5 and inevitable mate on the a file (black must be careful in this Rh2 line as Qc1 becomes a defensive resource and the c3 rook is still attacked by the knight).",
        "23. Nxc3 dxc3+": "It is important to note Kxc3 is not possible as then Qxa3 is checkmate.",
        "24. Kc1 Qxa3+ 25. Kd1 Qa1+ 26. Ke2 Qxh1 27. Rd1 Qg2+ 28. Ke1": "Ke3 runs into the same problems as Ke1.",
        "28... Nxg4": "The final sacrifice, all calculated on move 21. This forcefully destroys white's remaining cover with the dual threat on the queen and Qf2#. The c3 pawn is very useful here to stop the king ever escaping via d2 back to the queenside.",
        "29. fxg4 Qg1+": "In view of...\n\n30.Ke2 Bxg4#\nor 30.Bf1 Qg3+ 31. Ke2 Bxg4#"
    },
    "url": "https://gameknot.com/annotation.pl/double-rook-sacrifice-attacking-chess?gm=66717",
    "gameName": "Double rook sacrifice-attacking chess!",
    "players": "martenp (1965) vs. mikeejwf (1997)",
    "opening": "Sicilian (B76), dragon, Yugoslav attack, Rauser variation"
}