{
    "moves": {
        "1. Nf3": "Hi everyone!\n\nI hope you have all had a very good Xmas and wish you a Happy New Year.  It has been a long time since you have heard from my royal couple, Henry and Glenda and it is high time I gave you an update, particularly after reading through an annotated lost game I played with Charleshiggie my opponent - it just goes to show what a high calibre of player he is!  But will he be able to add to his winning tally in this game?  If you do not want to see the gameknot analysis spoiler below I suggest you read on........  GA is here: http://gameknot.com/analyze-board.pl?bd=26642501&rnd=0.18493705775545544",
        "1... d5": "1 ..... d5 - after playing the Reti opening he decides to respond with d5.  I then respond with d4 followed by c4 after he developed his king knight to give him a kind of QG but with a couple of knight moves from each side thrown in.",
        "2. d4 Nf6 3. c4 c6": "3. ...... c6 - he then decided to play a QGD Slav Defense - c6 characterises this move.",
        "4. Nc3 e6 5. e3 Nbd7 6. Qc2": "6. Qc2 - Glenda eyes up h7 should King Charles decide to hie off to the kingside.",
        "6... Bd6 7. Be2 O-O 8. b3 b6 9. Bb2": "9.  Bb2 - eyeing up the a1-h8 diagonal - now King Charles HAS opted for the kingside.",
        "9... Bb7 10. O-O Qe7 11. Rad1 Rad8 12. Bd3": "12. Bd3 - putting pressure on h7.",
        "12... h6 13. Rfe1 c5 14. cxd5 cxd4 15. Nxd4 Nxd5 16. Nxd5 Bxd5 17. Nc6": "17. Nc6 - wheew, what a plethora of exchanges.  Charles and I had been playing the DB up until this move, which forks BQ and BR so that forces off the exchange for N and B.  Charles did oblige with the exchange for N and B but with a different bishop.  It looked as though I had lost a pawn, sigh ........",
        "17... Bxh2+ 18. Kxh2 Qd6+ 19. Kg1 Qxc6 20. Qe2": "20. Qe2! - Now, after being a pawn down I lay a trap for Charles.  The g pawn looks as if it will fall but if he does take it he will find himself down a piece for 2 pawns - although it will leave Henry dangerously exposed it will take Charles a few moves to muster up an attack with the remaining pieces left, particularly as, critically, the queens will have been traded off!",
        "20... Be4": "20.  ....... Be4?!  Charles spotted that trap but putting his bishop where it is now lined him up perfectly for another tactical shot winning back my pawn minus with a commanding position.",
        "21. Qg4": "21. Qg4! - This move doubly attacks Charles' bishop on e4 which is only defended once.  Also, the chessic grim reaper Old Matey is threatening to pounce on g7 on the next turn.  There is only one move that meets both threats but it forces him to return the pawn he snaffled .......",
        "21... Bg6 22. Bxg6 fxg6 23. Qxg6 Rf7": "23. ...... Rf7 - the only way to avoid mate on g7.",
        "24. Rd2": "24. Rd2 - planning to double rooks on the d column and have a possible funnel up to d6 and looking at the vulnerable pawn on e6.  However, on the next turn, Charles defends his e6 pawn and offered me a draw.  Owing to recent poor form in which I lost several games in which I had an apparently clear advantage, I decided to stick rather than twist.  The 8 rating points gained from the draw pushed my rating back into the 1700s - just.  For the record I lost my return game as black so this made this result seem very satisfying indeed.",
        "24... Re7": ""
    },
    "url": "https://gameknot.com/annotation.pl/double-attacks-with-mate-threats?gm=63946",
    "gameName": "Double attacks with mate threats!",
    "players": "jstevens1 (1695) vs. charleshiggie (2085)",
    "opening": "Reti opening (A06)"
}