{
    "moves": {
        "1. d4": "So here's a game where white manages to promote a pawn tol a queen on move 27, while queens are still on the board. So here's how it went down.",
        "1... d5 2. c4 dxc4": "The queens gambit accepted",
        "3. Nc3 c6 4. a4 e6 5. Nf3 Bb4 6. Bd2 a5": "Till here it had been rather normal, but this move was odd.",
        "7. e3 Nh6": "Developed the knight on the rim? Aren't knights on the rim dim?",
        "8. Bxc4 O-O 9. O-O Bxc3": "Black volunteers to give away the dark square bishop for a knight.",
        "10. Bxc3 Bd7 11. b4 b6 12. Ne5": "Hitting the bishop, and a nice outpost for the knight.",
        "12... Be8 13. Qf3 Nd7": "This was odd because he just gave me the pawn on c6, with tempo.",
        "14. Nxc6 Qh4 15. h3": "i made this move to prevent any possible ng4`s",
        "15... Rc8 16. b5 Rc7 17. d5": "This was a mistake by me, i didn't pay any attention to the bishop hanging",
        "17... Qxc4": "Err..",
        "18. Rfc1 Qh4": "This was the only square for the Queen because of the thread of Qg3 threatening mate and attacking the lose rook.",
        "19. d6": "Gaining an amazing outpost for the knight on e7.",
        "19... Rb7": "This was a blunder allowing white to win the rook for nothing. best would probably have been to play an exchange sacrifice.",
        "20. Ne7+ Kh8 21. Qxb7": "Snapping of the free rook.",
        "21... Nc5 22. Qxb6 Nd3 23. Rcf1": "probably the best move in this position",
        "23... Qc4 24. Bxa5": "snapping of another pawn",
        "24... g5": "This was a mistake , because it weakens the a1-h8 diagonal",
        "25. Qb8": "pinning the bishop and preparing to play d7.",
        "25... Ng8 26. d7": "Black is in big trouble here.",
        "26... Nf6": "this move allows the pawn queening without taking the bishop.",
        "27. d8=Q": "Ouch, 3 queens on the board",
        "27... Qc5 28. Rad1 Nd7": "This was also a mistake, because white can just take it, because bishop is pinned to the rook with a thread of mate.",
        "29. Qxd7 Kg7 30. Qxd3": "exchanging knights here, not sure if it was a mistake, but that black Knight on d3 was a real pain.",
        "30... Bxb5": "bxb5?? This move seems to attack both ´queens, but white has both queens pointing at this square.",
        "31. Qbxb5": "Maybe black should have taken the queen here, but it really doesn't matter, because its been a lost game for long now.",
        "31... Qxe7 32. Bb4": "Deflecting the queen away from protecting g5",
        "32... Qe8 33. Qxg5+": "Here its a forced mate in fact(Atleast i think so)",
        "33... Kh8 34. Bc3+ f6 35. Bxf6+ Rxf6": "The only move",
        "36. Qxf6+ Kg8 37. Qdd4 e5": "This doesn't stop the wrath of double queens.",
        "38. Qd5+ Qf7 39. Qdxf7#": "And its mate. The guy i played against is a true legend for playing till the end <3. Thanks for checking the annotation out."
    },
    "url": "https://gameknot.com/annotation.pl/double-queen-game?gm=52688",
    "gameName": "Double queen game",
    "players": "vavavi (1396) vs. fratomeo_55 (1310)",
    "opening": "Queen's gambit accepted (D20)"
}