{
    "moves": {
        "1. d4": "This is a game is an nice example of the Downward Spiral effect where I take one small mistake and make it into a large one.  Games often in many professions and by many people can turn south quickly when they notice they error made or feel they have made an error.  One mistake leads to another...  This is known as the downward spiral effect.  Anyway the reason mostly for my mistake is at the time I was distracted and unfortunately when I get distracted I tend to move quickly (a double kill per say).",
        "1... Nf6": "Typical Indian style.  I knew by easy's style that he wouldn't play the normal lines of the Indian due to the fact that he prefers open games.  I didn't however expect the change to come so soon. ",
        "2. f3": "f3 with ideas of e4 so I contest the idea with the central push d5.  This will soon turn to a gambit.",
        "2... d5 3. e4": "Here the gambit begins (Blackmar-Diemer gambit).  Not a bad gambit white wants to sacrifice a pawn for speedy development.  Declining the gambit may lead to problems has white will have the option of e5 though I thought about it.",
        "3... dxe4 4. Nc3": "Here black may consider once again a move like Bf5 declining to take the pawn.  But seeing as white typically leads in development by one piece I decide to gain the one pawn.  However white does have a nice central beachhead the d4 pawn.",
        "4... exf3 5. Nxf3": "At this point I would consider the gambit fully accepted though the book on gameknot stops on move 3.  Black has several options Bg4 seemed to be the most productive so I choice it.",
        "5... Bg4 6. Qd3": "Qd3 is a great development move.  Has the threat of Qb5+ and with proper time and execution this could be a very devastating move.  Several db games were won by white in this position.  The choice I made was not in the db and I don't know why anyone has never tried it (6... Nbd7).",
        "6... Nbd7": "Nbd7 is defensive of Qb5+ and Ne5.  It also has offensive ideas of c5 or e5.  I plan to play e6 though in order to give my dsb some life.",
        "7. Be2 e6 8. O-O c5": "White gets off the early castle I plan to play cxd4 next and meet dxc5 with Bxc5+ gaining time.  d5 can simply be ignored.",
        "9. Be3": "Respectable response by my opponent development and challenges my key c5 pawn.  Would be beneficial for white to find a way to trade of queens and dsb seeing as the g1-a7 diagonal will be a weakness.",
        "9... Qc7": "Qc7 puts up some defense of c5 and stops the possible trade of queens.",
        "10. Nb5": "Nb5 improving the knights position and gaining time.",
        "10... Qb6": "This was a slightly worse choice to Qc6.  I saw the center exploding with Ne5 and was slightly fearful.  However I have nothing to fear from the explosion.  White would have probably continued with Rd1.  Then I could have played Be7 preparing to get out of the center.",
        "11. a4": "a4 taking advantage of my dubious move.  a5 becomes a possible threat not to mention this move defends whites knight.",
        "11... Rc8": "Obviously this move is going to be met with a5.  I had planned to play c4 which I then chickened out of.  I was looking at 12. a5 c4 13. axb6 (or Qxc4 Qc6 14. Qxc6 Rxc6 15. Nxa6 the best line for white) cxd3 (14. Bxd3 my first thought) 14. bxa7 dxe2 15. a8=Q (here I failed to see exf1=Q+ 16. Kxf1 Rxa8 17. Rxa8+ Ke7 which would lead to a fairly balanced game.) Rxa8 16. Rxa8+ Ke7 which would leave me in shambles.  Be7 was most likely the best move.",
        "12. a5 Qd8": "Qd8 I found knowing that I would maintain material balance.  I will however take a positional hit.",
        "13. Nxa7 Ra8 14. Nb5 Rxa5": "Freddy didn't like this recapture.  He thought I should play cxd4... though I still wonder why.",
        "15. Bf4": "Bf4 my alarm bell went off here but, I didn't think things though after feeling as if I had made a few errors.  The best move in this position hands down is Rxa1.",
        "15... Nd5": "Nd5? Bc7 wins material.",
        "16. Bc7 Nxc7 17. Rxa5 Na6": "Closing down the a-file.",
        "18. Raa1 cxd4": "Planing a pin.",
        "19. Nbxd4 Bc5 20. Kh1": "Frees the white knight for the pin. I can castle here though Qb6 may be the best move.",
        "20... O-O 21. Qe4": "I should have let the pawn fall Nf6 is the best move.",
        "21... Bxd4": "Not the best move here.",
        "22. Qxd4 Bf5": "Bf5? Nf6 was once again best.  This loses to the pin on the d-file.",
        "23. Rad1 Nac5": "Hopelessly trying to defend. ",
        "24. b4 Ne4 25. Bd3": "Freddy ops for a slightly stronger move than winning quick material.",
        "25... Ndf6": "Fruitlessly tries one last defensive move.",
        "26. Qxd8 Rxd8": "Here I resign for after Bxe4 all hope is lost.  Being up an exchange and a piece will be an easy win for Freddy."
    },
    "url": "https://gameknot.com/annotation.pl/downward-sprial?gm=25552",
    "gameName": "Downward Sprial",
    "players": "easy19 (2275) vs. yoshark (1439)",
    "opening": "Blackmar-Diemer gambit (A45)"
}