{
    "moves": {
        "1. e4": "Comment un roi mal protégé aurait pu être réduit en bouillie lorsque la dame et les tours adverses sont encore là. Heureusement pour les noirs, ce fut une occation ratée. ",
        "1... c5 2. Nc3 Nc6 3. Nf3 e5 4. Bc4 h6 5. d3 Nf6 6. O-O g5": "Un peu téméraire, mais il faut mettre du piquant dans la vie quelquefois...",
        "7. Bd2 a6 8. Nd5 Bd6 9. c3 b5 10. Nxf6+ Qxf6 11. Bd5 Bb7 12. a3 O-O-O": "Ça va devenir un peu trop piquant.",
        "13. b4": "Oui, les pions noirs sont un peu trop avancés en face du roi noir.",
        "13... g4": "Faut être logique et attaquer de l'autre côté.",
        "14. Ne1 Qg6": "Pour libérer le pion f",
        "15. Nc2 h5 16. Ne3": "Ce cavalier, même s'il a bougé plusieurs fois, est maintenant bien placé.",
        "16... Ne7 17. Bxb7+ Kxb7": "Ce roi commence à être bien nu.",
        "18. c4": "Naturellement.",
        "18... f5 19. bxc5 Bxc5 20. Ba5 Rdb8": "Déjà un constat d'échec pour les noirs. Il me semble que je dois venir à la rescousse du roi, plutôt que de tenter de placer la tour en f8. L'attaque blanche s'annonce la plus rapide.",
        "21. Bb4": "Un coup embêtant.",
        "21... Bxb4": "Je me résigne à ouvrir la colonne a, bien que ce soit dangereux.",
        "22. axb4 f4 23. Nf5": "Décision qui m'a surpris à première vue, mais finalement je crois que c'est très jouable. La dame noire va se retrouver dans une position inconfortable pour la défense du roi, comme on va voir.",
        "23... Nxf5 24. exf5 Qxf5 25. f3": "Un coup qui semble mauvais: les blancs ne devraient pas en principe ouvrir le jeu devant leur roi, mais ici, la possibilité d'infiltration de la dame blanche avec échec fait que ce coup est très jouable.",
        "25... d5": "Et ceci semble certainement être une erreur. Mais je craignais beaucoup plus l'échange des pions  cxb  axb  avec deux colonnes ouvertes pour mon adversaire de chaque côté de mon roi... ouch!",
        "26. cxb5": "Mais il prend le bon pion.",
        "26... axb5 27. Qe2": "!  Maintenant, la menace  pion d4  a de quoi faire trembler le roi noir.",
        "27... e4": "?!  Il me semble que c'est le seul coup qui laisse encore une chance aux noirs de s'en sortir.",
        "28. dxe4 dxe4": "C'est que maintenant la dame noire participe à la défense.",
        "29. fxe4": "Il est clair que les blancs doivent éviter l'échange des dames, ce qui permettrait au pauvre roi noir tout nu de respirer un peu. ",
        "29... Qd7": "De5 laisse la dame dans une position plus centrale c'est vrai, mais ici il y a un petit piege...",
        "30. Rxf4": "Le coup qu'il ne fallait pas jouer...mais étrangement les blancs ici gagnent encore... Le meilleur coup ici était probablement  Tour a4",
        "30... Qd4+": "Les blancs perdent une tour... mais pas la partie...",
        "31. Rf2": "Il fallait jouer  Roi h1",
        "31... Qxa1+ 32. Rf1 Qd4+": "Voilà pourquoi il fallait jouer Rh1 plus tôt: Les noirs gagnent un temps précieux en centralisant la dame (avec échec!).",
        "33. Rf2": "L'erreur fatale. Il fallait encore jouer Rh1. Je ne prétends pas que les blancs gagnent encore mais il ont encore des possibilité très dangereuses à cause du roi noir exposé. Maintenant, la tour blanche est clouée, ce qui va donner aux noirs le temps de se regrouper, puisque seule la dame blanche peut créer des menaces vers le roi noir.",
        "33... Kc6": "Dc4 est probablement aussi bon, mais ce coup limite encore plus les possibilités d'attaque des blancs... et la tour blanche demeure clouée.",
        "34. Qc2+": "Le seul coup qui reste",
        "34... Kd6": "Une telle incursion du roi dans le centre aurait été très risquée avec la tour blanche en action.",
        "35. Qc5+": "Découragement? L'échange des dames laisse une fin de partie facilement gagnée pour les noirs.  Sinon, Roi h1 ne fonctionne pas à cause de  D a1 ; et D a2 peut être paré avec T(h1)-f1 (L'autre tour pourra parer en b6)",
        "35... Qxc5 36. bxc5+ Kxc5 37. Rf5+ Kc4 38. g3 b4 39. Kf1 Rhf8": ""
    },
    "url": "https://gameknot.com/annotation.pl/dragoneyes-mini-tournament?gm=10274",
    "gameName": "dragoneye's mini-tournament",
    "players": "pierre1960 (1452) vs. guy04 (1773)",
    "opening": "Sicilian (B23), closed, 2...Nc6"
}