{
    "moves": {
        "1. e4 e5 2. d4": "I usually respond less confrontationally to e4. But this time I went with e5 because I was a bit stressed and couldn't think of anything more inventive.\r\nSo, I didn't know how to respond to this. ",
        "2... exd4 3. Qxd4": "This however I think may have been a breach of opening theory. (I know very little about openings) but it seems to give me the initiative.",
        "3... Nc6": "Develop with tempo.",
        "4. Qd1": "This effectivly wastes a move. Wouldn't Qa4 have at least left him with a developed piece? Again I don't know for sure but this gives me even more initiative.",
        "4... Nf6": "Let's try and rule in the center. Use my initiative to usurp important squares.",
        "5. Bg5 d6": "Some increased hold on the center but primaly creates an outlet for my bishop.",
        "6. Bb5": "And he promptly pins my other knight. In my experience this type of pin often results in the eventual exchange of bishop vs knight. this game looks fairly open so I'm thinking those exchanges would benefit me. leaving me with the bisop pair in an open game. Lets try to expidite the exchanges.",
        "6... Be7": "Frees my knight and announces O-O. Now my knight is sort of threatening his pawn on e4.",
        "7. Bxf6 Bxf6": "One trade down. One to go.",
        "8. c3": "I feel this move is a mistake. He protects his b-pawn but he blocks his knight out from c3. I think Nc3 is better.",
        "8... Be6": "develop the bishop and strengthen my chokehold on the center.",
        "9. Nf3 O-O 10. O-O": "There. We're both castled. But I think I'm better here.",
        "10... Ne5": "Challenging his knight to strengthen black in the center.",
        "11. Nxe5 Bxe5": "I feel happy with this position. It might be crap but I think I'm pretty solid here. My bishops feels rather strong. 12. f4 could be troublesome. But I think it could be handled.",
        "12. h3": "This however feels like a waiting move. I feel confident in my position so lets try some tactics. Lets..",
        "12... Qg5": "\"Pin the defender\" This also has the advantage of getting a majority on c4.",
        "13. Na3": "He misses my little trick. g4 handles my threat but it would weaken his king position. I don't really see an alternative though.",
        "13... Bxh3": "Win the pawn. Also generates a mate threat.",
        "14. Qf3": "protect the mate. Only way?",
        "14... Bg4 15. Qe3 Qg6": "I should probably have gone Qh5. Again threatening mate. ",
        "16. Be2 Be6": "Should I have made the exchange? I don't know if I would have still had any attack after: ... Bxe2 17. Qxe2 Qh6 18. g3. It's possible but not certain.\r\n(Also note if I would have put my queen on h5 this wouldnt have been a possibility for white)",
        "17. Nb5 d5": "This was a misstake. It releses the tension.",
        "18. exd5 Bxd5": "The bishop isn't hanging (Qxe5 Qxg2#)",
        "19. g3": "Stops my attack. Compleatly.",
        "19... Rae8": "Defending my bishop.",
        "20. Nxc7 Bf4": "???? Why dear god did I not take the knight? What could I've been thinking? Furthermore, this hangs the bishop. Temporary insanity? This move should have been my downfall.",
        "21. Qxf4": "Sigh.",
        "21... Rxe2": "Lets have something for the two blundered bishops at least.",
        "22. Rfe1": "Greedy little bugger. ",
        "22... Qh5": "Threatening mate.  Here white should take the bishop.",
        "23. Kf1": "But he WantS the rook. Greed is bad. ",
        "23... Bc6": "Save the bishop.",
        "24. Rxe2": "There were better moves for white here.",
        "24... Qh1#": "A nice little mate."
    },
    "url": "https://gameknot.com/annotation.pl/dubious-win?gm=9627",
    "gameName": "dubious win.",
    "players": "white (1274) vs. chasparos (1365)",
    "opening": "Centre game (C22)"
}