{
    "moves": {
        "1. Nc3": "I usually play 1.b4, but this is my curve ball opening -- the Dunst or van Greet. ",
        "1... g6": "I like to see 1...d5 as the response. ",
        "2. f4 Bg7 3. Nf3": "Now we are transposing into a Larsen-Bird, an opening I don't have a great record playing with. ",
        "3... c5 4. e3 Nf6 5. Be2 Nc6 6. O-O O-O 7. Qe1 b6 8. b3 Bb7 9. Bb2 Qc7 10. Nb5 Qb8 11. a3 a6 12. Nc3 d5": "Now that's hyper-modern chess. It took 12 moves for one of us to thrust a pawn into the center of the board.  19th Century chessmasters are rolling in their graves over what has become of their game. ",
        "13. Na4 Nd7 14. Bxg7 Kxg7 15. d4 b5 16. Nxc5 Nf6 17. Ne5": "The point of this move was to fork the Queen and Rook via d7. ",
        "17... Nxe5": "Wrong move. He had to move one of the two forked pieces, I think. ",
        "18. fxe5 Ne4 19. Nd7 Qc7 20. Nxf8 Rxf8 21. Bd3 Nc3 22. Rf2 a5 23. Qf1": "Looking to break through on the f-file while pressuring black's b-pawn. The point is I'm winning and all I have to do is grind. ",
        "23... Qc6 24. h4 f5 25. exf6 e.p.+ exf6 26. Rf4": "I'm not sure why I did this move. ",
        "26... f5 27. g4": "I thought hard about this move because it weakens the kingside safety. Given the material advantage I guess this is a good move, but he still has two heavy pieces on the board. Maybe not so smart a move. ",
        "27... Bc8 28. gxf5 Qe8": "This moved surprised me. Without hestitation, I made my next move. It was only a few hours later when looking at the game that I realized that I had been snookered. (Never let up, folks)",
        "29. fxg6 Qxe3+": "If I had gone simply rook to e1 on the move before, I would be in safe territory, ah now the adventure begins. ",
        "30. Rf2": "Forced, otherwise I lose the rook ",
        "30... Bh3 31. Re1": "This may not be the right move. I wonder if Q to e1 is any better. Notice the white bishop protecting against a rook takes rook combination. ",
        "31... Qg3+": "Is Qxd4 better?",
        "32. Qg2": "An amazing queen sac in desperation. Blacks best option now is to liquidate the position with Queen takes Queen in which after all is said and done he would be down 1 pawn. Taking the queen loses. Don't believe me? ",
        "32... Bxg2 33. Re7+": "Every combination of moves loses. The only combination I had not figured out was what to do with Rook to f7 blocking check. On second thought that too probably doesn't save the situation. ",
        "33... Kg8 34. gxh7+": "And mate in two when black resigned. An amazing finish to a game I was firmly in control.  Lesson: Don't underestimate your opponent even in the end. "
    },
    "url": "https://gameknot.com/annotation.pl/dunst-opening-dunce-moves-a-queen-sac-save?gm=37571",
    "gameName": "Dunst Opening, Dunce Moves & A Queen-Sac Save",
    "players": "mr5reasons1 (1649) vs. x-machine (1586)",
    "opening": "Dunst (Sleipner, Heinrichsen) opening (A00)"
}