{
    "moves": {
        "1. d4 f5": "Dutch defense  ",
        "2. g3 d6 3. Bg2 Nf6 4. c4 g6 5. Nc3 Bg7 6. Nf3 O-O 7. O-O Nc6 8. Bg5": "Perhaps this isn't the right square for the bishop.",
        "8... Ne4": "If 8. Nxe4 fxe4  9. Nh4 nxd4 is good for black.",
        "9. Be3 Nxc3 10. bxc3": "Black has weakened White's queenside pawn structure.",
        "10... h6": "stops the knight going to g5, but creates a target on h6.",
        "11. h4": "stops ...g5",
        "11... e5": "If white takes the e5 pawn a queen swap is likely, which would not suit white at this stage.",
        "12. Qd2 Kh7": "Protects the h pawn. Later in the game the black king's position on the edge of the board will be \na problem for black.",
        "13. Ne1": "knight is aiming for d3, and then f4.",
        "13... Bd7 14. Nd3 e4 15. Nf4": "A good outpost for the knight.",
        "15... Na5": "threatens the weakened c4 pawn.",
        "16. c5 Nc4 17. Qc1 dxc5 18. f3": "white is in no hurry to capture back on c5, which would create doubled isolated pawns on the \nc file. It's more important to attack the pawn on e4.",
        "18... Re8 19. fxe4 fxe4 20. dxc5 Bf5": "? Perhaps Nxe3 would be better.",
        "21. Rd1 Qe7 22. Bd4": "White is pleased to have the bishop on d4, protecting c3 and preparing e3. This also frees up \nthe white queen.",
        "22... c6 23. e3 Rad8 24. Bf1": "Chases the knight away from c4.",
        "24... Ne5 25. Kf2": "White fears 25...Nf3  26 Kf2 Nxh4 27 gxh4 Qxh4 which looks promising for Black.\nWith this move white can answer ...Nf3 with Ng2, and then ...Nxh4 is met by Nxh4.",
        "25... Ref8": "white has to be careful of a pin or discovered check on the open f file.",
        "26. Be2": "Anticipating the opening (or half opening) of the h file. White wants to transfer the rook back to\nh1.",
        "26... g5 27. hxg5 Qxg5": "Worth considering is ...hxg5 28 Rh1  Bh6 and white has real problems with the f4 knight,\n...Nd3  (forking king and queen), and ...Bg4 (possibly with a discovered check).",
        "28. Rh1": "Maybe the rook will go to h4 at some stage.",
        "28... Bg4 29. Qc2": "Threatening the e4 pawn with check, and moving out of a possible knight fork on d3. Also white \nnow has to worry about ...Bxe2 30 Kxe2? Qxg3",
        "29... Qf5 30. Bxe5": "!! A sequence that exploits blacks over reliance on his queen and ends with the winning of \nthe e4 pawn.",
        "30... Bxe5 31. Bxg4 Qxg4 32. Qxe4+": "Black has invested a lot in the e4 pawn and now it has been taken.",
        "32... Qf5": "Only way to avoid losing the bishop.",
        "33. Qxf5+": "White is happy to swap down to an endgame with a passed pawn and a more centralized king.",
        "33... Rxf5 34. Rad1": "Challenging black for control of the open d file.",
        "34... Bxf4": "? A strange move. Unites white's pawns and swaps a more active bishop for a pinned knight.\nAlso black, who is positionally weaker should not simplify.",
        "35. exf4": "Of course white doesn't play 35 Rxd8? Bg5 ! 36 Ke2 Bxd8. (Which wins a piece for Black.)",
        "35... Rfd5 36. Ke2": "Another possibility would be Rxd5 Rxd5 37 Re1.\nIf black tries ...Rxd1 37 Rxd1 Rxd1 38Kxd1 h5 39Ke2 Kg6 etc,\nthen the white f pawn will queen one move before the black h pawn.\nThen white can force a swap of queens and (with his king on e5) win the resulting endgame.",
        "36... h5": "Bad move. Weakens blacks h pawn unnecessarily. Black needed to play something like ...Kg6 first.",
        "37. Rxd5": "? White misses out on the stronger 37 Rxh5 ! Rxh5  38. Rxd8 which wins a pawn.",
        "37... Rxd5 38. g4 Rxc5": "Restoring material equality but with a much weaker position.",
        "39. Rxh5+": "! Forcing the swap of rooks.",
        "39... Rxh5 40. gxh5 Kh6": "Black will regain material equality but his king will be marginalized",
        "41. Ke3 Kxh5 42. Ke4": "Even though white is not up in material his centralized king and advanced passed pawn means he \nhas won the game (if he plays carefully.)",
        "42... Kg6 43. Ke5 Kf7 44. Kd6": "Sacrifices his passed pawn to win blacks pawns.",
        "44... Kf6 45. Kc7 Kf5 46. Kxb7 Kxf4 47. Kxc6 Ke4 48. c4 Kd4 49. c5 Kc4 50. Kd6": "And its all over bar the shouting."
    },
    "url": "https://gameknot.com/annotation.pl/dutch-defense-1-0?gm=14296",
    "gameName": "Dutch defense  1-0",
    "players": "ned_kelly (1823) vs. rdevault (1798)",
    "opening": "Dutch defence (A81)"
}