{
    "moves": {
        "1. c4": "This could have been one of one of my finer bloody attacking morsels, however, indigestion of the mind led it to being one of my vilest capitulations, as I snatched defeat from the jaws of victory.",
        "1... f5": "This game was part of an English Opening theme tournament.  All of the tulip maidens Nosferatu drained in Holland has made him a Dutch Defense player so ...f5 usually factors into most of my systems against the d4/c4 web of openings.",
        "2. Nc3 Nf6 3. Nf3": "Still remaining in English territory.  3. g3 is also common.",
        "3... d6": "3. ...e6 keeps the classical dutch setup.  With 3. ...d6 I now threaten ...e5, so:",
        "4. d4": "White transposes back into standard Dutch lines.",
        "4... g6": "4. ...c6 and 5. ...Qc7 is another approach, the The Antoshin Variation, aiming at a quick ...e5.",
        "5. g3 Bg7 6. Bg2 O-O 7. O-O Qe8": "Via transposition, we have reached the Leningrad Variation of the Dutch Defense, arguably the sharpest and most theoretical of all the Dutch lines.  I used to play it quite frequently before switching the Classical Dutch, because after 8. d5 I played too many games where I suffered on blindingly light squares (Nosferatu hates the light). It still leads to enterprising chess.",
        "8. b3": "This is the other main line approach (aside from 8. d5).  However, 8. Re1, Qb3, and 8. Nd5!? have all been tried.",
        "8... Na6": "This move covers c7 and eyes the c5/b4 squares, but most often this move is played with idea of redeveloping the knight on c7 after a summary ...c6 push.  8. ...Nbd7? is a common error with mortals who don't understand the Leningrad, since after 9. Ng5 black is embarrassed on the light squares, i.e. 9. Ng5 Nb6 10. c5.  The queen's bishop must remain unimpeded in this variation, and often remains on c8 for a long time.",
        "9. Ba3": "9. Bb2 is the alternative, and IMO a little more challenging, though the white queen's bishop can stir up plenty of mischief on the f8-a3 diagonal as well.",
        "9... c6 10. Re1": "?! As Tartakower said, obvious, therefore dubious.  It prepares e4 of course, but the downside is that black can now play ...b5 immediately, with counterplay, whereas the most critical test, 10. Qd3, doesn't without additional preparation, (10. ...Rb8).",
        "10... b5": "! As mentioned in the previous note.",
        "11. Bb2": "? This sheepish retreat pretty much concedes a whole tempo and admits 9. Ba3 was a mistake.  Correct is 11. cb cb 12. Qd3 (12. ...b4? doesn't win a piece: 13. Bxb4 Nxb4 14. Qc4ch) Rb8 13. b4, though after 13. ...Bb7 black has a good prospects, and even a slight pull in the middlegame.",
        "11... b4": "! I flick my thorn forward into the neck of my opponent's queenside.  My bid for queenside play has pretty much been successful.",
        "12. Nb1": "12. Na4 is the alternative, though white probably took a dim view of stranding his knight on the periphery of the board.",
        "12... Ne4": "Posting a knight on a center post, and letting my dark-squared priest breathe a little more (Nosferatu always breathes better in darkness), which helps an ...e5 break.  In the meanwhile, after shooing away the c3 knight, I've put the kibosh on white's own e4 break (many advantages in the opening rest on who breaks in the center first at the right moment, with initiative).",
        "13. Nbd2": "White would be remiss not to challenge my black knight, however I'd been following an idea of mine seeded in my head since move 10 or so that would now reach gestation.",
        "13... Nc3": "!? Sacrificing a pawn for time and development, and considering it was a relatively unimportant wing pawn and crosses up white's lines temporarily I thought it was a good investment.  There's a long history of b-pawns being the first on the block for just such considerations, actually (in chess and war).  Look at the the Evan's, Benko, and Sicilian/French Wing Gambits.",
        "14. Bxc3": "Junior revealed to me that delaying the capture 14. Qc2 would in fact be better, a sample line going: 14. Qc2 e5 15. de de 16. e4, but this is a very inhuman continuation.  I knew that psychologically the urge to immediately kill an enemy knight that's just landed on your third rank is a strong one, which is what he did.",
        "14... bxc3 15. Nb1": "The queen's knight has had a restless time in the opening so far.",
        "15... e5": "I have more central space, the two bishops, and more forcing moves to choose from.  With these considerations Junior has firmly signed off on the pawn sac at this point, believing I have good counterplay.",
        "16. dxe5 dxe5 17. Nxc3": "17. e4 would be met with 17. ...f4 on my part, naturally.",
        "17... e4": "! Now my DSB has a clear firing line down the h8-a1 diagonal, and I've put a gag on white's LSB's bishop on the mirror diagonal.",
        "18. Nd4 Bb7": "Development.  ...Rd8 is threatened, and I also have my own potential tactical tricks following line-clearing ...c5 and ...e3! pawn pushes.",
        "19. e3": "Protecting d4 and stopping ...e3, although white's light squares are now very weak.  The d3 square is now an advanced support point for black.",
        "19... c5 20. Nde2 Rd8": "My pieces continue to increase their scope and influence while white is kept busy with defensive maneuvers.  Junior believes black has a very clear edge now.",
        "21. Qb1": "White's queen doesn't have may ideal squares, facing an inevitable ...Na6-Nb4-d3 maneuver on the horizon.",
        "21... Nb4 22. a3 Nd3": "Once again I've sunk on knight on my enemy's third rank, and this one is not so easily wrenched free from its post.",
        "23. Rd1 g5": "More infantry to support ...f4 incursions into the enemy king-side.",
        "24. Ra2": "Vacating the rook from the dangerous h8-a1 diagonal, and giving potential defensive support to f2 in the future.",
        "24... f4": "! I almost played a preperatory 24. ...Qg6 first, however that would have been unnecessarily conservative, and I decided to storm white's king-side pawns immediately instead (the right decision, it was later confirmed).",
        "25. gxf4 gxf4 26. exf4 Qg6": "With many threats baring down on the white monarch.  I was expecting white to now return the pawn and eliminate one of the deadly bishops with Nd5.  After 27. Nd5, Bxd5 28. cxd5, Rxd5 black is still better, though his position isn't as menacing.",
        "27. Kf1": "?? I was thrilled to see this move, since thenext stroke I was planning on depended on it.",
        "27... Nxf2": "!? But now it turns out Nosferatu was the one who missed the most effective and straightforward crusher.  28. ...Bxc3 29. Nxc3 Nxf4 30. f3 (30. Bh1 Bc8!! where white is hopeless against the thread of ...Bh3ch) Qg7 where white's position is in ruins.  The move I chose is second-best, but still good.  The knight is poisoned against an ...e3! with check.",
        "28. Rxd8 Rxd8 29. Qe1": "? In demoralizing positions, blunders come easily, like this natural-looking one.  White can still bail out and minimize the carnage (again, as at move 27) with 29. Nd5.",
        "29... Bd4": "? I thought this move was very strong, since I can now threaten ...Ng4 and ...Ne3ch to devastating effect (30. h3 runs into Nxh3!), and keeping my knight on f2 kept the enemy queen off g3, and if white took it, I would now have a pair of advanced, passed, \"hanging pawns\" lurching at the white position, so I thought I had a won position either way.  Junior tells me, with his usual pitiless manner, that I in fact threw away my advantage with this move, and I should have played 29. ...Ng4 immediately, with 30. ...Rd3 to follow, with a tight noose around the position. ",
        "30. Nxd4 cxd4": "Here was my \"dream\" position which looks cosmetically losing for white, though my silicon pet is not easily persuaded.  Still, with very double-edged positions, there is a lot of leeway for both sides to go awry and \"lose the thread\" of the game.",
        "31. Qxf2": "The deflecing 31. f5! is in fact best: 31. ...Qg4 (...Qxf5?? 32. Rxf2) 32. Nd5 (yet again) but this is an unorthodox sequence for a human to consider.",
        "31... dxc3": "I was alternating between the text and 31. ...e3??, which turns out would have lost after 32. Qg3 Qxg3 33. hxg3 Bxg2 34. Rxg2 dxc3 when black's formerly robust pawns are now rotten fruit hanging down the lowest branches waiting to drop.  After rejecting it in my calculations, I figured that this move (or \"retaking capture\") was forced.",
        "32. Qg3": "...but I met 32. Qg3 and the forced queen trade anyway.  Now, with the previous losing variation still fresh in my mind and the diseased blood of rats Nosferatu has been forced to eat lying like lysol in his belly, I started to hallucinate in despondency, and made my worst blunder of the game.  I resigned.  All I could see was an even worse position awaiting me related to the previous 31. ...e3 variation, except after the queen-trade a bishop pinned behind the e-pawn and pawns also helpless to be slaughtered.  It turned out this position is completely different.  Contrasted against the superficially similar but inferior 31. ...e3 32. Qg3 Qxg3 33. hxg3 Bxg2ch 34. Rxf2 cxd3, here the synergy of my pieces perfectly aligns to keep the white king off the d-file: 32. ...Qxg3 33. hxg3 Rd1ch 34. Ke2 Rc1!! White is helpless to meet ...c2 and a loss of material, i.e.: 35. b4 c2 (threateneing ...Rd1ch) 26. Kd2 Rg1! and white must lose his bishop (and the g-pawn behind it) or else the c-pawn promotes.  A bitter rodent pill for Nosferatu to swallow as he slinks back to his lair, awaiting the next opportunity to invade the Kingdom of Banora, and this sortie enters the dubious history of chess games where the loser resigned the game in a won position.  The lesson of this game?  Never sink so low in life that you must feed on rats for sustenance in the endgame."
    },
    "url": "https://gameknot.com/annotation.pl/dutch-despair?gm=35920",
    "gameName": "Dutch Despair",
    "players": "banora (1746) vs. -nosferatu- (1742)",
    "opening": "English (A10), Anglo-Dutch defense"
}