{
    "moves": {
        "1. e4 d6": "Pirc",
        "2. d4 Nf6 3. Nc3 g6 4. Bc4 Bg7 5. f3": "And this is called the Lion's defense: Lion's Jaw. The e pawn double protected by the knight and f3 pawn. This mirrors the Saemisch in King's Indian games.",
        "5... Nc6": "Continually playing the Pirc I have learn, from experience, it is not always best to castle when you can.",
        "6. Nge2 Nd7": "I believe, considering the g2, f3, e4 pawn chain, the f6 knight had no future role on f6.",
        "7. d5": "unsound",
        "7... Na5": "The bishop is indeed misplaced, Furthermore the pawn chain restricts its scope ",
        "8. Bb3": "The bishop is doing nothing and there is no reason to take it",
        "8... O-O 9. Bg5": "!? This seems like a attack coming from a Saemisch player",
        "9... h6": "It does not work!",
        "10. Be3": "This should have been his move in the first place",
        "10... Ne5": "The knights are going to coordinate with one another! if white plays Qd2: I'll play (either N) Nc4! ",
        "11. Qc1": "Preventing white from castling queenside ",
        "11... e6": "I try to set up a trap ",
        "12. O-O Kh7": "s",
        "13. Kh1 c5": "Both the bishops are useless",
        "14. dxe6 Nxb3 15. axb3 fxe6 16. Rd1": "And the tide shifts",
        "16... Qe7": "Getting out of the line of fire. Also, notice his next move could have been Bxc5",
        "17. Nb5": "I spent a couple hours looking at this position. An hour on the gameknot analyse program and another hour or so via printed copy. I could have defended further by playing 16...Nf7 or 16...Rd8 But that would allow counter play along the a file with his rook and knight.",
        "17... d5": "It was best to attack! ",
        "18. exd5 exd5 19. Rxd5": "Now the center is open! ",
        "19... b6 20. Nf4 g5": "it was best to rid the knight on f4.",
        "21. Ne2": "wasting a move!",
        "21... Nxf3": "A sound sacrifice ",
        "22. Nec3 Bb7 23. gxf3 Rxf3 24. Kg1 Rxe3 25. Qd2 Qe6 26. Nc7 Qg4+ 27. Qg2 Qxg2+ 28. Kxg2 Bxc3 29. bxc3 Re7 30. Kg3 Bxd5": "This was a very bad trade. I look at the screen for 10 seconds and said to myself,\"woo woo, take the rook. Better take the rook.\" Better was to capture the knight for free. ",
        "31. Nxd5 Re2 32. Nxb6": "And I made another blunder.  White had better endgame skills than I.",
        "32... Rf8": "Instead of pawn chasin', I decide to make a mating net with my two rooks, pawns and my king.",
        "33. Rxa7+ Kg6 34. Nd7 Rfe8": "two connected rooks!",
        "35. Ra6+ Kg7 36. h4 gxh4+ 37. Kg4": "?! ",
        "37... Re2e4+ 38. Kf5 Re4e1": "!!",
        "39. Rg6+ Kf7 40. Rxh6 Rf1+ 41. Kg5 Rg8+": "I opted for a sideways mate",
        "42. Kh5": "The h pawn is poison ",
        "42... h3": "The march to 8 rank!",
        "43. Ne5+ Ke7 44. Rh7+ Ke6 45. Ng4 h2": "!!",
        "46. Rh6+ Kf7 47. Rh7+ Kf8 48. Nxh2 Rh1": "white resign"
    },
    "url": "https://gameknot.com/annotation.pl/dynamics-of-the-pirc-delayed-lions-defence?gm=17897",
    "gameName": "Dynamics of the Pirc: delayed Lion's Defence",
    "players": "sandsaver (1789) vs. freeman8201 (1653)",
    "opening": "Pirc (B07), Holmov system"
}