{
    "moves": {
        "1. e4": "Partie en mode coaching. Les commentaires s'adressent principalement à albert260648.",
        "1... e5 2. Nf3": "Le coup le plus souvent joué en réponse à d5. On s'en va vers l'Italie ou l'Espagne (ouverture italienne ou ouverture espagnole ?). Ce coup respecte deux des principes fondamentaux des ouvertures : il attaque un pion dans le centre et développe un pièce mineure (fou ou cavalier).",
        "2... Nc6": "Le coup naturel : lui aussi fait deux choses importantes : protège le pion central attaqué et développe une pièce mineure.",
        "3. Bb5": "Ce sera l'Espagne. L'Espagne est beaucoup plus populaire maintenant que l'Italie pour les joueurs d'échecs. Avec Bc4, on serait en Italie: l'ouverture italienne était en effet très populaire au début du 20ème siècle. On dirait qu'il faut que les noirs protègent le pion e5 ?!",
        "3... d6": "Voilà un coup qui protège le pion, en effet, mais qui cloue le cavalier. De toute façon, on retrouve ce clouage du cavalier dans plein d'ouvertures, et ce n'est pas la fin du monde. Ce coup est donc tout à fait valable. Mais ce n'est pas le coup le plus souvent joué. C'est plutôt a6 qui est joué ici 90% du temps. Mais alors, les noirs ne perdent-ils pas le pion e5 après l'échange du fou blanc pour le cavalier noir? Pourtant, tous les experts sont d'accord : il n'est pas vraiment bon de prendre le pion. Pourquoi?",
        "4. d4": "Renouvelle la pression au centre.",
        "4... Qe7": "Oui, Bd7 était meilleur!",
        "5. d5": "Et voilà pourquoi. Les blancs gagnent un pion.",
        "5... Bd7": "Mais maintenant, les blancs gagnent une pièce. Il fallait jouer a6.",
        "6. dxc6 Bxc6 7. Qd3": "Ici, les blancs auraient pu jouer BxB, mais ce coup permet de développer la dame.",
        "7... Qd7 8. Nc3": "Un autre coup qui développe une pièce mineure.",
        "8... Nf6": "Rien à redire ici.",
        "9. Bg5 Be7 10. O-O h6": "En prévision d'une avance des pions du côté roi. Les noirs envisagent probablement de roquer du côté dame.",
        "11. Bxf6": "J'ai joué ce coup malgré les inconvénients que pourraient causer la recapture avec le pion, ouvrant la colonne g pour une tour noire. ",
        "11... Bxf6": "En reprenant avec le fou, la position demeure fermée du côté roi, et les chances d'attaque pour les noirs diminuent. ",
        "12. Rad1": "Les tours doivent se placer sur des colonnes ouvertes, comme disait Confucius.",
        "12... O-O-O": "Le bon plan, mais les noirs auront de la difficulté à développer une bonne attaque du côté roi pour contrebalancer l'attaque des blancs qui va maintenant débuter du côté dame.",
        "13. Bxc6": "Échange nécessaire pour placer le cavalier en d5.",
        "13... Qxc6 14. Nd5 a6": "Peut-être un des pires coups que les noirs pouvaient jouer. L'objectif des blancs est d'avancer les pions du côté dame, faire le ménage devant le roi, pour permettre aux tours de s'infiltrer de façon victorieuse dans la chambre du roi. En avançant les pions devant le roi, les noirs facilitent le travail de sape des pions. Le contact va simplement se faire plus tôt.",
        "15. b4 h5 16. c4 h4 17. b5 axb5 18. cxb5 Qd7 19. Rdc1 Kb8 20. Rxc7 Qe8 21. Rfc1 h3 22. b6 Rd7": "Da4 était nécessaire pour éviter un mat rapide.",
        "23. Qa3 Rxc7 24. Rxc7 Qa4 25. Qxa4 hxg2 26. Qa7#": ""
    },
    "url": "https://gameknot.com/annotation.pl/d-fi-dalbert260648?gm=2545",
    "gameName": "Défi d'albert260648",
    "players": "guy04 (1814) vs. albert260648 (1318)",
    "opening": "Ruy Lopez (C62), old Steinitz defence, Nimzovich attack"
}