{
    "moves": {
        "1. c4 c5 2. Nf3 Nc6 3. Nc3 Nf6 4. g3 e6 5. Bg2 d5 6. e3 Be7": "Prudence et développement plutôt que de prendre le pion.",
        "7. O-O dxc4": "Assez de prudence. On prend. ",
        "8. b3": "Plutôt que Qa4 qui reprend le pion mais laisse la Dame blanche dans une position avancée (avec du pour et du contre).",
        "8... cxb3": "Comme disait Confucius, un pion est un pion.",
        "9. axb3 O-O 10. d4 cxd4 11. Nxd4 Nxd4 12. exd4": "Les blancs ont maintenant deux pions isolés.",
        "12... Bb4 13. Bb2 a5 14. Re1 Nd5 15. Bxd5 exd5 16. Re3 Be6 17. Nb5 Qb6 18. Qd3 Rac8 19. Ba3": "Vient à la rescousse du Cavalier.",
        "19... Bxa3 20. Nxa3 Rc6": "Les blancs ont réussi à se libérer, mais les noirs vont tenter d'utiliser au maximum la colonne c ouverte.",
        "21. Qd2 Rfc8 22. Rd1": "Abandonne l'idée d'attaquer le pion a5 mais il fallait regrouper les pièces en particulier le Cavalier qui devra passer par b1.",
        "22... h6": "Un coup d'attente qui peut être utile plus tard en enlevant toute possibilité de mat sur la dernière rangée.",
        "23. Rde1 Qa6": "En vue du coup suivant.",
        "24. Qd1 b6 25. Qb1 b5": "Évidemment, pourquoi n'avoir pas joué cela tout de suite au coup précédent. Un gars a le droit de changer d'idée.",
        "26. Qd3 b4": "Voilà la raison du changement d'idée. L'échange des dames n'est pas si mauvais pour les noirs.",
        "27. Qxa6 Rxa6 28. Nb1": "Ce cavalier va enfin pouvoir être plus utile. Nb5 était réfuté par Be7.",
        "28... Rac6": "De retour sur la colonne ouverte.",
        "29. Re3e2 Rc6c1 30. Kg2": "Sinon, les noirs jouent R(c8)c2.",
        "30... Rxe1 31. Rxe1 Rc2 32. Rd1 Rb2 33. Nd2 Bf5": "Il y a peu de choses que les blancs auraient pu faire pour empêcher de perdre du matériel supplémentaire.",
        "34. Nf1 Be4+": "Un petit coup intermédiaire avant de prendre le pion, pour bloquer la colonne e.",
        "35. Kg1 Rxb3 36. Ra1 Rb1 37. Rxa5": "Tour prend tour n'était pas mieux. Les pions passés noirs ne sont pas arrêtables.",
        "37... Bd3 38. Rxd5 Bxf1 39. Rd8+": "Nécessaire pour placer la tour noire sur une case noire."
    },
    "url": "https://gameknot.com/annotation.pl/d-fi-dalbert260648?gm=3099",
    "gameName": "Défi d'albert260648",
    "players": "albert260648 (1301) vs. guy04 (1790)",
    "opening": "English (A30), symmetrical, hedgehog system"
}