{
    "moves": {
        "1. e4": "Hey this is a game that i played for the 61st Gk Tournament, round 5. It was a strong match with a tough opponent. Comments about the game are really welcomed! So i played with black ( i like white more but what can i do?). The game started with e4.",
        "1... e5": "I played e5. I don't often play the sicilian cause e5 suits me better.",
        "2. d4": "And then d4. Nice though most prefer to play Nf3.",
        "2... exd4": "I accepted the challenge and took the pawn.",
        "3. Qxd4": "Typical reply.",
        "3... Nc6": "Open the knight and push the queen back.",
        "4. Qd5": "Instead he played Qd5. I think Qd1 is better.",
        "4... Nf6": "I open the other one knight. I wanted to develop all my pieces and hold a strong position.",
        "5. Qc4": "Again not the greatest position for his queen i think.",
        "5... Be7": "I wanted to castled and though the position is quite pathetic i think is the best.",
        "6. Nf3": "he developed the knight!",
        "6... O-O": "I castled and try now to develop the rest of my pieces.",
        "7. c3": "c3? Playing Nc3 or Bd3 is better i think.",
        "7... d5": "And now d5. Good move as i open the diagon for my bishop and also push the queen and the centre.",
        "8. exd5": "He took the pawn.",
        "8... Nxd5": "And i took it back with my knight.",
        "9. g3": "g3? For me it's a bad move but ok if he's gonna play then Bg2.",
        "9... Re8": "Still his king is exposed and i wanted to check and attack( generally).",
        "10. Nbd2": "He should have played Be2 i guess.",
        "10... Bc5+": "And check.",
        "11. Ne4": "He played Ne4. Maybe it was the greatest reply.",
        "11... Bb6": "I put the bishop back.",
        "12. Bg2": "Bg2? I think he's ignoring the threat coming from my rook.",
        "12... f5": "f5! I think that was strong!",
        "13. Nh4": "He's not castled yet.",
        "13... fxe4": "I took the knight and i should say i have a good position.",
        "14. O-O": "He castled after many moves he spent.",
        "14... Na5": "I push the queen. Nothing serious.",
        "15. Qe2": "He put it back.",
        "15... Nf6": "Now i want to protect the pawn so Nf6 would be a good move.",
        "16. Be3": "Exchanging bishops? I didn't care actually.",
        "16... Bg4": "Threatening the queen.",
        "17. Qb5": "Maybe Qc2 would be better.",
        "17... a6": "a6 for queen.",
        "18. Qa4 Be2": "I played Be2 for both rook and then queen.",
        "19. Rfe1": "Typical.",
        "19... Bb5": "Threaten his queen. I think he did not have a clear plan on his mind. And he's a piece down.",
        "20. Qc2 Nc4": "Open the knight. I wanted to be in square d6.",
        "21. Bf4 Bc6": "Protect the pawn.",
        "22. Rad1": "He's trying to attack to my queen. Good move.",
        "22... Qe7": "The best square i guess.",
        "23. b3 Nd6": "I put it back where i wanted.",
        "24. c4 Ba5": "Push thee rook.",
        "25. Re2": "Logical.",
        "25... Ng4": "Maybe i should have played another move.",
        "26. a3": "Now he wants the piece back.",
        "26... Nf7": "So i played Nf7 proteck both knight and bishop later.",
        "27. b4": "b4. Good move.",
        "27... Bb6": "Logical.",
        "28. Qc3": "Now he wants to push the g7 square.",
        "28... Qe6": "I played with my queen to prevent his knight move to f5.",
        "29. c5": "Typical to put my bishop back.",
        "29... Ba7": "Logical move. Now it's awkard there.",
        "30. Bh3": "He wants to push my knight. Good move.",
        "30... g5": "So i played g5 instead.",
        "31. Bc1": "Bad move i guess. f3 would be better for him.",
        "31... gxh4": "I took the other knight too.",
        "32. gxh4": "Logical.",
        "32... Qg6": "There my queen is in a strong position.",
        "33. Bb2": "Obviously that move is good but now i think it's too late.",
        "33... Ne3+": "Check.",
        "34. Kh1": "Only place to go.",
        "34... Nxd1": "I took his rook.",
        "35. Qd4": "Bad move again.",
        "35... e3+": "And anothe check in which he resigned. I hope you like my game!"
    },
    "url": "https://gameknot.com/annotation.pl/61st-gk-tournament?gm=35552",
    "gameName": "61st GK tournament",
    "players": "icemagic (1472) vs. mariodag (1558)",
    "opening": "Centre game (C22)"
}