{
    "moves": {
        "1. e4 e5": "Going to try the Scotch",
        "2. Nf3 Nc6 3. d4 exd4 4. Nxd4 Qh4": "That is different from most Scotch games.  Be interesting to see if he does Bc5 with an eye toward mate on f2.  Have defend the pawn for now.",
        "5. Nc3 Bb4": "pins the knight - Bd2 will lose the knight",
        "6. Qd3": "Queen is doing double duty and I dont like the queen being out this early",
        "6... Ne5": "got to move the Queen again",
        "7. Qe3 Bxc3+": "Qxc3 will lose the e pawn with a check . ",
        "8. bxc3": "so much for queen side castling\r\n",
        "8... Nf6 9. Bd3": "to defend the pawn that attacked twice",
        "9... Neg4": "This is ugly - 3rd time I have had to move the Queen",
        "10. Qf3 Nxh2": "? If I was Black, I don't know if I would have done Nxh2.  I thinking of sacficing the Queen if it will take the steam out of his attack.",
        "11. Qh3 Qxh3 12. gxh3": "Got rid of the queen and the knight is trapped. Nf3 won't work because of the N on d4. Ng4 wont work because of the h3 pawn. Nf1 obiviously wont work.  Castling could now be problematic because of holes in the pawn structure on both sides.\r\n",
        "12... O-O 13. Rxh2 Re8 14. f3": "got to defend the pawn.",
        "14... Nd5 15. Bb2": "moving the bishop over will give me a strucure that could allow Queenside castling\r\n",
        "15... d6 16. O-O-O Nf4": "H pawn is attacked twice",
        "17. Bf1": "one way to defend the pawn.  ",
        "17... c5 18. Nb5 Ne6": "d6 pawn appears to be free",
        "19. Nxd6 Rd8": "It would be nice if I could do some kind of discovered attack by moving the knight",
        "20. c4": "for some reason I was worried about Black advancing the b pawn",
        "20... Kf8 21. h4": "Wanted to free up the bishop and the rook from guarding the h pawn",
        "21... Nc7": "Not sure what Black is thinking",
        "22. Rg2": "Threatening the g pawn",
        "22... Bh3": "still the pawn is open if I take with the Bishop checking King",
        "23. Bxg7+ Ke7": "Nf5 will keep the checks going.  If I can't check, the rook is endangered",
        "24. Nf5+ Ke6": "Want to stack the rooks - think I can get a rook",
        "25. Rgd2 Bxf5 26. Rd2xd8": "The bishop will still be there",
        "26... Rxd8 27. Rxd8 Bg6 28. Bh3+ f5": "I beginning to think even swaps will be better for me.  Far enough ahead that clearing the board will help me.",
        "29. exf5+ Bxf5 30. Bxf5+ Kxf5 31. Rd7": "Black resigns. He can move the knight but I will get another pawn.  Too much of a material advantage for Black to overcome."
    },
    "url": "https://gameknot.com/annotation.pl/62nd-gk-tournament?gm=28884",
    "gameName": "62nd GK tournament",
    "players": "justnkase42 (1429) vs. pianofred (1642)",
    "opening": "Scotch (C45), Steinitz variation"
}