{
    "moves": {
        "1. d4": "this is a game i finished recently, I'm white.\r\nd4 is a common opening for me.",
        "1... h6": "I rarely see this move in my games so i wasn't familiar with the opening very much.",
        "2. Nf3 d6 3. e3": "I always hesitate to move my d or e pawns only up on space, I usually get my bishop locked in. In this game the middle hadn't developed much yet so I guessed that if I needed to move it I should have a better chance than normal.",
        "3... a6": "Apparently likes to move his a and h pawns early in the game.",
        "4. Bc4 Qd7": "hhhmmm, this is where i noticed him bringing his queen into battle too early in the game, although it may make your opponent feel unsafe, well....you'll see the problem with it soon.",
        "5. h3": "i didn't want a fork, but it really wouldn't be a good move for black anyway, what would it accomplish?",
        "5... Qa4": "As I suspected.",
        "6. b3": "in the next few moves starting now you will see the problem with advancing the queen too early.",
        "6... Qc6 7. Nc3": "trying to close in, I suspected black to retreat but he never did.",
        "7... Qb6": "Still moving his queen, advancing more pieces is difficult if you advance your queen too soon and allow your opponent to threaten her.",
        "8. Nd5 Qc6": "i thought he wanted a place to retreat, but....I guess not.",
        "9. a4 Be6": "Finally advancing!",
        "10. Nb4": "this where he could've retreated, but....",
        "10... Qe4": "....he didn't, either way I'd be in a better position(for a while, anyway).BTW, this was a huge blunder!",
        "11. Bd3": "As you can see, now his queen is gone, exam it yourself.",
        "11... Qc6": "Um, you'd think taking atleast a knight or bishop would help a little?",
        "12. Nxc6 Nxc6": "Apparently he wanted to develop more, but capturing would have been better anyway.",
        "13. O-O": "Now it's pretty safe to castle.",
        "13... Nb4 14. Be4": "threatening b pawn.",
        "14... O-O-O": "I think trying to castle king side would have been better, now his king only has pawns guarding him.",
        "15. c3 Nd5 16. Bxd5": "When i'm ahead early on(especially 9 points ahead),I like to make even trades for kinghts, I always feel uncomfortable around knights because of the threat of forking(even though many people say bishops are better). It's just something I felt couldn'ty hurt me right now.",
        "16... Bxd5 17. c4 Bxf3": "Not the best, now my queen can develop safely and even trades aren't necesarily the best when you've lost your queen(their can be exceptions of course).",
        "18. Qxf3 f6 19. Qf5+ Kb8": "Only move, right now I just needed to break through the queen side pawns, then I can do pretty much whatever i want(if I play right).",
        "20. d5": "Analyze black's position, he really doesn't have much to do.",
        "20... Rc8 21. a5 h5 22. e4 Nh6 23. Bxh6": "Reason: see 16.",
        "23... Rxh6 24. b4 g6 25. Qf3 h4 26. Rab1 Rh5 27. b5": "Now I'm getting somewhere.",
        "27... axb5 28. Rxb5 c6 29. Rb4 Bh6": "trying to squeeze his pieces through the hole he made :P",
        "30. Rfb1": "I'm really trying to push through there!",
        "30... Rc7": "would you have considered this the best move, I would, analyze it.",
        "31. dxc6 Ka7": "BAD move...",
        "32. Rb4xb7+ Rxb7 33. cxb7": "...as you can see.",
        "33... Kb8 34. a6 Ra5": "best move, i think.",
        "35. e5 dxe5 36. Qc6": "it's over, analyze it. I made a puzzle out of this.",
        "36... f5 37. Qc8+ Ka7 38. Qa8#": "Checkmate. I liked this game because it showed the way advancing your queen too early is costly."
    },
    "url": "https://gameknot.com/annotation.pl/64th-gk-tournament?gm=31139",
    "gameName": "64th GK tournament",
    "players": "chesswizz95 (1401) vs. zoumana (1294)",
    "opening": "Queen's pawn (A40)"
}