{
    "moves": {
        "1. c4": "c4, my standard and beloved opening move as white.",
        "1... Nf6": "Nf6 is a common counter for black.",
        "2. Nc3": "I'm preparing to play e4 next.  If my opponent plays 3...d5, I intend to transpose into a gambit position with 4. d4.",
        "2... g6": "Black plays g6 in preparation for the fianchettoed dark bishop on g7.  c5 would have been just as good, but in this case my opponent preferred the hyper-accelerated dragon.",
        "3. e4": "With e4, I establish control of the center early.  d6 is now dominated by the Knight on c3, as well as the c and e pawns.  Black must play baseline defense.",
        "3... d6": "d6 is a likely move.  Black anticipates the harassment of the f6 Knight with 4. e5.  ",
        "4. f4": "I prefer playing f4 early.  This enables the eventual Nf3 move with out blocking the f-pawn.  I love wide open pawns on the c-f files.  This creates an explosive advantage for white, opening up for rooks on the e and f files later on.",
        "4... c5": "A solid book move for black.  c5 challenges the d-pawn, and helps black take some of his own control of the center.  It also creates a good opportunity for a knight or dark squared bishop outpost on d4.",
        "5. Nf3": "Nf3 is the logical progression for white, followed by Be2...O-O.  The knight is key in defending the d4 and e5 squares.",
        "5... Nc6": "Black will impose his own Knight on the d4 and e5 squares, while developing a minor piece.  I'm not sure why Nc6 was selected instead of Bg7.  Black probably recognized that there was no hurry in moving the bishop to g7, because the tempo of my opening presents no imminent threats to the king side. ",
        "6. d3": "d3 is a conservative move.  It is not as sharp as d4, but it does open up the diagonal for the dark squared bishop as well as supports the c and e pawns.  Certainly Be2 would have allowed for castling king side on move seven, but since black delayed the fianchettoed bishop, I can linger with a more methodical opening.  I have played Bd3 on a few occasions, but it is a very unorthodox opening move and severely hampers the d-pawn, dark squared bishop--ultimately only creates problems.  The bishop will do fine on e2 temporarily.",
        "6... Bg7": "The expected move for black.",
        "7. Be2": "Preparing to castle...",
        "7... O-O 8. O-O": "After castling, I am now prepared to move into the middle game.",
        "8... a6": "Black plans to eventually play b5 after possibly Rb8, Qa5, or even a combination of Nd5 and Bd7.  This is the natural course of events that most defenders against this variation of the English will follow to foil whites control of d5.",
        "9. h3": "It will take another two moves for black to play b5.  This will give me a chance to create some problems of my own for black.  I intend to play g4, followed by g5, harassing the Knight on f6. h3 also creates an escape for my King later on and allows the protection of the fork on g3 if black plays Nh5...Ng3; in addition, it prevents the annoying Bg4.",
        "9... Rb8": "As I said before, black's design is to play b5 in hopes of distracting the pawn on c4 from the d5 square.  This really presents no immediate problem, however, because the d3 pawn will recapture on c4 if black threatens to take.  Of course, black could follow b5 with b4! threatening the Knight on c3, but such a move would only hyper-extend my opponent's resources.  At any rate, the threat of b4 is benign.",
        "10. g4": "Following through with my own intentions after playing h3.  If my opponent allows me to play f5, it will create trouble for his kingside.  Should black permit f5 to be played, it would behoove him not to capture with the g-pawn.  This is a designed attack, following that of many against the Sicilian Dragon in the past: crack open in the g and h files and reek havock on black's kingside!",
        "10... h5": "Black wishes for 11. gxh5, because my attack would fizzle out after 11...Nxh5.  Perhaps black also saw 11. g5 Ne8, 12. Kh2 Qd7, 13. Ng1 Bd4!...as advantageous.  In fact, he followed almost this exact move order.  But after 14. Rf3 Bxg1, 15. Qxg1...it was unclear to me how black proposed to continue his attach.  Instead black's light squared bishop would be incapacitated, which proved to be detrimental later in the game.",
        "11. g5": "I had already played through the posibilities in my mind.  11...Bxh3, 12. gxf6 Bxf1, 13. fxg7 fxe2, 14. gxf8+ Kxf8, 15. Qxe2... does not work out well for black.  Neither does 11...Bxh3, 12. gxf6 Qd7, 13. fxg7 Qg4+...because my king escapes by 14. Kf2 Qg2+, 15. Ke2... all is well.  The obvious next move for black then is Ne8.",
        "11... Ne8": "Black's best response to g5.  Nh7 would have been an elementary mistake.",
        "12. Kh2": "I have to protect the h-pawn from Bxh3.  I also open the g1 square for the f3 Knight in case black plays Qd7...",
        "12... Qd7": "I fully expected this move; however, as I discussed this was not a good developing move for black.  The light squared bishop has no where to go, and black's minor pieces are in poor shape.",
        "13. Ng1": "Simple enough, Ng1 provides another layer of protection for the h-pawn.  If black plays 13...Bd4, my response will be 14. Rf3...",
        "13... Nd4": "This move surpised me somewhat.  After black played Qd7, I fully expected him to continue with trying to break down my defense with 13...Bd4.  Perhaps my opponent realized after congesting his queenside, that Bd4 was a waste of time after 14. Rf3 Bxg1, 15. Qxg1...What black probably didn't expect after 13. Nd4 was my next move...",
        "14. f5": "My point in making this move was to release black's protection of the h-pawn.  It is possible that black saw 14. f5 gxf5, 15. exf5 Nxf5, 16. Bxh5...as a harmless exchange of material, but probably not.  More likely is that his analysis missed the hanging pawn on h5, should he capture on f5.",
        "14... Be5+": "Black is doing his best to prevent the potential entrapment of his fianchettoed bishop in the corner after I play f6.  I assume this wasn't so much a threat as much an attempt to keep his bishop active.  ",
        "15. Bf4": "This move actually helps me develope my dark squared bishop and gain tempo while I interpose.",
        "15... Nxe2": "Black probably expected 16. Qxe2, giving him the opportunity to play either 16...Bd4 attaching the Knight on g1 or 16...gxf5--Neither of which would have gained my opponent anything however, after I play 17. Be3..., or 17. Bxe5 respectively.",
        "16. Bxe5": "I prefer to eliminate the dark squared bishop and keep my own--I am placing black in decision mode.  He can either exchange the bishops or go for 16...Nxg1, 17. Bf4/Bg3 Nxh3.  Either scenerio works out well for me, because I keep an attacker with the dark squared bishop on his exposed kingside with the latter (even with the loss of material), and have good position with the former with a Knight outpost on d5.",
        "16... Nxg1": "So goes the plan: Black takes on g1.  Black may have expected my next move to be Bg3, but I had other plans...",
        "17. Bf4": "This I was hoping would eventually lure my opponent into playing gxf4, hanging the h5 pawn.  I reasoned that his line of thinking went something like this: he probably figured after 17...Nxh3, 18. Kxh3 gxf5, white wouldn't play 19. Qxh5, because of the discover check on 19...fxe4+!  My opponent was correct if he thought this, only my counter to this line was as tricky as his perceived plan of attack after gxf5--if not more dangerous.",
        "17... Nxh3": "My opponent plays the only move that preserves his material advantage.",
        "18. Kxh3": "I must take the knight on h3...it is after all, part of the psychology and strategy behind luring my opponent into capturing on f5.",
        "18... gxf5": "Black took the bait...I'm not sure what he expected me to do here, but he apparently saw the f-pawn as a freebie.",
        "19. e5": "??? Another free pawn?  Not quite.  I intended for black to capture the e-pawn, but if he played something safer, such as 19...Ng7, 20. Nd5 e6, 21. Nf6+!!!...is a disaster because of the Queen fork.  20...dxe5 is not good for black either after 21. Nf6+ exf6, 22. gxf6 exf4, 23. fxg7--Black must avoid check mate. I was hoping my opponent's analysis would be a little simpler than this, namely that he would perceive 19. e5... as a blunder on my part, and capture...",
        "19... dxe5": "...which he did.  ",
        "20. Qxh5": "I had to open the h-file while I had the chance.  This was my only chance at hoping for a game ending series.  I considered playing Nd5 here, but after 20...Ng7, my chances would for getting a checkmate became more complicated.",
        "20... exf4": "Black played exf4 here because 20...Qxf4, 21. Rf3...doesn't gain as much material.  At this point my opponent seemed completely oblivious to the impending danger.  The doubled pawns on the f-file sealed black's fate.",
        "21. Nd5": "Blacks pieces are crippled, and my knight on d5 is a monster! It threatens check on both e7 and f6.  Because of the doubled pawns on f-file, useless bishop on c8, and undeveloped rooks, black's demise is imminent.",
        "21... Ng7": "This is black's best defense.",
        "22. Qh4": "I had to keep pressure on the h-file.  I considered 22. Qh6...however, if black responds by moving his Queen to the sixth rank challenging my Queen (especially Qe6!), it presents a problem for me.",
        "22... f3": "My opponent understands that the f-pawns are hemming him in, so he decides to try gaining tempo with a potential discover check by 23...f4+.   ",
        "23. Kg3": "Kg3 prevents the discover check, and makes way for Rh1 followed by checkmate with Qh7/h8++.",
        "23... Qd6+": "My opponent hopes to keep something going with a series of checks.  23... f4+ may have kept things alive for a little longer after 24. Kf2 Nf5...",
        "24. Kf2": "I continue to allow black's f-pawn to work to my advantage rather than taking on f3 and opening the potential for checks on my king.",
        "24... Qe5": "An interesting move by black...My opponent is anticipating check on Qd4 and forcing a queen exchange...He is also eyeing the b2 pawn, a harassing check to keep his chances of surviving alive.",
        "25. Kxf3": "This was the decisive move that wins for me.  At this point I thought for certain black would play something like 25...Rb8, 26. Rh1 Ne6, 27. Nf6+! exf6, 28. Qh8++.  Instead...",
        "25... Qd4": "Black goes for a queen exchange, but misses...",
        "26. Nxe7#": "The knight mate on e7."
    },
    "url": "https://gameknot.com/annotation.pl/64th-gk-tournament?gm=28687",
    "gameName": "64th GK tournament",
    "players": "vicerosa (1768) vs. benjamin78 (1768)",
    "opening": "English opening (A16)"
}