{
    "moves": {
        "1. f4": "attempting my preferred one : bird opening",
        "1... c5": "that's to far for me ! I don't know how to play this defense with the bird, so Ed makes me worried from the beginning ! this game wont be easy. Does somebody know the name of this defense ?",
        "2. Nf3": "develop, prevent e5",
        "2... h6": "prevents Ng5",
        "3. e3": "being prudent, opening f1/a6 diagonal for LSB ...",
        "3... a6": "...closing my LSB diagonal ! Ed is not going to give the game easily",
        "4. Bc4": "threat to f7...",
        "4... e6": "... preventing the threat !",
        "5. O-O": "being safe",
        "5... Qc7": "ok, this is really not a common game for me, what is this queen doing there ? for me it's a a complete mystery !",
        "6. Nc3": "in case of",
        "6... b5": "of course ! now i have to be careful",
        "7. Be2": "prudent, this game sounds dangerous",
        "7... Nf6": "now i should anticipate something on e4, so it would have been preferable to keep the d pawn or maybe just moving d3. But I didn't ! (that's why I'm just 1346) ",
        "8. d4": "I hope he will exchange pawns so I retake with the f3 knight...",
        "8... Bb7": "BUT NOT ! of course, I'm challenging a strong one",
        "9. dxc5": "this was a nice white MISTAKE, it allows the black DSB to develop and occupy a strategic place c5",
        "9... Bxc5": "bad situation for white, but if there should be a moral lesson to bring out with this game is the following : hold on, never give up. (You will find a nice irreversible mate at move 19).",
        "10. a3": "to repulse the bishop :  i know that he will just retreat to b6, but it will help me anyway to occupy the queen side and resist to black in this board area",
        "10... O-O": "castle",
        "11. b4": "go away bad bishop !",
        "11... Bb6": "I'm still in very bad situation",
        "12. Bb2": "this is interesting, at least that's what I thought, because if I exchange my DSB with the f6 knight, the black castle will be opened and it will give good  chess opportunities BUT ...",
        "12... Bxe3+": "...but it was a BLOODY BLUNDER because now I'm going to loose 2 pawns !",
        "13. Kh1 Bxf4": "nothing can protect my little castle....",
        "14. Bd3": "Nothing, apart leading  a good attack ! The first problem is that I don't now where to put the knight. So have to free up some place to it. And taking the D3/H7 is a good preparation to a mate, this LSB will be crucial for the future...",
        "14... d5 15. Ne2": "repulsing the bishop in F4 first, but there is a blow hidden, and this will give me the victory, do you see it ?...no ?....really ?...So Go further !",
        "15... e5": "Not good enought because the plan is to exchange my DSB with the f6 black knight. So after taking Ne2xf4, e5xf4, and then the way is free to attack the black castle",
        "16. Nxf4": "ONE...",
        "16... exf4": "TWO...",
        "17. Bxf6": "THREE !!! the victory is in my hands",
        "17... gxf6": "Maybe it would be preferable not to retake ...",
        "18. Nd4": "It block the b7/g2 diagonal and free the way for my queen in order to go to H5. then the mate will be forced",
        "18... Kh8": "was it the best response ?",
        "19. Qh5": "NO, black resign.Thanks for comments, sit help a lot. "
    },
    "url": "https://gameknot.com/annotation.pl/666-the-number-of-the-beast?gm=47755",
    "gameName": "666 the number of the beast !",
    "players": "31415 (1346) vs. edthelad (1666)",
    "opening": "Bird's opening (A02)"
}