{
    "moves": {
        "1. e4": "Hello everyone, and now I will annotate a game played recently between 2 C level players on GK.\n\nSo white plays e4.",
        "1... c5": "black plays c5, the Sicilian defense. This is the most popular reply to e4, and the most theoretical. There are hundreds of important lines in the open sicilian(Nf3), and only a player who has a very good memory and lots of study time will be able to learn the open sicilian.",
        "2. Nf3": "Nf3. White goes for an open sicilian.",
        "2... d6": "the d6 variations. This can usually go into a najdorf or dragon after d4.",
        "3. Bc4": "instead, white chooses Bc4, a perfectly reasonable choice. The bishop is active, and white can bring out his other pieces easily. ",
        "3... h6": "I'll give this a ?!, for a dubious move. Black needs to get on with his development. I suggest Nc6. Instead, h6 deprives the dark squared bishop of the square g5, when it has an equally good square at f4.",
        "4. h3": "This does have a purpose, denying the black light bishop g4, and when white's dark bishop goes to f4, it can get tucked in at h2. This does not develop however, but I will not give it?!.",
        "4... Nf6": "A perfectly good choice. ",
        "5. d3": "protecting the pawn while opening a diagonal for his bishop. ",
        "5... Nc6": "Now both players are developing their pieces.",
        "6. Bd2": "A dubious and passive move. The bishop is much more effective at f4. Maybe white didn't like e5,but that weakens d5 severely. Even if white doesn't know what to do with this bishop, he could move the knight with Nc3.",
        "6... e5": "I don't like this move at all. It clamps on d4, but that square isn't an outpost. It severely weakens d5, and a piece may find a permanent home there later in the game.",
        "7. a3": "A waste of time. Better is 0-0 or Nc3.",
        "7... Be7": "An OK move here.",
        "8. O-O Bxh3": "A big mistake. Less experienced players consider to be good, since taking the bishop ruins the kingside structure and exposes the king. However, these moves are only good if black has adequate forces to attack the king after it's pawn structure is shattered.",
        "9. gxh3": "And here, with the sacrifice of a bishop, black has blasted open the g file. But whose g file is it? It's white's g file, which means he can play Kh2 followed by Rg1, when the sacrifice only helped white's rook, and the king is hard to attack. At this moment, white is up a bishop, and black has not nearly enough compensation.",
        "9... g5": "the idea of this is right, open lines to attack. Black may include the h8 rook into the fight, but again, if white defends well, then he will get a big advantage. ",
        "10. Nc3 Nd4": "taking the post and remaining a piece down.",
        "11. Nxd4 cxd4": "here we see the doubled d pawns, but these are actually good for black, as they can't be attacked easily, the d4 pawn gets space, and the c file is open.",
        "12. Nd5": "now the weakness of the d5 square is apparent.",
        "12... Nxd5 13. Bxd5": "the bishop is well placed here. It cannot be driven away.",
        "13... Qb6 14. b4 Qb5": "At this point black can ask himself: What do I get for the bishop? almost nothing. The \"attack\" he imagined has not come simply because there are no pieces to participate in it.",
        "15. Qh5": "the queen is advanced and very active here.",
        "15... Rh7 16. Kh1": "yes. he can now prepare Rg1 and h4 sometime.",
        "16... Qd7": "just moving around. Black's pieces really have nothing to do.",
        "17. c4": "Fine move! White increases his space on the Q-side.",
        "17... Rb8": "If black wants b4, he will have to get the b pawn out of the pin.",
        "18. Rfg1": "most of white's pieces are rather active and have some good prospects.",
        "18... Qa4": "maybe black intends to penetrate to c2, causing some minor positional problems.",
        "19. Qd1": "right now, trading queens would favor white.",
        "19... Qd7 20. Qh5 Qa4 21. Qd1 Qd7 22. b5": "A triple ??? blunder. White, who has an easy win, probably asked himself: Why did my opponent make this move? instead of: What are all the things black intends to do with this move? white probably thought black wants to repeat the position or is just getting out of the queen trade. But he missed a minor detail. Before, I would score the position 4, because of white's material and positional advantage(bishop pair, more active pieces, more space). Now it is Mate(1)",
        "22... Qxh3#": "mate!"
    },
    "url": "https://gameknot.com/annotation.pl/67th-gk-tournament?gm=32933",
    "gameName": "67th GK tournament",
    "players": "victorl (1553) vs. adrian21 (1567)",
    "opening": "Sicilian (B50)"
}