{
    "moves": {
        "1. e4": "A game that shows (again!) the importance of never giving up!",
        "1... e5 2. f4": "King's Gambit. This has a reputation for leading to bloody combat.",
        "2... exf4 3. Nf3 g5 4. h4 g4 5. Ne5": "Kieseritsky Gambit, the most common variation. (White can also try 5. Ng5!?, the Allgaier, but then 5... h6 forces him to give up the knight, and things get complicated.)",
        "5... Nf6": "Main line. Black defends the g4 pawn, though White can still take it, so I'm not really sure why this move is recommended, especially after this game.",
        "6. Nxg4": "Instead 6. d4 d6 7. Nd3 is the main line. That said, I can see why White prefers to take the pawn. Black's pawn structure is fractured, and the f4 pawn seems doomed. (Though in this game... but let's not get ahead of ourselves.)",
        "6... d6 7. Nxf6+ Qxf6": "In return for the loss of his pawn structure, Black gets a slight lead in development, not just through having the queen out, but also because the d-pawn has been moved while White's has not.",
        "8. Nc3 Nc6 9. Nd5": "It seems like this is a case of a \"too obvious\" move: it's most common in the GameKnot DB, but the statistics favour Black, whereas 9. Bb5 is both more favourable to White and more common in the World DB. That said, the move worked spectacularly in this game...",
        "9... Qh6": "...because I was too fixated on protecting the f4 pawn as long as I could. Perhaps the moral to be drawn is, before choosing a move, press the \"flip\" button on the analysis board at least once. No way I'd have missed it if I'd done that.",
        "10. Nxc7+": "The classic knight fork. Rather embarrassing for a player of my rating.",
        "10... Kd8 11. Nxa8 Be7": "Okay, I've lost the rook, but in my favour, White's knight is stuck and his queenside pieces are still undeveloped. It seems I may still have a chance of pulling off a swindle if I can develop rapidly. First, this move threatens 12... Bxh4+ 13. Ke2 (neither Rxh4 nor g3 helps much) Bg4+ winning the queen.",
        "12. h5": "The most obvious defence, but perhaps 12. Be2 Bxh4+ 13. Kf1 could be considered. It gets the bishop into play and creates the possibility of the strong move Bg4; losing the pawn doesn't really matter, and my bishop will be pinned if I take it.",
        "12... Rg8": "One more piece out, this time without any specific intentions, since Bg4? will simply be answered by Be2.",
        "13. c3": "Nevertheless, White hits the panic button, opening a line for the queen. But this does nothing to help his development. Instead, perhaps still Be2, or d3 to let out the other bishop?",
        "13... Qg5": "Now 14... Qg3+ 15. Ke2 Bg4+ is threatened, again winning the queen. (Oops... it would probably have been stronger to make that threat last move.)",
        "14. Qb3": "White saves the king and gives his king a flight square, and possibly is already thinking of putting pressure on b7.",
        "14... Qg3+": "Nevertheless, this is still the best move. I've seen the possibility of a swindle...",
        "15. Kd1 f3": "...and here it comes! If White takes, 16. gxf3 Qxf3+ wins the rook, as well as leaving White behind in development and with an exposed king. But if White doesn't take, Black is threatening 16... fxg2 17. Bxg2 Qxg2 18. Re1 Bh4 19. Re3 Bf2 and the rook has no squares. What's to be done? 16. Rg1 doesn't work: 16... Bg4! and the g2 pawn is still pinned and Black is now threatening a lethal discovered check. Note that the \"doomed\" f4 pawn I decided to protect finally comes into its own!",
        "16. Rh3": "So White tries this counterattack on the queen instead. Did he notice that h3 is attacked by the bishop? I did, but I reasoned that after 16... Bxh3 17. gxh3 the f3 pawn is going nowhere. So....",
        "16... fxg2": "Yup, a queen sacrifice when I'm already a rook down. It sounds good when put like that, but of course, since 17. Rxg3 gxf1(Q) 18. Kc2 Rxg3 leads to Black being ahead on material (and the threat of Qd3+ will force White to give up his queen) it's all a bit too obvious.",
        "17. Bxg2 Bxh3": "Now things get more interesting.",
        "18. Qxb7": "If instead 18. Bxh3 Qxh3 19. Qxb7 then Black has 19... Qc8 and wins the knight, regardless of whether White accepts the queen exchange or retreats. So White must take the plunge, abandoning the g2 bishop....",
        "18... Bxg2": "...but can Black afford to take it? I decided I could, even though my king comes in for a few checks!",
        "19. Qc7+": "Definitely better than taking the knight: I had in mind a neat clearance of the diagonal, 19. Qxc6 Qf3+ 20. Kc2 (Ke1?? Qf1#) Qxe4+ 21. Qxe4 Bxe4+ 22. d3 Bxa8.",
        "19... Ke8 20. Qc8+": "(?) This is a mystery: why not 20. Qxc6, now that the knight can be taken with check? Black should still win, with care: 20... Kf8 21. Qc8+ Kg7 22. Qd7 (for instance) Qf3+ 23. Kc2 Qxe4+ 24. d3 Qe2+ 25. Kb3 Rxa8 and Black has kept the extra piece. But the move played makes it too easy.",
        "20... Nd8 21. Nc7+ Kf8": "Now White has no more good checks.",
        "22. Qf5 Qf3+ 23. Qxf3 Bxf3+": "White resigns. After 24. Kc2 Bxe4+ the h5 pawn will drop as well, leaving Black a piece up; while if 24. Ke1 Bh4+ 25. Kf1 Bxe4 White must lose time (and again will not save the h5 pawn) due to the threat of Bd3#. Bad luck for White, but a very dramatic and exciting game!"
    },
    "url": "https://gameknot.com/annotation.pl/69th-gk-tournament?gm=31610",
    "gameName": "69th GK tournament",
    "players": "greg_johnstone (1621) vs. nuntar (1693)",
    "opening": "KGA (C39), Kieseritsky, Berlin defence, Riviere variation"
}