{
    "moves": {
        "1. Nf3": "Hey hey all, Kenneth has been nice enough to offer me some chess coaching, which basically translates into him beating the crap out of me repeatedly. he asked me to annotate one of the games where i replied to him i feel like ill be making excuses lol. and there are no reasons for just plain sucking and playing very carelessly from like move 3.",
        "1... c5": "and so even though this is a loss it took a while for me to make the game losing mistake so lets play through it and then after my mistake maybe it was possible to recover the position. this will most likely also serve to see if im learning anything.",
        "2. c4": "this is the first game i open with the sicilian against Kenneth. we also have been alternating colours everygame, one thing  for sure is that playing against kenneth you cant go off into too much creative play from too early on or he will punish you quickly.",
        "2... Nc6": "biggest mistakes in my first games was trying to play too defensively. or trying to be too creative which just equaled bad play and none of the \"expected\" results. i believe in this game it was a touch of too much defense that might have caused my demise also.",
        "3. Nc3 Nf6": "and after this position Kenneth took the time to say this had been the most symmetrical game we had played so far. I was wondering if that comment was meant to affect my gameplay :D to see if i would venture off into creative gameplay. \"I won't over extend now i told myself\"",
        "4. g3": "he fianchetto'd a Bishop in every single game we've played so far. I face alot less of these types of situations and this raises my discomfort level alot during mid game. at this stage is when i think i started to focus too much on his LSB and started playing around defending that diagonal.",
        "4... d6": "here i was hesitating to play g6 and do the same with my DSB and his comment of symmetry inticed me to play this.  so Good job if that was your plan Kenneth :D  my first question would be: wouldve G6 have been better or was also an a6 playable here? i thought i could wait to play Bd7 when he plays Bg2 and moves his F knight too thinking i could use those 2 future moves to play other moves.",
        "5. Bg2": "theres the Bg2 told myself i can wait for the knight to move before loading my LSB",
        "5... h6": "and so here my thought is it cramps his F knight and i can possibly play g6 or g5 later on. this will also restrict his DSB i thought.  i was trying to formulate a plan to fight for the dark squares at this stage. but this leaves me vulnerable right side and was thinking i might have to leave those 2 pawns on white squares which is bothersome.",
        "6. d4": "comes forward. ",
        "6... cxd4 7. Nxd4": "i exchange and this recapture is natural. but swaping out knights would be losing alot of tempo to white as black. and as i told myself earlier when he had played his Bg2 and moved his F knight was the time to play my LSB to Bd7",
        "7... Bd7": "and so!",
        "8. O-O": "after his castle is where the game deciding moments have come for me. i have to look to castle. either via playing e6 g6 or g5.  or i can try to solidify my structure with a6 at this stage.",
        "8... g5": "i chose for g5. Kenneth told me g6 was stronger. i know the benefits of g6 to keep off Queens or LSB's from h5. but i told myself all his pieces are heading queen side. cramping his DSB was more beneficial and i doubt he will use the tempo to play his E pawn was my thought. and this also compliments my battle for dark squares i thought.",
        "9. Be3": "i thought he would reply this, i think my first anticipated reply by him.",
        "9... Bg7": "i decide to develop my Bishop and now i can castle.",
        "10. c5": "offers a free pawn. but it can lead to an exchange of queens having not castled yet. letting him take detaches my C pawn. ",
        "10... d5": "and so i thought this was stronger. temporary pawn gambit but keeps alot of the views blocked for all his attacks.",
        "11. Nxd5 Ng4": "my goal was to get his DSB for a while and this move opens up the view for my DSB also. i thought it was fitting.",
        "12. Qd3": "anticipated reply.",
        "12... Nxe3": "but i can still take. taking with queen or knight leaves with a bad exchange for white. ",
        "13. fxe3": "He recaptures and says forced. i was pleased with myself. i can see the pressure on f7 now though",
        "13... O-O": "so i finally castle and my king i thought looked quite safe considering alot of his pieces are queen side.",
        "14. Rad1": "stacks the rook down the line. ",
        "14... e6": "here i think was a mistake blocking my LSB in. but i thought it greatly restrained his Knights movements. forces him to retreat his D5 knight to c3 also. Maybe a6 was now the time to be played instead. ",
        "15. Nc3 a6": "and so after his retreat where he didnt reply unanticipated with something else than nc3 i thought a6 was finally playable.  and i switched my battle from black squares to white squares having taken off his DSB earlier.",
        "16. Ne4": "hes coming for d6 i have to look for sometype of defense or counter pressure.  moving any of my pawns doesnt look wise. ",
        "16... Qc7": "i chose to play queen here instead a5, but maybe to Qa5 was playable as it would also create pressure on his c pawn and the A pawn at same time",
        "17. Nd6": "comes down with his knight.  at this stage i believe my best option was to play nxd4 letting him reconnect his pawns but sealing his queen and rook behind it for a few turns.",
        "17... Nb4": "but i chose to liven the game up!",
        "18. Qc4": "was expecting here or maybe on b3 and then Kenneth also asked if i knew playing this move would liven the game up.  i told him \"ya\", but not knowing to which extent lol",
        "18... Nd5": "and i wanted to be able to put my LSB on c6 was my plan here but these 2 mistakes are really gonna cost me. i was thinking to myself at this stage i shouldve just played it simple and done nxd4 2 moves ago",
        "19. Bxd5": "and so he recaptures and gets another pawn up in the exchange",
        "19... exd5 20. Qxd5": "looking rough now. im slowly getting dismantled. pressure has appeared everywhere.",
        "20... Be6": "big mistake overlooking his knight in quickplay.  again me not taking nxd4 earlier comes back to haunt me right away. sigh! another game down the drain really thought i had a great start in our 6th game lol.",
        "21. Nxe6 fxe6 22. Qxe6+ Kh8": "Kenneth asks me if i considered kh7. in all honesty i didnt. I thought that keeping my king on a black square was preferable. but then again at this stage with all avenues to my king open for his rooks and his knight ready to jump into action. 0 pawns to protect my king and pieces. its looking grim.",
        "23. Nf7+ Rxf7": "give him the rook",
        "24. Rxf7 Qxc5": "and so i thought this would help relieve stress",
        "25. Rxg7": "gives me back the rook right away. i told him \" i didnt think you would be so nice as to give it back right away\" sarcastically. ",
        "25... Kxg7 26. Rd7+": "and mate in 2.  i resigned and we are off to the 7th lesson. i would appreciate comments on most likely all my moves hahaha."
    },
    "url": "https://gameknot.com/annotation.pl/6th-lesson?gm=59408",
    "gameName": "6th lesson!",
    "players": "kenneth_fiore_3 (1948) vs. trixstermtl (1524)",
    "opening": "Reti opening (A04)"
}