{
    "moves": {
        "1. e4 e5": "This is horrible. Black should've played Nf6. Black is simply creating the same weaknesses as White, while White has the tempo.",
        "2. Nf3": "Baker sometimes experiments with gambits like f4 and d4. I wouldn't touch those positions and prefer to stay away from them. I like slower positions that arise from Nf3 Nf6 play.",
        "2... d6": "The philidor defense is different than the customary Nc6. Rather than developing while defending, Black solidifies his structure while preparing to develop his queen's bishop.",
        "3. d4": "Classic Baker move, to open the centre IMMEDIATELY",
        "3... exd4": "Black's better options were probably Bg4 or Nd7. Opening the center when you're behind in development is asking to get abused, like my friend did to this guy",
        "4. Bc4": "Rather than wasting time recapturing, Baker brings out his forces immediately and doesn't give a damn about the pawn",
        "4... c5": "Stunned by Baker's move, this guy immediately questions Baker's intentions, like \"why the hell didn't he take my pawn? I better hold onto it\" But he doesn't realize that c5 weakens his position, and he is wasting valuable time when he should be developing.",
        "5. c3": "This was Baker's intended sacrifice when he chose to ignore the pawn.",
        "5... dxc3 6. Nxc3": "Baker considered castling instead, and giving Black the chance to play cxb2 winning another pawn, but he said that by simply capturing with the knight, he already has more than enough compensation for the pawn, even if it doesn't look like much now.",
        "6... h6": "Black was too worried about Ng5, that he made this totally losing mistake. Nc6 was much better, since after Ng5, Black just plays Ne5.\r\nBe7 also stops Ng5, but it allows Qb3!! and Black is lost.\r\nWhy is h6 so bad? This weakens the g6 square, and the only other piece left defending g6 is the f-pawn, so........",
        "7. Bxf7+": "Baker removes the only defender of g6 to capitalize on that weakness, even if he has to sacrifice a piece while doing it.",
        "7... Kxf7": "Now it may look like Black is up a bishop for nothing, and the g6 weakness seems insignificant.",
        "8. Ne5+": "Now suddenly, Black's king must find an escape square, and Baker has many tactics revolving around g6. \r\nLike if Ke8, then Qh5  will mate Black. \r\nIf Ke7 then Ng6  wins back a rook leaving Baker up the exchange. Neither tactic would work if g6 was guarded.",
        "8... Kf6": "Black is forced to go deeper into White's territory, but must watch out for 8...Ke6 9.Qd5  Ke7 10.Qf7#.\r\nAnd 8...Ke6 Qd5  Kf6 Qf7  Kxe5 f4  Kd4 Qd5# is also mate, so Black's eighth move is the only one that isn't immediately losing. Although Baker was still totally winning after Black blundered h6????",
        "9. Qf3+": "Now Black's in trouble, because Kxe5 is forced here",
        "9... Kxe5": "Although Black is now up an entire knight plus an entire bishop, his material advantage is insignificant due to the fact that none of his pieces are developed.\r\nExcept his king!",
        "10. Qf7": "When you have your opponent where u want them, don't let them go. Here Baker seals off the king's escape square e6, so Black's king is stuck in the centre. If Baker had played anything but Qf7, then Black would escape back into his own territory, and his two extra pieces will become active later.",
        "10... Nf6": "Baker was threatening f4  Kd4 Qd5#, so Nf6 blocks d5 from mate.\r\nBlack could also try to escape with 10...d5 (intending Kd6), but Baker has Bf4  Kd4 O-O-O  Kc4 then Rxd5 totally wins since White's threatening Black's queen, and also threatening Rd4   Kxd4 Qd5#.",
        "11. f4+": "Black's king is getting tortured more.",
        "11... Kd4": "only legal move",
        "12. Ne2+": "Baker says this move is absolutely necessary, otherwise Black would play c4 and escape back to his territory with Kc5.",
        "12... Kxe4": "If Kd3, then Baker castles which threatens Rd1  Kc2 Rd2# and Black would have to take the pawn anyway to avoid the threat.",
        "13. O-O": "Now White still has a direct mating threat of Ng3  Kd3 Rd1  Kc2 Qb3# Baker just needed to get his rook in the game.\r\nHow can Black defend? If 13...Kf5 then Baker has mate in 7 (Ng3  Kg4 Qg6  Kh4 Nf5  Bxf5 g3  Kh3 Qxf5  Ng4 Qh5  Qh4 Qxh4#) although I'm not sure if the guy saw that.",
        "13... c4": "Black's only chance to escape is to try and create escape holes.",
        "14. Rd1": "It wouldn't have made a difference if Black played d5 instead of c4, because reguardless, Black's escape path is still blocked. I'm threatening Ng3#. And if Nh5, then Nc3#",
        "14... Kf5": "Black realizes he can't escape through the centre, and tries to run like hell, consequently losing to the mate in 7 Baker planned earlier.",
        "15. Ng3+ Kg4 16. Qg6+ Kh4 17. Nf5+ Bxf5 18. g3+ Kh3 19. Qxf5+ Ng4 20. Qh5+": "Black resigned since he's mated next move.\r\nIn material, Baker is down two knights and a pawn, but in attacking potential, Baker is up a queen and rook.\r\nIt's how you use your pieces that's important, not how many you have."
    },
    "url": "https://gameknot.com/annotation.pl/la-open?gm=6185",
    "gameName": "LA Open",
    "players": "Baker (18??) vs. Twain Vinecour (18??)",
    "opening": "Philidor (C41), exchange variation"
}