{
    "moves": {
        "1. e4 c5": "Sicilian",
        "2. f4": "Grand Prix Attack",
        "2... d5": "This seems to be blacks best counter to the Grand Prix according to the db... though the next move seems to favor white.",
        "3. Nf3": "Largely ignored because of the pawn sacrifice but, perfectly sound.",
        "3... dxe4 4. Ng5": "White's other option Ne5 doesn't attack anything, so this move is slightly more preferred. ",
        "4... Nf6": "Defensive black tries to hold onto his advantage.",
        "5. Bc4": "This move puts pressure on f7.",
        "5... Bg4": "Bg4?! I believe now after playing this line over the course of the annotation project and this game, that black's 5th move should actually be e6 because the queen sacrifice seems devastating.",
        "6. Qxg4 Nxg4 7. Bxf7+": "This move is key for white so the game can be balanced.",
        "7... Kd7 8. Be6+": "Gets the second piece for the queen.",
        "8... Kc7": "A move that I make in light of master Freddy and Chessmaster.",
        "9. Bxg4 Qe8": "Qe8 the best option Black has a possible Kc6 or Kb6 but since black is going to move there in the next move might as well do this first. ",
        "10. Ne6+ Kb6": "Kb6 not necessarily the best move preferred by Freddy but Chessmaster actually plays Kc6 here.",
        "11. b4": "b4 is an interesting sac followed up by c3 sacrifice may be strong.",
        "11... cxb4": "Accepting the sacrifice.",
        "12. d3": "d3?! at the time I got bad vibrations form Qg6 and felt that it was horrid when in fact it is very strong.  line might follow.  12... Qg6 13. Be3+ Ka5 14. Ba3 Nc6",
        "12... h5": "h5?! because of Qg6.  My plan was to play Rh6 and exchange Rook for knight.",
        "13. Bf5": "Interesting response almost asks for Qf7 though Qf7 my opponent felt that white gains a slight edge.",
        "13... Qf7": "I feel this move isn't bad per say but significant problems will come form it 13... Rh6 continuing my plan may have been better.",
        "14. Be3+ Ka5 15. a3 Rh6": "Rh6?? this loses a queen.  b3 is more than likely the only move.",
        "16. axb4+": "This move forces the king to come to either b5 or b4 both lead to the same so might as well get a pawn.",
        "16... Kxb4 17. Bc5+": "Bd2+ may have the same result with less lose of material.  17. Bd2+ Kb6 18. Nc3+ though now the king can come to b6 it still must come to c6 after Rb1+ for Ka6 Nc5# ",
        "17... Kb5": "Forced",
        "18. Nc3+": "forces the king to c6",
        "18... Kc6": "Forced",
        "19. Nd8+": "To be honest when I played Rh6 I foresaw my king coming to c6 however I did not see Nd8+! winning the queen.",
        "19... Kxc5": "Not much else I can do... but now I have a problem after Nxf7 I can't play Rf6 for it loses a rook after 21. Nxe4+ Kd5 22. Ra5+ now the king is forced back and white goes onto an easy win.  My Rook on h6 can no longer anchor there as well because Nf7 threatens it.  So I resign knowing I'm going to be down a piece + position."
    },
    "url": "https://gameknot.com/annotation.pl/landslide?gm=24990",
    "gameName": "Landslide",
    "players": "ionadowman (2064) vs. yoshark (1476)",
    "opening": "Sicilian (B21), Grand Prix attack"
}