{
    "moves": {
        "1. Nf3 c5 2. e3": "1.Nf3 \tc5 \r\n2.e3!?  \t...\r\n\r\nA conservative choice and a move sequence very seldom seen. I was hoping to take 9K out of its book while playing solid moves.",
        "2... Nc6 3. c4": "We now head towards a sort of offshoot of an opening known as Qween's Gambit Declined.",
        "3... Nf6 4. d4 d5": "3. ...\tNf6 \r\n4.d4 \td5?! \r\n\r\nThis was a very pleasant surprise to me because it should lead to White’s domination of the center. A better move was 4…cxd4 which leads to conventional variations.",
        "5. cxd5 Nxd5 6. e4": "5.cxd5 \tNxd5 \r\n 6.e4!  \t...\r\n\r\nWith this advance, white seizes control of the center with gain of time.",
        "6... Nf6 7. d5": "6. ... \tNf6  \r\n7.d5(?) \t...\r\n\r\nThis marks the first moment in the match when I could not restrain my aggressive impulses.  Although this move is not necessarily bad, it demands very accurate play from White. A simpler way to play was 7 e5 which gives White an advantage in space without any tactical headaches.",
        "7... Nxe4": "7 ... \tNxe4! \r\n\r\nOf course I had reckoned on this possibility when playing my 7th move, but I had misjudged my chances. I should pull in my horns now and play 8 Nc3! Nxc3 9 bxc3 Nb8 10 Ne5 and white has good play in return for his pawn investment.",
        "8. dxc6 Qxd1+ 9. Kxd1 Nxf2+ 10. Ke1 Nxh1": "8.dxc6 \tQxd1  \r\n9.Kxd1 \tNxf2  \r\n10.Ke1 \tNxh1 \r\n\r\nA critical moment in the game. White has some very tempting continuations here. Originally I had planned 11 Bb5 b6 12 c7  Bd7 13 Ba6 e6 14 Bb7 Rc8 15 Bxc8 Bxc8 15 Kf1. The end result will be that Black will lose his knight on h1 but will have three healthy pawns and a solid position to offset his piece deficit. \r\n\r\nAlso worth considering were 12 g3 or 12 g4 to play for Bg2 and the quick capture of Black’s cornered knight. But in that case, Black would boast of 3 pawn and a rook vs two pieces - a very favorable material count for the second player. \r\n\r\nInstead of playing either of these sensible continuations, I went in for a long-winded tactical line that results in a pawn plus ending for CM9k.",
        "11. cxb7 Bxb7 12. Bb5+ Kd8 13. Ne5 Rg8": "11.cxb7?\tBxb7 \r\n12.Bb5  \tKd8 \r\n13.Ne5 \tRg8! \r\n\r\nCM9k starts a brilliant defense. Every move from here to move 20 is now forced. 9K uses the tactical device called \"the pin\" to reach a superior ending.",
        "14. Nxf7+ Kc7 15. Kf1 g5": "14.Nxf7  Kc7 \r\n15.Kf1 \tg5!!  \r\n\r\nA very important move. This pawn push removes the possibility of White playing Bf4  and so stifles his development. After this move I went into “bailout” mode and where I was once playing to win, I now was playing to draw.   \r\n\r\nI could foresee entering an ending a pawn down, but I felt that my superior pawn structure might save the day. Still, I was getting that queasy feeling that is associated with unexpected and unpleasant developments.",
        "16. Kg1": "16.Kg1 \t...\r\n\r\nWhite cannot waste time. I must play to capture the trapped knight",
        "16... Bg7 17. Nc3": "16. ...\tBg7 \r\n17.Nc3  \t...\r\n\r\nIf White grabs the knight with 17 Kxh1, he suffers from back-rank problems after 17…Rgf8 19 Bc4 Rxf7! 20 Bxf7 Rf8 with the end result being that Black recoups the lost material with interest.",
        "17... Raf8 18. Bc4 Nf2": "17. ...\tRaf8 \r\n18.Bc4 \tNf2!  \r\n\r\nCM9k gives a clinic demonstrating how to exploit of a pin for profit.",
        "19. Kxf2 Rxf7+ 20. Bxf7 Rf8 21. Be3 Rxf7+ 22. Kg1 Rf5 23. Rc1": "21. ...\tRxf7  \r\n22.Kg1 \tRf5 \r\n23.Rc1?!\t...\r\n\r\nIn hindsight I should have played 23 Rf1 at once, although 9K has a strong continuation available in 23…Re5 24 Rf7 Bf6! [better than 24…Rxe3] 25 Bf2 Kd7! 26 Rxh7 Rf5 because the White rook is out of position.",
        "23... Bc6 24. Rf1 Re5 25. Rf7 Rxe3": "23. ...\tBc6! \r\n24.Rf1 \tRe5 \r\n25.Rf7 \tRxe3 \r\n\r\n25…Bf6 26 Bf2 Kd7 is also good.",
        "26. Rxg7 h6 27. Kf2 Re6": "26.Rxg7 \th6 \r\n27.Kf2 \tRe6!  \r\n\r\n  Black has an extra pawn and very well placed pieces and king. His only problem is the fractured pawn structure. 9K plays to steadily improve the position of his king and rook while keeping an eye on stopping White's counter-play.\r\n\r\nWhite’s knight is totally dominated by Black’s bishop here which pretty much kills all thoughts of meaningful counter-play.",
        "28. g3 Kd7 29. Rg8 Rf6+ 30. Ke2 g4": "28.g3 \tKd7 \r\n29.Rg8 \tRf6  \r\n30.Ke2?! \tg4!  \r\n\r\nSuddenly 9K has the strong plan of swinging its rook over to h5 to attack my newly fixed weakness on h2. Of course I cannot touch the g pawn - 31 Rxg4?? Bf3  spears my rook.",
        "31. Ke3 Rf3+": "31.Ke3  \tRf3 ! \r\n\r\n9K relentlessly drives my king back to a less active square.",
        "32. Ke2 Rf5 33. Ke3 Rh5 34. Rxg4 Rxh2": "32.Ke2 \tRf5! \r\n33.Ke3 \tRh5! \r\n34.Rxg4 \tRxh2  \r\n\r\nBCM9k has made steady progress although a win is still far from definite. I'd love to exchange that lame knight for Black’s active bishop here. If I could achieve that a draw would be a realistic possiblity. \r\n\r\nI was also interested in the usual defensive goal of exchanging off pawns. I felt that I will be able to achieve the classic Rook vs Rook Bishop endgame, which is usually a draw, although never easy ...",
        "35. b3 Rh5 36. Rc4 Re5+ 37. Kd2": "35.b3 \tRh5  \r\n36.Rc4 \tRe5  \r\n37.Kd2 \t...\r\n\r\nI've just got to sit tight and keep Black’s pawns under surveillance. Sometimes you really have nothing better than to sit and wait for your opponent to come up with a plan.",
        "37... h5 38. Rh4 Rg5 39. Ne2 Kd6 40. Ke3 a6 41. Kf2 Rf5+": "37. ...\th5 \r\n38.Rh4 \tRg5! \r\n39.Ne2 \tKd6! \r\n40.Ke3 \ta6 \r\n41.Kf2 \tRf5   \r\n\r\n9K maneuvers to limit the activity of my king. King position assumes great importance in the endgame and the side with the more active king position usually has the advantage.",
        "42. Ke3 Rf3+ 43. Kd2 Be8 44. g4": "42.Ke3 \tRf3  \r\n43.Kd2 \tBe8! \r\n44.g4! \t...\r\n\r\nThis is actually a good move, although my follow-up was horrible.",
        "44... hxg4 45. Nc3": "44. ...\thxg4 \r\n45.Nc3??  ...\r\n\r\nThis blunder effectively ends the game. There is still plenty of fight after 45 Rxg4 Rf2 46 Rf4! Rh2! 47 Ke3 Rh3  48 Kd2 Bh5! 49 Nc3 Bg6 50 Ra4! Rd3  51 Ke1! Now the point here is that 51…Rxc3 is met by 52 Rxa6  which wins back the piece and forces a likely draw.",
        "45... Rf4": "45. …\tRf4  \r\n\r\nCM9K now has a decisive 2-pawn advantage and is just coasting to victory. I played it out to the bitter end just to see how effective CM’s technique would be.",
        "46. Ke3 Ke5 47. Rh7 Rf3+ 48. Kd2 Rd3+ 49. Kxd3 Bg6+ 50. Ke3 Bxh7": "46.Ke3 \tKe5 \r\n47.Rh7 \tRf3  \r\n48.Kd2 \tRd3 ! \r\n49.Kxd3 \tBg6  \r\n50.Ke3 \tBxh7 \r\n\r\nWith the exchange of rooks, there is no possiblity of creating counterplay and the pawns will just roll forward and stretch White’s defenses to the breaking point.",
        "51. Na4 Bb1 52. Nxc5 Bxa2 53. Nxa6 Bxb3 54. Nb4 Kf5 55. Kf2 e5": "White cannot set up a blockade and the knight is progressively stretched like a rubber band trying to hold back the two advancing foot soldiers.",
        "56. Nd3 Bc4 57. Ne1 Ke4 58. Kg3 Be6 59. Kf2 Bd7 60. Ng2 Kd3 61. Kg3 Kd2": "Wow! This was a real wake-up call! I failed to keep the position under control and paid dearly for it. 9k displayed its usual tactical brilliance but I contributed to my loss by allowing the position to explode tactically. I had to put this game behind me and get a decent night’s sleep to be ready for tomorrow’s decisive final games. (0-1)"
    },
    "url": "https://gameknot.com/annotation.pl/larry-christiansen-chessmaster-9000-game-two-2?gm=2238",
    "gameName": "Larry Christiansen - Chessmaster 9000 game two (#2)",
    "players": "Larry Christiansen  vs. Chessmaster 9000 ",
    "opening": "Reti opening (A04)"
}