{
    "moves": {
        "1. e4": "I've been playing the controversial Latvian Gambit recently, and while it's not the most advisable opening for blitz due to the opening's very sharp nature (it's somewhat more popular in long-form games, where Black is less likely to misstep and lose in the first dozen moves or so), it has the advantage of likely getting White off-book very quickly (of course at high levels everyone is prepared for this opening), and Black can find a lot of tricky resources. Inadvisable or no, it certainly leads to fun games! This game opens with an uncommon line, and features several sacrifices (relatively-sound and otherwise) and a minor-piece checkmate. Enjoy!",
        "1... e5 2. Nf3 f5": "?! This is the key move of the Latvian Gambit. Black gives up a pawn in exchange for rapid development and lots of attacking potential.",
        "3. exf5": "The more common line is 3. Nxe5 Qf6. In the text, White is unlikely to be able to protect a pawn on f5, and he gives up his claim to the center. By playing this side line that looks more like a reversed King's Gambit, White makes me think he's unfamiliar with the opening. Main lines in the King's Gambit don't really apply very well to the Latvian.",
        "3... d6": "The standard line here is actually 3...e4 4. Ne5 Nf6 5. Be2 d6 6. Bh5+ Ke7, followed by White retreating his Knight and Black playing ...Bxf5 (note that 7. Nf7 loses material and time after 7...Qe1), but I chose a more conservative approach here, given that there's time pressure to consider.",
        "4. Bd3": "? White defends his wayward pawn on f5, at the cost of blocking the d-pawn and crippling his development. I think it's probably better to let the f-pawn go.",
        "4... Nf6": "Threatening ...e4, forking Knight and Bishop.",
        "5. O-O": "White puts off dealing with ...e4 directly, since for now he can counter with Re1.",
        "5... Nc6": "I continue my development. White's already gotten away into his castle, so I need to step it up.",
        "6. b3": "This is the easiest way to let the DSB out at this point, but it's not destined to get much action pointed straight at a well-defended e5 pawn.",
        "6... Bd7": "White's just told me with his last move that his Bishop isn't leaving d3 anytime soon, so I might as well develop my own LSB.",
        "7. Bb2 Be7": "Threatening ...e4.",
        "8. Nc3": "Defending e4.",
        "8... d5": "?! This wasn't particularly well thought-out. I probably should have played 7...d5 to allow more options for my DSB. This does renew the threat of ...e4, though, which wouldn't actually be possible if the White Rook could still pin it to the BK.",
        "9. Be2": "White chooses to pull his Bishop back to give himself some more space on d3.",
        "9... Bxf5": "I finally get the f5 pawn back. Now I'm in a position I'm not used to--normally this opening leaves me significantly behind in material, trying to make the most of my advanced development. Here, I still have a slight spatial edge, but materially we are even.",
        "10. d3": "I don't think this move accomplishes much right now. If White were planning to play c4, he should get the Knight out of the way first, and since the only decent place to put that Knight at the moment is b5, I don't see a reason to deny it the Bishop's support prematurely. This move adds a little defense to e4, but otherwise I don't see any reason for it.",
        "10... O-O": "In retrospect I wish I had castled queenside. White isn't at all set up for a pawn storm on that flank, and this position ends up leaving me a bit more exposed than I would like.",
        "11. Re1": "White gets his Rook onto the critical e-file, but as yet it can exert no influence with the stymied Bishop blocking its path.",
        "11... e4": "!? At this point I feel like I'm ahead enough in development and open space that I can break the position open and begin an attack. This move frees White's Bishop, but I'm feeling like my King is reasonably safe.",
        "12. dxe4 dxe4 13. Qxd8": "White sees an attack coming, so he immediately begins trading down.",
        "13... Raxd8": "My development is now complete, and my Rooks both occupy powerful open/half-open files.",
        "14. Ng5": "White's Bishop now has plenty of opportunities for play, allowing it to open up an attack by the Rook to win e4.",
        "14... h6": "?! I want to eliminate White's most active piece, but it will cost me the exchange. I haven't looked ahead very much, so I'm basically just betting that I can get compensation for the Rook.",
        "15. Bc4+ Kh8": "Forced.",
        "16. Nf7+ Kh7": "Forced again.",
        "17. Nxd8 Rxd8": "I'm down the exchange but my pieces are a little more active. I'll have to make very good use of my mobility to force White to make more threats than White can respond to.",
        "18. f3": "? White wants to take down my isolated e-pawn, but he could do it with pieces. This move weakens his kingside defenses needlessly, and gives me an obvious way to press the attack.",
        "18... Bc5+ 19. Kh1 exf3": "19...e3 is probably also playable here, but I just didn't see myself getting the pawn all the way through with so much material on the board.",
        "20. gxf3 Nd4": "Forking the f and c pawns (I'd prefer to take c2 with the Knight over the Bishop, since that would equalize the material), and bringing this Knight up closer to the real action.",
        "21. Rac1": "This is the only decent move for this Rook, as at b1 or d1 I just play 21...Bxc2 and the Rook has to move again anyway.",
        "21... Nxf3": "Threatening the White Rook while opening the path to his King. My Bishops are so much more active than White's are, and it's starting to show.",
        "22. Ref1": "Skewering the Knight and LSB. It's worth noting that White's Knight (and therefore also his DSB) are completely locked down by the threat of ...Be4.",
        "22... Nh4": "I respond to White's threat and neatly trap the White King.",
        "23. Bd3": "White cannot let my Bishop off the b1-h7 diagonal, or I will be able to move ...Bh3 and White's position becomes very dire. This move by White wins the offending Bishop anyway, eliminating my pair, and with it my best shot at equalization or victory...",
        "23... Rxd3": "...Unless of course I throw my Rook at the problem. Now all of White's pieces will be locked into a valiant defense of their beleaguered King.",
        "24. cxd3 Bxd3": "In the game, I briefly considered 24...Bh3 (threatening ...Bg2#), and discarded the idea because White has too many defenders for g2. The continuation looks like 24...Bh3 25. Rg1 Ng4 (threatening mate on f2) 26. Rc2 and Black can win back both Rooks, but I don't see a clear mate and White is suddenly free to act on the queenside.",
        "25. Rfe1": "White intends to keep his Rook alive as long as possible, while adding some muscle to the e4 mating square.",
        "25... Bf5": "Threatening ...Bg4 and ...Bf3#.",
        "26. Re5": "This Rook is about the only piece White can move freely, so he goes after my undefended DSB.",
        "26... Bd4": "I can't quite force the mate after 26...Bh3 27. Rxc5 Ng4 28. Rc2, so I pin White's Knight to avoid letting it into the action (since it's otherwise free now that a Rook is covering e4).",
        "27. Re2": "?? With this seemingly-reasonable move, White thinks to defend e4, g2 and b2 in one fell swoop, but it loses him a huge exchange at the very least. Better was to give back the material with 27. Rxf5 Nxf5 28. Ba3.",
        "27... Bg4": "! The only way to stop mate at f3 now is 28. Rf1 Bxe2 29. Nxe2 Bxb2 and Black is two pawns, a Knight and a Bishop above White's Rook, with an easy win in sight. If White doesn't take the Bishop on move 29 and instead plays anything else, Black plays 29...Bf3+ 30. Rxf3 Nxf3 and wins handily.",
        "28. Ne4": "Simply put, this move doesn't stop the mate threat. Perhaps White thinks to distract me with check on f6 and the discovered attack on my Bishop, but none of that matters.",
        "28... Bf3+ 29. Rg2 Bxg2#": "That's that! The difference in power all game long between Black's active Bishops and White's passive ones is astonishing. This game was great fun to play, so many thanks to krishnas83 for that. Comments on the analysis or on the game itself are greatly appreciated (and if you leave a poor rating, please comment to tell me what I can improve!). Thanks for reading!"
    },
    "url": "https://gameknot.com/annotation.pl/latvian-mobility?gm=45040",
    "gameName": "Latvian Mobility",
    "players": "krishnas83 (??) vs. bwaa (??)",
    "opening": "Latvian counter-gambit (C40)"
}