{
    "moves": {
        "1. e4 e5 2. Nf3 f5": "?! The key move of the controversial Latvian Gambit. Very rarely seen at high levels, Black gives up a pawn (and usually much more) for a lead in space and development.\n",
        "3. Bc4": "This is a very aggressive line for White, where he will generally aim for a crushing early material lead or possibly victory, through an attack with his Bishop, Knight, and Queen.\n",
        "3... fxe4": "Black kicks the Knight and invites it to an outpost on e5, threatening f7.\n",
        "4. Nxe5 d5": "The other option for Black here is 4...Qg5 5.d4 Qxg2 6.Qg5+ g3 7.Bf7+ Kd8 8.Bxg6 Qxh1+ 9.Ke2 Qxc1 or ...c6, but I think the text is stronger for Black's position. The whole point of the Latvian is that White has a hard time developing his pieces--going around killing them on their home squares is less useful for Black than good, old-fashioned development.\n",
        "5. Qh5+": "This is the standard continuation. Play generally continues 5...g6 6.Nxg6 hxg6 7.Qxg6+ Kd7 8.Bxd5 Nf6. Alternatively, Black can play 6...Nf6 7.Qe5+ Be7 8.Bb5+ c6 9.Nxe7 Qxe7 19.Qxe7+ Kxe7 11.Be2.\n",
        "5... g6 6. Nxg6 hxg6": "The sharper of the two standard plays.\n",
        "7. Qxh8": "Common, but perhaps safer is 7.Qxg6+ Kd7 8.Bxd5.\n",
        "7... Kf7": "Black defends his Knight and g-pawn, while avoiding 8.Qe5+.\n",
        "8. Qd4": "The Queen makes good her escape and threatens to win the d-pawn.\n",
        "8... Nf6": "Reinforcing the d-pawn with development. Black has a lot of open lines, but he needs to get pieces on them or they will prove worthless.\n",
        "9. Nc3": "White continues to harass the d-pawn. Black can't play ...dxc4?? of course, as that would simply donate his Queen to White's cause.\n",
        "9... Be6": "Black continues to develop while reinforcing d5.\n",
        "10. Bb3": "Out of ways to threaten d5 and with ...Nc6 looming, the Bishop retreats.\n",
        "10... Nc6": "Black continues to develop with tempo.\n",
        "11. Qe3": "The WQ is quite limited in her choice of escape paths.\n",
        "11... Ng4": "?! Black hungers for blood; the WQ is exposed and here Black's Knight takes aim at f2. After 12.Qf4 Kg8, White must make an escape route for his Queen in anticipation of ...Bd6. More solid would have been developing the Bf8 or Queen.\n",
        "12. Qf4+ Kg7": "? I think 12...Kg8 was better, despite remaining in the path of White's Bishop, as it would allow ...Bh6.\n",
        "13. Nxe4": "! White defends against ...Bd6 while gaining a pawn. Now his Knight can participate freely in the action, with d2-d4 soon to follow.\n",
        "13... Qd7": "Black gets his Queen off the back rank in an attempt to make use of his remaining Rook along the e-file.\n",
        "14. h3": "White drives away the Knight protecting the vital f6 square.\n",
        "14... Re8": "?? This is a huge oversight. The thought was that after 15.hxg4 Bxg4 Black would win his piece back and eliminate the dangerous White Knight, but there's no time to move the Bishop as White suddenly has deadly threats at h6 and f6. The rest of the game is quick and brutal.\n",
        "15. hxg4 Be7": "Holds out a little longer than anything else I saw.\n",
        "16. Qh6+ Kf7 17. Qh7+ Kf8 18. Qh8+ Bg8 19. Rh7": "1-0. Black can prevent mate momentarily with ...Rb8 or ...Bf6, but he'll lose a tremendous amount of material and White should be able to finish it without any trouble at all. A clear example of the kind of horrible fate that awaits Black down this line without extremely precise play. Comments on the analysis or the game itself are greatly appreciated! If you leave a star rating, please also comment letting me know what I can improve or what I did well! Thanks for reading!\n"
    },
    "url": "https://gameknot.com/annotation.pl/latvian-gambit-7?gm=45380",
    "gameName": "Latvian Gambit 7",
    "players": "bobby35 (1627) vs. bwaa (1666)",
    "opening": "Latvian (C40), Polerio variation"
}