{
    "moves": {
        "1. e4 e5 2. Nf3 f5": "?! The key move of the controversial Latvian Gambit. Very rarely seen at high levels, Black gives up a pawn (and usually much more) for a lead in space and development.",
        "3. Nxe5": "This is the main line, which continues with 3...Qf6 (or 3...Nf6?!) and then either 4.d4 d6 5.Nc4 fxe4 or 4.Nc4 fxe4 5.Nc3 Qg6 6.d3.",
        "3... Nc6": "?! This unusual variation leads to especially sharp lines as Black offers White a free Rook with 4.Qh5+ g6 5.Nxg6 Nf6 6.Qh3 hxg6 7.Qxh8 Qe7, hoping his positional compensation will be enough to deal with White's significant material lead.",
        "4. Nxc6": "This is not actually bad, but it is probably the best-case scenario for Black, as he gets to free up his LSB and the d-file without an enormous material sacrifice.",
        "4... dxc6 5. e5": "?! White is playing extremely aggressively, but the e-pawn was in no real danger (...fxe4 isolates Black's pawn far from any support and will be won back easily) and White needs to develop in order to compete with what is about to become a very active Black position.",
        "5... Qd4": "With no Knight and d4 blocked, White doesn't have a comfortable way to dislodge this Queen.",
        "6. Qe2": "This is the only way to protect the pawn until White can find time for f4, but it does the LSB no favors.",
        "6... Be6": "Black blockades the troublesome e-pawn and puts another piece between his King and the WQ.",
        "7. c3": "Kicking the Queen, but hampering White's development further.",
        "7... Qb6": "!? Black allows his Queen to be somewhat marginalized, but threatens White's b-pawn, tying the WQ to its defense should the Bishop get out after White's d4. With only a couple pieces in play, Black is making it exceedingly uncomfortable for White to complete his development.",
        "8. d4": "Reinforcing the e-pawn, though this seems susceptible to attack from ...c5.",
        "8... O-O-O": "White is still far behind in development and Black's pieces are looking hungrily at the WK--which is still at least three moves from castling.",
        "9. Bg5": "?! White develops while trying to gain some tempo, but Black has an easy response. What's worse, this move ties the Queen to the defense of b2 and prevents White from playing an immediate Nd2 as a result.",
        "9... Be7 10. Bxe7": "I don't like this choice by White to trade off his only active piece. Perhaps 10.Be3 would be better, threatening 11.d5.",
        "10... Nxe7": "Black is almost fully developed, while only White's Queen is off her starting square--and she's not looking great, either.",
        "11. b3": "? White tries to loosen up his position a bit, but it would have been better to simply bite the bullet and take the time to develop with 11.Qc2 followed by Bd3 and Nd2, as now Black can counter with...",
        "11... Rxd4": "! This sham sacrifice wins the pawn and gives Black undisputed control of the d-file. If 12.cxd4? Qxd4 and Black wins back his Rook with interest.",
        "12. Nd2": "Now White can take the Rook, but his queenside pawns and e-pawn are looking very weak.",
        "12... Rf4": "?! I still don't know how to feel about this move. Black continues to apply pressure to White's cramped position and prevents f4 for the moment, but he gives up the d-file and allows White to develop his Bishop with tempo.",
        "13. g3 Rg4": "Not 13...Bd5? (thinking to invade h1 and deny White's castle) because of 14.f3!, simultaneously blocking the threat and winning the Rook.",
        "14. f4": "?! Shoring up the advanced e-pawn yet again and locking Black's Rook out of the center. This does completely shatter any safety that was to be had in the White kingside though, as Black can reach the h1-a8 diagonal first and now also controls all of g1-a7 as well. I think 14.Bg2 was better here.",
        "14... Bd5": "Black seizes the diagonal for his Bishop. The tempting 14...g5?? (trying to undermine e5 yet again) loses badly to 15.Bh3.",
        "15. Nf3 h5": "?! Black's Rook is in a precarious spot with only one retreat square, but it's safe for now, and with both Rooks on the kingside, he plans to break through White's pawns and get all his pieces into the attack before the King can escape the center.",
        "16. Bh3": "Finally, the Bishop gets out of the corner. After the Rook moves, this Bishop will actually be of some use pinning Black's f-pawn.",
        "16... Rg6 17. Rf1": "White unpins his Knight and threatens Nd4, winning the f-pawn.",
        "17... Qc5": "Forcing White to deal with his weak c3 pawn before anything else happens, and provoking the natural response...",
        "18. c4": "White kicks the powerfully-centralized Bishop, though it won't go far...",
        "18... Qb4+": "! Clearing the WQ away from her defense of e4.",
        "19. Qd2 Qxd2+ 20. Kxd2": "?! This is surprising. White wants to keep his Knight available for kingside maneuvers, but putting his King on the open d-file is dangerous at best.",
        "20... Be4": "With the WQ gone, Black's Bishop is now free to occupy this powerful location.",
        "21. Ng5": "Another surprise, though it's clear why White wants to trade off the Black Bishop. He leaves his King dangerously exposed, though. I expected 21.Rae1 or maybe 21.Ke3 (thinking to work his way over to g1).",
        "21... h4": "! Black has decided that 21...Rd8+ doesn't offer enough promise, as the WK can easily flee to his kingside and hide amongst his pieces there. Instead, Black tries to disrupt the White position and get an advantage for the endgame--now if White wants to eliminate the Black Bishop, he'll let the Rooks in to wreak havoc on his kingside (22.Nxe4 hxg3 23.hxg3 Rxh3 and now the Knight must retreat, allowing 24...Rhxg3).",
        "22. Rae1": "White seeks to eliminate the pesky Bishop once and for all, but Black's aggressive Rooks will be too strong for White's passive ones, especially the Rf1 blocking the WB's escape route.",
        "22... hxg3": "Black forges ahead with his kingside break. White has several options here, none of them particularly pleasant. For instance, 23.hxg3 Rxg5! 24. fxg5 (24.Bxf5+ Rxf5 25.Rxe4 Rh2+ 26.Re2 Rxe2+ 27.Kxe2 c5 gives Black a clearly won endgame) ...Rxh3 and Black's powerful Bishop is unassailable on e4 while the Knight and King clean up White's pawns. Alternately, White could try 23.Nxe4 g2! 24.Bxg2 (24.Rg1 is met with ...Rxh3 25.Nf2 Rxh2) ...Rxg2+ 25.Nf2 Rhxh2 26.Re2 and White's pieces are hopelessly passive, tied down to defending each other while the Black Knight and King and again free to roam the board.",
        "23. hxg3 Rxg5": "! This Rook \"sacrifices\" itself for the second time. Black has too many threats to counter at once. He'll get at least two minor pieces and a pawn for his Rook if White takes it.",
        "24. Rxe4": "?! White counters by removing the powerful light-square Bishop, but now he'll be down a Knight as the endgame approaches.",
        "24... Rxh3": "Black cleans up the Bishop and unpins his f-pawn, while threatening to win g3 as well.",
        "25. Re3": "? White chooses to avoid more trades and save his Rook, but trying to defend the g-pawn is a futile gesture. Better may have been 25.Rd4, trying for some counterplay on the d-file.",
        "25... Rgxg3": "Black removes his own Rook from danger, gains a pawn, and now threatens to win the Re3, as well as the a2 pawn.",
        "26. Rxg3": "If White wanted to exchange Rooks, it would have been more accurate to play 25.fxg5 fxe4 26.Ke3 Rxg3+ 27.Kxe4, where at least White has a good, centralized position for his King.",
        "26... Rxg3 27. Ke2": "Allowing White to interpose his Rook after ...Rg2+, though trading off more material isn't going to help him much.",
        "27... Rg2+ 28. Rf2 Rxf2+ 29. Kxf2 Kd7": "With almost no pieces remaining on the board, the Black King finally mobilizes to attempt to escort a pawn through the White camp.",
        "30. Ke3": "White doesn't fall for the temptation of 30.Kg3, thinking to win a kingside pawn, as that loses to 30...b5 31.Kf3 a5 32.Ke3 Ng6 33.c5 Ke6 etc.",
        "30... Ke6": "Black gets his King in the most centralized location available, ready to push to d5 whenever the opportunity presents itself. If now 31.Kd4, Black can play ...b6!, and then White must mark time while the Black Knight relocates to d7: 32.a3 Ng6 33.Ke3 Nf8 34.Kd4 Nd7 35.Ke3 g5! 36.fxg5 Nxe5 37.Kf4 Ng6+ 38.Kg3 Ke5 and soon Black will win the g-pawn or simply push through on the queenside.",
        "31. a4": "White keeps his King close by f4, but it won't do him much good. Black has too much material to throw at his problems.",
        "31... b6 32. b4": "There are few other choices.",
        "32... g5": "! White has no resources left. 33.fxg5 loses the e-pawn, then the g-pawn in due course. No queenside pushes are possible; Black simply has too many pawns there for White to break through. Avoiding capture of the f-pawn is no better anyway, as ...Ng6 forces the issue soon enough.",
        "33. a5": "Hoping for 33...bxa5 34.bxa5 and then maybe Black will blunder and allow the KW in through d5-c5.",
        "33... Ng6": "White's queenside pawns pose no threat at all. Black can simply force the creation of a passed pawn on the kingside, then march to victory on whichever flank the WK doesn't defend.",
        "34. fxg5 Kxe5 35. axb6 cxb6 36. Kf3": "White chooses to go kingside, hoping to defend his g-pawn and maybe drive the Knight away, allowing a promotion if Black missteps.",
        "36... a5": "But now Black will have a passed a-pawn as well, and the WK cannot hope to defend both sides of the board.",
        "37. bxa5 bxa5": "0-1. White has no way to stop both the a- and f-pawns, and he resigns. Many thanks to luker67 for this excellent game! Comments on the analysis or on the game itself are much appreciated. If you leave a rating, please also comment letting me know what I did well or need to improve! Thanks for reading!"
    },
    "url": "https://gameknot.com/annotation.pl/latvian-gambit-3?gm=45103",
    "gameName": "Latvian Gambit 3",
    "players": "luker67 (1605) vs. bwaa (1693)",
    "opening": "Latvian (C40), Fraser defence"
}