{
    "moves": {
        "1. e4": "Hi all! Have a quick annotation over lunch, featuring a huge bloodbath and a great King hunt. Just when you think the sacrifices are over...",
        "1... e5 2. Nf3 f5": "?! The Latvian Gambit/Greco Counter-Gambit. While it's not necessarily the most sound opening for Black, it does generally lead to extremely sharp, exciting play. This game is no exception.",
        "3. Nxe5": "This is the standard continuation.",
        "3... Nc6": "?! The GK computer hates this move, but I like it. Black offers an Exchange (R for N) in return for open attacking lines.",
        "4. Qh5+": "With the threat 4...g6 5.Nxg6 Nf6 6.Qh3 hxg6 7.Qxh8 Qe7.",
        "4... g6 5. Nxg6 Nf6 6. Qh4": "An interesting alternative. This move can lead to a rather bizarre attack on the White King through the center after (for example) 6...Rg8 7.Nxf8 Rg4 8.Qh6 Rxe4+ 9.Be2 Nd4 10.Nc3 Qe7 (or 9...Qe7 10.Nc3 Rxe2+!? 11.Nxe2 Nd4 12.O-O Nxe2+ 13.Kh1).",
        "6... Rg8 7. Nxf8 Rg4 8. Qh6 Rxe4+ 9. Kd1": "?! I've encountered this move quite a bit on GK, but it's unpopular in master play (not that this opening gets much use at all at that level). The issue is that with the King on d1, a Black Knight on g4 can create serious, lasting problems. Observe:",
        "9... Ng4": "This is very strong. The WQ is suddenly relegated to defending f2, so she can't hold on to the Nf8 (e.g. 10.Qg7?? Nxf2#).",
        "10. Qh5+ Kxf8": "I told you it was a bizarre attack. Let's take stock of the situation with some basic board evaluation principles (thanks id=elyhim ).\n1. Material relationship: White has a material advantage, with an extra pawn and a Bishop for a Knight.\n2. Presence of direct threats: Both sides have significant threats. White threatens two of Black's pawns and has various future opportunities available. Black on the other hand threatens immediate mate on f2.\n3. King Position/Safety: Neither player's King can be considered safe. White's is a little more tucked away, but Black is more prepared to attack it.\n4. Possession of open lines: Here the advantage goes to Black for his dominant Rook on the e-file.\n5. Pawn structure, weak and strong points: White's pawn structure is much more stable and has only one significant weak point: f2.\n6. The center and space: Black rules the center with absolute authority and has vastly more space.\n7. Development and the position of pieces: White's only developed piece is his Queen, which is somewhat out-of-position and harassable. Black has developed three pieces and his Queen may be considered developed as well.\nConclusion: The position is very nearly equal. Black has perhaps a slight short-term advantage, but if White plays very carefully, he may be able to catch up in development and convert his material advantage and better pawns into a winning endgame.",
        "11. Qxf5+": "? Seemingly winning a Rook and pawn for nothing, but in reality all this does is put the WQ in a precarious spot. After 11...Kg7, White cannot follow up by taking the Rook because of the powerful g4 Knight (and misplaced WK): 12.Qxe4?? Nxf2+ 13.Ke1 Nxe4. Best here was the simple 11.c3, giving the WK a bolt hole to prevent the mate threat on f2 without tying down the Queen.",
        "11... Kg7 12. d3": "This looks innocent enough, but it's still worse than c2-c3. Now Black will force a favorable exchange to regain (approximate) material equality while maintaining a huge positional advantage.",
        "12... d6": "Attempts to save the WQ by e.g. 13.Qf3 do not achieve their goal: either the Queen gives her life for material (but not positional) equality, or else the King loses his. An example line might continue 13...Nxf2+ 14.Qxf2 Bg4+ and now either [A] 15.Be2 Bxe2+ 16.Qxe2 Rxe2 17.Kxe2 Nd4+ and Black is winning, or [B] 15.Kd2 Qg5+ 16.Kc3 Qa5+ 17.Kb3 Qb4#. So White has nothing better than to give up his Queen for a Rook and Knight. ",
        "13. Qxe4 Nxf2+ 14. Ke1": "The GK computer thinks this is a huge blunder, giving 14.Ke2 as significantly better (but still losing), but I don't think there's a meaningful difference. Black's Q and B are both coming into play with tempo either way.",
        "14... Nxe4 15. dxe4": "Now that so much material has leaped off the board, it's time for another evaluation. Black has the move.\n1. Material relationship: Material is unbalanced but approximately equal, probably favoring Black slightly in the midgame due to his Queen but with good chances for White because of his extra piece.\n2. Presence of direct threats: White has no threats. Black has a checking opportunity at h4, with more followup checks on the horizon. Advantage: Black.\n3. King Position/Safety: Black's King is out in the open, but White has no way to launch any sort of attack at the moment. White's King is on its home square, but has no real defenders.\n4. Possession of open lines: Black owns the diagonals c8-h3 and d8-h4, and is in position to make use of the open and half-open center lines. White's only open line is f3-a6, which has no real influence.\n5. Pawn structure, weak and strong points: White has a defenseless, isolated e-pawn and ungarded c-pawn. He also has a kingside majority, while Black has a queenside majority and a weak, isolated h-pawn.\n6. The center and space: White occupies the center with a pawn, but the pawn is weak and he has no other pieces with central influence. Black controls the center with a Knight. Space is roughly even as neither player has many advanced pieces to lay claim to any of it.\n7. Development and the position of pieces: White has no developed pieces. Black's Knight is developed to a fine square and his Queen and Bishop may both be considered developed also, as they have long control over the White kingside.\nConclusion: Black has secured a sizable advantage despite the near-even material. He has the initiative and space in which to work, and White will be hard-pressed to survive the coming attack with his undeveloped pieces.",
        "15... Qh4+ 16. Kd1": "?? This is simply a blunder. Best was 16.Ke2, though after ...Bg4+ 17.Kd3 White is still basically hosed. I didn't see it at the time, but there's actually a forced mate here. Can you find it?",
        "16... Bg4+ 17. Be2 Bxe2+ 18. Kxe2 Nd4+": "Actually a mistake, but it doesn't make much difference. This allows White to get out of the forced mate via 19.Kd3 Qf2 20.Bd2 (blocking c2) Qxg2 etc. The best continuation was (last chance to look for the mate yourself!) (e.g.) 18...Qxe4+ 19.Kf2 Rf8+ 20.Kg3 Qg6+ 21.Kh4 Ne5! 22.h3 Nf3+! (drawing away the g-pawn) 23.gxf3 Rf5 24.Bh6+ Kxh6 25.Rg1 Rh5#.",
        "19. Kd3 Qf2 20. Be3": "Trying to get back in the game with a strong-seeming fork, White actually gives it away. There's a new forced mate now (7 moves or less), which I do actually notice this time. Try to find it before you scroll down; it's pretty straightforward.",
        "20... Qxc2+": "The moment Black regained equality, he tosses it away in favor of a more important goal--the White King. (Of course, the Knight was lost anyway, but now White cannot take it with check!)",
        "21. Kxd4 c5+ 22. Kd5 Qd3+ 23. Ke6": "23.Bd4 holds out an extra move.",
        "23... Re8+ 24. Kd7": "Or 24.Kf5 Qxe4+ 25.Kg5 Re5#.",
        "24... Qb5+ 25. Kxd6 Qc6#": "That's all there is! A nice little mate to finish off a nice little game. Thanks very much to serfefe for the match! Thanks for reading, everyone. Comments are appreciated."
    },
    "url": "https://gameknot.com/annotation.pl/latvian-gambit-king-hunt?gm=48322",
    "gameName": "Latvian Gambit: King Hunt!",
    "players": "serfefe (1663) vs. bwaa (1667)",
    "opening": "Latvian (C40), Fraser defence"
}