{
    "moves": {
        "1. e4": "I'm presenting a short Latvian Gambit kill against an 1800-rated player. This game started off with a violent counter-assault from white who soon found himself walking into a mating net on his own queenside.",
        "1... e5 2. Nf3 f5": "The infamous Latvian Gambit. This opening is denigrated by chess masters, and shunned by just about every GM you can think of. But for those adventurous (and crazy) enough to play it, it can be a lethal weapon unlike no other opening for black. It is an opening for attackers, for the tactically-minded and fearless who would rather go down with explosions and fire than fizzle-out positionally in a quiet endgame. ",
        "3. Nxe5": "Taking the pawn on e5 with the knight opens the d1-h5 diagonal for the queen to immediately jump into the battle.  ",
        "3... Nc6": "I usually play 3...Nf6 here as black, as I think it is more solid. But here I played 3...Nc6 (Fraser Defense) expecting a knight exchange. Although I'll have doubled-pawns on the c file after the smoke clears, all my minor pieces will be open for quick deployment. ",
        "4. Qh5+": "Instead of taking on c6, my opponent went straight for the jugular, telling me he was ready to draw blood. ",
        "4... g6 5. Nxg6": "The knight is immune from capture on account of hxg6 and Qxh8. The untouchable knight is also threating Nxh8, with a discovery. But this situation is not as precarious as it seems.",
        "5... Nf6": "Counterattacking the invading queen. If the knight on g6 moves anywhere (note, there is no double check), the white queen falls. ",
        "6. Qh3": "White's queen has moved twice and is now on the unsafe diagonal of black's light-squared bishop. Note, the white queen must remain on the h5 file to compensate with Qxh8 if hxg6.",
        "6... Rg8": "The question of relocation is put to the knight.  ",
        "7. Nxf8": "This exchange is to my advantage as the game will show. ",
        "7... Rxf8": "After Rxf8, black establishes partial dominion of the f file, and although two pawns down he now leads white in considerable development.",
        "8. Qxf5": "The white queen is playing into black's hands. She will soon be harassed by black's natural developing moves which simultaneously take over the center and threaten her capture.  ",
        "8... d5": "The lone queen must move out of the wsb's sniper fire on c8. My opponent must also contend with the potential discovery from the rook on f8. And the pawn on e4 is attacked twice and defended only once by the besieged queen.  ",
        "9. Qg5": "Qg5 is her majesty's only reasonable escape, as any other move either keeps her either on the dangerous f file, the c8-h3 diagonal, or puts her under direct capture by either of the two black knights. Qh6, on the other hand, seems totally unambitious, whereas the present move at least establishes a pin. Obviously, white, being up in material, it would be eager to exchange queens should the opportunity arise.    ",
        "9... dxe4": "Capturing the pawn, freeing the c8 bishop, clearing the d file for the queen and establishing uncontested authority of the center. ",
        "10. Bb5": "Pinning the knight on c6 and clearing the way for 0-0.",
        "10... Qd6": "This move prevents a doubling of pawns on the c file should white capture on c6, and prepares to further vacate the 8th rank on the queenside for castling.",
        "11. Bxc6+ Qxc6 12. Nc3": "Observe all white's pawns in their initial closed positions on the second rank hemming in the bishop on c1. Compare this to black's open g and d files, with the unfettered bishop on c8 and knight poised on f6.    ",
        "12... Be6": "Activating my last minor piece while fortifying g8 should I need to aggress the queen prior to castling queenside.",
        "13. h3": "My opponent is preventing Ng4 and a subsequent double attack on f2. But this move is needless; I am looking to simply tuck my king away on the queenside and begin positional play aimed at exploiting his weaknesses on f2 and c2, his premature queen exposure, his unprotected king, and his severe lack of development. Better was 13. b3 or 13. 0-0. ",
        "13... O-O-O": "Black's army is fully developed, castled and ready to enter battle. ",
        "14. Qe3": "White retreats, sensing the danger poised at his over-extended queen. He has also subtly eyed the unguarded a7 pawn, but I have other plans. With my next move I invite him to grab the pawn if he so chooses. I would indeed be delighted to have his strongest piece misplaced on the corner of the board pursuing a phantom attack.",
        "14... Nd5": "This move provokes the white queen, and puts the question to the knight on c3. If the knights are exchanged on d5, I will have removed his last developed minor piece and assumed total domination of the center. I will also take implied control of the d file.   ",
        "15. Nxd5 Qxd5": "I decided to recapture on d5 with the queen instead of the bishop, as I too am now eyeing an unprotected pawn, the one on g2. In light of 16. 0-0, my short-sighted plans are Rg8, threatening Bxh3.",
        "16. b3": "Preparing to activate the bishop, but the situation is already too nefarious due to the differences in development. ",
        "16... Qe5": "The intention here, other than obviously attacking the rook on a1 and preventing the deployment of Bb2, is the translocation of the queen from the d file to the f file. From here I can bear down on f2, should white castle short, and also occupy the a1-h8 diagonal in the event of white castling long.  ",
        "17. c3 Qf6": "White's Qxe4 here loses to black's Qxf2+ and after Kd8 and Bd5 white has real problems.",
        "18. Ba3": "Taking a snipe at f8, but here the best defense for black is a counterattack!",
        "18... Rd3": "This is a boldly offensive move that certainly invites white to grab Qxa7. ",
        "19. Qxa7 e3": "The best continuation. Black threatens mate with Qxf7+ Kd8, Qxd2#. And if white tries 21. Qa4+, black pushes c6 and the attack is over. If 22. Bxf8 the same mating continuation as before applies. As it stands, white has to contend with all these threats: Rxd2, exd2+, exf2+, Qxf2+ and their attacking variations. ",
        "20. O-O-O": "White here missed the crashing 20. Qa8+! which would have ruined everything for me: 20. Qa8+ Kd7 21. Qxf8 and the bishop on a3 supports f8. Instead, white blundered by castling long (20. 0-0 was much better). I had already calculated the winning combinations the day before. My next move effectively ended the game. Can you find it? ",
        "20... Rxc3+": "Capturing the rook obviously leads to certain death: 21. dxc3 Qxc3+ 22. Qb1 Bf5+ 23. Rd3 Bxd3#.  ",
        "21. Kb1": "Kb2 just leads to the discovery move Rxb3+, and although the game is somewhat prolonged, white is just devastated. The other move -- the move played -- allows the bishop to join in the attack.",
        "21... Bf5+": "If 22. Ka1 Rc1# (21. Kb2 Rc1+ 22. Kxc1 Qa1#). ",
        "22. d3": "White interposes d3, perhaps hoping for the incorrect 22...Bxd3+? (23. Rxd3 24. Qa8+ Kd7 25. Qxf8 and white survives).",
        "22... Rxd3": "White resigned in light of 23. Rxd3 Bxd3+ 24. Kc1 Qa1# (23. Qa8+ Kd7 24. Qa4+ c6 does not stop the mate)."
    },
    "url": "https://gameknot.com/annotation.pl/latvian-gambit-kill-in-under-25-moves?gm=61959",
    "gameName": "Latvian Gambit Kill in Under 25 Moves",
    "players": "bholifield (1794) vs. mortuarydirector (1784)",
    "opening": "Latvian (C40), Fraser defence"
}