{
    "moves": {
        "1. e4": "This, the penultimate game in my Latvian Gambit series, is defined by an early misstep by White, resulting in the loss of his early aggressive potential and a much more positional game than is typical of this opening, as Black seeks to slowly compound his spatial and material advantages, finally reaching an instructive endgame with approximate material equality, but wherein Black enjoys far more activity and a minor piece over White's pawns. Enjoy!\n",
        "1... e5 2. Nf3 f5": "?! The key move of the controversial Latvian Gambit. Very rarely seen at high levels, Black gives up a pawn (and usually much more) for a lead in space and development.\n",
        "3. Nxe5": "The most common continuation. Also possible are 3.Bc4, 3.exf5 and 3.d4.\n",
        "3... Qf6": "This is one of the main lines, the other being 3...Nf3.\n",
        "4. Qh5+": "? The standard continuation here is 4.Nc4! or 4.d4. The text loses White a piece needlessly, and allows Black to go hog wild with his development.\n",
        "4... g6": "The logical response, winning the White Knight after 5.Nxg6 hxg6 and Black has a clear advantage.\n",
        "5. Nxg6 hxg6 6. Qe2": "Holding the e-pawn but locking in the King's Bishop.\n",
        "6... Be7": "Avoiding White winning a pawn with (for example) 6...d6 7.exf5+ Be7 8.fxg6.\n",
        "7. Nc3 Nc6 8. d3 Bb4": "Threatening to win a pawn and blast open the queenside, where White obviously is trying to castle.\n",
        "9. exf5+ Nge7 10. Bd2 Qxf5 11. O-O-O": "White gets his King out of the dangerously open center, though his KB and KR are still badly undeveloped.\n",
        "11... d5": "Freeing the Bishop and preventing a Knight from landing on e4.\n",
        "12. h3": "Preparing g2-g4 followed by Bg2.\n",
        "12... Be6": "Black continues logical development and prepares to castle long. Critically, this also unpins the Knight, since more maneuvering will be required before Black actually gets a chance to castle.\n",
        "13. Re1 Nd4 14. Qe3 Nec6": "Black has so far rearranged his pieces in an orderly way without losing time, and should be able to castle soon.\n",
        "15. g4 Qf6": "? Better was the immediate 15...Qf7; the text move loses a pawn.\n",
        "16. Nxd5 Bxd2+": "Something must be done with this Bishop to avoid losing material.\n",
        "17. Qxd2 Qf7 18. Bg2 O-O-O": "Black finally has a moment to castle with tempo.\n",
        "19. Nf4": "?! This move looks a little strange to me; White seems to be trying to mobilize on the flank but the center is wide open and largely controlled by Black. The text certainly sets up a number of potential combinations after 19...Bxa2 (which is practically forced at this point), but I don't see a line that goes particularly badly for Black, especially with the threat of ...Nb3+ hanging in the air. At the time, I had expected 19.c4, but White presumably doesn't want to make his d-pawn a target.\n",
        "19... Bxa2 20. Bxc6 bxc6": "Of course not 20...Nxc6 21.b3.\n",
        "21. Re4": "!? White desperately wants to remove the Black Knight from d4 so he can play b2-b3, but he cannot kick it with the c-pawn. The text trades off the Black Bishop for the White Knight and pins one Rook to the other, which is a hit to White's mobility--a critical commodity, especially if he is ever to convert his pawn advantage.\n",
        "21... Bd5 22. Nxd5 Qxd5 23. Kb1": "Preventing the BQ from blasting down to a2 and initiating a powerful attack, aided by the Knight.\n",
        "23... g5": "Black locks up White's kingside pawns for their eventual execution. The Rook pin is badly hampering White's mobility, but of course he can't break it with ...Rhe1 because of the undefended h-pawn, or ...Ree1 because of 24.Nf3 (also possible with ...Rhe1, of course).\n",
        "24. Qc3": "? 24.Qe3 (...Qc5 25.c3) was probably better; I don't see a purpose to the text move. White is perhaps trying to make play on the queenside and come over to a3, but that seems wasteful and easily refuted. Besides, this gives Black time to make more threats. I think this is the point at which Black's advantages have become significant enough to ensure a win.\n",
        "24... Ne2": "This troublesome Knight is now making its way to f4 in order to win White's h-pawn. Of course White mustn't play 25.Rxe2?? Qxh1+.\n",
        "25. Qe5 Rhe8": "! Black is hoping to force White into fixing his queenside pawns and trading down to the endgame, as taking on e8 is inadvisible: 26.Qxe8 Rxe8 27.Rxe8+ Kd7! 28.Rxe2 Qxh1+ leaves Black with an easy win.\n",
        "26. Qxd5 cxd5 27. Rxe8 Rxe8 28. c3": "Here White begins to play somewhat inaccurately. He has a bit of an opportunity to create play on the kingside with 28.h4 (...Rh8 29.h5). The text is obviously an attempt to get the WK into play, but it fails after 28...Nf4 29.d4 (not 29.Kc2? Re2+) ...Re2 leaving the King still locked away anyway as White struggles to defend all his pawns.\n",
        "28... Nf4 29. d4 Re2 30. h4": "30.f3 Rf2 is a little better, providing White an extra tempo to use with his King: 31.h4 gxh4 32.Rxh4 Rxf3 33.Kc2 at least brings the WK toward usefulness on the queenside.\n",
        "30... gxh4 31. Rxh4 Rxf2 32. g5 Ne6": "Not 32...Ng6 where it will be dislodged immediately by 33.Rh6. Black must first create threats enough to force the White Rook behind its pawn; then the Knight can safely blockade it while the BK approaches.\n",
        "33. Rg4": "Anything else allows 33...Rg2.\n",
        "33... Ng7 34. g6": "? Irrelevant. This pawn isn't going anywhere; White needs to get his King into play via Ka2 and play as actively as possible.\n",
        "34... Kd7 35. b3": "? Just like that, the WK loses all hope of participating. The remainder of the endgame is fairly simple, but I'll make a couple more comments at key moments.\n",
        "35... Ke6 36. c4 dxc4 37. bxc4 Kf5": "Forcing the Rook to move off the fourth rank, enabling ...Rd2 d5 Rd4.\n",
        "38. Rg1 Rd2 39. d5 Rd4 40. Rc1": "With his King out of the picture entirely, White's Rook simply cannot defend everything. White chooses to hold onto his connected pawns, rather than the blockaded, hopeless one all the way across the board.\n",
        "40... Kxg6 41. Kb2 Kf5 42. Kb3 Ke4 43. Kb4 Kd3 44. Kc5 Nf5": "Preventing 45.Rd1+!, which would win the BR and the game in short order.\n",
        "45. Rf1": "? Not that White has many options here, but his connected pawns were his only advantage. Overlooking 45...Rxc4+ is irredeemable, though I'm only giving this one ? because all White's other moves are similarly futile (eg. 45.Kb5? Nd6+, winning c4). The best he has is probably 45.Rd1+. Though that path doesn't go anywhere particularly productive, perhaps he can finagle a draw somehow (I don't think so though; once the BK reaches c2 (after 45...Kc3 46.Rc1+ Kb3 47.Rb1+ Kc2) the checks run out and White pawns start falling.\n",
        "45... Rxc4+ 46. Kb5 Nd4+ 47. Ka6 Rb4 48. Kxa7 Rb6": "Now Black is in the obnoxious situation of trying to shield his King from all the possible checks while either setting up a mate (by removing White's d-pawn and finding a chance to play ...Nc6+) or queening his pawn.\n",
        "49. Ra1 Ke4 50. Ra5": "? This is White's final important mistake in this somewhat awkward, endgame. Allowing Black to fork d5 and Ra5 clinches the finish, though Black must play carefully to avoid a stalemate or the loss of his own pawn once the Rooks are gone. Better for White was 50.Re1+ Kxd5 51.Rd1, realizing that the d-pawn cannot be saved and instead making an attempt at preventing Black from getting his c-pawn across the board.\n",
        "50... Rb5 51. Rxb5 Nxb5+ 52. Ka6 Nd6 53. Ka7 Kxd5 54. Ka6 c5 55. Ka5 Kd4 56. Ka4 Kd3": "The Knight is basically irrelevant at this point, serving only to make the march to c1 a touch easier.\n",
        "57. Kb3 c4+ 58. Kb2 c3+ 59. Kc1 Nb5": "This is inaccurate (correct was 59.c2 60.Kb2 Kd2), but it felt wrong leaving the Knight out of the coronation ceremony. He's making his way to e2, where he can look on with pride.\n",
        "60. Kd1 Nd4 61. Kc1 Ne2+": "0-1. White gave up the aggressive advantages normally afforded him in this opening on his fourth move, and Black's resulting freedom allowed him to set up numerous small positional advantages to support his extra minor piece through the endgame.   Many thanks to slkove for the game! Comments on the analysis or the game itself are much appreciated. If you leave a rating, please also let me know what I did well or need to improve on. Thanks for reading!\n"
    },
    "url": "https://gameknot.com/annotation.pl/latvian-gambit-9?gm=45596",
    "gameName": "Latvian Gambit 9",
    "players": "slkove (1634) vs. bwaa (1748)",
    "opening": "Latvian (C40), Nimzovich variation"
}