{
    "moves": {
        "1. e4": "Welcome to the next game in my Latvian Gambit series! This one, like several of the others, sees White declining the gambit pawns and taking a more passive route at the beginning. When Black finally sweetens the deal too much to pass up, White takes too long to reorganize his forces and quickly succumbs to Black's superior mobility and aggressive potential. This is a quick one--enjoy!",
        "1... e5 2. Nf3 f5": "?! The key move of the Latvian Gambit. Black gives up a pawn (and frequently much more) in exchange for open lines on the kingside and a developmental lead.",
        "3. d3": "I really don't think White can safely decline the gambit, at least not with a move as passive as this one, but I've been seeing a lot of it. Black simply gains too much space. I believe 3.d4 is a far superior way to decline (or at least delay), leading to a very sharp game, and potentially transposing to the Philidor counter-gambit.",
        "3... Nc6": "This is basically a waiting move; finding a good time to develop this Knight is sometimes difficult and bringing it out right away simplifies things.",
        "4. Nc3 Nf6 5. Bg5 Bb4 6. a3 Bxc3+": "Black cedes the bishop pair in exchange for doubling White's pawns and making queenside castling less attractive--after all, Black intends to use his space on the kingside to start an attack there.",
        "7. bxc3 O-O 8. exf5": "?! This is a strange time to take this pawn, right after losing the ability to control d5 at all, but perhaps White plans to assail d5 from c4.",
        "8... d5 9. g4": "?! White's castling options are now basically nonexistant, but this may give Black some concerns about how to defend his kingside, if White can mobilize another piece or two.",
        "9... h6": "g4 is unguarded, so Black wants to drive off the nasty Bishop, and seize the initiative for himself. In the tactical situation developing kingside, activity and initiative mean everything.",
        "10. Bh4 g5": "! In exchange for space and strong development, Black offers White a far-advanced passed pawn right in front of his King, comfortable that with White's LSB undeveloped, there will be no way to make that pawn dangerous.",
        "11. fxg6 e.p. Bxg4 12. h3 Bh5 13. Rg1": "This is the right place for this Rook in the long term, but notice that it's not played aggressively--this is a purely defensive move, meant only to support the overextended g-pawn for now.",
        "13... Qd6": "Black unpins the Knight and connects the Rooks while bringing his Queen to a more centralized location. The threat of ...e4! is beginning to look serious, with the White King trapped in the center.",
        "14. Be2": "This is the only feasible way to break the pin on the Nf3, but it doesn't do the WK any favors--he needs to get to the queenside.",
        "14... Rae8 15. Rb1": "? This is the turning point in the game. White apparently underestimates the gravity of his situation, and thinks he has a move to spare here, but in games this sharp, every tempo is precious. Trying for counterplay is good, but b7 is entirely safe even if Black plays inaccurately with 15...Qxa3 (16.Rxb7? Qxc3+ and White is in trouble). White desperately needed to get his King off the e-file, but now it is too late, and there's no way out without significant material loss.",
        "15... e4": "! White is now forced to capture on e4 and open up the e-file to Black's major pieces. The Knight can't very well run away, as 16.Nd4? is answered by 16...exd3 17.cxd3 Nxd4 18.cxd4 Rxe2+ 19.Qxe2 Bxe2 20.Kxe2 Qxa3. The e-file will now open one way or another, to Black's great benefit.",
        "16. dxe4 Nxe4": "Threatening ...Nxc3, where the Be2 will fall while the WQ scrambles to safety.",
        "17. Qd3": "Insufficient, but I don't see anything better. This loses at least a large exchange.",
        "17... Bxf3": "! And suddenly, White is completely lost. Taking the Bishop looks bad because of the combinations resulting down the open e-file, and more material loss is imminent, but the best line I see without recapturing is 18.Bg3 Nxg3 19.Rxg3 Rxe2+ 20.Qxe2 Bxe2 21.Kxe2, which looks hopeless. So taking the Bishop is probably the best chance after all: 18.Bxf3 Nc5+ 19.Qe2 Rxe2+ 20.Bxe2, and Black will have no trouble.",
        "18. Qxf3": "?? Not that it matters very much at this point, but this move gives Black all the combinations he could want. Better was 18.Bxf3 (see above).",
        "18... Rxf3 19. Bxf3 Nxc3+ 20. Kd2 Nxb1+ 21. Rxb1 Qf4+": "0-1. Faced with the prospect of Black picking up yet another free piece with check, White throws in the towel. Black's unchallenged center and White's one critical wasted tempo were all it took to give Black an unassailable initiative and unlimited attacking potential. Many thanks to latinoeh for the game!\n\nComments on the analysis or the game itself are much appreciated; if you leave a rating please also comment letting me know what you liked or what I need to improve on. Thanks for reading!"
    },
    "url": "https://gameknot.com/annotation.pl/latvian-gambit-10?gm=45577",
    "gameName": "Latvian Gambit 10",
    "players": "latinoeh (1758) vs. bwaa (1738)",
    "opening": "Latvian counter-gambit (C40)"
}