{
    "moves": {
        "1. e4": "This is a GK tournament game in which I choose the Latvian Gambit with the Black pieces, and White quietly declines my offer, resulting in a more positional Latvian than usual. I end up with an advanced center pawn mass, and rush to use it to knock the position open (a little prematurely) before White can coordinate a flanking attack. What results is a bit of a race as each side tears the other's pawns apart in a rush to clear a path to promotion. Enjoy!",
        "1... e5 2. Nf3 f5": "?! The key move of the controversial Latvian Gambit. Very rarely seen at high levels, Black gives up a pawn (and usually much more) for a lead in space and development.",
        "3. Nc3": "This is a somewhat unusual way for White to decline the gambit. It tends to lead to somewhat more positional play than the main lines (3.Nxe5 or 3.Bc4), though the situation still generally gets very sharp, and can transpose to the Philidor Counter-Gambit after 3...d6 4.d4.",
        "3... d6": "More common are 3...Nf6 or 3...fxe4 4.Nxe5 Qf6.",
        "4. d3": "This feels very passive to me; 4.d4 is perfectly playable (reaching the Philidor Counter-Gambit), but d3 blocks White's Bishop needlessly in my opinion.",
        "4... c5": "?! Black continues to blast his pawns forward, intent on restricting White's mobility at any cost and trying to seize on his perceived passivity to make a grab for the center. This move does allow White to put an untouchable Nd5 if he desires, though, which could be problematic against Black's fully-undeveloped home rank.",
        "5. b3": "? I feel this is an error. White just trapped his LSB with the previous move, and now he spends another move preparing to fianchetto the DSB? Simple development would be stronger here, especially since that Bishop will have few prospects on b2. This move also makes c3 into a dangerous weakness.",
        "5... Nc6": "Logical development, seeking further control of d4 since White is apparently worried about it.",
        "6. a3": "This prevents ...Nb4, but that doesn't seem like much of a threat at this point.",
        "6... Nf6 7. h3": "? What is White doing? Again, he prevents Black from occupying slightly-inconvenient squares, but he allows his opponent to catch up in development while he wastes time with little passive pawn moves.",
        "7... Be7 8. Be2 O-O 9. O-O": "Both sides develop logically. Black has a formidable center pawn mass, while White seems able to develop an attack on either flank.",
        "9... d5": "!? Black's pawns are only delicately defended, but he wants to force White into an exchange and create a push in the center before White can mobilize his flanks.",
        "10. exd5": "Necessary to prevent ...d4 from locking his position down entirely.",
        "10... Nxd5": "Black releases his DSB to the kingside and targets White's vulnerable Nc3.",
        "11. Nxd5": "Probably the best move, allowing Bb2 and some degree of control over the diagonal while trading off the weak Knight.",
        "11... Qxd5 12. d4": "! Black cannot recapture, as White is threatening 13.Bc4, and White also threatens to discover an attack on the powerful but undefended Black Queen with 12...Kh8 dxe5, winning a pawn and placing a powerful wedge at e5.",
        "12... Be6": "Black continues his development and connects his Rooks, while just barely defending White's main threat.",
        "13. Bc4": "?! This is certainly more aggressive than 13.dxe5, but not quite as strong, as White's pawn structure will now take a hit.",
        "13... Qd6": "The BQ keeps everything defended, for now.",
        "14. dxe5 Qxd1": "Not 14...Nxe5?? 15.Qxd6 and Black loses the LSB for nothing.",
        "15. Rxd1 Bxc4 16. bxc4 h6": "? This prevents Ng5, but is akin to White's earlier pawn moves--it prevents something which simply is not a threat. 17.Ng5 would be met with simply ...Nxe5.",
        "17. Rd7": "This is strong, though White's Bishop is still trapping his other Rook. 17.Bb2 might have been more accurate.",
        "17... b6": "Black tries to avoid tying his Rook down to defending home-square pawns--that way lies madness.",
        "18. Rc7": "?! This is decent and forces an exchange of Rooks, but White really needs to complete his development. He can threaten the Knight much more forcefully with Bb2 (18.Bf4?! g5) followed by e5-e6 and Ne5.",
        "18... Rfc8": "Forced, but it does at least give Black's Bishop another square to escape to if necessary.",
        "19. Rd7": "White declines the trade he originally set up, which is probably a good idea, as Black can probably draw if given a strong initiative.",
        "19... Rcd8": "Black contests the open d-file, mostly because he has little alternative.",
        "20. Rxd8+": "? Why White would take here, rather than on c8, is beyond me. It seems to me that 20.e6 would be much better.",
        "20... Rxd8 21. Bd2": "? The Bishop finally comes out, to a square where it loses White a pawn and has no more influence on the board than it did on c1. I believe 21.Bb2 or 21.Bf4 would have been considerably better.",
        "21... Nxe5": "Black eagerly consumes White's passed pawn and threatens to win the Bishop as well.",
        "22. Nxe5": "This is really White's only decent move, preserving material and his kingside pawn structure.",
        "22... Rxd2": "22...Bf6 was also possible, but the pin is fairly weak and could prove dangerous for Black.",
        "23. Nc6": "White begins a game of \"who can kill all the other guy's pawns first\". Unfortunately, as he has a Knight and an unmoved Rook against a Bishop and a very powerful Rook, it's not likely to be a race he can win.",
        "23... Bf6": "Black will at least hold his own in material here (24.Ra2 Kf7 25.Nxa7 Bd4), and potentially do much better if White slips up.",
        "24. Re1": "This has the downside of not defending any of White's pawns, though it may allow him to trade off his Knight for the Black Bishop.",
        "24... Rxc2": "Black begins the massacre. He's looking to promote the c-pawn, as his Bishop controls the queening square. White cannot defend c4 now and he still has to be careful of ...Bd4 and ...Bf2+.",
        "25. Nxa7": "25.Ne7+ Bxe7 26.Rxe7 Rxc4 27.Rxa7 was probably better.",
        "25... Bd4": "Threatening 26...Bxf2+ and an easy win with a Rook against a Knight.",
        "26. Rf1": "White defends f2 but puts his Rook in a hopelessly passive position.",
        "26... Rxc4": "Soon, White will have no way to stop the c-pawn.",
        "27. g3": "Denying Black the opportunity for mate after ...Be5, if the White Rook ever leaves the back rank, but more importantly giving the King someplace to go to unpin his f-pawn while leaving the Rook free to move about.",
        "27... Rc2": "Black's passed pawn is free to advance, the White Rook is tied down again to f1, and the f-pawn will now remain pinned after Kg2. Black also threatens to slip behind the a-pawn, or sidle over with Rb2 and prevent the White Knight from coming back to b5.",
        "28. Kg2": "Necessary, if White wants to get any counterplay at all on the kingside.",
        "28... c4": "The c-pawn begins its journey.",
        "29. Kf3": "White moves on f5. He gives Black an interesting option: 29...Rc3+ 30.Kf4 Rxa3 31.Nb5 Rd3 32.Nxd4 Rxd4+ 33.Kxf5 and both of Black's queenside pawns are now free to advance, but the White King is in a very powerful spot.",
        "29... Bc5": "Black pulls the Bishop back to a safer location, while keeping an eye on f2 and now threatening a3.",
        "30. Nb5": "White's Knight finally returns from its exile, trying to re-enter the game.",
        "30... Rb2": "Black prepares to win the pawn by force.",
        "31. a4 Ra2": "Black sets a trap for the White Knight. If it tries to save the doomed pawn with 32.Nc3?, Black will win the Knight with ...Ra3.",
        "32. Nc3": "? White takes the bait.",
        "32... Ra3 33. Rc1": "Futile. 33.Kf4 would be more direct, and allow White to take the f-pawn without requiring the loss of his Rook. Now after 33...Bd4 34.Kf4 Rxc3 White must move his Rook again to avoid a devastating trade, giving Black time to play ...g6. If the White Rook had remained on f1, at least he could have taken the f-pawn for free.",
        "33... Bd4 34. Kf4 Rxc3 35. Rd1": "?! White prevents his opponent from defending f5, at the cost of his own f-pawn.",
        "35... Bxf2 36. Kxf5": "...and g-pawn. White may be hoping for a King-and-Rook mate on Black's back rank, but his opponent would have to blunder seriously to allow that.",
        "36... Rxg3": "As long as the Rook stays here, there is no chance for White to contrive a mate after Rd1+ Kh7.",
        "37. Rd5": "? 37.Rd2 followed by 38.Rc2, or else 37.Rd8+ Kh7 38.Rc8 was probably better. Now the Rook has no way to get behind the c-pawn.",
        "37... c3 38. a5": "Valiant, but foolhardy. Nothing can stop Black's pawn from getting to the coronation ceremony now.",
        "38... c2 39. a6 c1=Q 40. Rd8+ Kh7 41. a7 Rg5+ 42. Ke6": "43.Ke4 Qe3#",
        "42... Qc6+": "0-1. White throws in the towel, though he could have drawn it out for a bit longer. White's declining of the Gambit and his defensive mindset throughout the opening gave Black all the space in the world to set up his center attack and negate the weaknesses of his chosen opening. Coupled with a few positional inaccuracies from White, Black had all the tools he could desire to bring about his winning endgame.\n\nMany thanks to biscuit999 for this game! Comments on the analysis or the game itself are much appreciated; if you leave a rating please also comment to let me know what I did well or need to improve! Thanks for reading!"
    },
    "url": "https://gameknot.com/annotation.pl/latvian-gambit-8?gm=45104",
    "gameName": "Latvian Gambit 8",
    "players": "biscuit999 (1594) vs. bwaa (1666)",
    "opening": "Latvian counter-gambit (C40)"
}