{
    "moves": {
        "1. e4 e5 2. Nf3 f5": "This is the starting point for the Latvian Gambit. It is a one of the oldest known openings, first mentioned in the Gottingen Manuscript in 1490 more than 500 years ago! Still played today, even (though rarely) by grandmasters.",
        "3. exf5": "As with most gambits, White is better off accepting than declining it. The alternative, 3.Nxe5 is equally common. White gains material. What does Black gain? He gets an open f-file, which in practice turns out to be an amazing, tactical weapon against the White kingside (and, often, the king itself), and he gains center influence. White takes the f-pawn: Black has a center majority.",
        "3... e4": "It's either that, or waste time protecting the pawn. The best alternative is probably 3...d5.",
        "4. Nd4": "?! But this is unusual. More common, and probably better, is 4.Ne5 to which Black would reply 4...Nf6 with a lead in development and a good game.",
        "4... Nf6 5. g4": "The Latvian Gambit is actually a King's Gambit in the backhand, and like in that opening the other player may well use the exposed position of the kingside knight to launch an all-out offensive on that flank. And also like in the King's Gambit, this pawn structure (with reverse colors) is well known and the best weapon at hand is an immediate strike at its base: g4.",
        "5... h5": "! It is important, in the Latvian, to allow White as little breathing time as possible. Speed is the key! Moves like 5...Bf6-c4, which would be effective in other openings (we develop a bishop to take control of a key diagonal while pushing the knight on d4 away), are doubtful here: the knight would move to b3 and we would have to waste time defending or moving the bishop again, which means White ends up having a \"free\" move to bolster his defences. The game move, h7-h5, offers him no such luxury.",
        "6. g5": "Like in the King's Gambit, he cannot properly defend the pawn chain. It has to advance when pressed.",
        "6... Ng4": "!? Bold. Possibly not quite correct, but certain to cause him pause - at the least. Already White looks to be in trouble. His kingside initiative is well-nigh gone, his development is off, and the Black pieces are having all the fun. The white knight on d4 is powerless to influence the game and can be dislodged with little effort, while the black knight on g4 is extremely dangerous. And all this for a mere pawn!",
        "7. h4": "?! The GK computer evaluates this as a mistake, preferring instead 7. f4 Bc5 8. c3 and an overall advantage to White based on the precarious position of the g4 knight. I may have gone with that, but in my initial analysis I preferred either 7...ef (ep) or  7...e3!? with what certainly promises to be interesting complications.",
        "7... Bc5": "And now, with the knight in place and threatening f2, we can develop the bishop: the knight cannot move from its post or bad things will happen to White.",
        "8. c3 Nc6": "Developing with more pressure on the center. White cannot take the c6 knight because of the weakness on f2.",
        "9. Be2": "The alternative, 9.Qa4, would completely displace the queen. The game move, however, gives up whatever influence White has left in the center in return for getting rid of the thorny invader on g4.",
        "9... Bxd4": "More center influence! Capturing here enables the knight to lodge on d4. I cannot, in the situation, think of a better place to have it. Giving up the knight on g4 - and an additional pawn - is a totally ok price for that.",
        "10. Bxg4": "?! The logical follow-up to Bf1-e2. The GK computer labels it a mistake however, giving 10. cxd4 Nxd4 11. Nc3 as the better continuation. The actual difference from the game is slight, however, and Black is easily better off either way.",
        "10... hxg4": "The pawn is lost, but in return Black gains an open h-file. White has a potentially dangerous kingside majority though, so it is important to keep up the pressure and don't give him any time to breathe. Black holds the center, and as long as he can launch active threats through there White won't be able to do anything really dangerous on the kingside.",
        "11. cxd4 d5": "This center thrust is a very good move. It opens up for both the queen and the bishop, it gives Black a very firm grip on the center, and it threatens the f5 pawn at the same time, virtually forcing White's reply.\nHowever, the evilly inventive GK computer came up with something even better: 11...Qxg5! The point? 12.hg? Rxh1+ 13.Ke2 Nd4+! 14.Ke3 Nxf4+ and the White queen is dead with Black a full rook ahead in the game. The best possible defence (GK computer) is actually 12. d5 Nd4 13. Qa4 Nf3+ 14. Kd1 Qxf5, but even then Black is a pawn ahead with a superior position.",
        "12. Qxg4": "? I would probably have done the same, but this is a mistake all the same. The queen is actually exposed there and by its mere presence it helps freeze the pawns (for instance there is, now, a bind on the f-pawn). White would be better off just sacrificing the f-pawn. Eg.: 12. Nc3 Bxf5 13. Qb3 Nxd4 14. Qa4+ Nc6 15. Qb3! and White will be happy to draw on repetition (which, of course, Black won't allow - he stands to win and should play like it!).",
        "12... Nxd4": "There is no way this pawn could be defended, and now White's camp is holed like a Swiss cheese. Black is a pawn down and White has an impressive majority on the kingside, but Black's deadlock on the center completely negates that. Active threats against c2 and f5, in addition to the very uncomfortable weakness on f3.",
        "13. Na3": "Forced, or the rook is lost after Nd4-c2. Moving the queen back to d1 is even worse; this way, at least White gets a piece (partly) into play.",
        "13... Bxf5 14. Qf4": "?! Placing the queen there, on the open f-file, is not a good idea. The immediate Qg4-g3 is indicated.",
        "14... O-O": "! And this is why the queen was badly placed there. She now looks straight into the muzzle of the rook. ",
        "15. b3": "Again, the queen needs to get away from the open f-file; it is murder. 15. Qg3 is still better.",
        "15... Nf3+": "! I spent several hours on this move. White is lost. The main threat: Black moves e4-e3 and places his bishop e4, after which White can either get mated or lose the rook.",
        "16. Ke2": "I expected this move and had prepared a little surprise for him, should he make it. But the alternatives are no better, actually. The center pawns, coupled with the invading knight and bishop and the open f-file, are deadly. For instance: 16.Kd1 d4! with overwhelming Black advantage, eg. 17.d3 Bg6 -+",
        "16... e3": "!! A pawn and knight sacrifice which he cannot really refuse.",
        "17. Kxe3": "? But putting the king forward like this is ... foolhardy. Rather better is 17. fxe3 Qe8 (threatens breakthrough into the white camp on either b5 or h5) 18. Qxf3 Bd3+ 19. Kxd3 Rxf3 after which White has a measly pawn and two light pieces in return for his queen, on top of which his king remains caught in the center. Or, to illustrate: the GK computer evaluates Black's positional advantage - in addition to his material surplus - as almost equal to an additional light piece.",
        "17... Qe7+": "The e-file is open and now Black's queen enters the fray.",
        "18. Kxf3 Be4+": "A discovered bind with check. The bishop is untouchable.",
        "19. Kg3 Rxf4": "! Getting rid of the last defender...",
        "20. Kxf4 Rf8+ 21. Kg3 Qe5+": "White resigns. There is no defence against the mate."
    },
    "url": "https://gameknot.com/annotation.pl/latvian-gambit-league-d2?gm=45909",
    "gameName": "Latvian Gambit, League D2",
    "players": "mr_kill (1660) vs. rmannstaedt (1723)",
    "opening": "Latvian counter-gambit (C40)"
}