{
    "moves": {
        "1. e4": "Hey hey all. This is my third game trying this gambit that Ion turned me onto since i liked playing the F pawn to f5 when facing e4  nf3 white players.",
        "1... e5": "and so it starts with e5! ive played 3 games so far with this gambit, won the first 1, won this one which was my second game with this gambit, and lost the third with a big mistep where i was leading after my opponent blundered and i happily returned him the favor 2 moves later which was game costing for me though in exchange ><",
        "2. Nf3": "so wierd a game where i start with e5!  im usually a nc6 player, d5, or e6 player. i think the 3 latvian gambit games ive played are the only three in my history that i start with e5.",
        "2... f5": "and here is the f5! i believe the usual reply by white is nxe5 or be4",
        "3. Nc3": "but already with uncharted territory",
        "3... fxe4": "so i procede with the plan. was expecting nxe5 still",
        "4. Nxe4": "hmm odd reply. but this game has taken a semblance to an opening im used to so im comfortable with what to reply.",
        "4... d5": "d5 have total mid control.",
        "5. Nc3": "unanticipated reply. most of the time whites will send their knight to g3.",
        "5... Nc6": "and so i develop+ protect my e5 pawn. this game has a colorado gambit feel. except of having my LSB on f5 and my e pawn undevelopped. they have swap move order.",
        "6. d3": "hmm i wonder if d4 is stronger.",
        "6... Nf6": "so i develop my other knight",
        "7. Bg5": "sends in his dsb. Be7 is playable in reply. but if he wants to take out his DSB and let my Queen develop to f6 ill take it. e5 will need the future extra reinforcement. ",
        "7... a6": "and so i sneak this in to keep the knight at bay.",
        "8. Qe2": "decides to retain his DSB e5 still needs extra reinforcement and since he brought his queen in play. ill take mine into play now too",
        "8... Qd6": "e5 protection.",
        "9. O-O-O": "long castle! i face those so rarely early game. this is turning into quite a nice set up. time to remember Ion's advice on  opposite side castlings and who strikes first.",
        "9... d4": "and so time to budge the knight thats protecting the king",
        "10. Ne4 Nxe4": "exchange!",
        "11. Qxe4 g6": "i saw this move as a nice play, to put my DSB on bg7 and allow my LSB to develop gaining time on his queen and to future prevent his queen from going to h5 once he plays knight to g4",
        "12. Re1": "decides to stack the queen to push upon e5",
        "12... Bf5": "i decide to kick the queen now. he wont push with her yet",
        "13. Qe2 Bg7": "reinforce the e5 pawn he cant push into e5 yet",
        "14. h3": "hmm wasted tempo here i believe unless he plans g4.  but if he wanted to harass my LSB playing his knight to h4 was probably more viable.",
        "14... O-O": "and so king safety!",
        "15. Nh4": "theres that knight",
        "15... Nb4": "and so time to gain a pawn or save my LSB",
        "16. a3": "decides to let me save my LSB",
        "16... Na2+": "i play this to make his king uncomfortable",
        "17. Kb1": "wonder if king d2 is better",
        "17... Be6": "and cover my knight plus opening the file for my rook",
        "18. Qd2": "here i wasnt too sure what he was planning",
        "18... b5": "and so all is left is to come forward with my pawns as long as my opponent is not making aggressive moves.",
        "19. Bh6": "i was wondering if he was trying to make me budge my DSB to try to get my Rook",
        "19... Bxh6": "but i thought removing his DSB, considering his LSB' position,would remove alot of synergy to his army and leaves the f2 pawn hanging. the queen alone on h6 even with that knight close by isnt scary",
        "20. Qxh6 Nc3+": "try a knight sacrifice to open the ways for my queen and lsb",
        "21. Ka1": "opponent doesnt bite",
        "21... Rxf2": "take the hanging pawn plus now aiming a new hanging pawn on c2",
        "22. Rc1": "defends the hanging pawn",
        "22... Na2": "i attack the rook then to gain material and bring his queen back",
        "23. Nf3": "blocks my rook in. hes still safe for a while being on a dark square",
        "23... Nxc1": "so i gain the rook for knight",
        "24. Qxc1": "queen retreats",
        "24... Qd5": "get the queen ready to push with the LSB",
        "25. b3": "forced i think or maybe queen b2 is playable but then it invites Rxc2 and the situation looks rough",
        "25... a5": "keep coming forward. that foundation is about to break apart",
        "26. Nd2": "couldnt see what he was planning here",
        "26... c5": "and so even more pawns!",
        "27. Qe1": "attacks my Rook i guess he was protecting the c2 pawn so he could move his queen",
        "27... Raf8": "gives me the opportunity to stack my rooks protecting my f2 rook",
        "28. Be2": "leaves the g2 pawn hanging. i love trading out rooks for 2 minor pieces so i take it. i played through and calculated a natural reply by my opponent that would be a blunder if played, so i decide to go down this avenue.",
        "28... Qxg2 29. Bf3": "queen looks trapped or else i drop my rook!",
        "29... Rf8xf3": "but as stated before!",
        "30. Nxf3 Qxf3": "2 minors for a rook",
        "31. Qxe5": "this is where i forsaw this \"natural\" reply that is a blunder. i dont know if theres something to this move lol but why did i calculate this as to be my opponents reply after the rook exchange. and why did he play it when its so obviously a blunder...  not trying to say my opponent is bad but im asking why did this blunder look like a natural reply lol.",
        "31... Qxh1+ 32. Kb2 Bxb3": "and so i dive the LSB being up so much material and if he takes with king i believe its mate Qb1#",
        "33. Qe8+": "decides to give me a check. ",
        "33... Rf8 34. Qe5": "he couldnt recheck due to my LSB's position",
        "34... Bxc2": "clear more way! maybe a mistake here",
        "35. Qe6+": "gives another check could he achieve perpetual checks here considering my rook and pawns?",
        "35... Rf7 36. Kxc2": "eats the bishop i think this was game costing if he could force a draw before.",
        "36... Qf3": "so i stack my 2 pieces as to protect my king from the perpetuals, if they were possible",
        "37. Qe8+ Rf8 38. Qe6+ Qf7 39. Qe5": "decides to save his queen but that makes it mate",
        "39... Qf2+ 40. Kb3": "wonder if kd1 was better. forces a queen exchange but prolongs the checkmate.  i much prefered this king b3 though it allows for the most satisfying checkmates",
        "40... a4#": " all comments appreciated.  thanks again Ion for turning me onto the latvian gambit. i dedicate this nice pawn mate to you achieved with almost one of my first games with this opening"
    },
    "url": "https://gameknot.com/annotation.pl/latvian-gambit-thanks-ion?gm=59283",
    "gameName": "Latvian gambit, Thanks Ion!",
    "players": "jjdiana1 (1474) vs. trixstermtl (1508)",
    "opening": "Latvian counter-gambit (C40)"
}