{
    "moves": {
        "1. d4 d5 2. c4 e6 3. e3": "I fluctuate between 3. e3 and 3. Nf3 on occasion and decided on a more passive game in this instance.",
        "3... Bb4+": "This apparently is associated with the Ragozin Variation but I'm not sure it is such a good idea with white's dark squared Bishop still on the queenside of the board.",
        "4. Bd2 Bxd2+ 5. Qxd2": "I have to think this exchange favors white because the dark squared Bishop for black was a strong piece but white's was trapped behind a pawn wall for quite some time to come.",
        "5... a6": "I'm not sure the purpose of this move as I'm a couple of moves away from getting a piece towards the b5 square although perhaps the plan was 6. ... b5",
        "6. Nf3 Nc6 7. Bd3 Bd7": "Another move that didn't seem to accomplish a great deal to me unless Black is planning on a longside castle which does actually happen in the game continuation.",
        "8. O-O h6": "The white knight might eventually make it onto the g5 square but if Black is going for a longside castle I don't think it is such a great outpost so I thought this was a further unnecessary delay of development.",
        "9. b3": "I thought that keeping a pawn on the c4 square might prove useful although Black can still use b5 at any time to counter this strategy.",
        "9... Nf6 10. Nc3 Qe7": "Now I suspected a longside castle is coming which I think might be a mistake as my queenside development is already fairly advanced",
        "11. Ne5": "This sets up the fairly lengthy combination which should result in an even board but with white having good initiative",
        "11... Nxe5": "11. ... Bc8 12. Nxc6 bxc6 doesn't seem good for Black and anything else results in losing the light squared Bishop in an exchange.",
        "12. dxe5 Ng8": "12. ... Ng4 13. h3 traps the Knight but this is obviously not such a great square for the Knight.",
        "13. cxd5": "While the game continuation leaves the even material I thought this kept up the pressure on Black and frees up my light squared Bishop a bit",
        "13... exd5": "Anything else results in 14. d6 forcing an exchange and undoubling my pawns.",
        "14. Nxd5 Qxe5 15. Qa5": "This threatens 16. Nc7+ Qxc7 17. Qxc7",
        "15... O-O-O": "This is a mistake and overlooks the game continuation.  Clearly better is 15. ... b6 16. Qc3 Qxd5 17. Qxg7 Qxd3 18. Qxh8 which leads to a very interesting game. Also possible is 15. ... Rc8 and 15. ... Kd8 both of which also lead to fairly even games although White has a developmental advantage.",
        "16. Nb6+ cxb6 17. Qxe5 Nf6": "Making the best of the situation because anything else results in 18. Qxg7 and further loss of material",
        "18. Rac1+ Bc6": "The only move because White's Queen covers the b8 escape square",
        "19. Bf5+ Nd7": "19. ... Rd7 20. Rfd1 might be better for Black but results in unfavorable trades at the end of which White's Queen will rule the board.",
        "20. Rfd1 f6 21. Qe7 Rhg8": "21. ... Rde8 22. Qxd7+ Kb8 23. Qd6+ Ka8 24. Rxc6 bxc6 25. Qxc6+ Kb8 26. Rd7 anything 27. Qb7# or 21. ... Rhe1 22. Bxd7+ Rxd7 23. Qxd7+ Kb8 24. Qxe8+ Bxe8 25. Rd8+ and white has two Rooks against pawns to finish the game.",
        "22. Bxd7+ Kb8 23. Rxc6": "Mate is now essentially forced although there are a couple of variations.",
        "23... bxc6 24. Qd6+ Ka8 25. Bxc6+ Ka7 26. Qc7#": "I thought this was an interesting game where I had good initiative from the beginning and my pressure forced an error on which I capitilized"
    },
    "url": "https://gameknot.com/annotation.pl/league-division-d3?gm=29006",
    "gameName": "League division D3",
    "players": "tomlib (1470) vs. jananorway (1141)",
    "opening": "Queen's gambit declined (D30)"
}