{
    "moves": {
        "1. g3": "Checkmate in 14 moves",
        "1... f5": "White started with g3 and I opened with f5.  I was looking to make a fast attack.",
        "2. Bg2 Nf6": "White fianchettoed his bishop and I developed my knight to f6 ready to protect attacks on h5 attacking my king.",
        "3. f4 d6": "Now white opened his king up by pushing his f pawn to f4.  I now allowed my LB to access a diagonal by pushing my d pawn to d6.",
        "4. e3 e5": "White pushed a pawn to ee supporting his f4 pawn and allowing his queen to access h4.",
        "5. Ne2 Be7": "Now white developed his g knight to e2 preparing to castle and I developed my DB to e7 allowing me to castle.",
        "6. O-O O-O": "So we both castled.",
        "7. b3 Be6": "White pushed his pawn a b2 to b3 to allow his DB to fianchetto.  I developed my LB to e6 giving me access to h3 once my knight moved.",
        "8. Bxb7 Nbd7": "I had not protected my b7 pawn from the bishop at G2 so white captured this pawn attacking my a8 rook.  I moved my knight to d7 which would allow my queen to capture the bishop should it capture the rook.",
        "9. Bxa8 Qxa8": "So that is what happened my rook was captured and I recaptured the LB with my queen which now had access to the long diagonal to h1.",
        "10. Bb2 Ng4": "White moved DB to b2 taking control of diagonal to h8 and I continued to attack moving my f knight to g4 attacking f2 and h2.",
        "11. h3 Bd5": "White pushed h pawn to h3 attacking my knight at g4.  I now brought my LB on to the h1 diagonal with my queen at a8 following the capture of the LB earlier.",
        "12. c4 Bg2": "White now moved pawn to c4 and I am not sure my opponent understood the difficulties he was in.  I now attack rook at f1 with my LB at g2 protected by the queen at a8 so the king could not capture the bishop.",
        "13. hxg4 Bh3": "White captured my knight at g4 and I moved my LB to h3 still attacking the rook but allowing the queen to access the g2 and h1 squares.",
        "14. Re1 Qg2#": "All that white could do was to move the rook with a choice of squares f2, f3 or e1.  I think if the rook had gone to f2 then this would have meant he could take the queen when it came up to f3 or g2.  Whereas white moved the rook out of the way not expecting it to be the end of the game and I moved my queen to g2 and it was checkmate."
    },
    "url": "https://gameknot.com/annotation.pl/league-division-f3?gm=61189",
    "gameName": "League division F3",
    "players": "des2723 (1131) vs. milly64 (1086)",
    "opening": "Benko's opening (A00)"
}