{
    "moves": {
        "1. e4 e5 2. Nf3 Nc6 3. Bb5 a6 4. Ba4 Nf6 5. O-O Be7 6. Re1 b5 7. Bb3 O-O 8. d3 Bb7 9. c3 h6 10. Nbd2 Re8 11. Nf1": "Very interestingly, database results in this position are clearly for black, but SF5 gives +0.34 at depth 25.",
        "11... Bf8 12. Ng3": "The plan behind Ng3 is to install the knight in f5. SF5 prefers to first play d4 and considers white's advantage to have vanished after this move. The point is that the move allows c5, after which d4 becomes very difficult.",
        "12... Na5 13. Bc2 c5 14. h3": "Now white must play d4, sacrificing a pawn to be able to play e5, or install the knight in f5. It is not clear what h3 is good for.",
        "14... d5": "Right! Black's goal in the spanish is to play d5, and if black has not played d6, he is even able to save a tempo. After having equalized, now black gets more active pieces.",
        "15. exd5 Qxd5 16. Ne4 Qe6": "In order to avoid the doubling of the f-pawn.",
        "17. Nxf6+": "Ne4 is the best placed black piece, so it is illogical to exchange it. Nevertheless, after 17. Qe2 Rad8, black has a very nice position thanks to white's passive pieces.",
        "17... Qxf6 18. Be3 Bxf3": "This makes black's advantage vanish. Black's idea is to enter an endgame in which he is supposedly better thanks to white's weakened pawn structure, but he oversees that the bishop's pair is more than enough as a compensation. The natural alternative was 18. ... Rad8 19. Qe2 c4 20. d4 Nc6 21. dxe5 Nxe5 22. Nd4 Bd6 and black can build a very strong kingside attack.",
        "19. Qxf3 Qxf3 20. gxf3 Nc6 21. a4 b4 22. a5": "This is a bad move since Pa5 is weak.",
        "22... Rad8": "A paradigmatical example of the wrong rook! The a rook must be placed on b8 to threaten Rb5! E.g. 22. ... Rab8 23. Ba4 Re6 24. f4 Rd8",
        "23. Red1": "Again a wrong rook move! Better was Bb3, with the idea of attacking black's weak pawn on a6.",
        "23... g6": "And again black does not see the necessity of moving the rook to b8. This move also blocks the 6th row for the own rooks.",
        "24. Kg2 f5": "Blunder which could cost the game. After 26. cxb4 cxb4 27. Rdc1 there is defense against Rc4 Rac1 and winning the knight.",
        "25. Ba4 Rdc8 26. d4": "White does not see the winning move and starts a sequences which was thought to win a pwan.",
        "26... cxd4": "Now black, based on a wrong calculation, enters a sequence in which he thinks to lose a pawn, but get a drawn endgame due to a smart intermediate...",
        "27. cxd4 exd4 28. Bxd4 Nxd4 29. Bxe8 Nb3": "This is the \"smart\" intermediate. It attacks the rook to get the knight out of the rooks' attack. What Black missed (and he did not see until post mortem analysis) is that white could play the identical intermediate 30. Bd7 which wins the game. ",
        "30. Bxg6": "But white misses that too.",
        "30... Nxa1": "And he also misses that Bxf5 would win a pawn due to the same kind of attack on the rook as before.",
        "31. Rxa1 f4": "Now black seem to be safe due to the opposite bishops, but this move is a bad weakenings. Better would have been to first activate the rook with Rc5, so to avoid white's rook come into play.",
        "32. Rd1 Kg7 33. Be4 Rc5 34. Rd5": "This is the drawing move, leading to an endgame with opposite bishops.",
        "34... Kf6": "Black does not play Rxd5, since he wants to capture with the bishop. He misses the strong Rd8 (again an intermediate!).",
        "35. Rxc5": "White misses it too, and the game is dead draw.",
        "35... Bxc5 36. Bb7 Bd4 37. b3 Be5": "After 38. Bxa6 Bc7 39. h4 Bxa5 it is draw."
    },
    "url": "https://gameknot.com/annotation.pl/league-division-c3?gm=56019",
    "gameName": "League division C3",
    "players": "mischo (1770) vs. stefano80 (1839)",
    "opening": "Ruy Lopez (C88), closed, 7...O-O"
}