{
    "moves": {
        "1. Nf3": "I've been experimenting with the Kramnik-like openings recently, especially against stronger players, as I find that the more direct Kingside openings don't wrk so well against them.",
        "1... Nf6 2. g3 d5 3. Bg2 c6 4. O-O Bg4 5. d3": "A sort of King's Indian Attack type move, freeing the other bishop, covering e4 and c4, preparing either Pe4 or Pc4 and preventing Black from playing ... Ne4",
        "5... Nbd7": "Black has a flexible Semi-Slav-type position.  We're both skirting around each other at present.",
        "6. h3": "I try to avoid automatically pushing a bishop away because the rook's pawn often becomes vulnerable to a battery by Q and B, but as I want to play e4, I want to release the potential pin first.  If ...Bh5, I'll probably play g4.  If ..Bf5 or ...Be6 I've achieved my objective and have plenty of potential on e4.  If ...Bxf3, I get the bishop pair.",
        "6... Bh5 7. g4 Bg6 8. Nbd2 e5": "Now I can't play e4 immediately because the Bg6, Nf6 and Pd5 outnumber my supporting pieces on d3 and d2.  So I harrass the B again.",
        "9. Nh4 Bd6": "which has nowhere to go, so Balck develops the other B on an aggressive square",
        "10. Nxg6": "and I crystallize the bishop pair, doubling black's pawns at the same time, unfortunnately exposing the weak h pawn to rook attack...",
        "10... hxg6 11. e4": "now the numbers trained on e4 are even",
        "11... dxe4 12. Nxe4": "not sure who this swap favours more.  If I'd retaken with the pawn, the N would still have blocked my B in, so I preferred to use the N first.  Black now frees his Q to attack on that h-file though...",
        "12... Nxe4 13. dxe4 Nf6": "OK - maybe not: the N replaces its dead brother and maintains the pressure on e4, meanwhile potentially opening the d-file to the Q's influence",
        "14. Bg5": "so, naturally, I pin it.  This is no longer as risky as it would have been had Black's h pawn still been in situ.  I normally try to avoid developing a B long in front of a fianchettoed B because of its restricted scope for escape.",
        "14... Qe7": "not releasing the pin, but preparing Q-side castling to take advantage of the h file and maintaining the major piece defence of the Nf6",
        "15. Qd3": "preparing to contest the d file with the rooks, while also over-defending e4 and looking at the Q-side for future attacks when Black castles",
        "15... O-O-O 16. a3": "further preparation for the Q-side attack.  The b-pawn needs support.",
        "16... Bc5": "revealing the attack on the Q while attacking f2",
        "17. Qc3": "lining up the B with the K and making the b-pawn's advance more threatening",
        "17... Bb6 18. Rad1 Rxd1 19. Rxd1 Qe6": "releasing the pin and over-defending c6.  The immediate threat is 20...Nxe4, forking Q and B",
        "20. Bc1": "the only safe place that doesn't obstruct other pieces or risk some other positional disadvantage (20. Be3 Bxe3).  I preserve the B pair and prepare to disturb the N, constraining the K-side pawns.",
        "20... Nd7": "preparing to mobilise the K-side pawns",
        "21. b4": "oh yes, the planned advance... Do I forget that g5 would inhibit the K-side pawn advance or just revert to plan A, launching an unsubtle attack on the castled king.  I don't remember... What I like about positions like this is that battle is engaged across the whole front.   Attack and defence have to be mixed judiciously.  The initiative is worth several pawns...",
        "21... Bd4": "blocking the d-fiel and attacking my Q so that she has to vacate the attacking c-file.",
        "22. Qd3": "now threatening 23. c3, so 22...Bd4 was double-edged...",
        "22... Rd8": "sensibly supporting the pieces on the d-file but abandoning the stalled attack on the h-file.  It may also be vulnerable to a mating attack involving the battery on the d-file and the B returning to g5 in due course.",
        "23. c3 Bb6": "defending the R on d8",
        "24. a4": "preparing to cramp the B.  The q-side storm is developing apace compared with Black's stalled K-side attack",
        "24... Nc5": "! launching a double attack on the Q and forking the a-pawn and e-pawn as well",
        "25. Qe2": "seems to cover all risks except the a-pawn",
        "25... Nxa4 26. Rxd8+ Kxd8": "??  26... Bxd8 would have avoided White's forking check from d1 (as wazzu85 commented in his resignation note)",
        "27. Qd1+": "and Black resigned because the Na4 falls without compensation"
    },
    "url": "https://gameknot.com/annotation.pl/league-division-d1?gm=20124",
    "gameName": "League division D1",
    "players": "rjacobs (1569) vs. wazzu85 (1717)",
    "opening": "Reti (A05), King's Indian attack, Spassky's variation"
}