{
    "moves": {
        "1. e4 e5 2. Nf3 Nc6": "King's pawn game (C44)",
        "3. Bc4": "King's pawn game (C50)",
        "3... Qe7 4. d3 Nf6 5. Nc3 Nd4": "Här lämnar jag King's pawn game (C50). 5...d6 hade varit i den linjen, men till liten vits fördel. Nu får han ett stort övertag p g a mitt förhastade utväxlingsdrag.",
        "6. Be3 Nxf3+ 7. Qxf3": "Här hade det varit bättre att gardera mot vits S med c6 istället. Min kommande öppning för fianchetto är ganska uddlös och ger vit en tempovinst.",
        "7... b6 8. O-O-O": "Nu när vit rockar på damsidan, så framstår mitt föregående drag som ännu sämre.",
        "8... Bb7": "En fullständigt verkningslös fianchetto, som istället hämmar min L i dess framtida utveckling. Vit vinner ännu mer tempo.",
        "9. a3 O-O-O 10. Bg5 h6 11. Bxf6 gxf6 12. h3 Kb8 13. Qe3 a6 14. f4": "Här går jag på finten och tar vits bonde på f4, vilket endast ger hans D större manöverutrymme. Det hade varit bättre med antingen h5 eller f5 här, så hade jag inte varit lika inlåst på min halva.",
        "14... exf4": "En förhastad tabbe, som jag beskrev tidigare.",
        "15. Qf3 Qd6 16. Bxf7 Bg7": "Förbereder min L för att agera på diagonalen h8-a1. ",
        "17. Bd5 Bxd5": "Lika bra att utväxla och reducera pjäser.",
        "18. Nxd5 f5 19. Rhg1 Bd4 20. Rgf1 Rhf8 21. Nxf4": "Här borde jag ha tittat noggrannare, för vit gör en dundertabbe och oskadliggör hans D. Mitt första motdrag är förvisso bäst, men jag ser inte fortsättningen.",
        "21... fxe4": "Här har jag ett starkt övertag, som jag dessvärre inte förvaltar till fullo lite längre fram i partiet.",
        "22. dxe4 Rxf4": "Å vilken tabbe vit gör här, men ännu värre är att jag inte tittar noga och ser hur utsatt hans D på f3 är. *pannslag*",
        "23. Rxd4": "Här är jag blind som en åsna, och missar att ta hans D med tornet på f3.",
        "23... Qf6 24. Qxf4 Qxd4 25. e5 Qxf4+ 26. Rxf4 Re8 27. Rf5 Kb7 28. g4 Kc6 29. Rf6+ Kd5 30. Rxh6 Kxe5 31. h4 d5 32. g5 Kf4 33. Rf6+ Kg4 34. Rh6 a5 35. Rh7 c5 36. g6 Kf5 37. g7": "Här blir vit ivrig, och hoppas på en snabb promovering vid g8. Men då jagar jag honom med kungen, och minskar lite på hans övertag.",
        "37... Kg6": "Säg att benfliza går ner med tornet till h8, så undviker jag frestelsen att ta det. Istället går jag upp och schackar vid e1, så kniper jag hans promoverande bonde vid g7.",
        "38. Rh8 Re1+": "Äntligen börjar jag tänka lite taktiskt. Detta gör att han förlorar sin promobonde snart ;-)",
        "39. Kd2 Kxg7": "Sköönt !!",
        "40. Rh5 Rb1 41. b3 d4 42. Kd3 Rd1+": "Försenar hans planer genom att schacka.",
        "43. Kc4": "Här borde jag istället tänkt på att mitt torn kan nästla sig in hos vits K genom Rd2 och sedan Rc2+ när vit räddar sin bonde.",
        "43... Kg6": "Nu har vit tempot och initiativet igen p g a min föreg miss.",
        "44. Rg5+ Kh6 45. Rd5": "Vi kör sålänge remi är tänkbart. Jagar hans bönder.",
        "45... Rd2 46. Kb5 Rxc2 47. Kxb6 Rc3 48. Kxa5 d3": "Hotar tillbaka med min promobonde och slår han på c5, så hinner jag upp till promo.",
        "49. Kb5 Rxb3+": "Här slår han förmodligen mot c5, men då slår jag a3 och slår han då d3, så tar jag hans T. Slår han senare med T så får jag tillgång till d2. Går han till a4 så avancerar jag till c4 och skyddar.",
        "50. Ka4 c4": "Skönt att han inte slog min c-bonde, för nu blir det jämnare fighting. För tillfället kan vit inte slå någon av mina pjäser utan att förlora material. Bra !",
        "51. Rd4 Rb1": "Är han ivrig så tar min d-bonde, men då ryker hans T.",
        "52. Ka5 c3": "Slår han min d-bonde, så hinner jag upp med c-bonden och på slutet ryker hans T om han slår nu.",
        "53. Rxd3 c2": "Intressant läge, för om han vill hindra mig för att queena på c1 så ryker hans T.",
        "54. Rd6+ Kh5": "Nu får han jobba med T om han ska hindra mig från att få övertaget. Det ser överlag ut som att åtminstone remi ska uppstå, för hans tidigare överlägsenhet är försvunnen.",
        "55. Rc6": "Hans T kommer att ryka.",
        "55... c1=Q": "Tar han min D så ryker hans T.",
        "56. Rxc1 Rxc1": "Nu handlar det om att förhindra att han får upp någon promobonde, samt att han inte pattar in sig.",
        "57. Kb5 Kxh4": "Är han seg, så blir det här ett långt slutspel.",
        "58. a4 Rb1+": "Tar kommandot över b-filen med schack. Vill han försvara bonden så går han till a5, och då är han låst längs a-filen.",
        "59. Kc6": "Vit försöker avleda uppmärksamheten från promobonden. Glöm det !",
        "59... Ra1 60. Kb5": "Dags att sätta K i arbete.",
        "60... Kg4 61. a5 Kf4": "Med tungan rätt i mun, så kan remi undvikas. Borde nog ha gått till f5 istället, för det här leder till remi. Justja, avlägsen opposition hade varit det rätta draget. På f5 så hade våra K stått med tre rutor emellan och är antalet rutor udda, så är det opposition.",
        "62. a6 Ke5 63. Kb6 Kd6": "Än aning försenad opposition, som antagligen endast kan åstadkomma remi. Fast med tanke på vits stora övertag i mittspelet, så är remi inte så illa pinkat.",
        "64. a7": "Vi försenar hans promobonde med schack, och det kan även vara en vändpunkt till min fördel.",
        "64... Rb1+": "Nu måste han sätta sin K i säkerhet, och det sker antagligen på a6. Då kan jag skära av hans väg på c7, och promar han då så har jag en skåvare med T på a1.",
        "65. Ka6 Kc7": "Håller hans K avskuren från annat än a-filen.",
        "66. a8=N+": "Hoppsan, han överraskade mig lite där. Men då går jag bara upp ochtar opposition igen.",
        "66... Kc6 67. Ka7": "Här hade kanske T till b4 varit snabbare, men jag spelar R till a1 och får mer överblick på läget så.",
        "67... Ra1+": "Nu måste han tvunget gå med K till b8.",
        "68. Kb8": "Undviker att han repeterar dragen genom att gå med T till f1. Då kan inte parera med S mot någon ruta på rad 8.",
        "68... Rf1 69. Ka7": "Knaske hade T till e1 varit lugnare, men jag är lite irriterad och går tillbaka till a1.",
        "69... Ra1+ 70. Kb8": "Nu vill jag inte repetera några drag, så jag går till a5. Där kan vit inte hota mig med S iaf.",
        "70... Ra5": "Nu kan vit endast flytta S, annars är han matt med K till c8. Ger mig förutsägbarhet, och bättre chanser att planera fortsättningen.",
        "71. Nc7 Rf5": "Hotar f7, vilket kan ge mig hans S om vit går med K till a7.",
        "72. Na6": "Jagar in vits K i hörnet med T till f8.",
        "72... Rf8+": "Återigen blir vits drag förutsägbara, vilket underlättar.",
        "73. Ka7 Rf7+": "Går vit tilbbaka med K till b8, så tar jag opposition med K till b6.",
        "74. Kb8 Kb6": "Går vit med K till a8, så ryker hans S efter T till a7.",
        "75. Nb4": "Han bjuder på en matt, så vi tackar och tar emot.",
        "75... Rf8#": "Klart !"
    },
    "url": "https://gameknot.com/annotation.pl/league-division-d3?gm=28936",
    "gameName": "League division D3",
    "players": "benfliza (1253) vs. chekof (1210)",
    "opening": "King's pawn game (C50)"
}