{
    "moves": {
        "1. e4 g6": "My opponent lead off with the standard e4 opening. I decided to lead off with something a little different than normal for me from this position. However it still fell in line with the opening sequence I wanted.",
        "2. b3 Nf6": "My opponent opened up for his bishop, foregoing consolidating control over the center. I proceeded with my opening sequence and continued my development. ",
        "3. e5": "My opponent seized the opportunity to pressure my N. ",
        "3... Nd5": "In turn, I proceeded to emply evasive maneuvers leading my N to safety. ",
        "4. c4 Nb6": "Again, my N was pressured from its perch and I was forced to conduct evasive maneuvers. I was losing tempo but I needed to maintain my N.",
        "5. c5 Nd5": "Pressure continues to build on my N. Eventually he will no longer have any squares safe to move to. I would have to make a stand. His current position seemed to be the spot. ",
        "6. Bc4": "My moves are being forced by my opponent to protect my N. While my development is lacking, I will be able to slowly build upon my positioning.",
        "6... e6 7. d4 Bg7 8. Nf3 b6": "I was attempting to develop my pieces in accorandance with my plan while at the same time adjusting to the pressure my opponent was putting me under. The computer says that d6 was a better move by almost a pawn, however I still prefer b6 in this position. ",
        "9. b4": "My opponent made a mistake and left a hanging pawn when attempting to provide more protection for his c pawn.",
        "9... Nxb4": "I seized the opportunity to claim the open piece. ",
        "10. Bd2": "My opponent again placed an immediate threat onto my N. I would conduct a tactical retreat.",
        "10... Nb4c6": "The computer says moving my N to safety was inaccurate and I should have played bxc5. This would have provided protection to my N and best moves would have led to my developing my Q-side N. ",
        "11. Nc3 Na5": "I am behind in development however I saw an opportunity to put pressure on my opponents LSB. My opponent provided me a screen from his DSB enabling this maneuver. The computer does not agree to the tune of almost a full pawn swing. \r\n\r\nMy intent was to force the B away from the center of the board. What followed left me baffled....",
        "12. O-O": "My opponent castled leaving his B in a very precarious position. One with no defensive support. I will admit I focused on this single option. Mainly, because there was no new threat that arose and the move seemed pretty simple. ",
        "12... Nxc4 13. Bg5": "If we had followed best moves, this would have taken place a turn or so earlier. My best move hadnt changed however instead of being +1, I was now +4 and my opponent has to catch up. My opponent has better development over his minor pieces, however I am defensively sound still according to the board layout. ",
        "13... f6 14. Be3": "Essentially, my opponent wasted a full turn which allowed me more room to develop my pieces. ",
        "14... Bb7 15. a4 Nc6": "Continued development in accordance to pre-existing plans. Based on the current board layout, I did not see any issues with continuing my originally planned development. I was able to do it safely and continue to increase my hold on the match.",
        "16. Qb3": "I could not see any advantage to my opponent moving his Q and making a threat on my N. Maybe he was assuming I would overlook the move and leave my N en prise. I did not.",
        "16... Nc6a5": "I provided some backup to my N and also established a threat on his Q if left untouched. ",
        "17. Qd1 f5": "The computer says I should have left my pawn on f6 and castled short. Normally, I would have castled by now however the match was playing differently than foreseen and I did not see the need to castle. ",
        "18. Bg5 Qc8 19. cxb6 axb6 20. h4 Nb2 21. Qc2 Nbc4 22. g3": "I am not sure what my opponent was doing here other than connecting his pawn chain. Very likely that he overlooked my B and did not notice the capture. His N was left en prise. ",
        "22... Bxf3 23. Qd3": "My B was forced to retreat. ",
        "23... Bd5": "I intentionally left my B in reach of his N on c3. ",
        "24. Nxd5 exd5 25. Rfe1 O-O": "I castled....late. I did not think about the threat against my R that took place on the next move. ",
        "26. Be7 Nb2": "I saw an opportunity to further advance my position if my opponent captured my R. His Q would be taken.",
        "27. Qb5 Qb7": "Blunder. At the time I moved my Q to protect pawn on d5 as well as protect against the resulting Qxd5+. My R paid the price. A series of missteps over the next few lines would negate my early advantages. ",
        "28. Bxf8 Rxf8 29. Qxb2 c5 30. dxc5 bxc5 31. Qxb7 Nxb7 32. a5 d6": "This move let slip all of my work to this point and gave my opponent the edge and an opening to the endgame. However....",
        "33. e6": "My opponent left an open line to his R. I was happy to oblige him. ",
        "33... Bxa1 34. Rxa1 Re8": "Computer analysis says I should have moved Nxa5. I would agree looking back on it now. I saw that move at the time and discounted because I did not want to exchange my N for a pawn. However, I would have been left in a better position and still controlled the match. ",
        "35. a6": "Again, I saw the move that computer analysis says was the best move. However I did not want to lose my N. I saw a way out that still left me in a favorable position. ",
        "35... Nd8 36. a7 Nxe6": "A pawn would be promoted however it would not make it through the night. ",
        "37. a8=Q Rxa8 38. Rxa8+": "After maneuvering out of check, the next few lines would be simple posturing.",
        "38... Kf7 39. Kf1 c4 40. Ke1 d4 41. Ra1 d3 42. Kd2 Nc5 43. Rc1": "Opponent resigns. "
    },
    "url": "https://gameknot.com/annotation.pl/league-division-e2?gm=55706",
    "gameName": "League division E2",
    "players": "zendragon (1223) vs. jallen85 (1088)",
    "opening": "Robatsch (modern) defence (B06)"
}