{
    "moves": {
        "1. d4": "Here's a recent game that has, for now, taken me to the top of D1: probably not for long!  It also helped me to even my score against grietje.\n\n1.d4 continues my policy against higher rated players, which seems to be working OK at present.  I'm generally reserving 1. e4 for lower rated players.",
        "1... d5 2. c4 c6": "Leading into the Slave or Semi-Slav, one of Black's strongest replies to 1. d4 d5 2. c4",
        "3. Nf3": "Laying claim to e5 immediately and preparing for early kingside castling.  This seems to be preferred to 3. Nc3, which looks more natural.",
        "3... dxc4": "Taking the gambit pawn.  Black can try to hold on to this or he can return it in the interests of quick piece development.  If he tries to hold on to it, White can waste a lot of time and effort trying to recapture, or he can ignore it and proceed with normal development, but the pawn on c4 can interfere quite a lot.",
        "4. e4": "Taking advantage of the fact that Black's d-pawn has been diverted to c4.  This is White's most aggressive and consistent move, it seems to me.",
        "4... b5": "Black decides to hold on to the pawn.  In the QGA, Black wouldn't already have a pawn on c6, so White would be able to inhibit this move by playing Nc3 before directly attacking the pawn.",
        "5. a4": "White tries to divert or undermine the defender",
        "5... Bb7": "Black develops his bishop rather than be diverted. This os a square with high potential!",
        "6. Nc3": "Pressing on with the attack on the defender, while developing to a good central square and also defending the e-pawn, should Black release the B on b7 by playing ... c5",
        "6... a6": "reinforcing the defence at the expense of another pawn move",
        "7. b3": "Now attacking the spearhead directly",
        "7... cxb3": "taking the opportunity to swap off the doubled pawn but allowing White to develop his Q to a good square",
        "8. Qxb3 Nd7": "finally another piece develops.  Like White's earlier Nc3, this flexible move fulfils a number of objectives: preparing ... c5, ... Rb8, ...e5, ... Ndf6 or ... Ngf6 depending on how the game develops.  Alternatively, the N could go to b6, contesting d5.",
        "9. Bd3": "The most aggressive square available for this B, and preparing kingside castling.",
        "9... e6": "releasing Q and B, restraining White from advancing his d-pawn and blocking any potential attack by White on f7.",
        "10. O-O Ngf6 11. Bg5": "pinning the N against the Q and thus more or less forcing Black to play the move he wants to anyway.  This is clearly the most aggressive square for this bishop but it often results in a tame series of swaps.  An alternative strategy would be to develop it quietly on b2, with the longer term potential on the long diagonal if Black castles kingside, which Black doesn't have to do...",
        "11... Be7 12. e5": "Launching a central attack while Black's king is still in the centre and gaining space",
        "12... Nd5": "occupying a key central square that White's advance has left him, and defending the B",
        "13. Bxe7": "removing a key defender immediately rather than tamely retreating",
        "13... Nxe7": "Now Black looks cramped, though those knights are quite flexible.  White has much more space, but how should he exploit it?",
        "14. Ne4": "spotting the deadly d6 outpost, threatening to fork K and B",
        "14... O-O": "rushing to safety",
        "15. Nd6": "but it's such a nice square I occupy it anyway.",
        "15... Qb6": "defending the B while developing the Q and eying d4",
        "16. Rfd1": "hoping for an opportunity to discover an attack on d4 with Bxh7 .  This opportunity is some way off yet.  The QR is probably staying on a1 for the foreseeable future or possibly going to c1 to attack the backward pawn on c6.",
        "16... Nd5": "hopping back to its ideal square",
        "17. Ng5": "attacking h7.  The d4 pawn is defended by the aforementioned tactic, not forgetting that the BQ is tied to the defence of the Bb7.",
        "17... f5": "?? blocking the attack on h7 but leaving e6 undefended",
        "18. Nxe6 bxa4": "rather than tamely move the Rf8, Black counter-attacks by uncovering an attack on White's undefended Q",
        "19. Qxb6": "and off come their majesties.  White's spatial advantage favours this exchange at this point, not to mention the winning of the exchange to follow up with.",
        "19... Nd7xb6 20. Nxb7": "or even a whole piece :-)",
        "20... Rfe8 21. Nbc5": "White's knights dominate the board and the e-pawn is ready to become a monster.",
        "21... g6 22. Rab1": "attacking one of Black's redundant knights so that the other can't move",
        "22... Kf7": "Black does the same to White, centralising his K",
        "23. Rxb6": "! when Black recaptures, c7 will no longer be defended, so White will recover the exchange by forking Black's rooks.",
        "23... Nxb6 24. Nc7 a5": "leaving White to choose which Rook to take.",
        "25. Nxa8": "Taking the remote Rook so that Black either retakes with his N, putting it on a bad square, or removes his remaining Rook from the critical e-file.",
        "25... Rxa8 26. e6+": "the monster awakes!",
        "26... Ke7 27. Bc2": "and the B makes way for its companion",
        "27... a3": "Black has his own runner",
        "28. Bb3": "which White prepares to block immediately",
        "28... a4 29. Ba2 Nd5": "preparing to shift the blockading Bishop",
        "30. Rd3": "allowing the fork, since the Rook will take the a3 pawn and defend the B simultaneously",
        "30... Rb8": "with an eye on a back rank mate",
        "31. g3": "giving the K some air and depriving the Black N of another good square",
        "31... Rb2": "attacking the blockading B but ...",
        "32. Rxa3 Nb4": "and now the B can move safely",
        "33. Bc4 Rb1+ 34. Kg2 Nc2 35. Rxa4 Nxd4": "White has cleared up the two a-pawns for his one d-pawn, while holding on to his e-pawn",
        "36. Ra7+ Kd6 37. e7": "White can afford to let the N go in the interests of Queening the pawn",
        "37... Re1": "Black can't let him do that!",
        "38. Rd7+ Kxc5": "the only square!",
        "39. Bf7": "now Black can't prevent White from Queening",
        "39... f4 40. e8=Q f3+ 41. Kh3 Rxe8 42. Bxe8": "Now White is a whole Rook to the good but Black has one more pawn, a couple of which are potentially dangerous...",
        "42... Ne6 43. Re7 Kd6 44. Rd7+": "White can't take the h-pawn because of the fork on g5",
        "44... Kc5 45. Kg4": "preventing Black from any immediate N-checks but taking any pawns has to be done carefully because of checks from g5 or d4",
        "45... Kb6 46. Rxh7": "while it's safe to do so",
        "46... c5 47. Bf7": "again planning to blockade with the B, since the R is prevented from getting behind the pawn by Black's K - the reason for Black's 45th.",
        "47... Nd4 48. Bc4 Nc6": "threatening to fork from e5 this time.  By constantly making these threats, Black prevents White from prosecuting his own attacking plans and indirectly defends the f3 pawn.",
        "49. Kf4 Na5": "?! by going to the edge of the board, away from White's K, Black's knight concedes the f-pawn",
        "50. Bd5 c4 51. Kxf3 c3 52. Ke2": "hastening to cut off the runaway",
        "52... Kc5 53. Ba2 Nc4 54. Bxc4": "finally putting an end to Black's tricks",
        "54... Kxc4 55. Rc7+ Kd4 56. f3": "denying Black's K access to the kingside pawns",
        "56... g5 57. h4": "swapping off the remaining blockage",
        "57... gxh4 58. gxh4": "Black finally resigns as c-pawn falls and the remote pawn will Queen unmolested"
    },
    "url": "https://gameknot.com/annotation.pl/league-division-d1?gm=20603",
    "gameName": "League division D1",
    "players": "rjacobs (1597) vs. grietje (1681)",
    "opening": "QGD Slav (D11), 3.Nf3"
}