{
    "moves": {
        "1. Nf3": "This game features a very critical line against the Reti move order, 1. Nf3 d5 2. c4.  By responding 2...d4, Black enters a Benoni reversed, but with an extra tempo for White.  White can counter 3. b4, or as in this game, 3. g3, intending to undermine the center with Re1 and e3.",
        "1... d5 2. c4 d4 3. g3": "Black has given up the light squares in the center with his 2nd move.  White intends to exploit this.",
        "3... Nc6": "Entering a Schmidt-Benoni, where White has an easier time breaking up the Black center.  3...c5 is not only the most popular, but probably the most critical line.",
        "4. d3 e5 5. Bg2 Nf6": "5...f5, is a more ambitious choice, but White is fine either way.",
        "6. O-O Be7": "This move allows a tactical sequence that was once thought to be better for White, however, modern theory isnt so clear on this point.  Black can play safer lines with, 6...a5 or 6...Bd6.",
        "7. b4": "Offering the b-pawn in exchange for the e-pawn.",
        "7... Nxb4": "Sjoberg-Adler continued: 7...Bxb4 8. Nxe5 Nxe5 9. Qa4  Bd7 10. Qxb4 b6!? 11. c5, rejecting the win of the exchange to keep the light-squares around his castled position intact.  Nigel Davies in his book on the Reti, believes that 7...Bxb4 is Black's best option.",
        "8. Nxe5": "Now White is slightly better due to his strong light-squared bishop and extra center pawn.  However, this is not so easy against a 2100 player.",
        "8... O-O 9. Bb2": "Here, Nbd2 or a3 was probably stronger.",
        "9... Qd6": "Kaidanov-Khmelnitsky, Philadelphia 1993 continued 9...Ng4 10. Nxg4 Bxg4 11. Bxb7 Rb8 12. Be4 Nxd3 13. Bxh7  Kh8 14. Bxd3 Rxb2 15 Nd2 and White was better.\n\nHere Black forces the knight to move without the option of exchanging itself for the f6 knight.  Black has a space advantage, and any exchanges will only favor the cramped player.",
        "10. Nf3 c5": "Black secures his center, and with it, his space advantage.  White has to play very energetically to avoid being smothered.",
        "11. Nbd2 Re8 12. a3 Nc6 13. Qb3": "Here I planned to double on the b-file and play against the b7 pawn, using the a-pawn as a lever if necessary.  This plan was too slow, however, I should have attempted to break apart the center with Re1 and e3.",
        "13... Bd8": "Black clears the way for the attack on the e2-pawn.",
        "14. Rfe1": "The queen's rook will be needed on the queenside.",
        "14... Bf5": "14...Bg4 might have been better, as 15. h3 would provoke Black to reroute the bishop to g6, where it's optimally placed.",
        "15. Nh4 Bd7 16. Rab1": "Once a plan is chosen, It is imperative to stick to it, unless you face immediate material or positional ruin.",
        "16... Ba5": "A useful pin.  I now have to do some rearranging to free myself.",
        "17. Nhf3 Bf5 18. Bc1": "Provoking...",
        "18... b6": "Now Black's dark-squared bishop is blockading my a-pawn advance!  My queenside counterplay is stifled and I am getting a little worried.",
        "19. h3": "I decide to attempt to either exchange the light-sqared bishop for a knight, or at least drive away the bishop from the b1-h7 diagonal.  19. Qd1 seemed like a waste of time.",
        "19... Re7": "Preparing to double against the weakness on e2.",
        "20. g4": "Accepting some kingside weakness as the dark-squared bishop wont be able to participate in any attack.",
        "20... Bg6 21. Nh4 Rae8 22. Nxg6 hxg6 23. Kf1": "23. Bf1 b5! looks strong for Black.",
        "23... g5": "Black stops any ideas of kingside pawn expansion.  Once again, activity is the name of the game.  Black is doing a damn good job of keeping me bottled up.",
        "24. Qa4": "Hoping that Black will choose 24...Ne5, temporarily blocking his pressure down the e-file, so I can take a moment to untangle.",
        "24... Ne5 25. Rd1": "The first step, break that annoying pin.",
        "25... Bc3 26. Ne4": "Step two, exchange off a set of pieces to make some breathing room.",
        "26... Nxe4 27. Bxe4 Qh6 28. Kg2": "Step three, prepare to transfer the rook to either f1 or h1 and get that counterplay rolling!!!",
        "28... Qf6 29. Rf1 Ng6": "Not sure about this plan, however, I really don't see a way for Black to break through.  This will get rid of the bishop pair after the obligatory Bxf4, however, my pieces are getting active, while that dark-squared bishop looks offsides.",
        "30. Qc6": "Here the queen trade is good for White after 31. Bxc6 Rc8 32. Be4, with f4 and White is attacking!",
        "30... Nf4+ 31. Bxf4 Qxf4 32. Qd5": "Tactically preventing g6.",
        "32... g6": "Not sure if he missed the obvious tactic, as it seems now I am really breaking out.",
        "33. e3 dxe3 34. fxe3 Qxe3 35. Bxg6 Rf8 36. Be4": "My iron grip on the light-squares means Black's attack is at an end.",
        "36... Be5": "Not only guarding the g5-pawn, but threatening mate!",
        "37. Rf3 Qd2+ 38. Rf2 Qc3": "Overestimating his chances, Black had the opportunity for a three-fold repetition with 38...Qe3.",
        "39. a4 Kg7 40. Rh1": "Preparing play down the h-file. ",
        "40... Qd4": "40...Rh8 moght have been stronger.",
        "41. Qxd4 Bxd4 42. Rf5": "Now White is better.",
        "42... Re5 43. Rxe5 Bxe5 44. h4 gxh4 45. Rxh4 Re8 46. Rh7+ Kf8 47. Kf3 Re6 48. g5": "The Black rook is locked out.  and the White king has an invasion route on the light-squares.  Unfortunately, this is where Black timed out, just when the endgame was looking interesting."
    },
    "url": "https://gameknot.com/annotation.pl/league-division-c3-reti-schmidt-benoni-reversed?gm=1081",
    "gameName": "League division C3 Reti Schmidt-Benoni Reversed",
    "players": "mybookrunsdeep (1872) vs. loveguitarplay (2103)",
    "opening": "Reti (A09), advance variation"
}