{
    "moves": {
        "1. e4": "It's been a while since I added one of my games here, and although I know losses are more valuable to annotate than entertaining sac wins, which tend to be purely shown to show off, here I'd like to show an entertaining sac win.   Make of that what you will. :)",
        "1... c5": "The Sicilian, as played in our three previous encounters where I had white.   We had one win each and a draw from those games.",
        "2. c3": "The c3 variation",
        "2... Nf6": "The slightly less favoured of the two main lines; 2. ... d5 seems to give black better results",
        "3. e5": "So I push.   Black has to be a bit careful about ending up in a French-type position - not necessarily because of the position itself, but because it can be different to their usual games and they mayn't be aware of some of the traps",
        "3... Nd5": "The knight comes forward",
        "4. d4": "And I push.   The point of 2. c3 is to be able to retake in the centre with a pawn and retain the balance in the centre.",
        "4... cxd4": "So black takes",
        "5. Nf3": "And I develop.   5. ... dc 6. QxN cb 7. BxP gives white a much better version of a Danish set-up; the queen and knight are both out as well.",
        "5... Nc6": "So black develops his knight",
        "6. cxd4": "And I take now.   I don't know if the transposition 5. cd Nc6 6. Nf3 is really any different, or if black has another fifth move to play",
        "6... d6": "This or 6. ... e6 are the two most common moves here, leading to different games",
        "7. Bc4": "I develop the bishop with tempo",
        "7... Nb6": "And black retreats; this is often not a great square for the knight, and in some games, it can be undermined by a later a4-a5 push, when maybe a7 or b7 end up as targets for a queen or bishop respectively",
        "8. Bb3": "The main line is 8. Bb5 here, but this is the line I play.   It involves a pawn sac - usually temporary - for a bit of play.   8. Bb5 I think is safer, but more drawish.",
        "8... dxe5": "So black takes",
        "9. d5": "And I don't take, when the queens come off and white's king is a bit open, but play this move instead.",
        "9... Na5": "Black moves his knight",
        "10. Nc3": "And I develop.   I'm not worried about losing the LSB as the queen will cover the same squares from b3 in the event of an exchange.",
        "10... f6": "Maybe slightly ahead of time - I think black usually transposes the 11th and 10th as played in this game.   This move holds the pawn, but gives black light-squared weaknesses, which a bishop or queen on b3 can try take advantage of.",
        "11. Be3": "So I develop the bishop.   White often castles late in this opening; I'm not under any pressure at the moment, and development is more important.   The bishop here is keeping an eye on b6 and a7, as per the earlier note",
        "11... Nxb3": "Black exchanges now",
        "12. Qxb3": "And I take back.   Black is going to find it a bit hard to develop his kingside - 12. ... e6? 13. de - and maybe 12. ... Kf7 is the plan here.",
        "12... Bd7": "Instead, black develops his LSB, which can't be too bad.   But it's only postponing the problem of the king.",
        "13. O-O": "I castle now, and bring my h-rook into the game",
        "13... Qc7": "Black develops",
        "14. Nd2": "Played to stop 14. ... Qc4.   I don't want my queen moved from b3",
        "14... O-O-O": "A terrible blunder from black.   However, I return the favour.   How does white win?",
        "15. Nb5": "Not by this anyway!   I don't know why I played this over the obvious Rfc1 (Rac1 is good too).   This just gives black time to get out of trouble.   Instead, 15. Rfc1 and black can't stop 16. Nb5, trapping the queen.   15. Rfc1 is + 6.5; this is just level.",
        "15... Bxb5": "Black chops with relief!",
        "16. Qxb5": "And this is a mistake too; I'd even seen 16. Rfc1 Bc6 17. PxB bc with pressure, and ignored it.   Not an auspicious start!",
        "16... Kb8": "Black of course ducks out of the pin - and I'm just a pawn down.   And d5 is hanging too.",
        "17. Rac1": "Rather too late now!",
        "17... Qd6": "Black's queen runs...though Qd7 is slightly better, says Fritz.   Qd6 allows the reply 18. Nc4, when the knight on b6 is going to be removed, and white may get some counterplay as there's a few pieces pointing at the black king after 17. ... Qd6 18. Nc4 QxP 19. Qb3 NxN 20. RxN",
        "18. a4": "Instead, I go for the tried and, well, not all-that-trusted method of flinging pawns",
        "18... Qxd5": "Black takes",
        "19. Qe2": "And this is about my only retreat square.   But I don't actually have to retreat.   19. BxN! PxB (QxQ 20. Bc7+ and I've just won a piece) 20. QxP gives compensation for the pawn.   If 20. ... QxN 21. Qc7 Qd5 22. RxP+ QxR 23. QxR+ Qc8 24. Qb6+ and a draw by repetition.   23. ... Ka7 would be a terrible blunder and after 24. Rd1, black can resign!",
        "19... e6": "Black gives his bishop a route to the game",
        "20. a5": "And I push...and simply hang a pawn.   I'm sure we've all been there on gameknot!",
        "20... Nc8": "And I'm sure we've all missed obvious captures too!   Black retreats his knight, which turns out to be a critical mistake.   The knight was providing shelter for the king.",
        "21. Rfd1": "So I bring my last piece into the game",
        "21... Qxa5": "And black takes now.   I'm three pawns down - and Fritz scores it -0.3.   The compensation?   Lots of open files towards the black king.",
        "22. Rca1": "This is the wrong open file though.   22. Qc4 is the move here, with an attack.",
        "22... Qb4": "Black moves the queen away",
        "23. Rdc1": "And I re-take the open file I just gave up...",
        "23... Qxb2": "This has to be wrong - and is.   Black nabs a fourth pawn, and gives me a fourth open file to play on.   Again, 24. Qc4 is the reply",
        "24. Rab1": "I play this though.   I'd like to think in an OTB game, I'd have played some moves differently!",
        "24... Qa3": "Surprisingly, this is a mistake - Qa2 was the only square to go to, as will become apparently shortly.",
        "25. Rxb7+": "The only option really.   I'm four pawns down and have to attack.   Fritz says this is the only way to secure a draw.",
        "25... Kxb7": "25. ... Ka8?? Rcb1 and black can resign",
        "26. Qb5+": "The only follow-up.   26. Qf3+?? Rd5",
        "26... Nb6": "26. ... Ka8 27. Qc6+ and repetition.   But not 27. Rb1?? Bb4! and black can defend by 28. RxB Qc1+ 29. Nf1 Qc7",
        "27. Qc6+": "I have to flush the king out of course",
        "27... Ka6": "27. ... Kb8?? 28. Qc7+ Ka8 29. QxR+ and I've got my rook back and am still attacking",
        "28. Rb1": "Not quite how the knight on b6 usually ends up undermined in this opening!   With the queen on a2 (see note to the 24th move), this move wouldn't be possible and white would just be lost",
        "28... Bb4": "Here, Fritz gives the amusing defence 28. ... Qb4 (or Qd6) 29. Ra1+ Qa3 30. Rb1 and a draw by repetition!   Black offers his queen to defend the knight, and I can't take as I'm a rook and three pawns down already.",
        "29. Bxb6": "Again, the only move - Fritz actually gives a slight plus now.",
        "29... axb6": "29. ... Rd6 was another option here.   But after 30. Qc4+ Kb7 31. Bc5 RxN 32. Qb5+ (not 32. BxB as 32. ... Qd3 forks queen and rook!) Kc7 33. BxB, I've a strong attack.   33. ... Rb8 is a tricky reply, however, when I can't take the queen because my back rank is weak - 34. Ba5+ Rb6 35. Qa6! is the only way to keep the advantage.   Appropriately, the a7 pawn is the weakness now - again as singled out in the opening, even if at this stage, that's just a pure coincidence.",
        "30. Nc4": "Again, the only follow-up - forking mate and the queen.   Here, black has to admit the attack and give up his queen - 30. ... Qa5 31. NxQ BxN 32. Qxe6, and I've a queen for a rook, bishop and two pawns, and Fritz says I'm not losing, though black would have plenty of opportunity to prove me wrong over the board.",
        "30... Rd6": "This, unfortunately, is a terminal mistake.",
        "31. Nxd6": "And for a change, I spot it.   Black can't recapture because of QxP#, while 31. ... Bc5 - maybe black's original plan - is met with 32. Qb7+ Ka5 33. Qa7#",
        "31... Qd3": "This allows a similar mate to the one just described - black's only defence was to cover b7 by 31. ... Rb8, but I still win with 32. Qc4+ b5 33. Qc6+ Ka7 34. NxP+ RxN 35. QxR and the bishop is gone next, and the win will be trivial",
        "32. Qb7+": "So check",
        "32... Ka5": "Forced",
        "33. Qa7+": "Check",
        "33... Qa6": "Forced",
        "34. Ra1+": "And I pick up the bishop and queen, so black resigned.   Aside from the fun tactics (and the embarrassing misses on my behalf!), I found the couple of lines Fritz picked up on that I simply hadn't considered to be interesting - moves where I reckoned there was only one plan of action, and was completely blinded to a second, better, plan as a result."
    },
    "url": "https://gameknot.com/annotation.pl/league-division-d2?gm=61872",
    "gameName": "League division D2",
    "players": "cdeburca (1672) vs. oscarsneck (1649)",
    "opening": "Sicilian (B22), 2.c3, Heidenfeld variation"
}