{
    "moves": {
        "1. e4": "Here's a recent win in the League: not many of those to choose from recently :-(",
        "1... e5 2. Nf3 Nc6 3. Bb5": "The Ruy Lopez again.",
        "3... d6": "The Steinitz Defence, not one I meet very often.",
        "4. d4": "The most aggressive continuation, threatening to win the pinned Nc6.",
        "4... exd4 5. Nxd4": "Now the double attack threatens to win a pawn.",
        "5... Bd7": "...easily countered with Black's standard developing move.",
        "6. O-O Nf6 7. Re1 Be7 8. Nc3": "With the d-pawn already gone and the B not having been pushed back to a4 yet, I don't see any need for the slower 8. c3 and 9. Nd2 so typical of other Ruy Lopez lines.  This N is looking at leaping to d5 and thence either c7 or e7, depending on the opportunities available.",
        "8... O-O 9. Bf4": "First I look to complete my development, contesting control of e5.",
        "9... Nxd4 10. Qxd4": "Black's swap off relieves his cramp but White has even more central control.  The Queen seems comfortable here.",
        "10... Bxb5 11. Nxb5 a6 12. Nc3 Qd7 13. Rad1 Ng4": "? seems to lose a tempo while allowing White time to give his K room to breathe",
        "14. h3 Nf6 15. Nd5": "as planned 7 moves earlier",
        "15... Rfe8 16. c4 Rad8 17. Nxe7+ Rxe7 18. Bg5": "pinning the N against the Rooks",
        "18... Re6 19. f4 Rde8": "answering the frontal assault by doubling his rooks",
        "20. Bxf6": "To reduce the force attacking e4",
        "20... Rxf6 21. e5": "and e5 ...",
        "21... Rg6": "threatening ...Qxh3",
        "22. Re3 Qc6": "and now ... Qxg2#",
        "23. Qd5 Qb6": "Pinning the Rook and threatening the pawn on b2",
        "24. Qd2 dxe5 25. Kh2 Rd6 26. Rd3 f6 27. Rxd6": "at last I can push back against Black's threats",
        "27... cxd6 28. Qxd6 Qxd6 29. Rxd6": "Material is still level put the pawns are unbalanced, so there's still the probability of a result",
        "29... e4": "Black advances his protected central pawn, making it a passed one",
        "30. Kg1": "My King rushes back to try to stop it queening.",
        "30... f5 31. Kf1 g6 32. Ke2 Kf7 33. Ke3 Re7 34. c5 Rc7": "This only encourages White to advance his other queenside pawns",
        "35. b4 Ke7 36. g4": "aimed at breaking up Black's impressive chain so that I can attack the stragglers",
        "36... a5 37. a3 Kf7 38. gxf5 gxf5 39. Rh6 Kg8 40. Rf6 Rf7": "? Until recently, I've been avoiding swapping Rooks but now swapping risks giving White the win as Black's King is too far away from his advanced pawns.",
        "41. Rd6": "only I didn't think Black's K was far enough away at this point so I continued to avoid the swap.",
        "41... Rg7 42. Rd8+ Kf7 43. Rd7+ Kf6 44. Rxg7": "but now I do, and Black's K is even further from the final battlefield.",
        "44... Kxg7 45. bxa5": "Now Black's fate is sealed. The b7 pawn can't stop both my 5th rank pawns.",
        "45... Kf7 46. c6": "and Black resigned because he cannot stop one of my pawns."
    },
    "url": "https://gameknot.com/annotation.pl/league-division-d1?gm=22954",
    "gameName": "League division D1",
    "players": "rjacobs (1522) vs. aphgan (1609)",
    "opening": "Ruy Lopez (C62), old Steinitz defence, Nimzovich attack"
}