{
    "moves": {
        "1. e4 e5 2. Nf3 Nf6 3. Nxe5 c6": "This simply loses a pawn - d6 (Nf3) Nxe4 is much better here",
        "4. Bc4 d5 5. exd5 cxd5 6. Bb5+ Nbd7 7. Qe2 Qe7": "I would prefer Be7 here, as developing that bishop and castling is now very difficult.",
        "8. O-O a6 9. Bxd7+ Bxd7 10. Re1": "It is vital that you get the king off e file now. O-O-O is not pleasant as queenside is so exposed, but it is hard to gain enough moves to get the kingside free to castle, especially as the f8 bishop is currently defending your queen.",
        "10... Ne4": "This is a mistake. Two bishops tend to be better than two knights or a bishop and a knight, so the swap is beneficial for white generally. It also gives you an unpleasant choice. Either capture with the king, leaving it exposed in the centre and unable to castle, or capture with the queen and lose the knight at e4 (it is then pinned and you cannot escape from the d or f pawns if I advance them).\n\nSomething like Bb5 would retain the initiative and allow Ne4 to follow anyway.",
        "11. Nxd7 Qxd7 12. d3": "Forcing the loss of the e4 knight whilst opening the diagonal for my bishop.",
        "12... Qf5 13. dxe4 dxe4 14. Qxe4+ Qxe4 15. Rxe4+": "The exchange is now very beneficial to me as the material lead is a knight and a pawn. If ahead by a minor piece, trading off material is almost always advisable.",
        "15... Be7 16. Nc3 O-O 17. Nd5": "Decided to play Nd5 instead of develop the bishop.",
        "17... Bd6 18. Bf4": "Encouraging the continuing exchange of material whilst allowing my a1 rook to get into play.",
        "18... Bxf4 19. Nxf4 Rac8 20. c3 b5 21. Nd5": "Threatening the fork. I would play Rc-d8 to remove the threat of the fork whilst getting your rook on the open file. Kh8 is an alternative.",
        "21... g6 22. Ne7+ Kg7 23. Nxc8 Rxc8 24. Rd1": "Getting my rooks in control of both open files so that there's nowhere active for you to get your rook to.",
        "24... Rf8": "Rc7 is better. That way I cannot easily get onto the 7th rank and you can play Ra7 or Rb7 to defend the pawns on the queenside as necessary. You need to hope I blunder now.",
        "25. Rd6 f5 26. Re7+ Rf7": "This is difficult. I would play Kh6 as keeping your rook is your only vague hope now.",
        "27. Rxf7+ Kxf7 28. Rxa6 Kg7 29. Rb6 h5 30. Rxb5": "Now there is simply nothing left. Many thanks for the game :)",
        "30... Kh6 31. a4 h4 32. a5 f4 33. a6 g5 34. a7": ""
    },
    "url": "https://gameknot.com/annotation.pl/league-division-d2?gm=18196",
    "gameName": "League division D2",
    "players": "topazg (1533) vs. tounaboa (1296)",
    "opening": "Petrov (C42), French attack"
}