{
    "moves": {
        "1. e4": "I think I may have played the perfect game here!",
        "1... e6": "I started with e4 not something I like to go with.  I sometimes think maybe my opponent has a lot of knowledge and can use this to gain advantage so I try to go with something different.  My opponent went with e6 nothing too aggressive.",
        "2. Nc3": "I developed my knight to c3 protecting my pawn at e4.",
        "2... d5": "Black went with d7 to d5 and can capture my pawn.",
        "3. d4": "I now go with d4 stopping black going d5 to d4. and attacking my knight.",
        "3... Nf6": "Black develops his knight to f6 and could capture my e4 pawn and protects his d5 pawn.",
        "4. Bd3": "I decide to go with Bd3 protecting my e4 pawn.",
        "4... Be7": "Black develops his DB to e7.   Black has the queen at d8 and the DB at e7 ready to attack down the diagonal to h4.  Once the f6 knight moves these pieces can use their fire power.",
        "5. e5": "I decide to block the center with e4 to e5.  I am attacking the f6 knight.",
        "5... Ne4": "So black moves his knight to e4 and is able to capture my knight on c3.  I do have my LB at d3 but I am reluctant to capture since it would be recaptured by pawn at d5.",
        "6. a3": "I could have captured the knight at e4 with my c3 knight but instead I moved pawn to a3.  This was done to stop black pinning my knight with his bishop.  I did not think about black moving his DB to h4 and attacking my pawn at f2 which was already attacked by black's e4 knight. I could have developed my knight to f3 which might have been the best move by me to avoid black using the h4 square to attack my king.",
        "6... Nxc3 7. bxc3": "So my knight was captured by black's e4 knight and I recaptured with my b2 pawn.  I now have doubled pawns on the c file and the b file is open.",
        "7... O-O": "Black now castled.",
        "8. Nf3": "I now developed my knight to f3 and can also castle.",
        "8... Nc6": "Black also developed his knight to c6.  Black seems to have almost completed his opening with the development of the knight but is looking quite squashed and only really has access down the d8 to h4 diagonal.  White has the centre controlled at present. ",
        "9. O-O": "White now castles.",
        "9... a6": "Black moves pawn to a6 to stop my LB moving to b5 and pinning his knight at c6.",
        "10. Bf4": "I now develop my final piece, my DB, to f4 which provides protection to the e4 pawn again since the f3 knight is already protecting this.",
        "10... b5": "Black moves f7 to f5 which will allow his LB to access the a8 diagonal as well as the c8 diagonal.",
        "11. Qe2": "I move my queen to e2 and the rooks are now connected.  There is one weak pawn at c3 but my emphasis is going to be on attacking black's king from the king side.",
        "11... Bb7": "Black moves his LB to b7 and I would say that his bishops are on good squares but at present the knight is blocking the LB.  Black's knight will find it hard to get out since he does not have any useful squares to  occupy.",
        "12. g3": "I now move pawn to g3 in order to block black's access to h4 by his DB.",
        "12... Rb8": "Black moves his rook to b8.",
        "13. Kh1": "I moved my king to h1 as if black did attack via h4 square then my king may be at risk of check down the g file.",
        "13... Rc8": "Black moves his rook again, this time to c8, I am confused as I would have thought that may have been the best move anyway so why did black move his rook to b8!  Black can now move his queen away and the pawn at c7 is protected.",
        "14. Ng5": "Whilst black was making strange moves I continue to place my pieces with a view to finalising my attack.  I move my knight to g5 protected by the DB at f4.",
        "14... Bxg5": "As expected black captures my knight but I do not recapture with the DB.  At present I also have my LB at d3 which is attacking the pawn at h7.  My queen is at e2 and looking at the h5 square.",
        "15. Qh5": "I now move my queen to h5 and I am attacking the h7 square.  Black has his pieces on the queen side and unable to gain access with his other pieces as I have the centre blocked.",
        "15... Bxf4": "Black captures my DB at f4 with his DB at g5 but I could recapture with my pawn at g3.  I think the best move here might have been to move his pawn to h6 and prevent white's queen and LB working together.",
        "16. Bxh7+": "Now white captures the pawn at h7 with his LB and black's king cannot recapture as the queen is at h5.",
        "16... Kh8": "Black's king is forced to move to h8 as this is the only square available.",
        "17. gxf4": "White now captures black's DB at f4 with the pawn at g3.",
        "17... Ne7": "Black moves his knight to e7 possibly thinking on his next move he may go to g8 I am not sure.  A better move might have been pawn to g6 attacking the queen.",
        "18. Rfg1": "White moves his rook to g1 in case black should move his knight to g6 then this could be captured.  ",
        "18... Nf5": "So black's knight goes to f5 but I don't think this will be able to stop white's attack.",
        "19. Bxf5+": "White captures the knight on f5 with the LB at h7 and now the king is in check by the queen at h5.  The LB cannot be recaptured as the king needs to move out of check.  But once the king moves it will be all over.",
        "19... Kg8 20. Qh7#": "Black's king moves over to g8 his only square and white finishes the job with checkmate on h7."
    },
    "url": "https://gameknot.com/annotation.pl/league-division-f3?gm=63052",
    "gameName": "League division F3",
    "players": "milly64 (1068) vs. safeadonna (1156)",
    "opening": "French (C00), Pelikan variation"
}