{
    "moves": {
        "1. e4 c5 2. Nf3 d6 3. d4 cxd4 4. Nxd4 Nf6 5. Bd3": "an unusual response to the Sicilian",
        "5... e5 6. Nb5 a6 7. Nb5c3 Be6": "covering the hole at d5, something I'm somewhat obsessive about.",
        "8. Bg5 Nbd7 9. Nd5 Bxd5 10. exd5": "I don't mind White occupying d5 with a pawn: much better than an unmovable piece.",
        "10... Be7 11. c4 O-O 12. Nc3 Nc5 13. O-O Nxd3": "ensuring that White can't exploit a bishop pair but giving up my most active piece to do so",
        "14. Qxd3 h6 15. Bd2 Rc8 16. Ne4 Nxe4 17. Qxe4 f5 18. Qd3 Qc7 19. b3 e4 20. Qg3 Bf6 21. Rad1 Be5 22. f4 Bd4+ 23. Be3 Bxe3+ 24. Qxe3": "Now we're reduced to heavy artillery and pawns.  White's pawn structure looks marginally better but the game looks pretty even to me, especially as I have a monster passed pawn at e4.",
        "24... Qc5 25. Rfe1 Qxe3+ 26. Rxe3 g5 27. Rf1 Kg7 28. g3 Kg6 29. Kg2 h5 30. h3 b5": "This minority attack threatens to win a pawn on c4",
        "31. Rc1 h4 32. Ree1 hxg3 33. Kxg3": "Black's attack seems to be working.  White's kingside pawns are split and Black can advance his King to support his advancing pawns.",
        "33... Kh5 34. fxg5 Kxg5": "Two connected passed pawns!",
        "35. h4+ Kh5 36. Ref1 Kg6 37. Kf4 Rfh8 38. Rfg1+ Kf6 39. Rgh1 bxc4 40. Rxc4 Rxc4 41. bxc4 Rh5 42. Rh2 Ke7 43. Re2 Rxh4+": "? this isolated passed pawn was not as important as the one on f5, supporting my pawn on e4.  My rook had it blocked.",
        "44. Kxf5 Rh5+ 45. Kxe4": "The pride of my position has been thrown away ",
        "45... Kd7 46. Kd3 Rh3+ 47. Re3 Rxe3+": "virtually admitting defeat.  I looked at alternatives but they all looked worse.",
        "48. Kxe3 Kc7 49. Kd4 Kb6 50. a3 a5 51. a4 Kc7 52. c5 dxc5+ 53. Kxc5 Kd7 54. Kb5 Kd6 55. Kxa5 Kxd5 56. Kb6 Kd6 57. a5 Kd7 58. Kb7": "That's enough.  I threw away an excellent position in this game."
    },
    "url": "https://gameknot.com/annotation.pl/league-division-d1-endgame-2?gm=25082",
    "gameName": "League division D1 - endgame 2",
    "players": "chesstico (1723) vs. rjacobs (1580)",
    "opening": "Sicilian (B54), Prins (Moscow) variation"
}