{
    "moves": {
        "1. d4": "Queens pawn opening",
        "1... e5": "I play e5 hoping to develop my pieces faster than my opponent and put pressure on him from the start.",
        "2. dxe5": "This is pretty standard and most people should and do take the e5 pawn with dxe5",
        "2... d6": "If white opts to take then I develop my black bishop and i am able to develop all my other pieces (except rooks) in 1 move. White's options when I play d6 include Nf3, Nc3 and sometimes exd5.",
        "3. Nf3": "The reason behind Nf3 is because white doesn't want black to develop his pieces so quickly and make an attack.",
        "3... Bf5": "Bc5 is because if I decide to play Nb6 it gives my opponent the chance to play Bg5 which means I must play Qd7 which will trap my Bishop and ruin what attack i may muster for a few moves (by then my opponent could force me to defend). ",
        "4. Nc3 Nc6": "(White= Move 4-Nc3) Now that I play Nc6; it is attacking the e5 pawn I was orignally down, if white now plays Bg5 I can play my queen to d7 without blocking any pieces.",
        "5. e4": "At this stage I am down -1.73  but i expect this being a pawn down.",
        "5... Bg4 6. Bf4 Bxf3": "The reason behind Bxf3 was because I wanted white to have double pawns on the f file which isn't always bad, it can protect pawns close together, but in this case I thought it helped me. White can respond with Qxf3 or gxf3 but that gives me my pawn back on e5. Qxf3 is the better move.",
        "7. gxf3": "The reason why this is a blunder is it gives white his pawn back and weakens the king side, from here I had to attack until my opponent defended it.",
        "7... dxe5 8. Be3": "7. dxe5, 8. Be3",
        "8... Bb4 9. Qd3": "In my opinion this isn't exactly a blunder (Qd3, the game is still even) it's an ok move. I planned from here what I wanted to do and it worked out due to a blunder by my opponent, it was all avoidable of course but so are most things in chess and I felt good that it paid off.",
        "9... Qxd3": "So I could keep the knight pinned and so that I could play Nd4 next",
        "10. cxd3 Nd4": "Black has a 0.53 advantage in this position, I played Nd4 so I could attempt Nc3 or Nxf3 if white blundered. White could also have played 11. Bxd4, exd4, 12. a3.\n\n",
        "11. Rc1": "The reason black can't take f3 with Nd4 is because after Nxf3, 12. Ke2, Nd4+, 12. Bxd4, exd4, 13. Nd5. Threatening both my Bishop on B4 and pawn on c6 (with both rook and Knight), so Ba5 isn't much use, and it will hurt by defence and losing the c pawn.",
        "11... O-O-O": "To stop the attack on c7 if white seen it.",
        "12. Be2": "To protect the f3 pawn from Nd4",
        "12... Ne7": "To develop my knight and try and put more pressure on his king-side if he castles. ",
        "13. O-O": "Blunder- after this move white has lost the game as he goes down a rook and ends up resigning.",
        "13... Bxc3": "So I can play Nxd2 if white takes back the bishop with his pawn, or if he plays Bxd4 I reply with bxd4 and up a piece.",
        "14. bxc3": "White takes Bishop instead.",
        "14... Nxe2+": "Leaving black to collect the pieces and winning the game",
        "15. Kh1 Nxc1": "There are mistakes in this game which let me win the game, yes white could have avoided all this if they had played a3 earlier but everyone who has won has done so due to a blunder by their opponent, and today I got the win from poor play and from having the courage to try out the opening against human players for the first time. Some people may look down at my opening but until I lose badly against an opponent I will still use this opening from time to time "
    },
    "url": "https://gameknot.com/annotation.pl/league-division-d2?gm=50537",
    "gameName": "League division D2",
    "players": "wierdaj (1505) vs. blackie_chan (1589)",
    "opening": "Queen's pawn (A40), Englund gambit"
}