{
    "moves": {
        "1. e4 e6": "Black opens with the French.",
        "2. d4 d5 3. e5": "? I play the Advance Variation in the French Defense! Maybe not the best move, according to Gameknots own Database. Better was Nc3 or Nd2!",
        "3... c5": "A very common pawn-push in this and similar positions. Black tries to attack the base in Whites pawn chain, here the pawn at d4!",
        "4. c3": "My standard response to c5. All other alternatives I´m seeing as weaker, with the risk of getting a weak pawn and all such drawbacks!",
        "4... cxd4": "A very weak move according to the Gameknot Database! Giving me a somewhat easier play. Better was Nc6 or Qb6!",
        "5. cxd4 Nc6": " Now comes Nc6!",
        "6. Nf3": "At this point, I had a pretty good game, maybe even some slight advantage?",
        "6... Qb6 7. Be2 Bb4+ 8. Nc3 Nge7 9. a3": "? Maybe was it better to continue development with Bd2 or even 0-0 ? \n",
        "9... Bxc3+ 10. bxc3 Nf5 11. O-O": "Now I´m castling kingside. ",
        "11... Bd7 12. Bd2": "Continuous development. Now is it time to come up with some kind of plan for the middlegame!",
        "12... h6 13. Rb1": "Chasing the queen away! It´s also seen as good strategy to centralize the rooks in the beginning of the middlegame!",
        "13... Qc7 14. Bd3": "Aiming towards the kingside with my light-squared bishop.",
        "14... g6": "? Maybe not the best if Black plans to castle kingside? But maybe has Black other plans?",
        "15. Bb5 O-O-O": "Castling queenside was maybe Blacks best option here, because he had weakened his pawn shield on the kingside. It´s also possible that Black plans a pawn storm on the kingside! ",
        "16. Bxc6 Bxc6 17. Rc1 b5": "It don´t look like Black want to make a pawn storm on my kingside after all?",
        "18. Rb1 a6": "Now is Blacks pawn shield in front of the King to some extent weakened! Not very good!",
        "19. Qc1 g5 20. Re1 Rdg8 21. g4": "I have heard a theoretical wisdom that if the center is locked, you can advance with your pawns in front of your King, without too much risk! ",
        "21... Nh4 22. Nxh4": "Swapped knights!",
        "22... gxh4 23. h3": "Best to defend my g4-pawn!",
        "23... h5 24. f3": "Now have I defended my Kings camp successfully, at least for the moment!",
        "24... f5": "Black tries to increase the pressure!",
        "25. g5": "Probably the best defense move?",
        "25... f4": "A little miss there? The pawn is actually undefended !",
        "26. Bxf4": "My bishop swallows the pawn with good appetite!",
        "26... Qf7 27. Rf1 Qf5": "Threatens my h3-pawn !",
        "28. Kh2 Rgf8": "Threatens my bishop and also increases the pressure on the f-file !",
        "29. Be3 Qd3 30. f4": "Locking it up a bit !",
        "30... Be8 31. Qd2": "I made a proposal to change queens! Think that I have some advantage now, a defended free pawn and all that, so it made a point to try to reach an endgame here!",
        "31... Qe4": "Black refused to change queens!",
        "32. Rbe1 Qh7 33. Bf2 Bg6 34. Bxh4": "Wins another pawn!",
        "34... Be4 35. Qf2": "The game has changed to some kind of slow manouvering with the goal to step by step slowly placing the pieces better! I think that´s named positional play?",
        "35... Rf5 36. Rxe4": "A positional sacrifice! I wasn´t clear if this would winning, but it felt right !",
        "36... dxe4 37. Qe3 Rf7 38. Re1": "And Black can´t defend his e 4-pawn !",
        "38... Rhf8": "Black are trying to make counter-threats! In this case against my f 4- pawn!",
        "39. Rf1": "Must defend it with my Rook !",
        "39... Kd7 40. Kg2": "I tried to reorganize a bit!",
        "40... Kc6 41. Bg3 h4": "A little pointless , perhaps?",
        "42. Bh2 Kd5": "Don´t think that this King walk to the center is good for my opponent ? Seems too risky in my opinion.",
        "43. Qe2 Rf7f5 44. Rc1": "Planning c 4 check!",
        "44... Qc7": "Defence move against the check!",
        "45. Re1": "The e4 -pawn will fall with havoc in Blacks camp !",
        "45... Qxc3": "Wins  a pawn, but definitely not the game!",
        "46. Qxe4+ Kc4 47. d5+ Kc5 48. Bg1+": "Disastrous for Black, this move!",
        "48... Qe3 49. Bxe3#": "Checkmate. A Happy ending for me in this game! I was especially proud to win against a player with over 1600 in rating!"
    },
    "url": "https://gameknot.com/annotation.pl/league-division-d2?gm=45152",
    "gameName": "League division D2",
    "players": "haratta (1483) vs. lemoinillon (1614)",
    "opening": "French (C02), advance variation"
}