{
    "moves": {
        "1. e4": "This is an interesting game of attrition where there were ebs and flows with the momentum shifting one way then the other before the game came to its natural conclusion. For much of the end-game it looked like a draw when Black made a critical mistake that decided the game.",
        "1... e5": "the opening was fairly typical with each of us jockying for control of the board as the opening developed",
        "2. d4": "I offered the Queens pawn in an exchange",
        "2... Nf6": "but the offer was declined forcing me to defend the Kings pawn",
        "3. Nc3": "This presented black with a  chance to pin the Knight against the King",
        "3... Bb4": "which he did! ",
        "4. a3": "so I hit back, but",
        "4... Bxc3+": "black forced the exchange which is fine with me since I like my Bishops for later in the game and don't mind surrendering a Knight for a Bishop exchange",
        "5. bxc3": "The problem this presents for me is the double pawn in the C rank",
        "5... exd4": "But black gave me an immediate opportunity to solve that problem",
        "6. Qxd4": "But I decline the offer choosing instead to bring my Queen into the game. ",
        "6... O-O": "causing black to resort to Castling, a good defensive manouver under the circumstances",
        "7. e5": "but it allows me to advance my Pawn into black territory and threaten the Knight",
        "7... Re8": "Moving the Castle to the open rank is a good move, and I am prevented from capturing his Knight by the check that would result. ",
        "8. Nf3": "So I continue my development toward Castling",
        "8... d6": "this presents a situation where a Queen exchange might be in the offing",
        "9. Bf4": "But I am also able to advance my development by bringing my black Bishop into the game",
        "9... dxe5": "allowing this Pawn attack.",
        "10. Nxe5": "But a pawn will never overcome a well positioned Queen protected by her Knight! And still the Queen exchange looms",
        "10... Nc6": "The game is starting to open up now and this Knight attack returns balance to the board, even though I think I still have the advantage by being on the front foot and challenging more of the black side of the board. ",
        "11. Qxd8": "Believing that I have the tactical advantage, I push forward and exchange Queens",
        "11... Rxd8": "This position increases black strength though with the Castle controlling the center rank",
        "12. g3": "So I get ready to castle",
        "12... Ne4": "Seeing the potential of my retreat, the black Knight comes riding in to cut me off",
        "13. c4": "I protect my vulnerable Pawn",
        "13... Nc3": "and the Knight jumps in to give the Castle cover in a planned long range attack",
        "14. Bd3": "So I protect the king with my Bishop preventing the Castle from advancing too far and still allowing me to castle",
        "14... Bh3": "With this move, my King is penned in and can pretty much only move freely on the e rank. Should black be able to threaten me on the e rank, I am in trouble",
        "15. a4": "So with an attack is arriving in the middle of the board, I attack on the flank to draw the army away",
        "15... Nb4": "I am not sure I have achieved my desired result, and with this move, my bishop is under double threat",
        "16. Ra3": "I continue to press on the flank to keep black's attention away from my threatened King",
        "16... Nba2": "By moving thus, the knights are pinned themselves unless they can escape by threatening another piece",
        "17. Kd2": "I take the opportunity to move my King into the attack",
        "17... Ne4+": "unfortunately giving his Knight just the opportunity I describe where  check prevents me from capturing the now abandoned Knight",
        "18. Ke3": "So I press on with the King forcing the attack. This is unusual for me, but without Queens on the board, and with his black Bishop captured, the King has more freedom over the board during the middle game",
        "18... Nac3": "Again the Knights protect each other once again. But the board has changed in character now, and although black has several minor pieces in my half of the board, I am still in good position, and neither player is seriously at a disadvantage. ",
        "19. f3": "But a Knight guarded by a Knight is no match for a free Pawn with capture on his mind",
        "19... Nc5": "And by running away, black has chosen which Knight to sacrifice ",
        "20. Rxc3": "which my castle captures dutifully putting me ahead with several points for a time. ",
        "20... Nxa4": "with this move, the deficit is reduced, and my Castle is threatened.",
        "21. Rb3": "so I position my Castle to capture the knight should he move it toward my King",
        "21... Nc5": "but he runs away allowing me to consolidate my position",
        "22. Rb5": "so I force the issue",
        "22... b6": "Foiled!",
        "23. Bf1": "So I threaten the Bishop to force his retreat...",
        "23... a6": "But black challenges my Castle instead forcing me to retreat",
        "24. Rb1": "which I do",
        "24... Bf5": "and then, so does he, but he puts my pawn in danger by pinning him against my Castle",
        "25. Rc1": "so I cover him and remove the danger for the time being",
        "25... Ne6": "Black retreats to regroup for his next attack",
        "26. Nc6": "so I threaten the Castle with an obvious move",
        "26... Rde8": "Which forces the Castle off the open rank",
        "27. Ne5": "So I retreat - job done - to protect the open Pawn",
        "27... f6": "Inviting the Pawn attack",
        "28. Nd3": "causing me to take up a more defensive posture. I am clearly under pressure and on the back foot now with my Bishop threatened by the Knight and a revealed check",
        "28... Nc5+": "Instead, the Knight threatens my Knight leaving me in check from the Castle, so ",
        "29. Kf2": "I retreat",
        "29... Ne6": "and the Knight retreats avoiding the exchange. I remain 2 points ahead after the skirmish",
        "30. Re1": "I use the opportunity cover the open rank essentially pinning the Knight against the Castle",
        "30... Nd4": "The Knight moves down opening the Castle exchange which",
        "31. Rxe8+": "I take advantage of...Hey, I have a two point lead!",
        "31... Rxe8": "the exchange complete, I have to regroup...so I",
        "32. Bg2": "Open up my Castle so that the first row is protected by him as I anticipate the coming attack. ",
        "32... c5": "Black pushes his pawns to protect the Knight",
        "33. Re1": "I invite another Castle exchange",
        "33... Rxe1": "Which black accepts ",
        "34. Kxe1": "I use my King to take the Castle rather than my Knight to protect a Pawn, but do not realize the danger I put myself in as a result",
        "34... Nxc2+": "The Knight check captures a pawn. So I lose a Pawn and the game is closer after the mistake",
        "35. Kd2": "So with my Pawn gone I have to protect my Knight. I am still playing on the back foot. ",
        "35... Nd4": "Black retreats",
        "36. Bd6": "I advance",
        "36... Nb3+": "Black continues to attack my King. This check presents no significant danger for me. ",
        "37. Kc3": "By responding with my King, I force the knight to move away to survive and fight another day. ",
        "37... Nd4": "Which the Knight does, moving to a position where a check will follow. ",
        "38. f4": "I decide to develop my Pawn structure",
        "38... a5": "Black follows suit",
        "39. Bd5+": "I see an interesting opening that I take with a check",
        "39... Be6": "Black defends inviting the Bishop exchange. ",
        "40. Bxe6+": "which I accept in part because it forces the Knight to retreat.",
        "40... Nxe6": "I am one point ahead and if we exchange all our pieces, assuming I don't make too many mistakes, I should be in position to win",
        "41. f5": "SO I press ahead with my pawn to try to prevent the King from escaping. ",
        "41... Nd4": "I have to find a way to capture the Knight\n",
        "42. g4": "but I advance my pawns",
        "42... b5": "Black does the same. This is an interesting position where a Pawn exchange will result in check unless I can capture the unprotected pawn first...",
        "43. Nxc5": "thus, allowing me to potentially capture two pawns at once. ",
        "43... Ne2+": "Black forces check, and positions himself to capture my pawns",
        "44. Kd3": "so I attack with my King",
        "44... Nc1+": "I find myself having to maneuver to bring the Knight under closer scrutiny.",
        "45. Kc2": "this creates a need for black to move the Knight once again",
        "45... Ne2": "By moving the Knight here, I have access to a pawn",
        "46. cxb5": "so now I am two points ahead - the forced exchange strategy is on!",
        "46... Nd4+": "The check ensures that blacks captures a pawn in return and threatens my Bishop at the same time",
        "47. Kc3": "This is a disastrous move that ensures the loss of my Bishop and a pawn",
        "47... Nxb5+": "AAAARCG what a mistake...I should not play chess late at night. ",
        "48. Kc4": "a futile attempt to chase the Knight down",
        "48... Nxd6+": "still in check...",
        "49. Kb3": "so I retreat to prevent the queening of the pawn",
        "49... Kf7": "My game is in disarray now and I am a pawn down, and the black King is on the move",
        "50. Ka4": "So I see a chance to even the score",
        "50... Nc4": "but the black Knight moves to prevent me from doing so",
        "51. Kb5": "this move ensures the capture of one or the other",
        "51... Ne3": "The Knight moves to stay ahead",
        "52. h3": "but I foil him",
        "52... Ke7": "so the King comes to the party essentially surrendering the pawn",
        "53. Kxa5": "which puts on on level terms once again. ",
        "53... Kd6": "Black tries to chase me down with his King",
        "54. Nb7+": "but I turn the tables on him by forcing check",
        "54... Ke5": "This is a very interesting position. By all accounts, it looks like black has the upper hand",
        "55. Nc5": "so I enter the battle",
        "55... Kf4": "Black certainly appears to have the upper hand. I have to scramble to stay even.",
        "56. Ne6+": "This move puts me a pawn ahead for a time",
        "56... Kg3": "what to do...if I capture the pawn, black will capture my pawn and threaten my other pawn",
        "57. Nxg7": "but that is really the only move available",
        "57... Kxh3": "so now although even, I am about to go a piece down",
        "58. g5": "so I force the issue Black can't take both pawns at once",
        "58... Nxf5": "I think that this is the mistake of the game. If black had taken my pawn with his pawn, then he would not have sacrificed his Knight. ",
        "59. gxf6": "but I do not take the knight, instead I take the pawn looking for a queen",
        "59... Nd6": "black seeing the danger, tries to retreat to prevent the queening",
        "60. Kb6": "My King returns to the battle",
        "60... Kg4": "and Black follows suit..who will get there first? Who has the advantage (I think I do because of my board position)",
        "61. Kc6": "my King challenges his Knight and he",
        "61... Nf7": "retreats to prevent my pawn from advancing",
        "62. Kd7": "so I give chase",
        "62... Kg5": "and the black King does so too\n",
        "63. Ke7": "but this situation favors me",
        "63... Kg6": "Black cannot take either piece with his King because my King is too close",
        "64. Ne6": "so I decide to sacrifice my Knight to ensure that I queen",
        "64... h5": "black starts to advance his pawn",
        "65. Nf4+": "and I place him in check also threatening the pawn",
        "65... Kg5": "this is the expected move forcing me to make a key decision in the game. If I take the pawn then he will take the Knight and then I can take the Knight in return, and possibly win the game that way by protecting the pawn and queening it. If I take the Knight and sacrifice my Knight, I will get a Queen more quickly and have to scramble to prevent him form queening his pawn..interesting choice...so I choose...",
        "66. Kxf7": "to take the Knight...sacrificing my Knight and forcing his King to move away from the pawn",
        "66... Kxf4": "which he does. ",
        "67. Ke7": "this was a bad move that almost cost me the game. I should have moved to g6",
        "67... h4": "the race is on",
        "68. f7": "At this point I think I am going to win the game!",
        "68... h3": "The secret is to get the queen and then keep the black King in check",
        "69. f8=Q+": "check!",
        "69... Kg3": "so now my strategy must be to force the King to move and progress my King to the battle when I can to try to mate him before he queens",
        "70. Qg8+": "Check",
        "70... Kh2": "this move places him in a pin. I get to advance my King and he tries to force a stalemate",
        "71. Kf6": "now 8 points up, I am sure that I will win",
        "71... Kh1": "I still have to keep him in check",
        "72. Qd5+": "Check",
        "72... Kg1": "Wise to the idea that he needs to advance his pawn, he moves away forcing me to ",
        "73. Qd1+": "continue to the plan to keep him in check",
        "73... Kg2": "I can feel the end game developing and I feel confident that a mate will result",
        "74. Qg4+": "now he has a decision to make..keep the  King near the pawn or try to run away",
        "74... Kh2": "He chooses to protect his pawn, but this allows me to advance my King",
        "75. Kg5": "the noose is tightening",
        "75... Kh1": "with this move I should capture his pawn",
        "76. Qxh3+": "now the battle is to prevent a stalemate while I advance my King",
        "76... Kg1": "he tries to prolong the game",
        "77. Qa3": "I ensure that the stalemate is not in the offing",
        "77... Kf1": "now I just have to bring my King down and the game is over",
        "78. Qa2": "I prevent him from moving out of the first row with this move",
        "78... Ke1": "he tries to move into a stalemate",
        "79. Qc2": "I try to limit his range to make the checkmate easier",
        "79... Kf1": "he does what he can",
        "80. Qd2": "I close him down",
        "80... Kg1": "he is still thinking stalemate",
        "81. Kg4": "the end draws near, and with the advance of my King he sees that mate is inevitable so he resigns...a long but interesting game. "
    },
    "url": "https://gameknot.com/annotation.pl/league-division-d2?gm=3782",
    "gameName": "League division D2",
    "players": "opus692 (1290) vs. spoofdr (1204)",
    "opening": "Centre game (C21)"
}