{
    "moves": {
        "1. d4 e6 2. a3": "Una mossa strana, Ma visto che in passato il GM francese Eric Prie l'ha giocata in diverse occasioni, ottenendo anche buoni risultati, se non corretta è perlomeno giocabile. Ho letto un consiglio su come affrontare simili mosse in apertura: evitare di perdere tempo a cercare una confutazione che spesso non c'è e pensare a sviluppare i pezzi.",
        "2... d5 3. c4 c6 4. cxd5 exd5 5. Nc3 Bf5 6. Bf4 Nf6 7. e3 Nbd7 8. Be2 Be7 9. Nh3": "Questa invece qualche difetto deve averlo.",
        "9... Ne4": "Il mio obiettivo è effettuare la spinta c6-c5 che però toglierebbe il sostegno al pedone d5, quindi con questa mossa voglio eliminare il Cc3 che attacca d5.",
        "10. Nxe4 Bxe4 11. f3 Bg6 12. Bg3 O-O 13. O-O Nf6 14. Nf4 Qb6": "Sempre per sostenere la spinta in c5, inoltre butta un'occhio su b2",
        "15. Nxg6": "Alla fine il Bianco è riuscito a utilizzare in modo utile questo Cavallo, ma ha mosso tre volte questo pezzo oltre al tempo speso per spostare l'Alfiere da f4 per fargli strada. Lo stesso obiettivo forse si poteva raggiungere con la semplice Cg1-f3-h4xg6, spendendo qualche tempo in meno",
        "15... hxg6 16. Qc2": "Se il Bianco avesse giocato 16.b2-b4 per ostacolare la spinta in c5 sarebbe seguito a7-a5.",
        "16... Rac8": "Troppa preparazione, era meglio spingere subito in c5, perché ora che le Torri bianche sono in comunicazione e quella in f1 può portarsi in b1,  la replica a7-a5 a b2-b4 non è più così efficace.",
        "17. Bf2": "Il Bianci perde l'occasione, b2-b4 era senza dubbio la mossa migliore",
        "17... c5": "meglio un po' più tardi che mai.",
        "18. Qd2 Rfd8": "Ancora un'imprecisione da parte del Nero. Se si vuole lasciare al Bianco di cambiare in c5 allora il posto di questa Torre è in e8, dato che dopo 19. dxc5, Axc5; la pressione su e3 e lungo la colonna \"e\"  creano problemi al Bianco.",
        "19. Rac1 c4": "Così il Nero si è creato una maggioranza sul lato di Donna. Ora l'obiettivo è metterla in moto.",
        "20. Rfe1 Qe6 21. Bf1 b5 22. g3 Rcb8 23. Bg2 b4 24. a4 Qa6": " ",
        "25. Rca1 b3": "Come minimo il pedone a4 è condannato.",
        "26. Rec1 Bb4": "26...Tb4; 27. a5 Tb5 e il pedone cade ma il Nero perderebbe lo slancio. mantenere la pressione e sfruttare la forza dei pedoni avanzati penso sia più importante che andare a caccia di un pedone che tanto non scappa.",
        "27. Qe2 Qa5 28. e4 c3 29. Be1": "Un errore. si poteva tentare 29. e5 cui sarebbe seguito Ch7 ( o Cd7 ) con l'obiettivo di portrlo in f8 da dove impedirebbe un'ulteriore spinta del pedone \"e\" che potrebbe offrire del controgioco al Bianco.",
        "29... cxb2 30. Qxb2 dxe4 31. Bxb4 Qxb4 32. fxe4 Qxd4+ 33. Qxd4 Rxd4 34. Rcb1 b2": "Un pedone in settima che incatena le Torri avversarie è un ottimo risultato. Il materiale è ancora pari ma è questione di poco.",
        "35. Ra2 Rd2 36. e5": "Per dare aria all'Alfiere.",
        "36... Ng4 37. e6": "Per disperazione.",
        "37... fxe6 38. h4 Ne3 39. Bf1 Nxf1 40. Kxf1 Rc2": "Il Bianco abbandona, seguirebbe ...Tc1"
    },
    "url": "https://gameknot.com/annotation.pl/league-division-c3?gm=66562",
    "gameName": "League division C3",
    "players": "joseph1 (1736) vs. ddp11 (1861)",
    "opening": "Queen's pawn (A40)"
}