{
    "moves": {
        "1. e4": "I think this game was about nice and steady wins the game.  But it could have been either of us as one move from either of us could have changed the outcome.  Of course!  There were no brave or stupid sacrifices by me.",
        "1... c5": "White moved his king pawn to e4 and I moved pawn to c5.  I will not necessarily look to protect this on my next move but will make a stab toward to centre with centre pawn or move g or b pawn to fianchetto a bishop to attack pawns in the centre.",
        "2. d4 e6": "White moves his queen pawn to d4 and I move my e pawn out to e6.",
        "3. d5 d6": "White pushes his d pawn to d5 and I block his move with pawn to d6.",
        "4. dxe6 fxe6": "White captures my pawn at e6 and I recapture with my f pawn.",
        "5. c4 Nc6": "White moves his c pawn out to c4 and I develop my knight to b6.",
        "6. Bd3 Nf6": "White develops his LB to d3 protecting the pawns at c4 and e4.  I develop my g knight to f6.",
        "7. f3 e5": "White moves his pawn to f3 and I push my e pawn to e5.",
        "8. Ne2 Be7": "White develops his g knight to e2 ready to castle.  I develop my DB to e7 and now I can castle.",
        "9. O-O O-O": "We both castle.",
        "10. b3 b6": "White moves his pawn to b3 and I mirror this with pawn to b6 both firming up our pawns.  I have a square I can go to at b4 which would give me an attack on white's LB.  White still has 2 pieces not developed and I have my LB yet to be developed.",
        "11. b4 Nxb4": "White pushes his b pawn and I capture it with my B knight.  I am attacking his LB at d3.",
        "12. Ba3 Nc6": "However white's DB comes to a3 and pushes my knight away and I retreat to c6.  I am up a pawn.",
        "13. Nbc3 Nh5": "Now white develops his last piece, the B knight to c3.  I move my F knight to h5 threatening g3 and attacking his rook although he can capture with his h pawn or the knight at e2.  I can also move my knight to f4 protected by my pawn at e5 so if the knight captures I will recapture.",
        "14. Bc2 Nd4": "White moves his LB to c2 and I move my C knight to d4 attacking pawn at f3 and LB  but white has a knight at d2 which could capture it but this would be recaptured by my pawns at c5 or e5.",
        "15. Nxd4 cxd4": "White takes my knight at d4 and I recapture with c5 pawn.  This leaves me with doubled pawns on the d file but I quite like this set up with one pawn on e5 and a pawn on squares d4 and d6.  I find this can be a nice blockade.",
        "16. Nd5 Bg5": "White now moves his knight attacking my DB at e7 but I move my DB to g5 protected by queen at d8.",
        "17. Nb4 Qf6": "White moves knight to b4 and I move my queen to f6 supporting my DB and centre pawns..",
        "18. Nd5 Qg6": "White's knight returns to d5 attacking the queen which now moves to g6.",
        "19. g4 Bxg4": "White moves his g pawn to g4 attacking the knight at h5 and I take this with my LB.  My LB is under attack from the pawn at f3. ",
        "20. fxg4 Nf4": "White takes my LB at g4 and this now means my knight is under attack at h5 so I move my knight away from the pawn's grasp to f4.",
        "21. Nxf4 exf4": "White captures my knight at f4 with his knight and I recapture white's knight with my e pawn.",
        "22. e5 Qe6": "White pushes his pawn to e5 and I block the pawn with queen to e6.  White could take my pawn at d6 but I could recapture with the queen.",
        "23. h3 Qxe5": "White moves his h pawn to h3 supporting his g4 pawn.  I take the pawn at e5 with my queen.",
        "24. Bf5 g6": "White now moves his LB to f5 attacking pawn at h7 and I move g pawn to g6.",
        "25. Bd3 f3": "White retreats his LB to d3 and I push my f pawn to f3.",
        "26. Rxf3 Be3+": "White captures the pawn at f3 and I move my DB to e3 and check the king.  Once the king moves I have an option to take the rook but it is protected by the queen so I may not do this.  However should the rook decide to capture my rook at f8 then I will recapture the rook with my a rook.",
        "27. Kh1 Bg5": "White king moves out of check and I retreat my DB to g5.  There was no option for me to bring in my queen sitting at e5 as I could not connect my bishop and my queen to make an attack possible.",
        "28. Rxf8+ Rxf8": "As expected white moves rook up to take rook at f8 and I retake with my a8 rook.",
        "29. Rb1 Rf2": "Now white moves a1 rook to a2 and I try to make an attack by bringing my rook down to f2.",
        "30. Qg1 Rxa2": "White moves the queen across to g1 to protect the king and I take advantage and capture the pawn at a2.  This allows me to control the row while at a distance from the queen's capture.",
        "31. Re1 Be3": "White moves rook to e1 and I move my DB to e3 attacking the queen at g1 protected by my queen.",
        "32. Bb1 Rxa3": "White moves LB to b1 attacking my rook at a2 which I move to a3 and capture the DB which has been sitting on this square for the whole game since being developed.",
        "33. Qg2 Ra5": "So white moves the queen out to g2 and I move my rook to a5 supporting the queen at e5.  I could have captured the queen on my last move but it was protected by the rook so I would have lost my only piece the DB so decided to retreat my rook.",
        "34. Qa8+ Kg7": "Now white checks my king with Qa8 and I move king out of check to g7.",
        "35. Qb7+ Kh6": "Queens continues to harrass my king with further check Qb7 and I now move my king out of harms way to h6.",
        "36. Qg2 b5": "So white moves queen back to g2 to assist in defending the king and I move pawn to b5 attacking pawn at c4.  My pawn is protected by both queen and rook.",
        "37. g5+ Qxg5": "White moves g pawn to g5 attacking the king at h6.  I take the pawn with my queen and now the queens are facing one another on the g file.",
        "38. Qxg5+ Kxg5": "White captures the black queen and I capture the white queen with my king.  Now we are at the end game for sure and I have 6 pawns over my opponents 2 but otherwise we have the same pieces, 1 bishop and 1 rook.  Although our bishops are opposites as I have DB and white has LB.",
        "39. Re2 bxc4": "So white moves rook to e2 and I take white's pawn at c4.",
        "40. Be4 c3": "White moves his LB to e4 probably looking to capture the d pawn if it attempts to move to the light square at d3 and same for c pawn moving to c2.  I move pawn to c3.",
        "41. Bd3 Ra1+": "Now white's LB moves to stop d pawn moving and attempt to capture c pawn if it tries to push to c2.  I check the white king with rook to a1.",
        "42. Kg2 h5": "King moves out of check and I push pawn to h5.",
        "43. Rc2 Rd1": "White moves rook to c2 blocking my attempt to push my c pawn to one square closer queening.  I move my rook to d1 attacking the LB at d3.",
        "44. Kf3 Rxd3": "White king comes to f3 and I capture the LB at d3.",
        "45. Ke4 Rd2": "White king moves to e4 attacking rook at d3 which moves to d2 and has the white rook at c2 but if it should take my c3 pawn will capture the rook.",
        "46. Rxd2 cxd2": "As expected white capture my rook and I recaptured at d2.  White resigned as only had a pawn left at h3 which was blocked."
    },
    "url": "https://gameknot.com/annotation.pl/league-division-f3?gm=61116",
    "gameName": "League division F3",
    "players": "dinzmancallie (938) vs. milly64 (968)",
    "opening": "Sicilian (B21), Smith-Morra gambit"
}