{
    "moves": {
        "1. e4": "in this game I play the Scheveningen variation of the Sicilian with 5...a6 in order to aviod the dreaded Keres Attack after 5...e6 6.g4!. The game shows a typical black counter attack on the queenside which white completely underestimates.",
        "1... c5 2. Nf3 d6 3. d4 cxd4 4. Nxd4 Nf6 5. Nc3 a6 6. Be3 e6": "Returning to the Scheveningen instead of continuing ...e5 in Najdorf style",
        "7. f3": "sencible move, blocking the long diagonal for the bishop straight away and solidifing the centre. This move also prepares a kingside pawn storm",
        "7... b5": "completely preventing whites light square bishop from getting on the agressive a2-g8 diagonal",
        "8. g4": "continuing the pawn storm on the kingside.",
        "8... h6": "Black can either play this or the very counter intuitive 8...Nfd7 leaving himself further behind in development",
        "9. Qd2": "White prepares queenside castling",
        "9... Bb7": "9...Bb2 develops the bishop and prepares to bring the rook to the c file.",
        "10. O-O-O Nbd7": "heading for the b6 squre where the knight will eye the very nice c4 outpost.",
        "11. h4 Nb6 12. Rg1": "The g file will become at least half open after g5 so white moves the rook there before playing the g5 advance",
        "12... Rc8": "This gives black the chance to continue his queenside buildup, the rook comes to it's most natural square infront of the white king. It also controls the c4 square. one of the first rules of outposts is to have a rook behind them.",
        "13. g5 Nfd7": "The knight was destined for the queenside anyway, more specifically c4.",
        "14. Bd3": "?! the bishop does very little here, especially as it is soon to be traded for one of the black knights. An imediate 14.f4 is better, preventing the Nd7-e5-c4 idea but weakening the e4 pawn but as the rook has moved from h1 the e pawn is atleast not pinned and so could advance if the pressure became unbearable.",
        "14... Ne5": "Heading for c4",
        "15. f4": "Helping the knight on it's way",
        "15... Nec4": "Finally the kings knight has reached the end of it's long journey to c4.",
        "16. Qf2": "White correctly choses to keep his light square bishop on the board, 14.Bd3 would have only been a waste of tempo if white had traded here",
        "16... Be7": "Black completes the development of his forces and opens the possibility of castling",
        "17. Bxc4": "?! White had just avioded that exchange but now decides to make it, 17.Kb1 would be better, removing the king from the path of the c8 rook",
        "17... Nxc4 18. e5 Qc7": "The pressure on the white queenside is now tremendous, notice how the knight on d4 can't move as ...b4 followed by ...Nxe3 would win a piece due to mate on c2. Black also threatens ...Nxb2, ripping open the kings position.",
        "19. gxh6 gxh6": "black must recapture as he cannot allow hxg7.",
        "20. h5": "?? White calmly continues to shuffle pieces on the kingside. This move achieves nothing and is whites biggest mistake of the game...so far. In these types of sicilian positions, with attacks coming on each side of the board, every tempo should be used wisely, one tempo could be the difference between victory and defeat.",
        "20... Nxb2 21. Nb1": "21.Kxb2 is suicide after 21...Qxc3  22.Kb1 dxe5! threatening Ba3.",
        "21... Nc4": "Keeping the king hemmed in",
        "22. exd6": "? This just opens lines towards the white king for the black pieces, white should use the tempo for something more constructive and let black spend time opening lines",
        "22... Bxd6": "now black has alot of threats, like 23...Nxe3",
        "23. Ne2": "?? now the game ends very abruptly. White still doesn't realise that in this position he should be defending, the black king is perfectly safe in the centre, at least for now. White could try 23.Bd2 but to be honest blacks threats look to much, Bd2 prevents the queen infiltrating on a5 and the queen winning maneuver 23...Nxe3 24.Qxe3?? Bxf4, but black can still bag atleast the exchange by 23...Nxd2 24.Rxd2 Bxf4.",
        "23... Nxe3 24. Qxe3": "?? 24.Nec3 saves the king for now atleast although the result would not be in question.",
        "24... Qxc2#": "0-1 this game just shows you how real blacks counterplay is in the sicilian and if you waste moves and leave blacks counter play unchecked you could be in for a very nasty surprise. As always feel free to leave comments or PM me if you have any questions. Thanks for reading."
    },
    "url": "https://gameknot.com/annotation.pl/league-division-d1?gm=7044",
    "gameName": "League division D1",
    "players": "ismetyilmaz (1536) vs. kingstuart (1719)",
    "opening": "Sicilian (B90), Najdorf, Byrne (English) attack"
}