{
    "moves": {
        "1. d4": "I started with d4. ",
        "1... d5 2. c4": "Queens Gambit. One of my common openings.",
        "2... Nf6 3. Nc3 e6 4. cxd5 exd5 5. Nf3 Bb4": "It´s pretty even!",
        "6. Bd2 Bxc3 7. Bxc3 Nc6 8. e3 a6 9. Bd3 Bg4 10. Be2 Bxf3 11. Bxf3 O-O": "I have heard that a player must castle within seven moves. Now at move 11 my opponent castles!",
        "12. O-O": "But I´m even later to castle!",
        "12... b5 13. Re1": "Centralizing the Rook!",
        "13... b4 14. Bd2 a5 15. b3 Ne4 16. Bxe4 dxe4": "Think this exchange was a little bit favorable for me.",
        "17. Qc2": "Pressure against e4- pawn and Nc6.",
        "17... Qd5 18. Rec1": "Increasing the pressure along the c-file.",
        "18... Ra6 19. Qc4 Qxc4": "Black is swapping quenns.",
        "20. Rxc4": "Takes with the Rook of course! Keeping up the pressure along the c-file is necessary!",
        "20... Rc8 21. Rac1": "Doubling the Rooks! Increasing the pressure at the c-file.",
        "21... Ne7 22. Rc4xc7": "A free pawn.",
        "22... Rxc7 23. Rxc7 Kf8 24. Kf1 Ra8 25. Ke2": "Centralizing the King is a good strategy in the endgame!",
        "25... Nd5 26. Rd7 Nf6 27. Rc7 Nd5 28. Rd7 Nf6 29. Rc7 Nd5 30. Rc5 Ne7 31. Re5 f5 32. f3": "Nearly the only move that makes sense in this position.",
        "32... exf3+ 33. gxf3 g6 34. e4 Kf7 35. d5": "Going with my free pawn.",
        "35... Rd8 36. Rxe7+": "A tactic!",
        "36... Kxe7 37. Bg5+": "Wins back the Rook!",
        "37... Kd7 38. Bxd8 Kxd8 39. e5": "Now have I get the advantage with two connected, passed pawns!",
        "39... Ke7 40. Ke3 g5 41. Kd4 h5 42. Ke3": "Can´t go away to far with my King. Must guard the Black King side pawn majority. ",
        "42... h4 43. h3 Kd7 44. f4 g4 45. hxg4": "My plan was ...fxg4 and White has three connected, passed pawns against Blacks two. White have then the possibility to block Blacks two passed pawns with his King!",
        "45... h3": "??? Strange move???",
        "46. Kf2 fxg4 47. Kg3": "Now have White blocked Blacks two passed, connected pawns. They can´t do any more damage!",
        "47... Ke7 48. f5": "Whites three connected, passed pawns is far stronger! As I see it two connected, passed pawns can pretty easily be blocked, if the King is in the neighbourhood and no other threats is \npossible, but three connected, passed pawns is probably one too much for the opponent to grasp!",
        "48... Kf7 49. d6 Ke8": "The future is looking bad for Black!",
        "50. e6 Kd8": "He can´t do anything more productive than go back and forth with his King!",
        "51. f6": "Black gave up! "
    },
    "url": "https://gameknot.com/annotation.pl/league-division-d2?gm=59534",
    "gameName": "League division D2",
    "players": "haratta (1557) vs. hirohurl (1623)",
    "opening": "QGD (D06), Marshall defence"
}