{
    "moves": {
        "1. e4": "This is a league game I played with Geronimo.",
        "1... c5 2. Nf3 Nc6 3. d4": "All pretty much Standard Sicilian.",
        "3... e6": "I'm not sure about this move. It's seems fine. Maybe a preventative move for the  Bishop coming out to f4? ",
        "4. Nc3": "Still allow the trade on d4. ",
        "4... a6": "I think this was another move keeping the bishop off this diagonal.",
        "5. d5": "I had no intention of going to the b5 square.",
        "5... exd5 6. exd5 Nce7 7. Ne4 b6 8. Bd3 Bb7 9. c4": "White has better center control and is more developed.\r\nBut has missed mate in 1 for two moves!!\r\nQuite the oversight!!",
        "9... d6 10. O-O Ng6": "Black has now moved his Knight 3 times in the first 10 moves.",
        "11. Re1 Be7 12. Bg5 f6": "I think black should have traded bishops here. Yes it would have been a discovered check for white, but black could simply bring out his other Knight. Allowing black to castle whenever he wants.",
        "13. Bh4 Qc7 14. Qa4+": "With an idea of pushing out the black King.",
        "14... Kf7 15. Ng3": "White looks much better here.",
        "15... Ne5 16. Nxe5+ dxe5": "Gaining some ground in the center. Good move. Also getting rid of another Knight that white had on a pretty good square.",
        "17. Nf5 Bf8 18. Rad1 g6 19. d6": "This was probably a bad move for white.",
        "19... Qd8 20. Ng3": "Now I have left that pawn hanging. As well as blocking in my own Bishop. That was OK with me though.\n",
        "20... g5 21. Bxg5 fxg5 22. Rxe5": "I'm only down a pawn. This was more of a positional sacrifice. ",
        "22... h6": "Black still didn't take the pawn on d6?",
        "23. d7 Nf6 24. Rf5 Bg7 25. Be4 Qc7 26. Qb3": "The Queen is not doing a thing on this side of the board.",
        "26... Rhd8 27. Qf3": "White's pieces are much more active here. ",
        "27... Rab8": "Black not wanting to trade Bishops because of the Knight recapture on e4.",
        "28. Nh5 Bxe4": "Now black feels safe taking the bishop.",
        "29. Rxf6+": "And now it's already too late for black.",
        "29... Kg8": "If black takes with his black Bishop then Qf6  followed by mate.\n",
        "30. Qxe4": "It is still OK to give up the Rook here.",
        "30... Bxf6": "Black not seeing the g4 square for the Queen.",
        "31. Qg6+": "It was forced mate from here. My opponent saw this and resigned.\nGOOD GAME"
    },
    "url": "https://gameknot.com/annotation.pl/league-division-d1?gm=13095",
    "gameName": "League division D1",
    "players": "emtogsdia (1445) vs. geronimo57 (1622)",
    "opening": "Sicilian defence (B32)"
}