{
    "moves": {
        "1. d4": "Really started to look at a queens pawn opening after got stuck in a rut with the whole kings pawn/spanish game",
        "1... e6 2. Nf3 d5 3. Bf4 Bd6": "development as normal, debated here what to do about the trade with the dark squared bishops, did consider Ne5 for a while to stall it and offer a good attacking option on F7 pawn. but....",
        "4. Bg3": "in the end decided on Bg3 ",
        "4... Bxg3": "black takes the trade",
        "5. hxg3": "White is more than happy as this frees up the H file for some future attacking options. Although does mean that a kings side castle is out of the question so white must be clean & quick!!",
        "5... Nf6 6. e3 O-O": "! This could prove to be costly as white has a powerful attack on the H7 pawn",
        "7. Bd3": "White continues to attack and mount pressure on the .... H7 pawn",
        "7... b6 8. Nbd2 c5": "a pawn exchange is offered to weaken whites hold in the center",
        "9. c3": "White supports the d4 pawn - if c5xd4 then white would follow ith e5xd4 keeping the  queen side strong and have a semi free file on the E's for more queen action!! but...",
        "9... c4": "black advances his pawns into the whites half of the board applying pressure on the light squared bishop",
        "10. Bc2": "keeps pressure on H7",
        "10... Nc6 11. Ne5": "The key exchange",
        "11... Nxe5 12. dxe5": "White trades Knights but in the process kicks the defending knight from his perch",
        "12... Ng4": "Although appears to be obvious mistake i dont think it had an overbearing affect on the outcome?!?",
        "13. Qxg4": "Black is under massive pressure and totally penned in",
        "13... h6": "a last ditch attempt to stop the invading bishop",
        "14. Rxh6": "nothing the g7 pawn can do as the white queen holds the G file",
        "14... g6": "by this time its all really over but",
        "15. Rxg6+": "white sacs his rook with Qxg6, Kh8, Qh7=m8 . I would like to thank Milatin for the game. and hope my attempt at annotating a game hasn't  been to bad! "
    },
    "url": "https://gameknot.com/annotation.pl/league-division-d2?gm=6175",
    "gameName": "League division D2",
    "players": "daddyk (1370) vs. milatin (1477)",
    "opening": "Queen's pawn (A40)"
}