{
    "moves": {
        "1. e4 e5 2. Qf3": "Napoleon's Opening.  Already a departure from more  'usual' developments, this move has serious drawbacks for the sake of obtaining early pressure against f7.  Of course, my opponent might have been hoping that I didn't know how to deal with such a line.  The problem is that the attack it foreshadows is too easily thwarted (see Black's reply), whilst at the same time the Q takes from the King's knight its most 'natural' square for development.",
        "2... Nf6 3. Bc4": "Consistent, and White might have hopes of renewing the attack against f7 by bringing his Q behind it at b3.",
        "3... Nc6": "Threatens to come in at d4, but also has an eye on a5 if White does try Qb3 at some point.  The main purpose of this move, though, is to develop quickly. ",
        "4. c3": "Some good thinking here: White wants to dominate in the centre.  At the same time, the move cuts across Black's threat to play 4...Nd4.  Remember that if there is a useful tactic, then moving the same piece twice in the opening may be justified.  White felt the threat from a knight reaching d4 (striking at the Q at f3 and the c2-square) serious enough to require preventative measures.  The drawback is that now neither of White's knights can reach their most 'natural' squares.  Not a fatal drawback, but it will make life a little harder, all the same.  Better was 4.Ne2.",
        "4... Bc5": "More ambitious than 4...Be7, and Black certainly does not want to block in his d-pawn with 4...Bd6?  This move prevents White's d-pawn reaching d4 for the moment.  Its secondary purpose was to clear the way for a King-side castle.  The drawback - though a minor one - is that it offers White a target.",
        "5. b4": "Striking at the bishop.  Not bad, though it doesn't do a whole lot for White's development.  A good alternative was 5.d3, freeing up all the undeveloped pieces.  Not so good would have been 5.d4? exd4 6.cxd4 Nxd4, menacing f3 and c2.",
        "5... Bb6": "Staying on the diagonal that strikes at f2.  Black had perforce move this piece a second time, or lose it.",
        "6. b5": "(?!) Not so good, even though Black has to move a second piece a second time.  Although this costs Black time, White is not profiting very much thereby.  True, White gains some space on the Q-side, but his pawn formation becomes a bit ragged in the process, and his pieces are still at home.",
        "6... Na5": "(!?) OK - not necessarily the best.  Black had good alternatives in 6...Ne7 or 6...d5!  The problem with the text move (i.e. the move played) is that if the bishop retreats to e2, this knight is left rather out on a limb.  Of course, such a loss of time by the bishop doesn't make this an attractive proposition for White.",
        "7. Na3": "Not bad: preparing to retake on c4, developing the knight with a gain in time.  Although Black didn't really have make this concession, he decided that on balance, to rid himself of his 'off-side' knight it was worth giving White something.  Black will retain a small lead in development.",
        "7... Nxc4": "Maybe 7...0-0 was better, really...",
        "8. Nxc4 d6": "Freeing the c8-bishop for development.  Black is not very concerned that White might take on b6.  The double pawn is no serious inconvenience at all, yet the open a-file might come in useful.",
        "9. d3": "Probably as good a move as any, in the circumstances.",
        "9... Bg4": "(!) Developing, with gain in tempo.  White's Q has just one square available.",
        "10. Qg3": "Only move.",
        "10... Be6": "(!?) A deliberate invitation to White to take the g-pawn.  At the same time, Black threatens to take the c4-knight, and then win a pawn (11...Bxc4 12.dxc4 Nxe4).  Better, however, was simply to castle.",
        "11. Qxg7": "(?) What Black was hoping for.  Much better would have been first to take on b6: 11.Nxb6! axb6 12.Qxg7!? (Now it's OK!) 12...Rg8 13.Qh6 Rg6 14.Qh4 (Qd2 is also OK) 14...Nd7 15.Qxd8 Kxd8 with a reasonable game for White.  Although from Black's point of view this would have been something of a concession, in creating the chance for White to go wrong, the risk was not such as to compromise his whole game.  If White went wrong, Black got a large advantage; if White played correctly, at worst Black got a roughly even game.  ",
        "11... Bxf2+": "(!) Now inviting White to help himself to the bishop as well!",
        "12. Kxf2": "During the game, I thought maybe White ought to leave the bishop alone in view of what follows.  But after 12.Kf1 Rg8 13.Qh6 Rg6 14.Qd2 Bxc4 15.dxc4 Bxg1 Black obtains a strong attack anyway.  It seems for that the slight risk Black took in playing 10...Be6, he has reaped a larger dividend than expected!",
        "12... Rg8": "(!) Now Black's scheme takes shape.  He wants the Q to go to h6, whereat the knight forks K and Q at g4.",
        "13. Qh6": "(?) Obvious, but again, what Black was aiming for.  White could have contained the damage by 13.Qxg8+! getting rook and knight for the queen.",
        "13... Ng4+": "Wins the Queen on h6.",
        "14. Kf1 Nxh6 15. Bxh6 Bxc4": "Also good here was 15...Qf6+.",
        "16. dxc4 Qh4": "Actually, I rather think I overlooked 16...Qf6+ here, which would have picked up the bishop.  But as it happens, this move is very nearly as good, if rather 'too' subtle.",
        "17. Nf3": "At first blush, this is a simple oversight - and it probably was - but in fact the oppressed prelate had no decent moves anyway.  E.g. 17.Be3 Qxe4 threatened the bishop again and ...Rxg2; 17.Be2 Qg4 (or even ...Qxe4 at once), and the same response meets 17.Bc1.",
        "17... Qxh6": "With a material deficit of -6, White is busted, of course.  Naturally, White fights on.  For the remainder of the game, Black tries to win as efficiently as possible; White tries to throw obstacles in his path.",
        "18. h4 O-O-O": "Completing his development.  Possibly 18...Qg6 was the more accurate, but the text is quite good enough.",
        "19. a4": "Attempting his own attack against Black's King.  Might as well!",
        "19... Qe3": "With the idea 20.Rae1 Qd3+ 22.Re2 (else 22.Kg1 Qxf3) 22...Rxg2 23.Kxg2 Qxe2+, simplifying (by which is meant, reducing the amount of material on the board, whilst retaining the material edge).\r\n",
        "20. a5": "Sticking to his plan.",
        "20... Rxg2": "(!) From an objective standpoint, this isn't really the best, but I was rather taken by the idea.  The 'correct' move was 20...Qd3+, with the same ideas as in the note to Black's 19th.  But this move also guarantees a decisive simplification.",
        "21. Kxg2 Rg8+": "Now, any K move gets a quick quietus, but White has a resource...",
        "22. Ng5": "That White had this resource nearly put me off the rook sac at move 20.  But now the knight is pinned.  Black still has a winning advantage.",
        "22... f6 23. Rhe1": "Good thinking, even at this late hour, seeking to disrupt Black's plan.",
        "23... Qd2+ 24. Kf1": "(?) A mistake that gives Black a forced mate.  The problem is that the king has fetched up on a file about to be opened, whereas 24...Kg1 would have left the King on a file about to be closed (24.Kg1 fxg5 25.h5).  Not that 24.Kg1 would have saved White in the long run...",
        "24... fxg5 25. b6": "Going for broke.  If he fails to find a quick win, then bxa7 could prove very embarrassing for Black.  But Black had already seen a forced win.",
        "25... Rf8+ 26. Kg1 Qf2+ 27. Kh1 Qxh4+ 28. Kg2": "Relatively better was 28.Kg1.  True, it makes practically no difference in this game, since Black had mate in two either way.  But in general when faced with a forcing line, it is usually better for the defender to play the move that will give him the most options after the enemy's reply.  After 28.Kg1 Rf2 White would have had a completely free hand (29.bxa7).  In another game that might have allowed White to turn the tables.  Not here, though...",
        "28... Rf2+ 29. Kg1 Qh2#": "Although the game involved some strategic decisions, Black relied heavily on tactics to seize and then to increase his advantage.... "
    },
    "url": "https://gameknot.com/annotation.pl/learning-the-ropes?gm=27818",
    "gameName": "Learning the ropes",
    "players": "djmac1031 (1212) vs. ionadowman (1200P)",
    "opening": "KP (C20), Napoleon's opening"
}