{
    "moves": {
        "1. e4": "Typical opening.",
        "1... c5": "So, I answer with the Sicilian Defense.",
        "2. c3": "I haven't see this played against the Sicilian.",
        "2... d5": "So, I play this in an attempt to break open the center.",
        "3. e5": "I guess that white has the same idea in mind.",
        "3... e6": "This was played to prevent his e5 from advancing any further.",
        "4. d4": "So, he attempts to exchange, in which, I exchange.",
        "4... cxd4 5. cxd4 Ne7": "So, I decide to start developing, at once.  I'm also keeping that I'll be able to find a better outpost for this N since it's about getting your pieces to better squares, as I learned from Ken.",
        "6. Nf3": "Meanwhile, he develops.",
        "6... Nec6": "Meanwhile, I get my N to a better place at once to prevent a check with his next move.  Afterall, I'm in no rush to develop my Q side, yet because of what's coming.",
        "7. Bb5": "That, however, does not stop white from pinning my Nc6.",
        "7... Bd7": "So, I break that pin, at once.",
        "8. O-O": "And, he castles.",
        "8... Be7": "Likewise, I bring my Bf8 for the same reason.",
        "9. Nc3": "Continuing with his development.",
        "9... O-O": "And, I castle.",
        "10. Be3": "Completing his development.",
        "10... Nb4": "Knowing that my N is not pinned, I bring to a better outpost in order to complete my development.  Exchanging isn't my plan.  But, I don't care if he does and more then happy to allow it because his Bb5 was more active.  By enabling this exchange, I feel that I've got an edge.",
        "11. Bxd7 Qxd7 12. a3": "Kicking my N which I protect.  I don't know what his plan is until 13.Qc2 is played.",
        "12... Nb4c6 13. Qc2 f6": "That's when I figured out that he was trying to put an overwhelming pressure against my K side.  A N, B, and the Q all working together on the K side tells me an important.  Which is that he's got threats that could be overwhelming if I'm not careful.  So, to prevent that kind of nonsense, I play this.  I'm also keeping in mind that he intends to exchange pawns which I'm not afraid since that's not part of the overall picture.",
        "14. exf6 Bxf6 15. Qd3": "Still appears to be going for some kind of threat.",
        "15... Ne7": "So, I stop him, in case my instincts are right.  In addition, this enables me to complete my development.",
        "16. Rae1": "So, Tinley centralizes his Rook.",
        "16... Nbc6": "And, that enables me to complete my development.  Now, I'm going for other ideas.",
        "17. Bg5": "He attempts to exchange Bishops.  I give it as a mistake since my Bf6 is less active.  And, I don't have a choice, anyway.  But, I did, I'd willing do it, anyhow.  The only problem is that I forgot about his Nf3 which is more active then his B.  However, unlike my game with Ken, it does not bother me because if he tries to do something about it, I'll stop it.  And, despite what's happening, I'm feeling more and more confident about the position.  Normally, that's not the way to go as I learned in that training game, but it pait off here as that's what helped me to get a draw, when all was said and done.",
        "17... Bxg5 18. Nxg5 Rf5": "? Knowing that and feeling like he might try to do something, I kick Til's Knight.  What I forgot is that this move is going to cost me a pawn.  Much better was 18...e5.",
        "19. Nxe6 Rh5": "Despite what's happening, I feel that I just might be able to do something, if he makes a mistake.  At the very front of my mind is what happened in my game against bhidragon, so I decide to go for it by attacking his K side.  I'm treating it, as though, 19...Qh5 is possible but am using my Rook, instead, and for the same reason.  ",
        "20. Qg3": "Trying to mate me.  But, after what happened in our last game, I'm very well aware of this threat and punish him by kicking Til's Queen on my next move.",
        "20... Nf5 21. Qd3 Qd6": "So, I put a squeeze with a mate threat of my own.  Not to my surprise, Tel stops it but not without putting compromises on his monarch which I'll try to take advantage since he opened up right near the King.",
        "22. g3 Rg5": "So, I add an attacking force.  After what happened with Joann and Jack Stockel, followed by Reuben, I'm attempting to pin his g3 by adding an attacker then after against his monarch.  It does work, this time around.",
        "23. Nf4 Nh4 24. Re2": "? I'm not sure why he played it, but it's a mistake as I'll get a pawn for free.  Because if he takes back, 25...Nf3+ forks and wins the Queen.",
        "24... Nxd4 25. Nb5": "So, he prevents that by playing this.  Therefore, I take his Rook and place him in check.  When he takes back, I'm now ahead.  A little bit down the road, though, I made a mistake that should've given him the advantage.  Therefore, it's far from over.  ",
        "25... Nxe2+ 26. Qxe2 Qh6": "As now, I add an attacking force.  The plan is 27...Nf3+ which would allow 28...Qxh2#.",
        "27. Rd1": "Knowing what I'm up to, black stops that.",
        "27... Rd8": "And, given that I've got a passed pawn, I place my Rook behind since that's where they belong.",
        "28. Nc7": "Going for my d pawn since it's got another attacker.",
        "28... Qc6": "This is where I start going wrong.  Similar to that terrible blunder against Jack Stockel, I figured that white's Knight is now trapped and can't go anywhere.  It can, and in the process, he's getting back a pawn.  Best would've been 28...d4  As they say, \"passed pawns must be pushed.\"  And, this is no exception.\n",
        "29. Ncxd5 Re8": "With him grabbing, I decide to attack his Queen.  Once he runs back, I double up.  This was also played to prevent the fork with 30.Ne7+ which would win the Queen.",
        "30. Qf1 Ree5": "I thought that this was, initially, a mistake.  I thought that I've allowed 31.Ne7+, for some reason.  However, I'm still protected and should've well be in the fight longer, as my back rank is still strong.  Figuring that there was no way out, I played a move and was hoping for, what I believed to be counterplay.  I was aiming for a draw by repetition since with the belief that there was no way out of trouble.  Had this been figuring out, I would not have moved back and forth.  Instead, I would've advanced my a or b pawns.  ",
        "31. Qh3": "This is where I thought that there was no way out since his Q, N and R are pointing at my K.  But, my backrank is strong here.  I found one move, but anything loses the N or Q.  Without much alternative, I took into account what Ken said by hoping that he would blunder since I was just going to go back and forth.  Therefore, if he continued doing so, I'd be able to get a draw which is how it happened.  Therefore, kept moving the N and back and forth as white did with his Queen, until a draw by repetition was achieved.",
        "31... Nf5 32. Qg2 Nh4 33. Qh3 Nf5 34. Qg2 Nh4 35. Qh3": "Overall, I'm satisfied with how the game went but not more then that.  There was certainly more then one way out of trouble.  But, if it happens where I'm in a situation like this and there's pretty much no way out, I'll attempt to use this same strategy since, at the time, I felt that I had gotten my ticket out of a bad situation."
    },
    "url": "https://gameknot.com/annotation.pl/learning-from-your-mistake?gm=61762",
    "gameName": "Learning from your Mistake",
    "players": "nayagan (1382) vs. jkarp (1324)",
    "opening": "Sicilian (B22), Alapin's variation (2.c3)"
}