{
    "moves": {
        "1. d4 f5 2. c4 Nf6 3. g3 g6 4. Bg2 Bg7 5. Nf3 d6 6. Nc3 O-O 7. O-O c6 8. Bf4": "This was not really a good move, because of  8. ...  Nh5 , losing a tempo. I should have played 8.e3 right away, or maybe 8. b4.",
        "8... Na6": "Planning to manoeuvre the knight to e6 via c7.",
        "9. Ng5": "I played this only to provoke the h6 push,  creating a weakness on g6 that I could play against.",
        "9... h6 10. Nf3 Nc7 11. Rc1 Ne6 12. Be3": "Avoiding the exchange. Also, I wanted the d-file to be cleared between my queen and my pawn to prepare d5.",
        "12... Nh5": "Here, my opponent opened the diagonal for his bishop and add some pressure on the f4 square.",
        "13. Qd3 Qe8 14. Nh4": "I put some pressure on g6 and open the way for my next move.",
        "14... a5": "My opponent started to play on the queenside while all the action is on the kingside.",
        "15. f4 Nf6": "Now that pushing his own pawn to f4 is no more possible he take back his knight.",
        "16. d5": "At this point I had noticed that his queen was the only piece to protect the g6 and e7 pawns. So, I found a way to bring a knight to d5, and to win a pawn.",
        "16... cxd5 17. Bxd5 Nxd5 18. Nxd5 Ra6": "This move is quite a loss of time. Trying to solidify the kingside with a move like Kh7 was much more urgent.",
        "19. Nxg6": "Here, if Qxg6 then Nxe7 + followed by Nxg6.",
        "19... Rf7": "The only move to keep the quality.",
        "20. Rc2": "Playing Rb1 was better.",
        "20... Rc6": "Here, Vulgaire send me a comment thinking that I had missed the fork, but c7 was covered by his knight.\n",
        "21. Bd2": "Planning Bc3 to challenge the a1-h8 diagonal.",
        "21... Nd4": "Here is why 20. Rb1 was better.",
        "22. Rcc1 e6 23. Ne3 b6 24. Bc3": "Threatening to win a piece, forcing e5, and by the way the opening of the f-file.",
        "24... e5 25. fxe5 dxe5 26. Nh4": "Aiming directly the new weakness, f5.",
        "26... Rcf6": "Here 26. ... Rc5!? would have been interesting.",
        "27. Rf2": "Preparing to double my rooks.",
        "27... Qd7": "Adding another defender.",
        "28. Rcf1 Rd6": "Threatening Nf3+.",
        "29. Nd5": "Temporary closing the d-file, and attacking the f6 square. Here f5 is about to fall.",
        "29... f4": "Trying to save the pawn.",
        "30. Bxd4": "Taking apart the pawn chain. ",
        "30... exd4 31. Rf2xf4": "Winning another pawn.",
        "31... Rxf4 32. Rxf4 Bb7": "The lonely white bishop finally enter the battle but it was already too late.",
        "33. Nf5": "Forking the rook and the bishop.",
        "33... Rg6": "Trying to save the rook but I could have played Ne7+, but I had another idea.",
        "34. Nxg7 Qxg7": "He can't recapture with the rook because of Nf6+ winning the queen.",
        "35. Qxg6": "Here, my opponent resigned. It would continue with 35. ... Qxg6 36. Ne7+ Kg7 37. Nxg6 Kxg6 38.Rxd4 ... Hard to continue a game with 3 pawns and a quality down."
    },
    "url": "https://gameknot.com/annotation.pl/lesson-dhumilit-1?gm=23714",
    "gameName": "Lesson d'humilité #1",
    "players": "jp_cote1337 (1350) vs. vulgaire (1491)",
    "opening": "Dutch (A87), Leningrad, main variation"
}