{
    "moves": {
        "1. c3": "I don't know why she played this because it is not a book move.  It would, however, if 1.c4 was played, as you'd have an English.  And, it would also become a reversed Siclian since 1...e5 is played, regardless.",
        "1... e5 2. d4": "Mary wants to exchange and since she I like going into early exchange variations, I accept.",
        "2... exd4 3. cxd4 d5": "To continue development as it is a central pawn needed for development.  I also emphasize that concepts to my students, and Reuben mentioned it in his last annotation.  In addition, I played this to prevent her pawn from advancing, which she won't do right away since that's pushing it, as opposed to, developing.  But, at some point, she'll likely consider doing so.  Although it's no where near a passer, I treat pawns that continue advancing as though they are passed pawns since they can also become dangerous.",
        "4. Nc3": "Continuing to develop can planning to develop K side.  Also, trying to win my d pawn.",
        "4... Bb4": "I could've protected and continued developing with 4...Nf3  But, the idea is to pin that N because you don't want it going too far.  Doing that would allow it to become dangerous, which is, in that case.  I know because I've lost a couple of games, one against Jack, and another on this website which was also a terrible game because I allowed N's to come in, and therefore, they became dangerous.  This gave my opponents an immediate winning advantage.",
        "5. Nf3": "She could've broken the pin with 5.Bd2  Nontheless, this move as she intends to castle K side.",
        "5... Nf6": "I have the same idea in mind.  But, if I gave this a little more thought, I would've forced an exchange with 5...Bxc3  This was well before cplusplus11 copied and pasted an article from a GM, forgot what the name is on if N's worth more then B, or B worth more.  Not to mention that I still had trouble determining an open from a closed position.  Plus, Jack told me that a N is usually worth more.  However, I was on another website, and recently, at the time, read an article that in the mid game, a N is worth more since they have what I mentioned earlier.  The power to fork when they come in.  In the end game, however, a B is worth more because they can fork say K and a piece.  And, they can become quite dangerous.  Also worth noting is that, at this point, I am starting to get distracting because Gerhard and I were making up with one another regarding the Chicoboy's Legacy Club.  I was upset and had a rough week that I'm already starting to lose concentration.  However, this is not the worst, as we'll see shortly.",
        "6. Bg5": "Meanwhile, she wastes no time pinning my N, but it's to the Q.",
        "6... O-O": "As usual, my idea is to castle early and often.",
        "7. e3": "To develop and acheive a solid pawn chain since the center pawns are also connected with the f pawn.  Plus, the LSB can come out, and she is one step to castling K side.",
        "7... Nc6": "Now that I've already gone home, the idea is continue developing.",
        "8. Bb5": "Completing development and preparing to castle.  However, I keep in mind that the N is not really pinned.  If I wanted to, I could get away with safely with ...Ne7 to prevent her from messing up my pawn structures.  In fact, that's what I should've done.",
        "8... Bd7": "However, my plan was to put pressure her LSB, whilst, completing development.",
        "9. Qb3": "I don't know why she played this, as Mary won't castle Q side.  And, she can't win my DSB because of my N on c6.  Maybe, it was to connect her R's after castling, but I would not have brought out my Q, quite yet.  Jack said that even after development is completed and you have castled, you should still wait to bring the Q out, until you absolutely must since the Queen is fragile and can still be harrassed, nontheless.  In fact, I lost a game against because I brought out my Q, just when I thought it was safe to do so, as I had not only castled, but just completed development.  But, my coach said that it was still a little too early to bring it out.",
        "9... a6": "To gain tempo.  And, since development is completed, this is of no asset.  ",
        "10. Bd3 h6": "Still to gain tempo, but instead of running back, she takes.",
        "11. Bxf6 gxf6": "?? This is where the distraction hits me the worst.  If I gave this anymore thought, I would've played 11...Qxf6!, as opposed to, this.  Taking with the Q would've given me the advantage since I am now strengthen the Q side structure, I guess you can say.  In fact, while definitely, I think I would've had the winning advantage for that reason.  But, this is an outright blunder because as Jack has mentioned, it exposes my K as I now have doubled pawns around the K, as he also said is the worst place to have doubled pawns.  That's why I deem this move worthy of the double question mark.  At this point, I have completely lost concentration.  It does, however, start to gradually come back soon, but the damage has been done.",
        "12. O-O": "Waisting no time to castle.",
        "12... Be6": "So, now that it is weakened, I attempt to strengthen the structures around my d and f7 pawns as the B intercedes.",
        "13. a3": "But, as noted, the damage has been done.",
        "13... Bd6 14. e4": "The idea is to win a material.",
        "14... dxe4": "Now, I viewed 14.e4?? as a blunder because this move appears to win a piece for a pawn.  But, that isn't so, as she had it well calculated.  ",
        "15. Qxb7 exd3": "?? Although not as bad as before, as I starting to wind down, things were not completely settled.  Therefore, I still remained distracted which caused this blunder because of her next move.  If that distraction had, already tapered off, I would've retreated with 15...Ne7  From here on in, the distraction lessons more, but it is too little, too late, as she has now compensated and with my K exposure has a near winning advantage, at this point.",
        "16. Qxc6 Qe7": "Now, I feel that the Q must come out.  Seeing that she's all set, I decide to connect my R's.",
        "17. Qe4": "Going after my pawn.",
        "17... Rab8": "I could've protected with 17...Rd1, but in an attempt to exchange, I play this.",
        "18. Rab1": "But, she declined.",
        "18... Rb6": "? Figuring that I could double up since I know how powerful that could.  And, Still a little distracted for the obvious and thinking that I had played 18...Rd1, I made this mistake.  I just didn't realize that I, inadvertently, made the wrong move, until she captures and wins a pawn.",
        "19. Qxd3 Rfb8": "As noted, however, doubling up.  The other idea is to compensate and win back a pawn by putting pressure on the b file.  Note: Some time ago, I made this mistake against Jack when he threatened something similar, and I miscalculated, but the situation was even worse because, instead of a pawn, he was able to win a piece.  It was, my LSB, if I'm not mistaken.",
        "20. b4": "To defend since I am pressuring the b file and threatening to win the b pawn.",
        "20... c6": "To increase pressure, without putting any restrictions on my DSB.",
        "21. Rb2": "I have no idea why Mary played this since she dosen't double up, immeidately.  But, my guess is to eventually do that since she will bring that R to e2 shortly.",
        "21... a5": "In an attempt to exchange pawns.  Now the idea is that when behind, pieces should not be exchanged, but there is nothing wrong with exchanging pawns.",
        "22. b5": "However, white will not accept right away, as she has other plans.",
        "22... Bxa3": "But, I won't hold back.  The idea is to also gain a tempo.  However, that's not a good thought process, as just the opposite would happen, if she played 23.Rb3",
        "23. Re2": "But, she doesn't.  Instead, white plays what I mentioned on her 21st move.",
        "23... cxb5": "?? So, I take.  However, in this case which I didn't think it was in this position, but, \"To take is a mistake\"  That's because of what she is about to do. ",
        "24. Nd5": "! Best, as 24.Nxb5?? would be a blunder.  24...Rxb5 and if then 25.Qxb5?? 25...Rxb5, at the very least losing a R for a pawn, taking back would, in addition, lose the Q for a R.",
        "24... Qd6": "?? Still just a little distracted when things calm down, I played this.  It should lose the R, I thought that my Q was in danger and had to defend either that or the R since the fork was effective.  But, had I payed better attention, I would've realized that this isn't so as I could've compensated and won her N with 24...Bxd5  Note: I was not completely back to my normal self, during this game.",
        "25. Nxf6+": "I'm just fortunate that she missed that opportunity and grabbed my f pawn.  But, best was 25.Nxb6, and although I would've taken back with 25...Rxb6, black still loses a R for N.  As we will see later on, however, I push my luck too far.",
        "25... Kg7": "Also possible was 25...Ke8, but I'm going for counterplay, at any cost.",
        "26. d5": "Taking advantage of her passed pawn.",
        "26... Kxf6": "?? At this point that distraction has ended once and for all, but not only is too little, too late, but this loses very quickly.  I played this because I got too confident that I had won something back.  But, in this context because of what she is about to do.  In fact, it loses very quickly.  Taking with the B is also a blunder as I'd lose the Q, so, \"To take is a mistake.\"",
        "27. Qd4+ Ke7 28. Qh4+ Kd7 29. dxe6+": "This is how.  She just compensated, and either way, I fall behind.  In this position, she has a passed pawn, so I have to be careful.  If I don't take, she will with no way to stop it, without losing my Q.  So, I thought that there was only one way out.",
        "29... fxe6": "But, there isn't because after getting confident that as I stopped the promotion she will still win my Q by pinning it, with her next move.",
        "30. Rd2 Qxd2": "There, however, were not a lot of options as she was also threatening 21.Ne5+, and after getting out, she would still my Q for R.  Except that it gets worse, as I saw a, potential mating sequence.  Now, I see that she wouldn't have mated, but the result of what happened, would've remained the same.",
        "31. Nxd2 Rc6": "? Trying to compensate, as the plan was 32...Rc2  But, I could've done better with 31...Rd6  Note: Now that I am in a lost position, I will do just about anything for counter play.  That means, even if unsound, get really aggressive, as long as, I have enough defenders because this is now the alternative to resigning.  And, for me, resignation is not an option, yet.  However, I did not do a good enough as something else needed to be defended.  As a result, this loses another pawn.  Best was 31...e5 defending the h6 pawn.  ",
        "32. Qxh6 Rbc8": "?? Doubles up and putting pressure on the c file.  With the idea of getting aggressive, as noted earlier, I also looked at and considered 32...e5  However, this move and 32...e5?? are both blunders, as they would result in the same thing, the loss of, yet, another piece.  I'm not sure, but I believe that the best move was 32...Be7 so even after what she plays, my B is still safe.",
        "33. Qh7+ Kd8 34. Qd3+ Ke8 35. Qxa3 b4": "? Now, I do what I can for counterplay.  And, seeing that I have passed pawn, I push it since passed pawns must be pushed.  However, this was a miscalculation as I now lose another pawn.  Best was either 35...Ra6 or 35...Ra8   ",
        "36. Qxa5 Rc6c1": "Now, I recently gave constructive criticism to reachforgoals for doing something like this, and in general, a bad idea.  the only difference is that, in this position, I know that it isn't mate.  But, the idea was pinning the N and threatening mate.  This is my only alternative to resigning, at this point because, even if I defend the b pawn the position is hopeless because, despite the passed pawn with a non passer on e6 and two R's, she is far ahead.  Not only that, but has one more passer then me so it is, on or another, lost.  But, I am determined not to resign, yet.  That, however, will change, very shortly.",
        "37. Rxc1 Rxc1+ 38. Nf1": "Seeing how it is and for the reasons outlined, I resign.  After this game, all the negatives, in this context, went away.  In other words, I did not let it distract me after this game.  What I learned is that right after getting over a bad experience, in general, it needs to become history right away.  Or, as the saying goes which should happen right away is, \"Let by-gons be by-gons\".  In other words, you shouldn't let things go, eventually.  Sure, things will be settled, but you won't play as well.  Instead, it's better to let it go and start thinking about the positives immediately and have things calm down, immediately.  That way, it won't distract in your games."
    },
    "url": "https://gameknot.com/annotation.pl/let-by-gons-be-by-gons?gm=59006",
    "gameName": "\"Let by-gons be by-gons\"",
    "players": "gacs (1314) vs. jkarp (1268)",
    "opening": "Saragossa opening (A00)"
}