{
    "moves": {
        "1. d4": "My usual d4 queens pawn opening.",
        "1... Nf6": "black chooses an indian defence, an opening that is usually a waiting type opening, at least in my experience. Black wants to know what white is going to do next...",
        "2. c4": "Book move, really, continuing along the lines of the indian defence",
        "2... e6": "typical move in the indian...",
        "3. Nc3": "Opening book move. ",
        "3... Bb4": "Getting into the nimzo-indian here. ",
        "4. a3": "I play a3 in an attempt to trap the bishop. A possible line here is 4. a3 Ba5  5. b4 Bb6 and finally, c5 traps the bishop",
        "4... Bxc3+": "Black plays along along a variation of the nimzo-indian. I personally like to see a move like this early in a game trading a bishop for a knight in a game that in most cases turns out to be fairly open where bishops have a slight advantage over knights...",
        "5. bxc3 c5": "Still in opening book theory, I was actually surprised to see this move. Most players are not that schooled this deep in the Nimzo-indian (Samisch Variation). In fact, I have no idea what the response from white is supposed to be here.",
        "6. d5": "We are finally out of opening theory here, as my own knowledge of this opening is limited, so I played d5 not wanting to trade one of my central pawns for one of black's flankers.",
        "6... O-O 7. Bg5": "Pins the knight...",
        "7... h6": "I like to see this move, really, as it weakens the king side slightly...",
        "8. Bh4": "Maintaining the pin and hoping for perhaps g5, a further weakening of BLack's kingside. Makes the previous move (h6) seem a bit silly...",
        "8... d6": "Not sure why black doesn't want to play exd5 to free up his bishop....",
        "9. Nf3 Nbd7 10. e3 b6 11. Bd3 exd5": "We finally see exd5, but Black still has his bishop trapped...",
        "12. cxd5 Bb7 13. c4": "Now that the bishop has developed, I try to play to limit the newly developed bishop's mobility",
        "13... Ne5": "I was glad to see this move as after the trade on e5,  I end up with a solid pawn center, a passed d pawn, and a stronger stranglehold on Black's white-squared bishop...",
        "14. Nxe5 dxe5 15. e4 Qd6 16. a4": "played to stop a possible ... b5, which I dont want to see as it would undermine my strong center",
        "16... Bc8 17. O-O Bd7": "good move by black here...puts my rook on pawn guard duty for a while...",
        "18. Qd2": "preparing for the central pawn break...f4",
        "18... Ne8 19. f4 Nc7 20. fxe5 Qxe5 21. Bg3": "trying to take advantage of a skewer here on the undefended knight on c7...",
        "21... Qd4+": "Black's only real response to stop Bxc7...",
        "22. Bf2 Qf6": "Moves right into a discovered attack possiblity...",
        "23. Bg3": "hoping again for the knight on c7, this time with the discovered attack on Black's queen...",
        "23... Qd8": "Not sure I would have chosen this move, but I was glad to see Blacks's queen in such an isolated position and tied to the defence of a knight",
        "24. Qf4": "obvious threat of winning the knight on c7 with a queen trade",
        "24... Rc8": "Black defends the new threat...",
        "25. Rf2": "preparing for an eventual pile up of my rooks on the F file...",
        "25... Ne8": "Cuts off the defence of the rook...a move I am going to try to take advantage of...",
        "26. e5": "planning e6. ",
        "26... f6": "Love to see Black further weakening his king position...",
        "27. Qe4": "not sure why I played this, besids the simple threat of Qh7+. Takes me a move or so to realize that my e pawn is perfectly safe. ",
        "27... f5 28. Qf4 g5": "Black cant stand that queen, apparently, but this move further opens the kingside",
        "29. Qf3 f4": "It is at this point I realize my error a few moves ago and see that Black cannot capture the Bishop with out mate to follow",
        "30. e6": "My bishop is safe...I play e6 to trap Black's bishop instead...",
        "30... fxg3": "The move that made my day, black doesn't see the mate threat...",
        "31. Qxf8#": "and mate..."
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=31639",
    "gameName": "Let's play chess",
    "players": "freefallife (1222) vs. geoffe (1257)",
    "opening": "Nimzo-Indian (E24), Saemisch, Botvinnik variation"
}