{
    "moves": {
        "1. d4": "A complicated opening where the queens pawn match becomes locked down and dirty in a way that generally only the kings pawn game can cause",
        "1... e6": "black plays defensively",
        "2. c4": "If e4 we move streight into a game where the e pawns are written off... I always prefered queens gambit accepted",
        "2... h6": "An odd move with possible transition to an extended fianchetto ",
        "3. e4 c5 4. d5 e5": "With both players playing defensive it quickly becomes apparent tht the center of the board is a write off",
        "5. Nf3 d6 6. Nc3 a6": "blacks got strong defensive posture with his pawns but my deep d pawn cramps his offensive possibilities",
        "7. a4": "preventing b5 and all the defensive lapses tht occur because of it",
        "7... Nf6 8. Bd3 a5 9. h3 Na6": "beginning of baidarkas interesting attempt to play queen side... the knight has a good niche at b4 but cant really go any further",
        "10. Be3 Bd7 11. Qb3 Nb4": "Nc2+ would b a major problem but my defensive position is incredibly secure. Nxd3+ however would b irritating",
        "12. Be2 Qb6": "threatening Nc2+ with the queen being lost",
        "13. O-O-O": "Nd3+, Kc2 and the queens swap...",
        "13... Be7 14. Rdg1": "setting up for my king side assault",
        "14... Nd3+ 15. Kc2": "setting up the queen swap where i hold a major advantage",
        "15... Nb4+": "Black declines",
        "16. Kd2": "Now he cant try again",
        "16... Qa6 17. Nb5": "Threatening Nc7+",
        "17... Nxe4+ 18. Ke1 Bd8": "blacks knights look strong but they have no backup to snare the king",
        "19. g4 Bxb5": "poor choice",
        "20. cxb5 Qb6 21. h4 g5 22. hxg5 Be7 23. g6": "gxh6 or even Rxh6(the swapped rooks forcing black to queenside castle and possibly reposition the queen) might hav been better",
        "23... fxg6 24. Rxh6 Bf6 25. g5 Rxh6 26. gxh6 O-O-O 27. Rxg6": "Rh1 would have avoided the difficulties tht result after rh8",
        "27... Qc7": "but black opts to free up his queen",
        "28. Rg1 Rh8 29. Rh1": "status quo resumed",
        "29... Qf7 30. Bd3": "If after the black bishop moves the queen checks at f2... howevr this forces the knights retreat... Nxd3 qxd3 does the same thing but wins me both knights",
        "30... Ng5 31. Bf5+": "three real possibilities... Kb8 is the one tht leaves me with the fewest responses",
        "31... Kb8": "doh",
        "32. Bxg5": "Nxf3+ and I hav no answers...",
        "32... Bxg5": "Be6 might have been best",
        "33. Nxg5": "Mistakes",
        "33... Qxf5 34. Ne6 Qb1+": "hoping to force perpetual check and maybe get either a draw or a queen swap",
        "35. Qd1": "Beginning of defense of perpetual check...",
        "35... Nc2+ 36. Kd2 Qxb2 37. Rh4 Nd4+ 38. Ke1 Qc3+ 39. Qd2 Nc2+ 40. Kd1": "Kd1! Knight cant be saved without queen sacrifice...",
        "40... Qa1+ 41. Kxc2 Qa2+ 42. Kd1 Qb3+ 43. Qc2": "Qc2? Queen sucessfully deflects me from defending d5",
        "43... Qxd5+": "Qxd5+!! There goes my knight. First mistake Ive made. ",
        "44. Qd2 Qxe6 45. Qg5": "Beginning of new strategy... By seperating my queen from my king I invite perpetual check ending in possibly a 50 move draw or if hes smart he'll move a pawn to avoid it and allow me to tighten my own grip on his rook",
        "45... Rg8": "Expected... looking to gain the advantage... If the queen moves rg1+ allows his queen and rook to tandem check me into a corner.",
        "46. h7": "But if the rook takes the queen the pawn queens and I get the tempo... which means I can totally risk the loss of my queen",
        "46... Rxg5 47. h8=Q+": "Now black has to scramble",
        "47... Rg8": "Queen cant take rook... again",
        "48. Rh6": "but a queen swap at this point still gives me options",
        "48... Qf7": "Blacks queen cuts me off from escape... 2 options now present myself... both being a queen swap",
        "49. Qf6 Qd5+": "Black avoids the queen swap...",
        "50. Ke2": "SO Im planning to move my king somewhere I can assault and defend simultaneously... forced to avoid being checked to oblivion but its the beginning of the end for me as I overlook his pawn advantage. ",
        "50... Qa2+ 51. Ke3 Qb3+ 52. Ke4 Qxa4+ 53. Kf5": "2nd and crucial error. Kd5 accomplishes same objective as Kf5 without risking an untimely fork",
        "53... Qf4+ 54. Ke6 Qxf6+ 55. Rxf6": "Blacks pawn advantage quickly becomes a problem as he realizes the importance of protecting his king",
        "55... Ka7": "Ka7!! Prevents b6 which would have allowed a back rank mate if his rook left the eighth rank to stop my king from mopping up his pawns",
        "56. Kxd6 Kb6 57. Rf5 Kxb5 58. Rxe5": "Now his three pawn advantage shifts from the center where they were exposed to the flank where his king is perfectly placed to provide defense",
        "58... b6 59. f4 a4 60. f5 a3 61. Re2": "Now I cant protect my pawn",
        "61... Rf8": "Ke6 leads to a fork where my rook falls...",
        "62. Ra2 Rxf5 63. Rxa3 Rf4 64. Rb3+ Rb4 65. Rh3 Rd4+ 66. Kc7 Ka5 67. Rb3 Rb4 68. Rc3 c4 69. Kc6": "Black needs his king to support c4 pawn while the rook forces my rooks retreat",
        "69... b5 70. Kc5 Ka4 71. Kd4": "looking to move my king around to the back...",
        "71... Rb3 72. Rc2 Rb4 73. Kc3 Rb3+ 74. Kd2 Rd3+ 75. Ke2 Kb3 76. Rc1 Kb2 77. Rf1": "And I resigned... having my king forced away from the queening square and seperated from the pawns I can only watch as they bloom into queens"
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=41653",
    "gameName": "Let's play chess",
    "players": "rockstermaniac (1178) vs. baidarka (1331)",
    "opening": "Queen's pawn (A40), Keres defence"
}