{
    "moves": {
        "1. e4": "Centre game opening. Interesting in a lot of respect. Any hints as to mistakes, moves that could have been more efficient is much appreciated",
        "1... e5": "The balance on the board is restored",
        "2. Nf3": "White attacks Black's e pawn",
        "2... Nc6": "Defence of the e pawn, a fight for the centre",
        "3. d4": "White decide to re-attack the my centre pawn by d2-d4. Capturing White's d pawn is better than trying to protect it as Black's position could become cramped pretty quickly",
        "3... exd4": "Black takes White's pawn and puts the question back to him: reclaim your lost pawn!",
        "4. Nxd4": "White takes the d pawn. I could have taken White's knight in the centre of the board but decided against it because then the his queen would be in the centre of the board white no obvious way to attack it as most of my pieces were still firmly hemmed in. However, the decision of not taking the knight off means that I should be prepared for doubled up pawns (Am I the only one who hates doubled up pawns?)",
        "4... Nf6": "Deciding against attacking the d4 knight, I attack the undefended e pawn. Continue fighting for the centre. The doubled up pawn could be coming...",
        "5. Nxc6": "As expected (or feared), White takes my knight off the board",
        "5... bxc6": "Black retakes his knight. I was not keen on using the d pawn as White would be more than happy to exchange queens, whereby my king would loose the right to castle",
        "6. Bc4": "White prepares to castle (or for any subsequent attack on my king after it has castled king side. I want to restore my pawn structure...",
        "6... d5": "Double attack on his bishop and his e pawn. I gain a tempo in development",
        "7. Bb3": "White decided to retreat to enforced my double up pawn. The best move I thought was to prepare to castle by moving my dark square bishop to e7, but then I would still be on step behind in development to white. Seeing that all of his queen side was still full, I decided to fix the White king in the middle of the board for now.",
        "7... Ba6": "The sole idea is to keep white from castling to allow up a better game through superior and faster development. In my mind, this move was the key in winning the game, even if in the middle of the action, I was very worried about putting my bishop unprotected",
        "8. Bg5": "In my mind, this is a useless move as my next move was Be7 anyway, to prepared to castle. The only rationale I saw was: 1)that White had given up trying to castle king side and wanted to castle queen side instead and 2) preparing to take my d5 pawn off (attacked 3 times, defended 3 times), so by taking the knight out, he'd be a pawn ahead",
        "8... Be7": "I gain an extra tempo and free up the pin with this move. I am resigned to losing my d5 pawn... My only consolation would be still having my 2 bishops",
        "9. Bxf6": "My remaining knight is off",
        "9... Bxf6": "I recapture. Regardless of what White does, I will castle next and start putting pressure on this well centred king",
        "10. c3": "White did not White take the pawn? Was he worried about his king being still in the centre? If he is, why is 1) destroying his pawn structure queen side and 2) depriving his knight of the better c3 position?",
        "10... O-O": "I king is off. The middle game begins..",
        "11. Nd2": "White deploys his remaining knight to d2, still fighting for centre control. The knight movements are very restricted in this position anyway (b1 or f3 only)",
        "11... Re8": "Now let's pin the pawn to the king. I liked the pin because there was no obvious way to break it immediately (unless he puts the queen as a buffer)",
        "12. Qc2": "White is still fight for centre control. But now, his bishop is cut off the right hand side of the board (for now) I thought he was preparing castle and increase pressure by moving one of his rooks over at some point",
        "12... Bg5": "Since I wanted to hang on to my pawn, I decided to take the knight out of the game",
        "13. O-O-O": "White castles. A terrible move, as now his knight is out of the game (absolute pin)",
        "13... dxe4": "Thank you very much, I take off his hanging pawn. I am still doubled up on the c file, but hey I am a pawn up. My queen is under White's rook but is safe (for now) given that the knight cannot move",
        "14. c4": "White cut my light squared bishop from the other side of the board",
        "14... c5": "I respond in kind. This move also allows my to move my light squared bishop to the a8-h1 diagonale to provide extra support to my e pawn and an x-ray attack on the White rook in h1",
        "15. Kb1": "White releases the the knight pin. I must take the knight, as soon my e pawn would be overwhelmed. Plus my queen is right underneath and is too sensitive to fight along an open file. Notice that now White's king and queen are lined up in a diagonale and I still had my light squared bishop",
        "15... Bxd2": "To protect my pawn, the knight had to go. I do not like trading a bishop for a knight, but the end justified the means",
        "16. Rxd2": "As expected",
        "16... Qh4": "My queen goes on the prowl and provide extra support for my very loved and cared for e pawn. Funny how a pawn can become a centre of a few moves",
        "17. g3": "The temptation was too great, and White had to attack my queen",
        "17... Qg4": "The Queen had to move and still provide support to my e pawn. My e pawn was safe for now (attacked by a queen and protected by a rook) but just in case, I wanted to keep my queen near by",
        "18. Rd5": "White is on the march to reclaim his lost pawn. I personally do not like having my rook wandering unaccompanied around the board. They are so clunky and work best as rear protectors in the middle game and battle tanks in the end game. But that's just me. Anyhow, White has a good unprotectable attack on my c5 pawn and subsequent pressure on c7 pawn",
        "18... Bb7": "Now, I was eying one of two things, either taking the unprotected h1 rook off by moving the e pawn up, or better yet, catching the White queen in the same diagonal as the king. White may think I was desperate to attack anything, but I was not, I just wanted to make sure that he does carry out his thread of Rxc5",
        "19. Rxc5": "He wanted to and had to",
        "19... e3": "Now, I can have me a whole rook at the very least. I am attacking the rook on h1, the pawn on f1 with a threat of queening early in the game and to top it off, he controlled the e4 square 3 times",
        "20. Rf1": "White is preparing to attacking my queen by f1-f2. Not a good move, the rook is much better off in an open or semi-open file",
        "20... Be4": "No rook meant I was free to use the e4 square to pin White's queen to the king. The game was half won",
        "21. f3": "That was his next move anyway, but I could gain an extra tempo by attacking with check. Plus I had now a passed pawn. As governor Blagojevich would say: this is a f. valuable thing.",
        "21... Bxc2+": "His queen is off with check",
        "22. Bxc2": "My bishop is off the board and White has finally an open diagonal to my king, with check. But I have a passed pawn...",
        "22... Qh3": "I could not forget that my queen was under attack, I attack the f1 rook which it was best to move",
        "23. Re1": "Good. Now let's try to either double up rooks or try and control the d file but first let's take care of that bothersome diagonal",
        "23... g6": "This is a very bad move from me. I normally would not do this because of the weak squares f6 and h6. But I reasoned that White's dark squared bishop and queen were off the board, so having my king able to run to the g7 (a dark square) when attacked, would be a good thing",
        "24. Be4": "Excellent move from White He attacks my rook and prepares an attack on my passed pawn",
        "24... Qxh2": "When you are up, you tend to overlook things. This was a terrible move, I had overlooked the attack on my rook and was just preparing to pick off White's king side pawns",
        "25. Rxc7": "White obviously overlooked the rook attack as well. Uh, the rook must move",
        "25... Rad8": "Another terrible move from me, I had the opportunity to threaten mate by Rab8, instead I came back to my original idea a few moves back to control the d file, I was happy to give up pawns because I was so far ahead",
        "26. Bd5": "Excellent move from White. He had a ready made attack on my king.",
        "26... Rdb8": "I read on a chess forum that one should always address all threats. But here, I had caught up to the checkmate potential on b2 and was happy to give up both rook and pawn",
        "27. Bxf7+": "An excellent move. A fork on my king and e8 rook",
        "27... Kf8": "I did not want to put myself in the corner where the king's movements would be severely restricted",
        "28. b3": "White parries the mate threat. Excellent move. The only move he had actually",
        "28... Red8": "back to the d file. Old ideas die hard",
        "29. Bd5": "White now has a mate plan. Rf7+ Ke8, Rxe4+ would eventually lead to White's win. That's why I did not fork White's rooks by Qxg3. My king could take care of it self if I protect my f. valuable e pawn",
        "29... Qd2": "White can do what he wants, I can have a lonesome rook later",
        "30. Rf7+": "As expected. The king's only move is Ke8, Kg7 would lead to a deadly discovered attack",
        "30... Ke8": "My only move",
        "31. Rh1": "By now I had learned my lesson...",
        "31... h5": "Address all threats. I could have started marching my e pawn up two squares to queen which probably is a better move than protecting a pawn",
        "32. Rf6": "Excellent move from White who has not given up the fight. Going for an attack on my g6 pawn and a threat of check by Bf7+",
        "32... Qd3+": "I had to go for forcing a fork of the king and rook on f6",
        "33. Kc1": "White king had only the dark squares to move to",
        "33... Qc3+": "The fork. The game is all but over. White resigns."
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=24382",
    "gameName": "Let's play chess",
    "players": "mglea63 (1561) vs. arnihilator (1550)",
    "opening": "Scotch (C45), Mieses variation"
}