{
    "moves": {
        "1. d4": "the game consisted on a Slav defence resulting in a queen side pawn majority for black in exchange for activity and more space for white, eventualy white managed to create a passed pawn but black remained with three pawns against one on the queen side, the exchange of queens and some more manoeuvring lead to two distant passed pawns for black against one blocked central passed pawn for white, the transition to pawns endgame would favour black, so white was forced to accept a technical drawn rooks endgame ",
        "1... d5 2. c4 c6 3. Nf3 Nf6 4. Nc3 dxc4 5. a4 Bf5 6. Ne5 Nbd7": "QGD Slav (D17), Carlsbad variation",
        "7. Nxc4 Qc7 8. g3 e5": "contesting the centre...",
        "9. dxe5 Nxe5 10. Bf4": "so white has the initiative, I'll just have to hang on, and latter try to exploit the queenside pawn majority on the endgame",
        "10... Nfd7 11. Bg2 f6": "releasing the d7 knight for other preventive tasks",
        "12. O-O Nc5 13. Ne3": "again white shuffles his pieces to create a little more pressure",
        "13... Bg6 14. b4": "and gains space also",
        "14... Ne6": "N already played was Rd8 in the drawn game, Elsness Frode (NOR) - Collins Sam (SCO), Goteborg (Sweden), 2005 ",
        "15. Qb3 Bf7": "an illusion if I had any thoughts about Nxf4 with a discovered attack on the queen... but one never knows!",
        "16. Qb1 Be7": "finally I'm able to castle in to safety",
        "17. Rc1": "white is concentrating his efforts on the queens wing and on a minority attack",
        "17... O-O": "castle is fine here, as it frees my rook to action on the other wing if needed, while protecting the king",
        "18. Ncd5": "he wants a bishop... white's coordination is great Rc1! and now Ncd5, I'll have o give up my bishop",
        "18... Qd8 19. Nxe7+": "but I don't know about this exchange, white has more space, so as a strategic principle he should avoid exchanges",
        "19... Qxe7": "for now I'll have to keep the position closed, to benefit my knights in relation to white's bishop pair",
        "20. Nf5": "pointless... unless white wants to exchange his dark bishop for a knight?",
        "20... Qd8 21. Be3": "he does want to exchange bishop by knight",
        "21... Ng4": "I'll give him an incentive to do so, and in the process avoid f4 with tempo",
        "22. Rd1": "just wast of time",
        "22... Qc7": "my queen is better placed here at c7",
        "23. Bc5 Nxc5 24. bxc5": "expected now white will put his knight on d6 for sure",
        "24... Rab8 25. Nd6 Ne5": "Ne5-c4-dd6 to remove that annoying d6 knight",
        "26. f4": "white gained some space although Nc4 was intended, and exposes his king so possibly is a mistake that will allow me some counter-play latter on",
        "26... Nc4 27. Qe4": "now Nxd6 Qb6+ hits the exposed king if I can capture the d6 pawn the endgame is clearly better for black",
        "27... Nxd6 28. cxd6 Qb6+": "! inviting the exchange of queens... white has more space, but I'm exchanging pieces at a steady pace, so he would probably have a lots of problems to solve in the endgame, we are reaching it fast!",
        "29. Qd4 Qxd4+ 30. Rxd4 c5": "time to get back some space, my pawns can also promote, although I'm a bit behind in the start...",
        "31. Rd2 f5": "to avoid e4",
        "32. e4": "e4 was played nevertheless so I'll exchange it, so white could not get any pawn support to his passed pawn",
        "32... fxe4 33. Bxe4 Rfd8": "blocking the pawn, now if I can exchange the bishops we enter a theoretically drawn rooks  endgame, were black has the upper hand and white has to be careful with the distant passed pawns",
        "34. Kf2 a6 35. a5 b5": "to create two passed pawns, white has to capture the b pawn as if not I would have two connected passed pawns and a laborious but possible win",
        "36. axb6 e.p.": "forced",
        "36... Rxb6 37. Ra5 c4": "some more pressure, threatens c3 with tempo and maybe, if allowed, Rb2",
        "38. Rc5 Kf8": "due to my weak first rank I need to bring the king to the centre or create an escape window with my g or h pawns... the king in the centre can be more active so I chose it over the other option",
        "39. Bc6 Be6 40. f5": "? obviously from an offensive player, otherwise is bad as will allow an easy to drawn endgame, if white captures the bishop I'll offer the draw",
        "40... Bd7": "if white exchanges it will be a drawn rooks endgame",
        "41. Bxd7 Rxd7": "I've sent a draw offer, let wait and figure if my opponent sees this as a draw, or has some other ideas for the position... as I see it is a sterile position, with nothing to do for white!",
        "42. Rc8+": "offer declined so now I'll prove my point... forces Kf7",
        "42... Kf7": "forced, if Rc7 then Ke8 Re2 Kd8",
        "43. Rc7 Ke8 44. Re2+ Kd8 45. Rxc4 Rbxd6": "next I'll move my king back to the king's wing to block any passer, and then only black would have a chance to win, so I expect white to go for a draw",
        "46. Ra4": "? allows me to exchange other pawn... Rf7 g4 g6 and the f pawn is exchanged leaving white with two unconnected (ergo easier to attack) pawns",
        "46... Rf7 47. Ra5": "this or g4... after my reply I think g4 is next in line",
        "47... g6": "a basic pin... so fxg6 is not possible",
        "48. g4 gxf5 49. gxf5 Rdf6": "threatening to capture the pawn with check",
        "50. Ree5": "white have either to defend the pawn or give check, moving the king would lose the pawn",
        "50... Re7": "to prevent Re6, next I'll march my king back to the king's wing to block the pawn, releasing one of the rooks from defensive tasks... let's see what white has to say about that, the main idea for white is to try to exchange at least one of the rooks and then try to push the a pawn foreword to get him under more pressure",
        "51. Kg3": "white started approaching the king to the fighting area...",
        "51... Rxe5": "less material to worry about any mate threats",
        "52. Rxe5 h6": "denying white access to g5 ",
        "53. Kg4 Kd7": "to get my king closer to action also, and defend the 6th rank",
        "54. h4 Rb6": "the only open column for white's rook to infiltrate my field...",
        "55. Kh5 Rf6": "back to block the f pawn",
        "56. Re1": "white's idea must be, to play Rg1-g6..., but if Rg1 I have Ke7 and Rxf5+ then if Kxh6 Rf6 forces Rxf6 Kxf6 and I'll win because white's king is trapped on the h column",
        "56... a5": "putting more pressure on white",
        "57. Re5 Ra6": "forced, finally I think he is trying a draw... I've inserted a conditional 58. f6 Rxf6 59. Rxa5 Ke6 60. Ra6+ Ke5 61. Rxf6 Kxf6 62. Kxh6 Kf7 63. Kh7 Kf6 64. Kh8 Kg6 but there are several other alternatives",
        "58. f6": "the advance of the a pawn forces white to exchange yet another pawn",
        "58... Rxf6": "forced",
        "59. Rxa5": "now I'll get my king to back up my rook and even if white exchanges rooks, the recapture with the king assures the draw, a I'll be able to control the promotion square",
        "59... Ke6 60. Ra3 Ke5 61. Ra1 Ke6": "keeping the king close to the rook as planed",
        "62. Ra7": "to get to h7",
        "62... Ke5": "Rh7-Rxh7 forcing the exchange of rooks and I'll play Kf6 after the exchange to block the king on the h column forcing a draw",
        "63. Rh7 Ke6 64. Rg7 Kf5": "Rg6 Rxg6 and I'll draw by stalemate ",
        "65. Rg4": "My opponent offered a draw, which I declined let's draw this move by move, if he knows how, as he just missed a forced threefold repetition draw",
        "65... Ke6 66. Rg1 Ke5 67. Re1+": "and he goes for a draw... Rf1+-Rxf6",
        "67... Kf5": "I'll keep moving my king, the rook stays on f6 until white decides to exchange...",
        "68. Re2": "still he doesn't find a draw... sometimes is harder than to find a win!",
        "68... Kf4": "let's give him a hint: Rf2+ to force the exchange of rooks",
        "69. Rf2+": "this time he gets it right... now is easy just have to capture the rook!",
        "69... Ke5 70. Ra2": "still not seeing the draw",
        "70... Kf5 71. Re2": "and again, I wonder how many misses do we still have facing ahead of us? Maybe 38 more draw opportunities missed.. as it is the number of moves still required to claim a draw by the 50 moves rule...",
        "71... Kf4 72. Rf2+ Ke5 73. Rg2 Ke6 74. Rg7 Rf5+": "now I'll sacrifice the h pawn to try and force a draw... if Kxh6 Rf6+ Rf6 Kf7... and white's king is trapped on the h column depending on his reply I can even win this game if he plays with as much objectiveness as before",
        "75. Kxh6 Rf6+ 76. Rg6 Ke7": "now let's see what does white plays here?",
        "77. h5": "50th move rule on move 127 (!)",
        "77... Rf5 78. Rg7+ Kf6 79. Rd7 Ke6": "if Kg6 I have Rxh5 Kxh5 Kxd7 drawing by insufficient material",
        "80. Rc7 Kf6 81. Ra7 Rb5": "forty moves latter I've sent another draw offer, let's see if white accepts it now?",
        "82. Ra2": "not yet, it's hard to abandon one pawn advantage to accept a draw...",
        "82... Kf5": "can I get to g4?",
        "83. Rg2": "no I guess not...",
        "83... Rb6+": "if 84.Rg6 to block I'll play Rb1 and defend the h pawn from behind...",
        "84. Kg7 Rb7+": "now I'll give some checks either on b7 and b8 and if white plays Rg7 or Rg8 I'll play Rb1 to defend the pawn from behind",
        "85. Kg8 Rb8+": "now if Kh7 I'll proceed with the planed defence from behind",
        "86. Kh7 Rb7+": "Rg7 and I'll play Rb1",
        "87. Rg7 Rb1": "I've changed my mind if white plays h6 I'll play Rb6 and keep defending from the side, if white plays his rook along the 7th rank I'll play Kg5 threatening to capture the h pawn with the king",
        "88. h6": "we can draw by move 138...",
        "88... Rb6": "one",
        "89. Rg8 Rb7+": "and now:\nif Kh8 I have Kf6 \nif Rg7 I have Rb6 back to the initial position for the second time",
        "90. Kh8 Kf6": "I'll keep my king on f6 or f5 and shift my rook along the b column",
        "91. Rg1 Rb8+ 92. Rg8 Rb7 93. Rg7 Rb8+ 94. Kh7 Rb1 95. Rg6+ Kf5 96. Rg2 Rb7+ 97. Rg7 Rb6": "two after h6 and with black king on f5",
        "98. Rg1 Rb7+ 99. Kg8 Rb8+ 100. Kg7 Rb7+": "white can still use the f column to do this cat and mouse game avoiding the draw, but after it he has to go back or lose the h pawn",
        "101. Kh8 Rb8+ 102. Rg8 Rb7 103. Rg7 Rb8+ 104. Kh7 Rb6": ""
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=42019",
    "gameName": "Let's play chess",
    "players": "svirepyaduh (2161) vs. kaspanatola (1947)",
    "opening": "QGD Slav (D17), Carlsbad variation"
}