{
    "moves": {
        "1. e4 c6 2. Bc4 d5 3. exd5 cxd5 4. Be2": "Be2 struck me as passive, but there is nothing passive about White's play in a minute.",
        "4... Nf6 5. d3 Bf5 6. g4": "Be2 was apparently preparation for this.  White quickly gets the initiative.",
        "6... Bd7 7. g5 Ng8": "White has the advantage here with more space.",
        "8. c3 Qc7 9. f4 Nc6 10. Na3 a6": "To prevent Nb5.",
        "11. d4 O-O-O": "Now White has a dilemma.  It's difficult to castle Kingside with the pawns advanced so far.  With Black castling on the Queenside, White would like to launch a pawn advance there, but that would expose the King even further.",
        "12. h3 f6 13. Nf3 e5": "Black fights back for a share of the center.",
        "14. fxe5 fxe5 15. Nc2 e4": "Black creates a passed pawn.  It won't be easy to hang on to, but it will be a problem for White.",
        "16. Ng1 Qg3+": "Maybe White missed this check.  With the King stuck in the middle of the board, Black can snatch a pawn.",
        "17. Kd2 Qxg5+ 18. Ne3 Bd6": "Now Black may have a slight pull, but Black's K is also fairly exposed.  Black needs to complete development quickly.",
        "19. Bg4 Nh6 20. h4 Qg6 21. h5 Qf7 22. Bxd7+ Rxd7 23. Nh3 Bf4 24. Kc2 Bxe3 25. Bxe3": "This position strikes me as chaotic with no strong advantage to either player.  ",
        "25... Nf5 26. Bf4 h6 27. Qg4 Kd8": "Black has to make sure the Rook isn't pinned.",
        "28. Raf1 Rf8 29. Rf2 e3": "White cannot play Bxe3 because of Nxe3+, forking the K and Q.",
        "30. Rf3": "The position of White's K and R allows a tactic with the Ns.",
        "30... Ncxd4+ 31. cxd4 Nxd4+ 32. Kb1 Nxf3 33. Qxf3 d4": "Now the position is unbalanced.  Black has two central passed pawns, but Black has two minor pieces for a R.",
        "34. Rf1 Ke8": "Black's K was vulnerable to a check from the B while sitting on a dark square.",
        "35. Qe4+ Qe7 36. Qd3 Qe6": "Black starts to make threats that are not easy to meet.",
        "37. Qg6+ Qxg6+ 38. hxg6": "Exchanging Qs makes the two passed pawns more powerful.  ",
        "38... Rd5 39. Kc1 Rf6": "Threatening to win another pawn.",
        "40. Rg1 Rh5": "White's N has nowhere to go!",
        "41. Bxh6 Rxh6": "Black now has a very good game, with a material advantage and the passed pawns.",
        "42. Rg3 Rhxg6 43. Rxg6 Rxg6 44. Nf4 Rd6 45. Kc2 g5 46. Nd3 Kf7": "Black tries to keep K and R on different color squares to avoid a simple fork.  White's K has to stay home to prevent the pawns from running to the endzone.",
        "47. Kd1 Kg6 48. Ke2 Kh5 49. Kf3 Kh4 50. b3 g4+ 51. Ke2 Kg3 52. Ne1": "Now Black can force an exchange on very favorable terms.",
        "52... d3+ 53. Nxd3 Rxd3 54. Kxd3 Kf2": "With Kf2, Black takes control of the promotion squares of both passed pawns.  White cannot stop the two potential Qs and resigned here."
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=61381",
    "gameName": "Let's play chess",
    "players": "littlemax (1543) vs. mmoody95 (1809)",
    "opening": "Caro-Kann (B10), Hillbilly attack"
}