{
    "moves": {
        "1. e4 c5": "Sicilian",
        "2. Nc3 a6 3. g3 e6": "Leaving book.  I'm just going to continue my normal development.",
        "4. Bg2 d6 5. d3 Ne7 6. Nf3 h6 7. Be3 Qb6": "Probably too early to bring out the queen; she just becomes a target.",
        "8. Rb1 Qa5 9. a3 Nbc6 10. O-O g5 11. Qc1": "In preparation for b4, winning black's initial flank pawn.",
        "11... c4 12. b4 cxb3 e.p. 13. cxb3 Bg7 14. d4 b5 15. b4 Qc7 16. Re1": "I almost didn't make this final preparatory move to support squares e4 and e5.  Ultimately, all encounters that I could think of needed one more attacker on those squares, so I spent the time to do this.  I'm glad I did.\n\nWhite has points for the advanced phalanx, superior development, and the bishop pair (since black has a bad LSB).  Black has an outpost at c4 and that's about it, putting White ahead by 2 (Point Count).",
        "16... O-O 17. e5": "Looking to clear the center, particularly the long diagonal for white's LSB.",
        "17... d5 18. Qc2": "Mostly just being patient.  Adds some support to a possible future king side attack, continues to guard the QN against future attacks from the black queen, and is in a position to attack on the QR file should things develop in that direction.\nThe queen side is highly symmetric at the moment.  Figuring out how to break the tension so that it swings in one's favor (or at least even) is always a challenge.",
        "18... Nf5 19. a4 Nxe3 20. Rxe3 f5 21. exf6 e.p. Bxf6 22. axb5 Nxd4": "I avoided 23. Nxd4 because 23. ... Bxd4 felt like it left me running.  The line the computer analysis suggested, however, was fairly aggressive (if less interesting).\n23.\tNxd4\tBxd4\n24.\tQg6+\tQg7\n25.\tNxd5\tRa7\n26.\tRxe6\tRxf2\n27.\tKh1\tBxe6\n28.\tQxe6+  Qf7\n29.\tQxh6\taxb5\n30.\tQxg5+",
        "23. Qg6+ Qg7 24. Qxg7+ Kxg7 25. b6": "Almost all of my play from this point on focuses on this pawn.",
        "25... Rb8 26. Na4 Nb5 27. Ne5 d4 28. Nc6 dxe3 29. Nxb8 exf2+ 30. Kh1": "Felt like I was flirting with disaster here (as confirmed by the computer analysis).  It might've just been my imagination, but Kf1 felt even more dangerous.  My main goal was to not get into a position where I would have to waste time defending mate threats and give up my passed pawn.",
        "30... Bd4 31. Nc5": "Defends the passed pawn and prepares to draw out the black LSB.",
        "31... e5 32. Nbd7": "Defends against 32. ... Bf5 forking my knight and rook.  Defends the passed pawn in support of Bb7.",
        "32... Rd8": "oops...",
        "33. Ne6+": "That's pretty much game.",
        "33... Kg8 34. Nxd8 Bxd7 35. b7 Ba7 36. Bc6 Bf5 37. Rf1 Bd3 38. Rxf2": ""
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=40592",
    "gameName": "Let's play chess",
    "players": "alng (1365) vs. djhopalong (1417)",
    "opening": "Sicilian (B23), closed"
}