{
    "moves": {
        "1. b3 e5 2. Bb2": "The Nimzo-Larsen Attack. This is not the strongest opening, but may offer psychological advantages. I feel comfortable playing this opening.",
        "2... Nc6 3. e3 Nf6 4. Nf3 Bd6": "Black blocks his d-pawn. He should have either advanced the e-pawn or played d6. If black had played d5 on move 3, he would not have this trouble.",
        "5. d4 exd4": "I don't agree with this move. I feel that black should have advanced to e4 and retained at least some hold on the center. Now white can gain control of the center. ",
        "6. Nxd4": "It would be foolish to take with the bishop instead of the knight first wouldn't it? We definately don't want to give up that bishop so easily; it is the star of the Nimzo-Larsen opening. ",
        "6... O-O": "Black has more pieces developed, but his pawn on d7 is cramping up his position and white has a stronger center.",
        "7. Bd3": "Developing and getting ready to castle. It is more common to play Be2 or Bb5 in the Nimzo-Larsen, but this is a somewhat strange position for this opening. My light-squared bishop is now eyeing h7. ",
        "7... Nxd4": "The pressure! The knights were just looking at each other waiting to see who would take first!",
        "8. Bxd4": "The theme bishop of the nimzo-larsen.",
        "8... Nd5": "This move serves to block in the d-pawn even more. Of course the knight is also looking at a nice seat on b4. Right now, black's light-squared bishop is blocked in, so white's bishop is that much more dominant. This means that white's light-squared bishop is a good target!",
        "9. Bxh7+": "Wow! So much more attacking that bad boy. In this position, I was mainly looking at the variation Kh8 which wreaks havoc on black's position. For some reason, I thought that it was also really bad to take the bishop. One of those lapses of tactical vision. ",
        "9... Kxh7 10. Qh5+": "However, now I can win back the material. I think this was a good choice of moves though. Black's knight could really become a nuisance on b4 and now I've gained an extra pawn and loosened up the black King's position. ",
        "10... Kg8 11. Qxd5 Qe7": "Lining up with the bishop. The only thing obvious for black now is using his bishop on the a3-d6 diagonal. But then black needs to chase away the white Queen if he wants free up his light-squared bishop. ",
        "12. h4": "I didn't want to castle kingside. I wanted an attack on the black King since his position is softened. And it looked like black was aiming at my kingside. Maybe I should have developed my queen's-knight and castled queenside first, but I wasn't sure how I wanted to develop my knight. ",
        "12... c6": "starting the kicking out of the Queen. ",
        "13. Qg5": "I was happy to trade queens becuase I believed that I could mount an attack on the black kingside (by developing the knight and castling queenside) before black could get his remaining army setup to defend. However, I forgot about the move...",
        "13... f6": "which chases my Queen again. It also defends against the immediate threat, possibly shuts the theme bishop down, and alows the black King a possible escape square.",
        "14. Qf5 c5": "I'm not sure of black's intention, but I do know that I can simply retreat and now there are some more holes in black's position. ",
        "15. Bb2 Bc7": "preparing to advance the pawn with attack. ",
        "16. Nd2": "I finally developed that knight. Now I can castle. ",
        "16... d6": "Chasing the white Queen yet again. She must be really attractive :D. I want to station my Queen on d3, but I have some other ideas first. ",
        "17. Qd5+": "I thought I could manage to squeeze just a little more damage from the black position. There is nothing big; I just thought that I would rather the black Queen be attack my pawn chain than the bishop (who would want to give a queen for a pawn?), so this longer route may accomplish something small. Of course, black can block with the bishop and lose his queenside pawn majority. I was also ok with The black King moving onto the some file as my rook. Also I was fine if the rook blocked the check because it seems to disharmonize the black pieces a little and blocks f7 as an escape square for the black King. Then I would just move on to d3 and if black wanted the small little positional things back, then he could move back to the original position and I would have in effect gotten to move twice in a row. I wanted to poke his position a little. I forgot though, that if his queen blocked the check, she could move out by Qf5 and not lose a tempo and then I might want to just trade queens when black blocks the check. This would of course put his bishop in a more active position and would have linked his rooks. It may have been safer to just move straight to d3. ",
        "17... Be6": "My gamble worked out ok this time though. Black fell for the small trap...",
        "18. Qxb7": "and lost his queenside pawn majority. ",
        "18... Qf7": "There is a lot or queen manuevering in this game. This actually surprised me a little. I wasn't expecting a counter attack so quick. Black threatens c4, and if I'm not careful, I can lose my theme bishop. Not to worry though...",
        "19. Qe4": "because the Queen is quite a capable girl, and black's threats are at least temporarily thwarted. I have gotten her back into the middle of things where she seems to love it. She doesn't have to worry about evil rooks breathing revenge down the b-file either. ",
        "19... Bd5": "A good move I must say. My poor Queen could get in trouble real fast, and she's the only one who can protect the sensetive g2 pawn right now (If I'm to save my Queen that is).",
        "20. Qg4 Be6": "Black is really going after that Queen. That black bishop either has a crush or a hatred! Things are starting to get a little heated for her now. She better watch out. ",
        "21. Qe2": "She had enough and decided that she'd just had enough of that bishop and needed some comfort from her King. ",
        "21... Qg6": "Now black is getting hungry. The Queen is looking at both the d2 and g2 pawn! Black is starting to strike back. ",
        "22. g3": "what else could the poor, sensetive pawn do? He needed the support of his friends. And besides, the pawn on c2 is a lot hardier, so if he is taken, then white's position won't be as badly damaged. ",
        "22... Bd5": "Ooooo. The bishop really is just mad isn't he? He just wants to take something. ",
        "23. O-O-O": "I decided to reward the hardy pawn on c2 and felt that since I was already 2 pawns ahead and the light-squared bishop was black's most active piece (next to the queen), why not trade? ",
        "23... Bxh1 24. Rxh1 Ba5": "Trying to charge the dark-squared bishop with some energy. ",
        "25. h5": "I want to start putting pressure on Black's kingside. My pieces are pretty well lined up for an attack, and my pawns are ready to roll. ",
        "25... Qh6 26. f4": "Right now I really need to build up a strong pawn formation on the kingside. I want to shut out the black Queen. Now that I only have one rook, I really need to be invading with pawns. I don't want to have an open board where the enemy rooks will be powerful. The two black pawns in the center are possible targets, but I must be careful before black may use them as a springboard for his own attack. ",
        "26... d5": "Black is trying to apply his own pressure on my King. White should be trying to lock up the center or neutralizing the pawns. Otherwise, black can really weaken  white's queenside.",
        "27. c4": "White is now contesting black's advance; he has enough material in the vicinity to do it and if he just sits back and waits, black can start to mess up white's pawn structure. ",
        "27... dxc4 28. Nxc4 Bc7": "The bishop must retreat, but he still wants a little bit of activity and decides to put a little pressure on the white queenside. White's theme bishop, however, is still sitting back next to his master like a dog waiting to be let off the leash. He hungrily is eyeing the two remaining black kingside pawns and the sensitive square h8.",
        "29. Ba3": "The master sends the dog to attack. Black will lose his last offending pawn, but may try to use this as a line of attack for a rook. ",
        "29... Rfe8": "Black puts his rook on the same file as the white Queen and eyes the tender pawn on e3. I was actually wondering when black would do this; it seemed inevitable. ",
        "30. Bxc5": "Now of course my forces are anchored around the pawns on e3 and h5, and the black rook loses his hope of a penetrating the white position on the e-file. It seems that the rook should have been placed on c8 instead where he pressures the kingside. However, later in the game, white's attack may have been much more powerful without substantial coverage of the e6 square or an escape square on for the king via c8. ",
        "30... g5": "Striking out against the hungry white pawns utilizing the fact that the e-pawn is pinned. If white retakes with the g-pawn he then has an open file to attack the black King, but his passed pawn is isolated. ",
        "31. Qf3": "Freeing up the e-pawn. I would still probably retake the g-pawn anyway as I like the idea of an open file with the enemy King sitting at the end. ",
        "31... gxf4 32. gxf4": "Now white has unquestionable control of the kingside (and probably had it since the black d-pawn was removed). ",
        "32... a5": "Trying to create opportunities for the rooks to penetrate the white King's position. ",
        "33. a4": "Sealing the King's position at least temporarily. ",
        "33... Rab8": "White's b-pawn has become vulnerable and so black attacks it. White's b-pawn will be black's target for a while. ",
        "34. Kb2": "Giving the poor left-behind pawn some support and getting the King off of that nasty c-file. ",
        "34... Qh7": "There is one tactical theme here that I forgot in this position. I somehow forgot that my b-pawn was pinned and my knight was in danger. I should have either moved my King to the side or moved Na3-b5 and blocked the black rook's attack. ",
        "35. Bd4": "Although this is a good move-it puts my theme bishop into a more active position where it is putting a lot of pressure on the black King's position-, I should have solidified my position first. ",
        "35... Qf7": "now I should have moved my King to the side and shut out the black Queen. I still didn't see, however, that my b-pawn was pinned. ",
        "36. h6": "I thought my position was solid and so started my pawn roller. ",
        "36... Qxc4": "Boom! This honestly caught me by surprise. Wow! I just lost a knight and now I'm about to be put in checkmate. Well, I could just move Qd1 to defend, but then I lose the initiative and a knight. The tension is really building! Look at my Queen and rook. They're so hungry, but the black threat must be dealt with.",
        "37. Qg4+": "Things are starting to get climactic. White has got a lot of pawn promotion ideas, but Black has got a checkmate knocking at white's door. White decides to try and sneak out the back door and flank the unwanted visitor. I knew here that I could always move my queen back to a defensive position in all the lines I was looking at, so I decided to see how accurately black could play. Black must play precisely or he loses everything, but if he plays correctly, he should be rewarded. ",
        "37... Kf7": "Black's only move. ",
        "38. Qg7+": "The white Queen is now filled with rage. For one, she's tired of all the black pieces chasing her around, but also black has threatened the life of her husband so she attacks furiously. ",
        "38... Ke6 39. Qxf6+": "Here black has two moves, Kd5 and Kd7. Kd5 loses outright due to 40. Qf7  Re6  41. Rh5  Be5 (if 41. ... Kd6, 42. Be5  Rxe5 43. fxe5  K moves anywhere 44. Qxc4 or 42. ... Kd5 43. Bxc7  with Bxb8 next and black has no more attack or 42. ... K moves anywhere on c-file and 43. Qxc7  Kd5 44. Qxc4 ), but Kd7 holds on. ",
        "39... Kd7 40. Qf5+": "Now black loses if he moves to a dark square except for d8 after which white forces a draw through a cool combination (If you want I'll post it. See if you can figure it out though). In any of these positions in which the white bishop remains on d4, I will gladly trade queens into an endgame where white has too many pawns for black to deal with and the bishop will trade on h8 (if black has good enough endgame technique) so the rook will be too tied up to help much. Also, if the rook blocks the check when the king is on c6 or d7, I would move Qc2 where the queen gets a more aggressive defending position than on d1 and the black queen should not trade and get into the same lost endgame with the white king starting a tad closer to the center. He should retreat the queen to the kingside; this will take a little time since the rook at e6 is blocking the most convenient way of getting there. In the time it takes to get the queen into a good position, white should already be able to promote his pawn or win a rook. The position explodes dynamically into the climax! What an exciting game! ",
        "40... Qe6": "Re6 may have been better. ",
        "41. Qxe6+ Rxe6 42. h7": "I believe it may have been better for black to take with his King. This is fine with me however. The climax has exploded and now things slow down to the ending of an exciting game. The marching advance of the pawn signifies the inevitable approach of doom for the black King. All the plans and tactics in the game have culminated in this position. White has a theme bishop that has played perhaps the most important role aside from the queen in the whole game. It has really seamed to hold the position together. (Of course that rook on h1 is a faithful soldier too happy with whatever his majesty commands, even staying on the same square the whole game!). ",
        "42... Ree8 43. h8=Q Rexh8 44. Rxh8": "The rook finally releases all that pent up energy.",
        "44... Rxh8": "Though black should not have traded rooks, the result would be the same, (though it would have taken more time and effort).",
        "45. Bxh8": "Now the Nimzo-Larsen bishop triumphantly eats the last rook on the board and becomes the master of the position. ",
        "45... Ke6 46. Kc3 Kd5 47. Bd4": "The bishop is getting ready to deal with the last resistance from the black camp or to see the pawns through. ",
        "47... Ke4 48. Kc4 Bd6": "Black tries unsuccesfully to establish a final stand at b4. ",
        "49. Bc5": "The faithful bishop seeks to deal with black's last piece and so reduce the black position to ashes. ",
        "49... Bc7": "The black bishop runs from his adversary.",
        "50. Kb5": "Now the dog and his master are side by side ready to deal with the last bit of black's resistance.",
        "50... Bd8": "The black bishop retreats once again. ",
        "51. Bb6": "Here it is, the Nimzo-Larsen bishop boldly takes a victorious stand. ",
        "51... Bxb6": "The black bishop tiredly gives up and accepts his fate. ",
        "52. Kxb6": "The Nimzo-Larsen bishop has fulfilled his destiny and reduced the black opposition to ashes. Now the widowed white King has fallen in love again with another woman. He seeks to marry her and together defeat the black King as one. ",
        "52... Kxe3 53. f5": "The bride is coming. ",
        "53... Ke4 54. f6": "It is inevitable."
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=6577",
    "gameName": "Let's play chess",
    "players": "doctor_knight (1283) vs. greycat57 (1315)",
    "opening": "Nimzovich-Larsen attack (A01), modern variation"
}