{
    "moves": {
        "1. e4 c5 2. c3 g6 3. d4 cxd4 4. cxd4": " By attacking when I wanted him to, he allowed me to put my pawns in optimal place. The experts say this is a good spot to be in, with 2 central pawns guarding c5 through f5.",
        "4... Bg7 5. e5": "Bishop threatens so I push forward. They say pawns increase in value as they push further across the board. I am inclined to agree...especially once they reach the other side.\n.............................................................................\ncapanson1973:\nBlack is fine.. the e5 pawnpush is premature. Nf3 (for instance) is better. \n.............................................................................\nYou're probably right, as the opening seemed to backfire early on. I'll give Nf3 a try next time I think.",
        "5... Nc6 6. Nf3 d6 7. d5": "There was no right move here my two pawns are screwed, but this move was particularly bad, giving me the minus one disadvantage right off the bat.",
        "7... Nxe5 8. Ng5 h6 9. Ne4 Nf6 10. Nxf6+": "my knight is being chased all over the board I figured might as well cut my losses...I think.",
        "10... Bxf6 11. Bb5+ Bd7 12. Nc3 a6 13. Bd3 Nxd3+ 14. Qxd3 Bf5 15. Qe2 Qa5 16. Bd2 Rc8 17. Ne4": "It seemed like everything was going wrong right up to this point. This last move was a trap. He goes for my pawn Qd5. it looks like he's safe, but I go knight to f6 and I got his queen and king in a fork. What happens next? It looks like he can take my knight with the pawn to f6, but that would put him in check. God knows why he resigned  before even walking into the trap. :(\n\nWould've been brilliant. I guess he saw the trap coming, but couldn't take being behind by 2 points and losing his castle. (Even if he didn't walk into the trap I could still snatch the bishop.) What a blitch!\n\nCowardice wins wars on opposite days only! And  today was no opposite day!\n.............................................................................\ncapanson1973:\nNo actually I just missed it.. 16...Rc8? was a blunder. Instead 16.. Qb4 and black is fine. Good game though. Congrats\n.............................................................................\nThat's true, but to see this trap coming a move in advance you'd have to be some kind of chess genius, and some kind of chess genius...you are not. I still think you should have finished the game. If you went Qb6, d7 or e8. You'd have only lost a bishop and your ability to castle. Nothing unrecoverable. Plus you were already up a pawn! That's just a 2 point flesh wound! What happened?"
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=21709",
    "gameName": "Let's play chess",
    "players": "hercules_isadore (1200) vs. capanson1973 (1183)",
    "opening": "Sicilian (B22), Alapin's variation (2.c3)"
}