{
    "moves": {
        "1. e3": "?! Having said that, James started off with an unconventional opening.  Better was something like 1.e4, 1.d4, or even 1.Nf3 which are considered sounder openings.  Normally, I wouldn't criticize out of book openings, now a days.  But, when I posted in Joann's thread about when and where to castle in the Knights of Honor Chess Club, I posted that I kept switching openings.  Of course, I didn't stop doing that, until GM Susan Polgar said that it wasn't a great idea in her lecture about the London System.  During that time, however, I posted that as white, I've experiemented with 1.e3 since after 1.e4, black sometimes, plays 1...e6  Of course, I didn't know that it was the French Defense, at the time.  So, I was thinking of that setup in reverse, which will happen when Erika plays 1...e5  But, shamash said that it wasn't a good idea and told me that white should play as white, and black should play as black.  Thus, white should not play as black which is my criticism here since white's probably thinking about the French Defense, in reverse.",
        "1... e5": "Having said that, this is also what I would've done.  But, I would've done it to try and figure out how to punish white for his last move.  For example, I'd be thinking about 2...Nf6 with the idea of 3...d5, and then, 4...Ng4 since black's now threatening to swarm in.  But, what black's about to play could, easily, transpose into such, since Erika plays 2...d5 here.",
        "2. d3": "?! Like before, I don't like this move since both of Jame's Bishops are hemmed in, have a limited amount of mobility which Erika can take advantage of.  An example, is what I noted above, being Erika's next move.  In fact, Stockfish agrees with this and says that this an inaccuracy.  According to them, best was 2.d4 with 0.53 advantage for white after 2... exd4 3. exd4 Nf6 4. Nf3 d5 5. Be3 Bd6 6. Bd3 O-O 7. O-O Be6 8. Nbd2 Nbd7 9. Ng5 c5 10. Nxe6 fxe6 11. c3 e5 12. dxe5 Nxe5 13. Bc2 Nc6  But, with this move black will have 0.09 advantage for Erika, after her next move.",
        "2... d5 3. Be2": "At least, this develops.  The main thing is that if black plays 3...Nf6, white doesn't have to worry about 4...Ng4 now.",
        "3... Be7": "But, I think that Erika still has the better of it.  Despite material being even, I'd say that black has a small advantage.",
        "4. a3": "?! If Erika had played 3...Nc6, this would be a very good choice to prevent 4...Nb4  But, this doesn't accomplish anything now, nor does it help white with his development.  Much better was 4.Nf3, preparing to castle, at once.",
        "4... a6": "?! Similarly, I don't like this move for the same reason.  And, I would've played 4...Nf6 in preparation to castle.  In fact, neither side is going to make a developing move until...",
        "5. h3 h5 6. h4 a5 7. a4 Bd7": "Now.  But, we should expect the same thing for the next move, from both sides.  I'm fairly confident that Erika is played the other moves to copy her opponent, which I have seen before.  In fact, it's been that way for a long while, but that's ill advised.  GM Susan Polgar emphasized that one should not just copy his opponent because, at some point, you'll be forced to stop doing so, when you're opponent places you in check.  After which, you can be lost.  The example that Susan gave in, \"Polgar Chess University\" was a game between a Master who wrote an article and his viewers.",
        "8. c3 c5 9. Nf3": "This is where James continues with his development.",
        "9... Nf6": "As does Erika, but it's not for the right reason.  This should be played to bring you one step closer to castling.  But, black did this to copy her opponent which is not the way to go.  And, that will show in the next several moves.",
        "10. b3 b5 11. Qc2 Qc7 12. Qd2 Qd6 13. Qd1 Ng4": "But, Erika is, finally, thinking outside of the box and not just copying her opponent.  As noted earlier, black now has threats against white.  It's not nearly as effective now as it would've been earlier, but there still around.  For example, Erika can't take on f2 now, but that N can still become quite dangerous later on in a way that you wouldn't think.  I know offhand, because a similar position occurred with Coach Stockel where he did something with his N.  Similarly, he couldn't take on f2, right away, so I thought that he couldn't get anywhere with the N.  Sure, enough I was wrong, and he won in a similar to how bhidragon won in our rated game.  As then, he brought other pieces, into the mix, and overpowered my K.  So, this is something that James needs to be aware of, later on.",
        "14. Ng1": "?! Having said that, I would've castled right away.  The only thing this move does is undevelop the N.",
        "14... bxa4 15. bxa4 Nc6": "And, Erika tries to take advantage of that since her development is almost complete.  But, I would've castled, right away here since James is going to attack.  I mean, it would still happen, but at least, Erika would've gotten her K to safety.",
        "16. f3 Nxe3": "?? I know why Erika played this since it won a pawn here.  But, this was a terrible that should've costed her the game.  How should've James proceeded, Erika?",
        "17. Qd2": "With 17.Bxe3 winning a piece for a pawn.  It's easy to overlook, but when you play a move, even capturing a pawn, one should ask him or herself what the opponent has and what he or she could do in response to your move.  Or, as Susan Polgar put it, \"What does my opponent want?\"  As now, Erika has a great move that will win another pawn and take away Jame's right to castle.",
        "17... Nxg2+ 18. Kf1 Ne3+": "?? I know why Erika played since checks look good.  But, as bhidragon once emphasized to me, what looks good can be quite blunderous.  And, as it turns out, this was an example.  What should James have done, Erika.",
        "19. Ke1": "?? He should've captured right away with 19.Qxe3 winning a piece in return, and leaving you down the equivalent to a pawn.  But, missing this opportunity will allow Erika to win, yet, another pawn.",
        "19... Ng2+ 20. Kf1 Nxh4 21. Qe1": "Trying to get counterplay by going on the aggressive approach.  After I was coached by ION during a training game, he told me that when you're down like this, this was best.  He did this by telling that the idea is to then, \"Play the man, not the board\".  As it turns out, that was also the right choice here since Erika will make another blunder that James will use to his advantage.",
        "21... Rb8": "My guess is that Erika played this to put pressure on his Nb1.  But, if that's so, then I consider it to be pointless because it's, of course, protected.  I would've castled short, here.",
        "22. Qd1": "I also don't see the point behind this move since James is far behind in development.  As white, I would've continued with either 22.Nd2.",
        "22... e4": "Erika wants to exchange pawns and for good reason, is this will also break up Jame's center.",
        "23. fxe4 dxe4 24. c4": "I think that James made the correct decision and was his best.  As exchanging would've compromised his position since Erika would've liquidated Q's while ahead.",
        "24... Nb4": "I would've still castled here, but give this as better since Erika's now threatening to win a pawn.",
        "25. Nc3": "? James develops another piece, at last.  But, this should've been done earlier, as now was not the time since Erika is about to win another pawn and liquidate N for B.  25.Ra3 was critical to protect d3.",
        "25... exd3 26. Bf3 Nxf3 27. Qxf3 Nc2 28. Ra2 Ne3+": "?? Erika thought that the N was attacked and felt the need to protect.  But, paradoxically, it was protected where it was with the d3 pawn.  With this move, James will win back a piece here.  So, this was a turning point in the game where Erika goes from a big advantage to a near even game.  ",
        "29. Qxe3 Qf6+": "Of course, I'm not surprised to see Erika place her opponent in check, but it's not for the right reason.  As she does it because it's possible.  But, there's something about this move that makes it very good, and black overlooks the reason.  What should black do, Erika?",
        "30. Nf3 Bg4": "30...Qxc3 getting a piece back and remaining a piece+pawn up.",
        "31. Rf2": "Preparing a masked battery with a discovered attack on the Q which is about to ensue.",
        "31... Rb3": "And, Erika is prepared for that.",
        "32. Nh2 Rxc3": "?? It's understandable that Erika wanted a piece, but this is a terrible blunder that should cost her the game.  What should James do here, Erika? ",
        "33. Qe4": "He should've captured, right away with 33.Rxf6 winning the Q for R, in return.  This move allows Erika to win another piece.",
        "33... Rxc1+ 34. Kg2 Bf5": "?? It's understandable that Erika wanted tempo, but this is where she starts to go wrong, for real.  As now, James will win back a B.  Retreating with 34...Be2 was essential since the Bishop is protected by d3, Erika.",
        "35. Rxf5 Rc2+": "Protecting d3 in her favorite matter, since Erika enjoys placing her opponents in check.  But, retreating the Q was called for, and that should be followed by liquidating with 36...Rxh1 since she's ahead, and after white takes back, pushing the passed pawn with 37...d2 is winning.  In fact, even giving up the Q with 35...Rxh1 36.Rxf6 will do after 36...d2 since a promotion would be inevitable.",
        "36. Kh3 Qxf5+": "?? But, this turns the game around.  First, James fully compensates for lost material, and without the Q for black, Erika will have to play at her best to have any chance of a draw.  So, there'll be no room for error, from here on out.",
        "37. Qxf5 g6": "?? Understandable, but this should give white an instant win.",
        "38. Qc8+": "Having said that timing was the issue here, as best was 38.Re8.  And, with the B pinned, 39.Qc8# would be mate, at once.  However, the text is still good enough, especially since James is about to remain a piece and pawn up.",
        "38... Bd8 39. Re1+ Kf8 40. Qxd8+ Kg7 41. Qxd3 Ra2 42. Rg1": "?? Going for a K side attack, but much better was 42.Qc3+, and after Erika gets out of check, 43.Qxa5 (winning another pawn) followed by 44.Re7 and 45.Qd7 are overwhelming for black.  With this move, Erika will win back a pawn.  With this move, black has a really good that I overlooked which would've pinned and won the Q.",
        "42... Rxa4": "I can see why she played that, but having what I said above, best was 42.Ra3!! at once.",
        "43. Nf3": "Preparing for an all out attack since the N will also be overwhelming, and preventing a pin that black was threatening earlier.  It's an example of where too much pressure against the K with several pieces is too much for one to handle.",
        "43... Rb4": "I'm not exactly sure why Erika played this, and I thought I did.",
        "44. Ne5": "?? Going for a mate, but this is a blunder which should allow Erika to pull a swindle and win the game.  How should black proceed, Erika?",
        "44... f6": "?? Erika doesn't like the N there, but the answer was with 44...Rb3, pinning and winning back the Q for R.  Afterwhich, black would have a win with best play due to two of her passed pawns.  But, with this move, it's officially, curtains for Erika since James can and will mate, starting with his next move.",
        "45. Qxg6+ Kf8 46. Qf7#": ""
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=66339",
    "gameName": "Let's play chess",
    "players": "jamesmulligan (825) vs. goldmedal10 (665)",
    "opening": "Amsterdam attack (A00)"
}