{
    "moves": {
        "1. c4": "I am studying this opening, the English!\n",
        "1... c5": "My opponent chose the symmetric English. The other main option is 1      ... e5. My favourite, when I play with black pieces, is 1... Nf6 and I     try to enter in the KID.\n",
        "2. Nc3": "2 Nf3 or 2 Nc3, question of tastes\n",
        "2... Nf6": "The same for black. Another ideas are 2 ... g6 2 ... e6 2 ... d6 and      2 ... Nc6. The variety show the flexibility of the English Opening.\n",
        "3. Nf3": "I want, everytime, the four knight variation of symmetric English.      Another main options are 3 e3 and 3 g3, all are playable.\n",
        "3... d5": "Ohh. Counterintituive, Black opens the center but White leads the      development. I know, this move is theory, nevertheless\n",
        "4. cxd5": "The natural election. Exchanges a flank pawn for a central pawn. The      black knight moves twice\n",
        "4... Nxd5 5. e4": "This move leads to unbalanced opening. The first time when I see this     variation, I think chess in insane! See the next move and forgive me,      please!\n",
        "5... Nb4": "Three moves with the knight... But Blacks attack inmediately the      d3-hole. Alternative is 5 ... Nxc3 6 dxc3 Qxd1+ 7 Kxd1. This endgame      was study in a book of Mednis. Of course, 6 bxc3 is fine, too.\n",
        "6. Bc4": "6 d4 (natural move) doesn't work cxd4 7 Nxd4 Qxd4! 8 Qxd4 Nc2+ and      black is winning. This move leads to a messy position. The      'correspondence' chess is ideal for this kind of position, I think.\n",
        "6... Nd3+": "Ohh.. White loss the castle or the bishop.\n",
        "7. Ke2": "I guess, this move was idea by Nimzowich\n",
        "7... Nf4+": "Four moves with the knight\n",
        "8. Kf1": "The king is in a safe place.\n",
        "8... Ne6": "5 moves with the knight and it's place in a non-convecional square.      White leads in development by the loss castle. The only way to take      advantage of that is attacking! Black can't play 8 ... Nc6 9 d4!\n",
        "9. b4": "This move is theory. I find in the database a game of Candidates      Match between Polugaiesvky vs Korchnoi. If I find a move like this,      I'll be smiling for months! Now, White dominate the center and the      development. Nevertheless, the d4-square is weak.\n",
        "9... cxb4 10. Nd5 g6": "Black has an alternative move in 10 ... Nc6. Interestingly, that move     has not been used frequently. I don't know why\n",
        "11. d4": "The evaluation of the position is very hard. White has the      center-pawn, but d pawn is weak. The game runs on the development of      the attack on the kingside and the counterplay on the pawn d4 \n",
        "11... Bg7 12. Be3 Nc6 13. Rc1": "This position is was played in the game Aronian-Topalov, London 2015,     as said. Topalov played 13 ... Bd7. My rival takes another way and I      must \"think\" with my own head. This thinking is to follow the Aronian      idea of push the h-pawn and play Qd2, making a tandam Be3-Qd2 against      the dsb.\n",
        "13... O-O": "A new move. So natural, but I amn t sure if this move is better than      Bd7. The king will be harassed by the maneuver cited in the previous      commentary. A fast development is necessary.\n",
        "14. h4 h5": "Black stops the white expansion in the kingside.\n",
        "15. Qd2": "I follow the Aronian strategy.\n",
        "15... Nexd4 16. Nxd4 Nxd4 17. Bxd4 Bxd4 18. Qxd4": "Now, if 18 ... e6 19 Nf6+ and, 20 Qxd8. White enters in an endgame      with piece up\n",
        "18... Bg4": "Now, with one piece up, I must find how to override my opponent's      counterplay possibilities. Looking at the position, we see that the      tower on the side of the king is inactive, so I must open the way.      Since  h3 is controlled, the ideal move is f3, which limits the      possibilities of lsb. But, on the other hand, leave all the dark      squares near my king. However, their dark squares are too. Conclusion:     I must keep my queen in dark squares and prevent her queen from      activating. The only squere where you can activate are a5 and d6. I      think the Qe5-Qg5 maneuver is suggested alone, after all this      reasoning, because it attacks the e7 square twice, the pawn can not      advance and, eventually, if Qa5 Nf6 +Now, with piece up, I must.      Clearly, if Qd6 Qxd6\n",
        "19. Qe5 Re8 20. Qg5 Rc8 21. f3": "Follows the idea. Stockfish suggest Kg1-Kh2 maneuver. \n",
        "21... Rxc4": "I don't understand this move\n",
        "22. Rxc4 Bc8 23. Kf2": "And my opponent resigns\n"
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess-http-gameknot-com?gm=66085",
    "gameName": "Let's play chess, http://gameknot.com/",
    "players": "sogtulakk (1840) vs. cegm (1792)",
    "opening": "English (A34), symmetrical, three knights system"
}