{
    "moves": {
        "1. e4 c5 2. e5": "An interesting and rather bold off-book variation. This pawn remains a thorn in black's side for the remainder of the game.",
        "2... Nc6 3. f4 e6 4. Nf3 d6 5. Bb5 Bd7 6. Bxc6": "Computer eval suggests this is a mistake, and white would have been better off just continuing development, where he's ahead.",
        "6... Bxc6": "Black obtains an excellent position for his LSB - a long diagonal, protected by a pawn, with no opposition in sight.",
        "7. d4": "Another mistake, according to the computer. White is being too aggressive here, and needs to be focused on finishing development. At the same time, his central pawn position is strong enough to make this aggression worth it.",
        "7... cxd4 8. O-O Qb6": "Not to protect the pawn so much as activate the queen and pin down the white knight if it recaptures.",
        "9. Nxd4": "Computer analysis actually prefers the queen capture here as a way of pulling more of white's pieces into play. Computer analysis also suggests black has a significant advantage here.",
        "9... dxe5 10. fxe5 Bc5 11. c3 O-O-O": "In hindsight, this should have been Rd8, because this allows the c6 bishop to be pinned at a crucial moment. Computer eval shows black with significant advantage at this point.",
        "12. Kh1 Bxd4 13. cxd4 Rxd4 14. Qc2": "And black's strong bishop is now pinned. Black now has a major problem with his position, namely Rxf7, which is even more critical than the threatened Bd3.",
        "14... Nh6": "? Qa6 (threatening Qxf1#) is better.",
        "15. Be3 Nf5": "Black could have done much better here with either Qb5 or Qa6 (threatening Qxf1#) followed by saving the rook.",
        "16. Bxd4 Qxd4": "However, black got good compensation for his rook: A bishop, strong queen positioning, and a developed knight. White's a1 rook, on the other hand, remains uninvolved.",
        "17. Qc3": "Another mistake, according to computer analysis. The computer suggests activating the rooks with Rf2, and then developing white's extra knight and rook.",
        "17... Qxc3": "?? Potentially better would have been Qd5, threatening Qxg2. Computer suggests Qg4 (threatening Qxg2#) followed by Rd8, Rd2, and Rxg2.",
        "18. Nxc3 Rd8 19. a4": "Computer doesn't like this move either, because it misses the opportunity to trade off rooks and gain control of the open d file.",
        "19... Rd2": "A crucial step in black regaining his lost material.",
        "20. Rfg1": "Otherwise, 21. Rxg2 followed by 22. Rxb2+ Kg1 23. Rg2+ Kh1 24. Rc2+ wins the white knight.",
        "20... Rxb2": "Computer suggests black would have done better with Ne3 (threatening the all-important g2).",
        "21. Rac1": "White once again lets white off easily: Nb5 relieves the pressure on g2, and could cost black his kingside pawns.",
        "21... Ne3": "Computer suggests Kb8 first, followed by pressing the attack with Nh4.",
        "22. Nb5": "Black could have forced a knight trade with Nd1.",
        "22... Kb8": "Needed to prevent 23. Nxb7+ Kmoves 24. Nxc6",
        "23. Nd6 Nxg2": "Mistake, according to the computer. Better here was Ng4, forking the threat of mate with Nf2 and the critical e5 pawn.",
        "24. Rxc6": "The least damaging way to liquidate his pieces.",
        "24... bxc6 25. Rxg2 Rb1+": "Not Rxg2, which puts the white king slightly closer to the main position.",
        "26. Rg1 Rxg1+ 27. Kxg1 f5": "Forced, or the f pawn is lost.",
        "28. h4": "White lets black off easy here: Ne8 prevents the black king from coming over to do anything useful.",
        "28... Kc7": "? c5 is better here. Black's game should be lost.",
        "29. Kf2": "? White is still too nice. 29. Ne8+ Kd7 30. Nxg7 leaves black in bad shape.",
        "29... Kd7": "Protects against Ne8, but allows white to bring his king over and prevent the c-pawn from making a run for it.",
        "30. Ke3 c5": "Moved out of the way to allow the black king to penetrate and hopefully win his way into white's position.",
        "31. a5 a6 32. Kd3 Kc6 33. Kc4 g6 34. Nf7 f4": "The game is drawn, because white must stop the f pawn from promoting. That requires either the white king to give way (allowing black's king to take the a5 pawn and promote his a pawn), or the knight to stay rooted on the kingside where he can't help his king make a breakthrough. For instance, 35. Ng5 h6 36. Nf3 and now black holds the line with ... Kd7 37. Kxc5 Kc7. If white tries to force the issue with his knight, that allows g5, which creates a companion passed pawn to the f4 pawn. If he tries to force the issue with his king, then black allows him to take the a pawn, but traps his own king in the a8 corner and forces white's knight to take his pawns, causing stalemate.\n\nAt the same time, it should be noted that computer eval shows considerable advantage to white. Black may have swindled white out of a win."
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=33826",
    "gameName": "Let's play chess",
    "players": "musashi31 (1528) vs. thexalon (1517)",
    "opening": "Sicilian defence (B20)"
}