{
    "moves": {
        "1. e4": "This was a normal open challenge. I was a little suprised to see someone higher ranked accept. Perhaps he had noticed that I was only recently in the ranks of the 1600 . Ironically my rating was below 1600 at the end and my opponents was over 1700",
        "1... e5 2. Nf3 Nc6 3. d4 exd4 4. Nxd4 Nf6 5. Nc3 Bb4": "Pins the knight meaning the e pawn is undefended and gives me the option to castle",
        "6. Nxc6 bxc6": "I'm not too scared of the doubled pawns just yet, this also opens a small line for my lsb which could prove useful",
        "7. Bd3 O-O 8. O-O d5": "Gives my lsb even more scope and opens the possibility of undoubling my pawns",
        "9. exd5 Bxc3": "and in fact doubling my opponents. At the end of the game the queens side pawn structure becomes very significant",
        "10. bxc3 cxd5 11. Bg5 Qd6": "Although still in the Gameknot database! I think this move is a mistake. The most popular Gameknot move is h6 which I don't like, though it is forced later. I find c5 tempting here",
        "12. Bxf6 Qxf6": "Takes full advantage of my last move which now means I have lost a tempo",
        "13. Qh5": "Threatening Qxh7#",
        "13... h6": "Now we finally move out of the Gameknot database (which suggests g6). I may have made things harder for myself than they should be with this move as it opens the white squares around my king while white still has his lsb",
        "14. Qxd5": "grabbing material and threatening my rook",
        "14... Be6": "Still broadly following the main line of the opening. This move finally completes my development and links my rooks. White has a material advantage but double pawns. To me the game looks pretty even here. My queen is eying up the c3 pawn too which would equalise in material though I doubt white will allow that",
        "15. Qd4 Qg5": "Looking at Bh3. I was reluctant to exchange as it would undouble whites pawns against my isolated c pawn",
        "16. f4 Qd5": "Really this represent a change of heart but I am not sure where better I could have put it either",
        "17. Be4": "white forces the exchange which as I said is to his advantage",
        "17... Qxd4+ 18. cxd4 Rab8": "grabbing the open file by my isolated and very sorry looking pawns, would Rad8 be a better move?",
        "19. d5 Bd7 20. Rab1": "I think white is trying to take advantage of his material advantage and exchanging where he can, particularly with his well advanced d pawn",
        "20... f5": "Applying pressure of my own, there is no need for me to take his rook, if he wants mine he will have to take it",
        "21. Bd3": "At least now his d pawn is (temporarily) undefended",
        "21... g6": "This is probably a poor move as the f pawn is already well protected",
        "22. c4": "I'm unsure about this move. I would be tempted with Bc4 instead threatening discovered check with d6 which could become nasty for me. As it is the white lsb is now quite restricted",
        "22... c5 23. Rxb8 Rxb8 24. Rb1 Rxb1+": "I decided to go for the exchange as I felt the position wasn't too uneven despite whites material advantage as I could block his now passed pawn on d",
        "25. Bxb1 a5": "Here I was wanting whites a pawn to stay on a white square while I still had my lsb as it gave me a chance for promotion",
        "26. Kf2 Kf7 27. Kf3 g5": "Trying to restrict whites king from getting too far forward,  I (briefly) have a barrier most of the way across the board. If only I hadn't moved 21:... g6 ",
        "28. g3 Kf6": "Supoprting the pawns. Also thinking about g4 but I need my a pawn on h5 to do that or my pawns could become seperated",
        "29. h3 Ba4": "Now that my f pawn is defended by my king I can try to get behind his pawns and do some damage. My feeling is that this is where the game started to turn",
        "30. g4 Bd1+ 31. Kg3": "This is gives me a chance to undermine his passed pawn",
        "31... fxg4": "First I need to do this or I lose more material and probably the game. Unfortunately this opens more space for the white lsb too which makes it harder for my king to defend my pawns",
        "32. hxg4": "I need to do something about the d and c pawns as elsewhere we are pretty much even though I think my bishop is now better placed particularly as my king can hopefully prevent promotion",
        "32... Be2 33. Bc2 Bxc4": "Finally material equality, though not for long and I now have a passed pawn too",
        "34. Bb3 gxf4+": "This was probably a mistake as it seems unneccessary. Bb5 seems better threatening to advance the now passed c pawn but I didn't see that move at the time",
        "35. Kxf4": "It's now too easy for him to bring his king in to defend his d pawn, however I now have a plan for promotion",
        "35... Bxb3 36. axb3": "Now he can't stop me promoting, the question is - can I stop him?",
        "36... c4": "sacrifices the pawn to enable me to promote the a pawn that his king can't reach in time",
        "37. bxc4": "Unfortunately he gets connected pawns in the process, though will they be enough? We will see. I figured that if he pushed one pawn my king could get to it in time, if he didn't then I had enough time to promote",
        "37... a4": "here goes",
        "38. c5 a3": "Piling on the pressure",
        "39. c6 Ke7": "I need to get my king i the way of those pawns, his king is too far away to defend them both",
        "40. Ke5": "Pretty much forced",
        "40... a2": "and now I am almost there, if his king doesn't move promotion will give me check which could be helpful too",
        "41. d6+ Kd8": "Pretty much forced, anything else would likely mean he would promote, now he doesnt' have time to",
        "42. Ke6": "Trapping my king on the back row- but I was prepared for this I had some conditional moves setup",
        "42... a1=Q 43. c7+ Kc8": "Forced.\r\n\r\nHe's going to run out of options to check me soon that will let me bring my queen in",
        "44. Kf7": "I'm not entirely sure of the point of this move, is he going for a draw?",
        "44... Qe5": "His pawns can't be saved now and white resigned.\r\n\r\nFor me this was a tough, exciting battle that could have swung either way. With hindsight I am still not sure when the game turned in my favour. \r\n\r\nThanks for reading, I look forward to your contructive feedback"
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=21272",
    "gameName": "Let's play chess",
    "players": "virgilhilts (1669) vs. elwoos (1609)",
    "opening": "Scotch (C45), Schmidt variation"
}