{
    "moves": {
        "1. e4 e6": "French defense",
        "2. Nc3": "Not a common move- we'll see why at the end.",
        "2... d5": "I proceeded with the typical 2.d5 for black",
        "3. exd5 exd5": "White, perhaps uncomfortable with the positions the French provides, opts for the clearer and more open Exchange Variation.",
        "4. d4 Bb4": "This isn't exactly a book move for the Exchange Variation. But because the knight is here I'm developing my bishop a la Winawer. If he didn't block the pin, I probably would have exchanged the bishop for knight to double his pawns",
        "5. Bd2 Nf6": "Developing classically",
        "6. Qe2+": "Brings the queen out early for a check. A useless move however. I get to develop a piece for free.",
        "6... Be6": "Blocked behind the pawn but at least it's out.",
        "7. Qb5+": "Tries to win the bishop?",
        "7... Nc6": "...useless check again. The knight threatens d4 once the queen moves away. White can't immediately move the d2 bishop to support the pawn, because I would capture the knight and double his pawns on the C file. However, with developing my knight, I left the b7 pawn undefended. I figured by this point I would capitalize on my advantage in development by gambitting the pawn and developing even more.",
        "8. Qxb7": "He takes the gambit pawn. I'm curious as to what his best move was but I don't have an engine on hand",
        "8... Qe7": "Developing the queen and setting up a discovery on white's King.",
        "9. Qxc6+": "Ouch. Blunder. Poisoned knight?",
        "9... Bd7+": "Discovered check captures the queen",
        "10. Be2 Bxc6 11. O-O-O": "Due to his lack of development by this point, he castles long to protect the king more quickly (especially with my queen out and his lack of one).",
        "11... O-O": "Castle to activate and connect the rooks",
        "12. a3": "White was sort of stuck here. If he developed his other knight, continues 12.Nf4? Bxc3 13. Bxc3 Qxe2. He also can't move his c3 knight anyway safely.",
        "12... Bxc3": "I don't want to lose time to retreat so I just exchange here",
        "13. Bxc3": "Bishop on C3 now blocks the C pawn and has no diagonal towards the center. Will have to move again to be useful, with the permanent pawns in the center.",
        "13... Ne4": "Bringing the knight up the board",
        "14. Nh3": "Blunder. This removes the defender of the Bishop on e2!",
        "14... Nxc3": "Now we see the detriment of White's premature development of the Knight to c3. He blocked his C pawn which is normally useful in the Exchange variation. ",
        "15. bxc3 Qxe2": "White resigns. While the Exchange variation avoids the positional play typical of most French lines, it's easy for Black to crash through if White missteps. "
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=32595",
    "gameName": "Let's play chess",
    "players": "danhi (1355) vs. cchamp (1396)",
    "opening": "French (C00), Pelikan variation"
}