{
    "moves": {
        "1. d4": "brahmslover (1200) (annotator) v roundfinger (1275) ",
        "1... d5 2. Nf3 e6 3. c4": "Main line Queen's Gambit Declined.",
        "3... Bb4+": "I don't know what this is technically classified as, but I would call it a sort of Bogo-Indian.  Black attempts to misplace my pieces with this check.  I can either play Nc3 and transpose to the Nimzo-Indian, or play Bd2, when the normal move is Be7. ",
        "4. Bd2": "I wish to play the Catalan, so the Knight does not belong on c3 in most lines.",
        "4... Bxd2+ 5. Nbxd2 c6 6. e3": "I actually changed my mind here.  I should have continued with g3.",
        "6... Nf6 7. Bd3 dxc4": "Winning the tempo for Black, though it doesn't really matter in this position.",
        "8. Nxc4": "Eying the e5 for my knights.  Always looking for good outposts for my knights.",
        "8... O-O 9. O-O g6": "? A weak move which simply creates dark square weaknesses.  I assume that Black was scared of my d3 bishop, but that is no way to approach chess.  Prophylaxis is good, but this way too much.  I always strive to play active moves and reach for the initiative rather than react to my opponents moves. ",
        "10. Rc1": "Developing the rook to the semi-open file.",
        "10... b5": "?? Another weak move that creates a weakness.  Normally in these positions, White must use the \"minority attack\" a4,b4-b5, to attack the c6 pawn and make a weakness.  Black just saved me several tempi and accomplished my goal for me!",
        "11. Nce5": "Attacking the weakness, because it is fixed.",
        "11... a6": "a strange move, allowing me to win a pawn.",
        "12. Nxc6 Nxc6 13. Rxc6 Bb7": "So I have a material advantage, which I proceed to blunder away in 2 moves....",
        "14. Rc2 Bd5 15. Re1": "Preparing e4, but ignoring a2...",
        "15... Bxa2 16. Qe2": "Even though material equality has been re-established, White still has a winning position because of his central control.  The center is always the most important area of the board, whether you control it with your pawns (classical) or your pieces (hyper-modern) is your decision.",
        "16... Bd5": "The bishop escapes, yet at the cost of a tempo, allowing my pieces to come alive.",
        "17. e4 Bb7 18. Rec1": "Taking the important c-file.",
        "18... Bc8": "?? A terribly passive move.  allowing me control of the 7th rank.  In Nimzowitsch's My System, he claims that whoever can control the 7th rank should always win.  (Yea, yea, there is more to it than that, but that is MY simple analysis of it).",
        "19. Rc2c7 Ne8": "Look at Black's pieces, they are all on the back rank!  If I were playing Petrosian I would be very scared (lol), but anyone else this tells me that I am won!",
        "20. Rc7c3": "I am ok with leaving the 7th.  While leaving black passive.",
        "20... Nd6 21. Qc2": "Another piece on the c-file!  It seems so simple doesn't it?  Sometimes I wish chess were always this easy, then I could actually be good at it....",
        "21... f6": "Another weakness.  My coach used to say that every pawn move is like giving away a hundred dollar bill.  It is fine giving a hundred dollar bill if you are buying something very valuable.  But, if you are just throwing them away that is no good at all (unless you are Bill Gates I guess) !  So, be careful when you make pawns moves.  They can be very good, but they always create a weakness.  Pawns can never return, or guard the space left behind.  The key is to strive to take the space left behind.",
        "22. e5": "I think this may actually win by force, though I haven't checked all the lines.  Do you see what f6 left behind?\n\nThe defense of the g6 pawn!",
        "22... Nf7": "Can you guess my move?  I think Mate is forced here. ( you like how definite I am, I know all you readers will check the analysis and comment if I am right... )",
        "23. Bxg6": "The space left behind by f6.",
        "23... hxg6 24. Qxg6+": "Now it is definitely forced mate.",
        "24... Kh8 25. exf6 Rg8 26. Qh5+ Nh6 27. Qxh6#": "I hope you enjoyed the game."
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=23290",
    "gameName": "Let's play chess",
    "players": "brahmslover (1631) vs. roundfinger (1275)",
    "opening": "Queen's pawn game (D02)"
}