{
    "moves": {
        "1. d4 Nf6 2. c4 e6 3. g3 c5": "I like to strike in the center early and make the game dynamic right away, especially with black. ",
        "4. d5 exd5 5. cxd5 b5": "D6 is also a choice, but b5 is more aggressive.",
        "6. Bg2 d6 7. e4 Bb7": "At first, the light-squared bishop looks almost worthless, shooting down at two connected pawns. But later, this bishop can come in handy when applying pressure on the center. ",
        "8. Ne2 Be7 9. O-O Nbd7 10. b3": "I was a bit surprised by the double fianchetto, but it makes sense here, as white gets a nice spatial advantage through it. ",
        "10... O-O 11. Bb2 a5": "My plan is obvious: gain space on the queenside, and break open either the a or c file. ",
        "12. a4": "A good response. Now I am forced to push, or I will mess up my pawn structure. Though in retrospect, bxa and Qb6 is not too bad. ",
        "12... b4 13. Nd2 Ba6": "Seeing that my bishop won't be useful now in the center, I put it to use and direct to the queenside. ",
        "14. Nc4": "Once again, I nice response. Foiling my queenside efforts and gaining space/adding pressure. ",
        "14... Ng4": "My opponent gained space and I need to as well to compete. I relocate my knight and try to put pressure on the queenside. ",
        "15. Qd2 Nge5 16. Rac1 Re8": "It is important to apply pressure in multiple places. My plan for applying pressure on the center is coming into reality as well. ",
        "17. f4": "This move looks scary, but I had enough defense to not worry about it. It seems the tempo was in my favor. ",
        "17... Nxc4 18. bxc4 Bf6": "A key move. Trying to trade white's most dangerous piece and defending against white's threats of a center attack. ",
        "19. Bxf6": "I thought it would have been better to wait for me to take the bishop, and he would take back with the queen. This way, he still retains the diagonal. ",
        "19... Nxf6": "Now I have nice pressure on the center and the queenside. ",
        "20. Qd3": "It's an unfortunate circumstance when the queen is relegated to simply protect pawns. ",
        "20... Qe7": "Applying pressure in the center, and making the possibility to win the knight if things go my way. ",
        "21. e5": "This push leads to many complications. It seems it was premature.  ",
        "21... Rab8": "(!) Protecting the rook after the exchange dxe, and white pushes to d6, attacking my queen and rook simultaneously. ",
        "22. Nc3": "Strange response. I think better was Rce1. ",
        "22... bxc3 23. exf6 Qxf6": "The strange knight move has created this awkward position for white, where too much pressure is put on the queenside. ",
        "24. Qxc3": "It is not a good idea to trade queens now. It only leads to worse circumstances, where I can apply more pressure. Much better was rook takes. ",
        "24... Qxc3 25. Rxc3 Rb4": "Now white is in serious trouble. Not only is a pawn going to be won, but his position in general is deteriorating fast.",
        "26. Ra1 Bxc4": "If I took with my rook, I would allow Black to have some counterplay on the open files. ",
        "27. Bf1": "I don't understand this decision. When one is down a pawn, it is not wise to trade. ",
        "27... Bxf1 28. Kxf1 Ree4": "The pawn hunt continues and my grip on white's position becomes stronger. ",
        "29. Re1": "If white tried to protect the a-pawn, the d-pawn falls soon. There is not much white can do. ",
        "29... Rxe1+ 30. Kxe1 Rd4": "I thought it was more important to take down a center pawn. Plus, with Rxa4, Rb3, white can get chances to attack the d6 pawn with a series of checks against my king, and I wanted to protect my d-pawn after taking on d5. After Rb3, it is not so wise to play Rb4, and making the exchange. White's king can get to my pawns quickly--though it would still probably be in my favor. ",
        "31. Rb3 Kf8": "I didn't forget about the back rank :)",
        "32. Rb5 Rxa4 33. Kd2": "Not a good move, as it allows me to check the king and grab a pawn (though white gets one back again)-- simplifying the position further. But White does not have other options that are more appealing. Rb8+, Ke7, Rb7+, Kf6, Rb6, Rd4, Rxd6+, Ke7, Ra6, a5, and white again will eventually lose a pawn. \n\nIt was game of tempo and pressure, with white making some inaccurate choices and black capitalizing on them. "
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=58059",
    "gameName": "Let's play chess",
    "players": "bourne007 (1758) vs. klacsanzky (1735)",
    "opening": "Catalan opening (E00)"
}