{
    "moves": {
        "1. e4 e5 2. Bc4 Nh6 3. Qf3": "Ah, going for the old four move checkmate.  Of course, that knight at h6 is already a problem.",
        "3... f6 4. Qd3 Bb4 5. c3 Bc5 6. Ne2 Nc6 7. b4 Bf8": "Mm, I would not have moved it all the way back, but would have left it on b6 or d6.  Black cannot cancel while white's bishop is checking g8, but returning Bf7 just means white gets a free move.",
        "8. Qd5 Qe7 9. Rf1": "?  I think I would have castled here.  Kg1.  Now Ph2 is undefended, and the king is in the road.",
        "9... d6 10. Ba3 Nd8 11. f4 Be6": "Nice move.  Qb5+ would be answered by c6.  White has to move the queen again in which case black picks off the white bishop for free.",
        "12. Qb5+ c6 13. Qa4 b5": "...or that.  The white bishop at c4 remains vulnerable.",
        "14. Qa6 Bc8": "Now this was questionable.  What was wrong with white's bishop?",
        "15. Qa5 bxc4": "BxB would have been better (instead of 14...bc8).  Black's pawns are doubled--not a terrible thing, but this makes them easier to pick off.",
        "16. fxe5 Nb7": "Black is intent on pushing around the white queen.  White could respond with PxPf6, threatening the black queen in turn.  Nothing is protecting the e5 pawn except the queen, and it will be lost if she moves to a4.  However, PxPf6 could be answered by QxPe4.  White would remain down a pawn, but the queen would be free to travel to the other side of the board--Qh5+.  Black would probably interpose the pawn (Pg6), answered by some other great move.  Pf7+, maybe.",
        "17. Qa4 fxe5 18. Qxc6+": "Yes.",
        "18... Qd7 19. Qxc4 Be7 20. d4 Rf8 21. Rg1": "Oh, I think I would have traded rooks.  Black could still castle on the queen's side, even though those pawns are obliterated.",
        "21... Bh4+ 22. g3 Bf6 23. b5 d5 24. Qa4": "I like Qb4 a little better.  The bishop behind the queen make for a formidable array, though black could easily block with Be7 and there is always the entertaining possibility black may overlook BxRf8.",
        "24... Kf7": "Well you look at that?  BxRf8!",
        "25. Nd2": "?  Ok, what is wrong with the black rook?  Trade a bishop for a rook ANY day of the week, and TWICE on Sundays!  That knight move would still have been there next turn.",
        "25... dxe4 26. Nxe4": "All right.  Does the black rook have warts?  Cheeky butt crack?  I'm telling you, that rook looks like corn fed venison on the hoof.  BxRf8 can't be beat.  Especially with white down a point.",
        "26... Qd5": "I'd still do it, even though it would mean the loss of the knight.  Actually, at this point NxB is pretty decent.  KxN eliminates the threat to the queen, and then the black rook is completely free.  Dressed out and hanging in a tree.  Back strap for the her majesty's boys, and venison chops for the following week.",
        "27. Qb4": ":(",
        "27... Bg4": "Black could also have simply moved the rook, but this is better.",
        "28. c4": "NxBf6 threatens the black queen, and sets up Qe7+, followed by QxPe5.  (QxNb7 is out--because Qd5 is guarding it).  Still, a bishop and a pawn for a knight, and then if black still wants to leave his rook on f8 the bishop at a3 can feast on it.  As it is, nothing is protecting Ne4 from QxN.  White can't castle (queen's side) without losing the other knight to black's white bishop, or the queen.",
        "28... Qxe4 29. Qd2 exd4 30. Rf1": "?  The rook at f8.  BxRf8.  It doesn't have an STD.  It is just sitting there, in the good bishop's crosshairs.",
        "30... Rae8": "Well now this is going to hurt.",
        "31. Bxf8": "Yay!  Too late, though.",
        "31... Kxf8": "???  BxN!  It is the only sane thing to do.  White must move the rook, then the king can take that back row bishop, and black can pick off a pawn to boot with Be7xPc4+.  Free knight pawn combo.",
        "32. Kd1": "That doesn't help.  BxN forks the king and rook.",
        "32... d3": "Well, that hurts real bad too, since now Ra1 is vulnerable.",
        "33. Qb4+": "Nice escape.",
        "33... Re7": "I like Be7 better.  Pc5 would be answered by QxN+.  Kc1 QxRf1+.  Eventually the king and rook align to where the black bishop trades for it, or worse.",
        "34. Re1 dxe2+ 35. Kd2 Bxa1 36. Rxa1 e1=Q+": "Now it's over save for the final bleeding out.  What do they call that in Britain?  Blood letting?  \"Bleed out?\"  Would I say \"..final bleed out\" so as not to offend?",
        "37. Rxe1 Qxe1+ 38. Kd3 Qxb4 39. Kd4 Qd6+ 40. Kc3 Re3+ 41. Kb2 Qd2+ 42. Kb1 Re1#": ""
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=49685",
    "gameName": "Let's play chess",
    "players": "stekilvington (1085) vs. tommmm (1129)",
    "opening": "Bishop's opening (C23)"
}