{
    "moves": {
        "1. Nf3": "The Nimzo Larsen starts like the Reti with Nf3",
        "1... d5": "The reaction to occupy the center is the common response to it. Other options are Nf6 or even Nc6 :)",
        "2. b3": "And that's as far as the Gameknot Opening DB goes. However the next 3 moves are quite common in this opening and even played by higher rated players",
        "2... e6 3. Bb2 Nf6": "Everything until now is fine and quite common, that's where the fun begins.",
        "4. d3": "And this is the first \"mistake\" I did, because c4 is obviously stronger. Attacking the center, getting the pawns to point towards the kingside, actually I think I planned to do c4 as the next move, but apparently I didn't...\n\nHowever, this move is still playable (as has been played by Certic, who did c4 as the next step and Fant, who went on with Nb1d2 before doing c4). ",
        "4... Be7 5. Nbd2 c5": "Now my position starts to get cramped, leaving the control over the board and the initative to black. A possible way to continue would be to fianchetto the second bishop ot build up bigger pressure on the center.",
        "6. e4": "White starts trying to break up the center to gain and advantage of it's development.",
        "6... dxe4": "Black actually takes the pawn and allows white to free its position. d4 would probably have been the most annoying reaction.",
        "7. Nxe4": "It would have probably been better to retake with the pawn, strenghening the center and of course setting the bishop free. this would have increased the development advantage of white even further.",
        "7... Nbd7 8. Qe2": "Preparing to castle and letting the rook on the half open d file such that the Queen can evantually be attacked.",
        "8... h6": "While black doesn't want my knights to move to g5",
        "9. O-O-O b6": "This shows another disadvantage of takingwith the pawn instead of the knight. After castling the pawn on c5 was easier to attack, since only the Bishop could have defended it. Now it's to late and still I try to attack.",
        "10. d4 cxd4": "Thankfully black takes and does not wait until I take (which I would have to do, if I did not want my Bishop to be blocked). Black could have strenghend it's control over the center with Qc7 as an example.",
        "11. Nxd4": "Actually it's starting to look pretty good for me. Both knights are places in the center, I'm clearly ahead in development, black hasn't castled yet his bishops aren't well placed... But I had one big problem: I had no plan what I should be going to do...",
        "11... Bb7": "Black finally develops the light squared bishop and blocks Nc6 which could have gotten ugly...",
        "12. Nxf6+": "White starts to fall apart, having no clue what to do I simply trade of pieces, giving blacks bishop a nice position and wasting my control on the center.",
        "12... Bxf6 13. Qh5": "The next sign of desperation. The queen switches to the enemy King's side, where nearly no pressure is yet applied",
        "13... Qe7 14. Nb5 O-O": "A nice chance given by black for white to get back into the game. 15. Bxf6 Nxf6 16. Qh4 ... and white can develop his bishop and start to get the second rook into play.",
        "15. f3": "Unfortunatly I wasted this cance and let black get ahead",
        "15... Bxb2+ 16. Kxb2 Nf6 17. Qh4 Rfe8": "Tempting white to do a fork",
        "18. Qg3 Nd5": "And of courseI fall for it, missing the possibility of Qf6+!",
        "19. Bc4 Red8": "Still not seeing the possible attack, which still could be prevented",
        "20. Rhe1": "Actually up until now I would have had the chance to get back into the game with f.i 20. Qe5 a6 21. Bxd5 xb5 22. Bxb7 Qa3+ 23. Kc3 Qa5+ 24. Kb2 Qxa2+ 25. Kc3 Qa5+ 26. Kb2 Qa3+ and we end with 3fold repetition...",
        "20... Qf6+ 21. Kc1": "?? Why did I do that? Black is free to go right now. Had I done Kb1 I still could have prevented the worst with the Knight, although or by kicking his Knight with the Bishop...",
        "21... Qa1+ 22. Kd2 Nc3+ 23. Nd6 Nxd1": "And the end is near",
        "24. Rxd1 Qd4+ 25. Ke2 Qc3 26. Rd2": "The Knight is trapped because otherwise I lose the Rook, the Rook is trapped to protect the pawn, the Queen is trapped to save the Knight...",
        "26... Bc6 27. Qf4 Rd7": "Now White has protected the Rook with the queen, but the Knight is in grave danger...",
        "28. Qe3 Qb4": "Black doens't want to swap queens, noticing my panic and seeing his chances for a better outcome.",
        "29. a4": "?? Giving up the Knight and allowing black to get further ahead...",
        "29... Rxd6 30. Rxd6 Qxd6 31. g3": "From this point on the game was obviously totally lost, I just didn't want to give in. The rest is pure self torture",
        "31... Rd8 32. Bd3 Qd4 33. Qc1 f5 34. Qe1 Qe5+ 35. Kf2 Qxe1+ 36. Kxe1": "Loosing the queen and the only hope to get back, I finally resigned..."
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=34986",
    "gameName": "Let's play chess",
    "players": "bufferunderflow (1498) vs. pino (1514)",
    "opening": "Reti (A06), Nimzovich-Larsen attack"
}