{
    "moves": {
        "1. e4": ".White mishandled the opening phase, and allowed me to get some targets to attack while improving my position, I managed to win a piece, and finally sacrificed my queen to get a nice mate attack",
        "1... e6 2. d4 d5 3. Nc3": "So we will have a main line French defence, I'll be attacking the queen side",
        "3... Bb4": "Immediately putting pressure on the white queen's wing",
        "4. f3": "?! to defend e pawn, is maybe the idea here, but fails because it weakens the e1-h4 diagonal, e5 is the main line to pressure against the f6 square",
        "4... dxe4": "As fxe4 leads to Qh4+, and as the knight is pinned the e4 pawn falls",
        "5. Be3 Nf6": "develops and protects the e4 pawn in the future",
        "6. a3 Bxc3+": "no point in playing Bb4 instead you are not prepared to exchange it for the bishop",
        "7. bxc3": "degrading white's pawn structure and creating two strategic targets the c4 square and the c3 pawn",
        "7... O-O": "protecting the king first of all",
        "8. Bc4": "? the bishop does nothing in the a2-g8 diagonal, better was Bg5 pinning the knight",
        "8... c5": "the c pawn thematic break in the French defence, creates tension, as dxc5 allows Nc6 blocking all white's c pawns",
        "9. f4": "fxe4 is better followed by Ne2 to open the f column for white's rook, maybe the idea is to open the d1-h5 diagonal and threatening f5 in the future",
        "9... cxd4": "the idea is Bxd4 Nc6 Bxf6 Qxf6 preparing Rd8, or cxd4 b5 Bxb5? Qa5+ wining the bishop, any way black is much better due to a better pawn structure and the castled king",
        "10. Qxd4": "now if I exchanged queens white would undouble his pawns and had a bishop pair with some counter-play",
        "10... Nc6": "develops with tempo, Qxd8 leads to Rxd8 to place a rook on the open column",
        "11. Qc5 Qc7": "Tying the Be3 to the defence of the pawn or forcing some kind of overprotection on it.",
        "12. Nh3": "here it is the overprotection with the knight on the edge of the board",
        "12... b6": "chasing white's queen out of the 5th and prepares Bb7",
        "13. Qg5 h6 14. Qg3": "here she is, back at home, now white will lose a bishop or a rook to a discovered attack",
        "14... Ne7": "discovers an attack on the c4 bishop and prepares the relocation of the knight at f5 (with a double attack on the queen and bishop) or d5 eyeing Be3 and the c3 pawn) with tempo by attacking the Bishop or c3 (and thus winning the a rook with a double attack) if the bishop escapes.",
        "15. O-O-O": "loses a piece",
        "15... Qxc4 16. Kb2": "needed to prevent Qa2",
        "16... Nf5": "attacks both white's queen and bishop",
        "17. Qe1": "forced, as Qf2?? loses the bishop to Ng4",
        "17... Bb7": "the idea is to get the bishop to d5 to block the d column and support the queen's invasion, it also connects my rooks in case i want to challenge the d column for my rook preventing the escape of white's king via d2",
        "18. Bg1": "?! removes the bishop from the threatened square, but closes in the h rook, but I don't see any better move either Bf2 meets Ng4",
        "18... Bd5": "now renewing white's threat of Qa2+",
        "19. Ra1 Rac8": "increasing pressure over c3",
        "20. a4 Rc7": "creating space for Rfc8",
        "21. a5": "? allow black to open the b column",
        "21... bxa5": "opens the b column Rb8 follows",
        "22. Rxa5 Rb8+": "and white is doomed",
        "23. Kc1 Rcb7": "doubling rooks to launch a final attack",
        "24. Rc5 Rb7b1+": "Mate in 2: 25.Kd2 only move 25...Qd3+ sacrificing the queen to open the 2nd line 26.cxd3 forced 26...R8c2++",
        "25. Kd2 Qd3+ 26. cxd3 Rb8b2#": "a forced final sequence.\n\nSome bad connection between white's pieces and leaving a piece hanging allowed a fast win for black."
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=41155",
    "gameName": "Let's play chess",
    "players": "zwitscher-tron (1311) vs. kaspanatola (1200)",
    "opening": "French (C15), Winawer (Nimzovich) variation"
}