{
    "moves": {
        "1. d4 d5 2. c4 c6 3. e3 Nf6 4. Nc3 g6": "Major choice point: I chose the Grunfeld (Schlecter var) over the Semi-Slav. I am more comfortable with Fiancettos in general.",
        "5. h3 Bg7 6. Nf3 O-O 7. b3 Qa5 8. Bd2 Qc7 9. Bd3 Re8 10. Rc1 dxc4 11. bxc4": "Things started getting a little tight from this point. I desperately needed to free my queenside Knight and the Bishop.",
        "11... c5 12. d5 e6 13. dxe6 Bxe6 14. O-O Rd8": "Saw a brief attack opportunity against a file of bishops",
        "15. Qc2 a6": "This was intended to deny 16. Nb5 which I thought would cause me some serious problems.",
        "16. Ne2 Nc6 17. Bc3 a5": "Not sure why I did this instead of Nb4. I might have been greedy to try and gain an open a-file and move the a pawn to the b file. Perhaps I was not keen on \"demoting\" the c pawn to the b file.",
        "18. Rfd1 Nb4 19. Bxb4 axb4 20. Nf4 Ra6 21. Nxe6 Rxe6 22. Qb3 Ra6 23. Bb1": "I believe I had to continually remind myself about the possibility of a back-rank mate from this point on. It looks defensible but I was worried about sac-combos that might force critical defending pieces away.",
        "23... Ra3": "Looked like I had strong forcing sequences here, but it fizzled out after a few moves.",
        "24. Qc2 Rc3 25. Qe2 Rxc1 26. Rxc1 Qd6": "Had a small advantage at this point, I think. My main targets were the two isolated pawns. I was trying to keep him on the defensive so he cannot move his knight and bishop out into more effective locations.",
        "27. Bc2": "Strong move. (on hindsight) Allows Bb3 to secure the 2 pawns and also Rd1 for the attack.",
        "27... Qa6 28. Bb3": "On hindsight, I should have foreseen Bb3 and done something more useful instead of giving him a free tempo.",
        "28... Ne4 29. Rd1 Rd6 30. Rxd6 Qxd6 31. Ne1 f5 32. Bc2 Bc3 33. Nd3 Kf7 34. Nf4 Be5": "I was looking to continue to dominate that black diagonal to cover h2.",
        "35. Nd5 Nc3": "This move probably sealed the eventual draw.",
        "36. Nxc3 bxc3": "Am wondering if I should have taken with the bishop instead. I was gunning for Qd2 which more or less forces an advantageous exchange of queens but he obviously saw it coming.",
        "37. Qd3 Qxd3": "I believe the reason I did this was because I did not want him controlling the d file. Perhaps Ke6 might have been better since if he goes for the exchange, I can take with the king and that's where I'd really want him anyways. Guess I was also worried about the 4 vs 3 pawn structures on the king-side.",
        "38. Bxd3 Kf6 39. Kf1 h5": "Sensing that he wanted to move his king to attack the queen-side (would take a while), I had two options - move my own king over (takes even longer) or mount a pawn attack on the king-side with the king and bishop for support. Note that his bishop is strong as long as I keep my pawns on white squares, so my imperative was to do a \"dark side\" attack, hehe.",
        "40. Ke2 g5 41. f3 f4 42. e4 g4": "A calculated risk. I hadn't really expected this would cause a draw, but I had hoped he would over-reach with an attack and allow a win on my part.",
        "43. fxg4 hxg4 44. hxg4 Kg5 45. Kf3 Kh4": "I offered a draw at this point, but was declined. My plan was to convince him by toggling the king until I see his plan.",
        "46. Bc2 Kg5 47. Bd1": "Now, this move scared me *after* I made my move. I reacted (which is bad in a correspondence game) by simply toggling.\n\nI realized if he posted his bishop at f3, it allows his king the freedom to march queen-side. My king could march over to shore up the position, but I was not 100% sure I could safely handle the two pass-pawns on the e and g files with just my bishop.",
        "47... Kh4 48. Kf2 Kg5 49. Kg1": "Apparently he did not see Bf3 or had some other idea.",
        "49... Kh4 50. Kf2": "Draw was offered at this point. He left a nice concessionary message to which I failed to respond to (because I did not notice it prior to accepting the draw and gameknot closes the comments interface after the game closes), for which (if he reads this) I am very sorry for. Meant to say \"Good game\"."
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=19788",
    "gameName": "Let's play chess",
    "players": "2hopeful (1549) vs. cheewai (1200)",
    "opening": "QGD Slav defence (D10)"
}