{
    "moves": {
        "1. d4": "This game involves me playing a horrible opening and a terrific endgame.  I have a habit of bizzare opening . But I like to experiment with new stuff. It sometimes throws off better players. Even playing white I am the underdog.",
        "1... d5 2. g3": "Went with a hyper modern opening- controling the center with less pawns.",
        "2... Nf6 3. Bg5": "3.Bg5?     Horrible move!!!",
        "3... Ne4 4. Bd2 Nc6 5. e3": "Now you see why... moving the same piece twice.... trapped on one side by pawns....",
        "5... Bf5 6. Bg2 e6 7. Nc3 Bd6": "Good development by black, about to fix my bad opening.",
        "8. Nxe4 dxe4 9. f3 exf3 10. Bxf3": "Now I got some room to work with.  Need to finish the development.",
        "10... Qe7": "10......Qe7?    Causes a double pawn. No good for black.",
        "11. Bxc6+ bxc6 12. c4": "Now the more traditional c4 to match the d4 pawn move... just the 12th move instead of the 2nd.",
        "12... Be4 13. Nf3 Bb4 14. O-O": "14.O-O! Brilliant. Got out of two pins in 1 move. Now to go on the offensive at last.",
        "14... O-O 15. a3 Bxd2 16. Qxd2 Rab8 17. b4 Rfd8 18. c5": "Notice that black controls two half rows- but is countered by my  superior pawn structure. Do you see the three way fork?",
        "18... h6 19. Ne5": "19.Ne5!  The c6 square is ohhh so dangerous for black. I will use that pressure to trap black's bishop - then do my dirty work.",
        "19... Rdf8 20. Rf4 Bd5 21. e4": "In this position he is forced to sacrifice to save the queen/rook.",
        "21... Bxe4 22. Rxe4 Qe8 23. Rg4": "Play on 24.Qh6 next move.",
        "23... g5 24. h4 f6 25. hxg5": "25. hxg5!! My best play of the game. Horse sacrifice to lead to mate in 9. I will be truthful and say that I didn't see the exact mate , but I knew opening the f-h files would lead to a mate, just not exactly how yet.",
        "25... fxe5 26. gxh6+ Kh8 27. Rg7": "This move sets up bringing in my queen then other rook to take advantage of the open rows and that critical h6 pawn.",
        "27... Rg8 28. Qg5 Qd8": "I think 28.....Qf8 would be better...",
        "29. Qxe5 Qf8 30. Rf1": "The last straw . Blacks position is over!!!",
        "30... Qxg7 31. hxg7+ Rxg7 32. Rf7": "32.Rf7! Another good pin.",
        "32... Rbg8 33. Qh5+ Rh7 34. Qxh7#": "One of my best game endgames against a better player,\r\nJeremy Ross"
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=11760",
    "gameName": "Let's play chess",
    "players": "jeremyrayross (1449) vs. richmond73 (1584)",
    "opening": "Queen's pawn game (D00)"
}