{
    "moves": {
        "1. e4": "A standard opening move, which occupies the centre and allows the Bf1 and Qd1 to be developed.",
        "1... c6": "The Caro-Kann Defence.  This move prepares the move 2...d5, which takes a part of the centre.",
        "2. d4": "Taking control of the centre.",
        "2... d5": "Taking a part of the centre.\n\nWhite now has a choice between either: \n1.  Exchanging the pawns by exd5. \n2.  Advancing the e4 pawn and avoiding exchanges, by e5. \n3.  Defending the e4 pawn by a piece, by Nc3 or Nd2. ",
        "3. e5": "White decides to advance and avoid exchanges.  Note how the central pawns are now all locked up.",
        "3... c5": "Black is basically luring White into taking his c-pawn.  If White takes the pawn, then Black can work to attack the e5 pawn, which is because the pawn which was defending e5 is no longer on d4.  Although this seems to lose a pawn for Black, Black knows that he can easily win the c-pawn back.  For example, 4.dxc5 Qa5  and then 5...Qxc5.",
        "4. dxc5": "White indeed decides to take the c-pawn.  Now Black has a clear plan: to win White's c5 pawn and then pile up pressure on the e5 pawn.  This will hopefully tie White down to defending it, and then Black can decide what to do from there. ",
        "4... Nc6": "Instead of going for the c5 pawn straight away, Black rightly decides to threaten the e5 pawn, because the e5 pawn is more valuable to White than the c5 pawn.  The e5 pawn is more valuable than the c5 pawn because it restricts Black's development more.  The c5 pawn doesn't stop Black from getting his Ng8 or or Bc8 out, for example.  However, the e5 pawn stops Black from playing Nf6, which is the best square for the knight.",
        "5. Nf3": "White logically defends his e-pawn and develops a piece.",
        "5... Bg4": "Black wants to play e6 and then take the c5 pawn with his Bf8, but he doesn't want to play e6 yet because it would lock in the Bc8 and prevent it from being developed in any active way.  Therefore, Black develops his Bc8 first.\n\n5...Bg4 pins the Nf3 to the Qd1, preventing it from moving.  If the Nf3 moves, then Black can take White's queen.  So now the knight is tied down to the f3 square, and stops it from taking back at e5 if Black plays Nxe5.\n\nAnother way of explaining this is that Black's Nc6 attacks e5, but White's Nf3 defends e5.  So Black is attacking e5 once and White is defending it once.  This means that Black can't take e5.  Black needs a superior attacking force to White's defending force.  The Bg4 negates the Nf3's defence of the e5 pawn, which means that Black is attacking e5 once and White is defending it 0 times.  So Black is now threatening to take the e5 pawn.",
        "6. Bf4": "White defends against the threat, now he has one defender compared to one attacker.  The e5 pawn is safe.",
        "6... e6": "Now Black's light-squared bishop is outside of the f7-e6-d5 pawn chain.  Black is now threatening to play Bxc5, with a superior position due to his more active pieces.",
        "7. Bb5": "White develops his bishop and frees his pieces defending the e5 pawn a bit, because now the Nc6 is pinned.",
        "7... a6": "Black shoos the Bb5 away.  Now White can either take the Nc6, retreat the bishop to a4 (and maintaining the pin), or retreat the bishop to d3 or e2.",
        "8. Bxc6+": "White decides to trade bishop for knight.",
        "8... bxc6": "Black takes back.",
        "9. Be3": "This isn't a good move, for a few reasons.\n\nFirstly, White is moving the same piece twice in the opening.  He's wasting time, when he should be taking out his Nb1 or castling.\n\nSecondly, White shouldn't try to defend the c5 pawn.  The e5 pawn is much more important.",
        "9... Qa5+": "Black decides to pick up White's c5 pawn immediately.",
        "10. c3": "Blocking the check, and preparing the move pawn to b4.\n\nBlack can't actually take the c5 pawn now.  This is because, after 10...Bxc5, White can play b4, attacking both Black's queen and bishop.  Black would be forced to retreat his queen, and then White can take Black's Bc5 for free.",
        "10... Ne7": "So instead, Black decides to continue with development.  While the Ne7 seems to be blocking the Bf8 and slowing down development, this is not an issue, because Black intends to play Nf5 next move.",
        "11. h3": "White shoos Black's Bg4 away.",
        "11... Bxf3": "Black decides to take the knight.",
        "12. Qxf3": "White doesn't take back with the g2 pawn because doing so would weaken his pawn structure.  The resulting pawns on f2 and f3 would be doubled pawns, and the f5 square would become particularly weak (because White can no longer play g4) and Black can place his knight on the great f5 square.",
        "12... Nf5": "Improving the knight's position and allowing the Bf8 to come out.",
        "13. O-O": "Getting the king to safety.",
        "13... Qc7": "Threatening the e5 pawn.",
        "14. b4": "Strengthening the c5 pawn.  This is a bad move because the e5 pawn is threatened, and as I said before, the e5 pawn is the one that White should be trying to defend.",
        "14... Qxe5": "Picking up the free pawn.  Now material is even, but Black has the better position due to the weak White queenside pawns, and better pieces.  Note that the Nb1 can't move because the c3 pawn will hang.",
        "15. a3": "A poor move.  Strengthening the b4 pawn, but the development of White's Nb1 and Ra1 is a more important issue.",
        "15... g6": "Black decides that the Bf8 won't be able to take on c5 anytime soon, so he decides to deploy the bishop to g7, where it is more useful than e7.",
        "16. Ra2": "White tries to get out his Ra1 into the game this way.",
        "16... Bg7": "Black develops his bishop.  Notice how Black's knight is superior to White's knight.  White's knight is performing an annoying role of guarding the c3 pawn, while Black's knight is centralised and strong on f5.  The Black bishop is also superior to the White bishop.  It watches down a long diagonal down to the c3 pawn, while White's bishop just stares at its own pawn on c5.  The Black queen is superior to the White queen, because it ties the White knight down to the defense of the c3 pawn.  White's queen can't boast of a similar feat.",
        "17. Re2": "White indirectly attacks Black's queen, as if he moves the Be3 somewhere, then the Qe5 will be under fire from the Re2.",
        "17... Qc7": "Black retreats his queen to a safe square, where it can support the a-pawn moving to a5 or the e-pawn moving to e5.",
        "18. Bc1": "I'm not sure what White is trying to do during the next few moves, so I won't try to explain them.",
        "18... O-O": "Getting his king to safety, and allowing the rook to come into the game.",
        "19. g3 a5": "Trying to activate the Ra8.  Like 3...c5 back in the opening, Black is luring White to take the pawn.  Taking on a5 would double the a and c-pawns, which would weaken all of them as they won't be able to guard each other.",
        "20. Qd3 axb4": "Black activates the Ra8.  Now the rook is hitting the a3 pawn.",
        "21. cxb4": "Taking back with the c-pawn is better, because it doesn't allow the Ra8 to penetrate down to a1.",
        "21... h5": "Black strengthens his knight on f5.  This is because now White is discouraged from playing g4 and kicking the knight out.  White can still play g4, though, because of his h3 pawn.",
        "22. h4": "White blocks the h5 pawn from potentially advancing to h4.  Now Black's Nf5 is very hard to kick out, because the h3 pawn wouldn't be supporting a possible g4 advance.",
        "22... Bd4": "Black is trying to setup a little tactic.  Now Black is threatening 23...Nxg3, because the f2 pawn can't take back because it's pinned by the Bd4, and if White takes back with the queen, Black plays Qxg3 and gets a free queen, as the f2 pawn still can't take back on g3.  If White played Qxd4 after Black's Nxg3 (because the knight is no longer defending the Bd4), then Black can play Nxe2 , forcing the White king to move, and then capturing the queen on d4 by Nxd4.",
        "23. Bf4": "White attacks the Qc7, so Black has no time to play his Nxg3.  But Black has a backup plan.",
        "23... e5": "Black advances his e-pawn, attacking the Bf4.  Now Black's centre is starting to take control of the board.",
        "24. Be3": "Retreating the bishop and unpinning the f2 pawn.  This bishop becomes subject to attack in Black's next few moves, but other squares for this bishop weren't any better.",
        "24... e4": "Black unleashes the Qc7's power to g3, and gains time by attacking White's Qd3.",
        "25. Qb3": "Retreating the queen.",
        "25... Bxe3": "Black has seen a way to win material.  If White takes back by the f-pawn, then Black can play either Nxg3 attacking both White rooks, or Qxg3 with an attack on the White king.  But White can also take back with the rook.",
        "26. Rxe3": "White decides against taking back with the f-pawn, but this way allows an exchange of the Nf5 for the Re3.  This exchange favours Black, because rooks are generally superior to knights in most situations.",
        "26... Nxe3": "Winning a rook for a minor piece (knight or bishop) is called 'winning the exchange', and Black has just done that.",
        "27. Qxe3": "White doesn't take back with the f-pawn because then the g3 pawn will hang.",
        "27... f5": "Black strengthens his pawns.  Note that the only weak points in Black's pawn structure are g6 and c6, both of which are very hard to attack.",
        "28. f4": "White tries to lock the position up in the hope that his knight will prove more useful in the fight, because knights can jump over other pieces and aren't limited by closed pawn structures.",
        "28... Rfd8": "Black now wants to play d4, which would push the White queen back and gain space for Black's pieces.",
        "29. Qd4": "White prevents d4 by occupying the square.",
        "29... Qg7": "Black forces a queen exchange.  The only way for White to avoid a queen exchange is to retreat the queen, which would allow 30...d4.",
        "30. Rd1": "White defends the Qd4, intending to take back on d4 with the rook in the event of 30...Qxd4.  This keeps the d4 square occupied, and keeps preventing the d4 pawn move by Black.  White didn't play 30.Qxg7 instead, because after 30...Kxg7, White wouldn't be able to prevent 31...d4.",
        "30... Qxd4+": "Black exchanges queens, because the resulting endgame is winning for Black.",
        "31. Rxd4": "Note how White still prevents the d4 move, because now it is blocked by the rook.",
        "31... Ra4": "I won't explain this move, to avoid confusion.",
        "32. Kf2": "White intends to bring his king into the fight, which is a good thing to do.  Kings should be tucked away out of the battle during the middlegame, but when there's enough pieces off the board for the king to be relatively safe, then the king should be used as a fighting piece.",
        "32... Kf7": "Black does the same.",
        "33. Ke3 Ke6 34. Kd2 Kd7 35. Ke3 Rb8 36. Ke2 Kc7 37. Ke3 Rba8 38. Ke2 Kb7 39. Kf2": "It doesn't seem like Black will be able to get anywhere, as the White position is very solid.  So Black sees that the only way to make a breakthrough is to eventually play Rxa3, and then after Nxa3 Rxa3, to achieve a winning rook and pawn endgame.",
        "39... Ra8a7": "Black wastes a move, allowing White to move his king away from the defense of the g3 pawn.",
        "40. Ke2": "Now White's king is away from g3, so now is the moment for Black to strike.",
        "40... Ra4xa3 41. Nxa3 Rxa3": "Now Black is threatening to win the g3 pawn, which ties White's king to the defense of it.",
        "42. Kf2": "Defending the g3 pawn.",
        "42... Rf3+": "Black intends to play Rb3, but first he plays this move to force the White king into a more passive position.",
        "43. Kg2": "White must continue to defend the g3 pawn.",
        "43... Rb3": "Now Black plays Rb3, and the difference is that the White king is on g2 instead of f2, which is better for Black.  \n\n43...Rb3 ties White's Rd4 to the defense of the b4 pawn.  There's one attacker of the b4 pawn, and one defender, however Black intends to add another attacker soon.",
        "44. Kf2": "White can't really do much other than move his king back and forth.",
        "44... Ka6": "Black's king makes his way to b5, where he can attack the b4 pawn.",
        "45. Kg2 Kb5": "Now Black has two attackers on b4, against White's one defender.",
        "46. Kf2 Rxb4": "Black has won the b4 pawn, and next he will take the c5 pawn with his king.",
        "47. Rd2": "When you are behind in material, you should generally avoid exchanges of pieces, but here it isn't much use because Black's pawn advantage is a winning advantage.",
        "47... Kxc5": "Winning the c5 pawn, finally.  Since the opening Black has aimed at winning this pawn, and now he does.",
        "48. Rc2+": "There's nothing much else to do.",
        "48... Rc4 49. Rxc4+": "White resigned the game before waiting for Black's reply, which would've been 49...Kxc4.\n\nBlack's win is clearcut from this position.  Black would advance his c and d-pawns with the support of his king.  Then one of the pawns would promote to a queen, and then Black would checkmate White soonafter.\n\nI hope any beginners, or anyone for that matter, learnt something from this game."
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=6562",
    "gameName": "Let's play chess",
    "players": "vaderboy98 (1471) vs. kerksal (1477)",
    "opening": "Caro-Kann (B12), advance variation"
}