{
    "moves": {
        "1. e4": "The game opens with one of the main lines of the Ruy Lopez",
        "1... e5 2. Nf3 Nc6 3. Bb5 a6 4. Ba4 Nf6 5. O-O Be7 6. Re1 d6": "Deciding to slow down I go with d6 rather than b5... \r\nI must say that I really don't like b5 at all, it never \r\nseems to deliver, cramps the queenside and increases\r\nits vulnerability to attack!\r\n\r\nIn the Game Database 11,000 people went with b5, and only 379 with d6, go figure?",
        "7. Bxc6+": "Why? What is he gaining?\r\n",
        "7... bxc6": "From my perspective I now have an extra pawn to help build a strong center, and the b-file is semi-open for my rook.",
        "8. d4": "Now he wants to dominate the center? \r\nMake up your mind, sir.",
        "8... exd4 9. Qxd4 O-O 10. Nc3 Bb7": "The mission becomes clear: The pawn on the e-file must die!",
        "11. Bg5": "Can he protect his precious e-pawn?",
        "11... c5 12. Qd3 Nd7": "Forcing the bishop on g5 and discouraging his e-pawn from advancing",
        "13. Bxe7 Qxe7": "Hello e-pawn...",
        "14. Nd5": "Attacking my queen and asking me to open up the e-file for his rook by taking his knight with my bishop.",
        "14... Qd8": "I politely decline!",
        "15. Red1": "I think the target here was my knight, and position on the 7th rank...\r\nIf 1. e5 dxe5 2. Ndf6+ Qxf6 3. Qxd7\r\n\r\n",
        "15... Re8": "No thanks...\r\nHello e-pawn and e-file!",
        "16. Rde1 Nf6": "I feel the momentum starting to shift",
        "17. Rad1 Bxd5": "I take with the bishop because it forced him to take me in return. The bishop is also threatening a2!",
        "18. exd5 Rxe1+": "Grabbing the momentum and directing the game",
        "19. Rxe1 Qd7 20. Nd2 Qb5": "If you take me the e-pawn is mine and the a-pawn better watch his back...\r\nIf you don't take me, I will take you and the e-pawn is mine or maybe I'll just take the b-pawn (yeah right)...\r\nWhat's it going to be?",
        "21. Nc4": "Pretty good move, but that is a lot of commitment he is forcing on his Queen.",
        "21... h6": "My goal is to exchange rooks... But I needed to make sure I didn't get caught with my pants down and that I didn't leave my a-pawn hanging",
        "22. Re7": "I knew that is what he was going to do... but it doesn't matter!",
        "22... Re8": "The c-pawn is safe... You must take me!",
        "23. Rxe8+ Qxe8": "Threatening check, queen trade and taking the what? yes, the e (now d) pawn.",
        "24. Kf1": "Good move on his part!",
        "24... Qa4": "Protect and attack",
        "25. Qb3": "You want to trade really? I thought you'd never ask.",
        "25... Qxb3": "Come here, you...",
        "26. axb3 Nxd5": "It's mine all mine... Hurray I win the pawn...\r\nNOW WHAT?",
        "27. Ke2": "A slow and tedious end-game begins!",
        "27... Nf4+": "How about a simple fork?",
        "28. Kf3": "Of course not.",
        "28... Ne6 29. c3 f5": "This was the only pawn I could move without weakening my position.\r\nIt also prevented his king from advancing and freed up my King to move forward.",
        "30. Ne3 g6": "At this point I was actually considering offering a draw... My confidence just wasn't there for the win. I had my hands full covering all the different angles.",
        "31. h4 h5 32. Nd5": "Threatening my c2-pawn",
        "32... Kf7 33. Ke2 c6": "Forcing his knight to retreat, and building a support structure for my d-pawn",
        "34. Ne3 Nf4+": "Let's try that fork again...",
        "35. Kf3 Nd5": "Let's trade knights",
        "36. Nc2": "Let's not and say we did",
        "36... Ke6": "Strengthening my position by getting the King in play",
        "37. Ne1": "He is setting up for Nd3",
        "37... Nf6 38. Nd3 Ne4": "Looking to fork with Nd2 on next move",
        "39. Ke2": "Good move on his part",
        "39... a5": "Much stronger position for my a-pawn\r\nNot to mention that everything else had to stay put.",
        "40. Nf4+": "A fork from the other side...\r\n",
        "40... Kf7": "Careful not to block f6 for my knight to have a place retreat to if he threatens with f3\r\n",
        "41. Nh3": "Beefing up g5",
        "41... d5": "Creeping forward with yet another pawn and giving the knight another place so that the King can put more pressure on g5",
        "42. Kd3 Kf6": "g5, the next great showdown?",
        "43. f3": "of course not",
        "43... Nd6 44. Nf4 c4+": "Looking to trade pawns and get my knight back in the action",
        "45. Kd4": "What's this? He doesn't take... Thinks he can clean up from c5",
        "45... cxb3": "Thank you",
        "46. Kc5 Nb5": "Most importantly I am blocking the path to my a-pawn... If he takes my c-pawn I will take his c-pawn... There I can protect my d-pawn or at least trade for the knight... \r\n\r\nAnd if he takes my knight my pawn gets his queen on...\r\n\r\nAs a matter of fact as soon as King moves to get my c-pawn, I have a queen with a or b",
        "47. Nxd5+": "Sure that makes sense. if 1. ...cxd5 2. Kxb5 and my pawns\r\n",
        "47... Ke5": "so with Ke5 the Queen is still well within reach",
        "48. Kxc6": "You can have it.",
        "48... a4": "Take my knight too for all I care",
        "49. Nb4": "Oh oh he sees trouble in paradise",
        "49... Nxc3": "Can you just take the knight already I want my queen",
        "50. bxc3": "Thank you",
        "50... a3": "Avoiding b2 without support from the a-pawn. His knight was waiting to fork and make my efforts backfire",
        "51. Nd3+": "Harmless check",
        "51... Kf6 52. Nc5": "hoping I will move the a-pawn instead of the b-pawn",
        "52... b2": "sorry",
        "53. Nd7+": "harmless check",
        "53... Ke7": "I always move my king so he can't say check on the next move",
        "54. Nb6": "It pays off",
        "54... b1=Q": "Hallelujah!!! Can you believe it... I think my head can explode now from all the pressure and conniving. ",
        "55. Nd5+": "What else can he do?",
        "55... Kf7": "I carefully move my King out of his range. \r\n\r\n\r\nGAME OVER!!"
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=24273",
    "gameName": "Let's play chess",
    "players": "itking (1873) vs. dankeschoen (1709)",
    "opening": "Ruy Lopez (C87), closed, Averbach variation"
}