{
    "moves": {
        "1. e4 c6 2. d4 d5 3. e5 Bf5 4. Bd3 Bxd3": "4...not so crazy about the trade...the Caro-K is kind of passive-y, but a little imbalance is to black's advantage.  Retreating the bishop and allowing the trade on g6 is not bad...Fischer always said the doubled pawn formation was almost impossible to attack...sometimes the open h file comes in handy.\n\n7...Why trade the good black-squared B for White's bad one?...also the trade hands W a tempo...how will black ever get counterplay...he is already behind in development and opening the game will help W, not black.\n\n8. I might have played N x d2...looking at c5 which is where B's break and counterplay will come...clamping down on the Q-side will reduce B to a waiting game\n\n11. W has space, and no weaknesses, and better development...this is already a struggle for B\n\n12. the g4 push  creates an ugly hole on f4 for W, if B could sink a knight  in there, then he can stop W's K-side attacking possibilities. B will have to be careful to guard the h file, maybe playing g5, K up, then bringing the R and Q back to oppose W's buildup there.",
        "5. Qxd3 e6 6. Nf3 Bb4+ 7. Bd2 Bxd2+ 8. Qxd2 Ne7 9. Nc3 O-O 10. Qd3 h6 11. O-O-O Nd7 12. g4 Ng6 13. Qf1 c5 14. Rg1 cxd4 15. Rxd4 Ndxe5": "15...B should now be winning...sometimes having a pawn advantage in one sector means using them,  even in front of the K...otherwise the pawn \"disadvantage\" really means more open lines for W who wants to attack here anyway...so B maybe should be trying to make his pawn advantage felt in the center....paradoxical but passivity can be fatal...fight for space",
        "16. Nxe5 Nxe5 17. f4 Nc6 18. Rd1 Rc8 19. Qf3 a6 20. g5": "20. W's K side attack is more advanced than B's play on the Q side...who will get there first?",
        "20... hxg5 21. fxg5 Ne5 22. Qh5": "22. Now W threatens a rook lift to h3, in a move or two...how is B going to counter this...not so easy to see how.  B's pawn at e6 impedes his K-side defense, and W owns the g5...d8 small diagonal...so B's defensive options are meager",
        "22... Ng6 23. Rdf1 b5": "23...too slow....need to weather the K-side attack before thinking about counterplay",
        "24. Rg3 Qa5 25. Rh3 Rfe8": "25...too late...the pin, after the check on the h file is going to lose the game for B",
        "26. Qh7+ Kf8 27. Qxg6": ""
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=60086",
    "gameName": "Let's play chess",
    "players": "spillaneca (1598) vs. jazzbox61 (1508)",
    "opening": "Caro-Kann (B12), advance, Short variation"
}