{
    "moves": {
        "1. d4 f5 2. c4 Nf6 3. Nc3 e6 4. Bg5 Be7 5. Qc2 O-O 6. Nf3 d6": "Dutch - classical variation \n\nI initially was impressed with this opening, but I have not liked the results. Perhaps I should study more master games with Be7 and d6 - I'm not optimistic, however. There are several problems:\n\n(1) The weakness on f4 - A solid, strong, loyal companion in both the Leningrad and Stonewall varaitions, mr. f is virtually alone in the classical - protected only by mr. e whose job in the other two variations is shielding the king from diagonal checks. I can play Kh8, but it wastes time and doesn't solve the problem of being forced to take *out* of the center and open the e file (rather than the d file which is what the Dutch naturally prefers). Another option is using mr. g to protect it (like in the Leningrad), but if I play g6, I want to play Bg7!\n\n(2) The e7 bishop is AWFUL - look at it! It lacks a legal move!! There's not a 'good' bishop and a 'bad' one (like there is in both other variations) there are TWO bad bishops...it's hard to figure out which one is worse!\n\nAt the end of the day, this is the reason people don't play the Dutch - king safety problems, a weak overextended mr. f, and a cramped position that keeps your bishops home. You're grabbing space, but doing nothing with it!\n\nLeningrad and Stonewall have both made me proud - let's go back to them!",
        "7. e4": "!\nHitting the aforementioned weak mr. f",
        "7... Qe8 8. e5": "*\n(!) e5 is a famous hole in the Dutch defense - it's been the infiltration square for my position on numerous occasions, and, if my opponent can win this square (though the classical fights for it very effectively), they may also win the day.\n\n(?) The queen is pointed at f5, the bishop is ready to jump into the attack on d3, and, with the cluster of minors right next door, mr. f's head would be on my opponent's wall in no time, and, if I'm not careful, everything behind him will share that fate. ",
        "8... Ne4 9. Bxe7": "my bishop was terrible while his was strong, so this is a good trade for both of us - my opponent liberates the knight, I get equal value out of a loser bishop - yayyyyy",
        "9... Qxe7 10. Nxe4 fxe4 11. Qxe4": "!\npoor mr. f meets his maker, and there is nothing in this opening that remotely bothers to keep that from happening. ",
        "11... g6": "?\nNow that there's no one to protect and no bishop to fianchetto, I guess it's a good time to move old mr. g and invite the queen into my lair..... Bd7, Nc6 - both alternatives. ",
        "12. Bd3": "g6 would be forced here anyway.",
        "12... Bd7 13. O-O Nc6 14. a3 Qg7 15. b4": "! \n\nlook at all that energy staring at my team! There's nothing going on for me, and my opponent is moving in fast. ",
        "15... dxe5": "You had to do something, Ali - when in doubt, kick and scream all the way to the gallows!",
        "16. dxe5 Nxe5": "?\nhere's where it starts to unravel.....",
        "17. Nxe5 Rad8 18. b5 Rf5": "?\nHere I loaded the gun and handed it to my opponent - the d3 bishop is ready to get in a discovered attack and remove the last thing that could possibly save me - tempo. Doubling the rooks was less important here than getting some counterplay on the d file - where I had already posted a rook. With the wasted doubling motion, the wasted Rd8, and the time loss from the bishop, the coffin is being nailed shut. ",
        "19. f4 Rdf8": "?\nbad bad bad - it hangs the bishop, it concedes the d file, AND it wastes more time",
        "20. Qe3 Rh5": "The only move...and it's not good. ",
        "21. Be2": "! \ngains more time and re-routes to the square evil wants to point at - e6.",
        "21... Rh4 22. Bg4 Qh6": "An attempt at an attack...and not a good one - but it forces a tempo loss",
        "23. h3 g5 24. Nxd7": "this bishop has been hanging forever!",
        "24... gxf4 25. Bxe6+": "No point in continuing..... x_x"
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=54107",
    "gameName": "Let's play chess",
    "players": "solegira (1403) vs. alisonhart (1179)",
    "opening": "Dutch with c4 & Nc3 (A85)"
}