{
    "moves": {
        "1. e4 e5 2. f4": "Gambito de rey. No sé jugarlo y no lo he entrenado. Esta apertura tiende a producir partidas rápidas y alocadas. Divertidas, según algunos.",
        "2... exf4": "Normalmente desarrollo alguna pieza pero ahora decido tomar en f4.",
        "3. Bc4": "Ataque al punto débil f7, mucho más débil en esta apertura.",
        "3... Nf6 4. Nc3 Bc5": "Hay que movilizar piezas.",
        "5. d4 Bb6 6. Bxf4": "Centro blanco muy fuerte, otra carácterística del gambito de rey.",
        "6... d6 7. Nf3 Bg4 8. Qd3": "Enroque largo blanco preparado.",
        "8... Bxf3 9. gxf3": "Esperaba que tomara con la dama para presionar el punto b7 pero toma con el peón y abre la columna del teórico enroque corto negro. ",
        "9... a6": "Protejo mi enroque por si fuera necesario, aunque espero no hacerlo en corto.",
        "10. O-O-O": "Lo esperado.",
        "10... Nbd7 11. Rhg1": "También esperado.",
        "11... g6 12. Bg5 h6 13. Bh4 c6 14. Rde1 Qc7": "Salida para la dama, debilidad en h2.",
        "15. Rg2 Nh5 16. e5 d5 17. Nxd5 cxd5 18. Bxd5 Nf4": "Por fin un ataque serio.",
        "19. Bxf7+": "Ve la manera de librarse de mi ataque sacrificando el alfil...",
        "19... Kxf7": "Y mi enroque.",
        "20. Qb3+ Kg7 21. Rg4 Nh5 22. Reg1": "Metiendo presión.",
        "22... g5 23. Bxg5": "Otro sacrificio",
        "23... hxg5": "que abre la columna H.",
        "24. Rg4xg5+ Kf8 25. Rg5g8+ Rxg8 26. Qxg8+ Ke7 27. Qh7+": "¿ No habría sido mejor capturar en A8 y empujar los peones centrales?",
        "27... Ke6 28. Rg6+ Kd5 29. Rd6+": "Creo que llevar al rey a C4 es una locura.",
        "29... Qxd6 30. Qe4+ Ke6 31. exd6+ Kxd6 32. Qxb7": "Todo parece perdido, sin peones y con el rey muy expuesto.",
        "32... Rg8 33. c3 Rg1+ 34. Kc2 Rg2+ 35. Kb3 Rxh2": "Tengo que recuperar peones ante la pasividad de la dama blanca.",
        "36. Qxa6": "No recuerdo una partida en que hayan capturado todos mis peones. Pero hay que seguir jugando y esperar el error.",
        "36... Nf4": "Bloqueo y acercamiento a la zona caliente del tablero.",
        "37. a4 Rh5": "Ese peón no debe ir a A5.",
        "38. c4 Ke7": "Desclavo el alfil y me escondo un poco.",
        "39. c5": "¡¡¡ Ahí está el error !!!",
        "39... Bxc5 40. dxc5 Nxc5+": "Ha habido suerte. Lo normal es mo equivocarse."
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=62237",
    "gameName": "Let's play chess",
    "players": "shizzyboy80 (1608) vs. tiramisu (1670)",
    "opening": "KGA (C33), bishop's gambit, Bogolyubov variation"
}