{
    "moves": {
        "1. e4": "A good game with an interesting end to it.",
        "1... e5 2. Nf3 Nc6 3. Bb5 Nf6": "This is my usual response to Spanish defence.",
        "4. d3 d6 5. h3 a6 6. Bxc6+ bxc6 7. Bg5 h6 8. Bh4 Be7 9. O-O g5": "My almost trademark move. Usually destabilizes the opponent's defense.",
        "10. Bg3 Be6": "The bishops have been quite out of the game, black starts to bring them into play.",
        "11. c4": "White perhaps tries to counter black's plans.",
        "11... Rb8": "Rook to open flange.",
        "12. b3": "Again white counters. This time white has a good pawn structure for defense. However, black has more moving space while white is quite confined to his side.",
        "12... Rg8": "The plan is to move pawn to g4.",
        "13. Nh2 h5 14. f3 Qd7": "Black's white bishop is now in action and is in a good position in front of the queen. Black's attack on g4 is further consolidated.",
        "15. Bf2 g4 16. fxg4 hxg4 17. hxg4 Nxg4 18. Nd2 Bg5": "The black bishop is not really attacking the d2 knight. The intention is to move to f4.",
        "19. Ndf3 Bf4": "Black's attack now seems to be not coordinated as the Knight and bishop, are attacking on the black squares while the white bishop and queen on the white diagonal.",
        "20. g3 Nxf2": "This move reorganizes black's attack.",
        "21. Rxf2 Bxg3 22. Rg2 Bh3 23. Rc2 Qe7": "The black queen starts it's own attack.",
        "24. a4": "White's move is a poor choice. 1) He completely ignores his precarious defense, 2) He leaves the b pawn undefended.",
        "24... Qf6 25. Rb1": "White tries to salvage the weakened b flange but it costs him moves.",
        "25... Qf4 26. Kh1 Bxh2 27. Rxh2 Qg3": "The move plans for 28. ...Bg2 which would lead to a mate.",
        "28. Rbb2 Rxb3": "24. a4 now costs white.",
        "29. Rbf2 Bg4": "The pinning now starts. 1)The knight.",
        "30. Rhg2 Bxf3": "Pin 2 - Rook.",
        "31. Qxf3": "White makes a big mistake. The queen is lost.",
        "31... Rb1+": "White has only one option.",
        "32. Rf1 Qxf3": "White resigns. There are 2 pins here also. It's a mate in 3 at max."
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=27614",
    "gameName": "Let's play chess",
    "players": "dcrofut (1582) vs. demadone (1534)",
    "opening": "Ruy Lopez (C65), Berlin defence, Anderssen variation"
}