{
    "moves": {
        "1. e4 e5 2. Nf3 Nc6 3. Bb5 Nge7": "I don't know what this variation of the Ruy Lopez is called - it looks very passive and would require very careful play by Black to equalize - more standard is, of course, 3...a6",
        "4. O-O a6 5. Ba4 b5": "A wasted tempo - the bishop has no real teeth on that diagonal, and Black is simply pushing pawns around instead of developing.",
        "6. Bb3 h6": "Trying to stop the Knight from attacking f7 - the previous wasted moves have forced Black to waste yet another one",
        "7. c3 Bb7": "Better was d6 and attempting to exchange the Bishop on b3",
        "8. d4 exd4": "Very dubious. Cedes control of the center",
        "9. cxd4 Nb4": "A rotten move. It attacks the e4 pawn, but nothing else, and the passivity of Black's K-side is about to make itself felt dramatically.",
        "10. Ne5 d5 11. Qf3 f6": "Forced. We can see how simple lack of development turned from a passive game to a disaster.",
        "12. Qh5+ g6 13. Nxg6 Nxg6 14. Qxg6+ Kd7 15. Qf5+": "Forcing the king to remain in the center",
        "15... Ke8 16. a3": "Kicking the knight away from the defense of d5",
        "16... Nd3": "Since c6 was a hopeless square (exd5 would have made the knight keep running) this is probably best, however, Black is still down a pawn, losing another, and facing a strong attack.",
        "17. exd5 Nxc1 18. Rxc1": "Also possible was 18. Re1+!?",
        "18... a5": "? A big mistake. Black is already facing a miserable prospect, but this move just loses.",
        "19. Re1+ Be7 20. Qxf6 Rh7": "?? Better was 20...Rf8",
        "21. Qg6+ Rf7 22. d6 Qxd6 23. Qxf7+ Kd7 24. Nc3": "The cavalry belatedly arrives, making White's attack irresistible. The threat is N(x)b5 and the arrival of the Q Rook",
        "24... Qxd4": "Giving up",
        "25. Rxe7+ Kc6 26. Rxc7+ Kb6 27. Rxb7+ Kc6": "This move loses immediately, but after 20...Ka6 21. Nxb5 would decide things quickly",
        "28. Qc7#": ""
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=24620",
    "gameName": "Let's play chess",
    "players": "dribbler (1514) vs. cucciolo (1398)",
    "opening": "Ruy Lopez (C60), Cozio defence"
}