{
    "moves": {
        "1. e4 c6 2. Nc3 d5 3. Nf3 dxe4 4. Nxe4 Nf6 5. Nxf6+ exf6 6. g3 Bd6 7. Bg2 Qe7+ 8. Qe2": "8.… Qxe2+ 9.Kxe2 Na6 10.d3 looks to favor White slightly.",
        "8... Be6 9. O-O Nd7 10. d4 O-O 11. Re1 Rfe8 12. Bd2 Bg4 13. Qd3 Qf8 14. Nh4": "White’s prospects for victory currently lie on the queen side where he has the pawn majority.  He does realize this eventually, but 14.c4 would have started the ball rolling sooner.",
        "14... Rxe1+ 15. Rxe1 Re8 16. Nf5 Rxe1+ 17. Bxe1 Bxf5 18. Qxf5 Qe7 19. Qe4 g6 20. Qxe7 Bxe7 21. c4 f5 22. d5": "White would have been better advised to delay this push until after getting his king into position to support it, for example with 22.Kf1 Kf8 23.Ke2 Ke8 24.a4 Nf6 25.Kd3 Kd7 26.b3.",
        "22... cxd5 23. Bxd5 b6": "Now 24.b4 looks to be better than the move White actually makes.  “Fortune favors the bold.”",
        "24. Kf1 Nf6 25. Bc6 Ne4 26. Ke2 Bc5 27. h4 a5 28. f3 Nd6 29. Kd3 Kf8 30. a3 Ke7 31. b4 axb4 32. axb4 Bg1 33. Bd5 f6 34. g4 fxg4 35. fxg4 h6 36. Bg3 f5 37. gxf5 Nxf5 38. Be1 h5 39. Be4 Ke6 40. Bd5+": "[?]  (GameKnot's annotation function does not allow for move evaluation symbols in the score proper.  This is my workaround.)",
        "40... Ke7": "[?]",
        "41. Be4": "Anticipating that Black was simply going to move his king back and forth between e6 and e7 White offered a draw at this point.  When Black declined he realized he had made a mistake on his previous move, and Black had let him get away with it by not playing 40.… Ke5.",
        "41... Ke6 42. Bxf5+ gxf5": "Black must keep White’s pawns within sight of his king: 42.… Kxf5 43.Bd2 Kg4 44.Bg5 Bf2 45.Ke4 Bxh4 46.Bxh4 Kxh4 47.Kf3 g5 48.c5 g4+ 49.Kg2 for example.",
        "43. Bd2 Ke5": "43.… Bf2 would have been ineffective: 44.Be3 Bxh4 45.Bxb6 Ke5 46.Bc7+.",
        "44. Bc3+ Kf4 45. Bd4 Bxd4 46. Kxd4 Kg3 47. c5 bxc5+ 48. bxc5 f4": "48.… Kxh4? lets White promote a full move before Black can.",
        "49. c6 f3 50. c7 f2 51. c8=Q f1=Q 52. Qg8+ Kxh4 53. Qh7 Qd1+ 54. Ke3 Kg3 55. Qc7+ Kg2 56. Qc6+ Kh3 57. Qf3+ Qxf3+ 58. Kxf3 Kh2 59. Kf2 h4 60. Kf3 h3 61. Kf2 Kh1 62. Kf1 h2 63. Kf2": "A rather unusual king vs. king and pawn stalemate position: the side with the material advantage is the one with no legal move."
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=69158",
    "gameName": "Let's play chess",
    "players": "midnight_skulker (1800) vs. jraul (1800)",
    "opening": "Caro-Kann (B10), two knights variation"
}