{
    "moves": {
        "1. b3": "The Nimzo-Larsen Attack.",
        "1... d5": "The strongest and most direct test of the Nimzo-Larsen is 1. ... e5; however, d5 is not a bad move. In fact, had the opponent played e5, I would most likely have the advantage in theoretical knowledge.",
        "2. Bb2 Nc6 3. e3 a6 4. Nf3": "The fact that Black has not played e5 allows White to develop more aggressively with more control over the center. If e5 had been played, White could still play Nf3, but with ... e4, Black could gain more space and force the Knight to find a new home. If then Nd4, White's development becomes more cramped. ",
        "4... e6 5. c4": "The Nimzo-Larsen generally involves White attacking Black's center with a flank pawn. ",
        "5... Nf6 6. d4 h6": "Black should not be wasting time with such moves. His focus should be on the disruption of White's development and the strengthening of his own center.",
        "7. Be2 Bd6 8. O-O O-O 9. Ne5": "In retrospect, I should not have made this move as it allows Black to double my pawns on the e file without any damage on the Black position. Also, my development was not complete; the Knight on b1 has yet to be developed. However...",
        "9... Ne4 10. Nc3 Bxe5 11. dxe5 Nxe5": "Here Black blunders a Knight for a pawn. Neither do I have the problem of doubled pawns on the e file.",
        "12. Nxe4 Nxc4 13. bxc4 dxe4": "Black handled the blunder fairly well. Now I have an isolated pawn and I'm only up one point. However, I still have the two bishops with one strongly placed while the Bishop on c8 is looking rather hemmed in. ",
        "14. Qc2 Qg5": "If Black played f5, it would serve to hem the Bishop in even more. The question is whether the loss of the pawn on e4 or the lack of freedom for his Bishop is a greater factor.",
        "15. Qxe4 e5 16. Bd3": "My thought was to place the Bishop more actively with initiative. ",
        "16... g6 17. Qxe5": "Now, a clear piece ahead, I offer the trade of Queens into an advantageous endgame.",
        "17... Qxe5": "He accepts",
        "18. Bxe5 c6 19. Rad1": "I wanted to grab the open file and focus my attention toward the Kingside. In retrospect, it may have been advantageous to attack the Black Queenside with a lead in material and the open b file. ",
        "19... Be6 20. a4 Rfe8 21. a5": "This move was incorrect. I should have noticed the possibility of a discovered attack on the hanging Bishop. Especially since Black's last move lined the Rook up with the Bishop.",
        "21... Bg4": "A discovered attack on my hanging Bishop. ",
        "22. f3": "The only defense I could find.",
        "22... Bxf3": "Black should have played 22. ... Rxe5. Then in order to retain any kind of advantage, White would play 23. fxg4, but White would have many weak, isolated pawns for Black to attack. Now, I maintain a much better position.",
        "23. Rxf3 Rxe5 24. Rdf1": "Threatening to infiltrate my Rooks to the seventh rank and potentially attack the Black King.",
        "24... Rf8": "Black apparently doesn't want to give up his pressure on a5, but now, I get a free pawn and more pressure on the Black Kingside. The move should have been Re7.",
        "25. Bxg6 Re7 26. g4 Kg7 27. Bh5 c5 28. Bxf7": "Here I decided to go ahead and exchange some material for a position with a passed pawn and potential for another. Without the support of the King, Black's Queenside has no hope, but when the King supports the Queenside, White can force another passed pawn on the Kingside.",
        "28... Rexf7 29. Rf3xf7+ Rxf7 30. Rxf7+ Kxf7 31. Kf2": "Moving to the center.",
        "31... Ke6 32. Kf3 Kd6": "The Black King hurries to force a passed pawn through on the Queenside.",
        "33. e4 Kc6 34. e5 b6 35. axb6 Kxb6": "Black has created his passed pawn, but will it be enough?",
        "36. Ke4 Kc6": "The Black King cannot stray too far from the e8 square. ",
        "37. h4 a5 38. g5 hxg5 39. hxg5": "And there you have it Ladies and Gentlemen! Mutually Supporting Pawns! It always feels very nice applying what one has learned from an endgame book (Purdy on the Endgame). I don't believe many players at my current rating know about this endgame idea. Now the White King is free to do as he pleases! The pawns on e5 and g5 are very good soldiers and are self sustaining. The King no longer needs to shepherd them.",
        "39... Kd7 40. Kd3 Ke6 41. g6": "I've always thought Mutually Supporting Pawns were beautiful!",
        "41... Ke7": "He can't take on e5 or the g pawn escapes, but he can't switch his attack to the g pawn fast enough to gobble them both up. ",
        "42. Kc3 Kf8 43. e6": "The Mutually Supporting Pawns are just steadily marching forward. There's nothing the poor Black King can do! He resigns in the face of such teamwork."
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=22933",
    "gameName": "Let's play chess",
    "players": "doctor_knight (1424) vs. drav (1392)",
    "opening": "Nimzovich-Larsen attack (A01), classical variation"
}