{
    "moves": {
        "1. e4 e5 2. Nf3 Qe7": "This is known as the Gunderam defense.",
        "3. d4": "Nc3 is usually a pretty popular response instead, since Nd5 is protected by Pe4 and can be followed by NxPc7+ which forks the king and rook.  Black has decent defenses against that, though.",
        "3... a5": "Black usually plays d6 or Nc6 or Nf6.  Pa5 is not really recommended.\n",
        "4. dxe5 d6 5. exd6 cxd6": "I would lean towards QxPd6 instead, to prevent isolating that d pawn.",
        "6. Bb5+ Bd7 7. Na3 Qxe4+ 8. Be3 f6 9. Bd3 Qc6 10. Nb5 d5 11. Bf4 Bc5": "Oof.  Black should have played Na6, to protect against Nc7+.  Better yet, black should probably not have moved Pd5 earlier (10).",
        "12. Nc7+ Kd8 13. Nxa8 Na6": "Qc8 might have been better.",
        "14. Bxa6 Qxa6": "Good.  This prevents doubling pawns (PxNa6) while attacking Na8.",
        "15. Nc7 Qa7": "I like Qb6 better, which attacks Pb2.  But this sets up BxPf2+, which eliminates white's ability to castle.",
        "16. O-O": "Unless white beats black to it.",
        "16... g5 17. Bg3 h5": "Here white is strongly encouraged to play QxPd5.",
        "18. h4": "Moving the castle pawns is generally not a great idea.",
        "18... Ne7": "This was a good move on black's part.",
        "19. hxg5 fxg5 20. Nxg5 Kc8": "Black needed to either move the king to prevent Nf7+ rook fork on the other side.  Rf8 would have been another option, putting pressure on white's f pawn.",
        "21. Be5 Rg8": "Black withdraws support of Ph5.  Of course the rook had to be moved, but Rf8 might have been better.",
        "22. Qxh5 Bd4": "Solid move--this attacks Pb2.  If white trades he will need to move Nc7 or lose Pb2 to the black queen.",
        "23. Bg3 Bxb2 24. Rae1 Kd8 25. Qf7": "Oops.  Black can play RxNg5.",
        "25... Re8": "That was an awkward mistake.  White will certainly play NxRe8.  BxN will be answered with Ne6+ driving the king away from the bishop so QxBe8.",
        "26. Rxe7": "Completely not the way I would have played this.",
        "26... Rxe7 27. Qf8+ Be8 28. Rd1": "I think I would have gone for Nce6+ instead, to protect the knight.",
        "28... d4": "While protecting that pawn is nice, RxNc7 is probably better.  RxPd5+, Rd7.",
        "29. Bd6 Re2 30. Nge6+ Kd7 31. Qxe8+ Kxd6 32. Nb5+": "Yep."
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=57573",
    "gameName": "Let's play chess",
    "players": "psycho422 (1066) vs. maggiebiscuit (1141)",
    "opening": "Gunderam defence (C40)"
}