{
    "moves": {
        "1. d4 c5": "Old Benoni Defense.",
        "2. e3 Qa5+ 3. Qd2 Qb6 4. Nf3 d6 5. Nc3 Bg4 6. h3 Bh5": "Here I'm slightly partial to BxN, which doubles white's pawns.",
        "7. g4 Bg6 8. Na4 cxd4": "Uh, oops.  A brief review is in order.\n\n1.  Can you force mate?  (No).\n2.  Can you prevent force mate?  (None appears imminent).\n3.  Can you take a high value piece (HVP)?\n4.  [And this is critical here]  Can you prevent your opponent seizing a HVP?\n\nSomething should be done to prevent NxQb6, like Qc7 or Qd8.  Qc6 is ok too, if NxPd4 then QxNa4.",
        "9. Nxb6 dxe3 10. Bb5+ Nc6 11. Bxc6+ bxc6 12. Qa5 exf2+ 13. Kxf2 Nf6": "Uh, oops again.  Remember rule 4--can you prevent your opponent acquiring a HVP?  Because while PxN is right out (QxRa8+), Rd8 might stave off disaster a few more moves.",
        "14. Nxa8": "Here black needs to be working on rule 2--how to stave off imminent mate.",
        "14... e5": "That is a good first step.",
        "15. Nc7+ Ke7": "This puts the king in the path of the bishop, preventing the remaining rook's egress.  On the other hand, Kd87 is clearly bad for discovered check (white moves the rook).  Kd7 isn't great either, but it's the only option left with a check by knight.",
        "16. Bg5 h6 17. Be3 c5 18. Nd5+": "White would have been better off playing QxPa7 first.  The knight would then be safe from NxNd5.",
        "18... Nxd5 19. Qxa7+ Ke6 20. c4 Bd3": "White will be happy to trade knight for pawn.  KxPd5, QxPf7+...",
        "21. cxd5+ Kxd5 22. Qxf7+": "Just like that.",
        "22... Kc6": "For white Qe6 permits NxPe5, provided black does not move the king.  Down 13 I'm running low on good moves for black.",
        "23. b4": "Instead of simply sacrificing a pawn white would have been better off moving Rac1 first.  Or better yet, Rhc1.  Ra could protect the a pawn for promotion.  Then Pb4 can't be taken until the king moves off the c file.",
        "23... cxb4 24. Rhc1+ Kb5 25. a4+ Ka6 26. Rc6+ Ka5 27. Qd5+ Bb5 28. Qxb5#": ""
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=57588",
    "gameName": "Let's play chess",
    "players": "dio911gt2 (1203) vs. mrp800 (935)",
    "opening": "Old Benoni defence (A43)"
}