{
    "moves": {
        "1. e4": "Ouverture classique.",
        "1... e5": "Réponse classique.",
        "2. Nf3": "Rien à dire...",
        "2... Nf6": "Cherche le jeu ouvert... aggressif?",
        "3. Nc3": "Je continue mon chemin tranquillement.",
        "3... Bb4": "Huh !? Pion gratuit? J'ai un doute, mais bon tant pis j'attaque!",
        "4. Nxe5": " 1.",
        "4... d6": "Prévisible...",
        "5. Nc4": "Retrait préventif...",
        "5... Bxc3": "Il mijote quelque chose... mais j'ai toujours trouvé que d'échanger mon cheval pour un fou étais à mon avantage dans la majorité des cas.",
        "6. dxc3": "ok. Tout va bien.",
        "6... Nxe4": "Tiens donc, il a reprit le pion.",
        "7. Bd3": "On va le forcer à bouger pendant que je déploi mes pièces.",
        "7... Qe7": "Pas mauvais.",
        "8. Qe2": "Moi aussi j'en une!",
        "8... Bf5": "Un embouteillage se forme...",
        "9. O-O": "Je vais essayer de doubler le rangée E.",
        "9... O-O": "Il a vu venir le coup... je doit faire attention... c'est un petit malin.",
        "10. Ne3": "Aller le fou tire toi!",
        "10... Bg6": "C'est bien ca... maintenant faut que je mette de la pression sur ca reine pour atteindre son cheval.",
        "11. Nd5": "Très bon, en plus il doit couvrir c7 pour ne pas perdre sa tour.",
        "11... Qd7": "Attention à la tour en e8 qui pourrait menacer ma reine.",
        "12. Bxe4": "Bon c'est fait pour le cheval.",
        "12... Re8": "Bon coup, mais c'est maintenant qu'on va voir si tu joues bien...",
        "13. f3": "Je libère ma reine. Je pense qu'il va essayer de mettre de la pression avec son pion en f5...",
        "13... f5": "Excellent!!!",
        "14. Qc4": "Ah ha! Et la beauté ici c'est le cheval qui peu mettre aussi échec (double échec).",
        "14... Qf7": "Et voilà la déscente aux enfers.",
        "15. Nf6+": "Et hop sacrifice du cheval... pourquoi? Il faut regarder le fou e4 - b7... hehe ",
        "15... Kf8": "Ah surprennant, mais j'avais aussi envisagé... il pense peut-être que je ne suis pas du type à échanger les reines... pouah!",
        "16. Qxf7+": "Tiens toé! Dans les dents, et je suis pas sur qu'il voit ce qui va lui arriver.",
        "16... Kxf7": "Pas vraiment le choix, hein? Il pense toujours pouvoir mettre de la pression sur mon fou... ",
        "17. Nxe8": "Merci pour la jolie tou-tour... ",
        "17... Kxe8": "Et tous ca pour...",
        "18. Bxb7": "Ca!!! Rien à faire tu as perdu... ah ben oui il résign.\r\n\r\nBravo à moi!"
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=17286",
    "gameName": "Let's play chess",
    "players": "cyberitch (1466) vs. agentsparrow (1515)",
    "opening": "Petrov three knights game (C42)"
}