{
    "moves": {
        "1. e4 c5": "I have started using c5 recently and found it to be a very good reply from black.",
        "2. Qf3 Nc6": "At this stage white has developed the queen early while black is developing its knight.",
        "3. c3 Nf6 4. Bc4": "The development of the major pieces continue. There is hardly any movement of pawns.",
        "4... Ne5": "Attacking move from black. The knight forks the queen and the bishop. I was expecting Qe2 as the reply from white.",
        "5. Qe2": "as expected.",
        "5... d5": "More attack in the form of another fork -- this time forking the pawn and the bishop. ",
        "6. Bxd5": "This seems to be a logical reply from white. Another move that could be evaluated would be bb5+ which might even have been better.",
        "6... Nxd5 7. exd5 Qxd5": "Now black has developed a potent attack.",
        "8. Nf3": "White is threatening to drive the knight at e5 away.",
        "8... Nd3+": "Nd3+ ! ... This might be the best move of the game from black. Instead of moving away the Knight take a threatening square",
        "9. Kd1 c4": "Re-inforcing the Knight.",
        "10. Ne1": "White tries to drive away the knight again. I did not want to move the knight away and wanted to keep pressure using major pieces. The next logical move was ...",
        "10... Bf5": "Bishop to the support !",
        "11. f3": "White is in a cramped position with all its major pieces stuck away. Black has all the initiative.",
        "11... e6 12. b4": "White tries to free its King side pieces . This move looks very dubious to me as the e.p pawn capture would be protected by the queen. \n\nTo add to this -- the White king is open to checks.",
        "12... cxb3 e.p. 13. a4 b2": "The pawn is now threatening to take at least one major piece !",
        "14. Bxb2": "I was thinking of taking the Bishop with my knight with Nb2+. But then on second thoughts I realized that re-inforcing the threat with the white queen could be even more dangerous for white ! ",
        "14... Qb3+ 15. Nc2 Qxb2": "White has very limited options now.",
        "16. Qxd3": "That is a blunder ! -- white misses the Bishop at f5.",
        "16... Bxd3 17. Nba3 Bxa3": "The game is pretty much over here -- the next moves are pretty much forces upto the checkmate.",
        "18. Ke1 Qxc2 19. Kf2 Qxd2+ 20. Kg3 Bd6+ 21. Kh3 Qh6+ 22. Kg4 f5#": "A nice game."
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=23843",
    "gameName": "Let's play chess",
    "players": "mazrah (1325) vs. tosuraj (1321)",
    "opening": "Sicilian defence (B20)"
}