{
    "moves": {
        "1. e4": "1.e4 one of the strongest moves in the opening,opens lines for the bishop and Queen,the pawn keeps a check on d5 and f5.if d4 where allowed to be played at a later date then a strong center control would be achieved.",
        "1... c5": "1...c5 the Sicilian response to 1.e4 this means black intends to make a fight of it,there is a huge amount of theory behind this move and can take a life time to learn the many variations and themes.\n",
        "2. Nf3": "2.Nf3 develops a piece the old rule Knight's before Bishops here,the knight has a good post here looks to the d4 square e5 and g5 just to name a few good spots.the knight can support an eventual d4 pawn advance spring into action at a moments notice to g5 hitting the black kings f7.",
        "2... d6": "2..d6 opens up a flight for the white squared bishop on c8 to possibly spring to a pin on g4 if the white knight were to remain on f3,the move played supports the c5 pawn but does expose the black king a little\nnot that this is to much of a problem for black as the knight on b8 can be played to a favorable square such as Nc6,or the bishop could be played to Bd7 if a check is delivered by white via Bb5+.",
        "3. d4": "3.d4 now states whites intention to try and make a claim to the center,this is a good move it is well supported by the Queen on d1 the Knight on f3.\nthe move played by white also has the added bonus of opening a line for the black squared bishop on c1 this now to the trained eye shows a control of the g5 square on the white king side which is now monitored by the bishop on c1 and the knight on f3.\nlook a little deeper and one can see that the white Queen has the possibility of been placed on d3 or c2 when the c2 pawn moves afforded as such by the pawn cover given by the pawns on d4 and e4.\nLook even deeper and you will see the Knight on b1 can be played to d2 giving further support to the e4 square and the f3 knight if the present f3 knight were to be captured it could be quickly replaced by the d2 knight.",
        "3... cxd4": "3..cxd4 standard move in this opening black wants to break up that center grip by white, and by doing so creates a semi half open C file from where black can at some point if white does not keep him in check can launch an offensive.",
        "4. Nxd4": "4.Nxd4 best response here for white as the pawn has to be retaken, if the Queen was to have taken the pawn then this would only facilitate blacks development as he may respond with 4...Nc6 chasing the queen away and resulting in white loosing a tempo.",
        "4... Nf6": "4..Nf6 this move at first states the obvious attack on the e4 pawn,but more of importance is it's ability to keep a watchful eye on the g4 square along with it's comrade the bishop on c8.\nFurther to this it looks to the cover of the d5 square for a possible future push of the d6 pawn or even just keeping an eye on the d5 square to prevent white gaining an outpost there in the future.\nFurther to this by playing 4..Nf6 it develops a minor piece which in chess you need to develop as many men as quickly as possible,the more pieces developed in the arena the better.\nHence the saying one man does not make an army. ",
        "5. Nc3": "5.Nc3 this keeps in with the developing of ones pieces rapidly in the opening,the knight now on c3 provides well needed protection of the e4 pawn.We now have the knight on c3 and the pawn on e4 keeping guard on the d5 square,both of White's knights now keep a watch on the b5 square and lastly the knight now been on c3 covers the a4 square in White's camp in case of a later possible incursion by blacks bishop or queen.",
        "5... a6": "5..a6 Solid move by black the 2 white knights are looking a little menacing along with the bishop on f1, 3 pieces of white raining down on the b5 square into blacks camp and the exposed black king on the a4-e8 diagonal.\nlet's take stock here WHITE has open lines for it's 2 bishops, both knights are developed, and a half open D file.\nBLACK has the half open C file a knight developed and open lines for it's bishop on c8 and queen on d8.\n\nIf black had not played 5...a6 then white had the possibility of a check on b5 developing a piece with attack gaining a tempo resulting in forcing black to respond to the check! by white achieving that goal \nit would of left the opportunity for white to castle later due to the absence of the bishop in it's present position on f1.",
        "6. f3": "6.f3 i do not like this move it creates a draught around the white king by breaking his pawn cover,\n6.Be2 would of been better here freeing space so white can castle and keeping a watchful eye on d1 to g4 diagonal.",
        "6... e5": "6...e5 this move stakes a claim in the center attacks the knight and keeps a hold on the c5 outpost.\nthe pawn on d6 is still protected by the Bishop on f8 and Queen on d8",
        "7. Nb3": "7.Nb3 the only real good square to retreat to! if the knight was played to 7.Nf5 and if black played 7.. Bxf5 then we would have doubled pawns after 8.exf5",
        "7... Be6": "I like this move 7..Be6 gives support to the d5 square if black wanted at a later stage to push the pawn to d5,frees the c8 square up for the Queen to shuffle across to if so required.Keeps a hold on the g8 to a2 diagonal,and defends the f7 square.and still looks to the c8 to h3 diagonal.",
        "8. Be3": "8.Be3 good move develops another piece, one should develop as quickly as possible.\nthis move now allows the Bishop to cover the g1 to a7 diagonal,the Knight on b3 and the newly developed Bishop keeps an eye on the c5 square.the Bishop now on e3 and Queen on d1 also the Knight on b3 hold the d4 square.The bishop on e3 now can drop back to f2 or g1 if needed,the bishop still controls the c1 to h6 diagonal.",
        "8... Be7": "8..Be7 clears the way for black to castle,increase of power on the d8 to h4 diagonal and if the knight moves from Nf6 the bishop could land there to attack on the h8 to a1 diagonal if white ever castles Queen side.",
        "9. Qd2": "9.Qd2 clears the way for white to castle Queen side,increases power on the c1 to h6 diagonal in case of black castling king side.After white castles Queen side the rook will land on d1 behind the Queen giving support on the d1 to d8 file.The Queen on d2 also keeps an eye on the g2 square,the queen could move to f2 then g3 or h4 to prepare for action on the king side. ",
        "9... O-O": "9.0-0 good standard developing move here the rook is well placed if the pawn on f7 ever needed advancing.",
        "10. O-O-O": "10.0-0-0 as stated in notes on 9.",
        "10... Nbd7": "10...Nbd7 Excellent move the knight comes into action defends the Knight on f6 eyes the square c5and b6.\nIf the white Bishop on e3 was ever thinking of landing on b6 then it will think twice now the knight keeps a hold on the e5 pawn as well. ",
        "11. g4": "11.g4 when players have castled on opposite sides then the normal rule is who can attack first!\nhere white starts the ball rolling looking at the f5 and h5 squares,and hoping to roll with h5 with the Q Bishop combo raining down that side, and pawns rolling forward when the bishop moves from f1 the rooks could then connect behind the pawn storm so looking good for white plan wise.",
        "11... Qc7": "11...Qc7 puts a claim to the c file covers the pawn on b7,\n\nI would of played more like white here and made the following 11...b5, much more in keeping with preparing an attack on the newly castled white King.",
        "12. Kb1": "12.Kb1 a little early i would of looked to the following line of play.\n\n1. g5 Nh5 2. Kb1 b5 3. Nd5 Bxd5 4. exd5 Nb6 5. Na5 Nxd5\n6. Qxd5 Qxa5 7. Bd3 g6 8. Rhg1 Qc7 9. Be4 \n\n",
        "12... b5": "12..b5 this is what should of been played at move 11... blocks the bishop on f1 getting in on the action marches on the white king and applies a little pressure on the Queen side.",
        "13. h4": "13.h4 white starts the task of attacking on the King side here i would of played the following 13.g5\n\n[ 13. g5 Nh5 14. Nd5 Bxd5 15. exd5 Nb6 16. Na5 Nxd5 17. Qxd5 Qxa5 18. Bd3 ]\n\nbut moved played is still good black has to react and fast.\n",
        "13... b4": "13...b4 puts the question to the knight and moves closer to the attack, if white played the following\n\n14. Nd5 Bxd5 15. exd5 Nb6 16. Bxb6 Qxb6 i think black would stand a little better positionally.",
        "14. Ne2": "14.Ne2 whites first mistake! and gives black an advantage here positionally better would of been \n14. Nd5 Bxd5 15. exd5 Nb6 16. Bxb6 Qxb6\n\nThe night move 14.Ne2 looks like a sign of weakness from e2 the knight is out of forward battle placement on the back foot so to speak, he cannot return to c3 or d4 or f4 he can relocate if needed to c1 and jump to g3 for help on the king side attack but black is now raining down on the Queens side with 2 Bishops Queen and rooks can come into play very fast now. ",
        "14... a5": "14..a5 good move continues the attack on the Queen side and is set for a4 and ousting the knight on b3\n",
        "15. h5": "15.h5 when there is reaction on one wing it follows if prudent to do so on the opposite wing from the opponents point of view.It is a case of who gets there first.\n\nI would of played the better 15.g5 which would give white better chances.\n\n\n15. g5 a4 16. Nbc1 Nh5 17. Bh3 Rfc8 18. Nd3 b3 19. cxb3 axb3 20. Rc1 \n\n\n",
        "15... a4": "15...a4 puts the question to the knight! and continues the Queen side assault.",
        "16. Nbc1": "16.Nbc1 the only real square to go to if 16.Na1 one possible out come that is of advantage to black is...\n\n16. Na1 d5 17. g5 dxe4 18. h6 Rfd8 19. gxf6 Nxf6 20. Qe1 Rxd1+ 21. Qxd1 \n\n",
        "16... b3": "16...b3 good move gets right into the white camp first! blacks rooks are connected,and blacks bishops raining down on whites position.\nAnother move / line worth looking at for black is the following.\n\n16... d5 17. Bh3 dxe4 18. g5 exf3 19. gxf6 Nxf6 20. Rdg1 Bxh3 21. Rxh3 Rfd8 \n\n ",
        "17. cxb3": "17.cxb3 mistake here \nBetter to have played the following with = chances\n1.g5 Qxc2+ 2.Qxc2 bxc2+ 3.Kxc2 Rfc8+ 4.Nc3 Ne8 5.Bh3 Rab8 6.N1e2 Nb6 7.g6 Bxh3 8.Rxh3 hxg6 9.hxg6 fxg6 10.b3 Nc7 11.Rg3 Kf7 12.Rdg1 axb3+ 13.axb3 d5  \n\n\n\n",
        "17... axb3": "17..axb3 blacks plan is solid here attacking the white kings pawn cover.",
        "18. a3": "I would of been of a mind to play the following\n18. g5 bxa2+ 19. Ka1 Ne8 20. Nc3 Qb7 21. Bh3 Nb6 22. Bxe6\nfxe6 23. Bxb6 Qxb6 24. h6 g6 \n\n",
        "18... Rfc8": "18..Rfc8\nNow the rooks come into play and start to mobilise the troops for the assault on white.\nblack now has a good positional advantage here",
        "19. Nc3": "White feels the pressure here and makes another weak move but having said that there are no  strong moves left to make, perhaps slightly better would of been 19.Qc3 with the hope of swapping off queens reducing blacks attack.But white is grasping at straws with swapping queens, as if i where black i would not trade the Queens.",
        "19... d5": "Nice move by black opens the diagonal f8 to a3 for his Bishop to rain in on whites weak position and threatens d4 with a fork later....",
        "20. g5": "20.g5\nWhite clings on to the hope of stabbing at the Black king side, but his Rooks are not connected due to his bishop stuck between them on f1",
        "20... d4": "As predicted in previous move comment, it is all over baring the shouting for white his empire will soon fall.",
        "21. Nb5": "Total blunder under pressure here, white is lost but to make a better defiant show of it perhaps\n\n21.Bxd4 or 21.gxf6\n\nI can see whites thoughts chase the queen hope to save the bishop, but it just let's blacks iron grip on the position increase.",
        "21... Qc2+": "And black gives the punch to the face square on.",
        "22. Ka1": "22.ka1 the only move! as 22.Qxc2-bxc2+ and the rook drops as well",
        "22... Bxa3": "Whites position crumbles!",
        "23. Nxa3": "23.Qxc2 with a little more defiance perhaps.",
        "23... Rxa3+": "23...Rxa3 our Team player now shows the art of striping the kings defences wide open!",
        "24. bxa3": "24.bxa3 the only move! white flag should of been raised here....",
        "24... b2#": "24..b2#  good luck in the after life a nice game.Unlucky for white but he will fight another day.\n\nBeen a pleasure going through this game as requested by my team mate Steph32\nOur team puzzle presenter."
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=56919",
    "gameName": "Let's play chess",
    "players": "mrphelps (1758) vs. steph32 (1693)",
    "opening": "Sicilian (B90), Najdorf"
}