{
    "moves": {
        "1. d4 Nf6 2. c4 e6 3. Nc3 Bb4 4. Bd2 Bxc3 5. Bxc3 d5 6. e3 Nc6": "i dont think this opening is as smart as i thought it was (white). putting the bisohp on d2 (move four) wastes time that could be better spent putting a bishop on d3 or developing the other knight.",
        "7. Nf3 Ne4 8. cxd5 exd5 9. Bb5 Bd7 10. O-O": "herre however i've got both bishops pointing at the same wing (which helps)and if the knight on e4 decides to take c3, then i gain time and a solid central pawn structure. infact for white losing the (very inactive) black bishop for the annoying black knight would be really helpful!\n\non the downside for white, this looks like a fairly inopertune moment to castle, as all whites play is blockaded, and cannot reach the kingside in defence quickly",
        "10... O-O 11. Qb3 Nxc3": "I'm unsure of the motivation for this move, and think it's a mistake. the knight can hang on there for a while perfectly well and is useful in protecting g5 (after 11. ..., be6, white cannot play the annoying Ng5) and similarly White's black bishop cannot really move anywhere useful (due to the stopped pawn on d5) and not be attacked (e1 is a possibility but accomplishes little more than does c3- with the only proviso that it's now not attacked and will not become useful if the centre breaks. similarly this move looses territory, and gives white a stronger center after bxc3",
        "12. bxc3 Re8": "this again confused me, putting the rook on the half open file seems to make sense, however perhaps not at the expense of the d pawn. i was woried there was some sort of queen trap but couldnt see one past b e6 as the queen swap is fine for white (swapping two tempo for one pawn)\n",
        "13. Qxd5 Rb8": "this again wastes valuable time that could be spent attacking - the idea is to free up the knight to go to e7! presumably, though this cannot be played whilst the white bishop is on b5 anyway (loosing the bishop on d7) wouldn't pushing the bishop away with a6 have been more prudent? or similarly protecting the bishop with the e-rook so as to gain some more active rook play in the exchange.",
        "14. Ng5": "the anoying move finally gets played, white is building pressure on the kings white squares, some of which would have been averted by Re7 previously",
        "14... Qe7 15. a4 a6 16. Bc4": "this move i think is actually bad, it is too easy to defend f7 at the moment and it now takes the bishop two moves to get to a useful square rather than one. an imediate Bd3 would have been more sound (giving the knight the option of e4)",
        "16... Ref8": "black takes the necessary precautions",
        "17. Bd3 g6 18. Nf3": "perhaps Ne4 would have been more interesting here but whites quen is geting alittle claustrophobic",
        "18... Be6": "some attacking play - but like all attacks it creates a weakness. in this particular case the knight on c6 and/ or the a pawn",
        "19. Qe4 Rfd8": "whilst this move lookes logical it does not defend the weakeness that was created on the previous move, leaving white to snatch a pawn and knight for a bishop - though i did wonder for a good while if the bishop might not have been more useful i played safe. whites position is solid and a two pawn lead and even simplification cannot be to bad of a thing when you're a pawn ahead",
        "20. Bxa6 Bd5": "not the move white was expecting but it is perhaps worse than Bxa6, as black no longer gets an open file all to himself and exchanges queens! which has to be more damaging to his attacking prospects than an exchange of bishop for knight",
        "21. Qxe7 Nxe7 22. Be2 Be4 23. Ng5 Bc6": "i thought for a while that black would play f5 here,  to halt whites pawn advance, though obiously that leads to white pinning the king and rook with the knight on eithe rf7 or e6. the problem with the bishop moving to this square is that Bb5 now lets white either simplify and connect his a pawn with the others or gain a tempi. Though white did miss this.",
        "24. a5": "Bb5 is better.",
        "24... Nf5 25. e4 Nd6 26. d5 Bb5": "i think the rule is \"when attacking exchange pieces, when defending exchange pawns\" and in this situation i cannot help but a gree, using the b and c pawns   rather than moving the knight and bishop around may have been more helpful for black, though i haven't checked thouroughly",
        "27. Bxb5 Nxb5 28. Rfc1 h6 29. Nf3 Kg7 30. c4 Nd6 31. e5 Ne4": "a truely brilliantly irritating place to have a knight. this is where i (white) guessed that i was in for the long haul, perhaps more acurate on white part would have been to put the rooks behind the central pawns though i think the fear of a knight fork at this point in the game stopped me from doing it",
        "32. Ra2 Nc5": "the knight doesnt' need to move immediately! Re8 causes more pressure.",
        "33. h4": "when the advance doesn't seem to be going anywhere too quickly why not try the other side?",
        "33... Rde8 34. Rc3 Ne4": "a mistake, the night can be pusher back immediately after Re3 and white has his rook behind one of the central pawns and secured by a pawn, meaning that he doesn't need to use another of his pieces securing the rook.",
        "35. Re3 Nc5 36. Nd4 Rbd8 37. Nb5 Re7 38. d6 cxd6 39. exd6 Re4": "this i dont understand. wouldnt' black have been better off doubling rooks on the D file? perhaps the point is that white will take the rook and then Nxe4 both attacks the d pawn and prevents the other rook from protecting it, however white has a6! in that case black is obiged to take the pawn (else it can waltz right down the board) and white can match black's attack in defense and has time to play f3 to displace the knight before black can get his king involved",
        "40. Rc2 Rxe3": "this really makes less sense if black wanted to swap rooks then he should have done it last move.",
        "41. fxe3 Rd7 42. Ra2 Ne4 43. a6 bxa6 44. Rxa6": "the position predicted at move 39 arises with a slight change, now white cannot play f3 to displace the knight and is in real danger of going down to a single pawn lead.",
        "44... Kf6 45. Rc6": "white solves most of his problems by allowing the C pawn to come to aid in the defense of the d pawn.",
        "45... Ke5": "this move is a little questionable, perhaps black would have been better sending hsi king round the other way as none of the squares it can now occupy are \"safe\" or particularly obstructive for white's plans",
        "46. Rc7": "a sensible move, expecting Rd8 as a reply",
        "46... Nc5": "a disaster.",
        "47. Rxc5+ Kf6 48. Rc7 Ke6 49. c5": "and with that white is guarunteed the win. black must exchange else Nd4+! wins the rook and Rd8 leads (via c6) to a position whereby black must exchange the rook for (at best!) two of the pawns or the knight",
        "49... Rxc7 50. Nxc7+": "(better not to double the pawns if you have the time",
        "50... Kd7 51. Kf2 Kc6 52. Nd5": "the king can march all the way if he wants to make things easier, black taking on either C or D allows the d pawn to promote",
        "52... h5 53. Nf6": "black cannot prevent the d pawn marching forward another space into the protection of the knight forcing Kc7, C6 and one of the pawns promotes"
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=26096",
    "gameName": "Let's play chess",
    "players": "crazyeye180 (1614) vs. chessbum (1505)",
    "opening": "Nimzo-Indian defence (E20)"
}