{
    "moves": {
        "1. e4 e5": "An opening experiment; I usually play the Sicilian. In this game I prepare to defend against the Ruy Lopez.",
        "2. Nf3 Nc6 3. Bb5 a6 4. Ba4 Nf6 5. O-O b5": "The Archangelsk variation. Black neither takes the pawn nor commits his bishop to e7.",
        "6. Bb3 Bb7 7. Re1 Bc5": "The Möller Defence. The dark bishop is developed to an active square, but there are two drawbacks, both of which are illustrated in this game. The bishop serves as a target as white pushes into the centre, and black ends up with a backward c-pawn.",
        "8. c3 d6 9. d4 Bb6 10. h3": "Bg5 is also possible.",
        "10... O-O 11. Bc2": "Now that black has castled, the bishop switches to the new diagonal.",
        "11... h6 12. Be3 Re8 13. Nbd2 Nb8": "Black plays to pre-empt d5 followed by an exchange of dark squared bishops which would double his pawns (though he might have the better bishop as compensation). The knight aims to regroup via d7.",
        "14. d5 Nbd7 15. Nf1": "Aiming for g3, a regrouping allowed by the relief of pressure on e4. The subsequent threat of Nf5 was a theme of much of the middle game.",
        "15... Nc5 16. Ng3 c6": "Trying to solve the problem of the backward pawn on c7. However this only creates more pawn weaknesses, at d7 and shortly also on the a-file. Ultimately these will decide the game.",
        "17. b4 Na4": "This looks precarious, and was probably bad. I had calculated the immediate results, but the a-file pawns eventually proved an important weakness.",
        "18. Bxa4 bxa4 19. c4 cxd5": "Fixing the weakness at d6.",
        "20. cxd5 Bxe3": "The intention of this was to draw the rook off the back rank, giving my own rooks first bite at the c-file, but this was not effective.",
        "21. Rxe3 Qd7 22. a3 Rec8 23. Rc1 Rxc1 24. Qxc1 a5 25. bxa5 Rxa5 26. Rc3 Ra8 27. Nd2": "If 27 Rc7,  then ...Rc8 and white has nothing better than the exchange of rooks.",
        "27... Rc8 28. Rxc8+ Bxc8": "Black's position is not comfortable here. White's knights will prove stronger than his bishop and knight, and besides d6 the advanced a-pawn is an additional weakness.",
        "29. Qc2 Ba6 30. Qc3 g6": "Preventing white pressurizing d6 from f5.",
        "31. Ngf1": "The knight is accordingly redeployed.",
        "31... Ne8 32. Ne3 Nc7": "Intending to pressurize a3, but black should be defending.",
        "33. Qb4 Bb5 34. Ndc4 Ne8 35. Nb6": "Black has been completely outmanoeuvred."
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=4286",
    "gameName": "Let's play chess",
    "players": "immmmm (1712) vs. orangutan (1702)",
    "opening": "Ruy Lopez (C78), Archangelsk (counterthrust) variation"
}