{
    "moves": {
        "1. e4 e5 2. c3 Nf6 3. Nf3 Nc6 4. d3 d5 5. exd5": "\n",
        "5... Qxd5": "Bringing one's Q out early is 98% of the time BAD-BAD-BAD.",
        "6. Be2 Bc5 7. O-O O-O 8. h3": "ANY move of the 3 castle P's weakens the position. Try not to do so unless really necessary. When your opponent does this, try to get a R or Q on the N-file and your B can take h3 (as K is pinned). ",
        "8... Rd8 9. Nh2 b6": "Not the best. Your black B is nicely placed on his K diagonal, and b6 allows b4, chasing your B away (while b3 could have been a fall-back square). Also, with the threat of Bf3 (which was why we must assume he moved his N to such a lousy place), your Q would have to move, and b6 unprotects your N as well. Yes, it would have been nice to fianchetto, but your B was already well placed attacking his h-pawn.",
        "10. b4 Be7 11. c4 Qd4": "Good!",
        "12. Nc3": "Wrong move. He could have saved the R without a sacrifice!  So you can figure it out for yourself, I'll put the right continuation in the next move.",
        "12... Qxc3": "Go back to 11. ... Qd4 and look at 12. Qb3. Now you can't take the R!  It highlights the secondary reason why it's bad to move the Q out early, and that is frequently it can be trapped with so many pieces still on the board. The primary reason masters practically NEVER bring a Q out early is that it allows the opponent to just threaten the Q continually with minor pieces and pawns, thereby developing his position while the Q is forced to run around. Anytime your opponent brings out his Q, look to do just that--attack his Q while  developing--and also look to trap his Lady. Sometimes you'll note he has only 2 or 3 squares to go to, and you can deploy a piece to cover those squares before he realizes he's in trouble (that is, sometimes you have to plan and \"create\" the trap!).",
        "13. Bd2 Qd4 14. a3 Bf5": "Good. Develops and attacks at the same time... just what you want to do whenever you can.",
        "15. Be3 Qd7 16. Qb3 Bxd3": "This was risky, as 9 out of 10 times your opponent will pin the B against your Q (as he does here). YOU HAVE TO LOOK OUT FOR THOSE, as you could easily have lost the B. Note that it is also a nice trap, and I've done it deliberately many times (that is, allow your opponent to have one more attacker than defender on a piece, and then when he takes it with a B or N, you pin it and win it--it happens all the time!).",
        "17. Rfd1 e4 18. Bf1": "I don't understand this. f3 had more potential to give you problems...",
        "18... Qe6": "Correct, unpinning the Q, but you have to give the P back.",
        "19. Bxd3 Rxd3 20. Rxd3 exd3 21. Qxd3": "Note the position here. Aside from being a piece up, you have 4 pieces developed, he basically has 2 (as the N is so far out of position). This SIGNIFICANTLY weakens his offensive and defensive capabilities, so 2 things come to mind. Try to take advantage of this quickly (like a hockey game power play when the opponents are one man short), and also try to keep the N in the bad place if you can (sometimes putting a B on the diagonal he can move to works, or sometimes you just have to advance one pawn and he's stuck). This annotation is a lesson in occasionally studying the strategic, not tactical, position. Also, though it's not a factor here--as the pawn structure is OK for both--but strategic assessments usually focus more on pawn structures (i.e., taking advantage of--or creating!--isolanis, doubled pawns or passed pawns).",
        "21... Rd8": "Good. Develop and attack simultaneously.",
        "22. Qc3": "Another strategic note here... his black B is wonderfully placed; yours not as well so. His black B is therefore worth more, so to speak. Thus, Ne4 (harrying his Q, which is usually a good thing to do) followed by Bg5 would allow you to chase his black B away from its nice perch, or to exchange it. Note that an exchange is in your favor, as his B was better placed. You can think of the exchange as worth maybe a tenth of a point in your favor. All these tenths of a point (like creating an opponent's isolani or doubled P, or exchanging a c/f  P for a d/e P) add up and frequently decide a game (especially in master play).",
        "22... Nh5": "Sometimes it's necessary, but as a general rule try NOT to put your N on the edge of the board if you can at all help it, or unless it gives you some advantage QUICKLY. Note that a N on the edge only has 4 squares to move to, while when it's centralized it has 8 possible squares. Thus a N on the edge is literally HALF as powerful! Another real danger is that if your opponent puts a Bishop 3 squares straight out from the N (e5 here) then the N can never move (unless otherwise protected). This is frequently a big factor--and a trap--in end games (when the N has nothing else to protect it).",
        "23. Re1": "Good. Do this whenever you can (i.e., putting a R on the Q-file), as it almost always gives your opponent problems.",
        "23... Qf5": "Its good that you moved your Q (or else he had Bxb6 and then Bxa7, which could have lost you the game), but f5 was the wrong square. You have to have a \"sixth sense\" about putting 2 pieces on the same row 2 squares apart WHEN PAWNS ARE AROUND TO THREATEN BOTH OF THEM!!!  This is a \"MUST REMEMBER\"--burn it into your chess RAM, so it's always there.",
        "24. g4": "There is a way to save your N!  I'll mention it next move, but look for it here...",
        "24... Rd3": "Good. Develops and attacks both Q and RP.",
        "25. Qc1 Qe5": "Wrong, for 2 reasons.\n1.  Try NEVER to move your Q \"INTO\" a pin!!!  With this move he can move his black B anywhere for FREE and do ANYTHING, as you're forced to move your Q in reply. The most dangerous result is he gives a check and you lose your Q; 2d worst is he takes a major piece for free; 3rd worst is he gobbles up something else (here he can win your b and a pawns).\n2.  Qg6 would have saved your N.",
        "26. gxh5 Qxh5 27. b5 Ne5 28. Qc2": "Not good. His Q was nicely covering his R, B and RP, and now it covers none of them--noticeably weaker. You were right to take the RP in reply.",
        "28... Rxa3 29. Bf4 Bd6 30. Qb2": "Your next move here is correct (I think, with limited review). You had 4 nice offensive moves: RxP, Nf3+, NxP and the beautiful triple-fork at Nd3, but they all seem to have problems with a back-rank mate (or cost you a piece). So, f6 was a good defensive reply. It's not great, as it gives you an isolani, but it does have 3 advantages: 1) it gives the K an escape square; 2) it allows your Q to protect e8; and 3) it removes his B from protecting his N (which could/should become significant later as you should eventually take his RP).",
        "30... f6 31. Bxe5": "Correct. Your N was VERY powerful where it was, so this exchange was maybe worth a quarter-point for him.",
        "31... fxe5 32. c5": "A missed opportunity here, perhaps. Instead of BxP next, better here might have been RxP (threatening RxN, and then Rh1+ and Qh3#). If he takes the B now, then after RxN he is in serious danger of being mated, so he is therefore \"likely\" to move his f-pawn, probably to f4 I'd think (note that he can't move the N either without getting mated). This then allows:\n33.\tf4\tBxc5+\n34.\tKh1\tQf3+\n35.\tQg2\tQxg2+\n36.\tKxg2\tRb3  (wins another pawn)\n37.\tfxe5\tRxb5\n38.\te6\tBe7\n... and now, with 3 connected passed pawns, you have an easy win. I said \"likely\" above because there is one better continuation for him (but a player at his level could easily not find it): Qb3+ and then Qd5. So RxP isn't a guaranteed win, but it was a very good chance. As a minimum--at no loss of material--it eliminates two pieces in front of his K and gives you current and future mating chances.",
        "32... Bxc5 33. Rxe5": "Instead of Qg6+ next, how about:\n33.\t...\tRg3+\n34.\tKf1\t            forced, or else Qd1+ mates\n34.    ...     Qxh3+    winning a pawn\n35.\tKe2\tRg2        this should win the N also",
        "33... Qg6+ 34. Kh1 Rxh3 35. Qa2+ Kf8 36. Qd2": "36. ... Bd6, pinning his R and threatening Rxh2# (if he moves his R away), was powerful next. Note that if he tries Rg5 you have mate in 3 (I'll leave that for you to find).\n     Now that I look at it a bit longer, another possibility is a rook sac: RxN, KxR, and then Bd6 locks his R in place. If he tries to check you with his Q he'll lose the R outright. His best move (which he may not find) seems to be f4, and then you win the exchange back. Then, after Qe5+ you can win his e-pawn and then it's 5 pawns for you to 1 one pawn for him. Unfortunately, if he plays right he can win your c and then a pawns, but that's a big \"if\", and you'd still have a pretty straight forward win. I think I like the first option above better. The 2d clears all the minor pieces--something you want to do when you're 3 pawns up--but the 1st choice should simply win the exchange, and then you're 5 points ahead.",
        "36... Be7 37. Qf4+ Qf7 38. Qg4 Rh4 39. Qc8+ Qe8 40. Rf5+ Bf6 41. Qb7": "If he had taken your c-pawn you had Qe4+, winning his R.",
        "41... Kg8 42. Qf3 Be5": "Nice thought, but a mistake. It's not enough to analyze the board where the pieces are, you ALSO have to analyze the board where the pieces WILL BE after every possible check, or attack on your Q, or discovered attack, etc.  In particular, you have to look at every possible \"check\" coming up, so this was really foreseeable.\n    \"More better\" here, much mo' better actually, would have been Qe1+ and then Qe4, pinning and forcing a trade of Q's--a VERY good thing for you. This reinforces the concept of looking at \"every possible check\" pretty much EVERY move (as even subtle position changes can lead to a whole different result!).",
        "43. Qd5+ Kh8 44. Rxe5 Qf8 45. Rf5 Qe8 46. Rf3 h6 47. Qd3": "You still had a very decent chance to win this. After his planned Rh3, an exchange of rooks would have let you capture his b-pawn, and with that capture I think you have the winning position!"
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=33877",
    "gameName": "Let's play chess",
    "players": "giuseppe-five (1452) vs. austin_p (1306)",
    "opening": "KP (C20), Lopez opening"
}