{
    "moves": {
        "1. f4 d5": "I usually answer 1.f4 with the Grob (1...e5 2.fxe5 d6), but I wanted to try something new.",
        "2. Nf3 c5 3. e3 Nc6 4. Bb5 Qc7": "!? I was not willing to get doubled pawns here. In retrospective, I think that a \"normal\" move like e6 or Nf6 would have made more sense.",
        "5. O-O Bg4 6. c3 g6 7. Qa4": "Trying to give me doubled pawns once again, but I won't oblige to my opponent's plan.",
        "7... Bd7 8. Bxc6": "?! This move gets rid of his 'good bishop' for one of my knights, and on the long diagonal my bishop will have a lot of attacking potential if I can play d4.",
        "8... Bxc6 9. Qc2 Bg7 10. d4 e6 11. Nbd2 Ne7 12. e4": "!? With my king in the center and his king safely castled, my opponent tries to open the board. However, this move allows me to open some diagonals for my LSB and my Queen.",
        "12... cxd4 13. cxd4 dxe4 14. Nxe4 O-O-O": "!? A move that I played, hoping I could march my kingside pawns forward. 0-0 looked like a safer alternative, but I wanted to have the rook on the open file.",
        "15. Ne5 Nf5": "!? Defends f7 and threatens to take the weak d4 pawn, but allowing 16.Nxc6 Qxc6 17.Qxc6 bxc6 on the process, leaving me with a weak pawn structure on the Queenside.",
        "16. Nxf7": "? Exchanges a piece for a pawn with no compensation. ",
        "16... Qxf7 17. Ng5": "? Blunders another pawn",
        "17... Bxd4+ 18. Kh1 Qf6": "My position has greatly improved, and almost all my pieces are eyeing down on the enemy king's position. Meanwhile, White's pieces are scattered across the board with no plan and his queenside is underdeveloped.",
        "19. Qb3 h6": "Trying to activate the h8 rook by opening the h file or by pushing this pawn up the board.",
        "20. Nf3 Bb6 21. Bd2 g5 22. Bc3": "Skewering my Queen and my Rook.",
        "22... Qg6": "! I spent some time checking for squares to keep my queen active, and after noticing Ng3 I decided that the queen had to be able to move to h5 in one turn. I ended up playing Qg6 instead of Qf7 because white now can't play Ne5 with tempo",
        "23. Bxh8 Ng3+": "!! Sacrificing the knight in order to start a mating attack against the enemy king.",
        "24. hxg3 Qh5+ 25. Nh2": "? Nh4 allows white to survive for a longer time, but I believe I still have a forced mate.",
        "25... Bxg2+": "! Another sacrifice to draw the king away from his hole. ",
        "26. Kxg2 Rd2+": "Thanks to the bishop sacrifice, the rook now comes down giving check and does not give white a chance to defend himself.",
        "27. Rf2 Rxf2+ 28. Kg1 Qxh2#": "0-1 Despite some inaccuracies in the opening and early middlegame, I'm quite proud of the final combination I got to play. "
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=57497",
    "gameName": "Let's play chess",
    "players": "pksharma12 (1330) vs. pauix (1396)",
    "opening": "Bird's opening (A03), Lasker variation"
}