{
    "moves": {
        "1. e4": "This was a standard game between two low-ranked players.",
        "1... e5 2. Bc4 Qh4": "An unusual (and doubtful) move. The only threat is Qxe4, which I easily blocked.",
        "3. d3": "A better defence might have been Nc3, developing a piece.",
        "3... c6": "Another eclectic move, which opens up no more space for black. If it was meant in a long-term defensive way, guarding against a push through the centre at d5, why play the queen so strangely?",
        "4. Nc3 Bc5 5. Nf3": "This, of course, allows Qxf2#. I had prepared Be3 as a response to Bc5, but forgot to play it! I would deserved to lose here, but luckily for me black missed the opportunity.",
        "5... Qg4 6. O-O": "Avoids the threat of mate.",
        "6... b5": "A reasonable move, pushing forwards and forcing me to defend.",
        "7. Bb3 a5": "Threatens 8... a4, trapping the bishop.",
        "8. a4": "My intention was to continue 8... bxa4 9 Nxa4, attacking c5 and preserving good development. At all costs I wanted to prevent 8... a4, trapping my bishop.",
        "8... b4": "A clever move, keeping up pressure on white's queen-side and forcing the knight to retreat.",
        "9. Ne2 d5 10. exd5": "Black's pawn storm was pushing me further and further back. I chose this moment to blunt his advance without sacrificing material.",
        "10... Qg6": "Black had been playing better since a strange first few moves, but here he slipped again, allowing me to win a pawn.",
        "11. dxc6 Nxc6 12. Bd5 Bb7 13. Nxe5": "13... Nxe5 14 Bxb7, winning another pawn. Of course, the Ne5 also threatens the black queen.",
        "13... Nxe5 14. Bxb7 Rb8 15. Nf4 Qf5 16. Be4 Qd7 17. Re1": "Building up towards a pin or discovered check along the e-file.",
        "17... Ng4": "?? Completely missing white's plan.",
        "18. Bc6+": "This was exactly the move I had hoped to be able to play. The black queen is now lost.",
        "18... Kd8 19. Bxd7 Kxd7 20. Qxg4+": "Forking g7, threatening to win the rook on h8.",
        "20... Kc7 21. Nd5+": "21... Kc6/d6 22 Qxg7, and black cannot take the knight without losing a rook.",
        "21... Kd6 22. Qxg7 Ne7 23. Qe5+ Kd7 24. Nxe7 Rhe8 25. Qxc5 Rbc8": "25... Rxe7 26 Rxe7 ",
        "26. Qd5+ Kc7 27. Bf4+": "At this point, I had a clear lead in both material and position. In the rest of the game I simply forced black's king further and further back to try and mate him.",
        "27... Kb6 28. Nxc8+": "28... Ka6 29 Qa8#",
        "28... Rxc8 29. Qb5+ Ka7 30. Re7+": "30... Rc7 31 Rxc7  Ka8 32 Qb7#",
        "30... Ka8 31. Qa6#": "Thank you for reading my annotation. Comments are welcome."
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=17164",
    "gameName": "Let's play chess",
    "players": "fish613 (1200) vs. rbrynaert (1223)",
    "opening": "Bishop's opening (C23)"
}