{
    "moves": {
        "1. Nc3": "This is my first annotated game please be patient with this EXTREME ROOKIE!I opened Nc3.The reason i did this because i am trying to develop my offense and most \"advice\" books i have been reading say you need to develope pieces to control middle.",
        "1... e6": "Here i thought the Lady was about to join the party.",
        "2. b3": "b3 this move was my beginning attempt to castle.",
        "2... d5 3. d4": "d4 my thinking was this.To Quote a famous chess player a pawn who gets by,is a criminal who should be in handcuffs.",
        "3... Bb4": "If you notice as the b4 move is made by my opponent i believe at this point my opponent is probing with pawns in middle of board.",
        "4. Bd2": "I move bishop to d2 to back up my knight.I knew i was going to lose my knight.",
        "4... Nc6 5. e3": "Here i was trying to develop my right side.",
        "5... Nf6": "Here my opponent is gaining control of middle.",
        "6. Nf3": "I bring my cowboy on right into play to meet in middle of street.",
        "6... h6": "here he comes on right",
        "7. g3": "Still developing right",
        "7... Bxc3": "Here is where it all goes down hill for me.I lose my knight.",
        "8. Bxc3": "I take out his bishop.I was thinking  of \"hooking\" around on my left",
        "8... Ne4 9. Qd3": "I bring my lady in play hopefully backing up his knight,this was a bonehead rookie move on my part.I forgot about pawn at d5.This was a wasted move for me.",
        "9... Qf6": "His lady coming on down to dance",
        "10. Bh3": "I move my bishop here thinking of castling.To little to late.Also here i should have noticed i getting boxed in",
        "10... Qxf3": "Beginning of final painful end.",
        "11. Qf1": "I bring lady down to backup king hoping to push back",
        "11... Nxc3 12. Qg2": "Foolishly i move lady here to push back.This was a quick nonthoughtout move.",
        "12... Qe2#": "And here the hiredgun goes down.Lack of developing my royal court as well as weak placement of pawns along with weak  foresight cost me this game.I did learn alot in game"
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=51589",
    "gameName": "Let's play chess",
    "players": "hiredgun112 (697) vs. mikejm (1304)",
    "opening": "Dunst (Sleipner, Heinrichsen) opening (A00)"
}