{
    "moves": {
        "1. e4": "In a game were I was trying to regain some rating points after some time-outs. I wanted to play Roy Lopez because I enjoy using classic Bishop sacrifice on h3 or the Berlin Defence",
        "1... e5 2. Nf3 Nc6 3. d4": "The Scotch. An opening I had little experience with but played with my initiative. ",
        "3... exd4 4. Nxd4": "Now my gut was 4... Nxd4 5. Qxd4 but I thought realised that Bc5 would put me ahead in development and also kept his Knight into Nd4 because of a Qf6 or Qh4 mating threat.",
        "4... Bc5 5. Be3": "Takes away the mating threat and protects the knight. I had never planned on making a serious mating threat on f2 but a mating threat no matter how simple must always have a plan to take care of it.",
        "5... Qf6": "This was to add another attacker of the d4 square and make black think about the mating threat",
        "6. c3 Nge7": "Allows me to castle",
        "7. Bb5": "I expected this. I wanted to force it off this square",
        "7... a6 8. Bxc6 Nxc6 9. Nf5": "I liked this move because it meant the bishop was under attack and meant the knight could attack from d4 at a later date when it was free from the bishops wrath. However this was the third time this knight moved in 9 moves and if not for the Bishop v Bishop I would have Been able to have castled and been up two tempos. However O-O was probably a weak mvoe as If the knight was sacrificed then my king is opened up. ",
        "9... d6": "A move that attacks and defends",
        "10. Qd5 Be6": "This gave me flexibility and meant all my minor pieces were developed and I could castle either side",
        "11. Qd3": "This stops 11... Bxf6 12.exf6 Qxf6 wins a pawn for black",
        "11... Bxe3": "Means That white has to double pawns or lose a pawn because of the combo In the annotation above",
        "12. Qxe3 Bxf5 13. Nd2": "He gave me a free knight",
        "13... Bg6": "I decide to keep my bishop alive",
        "14. Qf3": "Wants to trade Queens which is interesting because of 14... Qxf3 15.Nxf3 Bxe4 makes knight stay at f3 or move to h4 which means it is on a weak square to protect the pawn on b2 or risk going down by 5 points.Also if he plays 15.gxf3 forced him to castle queen because of half-open b-file. Although there is nothing wrong with castling Queen side because it controls the half open d file",
        "14... Qxf3 15. gxf3 O-O": "I castled king side hoping to attack the e-pawn with f5 in a few moves time and so Half open the f-file for my Rook and with No light squared bishop it means my king will still be safe.",
        "16. O-O-O Bh5": "Looking to attack both rooks with 17... Ne5 and 18... Bxf3",
        "17. Rde1 Ne5 18. Kc2": "Prevents 18... Nd3+ forking King and rook",
        "18... Bxf3": "A good enough move",
        "19. Rhg1 Ng4": "I have no idea what I was thinking here giving up my minor piece advantage and with two rooks on closed files I would be in a weaker position",
        "20. Nxf3 Nxf2 21. Ng5 h6": "I was looking to get rid of as many white pawns as possible considering I was already two pawns up with 4 on 3+ a king on the queenside side and 3 on 1 on the King side. The only weak link was the e-pawn.",
        "22. Nf3 Nh3 23. Rg3 Ng5": "If I trade Knights My pawn advantage should get me home",
        "24. Nxg5 hxg5 25. Rh1": "Clearly wanting to play\n26. h4 gxh4 27.Rxh4",
        "25... Rae8": "Makes him moves his Rook and develops my second rook",
        "26. Rg4 f5": "I thought he would play 27.Rxg5 and then I could play 27... Rxe4",
        "27. Rxg5 Rxe4": "He did",
        "28. Rf1": "I was quite happy to trade rooks but didn't want to lose a pawn for nothing",
        "28... Re2+": "Now I can gain the h-pawn for the lose of the f-pawn",
        "29. Kb3": "He wanted to involvve his king but however I could know trap his king on the queen side with a pawn storm.",
        "29... Rxh2": "But first I wanted to simplify the game",
        "30. Rgxf5 Rxf5 31. Rxf5 g6": "With the Queen side basically turning into a stalemate I knew the g-pawn would be my chance of victory.",
        "32. Rf6 Kg7 33. Re6 Kf7 34. Re4 g5 35. Ka3": "My opponent obviously didn't want to give up a pawn but this meant I could trap his king",
        "35... b5 36. b4": "I was happy with this as he was also playing apart in trapping his king",
        "36... Rh4": "Trading rooks meant I was a certainty to win",
        "37. Re1 c5": "If he captured my c pawn I would re-capture it and then complete my pawn storm",
        "38. Kb3 c4+": "The trap was set",
        "39. Kb2 g4 40. a4": "I am still confounded by this move as even if he does capture I re-capture and he still can't escape the queen side pawn trap",
        "40... g3 41. Rg1 Rh3 42. Rf1+ Kg6 43. Rg1 Rh2+": "Know this move I believed before this annotation won me the game because it kept his rook away from my pawn long enough to move it one square away from queening. If I waited for my king to arrive I thought his king could have come to the rescue but what would have happened was  43... Kg5 44. Kc2 Kg4 45.Kd2 Kf3 46. Ke1 g2",
        "44. Ka3 g2 45. axb5 axb5 46. Kb2 Kf5": "Know the race begins",
        "47. Kc2 Ke4 48. Kd2 Kf3 49. Ke1 Rh1": "The writing if not already on the wall is now on there in size 144 font, red, bold and underlined",
        "50. Rxh1 gxh1=Q+": "The mating combo would be",
        "51. Kd2 Kf2 52. Kc2 Qe1 53. Kb2 Qd1 54. Ka2 Ke2 55. Kb2 Kd2 56. Ka2 Qb3+ 57. Ka1 Qa4+ 58. Kb1 Kxc3 59. Kc1 Qc2#": "Please post if you have quicker mate"
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=37916",
    "gameName": "Let's play chess",
    "players": "eldominicano34 (1227) vs. thedessertfox (>1200)",
    "opening": "Scotch (C45), Paulsen attack"
}