{
    "moves": {
        "1. e4": "First game after a long period, almost after one year.",
        "1... e5 2. Nf3 Nc6 3. Bb5 Nf6": "Ruy Lopez, Berline Defense.",
        "4. O-O d6": "Main line was NxP, but as i was playing after a long period, so my view on the board was new and fresh, so instead following 'main line' stupidly, it is better a man should play with his own reasoning.",
        "5. d4 exd4 6. Qxd4 Bd7 7. Bxc6 Bxc6 8. Nc3 Be7 9. b4": "Whether Black should castle kingside now, but after Bb2 White's attack will be on kingside, B and Q directly attacking g7, if knight moves its checkmate.",
        "9... b6 10. Bb2 Qd7": "Black waits for castling and opens the door for long castling, as White becomes puzzled which way he should move his attack.",
        "11. Nd5": "!",
        "11... O-O-O": "I think this matter of (which way) 'castling' was all crucial point in this game. This Qside castling makes game sharp. Thou White seems in advantage as his king is safe and his Qside is already ready to attack.",
        "12. c4 Rde8": "Opens the way for bishop, d8 if White not capture.",
        "13. a4 Bd8": "Blacks think his black bihsop is more important.",
        "14. Rfe1 Nh5": "moving attack to kingside. f4 outpost for knight.",
        "15. b5 Bxd5": "White knight was dangerous at this outpost. Nothing could be more logical to exchange it with your pretty bad piece.",
        "16. Qxd5": "!, to be honest i didn't see that, i was guessing capture with a pawn. But this move is threatening fork, knight and checkmate at a8!",
        "16... Qg4": "ah! saving both plus moving forward his plan -  attacking g2. (was that natural?)",
        "17. h3 Qg6 18. Qa8+ Kd7 19. Qc6+ Kc8 20. Re3": "good move. looking forward.",
        "20... Nf4": "threatening checkmate.",
        "21. Ne1": "Black could capture h3 pawn in free but White's rook stops it now.",
        "21... Re6": "!! i think this was critical move, if Black would not play this right now then possibly he would lose, as White will push his Q pawns forward and opening fatal attacks.",
        "22. a5 d5": "!",
        "23. Qa8+ Kd7 24. cxd5 Rd6 25. Qxa7": "this move moves queen out of play.",
        "25... Re8": "I still have to know whether capturing the d pawn with knight before moving this rook was good or not?",
        "26. Ba3": "Now: if ...Rf6 e5.\nanother strange move was Rxd5. sacrificing rook, after PxR RxR PxR NxP+ or Ne2+. Black can get some 'drawing' chances by teasing White King with his Q and N. but I could not figure out any checkmate, otherwise rook sacrifice (Rxd5) would be good.\nLast only safe move remained... check.\n",
        "26... Nxd5 27. Bxd6 Nxe3 28. axb6 Qxd6": "all moves (in this bloodshed portion) looking pretty forced.!",
        "29. b7 Bf6 30. Rc1 Qb6 31. Qxb6 cxb6 32. Rc8 Rxc8 33. bxc8=Q+ Kxc8 34. fxe3": "White is up a pawn but his pawn structure is weak. \nIt hard to say whether bishop was good in this scene or knight.",
        "34... Kd7 35. Nd3 Kd6": "Black moved his King in fork situation deliberately as afer e5+ BxP NxB KxN ... this exchange favors Black as he can go then after b5 pawn easily.",
        "36. Kf2": "but White is aware.",
        "36... Be7": "Trying to guard b4 square.\nIt's hard to decide whether bishop should remain on a1-h8 diagonal or current diagonal was better.\nWhite can play Nb4-d5 attacking b6 pawn, while d5 outpost seems more offensive.",
        "37. Kf3 g5": "stopping the king at f4.",
        "38. Kg4 Ke6 39. g3 f6 40. Kf3 h5 41. g4 h4": "if PxP then KxP and then king can penetrate via h5 to g6. This move closes kingside and now if white does not move his knight then game is draw. as black biship cannot do anything and black king cannot cross the barrier of 5th rank.",
        "42. Ke2 Bd6 43. Kf3 Bc5 44. Ke2 Bd6": "Draw Agreed.!\n[one thing: my respected opponent offered a draw few moves back but i declined and now i offered. So may be my opponent say that i was stupid, didn't accept draw earlier. Well it was not for no reason. Few moves back my opponent lost (other) few games so his rating decreased if i would accept then i would lost few points. But after couple of hours he won some games and his rating leveled. So it became logical to draw now. Sorry for keeping you in wait few hours :)]"
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=38832",
    "gameName": "Let's play chess",
    "players": "svetlana02 (1740) vs. abro (1741)",
    "opening": "Ruy Lopez (C66), Berlin defence, hedgehog variation"
}