{
    "moves": {
        "1. e4": "This is one of the Best games i have ever played. From a losing position i recovered and was able to draw this match\n\n1. Normal King e4 opening which gives open space to both queen and bishop\n\nI request everybody to post their comments and give their feedback please",
        "1... e5 2. Nf3": "I attacked his pawn with my horse",
        "2... d6": "He opened his Knight and his main idea was to attack my horse..Bg4",
        "3. h3": "I counter attacked him",
        "3... h6 4. Bc4": "Again attacking mode....",
        "4... Qe7": "I dont know why he kept queen in that position",
        "5. Nc3 c6 6. a3 Qf6 7. d3 Be7 8. Be3": "My whole idea was to control the centre of the board",
        "8... Be6 9. Bxe6": "mutual sacrifice",
        "9... Qxe6 10. d4 Na6 11. d5 Qg6 12. O-O Qh5 13. b4 Bg5 14. Bxg5 hxg5": "he tried to attack my king with his queen, pawn and open rook...but i had other ideas ",
        "15. dxc6 bxc6 16. Qxd6": "The queen out with a bang",
        "16... Ne7 17. Qxe5": "its time for some queen play",
        "17... f6 18. Qe6 Nc7": "Strong repel from horse",
        "19. Qc4 g4": "Now i am in the back foot. danger with the pawn",
        "20. Nh2 gxh3": "Things who have gone worse if i had consumed the pawn",
        "21. g3 Qg5 22. Rad1 Qe5 23. Nf3 Qe6 24. Qe2 h2+ 25. Nxh2 Qh3": "On the verge of defeat",
        "26. f3 Qxg3+ 27. Qg2": "I had to go for exchange to save the game",
        "27... Qh4 28. Rf2 Ne6 29. Qg4 Qxg4+ 30. Nxg4": "atlast some relief, but still he had 1 pawn extra",
        "30... Nf4 31. Rh2 Rxh2 32. Nxh2 Neg6 33. Ng4 Ke7 34. Kf2 Nh4 35. Ne2": "My whole idea was to repel the horse attack with my own horse",
        "35... Ne6 36. Kg3 Rh8 37. Rh1 g5 38. f4 Rd8 39. fxg5 fxg5 40. Ne5 Rd6 41. Kg4 Kf6 42. Nf3 Nxf3 43. Kxf3 Rd2 44. Rc1 Ke5 45. Ke3 Rd6 46. Kf3 Nd4+ 47. Nxd4 Rxd4": "Now only with rook remaining..still he had 1 pawn extra",
        "48. Re1 Rc4 49. Re2 Rc3+ 50. Kg4 Rxa3 51. Kxg5": "My one master move",
        "51... Ra2 52. Rd2 Kxe4": "Now we are both with same points",
        "53. Rd7 Ra4 54. Rc7 Kd5 55. c3 a6 56. Rd7+ Kc4 57. Rd4+ Kxc3 58. Rd6 Kxb4 59. Rxc6 Kb5 60. Rf6 Ra1 61. Rf5+ Kc4 62. Rf4+": "traces of a draw...but still he had 1 pawn extra",
        "62... Kd5 63. Rf5+ Ke4 64. Rf4+ Ke3 65. Kg4 a5": "The opponent was severally trying to push the pawn",
        "66. Rf3+ Ke2 67. Kf4 Rf1 68. Rxf1 Kxf1": "oh now only with a pawn left and i had a clear passage to remove it",
        "69. Ke3 a4 70. Kd2 a3 71. Kc2 a2 72. Kb2 a1=Q+ 73. Kxa1": "At last the game ended in a draw"
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=43328",
    "gameName": "Let's play chess",
    "players": "f1shashi (1432) vs. marclhert (1439)",
    "opening": "Philidor's defence (C41)"
}