{
    "moves": {
        "1. e4": "White opens with the king's pawn",
        "1... e6": "I open e6 ",
        "2. Nf3": "White seeks command of the sweet center",
        "2... g6": "I focus on the development of my Kings house",
        "3. g3": "White follows suit",
        "3... Bg7 4. Bh3": "White attains a superior board position with the fuller development of the white Bishop, but I do not concern myself with this fact though because I have a development strategy to complete. ",
        "4... Nh6": "I bring my Knight out on the wrong side of my Bishop. I mean to bring the Kinght to f6, but I click \"submit\" before I realize what I have done....oh well",
        "5. Nc3": "On the surface it seems that white is wining control of the board, but I am still not concerned. It is early as far as I can tell. ",
        "5... O-O": "I castle, and feel much safer now that I have built my house.",
        "6. d3": "white continues to develop",
        "6... Re8": "I continue my development also",
        "7. O-O": "white castles. It looks like it is going to be a long game won by attrition and finally a few pieces in the end game",
        "7... Nc6": "So I go for the middle of the board trying to win real estate",
        "8. a4": "white begins an attack on the flank",
        "8... a5": "I send my army forward to stall him",
        "9. Be3": "White looks to be more in a position of power now that his black Bishop enters the fray",
        "9... d5": "I am still thinking that I need to control the middle of the board to have a prayer",
        "10. Ng5": "Black is under attack on the king side by an aggressive knight with a lot of power on that side of the board and the potential of the Queen entering the battle as well. I am thinking that I need to be aggressive to survive",
        "10... d4": "I see the fork, and take my chances",
        "11. Bxd4": "a Bishop for a pawn. Thank you",
        "11... Nxd4": "Now two points up, I feel like I can win in a game of attrition and I see a chance to attack the King along the white diagonal",
        "12. Nf3": "Oops, white sees it too and retreats",
        "12... b6": "nevertheless I build toward the final assault",
        "13. b3": "Not sensing the danger, white pushes a pawn developing his pawn structure on the queen side in a threatening manner.....",
        "13... c5": "by building my pawn structure on the queen side to counter and at the same time, I open the white diagonal to assault",
        "14. e5": "this is whites error. that pawn prevented the attack from being launched, but by being to aggressive with a minor piece, white has struck the deathknell",
        "14... Bb7": "I begin the assault",
        "15. Bg2": "Frantically, white defends now alerted to the danger",
        "15... Nc6": "I seemingly retreat...but it is a ruse",
        "16. Bh3": "feeling the danger passed, white starts to rebuild",
        "16... Nd4": "but the assault of my Knight is designed to bring his Knight off the white diagonal",
        "17. Bg2": "Yet again, white senses danger and retreats",
        "17... Ng4": "I press. now with two knights attacking, white feels the pressure building. It still doesnot look too formidable, and it seems like an easy defense will repel the invaders, but white does this...",
        "18. h3": "a pawn against a knight. Usually no match since a knight is so much more mobile",
        "18... Nxe5": "My knights are nicely positioned now flanking the coming attack",
        "19. g4": "white opens up his castle for the invaders by pushing another pawn",
        "19... Nexf3+": "And here comes the attack",
        "20. Kh1": "instead of sacrificing his queen, the king retreats",
        "20... Ra7": "I move my castle for two reasons: 1. to get him out of the line of fire in the event that I am forced to move my Knight off the white diagonal and 2. to get my Queen onto the white diagonal for the final assault and to guard the bishop with a second defender in case the attack breaks down",
        "21. Ne4": "falling behind in development and also pieces now, white starts to bring his mojor pieces out for a titanic battle",
        "21... Qb8": "So here is where I waste a move...although it might have served to lull black to sleep although in one respect he is only one move away from mate",
        "22. Bxf3": "White decides to kill a knight to prevent mate but...",
        "22... Nxf3": "Since we are coming to the end game, I am happy to trade a Knight for a Bishop",
        "23. Qxf3": "I see that with the Queen out in the battle field that my attack must wait. I will be patient",
        "23... Bxa1": "but I will attack the exposed Castle all the same to keep white distracted",
        "24. Rxa1": "with this move, white has left the king with very little cover and fallen two more points behind. ",
        "24... f5": "I press ahead. If I can threaten the queen with a pawn, perhaps mate will emerge unexpectantly",
        "25. Kg1": "Seeing the danger, white moves the King off the white diagonal",
        "25... fxe4": "I take the Knight. This might prove to be the pivitol move of the game",
        "26. dxe4": "the pawn offers very little protection to the King who is now completely exposed",
        "26... Qa8": "I bring my Queen over for the final assault",
        "27. Qf6": "White tries in desperation to launch an attack, but my king is safely at home holding court",
        "27... Bxe4": "The end is near...so White resigns with mate certain within two moves"
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=1928",
    "gameName": "Let's play chess",
    "players": "lowenbrau (1116) vs. opus692 (1200)",
    "opening": "French defence (C00)"
}