{
    "moves": {
        "1. e4": "It'll be King's Gambit after this.",
        "1... e5 2. f4": "...following through King's Gambit.",
        "2... exf4": "the usual.",
        "3. Bc4": "Not the usual, but the King's Gambit does have flex.",
        "3... d6": "the usual.",
        "4. Nf3": "the usual.",
        "4... f6": "variation introduced and there will be follow through and that will be at the least devastating and not checkmating.\nI have played AGAINST the King's Gambit all my life when dad was white!  I know them all and what may work and what never works.  What never works is Ruy Lopez.",
        "5. d4": "There are MANY choices and this one I felt was the lottery winner honestly.  I knew it would work just like another move or more I am familiar with using the King's Gambit. The example is whether or not to advance the pawn to King Rook Four or to take out the inside knight to break the castling or advance either pawn d or e forward or to just 0-0.\n\nThat is both the problem and the decision to be loyal to the gambit instead of following simple moves to predictable near losses/wins through king and battling pawn.",
        "5... g5": "He wants to reinforce.",
        "6. d5": "I decided the \"Light Infantry\" formation was the best way to point and move forward....silently.",
        "6... Bg4": "Anticipated.",
        "7. O-O Nd7 8. Be2 h5 9. b3 Qe7 10. h3 Bxf3 11. Rxf3 O-O-O 12. Qd4": "The op is feeling good enough to do castling.\nThis is the best time to wake him or her up out of the siesta.",
        "12... Qe5": "I wasn't ready for a trade especially as white in the midst of King's Gambit.",
        "13. Qxa7": "Taking that corner pawn on the queen side leaves empty space and many ways to cover it.",
        "13... Qxa1": "This is where I knew my op was more interested in points than position.",
        "14. Rc3": "Sometimes when the op wants points they go hunting for more points while strategy and position is changing FAST leaving the power pieces useless in the end when they are needed the most.",
        "14... Qxb1": "I didn't see it until after I moved the bishop to e2.  It should have stayed to end it all!  I have to go BACKWARDS to my original position!",
        "15. Ba6": "Locked the bishop next to the queen to knock on the door after all the work the King's Gambit takes.",
        "15... Qxc1+": "A queen without a country is gone to do anything significant.",
        "16. Kh2": "He has to get an opening for his king.",
        "16... Nc5": "I felt with all my strong pieces in the sort of middle instead of behind pawns and such would help whatever this \"alley sweeper\" could do without the other one.",
        "17. Rxc5": "This rook looks like it is in the middle of everything without really doing anything ahead and protected from the queen.\nI thought if it wants to end up as a throw away piece it'd be more useful than to let it sit.",
        "17... dxc5": "I knew if he took the rook he would be in trouble.",
        "18. Qxb7+": "When you are -12 by the time you make this move you understand why the King's Gambit is an incredible offense leaving the Ruy Lopez in the finer dust of dust as an efficient response to Pawn to King Four.  The other black defense against pawn to king four is either sicilian or Caro.  The french is too stolid without flexibility to really be relied upon and that means the end of what black can do when a pawn goes to King Four as the open.\n\n"
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=69179",
    "gameName": "Let's play chess",
    "players": "menlopark (1400) vs. boardcreeper (1443)",
    "opening": "KGA (C33), bishop's gambit"
}