{
    "moves": {
        "1. e4": "The notations are looking at black position. It would be better if you click 'flip the board'. If I say 'left side' I mean right side if you are having white down.\n\nThis is toucanyahoo vs me. We don't know each other. This is also my sixth game so I'm not a very experienced player on gameknot.\n\nWhite plays the e4. I mostly answer with e5 but I wanted to try something else. Not that this is very original...",
        "1... d5": "d5. I was hoping for exd5 because I know how to play those games. Instead he played e5.  Nothing wrong with that.",
        "2. e5": "Maybe I should have played d4 here. The chess game database says c5,Bf5,d4 here. But I took the one after that, Nc6, threathening the pawn.",
        "2... Nc6 3. d4": "White is making a massive pawn structure here, and I can't do anything about that.",
        "3... Bf5": "Just developing my pieces here.",
        "4. Bd3": "Threathening my bishop. I could take d4 with my knight here, but the next move would be c3. Then I would have taken his bishop. (if you don't understand; 4Bd3, Nxd4 5c3 Bxd3 6 Qxd3) I thought the best thing to do here was just taking the bishop right away so I wouldn't lose any tempo and loss in development.",
        "4... Bxd3 5. Qxd3": "Off course, not with the c-pawn. Taking it with the queen is much better.",
        "5... e6": "making my pawn stronger and trying to put my black bishop out.",
        "6. Ne2": "There were a lot of other possibilities here for white.",
        "6... f6": "threathening white pawn structure. ",
        "7. f4": "instead of taking the pawn, white makes his pawn structure only stronger.",
        "7... Nb4": "threathening the queen. This is a very bad move, I dont understand why I did this. 8 Qb5  Nc3 9 Qxb7 Ng-e7\n\nHowever, toucanyahoo surprisingly played Qh3.",
        "8. Qh3": "I could go for Nxc2 here, making white unable to castle and taking his rook, but my knight can't go out of a1. The next move would probably Qxe6  and that doesn't look good either. I wouldn't get his Queen out of there. \n\nIf you don't understand; 8 Qh3 Nxc2  9 Kd1 Nxa1 10 Qxe6 \n\nSo I didn't want his Queen at e6. Thats why I did f5.",
        "8... f5 9. Na3": "Stopping me from Nc2 ",
        "9... Qd7": "Preparing to castle queen side.",
        "10. c3": "threathening my knight.",
        "10... Nc6": "a logical move.",
        "11. Ng3": "I think it was better if the knight was standing on f3 (6 Nf3) \n\nThis might give me some trouble on the left.",
        "11... O-O-O": "castling here to get out of trouble.",
        "12. O-O Bxa3": "Risky. Although he gets two pawns on the h-file, he gets the b-file with his rook",
        "13. bxa3 Nge7": "getting my knight out for action.",
        "14. Nh5": "good move. Now he wants my g-pawn. If I do g6 he would do Nf6, losing my Queen! Thats why moving my knight here is better.",
        "14... Ng6 15. Qd3": "He probably wants to do Qb5 and it is very strong. With an open b-file for him with a rook and queen it would be an easy game.",
        "15... Na5": "preventing Qb5.",
        "16. Bd2": "Probably for connecting the rooks, and maybe he would have done c4 if I didn't make the following move.",
        "16... Nc4": "I didn't want that he moves his queen any further. Thats why I blocked his path with my knight. This knight is my strongest piece for now.",
        "17. Rab1": "getting the b-file",
        "17... Rhg8": "I want to move my Queen in action for help and support. To do this, I need to save my g7 pawn. If my Queen moves before Rh-g8 white would get h7 with his knight, threathening e6.",
        "18. Ng3": "Maybe white thinks his knight is a bit useless there. ",
        "18... Qa4": "threathening a3 with risk.",
        "19. Rb3 Nxa3": "Very risky maybe, but white can't do Rf-b1 here anyway.",
        "20. Rb4": "threathening my queen.",
        "20... Qc6 21. Bc1": "Threathening my knight.",
        "21... Nc4 22. a4": "white now wants to move his pawn for action. ",
        "22... Qa6": "I thought this was the best move, stopping the a-pawn. I really hate doing b6.",
        "23. Rf2": "white brings in another piece.",
        "23... Ne7": "And so do I. The f pawn is protected with the bishop, so the f-rook was free to move to a2 even if my knight was still on g6.",
        "24. Ra2 Nc6": "threathening the rook.",
        "25. Rb1 h6": "While everything was on the right side, I decided to get some action on the left side.",
        "26. Bd2": "Maybe he wants me to take his bishop with my knight, but that would be really suicide.",
        "26... g5": "attacking the pawn structure and also trying to open the g-line.",
        "27. Ne2": "I thought he wanted to defend his f-pawn this way, a good decision. I wanted to open the g-file anyway, so I attacked.",
        "27... gxf4 28. Bxf4": "very surprising. I really thought he would take that pawn with the knight and still don't understand why he took this with his bishop. If he took it with the knight, my e6 pawn was under attack too.",
        "28... h5": "saving my h5 pawn, although the pawn is now weak.",
        "29. Nc1": "He still sees a lot of things on the right sides.",
        "29... Rg4": "breaking through.",
        "30. g3 Rdg8": "connecting my rooks and full attention on the left side. Also threatening the bishop!",
        "31. Nb3": "Very nasty move actually. If I take his bishop, I would lose my queen! 31 Nb3 Rxf4 32Nc5 Qa5 33 Rb5!\n\nI had to have a fleeing field for my queen.",
        "31... b6": "I really hate moving this pawn, but I don't think I had any other choice. My c6 knight is needed here.",
        "32. h3": "a blunder.",
        "32... Rxf4": "I now have his bishop.",
        "33. Rf1": "threathening my rook because it is a strong one. It seems very logical, but it is actually a blunder.",
        "33... Rxf1+": "I traded. If white takes my rook with the queen I would get the g3 pawn plus check. I would also get the c3 pawn. But taking it with the king isn't very good too.",
        "34. Kxf1 Ne3+": "White can't take my knight because of my queen on a3. White can't take my queen because of my knight on e3.",
        "35. Ke2": "forced.",
        "35... Qxd3+ 36. Kxd3 Rxg3 37. Ke2": "Blunder. It is game over now.",
        "37... Rg2+ 38. Kxe3 Rxa2 39. a5 Ra3 40. Nc5": "Nd2 was better.",
        "40... bxc5 41. dxc5 Rxc3+ 42. Kd2 Rxh3": "White resigns, he can't stop the h-pawn from promoting."
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=5861",
    "gameName": "Let's play chess",
    "players": "toucanyahoo (1351) vs. bloedeter (1200)",
    "opening": "Scandinavian (centre counter) defence (B01)"
}