{
    "moves": {
        "1. e4": "I haven't played for a long time. Usually i would play kings Gambit or some sort of sacrifice but i've forgotten them. Time to test my rusty skills.",
        "1... e5 2. Nf3 d6": "Hmmm... I thought he'd go Nb8-c6. The Phillidor Defense he has chosen to play. F7 wpuld be the weak square.",
        "3. Nc3 Nc6": "Developing moves",
        "4. Bb5": "I don't know why i did this move. I believe c4 was better.",
        "4... Bd7 5. d3 a6 6. Bxc6": "No choice. That knight now or never.",
        "6... Bxc6 7. Bd2 Qf6 8. h3": "Again a Pointless move. He wasn't even trying to pin my knight.",
        "8... h6 9. Qe2 O-O-O 10. Be3": "preparing for an attack on A7",
        "10... Kb8": ":(",
        "11. Nd2": "Just thought It would come in handy.",
        "11... d5": "Why?",
        "12. exd5 Bxd5 13. Nxd5 Rxd5 14. Qf3 e4": "? why",
        "15. Qxf6 Nxf6 16. Nxe4 Bb4+": "The exchange ends with me leading by a pawn.",
        "17. Nc3 Bxc3+ 18. bxc3 Re8 19. O-O": "Althought it may be Pointless to Castle in the middle game I just needed to develop my Rook.",
        "19... g5": "Preparing an assualt eh?",
        "20. c4 Rf5 21. Bd4": "I attempt to Counter Attack him.",
        "21... Nh7 22. Rab1": "Jsut applying pressure to the pawn.",
        "22... Rf4 23. Be3 Rf5 24. Bd2 h5": "This was when i was going to get smashed.",
        "25. Rbe1 Rxe1": "Why would you trade pieces when you're trying to attack? My rook was also doing nothing in my defense",
        "26. Rxe1 f6": "At the start i thought it was a good move but then i saw the mistake he had made.",
        "27. Re8+": "i go for the check. Should've went bd2-e3 but i think he would've noticed that.",
        "27... Ka7 28. Rh8": "There we go. The Side affects of F6 are coming.",
        "28... Ra5": "Perhaps Rh8 made him unaware and lowered his morale??????",
        "29. Bxa5": "And here he Resigns knowing all he has left are pawns while i still have a few pieces left."
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=38289",
    "gameName": "Let's play chess",
    "players": "richard1234567 (1200) vs. iskrata (1202)",
    "opening": "Philidor's defence (C41)"
}