{
    "moves": {
        "1. g3 d5 2. Nf3 Nf6 3. d4 e6": "So far, all book play.",
        "4. Bg2 c5 5. O-O Nc6": "White's advantage in development is counterbalanced by my stronger center Pawns.",
        "6. c3 Be7 7. Ne5 Nxe5 8. dxe5 Ng4": "The first tactical skirmish leaves neither side with any advantage gained.",
        "9. Na3 a6": "To prevent the Knight from planting itself at QN5.",
        "10. Bh3 Nxe5": "Now I have a small material advantage, though not enough to win yet.",
        "11. c4 O-O": "I've been looking for a chance to castle, and finally do. Now the middle-game begins.",
        "12. cxd5 exd5 13. Bg2 Be6": "Right now, my center Pawns give me a space advantage. I need to either maintain this or convert it into material.",
        "14. Qb3 b5": "I contemplate a general advance on the Q-side.",
        "15. Bf4 Ng6 16. e4 dxe4 17. Qc3": "Now I'm ahead by two Pawns, which should be a big enough margin to win. Time to think about trading down and simplifying the game.",
        "17... Nxf4 18. gxf4": "One pair of minor pieces zapped...",
        "18... Qd4": "Offering a Queen trade.",
        "19. Qxd4 cxd4": "Now I have a powerful passed Q pawn, and with the Queens gone the endgame has been reached.",
        "20. Bxe4 Rad8": "Back to 1 Pawn ahead, but it's 3 moves from Queening. I like my chances.",
        "21. Rfd1": "White has to blockade the Pawn.",
        "21... Bf6 22. Nc2 Rd6 23. Ne1 Rfd8": "Now I plan to use the Pawn as a battering ram.",
        "24. Nd3": "White prevents this. But White is on the defensive. I'm free to do as I wish.",
        "24... Re8": "I aim for the unprotected Bishop.",
        "25. f5 Bc4": "If the Bishop isn't guarded and doesn't move, I can capture it. I can now also remove the White Knight blockading my Pawn.",
        "26. Nb4": "Wow, best of both worlds thanks to this blunder. Now I pick up the B and my Pawn is free to advance.",
        "26... Rxe4 27. b3 Be2": "Gaining time by attacking the Rook.",
        "28. Rde1 d3": "Now the Bishop and Pawn protect each other, freeing my Rooks for other duties. I also unmask an attack on the White QR.",
        "29. Nxd3": "If Black wants to give me the Rook, I'll gladly take it.",
        "29... Bxa1 30. Rxa1": "Now the Knight is en prise and falls.",
        "30... Bxd3": "Just a matter now of when White gives up.",
        "31. Rd1 h6": "To avoid any possibility of a swindle and a back-rank mate.",
        "32. f3 Rf4 33. Kf2 Rxf5": "It's all over but the shouting.",
        "34. Ke3 Rh5 35. Rxd3 Rxd3+": "White voluntarily gives up his last piece, and now has no chance of even pulling a last-ditch swindle.",
        "36. Kxd3 Rxh2 37. Kd4 Rxa2 38. Kc5 Ra3 39. b4 h5": "With my KRP headed on an unstoppable journey towards becoming a Queen, White finally gives in."
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=30913",
    "gameName": "Let's play chess",
    "players": "neofite (1306) vs. thehellion (1283)",
    "opening": "Benko's opening (A00)"
}