{
    "moves": {
        "1. c4": "I like this game. The opening wasn't classic. I choice another way,  my favourite is 1 d4, but I don't like play every game the same opening. Now, I was entering in the English opening, probably joint the Reti, the most flexible opening for white.",
        "1... e5": "My opponent played the inverse sicilian variation. Another common options are 1 ... c5 and 1 ... Nf6 (an invitation to play an indian defence). Of course, 1 ... g6 or 1... d6 are perfectly playable",
        "2. Nf3": "2 Nc3 is more common, but this move is fine too",
        "2... e4": "A Alekhine-like defence. I was out of theory right now, but I don't like this advance for black, e4-pawn will need attention in the middle game",
        "3. Nd4": "Of course, not 3 Ne5 d6 4 Ng4 d5 5 Ne3 d4 and black wins the battle for the center squares",
        "3... Bc5": "Nice move, 3 ... c5 didn't work; d5 square is a permanent hole",
        "4. Nb3 b6": "I expected 4 ... Be7.  But not a weak move in my opinion, really. Another alternatives are ugly \n4 ... Bb4 5 a3 \n4 ... Bb6 5 c5 and the bishop is trapped\n\nThe advantage of 4 ... b6 is Nxc5 bxd5 controls d4 and the lsb can attack c4-pawn or take the long diagonal",
        "5. Nc3": "Only development, I hadn't plan yet. The white's dsb was trapped and I didn't where is well placed yet.",
        "5... Bb7": "This move gives me a idea. Block the e4-pawn blockades the long-diagonal and the lsb lose potential. And I can attack the pawn with Bg2, eventually. ",
        "6. e3": "Block e4... and a pawn more in the diagonal c1-h6 for the dsb",
        "6... Nf6": "Ok, black show your cards. But this move allows the kingside expansion without big risks. The White's king in the center is protected by my pawns and e4 pawns, too. ",
        "7. g4": "Open the long diagional to lsb and expand in the kingside. ",
        "7... d6": "7 ... d6 looks very solid but I expected 7 ... d5 8 Bg2 and if black plays 8 ... dxc4 I had 9 Nxc5 bxc5 10 Qa4+ recovery the pawn and attack the e4-pawn after Qxc4 with the threat g5 (if black takes in g4 I can take in e4). Another variation who I think was 8 ... d4 9 exd4 Bxd4 10 Nxd4 Qxd4 11 e3 exploting the long diagonal and the unprotected Bb7.",
        "8. Bg2": "Attacking twice the e4-pawn, with threat g5.",
        "8... Qe7": "Necessary move for defend the pawn. 8 ... d5 9 cxd5 Bxd5 10 Nxd5 Qxd5 11 d3 ",
        "9. d4": "Taking advantage of Bb7 was unprotected",
        "9... Bb4": "Only move for black. Moreover, my knight was pinned. But, I can reforce the attack to e4",
        "10. Nd2": "Ok, my dsb was blocked, king in the center and the rooks in the initial square and unconnected, but I think white is better in this position. Stockfish disagree and  evaluates the position like equal",
        "10... O-O": "This natural move looks risky, but I didn't evaluates right the position. I launch the expansion in the kingside thinking about the g-file with Rg1-Qg4 battery. But black had tactical resources... Stockfish shows me the way of the true",
        "11. g5 Nfd7 12. Qg4": "Attacking three time e4 (one of the two knights are pinned) against only two defenders. But 12 ... f5 was fine. I misevaluate that... My idea was 13 gxf6 Nxf6 14 Qg5 (idea Rg1, I mentione above) but black can defend the kingside",
        "12... g6": "A positional blunder (weaking the dark squares in the castle) and, moreover, loses the e4 pawn",
        "13. Ndxe4": "Take the e4-pawn with this knight (allows Bd2 and long castle). And, now, white had ... 14 Nf6+ Nxf6 15 gxf6 with Bxb7 threat. Now, black can take Bxc3 and Bc6. \n\nStockfish likes 13 Ncxe4",
        "13... Nc6": "Big blunder, my opponent didn't see the next fork",
        "14. Qxd7 Qd8": "Of course, 14 ... Qxd7 15 Nf6+ and white was a pawn and piece up\n",
        "15. Nf6+": "This knight moves 6 times in the game, right now. ",
        "15... Kh8": "Better was 15 ... Kg7 16 Qh3 h5, but the position of black is hopeless",
        "16. Qh3": "Threating mate",
        "16... h5": "The only defence",
        "17. Bd2": "I misevaluated two winning alternatives: Nxh5 and Bf3 works well.\nIn the last case, I see the maneuver Kg7 and Rh8 and takes the decision to aggregate pressure with a shy move. However, Stockfish likes 17 Bf3 without Bxh5. \nFor 17 Nxh5 I saw Qxg5 stopping the threat, but Stockfish shows 18 Nf6 Kg7 19 Nh7 double fork\n\n\n\n\n",
        "17... Bc8": "Loses time, this move hangings the knight in c6 and  the rook in a8. Only I need to move the queen and black need return with the bishop (or move to d7, but this position didn't benefits of the black kingside)",
        "18. Qh4 Be6": "Ops... ",
        "19. Bxc6 a6": "Two pieces up. Now,  my queen was defending the g5-pawn... time to break the kingside",
        "20. Nxh5": "If 20 .. gxh5 21 Qxh5+ Kg7 22 Qh6+ Kg8 23 g6 (threating mate in h7) and black had two moves:\n1) 23 ... fxg6 24 Qxg6+ Kh8 25 Qh6+ Kg8 26 Rg1+ Rf7 27 Rg7++\n2) 23 ... Rf8  25 fxg7+ Kf8 25 fxe8Q+\n\nStockfish gives better lines :) but this lines are winning",
        "20... f6": "Ok, now is mate in two",
        "21. Nxf6+ Kg7 22. Qh7#": "Thanks for the attention, please comment and criticize.\nSorry, I am learning the English language and this gives the opportunity of practice (moreover, I take the double opportunity, learn English and chess).\n\n"
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=64048",
    "gameName": "Let's play chess",
    "players": "adusalem (1550) vs. dbeee (1129)",
    "opening": "English, Nimzovich, Flohr variation (A20)"
}