{
    "moves": {
        "1. e4 c5": "Sicilian Defense.",
        "2. Qh5": "This move looks bad but it has actually been used to some effect by an American GM.",
        "2... e6": "The obvious looking Nf6 walks right into Qxc5, which is just giving up a pawn. Black can claim its a sacrifice after e6 maybe, but it is not worth it.",
        "3. e5": "Preventing Nf6 which would drive the queen away.",
        "3... Nc6 4. Bb5": "This allows the move Nd4, and better would have been Nf3 followed by developing the bishop to e2 and castling.",
        "4... Nd4 5. Kd1": "Misses the threat to the bishop. Bd3 was necessary.",
        "5... Nxb5 6. c4": "Development would be better in this position.",
        "6... Nd4 7. Nf3 Nxf3 8. gxf3 Ne7 9. Rg1 Ng6 10. d4": "I dont see the point in this move. It does allow the bishop out, but why not just d3? Maybe white saw a line like cxd4,Bg5 f6,exf6 gxf6 and then Rxg6. However this dosnt work as instead of f6 black can play the simple Be7.",
        "10... cxd4 11. Bg5": "As I said before black was hoping for f6, but I've mentioned how to parry the threat.",
        "11... Be7 12. Bxe7 Qxe7": "Black is clearly better after sidestepping the tactic. I must point out that it demonstrated excellent tactical vision to have seen that tactic which was a whole 6 moves deep. Just to show how it could have turned out, heres a pretty line(from move 11); f6,exf6 gxf6,Rxg6! fxg5,Rg7  Kf8,Qf7 and checkmate.",
        "13. Nd2": "Possibly eying up the d6 square via e4.",
        "13... O-O 14. f4 Qh4": "Trading queens and making the win alot easier.",
        "15. Qxh4 Nxh4 16. Ne4 Nf5": "Covering the d6 square.",
        "17. Ng3 Nxg3 18. Rxg3 f6": "Beginning to free the bishop by dismantling the white pawn centre.",
        "19. exf6 Rxf6 20. Kc2 Rxf4 21. Rd1 e5 22. Rdg1 Rxf2+ 23. Kd1 g6 24. Ke1 Rxb2 25. h4 Rb1+ 26. Kf2 Rxg1 27. Kxg1 d6": "Now compare the Bishop from move 18 with the bishop now.This goes to show that you should always try to improve the position of your pieces. The fact that the bishop will enter the game was enough of a reason for white to resign. Black will place the bishop on f5, begin pushing the centre pawns and back them up with the rook. White will not be able to stop the pawns."
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=831",
    "gameName": "Let's play chess",
    "players": "goonerneil (1183) vs. smoran90 (1200)",
    "opening": "Sicilian defence (B20)"
}