{
    "moves": {
        "1. e4": "I have decided to annotate this game to highlight a great double Bishop sacrifice. It does not end with checkmate but does leave the board with myself up a Queen for a Rook, and my opponent resigning.\r\n\r\nHope you enjoy,\r\n\r\nDavid.",
        "1... c5": "Sicilian, seem to play against this a lot now as the level of my opponent rises. ",
        "2. Nf3 e6 3. d4 cxd4 4. Nxd4 a6": "My typical response to the Sicilian, and the best I feel. Usually play 5. Nc3 which is usually met with ..,d5. Decided to change the way I meet the Sicillian.",
        "5. Bd3": "And decided on the Kan variation 5. Bd3 thinking behind this was 5.., Bc5 6.., Nb3 perhaps then .., Be7 where 7. Qg4 could cause black problems on the king side.",
        "5... Qb6": "A first for me personally. Instead of Bc5, Qb6. This has the same effect as the line mentioned in the previous page, except Qg4 does not cause any problems for black as the bishop is still at home. Therefore normal development should be continued.",
        "6. Nb3 Qc7 7. O-O Nf6 8. f4 d6 9. a4": "Prevents b5 and gives white the option of harrassing the queen which I had decided to play from here.",
        "9... Be7 10. Be3 O-O 11. Nc3": "I see this as white being fully developed as in an attacking sense. I know a lot of people say the Queen is not \"in play\" however I think with the open diagonal the queen can be brought into the game effectively at any stage. I like whites position as it is more active than blacks.",
        "11... Nc6 12. a5": "Preparing Bb6 as prevoiusly mentioned which should cramp blacks position and allow white to have some control of the game.",
        "12... Bd7 13. Bb6 Qc8 14. Qe2": "Preparing e5, whilst now giving the white queen a strong square and more options.",
        "14... Nb4 15. e5": "Opening whites light squared Bishops diagonal. An attack on the center of the board whilst disguising the king side attack. It does need more work but it is the start of something beautiful.",
        "15... Nfd5": "I played e5 expecting this move. If the pawn exchange happens white is in a better position due to the threat on the knight and now after the knight exchange black forces whites Bishop off of the very nice position he has took up.",
        "16. Nxd5 Nxd5 17. Bd4": "(!) I think the advantage here with this move is it looks passive and seems to give black a small edge where in actual fact its the move that causes black all sorts of problems, as you will soon see.",
        "17... Nb4": "(??) This is a bad move although threatening the bishop/c2 pawn hoping to gain tempi white now has a game which if not noticed by black (which by this move it has not been) is won. I can understand the idea behind it though. If black initiates the pawn exchange he is still on the back foot where as if white initiates the exchange black looks better. Perhaps Initiating the exchange would have been better or g6.",
        "18. exd6": "(!!) Initiating the pawn exchange. Black is in big trouble!!!",
        "18... Bxd6": "(??) Black should have played g6 and gave up the bishop.",
        "19. Bxh7+": "(!!) The Bishop sacrifice. The start.",
        "19... Kxh7": "And now the sequence is unstoppable!",
        "20. Qh5+": "Only one option available.",
        "20... Kg8 21. Bxg7": "(!!) A double bishop sacrifice!! Threatening mate. Again only one option.",
        "21... Kxg7 22. Qg5+": "Setting the king up for the threat of checkmate.",
        "22... Kh8 23. Rf3": "Now black must lose the Queen or the game is lost.",
        "23... Qxc2 24. f5": "(!!) Idea behind this is shown in the upcoming moves. However if Rh3 , then Qh7 and white only gets the queen for a rook and is a pawn down. With five major pieces v 3 major pieces although white has the Queen. This pawn ensures it 3 v 3.",
        "24... Qxf5 25. Rxf5": "Loss of the queen prevents the checkmate but white will get back the material advantage as well as the positional one he already dominates.",
        "25... exf5 26. Qf6+ Kh7 27. Qxd6": "Now black loses either the bishop or knight and white is a queen for a rook up all down to a double bishop sacrifice. A major advantage and black decides to resign. This has to be the best win I have had due to the manner it was won in. I hope you enjoyed the game as I did annotating and playing it. Thanks to my opponent also, it was a good game.\r\n\r\nP.s. I did use analyze board to come up with the sacrifices something I am trying not to do.\r\n\r\nCheers,\r\n\r\nDavid."
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=15375",
    "gameName": "Let's play chess",
    "players": "klondyke (1865) vs. young_tribe (1890)",
    "opening": "Sicilian (B42), Kan, 5.Bd3"
}