{
    "moves": {
        "1. e4": "I'd played jevgeni four times before on gameknot.   Looking back over those games at the start of this one told me two things - 1) he went for unusual openings, hypermodern in the extreme with no real central presence and 2) I didn't have a great record against him (2-0-2, with white winning every time).   It's no use thinking your opponent's opening isn't great if he still beats you with it!   This time around, though, I scored a nice win.",
        "1... b6 2. d4 Bb7 3. Bd3 g6 4. Nf3 Bg7 5. c4": "May as well take some more of the centre while I'm being given the chance.",
        "5... h6": "I think this move may be too much in this position though; black needs to play a bit more actively than this (although I'm sure id=animusrex would disagree!)",
        "6. Nc3 e6 7. O-O Ne7": "Even with his last two moves, black is still playing very passively.   There aren't really any weaknesses in his position though, with the probable exception of the h-pawn.   He's a good three or four moves away from castling queenside, so I decide to pre-empt kingside castling with my next move (similar to my last annotated game actually)",
        "8. h4 Nec6 9. Be3": "The d4 pawn was hanging",
        "9... Nb4": "I think this manoeuvre is too slow for black.   With kingside castling still looking odds-on, I'm not about to give up the LSB, which can drop back to b1 while still keeping the same range.   Meanwhile, black's knight can get kicked back to where it came from after an a3 push; it would retreat having gained nothing from its excursion.",
        "10. Bb1 a5": "I think black really needs to play for the centre here.   Preparing d5 would have been preferable, or even playing c5.   I'm not sure what a5 achieves here.",
        "11. a3 Nb4a6": "So as to allow the other knight to develop to c6, and also so as not to hinder the c-pawn.   It's a horrible square for a knight though.",
        "12. Re1": "I haven't developed my rooks yet.   They belong on open or soon-to-be-open files, so I put it here, eyeing a d5 push and maybe opening lines to the king.   Curiously, this is a less effective plan than if the knight were on its \"proper\" c6 square.",
        "12... c6": "Presumably preparing a d5-push, but again, I think it's too slow.   However, white still needs to capitalise on this to win.",
        "13. d5 Bxc3": "?   This creates a fair few dark-squared weaknesses around black's king-side, and all in exchange for a knight that wasn't really going anywhere.   This will prove costly later.   The doubled pawns are soon cleared.   13...e5 was maybe better; shutting the DSB in but at least keeping things closed.",
        "14. bxc3 cxd5 15. cxd5 Nc5 16. Bd4": "Hitting the rook and forcing black's hand a little on the subject of castling.   16...f6 doesn't look too appealing.",
        "16... O-O 17. Qd2": "Immediately setting about hitting the weaknesses in black's kingside position.   The first - the h6 pawn - was created by the h6-push on move 5 and the exchanging of the DSB for knight on move 13.",
        "17... Kh7 18. h5 Nb3": "I completely missed this move.   It's always a danger when you're working on an attack that you completely overlook any counter-attack for your opponent.   Similarly, black deserves credit for not overlooking the counter-attack while on the defence; many a game has been needlessly lost as a result.   However, the more I looked at this move, the less concerned I was.   The a1 rook isn't in the game and is as far away as possible from the action (which is starting to swirl around the opposite corner of the board).   With the two bishops aimed at the king, there should still be enough for a winning attack.   But moves like 19. Qb2 NxR 20. QxN aren't good enough at all; the queen's mis-placed badly and maybe black can shore up his kingside a little with g5.",
        "19. hxg6+": "!   I think this is the right plan.   There follows a series of forcing moves designed at creating more weaknesses around the king.   This one weakens g6 significantly.",
        "19... fxg6 20. Qd3 Nxa1": "NxB was probably stronger.",
        "21. e5": "Threatening mate, while opening up the b1-h7 diagonal.",
        "21... Qe8 22. Nh4": "Single-mindedly hitting out at black's weakness; this also forces the rook off the semi-open file and limits black's counter-play.   As noted earlier, don't overlook an attack just because you get thrown onto the defensive!",
        "22... Rg8 23. c4": "Trapping the knight while shoring up my central pawns.   Moves like this always tell you you've a very good position!",
        "23... a4": "Creating an exit square for the knight, and also maybe allowing the rook to join the game via a5 at some stage.   Better though was Nb3 - the knight is dead anyway; Nb3 would divert the queen off its diagonal, however temporarily.",
        "24. Bxa1 exd5 25. cxd5": "This pawn exchange suits me as well, as it opens up the a1-h8 diagonal for my other bishop.   Even though I'm the exchange down, this attack almost plays itself for white.",
        "25... d6 26. e6 Nd7": "I think Ra5 would have been better here, winning the d-pawn (or forcing the ugly Ba2).   However, Qc3 may well transpose to a similar idea to that seen in the game.   The knight itself is probably immune from capture due to 27. PxN QxR+.   However, even two exchanges down, the power of the bishop-pair and the weaknesses at g6 and h6 are possibly still decisive; the queen can't get back to e8 to cover g6.   I didn't analyse this line though, because I found a stronger move.",
        "27. Qd4": "!   g6 has been my target ever since move 18.   This actually removes a defender - the rook - from g6, while allowing a weaker white piece to attack it.   I think black is just lost here.   26... Qe7 puts up a stronger defence, but 27. Qg4 looks good then, attacking g6 once more.   If nothing else, I have 27...Qe8 28. NxP RxN 29. BxR+ QxB 30. QxQ+ KxQ 31. PxN Rd8 (or else Re8 wins) 32. Re6+, picking up another pawn and threatening Bf6, queening or winning the rook.",
        "27... Ne5": "27...Nf8 28. e7 would be similar.",
        "28. f4": "The knight must be kicked; g6 must fall",
        "28... Nd7 29. Nxg6": "!   The point of Qd4 - I can now eliminate g6, and the two bishops in the corner will cause havoc.",
        "29... Rxg6": "Not taking looks horrible, taking with the queen is obviously horrible, and RxN allows...",
        "30. Qg7#": "...mate, as the rook is pinned and can't take back."
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=42660",
    "gameName": "Let's play chess",
    "players": "cdeburca (1666) vs. jevgeni (1475)",
    "opening": "Guatemala defence (B00)"
}