{
    "moves": {
        "1. d4": "Ecco... a me non piacciono le partite di Donna :(",
        "1... d5 2. c4 c6": "Difesa slava... forse l'unica apertura di Donna che conosco un minimo",
        "3. Nc3 Nf6 4. Nf3 dxc4": "La variante di presa... poco usata... poco conosciuta... almeno un piccolo vantaggio per me :D",
        "5. e4 b5 6. a3": "In questi casi solitamente si preferisce giocare a4 per scardinare la struttura pedonale del nero.\nInfatti se dopo a4 il nero giocasse a6, il bianco guadagna un pedone con axb5.\nIl nero non può catturare col pedona a altrimenti perde la torre e se riprende col pedone c lo perde per via del cavallo.",
        "6... h6 7. Be2 e6 8. O-O Be7 9. Re1 Qc7 10. g3 Bb7": "L'obiettivo era di creare una pressione sul pedone e4",
        "11. Bf4 Qd8 12. Ne5 Nbd7 13. Nxf7": "Un sacrificio forse non abbastanza supportato da altri pezzi",
        "13... Kxf7 14. Bh5+ Nxh5 15. Qxh5+ Kg8": "forse sarebbe stato meglio Rf8",
        "16. Qg4 Nf6 17. Qxe6+ Kf8 18. Rad1 Qd7": "Propongo il cambio delle donne in virtù del leggero vantaggio materiale e per alleggerire la pressione",
        "19. Qe5": "Lui ovviamente rifiuta :)",
        "19... Re8 20. Qc7": "Poi però mi propone lui il cambio :O",
        "20... Qxc7": "E ovviamente accetto",
        "21. Bxc7 Kf7": "Metto le torri in collegamento",
        "22. Ba5 a6": "Cerco di migliorare la struttura pedonale ",
        "23. d5 cxd5 24. exd5": "Una semplificazione che forse mi fa comodo. Rinuncia anche ad un pedone centrale per uno laterale...",
        "24... Bd6": "Blocco il pedone d che altrimenti potrebbe crearmi dei problemi",
        "25. Re3 Rxe3": "Ormai il mio piano è chiaro: cambiare il più possibile per cercare di arrivare al finale con un vantaggio materiale",
        "26. fxe3 Re8 27. Bb6 Kg8 28. Kg2 Ne4": "Cerco di semplificare ancora",
        "29. Ne2 Rf8": "Tentativo di guadagnare il cavallo ma ovviamente non ci casca",
        "30. Nf4 g5 31. Nh3 Bxd5": "Svista clamorosa... non so perché dopo aver analizzato a lungo la posizione mi sono convinto che il pedone fosse indifeso!",
        "32. Rxd5": "La partita torna in parità materiale e mi dico: \"tanta fatica per nulla!!!\"",
        "32... Rf6 33. Bd4 Re6 34. Nf2 Nxf2": "Troppo complicato per me! :D\nCambio...",
        "35. Kxf2 Kf7": "E' il momento per il Re di entrare in gioco",
        "36. Rf5+ Kg6 37. Rd5 Bf8 38. Ke2 Bg7": "poiché lui ha un pedone isolato, provo a cambiare gli alfieri per semplificare ancora un po'",
        "39. Bxg7 Kxg7 40. Rd7+ Kg6 41. g4": "Quel pedone impedisce l'avanzata del mio Re e quindi preferisco cambiarlo",
        "41... h5 42. gxh5+ Kxh5 43. Rh7+ Kg6": "Rg4 non mi ispirava (h3+ Rg3 h4 gxh4 Txh4 e avrebbe poi potuto tagliarmi il Re fuori dal gioco)",
        "44. Rc7 Rf6 45. e4 g4 46. Rc5 Rf3 47. Rc6+ Kg5": "Decido di sacrificare un pedone per cercare di promuovere uno degli altri 2",
        "48. Rxa6 Rb3": "Credo la mossa decisiva: il pedone b sta per cadere lasciando via libera al pedone c",
        "49. Kf2": "Un errore! Si espone all'eventuale scacco nel caso decidessi di prendere il pedone b facendomi guadagnare un tempo! Ma decido di fare altro...",
        "49... Kf4": "Prendo l'opposizione attaccando il pedone \"e\" e difendendo il mio pedone g ",
        "50. Kg2 Rxb2+": "Scacco e il Re è costretto a indietreggiare grazie al Rf4 giocata in precedenza",
        "51. Kg1 Kxe4": "Elimino il pedone e, forse l'ultimo pericolo rimasto.",
        "52. Re6+ Kd3 53. Rg6 c3": "Il pedone \"g\" a questo punto si può anche sacrificare",
        "54. Rxg4 c2 55. Rg3+ Kc4": "Mi ero già studiato la strada per mettere al sicuro il Re: Rc4 Tg4+ Rb3 Tg3+ Ra4 Tg4+ Ra5 e Re in salvo",
        "56. Rg4+ Kb3 57. Rb4+ Kxa3": "Ovviamente prendo il pedone a: se cambia le torri promuovo altrimenti se gioca Tc4 per controllare il pedone c2 gioco Tb1+ :)",
        "58. Rxb2": "Finisce qua. Avrei giocato Rxb2 ma anche c1=D+ andava bene per poi catturare la Torre con la Donna dopo lo scacco :)"
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=65075",
    "gameName": "Let's play chess",
    "players": "pioko5 (1607) vs. aldomarav (1629)",
    "opening": "QGD Slav defence, Alekhine variation (D10)"
}