{
    "moves": {
        "1. d4 e6 2. Nf3 b6 3. e4 Bb7 4. Bd3 Bb4+ 5. c3": "Bb4+ allows White to finish building a strong pawn structure in the center while gaining a tempo.  It's now up to Black to try to undermine White's center.",
        "5... Bd6": "d6 is not a great square for the Bishop.  It reduces Black's ability to counter in the center with pawns.",
        "6. O-O c5 7. Bg5 f6": "f6 is a little bit weakening.  Black could have taken the opportunity to develop the N.",
        "8. Bh4 Ne7 9. e5 fxe5 10. dxe5 Bc7 11. Re1 O-O 12. Be4 Bxe4 13. Rxe4 Qe8 14. Na3 Qg6": "Moving the Q to g6 allows the e7 N to hang.  Although the e4 R is also loose, White strikes first.",
        "15. Bxe7 Rf7 16. Re3 Rxe7 17. Nb5 Na6": "Black finishes development and hopes apparently to attack on the Kingside.  But the N is hanging.",
        "18. Qa4 Rf8 19. Qxa6 Bb8 20. Nd6": "The N on d6 is a real annoyance for Black.  For one thing, it prevents doubling the Rs on the f file.",
        "20... Qc2 21. Qe2": "White offers to exchange and head toward an endgame with a piece to the good.",
        "21... Qxe2 22. Rxe2 Bxd6 23. exd6": "By exchanging, Black makes the material deficit loom larger.  Although Black has an open f file and two Rs, it's not clear that an attack could be successful now.",
        "23... Ref7 24. Rd1 h6": "Thinking about a Kingside attack perhaps.  Rxf3 just loses the exchange.",
        "25. Ne5": "Now White is also winning the d7 pawn, making a dangerous passed pawn.",
        "25... Rf7f5 26. Nxd7 Rd8 27. Ne5 g5 28. d7 Kf8 29. Nc6": "Black is going to lose significant material trying to deal with the passed pawn.",
        "29... Rd5 30. Rxd5 exd5 31. Nxd8 d4 32. cxd4 cxd4": "With the R on the e file, Black's K can't get to the passed pawn.",
        "33. Re8+ Kg7 34. Nc6 d3 35. d8=Q": "The pawn promotes in plenty of time to stop Black's d pawn.",
        "35... g4 36. Qxd3": "Mate is going to follow in a few moves, after White plays Re5, Qd6, Re7, Qd8.  White can safely ignore the Black pawns."
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=58174",
    "gameName": "Let's play chess",
    "players": "mmoody95 (1757) vs. r8_28 (1583)",
    "opening": "Queen's pawn (A40)"
}