{
    "moves": {
        "1. e4": "A nice game, resulting in an interesting finale which finished draw.",
        "1... e5 2. Nf3 Nc6 3. d4": "Scotch defense",
        "3... exd4 4. Nxd4 Nxd4 5. Qxd4 Nf6 6. Nc3 d6 7. h3 Be6 8. g4": "White advances his pawns, their structure is vulnerable, but they capture space...",
        "8... Qd7 9. Bg5 Be7 10. O-O-O O-O": "O-O, with the plan to attack against the enemy castle (a bit risky, since white has his pawns advanced in this side)",
        "11. Bxf6 Bxf6 12. Qd3 b5": "After the changes, black begins his attack, since the open centre gives his bishops great power.\n\nHowever, black didn't notice the pawn is lost...",
        "13. Qxb5 Qxb5": "... Exchanging Queens might not seem the best idea (since it reduces his attack capabilities)",
        "14. Bxb5": "Perhaps better was Nxb5, with more threats, although the bishop move develops one more piece, and doesn't open the space for the black bishops...",
        "14... Bxc3": "Black sees that he can take his pawn back, by exchanging one bishop for the knight... Loses the advantage of the 2 bishops, but material is even again, and black has perhaps a bit better pawn structure",
        "15. bxc3 Bxa2 16. Kd2": "Trying to get the king in the game?",
        "16... Be6": "(to avoid any moves like c4)",
        "17. f4": "The advance begins",
        "17... g6": "Trying to stop it",
        "18. f5 gxf5 19. exf5 Bd5": "white seems to have an advantage in the one side, although most of his  pieces are not there. Black has clearly more power in the other, but his pawns are not at all advanced,",
        "20. Rhg1 a6 21. Ba4 a5": "Each one tries to attack in his strong side",
        "22. Bb3": "Offers exchange of bishops",
        "22... Bc6": "Rejects, so that the he keeps the pawn advantage in the side, although this adds pressure to f7, and generally the black king's side.",
        "23. Rde1": "Capturing the open column",
        "23... a4": "Advancing with tempo",
        "24. Ba2 Kg7": "Unforking f7, cause it may be needed soon. Black king gets a bit more active",
        "25. Re7": "Rook is on the 7nth line, more pressure for the black.",
        "25... Ra7 26. g5": "White seems to have some good chances here...",
        "26... d5": "reducing the pressure on the black king side",
        "27. g6 hxg6 28. fxg6 Kf6 29. Re2 fxg6": "Wins a pawn",
        "30. Rf1+ Kg7 31. Re7+": "Things don't seem so relaxing for the black, although the pawns have gone now...",
        "31... Kg8 32. Rxf8+": "White exchanges one rook, although these 2 were his biggest advantage in this side.",
        "32... Kxf8 33. Re6": "Threatens the bishop, and g6. If 33 ... B38, then it is Bxd5",
        "33... Bd7": "Prefers to exchange the side pawns, so there is no more danger from this side (he has an advantage on the other, even after d5 is gone)",
        "34. Rxg6 Bxh3 35. Bxd5 Ke7": "Trying to get the king into the game, and also avoid any rook threats",
        "36. Rh6": "Doesn't seem to have a real point there...",
        "36... Ra5": "Offers bishop exchange",
        "37. Ba2": "Rejects",
        "37... Bd7": "Supports pawn at a1",
        "38. Rh7+ Kd6 39. Rh6+ Kc5 40. Rh5+ Kb6": "White tries to check and then get an unguarded piece are correctly defended. Rooks exchange inevitable, if white decides so.",
        "41. Rxa5 Kxa5": "Rook exchange",
        "42. Kc1": "Getting his king in a better solution... Shows that 16 Kd2 was not so good...",
        "42... a3": "Keep advancing and keeping white king away from b2",
        "43. Kb1 c5 44. Bb3 Bb5 45. c4 Ba4 46. Ka2": "Black loses his pawn...",
        "46... Bxb3+ 47. Kxb3": "in \n47 cxb3 ?   Kb4\n48 Ka8       Kxb3",
        "47... a2": "Grants his king a better position",
        "48. Kxa2 Ka4 49. c3 Ka5 50. Ka3 Ka6 51. Ka4 Kb6 52. Ka3 Ka5": "(If i recall correctly, black offered a draw here, but white refused)",
        "53. Kb2 Ka4 54. Kc2": "White decides to avoid a draw and go for the win.",
        "54... Ka3 55. Kd2 Kb2 56. Kd3 Kb3 57. Kd2 Kxc4": "Black gets a pawn. Material is even, but black king is a bit better positioned",
        "58. Kc2": "White gets the opposition",
        "58... Kd5 59. Kd3 Kd6 60. c4": "Black hadn't thought of this move, thought he would be winning by  Kc4",
        "60... Kd7 61. Ke4 Ke6 62. Kf4 Kf6 63. Ke4 Ke6": "Draw offer accepted, since both players knew how to keep their positions..."
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=22772",
    "gameName": "Let's play chess",
    "players": "dbaker4 (1366) vs. guardiangr (1489)",
    "opening": "Scotch (C45), Ghulam Kassim variation"
}