{
    "moves": {
        "1. d4 Nf6 2. c4 g6 3. Nc3 Bg7 4. e4": "My intent was to play Smyslov-Petrosian against King's Indian, but GameDB showed that e4 is more popular.\ne4 also seemed more attacking than Bg5 as it captures more space.",
        "4... d6 5. Nf3 Bg4 6. Be2": "Just unpinning here.",
        "6... O-O 7. Be3": "o-o and e3 both seem equally good.",
        "7... e5 8. d5": "time to close the centre and make black's dark squared bishop useless. However, e4 may look weak if queenside pawn storm starts.",
        "8... c6 9. O-O": "Unless black captures, I decided to delay dxc6 till I can get a rook on d file.",
        "9... Bd7 10. Qb3": "Forcing black to push the b pawn.",
        "10... b6 11. Rfd1": "Plan in action - rook is xraying the black queen. Of course, I don't expect my opponent to fall for discoveries, but now I feel strong about my position.",
        "11... Re8 12. dxc6 Bxc6 13. Ng5": "As much as I'd like to claim brilliance, this was played with a weaker intent. First, to add protection to e pawn (since I didn't want the dark squared bishop to get free and attack). Second, the intent was to manouver a knight to d5 (one of them would be exchanged).\nAnd there was an outside chance that black will miss Qxf7.",
        "13... h6 14. Nxf7": "If black had not pushed the h pawn, I probably would not have sacrificed. [But I would have pushed c5]\nBut now a new plan emerges - sacrifice the knight (which wasn't doing much) and then train the bishop pair on black's king.",
        "14... Kxf7 15. c5+": "Discovered check - but I am going to win a central pawn and capture the d file with doubled rooks. Should be compensation enough.",
        "15... Kf8 16. Rxd6 Qe7 17. Rad1": "Capturing the (only) open file.",
        "17... Nxe4": "Of course this pawn was lost.",
        "18. Nxe4 Bxe4 19. cxb6": "Making space for dark squared bishop to train it's guns on black's king.",
        "19... axb6 20. Bxb6 Bc6 21. Bc4": "The choice between Bc4 and Bc5 was difficult. Both need to happen - but move order may have been important.\nBc4 would win the queen, but at the cost of quite a bit of material. (e.g., if white does some silly move), then\n22. Rf6ch or Re6 would have been an idea.",
        "21... Qg5 22. g3": "Defence. But black's light squared bishop is very powerful. I resolve to take it out at some point in future.",
        "22... Bh8": "Black saw my attack and made space for king.",
        "23. Bc5": "c5 comes now. It was important to check for any backrank issues - which I did. It was mostly accidental that queen was covering d1.",
        "23... Kg7 24. Rxc6": "This sacrifice was well thought out. Removing that bishop allows queen to infiltrate black's camp via b2 or f3.",
        "24... Nxc6 25. Qb7+": "And black resigned here. If king moves, 26. Qf7# is coming. Blocks are possible with Ne7 - but there are 3 attackers and black will lose queen and trade a lot of others. e.g., 25 ...Ne7 26. Bxe7 ... Qxe7 27. Rd7 and black will lose the queen."
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=65481",
    "gameName": "Let's play chess",
    "players": "apurvg (1589) vs. kindvall (1990)",
    "opening": "King's Indian (E90), 5.Nf3"
}