{
    "moves": {
        "1. d4 d5": "The queen's pawn game. My second choice opening as black, as my queen only has partial freedom, while her bishop has more freedom (the c8-h3 diagonal, the latter being a no-go).",
        "2. c4 dxc4": "I decide to accept the queen's gambit to get ahead. I do like to capture to do so, so then I can look for exchanges.",
        "3. e4 c5": "Moving to the Linares variation. I could force the king out of his initial position if my opponent captures: 4. dxc5 Qxd1+ 5. Kxd1 e6, then attempt to win back a pawn, or even 4. d5 e6 5. dxe6 Qxd1+ 6. Kxd1 Bxe6, or even get a queen exchange 4. Bxc4 Qxd4 5. Qxd4 cxd4 to be a pawn up.",
        "4. Bxc4 Qxd4 5. Qxd4 cxd4": "I think this was a reasonable exchange for me: I'm a pawn up, the queens are off the board, but my extra pawn is quite well advanced and unsupported, despite it being passed. So it will need some cover, especially that the c-file is now open...",
        "6. Nf3": "...as the knight comes out to attack it. Alternatively, I could attack his pawn, as I am behind on development, as the pieces could come at me...",
        "6... Nf6": "...so I bring out a knight to attack his pawn. I have pulled back on development, and I am attacking another pawn. If the pawn advances to 7. e5, I could play 7... Ned7 or Ng4 to attack it; should he play 8. Nxd4, I play 8... Nxe5 to regain the advantage.",
        "7. Nbd2": "...but he declines to do either, developing another knight, to cover from its twin. There's now no chance of me capturing the pawn, as the knight is now defending it...",
        "7... Nc6": "...so I now bring out my other knight to defend my own pawn. I have two developed pieces, he has three. However, I'm not too worried, as 8. e5 could be met by 8... Nd7 to have double control of the e5 square, and a potential fork.",
        "8. b3": "He hoping to fianchetto his bishop here, which would place my pawn under attack, so I must cover it...",
        "8... e5": "...and I do just that, with my king's pawn. Not only that, but I've also blockaded his own, and both pawns are covered by my queenside knight...",
        "9. Bb5": "...but my king's pawn won't stay guarded for too much longer, as the bishop has pinned my knight down. So I must find another way to defend my pawn from the knight on f3...",
        "9... Nd7": "...and that's bring my free knight back. Both knights control the e5 square, so my king's pawn is well defended, and could also be defended by my kingside bishop's pawn by playing f6, which would give a chain...",
        "10. Bb2": "...and as predicted, he fianchettos his bishop, but my pawns are too well defended. However, I have another idea...",
        "10... Bb4": "...and that's to pin his own knight down. Because I am ahead by virtue of having an extra pawn, I can go in for exchanges...",
        "11. O-O-O Bxd2+ 12. Rxd2": "...and I do just that, swapping my bishop for his knight. His rook was the piece which completed the exchange, because he didn't want to lose any tempo...",
        "12... a6 13. Bxc6 bxc6": "...and I get the opposite exchange, this time, my knight for his bishop. OK, I've now isolated my rook's pawn on the queenside, but it is currently defended by my rook, and by my bishop, but I am ahead on material, even if it is only a pawn, and the light squares are now slightly safer.",
        "14. Ba3": "This move prevented me from castling kingside, but castling is not such an issue with queens off the board (why is it so?) However, I have another potential plan...",
        "14... Bb7": "...and to put it into action, I fianchetto my own bishop. I'm hoping to capture the pawn on e4, to potentially create a second passed pawn, which I would get if I capture his kingside bishop's pawn, as long as the knight's pawn didn't capture on the f-file...",
        "15. Bd6": "...and my king's pawn is in trouble again, and I had to think carefully as to how to defend it...",
        "15... f6": "...and that was to create my chain: g7-f6-e5-d4, where the g7-pawn is the most vulnerable.",
        "16. Rc2 c5": "I now clear the path for my bishop to attack the e4-pawn, and to defend my d4 one with a second pawn...",
        "17. Re1": "...but now there's no chance of me capturing his pawn, now that the rook is defending it...",
        "17... Kf7": "...so I advance my king forwards to attack the bishop, and to connect my rooks.",
        "18. Bxc5 Nxc5 19. Rxc5": "I may have lost a pawn from this exchange, but the rook is on the same file as the king...",
        "19... Rhc8": "...so I pin the rook to the file, as both of mine are connected on the bottom rank, and the c8 square is also covered by my bishop...",
        "20. Rxc8 Rxc8+": "...and I get the first rook exchange, and check at the same time, which is why I used my other rook to complete the exchange.",
        "21. Kb2 Rc3": "And now I advance my rook to the 6th rank, hoping that he'll panic and play Rc1, so I can win back the pawn. There's not a lot my rook can do there, as I would need to play Bc6 then Bb5 unless he plays a4...",
        "22. Rc1": "...but he sure gave up the exchange here! Yet another opponent gives up an exchange, as his pawn is now exposed to my bishop...",
        "22... Rxc1 23. Kxc1 Bxe4": "...and I win back the pawn, after exchanging rooks. Again I have a bishop and an extra pawn for a knight, and I felt I was favourite here: I control g8, f8, e8, a8, h7, g7, e7, b7, h6, g6, f6, e6, c6, f5, d5, b5, f4, d3 and c3, he controls h4, c4, a4, h3, g3, b3, h2, d2, b2, g1, e1 and d1, while we contest g5, e5, d4, f3, e3, c2 and b1.",
        "24. Ne1": "He moves his knight to defend its pawn, so I cannot capture it. Instead, I must move my king to keep his own as far back as possible...",
        "24... Ke6": "...so I advance mine forwards to help out my bishop. We contest the f3, d3, g2 and c2 squares with our pieces...",
        "25. Kd2": "...and as the king relinquishes control of the b1 square, trying to stop my own king...",
        "25... Bb1": "...I can attack his queenside rook's pawn, and force it to move...",
        "26. a4": "...which it does, forcing the knight's pawn to lose some protection.",
        "26... Kd5": "My king can now close in on the queenside pawns, and threaten to create a passed rook's pawn on a6...",
        "27. Nc2": "...and as the knight moves in to cut off the bishop...",
        "27... Bxc2 28. Kxc2": "...I can trade the pieces, leaving a pawn endgame, with me a pawn up. I control h6, g6, f6, g5, e5, d5, c5, e4 and d4, he controls a4, h3, g3, f3, d3, b3, d2, b2, d1, c1 and b1, we contest b5, c4, e3 and c3. My king is better placed, so I can restrain the enemy quite easily.",
        "28... Kc5": "I now close in on his queenside pawns...",
        "29. f3 Kb4": "...and attack them, although I cannot yet take them...",
        "30. g4 a5": "...so I now advance my queenside rook's pawn to wast a move, as I am inviting the kingside pawns to come at mine...",
        "31. h4 g6": "...and I now decide to shorten the chain, to contest my 4th rank...",
        "32. h5 gxh5 33. gxh5": "...and we trade pawns, disconnecting his remaining kingside pawns...",
        "33... f5": "...and I move my bishop's pawn to contest the g4 and e4 squares, and to help my king's pawn...",
        "34. h6 e4 35. fxe4 fxe4": "...and we again trade pawns, giving me a powerful hold on the 6rd rank: the only squares on that rank I don't control are h3 and g3, so the king would have to go the long way round to eliminate my pawn on h7...",
        "36. Kd2 Kxb3": "...and I can now eliminate his queenside knight's pawn, and I can now go for a queen on e1 or d1...",
        "37. Ke2 Kc2": "...so I deny the king access to the d-file, only permitting him e1, f1 or f2...",
        "38. Ke1 e3": "...and I now advance my e-pawn forwards, hoping to get a queen on e1...",
        "39. Ke2 Kc3 40. Kd1 Kd3": "...and my king can now ensure it is possible. My opponent resigned here as 41. Ke1 e2 42. Kf2 Kd2 43. any e1=Q or 41. Kc1 e2 42. Kb1/b2 e1=Q, and I could go in for four queens to really rub it in."
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=25869",
    "gameName": "Let's play chess",
    "players": "crckinguraces (1266) vs. aspiemikey (1351)",
    "opening": "QGA (D20), Linares variation"
}