{
    "moves": {
        "1. e4": "so here's another game of mine where i manage to win the game. White starts with e4.",
        "1... c5": "i decided to go with the Sicilian",
        "2. e5": "this move was surprising cause i didn't really know hot to react to this. it does stop my king side Knight development.",
        "2... f6 3. exf6 Nxf6": "well it works like this also, but i weakened my king side a bit.",
        "4. d3 d5 5. Bf4 Nc6 6. Nc3 e5": "here i have a nice central grip and also managed to kick the bishop w tempo.",
        "7. Bg5 Qb6 8. Bxf6 gxf6": "now my king side is really weak, but in exchange i got his dsb, but I'm starting think about castling queen side.",
        "9. h3 Be6 10. a4 Qb4 11. a5": "this move just loses a pawn. i didn't know what white was trying at this point.",
        "11... Nxa5 12. Ra4": "now i see his point. attacking the queen and the knight. a nice move from white.",
        "12... Qxb2 13. Nce2": "i was threatening qxc3+ so knight retreats.",
        "13... c4 14. d4 e4 15. Rxa5": "this was a mistake because after 13.c4 my bishop gained scope and can now fork king and rook.",
        "15... Bb4+ 16. c3 Bxa5": "a free rook.",
        "17. f4 exf3 e.p. 18. Nxf3 Bxc3+": "another pawn won. no problem, ill take it.",
        "19. Nxc3 Qxc3+ 20. Kf2 Rc8": "decided to add support to c4, because its a passed pawn, and might be useful later on.",
        "21. Be2 O-O": "Now i just want to connect my rooks and there's really no major threat if kings on g2.",
        "22. g4 Rc7 23. Rg1 Rcf7": "doubling rooks to add pressure on the king after f pawn has been removed.",
        "24. h4 Rg7": "had to take a little control of the g-file, because it could be dangerous´s with that rook on g1.",
        "25. Nh2 Qh3": "I'm attacking the unprotected Knight so something has to be done.",
        "26. Rg2 Qxh4+": "free pawn again, and with check now.",
        "27. Kg1 f5 28. Qb1 fxg4 29. Qd1 h5 30. Rg3": "rg3?? this is blunder, because i cant see any threats after takes.",
        "30... Qxg3+ 31. Kh1 Rf2 32. Qg1": "by taking the queen i win the bishop.",
        "32... Qxg1+ 33. Kxg1 Rxe2 34. Nf1 c3": "this pawn is now getting dangerous.",
        "35. Ng3": "here black manages to win a pawn but is doesn't really matter.",
        "35... Rd2 36. Nxh5 Rf7 37. Ng3 c2": "And here white resigned cause he cant stop the queening of the pawn. hope you enjoyed:)"
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=52401",
    "gameName": "Let's play chess",
    "players": "papawh (1334) vs. vavavi (1308)",
    "opening": "Sicilian defence (B20)"
}