{
    "moves": {
        "1. e4": "WIN ON MOVE 12- destructive power of the Kings gambit. BISHOP AND KNIGHT SACRIFICE. However, when I played this gambit against players of ranking 1600 or higher, I often had losses. I learnt the kings gambit this summer, and this is one opening where you need some formal training to avoid the carnage that poor maten9 had to endure.\r\nPl rate and pass comments freely.",
        "1... e5 2. f4": "Offering the f pawn- seems easy pickings for the uninitiated",
        "2... Nc6 3. Nf3": "still dangling the f pawn for him, while developing",
        "3... exf4": "he cannot resist temptation, please fasten your seatbelts for we could be going for a rocky ride",
        "4. Bc4": "continue development and eye the f7 pawn, crucial in kings gambit",
        "4... g5": "he shores up f4",
        "5. O-O": "if he moves pawn to g4, that is when the CLASSICAL kings pawn gambit starts",
        "5... g4": "Now, it depends on my mood. If I want to continue the ride, I let him take my knight. If I am in a pessimistic mood and want to play safe I withdraw knight to e1. \r\nBut I have been told that that is even more unsafe, because the 2 pawns advance right up to the castled king with others to follow. Is that right, pl let me know",
        "6. d4": "okay, deep breath, take my knight. After all, life is sometimes about excitement and taking risks",
        "6... gxf3": "has to be retaken not with the rook but by the might queen, bring her to the f file. Note, ultimate target - f7 pawn",
        "7. Qxf3 Nxd4": "you lose pieces and pawns and it hurts. 2 options now- 1) Qx f4- clears f file   \r\nBut there is a more dangerous option - CAN YOU GUESS IT?",
        "8. Bxf7+": "BOOM",
        "8... Kxf7": "2 pieces sac now. options-  1.)  Bx f4, but then his q or knight could come to f6   2)  Qxf4, same problems.\r\nPLEASE GUESS AGAIN THIRD OPTION",
        "9. Qh5+": "I think from now on it should be straightforward with forced moves",
        "9... Ke7": "options, keep giving checks and use the e pawn and Rxf4 or???",
        "10. Bxf4": "this move is better for it adds another piece to the atack - the threat of bishop checking both k and q on g5",
        "10... Ne6": "note- all his pieces other than one knight are asleep",
        "11. Be5": "the squares around his king are finishing off now, one by one. his rook is in danger, but that is of minor interest now",
        "11... Qe8": "too late",
        "12. Qh4+": "He resigns. Kings gambit, highly unpredictable and dangerous. I never try it on anyone whose rating is above 1650 or so, because most of the time I lose.\r\nKey mistake for him, I think, was not bringing his queen to f6 on move 7- what do you think? Pl go back to move 7 and see.\r\nPL RATE and comment freely.  I hope you enjoyed this brief ride, I do feel a bit queasy annotating a win over a weaker opponent, but just like I learned a few months ago, someone else can learn this most unpredictable of all gambits."
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=19719",
    "gameName": "Let's play chess",
    "players": "dmisra (1619) vs. maten9 (1450)",
    "opening": "King's gambit (C30)"
}