{
    "moves": {
        "1. e4 c6 2. d4 d5": "Game with correct opening, very blunderouse middle game and nice ending",
        "3. Nc3": "Caro-Kann Defense\\Traditional",
        "3... dxe4 4. Nxe4 Bf5": "Caro-Kann Defense\\Capablanca Variation - Main Line",
        "5. Ng3 Bg6 6. h4 h6 7. Nf3": "Caro-Kann Defense\\Capablanca Variation - Main Line\\6.h4\r\n\r\n",
        "7... e6 8. Ne5 Bh7": "A rather withdrawn play by black opposed with nice expansion of white. However, center is rather week what gives a lot of possibilities to regain initiative for black",
        "9. Bd3 Bxd3 10. Qxd3 c5": "attempt to open a center",
        "11. Be3 cxd4 12. Bxd4 Nf6 13. O-O-O Qc7": "white castled queen side forming a battery on d file. Even though e5 knight appears to be well positioned, there is no edge or threat ",
        "14. Kb1 Nc6 15. Nxc6 Qxc6": "Black is developing with an exchange of its passive b6 knight with a potent e5 knight ",
        "16. Bxf6 gxf6": "white opens blacks king side. I've seen it coming yet decided it's not as issue, because assumed that a big exchange will take place, what will result in an endgame - where centred king is of a value",
        "17. f3 Bg7 18. Rhe1 f5": "a blunder by black, there is a pin on e6 pawn. f5 should be taken and after black castling king side. Rob IMHO should exchange white knight with black bishop what would led to a better end game for white. ( 1 in material, good paw structure, rooks on open files) vs (3 pawn islands)",
        "19. Ne2 a5 20. Nd4": "passive knight comes in the play, blacks plans to ram queen side with it's a pawn",
        "20... Qb6 21. c3 Rd8": "not the sharpest move of white (c3) weekend it's king protection. black countered with a pin on a d4 knight and is threatening with e5 (let's just assume there is no pin on e file ok?)",
        "22. Qe2 a4 23. a3 Rc8": "pin has been broken and a pawn advance is stopped. White king has some air in front of him and c3 is hanging ",
        "24. Qe3 O-O": "I have noticed a massive edge connected with my king being on E file so I castled",
        "25. Qd3 Rfd8 26. Qe3": "probably I should have annotated this game from this point, because now the nice action starts",
        "26... f4": "an attempt to push away white queen from defending c3 pawn",
        "27. Qg1": "(?) queen is withdrawn totally from defence of king. There is an discovery queen check and queen is positioned it self on g file that is bound to open in few moves, however black is posing a lot of pressure on week queen side",
        "27... Rxc3 28. Ne2": "Nice try to use discovery queen check  to take away the pressure, yet it's a blunder.",
        "28... Rc1+": "Rook sac and mate in one"
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=13249",
    "gameName": "Let's play chess",
    "players": "rob6857 (1470) vs. zal667 (1480)",
    "opening": "Caro-Kann (B19), classical, 7...Nd7"
}