{
    "moves": {
        "1. e4 e6 2. d4 d5 3. e5": "Advance Variation. French Defence. ",
        "3... c5 4. c3 Nc6 5. f4": "A new move for me. I knew 5. Nf3 and 5. Bd3. The 5 a3 variation and 5 Ca3 transpossed, generally, to 5 Nf3.",
        "5... Qb6": "Attacking d-pawn. Typpical for this variation.",
        "6. Nf3 Nh6": "I was thinking about 6... h5 and 7 Nh6. But this it´s too slow and weaking the kingside.",
        "7. Bd3": "Prevents Nf5 and allow the castle. The d-pawn is poissoned.7... cxd4 8 cxd4 Nxd4 9 Nxd4 Qxd4 10 Bb5+.",
        "7... Bd7": "Now, I can take the d-pawn",
        "8. Bc2 Rc8 9. a3": "The white shows your plan, a3-b4 to controlling c5 square. I can play Nc6-a5 to c4, but I do not like decentralising the knigth",
        "9... Be7": "Simple, but important, development. Controlling g5 and allowed the short castle.",
        "10. b4": "Consecuent.",
        "10... cxb4": "cxd4 it`s an alternative, but don`t like me. Now, the white must choice about retake with the a or c pawn. If take with c, opening the column-c but can play the knigth to c3 (not now, clearly).",
        "11. axb4": "Here, I analized 11...Bxb4 with 12 cxb4 Qxb4+ and if 13 Bd2 Qb2. If 13 Nbd2 Nxd4 14 Nxd4 Qxd4 and attacking Ra1 and f4, deffending a7 and white cannot castle Blacks had three pawns for piece and threating Ng4. But if white plays 13 Kf2, the black`s attack it`s over. 13... Ng4+ 14 Kg3 and here it`s safe.",
        "11... O-O 12. O-O": "If White plays 12 Qd3 g6 with threat in Bxb4.",
        "12... f6": "Common move in the French. Opening the f column",
        "13. h3": "This move weak the g3 square. White threats g4 but it`s inferior in development.",
        "13... fxe5 14. fxe5 Nf5 15. Qd3": "Now, Fritz gives me the continuation 15... Nxb4 with Bb5. I analized only 15... Bxb4 but falls 16 g4.",
        "15... g6": "Protects h7.",
        "16. g4 Nfxd4": "Conceptual and tactics sacrifice. Blacks have a superior development (See Bc1-Nb1-Ra1) and the threats with Bb5 or Nb4. Rook in c sees the bishop in c2, too.",
        "17. cxd4": "If 17 Nxd4 Rxf1+ 18 Kxf1 Nxd4 19 Qxd4 Qxd4 20 cxd4 Rxc2 and black it`s a tempo more for Rxc1. If 18 Qxf1 Nxd4 19 cxd4 Qxd4+ and Qxa1.",
        "17... Nxb4 18. Qb3": "May be, the queen is best in d2",
        "18... Nxc2 19. Qxb6 axb6 20. Ra2": "I misscalculated for 20 Ra7 Rxf3 21 Rxf3 Nxd4 22 Rf1 Rxc1 23 Rxc1 Ne2+ 24 Kf1 Nxc1 25 Rxa7 Bb5+ and Bc5. But, 22 Rf1??, if 22 Kg2 white it`s better.",
        "20... Nxd4": "Specullating for Rxc1, winning a piece.",
        "21. Bh6 Rxf3 22. Rxf3 Nxf3+ 23. Kg2 Nxe5 24. Nd2 g5": ""
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=39966",
    "gameName": "Let's play chess",
    "players": "inasfour (1619) vs. chizzo83 (1720)",
    "opening": "French (C02), advance variation"
}