{
    "moves": {
        "1. e4 c5 2. f4 d5": "this i don't know why he pulled off the Queen opening against the King opening. ",
        "3. e5": "King opening going for a push",
        "3... e6 4. Nf3 c4 5. Nd4 f5 6. Be2 Nc6 7. Nxc6 bxc6 8. O-O Be7 9. d4 Bf8 10. Nc3 a6 11. a4 Ne7 12. b4 Ng6 13. b5": "pawn is going for the push",
        "13... cxb5": "he take the bait",
        "14. axb5": "but he don't move that pawn because he lose a rook",
        "14... Qh4": "i think it's a bad move on his part",
        "15. g3 Qe7": "waste of a move but it force his queen back away from the take either from the pawn or by thing king",
        "16. b6": "pawn is still going for the push",
        "16... Nh4 17. Rb1 h6 18. gxh4": "not one of the best move put using the check to my advantage",
        "18... Qxh4 19. Bh5+": "messed up the person castle. \"Castle Early As Possible\"",
        "19... Kd8 20. b7 Bxb7": "not one of the best side to do but goes up in points",
        "21. Rxb7 Kc8 22. Rb6 Qe7 23. Na4 Qd7 24. Nc5": "trying to fork the queen but forgot that the bishop was there",
        "24... Bxc5 25. dxc5 Qc7 26. Rxe6 Qxc5+": "first check for black",
        "27. Rf2 c3 28. Rd6 Rb8 29. Rxd5 Qc4 30. Ba3 Kb7 31. Rd7+": "going for the boxing fork",
        "31... Ka8 32. Bf3+": "getting it set up for the kill",
        "32... Rb7 33. Bxb7+": "shift in points and a game changer for me",
        "33... Ka7 34. Bc6+ Kb6 35. Qb1+": "now it's getting there and forcing the queen to move",
        "35... Qb5": "MINE!!!!",
        "36. Bxb5 axb5 37. Rd6+": "U wonder why he didn't move away from it but he move toward the mate",
        "37... Ka5": "you know where the mate it",
        "38. Qb4#": "38 moves just to mate the person. he had an strong idea where to do but he made alot of mistake and same goes for me. i had a possible mate somewhere in the early 20 move but didn't find it. next chance was in the 30 move but it didn't go the way it plan. over all of this match. he or she put up a good fight and try not to lose the queen in the process"
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=34826",
    "gameName": "Let's play chess",
    "players": "krazysick614 (1117) vs. grandnight (995)",
    "opening": "Sicilian (B21), Grand Prix attack"
}