{
    "moves": {
        "1. e4 e5 2. Nf3 d6": "Of all the defenses I play against, I think I like this one least.  Although the potential for play with 3. Bb4 is there, it never leads to a clean game, merely a muck.",
        "3. Nc3 c6 4. d4 Qe7 5. Bc4 h6 6. O-O g6": "This gave me an idea: I was playing a pawn-roller.  Usually the best way for me to play these games is let the pawns come until they weaken themselves.",
        "7. b3": "Why?  A newly found fondness for the fiancetto, I suppose.  There's not really a good tactical reason, 7. Be3 is better.",
        "7... Bg7 8. Re1 b5 9. Bd3 Nf6 10. Bb2": "Preparing to assault the Queen's pawns; the diagonal must hold.",
        "10... O-O 11. d5": "If 11. ... cxd5 12. Nxd5 will eventually anchor Black's center with the KP.  If 11. ... c4 12. Bxb5 wins a pawn and a huge bishop threat.",
        "11... Bb7 12. dxc6 Bxc6 13. Bxb5 a6 14. Bxc6 Nxc6": "White wins a pawn.",
        "15. Nd5 Qe6 16. Nc7 Qg4 17. Nxa8 Rxa8": "White wins the exchange.",
        "18. Nd2": "Looking to capitalize on his progress, White tries to trade off the Queens.",
        "18... Qe6 19. Nc4 Bf8 20. Nb6 Ra7 21. Nd5 Nd7 22. Qd3 a5 23. g3 a4 24. Qc4 a3 25. Bxa3": "A bad mistake.",
        "25... Nd4 26. Bb2 Nf3+ 27. Kg2 Nxe1+ 28. Rxe1": "Black has won back the Rook, and will win a pawn back as well.",
        "28... Rxa2 29. Rb1 h5 30. Ba3": "White forgot Qc3 first, and should have then moved Ra1.  Another stupid mistake.",
        "30... Rxa3 31. Ne3 Qxc4 32. Nxc4 Ra2 33. Ne3 Bh6 34. c3 Bxe3 35. c4 Bxf2 36. Kh3 Nc5 37. b4 Nxe4 38. b5 Nc3 39. Rb3 Na4 40. Rd3 Bc5 41. b6 Nxb6 42. Rc3 Ra4": "That was ugly.  White gives up.  Lesson: don't stop thinking just because you have a huge advantage."
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess-philidors-defense?gm=28116",
    "gameName": "Let's play chess (Philidor's Defense)",
    "players": "jmfpeaceable (1421) vs. queensbuster (1320)",
    "opening": "Philidor's defence (C41)"
}