{
    "moves": {
        "1. e4": "Standard open-game Opening for white",
        "1... c6 2. Nf3 d5 3. e5": "White pushs with intent of staking more space in the center, baring in mind the risk of over-extension.",
        "3... g6 4. d4 Bg7 5. Bf4 Qb6 6. b3 Bg4 7. c3": "Continuing to uphold the center.",
        "7... c5": "black naturally aims to undermine it.",
        "8. Be2 cxd4 9. Qxd4": "white offers to exchange queens early in hopes of leaving  the middle game to whomever is superior in thier minor piece placement .",
        "9... Qc6": "declined.",
        "10. h3 Bf5 11. a4": "attempting to claim more space on the queenside relegating castling to lower priority.",
        "11... a6 12. b4 Bc2": "white didn't expect a double attack on a4, but it proved escapable anyways.",
        "13. b5 Qe6 14. Qd2 Be4 15. Nd4 Qd7 16. f3 Bxb1 17. Rxb1 e6 18. O-O": "Finally castling as a rook move, inorder to double up the rooks on the queenside.",
        "18... Qc7 19. b6": "still pushing",
        "19... Qc5 20. Kh1": "relieving the knight pin immediately. (though in hindshight, 20. Be3 may have been worth hanging the e5 pawn in exchange for the tempo & initiative.)",
        "20... Nd7 21. Be3": "Not caring too much for the e5 pawn compared to protecting the queenside advantage and the chance to attack the queen.",
        "21... Bxe5 22. Nxe6": "! and this where white expected a great combination of possible attacks, with something along the lines of 22. ... Bxc3 23. Bxc5 Bxd2 24. Nc7  Kd8 25. Nxa8 Nxc5 26. Rf-d1 Bf4 27. Rxd5  Nd7 28. Rb4 Ng-f6 29. Rxd7  Nxd7 30. Rxf4 Ke7 31. Nc7 Nxb6 32. a5 and white would come out ahead.\r\n",
        "22... Qe7": "But trading queens was once again declined.",
        "23. Nc7+ Bxc7 24. bxc7 b6 25. Rfe1": "preparing to pin the queen from atleast 2 moves away.",
        "25... Rc8 26. Bxa6 Qd6": "Black sees it, but can't stop it with movement of the queen alone. 26... Ne5 would have fared better.",
        "27. Bc5+": "Discovered check and the queen the falls! Black resigns."
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=908",
    "gameName": "Let's play chess",
    "players": "punkusmartyrus (1506) vs. trevmorris (1463)",
    "opening": "Caro-Kann defence (B10)"
}