{
    "moves": {
        "1. d4 Nf6 2. c4 e6 3. Nc3 Bb4 4. e3": "Nimzo-Indian, Rubinstein system. I like this better than the Capablanca version, 4. Qc2, and better than immediately putting the question to the bishop with 4. a3.",
        "4... O-O": "The most natural move, and the one most played on Gameknot too.",
        "5. Bd3 d5 6. Nf3": "I believe 6. Ne2 is the more logical continuation, not blocking my own pawns, inhibiting me from building up a large centre with f3 sometime.",
        "6... dxc4 7. Bxc4 c5": "I believe 7 ... Nd7 is played more often here. White usually castles then, and than black plays 8 ... c5. I actually think playing c5 on this turn is better than the next turn, since I haven't  castled yet and there is no knight obstructing Black's queen.",
        "8. a3": "Necessary. Black can now exchange on c3, reinforcing my centre, or take my pawn on d4, agreeing to a pawn structure with my pawns on c3 and b4. Retreating to a5 is also a good option, not yet agreeing on anything and leaving me to figure out how to hold the centre.",
        "8... cxd4 9. axb4 dxc3 10. Qc2": "I thought long about this move. As I said before, I believe this position is more common with the moves 0-0 and Nd7 included. Now, if I play 10. bxc3, he'll probably play 10 ... Qxd1 and I lose castling rights as well as hopes of an attack. Loss of castling rights might not be that bad with the queens off, but I rather have my king out of the centre. (Although, in the game, my king never leaves e1!) I could initiate an exchange of queens myself, but I didn't feel comfortable that way. So, I decided on this move, sacrificing a pawn but letting my dark-squared bishop into play via b2. Note that both my bishops and queen are aiming at the Black's king castled position.",
        "10... cxb2 11. Bxb2 Nbd7": "Blocking his queen and bishop but lending strength to the knight on f6, the main defender of Black's castled position.",
        "12. h4": "It should be obvious that I'm planning on a kingside attack, so Black's next move came as a surprise to me.",
        "12... Nb6": "Not such a good move. Black attacks my light-squared bishop but removes support to the f6-knight.",
        "13. Bd3": "I could have also played 13. Ba2, but I figured that would take to much time. At least now I'm threatening to win back the pawn with 14. Bxf6 Qxf6 15. Bxh7+.",
        "13... Bd7": "This is definitely a mistake, not a fatal one, but a mistake nonetheless. Black is probably trying to achieve counterplay along the c-file, but that takes to much time. Black is acting like his king is perfectly safe. Or he thought that after 14. Bxf6 Qxf6 25. Bxh7+ loses, because my rook on a1 is attacked and that I therefore do not have the time to retreat my bishop, leaving it vulnerable to entrapment.",
        "14. Bxf6": "I thought it was time to attack.",
        "14... Qxf6 15. Bxh7+ Kh8 16. Ra5": "Looking at this situation, my position is far from a winning attack. Actually, I think Black is better here. Moves like 16 ... Ra(f)c8 and 16 ... Ba4 come to mind. My queen has to defend the bishop, Instead came a blunder.",
        "16... g6": "I now have the ability to open up the h-file, leading to a definitive attack. ",
        "17. h5 Kxh7": "Moves like 17 ... Ra(f)c8 or 17 ... Ba4 are still preferable but do not change the outcome.",
        "18. hxg6+ Kg8": "18 ... Kg7 leads to 19. Rh7+ Kg8 20. g7 and Black has to give up his queen to fend off mate.",
        "19. g7": "The winning move. If Black takes the pawn, he again needs to give up his queen. If the rook moves, mate follows too: 19 ... Rf8 anywhere 20. Rh8+ Kxg7 21. Qh7#"
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=36133",
    "gameName": "Let's play chess",
    "players": "ragozin (1719) vs. hahn (1695)",
    "opening": "Nimzo-Indian (E48), 4.e3 O-O, 5.Bd3 d5"
}