{
    "moves": {
        "1. e4 e5 2. Qf3": "En udda öppning KP (C20), Napoleon's opening",
        "2... Nf6": "Helt ny teori, och jag går på känn. 2. Nc6 är det vanligaste draget med 40-40 lika.",
        "3. Bc4": "Vit följer teorin med 54-18 till vit.",
        "3... Bc5": "Fortsätter att spela intuitivt och draget finns i world book med 50-50 lika.",
        "4. g4": "-1,53 Vit lämnar teorin.",
        "4... d5": "-1,34 öppnar upp spelet i centern, men vit har tre anfallare på d5 mot mina två.",
        "5. exd5": "-1,23 och jag utvecklar med attacker.",
        "5... Bxg4": "-1,25 och svarts bästa drag.",
        "6. Qg2": "-1,35 något starkare hade varit att parera med Qg3.",
        "6... c6": "-1,24 ett långsiktigt drag som parerar b7. Men bäst hade varit Qe7 tätt följt av bondelyftet till e4.",
        "7. h3": "-1,55 Vit försenar sin utveckling och förlorar tempo.",
        "7... Bf5": "-1,63 och bästa tillflykten. Behåller kontrollen ner mot vits planhalva.",
        "8. Qf3": "-5,73 Vit inbjuder till en skevis och och förlorar såväl tempo som material.",
        "8... Be4": "-6,08 och svarts bästa drag.",
        "9. Qg3 Bxh1": "-5,97 och ett givet kap.",
        "10. Qxg7": "-15,21 och vit har för bråttom. Mindre uselt hade varit Qxe5",
        "10... Ke7": "-5,82 och även svart har för bråttom. Här hade 10...Rg8 varit rejält vinnande. Min springare skyddas av D och mitt T hade skyddats av min S, och sedan hade jag gått ner med Rxg1.",
        "11. d6+ Kxd6": "-6,45 och den rätta pareringen. Hade jag parerat med D så hade vits D kunnat nästla sig in med Qxf7 + och skapat stress.",
        "12. Qxf7": "-7,01 allt lugnt, men jag vill helst få hem min K så här tidigt i spelet. ",
        "12... Nbd7": "-7,21 och svarts bästa drag i det här läget. Min K kan sedan söka skydd bredvid S utan att vits D kan komma åt.",
        "13. Qe6+": "-7,53 och den väntade schacken.",
        "13... Kc7": "-7,70 och nu ser det lugnare ut.",
        "14. h4": "-10,67 vit gör ett banaldrag och förlorar tempo. Här ser jag att min L på h1 inte gör nämnvärd nytta, så den kan lika gärna utväxlas.",
        "14... Bd5": "-8,65 och vit har inte mycket att välja på.",
        "15. Bxd5 cxd5": "-6,10 och starkare hade varit att slå Nxd5, för att sedan bygga upp ett avancemang mot vits planhalva.",
        "16. c3": "-8,89 och vit får inte fart på spelet.",
        "16... Rg8": "-7,75 och jag vill upp till vits planhalva.",
        "17. Ne2 Rg2": "-5,15 och där gör mitt T mer nytta.",
        "18. b4": "-8,49 och vit underlättar min framfart upp till hans planhalva.",
        "18... Bxf2+": "-8,91 och fokus är nu flyttat över till vits K.",
        "19. Kf1": "-12,71",
        "19... Rh2": "-13,88 och snart kommer min D att behövas för den slutliga nådastöten.",
        "20. b5": "-29,86 och jag övervägde att gå upp med Ne4, vilket hade skyddat min L om jag schackat med T på h1.",
        "20... Bxh4": "-15,82 och mitt övertag tillåter i princip vad som helst.",
        "21. Ba3 Rf2+": "-10,13 om vits K går till g1 så är matten snart ett faktum.",
        "22. Ke1": "-10,94 och fullföljer min plan att få upp min D i spelet.",
        "22... Qg8": "-10,81 och vit har inga underbyggda hot att komma med.",
        "23. Qd6+": "-13,83 och en lam attack som snart är över.",
        "23... Kd8": "-14,16 och det är intressant att se hur vits D är inlåst av mina springare.",
        "24. d4": "Här hade ett proffs satt matt i sex drag, men jag behöver några fler. Min D till g4 hade satt igång ett snyggt mattnät.",
        "24... Rh2+": "Det blir matt så här också.",
        "25. Kd1 Ne4 26. dxe5": "Det blir matt vad jag än jag gör, och som amatör tar man motståndarens D när chans gives.",
        "26... Nxd6 27. exd6 Qg2": "Nu är matten nära.",
        "28. Kc1 Qxe2 29. Nd2": "Ett par sista andetag från vits sida.",
        "29... Qxd2+ 30. Kb1 Qc2#": "Klappat och klart. Napoleon mötte sitt Waterloo ;-)"
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=43046",
    "gameName": "Let's play chess",
    "players": "robbiehoran3 (1184) vs. highlandt (1562)",
    "opening": "KP (C20), Napoleon's opening"
}