{
    "moves": {
        "1. e4": "FALKBEER COUNTER-GAMBIT\r\n\r\nWhite claims the center and opens lines for the King's Bishop and Queen",
        "1... e5": "The most popular answer to the King's opening, since this movement keep certain simmetry in the center, which is possitive for the black side",
        "2. f4": "White  response with a King's Gambit. It sacrificies his f pawn to launch a quick attack on the black king. The problem is that when his attack is over, his defence turns weak.",
        "2... d5": "Falkbeer Counter-Gambit: I love this response for blacks, because it allows to get out both bishops",
        "3. exd5": "White accepts the gambit pawn",
        "3... exf4": "Until this move, things flow as usual",
        "4. Nf3": "Now, the game has turned into Abbazia defence, modern variation, which (IMAO) it offers a wider range of oportunities for the black side than for the white one",
        "4... Nf6": "Now, there is several ways to follow the gambit properly, I chose this variant to go on the attack, though perhaps the more logical way of doing it would be e4 or even c6",
        "5. c4": "White likes to protect his doubled pawn. Besides, he opens a way to get out his Queen and menace blacks' King",
        "5... c6": "Now black decides follow with Marshall/Nimzowitsch Counter-Gambi offering another pawn and covering the King from the Queen menace\r\n",
        "6. dxc6": "White break his doubled pawn column and opens a wide area in black pawns line",
        "6... Nxc6": "Of course this is the most natural response, since if bxc6, black leaves a pawn without any effective defence",
        "7. d4 Bb4+": "The black attack begins...",
        "8. Bd2": "Bd2! White tried to defence. He could choose among this movement or Nc3. ",
        "8... Qe7+": "Black's attack goes on",
        "9. Be2 Bg4": "Black's attack III",
        "10. O-O": "0-0! IMAO, This is the best way to get rid of annoying Black pieces.",
        "10... O-O": "Okay, I had a doubt here, I wasn't sure if 0-0 or 0-0-0. I felt more weakness in the other side, so I got the short one. It is true that this one, doesn't allow me to be more agressive on attack...",
        "11. Bxb4": "Bxb4. Perhaps the white side should have continued with d5",
        "11... Qxb4": "Now, the final attack is served",
        "12. Qc2 Bxf3 13. Bxf3 Nxd4 14. Qc1": "Qc1?? ",
        "14... b5": "Ok, this movement is a tricky one, but wheather White realised or not, Black side still has huge chances to punish the white defence",
        "15. Bxa8": "... He didn't notice anyway",
        "15... Ne2+": "Game over.\r\n\r\nCute, isn't it?"
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=7262",
    "gameName": "Let's play chess",
    "players": "warn1584 (1542) vs. numh (1556)",
    "opening": "KGD (C31), Falkbeer counter-gambit"
}