{
    "moves": {
        "1. e4 d6 2. d4 Nh6": "I dont remember why I played the N here, obviously it was a blunder however it resulted in a N for B trade. ",
        "3. Bxh6 gxh6 4. Nf3 e5 5. dxe5": "I was ok with playing dxe5 and leaving my Q open for another swap.",
        "5... dxe5 6. Qxd8+ Kxd8 7. Nc3 Bd7 8. Nxe5 Be6 9. O-O-O+ Ke8 10. Nb5 Na6 11. Nc3 Be7": "I was ok with leaving my N exposed for another N for B swap. The board was open with good diagonals. I figured my B's would be more efficient on this board and would have an advantage over his N's.",
        "12. Bxa6 bxa6 13. b3 Rd8": "Again, I was playing the swap. At this point I was down in material but I was ok with reducing the pieces on the board. My B's still have plenty of operating room and would carry the day.",
        "14. Rxd8+ Bxd8 15. Nc6 Bf6 16. Ne2 Bg4 17. f3 Bd7 18. Nxa7": "While he captured another piece, his N was left dead in the water. It would not be able to move without being captured. This allowed me to divert my attention to other areas of the board. ",
        "18... Ke7 19. Nf4 Bg5": "I think my opponent was trying to maneuver on my K however I dont know. It left me with a solid pin against his K. I was able to use that to my advantage. ",
        "20. g3": "I think a better move at this point should have been Rd1. He would have forced me to make a decision about my B on D2 and could have saved his N. ",
        "20... Ra8 21. h4 Bxf4+ 22. gxf4 Rxa7": "I was ok with swapping my B for his N at this point. The end result of the captures would leave me ahead in material.",
        "23. Rg1 Ra8 24. Rg7 Rh8": "I figured his only move was attacking my pawn H7. From this position, any movement other than retreat leaves me at a sizeable material advantage. ",
        "25. f5 Kf6 26. Rg2 Ke5 27. Rd2 Rd8 28. Rf2 Bc6 29. c4 Kf4 30. Rd2 Rxd2": "I was fine with swapping R at this point. My K was in an ideal location to remove his pawn structure.",
        "31. Kxd2 Kxf3 32. Kd3 Bxe4+ 33. Kd4 Kf4 34. a4 Kxf5 35. b4 h5 36. b5 axb5 37. cxb5 c6": "I was fine with playing my pawn forward due to the location of my B. ",
        "38. Kc4 cxb5+ 39. Kxb5": "From my current location I am not worried about his a file pawn advancing due to the location of my B. It would be able to promote but would be immediately be captured. I was not able to focus on moving my f file pawn towards promotion.",
        "39... Ke5 40. a5 f5 41. Kb6 f4 42. a6": "At this point my opponent offered me a draw and I declined. I was certainly ahead in the match and their was only one acceptable result. ",
        "42... f3": ""
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=55621",
    "gameName": "Let's play chess",
    "players": "seancr (1083) vs. jallen85 (935)",
    "opening": "Pirc defence (B07)"
}