{
    "moves": {
        "1. Nf3": "This game is annotated in an entertaining way, from white's point of view. Some remarks could be interesting to beginners / intermediate players.\n\nStriking opening: 1. Nf3!\nCalled the Reti opening in honor of chess player Richard Reti.\nUsually the plan is that whatever your opponent does, you push the g pawn, fianchetto the light square bishop, then castle. In this way your king is well protected from the beginning.\nIt is considered defensive and not much used at top level.\n",
        "1... d5": "1 ...d5 Classic reply to the Reti opening.",
        "2. g3": "Pushing the g pawn as scheduled.",
        "2... Nc6": "Standard reply too.",
        "3. Bg2": "Fianchettoing the light square bishop as scheduled.",
        "3... e5": "Oh, black is controlling the center now.",
        "4. d4": "Time to get dirty and go too!",
        "4... e4": "Oh, he has a pawn on my side, and is threatening the knight.",
        "5. Ne5": "Let's escape to e5! What do you think of this outpost?",
        "5... Bd6": "What? Help, he's chasing my knight! I can protect him with the dark square bishop, or... ",
        "6. Nxc6": "That's it, let's take the knight. OK mine moved three times and his only one, but...",
        "6... bxc6": "He has to alter his pawn structure to recapture. So, in terms of imbalances, so far I lost some tempos and he has an altered pawn structure.",
        "7. c4": "OK now let's advance the c pawn to go to c5, if he captures, he will have a very bad pawn structure (three pawns on the same file, that can be good in some situations but here I'm not too sure), plus I can take the e pawn with the bishop.",
        "7... Be6": "OK he doesn't take and develops his bishop, defending the d pawn.",
        "8. c5": "So let's advance inside his side too, and attack his other bishop at the same time!",
        "8... Be7": "He has to retreat.",
        "9. Qa4": "The c6 pawn is vulnerable, so let's threaten it. It's also interesting to have a diagonal targeting the adverse king.",
        "9... Qd7": "He choses to defend with the queen.",
        "10. f3": "It would be good to get rid of this e4 pawn, who has already well walked.\nIf he takes I recapture with the e pawn, creating a semi open e file for a future rook.\nOtherwise I just take with the f pawn, creating a semi open f file for a future rook.",
        "10... Nf6": "Hmmm he choses to defend the e pawn by developing the knight. The problem is now, if I take, he will have a powerful knight on e4, defended by the d pawn.",
        "11. Bg5": "I think it's worth sacrificing the bishop to kill the knight. He's defending d5 and e4, and he's well positioned if black decides to castle kingside.",
        "11... O-O": "Well, black just castles kingside.",
        "12. Bxf6": "So... so long for keeping the bishop pair, bye bye Mr Knight. Say hello to Keat.",
        "12... Bxf6": "Wisely, he recaptures with his bishop and not with the g pawn.",
        "13. fxe4": "Now I can go with the initial idea and take the e pawn. ",
        "13... dxe4": "He recaptures, and I will be able to take with the bishop. But wait! Now he has two attackers targeting my d pawn, who is only protected by my queen! If he takes the d pawn, he will furthermore take the c pawn and destroy my center.",
        "14. e3": "I prefer to build a solid diagonal spine of three pawns. The e pawn is not defended, but it's not threatened so far.",
        "14... Bd5": "Of course he defends the e4 pawn, and now he also has a strong diagonal spine, with the bishop defending both extreme pawns.",
        "15. Nc3": "His e pawn is still here, invading my side. My turn to develop a second piece threatening him.",
        "15... Qe6": "He moves his queen to defend e4.\nAt this point my impression is that the game is a bit stuck. The opening is over, we're in the midgame. Someone has to take the initiative.",
        "16. h4": "This move is probably not very good. The plan is to move on towards the black g and h pawns defending the king. On the other hand, my queen is a bit isolated on the a4 square, I should think of a way to put her back in the game... maybe Qd1?\nTrading my knight against his bishop is tempting, but the drawback is that it would reorganize his pawn structure.",
        "16... Qg4": "Damn, the black queen has taken advantage of the previous move. She threatens the g pawn now. Too late to bring back the white queen. ",
        "17. Ne2": "So far, I have no real plan to attack, and the only thing I see to defend the pawn is to bring the knight to e2. I have considered Kf2 too, but after something like Qf5 I wouldn't know what to do. ",
        "17... a5": "Now he plays on the queen side. It's likely I won't castle kingside, and he has a semi open file (b). On the other hand, I notice that his queen is a bit constrained, can we trap her somehow? If Bh3, her only free squares are h5 and g6. How to control them?",
        "18. Kf2": "Commiting move, as I cannot castle anymore. The idea is that now it is the king who will protect g3, so I can bring the knight to f4 and control g6 and h5!",
        "18... Rfb8": "He attacks the b2 pawn, threatening to arrive on the second rank.",
        "19. Qc2": "Opportunity to move the queen towards the active side of the game, defending the b pawn.",
        "19... Rb4": "He goes in. This is unpleasant, the rook is threatening to attack the queen by going to c4, I have to do something.",
        "20. b3": "Defending a4 and c4.",
        "20... Rab8": "He doubles the rooks, threatening the poor b3 even more. I decide not to care and go on with the trapping plan. ",
        "21. Nf4": "OK knight moved to b4, good. But... the super plan doesn't work! If Bh3 then Qf3+. ",
        "21... a4": "So black has now 4 attackers targeting b3.\nOne can see that if the b8 rook ever leaves its rank, I may be able to backrank-checkmate him.\n",
        "22. Rhb1": "So let's play Rhb1 with the strange idea:\naxb3 axb3 Bxb3 Rxb3 Qxb3.\nIf Rxb3 then Ra8+ Qc8 Rxc8+ Bd8 Rxd8++!",
        "22... h6": "Ooooooh he saw that and created an escape square for his king. No way! But wait, something appears: his e4 square is not defended anymore by the queen because the knight is now blocking the path. So...",
        "23. Bxe4": "This move attacks the h7 square blocking the king's exit... At the same time there is still a b-plan to trap the queen with Bf5! It didn't work from the front, let's try from the back (sentence not to take out of context).",
        "23... axb3": "OK he takes the b3 pawn. He could have taken the bishop as well.",
        "24. axb3": "I recapture, the a file is now open! Ready to sacrifice the queen for a backrank mate.",
        "24... Bxb3": "He still decides not to take the bishop and takes the pawn instead, threatening the queen. But it is a free bishop for me since after Rxb3, if Rxb3 then Qxb3.",
        "25. Rxb3": "OK I capture the free bishop with the rook.",
        "25... Rb4xb3": "And he recaptures. Here I have also considered Bf5 as mentioned earlier, but the problem is: Rb2 Qxb2 Rxb2+ checks the white king, so no time to bring the remaining white rook to a8...",
        "26. Qxb3": "This leaves us with Qxb3, not so bad. If Rxb3 then Ra8+ leading to mate, and if he doesn't retreat the queen Bf5 is still trapping her. And I'm up materialwise.",
        "26... Qc8": "This is probably the best move he could have played, at the same time defending the rook and saving the queen from being trapped.",
        "27. Bf5": "Let's carry on attacking the queen.",
        "27... Qd8": "He retreats. Now his rook is a threat to my queen as my rook can't go to the 8th rank anymore. ",
        "28. Qc4": "So let's move away.",
        "28... Rb2+": "The rook finally leaves the 8th rank, protected by the queen, to check my king. Not a big issue. ",
        "29. Kg1": "King is pretty safe here.",
        "29... g5": "He attacks my knight with his g pawn. I think this is a mistake, as g7 is now empty.",
        "30. Bh7+": "Let's go closer to the adverse king. If Kxh7 then Qxf7+ (taking advantage of the empty g7 pawn) which puts the king in a very uncomfortable situation.",
        "30... Kg7": "He doesn't take and goes to g8. f8 was a better square, as I can now advance the knight and check him at the same time.",
        "31. Nh5+": "Threats are too strong now, and I think that he doesn't have any real plan. He resigns."
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=56068",
    "gameName": "Let's play chess",
    "players": "radjaidjah (1558) vs. ash0ka (1615)",
    "opening": "Reti (A07), King's Indian attack (Barcza system)"
}