{
    "moves": {
        "1. d4 d5 2. Nf3 Nc6 3. e3": "Generally, Nc6 is not ideal for Black because it impedes the c pawn.",
        "3... a6 4. h3": "This is a wasted tempo.  a3 could be played, or Be2.  h3 can be played later if it is needed.",
        "4... Nf6 5. c4 e6 6. Nc3 g6 7. Be2 Bg7 8. O-O O-O 9. a3 b6 10. Bd2 Re8 11. Rc1 Bb7 12. cxd5": "This opens the c file for the R, but Black is going to get an open file also.",
        "12... exd5 13. Qc2 b5 14. a4": "This is a horrible version of a minority attack!",
        "14... b4 15. Na2 a5 16. Bb5 Re6": "Black manages to seal everything up and White's a2 N is terribly misplaced.  It will need many tempos to get back into play.  Black has a nice positional advantage here.",
        "17. Qd3 Na7": "This is a good move that I didn't anticipate.  The b5 B is now in a very awkward position.",
        "18. Qe2": "Giving the B a retreat square.",
        "18... Nxb5 19. axb5": "If Qxb5, Black follows with the skewer Ba6 and wins at least the exchange.",
        "19... c6 20. Rfd1": "If the natural bxc6 is played, Ba6 is still operative.",
        "20... cxb5 21. b3": "Qxb5 might have been better, but the Q is forced to a bad square where it can likely be trapped after Ba6.",
        "21... Ba6 22. Qe1 Nh5 23. Rca1 Qd7 24. Nxb4": "This is lame, but passive defense will lose here too.  Black's position is much more coordinated.",
        "24... axb4 25. Bxb4 Bb7 26. Rxa8+ Bxa8 27. Ra1 Bb7 28. Rc1": "Ra7 might have been more resilient.",
        "28... Nf4 29. Qd2 Nh5 30. Ba5 Bc6": "Black had to stop the threat of Rc7.",
        "31. Ne1 Nf6 32. Nd3 Qe8 33. Nc5 Ne4": "Ne4 makes a bigger threat than Nxe6!",
        "34. Nxe4 Rxe4 35. Bb4": "Practically speaking, Black just has to exchange appropriately into an easy endgame.",
        "35... Re6 36. Qd3 f5 37. Kf1 Bh6 38. Re1 Qb8 39. Kg1 f4 40. exf4 Rxe1+ 41. Bxe1 Qxf4 42. Qc3 Qd6 43. Qa5 Bf8": "Preventing Bb4.",
        "44. Bd2 Be7 45. Be3 Bd8 46. Qc3 Bd7 47. Qc1 Bc7 48. g3 Qb6": "If Black tries to play Bxh6, Bf4 wins a piece.  But Black does a really nice job preventing counterplay.",
        "49. Bf4 Bxf4 50. Qxf4 Bxh3 51. Qe3": "I think Qe5 might have been slightly more accurate here.  ",
        "51... Qe6 52. Qxe6+": "Almost forced.  ",
        "52... Bxe6 53. b4 Bf5": "Now Black's endgame is pretty simple.  White cannot make any progress on the Queenside at all.  Black can take as much time as they like to prepare on the Kingside.  If they ever need a tempo, the B can provide a null move.",
        "54. Kg2 Bd3 55. Kf3 h6 56. Kf4 Kf7 57. Ke3 Bc4 58. f3 Kf6 59. Kf4 g5+ 60. Ke3 h5 61. Kf2 Bd3 62. Ke3 Bb1 63. Kf2 g4 64. Ke3 gxf3 65. Kxf3 Kf5 66. Ke3 Kg4 67. Kf2 Be4": "This null move by the B kills a tempo perfectly.  White's K is forced to move away from the g pawn.  After Kxg3, the h pawn sails through to promotion because the Black's K controls g7 and the B controls the promotion square.  Black played the endgame very patiently and carefully."
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=61304",
    "gameName": "Let's play chess",
    "players": "mmoody95 (1805) vs. abythomas1 (1763)",
    "opening": "Queen's pawn game, Chigorin variation (D02)"
}