{
    "moves": {
        "1. e4": "This game features a positional Sveshnikov opening, resulting in a very interesting endgame. Let's start!",
        "1... c5 2. Nf3 Nc6 3. d4 cxd4 4. Nxd4 Nf6 5. Nc3 e5 6. Ndb5 d6 7. Bg5 a6 8. Na3 b5 9. Bxf6 gxf6 10. Nd5 f5 11. Bd3 Be6 12. O-O Bg7 13. Qh5": "The Svesh is one of the most thouroghly analyzed openings in the world, so this is well-known and standard.",
        "13... f4": "This move is critisized by maybe the greatest Svesh expert, GM Rogozenko. He says that black should not close the position in the centre, since white can now break with g3 at a convenient time.",
        "14. c4 b4 15. Nc2 Rb8 16. g3": "the g3-break. A plan might be Kh1, Rg1 and gf4.",
        "16... b3 17. axb3 Rxb3 18. Ra3": "I most admit that Rxa6 probably was better. With this move I tried a \"no counterplay-strategy\". Black's only active piece is exchanged.",
        "18... Rxa3 19. bxa3": "Opening the b-file for the rook.",
        "19... h6 20. Rb1 fxg3 21. hxg3 O-O 22. Nce3 Nd4 23. Nf5 Nxf5 24. exf5 Bxd5 25. cxd5 Qf6 26. Rb6": "I was very happy with this position: I have to do something dramatic to manage to lose, and playing for a win is fully possible. We are playing for two results, as the Russian chesschool would say.",
        "26... Re8 27. Be4 Ra8 28. a4 a5 29. Kg2 Rc8 30. Qe2 Qd8 31. Ra6 Rb8 32. Qg4 Kf8 33. Ra7 Ra8": "Okey, so I didn't manage to do anything with the rook, maybe I can try the queen and bishop endgame?",
        "34. Qh4 f6 35. Rxa8 Qxa8 36. Qh1 Qb7 37. Qc1 Ke8 38. Qc6+": "I thought this was good, but afterwards I admit that playing with the queens on would've given more winning chances.",
        "38... Qxc6 39. dxc6 d5": "!! Maybe not a difficult move for such a strong player as vortx, but for more casual players, this is worth noting: Black's terribly weak bishop must be activated, even at the cost of a pawn. This move saves the draw.",
        "40. Bxd5 Bf8 41. Bf7+": "Hmm, a free bishop...",
        "41... Kd8": "Ah, not interested? Damn",
        "42. Kf3 Bc5 43. Ke4": "Okey, so now I got a bit optimistic. Trying to win a drawn position might be very risky.",
        "43... Bxf2 44. Kd5 Bxg3 45. Ke6 Kc7 46. Kxf6 e4": "Even better was Kxc6",
        "47. Bd5 e3 48. Bf3 h5 49. Kg5 h4 50. Kg4": "The game will finish in a draw: 50...e2 51.Bxe2 Kxc6 52.f6 Kd7  and the king rushes to block the pawn with a easy draw. In the game I thought black would win the a4-pawn, so maybe I should've played on. As a good rule: Always play to checkmate or only kings left!"
    },
    "url": "https://gameknot.com/annotation.pl/lets-svesh?gm=1703",
    "gameName": "Let's Svesh",
    "players": "sicilian_monster (1761) vs. vortx (1986)",
    "opening": "Sicilian (B33), Sveshnikov variation"
}