{
    "moves": {
        "1. d4": "White chooses a Queen opening to push aggressively into my territory",
        "1... d5": "I counter",
        "2. Nf3": "a knight attack to win the sweet center of the board",
        "2... e6": "but I start my opening routine unconcerned",
        "3. Bd2": "white is moving major pieces out, a good strategy, but I must continue to build my house for the king",
        "3... Nf6": "this move is an example of that strategy",
        "4. e3": "white improves her position",
        "4... g6": "my castle building continues",
        "5. Nc3": "white continues to develop major pieces, a good strategy",
        "5... Bg7": "my castle is almost complete",
        "6. Bb5+": "white attacks early...",
        "6... Nbd7": "I block with my knight",
        "7. Ng5": "white is pressing the attack. Now she has moved a major piece twice and the opening is still in full swing. This is a premature move and easily foiled.",
        "7... O-O": "I castle",
        "8. Qf3": "noiw white brings out her queen. This is really early in my opinion given the board. Lots of opportunity to lose the queen under the circumstances. ",
        "8... b6": "Ibegin to lay a trap for the queen",
        "9. Qh3": "white is thinking \"checkmate\". but again, not enough development has occurred and this is easily turned back ",
        "9... Re8": "I continue my opening development",
        "10. Nxd5": "white brings force to the attack - a good strategy",
        "10... Nxd5": "but unguarded the knight is captured, this is a grevious error",
        "11. c4": "pawns to the rescue...too late",
        "11... Qxg5": "now this is a strange move..why not take the knight?",
        "12. cxd5": "and she does so...",
        "12... Qxd5": "in exchange for a pawn",
        "13. a4": "good, an attack in the middle is best arepelled by an attack on the flank",
        "13... Bb7": "my opening is almost complete",
        "14. Qh4": "white is positioning her queen for a major assault",
        "14... Qxg2": "and in so doing, gives up a pawn. ",
        "15. Ke2": "now she has to move defensively to protect her castle",
        "15... Qf3+": "I am trying to get her to drop back to the first row so I can capture a rook...",
        "16. Kf1": "Excellent...",
        "16... Qf5": "but I think I sense danger if I do that...so I drop back ",
        "17. Bxd7": "now why did white not capture a rook here? Because she was trying to ensure a mate with her Bishop and Queen I believe.",
        "17... Red8": "so instead, I will threaten her",
        "18. Qe7": "a good move to bring the Queen into the attack, but my King is in his castle, and well protected. ",
        "18... Bxh1": "so I capture her rook",
        "19. Bb4": "this IS dangerous...but again, as I assess the situation, premature. There is no way for her to mate me in the current allignment as far as I can tell. ",
        "19... Qh3+": "So I try to control the game by keeping her King in check and manouvering him to a certain mate",
        "20. Ke2": "he escapes for now. ",
        "20... Qf3+": "\"hello\"",
        "21. Kd2": "\"run away\"",
        "21... Qxf2+": "\"hello\"",
        "22. Kd3": "\"run away again\"",
        "22... Qxh2": "Hmmm stymied....I have to regroup..actually, this was a wasted move. A move to h4 would have been swifter",
        "23. Rf1": "here comes more white force",
        "23... Rdf8": "I better protect myself",
        "24. Bxe6": "even with all this fire power, I cannot see white achieving mate in this configuration.",
        "24... fxe6": "and to sacrifice a Bishop for a pawn is another mistake.",
        "25. Qxe6+": "even with this, I am not concerned. ",
        "25... Kh8": "my King is almost invulnerable in this situation.",
        "26. Bxf8": "but a good capture leads to...",
        "26... Bxf8": "a recapture...",
        "27. Rf7": "so how to capture my King...this move is not a bad move, in that it brings force to the battle, but it is not enough given the nature of my defense",
        "27... Rd8": "I start to think about mate...",
        "28. Qf6+": "a good check...forcing my hand",
        "28... Kg8": "now what?",
        "29. e4": "Aah the opening I have been waiting for. ",
        "29... Qh3+": "check",
        "30. Kc4": "the King is forced into trouble",
        "30... Bxe4": "one move away from mate, white resigns... a good game marked by a couple of mistakes and attacks that occur too early in development with not enough force easily repelled and taken advantage of. "
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=2434",
    "gameName": "Let's play chess",
    "players": "toomanydogs (1091) vs. opus692 (1276)",
    "opening": "Queen's pawn game (D02)"
}