{
    "moves": {
        "1. e4 e5 2. Nc3 Nf6 3. Bc4": "typical start i do.. don't know if it has a name!",
        "3... Nc6 4. Nf3 h6 5. O-O a6 6. a4 d6 7. d4": "did this move just because i've read recently that it's good tactic to dominate mid squares.  ",
        "7... exd4 8. Nxd4 Nxd4 9. Qxd4 Be7 10. Nd5": "the whole idea of this move was done to make my next move!",
        "10... Nxd5 11. Qxg7": "hmm thinkin got rook and knight!",
        "11... Bf6": "not so great idea ha? quite late.. thought i'd stick to my queen rather than swapping it for a rook h8 and a knight d5 ",
        "12. Qg3": "only way to safety",
        "12... Nb4": "of course getting away ",
        "13. c3": "at this point i was thinking black would 13. ...Nc2 attacking my rook and threatening me. ",
        "13... Nc6": "backing off meant i'm still in the game and could attack again",
        "14. Bf4": "not very meaningful just to have the double rooks, ",
        "14... Be5": "black thought otherwise, and defended the square",
        "15. Bxe5 Nxe5": "at this point, i didn't know weather to move or defend the bishop on c4 or continue with my attacking mind",
        "16. Qg7": "again my queen and that square!",
        "16... Ke7": "I didn't expect this move but i think Rf8 would have been better?",
        "17. b3": "didn't want to move bishop anywhere. I overlooked two things first is that knight bishop exchange is in black's favour and also moving black 17. ...Qg8 would cost me my queen which I needed more than black's unused queen!",
        "17... Nxc4 18. bxc4 Be6 19. Qd4": "defending pawn and moving queen out of danger",
        "19... c5 20. Qd3": "defensive moves ",
        "20... Qg8": "now at this point i thought black would move his queen somewhere along the G file and then securing it with one of the rooks behind, but seemed like it would take 2 more moves so didn't panic.",
        "21. Rab1": "threatening b7 and check",
        "21... Rb8 22. Rfd1": "good move",
        "22... Bh3": "Blunder! black was thinking of counter attacking my last move and mating in the next one. but overlooked the fact that my queen is still capable of defending king therefore taking bishop 23.Qh3 which at first made me happy that i'd regain my lost 3 points from early mistake.\nthen I thought I don't need that maybe could do better but still had in mind the game could be over with one move!  ",
        "23. Qxd6+ Ke8 24. Qxb8+": "here i'm thinking to take black queen is next to stop the attack. ",
        "24... Ke7": "realized i have three pieces that could attack. one thing though is black could have avoided quick mate by bringing bishop to c8, but i still would have carried on with checking",
        "25. Qd6+ Ke8 26. Qd8#": ""
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=32866",
    "gameName": "Let's play chess",
    "players": "jaysoon (1450) vs. anita975 (1286)",
    "opening": "Vienna game (C28)"
}