{
    "moves": {
        "1. a4": "One pawn wins it all. In this game we feature none other than Chuck Norris disguised as the queens pawn. In this match, he will in just four moves take a pawn, a bishop, a rook, and finally a queen before being slain by the enemy king - oh, and he also gets queened along the way.\nWhite opens this game with a strange opening. I think that this might be the second worst move - the worst being h2-h4. I believe that my game is solid enough, and won't fall for any odd traps that might come along.",
        "1... d5": "Size the day and the middle.",
        "2. b3": "Following up on the opening move, this moves makes sense.",
        "2... e5": "A strong pawn center is the essence of a solid game. If white don't want it, I - as black - am sure gonna take it.",
        "3. Bb2": "Bb2, Finally a move that makes sense. ",
        "3... Nc6": "A simple developing move that attacks the queen-side pawn attack, and keep the e-pawn protected. The only disadvantage is that the c-pawn is now blocked. That might become a problem later on.",
        "4. g3": "Another fianchetto coming up.",
        "4... Nf6": "Nf6 will add to the protection against the coming bishop at g2.",
        "5. Bg2": "The game at this point. White relinquish the center in order to try and win it back at the right moment. Black now has the choice to continue to develop his pieces without being under any serious threat.",
        "5... Bd6": "Well.. another developing move. The center is going to become attacked at some point, might as well prepare for it.",
        "6. d3": "d3. White is preparing for the e4 push.",
        "6... O-O": "Some strategy book I once read advised to always castle before going on the attack. So, now we castle. ",
        "7. e4": "e4 - white launches the attack. Black currently has a much stronger game due to more development. Where are whites knights?",
        "7... d4": "The d-pawn is much more ambitious than a mere pawn swap. Advance on the queen side. By know it looks like a closed game that might drag on with a high level of strategic play.",
        "8. Nd2": "Nd2. A nice developing move. White is actually bringing out pieces. ",
        "8... Bg4": "Bg4 - a nice developing move that also brings tempo. The white queen is under attack",
        "9. f3": "f3?? well.. Now whites position is flawed. Where will he castle? (maybe he never planned to castle?)",
        "9... Be6": "Be6. Pull the bishop back into a nice square. Maybe the attack is going to be on the queens side.",
        "10. Nc4": "Nc4. Ok, white has positioned a strong knight here, but he is alone and his position could be short lived after blacks pawn advancement on the queens side.",
        "10... Bb4+": "Bb4+! A good solid outpost for the bishop. He is fairly safe here, and enjoys direct access to the enemy king. Notice how this position is solid as white cannot force the bishop away with the a2-a3 move, and because of the advanced d-pawn.",
        "11. c3": "c3?? What white fails to realize is that the d-pawn is Chuck Norris - and he smells blood. ",
        "11... dxc3": "dxc3! Winning at least a minor piece, and opening the d-file for the queen. The killing spree has begun. ",
        "12. Qc2": "Qc2. Not much better than what actually happens. White might have been concerned with the c3-c2 move, winning the queen. White should just accept his loss and trade the bishop for the pawn.",
        "12... cxb2+": "The pawn takes the bishop and delivers a discovered check from the bishop. White is helpless now.",
        "13. Nd2": "Nd2 was maybe the best move in the current situation. ",
        "13... bxa1=Q+": "Now the pawn has taken 9 points from the enemy and a coronation is in order. More check.",
        "14. Qd1": "Why not move the king? well, the pawn (now as a queen) is still hungry..",
        "14... Qxd1+": "The game should be over now. ",
        "15. Kxd1": "Finally the king can move. A little late.",
        "15... Qxd3": "..and white resigns. \nLack of development early on, and a weak pawn structure lead to quick resolution to the game. White should have developed his knights earlier, and tried to castle at the kings side. \nEven if white had sacrificed his bishop on move 12., he would still be in a lot of trouble."
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=36723",
    "gameName": "Let's play chess",
    "players": "voske (1168) vs. udomkiat (1686)",
    "opening": "Ware (Meadow Hay) opening (A00)"
}