{
    "moves": {
        "1. e4 e5 2. Nf3 d6": "Phillidor Defense",
        "3. d4 exd4 4. Qxd4": "Nxd4 is another way.",
        "4... Nc6 5. Bb5 Bd7 6. Bxc6 Bxc6": "White does not want to move his queen from this position, if he moves then 4. Qxd4 was wrong.",
        "7. Bg5": "This is very intersting move, if it is not book move then write it after my name :) ... White's idea is simple, if Black moves his queen then she becomes more passive, if Be7 then Qxg7, if Nf6 then White can ruin Black's kingside pawn structure by BxN PxN or BxN QxB QxQ PxQ or he can do something else as Nc3 where Bg5 will not be proved bad as it pins the knight and doing good job at g5, but if Black plays ...",
        "7... f6": "f6 is the move that White wanted to move when he played Bg5. Because f6 is for knight and ...",
        "8. Be3 Qe7 9. Nc3": "you see now White's position is pretty good whereas Black's positoin is weeping, his kingside is totally packed specailly his pieces do not finding good squares to go, Black can castle long but he cannot do it so early as a7 pawn will hang plus white queen can threat any unwanted attack going to a7 and a8.",
        "9... g5": "this move is very interesting too, actually in this game this is the move which decides the middle game.",
        "10. Nxg5": "...",
        "10... Bg7": "White's knight is now hanging if he moves the knight say Nf3 then f5 attacking the white queen, white moves the queen then fxe5, taking pawn back, no any bad pawn structure and kingside mobilized.",
        "11. Nd5": "so White plays this move, considering previous analysation, moving forward not backward, not giving any advantage or time to Black.",
        "11... Bxd5 12. Qxd5": "this exchange favores White as Black's good bishop has gone.",
        "12... c6": "!",
        "13. Qf5": "staying on 5th rank as supporting g5 square.",
        "13... fxg5 14. Bxg5": "White got 2 pawn for knight, so its ok ...",
        "14... Qe5 15. Qxe5+ Bxe5 16. O-O-O": "activating the rook and supporting b2 pawn, 2 in 1",
        "16... h6 17. Be3 Ke7 18. Rd3 b6 19. c4": "...",
        "19... c5 20. Rhd1": "Black cannot take h3 pawn, if he does then g3, bishop is locked.",
        "20... Rd8 21. Ra3": "?! this is actually time wasting move, upto now i think this is only bad move White played. Actually White was hoping Ra8 in reply, but ...",
        "21... Rd7 22. Rad3 Nf6": "White was looking for this knight move for long.",
        "23. f4": "!",
        "23... Bd4 24. Bxd4 cxd4 25. Rd3xd4": "ok material is even now, this is postion, White has 3 pawns for knight while Black has 2 isloated pawns.",
        "25... Ke6 26. Re1 Re8 27. Kc2 Rc7 28. Red1 Kf7 29. Re1": "?",
        "29... d5 30. e5 dxc4 31. Red1 Ng4 32. Rd4d7+": "White want to exchange one rook, may be it gives some relief.",
        "32... Re7 33. Rxe7+ Rxe7 34. Rd6 h5 35. g3": "! h3 was bad, as after Ne3  Kc3 Nxg2 and then threatening f4. Now if Black takes the pawn Nxh3 then Rh6 and then Rh7 gives good tactical possibiliteis.",
        "35... Kg7 36. Rd2 Kg6 37. Kc3": "White wants to play h3 but Ne3 with Check is annoying.",
        "37... b5 38. h3 Ne3 39. Rd6+ Kg7 40. h4": "there was another good interesing line, that is Kd4, but it was not giving 100% winning chances, Kd4 Nf5  Kd5 NxR KxR attacking R ... etc ...",
        "40... Nf5 41. Rd1 Kf7 42. Rg1 Ke6 43. g4 Nxh4 44. gxh5": "White's targes is capturing all Black's pawns as there will no hope of win to Black specially this h5 (outside Pawn) was dangerous.",
        "44... Kf5 45. Kb4 a6 46. Ka5 Re6 47. Rd1": "Rf1 was good. may be .... but White calculated some wrong so ...",
        "47... Kxf4 48. Rd6 Kxe5 49. Rxe6+ Kxe6 50. Kxa6": "?? this is pure blunder!",
        "50... b4 51. Kb5 c3": "!! and pawn ... ... passed away",
        "52. bxc3 bxc3 53. h6 c2 54. h7 Ng6 55. a4 c1=Q 56. a5 Qc7 57. a6 Kd5 58. a7 Qb7+ 59. Ka4 Kc4 60. Ka3 Qb3#": "ha! 2 pawns on 7th rank... :)"
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=7995",
    "gameName": "Let's play chess",
    "players": "abro (1614) vs. jorgeluis (1669)",
    "opening": "Philidor (C41), Boden variation"
}