{
    "moves": {
        "1. d4 Nf6 2. Nf3 e6 3. Bg5": "I use this pin rather than letting Black play Nimzo-Indian.",
        "3... h6 4. Bxf6 Qxf6": "Black's Q is potentially misplaced, which could cost a tempo later.",
        "5. e3 Bb4+": "This move develops the B, but costs Black a tempo.  On the other hand, it's not easy to figure out what square the B belongs on.",
        "6. c3 Ba5 7. Bd3 c6 8. O-O d5": "Black has some development problems.  Either the N or B on the Queenside is going to be cramped.",
        "9. Nbd2 Nd7 10. e4 O-O 11. e5": "This is possibly not best, but I felt that exd5 would help Black get uncramped.",
        "11... Qd8 12. b4 Bc7 13. Re1 f6": "Black tries to relieve some of the pressure, but this will leave a backward pawn on e6.  e5 will also become a square that can be used as an outpost.",
        "14. exf6 Nxf6 15. Qe2 Ng4": "I didn't see the utility of this move.  The N isn't actually threatening anything and the move just loses a tempo.",
        "16. h3 Nf6 17. Ne5": "This is a good outpost for the N.",
        "17... Bxe5": "Black thought so too!  The N is captured immediately.",
        "18. Qxe5 Qe7 19. Re3 Re8 20. Rae1 Nh7 21. Rg3 Qf6 22. Qh5": "I felt that Qxf6 would give Black a reasonable position.",
        "22... Bd7 23. Ree3 Ng5 24. h4": "I would like to put a R on f3, but this N is preventing it.",
        "24... Ref8 25. Nf3 Nh7 26. Rg6 Be8": "I thought this was a good defensive move.",
        "27. Rxf6 Bxh5 28. Rfxe6": "White comes out a pawn ahead.",
        "28... Bxf3 29. Bxh7+": "I felt that Black's position would be fairly good if the N could come back to f6, threatening to go to e4.  So I took the N first.",
        "29... Kxh7 30. Rxf3 Rxf3 31. gxf3": "Black exchanges down to a R endgame.  I have an extra pawn, but my pawn structure is not good.  White has to figure out how to prevent all of the isolated pawns from becoming targets.",
        "31... Rf8 32. Kg2 Kg8 33. a4 Rf7 34. h5 Kf8 35. Kg3 Rf5": "Black tries to target an isolated pawn.",
        "36. Re5 Rf6": "Playing RxR gives White a passed pawn.",
        "37. f4 a6 38. a5": "Now Black is locked up on the Queenside.",
        "38... Kf7 39. f5 Kf8 40. Kg4 Kf7 41. Kf4 Kf8 42. Re6": "This allows my K to get in.  White does not really want to play RxR, because the position is locked up after gxf6.",
        "42... Kf7 43. Ke5": "Now Black has no good moves.  If the Black K moves away from the R, Black will lose another pawn.",
        "43... Rxe6+ 44. fxe6+": "Now White has successfully converted one of the isolated pawns into a passed pawn.",
        "44... Ke7 45. f3 Ke8 46. Kd6 g5": "Desperation.  This just gives White another advanced passed pawn.  However, Kf8 also loses to Kd7.  And Kd8 runs into e7+, Ke8, Ke6, when the Black K is completely immobilized.",
        "47. hxg6 e.p. h5 48. g7": "The g pawn cannot be stopped and will promote next move.  There is no way for Black to avoid a quick checkmate."
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=63709",
    "gameName": "Let's play chess",
    "players": "mmoody95 (1872) vs. snehagupta (1588)",
    "opening": "Queen's pawn (A46), Torre attack"
}