{
    "moves": {
        "1. d4 d5 2. g3 Nc6 3. Bg2 Nf6 4. c4 g6": "The Grunfeld opening",
        "5. Nc3 Bg7": "Black is careless, he should have played dxc4 first.",
        "6. cxd5": "How obvious...",
        "6... Nb8 7. e4": "In just two moves white has gained massive advantage, after just one single mistake by black.",
        "7... O-O 8. Bg5": "Strengthening white's grip on the fields d5/e4",
        "8... c6": "I investigated returning the pawn with e5, but it brings nothing",
        "9. dxc6 bxc6": "Keeping the option open to attack the center with c6-c5, but at the const of another tempo.\nIts probably better than Nxc6 however, as that leaves white's mighty center formation unchallenged",
        "10. Nge2": "In order to answer Bg4 with f3.",
        "10... Qa5 11. e5": "Winning another pawn...",
        "11... Nd5 12. Bxd5": "Trading this bisshop had to be considered carefully, as the fields h3/g2 are exposed to black bishop.\nHowever after carefull calculations, I deemed the trade safe.",
        "12... cxd5 13. Bxe7": "Two pawns up, white has a big advantage now.",
        "13... Re8 14. b4": "Short intermezzo to remove the Queen form the a5-e1 diagonal. \nAlso I am improving my pawn formation.",
        "14... Qc7 15. Bc5": "Solid.",
        "15... Bg4 16. Qb3": "using the standalone d5 pawn ad a diversion",
        "16... Bf3": "Veru understandable, and at first sight this seems strong. Yet this is the third mistake, giving white an even bigger material lead.",
        "17. Nxd5": "Of course, exploiting the fact that Bf3 is exposed.",
        "17... Bxd5 18. Qxd5 Nd7 19. O-O": "Safe, finally",
        "19... Rad8 20. Qb3": "Nice try, but I am not falling into such traps.",
        "20... Rdb8": "Threatening Nxc5 this time",
        "21. Rac1 Nxc5 22. Rxc5 Qb6 23. a3 Red8 24. Rfc1": "White has a winning advantage",
        "24... Qb7": "Another mistake, which makes life easier for white",
        "25. Rc5c7 Qd5": "Forced, byut now I can trade Queens...",
        "26. Qxd5 Rxd5 27. Rxa7": "And win another pawn, and occupy the 7th rank.\nJummy",
        "27... f5 28. Rcc7 Bf8 29. Rcxh7": "And another pawn, but it could not be saved by any means",
        "29... Rc8 30. Rhc7": "Not allowing even the slightest counter play",
        "30... Rdd8 31. b5": "If RxR, Rxr, Bxa3 then b6 wins quickly.",
        "31... Rcb8 32. a4 Rb6 33. f4": "White decides to manouver a bit, before the pawns start marching. Its probably a bit slow.",
        "33... Rbb8 34. Kf2 Rb6": "Black has no plan and real good moves.",
        "35. Ke3 Rbb8 36. Nc3 Bb4 37. Kd3": "Wanna trade?",
        "37... Rba8": "Hoping for RxR, after which the a pawn falls.",
        "38. Nd5": "Another nice move, made possible by my large pawn advantage. Blak must trade rooks, or he willbe checkmated.",
        "38... Rxa7 39. Nf6+ Kf8 40. Rxa7 Rc8 41. Nd5": "Again not allwoing black any counterplay",
        "41... Ba3 42. b6": "Finally the pawn amrches, and this time she is unstoppable.",
        "42... Rb8 43. b7 Kf7": "Avoiding Ra8",
        "44. a5 Ke6 45. Nb6": "Blocking the kings route to the pawns",
        "45... Ke7 46. a6": "Black surrendered, he has no defence left against Ra8"
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=51492",
    "gameName": "Let's play chess",
    "players": "eduard352 (1753) vs. sebata (1581)",
    "opening": "Queen's pawn game (D00)"
}