{
    "moves": {
        "1. d4": "Another short game.  ",
        "1... d5 2. c4": "Queens gambit",
        "2... Nf6": "Gameknot calls this the Marshall defence",
        "3. Nf3 Nc6 4. Nc3 Bg4": "An early attack and an attempt to pin my knight. ",
        "5. cxd5": "I would normally ignore the bishop with e3, however this time I decided to try something different. This is a miscalculation on my part.",
        "5... Bxf3 6. gxf3": "I now have 2 sets of doubled pawns which doesn't bode well",
        "6... Nxd5 7. e4": "This seems to me to be better than taking the knight which will bring his queen to the centre of the board and give him an option to castle. It also gives white a better hold over the centre",
        "7... Nxc3": "I'm not sure about this move for black, although it does isolate my a pawn",
        "8. bxc3": "I feel that here white has started to regain the position slightly though castling could be a problem and my c pawn is now weak, though there is little black can do about it immediately",
        "8... e6": "opening the diagonals so the queen and bishop can move out, though in the case of the bishop, not very far",
        "9. Rb1": "My thinking here was that this forces him to do something about the b pawn. either defend it with the rook and lose the ability to castle, Na5 doesn't look much better either to me. This move also means that my rook is in (as far as I can see) a much better position than it was",
        "9... b6": "This is probably a key move in this game as we shall see. White's lsb has gone so I can now make use of mine. This move takes us out of the Gameknot database and I think what follows may be why",
        "10. Bb5": "Black is in trouble now, clearly if I take the knight I gain the rook, blacks only options are to move the king or to defend the knight with his queen",
        "10... Qd6": "Ke7 may have been better, though my dsb could then have pressured the king",
        "11. Qa4": "Putting more pressure on the knight",
        "11... Ke7": "Black has few options, moving the rook loses material",
        "12. Ba3": "Blacks queen must fall",
        "12... Qxa3": "Rd8 may have been better as it would move a defender near the king",
        "13. Qxa3+ Kf6": "Kd1 seems slightly better as it saves the black knight because my queen has to move",
        "14. e5+": "This move forces the black king further into the open. it also opens the b1 h7 diagonal for my lsb, the c1 h6 diagonal is already open for my queen and I have the option of G1 to restrict the kings movement further",
        "14... Nxe5 15. dxe5+": "This isolates my already weak c pawn but it does bring the black king further into the open",
        "15... Kg5": "Kxe5 seems better to me",
        "16. Qc1+": "The kings movements are now limited.",
        "16... Kg6 17. Rg1+": "B d3, f5 means that the king can probably get safe.\n\nBlack resigned here due to Q g5 regardless of where he moves\n\nThanks for reading"
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=18826",
    "gameName": "Let's play chess",
    "players": "elwoos (1538) vs. fabianl (1531)",
    "opening": "QGD (D06), Marshall defence"
}