{
    "moves": {
        "1. e4 c5 2. d4 cxd4 3. Qxd4 Nc6 4. Qe3 Nf6 5. Nc3 e5 6. Bd2 Nd4 7. O-O-O Bc5 8. Qg3": "Here is where it gets Interesting.  With a pawn threatened i could easily move my rook to g8 to block but lose my ability to castle on my defensibly strong side.  Castling to block pawn would also be bad idea because of  8. 0-0  , 9. Bh6...  and then its just all sorts of trouble for black.  so instead i look for a way to equalize after giving away the pawn. and saw this move.",
        "8... d6 9. Qxg7": "What the pawn move did was limit the queen's position (eventually) and free up my pieces to chase the queen.",
        "9... Rg8": "Naturally, I chase the queen as per planned.",
        "10. Qh6 Rg6 11. Qh4 Rg4": "This is why 8.d6 was important.  Qh6 for white would have lead to repeating Rg6, because I'm stubborn like that.  Unless theirs some other attack that i'm not seeing for Qh6.",
        "12. Qh3 Rxe4": "Equalize and attack. Queen has three open squares left h6, g3, and d3.  g3 would lead to rook back on the g-file, h6 would lead to Nf5.",
        "13. Qd3 Rg4 14. h3 Bf5": "So ignoring my rook for now i keep up the assault on the queen Now it only has two free spots c4 and b5.",
        "15. Qc4 Be6 16. Qa4+ Bd7": "block and attack forcing queen back on c4 and allowing pawn push on b5 for me",
        "17. Qc4 b5 18. Qd3 Bf5": "Trap complete for a pawn a rook and a knight fairly even trade in my opinion",
        "19. Qxb5+ Nxb5 20. Bxb5+ Bd7 21. Bxd7+ Qxd7 22. hxg4 Qxg4": "Pull ahead and pressure open pawn",
        "23. Nb5": "block the fork... in hindsight 0-0-0 might have been better to bring rook into action.",
        "23... Kd7 24. Nf3": "deploys knight finally",
        "24... Qxg2 25. Nh4 Qxf2": "Now here i should have taken with Bishop instead as it would attack the h4 knight and block rook from pressuring queen.",
        "26. Rdf1 Qg3 27. Rxf6 Be3": "Not the best move should have moved Rf7 to protect pawn",
        "28. Rxd6+ Ke7": "And the blunder that ended the game.  Should have moved to King to c8 to prevent fork.",
        "29. Nf5+": "And here I resigned.  Any opinions are welcomed, as are any question's about any moves."
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=50743",
    "gameName": "Let's play chess",
    "players": "darklolo67 (1536) vs. wetsnake456 (1515)",
    "opening": "Sicilian (B21), Andreaschek gambit"
}