{
    "moves": {
        "1. d4": "in this game, i win a piece and head into an endgame that i botch so badly that for a little while, i thought i would lose. i'm hoping someone can give me pointers on my endgame technique. obviously it needs a bit of work.",
        "1... d5 2. e3 Nf6 3. Nc3 Nc6 4. Nf3 e6 5. a3 Bd6": "so far this opening looks logical to me. i'm not too worried about Bb6 because even i wouldn't mind having doubled pawns in exchange for the b file for my rook.",
        "6. Nb5": "this one was new to me. in a few moves, it looks like it gives both of us a bit of space on the queenside, but i don't see much of an advantage for white.",
        "6... Be7 7. b4 a6 8. Nc3": "now the white knight and bishop are both restricted.",
        "8... O-O 9. Bd3 b6 10. O-O e5": "i figured here that i would like to open things up, and this doesn't lose the pawn for good.",
        "11. dxe5 Ng4": "can it be saved?",
        "12. Be2": "attacking d5",
        "12... Be6": "protecting",
        "13. Nd4": "giving the pawn back",
        "13... Ngxe5 14. Nxe6 fxe6": "i've given up the light-squared bishop, but my rook has more scope and my central pawns look healthy.",
        "15. Bg4 Nxg4 16. Qxg4": "now the exchanges are even. i have to be careful of attacks on the g7 square, my king can start looking weak soon if i don't watch out for tricks, but really i don't see a tangible advantage. i like my position just a tiny bit more than white's, i think i may have a tiny edge due to my central pawns and the ",
        "16... Qd6": "now the exchanges are even. i have to be careful of attacks on the g7 square, my king can start looking weak soon if i don't watch out for tricks, but really i don't see a tangible advantage. i like my position just a tiny bit more than white's, i think i may have a tiny edge due to my central pawns and the fact that i can potentially gain a tempo with Ne5.\r\n\r\nif white tries to force things a little with 17. e4, i should be able to advance my central pawns. at this stage i was mostly looking for white at plans involving moves like that in the center.",
        "17. Bb2": "aha! the attack on g7 i mentioned before!",
        "17... Bf6": "covered easily enough",
        "18. Rfd1": "here white misses my tactic! he failed to look at the tempo moves.",
        "18... Ne5": "queen only has a few tenable squares, they all lead to basically  the same thing. Qg3 looks like the best reply, but it proves inadequate, as we'll see.",
        "19. Qg3 Nc4": "my tactic. trying to save both pieces is impossible. if a rook covers the bishop, 20. ...Bxb2 21. Rxb2 Bxc3\r\n\r\nif the bishop moves, the knight is lost. there is no time to cover the knight with moves like 20. e4, because the bishop is under threat.\r\n\r\nmy opponent tries another way...",
        "20. Ne4": "a clever try. can't take the bishop immediately, but...",
        "20... Qxg3": "recapturing with the knight loses the bishop straight away, but can the bishop be saved at all?",
        "21. Nxf6+ gxf6": "i could have captured with the rook. in retrospect, i wish i had. i thought i was strengthening my central pawns here, but that h-pawn becomes way too weak later on.",
        "22. hxg3 Nxb2": "here i'm up a piece in the endgame. i thought my opponent would probably resign, but he didn't, so it was time to test out my end-game technique. in this game, i think my technique was pretty lousy. anywhere someone cares to offer advice, i'll be glad to hear it. i think my trouble is thinking in working plans...",
        "23. Rd4": "preventing my pawns from rolling with e5, and also opening the possibility of uncomfortable moves on the g- and h- files.",
        "23... Kf7": "so i stepped out of the checking square straight away. maybe a waste of tempo? my plan is to mobilize my central and queenside pawns, preparing e5 and an eventual queenside break.",
        "24. e4": "pressuring me. if i take, i start losing pawns left and right.",
        "24... c6": "so instead i protect.",
        "25. exd5 cxd5": "i thought this exchange was too early, personally. i don't see much advantage from this exchange. maybe he was just fracturing my pawns a little.",
        "26. f4": "a fine move. that e-pawn advancec looks a long way off now.",
        "26... Rfd8": "in retrospect, maybe i should have played h5? i'm not sure here if i'm squeezing my opponent's position at all. my plan was to keep e5 a possibility.",
        "27. g4 Rac8": "i thought my opponent's pawn advance was useless at the time. here, i'm preparing to trade down material, thinking it was best while i'm up a piece. i now think this was a lousy plan. maybe i should have instead tried to hit the c2 square as hard as possible.",
        "28. Rc1 Rc4": "offering the exchange.",
        "29. c3 Rxd4": "here my opponent thought he would start to gain back pawns by obtaining access to the c-file.",
        "30. cxd4 Nc4": "he missed this move.",
        "31. a4": "a waiting move",
        "31... h6": "i was a little concerned about g5, but i now think this was really a waste. other moves? maybe Rg8 straight away?",
        "32. Kf2 Rg8": "NOW i play Rg8, a completely wasted move.",
        "33. Kf3 Ke7": "i'm thinking of heading to d6 with the idea of freeing my knight.",
        "34. g3 Kd6 35. Rh1": "now the knight technically can move, but i don't really have time!",
        "35... Rh8 36. g5": "i saw this reply but discounted its chances. i looked at ...fxg5, and after he recaptures, i push, but that passed pawn starts to make my life hell soon thereafter, so i tried for this tactical line instead.",
        "36... e5": "with the idea that none of my opponent's pawn captures actually lead very far. if dxe5, my knight will start to come in or else i'll have two connected central passed pawns. if gxh6, my rook is ok there for a while after ...e5+.\r\n\r\nwhat i missed was the one really obvious move which my opponent played!",
        "37. Rxh6": "if i recapture, i lose quickly because i can't stop the pawn.",
        "37... e4+": "my opponent here only really has one good move, which he played.\r\n\r\n",
        "38. Ke2": "this prevents me in the short-term from tactically using the e-pawn to make the game double-edged.",
        "38... Rf8": "i think here either recapture loses for white. we'll see the rook recapture in a second. the pawn recapture doesn't seem to go anywhere after Ke6.\r\n\r\ni thought  my opponent should have played f5 here, and then i'm in big trouble. Ke6 becomes impossible and the pressure can  be increased over the next few moves.",
        "39. Rxf6+": "instead, he went for the exchange, thinking the two passed pawns would be enough to get him through. i think this could *maybe* have been a draw if i didn't have the extra knight, but as it is, this effectively gives up all hope for white's position. the losing mistake.",
        "39... Rxf6": "of course i recapture. i'll also win back one of those pawns.",
        "40. gxf6": "no choice here.",
        "40... Ke6 41. f7": "here he makes the reasonable decision to try to squeeze another tempo out of the position, but it's nowhere near enough. my king is needed to restrain those pawns anyhow. whether it does so on f6 or f7 is irrelevant to me.",
        "41... Kxf7 42. g4": "trying to mobilize those pawns.",
        "42... a5": "hoping to fix white's pawns where my knight can easily get to them with ...Nb2.\r\n\r\nif he tries to keep things under control with something like:\r\n\r\n43. b5 Nb2 44. Kd2 Nxa4 45. Kc2, keeping my knight from moving, i play:\r\n\r\n45. ...e3 46. g5 e2 47. Kd2 Nc3\r\n\r\nand it's all over soon.",
        "43. g5": "giving me the pawn?",
        "43... axb4": "and he resigned. phew! close call a few moves back! any suggestions for my endgame technique would be appreciated."
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=24448",
    "gameName": "Let's play chess",
    "players": "denverskier (1492) vs. neutralrobotboy (1200)",
    "opening": "Queen's pawn (D00), stonewall attack"
}