{
    "moves": {
        "1. Nc3": "This is not an opening choice that presents the most attacking potential for white. The moves up to 2...dxe4 are book for the Dunst Opening.",
        "1... d5 2. e4 dxe4 3. Nxe4": "Bc4 would be the Dunst-Hector Gambit. With this move white maintains material equality and has a developed piece in the center. The knight controls g5 and c5 while it influences f6 and d6. There is a sacrifice potential at f6 which offers nothing at the moment. The knight is unprotected.",
        "3... Bf5": "Black attacks and develops a piece.",
        "4. Bd3": "Bd3 ? White defends the piece with the bishop, which is not the best choice. The decision may have been made to keep the knight centralized for control and because using the d pawn would end with a trade of queens and white losing castle rights. A better move would be Ne4-g3 to counter attack the bishop and regaining tempo. The bishop is protected.",
        "4... e6": "Black enables protection of the bishop while opening a line for the king bishop. The position favors black slightly because of the pin on the knight and because if the bishops are traded the pawn structure is disrupted, and because white loses the king bishop which tends to be the more favorable bishop.",
        "5. Qe2": "Qe2 ? White overprotects the knight, but this move is not needed. Better would be Nf3 to develop are prepare for 0-0.",
        "5... Nf6": "Black applies pressure to e4 while developing the king side.",
        "6. Nxf6+": "Nxf6+ ? White over-reacts to the prior move, but this move loses tempo. Better is Nf3 with a gain in development over the text move.",
        "6... Qxf6": "Black selects a good move which recaptures the piece while offering protection to the pawn structure in the event of Bd3xf5. The only drawback to this move is the weak c7 and b7 squares, but white does not have the means to take advantage of this yet.",
        "7. Qf3": "Qf3 ?! White applies a light pin on the bishop while attacking the undefended b7 pawn with the unprotected rook trapped on the other side. The move is okay, but black will control the white queen on the next move.",
        "7... Bxd3 8. Qxd3": "Forced. Otherwise, Qf3xb7, Qf6-e5+, Ke1-d1, Qe5-e2#",
        "8... Bd6": "Black has a gain in development and stands a little better.",
        "9. Qb5+": "Qb5+ ? White begins an attack on the king too soon. Better was Nf3 followed by 0-0.",
        "9... Nc6": "Black offers a poison pawn to white.",
        "10. Qxb7": "It is a free pawn, but sometimes they carry a heavy price.",
        "10... Qe5+": "Black pursues an attack.",
        "11. Ne2 Nd4": "Nd4! Black obtains a winning position.",
        "12. O-O": "Better was Qb7-a6 to protect the knight with the king.",
        "12... Nxe2+": "Black takes a free piece and applies a check which drives the king to the corner - the most limiting square on the board. A fun but unecessary move. Qe5xh2# is decisive.",
        "13. Kh1": "Forced. The knight can not be taken.",
        "13... Qxh2#": "Win 0-1. The most predominant aspect that can be observed in this game is that it is better to develop pieces, castle, then begin an attack on the center or side where is makes most sense. Timing makes the difference for an attack, as does having enough pieces developed so they can assist. The queen is not able to achieve mate alone - other pieces are needed."
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=8630",
    "gameName": "Let's play chess",
    "players": "mglea63 (1577) vs. rubacchus (1567)",
    "opening": "Dunst (Sleipner, Heinrichsen) opening (A00)"
}