{
    "moves": {
        "1. e4": "I think this game is pretty interesting. White has a positional advantage and then squanders it.",
        "1... e5 2. Nf3 Nf6": "The Petroff Defence...as I have stated before, this can lead to disappearing queens for both sides if beginners are playing...but these players aren't beginners.",
        "3. d4 d6": "Interesting would have been 3...d5, leading to a very open centre and numerous lines.",
        "4. Nc3 exd4 5. Nxd4 g6 6. Bb5+ c6 7. Be2": "By now we can see that Black has wasted several tempi, even more than White has by moving his bishop twice. Will that affect Black?",
        "7... Bg7 8. O-O O-O 9. Be3 Qe7": "Black is playing solidly, but controls less space than White; White is far better developed - look at his bishops!",
        "10. Bg5 h6 11. Bxf6 Bxf6": "White's well-placed bishops could I think have led to interesting attacking possibilities - I'm not sure what trading one for a knight did for White...",
        "12. f3": "This move I suppose is solid, but does little else, blocking in White's previously well-placed bishop and queen, while also removing what could have become a good square for White's d4-knight. Overall, I think this move is pretty bad.",
        "12... Nd7 13. Bc4 d5": "I wonder what White was planning after 14.exd5 cxd5 Bxd5. Well, at least this move opens up the centre, and perhaps the pawn sacrifice is worth it.",
        "14. Bb3 Qc5 15. Nce2 Re8 16. Qd3 Qb6 17. c3 c5": "Black is trying now to grab more space, open up his position and hopefully develop that light-squared bishop.",
        "18. exd5": "That has to be a blunder.",
        "18... cxd4 19. cxd4 Ne5 20. Qd2 Bf5 21. Ng3 Bd3 22. Rf2 Qxd4": "Black is moving all his pieces into White's position. ",
        "23. Qxh6 Be7 24. Rc1": "Anything could happen. Both sides have good attacking prospects, though I would give Black the edge.",
        "24... Bc5 25. Rxc5 Ng4": "Taking advantage of the pin on the ff-rook, and threatening both. This move knocks not so much a nail as a heavy wooden stake into White's coffin.",
        "26. Qd2 Nxf2 27. Ne2": "I wonder what was wrong with 27.Qxf2...",
        "27... Rxe2 28. h3 Nxh3+ 29. Kh2 Qg1+ 30. Kxh3": "A knight sacrifice forces White's king into the open.",
        "30... Qxg2+ 31. Kh4 Qh2+ 32. Kg4 f5+ 33. Kg5 Qh5+": "A firm, convinving checkmate to end an interesting game."
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=19736",
    "gameName": "Let's play chess",
    "players": "dvdrdlph (1367) vs. grundnorm (1913)",
    "opening": "Petrov (C43), modern (Steinitz) attack"
}