{
    "moves": {
        "1. e4": "Un ejemplo que confirma que la defensa siciliana suele crear posiciones de doble filo. Esta partida es interesante por la sucesión de ataques y de fallos y por cómo, al final, se imponen las negras que toman las decisiones adecuadas en las postrimerías del encuentro.",
        "1... c5 2. Nf3 d6 3. d4 cxd4 4. Nxd4 a6": "Hasta aquí pura teoría. Planteo la variante Najdorf al ser la que he elegido para aprender a jugar la defensa siciliana.",
        "5. c4": "Nunca me habían jugado c4. Veo que habilita la casilla a4 y el jaque que puede ser molesto.",
        "5... Bd7": "Me cubro.",
        "6. Be3 Nc6": "Ataco el caballo que está en una posición muy buena.",
        "7. Be2 Nxd4 8. Bxd4 e5": "Hay que echar al alfil , empezar a ocupar el centro y dar salida a mis piezas.",
        "9. Bc3 Bc6": "Batiendo la gran diagonal. El enroque corto ahora es menos atractivo.",
        "10. Nd2 Nf6 11. Qc2 h5": "No puedo seguir atacando el centro. Al flanco de rey.",
        "12. O-O-O": "Me lo esperaba.",
        "12... g5": "Sigo ganando espacio a falta de un plan mejor.",
        "13. f3 b5": "Ahora sí hay que atacar en el flanco de dama.",
        "14. c5 a5 15. cxd6 Bxd6": "Columnas centrales abiertas. Peligroso para mí.",
        "16. Bxe5 Bxe5": "Mi otro alfil en la gran diagonal negra apuntando al peón en B2. Pero...",
        "17. Qxc6+": "Una baja sensible, un error que me sale caro.",
        "17... Kf8 18. Qxb5": "Dos peones menos. Dama amenazada si se mueve el caballo. He de aprovechar las columnas abiertas y atacar si no quiero morir lenta y agónicamente. A ver si comete algún error... Hay partida todavía.",
        "18... Bf4": "El caballo de momento no se va a mover.",
        "19. Qd3": "No me interesa cambiar.",
        "19... Qc7+ 20. Kb1 Rb8": "Presión.",
        "21. Qa3+ Kg7": "Creo que me viene muy bien despejar la octava fila para que mi torre entre en juego cuando sea necesario.",
        "22. Rdc1": "Deja de defender el caballo.",
        "22... Qd8 23. Rc2 Bxd2": "Va a atacar el alfil. Lo sé. Pero he visto algo interesante.",
        "24. Rd1 Bb4": "Esta jugada concretamente.",
        "25. Rxd8 Bxa3 26. Rxh8 Kxh8": "Salgo ganando en el intercambio de golpes pero tengo todavía dos peones menos.",
        "27. b3 Kg7 28. Rc7": "Ataca el punto débil F7. ",
        "28... Ne8 29. Rd7 Rc8": "Mate en una.",
        "30. Bc4": "Buena defensa y ataque.",
        "30... Kg6 31. Bxf7+": "¡ Ay ! Tres peones menos y un alfil pichándome en el culo.",
        "31... Kh6 32. Bc4": "Vuelve a tener mala pinta para mí.",
        "32... h4 33. Kc2 Nf6": "Igual que antes o ataco o muero. Manos a la obra.",
        "34. Rf7 Nh5 35. Kd2 Rd8+ 36. Bd5 Nf4": "Doble ataque.",
        "37. Rf6+ Kh5": "Yo voy con mis peones. No puedo perder ni uno más.",
        "38. g4+": "Y él lo sabe.",
        "38... hxg3 e.p. 39. hxg3 Nxd5 40. exd5 Rxd5+": "Doy dos golpes y recibo uno. Algo he mejorado. Y presiento que voy a ganar. Sus peones en A2 y B3 no se pueden mover de momento.",
        "41. Kc2": "Debo sacarlo de ahí.",
        "41... Rc5+ 42. Kd3 Bb2": "Ataque.",
        "43. Ra6 Rc3+ 44. Ke2 Rc2+ 45. Kf1": "Su monarca está ahora fuera de juego. A atacar.",
        "45... Be5": "El único peón al que puedo amenazar.",
        "46. g4+ Kh4": "Casillas blancas a ser atacadas por el rey. ",
        "47. Rxa5": "Mi ataque con el rey compensará esta pérdida tan dolorosa y sus peones blancos siguen lejos de sus respectivas casillas de coronación. ",
        "47... Bf4": "Mi peón ahora es oro.",
        "48. b4 Bd2 49. a3 Ra2": "Míos esos peones.",
        "50. Rd5 Bc1 51. b5 Bxa3": "Se acabó la partida.",
        "52. Rf5 Bc1": "Ese peón no se toca.",
        "53. b6 Rb2 54. Rf6 Kg3 55. Ke1 Bf4 56. Kd1 Kxf3": "Blancas abandonan. Ha sido una partida muy bonita."
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=63267",
    "gameName": "Let's play chess",
    "players": "zigi (1761) vs. tiramisu (1760)",
    "opening": "Sicilian (B54)"
}