{
    "moves": {
        "1. d4": "I went for either King's Indian or Nimzo-Indian (After knight to f6 I think either Nimzo or King Indian Automatically.\nI had used the King's Indian last time and thought this time use the otherwise well known \"Nimzo-Indian Attack\" which is not listed here as a \"chess opening!\"\nI wonder why?\nThe next moves are pretty automatic for white but somewhere in the next few moves I realized he had no idea what the Nimzo Indian Attack was with the White Queen open!\nMaybe he will pull a rabbit out of his hat!",
        "1... Nf6 2. Nc3 e6": "So the choosing black pawn to shift the game is e5 for \"Nimzo Attack\" which was WELL known in the time Spassky was opposing Fischer.",
        "3. e4": "In time this move often comes from white so so far I am not surprised.  ",
        "3... Bb4 4. Bd3 c5": "Part of the Nimzo Attack on White Queen Open is to park the black bishop with a pawn even though it opposes d4 white pawn; but after examination of the board you can see why the Nimzo Attack is much better than a simple fiancheto in the corner.\nI hate fiancheto's and rarely resort to them unless I feel so threatened I have to open with one in some corner of the center of the board.",
        "5. Nge2": "Well he wants to lock knights to eachother for protection but, remember, anytime you see two knights wasting space on protecting eachother you know it is \"defensive\".",
        "5... d5": "That move is the clincher in the Nimzo Attack and also rather necessary.  I have always found the Nimzo Attack on a White Open with the Queen is more effective than either the corner fianchetto King's Indian Defense of the other lately \"standard\" of just opposing the Q open with a pawn to d5.  This version of defense has so many alterations to moves it is not worth getting \"familiar\" with and even if you did as Black you'd lose to White eventually with more consistency.\nIf it was good enough for Aaron Nimzovich then it's GOT to be good enough for me!\n\n"
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=69272",
    "gameName": "Let's play chess",
    "players": "king-of-hartz (1568) vs. menlopark (1411)",
    "opening": "Queen's pawn game (A45)"
}