{
    "moves": {
        "1. e4": "Just won 9 in a row.  I’ve been pretty “streaky” lately.  Opponent from Portugal.  His games don't include many normal Sicilians.\n",
        "1... c5 2. c3 Nc6 3. Nf3 d6 4. h3 Nf6 5. Qc2 e6": "Game note: “5...e6 my 7 vs his 4 in centre.  I’m pretty happy with my development.”\n",
        "6. Bb5": "Game note: “6.Bb5 seems typical but his B will need to retreat right back to whence it came.  I think d4 would have been good.”\n",
        "6... Bd7 7. O-O a6 8. Ba4": "Game note: “8.Ba4? nope.  Needed to exchange to maintain initiative or retreat to keep the LSB.”\n",
        "8... b5 9. Bb3 c4 10. Bxc4": "Game note: “Check out 10.d4 also.”\n",
        "10... bxc4 11. Na3 d5 12. exd5": "12.e5 pretty annoying too.\n",
        "12... exd5 13. Re1+": "Avoids …Bxa3.\n",
        "13... Be7": "Game note: “13...Be7 not a critical move but how to decide over ...Be6.  The latter controls a central square but reduces it's scope.  The text move maintains or \"improves\" scope and allows for ...O-O.  I’m +2 material.  I control 5 in the centre vs his 6.”\n",
        "14. d4 cxd3 e.p.": "Is it worth the isolated pawn to maintain initiative and eliminate another one of his pawns controlling a central square?  I thought so.\n",
        "15. Qxd3 O-O 16. Nh2": "Or develop his DSB to connect his rooks.\n",
        "16... Qc8": "Leaves my isolani a bit weak but creates an immediate threat on his K-side.\n",
        "17. Qg3": "I really like his move 17.Qg3",
        "17... Ne4 18. Rxe4": "Game note: “18.Rxe4?! really!!  Here come the fireworks.”  Checking now afterward and I think it’s unsound.  But as the game plays out he’s able to use it to his advantage.\n",
        "18... dxe4 19. Bh6 Bf6 20. Nc4": "Game note: “20.Nc4 sets up a Q/R fork on b6.  Can I still get in ...Bf5.”\n",
        "20... Bf5": "In hindsight, how did I not realize there was no time for …Bf5.  I missed 20…Nd4 …Ne2+ solving all my problems.  If 21.cxd4 then I have the discovered capture 21…Qxc4 and his pawn to boot.\n",
        "21. Ne3": "I don’t get it.  Did he not see Nb6 or Nd6.\n",
        "21... Bg6": "And my K is safe.  …Be5 also looks decisive.\n",
        "22. Bf4 Qe6": "Game note: “22...Qe6 and ...Rd8 would also be nice.”\n",
        "23. a3": "Planning to advance his c-pawn maybe??\n",
        "23... Rfd8 24. Nhg4 Rd2": "Game note: “24...Rd2 is a powerful post but dangerous on account of discovered attack from his DSB.”\n",
        "25. Nxf6+ Qxf6 26. Ng4": "Game note: “26.Ng4 and there is the discovered attack. Nice move! (worried).  Guess I should have recaptured with the ugly 25…gxf6.”\n",
        "26... Qd8 27. Bxd2 Qxd2": "Amazingly I’m still +2 material.\n",
        "28. b4": "28.Qc7 is very immediate.\n",
        "28... Qb2": "Game note: “28...Qb2 check that one out.”  Yes in hindsight …h5 or …f5 to push the N and threaten his Q.\n",
        "29. Rf1 Qxa3": "Game note: “29...Qxa3 gives me some relief on the Q-side.  Also hoping to get in ...h5 of ...f5 for K escape.”\n",
        "30. Qc7": "Game note: “30.Qc7! wide open game.  I need initiative again. (worried)”\n",
        "30... Nd8 31. f4": "Game note: “31.f4 is this a trick?  Sure opens up the f-file for him.  I still have ...Qc8+ in my back pocket if Rxf3”.  Playing through afterward I can’t see any trick or benefit.\n",
        "31... exf3 e.p. 32. Rxf3 Qc1+": "Buys me time.  …Ne6 also good.\n",
        "33. Kh2 Qd2": "Playing around too much with my Q.\n",
        "34. Re3 h5": "Somehow I thought this was a simple choice but I was wrong.\n",
        "35. Re8+ Kh7 36. Ne5": "Game note: “36.Ne5 at first this move scared me but I'm starting to look at some good possibilities involving ...Qf4 pinning the N; ...Ne6 attacking the Q and discovered attack on his R; ...f6 pushing the N and discovered attack on his R.  So maybe I actually have an advantage here (plus material so yes I do).  36...Qf6 maintains the possibility of the others.  Good tactics but at some point I still need to mind the structural imbalance on the Q-side.”\n",
        "36... Qf4+ 37. Kg1 f6": "The culprit move?\n",
        "38. Rh8+": "Game note: “38.Rh8+!  wow!!  38...Kxh8 forced.”\n",
        "38... Kxh8 39. Nxg6+": "Game note: “39.Ng6+ a brutal fork.  What the heck happened?  I thought f7 was overprotected, but I might as well resign.”  In hindsight, I guess the innocent looking 36…Qf4+ …f6 were faulty.  But it looked so good at the time.  Let’s insert 27…Ne6 and force him to move his Q first maybe…?  At least that also reveals a discovered attack on his R.\n",
        "39... Kh7 40. Nxf4 Kh6 41. Qc5 g5 42. Qf8+ Kh7": "I resigned 1-0 well played “alvexisback” \n"
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=64131",
    "gameName": "Let's play chess",
    "players": "alvexisback (1738) vs. e4newman (1641)",
    "opening": "Sicilian (B22), Alapin's variation (2.c3)"
}