{
    "moves": {
        "1. d4 c6 2. Nf3 Nf6 3. e3 d6 4. Bd3 e5": "e5 is a good move.  It immediately threatens e4, which causes problems for White.  And I reacted poorly.",
        "5. dxe5 dxe5 6. Nxe5": "This is idiotic on my part.  Shortly after I hit the send button, I realized that I had hung the N to a simple Q check.",
        "6... Qa5+ 7. Nd2 Qxe5": "Black is now much better.  Black has a material advantage and open diagonals for the Bs.",
        "8. Nf3": "White gets the N to a better square and gains a tempo.",
        "8... Qc7 9. O-O Bd6 10. h3": "Allowing the N to be pinned with Bg4 would be ugly.",
        "10... h6": "I think h6 was unnecessary.  Ng5 is not much of a threat.  I think Black should 0-0 or develop with Be6.  ",
        "11. Bd2 Nbd7": "It might be better to play Be6 before blocking it in with the N.",
        "12. Bc3": "This was the best available square for the B.  The original diagonal is blocked with a pawn.",
        "12... O-O 13. Qe2 a6": "I think a6 may also be unnecessary.  Black is now lagging behind in development.",
        "14. Rfd1 Re8 15. Qf1 Nc5": "Moving the N from d7 allows a pawn weakness to be created.",
        "16. Bxf6 gxf6": "Now Black's K is somewhat exposed.  With good play the material advantage should still decide, but Black now has to be more careful.",
        "17. a3": "This was intended to slowly improve my position and prepare b4 if needed.",
        "17... b5 18. Nd4": "This improves the position of my N.",
        "18... Nxd3 19. Qxd3 Be5": "Black threatens to play c5 now and when the N moves, leave b2 exposed.",
        "20. c3 Rd8 21. Qe4": "Adding a second attacker to c6 and threatening to win the pawn.",
        "21... Bb7": "This move is tempting, but ignores the danger to Black's K.  With a material advantage, Black should just exchange with Bxd4.  That removes one of the attackers and makes it very difficult for Black to lose.",
        "22. Nf5": "White is not worried about the possible discovered attack on the Q because there is a check in his back pocket.",
        "22... c5": "c5 would normally be a good move, but here it leads to a checkmate.  I think Black simply underestimated the threat to the K.  It's important to have a sense of danger.",
        "23. Qg4+": "Black resigns because all roads lead to checkmate.  Kh8 or Kh7 fail to the immediate Qg7#.  If Kf8, Black still plays Qg7+.  After Ke8 (forced, since e7 is covered by the N), Qg8#.  The last flight square, d7, is covered by White's R.\n\n"
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=60870",
    "gameName": "Let's play chess",
    "players": "mmoody95 (1802) vs. pittol (1451)",
    "opening": "Queen's pawn (A40)"
}