{
    "moves": {
        "1. f4": "I wanted to experiment with the Bird-Larsen.",
        "1... d5 2. Nf3 f6 3. e3 e6 4. Be2": "My idea here is to play it somewhat like the Dutch with the colors reversed.",
        "4... Bd6 5. O-O Ne7 6. d4 f5": "This seems to lose a tempo, and also creates a hole on e5.  It seems incongruous to play Ne7 and then f5--if f5, shouldn't the N belong on f6?  Otherwise, wouldn't you rather have the N on f5 instead of the pawn?",
        "7. c4": "Here I am thinking about pressurizing d5.",
        "7... Ng6": "The Ng6 really doesn't have any good squares.",
        "8. a3 O-O 9. Nc3 dxc4": "I think this capture is not good for Black.  It leaves e6 as a target.",
        "10. Bxc4": "Now e6 is pinned.",
        "10... Qe7 11. Ng5 h6": "This is the reaction I expected.  Otherwise ...Qh5 is uncomfortable.",
        "12. Nf3": "Now Black's Ng6 is unprotected--and still has no good squares.",
        "12... c6 13. Bd2 Nd7 14. Rc1 Nf6 15. Qc2": "Qc2 prevents Ne4, but also threatens Qxf5 because of the pin.",
        "15... Bd7 16. Qxf5 Kh7": "This move is necessary because Ng6 is hanging.",
        "17. Qc2": "Now White is a pawn up and Ng6 is pinned.",
        "17... a6 18. Nh4": "Trying to pile on to the pinned piece.",
        "18... Be8 19. Bd3": "More piling on.",
        "19... Nh5": "I think this is a blunder.  Black may have been targeting the Nh4, but Ng6 is hanging.",
        "20. Nxg6": "There are no good options for Black here because this capture forks the R and Q.",
        "20... Bxg6 21. Bxg6+": "Now this check is a double attack that wins a second piece.",
        "21... Kh8 22. Bxh5": "White is now up two pieces due to the tactical errors by Black.  My goal from here is simply to trade away any threats Black might have.",
        "22... Rab8 23. Ne4 Rfd8 24. Nxd6 Qxd6": "Rxd6 would have allowed Bb4, picking up the exchange.",
        "25. Qc5": "Exchanging Qs isn't necessary for White, but it will make counterplay difficult.  It also puts the Q on a rank where it can be transferred.",
        "25... Qd7 26. Bg4": "Pinning the backward pawn.",
        "26... Rde8 27. Qh5 Qe7": "Black tries to unpin, but more threats and pins are coming.",
        "28. Bb4 Qf6 29. Bd6": "This move gets a tempo for the actual goal--to transfer the B to e5.",
        "29... Rbd8 30. Be5": "Another tempo, and another pin.",
        "30... Qe7 31. Qxh6+": "Using the pin to finish the mating attack.",
        "31... Kg8 32. Bxe6+": "Black resigned here in view of multiple forced checkmates.  If 32...Qxe6 33. Qxg7#.  If 32...Kf8 33. Qh8#.  If 32...Qf7 33.Qxg7#, a strange-looking mate with side-by-side Qs."
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=65457",
    "gameName": "Let's play chess",
    "players": "mmoody95 (1895) vs. silverhawk100 (1491)",
    "opening": "Bird's opening (A03), Lasker variation"
}