{
    "moves": {
        "1. e4": "This was an open challenge",
        "1... c6": "I decided to try the Caro Kann which I am not very familiar with",
        "2. d4 d5 3. e5": "advance variation, it looks as though I could be a little cramped here",
        "3... Bf5": "Still well within the database here, though it seems to me that this is a good time to move my lsb as I am looking at e6 and don't want my lsb blocked in",
        "4. Bf4 e6 5. Nf3": "This is getting interesting, white has a strong grip on the dark squares on the centre and I have the light ones",
        "5... Bb4+ 6. c3 Ba5 7. b4": "This move takes us out of the gameknot database. Whites stranglehold on the dark squares n the centre is going to make my dsb passive for a while",
        "7... Bb6": "The primary reason I chose this was that if he castled kings side it would be nicely lined up on the king. I'm still not sure if Bc7 would be better?",
        "8. h3": "This move seems to me to be uneccessary, if I were white I would have concentrated on developing",
        "8... Ne7": "pretty much the only place the knight can go",
        "9. Bg5": "Again this doesn't really achieve a lot, the knight isn't really going anywhere. I was expecting him to develop his knight or lsb",
        "9... a5": "This may be a little premature, however I wanted to break up his pawn structure a little and try to get my dsb more active",
        "10. b5 O-O": "getting my king safe and avoiding cxb5, Bxb5+ which allows white to develop his lsb with tempo, particularly as that bishop would be tough to extract",
        "11. c4 Qd7": "Expecting some pawns to be exchanged",
        "12. Nc3 h6": "This was to give my lsb a hidey hole if it should be needed",
        "13. Be3 Qd8": "This makes my move 11 a waste",
        "14. g4 Bh7 15. h4": "At this point I started to get a little worried, those pawns could present a major threat. As it happens they play no further part in the game, I think that's a lost opportunity for white.",
        "15... a4 16. Nxa4 Ba5+": "Looking to soften the threat on my kingside with an exchange or two",
        "17. Bd2 Bxd2+ 18. Nxd2 Qa5 19. Nc5 dxc4 20. Bxc4 cxb5 21. Be2 Nbc6": "Looking at the d4 pawn\n\nWhites pawn structure now looks a little more shaky and his king can't hide by castling as it will be fairly exposed if it does, though it could be safer than where it is now.",
        "22. Nxb7 Qb6": "that pawn is now mine and the d file will be open for my rooks",
        "23. Nc5 Nxd4 24. Nd7": "I completely missed this unpleasant looking fork",
        "24... Qc6": "making threats of my own with Nc2, Kf1, Qxh1#. This was probably the key move of the game for me.",
        "25. Nf3 Nxe2 26. Kxe2 Nd5": "Now threatening a royal fork",
        "27. Qd2 Bd3+ 28. Kxd3": "This was a tremendous stroke of luck for me, probably best was Ke1. Qxd3 for example falls to a royal fork.",
        "28... Qc4#": "Thanks for reading please feel free to comment"
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=33461",
    "gameName": "Let's play chess",
    "players": "monkyx (1343) vs. elwoos (1555)",
    "opening": "Caro-Kann (B12), advance, Short variation"
}