{
    "moves": {
        "1. d4 Nf6 2. g3 e6": "Unfortunately for me, I was not thinkin at all in this position. My main move is 2...b5. ",
        "3. c4 Bb4+ 4. Nc3 Bxc3+ 5. bxc3": "One of the openings I dislike very greatly is the catalan. There is quite a lot of theory in it as well. The capture of the c3 knight gives the position the structure of a nimzo indian, which is part of my main opening repertoire. ",
        "5... c5 6. Nf3 O-O 7. Bg2 d6": "Black's intention is to fix the white c pawns up for attack. White should strive to activate the bishop pair and make it count for something. Therefore, he should castle, keep the tension between the pawns, play in the center with move of e4. Black will try to make white the one releasing the tension, by playing ...e5. So white needs to stop this move. However, my opponent was not thinking about the planning, and just makes ordinary moves that give black an advantage.",
        "8. O-O Nc6": "Now ...e5 is a threat, since black will pressure d4 even more greatly. So 9.Bf4 is more likely the best move. 9...Nh5 10.Be3 and the knight is not well placed.",
        "9. Qc2": "The lazy \"natural\" move gives black the advantage.",
        "9... e5": "So black is playing in the center, and threatening to win material. Here is a rule you can use when ceding the bishop pair. *When ceding a bishop of a color, you can place your pawns on the color of that bishop*. It works a lot of the time in many openings. Sicilian dragon, where there is no yugoslav attack: f6, e5 if Bh6.",
        "10. Be3 Qe7 11. dxc5": "White finally collapses under the tension and captures; A mistake. Now the c pawns of white are the real weaknesses, and black has retrained the activity of the white piecs with the good e5 and c5 pawns.",
        "11... dxc5 12. Rab1 Be6 13. Qb3 b6": "White threatened to capture b7, so black prevented it. Right now, white has weaknesses, while it is much more difficult to attack black's position. The weakness on c4 can be probed at almost anytime, and any endgame with king and another piece should favor black. Therefore, black is having a big strategical advantagae.",
        "14. Qb5 Bd7": "To be honest, I felt a bit unsure at this point. If my plans were going well, I should not have to retreat my pieces. It turns out that it was the best move. Furthermore, this move is not really a passive move, since it eyes the white queen. ",
        "15. Rbd1 Na5 16. Qa6": "It is a really big tactical mistake now. The queen has no where to go. Therefore, black needs to search for tactical resources. Can you find the right move? ",
        "16... Ba4": "Not too difficult to find; It is a forcing move, so we should check it out firstly. ",
        "17. Rd2 Nd7": "Now the white queen is lost, and I had believed to have won the game here. Therefore, I played the rest of my moves quickly, and counted this as a \"sure win\". ",
        "18. Nh4 Nb8": "This is a real mistake that seriously hurts the black winning chances. 18...Nc7 was the simple alternative that led to a clean win. However, I planned this move the last turn, and decided it was best without due thought. ",
        "19. Qxa5 bxa5 20. Bxa8 Nc6": "As you can see now, black's advantage is not so great actually. It is perhaps a -/+, but that is it. Maybe even =/+. Here, I started to worry a bit, and saw my missed win. So I slowed back down and composed another plan. Since I have space on the kingside, as well as the king to attack and some misplaced white pieces, I need to attack there. ...f5 is an idea, followed by ...f4. Furthermore, white is not losing his light squared bishop for less effective knight, so I can exploit the light weaknesses as well. ",
        "21. Bxc6 Bxc6 22. Nf5 Qe6 23. Nd6 f5": "Dropping a pawn? Unfortunately, there is no way to protect him. Therefore, I should just continue with my plan unhindered.",
        "24. f3 f4 25. Bxc5 fxg3": "White's last move was a tactical mistake. Now black can crash straight through the king's position! When you make the correct plan and play it out unhindered, it makes a real difference.",
        "26. hxg3 Qh3 27. Kf2 Qh2+ 28. Ke1 Qxg3+": "So now black is winning once more, and has another clear plan: Kill the king in the center area.",
        "29. Bf2 Qf4 30. Rh1 Rb8": "This move really shows that black is in charge. The threat of Rb1+ is hard to meet without some major concessions.",
        "31. Rd1 Bxf3": "A nice little combination that destroys the king cover. When the king had been forced to run to the middle, Every turn was spent calculating the forcing moves that could possibly bring me an instant kill. Although some think it is very dfficult to calculate them each turn, it must be done so you don't miss something. If the forcing move is really bad, chances are you will tell in a few seconds.",
        "32. Rf1": "32.exf3 Qxf3 Mate in a few or losing the h1 rook at least.",
        "32... Bxe2": "Here I see a simple way to easy victory.",
        "33. Kxe2 Rb2+ 34. Kd3 Rxf2 35. Rxf2 Qxf2": "How did this have to do with bias in chess? A lot of moves that were critical to the game were affected by them. Some of the most common biases are:\n1.(In the case of examining forcing moves)If I threaten him with that pawn, he can take it 4 ways, so one of them is bound to be good. I won't consider it at all. But maybe all those captures lose!\n2.Oh, this move forks his pieces, exploits weak king, and frees my position, it must be the best move! Admiring a move can only blind you to other possibilities.\n3.My opponent attacked my queen, so where should I put it? Think counterattack first, since they are more forcing and they help push your agenda."
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=45322",
    "gameName": "Let's play chess",
    "players": "metcal (1877) vs. tiger_lilov (1807)",
    "opening": "Queen's pawn game (A45)"
}