{
    "moves": {
        "1. b3": "Larsen's opening, also called Queen's fianchetto opening. The idea is to prepare for a fianchetto of the queen's bishop which will attack throught the long diagonal b2-f6, This was the first time I've encountered such a strange opening.",
        "1... e5": "Limiting the influence of the would-be finachettoed bishop and attempting to control the center, also d5 or c5 were both possible ",
        "2. Bb2 Nc6": "Protecting my central pawn and developing a piece",
        "3. e3": "Preparing for d4",
        "3... d5 4. Bb5": "White threatens to wina pawn after ... a6? Bxc6 bxc6 Bxe5 but the reply was easy!",
        "4... Bd6": "This develops a piece and prepare for castling as e5 wastes time and inceases the influence of the finachettoed bishop.",
        "5. Bxc6+": "Mistake, now white exchanged his bishop fo a knight without gaining any advantage, if it was afte a6 then this move wouldn't have been too bad.",
        "5... bxc6 6. d4": "Now white has blocked the way of his own fianchettoed bishop!",
        "6... e4 7. c4 Qg5": "Threatening to win a pawn but it was just a threat!",
        "8. g3": "Really poor move, Ne2 was better, after that I can't take the pawn. Now white is in trouble!",
        "8... Bg4 9. Ne2 Bf3": "Exploiting the weakness of the light squares in the white camp.",
        "10. Rg1 Ne7": "Probably Nf6 was better here, but Ne7 isn't bad!",
        "11. Ba3": "White realizes that his blocked bishop isn't doing him any good so he decides to exchange it!",
        "11... Bxa3 12. Nxa3 O-O 13. c5": "Mistake, white closed the situation with no advantage for him, cxd5 was far better and then he could attack through his half-open c file!",
        "13... Nf5": "Bringing force to the combat zone, and I was thinking I could play Nxe3 aftewards which puts the white in serious trouble",
        "14. Qd2": "Preventing Nxe3!",
        "14... Qh5 15. h4": "Theaten to win a pawn, and h4 was the only possible reply!",
        "15... Qg4 16. Nf4": "A mistake the loses the white a pawn, but understandable because Nxh4 wasn't that obvious!",
        "16... Nxh4": "Wining a pawn",
        "17. Qa5 Rfc8 18. b4": "attempting to assault my queen's side and open things up!",
        "18... a6 19. Nb1 Bd1": "Good move, This attemps to win a rook fo a minor piece!",
        "20. Nc3": "Rh1 was better here, after ...  Nf3  Kf1 g5 Nc3!, white can hold up!",
        "20... Nf3+ 21. Kf1 Nxg1 22. Kxg1 Bf3": "Now I have a wining position, but my rooks can't step in!",
        "23. a4 h5": "clearing any obstacles in my way to the mate!",
        "24. Kh2 h4 25. Rg1 g5": "White is helpless now and the mate is soo, it just a matter of How to execute it!",
        "26. Nh3 Kg7": "Clearing the way fo my rook to step in ",
        "27. Nb1 f6": "Now here I was considering sacrificing my queen for a quick mate, 27. ... QxNh3 28. Qxh3 g4  29. Kh2 hxg3  ... etc, but I realized that the white's king has a safe spot [f4] and I needed to control it.",
        "28. Nd2 hxg3+": "Opening the h file for my rook!",
        "29. Rxg3 Qh5 30. Nxf3 exf3 31. Kg1 g4 32. Nf4 Qf5": "Now here white was hopeless, but he could resist for while, 33. b5 Qb1  34. Kh2 Rh8  35. Nh3 Rxh3  36. Rxh3 gxh3 ...",
        "33. Kf1": "A blunde! I can't imagine how did he make this move. Probably he thought that the position is hopeless and he wanted a quick death!",
        "33... Qb1#": "Checkmate!"
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=7521",
    "gameName": "Let's play chess",
    "players": "moonrabbit (1382) vs. captaint (1393)",
    "opening": "Nimzovich-Larsen attack (A01), modern variation"
}