{
    "moves": {
        "1. e4": "A common and logical first move.",
        "1... d6": "The Pirc Defense.\r\n\r\nSome ambitious players consider the Pirc to be boring and passive",
        "2. d4": "Always go for the e4-d4 setup when your opponent makes a passive first move",
        "2... Nf6": "The point of d6 on first move is to block to e5 square from pawn advances",
        "3. Bd3": "I made a passive move. Nc3 is better because it puts the knight attacking the centre.\r\nMy bishop isn't really controlling much of the centre, just defending the pawn",
        "3... e5": "Strikes the centre right away",
        "4. c3 c6": "Not a necesary move",
        "5. Ne2": "I develop my knight here so that it can have more maneuvering space and doesn't obstruct my f-pawn",
        "5... Be7": "Prepares to castle",
        "6. f3": "I make a passive move here because I cannot come up with a plan at this moment, so right now I am just securing my strong center",
        "6... O-O 7. Be3 Be6 8. Nd2 Nbd7 9. Qc2": "There isn't much going on in the position, so I am just placing my pieces where I think they stand the best",
        "9... d5": "Black pushes into my center, challenging my pawn. The position is about equal.",
        "10. g4": "My threat is to play g5, followed by exd5 and Bxh7  but Black can still keep equality with dxe4, stopping my threat.",
        "10... Qb6": "Allows my threat",
        "11. g5 Ne8 12. exd5 cxd5 13. Bxh7+ Kh8 14. h4": "I should've just retreated my bishop and stayed up a pawn, but this risky aggressive move almost cost me the game, but gave me a prettier win.",
        "14... g6": "Black has trapped my bishop and there seems to be no way out. How did I ever win?",
        "15. h5": "Black can't take my bishop yet because I will play hxg6   with mate in a few moves.",
        "15... Bf5": "Black wants my queen off the diagonal so that it will be safe to take my bishop ",
        "16. Qa4": "The most active spot for my queen in a crazy game like this.",
        "16... Qxb2": "Black got a little greedy here. He probably could've taken my bishop now, but hxg6   gives me two pawns for the bishop and a potential kingside attack. Something Black probably didn't want.",
        "17. Rb1": "A very risky move. I wasn't confident playing Kf2, because then Black can still take my bishop and I'll only have one pawn for it.\r\nTaking risks like this are okay in desperate positions. And this risk paid off",
        "17... Bxb1 18. Qxd7": "The point of my exchange sacrifice was to get my queen more actively placed toward Black's king, thereby increasing the danger of him taking my bishop.",
        "18... Bd3": "Not good. Black should've moved his other bishop which is under attack by my queen, but instead wants to play Qa1  with an attack on my king. My king is perfectly safe in the center because of the pieces covering it. And Black already has a material advantage, so he should've been safely defending.",
        "19. Qxe7": "Black is losing this position, because his f8 rook is trapped, his centre pawns are weak, and his king is exposed to attack.",
        "19... Qa1+ 20. Nb1": "I cannot let Black have my rook, it is an important attacker against Black's king, so I give Black one of my defensive pieces instead.",
        "20... Qxb1+ 21. Nc1": "My king's position is safe now despite being in the center, and Black's will soon fall apart due to his cramped pieces on the back rank and his weakened pawns on the kingside.",
        "21... Kg7": "Black must defend his rook because his material advantage is the only thing compensating him for his exposed king and misplaced pieces. Although Kg7 is a losing move.\r\nNg7 is Black's only hope, but Qf6 or hxg6 would still give me a very promising attack.",
        "22. h6+": "Now Black can't defend the rook anymore",
        "22... Kxh7 23. Qxf8": "Now material is even, but I have an unstoppable mating threat. Can you see it?",
        "23... Qc2 24. Qxf7+": "There was no way Black could've defended this.",
        "24... Kh8 25. h7": "I am now threatening Qg8 mate. And the only way to stop it is to move the knight, except the only problem is that the knight is the only thing guarding Qf6 mate!",
        "25... Nd6": "Black could've stalled checkmate for a few moves with sacrificing checks, but that is what poor sports do.",
        "26. Qf6#": "Or maybe Black didn't even notice this mate. Or hoped I wouldn't see it."
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=1562",
    "gameName": "Let's play chess",
    "players": "bakerbaker (1627) vs. sebastien (1584)",
    "opening": "Pirc defence (B07)"
}