{
    "moves": {
        "1. d4": "A simple game in whcih white lost a piece early, and black then played it out without giving white any chances of receovery.",
        "1... Nf6 2. c4 e6 3. Nc3 Bb4 4. a3 Bxc3+ 5. bxc3 c5 6. Bg5 O-O 7. Nf3": "I was waiting for this move so I can play with my favortie b6.\r\nThat is no use earlier because then white has the counter f2-f3, building a strong center.",
        "7... b6 8. e3 Bb7": "Black has gained control over the white squares, but white has a strong center still.\r\nIt needs to be undermined, preferably with d6 and e5.",
        "9. g3": "Bd3 would have been consistent, white should have concentrated on a quick development.\r\nThis creates weaknesses on the white fields surrounding the future home of whites king.\r\n",
        "9... d6 10. Bg2 Nbd7": "Preparing for the break e6-e5, after which balck has a slightly better position.",
        "11. O-O Qc7": "In this position theknight is worth more then the bisshop, so white shold have taken the knight with Bxf6.\r\nThe knight is about to move to a strong placve in the cnter, and the bisshop has little room to manoever.\r\nHad white not played g2-g3, the bisshop could have gone to g3, where it wold have been been placed good, aiming blacks Queen.",
        "12. Qc2 Ne4 13. Bf4 f5 14. Ng5 Nxg5 15. Bxg5": "This costs a piece, correct would have been 14.Bxb7, Qxb7; 16.Bxg5\r\nThen black can counter h6 with Be7, because the pawn d6 has no cover.\r\n",
        "15... Bxg2 16. Kxg2 h6": "Now be7 is no use because of Re8 or Rf7.\r\nWhite loese the bisshop wherever it goes.",
        "17. Bf4 e5 18. Bxh6 gxh6 19. Qe2 Nf6": "Taking aim at whites king already",
        "20. Rad1 cxd4": "Exposing the weak pawn at c4, and opening the important c file for blacks rooks",
        "21. cxd4 Rac8 22. Qd3 Ne4 23. Rdc1 Qb7": "Taing the Queen out of sight of that white rook, and creating some dangerous tactical tricks by aiming whites kingside",
        "24. Kg1 Ng5": "Theatens Kh3 already. White has to act to protect his king",
        "25. d5 e4": "Taing hold of that the filed f3 for his Night. Blacks Queen will soon follow via b7-f7-h5",
        "26. Qc3 Nf3+ 27. Kg2 Qf7 28. Qc2": "Reinformcement on the King side are required uregntly, so white Queen moves to e2",
        "28... Qh5 29. Rfh1 Ne5 30. Qd1 Qxd1": "Of course, the endgame is an easy win.\r\n",
        "31. Rhxd1 Rc5 32. h3 Rfc8 33. Rd2 Kf7": "The is no hurry. Balck moves his king to d7 to be able protect the c-file.\r\nWhite is not only a piece down, he can only wiat while black prepares to finish him of",
        "34. Rcc2 Ke7 35. a4 Rc5xc4": "The a4 pawn is on black menu too.\r\nAfter that the plan is a simple advance of the b and a pawn supported by both rooks and the knight.\r\nNote waht a strong position the knight has on e5.",
        "36. Rca2 Rc8c5 37. h4 Ra5 38. Kf1 Raxa4 39. Rxa4 Rxa4 40. Rc2 Ra1+ 41. Ke2": "Bad move, and one whcih leads to a quick checkmate",
        "41... Nf3": "White surrendered. he can give a few check on the balck king, but the he has nothing to prevent checkmate with Re1#\r\n\r\nAll in all a simple game where balck gained a piece earl, and then played it out with some precise play.\r\n"
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=30554",
    "gameName": "Let's play chess",
    "players": "nutscracker (1686) vs. eduard352 (1846)",
    "opening": "Nimzo-Indian (E24), Saemisch, Botvinnik variation"
}