{
    "moves": {
        "1. e4 b6": "I've been experimenting with positions that result from an early Queenside fianchetto.",
        "2. Bc4 Bb7 3. d3 e6 4. a3 d5": "Challenging the center immediately.",
        "5. Bb3": "exd5 might have been better because it doesn't drop a central pawn.",
        "5... dxe4 6. dxe4 Qxd1+ 7. Kxd1": "White loses his ability to castle, potentially slowing his rooks from getting into play.",
        "7... Bxe4 8. f3 Bb7 9. Bf4 Bd6 10. Nh3 Bxf4 11. Nxf4 Nf6 12. Nc3 O-O 13. Ke1 a6 14. Kf2": "A good move that activates the Rooks.",
        "14... Nc6 15. Rad1 Rad8 16. Rde1 Nd4 17. Red1 Nxb3 18. cxb3": "My thought here is that I am a pawn ahead, with a better pawn structure as well.",
        "18... Rd6 19. Rxd6 cxd6": "The d pawn is now a passed pawn.  I should be able to use this later to create pressure for White.",
        "20. Rd1 Rd8 21. b4 b5 22. a4 bxa4 23. Nxa4": "White's b pawns are now doubled, and more importantly, isolated.  Another potential target later in the game.",
        "23... Bc6 24. Nb6 d5 25. Ra1 Bb5 26. Rc1 Kf8 27. Nc8 Bd7 28. Nd6 Ke7 29. Nb7 Rb8 30. Nc5 Rxb4": "One of the isolated b pawns drops.",
        "31. Nfd3 Rc4": "In retrospect, I'm not sure this move was a good idea because it trades away my passed pawn.",
        "32. Rxc4 dxc4 33. Ne1 Bb5 34. Nc2 Kd6 35. Nb7+ Kc7 36. Nc5 Kc6 37. Ne4 Nxe4+ 38. fxe4": "Now I have a two pawn advantage and a Bishop against a Knight.  I've got to figure out a way for the Bishop to be effective.",
        "38... Kc5 39. Ke3 e5 40. Kd2 h5 41. Kc3 g6 42. g3 a5 43. Ne3 Ba6 44. h4 Bb5 45. g4 hxg4 46. Nxg4 Kd6 47. Ne3 Kc5 48. Ng4 Kd6 49. Nh6 Ke6 50. Ng4 f5": "This should create another passed pawn, which should be to my advantage.  My opponent will have a passed h pawn, but I should be able to use the Bishop to restrain it.",
        "51. exf5+ gxf5 52. Ne3 f4": "With two passers, I can really start to tie up the Knight.",
        "53. Ng4 Kf5 54. h5 Be8 55. h6 Bg6": "The h pawn has been restrained now, allowing me to push the e and f pawns.",
        "56. Nf2 e4 57. Kxc4": "Losing the c pawn is not a big deal, since my opponent's b pawn still cannot advance.",
        "57... e3 58. Nd3 f3 59. Kd4 f2": "The f pawn cannot be stopped.  If Kxe3, f8(Q).  If Nxf2, exf2 with promotion to follow."
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=27694",
    "gameName": "Let's play chess",
    "players": "pittol (1373) vs. mmoody95 (1829)",
    "opening": "Owen defence (B00)"
}