{
    "moves": {
        "1. e4 e5 2. Nf3 Nc6 3. Nc3 Nf6 4. Bb5 a6 5. Bxc6 bxc6 6. Nxe5 Bb7 7. d3 d5 8. Nf3 d4 9. Na4 c5 10. O-O Be7 11. Bg5 Bc6": "It might look liek Black has adequate defense here, but the Black Square Bishop is over worked defending two pieces. Only one will survive.",
        "12. Bxf6": "If Black's White Square Bishop takes the Knight, White's Bishop takes the Pawn on g attacking the Rook and then escapes. If Black takes the Bishop he loses the Pawn on c. ",
        "12... Bxf6 13. Nxc5 O-O 14. Nb3 Rb8 15. Na5 Ba8 16. b3 c5 17. Nc4 Qc7 18. a4 g6 19. Qd2 Qe7 20. Rae1 Bg7 21. Qf4 h6": "He spent a lot of moves building his little fortress and now has weakened it?",
        "22. Qd6 Qe6": "Trading Queens was not a winner for Black, but losing a Pawn is not better.",
        "23. Qxc5 Rfd8": "There is a bit of danger that the White Queen might have to struggle to escape, so she needs to get back quickly now.",
        "24. Qa5": "Looks like it will be a successful sortie that won a Pawn with a safe retreat back behind friendly lines.",
        "24... Bf8 25. Qe5 Bb4 26. Qxe6 fxe6 27. Re2 a5 28. Nfe5 Kg7 29. Nd2 Bd6 30. Nec4 Bb4 31. f4 Rde8 32. Nf3 Rbd8 33. Nce5 Ref8": "That Pawn on d is a tempting target once he moves that Rook from defending it, but I must be careful as long as he has that Black-Square Bishop that could pin the Knight there.",
        "34. Nh4 Rfg8 35. Nhxg6 Bd6 36. Nh4 Rdf8 37. Rf3 Bxe5": "The thing I have been watchful of is the two Bishops he has. I have been careful not to give them an open diagonal toward my King's side. Now he has traded one Bishop, so I will be less worried about the other. I also may go after that pawn on d now that the dangerous Bishop is gone.",
        "38. fxe5 Bc6 39. Rg3+": "SInce I have a material advantage now, I only need to worry about some clever attack by his Rooks and Bishop. I can force trades to eliminate his offensive capabilities which will leave me to methodically drive forward to a win.",
        "39... Kh7 40. Rxg8 Rxg8 41. Nf3 Rd8 42. Nd2 Be8 43. Nc4 Bh5 44. Rf2 Rc8 45. Nxa5 Bd1 46. Nc4 Rc7 47. h3 h5": "I had intended to move the Pawn on g to g4 in order to trap his Bishop, but he saved me the trouble.",
        "48. Rd2 Bxc2 49. Rxc2": "Black resigned with the quip: \"I finally got one of your Pawns\". I hadn't actually though about it, but that was the first Whie Pawn taken. What an unusual game!"
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=5634",
    "gameName": "Let's play chess",
    "players": "almageccom (1503) vs. madd (1569)",
    "opening": "Four knights (C48), Ranken variation"
}