{
    "moves": {
        "1. e4": "Rampage!\n\nAn unusual game for me. Which is probably why its a favourite. ;-)",
        "1... e5 2. Nf3 d5": "My opponent is supposed to respond K-c6. I know that opening. Now I'm lost, I really need to study openings.",
        "3. exd5 e4 4. Nd4 f5 5. c4 Nf6 6. Nc3 Bc5 7. Nb3 Bd6 8. d3 O-O 9. Bg5 Be5 10. d4": "Although rather exposed on the e file, I'm quietly happy so far. Often novelty whilst far more interesting throws me and I make too many mistakes.",
        "10... Bd6 11. c5 Be7 12. Bc4": "Protecting d5, but also looking at the exposed check.",
        "12... Kh8 13. O-O Nbd7 14. f3": "Wasn't quite sure what to do here. I like the formation pretty much as it is and I'm slowly learning about letting threats hang rather than charge in for swapsies. So this is a bit of a nothing move to try and add to the central domination.",
        "14... Nxd5 15. Bxe7": "With the bishop under threat I choose to deal with that first rather then BxK.",
        "15... Nxc3": "And then I get a shock. That wasn't what I was expecting. If I move the queen the bishop goes and I'm a piece down, so I felt I was rather forced into the swap rampage that followed....",
        "16. Bxd8 Nxd1 17. Be7": "Hmmm, take the knight or protect the bishop.... I decided if he lost a tempo moving the rook I'd still get the knight, got to be better right?\n",
        "17... Ne3": "Ah.\n",
        "18. Bxf8 Nxc4": "But then that surprised me. I expected KxR, kxK..KxB. I'm not sure why he chose to go thatta way. Maybe to extract the knight, but it also allows me to extract the bishop.",
        "19. Be7 Nxb2 20. fxe4": "I wanted my opponent to play pxp as I erroneously believed I had the back row mate. Fortunately yet again he doesn't do what I'd expected (otherwise I'd have lost my rook!)",
        "20... b6 21. c6 Nf6 22. Bxf6 gxf6 23. e5": "Its very rare I get this kind of situation. Had it against me a few times, but by now I'm looking to push those central pawns and see what I can force.",
        "23... fxe5 24. dxe5 Be6 25. Nd4 Bd5 26. Rxf5 Nc4 27. e6 Be4 28. Rf7 Nd6": "That doesn't gain black much. R-c8 might have been better, though its difficult at this stage.",
        "29. Rxc7 Rg8 30. g3": "Nearly missed that.",
        "30... h5 31. Rd7 Nf5 32. Nxf5 Bxf5 33. e7": "An unusually good move for me (well I think so). Normally I would have protected with one or t'other of the rooks, but I figured if he takes the rook I reunite my pawns and he has a problem.",
        "33... Bxd7": "Which he does.",
        "34. cxd7": "And then he does. ;-)"
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=48349",
    "gameName": "Let's play chess",
    "players": "grey_panda (1447) vs. eachknight (1358)",
    "opening": "QP counter-gambit (C40), Maroczy gambit"
}