{
    "moves": {
        "1. e4 e5 2. Bc4 Nf6 3. d3 c6": "Not sure what you had in mind here, but this is only good if your plan was to follow it up with ...d5. Your priority should be to develop your pieces, so ...Bf5 and ...Nc6 are the best moves.",
        "4. f4 Bd6": "Already we can see the problems caused by 3...c6:\r\n\r\n1. The e-pawn can no longer be protected by playing ...Nc6.\r\n2. If you play the natural ...d6, the bishop on f8 is blocked in.\r\n\r\nThe move you have selected means that the other bishop is now blocked in and more time-consuming pawn moves will be required to free it. On the plus side, you are threatening to win a pawn.",
        "5. Nf3": "Developing a piece to a good square and threatening to win a pawn, but ignoring the threat to his own pawn.",
        "5... Qe7": "I guess you saw 5...exf4 6.e5 Qe7 7.Qe2.",
        "6. Ng5": "Pointless - what will White do after 6.0-0?",
        "6... exf4": "You really should have castled.",
        "7. Bxf7+ Kf8 8. Bc4 b5 9. Nf7": "Not good - after 9...bxc4 10.Nxh8, the knight is trapped and Black has the advantage.",
        "9... Rg8": "9...bxc4 gives Black the advantage.",
        "10. Nxd6 Qxd6 11. Bxg8 Kxg8": "White has won the exchange, but Black has the better development, so the game isn't over yet.",
        "12. Qf3 Qd4": "Unfortunately, it's not easy (because of previous moves) for Black to complete his development quickly and effectively. So although this move doesn't actually develop a piece it was probably the best available since it hinders White's development (although at the expense of a pawn).",
        "13. Qxf4 d5": "Freeing both bishop and knight - good.",
        "14. c3": "A horrible move - why not Nc3?",
        "14... Qxd3 15. Rf1": "Threatening 16.e5 with 17.exf6 or mate to follow.",
        "15... Bg4": "Well found! But if White had played Nc3 he would be protecting those white squares around his king.",
        "16. Qd2 Qxe4+ 17. Qe3 Qc2 18. h3 Bh5": "You should have noticed that White's king and queen were on the same file, so 18...Nbd7 19.hxg4 Re8 was an option here.",
        "19. Qe6+ Kh8 20. Rxf6": "A rather rash decision! There is no way that White can win with only one developed piece.",
        "20... Qd1+": "Either 20...Qxc1 or 20...Nd7 wins the game for Black. 20...gxf6 would probably be good enough for a draw.",
        "21. Kf2 gxf6": "Black can still hold the game with ...Nd7.",
        "22. Qxf6+": "Game over.",
        "22... Kg8 23. Bh6 Qc2+ 24. Kg1 Qg6 25. Qf8#": ""
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=16215",
    "gameName": "Let's play chess",
    "players": "stevecub (1383) vs. madik (1391)",
    "opening": "Bishop's opening (C24), Berlin defence"
}