{
    "moves": {
        "1. d4": "Because I know the e4 and d4 open I know the proper response according to what I learned from the 1960's when Fischer and Spassky were at it...",
        "1... Nf6": "I like the Nimzo Attack by you know who. I also like King's Indian Defense. ",
        "2. c4": "The usual for White. ",
        "2... e6": "I go for the NIMZO ATTACK instead of the King's Indian. Either will do. ",
        "3. Nc3": "The usual. ",
        "3... Bb4": "The Nimzo Attack. I learned this as an attack and not a defense. I learned it in the 60's against White. Today they call it a Defense; however, in my days it was an attack. ",
        "4. e3": "White is willing to suffer stacked pawns on \"c\" rank for the trade. \nHowever, my bishop is still attacking and I can develop a pawn to the front to apply extra pressure without mercy. ",
        "4... d5": "This does not alleviate the NIMZO ATTACK. It can develop rapidly to complicate White. ",
        "5. Bd3": "I want c7 to c5 anyway. It is the NIMZO ATTACK. Nothing here is changing this. ",
        "5... c5": "Now the Classical NIMZO ATTACK is in operation with my c5. ",
        "6. Nge2": "He is clearing and defending house here; but the NIMZO ATTACK is on schedule. ",
        "6... cxd4": "His knight at c3 is useless. ",
        "7. exd4": "A forthright pawn trade to diminish the NIMZO ATTACK. ",
        "7... dxc4": "It results in an isolated pawn for white",
        "8. Bxc4": "He should get his king 0-0'd. ",
        "8... O-O": "I do mine first. ",
        "9. O-O": "He follows. ",
        "9... Nc6": "I am developing whilst seeing I may have to move my knight that just JUMPED out. ",
        "10. a3": "Pressuring my bishop to another place....",
        "10... Bd6": "If he wants to continue pushing my bishop let him do so...",
        "11. Bg5": "A good pin. ",
        "11... Bxh2+": "However....",
        "12. Kxh2": "His King......",
        "12... Ng4+": "under attack by an unlikely piece while his bishop is out for grab. ",
        "13. Kg3": "So I am ready to grab it. ",
        "13... Qxg5": "Disclosed check is here...",
        "14. f4": "Separating my Queen necessarily for now...",
        "14... Qg6": "But still under disclosed check....",
        "15. f5": "An advance I can handle with a pawn...",
        "15... exf5": "I have to use it...and defend the posted knight. ",
        "16. Nf4": "I am thinking another pin is in the make...",
        "16... Qd6": "So I do it. ",
        "17. Nb5": "White is trying to unpin the pin...",
        "17... Qb8": "The pin remains. ",
        "18. d5": "White pushes a \"passed pawn\" to threaten...",
        "18... Nce5": "I move my knight forward with my forward deployed knight. Together they are a lock. ",
        "19. Be2": "In the lock the knights are fine. This move entices me to do what knights are famous for....",
        "19... Ne3": "A fork between two more valuable pieces. ",
        "20. Qc1": "He doesn't want to lose his queen for the rook. Should I take the rook?",
        "20... Nxf1+": "No better thing to do no better move to make....",
        "21. Bxf1": "Recovering material for White. ",
        "21... g5": "I am doing the King Side attack now...",
        "22. d6": "That pawn isn't going anywhere.",
        "22... gxf4+": "This pawn is. ",
        "23. Qxf4": "My King has an open next window to White's Queen but my pawn has served to block that next move before",
        "23... Ng6": "I close the window and attack while my bishop on c1 is still there to defend. ",
        "24. Qh6": "An aggressive move made by a piece not in a position to really do much. ",
        "24... a6": "Time to push forward...",
        "25. Nc7": "He wants that rook I never moved...",
        "25... Bd7": "He can have it if he wants. ",
        "26. Be2": "?",
        "26... f4+": "Continuing.",
        "27. Kf3": "His knight is still hesitating from the Book of Second Hesitations....",
        "27... Qa7": "This should clear up hesitations...."
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=47945",
    "gameName": "Let's play chess",
    "players": "quantized (1747) vs. 9422m (1927)",
    "opening": "Nimzo-Indian (E40), 4.e3"
}