{
    "moves": {
        "1. d4": "This is one of the game I won by luck... d4",
        "1... d5 2. c4 e6": "I decline Queen's gambit usually.",
        "3. Nc3 Bb4 4. Qc2 Nc6 5. e3": "Normal development...",
        "5... Nf6 6. a3 Bxc3+ 7. Qxc3 O-O 8. Nf3": "Both side developing their pieces since queen's gambit is a slow tempo game.",
        "8... Re8 9. Qc2 h6 10. Be2 dxc4 11. Bxc4 a6 12. O-O b5": "This move is a dangerous one, when I push the pawn it leaves my knight unprotected but my next move will be fianchettoing the bishop.",
        "13. Be2 Bb7 14. b3 Qd6 15. Bb2 Ne7 16. Rac1 Rac8 17. Rfe1 Qd5": "My goal is try to put pressure on the knight, pinning the knight.",
        "18. Bd3 g5": "Trying something dangerous here, breaking up my king's safety",
        "19. e4": "white tries to defend the center pushing pawn to e4",
        "19... Qd7 20. Ne5": "a strong outpost for the knight",
        "20... Qd8 21. Re3 Kg7 22. Rg3 Nh5": "Defending my king my scaring the rook away and removing my pin pawn at g5",
        "23. Rf3 Rf8 24. d5 f6 25. Ng4 exd5 26. Nxf6": "This is a dangerous move white made, a knight sacrifice",
        "26... Nxf6 27. e5": "white pushes pawn, looking for a discover check with bishop",
        "27... Ne4": "Since theres no threat from the double check tried to move my knight to trade off bishops.",
        "28. Rxf8 Qxf8 29. f3 Qf4": "I didn't know that I just trapped my knight!",
        "30. fxe4 dxe4 31. e6+": "there comes the discover check....",
        "31... Kh7 32. Qc3": "Now I have to be worried about my position of the king queen to c3 forcing checkmate",
        "32... Nf5": "I defend with the knight....",
        "33. Qf6": "queen to f6....forcing possibly mate with queen to f7 next move",
        "33... Rg8": "Now i have to sacrifice my rook I know.",
        "34. Rxc7+": "This is a blunder move by white, white takes pawn at c7 not knowing its guarded by my queen.",
        "34... Qxc7 35. Qxf5+ Rg6 36. Qf8": "White still has that strong pass pawn, now forcing mate at h8",
        "36... Rg8 37. e7": "dangerous move here.....",
        "37... Qc5+": "However the life saving move was queen to c5 check...... ",
        "38. Kf1": "This stops the promotion of the pawn, rook takes queen at f8."
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=20202",
    "gameName": "Let's play chess",
    "players": "ruprekt (1600) vs. metallicpawn (1628)",
    "opening": "QGD (D31), 3.Nc3"
}