{
    "moves": {
        "1. e4 e6 2. d4 c5": "An unusual variant of the French. I think Black played it to try to throw me off balance, using my own technique against me. But you can't con a con man, and that trick doesn't work against someone like me who likes offbeat lines. ",
        "3. Nf3 cxd4 4. Nxd4": "Now my Knight is centralized...",
        "4... e5": "...and Black of course drives it.",
        "5. Nf3 d6": "It's always better in the opening to develop pieces. 5...Nc6 would keep open the option of later moving the QP 2 squares.",
        "6. Bb5+": "It's always best to be aggressive as White in the opening. The initiative is the only starting advantage White has.",
        "6... Nc6 7. O-O Qa5": "Not a bad idea. If Black can steal the initiative, he can control the game.",
        "8. Nc3": "I defend with a developing move.",
        "8... Bg4 9. h3": "\"Putting the question\" to the Bishop. Black could maintain the pin by playing 9...Bh5, because I'm not going to rip open my own King's defenses by foolishly replying with 10 g4??",
        "9... Bxf3 10. Qxf3": "Black plays instead for the exchange, and now I just need to activate my QB to complete my development.",
        "10... Nf6 11. Bg5 Be7": "Both sides have completed their development, except that Black still needs to castle. Now the middle-game begins.",
        "12. Ba4 O-O 13. h4 Nd4": "Attack...",
        "14. Qd3": "...and riposte.",
        "14... Rae8 15. Bd2": "Now that I've defended everything...",
        "15... d5 16. b3": "...I could simply play Bxe8. But I simply overlooked it. My opponent also did, or he'd have moved his Rook away.",
        "16... Bb4 17. Bxe8": "I finally see that I can win the Exchange. ",
        "17... Rxe8 18. Rfd1": "Now the hardest part... winning a won game. The key will be exchanging down the pieces and reducing the complexity of the situation.",
        "18... dxe4 19. Nxe4 Nxe4 20. Bxb4 Qxb4 21. Qxe4": "A few of the pieces have come off the board. But I still need to trade off the Queens. The Queen is the biggest troublemaker in these kind of situations.",
        "21... Nc6": "My opponent does the job for me! Now after the exchange, I'll have a winning material advantage in an endgame.",
        "22. Qxb4 Nxb4 23. Rd2": "Now the endgame maneuvering begins. I need to mobilize my Rooks.",
        "23... a6 24. Rad1": "Controlling the only open file is always a good thing.",
        "24... Nc6 25. a4 a5 26. Rd2d7": "Threatening to win the pawn on b7.",
        "26... Nd4 27. Rd2 b6 28. Rd6 Rb8": "Now Black's Rook is tied down.",
        "29. c3 Ne6 30. g3 g6 31. Rd2d5 e4 32. b4 axb4 33. cxb4": "Now I have a wing majority. I'm looking to create a passed Pawn.",
        "33... Kg7 34. Rb5 Ra8 35. a5 bxa5 36. Rxa5": "Now I have my passed Pawn. I'm hoping to induce Black to trade off his Rook.",
        "36... Rb8 37. b5 Nd8 38. Rd5 Nb7": "I need to get a Rook behind my passed Pawn.",
        "39. Ra2 Kf6 40. Rb2": "Mission accomplished.",
        "40... Ke6 41. Rd1 Nd6 42. Rdb1 Nc4 43. Rb2b4 Kd5": "Black is trying to outnumber me 3 to 2 and win the Pawn.",
        "44. Rc1 Nd6 45. b6 f5 46. Kg2 h5 47. Rb2 Nc4 48. Rb5+ Kc6": "This loses the game. With the self-pin, I can now win the Knight and get a crushing advantage.",
        "49. Rb4 Kd5 50. Rcxc4": "Now it's a question of when Black will resign.",
        "50... Rxb6 51. Rxb6 Kxc4 52. Rxg6 Kd4 53. Rg5": "Now he does."
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=26741",
    "gameName": "Let's play chess",
    "players": "thehellion (1283) vs. andrewgbrl (1284)",
    "opening": "French defence (C00)"
}