{
    "moves": {
        "1. d4 f5 2. d5": "?\nSacrificing a tempo this early to play d5 seems strange - especially given that white is almost always able to play d5 later in the Dutch...perhaps my opponent doesn't know the typical lines?",
        "2... d6 3. c4": "? \nAnother pawn move to reinforce d5, but why c4 instead of Nf3 or g3?",
        "3... Nf6 4. Nc3 g6": "Leningrad variation",
        "5. f3": "?\nAgain this pattern of pawn moves aiming at the light squares, but f3 hinders the knight and allows me to develop as normal without trouble.",
        "5... Bg7 6. Bd2 O-O 7. Nh3": "It's ugly, but he has to develop, and the knight is otherwise trapped at home.",
        "7... h6": "*\nI'm not sure about this move - it's obvious that I was afraid of Ng5 (which has hurt me more than once in the Dutch) - and h6 definitely keeps the knight on an irrelevant square, but it also weakens my king and does not develop anything. Maybe Qe8, Bd7, or even Na6 would have been better? Tough call. This may have been a great move - it may have also just expressed undue terror.",
        "8. f4": "?\nMaybe I'm missing something, but why switch the focus from e6 to e5 - Nf4 brings back in the horse that this pawn kept out - why block it with the same pawn AND lose tempo?",
        "8... e5": "!\nPunish sub par moves quickly",
        "9. fxe5 dxe5 10. e3 c6 11. dxc6 Nxc6 12. c5 Be6 13. Bd3": "? \nJust an error",
        "13... Qxd3 14. Nf2 Qd7 15. O-O Rad8 16. Be1": "?\nI chose not to trade queens here (perhaps an error), but trading queens while material down is usually a mistake. ",
        "16... Qc7 17. Bd2": "?\nGiving up tempo - it's better to move forward than look back!",
        "17... Bc4 18. Re1 Rd7 19. Rc1 Qa5": "? \nA cute idea, but easy to defend - I'm material up; it's time to be violent,  not play for some subtle infiltration maneuver. Just triple on the d file and krush (like Irina!)",
        "20. a3 Rfd8 21. b4": "!\nThe first of many tempo losses Qa5 cost me. No me gusta.",
        "21... Qxa3 22. Nb1 Qa6": "After all of that, I get a pawn, my queen is on a shitty square, and I'm no closer to mobilizing my material advantage and killing the king.",
        "23. Rc3 Nxb4 24. e4 f4": "!\nYes, Ali babe - get the king!!!",
        "25. Qc1 Bd3 26. Ra3 Qc4": "Oh NOW you want to trade queens - 39,000 moves after you should have.",
        "27. Qxc4+": "?\nThis just seems bad. I feel like he should march pawns or build a battery. A better player could have exploited this.",
        "27... Bxc4 28. Bxb4 Rd7d4": "?\nNow I'm giving back all of my material. Are you trying to draw, Ali?",
        "29. Rxa7 Bd3": "?\nAngling for a mate that isn't there - cut your losses and defend what material you still have!",
        "30. Rxb7 Nxe4 31. c6 Nxf2 32. c7 Rc8 33. Rb8 Bf5 34. Kxf2 e4 35. Nc3 e3+ 36. Kg1 Rd2 37. Ne2 Ra2 38. Rxc8+": "He just wants to draw - and he does!",
        "38... Bxc8 39. Nxf4 Bd4 40. Ne2 Bb6 41. Bd6 Rd2": "The rest of the game is inconsequential - we wander the board....I make some dumb mistakes,  there's a big mate attempt that ends in a stupid blunder, and, frustrated, I repeat on move 60 and draw.\n\n",
        "42. Kf1 Rxd6 43. Nf4 Rf6 44. g3 Bxc7 45. Rxe3 Bh3+ 46. Ke2 Bg4+ 47. Kd3 Rd6+ 48. Ke4 Bf5+ 49. Kf3 Kf7 50. g4 Bd7 51. h4 Bc6+ 52. Ke2 Ba5 53. Kf1 Bb5+ 54. Kg2 Rd2+ 55. Kg3 Bc6 56. Re6 Ba8 57. Ra6 g5 58. Rxa5 gxf4+ 59. Kxf4 Rd4+ 60. Kg3 Rd3+ 61. Kf4 Rd4+ 62. Kg3 Rd3+ 63. Kf4 Rd4+ 64. Kg3 Rd3+ 65. Kf4": "Final thought - trade queens when you're up; don't be subtle, you'll lose the initiative,  and, for fuck's sake don't sac everything for a mate after it's too late. Be aggressive while you can be, not after the time has passed."
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=54106",
    "gameName": "Let's play chess",
    "players": "barth (1294) vs. alisonhart (1213)",
    "opening": "Dutch (A80)"
}