{
    "moves": {
        "1. Nc3": "Dunst Opening. An unusual opening move that develops a knight and pressures the central light squares. The reasons for its unpopularity are that it does not prevent Black from occupying the center (unlike 1.Nf3) and that it blocks White's c pawn from advancing.",
        "1... Nc6": "Not a standard response to the Dunst Opening. The usual response is 1...d5, which occupies the center and threatens to attack White's knight if not blocked.",
        "2. e4": "The standard continuation of the Dunst Opening. White occupies the center, protected by her knight.",
        "2... Nf6 3. d4 e5 4. d5": "Attacks Black's knight.",
        "4... Nd4": "Black moves his knight out of harm's way. The knight now has an advanced foothold from which it can attack White's back rank in one move.",
        "5. Bg5": "Pins Black's knight to the queen.",
        "5... h6": "Attack's White's bishop, forcing it to retreat.",
        "6. Bh4 g5": "Renews the attack on White's bishop while freeing Black's knight from the pin.",
        "7. Bg3": "Moves the bishop to safety while attacking Black's unprotected e pawn.",
        "7... d6": "Protects Black's e pawn.",
        "8. Bb5+": "? Black can now play 8...Nxb5, which would force White to recapture with 9.Nxb5, hanging her e pawn. However, Black misses the opportunity and instead plays:",
        "8... c6": "? Blocks the check and attacks the checking bishop.",
        "9. dxc6": "? Again gives Black the opportunity to take advantage of the situation by playing 9...Nb5.",
        "9... bxc6": "? Recaptures the pawn and attacks White's bishop, forcing it to retreat.",
        "10. Ba4": "Moves the bishop to safety.",
        "10... h5": "Black attempts to box in White's bishop on g3.",
        "11. h4": "Blocks Black's h pawn from attacking White's bishop and attacks Black's unprotected g pawn.",
        "11... g4": "Moves the g pawn out of danger.",
        "12. b4 a5": "Attack's White's unprotected pawn.",
        "13. b5": "Moves the pawn to a protected square. The pawn is now twice protected and twice attacked. This square, b5, becomes an important focal point and remains so for the entire duration of the game.",
        "13... cxb5": "Attack's White's bishop.",
        "14. Nxb5 Nxb5": "Captures the knight. White can now recapture with 15.Bxb5+.",
        "15. c4": "Instead, White advances a pawn to attack b5 a second time. The knight is still within her grasp, though, as it is pinned to the king and cannot escape.",
        "15... Nxe4": "Black captures the pawn that was left en prise by this exchange.",
        "16. Rb1": "? White again hesitates to capture the knight on b5, and this time her hesitation is more costly. Her rook is now in a position to be forked.",
        "16... Nec3": "! Forks a queen, a rook, a bishop, and a pawn.",
        "17. Qd3": "? White responds by moving her queen to a position where it can simultaneously avoid capture and protect the rook. However, this hangs her bishop at a4. A better response to the fork would have been the more aggressive 17.Bxb5+, which would have forced Black to defer the execution of his fork while he responded to the attack on his king.",
        "17... Nxb1": "? Black falls into the trap that White has set. He should have captured White's unprotected bishop with 17...Nxa4. Instead, both of his knights are now en prise.",
        "18. Qxb1": "White's queen recaptures. Black has won the exchange but could have done much better. The b5 square is now attacked thrice.",
        "18... Bd7": "Black finally moves to free his knight from the pin, which relieves the threat of check.",
        "19. cxb5": "White finally captures the knight at b5. After the dust clears, Black has a material advantage of a rook and a pawn against a knight.",
        "19... Rb8": "Black continues to bring his own forces to bear on the focal point at b5. The pawn there is now attacked twice and protected twice.",
        "20. f3 Rb6 21. f4 f5 22. Bf2": "Attack's Black's rook, but hangs the pawn at f4.",
        "22... Rb7": "Moves rook to safety.",
        "23. Ne2": "Protects the threatened f pawn and makes way for a castle.",
        "23... Qb8": "Brings additional firepower to bear on the focal point at b5.",
        "24. Nc3": "Protects the focal point at b5 a third time, but hangs the pawn at f4.",
        "24... exf4": "Captures the unprotected pawn but creates a doubled pawn structure for Black.",
        "25. O-O Bg7": "Attacks White's knight and makes way for a castle.",
        "26. Re1+": "An aggressive response to the attack.",
        "26... Be5": "Blocks the check and renews the attack on White's knight. However, the attack cannot be executed, as Black's bishop is now pinned to the king.",
        "27. Qb3": "Protects White's knight and prevents Black from castling.",
        "27... g3": "Attacks White's bishop.",
        "28. Bd4": "! White moves the bishop to the only safe location. Although the bishop is unprotected, it cannot be captured because its attacker is pinned.",
        "28... Kd8": "Frees Black's bishop at e5 from the pin, which threatens White's bishop at d4.",
        "29. Qc4": "Moves the queen to protect White's bishop while still protecting all the same pieces that it did previously.",
        "29... Re8": "! Black notices that the White king's movement is constrained; if Black's rook could make it to e8, the king would be in checkmate. Black cannot execute this idea yet, but he positions his rook to take advantage of the situation should the opportunity arise—which it does.",
        "30. Rd1 Qc8": "Attacks White's queen.",
        "31. Qf7": "?? This is the move that loses the game for White. Black can now play 31...Bxd4+, capturing White's bishop, checking the king, and opening the e file to present a serious threat of checkmate. White has no good response to this. A much better move would have been. 31.Qd3.",
        "31... Bxd4+": "! Forks White's king and knight. White cannot respond with 32.Rxd4 because black could then checkmate with 32...Re1#. White is forced to move her king:",
        "32. Kf1 Qxc3 33. Qxh5": "? White moves into a forced checkmate. 33.Qb3 would have resulted in a queen exchange and made Black's job harder.",
        "33... Qc4+": "Black sees the checkmate and takes it. The king is now immobile. (The e file is attacked by Black's rook, the f2 square by Black's pawn, and the g1 square by Black's bishop.) All White can do now is ineffectually throw pieces in the queen's way.",
        "34. Rd3 Qxd3+ 35. Qe2 Qxe2#": ""
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=30801",
    "gameName": "Let's play chess",
    "players": "mshahin (1200) vs. jbarnes (1200)",
    "opening": "Dunst (Sleipner, Heinrichsen) opening (A00)"
}