{
    "moves": {
        "1. e4": "1.e4 \n\nSomeone told that this is the best opening move... :D",
        "1... c5": "1... c5\n\nThe Sicilian...",
        "2. Nf3 d6 3. d4 cxd4 4. Nxd4 Nf6 5. Nc3 a6": "5. ...a6\n\nThe Najdorf variation... \nLook at the board. Black seems to be behind in development, and maybe is true. But he's good and ...a6 is not a waste of time!! It prevents Ndb5 and prepares ...b5, pushing queenside pawns.",
        "6. Be3 e5 7. Nb3 Be7": "7. ...Be7\n\n7. ...Be6 is more popular, but this is not an IM or GM game! This is amateur game! ",
        "8. Qd2": "8.Qd2\n\nI was looking for queenside castle, while developing the Queen in an optimum square.",
        "8... O-O 9. f3": "9.f3\n\nTo prevent Knight infiltrations.",
        "9... Bd7": "9. ...Bd7\n\nOut of book. Well, 9 moves in the book. Not so bad for an amateur match. But someone can note that, with the Sicilian, it's easier. I agree.\n\nHowever, I think that d7 is more suitable for Knights than white-squares Bishop. ",
        "10. O-O-O": "10.O-O-O\n\nAnd now my development is near to be completed. \n\nLook at the position. I have no real advantages, but the only piece I not already moved is the white-squares Bishop, which however controls an open side of the board. Moreover I control the d-file and I'm planning a kingside pawns ride. \n\nBlack position is worse: the Queen-Knight is still in b8, the e7-Bishop is blocked, the open c-file isn't useful yet...\n\nI was feeling good.",
        "10... h6": "10. ...h6\n\nMaybe is better to develop. Besides, this could led in future to a bishop sacrifice in h6 to expose the black monarch.",
        "11. g4": "11.g4\n\nPutting pressure at the King position. No real menaces, but an annoying pawn march.",
        "11... Be6": "11. ...Be6\n\nDo you remember 7. ...Be7? This move contradicts it. Now, I'm practically a move ahead.",
        "12. h4": "12.h4\n\nI gain other space. My pawns are uncomfortable for black.",
        "12... Bxb3": "12. ...Bxb3\n\nWhy? Development isn't made yet and my b3-Knight didn't threaten anything. And besides, this is the third Bishop's move in the last four moves.\n\nAgain... good for me! I was feeling still very good.",
        "13. axb3": "13.axb3\n\nObviously not 13.cxb3?! discovering the King in the c-open file.\n\nWhat about the weakness of my shield pawns? No problem, what can do black here? Nothing! On the contrary now I don't have to go to b1 with my King to protect the a2 pawn! :)",
        "13... Nh7": "13. ...Nh7\n\nI think looking at g5. In only a single move g5 is reached by the Bishop, the Queen, the h7-Knight and the h6 pawn.",
        "14. h5": "14.h5\n\nWhat else? Maybe 14.Bc4, but I didn't want to lose a pawn. Obviously not 14.Nd5 Bxh4 15.Bc4 (15.Nb6 threatens nothing) Ng5 16.Bxg5?? Bxg5 and the Queen is pinned (and also lost).",
        "14... Bg5 15. f4": "15.f4\n\nWhy not just Bxg5? I want to liberate myself from the backward f-pawn. Besides, f4 is not covered by the black Queen and, from here, is still visible the weak d6-pawn.",
        "15... Bxf4 16. Bxf4 exf4 17. Qxf4": "17.Qxf4\n\nExactly the position I was looking for. My Bishop is still at home, but is the same for the black Queen-Knight. My Queen and my d-Rook point towards d6 and the position of the black King is trembling for the my advanced pawns.",
        "17... Nc6": "17. ...Nc6\n\nFinally black develops his second Knight. But now is too late.",
        "18. Rxd6": "18.Rxd6\n\nGrab the pawn and attacking the Queen. When things go well in chess, it's easy to find prophylactic moves.",
        "18... Qa5": "18. ...Qa5\n\n19.Qa1  could be check, but nothing else. If I moved the bishop in a not g2 place and my Knight away from c3, 20.Qa1  would win the rook. So, no threat. ",
        "19. Bc4": "19.Bc4\n\nX-raying black King and developing my last still-home piece. ",
        "19... Nf6": "19. ...Nf6\n\nRunning away from the uncomfortable h7 square. But this permits my next move, a Rook sacrifice to suddenly open the King position. \n\nBetter was 19. ...Ng5 and then ...Ne6 to put the Knight on the court.",
        "20. Rxf6": "20.Rxf6\n\nCan I put an exclamation point next to a my move? :) \n\n20.Rxf6!",
        "20... gxf6 21. Qxh6": "21.Qxh6?!\n\n21.Qxf6 was better. Now black can defend the f6 pawn. 21.Qxf6 Kh7 22.Bxf7 Qxf7  regaining the exchange, three pawns and the bad position of the King. Not so bad...",
        "21... Qd8": "21. ...Qd8?\n\nNo, better was 21. ...Qg5, looking for a queening trade. Even 21. Qe5 is better. Now I can still push my g-pawn.",
        "22. g5 fxg5": "22. ...fxg5\n\nMandatory. 23.gxf6, open the g-file, and also 23.g6 were threating. ",
        "23. Rg1": "23.Rg1\n\nMy final preparation... ",
        "23... Ne5": "23. ...Ne5\n\nWhat else? This position is totally lost for black.",
        "24. Rxg5+": "24.Rxg5 \n\nAnd now black must lose the Queen or suffer checkmate.\n\nI hope you enjoy my annotations of the game. Don't hesitate to contact me for mistakes, bad advises, etc... I could have made. \n\nThanks to warvechaosone1 for the game and hope this comments can be useful even for him."
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=19732",
    "gameName": "Let's play chess",
    "players": "metalale (1423) vs. warvetchaosone1 (1461)",
    "opening": "Sicilian (B90), Najdorf, Byrne (English) attack"
}