{
    "moves": {
        "1. d4 d5 2. c4": "Queens Gambit",
        "2... dxc4": "accepted",
        "3. Nc3 a6": "Prevents knight b5 but I prefer it where it is as I have the centre covered",
        "4. e4": "This was a bit of an experiment for me, I usually prefer the admittedly more passive e3 but I didn't want to block my dsb",
        "4... b5": "defends the pawn and restricts my lsb, so I decide to fianchetto it",
        "5. Nf3 e6": "Opens a line for the dsb. the lsb has the option of b7",
        "6. g3 Bb7": "I can safely ignore this threat, I think black should have started to prepare for castling instead at this point. At the moment I have a much stronger hold over the centre thought I suspect the position is about even",
        "7. Bg2": "Now I am ready for castling",
        "7... b4": "Does this overstretch black? It's a very aggressive move and I am hoping he will pay the price later",
        "8. Ne2 Bxe4 9. O-O": "My king is now nice and safe, I can start to deal with the threat from those pawns and try to prevent black from castling",
        "9... Nf6 10. Bg5": "pins blacks lsb defender",
        "10... Be7 11. Bxf6": "This could be considered a high risk exchange for me",
        "11... Bxf6": "Still according to plan, the black dsb isn't ideally placed now. This becomes a factor later on as we will see",
        "12. Qa4+ Nc6": "Develops the knight but I can apply some pressure with my knight and should be able to regain some material. \n\nWould Bc6 be better even though it would allow me to regain a pawn?\n",
        "13. Ne5 Bxg2": "pretty much forced as otherwise there would be too much pressure on c6",
        "14. Nxc6": "I now have the threat of revealed check ",
        "14... Bxc6 15. Qxc6+ Kf8": "forced, blacks h8 rook is now going to be tough to extract",
        "16. Qxc4": "regains material and defends the d pawn",
        "16... Qd6": "Defends the b4 pawn though I feel that Be7 is a better move as the bishop would be better located",
        "17. Rac1": "Threatens both the c7 and the a6 pawns",
        "17... Rc8 18. Rfd1 c6": "This is surely a mistake as it allows me to level material ",
        "19. Qxa6 Rc7": "I think here that Ke7 would be better as it would link the rooks and allow for castling the hard way",
        "20. Rc4": "This is probably a mistake, a4 seems better as it will give me  a passed pawn",
        "20... Ke7 21. Qa4": "protects the d1 rook for now",
        "21... Rb8 22. Rdc1": "my rooks are now much more comfortable",
        "22... Rb6 23. Qa5 Rb5": "This is a mistake as we will see and is probably the point where the game turns against black",
        "24. Qxb5": "sacrifices the queen to gain material",
        "24... cxb5": "blacks pawns are now much less of a threat",
        "25. Rc4xc7+": "Forces the black king to the back row where I have to fancy may chances with 2 rooks, the f pawn can't move to make a bolt hole",
        "25... Kd8": "This is a mistake as I am not going to exchange my rooks for the black queen, the king is now pretty much trapped in, I just need to work out how to mobilise my forces as my knight is not well placed for attacking the king.\n\nThe black bishop now cannot defend the king at all.",
        "26. Ra7": "I now have the option of Ra8 which will allow Rcc8 which should let me finish the game. if the king wasn't on d8 this would not be an option as the dsb and the queen could link up",
        "26... Bxd4": "I dont really need my knight that much so am happy to exchange it will also move the queen further from the king, he can check me if he chooses but he will struggle to force mate at the moment",
        "27. Nxd4 Qxd4 28. Rcc7": "Now I can finish it I hope",
        "28... Qd1+ 29. Kg2": "forced",
        "29... Qd5+ 30. f3": "I thought at this point he may be playing for a draw",
        "30... e5": "but it seems not. Black is running out of time",
        "31. Rcxf7": "Black resigned.\n\nThanks for reading."
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=21858",
    "gameName": "Let's play chess",
    "players": "elwoos (1583) vs. pogmyhone (1523)",
    "opening": "Queen's gambit accepted (D20)"
}