{
    "moves": {
        "1. e4": "Am engaging a game with a player rated, at the time, 300 + more than myself.  Figure I will get a lesson. ",
        "1... c5 2. c4 g6 3. b3 Bg7 4. Nc3 e6 5. Nf3 Ne7": "My version of Sicilian defense, and, yes, the computers do not like this move.  However, it does support the Q pawn push.  ",
        "6. Be2 d5 7. exd5 exd5 8. d4 cxd4 9. Nxd4 Nbc6 10. Be3": "Am hoping White takes the Black c file N so my lonely P can get linked. ",
        "10... O-O 11. Qd2 Re8 12. O-O a6 13. Rac1 b6": "Here come lesson number 1, a miscalculation, and... ",
        "14. Nxc6 Nxc6 15. Nxd5": "White goes up a P. ",
        "15... Rb8 16. a3 Be6 17. Bf4 Rc8 18. Bf3": "Some loading and aiming at the middle. ",
        "18... Ne5 19. Qe3": "I'm thinking that I am going to get a big tempo by pulling a discovered R attack on the White Queen. but.... ",
        "19... Bxd5 20. Bxd5 Nxc4 21. Qf3 Ne5 22. Bxe5": "Lesson 2 -White gets the big tempo with the discovered attack on the KBP - yields white a piece, tempo, with the threat of a major - minor exchange. ",
        "22... Qe7 23. Bxg7 Kxg7": "Black is down a piece, I have figured I have learned my lesson (s). And now White is going to end this academically.  However.... ",
        "24. Bb7": "The game must be played.   And, to my surprise, his King has no \"air\"!   Black threatens a smothered mate on the back rank.",
        "24... Rxc1": "Am glad to oblige and make a knee jerk move, with the threat of mate. ",
        "25. g3 Rxf1+": "Cashing in the Rook. Now the game looks like an academic game for White.  But not necessarily in my hands. ",
        "26. Kxf1 Qe1+ 27. Kg2 a5": "Harboring the Pawns. ",
        "28. Bd5 Qe7 29. a4 f5 30. Qc3+ Qe5": "Get the Q's off the board, less complex. ",
        "31. Qxe5+ Rxe5 32. Bc4": "Now comes my uneducated venture to find a solution. ",
        "32... h6 33. h4 h5 34. f4 Re8 35. Kf2 Re7": "A move showing I don't know where to go. ",
        "36. Bd5 Kf8 37. Bc4 Ke8 38. Bb5+ Kd8 39. Bc4 Kd7 40. Be2 Kc6 41. Bb5+ Kc5": "Maybe the solution is getting the tail end of the \"east side\" Pawns. ",
        "42. Bc4 Kd4": "Foiled. ",
        "43. Bb5 Rc7 44. Be8": "White is looking at the rear of my \"west side\" Pawns, and it strikes fear in Black. ",
        "44... Rg7 45. Bb5 Kc3 46. Bc4 Re7 47. Bg8 Rc7 48. Be6 Kb4 49. Bg8": "Lesson No.  3 - White offered a draw on this move, his second draw offer of the game.  Am up a major-minor and am thinking I can win.  I declined, I want to watch this game also!",
        "49... Rc2+": "After some nothing moves, maybe the solution is taking the rear Pawn with the Rook. ",
        "50. Kf3 Rc6": "Nope, talking the rear White Pawn leads to the collapse of the Black's west side.",
        "51. Bd5 Rd6 52. Bc4 Rd7 53. Ke2 Kc5 54. Ke1 Rc7": "Maybe the solution is using the Rook over here, supporting an east side collapse of White Pawns and giving protection to Black's west side Pawns.  ",
        "55. Kf2 Rb7": "I think it is!",
        "56. Kf1 b5": "It is!  White King will not be able to get all the way around before Black queens an east side pawn. ",
        "57. axb5 Rxb5": "White resigned.  "
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=53636",
    "gameName": "Let's play chess",
    "players": "ilicgoran (1700) vs. quanah4 (1465)",
    "opening": "Sicilian (B20), Gloria variation"
}