{
    "moves": {
        "1. e4": "A seemingly logical pawn push by my opponent gave me a decisive advantage.  I have the black pieces.",
        "1... e5 2. a3": "With this unusual move, I had to wonder what I was up against.",
        "2... Nf6 3. d3 Bc5 4. h3": "The pawn pushes on both edges look like blitz moves; black is allowed a major lead in development.",
        "4... Nc6 5. c3 a6": "Prepares an escape square for the DSB, when the d4 thrust comes.",
        "6. Nf3 d6": "DSB is established and safe outside the pawn chain.  White can, and does, push the d pawn and constrict black's position, but I think I will still be OK after this.",
        "7. d4": "The promised push.  Looks good for white.",
        "7... Ba7 8. d5 Ne7": "The resultant constricted position.  However, I think I can transfer the N to g6 and have a setup I've sometimes seen my favorite speed player in Harvard Square, Raoul, play countless times, with two adjacent knights.",
        "9. Nbd2": "Protects the e4 pawn, but constricts his DSB, which flaw is about to lose him the game.  Were Bd4 or a queen move better?  White, however, seems to be moving toward a swift Kingside attack, and this N move fits that general idea I guess.",
        "9... O-O": "Unsure whether it was safe, I decide to castle into what might become a storm.  I believe White has good attacking possibilities, but...",
        "10. g4": "...this isn't one of them.  I can get three pawns for my undeveloped LSB, and disrupt the White King's safety as part of the bargain.  I think this may be considered the losing move.",
        "10... Bxg4": "The fortuitous exchange sequence begins",
        "11. hxg4": "Capturing is probably not the best move available to White, given what follows.",
        "11... Nxg4": "And there it is!  The f2 pawn is attacked twice, and can only be protected with the queen and King.  At this point, perhaps Rh2, accepting the trade of R for N, was white's best option.  Alternatively, he can move the queen to avoid the threatened Q-R fork.",
        "12. Qe2": "But this isn't the right square.  If 10. g4 isn't immediately losing, this is.  The queen now must be given up to avoid mate.",
        "12... Bxf2+": "Forcing a nasty choice.",
        "13. Kd1": "Wrong choice, it turns out:",
        "13... Ne3+": "The K cannot move.  The Queen is forced to capture.  If instead 13. Qxf2, at least white would have both the N and B as collateral for the lost Q; this way, the B stays on the board.  Either way, White is lost.",
        "14. Qxe3 Bxe3 15. Nc4": "Ahead 6 points, I trade whenever possible.",
        "15... Bxc1 16. Rxc1 Ng6": "Now I have plenty of time and material, but am far behind in development.  It is still a chess game, and I must still win the won game.",
        "17. Rc2 Qd7": "I suppose I wanted to push the c pawn and open the board, but this move seems less than aggressive.",
        "18. Rch2": "Seems simple enough to parry with...",
        "18... h6": "...this, but later this setup will be a liability for me.",
        "19. Ne3": "Eyeing a nice post on f5, but I have a sequence to stop that.",
        "19... Qa4+": "Forks K and P.",
        "20. Nc2 Qxe4 21. Nd2 Qxd5": "I am now +8, and begin playing rather sloppily as a result.",
        "22. Bg2 Qb5": "Solves the skewer, but perhaps allowing the b7 pawn to fall was a quicker way to open up lines to the white king.",
        "23. b4 a5": "Poor choice on my part, as the following moves prove.",
        "24. c4 Qd7 25. b5 c6 26. bxc6 bxc6": "OK, but Q is pinned to covering the c pawn for the time being.",
        "27. Ne4": "Now the Q is forced to protect two weak pawns.  I am taking forever to translate my material advantage into an attack.  In the meantime, I am missing a tactical combination that White is threatening.",
        "27... Rab8": "Threatening Rb1 and forcing one set of rooks off the board.",
        "28. Kd2": "Avoiding the forced trade.",
        "28... Rb2": "?? Pinning the N, planning to double the rooks on the b file.  Seemed good at the time, but here comes the start of the aforementioned combination:",
        "29. Rh2xh6": "! gxh6?? allows 30. Nf6! and a Royal fork.  Luckily I wake up in time to avoid the trap.",
        "29... Qf5": "Several options work to avoid the fork; this one threatens Qf4+ and the start of an attack.  In the meantime, the R on h6 is now under threat.",
        "30. Kc3": "? White offers to trade rooks, not in his best interest.  Meanwhile, the K has walked into a tight spot.",
        "30... Rfb8": "Refusing the trade, maintaining tension.",
        "31. Ne3": "?? Oops.  Threatens the Q and advances on the Black King, but allows mate in 1.",
        "31... Rb8b3#": "Cheers, thanks for a good game!"
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=43823",
    "gameName": "Let's play chess",
    "players": "frankili (1303) vs. benrous1 (1399)",
    "opening": "KP (C20), Mengarini's opening"
}