{
    "moves": {
        "1. e4 c6 2. Nf3 d5": "I've played often the Caro-Kann.",
        "3. exd5 cxd5 4. d4 Bf5": "a6 could be better before this move.",
        "5. Bb5+ Nc6 6. Ne5 Bd7": "White attacks and have time for developing, as black cannot breath.",
        "7. Nxd7": "White makes it easier for black. The change of attacking figures is worse, then developing.",
        "7... Qxd7 8. Nc3 e6": "Without the white bishop I try to defence the white squares, make place for the kingside developing.",
        "9. O-O a6 10. Bd3 Nxd4 11. Bxh7": "I was oversee this, but not so bad, because I wasnot castled yet, so white gives me a half-opened file against its king. So good as bad.",
        "11... Rxh7 12. Qxd4 Bd6": "I try to make a pressure on h2.",
        "13. h3 Ne7 14. Qd3 Ng6 15. Ne2 O-O-O": "White takes his knight away from the queenside, so I castled there and doubling the rooks on the h-file. My pieces will be active, whites' bishop and rook stands on the original places.",
        "16. Nf4": "Good Idea! After the exchanges my rook is lost on h7.",
        "16... Bxf4 17. Bxf4 Rdh8": "Forcing the attack and the bishop on f4 hanging now.",
        "18. Bg3": "Could be better on h2, so the queen is isolated from the h3 pawn.",
        "18... e5": "It is a mistake.",
        "19. Rad1 d4 20. c3 Nf4 21. Bxf4 exf4 22. cxd4 Rh7xh3": "After gxh3, black can maybe make an ever-check, but it isnot sure. After the e5 push I tried attack without mind and waited for a blunder from white because of the pressure.",
        "23. f3": "White made it.",
        "23... Rh3h5 24. Rdc1+ Kb8 25. Rfe1 Rg5 26. Kf2 Rh2": "Ant the game is over.",
        "27. Reg1 Qh3 28. Ke1": "After ...Qf1 Gg3  would push away the king and after the exchanges on h2 falls down the b2 pawn - otherwise the rook is lost on c1.",
        "28... Rhxg2 29. Rxg2 Rxg2 30. Qf1 Qg3+ 31. Kd1 Rg1 32. Qxg1 Qxg1+": ""
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=6835",
    "gameName": "Let's play chess",
    "players": "fan_uschi (1642) vs. gazdvez (1564)",
    "opening": "Caro-Kann defence (B10)"
}