{
    "moves": {
        "1. e4 c5": "Playing against a very strong player, I decided to use the Sicilian defense  in which I lost a few games but this game went well for me. My opponent suddenly lost many games on time  and I too benefited. However I learnt how to play against the English attack.",
        "2. Nf3 d6 3. d4 cxd4 4. Nxd4 Nf6 5. Nc3 a6": "Book moves of the Sicilian Najdorf until now. The game can branch off into many variations from here.",
        "6. Be3": "The English attack which has become popular. In the old days this move was considered premature as World champion Euwe suggested that 6. f3 should precede Be3 otherwise Black can attack the bishop on e3 with Ng4. Gary Kasparov, Vishy Anand played this variation which I used in this game.",
        "6... Ng4": "At first sight this knight move looks like a novice attack but it is not so simple.",
        "7. Bg5 h6 8. Bh4 g5 9. Bg3 Bg7": "Black's position looks compromised on the king side with advanced pawns but this variation has stood the test of Grandmaster play. Kasparov says he analyzed it and included in his repertoire. This aggressive play by Black have taken the game into new territory away from well analyzed lines. White's bishop on g3 will remain passive for quite a while and stands in the way of the natural pawn storm on the king side.",
        "10. h3": "White questions the Black knight.",
        "10... Ne5 11. Nf5": "White places his knight on f5 and attacks the black biship on g7.",
        "11... Bxf5 12. exf5": "Now White has the bishop pair and Black has to play carefully.",
        "12... Nbc6 13. Nd5 e6 14. fxe6 fxe6 15. Ne3": "A strange position. White's pieces are not on their usual squares and Black's king is in the center. ",
        "15... O-O 16. Be2 d5 17. O-O Ng6": "Black is trying to advance his central pawns so early in the middle game. White has castled on the king side so there is no prospect of a pawn storm on Black's castle.",
        "18. c3": "White tries to neutralize the Black bishop on the long diagonal.",
        "18... Nf4": "Black places his knight on a strong square and wants to eliminate White's bishop pair.",
        "19. Bg4 Qf6 20. Bxf4 gxf4": "White's bishop pair is eliminated. Black's queen cannot capture on f4 as it has to protect the pawn on e6.",
        "21. Nc2 Rad8": "Black's audacious opening play has resulted in a very active position for his pieces.",
        "22. Nd4 Rfe8 23. Nb3 Kh8 24. Nc5 Re7": "Black has placed all his major pieces on black squares so that they cannot be attacked by White's bishop.",
        "25. Qb3 Ne5 26. Rae1 Rc8 27. Qb4 Nxg4": "Black now has a bishop vs knight game with center control. White's attack has not started.",
        "28. Nd3 Rc4": "This move was played to protect the Black pawn on f4.",
        "29. Qd6 f3": "Black's attack has reached the White's castle!!!",
        "30. g3 Qg5 31. hxg4 Rxg4": "White is a pawn minus and a very aggressive attack to contend with.",
        "32. Re3 Rd7": "A terrific Rook sac if accepted leads to mate in three moves. 33. Qxe7 Rxg3+ 34. fxg3 Qxg3+ 35. Kh1 Qg2 mate. My opponent is a very strong player so he does not allow it.",
        "33. Qb8+ Rd8 34. Qc7 e5 35. Rxf3 Rg8": "Black's heavy artillery is getting into dangerous positions.",
        "36. Ne1 e4": "The central pawn advance is another headache for White.",
        "37. Rf7 e3 38. Kg2 Qg6 39. Rf3 Qe4 40. Rh1 exf2": "Black attacks relentlessly.",
        "41. Kxf2 Re8 42. Kg2 Rf8": "Black attacks the pinned rook.",
        "43. Kf2 Rg6 44. Rh4 Rxf3+ 45. Nxf3 Qc2+ 46. Kf1 Kh7 47. Qe7": "White's queen is trying to come back to the defense.",
        "47... Qb1+ 48. Qe1 Qxb2 49. Rb4 Qxc3": "Black exchanges queens and hopes to win the end game.",
        "50. Qxc3 Bxc3 51. Rxb7+ Rg7 52. Rb3 d4 53. Kf2 Rd7": "White defended very well from here.",
        "54. g4 Kg7 55. Kg3 a5 56. a4 Rc7 57. Kf4 Rc4 58. Rb7+ Kf8 59. Ke4 Rxa4": "The pawn drops off and here my opponent lost on time as he probably did not feel like resigning. It was a satisfying effort by Black against a very strong opponent. Bishop vs knight ending with 3 pawns against one."
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=38093",
    "gameName": "Let's play chess",
    "players": "harpov (2300) vs. dongoodman (2211)",
    "opening": "Sicilian (B90), Najdorf, Byrne (English) attack"
}