{
    "moves": {
        "1. c4": "It's an interesting game I played some time ago actually. Once players start to realize that the queen is worth a limited amount of wood(minor pieces/rooks) their evaluation of that piece drop significantly. However, the queen can still dominate the pieces in many occasions. It happens when the greater number of pieces cannot coordinate. ",
        "1... e5 2. e3 d5 3. a3": "I've actually seen this player use this setup in his other games. One big problem many players have is that they play the same opening setup against all openings, even if it is not optimal. I remember that I used to always do the King's Indian Setup, without thinking about the opponent. It's a horrible mistake many players make.",
        "3... d4": "Of course, to prevent the white knight from developing. ",
        "4. Qc2": "Bringing the queen out so early is usually not the best idea. Here it is definitely not best. White easily could have played Nf3, which is definitely going to be played at some point.",
        "4... Nf6 5. b4": "White is making already 4 pawn moves out of his 5, and is playing this opening kind of like a sicilian Kan variation. The unfortunate thiing is that black has the extra space in the center, and has contact between the pawns, so the pawn structure is dynamic and black can open it at the right moment. Since white has broken the principles of the opening, black can also do it if he wants.",
        "5... a5": "Creating of a weakness. ",
        "6. b5 Bc5": "Now the c5 square is no longer controlled, so the bishop goes there easily.",
        "7. Bb2 O-O 8. e4": "White wants to quickly close up the position, where his lack of development will not be so bad. Black should open things up on the queenside, because the center is impossible to open. I should say that even if the position would be completely closed up, black would still be much better, since the white's pieces are all misplaced.",
        "8... c6 9. d3 cxb5 10. cxb5 Qb6": "Now black just has a clear advantage, since he has accomplished the goals he wanted to. ",
        "11. a4": "Now there are more weaknesses in the white's position, since he is advancing all his pawns up the board.",
        "11... Be6 12. Nd2 Nbd7 13. Ngf3 Rfc8 14. Rc1 Bb4": "(!)If you check out most of my annotations, I almost NEVER give exclamations to moves even if they are very good. However, I was very proud to discover this move, and the idea behind it. It simply looks like a blunder at first sight, since white can gain material, getting of the 2 rooks for queen. However,black has a strong idea in mind. Definitely an exclamation.",
        "15. Qxc8+ Rxc8 16. Rxc8+ Nf8": "Now white must go back, and with the white queen gone, there is no piece left to defend the hanging light squared weaknesses on b5 and a4. Now we notice that black can attack them immediately, the c2 queen having disappeared. A great way to realize our plan. ",
        "17. Rc1 Qd6": "Of course, white has a light squared bishop, which is good for defending the weaknesses, but it is on the other side of the board. White cannot avoid losing his weaknesses, since he has no piece that can guard them.",
        "18. Be2 Bxd2+ 19. Nxd2 Qb4": "White will both of his queenside pawns, and then black will have connected passed pawns,  and they will win the game. At this point, I was pretty sure the win was \"in my pocket\", and I started to play  moves very quickly, without even thinking almost.",
        "20. Ba1 Qxa4 21. O-O Qxb5": "Black has realized the plan, and now there is another one, to advance the pawns to the 8th rank and get a queen. Although all of white's pieces are \"developed\" we see that his bishop pair is totally useless. ",
        "22. Rcb1 Qa6 23. Bb2 b5": "Black is simply realizing the plan.",
        "24. Bd1 Nf6d7": "Now black is getting more forces to the queenside, where they will support the pawns.",
        "25. Bc2 Nc5 26. Rfd1 Ng6 27. g3": "Of course, the knight could not be allowed on the f4 square. ",
        "27... Ne7 28. Ba3 b4 29. Bb2 b3": "This move now, is really a blunder. I had playing my previous moves in only a few seconds, and after playing this one, a quick calculation made me realize that I had just blundered one of my passed pawns. Now I had to slow down and start being more careful. A real wake up! Instead, black wins more material by force after 29...a4, when both of the white's bishops are suffocating.",
        "30. Nxb3 Bxb3 31. Bxb3 Nxd3": "Now I need to get complicated in order to regain my advantage. ",
        "32. Ba3": "White's bishop pair is gaining now in strength.",
        "32... Nc6 33. Bd5 Ncb4 34. Bxb4 Nxb4": "Now black is winning again, but a good plan is needed. Black should support both passed pawns and advanced both of them.",
        "35. Rdc1 g6 36. Rc5 Qe2": "Another good move. This one allows the queen to support the d pawn all the way to d1.",
        "37. Rxa5 d3": "Now white has jsut made the blunder, and stopping this pawn will cost him far too much.",
        "38. Bc4 Qxe4 39. Rxb4": "The final mistake of the game, but white was already losing.",
        "39... Qe1+ 40. Kg2 Qxb4 41. Ra8+ Kg7 42. Bd5 d2 43. Ra1": "Queens and passed pawns are working together very well.",
        "43... Qd4 44. Rd1 Qxd5+ 45. Kf1 Qd3+ 46. Kg2 Qe2": "Now white simply gave up. In conclusion, the evaluation of the game shifted in my favor in the early stage, then came back a bit to white, but I managed to grab the wheel again and was back to a winning advantage. In the opening, we should mainly use our general principles instead of mindlessly playing the easy setups. "
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=46047",
    "gameName": "Let's play chess",
    "players": "sirlauncelot (1685) vs. tiger_lilov (1884)",
    "opening": "English opening (A20)"
}