{
    "moves": {
        "1. e4 c5": "He plays the Sicilian. I haven't studied it 20 moves deep like some grandmasters, but I know the basics. ",
        "2. Nf3": "I choose the open Sicilian. ",
        "2... d6 3. d4 cxd4 4. Nxd4 Nc6 5. Nc3": "All standard so far.",
        "5... e5": "This hasn't been played very many times, but it can't be bad as over five hundred people have played it in the database.",
        "6. Nb3 Be6": "We are still in the database, but coming close to the end.",
        "7. Bb5 a6 8. Bxc6+": "We are now out of the database. I think capturing the knight is a bit of a mistake, as it brings his pawn closer to the center. The only positive note is that his a pawn is isolated. ",
        "8... bxc6 9. O-O": "I tuck my king into safety. He's still at least three moves away from doing so unless he chooses to castle queenside, which would not be wise as there are many holes in his pawn cover.",
        "9... Be7 10. Be3 h6": "!? This doesn't seem to do anything except maybe start a pawn storm if he chooses to castle queenside after all. ",
        "11. Qd2": "Considering something like Bxh6!? after he castles. If I bring enough pieces to follow it up first, the sacrifice might be worth it.",
        "11... Nf6 12. Rad1 O-O": "He castles, maybe I should start looking to start shifting my knights over to the kingside.",
        "13. a4": "Seems to be a wasted move.",
        "13... c5 14. Nd5": "I stick my knight in a nice outpost. If he wants to get rid of it, then my pawn will cramp him.",
        "14... Bxd5 15. exd5 a5 16. c4": "I back up the center.",
        "16... Rb8 17. Qc3": "Defending my knight",
        "17... Ne4": "Maybe he was hoping I'd move my queen to undefend my knight.",
        "18. Qd3": "Instead, I simply chase his knight away.",
        "18... Nf6 19. f4": "I decided on this because if he captures, no only will it weaken his center, it will bring my rook out.",
        "19... e4": "This was probably the best decision. ",
        "20. Qc3 Qb6 21. Nd2": "I should have played Rd1-d3. this loses a pawn.",
        "21... Qxb2 22. Qxb2 Rxb2 23. Rf2": "Looking at the possibility of a discovered attack.",
        "23... Rfb8 24. Rff1 Ng4": "This aims to remove a defender of the knight.",
        "25. Rfe1 Nxe3 26. Rxe3 Ra2": "Let's review this position. Material, black is ahead by a pawn. Pawn structure, my d pawn is cramping him slightly, but he has a passed pawn on e4, but it is immemorial since I can capture it at any time. We both control the center equally and his pieces seem slightly more active. Overall, I'd prefer black here.",
        "27. Rxe4 Rbb2 28. Rxe7 Rbxd2 29. Rxd2 Rxd2": "After a few exchanges, material has equalized again and so has position. We both have a rook on the seventh rank (second for him) Our pawn structure very similar and no one seems to have the advantage. ",
        "30. Rd7": "I start to pick off his pawns",
        "30... Rc2": "So does he",
        "31. Rxd6 Rxc4 32. Rc6 Rxa4 33. Rxc5": "Both rooks gobble up pawns giving us both an isolated passer.",
        "33... Ra1+": "I'm not sure this is great, it just pushes my king to the center. In most cases, in rook endings checks are worthless. Most of the time.",
        "34. Kf2 Ra2+": "This is the same. He's just moving my king closer and closer",
        "35. Ke3 Kh7": "He decides to move his king in",
        "36. d6 Ra3+": "Remember what I said about useless rook checks?",
        "37. Kd4 Ra4+ 38. Kd5": "Now let's review this position. Material: equal passed pawns: we each have one, but mine is much more valuable since it is a lot closer to queening. Pawn structure: Neither of us have any doubled pawns, we both have an isolated pawn, other than that it is almost identical. King position: My king is much more centralized. Piece activity: my rook is slightly more active. ",
        "38... Kg6": "?? Now he can't stop me from queening.",
        "39. d7 Rxf4": "He takes what he can",
        "40. d8=Q": "Poof! ",
        "40... Rf5+ 41. Kc6 Rf6+": "Maybe he's going for perpetual check?",
        "42. Kb5 Kh7 43. Qxf6": "This is a simplification sacrifice. I probably wouldn't have played it if his king hadn't moved, but this way it splits up his pawn structure too. It's only a matter of time before I pick off most of his pawns, If I have to sac my rook to do it, I'll promote a pawn.",
        "43... gxf6 44. Kxa5 Kg6 45. h4 f5 46. Rc4": "If his pawn advances any further it dies. If the king moves anywhere except f6 the pawn dies. ",
        "46... h5 47. g3": "Now I can move my rook without fear of his pawn advancing.",
        "47... f6 48. Rf4": "Black is in zugzwang. ",
        "48... Kh6 49. Rxf5 Kg6 50. Rf4 f5": "Time to bring my king over.",
        "51. Kb5 Kf6 52. Kc5 Ke6 53. Kd4 Kf6 54. Kd5": "His king must move back, and after that my king will move forward and with his help the rook will capture the remaining black pawns.",
        "54... Kg6 55. Ke5": "Black resigns. Good game to black. I don't think I played too badly, especially the endgame. However if you have a different opinion please comment. I'd appreciate it if you'd rate my annotation. "
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=50649",
    "gameName": "Let's play chess",
    "players": "porcho (1154) vs. ajb1955 (1100)",
    "opening": "Sicilian (B54)"
}