{
    "moves": {
        "1. e4 e5 2. f4 Qh4+ 3. g3 Qf6 4. f5 d6 5. Nf3 Nc6 6. d3 Qd8 7. c3 Nf6 8. Ng5 Be7 9. Be3 h6 10. Nf3 Bd7 11. h3 d5 12. g4 dxe4 13. dxe4 Nxe4": "I begin a full frontal attack. This was white's first mistake. The key square in a few turns is g3.",
        "14. Bc4 Bh4+": "Checking the king",
        "15. Ke2": "Now the key square becomes g3. White's rook is mine.",
        "15... Ng3+ 16. Kd2 Nxh1": "Taking the rook",
        "17. Qxh1": "The end result of that little bout.",
        "17... Bg5 18. Qh2 Bxf5+ 19. Ke2 Bxe3": "Exchange of bishops",
        "20. Kxe3 Bg6": "Moving my bishop to a safe square",
        "21. Nxe5": "White gains the smallest of advantages here; the queen is put in a good position, but it doesn't last long.",
        "21... Nxe5 22. Qxe5+": "Exchange of knights complete",
        "22... Kf8 23. Qc5+ Qe7+ 24. Qxe7+ Kxe7": "Exchange of queens",
        "25. Nd2": "White seems to intend to bring the other knight out into play.",
        "25... Rhe8 26. Rf1": "White also intends to get the rook into play; perhaps he intends to do Rxf7+ on the next turn, but my bishop guards that pawn, so it would result in a loss of material for him. ",
        "26... Kd6+ 27. Kf2": "White moves out of check. I think in this case, it would have been better to do Kd4 so as not to trap the rook.",
        "27... Rad8": "Moving my other rook into play",
        "28. Rd1 h5 29. Nf3+": "White obviously is trying to regain control of the board.",
        "29... Kc5": "Trying to threaten the bishop. ",
        "30. Bd3": "White makes another mistake. Instead of this move, he should have done Be2. Apparently, he forgot about my bishop.",
        "30... Bxd3": "Exchanging the bishops",
        "31. b4+": "Rather than taking the bait and losing his rook, White instead tries to force my hand.",
        "31... Kc4 32. Nd2+ Kxc3": "Taking the unprotected pawn",
        "33. a3 Re2+": "Checking the king",
        "34. Kg3 Rxd2": "I take the knight because my rook is protected by the king.",
        "35. Rc1+": "White doesn't want to exchange rooks",
        "35... Rc2": "I interpose, trying to get rid of White's rook",
        "36. Re1 Rd4 37. gxh5": "White takes my unprotected pawn",
        "37... Re4": "Trying to get White to exchange rooks",
        "38. Rg1": "Apparently White doesn't want to.",
        "38... Re3+": "Checking the king",
        "39. Kg4 f5+": "Continuing to check the king. ",
        "40. Kg5 Rxh3": "Taking the pawn",
        "41. Re1": "Not sure why White did this.",
        "41... Rg2+": "Checking the king",
        "42. Kf4 g5+": "Checking the king again",
        "43. Ke5 Re2+": "Now White basically has no choice but to exchange.",
        "44. Rxe2 Bxe2": "Exchange complete.",
        "45. Kxf5": "White takes my pawn",
        "45... Rxh5": "I take White's pawn, effectively protecting mine, as well.",
        "46. Kg6 Kb3": "This effectively kills both of White's remaining pawns. No matter which one he moves, the other one dies, and the remaining one would only meet death upon encountering my rank of Black pawns on row 7.",
        "47. b5": "Taking a chance to be able to promote it (futile)",
        "47... Bd3+": "Both pawns are effectively dead. White does get my Rook, but defeat is unavoidable.",
        "48. Kxh5 Bxb5": "Taking the pawn",
        "49. Kxg5 Kxa3": " At this point, it was also inevitable that one or more of my pawns would be promoted, because the king couldn't get close enough to capture one before it became a Queen.",
        "50. Kf5 c5": "Intending to promote my pawns. White resigns. "
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=57207",
    "gameName": "Let's play chess",
    "players": "nativelove1933 (1102) vs. otakumadness (1282)",
    "opening": "KGD (C30), Keene's defence"
}