{
    "moves": {
        "1. e4": "1.e4 \"Best by Test. Bobby Fischer\"",
        "1... e5 2. Nf3 d6": "Ah Philidore. Creates an early strong point at e5. This is not exceptable to me. I wish to open the game and complicate with tactics! White will counter attack this without delay!",
        "3. d4": "Bam! Paul morphy played against this, one of my favorite games. black played Bg4 here, but the pin doesn't help black. 3...Bg4 4. de Bxf3 5. Qxf3 de 6. Bc4! Nf6 7. Qb3! hitting the f7 pawn and b7 pawn. Morphy plays a knight sac and wins the game!!",
        "3... d5": "this seems dubius. and a wasted tempo to move it twice.",
        "4. Nc3": "Now my development is two ahead.",
        "4... Nc6 5. Nxd5 Bg4": "those pesky pins!!",
        "6. h3": "? Bla!!!! a blunder! perhaps Be2. you are giving me real problems here.",
        "6... Bxf3 7. gxf3": "this exposes my queen. but what else? if Qxf3 then Nxd4 with tempo.",
        "7... exd4 8. Bc4": "eyeing f7. I could play Bb5 here also pinning and take back the pawn, but I am always looking for better.",
        "8... Nge7 9. Bf4": "the threat is Nxc7. Nxd5 is forced.",
        "9... Nxd5 10. Bxd5 Bd6 11. Bxd6 Qxd6 12. Qd2": "prepare queenside castel and watch f4 and d4. f4 is an ugly hole.",
        "12... Qc5": "protecting the pawn.",
        "13. O-O-O Rd8": "indirectly hitting d4 and the queen on d2.",
        "14. Rhg1": "Rook to the half open gfile.",
        "14... Na5": "?! I thought Nb4 was strong here. hitting a2 and forcing a pawn move. perhaps he is hoping for Qxd4 c7! and the bishop is lost due to the pin. or else feared Bxb7. yes Nb4 would hit the bishop on d5 winning a pawn as well as causing my king protection to move. I would not have time to take b7.",
        "15. b4": "forking queen and knight. ",
        "15... Qc3": "the trick! if bxa5?? then Qa1 is mate. but no worries, White must capture the queen. ",
        "16. Qxc3 dxc3 17. bxa5": "now I am up material. I will plan to just exchange to a won endgame.",
        "17... c6 18. Bc4 b5": "I counted on this. Best was Rxd1 to hold on.",
        "19. Rxd8+": "check is always a tempo winner.",
        "19... Kxd8": "and I deflect the king from f7.",
        "20. Bxf7 g6 21. Bb3 Rf8 22. Rd1+ Kc7": "another free move.",
        "23. Rd3 b4 24. e5": "the passed pawn wants to promote! the king can threaten, but I am just looking to trade anyway. If material was equal, I would wait until the pieces are traded and then escort the pawn with the king, or use its threat to create an advantage elsewhere.",
        "24... Rf4": "I think Re1 and then Re2 would hold on the longest.",
        "25. e6 Re4": "?? yes the rook is well placed behind a passed pawn, but it hangs here. if 24.Rd4 then just Re6 protecting from the rear.",
        "26. fxe4": "the last one to make a mistake loses!",
        "26... Kb7 27. e7 Ka6 28. e8=Q Kxa5 29. Qd8+ Kb5 30. Qb8+ Ka6 31. Bc4+ Ka5 32. Rxc3 bxc3 33. Qc7+ Kb4 34. Bb3 a5 35. Qxc6 g5 36. Qc4+ Ka3 37. Qa4#": "the opening was not bad. just watch for those tactics of forks and pins."
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=2120",
    "gameName": "Let's play chess",
    "players": "jeffegg2 (1429) vs. paul888 (1206)",
    "opening": "Philidor's defence (C41)"
}