{
    "moves": {
        "1. d4": "I am just showing some of the first few games I played here. Note the opening I totally screw up because I was on autopilot nimzo-indian/bogo-indian mode, as 2. Nc3?! is a questionable move allowing 2. d5! transposing back into a QP opening where white cannot play the Queen's Gambit, basically giving Black at least equality. \r\n\r\n",
        "1... Nf6 2. Nc3": "?! 2. c4 or 2. nf3 is normal",
        "2... e6": "?! :(",
        "3. e4 c5": "Benoni-like, no c-pawn on c4 though. Oddly enough, white plays 4. Nf3 and Black responds 4. cxd4 leading to a sicilian! \r\n\r\nAnother interesting idea is 3. d5 leading to a french. c5 invites white to overextend himself, similar to the Nim. variation of the sicilian. \r\n\r\n",
        "4. e5 cxd4 5. Qxd4": "The resulting trades of exf6 benefit black",
        "5... Nc6 6. Qa4": "? Drops material. Qf4 is better, and not Qe3 Ng4!\r\n\r\n6. Qf4 forces black to move the Knight on f6 back to the lonely g8 square. The best continuation, which gives white a nice spacial advantage and a temporary lead in development, while Black has the plan of attacking the e5 pawn and harassing the white Queen. ",
        "6... Nxe5": "Black is now just winning a pawn. ",
        "7. Bf4 Nc6 8. O-O-O a6": "?! Does not do anything to help protect the b5 square do to the pin on the pawn. But it does create tactics that white has to be careful of. Mainly the unpinning of the pawn and the idea of b5. ",
        "9. Nb5": "?! White has a nice cramp on the black position. A move like 9. Nf3 which stops 9. e5 blocking the bishop leaves black with problems. ",
        "9... e5 10. Bg5 d6 11. Bxf6": "White thinks hurting the Black kingside is worth losing the two bishops and tempi.",
        "11... gxf6": "Not Qxf6 Nc7+",
        "12. Nc3 Be6 13. Nf3 Bh6+": "The two bishops are already showing their control of the White Queenside. ",
        "14. Kb1 O-O": "Despite the doubled pawns in the f-file. Black's king is very safe as White cannot quickly create an attack do to his poor development. In fact, the doubled f-pawns give Black a nice spatial advantage in the center. ",
        "15. Bd3 f5": "Threatens e4 while grabbing control of the center. ",
        "16. Bc4": "? Loses a piece. White is already in a troubled position, but this does not help. ",
        "16... b5 17. Bxb5 axb5 18. Qxb5 Qa5": "Offers a Queen exchange. Black is safely up a piece. ",
        "19. Nd2": "? Safer is Qxa5 when White is doing very poorly, but this is very dangerous. ",
        "19... Qxb5 20. Nxb5 Bxa2+": "The attack continues with the Queens off the board. ",
        "21. Ka1 Be6+": "Safely returning the bishop. Black will slowly build up on the a file with 2 rooks and the knight. ",
        "22. Na3": "?! This allows a flury of tactis on a not-so-safe king. Kb1 Rfb8 is good for black though. ",
        "22... Nd4": "22. Nd4! Threatens c2 ",
        "23. Kb1": "Defending c2 and allowing the white knight to move again. ",
        "23... Rfb8": "Just pretty. All of Black's pieces are contributing in the fight. This move threatens Rxa3 do to the pin on the pawn. ",
        "24. Nb3": "Black finds a combination to exchange material. ",
        "24... Nxb3": "Here cxb3 Rxb3 leaves white with a cramped game and renews the threat of Rxa3 so white tries a different idea, although  it is worse. ",
        "25. Rd3": "? Black can just continue Nc5 and has a safe game",
        "25... Rxa3": "! the finishing move . 26. bxa3 26. Nd4! 27. Ka1 27. Nxc2# so white is forced to play 27. Rb3 27. Nxb3 28. cxb3 28. Rxb3 when black is up two bishops and still has a dangerous attack on the exposed white king. ",
        "26. cxb3": "This does not allow fireworks to happen, but Black just ends up safely exchanging off into a winning position. ",
        "26... Raxb3 27. Rxd6": "? The last error. ",
        "27... Rb3xb2+ 28. Ka1 Ra2#": "Ok. Both players played pretty badly. I was not playing well at all in that game, and white let me get away with my dubious opening. \r\n\r\nWhy annotate it? Just the beauty of all of the black pieces working together, specifically the two bishops. And the finisher Rxa3 which forced either mate , material gain, or a simple mass exchange when ahead. \r\n\r\nLastly, I will try to get some better games up(both my playing and my opponents). I'll be going to a tournament soon and I'll upload an otb game. \r\n"
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=25016",
    "gameName": "Let's play chess",
    "players": "publisher (1357) vs. grntnick (1200)",
    "opening": "Queen's pawn game (A45)"
}