{
    "moves": {
        "1. e4 e5 2. Nf3 d6 3. Nc3 Nf6 4. d4 c6 5. dxe5 dxe5 6. Qxd8+ Kxd8": "With the early exchange of Quuens, the game already looks like it'll go the endgame. I lost a pawn in the mix-up, though.",
        "7. Nxe5 Be6 8. Bg5 Be7 9. O-O-O+ Kc7 10. Bxf6 Bxf6": "White, up a pawn, should look to avoid complications and tactical melees. The best move would be to retreat his Knight to f3. After that, developing the Bishop and moving the KR to e1 would ensure a solid game.",
        "11. Bc4": "Oopsie. My opponent just left his Knight on e5 en prise. Now in the tactical complications, he'll end up a piece down.",
        "11... Bxe5 12. Bxe6 Bxc3 13. Rd3 fxe6 14. Rxc3 Na6": "The smoke has cleared, and now we've reached the endgame stage. I have an advantage of a knight for a pawn. The key is to simplify, simplify, simplify. I want to exchange pieces and cut out any tactical complications.",
        "15. Rd1 Rad8 16. Rf3": "A mistake. Now I can vaporize a pair of Rooks. The more material comes off the board, the bigger my material advantage becomes.",
        "16... Rxd1+ 17. Kxd1 Rd8+ 18. Kc1 Nc5 19. Rf7+ Rd7": "I'm hoping he'll fall for this and exchange off his last piece...",
        "20. Rf4": "...but he preserves his Rook. Still, I now control the only fully open file and have penned his King in the Queenside.",
        "20... e5 21. Rh4 h6 22. b4 Ne6 23. f4 Rd4": "Now I will win back the Pawn, adding to my advantage.",
        "24. f5 Nf4 25. g3 Ne2+ 26. Kb2 Rxb4+ 27. Ka3": "Now the King will be in a stalemate position. All I have to do is find a way to deliver a check, and it will be mate.",
        "27... a5 28. f6": "Mate in 2 moves. The only way to prolong the game would have been Rg4, because if I then play Nd4 the followup will be Rxg7+. But it would only extend it a couple of extra moves.",
        "28... Nd4 29. c4 Nc2#": "A very rare opportunity to checkmate in the endgame. Chess is a game of errors. I made errors that were less significant than my opponent's errors."
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=26130",
    "gameName": "Let's play chess",
    "players": "mod3styasid3 (1366) vs. thehellion (1306)",
    "opening": "Philidor's defence (C41)"
}