{
    "moves": {
        "1. e4 d6 2. d4 Nf6 3. Nc3 g6 4. Nf3 Bg7 5. Bc4 O-O 6. O-O c6": "Based on the terrible position I got in this opening, e6 may have been better here.",
        "7. Bg5 b5 8. Bb3 Nbd7 9. e5 dxe5 10. dxe5 a5": "White already has really good pressure in the center.  This move threatens a5, but White will still retain a big advantage.",
        "11. a3 Ng4 12. e6": "This was a really good move.  Black is in significant trouble here, only a dozen moves into the game.",
        "12... Nde5 13. exf7+ Nxf7 14. Bh4 h6": "h6 prevents Ng5.  The pinned Nf7 is really a problem for Black.",
        "15. Bg3": "I thought this move was unnecessary.  Apparently Black fears g5, but if that move is played, there is time for Bg3 later.  For now, I would have piled on to the lonely e7 pawn.",
        "15... Qxd1 16. Raxd1 Kh7 17. Rfe1 Ra7": "This is awkward for Black.  Black is barely keeping the position together--and probably can't continue to do so if White presses.",
        "18. h3 Nf6 19. Ne5": "This move allows me to exchange pieces.  ",
        "19... Nxe5 20. Bxe5 Bf5 21. g4 Bc8": "The light-square Bishop doesn't have a lot of squares!",
        "22. Ne4": "This allows more exchanges, which simplifies my defensive task.",
        "22... Nxe4 23. Bxg7 Kxg7 24. Rxe4 Rc7 25. c3 c5 26. Rde1 Kf6": "Again, Black can barely hold it together.",
        "27. h4 c4": "Finally I was able to reduce the scope of the Bishop.",
        "28. Bc2 Rf7 29. g5+ hxg5 30. Re4e6+": "I think this was a simple blunder on the part of my opponent.  White loses the exchange.",
        "30... Bxe6 31. hxg5+ Kxg5 32. Rxe6 Rf6 33. Re5+ Kh6 34. Rxb5 Rd7 35. Rxa5 Rd2 36. Be4 Rfxf2 37. Ra6 Rf6 38. Ra8 Re6 39. Bg2 Rxb2": "White still has a shot here because of the passed a pawn.  ",
        "40. a4 Re5 41. a5 Rg5": "White may have missed this tactic.  There's only one way to save the Bishop, and it will leave to the loss of the passed pawn.",
        "42. Rh8+ Kg7": "Now both the Bishop and the Rook are under attack, so the only logical way to avoid dropping a piece is to protect one with the other.",
        "43. Rh2 Rxa5": "And that leads to the a pawn's disappearance.  Now Black should have a relatively easy endgame task with two passed pawns after the pieces are traded off.",
        "44. Rh3 Rg5 45. Rh2 Kf6": "By attacking the B twice, White's R is forced to h2.  That allows my King an important tempo to get nearer to the center.",
        "46. Kf1 Rgxg2 47. Rxg2 Rxg2 48. Kxg2": "Now that the pieces are exchanged, Black moves to control the center and to make sure that White can't use the c pawn.",
        "48... Ke5 49. Kf3 g5": "Here comes the g pawn.  If White moves to stop it, his c pawn will fall.  ",
        "50. Ke3 g4 51. Kf2 Ke4 52. Ke2 g3": "Now Black will have to make a choice.  Either the c or g pawn will promote.",
        "53. Kf1 Kd3 54. Kg2 Kxc3 55. Kxg3 Kd2": "With Kd2, Black controls the promotion square for the c pawn.  It will sail in for the win.",
        "56. Kf4 c3 57. Ke5 c2 58. Ke6 c1=Q 59. Kxe7 Qc6": "White resigned here, realizing Black has a simple K+Q checkmate.  I think this game was probably winnable for White with more aggressive play in the opening.  Because Black had so few options, White could have taken time to improve until Black cracked.  Trading off attackers made Black's job easier."
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=60999",
    "gameName": "Let's play chess",
    "players": "jjdiana1 (1454) vs. mmoody95 (1811)",
    "opening": "Pirc (B08), classical (two knights) system"
}