{
    "moves": {
        "1. e4": "A common opening move",
        "1... e5": "and a usual reply",
        "2. b4": "A very weak move, giving up a pawn for virtually nothing.",
        "2... Bxb4": "So black correctly captures",
        "3. c3": "This is the best follow-up preparing d4 with a strong centre.",
        "3... Bc5": "I think it would have been better to drop the Bishop back to a5, so if White plays d4 Black can play exd4 and White cannot recapture with the pawn. White would ideally like to set up a pawn centre with pawns on e4 and d4.",
        "4. d4": "So White sets up his centre. There are a couple of games in the Gameknot opening database with this position. After 4. d4 exd4 5. cxd4 Bb6 6. Bb2 Qf6 7. Qf3 Bxd4 8. Qxf6 Bxf6 9. Bxf6 Nxf6 10. Nc3 O-O 11. Bd3 Nc6 12. Nf3 Re8 13. O-O Nb4 14. Bb1 d6 15. a3 Nc6 16. Nb5 Re7 17. Re1 Bg4 18. Nd2 a6 19. Nc3 Rae8 20. h3 Bh5 21. Re3 b5 22. Bd3 Nd4 23. Rb1 Bg6 24. a4 c6 25. axb5 axb5 26. Rb2 Ra8 27. Kh2 in aeros (1724) vs. jerad (1582) Black played Nh5 and went on to win and .....Ra3 was played in the other game. I like exd4 5. cxd4 Bb4 in this position.",
        "4... Be7": "But instead Black just up his extra pawn.",
        "5. dxe5": "Which White gladly takes!",
        "5... Bc5": "And Black returns the Bishop to the nice c5 square. ",
        "6. Be3": "So White decides to exchange off the strong Bishop.",
        "6... Na6": "It would have been better for Black to exchange on e3 and leave White with weak tripled pawns on e3, e4 and d5",
        "7. Bc4": "White develops and ignores a chance to prevent his pawns becoming weaker.",
        "7... Bxe3": "So Black now exchanges",
        "8. fxe3": "White has to recapture to avoid losing material.",
        "8... Nc5": "and Black re-centres his knight.",
        "9. Qd5": "This is a strong move by white attacking the knight on c5 and the pawn on f7. Can you see how Black could have defended both?",
        "9... b6": "Black defends the knight, but not f7. By Qe7 Black could have defended both, or Black could have met both threats by Ne3 and Black would have had a good game. b6 as well as not defending against the mate on f7, leaves the rook on a8 open for White to grab.",
        "10. Qxf7#": ""
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=38113",
    "gameName": "Let's play chess",
    "players": "ponyrider (1194) vs. markleason (1200)",
    "opening": "King's pawn game (C20)"
}