{
    "moves": {
        "1. d4": "I am currently teaching myself the \"Stone Wall Attack\" and all of the variations. This is just one of the many games I am using to practice this opening. My opponent doesn't follow what I felt he would do and you'll see that I abandon the Stone Wall pretty early.\n\nHowever I lose some momentum and material early and feel that I should have lost this game do to some poor decisions on my part. My opponent doesn't take advantage of his two Bishops vs. my two Knight late and makes what a feel was a fatal error with a trade. \n\nMy opponent also either lost focus or completely undervalued pawns later and allowed me to crawl back into this game and ultimately win.\n\nI give myself credit for hanging in and getting the Win but some bad decisions should have sunk me pretty early on.\n\nHere we go.\n\nD4 - Typical opening for The Stone Wall. I'm expecting Nc6 or d5.\n\n\n",
        "1... Nf6": "Nf6 - I think he is going for center control early, w/out any pawn structure or help.",
        "2. e3": "I ignore the Nf6 and continue w/ the typical stone wall pawn structure. I don't like that he is already threatening e4, but w/out the pawns opening the middle he is falling behind in momentum.",
        "2... g6": "g6- Uh oh, I Know I've seen this somewhere before... I'm perplexed as this doesn't open up the middle for black and w/ my pawns on Black if he fienchetto's his biship or even brings it to the H file he is blocked. I am bummed however as the pawn on G6 will effect my intended attack w/ the Stone Wall.\n\nThis should have been my first clue to drop the stone wall and adjust my opening. ",
        "3. Bd3": "However, as I am extremely new w/ this opening I know vary little variations and sadly continued to plunge on forward w/ Bd3. A better move might have been to Fienchetto my own bishop to g2 and take control of the long light squared diagonal that is unobstructed.",
        "3... Bg7": "Bg7 - Black is still way behind in development. I think this allowed me to build a false sense of security w/ all of my advancement.",
        "4. e4": "e4 - At this point I realize that my stone wall will not work and attempt to adjust my strategy a bit. My aim was to kick the knight off of f6 and to further hem in the Bishop on g7. However I should have kept him home for a few more moves and developed my two knights first.",
        "4... d6": "d6 - Black finally comes to the party... This prevents me from being able to kick the knight off of F6. Just the beginning of my pains.",
        "5. Bg5": "Bg5 - Not sure what I was thinking here. I'm losing momentum and don't even realize it. Throwing away moves that should be used to develop pieces such as my two knights. This \"threat\" does nothing to deter Black.",
        "5... Nbd7": "Nd7 - Develops and protects in move. Black has easily gained in momentum and I am disjointed to say the least. No support, protection or clear attacking lanes. My starting idea of using the Stone Wall has quickly fallen into Ciaos. While Black is a little bottled up and I am more open, I feel that I should lose this game, based on this position alone.  ",
        "6. Nf3": "Nf3- Hey, I wake up and decide to bring in some protection.",
        "6... b6": "b6- Not sure What Black is doing here also. Neither of us has attacked yet, so maybe he is leaving himself some options to castle Queen side. I felt that him getting his King to safety or opening up the middle was the better option here as it would have allowed him to take advantage of my poor support and positioning.",
        "7. e5": "e5- In my mind, probably the worst move so far this game. Again, I have neglected to develop pieces. Should have Castled here or Nbd2. Both moves would have gave needed support to the middle and possibly hid my King. I could be wrong but I feel that this was the down turn in the game for me.",
        "7... dxe5 8. dxe5 Ng8 9. Be4": "Be4 - Again... I see this as a poor decision. I attack Ra8, but neglect to defend e5, while exposing my queen. I'm starting to see patience as a issue in my game.",
        "9... Rb8": "Rb8 - I won the ability to move the rook and prevent Queen side castling... Which is not even a remote possibility here. I'm giving away momentum in this game.",
        "10. Nc3": "Nc3- I think I just missed the double attack on e5, winning Black a pawn and attacking my queen at the same time.",
        "10... f6": "f6- Not sure, but White just couldn't pull the trigger on snatching the pawn. Maybe Black wanted to kick the Bishop off of the G5 Square.",
        "11. exf6 Ngxf6": "Ngxf6- Black didn't want to trade bishops and didn't seem to want to open the D file. Possilby feared the Queen exchange and having to recapture w/ the King, which would totally prevent future Castling. ",
        "12. Bc6": "Bc6- Again going in w/ guns blazing w/ no backup. My thought process was to keep black hemmed in a little longer. Again, I am giving away momentum as Castling here would have been the better move.",
        "12... O-O": "0-0 - Black totally negated my Knight Pin to his king. Black is tidy and well defended. However he is sorely behind in development.",
        "13. Qd2": "Qd2- I'm wanting to take out the black bishop patrolling the long diagonal on dark squares.",
        "13... Nc5": "There it is. Black is now, not afraid of the Queen trade once his King is tucked safely away.",
        "14. Bh6": "Bh6.... Wow, now that I look back on this game I can see why I lose the games that I do. My king is wide open, my queen is being honed in on and I place another piece in harms way. Not a good move... Sadly, the next one is much worse.",
        "14... Qxd2+": "Black trades and I make a stupid mistake.",
        "15. Nxd2": "Nxd2.... What the @!#$# was I thinking????? Bd2 was the correct move here. I not only allowed black to open the middle, trade Queens, but game him a Bishop as a free parting gift. I'm so nice.",
        "15... Bxh6": "Black is smiling now... I can feel it.",
        "16. Nc4": "Nc5- Now Unless I castle to the Queen side, I have to move the Knight so that I can Castle next. No need to compound insult to injury here.",
        "16... Bf5": "Bf5- Black smells blood in the water and is trying to pick me off one piece at a time. So what do I do? ",
        "17. Nb5": "Nb5- I attack one of Blacks two pawns in the 7th rank. I attempt a trade, thinking that somehow that will make my blunderous move earlier any better. ",
        "17... e5": "e5 - Up to this point black has played a very careful and solid game. I still am not sure why this move was made. I'm thinking he was baiting me into allowing him to pin my knight to my king. Fortunately I realized this before it was too late.",
        "18. O-O": "0-0 FINALLY!!! I get to safety! So I think. Now, I have bead on 3 of Blacks Pawns, I should get one on the next move.",
        "18... Nce4": "Nce4- Curiously Black doesn't take his free pawn on c2, plus he temporarily blocks himself from it. Nor does he protect any of his threatened pawns. Its at this point that Black starts to slip in his advantage. Slowly but surely. Black undervalued the pawns in general. His and mine.",
        "19. Nxe5": "Nxe5 - So I take my \"free\" pawn. Plus I threaten the f7 square and limit the king. However my main goal is the split on the d7 square, but the Bf5 is a thorn in my side.",
        "19... a6": "a6 - good move to kick the knight.",
        "20. Nxc7": "Nxc7- Stacking my Knight and Bishop was a huge mistake and costs me a Bishop.",
        "20... Rbc8 21. Bd5+": "I don't want to lose a piece for nothing so I attempet to get black to trade.",
        "21... Nxd5": "Kxd5- Had Black move his king, he could have gotten one of the bishop or knight for free w/ the trade. ",
        "22. Nxd5": "Nxd5- Now I get out of my poor decision to stack the Knight and Bishop. However I am Bishopless, so the end game should be interesting.",
        "22... Rxc2": "Rxc2- there goes that hanging pawn. At least Black recoups some interest.",
        "23. b3 Nxf2": "Nxf2-Black uses a battering Ram to break through my defenses. ",
        "24. Rxf2 Rxf2": "I'm not liking this look at all. Both of Blacks rooks on the F file? This could spell trouble.",
        "25. Ne7+": "Ne7+ The Rook isn't going anywhere so I decide to go on the offensive a bit. Blacks King can't push and Attack Ne7 because of the Knight on e5. so his only two options are h8 or g7.",
        "25... Kg7": "g7... ",
        "26. Kxf2": "kxf2 - I don't want to mess around any further wit that Rook. Need to nab him now before it is to late.",
        "26... Bd3+": "Bd3 Reveals a hidden Check. ",
        "27. Kg1": "Back into my hole.",
        "27... Be3+": "Be3- He wants to keep the initiative, but he only pushes me further into my protection.",
        "28. Kh1": "W/ the Rook protecting the 1st rank, I have no fear of Rf1++.",
        "28... Rf1+": "Apparently Black doesn't notice this or just wanted to trade rooks. I'm not sure which.",
        "29. Rxf1 Bxf1": "Now comes the fun part. My two Knights vs. Blacks two Bishops. While we are equal numerically, black has the advantage if his plays i correct, as his bishops can control almost any square w/ this open board. Black should win imo.",
        "30. Ng4": "Ng4- So I apply some pressure, hoping black makes a mistake w/ my knights. W/ Blacks light colored bishop hemmed in a bit by being on the 1st rank and behind my pawn, it allows me to have a little more freedom to move.",
        "30... Bd4 31. Nc6": "Nc6 - Still applying the pressure. Don't allow Black to mount any kind of attack, keep him focused on defending rather than advancing.",
        "31... Bc5 32. h3": "h3- places all of my precious pawns on light colors and keeps the dark bishop out of the game.",
        "32... h5": "h5- Blunder move by Black. He should have advanced his king and kept him in front of his pawns rather than behind chasing.",
        "33. Nh2": "Nh2- Again, while retreating, I still apply some pressure.",
        "33... Bb5": "Bb5- Black attempts the same thing however it only pushes me towards his king.",
        "34. Ne5": "Ne5- putting the knight in the middle of the board, hoping for a mistake from my opponent (who clearly isn't all that comfortable playing against knights in the end game) I'm also applying some pressure on g6 pawn.",
        "34... Bd6": "Bd6- At first glance this is a very powerful move as it pins my two pieces together. The flaw is that if Black takes, he will be trading a Bishop for a Knight. In this type of game he can't afford to trade either of his bishops as I can just move all of my other pieces onto the opposite color. I will happily take that trade if offered. ",
        "35. Nef3 Bxh2 36. Kxh2": "Kxh2 - So I take the offering. Even though the score is dead even, I feel that I just a huge advantage. ",
        "36... Kh6": "Kh6 - Now he starts to advance the king. However he is blocked from going any further because of the knight.",
        "37. Kg3": "Kg3- I further enforce my control over the pawns. Black cannot enter this area. ",
        "37... Bd3 38. b4 Kg7 39. Kf4": "Kf4- The king out front to usher home any passed pawns if possible, and to keep Black from gaining any kind of control.",
        "39... Kf6 40. g3": "g3- W/ Blacks only bishop on light squares, I needed to get the final 3 pawns onto dark ones.",
        "40... Bf1": "Bf1 - To little to late. ",
        "41. h4 Bg2 42. Ne1": "I can't trade my last knight at this point. First that would allow the Black king to move further into my territory and would severely hurt my chances of passing a pawn on either side. I must evade, but I'll pressure at the same time.",
        "42... Bd5": "Again, to little to late.",
        "43. a3": "Black now has very little he can do that doesn't allow me to have some kind of a foot hold. Everyone of my pieces are on dark squares and out of harms way.",
        "43... Be6": "Black attacks squares that I couldn't move into if I wanted to.",
        "44. Nf3": "I again apply pressure onto g5 and e5. looking to advance there next turn.",
        "44... Bg4 45. Ng5": "Again, keeping Blacks white Bishop from being a factor and hemming in the black king.",
        "45... Bf5": "Just some delaying moves by black. Hoping I make a mistake.",
        "46. Nh7+ Kg7 47. Ng5 b5 48. Nf3 Kf6 49. Nd4": "Nd4 - I need to make my way over to the other side. This way I split the attention black can give to either side.",
        "49... Bg4": "Black seems lost and unsure of what to do. Bd7 would have stalemated my Night from advancing up the board.",
        "50. Nc6 Ke6": "Ke6 - Now Black sees the delima and is attempting to thwart it.",
        "51. Nb8 Kd6 52. Nxa6": "Nb8, Nxa6 - A simple smash and grab. And With my pawn on B5 I even have my get away car available.",
        "52... Kc6": "Kc6- Black has totally focused on the knight and is given up on preventing the White King from blocking his him from returning.",
        "53. Kg5": "So I cozy on up to his nice little pawns.",
        "53... Bf5 54. Nc5": "Nc5- Jump in the get away car and make my escape.",
        "54... Kd5": "Kd5- Black sets his eyes on evening the score.",
        "55. Nb3": "Nb3- A better move might have been Kf4 to prevent Ke3.",
        "55... Ke4 56. Nc5+": "But I settle on pushing him towards the hanging pawn on g3, knowing that he won't get the h4 pawn.",
        "56... Kf3 57. a4": "a4 prevents a problem for Black. If he takes, he loses the pawn and allows a passed pawn that he will have sacrifice his bishop for to stop. If he doesn't then it passes anyway and Black is down a pawn.",
        "57... bxa4 58. Nxa4": "nice trade and Black is sliding down the slippery slope as we speak.",
        "58... Kxg3": "Black takes the consolation prize... Probably feeling a less confident at this point. The game is over at this point. Just advance the pawn up the board until Black is forced trade bishop for pawn...",
        "59. Nc5 Bh3 60. b5 Bg2 61. b6 Kf2 62. Kxg6 Bf3 63. b7": "Now Black is feeling the pressure. If the Bishop leaves his post to track down the wayward pawn, Black losses his last two remaining pieces. ",
        "63... Bxb7": "He makes the sacrifice.",
        "64. Nxb7 Kg3": "Kg3 - A better move at this point would be to forfeit. ",
        "65. Kxh5 Kf4 66. Kg6": "Kg6- Just keep the king in front of the pawn and he is home free.",
        "66... Kg4": "Black sees a free pawn and rushes in to snatch him up.",
        "67. h5": "Black finally relizes his doom and gives up the ghost!\n\nLike I said earlier, I should have lost this game and probably would have had Blacked valued his pawns and bishops a little more. Good Game Black."
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=48940",
    "gameName": "Let's play chess",
    "players": "4u2nv (1536) vs. jakdarb (1324)",
    "opening": "Queen's pawn game (A45)"
}