{
    "moves": {
        "1. e4 e5 2. Nf3 Nc6 3. Bc4": "These opening moves are book moves of Guico Piano.",
        "3... Be7": "Be3 becomes Hungarian Defence.",
        "4. c3": "White is planning to convert this in Ruy Lopes as his plan is to move his Bishop to b5.  The game would progress as a6, Ba4, b5, Bb3, Na5 and Bc2.  So to make the space to Bishop, move c3 is essential or else Black will capture the White's Bishop and will create the weakness by creating double pawn on 'b' file as White will have to capture the Knight by one of his a2 or c2 pawn.",
        "4... Nf6": "Normal development move.  Also preaparing for King side castling.",
        "5. Bd3": "This move is a violation of chess opening principles that in the opening stage one should not move the same piece twice unless the development of all the pieces is complete.  Bc4 to Bd3 also doesn't show any further game plan.  In chess, each move must have some purpose or game plan i.e., either development, attack, pin, fork etc.  It will be seen further that how this single move slowed down White's development. ",
        "5... d5": "d5 has two purposes.  One is a development move and opening the diagonal of Bishop at c8.  Another purpose is if white doesn't play e4xd5 then to take e4 pawn with d5 pawn and fork White's Knight & Bishop with a pawn.  White has to loose a piece as after d5xe4 the knight at f6 is supporting e4 square.",
        "6. exd5": "White correctly plays e4xd5.",
        "6... Nxd5": "By playing knf6xd5, another chess principle is followed i.e., never bring out Queen at the early stage of the game unless it is creating mating threat.  If Queen comes out at d5, White can simply develop his game by attacking the Queen with Bc4 or b3 etc and Black has no option but to move the Queen all over the board to save itself from attack.  This will result in complete development of White's pieces and Black's development will be completely hampered due to Queen's continuous movement.",
        "7. Be4": "Be4 has resulted Bishop's 3 moves from opening.  It means White has lost 2 opportunities of developing his other pieces.  Whereas Black is about to complete the development of all pieces by moving Bishop at c8 and then kingside castle.  The violation of opening principle of chess of not moving the same piece again and again unless the development is completed is causing troubles in white's development.",
        "7... Be6 8. O-O Qd7 9. d3": "This is most ideal situation for black as his entire development except castling is complete.  At present their is no threat to Black's king and hence Black has an option to develop the game further and do the castling either at Kingside or Queen side depending on situation.  White's Bishop and Knight at c1 and b1 are not yet developed.  In fact, white always need to maintain the first move advantage.",
        "9... Nf6": "This is first time that Black's Knight has moved twice but it is perfectly fine as f6 is a natural square for g8 knight.  The previous move of knight i.e., f6xd5 was for capturing the pawn and to avoid bringing Queen on the open board at the early stage of the game.",
        "10. Bg5 h6": "Finally White's long awaited Bishop is developed.  Black do not want his knight to be pinned for long and hence White's Bishop is attacked by h6.",
        "11. Be3": "Now again a violation of Chess principle by taking back Bishop at e3.  Remember that White's knight at b1 is not yet developed but by playing Bishop to g5 allowed Black to develop his pawn at h6.  Pawn at h6 is very important move for Black if he intent to castle king side.  If White would not have played Bishop to g5, then black would have spent one move in future for playing h6.  However, here White himself is helping Black to develop his game by violating the principles.",
        "11... O-O-O": "Now by castling, Black's development is technically completed in all respects.  Black's all pieces are active on Board and king is placed at safe place by castling.  Now Black has an advantage of deciding further game plan and white is still struggling for development.",
        "12. Bxc6": "Now again, this was completely unwarranted move as White's Knight at b1 is still not developed.  Since White's knight is not developed, White's Rook at a1 cant move and the ideal concept of connected Rooks is not possible for White.  White's Bishop is moved 4th time in the game without completion of development.",
        "12... Qxc6 13. Nbd2": "After queen captures Bishop, White's knight finally moves at 13th move of the game.  Self invited underdevelopment and giving the opponent an edge over the game. Also Knight's move at d2 is wrong as it is taking away Queen's protection to d3 pawn.  Black can now capture the free pawn at d3 by its Rook at d8.  What a blunder.  This is what happens if the pieces are not developed at the opening stage.  Here now White do not have any game plan and he want to take out his knight.  He cant take out his knight at a3 as Black will capture it with it's Bishop at e7 thereby creating weakness for White as White need to capture Bishop with its b2 pawn resulting in Double Pawn.",
        "13... Bf5": "Black doesn't capture the pawn at d3 with his Rook as it is possible that White will attack the Rook with it's Queen and then Black will probably have to take back the Rook at d8 thereby loosing one move and allowing White to develop his Queen.  So White's pawn is double attacked by Black's Bishop and Rook.  Black has given up his pawn at e5 as his intention is to attack and break open the center by capturing d3 pawn.  Also if White captures e5 pawn, it gives Black an open file for his Rook.  Remember, Rooks are very powerful in open files and for positioning it correctly pawn sacrifice is worth. Also if White captures the pawn Black can bring his queen into attack i.e., 3rd attack on d3 pawn and then it would become impossible for White to hold on the center and Black would be in complete control of the center.",
        "14. Nxe5": "White is happy to capture free pawn at e5 as expected.",
        "14... Qd5": "Black continues with the game plan of concentrating on the center.  By moving Queen to d5, Black is also protecting a Knight fork at f7 on both Black's Rooks.",
        "15. d4": "White trying to hold the center.  Here it should be noted that Black's Queen is also eyeing on a2 pawn and White must protect that pawn with his Rook.  Most unwanted situation for white that a very strong piece like Rook is occupied in protecting a simple pawn.",
        "15... Ne4": "Now Black starts advancing his army into the White's camp.  ",
        "16. c4": "White attempting to drive away a very powerful placed Queen at center.",
        "16... Qe6": "Moving Queen at d6 would be great blunder as it allows White to fork Black's both Rooks and a Queen by playing Knight captures f7.  Here another chess principle comes in picture that when you move your pieces, you must double check before moving it that what function that piece was performing at that particulat square.  Is it attacking Opponent's piece or is it blocking Opponent's pawn or piece development or whether it is supporting your own pieces or pawns and preventing Opponent's attacks.",
        "17. Nxe4": "Here, White has applied another chess principle that if you are ahead in material, start trading down the pieces and take the game to the end game.  The White is one pawn up and hence now it is correct for him to exchange the material and reduce further attack potentials of the Black.",
        "17... Bxe4": "Black's normal reply.",
        "18. b3": "Again violation of principles.  It should be noted here that White has not developed his Queen yet and pushing a pawn at b3 can be played at any other time.  Here now Black get chance to recover a pawn as White cannot bring his Rooks in play in the \"d\" file as White's own Queen is sitting in between the two Rooks.  It is known principle that the Rooks should normally be connected.",
        "18... Bf6": "By attacking Knight, Black is attempting to recover a pawn as follows : Bf6xe5, d4xe5, Qe6xe5.",
        "19. Nf3": "Realising this White avoid trading down the material.  But this gives Black an opportunity to double attack the pawn at d4 by Bishop at f6 and Rook at d8.  Black also can bring his Queen in action by bringing it in d file thereby creating 3rd attack.",
        "19... Bxf3": "Black captures Knight hoping that White will capture the Bishop by Queen as White would not prefer opening his castle by capturing Black's Bishop by pawn at g2.  If white captures Black's Bishop at f3, then Black succeeds in recovering a pawn by capturing pawn at d4 as Black has two attacks of Bishop at f6 and Rook at d8.",
        "20. Qxf3": "As expected White blunders by capturing the Bishop with his Queen.  Note here the principle discussed before that you must take into consideration the function that each piece or pawn is performing at a particular square.  Here, White's Queen at d1 was supporting the pawn at d4 along with support of Bishop at e3.  But by moving Queen, one support to pawn at d4 is removed and now Black can easily recover the pawn with his Bishop at f6 and Rook at d4. White has ignored this principle.",
        "20... Bxd4 21. Bxd4 Rxd4": "As per the plans, Black recovers the pawn.  Also note that Black is in very strong position as his Rook and Queen are controlling the open files 'e' and 'd'.  Black also can create a Battery by bringing his Rook at h8 to either e8 or d8 depending on game plan.",
        "22. Rfe1": "Black's Queen is attacked by White's Rook.  ",
        "22... Qd7": "Black moves Queen to d7 with clear intention of creating a most powerful battery by playing Rh8 to d8 and preparing to storm at d1.",
        "23. Re4 Rd8": "Black is executing his plans and has made a strong battery of Rooks and Queen in 'd' file.",
        "24. Ree1": "Again violation of principle.  Note that White's Rook at a1 is still not moved.  The best position for a Rook is open file and White's Rook is sitting useless so long.  Instead of this move, White could have very well developed his Rook at a1 to e1 thereby creating a battery.  But White continues moving same piece again and again without developing other pieces.",
        "24... Rd2": "Correct application of principle by Black.  7th rank is most desirable place for the Rook.  Here Black's Rook is also eyeing on a2 pawn which White need to protect with his Rook.  If White wants to develop his Rook, then he need to move a2 pawn to a4 thereby wasting one move.  ",
        "25. a3": "White choose to mobilise his Rook but again violation of principle of not observing the function of occupied square of the piece.  The pawn at a2 was supporting the pawn at b3 and by moving the pawn to a3, White's b3 pawn becomes unsupported.",
        "25... Rd3": "Black double attacks with his Rook to d3 by attacking Queen and Pawn.  White cant do anything as Black's Rook is well supported by Queen and another Rook at d8.  ",
        "26. Qe2": "Queen moves to the safety.",
        "26... Qe6": "Black offers Queen's trading and attempts to take the game to the end game.  Another reason to do so is that White's Queen side pawns has come forward and it is risky for black to move his Queen side pawns as it would open the castle and White's Queen can enter the Black's camp.  If both Queens goes off the board, Black can create counter play at Queen's side by moving pawns and keeping Rook's battery intact.",
        "27. Qxe6+": "Black succeeds in exchanging the Queens.",
        "27... fxe6 28. b4": "Pawn advancement and planning to attack Black's King.",
        "28... Rd8d6": "Supporting e6 pawn and also guarding 6th row from potential White pawns attack.",
        "29. c5": "Expected pawn attack by White.",
        "29... Rc6 30. Red1 Rxd1+ 31. Rxd1": "Rooks are exchanged.",
        "31... b6 32. Rc1 a5": "Black opening up castle and creating counterplay.",
        "33. b5": "This is a blunder from White as it creates Black's pass pawn on 'c' file.  After this move Rc6xc5, Rc1xc5 and b6xc5 thereby creating a strong pass pawn.",
        "33... Rxc5": "Black preparing for pass pawn.",
        "34. Rxc5 bxc5": "Pass Pawn is created.",
        "35. a4 c4": "Black applying correct principle that whenever you have pass pawn start pushing it immediately to the Queening square as opponent need to divert his pieces for stopping the pawn from Queening.",
        "36. Kf1": "White is forced to move his king towards the pass pawn to prevent it's Queening.",
        "36... Kb7": "Black planning to support the pass pawn with his King.",
        "37. Ke2 Kb6 38. Kd2 Kc5 39. Kc3": "The cat and mouse chase ends here as white has blocked the pawn but cannot capture it as it is supported by Black's king. Black applying correct principle of supporting pass pawn with king.  King at end game is a great warrior and it is king's responsibility to escort the pass pawn to Queening square.",
        "39... e5": "Creating a counter play.  ",
        "40. f3": "White responds accordingly and thereby stopping the Black's pawn from moving to e4.",
        "40... g5": "pawn push from Black thereby taking control of h4 and f4 squares.",
        "41. g4": "Now this was the last blunder from White.  White did not analyse the pawn position properly.  This move allowed Black to make in between silent move and waiting for white to completely block his pawns against Black's pawns.  Now Black can move his King to d5 but White cannot move his King as it is blocking Black's pass pawn.  White can at the most move his h2 pawn to h3 but black will continue to move his king to c5 and forcing White to either play h4 or move his king away from pass pawn.  If white plays h4 then Black's g5 pawn becomes pass pawn by g5xh4 and then White looses.  If White moves his King, still white looses because Black's king will escort the c4 pawn to Queening square.  ",
        "41... Kd5": "Black continues his plan of forcing white to allow Black to proceed his pass pawn.",
        "42. h3": "No other option for white.",
        "42... Kc5 43. Kd2": "Now realising the danger of playing h3 to h4, White prefers to step back.",
        "43... Kd4": "Black's king preparing to escort the c4 pawn to Queening square.",
        "44. Kc2 c3 45. Kc1": "This was perfect move by White.  Move looks simple but deep calculation is involved.  Now if black palys King to d3, White will take the opposition by playing his King to d1. Black need to play his pawn to c2 and white's king comes back on c1.  Now black cannot progress further as d2, c2 and b2 squares are blocked by White's king.  Black cannot move any other pawn as it will create pass pawn for White and white will necessarily win by promoting the pawn to queen.  If black plays h6 to h5, whites g5 pawn becomes pass pawn.  If Black play c7 to c6, White's b5 pawn becomes pass pawn.  And if black moves his king away from the c2 pawn, White captures the pass pawn.",
        "45... Ke3": "Best move for Black to attack f3 pawn by giving up c3 pawn.  This is because if pass pawn need to reach its Queening square, it is a must for Black's king to escort the pawn from e3 to e1 and also it is must for Black's king to occupy f2 square so that White's king doesn't reach e1 square for blocking the pass pawn.  Black is expecting White to move his king to c2 and then capture c3 pawn and in the mean time Black gets two moves to complete the sequence for promoting the e5 pawn to queening square.",
        "46. Kc2": "As expected White attempts to capture c3 pawn.",
        "46... Kxf3 47. Kxc3 e4 48. Kd2 Kf2": "Here White resigns as it is not possible for white to prevent Queening of e4 pawn as the important squares, e1, e2, e3 are blocked by Black's Queen.  The White King cannot occupy any of these squares and cannot stop Queen promotion.  "
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=30612",
    "gameName": "Let's play chess",
    "players": "justabout (1295) vs. manishsgadre (1387)",
    "opening": "Hungarian defence (C50)"
}