{
    "moves": {
        "1. e3": "Not very aggressive",
        "1... d5 2. d3 e5": "Great first two moves",
        "3. f4 Qf6": "Might have looked at Nc6,Nd7 or exf. The queen is out a little early and could become a target. But it's not a terrible move",
        "4. Nf3 exf4 5. exf4 Bc5": "Looks like a good move but as you soon see white builds his pawn center while your bishop dances. Maybe Bd6 was better",
        "6. d4 Bb4+ 7. c3 Ba5 8. Qa4+ c6": "A blunder. Many times when the queen does this double attack with check, the knight can go to c6 and protect the attacked piece at either a5 or b4, this is one of those times. Or if the knight Itself is attacked it can go to c6 and block the check.",
        "9. Qxa5 Qe6+ 10. Ne5": "A blunder. f6 and the knight will be lost for a pawn.",
        "10... b6 11. Qa3 Nd7": "f6 needs to be played here.White plays Kf2 or Kd1 and the pin is broken.",
        "12. Bd3": "White gives you one more chance",
        "12... f6": "There we go",
        "13. f5 Qe7 14. O-O": " ",
        "14... fxe5": "Also to be considered is QxQ giving him isolated doubled rook pawns.It's not bad to trade since material is even again.",
        "15. Re1 Qh4": "e5 isn't bad either",
        "16. g3 Qh5 17. dxe5 Ne7 18. g4": "Oops",
        "18... Qxg4+": "correct",
        "19. Kf2": "Nc5 attacks the bishop and frees yours to attack f5.",
        "19... Qh4+ 20. Kg2": "Another blunder",
        "20... Qxe1": "Taking advantage of it again, sometimes you just play solid and notice your opponent's mistakes and all of a sudden you've won",
        "21. Bg5 c5": "Good move as QxNe7 is mate. Also is Qxe5",
        "22. f6 h6": "Lots of stuff going on over there now, got to be careful.Not a bad move though. You also have Qxe5, if then fxNe7 you have QxB, if fxg you still play QxB with check then pick up the pawn next move.",
        "23. Bg6+ Nxg6 24. Qb3": "Not sure what he's thinking. fxg Rg8 Bxh6 I would done",
        "24... hxg5": "Good move",
        "25. Qxd5 Qe2+ 26. Kg3 Qxe5+": "Very nice move. Win a pawn And force white to trade queens and lesser his attacking chances, now u can just mop up and win.",
        "27. Qxe5+ Ngxe5 28. fxg7 Rg8 29. Nd2 Rxg7 30. Rf1 c4 31. Ne4 g4 32. Nf6+ Nxf6 33. Rxf6 Nd3 34. b3 cxb3 35. axb3 Rc7 36. c4 Bd7 37. Rd6 Ke7 38. Rxd3 a5 39. h4 Bf5 40. Re3+ Kd6 41. h5 a4 42. bxa4 Rxa4 43. Kf4 Be6 44. Rd3+ Kc5 45. Ke5 Kxc4 46. Rd4+ Kb3 47. Rd3+ Kc4 48. Rd4+ Kb5 49. Rd6 Bf7 50. h6 Rc8 51. Rf6 Rc5+ 52. Kd6 Rd4+ 53. Ke7 Rc7+ 54. Kf8 Rd8+ 55. Kg7 g3 56. h7 g2 57. Rf5+ Kc6 58. Rg5 Bd5+ 59. Kh6 g1=Q 60. Rxg1 Be4 61. Rc1+ Kd5 62. Rxc7 Rd6+ 63. Kg7 Bxh7 64. Kxh7 b5 65. Rb7 Kc5 66. Kg7 b4 67. Kf7 Rb6 68. Rc7+ Kb5 69. Ke7 b3 70. Rd7 b2 71. Rd1 Kb4 72. Kd7 Kc3 73. Kc7 Rb4 74. Kc6 Kc2 75. Re1 b1=Q 76. Rxb1 Kxb1 77. Kc5 Rb3 78. Kc4 Kb2 79. Kd4 Kc2 80. Ke4 Rc3 81. Kd4 Kd2 82. Ke4 Rd3 83. Ke5 Ke3 84. Ke6 Ke4 85. Kf6 Rd5 86. Ke6 Kd4": ""
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=849",
    "gameName": "Let's play chess",
    "players": "knightmace (1004) vs. andywitz (1013)",
    "opening": "Van't Kruijs opening (A00)"
}