{
    "moves": {
        "1. e4 d6": "Pirc Attack!\n \n \nAs noted it's actually a defence that focueses around the four black moves: d6 Nf6 g6 and usually Bg7, and on White's side d4 e4 (or in a different order) Nc3. White has a lot of options and kind of controls what will be the style of the game with the following moves (e.g. 4 f4, 4Nf3 4Be3 or 4 g3).\n\nI'm trying to get into this with the book Pirc Alert by Albert and Chernin :)",
        "2. d4": "Natural reaction from White, occupying the centre",
        "2... Nf6": "develops, attacks e4, most common move here in the Pirc I guess",
        "3. Nc3": "defends e4 the natural way",
        "3... g6": "preparing to give the dark-squared bishop a home on the long diagonal",
        "4. Bc4": "uncommon variation?",
        "4... Bg7 5. Qe2": "overdefending e4, developing the queen\n\nAs noted by Chesscentral there would have been the possibility of:\n4 ... Sxe4 5 Sxe4 d4 :) thx for the comment",
        "5... O-O": "maybe developing to Nc6 was attractive here, which also guards the critical point e5?",
        "6. Nf3": "developing, preparing to king-side castle",
        "6... Bg4": "pins the knight, attractive for a later Nc6xe4 threat",
        "7. e5": "cracking up the centre, preparing a deadly king attack ;-)",
        "7... dxe5 8. dxe5": "up to this point the game is equal I guess, however the knight needs to find a new home...",
        "8... Ne8": "? a bad decision, as the knight has no future here (only c7 which is not free yet). It would have been happier on h5, even it's on the dim.\n\n\nComment: My fear was that after Nd7 e6 woud follow. Of course fxe6 would yield Bxe6 Bxe6 Qxe6+. I did not feel that comfortable with that thought... Kh8 would have to follow since white could do Ng5! well... :) ",
        "9. h3": "asks the bishop for a decision",
        "9... Bxf3": "! kills the defender of e5 and weakens White's king side.",
        "10. gxf3": "?! interesting idea, White seems to plan queens-side castling and have an open g-file now.",
        "10... Nc6": "develops, attacks e5. However, the poor knight on e8 is definitely entombed now for a while...",
        "11. f4": "fixes the pawn on e5",
        "11... Kh8": "? for enabling f6, however it will soon be in a deadly bind...",
        "12. h4": "... prepared by this pawn storm.",
        "12... f6 13. h5": "threatens the deadly hxg6",
        "13... fxe5": "? gxh5 would have saved a bit longer I guess, however, after Qxh5 it's lost soon anyway",
        "14. hxg6": "threatens mate in one",
        "14... exf4": "only move was Nf6, defending h7, however the game was already lost anyway",
        "15. Rxh7#": "pretty!"
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=40169",
    "gameName": "Let's play chess",
    "players": "medusa123 (1569) vs. thedeafone (1200)",
    "opening": "Pirc (B07), Holmov system"
}