{
    "moves": {
        "1. c4": "White mishandled the opening, which at some point I considered drawish, probably he wanted more from it and overreached, White's 11.Bxd4?! kept two permanent weak pawns on white's field, and allowed me to complete my development with tempo, also 13.Bxg7?! was also dubious as it opened the d column with his king still in the center uncastled... I profited from white's king misplacement and tried some tactics but only got to exchange B+R for Queen which eventually brought me the win because two pieces are easier to coordinate than three and white's pawn weaknesses offered several attack objectives, I just had to pick them one after another...\n\n",
        "1... g6 2. d4 Nf6 3. Nc3 d5 4. Nf3 Bg7": "g",
        "5. cxd5 Nxd5 6. e4 Nxc3": "third in a row from both sides of the board",
        "7. bxc3 c5": "challenging the center",
        "8. Be3 Qa5 9. Qb3 O-O 10. Bc4 cxd4 11. Bxd4": "?! Nxd4 to avoid Nc6 might be better",
        "11... Bg4": "develops",
        "12. Nd2 Nc6": "develops attacking the bishop d4 while inviting Qb7?",
        "13. Bxg7": "?! dubious as it opens the d column, and I already control d1 with the bishop, Rd8 is in order in a near future",
        "13... Kxg7 14. h3": "so this means I have to play the bishop back home Bc8, Bd7 or Be6? all seams bad choices, what if Qh5, is f3 playable, all white's king's wing pawns will be on light squares...",
        "14... Qh5": "pinning the h pawn, I can, at least for now, postpone moving the bishop from the d1-h5 diagonal",
        "15. Qxb7 Ne5": "bring in reinforcements with tempo",
        "16. Bf1 Rfd8": "setting a trap let's see if black eases my job, by capturing the e7 pawn, that blocks my easy access to the e column",
        "17. Qxe7": "he does... thanks",
        "17... Rde8": "now occupying the e column and threatening the e pawn with tempo",
        "18. Qa3": "forced to move back",
        "18... Nf3+": "! sacrificing the knight for two pawns and an attack, the idea is that in the eventuality of Nxf3 by white I have Rxe4+ with a massive attack on white's king, if gxf3 Bxf3 with the idea of Bxe4 latter on with a discovered check threat and also a massive attack will unveil on white's king",
        "19. gxf3 Bxf3 20. Be2": "? gives back the sacrificed piece, but doesn't achieve nothing",
        "20... Bxe2 21. c4": "the point of this move? maybe to block my bishop in...",
        "21... Rad8": "hits Nd2 and prepares Bd3 or Rd3",
        "22. f3 Bd3": "only move, as Rd3 attacking the queen fails to Qb2+ and Kxe2 next move",
        "23. Qc3+": "? I just don't see the use for this pointless check, maybe to secure the d2 knight, but then he could do it a a latter opportunity...",
        "23... Kg8 24. O-O-O Be2": "back to e2 were it attacks the f pawn",
        "25. Rde1 Rd3": "! now Rd3! is possible leaving the bishop \"en prise\" as white doesn't have the check on the a1-h8 diagonal any more",
        "26. Qc2": "? allows me to exchange R+B for the queen... still a lot to do but it looks the end is easier now",
        "26... Qe5": "if Rxe2 I have Rc3 to win the queen",
        "27. Rxe2 Rc3": "as planned...",
        "28. Nb3": "nice the queen is as good as nothing now, so Nb3 prevents Qa1+",
        "28... Rxc2+": "and here it is queen for rook and bishop, now I think I'll have an easier task coordination my pieces (just two) than white's (he has three pieces and a bunch of weak pawns to defend",
        "29. Kxc2 Qg3": "threatening both f3 ad h3",
        "30. Nd2": "Knight back to d2 were it assumes a passive defensive role, and an overcharged one... I think white is without a plan now, lets try to profit from it!",
        "30... Rd8 31. Rb1 Rc8 32. Rb7 h5": "I'll ignore the treat against my pawn on the queen's wing, and focus on pushing my supported pawns on the kings wing",
        "33. Rxa7 Qxh3": "opens up the h column for my pawn to advance",
        "34. Ra3": "the rook is back to defensive tasks... white needed some counter-play to win this, but I think he will manage with the draw, at least this closed setup around his king seams to tell that...",
        "34... Kg7": "supports the pawn push with the king and opens the 8th rank for the rook to add support on the h column, plus shields the king from lateral checks, at least for now",
        "35. Rd3": "I think white should play eventually Ree3 to defend laterally against any pawn storm on the king's wing, he could the either push f4 or even better I think just wait to exchange the f pawn for the g pawn if it gets to do that",
        "35... Qh1": "keeps a threat on f3 and also now has the idea of a possible Qa1... the wolf is surrounding the pack, as if lambs to the slaughter! (a very Biblical analogy) ",
        "36. Ra3": "and here it is prof that white is without a plan... 34.Ra3 35.Rd3 36.Ra3... were does it end? So much to do so little to do with...",
        "36... Qa1 37. Ree3 h4": "threatening a triumph march of the h pawn... so I expect f4",
        "38. f4": "to open the 3rd rank for the rooks",
        "38... Rb8": "the idea is to play Qb2+",
        "39. Nb3": "? it does block my rook from accessing b2 but also disconnects white's rooks",
        "39... Qf6": "it wins a pawn, because if Rf3 I have g5-g4 (with tempo), Nd2 just allows Rb2+ ",
        "40. Rh3 Qxf4": "and now we have balanced material, but two pieces are easier to coordinate (one being the queen) than three...",
        "41. Nd2": "the knight back to d2 and now my rook back on d8, it might even be possible to exchange rook for knight if it allows me to promote a pawn latter on",
        "41... Rd8 42. Rae3 g5": "now going in for the kill, also freeing the queen from the defense of h4",
        "43. Re2": "? allows me to start a pawn storm, with f5!, now if exf5 I have Qxf5+ winning the h rook",
        "43... f5": "!",
        "44. c5 Qg4": "attacking the two white rooks simultaneously, so I expect either rook to move to h2 or e3 to protect the other one, in case of Rhe3?? loses a rook to f4, anyway after white's next move I have f4 to get four passed connected pawns",
        "45. Rhh2 f4": "and here it is as planed",
        "46. Rhf2 h3": "I'll keep pushing now with the added objective of denying white Rg2",
        "47. c6 Qg3": "gives another square to my g pawn",
        "48. Nb3 g4": "and now I push g4",
        "49. Red2": "? I'll simplify, as the promotion of my pawns is guaranteed, and I can even sacrifice the queen for the c pawn if necessary",
        "49... Rxd2+ 50. Rxd2": "if Kxd2?? loses another queen to Qxf2+ with tempo, so I still can reach the c pawn before promotion",
        "50... Qe3": "threatening Qb6 and Qxe4+/c4 getting to the c pawn with tempo and freeing the g column to push further my pawns...",
        "51. c7": "? loses another pawn e4 and allow me to get to c7",
        "51... Qxe4+": "only move, with tempo to catch the c pawn in time, next I'll bring my king to the queens wing to free my queen, allowing her to support my pawns on the opposed wing",
        "52. Kb2 Qb7 53. Rc2": "this make no sense unless my opponent is planing to bring his knight to the king's wing to exchange it for two pawns, I'll still be better as then I'll get his c pawn... and my pawn is near promotion I can even exchange the queen for the rook and proceed to win it easily",
        "53... Qc8": "only move, blocks the pawn, and can't be displaced my pawn will now promote or be captured by force of a weakening exchange",
        "54. Nd4": "he will exchange... ",
        "54... g3": "next I expect Nf3 h2 Nxh2 forced gxh2 Qxc7 -+ and a technical win as white have no more counterplay",
        "55. Nf3 h2 56. Nxh2 gxh2 57. Rxh2 Qxc7 58. a4": "and now f3 and f2 because if Rxf2 Qb6+ wins the rook",
        "58... f3": "next in line is f2, unless a5 or any king move which gets Qxh2 and Rc2 getting Qxc2 to promote next, I'm not considering either Re2/g2+ nor Rh7",
        "59. Rd2 f2 60. Rd1 Qc4": "protecting f1 and preventing Rf1 to block the promotion, still white only has three checks to give if he wants to extend the game a little further, else is f1=Q Rxf1 Qxf1 and bring in the king for the kill",
        "61. a5 f1=Q 62. Rxf1 Qxf1": "...and now I just need to bring my king to give mate and avoid stalemate",
        "63. Kb3 Kf7 64. Kb4 Ke6 65. Kc5 Qa6 66. Kb4 Kd5 67. Ka4 Kc4": "mate in 3 as white would forcefully move away from his pawn ",
        "68. Ka3 Kc3": "if he gets back at a4 Qc4+ and Qb3 mate if he moves further away my king will chase it moving to c2 and Qxa5 is mate",
        "69. Ka2 Kc2 70. Ka3 Qxa5#": ""
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=43553",
    "gameName": "Let's play chess",
    "players": "afei (2141) vs. kaspanatola (2054)",
    "opening": "English opening (A10)"
}