{
    "moves": {
        "1. d3": "Unlike before, this is not a common first move, and I don't why he played this.  More common is 1.d4 as it can lead to different variations like the QG.  So, 1.d4, d5 2.e5.  Or the King's pawn with 1.e5.  But, what you don't typically see, however, is a pawn that only advances one square.  Usually, I don't emphasize it because this is a central pawn.  The only thing, however, is that it's not studied by top players.  Now, Jack Stockel has advised me to play opening that are studied and analyzed by masters and grandmasters, and this point is indirectly implied in the, \"Deeper Chess Theory Club\".",
        "1... d6": "And, my comment with this move is the same about 1.d3.  ",
        "2. Nc3": "Now, this is a good developing move.  And, that's because you're deploying, developing, a piece.  So, this move blends well with the third thing on that checklist.",
        "2... Nc6": "Same.",
        "3. Nf3": "Another good developing move, and by doing what he's doing, Jason not only developing.  But, he's also coordinating those pieces which should make it easier to control the center.  And, that's because, as GM Susan Polgar emphasized in using openings to think like a GM while developing, you're pieces have to be coordinated to control the center.",
        "3... Nf6": "Same thing.",
        "4. Bf4": "?! While this move develops, the problem is the first and sixth on that checklist.  Mainly Material balance, but also space.  The problem here is that with this move is that white creates a weakness for himself in which black can exploit with 4...e5.  If this happens, not only would white lose tempii, given that his DSB would be attacked.  But, that would give black better control of the center because that move would develop a center pawn.  And remember: in the opening, the most important files are d and e, as that's how you control the center.",
        "4... Bf5": "?!, the problem with this move is the same before.  But, this time, white will take advantage of it.  But, will he, however, find the right response?  That is, the move that I would play?",
        "5. g3": "No.  I mean, I like this move, as it gets white to fianchetto his LSB.  But, I would have 5.e5 because that gains tempii, at the same time as controlling the center.  And, with that, he would have had a slight advantage.  But, now, things are still even.",
        "5... g6": "She is also getting ready to fianchetto her B.  The only thing is that archduke_piccolo told me that trying to fianchetto anything usually takes more time, by an extra move, when you could already use that move to bring something into play.  That's in general, so I usually don't do that.  This time, it's not a problem because the center pawns, unfortunately, have not yet been developed on either side.",
        "6. e4": "Now, this is a good developing move.  And, as noted this is what I would've played a move earlier.  But, it makes no difference the results are the same.  With the idea of space and center he used to that tempii to achieve that.  So, he has better control of the center which gives him a slight edge, at this point.",
        "6... Bg4 7. Ng5": "?? This, however, is serious blunder.  What Jason forgot is that because black retreated with 6...Bg4, his N was indirectly to the Q.  So, \"almost anything was better then this move\" as this move loses a Q for a B.  Plus white's K is vulnerable to exposure because after 8.Kxd1, he can no longer castle which is also part of the third thing on that checklist. And, now, with best play black should win.  But, in my mind, white does the right thing by not resigning because there is just one question which remains to be seen.  Can black keep her advantage? ",
        "7... Bxd1 8. Kxd1 Nh5": "Despite being far ahead, one should still follow the basics and the theory and concepts.  Unfortunately, this doesn't due to one fact.  And, as you get more experience it doesn't matter as much, but @Erika: Remember, that a Knight on the rim is dim.  Meaning that it should not be on the endfiles.  Otherwise, the opponent has more opportunities to attack it, whereas, there's less room for the N to escape.  Plus, it makes the N worth less. ",
        "9. Be3": "! And, while I would've considered punishing black with something like 9.Be2, while developing at the same time.  This move is actually better, and that's because the most important concept, in my opinion, is material relationship.  While, they're all important, this one, in particular, outweighs everything, as it's the thing that makes or breaks a game.  By doing what white did, he avoided an exchange.  That's an important strategy because when you're behind, it's more often then not, a bad idea to exchange.  It's well known, that people like to exchange when ahead, as it gives the opponent less to defend.  Jason saw that and her plan and his response to the threat was good.",
        "9... Bg7": "Fianchettoing her DSB and preparing to castle.  BTW, @Eirka and Jason: chess terms are very important since chess is also a language.  Now, fianchetto=putting your B on the longest diagnol.  That's the case, in this position, since the diagnol of black's DSB extends from h8 all the way to a1.  ",
        "10. Bh3": "This is also a good developing.  And, although he can't castle, white just completed his development, and there is a way to make for the loss of castling.  But, a lot of thinking, however, is required to do so.  It seems simple of just lifting the K up, moving the R directly right, and bringing the K back to d1.  However, there's way more to it, then meets the eye.",
        "10... O-O": "However, black's now in really good shape, as she just castled.  With it, black's development is now complete.",
        "11. Nd5": "? Perhaps, white was thinking that this move successfully forked a piece.  But, if that's the case, Jason miscalculated.  In order for it to work, his other R would have to be on c1.  And, more often then not, there are ways out of it, so it isn't really a fork, in that case.  And, the problem here, is that by moving the N white just create another weakness which his opponent will take advantage of.  He left his b pawn enprise, vulnerable to attack, and black will take it, winning another pawn and adding to her advantage.",
        "11... Bxb2 12. Rb1": "Attacking the B.  I mean, why not?  You're losing anyway, and when I'm losing, or for that matter, in a completely lost position, before resigning I get really aggressive, like this.  The idea being to try to pull a swindle.  And, btw, @hiregun112 and reachforgoals: a swindle=a win or draw in a hopelessly lost position.",
        "12... Nb4": "?? I don't know why black this, but it is an absolute which should give white some compensation for lost material, if he finds the right move.",
        "13. g4": "I understand, this move, doing what he can to gain tempii.  But, and while that's part of the strategical aspects, as talked about earlier, it's not the best move.  When we count material relationship, white's best response was either 13.Rxb2, or 13.Nxb4.  Both moves win back a piece and lose some of black's advantage.",
        "13... Ng3": "?? Best outpost for black was 13...Ng7.  And, while I generally don't like this because it creates a structural disadvantage around the K, it was the only sure way to protect her N.  So, now white has one more way to get back some compensation and win material.",
        "14. Rg1": "And, he still could've taken back, but instead, attacks the N.  You have to base things on the position, usually, material, like winning or losing it, is more important the tempii.  But, once in a while, tempo is more important.  This, however, is not one of those times.  Now, black has no way to prevent white from a winning back a piece.  So, now, some of Erika's advantage is gone.",
        "14... Ne2 15. Kxe2 Nxa2": "?? I understand this move very well, as it's the kind of thing that I used to do.  Black thought that she had advantage, and the only thing on her mind is to exploit white's weakness.  Yes, that's important to think about and apply, as it's part of thinking ahead.  But, just as important, is calculating accurately.  And, unfortunately, black miscalculated because she overlooked Jason's R.  This makes a difference space and material relationship, btw, because white can and will take blacks DSB with 16.Rxb2.  So, now in addition to compensation, she lost a piece for a P.  And, with that little by little, white's starting to regain his advantage, believe it or not.  So, in the short term this move is a blunder.  But, in the long term, it's also an error because of what's about to come.",
        "16. Rxb2 Nc3+": "The idea was to check.  But, now you have to ask yourself two questions.  First, is this check helpful or harmful.  Second, is it serious or just a nuicanse.  This check was a nuicanse.  But, after the this move, black's N was trapped, another reason, why in the long term, 15...Nxa2 was a blunder.  Now, if white finds the right response, he should win it.  And, despite being a Q behind, if this happens, all of black's advantage will be gone, and in fact, will have a slight edge, as he'll be slightly ahead, paradoxically. ",
        "17. Kd2": "Unfortunately, black does not, however, find the right response.  17.Nxc3 was best, as this is the move that would've given white the advantage.  With this choice, it becomes an even exchange, and white is still behind.",
        "17... Nxd5 18. exd5 c6": "Given that she's still ahead, black intends to exchange.",
        "19. Bd4": "? I don't know why he played this.  In this case, white had to exchange with 19.dxc6, and there was no way out of it.  Sine white had doubled pawns, there was no way to advance it for protection, which is what I did in a recent game against him.  This is the disadvantage of having doubled pawns, it's about pawn structures.  And, two pawns on one file weakens that.  So, with this move, black is going to win another pawn for free.",
        "19... cxd5 20. Rg3": "I understand this move.  It get's white's last piece out, and achieves mobilization.  While there's nothing wrong with this move, I would've preferred 20.Rb1, doubling his R's.  And, that's because, while not in this position, it's good practice because, in general, doubled rooks are very dangerous that can pose immediate mating threats, even when you're behind.  However, I would've recaptured immediately with 20.Rxb7.  However, that move will be played, sooner or later.",
        "20... Qa5+": "Again, you have to ask yourself it is a good or harmful check.  And, if it's a nuicanse or serious.  I think this check was harmful because white can and will get out of it.  And, he'll gain some needed tempii to get out of it.  Note: Even if we're not in the beginning stages, tempii is still very important.  In fact, it's usually most important in the endgame.",
        "21. Bc3 Qc5": "! Remember when I said that white could immediately recapture that pawn.  Well, with this move, it's now too little, too late because once white takes, black recaptures with 22...Qxf2+.  However, anything can change drastically, so stay tuned.",
        "22. Rxb7 Qxf2+ 23. Kc1 Qg1+": "?? But, this is a very serious blunder which I think I know why black, however, moved here.  She probably thought that this move was an automatic back rank mate but miscalculated and overlooked white's R which is about to do some serious damage.  Best, was 23...Qxh2 gaining back even more of the advantage that she lost.  Had black played that, she probably would've won, in the long run.  With this move, however, black not only loses her advantage, but white now has a winning advantage.  Here's the thing, @reachforgoals:  if there were three pawns surrounding the K so in addition to c2, b2, and d2, it would be mate.  However, the K can escape.  And, to make matters even worse, white can and will win back a Q.  So, before moving, one thing that ties into material relationship is calculating and asking yourself if there's anything you're missing.  Then, analyzing to figure out if there's anything your opponent can do about it, and if you're plan will work or be counterproductive.  Meaning: That it does the opposite of what you achieve and/or if it will cause damage.  This is a perfect example. ",
        "24. Rxg1 Rac8": "Given that she's now behind, black tries to compensate.  And, she does with the second checklist, by posing a direct threat.  The idea, though, basing on the structures is that she wants to win white's DSB.",
        "25. Rf1": "?? This time, I don't know why white moved there, but he overlooked the threat.  Best was to retreat his attacked, but instead, left it hanging.  Therefore, black is going to win something back.  ",
        "25... Rxc3 26. Rxe7": "And, despite white getting a pawn, in exchange, there's something important for both players to remember.  So, I am not basing on who's ahead or not, at the moment.  The important concept and strategy, in many cases, and it's a well known fact, btw.  But, pieces are worth more then pawns.  While not completely true, if it's an even exchange, one way to remember is, as elyhim would say, \"Exchange pawns, not pieces.\"  ",
        "26... Ra3": "Understandable, and actually this is very similar to what I would've done.  The idea here is that based on the positional aspects, this time, this move does protect black's a7 pawn.  The idea being and what normally happens is that this kind of move prevents the immediate loss of another pawn.  But, in this position, that is not the case because, \"There's always another way of doing something.\"  And, here, white is going to win a pawn.  That's because when we look, after 27.Rfx7, even when black does take bake, white has his rooks connected+ his g5 N, whereas, black doesn't.  So, even if and when black were to recapture with ...Rxf7, with the rook nearby and the N on g5 white then quick plays Rxf7.  Now, had the R's not been side by side and the N not where it is, white would not dare to take the pawn, or he's lose a R, in exchange.",
        "27. Rfxf7 Ra1+": "The idea here is that once white gets out of check, black would win back a R and everything would, henceforth, be even after 28...Rxf7.  But, that is not the case because of what I mentioned above.",
        "28. Kd2 Rxf7 29. Nxf7 Kg7": "? This time, I have no idea why black played this.  Best, however, was 29...Ra6, protecting the d6 pawn.  But, with this move, however, black is going to lose another pawn with a discover check.  Note: @reachforgoals and hiredgun112: a discover check occurs when you have a position like, but you get put in check, by removing a defender.  Meaning: moving pawn or piece that allows another piece, right behind, to put the player in check.  One example will occur, when white plays 30.Nxd6+",
        "30. Nxd6+ Kf8": "? I understand what black was trying to accomplish as it's how I used to think.  Since black's now far behind, the idea was to pressure white so that he'll blunder.  By doing this, black would win back a piece, the R.  In which case, black would've equalized.  @reachforgoals: the problem here and in general is that the plan doesn't work and it won't in this case either.  White has ways out of it, and in fact, with this move he is going to win another pawn.  So, what's important to remember is material relationship, what's being threatened, calculation, and strategies.  And, this is even more of a reason why applying that 7 point checklist is very important. ",
        "31. Rxh7 Ra6": "Trying to win white's N.",
        "32. Nf7": "But, as we know, it's about asking yourself what being threatened which white just did.",
        "32... Kg8": "I don't know what this move accomplishes.  ",
        "33. Ng5": "My guess is that white is trying to find a mating sequence against black.  The question here is, how can he do it?  If his LSB weren't blocked by his g pawn, it would all make sense.",
        "33... Rf6": "Black still wants counter play, so she wants and is planning to put her opponent in check with 33...Rf2+, after which, she'll win back a pawn.",
        "34. c4": "But, this is a perfect example of thinking ahead which is what I'm trying to get reachforgoals to do.  He sees the threat and moves here to prevent that from happening.",
        "34... dxc4": "So, black takes.",
        "35. d4": "Normally, this isn't bad, but this move can mess up the pawn structure.  And, despite being ahead with a winning advantage, white must be careful in order to avoid throwing that away.  Remember: \"When you think that you have won or are in a winning position, be very careful, and don't underestimate your opponent.  Otherwise, you might start making mistakes and losing the game.\"  The reason that I'm emphasizing that right now is because while it might not appear so, black's a pawn is very dangerous.  So, white has to do something in order to prevent black from getting a passed pawn.  Plus, while it doesn't matter here, in general, if there black had more then just her c pawn, surrounding the d pawn, and white played this, black would be able to just continue advancing the d pawn, so she wouldn't have to take another.  If that were the case, then the d pawn would have potential, something that one must be very careful about, as that blends in with part of the concepts and theories, as well.",
        "35... c3+": "? So, black check's with the idea that she can promote her c pawn.  But, as noted above, because black does not have any pawns surrounding the c file, she will not achieve her goals.  In fact, this move is another mistake because it gives away another pawn.",
        "36. Kxc3 a5": "So, now, she's trying to promote her a pawn.",
        "37. Bg2": "Don't why he played this, but better was 37.Kb3 to stop the promotion.  The only thing is that black could protect and get a passed pawn 37...Ra6.  So, to prevent all of that, best was 37.Bf1. ",
        "37... a4": "Still trying to promote.",
        "38. Bd5+": "But, white reacts by placing black in check.  Let's see what else he has in mind.",
        "38... Kf8": "Indirectly forced, as the only other choice would've been 38...Rf7??, but that would lose a R. ",
        "39. Kb2": "! Very smart move.  Now, that we're in the endgame, the K's become very powerful weapons.  Believe it or not, almost as much so, as the Q.  And, this will certainly prevent black from promoting her a pawn.",
        "39... a3+": "? Still wanting to promote, but this time, the check was harmful.  Best might have been 39...Ra6, in which case the a pawn would still be very dangerous.  But, this move loses, yet, another pawn.",
        "40. Kxa3 Ra6+": "Nuicanse, yet, understandable check.  When, I'm faced with a position like this, I'd do anything to stay in.  Now, at this point, I would resign, in this position, given that any hope of counterplay would be gone.  But, as we're about to see, even in a position with no chance of that happening, it's still better to stay in, as we will see later on.",
        "41. Kb4 Rb6+": "Still doing anything to pressure Jason.",
        "42. Kc5": "But, now white put's a squeeze on black.",
        "42... Rb7": "?? Serious blunder.  Black either should have retreated to the first or second rank.  With this, she's going to lose another R, without much left.",
        "43. Bxb7 Kg8 44. Bd5+": "It might look that good, and it seems like the move doesn't accomplish.  While that might seem so, the plan, though is very good and shows that white is thinking ahead.  The idea is to get black in a mating net.  This would normally work, but there is one way out of this.",
        "44... Kf8": "Directly forced, this time.",
        "45. Rd7": "Don't know why white played.    But, I'm not going to annotate every move, as we already went into a lot of theory and concepts.  In fact, I'm only planning to annotate one more before the very end. Plus, despite being far behind, black is not going to lose her remaining pawn.  PS, white is not going to place black in any more checks.  And, remember when I said, that I would've resigned.  Well, white miscalculates, so this game is going to end in a draw.  Proof, of why it's actually better to stay in the game, as opposed to, resign.",
        "45... Ke8 46. Be6 Kf8 47. d5": "?? This might seem fine, as you may ask, ok what else could white have done, and is any move better then the other.  Well, the thing is that this a super blunder, despite not losing material.  The reason here is that Jason missed an immediate mate in 3.  With this move, however, the game is going to end in a draw, as black can now find different ways and strategies to force a stalemate, as opposed to, a checkmate.",
        "47... Ke8 48. Kc6 Kf8 49. Kc7 Ke8 50. Rh7 Kf8 51. Kc8 Ke8 52. d6 Kf8": " ",
        "53. d7": "There is a lot for both players to learn from this game, as it could have gone either way, this game had more twists and turns then any other game that I've annotated before.  The main lessons are, first, apply the concepts, strategies, tactics, positional aspects, theory, and basics into your games.  Second, thinking ahead is important but also calculating.  Third, which blends in with the third concept is not only development, but developing in the right spot, to for center control since controlling the center is extremely important.  For instance, white tried to take advantage of black's weakness by attempting to put pressure on her K with 7.Ng5.  But, what Jason forgot was that his N was indirectly pinned to the Q.  So, by moving it, he lost a Q for a B.  Later on, after losing some advantage, black miscalculated by playing 23...Qg1+ which allowed white to win back the Q and handed the advantage back to white.  Whereas, 23...Qxh2 would have given black more of her advantage back, so she would've had almost as much, as earlier.  And, @Jason and Erika: In the beginning, despite developing your B's, you them in a place where both could be chased and that actually happened with black.  Afterwhich, white chased, and had a slight edge before any blunders as he had better control of the center.  Now, the main problem is that some of the mistakes that I've seen have been reoccurring, and when this happens you don't learn from the first time.  That's another reason why I really decided to go into depth and get both of you into the big picture which is theory, as well, as everything that goes into the game.  Now, if you can remember these lessons, you both will become much stronger players."
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=54608",
    "gameName": "Let's play chess",
    "players": "hiredgun112 (837) vs. reachforgoals (817)",
    "opening": "Mieses opening (A00)"
}