{
    "moves": {
        "1. e4": "I open with my usual king's pawn.",
        "1... c5": "He replies with sicilian opening.",
        "2. Nf3": "I develop knight, following the sicilian.",
        "2... d6": "Protects pawn, following the sicilian so far.",
        "3. Bb5+": "I check to develop my bishop and pin his knight or exchange bishops.",
        "3... Bd7": "He's in for bishops exchange.",
        "4. Bxd7+": "I go for it.",
        "4... Qxd7": "Recaptures.",
        "5. O-O": "Castle. My king is safe now and I'm ready for taking the lead.",
        "5... Nc6": "Develops knight.",
        "6. d3": "Opening up diagonal for my black color bishop, while protecting the pawn.",
        "6... Nf6": "Develops his knight.",
        "7. Bg5": "Challenging his knight.",
        "7... Nh5": "His knight escapes... not the best place to go, since he's being x-rayed by my Queen and will be en-prise as soon as I remove my f3 knight.",
        "8. Be3": "No point for me to leave my bishop there, I better retract it to attack the central d4.",
        "8... e5": "A blunder... This loses a pawn since I can sacrifice my knight to capture that pawn. If he captures my knight, my queen goes and capture his. If he saves his knight, I captured the pawn and can safely exchange knights... Either way, he loses a pawn.",
        "9. Nxe5": "I go for it. Now my queen is ready to capture his h5 knight... that's why I said it was not the best position for his knight.",
        "9... Nxe5": "He takes the sacrifice.",
        "10. Qxh5": "I recapture and got myself a pawn.",
        "10... g6": "Wants my queen to move.",
        "11. Qe2": "I retract it to this position. Here is safe from knight range, plus, she makes way for me to seize control on the d file I'm about to open.",
        "11... Bg7": "He tries to setup a discovered attack from his black color bishop on my b2 pawn. If I allow it, he'll send his knight practically anywhere he pleases to (maybe to g4, to challenge my bishop), and then, if I capture the knight, he'll capture my b2 pawn and next my rock with his bishop... If I maneouver until then and instead of capturing his knight, I protect b2, then he'll have an extra time for his knight for doing yet another exchange by my bishop... Discovered attacks are difficult to deal with once they've been put into motion. Better prevent them.",
        "12. c3": "By playing c3, he no longer has a way to reach b2 by the means of a discovered attack, so, he won't be able to put his knight anywhere he pleases anymore.",
        "12... b6": "He tries to solidify his pawns structure.",
        "13. d4": "I'm all set for opening the d-file, so I pull the trigger. If he captures my pushed pawn, I capture with bishop and then his knight will be pinned against his bishop until he castles. And once I seize control of the d-file with a rock, also his d pawn will be pinned against his queen. I'll try to exploit all the pins I can to gain the center control and make way for my pawns through the center.",
        "13... Ng4": "He wants to keep me from pinning his knight,  while also preparing to capture my bishop and maybe to do a double attack on h2 once he places his bishop at e5.",
        "14. dxc5": "I see no major threat just yet, so I keep on my plan to open d-file.",
        "14... bxc5": "He recaptures, obviously not with d-pawn, or he will totally lose control on the d-file when I challenge his queen with a rock, and then his queen would be in real problems since she is overloaded also with defending his knight.",
        "15. Rd1": "I take the ready to open d-file. I just pinned his d-pawn against his queen. His c5 pawn is free for me to take now with my bishop. He is compelled to do anything about it.",
        "15... Be5": "He now threatens me with a double attack on h2 by his knight and his bishop. He might take back the pawn I'm ahead, so I won't allow it.",
        "16. h3": "With this move, ne no longer can take the pawn and also I challenge his knight. Whatever plan he has for his knight, he must do it now.",
        "16... Nxe3": "Captures my bishop, of course, that's my most dangerous piece at the moment.",
        "17. Qxe3": "I recapture with queen, this way, I keep his c-pawn en prise once he castles.",
        "17... O-O": "He castles... not the best moment to castle, his c pawn is en prise, since his d-pawn is pinned against his queen. I can take the pawn with my queen for free...",
        "18. Nd2": "But I don't do it. If I capture the pawn, he will get the lead of the game now once he starts challenging my queen with his rocks and he'll start adding pressure over my c and b pawns, since he has a bishop already attacking that diagonal. I better develop mi knight to d2 so I can take it to c4... If I put my knight there, he'll have to deal with my fork over his pinned d pawn and his bishop. Since his d-pawn is pinned, his bishop won't be defended and it will have to abandon e5 and then my knight and rock will outnumber the only defender of d-pawn, the queen.",
        "18... a5": "A mistake, he should have prevented me from taking my knight to c4...",
        "19. Nc4": "So, Nc4 it is. Now, he has 2 choices, retreating his bishop and letting me capture the d pawn with my rock while I put his queen en prise, Or moving the queen aside and let me go for the exchanges while also opening up the d-file. Either way I will open the d-file, which was my original goal.",
        "19... Qb7": "He puts his queen in a place where she will capture a pawn of mine... If I go for the \"free pawn\" and challenge his queen with my knight, she'll recapture b2. I can't use the rock to init the exchanges or I will lose in the exchanges... So I have to take the bishop, so I can have a time to protect my b pawn.",
        "20. Nxe5": "I take the bishop. If he takes the pawn, I'll just retract my bishop to c4 to fork his queen and already attacked d-pawn, so he'll have lost a whole bishop for no reason. He has to deal with my knight first.",
        "20... dxe5": "So he does.",
        "21. b3": "And I use the extra time to protect my b-pawn.",
        "21... Rac8": "His c pawn is en-prise, so he protects it.",
        "22. Rd5": "I fork his c and e pawns with my rock. He must use his queen to defend both, coz c pawn is under double attack from my queen and rock, and e pawn is now attacked by my rock.",
        "22... Qe7": "He protects his pawns.",
        "23. c4": "I take the chance to solidify my pawns structure... THIS is what gave me the winning in this game. Soon you'll see why.",
        "23... Rfd8": "Of course, that rock is giving him a terrible headache, since he can't use 2 of his most important pieces now to defend those pawns. He will want to exchange it badly.",
        "24. Rad1": "I force him to do the rock exchange, or to give me full control of d-file, which will not help him at all.",
        "24... Rxd5": "He goes for the exchanges, of course, but in doing so, he has allowed me to have a passed pawn in the d-file, while also keeping a solid pawn structure...",
        "25. exd5": "So, I capture with my e pawn. See the difference in pawns structures. He has 2 isolated pawns (those will be weaknesses during the rest of the middlegame and once I convert the game into endgame). My pawns are perfectly coordinated and my passed d-pawn is already in the enemy territory...",
        "25... Rd8": "He of course will by all means try to keep me from advancing that passed pawn. But, in doing so, he failed to see that his unprotected queen is being x-rayed by my queen beyond his e pawn. I'll do all I can to disrupt his remaining decent pawn struct and to open up f-file now for me to start pressing on him.",
        "26. f4": "So, I exploit the pinned pawn. He might advance it, but then he would have to play f5 at some point to do a similar structure as mine in the kingside, but with the pawns that were supposed to be used to protect his king. I would use the some of the pawns in my own castle to distroy it and in doing so, shredding any defense he had left and then I would have a complete open area to do all kind of available tactics on a very weakly defended king of his, maybe mating him or gaining material advantage in the process. He might feel compelled to defend the pawn.",
        "26... f6": "So he does. But this will just enable my plans to open the f file.",
        "27. fxe5": "I capture.",
        "27... fxe5": "He recaptures with pawn, of course, he can't afford exchanging queens on this position and with my material advantage, and voilá... An open f file for me to start infiltrating the enemy territory. And the worst thing for him? 3 isolated pawns now.",
        "28. Qe4": "I do a preventive maneouver to keep his pawn from advancing until I can deal with it.",
        "28... Kg7": "He tries to bring his king into action.",
        "29. Rf1": "I seize the open file control.",
        "29... Rf8": "He won't allow it. But, this will make his king move before a waste of time, since whe will have to recapture with his own king, for his queen is busy defending his e pawn.",
        "30. Rxf8": "I go for exchanges.",
        "30... Kxf8": "Recaptures...",
        "31. Kf2": "And I bring my king into action. The idea is bringing my king to e4 so he can gang up with my queen against his e pawn. His king will be too far from the action, or if he tries to come to the defense of that pawn, will enable all sorts of tactics to win pawns and to force queen exchanges in an open area like this. Also I'm luring him to check my king, if he does, I protect mysef with my queen and then queens exchanges will be unavoidable for him.",
        "31... Qd6": "There's not much he can do with his queen. I consider this a waste of time.",
        "32. g4": "I'm not wasting time... I'm closing the back door for his queen to be completely unable to infiltrate my territory while my king goes for his pawn.",
        "32... Kg7": "Not the best place he could put his king out of danger, but then again, there's not much places he can go, so I don't blame him.",
        "33. Ke3": "Almost there, just moving my queen aside and then my king will be blocking the enemy pawn himself while my queen goes to infiltrate the enemy lines and makes way for my d-pawn to promote.",
        "33... h6": "He tries to keep his only non-isolated pawns structure the most solid possible.",
        "34. Qf3": "My queen has now seized control of the open f file, and makes way for my king to go attacking the pawn.",
        "34... g5": "That was not the best, now he'll allow my queen to go to f5 to attack the pawn while also keeping the greep on f-file.",
        "35. Ke4": "But first thing's first. My king blocks his pawn while I go for it.",
        "35... Kh8": "There's nowhere he can escape now from my advance... he tries to lure my queen to check him on positions where she will be captured. Maybe works with a noob... not me.",
        "36. Qf5": "And, that's it, King and queen are both attacking the pawn now, and will take by the means of a check.",
        "36... Qb6": "Guess he thought it was pointless to keep on defending it, and start using his queen to infiltrate my own position via b4-a3. But he won't have time for that.",
        "37. Qxe5+": "I capture and a check.",
        "37... Kh7": "Not much place for him to go.",
        "38. Qe7+": "Yet another check.",
        "38... Kg8": "Again, not much place to escape. But here he'll allow me to do queen's exchange, which of course I will do blinkless.",
        "39. Qe6+": "Fork, now he has to do queens exchange or lose his queen.",
        "39... Qxe6+": "He goes for the exchanges, of course, he has no choice.",
        "40. dxe6": "I recapture.",
        "40... Kf8": "He tries to bring his king to prevent my promotion.",
        "41. Kd5": "I think it was better for me to play Ke5 here. This way if he played Ke7, I would have played Kd5, and he would have to either go back to 8th rank or come to f6. f6 would lose to me playing Kd6, and then Kd7, and then just pushing my pawn to promotion. If he went to the eight rank, I could safely capture his c pawn, and then return again to defend e pawn. But I failed to see that one. I thought I had plenty advantage to forfeit my e pawn and capture c pawn to make way to my c pawn to promote while protecting it with my king from b7.",
        "41... Ke7": "He comes to e7, and then I remember my a-pawn had a free tempo adjusting move at my disposal, which just came handy.",
        "42. a4": "So I use it, and now his turn to move. He has to go go back to 8th rank or allow a sooner promotion of my e pawn by playing Kf6...",
        "42... Ke8": "Of course, he'll prefer to deal with a more delayed promotion.",
        "43. Kxc5": "I capture the pawn.",
        "43... Ke7": "He comes back to challenge my pawn.",
        "44. Kd5": "And I just go back to defend it.",
        "44... Ke8": "He has to fall back to 8th rank.",
        "45. Kd6": "And I make oposition so he keeps himself to the 8th rank.",
        "45... Kd8": "Not much he can do.",
        "46. c5": "I could have played e7+ then he would play e8, I'd lose a time with my c pawn, he would try to do any other legal move than Kf7 left, like h5, and then hxg4. At some point, he would have to play Kf7, then I would just push my king to d7 and promoting my e pawn would be unavoidable, but that would make me chase his king to the h1 corner. So, I'd rather keep the king to the 8th rank while I threat with promoting c pawn, and then, once his king went to c8 to block the promotion, he wouldn't be able to prevent my e pawn promotion, and it would be easier to corner him in a8.",
        "46... Ke8": "He remains in e file, he can't just go to c file or e pawn would promoter egardlessly of whatever else he did.",
        "47. c6": "Pushing the c-pawn.",
        "47... Kd8": "Makes oposition. Whichever pawn I advance now will have to be blocked by the king by going to his rank, and the other will promote.",
        "48. c7+": "So, for me it will be easier to corner him at a8, and I force the king to come to c file, or be mated in the next move.",
        "48... Kc8": "He must play that, no choices or be mated next.",
        "49. e7": "Now e will promote.",
        "49... h5": "He tries to lose tempi.",
        "50. e8=Q+": "I promote, check.",
        "50... Kb7": "Only one place to escape.",
        "51. Qb8+": "Yet another check. My queen, king and pawn are now coordinated to push him to a6, with no other place to go.",
        "51... Ka6": "Only move available.",
        "52. c8=B#": "And since he can't go anywhare, I just need something to attack him. Could be a queen or, in this case, a bishop. Checkmate."
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=42312",
    "gameName": "Let's play chess",
    "players": "meer81 (1617) vs. rawhide3214 (1334)",
    "opening": "Sicilian (B52), Canal-Sokolsky attack, Bronstein gambit"
}