{
    "moves": {
        "1. e4": "Hey everybody this is my first game against my first opponent.\r\n\r\nAs you can see, White plays e4. This is the King's Pawn Opening, the most popular first move for white with professionals and casual players alike. I even play it sometimes.",
        "1... c5": "1. ... c5 is the Sicilian Defense, the most popular move for black to play. However, even though it is the most popular chess opening, very few know how to play it with skill. Including me. By the way, I don't really like playing this opening anymore. Changed my mind since this game. But we play it differently anyway. And we'll see that soon.",
        "2. Nf3": "2. Nf3, white wants to promote his d-pawn to d4 without having to bring his queen out after 2. d4 cxd4 3. Qxd4 Nc6. Instead white tries playing 3. c3 dxc3 4. Nxc3, sacrificing a pawn for early development of the knight on b1. But I believe that this is not a huge advantage in development compared to the pawn lost.",
        "2... d6": "Again, the most popular move to play, I know, predictable, but hey, you learn.\r\n\r\nYou might think that this would be the right time to play 3. Bb5+, and for some people it is, but Black has many choices with 3. ... Nd7, or 3. ... Bd7, or 3. ... Nc6. I'd play 3. ... Nd7 4. d4 Ngf6 5. Nc3 cxd4 6. Qxd4 e5 7. Qd3 h6 8. Be3 Be7, but hey, you know, whatever. ^_^ But it looks good, you know. But as white, you want more than that, you know? You know.",
        "3. Bc4": "This move puzzles me. I almost cringe when I see this. Not because it's kinda noobish, well, yeah it's kinda noobish, but the part that frustrates me is that I can't see how to capitalize on this person's \"mistake\". It seems like a perfectly good opening to me, but then again, how is it?\r\n\r\nUsually the masters say to play 3. d4, but this confuses me. I don't know. I really don't know.",
        "3... Nf6": "Looking at this again, I seem to think 3. ... Nc6 would be better, simply because, I don't know, it feels better.",
        "4. Ng5": "Now this surprised me very muchly. I very don't like this opening if I was white. But since I was black, I'm good with it. White threatens 5. Bxf7+. Easily stopped.",
        "4... e6": "And suddenly white is completely disadvantaged. I really don't know, I just don't know.",
        "5. Nc3": "White develops his knight onto a nice square.",
        "5... h6": "Shunting N off its g5. Pretty unnecessary, I just wanted to feel safe. But I should have just kept developing.",
        "6. Nf3": "The knight returns to his forces ashamed. His morale drops.",
        "6... Bd7": "The Monk gets ready for the Sunday service.",
        "7. h3": "Just an unnecessary pawn nudge. IMHO.",
        "7... Nc6": "Sir Lancelot is knighted, and marches into battle.",
        "8. a3": "Again, not really necessary.",
        "8... Be7": "Pastor John calling for duty.",
        "9. d3": "Only now does White realise he has to start developing his pieces more.",
        "9... O-O": "The King must be safe!",
        "10. O-O": "White is prudent.",
        "10... Qc7": "I ready my queen, looking to capitalize on the b8-h2 diagonal by placing my bishop on d6.",
        "11. Bf4": "White pins my d6 pawn on its spot. Darn! That close!",
        "11... e5": "I just want to move my bishop, OK? Oh, wait. Bad mistake. Now I can't.",
        "12. Bh2": "White retreats. ALL THE WAY!",
        "12... Be6": "I feel like my bishop isn't doing much, so I want to trade it off with that other one. That one over there. No, not that one. THAT one. Really, I could have put my queen on c8 and tried something fancy by sacrificing on h3, but I just wanted the game to be simpler. Quite frankly. I admit.",
        "13. Bd5": "d5 is a very good square to take. He wants to use it to his advantage.",
        "13... Bxd5": "I'm not taking any chances. I am taking the bishop, though.",
        "14. Nxd5": "He decides to take with his Knight.",
        "14... Nxd5": "So I take back, simply because any piece on that square creeps me out.",
        "15. exd5": "He threatens my Knight on c6. I'm quite scared.",
        "15... Nd4": "I move it to a calm place.",
        "16. Nxd4": "He captures.",
        "16... cxd4": "I capture. Note the semi-open c-file. I want to capitalize on that. Rc8, anyone?",
        "17. Rc1": "He anticipates this.",
        "17... Rac8": "By now White should be worrying about my Rook and Queen on the semi-open c-file.",
        "18. Re1": "But he takes little notice.",
        "18... Bg5": "I threaten his Rook on c1. I reckon that 19. f4 would have been better, with 19. ... Bxf4 Bxf4 exf4, or 19. ... exf4. Even though he would have lost a pawn, he would have the open e-file, and it's better than what comes after.",
        "19. Rb1 Qxc2 20. Qxc2 Rxc2 21. Kf1": "Threatens 22. Re2, trying to oust my Rook off the 7th rank.",
        "21... Rfc8": "I back my other rook up.",
        "22. g3": "I think this is preparing for either 22. h4 or 22. f4, both of which were not my concern.",
        "22... Rd2": "I threaten the d3 pawn, but also make way for my Rook on c8. 2 rooks on the 7th rank are very powerful, nearly unstoppable.",
        "23. h4": "Threatening my bishop.",
        "23... Rcc2": "I double up rooks on the 7th rank, so that 24. hxg5 Rxf2+ and White is in trouble.",
        "24. Bg1": "Defending f2.",
        "24... Bf6": "I move my bishop out of threat. Better is 24. ... Bd1, so that I can maneuvre to Bb6 or Ba5, but I didn't want my bishop to get pinned on the back rank.",
        "25. Red1": "Trying to minimise the threat of my rooks on the 7th rank, and also covering the d-pawn.",
        "25... Rcxb2": "I capture a pawn.",
        "26. Ke1": "He should have played 26. Rxd2 or 26. Rxb2, in order to minimise the threat of my rooks.",
        "26... Rxd1+": "I trade in my rook for some strange reason. O right, I'm two pawns up.",
        "27. Kxd1": "And he takes my rook and resigns. I'm sorry, I thought this game would be a lot more interesting. But it seemed so in my head, before I started typing. Ah well, I'll just post it anyway.\r\n\r\nBut I hope you liked my openings analysis :)\r\n\r\nCya all next fall!"
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=32691",
    "gameName": "Let's play chess",
    "players": "rolie1964 (1194) vs. thatbennyguy (1200)",
    "opening": "Sicilian (B50)"
}