{
    "moves": {
        "1. e4 a5 2. d4 d6 3. d5 a4 4. Nc3 a3": "This is a new strategy I worked out and it almost cost me! I've just opened my right flank up. Fortunately it is my minor flank.",
        "5. b3": "Good move by white!",
        "5... h5 6. h4": "He wasn't falling for that again! But it opened his right side and it is going to cost him dearly!",
        "6... c6 7. Nf3 cxd5 8. Nxd5": "Excellent! He is gonna get it now!",
        "8... Qa5+ 9. b4 Qd8": "I made a small mistake there. Not gonna cost me anything though, It was just a waste of time!",
        "10. b5 e6 11. Nf4 Qa5+": "White is probable thinking \"why did I move that pawn, ugh!\"",
        "12. Bd2 Qb6 13. c4": "I think I'm ready to commence my pawn assault!",
        "13... g5 14. hxg5 d5 15. Qc2 dxe4 16. Qxe4 Bc5 17. Qe5": "ooh! I think he's going to regret that move!",
        "17... Bxf2+": "Twang!",
        "18. Ke2 Bg3 19. Qxh8": "Hmmmm that puts me in a in an awkward position now doesn't it? ",
        "19... Qf2+": "Ouch time for white!",
        "20. Kd3 Kf8 21. Be3 Qb2": "I heard him say \"Yikes!\"  and he.....",
        "22. Qxb2": "......did the only thing he could do, he was forced!",
        "22... axb2": "That puts my pawn in a awesome position!",
        "23. Rb1": "The white rook tries to save the day, but....",
        "23... Rxa2": "....so does my rook!",
        "24. Bd4": "White is not in the mood for another easy lose, so he brings out a bishop to cover him!",
        "24... Bxf4": "Well he thought he was doing the right thing!",
        "25. Bxb2 e5 26. Bxe5": "I'm still not sure why he did that, but OK.",
        "26... Bf5+": "Take that....",
        "27. Kd4 Bxe5+": "...and that.",
        "28. Nxe5": "Ow, say good-bye to your rook.",
        "28... Bxb1 29. Rxh5 Ne7 30. Rh8+": "I could have expected better, oh-well!",
        "30... Kg7 31. Rxb8 Nf5+": "Well, it seems to be very evenly matched, excepting a few pawns, but this is were skill kicks in. (And some luck!)",
        "32. Kd5 Rd2+ 33. Kc5 Be4": "White is in trouble because I have three \"active\" attackers to his one(his knight). White's bishop and rook are relatively marooned!",
        "34. g4 Ne3 35. Kb4 Nxf1": "White loses his bishop to gain a better position.",
        "36. c5 Rd4+ 37. Nc4 Bd5 38. Rd8 Rxc4+ 39. Ka5 Rxc5": "BIG mistake on my part!",
        "40. Kb6": "An automatic lose. :( It's just a matter of which piece I don't want to lose.",
        "40... Rc4": "The rook.",
        "41. Rxd5 Ne3": "Ah, that's nice!",
        "42. Rd7 Rb4 43. Rxb7 Rxg4": "Wouldn't want that pawn to get across.",
        "44. Re7 Nd5+": "So long white rook!",
        "45. Kc5 Nxe7 46. b6": "White has a high chance of getting his pawn on b6 across....unless I do something!",
        "46... Rxg5+ 47. Kd6 Nc8+": "Ta-da! Mission completed!",
        "48. Kc7 Rc5+ 49. Kb7": "The white king wanted to protect his pawn.",
        "49... f5": "I think I'll get a queen, it'll make this game finish a little earlier!",
        "50. Ka6 Rc6 51. Kb7 Rxb6+": "I really don't NEED a knight now.",
        "52. Kxc8 Rf6 53. Kc7": "The white king is trapped in my rook bubble!",
        "53... f4": "I wish pawns were just a wee bit faster!",
        "54. Kd7 f3": "You can make it pawn, come on!",
        "55. Kc7 f2": "Jeez! I think I'll take a nap! ",
        "56. Kb7 f1=Q": "Whew, finally!",
        "57. Kc7 Qd3 58. Kb7 Qd7+ 59. Kb8 Rb6+ 60. Ka8 Qb7#": "CHECKMATE! Finally! \nThat was a long game, but I learned a few things, and that is what counts!"
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=37686",
    "gameName": "Let's play chess",
    "players": "bluesboy55 (948) vs. mc-awesome (1164)",
    "opening": "Corn stalk defence (B00)"
}