{
    "moves": {
        "1. b4": "No-one expects the Sokolsky!",
        "1... g6 2. Bb2 Nf6 3. e4": "Taking advantage of the pin on the knight to gain greater control in the centre.",
        "3... Bg7 4. Bc4 c6": "It's hard to understand the rationale for this move.",
        "5. Nf3": "White is aiming for rapid development and a lightning attack on the black king.",
        "5... O-O 6. d3": "The f6-Knight was no longer pinned against loose material.",
        "6... Qb6 7. a3": "7.Qd2 either blocks in the knight or causes it to block in the bishop.",
        "7... Ng4": "Taking advantage of the simultaneous threats - f2 and b2 - , but basically forcing white to take complete control of the centre.",
        "8. d4 Nf6 9. Qd3": "Supporting e4.",
        "9... d6 10. Nc3 Bg4 11. Na4": "White is now aiming for a Q-side pawn phalanx with which to crush resistance.",
        "11... Qc7 12. Bb3 b6": "b5 would be better, leaving the white c-pawn backward.",
        "13. c4 Qb7 14. Nc3": "The knight returns to c3.",
        "14... Nh5 15. Nd2": "Retreating is sensible (otherwise, if it is captured, then white must take with the pawn due to the threat to the d4 pawn), although it leaves the king rather isolated...",
        "15... Bh6": "Preparing the next move.",
        "16. O-O": "Castling right into it.",
        "16... Nf4 17. Qc2": "17.Qg3 is probably better, because white has more defenses in place.",
        "17... Qd7 18. f3": "Black will get a strong attack anyway, so white attempts to reduce the effectiveness of the attack.",
        "18... Bh3 19. gxh3 Qxh3": "Threatning mate in one. White now needs to escape his king to the Q-side, where he is easily strongest.",
        "20. Rf2": "Ndb1 would be a bit thick, undeveloping the knight and weakening f3.",
        "20... Qh5": "Threat ...Nh3+",
        "21. Kf1 Nh3 22. Rg2 Bxd2": "A good way of continuing the attack, although generally is better to avoid exchanges when attacking and/or material down.",
        "23. Qxd2 Qxf3+ 24. Ke1 Qh5": "At this point, it is unclear how successful the attack will be, although it seems not to work; the king is currently trapped, but if the white knight comes over, then his chances look good.",
        "25. Ne2 f6": "...f5 is better, since black must bring the rook into the attack.",
        "26. Ng3": "The attack is basically repulsed, since it is hard for black to maneuvre and the white king will have a clear route to the Q-side.",
        "26... Qh4 27. c5+ Kh8": "27...Kg7 would prevent the coming attack.",
        "28. Bc1": "Planning a counterattack: 29.Qa6 Qxa6 30.Bxa6 Rd8 31.Nh5! wins the exchange, leaving white up a rook for two pawns.",
        "28... Ng5": "With the threat of ...Nf3 , winning the queen, but also threatening e4.",
        "29. Qe3 Qh3 30. Rf2": "Setting up the excellent follow-up.",
        "30... dxc5": "A waste of a move.",
        "31. Qxg5": "Black does not really have the option of not taking the queen now, as 31...cxd4 32.Qa6 leads to a game similar to that given in the notes to white's 28th move but with black down even more material.",
        "31... fxg5 32. Rxf8+": "White's peices are excellently coordinated.",
        "32... Kg7 33. Rg8+": "It is clear tthat the king will be trapped.",
        "33... Kh6": "33...Kf6?? 34.e5#",
        "34. Nf5+": "Sacrifice no.2 is also highly dangerous: 34...gxf5?? 35.Bxg5+  Kh5 36.Bd1+ Qg4 37.Bf4! wipes black's presence off the board.",
        "34... Kh5 35. Bd1+": "Other moves lead to repeats.",
        "35... g4 36. Ng3+": "Better than 36.Rg7?! gxf5 37.Rxh7 , when white ends up only a mere bishop for a pawn.",
        "36... Kh4 37. Rg7": "37.Nf5  Kh5 leads to a repeat. This threatens a royal skewer.",
        "37... h5 38. Rxg6": "A mistake - 38.Nf5+! gxf5 39.Bg5# is the quickest win.",
        "38... Qxh2": "39.Bg5# was threatened.",
        "39. Nf5+ Kh3": "Here comes sacrificial offering no.3!",
        "40. Bxg4+": "This cannot be ignored - 40...Kg2 41.Ra2+ and 42.Bf3(+) wins instantly.",
        "40... hxg4 41. Rh6+ Kg2": "White has won back his queen, but is not satisfied.",
        "42. Ra2+ Kg1": "Black lasts longer after 42...Kf3.",
        "43. Rhxh2": "Mate is inevitable.",
        "43... Nd7 44. Rag2#": "Simple. White had an excellent attack in this game, although he could have mated much quicker than he did."
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=21560",
    "gameName": "Let's play chess",
    "players": "goingdown (1551) vs. extrapaycheck (1559)",
    "opening": "Polish (Sokolsky) opening (A00)"
}