{
    "moves": {
        "1. e4": "For once, I use a standard opening. I like offbeat lines but it's nice to change up.",
        "1... e5 2. Nf3 d6": "Philidor's Defence. If I play correctly, I can get a spatial advantage.",
        "3. d4 d5": "??? My opponent could have done this last move, instead of losing a tempo.",
        "4. dxe5 dxe4 5. Qxd8+": "This denies him the right to castle.",
        "5... Kxd8 6. Ng5 Be6 7. Nxe4": "Now i have a material advantage to go with my positional advantage. If I can develop quickly I can harass the exposed Black King.",
        "7... Bf5 8. Nbc3": "I gain another tempo, developing a piece while he moves his Bishop a second time.",
        "8... Nc6 9. Bf4": "Now I can play O-O-O and seize the open file. If I can move my KB and connect my Rooks I can launch a quick attack in the centre.",
        "9... Nd4 10. O-O-O": "10...P-QB4 is the only move to save the Knight. ",
        "10... Ke8": "This blunder lets me augment my material advantage.",
        "11. Rxd4 Ne7 12. Bb5+": "Now I can activate my KR.",
        "12... c6 13. Bc4": "This move seemed like the best choice. I wanted to pressure the Black KBP.",
        "13... b5 14. Nxb5": "If 14...PxN??? 15 BxP ch is decisive. [15...N-B3 16 BxN ch B-Q2 17 BxR, or 15... B-Q2 16 BxB ch K-Q1 17 B-B6 dis ch, followed by 18 BxR.]",
        "14... Bxe4 15. Nd6+": "The Knight fork wins back the sacrificed piece.",
        "15... Kd7 16. Nxe4+ Kc7 17. e6+": "I am not thinking about a mate, but merely trying to activate my QB. However, Black's King is very exposed.",
        "17... Kb6 18. Rhd1": "Finally! I'm trying to force piece exchanges now. The more wood comes off, the more crushing my material advantage becomes.",
        "18... fxe6 19. Bxe6 Ng6 20. Be3": "Still not thinking about a mate yet, but a discovered check is always nice. ",
        "20... Bc5": "This move confused me. Why would my opponent let me exchange pieces? I'm not about to pass up this invitation.",
        "21. Nxc5 Kxc5": "Off come a pair of pieces. Now for that discovered check... and we'll make it a double.",
        "22. Rd4d5+": "Not a whole lot of room to run. All Black's troubles can be traced back to the faulty Pawn exchange which enabled me on the 5th move to remove his castling privileges. The Black King was never able to find shelter.",
        "22... Kb4 23. Rd1d4#": "The finishing touch."
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=31638",
    "gameName": "Let's play chess",
    "players": "thehellion (1311) vs. gecocr (1249)",
    "opening": "Philidor's defence (C41)"
}