{
    "moves": {
        "1. e4": ".",
        "1... d5 2. Nc3 d4": "putting immediate pressure over white",
        "3. Nce2 g6": "to get the bishop on the main diagonal keeping pressure on the centre from the sides in fashion with the hyper-modern philosophy, overprotecting the pawn with c5 allows some tactics on the main diagonal latter on.",
        "4. b3": "counter-fianchetto usually king side fianchetto is more productive and correct, white may also try the extended fianchetto with Ba3 to profit from the lack of defence of e7",
        "4... Bg7 5. Bb2": "...not the extended fiancheto, the idea is just to oppose black's occupation of the main diagonal a1-h8",
        "5... c5": "over-protection of the d pawn",
        "6. Nf4": "now e5 would be an error as the knight would have a golden outpost in d5, d6 tp prevent Nd5 is also wrong as weakens the dark squares around the king's wing",
        "6... Nf6": "... so if Nd5 the Nxd5 picks a pawn for free",
        "7. Qf3": "Defence of the pawn without the compromise of light squared bishop development",
        "7... Nc6": "prophylactic development against e5, maybe possible Ne5 also",
        "8. Bb5": "pins the knight ",
        "8... Bd7": "again allowing both Ne5 and Nxe5 if needed",
        "9. c3": "? aiming for cxd4 Nxd4 Bxd7 with simplification of the position?  ",
        "9... O-O": "removing the king from the dangerous pin and proving that c3 is a bad idea",
        "10. Qd3": "? puts the queen in the wolf den",
        "10... g5": "forces the knight away from defence of d3 with the idea of playing d3 latter on",
        "11. Nfe2 Ne5": "now wins the bishop with a discovered attack and by forcing the queen to move from the same diagonal:\n\nQg3?? the queen is trapped and forcefully captured by Nxe4 as it has no safe escape squares\nQc2 has Bxb5\nsame as Qb1 Bxb5",
        "12. Qg3": "?? loses the queen to Nxe4",
        "12... Nxe4 13. cxd4": "trying to get more material for his queen white tries to put some more black pieces \"en prise\"",
        "13... Nxg3": "now white has some choices to make, lets count to see the alternatives:\na) Bxd7 loses the rook to Nxh1 but the Zwischenzug Nd3+ forks the king and bishop to win yet another piece a forced sequence after 14.Bxd7?? Nd3+ 15.Kd1 only move 15...Nxb2+ 16.K moves Nxh1 as the b2 knight is temporarily protected by the threat Bxd4 to skewer the rook \n\nb) Nxg3 better from white's point of view, keeps the rook but exchanges the b5 bishop for the e5 knight\n\nc) hxg3 even better as avoids the loss of the rook and opens a column to develop it, simultaneously keeps the knight centralized on e2\n\nd) dxe5 also loses the rook so is worst than hxg3\n\n",
        "14. hxg3 Bxb5": "the position is soon to be opened up so I chose to keep the bishop pair",
        "15. dxe5 Qd5": "to capture e5, and with an eye on g2 also",
        "16. f3": "defends g2",
        "16... Rad8": "Black took it's time to put some more pressure on the soon to be isolated d pawn",
        "17. O-O-O": " ",
        "17... Bxe5": "and now e5 falls, white has two major choices Bxe5 Qxe5 and Nc3 Bxc3",
        "18. g4 c4": "to achieve clearance form the c column or the a4-d1 diagonal",
        "19. b4": "to avoid the opening of the c column, but allows the opening of the diagonal a4-d1",
        "19... Ba4": "so is the diagonal Bax with the idea of Qd3-d2",
        "20. Nc3": "nice try to attack both key pieces of black's attack",
        "20... Bxc3": "the only move, needed to remove the defender",
        "21. Bxc3 Qd3": "the threat is mate in 1 Qc2++",
        "22. Kb2": "forced",
        "22... Qc2+": "and now black will pick the rook for free",
        "23. Ka1 Qxd1+": "removing the last defender, and now 24.Kb2 Qc2+ 25.Ka1 Qc1++ (or 25.Ka3 Bb3 with the idea Qxa2++ and if 26.axb3 Qxb3++) 26.Bb2 to block the queen then 26...b5 to block the b pawn and allow Rd6-a6++ ",
        "24. Kb2 Qc2+ 25. Ka1 Qc1#": "a bad placement of white's rook allowed black to trap her and then on the result was expected"
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=41260",
    "gameName": "Let's play chess",
    "players": "girishthottara (1427) vs. kaspanatola (1200)",
    "opening": "Scandinavian (centre counter) defence (B01)"
}