{
    "moves": {
        "1. e4 e6 2. d4 d5 3. Nc3 Bb4 4. e5 c5 5. a3 Bxc3+ 6. bxc3": "White's two bishops against a bishop and a knight would normally constitute a slight advantage, but here, with the centre closed, the knights are probably more useful.",
        "6... Qc7 7. Qg4 f5 8. Qg3 cxd4 9. cxd4": "White is now left with two weak pawns at a3 and especially c2 (since it is on a semi-open file), so must play aggressively on the kingside in order to win the game before an endgame is reached. If White isn't going to go for an all-out attack he needs to give careful consideration to the most efficient way of defending the c-pawn.",
        "9... Ne7 10. Bd2 O-O 11. Bd3 b6 12. Ne2 Ba6 13. Bxa6": "13.Nf4 seems to be the preferred line (Hort-Petrosian, 1970, continued 13...Qd7 14.Bb4 Rf7 15.h4), but this looks okay. Black's knight is out of the game on a6.",
        "13... Nxa6 14. Qd3": "Is your queen really better placed here? I don't think so. The immediate Nf4 was better. Black will not capture on c2 because he cannot afford to lose the pawn on e6.",
        "14... Nb8 15. Nf4 Qd7 16. O-O": "The logical continuation was 16.c4, putting more pressure on those central pawns. Nothing wrong with 16.0-0 though.",
        "16... Nbc6 17. Rfc1": "This is fine as long as you follow up with 18.c4.  If you just want to protect the pawn, 17.c3 is better.",
        "17... Rfc8 18. Rab1 Nd8 19. Bb4 Nec6 20. a4 Nxb4 21. Rxb4 Nc6 22. Rb2 Na5 23. Qb5 Qe7 24. c3 Rc4": "A mistake. White can now play 25.Nxd5! 24...Nc4 was correct.",
        "25. Rb4 Rc6 26. Rb2 Rac8 27. Rbc2 Kf7 28. Nh3": "A strange move! Surely this knight belongs over the other side of the board.",
        "28... g5 29. f3 h6 30. Qd3 Qc7 31. Qb5 Nc4 32. Ra1 Ne3 33. Rcc1 Rxc3": "The obvious move but not the best. He had to find a way to prevent the perpetual check. If he does, he should have a comfortable win.",
        "34. Rxc3 Qxc3 35. Qd7+ Kf8 36. Qd6+ Kf7 37. Qd7+ Kf8 38. Qd6+": ""
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=15338",
    "gameName": "Let's play chess",
    "players": "veracitus (1200) vs. ostefrec (1200)",
    "opening": "French (C18), Winawer, classical variation"
}