{
    "moves": {
        "1. g3 d5 2. Bg2 e6 3. Nf3 Nf6 4. O-O c5 5. d4 Nbd7 6. b3": "Up to this point it looks like simply developing the pieces. ",
        "6... cxd4": "I see Black side is bit aggressive !",
        "7. Nxd4 Be7 8. Bb2 O-O 9. Nc3 a6 10. a4": "Also I can see that Black side is also having precautions.",
        "10... Bc5 11. Nf3 Qb6 12. e3 Qc6 13. Nh4 b6 14. Re1 Bb7 15. Qd2 Bb4 16. Nf3 Ne4": "Again Black side is trying to attack. ",
        "17. Qd4": "This is a very bad move ! Because Knight at c3 has two defenders including the Queen but three attacks, here also including the Queen. If Knight got moved then it is going to loose the Rook. So, better move the Rook.  ",
        "17... Bxc3 18. Bxc3 Nxc3": "See ! White side lose a piece.",
        "19. Ne5 Nxe5 20. Qxe5 Ne4": "Black knight is trying to get back. Here, better cut the Knight then Black Pawns will be doubled in the e file. May be bit advantage for the White side. ",
        "21. Rac1 Nf6 22. c4 Qe8 23. Red1 Rb8 24. e4 dxc4 25. bxc4": "Black side is moving nicely and trying to get more pieces and it seems it is working.",
        "25... Qxa4": "See ! got another Pawn.",
        "26. Rd4": "Looks like White Rook is trying a discover  attack !",
        "26... Rfd8": "Nice reply !",
        "27. Rxd8+": "White side thinks no option other than cutting Black Rook. May be he could double the Rooks.",
        "27... Rxd8 28. Qc7 Qd7 29. Qxb6 Bxe4 30. c5 Bxg2 31. c6": "Here White made mistake, without getting rid of the Bishop Pawn got pushed and Bishop can remove that Pawn !  ",
        "31... Bxc6 32. Rxc6 Qd1+ 33. Kg2 Qd5+ 34. Kg1 Ne4 35. Rc4 Nd2 36. Rc5 Qa8 37. Rg5": "That's a mistake. He had abandoned the Rook with the Knight to f3.   ",
        "37... Nf3+ 38. Kf1 Nxg5 39. Qe3": "Now it is a mating two. Can you guess the way of doing it?",
        "39... Qh1+ 40. Ke2 Qd1#": "It is done. Black is victorious here ! "
    },
    "url": "https://gameknot.com/annotation.pl/lets-play-chess?gm=37659",
    "gameName": "Let's play chess",
    "players": "aureli77777 (1200) vs. kapila (1313)",
    "opening": "Benko's opening (A00)"
}