{
    "moves": {
        "1. d4": "A positional player ?",
        "1... g6": "As black, I don't have an opening-repertoire.. The only opening I'm used to use, is a sort of Pirc-Modern Defense.. Please correct me if I'm wrong!\r\nThe main idea in this opening-line is to control the center indirectly. You create a space for your king's-bishop, and afterwards, your plan is to attack the center.",
        "2. c4": "According to me, my opponent likes pretty closed games (most 1.d4-players do). By moving up his c-pawn 2 moves, he's aiming directly for the center. Now he has control over my 5th rank.",
        "2... Bg7": "Developing move..",
        "3. Nf3": "According to Fritz, we're playing a sort of Kings Indian..",
        "3... d6": "Making space for my bishop, and indirectly attacking e5 and c5. ",
        "4. Nc3": "Nice developing towards the center.",
        "4... Nd7": "My idea was to play e5, within a few moves.. Mostly, I play 4. Nf6, but after a few losses, I'm trying something else.. ",
        "5. e4": "White is building up a nice pressure towards d5 !",
        "5... e5": "Leaving the choice to white.. Taking on e5 would result in an open game, while d5 would close the gates, and make it a closed game. I was aiming for the latter, simply because closed games are more \"my\" style of playing.",
        "6. d5": "A \"closed\" game it will be ! In meanwhile, my opponent's f-knight is pretty inactive.. ",
        "6... Ngf6": "Preparing to castle.. ",
        "7. b4": "\"c5 is mine, not yours\", was white's way of thinking ! ",
        "7... b6": "Preparation of playing a5.. My purpose is distracting that b-pawn, so c5 would be all mine..",
        "8. Be2": "Developing his light-squared-bishop and preparing to castle kingside. Activating this bishop could go via his kingside, or through a4, which would cost him a couple of moves.",
        "8... a5": "Aiming for that b-pawn.. In a way, I wanted to gain control of c5. If white played 9. bxa5, I would have a nice spot for my knight on c5, and having an open file for my rook! If white would move up his b-pawn one square, I would have the same result.",
        "9. b5": "Gives a closed position (looking to the pawns), but in this case, it was the best move, in my opinion.",
        "9... Nc5": "Home sweet home ! In meanwhile, e4 is attacked twice, so White Player should do something about that !",
        "10. Qc2": "The best move to play, in my opinion. If 10. Bd3, then 10. ... Nfxe4 11. Bxe4 Nxe4 and black was up a pawn.",
        "10... Ke7": "I've been thinking long time on this move.. I know this seems a strange move, but I was aiming for some activity on my kingside. Castling would result in a direct kingside-attack from my opponent. My queenside is pretty closed, so the actions would be best on kingside..",
        "11. O-O": "Ok, the cards are dealt.. Now it's time to come up with a good plan ! I spent pretty much time here.. \r\nMost people gave me this advice: it's better to loose because of time-trouble, but with a GOOD position and a GOOD plan, than to loose with a lousy position and hours on your clock. The only thing you need to learn in the first-mentioned example, is finding a way to think/analyse faster.. ",
        "11... Qf8": "The idea behind this move was to open up my f-file. For example; Ne8, f5, and white has trouble in defending e4..",
        "12. Be3": "Is he planning to exchange his \"good\" bishop against my strong knight ? Actually, he would help me, with exchanging.. Simply by Nf-d7, I could protect my c5-stronghold, and in meanwhile making way for my f-pawn.. Maybe it would be better if he exchanged his f-knight, by playing Nd2 --> Nb3 ?",
        "12... Nfd7": "Winning a tempo, because it was my purpose to play f5 in a while..",
        "13. Nd2": "There he is :) Preparation of f4 ?",
        "13... Bh6": "My bishop was pretty inactive, so it would be great to trade it for a nice white piece.. ",
        "14. Nd1": "Defending his bishop. But after trading of those bishops, it seems to me there's no nice field anymore, for that knight.. So he'll have to retreat his Arabian Horse..",
        "14... Bxe3": "A good trade, if you ask me..",
        "15. Nxe3": "Maybe 15. fxe3 would be another good move, to gain some activity ?",
        "15... h5": "g4 is a nice field for white's knight and/or bishop, so it would be nice if I had that field under control..",
        "16. g3": "He's making a shelter for his knight, wich would help him covering f4, when he plans to play it..",
        "16... Qg7": "Developing move.. The idea behind this move is to get a rook behind my f-pawn.",
        "17. Ng2": "After this, I suspect f4 will come ?",
        "17... Nf6": "Again a double attack on e4, which stays double covered.. But with that covering, 2 pieces are inactive.. ",
        "18. f4": "As expected.. I won't catch it myself, because white can double his rooks by playing 18. ... exf4  19. Rxf4 ... 20. Ra-f1",
        "18... Bh3": "Putting some pressure on white's stronghold.. In meanwhile I'm making room for my a-rook..",
        "19. fxe5": "Opening the whole position.",
        "19... Nfd7": "If white captures on d6, I would regain a nice spot for my knight, on e5. And if white would play a blunder like Rf2, my queen could hunt his a-rook.. A pawn is the cost for it.. ",
        "20. exd6+": "White wants to gain some material, but (for now), he isn't able to get through my pawn-structure..",
        "20... cxd6": "On this way, the pawn-structure stays the same, and is white's d-pawn still blocked..",
        "21. Rad1": "I don't really understand this move.. Maybe it was better to play Rf2, followed by Ra-f1.",
        "21... Ne5": "Knight on outposts ! Keeping busy his knight and queen..",
        "22. Rf2": "Logical move..",
        "22... Bxg2": "A closed pawn-structure asks for knights.. So I want to keep my 2 knights, and give my opponent 1 knight and 1 pretty inactive bishop, for the time being..",
        "23. Kxg2": "Logical..",
        "23... Raf8": "Preparation of f5.",
        "24. Rdf1": "Doubling his rooks. But for now, he hasn't got an object of attack..",
        "24... Ng4": "I played this move with a double purpose: \r\n1: if white slaughters my knight with his bishop, I'll play hxg4, which creates an open h-line for my queen, followed with a (possible) mate-threat.\r\n2: if white doesn't capture my knight, I'll play Ne3, which wins material (Nxc2). Note that white's queen isn't able to protect e3 !",
        "25. Bxg4": "The best move, in my opinion.",
        "25... hxg4": "Opening the h-file.. The doubled-pawn can be solved by playing f5..",
        "26. Qd1": "Since e4 isn't attacked twice anymore, the queen is free to go, and even able to attack g4 !",
        "26... Nd3": "Gaining a tempo, to re-organise my troups. (like Ne5, wich defends g4 nicely)",
        "27. Re2": "Only possible move if he doesn't want to loose a rook..",
        "27... Qh6": "Starting to build up pressure on h2 !",
        "28. Rh1": "More active than Kg1 ! White is still in the possibility to play h3, sooner or later..",
        "28... Ne5": "Covering g4 and attacking c4.",
        "29. Qf1": "The queen is back in action ! Since my queen can't give mate at the moment, I decided to trade queens.. White will loose a move while recapturing my queen, wich gives me time to re-organise..",
        "29... Qh3+": "I'm up a pawn, so it's time to trade some pieces..",
        "30. Kg1": "Kf2 is also possible, but would be followed by 30. ... Nd3+",
        "30... Qxf1+": "Following my plan.. ",
        "31. Kxf1": "31. Nxf1 wouldn't be good, since I would play 31. ... Nxc4",
        "31... f5": "Opening lines ! ",
        "32. exf5": "I don't know for sure, for this move.. Personally, I felt more for Kg2 (making his h-rook active again).",
        "32... gxf5": "Solving up my doubled pawn !",
        "33. Nb3": "Probably with the thought of playing 34. Nd4 and 35. Nc6 ?",
        "33... f4": "Again, opening lines towards the enemy king !",
        "34. gxf4": "One of the best moves.. 34. ... f3 would give me a passed pawn, and 34. ... fxg3+ wouldn't be nice either !",
        "34... Rxf4+": "Action !",
        "35. Kg2": "Finally ! 35. Rf2 would result in 35. ... Rh-f8.",
        "35... Rxc4": "Catching pawns whenever it's possible !",
        "36. Rc1": "Want to trade ? Offcourse ! ",
        "36... Rxc1": "According to our material, we're even.. But still, I like black's position.. His knight and rook are well-placed, while white's pieces will need a few moves to regroup.. ",
        "37. Nxc1": "Only \"good\" move.. After this, he's aiming for 38. Nd3 (attacking my knight twice).",
        "37... Kd7": "I wanted to prevent the double-attack on e5, and also didn't want to leave my b- and d-pawns alone.. ",
        "38. Re4": "Relatively harmless, as long my knights stays on e5.. ",
        "38... Rh3": "Penetrating my enemy's back ranks.. ",
        "39. Ne2": "Leaving alone his a-pawn ? Defending it will cost him the activity of his pieces !",
        "39... Ra3": "40. Nc3 would be a serious blunder, so it has to be 40. Nc1. ",
        "40. Nc1": "The only way to save his a-pawn.",
        "40... Rc3": "Aiming for gaining some material (both b- and d-pawns can be attacked by Rc5, AND his knight is still in danger !)",
        "41. Re1": "White is totally pressed into defending..",
        "41... Rc5": "A double-attack.. ",
        "42. Rd1": "Only possibility.. He can't get to my king through the f-line, and his h-pawn is (temporary) out of play.. ",
        "42... Rxb5": "Sure ! ",
        "43. Nd3": "A serious blunder ! I noticed my opponent (a 82 year-old chess-player with a lot of experience) was getting tired of thinking, and his nerves started to break in the endgame.. \r\nIn my opinion, it was his purpose to trade of our knights.. ",
        "43... Rxd5": "Ouch.. A safe move, since Nxe5+ and Nc5+ would both result in respectively Rxe5 or Rxc5..",
        "44. Nxe5+": "I guess he missed Rxe5, and hoped to win my rook, if 44. ... dxe5 ?! would be played..",
        "44... Rxe5": "After this move, my opponent instantly resigned.. \r\nI really like this game, because it opened my eyes for some tactics, positional play (remember the switching of my knights to c5 and e5 ?), gaining pawns, ...\r\nI hope you people also had some pleasure with watching this game ? Please let me know ! :)\r\nTake care and enjoy your day ! "
    },
    "url": "https://gameknot.com/annotation.pl/lic-round-7?gm=29076",
    "gameName": "LIC Round 7",
    "players": "Jef C. (1656) vs. Geert B (1273)",
    "opening": "Beefeater defence (A40)"
}