{
    "moves": {
        "1. d4 Nf6 2. c4 e6 3. Nc3": "Nimzo-Indian Defense.\n",
        "3... Bb4 4. e3 O-O 5. Nf3 c5 6. Bd3 d5 7. O-O dxc4 8. Bxc4 Nbd7 9. a3 cxd4 10. exd4 Bxc3": "I don't mind fair trades, especially when my opponent had more developed pieces.  Now we are more even, and white's pawns have two gaps.",
        "11. bxc3 Qc7 12. Qe2 b6 13. h3 Bb7": "What I am really thinking is that a5 lets the a rook protect Ba6. [To belabor the obvious, white's queen and rook share a diagonal--beautiful for a pin.]  But that white bishop would have to die first.  Bb7 doesn't help, but clears the back row and exerts some central control.\n",
        "14. Be3 Nd5 15. a4": "Oh goody, undefended pawn.  The exit strategy left something to be desired, however.",
        "15... Nxc3 16. Qd3": "If you attack a piece, know where it is going to go.  Fortunately that Bb7 bishop covers the knight's escape...",
        "16... Ne4 17. d5": "...temporarily.",
        "17... exd5 18. Bxd5 Bxd5 19. Qxd5": "Nice the rooks defend each other.  Black pushes the white queen.",
        "19... Nc3 20. Qd3": "Nc3 was a terrible idea.  White can bring pieces to bear upon the wayward knight, which again has nowhere to go, and black cannot protect it.\n",
        "20... Rac8": "Not going to help.",
        "21. Rac1 Nc5": "I'm resigned to losing the knight, but maybe can pick off a pawn to salve the pain.",
        "22. Qxc3": "Black anticipates more carnage, and covers the b to c pawn from two angles.",
        "22... Qe7 23. Bg5 f6": "Easily parried.",
        "24. Bf4 Qd7": "Let's make white defend the -a- pawn.",
        "25. Rfd1": "No?",
        "25... Qxa4": "Now Bf4 is under threat.",
        "26. Rd4 Qb5 27. Rb4 Qc6 28. Qc4+ Kh8 29. Rd1 Rfe8 30. Qf7 Ne4": "I don't remember why I did this.  White obviously wants to play Rd7, and this encourages that.",
        "31. Re1": "Two rooks on that knight.  Thank goodness the black queen covers it too.  I kept wondering what white had against Qxa7.",
        "31... a5": "So this prevented Qxa7, with the bonus the rook is pushed.",
        "32. Nd4": "Counter threat.  Where is white's opponent going to go?  Black likes Qc3 because it attacks three pieces.",
        "32... Qc3 33. Nf5": "Already down a pawn, Rg8 let's black fork rooks.  I just about threw in the towel here, with mate a single move away.  Then I remembered the queen's original plan.  The king has to move, buying black another turn while evening the material score.",
        "33... Qxe1+ 34. Kh2": "Now we have to stop mate.",
        "34... Reg8": "And the best part is that white must move his remaining rook.  Forking the black rooks with the knight is also an option, but the trade ends up rook/knight for rook.",
        "35. Rxb6": "Time to molest pawns.  Black forks both bishop and rook.",
        "35... Qxf2 36. Be3": "Now the knight is undefended.",
        "36... Qxf5 37. h4 Qe5+ 38. Kg1": "King and rook share a diagonal guarded by the black bishop.  It must be lured away.  Moving the knight out of the way attacks it, allowing the queen to pick off the rook with Qc5+.  I debated about where to move the knight.  Nd6 is too far from the action, though encourages RxNd6.  Black gains two points.  Or white moves the queen (obviously somewhere to protect Rb6) and black plays QxBe3+, scoring three points.\n\nNg5 also threatens the white queen, but if white declines the knight is in a position to check.  Black anticipated Qb3 too, which defends both rook and bishop, but could be countered by Rc3.  I programmed that so I wouldn't forget it.",
        "38... Ng5 39. hxg5 Qxe3+ 40. Kh2": "While Kh2 was pretty obvious, I did not extend the program to Qxb6.  Instead, I woke up in the morning, and spent several minutes examining the board trying to figure out how to put pressure on the white king, before seeing and remembering the obvious.\n",
        "40... Qxb6": ""
    },
    "url": "https://gameknot.com/annotation.pl/lifers-tourney?gm=66764",
    "gameName": "LIFER'S TOURNEY",
    "players": "nemesis1010 (1578) vs. lord_shiva (1774)",
    "opening": "Nimzo-Indian (E50), 4.e3 e8g8, 5.Nf3, without ...d5"
}