{
    "moves": {
        "1. e4": "Hi everyone!\r\n\r\nDing-a-ling!  It's round 2 for the two heavyweights above.  This time Freddy has the black pieces and we get another Sicilian Naijdorf.  This game does, have a happy ending for him.  He gets a High Draw.",
        "1... c5 2. Nf3 d6 3. d4 cxd4 4. Nxd4 Nf6 5. Nc3 a6": "5. ...... a6 - here is the Naijdorf - please see my note to the other Freddy game against Master Albertwall.",
        "6. Be3 e6 7. f3 b5": "7. ....... b5 - now Freddy starts the standard Naijdorf pawn storm on the queenside.",
        "8. g4 h6 9. Qd2 b4": "9....... b4 - now it is Freddy's turn to attack a knight on c3!",
        "10. Nce2": "10. Nce2 - as there is a pawn on e6 going to d5 is not an option here.",
        "10... e5 11. Nb3": "11. Nb3 - now the d4 horsie is driven back.",
        "11... a5 12. Rd1": "12. Rd1 - white piles up on the backward d pawn.  He eschews castling long.  I think he wants to keep his king in the middle for some reason.  It is safe - at least for now.",
        "12... a4": "12. ...... a4 - maybe this is why he decided not to castle long.  The horsie on b3 must retreat again, so Master Albertwall ensures that it has a reasonable square to retreat to.  It must be noted that in Freddy's other game with Albertwall, he put a knight on c1 with the intent to move it to d3 at a convenient moment.",
        "13. Nbc1 Nc6": "13. ...... Nc6 - development.",
        "14. Ng3": "14. Ng3 - this move gives the knight possibilities of hanging out on h5 or f5 should the knight on f6 should move, or if black's lsb moves off the c8-h3 diagonal.  At the moment white will not want to compromise his pawn structure if he does move that knight to those squares.",
        "14... Qa5": "14. ...... Qa5 - this queen move gives additional support to the pawns on a4 and b4.",
        "15. Nf5 Bxf5 16. gxf5": "16. gxf5 - that horsie did move to f5.  Freddy trades bishop for knight but busts up his opponent's pawn structure as compensation.  Freddy must be wary of the open g file, however, because there is a possibility of white putting his heavies on that file and it could be a little dodgy for Freddy if he chooses to castle on the kingside.",
        "16... d5 17. exd5 O-O-O": "17. ......... 0-0-0 - a brave decision from Freddy.  He castles into an open position.  His king is looking very draughty, do you all agree?   I will talk about the second portent of the purpose of castling, it brings a rook to the centre and this rook ensures that Freddy will win back his pawn.  He has got rid of the weak d6 pawn, which, when I have been on the receiving end of a Sicilian Defence have often snaffled it up when playing with people near my own rating bracket.  The knight on c6 cannot be taken as white will drop his queen for rook and knight and the doubleton c pawn will be rounded up and this exchange will be unfavourable to white.  The pawn on d5 is therefore pinned.",
        "18. Bc4": "18. Bc4 - development.  White is threatening d6 which unmasks an attacking battery on the f7 pawn.",
        "18... Nd4 19. O-O": "19. ...... 0-0 white castles kingside onto an open g file.  As black cannot put any heavies on that file the white king seems safe on g1.",
        "19... Nxf5": "19. ....... Nxf5 - Freddy whips off the frontal white f pawn - material is now even.",
        "20. Bf2 Bc5 21. a3 Bxf2+ 22. Rxf2": "22. Rxf2 - bishop trade.  What can Freddy now do about his b pawn though?  He cannot play bxa3 because his queen is hanging on a4.",
        "22... Qb6": "22. ..... Qb6 - answer.",
        "23. Qxb4 Qxb4 24. axb4": "24. axb4 - this queen trade results in Freddy losing a pawn.  To compensate there is a doubleton on the queenside and white has two isolanis on the kingside.",
        "24... Ne3": "24. ....... Ne3 - a knight fork.  The horsie on e3 forks the bishop on c4 and the rook on d1.  Master Albertwall wriggles out of this fork, however, with a check on a6.",
        "25. Ba6+ Kb8 26. Re1 Nfxd5": "26. ..... Nfxd5 - this little sortie with the knight on e3 does ensure that Freddy wins a pawn back.  The pawn on d5 finally drops off.",
        "27. Bb5 Rdc8 28. Bxa4": "28. Bxa4 - the pawn on a4 now falls, however and white has 3 passers on the queenside.  How does Freddy deal with this?  We shall now find out.",
        "28... Rhd8 29. Nd3 f6": "29. ....... f6 - protects his e4 pawn with a fellow pawn.  Freddy has a really nice kingside pawn structure, shame about the queenside!",
        "30. Bb3 g5 31. Rd2 Nf5": "31. ...... Nf5 - this move is about to precipitate some exchanges though, thanks to a discovery on Freddy's other knight on d5.",
        "32. Nxe5 fxe5 33. Rxd5": "33. Rxd5 - now another black pawn drops off.",
        "33... Nd4 34. Rxd8 Rxd8": "34. Rxd8 - rook trade.",
        "35. Kf2": "35. Kf2 - this move allows an interesting minor piece trade.  The trade results in a trippleton on the b file.  ",
        "35... Nxb3 36. cxb3 Rd5": "36. ........ Rd5 - here is the trippleton.  Next move, Freddy will play Rb5 and those 3 pawns look to drop off into that black rook's turrets like juicy ripe apples.  Freddy offers Albertwall a draw and he accepts.  A good result for Master Freddy."
    },
    "url": "https://gameknot.com/annotation.pl/life-near-the-top-of-the-tree-pt-2?gm=23647",
    "gameName": "Life near the Top of the Tree - Pt.2",
    "players": "albertwall (2346) vs. easy19 (2220)",
    "opening": "Sicilian (B90), Najdorf, Byrne (English) attack"
}