{
    "moves": {
        "1. d4": "Using my regular opening, the London System.",
        "1... e6 2. Bf4": "The typical set-up for this opening.",
        "2... d5 3. Nf3 Nc6 4. e3 Nf6 5. a3": "This move was played to prevent a future danger from Nb4 or Bb4+. Actually, white looses a tempo.. Better was 5. c4 or 5. Be2.. ",
        "5... h6 6. c4": "Trying to exchange a center pawn, meanwhile developing my light-squared bishop. If black doesn't capture my c-pawn, my next move would be 7. c5, taking away important fields for black's bishop.",
        "6... Bd6": "Against the London System, this move is played frequently.. Actually, white is willing to exchange those bishops. Most of white's pawns are on dark squares, and black's pawns are on white squares, so in an endgame, white will have the better bishop left.",
        "7. Bxd6 Qxd6": "Normally, players recapture the bishop with the c-pawn, to prevent my f-knight to get a nice outpost on e5.",
        "8. c5 Qe7 9. Bb5 Bd7 10. Qa4": "Here I played a bad move ! Better was to play 10. Nc3 or 10. 0-0.",
        "10... a6": "Sure, attacking my bishop ! The best he could do !",
        "11. Bd3": "d3 is better than e2, because in a while, black will try to play Ne4 !",
        "11... Ne5": "A double-attack ! Black's bishop is aiming at my queen, and blacks knight on e5 is double-attacking my bishop and knight ! ",
        "12. Qd1": "The best defence.",
        "12... Nxd3+ 13. Qxd3 Bb5": "Holding the initiative.",
        "14. Qc2 O-O 15. Nc3": "Hunting that bishop down.. An exchange of pieces would suite me..",
        "15... Bc6 16. Ne5 Qe8 17. O-O Rc8": "I don't really understand why he played this move.. Someone ? Personally, I would've preferred Rb8, which gives an opportunity to start pushing my b-pawn (as black).",
        "18. a4 b6 19. b4 Bb7 20. f3": "Taking away an advanced support point for black's knight on e4. Right now, my knight on c3 has the chance to leave it's spot.",
        "20... a5 21. b5 bxc5 22. dxc5 Nd7": "I don't like this move.. Black hasn't seen the danger coming from 23. Nxd7 Qxd7  24. c6 !\r\nMaybe a better move was 22. ... c6 ? Then white would have the choice to advance his b-pawn, wich makes an open a6-f1-diagonal for black's bishop. If white would play 23. bxc6 Bxc6 24. Nxc6 Rxc6, black should have an attack on white's c-pawn. At least, that's how far I've seen it during the game..",
        "23. Nxd7 Qxd7 24. c6": "Of course !",
        "24... Bxc6 25. bxc6 Qxc6": "White is up a piece, against two pawns for black.. ",
        "26. Rfc1 Qb6": "Black is aiming at my e-pawn..",
        "27. Qd2": "I liked this move more than 27. Kf2. If black now decides to get a rook behind his d-pawn, with the purpose of pushing that pawn ahead, I can prevent this by playing Qd4, and (maybe) forcing the exchange of queens.",
        "27... Rfd8 28. Nb5": "First trying to get a nice outpost for my knight. If black is still willing to push d4, I can easily take that pawn..",
        "28... c6 29. Nd4 c5 30. Rab1": "Winning a tempo, because black's queen must move, before he can capture my knight on d4. My plan was to make more use of the open lines.. At the moment, black has control over the b-line, but that story is finished now !",
        "30... Qa6": "A nice place where the queen can't be chased away from, for the first couple of moves..",
        "31. Nb5": "Re-entering that outpost-place !",
        "31... c4 32. Qc3 f5": "Black's idea is to open some lines against my king.. The rooks and queen can make a quick move to my king-side, and launch an attack over there.",
        "33. Kf2 Kf7 34. Qe5": "Preventing black to get active play.",
        "34... Qb6": "Afterwards, my opponent told me he played this move to challenge me of playing 35. Nc3, so he could offer a queens-exchange.",
        "35. Nc3 Qd6 36. Qxd6": "I accepted this queens-exchange.. For my feeling, I had the better position. Those two extra pawns from my opponent could be neutralized by my knight.. (at least, that's what I hoped for)",
        "36... Rxd6 37. Rb5": "Putting pressure on a5.",
        "37... Ra8 38. Rd1 Kf6": "Centralizing black's king.. ",
        "39. f4": "I wanted to keep black's king away from e5 or g5. Those spots would be highly interesting !",
        "39... g5 40. g3 Kg6": "He's planning to get around the pawns, through h5-g4-...",
        "41. Rd4": "This wasn't the best move to be played.. I wanted to see what black should do now, but maybe a better move was Kf3 or Rd-b1, with the plan to exchange rooks ?",
        "41... Raa6": "Black's intention is playing Rd-b6, meanwhile gaining control over the b-file..",
        "42. Rd1 Kf6 43. Ke2 g4 44. Nxd5+": "This was another weak move.. My plan was 44. Nxd5+ Rxd5 45. Rdxd5 exd5 46. Rxd5 and then winning his c-pawn, wich would give me a better endgame (at least, that's what I thought !!).",
        "44... Rxd5 45. Rdxd5 exd5 46. Rxd5 Rb6": "I haven't seen this one coming, to be honest.. Black threatens to enter my backdoor, and starts chasing my pawns !",
        "47. Rb5": "As far as I could calculate, white would have a passed pawn, ready to queen.. Either the b-pawn (after Rxb5 axb5), or the e-pawn..",
        "47... Rxb5 48. axb5 Ke6 49. Kd2 Kd5 50. e4+ fxe4 51. f5": "There he goes !! Black can't stop both my pawns !!",
        "51... a4": "Going for a queen !",
        "52. f6 Ke6 53. b6 a3 54. Kc2": "I played this one to be sure I could capture his a-pawn.. Both his e-pawn and my b-pawn could promote to queen, but I would be a move earlier, and then could play Qe8+, wich wins his new queen on e1.",
        "54... e3 55. b7 a2 56. Kb2": "My \"loosing\" move !!! Best was to play b8=Q, and then start chasing black's king ! My own fault to throw the win away !",
        "56... e2 57. b8=Q a1=Q+": "A nasty one !! ",
        "58. Kxa1 e1=Q+ 59. Kb2 Qd2+ 60. Kb1 Qd1+ 61. Kb2 Qd2+ 62. Kb1 Qd1+ 63. Kb2": "A draw was agreed, since my opponent -nor I- could find a winning move.. "
    },
    "url": "https://gameknot.com/annotation.pl/limburgse-interclub-ronde-7?gm=36599",
    "gameName": "Limburgse Interclub Ronde 7",
    "players": "Geert (taufiq) (1326) vs. D. Falco (1241)",
    "opening": "Queen's pawn (A40)"
}