{
    "moves": {
        "1. c4": "So he plays the English against the England captain!",
        "1... Nf6": "I give him the chance to go back to more common lines with 2.d4, but he keeps it to an English.",
        "2. g3": "Against a weaker opponent I may have tried to play an Open Sicilian Reversed with e5 and d5, but I didn't fancy trying that against a stronger player.",
        "2... e5": "I stake a claim to some central control",
        "3. Bg2": "He continues logically",
        "3... Nc6": "So I partly block his Bg2",
        "4. Nc3": "He again develops logically",
        "4... d6": "Afterwards I found out that Bb4, Bc5 and g6 were all more popular moves and scored better. However I didn't really know those lines.",
        "5. e4": "This came as a bit of a surprise. He leaves himself with a hole on d4 into which my knight could jump. On the other hand if he can get in d2-d4 he has a strong centre.",
        "5... g6": "So I thought by putting my bishop on g7 may put him off playing d2-d4",
        "6. Nge2": "So he threatens d2-d4. Now in this position, black has played Bg7 71 times and Be6 two times. Now what I played I think is better than Be6 immediately, because I entice him to play f3, which partially blocks his Bg2.",
        "6... Bg4": "So I play this.",
        "7. f3": "He blocks the pin on his knight.",
        "7... Be6": "and I retreat my bishop, hitting the Pc4",
        "8. d3": "Which he protects, postponing d2-d4",
        "8... Bg7": "So I develop",
        "9. Be3": "He develops",
        "9... O-O": "I castle",
        "10. Qd2": "What is he doing? Is he really planning on 0-0-0 and a king side attack. Ok lets prepare for that....",
        "10... a6": "Now 0-0-0 is met by b5 and my attack gets in first.",
        "11. O-O": "So he goes the other way",
        "11... Nh5": "So I plan a sort of King's Indian Defence attack with f7-f5",
        "12. Nd5": "He sticks his knight in an attacking position",
        "12... f5": "So I continue with my plan",
        "13. exf5": "He takes",
        "13... gxf5": "I have to take with the pawn, if Bxf5 or Rxf5 then 14. g4 wins a piece",
        "14. Bg5": "He hits my queen",
        "14... Qd7": "I move my queen",
        "15. f4": "He blocks my f pawn",
        "15... Rae8": "I mobilise my R from a8",
        "16. Rac1": "and one good rook move deserves another.",
        "16... Qf7": "I increase pressure on d5",
        "17. b4": "He starts a queen side push",
        "17... Nf6": "I increase pressure on d5 again, threatening to win a pawn by taking three times on d5",
        "18. Nxf6+": "So he takes",
        "18... Bxf6": "I take back",
        "19. Bxf6": "He takes",
        "19... Qxf6": "I take back",
        "20. b5": "and he continues with his queen side play. Now if I exchange on b5 I can't move my Nc6 without losing a pawn on c7 to his rook on c1. So I have to move my knight immediately. I have only one move, otherwise he can play Bg2xb7",
        "20... Nd8": "So I have to retreat to this square.",
        "21. a4": "So he continues with his queen side play",
        "21... Re7": "So with perhaps either defensive ideas along the 7th rank, or maybe to aggressive duties from g7",
        "22. bxa6": "So he takes",
        "22... bxa6": "I take back",
        "23. Qa5": "He hits a6",
        "23... Bc8": "Which I protect",
        "24. Nc3": "He develops his knight, maybe with ideas of occupying d5 again",
        "24... c6": "So I stop that",
        "25. fxe5": "He takes",
        "25... dxe5": "I take back",
        "26. Ne4": "He takes advantage of a little pin on my f pawn. If fxe4? He has Rf1xQf6",
        "26... Qg6": "So I had to move my queen",
        "27. Nc5": "His knight takes up a powerful post",
        "27... Nb7": "I attack his queen and knight, so he is forced to exchange.",
        "28. Nxb7": "Which he does",
        "28... Bxb7": "I take back",
        "29. Qc5": "He attack my rook",
        "29... Rfe8": "I defend",
        "30. Rce1": "He puts his rook into a more aggressive position",
        "30... Kg7": "Maybe king up for the ending at some stage.",
        "31. d4": "I have to be careful, if I take on d4 he can take my rook on e7",
        "31... Qf6": "So I give more back-up to my pawn",
        "32. Bh3": "He attacks f5",
        "32... Bc8": "I protect",
        "33. dxe5": "He takes",
        "33... Re7xe5": "I recapture",
        "34. Rxe5": "He takes",
        "34... Rxe5": "I take back",
        "35. Qd4": "... and a draw was agreed. Many thanks for reading my annotation. Please rank it with the start system and leave a comment or too. Thanking you in anticipation!"
    },
    "url": "https://gameknot.com/annotation.pl/lincolnshire-v-worcestershire-board-9?gm=43976",
    "gameName": "Lincolnshire v Worcestershire, Board 9",
    "players": "Ivan David (BCF172) vs. Charles Higgie (BCF156)",
    "opening": "English, 1...Nf6 (Anglo-Indian defense) (A15)"
}