{
    "moves": {
        "1. e4 e5 2. Nf3 d6": "Philidor defense, all book so far. I continue with immediately attacking the attempted black fort, a decent plan although if black defends accurately, black can get a good game.",
        "3. d4 exd4": "Black correctly responds, and could have a good game with further accurate responses. However, from here, many inaccuracies begin to accumulate.",
        "4. Nxd4 Bd7": "A slow developing move I rather dislike, and I consider it an inaccuracy even though it's debateable. No real harm at this point.",
        "5. Bc4": "f7 is the first target I will go after. As it turns out, my positioning at a traditional weak point leads to something greater due to black inaccuracies. So far, white is ideally positioning. Developing with clear lines of threat and power positioned towards an objective, while at the same time satisfying the requirements of defense.",
        "5... Nf6": "This move is okay, but other possibities existed too. Perhaps his choice of this move at this time is slightly inaccurate, however. Does it serve a greater purpose? Did black really think I would advance the e pawn in this position? He knows there is no real threat on the e pawn by his developing move. Why would I wish to trade in the center? I don't. Perhaps better was Qf6 or even Qe7 for black at this time. And for white? Next up: a developing move that also protects that pawn.",
        "6. Nc3": "An f pawn move was also a good choice.",
        "6... h6": "Unnecessary and a waste of a tempo. The black bishop could be easily chased with tempo rather than this h pawn move.",
        "7. O-O a6": "I consider this another even bigger inaccuracy than the last, although it could be useful if white neglects to account for it and the safety of his e pawn. I don't plan to not account for it, and if you play a decent opponent, neither will they.",
        "8. a4": "So I decide to account for it. Stopping b5, although f4 was very very strong in this position. In case my opponent survived the tactical threats that f4 would have allowed, I don't want him crashing pawns down on the queenside with tempo.",
        "8... Nc6": "Black seems to realize this, and just develops. Not a bad move here. Fritz says I should trade knights now. Eh, I'd rather...",
        "9. Kh1": "Do this. Prophylactic move. I'm a strong believer in getting the king out of the diagonal opened up by an f pawn advance, something Fritz can't properly recognize way before such a move shows it's benefit. Whether or not trading knights was best, or whether this move turns out to be useful or not to me, I don't lose much doing this now.",
        "9... Ne5": "Another inaccuracy - in my eyes. Here black chooses a continuation that surprised me. Trading with the white knight is what I expected, or some other developing move. The key here is black should play for equality, and then seek the advantage. This move... not sure what it gains other than the tempo by the slight bishop retreat. Which begs the question: is the tempo worth having the black knight there? I don't think so. Perhaps this knight is but on a journey, and could operate on the kingside later, but it's easy to target where it is, and black needs to be careful about threat tactics from white in this position.Black 's setup says castle kingside. Does he?",
        "10. Bb3": "Keeping as many options on the table for that white bishop as I can.",
        "10... Qe7": "And now I think black has made a mistake here; but thinking to castle queenside, so it would seem. At any rate, the queen is not in a good place now, unless black quickly castles, because of the possible white pawn advances with tempo in the center, and the possibility of the rook coming to e1. Black should quickly castle queenside. Having one's queen in front of one's king when that file may open up is nearly always a very bad idea. The other idea behind this move? A discovered attack to win the e pawn will only happen if I allow some threat for the black knight on e5 to move to with the e pawn as yet underprotected. Again, a good opponent won't allow this, and so the drawbacks to black's move in my eyes is worse than the possible benefit. Hence, I call it an inaccuracy.",
        "11. Re1": "Protecting e4 again, and xraying the black queen/king. Of all the moves black has made for a while, he finally chooses one Fritz likes...",
        "11... g5": "g5. There is no way I am just going to allow black to crash those pawns down without my own countering threats. Nf5 was one choice, as was f4, both according to Fritz. But after a brief think I moved the quiet...",
        "12. f3": "...f3. Here I deviate from pure positional concerns and calculations. Because black moved the pawn during play so quickly, a little psychology comes into play here. I suspect he may move that pawn or those kingside pawns again, an expectation based not on what the board shows, but how my opponent has played. But if he does, I immediately recognized the potential my white centralized pawns possess; black could be in for a nasty surprise. Here I really expected a continuing close game in this position, with the black g pawn staying put. Black has made more than few inaccuracies, me a couple; but the position is still tenable for both sides here. But those inaccuracies now, if a mistake is made allowing me to take advantage of them, can be quite costly.",
        "12... g4": "Well it was tenable, but not anymore; here, black can resign. It's not difficult to see, look at the continuations. Crashing down pawns before castling or fully developing is usually not wise, depending on the positional considerations; here, this loses tactically. Note that if I took the pawn, black would gain greatly from it. But did he see what would happen because of his position if I did not? Black needs to castle but has no more time to. So, like a ladder of threats to the black king, I order the knaves to climb it.",
        "13. f4": "1st, the threat on the e5 knight. It's interesting that often really good moves end up being positioned to really take advantage of one's opponent's inaccuracies. If you play games that just seem to flow together good into a winning game, it's likely because you have your pieces in good places on the board to begin with. ;)",
        "13... Ng6": "Black should not be trying to save the knights here; there is worse ahead. I continue...",
        "14. e5": "Black does not want to lose material, but he should just castle...",
        "14... dxe5 15. fxe5 Ng8": "Black could not take the pawn with the knight because of Bf4. And again, should have just castled. But now, even worse is about to happen! Black 's moves lead to...",
        "16. e6": "...and now we see how efficient developing moves of white contrast with black's rather inaccurate opening development because of black's misstep on move 13. With better and more accurate developing moves, black would likely escape with just a poorer position or perhaps something like just a pawn down. But in this game, Fritz gives white a plus ten here. Ouch.",
        "16... fxe6 17. Nxe6": "The best move. Black has no decent defense, and cannot even castle queenside, and will still lose material or be checkmated. The knaves climbed that threat ladder, and now the heavy pieces extract their toll...",
        "17... Bc6": "Ah well. This last blunder born of a desire to not lose material allows mate in one and you bet I don't miss it. It was all the other inaccuracies on black's part that led to this in the first place.",
        "18. Nxc7#": "This 1500 or so rated player would have played far better in a long game than he does here due to the cumulative effect of all of his little inaccuracies that lead to this unfortunate ending for the black army, and the lack of time to really think over a position. Avoidable - of course - with better understanding of positional considerations or more time to think. If you struggle to remember reams of book lines, or calculating more than a few moves ahead - then get really good at understanding the why of moves and positions; you'll be far less likely to go wrong. Chess is really a war of ideas, and one is either right, or wrong. When your idea is better than your opponent's, then of course chances are you' 'll come out ahead. Hope you enjoyed this short game!"
    },
    "url": "https://gameknot.com/annotation.pl/little-inaccuracies-add-up?gm=49717",
    "gameName": "Little inaccuracies add up",
    "players": "Pierre99  vs. anon. 45 year old. ",
    "opening": "Philidor (C41), exchange variation"
}