{
    "moves": {
        "1. a3": "My opp thinks I'll be dislodged by such a first move, but it was not the case.",
        "1... d5 2. c3 c5 3. d4 c4 4. Bf4 Nc6 5. e3": "As white, I'd play Nd2 to try to break inmediately with e4, but he likes the London with a lost tempo on a6. The London is my favourite as white, so I know a little about it. ",
        "5... Bf5 6. Nd2 Nf6": "I have to avoid e4 wihtout my d4 pawn.",
        "7. Ngf3 e6 8. Be2": "This is the move I always try NOT to play. It is just passive developement, with no target nor scope, aside from castling... and let me play what I want. ",
        "8... h6": "My pawns needed this tempo. Again, my style is not Be7, 0-0. ",
        "9. O-O Nh5": "I wanted to get rid of his dsb, so to make my own much stronger. He cand play the Nf3 to e5, right, but this is not such a great danger. I'll just leave it there.",
        "10. Be5": "Here, I was pretty much tempted to play NxB, or f6. But I sensed some danger in it. I want my Nc6 to stay there, controlling the e5 square, and f6 leaves my Nh5 without squares, and after fxBe5, BxN check is coming. No way. ",
        "10... Nf6": "So it's now his turn to push his Kside pawns up. But he castled this side, so...",
        "11. Bxf6": "He playd this, instead. Now I can take with the g pawn, opening a column on his K, and then Rg8 and Bh3. But he will have Re1 and Nh4, with no harm. So...",
        "11... Qxf6": "Another good square for my Q is b6, but frankly, it's again a balanced attack, he can defend. Now, this move has a downside I didn't consider during the game: it allows e4. ",
        "12. Qa4": "...but he goes for this, instead. a6 can be good, then b5. But this means Ne5 from his side, with strong attack due to the pinned N. I had to play a6, and if Ne5, Rc8. Then Rc7, so to be able to kick the Q with b5. Too long. He can also push b4.",
        "12... Bd6": "Now I do plan to castle asap. If Ne5, BxN and I win a pawn. ",
        "13. b4": "Here it comes.",
        "13... O-O 14. b5 Ne7": "The \"zen\" defence: what is his attack on this side, now? The only way for him to progress is by saccing the pawn in b6, but I'll take it and if Qd7, Bxa3. ",
        "15. Ne1": "Maybe planning f4, maybe to try to get the N into my Qside via Nc2. If I exchange my lsb for it, my chances of attacking his K are fewer. ",
        "15... Qg6": "I threat now to win the exchange after the known Bh3 threat. True is that Qg5 instead allowed my Ne7 a square to ge, now, white do has b6, then Qd7, and I'm forced to play Nc8, after which Qxb7. This also stops his N to go to c2. ",
        "16. f4": "This allows Rf2 if I play Bh3 right now, and my attack freezes. I can play Be4 here, since if NxB, QxN and I threaten e3. But he can interpose whatever he wants on f3, so there is no point in it. ",
        "16... Nc8": "Finding no useful way to attack, I felt I had to push his Q out of there, and maybe think about Be7 and Nd6, to Ne4. ",
        "17. Nef3": "He can set a N on e5, and I'll have to take it with my dsb, which leaves him with a strong central pawn chain... but it will be hard for him to break in. ",
        "17... Nb6 18. Qa5": "Where do you want to go with this Q? It is doing nothing, there! Qd1 was much better. I can chase it with Bc2, but Qe1 and I just help him making it more useful.",
        "18... Bd3": "Now I had a plan. If he takes, I'll make room for my N, which will become active. ",
        "19. Nh4": "Ok, be welcomed. ",
        "19... Qf6 20. Bxd3": "If I had played Qh7, he couldnt have taken this, true, or QxB and e3 and the N can be taken. ",
        "20... cxd3 21. Nhf3 Nc4": "But now I am threatening the Q AND e3!",
        "22. Qa4": "If he takes the N, I'll build a strong pawn chain with one passed pawn on the 3rd rank in it, and nothing that can seriously threat his base (c4).\n",
        "22... Nxe3 23. Rfe1 Nc2": "Wunderbar! I was getting a serious advantage, here!",
        "24. Ne5": "He threats Nd7. I was so foolish...",
        "24... Qxf4": "Getting rid of the counterfork, without realizing... ",
        "25. Nxd3": "OUCH! From winning the exchange to lose a piece! For nothing?",
        "25... Qh4": "Its not mate, but it's a serious check. ",
        "26. Qxc2": "Nf3 was enough to win. But he got greedy, underestimating my attack. ",
        "26... Qxh2+": "Bxh2+, Kf1, and I can't see a real progress after it. ",
        "27. Kf1 Bg3": "NOw I'm threatening g2, and he can't play Re2 or Qh1#.",
        "28. Reb1": "Nf2 was the move, but he wants to keep his attack on the Qside at all costs... so it will be!",
        "28... Qh1+ 29. Ke2 Qxg2+ 30. Ke3": "Kd1 was better. Now, I have to get another piece into the attack. g5, for Bg5+, is not enough. But a Rook is another story!",
        "30... f5 31. Ne5": "He still thinks he can attack me or what? ",
        "31... f4+ 32. Kd3": "He was making room for his K. Nice, but...",
        "32... f3": "Now, if Nxpawn, I'll exchange my R for the two N, and then the other will come in. ",
        "33. Rbg1": "...but he fails to see the obvious. It doesn't happen to me only!",
        "33... Qe2#": "Thank you for reading!"
    },
    "url": "https://gameknot.com/annotation.pl/live-chess-chess-com?gm=63888",
    "gameName": "Live Chess, Chess.com",
    "players": "Slonodav (1600) vs. damafi (1578)",
    "opening": "Anderssen's opening (A00)"
}