{
    "moves": {
        "1. e4 e5 2. a3": "Mengarini's opening? Never seen before, it looks awkward, doesn't follow any opening principle, seems a lose of tempo hence White's initial advantage.",
        "2... Nf6 3. d3 Nc6 4. h3": "weird...",
        "4... d5 5. exd5 Nxd5 6. Nf3 Bc5 7. Be2 O-O 8. Bg5": "Attacking the queen",
        "8... Be7": "Offering a bishop trade for the control of e-file with the queen",
        "9. Bd2": "Doesn't accept the trade...",
        "9... Nd4": "By principle this is not correct as I should have fully developed before jumping towards enemy's line",
        "10. Nxd4": "The knight trade allowed for an open file that will be a central theme on this game",
        "10... exd4 11. Bf3 Re8": "Taking control of the open file and threatening with a discovered check",
        "12. Be4": "Closing the threat but allowing a nasty pin",
        "12... Bg5": "This was a mistake, although the white bishop is pinned he could neutralize it by simply castling, then the bishop in g5 wont get any advantage.",
        "13. Qh5": "Blunder!! It probably seemed a good idea to double attack Black's bishop while threatening check with Qxh7+ but this attack hasn't the necessary steam and as we'll soon see White's light bishop is lost.",
        "13... Bxd2+": "I know light White's bishop is lost and has nowhere to go while is pinned. A good idea when you have material advantage is to trade pieces to simplifly, this Bishop trade was possible thanks to the check, otherwise would follow a dangerous check with Qxh7.",
        "14. Nxd2 g6": "Is time to ask White's queen what's going on",
        "15. Qf3 f5": "There is, Bishop is gone, but not before a desperate defence",
        "16. c4 dxc3 e.p. 17. bxc3 Nxc3": "Bishop can wait. Who can deny a free lunch?",
        "18. Rc1 fxe4": "Bishop's time.",
        "19. dxe4": "Interesting position, black Knight is attacked twice and look's like lost, but it has an elegant farewell that unfortunatly I didn't see it until the move was done.",
        "19... Nb5": "So bad... Solution was 19...Nxe4!, then after 20. Nxe4 would follow 20... Qd5 winning back the knight offering a queen exchange",
        "20. Qb3+": "Obvious. Taking advantage of my blunder.",
        "20... Kh8 21. Qxb5": "Material is again equal, so the fight continues.",
        "21... c6 22. Qb2+ Kg8 23. O-O": "Castled, better later than never.",
        "23... Be6": "Defending the diagonal, now the King should be safe.",
        "24. Nf3 Qe7": "Connecting the rooks",
        "25. Rfe1": "Supporting the passed pawn",
        "25... Rad8": "Taking control of d-file",
        "26. e5": "Advancing the passed pawn, strongly defended.",
        "26... Rd3": "Pawn hunting",
        "27. Qe2 Qxa3": "Hunted! Now there are three passed pawns on the queen side but they are far away for promoting",
        "28. Ng5": "The knight is taking some action attacking the bishop while thretening h7 square for a dreamed mate",
        "28... Bd5": "I feel that the Bishop is still usefull and stronger than the Knight as the position is quite open.",
        "29. Qg4": "White queen has no good intentions",
        "29... Qf8": "Back home to defend the King",
        "30. Qd7": "If the turn where for White, Qxh7 would be the end but move is for black.",
        "30... Re7": "Throwing away the queen.",
        "31. Qg4 Rd2": "Taking control of the 2nd rank. Although a pawn less White has some defence chances, he should be thinking on trade Knight for Bishop, then push further his passed pawn.",
        "32. Qh4": "Defending f2",
        "32... h6": "Throwing away that Knight.",
        "33. Nf3": "Blunder!! He should offered a cleaner trade with Ke4, now he will lose another pawn reducing the chances if any.",
        "33... Bxf3 34. gxf3 Qxf3 35. Qc4+": "Spite check. It seems better to make retreat Black's queen with Re3 then try ro advance f pawn. BTW if greedy enough for 35. Qxh6, mate in 2 would follow with 35... Qxf2+ 36.Kh1 Qxg2#",
        "35... Rf7": "Threatening mate if not properly defended",
        "36. Qf1": "No good, this allows three major pieces on f file with mate shortly.",
        "36... Rxf2 37. Qxf2": "What else?",
        "37... Qxf2+ 38. Kh1 Rf3 39. Reg1 Rxh3#": "Game over."
    },
    "url": "https://gameknot.com/annotation.pl/live-chess-chess-com?gm=51437",
    "gameName": "Live Chess, Chess.com",
    "players": "aimanako (1154) vs. DarkPawn8 (1223)",
    "opening": "KP (C20), Mengarini's opening"
}