{
    "moves": {
        "1. e4 e5 2. Nf3 Nc6 3. Bc4 Bc5 4. c3 Bb6": "A mesma linha, como na antiga continuação 4... De7 5.c3 Bb6, etc. Mas aqui há uma sutil melhoria, pois se agora as brancas respondem com 5.d3 em vez de 5.d4 as pretas não precisam mobilizar sua dama para a \"superproteção\" do peão de e5. ",
        "5. d4 Qe7 6. O-O Nf6": "Outro refinamento da abertura e mais enérgico que 6....d6. Agora as brancas te que tomar medidas para proteger seu peão em e4 e isso diminui suas perspectivas de ataque.",
        "7. Re1": "Um continuação mais viva aqui é 7.Bg5. O Lance 7.dxe5 simplifica muito o jogo, enquanto 7.d5 Cb8 resulta numa posição congestionada.",
        "7... d6 8. a4 a6 9. h3": "Depois do enérgico 8.a4, este último movimento mostra uma preocupação excessiva e poderia provocar fraquezas na ala do rei. Uma continuação ambiciosa seria 9. Ca3.",
        "9... O-O 10. Bg5 h6 11. Be3": "Aqui existe uma cilada. Se agora Cxe4 então as brancas ganham uma peça com d5!",
        "11... Qd8": "Após ter cumprido a missão de proteger seu peão do rei, a dama retrocede deixando livre a casa e7 para o Cc6 (12.d5 Ce7).",
        "12. Bd3": "Aqui as brancas tinha a possibilidade de simplificar o jogo com 12.dxe5 Cxe5 13.Cxe5 dxe5 14.Bxb6 cxb6 15.De2 etc com chances iguais.",
        "12... Re8 13. Nbd2 Ba7": "Um nova manobra preventiva. O bispo não somente antecipa um 14. Cc4 mas também um 14.d5, seguido de 15. Bxb6 por meio do qual a estrutura de peões das negras estaria deteriorada.",
        "14. Qc2 exd4 15. Nxd4": "Se 15.cxd4 então 15...Cb4",
        "15... Ne5 16. Bf1": "Melhor do que esse recuo total seria 16.Be2.",
        "16... d5": "Depois dessa investida no centro, as pretas assumem a iniciativa.",
        "17. Rad1": "Se 17.f4 Cg6 18.e5 Ch5, com vantagem negra.",
        "17... c5 18. Nd4b3 Qc7 19. Bf4": "Tarrasch espera com esse lance realizar trocas de peças para aliviar a tensão.",
        "19... Nf3+": "Bem jogado, pois alem de concentrar as peças na ala do rei, o sacrifício de peão está bem fundamentado.",
        "20. Nxf3 Qxf4 21. exd5": "Tarrasch aceita o citado peão e não teme 21...Bxh3 22.gxh3 Dxf3 23.Bg2 e as brancas teriam um boa posição. ",
        "21... Bf5": "A ideia por detrás dessa manobra é tirar o bispo de f1 de seu posto de observação e somente então atacar o rei sem proteção.",
        "22. Bd3": "Melhor seria oferecer a troca de damas com 22. Dd2 ou 22. Dc1.",
        "22... Bxh3": "Ameaça agora 23...Bxg2 seguido de 24...Dg4+",
        "23. gxh3": "23.Dd2 oferece mais resistência.",
        "23... Qxf3 24. Rxe8+": "Jogando 24. Bf1 as pretas responderiam com 24...Txe1+ 25. Txe1 Dxd5 as brancas perderiam um peão mas teriam evitado a catástrofe que aconteceu na partida. ",
        "24... Rxe8 25. Bf1 Re5": "O Ataque frontal é decisivo.",
        "26. c4 Rg5+ 27. Kh2 Ng4+": "Brilhante!",
        "28. hxg4": "Depois de 28. Rg1 tem mate em dois com 28...Cxf2+",
        "28... Rxg4 29. Bh3 Rh4": ""
    },
    "url": "https://gameknot.com/annotation.pl/livro-500-master-games-of-chess-tartakower?gm=65613",
    "gameName": "Livro 500 Master Games of Chess - Tartakower",
    "players": "Tarrasch  vs. Alekhine ",
    "opening": "Giuoco Piano (C53)"
}