{
    "moves": {
        "1. d4": "Somebody made a theorical mistake in the opening, since the game soon desappears from the database. Anyway, a tactically interesting opening. ",
        "1... Nf6 2. Nf3 g6 3. c3 Bg7 4. Bf4 d6 5. h3 O-O 6. g4": "I bet this is the move that make come out of the databases this game... I am stopping the black bishop to go to f5 (in which it is very, very strong), but I am practically weakening my kingside... and my castle's safety. ",
        "6... Nbd7 7. Nbd2 c5": "Early c4 for black. It is good? Only theory will say, our game is too unrated to be considered into the \"interesting\" ones :-)",
        "8. e4": "In my experience, this move is necessary. I cannot allow the full strenght of his bishop, once in b7. I had very bad experiences about this. ",
        "8... cxd4": "NOW it becomes interesting. Of course, not Nxd4, 9. e5 - and there is no compensation for the piece. \nNot to take the pawn will be as weakening the black diagonal, well covered by his bishop, so... ",
        "9. cxd4": "At this point, the only play I analyzed was the apparently good 9. ..., Qb6, with a threat and a half over my pawns. I have many possible responses, here. \n\n10. Qb3 fails to QxQ. \n10. Qc2 seems normal, ok. \n\nThen, the nice ones: \n10. d5.\n10. e5. \n10. Nc4. \n\nNow, this is what I like from chess: in 2 moves, we have transformed an apparently normal opening, in a highly tactical game. \nI have to consider all possible move from black, including knight f6's sacrifice, in order to be sure. \n\n10. d5, apparently, opens the way to the bishop. But if the bishop takes b2, Rb1 is strong, and if 10. ..., Qxb2, 11. Nc4 puts the black queen in troubles, that white can take advantage of with more developement (and to counterarrest the threat on the black diagonal). The queen's check Qb4 is good for me, since Bd2 closes the net, and if Qb5, Nxd6 must be considered... all very long variants. And, beside, I have to think about Nxd6!?, but I have to bet I'll never would have to take the bishop, of course (not to let his rooks to come into the game). I found it good in all variants, but still it is very dangerous. \n\n10. e5. The best response for black is Nd5. I analyzed dxe, dxe, and it doesn't seem to make a great difference. Not sure. Ok, let's say Nd5.\n11. Nc4, and the black queen must retire. The lines from Qb4+ or Qb5 are very similar to the ones seen before, but again, they are a lot of variant and I cannot be sure all my analysis is correct. \nThen, the other possible moves are Qc7 (I would have played Rc1 inmediately), or Qd8. And this cannot be good for black. I analyzed so many variants here... but it's ok for me. \n\nOk, but since Nc4 is played in both variants, why not to play it right now?\n10. Nc4.\nNow, themes are similar to the previous, but I don't have to cope with Nd5, with a bothering threat over my bishop. So, this is the move. \n\nBut I can say it now, not at the moment I made the play. All this was just a jungle in my mind... :-)\n\nI've set a conditional move, here, and I don't remember by now which it is, so I hope I have played the last one, Nc4. \n\n\n",
        "9... e5": "Black chooses another one.",
        "10. Bg5 Qb6": "And now, I gave up and didn't analyzed much more. ",
        "11. Nc4 Qc7 12. dxe5 dxe5 13. Nd6 Nc5 14. Rc1 Rd8 15. b4": "Do you realize the tide of variants involved? It's amazing. ",
        "15... Rxd6 16. Qc2 Nfxe4 17. bxc5 Rd4 18. Nxd4 Nxg5 19. Nb3 e4 20. Be2 Bd7 21. Qd2 Nf3+ 22. Bxf3 exf3 23. O-O": "So I escaped from all danger, and stay with a quality... better than I thought. ",
        "23... Bc6 24. Qd6 Qxd6 25. cxd6 Rd8 26. Rfd1 Be5 27. Na5": "I decided I couldn't save my pawn, so I decided to take another one. Not so good, but better than nothing. ",
        "27... Rxd6 28. Rxd6 Bxd6 29. Nxc6 bxc6 30. Rxc6 Bb4": "Now, f3 is mine, too.",
        "31. Rf6 Be7 32. Rxf3 Bc5 33. Rc3 Bd4 34. Rc7 Bb6 35. Rd7 h6 36. Kg2 a5 37. Kg3 a4 38. f4 a3": "I shouldn't leave his pawn to reach a3, but it was too difficult to me to figure that out. ",
        "39. Kf3 Bc5 40. Ke4 Kg7 41. f5 Kf6 42. Rc7 gxf5+ 43. gxf5 Bb4 44. h4 h5 45. Rc6+ Kg7 46. Rc2 f6 47. Rg2+ Kf7 48. Rg3 Bd6 49. Rg6 Be5 50. Rh6 Kg7": "I realized now I couldn't take the h pawn, since my rook will become trapped. ",
        "51. Rg6+ Kf7 52. Kd3 Bd6 53. Rg1 Bc5 54. Rg3": "My king is blocking my action over the a3 pawn. ",
        "54... Bf2 55. Rf3": "I tried to exchange pawns on h column, and win by exchanging my rook for his bishop in f3. But it didn't worked.",
        "55... Bxh4 56. Rh3 Bg5 57. Rxh5 Ke7 58. Kd4": "I must avoid him to take my a2 pawn. I failed. ",
        "58... Kd6 59. Rh8 Bc1 60. Ra8 Bb2+ 61. Ke4 Kc6 62. Ra6+ Kc5 63. Kf4": "I thought my only chanche was to take the f6 pawn and get to queen before him, but he played very well. ",
        "63... Kd5 64. Kg4 Ke5 65. Ra5+ Ke4 66. Kh5 Kd3 67. Kg6 Kc2": "I blundered here, and I lost a very important tempo. ",
        "68. Rc5+ Kb1 69. Rc6 Kxa2 70. Ra6": "SO it was a draw position. "
    },
    "url": "https://gameknot.com/annotation.pl/london-tactic-midgame-drawn?gm=23113",
    "gameName": "London, tactic midgame, drawn",
    "players": "damalfi (1724) vs. insuk (1678)",
    "opening": "King's Indian (A48), East Indian defence"
}