{
    "moves": {
        "1. d4": "I lost for a blunder, but till it, it was a very interesting game.",
        "1... d5 2. Nf3 Nc6 3. Bf4 Bf5 4. e3 f6 5. Nh4": "it's almost incredible, but from here I have tactical resources, due to the queen's check in h5. ",
        "5... Qd7 6. Nxf5 Qxf5 7. Bd3 Qe6 8. Qh5+": "Maybe I had to consider g4, taking advantage on the uneasy position of his queen. ",
        "8... Qf7": "The only one. g6, Bxg6.",
        "9. Qxf7+ Kxf7 10. Bxc7": "The bishop can escape, with a somewhat uneasy position, but he can't trap it. Not a great advantage, but better than nothing. ",
        "10... e6": "I feared e5, trying to trap the bishop. I could have saved it, but it would have costed me a slight inferior position, and the bishop pair (e5, 11. dxe, dxe, 12. Bb5 or 12. f4). ",
        "11. a3": "I must protect myself from Nb4, losing the bishop pair. ",
        "11... Rc8 12. Bg3 h5 13. h4": "I think this was better than f3, since it keeps control over the black diagonal, making impossible for him Bd6 - his natural developement move. Of course, Be7 is still possible, but this bishop, there, is passive. ",
        "13... Nh6": "Ok, now, this is one of this situations in which long-term analysis must be performed, and I don't have a clear plan. Very difficult. The ideas can be: \n14. f3, preventing the N to go to g4 (but... is this N a threat, there?). If Nf5, I can play Bf4, since he cannot threat it with his pawns, since the N would be hanging. I will lose the bishop pair, but I will win some other pawn. But I cannot stop Nf5 - Bd6.\n14. Nc3, developing and making him harder to push e5. With Nf5, he allows his bishop to d6, thus exchanging it with mine. And the only way I have to stop it is BxN, but this is ugly, even if he gets a doubled pawn (not easy to take advantage of it). ",
        "14. Nc3 a6": "Ok, blocks my knight, or I go in through a4-b6 but... to where? I dind't find it a great plan. \nSo, the best plan maybe was Kd7, and push the central pawns e4, f4... but I feared to get only a blocked center or, worse, an open column it was not completely clear to whom would have been an advantage to. \nSo I went to another direction, among the many possible (e. g. o-o-o): b4, pushing and try to get advantage of the weakness of his 7º rank, due to the bad collocation of his pieces. This one I eventually reached, but probably a move too late, since I played the knight in order to go e2-f4 to support an incursion in g6, either by the bishop or the knight. Another plan...",
        "15. Ne2 Ng4": "Ok, now I forget my previous plan, and lose a tempo by moving the King. Now, the \"incursion\" in g6 is really a desiderable objective? I must admit I didn't \"do the homework\", I still don't know. To change my knight for the bishop in f8 was a favour to him, so I must be sure to get something more from it, and I wasn't. ",
        "16. Kd2 f5 17. b4": "Now I \"see the light\". A little late, maybe. ",
        "17... Be7": "Time losses due to his \"mistake\": not to have placed the knight in f5, instead, in order to get one of my bishop changed, either with his knight or with his bishop, a liberatory change for black. But to that plan I had some resource, still a good try for him. ",
        "18. b5 axb5 19. Bxb5 Nf6": "To change or not to change (BxN, of course), this is the question. \nIf he re-takes by rook, I can make pressure over the b7 pawn with more easyness than him can defend it, and if b7xB, my a pawn is free. But I lose my bishop pair, a major advantage. It's worthwile?\nFor now, I must defend from the knight jumps, so I lose a tempo in return to his previous one. ",
        "20. f3 Ne8": "Ah, now I see his plan. Pretty good. Now, I will lose my bishop pair, since I must take the knight with my beloved g3 bishop, or I would have had problems pushing my a pawn, with so many black pieces around there. I analyzed some variants leaving his knight in d6 and I didn't see a victory, so I came back to the previous \"exchange\" plan. But, again, with a \"detour\". ",
        "21. Rhb1": "I decided all the game will be decided over the a and b column. This is my plan now. A pretty extrange plan for this kind of opening, but... it came this way, folks!",
        "21... Nd6 22. Bxd6": "Necessary anyway, in order to threaten the b7 pawn after the exchange.",
        "22... Bxd6 23. Bxc6": "And now goes the second bishop! Oh, my God, am I sure? What have I done? :-))",
        "23... bxc6": "AH!, So, he must stop my a pawn! That's good, this brings me the initiative. But it is very easy to lose this pawn, I must be very careful!\n\nNow: to check or not to check? What do I get from it? \nMaybe nothing. The truth is that Rb2 in order to double rooks seemed somewhat weak to me. Just it. ",
        "24. Rb7+ Kf6 25. a4": "Now, I started the advance, with doubts. \nCouriousely, I saw that Rb6, in order to \"block\" his rooks, didn't worked because of Bc7, and I cannot take the pawn because of Ba5+, winning the rook. So Rc6 is a bad plan. Uh ok, what other plan do I have? To advance the pawn, of course. ",
        "25... Rcb8": "Rd7 doesn't work because Bb4+ and then (whatever I move), Ba5 blocking the pawn, and while I try to unblock the situation, the black king has time to go to the queenside. ",
        "26. Rxb8 Rxb8": "I left him the b column... this is really risky. ",
        "27. a5 Ra8 28. a6": "In white square, but very far from my king. It doesn't look so good. ",
        "28... Ke7": "Can I stop it? Or must I go for Kf4, threatening his pawns? But this is a very passive plan. After BxN, black can go with his king, and I have to look for some counterplay on the kingside, but this is really difficult, even with some \"tempos\". If I go into the center, he can even allow my pawn to go to e5, and just retire the bishop on the a3-f8 diagonal, and I am almost blocked. \nSo I went for a surprising one: ",
        "29. Nc3": "A \"magical\" trap.\n29.\t..., Kd8 (the King MUST go to d8 instead of d7 because of: \n30. Na4, and the black King cannot go closer to the pawn, and if the rook takes the pawn, \n30. ..., Rxa6, \n31. Nf5+ wins a neat quality.\nBut to try to avoid it by Kd8 fails, for instance to: \n30.\tKd3, Kc8\n31.\te3xe4\t, Kb8\n32.\te4xd5, e6xd5\n33.\tRb1+\tKa7 (assuming black's plan is to take the a pawn)\n34.\tRa1, Kb6 (it looks as if he will achieve it)\n35.\tKa4+, and if Kxa6\n36.\tKc5+, Kb6 and the rook is lost again!\n\nMaybe this will never happen in the game, but I couldn't resist the temptation to find out if he would have seen the trap or not. The alternative was \n29. Nf4, retaining his king to this side of the board, with the result to somewhat stall the game, or if he changes his bishop for my knight, his king comes first and takes my pawn, so no good. ",
        "29... Kd7 30. Na4 Kc7 31. Nc5 Bxc5 32. dxc5": "This doubled pawn was calculated. It looks like weak, but prevents the black king to threat the a pawn along with the rook.",
        "32... e5": "Now HE threatens the center with a pawn \"mayority\"! I can stop him, but the game goes to draw!",
        "33. Kd3 Kd7": "He knows he can take the pawn anyway, sooner or later.",
        "34. c4 g6 35. Kc3": "So I have to look for tricks.",
        "35... Kc7 36. Kb4 d4 37. exd4 exd4 38. Rd1": "...and \"use\" my a pawn as a sacrifice in order to win a precious \"tempo\". \n\nThe other choice was Ka6, and if he tries to push his pawn (38. ..., d3), I thought about some trick with 39. Rb1, but d2, 40. Rb7+, Kc8, 41. Kb6, d1=Q, doesn't give me nothing, just for one tempo. Ohter variants based on the same motive get more or less to the same point. ",
        "38... Rd8 39. Ka5 d3": "Ah... this was what I wanted. Now my King can go for the pawn. \n\nAgain, 40. Rb1, d2, 41. Rb7+, Kc8, 42. Kb6 cames late. Really annoying.",
        "40. Kb4 Kb8": "And his goes for mine. ",
        "41. Kc3 Ka7 42. Rxd3": "If he exchanges rooks, I must win due to my king's proximity to his pawns, since my doubled pawns prevent him to easily take them. ",
        "42... Rg8 43. Rd6 Kxa6 44. Rxc6+ Kb7 45. Re6 g5": "Resourceful. ",
        "46. hxg5 Rxg5 47. Rh6 f4 48. Rf6": "Yes, I \"must\" leave him the h pawn free in order to get tempos to advance mine. At least, this was what I thought. ",
        "48... Rxg2 49. Rxf4 Rg3 50. Kd4": "Probably, I should have advanced my king to the other side (b4).",
        "50... h4": "As I said, I must take the risk. ",
        "51. Kd5 h3 52. c6+ Kc7 53. Rf7+ Kc8 54. Kd6": "I know I have to make him check me in order to get the king to the b column, free of checks. ",
        "54... Rg6+ 55. Kc5 Rh6 56. Kb6": "Here he goes. Now I threat mate.",
        "56... Kd8 57. Rd7+ Kc8": "I dont' want perpetual check.",
        "58. Rd1 h2 59. Rh1 Rh3 60. f4 Rb3+ 61. Kc5 Rh3 62. Re1": "And here I blunder, because I am still thinking I threat mate. If only I had hold the position some more moves, I would have won. Or I think so. ",
        "62... h1=Q 63. Rxh1 Rxh1 64. Kd5": "No hope, just for a tempo.",
        "64... Rf1 65. Ke5 Kc7 66. f5 Kxc6 67. Ke6 Re1+ 68. Kf7 Kd7 69. f6 Rc1 70. Kg8 Rxc4 71. f7 Rg4+ 72. Kf8 Rf4 73. Kg8 Ke7": ""
    },
    "url": "https://gameknot.com/annotation.pl/london-nice-game-long-middlegame-no-sac-lost-by-blunder?gm=23260",
    "gameName": "London, nice game, long middlegame, no sac, lost by blunder",
    "players": "damalfi (1715) vs. aramberber (1753)",
    "opening": "Queen's pawn game, Chigorin variation (D02)"
}