{
    "moves": {
        "1. d4": "A loss transformed into victory. A trapped queen that is not completely trapped becomes a force.",
        "1... Nf6 2. Nf3 d6 3. Bf4 Bg4 4. Nbd2 g6 5. h3 Be6": "This way to retire seems to be bad, but it is played by chess engines (I am not suggesting he used one, of course). I've tried to take advantage of it, but to tell the truth, I couldn't make my way easily, when faced with it. ",
        "6. e4": "The normal plan in this opening is to play e3, c3, and attack with g and h pawn. But against the fianchetto, this attack is not too strong... this move cannot be bad.",
        "6... Bg7 7. c3": "Building a wall against the bishop, and opening my \"b plan\" attack, the \"b\" column. \nOf course d5 comes to mind. But if he prevents it with d5, e6 is so good for me... :-)",
        "7... O-O 8. d5": "Time to make him feel the pressure of my center. ",
        "8... Bd7 9. Qb3": "You see, it seems all ok. Queen on the b column, more developement... maybe a4 was the correct plan here. ",
        "9... b6": "a \"hole\" in c6...",
        "10. O-O-O": "I admit this was a bad move. I like to do \"surprise\" castling, and I estimated here that black attack power was near to 0, so it was safe for me to play this move. While this is not true, I can also say: why castling? Ok, my plan is to launch a pawn storm on the kingside, so it is not adequate to castle kingside. \nIn addition: my position is not bad, but my pieces are not coordinated. My d2 knight hasn't any place to go, and blocks my rook's action... and my queen is in a bad trap, you'll realize it soon.",
        "10... Qe8": "threathing Ba4, and, more important, preventing my wsb to develop on an useful square. I should have played Bb5 before, even if it seemed a simple bishop's exchange with no progress, but for him.",
        "11. Qc4": "Or Qa3. The idea es to leave b3 for the knight, which will be ok in order to make it worthy. Maybe, the wise move here was Qc2.",
        "11... c5": "As expected... but now, dxf6 seems a way to give him much more space and resolves all his developement's problems. So I decided not to play it. But in doing so, I am narrowing the space for my queen... \nI had to develop my pieces instead, but note that Bd3 leads to lose it (b5-c4) and Be2 is a dull move, since the bishop is doing nothing there. ",
        "12. e5": "...leaving d5 undefended (but for my queen). This was the \"typical\" of mine risky and \"trying to surprise\" move. They do not always work...",
        "12... b5": "Playing hard... Now I'm seriously worried about my queen, and all the \"tempos\" I will spend in saving it, instead than developing and attacking. Now I realize that castilng was an awful move... now I'm suddenly fearing to lose as an idiot :-)",
        "13. Qb3": "You see, my queen in d3 futher blocks my bishop...",
        "13... c4": "It comes to mind, of course, a piece for two pawns sac. Note that Ba4 is a threat after the pawns are removed, so it is not a guarantee to resolve development problems.",
        "14. Qa3": "A poor square for my queen. BUT it is aiming to d6.",
        "14... Nxd5": "If black plays a5, I am very, very close to resign! I won't lose my queen, but my king will be completely exposed. But a central pawn is very juicy...",
        "15. exd6": "If NxB, d6xe7 and he loses the rook. Just a cheap trick. Of course, if black plays b4, I'm lost. If Qa5, Nc6 and Bc8, but my queen can still escape into c5. I can also play c3xb4, but in both cases allowing NxB or worse. Maybe he calculated I could save myself, but with a piece less, even for some pawn. He decided to wait, and this, probably, was his \"big\" strategical mistake. ",
        "15... e6": "Maybe he thought he still has b4 now, but... I can still save my queen in a or c5. What I cannot cope with is b4xc3, and all that comes after... I thought I was just lost at this point.",
        "16. Be3": "The bishop must be saved, no \"hero\" moves here. I must be happy not to lose.",
        "16... Nxe3": "I estimated that even if my bishop is valuable, his knight is much worse for me in d5. Nevertheless, it is undefended, so he has to take care of tricks like my Nxc4. Maybe he thought that this way he resolved two problems in one move, but he loses most of his attack in the process, giving me some breath. \nThe alternative, Bg3 or a2, allows an easier b4. My point is not to save the nice d6 pawn, but the game itself!\n",
        "17. fxe3 Bc6": "Another strategic mistake, I would say. Nc6 develops his dead pieces, renewing the b4 menace thus making things more difficult for me. ",
        "18. Nd4": "Ahhh... some breath. I'm sorry for my wsb, but it is ok where it is. Exchanging any of his two bishops is really good for me. ",
        "18... a5": "Renewing the trapping-the-queen scheme. I'm really sweating. But it is too late. And, without the knight, b4xc3 is not all that dangerous. ",
        "19. Qc5": "Breathing. Now, Na6 would put me in troubles: where to go? Qb6... or Qg5? Maybe he thought Qb6 was good for me.",
        "19... Bd7": "This reveals the mistake in moving the bishop... but I have to be careful, since Na6 is coming (again, even if I do not have Qc7 because this can be another trap, I have Qg5... it's funny, this is the \"ungrabbable queen\" :-)\nWanting to develop the knight in c6, Bb7 was better.",
        "20. g4": "Now my bishop has a square... but, more important than that, I aim to a future pawn block in g5, since his bishop can have future on h6! A \"deep profilactic\" move, that will reveal a key one in the rest of the game!",
        "20... e5": "Doesn't he intend to develop? ",
        "21. Nc2": "An alternative was Qd5, aiming to the rook, but... it is not time to attack, but to consolidate and defend (Qd5, Na6...). Qd5 is useful in case of black's f5, nothing more. ",
        "21... Bc6": "Ok, the diagonal is his again. My aim can be to exchange bishops (Rg1, Bg2) but this doesn't gives me much. I decided to block the center, since he can play e4... and this really cramps me!",
        "22. e4": "I know I am blocking my own knight, but I am giving space to my queen... and I want the game to \"freeze\", and to fight against f5 somehow. Still his best chance, though. Now, his only way of attack is Bh6, and I have to cope with this. ",
        "22... Ra6": "He insist in not seeing Na6... or maybe he is preparing Nd7. But... wasn't his plan to play b4? Anyway.",
        "23. Qf2": "Maybe Qe3 was better, in order to avoid Bh6. But, again, I have to fight against f5. And I have now a shadow of a pressure against f7... that will reveal itself important in the rest of the game. ",
        "23... Qe6": "Very good. But he cannot take in d6 because of Nxc4. ",
        "24. Bg2": "I regret to move this bishop to a blocked diagonal, but sooner or later my knight will have to move, so I have to defend the e pawn. My knight wouldn't go to f3, but to f1, e3, aiming to d5. The other one is well placed defending my king against b4. Nevertheless, this move is not so good, as you will see.",
        "24... Bh6": "Of course. A good answer was Kb1, but it leaves the way open to a4 etc. A better way to prevent this is...",
        "25. Ne3": "Even if it lets the way open to b4. ",
        "25... b4": "At last! It is nice, since I cannot use my knight to take c4, since the other knight is pinned. Now, I regret having moved my wsb... I was really sweating again. ",
        "26. h4": "If BxN, QxB, Qxg4, I play Rdg1. Would he dare? Now you can see the beauty of 20. g4...",
        "26... bxc3 27. bxc3": "Weak king, ok, but the danger is not so inmediate. And I have some life...",
        "27... Ba4": "Juicy position! The following is one of the dozens variants I studied. \n\n28.\tg4-g5 \tBxR\n29.\tg5xB  \tBh5\n30.\tNf5!?  \tg6xN\n31.\te4xf5 \tQxd6\n32.\tNe4   \tQa3+\n33.\tKb1    \tNc6? (in order to go on attacking my King, but...)\n34.    Nf6+    \tKh8\n35.    Qg3    \tBg6\n36.    f5xB    \tf7xg6\n37.    Nd7 (preventing the deadly check in b8) etc. etc, but you cannot trust this kind of calculations, too tactic involved... \n\nSo: Is g5 the best move? Or just Rd-f1? Or Nf5 right away? Why is chess so wonderful?",
        "28. g5": "Nevertheless, I played it, because...",
        "28... Bxd1 29. Ndxc4": "It was so important to me to take c4! Now, he has to retreat, and I have Bh3, a strong move... and my d pawn is holding! Of course, I didn't take c4 with the other knight because I am still dreaming about the sacrifice Nf5! \"It's beyond of my control\"... \"I'm drawn like this\" :-D\nIf he retreats the bishop, I will take the h6 bishop, and it is a quality, but you saw my attack will be strong on the previous comment.",
        "29... Bg7": "The wise one! My opponent is better defending than attacking.",
        "30. Bh3": "Can I have Indiana Jones' theme played at this point? :-D",
        "30... Qe8 31. Rxd1": "Ok, now he has a quality, but I have a much better position (than before!), and my d6 pawn begins to \"play\"!",
        "31... Qa4": "I would have played Nd7 instead. ",
        "32. d7": "You see, \"accidentally\", my queen protects my a2 pawn... my pieces are now coordinated... and his knight hasn't left the original square!",
        "32... Rd8 33. Rd6": "If he exchange rooks, I have a strong threat in f7 (you see, the queen in f2 wasn't so stupid a move as it seemed to be...)",
        "33... Ra7": "I think I have checked out all the alternatives, and it was a very long work...\n\n34.\tNd5(!)\tNc6 (if he takes the knight in c4... you'll see it in the game)\n35.\tNd5-b6\tQb5\n36.\tRd5    \tQa6 (wonderful. Now, I am chasing his queen! Very funny!)\n37.\tNd6   \tRf8 or f5, and... \n38.\tBf1, trapping his queen!\nChess is wonderful... :-)\n\n\n34.\tNd5\t\tQxc4\n35.\tQb6!? was also a possibilty. \n36. \t...\t\tNc6 is not possible because of RxN, and\n36. \t...\t\tQc6\n36.\tRxc6\t\tNxR\n37.\tQxN also wins...\n\n",
        "34. Nd5": "So I choosed this tactic...",
        "34... Qxc4": "I analyzed a lot Ne7+, Nf6+, and even Be6, but none gave me enough compensation. And I didn't see Qb6 by this move, so probably I lost the chance to make my game even more surprising...\nSo I simply played...",
        "35. Qxa7": "Recovering the quality. \nAgain, one of \"those\" positions... let's see one of the variants. \n\n35.\tQxRa7\tNc6\n36.\tQc7   \tBf8\n37.\tNf6+  \tKg7\n38.\tRxc6  \tBa3+\n39.\tKc2    \tQe2+ (or Qxa2+)\n40.\tKb3    \tQb2+\n41.\tKc4    \tQxa2+\n42.\tKb5    \tQb3+\n43.\tKa6    \tRa8+\n44.\tQa7   \tRxa7+\n45.\tKxa7  \tBe7\n46.\tRc8    \tBxf6 (forced, since a mate in g8 is coming!)\n47.\tg5xf6+\tKxf6\n48.\tQd8+, winning!\nIncredible! Again, you cannot trust this kind of analysis... for example, Black can go on with\n46. ..., Qb6+\n47. Ka8, Be8!\n48. Nd5! Qa6+\n49. Kb8, Qb5+\n50. Ka7 (or perpetual), and balck also loses. ",
        "35... Qxa2": "Ok, this is what I got: a winnin position, but for the exposed king to a queen... but we know this isn't enough but to try a draw (by checking with the queen...). Ok, it is still better than nothing. But... does black have this draw?",
        "36. Qc7": "Deadly threat: if the rook goes to f8, d8=Q, an even if with checks I lose the wsb, I win. He chooses the perpetual way.",
        "36... Qa3+ 37. Kc2 Qa2+ 38. Kd3": "My only chance to stop the checks is going with the king in his own territory.",
        "38... Qb1+ 39. Kc4 Qa2+ 40. Kb5": "Now, to his checks, I have a trick!",
        "40... Qb3+ 41. Nb4": "Can I have a (!)? I tried with \n\n41. Kxa5, but Nc6+, \n42. QxN (the only one, or Ra8#!), Qa3+, \n43. Kb5 (if Qa4, Rb8+ and wins), Rb8+\n44. Nb6, Qb3+ and the perpetual threat comes again! (This was what I thought, but it was not true: \n\n45.\tKa6    \tQa3+\n46.\tNa5 and black is lost, since he has no checks anymore.\n\nI didn't see it, so I decided to play the sacrifice.",
        "41... Rxd7": "A way to stay on the board a little more.",
        "42. Qxb8+": "Probably, another one would have been better (BxR, or RxR...)... at this point, I was really tired!",
        "42... Bf8": "Good calculation by black. If RxR, I lose the queen with Qxb4+.",
        "43. Bxd7 axb4 44. cxb4": "But now, black queen's checks are over.",
        "44... Kg7": "And I cannot save my rook. Well played by black. I still have to be careful about not to allow some strange check by black.",
        "45. Be8": "I can just wait for the exchange, and \"all\" I would get will be a bishop and a free pawn... enough to win, though... but this move was a mistake. The right one is Bc6 in order to play Bd5. Nevertheless, this allows Qd3+ and you know, I wanted to avoid more complications.",
        "45... h6": "He knows I cannot remove the obstructing rook, so tries to free his king. Not a great plan, I think...",
        "46. gxh6+ Kxh6 47. Bc6": "A tempo late. Fortunately for me, there is not much black can do.",
        "47... Bg7": "Er... why not to take the rook? Ok, I know: with only a queen on the board, black has no resources. ",
        "48. Qd8": "I have Bd5, but I was very tired, and feared Qd3+ and subsequent checks could lead him to some trick. ",
        "48... Qh3 49. Qg5+ Kh7 50. h5": "Exchanging queens is a clear win for me, and g6xh4 allows Qf5+, exchanging queens. Ok, I allow black's queen to check, but no danger now. ",
        "50... Qf1+ 51. Kb6 Qf2+ 52. Kb7": "Not Kc7, Qa7+... not really dangerous, but annoying. ",
        "52... Bf8": "Not to threat the rook, but to shield the king... but it's useless.",
        "53. hxg6+": "And I have a checkmate in all variants... at last!"
    },
    "url": "https://gameknot.com/annotation.pl/london-great-game-won-slowly?gm=25046",
    "gameName": "London great game, won slowly",
    "players": "damalfi (1644) vs. san_din (1623)",
    "opening": "Queen's pawn game (A46)"
}