{
    "moves": {
        "1. e4": "I am white and fungi is black. This game I tried something new. I use reverse psychology on fungi to try make it seem like did know what doing by making bad moves but it was all part of my plan. This was a hard game but some how I was able to pull off a win. This was one of the hardest games I ever played. King pawn  opeaning.",
        "1... d6": "queen pawn opeaning",
        "2. Ne2": "saw a chance to get a early check",
        "2... e6": " weak move by black.  Black is trying to control the middle of board but it does not fool me.",
        "3. Nf4": "trying to  develop some pieces  or get my knights in play.",
        "3... Be7": "building double protection for king.",
        "4. Bb5+": "Started to play aggressive ",
        "4... Kf8": "moved to safe spot",
        "5. Nh5": "building up my reverse psychology  plan",
        "5... Bh4": " Now black Starts to play aggressive .",
        "6. O-O": "castle king side",
        "6... g6": " better move knight back on my next turn",
        "7. Nf4": " back to the front line ",
        "7... a6": "does not like what black is doing.",
        "8. Bd3": " moved back just to safe.",
        "8... g5": "trying attack with pawns the last couple. does not fool me and what a weak attack.",
        "9. Nh5": "leading my attack with my knight.",
        "9... e5": "blocking my pawn.",
        "10. Bc4": " having my knight and bishop as my combat pieces",
        "10... b5": "black does not have plan and attacking with pawns will not get you no where in a game.",
        "11. Bd5": " having 2 pieces ready to attack when  the time is right.",
        "11... Ne7": "black finally woke up and  realized that using his pawns was not getting him anywhere.",
        "12. Nc3": " putting  my other knight in to combat mode.",
        "12... c6": " that moved did not fool me. I am so used black moving pawns.",
        "13. Bxc6": " getting ready for my reverse psychology  plan  to go into action",
        "13... Nbxc6": "For this part of the game I am going to use reverse psychology. I wanted black to think I  do not know what i am doing but it is all part of my plan.",
        "14. Nd5": "advanced  my knight to get ready to help check the king when the time is right.",
        "14... f5": "same old trick. Black using his pawns is getting kind of old. ",
        "15. exf5": "free pawn",
        "15... Nxd5": "I have to keep this reverse psychology thing up until the time is right to move on from that part of the game.",
        "16. f6": "wow black king is not all the way protected. Have 2 pieces  on blacks side the board but not ready to check yet.",
        "16... g4": " black has  a very weak attacking  plan or none at all.",
        "17. Qe2": " time to bring out the queen.",
        "17... Rg8": "black king has more protection now.",
        "18. b4": "I think black will move his rook from g8 to g5 on his next turn.",
        "18... Rg5": "I was right on the money on that one. I will not give black a chance to take my knight. ",
        "19. Nf4": "safe spot.  Black could of took my knight by g5 to h5 or  e5 to f4. that piece was doomed all this time and i could  not save it.",
        "19... exf4": " down 3 pieces  but would be worth it if my plan works.",
        "20. Rb1": " rook getting ready for combat",
        "20... Re5": "saw an other chance to one  my pieces but I do not think black realizes that using reverse psychology on him.",
        "21. Qxg4": "ready for combat",
        "21... Bxg4": " really soon I should go to next part of the game",
        "22. a3": "not sure what my move would be",
        "22... Qxf6": "free pawn",
        "23. Bb2": "down 16 ",
        "23... Re4": "black is moving in. I think the reverse psychology part of game ended right here. Now I need worry about back attack.",
        "24. Bxf6": "Let the games begin",
        "24... Bxf6": " thinks he has the winning edge.",
        "25. d3": " being  10 under does not sacred me at all.",
        "25... Nc3": "black is attacking  at full force .",
        "26. dxe4": "free piece",
        "26... Ne2+": "You need a couple pieces to checkmate me .",
        "27. Kh1": "safe  spot",
        "27... f3": "I know how to get out of this problem",
        "28. Rbd1": "rook gives back up that would cause black to retrect ",
        "28... Nf4": "right on the money. now I will move d1 to d6",
        "29. Rxd6": "\nI am  move d6 to f 6",
        "29... Ne5": "black has  full force of power on one side of the board .",
        "30. Rxf6+": "check",
        "30... Ke7": "saw that he could take my rook.",
        "31. Rxf4": "took 2 pieces in back to back moves. ",
        "31... fxg2+": "You do not know how to checkmate or check the right way.",
        "32. Kxg2": "came from  -15 to +2.",
        "32... Rg8": "getting ready to  go in to battle.",
        "33. Rf5": "why do I have a feeling that black is going check me.",
        "33... Be2+": "weak check",
        "34. Kh3": " I got away with ease.",
        "34... Bxf1+": "check",
        "35. Kh4": "black is not good at chasing me down.",
        "35... Rd8": "Not sure black doing with his rook. I  can capture his knight and get a check  on my next turn.",
        "36. Rxe5+": "check",
        "36... Kf8": "\nI can check him one more time on next turn",
        "37. Rf5+": "check",
        "37... Kg8": "I need more pieces up there  before I can checkmate black.",
        "38. e5": "not sure how to checkmate yet.",
        "38... Rd4+": "check. black has his bishop and rook here.",
        "39. Kg3": "weak check",
        "39... Rc4": "what was that about",
        "40. c3": "Was not worry about a check or checkmate.",
        "40... Rxc3+": "He  does not have a plan to checkmate me.",
        "41. f3": "procting my king.",
        "41... Rxa3": "weird move",
        "42. e6": "trying to get my pawn to other end.",
        "42... Bd3": "I do not think black will take my rook.",
        "43. e7": " ready to get  a queen back into the game.",
        "43... Ra1": "right on the money  black does not relize that he  could take my rook",
        "44. e8=Q+": "check",
        "44... Kg7": "safe spot",
        "45. Qe7+": "check",
        "45... Kh6": "now I am at +6",
        "46. Qe6+": "I need a couple more pieces to check mate.",
        "46... Kg7": "safe",
        "47. Qe7+": "check",
        "47... Kh6": "safe",
        "48. Qe6+": "check",
        "48... Kg7": "safe",
        "49. Rg5+": "check",
        "49... Kf8": "safe",
        "50. Qc8+": "check",
        "50... Ke7": "safe",
        "51. Rd5": "It no use to trying to checkmate at tihs point of  the game.",
        "51... Rg1+": "It be  a power struggle with me checking black and black checking me.",
        "52. Kh3": "only time will tell who will get the winning edge on this power struggle.",
        "52... Bf1+": "check ",
        "53. Kh4": "I am not going down without a fight.",
        "53... Rh1": "blacks knows a way to check me.",
        "54. Re5+": "6  to 6 pieces  we are dead even on pieces.",
        "54... Kf6": "who ever would lose pieces now will decide who would get the winning edge on this close game.",
        "55. Re4": "black is going to check me on his next move.",
        "55... Rxh2+": "check",
        "56. Kg4": "it will not last his checknig my king.",
        "56... Bh3+": "check",
        "57. Kg3": "I am going to take one of his pieces to  end his checking my king.  Thats my next goal.",
        "57... Rg2+": "I am going to take his bishop on my next turn.",
        "58. Kxh3": "still dead even in pieces but I  have  queen and rook over  rook and 3 pawns.  I  have small winning edge over black.",
        "58... Rf2": "sees a way to check  me.",
        "59. Rf4+": "It looks like both saw way to check each other.",
        "59... Kg5": "saw a way to get 2 of his 3 pawns out of the game.\n",
        "60. Rf7": "getting ready to take the  a pawn in next couple moves. Black would move a6 to a5. Then I would   b4 to a5. Then black would play f2 to f1. After that I would move f7 to h 7.",
        "60... a5": "moves  pawn",
        "61. bxa5": "free pawn",
        "61... Rf1": "what I expected black would do.",
        "62. Rxh7": "black has 2 ways to check me .",
        "62... Rh1+": "does not have enough pieces to checkmate me.",
        "63. Kg2": "things are turning to my favor.",
        "63... Rxh7": "could not save that rook",
        "64. Qc5+": "4 to 3 pieces  wondering if one piece  lead will help me win.",
        "64... Kh4": "black is not going down without fight.",
        "65. Qxb5": "GET THAT ROOK IF THATS THE LAST THING I DO!!!!!!!!!!!!",
        "65... Rg7+": "check how are you going to checkmate with 2 pieces if you do not know how to checkmate.",
        "66. Kf2": "moves king to safe spot",
        "66... Rc7": "Trying to find a way to check me.",
        "67. Qb4+": "It comes down to the battle of the checks.",
        "67... Kh3": "I just need to capture  the rook to get the win in this game.",
        "68. a6": " get another queen will help you win the game.",
        "68... Rc2+": " move that rook to c2 and that would make my day.",
        "69. Ke3": "keeping my eye on rook.",
        "69... Rc1": "move that rook to e1 and that would make my day",
        "70. a7": "one move away to getting that queen I need to win the game.",
        "70... Re1+": "YES!!!!!!!!!!!!!!  I JUST HIT POT OF GOLD!!!!!!!!!!!!!!!!",
        "71. Qxe1": "Now just get that extra queen and be ready to checkmate.",
        "71... Kg2": "your time is running out.",
        "72. a8=Q": "got everything I need to checkmate now.",
        "72... Kh3": "I have plan to checkmate.",
        "73. Qf1+": " you only have 3 moves left.",
        "73... Kh2": "blacks knows his time in running out.",
        "74. Qh8+": "2 more moves to checkmate.",
        "74... Kg3": "black is feeling the heat.",
        "75. Qg7+": "one more move to checkmate.",
        "75... Kh4": "black  is hoping I would move the  top queen to keep this game going BUT HE IS DEAD WRONG ABOUT THAT1111111",
        "76. Qh1#": "CHECKMATE!!!!!!!!!!!!!!!!!!!!!!! "
    },
    "url": "https://gameknot.com/annotation.pl/long-hard-road-to-victory?gm=46325",
    "gameName": "long hard  road to victory ",
    "players": "goldmedal20 (733) vs. fongi (748)",
    "opening": "Pirc defence (B07)"
}