{
    "moves": {
        "1. e4 e5 2. Nf3": "My friend wants to eat my e5 pawn. He likes Ruy Lopez openings.",
        "2... Nc6": "Give him a chance to play it!",
        "3. Bb5": "Oh, yes. He must have been happy:D",
        "3... Nd4": "Nd4, but why? Because I like horses:) I expected him to take my knight with his knight, because I would have a pawn quite close to his army. But he developed instead. Nc3.",
        "4. Nc3 a6": "-Go back, bishop!",
        "5. Ba4": "-OK.",
        "5... b5": "-Go back bishop! Again!",
        "6. Bb3": "-OK, again. Stupid pawns...",
        "6... a5": "I wanted to chase his bishop, but I should have played c5 then. But I wanted to play. He is a worse chess player then I am, give him a bit of material advance:D:D I wanted his bishop, because if he doesn't play Nxe5 or Ng5, after 7... a4 8.Bd5 attacking my rook, c6 would have won a bishop.",
        "7. Nxe5": "But he captured my pawn :'(",
        "7... a4": "More meat on f7. Ok, I made a mistake... Maybe, Nh6 would have been A BIT better... ",
        "8. Bxf7+": "Whoo... I am in a bad position... Only option: Ke7",
        "8... Ke7 9. d3": "Opening his DSB. Where is my King and where is my Queen??? Now, I played too quickly. His Knight was too annoying for me... ",
        "9... d6": "-Ok, go back, you... you You.",
        "10. Bxg8": "Nice move. If Bg5 now, then Nf6 prevents him taking my Queen. But I don't have the Knight any more. ( I lied, I don't like horses. HAHAHAAA) BUT!!! It was also a mistake!!! After Bishop to g5, I would have been forced to move my Knight on f6 and he could have played Nd5# Or just simply Nd5# I must have told him the truth:D:D:D",
        "10... dxe5": "So, let\"s continue! NOOO! UNDOOO! Again, too quick move. That Knight was toooo annoying. I don't make so many mistakes... Are you OK, Matepok???",
        "11. Bg5+": "Oh, God! I'm in a huge trouble. OK, OK. Calm down, Matepok. I wanted this way, it was just a kind of gambits. ",
        "11... Kd7": "The problem has appeared!",
        "12. Bxd8": "Yes, he accepted the gambit. Unfortunately. But winning is nice from here:D:D:D",
        "12... Kxd8": "-You Bastard! Eat this!",
        "13. Bd5": "Retreating his bishop, and attacking my rook. ",
        "13... Ra7": "Hmmm. Do you see it???",
        "14. O-O": "Not now, maaan!",
        "14... c6": "Yeah! At least I capture his Bishop.",
        "15. Bf7": "He misses! -Why???-I asked him on msn. His reply: -I didn't see it.",
        "15... Rxf7": "OK, 5 points down in material.",
        "16. Qh5 Re7": "My e5 pawn was out of defender.",
        "17. Rac1": "He protects his undefended pawn.",
        "17... a3": "I have already mentioned, he is not the best chess player, so I planned this way: 18.bxa3 Re6 19. Nb1 (protecting the discovered accack from f8 to a3) Rg6 and after I would attact his Queen with my LSB , check with my Knight on f3 (free meat), He captures my knight, and I captore the pawn on f3 checking with the Rook and attacking h1 square... His Queen would have been lost, at least I could have exchanged my Rook for it on g3 or somewhere else...",
        "18. bxa3": "OK, it goes well.",
        "18... Re6 19. Kh1": "Ooohhh! I won't win. I would be better if I resigned right now.-I thought. But I continued. I don't like giving up chess games...",
        "19... Bxa3": "He told me, he had seen this just before I had played this... I became angry. He didn't make his last move, because he saw what I was going to do, but because he didnt't see it before... Ehhh...",
        "20. Rcd1": "OK, he moved his Rook away.",
        "20... Bb2": "I wanted to play this because I attack his Knight, he moves it away, and I protect my Knight on d4 and if I move that knight away, I protect my pawn on e5.",
        "21. Nb1": "I knew he would move his Knight, but Ne2 may have been better. Does it seem better only to me?",
        "21... Rg6": "I continued my idea, because if I can play what I wanted to played before, I would attack his Queen and put some pressure on his kingside as a weak counterattack.",
        "22. Rd2": "Now, if he can play c3, my Bishop or my hatred horse would be lost.",
        "22... Bg4": "I attacked his Queen with the knowledge of 23. Qh4+",
        "23. Qh4+": "He played that.",
        "23... Kc8": "Anything, but not Kc7 because Qe7+ would win another pawn, or at least it would go on attacking after c3 and I save my Knight or Bishop.",
        "24. c3": "Huh... Can I win this game???",
        "24... Bf3": "I try something... Something weak... But what could I have done???",
        "25. Qh3+": "Oh, what will be now??? No, I won't give my LSB, too.",
        "25... Bg4": "...",
        "26. Qe3": "Retreating...",
        "26... Bxc3": "Maybe the best I could do.",
        "27. Nxc3": "Yes, yes. He had to do.",
        "27... h5": "Now, I wrote him on msn, again: I am going to win, HAHAHAAA! You have no chance:D HAHAHAHAHAAA! I was sure he was going to win...",
        "28. h3": "I expected this.",
        "28... Rgh6": "If he takes my Bishop, I take his pawn checking his King, and he must play Queen to h3, or...",
        "29. f3": "I think he should have played this about his 23rd move. But maybe it's not too late now, either...",
        "29... Rf8": "He is going to capture my Bishop with his h pawn...",
        "30. hxg4": "OK.",
        "30... hxg4+": "I liked this move very much. Free h file for my Rooks. Actually, I'm 9 points down... To make myself sad...",
        "31. Kg1": "Only option.",
        "31... Rfh8": "Just take my g pawn! Free meat.",
        "32. fxg4": "Thanks!",
        "32... Rh6h1+": "Bang!",
        "33. Kf2 Rf8+": "Bangbang!",
        "34. Kg3": "Only option, because if 34. Ke1 then Rhxf1# and also Rfxf1#.",
        "34... Rhxf1": "Of course.",
        "35. Qg5 b4": "Why don't we exchange??? Pleaseee!:D",
        "36. Na4": "OK, It's right in the center:D",
        "36... Rf1f3+": "I want to make myself lose quickly, or what??? This was just an idea I liked because of... Because of... I don't know, just don't ask why, OK??? OK.:D",
        "37. gxf3": "Hmmm. Expectable.",
        "37... Rxf3+": "Strange exchange, isn't is? Just not Kg2, just not Kg2.",
        "38. Kh4": "Oh, thanks.",
        "38... Rf7": "I saw that I could find a better place for my Rook:D I wrote him again on msn: I retreat my Rook here, and I'm also protecting my g7 pawn:D Rf7 He replied: -But you aren't protect your e5 pawn... Qxe5",
        "39. Qxe5": "... Oh, shucks!",
        "39... Nf3+": "Yeeeeeeeeeeah! Now, he wanted to pull my leg and he wrote to me: Oh, no, you are now able to capture my Rook for free:'( I replied: I would choose your Wueen, if it's not a problem. He told me this time he wanted to pull my leg this weak way...:D hahaha...",
        "40. Kg3 Nxe5": "1 point down??? Uh, it was a long time ago, when I was in such a GOOD! position...",
        "41. Kg2": "??? He told me, he hadn't known why.",
        "41... Nxg4": "Bang!",
        "42. Kg3": "Almost funny.",
        "42... Ne5": "Almost...",
        "43. Nb2": "I think it was good for nothing... He had to play something... He chose this...",
        "43... Kb7": "I also had no better idea, but to start bringing my King in the battle. And the pawn on g4 is quite vulnerable.",
        "44. Nc4": "A bad move, and Nd6...",
        "44... Rf3+": "OK, a chance!",
        "45. Kh4 Rxd3": "He told me to finish this game quickly, he had to go... My reply: OK, I win quickly and you can go.",
        "46. Rc2": "After I move something convenient, Na5 and I have a pawn lost.",
        "46... Nf3+": "Haha! Check! Haha!",
        "47. Kh5 Rd1": "I tried to put my Rook on g5:)",
        "48. Na5+": "I expected...",
        "48... Kb6": "Take with the Knight! don't give me a check, because I will eat your Knight.",
        "49. Nxc6": "Whoops?",
        "49... Rg1": "Whoops, strongly.",
        "50. Rg2": "Delaying the checkmate.",
        "50... Rxg2": "BAAANG! BANGBANGBANG! BANGBANGBANGBANGBANG! ",
        "51. Nxb4": "... Couldn' prevent checkmate...",
        "51... Rg5#": "FIIIREEEEE! Oooooh! Finally! About 35 hard moves for me! From move 12 to about move 47! And my dream came true! I won! I was glad to finish this game. Especially with victory... Please, rate my first annotation (this one:D)! And also, add comments, please! Thanks:)"
    },
    "url": "https://gameknot.com/annotation.pl/looong-game?gm=33446",
    "gameName": "Looong game",
    "players": "My friend (1253) vs. Matepok (Me) (1489)",
    "opening": "Ruy Lopez (C61), Bird's defence"
}