{
    "moves": {
        "1. a4": " THE LOST GAMES SERIES/ A GAME I SHOULD HAVE WON BUT BLEW FOR THE SAME OLD REASONS:\n\nThis game is from the WTWALTR MT that starts off with the weirdest opening set up ever. I felt I played this game the best of all the games I played in the MT, win or lose, though in the end I blew the game due to a mistake that was not even supposed to be a mistake. Lets move ahead to the main set up >>>",
        "1... e5 2. a5 d5 3. e3 f5 4. a6": "I think this is the starting point. I actually had somebody criticize me when I was playing white that moving my pawn all the way up the a-file is bad chess. This is the first move of the MT and as bad as I am I would not do that (though in a current game I did move the h-file pawn up aggressively in response to the Modern Defense, as Bobby Fischer said this is a suitable response, though the commenter playing his quote with those !? deals). ",
        "4... Nf6 5. Bb5+": "This seemed a little overly aggressive but I figured he was sitting me up for an early kill. ",
        "5... c6": "No need risking trading a bishop or knight as long as the pawn can do the jop.",
        "6. axb7": "In this MT that \"dangling\" pawn becomes a nuisance for both sides and I found, as did my opponent here, it is okay to just get rid of it early on. Not sure if that is the best way to go if you're a master, but I got tired of trying to hold on to it as white. Seems he felt the same way. ",
        "6... Bxb7": "Normal chain of event so far. ",
        "7. Nf3": "What? This had to have been a mistake though I checked it out for a long time. ",
        "7... cxb5": "Take it and wait to lose my e5 pawn. ",
        "8. Nxe5": "Fair trade and I feel a little good with a decent material lead against a higher ranked player early in the game. Just want to hang on to it is my plan for now. ",
        "8... Bd6 9. d4 O-O": "Usually don't get a chance to castle with this set up. I seize the opportunity whilst I can.",
        "10. Nc3 a6 11. b3 Nc6": "I am feeling I am okay here. Not in a winning position but doing well enough if I jsut relax. ",
        "12. f4 Re8 13. Qf3": "Starts to develop into a tight closed situation that lasts for a long time. ",
        "13... Nb4 14. O-O Nxc2": "Amazingly a 2nd mistake by my worthy opponent. Or maybe he just let the pawn go rather than fight protecting it the rest of the game. In any case I take it and threaten his rook.",
        "15. Ra2 Nb4 16. Ra1": "The board gets tough now for a long while. ",
        "16... g6 17. Bb2": "This fianchettoed (s.p. ?) bishop is something I was aware of for the rest of the game but... well... we'll get that shortly.",
        "17... Re7 18. h3 Qc7 19. Rac1 Qb8 20. g4 fxg4": "A bold move on my part and just trying to break a hole through the wall we both have constructed.",
        "21. hxg4 Bxe5 22. fxe5 Ne4 23. Nxe4 dxe4": "Okay. This is the set up I (and most likely he) saw coming after all the trading. I don't feel too bad but I do something stupid. Not in terms of moves (well, that too) but I allow one more move... ",
        "24. Qf6": "okay, and then I rest and get up the next day and start making moves on my iPad2 while I am still half asleep. This is an issue with me. It is a real serious game and I know even with a three point material lead I need to focus and play on my PC with some coffee. It is a bad habit I have been trying to break for months but can't. So what happens? Lets have a look shall we. ",
        "24... Qe8": "Sure, protect the rook.",
        "25. e6": "Okay, let me be clear about something. I see the threat of checkmate after he moves his d-file down and then moves his queen to H8. I am making these moves on my iPad and not really \"braced\", as I should be however. ",
        "25... Qf8": "I figure a queen trade is the way to go, and if he moves his d-file pawn down I will, after the exchanges, pick up one more point in material by taking the pawn with my LS bishop.",
        "26. d5": "Pawn comes down. I told myself this was going to happen and to make the queen exchange. It is important to the plot here to understand this and how miserable I felt for about 15 minutes after my next move of...",
        "26... Bxd5": "taking the pawn! I almost, for a second, imagined him resigning when I suddenly realized what I had done in haste and sealed my doom. I was playing other games, including games on an iPad app called Social Chess. I was bouncing from game to game and even mixed up moves in other games by confusing the games. Moving in seconds, not even minutes. Bad habit. \n\nThis not anything that anybody else here has not done and will do again. But it is just so annoying since I am trying lately, hard, to change certain habits I have around moves. One being to not move on the iPad really. Analyze is okay, or blitz chess or puzzles and tactics, but no moves in games as I screw them up one after the other. I do care about the outcome, but in truth I do not mull over a lost game for all that long anymore. Maybe that is good. And even doing this series where I explore my loses is not such a negative way to deal with the issue. \n\nIn the end I felt I held up okay against a better player and my blunder was bad but not really anything new. Congrats to kmccrate541 who held on with a material loss and worked out a good one, two combination that left me KOed."
    },
    "url": "https://gameknot.com/annotation.pl/lost-games-series-2-kmccrate541-vs-billdancourtney-club-mt?gm=48871",
    "gameName": "Lost Games Series #2/kmccrate541 vs billdancourtney/CLUB MT",
    "players": "kmccrate541 (1649) vs. billdancourtney (1291)",
    "opening": "Crab opening (A00)"
}