{
    "moves": {
        "1. d4 d5 2. Bf4 f6 3. Nf3 e6 4. e3 Ne7 5. Nh4": "Tempting black to play g5, but Qh5+, Ng6, Nxg6, NxN, allows the B to retire (note that black has no g6 anymore, that's the key). Very wild game is obtained if black persists in the pin, with Kd7 instead.  ",
        "5... c6 6. c3": "Qh5+ is not good while the pawn stays in g7, so I just waited. ",
        "6... Nd7": "Black is cramped, but solid. His only weak spot is e6, but it is not easy for me to attack: Qg4, f5. and the BQ can still escape via b6. ",
        "7. Bd3": "A \"just developing\" move, with an eye on g6, of course. ",
        "7... f5": "Needed. But now...",
        "8. g4": "Here the fork works, since my Q can't go to h5+ anymore. But g5 is not supported anymore, so Bxg5 became possible... until black doesn't play another move.  ",
        "8... Ng6": "Relief! Here, I can exchange the N and be out of troubles, but I was looking for some fun, so...",
        "9. gxf5": "Black will lose the N anyway, and my pieces will be more active... or so I believed!",
        "9... Nxh4 10. Qh5+ g6 11. fxg6 Nxg6 12. Bxg6+": "That was the key! Now, h7 is pinned to the R. ",
        "12... Ke7": "Unfortunately, white is in no position to get inmediate profit of the royal alignement. e6, again, is weak but not easily attackable...",
        "13. Qh4+ Nf6 14. Bg5": "I wanted to get into complications, risking to lose a piece somewhere. ",
        "14... Bg7 15. Bd3": "The R is defended, the pin is broken. No more inmediate attacks I can see, so I better retire and play with the pawn. Not a fantastic cash for all this!",
        "15... h6 16. Bf4 Kd7": "Seeking for shelter, but it was better to counterattack with Qb6 or something. ",
        "17. Rg1": "Throwing a threat in between. In retrospect, this move is highly suspicious, since Rg8 and my R is not defended...",
        "17... Qf8 18. Rg6": "Not really sure about this move. I just wanted to create pressure, but I confess that my attack was under a \"?\"",
        "18... Ke8": "Fortunately, black just doesn't have good moves, and this is to provide Bc8 a place to go, and a defence to e6. ",
        "19. Nd2": "Just developing, with the idea to double rooks, but without seeing the path!",
        "19... Qf7": "Attacking my R, preventing any c4 idea since the B can't move from the diagonal. I have to look elsewhere, and stick to my plan. ",
        "20. O-O-O Ne4": "Very well played. The trick is that at some point of the exchange, QxR would have been possible. Here, I missed the simple NxN, and if QxR, Nd6+ winning the Q. I can only say I was in a time trouble (3+5sec blitz).",
        "21. Bc7": "?? I lost the track here, and played this with the idea of threatening Qd8#, without seeing...",
        "21... Qxg6": "...or QxB. True is that now, NxN, dxN, Bxe4 and white gets a lot of activity for the R. Not enough to compensate, though...",
        "22. Qd8+ Kf7": "I played it anyway, but it was in fact useless. ",
        "23. Qh4": "...since the only square was this one. I am threatening NxN, winning a pawn and a tempo. But black played well: ",
        "23... Qg5": "Trying to force the Q's exchange, depriving me of any possible attack!",
        "24. Qh3 e5": "Here I couldn't see any way of avoiding the Q's swap (Qf3+, Qf6, etc.), so I tried to get it the best I could. ",
        "25. Nxe4 dxe4": "Now f3 is forbidden, and black threats to win my B after my Q retreats (the alternative was BxQ, NxQ, hxN, dxe5 and white has a lot of activity). ",
        "26. Bc4+": "This check allows me to save my B and my Q. ",
        "26... Ke8": "The only was to avoid the Q's exchange was either Qf1 or...",
        "27. Be6": "Well, the resulting check won't give much to me, but at least I will be attacking. ",
        "27... Bxe6 28. Qxe6+ Qe7 29. Qg6+ Qf7 30. Qxe4": "?? QxQ was unavoidable. ",
        "30... Kd7": "?? My opponent feared some trap, and didn't take the bite. ",
        "31. Bxe5": "Black can play Re8, but I have escape check (Qg4+) and moreover, if BxB, dxB+ is still good for me. ",
        "31... Rae8 32. Qg4+ Re6": "Qe6 was impossible due to QxBg7, but now the B is lost, and white finally recovers the material balance (with advantage). ",
        "33. Qxg7": "It is forced to take with the Q. If BxB, g8 and I will lose it. ",
        "33... Qxg7 34. Bxg7": "White is an exchange under, but with a lot of pawns to compensate it. The rest of the game is a lesson about how NOT to play an endgame, and my shame is to get a drawn position, in which my opponent lost by time. Kudos to him, it was a memorabe blitz against a much stronger opponent he almost won.",
        "34... Rh7 35. Be5 Rg6 36. Bg3 b6 37. h4": "Blocking any h5-h4 ideas. This B won't need to move until the end is near. ",
        "37... Rf6 38. c4 h5 39. d5": "Still thinking that the exchange will open my position. ",
        "39... c5 40. a3": "Preparing b4 and creating a shelter in a2 for my K in case the BR penetrate on my backrank.  ",
        "40... Rhf7": "Piling up for a sacrifice on f2. I should have played f4, but then the two R on g would have kicked out my B with dangerous consecuences. ",
        "41. e4": "My two joined passed pawns should be more than enough. ",
        "41... Rf6xf2 42. Bxf2 Rxf2 43. e5 Rf5 44. e6+": "Probably a mistake! The pawns are stronger when joined, but I need them to advance!",
        "44... Ke7 45. Re1": "The idea being that after d6+, Kxd6, e7 and black can't stop it. ",
        "45... Rf8": "Black saw it and prevented with the right move! Very well found!",
        "46. Re5": "Attacking h5. ",
        "46... Kd6 47. Rxh5 Rf1+": "Here the shelter for my K is useful. I played very quickly here, so to recover some time for the moves to come. ",
        "48. Kc2 Rf2+ 49. Kb1 Rf4 50. Rh7": "?? Instead of defending with b3 (it gave the chance to black to play checks with the R, and if white tries to escape, the black R will haunt the white's pawns in a and b), I wanted to play something more interesting, but this was a mistake. ",
        "50... Rxc4": "Minus one. ",
        "51. Rxa7 Rxh4": "Still minus one, and the good one ",
        "52. e7": "I thought that this was all. I was wrong. ",
        "52... Re4 53. Rb7": "I will revenge on this pawn, and I will win with the a pawn. ",
        "53... Kxd5": "Minus two. ",
        "54. Rxb6 Rxe7 55. a4": "?? How am I supposed to defend this pawn against Ra7?",
        "55... c4 56. a5 Kc5": "Black didn't cash the last pawn, but still he has the drawn game in his pocket now!",
        "57. Rb8": "? Still Ra6, Kb5, Ra8, Kb6, and after Kb7 the white R must abandon the pawn to his fate...",
        "57... Ra7 58. Rc8+ Kb5": "I have to play my last card: force a perpetual, and see how he gets out of this one. I think that all this is plain theory, already exhaustively analyzed. ",
        "59. Kc2 Rxa5 60. Kc3 Ra4 61. Rb8+ Kc5 62. Rc8+ Kd5 63. Rd8+ Kc5 64. Rc8+ Kd5 65. Rd8+ Kc5 66. Rh8": "Ok, if he doesn't want to drawn, I will demostrate him it is a draw. ",
        "66... Kd5 67. Rh5+ Kc6 68. Rf5 Kd6 69. Rh5 Kc6 70. Rh4 Kd5 71. b3": "My last card: black can't take or RxR, and still white can stop the pawn. Black will lose the pawn, ending with a classic R and Pawn endgame that I am not sure is a sure win for white or black can draw the game. A pity for my opponent, he could have cashed a high-rated draw in blitz! :-)"
    },
    "url": "https://gameknot.com/annotation.pl/lost-into-attack?gm=59949",
    "gameName": "Lost into attack!",
    "players": "damalfi  vs. slavko944 ",
    "opening": "Queen's pawn, Mason variation (D00)"
}