{
    "moves": {
        "1. d4 e6 2. Bf4 h6 3. Nf3 d6 4. Nbd2 Nf6 5. h3 Be7 6. e4 Nh7 7. Bd3 f6": "The exceptionally close black's position makes it difficult to attack. ",
        "8. Nh4": "No fearing g5, of course, after Qh5+, Ng6+, etc. ",
        "8... O-O 9. Ng6 Rf7 10. Qh5": "A free outpost, but... how to use it??",
        "10... Nd7 11. O-O-O e5 12. dxe5 fxe5 13. Be3": "Black succeeded in blocking my lsb's action, because I played carelessly. ",
        "13... Ndf6": "Now my queen gets in troubles. ",
        "14. Nxe7+ Qxe7 15. Qg6": "I feel sorry for my queen... I have to throw it into the attack, since Bc4 doesn't work right now. ",
        "15... Kh8 16. g4": "Oh, my, so desperate was I to attack, that I forgot about the queen's escape square!",
        "16... Be6": "but my opponent didn't see it either: Nf8 and the queen is lost!",
        "17. Bc4 c6 18. Bxe6 Qxe6": "Trying to keep him busy and see if I can get my queen out of this!",
        "19. g5 Nxg5": "It works. Still, Nf8 won the queen, but I just distracted him to realize it!",
        "20. Bxg5 hxg5 21. Qxg5": "The queen is free!",
        "21... Nh7 22. Qh4 g5 23. Qg3 Qxa2": "Ok, now it's my turn to grab the advantage. ",
        "24. h4": "Qa1+, Nb1, and end of the story. in the meanwhile, I will build a nasty attack. ",
        "24... gxh4": "Black sees it, and keep the queen near to the action. Good for him. ",
        "25. Rxh4": "Piling up the pinned knight. ",
        "25... Rg8 26. Qh2 Rgg7": "Ok, so, what is black's weakness?",
        "27. Rh1 Qa6 28. Qh3": "This is. Or, better, c8 and the back rank is the weakness. And it will be exploited by Qc8, after RxN. It should work for a win. ",
        "28... b5": "Black has seen it, and covered the dangerous c8 square. ",
        "29. Rh6": "Threatening a pawn. ",
        "29... c5": "Wrong move? ",
        "30. Qh4": "Renewing the threat on the back rank. ",
        "30... Qb6": "Black has seen it, is all too obvious. ",
        "31. Qh3 Qc7 32. Nf3": "Well, let's see if the knight can help...",
        "32... a5 33. Qh4": "?? Just a blunder. Qh5 was the move after which I could have considered the game won. ",
        "33... Rxf3 34. Rf6": "Looking for some compensation. ",
        "34... Rxf6 35. Qxf6 a4": "Thank you, black, now I have a chance. ",
        "36. Qf8+ Rg8 37. Qf6+ Rg7 38. Qf8+ Rg8 39. Qf6+": "Of course, a draw would be fine, but black won't lose the chance, even at the cost of some pawns. ",
        "39... Qg7 40. Qxd6 c4 41. Qc5": "I expected Qg2, so I covered f2 with the queen. ",
        "41... Rf8 42. Qxb5": "I decided the exchange would benefit me. ",
        "42... Rxf2 43. Qxc4": "If Qg2, R can move. ",
        "43... a3": "?",
        "44. bxa3": "Ok, disrupts the pawn's chain, but... can he use the b column?",
        "44... Qg5+ 45. Kb1 Rf8": "He definitely does want to. ",
        "46. Qc7": "The most poisonous position for my queen. I ask myself why I am still alive. ",
        "46... Qg7 47. Qb6": "COvering f2 and g1. ",
        "47... Qg2 48. Qh6": "I planned Rg1, here, but I seeked for another threat. If Rf2, I'm fried. ",
        "48... Rb8+ 49. Kc1 Qxe4": "Black made a good thinking: now that the rook is away from f8, the queen can grab the pawn. Wrong. Poor black didn't expect that the knight will be his grave.",
        "50. Qf6+ Kg8 51. Rg1+": "And it's mate in two. Thank you for reading. "
    },
    "url": "https://gameknot.com/annotation.pl/lost-opportunities-and-mate-out-of-nowhere?gm=49835",
    "gameName": "Lost opportunities and mate out of nowhere.",
    "players": "damalfi  vs. stealths ",
    "opening": "Queen's pawn (A40)"
}