{
    "moves": {
        "1. Nf3": "An old game I lost, and I wonder where, exactly. ",
        "1... d5 2. d4 Bf5": "\"This is not a good move.  You must play Nf6 to counter the Nf3 move in almost every queenside opening.  D5 is a critical square and you need to bear on it from f6 with the knight.\"",
        "3. c4 e6": "Is this a mistake? I play it regularly. I am aware it gives the white squares bishop, but it opens the h column (while I normally try to castle queenside, but if I can, I never got in troubles even with the h column open, because it takes white a long time to build up an attack on the kingside).\nBut he didn't play for that (and this was a surprise for me).\n\n\"This is the correct move when the knight is on f6.  It is not wrong here, just not best.\"",
        "4. Qb3": "Strange, but the best, I fear. \n\n\"The Queen is taking advantage of the absence of the bishop from c1.  If the bishop were still on the original square this move would be less likely.  The queen attacks both d5 and b7 with this move.\"",
        "4... b6 5. Nc3 c6": "It takes a good place for the knight, I know. But I wanted to control b5, and a6 would have caused me troubles after pawn's exchange in the center. Maybe, all this is a wrong line of thinking. ",
        "6. cxd5": "My experience is that is better to take the pawn with e6xd5, because with c6xe5 my queen side becomes weak and exposed before I can castle kingside.",
        "6... exd5": "\"You are behind in development, and White has a strong initiative.\"",
        "7. Bf4 Bd6 8. Bxd6 Qxd6 9. e3": "Is my position inferior? Just for one piece less developed?",
        "9... f6": "This is a crucial move. I spent a lot thinking, and I still don't know if it is a fatal mistake. The idea is that white is virtually blocked here. My white square bishop can eventually go to f7, his f3 knight cannot jump into the center, and my knight are free to develop in e7 and d7. I am on a defensive scheme, I know, but I am playing with black pieces against a 1900! :-)\nAfterwards, I plan to start advancing pawns either on the king or queen side, depends on where he castles. Note that I can push in very few moves g5, a5, g4... I am not afraid to leave my king in the center or even to castle queenside!\n\n\"Not a good move, The knight belongs here because of the center.  He must put pressure on e4 and d5.  And you must clear the back rank for castling.\t \"",
        "10. Be2 g5": "Now, I had to choose between to develop the knights, although they cannot do much as well, but letting the white bishop go to a6, or expand my position with the h and g pawns, foreseeing an attack on the king side. Of course, in doing so I let my king without a good coverage, but... I thought white is resourceless. White's move I feared more was e4-e5, to which I would have answered with bishop e6. The plan was h7-h5, h4, g4... etc. I was wondering what if white castles on the queen side too. Very complex a position...",
        "11. O-O Nd7": "If pawn g4, the knight goes to a4, where I cannot attack it easily, and blocks my h pawns, so first I had to play h5, h4. But I thought not to develop was enough, so I got my knight out, thinking that I couldn't keep it forever defending my c6 weak point, still unattached (but what if Queen a4? I considered a sacrifice with the white knight, too). ",
        "12. Rac1": "If Rock c8, bishop a6, rock c7, probably it would have been all ok. But I had to get out my knights, and e7 is a good point to defend c6.",
        "12... Ne7 13. a3": "I didn't understand this move. Probably he was planning to bring his knight to b4 via a2... I thought on a5, with the intention to follow with a4... and avoiding the white bishop to go to a6! ",
        "13... Kf7": "I made this move, instead. The idea is simple: if I castle on the king side, my advance of the g pawn becomes useless, and it prevents me to go on with my future attack on this side. So, this unusual move got rocks communicate, with the intention to bring the a rock to the king side, when the moment had come. If white plays e3 to e4, my bishop goes to e6, and if then e5, queen retires to b1 (weird), and if e5 takes f6, the king takes f6, preventing the knight to take on g5. Anyway, even the knight check on g4 could have delivered a free g column for me, so...",
        "14. Qd1": "Surprise. I still didn't want to play g4 because of knight a4. ",
        "14... h5": "How much hard thinking covering variants to e3-e4... and even the sacrifice knight x g5... Till now, my plan seemed to go on. I am attacking...",
        "15. Nd2": "Another surprise. What is he seeking? The check on h5 is good for me, because after bishop f4 goes to g3, he has to play g2-g4 in order to save it, because mate in h2 is close. But now, he can play e3-e4 instead, and that is my worry. ",
        "15... c5": "So I decided to break the center myself, before he does. Now, I think it is a serious mistake. \n\nProbably all my troubles went because I played some-moves-to-one-side, some-to-the-ohter, instead of straight with a single plan. The problem is that my king-side attack doesn' lead to nothing if I simply advance my pawns. My f column is weak.",
        "16. Nb5": "Yes, again the knight is far from the center. ",
        "16... Qb8": "I would have liked to make this move after moving the a rock, but...",
        "17. dxc5": "Oh, now... what a hard thinking here! Taking with the pawn or he knight? b3xc5, b2-b4, c5-c4... a lot of variants. Finally, I was not satisfied, so I ate with my knight, without seeing too much danger in...",
        "17... Nxc5 18. b4 Ne6 19. Nf3": "Still ok. But I didn't see his only purpose was to exchange my knight on e3! So I played stupidly... and from now on, the game is over. ",
        "19... g4 20. Nfd4 Be4": "Now, I spent a lot of time thinking about f2-f3, even in answering g4-g3, and if f3 takes the bishop in e4, g3xh2 , my queen can go to g3, and then my rock supports it... anyway, a lot of garbage, because...",
        "21. Nxe6": "...and I cannot take the knight without losing the rock on a8 after Kc7. Still, it would have been the best solution. But I thought that after...",
        "21... a6": "...he would have played b4-c7, rock a7, knight x a6, rock x a6, bishop takes a6 and king takes e6. Or a lot of variants... but he played simple. And I did not see it because it was \"too simple\"!!!! :-(((",
        "22. Nbd4": "So I had a straight piece less, and that's all!!!",
        "22... Qg8": "Now is just a matter of time. Nevertheless, it was still possible some attack. ",
        "23. Rc7 h4": "If the bishop takes g5, it opens the g column for me. ",
        "24. Bxg4 h3": "I thought this move was pretty good. I expected f2-f3, then my queen goes to h7, and if he takes the bishop, rock a8-g8 or h3xg2, with still some chances to create some problems (even if h2-h3 would have saved white). But, again, he played \"simple\". ",
        "25. Nf4": "Now, he has a lot of chances... I had to prevent the bishop, or the knights to go to e6... nice checkmates where there. ",
        "25... f5": "If bishop a5 , it was a quick way to win. ",
        "26. Nxf5": "I cannot admire this one, even if it is winning. I cannot take f5 with my bishop because of queen takes d5 , winning. ",
        "26... Kf6 27. Nxe7": "The next one would have been mortal in any case. "
    },
    "url": "https://gameknot.com/annotation.pl/lost-but-where-exactly?gm=14737",
    "gameName": "Lost but where, exactly?",
    "players": "original_sin (1941) vs. damalfi (1627)",
    "opening": "Reti opening (A06)"
}