{
    "moves": {
        "1. d4": "Dmitry opens up with a queen's pawn game.",
        "1... d5": "I respond d7-d5 because I don't like to give up the center position",
        "2. c4": "The expected queens gambit....",
        "2... e6": "queens gambit declined....",
        "3. Nc3": "as usual knight to c3",
        "3... Nf6 4. Nf3": "still normal development...",
        "4... Bb4 5. cxd5": "unexpectedly Dmitry takes my dPawn.",
        "5... exd5": "I take with pawn to prevent e4.",
        "6. Bg5": "bishop to pin my knight on f6",
        "6... c6": "c6 to prevent queen to a4",
        "7. Qb3": "Dmitry decides to scare off my annoying bishop",
        "7... Bxc3+": "I decided to take because I don't want to waste tempo",
        "8. bxc3": "Dmitry takes with the pawn.",
        "8... h6": "My turn to scare away the annoying bishop=)",
        "9. Bxf6": "interesting....instead of moving bishop to h4 Dmitry decides to take my knight.",
        "9... Qxf6": "of course I would take with queen.",
        "10. e3 Nd7 11. c4": "pawn to c4 seems like Dmitry wants to get his bishop to attack mode.",
        "11... dxc4": "I take his gambit since I know I can scare his bishop off the next move.",
        "12. Bxc4 Nb6 13. Bd3": "retreats...",
        "13... Be6": "bishop to e6, forcing Dmitry's queen off his sweet position.",
        "14. Qc2 O-O": "time to get my king to safety.",
        "15. O-O": "same for Dmitry",
        "15... Rfd8": "moving my rook to an open file directly facing vertical towards his bishop.",
        "16. Ne5": "Dmitry takes the knight outpost.",
        "16... Nd7": "me trying to take his strong outpost away",
        "17. f4": "Dmitry pushes pawn to double protect knight.",
        "17... Nxe5": "I of course take since I wanted Dmitry to have a doubled up and backwards pawn.",
        "18. fxe5": "Dmitry takes with fpawn opening up the file for his rook to attack my queen.",
        "18... Qe7": "retreat...",
        "19. Qf2": "applying pressure on my fpawn.",
        "19... Rac8": "me moving the rook to try to open up the c file",
        "20. Rac1": "Dmitry Zilberstein realizes it",
        "20... c5": "c5 applying pressure on d4 pawn and bishop at d3.",
        "21. Bb1": "Dmitry decides to move his bishop to a safe position.",
        "21... cxd4": "well for me a draw is like a win, time to do some trading here.",
        "22. exd4 Rxc1 23. Rxc1 Rd7": "rook to d7 protecting the 7th rank..this is the move I thought about a long time.",
        "24. Qc2": "mwahahaha sneaky Dmitry wants to go to h7",
        "24... g6 25. Qd2": "trying to me my pawns up",
        "25... Kg7": "time to get on the defense side.",
        "26. Be4 b6": "not giving him any room to attack my pieces",
        "27. Rf1": "Dmitry sees the weak pawn lever.",
        "27... Bd5": "better for me to trade off his strong bishop",
        "28. Bb1": "He really likes his bishop haha.",
        "28... Bb7 29. Qf2": "applying more pressure at the f6 square.",
        "29... Rc7": "give my rook some opening room yay.",
        "30. Qb2": "Dmitry doesn't like that.",
        "30... Qe6": "now its the matter of playing defensive.",
        "31. h3 Qe7": "not moving my queen anywhere, not falling for any traps.",
        "32. Qf2": "whats Dmitry up to? hmmm",
        "32... Qe6": "I'll just stick with my plan.",
        "33. Qd2 Bd5": "what about moving my bishop can't forget my cutie. And after this move I offered him a draw. And surprisingly he accepts it."
    },
    "url": "https://gameknot.com/annotation.pl/lowell-high-school-simul-exhibition-match-with-im-dmitry-zilberstein?gm=27903",
    "gameName": "Lowell High School Simul Exhibition Match with IM Dmitry Zilberstein",
    "players": "IM Dmitry Zilberstein  vs. Anthony Li ",
    "opening": "QGD (D38), Ragozin variation"
}