{
    "moves": {
        "1. d4": "This game is an exciting game all the way through which I played against mwgr. You never know which twist is going to take place next!",
        "1... Nf6 2. c4 e6 3. Nc3 d5 4. c5": "This move is typical me. I love pushing pawns into enemy territory...although this may be a bad idea after 4...b6 5.b4 a5 and 6.a3 is useless.",
        "4... b6 5. b4 a5 6. Qa4+": "6.a3 would lead to 6...axb4 and if 7.axb4 then Rxa1",
        "6... Bd7 7. b5": "I push my pawns as far as possible!",
        "7... bxc5 8. Ba3 Na6 9. e3 Bd6 10. Nge2 c4": "Already an interesting battle is forming on the queenside.",
        "11. Bxd6 cxd6": "I have created a passed pawn, exploiting my opponent's blocked pawn formation.",
        "12. Qc2 Nb4": "I should have seen this. My opponent can win much material this way.",
        "13. Qd2 Nd3+ 14. Kd1 Nxf2+ 15. Ke1 Nxh1": "At least my opponent's knight is trapped...",
        "16. g3 Ne4 17. Nxe4 dxe4 18. Rb1": "I am backing up my passed pawn.",
        "18... Qf6 19. Nf4 e5 20. Nd5 Qd8 21. Bg2 Nxg3 22. hxg3 Rb8 23. a4": "My passed pawn is now well-defended...and I don't need to worry about my opponent's knight any more...",
        "23... Bc6 24. Nc3 Qg5 25. bxc6 Rxb1+ 26. Nxb1 O-O 27. Qf2 f5 28. d5 g6 29. Nc3 Qg4 30. Nb5": "I am still trying to push this pawn",
        "30... Rd8 31. Kf1 Qd1+ 32. Qe1": "I thought at this point that a queen exchange would improve my position.",
        "32... Qxd5 33. c7 Rc8 34. Qxa5 Qd1+ 35. Kf2 c3 36. Qxc3": "An error on my opponent's part...I think...",
        "36... Qxa4 37. Nxd6 Qd7 38. Qc4+ Kf8 39. Nb5 Qd2+ 40. Qe2 Qxe2+ 41. Kxe2": "Perhaps it would have been easier to promote the pawn if I hadn't allowed a queen exchange.",
        "41... Ke7 42. Kd2 Kd7 43. Kc3 h5 44. Kc4": "I offered my opponent a draw, and he accepted. He was worried about my passed pawn, and I was worried about his material advantage and strong pawn formation."
    },
    "url": "https://gameknot.com/annotation.pl/lrr-rules?gm=18725",
    "gameName": "LRR rules",
    "players": "fatcat2 (1200) vs. mwgr (1301)",
    "opening": "Nimzo-Indian defence (E20)"
}