{
    "moves": {
        "1. e4": "Hi to everyone, its very long time since my last annotated games. This game is very surprise to me. This is our second encounter. He open e4 the classical opening which is a favorite opening of many attacking players",
        "1... c6": "I usually replied c5 a Sicilian opening. But many times I tried as well the Caro Kann Defense in a regular tournament. Its a tough opening for black, favoured by many defensive players.",
        "2. d4": "The normal continuation for white.",
        "2... d5": "The usual reply for black attacking e4 pawn and as well to free the Q-bishop",
        "3. Nc3": "White can try as well the advance variation 3. e5 or 3. exd5 cxd5 4.c4 the Caro-Kann/Panov Attack with a good development for white 2 bishops despite of having an isolated pawn",
        "3... dxe4": "normal move for black which transposed to the Classical system after 4. Nxe4 Bf5",
        "4. Nxe4 Nf6": "I can try as well the Nd7 (Flohr Variation) but I much prefer the Tartakower/Nimzovich System",
        "5. Nxf6+ exf6": "Tartakower/Nimzovich System",
        "6. c3": "The position is almost equal. My first thought white's move is 6. Nf3 or Bc4. The c3 move purposes are to defend his d4 pawn, then move his bishop in d3 and queen in c2 towards the  black h7 pawn, and  as well to discourage black bishop in b4 square.",
        "6... Bd6": "I immediately put my king's bishop before white's occupying the f4 square by his bishop.",
        "7. Bd3 O-O": "always my habit first is my king's safety and then to activate the rook in the open file.",
        "8. Ne2": "White surely hesitate to put his knight in Nf3 because of the annoying black's Bg4",
        "8... Re8": "My rook is enjoying the open e file",
        "9. O-O": "9... Bg4 main idea is to pin the white knight , so the initial reaction of white is 10. f3 but at the expense of weak e3 square and pawn structures.",
        "9... Bg4 10. f3 Be6 11. Bf4": "At this point white's idea is to keep his knight, it could be white knight versus black bishop.",
        "11... Na6 12. Qd2 Nc7 13. c4 Bxf4 14. Qxf4 Na6": "my idea is to put my knight in c5 square, pinning the white bishop, and creating a double pawn for white, for example white captured the knight,  I will attack both his knight in e2 and c4 pawn",
        "15. a3": "white trying to build up a pawn majority in queenside.",
        "15... Nc5 16. Bxh7+": "I'm not surprised, before I moved my knight, this is only the best move by white at this time.",
        "16... Kxh7 17. dxc5 Qd3": "This is the part of my plan, attacking both knight and pawn, and the possible of exchanging queen, transposing to endgame.",
        "18. Qh4+": "My expected reply from white is 18. Nd4  Bxc4 19. Re1",
        "18... Kg8 19. Nc3": "His plan is to established his knight to d6 square",
        "19... Qxc4 20. Qxc4": "He decided now to exchange our queen.",
        "20... Bxc4 21. Rfe1": "He want to prevent my intention to totally dominate the open e file",
        "21... Kh7": "This looks like a dubious move than 21. Bb3, however my plan is to activate my king in the future possibly to g6 then f5..e5..d5,  just in case we had exchanged all our rooks.",
        "22. Kf2": "he also has a plan to centralize his king.",
        "22... Bb3 23. Ne4 Re6 24. Nd6": "At last the knight already got his final destination!",
        "24... b6": "I want to get rid the c5 pawn, the only supporting the knight. My bishop prevent white rook goes to d1  and as well preventing advance his pawn to b4, a multi purpose move.",
        "25. Rxe6 fxe6 26. Rc1 Bd5": "centralizng my bishop and to defend my c6 pawn after cxb6",
        "27. cxb6 axb6 28. Nc4": "This move consumed me a lot of time and analysis what move should be the best move for black. I can play 28..b5 29. Nb6 Ra6 30. Nxd5 white has a microscopic advantage.",
        "28... Rb8 29. h4 c5": "to discourage the advance of white pawn in b4 as well indirectly pinning the knight.",
        "30. Ne3 Rd8 31. Nxd5 exd5": "This move is better than exd5, although giving an opportunity fr white to rook to invade the 6th or 7th rank",
        "32. Re1 Rd6 33. Re7 d4": "The motto of the pawn \"united we stand divided we fall\"",
        "34. Ke2 c4 35. Kd2": "At this point the position is even, my plan is to capture the g2 pawn before white damaged my paws in queenside",
        "35... f5": "The idea is Rg6",
        "36. Rc7 b5 37. h5": "good move, white prevent my rook to g6 so I must to go to the other way",
        "37... Re6 38. a4": "The white's idea is to break my pawn formation. If 38. Rc5 attacking b5 and f5 pawn  38.. d3 39. Rxb5 Re2+ 40. Ke1 Rxg2 41. a4 g5 42. Rb7 g4 and black has advantage",
        "38... c3+": "No other best move than this",
        "39. bxc3 dxc3+ 40. Kxc3 bxa4 41. Kb4 Re2 42. Rf7 Rxg2 43. Rxf5 Kh6": "my idea is to capture the pawn in h5 as well to exchange our rook, up to this point still this is an even position.",
        "44. Kxa4": "natural move",
        "44... Rg5 45. Rxg5 Kxg5 46. Kb5 Kf4 47. Kc4 Kxf3 48. Kd3": "at this move i'm expecting him to offer me a draw which naturally I will accept.",
        "48... Kg4": "But he decided to resign, he thought that his extra pawn is useless,  but his best move is 49. h6! gxh6  50. Ke2 Kg6 51. Kf1 and this is a deadly draw! even I have extra rook pawn this would not give me any advantage to win..a hardly fought game. I compliment my opponent for this game."
    },
    "url": "https://gameknot.com/annotation.pl/luck-in-an-endgame-position?gm=56483",
    "gameName": "Luck in an endgame position",
    "players": "tutak (2121) vs. kingshunt (2171)",
    "opening": "Caro-Kann (B15), Tartakower (Nimzovich) variation"
}