{
    "moves": {
        "1. e4": "Final round of the April Uchicago Tournament TD'd by Mike Mei of the chess team.  I am playing white.  An aweful game lost by flagging.",
        "1... e6 2. d4 d5 3. Nc3 Bb4 4. e5 a6": "?! If this is a line in the winnawer, I am unaware of it.  One of the main continuations is ...c5 a3 Bxc3 bxc3, but I prefer on ...c5 to go Bd2 cd Nb5",
        "5. Qg4 Bf8": "Certainly an option, but  black has lost some time with his a6 maneauver and now this retreat.  Combined with Ne7 this Bf8 idea after Qg4 is not so bad, but here it seems different.",
        "6. Bg5": "Developing quickly with a tempo.  White prepares for O-O-O with a lead in development that should decide the day.",
        "6... Qd7": "?! Ne7 perhaps was better. All black's pieces are on the back row except the queen.",
        "7. O-O-O c5": "striking at the center",
        "8. dxc5 Bxc5 9. Ne4": "!",
        "9... Bf8 10. Nd6+": "?! Premature, this tosses a pawn to weaken the dark squares in black's position, but it is unnecesary and losing some of the edge white holds in time. Nf3 was called for, in line with simple principles of development.  One of my greatest weaknesses psychologically as a chess player is that when I sense I have an advantage I overpress it recklessly.  This is a classic example. I feel I have enough knowledge and tactical strength to get to class A and beyond within a year if only I can get rid of these bad mental habits in otb games.  This should come with experience.",
        "10... Bxd6 11. exd6 Qxd6 12. Bf4": "Hitting g7 and the queen. This was my idea behind the pawn sac.",
        "12... Qb4": "Pretty much the only move to counterpin the bishop which will be hit with check, stopping any Qg7.  I didn't see this in my calculations when I played Nd6.  Good chess blindess on my part.",
        "13. Rxd5": "?? Loses instantly to Nf6, forking the rook and queen.  Reckless chess is bad chess.  Obviously I'm playing for tricks, but concretely this does fail.",
        "13... exd5 14. Qxc8+ Ke7 15. Qc7+": "?! The computer says that after Bd2 white has a winning attack. I missed the move order and went on to an inferior position",
        "15... Nd7": "My move order allows black to develop his pieces and guard my threats.",
        "16. Nf3 Ngf6 17. Bd2 Qb6 18. Qf4": "Trading queens would lead to simply being down the exchange for no compensation (granted the d pawn is weak).  Now I need to attack to stay in the game, but there simply is no attack because I don't have the necesssary coordination.",
        "18... Rhc8": "My opponent offered a draw, which I declined, thinking that as a stronger rated opponent I should be able to use the bishop pair to attack aggressively still.",
        "19. Bd3 Kf8 20. Ng5 Kg8": "?!",
        "21. Bxh7+ Nxh7 22. Qxf7+ Kh8 23. Nxh7": "If Qh5 then Ndf6 and white is lost",
        "23... Kxh7 24. Qxd7 Qg6": "Another missed move in my calculations.  I had thought I could pull an advantage with the KS majority.  Double attacks mate and g2",
        "25. Bc3 Qxg2 26. Rd1 Qg5+ 27. Kb1 Rcd8 28. Qxb7 d4 29. Bd2": "And I played on in time trouble, losing on time in another ten moves or so.  A simply wretched game from my part, highlighting my greatest weaknesses as a chess player.  I learned I need to work on time management as well as on simple principles and keeping a level head in a better position.  Rushing an edge simply will not work against any level of opponent."
    },
    "url": "https://gameknot.com/annotation.pl/uchicago-4-2012?gm=44793",
    "gameName": "Uchicago 4/2012",
    "players": "Ryan Murphy (1392) vs. Mark Jungo (12xx)",
    "opening": "French (C16), Winawer, advance variation"
}