{
    "moves": {
        "1. c4": "He begins with the english opening, which I know virtually  nothing about.",
        "1... e5": "I do know however that in my studying I have found that usually when White (or black for the matter) decides to no go directly after the center, the other player usually occupies fairly quickly.. so I did.  \n\nThis is actually the main line of the english opening.  Hooray for me!",
        "2. a3": "His second move is one that is still confusing to me.  This is apparently a transition into something called anderssen's opening.  For all you trivia nuts out there, it's named after Adolf Anderssen who played this opening several times against Paul Morphy.\n\nThere's very little that I could find about this opening.  Surprisingly enough, one of the most helpful refrences for this opening, I found at wikipedia.  http://en.wikipedia.org/wiki/Anderssen's_Opening\n\nThe main line is actually 1. a3 followed by 2. c4, my brother just did it backwards.  According to wikipedia the standard replies are 1. ...d5 or 1.. g6.\n\n",
        "2... d5": "Surprisingly I replied correctly (I guess?).  I was only thinking of trying to lay claim to the center since it was being given to me.\n\nI know that my brother doesn't study openings, so I had a feeling that he was just goofing off.  It's interesting to play him because he doesn't really play the same way twice, so a lot of times I find myself in very unfamiliar territory.",
        "3. d3": "?\nI can see no sembalance of a plan.  He's made 100% pawn moves, done nothing to try and attack the center and this frees up a path for his bishop, but what is he going to do with a bishop at this point?",
        "3... Qf6": "Right now, I'm wondering if he's even paying attention, so I just pull the old lady out to aim at his weak f2 square.",
        "4. b4": "?\n\nHe ignores the threat and pushes more pawns out.  It's almost like he wants to pawn storm my Queenside.  Or maybe he just likes giving me free developing moves.  It could be also that he enjoys opening up lanes to his Rook.\n\n",
        "4... a6": "This is in preparation of ..Kt c6 or a c5 boost.  I want to try and get rid of his b pawn either by capture of by him moving it, that way I can move my dark bishop to c5 to aid in the attack I'm already trying to form.\n\nNormally I would not try and mount an attack so early on, but it appears as if he isn't even watching, so why not?",
        "5. Bd2": "??\nA seemingly pointless move.  If he wanted to get his Queen behind his pawns for some sort of pawnstorm (??) then he could have moved it down diagnally.  This doesn't really open any lines that I can see and it doesn't protect anything except for the b pawn, which I am targeting, but I think this was still a pointless move.",
        "5... e4": "Here I attack his pawn and open up a discovered attack on his rook.",
        "6. a4": "??\n\nstill just completly ignoring (or not seeing) any and all threats.  Instead, he is incesently mounting (unsuported) pawn storm attack on a pretty meaningless Queenside target.",
        "6... Nc6": "With his last pawn move he took away some of the protection for his b pawn and with this move I hope to be able to take it, or bait him into attacking my Knight so I can move my dark bishop into a position to support my attack on f2.",
        "7. b5": "He takes the bait.  however at this point I notice a move devious plan, and since he's being crazy I figure that I can do some crazy stuff too.",
        "7... axb5": "A little exchange to get things going.",
        "8. cxd5": "surprisingly he retakes a completly different pawn.  Doesn't really matter, I just wanted those pawns gone, now they are.",
        "8... Qxa1": "Now, I take his rook.  Here I had a couple of plans.\n\n9. B c3 .. Qxa4\n\nI like the board at that point, I'll just start trading pieces off the board.\n\n9. K c3 ... QxQ\n10. Kt x Q .. Ktd4\n\nThen I'm just waiting to get the Kt to c2 for mate.\n\nboth of those plans have flaws, but I was feeling crazy.",
        "9. dxc6": "Instead he just goes for my Knight.  ",
        "9... b6": "I decide to stall that action where it sits.",
        "10. dxe4": "Now he's cleared out the center of the board and this game looks really ugly for 10 moves in.",
        "10... Rxa4": "Now that I've taken this pawn I've got a rook and a queen knocking at his back door.  Neither one of us has moved King side pieces and as such I'm technically way ahead in development as I've got two major pieces roaming around a very open board and he has no pieces (save a queen that can do anything.",
        "11. Nc3": "I actually had a moment of brilliance here.",
        "11... Qb2": "I sac my Rook, seems like I have no choice.",
        "12. Nxa4": "He takes as expected.",
        "12... bxa4": "of course.  I thought he would take back with his Queen.  He didn't, but it turns out I was still able to execute this great mate.",
        "13. Bc1": "He attacks my Q.. I thought we would get to this position by.. \n\nQx a4 .. Qb1 \nQd1 .. Qb2\nbc1\n\nBut anyway, here are a few moves sooner.",
        "13... Bb4+": "!\n\nI don't think he saw this.",
        "14. Bd2": "forced.",
        "14... a3": "Now is where I wasn't sure if I would get a mate or what, but I was pretty sure I could at least get a pawn promoted or get his Queen, or both.",
        "15. Qc1": "He helped me out though, not realizing that his bishop could not protect his Queen because it was pinned.",
        "15... Qxc1#": "matey mate mate mate.\n\nIt was an ugly, ugly game and there are really no lessons to be learned here except that pawnstorming an empty Queenside really serves no purpose.\n\nI just thought it was kind of a humorous game."
    },
    "url": "https://gameknot.com/annotation.pl/ugly-yet-sort-of-amusing-game-between-brothers?gm=3610",
    "gameName": "Ugly (yet sort of amusing) game between brothers...",
    "players": "felkajamine (1162) vs. fycorsia (1288)",
    "opening": "English opening (A20)"
}