{
    "moves": {
        "1. e4": "This game is full of bad blunders, so take it for fun only. It presents an uncommon situation of a queen and a bishop against a plethora of minor pieces and pawns, and it can be an example of the goods and bads (?) of such an asset for both sides. Set your clock to 5:00am. spepo and I played a row of very funny games, full of tactics and surprises. And blunders, of course! So we also have example of a \"refuted courtesy\" (your opponent blunders badly, and you \"overlook\" the bad move so the game can go on), but your opponent doesn't accept to rectify). This gives to an unusual position, very difficult to play for both sides, that can be \"food for thoughts\" for someone. I hope you have fun with it, not to take it as a \"serious\" game. ",
        "1... d5 2. exd5 Nf6 3. c4": "Theory says that this move is \"bad\". It was the first answer the defence was designed against. ",
        "3... e6": "Bc4 was another option. I go for the Icelandic gambit (don't do it at home). ",
        "4. dxe6 Bxe6 5. Nc3": "d5 can be played. Black has some tricks about Bb4 and Ne5.",
        "5... Qe7": "...but also have this one. The plan is to develop the dsb on g7. Now white has to stop Bxc4+.",
        "6. Qe2": "Stops the threat. Now, both players are  little cramped. ",
        "6... Nc6": "Looking at c2. ",
        "7. Nf3 O-O-O": "Unlining Q/K, and avoiding d5. I am exposed with an attack on the queenside, but white has to waste some moves before it can get active. ",
        "8. d3": "Further cramping his own position, but controlling c2. I looked for a tactic based on Nb4 and Nc2+ after the queen's exchange, but I was unable to find it. ",
        "8... h6": "A profilactic move against g5. Kind of a waste of time, but I am also preparing g5 and Bg7. ",
        "9. Be3": "Looking at a7.",
        "9... Bf5": "Looking at d3...",
        "10. O-O-O": "White mimics me, but my batteries are about to be aimed there. ",
        "10... Nb4": "A stupid move, unless you may welcome a3, and the knight must sadly retire (Nxd3 is not an option yet, because after RxN, BxR, QxB, white loses two minors for a R...). Instead, 11... Bxa7 begins an interestic tactic duel: b6 (trapping the bishop), and white must think about Nb5, c6, Bxb6, bxN, BxRd8, etc. ",
        "11. Qc2": "My opponent blunders badly. I decided to try to \"save\" the game by not taking it. We were playing several games and I knew he was a good player, and that this was only a slip. ",
        "11... g5": "I played a nearly neutral move in order to give him time to rectify. ",
        "12. a3": "He didn't!!! This was a \"counter-courtesy\". \"I don't want your mercy. Chess is mercyless. I'll accept my fate\". ",
        "12... Nxc2": "\"As you desire, milord!\"",
        "13. Kxc2 a6": "No hurry now. But the simple Qe6, threatening Qxc4, was a good start, and it prevented Nb5 too.",
        "14. Be2": "White is getting very developed, due to my waste of time of the previous move. Learn, dear beginner, learn... :-)",
        "14... Ng4": "Let's start the attack. Despite the material, now white is much better developed than black!",
        "15. Bd4": "Here, I blundered. f6 was called for (or a rook move). ",
        "15... Rxd4": "I thought quickly that Nxf2 would compensate it, but I overlooked the next move. Can you see it?",
        "16. Nxd4 Nxf2 17. Nxf5": "I lost my excellent dsb, with threat! My only hope is to create more complications. ",
        "17... Qe5": "White is losing the exchange and the knight, but has taken my best piece, the lsb. My advantage has fallen by 5 points to +1. I'll get more points in the following moves, but... I played horribly!",
        "18. Ng3 Nxh1": "Time to cash in, before Rf1. ",
        "19. Rxh1": "After this plethora of bad moves, we came to the interesting position: I am +3, but white has a lot of minor pieces, building a solid wall against my queen. The disadvantage of this is that the queen cannot be exchanged, so her action is strongly limited. Her only weapon are forks.",
        "19... Bc5 20. Re1": "Threatening Bg4+. ",
        "20... f5": "Now the bishop is pinned to the rook. ",
        "21. Rf1": "I thought that f4 gave white e4 for his knights, and that I should have tried to avoid this. But I played too lightly...",
        "21... Rf8": "? f4 was called for. This gives white a nice tactic based on the white diagonal. ",
        "22. Nxf5 Rxf5 23. Bg4": "...and another exchange is lost. Wonderful, I'm playing like a GM (don't ask me for the meaning of the letters...).",
        "23... Qxh2": "...so I went with a GM move :-), creating a threat from nowehere (Qxg2+, forking the rook, of course). ",
        "24. Bxf5+": "Now I am only +1, but with Qxg2+ I will win the rook and the game. BUT I'm in check!",
        "24... Kd8 25. Be4 c6 26. Ne2": "Despite my blunder, the situation is similar to the previous: a very unbalanced but almost even set of forces. ",
        "26... Ke7": "The king seems exposed, but in fact it controls the rook. Of course, white has Bg6, threatening Rf7+. Qxg2 is the countertactic black has, with interesting lines.",
        "27. b4 Be3": "Very nice placement, but currently useless. In fact, this move seals the fate of this bishop. ",
        "28. d4 Qc7": "I had no hopes to make white abandon g2, so I have to find some other use for my queen. In a time hurry, I went for a queenside attack. ",
        "29. Kd3 Bf4": "I can't avoid NxB, and my only minor piece will be gone. With a lot of pawns on the board, this gives advantage to the minor pieces. ",
        "30. Rf3": "White wants to play for finesses, maybe Rh3. I was wrong. White is preparing g3, but I didn't see it. Anyway, the bishop is now lost.",
        "30... b5": "I have no time to prepare it properly. ",
        "31. c5 a5 32. g3": "Here, I realized I lost the bishop. ",
        "32... axb4": "If white gets greedy, maybe I have some compensation. ",
        "33. axb4 Qa7 34. gxf4 Qa3+ 35. Nc3": "Now, Qxb4 is something, but I'm lost. ",
        "35... g4": "Just to see where it leads. ",
        "36. Rg3 h5 37. Bg6": "...nowhere. h4, Rxg4, and white can defend from promotion with Be4 and Rh4. ",
        "37... Qxb4": "Let's see this way, then..,",
        "38. Bxh5 Qc4+ 39. Ke4 b4": "The point is to threat the promotion, and block white's pieces defending it. ",
        "40. Na4": "A blunder. It is difficult to play against a queen when your minor pieces are not coordinated. Now, they are scattered all around and almost inactive. Black, by \"manouvering\" (:-), has got to scramble white's game from the queenside, as desired. ",
        "40... b3 41. Nb6 Qc2+": "Nothing gives another queen's check. White is doomed. ",
        "42. Ke5 b2 43. Rg1": "Black can win a rook for a pawn, but this can be not enough, and the position is full with tactics. ",
        "43... g3": "Creating a second threatening pawn. White can't take it. ",
        "44. f5": "White exploits my exposed king, of course. ",
        "44... b1=Q": "No time to play games. I have to cash in asap and win with the g pawn. ",
        "45. Rxb1 Qxb1 46. Bf3 Qe1+ 47. Kf4 Qf2": "Now the threat is g2.",
        "48. Kg4 g2 49. Bxg2 Qxg2+ 50. Kf4": "and the game is won by black! Even so, it is an interesting and unusual fight. ",
        "50... Kf6 51. Nd7+ Ke7 52. Ne5 Qf2+ 53. Ke4 Kf6": "...and it was too late at night. Unconsciously, I returned the courtesy and gave up my queen. ",
        "54. Ng4+": "...and no trick in return, this time. I resigned! A crazy game, with funny and interesting positions of unbalanced material. "
    },
    "url": "https://gameknot.com/annotation.pl/unbalanced-sets-of-forces-countercourtesy?gm=55322",
    "gameName": "Unbalanced sets of forces - CounterCourtesy",
    "players": "spepo  vs. damalfi ",
    "opening": "Scandinavian (B01), Icelandic gambit"
}