{
    "moves": {
        "1. d4": "Hi everyone!  I have recently been annotating games based on chess blunders and some of the types of blunder we all encounter in our chess careers.  But why do we blunder?  Do they come from a clear blue sky, e.g. as a result of lack of concentration or poor board analysis?  Or does our opponent put us under so much pressure that we succumb and make that irreversible blunder?  In this game, Freddy does put the squeeze on.  Even though I am a pawn up for the best part of the game I still end up right in the mire and eventually lose a piece - I play on - more on that one later, but at the end ..... guess what ..... I get Freddied for the eighth time in my 18 games against him!  Ah well, on with the game.  Freddy starts off with d4.",
        "1... Nf6 2. f3 d5 3. e4": "3. e4 - this is the Blackmar-Diemer Gambit.  In conjunction with the database, Freddy kindly gave me a link to a Blackmar mini-tournament called Kylion's BGD mini-tournament #2.  Here is the link for any Blackmar fans! http://gameknot.com/mt.pl?id=22062.",
        "3... dxe4": "3........ dxe4 - I accept the gambit.",
        "4. Nc3 exf3 5. Nxf3": "5. Nxf3 - I decided to take on f3 to ensure that I was a safe pawn up - but with Freddy when is anything safe as far as I am concerned?  Freddy takes with the knight developing a piece.",
        "5... Bg4 6. h3 Bxf3 7. Qxf3": "7. Qxf3 - this is the downside of exchanging that bishop for the knight, it brings the Wicked Witch of the West onto the f file and white may have a ready-made attack on both wings as a result - so Henry will have to look out for himself wherever he goes!",
        "7... c6 8. Be3 e6 9. Bd3 Nbd7": "9. ......... Nbd7 - development.",
        "10. O-O Be7 11. Ne4 O-O": "11....... 0-0 - I choose the kingside for Henry.",
        "12. c4 Re8 13. g4 Rf8 14. Rad1": "14. Rad1 - Freddy centralises his QR and the pressure is on - look how aggressive his pieces are.  I decide to exchange knights but this does not ease the pressure.",
        "14... Nxe4 15. Qxe4 g6": "15. ....... g6 - forced to prevent Old Matey from striking on h7.",
        "16. Bh6 Re8 17. Qf4 f6 18. c5 Bf8 19. Bxf8 Rxf8": "19. ...... Rxf8 - one pair of bishops has been exchanged but there is still pressure.",
        "20. Bc4 Re8 21. g5 f5 22. Rde1 Nf8": "22. ..... Nf8 - this steed goes to f8 to protect the e6 pawn and he remains on f8 until he is captured some 20 moves later.",
        "23. Bb3 Qd7 24. Re5 Rad8": "24. ........ Rad8 - doubling up on the backward d4 pawn.",
        "25. Rd1 Kh8 26. Bc4 Qc7": "26. .......... Qc7 - allows a combo which I do not see until Freddy springs it on me.",
        "27. Rxf5": "27. Rxf5 !! - the surprise regaining his pawn.",
        "27... Qxf4": "27. ....... Qxf4 - Glenda is hanging so she must remove the Wicked Witch.",
        "28. Rxf4 e5 29. Re4 exd4": "29. ........ exd4 - getting rid of weak e pawn by exchanging it for Freddy's equally weak d pawn.",
        "30. Rxe8 Rxe8 31. Rxd4 Re5 32. h4 Rxc5": "32. .......... Rxc5 - regaining my pawn plus but it will be amazing how Freddy's two remaining pieces are going to tie me down.  Henry's confinement on h8 and g7 will be my waterloo here.",
        "33. b4 Re5 34. Rd8": "34. Rd8 - pinning my knight and forcing Kg7.",
        "34... Kg7 35. Rb8 Re7 36. Kf2 Re4": "36. ......... Re4 - in hindsight would b5 have been a better try?",
        "37. Rxb7+ Kh8 38. Bb3 Rxh4": "38. ........ Rxh4?? - allows Rf7 and my knight is doomed.",
        "39. Rf7 h6 40. Rxf8+ Kh7 41. Rf7+ Kh8 42. gxh6": "42. gxh6 - Freddy is a full piece up, worse, Henry is further entombed.  I take on b4 next move but if I had taken on h6 instead I may well have avoided copping Old Matey later on!",
        "42... Rxb4 43. Kg3 a5 44. Bc2 Rb5 45. Rf6 Rh5": "45. ....... Rh5 - too late.",
        "46. Rxg6 c5 47. Ra6": "47. Ra6 - threatening mate on the move - I can now only avoid it by resorting to checks and then somehow getting my rook onto the back rank.",
        "47... Rg5+ 48. Kh4 Rg2": "48. ........ Rg2?? - Rg8 would have put a stop to Old Matey but I would have dropped my queenside pawns and then that remote a pawn may well have crowned.",
        "49. Bg6 Rh2+ 50. Kg5 Rg2+": "51. ...... Rg2+ - now follows a series of checks which Freddy's king manages to evade.  It has to be said that even when a piece down, an active rook or queen can keep you in the game in the ending because of the possibility of perpetual check - the perpetual can also grab a few enemy pawns.  It did not work here because Henry was constantly in Old Matey's shadow.",
        "51. Kf6 Rf2+ 52. Ke7 Re2+ 53. Kd7 Rd2+ 54. Kc7": "54. Kc7 - mate is unavoidable and can only be delayed by sacrificing my rook.  I am in no mood to do this, rather I feel like taking whatever I can from Freddy before he can deliver the blow.  It comes immediately after I take the pawn on a2 because Freddy set up a conditional move to put me out of my misery quickly.  It can be all so easy to crumble under pressure.",
        "54... Rxa2 55. Ra8#": ""
    },
    "url": "https://gameknot.com/annotation.pl/under-pressure-pt-1?gm=22738",
    "gameName": "Under Pressure - Pt.1",
    "players": "easy19 (2193) vs. jstevens1 (1772)",
    "opening": "Blackmar-Diemer gambit (A45)"
}