{
    "moves": {
        "1. e4": "Standard King's Pawn opening.  I explore this one mostly due to Bobby Fischer, even though statistics show a slight edge to a Queen's Pawn opening.",
        "1... c5": "Best play for black against the King's Pawn opening.",
        "2. Nf3 Nc6 3. Nc3 e5 4. Bc4 a6 5. O-O": "Normal developing moves up to this point.",
        "5... b5": "Challenging the bishop.",
        "6. Bd5": "Saving it and attacking the knight.  If 6. Bb3 then 6...c4 loses material.",
        "6... Nf6": "Attacking the bishop.",
        "7. d3": "Opening up a line for my dark square bishop and strengthening my pawn chain.",
        "7... b4": "Pushing forward and attacking the knight.",
        "8. Bxc6": "Exchanging the pieces.  If 8...bxNc3 then 9. BxRa8.",
        "8... dxc6 9. Ne2": "Getting the knight out of harms way.",
        "9... Bg4": "Looks like a skewer.  What to do?",
        "10. Ng3": "Now the knight on f3 is pinned, but if Black exchanges then it doesn't mess up the pawn structure around my king.  Plus, I don't like the fact that he has his light square bishop and I don't.  Therefore I welcome the exchange, which would simultaneously activate my queen.",
        "10... Be7 11. h3": "Putting the bishop to the test.",
        "11... Bxf3": "Obliges the trade.",
        "12. Qxf3 O-O": "Normally when both kings castle on the same side games are more positional and less explosive.",
        "13. b3": "Looking to position my dark square bishop on the long a-8 diagonal, staring down his king.",
        "13... Qd4": "The queen enters the fray inside my territory and threatening to win the rook on a1.  Simultaneously foiling my plan of Bb2.  I need to activate my remaining bishop and connect my rooks.  But how?",
        "14. Bh6": "A bishop sacrifice!  After 14...gxh6, 15. Nf5 threatens the overextended queen and prepares Qg3+ and Qg7++.",
        "14... Ne8": "Declines the sacrifice AND protects the critical g7 square.  Drat.  There is no active square for my dark square bishop to go.  Black's central pawns are all over the dark squares, and the only safe place is d2.  I don't like that so I continue my plan.",
        "15. Nf5": "A very nice out post for the white knight.  Not only putting pressure on g7, but also threatening the black queen.",
        "15... Qc3": "The queen enters deeper into white's camp.  I believe this is a mistake.  Even though black's queen is threatening a hanging c2 pawn, there is dangerous activity from white on the king's side.  How can white capitalize on this?",
        "16. Nxe7+": "This bishop is hanging and white gobbles it up with check.",
        "16... Kh8": "Forced.",
        "17. Bxg7+": "Breaking open a critical defended for the king.",
        "17... Nxg7 18. Qf6": "The knife in the side.  The white queen pins the black night and black's queen is at least two moves away from the action.",
        "18... Rae8": "Bringing another defender to the aid of the king.",
        "19. Nf5": "Threatening Qxg7++.",
        "19... Rfg8": "Defending the threat.",
        "20. Nh6": "Threatening Nxf7++ and also attacking the rook on g8.",
        "20... Rgf8": "Defending both threats.  At this point black is all blocked up.  The critical decision here is whether to keep the knight on h6 or f5 before bringing more pieces into the attack.  I calculated this position to be winning.  I looked at the line with the knight on f5 and even though it suppresses the black queen, white can still be harassed by the black rook on e8.  I expect this harassment either way, and I prefer my response from this position.  Exploration and comments regarding the line of the knight on f5 is welcomed.",
        "21. Rae1": "Bringing another piece into the attack.",
        "21... Re6": "The harassment previously mentioned.",
        "22. Nxf7+": "Winning a pawn and checking the king.  But more importantly, if 22...Kg8 then 23. Nh6+ Kh8 24. Qxf8++.",
        "22... Rxf7": "Forced.",
        "23. Qxf7": "And this is about where I calculated.  Here white is up the exchange, black's king side is broken, and the white queen is on the seventh rank.  Next would be to bring the rook on e1 out and then start gobbling up material on the queen side.",
        "23... Rg6": "Mistake.  Correct is 23...Re8.  Defending the back rank mate with the knight on g7 protecting the rook on e8. Here the white rook on e1 could then enter the fray and the black queen would be compelled to come to the aid of her husband.  Instead, since 23...Rg6 -",
        "24. Qf8#": "Good game."
    },
    "url": "https://gameknot.com/annotation.pl/under-pressure?gm=57675",
    "gameName": "Under Pressure",
    "players": "johnmv1 (1700) vs. troehrl (1535)",
    "opening": "Sicilian defence (B30)"
}