{
    "moves": {
        "1. b3 Nf6 2. Bb2 d5 3. e3 e6 4. Nf3 Be7 5. c4": "I want to challenge his center pawn with this one. That's why I'm waiting to play Nc3 until after it won't block this pawn.",
        "5... O-O 6. Be2 Nbd7 7. O-O c6": "I feel like my position's wide open with lots of room for maneuvering. His is cramped -- and he's done it to himself. I don't have any pawns on his side of the board, and none of his pieces are pinned.",
        "8. d4": "I also thought about Nc3 here. But by making this move, I still have the option of moving it to c3 or d2.",
        "8... dxc4 9. Bxc4 b5 10. Bd3 a6 11. Qc2 Bb7 12. Nbd2 Rc8 13. Ng5": "So why would I make a threat that's so easy to stop?\nI'm watching his pawn on c6. I figure eventually it'll go to c5, and I'll have to retreat my queen. Before I leave this diagonal, this move forces him to weaken his kingside pawns. I don't know how I'll use that yet.",
        "13... h6 14. Nh7 Nxh7 15. Bxh7+ Kh8 16. Be4": "I looked at different sacrifices after he plays g6 to trap the bishop, but none were real appealing. And I hated to move the bishop to e4 because I'd also have liked to put the knight there. But I like that the bishop pins the c-pawn for now, and I still have a decent spot at f3 for my knight.",
        "16... Qb6 17. Rac1": "But I decided that I couldn't play Nf3 because that's where my bishop will have to go after he plays f5.",
        "17... c5 18. Qd1 Bxe4 19. Nxe4 Qb7 20. Nxc5": "I kept looking for a way to make dxc5 work -- with the Queen going to d4 after the knight takes at some point. The problem was that he just plays Qxe4. So I'll start with my knight capturing instead.",
        "20... Nxc5 21. dxc5 Bxc5 22. Qh5": "My double attack is threatening Rxc5 and also Qxh6+.",
        "22... e5 23. Bxe5": ""
    },
    "url": "https://gameknot.com/annotation.pl/unexpected-double-attack-ends-the-game-quickly?gm=23835",
    "gameName": "Unexpected double-attack ends the game quickly",
    "players": "chuckbo (1917) vs. karkarov (1878)",
    "opening": "Nimzovich-Larsen attack (A01), Indian variation"
}