{
    "moves": {
        "1. e4": "Hello everyone, I thought i would share this game because I've never seen this response to the opening played so I thought you wouldn't have either! (sorry if you have, i'm not that old a chess player that is why I wouldn't have seen it I guess:))\r\n\r\ne4.",
        "1... e5 2. Nf3 Nc6 3. c3": "3. c3 - The ponziani opening (the opening I usually play.)",
        "3... f5": "3. ...f5! - I've never seen this before but I definatly find it an attacking approach against the ponziani.",
        "4. d4": "4. d4 - a typical ponziani move.",
        "4... exd4 5. Bc4": "5. Bc4 - Ignoring the fact I can take blacks pawn.",
        "5... Nf6": "5. ... Nf6 - A natural developing move.",
        "6. e5": "6. e5! - putting pressure on blacks knight.",
        "6... d5": "6. ...d5?! - counter threatening whites bishop but after black eventually moves their knight they can't defend the d4 pawn.",
        "7. Bb5 Ne4": "7. ... Ne4 - moving the knight of trouble but white may start attacking towards blacks queen side through Nxd4",
        "8. Nxd4 Bd7 9. e6": "9. e6! - threatening to win the black bishop so he has to move it really but after that NxN at least wins the Knight.",
        "9... Nxd4": "9. ... Nxd4!? - Leaving the black squared bishop threatened by a pawn and a piece (the pawn and bishop) with check so black will lose a piece and control of blacks defense.",
        "10. Bxd7+ Ke7 11. Qxd4": "11. Qxd4 - winning the knight and central control.",
        "11... c6": "11. ... c6? - there isn't much black can do at this stage but i'm sure black could have tried to strengthen their defences with something like 11. ... h6.",
        "12. f3": "12. f3! - forcing blacks knight of the square which protects Bg5+! so there isn't much black can do.",
        "12... Nd6": "12. ...Nd6?? - a surpirsing move leaving a mate in one on, although there isn't much places the knight could have moved for example if 12. Nf6?? 13.Qc5 would be checkmate aswell.",
        "13. Bg5#": "So this variation didn't go down too well in this game but i'm sure it would be fine in some other cases :)"
    },
    "url": "https://gameknot.com/annotation.pl/united-chess-nations-vs-international-chess-dogs?gm=24257",
    "gameName": "United Chess Nations vs International Chess DOGS",
    "players": "jamydodger (1754) vs. macnecio (1709)",
    "opening": "Ponziani counter-gambit, Schmidt attack (C44)"
}