{
    "moves": {
        "1. e4": "Except for a tournament round that I played in last summer, it was really more than a year long that I played my last game\nhere. Here I am again with my first finished game for my second coming.",
        "1... c5": "Sicilian is my best defense against e4. The many losses I endured with this defense never urged me to re consider my choice.",
        "2. Nf3 d6 3. d4 cxd4 4. Nxd4 Nf6 5. Nc3 a6 6. Be2 e6": "I like these a6 and e6 moves : eventhough I don't understand theory in chess, I really appreciate these moves and feel the comfort they provide. Of course here stops my knowledge of the Sicilian, I would never allow myself to learn more : it is time to take personal action depending on opponent moves.",
        "7. O-O Be7": "Well I should say that sometimes I consider putting B on g7, but that only happens when White moves his dark B instead of the light one on move 6. And in such case, I learnt to delay moving e6 to a very late time in the game (It is easy to note that the pawn can otherwise become an easy target as soon as 3 or 4 moves).",
        "8. Be3 O-O 9. h3": "h3 ? Planning g4 already or just fearing a Black piece on g4 ?",
        "9... b5": "So, time to take action : I will threaten e4.",
        "10. Bd3 Bb7": "Again e4 is threatened with b4 removing away the Nc3.",
        "11. f4": "I thought I won a pawn, but then found that my opponent can save it with e5. However, the result of it -I thought- is a comfortable position. Maybe an achievement out of the Sicilian defense !",
        "11... b4 12. e5": "Actually I forgot why I did not consider the opportunity of opening the d rank here with dxe6.",
        "12... bxc3 13. exf6 Bxf6 14. bxc3": "I really think it is a satisfactory position for Black. My both Bs are active and the initiative is mine.",
        "14... Qc7": "Attacks c3. ",
        "15. Qe1 Nc6": "It has been time ago when I used to develop pieces and sell the opportunity for my opponent to liquidate material for free.\nEnough for the many losses where all of my pieces are exchanged then unexpectedly find myself into a hard-to-figure-out inferior ending-game !\nSo I was considering Nd7 before I discovered that NxN leads to a double attack on White (mate on g2 and attack on c3). So I selected Nc6, of course c6 is much natural than d7.",
        "16. g4": "My opponent is very aggressive ! Here I wanted to show my aggressively as well. ",
        "16... Nxd4 17. cxd4 Qc6 18. Qg3 Bh4": "It is not chess here, just showcase of aggressiveness",
        "19. Qh2": "Nothing is achieved of course.",
        "19... Rfe8 20. Bf2 Bxf2+": "And BxB. Of course do not accuse me of self-contradiction here for what I previously said about avoiding the unmeaning liquidation of material. Besides, if I retreat the B, then it can be positive for Black in light of obliging White's Q to stick to its position to prevent Qh1# now that f2 is not an escape square.\nHowever, when I saw the possibility of winning a pawn out of BxB, I could not resist such a concrete advantage as a having an extra pawn.",
        "21. Rxf2 Qc3": "So, Q attacks both Rh1 and d4 pawn.",
        "22. Rd1": "To my bad luck, taking on d4 is not possible because of the discovered Bxh7+ check. However, the fact that White's Ra was diverted from protecting the a-pawn came as a consolation to me.",
        "22... Bd5": "And if the pawn advance I will bring Q to a.",
        "23. Qg3": "What ? I can't take on a2 either ? Ok then, let's protect our Queen from White's.",
        "23... Rec8 24. f5": "Oups! What's going on ? I really hate surprises.",
        "24... Bxa2": "So I accepted the eventuality of a pawn on f6 in exchange for keeping the f-file closed.",
        "25. f6 g6 26. Qh4 Kh8 27. Qh6": "This move frightened me, as I thought there was something planned after my expected Rg8.",
        "27... Rcg8 28. Qf4": "Thank God, there was no threat. He just wants my rook to come there.",
        "28... e5": "It was safe to do this, I think.",
        "29. dxe5 dxe5 30. Qa4 Bd5 31. g5": "The a6-pawn did not lure my opponent. So let's give him the e4 pawn.",
        "31... e4 32. Bxe4 Qg3+ 33. Bg2 Bxg2 34. Rxg2 Qxh3 35. Qf4": "What did I achieve from this manoeuvre ? Nothing except the realization that my extra-pawn advantage is a chimera. The exposure of Kg1 plays it its own safety While the pawn setup surrounding my king meant that at most I can keep a rook at the 8-th rank and bring two heavy pieces against White's three. Furthermore, My King position somehow meant that manyy scenarios that involve the exchange of pieces would lead to unfavorable ending game.",
        "35... Rge8": "And of course I had to face the immediate threat of Rh2 ( Followed by Qh attacking h7).  So here I was planning a solution that requires the exchange of Qs. How dramatic !",
        "36. Rg3 Qh5 37. Rgd3 Re2 38. Rd3d8+ Re8 39. Rd8d2 Rac8 40. Ra1 Re2": "My only resort ; White is trying to attack the a pawn. I had to cure the passivity of my Q by exchanging the R that threatens Rh2.\n",
        "41. Rxe2": "Also White does not have other options. The complete exposure of his K is limiting his options with other pieces.",
        "41... Qxe2": "I am relatively in a safe position. But I had to solve the K-safety issue and then make use of the extra pawn.",
        "42. c4 Qe6 43. Rc1 h5": "I could not imagine another moment to do it. White's Q cannot touch the g file because of White's K being on the same g-file. Also, the fact that Black Q can target e3 which is common to Kg1 and Rc1 implies that White's Q will be restricted in its choices.",
        "44. gxh6 e.p. g5 45. Qd4 Kh7": "I thought the victory is mine here, by forcing Black to lose f6. Two choices were possible : either the Kh7 or the Rc6. I selected Rh7 and was expecting Rc2.",
        "46. c5": "No, he played c5.",
        "46... Kxh6 47. Rf1 Qh3": "I played this in view of the posibility to force White's K to be on h file, then after my Kg6, I cumulate\nto the existing threats on White's pawn, the idea of Rh8+. ",
        "48. Rf2 Qg3+ 49. Kh1": "This really came as a shock to me. My head was telling this would only precipitate the plan of Kg6. However, as R is still on f-file guarding f6 and Whites' Q able to play e4+, my king is in danger. I soon realized that my plan was incorrect and I have to cope with the inevitabilily of R+ and my K to tour the World. Now you can understand the title of the game.",
        "49... Rb8": "So I played this more as a defense than as an attack. Q and R needed be connected as a means to secure the R from potential Q checks attacking both K and R.",
        "50. Rh2+ Kg6 51. Qe4+ Kxf6": "And the journey began.",
        "52. Rh6+ Kg7 53. Qh7+ Kf8 54. Qh8+ Ke7 55. Qf6+ Ke8": "Of course Kd7 loses to Qx followed by R#",
        "56. Rh8+ Kd7 57. Qxf7+ Kc6 58. Rh6+ Kb5": "Taking the pawn would have been the biggest mistake in the game as it would make it possible for coordinate a checkmate using R and Q.",
        "59. Qd7+": "The choice of Ka was discovered to be bad, I can't find out why now.",
        "59... Kc4 60. Qe6+ Kc3 61. Qf6+ Kc4 62. Qxa6+ Rb5 63. Qa4+ Rb4 64. Qc2+ Qc3 65. Qxc3+": "And nothing can be achieved by either sides. \nThanks for reading. Thanks to my opponent for his great play too.\nSee you in another game !"
    },
    "url": "https://gameknot.com/annotation.pl/unpleasant-miss-calculation?gm=35186",
    "gameName": "Unpleasant miss-calculation",
    "players": "magnus50 (1722) vs. potatosoftware (1607)",
    "opening": "Sicilian (B92), Najdorf, Opovcensky variation"
}