{
    "moves": {
        "1. d4": "In a unrated game you can give your opponent a chance at winning with out effecting your rating or theirs, Game was accepted and white opened with the d4 opening. I opened as black with b5, with the plan to fianchetto my bishop on my Queen side.",
        "1... b5": "Sticking to my plan",
        "2. e4": "d4 then e4 as expected",
        "2... Bb7": "My bishop in position",
        "3. e5": "advance pawn, This move opens the e4 square and now my bishop has a  better position",
        "3... e6": "e6 is played and opens up my Queen and my other Bishop. I leave my pawn on b5 hanging, setting a trap to be taken by whites lsb. If taken the Bbxg2 attacking rook. This is important to note that when you take with your B on the home row you leave your Rook's adjacent pawn in-protected. ",
        "4. Bxb5": "BxP takes the bait  Blunder best move nf3 to develop and protect p on d4.",
        "4... Bxg2": "Bxp attacking  the Rook",
        "5. a3": "a3 is played",
        "5... Bxh1": "BxR",
        "6. Be3": "white develops a B",
        "6... Nc6": "I develop my Q side N.",
        "7. Nc3": "white develops N",
        "7... Rb8": "I relocate my R to the b-file.",
        "8. Bxc6": "BxN",
        "8... Bxc6": "BxB",
        "9. Qd2": "Q is developed this move is a mistake, b3 is a better move to protect the b pawn",
        "9... Rxb2": "RxP is taken because of the mistake of developing Q instead of b3",
        "10. Bg5": "B is relocated and to attack blacks Q.",
        "10... Ne7": "N is moved to block the attack.",
        "11. Nge2": "N is developed in front of the K.",
        "11... h6": "pawn attacks B",
        "12. Bh4": "B retreats",
        "12... Qa8": "Q is moved to the a-file with possible attack to the h1 square if my B is moved  there ",
        "13. Qc1": "Q attacks R",
        "13... Qb7": "Q moves to b-file protecting my R.",
        "14. d5": "P attacks lbs",
        "14... Nxd5": "N take of the attacking P on d5",
        "15. Nd4": "White moved N a 2nd time",
        "15... Nxc3": "Black N is also moved again landing this time on outpost c3 ",
        "16. Nxc6": "N takes Bc6",
        "16... dxc6": "pawn takes back the N ",
        "17. f4": "pawn f4 is played",
        "17... Be7": "B is developed to e7. attacking whites Bh4.",
        "18. Bxe7": "B takes B",
        "18... Kxe7": "White B is taken by Blacks K who is not able to castle.",
        "19. Qd2": "White moves Q to d4, This is another blunder",
        "19... Rb1+": "Black checks Rb1+",
        "20. Rxb1": "R takes R",
        "20... Qxb1+": "Q takes R+",
        "21. Kf2": "Kf2 to get out of check",
        "21... Ne4+": "Last move of the game N e4 forks Q and checks K\n\nThis was 21st move and White resigns."
    },
    "url": "https://gameknot.com/annotation.pl/unrated-training-game?gm=62869",
    "gameName": "UNRATED TRAINING GAME",
    "players": "tennesseehiker (992) vs. redfoxrising (1932)",
    "opening": "Polish defence (A40)"
}