{
    "moves": {
        "1. e4": "a second game versus my dear nuntar, an excellent commentator. I hope he will add some comments here. ",
        "1... c5": "I try always more the sicilian, and forget the russian, with which I don't win anymore since I meet stronger players.",
        "2. Nf3 d6 3. Bb5+": "i have already seen comments about this, but, to my opinion, this only worth to simplify rapidly and avoid two-bishops endings.",
        "3... Bd7": "I don't like the idea to put my knight here and block my bishop for 2 more moves, when white can freely develop on the center.",
        "4. Bxd7+": "forced, unless white loses a tempo or has to develop the queen too fast.",
        "4... Nxd7": "maybe better was to take with the queen, allowing the knight to arrive on more natural c6 after.",
        "5. c4 Nb6": "forbidding any intention to put the queen on a4 or to threat b7 via b3.",
        "6. Qe2": "d3 was more logical, according to me",
        "6... e5": "this is a structure i am used to. But this time, I made a mistake, because none of my horses can easily go on d4. So, the sutrcture is pointless... I played too fast, because i hate openings. I have to discipline myself...",
        "7. O-O Nf6 8. Nc3": "he, on the other hand, could imagine to go on d5 or b5 (which he will), whenever he wants and, by the resultance of an exchange on d5, have a dangerous pawn there, pointing e6 and c6.",
        "8... Be7": "seeing no point in fianchetto, here. My black bishop will be one of my two main pieces later. watch him and my b6 knight",
        "9. d3": "see move 6.",
        "9... O-O": "he castled, so i castled.",
        "10. Bg5": "Considering d2 better to me; here the bishop only threat a defensive and redundant piece.",
        "10... h6": "a natural move",
        "11. Bxf6": "I really was surprised here. And nuntar sent me a message later, pointing it was not the best move ever. I agree.",
        "11... Bxf6": "forced.",
        "12. Rfb1": "white will attack on queen side. Looks clear. Seems that our pal has read the principle of the symmetrical english, which is the closer situation we have arrived on here.",
        "12... Qd7": "this move was very much thought. I intended to authorize a return for my bishop and planned a f5-move. on the other hand, i regretted the loss of a potential position for my knight.",
        "13. a3": "obviously preparing the assault on b4",
        "13... a5": "we need, not to impeach, but to slow down this attack",
        "14. Nb5": "an obvious and good position. ",
        "14... Be7": "free the queen off the protection of d6 and prepares f5. ",
        "15. Qd2": "accumulating force on b4",
        "15... f5": "king-side attack: i know my classic too. Though my own attack will not arrive soon, we may note that this f5-pawn will be the great winner of the game... Totally unexpected. We'll see that I counted more on my g-pawn later.",
        "16. b4": "Concretisizing the plan. But I still think it is premature: maybe should have prepared with Ra2 and Rba1.",
        "16... axb4": "forced, but happy to do it. I saw the combination that will follow without a problem. I meant, not to have a piece for two pawns, as it happened, but to gain a lot of space. Later I thought it was risky, but, he, what good game is not?",
        "17. axb4": "apparently no choice. Opening the a column, to my great joy. I was thinking, after my next move, that he could imagine to take a8, but for me it was not a problem. It would have cut the attack in two. My own attack would then have been double: a column and f5.",
        "17... cxb4": "I thought to myself: he will have to leave the pawn, because of d5 attacking b4 with the bishop",
        "18. Qxb4": "but no.",
        "18... d5": "well, then, attacking. I thought here about 19 Qb3 here...",
        "19. Nxe5": "it surprised me that he chose this variant. I foresaw it and thought it was not very intersting for him. but c5 is not very interesting: c5 dxc 20. dxc fxc and black is very strong. ",
        "19... Bxb4": "i chose the variant where i win a piece...",
        "20. Nxd7": "both queen disappeared!",
        "20... Rxa1": "\n20. ... Nxd7 has the same result as the main line, because he can't take my bishop: 21. Rxb4 Rxa1+ and mate on next move. Or 21. Rxa8 Rxa8, and still cannot take the bishop.\nhe would have simply taken exd. Like he will 2 moves later",
        "21. Rxa1 Nxd7 22. exd5": "so this is 2 pawns for a piece. ",
        "22... Re8": "threatening",
        "23. g3": "giving air. Maybe Rf1 was sufficient, but then he still can't move his rook from line 1",
        "23... Re1+": "the exchange may not have been the cleverest thing i made, but i felt confident with b7, my knight and my bishp to block his pawns. I just did not figure my king would meet some difficulties to pass. \nHowever, i did not want to be preoccupied by moves like Ra7, or Rb1",
        "24. Rxe1 Bxe1 25. Kf1": "i guess the main goal was to approach the king to the center, not to threat the bishop",
        "25... Bb4": "i had no hesitation on that move. Was it interesting to consider a5 or d2? ",
        "26. Ke2": "more than logical, obvious and necessary",
        "26... b6": "preventing any will to approach too soon by d4-c5, and pre-protecting the pawn: my knight is very strong as a defensive piece.",
        "27. f3": "i don't see any reason for that",
        "27... Kf8": "losing a tempo. There was no need not to go directly on f7 - i lost a lot of tempo from now!",
        "28. Ke3 Ke7 29. Kf4 g6": "4 logical moves, but now white has to be careful: there is a potential mate by Bd2x",
        "30. g4": "interesting, but foreseen. ",
        "30... Bd2+": "the king has to leave the center.",
        "31. Kg3 f4+": "i intend to keep my pawnschain",
        "32. Kf2 Kf6": "pointing e5?",
        "33. Ke2 Be3 34. d4": "defending e5.",
        "34... Kg5": "real target: h4. ",
        "35. Kd3": "foreseen, but powerfull of course.",
        "35... Nf6": "and this is where my knight is really powerfull too! He gives me 2 free moves.",
        "36. d6": "threatening seriously now",
        "36... Kh4": "?! here, i may have played too fast. Maybe h5 was more clever!!!!!\n\nI had in mind to make pass my g pawn here. This was the first time the g-pawn was considered by me the key of success. I got totally wrong.",
        "37. Nc7": "threatening Na8, but then Nd7; Nd5, but then Nd7 and Ne8, but then Nd7 :-) The three moves resulting in the possibility for the white king to penetrate.",
        "37... Bg1": "?! losing time again: i had two tempos, and I lost them!!! At the time i really thought there were good moves.",
        "38. Ne8": "one of the three options",
        "38... Nd7": "the only answer. Of course not Nxe8, losing automatically on d7.",
        "39. Ke4": "penetrating!",
        "39... Kg5": "panicking! why not Bxh2?... Whatever... after an excellent move 35, I lost 4 moves.",
        "40. Kd5": "here white seems better, thought I foresaw all of his moves...",
        "40... h5": "FINALLY!",
        "41. h3": "The best answer",
        "41... hxg4 42. hxg4 Kh4": "where it should have stayed...",
        "43. Ke6": "i think that Kc6 was slightly better, but i am not sure why",
        "43... Nb8": "preparing the \"La garde meurt mais ne se rend pas\"",
        "44. d5": "saving the precious pawn",
        "44... Kg3": "pointing the last blocker",
        "45. d7": "provoking",
        "45... Nxd7": "La garde meurt!",
        "46. Kxd7 Kxf3": "equalling material.",
        "47. Ke6": "once again, Kc6? Or Kc7? Or even Nf6? to come back and try to kill my attacking f-pawn?",
        "47... Bc5": "of course: my bishop has to impeach the d-pawn to arrive on destination.",
        "48. d6 Bxd6": "\"La garde meurt...\" twice a day",
        "49. Kxd6": "reversing situation... but only one pawn for the material",
        "49... Ke3": "and now the freewheeling",
        "50. Kc6": "?? Why not to launch the knight against the f-pawn?",
        "50... f3": "now it is free",
        "51. Kxb6": "freeing the way for his own pawn.",
        "51... f2 52. c5 f1=Q 53. c6": "maybe white intended to force the passage.",
        "53... Qf8": "but this is the winning move. There is no escape for the knight. If 54. c7, then Qxe8, 55. Rb7 Kf4, and my new born queen will sacrifice on c8 if necessary to let g-pawn win the game. This is why I thought",
        "54. Nc7": "Nd6, Nf6 or Ng6 were not better. All losing the knight and then the pawn.",
        "54... Qb8+": "hello!",
        "55. Kc5 Qxc7": "this is over. Thank you Nuntar: we made a lot of mistakes, but the game was beautiful",
        "56. Kd5 Kf4": ""
    },
    "url": "https://gameknot.com/annotation.pl/unrated?gm=33612",
    "gameName": "unrated",
    "players": "nuntar (1693) vs. thitho (1726)",
    "opening": "Sicilian (B52), Canal-Sokolsky attack, Bronstein gambit"
}