{
    "moves": {
        "1. e4 e5 2. Nf3 Nc6 3. d4": "Scotch game, considered fairly moribund until revivified somewhat late last century by Harry Kasparov.",
        "3... exd4": "The most usual and probably best response.",
        "4. Nxd4": "This inaugurates the Scotch Game.  If White is more adventurous, he can try various gambits (Scotch, Goring) by 4.Bc4 or 4.c3.  Both lead to interesting play.",
        "4... Bc5": "Black's range of options here is huge.  One possibility, a sometime favorite of W. Steinitz, is 4...Qh4.  I've tried it myself on GK, though on the second occasion it got me into some hot water...",
        "5. Nxc6 bxc6": "An automatic response, you might think, but in fact much more frequently played is 5...Qf6, threatening a mate on f2.  White usually responds with 6.Qf3, whereat Black takes 6...bxc6.",
        "6. Bc4 Nf6": "Instead, 6...Qh4 has been tried a number of times... with indifferent success...",
        "7. Nc3": "Better than pushing the pawn to e5, I think.",
        "7... O-O 8. Bf4": "(!?) Completing the mobilisation of the minor pieces.  More usual here is 8.0-0, probably because it is safer.",
        "8... Re8": "(!) Attacking the centre before White's King can depart the scene.  Probably White ought to castle out of trouble right now: 9.0-0 Nxe4 10.Nxe4 Rxe4 11.Bxf7! (Desperado!) 11...Kxf7 12.Qf3 Rxf4 (White was threatening 13.Bxc7+) 13.Qxf4+ Kg6 (Not 13...Kg8 14.Qc4+ picking up the bishop).  White would have had work to do to survive with a rook for 2 bishops, but his prettier pawns will have been a help.  Possibly White could enquire after a draw by 14.Qg3+ with the idea 14...Qg5 15.Qxc7.",
        "9. Qf3": "(?) 9.0-0",
        "9... d5": "(!) Very strong.  Black is about to smash open the centre.  White is in trouble...",
        "10. Rd1": "(??) ... and this move ought to have been fatal.  Probably best is to cover up by 10.e5 and hang on.  The pin on the e-pawn would be matched (more or less) by the one on Black's d-pawn.   Although not as effective as the bishop move, even 10.0-0-0 is better than the text, though 10...Bg4 would have been very nasty.",
        "10... dxe4": "(?!) Not the best, as it happens.  10...Bg4 would just about have been curtains.  Now White gets a reprieve...",
        "11. Nxe4": "(?) I think James must have overlooked the fact that after 11.Rxd8, the e8-rook would have been (half-)pinned, and could have been exchanged off.  After 11.Rxd8! exf3+ 12.Rxe8+ Nxe8 13.gxf3 Nd6 the game would have been near on even. Now Black wins a piece...",
        "11... Rxe4+ 12. Qxe4": "(?) That Black has an immediately decisive continuation here is not easy to spot, as the move he does play (12...Qxd1+) seems so obvious, and it gives Black a big advantage as well.  Objectively best was 12.Be2, accepting the loss of a minor piece.  But Savielly Tartakover once observed with hard-headed acuity: 'Sometimes the second-best move is better than the best move!' ",
        "12... Qxd1+": "(!?) Black could have forced White's capitulation with 12...Bxf2+! 13.Ke2 Bg4+! winning White's Q whilst saving his own.",
        "13. Kxd1 Nxe4 14. Re1": "Mobilising his rook, and apparently pinning the knight against the empty e8-square.  Unfortunately, Black's knight is not pinned.  Of the two options available (...Nd6; and ...Nxf2+), Black chooses the more aggressive...",
        "14... Nxf2+ 15. Kc1 Bf5": "Possibly more circumspect was 15...Bd6, but this move contains some interesting surprises.",
        "16. Re5": "As you would expect.  Doesn't this rook fork win one of the bishops, and restore the material balance?",
        "16... Bxc2": "(?) Bringing the game back to near-equality.  With 16....Rd8! and the threat on mate on d1, Black would enabled himself to keep his extra piece, e.g.: 16...Rd8 17.Be2 Rd5!",
        "17. Rxc5": "Probably the better of the two captures available.",
        "17... Bd3": "Slightly better might have been 17...Be4.",
        "18. Rxc6": "Of course, not 18.Bxd3??",
        "18... Bxc4 19. Rxc4 Nd3+": "With the clear intention of exchanging off the minor pieces...",
        "20. Kc2": "Rather risky.  Black could now have been a real nuisance and played 20...Ne1.  Mind you, White might have been equally obdurate and tried 21.Kc1 in response: 'Care to repeat moves?'  ",
        "20... Nxf4": "But Black's not interested in such finesses...",
        "21. Rxf4": "This rook ending, although Black has an extra pawn, is well-nigh even.  Black's split pawns on the Q-side somewhat depreciate his extra pawn on the other wing.",
        "21... g6 22. Kc3 Kg7 23. Kc4": "(!?) A little dubious, I feel.  White could just about have forced a draw at this or the previous move by attacking the c- and a-pawns: 23.Rc4 Rc8 24.Ra4 Ra8 etc. Now the rook's access to the Q-side is blocked, and King has almost lost touch with his own pawns...",
        "23... Rd8": "Right idea, but the rook ought to have moved one further square.  Possibly Black, fancying his chances with an extra pawn in aa pawn ending, was hoping that White would offer a rook exchange by 24.Rd4...",
        "24. b4": "(?!) Better was 24.Kc3, keeping the enemy rook out of the second rank.  But White could also have contemplated going into the pawn ending after 24.Rd4! Rxd4!? 25.Kxd4 - a very interesting line of play.  For instance, 25...f5 26.Ke5 h6 27.h4! looks very favorable for White.",
        "24... Rd6": "(?) Too passive.  24...Rd2 was indicated, and Black would have had a distinct edge.",
        "25. Kc5 a6": "It was not too late for ...Rd2.",
        "26. Rd4": "(!) Well played!  Surely Black dare not accept this exchange offer?",
        "26... Rxd4": "Overestimating his chances in the ensuing endgame - though it is easy to suppose Black is fine here.  After all, the recapture lures the White King away from the Q-side, where Black is weakest...",
        "27. Kxd4 Kf6": "(!?) Possibly already Black ought to have been looking to counterattck on the K-side - advancing his pawns...",
        "28. Kc5": "(!) A nice little finesse.  In this instance 28.Kd5 would seem just as good, and indeed it is.  Black will respond 28...Ke7.  But in moving at once to the c-file, White offers Black the opportunity to move 28...Ke6? instead, whereat 29.Kc6 grabs the 'Opposition' and an extra tempo.",
        "28... Ke7": "Black doesn't buy it (nor was there any reason that he should).",
        "29. Kc6 Kd8 30. Kb7 h5": "(!?) Launching his counterattack at last.  In ordinary circumstances, one might have been inclined to play the 'candidate' pawn first: ...f5.  But Black is hoping to accelerate the process by inducing a weakness in White's K-side.  Had White's attack on the other wing been less well advanced, this would have been a very good plan.",
        "31. Kxa6": "(!?) Sufficient.  But I would seriously have considered playing 31.a4, first. Then, supposing Black were to play 31...h4, continued like this 32.a5! ... (one would like to play 32.b5, here, but 32...a5 spoils the party) 32...h3  33.g3 f5 34.b5 etc.",
        "31... h4 32. a4": "Also good was 32.Kb7",
        "32... h3 33. g3 g5": "Diabolical cunning.  White might have been tempted to try and lame Blacks K-side by 34.g4 - normally a good policy.  But here, Black would have come storming back: 34.g4? f5! 35.gxf5 g4! and suddenly Black's counterattack is looking more than merely dangerous...",
        "34. Kb7": "(!) Not to be deflected.  In the last few moves, Black might have tried ...Kc8, but Ka7 would have been good enough for White to win.  His pawns would have won the race easily enough: the advantage of a 2-1 majority over a 3-2...",
        "34... f5 35. a5 f4 36. a6": "White is clearly winning now.  He could also have exchanged first on f4 (and 36.gxf4 g4 held no terrors for White), but White was sticking to a predetermined plan.",
        "36... fxg3 37. a7": "(!)",
        "37... gxh2 38. a8=Q+ Ke7": "Nor would 38...Kd7 have saved the h-pawns: 38...Kd7 39.Qc8+ K-any 40.Qxc7+ ... 41.Qxh2.",
        "39. Kxc7 g4 40. Qe4+": "An alternative plan was to use this Queen to stymie the pawns (40.Qh1 g3) and shove the other pawn home.  But the plan White has adopted by this move is very precise.  Black is being offered not a shred of counterplay.",
        "40... Kf6 41. Qf4+ Ke7 42. Qxh2 Kf6 43. Qg3": "Black tosses in the sponge.  1-0."
    },
    "url": "https://gameknot.com/annotation.pl/unterdogschen-vs-ubermenschen-team-match?gm=30014",
    "gameName": "Unterdogschen vs Ubermenschen - Team match",
    "players": "jrdavies (1397) vs. gorockies1 (1508)",
    "opening": "Scotch game (C45)"
}