{
    "moves": {
        "1. d4 Nf6 2. f4 e6 3. e3 c5 4. c3": "Against the anti-Budapest, I play c5 asap. He answers with a Stonewall, taking me out of all my known boundaries. ",
        "4... cxd4 5. exd4 d5": "This can't be bad. I close in my lsb, which I don't like. Another idea was d6, hoping for the break in e5, but I preferred a clearer setup. I know I'll suffer on the f column unless I play a safe f5.",
        "6. Nf3 Nc6 7. Bd3 Ne4": "I want to keep in control of an unknown sopening. I dared to open the Qh5+ by playing f5. ",
        "8. O-O h6": "He refuses, and I shield g4 so to avoid a Ng5 attack on e6. ",
        "9. Nbd2 f5": "If he exchanges, I'll have a closed center and I hope I will be able to develop. But I overlooked a threat.",
        "10. Ne5 Nxe5": "So, if Qh5+, Nf7. ",
        "11. fxe5": "...but now, what? Qh4 was the option, but I was scared of having it trapped. So I played, foolishly...",
        "11... Be7": "? ...but it is a fatal mistake?",
        "12. Qh5+ Kd7": "Escaping Q side. Now, white can continue with c4, winning easily. ",
        "13. Nxe4": "Why not? My pieces are closed-in!",
        "13... dxe4": "Bb5+, Kc7, on his way to b8 or something... I threw away the game as a fool!",
        "14. Bc4 Kc7 15. Qg6": "? Qf7 was probably stronger. ",
        "15... Qg8": "Only  move to defend both pawns. e6 gets pinned...",
        "16. Be3": "? I'd have played d5 at once, but he wants to prevent Bc5+.",
        "16... Bd7": "Activating the R and controlling b5.",
        "17. Bf4": "Strange idea, since after the exchanges still a piece gets on e6, but I see the plan with the pawn d5. I miss tempoes to unravel myself, and now, Be8 just leads to Qxe6, winning. ",
        "17... Re8": "...after d5, Bc4+ will give an extra R support to e6. ",
        "18. d5 Bg5": "I changed my mind. The check doesn't give much to me, but if he falls for BxB, winning a panw but opening the h column for me...",
        "19. d6+ Kc8": "My K is safe, for the moment! ",
        "20. Bg3": "He correctly thinks that the key for his penetration is the lsb. ",
        "20... Be3+ 21. Bf2 Bxf2+ 22. Rxf2": "Now I have Rf8 and e3-f4. But I exchanged the lsb's in order to play...",
        "22... h5": "Rh6.",
        "23. Rxf5": "Good?",
        "23... Rh6": "Now, what?",
        "24. Qg5": "Now, I was distracted by a call, and played foolishly...",
        "24... exf5": "??",
        "25. Bxg8 Rxg8": "...getting into this unusually balanced position, where I am materially -2. But the problem is my pieces are all tied up and it is very difficut to find a move! I didn't see this, either. ",
        "26. c4 Re6": "I have to take the e5 pawn, even sacrifying mine. If Qxf5, Re8. ",
        "27. Qf4": "? Allowing me to...",
        "27... g6 28. h4 Rge8": "This makes me considerably stronger. True is that his Q on g5 can revenge on g6 if Rxe5, but still I'll go for it. ",
        "29. b4": "As normal, he attacks because he sees there is nothing he can do about e5 (this was obvious from the beginnning of this \"middlegame\".",
        "29... Re6xe5 30. c5 e3 31. a3": "?? Why slow down? Can't he see I have attacking resources now? He had to play a4 (the least to say) in order to push his pawns. ",
        "31... Re5e4 32. Qg5 Rg4": "Now, Bc6 will me make me dangerous again...",
        "33. Qf6 Bc6 34. d7+ Bxd7 35. c6 Bxc6 36. Rc1 Rxg2+ 37. Kh1 Rc2+": "...and this was enough for him. White is lost. Thank you for reading, and please point out mistakes and omissions at will. "
    },
    "url": "https://gameknot.com/annotation.pl/unusual-balance?gm=63257",
    "gameName": "Unusual balance",
    "players": "gamerakm (1500) vs. damafi (1472)",
    "opening": "Canard opening (A45)"
}