{
    "moves": {
        "1. e4 c5 2. Nf3 Nc6 3. Bb5": "Questo seguito è stato reso popolare da Rossolimo e ha preso il nome proprio dal Maestro francese che l'ha impiegata con successo alla fine degli anni '40",
        "3... g6": "Considerato il seguito migliore per il nero",
        "4. c3": "Oggi il seguito più popolare è 4.Axc6, mentre all'epoca in cui fu giocata la partita si preferiva 4.0-0",
        "4... Bg7": "Il seguito più energico per il nero è 4...Cf6!",
        "5. d4 cxd4 6. cxd4 Qb6": "Anche ora era da preferirsi 6...Cf6! Andare a caccia di pedoni trascurando lo sviluppo è pericoloso",
        "7. Nc3": "Il bianco non esita a sacrificare materiale per accelerare lo sviluppo. 7.Axc6? sarebbe stata troppo remissiva. Senza alcun motivo, l'alfiere si sarebbe trasformato in un \"divoratore di tempi\": con lui sarebbero infatti spariti dalla scacchiera anche i due \"tempi\" (Ab5 e poi Axc6)",
        "7... Nxd4": "Coerente con le mosse precedenti, questa cattura si rivelerà disastrosa",
        "8. Nd5": "Guadagnando ancora tempi di sviluppo. Questo cavallo sarà tremendo",
        "8... Nxf3+": "8...Da5+ sarebbe stata ancora peggiore dopo 9.Ad2",
        "9. Qxf3": "Ovviamente l'alfiere in b5 è intoccabile a causa del doppio di cavallo in c7",
        "9... Qd6": "Una mossa goffa ma necessaria. La regina è legata alla difesa di c7 e incombe la minaccia di Af4\nDopo 9...Dd8?! 10. Af4 e5 (se 10...Da5+ 11. b4)! 11.Dc3! il nero è già spacciato",
        "10. Bd2": "Non 10.Af4? Ae5! e il nero resiste",
        "10... e6": "Non era certo il momento di pensare a guadagnare altro materiale. Dopo 10...Axb2? 11. 0-0! Axa1 12.Txa1 (minacciando 13.Af4 e 13. Ab4) il bianco ha completato il suo sviluppo ed è pronto ad un attacco imparabile, visto che le forze del nero stanno ancora sonnecchiando",
        "11. Bb4 Qb8 12. O-O": "Il confronto dello sviluppo delle due parti è impietoso. Il nero può farsene ben poco del pedone in più",
        "12... a6": "Il cavallo bianco in d5 è una presenza assai scomoda per il nero, tuttavia dopo 12...exd5 13.exd5 l'apertura della colonna e sarebbe stata fatale.",
        "13. Rac1": "Il bianco continua tranquillamente a trovare le case migliori per i suoi pezzi",
        "13... exd5": "La minaccia dello scacco in c7 costringe il nero a catturare il dannato cavallo",
        "14. exd5 axb5": "Le alternative non erano molto meglio. Dopo 14...f6 15.Tfe1+ Rf7 16.De3 il nero è imbottigliato. Il male minore era forse 14...Ce7 15.Tfe1 0-0, restituendo materiale per cercare di porre il re al riparo. ll bianco avrebbe comunque mantenuto una psizione vincente. Quando si è sotto attacco occorre sempre considerare le possibilità di restituire materiale per smorzare l'attacco",
        "15. Rfe1+ Be5": "Dopo 15...Rd8 16.Dxf7 il nero prende matto",
        "16. d6": "Anche questa vince, ma ancora più efficace era 16.Txc8+! Dxc8 17.Txe5+ Rd8 18.De3 e cala il sipario",
        "16... Kf8 17. Rxe5 b6 18. Rc7 Rxa2 19. h3 Qa8 20. Qe3 Bb7": "E ora via al gran finale",
        "21. Rxb7 Qxb7": "Il nero avrebbe comunque preso matto anche non catturando la torre",
        "22. Re8+ Kg7 23. Bc3+ f6": "Il matto è immediato dopo 23...Cf6 24. Axf6+ e poi 25. De5 matto",
        "24. Rxg8+ Rxg8": "Oppure 24...Rxg8 25. De8+ Rg7 26. Axf6+ e matto in poche",
        "25. Bxf6+ Kxf6 26. Qe7+ Kf5 27. g4+": "A 27... Rf4 segue 28.De3 matto\nUna dimostrazione impressionante dei rischi del ritardo nello sviluppo"
    },
    "url": "https://gameknot.com/annotation.pl/urss-1972?gm=65962",
    "gameName": "URSS 1972",
    "players": "Suleimanov  vs. Komozin ",
    "opening": "Sicilian (B31), Nimzovich-Rossolimo attack (with ...g6, without ...d6)"
}