{
    "moves": {
        "1. e4": "I always start e4.",
        "1... Nf6": "attacking my pawn",
        "2. e5": "attacking his knight and securing space in the centre",
        "2... Nd5": "I cant see why black opts for 1...Nf6. It just gives white the opportunity to secure space while black has to keep moving the knight cos its chased by pawns.",
        "3. d4": "When playing players rated higher than myself, I prefer an open, attacking game wherever possible. I have found that better players can often grind you down in long positional struggles. So i was glad to get a chance to open up here.",
        "3... d6": "I'm ok exchanging pawns if he wants ",
        "4. Nf3": "continuing my development",
        "4... Nc6": "as does he",
        "5. c4": "continuing my plan to gain space and harass him",
        "5... Nb6": "he retreats",
        "6. e6": "I got this idea from opening theory and it suited me fine here. I sacrifice a pawn in order to cramp his development. 6...Bxe6 loses a piece for two pawns so he has to play the following...",
        "6... fxe6": "I can now develop quickly whilst he is cramped. I'm eyeing a king side attack.",
        "7. Be3": "developing a piece whilst bolstering my central pawns. I'm happy with this position. ",
        "7... g6": "preparing Bg7 - to free his cramped bishop and exert pressure on the a1 h8 diagonal. ",
        "8. h4": "It all takes valuable time though which I didn't intend to give him - Here goes my king side attack !",
        "8... Bg7": "as expected",
        "9. h5": "My attack continues - I'm happy enough with this. ",
        "9... e5": "With his bishop in place, he stakes a claim to the central dark squares.",
        "10. d5": "I dont want the centre open yet. This move gives me some control over the light coloured squares c6 and e6 and he is forced to move a knight out of the way again.",
        "10... e4": "clearing e5 for his knight ",
        "11. Ng5": "I'm happy (I know I keep saying this) cos I have additional pressure on the light squares e6 and f7 with good threats on the king side.",
        "11... Ne5": "a good square for his knight, threatening c4",
        "12. hxg6": "Press on! - I figured that gxh7 threatening Qh5+ was adequate compensation if he went for c4.",
        "12... hxg6": "That g6 pawn makes a good target for the future",
        "13. Rxh8+": "We exchange rooks.",
        "13... Bxh8": "that dark squared bishop could be a nuisance along that long diagonal. I wonder whether to challenge it with Bd4.",
        "14. Nd2": "No rush - continue development - I'l get the pawn back as well in a minute...",
        "14... c6": "Making space for the queen. I was expecting Bf5 or Bg4 where I think I was preparing Be2. In any case I rejected dxc6 because I didnt want to open the b-file.",
        "15. Qb3": "Defending c4 and d5, preparing to castle and also defending b2. That bishop was starting to concern me. Nd2xe4 may have been better though because ....",
        "15... Nd3+": "I didn't consider this",
        "16. Bxd3": "I didnt have much choice about this I didnt think. ",
        "16... exd3": "and now I started to worry about his other bishop as well cos he has the potential now to control the light coloured squares. ",
        "17. dxc6": "I didnt fancy 17. Qxd3 Bf5 so I decide to castle. My plan is 0-0-0 followed by c5 to try and open the centre. I did this first to threaten to clear the b3-f7 diagonal for my queen as well.",
        "17... bxc6": "I know he can now come at me down the b-file but ...",
        "18. O-O-O": "I now have my king out of the middle and another defender for my b-pawn.",
        "18... d5": "I was hoping to play c5 with the threat of Qf7+  and also I could open up either the d or e file to bring my rook in to play but he played this first.",
        "19. c5": "Maybe I should have exchanged pawns. The diagonal for my queen is now blocked and I still didnt see any point in Qxd3 cos of Bf5 so I abandoned thoughts of opening the centre and forced his knight back.",
        "19... Nd7": "Even though the bishop is now hemmed in, I still didnt fancy Qxd3 cos of Ne5.",
        "20. Rh1": "... so I go after his dark-squared bishop. Now - he can't move it to g7 cos of Ne6. If he moves it to e5 I planned f4 and if he goes to f6 ....",
        "20... Bf6": "I planned the following...",
        "21. Nde4": "I'm feeling pleased with myself again now. I'm gonna shift that nuisance bishop off that diagonal and my rook is gonna wreak havoc with his king side. Where are you gonna move it to now ?",
        "21... Qa5": "Oh - he didnt bother trying to save it. Oh well I'm having it anyway.",
        "22. Nxf6+": "I thought if he takes back with knight i'll follow with Qxd3 ",
        "22... exf6": "... but he didnt. So now I set the position up on the board at home and sat and pondered all sorts of moves but I came full circle and decided that the knight sac was justified if I could just get my queen to g6 so...",
        "23. Qxd3": "..forgetting all about Ne5 - the reason I didn't make this move a while back.",
        "23... Ne5": "...a bit deflated now I start to think about salvaging a draw.",
        "24. Rh8+": "My rook is better down there than stuck on h1. I doesnt really prevent his bishop moving though as if it goes to f5 my queen is threatened.",
        "24... Ke7": "the thought of perpetual check crossed my mind but I thought he would just get the king  to g7 via f8",
        "25. Qe2": "nothing better I dont think but now...",
        "25... Qxa2": "The storm clouds are gathering !!",
        "26. Bd4": "the best square for my bishop which I felt was the key to my chances of a draw. It also opens the e-file so his knight is pinned for the time being.",
        "26... Bg4": "I was surprised at this at first as I was expecting him to go to f5 (or even a6) but thinking about it I suppose I could have played Rxa1 and got away with 27....Qb1+ because he couldnt use his knight cos its pinned.",
        "27. Rh7+": ".. necessary to save my rook.",
        "27... Kf8": "...but now his knight is free - and dangerous ! Again, I set the position up and tried desperately to find something clever but all I managed was...",
        "28. f3": "I was planning to move the knight to e4 after Bf5 - getting a bit desperate now. However, according to subsequent computer analysis I missed a sequence here that left him nothing better than perpetual check  - can you spot it ???",
        "28... Qa1+": "It was 28 Rh8+ Kg7 29. Qxe5 !!!",
        "29. Kd2": "and now I spent a while working out whether I could get away with things by moving my king to the right squares all the time to survive",
        "29... Nc4+": "the knight joins the king hunt",
        "30. Kc2": "I admit I cant remember now why I chose this over d3 or c3. ",
        "30... Bf5+": "the bishop joins the fray",
        "31. Ne4": "the knight blocks",
        "31... Qa4+": "and I got to thinking I might get away with this",
        "32. Kc3": "I wanted to avoid the b-file because he could bring his rook into play.",
        "32... Qa5+": "I just couldnt see how he could make any headway.",
        "33. Kc2": "but he found a nice resource here....",
        "33... dxe4": "I wonder what he's up to",
        "34. fxe4": "still no alarm bells...",
        "34... Bxe4+": "I still hadnt seen it",
        "35. Qxe4": "until he played this next move...",
        "35... Qd2+": "I now realise he just needed my queen out of the way. If now 36 Kb1 then 36...Qd1 37 Ka2 Qa4 38 Kb1 Nd2 forking my queen.",
        "36. Kb3": "So I have no choice but to allow his rook to join the party.",
        "36... Rb8+": "and then I resigned because 37 Ka2 Rxb2 leads to mate. A very nice finish by him I thought."
    },
    "url": "https://gameknot.com/annotation.pl/90th-gk-tournament?gm=47438",
    "gameName": "90th GK tournament",
    "players": "bookie (1913) vs. zl1kmn (1993)",
    "opening": "Alekhine's defence (B04), modern variation"
}