{
    "moves": {
        "1. c4": "My opponent is a young girl of about 11, she is part of a group of juniors that gets thorough coaching and in my expierence are known for being taught to play rather attacking chess, though this games shows that this doesn't come at the expense of positional knowledge, blacks play this game impressed me for such a young player. The game was for an interclub teams game of which we were the bottom board, this game will be very useful for learning chess players who have not come across these positional concepts before, also it would be useful to have a strong player look over this game for my sake as well, I'm not sure if my interpretation of the endgame is correct. ",
        "1... Nf6": "I have quite often seen this flexible knight move sometimes it's played with the intention of transposing into an Indian defense system so I chose my next move to be equally as flexible.",
        "2. Nc3 e6": "I didn't want to go into a nimzo Indian here so I played another non committal move.",
        "3. Nf3": "I was glad to see that this strategy of not making my intentions clear was working well, black hesitated on her next move and seemed unsure of how best to proceed.",
        "3... d5 4. d4": "Now that I have avoided getting into what she likely wanted to play we now have what appears to be a queens gambit declined, this should be good for me since it is not an attacking game and is very positional one which should be slightly better for me. Whites play now should be based around an eventual minority attack on the queenside.",
        "4... c5": "However with this final transposition we now have a tarrasch defense! This makes sense from blacks perspective since this particular game gives black more attacking options than the queens gambit declined, usually black accepts the classic isolated d pawn in order to get free and easy piece development and potential for better piece activity, from whites point of view we need to show that the pawn is a weakness and that the free piece development is an illusion and the weakness of the pawn is of more consequence.",
        "5. dxc5 Bxc5 6. cxd5 exd5 7. e3": "Of course I would have liked to develop my DSB outside the pawn chain before getting this move in however I don't think I had enough time for it, any other move would allow black to push the pawn immediately, is pushing the pawn a correct idea here? I wasn't sure at all weather or not it worked out and rather than enter such unclear territory I played this logical move. It is important to realize that when it comes to weak pawns it is not always the pawn itself that is weak But the weak square in front of the pawn that is often of more consequence. So it is vital that we as white strive to control the d4 square and this phase of the game will revolve around both sides attempting to seize control of the critical square. If white can immobilize the pawn then trade of the minor pieces (since the pawns pluses involve active piece play) then white will have a great position especially if the ideal set up of a queen + rook ending can be achieved.",
        "7... O-O 8. Be2 Nc6 9. Nb5": "!? Ordinarily one would want to avoid moving a piece more than once in the opening however there are some more subtle factors in play here, both sides are trying there hardest to achieve control over d4 and the battle continues to rage. In any case black was threatning to push her pawn toward and thus liquidating her only weakness in which we are left in an even position where black has a slight lead in development. So perhaps this is forced if white wishes to maintain the first move advantage.",
        "9... Bg4": "!? This is a move I was worried about during the game but looking at it in hindsight maybe it was not as scary as I first thought. In any case the idea is quite advanced black may be intending to exchange bishop for knight in order to obtain more control over d4 however in order to do so black must first give up the bishop pair. Perhaps this move is good perhaps it is an in accuracy, it is up to the players to show that their idea is more important than the opponents so both sides need to work hard in order to implement their ideas quickly.",
        "10. O-O Re8": "Blacks pieces are active and on good squares, it is now up to white to show that this activity will be short lived.",
        "11. Nfd4": "After a quick calculation and safety check I decided that this move worked since if the bishop ever captures on e2 I can recapture with my knight and thus maintain control over d4 whilst also coming one step closer to accomplishing one of whites overall goals.",
        "11... Nxd4 12. Nxd4 Bxd4 13. Bxg4": "Now white has turned one advantage into another, white has gained the bishop pair on an open board, however In doing so black was able to exchange the LSB for the knight which in turn gives black more control over the d4 square. However for the time being black cannot make use of this and whites new advantage (the bishop pair) means white probably maintains a small but annoying edge. Actually come think of it black gains equality now by chopping the bishop on g4 where mas exchanges simply leave an even position. ...Nxg4 Qxd4 Re4 followed by d4 and maybe even an extremely slight edge for black due to better development and piece activity.",
        "13... Bb6 14. Bf3": "This gets my bishop away from the knights Path as well as preventing black playing ...d4 on account of b7 hanging.",
        "14... Qd6": "One should always be careful when leaving a piece unprotected like this, now white can be on the look out for tactics based on the unprotected state of the black queen, however here I don't think there are any tactics and this is an active move by black.",
        "15. b3": "If blacks queen were defended right now then this move would allow black to get in ...d4",
        "15... Bc7": "?! I suspect this move is an inaccuracy The. I shop is no longer influencing the d4 square, instead it makes this simple one move mate threat against my king. Part of the reason I don't like this move that much is because it forces white to play g3 when white probably already wants to play g3 and Bg2 anyway. Preferable was probably Rad8",
        "16. g3 Rad8 17. Bb2 Ne4": "Actually this move is quite good, at first I thought this was simply playing an active/agressive knight move to an advanced point which is good enough reason in itself to play it, then I realized it may even have a deeper purpose of performing the interesting knight maneuver Nf6-e4-g5-e6 where it will influence the d4 square ( again see how much play is based around this square!) however it may just be that black is simply playing active moves that pressure whites position and will follow up with a rook lift followed by brining the pieces over to the kingside which is also a fair enough plan.",
        "18. Bg2": "At this point I was looking at potential double attacks on the a pawn or even the bishop on c7 by threatning mate on g7 but first I consolidated my bishops position as well as opened up the possibility of brining my queen to the kingside via the light squares.",
        "18... a6": "Simply avoiding any potential tactics based on Qd4",
        "19. Qd3": "Actually I seriously considered playing Qg4 here with the idea that ...g6 weakens blacks dark squares, f6 would be horrible and I felt that blacks queen would be less well placed on g6 however after a bit of a think I change my mind and decided to double on the d file whilst also allowing for possible transfer to the c3 square. Of course I had to make sure that there were no tactics here since I've just placed my queen on an undefendind square.",
        "19... Qe6 20. Rfd1": "I chose this rook because I felt the other rook may belong on the open c file.",
        "20... Be5": "Unfortunately I missed this move altogether, however the position has obtained some complications. Notice that blacks pawn is now pinned since if the pawn were to capture black could get mated. This move by black was a good idea and shows the correct way of thinking, it just happens to fall over tactically. White now wins a pawn however as a result there is no longer any bishop pair.",
        "21. Bxe4 Bxb2 22. Bxh7+ Kh8 23. Bf5": "The reason this line is playable, white gains a tempo attacking the queen in which white can use to move the rook to safety.",
        "23... Qh6 24. Rab1 Be5": "In the game I actually felt that Bf6 was a better place for the bishop.",
        "25. Bg4": "I Had been considering trying to triple on the d file however I played this because wanted to reroute my bishop to f3/g2 and I also wanted to prevent ...Qh5 where black is threatning to trap my bishop with g6. As it stands I completely missed my opponents next move.",
        "25... d4": "Viola! After preventing this move for so long and taking careful strides to make sure this wouldn't be possible I slip up and allow black to play the move freely.",
        "26. Qf5": "!? Wanting to avoid a drawing situation I try and complicate matters, actually this is quite a risky strategy trying to avoid draws in this manner against weaker opponents. As it stands black at this point may play g6! And suddenly white has problems.",
        "26... Qf6": "Luckily black doesn't seem up to testing out the complications.",
        "27. Qh5+": "?! This check simply moves the king closer to the centre whites best bet is probably accept that the position is probably going to become drawish and try to make something happen out of the extra pawn. Infact this check actually loses a tempo for white which in turn loses a pawn.",
        "27... Kg8 28. exd4 Bxd4 29. Qf5 Qxf5 30. Bxf5 Re2": "Now white has given back the pawn and the position is very drawish though black has a slightly better position to be in, for the first time this whole game white has the the edge gained by having the first move.",
        "31. a4 Bxf2+": "Not falling for ...Rxf2?? Rxd4",
        "32. Kf1 Rde8 33. Bd3": "!",
        "33... Ra2 34. Rbc1 Be3 35. Rc2 Rxc2 36. Bxc2 g6": "Eliminating the back rank mate threats ",
        "37. Rd7": "However over the next few moves white forcibly grabs hold of the unitive and runs it into something potentially tangible.",
        "37... b6 38. Bd3 a5 39. Bc4 Rf8": "Now white has achieved his goal and black is in a passive position and will have real trouble finding a way to get her king and rook back into the game, however with the opposite colored bishops situation this is more than likely still a draw.",
        "40. Ke2 Bc5 41. Kf3 Kg7 42. h4 Bb4 43. Rb7 Bc5 44. Kf4 Kg8": "White wishes to take control of f6",
        "45. g4": "The plan is to play for h5 then try to follow up by ramming the g pawn down the black kings position.",
        "45... Kg7 46. g5": "! White seizes control of the f6 square and I can follow up with h5. I suspect that she was anticipating h5 and was surprised by g5",
        "46... Bf2 47. Kg4 Be3 48. h5 Bc5": "This came as a complete surprise to me, I was fully expecting the capture of The h pawn as allowing white the protected passed pawn whilst also hemming in the king and rook even further looks suicidal.",
        "49. h6+ Kg8": "Now white needs to achieve a position where the black bishop is on B4 and white can play Rc6 with an attack on both the b pawn and the Fpawn.",
        "50. Kf4 Bd6+ 51. Ke4 Bc5 52. Rd7 Re8+ 53. Kf3 Rf8 54. Kf4 Bb4 55. Bd5 Bd2+ 56. Kg4 Bb4 57. Rc7 Bc5 58. Bc4 Bd4 59. Rc6": "?! Too early I want to get my rook to f6 however black right now is protecting both the b pawn and the f6 square as well as that black defend the g pawn with Kh7? Instead if I had shown some patience and maybe played a bit of cat and mouse with my opponent she may have made a mistake somewhere down the line, it's clear that if there exist any winning chances at all they lie with white.",
        "59... Kh7 60. Rc7 Kg8": "The other idea is to play for h7 and exchanging the h pawn for the f pawn, but I didn't like that idea at all. ",
        "61. Be6": "??? This is a very disappointing end to a wonderful game, I can only blame chess blindness for not seeing the simple fxe6. Perhaps it was the ghost piece phenomena and I was still thinking of the black king as being on h7. ",
        "61... fxe6 62. h7+": "The game was lost in any case but this panick reaction just makes it an even quicker loss",
        "62... Kh8 63. Re7 e5 64. Kg3 Bf2+ 65. Kg2 Rf5": "I found this game covered many great ideas and themes very well.and quite enjoyed playing it to. My young opponent surprised me by how well she played to. Some comments would be nice to :) I'd be interested in the endgame in particular to see if my annotations and moves were correct or if they were way off."
    },
    "url": "https://gameknot.com/annotation.pl/maintaining-an-edge-then-pushing-too-hard?gm=46279",
    "gameName": "Maintaining an edge then pushing too hard ",
    "players": "Thereaper1 (1379) vs. Opponent (1149)",
    "opening": "English (A17), Queens Indian formation"
}