{
    "moves": {
        "1. e4 e5 2. f4": "The King's gambit",
        "2... d5": "The Falkbeer counter-gambit",
        "3. exd5 exf4 4. Nf3 Qxd5 5. Nc3 Qh5 6. Bc4": "White continues the attack on f7.",
        "6... Bg4": "A strong apparent threat but one without real teeth. Black's main threat seems to be a willingness to exchange Qs and pieces to disrupt White's pawn protection. Not a bad idea, perhaps, but too early. Developing a N may have been a better choice.",
        "7. O-O": "Getting the K to safety and bolstering the N at f3. It is pinned, but not easily attacked.",
        "7... Nc6 8. d4": "Risking the marginally supported d pawn in order to prevent the checking move Bc5  by Black. D4 also forces Black to pay attention to his now threatened f4 pawn.",
        "8... O-O-O": "Black gets his K to safety while putting pressure on the d4 pawn.",
        "9. Ne2": "Reinforcing d4 while doubling the attack on f4.",
        "9... g5": "A defense of f4, but Black hems in his Q and lags in development. Better was 9... Bd6 which protects the pawn as well as develops the B. Black is lagging a bit in development here. Another possible move here was 9... Qf5 which prevents trapping the Q while abandoning the pointless attack on the well defended f3 N and aligns Black's Q and B on the perhaps more favorable h3-c8 diagonal.",
        "10. c3": "Bolstering d4 again and protecting the center.",
        "10... Nf6": "Black develops the N and gets control of e4, challenging the center.",
        "11. Qb3": "White continues to focus on f7 although the Black K has moved well away.",
        "11... Rd7": "Reinforces f7 but puts the R and K on a unfavorable diagonal, inviting a pin or attack after the removal of the f7 pawn.",
        "12. Ne5": "A key move. White abandons the e2 N to a double attack but threatens Black's R. After 12...BxN, 13. BxB QxB 14. NxR NxN, 15. Qxf7 Black has good position and a pawn. But black should perhaps analyze lines other than 13. BxB.",
        "12... Bxe2": "Proceeding as foreseen...",
        "13. Bxf7": "! White has plans other than BxB with an unfavorable end result for his game. Black must carefully ponder his next move. Not 13... BxR?? with the immediate loss of the Q, of course. Also not 13...QxB?? after which White exchanges his B, R, and N for Black's Q, R, and B leaving him up by 3 pts with Black in a precarious position as regards his f6 N and remaining B. Now is when Black sees the full disadvantage of his hemmed in Q.",
        "13... Rxf7": "Black moves ahead materially and threatens a devastating attack should White seek to equalize. After 14. NxR BxR Black returns most of the material for a devastating attack via 15 Qe2!! with mate to follow.",
        "14. Nxf7 Bxf1": "Putting the plan into execution. Black threatens Qe2 with mate next move.",
        "15. Kxf1": "White has seen through Black's ruse and defuses the threat. While still down materially, white has aggressive position with credible threats to the h8 R and f6 N. Black has no immediate threats to allow him to capitalize on his momentary material advantage.",
        "15... Qxh2": "Not a time for Black to go pawn hunting. Black had several better alternatives, including Qg4, protecting against the white Q's potential check at e6, a serious threat. Black here wastes a tempo when he should try to regain some initiative and mount a defense to gain time. The loss of his remaining R is imminent. Black's thrust here is premature.",
        "16. Qe6+": "! White does not intend to give Black time to regroup. This move is superior the more languid NxR, after which Black's can gain time or mount a credible attack with, for instance N(f)g4 or e4, putting White's K at risk for a withering attack and taking advantage of White's cramped B and useless R. Note how the text move also guards the e4 and g4 squares as well, thus providing a defense against the advance of the Black N to support his Q's would-be aggression.",
        "16... Nd7": "??? A final, fatal error. Black's best chance here was to simply have the K retreat to b8. His back rank is protected against further checks by the White Q by his two Ns. Kb8 gives Black time to regroup. The text move leads to mate in two. Some possible lines:\r\n16. Qe6  Kb8, 17. Qxf6 Rg8 18. Nxg5 a6 with material even and an escape square for the Black king.\r\n16. Qe6  Kb8 17 Nxh8 Be7 with Black able to protect his remaining pieces and also block mate on the back rank, buying him time to mobilize the Q.\r\n\r\nIt did not have to end for Black on move 18, but 16... Nd7 sank his remaining hopes.\r\n",
        "17. Qe8+": "Obviously. Black now has nothing left but 17. N(c)d8 18. Qxd8#\r\n\r\nBlack started out well enough but cramped his own pieces, especially the Q, early on and eventually reaped the results. Also, he did not sufficiently analyze all the possibilities inherent in the dynamic situation that was present at move 12. By move 17 he had lost his focus, it would seem. A reminder to us all to take time to carefully look at the complexity of each situation and not the immediate appearance.\r\n"
    },
    "url": "https://gameknot.com/annotation.pl/majors-mini-tournament?gm=13358",
    "gameName": "major's mini-tournament",
    "players": "major (1669) vs. dandelionexpress (1514)",
    "opening": "KGD (C31), Falkbeer counter-gambit"
}