{
    "moves": {
        "1. c4": "So he plays The English. https://en.wikipedia.org/wiki/English_Opening",
        "1... e5": "1...e5 White has Black's position in the Sicilian but with an extra tempo. This is often called the Reversed Sicilian, though others call it the King's English. Bruce Leverett, writing the English chapter in MCO14, stated, \"It is natural to treat the English as a Sicilian reversed, but the results are often surprising—main lines in the Sicilian Defense correspond to obscure side variations in the English, and vice versa.\"",
        "2. Nc3": "Natural Development.",
        "2... Nc6": "I too keep options open.",
        "3. Nf3": "He offers the four knights variation.",
        "3... f5": "This is actually less popular and less successful that Nf6, but I thought it was more aggressive, hopefully leading to a King-side attack.",
        "4. d3": "He prevents 4.....e5",
        "4... Nf6": "I develop.",
        "5. g3": "And this is the most common reply. It is now a reversed Levenfish Variation: 1. e4 c5 2. Nf3 d6 3. d4 cxd4 4. Nxd4 Nf6 5. Nc3 g6 6.f4",
        "5... Bc5": "So I continue to develop. It is not bad, but the fourth most popular move according to my databases!",
        "6. Bg2": "He completes his fianchetto. In chess the fianchetto (Italian: [fiaŋˈkɛtto] \"little flank\") is a pattern of development wherein a bishop is developed to the second rank of the adjacent knight file, the knight pawn having been moved one or two squares forward.",
        "6... d6": "I continue with my development.",
        "7. O-O": "He completes his development.",
        "7... a5": "I didn't want him playing Na4 winning the two bishops, although I see now that 7....0-0 is more common.",
        "8. e3": "I'm getting out of my opening databases now. I can only see one game with this position, Pupols, Viktors (2223) vs. Charbonneau, Pascal (2405) 2002.05.18",
        "8... Ba7": "In that game black castled instead of retreating the bishop.",
        "9. d4": "He advances in the centre.",
        "9... e4": "I advance.",
        "10. Ne1": "Knight drops back, covering d3, reducing the power of Nb4-d3 which would just drop a pawn now.",
        "10... O-O": "I finally castle.",
        "11. a3": "He prepares Queen-side expansion.",
        "11... Ne7": "I am dreaming of securing my centre with c6 and d5.",
        "12. b4": "He continues with his plan.",
        "12... c6": "And me with mine.",
        "13. b5": "He advances again.",
        "13... cxb5": "I take.",
        "14. Nxb5": "He takes back.",
        "14... Be6": "More development.",
        "15. Qb3": "Not quite sure what he is planning.",
        "15... Qd7": "I am planning Rf-c8 to gang up on c4.",
        "16. a4": "Securing his knight at b5.",
        "16... Rfc8": "As per my plan.",
        "17. d5": "He attacks my bishop",
        "17... Bf7": "The only square for the bishop.",
        "18. Nxa7": "He takes my bishop.",
        "18... Rxa7": "I take back.",
        "19. Bb2": "And now his bishop has a lovely unopposed long diagonal.",
        "19... Bh5": "With the threat of Be2. I was rather expecting 20. f3 or maybe 20. f4 now, preventing the loss of material, but leaving his e pawn very weak after I take on f3. e4 becomes a lovely square for my Nf6 to move to in due course.",
        "20. Nc2": "But he allows me to play it.",
        "20... Be2": "So I jump in.",
        "21. Na3": "This again was a bit of a surprise - I am not sure whether it is better to lose the exchange or a couple of pawns with 21. Re1 allowing 21....Bxc4 followed by Bxd5. What do you think dear reader?",
        "21... Bxf1": "I took the offered material.",
        "22. Bxf1": "he takes back.",
        "22... Ng6": "With ideas of going to e5.",
        "23. Bd4": "He hits my rook.",
        "23... Raa8": "Rook retreats - I didn't fancy Ra6 where it may be hit with c4-c5 opening up a discovered attack from his Bf1.",
        "24. Rb1": "Attacking b7, although if he takes on their immediately I can take on a4.",
        "24... Ne5": "I threaten Nf3+ followed by Nd2 forking his Qb3 and rook b1.",
        "25. Bxe5": "So he takes it off.",
        "25... dxe5": "I take back.",
        "26. Nb5": "I think he was planning on advancing d5-d4",
        "26... Ne8": "So I block that. I now have a plan to blockade his pawns on d5 and c4 so that his Bf1 remains with very limited scope.",
        "27. Rc1": "Perhaps preparing to advance his c pawn.",
        "27... Rc5": "So I block it.",
        "28. Qb2": "Attacking e5.",
        "28... Qe7": "Which is easily protected.",
        "29. Rb1": "Perhaps dreaming again of attacks down the b file.",
        "29... b6": "I want to secure things, fixing his pawns on white squares.",
        "30. Be2": "Not sure what he was planning.",
        "30... Rb8": "I protect b6.",
        "31. Qd2": "Perhaps with ideas of trying for d5-d6 again.",
        "31... Nd6": "I block.",
        "32. Nxd6": "He takes.",
        "32... Qxd6": "I take back.",
        "33. Rb3": "I am not sure what he is trying to do. I think I have neutralised any counter-play he may have had for the exchange. I know decide to march my king to the Queen-side before opening a file or files on the King-side to deliver the coup de grâce - or so I thought!",
        "33... Kf7": "So off I go!",
        "34. Qb2": "Not sure what he is trying to do.",
        "34... Ke7": "Another step.",
        "35. h4": "This again rather surprised me. I now rather wanted to stop h4-h5, although I am not sure if it is really any good for him.",
        "35... g6": "So I played this.",
        "36. Kg2": "This struck me as a rather random king move.",
        "36... Kd7": "So I continue my King-march to the Queen-side.",
        "37. f4": "This rather surprised me too. Rather than wait for the coup de grâce he blasts open the position. But is straightens out my pawn formation.",
        "37... exf3 e.p.+": "So I take.",
        "38. Kxf3": "He takes back with the king - his c pawn drops if he takes back with the bishop.",
        "38... Kc7": "I continue my King-march.",
        "39. e4": "Maybe played on the basis of exchanging pawns but not pieces if you are materially down?",
        "39... Kb7": "I want my king tucked away on a7.",
        "40. Bd3": "He is now threatening to take on f5.",
        "40... Rf8": "So I protect f5.",
        "41. exf5": "He takes.",
        "41... gxf5": "I take back, threatening e5-e4 forking king and bishop.",
        "42. Be2": "So the bishop runs.",
        "42... Ka7": "Maybe this final king move was not needed, but I wanted to avoid any tricks with a pin along the b file. Any views dear reader?",
        "43. Re3": "Not sure of the point of Re3.",
        "43... e4+": "I throw in a check.",
        "44. Kg2": "King retreats.",
        "44... Rc7": "My rook prepares to scurry across to the King-side.",
        "45. Qd4": "He centralises his queen.",
        "45... Rg8": "Preparing f5-f4.",
        "46. Rb3": "Rook comes back across.",
        "46... Rcg7": "I double up on the g file.",
        "47. g4": "With the idea, if I play f5xg4 then he can take my pawn on e4.",
        "47... Re7": "So I protect the pawn on e4.",
        "48. Rb5": "Threatening my a pawn. We were both getting short of time here. I thought \"well what of it? If I play f5-f4 and he plays 49. Rxa5+ after Kb7 I am threatening both bxRa5 and f4-f3+ winning his bishop. He can't cope with both threats surely?\"",
        "48... f4": "So I plough on.",
        "49. Rxa5+": "He takes.",
        "49... Kb7": "According to plan.",
        "50. c5": "This was the move I missed.",
        "50... f3+": "I throw in the check.",
        "51. Kh3": "King moves.",
        "51... Qf4": "My queen advances, threatening mate.",
        "52. c6+": "And, with only seconds left on his clock, my opponent offers a draw, which I accepted. \nIt is now a very complicated position, and I am not sure what is going on here. Obviously I can't play Kb8 which loses to 53.\tQxb6+ Kc8 54. Ra8+\tmating.\nWhat do you think dear reader?\n\nMany thanks for reading. Please rate my annotation on the star system, and leave a comment or two. Until next time dear reader!"
    },
    "url": "https://gameknot.com/annotation.pl/malpas-oswestry-1-v-chester-3?gm=62205",
    "gameName": "Malpas & Oswestry 1 v Chester 3",
    "players": "Ben Roberts (est172) vs. Charles L Higgie (166)",
    "opening": "English (A27), three knights system"
}