{
    "moves": {
        "1. d4": "Before this game, I had played him once before and lost. https://gameknot.com/annotation.pl/just-one-slight-mistake?gm=57599",
        "1... Nf6 2. c4 g6 3. Nc3 d5": "I reply with a Grunfeld Defence again. https://en.wikipedia.org/wiki/Gr%C3%BCnfeld_Defence",
        "4. cxd5": "He played the exchange variation again. https://en.wikipedia.org/wiki/Gr%C3%BCnfeld_Defence#Exchange_Variation:_4.cxd5_Nxd5_5.e4",
        "4... Nxd5": "I take back.",
        "5. e4": "He takes the centre.",
        "5... Nxc3": "I take.",
        "6. bxc3": "He takes.",
        "6... Bg7": "I develop.",
        "7. Bc4": "He plays the old main line. For decades, theory held that the correct method of development was with Bc4 and Ne2, often followed by 0-0 and f4–f5, playing for a central breakthrough or kingside attack. It was generally thought that an early Nf3 was weak in the Exchange Variation because it allowed Black too much pressure on the centre with ...Bg4. In the late 1970s, however, Karpov, Kasparov and others found different methods to play the Exchange Variation with White, often involving an early Rb1 to remove the rook from the sensitive a1–h8 diagonal, as well as attempting to hinder the development of Black's queenside. Another, relatively recently developed system involves quickly playing Be3, Qd2, and Rc1 or Rd1 to fortify White's centre, remove White's rook from the diagonal, and possibly enable an early d5 push by White.",
        "7... c5": "I strike at the centre.",
        "8. Ne2": "He protects the centre again.",
        "8... Nc6": "I attack d4 again.",
        "9. Be3": "He protects it. In our last game we continued with the old main line -  0-0 10.0-0 Bg4 11.f3 Na5 12.Bxf7+  Rxf7 13. fxg4 Rxf1+ 14. Kxf1 and I got a reasonable position, but eventually lost. I decided to try something else.",
        "9... cxd4": "I took",
        "10. cxd4": "He took back.",
        "10... Qa5+": "I threw in a check.",
        "11. Kf1": "And this was the real surprise! 11. Bd2 or Qd2 is normal. One possible continuation is the old trap 13. Bd2 Qa3 14. Rb1 O-O 15. d5 Ne5 16. Bb4 Qf3! and white can't take the queen as mate in 2 follows.",
        "11... O-O": "I decide to castle. Clearly the best and most played move here.",
        "12. f3": "White decides to move his king out of the way to allow the Rh1 to enter the game along the back rank. I was rather more worried about plans involving h2-h4-h5 maybe combined with Qd8-c1 and Be3-h6. However black should be OK if he or she counters aggressively.",
        "12... Rd8": "Logical development. Vershinin, Igor (2229) vs. Rakhmanov, Alexander (2110) ended in a draw after \n13.\tQb3\tNxd4\n14.\tBxd4\tBxd4\n15.\tRd1\tBf6\n16.\tBxf7+\tKg7\n17.\tRxd8\tQxd8\n18.\tKf2\tQb6+\n19.\tQxb6\taxb6\n20.\tBb3\tBd7\n21.\tNf4\tBd4+\n22.\tKe2\te5\n23.\tNe6+\tBxe6\n24.\tBxe6\tKf6\n25.\tBc4\t",
        "13. Kf2": "White continues with his plan.",
        "13... b5": "Gaining space on the queen-side. Fritz likes this move.",
        "14. Bd5": "Attacks the knight.",
        "14... Bd7": "Fritz prefers Bb7, but I think it is much the same.",
        "15. Rc1": "Attacks the bishop again.",
        "15... Rac8": "I complete my mobilisation - all my main pieces have moved to logical squares. White is actually behind in development, as he has wasted time with his king.",
        "16. Qb3": "Attacking f7",
        "16... e6": "Defending against that threat and attacking his bishop.",
        "17. Bxc6": "He takes. Now which way would you take back dear reader?",
        "17... Bxc6": "Of course! this is better. If I take with the rook, he simply exchanges rooks on c6 and then brings his remaining rook to c1 with a gain of tempo, as it would be attacking my Bc6.",
        "18. Rhd1": "He completes his mobilisation.",
        "18... b4": "With the nasty threat of Ba4.",
        "19. Rd2": "Which he defends against of course.",
        "19... Ba4": "Bishop comes in anyway.",
        "20. Qb1": "Queen retreats.",
        "20... Qb5": "I thought this was good, but Fritz seems to prefer Rxc1 or Bb5 or a6.",
        "21. d5": "Fritz here likes 21.....Rxc8 22. Qxc8 exd5 23. exd5 Rxd5 24. Bxa7 with an edge to black. I tried something else.",
        "21... Bc3": "This!",
        "22. Rd3": "Fritz prefers 22. Nxc3 with equality.",
        "22... exd5": "I take.",
        "23. Nxc3": "He now takes.",
        "23... bxc3": "I take.",
        "24. Qxb5": "He takes.",
        "24... Bxb5": "I take. His rook on d3 is attacked and if 25. Rd3xc3? Rxc3 26 Rxc3 d4 wins for black.",
        "25. Rxd5": "So this is more or less forced.",
        "25... Rxd5": "I take",
        "26. exd5": "He takes.",
        "26... a6": "I move the a pawn to a safer square. Black has a very slight edge.",
        "27. Bd4": "He attacks the pawn",
        "27... c2": "Forced.",
        "28. Bf6": "He tries to restrict my king.",
        "28... Kf8": "So the king comes round here.",
        "29. g4": "I am not sure if he was trying to gain space or just exchange pawns.",
        "29... Ke8": "I continue my king march.",
        "30. Ke3": "and he centralises his. ",
        "30... Kd7": "Mine also.",
        "31. Be5": "I wasn't sure why he played this, perhaps to stop my king march up the board.",
        "31... Rc5": "This move is considered by Fritz, but Fritz thinks that even stronger is 31. f6 and if 36. Bxf6 Kd6 and white's d pawn goes. Black's advantage has increased.",
        "32. f4": "Protecting his bishop so if I take on d5 he takes on c2",
        "32... Ba4": "Protecting the pawn, so I really am threatening to take on d5 now.",
        "33. Kd4": "So king comes up to protect.",
        "33... Rb5": "With a threat of 34....Rb1 winning.",
        "34. f5": "So that 34...Rb1 can be met with Bf4 protecting his rook. But now he loses a pawn.",
        "34... Rb4+ 35. Kc5": "His king strolls up. ",
        "35... Rxg4": "and the pawn goes.",
        "36. fxg6": "He takes - now which way would you take back dear reader?",
        "36... Rxg6": "I took this way, so that my f pawn is passed. Fritz actually prefers taking back with the f pawn, when Fritz thinks black is over a pawn and a half ahead.",
        "37. Bf4": "Bishop eyes the vital queening square on c1. Fritz thinks it is a mistake.",
        "37... Rg4": "I attack the bishop.",
        "38. Be5": "Bishop moves.",
        "38... f5": "Charge!",
        "39. Bf6": "I thought he was aiming for Rc1-e1 followed by Rd7+ and a few checks. I decided to stop that, although Fritz likes f4 here.",
        "39... Re4": "But I played this.",
        "40. Rg1": "And now he \"threatens\" a rook check on g7. Fritz thinks this is a mistake.",
        "40... f4": "So my pawns advances again.",
        "41. Bb2": "His bishop again eyes the c1 square.",
        "41... Bb5": "I decided to take control of the queening square of my f pawn. Fritz prefers 41...f3",
        "42. Rg7+": "He throws in a check, another mistake according to Fritz.",
        "42... Ke8": "King drops back.",
        "43. Rg4": "Preventing my f pawn from advancing. Fritz again doesn't like it!",
        "43... Rc4+": "Of course!",
        "44. Kd6": "Staying near his advanced pawn.",
        "44... f3": "Fritz puts black more than 3 points up now.",
        "45. Rg8+": "Another check",
        "45... Kf7": "Forced!",
        "46. Rg7+": "Check again.",
        "46... Kf8": "Ending the checks.",
        "47. Rg3": "Threatening to take the pawn with check.",
        "47... Rf4": "The obvious move, and very good. Fritz puts black as nearly plus 8 now.",
        "48. Bc1": "He attacks the rook. What would you do dear reader?",
        "48... Rf7": "I manage to find a dreadful move, turning a completely won game to a completely lost game! Fritz says 48...Rf6+ and black is plus 12.63",
        "49. Bh6+": "Of course! Now Ke8 50. Rg1 leads to mate, so there is only one other move.",
        "49... Rg7": "Now 50. Bxg7+ and white is 7.03 up.",
        "50. Rxf3+": "But thankfully he didn't take it.",
        "50... Kg8": "Now, unbelievably Fritz gives the position as completely level! That's what the  players thought anyway, as white played 51. Rg3 and offered a draw, which I immediately accepted."
    },
    "url": "https://gameknot.com/annotation.pl/malpas-oswestry-1-v-wrexham-1?gm=65551",
    "gameName": "Malpas & Oswestry 1 v Wrexham 1",
    "players": "Piotr Swiech (ECF177) vs. Charles L Higgie (ECF173)",
    "opening": "Gruenfeld (D86), exchange, classical variation"
}