{
    "moves": {
        "1. d4": "It has been a while since I lost two serious matches in a row, and even longer since I lost a serious match to a female player. But if I have to lose - well Imogen Camp http://www.colwynbaychess.org.uk/icamp.html is a Woman Candidate Master, and perhaps losing to her is no disgrace, although I do have a slightly higher FIDE and ECF ratings than her.",
        "1... d5 2. c4": "Anyway, it started off as a Queens Gambit. https://en.wikipedia.org/wiki/Queen%27s_Gambit",
        "2... e6": "Which she declines",
        "3. Nc3": "I follow the main line.",
        "3... Nf6": "As does she.",
        "4. Bg5": "This is considered \"main line\" although the exchange variation 4. cxd5 and 4. Nf3 are both more popular.",
        "4... Be7": "The usual reply.",
        "5. e3": "Played so that if she takes on c4 I can take back with the bishop.",
        "5... Nbd7": "The usual continuation.",
        "6. Nf3": "The normal square for this knight.",
        "6... c6": "Of course, this structure has also come about via the Slav Defence. https://en.wikipedia.org/wiki/Slav_Defense",
        "7. Qc2": "We had rattled out the first moves very quickly. We began to slow down a bit.",
        "7... O-O": "Black's set-up is very normal.",
        "8. O-O-O": "But this a bit unusual",
        "8... dxc4": "She takes.",
        "9. Bxc4": "I take back.",
        "9... b5": "She hits my bishop.",
        "10. Bd3": "Bishop drops back.",
        "10... h6": "She hits the other bishop.",
        "11. h4": "And I protect it. She thought for a long time here. If she takes the bishop, I take back withe pawn, and she can't then move the Nf6 or she gets mated, for instance \thxg5\n12.\thxg5\tNd5\n13.\tBh7+\tKh8\n14.\tBg8+\tKxg8\n15.\tQh7#\t",
        "11... a5": "So she plays this instead. I can't see this move on my opening databases, I can only see Qa5 and Bb7 here.",
        "12. Ne5": "So I advance.",
        "12... Bb7": "She continues to develop.",
        "13. f4": "Supporting the knight, but with the added advantage of protecting g2 with my queen on c2 if ever she plays c6-c5.",
        "13... Re8": "She continues to develop.",
        "14. Rh3": "Protecting e3 but also with attacking ideas in mind, such as Rd-h1 and Rh3-g3 or Rd-g1 and g2-g4.",
        "14... Nxe5": "She takes - which way would you recapture dear reader?",
        "15. fxe5": "I finally decided to take this way.",
        "15... Nd5": "The usual follow up.",
        "16. Bxe7": "Getting rid of her good bishop.",
        "16... Qxe7": "She takes back.",
        "17. Ne4": "My knight takes up a string central position.",
        "17... Nb4": "She forks my queen and rook.",
        "18. Qb1": "Queen drops back. Now, would you take on d3 or not dear reader?",
        "18... Ref8": "She didn't, and I think she is right not to. I think she is perparing to chip away at my centre with f7-f6.",
        "19. Rf1": "So I put a stop to that. Now f6\n20.\texf6\tgxf6\n21.\tRg3+ and black is in trouble. If the king goes to f7 the f6 pawn falls, and if the king goes to h8 then 22. Rg6 forks h6 and f6 and f6-f5 is met with 23. Nc5 and e6 is now attacked as well as h6 and Rf6? is met by exchanging on f6 and then I take the bishop on b7.",
        "19... c5": "But now she has this move, so maybe my last move was a mistake? (perhaps better a3)? The Bb7 comes to life and the tide starts to turn against me.",
        "20. Bxb5": "I take this pawn. Find black's next move.",
        "20... Nxa2+": "A brilliant pseudo sacrifice by my young opponent. Of course, if I take her knight, she takes my knight and is threatening g2, with advantage to black.",
        "21. Kd1": "So I leave it.",
        "21... cxd4": "She takes. Black's game hangs by a thread! 22. Nf6 nearly wins. If 22.\tNf6+\tgxf6\n23.\tRg3+\tKh8\n24.\texf6\tQb4\n25.\tRg7\tNc3+ wins for black.",
        "22. exd4": "So I take back.",
        "22... Qb4": "Forking b5 and d4.",
        "23. Bd3": "Bishop drops back.",
        "23... Qxd4": "She takes the pawn.",
        "24. Qxa2": "I take the knight.",
        "24... Bxe4": "She takes mine.",
        "25. Rf4": "I pin her bishop.",
        "25... Qg1+": "She trhows in a check.",
        "26. Bf1": "Bishop drops back.",
        "26... Bxg2": "She takes anyway.",
        "27. Rg3": "I pin the bishop again. OK find black's next move.",
        "27... Qh2": "The only move. But one is enough!",
        "28. Qa3": "I protect my rook.",
        "28... Bxf1": "She takes.",
        "29. Rxf1": "I take back.",
        "29... Rfd8+": "She checks.",
        "30. Kc1": "Rd3 was probably a better defence, but white is lost now.",
        "30... Rac8+": "Another check.",
        "31. Kb1": "Again maybe Rc3 is better, but lost eventually.",
        "31... Qc2+": "Another check.",
        "32. Ka2": "I was expecting Rc4 or Rd4 forcing resignation, but she found another win.",
        "32... Qc4+": "Forking king and rook. I resigned. Many thanks for reading, please rate this annotation with the star system, and leave a comment or tow to let me know how I am getting on, until next time dear reader!"
    },
    "url": "https://gameknot.com/annotation.pl/malpas-oswestry-1-v-colwyn-bay-1?gm=63584",
    "gameName": "Malpas & Oswestry 1 v Colwyn Bay 1",
    "players": "Charles L Higgie (1918\t) vs. Imogen Camp (1798)",
    "opening": "QGD (D53), Lasker variation"
}