{
    "moves": {
        "1. e4": "He starts classically.",
        "1... c5": "I opt for the Sicilian.",
        "2. Nf3": "He plays the main line.",
        "2... Nc6": "And I do likewise.",
        "3. d4": "He goes for the open variation.",
        "3... cxd4": "So I take.",
        "4. Nxd4": "He takes back.",
        "4... Nf6": "I hit his e pawn.",
        "5. Nc3": "He protects.",
        "5... d6": "This is a very normal position.",
        "6. Bg5": "The Richter–Rauzer Attack (ECO codes B60 et seq). The move 6.Bg5 was Kurt Richter's invention, threatening to double Black's pawns after Bxf6 and forestalling the Dragon by rendering 6...g6 unplayable.",
        "6... e6": "I prevent him doubling my pawns.",
        "7. Qd2": "This is usual development for white. Vsevolod Rauzer introduced the modern plan of Qd2 and 0-0-0 in the 1930s. ",
        "7... a6": "Usual again, preventing a white knight from coming to b5 and also preparing b7-b5.",
        "8. O-O-O": "He continues with his plan.",
        "8... Bd7": "Protecting Nc6, so preparing b7-b5.",
        "9. Nb3": "This is an interesting move. If now Be7 10. Bxf6 and if I take back with the bishop my pawn on d6 falls. So I decided to continue with my queen-side play.",
        "9... b5": "I am now threatening b5-b4 and after Nc3 moves, I can play Nf6xe4 and if he plays Bg5xQd8 then I have Ne4xQd2.",
        "10. f3": "So he protects against that threat. Now one of my team mates said he thought f3 was a bit passive, but in fact accoridng to my on-line opening databases, it is the most popular move in this position.",
        "10... Rc8": "10.... Rc8 doesn't seem to be in my opening databases, but it seems to me to be a fairly logical follow-up to my previous play.",
        "11. g4": "This was also criticised by my team mate as being too passive, but this sort of move is often played in this variation.",
        "11... Ne5": "I attack f3.",
        "12. Bg2": "Now this move I think is a mistake. My knight now gets into c4 and it seems very powerful there. Perhaps Be2 was better.",
        "12... Be7": "Now if 13.\tBxf6\tBxf6 14. Qxd6 Nc4, attacking his queen on d6, and after it moves, I have 15....Nxb2 and if 16. Kxb2 I have Bxc3 check",
        "13. h4": "So he carries on with his pawn of advancing his king side pawns. My play on the queen-side seems more dangerous.",
        "13... Nc4": "I hit his queen.",
        "14. Qe2": "Queen moves.",
        "14... Qc7": "I am now threatening to take on b2 and then on c3. If he protects c3 with 15. Bd2, then I have b4 16. Nb1\tNxb2 17.\tKxb2\tQxc2+ 18.\tKa1\tNxg4 and if he takes my knight then Be7-f6 check is killing.\n",
        "15. Rd3": "So he protects c3 another way.",
        "15... b4": "But now his knight comes under fire.",
        "16. Nd1": "Knight retreats.",
        "16... Bb5": "With horrible threats....",
        "17. Nd4": "White finds the best defence, but it drops rook for knight and pawn.",
        "17... Ne5": "With threats to the rook.",
        "18. Nxb5": "He takes the bishop.",
        "18... Nxd3+": "I take the rook with check.",
        "19. Qxd3": "He takes.",
        "19... axb5": "I take the knight.",
        "20. Qxb5+": "He takes the pawn with check. I was tempted to offer the exchange of queens, as I am materially ahead, but I figured his king was still vulnerable with the queens on.",
        "20... Nd7": "I am threatening mate on c2.",
        "21. Ne3": "So he protects.",
        "21... Bxg5": "I take the bishop. I thought taking back with the pawn was best, with pressure down the half-open h file, but I think this position is still better for black.",
        "22. Qxg5": "But he took back this way.",
        "22... O-O": "And I eventually castle.",
        "23. Rd1": "He develops his rook.",
        "23... Rca8": "I hit his a pawn.",
        "24. f4": "He advances again on the king-side.",
        "24... Rfc8": "I like this move, renewing the possible threat on c2 again - so his Ne3 can't move.",
        "25. f5": "He advances again.",
        "25... f6": "I drive the queen back.",
        "26. Qf4": "She retreats.",
        "26... e5": "I hit it again.",
        "27. Qf2": "Queen retreats again.",
        "27... Rxa2": "And I finally gets round to taking the a pawn.",
        "28. Bf1": "Bishop comes round to a better diagonal. ",
        "28... Nb6": "I stop his bishop coming to c4.",
        "29. g5": "Another king-side pawn advance, but what else can he do?",
        "29... Kh8": "I stop any counter-play down the g file.",
        "30. gxf6": "He takes.",
        "30... gxf6": "I take back.",
        "31. h5": "he is still hopeful of something on the king-side.",
        "31... b3": "Threatening to take on c2.",
        "32. c3": "He tries to stop by queen-side play. STOP! What do you think black plays now?",
        "32... Qxc3+": "Did you find this dear reader?",
        "33. bxc3": "So he takes.",
        "33... Rxf2": "I take back.",
        "34. Nd5": "Knight comes in. White is lost now. Can you find the mate in 5 from here? http://gameknot.com/chess-puzzle.pl?pz=158556",
        "34... b2+": "Did you find this move?",
        "35. Kb1": "Forced!",
        "35... Ra8": "And, as there is no satisfactory, long-term defence against Ra8-a1, white resigned.\nMany thanks for reading! Please leave a comment or two and rate it on the start system. Until next time dear reader!"
    },
    "url": "https://gameknot.com/annotation.pl/malpas-whitchurch-v-frodsham-board-1?gm=60081",
    "gameName": "Malpas & Whitchurch v Frodsham Board 1",
    "players": "Mark Cromwell (ECF150) vs. CharlesHiggie (ECF177)",
    "opening": "Sicilian (B58), classical"
}