{
    "moves": {
        "1. Nf3 d5": "The Reti opening\n",
        "2. d4": "fighting for control of the center\n",
        "2... c6 3. c4 e6 4. Nbd2 Nf6 5. e3 c5": "This position looks strange, but black reckons that the d-2 knight is not well placed to battle for central control. \n",
        "6. b3": "gaining space\n",
        "6... Nc6": "standard developing\n",
        "7. Bb2 cxd4": "clearing a path for it's dark squared bishop\n",
        "8. exd4 Be7 9. Rc1 O-O": "gets king to safety\n",
        "10. Bd3": "more developing\n",
        "10... Bd7 11. O-O": "The opening has been a success for White. He has good central control, and prospects of a gradual queenside advance. There is no direct plan for Black, so it starts to drift for a few moves, with disastrous consequences. The bishop is already a little clumsy on d7; I suspect a strong human player would have started to devise a plan to liberate the game back on move 10.\n",
        "11... Nh5": "An over-ambitious idea. Few GMs felt that ...Nh5 was anything other than a bad move.\n",
        "12. Re1 Nf4 13. Bb1": "not wanting to trade\n",
        "13... Bd6 14. g3": "forcing knight to retreat\n",
        "14... Ng6 15. Ne5": "central knight hoping for a trade\n",
        "15... Rc8": "fighting for control of the c-file\n",
        "16. Nxd7": "trading well placed knight for a back-up role bishop\n",
        "16... Qxd7 17. Nf3": "better location for knight\n",
        "17... Bb4": "attacking rook on e1\n",
        "18. Re3": "moving to safety\n",
        "18... Rfd8": "stacking  rook and queen\n",
        "19. h4": "adding kingside space\n",
        "19... Nge7": "White now has an iteresting combinational oppurtunity, 20 Bxh7  Kxh7 21 Ng5 ...... but Kasparov made the correct political decision by keeping things simple, for it would only require the slightest hole in the combination to cost White the game.\n",
        "20. a3": "keepin' it simple\n",
        "20... Ba5": "After Kasparov's move the game was far simpler\n",
        "21. b4": "gaining space and attacking the queenside\n",
        "21... Bc7": "retreat!\n",
        "22. c5": "adding more queenside space and going into blacks territory.\n",
        "22... Rde8 23. Qd3": "Threating Qxh7  \n",
        "23... g6 24. Re2": "White is much better, still in a simple position. With his plan of rolling Black up on the queenside, Kasparov at this point must have been pretty confident in winning.\n",
        "24... Nf5": "making a reasonable flight square for his knight on c6\n",
        "25. Bc3": "preparing for Bd2\n",
        "25... h5": "gaining kingside space, but opening a hole \n",
        "26. b5": "more attacking on the queenside\n",
        "26... Nce7": "All of blacks pieces are now in the back and are no threat what so ever to Whites king\n",
        "27. Bd2": "The bishop having much more scope on d2 than b2\n",
        "27... Kg7": "protecting h6 a little more thouroughly\n",
        "28. a4 Rca8": "preparing for a6\n",
        "29. a5 a6 30. b6": "diving deeper into Black's palace and forcing another retreat\n",
        "30... Bb8": "Trapping the a8-rook in a corner. Black might be able to erect some sort of defence based on the control ofc6, but White will place his bishop on a4 and taunt Black with ideas of Ne5 or infiltration on the kingside dark squares- or else a massive kingside onslaught if Black goes into a queenside huddle.\n",
        "31. Bc2": "Looking at a4\n",
        "31... Nc6 32. Ba4 Re7 33. Bc3 Ne5": "The computer spots a freeing tactic, but it's to no avail.\n",
        "34. dxe5 Qxa4 35. Nd4 Nxd4 36. Qxd4 Qd7 37. Bd2 Re8 38. Bg5 Rc8": "Black can barely move. The end is near for Deep Blue.\n",
        "39. Bf6+ Kh7": "Blacks position is a total disaster! To add injury to insult, Kasparov can now execute a tactical breakthrough\n",
        "40. c6 bxc6": "Black cannot avoid giving White a passed b-pawn, since 40...Rxc6 41 Rec2  Rxc2 42 Rxc2 leaves black completely helpless.\n",
        "41. Qc5 Kh6 42. Rb2 Qb7 43. Rb4": "Black has no moves apart from shuffling his king. White has all the time in the world to walk in to finish the rout. 1-0\n"
    },
    "url": "https://gameknot.com/annotation.pl/man-vs-machine?gm=8663",
    "gameName": "man vs. machine,",
    "players": "Kasparov  vs. Deep Blue ",
    "opening": "Reti opening (A06)"
}