{
    "moves": {
        "1. e4 Nf6": "[1 hr 12 min left] I arrived 3 min late. This is my favourite Alekhine's defense",
        "2. Nc3 d5": "Scandinavian variation of Alekhine's defense lets you avoid Vienna game or Sicilian.",
        "3. exd5": "3. e5 should be stronger, as it misplaces the black knight. However, then white has to be ready for the complications after 3... d4 4. Ne2 Ne4.",
        "3... Nxd5 4. Bc4 e6": "One of the two main two lines, the other one being 4...Nb6",
        "5. Nf3": "Unfortunately, 5. Qf3 does not work in view of 6... Nb4 7. Bb3 N8c6! 7. Nge2 Na5 8. Ba4+ Bd7 9. a3 and here Black equalizes in all lines. I knew this bit of opening theory, so was not afraid of it.",
        "5... Be7 6. d3": "The main line is 6. d4. I do not see the point of playing 6.d3 when 6. d4 is possible.",
        "6... O-O 7. O-O c5": "[1 hr 11 min left] I should have played 7. ... Nxc3 here, before the knight runs away from c3 to e4. I saw Ne4, but did not evaluate it properly.",
        "8. Ne4": "[1 hr 9 min left] The best move according to computer. Strategically the place for a knight is perfect, as he cannot be displaced without creating long-term weaknesses for black.",
        "8... Nc6": "[1 hr 8 min left] I should continue developing.",
        "9. a3": "[1 hr 9 min left] This ensures the bishop cannot be exchanged for a knight via Na5.",
        "9... b6": "[1 hr 3 min left] Here I started thinking, and having spent 5 minutes could not find anything better than this not demanding developing move. The second bishop needs a place to stand.",
        "10. Qe2": "[1 hr 7 min left] 10. Re1 followed in Reinaldo Castineira (2448) vs. Ibarra Jerez (2435) Granada 2005 where the current position was reached via 1.e4 c4 move order :) My opponent continues playing fast. ",
        "10... Bb7 11. Re1 Nd4": "[52 min left] Apparently Qd7 was not any worse, as White cannot yet start the attack on the kingside. E.g. 11... Qd7 12. Neg5 Nd4 13. Nxd4 cxd4 =. The move I made is not bad either, as it creates a thorn in the centre which cannot be easily removed (d4). I spent 10 minutes (from 1 hr 2 min to 52 min left) considering the disadvantages of weak pawn on d4, but found it well placed there. And if d4 pawn cannot be destroyed, then it creates nice space advantage for black.",
        "12. Nxd4 cxd4 13. Bd2": "[1 hr 3 min left] I was surprised at this slow move. The position is roughly equal, and black has some space advantage. In my opinion White should concentrate their forces for an attack of the kingside. Thus 13. f4 or 13. Qh5 can be considered. Without confrontation black can concentrate his effort on getting hold of c and d files. Alternatively, 13. c3 had to be played, as d4 pawn hinders white's development.",
        "13... Rc8": "[48 min left] Rook on c8 is a long-term bonus. Now a number of threats appear, such as b5-b5, or Nd5-f6 with Bb7-d5. Fritz likes 13... Qd7 and 13... Qc7 too.",
        "14. Bb3": "[1 hr 1 min left] White's move has no purpose. but it is difficult to find a good plan now. 14. c3 dxc3 15. bxc3 Qd7 was good for black, as their coordination of pieces is good. 14. f4 b5 15. Bb3 a5 16. c4 dxc3 17. bxc3 Qb6 18. Kh1 a4 is also pleasant for black, as his space advantage grows.",
        "14... Nf6": "[39 min left] At the beginning of the game Ne4-g5-e6 idea bothered me a lot, and I am sure this threat was visible to Armand. Thus, I almost expected Ng5, even though this is by no means required. Alternatively, 14... Qd7 could have been played. The position is equal. I spent 9 minutes on this move - more then necessary. ",
        "15. Ng5": "[59 min left] Expected move happened.",
        "15... Bd5": "[39 min left] Intended continuation, with the idea of queenside pressure after bishop on b3 disappears. 15... Bd6 and 15...Nd5 were also possible.",
        "16. Ba4": "[57 min left] This move is not very good in view of 16... b5. Either Nf3 or Rac1 should have been played instead. Unfortunately, the bishop will not survive.",
        "16... Nd7": "[33 min left] 6 minutes spent on a move which is not the best. I considered 16...b5, but did not play it. I should have played it: 16... b5! 17. Bxb5 h6! 18. Ne4 Rxc2 19. b4 Bxe4 20. dxe4 Nxe4 21. Qxe4 Rxd2 and Black should get advantage in this OCB endgame due to a) better rook b) having targets for attack c) nice d4 pawn.",
        "17. Bxd7": "17. Ne4 b5 18. Bb3 was better for white. Now black gains advantage.",
        "17... Qxd7 18. Rac1": "[51 min left] Surprisingly, this is the \"best\" move, as 18. c3 dxc3 19. bxc3 Bxg5 20. Bxg5 Rxc3 21. Rac1 Rfc8 leads to a position that favours black. 18. Bf4 should be followed by 18... Bxg5 19 Bxg5 Bxg2!, and now if 20. Qg4, then 20... f6 21. Qxg2 fxg5 with advantage for black (22. Qxg5? Rxc2). Given that Rc1 is the best move now, we have to recognise that black has some advantage, and white can only defend.",
        "18... Qb5": "[27 min left] This is one of the best moves, double-attacking g5 and b2. I think black had reliable advantage after this move. ",
        "19. b3": "Mistake. Quite inadequate move, but there is no adequate defense there. E.g. 19. c4 dxc3 20. bxc3 Bxg5 21. Bxg5 Bxg2 22. Qg4 Bf3 23. Qg3 Qf5 with extra pawn and some advantage for black.",
        "19... Bxg5": "[22 min left] Having 27 minutes left I do not go for the more precise Bxa3. Surprisingly, the queenside collapses so fast after Bxa3, that white have no time for counterattack. 19... Bxa3! 20. Ra1 Bb2! 21. Rxa7 h6! 22. Nf3 Rxc2 -+ and black is winning, as white lacks any compensation for the lost pawn.",
        "20. Bxg5 Bxg2": "[20 min left] This is stronger than 20... Bxb3. After Bxb3 white gains nothing after 21. Qg4 f5! 22. Qg3 Bxc2 23. Bh6 Qd7, where Black is winning. However, after 21. Be7 Rfe8 22. cxb3 Rxc1 23. Rxc1 Rxe7 24. Qe5! Qd7 25. Rc4 h6 26. Rxd4 Qc7 black has only slight advantage, as white's pawns are poorly placed.",
        "21. Qg4": "[43 min left] Tricky 21. Bh6! should be met with either 21...Qf5 or 21...Bh3 preventing Qg4. Unfortunately, attack after 21. Qg4 quickly loses its strength.",
        "21... Bf3": "[16 min left] To get advantage black must preserve d4 pawn and his kingside. Without d4 pawn b3-c2-d3 pawns gain some strength, as well as g7 square can be attacked from d4. It seems there is only one way for black to achieve this. 21... Bh3 is weaker, as control over e4 square is lost. And e4 needs to be controlled to prevent attacks on d4 pawn.",
        "22. Qg3 Qf5": "[14 min left] This is the only correct move for black in this position, as it counters Re5 threat as well as Bh6 threat. 22... Bh5 23. Bf6 Bg6 24. Bxd4 would allow white to survive.",
        "23. Re5": "[37 min left] This attacking move comes naturally, but is not strong. Better was 23. Bf4 Qg6 24. Qxg6 hxg6. Alas, the resulting OCB endgame is very good for black, as his bishop has targets (b3-c2-d3) while pawn on d4 is not yet a weakness, as it is impossible to attack it properly. ",
        "23... Qg6": "[12 min left] Again, this move is much better than 23...Qg4 24. Qxg4 Bxg4 23 Re4, as d4 pawn is safe in this line. d4 pawn is very important for black.",
        "24. Qxf3": "[36 min left] White did not have to take the bishop, but there aren't many good alternatives. ",
        "24... f6": "[12 min left] The only move for black.",
        "25. Rb5": "[36 min left] This is a blunder, but in a lost position. 25. Rae1 Qxg5 results in heavy-piece endgame with extra pawn for black.  Black has more active rooks, white has weakness on c2 that cannot be defended. White should lose. But 25. Rb5?? loses faster",
        "25... a6": "[12 min left] White resigned in view of 26. Qg3 (26. Rxb6 Qxg5+ 27. Qg3 Rxc1+) axb5 27. Bd2 Qxg3 28. hxg3 Rc6, and white is down a pawn and an exchange, and is bound to lose the c2 pawn too!"
    },
    "url": "https://gameknot.com/annotation.pl/manchester-league-altrincham-hale-vs-blue-2-08-03-2016?gm=60935",
    "gameName": "Manchester League, Altrincham & Hale vs Blue 2, 08/03/2016",
    "players": "Catz, Armand (155) vs. Kolodiy, Yaroslav (170)",
    "opening": "Alekhine's defence (B02), Scandinavian variation"
}