{
    "moves": {
        "1. e4": "\"Best by Test\" Robert J. Fischer ... of course it has not yet passed the Fischer Test. Perhaps this will be a proto-type !? ",
        "1... e5": "A very Laskerian reply~! Now Black need only Play Like Lasker would . . . ",
        "2. Nf3": "Far ahead of his time, Ruy Lopez develops the ultimate Open-Game for Blitzing. Epawn, King-knight, Bishop, Bishop, O-O was the physically quickest Right-handed opening in existance until the advent of the Hyper-Modern-Reversed School created; Nf3, g3, Bg2, O-O, d3. (Of course one can squander several nano-seconds when blitzing by sundial). A very perceptive use of Space-time by the Father of Relativity. ",
        "2... Nc6": "Laskerian & Steinitzian ... They obviously held no fear of Bobby's e4 opinion !!? ",
        "3. Bb5": "A Ruy Lopez ... The critical point will be whether he is following Ruy, or following Bobby !? ",
        "3... a6": "a6! Still in good stead ... while Paul Morphy never played a6, he did get this variation named after him for playing ...P-QR3 all the time. Thus showing how far ahead of his time he was. Remember this was even before Steinitz created his own name bearing variations. Which bear the name Old Steinitz for ...P-Q3, and strangely \"New Steinitz\" for preceding that with Morphy's older 3...P-QR3 (!?). Apparently named by someone having real issues with Cause & Effect ?! Has Quantum Mechanics raised its ugly heads? Or just someguy in perpetual time trouble from believing The Arrow will flip, if he wait long enough ?!?  }8-0  \nI suggest that instead we call That the Paul variation ... ",
        "4. Ba4": "Still Fischer on Ruy ",
        "4... b5": "Angelschach, the way it Should have been spelled. Please note for all future annotations by those who'd \"love to change the world, but don't know what to do\" . . . This is step #1. \n\n[I note that the GK d-base has changed nomenclature to the simple \"Wing Attack\" for this line. Personally, I dislike it when Opening names become depersonalized. Particularly distressing is when the Rauser Attack vs the Sicilian Dragon became the less personal \"Yugoslav Attack\" and even moreso, the Ruy Lopez becoming called the \"Spanish Opening\"??! Yech. One step in the correct direction, the \"Center-Counter Defense\" is now the Scandinavian. A major improvement~! ] \n\nHow appro of Oppy; Father of the Atomic Bomb plays the Angels' game. As you might expect, attendant risk is somewhat higher than mainline Ruy, since Angels will tread where none but Fools or Physicists will follow. Let's see if Albert can defuse it? ",
        "5. Bb3 Nf6": "Following the earlier precedent, this might be called the New Angels' Berlin Defense, being a position where the Berlin (3...Nf6) has been preceded by Morphy's old move (P-QR3), thus making it \"New\" and then the Angel's P-QN4. Or would that be the New New Angels' Berlin ... never mind. I guess its nameless? And now we know Why ...",
        "6. O-O": "Still making Blitz Moves. White would be definately ahead on the sundial ",
        "6... Nxe4": "Ah! Ach~! Achoo~! \"Touch Move\" ... Oppy's hand landed on the knight after sneezing. Oeeew, germs. ",
        "7. Re1": "7.Re1 Logical & fearless of contagion. Clearly, under the circumstances, White can Not try to transpose to a RIGA VARIATION with 7...d4. And its too late. It would be more of a New New Angel's Berlin Riga Variation Deferred & Blown. Which is not to call it a BAD Move. Other ideas here: 7.Nxe5 as from the Berlin Variation (transposing to it thusly) Also 7.Bd5, 7.a4 or 7.Qe2 could be played. It would be relatively impossible for White to find any move sufficiently adverse to call it a game losing. He might even venture the strange looking 7.c4 , an idea borrowed from another line I believe to be called a Howell Attack, then if ...bxc?! 8.Ba4 [And here is a Secret for loyal forum readers ... The c4 idea is NOT in either the GK nor GK-World d-bases. So if you are looking to exit from the d-base by a side door, I don't believe the door will fall off from this move. You can trust me on That; as long as you run 4 or 5 computer trials before using it ;) ] ******* \nThe 7.Re1 move actually an older approach (than d4 first) to an Open Lopez, quite playable, and may continue with 7...d5 8.d4 Be6 9.dxe5 which completes full transposition to mainline Open Lopez of the modern caste.",
        "7... d5": "Still very bookish, very PhD-ish too I imagine",
        "8. a4": "Very similar to an Anti-Marshall idea that is all the rage this century. The difference being Black has already gotten to play his ...d5 move. ",
        "8... b4": "b4 or Rb8 seem to be that \"Natural\"s ... but the most interesting to my own sense of \"It-might-work-in-blitz\" is the idea is 8...Bc5 !? which appears complex & entertaining enough to make it my instant choice since f2 appears gaping. (Bearing in mind, appearances Can Be Deceiving, yet ... its the perfect blitz move since Black gets a free-think on WT's time, unless WT dives in instantly with 9.axb5 !?  Or with 9.d4 ... which Appears Safer (Bearing in mind ... )",
        "9. d3": "Since d3 and d4 were both in the d-base ... it appears they must be okay",
        "9... Nc5": "A standard from the old method vs Open Lopez, already mentioned",
        "10. Nxe5 Ne7": "Ne7 ... This is why the man gets the big bucks; to be a physicist, not a Chess player. Better is, well pretty much anything that does not drop the N to \"Takes\" or drop the Queen to a N-Move discovered Check.",
        "11. Qf3": "Here we go ... once initiated, when will the reaction stop? ",
        "11... f6": "Last chance to play 11...Be6 is passed by. I looked at 11...Bf5, (thinking to retreat it Bg6 for further f7 defense) but it seems to get a bit silly after the obvious 12.Nc6 and the roof falls in no matter where the Queen runs to. Now the roof falls differently",
        "12. Qh5+": "There is a N-killing bind after 12.Nc6 Qd7 13.Bxd5, and threatening 14.d4 , the Nc5 has run too far to get home. IF 12...Qd6 13.Bxd5 threatening the kick 13.Bf4 & 14.d4 but in my experience, A-players don't Bind. \n\nAll together now; what Do A-players ALWAYS know how to do(?) ... ATTACK ~!! \n\n{ Yes, I DO have a thing about A-players! ... since sitting on my 1800 USCF Floor for 10 years, I feel that makes me The Eternal A-Player ... besides Everyone of you being higher rated A players than me. Thus, if I be destined to the fate of eternal Master-fodder, I better dinged well learn to Enjoy it, yes !?  So I do ... but now you know; I say it with Love for all of you, my Brothers In A-rms }8-D\n\nAnyway, a King is worth more than a mere piece ",
        "12... g6 13. Nxg6": "Ouch, ouch, ouch ~!!! ... {Is this not exceedingly accurate? Then why don't  we see this notation more? The Truth shall set you free ... but perhaps it doesnt sell books !? So I offer an abbreviated version: \"O-FFF\" .... annotators take note. I am Not copyrighting this. You are ALL free to use it. Eric ... }B-)\n",
        "13... hxg6 14. Qxh8 Nxb3 15. cxb3 Qd6 16. Bh6": "   O-FFF",
        "16... Kd7 17. Bxf8 Bb7 18. Qg7 Re8 19. Nd2 c5": "\"There is no defeat in failure, when striving to do the impossible ... \" ",
        "20. Rad1 a5 21. Nc4": "WHAT's going on here ... I thought A-players didn't Bind ~!  Clearly, Albert left his inner-pacifist at home that day. ",
        "21... dxc4": "O-F gg ",
        "22. dxc4 Qxd1 23. Rxd1+": "! ",
        "23... Kc8 24. Bxe7": "?? ... It Appears 24.Qf7 wins two pieces after Rxf8, or after ...Rd8 25.Qe6+ . Or else takes all the noble wood off the board in short order after 24...Kb8 . So I'm not sure if Bxe7 is a case of Mercy, or \"Can't be a genius Every move\", to para-phrase Paul Morphy, very loosely. Thanks again, Blake! For this intriguing battle of the minds. I enjoyed it very much, and hope everyone did. "
    },
    "url": "https://gameknot.com/annotation.pl/manhatten-project?gm=42438",
    "gameName": "Manhatten Project",
    "players": "Einstein (Purported A-player) vs. Oppenheimer (Not Purported A-player)",
    "opening": "Ruy Lopez (C70), Graz variation"
}