{
    "moves": {
        "1. e4 e5": "I don't normally play e5 and I don't think I have played it since some of my earlier games, never much liking the symmetry. however I've been looking into the ruby Lopez from both sides lately and thought I'd give it a shot.",
        "2. Nf3 Nc6 3. Bb5 a6 4. Ba4 Nf6 5. O-O Be7 6. Re1 b5 7. Bb3 O-O 8. c3 d5": "The Marshall gambit! I was inspired to take this when is saw vasily ivanchuk- Peter Leko ningbo teams 2011. That with the accompanying analysis was a real treat to read through and seeing it was when I first realised just how much preparations GMs do. What I like about this gambit is that black gets a fierce kingside attack where white must step very carefully however even more than that black gets long term positional compensation, so even if white parries blacks kingside attack the resulting positions are often drawn anyway since black will usually have long term activity even into the endgame and also such positions often result in opposite coloured bishop endings. Not to mention the opening is considered sound and playable even by today's GMs and finally the fact that human intuition is actually more important than computer analysis which is always a bonus",
        "9. exd5 Nxd5 10. Nxe5 Nxe5 11. Rxe5 c6": "Mainline ",
        "12. d4 Bd6 13. Re1 Qh4": "The point being to weaken the light squares around the white kingside",
        "14. g3 Qh3 15. Be3 Bg4 16. Qd3": "Forced as anything else gets mated after ...Bf3",
        "16... Rae8 17. Nd2 f5": "A thematic move ",
        "18. f4": "White halts the pawn in its tracks, black gets serious play and a strong attack if the pawn is allowed to advance any further",
        "18... Kh8": "I had thought about playing ...g5 first which is keeping in spirit of the opening however I figured I would get out of the pin first before exposing my kings position any further, though g5 was perfectly safe and playable",
        "19. Bxd5": "Now that I am out of the pin white chooses to snap off the knight, however as a result I now have complete domination of the light squares",
        "19... cxd5 20. Qf1 Qh5": "Something I noticed about this position is that I relay do have complete control over the light squares, blacks queen and bishop cannot be chased out of the kingside light squares no matter what further more the fact that I have both bishops, the queen, both rooks and the g pawn ready to lever at the white kingside means I'm not going to be short of attacking chances for a while, as well as that whites knight doesn't have a whole lot of great squares at the moment and the white DSB is little more than a giant pawn. Having said that white will be able to tear apart blacks queenside without any trouble and white is still a pawn up after all, but I was happy with my position at this point.",
        "21. a4": "Thematic",
        "21... bxa4 22. Rxa4 Re6 23. Rxa6 Rfe8 24. Qb5 g5": "White is two pawns up and has a passed b pawn so black needs to drum up some quick action on the kingside if he doesn't want to get run over in the endgame",
        "25. Qxd5": "This surprised me to be honest as now black wins a piece however on the other hand white has three extra pawns, and they are 3 connected passed pawns ",
        "25... gxf4 26. Rxd6 Re6xe3 27. Rxe3 fxe3 28. Rd8 exd2": "Now we liquidate into a bishop vs 3 pawns ending, I'm pretty sure it's a forced draw",
        "29. Qe5+ Kg8 30. Rxe8+ Qxe8 31. Qxe8+": "Whites a queen up but this is only temporary because eventually she will need to give herself up in order to prevent black from promoting, the only other option is for white to continuously give check, and is this would result in an eventual draw its obvious that white will not allow this to happen",
        "31... Kg7 32. Qa4 d1=Q+ 33. Qxd1 Bxd1 34. Kf2 Bb3": "Probably I should have moved my king first",
        "35. Ke3 Kf6 36. Kd3 Kg5 37. c4 f4 38. gxf4+ Kxf4 39. Kc3 Bd1": "Planning to swing around to g4",
        "40. Kb4 Kg5": "?! Moving my king away from the action ",
        "41. c5 Kf6 42. c6 Ke6 43. Kc5": "White has managed to get his king to assist his pawns and as a result black is has no way of stopping them",
        "43... Bb3 44. Kb6 Kd6 45. c7 Be6": "I resigned here since after 46.Kb7 Kd5 47.C8=Q Bxc8 48.Kxc8 Kxd4 or ...h5 white will simply win my h pawn after my king goes after the pawn on b2. Anyway hope you enjoy this game and hopefully someone could identify where the losing move was in the endgame since my opponent even confirmed that the ending was a draw and I messed up somewhere. Anyway until next time"
    },
    "url": "https://gameknot.com/annotation.pl/marshall-attack?gm=46867",
    "gameName": "Marshall attack",
    "players": "jbsnake (2129) vs. thereaper1 (1708)",
    "opening": "Ruy Lopez (C89), Marshall, main line, Spassky variation"
}