{
    "moves": {
        "1. Nf3": "My current favourite as white, a flexible move that allows me to reach many of my favourite openings whilst avioding those I'm not so keen on. For example i can still reach the sicilian if Black plays 1...c5 and i avoid the possibility of the symetrical kings pawn openings.",
        "1... Nf6": "A common and flexible responce. From here the game usually transposes to one of many Queens pawn openings.",
        "2. d4": "White is first to commit in the centre, and this does infer a slight disadvantage as black can aim for the Grunfeld where white has already committed his Kings Knight to f3 where it is susceptible to a nasty pin by Blacks White Squared Bishop.",
        "2... e6 3. c4 c5": "Black appears to be aiming for a Modern Benoni type position.",
        "4. d5 a6": "?! an unusual move so early on in this set up, Black does usually try to expand on the queenside but not at such an early stage!",
        "5. Nc3": "Simply developing, this also meets the threat of ...b5 although I'm not sure how strong that move would be it's always frustrating when your opponent stops you from achieving your aims.",
        "5... Qa5": "!? Black is quite obsessed with forcing the ...b5 advance but it cannot be achieved, at least not by this move.",
        "6. Bd2": "Preventing the advance with a threat on the Black Queen.",
        "6... Qc7": "!? Preventing the Dark Squared Bishop taking up its natural post on f4, but at the cost of allowing white to play e4 before black has exchanged on d5, although after the earlier Queen detour Black must allow the e4 advance anyway.",
        "7. e4 e5": "?! Black chooses to block the centre up entirely, however his Queen in now somewhat misplaced as Black obviously intends to play ...d6.",
        "8. Bd3": "?! I think the Bishop is better placed on e2 but i played it here as i had some vague ideas about forcing the centre open when the bishop would sit nicely on the b1-h7 diagonal.",
        "8... d6 9. O-O Bg4": "The pin may look annoying but the bishop only provides tempi for a kingside pawn storm...",
        "10. h3 Bh5": "obviously with the desire to maintain the apparently awkward pin but with such a closed centre and Black low level of development white can afford to push on kingside inspite of his king being there",
        "11. g4": "!? pressing on with my plan of kingside expansion...",
        "11... Bg6 12. Nh4": "getting out of the f pawns way",
        "12... Be7 13. f4": "Exposing the white king but as Capablanca said a weakness is only weak if it can be attacked. The central pawns cover the diagonals nicely and stop the Black forces from crossing to the kingside quickly.",
        "13... exf4": "pretty much forced as the Bishop would be trapped and 13...h6 14.Nxg6 followed by capturing on e5 concedes the open f file and wrecks blacks kingside pawns.",
        "14. Bxf4 Nbd7": "aiming at e5.",
        "15. Nf3 Ne5 16. Nxe5 dxe5 17. Bg3": "Keeping pressure on the Black centre.",
        "17... Nd7": "preparing to block the f file with ...f6 and defending the centre.",
        "18. Qf3": "Building a major piece battery along the f file.",
        "18... O-O": "I might have been tempted to castle queenside and then try and expose the weaknesses around the white king.",
        "19. Rf2 f6": "Solidifying the centre, weakening the kingside. It's normally best not to move pawns in areas under attack.",
        "20. Raf1": "apparently biting on granite but the g pawn will soon loosen the kingside",
        "20... Rfb8": "Black now attempts to generate counterplay on the queenside, however he is removing a vital defender from the kingside.",
        "21. a4": "Attempting to slow Blacks queenside play",
        "21... Qa5": "The queen lends a hand in preparing the ...b5 push at the cost of further distancing herself from her King.",
        "22. h4": "Preparing the g5 push and creating the option of h5 when the bishop will get in the way on both f7 and e8.",
        "22... Be8": "?! blocking the the Rooks defence of the kingside which could be costly should Black not be careful.",
        "23. Bc2": "defending the a4 pawn. 23.g5 is another possibility that is worth looking at.",
        "23... b5": "!? A pawn sac to try and get the counterplay going, probably not good but black needs space.",
        "24. cxb5 axb5 25. Nxb5 c4": "The point, c5 is freed for the Black pieces.",
        "26. Kh1 Nc5": "?? A mistake, loses a whole pawn and gives white a massive attack.",
        "27. Bxe5": "The f pawn is pinned to mate on f8, the b8 Rook is attacked and the Dark Squared Bishop has taken up a very offencive square on the long diagonal.",
        "27... Rb7 28. Bc3": "The perfect square for the DS Bishop, it holds the queenside together applies pressure to the kingside and is protected by Blacks c4 pawn!",
        "28... Qa6": "28.Qd8 is another try that should be looked at.",
        "29. g5": "! ",
        "29... Nxa4": "? Black exchanges his best piece to gain a worthless wing pawn.",
        "30. Bxa4": "Obviously not letting the DS Bishop be exchanged.",
        "30... Bxb5": "Getting the awkward LS Bishop out of the way of the Rooks.",
        "31. Bxb5 Rxb5": "31...Qxb5 is similar.",
        "32. gxf6": "threatening fxg7 which is fatal, the pawn must be removed.",
        "32... gxf6": "32...Bxf6 33.e5 and the Bishop can't be saved and so White will get another pawn on f6 which will cost Black yet more material, the move played looks more dangerous as it opens the g file for whites major pieces.",
        "33. e5": "Once again allowing a Black pawn on f6 would be fatal.",
        "33... Rf8": "?? Allows a simple mate in 3",
        "34. Rg2+": "1-0 34...Kh8 35.Qg3 and mate next move."
    },
    "url": "https://gameknot.com/annotation.pl/marv7s-mini-tournament?gm=15146",
    "gameName": "marv7's mini-tournament",
    "players": "kingstuart (1519) vs. sirman (1680)",
    "opening": "Reti opening (A05)"
}