{
    "moves": {
        "1. d4": "!   for me was very important to not let black any chance to get infinitive. ",
        "1... Nf6 2. c4 g6 3. Nc3 d5": "He chooses Grunfeld Defence which can be very tactical if white want. However I want to outplay your opponent in more positional waters.",
        "4. Nf3 Bg7 5. e3": " excellent move to get my opponent rout of well known variation",
        "5... O-O 6. cxd5": " Be2 or Qb3 are also possible but they lead to other schemes",
        "6... Nxd5 7. Bc4": " This was my idea white chase the king and have pawn on e3 instant e4 which give more solid center.",
        "7... Nxc3": "I think Nb6 was stronger.Capture on c3 is common in Grunfeld but here white center is more protected",
        "8. bxc3 c5 9. O-O Nc6": "Normal looking move lead to  disaster!Qc7 is better bust still white keep some safe edge. ",
        "10. Ba3": "!   The improvement over game Yaroslav Djakuzov vs Martin Vassilev where play Qe2 which give some edge but black is still  holding.",
        "10... b6": "cxd4 allow white press queen side easy with qe2 rfc1 rab1",
        "11. dxc5": "!! this was a move  that black has missed.Now the are simple positionally lost.",
        "11... Bxc3 12. Rc1 Qxd1": "This worsen think but black position is extreme unpleasant anyway.",
        "13. Rfxd1 Bb4 14. Bxb4 Nxb4 15. a3": "c6 is also possible and maybe stronger",
        "15... Nc6": "Great mistake black should play Na6.",
        "16. Bd5": "Pin is killing",
        "16... Bb7 17. cxb6 Rac8 18. bxa7 e6": "what to do instead?",
        "19. Bxc6 Bxc6": " ",
        "20. Nd4": "I wasn't   sure to between ne5 and nd4 but it not matter too much.Pawn on 7 row is decisive the rest of game not need comment.",
        "20... Bd5 21. f3 Rxc1 22. Rxc1 Ra8 23. Rc7 Kg7 24. e4 Ba2 25. Nb5 Bb3 26. Rb7": ""
    },
    "url": "https://gameknot.com/annotation.pl/masterful-preparation?gm=64844",
    "gameName": "Masterful Preparation ",
    "players": "David Stefanov (2065) vs. Martin Vassilev (2325)",
    "opening": "Gruenfeld (D94), Makogonov variation"
}