{
    "moves": {
        "1. e4 e5 2. Nf3 Nc6 3. Bb5 a6 4. Bxc6 dxc6 5. d4 exd4 6. Qxd4": "The character of the position is now clear. White has acquired a K-side pawn majority and left Black with a Q-side one that is badly disrupted by the doubled Pawns. Black, however, has the Bishop-pair, which could be put to good use in this open position.",
        "6... Bg4": "Black's 6th move was played with the idea of exchanging the Knight and breaking up White's K side Pawns. This, however, is not a logical plan, as White's doubled pawns would be more mobile than those of Black.",
        "7. Nc3 Qxd4": "Black renounces his plan to disrupt White's Pawns.",
        "8. Nxd4 O-O-O 9. Be3 Bb4 10. Nde2": "After 10 P-B3 BxN ch 11 PxB B-Q2 12 K-B2, unlike Bishops would be left after a possible exchange of Knights, giving Black good drawing chances.",
        "10... Bxe2": "Black gives up his only trump, the two Bishops, to saddle White with doubled Pawns, but his prospects on the Q-side are in now way improved as a result. Correct was 10... N-K2 11 P-B3 B-Q2, and after ...P-KB4 Black can attempt to obtain play with his pieces.",
        "11. Kxe2 Bxc3 12. bxc3": "On the K side it is only a matter of time before White produces a passed pawn.",
        "12... Nf6 13. f3 Nd7 14. Rad1 Ne5": "Better was 14... P-QN3, to be followed by ...P-QB4 and... N-N1-B3.",
        "15. Rd4 b6 16. f4 Nd7 17. Rhd1 c5 18. Rd4d3 Nb8 19. Kf3 Rde8": "Black thinks that by holding on to his Rooks he will be able to better meet the opposing Pawn advance:. The problem is that his King is cut off from where it is needed most, on the K side. Better was 19... RxR 20 RxR K-Q1.",
        "20. f5": "The normal move, 20 P-K5, would have been a mistake in this case because the KBP could not then advance without leaving the KP en prise.",
        "20... f6 21. g4 Re7 22. Bf4 Rhe8 23. Re3 Nc6 24. g5 Na5": "Black has no means of improving his position.",
        "25. h4 Nc4 26. Re2 Rf7 27. Rg1 Kd7": "Somewhat better is 27... P-N3, but White would then play 28 BPxP RPxP 29 PxP RxBP 30 R-N5!, with P-R5 to follow.",
        "28. h5 Nd6": "Facilitates the decisive breakthrough.",
        "29. h6 fxg5": "Obviously not 29... P-N3 30 BPxP RPxP 31 PxP RxBP 32 P-K5 R/3-K3 33 R-Q2.",
        "30. Rxg5 g6": "This loses a Pawn, but after 30... PxP 31 R-R5 the position is hopeless for Black in view of White's two united passed Pawns.",
        "31. fxg6 hxg6 32. Rxg6 Ref8 33. Rg7 Rxg7": "If 33... K-K3 34 R/2-N2.",
        "34. hxg7 Rg8 35. Rg2 Ne8 36. Be5 Ke6 37. Kf4 Kf7 38. Kf5": "Black resigns."
    },
    "url": "https://gameknot.com/annotation.pl/match-game-1909?gm=56216",
    "gameName": "Match Game, 1909",
    "players": "Emanuel Lasker  vs. David Janowski ",
    "opening": "Ruy Lopez (C68), exchange, Alekhine variation"
}