{
    "moves": {
        "1. e4": "Hi everyone!\r\n\r\nI have a collection of games which seem to proove the fact that 2 pieces are better than one rook, even though the side that has the rook may also have a pawn or two for these pieces.  This is Example No.1.  I kick off with 1.e4.",
        "1... e5 2. Nf3 Nf6": "2. ...... Nf6 - this is the Petrov's Defense, a counter-attack against the e4 pawn.",
        "3. Nxe5 Qe7": "3. ...... Qe7 - skewers my knight against my e4 pawn and winning it very soon.",
        "4. d4": "4. d4 - supports e5 knight and opens up a diagonal for Fou Lenoir.",
        "4... Nc6 5. Nc3": "5. Nc3 - development.",
        "5... Nxe5 6. dxe5 Qxe5": "6. ........ Qxe5 - after a knight trade on e5 black has now restored material equality.",
        "7. f4 Qe6 8. Qd4": "8. Qd4 - Glenda decides to come out to play, ah, she still has to defend something though, the pawn on e4!",
        "8... d6 9. Be2 Be7 10. O-O O-O": "10. ....... 0-0 - some normal development here.",
        "11. Bf3": "11. Bf3 - Fou Leblanc decides to lend more support to my e4 pawn.",
        "11... c6 12. Qe3 Ng4 13. Bxg4 Qxg4": "13. ........ Qxg4 - after Glenda decides to go back indoors there follows a B for N trade.  Glenda moves to f3 to try to drive back the Wicked Witch of the West.  The Witch flies back to d7. ",
        "14. Qf3 Qd7 15. Bd2": "15. Bd2 - Fou Lenoir finally emerges and the rooks are connected.",
        "15... Qc7 16. Kh1": "16. Kh1 - Henry moves into the corner because he does not want to see the Witch on b3!  He likes her not!",
        "16... Be6 17. b3 Rad8 18. Ne2 d5 19. exd5 Bxd5": "19. ........ Bxd5 - after a little bit of piece moving there is a pawn trade.",
        "20. Qe3 Rfe8 21. Bc3": "21. Bc3 - Fou Lenoir controls the long diagonal, I consider moving Glenda to g3 next move.",
        "21... Bf6 22. Qf2": "22. Qf2 - Glenda had to sidestep a discovery but now a combo from my opponent leads to the 2 piece for rook imbalance - hence the title of this annotation.",
        "22... Rxe2 23. Qxe2 Bxc3 24. Rad1": "24. Rad1 - my queen rook centralises but that bishop pair do look ominous.",
        "24... Bf6 25. Rd3 b5 26. Qd2 a6 27. c3": "27. c3 - trying to shut off part of the enemy dsb's long diagonal.",
        "27... a5 28. Rd1 Re8 29. Re3 Rxe3 30. Qxe3": "30. Qxe3 - rook trade, but those 2 enemy bishops still look ominous.",
        "30... Qb8 31. Re1 h6 32. Qe8+ Qxe8 33. Rxe8+": "33. Rxe8+ - queen trade.",
        "33... Kh7 34. Re3": "34. Re3 - must defend the c3 pawn.",
        "34... Kg6 35. Kg1 b4 36. Rg3+": "36. Rg3+ - spite check.",
        "36... Kf5 37. cxb4 axb4": "37. ....... axb4 - pawn trade.",
        "38. Rd3 Kxf4 39. g3+": "39. g3+ - after I lose a pawn, another spite check.",
        "39... Ke4 40. Rd1 Bd4+ 41. Kf1 Ke5": "41. ....... Ke5 - white is very tied up now.",
        "42. Rc1 f5 43. Re1+ Be4 44. Ke2": "44. Ke2 - I am very close to being in a zugzwang.",
        "44... g5 45. Rc1 c5 46. Kd2 Bc3+": "46. ...... Bc3+ - tightens the screw.",
        "47. Ke3 f4+ 48. gxf4+ gxf4+": "48. ........ gxf4+ pawn trade.",
        "49. Ke2 f3+ 50. Kd1 f2": "50. ...... f2 - black is very close to getting a queen.  Henry moves to e2 to stop it.",
        "51. Ke2 Bd4 52. Kf1": "52. Kf1 - the only move to avoid immediate loss but Bd3+ forces Henry to g2 and the pawn will crown forcing me to give up my rook.  I therefore resign on the grounds of ruinous loss of material.  Hope you've enjoyed this, part 2 will be coming up very shortly.",
        "52... Bd3+": ""
    },
    "url": "https://gameknot.com/annotation.pl/material-imbalances-2-pieces-are-better-than-1-rook-pt-1?gm=24660",
    "gameName": "Material Imbalances - 2 pieces are better than 1 rook Pt.1",
    "players": "jstevens1 (1513) vs. safoocat (1688)",
    "opening": "Petrov (C42), French attack"
}