{
    "moves": {
        "1. e4 d5 2. exd5 Qxd5 3. Nc3 Qe5+ 4. Qe2 Qxe2+": "It has to be proven that the queen's exchange is the best for black. ",
        "5. Bxe2 c6": "This is necessary, since the white knight can jump and threathen Nc2+.",
        "6. Bc4": "A loss of time, while white could have kept the development with Nf3 or d4. ",
        "6... Bf5 7. d3 Nd7 8. Nf3 O-O-O": "My king in this side is going to be attacked, but normally black survives. ",
        "9. O-O f6": "Preparing e5, g5 etc. ",
        "10. Nd4 Bg6": "Fatal mistake, that gives up a most important square. ",
        "11. Ne6 Re8 12. Bf4": "Now black is REALLY cramped. ",
        "12... Ne5": "Not a wise choice (better was Nb3, maybe). I thought that it was better to sac a pawn, but I was very wrong. ",
        "13. Bxe5 fxe5 14. Rfe1": "I cannot defend the pawn. Let's see if I can untangle myself. ",
        "14... b5 15. Bb3 b4 16. Na4": "Now white has a huge penetration on my undefended king. ",
        "16... Nf6 17. Rxe5 Bf7": "Now I can move Nd5. ",
        "18. Rae1 Ng4": "POintless, I just tried to open a little my pieces. ",
        "19. Ra5 Kb8": "Now I couldn't see a mate for white, even if the position calls for that. ",
        "20. Nac5 Nf6": "Covering d7. ",
        "21. Bc4 g6 22. h3 Bh6": "NxB is not possible anymore, but...",
        "23. g4": "threatening g5, and Bd2 is too dangerous (Rd1). ",
        "23... g5": "Sigh...",
        "24. f4": "Still threatening. gxf, g5! and I lose a piece. ",
        "24... Rhg8 25. fxg5 Bxg5 26. Nxg5": "I realized that I had to exchange the bishop first, but I didn't realize that...",
        "26... Bxc4": "...I cannot take the knight because of Na3+, winning the exchange (RxR, KxN). ",
        "27. dxc4 h5": "well, let's try to grab the only advantage I have",
        "28. Re5 hxg4 29. Kh2 Rgh8": "Now I threaten gxh and Ng5+ forking the rook.",
        "30. Na6+ Kb7 31. Ne6": "White apparently doesn't see it... or has he a mate? ",
        "31... gxh3 32. Nec5+ Kb6": "It's incredible. With all those white pieces around my king, and no mate is coming. ",
        "33. Ra4 Ng4+": "Now the tables are turned. ",
        "34. Kg3 Nxe5 35. Rxb4+ Ka5 36. Ra4+ Kb6 37. Ne6 Reg8+": "White, despite his pieces, cannot find a way to materialize his position, and his pieces are not useful. ",
        "38. Kf2 h2 39. c5+ Kb5": "Or Kb7, but I was tempting the fate again. ",
        "40. Ra3": "I think white could have played here b3, winning. ",
        "40... h1=N+": "I didn't want surprises, so I promoted with check. Maybe a mistake, but I was far too lucky to risk again. ",
        "41. Kf1 Ng3+ 42. Kf2 Rh2+ 43. Ke3 Nc4+": "And my opponent felt he had no chances anymore. Well played in the opening for white, for sure!"
    },
    "url": "https://gameknot.com/annotation.pl/mate-me-mate-me?gm=47745",
    "gameName": "Mate me, mate me!!!",
    "players": "sam4u2004w  vs. damalfi ",
    "opening": "Scandinavian defence, Lasker variation (B01)"
}