{
    "moves": {
        "1. e4": "Hi everyone!\r\n\r\nHere is Part 2.  I am taking part in a mini-tournament called Memoralis.  I find myself under the cosh in the middlegame but somehow my opponent does not make the best moves and I end up bailing out into a 2 knight v R + 2 pawn ending.  Looks favourable to the side with the rook and 2 pawns, but somehow my horsies won the day.  As a rare experiment (very rare in a rated game) I try the Caro-Kann Defense.  That is 1. e4 c6.",
        "1... c6 2. d4 d5 3. Nc3 dxe4 4. Nxe4": "4. Nxe4 - pawn trade.",
        "4... Bf5 5. Ng3 Bg6 6. h4": "6. h4 - this pawn is going to attack Fou Leblanc so I create some air for him with h6.",
        "6... h6 7. Nf3 Nd7 8. h5 Bh7 9. c4 e6": "9. ...... e6- I now open up Fou Lenoir's diagonal, white has an imposing pawn centre already.",
        "10. Be2 Bb4+ 11. Bd2 Bxd2+ 12. Qxd2": "12. Qxd2 - bishop trade.  I now develop my king knight to e7 and prepare for castling.",
        "12... Ne7 13. Bd3 Bxd3 14. Qxd3": "14. Qxd3 - bishop trade.",
        "14... b6 15. Qc3 f6": "15. .... f6 - to try and wall out those white horsies.",
        "16. O-O O-O 17. Rad1 Qc8": "17. ....... Qc8 - Glenda moves off the WR's line.",
        "18. Rfe1 Nb8 19. Qd3 Re8 20. Qe4 Kf7": "20. ...... Kf7 - Henry and Glenda both defend the vulnerable e6 pawn.",
        "21. Qf4 Kf8 22. Ne4 Rd8": "22. ...... Rd8 - challenging the d file.  Looking at white's position you wonder, how in the heck did he lose?!",
        "23. g4 Na6": "23. ........ Na6 - my knight develops at last, on MOVE 23!",
        "24. g5": "24. g5 - a pawn break.  My shelter around Henry is proving to be very flimsy indeed.  I have a nasty feeling that Old Matey is looking upon it with interest.  Just look, for a starters the Wicked Witch of the West is on the same file as Henry, DANGER!",
        "24... hxg5 25. Nfxg5": "25. Nfxg5 - pawn trade.  I respond with Nf5 screening off the f column.",
        "25... Nf5 26. Nh7+ Kg8 27. Nhxf6+": "27. Nhxf6+ - a knight sacrifice.  I accept it.  Next move Henry will be positively shivering.",
        "27... gxf6 28. Qg4+ Kh8 29. Nxf6": "29. Nxf6 - my f pawn now drops.  In order to come out of Old Matey's shadow there is only one thing for it.  To give up my rook for the knight on f6, giving me two knights for a rook and 2 pawns.",
        "29... Rg8 30. Nxg8 Qxg8 31. Re4 Qxg4+ 32. Rxg4": "32. Rxg4 - queen trade.",
        "32... Rg8 33. Rxg8+ Kxg8": "33. ........ Kxg8 - rook trade.",
        "34. Kg2 Nc7": "34. ....... Nc7 - my isolani on e6 needs careful protection.  Just how come a few moves later I get a pawn right up close to Glendadom and Paul must give up his rook to stop this?  Well, here is how the action unfolds.",
        "35. Kh3 Kh7 36. b4": "36. b4 - pawn roll.",
        "36... Kh6 37. Kg4": "37. Kg4 - defending his h passer.",
        "37... a6 38. a4 Ng7 39. Rb1 Nf5": "39........ Nf5 - attacking the d4 pawn.  Now comes a series of pawn trades, that impressive white pawn wall will not look so impressive a few moves down the line!",
        "40. d5 cxd5 41. c5 bxc5 42. bxc5": "42. bxc5 - not much left of it now!",
        "42... d4 43. Rb7 Nd5 44. c6 d3": "44........ d3 - pawn race.",
        "45. Rb1 Nd4 46. c7 Nxc7": "46. ...... Nxc7 - now Paul's c7 passer disappears!",
        "47. Rd1 Nc6": "47. ....... Nc6! - indirectly protects my pawn on d6 for if Rxd6?? then Ne5+ winning the WR.",
        "48. f4 Nb4 49. Rc1 Ncd5": "49........ Ncd5 - 2 knights protect each other.",
        "50. Re1 d2": "50. ....... d2 - will my passer reach Glendadom?  Read on.",
        "51. Rd1 Ne3+": "51.  ....... Ne3+ - now the white rook is toast, Nxd1 next move, suddenly it looks as though I am about to receive a white flag!",
        "52. Kf3 Nxd1 53. Ke2 Nc3+ 54. Kxd2 Nxa4": "54. ........ Nxa4 - my d pawn goes but I create a new passer.  White plays one more move and I move the a4 knight to c5 clearing a path for the black pawn.  After this white does wave the white flag!  Phew, I feel soooo relieved!  Part 3 coming up soon.",
        "55. Ke3 Nc5": ""
    },
    "url": "https://gameknot.com/annotation.pl/material-imbalances-2-pieces-are-better-than-1-rook-pt-2?gm=24661",
    "gameName": "Material Imbalances - 2 pieces are better than 1 rook - Pt.2",
    "players": "epimedes (1552) vs. jstevens1 (1686)",
    "opening": "Caro-Kann (B19), classical, Spassky variation"
}