{
    "moves": {
        "1. e4": "This game illustrates two well known general principles : how bad it is to sacrifice too much development for material, and an attack against a king that cannot castle.\n",
        "1... e5": "This game was played at intermediate/low level, so even if I tried to make this analysis solid and entertaining, an higher level player would certainly have stuff to correct in my notes. \nAnyhow, your comments are all welcomed. Happy reading !\nDim31.",
        "2. Nf3 Nc6 3. Bc4 Nf6 4. Ng5": "Two knights defense",
        "4... d5 5. exd5 Nxd5": "Not recommended. Best for black is to pseudo-gambit the d pawn with 5...Na5 , which usually continues with 6. Bb5  c6 7.dxc6 bxc6 8.Be2 h6 9.Nf3 e4 10.Ne5 with compensations.",
        "6. Qf3": "6.d4 was actually much stronger. Trying as I did to immediately exploit the f7 weakness exposes to some counterplay as in the game.",
        "6... Qxg5 7. Bxd5 Nd4": "A strong answer. With black queen eyeing to g2 and the Night at c2 for fork and e2 for King attack, white is in trouble.\nIs it reasonnable to go for f7 ?",
        "8. Qxf7+": "After having analyzed the game, I think it was.\nHowever as I played the move, it was a speculative play.",
        "8... Kd8 9. h4 Qg4": "Here's some tactics ; black queen's best retreat is f5 as it holds the c2 square.\nEven after an exchange black bishop will still be holding c2.\nEventually black will end up gaining quality and black knight can escape from a1 in late game due to \"a\" and \"b\" pawns advance.",
        "10. Bf3 Nxc2+ 11. Kd1 Qa4 12. b3 Qd4 13. Kxc2 Qxa1": "Black is a quality up, but at which cost ? \nQueen is cornered, King locked in the center and all white pieces will gain activity rapidly using threats to Queen.",
        "14. Bb2": "Fritz says that the best finish should be : 14.Cc3 Fb4 15.Td1 Tf8 16.Dd5  Fd6 17.Fa3 Ff5  18.d3  -\n\n(actually this is French comments : C = Knight, T = Rook , D = Queen , F = Bishop and R = King)",
        "14... Qxa2 15. Nc3 Qa5 16. Nd5 Qc5+": "At this point black should have been more concerned with pieces development & king safety. Letting the queen on the \"c\" column exposes to a later Rook move in c1 pressing on c7.",
        "17. Kb1 Bd7 18. Rc1": "There it is.",
        "18... Qxc1+": "At this point black's move was certainly played due to increasing pressure, and will obviously let the material balance in white's favor. But black could have figured out a defense the following way : 18...Qd6 19.Qh5 c6 20.Qg5  Kc8 21.Bxe5 h6 22.Qf4 which remains unclear but certainly not lost.",
        "19. Kxc1 Bd6": "Not an efficient defense, since the bishop shall already guard e7.",
        "20. Bxe5": "and now black cannot take back otherwise Qe7  then Qxe5.",
        "20... Rf8 21. Qxg7": "Black position is uncomfortable ; white threatens Bxd6 which gains the rook, and the bishop cannot be taken.",
        "21... Re8": "Black could not play 21.Bxd5 otherwise 21...Qd7 \nBut the present move does not fit neither : white to play and win.",
        "22. Bxd6 cxd6 23. Nf6": "threatens to gain some more material and the mate in d7.",
        "23... Re7": "tries to save the rook, but...",
        "24. Qf8+": "Black resign. \nOnly two bad options remain : \n- There's a quick mate afer 25...Re8 26.Nxe8 Bxe8 27.Qxd6  Kc8 [27...Bc7 28.Bg4 then Qxd7#] 29.Bg4  Bd7 30.Bxd7#\n- Trying to pary the mate loses one more rook after 25...Rd8 26.Qxd6 Re7 27.Nxd7 Rxd7 (otherwise quick mate) 28.Qf8  then Qxa8."
    },
    "url": "https://gameknot.com/annotation.pl/material-gain-vs-late-development-and-king-in-the-center?gm=20886",
    "gameName": "Material gain vs. late development and king in the center.",
    "players": "Dim31 (1676) vs. Zendara (1377)",
    "opening": "two knights defence (C57), Lolli attack"
}