{
    "moves": {
        "1. c4 e5 2. Nc3 Nf6 3. Nf3 d5": "i give this move a question mark. Usually black develops the knight Nb8-c6 or d7-d6. I don't think pushing the pawn one square further is good for black, this does not look like a gambit but more like a blunder. Probably black though he could play a reversed sicilian like 1.e4, c5; 2.Nf3,Nc6; 3.d4. See if you can spot the one small difference.",
        "4. cxd5 Nxd5": "this seems the only move. Attempts by black to defend the pawn on e5 are not on the list here.",
        "5. Nxe5": "let's destroy black center! I don't know what black has in mind, but even if he manages to make me waste some tempi with the knight i don't see how he can take the lead.",
        "5... Nxc3": "this exchange could be reasonable if it weren't for the fact that black is down in material and is exchanging his only developed piece",
        "6. bxc3": "even if dxc3 probably leaves me a better structure i didn't like the idea of exchanging queens so early. My plan here was to continue with simple development and build up a big center with d2-d4 and e2-e4, and, after that, see how black will fight to destroy it. I though this could be an interesting battle, afterall...",
        "6... Bf5": "this is really a blunder and deserves a double question mark. Although it looks like a normal harmless developing move this is indeed the loosing move. With this bishop move black leaves b7 undefended. Noticing the knight on e5 it didn't take long for me to see the next move...",
        "7. Qb3": "clearly the strongest, and it must be played now or black will have the chance to defend.\nBlack can't defend the double threat of mate in f7 and Qxb7-Qxa8, so the game is an easy win now.",
        "7... b6": "This simply overlooks the threat of Qxf7#. I think the best defence for black was 7...Be6, when it's true i take another pawn but at least he doesn't get mated!!\n7...Qe7?; makes no sense, after 8.Qxb7, Qxe5; 9.Qxa8 black's best reply is something like c6 (c5 just limit the scope of his dark squared bishop). ",
        "8. Qxf7#": "I hope black has learned something from this game. I didn't\n\n"
    },
    "url": "https://gameknot.com/annotation.pl/mate-in-8?gm=18626",
    "gameName": "Mate in 8!",
    "players": "javanese (1200) vs. fingoc (1440)",
    "opening": "English (A22), Bellon gambit"
}