{
    "moves": {
        "1. e4 Nf6": "alekhine.",
        "2. e5 Nd5 3. c4 Nb6 4. d4 d6 5. Bd3": "unusual, only one game on the database, and that was a draw.",
        "5... dxe5 6. dxe5 Nc6 7. Nf3": "and now into new territory as far as the database is concerned, and i've not been here before. white's only weakness appears to be his knight, vulnerable to a pin. it seems his bishop may have to move back to defend, wasting a go and passing the initiative over to me. we shall see.",
        "7... Bg4 8. Bf4": "indeed, develops a piece and protects the stranded pawn.",
        "8... Nd4 9. Nbd2 e6 10. O-O Bb4 11. Be2": "indeed, 5. Bd3 was a mistake after all. ",
        "11... Bxd2 12. Qxd2 Nxf3+ 13. gxf3": "and this is the consequence of his subtle opening error. either this, or lose the pawn on c4. the latter is probably better, though it's really too complex a position at this stage for me to work out. i'd imagine that allowing me to take the pawn would encourage me to castle kingside so i can maximise my pawn advantage, and minimise the open file threat for both.",
        "13... Qxd2 14. Bxd2 Bh3 15. Rfd1 O-O-O": "with his kingside destroyed, it seemed logical for me to exploit it, and castling queenside sends the message that i am looking at the kingside pawn push.",
        "16. b3": "seems a little passive. R(a)c1 would give extra support and develop his rook onto my king's file in the process, or even R(d)c1, loading up the rooks on my queenside. but this wastes another move, as he'll be looking to push these pawns for sure. and besides, he doesn't really need to back his pawn up, it's in no immediate danger.",
        "16... g5 17. c5": "?\ni think this is a poor move, because he unleashes the knight, who was rather sedate with the pawn blocking his flight.",
        "17... Nd5 18. b4": "if he'd have just played 16. b4 instead of b3, then he would have his go from this position, effectively giving himself a free move. white is losing too many tempi.",
        "18... Rhg8 19. b5 f6 20. a4": "now white is in a hurry to push the pawns, even allowing me to take the lead.",
        "20... fxe5 21. a5 Nf4": "and now black is looking very strong. i'm very surprised white has allowed me to block his f-pawns without resistance. i'd have played f4 long ago.",
        "22. Bc4": "good, stops g4 for the time being.",
        "22... Rg6": "not any more!",
        "23. b6 a6 24. Bc3": "?\na subtle mistake, but one that loses. i believe Be3 was the only move to save, as the bishop was vulnerable to capture from the rook. the reason the bishop is so important to white is he must take the knight with it at some stage, though not yet, or he loses material. now he cannot capture the knight, and as such is in deep trouble. i cannot be 100% sure, but i think black now has mate in 12, assuming best play from both. if anyone feels like analysing, feel free to post your findings. i spent hours analysing this part of the game, and i reckon mate in 12. i get there quicker, though.",
        "24... g4": "!\n",
        "25. Rxd8+": "an attempt to trap me into a mistake...",
        "25... Kxd8": "forced.",
        "26. bxc7+": "an aggressive pawn...",
        "26... Ke7": "!\ntaking the pawn drops the knight after Bxe5 , blocking allows Bxe6 , forcing my rook or knight to take and allowing him to escape mate, and Ke8 is out of the question as he can queen with check, thus winning.",
        "27. c8=N+": "!\nit's worthy of note, this one, as it shows white is aware of the danger he is in, and he is attempting to get out of trouble with intelligent play. he can avoid mate if i move toward the knight by sacrificing a bishop, thus giving him time to regroup.\nin case you hadn't noticed, 27. c8=Q? is suicide, mate in three with 27... gxf3  28. Kh1 Bg2  29. Kg1 Nh3#",
        "27... Kf8": "!\nthe only square where he cannot check me again, thus allowing me to resume my attack with immediate effect.",
        "28. Bf1": "best, delays mate.",
        "28... gxf3+": "finally the trap is sprung.",
        "29. Kh1": "and this hurries along mate, surprising after his earlier intelligent play, but then maybe he had lost hope by now. alternatively, he could block...\n29. Bg2 Rxg2 \nand now two options...\n30. Kh1 Rg6\n31. Rg1 (only delay move) Bg2 \n32. Rxg2 fxg2 \n33. Kg1 Nh3#\nor...\n30. Kf1 (looks for escape) Rg1 !! (no escape for you, my friend!)\n31. Kxg1 Ne2 \n32. Kh1 Bg2#",
        "29... Bg2+": "and white resigns...\n30. Kg1 Nh3#\nor\n30. Bxg2 fxg2 \n31. Kg1 Nh3#\n....................................\nso, anyone fancy analysing, see how long a forced mate that was? like i said earlier, i think it's a string of 12 moves maximum, but it's so complex, there's so many moves white can make during this string that it's beyond the puzzle maker here at gameknot, certainly from move 24. have fun!"
    },
    "url": "https://gameknot.com/annotation.pl/mate-in-12?gm=16417",
    "gameName": "mate in 12?",
    "players": "mika76 (1562) vs. tugger (1437)",
    "opening": "Alekhine's defence (B02), Steiner variation"
}