{
    "moves": {
        "1. f4": "This was an interesting game that had me extremely pressured and on the defence despite being a whole piece ahead. White begins the game with the Bird's Opening",
        "1... d5 2. Nf3 c5 3. e3 Nc6": "nothing special so far...Black has slightly better control of the centre, while White could have an opportunity for a future kingside attack - nothing decisive so far",
        "4. Bb5": "pinning the knight...",
        "4... Bd7": "but that is easily averted. I now look at queenside castling",
        "5. c3": "?! I'm not sure what the point of this move is, especially since it blocks the c3 square for White's knight. 5.d4 or 5.Nc3 would have been better alternatives",
        "5... Qb6": "attempting to force the bishop away....",
        "6. Na3": "but White would like the bishop to stay. The defending knight, however, isn't going to be as safe as it would like to be....",
        "6... e6": "the start of a pawn chain, and a chance to get up a piece. Will White see it?",
        "7. Ne5": "nope - White instead advances his other knight. Better would have been to retreat the bishop to stop Black's next move...",
        "7... c4": "! the threat here is 8...Bxa3 9.bxa3 Qxb5, with the added bonus of doubled pawns on the a file. White sees this and tries to stop the threat....",
        "8. b4": "and it should have been enough to stop Black getting a material advantage...",
        "8... Nxe5 9. fxe5": "? were it not for this move. White should have played Bxd7 first, and now Black wins a piece...",
        "9... Bxb5 10. Nxb5 Qxb5": "like this. Now it should just be a simple matter of trading down material to have an endgame advantage for Black",
        "11. a4": "chasing my queen away....",
        "11... Qd7": "and the queen makes sure that White doesn't get any more attacks on her",
        "12. a5": "White's a and b pawns could turn out to be pretty dangerous....",
        "12... O-O-O": "so maybe castling wasn't the best option here. Better would have been 12...a6",
        "13. d4": "now White chooses to shut off the queenside. I'm not worried - all my pieces are on the kingside.",
        "13... f5": "hoping to provoke an en passant capture, to allow my pieces some breathing room (e.g 14.exf5 e.p Nxf6 with Bd6 next move)",
        "14. O-O": "White will have none of it!",
        "14... g5": "Well, since my pieces aren't (yet) able to get onto good squares, I go for a kingside pawn storm",
        "15. a6": "capturing that a-pawn would not be a good idea for Black - White's rook on a6 could cause quite a few problems for White...",
        "15... b6": "so I simply close the position",
        "16. Ba3": "I guess this must have been more of a waiting move than anything - looking at the board here, I can see no opportunities for White to launch an attack. (It gets White one step closer to connected rooks, but I prefer Bb2)",
        "16... h5": "My pawns line up for that kingside attack!",
        "17. e4": "White gives up a pawn... I can't really see why...",
        "17... dxe4": "sure, why not? it's now Black's four pawns against White's two pawns",
        "18. Qd2": "hoping to break up my pawn attack...",
        "18... Bh6": "and I naturally defend, with the threat of a discovered attack on the queen",
        "19. Bc1": "hmmm....",
        "19... g4": "now a trade is forced, though it was probably no great loss for White - his dark-square bishop has been completely useless the whole game",
        "20. Qe1 Bxc1 21. Rxc1 Ne7": "eyeing the d5 square",
        "22. Rd1": "right now, White can't do anything - Black has total control of this game",
        "22... Nd5 23. g3": "looking at blunting my pawn attack",
        "23... Rdf8": "looking at a combination to force more exchanges (actually, for quite awhile now, I had been looking at Qa4, but that probably would not have worked given that it would have been Black's queen against White's queen and rooks)",
        "24. Rf2 f4": "? here's where things begin to go wrong for Black...",
        "25. Qxe4": "and here's where White finally breaks out of his passive state and into some form of attack. Actually, Black was still winning here, and would have been far better off playing fxg3 here, forcing off more material from the board (and regaining the lost pawn, if White is careless; 25...fxg3 26.Rxf8? gxh2 27.Kxh2 Rxf8)",
        "25... Nxc3": "? the fork looks tempting, but White has a killer move up his sleeve...",
        "26. Qa8+": "! Now White will get a passed pawn - two moves before promotion!",
        "26... Kc7": "only way to stop White grabbing the other pawn as well",
        "27. Qxa7+ Kc6": "and now a queen exchange is forced",
        "28. Qxd7+ Kxd7 29. Rc1": "threatening my knight...",
        "29... fxg3 30. hxg3 Rxf2 31. Kxf2": "I follow through with the exchanging, as I intended to do, but maybe I should have kept the second rook to take care of the passed pawn",
        "31... Ne4+": "I retreat my knight to safety..",
        "32. Ke3": "good move. The king doesn't give me a chance to defend the c-pawn...",
        "32... Nxg3": "though I do get a pair of passed pawns from it",
        "33. Rxc4 Ra8": "I would have loved to have traded rooks here to relieve the pressure, but that would have quickly lost to 34.a7!",
        "34. b5 Nf5+": "bringing my knight back for the defence",
        "35. Kf4 Ra7": "I have no idea why I did this - I guess like White had been earlier in the game, I'd been forced into passivity",
        "36. d5": "I don't want to have to deal with another passed pawn (plus' I can't recapture because of Kxf5...but maybe that would have peen a good thing. The king would not be able to stop my pawn's run towards promotion, forcing the rook to retreat and easing up the pressure for Black)",
        "36... Ng7": "Forced...",
        "37. d6": "and now there's a strange form of similarity in this position",
        "37... Ne8 38. Rc6": "here comes the pain...White goes on the attack, and is planning to overwhelm me with his pawns",
        "38... Kd8 39. Rxb6 Nxd6": "This was one last desperate attempt at some form of counterplay (it may have been more useful back at move 38) If White responds with exd6, I can play e5+, with some chance of getting one of my pawns promoted. However, if White was to respond with...",
        "40. Rxd6+": "this move, it spells the end for White.",
        "40... Ke7 41. Rb6": "There's nothing wrong with this move, but if White were to play 41.b6!, then there would be no stopping the pawns reaching promotion. If that had happened, I would have resigned",
        "41... Ra8 42. Rb7+ Kd8 43. Rh7": "and now my two passed pawns - my last hope - will fall, and it's here where I resign. Good game :)"
    },
    "url": "https://gameknot.com/annotation.pl/material-verses-positioning?gm=27577",
    "gameName": "Material verses positioning",
    "players": "martindarcy (1398) vs. x-machine (1226)",
    "opening": "Bird's opening (A03), Lasker variation"
}