{
    "moves": {
        "1. e4": "Uma partida interessante, que ilustra uma variante arriscada da Defesa dos Dois cavalos...",
        "1... e5 2. Nf3 Nc6 3. Bc4 Nf6": "Defesa dos Dois Cavalos",
        "4. Ng5": "Variante clássica...",
        "4... d5 5. exd5 Na5 6. Bb5+ c6 7. dxc6 bxc6 8. Qf3": "Esta é a variante... Neste momento, as negras podem optar por sacrificar a torre, em troca de maior desenvolvimento e um eventual ataque. A variante clássica padrão preve o recuo do bispo branco para e2, ao invés do lance de Dama das brancas...",
        "8... cxb5 9. Qxa8 Nb7": "Eis o segredo da variante, o bloqueio da Dama Branca...",
        "10. Qxa7 Bc5": "Ganha um tempo...",
        "11. Qa6 O-O": "Coloca o rei em segurança e a torre negra em jogo...",
        "12. O-O Nd6": "Ataca a Dama, que fica praticamente sem casas... 13. Qa8 é arriscado, e meu adversário opta por 13. Qc6 ... ",
        "13. Qc6 Nd7": "Defende o bispo negro ao mesmo tempo que ataca o cavalo branco! Além disso, prepara uma armadilha para a Dama Branca com Bb2!",
        "14. d3 Bb7": "A Dama branca está perdida...",
        "15. Qxb7 Nxb7 16. c3 h6 17. Nf3 Nd6 18. Re1 Re8 19. Nbd2 b4": "Busca se livrar do peão isolado...",
        "20. h3 bxc3 21. bxc3 Qb6": "Ataca f2...",
        "22. Re2": "Defende...",
        "22... f6": "Defende o peão em e5, liberando a torre negra para o jogo...",
        "23. Nb3 Qa6": "Ataca d3...",
        "24. Ne1": "Defende d3...",
        "24... Nf5": "Centraliza o cavalo negro...",
        "25. Rb1 Ba7": "Protege o bispo, que continuará atuando na agressiva diagonal a7-f2, ao mesmo tempo permite que a torre negra possa ser jogada com tranquilidade em b8...",
        "26. Reb2 Rc8": "Opta por atacar outro ponto fraco: c3 ...",
        "27. Bd2": "Defende c3...",
        "27... Nc5": "Ataca novamente d3...",
        "28. Nc1": "Defende d3...",
        "28... Rc7": "Defende o ponto b7 novamente... evitando o risco de um ataque das torres brancas dobradas...",
        "29. c4": "Erro que custa a partida, pois permite a entrada dos cavalos negros e do bispo negro em d4...",
        "29... Qc6": "Coloca a Dama em uma diagonal mais agressiva, já que a mesma foi bloqueada no lance anterior por c4...",
        "30. Nf3": "Defende d4...",
        "30... Ne6": "Ataca d4...",
        "31. Ne2": "Defende d4...",
        "31... Ned4": "Toma d4, na força bruta, o que leva a uma vantajosa troca de peças para as negras, que tem vantagem de Dama para o final do jogo...",
        "32. Nfxd4 Nxd4 33. Nxd4 Bxd4 34. Rb2b3 Ra7": "Ataca a2...",
        "35. a3": "Defende...",
        "35... e4": "Procura destruir o que sobrou dos peões brancos, isolando-os...",
        "36. dxe4 Qxe4 37. Re1": "As torres brancas ficam isoladas uma da outra...",
        "37... Qc2": "Ataca torre e bispo ao mesmo tempo...",
        "38. Rb8+ Kh7": "Salvou a torre, mas o bispo...",
        "39. Bb4": "O erro definitivo...",
        "39... Qxf2+": "As brancas abandonam, pois poderia seguir 40. Kh1 Rxa3, que colocaria as brancas em grande dificuldade...."
    },
    "url": "https://gameknot.com/annotation.pl/mathematics-nerds-vi?gm=6102",
    "gameName": "Mathematics Nerd's VI",
    "players": "tekoahbaer (1654) vs. pj0s3 (1645)",
    "opening": "two knights defence (C58), Blackburne variation"
}