{
    "moves": {
        "1. e4 Nf6": "I have never played against the Alekhine Defence before, so I'm not very experienced at it.",
        "2. e5": "I kick the knight.",
        "2... Nd5 3. d4": "I'm trying to control the centre and gain tempo by kicking the knight.",
        "3... e6 4. Bc4 d6": "Attempting to undermine my centre control.",
        "5. Nf3": "Developing and attacking the centre, while allowing me to castle.",
        "5... Nc6": "Contesting the control of the knight on f3.",
        "6. O-O": "I castle and hide my king away.",
        "6... Be7": "Preparing to castle. Black is not in a very enviable position (at least for me), because his pieces are in a closed position.",
        "7. Bxd5": "Probably a bad idea, because it allows exd5, which opens up the diagonal for the LSB.",
        "7... exd5 8. Nc3": "Developing and applying pressure to the d5-pawn.",
        "8... dxe5": "Trading and opening up the position.",
        "9. dxe5 Be6": "Defending the d-pawn and developing his final minor piece.",
        "10. Be3": "I also develop my final piece.",
        "10... O-O": "Now that there are no more immediate threats, black castles.",
        "11. Qd2": "Connecting my rooks.",
        "11... Bb4": "Pinning the knight.",
        "12. a3": "I want the bishop out of my territory.",
        "12... Bxc3 13. bxc3": "I made a visual error here, thinking that the f6-knight wasn't there, so I played this instead of Qxc6, because I thought that d4 was a serious fork.",
        "13... Na5": "Preparing for Nc4, which allows black to exchange his knight for my bishop with tempo.",
        "14. Bg5": "Threatening the queen.",
        "14... Qd7 15. Rab1": "Exploiting the open file.",
        "15... Nc4": "Black won't gain a free pawn (a6) because of Rxb7.",
        "16. Qd3": "Attacking the knight while keeping h7 in sight.",
        "16... Nxa3": "The anticipated capture.",
        "17. Rxb7 Bf5": "Skewering the queen to the c2-pawn.",
        "18. Qa6": "Threatening to gain a pawn.",
        "18... Nc4": "? This gives away the chance to break even in pawns. Better would be Nxc2.",
        "19. Rxa7 Rxa7 20. Qxa7": "I am now ahead by a pawn.",
        "20... f6": "Threatening the bishop, though this seems a bit risky.",
        "21. exf6": "I trade pawns.",
        "21... gxf6 22. Bh6": "I threaten the rook, while getting in a good position to limit the king's movements.",
        "22... Rf7": "Blocking off the flight square of f7.",
        "23. Qa8+": "I throw in a check with a mating threat. Only one move allows black to escape...",
        "23... Qc8": "And black finds it. At least I can gain a pawn.",
        "24. Qxd5 Nd6": "Black moves his knight to a protected position.",
        "25. Bf4": "I attack the knight. For the next few moves, my queen does not get a single breath in as it is threatened by multiple pieces and a pawn.",
        "25... Be6 26. Qh5 Bg4 27. Qd5 Be6 28. Qd4 Nf5 29. Qd3 Rd7 30. Qb5 c6 31. Qb4 Rb7 32. Qa4 Bd5": "Finally my queen can rest.",
        "33. Rd1": "I apply pressure to the LSB.",
        "33... Bxf3 34. gxf3": "The exchange has given my king an open file, as well as one for black's rook.",
        "34... Rg7+": "I am forced to move.",
        "35. Kf1 Nh4": "Clearing the way for Qh3+.",
        "36. Qe4": "If the black queen moves wrongly, Qe8#.",
        "36... Qh3+": "I'm forced to move again.",
        "37. Ke2": "Escaping while helping to defend f3.",
        "37... Rf7": "Qe8+ is no longer mate, thanks to this move.",
        "38. Qxc6": "I grab a pawn in the meantime.",
        "38... Re7+ 39. Be3": "I decide to block the check this time, as I have no intention of being chased around the board.",
        "39... Re6": "Kicking the queen. I can now chase the king around.",
        "40. Qc8+": "Check, as well as pinning the rook to the queen.",
        "40... Kg7 41. Rd7+": "I bring my rook into play, hoping to get a forced mate.",
        "41... Kg6": "The only move. Re7 only postpones this move.",
        "42. Qg8+ Kf5 43. Qxh7+": "I grab a pawn with check.",
        "43... Ke5": "Mate in one.",
        "44. Qe4#": "Checkmate! I hope you enjoyed this annotation, and you're welcome to post constructive feedback. Good game f00fighter."
    },
    "url": "https://gameknot.com/annotation.pl/mathematics-nerds-mini-tournament-i?gm=59680",
    "gameName": "Mathematics Nerds mini-tournament I",
    "players": "reubencpiplupyay (1316) vs. f00fighter (1356)",
    "opening": "Alekhine's defence (B03)"
}