{
    "moves": {
        "1. e4 c5 2. Nf3 d6 3. Bb5+ Bd7 4. Bxd7+ Qxd7 5. O-O Nc6 6. c4": "Alternative variation: 6.c3 [ Es la continuación principal. La jugada ensayada en la partida tiene por objetivo llevar el planteo a una formación Maroczy, con los peones en las casillas blancas, ahora que el alfil del mismo color ha sido cambiado, las negras no tendrán protección en ellas. ] \n",
        "6... Ne5": "Ahora me sentí incómod ante la \"amenaza\" posicional 7..Dg4!? doblando los peones en f3, ya que la blancas no quieren tomar el caballo de \"e5\" por la presión que tendrían las negras por la columna \"d\". En ese instante me arrepentí de haber jugado esta variante.\nAlternative variation: \n",
        "7. Qe2 g6": "Alternative variation: 7...Qg4 [ Era perfectamente jugable, las blancas tienen algo de ventaja de espacio, las negras tendrán mejor rey y la casilla c5 si las blancas insisten en jugar con d4.] 8.Nc3 Nxf3+ 9.Qxf3 Qxf3 10.gxf3 \n",
        "8. b3": "Asumí que como Gabriel no la hizo antes, ahora tampoco jugaría Dg4. Veía que tendría ciertos problemas con los descubiertos, pero me interesaba más activar mis piezas en torno al posible ataque sobre el flanco de rey por medio de f4-f5. Por otro lado, en esta formación de peones, b3 en algún momento se realiza.\n",
        "8... Bg7 9. Nc3 e6 10. Bb2 Ne7 11. Na4": "Alternative variation: 11.Ng5 [De conocer las partidas de Morozevich la hubiese jugado. Era una continuación más directa, acorde al plan comentando antes, que involucra el sacrificio de calidad en una de sus variantes:] 11...N7c6 12.f4 Nd4 13.Qe3 Nc2 14.Qh3 Nc6 15.f5 \n",
        "11... b6 12. Ne1 O-O 13. f4 Ne5c6 14. Bxg7 Kxg7 15. Nc2": "Ahora las negras tienen la oportunidad  de jugar 15.., f5!? aprovechando la centralización de sus piezas. Sin embargo, Gabriel apunta hacia la ruptura en d5, la cual es perfectamente lógica, pero débil en la parte práctica, ya que me dará más \"cuerda\" en el flanco de rey.\n",
        "15... d5 16. exd5": "Apartándome del camino pre concebido. Ví que me quedaba con un cómodo juego contra un peón aislado luego de los cambios y el golpe en \"d4\". Pienso que era mejor ser consecuente y jugar 16 f5, por ejemplo:\nAlternative variation: 16.f5 gxf5 17.cxd5 exd5 18.exf5 Kh8 19.Qh5 \n",
        "16... exd5 17. d4 dxc4": "Debería ser mejor la captura en d4. La posición alcanzada claramente no es lo que buscan las blancas. \n",
        "18. dxc5 b5": "? Parece que omití 18.. Dd3 del manojo de variantes que estaba revisando antes de jugar el cambio en \"d5\". En río revuelto las blancas pescarán un peón, ahorrando la posibilidad de atacar con el prometido \"f5\".\n",
        "19. Nc3 Nd5 20. Nxb5 cxb3 21. axb3 Rab8 22. Nbd4 Rfe8 23. Qf2": "Â¡No pierdo la esperanza de jugar f5! sobre todo ahora que la torre dejó la columna \"f\". \n",
        "23... Re4 24. f5": "Â¡Ahí está! por fin, eso sí, estoy sacrificando una calidad al permitir Ce3 por parte de las negras, pero el ataque será tan fuerte que estará compensado. En este momento se justifica el cambio de alfiles de casillas negras para debilitar el flanco.\n",
        "24... Nxd4 25. Nxd4 Ne3 26. fxg6 hxg6 27. Qf6+ Kg8 28. Nc6 Rf8 29. Rf3": "Tira pinta por sí misma esta jugada, sin embargo 29.., Cd1 pone las cosas en su lugar. De todas maneras, pronto viene Ta7 y los peones del flanco de dama serán los verdugos de las negras. \n",
        "29... Rfe8": "Craso error entrando en los apuros de tiempo, Gabriel no ve más que el sacrificio de la dama alargando la agonía. \n",
        "30. Rh3 Qxh3 31. gxh3 Nd5 32. Qf3 Nf4 33. Nxa7 Ne2+ 34. Kh1 Nd4 35. Qd3 Nf5 36. c6 Re4e3 37. Qd1 Rc3 38. Rc1": "Y las negran rindieron. \n"
    },
    "url": "https://gameknot.com/annotation.pl/mayor-de-chile-2002-santiago-chile?gm=36145",
    "gameName": "Mayor de Chile 2002, Santiago, Chile",
    "players": "Mamani, Héctor  vs. Lenoir, Gabriel ",
    "opening": "Sicilian (B52), Canal-Sokolsky attack, Bronstein gambit"
}