{
    "moves": {
        "1. e4": "This is a solid starting move, freeing pieces to move. This also takes control of the center.",
        "1... Nf6": "This is the Alekhine Defense. This was developed by former world champion Alexander Alekhine, hence the name. This opening opposes the center and attacks the e-pawn. Most people play e5, followed by Nd5 and then the game is mostly based on the e5 square.",
        "2. Bc4": "This is the Krejcik variation of the Alekhine. It is recommended to play d6 here, but the computer played Nxe4.",
        "2... Nxe4": "Not a recommended move. I can now play Bxf7+ and force the king out of the way.",
        "3. Bxf7+ Kxf7 4. Qh5+ Ke6": "This is a terrible move. I get a tempo here, and might get a checkmate if everything goes well for me. Better was g6, Qd5+, d6. This gets a positional advantage for black.",
        "5. Qg4+ Kd5": "A terrible move. I see people play Qf5+, d3, and c4+. These are all winning moves. I played Qf5+.",
        "6. Qf5+ e5": "Now time to win the knight...",
        "7. c4+ Kxc4": "Absolutely terrible move. I can have fun hunting the king down now that he is far enough away to get back to safety.",
        "8. Qxe4+ Kb5 9. a4+": "I need to give the king minimal time to get back to safety. Either way, white should win. Other moves I was considering were Nc3+ and Qd5+. I chose a4 because if things do not turn out well, I always will have my rook open and I can push the a-pawn further. Either way, I can always snatch the e5 pawn and the king will take feel like it will never get back to safety without giving anything more.",
        "9... Ka6": "Kb6 maybe?",
        "10. Qc4+ Kb6 11. Qb5#": "And checkmated being blocked by his own pawns. In this game, you learned an opening trap and how to take advantage of major blunders by the opponent, often in a quick and easy win."
    },
    "url": "https://gameknot.com/annotation.pl/me-vs-shredder?gm=32102",
    "gameName": "Me vs. Shredder",
    "players": "Me (Unknown ELO) vs. Shredder playing like a (1328 ELO)",
    "opening": "Alekhine's defence (B02), Krejcik variation"
}