{
    "moves": {
        "1. e4": "This is a good game to start a discussion on the caro kann from black's point of view. The reason this is true is because black follows a simple positional game by placing all of his pieces on the standard squares. ",
        "1... c6 2. d4 d5 3. Nc3 dxe4 4. Nxe4 Nd7": "This is where most of my caro-kann games begin from. ",
        "5. Bc4 Ngf6 6. Ng5": "This was at the time it was first played by A. Karpov a revolutionary move. The whole point of the move was to punish black of a haste 6...h6. Because of Bxf7++",
        "6... e6 7. Qe2": "A typical move where white adds to the control of e4 and increases pressure on e6.",
        "7... Nb6": "This move was introduced by Kornchoi and breathed new life into a stale game for black. The idea of this move is to gain tempo by attacking the bishop and manoeuvring the knight to d5",
        "8. Bd3 h6": "Now that the bishop has been move off the g8-a2 diagonal it is safe to kick the knight out of g5.\nMy plan after kicking out the knight is to develop the rest of my pieces. After that I will turn my sights on to forcing through a c6-c5 thrust. ",
        "9. Ng5f3": "This is better than Ne4 because black equalizes with 9. ..Qxd4. with the d pawn gone black has a solid game.  ",
        "9... Bd6": "For black it is almost always safe to play this move and prevent white from playing Bf4",
        "10. Ne5": "In the caro-kann the knight on e5 a very frequent theme for white.  ",
        "10... Qc7": "Black avoids early piece exchanges in favor of completing his development. By the way the black queen almost always goes to c7. The reason for this is that it prepares for the critical c6-c5 thrust. \n\nI don't want to get to deep into caro kann strategies but the c6-c5 thrust is critical to blacks chances of winning. ",
        "11. Ngf3 Bd7": "following my plan to develop all my pieces. ",
        "12. Bd2 c5": "with most of my pieces in play the time is right for this move.",
        "13. Nxd7": "?? a big blunder that gives black a strong initiative. What do you think White should have played and why?",
        "13... Nbxd7": "as you can see the exchange of the knight for bishop has really improved my position. What is important to notice is that I hold initiative in the centre. ",
        "14. dxc5 Qxc5": "This is more active than both ...Bxc5 and Nxc5. ",
        "15. O-O-O": "Ouch! white has just castled into a firestorm. ",
        "15... O-O 16. h4": "The h4-h5 is also another classical attacking theme for white. In this situation black is quite safe as it would take white some time in order to mount attack against the black king. However, the same can not be said for white as black is already in king hunting mode. ",
        "16... Rfd8": "The real weakness in white's position is the d-file so I put my rook on it. ",
        "17. g4": "white is being reckless and is going for broke on the king side but black repeals the attack with ease. ",
        "17... Nxg4": "grabs a pawn and excepts white to play Rhg1",
        "18. Rhg1 Nde5": "Black defends the knight and gains complete control of the centre",
        "19. Nxe5 Nxe5 20. Kb1": "White needed to continue with the attack with Bxh6. \r\n\r\nIf white had played 20. Bxh6 how should black defend against the threat on g7? ",
        "20... Nxd3 21. cxd3": "a bad positional move that creates a serious weakness in whites pawns structure. ",
        "21... Kh7": "defending h6 and moving off the dangerous g file. ",
        "22. Qe4+ Qf5 23. Bc3 g6 24. Qd4 e5": "black is very mobilzed and white is running out of room",
        "25. Qe3 Rd7": "preparing to double up the rooks on the d-file and attack d3",
        "26. Ka1 Rad8": "attacking the d3 pawn",
        "27. d4 Bc5": "a great move that highlights the real weakness in white's position and that is the back rank. White can not take the bishop because of the resulting back rank checkmate. Also black wins the pawn with improved force\r\n",
        "28. Bd2 Rd7xd4": "This is better than 28. ...Bxd4 because after 29. Qh6+ Kg8 black is not as active",
        "29. Qxh6+ Kg8 30. a3": "? this loses the bishop",
        "30... Qd7": "bye-bye bishop",
        "31. Bc3 Rxd1+": "ok now white does not lose a bishop, instead he loses a rook!",
        "32. Rxd1 Qxd1+ 33. Ka2 Qd5+ 34. Ka1 Qb3": "threatening mate in 2",
        "35. Bd2": "ok now he loses the bishop too",
        "35... Qd1+": "White resigns because he has lost a bishop and is seriously behind in material."
    },
    "url": "https://gameknot.com/annotation.pl/melgarfbcs-mini-tournament?gm=27513",
    "gameName": "melgarfbc's mini-tournament",
    "players": "autumnsmile (1635) vs. elyhim (1842)",
    "opening": "Caro-Kann (B17), Steinitz variation"
}