{
    "moves": {
        "1. e4": "I played this game at a tournament at LAX Hilton in Los Angeles. White and I were both in the running for second in the U1800 section.",
        "1... c5": "This is the most common response to e4. Slightly less common are e5, e6, and c6.",
        "2. Bc4": "The most common move is Nf3. This variation is somewhat dubious since it's too early to decide where the bishop should be developed. But there is nothing totally wrong with early Bc4 since it could transpose to a Sozin Attack.",
        "2... e6": "I usually play d6 on the second move, but I think this is slightly more accurate since it blocks the bishop's path to f7, while I also have an idea of playing d5.",
        "3. Nc3": "White blocks d5 and has good control over the light squares.",
        "3... d6 4. Nf3": "Although White already has three pieces developed, my central structure is quite solid, so White's development lead isn't as important as it would be if the center was open",
        "4... a6": "Nf6 I think is sharper. I don't think this is very necessary. I wanted to play b5 next move, but then decided not to. You should always have a plan and don't keep changing your plans every move. My position is somewhat passive and underdeveloped, so overextending with b5 may not be a good idea",
        "5. d4": "White wants to open the position to capitalize on his lead in development",
        "5... cxd4 6. Nxd4": "Now this has transposed into some kind of Sozin Attack. If I play Nf6 here, then it will transpose into the main line of Sozin. I'm not familiar with the main line, so I tried some different moves.",
        "6... Be7 7. f4 Nd7": "Some may question my passively played opening. I don't think there's anything wrong with playing passive if your position is solid, but you need to be prepared for razor-sharp moves like White's next",
        "8. Bxe6": "White sacrifices a piece to severely weaken my position, so that it isn't solid anymore.",
        "8... fxe6 9. Nxe6 Qa5 10. Nxg7+": "Here I think Bd2 is better than Nxg7  because my queen is misplaced and the knights will be strong on e6 and d5, attacking my c7 weakness. After the knight gives check, the knight can no longer post itself on e6, so it isn't a strong attacker anymore",
        "10... Kf7": "I wasn't comfortable with Kf8 or Kd8 since White has another check with Ne6 ",
        "11. Nf5": "Now White has three pawns for the piece, which gives a major imbalance to the position. It's hard to tell who is better here, but I would prefer my position since a piece in the opening is usually better than three pawns. The three pawns are usually only better than the piece in endgames.",
        "11... Ngf6": "This blocks a dangerous Qh5 check. ",
        "12. Nxd6+": "I was relieved when White took the pawn, because it's usually good for the defending side to trade passive pieces for the attacker's active pieces.",
        "12... Bxd6 13. Qxd6 Nxe4": "Here I was happy with my position since my king is pretty much safe, and I have a slight lead in development.",
        "14. Qd5+": "Since pawns are worth more in the endgame, White wants to trade queens to increase the power of his 6 to 3 majority of overall pawns.",
        "14... Qxd5 15. Nxd5 b5": "My bishop should be strong on the long diagonal since White can no longer block it with f3.",
        "16. O-O": "It's usually better to have your king in the center during the endgame, but it's uncertain whether this can be considered an endgame. There are still many pieces on the board, so this is just a middlegame without queens.",
        "16... Bb7 17. Ne3 h5": "I didn't know what to do in this kind of position, but I think this was dubious. I wanted to play h4 h3 and start an attack on the light squares, but that plan may take too long to carry out.",
        "18. Rd1 Ndf6 19. c3": "This is passive. White needs to develop his pieces quickly, especially since I have an extra knight. White's undeveloped bishop and rook became a problem for him in the later endgame. Bd2 I think is much better than c3, which does nothing to help White's position.",
        "19... Rad8": "Bd2 is impossible now, and White's position is cramped",
        "20. Rxd8 Rxd8": "My position is clearly more active and better positioned, but maybe it isn't enough to win since White has a lot of pawns and I didn't see any way to capitalize on my advantages",
        "21. a4": "White attempts to get his rook into play while forcing a pawn trade. Here I thought this game was drawn since three pawns is considered equal to a piece, and my pawns had no hope of promoting.",
        "21... h4": "My only hope to win this is to try for a mating attack on the kingside, since White lacks defenders there. ",
        "22. axb5 axb5 23. Ra7 Rd7 24. c4": "At first I thought White blundered because of bxc4 Nxc4 Rd1#\r\nMaybe White didn't see my mate when he played this move, or maybe he had something else in mind like bxc4 Ra4 c3 bxc3 Nxc3 which gives me a pawn, but also leaves me with only one pawn on the board, so White has good drawing chances in the endgame.",
        "24... b4": "I decided to ignore the pawn so I wouldn't complicate the position. Maybe winning the pawn was better, because now White has a passed pawn and potential winning chances. I think b4 gives me the most winning chances since taking frees up some space for White's pieces. Taking the pawn is more drawish, while advancing the pawn gives super sharp dynamic winning chances for both sides",
        "25. Ra4 Nc5": "Now White can't take the pawn or play Ra5 because of Nd3 winning a piece. But even then, the position is too ultra complicated to know if that would be enough to win. ",
        "26. Ra2": "The only other moves were Ra7 and Ra1. I think Ra1 is better since it defends the back rank if the bishop could move. But once again, the position is too complicated to calculate accurate moves.",
        "26... Nh5 27. f5 Nf4": "This threatens Ne2 fork",
        "28. Kf1": "Here I considered Nxg2 Nxg2 Rd1  which wins a pawn back, but I wasn't concerned about the pawns now. I need to try for a mating attack so I should keep as many pieces on the board as possible to capitalize on my extra piece. Trading will benefit White, who has more pawns.",
        "28... Ncd3 29. Bd2 b3 30. Ra3 Nxb2": "I forgot that White could play g3 in this position instead of taking the pawn. g3 would probably give White better chances to draw, or maybe even win, but I stopped considering it after White took the pawn.",
        "31. Rxb3": "I think this is a mistake because now my rook becomes active on the seventh rank for a potential mating attack with my rook and two knights.",
        "31... Rxd2 32. Rxb7+ Kf6": "Here I thought I had good winning chances, since I have a nice attack against White's weak king. I wasn't as worried about g3 as I was a few moves ago since I might not need any pawns to finish the game. Perhaps my pressure with my rook and two knights is enough to win, if I can use my king to attack, but this is too complicated to evaluate. This might be drawn, but I still thought I had good winning chances, since White must play perfectly. I want to be optimistic that I can win this, but I would probably bet money that this is a draw.",
        "33. c5": "I think g3 was the best move to try to draw, since it forces my last pawn off the board. The promotion idea is too slow, because my mating attack idea is faster. This might be White's losing move, but he might still have drawing chances after this.",
        "33... Nbd3": "Now I have a forced mating threat, like if White plays something careless like c6??, then I have Rf2  Kg1 Ne2  Kh1 Rf1  Nxf1 Nf2# which is a nice mate if White overlooks it.",
        "34. Rb1": "This interferes with my forced mate threat, and g3 is another idea. After g3, I have Rf2  Kg1 Ne2  Kh1 h3 (threatening Rf1  followed by Nf2#) so White plays Rb1 to stop Rf1 , but I have Rxf5 threatening Nf2# and White is in trouble.",
        "34... Rf2+ 35. Kg1 Ne2+ 36. Kh1 Rxf5": "I use this opportunity to exploit my mate threat of Nf2# so now my rook is untouchable. I will win White's other pawn, but still, since I only have 1 pawn left I was lucky to hold onto, White may still have drawing chances. I still have hope of winning this, because White's king cannot get out from it's corner.",
        "37. Ng4+ Kg5 38. h3": "White is defended from mating threats, so I didn't see any way I could possibly win now. I considered offering a draw, but I was determined to win this endgame and get 2nd place in the tournament. If I drew this game, then I would fall into a 4-way tie for 2nd.",
        "38... Rxc5": "White should have a forced draw somewhere, because it doesn't seem possible for me to win this. Kh2 avoids trading rooks, and then my only chances of winning are if I can get my knights to g3 and f4, and then forcibly play Rxg2#\r\nWhite letting me trade rooks gives me better winning chances",
        "39. Rd1 Rc1 40. Rxc1 Ndxc1": "I didn't want to take with the other knight because I wasn't comfortable with White playing g3.",
        "41. Ne5": "Now this appears to be drawn, since I see no way of promoting my last pawn. I didn't think I could ever win this since White will play Nf3 next move and take my last pawn, but then I realized that two knights might be enough to mate White since he still has pawns on the board.",
        "41... Kf4 42. Nf3 Kg3 43. Nxh4": "White offered a draw here, and I was actually relieved that he took the pawn. If he leaves the knight on the board, then he has a much better chance of drawing. Taking the pawn is probably losing, although White must've thought that I couldn't possibly mate him with two knights.",
        "43... Kxh4": "I declined the draw, because White's king is cornered, and his pawns are far from promotion. The only reason two knights can't mate a king is because the knights have to stalemate the king before mating it, which would be a draw. Since White still has pawns on the board, White won't be stalemated when I try to mate him with the knights, so I still have winning chances, and probably a forced win.",
        "44. Kh2": "g3 and g4 lose quickly because Kg3 stalemates the king and then I just need to maneuver Nd3-f2 mate while White can only push his pawn. If both of White's pawns were off the board, then this would definitely be a draw.",
        "44... Ng3": "I have to limit White's activity as much as possible",
        "45. Kg1 Nd3": "White's king is locked in the corner. It's like a puzzle to figure out how I can complete a mating maneuver with two knights.",
        "46. Kh2 Nf2": "I wanted to get my knight to e4 to support my g3 knight, because if my king was on f2, then Nf1  Kh1 Ng3# would be mate.\r\nWhen your opponent has limited moving range, then It's okay to think as if you have unlimited moves ",
        "47. Kg1 Nfe4 48. Kh2 Kg5": "My mating idea of getting my king to f2 will only work if White's h-pawn was blockaded, so I was thinking that maybe I couldn't win this.\r\nBut if White tries to free space by pushing his h-pawn now, then I should still be able to win since White can only maneuver his king back and forth from h2 to g1. White has better drawing chances if he keeps the pawns on the board and waits to see what I do, instead of trying to get his pawns off the board quickly so he can claim a draw. I should be able to win as long as White still has 1 pawn on the board.",
        "49. Kg1 Kf4": "I'm hoping White will push the pawn, since winning will be simpler if White only has one pawn. All I would need to do it find a cornering tactic and stalemate the king, then complete a mating maneuver while White can only push his pawn. I analysed this ending with my opponent and a few other tournament spectators, and couldn't find any way White could draw this. But White probably had many drawing chances before he sacced his knight for my last pawn.",
        "50. Kh2 Ke3": "I was happy I saw a cornering tactic if White pushes the pawn. If White doesn't push the pawn and keeps moving the king from g1 to h2, then 51.Kg1 Nf6 52.Kh2 Kf2 53.h4 Ne2 and there are many winning lines for me, because White can't stop me from cornering the king with Ng1, and then completing the mating maneuver 54...Nf4 55...Ne2 56...Ng3#\r\nBut against 54.Kh1 after 53...Ne2, I don't need Ng1 and can just play Ng4 immediately followed by Ng3#.\r\nAnother winning sequence I analysed was Kg1 Nf6 h4 Ng4 h5 Ke2 h6 Ke1 h7 Ne2  Kh1 Kf1 h8=Q Ng3#",
        "51. h4": "White decides to push the pawn and escape to h3 while my king isn't close enough to take the pawn.",
        "51... Nf1+": "This is my cornering tactic because White can't escape to h3 because of Nf2#",
        "52. Kg1": "Kh1 loses quickly to Kf2 then Neg3# but my winning sequence after Kg1 was very nice, and everything was pretty much forced after that",
        "52... Neg3": "White's king is stalemated, and can only push his pawn, so I had everything calculated here to make sure I could forcibly checkmate White. Note that this position would be a draw if White didn't have the pawn on g2. ",
        "53. h5 Ke2 54. h6 Ke1 55. h7 Ne2+ 56. Kh1 Kf2 57. h8=Q Neg3#": "Just in time!"
    },
    "url": "https://gameknot.com/annotation.pl/memorial-day-classic-round-6?gm=8072",
    "gameName": "Memorial Day Classic Round 6",
    "players": "Ausbon (1620) vs. (me) byakuugan3 (1698)",
    "opening": "Sicilian defence (B20)"
}