{
    "moves": {
        "1. d4": "I opened with d4. I've had the most success with this opening. In the first game, elyhim mentioned that most would argue playing d4 is done to avoid opening tactics and leads to closed equal positions. I haven't played it enough to recognize that fact yet. What I know is I win more with this opening than with e4.",
        "1... Nf6 2. c4": "QP moves... the thing about this game you'll notice is the action that normally happens right over center, seems to be offset a bit towards the A file. Not sure if that is typical or not, but I noticed it halfway through the game.",
        "2... e6": "We're both preparing to attack the center squares. Control of d5 seems to be the key here.",
        "3. Nc3": "So white adds pressure.",
        "3... b6": "I expected a d5 move.. however, I know the fianchetto is coming. He wants to apply flank pressure on d5 and aim his LSB at my future castle.",
        "4. e4": "more d5 defenders, but maybe to far up with the pawns. I feel like there's a lot of space behind the pawns right now.",
        "4... d6": "this move surprised me a little. I really expected the fianchetto. Now I see d4 as a bit weak, but I don't think c5 is coming. While c5 might open up the queen side a bit, that doesn't seem to be consistent with the d5 pressure. ",
        "5. Bd3": "so I need to support the under defended e pawn, and prepare for castling.",
        "5... Bb7": "there's the fianchetto I expected a while back. ",
        "6. Nf3": "defends the d pawn, opens up the castle.",
        "6... Nbd7": "at this point, I'm thinking there's a c5 or e5 push coming... ",
        "7. O-O": "so I think I'll castle and worry about it later  :)",
        "7... Be7": "preparing to castle",
        "8. Qe2": "added a defender to e4. Elyhim has told me the queen is always happier when she stays close to home. I like the look of my bishops here, although I don't think I took advantage of them much.",
        "8... O-O": "castle",
        "9. b4": "this particular move was a key learning move for me. It was an error. In a subsequent game I played in an MT, I noticed my opponent made this exact move and was able to take advantage of it based on elyhim's instruction. I wish I had the comments from the chat to share here, but they were erased.",
        "9... d5": "so the attack begins!",
        "10. c5": "elyhim indicates a better move would have been a3. This move made the situation worse. Post game analysis shows this as an inaccuracy. I didn't see the pawn fork at e4. Again, I used a similar tactic in a game against someone else.",
        "10... dxe4": "yucky",
        "11. Nxe4": "moving the other knight into the center.",
        "11... a5": "this is why elyhim thought it would be a good idea to defend with a3. ",
        "12. Neg5": "I have a real problem with knights... as you will soon see. I have a difficult time seeing all the possibilities. I know this is an issue in my game and once solved, I'll be a much better player. I moved my knight in this position thinking I would eventually somehow get my queen over to the king side and wreak havoc... I missed the obvious defender on f6.",
        "12... h6": "wants me to leave",
        "13. Bh7+": "again, didn't even recognize the knight's defense on f6. Analysis calls this a mistake, although I personally think its a blunder.",
        "13... Nxh7": "take",
        "14. Nxe6": "so i made this move with the idea that I could ultimately bring my queen into the mix by sacrificing the knight.. not a good idea.",
        "14... fxe6": "take.. ",
        "15. Qxe6+": "so now I'm -3 against a 2561 player... not a good place to be.",
        "15... Rf7": "I didn't see the fork potential on c6, that would have been sweet. Instead I was focused on getting my queen active. I thought about Ne5, but that would just exchange and open the queen up.",
        "16. Bxh6": "I was dreaming about having the knight at g5 and the queen nearby, but that didn't work out. I have a feeling this is just irritating elyhim.",
        "16... gxh6 17. Qg6+": "can't afford to give him a move... hoping he makes some kind of mistake.",
        "17... Rg7 18. Qe6+": "maybe he'll repeat that would be something!",
        "18... Kh8": "nope.",
        "19. d5": "still don't see the fork at c6, too bad, that would have been interesting.",
        "19... Ndf8": "and now the queen is open.",
        "20. Rad1": "lining my rook up against the black queen I think I'm a sharp dude... totally suffering from my chronic \"knight blindness\".. he has my queen if he wants it.",
        "20... Qe8": "I get a golden pity ticket.",
        "21. Qe3": "now she's running.. I may have been able to pick up h6, but can still threaten it from here and defend c5 at the same time.",
        "21... Qg6": "rook and queen lined up for the kill.. not forgetting the LSB way over there on the diagonal, so I need to leave the queen in place.",
        "22. g3": "no mate yet!",
        "22... axb4": "black is going to do something about the queen defender.",
        "23. d6": "I tried to bluff a pawn promotion.",
        "23... Ra3": "lots of end game pressure.",
        "24. Qxe7 Bxf3 25. dxc7": "threatening teleport-promotion",
        "25... Rxe7": "step one, destroy original",
        "26. c8=Q": "step two, reconstitute queen (teleport complete)",
        "26... Ra8": "back to defending the rear rank",
        "27. Qh3": "trying to defend the king",
        "27... Ng5": "getting worse now.",
        "28. Qh4 Re4 29. Rd6": "at this point, I see the forced mate and resign.\n\nHope you all enjoy the annotation.\n\nThanks Terence for the game and instructional chat. "
    },
    "url": "https://gameknot.com/annotation.pl/mentoring-game-2-from-elyhim?gm=60516",
    "gameName": "Mentoring game #2 from elyhim",
    "players": "russ20124 (1496) vs. elyhim (2561)",
    "opening": "Nimzo-Indian defence (E20)"
}