{
    "moves": {
        "1. e4": "As usual, Sue likes to open with the King's Pawn Opening.",
        "1... c5": "As usual, I like the Sicilian Defense.",
        "2. Nf3": "The most standard response in this Defense.",
        "2... d6": "So, I continue with the mainline.",
        "3. Bc4": "But, Sue plays something that I haven't seen before.  The last time I saw anything like this was in the second Wizard Chess Game that I annotated.  But, that was with check, when I brought the Knight out.  I have seen similar moves, but that is, when my opponent attempts a SM.  Then, I figured out that she has another threat.  The concern is 3...Ng5 (which threatens to win something.)",
        "3... e6": "So, I stopped it cold by cutting the diagonal of that bishop.",
        "4. O-O": "And, she castles.",
        "4... d5": "Meanwhile, I continue because this is what I'm most used to.  The idea is exchanging.",
        "5. exd5 exd5 6. Bb5+": "I'm not surprised to see this move played, at all.",
        "6... Nd7": "In my annotation with Wizard Chess, reversion told me that this is the most common way to get out of check here.  And, I checked out the game that he commented on.",
        "7. Re1+": "She checks again.",
        "7... Be7": "And, I get out this way.  The idea being is that 7...Ne7 would've hindered my development.  Whether I got out that way or here, the problem is that two of my pieces are pinned, just like, what we see with Jack Stockel.",
        "8. d4": "Preparing to get her DSB into play.  I looked at lines here.  One being 9.Bg5 with the possible loss of a bishop.  But, I came to my senses that I could refute that with 9...f6 (despite not wanting to advance my weakest pawn).  What I felt would happen was losing a pawn.  But, what I forgot is that it's protected by my Queen.  What the long term planned boiled down was not losing the time to develop, but here, I should've bypassed all of that.  This is because, when Sue takes back, I'll wind up with problems.",
        "8... cxd4 9. Nxd4 Ngf6": "?? The focus was castling.  But, the idea wasn't the usual of developing or connecting the Rooks.  My real plan was to break her two pins, once and for all.  Afterall, I remember what happened in a loss against Jack Stockel and went wrong by failing to undue it.  Likewise, these pins were very dangerous.  And, I should've given that up, as best was 9...Kf8  This is the move that would've broken that pin, and suddenly black might have wound up with problems.  By playing this, she will win material, and when that happens, there will be no way to fix the problems.  In other words, this is the losing blunder.",
        "10. Nf5": "I did not overlook this move.  But, I underestimated how strong this was.",
        "10... Ne4": "This is where I thought that there were only small problems.  10...g6 also came into consideration, but she would still have 11.Re7+  However, (and not to try to contrast what I say, this was the best move)  The idea being that, after 10...Rxe7+, 11.Kf8, I'd get tempo because her Knight would be forced to retreat.  ",
        "11. Qxd5": "I then said something but then deleted it, as Sue has a lot of good options.  She wanted to know what was originally posted.  So, I said that better was 11.Nxg7+.  11...Kf8, 12.Qxd5, you're up two pawns because if 12...Kxg7, you can take back on e4.",
        "11... Nef6": "?? I posted that comment on the next move.  But, I realize that after she retreats, I'm still in a lot of trouble because she take on e7.  Eventually, that will happen, and when it does, I'm down more then just two pawns.  I also realize that breaking the pin won't due, at this point.  The reason for not playing 11...Kf8 was due to the loss of a piece.  This happens, anyway.  Had that been played, I might have gotten some counterplay.  With this move, however, it's over.  ",
        "12. Qd3 Qa5": "With the trouble I'm in, I figure that I've got nothing better then to threaten her Rook.  At least, the goal is making it difficult for Sue to win so that she learns.  However, this doesn't make matter more difficult.  Her next move is what I had anticipated.  It just gives me an extra move before the damage is done.",
        "13. Bd2 Qb6": "So, the plan is to create a different that will be harder to drive off, when Sue takes.",
        "14. Nxe7": "Sue wanted that comment back.  But, on this move, I explained why that comment was deleted.  The idea being is that I anticipated this, and with it, she's now up a piece and pawn.  ",
        "14... Kd8": "The monarch must move to prevent a discovered check.  I don't like liquidating, but the only other option was 14...Kf8  However, when she takes, it would be another free piece, which I'm not willing to give away.",
        "15. Nxc8 Rxc8 16. Bg5": "With this second pin, however, I resigned.  She is definitely threatening a mating net because my Nf6 is, effectively blocked.  After that, I asked myself what could be done.  The only alternative is to give up my Queen for a Bishop, on top of what I've lost.  Afterwhich, I asked myself, if there was a chance of counterplay, looking at all the options.  Sure enough, there isn't.  After the loss, she has another mating threat, and the only way out would be to accept further loss of material.  So, I realized that there's definitely no way to stay in the game.  In other words, it's now a resignable position."
    },
    "url": "https://gameknot.com/annotation.pl/mentoring-game-5?gm=60501",
    "gameName": "Mentoring Game 5",
    "players": "knightrider62 (964) vs. jkarp (1356)",
    "opening": "Sicilian (B50)"
}