{
    "moves": {
        "1. e4": "My 2nd learning game with darknite13 in the Walking the Walk and Learning to Run chess club.",
        "1... c5": "Black responds with the Sicilian Defence.",
        "2. Nf3 Nc6 3. d4 cxd4 4. Nxd4 e5 5. Nb5 Nf6 6. Nb1c3 Bb4 7. a3 Bxc3+ 8. Nxc3 d6 9. Bg5 Be6 10. Be2": "The last move from the games database - the real challenge starts here!",
        "10... O-O 11. O-O": "Priority is to get the King to safety.",
        "11... Nd4 12. Nb5": "Here I am targetting the seemingly unprotected pawn on d6 with my knight and queen....I just need to try to shift the black knight on d4 by pushing the c pawn.",
        "12... Nxb5 13. Bxb5": "Plan didn't work, as I can't take the black d pawn with my Queen!  But I'm happy to exchange pieces instead.  I'm also very pleased to have a Bishop and Knight in exchange for 2 Knights.  I believe Bishops become slightly better as the game progresses.",
        "13... Qb6 14. Bd3": "Move bishop to safety but I have left my b pawn in danger. I decided to protect e4 pawn as this controls the center.",
        "14... Nd7": "This move really surprised me, I didn't understand it.  I could only think that black decided to maintain his pawn structure around his king should I have taken the Knight on my next move.",
        "15. b4": "I was given the opportunity to protect my b pawn - I was happy as my pieces seemed safe plus I had some control of various squares with my queen and bishops",
        "15... Qc7 16. Be3": "I thought my Bishop on g5 looked inactive, so I decided to pull it back to e3 where it appears to control more squares.",
        "16... Nb6 17. f3": "I had an option here to take the knight, however, I prefer bishops over knights so decline the exchange and add extra protection to my e4 pawn.  I liked this move as it also gives my white square bishop extra mobility - as up to now it has been wasted guarding a single pawn.",
        "17... d5 18. Qd2": "I was really confused here...the fact black offered the pawn exchange made me suspect that he had an unpleasant surprise in store, so I decline  and try to bring my Queen in to the game.",
        "18... d4": "I am feeling squeezed!",
        "19. Bf2": "Not much choice really.  I considered Bishop to g5 however I was concerned the bishop might end up becoming trapped by a pawn push, and I don't want to use the safety net around my King just yet just to defend a bishop.  But....I was mistaken, the bishop would have had an easy exit on the h4 diagonal....I failed to spot ths at the time.",
        "19... Rfd8": "Black pulls out a tank - the game is heating up",
        "20. Bg3": "Trying to apply pressure to the weaker of the 2 pawns",
        "20... Nc4 21. Qg5": "Here I apply a double attack on the e5 pawn, whilst moving my queen to safety.  I was considering pawn to f4 next.",
        "21... f6 22. Qc1": "Regrettably I am forced to pull my queen out of the game, and my previous moves assisted black in making a strong pawn structure.  My pieces are becoming closed in all because I let black control the centre with his pawns.",
        "22... Ne3": "....ouch...I left e3 completely open!",
        "23. Rf2": "Rf2 to provide extra protection to c2 and g2.",
        "23... Rac8": "Black owns the c line however I'm not seeing anything too dangerous at this stage.  I think c2 is well protected and I plan to keep my white square bishop and one other defender (such as the Queen or Rook on f2) exactly where they are.",
        "24. f4": "Change of strategy - time to try and break up the pawn structure.",
        "24... Qd6 25. fxe5 fxe5 26. Rf3": "Here I am considering exchanging my rook for the knight and pawn.  This will leave me a point down however I don't like the knight so far forward attacking important squares around my king.",
        "26... Rdf8": "That is unpleasant as I don't like the idea of black controlling the f file should I take the knight on e3 with my rook.",
        "27. Rxf8+": "So I take the rook, I think it was right to try to take away blacks control of both the c and f files, particularly as that rook may have potentially blocked 2 escape squares for my king.",
        "27... Rxf8": "So black regains control of the f file but at least now the c file is free, but I still have a problem with that black knight.",
        "28. Bf2": "Second attempt at attacking the knight!",
        "28... Ng4 29. Bh4": "Bring bishop to safety and an attempt to block the black queen from moving to e7, and possibly followed up by f7.",
        "29... h6 30. h3 Ne3 31. Bf2": "A 3rd attempt at attacking the knight in that undesirable position!",
        "31... Bxh3 32. Bxe3": "Arrggg....at last I get that knight!! I thought taking the bishop would leave my king wide open.\n\nI had to carefully calculate though the threat to my King.  The Queen can easily move to g6 and the rook is controlling the f file.  I decide I can protect my g pawn with my bishop to f1.",
        "32... Qg6 33. Bf1": "Defending against mate.",
        "33... dxe3 34. Qxe3": "Spent ages on this move, it looked safe to take the pawn. Additionally I attack the bishop and make my queen active again.\n\nBoth my pawn on g2 and bishop on f1 are protected.",
        "34... Rxf1+": "Seemed so natural to take with the rook here....and then bang!! Game over - this was what I analysed before this move!  At this point I noticed that I must take with the king and bring it to a safe square.  I am very fortunate to have an escape route.",
        "35. Kxf1 Qxg2+ 36. Ke1": "The lucky escape!",
        "36... Qf1+ 37. Kd2 Qxa1 38. Qxh3": "Lose my rook but happy to take the bishop - I am having a massive amount of luck here!",
        "38... Qd4+ 39. Qd3": "Here I know that exchanging queens is a losing move.  I thought about king to c1, then I lose the e or a pawns and I couldn't see any counter play.",
        "39... Qxd3+ 40. Kxd3 g5 41. Ke3 h5 42. Kf3 b5 43. c3 Kf7 44. Kg3 Kg6": "Here I resign as I can't think of how I can stop black from promoting a pawn."
    },
    "url": "https://gameknot.com/annotation.pl/mentoring-1?gm=54103",
    "gameName": "Mentoring 1",
    "players": "pauljr72 (1316) vs. darknite13 (2081)",
    "opening": "Sicilian (B32), Labourdonnais-Loewenthal (Kalashnikov) variation"
}