{
    "moves": {
        "1. e4": "This time, she's white, and I'm black.  Sue starts conventionally.",
        "1... c5": "I would've even longer, which you typically see when I mentor.  But, I felt that Sue was ready to learn about the Siclian Defense, at this point, after that blunder I made in our previous game which could've cost me the game.  However, my student finds the right responses and sticks with the main lines for the next several days, as you typically.  I am already impressed with how she's playing because Sue found the right responses without me having to teach it.",
        "2. Nf3 d6 3. d4 cxd4 4. Nxd4 Nf6 5. Nc3 a6 6. Bg5": "As I've taught her, she develops.  However, I sense that there's more to it then meets the eye, after our last game.  Normally, this wouldn't happen, but that blunder involved pressure against my Knight, with her Bishop.  By overlooking the threat, Sue won a piece for a pawn early, as some of you know.",
        "6... e5": "Therefore, I'm not taking chances.  So, I decide to kick her Knight.  With this tempo gain, I can and will add a defender to my Nf6, whilst, develop another piece and prepare to castle.",
        "7. Nb3 Be7 8. Qd2": "At first, I was going to tell her that it was an inaccuracy since the idea is to stick to General Opening Guidlines.  With that being said, 8...Nxe4 came into consideration.  But, I quickly ruled it out because, like last time, I thought she'd win a piece for a pawn after 9.Nxe4, which I wasn't going to allow, this time around.  However, despite not being in check, which I initially thought, I would've been able to recompensate with 9...Bxg5.  I felt that Sue would be able to liquidate with 10.Qxg5??, but this time, overlooked that my Queen on d1 prevents that.  So, best, in reality, was, in fact, 8...Nxe4.  And, this move was an inaccuracy because white could've defended and developed with 8.Bd3.\n",
        "8... O-O": "Meanwhile, I castled, at once.",
        "9. O-O-O": "And, Sue did that, but on the opposite side.  So, I said,  I figured that you'd play that. It's not an error or an inaccuracy here. But, in general, it's better to castle short (Kingside) as the K is said to be safer.  ",
        "9... Be6": "Continuing her development.  As noted earlier, despite that one thing, I'm very impressed with her play, these days.",
        "10. Kb1": "After what I noted, Sue brings her monarch to a safer spot.",
        "10... Nc6": "So, I complete my development.",
        "11. Be2": "So, does she.",
        "11... Nd7": "In this position, I want to exchange bishops.  The idea being is that her Bg5 is stronger then my Be7.  She accepts the exchange.  I wasn't going to say anything, as I felt that it would be a little premature.  Usually, with a student, I don't comment until they make a noticeable inaccuracy or a mistake.  By noticeable, I mean extreme.  If it's just minor and something gets said, I worry that they'll feel overwhelmed which would affect their play.  That's something that I don't want, the idea is not making them feel uncomfortable which the worry is that it would happen.",
        "12. Bxe7 Qxe7 13. Bf3": "I'm not exactly sure why she played this, but my guess is to keep a better connection of her Rook.  Had Sue played Re1, right away, the center would be blocked by her Bishop, which I believe is an interference, by definition.  By doing this, they're better communicated.  The problem here, however, is that it'll leave her with doubled pawns near the K.  Now, that we're in the midgame, as per what tactical-abyss has outlined in similar games, we don't want that.",
        "13... Bxb3 14. Nd5": "?? Now, this is noticeable.  So, I said, believe it or not, this is the best you've played against me, so far. However, this is your first blunder in the game. Much better was to take back with the a or c pawns. I know that you were worried about exposing the King, but this is better then the loss of a piece.  After this game, however, I learned something Sue.  So, your best move was 14.axb3.  Another guideline says that you should capture towards the center, as opposed to, away from it.",
        "14... Bxd5": "With that blunder, this is where I go for it and liquidate.  The idea being is to exchange piece while ahead.",
        "15. exd5 Nd4": "Going after her Bf3.",
        "16. h3": "?! I said, The other thing to keep in mind is that when behind, you don't want to exchange pieces. It's known as liquidation. And, liquidating benefits the player that's ahead. Better was to retreat your Bf3.",
        "16... Nxf3 17. gxf3 Qf6": "With that being said, I put pressure on her f3.  Defending it is going to mean the loss of tempo.",
        "18. Qe2 Nc5": "Which I use to get a better outpost for my Knight.",
        "19. h4": "Not sure why she played this.  My guess is that the plan was to get a passed pawn which makes sense since, \"passed pawns must be pushed.\"  Although it's not a passer, it is good to think ahead, and I'm proud that she's doing this.  Bear in mind that if black did go wrong, white could get a passed pawn.  Something like this happened in a game where I went wrong which enabled my opponent to pull a swindle.",
        "19... e4": "So, I go for it and try to get a pushed pawn.  I also kept in mind that with my Nc5, I'm not going to lose anything.",
        "20. Qd2": "? Forgot to add it, but this was a mistake, Sue.  By playing this, I'm going to win another pawn.  Best was 20.dxe4, and after 20...Nxe4, aside from tempo, you haven't lost anything else.",
        "20... exf3 21. h5": "So, she pushes.  I figured it out.  The idea is trying to expose my K since the hope is for an eventual ...gxh6.  But, after what happened in my game against nambam, I was not going to allow this.",
        "21... Ne4": "So, I go after Sue's Queen.  The idea being is that I'll use that time to centralize one of my Rooks.",
        "22. Qe3": "She reattacks, but I had anticipated this move.  That's because I will add an extra defender by centralizing my Rook.  After which, there will be another threat that Sue must meet.",
        "22... Rfe8 23. Qe1": "?? After which, Sue keeps her Queen.  Now, I accurately pointed out that this is another blunder which will win more material.  I gave her Homework by showing her the position right after 22...Rfe8 to see if she could find the best.  Unfortunately, she did not find the solution this time around.  Sue: Cannot see where I blundered Or loss in material.? Could have moved 1. Rd4 2. R xe4 3. Q x e4 maybe?  Joe: 23.Rd4 was possible but would still result in the same move, that I'm bound to play. Best was 23.Qb6, hitting my b7 pawn, in the process.",
        "23... Ng3": "With that being said I unleash a discovered attack, which also happens (if I'm correct) a masked battery.",
        "24. Qc3": "Sue:  just blundered again, why can't I think before I move.  meant to move to b4.  Joe: It is a common weakness, but it's important to do so. The idea is to consider all threats made by your opponent. Knowing this will also help you to improve. So, always take a moment and ask yourself what works or doesn't work first. Yes, Qb4 was better because this move allows black to liquidate, first. One thing you don't want to do is exchange when behind.  But, what I forgot to explain is that, in the process, her K is going to be exposed with this exchange.  After which, I will then exchange her Rh1 for my Ng3.   ",
        "24... Qxc3 25. bxc3 Nxh1 26. Rxh1 Rac8": "Going after her pawn.  But, for now, one move is a good or bad as another.  In other words, Sue cannot defend c3, one way or another.",
        "27. Rh3": "She does, however, defend f3, but as noted, her c3 pawn is a goner.  This is, btw, another disadvantage to having doubled pawns, this late in the game.",
        "27... Rxc3 28. Rh4": "I'm not exactly sure she played.  But, as implied earlier, there's pretty much, no more good moves, left.",
        "28... Re2": "For white, it would be seventh, but the same idea applies.  A Rook right near the homesquare (back rank) is very dangerous.",
        "29. Rb4": "Preventing the loss of another pawn and delaying a mate, for now.  But, when we exchange, I'll have the other Rook on the second rank which will make it extremely dangerous and very difficult to defend against.  In fact, this is a resignable position, but I'm glad that Sue decided to play this out into the end.  By doing so, I think that she's learning more.  As I tell my students, you shouldn't resign, or as GM Judit Polgar puts it, \"Fight Til the End.\"",
        "29... Rcxc2 30. Rxb7 h6": "In this event, she was threatening a back rank mate, which I was well aware of, in event.  I had considered 30...g6, but did not want to exchange on that square.  It was possible, but I wanted to prevent the slightest risk of counterplay.  Come to think of it, this was also possible because there still isn't a chance.  But, the idea is keeping it simple, as opposed to, going into complications, which I learned when bhidragon had that mating sequence against me and, thus, found the quickest win.",
        "31. Rb8+": "As anticipated, Sue puts me in check.  I was prepared by knowing that my next move is directly forced.  In doing so, I'm even more comfortable.  So, the other idea behind not playing 30...g6, and exchanging is staying in your comfort zone.",
        "31... Kh7 32. Rb6": "I also anticipated this but have an answer, when she decides to take.",
        "32... Rcd2": "By threatening a back rank mate.  And, after she defends against this threat...",
        "33. Ka1 Rexf2": "That's when I grab another pawn.",
        "34. Rb7": "Going after f7, whilst preventing a mate, for now.",
        "34... Rfh2": "In case Sue can pull that off, I come with another idea, which involves the unstoppable passed pawn.  So, that if she find the move, I would play 35...Rg2, and after 36.Rb1 36...f2, and I'd allow 38.Rxf1, after 37...f1=Q because it's mate wtih 38...Rxa2#  Even if she didn't take, I'd still mate with the same move.",
        "35. Kb1": "?? But, this is how Sue responded.  So, I said, But, this, however, loses right away. The Rook stayed on the b file, which is where it needed to be. But, the monarch should've remained a1. However, there was, pretty much, no good moves left. Sooner or later, I would've promoted my f pawn which would be mate. But, this would've taken me longer. By moving the monarch over, your Rb7 cannot prevent me from mating you. Anyway, the moral is that, when you can take back. Think before making a move and what the consequences will be, as you note. And, remember that two Rooks near the homesquare, so on the seventh rank (for black) or second rank (for white) are very dangerous. The idea being is that the monarch is stuck on the homesquare, so you must be careful. Once your Rook is blocked from the first rank, it's mate.",
        "35... Rd1#": "After this game, we discussed it.  Of course, I reversed the colors and, inadvertently said seventh, as opposed to, the second rank.  But, it's still the moral of the story with both rooks.  Joe: This was your best game against me, so far. You played very well, until overlooking that you could've recaptured. But, after that mistake, everything was fine, until allowing me to liquidate Queens, and losing a Rook for Knight. After that, I had both my Rooks on the seventh rank, which is known to be deadly because your monarch was confined to the back rank. After that, you moved your King on the same file that your Rook was on which is why mate couldn't be stopped. So, another thing to learn, is that one rook on the seventh rank is bad enough, but two rooks are very deadly. Even with making the right choice, like let's say that Rook moved down but on the same file, black would've mated, with the passed pawn. But, overall, there's always more to learn.  Sue: I kept my rook on the same file, hope I could stop a mate on the seventh rank, but as you say my biggest blunder was allowing the exchange of queens when I was already down in material. This was purely accidental as I meant to move it to a different square. Must always look before pressing submit\"...  @knightrider62: I agree with that.  It's important to look at and access everything before making a move.  Remembering that is going to help you improve."
    },
    "url": "https://gameknot.com/annotation.pl/mentoring-game-4?gm=60438",
    "gameName": "Mentoring Game 4",
    "players": "knightrider62 (1000) vs. jkarp (1356)",
    "opening": "Sicilian (B94), Najdorf, 6.Bg5"
}