{
    "moves": {
        "1. e4": "The usual.",
        "1... e5": "Although, I respond with the Siclian, I don't teach that since it's hard to learn.  So, instead, unlike what isaiah11 (Andrew) once said that the Siclian is more common, well, this turns out to be the most common response to 1.e4 as I learned from easy19  Yes, we are in the King's Pawn Game, and I say that because perrinn asked if this was what it was called and I said yes.  That 1.e4 is the King's Pawn Opening, and with the move played, we're now in the KPG.  In fact, before the game we messaged each other because I wanted to know which color he wanted.  The reason I gave him black was to learn more about defenses which is what he told me.  So, in the game, I said, You said you wanted to learn more about defenses, which often happens when playing as black. Yes, this is the most common move, and now you have the King's Pawn Game.",
        "2. Nf3 Nf6": "Pretty common.  But, I still disagree with Isaiah's assessment.  So, what I told perrinn is, Most common, in this position is 2...Nc3 which can lead to interesting variations such as the Ruy Lopez, Guaco Piano, or Four Knights Opening. So, there are more variations, but there is nothing wrong this move since it develops a piece and gets you ready to control the center.  Now, I could capture and exchange right away.  But, instead I do something else.",
        "3. d4": "The thing is that when you're up against a stronger player, if material is even, you want to exchange early, so I didn't want to give that as an option.  Therefore, I decided to advance my central pawn since it is another developing move.  It get's the other B ready to come up by opening up a line, and it brings me one step closer to controlling the center.",
        "3... Nc6": "According to the analysis, this is an inaccuracy.  Best was to exchange on e4, so that would be 3...Nxe4, and then I'd respond with NXP, but I disagree with the analysis because it doesn't lose material.  In fact, I like this move better as since it doesn't lose anything, black doesn't move the same twice in the opening, which presents more opportunities to get the other pieces into play.",
        "4. dxe5 Nxe4 5. Bd3": "It was a hard decision between 5.Bc4 and this move.  But, the only reason I would even consider playing 5.Bc4 is a cheapo tactic, which black would see and I'd be much worse.  So, what would be the intention.  Well, after 5.Bc4, the idea would be to follow up with 6.Qd5, which as we know, mate can be driven off and if he found the right response, I might be in trouble.  And, as we know, and a reminder from what I recently read in an article by GM Susan Polgar, cheapo tactics because you must assume that the opponent will find the best move, and when he or she does, you're in trouble.  So, I decided on this move as now there is a lot I can and will do.  In addition, there's a very different tactic which I will do.  The idea is to castle and continue development.",
        "5... d5": "! Best.  Anything else would lose tempo since that N would have to retreat.",
        "6. O-O Bc5": "Continuing to develop.",
        "7. Bxe4": "However, while it doesn't appear so, I've studied similar positions with Jack, and actually went wrong in a game with him and before during a team game.  You have to be weary of a N, when it's that close to the home square.  So, with it, I gave perrinn the first HW assignment, which as you know, you frequently get HW with a mentor, as it's part of training.  In fact, even a coach will give it but won't announce.  For example, the idea with stopping a passed pawn with a R, that was HW that Jack indirectly gave me by making me study which I now use to teach.  However, I admit that I did so with a small typo.  So, I said, As with any mentoring session, there's generally. So, this will be the first question. Of course, I didn't have to take. There were other options, like pinning the N. However, this was the best move, in this position. The HW is to answer why this is the best move.  Of course, I could tell how difficult it was, so I gave it time by saying.  I'll hold off, until the question. That is, unless time is almost out. But, the idea is that it soaks in gradually, as that's how you learn. It's about processing information.  So, he responded by saying, \"Silly me I was not looking at my chat. Er... not usually this stunted...Paying close attention to everything now. I looked up the four nights,ruy lopez, and guaco piano. Definitely have relied on these for defense. I do have some issue deciding if the knights should move out first or I alternatively will bring center pawns out then bishobs tucked into the 3rd line followed by the knights just above the king and queen. Each of these seems to work but I think 4 knights covers more of the board.\"  So, my response was, It is good that you are seeing them. Ok, the solution. If I let the N stay on e4, ...Bxf2+ was being threatened. I would've lost a pawn because I'd be forced to play Kh1 If I took the B with Rxf2, you win the R after ...Bxf2",
        "7... Qe7": "? I understand why he played this, though, and it shows that he is thinking ahead which is important.  The idea was to compensate by winning back a pawn, this time it would be a central needed for center control.  However, he overlooked the N which is protecting the e pawn.  So, as I also told him, that better was 7...dxe4, because this move loses a pawn.  However, I forgot something important, this move loses a piece because if he took with 7...dxe4, and I played 8.Qxd8+, he can take back and exchange Q's with 8...Nxd8+, so I'd have a slight edge as I'd be a little ahead in development.  But, material would be even.  With my next move, however, black loses his P and B.  Then, I corrected myself by saying, BTW, after 7.Bxe4, best was 7...dxe4, as it becomes an even exchange, even when the Q's are exchanged. But, the move after, 7...Qe7 lost a piece.  So, the idea was that black lost a piece and pawn with this move.",
        "8. Bxd5 Bg4": "Deciding to pin the Q.  Actually, I like black's intention a lot, and this is what I used to do.  However, as I recently learned in the consulation game with geniusacamel from, I believe ptitroque, I believe it was, in general, you don't want to do that because the opponent will often sac material for a win.  I never saw how, but this is what they said.  But, this is what I used to play to, with the idea being, especially after what I mentioned about how dangerous the N's get to pin them.  ",
        "9. Bxc6+": "since 9.Be2 wasn't an option, I normally would break it then with 9.h3, and if 9...Bh5, I'd have 10.g4, forcing 10...h5 to prevent him from a losing a piece, which btw, is a very common continuation, that you'll see from GM's.  But, this time, I wasn't going to do it.  Since I'm ahead, I decide to liquidate his N for my B's, since the idea is exchange pawns, not pieces when you're down.  In fact, I said later on, Forgot to note that 8...Bg4 appeared good and does develop. But, the problem is that it resulted in liquidation which is an exchange when down a piece. So, when you are down material, exchanging pawns, doesn't make a difference, but you don't want to exchange pieces, though. Doing that gives you less to defend with.",
        "9... bxc6": "So, he said, \"ok ill try not to do that\"  So, my response was yes that is important. In fact, although I was at a disadvantage, I lost sooner by liquidating one of my pieces, when I was down by two pawns.  Then, he said, \"You know, historically my pawns have been under-appreciated. I try by best to move them out of the way so I can execute my assault. I always feel like moving a pawn takes an entire move and the opponent will use that move to strike. I am riveted to see how this goes.\"  I actually liked this response because it shows how hard he is thinking, studying the board, and trying to absorb and process what he's saying.  So, I said, Opponents do. Yes, and I'm glad you brought that up because it's an important concept. They don't attack material for the thrill of it because the opponent will find the best response, in which you'd be worse off. There is generally a strategy behind attacking the pawns, like winning material getting further in development. So, what's important is to ask yourself why the opponent made that move. And, then to figure out the reason by using analyze the board. I always emphasize to use that feature because that's where you figure out your opponents plan. It's walking through the process, as I call it, which is also known as doing HW. Using that and studying the position and the entire board will help you become a better player. In fact, a mentor on this site gave me HW questions which is how I learned how important that is. But, in order to do that HW, I needed to use the Analyze the Board feature to get the answer correct.",
        "10. Bg5": "I go after the Q, but the idea isn't to attack this, as might appear so.  Otherwise, I wouldn't play it since I don't do things just for thrill of attacking it because there always has to be a plan behind it.  In this case, it involves a threat that's very difficult to drive off.  The idea is that on his next move, when going after my B and pawns are exchanged, the idea is to pin that Q.  However, this was not quite as difficult as it appears and was nearly a cheapo tactic.  In fact, it is hope chess, if you go by Dan Hein's definition since there was something that I overlooked. ",
        "10... f6 11. exf6 gxf6 12. Re1 Be6": "! His, LSB.  Therefore, I told him that this was best as anything else would've lose his Q since it was pinned.  So, in order to prevent getting in trouble since with that definition you can get in trouble, now I have to do real chess in a difficult situation to prevent him from getting all of his advantages back.  As we know with WB's Q sac, and what Jack Stockel about not underestimating, the idea is that just because you have an advantage, you can't get overly confident.  You still have to calculate and plan ahead, or you could wind up in trouble.  So, I have to think and display real chess to.",
        "13. Qe2": "The best way is to think like a GM.  And, I say that because typically the GM's will often bring their Q in front of the R.  I never understood why until recently.  In fact, this is the game where I was, finally, able to apply the concept from GM Judit Polgar, in her game against Anand.  The idea is that you're adding a defender.  So, now, black can take my B, but then I would take back, and would pin that Q by liquidation.",
        "13... Bd6": "At this point, he said, \"I have a bunch of unused analyze the game features so if you find one of our games worth keeping let me know I think i see your attack forming so I am moving my rooks in to the center and changing as much as possible in the time I have so your attack will have to adjust to the moves.\"  Maybe, but first, always expect your opponents to find the best moves.  Though, this was good for the same reasons that he was thinking about adjusting, but your opponents plans are just as important as your own, so one needs to be weary of what the opponent will do.  The idea is expecting him or her to find the best moves and not assume anything.  Now, I wasn't going to say anything because no matter what black played, I was still going to take his LSB, even if he took my DSB, but this moral, in general, however, is very important and can make a big difference in his or her games.  But, this move, however, loses a piece.  Best, here, was 13...fxg5, and after 14.Qxe6, although it's liquidation it's still an even exchange as there was no other way to avoid the loss of another piece.   ",
        "14. Qxe6": "Believe it or not, I was thinking of a different position and gave him HW of why 13...Kf7, or 13...Kd7 was better and how the piece was protected before the solution.  But, @perrinn: This time, I was wrong none of them would've helped or prevented the loss of another piece.  I was thinking of a position later on and kind of got mixed up where I was, which happens a little more often the it appears.  So, best was what I noted a move earlier, that is 13...fxg5",
        "14... Bb4": "?? I understand the intention, though, which is to win that R for a B, in compensation.  That is generally a good idea when behind, and I remember playing like this.  And, it is good to be aggressive, but in situations like this, one must think, defensively, as opposed to, offensively.  That B should've remained, or if he played ...c5 earlier, this move would've been safe.  But, the problem is that now I will play my next move, as if black had played the Domino Defense and took the N, but in a much worse concept.  And, that's because move loses another P and his Q for a R because after I take his pawn, that Q is directly pinned by my R.  Now, I actually applied this concept from the Domino plus my last game with jstevens1 and one from ubermensch43 where they won by getting that pin on my Q.  But, I am very glad that perrinn does not resign, so he does have the right approach.  The idea is, \"Fight til the End\", as mentioned in my last annotation.",
        "15. Qxc6+ Kf7 16. Rxe7+ Bxe7 17. Bf4": "However, I am not going to giving him a chance of counterplay, though.  So, I am going to keep what I have won, unless I have a reason for giving something away.  Actually, in this position, I remembered the mistake I made against superandy, where I was up material, but wasn't careful and lost my Q.  Despite that swindle, it's generally not a good idea to make that mistake against someone that you're training as the idea becomes getting a second chance, which is not a good moral as I learned from the realjimfriar in the WTWLTR club.",
        "17... Rad8": "At this point, perrinn smiled.  But, I know why, and in the past, I used to miss this threat.  But, he is threatening a Back Rank mate, which would be the reason to give away that pawn.  In other words, the idea was letting me have that pawn, and if I took, he would mate.  But, after the mistake that Jack made by taking my pawn after I was lost, with a R+2 pawns down, and 2 passed pawns, one which nearly promoted, like that game with archduke_piccolo but then losing right away by taking another pawn, I was not going to make that mistake.  So, I told him that I see and know his intentions, but I don't have to allow mate because, as noted, the idea is expecting your opponent to find the best move.  Now, there are ways that I can get out of it with good moves like opening up.  But, this time, and I going by what I read from GM Susan Polgar outlined, as opposed to what Isaiah had to say or anything else but have known for a while and always teach my students, anyway, when you see a good move, look for something better.",
        "18. Nc3": "So, I prevent mate with this move.  And, the reason I played this, as opposed to, opening up is that this move completes development.",
        "18... Rhg8": "I don't why he played this, but my guess is to put pressure on the K.  ",
        "19. Qc4+": "But, this time, I'm not going to take right away.  Yes, I had to assume that he'd find the best move.  However, I was quizzing him to see if he would find the right response, for if he did, then I would take with 20.Qxc7",
        "19... Ke8": "?? Unfortunately, he did not pass the test.  Now, do you remember where I quizzed him about moving the K, and inadvertently gave him the HW for move 13.  Well, it was actually meant for this move, and better was 19...Kg7 or 19...Kf8, as this move loses a R.  I actually told him that those two were better moves.",
        "20. Qxg8+ Bf8": "? The idea was to intercete a piece, rather then move the K in an uncomfortable.  And, Jack has told me that, in general, you want to intercede pieces to get out of check, rather then move the K where it would be exposed, but the K should've moves and the reason being is that his c pawn was still hanging.  So, this move loses another pawn.  The only other move was 20...Kd7 and that would've been better as there would be another defender to c7.  Therefore, this loses a pawn.",
        "21. Bxc7 Ke7": "Not completely sure why he played, but unfortunately, I hate to say this, but there aren't any good moves for black, at this point.  So, he is doing what he can and staying in until the end.  Now, most people would get angry and say that he should resign.  But, I disagree with that.  In fact, his attitude is very good, and I'm glad he is playing on.  @perrinn: Doing what you are here, in general, believe it or not, might allow you to pull swindles, win or draw lost positions, should the opponent make a mistake.  And, by staying in, you are learning more.",
        "22. Bxd8+": "Meanwhile, I waste no time in grabbing his other R.  Now, in the past I would miss this opportunity, paradoxically.  But, that is where I went wrong in my epic and historic game against Jack, where I was way ahead, and had even won a Q for his R, like I did here.  And, towards the end, but not as much ahead, this was the exchange, well not exactly in the same situation, but the kind of exchange I missed, that is, R for B, where I could've grabbed his R.  By doing that, he was able to gain all of his advantages and pull a swindle against me where he won with passed pawn.  The reason why that was epic was that's where I discovered how important chess is in life, that you must think and plan ahead.  The idea is that when liquidating, you are planning ahead because it's about how to keep your advantages and do further damages, until you have an overwhelming advantage.  So, this time, unlike that game, I was not going to make the same mistake, so I took.",
        "22... Ke8": "?? I think the idea was getting the K back to it's comfortable square.  But, best was 22...Kxd8, yes he'd still lose a R for B, but with this move, that R is free.  ",
        "23. Rd1": "So, this is how I protect, and the idea is that instead of retreating, I will put pressure right on his K.  I have studied a bit of GM games, and what I see most of them, when a position like this happens, and you have an advantage, instead of moving the attacked piece, they put pressure right on the attacker.  From that, I figured out that it is, in general, the quickest way to win.  I know because I analyzed this move, and it does more then just protect.  With that pressure on the K, I now have a mate in 3, no matter what black does, this time.  And, that's because his K is and DSB are pinned.  Well, technically, the K isn't pinned, but the reason I say so, what I allude, is by the general definition of a pin since that the K can't move, and in order to avoid mate, it would have to do so.  And, were the B not pinned, he would be able to prevent an immediate mate with 23...Be7, but since both are pinned, there's no way out.",
        "23... h5": "Might as well, protect the pawn.  It's like with Jack, when I had and did mate him, no matter what.  So, he took a piece, but he said, \"I might as well since I can't do anything, anyway.\"  And, I still like his willingness to continue and his effort.",
        "24. Qe6+ Be7 25. Qxe7#": "Overall, perrinn played extremely well.  In fact, about 150 points north of his rating, so like an 1100 rated player.  But, the morals as I told him are, to expect that your opponent will find the best move and not make any assumptions, ask yourself if there is a threat like checkmate or lost of material, and how by doing HW with Analyze the Board, which btw, is why teachers will often give those HW assignments because it's good practice.  In addition, this is also the reason that why is the most common chess question.  It's about theory because that's where you analyze what move works or doesn't and why, such as what I noted about the threats.  To look at everything and study the position very carefully, the same way, as you evaluate the threats, so part of the same thing.  When you find a good move, look for something better.  Also, when evaluating, and you have plans remembering that your opponents plans are just as important as your own.  Last but not least, when you have an opportunity, like getting a piece back, as it was with the B early, take advantage of it while it's around.  That's because opportunites don't last that long, and if you don't take advantage early, you might wind up in trouble.  @perrinn: You're rating will improve before you know it, but if you can remember these morals, I think your rating will reach 1100 in about 6 months. "
    },
    "url": "https://gameknot.com/annotation.pl/mentoring-game?gm=57282",
    "gameName": "Mentoring Game",
    "players": "jkarp (1275) vs. perrinnn (951)",
    "opening": "Petrov (C43), modern (Steinitz) attack"
}