{
    "moves": {
        "1. e4": "Like last time, I play my favorite opening against her.",
        "1... e5": "Likewise, Sue responds the same way.",
        "2. Nf3 Nc6": "Now, I had anticipated 2...Nf6, in which case, I'd play 3.Nc3 because that's how she responded, the last time.  But, know, as noted in, \"The Deeper Chess Theory Club\", my student also knows about the Ruy Lopez.  And, that is how I'm going to respond.",
        "3. Bb5 Nf6": "Nothing wrong with this move, as it develops.  But, the most common response is 3...a6, and then comes 4.Ba4, and after 4...b5, 5.Bb3  However, when in doubt, it's good to develop.",
        "4. Nc3": "So, I continue with my development.",
        "4... Bb4": "And, Sue goes after my Nc3  I figured that there is nothing to worry about because this isn't pinned.  But, later on, it is going to become dangerous, as we will see.",
        "5. O-O": "Not worried about this, I castle.",
        "5... O-O": "So, does she.",
        "6. d4": "Now, I am looking at an exchange variation which is very common, and that is where I'm bound to start mentoring her.  ",
        "6... Re8": "?! Although it's not a mistake, I told her that this was a slight a inaccuracy.  So, this was where the mentoring begins.  The idea being that I didn't say anything because of well knightrider was playing, but she asked to mentor.  As a result, when I saw a slight inaccuracy, that's when I'd start.  Therefore, I said that, although this does protect her e5 pawn there was a better move.  As Homework, I asked her to find it, but I did it using the charleshiggie method as I've been mentored in his annotations.  So, I showed her the position, just before this move, so right after 6.d4, asking how black should proceed.  Her first guess was 6...d6, preparing to develop her Bc8.  I told her, in general, that would be, but in this position there was a slightly better move.  Then, she guessed  d5,, Nexd5 Nxe5, QXe5 and I told her that she was very close, but it wasn't close because the move would lose a pawn.  After that, knightrider62 said she couldn't find it, so I said that best was 6...exd4, and after 7.Nxd4, Nxd4 8.Qxd4 we have the exchange variation.  But, with this move...",
        "7. d5": "I was going to drive the N back.  The idea being is that black has lost tempo as her Nc5, will be forced to move again.  And, I will be able to use that time to develop another piece.",
        "7... Ne7": "? At first, I told her that this was a mistake.  The reason is interference, as now, her Re8 is blocked by her own Knight.  Therefore, this was going to win a pawn.  So, as, Homework, I asked went back, right after 7.d5 was played and asked her to find the best move.  It was a quiz, but I overlooked something which is how she got the right answer.  In it, Sue said that what she analyzed is that, if I took the pawn, she'd take it back or, I'd lose a piece.  She was right, which I mentioned, and thus, ammended the other comment.  What I missed was after 8.Nxe5, 8...Bxc3, 9.bxc3, and without my Nc3 there, she could take with 9...Nxe4.",
        "8. Nxe5": "Yet, I still take.",
        "8... a6": "To my surprise, this is the move she analyzed.",
        "9. Qd4": "?? But, that's where I made a terrible blunder, and only realized it afterwards.  In part, what happened at work got to me here, but I'm still angry with myself for making the terrible mistake.  The idea being, as kenfiore_3 pointed out is that a teacher is not supposed to give the student an advantage like this.  First, I played this, in part because I thought that this eliminated the possibility of ...Bxc3 followed by bxc3, which would get back a pawn.  And, I, at first, thought that if she took, and I recaptured it was still even.  But, that isn't so.  It is still possible, and in the after she will play 10...axb5  @Sue: I kept this a secret, but it's now important for you to know.  The main reason this happened was Flip Coin Chess (where you don't take enough time to analyze) and I realized this before 9...Bxc3.  It happened while visualizing the position, once I logged off, that's when I realized what I had done.  What happened at work is that 5 people got sick, and thus, had to call out that week.  Normally, I can just get over it since it would happen once and then we move on.  But, those 5 days were in a row, and three times, we were short.  Of those times, I wound up having to suffer twice since I was on.  Not having enough staff is very stressful, but I should not have allowed this to get to me.  Instead, it should've been put aside, so the focus could be on chess.  With that you did an excellent job in taking advantage of my mistake.  And, for a while, it will be very difficult, as I will struggle to find counterplay.  This will not only take visualization at work, but I'll be forced to visualize at spin.  In fact, let's compare, because there are levels of gear and then speed.  The scale ranges from 1-10 with 10 being the highest gear.  Of those number, I had to crank up the gear to 8.5-9 with the equivalent of a fast sprint, to think about what to do here.",
        "9... Bxc3 10. bxc3 axb5 11. Re1": "Yet, chess is not easy, which is something I also wanted this student to learn.  So, with that being said, I am thinking along the lines of TA's Q sacs where he wins, after giving up his Q for the f2 or f7 pawn.  Therefore, I realized that against this student, I might be able to get counterplay, as I did with superandy when I blundered my Queen early.  I also realize that she might not allow me to get counterplay and should even win.  Bearing in mind that I could lose, if it was going to happen, I was not going to make easy for knightrider to win.  The idea is that a student could learn, even if they won, but you must make it very difficult, as easy19 does this.  That's what happened with Mary.  When I coached, she won but also learned and something important became second nature, due to how difficult I made it for her.",
        "11... d6": "I figured that she'd go after my N which is also why I played 11.Re1  The idea being was, after pulling back, e4-e5, and then after exchanging pawns, responding with d5-d6, and after exchanging, playing Qc5, at some point, when it's safe to do so.  It's worth noting that I'm following the same strategies that archduke_piccolo used against redfoxrising to win a similar position like this.  Like me he was also clinging, believe it or not, as he, I believe, lost a Rook for Knight.  So, likewise, he got aggressive, and didn't hold anything back.  In doing so, Ron only made one mistake but lost.  And, we must also keep in mind that I have learned from ION, and he is also one reason why I'm able to coach and mentor players, as he does things like the legendary Jack Stockel.  So, his style of teaching is also similar to my style of learning.  Therefore, we also think alike.",
        "12. Nf3 Bg4": "Going after my Nf3.  But, there is also the possibly of 13...Bxf3, 14.gxf3 not only liquidating, but also, leaving me with a bad pawn structure around my Kg1.  At that, I'd be in worse shape.",
        "13. Bg5": "As I didn't think my position would improve, I just went for it.  So, when she does take, I'll take back.  Yes, if she doesn't find the right response, I will get a pawn back.  But, if Sue does, then I wind up in trouble, as I'll be forced to liquidate further, on top of what I noted earlier, with my Kg1.",
        "13... Bxf3 14. Bxf6 Bg4": "After the blunder, I stopped mentoring, shortly, as Sue was playing flawless, until here.  But, this is where it resumes.  Like before, I went back to 14.Bxf6, but this time, I did something different.  I followed another method from tactical-abyss and my student analyze and play the moves, as though, I were playing as black.  That's because in his visualization thread, which is, more or less the same way I do it, he said the same thing that stalhandske made me do as Homework at WTWLTR.  When I suggested a move, he made me play, as if the opponent's move to figure out why that move was bad.  The moral there is also playing as your opponent so that you learn.  But, this time, she got the answer.  In it, I said,  You are playing extremely well, and after the blunder I made, a few days ago, which lost a piece for a pawn, it was a struggle for me to get back in the game. However, after I played 14.Bxf6, you responded with 14...Bg4 The problem is that, with this move, I can get a pawn back  So, going back in time, before your retreat but after my capture, I was thinking of something different. It is good practice, as well, as per TA's suggestion which is playing on the opposite side (from the opponent's POV.) So, let's suppose that I were playing as black. In this position, how would I have responded, to prevent this?  And, she accurately said 14...gxf6, leading to 15.gxf3.",
        "15. Bxg7 Ng6": "On good thing, which is important note is, that her N is now in a good spot.  Therefore, I view as the best move.",
        "16. f3": "Due to being down a pawn, I'm still doing anything to get something back.  But, at the same time, I asked myself if there were threats, before playing this.  The reason I played 16.f3, as opposed to, 16.h3, is because I knew that Sue would find the right response.  And, when she does, I wind up with a more solid pawn chain.",
        "16... Bd7 17. Bf6": "Still doing about anything, I come right after her Q.",
        "17... Ne7": "? What I said was I understand why you played this. The idea being to protect your Queen. But, as we're about to see, black is going to wind up in some trouble because your Knight on g6 added some protection. By moving it, that changes. Therefore, I'm not sure what the best move was, but much better was 17...Qc8, or 17...Qb8  @Sue: The reason being is that with my next, I will equalize (fully recompensate for lost material.)  That is because your Ne7 is indirectly pinned to your Queen.",
        "18. Bh8 f6": "! Best, as it's the only move to prevent mate without losing material.  @Sue: I'd like to look at something else, which I also visualized, at work.  The only option, aside from that was 18...Nf5, but then 19.exf5, and if 19...Rxe1!, 20.Rxe1, so not only have you lost a piece.  But, I would have further liquidated. ",
        "19. Bxf6 Kf7": "Preventing 20.Bh8",
        "20. Bg7": "So, I create a similar threat, of my own.  I am interested in how she'll respond.",
        "20... Ng8": "Preventing mate, but I told her that this was a mistake, as I visualized and, thus, calculated variations that would lose a Rook to prevent mate.  But, there was just one move move that I overlooked, but that was before she found it.  So, I edited that.  Therefore, I, at first, said, ?? While this move prevents mate, it is, however, a blunder, believe it or not. There is another place the Knight could have gone to stop the threat. Therefore, what was the best move?  And, she accurately guessed 20...Ng6  After, seeing what I overlooked, I changed it to, Yes, that was slightly better. Though, I overlooked one thing as there is still a way around the loss of material which she finds, after I threaten Qg7#  That is, especially since the pin is broken.",
        "21. Bh8 Nf6 22. Bxf6 Qc8": "?? Now, I didn't have to give her Homework here because Sue accurately told me that she made a blunder.  When, I analyzed I realized, yes it was.  So, I added something to introduce my student to the concept of studying variations as that is how one improves.  In it, I said, Yes, it was. Best was, as you might guess, 22...Qxf6, and then would come 23.Qxf6+, Kxf6, after which it's even.  But, with this move, black will be a piece down.",
        "23. Bg5": "The idea here was to threaten mate my next move which would do damage.",
        "23... c6": "?? Therefore, this is a blunder.  In it, I said, \"?? I know why you played this, Sue. The idea was to exchange on c6. But, there was a danger that got overlooked. I'm not sure, exactly, what the best move would've been, but your King ought to have moved. With this move, however, black winds up in serious trouble.\"  I wasn't going to state it directly, as otherwise, knightrider62 might get nervous, and therefore, would make more mistakes.  I also did not want her to feel rushed because, sometimes, one doesn't mean it, but when directly state the fact it makes the other person feel rushed.  I know because I made that mistake.  But, what I'm implying, without having that happen, is that this move will cost her a Rook+Queen for a Bishop. ",
        "24. Qf6+": "And, it starts here.",
        "24... Kg8": "As this move is forced.",
        "25. Bh6": "And, this was the plan behind 24.Qf6+ the idea being, as noted, that Sue will have to face ruinous loss of material to prevent mate.  ",
        "25... b4": "?? But, she made this grave error.  So, this time, I calculated variations and directly stated the facts by saying, ?? This loses immeidately, as now, I will mate you. There was only one move that could've kept you in longer, and it was 25...Re7 Yes, you would lose a Rook after 26.Qxe7, and to prevent mate after that, the only option would be 26...Qf8, with 27.Bxf8, Kxf8. So, in addition to the Rook, you'd also lose the Queen for a bishop. But, that is also why 23...c6?? was a blunder. Instead, 23...Kf8, or 23...Kg8 were needed. No good would've been 23...Kg6 because of 24.Qf6# But, yes moving the pawn to c6 got you in a lot of trouble, and by advancing the b pawn it was mate. A good lesson is to evaluate what works or not. When looking at moves, try and figure the big picture about how things are unfolding and where the real danger. Missing that could put you in trouble.",
        "26. Qg7#": "At this point, I summed it all up by saying, Overall, you did play very well and are improving, but I left notes from the game chat right before mate. As noted, it is important to see the big picture on what's going in the game and how it's unfolding. There were threats that were overlooked by advancing the c pawn, which from there, things went downhill, as I'd now get a Rook+Queen for a Bishop. And, by advancing the b pawn, it was mate. Remembering those things will help you improve, but your play was about 250 points north of your rating.  So, she said, \"Thanks joe, I really think I played badly towards the end of the game though. Usually I look at the board several times between moves but I failed to do this and moved to quickly on my moves.\"  And, I responded by saying, Your welcome, and I understand that feeling, too well. Something like this happened to me a few weeks ago when coaching Mary as I was running low on time. And, I made a terrible blunder that lost, in a won position. But, that's how we learn, and I agree that taking your time is the way to go.  However, @Sue: From beginning to the end, so the entire, time it is important to look at everything and take your time.  Even when one has the advantage, analysis is still needed because, if you fail to do that and let your guard down, he or she still can take advantage and win.  A perfect example, as noted earlier in the annotation is TA's Queen Sacs."
    },
    "url": "https://gameknot.com/annotation.pl/mentoring-game-3?gm=60205",
    "gameName": "Mentoring Game 3",
    "players": "jkarp (1347) vs. knightrider62 (999)",
    "opening": "Ruy Lopez (C65), Berlin defence"
}