{
    "moves": {
        "1. e4": "So, I start off with the usual King's Pawn Opening.",
        "1... e5": "And, this is how responds.  While I did not mention this, I kept it in mind that she also could have responded with the Siclian 1...c5.  However, what I told her was that this is the best move.  The reason that I omitted the Siclian is because the Master Mater told me that it would be very difficult for a student to learn the Siclian, but that it's pretty easy to respond with the Kings Pawn Game.  The reason being is that one should learn the basics first, and I absolutely agree with his assessment.  That's because when I first started and had a rating of sub 800, the first thing I was taught was the King's Pawn Game, but I did not get familiar with it quickly.  Before I could, Jack Stockel taught and made me become familiar with the Siclian Defense.  We just kept drilling it together, until I became accustomed.  But, it took me a month to get the variations correct.  And, it usually does not take more then two weeks to accurately remember the moves of the opening.  \n",
        "2. Nf3": "So, I decide to continue with the most common variation, and what I really seek is to develop and prepare to castle Kingside.  That's because I'm hoping that it will set a good remodel for my student.  And, that will happen later on.",
        "2... Nf6": "While this was perfectly normal, I was hoping for 2...Nc6, instead so that she could get used to the Ruy Lopez.  But, that is also about to happen.  However, I decided not to make any comments about what I'm saying because this is a perfectly normal developing move.  And, that's what I want her to start doing, as it will lead to improvement.  I know this from past experience.  So, I instead, told her that this is a solid move as it develops, and that she is already playing extremely well, so far.  Normally, I won't say this so early because anything can change.  But, in addition to the mentoring, I wanted to give Erica encouragement and build her optimisum in order to delay and reduce her Fight or Flight.  In my mind, a good mentor and/or coach should always give the student encouragement and optimisum because that's what needed to improve your play.   ",
        "3. Nc3": "So, I decide to play this.  Fist, my goal is to prevent and even exchange with the e pawn.  The reason being that I've had bad luck with it.  Second, as noted earlier, I'm trying to set a good example so that she will respond with, pretty much, the same move.  That's because as I learned with Mr. Arboite, Jack Stockel's assistant at the time, sometimes black will copy the same moves that white makes during the beginning.  And, that is about to happen on Erika's next move. ",
        "3... Nc6 4. Bb5": "And, that's exactly what I wanted so that she would get used to playing against the Ruy Lopez.  The moral to this is that you expect the unexpected and that you never know what the opponent is going.  So, you have to plan ahead and be ready for anything that might come at you.  I realize that this is a good way for her to learn this since it is a one on one training sessions.  The more she can handle, the better she'll become.  Right now, I am very impressed with the way black is playing.",
        "4... Bd6": "! I was very impressed with this move.  In fact, I told her that is was a very good developing move.  Normally, I would not mark with an exclamation point because better was 4...Bc5.  That's because the Master Mater told me that it's a good idea to place the B on the spot that covers the most squares.  However, this move is an exception and it's something I don't really care about for my student.  The reason I gave it this marking is because it's another developing move.  Having said, black is better developed then I have ever seen in her previous games.  In other words, black developed more of her minor pieces, then normal.  And, that already shows significant improvements by reachforgold. ",
        "5. O-O": "So, I am ready to go to the next step by castling.  And like before, I am trying to remodel her am about to be successful as she is going to castle as well.",
        "5... O-O": "! Now, I told her that this is another good move.  In fact, this is best.  I told her that the reason behind it is because you generally want to castle ASAP in your games because King safety is important.  And, I mentioned something that Judit Polgar said.  What was it?  In general, you want to complete development by castling, so I let her alone that this was another developing move from him.  And, now I give her a compliment which is absolutely important.  I accurately pointed that she has not made any mistakes or errors.  But, why is this important?  Well, normally at this point, black already would have made at least one mistake.  The fact she's managed to hold her own says a lot about this player.  ",
        "6. d4": "So, I decided to kick things up.  Unfortunately, this time, I made a mistake with advice.  I miscalculated and told her that looking out for pins is important and that I had the potential to pin her g5 N.  At the time, I thought that the pin was serious, but a second look shows that it isn't.",
        "6... Nxe4": "?? This is when Erika asked, \"What pin?\"  Until, I gave advice, I had no idea that it would backfire.  But, then I realized that I can take back with 7.Nxe4.  And for that, @reachforgold: I'm sorry and do for miscalculating with this kind of advice.  But, now there's something to learn from it.  Don't always go by what someone tells.  Although there usually accurate they can also make a mistake.  As someone once said, \"Not everything someone says to you is correct, therefore, you also need to analyze the position and decide for yourself.\"  In addition, although I want to encourage and inspire her, sometimes giving too much advice can be just, as unhelpful as, not studying or reviewing the position with the student.  It goes with the saying, that much of a good thing can become bad.  So, at this point, although I give some, I stop giving a lot of advice because I don't want to mix her up.",
        "7. Nxe4 Na5": "?! I told Erika that I understand the logic behind this move.  She is trying to avoid an exchange since black's behind in material.  That's generally and she has the right idea.  But, in general, a knight on the rim is grim as that discouraging coach told me.  So, normally that's the one principle that I don't emphasize or care too much about, but this is an exception because I can win another piece, if 8.Bd2.  However, white is not going to play that because I have better plans instead.  But, this is the last time, where I give advice just because my student has moved, and it's my turn to do so.",
        "8. dxe5": "That's right.  I decide to test her because this is what mentoring is about.  I want to see, if she'll make the capture or figure out that it's a mistake to do that.",
        "8... Bxe5": "?? But she does that.  That's because she wants to avoid losing more material.  Now, I told Erika, that this move is understandable, and that in this position she is trying to avoid losing more material.  I absolutely like that because it shows that she's thinking.  But, I accurately pointed that she missed the big picture, and that this move is actually a serious blunder.  That's because white wins a free piece after 9.Nxe5.  So, I taught her two things.  First, there are occasions where, \"To take is a mistake\", and that applies with this move.  Second, but most importantly, you always have to look ahead, in terms of, what you're opponent is thinking.  And, this is why it's important to think more then one step ahead.  I know it's difficult to do, but that's important to learn.  The reason being is that your opponents plans and opportunities are just as important as your own.  So, before recapturing or responding ask yourself, what does my opponent have in plan for me?  And, what will happen, if I play this?  In other words, what are the consequences of this move? ",
        "9. Nxe5 d6": "! So, she decides to kick my N.  Believe it or not , I view this as a solid move because it shows that after what I said, Erika is starting to think ahead.  I mean, this the kind of thing that I would always do.  The only thing to learn is, that @Erika: don't just attack material for the thrill of it.  But, I like your thought process in this game.",
        "10. Nc4 Bf5": "Instead of reattacking my N, she could have defended her remaining piece that currently stands on the rim.  Although I missed the opportunity to exchange her remaining N, I won't do it this time.  However, in this case, I don't mind missing an opportunity because it means that she had another chance to fix her mistake.  Although I don't try for this, I always like it when my students get a second chance to correct their mistakes.  Because if the student does this, then he or she has learned something.  Unfortunately, as I just mentioned, that will not be the case here.  However, @Erika: the moral of this is to take advantage of your second chances and opportunities while they exist.",
        "11. Nxa5 Bxe4 12. Bd3": "So, I decide to attempt another exchange, but this is another test.  This time, however, she passes the test.  Erika sees that I am threatening, and instead of taking black decides to retreat.  If she had failed, I would have pointed out the problem.  The lesson that my student learned is that it's generally a bad idea to exchange when you're behind.  Why?  Because it gives you less material then he or she needs since the attacks become overwhelming.",
        "12... Bd5 13. Qh5": "Since I am almost completely developed, I decide to bring the Q out.  Normally, I wouldn't threaten mate in one like this because it's generally not a good idea to do something so obvious that could be driven off.  This, however, is the exception because I am giving her, yet another test to my opponent.  Why?  From some of Erika's past games and annotations, I see that this is another weakness that needs to be improved.  For example, in one particular Erika's opponent got a SM against her because she missed the threat.  So, making moves like this will actually help her.  I want black to see the obvious attacks and threats, so that she knows what to do in situations like this.  This is part of me trying to teach reachforgold  to look ahead, and start seeing what the opponent.  That way, you can defend against threats, like this.  ",
        "13... g6": "And, the good news is that she just passed my test with flying color.  The only disadvantage is that no matter what black had played, her LSB is gone when Erika is already behind.  ",
        "14. Qxd5 c6": "! So, black hit's on my Q again.  Normally, I would view this move as a waste of time and would therefore mark it as a ?!, but not this time.  The fact that black is attacking it, proves that Erika is starting to think ahead, so I am extremely proud of her.",
        "15. Qf3": "Now, I could have forced a Q exchange and won a pawn with 15.Nb7, but I decided to hold off on it.  That's because I realize that this move could make for an interesting position.  Why?  When I prevent similar mating threats with Mr. Stockel, he often plays moves like this, where he puts pressure on my P closest to the R.  So, you wind up with a position like this.",
        "15... b6": "? Ok, I understand why she made this move.  Erika decides to launch another attack, but I accurately told her that this is a mistake.  The reason being is that it loses another pawn.  But, there is a lesson to learn from this, as I pointed out.  With this, I stated that you have to ask yourself what the opponent is attacking, and will a move lose material and what your opponent is threatening to do.  And, is there anything you can do about it.  In that, better was 15...Qb8, or 15...Rb8.  ",
        "16. Nxc6 Qe8": "But, that advice helped because she saw my intentions, this time.  Erika realized that I was attacking her Q, so she had to do something in order to defend it.",
        "17. Bb5": "So now, I decide to kick things up by putting pressure on the same piece that she just defended.  Why?  If 18.Nd4 we have a discovered attack on the Q.",
        "17... a6": "But amazingly, she sees this and reacts.  @Erica: That is the best move, in this position.  This what I'm talking about, in terms of seeing the attack and your opponents plans.  With that in mind, I realize that black is now learning from her mistakes.",
        "18. Bd3": "So, I have no choice but to retreat.",
        "18... Qxc6": "?? With that in mind, I know why black moved here.  She thought that this would win back a piece, and I can see why because until recently I made a similar mistake to this.  So, I said that this is a serious blunder. And, as they say, \"To take is a mistake\" because of my next move. In this position, what am I going to play?  She said, \"take the queen and then i could take your queen with my pawn\".  And, I replied, Yes, I take the Q. But, the Queen is free, after I play Qxc6. In fact, not only does it win the Q, but you mentioned about retaking with the pawn. The last move also loses a P because of my fork on d6 and b6. Now, a fork occurs when two things are attacked by a pawn or piece. ",
        "19. Qxc6 Rad8": "? I understand that black was worried about losing her a R.  But, that's not really a concern, because she has her other R on the same rank, so @Erika: if you left it there and I had played then 20.Qxa8??, you would immediately win my Q back with 20...Rxa8.  No matter what black does, she will lose a pawn.  And, there is nothing that can be done about it, this time.  That's because had it not been the rook move, but she played something like b5 to defend the pawn, I would then take with the immediate 20.Qxd6.",
        "20. Bxa6 d5": "My guess is that black move here because she was worried about losing d5 pawn.  But, @Erika: This is not a concern because like before, your R is defended by the same R.  Like before, however, no matter what she played her b pawn is gone as well, and there is nothing that could be done to defend both b and d pawns because if she played 20...Rb8, then I would take with 21.Qxd6, instead.",
        "21. Qxb6 Rdc8": "?? In this position, she is trying win back a pawn with this move.  But, @Erika: This move is a blunder, because it is going to lose your c8 R, for my LSB.  First, it's not an even exchange because a R is generally worth more then a B.  Second, but most importantly, you are down in material, and this move holds you further.  Now, as I mentioned earlier, there's no way for her to catch up, but it is part of a learning experience.  And, what's important is keeping you material when you're behind.  So, although you have learned and gotten better, it's important to remember a couple.  Always think ahead, and see what your opponent can do.",
        "22. Bxc8 Rxc8 23. Bh6": "So, I decide to give her a pawn as it is another test to see if she can handle the situation.  If she passes, however, I will shortly mate after 24.Qf6.  Therefore, either way mate is unavoidable, one way or another.  Consequently, this time, it almost doesn't matter if she does or does not see the threat because, unlike before, there's not much more to learn, at this point.  However, this time, she fails the test by deciding take c2 pawn.  ",
        "23... Rxc2": "Consequently, I now have and will mate in one with 24.Qd8#.  It's also possible that she saw the threat, but also realized that there's almost nothing else to learn, in which case our minds think alike.  So, maybe she figured, that there was nothing to lose by capturing my c pawn because I would mate sooner or later.  ",
        "24. Qd8#": "Right after the capture, and just seconds before this mate, I told my student what a normal coach or mentor would say.  That is, Well, I hope you learned from this game. If you have questions, please feel free to ask. And, if you want to challenge me to another mentoring game, I'll be available next week.  @Erika: The main morals are what I mentioned.  So, in summary, remember that your opponents are just as important as your own.  Always look ahead and ask yourself what the opponent.  Ask yourself if there's anything to look out for like mating threats or loss of material.  With that, always think and plan ahead based on what your opponent can do, so don't let your guard.  Also, some of the things that a coach or mentor tells you, unfortunately, is not always accurate.  Therefore, it's important for you to evaluate and see yourself.  Most importantly, \"Don't get nervous\" and do not hyperfocus on one possibility, like a worst case scenario that might occur.  Always try to see the big picture.  Lastly, \"Don't give up right away\".  In other words, try to stay in the game, as long as, possible.  If you can remember, you will make significant improvements in your games.   "
    },
    "url": "https://gameknot.com/annotation.pl/mentoring-game?gm=51666",
    "gameName": "Mentoring Game",
    "players": "jkarp (1218) vs. reachforgold (852)",
    "opening": "Petrov three knights game (C42)"
}