{
    "moves": {
        "1. e4 e5 2. Nf3 Nf6": "Petrov's defence (C42)",
        "3. Nxe5": "Petrov (C42), French attack",
        "3... Qe7": "Petrov (C42), French attack",
        "4. d4": "Petrov (C42), French attack",
        "4... d5": "Fortfarande Petrov (C42), French attack, men det hade varit statistiskt bättre att spela Nc6. Nu har vit försprånget.",
        "5. exd5 Nxd5": "Petrov (C42), French attack",
        "6. Bc4 c6": "Här upphör Petrov (C42), French attack, och vit har ett övertag med +1.83.",
        "7. O-O": "Här ligger jag rejält efter i utveckling, och vit har alla initiativ möjliga.",
        "7... Nd7 8. Ng4 b5": "Det här bondelyftet är endast skenbart bra, för vits T har en effektiv pinne mot min D runt hörnet.  Bättre hade varit att parera med S7 till antingen b6 eller f6.",
        "9. Bxd5 cxd5": "Vit leder enormt positionellt. Mina pjäser är helt låsta, och ingen vettig attack har jag heller. ",
        "10. Re1": "Här kommer pinnen jag nämnde tidigare, och jag måste förlora material för att rädda situationen.",
        "10... Ne5": "Räddar D, men ligger risigt till totalt.",
        "11. Rxe5 Be6": "Mitt enda rimliga drag.",
        "12. Nc3 f6": "Här hade det varit bättre att avpinna D och flytta henne till d7. Min bondestruktur är åt helvete efter detta drag.",
        "13. Re1 Qd7 14. Nxb5 Be7 15. h3 O-O": "Äntligen. Vit leder fortfarande både materiellt och positionellt, men jag slipper åtminstone bekymra mig för K.",
        "16. a4 Bb4": "Lite lam attack, men jag var trött på att vara defensiv.",
        "17. c3 Ba5": "Behåller kontroll över diagonalen, och inbjuder vit till att luckra upp sin bondestruktur.",
        "18. b4 Bd8": "Backar hem hela vägen,och försöker bygga upp något konstruktivt mot vits kungssida.",
        "19. Bf4 f5": "Inte världens bästa drag, då vits S nu kan placera sig på e5 och kontrollera mitten.",
        "20. Ne5 Qe7 21. Nc6 Qh4": "Ett lamt drag som endast får mig att förlora L på e6. D till d7 hade varit bättre.",
        "22. Bg3 Qg5 23. Rxe6": "Där satte vit in stöten, och nu är han på väg att klassa ut mig.",
        "23... f4 24. h4 Qf5 25. Re5 Qd7 26. Nxd8 Qxd8 27. Bh2 a6 28. Na3 Qxh4 29. Rxd5 f3": "Försöker sätta lite motkraft, och draget är bra. Hans försvar av K hotas en aning, men vit leder givetvis stort ändå.",
        "30. Bg3 Qe4 31. Re5 Qg6 32. gxf3": "Nu har han åtminstone dubbla bönder på f-filen. Förhoppningsvis kan det bli en nackdel för vit längre fram.",
        "32... Ra7 33. Qb3+ Raf7 34. Rae1 Kh8": "Avpinnar K gentemot vits D.",
        "35. f4 h5 36. Re5e6 Rf7f6 37. b5": "Bra för mig att han inte utväxlar T på f6.",
        "37... h4": "Här ligger jag i starkt underläge, och endast chansningar återstår. Försöker ta lite material av honom innan han promoverar en bonde.",
        "38. f5 Qxf5 39. Bxh4": "Här får jag en oväntad chans till utjämning av spelet. En damgaffel mellan hans L och K borde göra susen. Plötsligt är vits enorma övertag på +11.42 reducerat till 0.00, pga detta misstag.",
        "39... Qg4+": "Bra !! Nu vänder vi på steken, och vit är hårt pressad.",
        "40. Bg3 Rf6xf2 41. c4 Rf2f3 42. Re6e3": "Efter en stunds betraktande och prövande upptäckte jag att svarts L måste slås med D och inte med T. Här ligger en matt runt hörnet, men endast om jag slår med D. Annars får vit ett stort övertag igen.",
        "42... Qxg3+": "Sådärja, nu gäller det bara att gå ner med T'na sedan och matta.",
        "43. Kh1 Rf3f1+": "Allt närmare matt.",
        "44. Rxf1 Rxf1#": "Ett snyggt slut, och en fantastisk vändning av partiet vid 39:e draget."
    },
    "url": "https://gameknot.com/annotation.pl/metalwarrior1969s-mini-tournament?gm=28940",
    "gameName": "metalwarrior1969's mini-tournament",
    "players": "arciron (1477) vs. chekof (1210)",
    "opening": "Petrov (C42), French attack"
}