{
    "moves": {
        "1. e4 e5 2. Nf3 Nc6": "The game starts with arguably the most famous position in chess.  Let me note that I truly appreciate all questions, comments, and critiques, particularly in the endgame.  My endgame is the weakest part of my game and I'm trying to improve it, so all helpful tips are greatly appreciated! ",
        "3. Bd3": "This is certainly not typical, and not a strong move.  It blocks the d pawn and gives the bishop no extra room.  ",
        "3... Bc5": "Developing this bishop is usually delayed, but I figured grabbing d4 decisively was a good idea with my opponents d pawn blocked.  d4 is a powerful potential launching pad for my pieces.",
        "4. a3 Nf6 5. b4 Bb6": "All the pawn moves have given black an advantage in development, and superior control of the center. ",
        "6. h3": "Another pawn move...",
        "6... O-O 7. Bb2 d6 8. Qe2": "Another odd move here, the eventual object was to move the white bishop to a more appropriate square, but perhaps either simply moving it to c4 or playing pawn-c4 and then putting the bishop on c2 would have been better.",
        "8... Re8": "Later in the game I regretted this, as I wanted to play f5 and the rook supporting it would have been nice, but I don't know how I could have foreseen this.  I never know what the best thing to do with the rook in these type of positions is.  ",
        "9. Bb5 Bd7 10. Bxc6": "The trade is a mistake in this position, in my opinion.  This causes him to fall behind more in development, and the two bishops will exert a lot of pressure on the center.",
        "10... Bxc6 11. d3 a5": "With my advantage in development I wanted to start an attack, but I didn't see how to work one in the center, so I went for his flank hoping to open the center later.",
        "12. c3 Nh5": "I didn't think that capturing b4 gave me much of an advantage, so instead I threaten to come to f4 and fork the queen and g2 pawn.  I also give my self a powerful move in case of 13. O-O, which my opponent missed.",
        "13. O-O Ng3": "(!) The pawn is pinned to the king and the queen and rook are forked.  This gives me a material edge to compliment my superior center.",
        "14. Qe1 Nxf1 15. Qxf1 f5": "If 16. exf5 Bxf3 17. gxf3 Qg5+, with Qxf3 to follow, undermining his king safety and maintaining my material advantage. ",
        "16. Nbd2": "This was probably the best response.",
        "16... Rf8": "This is why I wish I had left the rook on the f file at the beginning of the game, because now I lose a turn bringing it back.",
        "17. exf5": "Not his best response, it opens up both my f rook and my LSB.",
        "17... Rxf5 18. bxa5": "A good way to bring my DSB away from the center and relieve a little pressure, although the light squares are a bigger problem for schagger right now.",
        "18... Bxa5 19. Nh2 Qg5": "Activating my queen and trying to get a strong kingside attack going.  This has the added bonus of keeping his queen on f1, a remarkably passive square.",
        "20. Ne4 Bxe4": "I debated this for a while.  I hated losing my powerful bishop, but I have always considered chess a game of small advantages, which are gradually translated into powerful, winning positions.  Here I have a small material advantage, and as pieces come off the board that difference becomes larger proportionally, so I figured that any even material trade would benefit me.",
        "21. dxe4 Rf7 22. Bc1 Qg6 23. Qc4": "He gets his queen out, unfortunately, and now a long and somewhat tedious fight begins surrounding the f2 pawn.",
        "23... Kh8": "This is to remove the pin on my rook.",
        "24. Bd2 Bb6": "Pinning the f2 pawn to the king.",
        "25. Be1 Raf8 26. Ra2 Rf7f4": "Trying to switch the attack, while making room for my queen on the f file.",
        "27. Re2 h5": "Guarding against Ng4, which probably should have been played earlier, to activate a lame piece and guard f2.",
        "28. Kf1": "This is a good move.  It weakens my position by forcing me to deal with the potential f3, negating both my threats.",
        "28... Qf7": "Qf6 looks better, but runs into 29. g3, and the rook has nowhere to run.  The queen trade advantages me anyway, for the same reason as the bishop-for-knight trade did.",
        "29. Qxf7 Rf4xf7": "I chose to capture with this rook as it got the rook out of attacking range, and was a little more flexible as it keeps a rook on the back rank who can jump to any file quickly.",
        "30. Nf3": "Getting the knight out of the corner.  Good thinking there.",
        "30... Bc5": "Shifting my attack to the a file.",
        "31. a4 Ra8 32. Ng5 Re7": "I decided that keeping the rook on the 2nd rank was more important than keeping him on the f file.  My hopes on the f file have been crushed, but doubling the rooks on the a file might still have potential.",
        "33. Ra2 b5": "The pawn clearly can't capture, so...",
        "34. a5 c6": "Now I have another supported on the 5th rank, and I'm prepared to double my rooks.",
        "35. f3 Rea7 36. Ne6": "c4 might have been preferable.  Either way a pawn is lost, but in that case white still has a pawn on the 5th rank, and black's rooks are kept behind that pawn.",
        "36... Ra7xa5 37. Rxa5 Rxa5 38. c4 Ra2": "I considered Ra1 to pin the bishop, but the king simply moves.  With this move, the king cannot get off the back rank and will be kept out of the endgame.",
        "39. cxb5 cxb5 40. f4": "This is a good move, but I found that pushing my passed pawn (\"Passed pawns must be pushed.\") was unstoppable.",
        "40... b4 41. fxe5 b3 42. Bc3": "This is the only way to stop the pawn's advance.",
        "42... b2": "My endgame is very weak (not specifically here, but generally).  Perhaps 42. ...Rc2 was better, to try to save the pawn by pushing the bishop off the a1-h8 diagonal?  I don't really know, but this seemed like a safe win to me, so I took it.  ",
        "43. Bxb2 Rxb2 44. Nxc5": "Here, white resigned.  If I had been playing white I think I would have played 44. exd6 Bxd6 and then white might be able to work a draw, but with good play from black, black should still get a win.  Thanks for reading, and I appreciate all comments! "
    },
    "url": "https://gameknot.com/annotation.pl/microflys-mini-tournament-vi?gm=50045",
    "gameName": "microfly's mini-tournament VI",
    "players": "schagger (1462) vs. worvis8 (1497)",
    "opening": "King's pawn game (C44)"
}