{
    "moves": {
        "1. c4": "The English opening... [http://gameknot.com/analyze-board.pl?bd=15639050&fb=1&rnd=0.7226811586879194 <-- computer analysis]\n",
        "1... Nc6": "A quick look at the database tell me that this isn't the usual way to deal with this opening - Nf6 and c5 are the two top options - but the win/loss ratio for Black isn't too significant, so no harm done!\n",
        "2. e4 e5 3. Nc3 Bc5 4. Nf3 Nge7": "!? Simple development... apart from this move! I don't know whether Nf6 may have been better here, but if I had played that, it would have looked like a 'boring' Four Knights opening from my side of the board. Ne7 is passive, but solid enough to be playable, and there's always the g6 square to move to!\n",
        "5. d3": "Opening up a line for the dark-squared bishop...\n",
        "5... O-O": "...while I tuck my king away to safety.\n",
        "6. Bg5": "White pins my knight... \n",
        "6... f6": "...and Black chases it off - though it weakens the light-squared diagonal to my king, White can't do much with his light-squared bishop at the moment, so it's not an immediate problem.\n",
        "7. Bd2 a6": "!? This is the start of a planned queenside pawn expansion - it was the only plan that I had here, and it seemed like a reasonable one as well!\n",
        "8. Be2": "Meanwhile, White continues development - he completes it by castling, whereas I'd complete mine by developing my bishop.\n",
        "8... Rb8": "Preparing a queenside thrust...\n",
        "9. O-O b5": "? and following through with it - though this turns out to be a mistake that was not exploited! White can exchange pawns, then win one with Nxb5, because if Black plays Rxb5 then the discovered attack d4! wins back the material.\n",
        "10. cxb5 axb5 11. a3": "? Fortunately for Black, White doesn't see this [and won't for the next couple of moves] and instead inhibits an advance to b4.\n",
        "11... d5": "Black, meanwhile, lashes out in the centre.\n",
        "12. b4": "White stakes his own claim to queenside...\n",
        "12... Bd4": "...but I simply land my bishop on the d4 square, now an outpost.\n",
        "13. Nxd4": "?! White shouldn't have exchanged here - my bishop wasn't threatening anything, for one thing. Also, Black gets to recapture with his knight and therefore can claim a strong outpost...\n",
        "13... exd4": "?! Though I fall victim to a bit of 'chess blindness' here. For some reason, I didn't see that the knight could capture on d5 and thought that the knight would be confined to either a2 or b1, and that I'd create a nice passed pawn after dxe4. Though this was inferior to the knight capture, it helped set up the foundation for the fireworks later on\n",
        "14. Nxd5 Nxd5 15. exd5 Qxd5 16. Bf3": "After a bit of exchanges, White relocates his bishop with tempo.\n",
        "16... Qd7 17. Qb3+ Kh8 18. Rac1": "White's forces have mobilised quickly, and are better co-ordinated; he definitely has the advantage at this point!\n",
        "18... Ne5": "Bb7 is another option, but this move forces White to react; he won't want doubled pawns!\n",
        "19. Be2": "The only reasonable move\n",
        "19... Bb7 20. Rc5": "The intention here is pretty clear; Rfc1 to pressure the c7 pawn. The best way to defend this pawn would be a rook to c8 [there's also c6, but it restricts my bishop]. However, Black has something else in mind...\n",
        "20... Rfe8": "Setting up a dynamic reply in case Rfc1 is played...can you see it?\n",
        "21. Rfc1 Nc4": "!? Here it is! This protects the c7 pawn by cutting off communication between the rooks, as well as attacking both undefended bishops! It certainly complicates matters, but incredibly GK analysis judges the position to be dead equal!\n",
        "22. Qd1": "! Pretty much forced for White - trading the knight for the e2 bishop, which allows a rook on the seventh rank and a dangerous passed pawn, isn't at all recommended!\n",
        "22... Nb2": "? Black stays aggressive, knowing that taking the a3 pawn will result in the knight being trapped... but unfortunately, after 23.Bg4! followed by 24.Qc2 the knight is still trapped! Gameknot's recommended continutation (23...f5 24.Bxf5 Qxf5 25.Rxf5 Nxd1 26. Rxd1) leaves Black a pawn down. Nxd2 was better here...\n",
        "23. Rc5xc7": "? I had expected White to play Qf1, but he surprises me with this move. I had a long think about what to do here - I saw pretty quickly how Black could win material, but was unsure of the position that resulted from it. I explored a few other options, including GK's recommended Qe6, but all options left Black a pawn down [with Qe6, Black would have a superior position, but I didn't see it at the time]\n",
        "23... Qxc7": "! This is what wins the material - only one point up, but still an advantage!\n",
        "24. Rxc7 Nxd1 25. Bxd1": "Despite the material advantage, I wasn't too comfortable with the position that I had... the main concern being the fact that White had the bishop pair on an open board - I remember a certain Master player on here told me once that two bishops can sometimes be more powerful than a queen!\n",
        "25... Re5": "?! Preparing to double up on the e-file, but analysis preferred Bc8 here, relieving the b8 rook of its defensive duties.\n",
        "26. f4": "Pushing away the rook...\n",
        "26... Re6 27. Kf2": "...and advancing his king, - White also had Bg4, driving the rook off the e-file altogether. If that had happened, Black would probably have played Rc6.\n",
        "27... Bd5": "Bishop centralisation, but the fact that it's undefended makes it a target very shortly...\n",
        "28. g4": "Once again, GK analysis judges the position to be perfectly equal!\n",
        "28... Rbe8": "Doubling up on the e-file...\n",
        "29. Rc5": "...but now it looks like Black's in a bind here! As both the bishop and pawn is attacked, it looks like that pawn will fall. If 29...Bc6?? 30.f5! Rd6 31.Bf4 and the bishop falls. There was, however, a way to preserve the pawn...\n",
        "29... Ba2": "? but this wasn't it! I was thinking of the counter-attack Bb1 after White snaps off the pawn, but then White has Rd5, winning the d5 pawn. I didn't realise that until after I played the move. Better for Black was 29...Bb3! which maintains the material balance, since Black has Re2+ if White captures on b3. If White retreats the bishop instead, then Black has time to defend the pawn with Ba4.\n",
        "30. Rxb5 Ra6": "Black is losing, but he makes a few threats anyway to see if he can get anything out of the position.\n",
        "31. a4": "I was expecting Bc1, but this works better...\n",
        "31... Be6": "Nothing will come out of Bb1, so Black threatens Bd7 instead - White prevents the loss of a pawn with Ra5 but after the exchange White's passed pawns diminish in power.\n",
        "32. a5": "Nothin' doing!\n",
        "32... g6": "Black doesn't want White to play f5 to drive away the bishop.\n",
        "33. Ba4": "?? This is what Black was waiting for - White blunders! He is counting on the discovered attack on the e8 rook but leaves the g4 pawn hanging...\n",
        "33... Bxg4": "...and White needs to deal with the threat of Re2+\n",
        "34. Kg3": "The White king drives away the bishop...\n",
        "34... Bd7": "! but Black has no problem relocating it - here was another flaw in White's plan that could have, but wasn't, ruinous. The bishop on a4 is hanging, and the rook now needs to move to avoid capture. Though White can't defend his bishop...\n",
        "35. Rb6": "! he can take advantage of one of my hanging pieces. White has contained the damage but Black now holds the advantage. \n",
        "35... Rxb6 36. Bxd7 Rd8": "Gameknot preferred Re7... citing the continuation Ba4! White remains a piece down, but has strong counterplay because of his connected passed pawns. I don't know what the alternate rook move does to make this move invalid however...\n",
        "37. axb6": "White doesn't see that possibility and completes the exchange.\n",
        "37... Rxd7 38. f5": "White offers a pawn - now, there's something I wrote on my profile - 'If my opponent has 'given up' material, it's probably not a blunder - there has to be a reason why he'd be willing to let the material go.' \n",
        "38... gxf5": "?? I should check out my own profile more often! That pawn was laced with highly poisonous substances, and taking it has just ruined Black's game! Rb7 would maintain the advantage.\n",
        "39. Bf4": "!! White suddenly threatens to promote his pawn with Bc7, then b7. This makes Black's next move forced...\n",
        "39... Rb7 40. Bc7": "But now Black's rook has been cut off from the rest of the game!\n",
        "40... Kg7": "Black's only active piece now is the king...\n",
        "41. Kf4": "...but that's tied down too!\n",
        "41... Kg6 42. h3": "It's a matter of pawn pushing now, but no matter how Black plays, he will end up in Zugzwang. the king will have to move away from the f5 square, the pawn will be captured and White can then proceed to move the king over to c6 to win the rook. There is no defence to this, so I resign after my next move. Good game White!\n",
        "42... h6 43. b5": ""
    },
    "url": "https://gameknot.com/annotation.pl/middle-game-complications?gm=37925",
    "gameName": "Middle-Game Complications",
    "players": "sonofander_pict (1588) vs. x-machine (1577)",
    "opening": "English opening (A10)"
}