{
    "moves": {
        "1. Nf3 d5 2. c4": "This was a game I won in my reti mini-tournament.   The reti opening is named after Richard Reti and he was one of the top players during 1910s and 1920s.  Born 28 May 1889  in Pezinok (Austrian-Hungarian) and died 6 June 1929.  In New York 1924 Richard Reti played a game against Raul Capablanca which he won.  This was Capablanca's only defeat in 8 years and also the first defeat since becoming world champion. https://www.chess.com/article/view/richard-rti",
        "2... Nf6": "The reti opening starts with Nf3 and white is trying to control the centre without using his 2 centre pawns.   I set up the mini tournament with 1.Nf3 d5, 2. c4 and play then proceeds from there.  I went with nf6 protecting my d5 pawn.  This is a safe move but it keeps black in the centre rather than taking on c4 which would leave a weakness or an open file in the centre of the board giving access to the black king early on.  ",
        "3. e3": "White moves his pawn to e3 allowing his bishop to protect the c4 pawn.",
        "3... Nc6": "Black develops his knight to c6 giving him more central control.",
        "4. Be2": "White develops his LB to e3 and now has access to 2 diagonals and his king can castle.",
        "4... g6": "Black pushes his pawn to g6 to create a fianchetto.",
        "5. O-O": "White castles.",
        "5... e5": "Black pushes his pawn to e5 and is claiming more centre space.",
        "6. h3": "White pushes a pawn to h3 to stop the f6 knight from coming to g4.",
        "6... Bg7": "Black pushes his DB to g7 and now black can castle.",
        "7. a3": "White now pushes another pawn to a3 and so far he has only developed one piece.",
        "7... O-O": "Black castles.",
        "8. b4": "White pushes another pawn to b4 and it seems his attack is going to come from the queen side.",
        "8... Nh5": "Black moves his f3 knight to h5 to allow his queen access to the diagonal to h4 thinking that white's f3 knight may come down to g5 and also ready to begin an attack. Also it allows the f7 pawn to be pushed.  Black needs to be careful as the knight has no safe squares to use on white's side of the board.",
        "9. b5": "White pushes the b pawn up to b5 and is attacking black's c6 knight.",
        "9... Ne7": "Black moves his c6 knight to e7.",
        "10. Bb2": "White moves his DB to b2 and it is now pointing at the g7 square.",
        "10... f6": "Black further fortifies the diagonal to g7 with pawn to f6.",
        "11. Ne1": "White now redirects his f3 knight to e1 as he may see that he is running short of squares to move to without being attacked.  Or he may have wanted to allow his f2 pawn to access the file.",
        "11... Be6": "Black now develops his LB to e6 and has 2 diagonals to access and is also protecting the pawn at d5 but this already has 2 protectors in the e7 knight and d8 queen.",
        "12. g4": "White now attacks the h5 knight with pawn to g4.",
        "12... Kf7": "Black decides his king may need to move away from the corner as he can see the pawns coming down and so the king is moved over to f7.  Not sure this was entirely necessary but it may have been the fact that the LB and queen were in a battery on d1 and e2 pointing at h5.",
        "13. gxh5": "White captures the knight at h5 with g4 pawn.",
        "13... Bxh3": "Black captures the h3 pawn with e6 bishop.",
        "14. Ng2": "Most of whites pieces are still on the back row apart from the bishops which are on the 2nd row but white manages to move his e1 knight to g2 and blocks the LB at h3.",
        "14... g5": "Black pushes a pawn to g5 leaving whites h5 pawn with nothing to attack.  This is now blocking the h file so no attack from white should come down this file.",
        "15. Kh2": "White moves his king to h2 and could take the LB unless this is protected.",
        "15... Qd7": "Black moves his queen to e7 to protect the LB.",
        "16. Qc1": "White brings his queen over to c1 as there is a diagonal from c2 to h7 that can be accessed with the king at f7.",
        "16... b6": "Black now puts a halt on the pawns coming down the b file with pawn to b6.",
        "17. Nc3": "White now develops his knight to c3 attacking the centre.",
        "17... e4": "Black pushes a pawn to e4 which is protected by pawn at d5.",
        "18. cxd5": "White captures the pawn at d5 with his c4 pawn.",
        "18... Bxg2": "Black now captures the knight at g2.",
        "19. Kxg2": "White's king recaptures the LB.",
        "19... Nf5": "Black is furthering his attack on the king and moves his e7 knight to f5.",
        "20. Bg4": "White moves his LB to g4 and has the black queen pinned at d7 with black's knight at f5.",
        "20... Nh4+": "But with black's next move he checks the king so the black queen is safe and can be moved once the white king is out of check.",
        "21. Kh3": "White's king moves to h3 with black knight at h4 but this is protected by the g5 pawn.",
        "21... f5": "Now black moves a pawn to f5 blocking the LB's access to the queen at d7.",
        "22. Qd1": "White moves his queen back to d1 to support the LB at g4.",
        "22... Rae8": "Black brings his a8 rook over to e8 supporting the pawn at e4.",
        "23. f3": "White moves a pawn to f3 to attack the pawn at e4 supported by the rook at f1.",
        "23... Nxf3": "Black captures the pawn at f3 with the h4 knight.",
        "24. Rxf3": "White recaptures the knight with the f1 rook.",
        "24... exf3": "Black recaptures the rook with the pawn at e4.",
        "25. Qxf3": "White captures the pawn with the queen at d1.",
        "25... Kg8": "Black's king moves from f7 to g8 as white's queen is at f3.",
        "26. d3": "White pushes a pawn to d3 which I don't think is a good move with the black rook at e8 because when the pawn was at d2 it was protecting the e3 pawn.  The queen is also alongside the e3 pawn at f3.",
        "26... fxg4+": "Black captures the LB at g4 with the pawn at f5 and is checking the king.  There is a discovered attack on the queen by the rook at f8 now the pawn from f5 is no longer there.",
        "27. Qxg4": "White's queen captures the pawn at g4.  The queens are on the same diagonal and could be exchanged.  But white's queen cannot move as it is now pinned to the king at h3.  So an attack on the king by another piece would mean the white queen would be unable to move away or capture the piece.",
        "27... Rf3+": "Black moves his f8 rook to f3 and checks the king and white has to move the king away which would leave the queen available for black to capture.  So white resigned."
    },
    "url": "https://gameknot.com/annotation.pl/milly64s-reti-mini-tournament-i?gm=62258",
    "gameName": "milly64's reti mini-tournament I",
    "players": "eatpiesallday (1228) vs. milly64 (1057)",
    "opening": "Reti opening (A09)"
}