{
    "moves": {
        "1. e4": "A game in the 106th GameKnot tournament; a trick by White as early as move 6 leaves me two pawns to the good; focus then turns to a passed pawn that I had, me trying to hold on to it while Black tried to get rid of it - he had an opportunity to eliminate said pawn but when he missed it that pawn - along with other pieces - turns out to be Black's downfall!\n",
        "1... e5 2. Nf3 d6": "Philidor's Defence\n",
        "3. d4": "Standard response - in fact the most popular one in the GK database...\n",
        "3... c6": "!? for all intents and purposes unorthadox; the move seems passive and it makes the development of the b8 knight more difficult but Black...doesn't want to see d5? Not exactly - Black has something else in mind that takes this game out of the database altogether!\n",
        "4. Nc3": "Might as well do simple development here...\n",
        "4... Qa5": "?! Puzzling - that square for the queen is normally seen in the Scandinavian Defence (1.e5 d4 2.exd4 Qxd4 3.Nc3 Qa5) which is a hypermodern sort of opening which relies more on counter-attacking than space occupying - I don't think that idea is as effective here!\n",
        "5. Bd2": "Why not? Black's last move was just crying out for this response!\n",
        "5... Qb4": "? The last move was dubious at best but this one's just a mistake; Black's plan I assume was that both d4 and b2 come under threat but never mind dxe5, never mind the development Black has sacrificed for this, never mind the infamous 'poisoned pawn' that b2 may turn out to be White has a trick here!\n",
        "6. Nb5": "! Discovered attack - and it's important that the knight jumps to b5 and not d5 for what I have in mind! The black queen has only one place to go...\n",
        "6... Qxb2": "6...Qa4?? 7.b3 Qa6 8.Nc7+ wins for White\n",
        "7. Bc3": "No Nc7+ here? Of course it was considered but the logic behind this move from my point of view was; 1) the queen is removed from anywhere where she can cause trouble/inconvenience (if the knight went to d5 instead the queen escapes with Qa3) 2) When Black captures the knight the f1 bishop can capture the pawn and 3) There is better value for White point-wise through this sequence than through 7.Nc7+ where the knight will not escape the corner after Kd8\n",
        "7... Qxa1": "Cutting his losses; the queen is gone so the rook goes too!\n",
        "8. Bxa1 cxb5": "A queen for a pawn, minor piece and rook...\n",
        "9. dxe5": "...but not for long! Two pawns are now under threat and as dxe5 is met with Bxb5+ and Nxe5 Black will be losing at least one more pawn at the moment!\n",
        "9... a6": "9...dxe5 10.Bxb5+ Nc6 11.Bxc6+ bxc6 12.Bxe5 has Black three points worse off rather than two - as well as being straddled (admittedly, like White) with two isolated pawns so this move seems the most sensible.\n",
        "10. exd6": "That being said - passed pawn! White will want to keep hold of it and Black will want rid of it; he will also want to castle kingside but his dark-square bishop is hard to develop; the a1 bishop prevents the g-pawn moving! f3, then g3, then Bg7/Bh6 is the only way to do it\n",
        "10... Nd7": "Wary of a future d7+ Black prevents the pawn advancing...\n",
        "11. Ne5": "!? Why not e5? It was probably the better more solid move but thanks to the a1 bishop White has a very real threat of 12.Nxf7! if he's not careful; 11...b6?? 12.Nxf7! Kxf7 13.Qh5+ and from here; [1] 13...Ke6 14.Qd5# or [2] 13...g6 14.Qd5+ Ke8 15.Qe6+ Kd8 16.Bxh8 with an overwhelming advantage for White! \n",
        "11... Nxe5": "! Whether or not Black was aware of that trap this was the best way to deal with it (Nh6 isn't so good as that square is not ideal for the knight) - it's also why 11.e5 was probably better.\n",
        "12. Bxe5 Bd7": "Preventing the pawn advance again - and perhaps setting up 0-0-0? It is never played but I think it would have been a reasonable move especially given how the rook can possibly target d6 after castling!\n",
        "13. Be2": "White can't see an immediate breakthrough so prepares castiing\n",
        "13... f6 14. Bc3 Nh6": "Black kicks away the bishop and prepares a knight jump to f7 - and suddenly the d6 pawn looks to be under threat! How can White respond to this?\n",
        "15. O-O": "?! There was no rush to play this move; 15.e5 would have held on to the pawn. Black can't 'win it' in the sense of getting material back just yet...\n",
        "15... Nf7 16. Bb4 a5 17. Bc5": "The last couple of moves have been forced for White who is still wanting to keep that pawn; Black does however have a move that will get rid of the pawn!\n",
        "17... Rc8": "?! This move is not it; to remove the d6 pawn from the board Black ought to have played 17...b6! 18.Bxb6 Bxd6 19.Qd5 0-0 - White still has the advantage in this position but not one that is immediately fatal; now the d6 pawn becomes the centrepiece of a crushing attack by White!\n",
        "18. Qd5": "!! I believe this move warrants two exclamation points; feel free to say otherwise but this is a dominating position for the queen and now Black's in real trouble; b6 isn't possible anymore because White now has a response; 18...b6 19.Bxb5! bxc5? 20.Bxd7+ Kxd7 21.Qxf7+ Kc6 [Black cannot play 21...Kxd6 because of 22.Rd1+; either 22...Kc6 23.Qd7+ Kb6 24.Rb1+ Ka6 25.Qb7# or 22...Ke5 23.Qd5+ Kf4 24.Qf5#]  22.d7 Rd8 23.Rd1 gives an overwhelming advantage to White!. Taking the bishop also leads to a quick demise - this will soon be explained...\n",
        "18... Ne5": "! As far as I can see the only move to save Black from White's next move - it's possible I've missed something however!\n",
        "19. Bxb5": "! 19...Bxb5?? 20.Qe6+ Kd8 21.Bb6+ Rc7 22.dxc7# - thanks to Black's last move he has one move that will save him as Black still can't allow the bishop to be taken (because if the king recaptures f4 dislodges the knight)\n",
        "19... Nc6": "More or less forced for Black to hang on...\n",
        "20. Bc4": "Checkmate isn't threatened this time but 21.Qf7+ Kd8 22.Bb6+ Rc7 will lose the rook\n",
        "20... Ne5": "One of two ways to cover the f7 square, the other one being Nd8; Black would probably love to get rid of that c4 bishop...\n",
        "21. Bb5": "Okay then, back to c6 you go knight!\n",
        "21... Nc6 22. f4": "! Multipurpose; denies Black the e5 square and now White threatens to get his own pawn there\n",
        "22... g6": "A sign of how hopeless Black's position is; what else can he do?\n",
        "23. Bc4": "the bishop returns to c4...\n",
        "23... Nd8": "...and Black has to play this to avoid losing his rook\n",
        "24. e5": "Onward!\n",
        "24... Bc6": "With the c6 space free Black tries to kick away the queen but by now it is too late...much too late!\n",
        "25. e6": "!! the queen doesn't need to move, and if the bishop takes it 26.d7 mates the king! I wish Black had done that to be honest, it'd have been a pretty sight!\n",
        "25... Bxd6": "Black knows that he is lost here but decides to play through right to the end; the loss of the bishop...\n",
        "26. Qxd6 Rc7": "...the rook....\n",
        "27. Qxc7 Bd7": "...and the other bishop..\n",
        "28. Qxd7#": "...can't prevent mate! Hope you enjoyed this game as much as I did and comments as ever are welcome!\n"
    },
    "url": "https://gameknot.com/annotation.pl/mind-the-pawn?gm=50693",
    "gameName": "Mind the Pawn!",
    "players": "black_cat_hamlet (1492) vs. dazzay (1538)",
    "opening": "Philidor's defence (C41)"
}