{
    "moves": {
        "1. e4 c5": "Sicilian Defence: very popular.",
        "2. Nf3 d6": "This is called the 'Kopec' Variation of the Sicilian.   I very rarely play anything else on move two in this line, but 2...Nc6 is quite popular and playable, whilst 2...e6 I occasionally employ, and 2...Nf6 and 2...g7 are playable lines.",
        "3. Nc3": "Unusual at this point.  White keeps his options open whether to play and Open or Closed Sicilian.  The most popular 'Open' line is usually heralded by 3.d4 cxd4  4.Nxd4 Nf6  5.Nc3.  But Black declines to play 3...Nf6 with the possibility of transposing, on account of 4.e5 - an annoying advance.",
        "3... g6": "Opting for something Dragon-like.  The GK engine doesn't like this move, preferring 3...Nf6  4.d4 cxd4 and transposing onto normal 'open' lines. But White could as well play 4.Bb5ch.  The move played is a little provocative, but in my opinion playable enough.",
        "4. Bc4": "Actually, not bad!  White figures that Black might be reluctant to play 4...e6, and in fact I was.  That pawn advance is OK enough, but I prefer to hold it back for now.  At that 4...e5 would also have been playable for Black, here. ",
        "4... Bg7": "Calmly continuing as planned.  Would White take on f7 right now?  I didn't think it likely...",
        "5. Bxf7+": "(?) I guess the thing had to be tested, but after this White never quite gets enough attack.  I was half-expecting 5.Ng5 when I might well have played 5...e6.  This Bishop sac disrupts Black's King position, but the advantages that accrues aren't enough to square against the loss of the Bishop.  Very occasionally this kind of thing works.  Not this time.",
        "5... Kxf7": "'Show me.'  When examining moves by an opponent to involve him in the loss of material, always take into account he might be on to something good.  But to suppose is not to assume.  If you can't find that your opponent can recoup his material, make him 'show you'.  If he can't, then you have the material advantage.  Here Black really has no choice but to take.",
        "6. Ng5+": "I'm guessing White wanted to get in this check, and hence beef up the pressure on f7, whilst the getting was good.  First off, it makes way for the Queen to get into the game, and allows Black no time to keep him out by ...h6.",
        "6... Ke8": "Chosen to keep the f8-square open for the rook.",
        "7. Nd5": "I'm guessing that White wanted to have something to play against the Black knight that would soon be landing on f6...",
        "7... Nf6 8. Qf3": "Black is quite strongly entrenched against White's cavalry attack.  Strong enough, in fact, that Black feels he can drive White back.",
        "8... h6 9. Nh3 Nxd5": "Now the pressure on f7 has eased off, Black exchanges off White's most active piece.",
        "10. exd5 Rf8": "Now he 'develops' a rook along the half-open f-file.  True, g6 is a tender point, but that can be plastered over...",
        "11. Qg3 Bf5": "Protecting g6, with a secondary objective: the pawn at c2.",
        "12. O-O Nd7": "Preferring to develop an inactive piece than grab an irrelevant pawn.  It seemed more important to protect g6 than capture at c2.",
        "13. Nf4": "Striking at g6 once more.",
        "13... Be5": "Indirect defence: pinning the Knight.  Incidentally, Black his built up an imposing centre with pieces and pawns.  A piece behind, White will find it hard to develop enough resources to penetrate.  All the same, he does get quite close to the Black King eventually...",
        "14. d4": "A pawn sac, possibly hoping to deflect Black's dark-square bishop (DSB).  But Black doesn't mind doubled pawns in a good cause.  Probably 14.d3 was better.",
        "14... cxd4 15. Qh4": "Striking at h6.  Now, Black didn't mind this and had already worked out a kind of trap based upon the possibility that White might go for it.",
        "15... Nc5": "According to plan.  But I looked pretty long at 14..Nf6 as well...",
        "16. Re1": "Just as well.  16.Qxh6 would have lost the Queen: 16...Rh8  17.Qg5 Ne4 and the attacked Queen has no escape.",
        "16... Qb6": "Eyeing f2 and b2 both, but also with the view of bring the King to safety betimes.",
        "17. Qxh6": "(?) This move was still not safe, but at least White will not lose his Queen...",
        "17... Rh8 18. Qg5 Ne4": "The Queen is trapped!",
        "19. Rxe4": "Forced.  It did wonder whether in fact White went for this with his eyes open to the loss of the exchange, in order to batter his way to the Black King.  If so, it was, considering the situation, fairly successful.",
        "19... Bxe4 20. Nxg6": "Threatening the rook at h8, and a checkmate at e7.",
        "20... Bxh2+": "Weakening White's K-side, whilst I have the chance.. ",
        "21. Kf1": "The only move, of course.  If instead 21.Kh1, then 21...Bf4ch  22.Nxh8 Bxg5 wins the Queen.",
        "21... Bxg6": "Safest and surest in my view.  The GK engine prefers 21...Rh7, combining attack and defence.  ",
        "22. Qxg6+ Kd8": "Else 22...Kd7  23.Qe6 with check.",
        "23. Qe6 Rc8": "Mobilizing Black's last unemployed piece.  ",
        "24. Bg5": "Another mate threat!  But White's attacks are being forced into a narrow focus, with few options.  Hence, Black is able to contain them thoroughly enough.  ",
        "24... Rxc2": "Combining attack and defence.  The rook attacks along the 2nd rank, at the same time vacating a square for the King.  So localised is White's attack, Black can now ignore it.  But see how Black has mobilised all his pieces and is attacking all across the board.  White's 2-piece fighting corps is unable to broaden its attack, and lacks time to call up the last reserve, the rook at a1.  Already a rook behind anyway, Black is in effect playing two rooks down.",
        "25. Bxe7+ Kc7 26. Qf6": "This attack on the rook leaves a vital square undefended...",
        "26... Qa6+": "It's mate in one: 1.Ke1  Qe2#.  "
    },
    "url": "https://gameknot.com/annotation.pl/mini-tournament-mentor-group-i?gm=49127",
    "gameName": "Mini-Tournament Mentor Group I",
    "players": "theanalogkid (1596) vs. ionadowman (2088)",
    "opening": "Sicilian (B50)"
}