{
    "moves": {
        "1. d4 Nf6 2. Bf4 e6 3. Nf3 Be7": "Seldom seen, and good by black. ",
        "4. Nbd2": "Wanting to play e4, with a strong center. ",
        "4... d5": "...As forseen, defending it. ",
        "5. e3": "This is not a \"second best\": it is the normal developement for my preferred asset. ",
        "5... Nbd7": "Again, better than Nc6, since it allows the c pawn to move. ",
        "6. h3": "The beginning of the standard attack, following with g4. ",
        "6... O-O": "Falling into my desidered game. ",
        "7. g4 c5": "Good, black seeks for counterplay on the queenside. ",
        "8. c3": "? Not necessary! I should have pressed the kingside more, with Ne5. If black plays the c pawn advancing or taking d4, nothing too dangerous for me happens. ",
        "8... c4": "This should not be allowed, but I have my plans, and they don't include my B to d3. ",
        "9. Qc2": "...but this instead. e4 is my next threat. ",
        "9... b5": "As in the previous game, the pawns storm, but this time my king is not behind them. ",
        "10. e4 a5": "Now, exd5 is just met by Nxd5, and g5 just causes Nh5. ",
        "11. e5": "This seems bad, because it blocks my own pieces, but...",
        "11... Ne8": "...black has to retire the N and I have to take advantage from this cramped position. ",
        "12. h4": "Supporting g5 for my pieces, trying to provoke h6. ",
        "12... b4": "Still not too much danger! I have to go on. ",
        "13. Ng5": "Threatening h7. ",
        "13... g6": "I need more support to the N in order to play h5. My attack is far from solid, here. ",
        "14. Ndf3 h6": "Here I missed Nxe6, followed by Qxg6+, probably winning. ",
        "15. Nh3 Kg7": "Defending h6. ",
        "16. Qd2": "Attacking again. I have to press, now that Qxg6 (after f7 is removed somehow) is prevented. ",
        "16... Rh8": "Defending. I'm on a dead alley, since any pawn push will just cause black to advance another pawn and my attack vanishes. ",
        "17. Bg2": "I regret to play this passive move, but I have to defend my R and prepare another sac. ",
        "17... Bxh4": "? Thanks black! You just opened the lines for my pieces. ",
        "18. g5": "Now h5 is not possible, because it loses the B. ",
        "18... hxg5 19. Nhxg5": "In a blitz it is very difficult to calculate all the complications, so I had to go on. This was the best I could see at the moment. ",
        "19... Bxg5 20. Rxh8": "Making the king go to a  more vulnerable square if I manage to bring my Q to h6. Still, it has the downside to open a good square (Ng7). ",
        "20... Kxh8 21. Nxg5": "Threatening Nxf7, so black has no time to play Ng7. Still, Nxe6 was a good sac chance. ",
        "21... Kg7": "Better was Kg8, so to leave this square for the Ne8. ",
        "22. Bh3": "Threatening Bxe6, repeating the royal fork. ",
        "22... Nf8": "Right, defending it. How to continue attacking? ",
        "23. Ke2": "Not o-o-o, since I'm not sure at all I will prevail on the kingside, and I don't want to wait for the long delayed black's break on the queenside. ",
        "23... f5": "? Again, nerves betray black. ",
        "24. exf6 e.p.+": "Without thinking! ",
        "24... Nxf6 25. Be5": "Now the N is pinned, and my B has a much more active square!",
        "25... Nf8h7": "The more black exchange pieces, the farther becomes my winning chances, but...",
        "26. Nxh7 Kxh7": "Again, the K is on a vulnerable square. ",
        "27. Rh1": "With an obvious threat of a discovered check, which black ignores, causing, finally, his death. ",
        "27... Ne4": "?? I'm not sure I will get the game without this blunder. So, a very good game by black. ",
        "28. Bxe6+": "...and black resigns, since there is no defence against the mate. Whew! I didn't deserve this win!"
    },
    "url": "https://gameknot.com/annotation.pl/missed-sacrifices?gm=57858",
    "gameName": "Missed sacrifices.",
    "players": "damalfi  vs. radarfish ",
    "opening": "Queen's pawn game (A45)"
}