{
    "moves": {
        "1. d4": "ubermensch43 played this move, so that I could play and get used to the Benoni Defense.  How do I know this?  He told me during this game, in a game chat.  Note: this was a coaching game, so there will be more conversations with the game chat, before it is over.  Of course, I confused the Benoni with the Kings-Indian Defense.  According to Jack Stockel, the King's-Indian Defense starts with 1.d4, d5 2.Nf3, or 2.Nc3.  Jack has also told me that you usually do not win with the King's Indian.  Instead, it leads to a draw or loss, so it is not that strong.  In addition, I recently learned that the Benoni Defense is weak for Class E Ranked Players.  However, I will not continue with the King's Indian because Ubermensch introduced me to the Game DB.  Of course, I no longer use this database because I have had bad luck with it, and International Master shamash discouraged me from using it, after I figured out the problem.     ",
        "1... Nh6": "? I made this move because it is what the Game DB suggested, or so I thought.  Of course, I did not understand the Database, at the time, and this is the first game where it has caused problems.  According to ubermensch43, this is a mistake because it is usually a bad idea to place your knight on the h or a files as it becomes less valuable and gives you less room to escape from danger.  This is, btw, why I was obsessed with the general fact that a knight on the rim is grim.  Of course, I also know that there are exceptions and times where a knight on the rim is dim.  That basically means that there are occasions where it is a good idea to place your knight on the rim.  Afterall, \"There is always an exception to everything\", as chesskingdom64 would say.",
        "2. Nf3": "He played this to illustrate that it is not a good idea to place your knight on the rim.  That is what he told me.",
        "2... d5": "? In this position, I am trying prevent him from advancing his d4 pawn.  However, he said that this is a mistake because it is a bad idea to push your pawn.  That is why I marked this with a question mark.  On the other hand, Jack Stockel would ask, \"Why is this bad?\", or, \"What's wrong with this move\"? ",
        "3. Bg5": "Ubermensch said that he is trying to put pressure on my h6 knight, in this position.  That is another reason why 1...Nh6 was weak.  ",
        "3... Ng4": "! At this point, I am trying to get my knight out of danger, and he said that this was a good tactical choice, for that reason.",
        "4. h3": "However, he also pointed out that it could be chased, with this move.",
        "4... Nf6": "Therefore, I respond with this move because I thought that I would loose my piece, either way.  However, this would exchange my knight for his DSB.  Otherwise, he would win a free piece.  On the other hand, he is not going to take.     ",
        "5. Nbd2": "!? I understand his intentions, but I think that this was a little risky because it blocks his queen and prevents it from moving.  Therefore, 5.Nc3! was best, in my opinion.  According to Jack Stockel, it is not a good idea to block your own pieces.",
        "5... Ne4": "!? I figured that I would exchange knights, but this is dangerous.  Why?  After he plays 6.Nxe4, his queen is free to maneuver.  Therefore, I do not think that this should have been played.   ",
        "6. Nxe4 dxe4 7. Nd2": "! In this position, he had to retreat his other knight, or I would take it with 7...exf3, exchanging his other knight for my e pawn.",
        "7... f6": "? At this point, I decide to chase his DSB away.  Of course, I was obsessed with chasing pieces, at the time.  However, he pointed out that it is a bad idea push pawns.",
        "8. Bf4 g5": "I am still trying to shoe his bishop away, but he pointed out the same thing about pushing pawns.",
        "9. Bg3 Qxd4": "? I decide to take one of his pawns with my queen because it looks I like have won something for free.  However, this opponent pointed out that this is another mistake because he told me and illustrated that it is a violation of General Opening Principles to bring out your Queen or major pieces (rooks), early in the game as it can be chased away.  That is, btw, why I became obsessed with rules, principles, and attacking pieces.  If Mr. Stockel were here, however, he would say that this move is solid.  Why?  It is because of what I had mentioned in my first sentence about free material.  Jack has told me that it is a good idea to try and win free material.  This, however, excludes deflective sacrifices and some gambits.  ",
        "10. c3": "Of course, he is chasing my queen, but I think that 10.Nb3 was best.  On the other hand, I am not sure.",
        "10... Qd7 11. e3": "I do not know why he made this move.  Afterall, I would not have been able to play c5 due to his f2 pawn.",
        "11... c5": "?? I do not know why I played this move, but it is a serious blunder, according to my opponent.  Why?  It is because I will loose my chance to castle, so my king will become and remain exposed, throughout the rest of the game, after he places me in check.  How will this take away my chance to castle?  After he checks me, I will be forced to defend with my king.  Afterall, he noted that it is important to have the option of castling, even if you do not castle.",
        "12. Qh5+ Kd8 13. Rd1": "His knight was protected by the king, so I do not know why he moved the a1 rook.",
        "13... Nc6": "?? At this point, I do not know what I was thinking.  However, he accurately points out that this is my loosing blunder.  Why does this move loose?  That will be answered shortly.",
        "14. Nc4": "At this point, he is going to my Queen for his Rook, at best, because my Queen is now pinned, so the game is now lost.  Therefore, I resign.  There are times when I have trouble understanding the material, in chess. Then, Jack Stockel tells me something, but experts, master, and some class A ranked players, tell me something different.  That has affected my performance and caused me to loose a couple of chess games.  This was one of those games.  In the Knights of Honor Chess Club, I made a thread about mixed signals and IM shamash advised me to base my moves on strategic plans, unless those plans weaken your position or endanger your king. "
    },
    "url": "https://gameknot.com/annotation.pl/mixed-signals?gm=45351",
    "gameName": "Mixed Signals",
    "players": "ubermensch43 (1543) vs. jkarp (885)",
    "opening": "Queen's pawn (A40)"
}