{
    "moves": {
        "1. d4 Nf6 2. c4 e6 3. Nc3 Bb4 4. e3 O-O 5. Bd3 c5 6. Nf3 d5 7. O-O cxd4 8. exd4 dxc4 9. Bxc4 b6 10. Bg5 Bb7 11. Re1 Nbd7 12. Rc1 Rc8 13. Bd3 Re8 14. Qe2 Bxc3 15. bxc3 Qc7 16. Bh4 Nh5 17. Ng5 g6 18. Nh3 e5 19. f3 Qd6 20. Bf2 exd4 21. Qxe8+ Rxe8 22. Rxe8+ Nf8 23. cxd4 Nf6 24. Ree1 Ne6 25. Bc4 Bd5 26. Bg3 Qb4 27. Be5 Nd7 28. a3 Qa4 29. Bxd5 Nxe5 30. Bxe6 Qxd4+ 31. Kh1 fxe6 32. Ng5 Qd6 33. Ne4 Qxa3": "Jätan vaieldamatult pingelise partii esimese poole kommenteerimata, sest põhisündmused algasid esimese ajakontrolli eel. Mõlemad vastased olid siiani kulutanud suhteliselt võrdselt aega - kummalgi oli ca 20 minutit järel. Edasi hakkas Topalov aga mängima märksa kiiremini kui vastane.",
        "34. Rc3": "Väga hea käik! Anand näitab, et valge suudab järelejäänud viguritega alustada väga ohtlikku kuningarünnakut.",
        "34... Qb2 35. h4 b5 36. Rc8+ Kg7 37. Rc7+ Kf8 38. Ng5": "38. Rd1 peale on mustal ainus vastus 38...Nd3, ideega 39. Nc5? Nf2+\n",
        "38... Ke8": "Topalovi mäng selles partiis oli ebaühtlane - ta võis pikka aega teha arvutite poolt soovitatud ainsaid käike (nagu seegi), siis aga eksis palju süütumas olukorras.",
        "39. Rxh7 Qc3 40. Rh8+": "Ajapuudus! Palju tugevam oli 40. Re4! ning variandis 40...b4 41. Rxa7 b3 42. Rb7 b2 43. Kh2 Qc1 44. Ra4! Nd7 45. Rab4 Qe1 46. Rxb2 Qxh4+ 47. Nh3 on musta ohtikud etturid laualt lahkunud ning edasine peaks olema tehnika küsimus.\n",
        "40... Kd7 41. Rh7+": "Parem polnud ka 41. Rd1+ Nd3 42. Ra8 Kc7 43. Ne4 Qa3\n",
        "41... Kc6": "Must kuningas pääses ohtlikust tsoonist 8-lt realt.",
        "42. Re4 b4": "Või 42...Kb6 43. Re7\n",
        "43. Nxe6": "Edasi leidis Anand vaieldamatult tugevaima plaani, kuid kulutas selleks ka tublisti mõtlemisaega...",
        "43... Kb6 44. Nf4": "!",
        "44... Qa1+ 45. Kh2 a5 46. h5": "Jälle parim, ei sobinud etturi võtmine: 46. Nxg6? Nxg6 47. Re6+ Kb5 48. Rxg6 Qe5+ 49. g3 Ka4 ning musta etturid on ohtlikumad\n",
        "46... gxh5": "Halb käik, mis pidanuks Topalovile kaotuse tooma. Ei läinud ka 46... b3? 47. hxg6! b2 48. g7 ja valge võidab, kuid palju tugevam oli 46... g5! 47. Rh6+ Kb5 48. Ne6 üksnes väikese eelisega valgele.\n",
        "47. Rxh5 Nc6 48. Nd5+": "Õige! Võibolla arvestas Topalov, et variandis 48. Re6 Qg7 49. Rhh6 Qc7 ei aita valget võidule ka enamratsu - 50. Rxc6+ Qxc6 51. Rxc6+ Kxc6 52. Nd3 b3 53. g4 a4 54. g5 a3 55. g6 b2 56. Nxb2 a2 57. g7 a1=Q 58. g8=Q Qxb2+ järel on laual viigiline lipulõppmäng.",
        "48... Kb7 49. Rh7+": "Jälle parim! Teine võimalus polnud nii hea: 49. Re6? Qb1 (49... Qg7 50. Reh6 Qd4 51. Rh7+ Kb8 52. Rd7) 50. f4 Qd3! üksnes väikese eelisega valgele.\n",
        "49... Ka6 50. Re6 Kb5 51. Rh5 Nd4": "Või 51... Nd8 52. Nb6+ Ka6 53. Rg6 Qb1 54. Rgh6 +-\n",
        "52. Nb6+ Ka6 53. Rd6 Kb7": "53... Nb5 54. Rg6 Qb1 55. Rgh6 +-\n",
        "54. Nc4": "Oioi! Taas oli Anand sattunud ajahätta - ca 5 minutit ajakontrollini 60.käigul ning jätab kasutamata lihtsa võidu 54. Nd5! ja näiteks 54...Nc6 kaotab viguri 55. Rh7+ Ka6 56. Rxc6+ Kb5 57. Re6, kuid midagi muud mustale soovitada ka enam pole.\n",
        "54... Nxf3+": "! Topalovi vastus oli välkkiire - selliseid käike ei mõelnud bulgaarlane praktiliselt hetkegi.",
        "55. gxf3 Qa2+ 56. Nd2 Kc7 57. Rhd5": "Ja sai oma tahtmise - Anandil polnud aega, et teha valik kahe käigu vahel. Paraku näitab arvutianalüüs selgelt, et võitis justnimelt 57. Rhh6! a4 58. Kg3 +-\n",
        "57... b3 58. Rd6d7+ Kc8": "Ka siin nägi Topalov ilmselt kohe, et pärast 58... Kc6 59. Kg3 b2, on tema kuningas matirünnaku all: 60. R5d6+ Kb5 61. Rb7+ Kc5 62. Ne4+ Kc4 63. Rc7+ Kb5 64. Nc3+ Kb4 65. Nxa2+ +- ja tegi sellegi käigu päris kiiresti.\n",
        "59. Rd7d8+ Kc7 60. Rd8d7+ Kc8 61. Rg7": "Ajakontroll sai täis ning Anandile lisandus 15 minutit mõtlemisaega. Rahulikult mõeldes leidis ta tugevaima käigu, kuid ausalt öeldes tundus mulle partii ajal, et praktilisem olnuks 61. Ra7 a4 62. Kg3.\n",
        "61... a4 62. Rc5+": "Kurb. Anand ei leia taas võidukäiku - 62. Rdd7! ning näiteks 62...a3 peale võidab 63. Kg3 Qa1 64. Rc7+ Kb8 65. Rb7+ Kc8 66. Nxb3 +-\n",
        "62... Kb8 63. Rd5 Kc8 64. Kg3": "64. Rdd7!\n",
        "64... Qa1 65. Rg4 b2 66. Rc4+": "Fritz jt arvutid sõnavad siin, et võitu enam pole. Valgel ei õnnestu enam ajada musta kuningat mativõrku... 66. Rb4 Qe1+ =\n",
        "66... Kb7 67. Kf2 b1=Q 68. Nxb1 Qxb1 69. Rdd4 Qa2+ 70. Kg3 a3 71. Rc3 Qa1": "Nojah. Must võib endale lubada seda luksust, et annab ära oma viimase etturi, kuid annab seejärel igavest tuld.",
        "72. Rb4+ Ka6 73. Ra4+ Kb5 74. Rcxa3 Qg1+ 75. Kf4 Qc1+ 76. Kf5 Qc5+ 77. Ke4 Qc2+ 78. Ke3 Qc1+ 79. Kf2 Qd2+ 80. Kg3 Qe1+ 81. Kf4 Qc1+ 82. Kg3 Qg1+ 83. Kf4": ""
    },
    "url": "https://gameknot.com/annotation.pl/mm-mat-9-sofia?gm=31332",
    "gameName": "MM-matš (9), Sofia",
    "players": "Anand, V. (2787) vs. Topalov, V. (2805)",
    "opening": "Nimzo-Indian (E47), 4.e3 O-O, 5.Bd3"
}