{
    "moves": {
        "1. e4 e5 2. d4 exd4 3. c3 dxc3 4. Bc4 cxb2 5. Bxb2": "Danish Gambit.",
        "5... Bb4+": "I find this gambit so rare in my games I don't know the next move of the main line here. I still knew I'd be better off trading pieces to neutralize the attack.",
        "6. Nd2 Nf6 7. a3 Ba5": "I was considering Bxd2+ and trade off, but his bishops were my main problem.",
        "8. Ngf3 Nxe4": "I felt like I could snatch a pawn. After Bxg2, I probably could play Rg8, trade off some pieces, and take on g2 and devastate the king side, the side he would be attacking on.",
        "9. O-O Nxd2 10. Re1+ Kf8": "I don't see another sensible move. Ne4 serves no purpose.",
        "11. Nxd2 d5": "Chasing the bishop off.",
        "12. Qa4": "This hangs a knight on d2, but will later get me in a difficult position.",
        "12... Bxd2 13. Bxd5 Bxe1": "Taking the rook did not seem bad.",
        "14. Rxe1": "Right now, black has the advantage, but I could lose instantly if I play incorrectly here. After Qxd5, I get checkmated on e1. That was the main problem; unable to get my queen out. Other major problems would include the bishops attacking my king cover, the rook dominating my king's file, and constant threats from the queen from any side. You can find the variations yourself. Also try to find the two best moves here.",
        "14... Nc6": "The second best move. I lose a pawn. Perhaps Na6 was the best move.",
        "15. Bxc6 bxc6 16. Qxc6 Be6 17. Qc5+ Qd6": "Attempting to trade.",
        "18. Qg5": "Attacking g7. The bishop is still on b2 and will later kill my space.",
        "18... Rg8 19. Qc1 Rd8 20. Bc3 Ke8": "To escape Bb4 winning the queen.",
        "21. Bb4 Qd4": "Losing a pawn.",
        "22. Qxc7": "Major trouble for me. I luckily got out of it 2 moves later.",
        "22... Qd7 23. Qe5 h6 24. f4": "The biggest blunder yet.",
        "24... Qd4+ 25. Qxd4 Rxd4 26. f5 a5 27. Bxa5 Rd5 28. Bb4 Rxf5 29. Re4 Kd7 30. a4 Rc8 31. a5 Rc1+": "This is basically the end. if Re1, I trade and Bc4 wins..",
        "32. Be1 Bc4": "White resigned seeing f1 was a dead spot. The lessons here are to trade off when your winning, find any way to get out of a bad position with as good as a result you can, but plan out how many moves it will take. Finally, Cover any weak squares you have and attack weak squares of your opponent's and make advantage of it."
    },
    "url": "https://gameknot.com/annotation.pl/mocirlloss-mini-tournament?gm=25087",
    "gameName": "mocirllos's mini-tournament",
    "players": "fred_kruger (1452) vs. darkrai123 (1618)",
    "opening": "Danish gambit (C21), Collijn defence"
}