{
    "moves": {
        "1. e4": "I cant realize if this game was good or not. Did i play nicely or did i just be lucky to play with weak challenger ?\nso i diced to expose this game in order to know what do you think about. I'mnot a club player, so this is not a real anotation game, there is nothing to teach or to learn. I wont show you any killing secret variation, i just whould appreciate to read your coments.",
        "1... g6 2. Nf3 Bg7": "i will play the modern defense, not to  much theory, starts with those few moves, i'm jazz player so i like when there is enought space for improvisation and freedom.",
        "3. Bc4": "i hate sacrifice of bishop like now i could be 3. Bc4 ... 4. Bxf4+?! it happens a lot in blitz and after a hard day working, i'm not in such condition to play this aggressive kind of game. So i just will prevent it with e6",
        "3... e6 4. d4": "white occupate the center",
        "4... a6": "in order to move b5 and kick the bishop. this time i will find a interesting variation that will lock up the LSB",
        "5. a4": "good response, prevent from b5. I will have to get rid of the bishop in a other way...",
        "5... c6": "this will be the good way : after d5, iwill control e4 and c4, and the LSB will become useless for a while",
        "6. b4 d5 7. exd5 exd5": "normaly i play cxd5, this time my intuition tel me to take back with e6, i dont know wy, maybe to stay stronger on queen side ?",
        "8. Bb3": "ok, so this is what i have called \"the first jail\", bishop jail. He will stay there, useless, untill the end of the game !",
        "8... Nf6": "now i can go on developping and castleing",
        "9. h3": "preventing nailing Bg4",
        "9... O-O": "i feel better now.But i still have to make an attack plan. What whould you attempt from this position ?",
        "10. O-O Be6": "the idea is to sacrifice the bishop Bxh3 but before preparing the queen in c8. i loose a piece but win 2 pawns and destroy the white kingcastle., alway funny in blitz !",
        "11. Nc3 Qc8 12. Kh2": "my challenger is not going to let me doit ! i have to find a another plan again, ....",
        "12... Nbd7": "bringing the second knight in the game",
        "13. Bf4": "i dont understand the reason of this move ?",
        "13... Nh5 14. Bg3": "is this a trapp ? i feel that if i exchange it is in my advantage. because DSB is dangerous with a g6 castle, and 2 pawns g2 g3 is not very good for white",
        "14... Nxg3 15. fxg3": "so this is the seconf jail, the king jail. For the moment, it will help white covering the king, but in 15 moves it will be a deadly jail !",
        "15... Nf6 16. Ng5": "i need this bishop",
        "16... Bf5 17. Ne2 h6": "now the plan is 18. Nf3\tQc7 in order to attack the king with Qxg3+ but still will have to move the e2 knight first. the plan is not easy but i need anyway to have goal....",
        "18. Nf3 Qc7": "preparing attack to g3",
        "19. Nh4 Be4": "protecting the bishop",
        "20. c4": "i have to win tempo",
        "20... Nh5 21. Rc1 g5": "kicking the knight but ignoring the treat with the discovered attack on my queen, this could be dangerous",
        "22. Nf5 Bxf5 23. Rxf5": "this rook is not protected, a interesting weakness",
        "23... Qd7 24. Qf1": "i can deflect the protector taking the e2 knight",
        "24... Rae8 25. cxd5": "becoming dangerous for me, but i have a surprise ...",
        "25... Rxe2": "Rxe2! now i win +2 ...",
        "26. Qxe2 Qxf5": "...but not for long ! Qxf5 ...",
        "27. Qxh5 cxd5": "the game stabilizes, are we going to play a final ?",
        "28. Rc7": "very dangerous, occupong the line 7, and maybe freeing the diagonal b3 f7 in a while, treathing f7.",
        "28... Qf2": "but i have plan, and this time, it's a good one ! do you see it ? ...Bxd4!...Qg1++",
        "29. Bxd5": "white is carried away by his initiative",
        "29... Bxd4": "beeing hot for white !",
        "30. h4": "this door is not enought, i will have a very bad surprise for the king if he whant to escape going to g4...f5+! and this will be the end of the game",
        "30... Qg1+": "first...",
        "31. Kh3 Qh1+": "second...",
        "32. Kg4 Qd1+": "third...",
        "33. Bf3 f5+": "and that all, the game is over for white, 34. Kh3 Qh1++. Thanks for comments, i'd like to know.",
        "34. Kh3": ""
    },
    "url": "https://gameknot.com/annotation.pl/modern-defense-jail-for-bishop-jail-for-king?gm=52456",
    "gameName": "Modern defense, jail for bishop, jail for king !",
    "players": "tysia (1600) vs. 31415 (1442)",
    "opening": "Robatsch (modern) defence (B06)"
}