{
    "moves": {
        "1. d4 g6 2. Bf4": "the plan is just to put my bishop in h6 and then to take back with the kniht.",
        "2... Bh6": "what will he do ? there is no more plan for him, except maybe to put his bishop in g3 planing to attack c7 ",
        "3. Bxh6": "he took it, so now the may attack line to the blac castle in broken !",
        "3... Nxh6 4. Nc3 Nf5 5. e4 Ng7": "so i'm missing a lot of developpment, but this is not a problem anyway, there is no imediat treat and i stil have all my pawns to fight for the center ",
        "6. e5": "ocupping the space, not for long ...",
        "6... d6": "classical line, let's break this little white center !",
        "7. e6": "oh ! surprise ! Wy this ??? it looks like a bunder, is it ??",
        "7... Bxe6": "i develop the c8 bishop, but then i realize that it block the e7 pawn. ",
        "8. Bb5+": "this is very poor. white seems to have nothing to do ",
        "8... c6 9. Bd3": "a losed tempo or white, a luck for me !",
        "9... d5": "now the center is mine, and strong. And i still have the e paw to push to the center, and i'm ok to castle.",
        "10. Nf3 O-O 11. Qe2 Bg4": "what else !?",
        "12. O-O-O": "it was not necessary to go to this side, with is more weak",
        "12... e6": "now a very very strong center, but i'm missing plan to attack",
        "13. h3": "that was expected.",
        "13... Bxf3": "i could also put my bishop on f5 to exchange with the white one on d3, it could be good because this d3 bishop is a good treat to my castle...but the knight also is a good treat to my castle, SO ???...",
        "14. Qxf3 Qg5+": "puting pression, but no plan",
        "15. Kb1 Nf5": "exchange with bishop or attack going to h4",
        "16. h4": "bunder",
        "16... Nxh4 17. Rh3 Nxf3": "and that all folks !!!! This is not a interesting way of wining, BUT : What is interesting in this game is that my challenger go on playing and it was not so easy to win instead of taking his queen, he has a very good attack t my castle, ...the reason is that taking the pawn on h3, i have open the h colon. nd was a BIG STUPID BUNDER OF ME !",
        "18. gxf3": "if he has not lose his queen i probaly lose the game because of this h colon",
        "18... Nd7 19. Rdh1": "you see what i mean. Now it's becoming very dangerous for me instead of my queen avantage",
        "19... h5 20. Ne2 e5 21. Rg3 Qh6": "BIG DANGER : 22 Rhg1 - ... 23 Bxg6 !!- f7xg6 24 g3xf6+ and then he take back his queen !",
        "22. Rhg1 Kh8": "i will exchange a rook to cancel the treat",
        "23. Bxg6 Rfg8": "now !",
        "24. Bxf7 Rxg3": "the treat is nul canceled, and i have ne for him ...(Qd2 !)",
        "25. Rxg3 Qd2": "now i'm treatening a mate, it will save me",
        "26. Nc1": "just a question of time now, the game is done",
        "26... exd4 27. Be6 Nf6 28. Rg6 Re8 29. Rxf6 Rxe6 30. Rxe6 Qxf2 31. Rh6+ Kg7 32. Rxh5 Qxf3": "a other bunder",
        "33. a3 Qxh5": "so what do you thing about this \"bishop variation\", is it known ? or is it not recommended ? "
    },
    "url": "https://gameknot.com/annotation.pl/moderne-defense-bishop-variation?gm=46590",
    "gameName": "moderne defense : \"bishop variation\" !!!",
    "players": "albertkool (1616) vs. 31415 (1206)",
    "opening": "Modern defence (A40)"
}