{
    "moves": {
        "1. e4 e6 2. Nh3": "Awkward, but not that bad, yet.",
        "2... d5 3. exd5 Qxd5": "I think exd5 is better here.",
        "4. Be2": "Hangs the pawn at g2.",
        "4... Bd6": "Should have played Qxg2, forking the rook and knight. Play would likely follow Rg1 Qxh3, Rxg7 Qxh2, Bf1.",
        "5. c4": "Much better would have been Bf3.",
        "5... Qc5": "Again! Missed Qxg2! Only now Black has the bishop on d6 to contribute.",
        "6. b3": "Error after error after error. White could defend with the simple O-O. Now there is a pawn on c4 that White must worry about defending.",
        "6... Be5": "A threat, but not as much as Qxg2! as would have been playable earlier.",
        "7. Ba3": "You have to admire White's use of this in-between move, but it does allow for Qc6, renewing the threat on g2, all while the a1 rook is still attacked.",
        "7... Qc6": "Good.",
        "8. Nc3": "Now that Black's queen no longer guards d4, 8. d4 would have been better.",
        "8... Qxg2": "Finally Black capitalizes on White's weakness.",
        "9. Rg1 Qxh3 10. d4": "10. d4 is pointless now. Furthermore, White's knight is hanging! Play would follow: Qxc3+, Kf1 Qh3+, Ke1 Bxh2, and either Rh1, Rf1, or Rxg7, perhaps.",
        "10... Bxh2": "Too early, but I guess it kindof still works.",
        "11. Rh1": "Black can now easily get out of the pin and save his bishop after Qxc3+, Kf1 Bd6 (or Bf4).",
        "11... Qg2": "This is easily countered with Rf1.",
        "12. Kd2": "...or that, but the king is now exposed and the queen has poorer access along the d file. Plus the f pawn is hanging.",
        "12... Bf4+ 13. Kc2 Qg6+": "Better is Qxf2, pinning the bishop to the king...",
        "14. Bd3 Qg2": "The queen simply moves back to its original square. Black loses a tempo as a result. She now threatens check instead of a pin, but it's easily defensible.",
        "15. Qe1 Ne7": "Black still can't castle because the knight would be hanging. Protect it, and castling would leave it pinned to the rook.",
        "16. Nb5 Bg3": "Luckily this bishop still guards c7 from a fork or rook trap. This threat should be resolved with a6, forcing the knight back and gaining a tempo, before continuing with Bg3.",
        "17. Qe3 Bh2": "Better would be Bxf2, threatening the queen and a discovered check. I see little point to this move.",
        "18. Rhd1 Nbc6 19. d5": "A good move from White, attempting to pin the e7 knight to the king if exd5. If Black responds Ne5, White wins a pawn with Nxa7, although this wouldn't be that good for White positionally.",
        "19... Be5": "Another in-between move, but not a good one. The bishop still has to guard c7 and Black is only threatening to win the exchange whilst losing a knight.",
        "20. Rac1": "Better would be dxc6.",
        "20... Nd4+": "Bad move. The knight is attacked twice and defended once.",
        "21. Nxd4 Bxd4 22. Qxd4": "At least now for Black the pressure is off c7.",
        "22... Nf5": "Not good. The bishop could simply take on f5 and after the recapture Black's king would be greatly exposed (a forced mate?). There is also no need to defend g7 since the queen is already doing that, though there is the threat of Rg1 looming.\r\n\r\n",
        "23. Qc5": "Now White just has to pick-off the knight and Black would be lost, but move order matters...",
        "23... b6": "...Better was Nd6 (maybe?). Now White can win the a8 rook.",
        "24. Qc6+ Kd8": "The only good move.",
        "25. Qxa8 Qxf2+": "Now that White's queen is temporarily out of the action, and not guarding f2, Black can take (the) initiative. However, Ne3 check wins the exchange.",
        "26. Rd2": "And now Black can't win the exchange with Ne3+.",
        "26... Ne3+ 27. Kc3 Qf6+": "Black does well thus far maintaining [the] initiative.",
        "28. Kb4 a5+": "The line 28... Qe7+, c5 is interesting...[must analyze]",
        "29. Ka4": "If only the Bishop on c8 wasn't pinned, it would be checkmate (Bd7#).",
        "29... exd5": "Black's queen now threatens to come to c6 if White's queen leaves it unguarded.",
        "30. b4 Qe7 31. b5 Qe6 32. Bc2 c6": "If Nxc2 first, White would respond Qxd5+ and Black's attack would be gone. Good foresight on this move!",
        "33. bxc6": "Seems a tad pointless.",
        "33... Nxc4": "Attacks the rook while at the same time threatening to take on a3. White's dark-square bishop is crucial to his positional stability.",
        "34. Rd3 Nxa3 35. Kxa3": "While White moved his rook to d3 to supposedly protect the a3 bishop, he instead took back with the king. This allows Black an extra check with Qd6+ [must analyze].",
        "35... Qe4 36. c7+ Ke7 37. Qxd5": "White's last blunder...",
        "37... Qb4#": "And there you have it! Commenting and rating are, as usual, appreciated."
    },
    "url": "https://gameknot.com/annotation.pl/mountlake-terrace-kamiak-bd-1?gm=35729",
    "gameName": "Mountlake Terrace @ Kamiak bd. 1",
    "players": "Ian Slingsby (unr.) vs. John Kim (1002)",
    "opening": "French defence (C00)"
}