{
    "moves": {
        "1. e4": "Hi everyone!\n\nWe have all been told that moving the king early in the opening is tantamount to suicide.  Just remember my Fried Fox Pork Chop attempt with the Master Mater in which Henry was duly hunted down and fried!  I do end up moving Henry onto the third rank on move 12 against a Master called David who is of similar calibre to Freddy.  I do lose the game eventually - it is just sooo like some of my better losses against Freddy.  Anyhow, I end up playing against a Sicilian and on move 3 I decided to deviate a bit.  Here is the computer analysis of the game. http://gameknot.com/analyze-board.pl?bd=15521530&rnd=0.37983951781390546\n\n",
        "1... c5 2. Nc3": "2. Nc3 - I normally play Nf3 here but decided to have a bit of a change.",
        "2... Nc6 3. Nge2 Nf6 4. d4 cxd4 5. Nxd4": "5. Nxd4 - after my unusual Nge2 instead of Nf3 the standard Sicilian moves d4, exd4 and Nxd4 takes place.",
        "5... e6 6. Nxc6 bxc6": "6. ..... bxc6 - this knight trade seems to be OK here.",
        "7. e5 Nd5 8. Ne4 Qc7 9. f4": "9. f4 - to back up e5.  At least playing the knight to e2 instead of f3 frees up an advance of this pawn.",
        "9... Qb6 10. c4 Bb4+ 11. Ke2": "11. Ke2 - this move is recommended in the DB but it does seem a bit wierd, putting Henry in the centre against such a strong master!",
        "11... Ba6": "11. ..... Ba6 - pin.",
        "12. Kf3 f5 13. exf6 e.p.": "16. exf6 e.p - pawn trade.",
        "13... Nxf6 14. c5 Qa5 15. Nxf6+ gxf6": "15. .... gxf6 - knight trade.",
        "16. Bxa6 Qxa6 17. Qd4": "17. Qd4 - Glenda decides to take a little exercise on her broomstick - she has her eye on a somewhat juicy looking p(r)awn on f6 and attacks black's dsb on b4.",
        "17... Qb5 18. Be3": "18. Be3 - Glenda would just lurve to zap that f6 pawn but first Fou Lenoir shields Henry from the Wicked Witch of the West.",
        "18... O-O-O 19. Rhd1 e5 20. Qd3 Qb7 21. a3 Ba5 22. b4": "22. b4 - driving back black's dsb and keeping the queenside pawns together.",
        "22... Bc7 23. Qf5 Rhg8 24. Kf2 Qb5 25. g3": "25. g3 - I have been wanting to get Henry back to safety but it is not that easy.",
        "25... Qc4 26. Qd3 Qxd3 27. Rxd3": "27. Rxd3 - queen trade.",
        "27... h5 28. h4 Rg4": "28. ...... Rg4 - that rook is gonna be a pain in the proverbials for many moves to come.",
        "29. fxe5 fxe5": "29. ...... fxe5 - pawn trade.  This pawn is gonna be a killer later on.",
        "30. Bg5 Rf8+ 31. Kg2 e4 32. Rb3": "32. Rb3 - not Rc3?? as this would walk into a Be5 skewer.",
        "32... Rf5 33. Re3 a5": "33. ....... a5 - a move to try and break up my queenside pawn structure.",
        "34. Ra2 Bb8 35. Be7 a4 36. Bd6": "36. Bd6 - I invite a trade of bishops in order to reduce the pressure on g3.  Unfortunately it will leave me with a weak pawn on d6, of which, David eschews capture of.",
        "36... Bxd6 37. cxd6 Rd5 38. Rae2": "38. Rae2 - counter-attacking the pawn on e4.  Of course, if David did take on d6 and I got rid of that pawn on e4 that game would have been a certain draw, but Dave has other ideas!",
        "38... Rd4 39. Kh3": "39. Kh3 - with this in mind .....39.Kh3 Kd8 40.Rf2 Rxd6 41.Rf5 Rd3 42.Rxh5 Rxe3 43.Kxg4 Rxa3 44.Re5 d5 45.h5 Rb3 46.h6 a3 47.h7 a2 48.h8=Q+ Kc7 49. Re7+ Kb6 50.Qb8+ Ka6 51. Ra7#",
        "39... Kb7": "39. ..... Kb7 - but these Masters always find a way of saying \"Dream on\".  David moves his king the other way and his king will penetrate on the queenside with disastrous consequences for yours truly.",
        "40. Re2e1 Kb6 41. Re1e2": "41. Re1e2? - I should have been prepared to give up the d6 pawn at that date and played Rf1 and got my threats on the white h4 pawn in earlier.  I do take that pawn but a few moves too late.",
        "41... c5 42. bxc5+ Kxc5": "42. ..... Kxc5 - a decisive pawn trade allowing the incursion of the BK.",
        "43. Rf2 Rd3 44. Rf5+ Kd4 45. Rxh5 Rg6": "45. ...... Rg6 - here I wave the white flag as there is no way of stopping David from crowning his e pawn without great material cost.  Passivitis in the endgame does not pay my friends!  Anyhow, enjoy your weekend - bye for now - Joanne."
    },
    "url": "https://gameknot.com/annotation.pl/moving-the-king-in-the-opening?gm=38665",
    "gameName": "Moving the King in the opening",
    "players": "jstevens1 (1801) vs. drhpatron (2247)",
    "opening": "Sicilian (B23), chameleon variation"
}