{
    "moves": {
        "1. e4": "Who Is Gunner Win?\n\nAnother match against an opponent I enjoy playing, but not just for the chess and I doubt the sentiment is returned ;-)",
        "1... e5 2. Nf3 Nc6 3. Bc4": "Yes, its that old chestnut....again.....",
        "3... h6 4. Nc3 Bb4 5. Nd5 d6 6. Bb5 Bc5 7. c3 Be6 8. Ne3 Nf6 9. d3 O-O 10. O-O Ne7 11. b4 Bxe3 12. fxe3": "Time after time I've seen my opponent get a free f file whilst I'm trapped, so this time I accepted the pawn double to try and control the f file.",
        "12... c6 13. Ba4 b5 14. Bb3 d5 15. Nxe5": "Did someone mention free pawns?",
        "15... Nd7 16. Nxd7 Qxd7 17. exd5 cxd5": "I'm quite happy at this stage, my pawn structure is pretty good whilst my opponents is somewhat fragmented. He does have the advantage in piece development though..",
        "18. Qf3 Bg4 19. Qf2 Qe6 20. h3 Bh5 21. e4": "Trying to be sneaky and nab the queen....",
        "21... a5 22. a3": "Preparing a bolt hole as I see a4 coming next.",
        "22... Qg6 23. exd5 axb4 24. cxb4 Rad8 25. Qc5 Kh8": "Thats an error, not sure why he made that one, but I don't turn down free material against this opponent!",
        "26. Qxe7 Rde8 27. Qc5 Bf3": "More optimism from my opponent, nearly worked actually. I was looking at g4 until I suddenly realised summat....",
        "28. Rxf3 Re2 29. Rf2 Re1+ 30. Kh2 Rfe8 31. Bb2 Qg5 32. Rxe1 Rxe1 33. Rxf7": "Deliberate start of a sequence, I knew I had a tempo to play with and as long as I could keep him under threat I could either take a mate or force a queen sacrifice.",
        "33... Re2": "He misses the threat and gets bolshy....",
        "34. Qf8+": "Now he sees it and resigns. k-h7 draws Rxg7, forced then with Qxg7 and QxQ mate. I managed to gain quite an advantage beforehand but I do like the closing sequence. I'm usually bad at linking pieces together in an attack, its usually one piece charges, gets killed, second piece charges and so on.... so to have a combi like this was most satisfying. To me at any rate."
    },
    "url": "https://gameknot.com/annotation.pl/mts1692s-mini-tournament-i?gm=48878",
    "gameName": "mts1692's mini-tournament I",
    "players": "grey_panda (1426) vs. ashfordgooner (1371)",
    "opening": "King's pawn game (C50)"
}