{
    "moves": {
        "1. e4": "Another Muzio gambit. This time around, the game did not go as planned as my opponent put on a dogged defence. I had to rely on setting up a trap and inviting a blunder to win. I would appreciate any comments as to where I went wrong in my development that allowed Black a remarkable fight.",
        "1... e5": "the first 4 moves a set by the tournament opening",
        "2. f4": "The idea being offering up a whole knight for a pawn for a significant lead in developement",
        "2... exf4": "There goes the pawn",
        "3. Nf3": "protecting against a queen raid with check",
        "3... g5": "Black tries to hang on to this won pawn and seek to advance to attack the knight",
        "4. Bc4": "White is preparing for an attack on the f7 pawn. In this opening, if Black accepts the gambit, he must also accept that he won't be able to castle",
        "4... g4": "The attack on the knight. The following move is the first free one in the tournament. I am not inclined to a loose the right to castle. I could take my knight to e5 and initiate a second attack on f7 but then Black would respond with 5...Qh4+ 6. Kf1 with a ready made attack with pawns and a queen to try and opening up my king's position. I must admit I do not like the games that emerge from this variation as the board becomes extremely complex.  For these reasons, I allow Black to take up the knight",
        "5. O-O": "I castle, allowing Black a free knight for a pawn",
        "5... gxf3": "Question: Do is it better to take the pawn with the rook, allowing a line up rook/queen later or with the queen for a queen/rook? The first one seems to be more sensible given that the rook is less valuable, at the same time, there is nothing better than a check with a queen which argues for a queen first. Any thoughts?",
        "6. Qxf3": "I choose to take the pawn with my queen",
        "6... Bh6": "Black tries to protect the pawn. I think 6...Qf6 is a better move for black as it threatens a fork with check on the White bishop on c4 with 7...Qd4+",
        "7. d4": "Playing up the bishop first, allows White to double move the d pawn for a firm grip of the sweet centre and an attack on Black's f4 pawn",
        "7... Qf6": "A move late but there comes the threat of the fork with check that I must address in my next move",
        "8. c3": "I shore up the d pawn. So far, So good? Thoughts?",
        "8... d6": "White liberates his bishop. Very good play I thought. My bishop on c4 will come under pressure at some point",
        "9. Na3": "Instead of 9.Bxf4, which would have set in motion a series of capture/re-capture which would reduce my deficit to -2, I decide to continue developing hoping it would pay off later. Plus my next (or few) move would liberate my second rook. Or so I thought",
        "9... Be6": "Black is now a just a couple of steps behind in development. White starts to panick... The gambit is about to fall flat. Any thoughts?",
        "10. Bxf4": "I take the f4 pawn at last",
        "10... Bxf4": "re-capture",
        "11. Qxf4": "re-capture",
        "11... Qxf4": "re-capture",
        "12. Rxf4": "re-capture. I am now down -2, with a fair game as Black is still behind but I feel like it is not going that well...",
        "12... Ne7": "Black continue developing. I would have thought 12..Nc6 was better as I would allow Black to castle queen side in the next move, but the present move does all right",
        "13. Nb5": "Instead of 13.Bxe6, which would have opening up Black's king side, I decide to go for a fork on c7. In hindsight, Bxe6 was probably better. Any thoughts?",
        "13... Na6": "Black parries the threat of Nxc6+. Retreat or take down Black's bishop? Being behind -2, I was not too keen to exchange pieces and could not retreat as it would allow Black to castle queen side and keeping his two points lead forever",
        "14. d5": "I did not any other move.... May be there was something better, but just could not see it. This move kills any (immediate) future attack on the f7 pawn. By now, I am just desperate...",
        "14... Bd7": "Black retreats and attacks my knight. I am happy to exchange is the next move would have allowed me an extra tempo as it would come with check",
        "15. Raf1": "I line up my rook for the (hopeless) attack on f7. This can be easily parried.",
        "15... O-O": "Black castles. I would have played 15...Rf8, I think it was a stronger move, but this one does nicely as I did not really have a reply after this...",
        "16. Nd4": "I just thought, OK, let's put the army king side and see what happens. The knight is headed (short or medium term) to f5",
        "16... Nc5": "Black can finally start attacking",
        "17. b4": "I did not want to make it easy, so he must keep on moving his knight",
        "17... Na4": "The knight is trying to get c3 pawn... Oh no!",
        "18. Rf4f3": "Any hope of a descent attack is gone. My f4 rook had to retreat a bit and play nurse to my backward pawn. Not good",
        "18... Ng6": "Again, no real move against this apart from trying for a pin and see what happens",
        "19. Bb3": "But before the pin, I decide to get rid of the troublesome neighbour. I don't like ennemy knight hanging about because they can be so crazy...",
        "19... Rae8": "Black ignores my bluff happy to trade pieces. He is up a piece for a pawn and in the way to winning. Plus he now has a good pressure on my e pawn. Black is good",
        "20. Bc2": "Again, playing nurse to another backward pawn. The game is not going well...",
        "20... Nb2": "And the knight tries to intrude. Undislogeable where it is, plus all the squares if could land one next were protected (except c4)",
        "21. Rg3": "Back to the pin. I am attacking again...",
        "21... Nc4": "Black's knight is now in a very safe place and has a major influence in the middle of the board. This game is going from bad to worse",
        "22. Bd3": "I try a hand at dislodging, a bluff really as I did not have any productive move",
        "22... Nce5": "Black buys the buff and attacks my bishop. This is an even better square for Black's knight as now not only is it in the middle of the board control many squares, it also has a pawn support... Time to play defence and hope for a blunder",
        "23. Be2": "Again, not keen to trade pieces. I decide to control the diagonal d1-h5",
        "23... Kg7": "What is Black trying to do? I could not figure out... But hey, Patsy sees a check",
        "24. h3": "I give my king air",
        "24... a6": "Black trying his hand an opening my queen side",
        "25. Nf5+": "Patsy gives check",
        "25... Kh8": "I think a better move for Black was 25..Bxf5. But hey, I was chuffed to bits that I got Black retreating...",
        "26. Nh6": "I continue attacking, may be I would get a chance at having a go at the f7 pawn, at last...",
        "26... Kg7": "Black does not cooperate...",
        "27. Nf5+": "I give check again, given Black another chance to do the right thing and take the knight down",
        "27... Kh8": "Black declines and take his king back",
        "28. Nd4": "My knight is back where it started, the last few moves left the game at a standstill",
        "28... Rfg8": "Preparing a double attack on my (unprotected) rook?",
        "29. Rf6": "Let's take the rook down and see what we can get. Not much I thought, but I did not have a move",
        "29... Kg7": "Black again refuses to cooperate but does not take the game by the horns",
        "30. Rf1": "My rook had to go back. May be I could get Black to agree to a draw here?",
        "30... Kh6": "Where is Black's king going? I must admit that I still do not have an answer",
        "31. Rf6": "But my rook can go back and pin the Knight",
        "31... Bc8": "Black retreats. By now, I come to the realisation that if I can put my knight to f5, it is check mate. The not so slight problem was that Black's bishop on d8 had an iron grip on the d8. What to do?",
        "32. a4": "I could not find the right combination, I needed all my pieces but the rook on f6 were needed for the mate. Still could not find the answer. I do not like taking so much time to move. So I pay 32.a4 trying my hand at perhaps drawing Black's bishop off the c8-h2 diagonal",
        "32... Rgf8": "Black again refuses to cooperate. I was hoping for him to start moving his pawn, where I would have sacrificed a couple of pawn, made him feel safe and secure in his win and deliver the deadly Kf5 check and mate",
        "33. Rf5": "I reasoned he needed a blindingly obvious incentive. Will he see the trap?",
        "33... Bxf5": "Black gobbles my rook. He makes my day",
        "34. Nxf5#": "The game is over! Relieved rather than elated. Any thoughts overall are welcome as well."
    },
    "url": "https://gameknot.com/annotation.pl/muzio-variation?gm=24413",
    "gameName": "muzio variation",
    "players": "arnihilator (1570) vs. ringlord (1603)",
    "opening": "KGA (C37), Muzio gambit, Paulsen variation"
}