{
    "moves": {
        "1. e4 e5 2. f4 exf4 3. Nf3 g5 4. Bc4 g4 5. O-O gxf3 6. Qxf3 Qf6 7. d3 Bh6 8. Nc3 Ne7": "The starting position for all the games in the tourney.",
        "9. Bxf4 Bxf4 10. Qxf4 Qxf4 11. Rxf4 Rf8 12. Raf1": "The usual series of exchanges in the variation. Now the game really begins.",
        "12... f5 13. exf5 Nec6 14. Re1+": "White is the gambiteer and down a piece, so I can't play passively. I have to exploit my time advantage, as Black's Q-side is still undeveloped.",
        "14... Kd8 15. f6 d6 16. f7": "I waste no time establishing a promotion threat, further tying down Black.",
        "16... Bd7 17. Ne4 Ne5 18. Bb3": "Naturally I do not wish to exchange minors. The Bishop helps guard my advanced Pawn.",
        "18... Nbc6 19. Ng5 Ng6 20. Nxh7": "Equalizing the material and threatening to remove the barricading Rook that's blocking KB8 from my pawn.",
        "20... Nxf4 21. Nxf8": "A Rook trade, but now I will be able to use the Pawn promotion to win a piece.",
        "21... Ne7 22. Nh7": "Clearing the square...",
        "22... Nfg6 23. f8=Q+": "I win a Knight.",
        "23... Nxf8 24. Nxf8": "Now it's a matter of simplifying down. My two connected passed Pawns on the K-side loom as endgame threats.",
        "24... Bc6 25. Ne6+ Kd7 26. Nd4": "Black's B has nowhere to run. It will be exchanged off the board.",
        "26... Re8 27. Nxc6": "By moving his Rook to K1, Black now enables me to completely swap off the pieces.",
        "27... Nxc6 28. Rxe8": "Now I will pin his Knight...",
        "28... Kxe8 29. Ba4": "... which I do here...",
        "29... Kf7 30. Bxc6": "...and exchange it off.",
        "30... bxc6 31. Kf2": "Now it's a simple matter of advancing my two K-side passed Pawns.",
        "31... Kg6 32. Kf3 Kg5 33. Ke4 Kf6 34. h4 Kg6 35. g4": "Forward!",
        "35... Kh6 36. Kf5 a5 37. g5+ Kh7 38. Kf6 d5 39. Kf7": "Now my King guards the road to KN8.",
        "39... c5 40. h5 c4 41. g6+ Kh8 42. g7+ Kh7 43. g8=Q+": "Black resigns. It is mate next move."
    },
    "url": "https://gameknot.com/annotation.pl/muzio-gambit-paulsen-variation-mini-tournament?gm=40041",
    "gameName": "Muzio gambit (Paulsen variation) mini-tournament",
    "players": "last_archimedean (1349) vs. lastav (1480)",
    "opening": "KGA (C37), Muzio gambit, Paulsen variation"
}