{
    "moves": {
        "1. e4 Nc6": "My friend here plays about every opening that can be found in books and even outside books ;). Right the opposite to me. It's always exciting to see what next he's putting on the table. Okay, this time it's Nimzovich (which we played about 2,000 times in our blitz games, which means nothing - see above).",
        "2. Nf3": "A new weapon I discovered. Usually in our blitz games I responded more classical with 2. d4, but then found the big center often under heavy attack and outplayed by swift black piece play after 2. d4, d5 3. e5, Bf5. So 2. Nf3 is new to him (and me).",
        "2... d6": "Actually I expected the more aggressive 2. ...d5. I guess, he sheers away from his hack and attack style and tries to adapt to the rules of correspondence chess. ",
        "3. d4 Bg4 4. Be3": "As usually I try to maximize best piece positioning. Often, alas, this can only be accomplished with the opponent's help. Here I didn't want to reduce my light-squared bishop to babysit the f-knight by 4. Be2. Furthermore I happen to know that my opponent likes to fianchetto which I'd liked to counter by setting up a battery along the c1/h6-diagonal. This is very early speculations that can only be reasoned by the fact, we know each other pretty well, chesswise. With hindsight I can tell now, this is a main theory move as well.",
        "4... Nf6 5. Nbd2": "Normal development.",
        "5... Nb4": "What is this?? This is an absolut beginner's move. Strange, since my opponent is an excellent blitz player with a good grip of tactics and a feeling for positions too. By 20,000 blitz games I happen to know that. So what is this one piece kindergarden attack meant to accomplish?",
        "6. a3": "I'd love to see my c-pawn on c4, so I opted for the a-pawn to give the knight a kick.",
        "6... Nc6": "So what has black gained? Nothing but loosing a tempo. The greatest chess deficit my opponent has is missing a feeling for speedy development. As Steve Ballmer pointed out: \"Development, Development, Development\", wasn't it? Once he has overcome his typical opening worries from lacking decent development his tactical insights and feeling for middlegame positions often troubles a lot of players including me.",
        "7. Bd3": "Putting the bishop on c4 and working along the a2/g8-diagonal was another option.",
        "7... e5": "Attacking my d4-pawn twice.",
        "8. d5": "Since I don't want him to build up pressure against my f-knight with 8. dxe5, Nxe5 I simply kick his knight around one more time, thereby denying him neccessary development yet again.",
        "8... Nd4": "Puzzled! He refuses to acknowledge that his opening has comletely misfired. Now he falls back to his natural pattern of hacking his way through, forgetting this is correspondence chess. This minimizes the chances of success to about zero. This move simply looses a pawn.",
        "9. Bxd4 exd4": "So this pawn is hiking into my territory without real support. Means it's doom is sealed.",
        "10. h3 Bxf3": "This makes it even easier for me. Had the bishop still be pinning the knight, harvesting the d4-pawn would have required more effort.",
        "11. Nxf3 c5": "Though this doesn't save his fellow on d4, I guess it's correct to open lines for fluid piece play. This increases chances to create compensating threats.",
        "12. dxc6 e.p. bxc6 13. Nxd4": "My pledge to a long-term win.",
        "13... Qb6": "Here is his counterplay. I need to consolidate for a couple of moves.",
        "14. Nb3": "Of course defending both attacked men.",
        "14... Be7 15. O-O O-O 16. Kh1": "The immobility of my knight is somewhat troublesome. But I decided any attempts to resolve this problem with say Rb1 would be artificial at this point. So I prepared for sound aggressive moves towards the kingside. And that would need some pawn pushes.",
        "16... Rfd8": "Good move! His play will be on the queenside and center, build upon his c- and d-pawns.",
        "17. Qe2": "His rook was hitting my queen. This usually pays off in the long run. So I placed her where I thought she would be most useful for my kingside attack. What kingside attack you ask? Just see.",
        "17... a5": "Good move again. Gaining space and eyeing my b-pawn.",
        "18. a4": "That must be prevented of course.",
        "18... c5": "I didn't understand this at first sight. Aren't his pieces best suited for a d-pawn(!) advance? Then I saw that he is in more trouble than I thought. Advancing the d-pawn at this point would give way to my e-pawn which makes my bishop very powerful. So I figured he speculates on forking knight and bishop after some more preparatory moves and ...d5, finally.",
        "19. f4": "Whenever I can go for my plan I do so. Even though my pawn duo can be undermined by ...d5. But I calculated things and decided it's up to him to prove that his plan would be working.",
        "19... d5": "Here it comes; straight from his hips. He his glancing at the possible fork on c4, plus ruining my pawn duo and freeing his d-rook. Good move!",
        "20. exd5": "The fork must not be allowed since I want to keep my bishop. My lonely f-pawn didn't trouble me much. The rook can now be made active by Rf3 and Rg3 for instance.",
        "20... Nxd5 21. Rad1": "Planning Bc4.",
        "21... Bf6": "Very natural. The bishop was kinda hanging and is now targeting my extra pawn on b2.",
        "22. Qe4": "Unpleasant threat to the h7-pawn.",
        "22... g6": "The only choice possible. Allowing my queen to get to h7 by 22. ...h6 would be way too dangerous.",
        "23. Bc4": "So with the d3/h7-diagonal pretty blocked and secured the bishop became quite useless on d3. Placing it to c4 weakens the g6-pawn and therefore prepares my assault with the storm troopers, eh, white pawns, I mean.",
        "23... Ne7": "The attacked horse has to give way of course. At this stage of the game we were meeting in person and he frankly pointed out his anticipated knight route which included the juicy squares f5 and than look at the huge hole at g3!! Fortunately my attacking plan neatly addresses this issue.",
        "24. g4": "My lonely f-pawn isn't that lonely anymore, thus giving it a real function: To build up pressure on the king's pawns. This makes the gates to my castle wide open on the other hand. So precise calculation was mandatory.",
        "24... Nc6": "Black felt obliged to meet the threat 25. g6 which seemingly would have lost the knight. But this isn't true. (Note, 24. ...Re8 can be dealt with via 25. Bb5.) No, while writing this I found out that 25. g6 isn't a threat at all, because it abandones the f5-square and White had to deal primarily with the big fork on g3 after 25. ...Nf5, thereby allowing ...Bg7. So actually at this point I haven't had a single positional advantage at all. My only surplus was the extra pawn. Until this knight move weakened the g6-pawn.",
        "25. g5": "Before playing f5 challenging the g6-pawn, I figured it makes sense to deny the blocking ...g5. Even at the cost of my extra pawn.",
        "25... Bxb2": "Here I kiss it goodbye. Just the move I expected.",
        "26. f5": "Batman and Robin making their way. Now the g6-pawn is doubly attacked for the pinned f7-pawn.",
        "26... Rxd1": "Before dealing with it he first wants some simplification. Correct! This draws my rook away from the dangerous f-file. It was me who had to take on d8 first. ",
        "27. Rxd1": "Now one cannon is off the f7-pawn. I expected the defending ...Kg7 now, but was totally surprised by...",
        "27... gxf5": "This allows a tactical massacre. Do you see it? Shouldn't be that hard.",
        "28. Bxf7+": "I can harrass him with queen and rook with no black pieces around to do some blocking. Funnily this doesn't lead to checkmate but a massive material gain. If he would play the most precise defensive moves. But just see.",
        "28... Kxf7 29. Qxf5+ Kg8 30. Rd7": "Threatening checkmate. The only defense to this is: 30. ... Ne7. This sacrifice temporarily blocks the rook and gives way to the most potent protecter: the black queen. After 31. Rxe7 (renewing the threat of mate), there comes 31. ... Qg6 preventing the worst. But everything is lost material-wise after the fork 32. Qd5+, Kf8 (equally attacking the white rook). The zwischenzug 33. Re6 saves the white rook by attacking the black queen. And after 33. ...Qf7 the last black rook falls with check again: 34. Qxa7+. This leaves White with rook and pawn ahead and no obnoxious counterplay in sight. If, yes, if black hadn't decided to commit suicide.",
        "30... Nd8": "Not getting into the depths of the positon at all. But I can understand that. The \"let's get it over with\" mood allows me to checkmate in 3.",
        "31. Qxh7+ Kf8 32. Qe7+ Kg8 33. Qe8#": "So finishing off my dearest chess enemy with tactical measures which happens to be his ground, gave me a lot of pleasure. Hope you enjoyed it."
    },
    "url": "https://gameknot.com/annotation.pl/my-dearest-chess-enemy?gm=32466",
    "gameName": "My dearest chess enemy!",
    "players": "cptblackbeard (1683) vs. edwidg23 (1536)",
    "opening": "KP (B00), Nimzovich defence"
}