{
    "moves": {
        "1. d4": "Welcome to the first in what I hope will be a long line of annotated games from me. I'm just learning how to play chess, having seen a few games played and having been decimated by a friend every week when we meet for coffee I decided it was time to learn to play. My friend advised me to sign up here and annotate every game, win lose or draw. None of my annotations are likely to be good, however if anyone spots something I didn't or has a better explanation for a move made then please chime in!",
        "1... Nf6": "My opponent began with a Queen's pawn opening, so I responded with my favourite attempting for an Indian Defence.  I'm told that Queen's pawn is slower than King's pawn for castling, however provides for more tactical play.",
        "2. Bg5 Ne4": "Internet's tell me this is the \"Trompowsky Attack\".  I think it looks pretty weak if I'm honest, however I think my response was probably not a good plan in hindsight.  My response is pretty instinctual, I decided to threaten the Bishop immediately with Ne4.",
        "3. Nh3 Nxg5 4. Nxg5 d5": "This is where I realised I may have made a mistake.  After 4 moves, material is even but positionally White is better.",
        "5. Qd2 e6": "Lucky for me White decided to play Qd2 I guess! Allows me to protect my d5 pawn with e6.",
        "6. e3 Nc6": "White follows suit, leaving his Knight on g5 undefended. I don't spot this until move 8.  I play Nc6 with the intention of threatening White's Queen through Bb4.  I think a better move for me would've been 6...Qxg5, allowing me to capitalise on White's error.",
        "7. Bb5 Bb4": "Luckily for me, White makes another error with 7. Bb5.  I think a better move would've been Nf3 which after 7...a6 8.Be2 Bd6 9.O-O O-O would've kept things even.  However, not to spoil our errors catalogue, I continued by moving Bb4! The idea was to threaten White's Queen, as stated in the previous move.  I had got so caught up in my 'strategy' I didn't spot the hanging Knight until after I submitted the move.  Once more, I think the best move was Qxg5.",
        "8. c3 Qxg5": "White threatens my Bishop and Knight through pawn on c3 and Bishop on b5.  I think Qxb4 was probably the better move.  However, I've finally noticed the open and undefended Knight on g5 so decide to exchange by taking with my Queen.  This allows me to threaten White's weakened g2 pawn.",
        "9. Bxc6+ bxc6": "White doesn't accept my exchange and decides on a different exchange instead.",
        "10. Na3": "Na3! Well, this was a major blunder.  White gifted me a knight and two pawns in exchange for my bishop.  This pretty much gives me the game, so long as I can manage to make no blunders of my own!",
        "10... Qxg2 11. Rf1 Bxa3 12. bxa3": "White does all he can to protect his rook, but Rf1 was another error in our game.  I think O-O-O was better, ending with me winning an extra pawn in material to what I'd lose after Bxa3.\r\nI decide on another exchange, this time a Bishop for a Knight and a pawn.  This completely cripples White's pawn formation.",
        "12... Qxh2": "Duh! What was I thinking? Ba6 would've netted me White's rook :(",
        "13. f4": "White offers an exchange of Queens",
        "13... Qxd2+": "Since I'm up in material and position I accept",
        "14. Kxd2 Ba6": "Threatens White's rook.",
        "15. f5 Bxf1 16. Rxf1": "White misses my threat or ignores it, so I exchange my final bishop for one of White's rooks.  This leaves White with only 1 major piece to continue the game with, leaves him down 2 pawns and with no pawn formation to speak of.  The game looks as good as over to me.",
        "16... O-O": "I finally castle, freeing my second rook and defending my king.",
        "17. f6 g6 18. Re1 Rab8": "Finally I decide to seize the open b-file.",
        "19. Ra1 Rb2+ 20. Kc1": "I think Kd3 was better.",
        "20... Rh2": "Should've gone Rfb8 with a view to playing 21.c4 Rg2 22.Rb1 Rxb1+ 23.Kxb1 h5 24.cxd5 exd5 25.e4 h4 26.e5 h3 27.e6 h2 28.exf7+ Kxf7 29.a4 h1=Q#",
        "21. Rb1": "White seizes the open file",
        "21... Rh1+": "But I have different plans.  I skewer and check White's king.",
        "22. Kb2": "White moves into mate",
        "22... Rb8+": "And I have spotted it! Mate in 8 begins.",
        "23. Kc2": "Final move by my opponent, who seems to have finished playing this game.  Shame really, but amusing for me since it's pretty much my first game with time limits of more than how long you can delay a move by sipping your coffee! :)",
        "23... Rbxb1": ""
    },
    "url": "https://gameknot.com/annotation.pl/my-first-game-away-from-costa-coffee?gm=25778",
    "gameName": "My First Game Away From Costa Coffee",
    "players": "xxmetsxxx (1200) vs. freddz123 (1200)",
    "opening": "Trompovsky attack (Ruth, Opovcensky opening) (A45)"
}