{
    "moves": {
        "1. e4 c6": "Caro Kan",
        "2. d4 d5 3. Nc3 dxe4 4. Nxe4 Bf5 5. Ng3 Bg6 6. h4 h6 7. Nf3": "The main thing I was telling myself was don't make an obvious mistake. This proves to really help.",
        "7... Nd7 8. Bd3 Bxd3 9. Qxd3 e6 10. Bf4 Qa5+ 11. c3": "Apparently Bf4 was slightly inaccurate and here I should have played Bd2 still allowing me an ability to castle Queenside after this move the queenside is too vulnerable to play over and to vulnerable for me to want to castle that way.",
        "11... Ngf6 12. O-O Nh5": "His first error. From this point on I keep him down. This move is a waste of a move. He should continue to develop. What I like about this game is it wasn't like he just dropped a piece. I had to fight for it.",
        "13. Be5": "I think this is a good move. If he takes my knight I take with my pawn putting pressure on his king side with my rook.",
        "13... Nxe5 14. Nxe5 Nf4": "With this move he drops a pawn. Nh5 though an error was not as bad as this move.",
        "15. Qf3 g5": "Can't move the knight.",
        "16. Nh5": "Boo yah. Wins a pawn. By the way just for laughs I had not eaten breakfast, I was unprepared and hungry. Well they had doughnuts out. They were running out so I had to get one so while he was thinking I gat a doughnut and brought it back to eat while playing. Oh well I am 1590 and he's just a 2100 I can eat a doughnut while playing.",
        "16... Bd6 17. Nxf4 gxf4 18. Qxf4 Qc7": "Yes he could play Bxe5 And trade off into a rook endgame a pawn down and its probably best, but believe me you wouldn't do that against someone 600 rating points below you who is doing good.",
        "19. Qf6 Rf8 20. f4": "Just solidifying. Rae1 might have been better.",
        "20... Be7": "Forcing me to take yet a second pawn.",
        "21. Qxh6 O-O-O": "A third!",
        "22. Nxf7": "He saw the possibility I think but was feeling squeezed.",
        "22... Rde8 23. Qxe6+": "A fouth. Four pawns up. I was excited believe me.",
        "23... Kb8 24. Ne5": "Rae1 would once again be better but this is fine.",
        "24... Rfh8 25. Nd7+": "h5 perhaps would have been better.",
        "25... Ka8 26. Rae1": "Finally!",
        "26... Rxh4": "He's dying now.",
        "27. Nf6": "another shot.",
        "27... Reh8 28. Qxe7": "He simply resigned as there is no hope in this position. This is a great game to study and analyze in depth and it might be fun to go through some of the comples lines."
    },
    "url": "https://gameknot.com/annotation.pl/my-first-2100?gm=31336",
    "gameName": "My first 2100",
    "players": "Minital  vs. Tom ",
    "opening": "Caro-Kann (B19), classical, 7...Nd7"
}