{
    "moves": {
        "1. d4 d5 2. Bf4 Nd7": "In my way to play this opening, this self-blocking the dsb is not often played, and I don't think it is the best option for black unless he plays very soon after c5. ",
        "3. Nf3 Ngf6 4. h3 c6": "Too passive, and black becomes squeezed. ",
        "5. c3 e6 6. Nbd2 Be7": "No hurry, since black's only way to \"do something\" is to play c5, and he obviously doesn't want to. ",
        "7. Qc2 O-O 8. e4": "The first strike. ",
        "8... dxe4 9. Nxe4 Nxe4 10. Qxe4": "The backside is that I freed his black diagonal...",
        "10... Nf6 11. Qe5": "This was an aggressive move. I take advantage of the badly coordination of the black pieces to shrink them even more. My aim is to bring the queen to the kingside, and see if she can survive or win the attack. ",
        "11... Nd7 12. Qh5 Bf6": "Nf6, and I have had to think something, but the way back to e5 is still open. ",
        "13. Ng5": "I couldn't see nothing better. ",
        "13... Bxg5 14. Bxg5 f6 15. Bf4": "Now black can reject my queen with g6, but I doubt it would be wise on the long term.",
        "15... Qb6 16. O-O-O": "Thank you, I needed a tempo to castle...",
        "16... a5 17. Bc4": "I think that this was very interesting, and more effective than Bd3 (h6). But white has to be fighted very carefully to reject him...",
        "17... c5 18. Rhe1": "Pressing further the pinned e6. Another good option was to go at once for dxc5, Nxc5, Be3, trying to win the pinned knight, but it can give check, so it's a dangerous path to follow. ",
        "18... Nb8": "Only way to defend the e6 point, but it leaves me the way open to...",
        "19. dxc5 Qc6 20. Bd6": "? Rd6 was better. ",
        "20... Rf7 21. Rxe6": "I estimated this to be a touch of class. I will recover the exchange anyway, and the two bishops with the queen should be able to mate.",
        "21... Bxe6 22. Bxe6 Qe8": "Only move, but not a bad one. I couldn't see anything better that to exchange, as Bf5, g6 and probably Bxg6 could have been a pawn's ecathomb for black. Maybe. ",
        "23. Bxf7+ Qxf7 24. Qf5": "I wanted to have more that QxQ, and two pawns, but it went out to be a bad idea. ",
        "24... Nc6": "If Qxa2, Qc8#.",
        "25. Kb1 a4 26. Qd5": "Ok, no way, let's exchange queens and see the endgame. ",
        "26... Re8 27. Qxf7+ Kxf7 28. Bf4": "If Re2, Be3 block the rook. ",
        "28... Re7": "Defending Rd7+",
        "29. a3": "Maybe not necessary. ",
        "29... Na5 30. Be3 Nb3 31. Rd8": "I exchanged his good b3 knight (now under control) for my rook penetrating his field. ",
        "31... Rc7 32. Rb8": "Wrong path. Ra8 instead was better. ",
        "32... Ke6 33. Ra8": "Indeed :-8. A tempo like this costs you the game. ",
        "33... Nxc5": "I acknowledged I had to lose my bishop for his knight in order to win another pawn. In the hindsight, I'd be not so sure. With this kind of endgame, my bishop is stronger than his knight, I think. ",
        "34. Bxc5 Rxc5 35. Rxa4": "Come on, this has to be like sewing... an \"easy to win\" position. Just a matter of elementary endgame technique. Let's see how I was able to... throw away the game. ",
        "35... Kd7 36. Ra7": "This was the wrong decision, I think. I sacrificed the rook's activity because I thought that the pressure on b7 will restrict black's movement as much as I needed to advance my pawns. I just have to be careful not to have it trapped, and in that case, the \"escape route\" Ra8 must be possible. And another escape route against Kb8. I wasn't aware of all this in a blitz. ",
        "36... Kc6": "Black plays this with the intention of leaving the rook where it is, and try to penetrate white's field, since the king can't defend both sides. ",
        "37. Kc2 Re5": "I told you. ",
        "38. Kd2": "The only reasonable move. But black can try to draw the game by bouncing among d5 and e5. ",
        "38... Rg5": "This gives me an idea: try to block the entire row with my pawns, so I can defend from the penetration while advancing my pawns. ",
        "39. g4 Rb5 40. b4": "I want to restrict the rook's movements so he can't penetrate. I was not completely sure about the plan. ",
        "40... Re5 41. f4 Re4": "Kd3 is not possible, because of Re1, and the pawns will fall. I realize about here that my only chance is to sac my king pawns and try to get the most from my queenside pawns. ",
        "42. f5 Rf4 43. Ke2": "I open this comment for rickdaily12 that notes the following: \"Wishing you would slow down the speed of the annotations at this point. :/ As for this section, the only defining mistake I would have indicated was 43 Ke2, followed by 45 c4. That lost you far more tempo than Ra8, I would think. Yes, Ra8 didn't help you much either, but now you spend time pondering where a king should go as a rook denies it a rank. The king is slower (let alone game pivoting) so it should have sought shelter in the general b3 area, I think. Instead, you've left it more exposed to the rook as it finds better places to attack while checking you, after c4 was played.\". The issue was the black's rook penetration. I was still trying to avoid it.\n",
        "43... Rc4 44. Kd3": "Now black can \"propose draw!\" by repeating threats with the rook, and I can stop it but I can't avoid it to threat the following move. ",
        "44... Rf4 45. c4": "So I decided to sac the pawns and I went for the risky path. ",
        "45... Rf3+ 46. Kd4 Rxh3 47. a4": "I wanted to preclude b6 to the black king with a6, even if it will cost me another pawn. But I miss a tempo to open a way for my king to advance after Rxg4+ - shortly coming.",
        "47... Rh4 48. b5+ Kc7": "Black doesn't want to bo to b6 (I have to respond Ra8), because, very intelligently, he prefers the white rook where it is. But he has few moves left. I was happy having provided a square for the king on d5, and I wanted to cover b6, as planned. So I played...",
        "49. a5": "?? In doing this, I was cutting myself the second \"escape route\" for the rook, and I wasn't aware of that. Instead, Ra8 was indicated. ---Edit: or Kc5, as sickdaily12 points in the comment below (I hope it will be kept after the editing) ",
        "49... Rxg4+ 50. Kd5 Kb8": "The rook can be defended, but it is trapped forever. No good. But three joined pawns should win, shouldn't they? ----EDIT: Asi rickdaily12 points out, the rook defended by b6 was not as hopelessly paralyzed as I thought, but I'm not sure you considered that the black rook is free to go to the first rank and check my king, or advance the h pawn... a lot of plans that need to be carefully studied. A good \"food for thoughs\" about endgames, isn't it?",
        "51. Rxb7+ Kxb7 52. c5 Rf4 53. Kd6": "If I defend f4, I will lose the other pawns, and h5 will beat me soon after. Black can sac the rook for two pawns and take the third with the king. ",
        "53... Rxf5 54. c6+": "?? The wrong advance. I have to play a6, because c5, guarded by the king, is my defence against the rook. ",
        "54... Kc8": "Now I can't avoid to lose a pawn. ",
        "55. b6 Rxa5 56. b7+ Kb8": "No. They don't if I play like that. Learn, beginners, how NOT to play an endgame. Which were the bad strategic decisions white has made that lead him to this after such a wonderful attack? How big blunders were white's, that led him to this defeat? :-)",
        "57. Ke7 Rc5 58. Kd6 Rc1 59. Kd7 f5": ""
    },
    "url": "https://gameknot.com/annotation.pl/my-fault?gm=50964",
    "gameName": "My fault",
    "players": "damalfi  vs. mikimikenew ",
    "opening": "Queen's pawn, Mason variation (D00)"
}