{
    "moves": {
        "1. e4": "This is a game against fellow Southern Chess member tnaptguy. He named this game \"My game is in the toilet!\" However, his game seems to be very good, from my viewpoint. We play a very even game...",
        "1... e5 2. Nf3 d6": "? I don't like opening the diagonal for Bb5. I never have. If I play the common Bb5  he has many sensible replies, but he would have to respond to MY move, as opposed to making one of his own accord.",
        "3. d4": "If it's a fight for the center he wants, it's a fight he'll get!",
        "3... f6": "!? Tricky. That e5 square must be very important to Black...",
        "4. dxe5": "...so I decide to capture.",
        "4... dxe5 5. Bc4": "Quick recap. I have two minor pieces developed whilst Black has only his two pawns. However, there are no pieces in front of the queens...",
        "5... Qxd1+": "...cat fight! Black opts to force my king to lazily move.",
        "6. Kxd1 Bc5": "Now that he has unearthed the king, it's time to attack the exposed pieces.",
        "7. Be3": "White does NOT want this exchange. An exposed king doubled pawns=trouble",
        "7... Bb6": "? Thankfully, it doesn't happen. However, this is questionable. He is inviting me to double one of HIS pawns? I'm sure he had a plan, but I don't see it.",
        "8. Bxb6 axb6 9. Bxg8": "?? What on earth is White doing? He has left his king totally exposed! In truth, I feared 9. ... O-O for this reason. I need his rook to have trouble developing.",
        "9... Rxg8 10. Re1": "Now MY rook is free, whilst my bishop move has stalled his matching rook.",
        "10... b5": "? I don't know what this was for.",
        "11. b4": "?! I guess that Black's previous move was an attempt at control of the queen side. so I refute this.",
        "11... Nc6": "Now I am THANKFUL for my previous pawn move. I can safely refute his assault.",
        "12. a3 g5": "! Now he's coming on the KING side, but my defense is clear.",
        "13. h3": "Of course.",
        "13... Be6": "! Nice positional move! His bishop now controls many more squares than before, plus it opens the path for castling.",
        "14. Nc3": "! Planning an assault on b5?",
        "14... O-O-O+": "Very pretty, but easily refuted.",
        "15. Kc1 Nd4": "!! Nice!",
        "16. Nd5": "!! One nice move deserves another!",
        "16... Rg7": "Preparing to double his rooks.",
        "17. Nxf6": "!? Very risky. Black has attacking chances from many angles and white commits a pawn grab while guarding d7 from a doubled rook scenario.",
        "17... Nxf3": "Opening the door for his rook to advance while doubling my pawns.",
        "18. gxf3 Bxh3 19. Ng4": "!! Although it allows Rg-e7, it traps the bishop while threatening e5. White no longer fears the doubled rooks.",
        "19... Re7": "Necessary to save his e5 pawn.",
        "20. Re3": "?! What is this? It weakens White's back rank considerably, plus it does nothing to refute doubled rooks. A mistake...or a trap?",
        "20... Red7 21. Rd3": "! Oh! White wanted to plug the nasty hole in his d file with a rook of his own.",
        "21... Rd7xd3 22. cxd3 Rxd3 23. Nxe5 Rd8 24. a4 Re8 25. Nf7 g4 26. fxg4 Rxe4 27. f3 Re3": "? Black fails to see all of White's threats.",
        "28. axb5": "!! Intentionally doubles his own pawns to set up a discovered back rank attack! This move could really hurt if all pieces are exchanged, but White has no intention of that.",
        "28... Rxf3 29. Ne5": "!! Simultaneously attacking the rook, protecting the pawn, and...",
        "29... Rf1+": "Black elects to put pressure on the king.",
        "30. Kb2": "Forced.",
        "30... Rf4": "??? Seems serviceable, but black has completely lost scope here. He is fighting for the center and does not see his demise!",
        "31. Ra8#": "Mate. I'm fairly certain that my opponent will stare at the board for a second and wonder why he cannot move to d7. On 29. Ne5, I did not reveal the THIRD item that was attacked: an escape square! Great game, tnaptguy. Thanks for watching! :)"
    },
    "url": "https://gameknot.com/annotation.pl/my-game-is-in-the-toilet?gm=7023",
    "gameName": "My game is in the toilet!",
    "players": "rustyrusty (1088) vs. tnaptguy (1100)",
    "opening": "Philidor's defence (C41)"
}