{
    "moves": {
        "1. e4": "I started off with my favourite King's Pawn Opening. I always like to play e4 instead of any other move.",
        "1... c6": "My opponent kicked off with the Caro-Kann Defence. The Caro-Kann Defence is a passive but pretty strong defence against the King's Pawn. As I naturally feel uncomfortable being aggressive, I pretty much anticipated this game.",
        "2. d4 d5 3. Nc3 dxe4 4. Nxe4": "We went throughthe most popular bookmoves...",
        "4... Bf5": "My opponent played Bf5 at move 4, leading to the Classical Variation of the Caro-Kann.",
        "5. Ng3 Bg6 6. h4 h6 7. Nf3 Nd7 8. h5": "I chose to play the Spassky Variation...",
        "8... Bh7 9. Bd3 Bxd3 10. Qxd3 e6 11. O-O Ngf6 12. Bd2": "The game continued with quiet developing moves.",
        "12... Bd6": "My opponent slided his bishop to d6, planning to take on g3 and hurting my pawn structure on my kingside.",
        "13. Nh4": "I did not want that to happen, so I moved my f3 knight away, using my queen to protect my g3 knight. This ensures that my pawn structure stays okay, but the downside of this move is that one of my knight has moved to the rim of the board, which is, bad.",
        "13... Qc7": "Black creates a battery along the b8-h2 diagonal.",
        "14. f4": "I blocked the diagonal off...",
        "14... O-O-O 15. f5": "Horrible! I did not notice that I left my knight exposed with only one defender, which means I am going to lose a piece.",
        "15... e5": "My opponent did notice the juicy knight on g3...",
        "16. dxe5 Nxe5 17. Qe2 Rhe8 18. Qf2 Neg4 19. Qf3": "My queen went into a frenzy...",
        "19... Bxg3": "And I lost my g3 knight. This is pretty much the start where I was thrashed.",
        "20. Bf4 Bxf4 21. Qxf4 Qxf4 22. Rxf4": "I did a meaningless counterattack by trading off the bishops and queens. Looking at this position, you can pretty know why I had a bloodshed. My knight is sleeping at the rim, the 1st and 2nd ranks are weak and my opponent has the ability to attack there, my pawns at the queenside are weak, and my king does not have a safe square to escape.",
        "22... Rd2 23. Rc1 Ree2": "My opponent comes in and grabs my c2 pawn.",
        "24. Ra4 Kb8": "A useless counterattack.",
        "25. b4 Rdxc2 26. Rxc2 Rxc2": "I tried to save my pawns on the queenside.",
        "27. Nf3 Ne3 28. Ne1 Rb2 29. Ra3": "I am pretty much forced to defend from my opponent's powerful attack. There is simply no good move for me to salvage the situation. Meaning? More bloodshed.",
        "29... Nxf5": "My opponent jumps around and grabs anything that is unprotected from me...",
        "30. Nd3 Rb1+ 31. Kf2 Nd4 32. Ne5 Rxb4 33. Nxf7": "I tried to grab a few pawns to save my position, but it is plain useless. You will see.",
        "33... Nxh5 34. Ne5": "Now I am already 6 points down, which is equivalent to having a disadvantage of 2 minor pieces. What a mess for me!",
        "34... Rb2+ 35. Kf1 Nf4": "I tried to hang on facing my opponent's onslaught, although knowing that I had lost. ",
        "36. Ra4 Nfe6 37. Nd3 Rb5 38. Kf2": "A countermeasure to stop my opponent from chopping me all around.",
        "38... g5 39. Ke3": "My final decision was to use my king to attack my opponent's pieces and hope that my opponent makes a blunder",
        "39... Rd5 40. Nb4 Nf5+ 41. Ke4": "My final, horrible, and terrible blunder. So it turns out htat it wasn't my opponent who blundered in the endgame but me!",
        "41... Nc5+": "And the final assasination of my pieces. My opponent made a king-rook fork which leads me to a position where I am dead lost. I resigned at this position, seeing that I had no way to save myself after making a blunder. This game is a memorable game for me, as it really made me think how did I go wrong. Hope you chess fans would like this annontated game where I lost horribly."
    },
    "url": "https://gameknot.com/annotation.pl/my-horrible-loss-against-powerguru?gm=38866",
    "gameName": "My horrible loss against powerguru",
    "players": "feathers8x8world (1423) vs. powerguru (1641)",
    "opening": "Caro-Kann (B19), classical, Spassky variation"
}