{
    "moves": {
        "1. e4": "the standard King's Pawn opening.",
        "1... d5": "The chesscube move list calls this the Scandinavian (centre counter) defence, and I had it confused with the Old Benoni defence (which is 1.d4 c5) Still, it did work for me here, so I'm going to experiment with it",
        "2. Qf3": "?! This move does appear in the GK database, but I really don't like the idea of the queen being out this early",
        "2... Nf6": "developing, and giving some defence to the d5 pawn (checking the database, dxe4 was recommended here)",
        "3. exd5": "capturing the d-pawn (e5 was played in the database, but it doesn't seem as reliable as there were only two games played with this - by the way, is it wrong for me to be relying on the database so much?)",
        "3... Nbd7": "?! I considered Nxd5, but played this move instead. Immediately afterwards, I changed my mind and requested a takeback. My opponent declined. This is a developing move, but it blocks my queen's access to the d-pawn. However, the pawn doesn't pose any real threat at this point",
        "4. Bc4": "I prefer Bd3 here",
        "4... e6": "This move loses a pawn, but it puts White's bishop in a bad place - it gets pinned with Qe7 (I'll be honest - that wasn't what I was thinking when I played this move. I wanted to free my black bishop for a castle opportunity)",
        "5. dxe6 fxe6": "pawn trade....",
        "6. d3": "but White doesn't go for the exchange straight away - this move was probably with the intention of Bg5 (it also denies an easy escape for White's bishop, but there's no threat on it, so that doesn't matter much here)",
        "6... Bc5": "maybe not the best place for the bishop, as White could chase it with c3, then b4",
        "7. Bxe6": "? this nabs that extra pawn I was talking about, but falls to...",
        "7... Ne5": "! a double-attack on the bishop and queen (Qe7 isn't as strong due to Qe2)",
        "8. Qf5": "The only move to protect both pieces, but the queen is in deep here",
        "8... Bxe6 9. Qxe6+": "?! I feel that Qxe5 was better here",
        "9... Qe7": "Offering an exchange of queens, which ought to be bad for Black (given that he's behind in development) but I feel he compensates for his big lead in development (castling queenside is also a great move for Black after the exchange - Black gets the rook on the half-open d-file and the king is secure on c8 with the queen and light bishop gone)",
        "10. Qf5": "?? White should have exchanged - in fact, it was forced! This move leads to mate in two",
        "10... g6": "? Black doesn't see it right away...",
        "11. Qh3": "? and neither does White (I should note that even if he had seen the danger, the only moves that would save him are Ne2 and Bc3 - both moves involve losing the queen",
        "11... Nf3+": "double check! This is the first game that I've been able to utilise this power. White has to move his king...",
        "12. Kd1": "this, and Kf1 both lead to mate with...",
        "12... Qe1#": "good game :)"
    },
    "url": "https://gameknot.com/annotation.pl/my-quickest-check-mate?gm=26670",
    "gameName": "My quickest check-mate!",
    "players": "zolar (1298) vs. hammycat (1272)",
    "opening": "Scandinavian (centre counter) defence (B01)"
}