{
    "moves": {
        "1. e4 c5 2. Nf3 d6 3. d4 cxd4 4. Nxd4 Nf6": "4. ........... Nf6 - the first four moves are standard Sicilian book moves.",
        "5. Nc3 g6 6. Be3 Bg7": "6. ........... Bg7 - the Sicilian Dragon.  Bishop goes to g7 to hit out along the a1-h8 diagonal.",
        "7. f3 Nc6 8. Qd2 a6 9. O-O-O": "9. 0-0-0 - the beginnings of the Yugoslav Attack.",
        "9... b5": "9. ............ b5?? - loses piece.",
        "10. Nxc6 Qc7 11. Nb4 Bb7 12. Bh6 O-O 13. Bxg7 Kxg7": "13 ........ Kxg7 - now that I am a piece up I try to simplify.  More wood will disappear from the board in the next few moves.",
        "14. Nbd5 Bxd5 15. Nxd5 Nxd5 16. Qxd5 Rfc8 17. Qd2": "17. Qd2 - queen scurries back to defend her other half against Old Matey on c2.",
        "17... b4": "17. ............ b4 - tries to lure the queen away from the defence of c2 but I am in no mood to lose my king!",
        "18. b3 a5 19. Bc4": "19. Bc4 - screens off the c file.",
        "19... a4 20. Kb1 axb3 21. cxb3 Qa5 22. Qb2+ Kg8": "22............ Kg8 - king gets out of check and my queen adopts her usual defensive stance.  As usual my opponent has the attacking queen and me the defending one.  At least my queen succeeds in this role here and will go on to turn the tables against my unsuspecting opponent.",
        "23. Rdc1 e6 24. Rhd1 Rcd8 25. Rc2 Ra7 26. Rdc1 d5 27. exd5 exd5 28. Bf1": "28. Bf1 - over the last few moves I have been buttressing my king's castled position but at the same time taking control of the c file and the bishop move to his home square looks passive but it does give my rook on c2 a foothold to challenge the open e file should black choose to plonk a rook on there.  I really do want to exchange off those heavy pieces.",
        "28... h5": "28. ........ h5 - to give the king some luft but this will assist me later on.",
        "29. Rc2c8 d4 30. Rxd8+ Qxd8 31. Bd3": "31. Bd3 - one pair of rooks has just been exchanged and the pressure on the a file has eased.  Hip, Hip, Hooray!!!",
        "31... Kh7 32. Rc4 Qh4 33. g3": "33. g3 - shoo, go away Wicked Witch of the West, shoo!  Nice if he could play Qxh2?? here!",
        "33... Qe7 34. Qxd4 Qe1+": "34. ....... Qe1  - I ascertained that I could safely take off the passed d pawn and allow this check because my rook can simply interpose on c1 - so the Wicked Witch of the West is again driven back to e7.",
        "35. Rc1 Qe7 36. Kb2": "36. Kb2 - took a couple of days to decide on what move to play.  Did not have a clue as to how I could convert this advantage into a victory.  Black is still so active.  Can't afford to offer a draw here - I will lose 6.5 points!  I find a safe move and see what my opponent does.  He amazes me with ...........",
        "36... Rc7 37. Rxc7 Qxc7": "37. ........ Qxc7  ............. allowing me to exchange rooks on c7.  Now another black pawn falls as black has no dangerous checks here.",
        "38. Qxb4 Qd7 39. Qc4": "39. Qc4 - keeping my queen in an active yet defensive position, trying to block off all exits.  Have vague idea about pushing my queenside passers up the board but I must make sure that my king is safe from checks.  Some queen checks in an endgame can be perpetually annoying!!  This move lays 2 traps.  If 39. ......... Qe7 then 40. Qc3 Qe3?? then the stinger discovery 41. Bxg6  comes and it is Ding Dong the Wicked Witch is dead!  Now the second trap, well ............",
        "39... Qh3 40. Qxf7+": "40. Qxf7   .......... with 39. ......... Qh3?? he falls for it hook, line and sinker.  He fatally abandons his f pawn and now if he moves his king to h6 then Old Matey strikes on g6.  If he plays his king to h8 then the bishop will take on g6 threatening mate on h7.  Black does have one spite check on g2 or h2 but the white king can go to a3 avoiding further checks.  Black can only delay mate on h7 by sacrificing his queen.  Black realised this and I was greeted with the white flag and found myself 3.1 rating points better off when I arrived home from work today!!"
    },
    "url": "https://gameknot.com/annotation.pl/my-queen-gets-mean?gm=15795",
    "gameName": "My Queen gets Mean!!!",
    "players": "jstevens1 (1621) vs. Unfortunate Opponent (1336)",
    "opening": "Sicilian (B75), dragon, Yugoslav attack"
}