{
    "moves": {
        "1. e4 e5 2. Nc3 Nf6 3. Nf3 Bb4": "?! This is actually a perfectly good move, but psychologically it was a terrible mistake. I didn't want to go into the \"boring\" Four Knights Game against a \"boring\" opponent. Instead, I played a move that I had seen mentioned in Modern Chess Openings but that I had never actually studied.\nThis was bad psychology on two counts. First, it is in no way true that we are condemned to a \"boring\" game after 3. ... Nc6. Things can get very interesting after 4. Bb5 Nd4, the Rubinstein Variation. Second, playing a move that you have never played or studied, against a very seasoned master, is a recipe for disaster. Especially in double e-pawn openings, which can get tactical in a hurry.",
        "4. Nxe5": "! And now I am totally, completely out of my personal book knowledge.",
        "4... Qe7": "Probably more in the spirit of things is 4. ... O-O, but mentally I wasn't ready to play a pawn down in an unknown position -- even though it's quite a promising pawn sacrifice.",
        "5. Nd3 Nxe4": "?? Yes, this is a blunder. But no, it's not the kind of game-ending blunder I thought it was. Black should play 5. ... Bxc3 6. dc, and now after 6. ... Qxe4+ 7. Be2 O-O White has at best a tiny advantage due to the two bishops. Or Black can play more ambitiously with 7. ... Qxg2?! 8. Bf3 Qh3, when White has a lot of compensation for a pawn but it's nevertheless a tense, unclear position. People who enjoy defending a long time in order to win in the endgame should like that variation; I probably wouldn't enjoy it.",
        "6. Nd5": "! This move hit me like a ton of bricks. None of the usual tricks work. After 6. ... Nc3+ 7. Nxe7 Nxd1 8. Nxb4 Black's loose bishop drops off. After 6. ... Qe6 7. Nxc7+ the queen is gone. On \"normal\" moves, White wins a piece (or so I thought) on b4. I was looking at the cheerless prospect of getting maybe one pawn at most for a piece, and playing on for 30 more moves against a master whose forte was steady, rock-solid chess. No thanks, I thought. Therefore: It was only several days later that I realized that Black doesn't lose a piece. At most, I might have to give up a pawn, and that is hardly worth resigning over. The key point is that after 6. ... Qd6! 7. N5xb4 a5, the b4 knight has no flight squares. If 8. Qe2 Kd8! White can't take on e4 because 9. Qxe4?? Re8! wins the queen.\nSomewhat better for White is 6. ... Qd6 7. N3xb4, but he still can't hold onto both knights after 7. ... c6. My post-game analysis went 8. Nc3 Qxb4 9. Qg4 with advantage to White, but in the one game on ChessBase where this actually occurred, White's advantage is quite minimal. Elizabeth Paehtz versus Thomas Pattard, Dresden 2002, went 9. ... O-O 10. Qxe4 Qxe4+ 11. Nxe4 Re8 12. d3 d5 13. Be2 de 14. de Rxe4 15. Be3  White has an advantage thanks to the two bishops and she eventually won, but I think that was in part due to being a better player than her opponent (rated 2320 versus 2195). Certainly if I had been told on move 6 that I could reach this position as Black, I would have been thrilled!\n\nThe computer (Rybka) says that White should have played 8. Ne3! rather than 8. Nc3 and this leads to a rather large advantage, because in the variation above a knight on e3 would have been able to jump to f5, creating a mate threat on g7. But here we are starting to get into computer versus human play. Would Blohm have been able to see 8. Ne3 and understand why it was better? A strong 2300 player like Paehtz didn't. Certainly it would have been worth playing on to find instead of resigning on move 6."
    },
    "url": "https://gameknot.com/annotation.pl/my-shortest-loss?gm=63854",
    "gameName": "\"My Shortest Loss\"",
    "players": "David Blohm  vs. NM Dana Mackenzie  ",
    "opening": "Vienna (C26), Falkbeer variation"
}