{
    "moves": {
        "1. e4": "Good first move by Paul controls the center,the pawn is looking at the d5 square and the f5 square with keen interest.",
        "1... f5": "I played 1..f5 to unsettle Paul straight away out of his comfort zone.",
        "2. exf5": "2.exf5 is the norm here,after all a free pawn cannot be turned down can it?",
        "2... Nf6": "2...Nf6 well it looks to the e4 square and holds a watchful eye on the d5 square,and the g4 square.a knight is like a shuttle craft a little slow at getting here and there, but can be a good menace to the opponent.",
        "3. d3": "If my opening knowledge serves me right i would of played 3.Be2 not the move played.3.Be2 allows some control of the g4 square,also with the support of the queen on d1 could land with a check on h5 at some point the knight on f6 takes the bishop then the queen takes back with check again.( 3.d3 is still not bad after all it opens up the diagonal for the c1 bishop and the pawn controls e4 square and the important c5 square.",
        "3... d5": "3..d5 i like this direct approach the pawn controls e4 square and whites important c4 square.",
        "4. Be2": "4.Be2 a move behind see note previous,here the more forceful 4.g4 be brave and take the bull by the horns and come out of safe zone.+it holds on to the f4 pawn a while longer.",
        "4... Bxf5": "the pawn is reclaimed and equality achieved and with this move black up's the preasure on whites e4 square.",
        "5. Nf3": "A good solid move by Paul looks to the e5 square and g4 square and d4 + h4 brilliant developing move which is what needs to be achieved in chess.",
        "5... Nc6": "i could of played 5..e6 here to free my f7 bishop from where it could land on c5 hitting the f2 square supporting the d4 square for if i wanted to push d5 or drop a knight on d5putting the question to the knight on f3 and the bishop on e2.however i like 5...Nc6 a good solid developing move supports d5,e5,b4,a5 and if later i wanted to push e5 then a Friend indeed the knight would be.",
        "6. Nc3": "i would of castled here 6.0-0 just my preference nothing wrong with 6.Nc3 a good developing move again falls in with the knights b4 bishop rule.",
        "6... d4": "And here comes the d4 move i was hinting at earlier.",
        "7. Nb5": "I would of gone for trade offs, eg 7.Ne4-Nxe4 8.dxe4-Bxe4 9.O-O-Qd6 10.Re1-Bg6 with equality.",
        "7... e5": "See how useful my Nc6 move was!!!! the knight supports the center pawn push.",
        "8. O-O": "Best move on the board at the moment.",
        "8... a6": "I wanted to put the question to the knight here go home or fall where you stand.",
        "9. Na3": "Only move forced.",
        "9... Bxa3": "time to have dissension in Paul's ranks, his pawn structure here is compromised.",
        "10. bxa3": "The only move.",
        "10... O-O": "Time to get my king to safety before the battle begins.",
        "11. Rb1": "Not the best of moves here i would of played 11.Nd2 the threat to my pawn from the rook on b1 is easily parried.",
        "11... Rb8": "Simple defence.",
        "12. Re1": "A standard manoeuvre but in keeping with the position,Whites plan? perhaps when the bishop on e2 moves then attack is opened up on e5 pawn white knight on f3 and white rook on e1 rains down as the e5 pawn is only defended by my knight on c6",
        "12... Be6": "just threatening to win material with Bxa2",
        "13. Rb2": "Standard defence of the pawn on a2.",
        "13... Nd5": "Time to take a hold of the weak c3 square nice looking outpost.",
        "14. Bd2": "Interesting move here would of been,14.Ng5!?-Nc3 15.Qd2",
        "14... Nc3": "A thorn in whites side.",
        "15. Bxc3": "What else? the only good move?",
        "15... dxc3": "The only move.",
        "16. Rb1": "I think i would of played chance to the wind here with 16.Rb3-Bxb3 17.axb3-Nd4 18.Nxe5-Qf6 white at least straitens his queen side pawns out.",
        "16... Qf6": "Spying the f2 square,",
        "17. Ra1": "17.Rb3 as previous comments.",
        "17... Bd5": "Now to put preasure on the f3 knight where is he going can blacks plan come to fruit?",
        "18. Qc1": "I would of played 18.Re1 to hold on to the f2 front door, before back blows it away.",
        "18... Nd4": "More preasure on the white knight, paul is about to crack under the preasure here.",
        "19. a4": "What else?",
        "19... Qg6": "20.Ng5-Bxg2 21.Kxg2-the tactical shot here now is ...Rf4 and the end is nigh for white.the knight will drop on g5 22.h4-h6"
    },
    "url": "https://gameknot.com/annotation.pl/my-turn-for-the-dark-side?gm=34025",
    "gameName": "My turn for the dark side",
    "players": "paulguay (1452) vs. hurnavich (2314)",
    "opening": "Fred (B00)"
}