{
    "moves": {
        "1. e4": "Playing Black is my friend Baker who's been teaching me for over a year. I've beaten him lots of times in practice games, but this was the only time I ever beat him in a tournament, and FINALLY I found this game after scavenging through my papers. I play 1.Nf3 now, but a few months ago I was only copying Baker's openings, now I have my own style.",
        "1... c5": "The Sicilian Defense is probably the strongest response to e4, since it stops White from creating a strong centre with d4. The move 1...e5 also does this, but it simply matches me in the centre, while c5 creates more imbalances.",
        "2. Nf3": "Against Sicilian, Baker usually plays c3, or the Morra Gambit (d4 cxd4 c3), but I didn't want to play one of his openings since he would probably crush me due to having more knowledge.",
        "2... e6": "This move has a lot of purposes. It defends the c5-pawn, it opens lines for the bishop to develop, it prepares a d5 pawn advance in the future, and it also controls the important d5 square.",
        "3. d4": "This is Open Sicilian since I am opening up the centre. Most variations are good for Black if White does not reclaim the d4 square.",
        "3... cxd4": "Another playable move is d5, but it is frowned upon by most players since it offers to open up the centre even more while White is ahead in development.",
        "4. Nxd4": "c3 would've transposed into the Morra Gambit, and Qxd4 is just dubious since Black gets a free developing move Nc6.",
        "4... Nc6": "The most common continuation for Black is Nf6, and I cannot attack his knight with e5 because of Qa5 ",
        "5. Nc3": "Nxc6 just strengthens Black's pawn structure by allowing him to bring a pawn closer to the centre. It's better for me just to develop a piece.",
        "5... Qc7": "I thought Baker would play Bb4, but I guess he had a more strategic move in mind. Qc7 sets up queenside counterplay later.",
        "6. Ndb5": "Forcing the queen to move again",
        "6... Qb8": "The purpose of Nc6 was to get the queen to b8 where it will control the b-file after ideas like a6 b5 giving Black good queenside play.",
        "7. Be3": "This is usually the best square for the bishop in all Open Sicilians. Although in some variations, the bishop goes to g5 depending on how Black plays.",
        "7... a6": "Baker is initiating his plan to play b5 and gain space on the queenside, so I had to think hard about my next move.",
        "8. Bb6": "In order to beat Baker, you have to think like him. Baker's specialty is sacrificing pawns and/or pieces to gain lots of attacking potential, so here I sacrifice a piece to get an attacking initiative.",
        "8... axb5": "I was threatening Nc7 ",
        "9. Nxb5": "I'm threatening Nc7  once more.",
        "9... Bb4+": "This move was good since it gives Black an extra move to play Ba5. I was a little disappointed since I was expecting Ra4, where Nc7  Ke7 c4!! intends c5 threatening Qd6  where I have a very strong attack on the weak dark squares for compensation for the piece.",
        "10. c3": "I played this instantly since it was clearly the best move.",
        "10... Ba5": "I'm still down a piece, so trading bishops would be winning for him since I'd no longer have the pressure on c7.",
        "11. Nc7+": "Now Black has a choice. He can let me take the rook where I'll still have a strong attack on the dark squares (but he'll have two pieces for the rook), or sacrifice the queen and end up with three extra minor pieces.",
        "11... Qxc7": "Baker isn't the type of player who likes to defend.",
        "12. Bxc7": "Duh!",
        "12... Bxc7": "Now Black has three minor pieces, for the price of his queen and a pawn, a roughly even trade, although I'm  1 in material count, the material is too imbalanced to say who is better here.",
        "13. Qg4": "Hitting g7.",
        "13... g6": "Not Be5 because of f4 h5 Qg3 h4 Qg4 Bf6 e5 and Black's bishop can no longer defend g7.",
        "14. f4": "Gaining more central territory.",
        "14... Nge7": "Nf6 would've attacked my queen, but Qf3 is simple and Black's knight on f6 is subject to attack by pawns like g4-g5",
        "15. Qf3": "I couldn't see any useful moves here, so I played Qf3 which prepares g4 and makes f5 less annoying.",
        "15... d5": "Making a break in the centre.",
        "16. Bb5": "This move is better now that d5 has been played, and Black has no a-pawn to harass my bishop with.",
        "16... Bd7": "Breaking the pin.",
        "17. a4": "I wanted to castle queenside here and attack Black's kingside with my pawns, so I played a4 to stop Rxa2 after I castle, and also to stop a b5 advance in the future.",
        "17... O-O": "Exactly what I wanted, now after I castle queenside, it will be a classic Sicilian position where each side goes for a mating attack on opposite sides of the board.",
        "18. O-O-O": "My intended move. Although my king's position is weaker than Black's, I have more attacking potential on the kingside with my pawns.",
        "18... Rfd8": "It seemed awkward that Baker would move a defender away from his king. Maybe better was dxe4 Qxe4 Nd5 where at least Black would free up some space in the centre. But then again, Baker knows he's better than me, and maybe thought he'd win through my mistakes. So I intended to make accurate moves throughout the rest of the game.",
        "19. e5": "Now Black cannot free up space with dxe4, and I control the weak f6 square. The pawn structure somewhat resembles a French Defense now.",
        "19... Bb6": "This is another strange move by Baker. I realized that he probably wasn't playing his best, and this was my chance to finally beat him in a tournament. Na5 was probably Black's best move.",
        "20. h4": "Now my attack can pick up steam due to a couple of pointless moves by Black.",
        "20... Nb8": "Baker's idea to trade pieces to weaken my king's position was good, but my kingside attack is too fast.",
        "21. h5": "Had Black tried preventing this with h5, then g4 is a simple way to forcibly open the kingside.",
        "21... Bxb5": "After axb5, Black has Ra1  Kc2 Rxd1 Rxd1 and my attack is stalled, while Black has much more counterplay on the queenside, so I had to make a very important decision right now.",
        "22. hxg6": "I ignore the piece and instead continue my attack, now leaving Baker with every single one of my minor pieces, at the price of only his queen.",
        "22... Be8": "I was hoping for Bxa4, because I can leave my rook hanging and play Rxh7, since Bxd1 loses to Qh3!! with an incredibly strong attack and threat to play Qh6 which mates. Be8 is a defending move, and Black didn't want to waste time taking a pawn.",
        "23. Rxh7": "Even though four minor pieces are almost always superior to a queen and a few pawns, Black isn't using his four pieces as attacking forces, while my queen has a lot of attacking potential.",
        "23... Nxg6": "This stops the effects of Qh3 because now if Qh3, then the dark bishop can get to f8 to stop my attack.",
        "24. Rdh1": "The only other way to defend my rook while still attacking.",
        "24... Rxa4": "Now getting the bishop to f8 is a terrible idea because of Bc5 Qh5 and I have a new threat of Rh8  (Kg7 Qh6#) Nxh8 Qxh8#\r\nBlack needs to activate his forces on the queenside to get counterplay.\r\nI think Kf8 was the best move, but I still have a strong attack after f5, and Nxe5 is losing because I can leave my queen hanging with f6!! threatening Rh8# so Black must play Ng6 to defend h8, but then I can simply play Rh8  Nxh8 Rxh8#",
        "25. Kb1": "This simple defensive move stops Ra1  and Black's king is still helpless since Kf8 f5!! is still strong.",
        "25... Rxf4": "Kf8 holds on the longest, but Baker sucks at defending. If you look at his annotated games (bakerbaker) then you'll see all his games are brilliant sacrificial attacks. He hates defending.",
        "26. Qh5": "Threatening mate in 2 on h8.",
        "26... Kf8": "Stops mate since he retreats to e7.",
        "27. Qg5": "The final blow in my attack. Black's king is cut off from escaping, so there is no stopping Rh8  Nxh8 (Kg7 Qh6#) Rxh8#",
        "27... Rf1+": "This is a cheap way to stall mate for a few moves, but Baker already knew he had lost.",
        "28. Rxf1": "Free rook.",
        "28... Nc6": "Black cannot save his knight because 28...Ne7 Qg7#\r\nOr 28...Kg8 then 29.Qh6 mate next move on g7.",
        "29. Qxg6": "Threatening to sac for mate on f7, even if Black plays Ke7.",
        "29... Rd7": "This move prevents mate, but it also blocks d7, so Black will get mated anyway with d7 blocked.",
        "30. Qg7+": "The first move of mate in 3",
        "30... Ke7": "Forced",
        "31. Qf6+": "Baker resigned here, because Kf8 is forced then Rh8#\r\nI thought he would be mad for taking his rating, but he was actually proud of me for finishing him off so brilliantly, which goes to show that he did an excellent job teaching me."
    },
    "url": "https://gameknot.com/annotation.pl/gambito-304?gm=6516",
    "gameName": "Gambito #304",
    "players": "byakuugan3 (1453) vs. Baker (1892)",
    "opening": "Sicilian (B47), Taimanov (Bastrikov) variation"
}