{
    "moves": {
        "1. e4 d5 2. exd5 Qxd5 3. Nc3 Qd8 4. d4 c6 5. h3": "Bit unusual !",
        "5... Nf6 6. Nf3 Nbd7 7. Bc4 e6 8. O-O Be7 9. Ne5 O-O 10. Bg5 Nd5": "Hoping that Bishop at c4 will cut the Knight then the black pawn could emerge into the d file and then attack through the e file.",
        "11. Bxe7 Qxe7 12. Bxd5 exd5": "Saw, it worked. nice ! Black side is controlling for the moment. ",
        "13. Re1 Re8 14. Nxd7 Qxd7 15. Rxe8+ Qxe8 16. Qe1 Qf8 17. Ne2 Bf5 18. c3 Re8 19. Qd2 Re7 20. Ng3 Bg6 21. Re1 Qe8": "Still along the e file, a battle is going on. You may watch.",
        "22. Rxe7 Qxe7": "Much better. It looks like the black Queen got the power of cruising along the e file. ",
        "23. Qf4 Bd3": "Bishop was trying to put pressure on the white King. But knight got captured some places around the King. So, task is difficult. ",
        "24. Qb8+ Qf8": "Now, white Queen has a chance of getting some black pawns and may be white will take the control of the board. But be careful ! ",
        "25. Qxb7 g6 26. Qxc6 Qe7 27. Qxd5": "Why not, Queen is cleaning the black pawns happily. May be it is a trap. Do you believe?",
        "27... Qe1+": "Ya... somewhat.",
        "28. Kh2 Qxf2 29. Qa8+": "I guess white is very greedy, after checking the king will take another pawn. ",
        "29... Kg7 30. Qxa7 Bc4": "Yep. It happened. Black is gambling and try to attack and the finish off the game. Observe that white side is 3 pawns up.",
        "31. b3 Bd5": "Black bishop with a little bait, inviting c3 pawn to attack while attacking the king side.",
        "32. c4": "See, it happened. Black side is fortunate enough and the gambling worked. Poor white king... ",
        "32... Qxg2#": "Black Queen completed the task. so, suddenly black side is on top.!!!"
    },
    "url": "https://gameknot.com/annotation.pl/gambling-in-a-chess-game?gm=36499",
    "gameName": "Gambling in a Chess game",
    "players": "Kool  vs. Kapila ",
    "opening": "Scandinavian defence, Lasker variation (B01)"
}