{
    "moves": {
        "1. e4": "Playing White is my friend Baker, be sure to check out his other magnificent attacking games in bakerbaker's profile",
        "1... e5": "I personally don't like the symmetrical reply, since now Black doesn't have any imbalanced advantages, when White has the tempo.",
        "2. f4": "Baker is an incredibly strong attacker, so he often plays gambit openings like this and crushes his opponent quickly.",
        "2... Nf6": "Black should just take the pawn and try to hold it, since the best way to refute a gambit is to accept it. Even though White is much higher rated than Black, Black still should just take the pawn, since declining it is like giving White a free f4-boost.",
        "3. Nc3": "White's other choice was fxe5 Nxe4 Nf3, but this continuation has transposed into the Vienna Gambit (e4 e5 Nc3 Nf6 f4!?)",
        "3... d6": "Black still won't take the pawn, and has planted it in the centre. White still offered the pawn for a few more moves, but Black refuses to accept the gambit.",
        "4. Nf3 Nc6 5. Bc4 Bg4 6. O-O Be7 7. d3": "Both sides have almost completed development, but Black has not castled yet, which is what led to his loss. I think h3 is better than d3 here, since Black cannot play Bh5 due to g4 Bg6 f5 trapping the bishop. Black would have to lose a tempo or take the knight, which leaves White with the bishop pair.",
        "7... Nh5": "This move is a blunder, and immediately loses material. It was much better for Black to simply castle, or play Qd7 and castle queenside if Black is concerned about White starting a kingside pawnstorm.",
        "8. fxe5": "Black's blunder would've only cost him a pawn, but Black wasn't prepared for Baker's attack since he simply assumes that f3 is pinned. If Black plays dxe5, then Bxf7  Kxf7 Nxe5   and White wins the piece back with extra pawns.",
        "8... Nxe5": "Black simply assumes that White's knight is pinned and cannot take, so he probably didn't even consider it. If he had, then perhaps he would've seen the devestating effects of Baker's attack, and not have blundered Nh5 in the first place.",
        "9. Nxe5 Bxd1 10. Bxf7+": "White is down a lot of material, but the results of the attack could be disastrous",
        "10... Kf8 11. Bxh5+": "Nd7  was another idea, because Qxd7 Be6  wins back the queen, but after the smoke clears, material is even and White hardly has an advantage.",
        "11... Bf6": "If Kg8, then Bxf7  Kf8 Nd7  with the same queen winning idea as before, except this time, White has an extra piece.",
        "12. Rxf6+": "This magnificent sacrifice is the only way to keep the fuel burning and continue the attack. Here, Black's best resource is Kg8, and it's hard for White to continue the attack, but three pieces is already more than enough to compensate for the queen.",
        "12... gxf6": "If Qxf6, then Nd7  wins back the queen with extra material, this move actually lets White have forced checkmate",
        "13. Bh6+": "White can bring in another attacker with tempo to finish the attack, now Black's uncastled king is helpless",
        "13... Ke7": "If Kg8, then Bf7# is mate",
        "14. Nd5+": "White brings the last minor piece into the attack, drawing the king further from its defenders. White hardly used his major pieces in this game, he just sacrificed them to increase the power of his minor pieces",
        "14... Ke6 15. Bf7+ Kxe5 16. c3": "With this quiet move, White seals Black's fate and now Black has no defense to the coming Bf4# checkmate.",
        "16... c6 17. Bf4#": ""
    },
    "url": "https://gameknot.com/annotation.pl/gambito-325?gm=8489",
    "gameName": "Gambito #325",
    "players": "bakerbaker (2247) vs. Orlowski (1678)",
    "opening": "KGD (C30), 2...Nf6"
}