{
    "moves": {
        "1. d4 e6 2. Bf4 d6": "Very passive, but solid. ",
        "3. Nf3 Nd7": "Black challenges me to take advantage of his passiveness. ",
        "4. g4": "Accepted. ",
        "4... h6 5. h4 b6": "Good, this diagonal is always hard to control. ",
        "6. e4 Bb7 7. Nbd2 Ne7": "Black should have taken its chance to go e5. ",
        "8. Bg3 a6": "Another passive move. It's up to me. ",
        "9. Bd3": "Nothing drastic, but g6 is a target. ",
        "9... g6 10. h5": "I know this will block the wing, but I had faith in a slower undermine of black's kingside. ",
        "10... Bg7": "Fortunately, my opponent didnt take the chance, and played this sensible move. ",
        "11. g5": "My thoughts were: \"anything in order to allow my queen to come out on the kingside.\"",
        "11... hxg5 12. Nxg5": "Now, the black shield is strangely weak. But I made a sac here...",
        "12... Bxd4": "It's ok, I have to tempt him wiht something in order to allow me build the attack. ",
        "13. Qf3": "Here, my opponent panicked. ",
        "13... f5": "? Nf8 would have been enough, or Rf8. White has already the edge, but this is awful. ",
        "14. Nxe6 Qc8": "I could win the bishop, but I wanted to go on with the attack instead... and I almost lost!",
        "15. O-O-O Ne5 16. Bxe5 Bxe5": "He has saved his bishop, and material is even. Now I have to show that I did it wisely. ",
        "17. hxg6": "Losing a piece, but with a stunning attack. ",
        "17... Rxh1 18. Rxh1 Qxe6 19. Rh6": "Rh8 is impossible, but this is not bad, too...",
        "19... Qxa2": "This can hardly be a problem, but I handled it too optimistically. ",
        "20. Qh5 Qxb2+ 21. Kd1": "Black can go on with another check, then... nothing. ",
        "21... Kd7 22. exf5": "The two joined pawns are a powerful force, but it is hard to see how to exploit it. ",
        "22... Bg7 23. Rh7": "Black is tiying himself. ",
        "23... Re8": "Wiser than it seems at first sight. ",
        "24. Ne4": "? Qg4 posed a hard to meet treat. The knight ought himself to the king's guard. ",
        "24... d5 25. Ng5": "I realized Qg4, but it was too late now. ",
        "25... Qb1+ 26. Kd2 Bc3+": "Black hopes to deflect my king to avoid more threats on the kingside. ",
        "27. Kxc3 d4+": "Nothing to do. I won't bite it, and give you some chances. ",
        "28. Kd2 Qb4+ 29. Kd1": "I realized black had perpetual check, unless I dare to move my king into a dangerous journey on the kingside... with blakc's lsb looking freely at it...",
        "29... Kc8": "Unpinning the knight, black threats mate. The last chance...",
        "30. Rh8": "The more powerful and unexpected way to cope with the thread. ",
        "30... Ng8": "A very smart move, trheatening mate...",
        "31. Ne6": "And the activation of the knight as \"umbrella\". Black can try the perpetual once more. ",
        "31... Bc6": "Black activates the bishop, covers the Re8, and tries to add power and coordination to his pieces. Here, Qh7 was decisive... unless black's perspectives of perpetual check. ",
        "32. Bxa6+": "This seems to be very clever. it isn't. ",
        "32... Kb8 33. Qh7": "At last, but better was one move before. ",
        "33... Bf3+": "This is another \"coup of scene\" I should have foreseen. Am I busted?",
        "34. Kc1 Qa3+ 35. Kd2 Qc3+ 36. Kc1 Be4": "I have to pay for my overconfidence. With a piece. ",
        "37. Qxc7+ Qxc7 38. Nxc7 Kxc7": "Now, I should save my pawns, with Bd3, but it will be a lost fight. ",
        "39. Bc4": "If I recover the piece... a drawn is still possible. ",
        "39... Nf6 40. g7": "The pawn is now on the seventh rank. Look what interesting tactic comes here...",
        "40... Bxf5 41. Rxe8": "Black' can't take the rook, or my pawn queens. The game is technically won. "
    },
    "url": "https://gameknot.com/annotation.pl/gameknot-blitz-http-gameknot-com?gm=56080",
    "gameName": "GameKnot Blitz, http://gameknot.com/",
    "players": "damalfi  vs. moodywho ",
    "opening": "Queen's pawn (A40)"
}