{
    "moves": {
        "1. e4 e5 2. Nf3 Nf6 3. Nxe5 d6 4. Nf3 Nxe4 5. d4 Bg4": "not sure I would have done this, it's too early.  Black has a bad black bishop, and this just allows me to offer the knight in trade with the next challenging move",
        "6. Qd3 Nf6": "tempo lost for black",
        "7. Be2 Be7 8. O-O O-O 9. h3 Bh5 10. c4": "with this move, I claim the center, and it turns out to be a permanent advantage",
        "10... Nbd7": "?? this forces the knight to either be passive or on a bad square (b6).  He can't attack c4 with any other pieces other than the pawn, it will be a while before he can.  With moves like Rc8 he has some long-term possibilities, but without the e5 pawn, it's tricky to attack this way.  d5 is much more vulnerable in my opinion.",
        "11. Nc3 Bg6": "I expected this.  I am 1-2 moves away from completing development, this does nothing very threatening.  The bishop is really poorly placed on g6 and will soon trade for a knight.",
        "12. Qd1 Re8 13. Nh4 Be4": "the best of 2 bad choices",
        "14. Nxe4 Nxe4 15. Nf3 c6": "white is distinctly better, I own the center and have 2 bishops both of which will be bearing down on the kingside shortly",
        "16. Qc2 Nef6": "here we are, back to the position from 2 moves ago, except black's good bishop is toast.  Another tempo lost",
        "17. b3 Qb6": "I considered advancing a central pawn here, 18. c5 dxc5 19. dxc5 Bxc5 did not look very appetizing to me.  18. d5 cxd5 19. cxd5 Nxd5 doesn't do much for white either, nor 18. d5 cxd5 19. Rb1 cxd4",
        "18. Bb2": "and white is done developing",
        "18... d5": "a good reply.",
        "19. Bd3": "let's wait and see what black has in mind, this move aims all the arrows kingside",
        "19... h6 20. Rab1": "eyeing the queen and preventing dxc4",
        "20... Qc7 21. Rfe1": "I thought a long time before this move, as c5 looks good.  However, after 22. ... Ne4 I have some tough choices and will probably end up with a backward pawn on d4",
        "21... Bd6 22. Ne5": "loses a pawn but opens the center for my remaining white bishop",
        "22... Nxe5 23. dxe5 Bxe5 24. Bxe5 Rxe5 25. cxd5 Nxd5 26. Re2": "preparing to double if he'll let me",
        "26... Rae8 27. Rxe5 Rxe5 28. Qd2": "a good end game for white, I have plenty of attacking options",
        "28... Qd7 29. Rd1": "the move that will eventually win the game.  That rook is awkwardly placed on e5",
        "29... Rg5": "?? huge mistake, now white is fully winning",
        "30. f4 Rg3": "Rh5 was a better choice, but blacks options diminish after Qe2 etc.",
        "31. Be4 Ne3": "game over",
        "32. Qxd7 Rxg2+": "Bxg2 leaves black with no hope and no pieces"
    },
    "url": "https://gameknot.com/annotation.pl/gameknot-blitz-http-gameknot-com?gm=42564",
    "gameName": "GameKnot Blitz, http://gameknot.com/",
    "players": "cellog  vs. wiselka2010 ",
    "opening": "Petrov (C42), classical attack"
}