{
    "moves": {
        "1. e4 g6": "Here we go!  The Hypermodernist's dream!\n\nBlack cedes control of the center without a fight.  Black intends to chip away at the center from the wings.  ",
        "2. d4 Bg7 3. Nf3 d6": "A very normal opening sequence.  3...d6 is subtle, but assured. It allows the Bishop some flexibility and prevents White's push to e5.  It does not beget white's center, but begins its attack.    ",
        "4. Nc3 c6": "This is where the author explains that 4...a6! is better.  He states, \"back in the day...we all played ...c6 since it never occurred to us to play 4...a6!\n\nThe logic is convincing.  In the ...c6 lines, Black often plays ...b5, ...a6, ...Bb7, and ...c5 later on.  Now, in the ...a6 lines, Black actually saves tempo and cuts out an often unnecessary move.  ",
        "5. Be2 Nd7": "Important here.  This Knight defends e5 and prepares the c-pawn thrust.  It also allows flexibility to f6 if the g-Knight goes to h6 or f6.  Many games even show the b-Knight going to b6 which begins management of c4! \n\nAlso important here may be the move order.  Later in the book, Lakdawala cites another game (game 5) where he plays Black and played 5...b5 before Nd7.  He suggests it is now probably inaccurate because Black lags in development and needs to catch up before allowing White a contact point to open the position.\n\n\n\n ",
        "6. O-O Nh6": "This move gets an !?\n\n\nThis move opens the possibilities of ...f6 and ...Nf7 or even ...f5.  Today, normal might be 6...Qc7 7.a4 Ngf6 8.h3 0-0 as in Topalov-Rauschenbach, frankfurt (Rapid) 1997.\n\n  ",
        "7. Bg5": "White is provoking ...f6.  Ironic is that Suttles probably intended to play ...f6 anyway.  ",
        "7... f6 8. Be3 O-O 9. d5 f5": "This move gets an \"interesting, but maybe not the best move\" (!?) notation from the author.  IM Andrew Martin suggests 9...c5, keeping the White's Knight off of d4.\n",
        "10. Nd4": "White may have gained a pawn after 10.dxc6 bxc6 11.Nd4 Ne5 12.Nxc6! Nxc6 13.Qd5+ Nf7 14.Qxc6 Bd7.  However, Black may gain some Benko Gambit style compensation because of the two new open files.",
        "10... Bxd4": "Another \"interesting, but maybe not the best move\" notation here from the Author, who goes on to say that everyone else would have played 10...Ne5.\n\nTrading off the dark-squared Bishop, especially for a Knight, is a theoretical error in the Modern Defense.  The Author defends Suttle's exchange by touting a subtle gain as Black takes control of e5.  ",
        "11. Qxd4": "If the Bishop took on d4, then 11...c5 12.Be3 f4 13.Bd2 Ne5 and the Bishop gets booted twice.",
        "11... f4": "A great move creating a hole on e5 for the Knight.",
        "12. dxc6 bxc6 13. Bc4+ Nf7 14. Bxf4 e5 15. Qxd6 exf4 16. Rad1 Qg5 17. Bxf7+ Rxf7 18. Qxc6 f3 19. g3 Nb6 20. Nd5 Bd7 21. Qd6 Nc4 22. Qb4 Rc8 23. b3 Ne5 24. Ne3 Qh6 25. Rd5 Ng4 26. Nxg4 Bxg4 27. h4 Rxc2 28. Rfd1 Rc8 29. e5 Be6 30. Rd5d8+ Rxd8 31. Rxd8+ Kg7 32. Qc3 Qh5 33. Kf1": "The Author offers an exercise here.  Black to play and win!\n\n",
        "33... Qf5 34. Rd6 Qb1+": "White resigns here in light of 35.Qe1 Bh3#\n\nPerhaps, as Lakdawala explains, the Modern allows Black greater leeway than any other opening."
    },
    "url": "https://gameknot.com/annotation.pl/game-1-belgrade-1969?gm=48817",
    "gameName": "Game 1 - Belgrade 1969",
    "players": "Janosevic  vs. Suttles ",
    "opening": "Robatsch defence (A41), Rossolimo variation"
}