{
    "moves": {
        "1. d4 Nf6 2. e3 e6 3. a3 c5 4. Nf3 Nc6 5. Bb5 a6 6. Ba4 b5 7. Bb3": "White gave me a solid expansion on the queenside, but it has its dangers. Anyway, it \"can't\" be bad...",
        "7... c4 8. Ba2 Bb7": "Overlooking the foreseenable reaction g6. ",
        "9. Nc3 Bd6": "I sensed my knight would have been needed on the queenside, so I prepare to castle while developing and controlling e5. d6 would have been wiser. I didn't want to play d5, though solid, because my lsb wants its diagonal. ",
        "10. b3 Na5 11. bxc4 Nxc4 12. Bxc4 bxc4": "the g column would be a weakness for me, I know. ",
        "13. O-O Nd5": "No use Qa5, because of Bd2. ",
        "14. Ne2 Qc7": "c3 was useless after e4. f5, to stop it, was vey dangerous - or I thought so.",
        "15. e4 Nb6": "the only square.",
        "16. e5": "Be7 and yawn. So let's try something else. ",
        "16... Bxf3 17. exd6": "I hoped he would take with the g pawn, but of course not...",
        "17... Bxe2 18. Qxe2 Qxd6": "Well, a pawn is a pawn. c4 is in no inmediate danger, but white found...",
        "19. c3 Nd5 20. Qg4": "wonderful, and unexpected. I cannot castle, nor defend. But I \"had\" to go for something more than Rg8...",
        "20... O-O-O": "Just crazy. I knew I would threatened on the b column, but I was tempting him to take g7, and put my rooks on a good open line. ",
        "21. Qf3": "wise... I think.",
        "21... f6 22. a4": "unavoidable. I have to play with great care, since I'm going to lose, here. ",
        "22... g5 23. a5": "A loss of tempo, but ok. The good one for white was g3, since it allows Ba3 and my queen must go to c6... but i didn't see a catastrophe in it. ",
        "23... h5": "I should have provided squares for my king with Rd8-somewhere. I was just shooting in the dark. If white doesn't take advantage quickly of its advantage, he must have faced a pawn storm.",
        "24. Ba3 Qf4": "As foreseen.",
        "25. Qxf4": "i'm not sure gxQ is better or not, but I saw a sequence aimed to put my knight on b5 (yes)",
        "25... Nxf4 26. Bd6": "I will lose c4, though. ",
        "26... Ne2+ 27. Kh1 Nxc3 28. Rfc1 Nb5": "...but my knight is very well placed, here. ",
        "29. Rxc4+ Kb7 30. Bc5": "the bishop in b6 isn't too dangerous.",
        "30... Rdc8": "the bishop is pinned.",
        "31. Rb1": "Wrong rook. ",
        "31... d6": "the bishop is pinned!",
        "32. Rcb4 dxc5 33. Rb4xb5+": "Desperate but wrong!",
        "33... axb5 34. Rxb5+ Ka7": "Not allowing a check and Rxe6.",
        "35. dxc5": "yes, but the pawns are not connected, and I have a whole rook.",
        "35... Rhd8 36. Rb2": "white blundered, but he was lost anyway. the pawns will fall, and I will win with a full rook.",
        "36... Rd1#": ""
    },
    "url": "https://gameknot.com/annotation.pl/gameknot-blitz-http-gameknot-com?gm=38884",
    "gameName": "GameKnot Blitz, http://gameknot.com/",
    "players": "myhome  vs. damalfi ",
    "opening": "Queen's pawn game (A45)"
}