{
    "moves": {
        "1. e4 e5 2. Nf3 Nc6 3. Nc3 Nf6 4. g3": "GM Josh Waitzkin uses this opening in a few annotated games on Chessmaster.  Though not too highly favored in the db. I find it quite interesting however, it fits in to my style I like to attack and I prefer slower closed games this game will evolve into such.",
        "4... Bb4": "I feel Bc5 is slightly better.  This threatens the e4 pawn but white can simply ignore the threat and continue with Bg2.  5. Bg2 Bxc2 6. bxc2 Nxe4 7. Nxe5 winning back the pawn, and unleashing the light square bishop on g2.",
        "5. Bg2 O-O 6. Nd5": "Again Nxe4 doesn't win anything threatens to win the two bishops.",
        "6... Bc5 7. O-O d6 8. d3 h6 9. Nc3": "This might seem like a strange move but I don't like the tension on my knight on d5, the game isn't opening up quickly and again I have a threat of winning the dark square bishop.  Na4 is now my threat.",
        "9... Bg4 10. h3": "Kicking the bishop out.",
        "10... Be6 11. Na4": "Winning the bishop pair.",
        "11... Bb6 12. Nxb6 axb6 13. Be3 Qd7 14. Qd2": "This was a poor move I'm planing on piling up on the h6 square with moves like Nh5-f5 and Kh2 Rh1 aiming for a king side attack.  I left the h3 pawn hanging though.",
        "14... Bxh3 15. Nh4": "Once again continuing my plan of Nf5.  Rh1 will have some more power after the bishops are traded.  Notice that the bishop on h3 and g2 create an interesting relationship.  Black wants me to take the h3 bishop.  Bxh3 Qxh3 and the queen is very hard to remove from that square not to mention Ng4 is a threat.  I want him to trade so I can put my rook on h1. Bxg2 Kxg2 most anything Rh1.",
        "15... Qg4": "I find this a mistake because it allows me to force my plan of trading on g2.",
        "16. Kh2 Bxg2 17. Kxg2 Qe6": "The queen would be kicked out by f3 at some point anyway.  I never noticed this till a few minutes ago but notice how long the pawn on a2 hangs.  Rxa2 Rxa2 Qxa2 can be quite dangerous for black because it leaves the defense of blacks king.",
        "18. Rfh1 Ng4": "Taking the bishop back though I'm not greatly concerned the position isn't going to open up right away.  Though my bishop is a nice piece the knight can be slightly better in this position.",
        "19. Nf5 Kh7": "Defending the sacrifices possibilities on h6.",
        "20. c3": "This may seem like a strange move but black interestingly enough has a quick counter play option here.  20... Nxe3 21. Qxe3 Nd4! forcing a trade of knights Nxd4 exd4 and suddenly my attack is gone.",
        "20... d5": "Good move here my king is not as secure as his breaking the center would be quite beneficial for black.",
        "21. f3": "Forcing a trade.",
        "21... Nxe3+ 22. Qxe3": "I actually have a threat in this position to win a pawn, with exd5 Qxf5 dxc6.  Note exd5 Qxd5?? Rxh6+!! Kg8 Qg5 wins.",
        "22... d4": "Black gives a pawn up temporarily.",
        "23. cxd4 Nxd4 24. Nxd4 exd4 25. Qxd4 Rxa2": "Black finally goes after the a2 pawn 8 moves later.",
        "26. Rxa2 Qxa2 27. Rc1 Rd8 28. Qe5 Rxd3 29. Qxc7 Qxb2+ 30. Rc2 Rd2+": "I thought this was very good.  Forcing a trade of rooks and attacking my king.",
        "31. Rxd2 Qxd2+ 32. Kh3": "Gets out of the line of fire.",
        "32... Qe2": "I don't like this move though black is going to lose something here.  This just feels bad for no other reason that it allows me to take a pawn and defend, and cuts blacks queen off from his king.  Blacks best plan in my opinion is to play Qd4 here and after Qxf7 Qf6",
        "33. Qxf7 b5": "Offering a very real draw chance for white not much black can do to stop constant checks Qf5+ Kg8 Qe6+ Kh7 Qf5+ giving a draw.  Which is the best black can hope for.  Though it may seem abstract. The b-pawn due to the fact that they are so far from blacks king have little meaning.",
        "34. Qf5+ Kg8 35. Qe6+ Kh7 36. Qf5+ Kg8 37. Qe6+ Kf8": "Giving up the b7 pawn.",
        "38. Qc8+ Kf7 39. Qxb7+ Ke8": "Now the king is easy pray for queen checks.",
        "40. Qc6+ Kd8": "Black decides to try to defend his main advantage the b5 pawn though in doing so black will have little protection from my active queen.",
        "41. Qd6+ Ke8 42. Qg6+ Kd8 43. Qd6+ Ke8 44. Qe6+ Kd8": "Giving up the g7 pawn.",
        "45. Qg8+ Kc7 46. Qxg7+ Kb6": "and the h6 pawn.",
        "47. Qxh6+ Kc5": "I felt Ka5 may have been slightly better here.",
        "48. Qf8+": "Defending my f3 pawn.",
        "48... Kd4 49. Kg4": "My king is out of checks and defends my f3 pawn from Ke3.",
        "49... Kc3": "Ke3 Qc5+ is an active defense Kd2 e5.",
        "50. Qc5+ Qc4": "Gives white an easy win.",
        "51. Qxc4+ bxc4": "The other option though still not winning is Kxc4 e5 Kd5 Kf4 b4 Ke3 b3 Kd2 b2 Kc2 Kxe5 f4+ Kf5 Kxb2",
        "52. e5 Kd4": "Blacks last mistake now the e-pawn will be traded for the c-pawn when they queen.",
        "53. e6 c3 54. e7 c2 55. e8=Q c1=Q 56. Qd8+": "! ends the game.  The only move that black has that doesn't lose the queen forces a trade.  Ke5 Qg5+ and white goes has two pawns that cannot be stopped."
    },
    "url": "https://gameknot.com/annotation.pl/gameknot-blitz-http-gameknot-com?gm=31465",
    "gameName": "GameKnot Blitz, http://gameknot.com/",
    "players": "yoshark  vs. gammaray ",
    "opening": "Four knights game (C46)"
}