{
    "moves": {
        "1. e4 c5 2. Nf3 Nc6 3. d4 cxd4 4. Nxd4 Nf6 5. Nc3": "standard Silician so far",
        "5... g6": "Dragon Variation. ",
        "6. Bc4": "Another plan is Be3, followed by Qe2, Bh6 and f4",
        "6... Bg7 7. Be3 O-O": "Some ideas here.... Qd2, preparing to castle with Bh6 attacking the dragon... or a kingside pawn advance",
        "8. f4": "controlling central squares.. as well as preparing to attack blacks kingside.",
        "8... e5": "e6 is stronger here... although i'm still not castled white will be able to eventually play f5! blocking a nice diagonal and threatening to shatter blacks kingside",
        "9. Nxc6 dxc6 10. h3": "Losing tempo... even under the guise of a kingside advance. Much better options available, insomuch as completing development.. even the preemptive f5 would be better",
        "10... a5": "Anticipating a queenside castling",
        "11. fxe5": "Its hard to imagine a worse move.. then this woeful pawn snatch. \r\n\r\n",
        "11... Nh5 12. Qd4": "Not sure what I'm doing here. Protecting pawns by positioning my Queen on a dangerous diagonal",
        "12... b5": "attacking on two fronts... blacks pieces are mobile on both queen and kingside... mine are trapped, and uncoordinated ",
        "13. Bd3 Qh4+": "very stong position for black",
        "14. Bf2": "possibly Kd2 is better... in what is a pretty desperate position",
        "14... Qg5": "Sound positional move. Safeguarding the king is out of the question. kingside falls to Bxh3! Also threats threatens weak points at e5 and g2",
        "15. g4": "attempting to salvage something from this position by aiming for counterplay",
        "15... Bxe5": "blacks bishop tucking in",
        "16. Qe3 Bf4": "queen has a choice of two spaces",
        "17. Qe2": "apparently walking into a pin.. but aiming again for some counterplay",
        "17... Ng3 18. h4": "countering offering a trade of queens to quell a continued assult",
        "18... Nxe2": "trade accepted",
        "19. hxg5 Nxc3": "the knight having fulfilled its objective aims to leave whites pawn structure in disarray... ",
        "20. bxc3": "some breathing space... but for precious little... possibly one of the worst looking pawn structures possible. Rooks unconnected and king badly positioned",
        "20... Bxg5": "blakc taking some of the material on offer",
        "21. c4": "where to start? ",
        "21... Bf6": "letting me off the hook, I can now castle and activate my rooks. Black could be focusing on capturing my at g4. He shouldnt have anything to fear as Bxg4, Rg1 can be easily met be h5 or bf6.",
        "22. O-O-O b4": "Passive but strengthening blacks kingside.. Avoiding an exchange does prevent white from trading off one of its problems at c4.. But I cant help thinking that opening the kingside would suit black.",
        "23. Rdg1": "of course for white the position is rubbish... and nothing to lose in rolling the dice on a far fetched plan.. both rooks now aimed at blacks king",
        "23... Bg5+": "blocking the g pawns advancement with check... but unfortunately served to help me out as I wanted use of the long diagonal ",
        "24. Kb1 Be6": "Black finally activates the back rank and brings his bishop into play... attacking two weak pawns",
        "25. Bd4": "making haste for the diagonal I want",
        "25... Rfd8": "heading for the open file",
        "26. Bb2 c5": "again quiet reinforcement with possibly Be3 followed by Bd4 in mind",
        "27. Rxh7": "Sacking a rook in order to crack open blacks defense.. and generate opportunities. I must admit, at this point I felt this game was down and out.. so didnt consider blacks defense if he refuted the capture. In any case a refutation could only strengthen whites claims",
        "27... Kxh7": "taking the material on offer. ",
        "28. Rh1+": "the counter attack begins in earnest.",
        "28... Bh6": "some hefty defensive work in order. This move is forced with the other alternative Kg7 mating",
        "29. g5": "i think i was very fortunate to have this piece at my disposal... and in a turn ... and from a position of weakness it pressurises blacks hapless bishop",
        "29... Rd4": "only chance of survival",
        "30. Rxh6+ Kg7 31. Bxd4+ cxd4": "attack ends. And its even again in terms of material. Despite Black still holding a much better position - my pawns still all remaining weak. Luckily for me black continues to let me off the hook.\r\n",
        "32. Rh1": "rook required for defensive duties",
        "32... Rc8": "insurmountable pressure on whites c pawn",
        "33. Kb2": "trying to muster much needed support ",
        "33... a4": "preventing my king from advancing. ",
        "34. Rd1": "aiming for some counterplay after Bxd4 ",
        "34... Rc5": "?again delaying the capture. surely trading would seal a nice endgame for black.  creating a shallow threat against g5",
        "35. a3": "blacks loss of tempo has allowed me to take first shot ",
        "35... bxa3+ 36. Kxa3": "my king embarks on active service",
        "36... Bxc4": "A flawed plan of aiming to protect the passed pawn with Bxc4, Rxc4. With the capture of g4 and a kingside advance the better option",
        "37. Kb4": "King leaps into attack. ",
        "37... Bxd3": "The best choice under the circumstances",
        "38. Kxc5 Bxc2": "am now looking at long last safe. If can cope with the two passed pawns.",
        "39. Rxd4 a3": "race to promotion",
        "40. Rd7 a2 41. Ra7": "phew... just in time, while also restricting any advancement of the opposition king",
        "41... Bb1": "protecting the pasted pawn",
        "42. e5": "move e pawn to safety. ",
        "42... Bf5": "leads to fall of the agonisingly promising a pawn, but the alternatives arent great. Otherwise Kf8; Kc6, ke8; kd6, kf8 (kd8 Ra8 mates!); kd7, kg8; ke8, kg7; Rxf7  and my e pawn threatens to queen",
        "43. Rxa2 Be6 44. Ra8 Bf5": "Now I hold an advantage. But is worth little unless I can make use of it. A simplification of pawns would work in blacks favour. The black king is in the 'good corner' (ie rook cannot mate on the back rank, ie Kh8; Ra8 will be met by Bg8 and draws). I need to develop a plan to promote one of my pawns, but the black king cannot be driven off g7,  in order to capture the f pawn. Unless I can think of something, a draw seems the likely result",
        "45. Kd6 Be6 46. Ke7 Bd5 47. Rf8": "the suprise",
        "47... Bc4": "keeping the f pawn protected. from whites perspective e6 would gift a pawn",
        "48. Rxf7+": "sacrifices my one remaining piece! ",
        "48... Bxf7 49. e6": "and black resigns!! his most likely move Bg8 is met with Kd7, and Blacks postion is hopeless (if he takes the pawn white wins due to a better positioned king); if Bf7 then either e7 or exf7 will win as the white king king forces back restricted peer; and the other alternatives fear no better."
    },
    "url": "https://gameknot.com/annotation.pl/gameknot-tourney-match?gm=2329",
    "gameName": "Gameknot Tourney Match",
    "players": "leereuben (1588) vs. jazzcatt (1472)",
    "opening": "Sicilian (B33), Pelikan (Lasker/Sveshnikov) variation"
}