{
    "moves": {
        "1. e4": "Usual King's Pawn Opening. ",
        "1... e5": "King's Pawn Game. My usual reply.",
        "2. Nf3": "Offensive, not surprising.",
        "2... Nc6": "Defending it with Nc6 to discourage White.",
        "3. b3": "He decides to release his bishop to go to b2.",
        "3... g6": "I follow suit. ",
        "4. g4": "For some reason, he moves his pawn to g4. I guess I was wrong about his bishop.",
        "4... d5": "I threaten his e4 pawn since it had no protection. Besides, I wanted more control in the middle.",
        "5. h4": "I didn't know why he decided to ignore it, but now he's trying to control the king's side. Fair enough.",
        "5... dxe4": "I take it since he would have to waste more moves to even the score.",
        "6. Ng5": "To protect his knight, he went g5 as trap, trying to tempt my Queen. ",
        "6... Qd4": "I decide to give my e4 pawn extra protection while threatening Ra1",
        "7. c3": "He protects it with his pawn. I didn't expect it, but remember... the Queen is too powerful to push back completely.",
        "7... Qd5": "Just moving back one space while still pressuring Black.",
        "8. c4": "I don't know if he wanted my Queen that badly or forgot that I wanted his Rook that badly.",
        "8... Qd4": "I move back to threaten Ra1.",
        "9. Nc3": "He protects with Nc3. Not bad, but since my Queen wasn't in danger... I'll focus on the King's side.",
        "9... f6": "I wanted Ng5 out of my territory so f6 was going to do it for me.",
        "10. Qe2": "He doesn't retreat and instead brings out his Queen to e2.",
        "10... fxg5": "Taking the Knight so Black move freely as much.",
        "11. Qe3": "It seems like Black wants to make a Queen trade. I'm not worried; I really don't mind that.",
        "11... Nh6": "Instead, I'll just focus on taking his undefended pawn on g4 so he can't control the white diagonals that I might need later.",
        "12. Qxg5": "Instead of the trading Queens like I thought, Black decided to take my  pawn. Now I can't take his without endangering my Nh6.",
        "12... Nf7": "I'll simply threaten that Queen, I guess.",
        "13. h5": "For some reason, he did not notice that his h4 pawn was protecting his Queen or even that his Queen was in danger by my Nf7. That was the blunder that cost him the game.",
        "13... Nxg5": "I take his Queen and he immediately resigned."
    },
    "url": "https://gameknot.com/annotation.pl/gameknot-blitz-1?gm=40477",
    "gameName": "GameKnot Blitz 1",
    "players": "davidscott3 (1200) vs. anshovy (1200)",
    "opening": "King's pawn game (C44)"
}