{
    "moves": {
        "1. d4 d5 2. e3 Nf6 3. c4": "Queen's gambit.",
        "3... g6 4. Nc3 Bg7 5. g3 e6": "Declined.",
        "6. cxd5 Nxd5 7. Nxd5 Qxd5": "!?  Aggressive, but really lacking in teeth because Nf3 does the trick.",
        "8. Qf3": "As does this: meeting aggression with aggression.",
        "8... c6 9. Bg2": "Very aggressive.  Expected Qxd5; Actually wanted it, but for some reason this move makes me think he wanted to exchange except the exchange makes no sense for him because his bishop will be 'biting on granite' as another annotator once stated.",
        "9... Qa5+": "More baiting than bite, but these little probes are all what real chess is.",
        "10. Bd2 Qb5": "Dual threats: b2 and preventing an immediate castle.",
        "11. b3 O-O 12. Ne2": "The queen is now misplaced on b5, but I have to try and gain control of the a8-h1 diagonal simply because he wants it.",
        "12... b6 13. O-O Bb7 14. Nc3 Qf5": "perhaps a mistep, but I would as soon trade on my terms.",
        "15. Qxf5 gxf5": "!?  With an aim of attack.",
        "16. Rfc1": "His plan is clear: take advantage of the relative pin on the c pawn to win it.",
        "16... Nd7 17. h4": "!",
        "17... e5 18. dxe5 Bxe5 19. Rab1": "Partially expected f4, but he probably thought it too weakening, and it is.",
        "19... Kh8 20. Ne2": "!",
        "20... Nc5": "Closing down the threat on c6, but not really...",
        "21. Bc3": "Understandable, but the simple b4 seems best.",
        "21... Bxc3 22. Rxc3 Rac8 23. Rbc1": "I really have to wonder why not b4?  Two defenders, two attackers.  Tie goes to the defender.",
        "23... Rc7 24. Nd4": "But surely now b4 was best!",
        "24... Rfc8 25. Nxf5": "I flounder for a plan, but he might be too set on his.",
        "25... Ne6 26. Nd6": "His move gives me my plan, moving my rooks to the open file.",
        "26... Rd8 27. Nxb7 Rxb7 28. Rc3xc6 Rbd7 29. Kh2 Rd7d2 30. Rc6c2": "! He understands the strength of the rooks battering the rank.",
        "30... Nc5 31. b4": "Now?  Ne6 admits the move as a mistake, which it was.",
        "31... Na6 32. a3 Kg7 33. Bb7 Nb8 34. Kg2 Rd8d3 35. a4": "That juicy e3 pawn cannot be taken as long as he has a rook on the 2nd rank.",
        "35... Nd7 36. Rxd2": "! Wisely freeing his other rook.",
        "36... Rxd2 37. a5 bxa5 38. bxa5 Ne5 39. a6 Ng4": "! I should win at least a pawn.",
        "40. Rf1": "? Worse than losing a pawn.",
        "40... Nxe3+": "mspasev - \"nice\""
    },
    "url": "https://gameknot.com/annotation.pl/gameknot-blitz-http-gameknot-com?gm=33091",
    "gameName": "GameKnot Blitz, http://gameknot.com/",
    "players": "mspasev  vs. mokru ",
    "opening": "Queen's pawn (D00), stonewall attack"
}