{
    "moves": {
        "1. e4 e5 2. Nf3 Nf6": "i don't even know what the name of this opening is but i saw someone play it so i decided to try it!!",
        "3. Nxe5 Qe7 4. d4 d6 5. Nd3 Nxe4 6. Qe2 d5 7. f3 Nd6 8. Qxe7+ Bxe7": "well that was a rather boring opening I ain't playing it again!!",
        "9. Bf4 O-O 10. Nc3 c6 11. Be2 Re8 12. O-O b5": "i am trying to give life to this utterly boring game!!",
        "13. a3 Nd7": "I am aiming for the c4 square!!",
        "14. Rae1 Nb6 15. Nb4 Bd7 16. Bd3 a5": "I don't like this knight!!",
        "17. Nba2 Ndc4": "finally i have a knight at c4!! i am surprised white didn't try to stop me he probably wasn't on the same wavelength!!",
        "18. Bxc4 Nxc4 19. b3": "blunder!! rook to b1 or knight to d1 would be better. but this moves are defensive i guess my opponent doesn't like being bullied around!! ",
        "19... Nxa3 20. Re2 Bb4": "i crack up the pressure !!",
        "21. Bc1": "agian this move just shows that my opponent is only in attack/counterattack mode and doesn't want to defend!!",
        "21... Rxe2 22. Nxe2 Nxc2": "well now i force him to defend!!",
        "23. Nec3": "i guess he still doen't want to be defensive oh well!!",
        "23... Nxd4 24. Be3": "maybe he doesn't know how to defend!!",
        "24... Nxb3 25. Nxb4 axb4 26. Rb1": "and he is still attacking/counter attacking!!",
        "26... bxc3": "take that!!!",
        "27. Rxb3 Ra1+ 28. Kf2 d4": "i bet my house he is gonna take the pawn!!",
        "29. Bxd4": "he did!! ",
        "29... c2 30. Be3 c1=Q 31. Bxc1 Rxc1 32. Rd3": "true to his style his last move is an attacking move!!",
        "32... Be8": "well my opponent either got tired of attacking or realized how pathetic/predictable his future attacks were going to be and resigned!! what did we learn from this? is that you can't win a game if you can't defend! lol!! but the thing i will remember about this game is that my opponent is rated 1800+ but yet he played so poorly!!"
    },
    "url": "https://gameknot.com/annotation.pl/gameknot-blitz-2?gm=30448",
    "gameName": "GameKnot Blitz #2",
    "players": "baldvin (1857) vs. africanboy ",
    "opening": "Petrov (C42), French attack"
}