{
    "moves": {
        "1. e4": "The trumpets of war sound the beginning of another epic battle.  White King decides to throw caution to wind and sends his personal Pawn bodyguard to e4.  This shows White King's ambition to avoid the slow manoeuvring that other opening battle moves tend to emphasise.",
        "1... e5": "Black King decides that imitation is the sincerest form of flattery and sends his own Pawn bodyguard to e5.  This challenges directly for the centre, but since it is White's move the symmetry simply allows the White King to retain the initiative.",
        "2. Bc4": "White's \"light-side\" Bishop, taking advice from the Force, immediately jumps to c4 and draws his blue lightsaber.  The White King is furious at the insolence of the \"light-side\" Bishop, taking matters into his own hands by listening to the Force above the King's orders.  The \"light-side\" Bishop is threatening the Black's weak f7 Pawn, however the Black e5 Pawn remains under no threat.",
        "2... Nf6": "The Black King sends his cavalry to f6, threatening the White central defences.  The Black e5 Pawn sees he now has the advantage over his opposite number and begins hurling abuse at the White e4 pawn, implying that the e4 Pawn's mother is a hamster and smells of elderberries!",
        "3. d3": "White King over-hears the hamster remark, so sends a Pawn to d3 as backup for the e4 Pawn.  The insults cease as quickly as they began, the Black e5 Pawn looking slightly chastised now that the White e4 Pawn is defended.",
        "3... Bb4+": "The White King is flabbergasted as the \"dark-side\" Black Bishop places him under direct threat.  The Black \"dark-side\" Bishop draws his red lightsaber, swishing it through the air menacingly.",
        "4. c3": "White King must respond quickly so sends another Pawn forward to defend against the Force wielding \"dark-side\" Bishop.  The Black \"dark-side\" Bishop looks contemptuously at the defending Pawn, but prior to attacking notices that a trap has been laid and the White Pawn is well defended.  The Black \"dark-side\" Pawn cautiously looks towards his King, because in the end those that use the \"dark-side\" are always cowards.",
        "4... Be7": "The Black King nods and allows the Black \"dark-side\" Bishop to retreat, becoming part of the Black King's bodyguard.",
        "5. f4": "Once more White King sends a Pawn forward, this time directly challenging for the centre by attacking the Black e5 Pawn.",
        "5... d5": "The Black King responds in kind, sending a Pawn forward to d5 thus attacking the White e4 Pawn.",
        "6. exd5": "The White e4 Pawn is sent into battle by his King, he moves to engage the Black Pawn at d5 and decimates his defences.  White goes up in material by +1",
        "6... Bg4": "But this allows the Black \"light-side\" Bishop to draw his green lightsaber and rush to g4, threatening the White Queen.",
        "7. Qb3": "The White Queen is forces to retreat, moving to b3 which attacks the weakened Black b7 Pawn.  Black must now choose to defend either the undefended e5 Pawn or the undefended b7 Pawn.",
        "7... Nbd7": "With a sweeping move, Black sends his cavalry from b8 to d7 which defends the central e5 Pawn but leaves the b7 Pawn completely undefended.  What will the White King decide to do?",
        "8. h3": "Shockingly, the White King ignores the weak b7 Pawn and instead decides to oust the Black \"light-side\" Bishop from g4 by pushing a Pawn to h3.",
        "8... Nc5": "Unlike a follower of the \"dark-side\", the Black \"light-side\" Bishop is happy to hold his ground whilst the Black cavalry moves to c5, which threatens the White Queen and defends the Pawn at b7.",
        "9. Qc2 Bf5": "The White Queen is forces to retreat to c2, which allows the Black \"light-side\" Bishop to escape to f5.  The Black \"light-side\" Bishop now has pinned the White Pawn at d3 and blocked the forward progress of the White Pawn at f4.",
        "10. b4": "The White King falls back on his standard strategy and sends forth another Pawn to b4, attacking the Black cavalry on c5.",
        "10... Ncd7": "This forces the Black cavalry on c5 to flee.  The White King had thought a better move was to send the cavalry on f6 to e4, but Black chose to pull the cavalry on c5 back to d7, again defending the central e5 Pawn.",
        "11. g4": "White King immediately sent another Pawn forward, this time to g4, attacking the Black \"light-side\" Bishop.  The Force unlikely to save the Black Bishop without a sacrifice.",
        "11... Nxg4": "Which Black King provides through his cavalry.  Black King sends his cavalry to g4, knowing that they are lost but hoping to wreak White's plans by placing the White King under pressure.",
        "12. hxg4": "White is happy to comply, destroying the Black cavalry on g4.",
        "12... Bxg4": "The Black \"light-side\" Bishop swings his green lightsaber and decapitates the White Pawn on g4, placing a light threat on the White King by cancelling the possibility of a Queen-side castle.",
        "13. Qg2": "White King sends his most trusted advisor, the White Queen to deal with this threat.  She arrives at g2, guns charged and awaiting instruction.",
        "13... Bh4+": "But wait!  The Black \"dark-side\" Bishop decides to work together with the Black \"light-side\" Bishop and directly threatens the White King.  The White King had thought that sending a pawn to h5 was a better move for the Black King.",
        "14. Kf1": "The Force is strong with the pair of Black Bishops, so the White King is forced to retreat, moving to f1 and ending the possibility of castling later in the game.",
        "14... h5": "Knowing the Black \"light-side\" Bishop is vulnerable, the Black King sends a Pawn to h5 as backup.",
        "15. Nf3": "White sends his cavalry to f3, attempting to dislodge the Black \"dark-side\" Bishop.",
        "15... Bf6": "As always, the Black \"dark-side\" Bishop proves that those that follow the dark-side are cowards and retreats to f6 to help boost the defence of the central e5 Pawn.",
        "16. Nxe5": "But wait!  The White cavalry decides to make a sacrifice to gain control over the centre of the battlefield and attacks e5 obliterating the Pawn defence.",
        "16... Bxe5": "The Black \"dark-side\" Bishop shows some uncharacteristic courage and destroys the White cavalry, knowing he will be vulnerable afterwards to the White Pawn on f4.",
        "17. Qxg4": "The White Queen instead chooses to destroy the Black \"light-side\" Bishop with her heavy guns.  This places her under-threat from the Black Pawn on h5, but the Pawn finds himself partially pinned.",
        "17... Qf6": "The Black Queen dislikes being threatened, so moves to f6.  The White King believes hxg4 to have been a better move, destroying the White Queen.",
        "18. Qf3": "The White Queen follows advise and retreats back to f3, which places makes the threat on the Black \"dark-side\" Bishop more real.",
        "18... Bxc3": "The Black King thinks he sees an attack on the White rook, who has been minding his own business until now.  The White King believes a slightly stronger move was Bd6.",
        "19. Nxc3": "The White cavalry complies and destroys the Black \"dark-side\" Bishop, but leaves himself vulnerable to the Black Queen's heavy guns.",
        "19... Qxc3": "The Black Queen charges in, destroying the last of White's cavalry and attacking White's Rook.",
        "20. Qe2+": "The White Queen dislikes the threat on the innocent White Rook who has been neutral until this point and directly attacks the Black King.",
        "20... Kf8": "The Black King is forced to retreat to f8, finishing any hopes of an eventual castle.  The White King believes that Kd8 was a slightly stronger move.",
        "21. Bb2": "White's \"dark-side\" Bishop decides to make a show and attacks the Black Queen.  He draws his red lightsaber and moves to b2, defending the White Rook and attacking the Black Queen.",
        "21... Qxb4": "The Black Queen is forced to retreat, but decides to take out the White Pawn on b4 on her way.  By doing this she successfully isolates the White Pawn on a2.",
        "22. Rxh5": "The second White Rook decides that it's time to take a hand in events, he destroys the Black Pawn on h5 and threatens to finish the battle by destroying the Black Rook on h8.",
        "22... Rxh5": "This forces the Black Rook to attack the White Rook on h5, knowing that he is doomed as the White Queen has him locked on.",
        "23. Qxh5": "She rushes forward, destroying the Black Rook and leaving the defences of the Black King on the Kingside decimated.",
        "23... Qxb2": "Meanwhile, the Black Queen continues her assault on the Queenside of the White King, obliterating the undefended White \"dark-side\" Bishop.  In the last few moves, Black has won a Rook, a Bishop, and a Pawn for a Rook and a Pawn which places Black in the lead for material gain for the first time during the game.",
        "24. Qh8+": "The White Queen is not finished yet, she shoots down the h-file and places a direct attack on the Black King, forcing him to retreat.",
        "24... Ke7": "As the Black King is skewered, he is forced to move to e7.",
        "25. Re1+": "However, the up until now neutral White Rook sees a chance to make the Black King retreat further and shifts to e1.  This places another threat on the Black King, successfully removes the threat that was placed on the White Rook by the Black Queen and removes the threat on the White Queen placed by the Black Rook!",
        "25... Kd6": "Black's King retreats further to d6, away from his defensive back-rank.",
        "26. Qxa8": "The White Queen destroys the formerly neutral Black Rook, a funeral is planned.  The White Queen is forced to apologise for attacking a neutral unit without first sending a warning.",
        "26... Qh2": "The Black Queen capitalises on the free h-file by jumping to h2.  This threatens the White Pawn on f4.",
        "27. Qxb7": "The White Queen ignores this threat, destroying the Black Pawn at b7 and isolating both the Black Pawn at a7 and the Black Pawn at c7.  This move also threatens the end the conflict with a move of Qc6#.",
        "27... Qxf4+": "Black Queen decides to destroy the White Pawn at f4 and places a threat on the White King.  This means over the last few moves that White has won a Rook and a Pawn for a Pawn which puts the lead in material firmly in White's favour.",
        "28. Ke2": "White King retreats from the threatening Black Queen.",
        "28... Qg4+": "But wait!  Black King makes his first major mistake in this conflict.  By sending his Queen to g4, he attacks the White King but leaves himself vulnerable!  29.Kd2 Qg5+ 30.Kc2 Qe5 31.Qc6+ Ke7 32.Rxe5+ Nxe5 33.Qxc7+ Kf6 34.d4 Nd7 35.Qxd7 Kg5 36.Qxf7 g6 37.Bd3 Kh4 38.Qxg6, would win a Rook for a Queen, a Knight and three Pawns!  A far stronger move would've been for the Black King to retreat to e7, leading to 29.Kd1+ Kf6 30.d6 Qg4+ 31.Kd2 Nb6 32.dxc7 Kg5 33.Kc3 Qg3 34.Rf1 Qg4 35.Rxf7 g6 36.Qxa7 which only loses three Pawns.  But in all honesty the game is all but over at this point regardless.",
        "29. Kd2": "The White King notices the possibilities, moves himself out of danger and threatens to end the conflict with Qc6#.",
        "29... Qf3": "But Black King doesn't notice the danger, ordering Black Queen to f3 and giving White the field.  The better move was sending the Black Queen to g5 and keeping the pressure on the White King.",
        "30. Qc6#": "In the end, the White Queen finishes the conflict.  The epic battle has finished and all those that gave their lives for the battle will never be forgotten."
    },
    "url": "https://gameknot.com/annotation.pl/game-number-7-symmetrical-fun?gm=26393",
    "gameName": "Game Number 7 - Symmetrical Fun",
    "players": "freddz123 (1469) vs. pete59 (1579)",
    "opening": "Bishop's opening (C24), Berlin defence"
}