{
    "moves": {
        "1. e4 d5 2. exd5 Qxd5 3. Nc3 Qa5 4. Nf3 Bg4": "I am in general not a fan of this opening for black as he lacks some stability and is living off pins and threats.",
        "5. Be2 Bxf3 6. Bxf3 c6": "An okay defensive move. Black really needs to get his pieces out though.",
        "7. O-O e6": "Where are all black's minor pieces?",
        "8. d4 Be7 9. Bd2 Qb6": "I think this is a ?! Black is behind on development and is going pawn grabbing. This is usually not a good idea in a game but sometimes in blitz aggressive moves pay off since there is not as much time to analyze. This move does win a pawn.",
        "10. b3 Qxd4": "What now?",
        "11. Qe2 Bb4": "What now again?",
        "12. Nb5": "! This move keeps the game interesting beyond a boring queen trade. I am threatening Nc7+ winning the rook and being up the exchange unless black can take my knight.",
        "12... cxb5": "? This is the wrong response and loses.",
        "13. Qxb5+ Nc6": "? I think Nd7 is better as the knight is protected by the king. Even if black has to form a fortress, it does not crumble like it does here.",
        "14. Qxb7": "I think black is lost at this point.",
        "14... Rb8 15. Bxc6+ Kf8 16. Qxb8+": "16. Bxb4+ is a very bad idea due to 16. ... Qxb4 17. Qxb4 Rxb4",
        "16... Ke7 17. Bxb4+ Kf6 18. Rad1": "At last a non-check move. At this point I was not sure how to finish the game and just wanted to develop a mating net.",
        "18... Qb6": "Trying to force a queen trade",
        "19. Qf4+ Kg6 20. Qg4+ Kf6 21. Bc3+ e5": "Kd7 lasts longer.",
        "22. Rd6+ Ke7 23. Qd7+ Kf8 24. Qe8#": "The end combination is not as exciting as the rampage the queen and bishops earlier on. Often, one should really watch out for pawn grabbing when he's behind development. I make that mistake often though since I get greedy."
    },
    "url": "https://gameknot.com/annotation.pl/gameknot-blitz-http-gameknot-com?gm=43943",
    "gameName": "GameKnot Blitz, http://gameknot.com/",
    "players": "coolistdude  vs. just4kix ",
    "opening": "Scandinavian defence, Lasker variation (B01)"
}