{
    "moves": {
        "1. e4": "My 1st annotated game. More to learn how to do it and begin analyzing some games after the fact. This game is the game I broke 1450 with so it has some sentimental value to me. \n\nI am black and white opens with e4.",
        "1... e5": "I have been trying to play the Caro-Kann to just do something different, but lately back to e5 response. Also hate dealing with the f7 square valurabilities with this response.",
        "2. Nf3 Nc6": "Nothing strange going on yet. Had tried answering kf3 with d6 for a while but back to kc6 and am indifferent to the doubled pawn issue that can arise if he moves his bishop down. Used to hate that, now do not see it as a big, insoluable problem anymore.",
        "3. Bb5": "Bishop slips down. ",
        "3... Qf6": "Now I understand this to be a not too recommended play, but I find at the level I am playing at some of these suggestions do not apply as strictly. People are not playing long lines of traditional moves and tend to play it all more by ear after a few moves. This has been working for me as an alternative to a6 and then a possible doubled pawn scenario.",
        "4. Nc3 a6": "I do not like a bishop to roost with his sites on my king. Do a6.",
        "5. Nd5": "Knew this could happen from previous games and did not panic. But, I am not really in a good position. ",
        "5... Qd6": "Basically I am not going to leave my knight unguarded. If he takes him with his bishop I want to level things out fast with my queen then be able to pull out.",
        "6. Ba4": "But he doesn't take it! ",
        "6... Nf6": "Not sure if this was the best thing to do -as I usually tend to feel about every move I make- but I am looking at castling now. If he wants to exchange knights no biggie for now.",
        "7. c4": "Ah, now I see. He is one of those guys who is not inclined to exchange so quickly. This can lead to a really cluttered board and loss of attention on my part if I am not careful. I fail to see the forest blah, blah... \n\nSome players just refuse to trade off and it can take a hell of a lot of games before you begin to feel a little comfortable on a jumbled board. But you do get there. ",
        "7... Nxd5": "I am not against exchanges at this point. I prefer to try and gain in the material area in exchanges, but sometimes you have to keep things from getting too congested. I tend to dislike clogged boards more as black and try to get out of them. It never really happened this game and things stayed tied up and blocked until the rather \"miraculous\" ending.",
        "8. cxd5": "I think maybe  advancing his e4 pawn would have caused me more trouble by preventing my b7 pawn to bolt up later.  Still not very friendly on Black Dragon 5's part. ",
        "8... Nd4": "I am a sloppy player with knights. I really have no where to escape to to now with him that I would not lose him, but...",
        "9. Nxd4": "he goes for the exchange...",
        "9... exd4": "and I take it but now have an unguarded pawn (is there some fancy chess term for that?) on d4.",
        "10. Qc2": "Not sure if this is good or bad, but it does not look inviting.",
        "10... b5": "Need to push his pawn around a bit. Can be unsettling to have your pieces pushed into places you don't want them to go. Not a win or lose issue, but frustration can lead to errors.",
        "11. Bb3 g6": "Go for the fianchetto and castle soon",
        "12. a4": "These moves always throw me off. Real aggressive though not necessarily well thought out. Obviously going for either me passing on the exchange or taking it, and then doing a rook exchange.",
        "12... Bb7": "Better guard the rook here.",
        "13. axb5": "There we go...",
        "13... axb5 14. Rxa8+": "rook is zapped...",
        "14... Bxa8": "but the exchange is even, and my bishop is posted on the diagonal that eventually helps me win the game.",
        "15. O-O": "He castles. Might as well I guess and get his remaining rook out. Game may have turned out entirely different had he not traded rooks, but some players feel pushed to do that. Not that it was a bad thing, but he was a strong player and two rooks would have been a lot of work for me.",
        "15... Bg7": "Fianchetto time.",
        "16. Re1": "Rook pressure not only king but my queen with his rook/pawn combo.",
        "16... O-O": "No more pressure on my king.",
        "17. d3": "My isolated pawn is surrounded by hostiles. Resign I will have to let him go, but for now guarded by my bishop.",
        "17... c5 18. f4 f6 19. g3": "Things creeping along here. each guy waiting for the other to do something.",
        "19... Rc8 20. f5 g5": "I pass on the exchange and possibly opening the file with his rook on the far side staring down on me.",
        "21. Kg2": "He seems to be just moving here but not developing much.",
        "21... h5 22. h4 g4": "His king cannot escape down to the white squares on rank 3 now and my pawns are as advanced as his have been for several moves.",
        "23. Bf4": "Ah, some aggression. Nothing I can do but...",
        "23... Qf8": "get out of the way and see what happens next.",
        "24. d6+": "Yikes! More aggression. His bishops have become a serious threat now. ",
        "24... Kh7 25. Kh2": "I can tell he wants to move his e4 pawn down now but must move his king out o the way due to my white bishop. I see a weakness now on that diagonal but not sure how to exploit it.  ",
        "25... Qd8": "Need to get my queen to b7 or c6. ",
        "26. Qd2": "Not sure what is up here. he cannot occupy f6.",
        "26... Qb6": "Slowly, like a tortoise...",
        "27. e5": "More pressure here. I see where I need to go but his rook on the back rank is preventing me. Consider how to force him into taking my rook, but must deal with one issue at a time.",
        "27... fxe5 28. Bxe5": "Hoped he would take it with his rook, but no such luck. Need that rook off that back rank!",
        "28... Qc6": "He lost protection for his bishop coming to c4 earlier. It is a long shot I am playing with here. He has to see what I am up to right?",
        "29. Re2": "Wrong. For some reason I do understand he moves his rook down. A miracle really. Maybe double protecting the g2 square. In any case...",
        "29... Qh1#": "The game ends suddenly and I break 1450 for the 1st time. Any lesson here for guys at my level is that do not assume the other guy sees your \"brilliant\" though obvious plan and so you may as well give up on it. Who knows what may happen"
    },
    "url": "https://gameknot.com/annotation.pl/game-with-bill-in-china?gm=41263",
    "gameName": "Game with Bill in China",
    "players": "blackdragon5 (1343) vs. billdancourtney (1455)",
    "opening": "Ruy Lopez (Spanish opening) (C60)"
}