{
    "moves": {
        "1. e4 e5 2. Nf3 Nc6 3. Bb5": "The Ruy Lopez, also known as the Spanish Game. Or the Spanish Torture.",
        "3... Nge7": "This is the Modern Steintitz variation, not very popular, because it blocks in the dark squared bishop and developes the knight to a less agressive square than the more popular Berlin and Morphy Variations.",
        "4. Nc3": "4. 0-0 is more common.",
        "4... a6 5. Ba4": "The bishop flees.",
        "5... b5": "Not the best move as it chases the bishop onto a very strong diagonal, better may have been d6, or even d5. Though this move does have the benefit of readying black's bishop for fianchettoing, if I play d3 at any time, his Bishop will be biting on granite.",
        "6. Bb3 h6": "Blocking the bishop and knight out of the strong g5 square and severely limiting the bishop's scope. Probably the best way to meet the threat of Ng5 because of the knight sitting on e7. Atleast it's better than f6 which allows white's light squared bishop to aim deep into the black kingside.",
        "7. d4": "Challenging Black's center and trying to open the game up so that my lead in developement will have a greater effect.",
        "7... exd4": "Capturing the pawn. Not forced but 7...d6 will end with an unpleasant Queen trade, 7...f6 will weaken the Kingside and 7...Ng6 looks bad after    8. dxe5 Ngxe5 9. Nxe5 Nxe5 10. Qd5 which forks the Knight and Rook, and should the Knight move, it threatens mate on f7.",
        "8. Nxd4 Nxd4": "It was probably not best to trade the knights, because this gives up Black's only well developed piece and brings the White queen out. Normally you want to keep your queen safe and out of the center at the beginning of the game, but here Black doesn't have enough pieces to really threaten the Queen. And with the Queen out, it may be able to work with the Bishops to get a powerful attack. Better I think was 8...Ng6 9. 0-0 Nge5.",
        "9. Qxd4 c6": "Not the best move, as it block in the white bishop, and it does not even keep the Queen out of d5, as the knight controls d5, but that is probably why it was played. Better I think was 9...Nc6 10. Qd5 Qf6 followed by Bb7 and Bd6 or Bc5 and Black's game is fine.",
        "10. Bf4": "Developing the bishop and adding the potential for threats againt the enemy queen. Though 10. a4 Bb7 then probably 11. 0-0 Ng6 was probably the best way for me to continue.",
        "10... Ng6": "Finally moving the knight away and freeing up Black's Bishop and Queen, and attacking the Black bishop.",
        "11. Bg3": "Once more the fleet-footed Bishop flees from it's fearsome foes.",
        "11... c5": "?? A very bad move, losing to the fork of 12. Qd5.",
        "12. Qd5": "This move wins by threatening mate on f7 and capturing the rook on a8, but I think that 12. Bxf7  Kxf7 13. Qd5  Ke8 14. Qxa8 was also playable, but now Black has no isolated c-pawn, as you shall seem him get in the game.",
        "12... c4": "Trapping the Bishop but it's not enough.",
        "13. Bxc4": "The Bishop is lost anyway, and his Rook can't flee because of mate on f7. And if I has just taken the Rook he could've messed up my pawns.",
        "13... bxc4 14. Qxa8": "Now I'm up a rook and a pawn against a Bishop.",
        "14... Bb4": "Pinning the knight",
        "15. O-O Bxc3 16. bxc3": "Recapturing. Now I have the open b and d files to work with.",
        "16... O-O 17. Rad1": "Claiming the d file and lining the rook up with his queen, and saving the other rook to support my e pawn should my d file battery fail to win. Qd5 to win the pawn immediately and Rfe1 were also very good moves.",
        "17... f6": "? Another blunder, this time carelessly allowing the Queen to fork King and Pawn. This also leaves the knight unguarded and weakens the kingside in general.",
        "18. Qd5+": "Forking king and pawn.",
        "18... Kh8 19. Qxc4 Bb7": "And the last Bishop the Bishop joins the party.",
        "20. f3": "20. Rd4 was the best way to guard the Pawn. This move just wastes time.",
        "20... Ne5": "Attacking the queen, and getting the knight to a good square.",
        "21. Bxe5": "Trading down while up material.",
        "21... fxe5 22. Qd3": "Doubling on the d file.",
        "22... Rf7": "Trying to defend the d pawn.",
        "23. Rd2": "Preparing to triple, after which the bishop would have to go back to c8 and my queen could then roam the board freely attacking whatever it wanted to and I could march the c pawns up the board to eventual queening. His defenses are stretched to the limit and he can't handle anymore threats,  so he resigned. "
    },
    "url": "https://gameknot.com/annotation.pl/games-of-the_ashaman-stretched-to-the-limit?gm=3708",
    "gameName": "Games of The_Ashaman - Stretched to the limit",
    "players": "The_Ashaman (1588) vs. Gibonacci (1537)",
    "opening": "Ruy Lopez (C60), Cozio defence, Paulsen variation"
}