{
    "moves": {
        "1. e4 e5 2. Nf3 Nc6 3. Bb5 Nf6 4. O-O Be7": "Here Black could have been a bit more aggressive, with Bc5.\nAlternative variation: 4...Nxe4? 5.Re1 Nd6 6.Nxe5 += [Black cannot take 6... Bxb5, otherwise 7. Nxc6 and the black Queen is lost. But the position is already bad for black.] \n",
        "5. Re1": "White chooses to defend e4 with the Rook (instead of Nc3) to occupy the e-file and to build a strong center with c3-d4-Nd2.\n",
        "5... O-O 6. c3 a6": "Black should have acted against White's plans by either Re8 or d6.\n",
        "7. Ba4": "White strangely does not take the Nc3, which is normal in the Ruy-Lopez: moreover, Black has casted already, so the Bb5 is not threatening the fork in case Black plays d6 or d5.\nAlternative variation: 7.Bxc6 [Better would have been to take the Nc3, the only defender of e5.] 7...bxc6 [Take with b7 instead of d7 to open the b-file for the R and to allow d5 later.] 8.Nxe5 Rb8 \n",
        "7... d6 8. h3 b5 9. Bb3 Na5 10. Bc2 Bb7 11. d4 c5": "Black seems better developed so he tries to free up the game crushing White's center.\n",
        "12. d5": "White tries to close the game, maybe to prepare an attack on the King-side. But he's still underdeveloped and most of his pieces are on the Queen-side.\n",
        "12... Qc7 13. b3 Bc8": "Make some space for Na5 and shift some power on the King-side, just in case.\n",
        "14. Nbd2 Ne8 15. Nf1": "Characteristic move of the Ruy-Lopez, to prepare an attack on the King-side.\n",
        "15... f5 16. Nf1h2": "The N seems more effective in e3 or g3, bulding up some pressure on f5.\n",
        "16... Nb7": "This is a loss of time. Action is on the King-side, and Black should continue with the idea started with f7-5, either by f4 or fxe4.\n",
        "17. Kh1": "With this move White shows his intention to move Rg1 in order to continue his attack. Therefore, Black should take advantange of that and take fxe4.\n",
        "17... f4": "Black should have taken fxe4.\nAlternative variation: 17...fxe4 18.Rxe4 c4 =+ [And Black's Knights have two beautiful squares to occupy: c5 and f6.] \n",
        "18. Rg1 c4 19. b4 Bd7": "To put some pressure on the Queen-side, but there seems to be enough already. Better would be Nf6.\n",
        "20. a3 Nf6 21. Bd2 a5 22. Qe2 h6": "Not sure what's this for. A waiting move maybe. But it weakens Black's King-side.\n",
        "23. a4 axb4 24. cxb4 Rfc8 25. Bc3 bxa4": "Now Black has two powerful passed pawns, backed up by his Rooks.\n",
        "26. Nd2 a3 27. g4": "White tries an attack on the King-side in order to shift the attention from his falling Queen-side.\n",
        "27... Nd8 28. g5": "White does not seem to have enough power to break through Black's King-side.\n",
        "28... hxg5 29. Rxg5 Ne8": "White's Rook is hanging and Black should take advantage of it. Instead, with fear, he defends g7 (and attack Rg5) but without taking the initiative.\nAlternative variation: 29...Nxd5 \n",
        "30. Rh5 g6": "This weakens the already weak g2 and it fails to threaten Rh5 because of the next-to-come fork Rg1.\n",
        "31. Rg1 Kg7 32. f3": "Make some room for the Queen to get to g2.\n",
        "32... Nf7 33. Qg2 g5 34. h4 Qd8": "Much better would be Kg6, trapping Rh5.\n",
        "35. hxg5 Nxg5 36. Rxg5+": "White aims to simplify the game, but this move clears the board of many pieces and the two Black's passed pawns increase their value.\nAlternative variation: 36.Ng4 a2 37.Nxe5 a1=Q 38.Rxa1 Rxa1+ 39.Bxa1 +/- [And Black's position look really bad, with his King completely exposed.] \n",
        "36... Bxg5 37. Qxg5+ Qxg5 38. Rxg5+ Kf6 39. Rh5 Ng7": "Black should lose no time and push his pawn a3.\n",
        "40. Rh6+ Ke7 41. Ba1 c3 42. Nb3 Ba4 43. Rg6 Ne8": "Again a weak move from Black. Better would be Nh5.\n",
        "44. Rg1 Bxb3 45. Bxb3 Nc7 46. Rg7+ Kf8 47. Rg1 Nb5 48. Bc2 a2 49. Ng4 Nd4 50. Rg2 Nxf3 51. Nf6 Kf7 52. Ng4 Nd4": "Black fails to see Rh8+, but just for few moves. Time is running out.\n",
        "53. Nh6+ Kf6 54. Ng4+ Ke7 55. Bd1 c2 56. Bxc2 Nxc2 57. Rg1 Nxb4 58. Nh6 Nc2 59. Nf5+ Kf6 60. Nxd6": "White was already busted, but this move is the definitive mistake.\n",
        "60... Rch8+ 61. Kg2 Rag8+ 62. Kf2 Rh2+ 63. Kf1 Ne3+ 64. Ke1 Rxg1#": ""
    },
    "url": "https://gameknot.com/annotation.pl/gameknot-blitz-http-gameknot-com?gm=40209",
    "gameName": "GameKnot Blitz, http://gameknot.com/",
    "players": "felicil  vs. lbolla ",
    "opening": "Ruy Lopez (C65), Berlin defence, 4.O-O"
}