{
    "moves": {
        "1. d4 c5": "An opening I seldom face, leading me to unknown grounds (as a player). ",
        "2. d5 Nf6 3. c4 g6 4. Nc3 Bg7": "Now, d6 is interesting... I know there is a lot of theory about all this, but I don't have any access to it, unless I spend more time than reasonable to find out... e4-e5, if allowed, can be deadly for black, unless he defends properly...",
        "5. g3": "I read somewhere that this is one of the quietest moves white can do, being preferred Nf3 or e4 as more aggressive. I wanted to delay e4 and use the tempoes for developement, since I'm not doing well currently. ",
        "5... O-O": "I lost here the chance to go d6 and see what happened. ",
        "6. Bg2 d6": "Ok, closed game, normal setting... subtle, long term strategy required. Against such a strong player, I'm just out of my confort zone. ",
        "7. Bd2": "I found nothing better than guard the queenside. Nb5 is a shot in the dark, and just returns tempo loss after a6. ",
        "7... Na6": "Black has the same idea... but in doing this, he actually helps me.",
        "8. Nb5": "Now, it's another story, since a6 is not possible right now. Now if black goes Nb4, a3 will do. So black went back to...",
        "8... Nc7 9. a4": "I had just this tempo to make something out of the knight's \"sortie\". It could have been Qa4, but I felt it premature and pointless. Another chance was Ba5, provoking b6, NxN, QxN, Bc3. ",
        "9... a6": "Expected. ",
        "10. Nxc7 Qxc7 11. a5": "Being impossible to go there with the bishop, I push the pawn in. ",
        "11... Nd7": "Interestingly enough, the game is completely switched to queenside fight, and the kingside is left completely alone. Be aware of sudden opening by black. I have thre pieces completely inactive, by the way, so I can't say I have the edge. Let's see if the queenside incursion will give some return. For now, I avoid Qb6 by black. If b6, I'll hold. ",
        "12. Qb3": "I liked this move, making whathever possible from the queenside pressure. b4 was not convincing me, because of the weakness of c4.",
        "12... b5": "Very interesting: black aims to open the way for Rb8, with pressure on b2, combined with the bishop. So I have to act with great care. ",
        "13. cxb5": "Not axb6, giving space to his knight to came out (Ne5 doesn't worry me). ",
        "13... axb5": "I was sure he expected here Qxb5. ",
        "14. Bc3": "Here I leave the initiative to black, right, but he has to think hard which pawn to advance (if ever). ",
        "14... b4": "Ok, and I know that c5 is not possible, since now Qxb4 is possible, without the black's dsb. ",
        "15. Bxg7 Kxg7 16. Qa4": "I have to defend the a pawn, that seems to be all my advantage in this game. Note that my kingside is still paralyzed!",
        "16... Bb7": "Preventing Qc6. ",
        "17. e4": "Kind of a loss of tempo, but allows me to fee my lsb. ",
        "17... f5": "This move offers inmediately a target for my knight, that awakens just in time!",
        "18. Ne2 fxe4 19. Nf4": "No way for black to lose the exchange. ",
        "19... Rxf4 20. gxf4": "This makes me some damage, disrupting the kingside's pawn. Now, if black gets to overcome his own pawn's chain, he will crush my exposed king. ",
        "20... Bxd5": "This is the downside to have lost the exchange. This central force seems unbreakable. ",
        "21. a6": "Well, let's play a little more. ",
        "21... Rf8 22. a7": "I won't try to defend f4. I have to go my way, and fast!",
        "22... Ba8": "Now, d5! by black is decisive. ",
        "23. Bh3": "Desperate. Here, black's e3 wins for sure. ",
        "23... Nb6 24. Qa6": "Now believing in my chances, really. ",
        "24... Rxf4": "Lazyness by black: d5! was the route to the win. ",
        "25. Ra5": "I will threat the knight...",
        "25... Rf8": "?? Is black planning d5 - Qf4?",
        "26. Rb5 Nd5": "Black seems so sure of his superiority... and he has good reasons!",
        "27. b3": "This move is to throw a check with Qa1. Here, Be6 was a possibility. If Rf6, BxN, BxB, a8=Q, BxQ, QxB. ",
        "27... Nc3": "Stopping the check, and renewing the threat of e3.",
        "28. O-O": "Can you believe I didn't take into account NxR ???",
        "28... e3": "Can you believe he didn't go for it?",
        "29. Rb8": "I'll lose material, but he spared me the game. ",
        "29... Ne2+": "? Probably played with the intention of diverting my queen from the defence of a7, but it was lost anyway. O he just blundered the knight!",
        "30. Qxe2 Rxb8": "Here, I lose my pawn, but he accomplish a mission: to leave black heavily restricted. ",
        "31. axb8=Q exf2+": "? The losing blunder. This just frees my way. ",
        "32. Qxf2 Qxb8 33. Qf7+ Kh6 34. Rf4": "...and black is lost. The line g5 leads to a) 5. Qe6+\tKh5? 36.\tBg4+, Kh4,  37. Qh6#, but the shown sequence is not mate but leaves black without a chance. ",
        "34... g5 35. Qe6+ Kg7 36. Rf7+ Kh8 37. Bf5 Qg8 38. Rxh7+ Qxh7 39. Bxh7 Kxh7 40. Qxe7+": ""
    },
    "url": "https://gameknot.com/annotation.pl/gameknot-blitz-http-gameknot-com?gm=53415",
    "gameName": "GameKnot Blitz, http://gameknot.com/",
    "players": "damalfi  vs. player (2200)",
    "opening": "Old Benoni defence (A43)"
}