{
    "moves": {
        "1. e4 c5 2. Nf3 e6 3. d4 cxd4 4. Nxd4": "conventional opening",
        "4... Bc5": "aggressive. right to the attack.",
        "5. Be3": "keep developing",
        "5... Qb6": "oh what is this? flashy, but unimpressive.",
        "6. Nc3": "my pretentiousness bites me in the ass. i've realized i've left a pawn hanging but i still like the development on my part. deeper into trouble i go now...",
        "6... Qxb2": "yup. and now an unprotected knight. double uh oh.",
        "7. Na4": "save the knight! don't be boring! aha! a fork! the first of many!",
        "7... Qb4+": "check! aha! a surprise but only a minor shock. i unravel the layers...",
        "8. c3": "multi-move. block the check, protect (more) the knight, reveal defenses for stranded knight. the beginning of the end.",
        "8... Qa5 9. Nxc5": "rip away the middle from everything he's got. 2 pawns, three players vs one queen and dumpling pawn.",
        "9... Qxc5 10. Qb3": "feeling more confident than ever, seeing the results of my forward thinking, i consider some more development. also protects against a check i want to discourage after my next move. the fun begins!",
        "10... Nf6": "this move meant nothing to me. i swatted it away like a dumb mosquito.",
        "11. Nxe6": "Time for disassembly.",
        "11... Qe5 12. Nxg7+": "Go on, the batterment continues and keeps my board interesting. My thinking is at another level, high above my opponent's. I foresee him still feeling mildly aggressive, enough to take the bait at e4. My next move has already happened.",
        "12... Kf8 13. Nf5 Qxe4 14. Nd6": "There it is. A rare find. An undisturbed bishop for the taking, coupled nicely with my opponent's even less satisfying option. My opponent is so befuddled with all this horseplay. His next move is his last mistake.",
        "14... Qe8 15. Nxe8": "Just a slice in the throat."
    },
    "url": "https://gameknot.com/annotation.pl/gameknot-blitz-http-gameknot-com?gm=54898",
    "gameName": "GameKnot Blitz, http://gameknot.com/",
    "players": "blackmonkey (1431) vs. vcwriter (1674)",
    "opening": "Sicilian (B40), Anderssen variation"
}