{
    "moves": {
        "1. e4 c5 2. c4 Nc6 3. d3 d6 4. Nc3 Nf6 5. Nf3 e6": "Now that I have time to think I'm reviewing certain moves from this blitz game.  Possible 5...Bg4 what did I ever do with that LSB?  Took until move 19 to get it going and then it played an important role on the e6-b3 diagonal.  Better than ...Bg4 would have done.",
        "6. Be2 Be7 7. Bg5 O-O 8. O-O Nd7": "Computer doesn't like this move but it's blitz and I'm looking at that N on the Q-side anyway.\n",
        "9. Bxe7 Qxe7 10. Qd2 Nb6 11. b3 Rd8": "I keep preparing the central break.  He should do the same.  Actually, b4 or a4 would have also been good ideas for him I believe.\n",
        "12. Qe3 h6 13. Rad1 d5": "I'm ready but computer doesn't like it.  I was thinking his last 2 moves were pretty defensive.\n",
        "14. exd5 exd5 15. cxd5 Qxe3 16. fxe3 Nxd5 17. Nxd5 Rxd5 18. e4": "The position opened up as I thought but the moves were played very quick.  I'm sure he played 18.e4 for tempo but d4 would be better.  And really I should have responded ...Rd6 but my head started spinning so the simple ...Rd8 was played.\n",
        "18... Rd8 19. Ne1": "Can only re-deploy to c2 but then where?  In the game he just returns it to f3 lol\n",
        "19... Be6": "So that’s where my LSB ended up.  I was preparing for mobilization of my Q-side pawns.\n",
        "20. Nf3 b6 21. d4 Nxd4 22. Nxd4 Rxd4 23. Rxd4 cxd4 24. Bd3": "Objectively better to activate pieces along open lines.\n",
        "24... Rc8 25. h3": "He’s allowing me lots of time.\n",
        "25... Bd7": "Wanted to move my b-pawn but can’t remember why?  ...Rc3 is great but no rush to play it.\n",
        "26. Rf2 b5 27. a4": "He’s challenging me but I’m pretty strong over there.\n",
        "27... a6 28. axb5 axb5 29. Kh2": "His poor R is just sitting there.\n",
        "29... Rc3": "Now my R has strong purpose.",
        "30. Bc2 Be6": "Or d3 because it gets captured on move 33 and it's a valuable passed pawn.\n",
        "31. Rd2 Bxb3 32. Bxb3 Rxb3 33. Rxd4 Ra3": "Wrong.  Keep the R on the b-file.\n",
        "34. Rb4 Ra5": "Or …Ra4.\n",
        "35. e5 Kf8": "Good.\n",
        "36. Kg3 Ke7 37. Kf4 Ke6": "…Ra4 is much better...almost winning.  Pins the R!\n",
        "38. Ke4 f6": "…Ra4 just never dawned on me.\n",
        "39. exf6 gxf6 40. Kd4 Kd6 41. Kc3 Kc5 42. Rh4 f5": "Too quick.  Requires deep analysis though.  Computer really likes …Ra3+ but the obvious Kb2 needs a lot of thought to refute.\n",
        "43. Rxh6 b4+ 44. Kb3 Ra3+": "That’s better.\n",
        "45. Kb2 Kc4": "Better is …Rg3…Rxg2+\n",
        "46. Rf6 Ra5": "No need.  Plus his K-side pawns are strong.\n",
        "47. Rc6+ Kd3": "Not bad.  Check out …Kd4 and then what?\n",
        "48. Rd6+ Kc4 49. h4 b3 50. h5": "Nope.  Allows the next move.\n",
        "50... Ra2+ 51. Kb1 Kc3": "…Rxg2 was needed but I see what I was thinking…trying to promote the b-pawn.\n",
        "52. Rc6+ Kb4": "I timed out.  He played well especially with almost 200 ELO difference.  He had 9 seconds left.\n"
    },
    "url": "https://gameknot.com/annotation.pl/gameknot-3-minute-blitz?gm=64038",
    "gameName": "GameKnot 3 minute Blitz",
    "players": "miperralaica (1459) vs. e4newman (1628)",
    "opening": "Sicilian (B20), Gloria variation"
}