{
    "moves": {
        "1. d4": "A relatively cleanly-fought blitz game, one of my proudest efforts against an 1800+ player (I play white).  Although I \"won\" this game, it was a very draw-ish finish, and with a slight time disadvantage black resigned (perhaps losing interest).",
        "1... e6 2. c4 Nf6 3. Nc3": "Although I have been playing queen's-pawn openings exclusively, I still feel I am stabbing in the dark for sound move order.",
        "3... d5 4. Bg5 dxc4 5. a3": "This move was particularly murky to me.  I'm sick of black playing Bb4 and removing my Nc3 from the board, but I don't know if this is right in this position.",
        "5... h6 6. Bxf6": "I suppose a retreat to h4 and g3 was possible, but I went with the exchange, which I believe should strengthen my pawn center.",
        "6... Qxf6 7. e4 b6 8. Bxc4": "Without the black Nf6, the coming fianchetto will pose no immediate threat, so I take the opportunity to recapture the pawn.",
        "8... Bb7 9. Nf3 Nc6 10. O-O": "This castle made me nervous, with my pawn center relatively easy to open, the fianchetto pointing down the long diagonal, and the black Q already in the neighborhood, but the opposite castle was very drafty, so I went with this.",
        "10... O-O-O": "An excellent castle by black, immediately attacking the center.  The pawn cannot stay on d4, and black's rook is staring at my queen.",
        "11. d5": "Moving to a better-defended square, where it will stay for a while, blocking black's LSB.",
        "11... exd5 12. exd5 Ne5": "Black needed to put the N somewhere; this move looks nice and active.  But it allowed me a simplifying combination that improved my position.",
        "13. Nxe5 Qxe5 14. Qg4+": "Dodging the rook's threat, with check.  I was proud.",
        "14... Kb8": "Black steps away from the check, but I think blocking with f5 was stronger.",
        "15. Rfd1": "I have now fortified my position, but I am without a plan.  That was irrelevant as dahnoos maintained initiative throughout the next sequence.",
        "15... Bd6": " Threatening an incursion.  I didn't want to weaken the light squares and considered Qg3, accepting the doubled pawns, here.  But I chose",
        "16. g3": "the simplest reply.",
        "16... f5 17. Qe2": "Without ideas and with material equality, I look to simplify.",
        "17... g5": "Black is in no hurry, and gains tempo by allowing me to initiate.",
        "18. Qxe5 Bxe5 19. Rd3": "I played this to protect the Nc3, not wanting to isolate my a pawn against black's queenside majority.",
        "19... Bxc3 20. Rxc3": "I recapture as planned. However, this promptly loses a pawn.  Was bxc3 better, allowing the isolation but maintaining material equality?",
        "20... Bxd5": "There it goes.  Oh well.",
        "21. Rac1 Bxc4 22. Rc3xc4": "And I arrive at a rook and pawn endgame against the high-rated dahnoos.  I didn't like my chances.",
        "22... Rd7 23. Kg2": "Having no idea what to do, I decided to get out of the way of any back-rank checks, for the moment.",
        "23... h5 24. Re1 Rd2 25. b4 Ra2 26. Rc3": "For the moment I have defended.  Hallelujah!",
        "26... h4": "I think Rd8, Rd2 was a better plan.  Not that I saw this at the time. I struggled over what to do here, and decided there was no immediate threat in an open h file.",
        "27. Re5 hxg3 28. hxg3 Rf8": "I spend some precious seconds here, trying to figure out what was sound.",
        "29. Rf3": "This worked in blitz.  Is it sound?",
        "29... g4": "Trades rooks and pawns, but then allows me to regain the pawn I lost earlier. ",
        "30. Rfxf5 Rxf5 31. Rxf5 Rxa3 32. Rf4": "Black cannot defend, while I can take and defend simultaneously.",
        "32... Ra4 33. Rxg4 a5": "A mistake.  Of course I cannot take, but I can give check and then take.  Black had to play Kb7 here, then I would have had no way to save my pawn.",
        "34. Rg8+ Kb7 35. bxa5 bxa5": "Even on material, I had about 1:05 left to black's :50.  I still thought I would lose, and planned only to play quickly and try to keep the time advantage.",
        "36. Rg6": "Aimed only at keeping the black king from advancing, which of course does not work--36...c6 gives him cover--but here dahnoos let 25 seconds go by and then resigned, perhaps having overestimated my competence in the endgame, or simply having lost interest.  Anyway, thanks to dahnoos for the game, and feel free to comment."
    },
    "url": "https://gameknot.com/annotation.pl/gameknot-blitz-http-gameknot-com?gm=41431",
    "gameName": "GameKnot Blitz, http://gameknot.com/",
    "players": "benrous1  vs. dahnoos ",
    "opening": "Queen's pawn (A40), Keres defence"
}