{
    "moves": {
        "1. d4": "My opponent begins with the Queen's Pawn, which is slower for castling than the more popular King's Pawn.",
        "1... Nf6": "I'm familiar with Queen's Pawn openings, I play against a very good player in Costa Coffee fairly regularly who always opens with it.  My standard response is Nf6, with the hope of a King's Indian.",
        "2. Nf3 g6 3. c4 Bg7": "And here I begin, with the fianchetto of my dark Bishop.",
        "4. Nc3": "Solid development move, but gives Black options in how to progress.  I considered continuing down my preferred route by castling, but I haven't tried out the Grunfeld and wanted to keep the option there so was forced to play. . .",
        "4... d5": "which is because White's 5th move was likely to be e4 and would've prevented me from playing to d5.",
        "5. Qb3 dxc4": "I didn't like the pressure White was placing on the central squares, so felt a quick exchange of Pawns might benefit me.",
        "6. Qxc4 O-O 7. e3": "I have to question the power of this move.  I feel e4 was perfectly playable and a stronger move, imposing a stronger control on the centre.",
        "7... Nc6 8. Be2": "I think I'd have probably played Bd3 instead, I think Be2 was a little passive.  Opens the way for a short-castle but not a strong square for the light Bishop to be on.",
        "8... Be6": "Attacking White's Queen, forcing her on the defensive.",
        "9. Qb5": "Moves off to relative safety, but is too easily chased away.  I'd have probably gone Qa4 instead, same sort of idea as Qb5 but more difficult to shift.",
        "9... a6": "Obvious, moving the Queen on her way.",
        "10. Qc5": "She is forced to retreat again.",
        "10... Qd7 11. O-O b6": "Continuing to harass the Queen, who by now must be feeling slightly annoyed at all the unwanted attention.",
        "12. Qa3 b5": "Looking at forcing the Queen to retreat behind her own lines.",
        "13. b4 a5 14. Nxb5": "Isolates Black's c7 and a5 Pawns, only real move that was available that didn't quickly end with White a Pawn down.",
        "14... axb4": "Attacking White's Queen, again forcing her on the retreat.  Quite happy at this point, as I'm able to keep my opponent having to react to me instead of being able to lay his own plans.",
        "15. Qb2 Rfb8": "Looking at attacking the White Queen again by exchanging Pawns on the b and a file.  Again, a lesson I learnt from the game I had against easy19, \"Put your rook on the line of the queen, whatever the pieces that intervene\" (I believe the quote came from Ion).",
        "16. Nd2": "Oblivious to any danger?  I thought a4 was the best bet here.",
        "16... Nd8 17. Qxb4": "White makes a gain in material, but it's a false lead.  17...c6 18.Ba3 Nd5 19.Qb2 cxb5 would've left Black in a very favourable position.",
        "17... c6 18. a4": "Instead of Ba3, which I consider to be better, White pushes the passed Pawn.",
        "18... cxb5 19. Bf3": "Quickly trying to regain the lost ground by attacking Black's Rook.  I think instead White should've considered pushing the Pawn to a5.",
        "19... Nd5": "During the game I was in two minds here.  I had considered 19...bxa4 instead, which would've allowed for a great attack on White's Queen unless he retreated in which case an extra material lead instead.  In the end, I obviously decided on Nd5, threatening White's Queen and removing the threat on my own Rook.  I have second thoughts now, I suspect bxa4 was the stronger move.",
        "20. Bxd5 Bxd5": "Always nice to make an exchange when you're already up in material.  I think White should've considered 20.Qb2 bxa4 21.Qa3 instead.  Yes it gives up the Pawn, but I think the position after was more favourable for White than this one is.",
        "21. Ba3": "Finally frees his Pawn from the pin.",
        "21... Nc6": "Felt White's Queen was getting lonely, so decided to pay her a visit :o)",
        "22. Qc5 Rxa4": "More material gain and a partial pin on White's Bishop.",
        "23. f3": "I certainly can't find a winning move for White here, but I feel this was a losing move.  I think perhaps 23.Bb2 was the best bet.  23.f3 allows more exchanging, and in this position White would be wise to attempt to keep all of his pieces as safe as possible due to the loss of material earlier on.",
        "23... Nxd4 24. Qxe7": "Exchange-athon :o)",
        "24... Qxe7": "Exchange-athon :o)",
        "25. Bxe7": "Exchange-athon :o)",
        "25... Rxa1": "Exchange-athon :o)",
        "26. Rxa1": "Exchange-athon :o)",
        "26... Nc6": "Black is now looking very good for the win.  A threat placed on two of the remaining White pieces means White has a serious question on his hands, which piece do I save?",
        "27. Rd1": "White saves his Rook, but decides the time to resign has come.  Thank you for a wonderful game, more ideas tested and more things learnt."
    },
    "url": "https://gameknot.com/annotation.pl/game-number-15-62nd-gk-tournament-round-1?gm=26976",
    "gameName": "Game Number 15 - 62nd GK tournament Round 1",
    "players": "fradec (1759) vs. freddz123 (1784)",
    "opening": "King's Indian (A48), East Indian defence"
}