{
    "moves": {
        "1. e4 e5 2. Nf3 d6 3. d4": "Phillidor's defense.",
        "3... exd4 4. Nxd4 h6": "?! I think this is unnecessary.  Neither Bishop nor knight is going to g5 anytime soon.",
        "5. Nc3 Be7 6. Be3 Nf6 7. Bd3 b6": "!? Weakens a6, c6, d5, especially since black never plays Bb7.",
        "8. O-O c5": "? This has to be a strategical error.  It leaves a backward pawn on d6 and weakens the light squares more. ",
        "9. Bb5+": "Forcing the exchange of bishops, and his was the only defender of the light squares.  I also wanted to clear out the knight and bishop between my queen and his d-pawn.",
        "9... Bd7 10. Nf5": "Adding a second attacker onto d6.",
        "10... O-O 11. Nxe7+": "I played this because I thought that it would make the attack on d6 easier, and that I wanted to have a bishop over knight advantage, but in retrospect, this seemed like trading an active knight for a bad bishop.",
        "11... Qxe7 12. Bxd7": "?",
        "12... Nbxd7": "I overlooked this recapture.",
        "13. Re1": "Now if 13...Nxe4 14.Nxe4 Qxe4 Qxd6 and white looks good.",
        "13... Rfe8 14. Bf4 Ne5 15. Nd5 Nxd5 16. Qxd5": "I captured with the queen to create more complications, which are favorable for me because I have more space.",
        "16... Rad8 17. Rad1 Qf6 18. Bg3 Re6": "? Not only does this drop a pawn, but it also just plainly loses time.  I think something like 18...Ng4 is better.",
        "19. f4": "! Thanks to Black's last move, this is quite strong.  The knight can't retreat to g6 because of the fork.",
        "19... Nd7 20. f5": "Attacking the misplaced rook while opening a line for the bishop.",
        "20... Re7": "? Much better was Re8, getting the rook off of the dark square.",
        "21. Qxd6 Qxd6": "? Black was lost anyway, but this just drops the exchange.  After 21...Re8 22. Qxf6 gxf6 23. Bh4, black's losing another pawn.",
        "22. Bxd6 Ree8": "Forced because black lacks space.",
        "23. Bc7": "! Attacking the rook that defends the knight.  Black loses the exchange and rightfully resigned here.  I hope you enjoyed this game.  BTW, as this is my second annotation and I'm not quite clear on some gameknot terms, how do I use/where do I find the star rating system?"
    },
    "url": "https://gameknot.com/annotation.pl/gameknot-blitz-http-gameknot-com?gm=45888",
    "gameName": "GameKnot Blitz, http://gameknot.com/",
    "players": "haile1996  vs. prabhumk ",
    "opening": "Philidor (C41), exchange variation"
}