{
    "moves": {
        "1. e4 c5": "Sicilian defence I like this opening",
        "2. Nf3 e6 3. Nc3 a6": "Maybe a wasted move, but I don't like White bishop on b5 when I play d6",
        "4. d4 cxd4 5. Nxd4 d6": "Here I'm already blocking b5.",
        "6. Bd3": "I think better move would be Bc4.",
        "6... Nc6 7. Be3": "I don't know why my opponent didn't castle.",
        "7... Nf6 8. f4": "I think this move was to early. I think that is better when doing this move after castling (my opinion).",
        "8... Qb6": "This move turned game into my advance. I'm attacking b2, and Knight on d4 whit my Q and Knight on c6.",
        "9. Be2": "Bad move. I think the best move would be 9. Nxc6 Qxc6 removing the danger on b2. Also 10. Nb5 is putting me in danger, if 10. ....axb5 11. Bxb5 pinning my Q whit King.",
        "9... Qxb2": "Now the Knight on c3 is lost. I think the best way of losing it would be 10. Na4 Qb4+ 11. ....Qxa4.",
        "10. Rb1 Qxc3+ 11. Kf1": "This is also bad move. Losing the rights to castle, and also losing Bishop on e2. The best move would be 11. Qd2 blocking the check and putting my Q in danger.",
        "11... Qxe3 12. Nxc6 Nxe4": "Now my opponent is in trouble. Only one move saves him from checkmate.",
        "13. Qd4": "This move.",
        "13... Nd2+": "I could exchange Q in this move and do this move one move later, but I didn't, because my opponent was making mistakes in this game, and I was hoping for another one :). 14. Qxd2 Qxd2.",
        "14. Ke1": "Well he didn't make another mistake :(",
        "14... Qxd4 15. Nxd4 Nxb1": "And now I think the game is over.",
        "16. Bd3 Nc3 17. a3 d5": "Opening the way for my black Bishop, and closing down the opponent white Bishop.",
        "18. Kf2 Bxa3 19. Re1": "And game is over."
    },
    "url": "https://gameknot.com/annotation.pl/gamerman003s-mini-tournament-i?gm=27935",
    "gameName": "gamerman003's mini-tournament I",
    "players": "demadone (1597) vs. stojanc (1297)",
    "opening": "Sicilian defence (B40)"
}