{
    "moves": {
        "1. e3": "I opened with e3",
        "1... e5": "book",
        "2. Qh5": "This was a Blitz game, I decided to break all the rules of chess and bring out my Queen to h4 to see how black would counter.",
        "2... d6": "Black stays book and ignores my Queen. ",
        "3. d4": "book",
        "3... exd4": "Black takes my pawn on d4.",
        "4. exd4": "I retake pawn on d4",
        "4... g6": "Black pawn to g6 attacking my queen.",
        "5. Qb5+": "I put black in check which can be easily played against in blacks favor.",
        "5... c6": "Black sends out a pawn to attack my queen.",
        "6. Qe2+": "This time I move to e2 and check black using what I will call my 2 out of 3 triangle check, Which again favors black in developing his pieces.",
        "6... Ne7": "Black develops his knight to e7 blocking the check at the expense of a pin. He could of done this also with his queen or his bishops. Black is leading this game so far!",
        "7. Nc3": "I develop Kc3. I still have a center pawn unprotected, a better move would of been Nf3. But I am most likely to castle queen side. I will have have to first move out my dsb.",
        "7... d5": "book",
        "8. Qe5": "Now that black moved a pawn left e5 open I move my queen there. The knight is still pinned and  lack can counter this move easy enough.",
        "8... Rg8": "Black moves his rook out of danger. I do think this was the best move for black.",
        "9. Bf4": "I send out my dsb. I will now be able to castle Queen side.",
        "9... Bg7": "Black brings out his dsb and is now attacking my queen!",
        "10. Qe3": "I retreat Lizzy (my Queen) to e3.",
        "10... Be6": "Black continues to develop bring out his lsb to e6",
        "11. Nf3": " keeping  up with blacks development with Nf3.",
        "11... Nf5": "Black sends out his knight to attack Lizzy.",
        "12. Qd2": "Lizzy moves to d2 away from blacks attacking Knight",
        "12... h6": "h6 pawn by black",
        "13. h4": "h4 by white",
        "13... Nd7": "Nd7 by black  more development.",
        "14. O-O-O": "White castles 0-0-0",
        "14... Qb6": "Black brings out Qb6",
        "15. Be2": "White brings out lsb to to e2 pairing up the rooks",
        "15... Nf6": "Blacks Knight moves to f6 behind the other black Knight on f5. Together the 2 knights can cover alot of space on the board and can be very strong together, In this location they control 11 spaces.",
        "16. Na4": "Na4 to attack Blacks Queen.",
        "16... Qc7": "?Queen moves to  c7 . This is going to be taken with whites dsb. Remember this is a blitz game.",
        "17. Bxc7": "I see the un-protected queen and take with my dsb Bxc7. Keeping in mind this was a blitz game, I take with caution neverless. ",
        "17... Ne4": "Black moves up his knight to outpost on e4 attacking Lizzy",
        "18. Qe1": "Lizzy moves out of harm to e1",
        "18... h5": "black pushes up the h pawn allowing a look to my king",
        "19. Kb1": "I move the king to b2",
        "19... b5": "pawn to b5 attacking white knight on the side at a4",
        "20. Nc3": "it was either here on c3 or c5 for retreating my knight ",
        "20... b4": "pawn attacks white knight",
        "21. Nxe4": "white knight takes black knight on e4",
        "21... dxe4": "pawn takes knight and attacks other white knight",
        "22. Ng5": "advancing knight to a safe home on g5",
        "22... a5": "black moves up pawn 2 spaces to a5",
        "23. Nxe6": "white knight takes lsb on e6",
        "23... fxe6": "pawn takes knight",
        "24. g4": "white moves pawn out 2 spaces attacking knight on f5, expecting pawn to take and retake with my lsb",
        "24... hxg4": "pawn takes pawn",
        "25. Bxg4": "lsb takes pawn on g4",
        "25... Bxd4": "dsb takes pawn on d4",
        "26. Bxf5": "lsb takes knight on f5",
        "26... exf5": "pawn takes lsb",
        "27. Rxd4": "rook take dsb on d4",
        "27... Rc8": "black moves rook to attack dsb on c7",
        "28. Bb6": "dsb moves to b6 and this is last move I make as resigns with very little time on the clock.  THE END"
    },
    "url": "https://gameknot.com/annotation.pl/gameknot-blitz-black-resigns?gm=49292",
    "gameName": "GameKnot Blitz, Black Resigns",
    "players": "redfox17 (1195) vs. Black (1315)",
    "opening": "Amsterdam attack (A00)"
}