{
    "moves": {
        "1. d4": "This was only a quick play game, but leads to an interesting king side attack.",
        "1... Nf6 2. c4 e6 3. Nc3 Bb4": "So it starts as a Nimzo-Indian Defence.",
        "4. e3 O-O 5. Bd3 c5 6. Nge2 d5 7. a3 Bxc3+ 8. bxc3": "This is all pretty standard.",
        "8... Na6": "But this is a bit unusual. As the knight doesn't have prospects of going to b4 or c5 it doesn't look like a good square to me.",
        "9. O-O": "I castle.",
        "9... b6": "He prepares to fianchetto his bishop.",
        "10. f3": "I prepare to advance in the centre.",
        "10... Bb7": "He completes the fianchetto and put another piece attacking e4.",
        "11. Ng3": "and I put another piece attacking e4 too.",
        "11... Qc7": "He develops the queen.",
        "12. Qe2": "With the threat of taking on d5 and then on a6.",
        "12... Nb8": "So his knight is more or less forced to retreat.",
        "13. cxd5": "I get rid of my doubled pawns.",
        "13... exd5": "He takes back.",
        "14. e4": "I advance in the centre.",
        "14... dxe4": "He takes.",
        "15. fxe4": "I take back.",
        "15... cxd4": "He takes again.",
        "16. cxd4": "I take back. We now have a classic position - white has the good pawn centre, but black is attacking it.",
        "16... Rd8": "Black attacks it again.",
        "17. Bb2": "I protect it again.",
        "17... Nc6": "He develops his knight - really he has lost 2 moves playing it to a6 and back.",
        "18. Rac1": "I pin his knight.",
        "18... Qd7": "So he breaks that pin.",
        "19. d5": "I attack the knight.",
        "19... Na5": "The knight runs. OK so what would you play now dear reader?",
        "20. Rxf6": "I was so proud of this exchange sacrifice at the time. Fritz tells me however, it was unnecessary and taking on f6 with the bishop is plus 12.94 to white, and second best move is Nf5. Fritz is wonderful at bringing you back to ground!",
        "20... gxf6": "The natural recapture, although Fritz doesn't think this is the best move.",
        "21. Bxf6": "This seems natural too, but Fritz prefers Nf5 or Nh5.",
        "21... Rdc8": "Moving his rook away from the attack and trying to exchange pieces down the c file. I don't think I would have taken the rook though - I think my bishop is better than a rook and should contribute to a winning attack. Fritz says whatever black does there is a forced mate from here.",
        "22. Qe3": "Again, a natural move, defending the rook and eyeing h6 but Fritz prefers Qh5, just allowing the rook to go, but mating. Nf5 is Fritz's second favourite move.",
        "22... Rxc1+": "He takes.",
        "23. Qxc1": "I take back.",
        "23... Qg4": "The best defence.",
        "24. Nf5": "Fritz says this is the best move. A knight fork on h6 is threatened, and if the black queen drops back to g6, there is another knight fork on e7.",
        "24... Qh5": "Fritz prefers Rc8.",
        "25. Qf4": "Fritz gives this as best move, and mate in 8.",
        "25... Re8": "Black is mated soon whatever he plays.",
        "26. Nh6+": "So I played this.",
        "26... Qxh6": "He took.",
        "27. Qxh6": "and with it being mate next move, he resigned. Many thanks for reading! Please rate the annotation on the star system and leave a comment or two to let me know how I am doing. Until next time dear reader!"
    },
    "url": "https://gameknot.com/annotation.pl/gameknot-quick-play?gm=62497",
    "gameName": "Gameknot Quick-play",
    "players": "Charles L Higgie (2064) vs. mrfuddington  (1926)",
    "opening": "Nimzo-Indian (E47), 4.e3 O-O, 5.Bd3"
}