{
    "moves": {
        "1. Nf3 Nf6": "I always mirror my opponent's nf3 with my nf6 and wait for white to decide the center.",
        "2. g3 g6": "I don't like to commit to g6 when white hasn't committed to a queen pawn opening, but I decide to mirror white to take them into less familiar territory.",
        "3. d4": "and that works out as g6 - bg6 is my main defense in the queens pawn game.",
        "3... d5 4. Bg2 Bg7 5. O-O O-O 6. c3 c6 7. Bf4 Bf5 8. Nh4 Nh5 9. Nxf5 Nxf4 10. Nxg7 Nxg2 11. Kxg2 Kxg7 12. Qc2 Qc7 13. Nd2 Nd7 14. e4 e5 15. exd5 exd4 16. dxc6": "and here, 16 automatic moves in, is the moment when I must stop copying to prevent hanging my queen.",
        "16... Ne5": "Not entirely sure why I choose this over bxc6, but I may of felt c6 was a dead cause and re positioning the knight would be a better option.",
        "17. cxd4 Ng4": "Down 2 pawns for the position of an odd placed 4th rank knight doesn't seem worth it.",
        "18. Rac1 Rac8 19. Nf3 Rfd8 20. h3 Nf6 21. Rfd1 Nd5 22. Ne5 Rd6 23. f4": "I didn't see the fork now available at e3.",
        "23... bxc6": "so I choose a lousy pawn.",
        "24. h4": "but white didn't see it either, so I got my second chance.",
        "24... Ne3+ 25. Kf3 Nxc2 26. Rxc2 Qa5 27. Rdc1 Qxa2 28. Ke3 Qxb2": "I panicked under the pressure and captured the pawn out of order.",
        "29. Rxb2": "Everything after this leads to a draw, but taught me that blunders occur in top levels just the same.",
        "29... f6 30. Rbc2 fxe5 31. dxe5 Re6 32. Ke4 Kf7 33. g4 Ke7 34. f5 gxf5+ 35. gxf5 Rh6 36. e6 Rxh4+ 37. Ke5 Ra4 38. Rc2xc6 Ra5+ 39. Kf4 Rxc6 40. Rxc6 Kf6 41. Rc7 Rxf5+ 42. Kg4 Kxe6 43. Rxa7 h5+ 44. Kh4 Kf6 45. Ra6+ Kg7 46. Ra7+ Kh6 47. Ra6+ Kh7 48. Ra7+ Kg8 49. Kg3 Kf8 50. Kh4 Ke8 51. Ra8+ Kd7 52. Rh8 Kc6 53. Rxh5 Rxh5+ 54. Kxh5": ""
    },
    "url": "https://gameknot.com/annotation.pl/gameknot-blitz-http-gameknot-com?gm=56256",
    "gameName": "GameKnot Blitz, http://gameknot.com/",
    "players": "brettbevans (2411) vs. porygon (1606)",
    "opening": "Reti (A05), King's Indian attack"
}