{
    "moves": {
        "1. d4 d5 2. c4 dxc4": "D20: Queen's Gambit Accepted\n\nPer chess365.com, following dxc4 (n=17441):\n\n1-0: 40.8%\n1/2-1/2: 34.9%\n0-1: 24.4%",
        "3. Nc3": "Per chess365.com, following Nc3 (n=1881):\n\n1-0: 46.6%\n1/2-1/2: 20.9%\n0-1: 32.5%\n\nMy thought was to prevent b5 so as to allow Bxc4 after e4.",
        "3... Nf6 4. e4": "Per chess365.com, following e4 (n=17441):\n\n1-0: 53.8%\n1/2-1/2: 18.3%\n0-1: 27.9%",
        "4... e6": "Per chess365.com, this move has only been played in one game:\n\nTan Wee Meng (1622) vs. Lai Yi Ming\nSingapore SJI CC-ch\nSingapore\n13 MAR 2003\nResult: 1-0\n",
        "5. Bxc4": "Same play as Tan Wee Meng.  This evens up the captured pawns at 1 each.",
        "5... Be7": "We are now out of book.",
        "6. Nge2": "Fritz recommends 6. Nf3 (0.94)\n\nI'm unsure why I chose Nge2 as this restricted the movement of my Queen and gave me less far-reaching control of the center squares.\n",
        "6... O-O 7. O-O": "Fritz recommends 7. 0-0 (0.31)",
        "7... Nc6 8. d5": "Fritz recommends 8. Bf4 (0.59)\n\nBf4 would have placed my bishop in a nice central location with protection from the knight on e2.  I liked the idea, however, of advancing a triple-protected pawn to d5.",
        "8... exd5 9. exd5": "Fritz recommends 9. Bxd5 (-0.12)\nSecond best move by Fritz is 9. Nxd5 (-0.43) with my choice coming in third 9. exd5 (-0.50)\n\nI agree with Fritz that Bxd5 would have been a good move.  I would then have a direct threat on my opponent's King, and the pawn on f7 would be pinned.",
        "9... Ne5 10. b3": "Fritz recommends 10. Bb3 (-0.45)\n\nI moved b3 to open up b2 for my bishop.  I'm not sure why Fritz panned the move.  Bb3 would put the bishop out of the reach of the knight on e5, but otherwise doesn't seem to accomplish much.",
        "10... c6 11. Bb2": "Fritz recommends 11. Bf4 (-0.19)\n\nBf4 still seems like a good move.  My thought was that by placing my bishop on b2 I could establish a long-term threat against the King's region of the board.",
        "11... Nxc4 12. bxc4": "Fritz recommends 12. bxc4 (-0.20)\n\nAn obligatory move.",
        "12... Bb4 13. Qd3": "Fritz recommends 13. Ng3 (0.01)\n\nNg3 would be nice because it would open the e file and move my knight more towards my opponent's King.  I'm not certain why I chose Qd3.  Qd4 may have been nice to place my queen on the same diagonal as the b2 bishop, for a coordinated attack.",
        "13... cxd5 14. Nxd5": "Fritz recommends 14. Nxd5 (0.16)\n\nObligatory to keep the count even.",
        "14... Nxd5 15. cxd5": "Fritz recommends 15. cxd5 (0.08)\n\nObligatory.",
        "15... Bd6 16. Rfe1": "Fritz recommends 16. Ng3 (0.44)\n16. Rfe1 (0.41) is rated second.\n\nThe idea is to get the rook to the open e file.  I planned for Ng3 later.",
        "16... b6 17. Ng3": "Fritz recommends 17. Qc3 (0.56)\n17. Ng3 (0.54) is rated as the second best move.\n\nQc3 would have placed the queen on the same diagonal as the b2 bishop, directly threatening checkmate at g7.  However, expecting my opponent would simply counter with 17 ... f6, I elected to clear the e file for my e1 rook.",
        "17... f6 18. Re2": "Fritz recommends 18. Rac1 (0.62)\n\nRac1 would have been nice because I would then dominate two files with my rooks.  Rac1 was part of a rather clumsy attempt to place two rooks on the same file.  It's a powerful result, but takes two turns to establish.",
        "18... a5 19. Qe4": "Fritz recommends 19. Ree1 (0.38)\n19. Qf3 (0.38) was rated second and 19. Re3 (0.27) was rated third.\n\nThis move was silly.  It invites f5 which means I will have to move my queen again, wasting more time.  I should have gone ahead with my plan, Rae1.  It's kind of embarrassing that Fritz is recommending I reverse my last move.",
        "19... f5 20. Qd4": "Fritz recommends 20. Qf3 (0.25)\n20. Qe3 (0.04) was rated second and 20. Qd4 (0.00) was rated third.\n\nI'm not sure what the advantage of Qf3 is.  Qd4 allows me to threaten checkmate and also forces my opponent to play 20 ... Rf7, tying up his rook protecting the g7 square.",
        "20... Rf7 21. Rae1": "Fritz recommends 21. Rae1 (0.88)\n\nFritz is finally on board with my plan to stack rooks on the e-file.",
        "21... Bd7 22. Nh5": "Fritz recommends 22. Nh5 (0.80)\n\nMy basic hope was to follow with 23. Nxg7 Rxg7 24. Qxg7#, or something along those lines.",
        "22... Qg5": "My opponent spoils my plans.",
        "23. Qxb6": "Fritz recommends 23. Nxg7 (0.81)\n23. Ng3 (-0.14) is rated second and 23. Qxb6 (-0.56) is rated third.\n\nI suspect Nxg7 would be followed by 23. ... Rxg7 24. Qxg7 Qxg7 25. Bxg7 Kxg7 26. Qxd6, which would have given me a 3 point advantage.  I wish I had tried that.",
        "23... Bxh2+ 24. Kxh2": "Fritz recommends 24. Kxh2 (0.70)\n\nObligatory.",
        "24... Qxh5+ 25. Kg1": "Fritz recommends 25. Kg1 (0.70) (the only other option, Kg3, would result in 25. ... f4#)",
        "25... f4 26. f3": "Fritz recommends 26. Re5 (0.93)\n26. Qb7 (0.10) is rated second and 26. Re7 (0.00) was rated third.\n\nI struggled a lot with this move and did consider Re5.  My concern was he would respond with 26. ... f3 which would put me in a difficult position.  27. gxf3 would make my king vulnerable and would invite 27. ... Rxf3.\n",
        "26... Qxd5 27. Qc7": "Fritz recommends 27. Re7 (-0.02)\n\nMy thought was to get two pieces controlling the 7-rank after 28. Re7.  ",
        "27... Bb5 28. Re2e7": "Fritz recommends 28. Re7 (0.11)\n\nI had little choice here as he was threatening my Queen with the rook on f7 and my rook with the bishop on b5.  ",
        "28... Qc6": "This was a curious move.  I think he would have been better off maintaining the queen's protection on his f7 rook.  ",
        "29. Rxf7": "Fritz recommends 29. Rxf7 (7.88)\n\nEven if he follows with 29. ... Qxc7, I should come out 1 rook ahead with 30. Rxc7.",
        "29... Qxc7 30. Rxc7": "Fritz recommends 29. Rxf7 (10.02)\n\nI am now + 4.",
        "30... g6 31. Ree7": "Fritz recommends 31. Ree7 (#8)\n\nMy bishop on b2 is finally paying off as it can be used to protect a rook on h8.",
        "31... h5 32. Reh7": "Fritz recommends 32. Rg7+ (#3) or 32. Rh7 (#3)\n\nSensing his imminent destruction with 33. ... Rh8#, my opponent resigns."
    },
    "url": "https://gameknot.com/annotation.pl/gameknot-match-001?gm=30081",
    "gameName": "Gameknot Match (001)",
    "players": "dconway (1398) vs. atsiv_swodniw (1494)",
    "opening": "Queen's gambit accepted (D20)"
}