{
    "moves": {
        "1. e4 c5 2. Nf3 Nc6 3. d3 e6 4. Be2": "I use this opening when I want to castle early in the game.",
        "4... Nf6 5. O-O b6 6. Nc3 Bb7 7. a3 a6 8. Bg5 h6 9. Bh4 g5 10. Bg3 Nh5 11. Ne5 Nxg3 12. Nxc6 Bxc6 13. fxg3 h5 14. Bxh5": "Woohoo!  Free pawn with a bonus threat on the f7 pawn!",
        "14... Qe7": "Black's not giving up the pawn without a fight.",
        "15. Qf3": "I still want that pawn so I bring another piece into the fray.",
        "15... Rh7 16. Nd1 O-O-O": "Black's king castles to safety but leaves the f7 pawn with one less support.",
        "17. Bxf7 g4": "Nice move.  If queen takes pawn on g4, white loses a bishop in the exchange.",
        "18. Qf4": "White queen advances one square to maintain support for the bishop on f7.",
        "18... e5": "Same pawn trick to distract the white queen.",
        "19. Qf5": "But now the white queen can advance one, pin the d7 pawn, and threaten the h7 rook.",
        "19... Rg7": "Best move.",
        "20. Ne3": "Time to move the knight into position to take the g4 pawn.",
        "20... Kb7": "Black must see the next target after g4 is e5 and moves the king aside so d7 pawn is no longer pinned and can move forward to support e5.",
        "21. Nxg4 d6 22. Ne3": "Since e5 is no longer a target of opportunity, the knight's next best move is towards d5.  The black king is hiding behind the bishop on c6.  If the knight moves to d5 and black captures it with the bishop, then the bishop on f7 can recapture d5, put the king in check, and expose the bishop on f8 to attack by the queen.",
        "22... Rd7 23. Nd5": "The knight moves to attack.",
        "23... Qd8": "Queen retreats to safety.",
        "24. Be6": "The rook on d7 is now facing a threat of attack on any square it can move to.",
        "24... Bxd5": "Sometimes the best defense is a good offense, but this move only opens up the black king to attack by the bishop.",
        "25. Bxd5+ Ka7": "King hides from the bishop, but an earlier move (26. B36) exposed the black's back row to the white queen.",
        "26. Qxf8": "Queen gets ready for final assault.  If black exchanges queens, then the white rook on f1 will get to black's back row and get the privilege of checkmating black's king.",
        "26... Qc7": "The black queen demurs and leaves the king exposed to checkmate.",
        "27. Qa8#": "And victory!"
    },
    "url": "https://gameknot.com/annotation.pl/gameknot-blitz-http-gameknot-com?gm=36349",
    "gameName": "GameKnot Blitz, http://gameknot.com/",
    "players": "rich_sposato  vs. choycemoon ",
    "opening": "Sicilian defence (B30)"
}