{
    "moves": {
        "1. e4 c5 2. Nf3 e6 3. d4 cxd4 4. Nxd4 a6 5. Nc3 Qc7 6. Be3 Nf6 7. Be2 Bb4 8. Qd3": "Sicilian Defense.. Black is in a good position!",
        "8... d5 9. exd5 Nxd5 10. Bd2": "Whenever you are ahead in initiative maintain it rather than losing it.. Exchange of pieces simplifies the position for white..",
        "10... Bxc3 11. Bxc3 Nxc3 12. Qxc3 Qxc3+ 13. bxc3 Bd7 14. Nf3 Nc6 15. O-O-O": "Now white looks ahead in development..",
        "15... Rd8 16. Rhe1 O-O 17. Bc4 b5 18. Bb3": "Idea is to exchange my bishop for his knight to free the doubled pawn structure.. ",
        "18... Na5 19. Kb2 Nxb3 20. cxb3": "As anticipated by white.. :) ",
        "20... Bc6": "Here i thought creating a passed pawn would give me an advantage since after exchanges white has good end game since he has queen side pawn majority.. secondly black also need to safe gaurd the back rank..",
        "21. c4": "Always move the pawn who has no opposing pawn in front of him..",
        "21... bxc4 22. bxc4 Ba4": "Now for the exchanges..",
        "23. Rxd8 Rxd8 24. Re2": "Plan executed well so far..",
        "24... Bd1": "Bd1?? Wrong move since Rd2 Rxd2 is forced since black has weak back rank ",
        "25. Rd2": "Straight away going for exchange..",
        "25... Rxd2+ 26. Nxd2 Kf8": "Trying to bring king to the center now next phase of plan for white.. Bring block Black Bishop's mobility",
        "27. f3": "f3! is excellent move since it traps the Black Bishop in White's Quadrant... Only escape is via a4.. which also would be sealed soon by Nb3..",
        "27... Ke7 28. Nb3": "Now where will the Bishop go..??",
        "28... Kd6 29. Kc3": "Battle of the kings",
        "29... e5": "e5 to stop Kd4",
        "30. Kb4": "White goes for a-pawn",
        "30... Kc6": "attempts to protect a-pawn",
        "31. Na5+": "Straight away pressure on black's King...",
        "31... Kb6 32. c5+": "c5+ Passer is on its way with a check! ",
        "32... Kc7 33. Nc4": "Nc4!  Black's Bishop is already half dead.. A Perfect example of Good Knight Vs Bad Bishop",
        "33... f6": "f6 forced since no other defense for e-pawn",
        "34. Nd6": "Nd6! Again a perfect move threatening Ne8+ with a fork on g-pawn and king..",
        "34... Kd7": "Stopping Ne8..",
        "35. Nf5 g6 36. Ne3": "Ne3! Save your Bishop.. Only move Be2 forced!",
        "36... Be2 37. Ng4": "Ng4! Again excellent Knight Maneuver attacking two pawns if one moves other falls.. Ke6 forced!",
        "37... Ke6": "Again King to the rescue! :P Now to show the power of passed pawn and a good positional advantage..",
        "38. c6": "c6! Excellent move in a perfect position..King has to stop this pawn or let his f-pawn fall..",
        "38... f5": "Attempt to save f-pawn.. ",
        "39. Nxe5": "Nxe5! Super blow white has a pawn advantage.. Nxe5 Kxe5 c7! and Black cannot stop c- passer (Nxe5 a5+ Kxa5) Again Bishop's passage to stop the advancing pawn is sealed by White's king in that case..  Black resigned from here.. Hope you Enjoyed! :) :)"
    },
    "url": "https://gameknot.com/annotation.pl/gameknot-blitz-http-gameknot-com?gm=47053",
    "gameName": "GameKnot Blitz, http://gameknot.com/",
    "players": "starlite551  vs. rocksteddy ",
    "opening": "Sicilian (B43), Kan, 5.Nc3"
}