{
    "moves": {
        "1. e4 e5 2. Nf3 Nf6 3. Bc4 Bc5": "No, I am not copying her moves. I am prodding her to see if I can achieve an imbalanced position.",
        "4. O-O": "The only way to keep the opening normal. Alternatives include 3. Bxf7+ Kxf7 4. Nxe5+ or 3. Nxe5. Castling consolidates the position and gives a cue that my opponent prefers development over deep calculations for an imbalanced position in the opening. Maybe that is reading too much into my opponent.",
        "4... d6": "A somewhat passive response, even though the bishop must be freed. Perhaps this also is reading too much into the developing position.",
        "5. c3 Bg4": "Leaving a hole on b7.",
        "6. Qb3": "Which she saw! ",
        "6... O-O": "I castled. The compensation I will gain from the queen taking the b pawn is sufficient for me to not feel completely uncomfortable being a pawn down. ",
        "7. Qxb7": "In taking this pawn she is up a pawn but I have the potential of doubling up pawns, snagging the e pawn should her queen need to move, and threatening the good bishop with an eventual Nb6. None of these are truly solid but the main advantage that is solid is her development is now lacking. ",
        "7... Nbd7": "All my minor pieces are out. Mission successful. ",
        "8. d3 Bxf3": "The purpose of this move goes beyond doubling pawns. I am eying her lonely king.",
        "9. gxf3 Nh5 10. Be3 Kh8": "Necessary to remove the pin on f7.",
        "11. Nd2 f5 12. Bxc5 Nxc5": "I am feeling pretty good about my position. My two knights are inching their way towards her kingside and my queen is ready to attack. Also, her queen is under attack and must retreat.",
        "13. Qc6 Qg5+ 14. Kh1 Qxd2": "14. ... Nf4 is a mistake after 15. Rg1",
        "15. Qxc7 Qf4": "My center is falling but the attack on the white king is far more valuable. f3 is the weakest point and not easily defended. ",
        "16. Rfg1": "? 16. Kg2 would have been a better choice in my opinion as it would invite perpetual check or a more stable position. However, in a blitz match I may miss Qxg7#",
        "16... Qxf3+": "Now the trouble brews.",
        "17. Rg2 fxe4": "Opening the f file. Not 17. ... Nf4?? 18. Qxg7#",
        "18. Bd5 Nxd3": "This is about more than snatching pawns, I am eying f2 which has no defender.",
        "19. Rf1 Ndf4": "Threatening Qxg2#",
        "20. Rfg1 Ne2": "Why settle for the exchange when one can pursue checkmate? 21. Bxa8 Nxg1 22. Kxg1 Qd1# or 22 . ... Nh3 threatening 23. ... Qd1+ 24. Rg1 Qxg1# or 23. ... Nxf2+ 24. Kg1 Qd1#. My main concern at this point is I have strong threats but no seemingly forced mate.",
        "21. Bb3": "Covering d1 and threatening Bd1. Also allowing her king to capture my knight should it take g1.",
        "21... Nxg1 22. Kxg1 e3": "Not 22. ... Nf4?? 23. Qxg7#. One must be careful when a single piece impedes checkmate.",
        "23. Qc4 exf2+": "I would like to point out that e2 is a stronger move as it immediately forces white to give up her queen. I felt like I was missing something here. This move works as well, it just takes a little longer to do the job.",
        "24. Kf1 Nf4": "Now it is safe to move the knight as Qxg7# is no longer possible!\n\n0-1 \n\n25. Rxf2 Qh1# or 25. Rg5 Qh3+ 26. Rg2 Qxg2# or 26. Kxf2 Nd3+ 27. Kg1 Qf1# or 27. Ke2 Rf2+ 28. Kd1 Qf1#. 25. Rg3 is the only option but that leaves the king bare to a discover attack after 25. ... Qh1+ 26. Kxf2."
    },
    "url": "https://gameknot.com/annotation.pl/gameknot-blitz-http-gameknot-com?gm=35804",
    "gameName": "GameKnot Blitz, http://gameknot.com/",
    "players": "supergir1  vs. coolistdude ",
    "opening": "Petrov (C42), Italian variation"
}