{
    "moves": {
        "1. e4 e5 2. f4 d5": "This is a response that I like as black. It seems to help black stay active and not be too passive in trying to hang onto an extra pawn.",
        "3. exd5 exf4 4. Nf3 Nf6 5. Bc4 Bd6": "I am not even bothering to take the extra pawn. This may or may not be a good idea as it could slow down my castling. ",
        "6. O-O O-O 7. d4": "White is attempting to stay active and keep a pawn majority in the center.",
        "7... Bg4 8. Qd3": "White immediately breaks my pin.",
        "8... Re8": "This prevents Ne5 with a crushing center.",
        "9. c3": "?! I do not like this move. It seems too passive.",
        "9... Nbd7": "White is at a bit of a standstill in development. I am not sure why he does not finish getting the minor pieces out.",
        "10. b4": "Although pushing the pawns can be a good idea, I still think white needs to get his minor pieces in the game. White's light bishop is passive and his knight could easily be captured and cease to exist.",
        "10... Nb6": "Seems to win a pawn.",
        "11. Bb5 Re7 12. h3 Bh5 13. Nh4": "I like this move. White is seeking to be aggressive to gain the initiative from his lost pawn. I do not like that his minor pieces are still on the back rank. One problem though is that it allows black to do Be2! gaining the exchange or a bishop. ",
        "13... Nbxd5": "However, I was too focused on the pawn to see that move and gave away the initiative. ",
        "14. Nf5": "Now it is too late for Be2 as white would simply capture the rook with check and take the bishop with the queen.",
        "14... Bg6": "?? Nxe7 is check. Fail on coolistdude's part.",
        "15. g4": "Fortunately, white did not see this. 15. ... fxg3 e.p. is an interesting continuation, although I think it gives better attacking chances for white.",
        "15... c6": "Still not seeing the check in Nxe7",
        "16. Bc4": "White hands the initiative back to me.",
        "16... Bxf5": "Exchanging that pesky knight...I should have done that earlier.",
        "17. gxf5 Ne3": "I am now eyeing his king as his pawns are no longer near him.",
        "18. Bxe3": "I don't like this move. I think it was better to move the rook and attempt to cope with the pesky knight until it could be more safely exchanged.",
        "18... Rxe3 19. Qc2": "The queen has next to no where to go.",
        "19... Rxh3 20. Nd2": "Natural. Finally white is fully developed.",
        "20... Bxb4": "!? I am attempting to get a shot at the king. The Bxc7+ counter attack line is interesting but ultimately unsuccessful. ",
        "21. cxb4 Qxd4+ 22. Kg2": "I suddenly spot a possible mating attack. Try to find it before moving on.",
        "22... f3+": "! Forcing either material loss or checkmate, depending on how white defends. The rook is invincible. ",
        "23. Kxh3": "?? White loses immediately due to a slightly pretty checkmate.",
        "23... Qg4+ 24. Kh2 Qg2#": "Thanks for looking at this game. Comments and ratings are appreciated."
    },
    "url": "https://gameknot.com/annotation.pl/gameknot-blitz-http-gameknot-com?gm=49447",
    "gameName": "GameKnot Blitz, http://gameknot.com/",
    "players": "jtoth  vs. coolistdude ",
    "opening": "KGD (C31), Falkbeer counter-gambit"
}