{
    "moves": {
        "1. d4 Nf6 2. c4 g6 3. Nc3 Bg7 4. Nf3 d6 5. e4 Bg4 6. Be2 O-O 7. Be3": "ultima jugada del libro\n",
        "7... Bxf3 8. Bxf3 Nbd7 9. O-O e5 10. d5 Nb6 11. Qe2 Rc8 12. Bg5 h6 13. Bh4 g5 14. Bg3 Qd7 15. h3 c6 16. Bg4": "Alternative variation: 16. dxc6 $5 bxc6 17. c5 dxc5 18. Bxe5 $16\n",
        "16... Nxg4 17. hxg4 Na4": "Alternative variation: 17... cxd5 [sería un desahogo] 18. cxd5 Rc4 $14\n",
        "18. Nxa4 cxd5 19. Nb6": "Alternative variation: 19. Nc3 [y el resultado es claro: el Blanco ganará] dxc4 20. Nd5 $18 [mdlc: Había visto esta variante, pero no sabía como continuar, y tenía miedo del peón en c4.  En realidad el plan ganador sería atacar el peon en c4. Si las negras utilizan un cadena de peones para defender c4. Las blancas deben atacar la base de cadena negra, y finalmente atacar el peón en d6.]\n",
        "19... axb6 20. cxd5": "mdlc. Mi evaluación en esta posición era:  El negro tiene el alfil negro que no tiene juego y lo obstruyen sus propios peones. En cambio las blancas,  pueden movilizar el alfil a f2 y atacar los peones doblados y el peón débil en d6.  La dificultad de las blancas se debe a que no tienen el dominio de la columna c, y esperaba lentamente que en el juego las blancas llegara a dominarla. Intuía que mi rival era más táctico que posicional.\n",
        "20... Qa4 21. b3 Qd4 22. Rac1 Rc3 23. Rfd1 Qc5 24. Rxc3 Qxc3 25. f3 Rc8 26. Bf2 Qc2 27. Rd2 Qb1+ 28. Kh2 Rc1 29. Bxb6 Rh1+ 30. Kg3": "mdlc. El jugador de las negras le suena el cuelular. El árbitro da como ganador a las blancas\n"
    },
    "url": "https://gameknot.com/annotation.pl/ganando-por-secretar-a-2-ronda-semifinal-de-campeonato-de-chile-2011-vi-a-del-mar-chile?gm=36837",
    "gameName": "Ganando por secretaría...2 Ronda. Semifinal de campeonato de chile 2011, Viña del Mar, Chile",
    "players": "Mario de la Cuadra (1727) vs. Jaime San Carlos, (sub-12) (1305)",
    "opening": "King's Indian (E61), Smyslov system"
}