{
    "moves": {
        "1. e4 c5 2. Nc3 Nc6 3. f4 g6 4. Nf3 Bg7 5. Bc4 d6 6. O-O Bg4 7. Qe1 Bxf3": "Black seeks to gain a rook after 8. Rxf3 Nd4, 9.  R moves Nxc2",
        "8. Rxf3 Nd4 9. Bb5+": "Black's best move here may be 9...Nxb5, as after 10. Nxb5 Nf6 Black has an edge in position and development with forces even. However, Black persists in his plan to grab a Rook.",
        "9... Kf8 10. Rf1 Nxc2 11. Qd1 Nxa1 12. b3": "Black can stay ahead with either 12... Nxb3 o 12... Bxc3.",
        "12... Nf6": "The N gets in the game, but Black can no longer castle and the Black King is cramped.",
        "13. Bb2 Nxe4": "Opening the a1-h8 diagonal is a two edged sword...",
        "14. Qxa1": "Aligning the Q and B on the long diagonal.",
        "14... Nxd2": "Black seeks more material gain.",
        "15. Nd5": "Opening the diagonal and threatening a strong counter-attack. If 15...Bxb2 16. Qxb2, white closes the material gap by picking up the N (as 16...Nxf1, 17. Qxh8++ is ruinous. That is probably Black's best move here as it leaves him a two pawn advantage and time to mobilize. But Black plays for the Rook. 15...d5 or 15...f6 are also acceptable but not as strong.",
        "15... Nxf1": "?? Not regarding the consequences of 16. BxB+",
        "16. Bxg7+": "The beginning of the end for Black as White now regains material and makes serious threats.",
        "16... Kg8": "Forced.",
        "17. Bxh8": "Now what does Black do? \n17...Qf8 18. Nxe7 Qxe7 19. Qg7++\n17. Kf8 Qg7++\n17. e5 or f6 Nxf6 leads to several lines, none of which favor Black",
        "17... Ne3": "?? Perhaps Black chose suicide after realizing his dilemma.\nOr perhaps he merely overlooked the coup de grace.",
        "18. Qg7#": ""
    },
    "url": "https://gameknot.com/annotation.pl/gator-knights-2013-team-tournament?gm=48835",
    "gameName": "Gator Knights 2013 Team Tournament",
    "players": "major (1537) vs. diosynus (1457)",
    "opening": "Sicilian (B23), Grand Prix attack, Schofman variation"
}