{
    "moves": {
        "1. e4 c5 2. Nf3 Nc6": "Playing the Sicilian",
        "3. d4 cxd4 4. Nxd4 e5 5. Nb5 a6 6. Nd6+ Bxd6 7. Qxd6 Nge7": "At the time I liked this move but now I think I like a queen move better.",
        "8. Bc4 O-O 9. Nc3 b5 10. Bd5": "Thought about developing queen to b6 or bishop to b7 but didn´t like his bishop having an outpost so I decided to trade instead.",
        "10... Nxd5 11. Nxd5 Re8 12. O-O Re6": "Don´t like the pressure of his queen so making him back off.",
        "13. Qa3 Bb7 14. Bd2 Nd4 15. Qd3 Bxd5": "Once again removing a piece that has an outpost on that square. However I think this was not the best move because after capturing with pawn and forcing my rook to move I have no squares for my knight after pawn to c3.",
        "16. exd5 Rg6": "Wanted to put some pressure on his king.",
        "17. Rae1 Qf6": "I needed to protect pawn and allow knight to have an escape square after c3. This becomes a problem later being on the same file as rook.",
        "18. f3 Nf5": "didn´t feel my knight was safe on the other square and wanted to relocate it as soon as possible.",
        "19. Bc3 d6 20. f4": "After studying this position for a long time I felt like his attack was too strong and I was going to lose unless I slowed it down. My pieces were in really bad positions. I felt the following move a rook sacrifice was needed to save the game.",
        "20... Rxg2+ 21. Kxg2 Qg6+": "moving queen out of bishop pin with tempo.",
        "22. Kf2 exf4 23. Rfg1 Qh5 24. Rg2 g6": "needed to block either rook or bishop and felt this move was the better move as it also stops a future threat of rook to g1.",
        "25. Bd2 Nh4": "Attacking rook in order to save pawn.",
        "26. Rgg1 f3 27. Rg5 Qh6": "I realize he may have thoughts of a discovered threat but don´t see him having anything immediately and this move was practically forced.",
        "28. Re7 Kf8": "I moved my king to unpin my pawn and attack his rook at the same time.",
        "29. Qe4 Nf5": "Realize he blundered and acted on it.",
        "30. Rxf7+ Kxf7 31. Qe6+": "in order to avoid losing queen to rook f5 I did not go to f8 but rather g7",
        "31... Kg7 32. Qxf5 Qxh2+": "At this point I realize I have won the game.",
        "33. Ke3 Qe2+ 34. Kd4 Qxd2+ 35. Qd3": "Here I had two options trade queens in order to avoid any chances of a draw knowing I had a winning position with my three passed pawns or go up a rook. I felt the queen trade was a simpler win though I believe I would have won taking the rook as well.",
        "35... Qxd3+ 36. Kxd3 Rf8 37. Rg1 f2 38. Rf1 h5 39. Ke2 h4 40. Rxf2 Rxf2+ 41. Kxf2 Kf6 42. b3": "easy endgame win from here since my passed pawns can´t be stopped and king can´t even take a pawn without me queening the other passed pawn. So I just go straight to the side he has more pawns to create a threat on that side of the board as well winning the game.",
        "42... Ke5 43. c4": "The only thing I needed to be careful about was capturing correctly so that he doesn´t create a passed pawn that my king can´t stop.",
        "43... Kd4 44. Kg2 bxc4 45. bxc4 Kxc4 46. Kh3 g5 47. Kg4 Kxd5": "And here he resigns realizing he can´t stop  threats from both sides of the board neither capture the g5 pawn or lose to h pawn queening."
    },
    "url": "https://gameknot.com/annotation.pl/gdhamils-captains-table-i?gm=60126",
    "gameName": "gdhamil's Captain's table I",
    "players": "rjacobs (1523) vs. whocaresulost (1859)",
    "opening": "Sicilian (B32), Labourdonnais-Loewenthal (Kalashnikov) variation"
}