{
    "moves": {
        "1. e4 c5 2. Nf3 d6 3. d4 cxd4 4. Nxd4 Nf6 5. Nc3 a6 6. Bg5 e6 7. f4 Nbd7": "This variation of the Najdorf was first developed by Polugaevsky in the 60s and refined by Gelfand in recent times. It's actually a more solid line than the totally unclear main lines arising after 7...Be7. The positions also get chaotic after 7...Nbd7, but somehow they tend to end up in draws.",
        "8. Qf3 Qc7 9. O-O-O b5": "The point of the variation. Black gets in b5 one move earlier without Be7. 7...b5 (the infamous Polugaevsky variation) is also playable, but that's another story.",
        "10. Bxb5": "10.Bd3 is the main line. Anand beat Shirov brilliantly with black in Morelia this year in that line. White has other moves as well, such as e5.",
        "10... axb5 11. Ndxb5 Qb8 12. e5 Ra5": "Armed with my opening database I felt comfortable in this variation, as you do need to remember a lot of theory. During the game I was wondering why black could not simply play Bb7. After the game I found out that this move had already been employed by none other than Gelfand against Naiditsch in 2006. That game went 12...Bb7 13.Qe2 fxe5 14.Qc4! and ended with a draw after some complications. I think Bb7 is a better choice if you want to try to win as black, but Ra5 is safe enough if you're happy with a draw.",
        "13. exf6 gxf6 14. Bh6": "!  White has j ust gotten his piece back, but now he sacrifices it again! This is all theory, of course.",
        "14... Bxh6 15. Nxd6+ Ke7 16. Kb1": "Necessary, as 16.Rhe1 would run into 16...Ne5!",
        "16... Rd8 17. g3": "?  These positions do not forgive any waste of time. 17.Rhe1 is the correct move, when white has enough resources for a draw, but nothing more, like in Lutz - Gelfand, 2002.",
        "17... Nb6 18. Nxc8+": "This is helping black. 18.Ncb5 was to be preferred, but now black has the extra resource 18...Nd5, since there is no rook on e1.",
        "18... Rxc8": "The first move in the game I really had to think about, as I was now \"out of book\", but the rook capture is quite natural, as now black - and not white - gets a strong attack.",
        "19. Rhe1": "Loses by force, but with a piece up and a strong attack, black was winning anyway. Notice that white's g3 move does not bury the black bishop. Black could play f5 and it would find a home in the long diagonal.",
        "19... Nc4 20. b3 Na3+": "It was tempting to play Qb4 instead, but it doesn't really create any new threats, since on Qa3 white would turn the tables with Qb7 . After a while I realized that this idea with the knight sacrifice was just winning by force.",
        "21. Kc1": "Other king moves lead to the same result.",
        "21... Nxc2": "!",
        "22. Kxc2 Rxa2+ 23. Kd3 Qxb3": "23...Rd8  24.Nd5  Kf8 was also winning, but now white gets mated in the middle of the board.",
        "24. Rdc1 Rd8+ 25. Ke4 f5+ 26. Ke3": "26.Ke5 and the bishop finally enters the game with decisive result. :-)",
        "26... Qb6#": ""
    },
    "url": "https://gameknot.com/annotation.pl/gelfands-system-in-the-classical-najdorf?gm=14676",
    "gameName": "Gelfand's system in the classical Najdorf",
    "players": "pahtz (1753) vs. icehawk (1686)",
    "opening": "Sicilian (B96), Najdorf, 7.f4"
}