{
    "moves": {
        "1. e4": "Round three from the recent Gem City Open in Dayton, OH. If you enjoy the game please rate or comment! :)",
        "1... c6": "I've never played against the Caro-Kann OTB in a classical time  control (that being said I'm not sure I've EVER played against it OTB), but I  have some experience online against it. In this game I play the line I  usually go with, an \"Anti-Caro-Kann\" system.\n",
        "2. c4": "Contesting control of d5  early.\n",
        "2... d5": "This is dubbed the \"Anti-anti-Caro-Kann\" in my database.  Certainly the most straightforward move, especially for the 1...c6 player.\nAlternative variation: 2. ... e5 [Possibly another try for Black, but gives up the fight for d5.]  3. Nf3 (3. Nc3 [This is not as popular due to] Bb4 ) d6 4. d4 Nd7 5. Nc3 Ngf6  6. Be2 Be7 7. O-O O-O 8. Be3 [And it seems that White is a bit happier out of  the opening.] \n",
        "3. exd5 cxd5 4. d4": "The point of taking first with the e-pawn  is that you can now choose between 4.cd5 (in which case 3. cd5 cd5 4.ed5  would be a transposition) or this move. Both are perfectly playable.\n",
        "4... Nf6 5. Nc3 Nc6 6. cxd5": "A lesser played variation, but I was looking for the a2-g8  diagonal to develop my LSB.\nAlternative variation: 6. Nf3 Be6 7. c5 \nAlternative variation: 6. Bg5 e6 7. Nf3 [The two  main options for White typically.] \n",
        "6... Nxd5 7. Bc4 Nxc3": "I don't think this can  be the best response from black. Helps White hold the d4-pawn and gives him  the half open b-file, whereas Black has to develop his DSB before he can take  advantage of the half-open c-file.\nAlternative variation: 7. ... e6 8. Nf3 Be7 9. O-O O-O 10. Re1  a6 [Maybe a better try for Black] \n",
        "8. bxc3 e6 9. Nf3 Be7 10. O-O O-O 11. Bf4 a6 12. Re1": "Just completing development from both sides.\nAlternative variation: 12. a4 [This gets  played much later in the game, but is probably beneficial now to stop the  b5-pawn advance, at least for the time being.] \n",
        "12... b5": "I wasn't too worried  about this during the game, since it seemed like it was time to reposition my  bishop anyway, but perhaps the variation with 12. a4 is better to at least  put a hamper in Black's plans for a moment.\n",
        "13. Bd3 Bb7 14. Be4": "His bishop  it too dangerous on this diagonal and mine is very inactive so I wanted to  see if I could force a trade.\n",
        "14... Bf6": "Alternative variation: 14. ... f5 [Doesn't work since it drops  the e-pawn, but maybe an interesting gambit for initiative for the  adventerous player.] 15. Bxc6 Bxc6 16. Rxe6 Be4 [The rook seems a bit  misplaced now but it seems like white can hold with a well timed a4.] 17. a4  [Free the queenside and allow the rook space to come off e6.] (17. d5 Bxd5  18. Rd6 Bxd6 19. Qxd5+ Kh8 20. Bxd6 [The engine likes this line but not one I  would probably play.] ) \n",
        "15. Qd2 Qc8 16. Rac1": "Perhaps the other rook is  better, since it gives opportunities to play a4 still. But I was worried  about the bishop eying a1 and thought this was the time to move it anyway,\n",
        "16... Na5": "A nice move I hadn't seen, the c4 post is just screaming for a knight.\n",
        "17. Bxb7 Qxb7 18. Ne5": "Trying to keep that knight out of c4\n",
        "18... Rac8 19. Nd3": "Now looking for my own post on c5\n",
        "19... Nc4 20. Nc5": "Played right away, but this  is a huge blunder. I saw it just as I released the knight, but somehow my  opponent overlooked it!\n",
        "20... Qc6": "Misses the killer!\nAlternative variation: 20. ... Rxc5 [A free  knight for Black!] 21. Qc2 (21. dxc5 Nxd2 22. Bxd2 Qd5 23. Be3 Qxa2 [White  doesn't have nearly enough] ) Rf5 \n",
        "21. Qc2": "Lucky for me, I don't think  twice about moving my queen.\n",
        "21... g6 22. Qe4": "My position is starting to feel a  little cramped, and my c5 post is not quite as nice as black's c4. I try to  relieve some pressure by trading queens.\n",
        "22... Rfd8 23. Qxc6 Rxc6 24. Ne4 Be7 25. Nd2": "Hoping to trade the knights off, but I missed Black's nice manuever.\nAlternative variation: 25. Bg5 [A move I thought about, but White's knight ends up away from the  real fight and Black's knight is just too strong.] Bxg5 26. Nxg5 Nb2 27. Rc2  Nd3 28. Rd1 Nb4 29. Rb2 Nd5 [The knight has found and even better post.] \nAlternative variation: 25. Rc2 [Probably better to keep the knight out of b2] \n",
        "25... Nb2 26. Nf3": "Pratically forced because of what comes next\n",
        "26... Nd3 27. Ne5 Nxe5 28. Rxe5": "Loses a pawn it seems...\nAlternative variation: 28. Bxe5 Ba3 29. Rc2 Rdc8 30. Re3 Bb4 [Ends up  losing a pawn as well, so possibly 28. Rxe5 is better after all, since only  one rook is left on the board.] \n",
        "28... Bd6 29. Bg5 Bxe5 30. Bxd8 Bxd4 31. Ba5": "Now  my task is to draw. There is not too much room for Black's rook, so if I can  try to keep it that way I may have a shot\n",
        "31... Bf6 32. Kf1": "Bring the King to the  fight!\n",
        "32... Rc4 33. Bb4 h5 34. Ke2 Kg7 35. Kd3 Bd8 36. a4": "The right move for  White here, get rid of those pesky pawns together over there, and can  possibly win one back if Black misplays\n",
        "36... Bb6 37. axb5 axb5 38. Rc2": "The right  way it seems for Black, but now I feel more confident that I can draw,  especially if I can get the rooks off the board\n",
        "38... Bc5 39. Ba5": "I want to keep  my Bishop, and ideally end with just the bishops on the board\n",
        "39... Rf4 40. f3 Rf5": "Keeping the Rook with not too many open ranks and files, diminishing it's  power\n",
        "41. Rb2 Rd5+ 42. Ke2": "King can't stray too far from these pawns. My  idea already is that once the rooks come off, I Blockade one pawn with my  bishop, put my pawns on light squares, and then use my king to keep his king  out of the position.\n",
        "42... Be7 43. Rd2 Re5+ 44. Kd3 Rf5 45. Re2 g5 46. Bb6 Rd5+ 47. Kc2 Bc5 48. Bc7 Kf6 49. h3 Kf5": "Suddenly I can force the rooks off!\n",
        "50. Rd2": "! I deceide to just get the rooks off first and then worry about the  kingside later\nAlternative variation: 50. g4+ [I thought about this move first, possibly it's  better to push the king back and then trade, gaining some space] hxg4 51.  hxg4+ Kf6 52. Rd2 Rxd2+ 53. Kxd2 Kg6 54. Kd3 b4 55. cxb4 Bxb4 56. Ke4 Bc3  [Now it certainly seems easy enough.] \n",
        "50... g4 51. Rxd5+ exd5 52. Kd3 gxf3 53. gxf3 Kg5 54. Bg3": "Keep that pesky king out\n",
        "54... Kf5 55. h4": "Now the king can't  get in the kingside :)\n",
        "55... Ke6 56. Ke2": "Now my plan is to basically shuffle my  pieces around and keep the king out until black gives up. I offered two draws  during the game, one I believe shortly after the rooks came off and one a few  moves down the line from here, both of which Black turned down. He finally  offered on the 68th move and I accepted (even though he was down to 5 minutes  at that point and I did feel like seeing if he would make a mistake in time  pressure, I did the sporting thing)\n",
        "56... b4": "Can only imagine this helps my task,  now only one pawn to worry about on the queenside. IF you're going to try  this, it seems that d4 must be better.\nAlternative variation: 56. ... d4 [This pawn may win, as  now the b-pawn is much farther away from the kingside pawns.] 57. Kd3 (57.  cxd4 Bxd4 58. Kd3 Be5 59. Be1 Kf5 60. Ke3 Bd6 61. Kd4 Kf4 62. Kd5 Be7 ) dxc3  58. Kxc3 Bd6 59. Be1 Kf5 [And White seems too stretched] \n",
        "57. cxb4 Bxb4 58. Kd3": "Now the king can stop the d-pawn while also helping to stop the Black  king entering into the camp.\n",
        "58... Bc5 59. Ke2 f5 60. Bf4 Bd6 61. Bg5": "Another  misplay\nAlternative variation: 61. Be3 [Should play back so I have access to both f2 if he attacks  via e7 or g5 if he tries g3.] Bg3 62. Bg5 d4 63. Kd3 Kd5 64. Bd8 Ke5 65. Ke2  [Similar the the game line.] \n",
        "61... d4": "But again Black misses it so I fight on\nAlternative variation: 61. ... Be7 62. Bxe7 Kxe7 63. Ke3 Kd6 64. Kd4 Ke6 65. Ke3 [The longer try,  but Black still gets in] (65. f4 Kd6 66. Kc3 Kc5 67. Kd3 d4 ) Ke5 66. f4+ Ke6  67. Kd3 Kd7 68. Kc3 Kc6 69. Kb4 (69. Kd4 Kd6 ) Kb6 70. Kc3 Kc5 71. Kd3 d4 \n",
        "62. Kd3 Kd5 63. Bd2": "Now I can always guard the pawn from the opposite side  he attacks on, and d4 has become a weakness his king needs to defend! It  helps that h1 is a light square if need be.\n",
        "63... Bg3 64. Bg5 Ke5 65. Ke2 Bf4 66. Bd8 Be3 67. Be7": "One nice little trap in the endgame if he is thinking about  trying to bring his king over the the h-pawn via f4.\n",
        "67... Kd5": "Alternative variation: 67. ... Kf4 68.  Bd6# [Would have been quite the shock for my opponent I'm sure, but he  spotted it.] \n",
        "68. Kd3": "And he offered a draw which I accepted, even though I  had 41 minutes to his 5.\n"
    },
    "url": "https://gameknot.com/annotation.pl/gem-city-open-dayton-oh?gm=50500",
    "gameName": "Gem City Open, Dayton, OH",
    "players": "MWebber (1757) vs. WilliamFranklin (1609)",
    "opening": "Caro-Kann (B10), anti-anti-Caro-Kann defence"
}