{
    "moves": {
        "1. c4": "Wildrook28 is a good friend of mine and in the unranked games we have played with each other this opening seems to be the most successful for me against him.",
        "1... e5 2. b3 Nf6 3. Bb2": "This is the second time I have ever played this opening, the previous against wildrook28 himself.",
        "3... Nc6 4. Nf3 e4 5. Nd4 Bc5 6. e3 O-O 7. f4": "Was hoping for the en poissant as I have been punished quite a few times in previous games against wildrook28 by his pushed pawns.",
        "7... exf3 e.p.": "To my delight he takes.",
        "8. Qxf3 Nb4 9. Nc3 Qe7 10. Qg3 d6 11. Bd3": "The major blunder that put me on the back foot and lost both bishops with no gain!",
        "11... Nxd3+ 12. Kf1 Nxb2 13. Ke2 Bg4+ 14. Kf2 Nd3+ 15. Kf1": "Was in real need of some breathing space!",
        "15... Ne4": "This move allowed me to have that taking out an attacker in the lsb",
        "16. Qxg4 Nxd2+ 17. Ke2 Ne5 18. Qg3 Ndxc4 19. Nf5 Qf6 20. Nd5": "Offering him a free knight!",
        "20... Qxf5 21. Ne7+": "BOOM!",
        "21... Kh8 22. Nxf5 g6 23. Ne7 Rae8 24. Nd5 c6 25. Nf6 Re6 26. Qh4": "Threatening mate and also protecting the knight.",
        "26... h5 27. bxc4 Kg7 28. Ne4 b6 29. Ng5 Ree8 30. Ne4 Nxc4 31. Nxc5": "Trading off material",
        "31... dxc5 32. Rhf1 Rxe3+ 33. Kf2 b5 34. Rac1 Rfe8 35. Rxc4": "Making the sac to get rid of his knight and disrupting his pawn push.",
        "35... bxc4 36. Qxc4 Re8e5 37. Qa6 f5 38. Qxa7+": "I know I needed to take his pawns on the left side of the board otherwise I would have regretted it.",
        "38... Kh6 39. a4 Re3e2+ 40. Kg1 Re5e4 41. a5 Ra4 42. Qxc5 Raa2": "Under a mate threat with both rooks on my second rank.",
        "43. Qf8+ Kg5 44. Rf3 Rexg2+ 45. Kf1 Kg4 46. Rg3+ Rxg3 47. Qb4+ f4 48. hxg3 h4": "The move that lost the game for him.",
        "49. Qxf4+ Kh3 50. Qxh4#": ""
    },
    "url": "https://gameknot.com/annotation.pl/georgeo1991s-mini-tournament-ii?gm=40338",
    "gameName": "georgeo1991's mini-tournament II",
    "players": "georgeo1991 (1230) vs. wildrook28 (1226)",
    "opening": "English opening (A20)"
}