{
    "moves": {
        "1. d4 Nf6": "Team match, I'm playing black. I play the Indian Defense to white's 1. d4.",
        "2. c4 e6 3. Nc3 Bb4": "White is trying to control d5, black's response is the Nimzo-Indian Defense, pinning the knight and trying to regain control of d5.",
        "4. Bd2 O-O": "According to Wikipedia, 4. Bd2 is one of white's least acceptable moves, barely getting any mention at all: \"4. Bd2, unpinning the knight, is a move which is common among amateurs who have no theoretical knowledge when they face the Nimzo-Indian. Although the move is not a bad one, it is unambitious. The strategic aim of obtaining the bishop pair without conceding the doubled pawns fails, for after e.g. 4...Bxc3 5.Bxc3 Ne4, White does not get to keep both bishops, and fair trades are usually not in White's interests since White has an advantage in space.\" 4. e3, 4. Qc2, 4. Nf3, 4. f3, 4. Bg5, and 4. a3 all get more analysis than 4. Bd2.",
        "5. Nf3 d5": "Out of my limited reference, I'm winging it now, with naught but the GK DB as a guide.",
        "6. e3 c5 7. Be2 Nc6": "White is trying to castle and black is trying to win material.",
        "8. O-O dxc4 9. Bxc4 cxd4 10. Nxd4 Nxd4 11. exd4 Qxd4": "Both players accomplished their goals, white is castled and black is up by a pawn.",
        "12. Qb3 Qxd2 13. Qxb4 Qg5": "Designs on white's castle, particularly g2.",
        "14. Rad1 e5": "Opens the bishop's diagonal to h3.",
        "15. Nd5 Nxd5 16. Bxd5 Rd8": "Black had been aiming for 16. ... Bh3 but now the white bishop on d5 defends the g2 square. Black's 16. ... Rd8 is an attempt to drive it off, but not a very well thought out attempt; white has a simple and obvious reply that invalidates black's move.",
        "17. Qb3 Rf8": "And now black has wasted two tempi for nothing. White's queen defends h3 now, too.",
        "18. Rdc1 Qe7": "White wants to play 18. Bxb7 to win a pawn and equalize the material. Black should not reply 18. ... Bxb7, 19. Qxb7 and allow white to equalize. Instead, black could play 18. ... Rb1, pinning the white bishop to his queen and winning a bishop for a pawn. Thus, white's 18. Rc1, intending 19. Rc7, putting a third attacker on the pinned black pawn at b7. Black's 18. ... Qe7 keeps the white rook off the 7th rank and further supports f7, allowing the black rook at f8 freedom to roam if needed.",
        "19. Rc3 Bf5": "White is planning to double his rooks on the open c-file and invade on c7 as previously described. This was probably not black's best option, abandoning the pawn at b7 to die for nothing. Maybe 19. ... Rb8 would have been better. At this point, black is behind in development, enough so that I'm not sure he can hold onto his extra pawn no matter what he tries here.",
        "20. Rfc1 Rac8": "Again denying white easy access to the 7th rank and contesting the open c-file.",
        "21. Qxb7 Qxb7 22. Bxb7 Rxc3 23. Rxc3 Rb8": "After the dust settles, black tries to pin the white bishop, hoping to play 24. ... Rxb2 if the bishop flees, but not really expecting to get the opportunity.",
        "24. Rc7 Be6": "Now black wants to chase the white rook away with his king, but once the black king reaches d8, white would play Rxf7, so first the bishop moves to protect f7 while simultaneously threatening a2.",
        "25. b3 Rd8": "Change of plans. Threaten checkmate in order to get my own rook on the 7th (2nd rank, but it's black's 7th rank).",
        "26. Rc1 Rd2": "26. Rc1? may have been the beginning of white's undoing here. 26. Bf3 or 26. Kf1 look much stronger, leaving white's rook on the 7th where it would do some good. Maybe white was planning ahead to a draw and decided to play ultra conservatively.",
        "27. Ra1 f5": "White has driven his own rook back home to a1, trapped in the corner behind his pawns and no longer a threat to black. White cannot even play his pawn to a3 to unburden his rook of the defense for then black plays Bxb3. Nor can he advance the b-pawn or black will play Bxa2 or Rxa2. On the other hand, the black rook is standing tall in the white camp, eager to trample any and all pawns that should come his way. Black decides it's time to put his kingside pawn majority to work on the black castle.",
        "28. g3 Kf7": "With the help of the king.",
        "29. Kg2 e4 30. Kg1 Kf6 31. Ba6 Ke5": "Black's king is getting active. With the white rook trapped in the corner, it's almost as if white has a material advantage here: Rook+Bishop+4 pawns vs. Bishop + 3 pawns.",
        "32. Bb5 g5 33. Ba4 Bd5": "White is finally in a position to free his rook, but at the cost of tying his bishop down to defense instead.",
        "34. a3 f4": "The black pawns are looming large.",
        "35. b4 e3": "And now white has finally freed both his bishop and his rook from defending his queenside, but it took 8 moves to do it (since 27. Ra1?) and now it's too late. The black pawns have invaded the white kingside and white's two defenders are still way over on the queenside. This is my second game this week decided by a pawn avalanche (the concerted advance of multiple pawns against a castled king). I'm beginning to get the hang of the power behind this tactic.",
        "36. Re1 Rxf2": "White tried for an irritating pin, preventing 36. ... exf2, but he overlooked black's powerful response.",
        "37. gxf4+ gxf4": "And now black has two passed pawns, supporting each other, and well advanced toward their promotion.",
        "38. Bb5 Rg2+": "Just need a little maneuvering here. It's time for white's rook to go away.",
        "39. Kf1 Rxh2": "Black doesn't really want this pawn. It's harmless. But black really wants to play Rh1 and the pawn was in the way. White is already out of options. 40. Kg1??? and 40. Re2??? and 40. Be2??? all lose instantly to 40. ... Rh1#. 40. Rc1, 40. Rb1, and 40. Ra1 lose the rook to 40. ... Rh1. And 40. Rd1 or any other pawn or bishop move are met with the actual continuation as played in the game.",
        "40. a4 Rh1+": "White had no way out and now he will lose the rook.",
        "41. Ke2 f3+": "If 42. Kxe3, black replies 42. ... Rxe1, 43. Kf2 Rb1, and soon black will promote his f-pawn, at which time white will capture Bxf1 and be recaptured, leaving black with a Rook+Bishop material lead with two pawns on each side. Still, white has nothing better.",
        "42. Kd1 Bb3+": "And now one possible continuation: 43. Kc1 (forced) Rxe1+ 44. Kb2 (forced) Kd4 (trapping the white king in the corner) 45. Kxb3 e2 46. Kb2 Rd1 47. Bd3 Rxd3 48. Ka2 e1=Q 49. Kb2 Qe2+ 50. Kc1 Rd1#. However, white resigned rather than play out the final 8 moves.\r\n"
    },
    "url": "https://gameknot.com/annotation.pl/getting-the-hang-of-the-pawn-avalanche?gm=22657",
    "gameName": "Getting the Hang of the Pawn Avalanche",
    "players": "stosgood (1657) vs. blake84120 (1779)",
    "opening": "Nimzo-Indian defence (E20)"
}