{
    "moves": {
        "1. e4": "I hope to be able to translate these words into english soon. Sorry\r\n\r\nThe analysis I did to my games aren't so much deep, so be patient and don't laugh much\r\nIt's clear that I couldn't get high ELO with this, though I have studied enough theory about chess. I think I should concentrate more and think better my moves.\r\n \r\nMis juegos son generalmente muy intuitivos y los analisis que hago no son muy profundos, asi que no esperen una biblia en el analisis. Mientras los expertos no se rian mucho... \r\nEstoy claro que con esto no podre llegar muy arriba en mi puntaje, aun cuando he estudiado bastante lo relativo a teoria de medio juego (dependiendo de las aperturas que uno elija) y finales, me falta concentracion para el calculo de variantes. ",
        "1... e5": "I thought it was good to annotate this game because I was losing it and hesitate I saw a light at the end of the tunnel.\r\n\r\nMe decidi a hacer algunas anotaciones pues esta es una de esas partidas que despues de tenerla perdida, se enciende una luz al final del tunel, que guia la esperanza.",
        "2. Nf3 Nc6 3. Bc4 Bc5 4. O-O Nf6 5. d4": "I was expecting for c3. White want to attack very quickly\r\n\r\nAunque es jugada normalmente, esperaba primero c3. Obviamente el blanco quiere iniciar el ataque de inmediato, a costa de un peon",
        "5... Bxd4 6. Nxd4 Nxd4 7. f4 d6": "I've got a pawn and my \"bad\" bishop is out. I felt fine in this position, but I didn't have a plan...\r\n\r\nYa tengo un peon de ventaja y el alfil de casillas negras se cambio, por lo que estaba comodo con esta posicion, aunque no tenia al momento un plan a desarrollar, lo que me costaria caro...",
        "8. c3 Bg4": "I moved this without think enough. I felt my room was getting little because of white's attack and I didn't lose more. My knight was coming back and the king side was becoming white. I didn't have a plan, already\r\n\r\n\r\nEsta jugada la hice sin analizar mucho y obedecio a que me empezaba a constreñir lentamente ante la ofensiva blanca y no queria perder terreno. Mi caballo retrocederia y el flanco rey quedaria a merced del ataque de los alfiles. Aun no tengo plan.",
        "9. Qd2 Nc6": "Obligado.",
        "10. f5": "I didn't saw this move and I thought my bishop was out of the game.  My next moves only try to save the bishop. I decided not to castling, because of the white attack.\r\n\r\nCuando dpo64 hizo esta jugada que nunca vi, pense que la partida habia llegado a su fin. El alfil estaba perdido. Mis siguientes jugadas solo tratan de salvar el alfil. Con el estado de cosas, ya me habia decidido a no enrocar, pues era entregar el rey en bandeja.",
        "10... Na5": "I decided to fight for a draw\r\n\r\nPense sacar el alfil para aminorar el ataque en el flanco rey. Me decidi a pelear por las tablas.",
        "11. Bd3": "White doesn't want to lose it, of course. I don't have a plan but to save the bishop\r\n\r\nEl blanco opta por conservarlo, obviamente. Todavia no tengo plan, mas que tratar de salvar el alfil.",
        "11... d5 12. Qe1 dxe4 13. Bxe4": "And my bishop is still lost\r\n\r\nY mi alfil sigue perdido.",
        "13... Qd6": "In the desperation, I'd got a plan: attack the king by the h-column when it opens with the sacrifice of my bishop.  This move goes for it.\r\n\r\nEsta jugada fue parte ya del plan que por fin habia surgido en la desesperacion: el ataque al rey mediante la columna h, que se abriria con la captura del alfil. Con el jaque en b6, arrinconaba el rey hacia su flanco, evitando que se fuera mas al centro. Despues de todo el alfil cumpliria su rol dentro del juego.",
        "14. h3": "And White hadn't seen my idea and he wants to get my bishop. The attack is coming...\r\n\r\nCuando el blanco hizo esta movida, estaba claro que no habia visto el ataque que yo tenia en mente y continuaba con su plan, que es capturar el alfil. El ataque por la columna de la torre directo al rey, ya se preveia.",
        "14... Qb6+": "My plan goes on...\r\n\r\nSeguimos con el plan. El blanco no lo ha visto y mantiene su linea de juego, pues no renuncia a la captura que tiene en mente.",
        "15. Kh1 h5": "Of course\r\n\r\nLa jugada obvia.",
        "16. Bg5": "With this move my Queen gets de 7th row, looking directly at the king.\r\n\r\nEl blanco pensaria eliminar la posibilidar de apoyar el ataque con el caballo?. No seria esta la pieza clave en el desenlace. Me deja ademas la posibilidad de alcanzar la septima fila con la vista fija en el rey.",
        "16... Qxb2 17. Nd2 O-O-O": "Castling is natural. The rook threats the knight making stronger the attack at f2. I thought white didn't capture my bishop, because the attack is very clear.\r\n\r\nEl enroque ahora es natural. La torre dama entra en accion atacando directamente por la unica columna abierta del negro, amenazando la captura del caballo si pretende cambiar el alfil, y con ello reforzar el ataque al punto g2. A esta altura yo pensaba que el blanco renunciaria a capturar el alfil, pues el ataque ya es muy claro, por lo que tenia en mente doblar torres en la columna d. ",
        "18. hxg4": "But he didn't. He captured the piece, putting his king on fire. Suicide?. \r\n\r\nPero no!!!. Fiel a su idea original, captura el alfil dejando su rey a merced de las torres del negro. Suicidio?. Definitivamente, no muy afortunado.",
        "18... hxg4+": "If Bh4, RxN and I recover my piece when more pawns. The attack is on and after g4 he lose his bishop. My knight is defending b7\r\n\r\nAhora si Ah4, TxC, recuperando la pieza y con ventaja de peones. Ademas el ataque continua, con g4 perdiendo el alfil. Mi caballo en a5 defiende el neuralgico b7 de cualquier contraataque.",
        "19. Kg1 Rh5": "Target: Two rook in the h-column, threatening the bishop winning time.\r\n\r\nCon un objetivo: Doblar las torres en h, ganando el tiempo con el ataque al alfil indefenso.",
        "20. Be3 Rdh8": "Mate machine is on. I have the queen goes out of g3...\r\n\r\nLa maquina de mate esta montada y solo faltan algunos ajustes, como sacar la dama de la defensa de g3...",
        "21. Bd3": "21.- Bf3 doesn't work because g4xB and if 22.-Rxf3, Rh1+, losing the queen. If 22.- gxf3, Rh1+ 23.-Kg2, R8-h2+, 24.- Kg3, Nh5+, 25.- Kg4+, Qg3 and checkmate.\r\nIf 21.- g3, I can do Nxe4, and if 22.- Bh6,  Qb6+, Kg2 23.- Rh2+ 24.- QxB+ y Qh2#. If 22.- Kg2, Rh2+, 23.- Kg1, Rh1+, 24.- K8-h2#\r\n\r\nWith this move, the end is easier.\r\n\r\n\r\n21.- Af3 no sirve por g4xA y si 22.-Txf3, Th1+, perdiendo la dama. Si 22.- gxf3, Th1+ 23.-Rg2, T8-h2+, 24.- Rg3, Ch5+, 25.- Rg4+, Dg3 y mate.\r\na 21.- g3, se puede seguir con Cxe4, y si 22.- Ah6,  Db6+, Rg2 23.- Th2+ 24.- DxA+ y Dh2++. Si 22.- Rg2, Th2+, 23.- Rg1, Th1+, 24.- T8-h2++\r\n\r\nCon esta movida todo resulta mas facil.",
        "21... Qxa1": "If White play well, the game is not so easier, but I have more value pieces.\r\n\r\nBut white does a wrong move and falls in the trap...\r\n\r\n\r\nSi el blanco juega bien, el mate se retrasa, pero, ya hay ganancia de material y viene mas irremediablemente. Por ejemplo, 22.- Rf3, Dxc3 23.- Re2 Td8, 24.- Db1 Th2 25.- Tg1 Cd5 26.- Ce4 Da3, 27.- f6 Cxe3, 28.- RxC Cc4+, 29.- Re2, Cb2 30.- Cf2, CxA 31.- CxC, Da6 32 fxg7 e4 33.- g8=D TxD y no se puede evitar perder material (analisis posterior, pues durante la partida, estaba seguro que esta linea era ganadora ya que no analice mas de 5 jugadas).\r\n\r\nPero el blanco cae en la distraccion y el final se acelera.",
        "22. Qxa1": "The end\r\n\r\nFin de la lucha.",
        "22... g3": "And the checkmate is clear.\r\nI liked this game because I was losing and finally I won.\r\n\r\nY el mate es inevitable.\r\nMe gusto mucho esta partida pues despues de darla casi por perdida, llego la esperanza. Por eso, creo que al nivel nuestro, cuando la diferencia de material es pequeña, se puede luchar por el empate o incluso la victoria.\r\n"
    },
    "url": "https://gameknot.com/annotation.pl/giuoco-piano-c50?gm=22526",
    "gameName": "Giuoco Piano (C50)",
    "players": "dpo64 (1697) vs. astrom (1768)",
    "opening": "Giuoco Piano (C50)"
}