{
    "moves": {
        "1. e4 e5 2. Nf3 Nc6 3. Bc4 Bc5 4. c3 Nf6": "Probably the most aggressive reply, but surely the natural one, attacking the undefended pawn?",
        "5. d4": "Now, instead of the safer 5.d3, White claims the centre right away...",
        "5... exd4 6. cxd4 Bb4+ 7. Nc3": "White gives up the e-pawn... He could play 7.Bd2, when 7...Nxe4 is a little risky following 8.Bxb4 Nxb4 9.Qb3 Qe7 10.O-O and Black has perhaps over-reached himself?",
        "7... Nxe4": "As things go, however, I'm happy to take the pawn.",
        "8. O-O": "Here's another tempter for Black...",
        "8... Bxc3": "If 8...Nxc3 9.bxc3 Bxc3 10.Qb3 and the further tempter of 10...Bxa1, after which 11.Bxf7+ Kf8 12.Bg5 Ne7 13.Re1.",
        "9. d5": "This is in the main line, but I don't like it; I would have thought 9.bxc3, keeping the pawns together preferable. If 9...Nxc3 10.Qe1+ wins the piece back.",
        "9... Bf6": "Perhaps a diplomatic retreat is better than 9...Nd5? Black is, after all, a piece and pawn up, though the piece will have to be returned at some point.",
        "10. Re1 Ne7": "White can have the Knight rather stranded in the centre...",
        "11. Rxe4 d6": "Important not to let that pawn go any further, and to release the Bishop. Two things: the a2-f7 diagonal is now blocked, and the d-pawn is isolated. It's supported now though.",
        "12. Bg5 Bxg5": "Black is happy to exchange a piece or two...",
        "13. Nxg5 h6": "Attacking the Knight is best, I would have thought, though I gather 13...O-O 14.Nxh7 is playable but risky.",
        "14. Nf3": "The Knight retreats, and Black has weathered the storm; White is just a pawn down.",
        "14... O-O": "And gets his King tucked away.",
        "15. Qb3": "Given the blocked diagonal, the Queen might have been better on d4?",
        "15... Ng6": "Black clears the way for the Rook to come to e8",
        "16. Rae1": "Sensibly doubling Rooks. Now Black needs to get e8 covered properly...",
        "16... Bf5": "So attacks the Rook as a move to give e8 the added support of the Rook on a8.",
        "17. Re4e3": "The Rook retreats.",
        "17... Rb8": "Now I'm looking to exchange off pieces on the e-file, but first must cover the pawn on b7, something, incidentally, the computer doesn't like, preferring 17...c5 for some reason, a move which a) splits up my pawns, b) allows White to exchange his problem pawn and c) opens up the blocked diagonal. Sometimes I don't understand computers!",
        "18. Bd3": "Since the diagonal is blocked, White offers up an exchange.",
        "18... Qf6": "Fine, but I'd prefer if he did the deed first. Actually, he may have been better keeping the Bishop on the board and attacking my Bishop with 18.Nd4 instead.",
        "19. Bxf5 Qxf5": "We exchange. Now that pawn on d5 really is looking vulnerable...",
        "20. Nd4 Qd7": "I go back to covering e8 and get ready to exchange on that file.",
        "21. Qd3": "The White Queen is preparing to supporting the Rooks on the file.",
        "21... Rfe8 22. Qe2": "He has tripled his big guns. But it's that pawn, rather foolishly (in my view) advanced, that he needs to worry about.",
        "22... Rxe3 23. Qxe3": "One exchange done. I wonder now if capturing with the pawn might have been better, given what follows?",
        "23... Kf8": "Now the e8 square needs extra cover...",
        "24. g3": "White takes care of the back rank mate threat...",
        "24... a6": "A little move to stop the Knight going to b5 after we've exchanged. It's not the start of a pawn advance.",
        "25. b3": "Maybe White thinks it was a waiting move and does the same?",
        "25... Re8": "Now I force another exchange...",
        "26. Qxe8+ Qxe8 27. Rxe8+ Kxe8 28. Kf1": "The King starts to head out - but that pawn on d6 is dead... 28.Nf5 Ne7 29.Ne3 was necessary. Or maybe allowing the d-pawn to fall and winning the Black g-pawn in exchange?",
        "28... Ne7": "White cannot save the d-pawn, and now, two pawns down, he resigned. (A player who knows my endgame skills would likely have played on!)"
    },
    "url": "https://gameknot.com/annotation.pl/giuoco-piano?gm=66326",
    "gameName": "Giuoco piano",
    "players": "myeriberto (1847) vs. feathered_tiger (1880)",
    "opening": "Giuoco Piano (C54), Therkatz-Herzog variation"
}