{
    "moves": {
        "1. d4 Nf6 2. c4 g6 3. Nc3": "The reason for so many games with this line is the thematic tournament I'm playing in right now. After this game was finished, I climbed to the second place, trailing one point behind the leader. If things go well with the remaining and current games, I hope to finish in the first two or three spots.",
        "3... d5": "I might give the KID a try in one of the remaining games, I have a general knowledge of the lines of the defence but never played it at a serious level.",
        "4. cxd5 Nxd5 5. e4 Nxc3 6. bxc3 Bg7 7. Nf3 c5 8. Rb1": "I don't know what happened with the popularity of this line. A few years ago, just about every top GM was playing this line, some of them with both colours. Now they've switched to more conventional lines, and I haven't seen any recent game with this line. I guess it's more a matter of fashion than anything else.",
        "8... O-O 9. Be2 cxd4": "The older line starts with 9...Nc6 but that is hardly played anymore, since it gives White a very pleasant middlegame and the only line where Black keeps the balance involves transferring the Bg7 to a5.",
        "10. cxd4 Qa5+": "Snatching a pawn to counterbalance White's development and pawn centre.",
        "11. Bd2": "The endgame after 11. Qd2 Qxd2+ 12. Bxd2 is no problem for Black. Without the Queens it's much easier to make use of the Q-side pawn majority.",
        "11... Qxa2 12. O-O": "I was recently reading a book by Bronstein on the K-K match in Seville where Karpov played this variation but opted for the Queen exchange, which Kasparov easily drew. One comment said that sacrificing a pawn like this leads to nowhere after 12...b6 13. Qc1. Little did they know about the times to come. The most pertinent game in that line is Ivanchuck - Svidler, Linares 1998, where White slowly used his central control to build up his position to achieve a winning advantage.",
        "12... Bg4": "The modern way of handling the variation. Black wastes no time in completing his development. 12...Nd7 is another attempt to clench the position without returning material but it gives White a very free hand and Black has to confide himself to the back three ranks for quite some time.",
        "13. Bg5": "13. Rxb7 is hardly played anymore since it's ancient knowledge that after 13...Bxf3 14. Bxf3 Bxd4, Black has more than equalized. However 13. Be3 is another matter altogether.",
        "13... h6": "Forcing this move is the point of the Bishop maneuver. White wants to weaken g6 in case a Bishop might come to the a2-g8 diagonal.",
        "14. Be3": "14. Bxe7 is weak due to 14...Re8 15. Rxb7 Nd7 16. Bb4 Rxe4 17. Re1 Bxf3 18. Bxf3 Rxd4",
        "14... Nc6": "Developing the last piece and putting more pressure on d4. Central pressure is the main way that Black can achieve counterplay in the Gruenfeld and it's also one of the reasons why Black has no \"bad\" pieces, i.e. the Bc8 is bad for Black in quite a few systems, the Benoni and the French, the Bf8 is bad in some lines of the Kid, the Nb8 is bad in some lines of the Ruy Lopez and again in some KID lines. But one of the perks of the Gruenfeld is that Black has no bad pieces in almost all the lines, everything on the board works together, provided you know what you're doing and this game is a good example of that. For example in this position, all the three light pieces create pressure on the d4 pawn, which was the reason why the first Knight and the two pawns were exchanged in the opening. It's interesting to note that the Qa2 isn't necessarily misplaced. I'm sure many chessplayers have seen the very good game Nimzowitsch - Capablanca, St. Petersburg 1914, where White lost just because he withdrew his Queen from the enemy camp after capturing a pawn and lost just enough time to hand the initiative over to the Cuban, who never returned the favour and won the game in a modern fashion.",
        "15. d5": "The best way to relieve the pressure on the d4 pawn. Other moves don't promise White anything. Now Black has to make a difficult choice. Not only where to move the Knight but if to capture on f3 before. 15...Na5 is considered weaker here, mainly because h6 has been played. Also, I remembered reading an old article by Khalifman about his game with Leko, which was just whitewashed after 15...Ne5. So I chose to exchange on f3 first, in order to make the e5 square more secure.",
        "15... Bxf3": "White has to recapture on f3 now and he has a difficult choice before him. There are good points to each recapture. For example, capturing with the pawn gets rid of the back rank weakness, strengthens the pawn chain and especially the e-pawn in case the e-file should open, it also keeps the Bishop available to come to the a2-g8 diagonal and make use of the weakened Black K-side. The drawback is that it weakens the squares around the King and especially h2. Capturing with the Bishop doesn't create any weakness, it also puts the unopposed Bishop on the long diagonal, but behind its own pawn and it also gives Black a relatively stable Knight on e5. In my database, the pawn recapture is played more often and with better results, probably for the reasons given above.",
        "16. Bxf3": "My opponent chose not to mangle his own pawns but like I said earlier, now the Knight can come safely to e5.",
        "16... Ne5 17. Rxb7": "Restoring material equality and invading my seventh rank. It's all in good measure since the pawn centre has been fixed, the Bishop pair isn't doing much at the moment and the best pawn has been preserved.",
        "17... a5": "A very good line for counterplay. I believe Black has equalized here because even though White's d-pawn is closer to the Queening square, it's less supported than Black's. Also, by advancing the pawn, the Ra8 is directly activated and thus the time lost in capturing the a2 pawn is restored.",
        "18. Rxe7 a4": "White has won another pawn but the Rook is more stranded than the Black Queen and it will need to waste time to return to a safe square. Also, the Qa2 is a better piece to support the advancement of the pawn than the Re7.",
        "19. Be2": "This is almost an acknowledgement of the wrong choice of recapture on move 16. White wants to cover c4 and be ready to kick the Knight with f4. The game in my database continues with 19. Bd4 and that looks like a better move, even though it allows Black to equalize comfortably.",
        "19... Qb2": "Remember the point about not retreating pieces that exert pressure on the enemy position? With this quite shuffle, the path of the pawn is cleared and the key move 20. Bd4 is prevented, after with would follow 20...Nf3+ 21. gxf3 Bxd4 and with opposite coloured Bishops, the a-pawn is even more dangerous.",
        "20. Kh1": "An interesting move, White wants to remove the tactical idea of Nf3 and carry on with Bd4 and f4, exchange my powerful Bishop and start advancing his d-pawn.",
        "20... Qb4": "The problem with White's last is that it's too slow. Now after this simple double attack, I can force the White Rook of its active position, capture the e-pawn and thus weaken the d-pawn, forestall the plan with Bd4 and f4, all the while keeping my prospects of pushing the a-pawn.",
        "21. Rc7": "There is no choice here. If 21. d6 then 21...a3 is very strong. Play could continue 22. Bxh6 (removing the Bishop from the dangerous diagonal) Bxh6 23. Rxe5 a2 24. Rb5 Qxe4 25. Bf3 (even this doesn't prove sufficient) Qc4 26. Bxa8 Rxa8 27. Rb1 (a sad necessity, the threat was Qxf1 followed by a1Q) bxa1Q 28. Qxb1 Qd4 29. Rd1 Bd2 and White's last hope, the d-pawn will fall and with him, the game. Playing for tricks with 21. Rxe5 Bxe5 22. Bxh6 again fails to 22...a3 and the passed pawn is just too powerful. White doesn't even have the chance to sacrifice the Bishop, he has to surrender a full Rook for it. White's move in the game is definitely best but it seems insufficient. ",
        "21... Qxe4": "I managed to win back a pawn and not give White anything in return. The central position of the Queen still hampers the plan with Bd4 and f4, for example if 22. Bd4 then 22...Rfd8 and the weakness of the d5 pawn is swiftly revealed. If White carries on with 23. f4 then Rxd5 calms his temper.",
        "22. Qd2": "It seems White has given up hope of exchanging Bishops on d4 and instead would be content to just chase the Knight away.",
        "22... a3": "One step closer. On a3 the pawn will be very safe, since it could be defended with Bf8 in case it comes under heavy fire.",
        "23. f3": "My opponent must have been sick of the hyperactive Queen and decided that she must retreat to her side of the board.",
        "23... Qf5": "Keeping the Queen in control of the White squares, namely d3 and c2, which could be invaded if White gets sloppy.",
        "24. g4": "A committal move that perhaps wasn't necessary. Incidentally I have only one space to retreat the Queen but it's a very good square at that.",
        "24... Qf6": "From b2 the Queen has taken quite a side-trip to f6, doubling on the long diagonal, preventing any attempt of a blockade on the a-file. 25. Bd4 still isn't possible because of Nxf3 and 25. f4 is refuted very nicely by 25...Nxg4 26. Bxg4 a2 27. d7 a1Q 28. Rxa1 Rxa1+ 29. Kg2 Rd8 30. d7 Qa6!",
        "25. Qa2": "The Queen is the only piece than is available to stop the pawn advancing. My Bishop, Queen and Knight coordinate very nicely to stop White from redeploying his Bishops to the Q-side in order to blockade.",
        "25... Qd6": "Keeping the active pace and not giving White time to regroup. Both Queens have now assumed the unworthy role of blockading the opponents passed pawn while defending their own. Quite an interesting arrangement. But because my pawn is a marginal one, that means that White's Queen is less active than my own.",
        "26. Rc2": "No time for doubling Rooks since after 26. Rfc1 the simple Rab8, White is forced to give way, 27. R7c2 Rb2! 28. Rxb2 axb2 29. Rd1 (29. Qxb2 Nxg4) Rc8! and everything ties in nicely for Black, the passed pawn is the clear hero on the board.",
        "26... Rfc8": "It's a good idea to exchange Rooks since that means there will be fewer pieces to cover the Queening square.",
        "27. Rxc8+": "This feels rushed, better was the sturdier 27. Rcc1 and it will be much harder to break White's position.",
        "27... Rxc8 28. Bc1": "Attacking the a-pawn but also retreating to the first rank. White's position is hard in any case and it's difficult to make a worthy suggestion.",
        "28... Bf8": "The pawn is safe now and the two remaining pieces can be used to attempt a breakthrough the blockade.",
        "29. f4": "White finally kicks the Knight from its central position but it weakens even more his King's position.",
        "29... Nd7": "Again there is only one place to put the Knight but it's sufficient. Now the Knight can come to f6 to attack d5 and g4.",
        "30. g5": "Taking away the f6 square for the Knight but the g-pawn might prove weak in the endgame.",
        "30... hxg5": "I always like fixing weak pawns. Now the Rf1 is semi-activated but with the pawn on d5, there is no way to reinforce the attack on f7.",
        "31. fxg5": "There is another point to exchanging on g5. The e5 square is again available for the Knight.",
        "31... Qb4": "The exposed position of the White King gives me plenty of tactical possibilities, the threat is Rxc1, followed by Qe4+, Qe3+ and Qxc1. That's if White does nothing about it.",
        "32. d6": "White takes the opportunity to activate his Queen and threaten f7. This also defends against the crude threat of Rxc1 because of the intermediate Qxf7+ enabling White to play Bf3 and avoid the tactical line given earlier.",
        "32... Ne5": "Coming back to the centre and covering the weakspot f7. This Knight move covers all the tricks and sets up some on its own. For example if 33. Qxa3 then Qe4+ 34. Bf3 Nxf3 35. Qxf3 Qxf3+ 36. Rxf3 Rxc1+ 37. Kg2 Bxd6 and Black is up a full piece.",
        "33. d7": "One last trick. The Knight is overloaded and can't take the pawn.",
        "33... Qb7+": "But White isn't the only one with tricks up his sleeve.",
        "34. Bf3": "The whole idea of the pawn sacrifice is to active the White piece and triple the attack on f7.",
        "34... Qxd7 35. Bd5": "White seems to have setup a nice battery directed at my King.",
        "35... Qh3": "But not all that glitters is gold. The tactical justification for this move lies in 36. Bxf7+ Kh8 and after this simple retreat White is overstretched and has nothing better than 37. Qg2 Qxg2+ 38. Kxg2 Rc2+ 39. Kh1 Nxf7 40. Bxa3 Bxa3 41. Rxf7 Bc1 with a technical won ending.",
        "36. Bg2": "White decides that simplifications don't suit him so he retreats and keeps the tension in the position.",
        "36... Qd3": "But once the d-pawn is gone, my Queen is free to roam the board.",
        "37. Bf4": "White gives up on attacking the pawn and tries to undermine the strong central Knight. An interesting variation starts with 37. Qd5 Qxf1+ 38. Bxf1 Rxc1 39. Kg1 Ng4 40. Qa5 Bc5+ 41. Kg2 Ne3+ 42. Kf3 Rxf1+ 43. Ke2 Rc1, the Black pieces coordinate very nice and the lone Queen is almost pushed off the board.",
        "37... Rc2": "Now it's time to remove the blockader.",
        "38. Qd5": "Forced, otherwise White comes under a heavy attack.",
        "38... Rc5": "A positional finesse, the point being to deny White the chance to activate the light square Bishop.",
        "39. Qxd3": "White goes for the Queen swap, I can't blame or commend his decision, the game is over in either case.",
        "39... Nxd3 40. Be3": "If the a-pawn wasn't so advanced, White could probably hold on, but as it is now, he's clutching at straws.",
        "40... Ra5": "Preparing to push the pawn.",
        "41. Bb6 Rxg5": "Winning an extra pawn for comfort.",
        "42. Ra1": "Finally the Rook gets the chance to blockade.",
        "42... Rb5 43. Bg1": "Covering the back rank.",
        "43... Re5": "Intending to exchange Rooks.",
        "44. Bf1 Re1 45. Rxe1": "Forced, now White played a few more moves out of inertia.",
        "45... Nxe1 46. Bc4": "Even if White could somehow exchange his dark square Bishop for my Knight, the resulting endgame would still be lost.",
        "46... Nc2": "With the idea Nb4 and a2.",
        "47. Kg2 Nb4 48. Bd4": "Covering a1.",
        "48... Bg7": "And White resigned. My opponent put up quite a struggle and made the game really interesting. It's pretty hard to say where he went wrong, since he never played a bad move, just small inaccuracies that slowly worsen his position to the point where there was no salvation. If I were to give question marks to White's move it would be his 16th, where gxf3 would have been more critical, his 19th, where he missed a good chance to play Bd4, 20th move would be given a \"?!\" since 20. Rc7 would have avoided the simple double attack and finally his 27th, where he completely surrendered the initiative."
    },
    "url": "https://gameknot.com/annotation.pl/giving-no-quarter?gm=31935",
    "gameName": "Giving no quarter",
    "players": "tommetje (1984) vs. nyctalop (2120)",
    "opening": "Gruenfeld (D85), modern exchange variation"
}