{
    "moves": {
        "1. Nf3": "Another installment in the Blake vs. Remohgramps match, this one starts out quietly but turns into a wild ride. White begins with a weak looking opening. I'm suprised now to discover the Reti Opening is the 3rd most popular opening for white after e4 and d4.",
        "1... d5 2. g3": "Transposing into the King's Indian Attack.",
        "2... Bg4 3. Ne5": "I have little idea what I'm doing here, which is why I played this opening. Having fun with new stuff, and avoiding my favorite openings against my friend, making us more or less equally handicapped in the openings.",
        "3... Bh5 4. c4 e6 5. Bg2 c6 6. d4": "Looking a bit more like the QGD now, though I don't believe a fianchettoed king's bishop is common in those lines.",
        "6... Nd7 7. Nxd7 Qxd7 8. Qd3 Bb4+ 9. Nc3 Bxc3+ 10. Qxc3": "My opponent likes to trade pieces. I prefer not to. These last two exchanges seemed rather unavoidable.",
        "10... dxc4 11. Qxc4 Nf6 12. O-O O-O 13. Bg5": "Pinning nothing.",
        "13... Rac8 14. Bxf6": "No better reason than to open up black's castle, not that white has any way to exploit that just yet.",
        "14... gxf6 15. e3 f5 16. Rac1": "Putting a rook on the half-open file.",
        "16... Rfe8 17. Rc3 Rc7 18. Rfc1 Rec8 19. Qc5": "Seems everyone is fond of the c-file.",
        "19... b6 20. Qe5 c5 21. d5 exd5 22. Bxd5": "White is toying with black's weak kingside pawn structure. I'm hoping for a chance to bring in the rooks.",
        "22... Re8 23. Qf4 Be2 24. Rc3c2 Bb5 25. a4": "25. a4? was a stupid blunder. I had it in my mind that black couldn't simply take the pawn because it is guarded by the white queen. I completely overlooked the fact that black's queen is on the bishop's diagonal and would defend the bishop after 25. ... Bxa4. I realized this about 2 seconds after I clicked Submit.",
        "25... Bc6 26. Bxc6": "White got away with it. Better get rid of that bishop before black sees the blunder.",
        "26... Qxc6 27. b4": "Aha! Having survived his blunder, white finds a way to win a pawn (the orginal misguided intent of 25. a4?)",
        "27... Rec8 28. bxc5 bxc5 29. Qxf5 Qxa4 30. Rc2xc5 Rc7xc5 31. Rxc5 Rxc5 32. Qxc5": "Done and done. A pawn ahead. Now all white has to do is pass and promote a pawn... Wait a minute. After all that planning and plotting, suddenly I realize that black has a passed pawn and white's in trouble. Black's queen will guide that a-pawn all the way to promotion, and there's nothing white can do to stop it. Worse, white has no way to threaten to promote one of his own pawns fast enough to maintain any kind of balance. If black promotes, it's game over. Seeing nothing better, I play for a draw.",
        "32... a5 33. Qg5+ Kf8 34. Qh6+": "Now, black won't give away his pawn on h7, will he? So, 34. ... Kg8 35. Qg5+ Kf8 36. Qh6+ Kg8 37. Qg5+ and draw by 3-move repeat. In fact, I entered the conditional moves and went to bed - it was late.",
        "34... Ke7 35. Qxh7": "Next morning, I found my opponent had left his h7 pawn to die. Now look what we have here. That black pawn on a5 is still imminently capable of winning this game. But now white has a passed pawn too, and it's only 2 moves behind. Maybe we can do something about that, or maybe not. But, white still has the repetition draw up his sleeve, so let's give black a little rope and see if he will hang himself instead of immediately playing for the draw.",
        "35... Qa1+ 36. Kg2 a4 37. Qh4+ Kf8 38. Qb4+ Kg8 39. Qg4+": "Ahh, the sweet spot. Black won't trap himself on the h-file, and now white's queen guards the white pawns advance toward promotion.",
        "39... Kf8 40. h4": "The race is on. I have an ace up my sleeve, but I doubt it has much chance of working.",
        "40... a3 41. h5 a2 42. h6 Qb2 43. Qg5": "A sly little queen move that accomplishes nothing. Black is about to have two queens on the board. Worse, both black queens are on the a1-h8 diagonal, protecting h8, the promotion square for white's pawn. Why hasn't white resigned? Remember that rope?",
        "43... a1=Q 44. Qd8#": "Black has two queens, but in his haste to promotion, he failed to ask why white made that strange queen move, 43. Qg5. I really hated to play the final move. Remohgramps is a friend, and he played this game quite well. Had he seen the checkmate and prevented it, white could probably still get a draw by chasing the black king around and looking for ways to get the white queen on a1. Or maybe not. Maybe black could tuck his king away and promote his pawn, then win with two queens to white's one. I really hoped Remohgramps would see white's little trap and play something like 43. ... Qb8, or 43. ... Ke8. Instead, he played 43. ... a1=Q??? (how often does a pawn promoting to queen get ???). Now that black had the two queens, white is faced with winning or losing - no chance of a draw now. My hand was forced, but I hated playing the move."
    },
    "url": "https://gameknot.com/annotation.pl/giving-him-a-little-rope-2?gm=22786",
    "gameName": "Giving Him a Little Rope #2",
    "players": "blake84120 (1796) vs. remohgramps (1129)",
    "opening": "Reti (A07), King's Indian attack, Keres variation"
}