{
    "moves": {
        "1. e4 e5 2. Nf3 Nc6 3. Bb5": "Fairly standard Ruy Lopez.",
        "3... Nge7": "An interesting move.  Maintains protection of the King's pawn by protecting the threatened knight with the other knight.  \r\n\r\nThis implies that Black will financhetto his dark square bishop which will allow more force to be brought to protect the king pawn although it might lead to the bishop being cramped if the pawn is too heavily protected to tempt white to exchange it at some point.",
        "4. d3 h6": "Black is proactively protecting his knight's freedom by stoppping White from pinning the knight to the king.  However white can still develope his bishop but Black's pawn move has no other obejective.  It would seem that Black has lost a tempo here.",
        "5. Nc3": "White developes another piece with a subtle threat of d5 threatening the supporting knight.  However this threat would be easily countered by ...d6 which would relieve the knight on the c file of its protection duties and remove the need to defend the knight with another knight.",
        "5... a6 6. Ba4": "Black forces the white bishop to act before the knight on c3 can come forward to lend its suuport.  Perhaps Black wants the white knight off the diagonal which also contains the white king before playing ...d6",
        "6... b5 7. Bb3": "Now ..d6 can be played without worrying about the knight-king pin.",
        "7... f5": "A bold move.  The threat against White's pawns is not an overpowering one.  A an exchange can be forced on e4 which will strip White's king pawn of its defender but being as there are no follow up attacks this is unlikely to worry White too much.\r\n\r\nThe real threat for Black is to advance the f pawn to f4 and cramp White's dark square bishop whilst capturing a large amount of territory on the Queen side.",
        "8. O-O d6": "The diagonal pawn line is taking shape and Black's light square bishop is free.",
        "9. Bd2 Nd4": "?\r\nThis allows White to use a knight exchange to half open the Black king's file.  Black will have trouble castling King side due to the light square bishop blocking the path and Queen side castling does not offer much protection",
        "10. Nxd4": "White wastes no time snatching that",
        "10... exd4 11. Nd5": "White moves his threatned knight to threaten Black's remaining knight.  Perhaps White is looking to reduce the amount of black pieces that might block the way to the king.",
        "11... Bb7 12. Re1": "White calls re-enforments to the file ready for the pawn capture",
        "12... c6": "Black tries to drive the knight away and open a diagonal for his queen to  bindside the white attack.",
        "13. Nxe7 Bxe7": "White was probably hoping for ...Qxe7 but this will do",
        "14. exf5 Qb6": "Black perhaps anticipating Re4?",
        "15. Qe2": "The bell tolls ...",
        "15... Qc7": "Alas Black does not have time to bring his rooks to the Bishop's aid.  Moving the king away from the bishop results in the Bishop (and possibly the game) being instantly lost.\r\nHowever, White has seen an openning ....",
        "16. Ba5": "!!\r\nThe Queen is lost!\r\nA move which take the Queen away from the bishop on e7 results in Qxe7  \r\nTherefore she cannot move anywhere except ...d8 (Bxd8) or ...d7 (Be6 wins the queen)."
    },
    "url": "https://gameknot.com/annotation.pl/gk-tournament?gm=1637",
    "gameName": "GK tournament",
    "players": "stevetaylor (1586) vs. Opponent ",
    "opening": "Ruy Lopez (C60), Cozio defence"
}