{
    "moves": {
        "1. e4": "This is the craziest and most open game I have ever played in GameKnot, and probably in my short chess life. (It is technically still in progress, but I am (thankfully!) only a few moves away from victory now.) It is a game where my Queen just does not know how to die, and rises from her ashes.. and not only once! So, off with the King's Pawn.",
        "1... e5 2. f3 Nf6 3. c3": "Now, normally 3.. Nxe4! here is the book move, but actually it does not win that easily after c3. I don't know if he did it with that knowledge or not, but later on he failed to build on this move, which was so critical.",
        "3... Nxe4": "I still do the move, without any concerns.. I should have had some!",
        "4. fxe4 Qh4+ 5. Ke2 Qxe4+ 6. Kf2 Bc5+": "This is the point where c3 turns out to be a strong move, since now 7.d4 will surely give White at least some breathing space after a possible 7 ... exd4.",
        "7. Kg3": ".. but he decides to continue his King's country walk.",
        "7... Qf4+ 8. Kh3 d6+ 9. g4": "I noticed that the checkmating attack would be more or less over, but could I still gain material?",
        "9... Bxg4+": "Forced to take with the Queen, since otherwise he loses the Queen!",
        "10. Qxg4 Qxf1+ 11. Kh4": "I am about to get 3 pawns ahead. But first..",
        "11... g5+": "11 ... g5  to ensure that his Queen gets only one pawn. On second thought, 11 ... O-O might have been a better try, since he is going to lose that clergy anyway if I am right. On third thought, I now realized he has a very strong move when the Queen is on a white square - if I do 11 ... Qxc1 now, then 12. Qc8 !",
        "12. Qxg5 Qxc1": "Now I am 2 pawns ahead, and no danger of losing a Rook directly.",
        "13. Qg4": "He returns to that plan, but it is a bit late now.",
        "13... Nd7": "Opening up for both ways castling and cutting off the Queen's path.",
        "14. Qg7": "Boy, does she want that Rook!",
        "14... O-O-O": "Ensuring the King's safety - for now..",
        "15. Qg2": "I didn't realise he was setting up a trap that would eventually cause me to lose my Queen. I opted to take the free pawn and the Rook afterwards, and I believe I did correctly, since to set up that trap, he ultimately lost a pawn and 2 rooks, which is worth more than a Queen in my view - especially now I'm eager to liquidate.",
        "15... Qxb2 16. Nf3 Qxa1 17. d3": "The Black Queen is going nowhere.",
        "17... a5 18. Rc1 Be3 19. Re1 f5 20. Qc2": "He still needs to prepare a lot before finally pouncing on my queen - since if he moves that Knight right away before 20. Qc2, I break free with 20 ... Qc3.",
        "20... f4 21. Kh3": "I don't know why he did that - he might have done it hindering 21 ... Bf2 , but still, that Bishop is met by the White Queen, and my lady is still not going anywhere.",
        "21... Nc5 22. Na3": "Finally the expected move.",
        "22... Qxe1": "The least-of-evils choice.",
        "23. Nxe1 Rdf8": "Protecting that passed pawn.",
        "24. Nf3": "Blocking that passed pawn!",
        "24... d5 25. c4 e4 26. dxe4 dxe4": "I think that was a very advantageous exchange, now I have two connected passed pawns!",
        "27. Nd2 Bxd2": "Liquidation was a good idea I thought, and after the next move (practically forced)..",
        "28. Qxd2 e3": "Now the Queen has to go somewhere, and I will be one step away from getting my own back!",
        "29. Qxa5 e2 30. Nb5 Rf7": "Against the mating attack. I realized the threat (?) 31. Qa8  only after I made the move, but still, if he takes the Rook, I come up with a Queen of my own!",
        "31. Qa8+ Kd7 32. Qxh8 e1=Q": "Exactly.",
        "33. Qd4+ Ke8": "Again, I think the least of evils, since that's the only place where he cannot put me in check and cause trouble.",
        "34. Qxc5": "Aha! I expected that, it appeared to gain some material, but..",
        "34... Qe3+": "Now I finally managed to work out an exchange!",
        "35. Qxe3+ fxe3 36. Nc3": "The horsie has to stay there, or block the path. The Rook is keeping his King out, and there is more than enough time for my own King to go and offer his Knight a valiant death.",
        "36... Ke7 37. Kg3 Ke6 38. Ne2 Ke5 39. Kg2 Ke4 40. Ng3+ Kd3 41. c5 Rg7": "Now his Knight is gone. A Rook vs Knight exchange normally loses, but..",
        "42. Kf1 Rxg3": "Now, if he takes the Rook (or does any else pawn move, for that matter), he can't stop me from promotion with 43 ... Kd2. If he chooses 43. Ke1 instead, then it is checkmate with 43 ... Kg1#.",
        "43. hxg3": "He took the long way home.",
        "43... Kd2": "The smell of the inevitable in the air..",
        "44. c6 e2+ 45. Kg2 bxc6 46. a4 e1=Q": "I finally got that promotion. The Queen appeared from the same file twice! That's exactly what you call cheating death.",
        "47. a5 Ke2": "Mate in 4 moves now. I did all the possible conditional moves here, and logged in an hour later to see an automated congratulation message.",
        "48. a6 Qf1+ 49. Kh2 Kf2 50. a7 Qg2#": "Final position."
    },
    "url": "https://gameknot.com/annotation.pl/glenda-appears-thrice?gm=21953",
    "gameName": "Glenda Appears Thrice",
    "players": "N.N. (1401) vs. goflb (1138)",
    "opening": "KP (C20), King's head opening"
}