{
    "moves": {
        "1. Nf3": "Hi everyone!  I received a challenge from Tony-de-Torre who is an avid reader of our annotations including my own.  Well, I will now annotate this one.  It ended in a draw.  I was subjected to a mating attack on the kingside beginning with a central lock-up and then a pawn storm with the heavies behind it (there was just one pair of minor pieces on the board).  Glenda, defending the e pawn, lodged herself on Henry's home square, as close to her other half as she could get.  My opponent apparently decided that Glenda did enough to rebuff the attack and offered me a draw.  Was Glenda's defence watertight though - you the jury decide!  Joanne",
        "1... d6 2. d4 Bg4 3. c4": "3. c4 - this is a Reti - it can also transpose into a kinda English Opening.",
        "3... c6 4. Nc3 Nd7 5. e4 Qc7 6. Be2 Ngf6 7. Be3 e5 8. O-O": "8. 0-0 - after establishing a pawn centre and getting the minor pieces into play I tuck Henry away.",
        "8... h6 9. d5 Nc5 10. Bxc5 dxc5 11. b3": "11. b3 - maintaining a decent pawn apex.",
        "11... Rd8 12. Qc2 Bd6 13. Rfe1 O-O 14. Rad1": "14. Rad1 - centralising the heavies.",
        "14... g6 15. Nd2 Bxe2 16. Rxe2 Nh5 17. Ree1 f5 18. f3 f4": "18. ....... f4 - after maintaining the pawn apex black locks up the centre and starts a pawn storm as I cannot attack his king due to centre being locked.  This is something out of the regicide manual by J N Walker - Attacking the King!\"",
        "19. dxc6 bxc6 20. Nf1": "20. Nf1 - after giving black the concession of doubleton isolanis on the queenside I batten down the hatches on the kingside.",
        "20... Qe7 21. Rd2 Ng7 22. Red1 Ne6": "22. ....... Ne6 - heading for outpost on d4.",
        "23. Qb2 Nd4 24. Ne2 Kh7 25. Nxd4 exd4": "25. ........ exd4 - got rid of pesky knight for equally pesky black passer, my rook blocks that one off with Rd3 next move.  The Wicked Witch of the West then moves to e5.",
        "26. Rd2d3 Qe5 27. Rd1d2 a5 28. Qa3 Bc7 29. Qa4": "29. Qa4 - Glenda tries to harass the weak black pawns - vainly.",
        "29... Rf6 30. Qa3 g5 31. Rf2 h5 32. Qb2 g4 33. fxg4 hxg4 34. Qe2": "34. Qe2 - here comes Glenda - she senses danger to e4 pawn and her other half and tries to protect both.  Can she succeed?",
        "34... Rg8 35. Qe1 Rh6": "35.  .........Rh6 and draw offer.  After Qe1 my opponent feels she has succeeded and offers me the draw.  I take the olive branch with sheer relief.  Hope you have had a good read.  Joanne"
    },
    "url": "https://gameknot.com/annotation.pl/glenda-holds-the-fort?gm=19784",
    "gameName": "Glenda Holds The Fort!",
    "players": "jstevens1 (1735) vs. tony_de_torre (1849)",
    "opening": "Reti opening (A04)"
}