{
    "moves": {
        "1. Nf3 Nf6 2. g3 g6 3. Bg2 Bg7": "3. ........... Bg7 - this is the Reti Opening, a hyper-modern opening and a very flexible one too.  Both of us have brought our knights out to KB3 and our bishops to Kkt2 making the position symmetrical and we castle next move.",
        "4. O-O O-O 5. d4": "5. d4 - breaking symmetry.",
        "5... d6": "5.   d6 - preparing a possible e5.",
        "6. Nbd2 Nbd7": "6. ........... Nbd7 - the position is still almost symmetrical but with my pawn on d6 and not d5.  Would d5 have been better than d6 in retrospect?",
        "7. b3 c5 8. Rb1 Rb8 9. c3 b6 10. Bb2 Bb7": "10. .......... Bb7 - both sides have now completed their development, black has countered in the centre with c5 - I think the position is roughly equal, but a few moves later that will all change and black's position (my own, is about to go down south mega fast)",
        "11. e3 Re8 12. Re1 Ba8 13. a4 d5 14. c4 e6": "14. ....................... e6?  In restrospect maybe taking on c4 might have been better but then it would have allowed a knight to squat in on c4.",
        "15. Ne5 Nxe5 16. dxe5 Nd7 17. f4 Rc8 18. cxd5 exd5 19. e4 dxe4 20. Nxe4 Bxe4 21. Bxe4 Nb8 22. Qc1": "22.  Qc1! - Eschews exchanging queens on d8.  White has a clear advantage owing to the beautiful diagonal of his lsb.  Glenda moves off d8 to avoid fronting up to a possible Rd1.",
        "22... Qc7 23. Qc4 Kf8": "23. .................... Kf8 - gets out of the pin from the Wicked Witch of the West on c4.",
        "24. Rbd1 Rcd8 25. Bd5": "25. Bd5 - very, very strong.",
        "25... Nc6": "25. .............. Nc6 - preparing to play Nb4 to steer the white lsb off d5 and to exchange off one or not both pairs of rooks.  But white scotches that idea with moving his dsb to a3.",
        "26. Ba3 Na5 27. Qc3 Qc8 28. Rd3 Rd7": "28. ..................... Rd7 - black can do little to prevent the gathering storm.",
        "29. b4 cxb4 30. Bxb4+ Kg8 31. Bxa5 bxa5 32. Qxa5 Kh8": "32. ........... Kh8 - I am now a clear pawn down, but I soldier on and because my f pawn is only attacked by the lsb I take the opportunity to move my king to h8 out of the pin.  There now comes a doubling up on the d file.",
        "33. Red1 Red8 34. Rd3d2 Qb8 35. Bxf7 Rd7xd2 36. Rxd2 Rxd2 37. Qxd2 Qb1+": "37. ........... Qb1  - over the past few moves there have been a plethora of exchanges resulting in me being two pawns down.  I think of throwing in the sponge here but consider what type of ending I am in.  Firstly, if you are one or two pawns down then the endgame you want to be in is either a Q P ending or an opposite coloured bishops ending.  At the moment I have both.  If you have an active queen in these types of ending then you have the chance of landing some useful checks.  Glenda does just that by landing on b1 at the first opportunity.",
        "38. Kg2 Qe4+ 39. Kf2 Bf8": "39. ......... Bf2 - no checks are available at the moment.  The a pawn cannot be taken because the Wicked Witch of the West will land on d8 giving a nasty check on me pore ole 'enry stuck in the corner.  In fact, come to think of it, she could land on that square now, but my Good Witch of the North, Glenda can start checking again.",
        "40. h4": "40. h4?? - I think this move throws away the win.  My dsb can now help Glenda in harassing the white king.",
        "40... Bc5+ 41. Kf1": "41. Kf1 - forced.",
        "41... Qf3+ 42. Ke1 Qxg3+": "42. ............ Qxg3  - I reclaim one of my pawns.  I decide against taking the h pawn because it is a non checking move and I do not want to allow the Wicked Witch of the West to hassle Henry so I keep Glenda on checking my opponent's king instead.",
        "43. Kd1 Qf3+ 44. Kc2 Qf2": "44. ........... Qf2.  Glenda pins the Wicked Witch of the West to the White King.  The exchange of queens would leave me a pawn down but in an ending with bishops of opposite colour.  I think I will be able to hold of the passer on e5 and protect my remote a pawn with the dsb.  I therefore decide to offer a draw.  My opponent decided to accept and I had to hand back 4.7 rating points I obtained from him in Stealth & Wealth.  But at least I did not lose 14.7, so my rating remained in the 1680s."
    },
    "url": "https://gameknot.com/annotation.pl/glenda-saves-the-day?gm=17071",
    "gameName": "Glenda saves the day!",
    "players": "ronlumm (1460) vs. jstevens1 (1672)",
    "opening": "Reti (A05), King's Indian attack"
}