{
    "moves": {
        "1. e4 c6": "Not long after winning the 2002 US Championship, I was approached by the good people at Ubisoft to try my luck against their famous chess program Chessmaster 9000. I have a healthy respect playing against computers and I knew that CM9k would be a very worthy opponent.\r\n\r\nAfter some discussion with the CM9k team, it was decided to play the match online at the Internet \"chessclub.com\". The time control would be brisk, but manageable. I was not likely to face severe panic inducing time scrambles that inevitably lead to gross errors.\r\n\r\nA large crowd of online kibitzers and spectators were drawn to the bout. I was probably a slight favorite going into the match, but with humans there is the, well … human factor!  \r\n\r\nJust one stupid little move could cost me the game and match. Fatigue, eye strain, psychology etc. all play a prominent role in human chess and I had to steel myself to try and play like a machine. I went into the match with guarded optimism.\r\n\r\nPlaying against a program like Chessmaster 9000 is not a walk in the park. CM9k is absolutely merciless punishing errors, is annoyingly patient and has a perfect memory for openings and endgames. Computers almost never blunder tactically, although they can make major strategic errors.  \r\n\r\nIt was this strategic deficiency that I wanted to exploit vs CM9k. I hoped to steer our battles to quiet maneuvering trench warfare that requires judgment and foresight rather than brute calculating ability.\r\n\r\n1.e4 \tc6 \r\n\r\nThis defense prepared before-hand is known as the Caro-Kann Defense - a very solid system that has a reputation for being effective against attacking maniacs and computers.",
        "2. d4 d5 3. exd5": "A very wise choice by CM9k - this move tends to opens the game up and creates more tactical possibilities than lines like 3 Nc3.",
        "3... cxd5 4. c4 Nf6 5. Nc3 e6 6. Nf3 Be7": "A slightly more adventurous is 6…Bb4 but I decided to stay within myself and keep things calm and conservative.",
        "7. cxd5 Nxd5 8. Bb5+": "I was happy to see this move, even though I had never encountered it before in a serious game. The alternative developing moves 8 Bd3 and 8 Bc4 pose more problems for Black.  \r\n\r\nThe problem with this checking move is that it leads to early simplification. White, with his superior control of territory, should avoid exchanges. That's chess 1 on 1. Black, with the slightly more cramped position, benefits from them.",
        "8... Nc6": "I thought about playing 8…Bd7 here but I was a little nervous about White playing 9 Bxd7  Qxd7 10 Ne5.  But really, that line's nothing for white. Black simply answeres 10…Nxc3 11 bxc3 Qd5 with a good game.",
        "9. Ne5": "9.Ne5? \t...\r\n\r\nThere is a  basic principle in the opening that a player should not move the same piece twice unless he has a very good reason.  CM’s move does come with a threat, 10 Nxc6, but that can be easily parried.  There is no long-term positive benefit that result from this violation of principle, so 9 Ne5 must be classified a mistake.",
        "9... Bd7 10. Bxc6 Bxc6 11. Nxc6 bxc6 12. Nxd5 cxd5": "9. ...\tBd7 \r\n10.Bxc6 \tBxc6 \r\n11.Nxc6 \tbxc6 \r\n12.Nxd5?\t cxd5\r\n\r\nThis is a very agreable move from Black’s point of view. Black’s pawn structure is strengthened markedly. He once had two weak queenside pawns and now only has one. Further, Black’s control of the center has been increased - squares like e4 and c4 have come under Black’s possesion.  \r\n\r\nI was feeling confident now that I could squeeze a win out of this position, no matter how strong or resourceful my opponent might be.",
        "13. O-O O-O 14. Bf4 Qb6": "12. ...\tcxd5  \r\n13.0-0 \t0-0 \r\n14.Bf4 \tQb6 \r\n\r\nBlack is clearly better now for the following reasons.  First, his pawn structure is iron-clad. White cannot dent that compact chain of pawns. Second, Black can attack two weaknesses on Whites’s side of the board. The d4 pawn is isolated and weak and White’s queenside survivors are also vulnerable.\r\n\r\nBlack's plan is to use his a-pawn as a battering-ram to soften up the white queenside and create a new weakness. Generally speaking, one can defend with only one weakness. However, two weaknesses are usually fatal.",
        "15. Qd2 Bf6 16. Be3 a5": "15.Qd2 \tBf6 \r\n16.Be3 \ta5!\r\n\r\nBlack plays according to the plan. The a-pawn will advance to inflict yet another weak isolated pawn on White's queenside.",
        "17. Rac1 Qb4": "17.Rac1 \tQb4! \r\n\r\n18 Qxb4 axb4 suddenly opens up the a-file to Black’s benefit. White is unable to shake off the pressure now because its pawns are just too weak.",
        "18. Rfd1 Rfb8 19. Rc3": "18.Rfd1 \tRfb8 \r\n19.Rc3 \t...\r\n\r\nCM has set a trap that might have worked against a less experience opponent. If Black mindlessly grabs the pawn with 19…Qxb2?? White wins with 20 Rc8  Rxc8 20 Qxb2. A strong program like Chessmaster never blunders a pawn for nothing.",
        "19... Qa4": "19. ...\tQa4 \r\n\r\nHere I decided to give a little tickle to the a-pawn with the intent of provoking the answer 20 b3.",
        "20. Rdc1 h6": "20.Rdc1 \th6 \r\n\r\nIt is very important for Black to remove the threat of back-rank mate.  This eliminates the constant worry about sudden cheap tricks. Speaking of cheap tricks, Black must resist 20…Qxa2?? 21 Ra3 Qxb2 22 Rc8 !! Rxc8 23 Qxb2 and White wins.",
        "21. b3": "White should have avoided this move until absolutely forced. A better continuation was to improve his king position, starting with 21 g3, followed by Kg2.",
        "21... Qb4": "Black is finally in position to play the long desired … a4 to create a lasting weakness on White's queenside.",
        "22. Rc1c2 Rbe8": "A terrible blunder would be 22…a4?? 23 Rc8  Kh7 24 Qxb4 Rxb4 25 Rxa8 and White wins.",
        "23. h3 a4 24. Rc3c8": "I can safely say that after this move White is lost as the coming endgame is hopeless. White should have tried the active defense 24 Bxh6! Qxd4 25 Rd3 Qe4. Black has an edge, but White may gain some counter-play later on because of the noticeable weakening of Black’s king position.",
        "24... Qxd2 25. Rxe8+ Rxe8 26. Rxd2 axb3 27. axb3 Rb8 28. Rb2 Rb4": "White’s defenses are over-stretched. He cannot defend both the d-pawn and the b-pawn.",
        "29. Kf1 Kf8 30. Ke2 Bxd4 31. Bxd4 Rxd4 32. b4": "White’s last hope rests with this passed b-pawn, but Black’s king easily intercepts it.",
        "32... Ke7 33. b5 Rc4 34. b6 Rc8": "Now White’s proud b-pawn has become a target.  Black will soon devour the pawn and then turn his attention to mobilizing his large kingside majority.",
        "35. h4 Kd6 36. Rb3 Rb8 37. Rg3 g6 38. h5": "Chessmaster makes a final bid for counterplay. He hopes to either splinter my kingside pawns or create a target for attack. I decided to give back the relatively unimportant h-pawn and begin the decisive advance of my chain gang of pawns.",
        "38... g5 39. Ra3 Rxb6 40. Ra7 Rb2+ 41. Kf1 f5 42. Rh7": "White reduces the material deficit to just one pawn, but the time required to take the h-pawn allows Black to roll his pawns forward.",
        "42... d4 43. Rxh6 d3 44. Ke1 Ke5 45. Rh8 Rb1+ 46. Kd2 Rf1 47. f3 Rf2+ 48. Kxd3 Rxg2 49. h6 Rh2": "42. ...\td4 \r\n43.Rxh6\td3 \r\n44.Ke1 \tKe5 \r\n45.Rh8 \tRb1  \r\n46.Kd2 \tRf1! \r\n47.f3 \tRf2  \r\n48.Kxd3 \tRxg2 \r\n49.h6 \tRh2 \r\n\r\nThe passed h-pawn has been rendered harmless and Black can advance his surviving pawns up the board.",
        "50. Ke3 f4+ 51. Kd3 Rf2 52. Rg8 Rxf3+ 53. Kc4 Rh3 54. Rxg5+ Ke4 55. Rg1 Rxh6": "50.Ke3 \tf4  \r\n51.Kd3 \tRf2 \r\n52.Rg8 \tRxf3  \r\n53.Kc4 \tRh3 \r\n54.Rxg5  Ke4 \r\n55.Rg1 \tRxh6 \r\n(0-1)\r\n\r\nWow! A good way to start the match! I won the first game, but I had some help from my opponnent. CM9k started with an anemic opening and it went downhill from there. The game was strategically won after about 20 moves and I had only to avoid some obvious traps to win the game.  \r\n\r\n  My opening choice proved very fortuitous as I soon reached the type of position that computer programs detest. My thoughts now turned to Game 2. Could I win the next game and effectively settle the match? I had a nice, conservative anti-computer opening in mind and was optimistic going into battle."
    },
    "url": "https://gameknot.com/annotation.pl/gm-larry-christiansen-chessmaster-9000-game-one-1?gm=2236",
    "gameName": "GM Larry Christiansen - Chessmaster 9000 game one (#1)",
    "players": "Chessmaster 9000  vs. Larry Christiansen ",
    "opening": "Caro-Kann (B14), Panov-Botvinnik attack, 5...e6"
}