{
    "moves": {
        "1. h4": "Trying a different approach against my good ol pal Jack. Saw this opening somewhere on gameknot. Figured I’d give it a try. Believe it’s called walking the plank...",
        "1... e5": "Still going to walk the plank...",
        "2. h5": "See, just going for a walk...",
        "2... d5": "Jacks next move was what I had in mind...",
        "3. h6": "Farewell Soldier...",
        "3... Nxh6": "Young lad died with cause. Was hoping Jack would play Nxh6",
        "4. d4": "Now hopefully all goes well...never opened this way...should be interesting ",
        "4... exd4": "Your turn bishop joe.....a sacrifice is needed.",
        "5. Bxh6": "Perfect, took his knight and now forces him to play g7xBh6",
        "5... gxh6": "Bishop Joe served his purpose. Now Queen Big Birtha is thirsty for blood!",
        "6. Qxd4": "Die pawn!",
        "6... Qg5": "Good ol Jack up to his tricks again....as dopey as I been playing, Wasn’t going to let this new opening be over that fast. Great move Jack. But I caught it!",
        "7. Nc3": "Queen Bertha calls out for knight in shining armor. Yes m’lady?",
        "7... Bg7": "Dang it.....was hoping to capture that rook some how...but aww well. Bertha knows she’s under attack. But she’s not sweating it.",
        "8. Qd3": "Bertha pulls back.",
        "8... Be6": "Enemy is bringing reinforcements...",
        "9. Nf3": "As do I...",
        "9... Qe7": "King Jack’s Queen retreats for the moment. King Jack....I may as well be King Jon. Now our kings have names.",
        "10. Nd4": "I advanced my knight. At this point, was still feeling this game out. ",
        "10... Nd7": "Saw that coming...",
        "11. Nxe6": "Ok...at this point...wasn’t sure what to do. Later realized I probably could of played a better move than to snatch Jacks Bishop. Just felt it was a good idea to play with less pieces.",
        "11... fxe6": "Hmmm... thought for a minute and I saw at this point Jack was going to put the pressure on with his knight... Let me just say, Jack (my opponent) and I have played many games against each other. So we kind of know what the other is thinking. At least that’s what I like to think.",
        "12. Qd2": "Queen Bertha decides to pull back yet again.",
        "12... O-O-O": "King Jack decides to go inside for a cup a coffee...",
        "13. O-O-O": "Me too...",
        "13... Qf6": "Here she comes again...",
        "14. e3": "At this point... I know I’m playing accordingly. I move my knight... then it’s all over. So, soldier e2, I need you to step into the front lines.",
        "14... a6": "Ok....another move made....still going to play safe.",
        "15. f4": "Another soldier steps up.",
        "15... Nc5": "Ok...here comes that knight pressure I was talking about.",
        "16. Be2": "Bishop Mike. “I need you to make room in the in the back rank” says Queen Bertha. “ King Jacks knight is planning on threatening our rooks. I need to protect them.”",
        "16... Ne4": "You can smell the stink coming from King Jacks Knights mouth.",
        "17. Qe1": "“Greetings m’lady.” Both rooks reply at the same time.",
        "17... d4": "King Jacks orders must of gotten misled. Black pawn jumped to soon.",
        "18. Nxe4": "With that, came a swift death of King Jacks knight. Decapitated!",
        "18... Qf7": "Blacks Queen couldn’t bare the site of watching her final knight get slaughtered. She pulls back.",
        "19. Qf2": "Queen Big Bertha had enough of the rooks gazing at her beauty. She moves out. ",
        "19... dxe3": "That pawn caused a lot of trouble for King Jack. Definitely a Benedict Arnold. ",
        "20. Qxe3": "I don’t like traitors. He must die. ",
        "20... e5": "This will be King Jacks Final move. His Stronghold is fallen.",
        "21. Qa7": "Queen Bertha gives King Jack an ultimatum and accepts. It’s all over. Victory!"
    },
    "url": "https://gameknot.com/annotation.pl/going-unorthodox?gm=64065",
    "gameName": "Going Unorthodox!",
    "players": "dadof5brats (1891) vs. shantijack (1781)",
    "opening": "Anti-Borg (Desprez) opening (A00)"
}