{
    "moves": {
        "1. e4": "I speculated that Charles would open this way.  1.e4 or 1.d4 are his favorites, so it was which one, but similar to me, Charles plays the KPO more often.",
        "1... g6": "This is a very educational approach because I don't see this fianchetto too often.  I believe that this is the Owen's Defense.  But, Ken accurately noted that it's important to get used to other openings.  That is, even ones that are frowned upon by others because you can get taken off guard and lose your guard, if you don't know what you're doing.  And, he showed me some examples of such.",
        "2. d4": "As we know, this is the best move after black moves a pawn one square, after 1.e4.",
        "2... Bg7": "This is how I also would've continued after fianchettoing.",
        "3. Nc3": "I would've developed with 3.Nf3, but I like this move just as well and does the same thing.  My focus would be on the K side since I like to castle early there.",
        "3... d6": "But, I have not seen this move played in this position.  The only time I saw the d pawn advance one square was in the Pirc Defense which I recently learned about in one or two of white's annotations.  So, that makes it more educational for me.",
        "4. Be3": "I'm not surprised that Charles played this since it develops.  But, I would've developed on the other side.  Having said that, I would've played 4.Nf3.  So, with how strong Charles also is, there's got to be something about this move that's better, which I'm just not seeing.",
        "4... a6": "Although I would've considered 4...Nf6 to continue developing, I would've noticed the likeliness of Charles gaining tempii with 5.e5  Having said that, this is also what I would've played as it prevents 5.Bb5+ of 5.Nb5, similar to what we see in the Sicilian Nadjorf.",
        "5. Qd2": "I would've developed on the K side, and as with Charles previous move, I would've still played 5.Nf3  But, this is where I figure out that getting the Q side was of more importance, as this is where the action is taking place for white.  How I figured this out is the fact that Charles will castle long, later on.",
        "5... Nc6": "Meanwhile, Ken continues developing.  I don't like it and, similarly to what I noted above, would've played 5...Nf6 because of how I'd answer it, but seeing what Charles does next makes me realize that there's nothing wrong with the move played.",
        "6. f3": "Having said all of that, I would've quickplayed 6.d5 here.  But, from that, I figured out that he could and would likely move to a better spot.  I was anticipating then the idea of 6...Nb4, with 7.a3 to follow.  But, 6...Na5 looks even better.  Charles must have saw it, and he probably thought that this would be overwhelming for him which I can relate since stronger players see things that I and others don't see.",
        "6... e6": "Opening up a line for his Q.",
        "7. h4": "Which is in connection with this move.  Although Ken would not even consider 7...Qg5?? or 7...Qh4?? for obvious reasons.  But, my thinking is that it puts pressure on Ken's Q side, in some way.  The reason behind this guess is that, I had something in common with this in one of my training games with black.  Nothing appeared to bad, and Ken played a move that I didn't understand.  But, he told me that it adds pressure to either my K or Q side and showed me exactly how it was doing that.  At that point, without even realizing, this was the cornerstone to my position becoming overwhelming, which later led to blunders that ultimately cost me the game.",
        "7... h5": "With that being said, Ken is trying to stop the pressure.",
        "8. O-O-O": "As noted on his 4th and 5th, things are going for Charles on the Q side.  And, what I know is that this'll hold up since this game is going to end in a draw.",
        "8... Nf6": "Meanwhile, Ken continues developing.",
        "9. Nh3": "Instead of placing the N on the rim, I would've answered with 9.e5 or 9.d5  But, I also know that there's a lot Ken can do afterwards.  And, given that Charles didn't play it means that exchanging pawns would not have been the way to go here as it would be to Ken's benefit.  Meanwhile, Ken was waiting to get some action on the K side, given that he's about to castle short.  As ION put a few years back, castling opposite wings makes things more interesting.",
        "9... O-O 10. Be2": "Completing his development.",
        "10... b5": "Doing a double fianchetto which Ken advised me against.  But, it works here as this, in the long run, might leave his B more mobile, the if, he were to play 10...Bd7.",
        "11. Rdg1": "I am not sure why Charles played this.  But, my guess is to get action on the g and h files, as it appears that he's now threatening to break through with his g2 pawn.",
        "11... e5": "Ken puts a stop to this by threatening a fork.  But, Charles had back up plans, as he shows on his next move.",
        "12. d5 Nd4": "I'm not sure why they thought so this soon, but they both agreed that noone can win which is why Ken offered a draw.  I know this because you can only offer a draw when it's your opponent to move.  It also makes sense since, even though I didn't go by it for a while, Ken's Elo rating was a little stronger.  With that being said, Charles agreed with Ken's assessment and must have figured that it would be a forced a draw, and therefore, accepts the offer.  "
    },
    "url": "https://gameknot.com/annotation.pl/gone-but-not-forgotten?gm=66930",
    "gameName": "Gone but not Forgotten",
    "players": "charleshiggie (2052) vs. kenneth_fiore_3 (2113)",
    "opening": "Robatsch (modern) defence (B06)"
}