{
    "moves": {
        "1. e4": "The King's Pawn Opening.",
        "1... e6": "! This is a solid move, but I do not understand why he decided to play the French Defense because I am not attempting a, \"Four Move Trick\".",
        "2. Nf3": "! I decided to start developing my minor pieces, and this is the reason that I transposed the King's Pawn Opening and French Defense into the King's Knight Opening.",
        "2... f6": "? I do not know why he made this move.  I believe that he wanted to develop his DSB, but it is a blunder because he cannot develop his knight with 2...Nf6.  Instead, he must play 3...Nh6, or 3...Ne7, if he wants to develop his King's Knight.  In addition, 3...Nh6 is not as good because, \"a knight on the rim is grim\", in general, and this is not an exception.  As a result, this puts him at a tactical disadvantage.  ",
        "3. e5": "? I chose this candidate to force a pawn exchange with 3...fxe5 5.Nxe5.  However, this is a mistake because I am pushing my pawn.  Jack Stockel has told me that it is not a good idea to push pawns, unless you can avoid it.  At the same time, I am sick with a very bad cold.",
        "3... h6": "? I do not know why he made this move, but it is another blunder.  I have been told by binblaster and chesskingdom64 that, \"pawn storms\" are not good because they produce, \"structural weaknesses\".",
        "4. Bd3": "? Jack Stockel has told me that it is not a good idea to develop the bishop near the starting position.  At the same time, I am starting to feel better, but I am still very sick.",
        "4... f5": "I am not exactly sure why he chose this candidate.  He probably wanted to avoid the pawn exchange with 4...fxe5 5.Nxe5.  However, the exchange would not have been bad because everything is even, at the moment.",
        "5. O-O": "I generally like to castle early and often.  In reality, this is a blunder, that I have not realized, in the past.  That is because I castled, without thinking.  In an article, Grandmaster Natalia Pogonina said, \"Many people castle automatically without giving it any real thought.  Not a good idea.\"  According to Natalia, it is usually good to castle because your king is generally under attack.  However, there are occasions where you should not castle because your king is not attacked.  When this happens, it is better to use your king as a weapon.  If, however, you should castle, it is a good idea to judge where.  If your opponent is attacking from the Kingside, it is good to castle Queenside.  On the other hand, if your opponent is attacking from the Queenside, it is good to castle Kingside.  Therefore, it is a good choice to castle on the opposite side, from where your opponent is attacking.  That is, if you are going to castle.  ",
        "5... d5": "I do not know why he moved there.",
        "6. b3": "I chose this candidate, so that I could form a fianchetto.  However, I should have made an en-peasant capture, first, with 6.exd6 e.p., or 6.exf6 e.p.  That way, I would force an exchange.  In this position, an exchange is not bad because things are still, \"level\".  Meanwhile, I am feeling much better from the cold.  Of course, I still have some cold like symptoms, but it is not nearly as bad.",
        "6... a6": "I do not know why he made this move, but I will develop my DSB with 7.Ba3.  Even though it might not be the best move, it will still be solid because I am going to force an exchange, in a little while.",
        "7. Ba3 Be7": "I am not exactly sure why he did not capture my DSB, but I will force an exchange with 8.Bxe7, Qxe7.  At this point, I am almost completely back to normal with only minor cold symptoms.",
        "8. Bxe7 Qxe7 9. c4": "In this position, I am clearly trying to force an exchange with 9...dxc4 10.bxc4.  However, that will not happen, and I will explain it shortly.",
        "9... g6": "?? I do not know why chose this candidate, but he should have responded with 9...dxc4.  That way, a pawn exchange would occur, and things would still be even.  In this position, however, I am now going to take the d5 pawn, with 10.cxd5, so I will be a point ahead.  Does he still have a chance to win back my pawn after 10.cxd5?  That will be answered shortly.",
        "10. cxd5 Qc5": "?? In this position, he should have responded with 10...exd5.  That way, everything would still be even.  However, I am now a point ahead, in this position.  In the meantime, he still has a chance to win a pawn back, but is he going to blow this chance?  That will be answered shortly.",
        "11. Nc3": "I made this move to protect my a1 rook, but I forgot that the rook was already protected.  Therefore, this is a mistake because I just wasted a tempo.",
        "11... Qf8": "?? He had the chance to recapture my d5 pawn with exd5, but that chance is now over.  In this position, I will remain a point ahead and force an exchange with 12.dxe6, Bxe6.  Therefore, he will also have less material to defend, after the exchange. ",
        "12. dxe6 Bxe6 13. Nh4": "! In this case, \"a knight on the rim is dim\".  I chose this candidate so that I could capture his g6 pawn and play a powerful fork between his queen and rook with 14.Ng6.  If this happens, I will win his rook, at worst.  However, he will not allow this, and I will explain it shortly.",
        "13... Qf7": "! This is solid as it protects his g6 pawn and prevents the fork, that I had mentioned earlier.  He also could have played 13...Qg7, and it would have been just as good.",
        "14. Bc4": "I made this move, to force an exchange.  In addition, I do not mind exchanging pieces because I am still ahead.  Therefore, I will start the exchange with 14...Bxc4.  ",
        "14... Bxc4 15. bxc4": "As it turns out, this exchange is bad because he can win back a pawn, if he plays 15...Qxc4.  However, he misses this opportunity, and I will explain it momentarily.",
        "15... g5": "? This is a mistake.  In this position, he wants to chase my knight, instead.  On the other hand, I have a counter weapon to protect my c4 pawn, even if he wins my knight with 16...gxh4.  That weapon is my queen, and I will win the b7 pawn and a rook, if he takes my knight.  In other words, if 16...gxh4, 17.Qxb7. ",
        "16. Qf3": "At this point, I decide to attack his b7 pawn and a8 rook, but he will stop this attack with 16...c6.  However, that does not bother me because I will win another free pawn with 17.Nxf5.  When this happens, 16...Qxf5 will not be feasible, due to my queen on f3.  Therefore, I will be two points ahead, instead of 1.  At this point, I have recovered from the cold.",
        "16... c6 17. Nxf5 Ne7": "In this position, he is attacking my f5 knight with his knight, but I do not care.  That is because I will play a very powerful fork between his Queen and King with 18.Nd6+.  Therefore, the game is now lost for black, and I will explain it shortly.",
        "18. Nd6+ Kd7": "! This is how black decides to move out of check.  In reality, this is his best move.  He also could have played 18...Kd8, or 18...Kf8.  In reality, 18...Kf8 would have been, by far, his worst move because I would immediately mate him with 19.Qxf7#.  18...Kd8 would have been slightly worse because I would win another pawn, before the queen with 19.Nxb7+, followed by 20.Qxf7.  However, I am still going to capture his queen with 19.Qxf7.",
        "19. Qxf7 c5": "?? I am not sure why he decided to advance his c pawn, but 19...b6 would have been his best move because it would have protected his b7 pawn.  Therefore, I will win another free pawn with 20.Nxb7.",
        "20. Nxb7": "After a good game, he resigns because he is behind by 12 points, and I will eventually find an inevitable mating pattern.  It is important not to rush and to take your time, before you make a move.  When you are sick, however, it is important take longer, in making a move.  In other words, it is a good idea to move slower, when you are sick.  If you feel, \"under the weather\", it is much harder to concentrate, so you need more time to rest.  After all, it is extremely important to get enough rest, when you have a cold.  This is especially true in a chess game because your mind needs more time to absorb the information, if you are not feeling well.  "
    },
    "url": "https://gameknot.com/annotation.pl/good-chess-despite-a-cold?gm=44282",
    "gameName": "Good Chess, Despite a Cold",
    "players": "jkarp (1121) vs. aa1440 (1202)",
    "opening": "French defence (C00)"
}