{
    "moves": {
        "1. e4 e5 2. Nc3": "The Vienna game -- an unusual line around here, apparently.",
        "2... Nf6 3. f4": "The Vienna Gambit!  Akin to the King's Gambit, but black has no possibility of Qh4 , so he must play carefully.",
        "3... exf4": "?  This move is bad, as the text shows.  d5! is much better, where both sides have great attacking chances.",
        "4. e5": "The knight has no safe squares, and will have to retreat to g8.",
        "4... Qe7": "Postponing the inevitable.",
        "5. Qe2 Ng8 6. Nf3": "Development, sure, but this is necessary to keep the queen out of h4!",
        "6... g6": "?  Neglecting your development when you're behind is a dangerous move. Nc6 and d6 both look better here.",
        "7. Nd5": "!  A strong move that forces the queen to move and to address the fork at c7.",
        "7... Qd8": "Alright.  Time to take stock.  Black is up a pawn, and ALL of his pieces are back at home.  White has many options, and the fact that I didn't win in this position is both a testament to my opponent's fighting spirit and my own failings.",
        "8. Nf6+": "A trappy, tricky move.  Nxf6 is met by exf6 , where black must lose a piece on the next move.",
        "8... Ke7": "The only way to avoid losing a piece.",
        "9. Nd5+": "Daring the king to come out into the open to e6...",
        "9... Ke8": "He doesn't take the bait.  At this point, I had gotten him into the situation I wanted -- all his pieces are at home, his king has moved so he's lost the right to castle, and it's still my move.  This is an ideal King's Gambit/Vienna Gambit position.  So where did I blow it?",
        "10. d4": "Completely dominates the center and paves the way to win back the gambit pawn.  g6 looks like a waste for black, as Bg7 doesn't have much scope.",
        "10... Be7 11. Bxf4": "Looks like a huge developmental edge for white.",
        "11... c6": "Forces the knight to move.",
        "12. Nf6+": "?! Getting greedy!  Nxf6 is met with exf6, winning the bishop, but maybe Nxe7 was safer.  White is in danger of overextending.",
        "12... Kf8 13. Qe3": "?! Preparing Bh6 , which leads to Nxh6 Qxh6#.  This is too slow, however,  and now black exposes that white is overextended.",
        "13... Bxf6 14. exf6 Nxf6 15. Bh6+ Kg8": "White's threats have been parried pretty well, and black looks to be okay.",
        "16. O-O-O": "?!  This works out poorly, as black can play Ng4 with a fine game.  Bg5 could have been better, as white is really looking for black to stumble into mate (which isn't the best way to play).  Note that if the queen moves, a major piece on e8 is mate.",
        "16... Ng4": "! Forcing an exchange which favors black.  White is down a pawn and reeling.",
        "17. Qg5": "Hoping to exchange queens, drive the knight away and win the exchange on h8.",
        "17... Qxg5+ 18. Bxg5 Kg7": "Not going to be easy to win that rook now...",
        "19. Re1": "If I can grab and hold this file, I could get a dominating position.",
        "19... d6": "Freeing the bishop and protecting the knight.  But d5 was better.",
        "20. Be7": "See, d5 was better.",
        "20... Re8": "Not much of a pin...",
        "21. Bxd6": "Since the knight protects e1.",
        "21... Rxe1+ 22. Nxe1 Bf5": "And now the roles are reversed -- the position is roughly even, with black a little bit ahead on development.  This is now a big test of my endgame abilities!",
        "23. c3": "Supporting the d4 pawn, but also making it unassailable by the Bf5.",
        "23... Nd7 24. Nf3 Re8 25. Bc4": "Necessary to activate the rook.",
        "25... b5": "Oh man, if that rook gets to e2...",
        "26. Bb3 Re2": "... doesn't look good.  But, good defense can hold this position...",
        "27. h3 Ne3": "c2 is now very weak, and g2 looks like it could fall as well.",
        "28. Re1": "!  Sneaky!  The pawn on g2 is now immune, and black must exchange rooks!",
        "28... Rxe1+ 29. Nxe1": "And now the g2 pawn is protected.",
        "29... Be4 30. g4 g5 31. Kd2": "This position looks dead even, but what can I do?  I decide I need to get my king active, and try to use my queenside majority to make a passed pawn over there.",
        "31... Nc4+ 32. Bxc4": "Forced, or the king goes back to inactivity to protect b2.",
        "32... bxc4 33. b3 Bb1 34. bxc4 Bxa2": "Black gets the passed pawn first, but white's king is more active.",
        "35. c5": "Better than Kd3, where the king is tied to the defense of the c4 pawn.",
        "35... a5 36. Kc2 a4 37. Kb2 Bc4": "The threat is Bf1.",
        "38. Nf3": "Threatening Nxg5.  Now Bf1 is met by Ng1.",
        "38... Kg6 39. Ka3 Be2 40. Ng1 Bd1": "Protecting a4.  Notice that the king is tied to the passed pawn, and the knight is tied down by the bishop.",
        "41. Kb4 f5 42. gxf5+ Kxf5 43. d5": "!  A good move that maybe should've come earlier (I'm still not sure).  Black must take care not to allow white's powerful coming passed pawn to queen.",
        "43... cxd5 44. c6 Nb6 45. Kb5": "?!  Puzzling, perhaps, since Kc5 also looks good.  That might have been the best shot for a win, since after 45. Kc5 then a3, and although the pawn cannot be stopped, White is for choice after  45. Kc5 a3 46. Kxb6 a2 47. c7 a1Q 48. c8Q . ",
        "45... Nc8": "The best move.",
        "46. Ba3": "A good, consistent follow-up!  If black isn't careful, white is going to play Ka6 followed by Kb7, getting a new queen!",
        "46... Na7+": "Forced but good.  Black exchanges white's powerful passed pawn for his knight.",
        "47. Kb6 Nxc6 48. Kxc6 Ke4": "And now the game is going to be drawn.  White is up on material, but with four black pawns to two for white, and bishops of opposite color, a win isn't in the cards for anyone.",
        "49. Kc5 h5 50. c4": "Draw agreed.  Still, a fun game with lots of chances, and hopefully I learned how not to squander an advantage!"
    },
    "url": "https://gameknot.com/annotation.pl/good-enough-for-a-draw-but?gm=1790",
    "gameName": "Good enough for a draw, but...",
    "players": "ethansiegel (1726) vs. presso (1748)",
    "opening": "Vienna gambit (C29)"
}