{
    "moves": {
        "1. e4": "Hi everyone!  This game was even right up to the early middlegame when a tactical shot won me a pawn.  Somehow I managed to increase my lead in material until, a king move on black's part finally managed to wrap things up.  You would think that with the queens off the board you are safe from Old Matey - well, just remember, a rook is also mating material and it is quite possible to crawl into what is known as a mating net.  This game provides an example of this.",
        "1... c5 2. Nf3 d6 3. d4 cxd4 4. Nxd4 Nf6 5. Nc3 a6": "5. ......... a6 - a Naijdorf Sicilian - this move is to prepare a later b5 and to stop any knight incursions on that square, although it has not been unknown for the white player to sacrifice a knight on b5 for the pawn.",
        "6. Be3 e5 7. Nb3 Be6 8. f3 Nc6 9. Qd2": "9. Qd2 - standard development and paving the way for queenside castling.",
        "9... d5 10. exd5 Bxd5 11. O-O-O Bb4 12. Bg5 Bxb3 13. Qxd8+ Rxd8 14. Rxd8+ Nxd8 15. cxb3 Nd7": "15. Nd7 - quite a bit has happened in the space of a few moves, firstly I castle queenside after an exchange of pawns and then comes a plethora of exchanges leading to the current position.  I now need to develop Frere Leblanc to get my king rook into play.",
        "16. Be2 O-O 17. Rd1": "17. Rd1 - rook centralised as planned - puts pressure on one of the enemy knights.  Black is about to make his first mistake........",
        "17... h6": "17......... h6? - this loses a pawn becase of the loose knight on d7 - I also bust up black's kingside pawns into the bargain!",
        "18. Bxh6 gxh6 19. Rxd7 Kg7 20. Ne4": "20. Ne4 - a useful outpost for my knight now that the f pawn is pinned.",
        "20... Nc6 21. Rxb7": "21. Rxb7 - black's previous move Nc6? just drops another pawn.",
        "21... Nd4 22. Bxa6": "22. Bxa6 - and another black pawn bites the dust - I now have 3 queenside passers!",
        "22... Ba5 23. Bc4 Kg6 24. Rd7 f5 25. Nc3 Kg5": "25. ......... Kg5 - not fatal, but inaccurate play could result in a snap mate on the side if black is not careful.  I have spent the last few moves controlling all the open files to consolidate my position.  Hopefully I will find a way to finish this game somehow.  Ah, what is this, I think I have another target here, the e pawn!",
        "26. Re7 Kf6 27. Nd5+": "27. Nd5  - this knight move becomes pivotal to what is to come later.",
        "27... Kg5 28. Rxe5": "28. Rxe5 - now black is 4 pawns down!  However, while he still has his rook and a couple of minor pieces against my own on the board I still have work to do.  Who would have thought though, that this game is going to terminate in just four more moves?",
        "28... Bd8 29. Kb1": "29. Kb1 - Henry decides to back up the a pawn and sidestep any potential pins on the c file.",
        "29... Nc6 30. f4+ Kg4": "30. ........... Kg4?? - see my next note.",
        "31. Be2+": "31. Be2  - here I announced mate in 3 and black resigned.  Dmaestro has already given me the correct answer in a pm here but to any other reader, can you spot the checkmate.  Answers on a postcard.  Cheers.  Joanne."
    },
    "url": "https://gameknot.com/annotation.pl/gothicgirls-jubilee-party-group-6-mating-net?gm=19078",
    "gameName": "gothicgirl's jubilee party/ group 6 - Mating Net!",
    "players": "jstevens1 (1698) vs. NN (1553)",
    "opening": "Sicilian (B90), Najdorf, Byrne (English) attack"
}