{
    "moves": {
        "1. c4": "Another opening i like to use sometimes, i'm facing a tougher opponent so i don't wanna start making silly mistakes and using openings i'm not used to...",
        "1... Nf6": "Something i'm not used to....",
        "2. Nc3": "I carry on as if nothing has happened, and it hasn't...",
        "2... g6": "Finnachetto bishop (or whatever it is) is coming....",
        "3. Nf3": "Another blinder or is it blunder? time will tell....",
        "3... c5": "Up comes the c pawn......",
        "4. e3": "In retaliation, i may go d4 next depending on what Grader does....",
        "4... Nc6": "Threatens  d4...",
        "5. a3": "Stops Nb4...",
        "5... Bg7": "I was right on the finnachetto thing!!",
        "6. Be2": "I favour a different route...",
        "6... d5": "I don't wanna take that just yet so i radio for backup....",
        "7. b3 d4": "He waltz's right passed.....",
        "8. Na4 d3": "It did take me a moment to realise the queen was backing up the bishop here so......",
        "9. Bf1": "Annoying!!..",
        "9... Ne4": "it's what he was aiming for!",
        "10. Ra2": "I spotted the sneaky Bg7 threat on Ra1....just!",
        "10... O-O": "Naturally.....",
        "11. Nb2": "I have to get rid of that pawn, i focus all my attention on it so i hope it's the right thing to do....",
        "11... Bf5": "Well ok but that is too little to late for the pawn....",
        "12. Nxd3": "Now hopefully i can carry on developing and castling and quick!!",
        "12... Qd7": "Allwing the rook link up.....",
        "13. Qc2": "It was a choice between h3 or this i couldn't allow Nc3 so this won....",
        "13... Bg4": "That's why h3 was an option....",
        "14. Be2": "I'm ok with an exchange if that's what's comming but also i've cleared the way to castling...",
        "14... Rab8": "Obviously planning some form of pawn assault...",
        "15. h3": "So i start assaulting myself, that sounds wrong, i didn't start assaulting myself......but i threaten with h3 you can see....",
        "15... Bxf3": "rather than a weak back off he goes for the jugular...",
        "16. Bxf3": "I willingly oblige....",
        "16... Ng5 17. Nxc5": "At least a managed a pawn grab out of that, hope it doesn't come back to bite me on the bum....",
        "17... Nxf3+": "Annoying!! now i have to double my pawn right where i want to castle, Grader sure knows how to ruin your day...",
        "18. gxf3": "i can't afford to go behind in material if i havn't got a plan, and i havn't right now.....I also remember against diesel this open file was his downfall so watch out!!",
        "18... Qc7 19. d4": "I didn't want to back off just yet and i like this pawn move it stops any e5 ideas and i'm sure grader was going for the double threat next move, Nd4 threatening both knight and queen so that stops that in it's tracks...",
        "19... Nd8": "He didn't want an exchange then....? I guess that knight has some kind of role in graders plans, i'll keep an eye on that little scamp!...",
        "20. a4": "You may think this is an odd move but it's in preperation for Ba3 then, play allowing, Qe4 then Bxe7, that's the plan, lets see what happens, that's what i love about chess, the plan can change in the blink of an eye, it's so fluid. Yes i am wasted!!",
        "20... Ne6": "That stops my plan a little, gonna have to reposition c5 to Nd3 then on to d5 via b4, then carry on as before, yeah right......",
        "21. Nd3": "off i go.....",
        "21... Qd7": "I guess this all heads toward a d4 meltdown, so in preperation......",
        "22. Ba3": "I aim this little beauty somewhere useful, i hope....",
        "22... Ng5": "And he starts to make inroads toward my king. Well if thats the case.....",
        "23. Ke2": "I'll go meet him personally......",
        "23... Rfd8": "Erk!! extra back up for the queen and her d file (well, almost hers, but not quite)....",
        "24. Nc5": "I  couldn't risk putting my knight on e5 cos the last thing i want is an exchange on that square and open up the d file good and proper! no thanks!..It would be nice if he moves to d6 and then i have a discovered attack so i could potentially go a piece up if he makes the wrong move 24.... Qd6, 25.Ne4 Qd7, 26.Nxg5...in a perfect world it would happen like this..........but the world is far from perfect.....",
        "24... Qc8": "As i said, far from perfect........",
        "25. h4": "I continue to annoy him and i need that knight out of there if i am to continue with my plan, i need my queen on e4 to carry on though....",
        "25... Ne6": "So he backs off which is ok but i now have to decide if i want to exchange or do i still need my knight...?",
        "26. Rg1": "I decide to leave it up to him and assert my rook on the g file...",
        "26... b6": "obviously he didn't want to exchange then...",
        "27. Ne4": "Well nor do i yet, so i back off.....",
        "27... Rd7": "This puts the brakes on Bxe7 so i look for something else.....",
        "28. h5": "I decide the best course of action would be to smash the kings pawn guard to smithereens......",
        "28... Bxd4": "Ah, annoying as i can't take the bishop because of the imminent fork Nxd5 ouch!! So, again i have to search else where.....",
        "29. f4": "To try and disslodge that knight once and for all....",
        "29... Bg7": "he backs off having failed miserably to lure me into his web of lies, although i have lost a pawn and a valuable file has been opened, i just hope i have enough time to do what i need to......",
        "30. f5": "So i plough on with my pawn attack, i'm in real bad shape and i need to keep pressure on my opponent or i fear the worst for my gallant army...",
        "30... Nf8": "A pleasant sight, the retreat of an enemy knight.......",
        "31. fxg6": "I gotta make this pawn rush count for something or i may be in for a shock....",
        "31... hxg6": "............",
        "32. hxg6": "now his king will be just as exposed as mine and it may be a case of who gets in there first....",
        "32... Nxg6": "I did expect the knight to take so i have a little something in reserve...",
        "33. f4": "Ha ha, i'm coming for you knight, i'm coming for ya!! I need that knight out of the way so i can exert pressure on the g7 bishop with Bb2. He cant move f6 yet as it would leave his knight en prise...",
        "33... Qc6": "Under pressure, i have the Queen song running through my inner dialogue, \"under pressure da da da.....\"",
        "34. f5": "So i move in to exert some, all i can say is i hope this works!!",
        "34... Ne5": "So that's good, he's out the way but i have to choose my next move carefully.....do i go Bb2 or f6 or something else. Decisions decisions.....",
        "35. Bb2": "I plump for the Bb2 it felt right and i know i have the force flowing through my viens or is it 10 year old smack?.....",
        "35... f6": "This was the reason i was um-ing and ah-ing about if i should go f6 or bb2 i thought he would probably move the pawn forward to protect the knight so.....",
        "36. Bd4": "I decide to block the d file for now and it also adds support to the c4 pawn which i will have to move forward at some point in the near future....",
        "36... Kf7": "This un pins his bishop.....",
        "37. c5": "That pawn move i was talking about.......",
        "37... Rc8": ".........",
        "38. Bxe5": "That knight was causing to many problems for me logistically so it had to go.....",
        "38... fxe5": "the expected response.....",
        "39. Ng5+": "I wasn't sure if i should go Qc4 or make this move, this one won.....With that queen and those rooks so close together he has to be careful not to set up a fork for me to take advantage of, good luck Grader....",
        "39... Kf6": "Wriggling out of check......",
        "40. Ne6": "I figure i have to keep the pressure on him and somehow manouvere my pieces into a decent position to launch an effective attack, i have work to do!....",
        "40... Kf7": "What?? Well if he wants to give me his pieces......",
        "41. Rxg7+": "I was debating to take with the knight or rook both have their merits but i went with the rook in the end...",
        "41... Kf6": "And i'm glad i did...",
        "42. Rg6+": "That bitch is mine he can only go to f7 in which case my next move is Ng5  and there she is, his queen down the barrel of my shotgun and i'm taking her fucking head off!! Lovely little discovered attack!!",
        "42... Kf7": "As i said, the only available square....",
        "43. Nd8+": "I thought instead of Nf4 i'de be greedy and see if i could get away with losing only 1 piece....",
        "43... Rdxd8": "That's what you get for being greedy....",
        "44. Rxc6": "Now i'm in my element i'm on a roll and nothing can slow me down now!!",
        "44... Rxc6": "The expected response.....",
        "45. Qc4+": "I want him on the back rank if possible.....",
        "45... Ke8": "Beautiful, it's all over for the G man now....",
        "46. Qg8+": "He can only turn his tail and run like, i was gonna say the wind, but he's a big fat king and he's outta breath in one square...",
        "46... Kd7": "And there it is, at this point Grader resigned nowing only too well the crushing fate he has in store should he continue. Good game. Lesson from this game, i think it was my very active pawns that won that game for me. He never had a chance to coordinate his forces into any kind of meaningful attack. By keeping him busy with very irritating play pawn wise, i managed to bully myself into a winning position. I enjoyed this game it showed the power of the little people, nice!!"
    },
    "url": "https://gameknot.com/annotation.pl/grader-gets-a-goin-over?gm=15727",
    "gameName": "Grader gets a goin over!!",
    "players": "daveyr18 (1426) vs. graderguy (1504)",
    "opening": "English opening (A16)"
}