{
    "moves": {
        "1. e4 e5 2. f4 exf4": "This is always regarded as the best move for Black, and yet I almost always find myself declining with Bc5, since I like the positions where black castles queenside and plays f5 before Nf6 as a personal style choice.",
        "3. Nf3": "The only move that prevents Qh4 , although Bc4 is quite playable and offers many chances for white also.",
        "3... g5": "An aggressive move!  This declares black's intentions: going after the Nf3 and basically forcing white to play for the attack.  Another interesting option is 3. ...d6, where white may play to regain his pawn, but doesn't really have a good entry for attacking the black kingside.",
        "4. Bc4": "Developing the bishop is a good move here, as it attacks the weak f7 square.  Also interesting is 4. h4, which basically forces g4 followed by 5. Ne5, leading to the Kieseritzky Gambit, named after that guy who lost the famous \"Immortal Game\" to Adolf Anderssen. ",
        "4... g4": "Aggressive!  White has a big lead in development, but black's kingside pawns make the kingside ripe for a storm.",
        "5. Ne5": "Interesting.  This is one of three interesting options.  5. Ne5 is the standard way to attack by sacrificing *no* pieces, 5. 0-0 gxf3 6. Qxf3 sacrifices a knight for very good attacking chances for white, and 5. Bxf7 Kxf7 6. Ne5  sacrifices a bishop for... less good attacking chances.",
        "5... Qh4+": "The best move; it's clear that g4 also serves to force the knight to leave f3, allowing Qh4 .",
        "6. g3": "?!  Now, this is interesting.  White is basically daring black to attack *his* kingside.  Much safer was Kf1.",
        "6... fxg3": "The best continuation.  Black threatens gxh2  and the much more effective g2 , which could win a rook and lead to promotion.",
        "7. Qxg4": "?!  This offers the exchange of Queens, but it allows g2 , which is even worth sacrificing the queen for.",
        "7... g2+": "!  Black will not only get a queen to replace the one he's sacrificing, but he gets a rook off the board to do it.",
        "8. Qxh4": "This move really looks menacing, since it threatens Bxf7#.  But black can defend.  I wonder if Ke2 is a superior try?  The line I see is 8. Ke2 gxh1=Q 9. Bxf7 , but after 9. ...Kd8 10. Qxh4 , 10. Be7 looks like it takes the sting out of white's attack, leaving him down a rook.",
        "8... gxh1=Q+": "Forcing either Ke2 or Kf2.",
        "9. Ke2": "9. Kf2 would be met by Bc5 , which is good for black.",
        "9... Qg2+": "!  I know that people who are really good will not give this an exclamation point, since it's forced, but I am so pleased to see someone not grabbing the bishop on c1; 9. ...Qxc1 is met by the gruesome 10. Bxf7#!",
        "10. Kd3": "An effective way to run.  Black is up a whole rook, but he must defend against white's mating threats.",
        "10... Nh6": "But black has lots of ways to defend.  Be7 is also sufficient here.",
        "11. Qf6": "A good try!  Black must address the threats to both f7 and the Rh8.",
        "11... Qg7": "The only way to keep everything defended.  I'd like to give a big compliment to graderguy this far.",
        "12. Qf4": "Of course white cannot allow his queen to be captured or even exchanged.",
        "12... d6": "A strong move.  With everything defended, black forces white to move his aggressively-posted knight.",
        "13. Nf3": "This doesn't work out so well for white, but it's difficult to find anything better.  For example, exchanges on f7 only help black, Bb5  is countered by c6, and every other knight move just results in its capture.",
        "13... Nc6": "If black can catch up in development, then white won't have any advantage at all.  This controls a lot of space in the center and threatens a number of things, including exchanging the Bc4 with Na5 and check with Nb4  or Ne5 .",
        "14. Ke3": "?!  I don't understand this move; was white so afraid of Ne5 ?  Wouldn't 14. Nc3 have been more logical?",
        "14... Bg4": "Although many moves look tempting, this is, I think, the best move.  Black clears out his queenside for 0-0-0, which would effectively end any chances white had, while simultaneously threatening the only piece preventing black from playing Qd4  and winning the Bc4.  White looks like he has nothing good.",
        "15. Ng5": "??  But this certainly does no good!  I think that few moves actually look good for white here, as black has basically a won game, but this move gives him a mate in one.  Can you spot it?",
        "15... Qd4#": "Grader did.  After watching this game, I may have to re-evaluate my decision to play 2. ...Bc5 against the King's Gambit.  Well done, Graderguy!  0-1."
    },
    "url": "https://gameknot.com/annotation.pl/graderguys-glorious-gambit?gm=19403",
    "gameName": "Graderguy's Glorious Gambit",
    "players": "miperralaica (1591) vs. graderguy (1571)",
    "opening": "KGA (C37), Silberschmidt gambit"
}