{
    "moves": {
        "1. e4": "This is my most common opening move. It attacks one central square and occupies another. In addition, it opens lines for my bishop and queen so that they can easily fortify a location when needed. This move is often played my many players followed by 1. ...e5 2. Nf3 Nc6 and a move of choice.",
        "1... c5": "This is the Sicilian Defense. Contrary to what one might expect, I believe that the opening originated in Italy, not Sicily. This is a defense because the move is not as proactive in taking the center as White's move was. Instead, the goal of the Sicilian is to attack on the queen-side whereas White normally would attack on the king-side. According to the chessgames.com database, 1. ...c5 is the most commonly played counter to king's pawn games among grand masters, but I digress. This move does not expose the enemy king and keeps a watch on the d4 square.",
        "2. Nc3": "When I learned how to play chess, I learned to play 2. Nf3, the more common and stable move. However, this move leads to a closed Sicilian game, and this is a passive way to start the Grand Prix Attack. Normally, 2. f4 is played immediately, but 2. Nc3 has a better winning percentage because after 2. f4 Nc6 3. Nc3 Nd4, Black has a little advantage with his outpost-ed knight.",
        "2... d6": "2. ...d6 is one of the normal moves. It opens lines for the bishop, defends the c5-pawn, and attacks e5, a central square. In addition, when the c5-pawn is lost, Black is not left with a horrible pawn structure as in the case of e6, where if White takes a grasp on d5, Black has a weaker d6 square. 2. ...d6 also prepares for 3. ...g6, which is the Dragon variation, named due to the pawn structure's resemblance to a dragon.",
        "3. f4": "This move initiates the Grand Prix \"formation\" and is a clear indicator to Black of White's intentions throughout the rest of the game. Seldom does White play this move and not continue on with a Grand Prix Attack. This move does have its downsides, however. White could have achieved a better developmental lead over Black, and now d4 is an unprotected square. Luckily, White has ample time to defend against Black's attacks on that square. Another drawback to the Grand Prix is that if the attack fails, like many Sicilian games, it almost always means destruction for White.",
        "3... Nf6": "I would have chosen 3. ...Nc6 or 3. ...g6 for consistency, but I suppose that this move is just as good. I wanted to refrain from 4. e5 because I would prematurely begin my assault, and I would be left with an open king-side diagonal.",
        "4. Bc4": "I believe that Nf3 or d3 would have also worked. I chose this move because it develops a piece, attacks d5, and keeps an eye on the f7-diagonal. It was just my preference for this move. Actually d3 would have been a worse move because in the Grand Prix, a Bc4 is usually mandated.",
        "4... g6": "Here we go with the Dragon variation. As White, this is my least favorite opening to deal with because I never studied it, and my only experience with it and most Sicilian variations is through the games I have played. Black hopes to place his \"Dragon bishop\" on g7 so that he can wreck havoc upon the longer diagonal. If the bishop is not removed, it can be fatal for White.",
        "5. Nf3": "I decided to not attack the bishop due to my inexperience with the opening. This move further attacks the center and prepares for a king-side castle. 5. d3 would have also been playable now that the bishop is developed.",
        "5... Bg7": "The Dragon bishop is unleashed. After Black castles and moves the rook to e8, Black can play Bh8 and keep almost ultimate watch over the diagonal. Should Black castle and lose the bishop, things could get dicey.",
        "6. O-O": "The castle here is crucial to the Grand Prix. It alleviates the worry of a king in the center, further connects the rooks, and prepares for a rook lift to f3 as soon as the knight is removed.",
        "6... O-O": "Black now must attack on the queen-side, but I have time because Black has developed nothing on the respective side yet. I continued to prepare my king-side attack.",
        "7. d3": "This move reinforces the e4 pawn and frees gives air for the my black bishop. My newly discovered pawn chain entitles me to a full-scale attack on the side where the pawns point.",
        "7... Nc6": "Now, I cannot be as liberal with my play because Black is one step closer to his attack. I didn't fret because a6 was not occupied by his pawn. However, Nd4 was the move I feared in the opening, but now that is detached from my perspective.",
        "8. Qe1": "I continue my attack by engaging my queen. If Black plays Nd4, I would recapture and move my other knight to e2 or an equally effective square. Qe1 is a move that is commonly seen in the Sicilian openings.",
        "8... e5": "This was an inaccuracy by Black. Now, the Dragon bishop is blocked in the sense that it cannot fully control that diagonal after the recapture, and d5 is now a weak square for him.",
        "9. fxe5": "My intention was to nullify the Dragon bishop completely. Also, this move makes the f-file semi-open so that my rook can more easily lift.",
        "9... dxe5": "If 9. ...Nxe5, 10. Nxe5 dxe5 11. Nd5 or an equally effective move is better for me because the some knights are traded and the Grand Prix favors more central control.",
        "10. Be3": "I attack the c5 pawn. It's supposed to fall early in the game, so let's make it fall now.",
        "10... b6": "This protects the c5 pawn, but now all countermeasures for Black are gone. Better would have been not to move a pawn.",
        "11. Nd5": "I occupy d5 with an outpost-ed knight. If a capture happens, I recapture with my bishop and create a pin between the knight and rook.",
        "11... Nxd5": "This is the recapture. It does assist in f5, but the bishop will prevent that.",
        "12. Bxd5": "Now I have a double-pin. The game quickly ended from here.",
        "12... Bb7": "Protecting the knight wasn't the only worry Black had. Now I can attack while his pieces are pushed back.",
        "13. Ng5": "I launch my attack with a knight move. Now, three pieces attack the f7 square. It is not easy to defend from this.",
        "13... Rb8": "The goal of this move was to move the knight to a better square. Sadly, this was too late.",
        "14. Nxf7": "When you can win a free pawn, take the free pawn! I wanted more than the pawn, so I took with the knight, and not the bishop. Capturing with the rook would have made the game somewhat different.",
        "14... Qd7": "This move saves the queen from capture, for now. Better would have been Qe7 or possibly Rxf7, but because I am rushed and do not know how to save annotations to continue for later, this is an interesting variation for the reader to analyze.",
        "15. Nxe5+": "I take the pawn and make a discovery check. Now, I win the queen. As a result, my opponent resigned here. From this game, beginners can learn about the Sicilian Grand Prix and Dragon variation, and advanced players can enjoy an amusing game. Thanks for your time, everybody, and I hope that my rushing didn't make too bad of an annotation!"
    },
    "url": "https://gameknot.com/annotation.pl/grand-prix-discovery?gm=42615",
    "gameName": "Grand Prix Discovery",
    "players": "suppressor (1200) vs. gintama (1271)",
    "opening": "Sicilian (B23), closed"
}