{
    "moves": {
        "1. e4 d5": "Usually I would have played the standard e5, but I like to explore other options now to be able to handle them when someone plays them against me.",
        "2. e5 c5": "I think I \"stole\" that from the game database.",
        "3. Bb5+ Bd7 4. c4 a6 5. Qa4": "Whoah, he brings out the big guns. Nice how I can't take the bishop with my pawn.",
        "5... Qb6": "A bad move. I think I wanted to \"secure the area\", but it didn't do me any good. Should have opened up the king's side instead.",
        "6. cxd5 Bxb5": "Ok, so at least I got a material advantage.",
        "7. Qf4": "Danger bells should be ringing, two white pawns standing right in front of my door, and the queen mom right behind.",
        "7... c4": "But no, I opted for opening a way for my queen, at the same time blocking my white bishop of course. Bad move ignoring the dangers that waited for me.",
        "8. e6 f6": "Again bad. Should have taken it, even if it meant opening up for the queen.",
        "9. Nh3 a5": "Ok, I can' even think anymore what I wanted to do here. I think EVERY other move would have been better.",
        "10. Ng5": "Now I'm pretty screwed.",
        "10... h6": "This move instead of a5 before might have spared me some nasty stuff.",
        "11. Nf7 Rh7": "What else could I do. ",
        "12. Nc3": "Of course, he brings out more army.",
        "12... Na6": "Again with the right side. Of course I was very much squeezed in by these damned pawns, so I couldn't move at all with my Knight and bishop on the left side.",
        "13. Qf5": "Ouch. I can't breathe!",
        "13... g6": "A desperate try to do SOMEthing.",
        "14. Qxg6 Rg7": "Ok, that looked nice, off with you, bad queen. And do I see a pawn for me on g2?",
        "15. Nd6+": "Check! No - Double Check! ",
        "15... Kd8 16. Qf5 Rg5": "I wanted to make sure the queen goes far far away. But didn't I miss something?",
        "17. Nf7+": "Riiiight.",
        "17... Kc7 18. Nxg5": "Bye rook, it was nice with you. By now I already saw the game as lost. My only hope would be some mistake on my opponents side for a change.",
        "18... hxg5": "Ok, at least I have a nice pawn wall built there. Too bad my king isn't behind it but behind the enemy's pawns.",
        "19. Ne4 Nh6 20. Qh7 Qd4": "Ok, I got nothing to lose, so I took the initiative, since I didn't see a very immediate threat from his queen. My black bishop really held it together.",
        "21. Nxf6 Qxf6": "I don't know if he planned this to happen, but I don't think so. So there was the mistake I hoped for.",
        "22. a4 Qe5+": "Let's roll.",
        "23. Kf1 c3+": "Ok, one more to the left please?",
        "24. axb5 cxb2": "I didn't mind losing my white bishop, that pawn possibility looked too good.",
        "25. Qc2+": "That I didn't see coming.",
        "25... Kd6": "Ok, let's cuddle with my...erm, with his pawns. But hey, the offer the same kind of protection my pawns used to do.",
        "26. Bxb2": "That was it with my brave pawn. He almost made it. Again the game seemed to turn against me.",
        "26... Qxd5 27. bxa6": "I think I overlooked the obvious.",
        "27... Rxa6 28. Qc8": "Ok, now I had to act, and quickly, because with the queen behind me, there was nothing good coming for me.",
        "28... Qb5+": "I see a bishop for me.",
        "29. Ke1 Qxb2": "And I got it. Of course this was a chance for him to start attacking me.",
        "30. Ke2": "Luckily he went for protecting his rook. That was the last chance I needed. (Ok, I say it like that now, knowing that it ended well, but I had to continue attacking him, or he would have attacked me.)",
        "30... Qe5+": "Interestingly, after this crazy game development, we were even on the material side, number wise at least. Going back behind is pawns would have cost him his rook.",
        "31. Kd3": "So he went out in the open, hoping that I wouldn't be able to get a grip on him. At this point I saw the possibility of checking him on the c line with my rook to get the queen.",
        "31... Qf5+": "So I tried getting him there.",
        "32. Kd4 Bg7+": "This is why I love chess. Sometimes figures that stand around all day seem to fit the game like a carefully placed puzzle piece.",
        "33. Ke3 Ng4+": "Once again, this wasn't really planned, especially since he had always more than one field to escape to, but I hoped he would move like this to be able to activate all my figures.",
        "34. Ke2 Qe4+": "Here I had to decide between this and Qe5+ with the possibility to get the rook again, but I wanted to force him to go to the first line.",
        "35. Kd1": "Best move he could make. For me.",
        "35... Nxf2+": "Yeah yeah yeah.",
        "36. Kc1 Rc6+": "By now it looked good for me, and of course I went for the grand prize. Second to grand maybe, the big one comes last.",
        "37. Qxc6+ Kxc6 38. Rxa5": "This was his last chance to do something. I tried making this into a puzzle, and the automatic mover went to a2 with the rook. This would have made things more difficult, indeed, but it would only have taken me longer to get to the win.",
        "38... Qc4+": "At this point he gave op, seeing the obvious continuation: 39. Kb1 Qb3+ 40. Kc1 Kd3++\nOk, thanks for watching, I hope you had a little fun, I sure did while playing this. It surely wasn't my best game or anything, but my blunders led to an amazing ride."
    },
    "url": "https://gameknot.com/annotation.pl/grayn8s-mini-tournament-http-gameknot-com?gm=22880",
    "gameName": "grayn8's mini-tournament, http://gameknot.com/",
    "players": "bqwhite (1252) vs. kron (1351)",
    "opening": "Scandinavian (centre counter) defence (B01)"
}