{
    "moves": {
        "1. e4 g6 2. c4": "Already unusual.  A Modern defence to the King Pawn Opening has been transformed into an English Opening: The Great Snake Variation.",
        "2... e5": "Adorjan's Defence.  Permitted to do so, Black grabs e5, with a grip on the d4-square.",
        "3. Nf3": "Simple development can't be bad.  Yet there is something to be said for striking at once in the centre by 3.d4! exd4 4.Qxd4.",
        "3... Bg7": "Why not 3...Nc6?  The reason one usually develops knights first is that one usually knows more about where the knight wants to go early in the game than the best place for the bishop.  Here, the reverse is true.  The bishop is clearly destined for g7, and Black will want to castle soon.  Meanwhile we aren't yet sure whether the b8-N will want to go to c6 or d7.",
        "4. Nc3 Nc6": "Inhibits the advance of White's d-pawn to d4.",
        "5. Be2": "White obviously likes to develop quickly.  An alternative was 5.g3 with the idea of Bg2 and setting up a Botvinnik-like position.",
        "5... d6 6. O-O Nge7": "6...Nf6 is probably OK, but the move played keeps the f-pawn free to advance, and renders harmless any possible pin by Bc1-g5.",
        "7. d3 O-O 8. Re1": "(!?) Possibly anticipating an opening of the e-file?",
        "8... f5 9. Nd5": "(!?)",
        "9... f4": "A good alternative seems to be to take on d5 (9...Nxd5!?).  But Black wants his K-side attack.",
        "10. Bd2 h6": "To prepare ...g5 and a pawn storm on the K-side.",
        "11. Rc1": "White calmly builds up in the centre, confident that the best counter to a flank action is a central counteraction.  White is preparing the pawn-break c4-c5.",
        "11... g5 12. h3": "Forestalling ...g5-g4.  Black must spend more time building up his attack, time that White puts to good use.",
        "12... Ng6": "To enable ...h6-h5.",
        "13. Qb3": "(!) Indirectly attacking the BK down the a2-g8 diagonal, as well as placing pressure on b7.  The major difference between this game and a King's Indian Defence, say, is that the latter usually features a closed centre.  Here the centre remains semi-open, which helps White's active defence.",
        "13... Rb8": "Relieving the c8-B's guard duties at b7, and hence renewing the threat to advance on the K-side.",
        "14. c5": "(!) ",
        "14... Be6": "Though the bishop is hanging here, the pin puts at least a temporary crimp in White's counteroffensive.  Both sides are being circumspect at this stage, combining attack and defence.  The game is very finely balanced hereabouts.",
        "15. Qa3": "Increasing the pressure on d6.  The WQ also eyes a7.",
        "15... dxc5": "By capturing, Black hopes to create counterpressure down the d-file.  The situation is very murky it this point.",
        "16. Qxc5 Qd7": "Aiming, as ever, towards h3.  But Black is also thinking of bringing a rook to d8 with the possiblity of liquidating the tension in the centre.  All  pretty vague, really.  But uppermost in Black's mind was the K-side attack - if White's central counterplay could just be contained.  Black hopes at some point to 'get in' ...Bxh3; gxh3 Qxh3.",
        "17. Bd1": "It seems a bit risky to remove the bishop from the defence of the K-side, and for that matter the d-pawn, but White clearly aims either to reoccupy the a2-g8 diagonal by Bb3, or to pin the c6-N by Ba4.  Black didn't feel to sorry to see this and played...",
        "17... Rfd8": "Hoping to encourage the bishop to move again.  This rook manoeuvre is a temporary measure only, with the idea of going back to f8 (or maybe g8) later on.  The b8-R stays where it is to protect the b7-pawn from attack.",
        "18. Bb3": "Perhaps 18.Ba4 was more aggressive, or 18.b4.  But after the move played, Black judges it high time for the K to vacate the dangerous diagonal.",
        "18... Kh7": "But now 19...Bxh3! has become a real threat!",
        "19. Kh2": "(!) Well judged!  Black had indeed been hoping at last to get in his attack.  For instance 19.Rf1? Bxh3! 20.gxh3 Qxh3 21.Bd1 g4 with a strong attack.",
        "19... g4 20. hxg4 Bxg4 21. Ng1": "(!) Defending well.  Makes way for f2-f3, channelling Black''s attack, but also providing the route by which reserves can be called up betimes, as will soon become apparent.",
        "21... Rdf8": "(!?) With the idea of advancing his own f-pawn.  However, it seems that 21...Nf8!? was a good alternative, threatening ...Ne6.  After 21...Nf8 22.f3! Ne6 23.Qf2! Bh5 (24.Qh4 Bf7) the position remains murkily unclear.",
        "22. f3": "(!)",
        "22... Be6": "It seems that White has seen off Black's K-side attack...",
        "23. Ne2 Nh4": "\"Once more unto the breach, dear friends, once more!\"  Is this too soon?  Black has in mind the potential fork at f3...",
        "24. Reh1": "(!) Mysterious - but good!",
        "24... Bh3": "(!?) Black is back!  If, now, 25.gxh3 Nxf3 .  How should White defend?",
        "25. Qf2": "(!!) Obvious now, but during the game I had completely overlooked this move.  Black now has two pieces 'en prise', and White's defences look solid.  Has Black overreached himself?",
        "25... Bxg2": "(!) \"The wine has been drawn, and now must be drunk.\"  There's nothing for it but to go on.  ",
        "26. Qxh4 Bxf3": "(!)  At first sight, 26...Bxh1 seems better, picking up rook for two pieces.  But I didn't like the look of 26...Bxh1 27.Kxh1 Rbe8 (say) 28.d4! exd4 29.Nexf4 with a great game for White.  The move played picks up a second pawn for the piece, leaving Black with two passers and a reasonable amount of counterplay.  All the same, White must have the edge here.",
        "27. Rhe1 Bxe2 28. Rxe2 Nd4": "Black attacks the e2-R, threatens a fork at f3, and hopes that doubling White pawns on the b-file (...Nxb3) will help devalue White's material edge...  White's reply looks obvious, but there is a remarkable continuation available here that would have set Black very difficult problems...",
        "29. Rf2": "(!?)  OK, but White had this: 29.Rxc7! Qxc7! 30.Nxc7 Nf3  (30...Nxe2?)  31.Kh3 Nxh4 32.Kxh4... White looks to have the better game in this line.",
        "29... c6 30. Nc3 Nxb3": "Breaks up White's pawns, and hopes to snap up the d-pawn, restoring at least the material balance.  I felt that White retained an edge, though, however marginal.",
        "31. axb3 Rf6": "(!?) 31...Qxd3!? at once was probably playable, but I was a bit concerned about protecting g7, and also about the possibility of a battery should a WR land on d1.  However, the latter proves something of a mirage: 31...Qxd3!? 32.Rd1? Bf6! 33.Qg4 Qg3 !! 34.Qxg3 fxg3  35.Kxg3 Bh4! 36.Kxh4 Rxf2.  With R 2P for B N Black would have had attractive prospects.",
        "32. Rg1 Rd6": "There's no saving the d3-pawn now!",
        "33. Na4": "(?!) Indirectly defending the d-pawn (33...Rxd3?? 34.Nc5) and hoping to re-mobilise the N via c5.  Yet this struck me as a slight misjudgment, the first real chink in White's armour.  After Black's response, White found it difficult to remobilise his knight.  Maybe 33.Ne2 was an improvement.",
        "33... b6": "(!)",
        "34. Rfg2": "(!?) A bold decision, to leave Black's f-pawn free to run in order to bring pressure on Black's sensitive spot at g7.",
        "34... Rg8": "The irony of it!  Now White is attacking on the K-side whilst Black seeks counteraction in the centre.  What a game!",
        "35. Qh5 Rxd3": "(!) Fearing neither 36.Qg6 ?? Kh8 37.Qh5 (to defend h3) ...Rxd2 or 36.Qf5 ? Qxf5 37.exf5 f3!",
        "36. Bc3": "Defends the bishop and attacks the e5-pawn.  But how is the WN to get back into action?  On the other hand, how is Black to defend e5?",
        "36... f3": "(!) The answer is: by attacking.  White is to be allowed no time to take on e5, nor to exploit the pin along the g-file.",
        "37. Rg2g3": "37.Rf2 cripples White's own attack, though the move was playable.  White tries to maintain his pressure...",
        "37... f2": "(!) ",
        "38. Qg6+ Kh8 39. Rf1": "White has to desist.  39.Bxe5?? lost quickly.  ",
        "39... Rf8 40. Qg4 Rf4": "40...Qxg4 41.Rxg4 seemed to offer little for Black.  ",
        "41. Qxd7 Rxd7 42. Kg2 Rxe4": "Now Black will keep his 3P for the N (after the f-pawn drops). Though White's remaining pawns comprise only the isolated doubled b-pawns, I was still a bit worried about White's active pieces, especially once the a4-N came back into action.  Probably the game is about even here, but I was inclined to a pessimistic view.  Normally I like having the pawns, but propects looked unpromising here.",
        "43. Rxf2 Kh7 44. Rgf3 Kg8": "To keep the enemy rooks out of f7.  Had White now played 45.Rg3 now, I would probably have played ...Kh7 and offered a draw.",
        "45. Kh3 c5": "Locking down White's Q-side.",
        "46. Rg3": "...But maybe White ought hereabouts to have looked into mobilising his N, by playing 46.Bd2, 47.Nc3.",
        "46... Kh7": "Still happy with a draw...",
        "47. Kg2 Rh4 48. Re2 Rh5 49. Rge3": "Besieging Black's e-pawn.  In turn, Black doesn't want to be reduced to complete passivity by ...Re7.  What else can Black try?",
        "49... Rg5+ 50. Kf2 h5": "(!) White wants more than a draw.  Black looks for active counterplay rather than passive defence.  This pawn advance has more than one purpose...",
        "51. Bxe5": "(?)  The one real mistake of the game, which up until now has been roughly even, with maybe a marginal edge to White at times.  Now the balance shifts to Black, though by how much remains to be seen.",
        "51... Rf7+": "The ensuing sequence is forced.  White must lose the exchange.",
        "52. Ke1 Rg1+ 53. Kd2": "... and now we see why Black's 50th had a defensive component.",
        "53... Bh6": "There's nothing to be done about the pin.  White will be left with B N vs R 2P - still a rough material equality, but the isolated doubled b-pawn group is a real handicap.  White has to rely on piece activity to stay in the game.  And that's the rub, for Black.  If those pieces get really active they could prove very dangerous.  Here follows a period of intricate manoeuvring.",
        "54. Nc3": "(!) Cutting his losses.",
        "54... Bxe3+": "(!?) Maybe 54...Rd7  is more precise?",
        "55. Rxe3": "The upside for White is that now he has all his pieces in action.  Black's advantage, though real, seems miniscule.",
        "55... Kg6 56. Re2 Rg4 57. Rh2 Rd7+ 58. Kc2": "(!) Not 58.Ke2? (or Ke3) Re7 or 58.Ke1? Rb4.",
        "58... h4 59. Ne2 Kf5": "For the next 10 moves Black probes on the K-side, looking for a way through.  White seems to have few problems holding Black out.",
        "60. Bc3 Rh7 61. Kd3 h3 62. Ke3 Rgh4": "Maybe now was the time to mobilise the Q-side.    This move doesn't look especially forceful...",
        "63. Kf3 Rf7 64. Bd2 Rd7 65. Be3 Rd3 66. Nc1 Rd8 67. Kg3 Rg4+": "Not so much hoping for 68.Kxh3?? Rh8 and mate next, as to drive the WK back to the f-file.  There's clearly nothing doing on the K-side for Black, but in order to start operations on the other wing, Black will have to regroup: one rook to protect the h-pawn, one to occupy and interdict the d-file.",
        "68. Kf3 Rh8": "The only means of protecting the h-pawn that is consistent with Black's plan for regrouping.",
        "69. Ne2 Rgh4 70. Nf4 Rh4h6 71. Ne2 Rd6": "Completing the regrouping.  Fortunately for Black, his opponent has been in the meantime unable to initiate any worthwhile counterplay.",
        "72. Nf4 a6": "(!)  At last!  The h-pawn is a goner, of course, but with it will go a pair of rooks - not an undesirable thing from Black's point of view.",
        "73. b4": "(!?) A move difficult to judge.  Probably played in anticipation of 73.Rxh3 Rxh3 74.Nxh3 Rd3.  ",
        "73... cxb4": "(!) It so happened I had intended ...c4 here, but forgot when the position appeared (I hadn't really expected 73.b4).  Of course the move played is the better choice.",
        "74. Rxh3 Rxh3+ 75. Nxh3 a5 76. Nf2 a4": "Black's pawns storm down the Q-side.  Judging by the material balance, the situation would look drawish, but I had a lot of confidence in those Q-side pawns.  Can White hold?  I was beginning to think Black could win this!",
        "77. Bc1": "The alternative was 77.Ne4 Rd3 78.Ng3  Kg6! 79.Ne2 Rb3 etc.  The move played seems the more resilient.",
        "77... Rc6": "(!) ",
        "78. Nd3 a3": "(!) The first tactical shot of the endgame!  There will be more.",
        "79. bxa3 bxa3 80. Ke3": "White could not take again on a3 owing to 80.Bxa3? Rc3 picking up a piece and winning.",
        "80... a2": "So close!  Surely White must quickly be doomed?  Not so.  White little army prove to be stout defenders.  ",
        "81. Bb2 Rc2 82. Bd4": "White's pieces are centralised, yet well with reach of the decisive theatre of war.  Meanwhile, Black's K is far from the scene of action.  Is White OK after all?",
        "82... b5 83. Nb4 Rg2": "Hoping to break up White's harmonious defence by inducing 84.Kf3? Rg4! 85.Nc2 Rxd4!! 86.Nxd4  Ke5 and if 87.Nb3 Kd5 or 87.Nc2 b4! 88.Na1 Kd4 wins.",
        "84. Bh8": "Nothing doing.",
        "84... Rg3+ 85. Kd2 Rg1 86. Nc2": "(!?) A crucial decision.  Well, I thought so, at the time.  At this point I was worried that White might be tough-minded enough to try 86.Nxa2 Rg2  87.Kc3 Rxa2 88.Kb4  leaving Black with a R b-P vs B endgame - notoriously difficult to win.  I spent quite a bit of time on this ending after 88...Ra8 89.Bg7 (say) Ra7 90.Bd4 Rb7.  Black's plan would then be to bring the K over to defend the pawn (no trivial task when the WK has access to c5!), so that the rook would then be free to clear a path to the queening square.  As it transpired, the game would have been winnable, but the process would have been a long one.",
        "86... Rb1": "Threatens ...b4.",
        "87. Na1 Ke4": "Bringing in the reserves.",
        "88. Kc2 Kd5 89. Nb3 Rh1": "Once again threatens ...b4.  White tries to hold this up for as long as he can.",
        "90. Bc3 Rh2+ 91. Bd2": "If instead 91.Kd3, Black can play ...b4 at once (92.Bxb4 Rb2! 93.Kc3 Rxb3 ) or 91...Rh3  92.Kc2 b4! 93.Bg7 Kc4 etc.",
        "91... Rh3 92. Bc3 b4": "(!) A tactical shot similar to the last note to clear Black's path.  93.Bxb4 Rxb3 wins quickly.",
        "93. Bb2": "(!) ",
        "93... Kc4 94. Nd2+ Kb5 95. Nb3 Rh2+ 96. Kc1": "Slowly, White is being driven back.  The bishop has to be preserved.",
        "96... Rg2": "(!) Purely a waiting move, to place White in \"Zugzwang\".  Had Black played at once 96....Ka4, 97.Nc5  would have driven him back, since the a3-square is inaccessible.  But now White has to slacken his guard over that square.",
        "97. Bh8 Ka4 98. Na1": "Now if 98.Nc5 Ka3, end of story.",
        "98... b3 99. Bd4": "To guard g1, and prevent 99...Rg1  100.Kb2 Rb1  101.Kc3 b2 (or 101...Rxa1).  If 100.Kd2 Rb1 wins just the same.",
        "99... Kb4": "(!) Another waiting move, to force the removal of the bishop's ward on g1.  But isn't the simpler 99...Rh2 just as effective, since there can be no posssible guard against Rh1 ?  There is a slight difference: 99...Rh2? 100.Bb2 Rh1  101.Kd2 Rb1 102.Kc3 (=).  Black's 99th move prevents the WK reaching the c3-square.",
        "100. Bb2": "Now that White has been driven in to his last lines of defence, Black launches the final assault.",
        "100... Rg1+ 101. Kd2 Rb1 102. Bc3+ Kc4 103. Bh8 b2": "Having opened with a Great Snake, there is something python-like about this final image: the dark diagonal forming the slender body, and the jaws agape, about to engulf the White knight.  \r\nThere's no stopping the pawns now.  After, say, 104.Nc2 Black had the pleasant choice of the spectacular: 104...Rd1 ! 105.Kxd1 b1=Q ; or the simple: 104...a1=Q 105.Nxa1 bxa1=Q 106.Bxa1 Rxa1 with an elementary K R vs K win.   Of course I would have gone for simple.  White resigned at this point. (0-1)"
    },
    "url": "https://gameknot.com/annotation.pl/great-snakes-batman-a-100-mover?gm=18341",
    "gameName": "\"Great Snakes, Batman! A 100-mover!\"",
    "players": "sago (1964) vs. ionadowman (2024)",
    "opening": "Robatsch (modern) defence (B06)"
}