{
    "moves": {
        "1. d4 Nf6 2. c4 e6 3. g3 Bb4+ 4. Bd2 Qe7 5. Bg2 Nc6 6. Nf3 e5 7. dxe5 Nxe5 8. Nxe5 Bxd2+ 9. Qxd2 Qxe5 10. Nc3 O-O 11. O-O d6 12. Rfe1 Qc5 13. Nd5 Nxd5 14. cxd5 Qb6 15. Rac1 Bd7 16. Rc3 c5 17. dxc6 e.p. Bxc6 18. Bxc6 bxc6 19. Rec1 c5 20. Rb3 Qa6 21. Ra3 Qb6 22. Rb3 Qa6 23. Ra3 Qb6 24. Rd3 Rad8 25. b3 Qc6 26. Rd5 Rfe8 27. e3 h6 28. Qd3 Qc7 29. Rd1 Re6 30. e4 Rc8 31. Rxd6 Rxd6 32. Qxd6 Qxd6 33. Rxd6 c4 34. bxc4 Rxc4 35. Ra6 Rxe4 36. Rxa7": "This is an ending played by two players whose names will not be found amongst the all-time greats. Despite this, White's play was superb, and although he had some help from his opponent, the final stages of the ending make it worth its place in this book. The position should be a draw, of course, as Black can transfer his rook behind the passed pawn. Initially, he does just that, but soon he is tempted from the path of righteousness, and eventually pays the inevitable price for his sins.",
        "36... Re1+": "36 ...Re2! (Sadler) is probably more accurate, when the attack on f2 slows down White's plan of bringing his king over to the queen side.",
        "37. Kg2 Ra1 38. h4 g6 39. Kf3 Re1": "Although this move does not lose, it makes Black's life more difficult, by permitting White to transfer his rook\nto the side of the passed pawn. The standard way to draw the position would be 39 ... h5 followed by ... Kg7-f6. However, even here, there are a few subtleties that Black needs to be aware of. The theory of this ending has recently been updated, following some detailed researches by a Swiss player, Johannes Steckner, augmented by Grandmasters Muller, Dautov, Dvoretsky and others. I can recommend the section in the second edition of Dvoretsky's Endgame Manual for a detailed summary of their findings.",
        "40. Rd7": "White immediately seizes the opportunity to transfer his rook to a better location, alongside the pawn.",
        "40... Kg7 41. Rd2 Kf6 42. Re2": "And now he also cuts off the black king.",
        "42... Rd1 43. Ke3": "Now White's plan is clear. He will gradually bring his king over to the queenside, by sheltering the monarch\nbehind the rook. Black must meet this by preparing counterplay on the kingside, which White will necessarily have to abandon in order to carry out his plan.",
        "43... Kf5 44. Rd2 Rc1 45. Kd3 Kg4 46. Rc2 Rd1+ 47. Ke2": "Biding his time for the moment. After 47. Kc3 Black will start counterplay with 47. ...f5!. Fine then continues the variation 48. Kb3 Rb1+ (the immediate 48. ...f4 allows 49. Rc4) 49. Rb2 Re1 50. a4 f4 51. gxf4 Kxh4 52. a5 Kg4 53. a6 Re8 with a draw. This appears correct, although it is close, e.g. 54. Kc4 h5 55. Rb6 Kxf4 56. Rxg6 Re2 57. Kb5 Ra2 58. Rh6 Kg5 59. Rh8 h4 60. f4+ Kg4 61. f5 Rb2+ 62. Kc4 Rc2+ 63. Kd4 Rc7 64. f6 h3 65. Rg8+ Kf3 66. Rg7 Rc8 etc.",
        "47... Ra1 48. Ke3 Re1+ 49. Kd2 Ra1": "Fine does not make clear whether he thinks this is the decisive error, but I believe it is. Fine analyses 49 ...Re5! as the clearest way to draw. It seems rather illogical to switch the rook back in front of the enemy passed pawn, but with his king so far advanced amongst White's kingside pawns, Black has just enough play to draw. Fine's analysis, in which neither I, nor my silicon assistants, have been able to find any flaws, runs as follows: 50. a4 f5 51. Ra2 Ra5 52. Bc3 f4 53. Bb4 Ra8 54. Ra3 Rb8+! \nBlack's counterplay has hit a temporary brick wall, so there is no time to lose. The rook switches roles yet again, returning to the counterattack 55. Kc5 Rb2 56. a5 Rxf2 57. gxf4 Rxf4 58. a6 Rf8 59. a7 Ra8 60. Kc6  61. hxg5 (Fritz initially thinks 61 h5 offers better winning chances, but after 61...Kxh5 62. Kb7l Rxa7+ the tablebase confirms that the position is a draw, whichever way White recaptures on a7) 61...hxg5 62. Bb7 Rxa7+ 63. Kxa7 Kf4 64. Kb6 g4 65. Kc5 g3, and the position is a draw.\n\nAnother try here is Sadler's 53. Ra3 (instead of 53. Kb4). The idea is to try to induce Black to exchange on g3, which stabilizes White's kingside. Even so, it seems that Black can hold, after 53. ...Ra8 54. Kd4  Rd8+! (not 54. ...Ra5 55. Ke4 h5 56. gxf4 Kxh4 57. Ra1 and White looks to be winning) 55. Ke5 Rd2 56. gxf4 Rxf2 57. a5 Rxf4 58. a6 Rf8 59. a7 Ra8 60. Kf6 g5! 61. hxg5 hxg5 62. Ra4+ Kh5 and draws.",
        "50. Kc3 g5": "This is a further mistake, after which Black is definitely lost, although it takes some study-like play by White to prove it. Clearly, Black should have played so .. .fs. Fine merely writes that this \"was better\", without analysing further, or saying whether it is sufficient to draw. \n\nBy comparison with the position  examined in the note to White's 47th move, here Black's rook is on a1 rather than d1. This allows White to gain a tempo with 51. Kb2 (51 Kb3 Rb1+ is the line examined in the note to White's 47th) and it seems to me that White is now winning. Compared with the line after White's 47th, here the white rook is excellently placed on c2, because he can always answer Black's .. .f5-f4 break with Rc4. This appears to hold up Black's counterplay enough for White to win, e.g. 51. ...Re1 52. a4 Re6 53. Kb3 Kf3 (53. ...Rb6+ 54. Ka3 f4 is still met by 55. Rc4, e.g. 55. ..g5 56. a5 a6 57. Kb4 and Black has no real threats on the kingside) 54. a5 f4 55. gxf4 Kxf4 56. Kb4 g5 57. hxg5 hxg5 58. Ra2 Re8 59. a6 Ra8 60. Kc5 with a simple win - Black has no counterplay.",
        "51. hxg5 hxg5 52. Kb2 Re1 53. a4": "Now Black's counterplay is a couple of tempi slower, and there is also one less pawn each on the kingside, which enables White to squeeze out a win.",
        "53... f5 54. Kb3 f4 55. gxf4 gxf4": "See the last note - compared with earlier variations, there is no white hpawn, about to drop, and no black hpawn, about to become a dangerous passed pawn.",
        "56. a5 f3 57. a6 Kh3": "Obviously, Black's only hope is to give up his rook for the a-pawn and win the white f-pawn with his king. In\norder to do this, Black needs to sacrifice on a7, at a moment when White must recapture with the rook.",
        "58. a7 Re8 59. Ra2 Ra8 60. Kc4 Kg2": "Now we begin to see White's problem. If his king strays too far towards the a-pawn, Black will be able to sacrifice on a7 and draw the resulting king and rook vs king and pawn position.",
        "61. Kc5": "61. Kb5? Rxa7 62. Rxa7 Kxf2 is a draw, whereas after the text, the white king is close enough to get back and stop the f-pawn, after 61. ...Rxa7 62. Rxa7 Kxf2 63. Kd4 Ke2 64. Ra2+ Ke1 65. Ke3.",
        "61... Rc8+": "This is obviously the only chance, else White simply marches his king to b7 and wins the enemy rook, whilst his own rook defends the f-pawn.",
        "62. Kb6": "It looks as though Black must resign, but now he reveals that he still has another shot in his locker.",
        "62... Re8": "Now Black is prepared for lateral checks after 63. Kb7 Re7+ 64. Kb8 Re8+ etc., whilst his rook is also ready to come to e2, in certain circumstances.",
        "63. Kc6": "A magnificent move, which places Black in zugzwang. The obvious way for White to proceed is 63 Rc2, preparing to use the rook to shelter his king against the lateral checks. Thus, a waiting move such as 63. ...Kf1? would fail to 64. Kb7 Re7+ 65. Kb8 Re8+ 66. Rc8 and the a-pawn queens. After the further moves 66 ...Rxc8+ 67. Kxc8 Kxf2 68. a8Q White wins the resulting queen vs bishop's pawn position, because the pawn is only on the sixth rank rather than the seventh. \n\nLikewise, not the immediate 63 ...Re2? when 64. Rxe2 fxe2 65. a8Q+ is check - a crucial detail. However, Black can instead defend after 63. Rc2 by 63 ...Re6+! 64. Kb7 Re2!. Now this is playable, since the white king blocks the long diagonal, so 65. Rxe2 fxe2 66. a8Q is not check, whilst 65. a8Q Rxc2 is also a draw. After 63 Kc6!! Black has no choice but to wait with his king, whilst maintaining the attack on the f-pawn.",
        "63... Kf1": "At first sight, it may not be obvious why this makes any difference to White's dilemma, but we will see that it does. The rook checks 63. ..Re6+? 64. Kd7 and 63 ...Rc8+? 64. Kb7 both lose at once. Similarly, 63 ...Re2? fails to 64. a8Q, since the rook on a2 is defended; the Re2 idea only works when White has brought his rook to c2, where it is undefended.",
        "64. Kb7 Re7+ 65. Kb6 Re8 66. Rc2": "Now we see the difference. The threat is 67. Kb7 Re2 and now 68. Rc1+! which is why the king stands badly on the back rank. Consequently, Black must return his king to g2.",
        "66... Kg2 67. Kc7": "It is still too early for 67. Kb7? Re2 but after the text, Black once again finds himself in zugzwang.",
        "67... Re7+": "As we know, moving the king to the back rank loses after 67 ...Kf1 68. Kb7 Re2 69. Kcl+!, whilst 67. ...Re2? 68. Rxe2 fxe2 69. a8Q+ is again check. Moving the rook off the e-file, for example with 67. ...Rh8, deprives Black of the resource ..Re2, so now 68. Kb7 Rh7+ 69. Kb8 Rh8+ 70. Rc8 wins. The only other king move is 67. ...Kh2, but now the king does not attack the f-pawn, and Black is a crucial tempo too slow after 68. Kb7 Re2 69. R6 Re8 70. a8Q Rxa8 71. Kxa8 Kg2 72. Rc2 etc.",
        "68. Kb8 Re8+ 69. Rc8 Rxc8+ 70. Kxc8": "And, as we know, this is a theoretical win.",
        "70... Kxf2 71. a8=Q": "And, as we know, this is a theoretical win.",
        "71... Ke3 72. Qd5 Kf2": "After 72. ...Ke2 White forces the king in front of the pawn by 73. Qe4+ Kf2 and then brings up his king.",
        "73. Kd7 Kg3 74. Ke6 f2 75. Qh1": "A really magnificent endgame by Alatortsev. His conduct of the final stage, with rook and two pawns against rook and one, is a model of precise calculation, and illustrates very well the subtleties that can be concealed\nin an outwardly simple position."
    },
    "url": "https://gameknot.com/annotation.pl/great-endgames-series-rook-endings?gm=52314",
    "gameName": "Great Endgames Series - Rook Endings",
    "players": "Vladimir Alatortsev  vs. Vitaly Chekhover ",
    "opening": "Catalan opening (E00)"
}