{
    "moves": {
        "1. Nf3": "Main annotations taken from Steve Giddins excellent 'Greatest Ever Chess Endgames'",
        "1... d5 2. d4 Nf6 3. c4 e6 4. Nc3 Be7 5. Bg5 h6 6. Bxf6 Bxf6 7. e3 O-O 8. Qc2 c5 9. dxc5 dxc4 10. Bxc4 Qa5 11. O-O Bxc3 12. Qxc3 Qxc3 13. bxc3 Nd7 14. c6 bxc6 15. Rab1 Nb6 16. Be2 c5": "This position looks extremely equal,  but in fact, White has a small plus: he can attack the cs-pawn in short order  and assume some initiative as a result. This should result in his pieces being a little more active than Black's. Even so,  it is desperately hard to imagine White winning the position, against a worldclass opponent, and without the aid of a crude mistake from the defender.",
        "17. Rfc1": "An extremely subtle move, which  would not enter many players' heads. Karpov intends l:!bs, but at the moment, this runs into ... i.a6. The rook moves to free fl, so that White can play 'itf1, to defend the  bishop on e2. The question then i s where should the rook move to? Most players would choose the open file, but Karpov understands that Black may start counterplay by attacking the c3-pawn with ... tt:la4 or ... tt:lds, so he overprotects the pawn, in anticipation.",
        "17... Bb7 18. Kf1 Bd5": "18 ... i.c6 would have prevented White's next, but then 19 tt:les is unpleasant, when the knight can attack\nthe cs-pawn from d3.",
        "19. Rb5 Nd7": "Now we see another reason why Karpov put his rook on cl - after 19 ... i.xa2? 20 c4! the enemy bishop is lost!",
        "20. Ra5": "White has achieved his first aim. His rook is now very active on as, attacking both of Black's isolated pawns, and tying his pieces down to defence.",
        "20... Rfb8 21. c4 Bc6 22. Ne1": "The manner in which Karpov coordinates his pieces is beyond all praise. The knight heads for d3, from  where it attacks 􀃲weakness on c5 and at the same time 􀃱ents the black rook taking up an active post in the white position, on b2 or (as we will see) b4. This is the true meaning of prophylaxis - it is about more than simply taking defensive measures against the enemy's threats, and instead involves finding ways to improve one's  own position,  whilst at the same time defeating the enemy's plans.",
        "22... Rb4 23. Bd1": "Another prophylactic manoeuvre. Karpov anticipates the threat of 23 ... l:ta4, exchanging off White's active\nrook Now nothing can stop the temporarily active black rook from being driven back by lt:ld3. ",
        "23... Rb7 24. f3": "24 lt:ld3 lk7 indirectly defends the c5-pawn for the moment, because of the tactic 25 lt:lxc5?? lt:lxc5 26 .l:i.xc5 .i.xg2+. Karpov calmly eliminates this possibility, whilst at the same time limiting the scope of the enemy bishop and freeing his own king from the defence of g2. The c5-pawn is not going anywhere.",
        "24... Rd8": "If he tries to defend the c-pawn with  24 ... .l:.c7 2 5 lt:ld3 .i.b7, then 26 .i.a4 wins it anyway.",
        "25. Nd3 g5": "Black seeks counterplay, by preparing ... g5-g4, to attack White's kingside structure and open the g-file.",
        "26. Bb3": " Another very typical Karpov move. If  he takes the pawn at once, then after 26 lt:lxc5 lt:lxc5 27 .l:!.xc5 Black has the  remarkable resource 27. ..If. b2! ? 28 .l:!.xc6 :dd2 with surprisingly strong counterplay, despite the piece deficit. Rather 1than allow his opponent to fish in such murky waters, Karpov calmly seals up the b-file, before helping himself to the first fruits of his superb play.",
        "26... Kf8 27. Nxc5 Nxc5 28. Rxc5 Rd6": "Finally, White has won the c5-pawn, without allowing any active counterplay.  The next stage is to  onsolidate and start on the process of converting his advantage.",
        "29. Ke2 Ke7 30. Rd1": "Exchanging pieces is generally a  good idea when material up, especially when there is still plenty of material on the board.",
        "30... Rxd1 31. Kxd1 Kd6 32. Ra5 f5 33. Ke2 h5": "Black continues to seek active counterplay on the kingside.",
        "34. e4": "Karpov immediately tries to take  advantage of the weakening of the enemy kingside pawns. This move involves exchanging two pairs of pawns, which in principle is not necessarily to the stronger side's advantage. It also  gives Black a passed pawn on the e-file, which may be a source of counterplay. On the other hand, at the end of the process, the black h-pawn will be vulnerable.",
        "34... fxe4 35. fxe4 Bxe4 36. Rxg5 Bf5 37. Ke3": "Panchenko suggests that White  should fix the h s-pawn with 37 h4 but Karpov was presumably reluctant to\ngive the enemy bishop a secure post on g4.",
        "37... h4 38. Kd4 e5+ 39. Kc3 Bb1 40. a3 Re7 41. Rg4 h3": "The game way adjourned around  this point, an􀃰the remaining moves were influenced by overnight analysis.",
        "42. g3 Re8": "The passed pawn can be blockaded  securely enough after 42 ... e4 43 􀅂dl. Instead, Kasparov transfers his rook to the f-file, to invade via f2 or fl.",
        "43. Rg7": "One might have expected Karpov to go after the h-pawn, so as to eliminate the counterplay this pawn might offer. Indeed, after 43 .l:.h4 .l:lf8 44 .l:.xh3 l:tf3+ 45 <i;;b2 it is not obvious how Black can exploit the temporary misplacing of  White's rook. However, White's pieces have lost coordination, and his king is cut off, and Karpov's adjournment analysis had presumably convinced him that an easier win was to be had by reating another passed pawn of his own on the queenside, and playing actively.",
        "43... Rf8 44. Rxa7 Rf2 45. Kb4 Rxh2 46. c5+": "Now we can see the difference from the variation given in the last note. Here, all of White's pieces are xcellently coordinated, supporting the passed c-pawn.",
        "46... Kc6 47. Ba4+ Kd5 48. Rd7+ Ke4 49. c6": "The path of the c-pawn has been  cleared of obstacles, and the end is now not far away.",
        "49... Rb2+ 50. Ka5 Rb8": "50 ... h2 loses to 51 C7 hl'i¥ 52 .i.c6+.",
        "51. c7 Rc8 52. Kb6 Ke3": "Threatening 5 2 ... h2,since the square h7 is no longer available to White's rook.\n",
        "53. Bc6": "Now the bishop takes over the task of covering the h-pawn, and the only way to close its diagonal is to put a black unit on e4, which will give the white rook the h7-square again.",
        "53... h2 54. g4": "Accuracy to the very end. After Karpov's phenomenal play, it would have been an absolute tragedy to have fallen into the trap 54 􀀺b7 l:th8 55 c8'ii'?? l:.xc8 56 􀀺xc8 i..f5 when Black draws, e.g. 57 i..h 1 e4! 58 a4 Wf2 59 i..xe4 i..xe4 60 .l:td2+ 􀀺xg3 61 !:txh2 􀀺xh2.",
        "54... Rh8 55. Rd1 Ba2 56. Re1+": "56 􀀺b7 .i.e6 continues the resistance.",
        "56... Kf4": "If 56 ... Wf2 then simply 57 .l:!.xe5.",
        "57. Re4+ Kg3 58. Rxe5 Kxg4 59. Re2": "A really fantastic display by Karpov. It is hard to pinpoint any obvious mistake by Black, yet it is impossible to believe that the starting position was really lost for him."
    },
    "url": "https://gameknot.com/annotation.pl/great-endgames-series-multi-piece-endings?gm=52319",
    "gameName": "Great Endgames Series - Multi-piece Endings",
    "players": "Anatoly Karpov (2780) vs. Garry Kasparov (2851)",
    "opening": "Reti opening (A06)"
}