{
    "moves": {
        "1. Nf3 Nf6 2. c4 c6 3. d4 d5 4. Nc3 e6 5. e3 Nbd7 6. Bd3 dxc4 7. Bxc4 b5 8. Bd3 b4 9. Ne4 Bb7 10. Nxf6+ gxf6 11. e4 Bd6 12. O-O Rg8 13. Qe2 Qa5 14. Nd2 O-O-O 15. Nc4 Qc7 16. f4 c5 17. a3 f5 18. axb4 Nf6 19. Na5 c4 20. Nxb7 cxd3 21. Nxd6+ Rxd6 22. Qxd3 fxe4 23. Qe2 Qb7 24. f5 Nd5 25. Qxe4 Nxb4 26. Qxb7+ Kxb7 27. fxe6 fxe6 28. Rf7+ Kc6 29. Be3 Kd5 30. Rxh7 Nc6 31. Bf4 Rdd8 32. Bc7 Rgh8 33. Rg7 Rhg8 34. Rh7 Rgh8 35. Rg7 Rhg8 36. Rf7 Rgf8 37. Raf1 Rxf7 38. Rxf7 Rc8 39. Be5 Nxd4 40. Bxd4 Kxd4 41. Kf2 a5 42. g4 Rc2+ 43. Kg3 Rxb2 44. g5 a4 45. g6 Rb1 46. Kh4 Rg1 47. Kh5 Kc4 48. Rf4+ Kb5 49. Rf3 Kb4 50. Rf4+ Kb5 51. Rf3 Kb4 52. Rg3 Rxg3 53. hxg3 a3 54. g7 a2 55. g8=Q a1=Q 56. Qg4+ Ka5 57. Qxe6": "Relatively little was known about this type of endgame at the time this game was played, and despite a few inaccuracies in the play, Botvinnik first whole endgame has now been \"tablebased\", it is not always a simple matter to divine the underlying point behind many of the computer's moves. Broadly, we can point out the following rules of thumb:\n1. One of White's main weapons in such endings is the \"cross-check\", i.e . answering a check by  interposing his queen, so as himself to give check, and so force an exchange of queens. This idea lies behind several of the other principles of such endings. \n2. Whilst there are no hard and fast rules as to which positions are won and which are not, it is true to say that the stronger side generally has most winning chances with a centre pawn or bishop's pawn, fewer chances with a knight's pawn, and fewest of all with a rook's pawn. The tablebase confirms that the present position should be a draw with best play. \n3. The stronger side's queen usually takes up a post in the centre of the board, where its influence is at its greatest, and the chance of crosschecks is maximized.\n4. The stronger side should usually try to place his own king on the same or adjacent rank or file as the enemy  king. This maximizes the chance of cross-checks. \n5. With a knight's pawn as here, the defender's king should generally head for the corner diagonally opposite to the pawn's queening square (in other words, the a1-corner in this position). This, too, is motivated by the defender's desire to reduce the chances of cross-checks.\n\nArmed with these basic principles, we will see how Botvinnik handled the ending. It should be noted that he had the benefit of adjournment analysis, of course; and since this was an Olympiad, it can be assumed that his teammates will have contributed. In my opinion, none of this diminishes the value of Botvinnik's achievement in this game.\n",
        "57... Qh8+ 58. Kg6 Qc3 59. g4": "It should be noted that White cannot be prevented from advancing his pawn at least as far as the sixth rank in such positions. This does not mean that the position is lost or that the defender has erred. The real  technical problems for White starts once his pawn gets to the sixth rank.",
        "59... Qd2": "This is a typical example of the application of the principles enunciated above, especially principles (3) and (4). Thanks to the position of his king and queen, White is in a position to meet checks such as 59 ...Qd3+?? with the cross-check 60. Qf5+.",
        "60. g5 Qd4": "Thus far, the tablebase confirms that Black has defended well enough to keep the position within drawing\nbounds, but his last move is an inaccuracy, after which the position is a win for White, albeit in 65 moves. Black has five possible drawing moves here, but the most logical of these, following principle (5) above, is 60 ... Ka4. heading the black king towards the safety zone in the south-west corner.",
        "61. Qf5+": "An inaccuracy in turn. The ruthless tablebase shows that White has only one move to win here, and that is the  rather illogical 61 Kh7, which goes against the principle that the white king should seek a position o in the same or the adjacent file as its opposite number. However, I do not think either player can be reproached for such minor imprecisions, given the huge complexity of such endings. All any human player can hope for is to understand the basic principles and apply them as far as possible; the tactical features of these positions are so great that they are always going to be beyond a human player's capacity.",
        "61... Ka4 62. Kh5 Qh8+ 63. Kg4 Qh1": "Another imprecision, after which the assessment swings over to \"winning\" once again. Of Black's three\ndrawing moves, two involve following principle (5) above and heading his king towards the safe corner: 6. ...Ka3 or 63 ...Kb3.",
        "64. Qf4+": "White finds the most accurate move, underlining the drawback of Black's last. Now his king is forced away\nfrom the safe corner, because 64 ..Ka3? runs into the cross-check 65. Qf3+",
        "64... Ka5 65. Qe5+": "There is nothing wrong with the immediate 65 g6 (indeed, it even wins two moves quicker), but Botvinnik's\nmove is more logical from the human viewpoint - he first puts his queen on a more centralized square, in accordance with principle (3).",
        "65... Ka4 66. g6 Qd1+ 67. Kg5 Qd8+": "Once again, the proximity of the opposing kings means that crosschecks are in the air, both after\n67 ...Qd2+? 68. Qf4+, and 67. ...Qg1+ 68. Kf5! when there are no safe checks. 68. Kf5 Qc8+ 69. Kf4 Qcl+ 70. Qe3 Qc7+ 71. Qe5.  In itself, this move does not spoil anything, but it is the start of a short phase during which Botvinnik loses his way. He should prefer 71. Kg4 or 71. Kg5.",
        "68. Kf5 Qc8+ 69. Kf4 Qc1+ 70. Qe3 Qc7+ 71. Qe5 Qc1+ 72. Kf5 Qc8+ 73. Kg5 Qd8+ 74. Qf6": "We have actually reached the same position as after Black's 67th move. The first time round, Botvinnik found the  most accurate move, 74 Kf5. It should also be noted that the plan of placing the white king in front of his pawn with 74. Kh6? Qh4+ 75. Kg7 is much weaker. This was a lesson that Botvinnik had been forced to learn the hard way, as he had made exactly that mistake in the same ending, against the Soviet master Ravin sky, eight years earlier. The tablebase confirms that the ending is then a draw.",
        "74... Qd5+ 75. Qf5 Qd8+ 76. Kh5 Qe8": "Now there are no more profitable checks, since after 76. ...Qh8+ 77. Kg4, Black once again suffers from his king  being on the same rank as its opposite number. One can see how much easier his defensive task would be if his king were now on a2 or a1, as it could have been, had he taken his chances earlier in the endgame. However, even though he is out of checks, Black is not yet completely out of ammunition. Instead, Minev resorts to another typical defensive technique in such queen endings - pinning the pawn.",
        "77. Qf4+": "A fundamental error of principle, which again endangers the win. This move simply drives the black king\ncloser towards the safe comer, and the tablebase confirms that the position should be drawn after this. Instead, White can win with several continuations, the main one being 77. Kg4. However, the difficulty of such endings is attested to by the fact that the win still takes 60 moves from this position! (However, this does not mean it is a draw - White will, of course, advance his g-pawn again inside the so moves allowance).",
        "77... Ka5": "Returning the favour. It is clear that Minev did not understand the point about where his king was best placed, a forgivable error for his time, but one which makes Botvinnik's task easier. Obviously, the black king should emulate the birds and gratefully migrate to the kinder climate of the south, with 77 ...Ka3! .",
        "78. Qd2+ Ka4 79. Qd4+": "Botvinnik follows principle (3), and takes the chance to centralize his queen with gain of tempo. In so doing,\nhe maximizes its influence, and so reduces the enemy queen's scope for checks.",
        "79... Ka5 80. Kg5": "Now we see the effect of Botvinnik's  piece positioning. Black soon runs out of checks, whilst the superbly placed white queen also controls the next square of the pawn, g7.",
        "80... Qe7+ 81. Kf5 Qf8+ 82. Ke4": "Once again, the possibility of a cross-check means that Black is out of checks, and this time he cannot prevent the pawn advancing further.",
        "82... Qh6 83. Qe5+": "Once again, the tablebase shows that the immediate 83 g7 wins slightly more quickly, but the human instinct is to improve the queen position first.",
        "83... Ka4 84. g7 Qh1+ 85. Kd4": "Another characteristic idea for such endings. With the pawn only one square from queening, the white king\napproaches closer towards its opposite number, to seek the elusive crosscheck.",
        "85... Qd1+ 86. Kc5 Qc1+ 87. Kd6": "Curiously, Mark Dvoretsky gives the note \"87. Kd5?! Qc8!, but the tablebase shows that this wins for White in exactly the same number of moves as the text.",
        "87... Qd2+ 88. Ke6 Qa2+": "88 ...Qh6+ 89 Kd5 is again the end  of the checks.",
        "89. Qd5 Qe2+ 90. Kd6 Qh2+ 91. Kc5": "The final position deserves a diagram, as it perfectly illustrates the elements of the winning method. The\nwhite que􀘖n occupies a dominating central square, also controlling the queening square of the pawn, the two kings stand close together, and all the possible checks are defeated by a crosscheck. Despite a number of inaccuracies, this is a classic endgame, and immensely instructive. Without the aid of either tablebases or any substantial heoretical practice, apart from his own game against Ravinsky years before,\nBotvinnik effectively \"solved\" this ending in his adjournment analysis, identifying all the key elements of the\nwinning method in such positions. "
    },
    "url": "https://gameknot.com/annotation.pl/great-endgames-series-queen-endings?gm=52315",
    "gameName": "Great Endgames Series - Queen Endings",
    "players": "Mikhail Botvinnik (2360) vs. Nikolay Minev (2428)",
    "opening": "Reti opening (A05)"
}