{
    "moves": {
        "1. e4": "My opponent went for kings pawn game.",
        "1... e5": "One of the most popular response.",
        "2. c3": "Ruy Lopez opening or MacLeod Attack.",
        "2... Nc6": "I'm continuing with my development.",
        "3. Bc4": "Attacking f7 square.",
        "3... Nf6": "Attacking his e4 pawn, but...",
        "4. Qb3": "suddenly my f7 pawn is in trouble, and he badly need support.",
        "4... d5": "My mistake, when 5. exd5 Nxf5 6. Bxf5, I cannot take with my Queen, and if 6....Be6? 7. Bxe6 fxe6 8. Qxe6+ and I will lost even more material.",
        "5. exd5": "Normally my opponent went for exchange.",
        "5... Nxd5": "?",
        "6. Bxd5 Qf6": "Here I was thinking if he go for 7. Bxe7+ Qxe7 8. Qxe7+ Kxe7 I would gain my material back. Well I would be a pawn down.",
        "7. Nf3": "My opponent is continuing with his development.",
        "7... Be6": "? Another mistake by me, if he goes for 8. Bxe6 Qxe6 9. Qxe6 fxe6, I would have doubled pawns on e file and I would not gain any material back. One of option in my mind was to offering him a b7 pawn, but if he goes for exchange, I'm in trouble.",
        "8. Bxe6": "My nightmare began.",
        "8... Qxe6": "I have no option. I think 8....fxe6 is even worse.",
        "9. Qxb7": "Opa, I have this move in my mind before, but really I did not pay attention to this move, because my opponent was already in material advantage, and I thought he would go for the Queen exchange.",
        "9... Kd7": "So I say if you are greedy, go and eat my peaces, in meanwhile I will prepare attack on your king.",
        "10. Qxa8": "Ok I have trapped his Queen, she will be there for a while.",
        "10... e4": "Let's go and open some files.",
        "11. O-O": "? Better was 11. Ng5, but then again if 11....Qf5 his Knight is lost anyway. What is the best move here, I leave it open to your comment.",
        "11... exf3": "I took his Knight, and I know what would be his next move. Do you? :)",
        "12. gxf3": "Was this move in your mind? And here I saw some combination, and I went for it. But first his Queen was on a8-h1 diagonal, and I need this diagonal to be free.",
        "12... Bc5": "And the best move to do it, is to donate my rook.",
        "13. Qxh8": "? He must stay on h1-a8 diagonal 13. Qb7",
        "13... Ne5": "I put another trap to my opponent. If he chooses to play 14. Re1 Nxf3+ 15. Kf1 Qxe1# or 15. Kh1 Qxe1+ 16. Kg2 Qxf2+....",
        "14. d4": "? I think he should come out whit his Queen by 14. Qxg7",
        "14... Nxf3+": "15. Kh1 Qh3 16. Bf4 Qxf1# or 16. Nd3 Qxh2# or 16. Qxg7 Qxh2#",
        "15. Kg2": "The best move in this situation.",
        "15... Qg4+": "That is why he need his Queen on g file.",
        "16. Kh1 Nh4": "I don't know why I didn't play 16....Qh3. It would be a faster mate.",
        "17. Rg1": "The only move to prevent mate in next move. Which would come, if I played 16....Qh3",
        "17... Qf3+ 18. Rg2 Qxg2#": "Thank you for watching this annotation. Any comments or rating is welcome. Have a nice day!"
    },
    "url": "https://gameknot.com/annotation.pl/greedy-for-material?gm=34528",
    "gameName": "Greedy for material",
    "players": "deeplal  vs. stojanc ",
    "opening": "KP (C20), Lopez opening"
}