{
    "moves": {
        "1. e4": "A Long Road To Nowhere\n\nThis opponent and I have a long running battle. I always feel I have a chance against him, but it never quite works the way its planned.",
        "1... e5 2. Bc4 c6 3. a3 Nf6 4. Qf3 d5 5. exd5 cxd5 6. Bb5+ Bd7 7. Bxd7+ Qxd7 8. Qe3 Nc6 9. Qb3 Nd4": "Time to start the brave and ambitious stuff ;-)",
        "10. Qd3 Bc5 11. Nc3 e4 12. Qg3 O-O": "I chose to do that first to prevent Qxg7 losing the knight at f6.",
        "13. Kd1": "Which loses me the rook unfortunately but hey ho.",
        "13... Qg4+ 14. Qxg4 Nxg4": "Lets try that on this side.....",
        "15. Nh3 Rad8 16. b4 Bb6 17. Bb2 f5 18. Ne2 Nxe2": "Just wandering about now, poking and seeing what happens. I'm not a great planner as you can tell.",
        "19. Kxe2 h6 20. Nf4 Rfe8 21. Nh3 g5 22. Raf1 Ne5 23. Bxe5 Rxe5 24. a4 Ree8 25. a5 Bc7 26. Rfa1 g4 27. Ng1 Kg7 28. g3 Kg6 29. h3 h5 30. c3 d4 31. hxg4 hxg4 32. Rc1 Be5 33. cxd4 Rxd4 34. b5 Red8 35. Rc2 Rd4d5 36. a6 bxa6 37. Rc6+": "Thats perhaps an error.",
        "37... Rd5d6 38. Rxd6+ Rxd6 39. bxa6 Rxa6 40. d3 exd3+ 41. Kxd3 Ra2 42. Ne2 Ra1": "Thats definately an error, doesn't look like it now, but later on I NEEDED that rook.",
        "43. Rxa1 Bxa1 44. Nf4+ Kf6 45. Nd5+": "I was banking on that extra pawn.",
        "45... Ke5 46. Nb4 f4": "And of course go and hand it straight back.",
        "47. Nc6+ Kf5 48. Nxa7 fxg3 49. fxg3 Be5 50. Nc6 Bxg3": "Got it again, but now his knight is in play rather than chasing down an errant awn on the other side of the board. If he grabs my pawn it doesn't matter whether he loses the knight, a forced mate is out (there is an unforced mate, but this opponent is waaaayyyyy to competitive to co-operate)",
        "51. Nd4+ Kf4 52. Ne2+ Kf3 53. Nd4+ Kg2 54. Ke2 Bf2 55. Nf5 Kg1 56. Kd3": "Cue the dance of the five pieces.....",
        "56... Kg2 57. Ke4 Kh3 58. Kf4 Be1 59. Ke3 Ba5 60. Ke4 Bc7 61. Ke3 Kg2 62. Ke2 Bb6": "A mistake there giving him the opportunity of K-e3 forcing the draw.",
        "63. Nh4+ Kh3 64. Nf5 Bc5 65. Kf1 Bb6 66. Ke2 Kh2 67. Kf1 Bc5 68. Ke2 Kg1 69. Nh6 g3 70. Nf5 g2 71. Nh4 Bf2": "Another mistake but I didn't think it mattered, he had the pawn.",
        "72. Nf3+ Kh1 73. Kxf2": "I'm left with a forced move which sacs my queen *cries*",
        "73... g1=Q+ 74. Nxg1": "I'm sure a better player would have found a way, but pleased just to get a draw."
    },
    "url": "https://gameknot.com/annotation.pl/grey_pandas-mini-tournament-i?gm=48348",
    "gameName": "grey_panda's mini-tournament I",
    "players": "gollum123 (1347) vs. grey_panda (1447)",
    "opening": "Bishop's opening (C23), Philidor counter-attack"
}