{
    "moves": {
        "1. e4": "The Turning Point.\n\nHow I've never lost against this opponent baffles me. He scares the heck out of me every time and did it again here.",
        "1... e5 2. Nf3 Nc6 3. Bb5": "He goes for the Ruy Lopez, which I've always found Kg8-e7 to be rather unsatisfactory, so I try the more adventurous approach....",
        "3... Nd4 4. Nxd4 exd4 5. O-O c6": "Perhaps rather weak, should have started more dev rather than trying to push him back, but as I said, he scares me.",
        "6. Ba4 Bc5 7. d3 a5": "Preparing for g5 to take that bishop out.",
        "8. a3 b5 9. Bb3 Bd6 10. c4 dxc3 e.p.": "Unless a dramatically better move is available I always ep. It just tends to upset people.",
        "11. Nxc3 Qh4": "Optimism is a wonderful thing.",
        "12. g3 Qf6 13. Ne2 h5": "Still trying to create gaps/weaknesses on that kingside.",
        "14. Bf4 h4 15. Bxd6 Qxd6 16. Nf4 hxg3 17. fxg3 Qd4+": "Now I'm reduced to my usual ploy, that of poking and prodding trying to find a mistake rather than any cohesive planning.....",
        "18. Rf2 Nf6 19. Qf3 d6": "Clears the way for K-g4",
        "20. Re1 Ng4": "Now that I thought was a neat little move, with the rook already pinned I could only see good things from this move.....",
        "21. Ne6": "Until I saw the reply which at first glance looked naff, but the closer I looked the more worried I became. The sheer volume of threats is pretty overwhelming. \n\nDirectly of course the queen is under threat, ignoring the pawn at g7, not to mention the mate in one Qxf2 or the fork opportunity at c7, the instinct was BxK, but then BxB and still all sorts of threats. That one move was responsible for about 6 years off my life.",
        "21... Bxe6": "On reflection QxR might have worked as well, but at the time I was scurrying backwards not thinking of attacking. Which is a measure for me of how much that white move terrified me.",
        "22. Bxe6 Qxf2+": "Now, having managed to return my heart rate to something approaching normal, I resume being offensive.",
        "23. Qxf2 Nxf2 24. Kxf2 fxe6": "I end up a rook up, so a more technical analysis will probably show 21 Ke6... as a mistake. But its a tactic I often employ myself. When under the cosh attack back, people get scared, people make mistakes. It doesn't always work of course as in this case, but it really did make me think. When it works it tends to totally throw the other player as their mind dwells on it and they weaken themselves.",
        "25. h4 Kd7 26. Re3 d5 27. e5 Raf8+ 28. Kg2 g5 29. d4 gxh4 30. gxh4 Rxh4 31. Rh3": "I felt the rook exchange there wasn't in white's best interests, which is why I grab it...",
        "31... Rxh3 32. Kxh3 Rf2": "And at that point my opponent decides its a lost cause. But having been there and done it and had it done to me on more than one occasion that 21st move was well worth it. It so nearly paid off and if it had, then kudos for the courage to make it."
    },
    "url": "https://gameknot.com/annotation.pl/grey_pandas-mini-tournament-i?gm=48412",
    "gameName": "grey_panda's mini-tournament I",
    "players": "wijzewillem (1382) vs. grey_panda (1459)",
    "opening": "Ruy Lopez (C61), Bird's defence, Paulsen variation"
}