{
    "moves": {
        "1. e4": "Hi everyone!\r\n\r\nThis is another game in my 1700-1800 mini-tournament group.  Just imagine, you are a pawn up, you are in a 2 piece ending, surely the game is in the bag.  But not always, sometimes the pawn structures can be as such that a gridlock ensues.  It did in this game.  I had the pawn plus but could not seem to be able to do anything with it so I held out the olive branch and my opponent accepted it.  Please bear in mind that epblue's rating was not 1584 at the start, it was 1755 so I only lost 0.4 points out of the low draw.  He kicks off with 1.e4. ",
        "1... e5 2. Nf3 Nc6 3. d4": "3. d4 - the Scotch Opening.  I played this against Coach Ion in the never to be forgotten Battle of the Wings match, the first match against the Coach and the first match I ever annotated on gameknot.",
        "3... exd4 4. Nxd4 Bc5 5. Be3 Qf6": "5. ....... Qf6 - the main line.",
        "6. c3 Nge7 7. Bc4 Ne5 8. Be2": "8. Be2 - a retreat.",
        "8... Qg6 9. O-O d6 10. f4": "10. f4 - pawn stab at my knight, now here comes a clearance of that tangled mass in the centre.",
        "10... Qxe4 11. Bf2 Bxd4 12. cxd4 Ne5g6": "12. ........ Ne5g6 - after that little skirmish I have won a pawn.  However, Glenda looks rather vulnerable in the centre.",
        "13. g3 O-O 14. Nc3 Qf5 15. Bf3": "15. Bf3 - this bishop plugs the gap left by the forced advance 13. g3.",
        "15... d5 16. Re1 c6": "16. ....... c6 - still in the database, the d pawn is backed up and Fou Leblanc can come out.  At least I am now a clear pawn up, but there is still so much wood on the board.",
        "17. Qd2 Re8 18. b4": "18. b4 - pawn roll.",
        "18... a6 19. a3 b5 20. a4 Bb7 21. a5": "21. a5 - white avoids exchanges on the a file - he wants to keep the position closed.",
        "21... Qd7 22. Nd1 Qd6": "22. ...... Qd6 - but I anticipated exchanges of heavies on the e file however.",
        "23. Ne3 Bc8 24. Re2 Nf5 25. Nxf5 Bxf5": "25........ Bxf5 - as a prelude to all this there is a knight trade.",
        "26. Rae1 Rxe2 27. Rxe2": "27. Rxe2 - the first rook trade.",
        "27... Bd7 28. Kg2 Re8 29. Rxe8+ Bxe8": "29. ...... Bxe8 - and now the second.",
        "30. Qe1 Qe7 31. Qxe7 Nxe7": "31. ....... Nxe7 - and now the queens.  You would think this endgame a gimmie for black wouldn't you?",
        "32. g4 Bd7 33. Kg3 Nc8 34. h4 h6 35. f5": "35. f5 - over the last few moves white has moved his king out and rolled up his kingside pawns.  With white having the bishop pair behind his pawns and my extra pawn being backward I find it terribly difficult to form a plan of any sorts here.",
        "35... f6 36. Kf4 Ne7 37. Bg2 Kf7": "37. ...... Kf7 - here I decided enough was enough and offered my opponent a draw which he accepted.  Was there any way for me to convert my advantage, was it another bad draw offer?  You the jury decide."
    },
    "url": "https://gameknot.com/annotation.pl/gridlock?gm=23021",
    "gameName": "Gridlock!",
    "players": "epblue (1584) vs. jstevens1 (1772)",
    "opening": "Scotch (C45), Blackburne attack"
}