{
    "moves": {
        "1. e4": "This game is one of my losses.  I grabbed a pawn in the opening and attempted to hold onto it, against the grain of my bloodletting nature, which eventually caused me mental indigestion to the point that I ruined my own position, which up to move 13 was still quite playable.  In the annotations this miniature is more notable for the psychology rather than any tactical or positional crumpets it offers up.",
        "1... d5": "The Scandinavian has been my main 1. e4 defense for a few generations now, replacing, in descending order, the Robatsch, the Pirc, and the Alekhine as defenses I used to reliably employ.",
        "2. d4": "2. d4!? is a worthy attempt to take black out of his comfort zone and transpose into the Deimer-Blackmar Gambit, something a Scandinavian player is probably either not prepared for or isn't to his taste, especially as black since Scandivanian players are often gambiteers themselves.",
        "2... dxe4": "Other moves are inferior.  Black can tranpose to the Nimzowitsch Defense with 2. ...d5 or 2. ...e5, however why he would want to is beyond me. That opening often leads to positions resembling inferior versions of the French, an opening Nosferatu dislikes even under the best of circumstances.",
        "3. Nc3 e5": "The Lemberger Counter-Gambit, which is more conductive to my palate than going into a Deimer-Blackmar Gambit's comfort zone with 3. ...Nf6 4. f3 exf3 5. Nxf3, with the usual compensation of a pawn for rapid development and open lines.",
        "4. Nxe4 Qxd4": "!? Now 4. ...ed is mainline, and after 5. Bb5ch c6 6. Qe2 Be7 7. Bc4 white has good practical chances and reasonable compensation for the pawn.  I decided on this move because I believed, from an old scroll on the Lemberger I'd read, that black can snatch a pawn here under favorable circumstances without going into complications that may favor white.",
        "5. Qxd4": "5. Bd3 f5 6. Nf3 Qb6 7. Neg5 h6 is the critical line, where white has to sacrifice a piece with 8. Bc4!?, 8. Nf7!?, or Nxe5!? to try and prove anything in the opening.  It can lead to hair-raising positions, but the icy chamber of correspondence chess often douses cold water on them.  White chooses a simpler route instead.",
        "5... exd4 6. Nf3 f5 7. Ned2": "I was a bit surprised, as I expected 7. Ng3, leaving the QB unobstructed and eying the f5 pawn.",
        "7... c5": "A committal decision, but since 7. ...Bf5 fails to 8. Nb3 and 7. ...Nc6 runs into the supremely annoying 8. Bb5 pin, I couldn't see any other way to try to hold onto my extra pawn and thus covert it to an advantage down the line.  Of course, returning it with 7. ...Nf6 followed by ordinary development occurred to me, and is in fact more in my nature as I'm against pawn-grabbing on principle.  But I figured I had a *moral* obligation to try to hold onto the material instead of copping out for an equal but sterile queenless middlegame, as a test to my own defensive skills.  At the moment, however, I'm behind in development, and pawns, like ...f5 and ...c5, cannot move back from no man's land...",
        "8. Bc4 Nc6 9. O-O Be7 10. Re1 Bd7": "A bit unambitious; I could have played 10. ...Nb4 11. Bb3 Nf6, with the idea of centralizing my b4 knight on d5 after a subsequent a3 push by white, though moving the same piece twice in an opening that I was already trailing in development gave Nosferatu nasty blood hives, and I wanted to develop and castle as quickly as possible, since I was nervously eyeing all those open lines white had.",
        "11. Nb3 O-O-O": "Whisking my king to safety and unpinning my bishop so my c5 pawn no longer hangs.  I thought I was doing fine here, and I was for the moment.  I was concerned about incursions on f7 by the enemy KN of course, but thought I had enough resources to handle it.",
        "12. c3": "12. Ng5 Nh6?! is obvious and therefore dubious, when white can take a commanding lead in initiative: 13. Bf4 Red8 14. Ne6 Bxe6 15. Bxe6ch Kd8 16. Rad1 with unpleasant pressure.  Instead (after 12. Ng5), I had the crafty 12. ...Rf8, when after 13. Nf7 b5! 14. Be6 (14. Nxh8? is refuted after 14. ...bxc4 15. Nd2 Nb4!) Bxe6 15. Rxe6 Kd7 16. Rxe7ch Kxe7 17. Nxh8 c5! nets an edge in space to go with my pawn surplus, since I can round up the entombed h8 knight in good time.  In the text, white accepts a deficit in pawn structure to open more lines, which is another good practical decision.",
        "12... dxc3": "Again, in the theme of my bean-counting \"moral obligation\" to hold onto my precious pawn I described in earlier annotation (and surpressing Nosferatu's natural tendencies), I felt I had to play this.  It probably would have been best from a psychological and practical perspective to simply bail out with 12. ...Nf6 here, i.e. 13. cd cd 14. Nfxd5 Bb4 15. Rd1 Rhe8, completing and mobilizing development with a roughly equal position.",
        "13. bxc3": "Now the stage is set for my demise, the first one is tripping on my foot and spraining it, the second is falling on my sword.  I had considered 13. ...h6 and 13. ...Nf6, both of which are eminently playable, although white retains a pull in the position (agreeable compensation for his pawn).  I didn't want to play \"tempo-losing unnecessary pawn moves\" in the case of the former, and didn't want to deal with Nf3-g5-e6 invasiveness in the case of the later, especially with Bf4 sometime thrown in, which would eyeball my vulnerable dark squares on the b8-h2 diagonal.  So naturally, I decide to play something worse.",
        "13... Bf6": "? And here it is, which I thought was the \"active\" alternative, moving my bishop on this cosmetically \"good\" post, eying white's weak queenside point at c3, taking the bishop off the pressured e7 square and preparing ...Nge7, finishing my development.  All techincally true.  However, these \"pros\" are infinitely trivial to the consequences of (a) denying my KN its best post on f6, (b) removing one of the guards (the only guard, actually) of my weak c5 point, and (c) basically giving white an extra move in his acquisition of initiative.",
        "14. Bd2": "After 14. Bb2? b6 I would be in great shape.  Now here I started to hallucinate.  My position is already worse, but I started to imagine unavoidable mating nets swarming around my king if I played 14. ...b6, following 15. Ba6ch, and a gradual sac of white's knight on c5 to open up by b-file for a rook, and in tandem with a convenient Bf4, basically murdering my king on my weak periodontitis-infected queenside.  Actually, things weren't as ruinous as I thought; the initiative is clearly in white's hands, but so long as I avoided opening my b-file and connected my knights eventually with ...Nge7 and maybe brought my bishop back with ...Bc8 I could have defended, and lived to play on.",
        "14... Nb4": "?? One bad move often begets another, especially if you start to regret things that have already happened (as often in life as in chess).  Against, I chose the more \"active\" (and losing) alternative, this time willing to accept two minor pieces for a rook, nevermind that I desperately needed those active deployed soldiers around, whereas white's rook on a1 isn't even doing anything but having its portrait painted.  In my defense I thought I had to play something like this to avoid the thread of the game slipping away completely; quite ironic in retrospect.",
        "15. cxb4 Bxa1 16. Rxa1 cxb4": "I think I wished to stay a pawn to the good for my rook-vs-knight/bishop imbalance, though black is quite lost now.  Still behind in development and now with less coordinated pieces left to do it with, or rather fail at it.",
        "17. Ne5": "No need to bother even with Bxb4 yet when you have such an obvious and strong move.  This centralized knight is key to the collapse of the rest of black's position.",
        "17... b5": "17. ...Nh6 18. Bxb4 Rhe8 19. Nxd7 Rxd7 20. Bb5 or 17. ...Nh6 18. Bb4 Kb8 19. Be7 are unenviable alternatives.  I quicken the end with the further weakening of my queenside squares, the h2-b8 and h1-a8 diagonals lighting up like bulls-eye signs at a carnival.",
        "18. Be2 Nh6 19. Rc1+": "Black resigns.  Mate or catastrophic material loss vis 19. ...Kb7 20. Bf3 Ka6 21. Nc5ch awaits.  Many poor decisions lead to this loss in 19 moves on my part, and I should have had better nerves around the critical 13-14 move juncture.  My \"moral obligation\" to keep the opening pawn was fine independently, however it needed accurate follow-up.  I wish I could have played 13. ...h6 and bode my time instead of rushing into complications (whilst still not fully developed) that in no way favored me.  Sometimes those \"rabbit ears\" (...a6 & ...h6) are in fact the best moves in a defensive position.  This is not a pretty game, but I've taken something away from it."
    },
    "url": "https://gameknot.com/annotation.pl/grilled-on-my-own-lemberger?gm=36394",
    "gameName": "Grilled on my own Lemberger",
    "players": "thissen (1820) vs. -nosferatu- (1819)",
    "opening": "Scandinavian (centre counter) defence (B01)"
}