{
    "moves": {
        "1. c4 e5 2. Nf3 Nc6 3. d3 Nf6 4. Nc3 h6 5. g3 Bc5 6. e3 O-O 7. Nxe5": "!? -- This is a pseudo-sac I play in the Cordell variation of the Spanish, when Black doiesn't immediately retreat his Bishop to b6. Since the opportunity presents itself here, let's see how well it works when played in the English.",
        "7... Nxe5 8. d4 Bxd4 9. exd4 Ng6 10. Bg2 Re8+ 11. Be3 d6 12. O-O Bg4 13. Qc2 c6 14. Rfe1": "Chances appear to be even, so White's 7th move, while perhaps a bit startling at the moment it was played, leads to no particular advantage aside from having a bit more space.",
        "14... Qd7 15. Bd2 Bh3 16. Rxe8+ Rxe8 17. Re1 Rxe1+ 18. Bxe1 Bxg2 19. Kxg2 Qe6 20. Qe2": "White's Bishop plus the space advantage gives him an eensy plus, probably not enough to win. Of course positions like these are winnable with correct strategies and (it must be said) a little help from one's opponent.",
        "20... Ne7 21. f3": "Not only preparing f2 for the Bishop, holding the d-pawn, but also to prevent Black's f6N from getting deeper access into White's position.",
        "21... a6 22. Bf2 b5 23. b3 d5": "I found this invitation to freeze the Q-side a little odd because my strategic sense tells me that's where the game will be decided as a matter of the eventual repositioning of the Kings and pieces for activity in the center.",
        "24. Qxe6": "Getting the ladies off the board reduces the danger of a sudden tactical strike for both sides. Doing it now, before closing the Queenside, allows White to keep his N on the 3rd rank without having to waste a tempo repositioning it there after Black initiates the Q trade, compelling Nxe2.",
        "24... fxe6 25. c5 Kf7 26. b4 Ng6 27. a4 e5 28. axb5 axb5 29. dxe5 Nxe5 30. Bd4 Nd3 31. Na2 g5": "Initiating a minority attack. Not a bad idea, but its soundness is reduced a tad by the fact Black's d3N is undefended and can be attacked.",
        "32. Kf1 Ke6 33. Ke2 Ne5 34. Nc1 g4 35. Bxe5 Kxe5 36. fxg4 Nxg4 37. h3": "I don't want Black too feel too secure about dashing his King toward b4, and the only way to do this is to create a meaningful threat of a passed pawn on the Kingside.",
        "37... Nf6 38. Ke3 Ne4 39. Ne2": "! -- This is a critical moment, and I'm sure some readers will want to know why I didn't play 39. Nd3+, driving Black's King back. Well, the main reason is that driving back Black's King doesn't cure my weakness at b4 which can be attacked in two moves by Black's Knight. Strategically, the more important square for White's Knight is d4, attacking Black's own conspicuous weakling at c6 which can't be defended by Black's King except from d7, so that he gets driven back anyway, and farther away from the passed pawn White can create on the Kingside. And if I capture at c6, then b4 is defended at least for one critical tempo.",
        "39... Ng5": "? -- A small, wolfish smile here: White's h-pawn is nowhere near as important as Black's c-pawn. The correct move, as horrible as it looks and despite the fact Black still may not be able to hold, is 39. ...Ke6.",
        "40. Nd4 Nxh3 41. Nxc6+ Ke6 42. Na7 Ng5 43. Nxb5 Ne4 44. Kf4": "! -- Stopping any hoped-for penetration by Black's King because White's b5N freezes the d-pwan.",
        "44... Nd2 45. Nd4+": "And Black's time expired. Regardless, Black cannot move his King out of check: If Black plays to f6 to stop White's King from penetrating at e5, then the joined passers start rolling with 46. c6 and White's King will eventually penetrate anyway, with options to take out Black's d-pawn, h-pawn, or even both. And if Black plays the King to either e7 or d7, his d-pawn will fall. "
    },
    "url": "https://gameknot.com/annotation.pl/grinding-it-out-part-1-english-blitz-game?gm=48696",
    "gameName": "Grinding it out (Part 1) -- English -- Blitz game",
    "players": "Avocet (1200) vs. monsterandy (1797)",
    "opening": "English, Nimzovich variation (A20)"
}