{
    "moves": {
        "1. e4": "Hi everyone!\n\nMy first annotation of 2016!  Sadly my Big Slump (with the exception of some bright interludes) has persisted.  I simply cannot stop the silly mistakes from happening!  In this game it is no different.  After a solid Philidor Defense I end up losing a pawn without any compo and I did not even notice it was en prise.  Thankfully I kept Henry upright because I somehow ended up in an endgame with opposite coloured bishops and despite losing a second pawn I got away with conceding a Low Draw.  So how did all this happen?  Well, read on ......",
        "1... e5 2. Nf3 d6": "2. ..... d6.  This move gives the opening its name since it was Andre Danican Philidor's favourite.  He would sometimes follow it up with f4 attacking the e4 pawn from a different angle to wrest control of the board from white.  However it didn't quite happen in this game.",
        "3. d4 exd4 4. Nxd4": "4. Nxd4 - after a pawn trade we have the Phildor Exchange Variation.  This will lead to a typical middlegame jstevens1 position (cramp and passivitis!).",
        "4... Nf6 5. Nc3 Be7": "5. ...... Be7 - my pieces come out but my bishops always seem to end up on the second rank!",
        "6. Bc4 O-O 7. O-O c6": "7. ...... c6 - after both sides have castled I now prepare a possible eventual d5.",
        "8. a4 Nxe4 9. Bxf7+ Rxf7 10. Nxe4 d5": "10. ..... d5 - after a wacko last 3 moves I now get an established central pawn.",
        "11. Ng3 Na6 12. c3 Nc7 13. Be3 Bd7": "13. ...... Bd7 - Fou Leblanc joins his twin, Fou Lenoir on the second rank.  There is also a trusty black steed occupying the second rank.  Now where can Glenda go?  Only time will tell!",
        "14. Qd2 Kh8 15. Rfe1 Qf8": "15. ...... Qf8 - ah, now that solves the issue of where to put Glenda.  Ideas of a possible Rxf7 later on perhaps.  ",
        "16. h3 Re8": "16. ........ Re8 - challenging the e column.",
        "17. b4 Ne6": "17. ....... Ne6? - In trying to activate my pieces I now lose my a pawn to a discovery motif, aargh and double aargh!",
        "18. Nxe6 Bxe6 19. Bxa7": "19. Bxa7 - ouch and double ouch!",
        "19... Bd6": "19. ....... Bd6 - a little seed starts to germinate in my head.  If I take the knight on g3 on the next turn I will get opposite coloured bishops.  As the major pieces are still on the board then maybe it might be a good idea to hang on to the bishop pair with my pawn minus until the major pieces have been traded off and then use whatever drawing motifs that go with it!",
        "20. Bd4 Bc8": "20. ..... Bc8 - the first stage in the plan to exchange off the major pieces.",
        "21. Rxe8 Qxe8 22. Re1 Qf8 23. Qe3 Re7": "23. ..... Re7 - now for stage 2 - a second pair of rooks is about to be traded off.",
        "24. Qd2 Bxg3": "24. ...... Bxg3 - firstly I make that trade that I envisaged a few moves back.  I now have those opposite colour bishops and white's extra pawn is doubled.",
        "25. fxg3 Rxe1+ 26. Qxe1 Qf7 27. Qe5": "27. Qe5 - ssss here comes the wicked witch of the west.  If Glenda strays from the defense of g7 then Henry will cop Old Matey.  Surprisingly, I manage an amazing defense despite this constant dreadful threat!",
        "27... h6": "27. ...... h6 - firstly I give Henry some luft.",
        "28. Kh2 Kh7": "28. ..... Kh7 - Henry gets off the back row to avoid Fou Leblanc getting caught up in a potential pin by a move such as Qb8.",
        "29. g4 Be6 30. b5 cxb5 31. axb5 Qd7": "31. ....... Qd7 - Glenda is defending a lot of pieces.  Thankfully white's other pieces are his king and an opposite coloured bishop.  At least my vulnerable queenside pawns are on white squares, which is a great help and this will reduce the possibility of any more black material being lost due to Glenda being overloaded.",
        "32. b6 Qf7 33. Qc7 Qd7 34. Kg3 Kg6 35. Kf4 Kf7": "35. ..... Kf7 - over the last few moves, Henry has tried to help with the defense.  I must not initiate a queen trade here as I will not be able to prevent the c7 pawn from crowning.",
        "36. Ke5 g6": "36. ...... g6 - I now put my kingside pawns onto white squares.",
        "37. g3 h5 38. gxh5 gxh5 39. h4": "39. h4.  White's pawns are undoubled but at least the remaining black pawn is on a white square.  Fou Leblanc now has acres more room to manoeuvre.",
        "39... Bg4 40. Qxd7+": "40. Qxd7+ - so he initiates the queen trade.  I am not unhappy about that even though I am about to lose another pawn.  You will see why in a moment.",
        "40... Bxd7 41. Kxd5 Bc6+": "41. ...... Bc6+ and surprise surprise a DRAW OFFER from Yours Truly.  Yes a draw offer because Henry cannot be prevented from going to g6 to guard the h5 pawn.  Even if white were to trade pawns then all Henry has to do is to move onto h7 blocking the white passer and Henry cannot be moved from h7 due to white having the wrong coloured bishop.  On the queenside white can never interfere with Fou Leblanc's movements along the a8-h1 diagonal.  This will prevent white's c pawn from making any progress.  I explained this to my opponent in the chat and he accepted my draw offer - wheew and double wheew!"
    },
    "url": "https://gameknot.com/annotation.pl/gritting-it-out?gm=61016",
    "gameName": "Gritting it out!",
    "players": "sdr46 (1718) vs. jstevens1 (1722)",
    "opening": "Philidor (C41), Berger variation"
}