{
    "moves": {
        "1. g4": "Grob's Attack! This sneaky and odd opening can catch the unwary out, and my opponent uses it a lot.",
        "1... d5": "Logical to claim the centre right away, and attack the pawn.",
        "2. Bg2": "Even though it's obvious the White Bishop is going here it is still a little startling to find the g-pawn left undefended.",
        "2... c6": "Last time I met this attack - against the same opponent - I snapped up the offered pawn and my game unravelled inside a dozen moves. This time I'm being more circumspect. Even so, 2...Bxg4 is probably fine after 3.c4 c3 4.Qb3 Qb6. But not 4...Qd7, as I played, after which 5.cxd5 cxd5 6.Bxd5 e6? 7.Bxb7 and my sharp exit!",
        "3. h3": "White ensures I don't change my mind and grab the pawn anyway.",
        "3... h5": "I need to challenge in the centre, but I doubt White will want to mess-up his K-side pawns further by defending this pawn again - though the pawns don't look great as it is.",
        "4. g5": "No, he pushes the pawn forward. Probably the idea in this opening is to constrain the Black K-side in this way.",
        "4... e5": "Now I lay my centre claim.",
        "5. d4": "White does need a centre presence too.",
        "5... e4": "Happily, I advance my pawn and form a nice chain against the Bishop that so ruined my game in our last encounter.",
        "6. h4": "The move in the database is 6.c4, hitting at the chain right away, though I had expected 7.Nc3. Instead, White consolidates his wedge.",
        "6... Ne7": "My Knight isn't going to f6, so here it must be, even though it blocks my Bishop. It's possible White held back from 6.Nc3 to avoid 6...Bb4?",
        "7. Bh3": "We're well out of the database and in unknown territory. Without any analysis as I write I have no idea whether this, to me suspicious-looking move is inaccurate or not.",
        "7... Bxh3": "At any rate, since most of my pawns are on light squares it seems judicious to exchange my light-squared Bishop. Probably Black is thinking his Bishop is now so hemmed in it's of no further use?",
        "8. Rxh3": "This surprised me, since it seemed the logical square for the Knight, and now White can't castle K-side - and his Q-side is undeveloped. ",
        "8... Nf5": "Now the Rook is tied to the defense of the h-pawn, and my Bishop is free.",
        "9. Bf4": "White must develop his pieces, but again I expected 9.Nc3, Knights before Bishops and all that. I can't help noticing that the b-pawn is undefended.",
        "9... Bd6": "It seems necessary to challenge along this diagonal; Black must retreat the Bishop or defend it rather awkwardly...",
        "10. e3": "He chooses its defence.",
        "10... Bxf4 11. exf4": "And I am happy to double his pawns.",
        "11... Qb6": "As well as winning a pawn, since my Queen attacks both the b-pawn and the d-pawn twice. But am I just falling in line with White's plan?",
        "12. c3": "He can't defend both pawns.",
        "12... Qxb2": "The b-pawn falls.",
        "13. Nd2 Qb6": "I get my Queen out of there. I do have a tendency to pawn-pinch, but I can't see - yet - that this has caused me any problems.",
        "14. Rb1": "Obviously he attacks my own b-pawn and Queen.",
        "14... Qc7": "I sidestep.",
        "15. Ne2": "He's not castling now; his King is stuck in the centre; this is the only square for the Knight, so here it lands.",
        "15... Nd7": "My idea was to go to b3 with this Knight, blocking off that half-open file.",
        "16. c4": "It doesn't look such a good idea now, since 17.c5 just drives it away.",
        "16... O-O": "I start to panic a little. Just a little. Anyway, getting my King to relative safety seems the best idea.",
        "17. Qb3": "Now I see that my b-pawn, ulitmately, is going to fall; I've been lured into nabbing a pawn once again and it might prove my undoing!",
        "17... Qb6": "I offer an exchange to dilute the Q-side attack.",
        "18. cxd5": "Now, though, it's me who exchanges; I didn't fancy both Rooks on the b-file after 18...cxd5 19.Qxb6 Nxb6 20.Rhb3... completely missing that the h-Rook is tied to defending the h-pawn!",
        "18... Qxb3 19. Rbxb3": "I scratched my head at this recapture until I remembered I'd tied the h-Rook down. Not quite so bad as I thought!",
        "19... cxd5": "Now that isolated d-pawn must prove a weakness for White sooner or later.",
        "20. Rxb7": "Even though he's won his pawn back and got his Rook to the 7th...",
        "20... Nb6": "I block its retreat.",
        "21. Nb3": "The d-pawn may be isolated, but it's well defended.",
        "21... Rfb8": "I really don't like that Rook on the 7th rank.",
        "22. Nc5 Rxb7 23. Nxb7 Rb8": "I'd rather have a Knight there, even though Knights are tricky little beasts!",
        "24. Na5 Nc4": "Maybe not the best plan; White's Knight is stuck at the side of the board, and this exchange splits my pawns and gives White a passed pawn. But I get a passed pawn too. And that Rook is still guarding the White h-pawn.",
        "25. Nxc4 dxc4 26. Kd1": "White doesn't fancy my pawn advancing or allowing his King to be trapped ",
        "26... Rd8": "For some reason I chicken out of 26...Rb2, thinking that winning the central passed pawn is more important than chasing the a-pawn.",
        "27. Re3": "This is probably the crux of the game - which pawn do I take? Do I take either, or do I support the threatened e-pawn?",
        "27... Nxd4": "I decide the h-pawn can wait.",
        "28. Rxe4": "I was sure White wouldn't take this, because of the threats from a discovered check. But the discovered check doesn't seem to offer much now I can play it...",
        "28... Nf3+": "Other than winning the h-pawn as well.",
        "29. Kc1 Nxh4 30. Rxc4": "Even if it means giving up my c-pawn. Those doubled pawns give me hope of an endgame win, but really giving up both my central pawns was rather foolish.",
        "30... Nf5": "I need my Knight back from the edge of the board.",
        "31. Ng3 Nd6": "Now White can't win my h-pawn. Not right now anyway!",
        "32. Rd4 Rc8+": "I check to get my Knight out from the pin.",
        "33. Kd2 Nc4+": "And again. But I'm driving the King to the side of the board where my rather vulnerable passed pawn is. I'm waiting for a moment to push it.",
        "34. Ke2 h4": "I just haven't got time to push forward the g-pawn, advance the King, get my Rook to h8...",
        "35. Nf5": "Too late I see the pawn is lost; I can't advance it or defend it because of the horrible fork on e7, which I have quite missed.",
        "35... Re8+": "I can cover e7, but can't save the pawn.",
        "36. Kf3 Na5": "I can save the Knight, but it's small comfort.",
        "37. Nxh4": "From now on I am rather up against it, despite White's doubled pawns.",
        "37... Nc6": "I try a rather hopeful trap...",
        "38. Ra4": "The Rook attacks the pawn, and he can bring his Knight over too...",
        "38... Rd8 39. Kg4": "Again the King gets to where it needs to be.",
        "39... Rd4": "Offering an exchange when a pawn down is probably wrong, but White controls so much of the board...",
        "40. Ra6": "Attacking the Knight. I thought the Rook would end up here.",
        "40... Rd6": "I defend it. I'd rather hoped for this position, hoping White misses the threat of 41...Ne5+, winning the Rook.",
        "41. Ra3": "Obviously that's not going to happen.",
        "41... Rd2": "Now I decide to double up an attack on the a-pawn, since it can't move forward.",
        "42. f3": "White must save the f-pawn...",
        "42... Nb4": "Allowing me to win the a-pawn. I realise, in doing so, that I have to give up the a-pawn, but my pieces are needed over on the other side of the board where those pawns are slowly advancing.",
        "43. Rxa7 Rxa2": "There was also the chance White might go for the Rook exchange, when my Knight is better placed?",
        "44. Rb7": "No; he goes back to attacking it.",
        "44... Nd5": "It's a shame that g2 is covered my the Knight. Though it does rather tie the Knight down to defence.",
        "45. f5": "The pawns are closing in on my King, and I smell a mating scenario.",
        "45... Ne3+ 46. Kh5": "Yes - White is slowly cutting off retreats for my King",
        "46... Kf8": "Otherwise 47.Rb8+ Kh7 48.g6+ fxg6 49.fxg6#",
        "47. f6": "This is looking dark indeed.",
        "47... g6+": "47...gxf6 48.gxf6 doesn't look good for me.",
        "48. Kh6": "It strikes me that the White King is also vulnerable to a mating attack, having crept forward to help mate me, even though I don't have time for 48...Rh2 because of 49.Rb8# However...",
        "48... Nf5+": "Probably the saving move. 49.Nxf5? ...Rh2+ wins.",
        "49. Kh7": "Still no time for 49...Rh2.",
        "49... Nd6": "But I do get to block the mate with my Knight.",
        "50. Rb8+ Ne8": "Saved.",
        "51. Rb4": "White can't afford to move the Knight, so he must defend it.",
        "51... Rh2": "Now his Rook has to remain on the 4th rank. The White King is stuck.",
        "52. Rd4": "We shuffle about...",
        "52... Rh3 53. Ra4 Rh2": "And I offered a draw, which was accepted. Clearly the onus is on me to change tack, though whether I had anything better I do not know...?"
    },
    "url": "https://gameknot.com/annotation.pl/grobs-attack?gm=63635",
    "gameName": "Grob's Attack",
    "players": "krenovac (1798) vs. jimspellman (1730)",
    "opening": "Grob (A00), spike attack"
}