{
    "moves": {
        "1. d4 d5 2. Nc3": "Veresov's Opening.  White usually tries e4 somewhere.  I later found out that Andrew has had decent success with 1. d4  2. Nc3, so I'm inadvertently playing into one of his specialties.  I think I'll try to get c5 in so that I can dispute the center.  Since I don't feel daring enough to play a gambit, I'll set up with d6 first.  But I'll try to keep him guessing by playing Nf6 ahead of d6.  Then I'll move the c-pawn.",
        "2... Nf6 3. Bf4": "Departing from opening theory with early pressure on c7.  I could stop it with 3. ...a6 but that's too reactive of a move.  I could even play 3. ...Na6, which is really cowardly, and runs into trouble after 4. e3 (or even 4. e4?).  Perhaps I could indirectly answer the threat with 3. ...e6.  Then there is 4. Nb5 Bb4+  5. c3 Ba5.  Other moves that might work are Nh5, Bd7 and c5.  c5 does look interesting, but seems kind of hair-raising.",
        "3... e6": "Drawback is that this shuts down the c8-bishop, but that's not bad yet [3. ...Bf5, which I hadn't considered].",
        "4. a3": "Now Bd6 looks okay to stare down his strong f4-bishop, but I'll lead up to it instead [4. ...Bd6 right away was equal].",
        "4... c5": "Now Nb5 gets hit with Qa5+, 5. Nc3 cxd4 followed by Nc6.  On the other hand, he could now try Nf3, e3 (best?), or dxc5 (then I have to play Bxc5 to avoid the solidifying b4).",
        "5. Nf3": "My development is getting behind.  Now it's either Bd6 or Nc6.  After either move he has Ne5.",
        "5... Bd6 6. Ne5": "Now I can play cxd4 [recommended], Nc6, O-O or lesser moves like Bd7 or Nbd7.  I'm worried about e3, because it supports the d-pawn and guards the b5 square (now Nb5 can be played without worrying about Qa5+, and Bb5 can pin the knight if I play Nc6).  I was seriously thinking about playing cxd4 first to lessen the impact of an impending e3: 6. ...cxd4  7. Qxd4 Nc6; which isn't bad, but helps to bring more of his forces out [6. ...cxd4  7. Qxd4 O-O  8. e4].",
        "6... Nc6 7. e3": "A bunch of pieces can go off: 7. ...Bxe5 Bxe5  8. Nxe5 dxe5; or 7. ...Bxe5  8. dxe5 Nd7.  I either double his e-pawns or trade the bishops with doubled e-pawns.  His weak e5 pawn could then be reinforced with f4.  However, there's something about the setup that I don't like the looks of.  Since there doesn't seem to be any immediate danger, I'm going to hustle my king to safety.",
        "7... O-O 8. Nb5": "Again, I could trade stuff on e5, but now it seems like he gets better control of the black squares.  I'll hold on to the bishop for a bit and see what happens.",
        "8... Bb8 9. c4": "His other move could have been 9. Be2 [9. Nc3].  Now things are really complicated.  Now Qa5+, a6 and cxd4 are possible.  9. ...Qa5+  10. Qd2 Qxd2+  11. Kxd2 Ne4+ 12. Ke1 prevents castling, but the e4-knight gets shoved back after f3.  It's not a bad sequence, but I don't know if it leads to anything tangible.  After 9. ...a6 he could try either 10. Nxc6 or 10. Nc3, and then I'm totally in the dark.  I'm also fumbling around after 9. ...cxd4 because he has many options (exd4, Nxc6, even cxd5).\n\nThen 9. ...dxc4 started to look good.  It half-opens the d-file so that my queen now looks at the d4-pawn.  So if I play dxc4 I think there are 3 replies:\n1.) 10. Nxc4 Bxf4  11. exf4 and I get rid of his strong bishop, double his pawns, and perhaps pick up the d4-pawn.\n2.) 10. Nxc6 bxc6 (momentary tripled c-pawns) and if 11. Bxb8 then either Rxb8 to win a pawn or cxb5, which gives me a large Queenside pawn presence, forces him to retreat the bishop (though he would get to keep it, and thus hold the dark diagonal) and I also win a pawn; or if instead of 11. Bxb8 he tries Nc3 then I might either do 11. ...Bxf4 or 11. ...cxd4 and pocket another pawn.\n3.) And the variation that worried me most of all, 10. Bxc4 (endorsed by the computer).  I might have thought about 10. ...a6 because then 11. Nc3 cxd4  12. exd4 Qxd4 looks like it might work.  On the other hand, if instead he first tried 11. Nxc6 then 11. ...bxc6  12. Nc3 (12. Bxb8? cxb5 ouch!) Bxf4 13. exf4 and I still win a pawn on d4.\n\nGot all that? Right, neither do I!",
        "9... dxc4": "[9. ...cxd4  10. Nxc6 bxc6  11. Nxd4 Bxf4  12. exf4 etc. but gives White the edge]",
        "10. Nxc4": "Now 10. ...a6 looked interesting, but I'm not going to muddy things up because he could try 11. Bxb8 and 12. Nbd6 (Wrong! Afterwards, analyzing this shows that 12. Nbd6 may rein in the horse).  I'll just get rid of that bishop while I can (the computer agrees with removing his strong bishop).",
        "10... Bxf4 11. exf4": "Capturing on d4 right away is all right, but I might be able to improve my position with 11. ...a6 first.  If then 12. Nbd6 I can do 12. ...b5  13. Nxc8 (13. ...Qxc8?  14. Nb6 forks) Rxc8  14. Nd2 then queen/knight/pawn takes on d4.  Or even better, 13. Nxc8 bxc4 keeps the c8-knight trapped.",
        "11... a6": "If 12. Nc3 maybe cxd4 to force the knight to jump again, then I have a passed pawn, which I'll have to watch to make sure that he doesn't try to gang up on [12. ...cxd4  13. Ne2 Qc7].",
        "12. Nc3 Nxd4 13. Bd3 b5": "This will push the cavalry back, expand my presence on the Queenside, and make the options for a future c4 or Bb7.  The only irritation is he can play 14. Ne5, but I might answer that with ...Nd7 [14. Ne5 c4  15. Bc2 Bb7 16. O-O].",
        "14. Ne3 Bb7 15. O-O": "[15. a4 c4  16. Bc2]  I tried to mobilize aggressively (deflecting the knights, then aiming at g2), but it doesn't leave him with any weaknesses.",
        "15... Qc7": "[15. ...Qd6]  This is similar strategy to my last couple of moves.  I'm hoping that he'll play g3 to defend the f-pawn.  Then I can play Qc6 and try to swarm over his now-exposed king.  Since that probably won't happen (I'm expecting 16. f5) then at least my queen is on a good square and I've opened d8 for one of the rooks.  It's slightly possible that I can then pin his queen, like maybe after a timely ...c4, but I'll have to see how the position plays out.  If 16. f5 I can consider 16. ...Rfe8 or 16. ...e5, though I'm not so sure ...e5 does anything.  I don't know if 16. ...exf5 is good or not.",
        "16. f5 Rad8": "[16. Ng4 Nd5  17. Nxd5 Bxd5]  If he captures on e6 I would recapture with the knight, then the queen has to move off d1: 17. fxe6 Nxe6 and if 18. Qe2 then Nf4 wins, so the queen has to go to c2 (not b1, see below).  Or I could play c4 immediately after fxe6, but that may be premature.",
        "17. Qb1": "[17. Ng4 Nxg4  18. Qxg4 Nf3+  19. gxf3 Rxd3  20. fxe6 Bxf3]  Look! The b3-square is now open.",
        "17... Nb3": "If 18. Ra2 then 18. ...Nd2.",
        "18. fxe6 Nxa1": "Might as well grab it while I can (computer agrees).  18. ...fxe6 might be okay.  Now I'm glad I didn't try c4 somewhere earlier because now his bishop will die after Qxa1 (the computer keeps saying that he should capture something with that bishop, like Bxb5 or Bxh7+.  If it's likely to go down it might as well take a pawn with it.).",
        "19. exf7+ Rxf7": "I probably played Rxf7 a bit too fast, as now the bishop escapes to the vacated f5-square and wants to pin the rook.  Qxf7 was better.  As it is, I look to win a rook for a pawn and knight, but there probably were bigger gains.\n",
        "20. Bf5": "Also Bxh7+, for reason as stated above.  Now if I prevent Be6 then the knight falls.  I'd keep a material edge if I save the knight and allow the exchange on e7.  Otherwise, I could consider Qc6 or Re7.",
        "20... Nb3": "The knight is somewhat sheltered, and also resumes the d2 fork threat.  I can also swing it back to d4, if nothing less, to stop Be6.  So I'm expecting the immediate 21. Be6, attacking both knight and rook.  Then 21. ...Nd2 could exchange exchanges and I'd come out ahead.  He might then try to get the queen to safety first though.  As far as I can tell, he doesn't have any surprise moves, so I think I can get away with jumping the knight around and leaving the f7-rook pinned on my king [however, 21. Be6 Nd2  22. Bxf7+ Qxf7  23. Rd1].",
        "21. Qa2 Nd4 22. Bh3": "He doesn't allow Nxf5.  So it's either shift the king to h8 (or f8) or play Rdf8 (or Rdd7).   Playing c4 does the trick too, but queenie has a limited future on that diagonal and is likely to reposition soon anyway; I also distrusted c4 because it might lead to a4 or even b3 from him.  I might as well hide the king [22. ...b4 instead was best].",
        "22... Kh8 23. Re1": "The f2-pawn is lightly guarded, so it looks like a potential soft spot.  On the other hand, the rook itself is unprotected on e1, perhaps I could establish control of the e-file.  Re7 and Re8 both looked playable, but I couldn't figure out what to do next, so I settled in for a f-file showdown [23. ...Ne4  24. Nxe4 Bxe4].",
        "23... Rdf8 24. Qb1": "There goes the queen, keeping my knight from roosting on e4.  What do I do now?  It would be nice to move the f6-piece and discover an attack, I just don't know where to move it to [24. ...Nh5].  Kind of reflected on Bc8 but his bishop seems like it's bystanding at the moment, although it is keeping the knight from going to g4 to threaten Qxh2+.",
        "24... b4": "Trading pawns just delays the horse's jump [analysis expected axb4 before Ne2].",
        "25. Ne2": "This would be a good chance to remove one of his defenders and hopefully reach an advantageous endgame: 25. ...Nxe2  26. Rxe2 bxa3 (to prepare a possible Knight fork on c3)  27. bxa3 Ne4  28. Nd1, then it would be a tossup between Qf4 or c4.  I couldn't see that far ahead, but it looked like there was no sizable edge.  I thought about moves like 25. ...Be4, 25. ...Nd5 and 25. ...bxa3 without conclusion.\n\n\nThen 25. ...Ne4 started to look promising, as it directly attacks f2.  Then there is: 26. f3 Nd2  and after 27. ...Nxf3+ I pick up material; 26. Nxd4 cxd4  27. N goes someplace (like c2?) Nxf2 and whatever his 28th move is I can throw in Nxh3+; 26. Ng4 h5; finally, 26. Nd1 Nxf2 wins a pawn immediately and may mess up the king pawns with Nxh3+.  26. Nxd4 may be the most complex and defensive line, unless there's something I've overlooked (there was something, but I can't understand it: the computer liked 25. ...Ne4  26. f4 which doesn't seem to help the defense after 26. ...Nxe2, does it?).",
        "25... Ne4": "After playing this I saw that 26. Nd1 Nxf2 doesn't win a pawn, as 27. Nxf2 Rxf2  28. Nxd4 cxd4  29. axb4, which could still be okay [26. ...Nxf2 was still playable].",
        "26. Nd1 Nd2": "I can put a knight on f3 and hopefully pick up a rook and two pawns for both knights.  The question is, which one should go to f3 first? Maybe I'll flip a coin. [N2f3+]",
        "27. Qd3 Nd2f3+ 28. gxf3 Nxf3+": "I considered recapturing with the rook, but felt that Nxf3 was easier.  Now Kf1 to avoid Qxh2.  I keep hoping that there will be a checkmate in here somewhere, since my pieces are aimed all over his king; I haven't been able to find one yet (after his 29th move analysis saw a mate in 7, which would only have been avoided with the unappetizing Qxf3).",
        "29. Kf1 Qxh2 30. Qxh7+": "A spiteful check and Andy calls it quits; payback will have to wait.  What I originally planned was for 30. Bg2 Nxe1  31. Kxe1 Qxg2.  It looks like his king escapes but I would have a large lead to work with (but it turns out that I missed 30. Bg2 Nd2+ which mates quickly).  I think this game had a lot of complexities at the onset, and required more careful searching in order to find the right paths."
    },
    "url": "https://gameknot.com/annotation.pl/grudge-match?gm=42434",
    "gameName": "Grudge Match!",
    "players": "abreyer (1572) vs. led_chessmen (1200)",
    "opening": "Blackmar-Diemer gambit (D00)"
}