{
    "moves": {
        "1. e4": "Continuing on Joanne's \"Early Resignation\" theme, here's another short one as a guest annotator. Mini tournament game, I'm white and begin with the Open Game.",
        "1... e5 2. Nf3 Nc6 3. Bb5": "Ruy Lopez, my favorite.",
        "3... a6 4. Ba4": "The Morphy Defense.",
        "4... Nf6 5. O-O": "The Closed Defense",
        "5... Be7 6. Re1": "Main Line.",
        "6... b5 7. Bb3": "6. ... b5 is the main line continuation of the Closed Defense, and white plays along with 7. Bb3, not that there was much else for white to do.",
        "7... O-O 8. a4": "Black is changing up the move order, for example, castling before playing 7. ... d6, so white is trying to capitalize on that weak e5 pawn. If 8. ... bxa4 9. Bxa4, white then threatens 10. Bxc6 followed by 11. Nxe5.",
        "8... Bb7 9. d3 Re8 10. Nc3 b4 11. Nd5": "Time to bring some pieces into the center.",
        "11... Na5 12. Nxe7+ Qxe7 13. Ba2": "White established the bishop pair, for what that's worth.",
        "13... d5 14. Bg5": "Pins the black knight to his queen, leaving the black pawn on d4 vulnerable to white's pawn and bishop.",
        "14... Rad8 15. exd5": "Begins a winning exchange sequence. White is now ahead by a pawn, and black would do well to leave it alone, drive off the white bishop from g5, and get a defender for the pawn on e5 that isn't a queen. But it may be too late for all that already.",
        "15... Bxd5 16. Rxe5": "White has gained a pawn and now forks the black queen at e7 and the black bishop at d5. Black is already doomed to losing some material.",
        "16... Qc5 17. d4": "Black saved them both, but white is not done attacking that black queen.",
        "17... Qc6 18. Bxf6": "17. Qc6? was the critical blunder here. Many of the exchange sequences now include white playing Nxe5 which threatens the black queen and forces her to move, gaining a tempo for white to gain material in the exchanges. Or black could try 18. ... Qxf6 19. Rxe8+ 20. Rxe8 21. Bxd5 and white wins a bishop. Black has too many pieces under attack and no sequence lets him escape without losing material.\r\n",
        "18... Bxa2 19. Bxd8": "Continuations from here: 19. ... Rxe5 20. Nxe5 threatening black's queen, 20. ... Qd6 21. Bxc7 and white is ahead by rook and two pawns. Or 19. ... Rxd8 20. Rxa2 Nb7 and white is ahead by a rook and pawn. Black chose to resign instead."
    },
    "url": "https://gameknot.com/annotation.pl/guest-blunderfest-02?gm=22740",
    "gameName": "Guest Blunderfest 02",
    "players": "blake84120 (1783) vs. jabbawock (1494)",
    "opening": "Ruy Lopez (C88), closed, anti-Marshall 8.a4"
}