{
    "moves": {
        "1. e4": "A game that shows that I am greatly improving, thanks to practice and a lot of help from comments on my past annotated games. Thanks all and thanks L-d-j for all the help and working with me. This is a very quick game that ends in resign.",
        "1... e5": "Back to back king pawns opening",
        "2. Nf3": "Knight to f3",
        "2... Nc6": "black moves knight to c6",
        "3. c3": "I prepare to move my pawn to d4 and also free up the diagonal for my queen.",
        "3... g6": "I think he is preparing to fianchetto bishop.",
        "4. Bc4": "I move bishop to c4 after I notice black's weakness in the middle so I eye down f7 with lsb.",
        "4... Nf6": "black moves knight to f6",
        "5. d4": "I know that I am leaving e4 pawn vulnerable with this move but my plan is to move knight or bishop to g5 which is bad because then if ne4 then the knight will be defending g5. which is what will happen",
        "5... exd4": "black pawn take on d4",
        "6. cxd4": "I take back on d4 with my pawn",
        "6... Nxe4": "Then of course knight takes pawn on e4",
        "7. O-O": "I castle",
        "7... Bd6": "black bishop to d6 . Getting ready to castle. Black is desperately trying to keep the knight from getting pinned and the king checked that he is leaving his knight undefended.",
        "8. Re1": "So I go for the knight with my rook still pinning the knight.",
        "8... O-O": "Black castle's",
        "9. Rxe4": "My rook takes knight on e4",
        "9... Re8": "Black moves rook to e8 to take my rook on e4. ",
        "10. Qe1": "I move queen to e file to defend. ",
        "10... Nb4": "I think this is an ok move considering the move that would follow. but also a bad move. better would be to finish developing black's pieces.",
        "11. Bg5": "I believe this is a great move trapping the queen. black's queen can't take bishop obviously because of the f3 knight defending.",
        "11... Re7": "black rook to e7..I think a better move for black would have been pawn to f6. but black had not many options",
        "12. Bxe7": "I take with my bishop.",
        "12... Qe8": "Black saves his queen by moving to e8.",
        "13. Bxd6": "I take black's bishop at the same time threatning black's queen.",
        "13... Qd8": "Black moves queen back to d8",
        "14. Be7": "I move my bishop back trying again.",
        "14... Qe8": "Black does the same.",
        "15. Bxb4": "So I take black's other knight.",
        "15... Qf8": "black queen f8. bad move again. I could take here with my bishop. But I don't know if I missed this or I saw a better move but...",
        "16. Re8": "I think rook to e8 was a better move.",
        "16... Qxe8": "queen takes my rook.",
        "17. Qxe8+": "and I retake with my queen also checking black's king.",
        "17... Kg7": "Black's king is on the run. It's pretty much lost from here as I think of ways to checkmate.",
        "18. Qxf7+ Kh6 19. Bd2+ Kh5 20. Qd5+ Kg4 21. h3#": ""
    },
    "url": "https://gameknot.com/annotation.pl/i-am-getting-better-owned?gm=40476",
    "gameName": "I am getting better (Owned!)",
    "players": "terris87 (1200) vs. Bufordtjustice (1200)",
    "opening": "Ponziani opening (C44)"
}