{
    "moves": {
        "1. e4": "This is an online 1-minute match I played with my coach. He normally crushes me in online blitz games, or he'll flag me when I'm winning, but today I got the satisfaction of crushing him brilliantly, using only 11 seconds of my time.",
        "1... c5": "Pre-move, I often pre-move c5 on the first move, but it is risky in case White plays b4 first move, but I knew my coach wouldn't do that, so I just pre-moved c5.",
        "2. Nc3 Nc6 3. f4": "The opening moves were played very rapidly, I'm not even sure if either of us had used a second yet. This is the Grand Prix Attack, where White goes for a bunch of cheap attacks on the kingside, which can be dangerous against an unprepared player. I do not recommend playing Grand Prix against a player with book knowledge.",
        "3... g6 4. Bc4 Bg7 5. Nf3 e6": "This blocks the diagonal and prepares for a future d5-boost, but I didn't need to spend a second on this move, this is still book and blocking the bishop's diagonal is a logical move.",
        "6. f5": "This is out of my opening repertoire, I've never had a grand prix game where my opponent sacs their pawn this early, most players wait until after castling to play the f5 sacrifice. I didn't really want to go into complications in a 1-minute match, so I just played Nge7 almost instantly. In bullet games, you shouldn't go into complications when you're the one getting attacked, it makes you think more so that your opponent has a better chance of flagging you even if you're winning. I'll just make very quick solid moves.",
        "6... Nge7 7. fxe6 fxe6": "pre-move, on ICC pre-moves only take 0.1 seconds away from your time, it would take longer than that just to move the mouse, so I always pre-move captures. ",
        "8. O-O d5": "I saw the chance to gain central space and gain tempo chasing the bishop, so I played this move almost instantly without calculating. Playing bullet chess can often screw up your chess and make you play bad in long time control games, but it can also improve your instincts and ability to think quick and move fast. But don't get addicted to 1-minute chess............. one time on a night before a tournament, I played over 100 bullet games in a row, and did very badly in the tournament because I made so many quick, \"unthoughtout\" moves.",
        "9. exd5 exd5": "pre-move again",
        "10. Bb5": "Playing a6 here would require some calculation and is a waste of move to me, so I just castled since it is most logical and no calculation is necessary.",
        "10... O-O 11. Kh1 Nd4": "This just seemed most logical and most aggressive, so I played it without much thought. Nd4 is a typical move in Grand Prix lines, since the knight on c3 prevents a pawn from chasing away the knight, and Nxd4 lets me have better control of the centre, even though I have doubled isolated pawns, they are not an issue",
        "12. Nxd4 cxd4": "pre-move",
        "13. Ne2 Bg4": "Once again this is the most aggressive move, and I played it without much thought, if you know how to play logical chess, then it is easy to find good moves in less than a second.",
        "14. h3": "I sort of considered h3 in my mind when playing Bg4 instantly, but I knew it would be weakening, and that I would have \"some tactic\" to exploit it. I know that kind of analysis isn't good for your chess, and that being a good bullet player isn't very important, but it can improve your instincts in regular chess so that you can find and analyse good moves quickly.",
        "14... Nf5": "I didn't really spend any time on this move, moving the bishop is a waste of tempo so I won't do it, this brings the knight to an aggressive square and prepares Qh4  if White accepts the bishop. I didn't have time to analyse, I just assumed that I should have \"some tactic\" if White weakens his position and allows the tempo queen check, and my instincts were correct.",
        "15. hxg4": "????????????????????????? totally losing now",
        "15... Qh4+ 16. Kg1 d3": "This clears up space for a Bd4 idea, but I can't do it with the knight there.\r\nMy coach is just lost here, ignoring the pawn with a move like gxf5 allows dxe2 follwed by Bd4  Rf2 Rxf5 just crushing, but I wasn't analysing all that during the split second it took for me to move, it's all instinct based on the logic that makes sense to me.",
        "17. Bxd3": "c3 holds on a little longer here, but White is still lost after dxe2 followed by Ng3, with the threat of Qh1 and assault on the f-file. White's underdeveloped dark bishop prevents him from countering my control of the f-file. ",
        "17... Ng3": "Threatening Qh1#, White is just busted here. If he takes knight, then Bd4  should mate in a few moves.\r\nBf5 here is a tricky way to defend my f-file assault, but it takes away defense from the knight, which would allow a rook to come to the e-file to double-attack the knight that is stopping Bd4 ,",
        "18. Rxf8+": "A temporary sense of security, but trading rooks does absolutely nothing, I didn't have time to pre-move this recapture, but time isn't an issue anymore, I could probably win this position with 10 seconds left.",
        "18... Rxf8": "Once again, Bf5 is the only move that doesn't get mated next, but Qh1  wins the queen and white drops a bunch of material after that, so the game is basically over, I totally annihilated an international master using only 11 seconds of my time, while my coach had spent 34 seconds.",
        "19. Nxg3 Bd4#": "A lot of players don't respect bullet chess, and think it is just a contest of who can click the fastest, but being good at fast games comes in handy often, quickens your thinking ability, sharpens your instincts, and teaches you not to panic when time pressure situations happen. Just don't get addicted!"
    },
    "url": "https://gameknot.com/annotation.pl/i-beat-my-coach-in-11-seconds?gm=11928",
    "gameName": "I beat my coach in 11 seconds",
    "players": "Cyrus Lakdawala (2552) vs. Me (1967)",
    "opening": "Sicilian (B23), Grand Prix attack, Schofman variation"
}