{
    "moves": {
        "1. c4 Nf6": "I almost never face the English, but it is far from my known ground. I'd like to transpose to my favourite Q defence, but...",
        "2. Nc3 e6": "Playing for a quick d5. ",
        "3. d3 c5": "...this first, it can't be bad. The N's penetration in b5 can be controlled with a6.",
        "4. Nf3 Nc6 5. g3 Qc7": "This was in order to break the natural lines. It invites Nb4, and supports e5.",
        "6. Bg2 e5": "I wanted to play this, knowing it is a loss of tempo, trying to make him think in an opening that obviously he masters. ",
        "7. O-O d6 8. Bg5": "I already don't like my asset, but hey, let's see what can I do with it. Now BxN would be annoying. ",
        "8... Nh5": "planning to win the tempo with h6. This B is without scope here, right now. ",
        "9. Nd5": "This is the backfire. My Q has few squares. ",
        "9... Qd7": "This is ugly. But now, let's try white to get a concrete advantage. ",
        "10. a3": "Well done, since I was planning Nb4. ",
        "10... Ne7": "I threat the exchanges that will favour me the most. ",
        "11. e4": "Well, it's now or never. ",
        "11... f5": "I have to \"do something\"or he will just squeeze me in to death. ",
        "12. Bh3 g6": "I still \"threat\" to release pressure. ",
        "13. Nh4": "White threats QxN, followed by Nf6+, forking my Q. ",
        "13... Nxd5": "...abandoning one defender of f5, but I can't allow this N to stay there. I have to release my Q. ",
        "14. cxd5 h6 15. Bd2 Qf7": "...planning g5 in some phantasy.",
        "16. b4": "The problem with b6 is Qa4+.",
        "16... Be7": "A good developin move, threatening BxN, opening the K. ",
        "17. Ng2": "...which he prevents. For some reason, he has not taken on f5... :-)",
        "17... Bd7": "Preventing the Q's entrance. Of course, I am allowing bxc5...",
        "18. Ne3": "Repositioning his N on a nice square, pressing f5. ",
        "18... Bb5": "...silly move, pressing on d3. ",
        "19. Bc3": "Well, obviously. Again, it's now or never. ",
        "19... f4": "This will have the effect to avoid the opening of the f column in the exchanges. Of course he can play 20. Be6, Qf8...",
        "20. Ng4 Bd7": "If he plays Nf6+ he will just lose it. I won't take g3, of course. ",
        "21. bxc5": "The \"pending question\". I'll take the tempo to do something. ",
        "21... f3": "I can now think in BxN, BxB, Rf8...but I overlooked the weakness of e5 after the second take. Nothing I could have done about it, neither...",
        "22. cxd6": "BxNg4 doesn't look so good...",
        "22... Bxd6 23. Nxe5": "...but this is even worse. My Q is not completely lost, but obviously the game will be his soon. So I planned a crazy, crazy idea, being sure he won't have fallen for it... (Alternative moves were: 23... BxN, 24. BxB, o-o!?...",
        "23... Nf4": "I calculated he will think about an overlook from my part, or even a silly NxB+.",
        "24. Nxf7 Ne2+": "Well, he won't lose the Q, right?",
        "25. Kh1 Bxh3": "Now, the crucial moment: Will he \"see\" this very unusual mate pattern? He can still save the game with Rg1 - very simple, and then it's doubtful black has any hope. But my opponent was too hungry...",
        "26. Nxh8 Bg2#": "I couldn't believe it... blit's \"magic\"!"
    },
    "url": "https://gameknot.com/annotation.pl/i-cant-believe-it?gm=63185",
    "gameName": "I can't believe it!",
    "players": "Birjeri (1624) vs. damafi (1500)",
    "opening": "English opening (A17)"
}