{
    "moves": {
        "1. e4": "the classic. this is an anotation that I make later. es una agregacion que hago despues. pensando en el partido. este partido me preocupa porque gane muy rapido y no se por que. cuales fueron los errores de las piezas negras. this game puzzles me because I win so quickly and I don't know why. I am thinking about the mistakes of the black. And then I write later. ",
        "1... e5": "the same, the usual",
        "2. f4": "king gambit, very dangerous, for both. El gambito del rey muy peligroso para ambos jugadores. pienso que se pasa directamente al final. es muy violento este gambito. Le sigo agregando comentarios a este partido. ",
        "2... exf4 3. Nf3 d5 4. exd5 Qxd5 5. Nc3 Qd8 6. Bc4": "amenazando el punto f7. threatening the f7 square.",
        "6... Bg4": "this have to be a mistake olso. A waist of time. Este tambien debe ser un error, supongo. Una perdida de tiempo. Este es el primer error, recien en la jugada numero 6, si es que realmente es un error. No lo se. ",
        "7. Bxf7+ Kxf7 8. Ne5+ Ke8 9. Qxg4": "en lugar de tomar con el caballo tomo con la dama , esto es para desarrollar otra pieza mas. Instead of taken  the bishop with my knight I take it with my queen. It is for the development of another piece. I am putting another piece on the game. ",
        "9... Qf6": "I think this move must be a mistake, otherwise I don't know why I win . pienso que esto debe ser otro error. ",
        "10. Qc8+": "con este jaque lo obligo a perder la torre del rey. porque el tapa con la dama, yo como la dama . el come con el rey y luego viene el jaque doble. With this check , the black loses his root . ",
        "10... Ke7 11. Qxc7+ Ke8 12. Nd5 Qd6 13. Qc8+ Qd8 14. Nc7+": "the oponent can not take my knigt. ",
        "14... Ke7 15. Qe6#": ""
    },
    "url": "https://gameknot.com/annotation.pl/i-dont-know-why-i-have-won?gm=3506",
    "gameName": "I DON'T KNOW WHY I HAVE WON.",
    "players": "miperralaica (1524) vs. lordmedieval (1506)",
    "opening": "KGA (C36), Abbazia defence, modern variation"
}