{
    "moves": {
        "1. e4": "As usual, my annotations are intended a) to be helpful to lower-rated players and b) to make experienced players laugh and/or shake their heads in horror.",
        "1... c6": "Feel free to correct me as I don't use a computer for the analysis (not out of moral considerations, but simply because I own a Mac and she does not support chess software - only available for PCs).",
        "2. d4": "The Caro-Kann defense: The idea is to support the advance d5 by c6, very similar in this point to the French defense.",
        "2... d5": "With the difference that the Bc8 can be developped immediately (whereas the French 1. ...e6 closes him in).",
        "3. Nc3": "Some people call this opening boring. The interesting thing might be that in many variations you have to switch promptly from attack to defense, and vice versa.",
        "3... dxe4 4. Nxe4 Nf6": "In this variation, black does not fear the double pawn on f6. The more common systems include 4. ...Bf5 (there it is, the early developpement of the Bc8, before the door is eventually closed by ...e6) or 4. ...Nd7 (which allows to bring out the Ng8 avoiding the doubled pawns).",
        "5. Nxf6+ gxf6": "5. ...exf6 is also playable.",
        "6. Bc4": "a natural move, aiming at f7.",
        "6... Bf5": "Black has to bring out his white-squared bishop before it's too late. ...e6 might soon be necessary.",
        "7. Ne2 h5": "Black tries to gain space and already prepares an attack, foreseeing that white is going to castle on the king side. Generally speaking, this variation shows a very aggressive plan from Black's side, who doesn't bother to finish his developpement and to equalize, but attacks very quickly.",
        "8. Bf4": "I might have played 0-0 immediately, but got a bit nervous because of black's early ...h5, and thought I might as well decide later what side I should castle.",
        "8... e6": "A caracteristic move of the Caro Kann defense, opening the way for the black squared bishop and defending the point f7.",
        "9. O-O": "I decide to castle kingside, whatever may come!  9.c3, solidifying the centre, is also possible.\n",
        "9... Bd6": "Offering an exchange, but I dont want to take myself because I dont want to loose the tempo (a thing I've learned reading certain comments on these annotations pages...).",
        "10. a4": "I want to prepare an eventual counter-attack, because black would obviously be forced to castle queen-side (unless the king remains in the center), as black's kingside is wide open, and the advancing pawn could cause some trouble there. Maybe 10. c3, to defend the center, would have been wiser. But I don't want to spoil the possibility of a later Nc3 (maybe after c4).",
        "10... h4": "And there comes black's trouble maker...",
        "11. Bd3": "Trading the bishops would help me to defend. I hope for 11. ...Bxd3, 12. Qxd3 with the idea of a later Qf3.",
        "11... Bg4": "Black does not play the game. In the following sequence I have to defend the king's position and meet threads on the point d4 as well. The immediate thread is 12. ...Bxf4, as my knight is pinned now. I still dont want to take on d6: Black's queen would just take the bishop's place, ready to attack.",
        "12. f3 Bxf4": "And now the black squared bishop cannot be taken because of Qxd4 .",
        "13. fxg4 Be3+ 14. Kh1 h3": "15. g3 and 15. gxh3 leads to 15. ...Qd5  and the mate cannot be prevented. ",
        "15. Be4": "But here my white-squared bishop controls both d5 and g2.",
        "15... f5 16. gxf5 exf5 17. Rxf5": "Black does not manage to dislocate the Be4, he just looses a pawn.",
        "17... hxg2+ 18. Bxg2": "Seems better to me than Kxg2.",
        "18... Qh4 19. h3": "Now white seems to have stopped the attack, at least for the moment. White is one pawn up (not that this seems very important to me here) and I feel that there might be a small window for a counter-attack.",
        "19... Nd7": "This move meets the immediate thread 20. Re5  winning the bishop, it develops the knight and prepares a queenside castle. A very good, though maybe obvious move.",
        "20. Ra3": "What should I do now? Follow my old plan c4 - Nc3 - Qf3? a5 or d5? I feel that there must be some quiet move that gets white ready to attack, but I can't find a good plan. Finally I play Ra3 but I'm not very convinced of this move anyway.",
        "20... Bg5 21. d5 c5 22. Rg3": "If 20. Ra3 might still have been useful, this second rook move really does not seem to improve my position.",
        "22... f6": "Of course.  Now my rooks are awfully placed, they stick between black's defence with no lines to operate. I'm rather down to earth when I finally try this:",
        "23. Rg4": "BEFORE going further, please try yourself to find out what could be the inconvenient of this move.",
        "23... Qxg4": "I don't have to say much more, do I? But I'm sure you enjoyed it this time: Isn't it always a cheerful experience to watch other people's misfortunes?"
    },
    "url": "https://gameknot.com/annotation.pl/i-get-the-initiative-and-dont-know-what-to-do-carokann-b12?gm=7667",
    "gameName": "I get the initiative and don't know what to do... CaroKann (B12)",
    "players": "mirela22 (1746) vs. helmsch (1808)",
    "opening": "Caro-Kann (B16), Bronstein-Larsen variation"
}