{
    "moves": {
        "1. e4 e5 2. Nf3 d5": "The first time I've ever actually had the Maroczy (Elephant) Gambit played against me. I could remember the initial response without any exact theory to back me up.",
        "3. d4 Bg4": "I have no idea if this is book or not. It certainly requires a continuation gambit after 4. dxe5 or else accept an inferior position without queens and in light of the game it's probably fair to say that there is a distinctive lack of compensation.",
        "4. dxe5 Bxf3 5. Qxf3 d4": "In compensation for the white pawn black has given white a pair of doubled pawns and gained a small amount of space with his d pawn but it definitely doesn't feel sufficient, magnified by the weakness of the light squares.",
        "6. Bc4 f6": "Not exactly the prettiest of moves or one I'd even remotely considered to be honest. The kingside light squares prove to be very rickety following this. I considered trying to outright punish the weird looking f6 with e6 but eventually decided to just continue with basic development and pressure whilst letting black's weaknesses win the game for me.",
        "7. O-O c5 8. c3 h6": "This move pretty much finishes things though they were only headed one way regardless to be honest. The light squares are now completely indefensible. Much more sensible was Nc6. Qc7 with the idea of forcing white to resolve the tension in the pawn structure is falling short against exf6, Nxf6, e5, Ng8, Bf4, where black's pieces are all still asleep with white ready to finish the game. The continuations with Nc6 are much less dramatic with White simply intending to improve his position with Bf4 and Re1 before capturing on f6 and playing e5 N.B The idea of Bf4 is to prevent a swap off of queens after exf6, Qxf6 in the future and keep the most amount of firepower on the board to exploit black's weaknesses.   ",
        "9. Qf5": "As pointed out to me, Qh5+ is stronger than this move with similar light square devastation as to the game occurring but simply being more decisive. Comments are much appreciated so thank you to the contributor to that detail",
        "9... Qe7": "Understandable to guard the e6 and f7 squares but giving away an even more valuable point on c8. Assumably black had missed white's continuation.",
        "10. Qc8+ Qd8 11. Qxb7": "The same attentive reader who noticed 9. Qh5+ has pointed out to me the move Bf7+ which I'm actually rather annoyed with myself for missing. Nethertheless Black's position does pretty much fold here so it's easy to see winning lines and not press in searching for alternatives",
        "11... Nd7 12. e6": "Black now loses masses of material",
        "12... Rb8 13. exd7+ Ke7 14. Qd5 Qxd7 15. Qf7+ Kd6 16. Bf4+ Kc6 17. Bd5+ Qxd5 18. exd5+ Kb5 19. Bxb8": "I was looking for something a bit more immediate than capturing the rook with the king as exposed as it is but then being honest got bored at calculating Na3+ prospects. Honestly I don't care too much if there was a mating continuation, it forced resignation so I'm happy enough with the free rook and that was the game.\r\n\r\nN.B. Some nice calculation as to a mating line following Na3+ has indeed been commented on"
    },
    "url": "https://gameknot.com/annotation.pl/i-have-often-repented-speaking-but-never-of-holding-my-tongue?gm=37296",
    "gameName": "I have often repented speaking, but never of holding my tongue.",
    "players": "quiet_knight (1200) vs. miserables_24601 (1195)",
    "opening": "QP counter-gambit (elephant gambit) (C40)"
}