{
    "moves": {
        "1. d4 c6 2. Bf4 d6 3. Nf3 Nf6 4. Nbd2": "Unwise. When black frees the way for the queen to b6, it must be played c3 (or c4) in return, to open the way for the queen to mimic black's move. I tried for this time another way, but, it didn't went so well...",
        "4... Qb6 5. Nb3": "Let's see how this knight behaves. ",
        "5... g6 6. c3 Bg7 7. e3": "The backside of the knight on b3 is that it can't support e4. But I'm not unusual with this scheme, and I felt confident. ",
        "7... Bg4 8. h3": "This bishop is supposed to go to f5, and then be chased by white. But white had another (good?) idea?",
        "8... Bxf3 9. Qxf3 Nbd7 10. O-O-O": "! Daring him. Unfortunately, it was a bad idea, in sight of the developement of the game. ",
        "10... O-O 11. h4": "Looking at RxNh5.",
        "11... e5 12. dxe5": "The semiopen d column justifies my queenside castling. ",
        "12... dxe5 13. Bg5": "Keeping an eye on d8. In case of h6, I'm sure I've been tempted to something like h5.",
        "13... e4 14. Qf4": "Waiting for Nd5 or Nh5, to set the queen on g4. Qh3 was probably better, in the hindsight. A little slip like this can throw the game away. It is very tense, indeed.",
        "14... a5": "I have to be very careful now, and get exactly what will be the dangerous tempoes, the unavoidable moves I'll have to do, and the weakness in c3 if I have to play b3.",
        "15. Bc4": "Last developement move. h5 at once would have been too much to dare even for me. ",
        "15... a4 16. Nd2": "The \"surprise\". This way I am threatening e4.",
        "16... Nd5": "No point in running away. Qxe4 was probably better, but black will have got too much for the pawn. Nxc3 was on his agenda. ",
        "17. Bxd5 cxd5": "I MISSED here Nxe4, with great shame from my part. RxNd7 compensates and e4 is hanging. ",
        "18. Be7": "This was a \"clever\" plan to set the bishop on b4, defending everything. ",
        "18... Be5": "Black was not for my idea... very, very nice game, for a light blitz. ",
        "19. Qg4": "Threatening the N in return. ",
        "19... f5": "Blocking the attack but opening the king's defence. Will I be able to exploit it?",
        "20. Qg5 a3 21. Bxa3": "? It was supposed to be smart, but it was a blunder. I had to accept Bxc3 and go for h5 asap!",
        "21... Rxa3 22. bxa3 Bxc3 23. Nc4": "I give up the knight to prevent the mate on b2.",
        "23... dxc4 24. Rxd7": "There is no mate in d2 anymore, but black will be tempted to take the rook on h1, and this will give time to me for Qe7 or something... with a little luck!",
        "24... Qb2+ 25. Kd1 Qa1+ 26. Kc2": "It would be an exchange, and white will be able to counterattack, ",
        "26... Qb2+ 27. Kd1 Bf6": "Black avoids the threat on the bishop. If Qh6, Rf7 and that's all. ",
        "28. Qf4 Qa1+ 29. Ke2": "Go on, black, your greedyness is my only hope!",
        "29... Qxa2+": "Black knows that he will always have it...",
        "30. Rd2 Qxa3": "My king is now shielded, so I have to activate my other rook and the queen. The material is... EVEN!",
        "31. Qc7 b5 32. Rb1 c3 33. Rc2": "Black will win this, I fear. The two pawns are too strong, ",
        "33... b4": "...but this was a mistake from black I have half-hoped in.",
        "34. Qc4+ Kg7 35. Rxb4": "Black's potential is still great and granite, but a little less overwhelming. ",
        "35... Rd8 36. Rb7+": "Ra4, Qf6 was no fun. ",
        "36... Kh6 37. Qc7": "Well, I just need one tempo. ",
        "37... Qa6+": "Ouch, this looks very bad. ",
        "38. Ke1 Rd1+": "Wonderful! Well played, black! ",
        "39. Kxd1 Qf1#": "I let him play the mate by honor. I hope you had fun."
    },
    "url": "https://gameknot.com/annotation.pl/i-just-lost-it?gm=55312",
    "gameName": "I just lost it",
    "players": "damalfi  vs. 64square ",
    "opening": "Queen's pawn (A40)"
}