{
    "moves": {
        "1. c4 c5 2. g3 Nc6 3. Bg2 b6": "If I was willing to surrender the diagonal, Bxc6 would certainly mess with black's queenside fianchetto.",
        "4. Nc3 Bb7 5. d3": "This is a bit of a gamble as it uses time, but using time allows white to examine the black pawn structure before permanently setting his own.",
        "5... Qc8 6. e3 Na5": "6.e3 wastes more time, but black is not taking advantage of the opportunity to develop.",
        "7. e4": "I really have broken most of Kosten's rules of thumb from Dynamic English.  He recommends playing e4 only after Black commits to e5, but the white formation is one that English players are often familiar with and rely on.  I believe the my experience with the position will pay off.",
        "7... e5": "Thank you!",
        "8. Nge2 Nc6 9. O-O Nd4 10. Nxd4": "Probably an error as 10.f4 would likely lead to an exchange of knights that gives back time I have wasted over the next few moves.  Here the knights exchange.",
        "10... cxd4": "And White is faced with a choice.  Nd5 or Ne2.  Nd5 is routinely played, but it results in trading the knight for black's blockaded bishop.  The center is firmly locked down which allows a kingside assault in certain circumstances.",
        "11. Ne2 Bc5": "Black sould probably deploy his knight and use the waiting move to determine if this really is the best position for the bishop.",
        "12. f4 exf4 13. gxf4": "Always an interesting decision: Nxf4 or gxf4?  I thought that given his central weakness preserving my central strength might pay off.",
        "13... Ne7 14. Bf3 Qc7 15. Ng3 a6 16. Kh1 Ng6": "I saw a flaw which was introduced here.  I cannot hold the f pawn.  Advance it?",
        "17. Bh5": "Threaten an exchange and introduce a new defender.  Holding, but weakly.",
        "17... O-O-O": "I have to be careful about the e pawn because of the pin.",
        "18. Qe2 Bd6 19. Qf2": "Not ideal, but I underestimated his capability to undermine the f pawn.",
        "19... Nh4 20. Bf3 Bxf4 21. Bxf4": "I was expecting black to play some preparation, but black decides to cement his hold on the pawn.",
        "21... Qxf4 22. Bg2": "Keeps an eye on e4, but perhaps I should have considered Be2.",
        "22... Qe5": "A touch surprising.  The queen exchange is not unfavorable and disallows Qxf7.",
        "23. Nf5": "I did contemplate Qxf7.  I think 23.Qxf7 Rf8 24.Qxf8+ Rxf8 25.Rxf8+ Kc7 is a fair bargain for white, but with a queen still on the board, I white has to play fairly carefully.  I actually compelled the trade because knights often do strange things and have considerable power joined with the queen.",
        "23... Nxf5 24. Qxf5": "Now he must take or face the fall of the f pawn.  Given the diminished power of his attack, nothing now discourages the white attack on f7.",
        "24... Qxf5 25. Rxf5 f6": "I think stronger is Rdf8 building to an eventual g6.",
        "26. b4 Rde8 27. a4": "I briefly thought about c5 but the decline of the exchange before I play a4 seems riskier.",
        "27... Re5 28. Rxe5 fxe5 29. Rf1": "The rook exchange gives me control of the file.",
        "29... Kc7 30. Bh3 g5 31. Rf7 Bc8": "Not quite forced, but the piece was inactive before.",
        "32. Bf5 h5 33. h4": "How would you assess this position?  I would say white stands ever so slightly better despite black's material advantage.",
        "33... gxh4 34. Kh2 Kd8 35. Rf6 Kc7": "The b pawn needs protection, and 35...d5 simply loses a piece.",
        "36. Kh3 Bb7": "Perhaps a5?",
        "37. Rf7 Bc8": "Even though I am down on material this suddenly feels more winning.  When I see an oppenent play the same move, a part of me always thinks he could find no improvement and is willing to settle for a draw.",
        "38. Kxh4 b5": "The h pawn is ultimately, now or later, lost.  This only exchanges pawns on an ending that does not clearly favor black.  Better is a5.  I think that over the last several moves black has failed to improve his position.  His king is very nearly trapped, and the bishop controls as few squares as possible.  The rook, tied to the h pawn defense, does not exert influence.",
        "39. cxb5 axb5 40. a5": "Forced, otherwise he gets at least equal compensation for the pawn as his king advances out of its box.",
        "40... Rg8 41. Rh7": "If Kxh5, then Rg3 and suddenly black's game has life.",
        "41... Rg2": "Same idea for black, but it takes longer to accomplish.",
        "42. Re7": "Looking for at least equal compensation.",
        "42... Kd6 43. Re8": "Again looking for equal, or better, compensation.",
        "43... Bb7 44. Rd8": "Once again, the mobility of the black king is a problem.  Rb8 fails.",
        "44... Kc7 45. Rxd7+ Kc6 46. Rd5": "Black cannot prevent the e pawn from falling.",
        "46... Rd2 47. Rxe5 Rxd3 48. Rc5+ Kd6 49. Rxb5": "I missed the best move 49.e5+!",
        "49... Bc6 50. Rc5": "50.e5+ is still viable, but I thought the endgame might prove more difficult.  I now think though that 50.e5+ could reasonably continue 50...Ke7 51.Bxd3 Bxb5 52.Bxd5 with a clear advantage that should easily convert to a win for white.",
        "50... Rb3 51. e5+": "Well, it had merit for reasons beyond the previous analysis!  If only I had played it earlier, but here it allows the black bishop to be attacked while providing a worst-case exchange on the troublesome d pawn.",
        "51... Kc7 52. Be4 Rxb4 53. Rxc6+ Kd7": "The only trick is to avoid losing the rook or bishop after 54...d3.",
        "54. Rd6+ Ke7 55. Kxh5 Rb5 56. Rd5 Rb4": "Tough game for black here.",
        "57. Bf5 d3 58. Bxd3 Ke6 59. Rc5 Rb3 60. Bc4+": "It would only be rude at this point to not resign."
    },
    "url": "https://gameknot.com/annotation.pl/i-like-nothing-so-much-nor-so-little-as-1-c4-c5?gm=24940",
    "gameName": "I like nothing so much, nor so little, as 1.c4 c5.",
    "players": "Jay Kuykendall (1458) vs. Bashkim Rexhepi (1508)",
    "opening": "English (A30), symmetrical variation"
}