{
    "moves": {
        "1. d4 d5 2. c4 e6": "This is, ironically, a relatively uncommon position here on gameknot.  Still, I'm not afraid of playing the QGD -- I'm actually much more afraid of the QGA!",
        "3. Nc3 Nf6 4. Bg5": "The pin on the knight can get annoying, but black has a variety of ways to respond.",
        "4... c6": "I'm aiming for a setup that strong-points d5, protects the Nf6 with Nd7, and then the queen heads to a5, with a number of threats.  White plays the opening well, though.",
        "5. e3 Nbd7 6. Nf3 Qa5": "The defining move of the Cambridge Springs variation.  Black threatens a number of strokes, including Bb4, winning a pawn, and dxc4, discovering an attack on the Bg5.",
        "7. Nd2 Bb4 8. Qc2": "The best two moves to defend everything.  Notice that dxc4 by black is met by Bxf6 for white, and black gains nothing.",
        "8... O-O 9. Bh4 Re8 10. Bd3": "Now white is playing for a buildup of forces aimed at black's kingside, and so I start to get defensive.",
        "10... Bxc3 11. bxc3 dxc4 12. Nxc4": "A strong recapture, hitting the queen and threatening to sink in to d6.",
        "12... Qh5 13. Bg3 b5": "Missing that white can play Nd6, but something had to be done to get the light-squared bishop active!",
        "14. Nd6 Rd8": "Now black's 9th looks silly, as the rook simply had to move again.  Black's pieces are not coordinated well at all, whereas white has a well-deployed army.  At this point, I need a plan.",
        "15. O-O Nf8": "So I decide to regroup on the kingside and try to get some fireworks happening there.",
        "16. a4": "Wisely going after black's weak queenside.",
        "16... Ba6": "Finally, a chance to get the bishop involved.  If I can get it exchanged for white's good one, I'll be a lot happier.",
        "17. axb5 Bxb5 18. Bxb5 cxb5": "Mission accomplished.  Now white can't win a pawn with Nxb5, but flanders has plans to build up pressure on it...",
        "19. Qd3": "Now, Nxb5 is a real threat.",
        "19... a6": "But this defends it adequately for now.",
        "20. Ra5 Ng6": "I figure that now's a good time to build up my pressure on the kingside -- I notice that white's back rank is weak with the second rook out of there.",
        "21. c4": "!  I like this move for white -- it showcases just how weak black's queenside is, and how poorly positioned black's queen is.",
        "21... e5": "This was the best complication I could find, made possible by Ng6 the move before.",
        "22. Ne4": "Giving me breathing room!",
        "22... Nxe4 23. Qxe4 exd4": "And now I notice that 24. cxb5 axb5 25. Rxa8 is awful for black!\n\nNonetheless, these exchanges have freed up my position a lot, and that's a general rule for the person with cramped development, to seek exchanges (even if you're down a pawn).",
        "24. exd4": "I thought cxb5 was better for white, although that passed pawn on d4 could be bad for black now.",
        "24... f5": "Still, it looks like we've finally got a game going here!  Let's take stock.  White's got to move his queen, after which black should be free to take on c4, and there should be a race between the passed pawns to see who can make something happen first.",
        "25. Qe6+": "This check is the only move that allows white to keep his c-pawn.",
        "25... Kh8": "Much better than Kf8, which would get me killed by 26. Bd6 .",
        "26. Be5": "Threatening a variety of things -- still, I've wanted that bishop out of there for a long time, and so I'll take advantage of the opportunity!",
        "26... Nxe5 27. Qxe5": "I wondered if dxe4 was better, but then I realized how weak white's back rank is (black's is weak too)... if 27. dxe4, then Rd1 is strong for black!",
        "27... bxc4": "... and now I get my passed pawn.  White can respond Qxf5, but after the exchange of queens black plays Rxd4 with a big advantage!  I'm pretty happy with the outcome of all of this, although I'd be lying if I said I had planned it all this way.",
        "28. d5": "And now white pushes his pawn, which has the added bonus of preventing black from playing c3.",
        "28... Rde8": "This kicks the queen off of her perch, and off of the e-file entirely.",
        "29. Qd4": "Behind the passed pawn is the place to be.  Now, I have to address the threat to the pawn on c4, and notice also that the g7 pawn is pinned.  So after a think, I decided on...",
        "29... Qe2": "Qe2; probably the best move.  While it doesn't support the advance of c4, it prevents the Rf1 from moving into action, since any move leads to Qe1  and mate to follow on the back rank.",
        "30. d6": "...whereas white is free to push his pawn.  Still, the idea in the last note gave me a new idea, especially since he didn't play something defensive like g3 or h3.  Notice that the Re8 cuts off all of the white king's flight squares, and his back rank is weak.  So, with the idea of forcing a mate on the back rank, I play...",
        "30... Rab8": "Rab8!?  This is a threat that must be addressed, although there are many good ways to do it; the safest being Qd1.  But white overlooked my threat, and played:",
        "31. d7": "d7?  Threatening to take the rook on e8, to promote to a queen, and give white an overwhelming advantage.  There's just one oversight...",
        "31... Qxf1+": "!!  Sacrificing my queen *on purpose* for the very first time on gameknot!  After 32. Kxf1 Rb1  33. Qd1 Rxd1# is checkmate!  \n\nThanks to flanders for a good game and the chance to do something amazing!  Hope you enjoyed it, too."
    },
    "url": "https://gameknot.com/annotation.pl/i-love-a-happy-ending?gm=6985",
    "gameName": "I love a happy ending!",
    "players": "flanders (1756) vs. ethansiegel (1777)",
    "opening": "QGD (D50), 4.Bg5"
}