{
    "moves": {
        "1. e4 e6": "this works really well for me. I've found my opening on black.",
        "2. Bd3": "? could someone please explain this d-suppressing insta-development?",
        "2... c5": "the snare is set and the d7 pawn is the bait when it is pushed.",
        "3. Qf3": "????ok, maybe an attack of f7, but the outdated four move checkmate requires bc4, not bd3",
        "3... Nf6 4. Nc3 d5": "I'm ready for midgame, but incase they aren't I have some more moves I could throw in.",
        "5. e5": "at this moment, I knew I HAD to beat this guy. ignore my trap will you!",
        "5... Nfd7": "my knights are poorly locked, and now c5 looks more protected (the point is it is supposed to look free) and d5 is now less protected, if he took with knight and queen, he would have the upper hand. suggestions?",
        "6. Qg3": "????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????",
        "6... c4": "I did this to lock in the whites white bishop. it also freed up my bishop.",
        "7. Be2": "retreat.",
        "7... Bb4": "i know, i know, Qxg7, don't remind me. ",
        "8. Qxg7 Rf8": "sigh. i hate when i have to move my rook there. ",
        "9. Bh5": "? ok.... even though f7 is fairly well defended, let's attack it anyways!",
        "9... Bxc3": "at this point, the chink in his armor is lack of development (so is mine) I, however, take control of the situation by doubling up pawn rows. ",
        "10. dxc3 Nc6": "its about time i got this knight out.",
        "11. Bg5": "you know what? to heck with you. ",
        "11... Qb6 12. b4 cxb3 e.p.": "en passent. ",
        "13. axb3 Ncxe5": "I planned that. ",
        "14. Bf6": "i did not plan that. ",
        "14... Qc7": "suggestions?",
        "15. Ne2": "this was so that if i took c3 i wouldn't have an awesome fork. however, if i can freeze that knight, i have an even better move. ",
        "15... Qc5 16. Bxe5 Nxe5 17. Qxe5": "I see we've given up on f7. ",
        "17... b6": "to develop bishop, not to defend the queen.",
        "18. Qxe6+": "oh, this is such a good move. you know, except for",
        "18... Bxe6": "that.",
        "19. c4 dxc4 20. Bf3": "white is hopelessly attempting to trade pieces, trying to eliminate both sides forces, apparently. ",
        "20... Qb4+": "I don't want to trade. ",
        "21. Kf1 Rd8 22. Bc6+ Bd7 23. Ba4 Bxa4 24. bxa4 Qb2 25. Rc1 Rd2": "c2 is the obvous attack. I don't want to be obvious, though, pretty counter-productive.",
        "26. f3 Rxc2": "26...Rxc2 is not a mistake. it is followed by 27.r1xc2Qb1+ 28. Kf2Qxc2",
        "27. Re1": "bravo for noting impending danger. a knight and bishop placed right would be nice right now. \r\n(b@c5, then 28...Nd2# would be awesome, too bad i traded my knights. )",
        "27... Qb3": "don't look at this next couple of moves, i did not see the impdinding danger of Nd4 until was too late.",
        "28. h4": "luckily, he didn't either.",
        "28... Qd3 29. Kf2 h5 30. Kf1 f5 31. Kf2 c3 32. Rhf1": "ARGH. I just noticed mate move Qd4. that would have been much nicer. stupid knight, I thought I had to worry about that, i forgot it's pinned! ARGH! learn from my mistakes.",
        "32... Rd2": "c3 becomes the turning point of the game.",
        "33. Kg1": "he saw Qd4, I did not. i need to notice these things",
        "33... c2": "chess diehards, please look away.",
        "34. Nf4+": "ouchouchouchouchouchouchouchouchouchouchouchouchouchouchouchouchouchouchouchouchouchouchouchouchouchouchouchouchouchouchouchouchouchouchouchouchouchouchouchouchouchouchouchouchouchouchouchouchouchouchouchouchouchouchouchouchouchouchouchouchouchouchouchouchouchouchouchouchouchouchouchouchouchouchouchouchouchouchouchouchouchouchouchouchouchouchouchouchouchouchouchouchouchouch",
        "34... Kf7 35. Nxd3 Rxd3 36. Re2 Rc3 37. Rfe1": "? its such a weak attack i wouldn't waste time with it. especially with the f8 rook.",
        "37... Kg8 38. Re2e6 c1=Q 39. Kh2": "!?",
        "39... Qf4+": "watch this. this is dictionary definition of poetic (what was re6 doing?)",
        "40. g3": "that would be the end of the game for white. but we continue for two more moves.",
        "40... Rc2+": "Re2 could've stopped an easy mate. however he didn't.",
        "41. Kh3": "he didn't do h1 because of Qxf3 and it gets messy. why same goes for g1 and Qxg3 can you find mate in two for black!?! [hint: you lose something] don't look at the next two unless you think you have an answer. ",
        "41... Qg4+": "41...QG4!!!!!!!!!!!!?!!?!???????????????!?!?!?!?!?!?!?!?!?!?!?!?!\"?!?!?!?!?!?!?!?1?!?!?!?!?!?!?!?!?!?!?!?!?!?1?!?1?j surely i must be insane! why would I sacrifice my QUEEN to a PAWN for a CHECK!",
        "42. fxg4": "because this is the dictionary definition of 'poetic.' that's why mate by pawn.",
        "42... fxg4#": "sometimes you do have to sacrifice pieces to come out ahead. but just LOOK at that. that is simply lovely. its not every day a pawn makes the final move in mid-board, so you have to savor these kinds of victories. "
    },
    "url": "https://gameknot.com/annotation.pl/i-play-black-and-i-own?gm=35139",
    "gameName": "I play black (and i own)",
    "players": "???  vs. ??? ",
    "opening": "French defence (C00)"
}