{
    "moves": {
        "1. e4 c5": "The Sicilian defense.",
        "2. Nc3 Nc6 3. f4": "The Grand Prix attack.",
        "3... e6 4. Nf3 d5": "Now, the game shares some similarities with the French defense.",
        "5. Bb5 Bd6": "In the French, it is more common to develop the bishop to e7 and the king knight to f6.  If white plays, e5 at some point, the knight is rerouted to d7.",
        "6. d3": "6. exd5 was probably better.  6. e5 Bc7 7. d4 was also possible.",
        "6... Nge7 7. O-O O-O 8. e5 Bc7 9. d4": "Turning the game into an advanced French where d3-d4 was a wasted tempo.",
        "9... c4": "Black should've either maintained the tension in the center, or captured on d4..",
        "10. Bxc6": "The bishop has no future, so white gets what he can for it.",
        "10... bxc6": " or 10. ...Nxc6 intending to advance the b-pawn.  That's what I would've done.",
        "11. g4": "When you have a spatial advantage, you must attack.",
        "11... Ng6 12. Qe1": "A typical queen manuver to sore up e5 and enable the transfer of the queen to the kingside via the e1-h4 diagonal.",
        "12... Qe7 13. Ne2": "freeing the c-pawn to aid in the defense of the d4 pawn, and preparing to shift the knight to the kingside.",
        "13... c5": "Black must try to break up white's center.",
        "14. c3": "White's spatial advantage is clear.",
        "14... cxd4 15. cxd4": "15. Nexd4 was much better.  I don't know what I was thinking when I played 15. cxd4.  Temporary insanity!  At least, I hope its temporary!",
        "15... f6": "The only chance to challenge White's center.",
        "16. Qg3 Ba6 17. Nc3": "If I had maintained the pawn on c3, black would've been stifled.",
        "17... fxe5 18. fxe5 h6": "Creating a target.",
        "19. h4 Bd8 20. g5 h5": "Keeping the kingside closed.  A good move.",
        "21. Be3 Rb8 22. Rf2 Ba5 23. Raf1 Bb5 24. Ne1 Bxc3 25. bxc3 Qa3 26. Rf2xf8+ Rxf8 27. Rxf8+ Qxf8 28. Bc1 Be8 29. Nc2": "A whopper of a mistake.  29. Ng2 was indicated.",
        "29... Qf5": "Now, Black has a big edge.",
        "30. Ne1 Qb1 31. Bd2 Qxa2 32. Nf3 Qb1+ 33. Kf2 a5": "The passed a-pawn can be stopped, but it will divert white's forces to the queenside.",
        "34. Qg1 Qb2 35. Qc1 Qa2 36. Kg3 a4 37. Ne1 Qb3 38. Nc2": "While white wastes time on the queenside, black redeploys his pieces on the kingside.",
        "38... Kh7 39. Na1 Qb5 40. Nc2 Ne7 41. Nb4 Bg6": "Now the bishop has been activated.  When pawns are locked in a chain as they are in this game, you want your bishop in front of the chain.",
        "42. Qa3 Qe8 43. Na6 Qf7 44. Be1 Nf5+ 45. Kh2 Nxh4": "Black did not need to sacrifice the knight.  45. ...Ne3 was more than sufficient.",
        "46. Bxh4 Qf4+ 47. Bg3 Qd2+ 48. Kh3": "48. Kg1 was also losing.",
        "48... Bf5+ 49. Kh4 Bg4": "Setting up a mating net.",
        "50. Qa1 Qg2": "There is no way to protect h3.",
        "51. Qb1+": "or 51. g6  Kxg6.",
        "51... Bf5 52. g6+ Kxg6": "A nice mating net finishes white off. 0-1."
    },
    "url": "https://gameknot.com/annotation.pl/ic-dogs-team-1-mini-tournament?gm=1837",
    "gameName": "IC DOGS Team 1 Mini Tournament",
    "players": "yellowlab (1828) vs. defeated (1432)",
    "opening": "Sicilian (B23), Grand Prix attack"
}