{
    "moves": {
        "1. e4 e5 2. Nf3 Nc6 3. d4": "The Scotch.",
        "3... d6": "This is not the best defense.  In the Philidor defense: 1. e4 e5 2. Nf3 d6, the queen knight is often developed via d7 rather than c6, where it is in this game.  3. ...exd4 is the standard continuation, often leading to the two knights defense.",
        "4. Bb5 a6": "Black does not have time for this.  The position is different from a Ruy Lopez, because the moves d4 and d6 have already been played.",
        "5. Bxc6+ bxc6 6. dxe5": "Now, white has won a pawn.",
        "6... Bg4 7. exd6 Bxd6": "Black hopes to create counter chances based on the two bishops.",
        "8. h3": "So, white would like to eliminate one of them.",
        "8... Bb4+": "This isn't a good idea, because white can now force the trade of at least one of the bishops.  Notice that the move actually helps white complete his development.  8. ...Bh4 would've been better.  8. ...Bxf3 9. Qxf3 would also be good for white.",
        "9. Bd2 Bxd2+ 10. Nbxd2": "Look at the position after white's 8th move and compare it to this one.  After white's 8th move it is black's turn to move.  What has happened between then and now?  The dark square bishop's have been removed (robbing black of the two bishops) and the white knight has moved from b1 to d2.  Black has accelerated white's development and done nothing about his own.  Always be suspicious about giving check, especially with a piece that's already been developed.  Ask yourself whether the move helps you opponent's development.",
        "10... Bh5 11. Qe2": "White is about to complete his development, has an extra pawn, and I haven't even mentioned black's crippled queenside pawns.  The only way to compensate for such structual flaws is to attack.  White's advantage is most pronounced in the endgame, so white will generally encourage any further reduction in material.",
        "11... Nf6 12. O-O-O O-O 13. g4": "Now that white knows where black's king lives, it is time to storm the castle.",
        "13... Nxg4": "This move loses more material.  The pin on the knight on f3 is a minor annoyance, but it is not worth the loss of the knight. 13. ...Bg6 was better.  Even then, white's advantage is significant, however.",
        "14. hxg4 Bxg4 15. Qe3": "Preparing to break the pin.",
        "15... Qf6 16. Rdg1": "Now the f3 knight is free to move.  Notice also the half-open g and h files which will be used by the white rooks to attack the black king.",
        "16... Rab8": "A nice defensive try.  It is often possible to meet an attack (such as the one on black's g4 bishop) with a counter attack (in this case against b2).",
        "17. Qd4": "Again, white would encourage the trade of the queens in order to reach a winning ending.",
        "17... Qe6": "This move losses more material, but it is difficult to suggest any improvement.",
        "18. Ng5 Qxa2": "The white king is quite safe, and the defense of the bishop has been abandoned.",
        "19. Rxg4": "1-0.  Notice that white holds everything together after 19. ...Qa1  20. Nb1."
    },
    "url": "https://gameknot.com/annotation.pl/ic-dogs-team-1-mini-tournament?gm=1851",
    "gameName": "IC DOGS Team 1 Mini Tournament",
    "players": "yellowlab (1853) vs. tonyr2506 (1469)",
    "opening": "Scotch opening (C44)"
}