{
    "moves": {
        "1. Nf3": "Here is a bullet miniature from the ICC.  It is a book trap from the Reti-Slav setup, when Black plays ...Bg4.  This is traditionally known as the Capablanca system.",
        "1... c6": "Although play sometimes transposes into a Closed Catalan, I always like seeing this move as the modern treatments of the New York ...Bf5 and Capablanca ...Bg4 lines are quite unknown at club level.  I'm not exactly sure why, as they are quite aggressive options for the White player.",
        "2. c4": " ",
        "2... d5": "Black supports his center in Slav fashion and keeps the h3-c8 diagonal open for the light-squared bishop.",
        "3. g3": "3. d4 is probably more sound, as it prevents 3...d4 from Black, but players who opt for a setup based approach, aren't likely to deviate from their knowledge base.",
        "3... Nf6": "...Bg4 is another option, when play can transpose.",
        "4. Bg2": " ",
        "4... Bg4": "I think the modern response to this opening puts the soundness of 4...Bg4 into question.  Obviously Black can play more solid than he does in this game, but White's next move shows how easily Black can run into troubles if he makes standard moves!",
        "5. Ne5": "The standard way to play was 5. b3, followed by the double fianchetto and a pawn on d3.  This is a little more ambitious!",
        "5... Bh5": "...Bf5 can transpose also.",
        "6. cxd5": "Clarifying the central position, but also preparing an insidious tactic.",
        "6... cxd5": "Black could avoid the whole mess with 6...Nxd5, but White will still have the advantage due to the center majority and the more harmonious development of his pieces.  That's the plan, anyway.",
        "7. Qa4+": "This check prepares some action on the 4th rank with tempo.",
        "7... Nbd7": "...Nfd7 just drops the d-pawn for nothing.",
        "8. Nc3": "Development with tempo on the d-pawn.",
        "8... e6": "Black's setup looks pretty resilient, exept for my next move.",
        "9. g4": "The Queen on a4 makes this possible.",
        "9... Bg6": " ",
        "10. h4": "Now the bishop is going to be trapped.  Black has to give it up under not-so-favorable circumstances.",
        "10... h5": "And this probably isnt the way to do it.  ...h6 has been tried and even ...Bc2, when White should desperado the e5-knight with Nxf7!",
        "11. g5": "Driving the knight back to g8, but also fixing the Black pawns after White's 12th move.",
        "11... Ng8": " ",
        "12. Nxg6": "The Black king will have no shelter.",
        "12... fxg6": " ",
        "13. Qc2": "White's initiative has turned into a deadly attack.",
        "13... Kf7": "...Ne7 is better as Black isnt losing immediately.",
        "14. Nxd5": "Clearing the material from the Black king's defense.",
        "14... exd5": "...Rc8 is better, but White is still winning, even after a move like Nc3.",
        "15. Bxd5+": " ",
        "15... Ke8": "Now mate is not far off!",
        "16. Qxg6+": " ",
        "16... Ke7": " ",
        "17. Qe6#": "In my opponents defense, it was a bullet game."
    },
    "url": "https://gameknot.com/annotation.pl/icc-bullet-reti-slav-book-trap?gm=11009",
    "gameName": "ICC Bullet Reti/Slav Book Trap",
    "players": "MybookRD  vs. Some 1800 player ",
    "opening": "Reti opening (A04)"
}