{
    "moves": {
        "1. Nf3": "I'm back after a chess break.  Here is a game I played on the ICC at a 1 minute time control.",
        "1... d5": "The main line Reti, however, this can transpose into the Catalan or after 3. d4 any number of 1. d4 lines.",
        "2. c4": "Khalifman and Kramnik both recommend 2. d4 here, as 2...d4 (a reverse Benoni) can be a little uncomfortable if you are not used to it, however, the extra tempo only benefits white.",
        "2... dxc4": "Black chooses to abandon the center and maybe try to hold the pawn.",
        "3. e4": "A little played continuation, which Nigel Davies advocates in his book on the Reti and a continuation that I employ frequently for its shock value.\n\n3. e3 would lead to lines similar to the QGA.",
        "3... c6": "Trying to hold the pawn with 3...b5 is to weakening after 4. a4 c6; 5. ab cb; 6. b3!\n\n3...Nf6; 4. Bxc4 Nxe4? and white can recover the pawn with a cute little tactic.  Can you figure it out?\n\nThe correct move is 3...c5, taking advantage of the dark-squared weakness.",
        "4. Bxc4": "White's position is being readied for a direct assault on the black king.",
        "4... e6": "Black falls further behind in development.  4...Nf6 was probably better.",
        "5. O-O": " ",
        "5... Bd6": " ",
        "6. d4": "best.",
        "6... Ne7": "Black's development is a little cramped.",
        "7. Nc3": " ",
        "7... O-O": "Not a bad move, but in this quick time control, the attack will be very quick.",
        "8. Bd3": "Setting up the trap!!",
        "8... Na6": "??  Allowing the Greek Gift sacrifice on h7.",
        "9. e5": "Clearing the line to h7 with tempo.",
        "9... Bb8 10. Bxh7+": "The attack begins.",
        "10... Kxh7": "After 10...Kh8; 11. Ng5 g6; 12. Qf3 Nf5; 13. Bxg6! decides the game in White's favor.",
        "11. Ng5+": "Check!",
        "11... Kg8": "11...Kg6 is the best defense, however, it still loses after 12. Qg4.\n",
        "12. Qh5": "Mate is unavoidable.",
        "12... Re8": " ",
        "13. Qxf7+": " ",
        "13... Kh8": " ",
        "14. Qh5+": "The standard mating mechanism in this position.",
        "14... Kg8": " ",
        "15. Qh7+": "Here I let the ball drop, White is still winning, but Black can forstall mate by sacrificing material.",
        "15... Kf8": " ",
        "16. Qh8+": " ",
        "16... Ng8": " ",
        "17. Qh5": " ",
        "17... Qe7": "?????? 17...Nh6 keeps him afloat for a little while longer.",
        "18. Nh7#": " "
    },
    "url": "https://gameknot.com/annotation.pl/icc-bullet?gm=17961",
    "gameName": "ICC Bullet",
    "players": "Me  vs. Opponent ",
    "opening": "Reti accepted (A09)"
}