{
    "moves": {
        "1. d4 d5": "\n",
        "2. e3 Nf6 3. Bd3 e6 4. Nd2": "J'ai retenu l'idée de Ysaacov (j'ai oublié son nom).",
        "4... c5 5. c3 Nc6 6. f4 Bd6 7. Ngf3": "Première boulette. 7...cxd 8.exd n'est pas possible. Est-ce que 8.Cxd4 est mauvais ?",
        "7... O-O 8. O-O cxd4 9. exd4": "je me suis même pas rendu compte que f4 va tomber, je suis complétement ailleurs.",
        "9... Bxf4 10. Ne5": "oups, allez c'est parti pour donner un deuxième pion. Là je me suis demandé si je n'allais pas arrêter et aller plutôt récupérer au lit. mais je me suis dit que vu le elo de mon adversaire, j'ai des chances néanmoins. Et puis c'est bon pour fortifier le moral de jouer des positions moches.",
        "10... Nxe5 11. dxe5 Bxe5 12. Nf3": "Bon 2 pions en moins pour rien mais peut-être que les diagonales pourront faire une attaque sur le roi.",
        "12... Bd6 13. Qe1 Qb6+ 14. Kh1 Bd7 15. Qh4": "Allez banzaiiiiiiii, au moins je rigolerais un peu.",
        "15... Be7 16. Ng5": "j'ai pris pas mal de temps pour jouer ce coup. Non pas que j'ai calculé quoi que ce soit car c'est à mon avis la suite type pour attaquer le roi mais.....je me suis tout simplement endormi quelques minutes devant l'écran sans même m'en rendre compte :-D",
        "16... h6 17. Nf3": "Avec l'idée de balancer Fxh6. Le petit roupillon me permet de commencer à émerger et d'essayer de calculer quelque chose.",
        "17... Qd6 18. Bxh6 Ne8": "Là maintenant je suis sur qu'il y a quelque chose à faire. Flûte je suis encore tout embrouillé du cerveau, je perçois que Fe7 est attaquable, 19.Fh7 me semble pas mal mais dès que j'essaye de calculer je mélange les lignes. Une horreur.",
        "19. Bh7+ Kh8": "Je ne vois pas comment le finir. Je pense toujours qu'il y a quelque chose à faire. Mais là je ne vois pas, et c'est une question de niveau tactique qu'il me manque, crevé ou pas je ne crois pas que cela change pour cette fois.__Et si je ne vois pas le coup qui tue et bien la partie va être perdu.",
        "20. Bxg7+ Kxg7": "Aie aie, je suis en train de m'embourber.",
        "21. Qg4+ Kxh7 22. Ng5+": "je n'ai pas l'impression que je vais avoir le temps de remonter ma tour.",
        "22... Bxg5 23. Qxg5 f5 24. Rf3": "f7 ne me semble pas contrôlable, c'est mort.__Au moins j'aurai su balancer une attaque, soyons positif :-)",
        "24... Ng7 25. Rh3+ Kg8 26. Qg6": "histoire de, mais bon sans espoir. ",
        "26... Qe7 27. Rg3 Rf6": "{Game 1126 (mrtoduvet vs. BigAlex)  mrtoduvet resigns\n"
    },
    "url": "https://gameknot.com/annotation.pl/icc-internet-chess-club?gm=49606",
    "gameName": "ICC, Internet Chess Club",
    "players": "mrtoduvet (1458) vs. BigAlex (1397)",
    "opening": "Queen's pawn (D00), stonewall attack"
}