{
    "moves": {
        "1. e4": "Bobby Fischer loved this move, and who am I to criticize?  This allows me to push forward my gambits as quickly as possible--and I mean real gambits, not like the positional \"Queen's Gambit\" business.",
        "1... e5": "This move is obviously well-respected, though not as popular as 1. c5.",
        "2. Nf3": "I would say I've experimented quite a bit against the symmetrical king's pawn opening.  I've dabbled in the King's Gambit, the Danish, the Ruy Lopez, the Two Knights/Guicco Piano.  Lately, my sights have turned on the exciting Halloween Gambit, so here we go!",
        "2... Nc6": "2...d6 is possible, but somewhat passive.  Usually, black must give the bishop pair by 2...d6 3. d4 Bg4 (else 5. dxe5 dxe5 6.Qxd8 will leave white with a better queenless middlegame) 4. dxe5 Bxf3 5. Qxf3 dxe5 with white having a slight advantage.\nSurely, this is by far the most popular 2nd move for black.",
        "3. Nc3": "This is provocative.  On the one hand, it creates a patzer-like impression; my c-pawn is blocked, I'm not generating threats, I'm not ready to castle short.  But I'm in no mood for a tame four knights game.  Blood will soon fall on the table.",
        "3... Nf6": "This is the most popular move for black, though there are some important alternatives:\nA) 3...d6 is slightly better for black here than on move 2.  Here, black now defends the queen with the knight and so may consider keeping the bishop pair and if white exchanges on e5, recapture with that same c6-knight.  Still, if white refrains from this capture and just holds the center with d4, he will have slightly the better chances thanks to his strong center and space advantage.\nB) 3...Bc5 allows the fork trick, but I have found that white is left with some difficulties.  If I remember correctly, the line runs: 4. Nxe5 Bxf2+ 5. Kxf2 Nxe5 and now there's a bit of a threat of Qf6+ which white must meet.  I think 6. d4! Qf6+?! 7. Kg1 should leave white better, with a timely h4 and Rh3 to free that sad piece.  Meanwhile, the black knight will be shuffled to the inferior e7 square and white maintains the two bishops with a safe king.\nC) 3...Bb4 is the last, and possibly most reasonable try.  White can play 4. Nd5 and on Ba5 we have \n     i) 5. b4?! Bb6 6. Nxb6 axb6 is too costly for white in tempo and the weak half-open a-file, and b4 pawn.\n     ii) 5. Bb5 transposes to a sort of strange Ruy Lopez, with even chances.   \n     iii) 5. c3 looks to follow through with a pawn storm either in the center or the queenside.  Flexible and good, this is    \n          my preferred method.\nNote that Ba5 is not forced; black can play Nf6 or Bc5, with the former giving up the bishop pair for insufficient pressure and the latter being met along the same lines as B) above.",
        "4. Nxe5": "!? This move signals the Halloween Gambit.  White gives up a piece for active piece play, space, and an attack.  I believe that theory holds that the gambit gives white enough, but no more than enough, compensation, with many chances for black to equalize.  Consequently, it is a rare guest at the GM or IM levels, where winning with white is key.",
        "4... Nxe5": "There is absolutely nothing else to consider.",
        "5. d4": "The appropriate follow-up.",
        "5... Ng6": "This is, I think, marginally the main line.  The nearly as popular alternative 5...Nc6 is met with a different strategy, with the main line running:\n6. d5 Ne5 7. f4 Ng6 8. e5 Ng8 9. d6 and the struggle revolves around white trying to plant a knight on c7, black trying to snipe the d-pawn.  There could follow: 9...Qf6 10. Nb5 Kd8 11. Be3, with an unclear position.",
        "6. e5": "Here, white's main idea is to meet 6...Ng8 with Bc4 and Qf3, going straight for the kill.  Black is not without resources, but it will be a long defensive task; on the other hand, should he rebut white's initiative, black will have a handy extra minor piece!",
        "6... Qe7": "This is not the main line, which is Ng8.  At this point, I was out of book.  So the point is clear: White's e-pawn is pinned, so the knight cannot be taken.  It seems that white can try Bc4 and castle, but then black has time to play d6 and maybe Be6.  White must be alert and not let that precious initiative slip away.  So instead of sticking with the plan, it's time to improvise.",
        "7. Be2": "This move seems right.  White can castle next, renews the threat to the knight and overall just holds the position well.  ",
        "7... Ng8": "Now this is forced.",
        "8. Nd5": "!?  This move is thematic, but it is unclear whether this is really improving white's position here.  The tempo black loses will be regained by a timely c6.",
        "8... Qd8": "Black must cover the c7 square.",
        "9. O-O": "If only I could place a knight on the f3 square, white's crushing lead in development would surely be decisive!  Piece down, though, things are less clear.  ",
        "9... c6": "The knight must be pushed back lest black's queen suffocates.",
        "10. Nc3": "This is the best square, not interfering with the DSB and still eying the e4 square, and the new hole on d6.",
        "10... Be7": "?! Black's position is in a bad way, but maybe Black could have tried Ne7-d5? Or perhaps Bb4 followed by Ne7?  Here, it is hard to see how black will castle, short or long, except by playing Nh6.  But white isn't just going to sit on his hands and let black do that...",
        "11. f4": "!  Kicking the attack into full gear.  This is the most enterprising continuation.",
        "11... Nh6": "This faces a tactical problem, though it is consistent and hard to find an alternative.",
        "12. f5": "This wins a piece flat out.  For if the knight moves...",
        "12... Nf8 13. f6": "This undermines the h6 knight.",
        "13... Bb4": "Perhaps Black can try some other way of giving the piece back, say 13...Ne6.  Either way, white has a very comfortable position.",
        "14. fxg7": "Triple attacking both knights and the rook, including a promotion threat.  What more can you ask for in a move?",
        "14... Rg8": "This is \"best\".  Now if white gets too greedy too quickly and tries 15. gxf8 Bxf8 keeps black somewhat alive, though very uncomfortable.  Superior is",
        "15. Bxh6": "Defending the strong pawn and forcing black to take the time to capture it.",
        "15... Ne6": "Black is really bankrupt.  Not moving the knight loses it (e.g. 15...Qh4  16. gxf8+ and the bishop escapes).  I had considered Ng6, where I planned Bc4.  Now I come from the other side.",
        "16. Bh5": "Attacking f7.",
        "16... Rxg7": "This is desperation, but what else?",
        "17. Bxg7 Ng5 18. Bf6": "This is sufficient for the win, but also strong was Ne4, threatening both Nd6+ and Nf6+",
        "18... Be7 19. Bxg5 Bxg5": "Getting the f7-pawn by force.  My technique is not the fastest way to mate, certainly, but it is enough.",
        "20. Ne4": "?! This move is a mistake.  Instead, white has far stronger ideas with Rxf7--and Qf3, Rf1, and mate (in some order) to follow.  Of course, black's position is quite poor, so he cannot exploit white's inaccuracy, and the line chosen is still good enough to win.  The rest of the game needs no comment, or has no insight from me at least, so I'll leave it to the readers to pick it apart if they are so inclined.",
        "20... d6 21. Nxd6+ Kd7 22. Rxf7+ Be7 23. Bg4+ Kc7 24. Bxc8": ""
    },
    "url": "https://gameknot.com/annotation.pl/icc?gm=38160",
    "gameName": "ICC",
    "players": "White  vs. Black ",
    "opening": "Four knights (C46), Schultze-Mueller gambit"
}