{
    "moves": {
        "1. e4": "This was my 18th game against Jo.  We started with a string of draws, then she beat me game after game after game (if these had been rated, her rating would have been marginally higher, mine lower - her choice).  Finally, after she's got me playing against masters like Freddy and annotating my games so that they're criticised constructively by the likes of ionadowman, easy19, dmaestro, nuntar and ruachessnut  (thanks lads), I've finally broken my duck.",
        "1... c5": "We've been varying the openings a lot.  Jo reverts to traditional territory and I reply with my favourite Sicilian.",
        "2. Nf3 d6 3. d4": "At last an orthodox response!  I'm heartily sick of 2. c3, 3. c3, 2. Nc3, 2. Bc4, 3. Bc4, 2. Bb5 and 3. Bb5 ...",
        "3... cxd4 4. Nxd4 Nf6 5. Nc3 a6": "The Najdorf Variation",
        "6. Be3": "Preparing the English Attack.  I quite often respond with 6. Ng4, which leads to well-analysed and tactically complex lines.  Kasparov was a pioneer in that line.  But I'm no Kasparov and I've been listening to Freddy's advice: sit back, ignore the database and wait for Jo to make a mistake.  In this game, I did more or less ignore the database.  I relied on instinct, background knowledge of the opening theory, calculation and feel for the positions.",
        "6... e6": "In the past I've been punished when taking the more aggressive approach of 6. ...e5, so I stick to my favoured Scheveningen formation.",
        "7. f3": "Again part of the standard English Attack.  This prevents ... Ng4 and prepares g2-g4, as well as reinforcing e4.",
        "7... Be7 8. Qd2": "again part of the standard build-up",
        "8... Qc7": "Before committing myself to kingside castling into the teeth of the gale of Jo's incipient attack, I prepare development of my queenside, first moving the Q in order to support ...Nc6 so that the a-pawn isn't left isolated after an exchange.",
        "9. g4": "Again characteristic of the English Attack.  It looks frightening and wins a lot of games.  Black has to remain cool and concentrate on his own opportunities.",
        "9... Nc6": "Development is still my priority but I don't want to commit too early to a wing for my king and I want to challenge White's centre with this N rather than just defend with Nbd7, which deprives the wsb of options and offers no attacking options",
        "10. O-O-O": "White commits first.  Queenside castling is a standard element in White's English Attack strategy.",
        "10... O-O": "I decide that I can delay White's attack with appropriate counter-measures, so castle into the storm after all.  It's now a race to attack the king, basically.",
        "11. Kb1": "?! A typical prophylactic move by White.  But how lily-livered can you get?  Time is of the essence and this does not help White's cause.  Of course, if White had won, I'd be praising her prescient sagacity!",
        "11... b5": "! Launching the attack.",
        "12. Nxc6": "Avoiding the diversion of her bishop that would occur if Black took on d4, but this N is often a key attacker for White, so possibly not the most attacking option: if White is in an attacking frame of mind in these sorts of positions, the N often impales itself on b5, e6 or f5....",
        "12... Qxc6 13. Bd3": "looks at h7 and defends e4  and c2 but blocks the battery down the d-file: so it has its advantages and disadvantages.  Alternatives were 13. Be2 and 13. Bg2.",
        "13... Bb7": "Better than 13. ...Bd7, when it would be vulnerable on the d-file.  The important thing is to connect the rooks and to launch the attack at White's King's position.  Admittedly, this B is pointing in the wrong direction for that objective; but it does look across the centre of the board at e4, f3 and a1.",
        "14. g5": "White makes contact.",
        "14... Nd7": "Both e5 and c5 are attractive positions for this N.",
        "15. h4": "White's attack gathers pace.",
        "15... Ne5": "Attacking both f3 and d3, not to mention the potential to attack Glenda from c4.",
        "16. Qg2": "Defending f3 and reinforcing the attack from behind.",
        "16... Rac8": "Calmly completing development and building pressure on c2",
        "17. Rdg1": "Committing to the kingside storm",
        "17... Nc4": "The Q's move to g2 left Fou Lenoir vulnerable, so I attack him with a view to swapping my horse for Fou LeBlanc.",
        "18. Bxc4 Qxc4": "Now Black's attack is as potent as White's, I think.",
        "19. Qe2": "?! Especially now that Glenda abandons attacking duties for a glorious pas de deux into the burning fires with the Wicked Witch.  I wonder of this was the turning point?",
        "19... b4": "Black now presses home the attack. ",
        "20. Qxc4": "Glenda pulls the Wicked Witch into the fire.",
        "20... Rxc4": "and the Elephant grinds her into the ashes.",
        "21. Ne2 Rfc8": "Black's doubled rooks are a much more powerful weapon than White's muted fellows stuck behind their pawns.",
        "22. Rgc1": "and now one of White's rooks reverts to defensive duty.  A good example of flexible thinking from Jo: though perhaps she lacks commitment to her attack?",
        "22... d5": "Good timing, I think.  If White advances to e5, she gains no tempi from it and she doesn't have any obvious ways of pressing home the attack.  Black sorts out a weakess in his position and turns it into an attacking option.",
        "23. exd5 Bxd5": "Preserving the positional integrity of Black's kingside pawn structure while turning Blacks wsb into an attacking piece: f3 is under direct attack and a2 is under potential threat.",
        "24. Rh3": "Defends f3 and prepares doubling on the h-file.  Moving the f3 pawn wasn't an option because of ... Bxh1",
        "24... a5": "Preparing the final lunge at Henry's position.  A couple more moves and White's pawns will have very difficult choices.",
        "25. f4": "At last White gets another pawn moving.",
        "25... Be4": "but left e4 open to occupation.  Now c2 looks sick",
        "26. Nd4": "defending c2 but from an awkward forward position",
        "26... Bc5": "attacking the defender single-mindedly",
        "27. Nb3": "returning the compliment; but Black's B dsb is not required in the attack on c2, whereas that N was.",
        "27... Bxe3": "! Of course, revealing once more the battery on c2!",
        "28. Rxe3 Bxc2+": "Probably decisive.",
        "29. Ka1": "? I think White should have accepted the loss of the exchange here.",
        "29... Bxb3": "! winning",
        "30. Rxc4 Bxc4": "and Jo waved the white flag on grounds of ruinous loss of material.  After all my struggles against her, a surprisingly easy win."
    },
    "url": "https://gameknot.com/annotation.pl/if-at-first-you-dont-succeed-try-try-again?gm=21634",
    "gameName": "If at first you don't succeed try, try again!",
    "players": "jstevens1 (1761) vs. rjacobs (1524)",
    "opening": "Sicilian (B90), Najdorf, Byrne (English) attack"
}