{
    "moves": {
        "1. d4": "Desde primeros pasos en ajedrez la jugada favorita de Emilio. Corto romance con 1.e4 no se convertio por el momento en algo serio.",
        "1... Nf6 2. Nf3 d5 3. c4 c6": "Defensa Eslava hace poco se incorporo en el repertorio de Jorge. Una eleccion muy aportuna, bastante consiste con el estilo de joven maestro. ",
        "4. Qc2": "La jugada permite evitar las magistrales variantes relacionados con captura del peon c4, impide la salida del alfil a f5 y deja la opcion de transformar la apertura en una catalana. ",
        "4... e6 5. g3": "Justamente! Alfil f1 quiere en algun momento ser dueno absoluto de la diagonal h1-a8, considerando que su oponente en c8 no tiene muchas posibilidades.",
        "5... Nbd7 6. Bg2 Bd6 7. O-O O-O 8. Nbd2": "Con clara intension de preparar el avance e2-e4 y romper el muro b7-c6-d5. ",
        "8... Re8": "Idea de las negras tambien es muy clara. Pensando en el destino del alfil c8 ellas preparan el avance e6-e5.",
        "9. Rd1": "Entendible mejora de torre, pero mas de moda es la jugada 9. b3 , cuando alfil blanco pretende tomar el control por el punto clave e5. Es muy probable que este camino ofrece a las blancas un poco mas",
        "9... Qe7 10. e4 Nxe4 11. Nxe4 dxe4 12. Qxe4 e5": "Ambas bandas han cumplido sus objetivos. Las blancas  abrieron el camino a su alfil g2, pero su contraincante c8 no quedo atras. Enfrentamiento en el centro ha comenzado demasiado temprano. Habitualmente esto lleva a los cambios y empate. ",
        "13. Be3": "Muy modesto. La linea magistral podria ser la siguiente: 13. ¥g5 f6 14. ¥e3 exd4 15. £xe7 ¥xe7 16. ¥xd4 Estadistica de las partidas jugadas aqui es bastante favorable para las blancas, aunque Rybka 3.0 no considera que ellas tienen ventaja alguna. ",
        "13... exd4": "Optando por el cambio. Una alternativa muy seria podria ser 13... ¤f6 14. £c2 e4 15. ¤d2 h6 , evitando la posible clavada del caballo. Las chances de las negras aqui se ven como bastante interesantes",
        "14. Qxe7 Bxe7 15. Bxd4 Nf8": "Equilibrada posicion, nadie tiene debilidades y chances reales conseguir algo. Por otro lado no se puede relajarse, pequenas detalles pueden tener aqui bastante importancia. ",
        "16. Rac1 Be6 17. Be3 Bf6 18. b3 a5": "En este momento me dio impresion que Jorge quiere algo mas que juego para empate. Con esto no quiero decir que Emilio por su lado estaba de acuerdo con el paz. Los cambios tempranos sucedidos de ninguna manera reflejan el espiritu combativo de ambos maestros. El peon negro quiere llegando a a4 desarollar una presion. Pero por todo hay que pagar. Se siente debilidad del punto b6. ",
        "19. a4 Nd7": "A la primera mirada se ve muy logico, se cubre la debilidad de b6, pero ahora el caballo negro esta un poco colgado y depende del alfil e6. Mas fuerte se ve 19... ¥g4 , clavando a las blancas y dejando la casilla e6 libre para el caballo.",
        "20. h3": "Fuerte movimiento! Desde ahora comienza aparecer la amenaza caballo d4, con la cual las blancas obtendran la pareja de alfiles. ",
        "20... Bb2": "Larga jugada, interesante maniobra. Habla muy bien de creatividad de Jorge, pero objetivamente es un error. Se entiende que las negras querian colocar alfil a a3, poner caballo a c5 y de este modo realizar la presion al flanco de dama de las blancas. Pero lamentablemente no estan tomando en cuenta amenazas de su contraincante.",
        "21. Rcb1 Ba3 22. Nd4 Nc5": "??\r\nGravisimo error que inmediatamente lleva a la posicion perdida. Habia que permitir el cambio de alfil e6 y tratar de defender la posicion un poco inferior. ",
        "23. Nc2 Bf5 24. Nxa3 Bxb1 25. Bxc5": "Muy dudosa eleccion. Al parecer Emilio no dio tanta importancia a la debilidad del peon b3. Por supuesto simple jugada  25. ¦xb1 , permitia obtener mucho mas",
        "25... Ba2 26. Rd3 Rad8": "Cambiando al defensor. ",
        "27. Rxd8 Rxd8 28. b4 Rd1+ 29. Kh2 b6": "Lleva a la muerte inmediata, mientras que  29... axb4 30. ¥xb4 dejaba todavia bastante espacio para la lucha",
        "30. bxa5": "Sin demorrar mas que un par de segundos Emilio realiza esta captura. Encontrar la combinacion de este tipo nunca ha sido una tarea dificil para el. ",
        "30... bxc5 31. a6": "Es imposible salvarse y Jorge detuvo el reloj.\r\n\r\n1-0"
    },
    "url": "https://gameknot.com/annotation.pl/iii-open-irt-jose-marca-in-memorian-2010?gm=28796",
    "gameName": "III Open IRT Jose Marca in Memorian 2010 ",
    "players": "Emilio Cordova  vs. Jorge Cori ",
    "opening": "Queen's pawn game (A46)"
}