{
    "moves": {
        "1. e4 d6": "Hace mucho tiempo que quería jugar la defensa Pirc en un torneo. Si bien el resultado no me acompañó, no descarto para nada incluirla en mis próximas actuaciones.",
        "2. Nc3": "Guillermo busca entrar en una linea que estuvimos discutiendo unas semanas antes. La idea es jugar un esquema con Ac4 y Df3 (?!) (obviamente, la dama saldrá de este lugar) como las negras no desarrollan acciones agresivas en las primeras jugadas, las blancas colocan las piezas para un ataque paso a paso sobre el flanco de rey. Por otro lado, si ahora juego 2.., c5; Guillermo puede trasponer a un Ataque Gran Prix 3 f4. ",
        "2... Nf6 3. d4 g6 4. Be2": "Más en el estilo de Guillermo era Cf3 o cualquiera que le llevara a un esquema clásico. Esta jugada tiene como objetivo comenzar el llamado \"spike\", tanto con 5 h4, como 4 g4. Una \"bruta\" demostración en el flanco de rey, que a veces da resultados... sobre todo en los blitz. Esta linea la popularizó Juan Meruvia, un destacado exponente de ataque, local.",
        "4... Bg7 5. h4 h5 6. Bg5 c6 7. Qd2 O-O 8. a4": "También se ha jugado:\n8.Nh3 Nbd7 9.f3 e5 10.d5 cxd5 11.Nxd5 Nb6 12.Nxf6+ Bxf6 13.O-O-O Bxh3 14.Rxh3 Bxg5 15.hxg5 Rc8 16.g4 hxg4 17.Rh6 Kg7 18.Rdh1 Rg8 19.f4 Nc4 20.Qd5 Qc7 21.Rh7+ Kf8 22.Bxc4 Qxc4 23.Qxd6+ Ke8 24.Qxe5+ Kf8 25.c3 Qxa2 26.Rh8 Qa1+ 27.Kc2 Qa4+ 28.Kb1 {1-0, Zimniok Lubomir (CZE) 2210 - Zimniok Zdenek (CZE) 2036, Karvina (Czech Republic) 2002",
        "8... Nbd7": "Creo que mi planteamiento es \"correcto\", pero la falta de práctica en esta apertura, me pasa la cuenta. El contrajuego negro está demasiado atrasado, correspondía buscar el \"c5\" antes.",
        "9. g4 c5": "Las lineas me parecían claras en ese momento, pero olvidé considerar un par de respuestas",
        "10. gxh5 cxd4 11. Nd5": "11...Cxd5 12.h6 ( 12.exd5 Db6 ) Ae5 13.exd5 Db6 Se ve más consecuente con la idea de explotar la casilla \"b2\". La jugada de la partida tiene como idea activar las piezas en el centro, poniendo en claro la falta de desarrollo de las blancas. El tema es que la posición concretamente no dará pie para aprovechar tal situación, por lo tanto, puedo concluir que no existe tal ventaja.",
        "11... Nc5 12. Bxf6 exf6": "Ahora con un f5 y el potencial mounstro de \"g7\" las negras deben estar mejor",
        "13. hxg6 Nxe4": "¡La columna \"e\" ya está abierta!",
        "14. gxf7+ Rxf7 15. Qb4 Be6": "Todas las piezas negras jugando. ",
        "16. Nf4 Qc8 17. Nf3 Bh6 18. Rg1+ Kh7 19. Qxd4 Bf5 20. Qd5": ""
    },
    "url": "https://gameknot.com/annotation.pl/iii-open-de-arica-2010?gm=29428",
    "gameName": "III Open de Arica 2010",
    "players": "Páez, Guillermo  vs. Mamani, Héctor ",
    "opening": "Pirc defence (B07)"
}