{
    "moves": {
        "1. e4 c5 2. Nf3 d6 3. d4 cxd4 4. Nxd4 Nf6 5. Nc3 g6 6. Be3 Bg7 7. f3 Nc6 8. Qd2 O-O 9. O-O-O d5": "\nThe critical variation, Black offers a pawn.",
        "10. Kb1": "White plays a line introduced by L.Milov",
        "10... Nxd4": "My sources are out of date (1995) but show two other lines where White seems to be doing well.\nA) 11...Nd7 12 Bxd4 Nxe5  (12 ...e6 13 f4 f6 14 exf6 Bxf6 15 Qe3 Nb6 16 h4 Milov-Cirkvencic, Nagykanizsa Open 1993) 13 Qe3 Nc6 14 Bxg7 Kxg7 15 Nxd5  Qa5 16 b4 \nQa4 17 b5 Rb8 18 Qxb3 19 axb3 e6 20 bxc6 exd5 L.Milov-Golubev, Biel 1994 and here John Nunn in his 1995 book \"Beating the Sicilian 3\" recommended 21 Rxd5 axc6 22 Ra5.  I am sure that a lot has happen in the past 15 years and maybe someone can bring us up to date.",
        "11. e5 Nf5 12. exf6 exf6 13. Bc5": "Apparently the current main line",
        "13... d4 14. Bxf8": "considered the critical line.",
        "14... Qxf8 15. Nb5": "15 Ne4 has been played here.",
        "15... Ne3": "15...Be6 is the alternative",
        "16. Re1": "16 Rc1 comes into consideration",
        "16... f5 17. f4": "the first new move.  17 Nxd4 f4 has been played here and Black is considered to have good compensation for the exchange.",
        "17... Qc5 18. c3": "Starting a long forcing line.",
        "18... Nxf1 19. Re8+ Bf8 20. Qxd4": "20 Rxf1 Qxb5 21 Rfe1 b6 22 Qxd4 Bb7-+ according to Fritz",
        "20... Qxb5": "Fritz considers the position to be equal after 21...Qxd4",
        "21. Qd8 Nd2+ 22. Kc2 Qa4+ 23. Kc1 Qxe8 24. Qxe8": "Radjabov has three minor pieces vs. Whites Queen, if Black can get his pieces coordinated he would have an advantage.",
        "24... Ne4 25. Rd1 Nf6 26. Qe5 Nd7 27. Qe8 Nf6 28. Qd8 Ne4": "Gawain Jones suggests 28...Kg7 here.",
        "29. Rd7 Bxd7 30. Qxa8 Bc6 31. Qxa7 Nc5 32. g3 Nd3+ 33. Kb1 Be4 34. Ka1 Bc5 35. Qb8+ Kg7 36. Qd8 Bg1 37. h4 h5 38. a4 Bf2 39. a5 Bxg3 40. Qd4+": "And White will be able manage a perpetual check."
    },
    "url": "https://gameknot.com/annotation.pl/iii-kings-bazna-rom?gm=25474",
    "gameName": "III Kings, Bazna ROM",
    "players": "Nisipeanu,LD (2675) vs. Radjabov,T (2756)",
    "opening": "Sicilian (B75), dragon, Yugoslav attack"
}