{
    "moves": {
        "1. e4 d5 2. exd5 Qxd5 3. Nc3 Qd6": "Una interesante retirada de dama, a mi parecer la más activa, ya que a diferencia de Da5 o Dd8 no perjudicará mayormente al desarrollo negro.\n\n(Héctor Mamani) Anand ha demostrado en el ajedrez de alto nivel que todas son jugables. Sin embargo, sigo pensando que la defensa escandinava no plantea serios problemas al blanco. Un tiempo, es un tiempo. ",
        "4. Nf3 Nf6 5. d4 a6 6. h3 b5 7. Bd3 Bb7 8. Be3 e6 9. O-O Nbd7 10. Re1 Be7 11. Ng5 O-O": "Cg5 busca activar al caballo al mismo tiempo que se centraliza",
        "12. Nge4 Qc6 13. f3": "francamente no sé si f3 sea la mejor respuesta, pero en esa posición no veo como puedan ingresar las negras. Pero se debe tener en cuenta una conocida frase de José Raúl Capablanca la cual señala que cualquier movimiento de peón en el enroque es una debilidad. La diferencia es que a mí me gusta que me demuestren dicha frase…",
        "13... b4 14. Ne2 Qb6": "Rolando intenta demostrarme que la última jugada f3 de las blancas fue imprudente, sin embargo las blancas disponen de recursos para sostener la posición.\n\n(Héctor Mamani) Pienso que, más que la diagonal g1-a7 es la h2-b8 la que se debería intentar aprovechar. Tal vez ahora sería bueno que la dama estuviese en \"a5\" para pasar el flanco de rey. Sin embargo, estoy de acuerdo en pensar que \"la dama sola no gana\". Lo cierto es que la posición de la pieza más fuerte de las negras, aún sigue sin ser definida.",
        "15. Bf2": "(Héctor Mamani) Tal vez C2g3, con idea de mantener defendido el alfil de \"e3\" con la torre, echarle un vistazo al homólogo de \"e7\". Mi punto es que después de los cambios que vienen, el caballo en \"c5\" quedará clavado, entonces podría seguir: 15, c5;16 dc5, Cc5; 17 Cf6, Af6; 18 Ce4. En esta caso, supongo que 15, Cd5; 16 Af2 es mejor. (Si 16, f5; 17 Cd2 con idea de 18 Cc4)",
        "15... c5 16. dxc5 Nxc5 17. Nxc5 Bxc5 18. Bxc5 Qxc5+ 19. Kh1 Rfd8": "Las negras buscan golpear los puntos débiles de las blancas. Tomando en cuenta el incompleto desarrollo se puede decir que las negras se encuentran ligeramente superiores",
        "20. Qc1": "En este punto yo esperaba que las negras jugaran Ch5 la cuál considero interesante por el hecho de que la dama blanca no tiene casillas útiles, asimismo el caballo blanco situado en e2 se encuentra sobrecargado defendiendo la casilla g3. Así mismo las negras amenazan jugar Df2 seguido de un posible sacrificio con Axf3. De haber jugado Ch5 la partida podría haber continuado 20.-Dc1-Ch5/21.-Rh2-Df2/22.-Dg5-Axf3/23.-Tf1-Dxg2+/24.-Dxg2-Axg2/25.-Rxg2            La idea es interesante, pero la variante es obviamente variable",
        "20... Rd7 21. Qf4 Rad8 22. Ng3 Rd7d4": "Aquí entra en juego lo psicológico, antes de la partida hable con Rolando y a ninguno de los 2 le convenía siquiera hacer tablas, debíamos jugar a ganar para obtener uno de los 3 primeros lugares dentro del torneo, por lo cual le ofrezco un cambio de damas repitiendo las jugadas, como ya sé que él no quiere cambiar tantas piezas lo obligaré a que sea él quien cambie la jugada y veré si puedo sacarle algún provecho",
        "23. Qe5 Rd4d5 24. Qf4 Rd5d4 25. Qe5 Qb6": "Ahí está.",
        "26. Nh5 Nxh5 27. Qxh5 g6 28. Qg5 Rd4d5 29. Re5 Rxe5 30. Qxe5 Bd5": "Jugada lógica de parte de las negras que le permitirá a las blancas obtener contra juego en el flanco dama",
        "31. a3 a5 32. axb4 axb4 33. Ra6 Qb7 34. Qe3 Ra8 35. Qb6": "Creo que con esta jugada las negras quedan perdidas, yo esperaba 35.-Db6-Txa6/36.-Dxa6-Dxa6/37.-Axa6   y entrar en un final de alfiles donde el blanco debe presionar el flanco dama y por su parte el negro debe cuidar su flanco dama y hacer lo propio por el flanco de rey.",
        "35... Qxb6 36. Rxb6 b3 37. c4 Ra1+ 38. Kh2 Ba8 39. Rxb3 Rd1 40. Be4 Bxe4 41. fxe4 Re1 42. c5 Kf8": "Si las negras hubiesen tomado el peón de e4 perderían ya que no logran alcanzar al peón “c” de las blancas el cual va a coronar",
        "43. c6 Ke7 44. c7 Kd7 45. Rc3 Kc8 46. Rc4 Rb1 47. b4": "(Héctor Mamani) ¡Esa torre hace de todo!",
        "47... Rb2 48. Kg3 f5 49. exf5 exf5 50. Kf3 g5 51. Rc5 Rb3+": "Con el apuro de tiempo no podía resolver como ganar por el flanco dama, en ese momento me percate de la lejanía del monarca negro el cual por fuerza mayor desprotegió el flanco de rey",
        "52. Kf2 Rb2+ 53. Kf3 Rb3+ 54. Ke2 Rxb4 55. Rxf5 Kxc7 56. Rxg5 Kd6 57. Rf5 Rb2+ 58. Kf3 Ke6 59. Rf8 Ke7": "(Héctor Mamani) La partida se alargó por varios movimientos más, las blancas ganaron capturando el peón de h7 con el rey y avanzando los peones propios. La torre se mantuvo en la columna \"f\", cortando al rey negro. "
    },
    "url": "https://gameknot.com/annotation.pl/iii-open-arica-2010?gm=29391",
    "gameName": "III Open Arica 2010",
    "players": "Sanhueza, Felipe  vs. Jara, Rolando ",
    "opening": "Scandinavian (B01), Pytel-Wade variation"
}