{
    "moves": {
        "1. e4": "Zukertort had white pieces and he started with e4.",
        "1... e5": "Anderssen responded with e5",
        "2. Nf3 Nc6 3. Bb5": "After Nf3, Nc6, Bb5 we have Ruy Lopez opening.",
        "3... Nge7": "Nge7 was played, and this is known as the Cozio defence.",
        "4. c3": "C3 was played, the idea was simple, d4 is coming next.",
        "4... d6": "D6 was played, very natural looking move, so the lsb can be developed.",
        "5. d4": "D4, d5 is coming next, to win the knight. ",
        "5... Bd7": "exd4 is possible, but black played Bd7 breaks the pin.",
        "6. O-O": "White simply castles king side.",
        "6... Ng6": "Ng6, seems black wants to play Be7 next and castle king side.",
        "7. Ng5": "Ng5 was played, attacks f7 pawn.",
        "7... h6": "h6, looks logical, black wants to kick the knight away, however here comes the first shocking move.",
        "8. Nxf7": "Nxf7 what a move! The knight is forking the queen and the rook.",
        "8... Kxf7": "Well, king must take.",
        "9. Bc4+": "It it's tempting to play Qf3+, but after king back to e8, black would have better chance to survive the attack, so it's critical to play the right move at this point. Bc4+ was played, the bishop is now dominating the a2 g8 diagonal, which restricts the king's position.",
        "9... Ke7": "Ke7 was played, why not just play Be6 blocks the bishop? Because d5 would be disaster for black. However, I think ke8 would be a better move, because after white plays Qh5, black can play Qf6, also if white plays Qf3 treats mate, Qf6 can still be played, right? What do you think?",
        "10. Qh5": "Qh5 attacks the knight",
        "10... Qe8": "Qe8 was played, and that's a blunder, if black played kf6 instead, he would survive much longer, although it looks risky, however because this Qe8 move, black jumped into his doom.",
        "11. Qg5+": "Here comes the earth shuttering move, Qg5+! What a fascinating move!",
        "11... hxg5": "What else, hxg5 only move.",
        "12. Bxg5#": "Goodbye Mr Anderssen, Bxg5#! What a immortal game! That's all guys, I hope you enjoy it, and see you next time."
    },
    "url": "https://gameknot.com/annotation.pl/immortal?gm=52073",
    "gameName": "Immortal!!!",
    "players": "Johannes Hermann Zukertort   vs. Karl Ernst Adolf Anderssen ",
    "opening": "Ruy Lopez (C60), Cozio defence"
}