{
    "moves": {
        "1. d4": "This was part of a mini tournament starting off with 1.d4 Nf6 2.c4 a queenspawn game that can still go into many different systems. Take a look at the computer annalysis I was pleased to see that for most of the game I was maintaining the advantage at one point being over +3\n\nhttp://gameknot.com/analyze-board.pl?bd=17074505&fb=1&rnd=0.2004301943178579",
        "1... Nf6 2. c4 c5": "my preferred way, I ususally play for the benko gambit, though having said that I have been looking into the bennoni and look foward to playing it at some point.",
        "3. d5 b5": "signifying the Benko gambit.",
        "4. Nf3 g6 5. d6": "!? an interesting pawn sac, This move takes us out of  the books and the computer gives this as level.",
        "5... b4 6. e4": "gaining central control, the pawn is immune from capture since ...Nxe4 is met with Qd5.",
        "6... exd6": "I wasn't too happy with my position here it seemed a little messy so after considering my options I figured I may as well take the pawn since I was didn't much love any of my options. This move took as out of the databases. ",
        "7. Bd3 Nc6": "since the d pawn gave up it's wedge in the centre my knihgt can now develop here which gives me good control over the central dark squares.",
        "8. O-O Bg7 9. Bf4 Qe7 10. Bc2 Ne5": "With this move I consolodated my extrqa pawn. Now I'm not very active however I'm a pawn up and reasonably solid.",
        "11. Nxe5 dxe5 12. Bg5 O-O": "?! If I had put some thought into the position I may have realised that white will wish to play a3 to undermine my pawn on b4. I should have played either ...Bb7 ...Rb8 or ...a5 before it was too late, probably Bb7 was best. now white has manages to get some play against my isolated a pawn. ",
        "13. a3": "If I had played Bb7 last move this could be met with a5 and I think blacks advantage would be almost enough for even me to win against a 2000+ opponent.",
        "13... bxa3 14. Rxa3 Qe6 15. Nd2 Bb7 16. Qf3 Ne8": "First inaccuracy according to the computer, though I would argue that ...o-o was also an inaccuracy at this stage in the game I was not as good a player as I am now. though it may not appear so I feel that over the course of this game I made significant improvments in my play by finally getting some chess books to read. prior to then I had not read any chess books before. hopefully my improvments will begin to show soon.",
        "17. Qe3": "I was a little planless the next few moves.",
        "17... d6 18. Qb3 Bc6 19. Rfa1 Bf6 20. Bh6 Ng7 21. Ra3xa7 Rab8 22. Qc3 Rfc8 23. Ba4": "I think it was around here that I began reading the ametures mind and how to reasses your chess fourth addition by Silman, I finished them quite quickly and I think I stated playing better as well. ",
        "23... Nh5": "I realised that I my knight needs to get to f4  where it can then reach d4 via Ne2+ if white captures my knight on f4 with his bishop then I activate my previously inactive DSB with threats against b2. so In expected g3 here where I had put some serious considerations into complications based on playing ...Qh3 and sacing the knihgt in many lines.",
        "24. Bxc6 Rxc6 25. Ra7a8 Rcc8": "not wanting to seed the b file however this is better than Rcb6 since this forces white to either retreat or capture.",
        "26. Rxb8 Rxb8 27. Qa5": "The computer lists this as an inaccuracy claiming equality after Nf1 ",
        "27... Nf4 28. Nf1": "This is actually a mistake but at the time I thought it was quite clever since I had missed the idea the knight aims to go to e3 where it covers alot of key squares and from e3 it can go to the ideal d5 square where from there it even threatens some annoying checking ideas. not too sure why I thought black shouldn't play Qxc4 here, I guess it was to do with the back rank problems black is faced with however it might have also had a little to do with my opponents rating making me think he had something prepared for Qxc4. Here I actually put some serious consideration into ...Qg4 which \nI thought would win a pawn or a good attack. I looked at lines like  28...Qg4 29.Ne3 Nh3+! 30.Kf1 Qxe4 and the knight is immune since 31.gxh3 Qh1+ 32.Ke2 Rxb2+ 33.Kd3 e4# and lines where white tried to divert my rook off the b file then taking the knihgt still left black with winning attacks however when I eventually put some serious thought into the simple 29.Ng3 I realised it was actually quite dangerous for black so I had to look at other plans. ",
        "28... Bg7": "The bishop caused problems in many lines however now blacks got a great game. white must either allow black to gain a supierior knight or allow black a superior bishop. ",
        "29. Bxf4 exf4": "now black has pressure against b2 and d4 for the bishop.",
        "30. Qc7 Re8": "the e file is the best place for the rook in many instances black gets great inituive based on Bd4 and Re2",
        "31. Rd1 Qxe4 32. Qxd6 Bd4 33. Rd2": "this is actually a desicive mistake however I had spent hours annalysisn the various positions and this was actually the one defence for white I had not thought of, actually come think of it I think I had actually already dismissed this defence for white because of ...Qb1 however there had been long waits between the moves and I must have forgotten that by the time I played my next move. ",
        "33... Qe5 34. Qxe5 Bxe5": "I actually offered my opponent a draw here. I felt and I was right  that black had a small edge however I was on a rating of 1699 here and I just needed one more point to achieve 1700 which would put my rating floor up so I offered a draw since it would push me over because I felt that my other games I was playing looked like they would end badly. ",
        "35. Re2": "he declined.",
        "35... f6 36. Nd2 Rb8": "I would liked to have played Ra8 however Nb3 hold everything. So I first played this to induce foward the b pawn taking away the b3 square.",
        "37. b3": "then I timed out. A real shame as I was still ahead. however I am reasonably happy with the way I played this game. I think it was a definate improvment to give a high rated player such a run fopr there money."
    },
    "url": "https://gameknot.com/annotation.pl/improved-play?gm=45163",
    "gameName": "improved play",
    "players": "zrenjanin (2050) vs. thereaper1 (1671)",
    "opening": "Benko gambit (A57)"
}