{
    "moves": {
        "1. e4": "Hi everyone!\r\n\r\nAnother Low Draw but at least this time it is against a fellow Class A player.  This is part of a double king pawn opening mini tournament in which I have scored a disappointing 3.5 points out of 11 games so far.  Still, if you look at the oppo, including 2 Experts, it may be a little more understandable.  This game becomes the Exchange Variation of the Ruy Lopez.  A bishop pin on g4 leads to a sac opening up the h column to the Wicked Witch of the West supported by a rook on h8.  Where there is that line up, look out for Old Matey!  Here is how the story unfolds.",
        "1... e5 2. Nf3 Nc6 3. Bb5": "3. Bb5 - the Ruy Lopez.  See previous games for notes on this opening which is one of Gary Kasparov's favourites.  I wonder if he will try it out on Karpov in the coming rematch?  If so I hope I can get a DVD of it!",
        "3... a6 4. Bxc6 dxc6": "4. ...... dxc6 - this is known as the main line of the Exchange Variation.",
        "5. O-O Bg4": "5. ...... Bg4 - pin and a move favoured by Lighttotheright, a newly crowned Master buddy.",
        "6. h3 h5 7. d3": "7. d3 - supports e4 and opens up a line for Fou Lenoir.  I eschew the immediate take on g4 with my h pawn because I do not like the thought of that evil Witch coming steaming down on h4.",
        "7... Qf6 8. Nbd2 Ne7 9. Re1 Ng6 10. d4": "10. d4 - pawn break.",
        "10... Bd6 11. hxg4 hxg4": "11. ...... hxg4 - I still feel very cagey about that h column opening up, but the World DB recommends this move here.",
        "12. Nh2 exd4 13. e5 Nxe5 14. Nxg4": "14. Nxg4 - pawn trade.",
        "14... Qh4": "14. ..... Qh4 - I start feeling very cold, suddenly the air around me stinks and a dark shadow appears from above, it's that familiar outline of the chessic Grim Reaper, Old Matey.",
        "15. f4 d3 16. Nb3": "16. Nb3 - essential to prevent Bc5+",
        "16... dxc2 17. Qe2": "17. Qe2 - Glenda has a new job, piling up on the e5 knight and attacking that c2 pawn which is gonna be a big thorn!",
        "17... O-O-O 18. fxe5 Bb4": "18. ..... Bb4 - I take the knight but there is some very dirty work at the crossroads with this black bishop move.",
        "19. Rf1 Rd1 20. Bf4": "20. Bf4 - I thought it would be best for Fou Lenoir to develop to this square, firstly connecting the two rooks and secondly adding additional cover to the square h2.",
        "20... Rxa1 21. Rxa1": "21. Rxa1 - a rook trade but that b3 knight is gonna become overloaded.   Somehow I have been sucked into overload combos recently but I don't think there was much I could have done to prevent that one.",
        "21... Bc5+ 22. Nxc5 Qh1+": "22. ...... Qh1+ - skewer.",
        "23. Kf2 Qxa1 24. Qxc2": "24. Qxc2 - at last Glenda removes that dangerous c2 pawn.  I now lose my a2 pawn though.",
        "24... Qxa2 25. Qb3": "25. Qb3 - After Qa2 I set my vacation flag for my 2 weeks in Cornwall.  I had this dilemma in the back of my head while leaping around in the Newquay surf.  Should I exchange queens or should I try and attack with Glenda.  Eventually as I arrived home and gone through all possible attacking options with her and come to a dead end I decided to swap queens.  I really did mislike that 4-1 pawn majority my opponent had over me on the queenside though.",
        "25... Qxb3 26. Nxb3": "26. Nxb3 - at least Henry can breathe a little more easily though.",
        "26... b6 27. Bd2 c5": "27. ..... c5 - those pawns slowly advance.",
        "28. Bc3 Kd7 29. Kf3": "29. Kf3 - Henry tries to get closer to the centre like his royal counterpart.",
        "29... Ke6 30. g3": "30. g3 - to shield Henry from possible rook checks and prevent a move like Rh4.",
        "30... Rh1 31. Ne3": "31. Ne3 - to prevent the BK from going to d5 or f5.",
        "31... a5 32. Nxa5": "32. Nxa5 - I am now faced with another dilemma, I have an opportunity to destroy most of that pawn mass at the cost of my knight.  Should I take it?  I think I will make the game safe but I think my winning chances are virtually nil.",
        "32... bxa5 33. Bxa5 c6 34. Bc3": "34. Bc3 - Fou Lenoir protects the b2 pawn and blockades the black doubletons on the c column.",
        "34... Rh8 35. Ke4": "35. Ke4 - I make a move which will maintain the solidity of my position and held out the olive branch to my opponent which he accepted.  You would never believe from such a tranquil looking position that I was in Old Matey's shadow would you?  Anyhow, hope you have had a good read, bye for now.  Joanne"
    },
    "url": "https://gameknot.com/annotation.pl/in-and-out-of-old-mateys-shadow?gm=26419",
    "gameName": "In and out of Old Matey's Shadow",
    "players": "jstevens1 (1836) vs. bookie (1808)",
    "opening": "Ruy Lopez (C69), exchange variation, Alapin gambit"
}