{
    "moves": {
        "1. d4 f5": "The Dutch! I farely face it, and it is always a great think. ",
        "2. Bf4": "I go on with the London, that \"works with everything\". Well... :-)",
        "2... Nf6 3. Nf3 e6 4. Nbd2": "Not very aggressive, but I didnt' wanto to compromise myself until black shows something more, like...",
        "4... b6": "This. Thematic, grabbing the diagonal while I can't go for d4 or e5. Will I let him? Of course not!",
        "5. e4": "Saccing the central pawn for activity. ",
        "5... fxe4 6. Ng5 Bb7 7. Qe2": "Still threatening the pawn, and inviting d5. That would close the center for now, and will let me organize the game. ",
        "7... Nc6": "More flexible, threatening the other pawn. If I play NxN+, QxN and I have nothing with Qh5+.",
        "8. c3 Nd5": "ok, now Be3, NxB, QxN... playable, but disappointing. ",
        "9. g3": "I trust on a queenside castling, and ok, take my good B, but open my column and see what happens. ",
        "9... Nxf4 10. gxf4 Qf6": "Here, I completely overlooked the threat on f5... :-(",
        "11. Rg1 Qxf4 12. Rg4": "Inviting him into Qxh2. I'm not sure I can trap his Q, but he wouldn't dare. About around here, I noticed I had 30 seconds left for the rest of the game, +5 increment per move. ",
        "12... Qf5 13. Bh3": "Silly move, but allows my Q to move, and he has to be very careful about his Q. This is a complex position, and it is very hard to calculate all the tactics. What if now black plays h6? Rg3.",
        "13... O-O-O 14. Ndxe4": "...with no faith at all, but my only resource is to press him and catch him by time. ",
        "14... h6": "I played the only OTHER move than Rg3 I can see to save material: Ng3. Now I see that it was the bad choice: after Rg3, Q must move (Qg6, say), then Nxe6, threatening again the Q, etc. But I was focused on h4 and h5.",
        "15. Ng3 Qf6 16. Nh5 Qe7": "The manouver went ok, but the target (to fork the black R on f7) was not reached. Nothing better than retire, sigh!!!",
        "17. Nf3 g5 18. Ne5": "Even if I open the white diagonal, I have to go on attacking. I have only 10 secs max per move, about 20 sec on the clock. ",
        "18... Nxe5": "The logic take was with the Q, but there is no real danger for black, after Rh7.",
        "19. dxe5": "I want to close his wing in, support my N's escape on f6, and force him to play d6, so e6 will be vulnerable to my lsb. ",
        "19... Qf7 20. Nf6 d6 21. O-O-O dxe5 22. Rxd8+ Kxd8 23. Qxe5 Bd6": "If Bg7, Rd4+, and d6 falls. ",
        "24. Rd4 Kc8": "...and he thinks I'm busted, because I have to save my Q, but...",
        "25. Bxe6+": "One may ask why not Qxe6+, etc. I have a better idea, and I had less than 10 seconds on the clock. ",
        "25... Kb8 26. Nd7+": "! Rh8 is en prise. If QxN, QxR+, and BxQ. If...",
        "26... Ka8 27. Qxh8+": "My opponent resigned here. Black must lose the Q. Thank you for reading, and for pointing out my oversights!",
        "27... Qf8 28. Nxf8": ""
    },
    "url": "https://gameknot.com/annotation.pl/in-great-hurry?gm=63241",
    "gameName": "IN great hurry",
    "players": "damafi (1495) vs. va1da (1433)",
    "opening": "Dutch (A80)"
}