{
    "moves": {
        "1. e4 e5 2. Nf3 Nc6 3. Bc4 Bc5": "3. ....... Bc5.  The first three moves are those of the Guico Piano.  An opening beginners are encouraged to try first.  This opening is old and is also played at Expert level at least on Gameknot.  It is not seen quite as often at GM level because the Spanish Opening and the Sicilian have dominated things.",
        "4. b4": "4. b4 (white diverges here with the Evans Gambit, it is a very strong Gambit)",
        "4... Bxb4": "4. ......... Bxb4 (I accept the gambit)",
        "5. c3 Ba5": "5. .......... Ba5 (my bishop is driven back by 5. c3)",
        "6. d4 exd4 7. O-O dxc3": "7. .......... dxc3 (I chose this line because it liquidates white's pawns on the queenside).  The downside is that black's development is somewhat retarded?  Will this negate the destruction of white's queenside pawns?  Read on.",
        "8. Qb3 Qf6": "8......... Qf6 (defends the f pawn and adds protection to my passer on c3).  Qb3 is a strong move though!",
        "9. e5 Qg6": "9........ Qg6 (could I have safely taken the e pawn with 9...... Nxe5 10. Nxe5 Qxe5?)",
        "10. Nxc3 Nge7": "10. ....... Nge7 (I did consider exchanging my offside bishop for white's knight but I decided it was high time to develop my pieces and prepare castling)",
        "11. Ba3 O-O 12. Rad1 Re8": "12. ...... Re8 adds protection to the e7 knight",
        "13. Ne4 Nf5": "13. ....... Nf5 (If 13...... Qxe5 then 14. Bxf7  winning rook on e8)",
        "14. Neg5": "14. Neg5! (Powerful move.  f7 is attacked 3 times and defended twice by King and Queen)",
        "14... Nh6 15. Bd3": "15. Bd3 (I cover this square with my knight but my queen is now en prise!)",
        "15... Nd4 16. Bxg6 Nxb3": "16. ...... Nxb3 (I thought I was over the worst here, I'm 2 pawns up and both queens are off the board, will this be a nice, peaceful endgame?)",
        "17. Bxh7+": "17. Bxf7  - no chance, says my opponent's bishop!",
        "17... Kh8 18. axb3 g6": "18. ....... g6.  (I try to trap the bishop but......)",
        "19. e6 dxe6 20. Rd8": "20. Rd8 - ...... this allows a brilliant sacrificial combination which I overlooked!)",
        "20... Rxd8": "21. ....... Rxd8",
        "21. Bb2+": "21. Bb2  (the stinger, I now resign on the grounds of unavoidable mate.  I can only put pieces in the way and it will be Bxf6#!)"
    },
    "url": "https://gameknot.com/annotation.pl/in-old-mateys-shadow-part-i?gm=12864",
    "gameName": "In Old Matey's shadow - Part I",
    "players": "tomwhufc (1732) vs. jstevens1 (1500)",
    "opening": "Evans gambit (C52), compromised defence, Paulsen variation"
}