{
    "moves": {
        "1. e4": "Just about the most common opening move on GK blitz.",
        "1... e5": "Normally I do not favor e5 and instead go for positional imbalance by counterplay on c5 or e6 for the french defense.",
        "2. f4": "King's gambit? My opponent seems to favor the lesser played openings as the previous game's opening involved his knight dancing from a6 to recapture c5.",
        "2... d5": "Trying to throw the d pawn into king's gambit is usually a good idea.",
        "3. exd5 exf4": "Fearing Nc3 with a gained tempo after Qxd5 I took the f pawn instead hoping to squeeze pressure on to his king.",
        "4. Nf3": "Just about forced. Qh4+ is ugly without Nf3. ",
        "4... Bg4 5. Bc4 Nd7": "The position becomes more imbalanced after 5. ... Bxf3 6. Qxf3 Qh4+",
        "6. Nc3 Ngf6": "Impeding the threat of Qh4+",
        "7. O-O": "Here's a curious moment, the d5 pawn is not particularly strong although it has potential if it survives and my f4 pawn is just waiting to get picked off. Development is about even.",
        "7... Be7": "Bc5+ loses a tempo to d4.",
        "8. d4 O-O 9. Bb3": "So far the strategy on both sides has been pretty limited, positionally we are just about equal although I like white's bishop placement better (once his dark bishop is on f4).",
        "9... Nb6 10. Bxf4 Nbxd5": "I felt okay about this position. Move 25 was coming closer and my position was holding thus far. Unfortunately I didn't realize I was about to lose a pawn and some initiative. The knight cannot stay on d5 as it threatens his dark bishop and looks toward e3.",
        "11. Nxd5 Nxd5 12. Bxd5 Qxd5 13. Bxc7": "Pawn!! What counterplay can I get now? ",
        "13... Bf6 14. c3": "Not much apparently, My threats are pretty much non existent and my opponent has a passed pawn which will convert into a win unless something drastic happens. All I want to do is get to move 25...",
        "14... b5": "I'm picking and teasing for some type of initiative, but nothing seems to be really going on. I can't play passively because that passed pawn will cost me the endgame.",
        "15. Qb3": "Applying pressure to the b pawn as well as threatening an unfavorable queen trade. Right around now my Soviet Russia roots start to show as sometimes you must turn a battle upside-down to avenge a fallen soldier.",
        "15... Qc6 16. Ne5": "The knight must die, there's no other way around it. Goodbye comrade bishop! Your sacrifice won't be forgotten as long as we win.",
        "16... Bxe5 17. Bxe5 Be6": "Maneuvering my bishop to a move active post...",
        "18. Qd1 Bd5 19. Qg4": "...and the fight for the g file begins...naturally mate tops a pressured pawn. ",
        "19... f6": "Normally this sort of move might be frowned upon since it exposes my king to check but I felt the need to remove the bishop from his e5 post was worthwhile. ",
        "20. Bf4 Rae8": "In Soviet Russia, e files posses black rook!!",
        "21. a3": "Rae1 is kind of a must here in my view, I'm not sure what a3 does.",
        "21... h5": "Rawr!! I want your g pawn seniorita! Can I have yo number? Can I have it? Can I have it? ",
        "22. Qg3": "No! I want the king! Go away you grimy little pawn!",
        "22... Re2": "When in doubt, charge your headless chickens with bazookas. They are also sometimes called rooks.",
        "23. Rf2 Rfe8": "If one headless chicken is in danger, why not send another? ",
        "24. Raf1": "A solid choice. Slowly I am working against his defenses...for Mother Russia!",
        "24... Re2e4 25. h3 Bc4": "Get yo headless chickens undoubled on the file!",
        "26. Bh6": "Checkmate? Please?",
        "26... Qd7": "My Queen is not into her man seeing other queens...",
        "27. Rc1 h4": "...her pawn is interested though! He loves dating rich young ladies!",
        "28. Qg6": "But I love your king...he's so...guarded.",
        "28... Bd3": "Loading teh shotgun at the unfaithful queen! ",
        "29. Qh5 Re4e1+ 30. Rxe1 Rxe1+": "Two headless chickens slain!",
        "31. Kh2 gxh6": "Your man-servant bishop is no match for my queen-loving pawns!! ",
        "32. Qxh4": "A brave soldier gets eaten by the massive jowls of the young queen. Is there enough time to stop her from perpetually checking my king? She does seem violently after the man, perhaps he can escape by the extra time the sacrificial kingside pawns have provided.",
        "32... Qc7+ 33. g3 Be4": "Mate the next move! There is no easy way out of this one thanks to my pin on g3! ",
        "34. Qg4+ Kh8 35. Rg2": "The rook had to die to avoid checkmate.",
        "35... Bxg2": "What else? ",
        "36. Kxg2": "Qg6 seems a little better, with a small chance of counterplay.",
        "36... Qe7": "Mating net. Qc8+ is stopped by Qe8. The queens must trade...which means sweet victory for Mother Russia!!",
        "37. Qf3 Qe2+ 38. Qxe2 Rxe2+": "In Soviet Russia, headless chicken attacks you!\n\nIn all seriousness though this was an enjoyable game played by a very good sport. I tip my Soviet hat at you and your amazing chess playing skills canardeau. Maybe someday I'll be able to draw guys you regularly smoke and I in no way mean you disrespect. Some games just get you fired up a little!"
    },
    "url": "https://gameknot.com/annotation.pl/in-soviet-russia-rematch-plays-you?gm=32500",
    "gameName": "In Soviet Russia rematch plays you!",
    "players": "canardeau (2454) vs. coolistdude (1704)",
    "opening": "KGD (C31), Falkbeer counter-gambit"
}