{
    "moves": {
        "1. b3": "The Larsen's Opening. I think this was the second time I ever played vs this opening, which is kinda odd considering it's the 6th most popular opening move. Larsen himself thought that b3 is an opening in which most black players make a mistake somewhere, since they aren't familiar with the ideas behind the opening. He was more or less right, I didn't know and still don't know these ideas, hence why I'm analysing this game in the first place. I expected her to play the London system and prepared for that specific opening the night before, so I was a little bit baffled about b3, which invites a completely different kind of position.",
        "1... e5": "Universally speaking the most played response. It blocks off the diagonal and takes a hold of the center. ",
        "2. Bb2 Nc6": "Still the main line and the most logical move in my opinion.",
        "3. e3": "Unfamiliar with the opening I was calculating d4 here, but couldn't see how that'd benefit white so I disregarded it. I should have thought a little longer about this move, even if it's just to familiarize myself with the ideas of the opening.",
        "3... d5": "Taking a hold of the center.",
        "4. Bb5": "And so it begins. black has got to be a little careful here. Usually a move like Bd7 would work fine, however because his bishop on b2 is attacking e5, the only really thing black can do is to defend e5. White usually tries to hold onto this pin for a little while, however I researched my opponent a little bit before the match and knew she had a tendency to just take in these type of positions.\n\n",
        "4... f6": "Theory suggests that 4.Bb5 Bd6 5.c4 is the logical continuation after 4. Bb5. I opt for f6 instead. This move may look insignificant, but means a huge deal since it closes off a diagonal for my queen and makes Nf6 impossible for the time being. Also interesting to note is that after d4 all my pawns would be positioned on dark squares, which weakens his bishop on b2, but makes it hard for my own dark squared bishop to develop properly. This last part will become a huge issue later on.\n\n",
        "5. Bxc6+ bxc6": "As predicted she couldn't resist taking. Black has a frightening center now and ideas arise along the lines of Rb1 -> Rb4  and then bringing it over to the king side. That idea of course isn't useful just yet, but it's definitely there. I think black is better here and if black develops normally from this point onwards he'll have a very good game.",
        "6. Ne2": "Developing a knight to a rather poor square. Nf3 isn't really an option though since 6. Nf3 e4 makes white's position a tad cramped.",
        "6... Ba6": "this move took me quite long and quite frankly I think Bf5 is better, targeting the weak c2 square. Looking back at it, I'm not sure why that wasn't played. I assumed she was going to castle king-side, which is premature in my opinion.",
        "7. O-O": "She did end up castling, which I think is an error. Now the knight on e2 is in a spot where it can't move to g3.",
        "7... c5": "This move and the following ones are the reason why I'm not too proud of this game. The idea behind c5 can be explained with 3 short sentences.: I have doubled pawns. I don't like double pawns. can we get rid of them?\nI figured I'd push with d4 and get in a position where white is cramped and struggling to develop her minor pieces.  This however makes things awkward for my dark squared bishop. I wonder what I would play if I could replay this game, probably something like Bc5 or Nd7.",
        "8. d3": "Making room for the knight to develop to d2. I understand this move, but it feels sort of tame. I probably would have played f4 if I were in white's shoes. After 8. exf4 Rxf4 9. Bd6 Rf2 white gets out of the pin and can create some sort of counter play. She'll still have a very tough game, but it offers better chances in my opinion than 8. d3. If black doesn't take on f4 then after for example 8. f4 Ne7 9. fxe5 fxe5 10. d3 white has a pretty solid position with an open f-file. In that position black would probably still be better, but white would barely have any big weaknesses which black can exploit whereas black's position is aggressive but vulnerable on e5, c5,c7  the e8-h5 diagonal, etc.",
        "8... d4": "You can probably tell by now that my dark squared bishop isn't going to play a huge role in the next few moves. At this point I started calculating f4. My opponent afterwards asked me what move she should have played and when I explained her my f4 idea she admitted to not noticing that idea. f4 is going to play a major role in all my future calculations.",
        "9. exd4 cxd4": "Black has more space, but f4 is a serious issue and black's white squared bishop is looking rather odd. I start to get a little nervous at this point, but decide to not show a worried face to my opponent. Instead I leave the room to tempt her to make her move more quickly. You often see lower rated players do this to win a couple of minutes. Up until this point I had spend about 20-25 minutes whereas she had used 15 minutes. By leaving my board I essentially tempt her in getting a 15 minute advantage in the hope that she doesn't think of f4.",
        "10. c3": "When I came back 5 minutes later I noticed 4 more minutes missing on my clock and c3 being played. I took a sip of my drink ( Which I ended up getting in the time I left my board ) and leisurely looked at the board. My worst nightmare, f4, wasn't played and it looked like I was going to get a pawn for free. Life was good.",
        "10... dxc3": "Losing a bit of my pressure, but making a move like f4 less uncomfortable. White also can't prevent black from winning material. She sighed as she realised she messed up. The following move strangely enough took her 5 minutes or so. After the game she told me that she was unsure of which piece she'd recapture with.",
        "11. Nbxc3": "The most logical recapture in my opinion. Notice how her minor pieces are developed whereas most of my pieces are still on the 8th rank.",
        "11... Qxd3": "Bxd3 was the other option. Both are fine in my opinion. I opted for a queen trade since I was 1 pawn ahead. It may seem like a premature decision, but surely I should be able to win an endgame against a usually weaker opposition right?",
        "12. Qxd3 Bxd3 13. Rae1": "This move just straight up loses. She should have played Rf1e1 or Rf1d1 in my opinion. This just makes the position very awkward for white. The knight can't move, the open files aren't used, etc. \n\nEditing note: Looking back at this game once more, my assesment of the position before this move is that black is up, but not by much. The reason being because he's underdevelopped and one could argue that it's worth the pawn. In this position ideas of f4 arise once more. White should aim to open up the game and gives checks all across the board rather then bunker up. Rae1 is a mistake and instead Rfd1 or Rad1 should have been played after which I continue Rd8 or O-O-O. Maybe then Ng3 or f4, or something, but the move that was played.",
        "13... Bc5": "This move is to prevent f4 once more. reason being that the rook on e1 makes f4 an even bigger nuisance. Let's say that I make a random move like h6. 13. Rae1 h6 14. f4 exf5 and white has 2 rooks aiming at the king and 2 knights ready to give checks everywhere. Black should move cautious because there's definite attacking chances for white in that position.  Or 13. Rae1 h6 14. f4 Rd1 15. fxe5 fxe5 16. with the same issues. White can probably spare a tempo in that position to get out of the pin and will start aiming with all his pieces towards my king. The pawn on e5 would most likely fall somewhere along the line and one could even go as far as saying white is better in that position. Of course that is implying that I lose 1 or more tempo by making unnecessary moves, but you get the idea. The threat is definitely there in the future.",
        "14. Nd5": "Aiming at c7 which forks king and rook. This would probably work in a blitz game, but with still more then an hour on the clock? Not likely.",
        "14... Bb6": "Rc8 might have been slightly better, since now white can get out of the pin by taking the bishop and employ the f4 idea.",
        "15. Kh1": "This is where she noticed the f4 idea. A tad late, but at least she noticed. The next move is going to take me a while.",
        "15... Kf7": "I'm tired of having to calculate f4 every move so I decide to get out of the pin. f4 is still playable, but my knight ( which hasn't moved all game, the poor thing ) defends the important e7 square thus making an attack rather unlikely to succeed.",
        "16. a4": "Not too sure what she's trying here. If I had to take a guess she's grasping at straws here to try and create some kind of counterplay before she unleashes f4, maybe hoping I'll develop my knight so the e7 square isn't protected anymore.",
        "16... Rd8": "Attacking the knight, forcing her to either retreat or take my bishop.",
        "17. Nxb6 cxb6": "cxb is better then axb in my opinion, it makes the 2 pawns less vulnerable.",
        "18. Rfg1": "Moving out of the pin.",
        "18... Ne7": "It took me 18 moves, but I think I can consider myself fully developed now. I pat myself on the back for a job well done. Ne7 is slightly better than Nh6 in my opinion, because although both moves move towards the d4 square, after Ne7 -> Nc6 white can't play b4. b4 isn't a big threat per sé, but I'm the type of player that likes to kill all counter play before finishing off a game.",
        "19. Ba3": "Attacking said knight. The only response I can muster to this move is: meh.\n\nIt's not really an amazing plan, but a plan is a plan I suppose.",
        "19... Nc6": "Looking to place my knight on d4 with tempo after trading my bishop for her knight.",
        "20. Nc3 Rhe8": "Completely destroying any prospects of f4 and preparing myself to march my extra pawn to the first rank in the future.",
        "21. Nb5": "Mistakes were made. She didn't realize that my bishop can just take her knight.",
        "21... Bxb5 22. axb5 Nd4": "This sequence pins her 2 pawns, which she can't protect. My knight is a monster knight on d4.",
        "23. f4": "A tad too late, but she found the move which haunted me this game.",
        "23... exf4": "No reason not to take.",
        "24. Rxe8 Rxe8 25. h3": "Creating a square for her king to move to.",
        "25... Nxb5": "This move attacks the bishop, thus she must retreat it. After her retreat I planned on pursuing it aggressively in an attempt to get my rook on the 2nd of 3th rank.",
        "26. Bc1 Nd4": "Bc1 isn't exactly what I expected, but I suppose she wanted to recapture on f4. Nd4 aims for Ne2 while also attacking b3. Most people would resign here.",
        "27. b4 Ne2": "And at this moment she realized it was more or less hopeless. Her next move adds salt on the wound.",
        "28. Rf1 Ng3+": "The only move that didn't lose material was Rd1, but it'd cost her her bishop and gives black an easy game.",
        "29. Kh2 Nxf1+": "She resigned. All in all I ended up winning and the chess team I play in even ended up winning its first team victory ( with a score of 3-1) of the season. That being said, this game was full with inaccuracies. If white had played f4 sooner then black would have had a hard game for sure. I also don't like that I wasn't able to exploit her weaknesses, though that in itself is interesting to analyse. 2 weeks ago I won versus a 1600 elo player, this week I struggled against someone easily 400-500 points weaker. It not only proves that I still got a long way to go, but perhaps also emphasizes one of the best parts about chess, the part in which it's a game and no outcome is certain."
    },
    "url": "https://gameknot.com/annotation.pl/inaccuracies-in-an-unfamiliar-opening?gm=57985",
    "gameName": "Inaccuracies in an unfamiliar opening.",
    "players": "Unnamed player (1150) vs. Jeremy (NC)",
    "opening": "Nimzovich-Larsen attack (A01), modern variation"
}