{
    "moves": {
        "1. e4": "I am a king-pawn player, although I am thinking of switching to Nc3.\n\nThis move is very powerful and is one of the most common played moves. The goal of this is to get a fast paced game, attack, and a decent starting position by controlling the center.",
        "1... c5": "This is the Sicilian Defense. The goal of this opening is to smash the enemy with an eventual d5, b5 or something of the sort. This minimally controls the center, but has very complex lines that white is not supposed to know very well.",
        "2. Nf3": "Standard stuff here. I am controlling the center and preparing for an eventual d4 pawn push.",
        "2... d6": "This is the initial Dragon Variation setup. An eventual g6 is expected.",
        "3. Bb5+": "I commence the Sicilian Moscow. This was the opening I was testing. Unlike an Open Sicilian by playing d4, I trade off white bishops for a solid game as well as stop a few of the plans for the Dragon.\n\nIf Nc6 or Nd7, I will castle and things turn out fine for me because if a6, then I can trade off my bishop which will eventually become bad.",
        "3... Bd7 4. Bxd7+ Nxd7": "A little off the main line. I wanted to try the Moscow Gambit which is 4. ...Qxd7 5.c4 Qg4 6.O-O Qxe4 7. d4.\n\nWell, this is playable. As main line goes alike with Qxd7, I played c4 to further control the critical square, d5.",
        "5. c4 e6": "Preparing for a d5 pawn push and giving room for development. Looks like the Dragon is off!",
        "6. d3": "I have no white bishop anymore, so I am free to develop my bishop like this. This is also support for c4 and e4 if ever necessary.",
        "6... Ngf6 7. Be3": "I honestly do not know the main line of this opening very well...",
        "7... Be7 8. Nc3 O-O 9. O-O a6": "This move happens in all Sicilians. This protects the deadly Nb5 if ever going to pose a threat and revs up a b5 push sometime, as the goal is to attack on the queen-side.",
        "10. Re1 Ng4": "Black does not want bishops in the Sicilian. They are generally too deadly.",
        "11. Qd2": "I played fast moves this game. I suppose I did not need the bishop and wanted to develop my queen some more. I now think that Qb3 eventually would be better.",
        "11... Nge5": "Black wants to attack the center with his knights.",
        "12. Nxe5": "I wanted to open the position. When you are losing, even positionally, you want to open the position for maximum counter-play.",
        "12... Nxe5 13. Bf4 Nc6 14. a3": "I wanted to eventually go for a b4 pawn push. This also protects b4 from a knight outpost.",
        "14... Rb8 15. Re3": "An awful move. I lose my rook for a bishop after 15. ...e5 Bg3 16. Bg5. Things get worse now that d4 is wide open to a knight outpost.\n\nI wanted to attack on the king-side with my rook.",
        "15... Bg5": "I get really lucky. Black probably wants to trade off the last plausible defender of d4 so that the knight can go there and threated a fork on b3.",
        "16. Rh3": "Now that I've already made a mistake of moving my rook there, I might as well do something with it!",
        "16... Bxf4 17. Qxf4 Ne5": "If Nd4, I could play Rel1, bringing my second rook in. Although black gets a queen-side attack, I also get an attack with Ree3 and Reg3. From there it's a race to see who wins first.\n\nNe5, on the other hand, gets protection ready for my king-side attack. ",
        "18. Rd1": "Remember, I played fast moves in this game. I must have forgotten about the rook on h3. Anyway, this is good for the threat of d4.",
        "18... b5": "Black is ready to attack the queen-side.",
        "19. cxb5 axb5 20. Qe3": "I wanted to play f4, but this was an inaccuracy. Black can now play b4 and get an advantage from me while I dawdle with my attack.",
        "20... b4 21. axb4 Rxb4 22. f4": "I need to get my attack going now or never!",
        "22... Ng6 23. f5 exf5 24. exf5 Ne5 25. Nd5": "A seemingly harmless pawn is now undefended...",
        "25... Rxb2": "Critical blunder! I can start whacking him with my attack now because he wasted a move displacing his rook!",
        "26. f6": "Exploiting h6 and preparing a strong outpost at e7 for a rook sacrifice.",
        "26... Ng4": "Inaccuracy. I can safely pose more mating threats.",
        "27. Qe4 Nh6": "Really bad move, but what could he have done to win at this point?",
        "28. Rxh6": "Rook sacrifice.\nIf gxh6, then Qg4+ and Qg7#\nIf g6, then Ne7+. If not sacrifice the queen, then Kh8 Rxh7+ Kxh7 Qh4#\nIf any other move besides Rxg2+ then Qxh7#\n\nA won game was quickly made into a lost game because of an infamous pawn.\n"
    },
    "url": "https://gameknot.com/annotation.pl/infamous-pawn?gm=36579",
    "gameName": "Infamous Pawn",
    "players": "astatine (1573) vs. gustur (1759)",
    "opening": "Sicilian (B52), Canal-Sokolsky attack, Bronstein gambit"
}