{
    "moves": {
        "1. e4": "On Black's 15th move he creates a strange \"force field\" around his king which serves as a more powerful protecting wall than any standard castle could provide.  It is almost an invisible electric fence around his exposed, stuck-in-the-center king.  I annotated this game to get some thoughts from other players regarding this bizarre chess phenomenon.",
        "1... e5 2. Nf3 f5": "A Latvian Gambit tourney in which the fiorst 6 moves are set for each side...",
        "3. exf5 e4 4. Nd4 Qf6 5. Qh5+ g6 6. fxg6 hxg6": "Here is the starting point of the tourney.  White has only one good move...",
        "7. Qd5": "Which is 7. Qd5.",
        "7... Bg7": "Black chooses to double the attack on the knight.",
        "8. Qxe4+": "check",
        "8... Ne7": "Develop the g8 knight and shield the check.",
        "9. c3": "Protects the knight.",
        "9... d5": "Attacks the queen and opens lines for the c8 bishop.",
        "10. Qf3": "Retreats the queen.",
        "10... Bf5": "Develops the c8 bishop - Black is down two pawns and needs to get the initiative.  Liquidating queens is conceding defeat.",
        "11. Nb5": "Probably to threaten the fork at c7 and to vacate the d4 square for the d2 pawn.",
        "11... Na6": "Protects c7 and gets the last piece into play.",
        "12. Nd4": "Brings the knight back.  Perhaps now to trade it off for the f5 bishop?",
        "12... Qe5+": "Black takes advantage of a check opportunity.  he also hits h2 a second time with the queen.",
        "13. Be2": "Gets the f1 bishop out - prepares for castling.  However he overlooks the h2 square.",
        "13... Rxh2": "as expected.",
        "14. Rxh2": "This opens the hatch to the king but white is not without defensive resources.",
        "14... Qxh2": "Logical.",
        "15. Nxf5": "White now needs to go for the kill, since Black's king practically all alone in the center of the board ... or is it?",
        "15... gxf5": "Black captures with the pawn and creates the \"force field\".   Even though the king can castle, it is better not to!  The knight covers the d and f pawns well as g6, and the bishop covers f6 and e5.  The king protects the knight and is safely shielded by it.  Strange when it is better not to castle in a situation like this.  I nearly captured with the knight (it looked like a more active move) but this would have been a disaster.  After taking with the pawn, I began to see the bizarre phenomenon of the force field.",
        "16. Bxa6": "Gives the king some air and ruins Black's pawn structure on the queenside.",
        "16... bxa6": "Good move - I nearly checked at h8 which would have lost immediately due to white's resource of bringing the bishop back to f1.  ",
        "17. d4": "Gives the king some more room.",
        "17... Qg1+": "Finally the long awaited invasion.  Note that this invasion is only possible because the white queen has no inroads into Black's camp - thanks to his \"force field\".   I felt very fortunate to have this strange defensive structure around my king.",
        "18. Ke2": "This move gives up the bishop, which is a real shame.  Had the King moved to d2, Black would have been given the challenge of extricating his queen from behind enemy lines, and white would have done battle against the force field.  It was prior to White's 18th move that I analyzed the possibilities for both sides and, in trying to figure out how White could break through, i realized the strength of this defensive barrier around Balck's cetralized king.",
        "18... Qxc1": "Logical.",
        "19. Qg3": "This is White's attempt to break through the \"force field\".  He hits the g7 bishop and the c7 pawn.",
        "19... Qxb2+": "Black has another nice tempo move and he threatens the a1 rook.  And at this point white resigned.\r\n\r\nI annotated this game because I was fascinated by this force field around Black's king - something that i did not plan in the game - I just fell upon it in trying to make the best move.  Hope you find this game interesting .  Any comments are welcome."
    },
    "url": "https://gameknot.com/annotation.pl/instead-of-castling-opt-for-a-force-field?gm=12348",
    "gameName": "Instead of Castling, Opt for a \"Force field\" !",
    "players": "pawnpusher2004 (1644) vs. bleddy71 (1492)",
    "opening": "Latvian counter-gambit (C40)"
}