{
    "moves": {
        "1. e4 e5 2. b3": "Again, e4 (the King's Pawn Opening) and b3 (the Nimzovich-Larsen Attack) are both reasonable moves on their own, but they don't go well together. With e4 you started occupying the center and you ought to develop quickly while supporting you foothold in the center or attacking Black's – Nf3, Nc3, f4, d4 and Bc4 are all better moves.",
        "2... Nc6 3. Bb2 Bc5 4. Nf3 d6 5. d4": "White does well to claim a greater share of the center. Normally I would tell you to develop your other minor pieces and castle before making this move, but in this case Nc3/d2 would remove a supporter of d4, while Bc4/b5 would allow Black to hit back with …Nf6.",
        "5... exd4 6. Nxd4 Bb4+ 7. c3 Ba5": "?! Tension, tension. There is no need to make this trade unforced. Why not apply more pressure to the Knight first, with Bb5? ",
        "8. Nxc6 bxc6 9. b4": "?! Now is the time for development, not for making pawn thrusts on the wings. This move does nothing to aid your development, weakens your pawn structure (we haven't gone over what that means yet, I know), and just forces the Black Bishop to go to a better square.",
        "9... Bb6": "This move is fine, but …Rb8 would have been a fancy way to develop a piece while indirectly protecting the Bishop.",
        "10. c4": "! Releasing the DSB (Dark-Squared Bishop) with a gain of time (the threat against g7). Still, why did you have to play b4 first?",
        "10... c5": "? Preventing the \"threat\" of c5, which would have just lost a pawn anyways. Black desperately needed to play …Nf6. Now White wins a whole Rook.",
        "11. Bxg7": "! Good eye for those diagonals!",
        "11... Nf6 12. Bxh8 Nxe4 13. Bd3": "! Not getting complacent. White develops while hitting the pesky advanced Knight and clearing the way for castling.",
        "13... Qe7": "Better than retreating.",
        "14. O-O f5": "? Instead of opening lines to his own King, Black should develop the Bishop on c8.",
        "15. Re1": "A dangerous pin.",
        "15... cxb4": "! Preventing f3 and threatening Bxf2+.",
        "16. Bxe4": "Eliminating the threat.",
        "16... fxe4 17. Qh5+ Kd8 18. Nd2": "! Getting the last pieces into the fight. (Qd5!? also deserved a look, but I'm glad you chose to develop.)",
        "18... e3": "! Making some play out of the doomed e-pawn.",
        "19. Qd5": "?? Ouch! The pawn isn't really pinned! Gotta stay sharp, even when winning.",
        "19... Rb8": "?? One good turn deserves another. …exf2+! (yes, it's check!) 20. Kf2 fxe1=Q+ 21. Rxe1 Rb8 and White is in big trouble.\nBlack should have won the game here, but missed his chance. To your credit, you didn't give him another.",
        "20. fxe3 Bb7 21. Qg8+ Qe8 22. Bf6+ Kd7 23. Qxh7+": "Good job picking up that extra pawn before trading Queens.",
        "23... Kc8 24. Nb3 Be4 25. Qh3+ Kb7 26. a4 a5 27. Bd4": "White is playing with purpose: the White pieces are increasingly encircling the Black King's position.",
        "27... Qc6 28. Bxb6": "An unnecessary exchange; it'd be better to get the last Rook involved. Still, I can't blame you for trading while ahead.",
        "28... Qxb6 29. Qg4": "Squeezing Black more and more.",
        "29... Bc6 30. h4": "! Here's your trump. Black, huddled up in one quarter of the board, now has to figure out a way to stop the pawn or perish.",
        "30... Re8 31. Qg3": "Good, no need to miss necessary defensive moves.",
        "31... Be4 32. h5 Qc6": "?? And Black makes a final huge mistake under the pressure.",
        "33. Nxa5+": "! Curtains! Good eye."
    },
    "url": "https://gameknot.com/annotation.pl/internet-blitz?gm=36621",
    "gameName": "Internet blitz",
    "players": "pimpdaddy mac  vs. theprince ",
    "opening": "King's pawn game (C20)"
}