{
    "moves": {
        "1. e4 e5 2. Nf3 Nc6 3. Bc4 Bc5": "The starting moves of the Italian Game. So far, very standard.",
        "4. d3": "Not a mistake, but definitely less popular than c3.",
        "4... Nf6 5. Bg5 h6 6. Bh4": "Good, better to maintain the tension than to exchange right away. The pin is very useful later.",
        "6... d6 7. Nc3": "?! I hate to criticize this move, because it is 100% consistent with basic opening principles. Nc3 is not really a bad move per se, but it is unambitious and leads to a potentially dull and boring game. \nMore promising options would be c3, aiming for either b4 or d4, castling to leave options open, or h3, preventing White's next move.",
        "7... Bg4": "The game is now almost entirely symmetrical. Often symmetry works out poorly for Black, who is behind by a half-move, but in a position as locked up as this one, it will be hard for White to make any play without taking some risks.",
        "8. h3 Bh5 9. Nd5": "This is an excellent square for the Knight, and it takes advantage of the annoying pin on Black's f6-Knight. ",
        "9... Nd4": "?! This is carrying the symmetry too far. Black might have tried ...g5 10. Nxf6+ Qxf6 11. Bg3 0-0-0 instead, getting the King to safety on the Queenside.",
        "10. Nxf6+": "White strikes first.",
        "10... gxf6 11. g4": "! And now, Black is denied the same opportunity. White has inflicted a weakness on the Kingside and has gained space there as well. On the other hand, the Kingside will no longer be a safe space for the White King, so White needs to put some serious thought into the King's future. In the actual game, White delayed figuring out the King's situation so long that it became a real problem.",
        "11... Bg6 12. c3": "!? On one hand, this move is admirable for how it restricts Black's pieces and kicks the Black Knight out of d4. On the other hand, it leaves behind some problems for White: 1) the Knight was the only White piece who could really take advantage of all those nice squares on the Kingside (f5, h5) and in the center (e3, d5), and 2) White will probably want to castle Queenside, so this weakens the King's future home. \nA different plan would be to play Bg3, so that either Black plays Nxf3+ of his own volition, or you get to play Nh4, threatening both Nxg6 and Nf5.",
        "12... Nc6": "?! Now that White has committed to c3 in order to restrict this Knight, Black should have traded it off.",
        "13. d4": "? Ooooh.... yes, this move is a very worthwhile goal. But the White pieces just aren't ready for it. The Queen needs to develop, the King needs to castle, and there needs to be adequate support for both center pawns. As it is, this move just loses a pawn and hands Black the initiative.",
        "13... exd4 14. cxd4 Bb6 15. Qb3": "? Wishful thinking. Now BOTH center pawns hang. \nDefending the e-pawn with, say, d5 and Bd3 (Bd3 right away loses the d-pawn) should have been the priority. ",
        "15... O-O": "! Cool, calm and collected. Black takes a move to secure his King, knowing that White cannot defend his center pawns.",
        "16. Nd2": "? Undefends one pawn to defend another. 0-0-0 would have been better. d5? would have been met by ...Na5.",
        "16... Nxd4 17. Qc3 c5": "?\nAt this point, during the next few moves we see a familiar pattern: One player makes a mistake, then the other player, after taking a big advantage, doesn't know what to do with it and drifts aimlessly. Meanwhile, the first player (White here), newly motivated by his/her mistake, plays with renewed focus and gradually takes over the initiative.",
        "18. O-O-O Ba5 19. Qe3 Kg7 20. f4 Bxd2+ 21. Rxd2 b5 22. Bd5 Rc8 23. g5 fxg5 24. fxg5 h5 25. Bf2 Qe7 26. Kd1": "? I assume that White was short of time, since this move does nothing to help the attack. What about either moving the Rook on h1, or getting the Queen out of the Dark-Squared Bishop's way?",
        "26... Rce8 27. Rxd4": "?! Courageously giving up more material to eliminate Black's best piece. But it would have been much better to play Qc3 and then Bxd4+, trading a Bishop for the Knight instead of giving up a Rook for it.",
        "27... cxd4 28. Qxd4+ Kg8 29. Re1": "! Good, using all of the pieces.",
        "29... Qxg5": "Black should not go grabbing pawns in front of his King right now. Instead, he should focus on using the material he already has to take the fight to the insecure White King which is stuck in the center  – …Rc8 or …Qc7 come to mind.",
        "30. Rg1 Qh6 31. Qxa7": "? Ditto for White – this is not the time to go grabbing wing pawns. White is too far behind in material to be able to make up for it with this kind of Queen sortie. All this does is a) open lines to the White King after …Ra8, and b) take the Queen out of the action. Instead, moves like Qf6 or Qg3 – attacking the Bishop (notice that the f7-pawn is pinned?) and freeing d4 for the White Bishop – should have been under consideration.",
        "31... Rec8": "? Missing White's next – forcing it, in fact. Black should have noticed how short of squares his Queen was. Now was the time to free the Queen with …Qf4.",
        "32. Be3": "! An excellent idea, which forces a major concession from Black (hiding the Queen away on h7) if he wants to avoid a draw by repetition. ",
        "32... Qg7 33. Bd4": "The Black Queen cannot avoid harassment without completely removing herself from the action.",
        "33... Qh7": "Taking the repetition with …Qh6 would have been hard to do in view of Black's being up the Exchange (i.e. Rook for Bishop), but it would have avoided the loss. White's pieces are now too active compared to Black's, and Black needed to get real about his chances.",
        "34. Qb7": "Another consequence of Qxa7? is that the Queen and Bishop now get in each other's way. Still, instead of this little step, the Queen should have gone all the way to e7, threatening to move to f6 next turn, at which point Black would be completely tied up.",
        "34... Qh6": "? Thinking to take advantage of the fact that Be3 is no longer an option, but it gives White the opportunity to play…",
        "35. Bxf7+": "!! This move! An excellent combination, not at all easy to see – especially with your clock ticking down. It is very impressive that White, despite the time pressure and the psychological effect of being behind for so long, was able to spot this tactic. The Bishop on g6 is pinned, and the Rook on f8 is overloaded. (i.e. it's trying to guard too many pieces at once.)",
        "35... Rxf7 36. Qxc8+": "White is only up one pawn for now, but he has not given up any of his piece activity and his position is crushing. Black now decides to end things quickly.",
        "36... Kh7": "?? …Rf8 would have held out longer, of course. Then 37. Qe6+ Kh7 38. Qxd6 (threatening 39. Rxg6 Qxg6 40. Qxf8, among other things) would have kept White firmly on the path to a quick victory.\nAs it is, White does not miss this chance to end things quickly and cleanly, before any more mistakes can happen on either side.\n",
        "37. Qh8#": "Congratulations on your fighting victory! The game wasn't always pretty, but it was scrappy and plenty exciting."
    },
    "url": "https://gameknot.com/annotation.pl/internet-blitz?gm=36810",
    "gameName": "Internet Blitz",
    "players": "pimpdaddy mac  vs. marius Broeren ",
    "opening": "Giuoco Pianissimo (C50)"
}