{
    "moves": {
        "1. Nf3": "A little interlude to the Grand Tour match of fatcat2 vs Computers. Having played 4 games so far against various computers, I am beginning to feel that I'm missing something. What I need is a good example of how to beat my silicon opponents - and what better one to look at than the 1st game of the 1997 match of Garry Kasparov vs the updated Deep Blue?\r\n\r\nWe start with the Reti Opening. Quite a recent one, and a flexible opening as it offers opportunities to transpose into King Pawn, Queen Pawn or English setups.",
        "1... d5 2. g3": "White is going for a Barcza kingside formation.",
        "2... Bg4": "The Keres Variation.",
        "3. b3 Nd7 4. Bb2 e6 5. Bg2 Ngf6 6. O-O": "White has a solid, although possibly slightly cramped position. Notice the excellent control that his fianchettoed bishops have of the centre.",
        "6... c6 7. d3 Bd6 8. Nbd2 O-O 9. h3 Bh5 10. e3": "White is slowly, solidly gaining more space and advancing his pawns and pieces. The game has so far been very positional; I have seen no tactics coming into it, which is unlike Kasparov but I suppose a good policy against a computer.",
        "10... h6 11. Qe1 Qa5 12. a3 Bc7 13. Nh4 g5 14. Nhf3 e5 15. e4": "Now White is becoming more dynamic, with a strike at the centre and opening up his position.",
        "15... Rfe8 16. Nh2 Qb6 17. Qc1 a5 18. Re1 Bd6 19. Ndf1": "White appears to be retreating! He has formed a solid but cramped kingside. Have I missed something?",
        "19... dxe4 20. dxe4 Bc5 21. Ne3 Rad8 22. Nhf1 g4 23. hxg4 Nxg4 24. f3": "If I did not yet know the result of the game I would say White is in a lot of trouble. Deep Blue is playing to the traditional strengths of a computer - tactical attacks -  while White seems to be forced into passivity.",
        "24... Nxe3 25. Nxe3 Be7 26. Kh1 Bg5 27. Re2 a4 28. b4": "Keeping the queenside files blocked.",
        "28... f5 29. exf5 e4 30. f4": "White is bypassing all of White's pawns, rather than capturing them, and thus maintaining the positional equilibrium and not allowing Black any open lines to attack down.",
        "30... Bxe2 31. fxg5 Ne5 32. g6 Bf3 33. Bc3 Qb5 34. Qf1": "Suddenly it is Black who appears to be on the ropes! His kingside has been cracked open like an egg, and White's kingside pawns are menacing his position...",
        "34... Qxf1+ 35. Rxf1 h5 36. Kg1 Kf8 37. Bh3 b5 38. Kf2 Kg7 39. g4": "White is maintaining his strong position on the kingside.",
        "39... Kh6 40. Rg1 hxg4 41. Bxg4 Bxg4 42. Nxg4+ Nxg4+ 43. Rxg4": "Such mass exchanges can only help White, who is down by an exchange but has an easily won pawn formation.",
        "43... Rd5 44. f6 Rd1 45. g7": "Deep Blue resigns. The final result of the match, incidentally, was 3.5-2.5 to Deep Blue...this was the only game Kasparov won. But I am going to study it further and I hope to pick up some tips..."
    },
    "url": "https://gameknot.com/annotation.pl/interlude-how-to-beat-the-computers?gm=20811",
    "gameName": "Interlude - How to beat the Computers",
    "players": "Garry Kasparov  vs. Deep Blue ",
    "opening": "Reti (A07), King's Indian attack, Keres variation"
}