{
    "moves": {
        "1. e4 e5 2. Nf3 Nc6 3. Bb5": "Ruy Lopez opening, nothing to see here.",
        "3... a6": "Book move, pushing the bishop to make a decision.",
        "4. Ba4 Nf6": "Ordinary developing move.",
        "5. O-O Be7": "Another book developing move.",
        "6. Re1 b5": "Grabbing some queenside space whilst white must retreat.",
        "7. Bb3 O-O 8. c3 d6": "Still in book, letting the LSB out.",
        "9. d4 Bg4": "Maintaining the tension in the centre and pinning the knight.",
        "10. d5 Na5": "With a view to forcing the bishop back to c2 where it doesn't have much influence and cramps whites base, or exchanging for a knight which is slightly in my favour I believe.",
        "11. Be3": "Well this is the first move out of book and unfortunately it's a mistake, cutting off the defence to e4.",
        "11... Nxe4": "Free centre pawn, it would be rude to turn it down..",
        "12. Bd2 Nxb3": "Exchanging off whites LSB for a knight, the knight wasn't doing much there on the edge other than threatening to go to c4, so this seemed like a good idea.",
        "13. axb3 Nf6": "d5 is undefended so although this blocks blacks DSB in, it keeps white on the back foot.",
        "14. Bg5 Bxf3": "The start of a series of exchanges that wins the d pawn, I don't believe white has any way of avoiding this loss.",
        "15. Qxf3 Nxd5 16. Qxd5": "Bxe7 might have been better, leaving black with a knight rather than a bishop, although being behind 2 pawns perhaps white should have pulled the bishop back rather than exchaning pieces.",
        "16... Bxg5 17. Qb7 Qc8": "The only move that doesn't lose material.",
        "18. Qxc8 Rfxc8": "Queens off the board now, black should have enough to win this game now although he is rather blocked in by his own pawns, my general plan at this point was to just advance everything together and with a few simplifying exchanges the extra pawns should lead to a relatively simple endgame win.",
        "19. Re2 h5": "The idea of this move was to restrain whites kingside pawns and stop white trying to cramp the bishop in.",
        "20. c4 f6": "Carrying on with the plan to advance everything together gradually, the bishops mobility isn't great at the moment but that won't be a permanent situation.",
        "21. cxb5": "This didn't strike me as a particularly good move, allowing black to open the a-file and get the rooks into a more active position. The gameknot computer agrees  and suggests Nc3 instead.",
        "21... axb5": "May as well open the a-file since the opportunity has presented itself, white will have to allow the exchange of his rook since Na3 isn't a permissible defence (due to ..b4).",
        "22. Rxa8 Rxa8": "White has a bit of a problem here, his king is vulnerable to a back rank mate, and once black plays Ra1 the white rook will be left having to defend the helpless knight until the king can move over to help.",
        "23. Nc3": "This is a blunder that loses the game unfortunately.",
        "23... Ra1+": "White can delay the mate but not prevent it, it's a back rank mate in two from this position. White actually timed out here, I guess he couldn't face being checkmated :-)"
    },
    "url": "https://gameknot.com/annotation.pl/ionadowmans-mini-tournament-i?gm=51556",
    "gameName": "ionadowman's mini-tournament I",
    "players": "sanjay2000 (1455) vs. small_potato (1780)",
    "opening": "Ruy Lopez (C91), closed, Bogolyubov variation"
}