{
    "moves": {
        "1. d4 d5 2. c4 e6": " The Queens gambit Declined with 2.e6  is much more common than the Queen's \n  Gambit Accepted ( 2.dxc4) and the Slav ( 2.c6).l",
        "3. Nc3": " Putting pressure on the d5 pawn and at the same time developing a piece.",
        "3... Nf6": " Black also develops a piece and supports the d5 pawn",
        "4. Nf3": " Developing a piece and also supporting the d4 pawn",
        "4... Be7": " preparing to castle king side.... ",
        "5. Bg5": " Seeming fairly logical by developing pieces to there most aggressive squares\n but ideally with an eye on the center.   ",
        "5... Nbd7": " In any case of a future Bxf6 then Black can recapture with the knight and White\n would not get a good exchange by doing so.",
        "6. e3": " Allows the light squared bishop to see light of day and at the same time the \n f1 bishop supports the c4 pawn.",
        "6... O-O": " Black gets his King to safety and allows his Rook to come into the game.",
        "7. Rc1 c6": " Supporting the d5 pawn and also allowing the Queen access to the Queen side.",
        "8. Bd3": " White prepares to now castle King side and also he puts his bishop on a very \n good diagonal that leads towards Black's King.",
        "8... dxc4": " Black gives up his center to in exchange 1. Allow his f6 knight to hop to d5 next \n move and 2. To get the Bishop of the b1-h7 diagonal for a bit.",
        "9. Bxc4 Nd5": " Black's 9th move was introduced by Jose Raul Capablanca as a maneuver to \n free up some space in the Queen's Gambit Declined. Black is following the \n strategic principle that the side with the least amount of territory should\n exchange some pieces to relieve the annoying cramp.",
        "10. Bxe7": " I think that  was pretty much forced.",
        "10... Qxe7": " Recapturing....",
        "11. Ne4": " This is Alexander Alekhine's invention. The rather mature Alexander Alekhine is\n very happy to go straight into 11. Qb4   12. Qd2  Qxd2  13. Kxd2, which leads\n to a slightly superior endgame for White.",
        "11... Nd5f6": " Offering an exchange of knights.....",
        "12. Ng3": " Swapping is really not a very good idea because all Black does is he recaptures\n with the knight and that also allows the Bishop to come to d7, gives Black some\n more space and completing his development and connecting the rooks.",
        "12... e5": " Black is doing this for the sake of gaining some more space and being less and\n less cramped but it allows the White knight to come to f5 where it may cause\n some problems for Black.",
        "13. O-O": " White gets his King to safety bring his rook into the game and can possibly play\n a future Re1 and put the Rook on the same file as the Black Queen, which can\n be fairly dangerous for Black- Big time!",
        "13... exd4 14. Nf5": " White kinda makes an in-between move at this point. But still a better move\n might possibly be 14. exd4 and then followed by 15. Re1, when White \n introduces his Rook with a tempo. But in the long run I think that black will be\n able to gain equality.",
        "14... Qd8": " The Queen retreats.... ",
        "15. Nf3xd4": " White recaptures the  pawn.",
        "15... Ne5": " Black is threatening the c4 bishop with his knight and also it allows his c8 \n bishop to see daylight. ",
        "16. Bb3": " A swap off is not good for White so he retreats his bishop.",
        "16... Bxf5": " Black knows that his Bishop would hardly be any use so he swaps it off for the \n  fairly aggressive knight.",
        "17. Nxf5": " White recaptures and still has a fairly aggressive knight.",
        "17... Qb6": " ?   Now this is the move that set up Black's future problems. The fairly forced       17.g6 would chase the f5 knight  away from its fairly aggressive position and also would equalize the game. The position one or two moves ago seemed to\n  be quite simple, but now Alekhine takes the initiative end of things and\n creating threat after threat, never lets up.  ",
        "18. Qd6": " ! Threatening the e5 knight and also going down Black's throat in a way. ",
        "18... Ned7": "    Retreating..... ",
        "19. Rfd1": "  White gets his other Rook doing something....",
        "19... Rad8": "   Black puts his Rook on the same file as White's Queen meaning that White\n   must now retreat his Queen",
        "20. Qg3": " The Queen retreats and Is also threatening 21. Qxg7 checkmate! ",
        "20... g6": "  A forced move If  20.Ne8  21. Nh6   Kh8  22. Nxf7  will win White some \n  material.",
        "21. Qg5": "  !  White is now threatening 22. Rd6  which hits Black's Knight. ",
        "21... Kh8": "  Black gets his King of the g- file so he can simply threaten to wipe out White's \n Knight  with 22.pxf5",
        "22. Nd6": "  And now  23. Nxf7   threatens to eat some material.",
        "22... Kg7": "  To give the  f7 pawn more support, but it is not ideal for his King he has walked \n back on the g-file where he is pinned again",
        "23. e4": "  !   Even the e-pawn joins in the attack. This move also frees the 3rd rank for \n      White's Rooks to come to the Kingside.",
        "23... Ng8": "  So Black can play 24. f6 and hopes to stay alive.",
        "24. Rd3": "  !   White is correct to bring in his reinforcements to get at the Black King.",
        "24... f6": " As you can now see a rather sweet pattern would  result from 24. h6 25. Nf5 \n Kh7  26. Nxh6!  f6   27. Nf5!  fxg5  28. Rh3  with checkmate to follow!",
        "25. Nf5+ Kh8": "  Black's only move....",
        "26. Qxg6": "  Black resigns here. Lasker laid down his King because he had no desire to\n  suffer through  26. hxg6   27. Rh3   Nh6  28. Rxh6 Checkmate. A very very\n  devastating victory for Alexander Alekhine."
    },
    "url": "https://gameknot.com/annotation.pl/is-emanuel-lasker-immortal?gm=6012",
    "gameName": "Is Emanuel Lasker Immortal?",
    "players": "Alexander Alekhine (N/A) vs. Emanuel Lasker (N/A)",
    "opening": "QGD (D37), classical variation (5.Bf4)"
}