{
    "moves": {
        "1. e4": "Annotations aided by Stockfish.js 6 running in Google Chrome",
        "1... c6 2. d4 d5 3. Nc3 dxe4 4. Nxe4 Bf5 5. Ng3 Bg6 6. Nh3 Nf6 7. Nf4 Nbd7 8. h4 e5 9. dxe5 Qa5+ 10. c3 Qxe5+ 11. Be2 O-O-O": "Up to here we've actually followed a game in the database, between Babikov and Turdyev from 2008.",
        "12. Qb3": "Babikov played 12.Qa4. Castling is also good. I could tell almost immediately that the text move lost. It took hours to figure out how...and then I still didn't figure it out.",
        "12... Nc5": "So, this is the move to win. I put in the conditional moves 13. Nxg6 hxg6 14. Qc2 Nd3+ 15. Kf1 Nxf2 16. Kxf2 Bc5+ 17. Kf3 Qd5+ 18. Kf4 Rhe8. The only bad move by Black in that sequence is 18...Rhe8, since 18.Kf4 leads to a mate in two. Generally speaking, don't get cocky and put in this many conditional moves.",
        "13. Nxg6 hxg6 14. Qxf7": "I completely missed this move. Black still wins. I played 14...Nd3+ knowing that if I couldn't find a win after 15...Nxf2 I could resort to 15...Nxc1. ",
        "14... Nd3+ 15. Kf1": "Not 15.Kd1, a mate in 5 that even I was able to work out (although I missed a delaying interposition and thought it was mate in 4). And not 15.Kd2 either, in which case I figured 15...Nxf2+ was good due to either 16.Kc2 Nxh1 or 16.Ke1 Qxg3. How to respond to this move, however, I was less clear on, although I still thought Nxf2 was good. It was, but not for the reasons I foresaw.",
        "15... Nxf2": "Played after what must have been at least 1-2 hours of thought. I actually set up conditional moves through move 17. Again, I went one move too far. But I wanted to make sure this capture worked before I played it. I thought I got there, but found out too late that I had not.",
        "16. Kxf2 Bc5+ 17. Kf3": "So far, so good, but the conditional move here was...",
        "17... Nh5": "[WARNING: Wall of text.] Black was way ahead, and is now barely ahead. But this was not a case of putting too little thought into my moves--this was a conditional move worked out in those hours on move 15. \n\nBlack has many options to win, and I examined two of them: 17...Bd6 and 17...Nd5. (I also looked at 17...Qd5 until realzing White's queen guards that square--so I guess in that case, taking my time did work out!) I rejected Bd6 due to 18.Qxg6 and did not play Nd5 because of 18.Bf4.\n\nLet's take on 17...Nd5 first because it's easier to explain. I had been well aware of the f-file pin well before this move, but for some reason I completely overlooked it in the 17...Nd5 variation. It's just fine for Black to play 18...Nxf4 19.Qxf4 Rhf8. (The choice between Rdf8 and Rhf8 in these variations is a whole other question, beyond the scope of this annotation.) Instead, I thought that by attacking my queen, White would have left me with no time to enact the pin I was looking for. \n\nAfter 17...Bd6, meanwhile, 18.Qxg6 is indeed White's best response by guarding the knight on g3. However, White's king is still stalemated, so there's no time to get out of the discovered check after Rhf8 except giving up a piece by 19.Nf5 Ne4 20.Qg4 Rxf5+. (19...Ne4 threatens 20...Rxf5+ 21.Qxf5+ Qxf5+ 22.Ke3 Bc5# and if 20.Kg4 to break the pin there is a mate in 2.)\n\nNow, it looks silly to claim I might have thought too much when those decisions are made on just a one-ply response. However, what I mean is, if I had only looked for 30 minutes, I would certainly have played 17...Bd6 or maybe 17...Nd5. Instead, I thought to the point where I found \"refutations\" to those moves that actually failed. Perhaps I needed to think about how I could reply to those \"refutations,\" and that's where extra thought should have come in. But spending hours seems like enough time. I suppose it's as important *what* you're looking at as how long you look.",
        "18. Nxh5": "When looking through the position while awaiting this move from White, I realized to my horror what was instead about to ensue. The point of 17...Nxh5 was to simultaneously threaten g3, increase control over f4, and immediately prepare for the f-file pin. (I'm just now realizing the pin isn't that important anyway. If the queen flees to b3, Black must still have a withering attack on the White king, right?) Anyway, White's 20th move suddenly became painfully obvious.",
        "18... Rhf8 19. Qxf8 Rxf8+ 20. Nf4": "Well, now what to do? Here came another 1-2 hours of thinking. This time, I ended up at a good move, one of two that keeps an advantage according to Stockfish 6.",
        "20... Bd6": "At this point, I was trying to figure out how to end up losing a rook and a minor piece, instead of two rooks. The plan to get there was somewhat convoluted: 21. Kf2 Qc5+ 22. Kf3 g5 23. hxg5 Qxg5. It doesn't work due to 22. Be3  Rxf4+ 23. Bf3, breaking the pin and thus enabling the latent bishop fork. No matter what I did now, in fact, I would end up in a queen-for-two-rooks situation with best play from White. Stockfish actually likes Black in the conditions of this ending, though. I assume it's do to the queen's ability to pick off a couple pawns before White's uncoordinated rooks, still on their initial squares, could get their act together.",
        "21. g3": "I had seen this potential response, and was thus able to take advantage of the resulting tactic with ease.",
        "21... Qd5+": "Thanks to another pin, Black now picks off the h1 rook and is way ahead again.",
        "22. Kf2 Qxh1": "White resigns."
    },
    "url": "https://gameknot.com/annotation.pl/is-it-possible-to-overthink-in-chess?gm=62365",
    "gameName": "Is it possible to overthink in chess?",
    "players": " (1804) vs. hscer (1869)",
    "opening": "Caro-Kann (B18), classical, Flohr variation"
}