{
    "moves": {
        "1. e4": "This was a rubber match against an opponent I had already lost a game to.  I have specialized in the Scandinavian, at about the club player level.  The Scandinavian, also known as the Centre Counter, gives Black the initiative on the first move.  YouTube has videos on the opening.",
        "1... d5": "The signature move.  Black challenges White's e4 pawn, and one of the main lines goes exd, Qxd, and the Black Queen is vulnerable to attack.  I don't like this line and choose the \"Modern Variation\" which gambits the pawn.",
        "2. exd5 Nf6": "The Modern Variation of the Scandinavian Defense.  Black gains a tempi in development as the White K pawn has moved twice and is now threatened with extinction.",
        "3. d4": "This is the variation that I like least.  White could also try Nc3, Bb5 or Bc5 and c2-c4 in hopes of holding onto the pawn.  These usually give Black more initiative.  Here, White gives the pawn back and continues his development, also opening lines for the c1 Bishop.",
        "3... Nxd5 4. c4": "This is what I don't like about this variation.  Black now loses a tempi, especially if the N retreats to f6.  The \"book\" recommends the following move by Black.",
        "4... Nb6": "Now, if c4-c5, then the N gets a fine outpost on d5.  But the Black N on b6 is marginalized, somewhat, and White has a commanding center.",
        "5. Nf3 Bg4": "Black wants to develop in a way that also gives a threat, and nullifies the power of the N on f3 because of the pin on the queen.",
        "6. Nc3": "White would have been advised to play Be2, breaking the pin and preparing to castle.  ",
        "6... e6": "To free the f8 Bishop and prepare for castling.  Black also eyes the f8-a3 diagonal",
        "7. c5 Nd5": "White has forced Black to a good square.",
        "8. Bb5+": "This check loses time because of the easy and natural defense.",
        "8... c6": "Also strengthens d5.",
        "9. Be2": "The Bishop took two moves to accomplish what should have taken one move.",
        "9... Be7": "Preparing to castle and also preventing any intrusion on g5.",
        "10. O-O O-O 11. Ne5": "e5 is a good outpost for the N, but it is supported by a backward pawn.  It also leaves its defensive post on f3 and encourages the following exchange.",
        "11... Bxe2 12. Nxe2 Nd7": "Black doesn't care for the e5 Knight.  It is like a bone in the throat.  He wishes to exchange his bad Knight for White's good one.",
        "13. Nxd7": "White obliges.",
        "13... Qxd7 14. Be3": "That's a poor role for a Bishop.",
        "14... Bf6": "Black builds pressure against the backward pawn.",
        "15. Qd2 Rad8 16. Rad1 Be7": "Black tries to prepare a little combination, based on the fact that the backward pawn on d4 is pinned.",
        "17. a3": "White wants to give c5 more support with b2-b4.",
        "17... Nxe3": "Clears the d file for the power of the Q & R and forces White to recapture.  ",
        "18. fxe3 Bxc5": "The trap is sprung.  A pawn is a pawn.",
        "19. b4": "Too little too late.",
        "19... Bb6": "Black keeps the B on the same diagonal as the enemy King.  c7 is also a safe refuge for the Bishop should the situation arise.",
        "20. Rf3": "White appears to be preparing to double rooks on the f-file.",
        "20... c5": "The d4 pawn is still pinned.",
        "21. bxc5 Bxc5 22. Qc3 Bb6 23. Rh3": "This basically took the rook out of play.  A one piece attack is doomed to fail.  ",
        "23... e5": "still pinned!",
        "24. d5 Qb5": "A double attack against the N and pawn.",
        "25. Qc2 h6": "Had to stop mate on h7",
        "26. Nc3 Qa5": "Attacks the a-pawn.  Puts pressure on c3 (with a rook shift to the c-file contemplated).  ",
        "27. Ne4": "Black worried that White try a N sac on f6.  Therefore....",
        "27... f5 28. Nc3": "White has wasted a move, again!  ",
        "28... Rdc8": "Double attacking the Knight, and pinning it to the Q.",
        "29. Rd3": "This defense is too little, too late.",
        "29... e4": "Removes a defender, so the Knight must fall.  White resigned."
    },
    "url": "https://gameknot.com/annotation.pl/is-today-a-sexist-holiday?gm=24494",
    "gameName": "is today a sexist holiday?",
    "players": "ioniccap (1617) vs. halfairchild (1602)",
    "opening": "Scandinavian (B01), Kiel variation"
}