{
    "moves": {
        "1. e4": "Hi everyone!\n\nI am playing in a MT in memory of the victims of the Japanese Earthquake.  Both the above players are my current opponents.  I saw that my buddy Jim had lost his Master status and found that he had, sadly, lost a game to a Class B player called Delta38.  It shows that amateurs CAN BEAT Masters and as I am currently playing a huge crop of Masters and a Grandmaster I will play through this game to show myself how it can be done.  Gameknot Analysis is provided here: http://gameknot.com/analyze-board.pl?bd=15498364&fb=1&rnd=0.41857366360436593.  Jim starts off with 1. e4 and Delta gives him the French Defense with e6.",
        "1... e6 2. b3": "2. b3 - a little offbeat but prepares to fianchetto his dsb onto b2.",
        "2... Nf6 3. Nc3 b6": "3. ..... b6 - Delta returns the compliment.",
        "4. Bb2 Bb7 5. d3 d5 6. e5": "6. e5 - this pawn wedge on e5 is quite a common feature of the French Defense.",
        "6... Nfd7 7. Nf3 c5": "7. ..... c5 - GM Daniel King, in a chess video on the French has always recommended this black pawn break on c5 before black's queen knight goes to c6.",
        "8. Be2 Nc6 9. Nb5 a6": "9. ..... a6 - Delta does not wish Jim's knight to get too comfortable on b5.",
        "10. Na3 b5": "10. .... b5 - suddenly a nice, neat pawn wall on the queenside.",
        "11. O-O d4 12. c3 dxc3 13. Bc1": "13. Bc1 - wow and double wow, black wins a pawn here because if Bxc3 then we have an example of a PAWN FORK on b4.  Either Jim's knight or his bishop will have to go.  Now that pawn on c3 could become very awkward indeed for Jim.",
        "13... Ndxe5": "13. .... Ndxe5 - and so the carnage goes on.  Another white pawn drops off and suddenly black is TWO pawns to the good.  Unlike me, Delta bravely keeps his mits off the Offer Draw button - mind you - I think I will now, if I had that position avoid offering my opponent a draw now I have that little handful of Expert Draws in my profile I am prepared to up the ante!",
        "14. Nc2 Nxf3+ 15. Bxf3": "15. Bxf3 - now with plus material black is eager to trade white down into an inferior endgame.",
        "15... Qc7 16. a4 b4": "16. ...... b4 - now that passer on c3 is well supported.  Passivitis and paralysis is setting into the white camp like dry rot!",
        "17. Ne3 Be7 18. Nc4": "18. Nc4 - Jim tries to break free of it but will it last?",
        "18... Nd4 19. Bxb7 Qxb7": "19. ..... Qxb7 - now more wood disappears from the board - white's chances of counterplay are being reduced further.",
        "20. Bf4 O-O": "20. .... 0-0 - black finally castles on move 20 so his rooks are now connected and can pile on more pressure on the white position.",
        "21. Be3 c2": "21..... c2 - that pawn advances, but is this premature?  That pawn is just one square from promotion (if I was the black player it would have been called Glendadom).",
        "22. Qh5": "22. Qh5 - Jim puts his queen to an aggressive square but will it do him any good?  No - because look at the b3 pawn - that one too is just gonna drop!",
        "22... Nxb3 23. Ra2 Nd4 24. Bxd4 b3": "24. ..... b3! - a beautiful in between move.  White must move his rook and then Jim's dsb is picked off next move and black has two connected passed pawns just soooo close to promotion.",
        "25. Qg4 cxd4 26. Rb2 Rfc8": "26...... Rfc8 - I have a feeling black is prepared to sac one of his rooks for that knight on c4 which is holding white's queenside together and preventing those pawns from crowning.",
        "27. Qf3 Qxf3 28. gxf3": "28. gxf3 - this queen trade has worsened Jim's position still further.  His kingside pawn structure is shattered.",
        "28... Rab8": "28. ..... Rab8 - awesome -- this rook backs up the b3 pawn and black has just kept that pressure on.",
        "29. Ra1 Rxc4": "29. ...... Rxc4 - as predicted.",
        "30. dxc4 d3": "30. ..... d3 - Jim accepts the sacrifice and Delta pushes his d pawn to d3 where it backs up the b2 pawn.  I think that next up is Ba3 and if Rxa3 then c1/Q+ comes next.  The rook on b2 will be trapped so Jim resigns on the grounds of ruinous loss of material and Old Matey will not be too far away.  This is an absolutely awesome result for Delta because Jim Friar is a very strong player and here are my past game stats against him - past games against therealjimfriar (won/lost/drawn): 0 (0%) / 7 (87%) / 1 (12%).  Yup, I think the Master Mater will be certainly quaking in his hiking boots if he ever comes across a Delta!  Anyhow, I hope you have all had a good read.  Bye for now - Joanne"
    },
    "url": "https://gameknot.com/annotation.pl/it-can-be-done?gm=39311",
    "gameName": "IT CAN BE DONE!",
    "players": "therealjimfriar (2204) vs. delta38 (1678)",
    "opening": "French (C00), Reti (Spielmann) variation"
}