{
    "moves": {
        "1. d4": "My usual opening. ",
        "1... Nf6 2. c4 Nc6": "Clearly done to get out of the main line quickly and throw me off. ",
        "3. Nf3 e6 4. Nc3 Bb4 5. Qc2": "While I didn't know it at the time, this is all part of the main line. ",
        "5... d6": "Played with the idea of eventually pushing the pawn to e5 and challenging the center.",
        "6. Bg5": "This is the first deviation from the main line. 6. Bd2 or a3 were more popular moves to break the pin right away. I played this just to try out something a little different from what he expected.",
        "6... h6": "A logical move which immediately forces me to make a decision about my bishop. I could go back to d2, but that would be a waste of tempo. Going back to h4 did not look  appealing to me after 7. Bh4 g5 8. Bg3 g4! and the pawn on d4 is lost. So taking on f6 seemed to be the only logical option. ",
        "7. Bxf6 Qxf6 8. a3": "No need to defend the d4 pawn right away. I figured that this was better to exchange the bishop and still protect d4. ",
        "8... Bxc3+ 9. Qxc3 O-O 10. g3": "Perhaps e3 may have been slightly better. I chose to fianchetto my bishop so that my king would be a bit more protected after castling.  ",
        "10... e5": "The most logical move in the position to strike at the center and look to activate the light square bishop. ",
        "11. d5": "This is a key point in the game. I felt that taking on e5 would give black an advantage since he would have an open e file and make his development easier. So I took a stab at d5 which basically forces the knight to d4 in order to prevent me from playing e4. ",
        "11... Nd4 12. Rd1": "In retrospect Nxd4 may have been better. I didn't like it because I noticed that after the exchange the pawn on d4 would have been a tough one to get rid of. ",
        "12... Nxf3+ 13. Qxf3 Qg6": "This move came as a surprise. After 13...Qxf3 14. exf3 f5, it seems like black is doing just fine. My opponent probably believed that I would have good drawing chances so he keeps the queens on the board for now while also threatening an f5 push.",
        "14. Bg2": "After deep consideration, I figured that this was the only good move. I have to castle quickly in order to survive the attack on the king-side. ",
        "14... f5": "The most logical move which carries a lot of power. Black's idea is to push f4 and rip open a file towards the king, not something which I want to have happen. ",
        "15. Qd3": "I was quite pleased with myself for finding this defensive resource. If I play 15. O-O right away, then black can strike hard with f4, after which the opening of the f-file becomes serious. With 15. Qd3, I delay a pawn push to f4 because of the pin on the queen and buys me time to castle and lessens the power behind pawn to f4.  ",
        "15... Qf6": "Breaking the pin right away and finalizing the push for f4.  ",
        "16. O-O f4 17. Be4": "Truth be told I simply overreacted to to the possibility of Bf5, but this was nothing to worry about. Best was probably just to push b4 in order to get some counter-play on the queen-side which we will see later on. ",
        "17... Bh3": "Taking advantage of the whole that was created with Be4. ",
        "18. Bg2": "After I looked at 18. Rfe1 I saw fxg3 and did not like that fact that there was an open file towards my king at all. So I simply retreated back to fill in the hole. ",
        "18... Bd7": "A curious decision. I believe that my opponent's idea was to undermine any queen-side pawn storms that I had in mind. ",
        "19. b4": "Finally searching for a way to get some counter-play. My idea here is to simply push c5 and create some threats on the queen-side. ",
        "19... a5": "Logical move that attempts to weaken my pawn structure. ",
        "20. c5": "If I wanted to play it safe I would have played 20. b5. But I am not interested in playing it safe! I saw an opportunity to push my pawn farther to c6 and open up lines against the king. ",
        "20... axb4 21. axb4 Ra4": "Attacking the weak pawn right away. At this point I took a great deal of time into my next move as there is much to consider here. ",
        "22. Qb3": "This defends the pawn while also threatening to play c6, which cuts off the bishop from the rook. I considered playing c6 right away, but then black would get control over the a2-g8 diagonal after 22. c6 bxc6 23. dxc6 Be6. So I played Qb3 to keep control over the diagonal. The only problem is that now black can play Rfa8 which appears quite strong, but I was confident that I had things under control. ",
        "22... Rfa8 23. c6": "Now or never, I can't just let the doubled rooks wreak havoc after all. ",
        "23... bxc6 24. dxc6+": "All played out as I foresaw it. Now, the bishops must be exchanged and I have some potential threats on the queen-side, but also a weak b pawn which comes back to bite me later.  ",
        "24... Be6 25. Bd5 Bxd5 26. Qxd5+ Qf7": "Offering me an exchange, which with about 10 minutes remaining on my clock was difficult to decline. ",
        "27. Qxf7+ Kxf7 28. gxf4": "Played immediately with the idea of loosening the grip on d4 to allow my rook to post there in defense of the b4 pawn. ",
        "28... exf4 29. Rd4 g5 30. Kg2": "Trying to get closer toward the center in order to prevent the king going to e6 and attacking the d4 rook. ",
        "30... Rb8 31. Rb1 Rb6": "There is too much pressure for me to hold on. Even after my rook goes to c4 the black king can go to e6 and attack c6 as well. ",
        "32. Rc4 Ke6 33. e3": "Played with the intent of attacking the king with Rd4+ if the king goes to d5. ",
        "33... fxe3 34. fxe3 Kd5 35. Rd4+": "This sets a trap. If black plays 35...Kxc6?? 36. b5+! Rxb5 37. Rc1+! and the rook on a4 is lost. ",
        "35... Ke5": "Wisely sidestepping the threat. ",
        "36. Kf3": "At this point my clock was at about 4 minutes while my opponent still had 15. So I rushed this move a little and now my opponent can just take that c6 pawn. ",
        "36... d5": "But surprisingly he doesn't! This move was played most likely to keep my rook off of c4, but it actually gives my rooks a target. ",
        "37. Rbd1": "Attacking the weak d5 pawn, basically forcing Rb5. ",
        "37... Rb5 38. Rb1 Ra6 39. Rc1 Rab6": "But alas in the end it does not matter. Black has done a nice job of defending and now a pawn must finally fall. ",
        "40. Rcd1 Rxc6 41. Ke2": "Eh, I honestly can't tell you what I was thinking here. Best was probably h4 to try and exchange as many pawns as I can. This basically asks for black to play Rc2+ which forces an exchange of rooks. ",
        "41... Ra6": "A very interesting choice. I really can't understand what the motives are behind it. ",
        "42. h4": "Jumping on the opportunity to exchange some pawns in order to simplify the position. ",
        "42... Ra2+ 43. Kd3 Rb8 44. hxg5 hxg5 45. Rg4": "I was filled with hope now. It seemed that the worst was behind me and that maybe I can muster a draw out of this after all.",
        "45... Kf5 46. Rdg1 Ra3+ 47. Ke2 Rg8": "The only way to defend the pawn, but the moves to follow were clear now. ",
        "48. Rd4": "So now if black plays either Rd8 or Ke5 to protect d5, I can just get my rook back to g4 and the cycle would repeat. ",
        "48... c6": "So black plays the only move that defends the pawn while also not going down the path of repetition. ",
        "49. b5": "I played this immediately to force black to give his pawn back. I took a quick glance at the clock at this point and noticed that I had 49 seconds left while my opponent had just under 3 minutes. ",
        "49... Ra2+ 50. Kf3 cxb5 51. Rxd5+ Ke6 52. Rxb5": "I thought to myself that I now have an easy draw as long as I don't do anything stupid. ",
        "52... Rf8+ 53. Ke4 Ra4+ 54. Kd3 Rd8+ 55. Ke2 Ra2+ 56. Kf3 Rf8+": "All of these checks were played very quickly by my opponent with the hope that I would collapse under pressure. ",
        "57. Kg4": "This is the start of where things went wrong. Best would have been just to slide back to e4 where the checks would repeat. ",
        "57... Ra4+": "I now realized that I can't play Kxg5?? because of the skewer with Rg8+. Now my king is forced into an uncomfortable position where it will be easy to mess up.  ",
        "58. Kg3 g4 59. Rg5": "Amazingly, this is one of the few moves that loses the game. I now must lose a rook after 59...Rf3+ 60. Kh2 Rh3+ 61. Kg2 Ra2+ 62. Kf1 Rf3+ 63. Ke1 Ra1+. The biggest problem with this move is that it takes away an escape square for the king if I was to play 60. Kh4 after Rf3+. ",
        "59... Rf3+ 60. Kh4": "It's easy to judge from a spectator's point of view, but when the clock is on 15 seconds and counting, it is extremely difficult to keep your head straight. ",
        "60... Rh3#": "All I could do was laugh at myself for not seeing this mate. My gracious opponent shook my hand and said \"It happens\" and that I had played well. Afterwards, a master who was spectating the final moves of our game kindly pointed out to me that I would have lost even if I didn't put my king on h4. "
    },
    "url": "https://gameknot.com/annotation.pl/it-happens?gm=57332",
    "gameName": "\"It Happens\"",
    "players": "Ben (1725) vs. Aaron  (2162)",
    "opening": "Kevitz-Trajkovich defence (A50)"
}