{
    "moves": {
        "1. e4": "Ok this is my first attempt at a annotation so please forgive any sloppy analysis and put me right in the comments area. e4 pretty basic stuff...",
        "1... e5": "and....",
        "2. c3": "Just something different on the king pawn opening, i enjoy using different variations and i'm fairly comfortable with this one.....",
        "2... d6": "yup...",
        "3. d4": " I like this move i feel it gives me some nice early center board dominance.....",
        "3... Qf6": "ok...",
        "4. d5": "A free pawn, great!! I never used to like having my pawns this far up the board so early in a game but now i know it can be advantagous in so much as it blocks the bishops from having a free license to roam, if he wants his bishops out in the center he's gonna have to fight his way out.....",
        "4... Qh4": "From bitter experience i know coming out full on with the queen like this can backfire horribly but i know i still have to keep an eye on this one, for his sake i hope he knows what he's doing, for my sake i really hope he doesn't........",
        "5. Bd3": "I wanna start developing and head towards a castle, still on the kingside but it depends on how he follows up his queen advance...",
        "5... Bg4": "This one aint shy, straight for the big guns, no subtlety about this guy just blunder on in there....ok....",
        "6. Qa4+": "A nice check, just a stalling move at this point, i'm starting to worry about this attack.....",
        "6... c6": "just what i was hoping for i don't need to explain do i?",
        "7. Be3": "I think i'm walking into a trap it just seems to easy at the mo so i put the brakes on and use a bit of caution..I didn't want to threaten with a pawn to many times i've found myself beaten badly by stupid pawn moves...",
        "7... b5": "This doesn't make me feel down hearted in fact i like this maybe i can sneak in the backdoor....",
        "8. Qa5": "Which i attempt to do.....",
        "8... a6 9. dxc6": "I wanted to break up the pawn advance on my queen so c6 seemed the thing to do........",
        "9... Nxc6": "Maybe it wasn't.....",
        "10. Qb6": "I like this move that backdoor is about to be smashed into a thousand pieces...I wonder why he's just left his queen in my territory like that, whats he waiting for?",
        "10... Nd8": "Stops the threat on his rook, not bad..",
        "11. a4 Be7": "This worries me a little, it's both defencive and potential back up for the queen, i better not get to caught up in what i'm doing and keep one eye on that bishop...",
        "12. axb5": "I need the space i need bd3 in the fray and quick...",
        "12... a5": "Annoying....",
        "13. Qc7": "I sometimes feel this sort of move can backfire but it keeps the opponent on his toes and less mobile.....",
        "13... Nf6": "I figure he wants to castle and now.....",
        "14. b6": "Thats gotta send a shiver up his spine, i'm closing in fast and i feel i'm dominating quite nicely.....",
        "14... Rc8": "His first mistake, time for my bishop to swing into action, i'm growing in confidence, position and dominance......",
        "15. Bb5+": "Now your in trouble, i hope....i want that rook but it's covered right now, i'll keep it in mind though.....",
        "15... Bd7": "Another bad move, maybe kf8 would be better here.....He just signed his rooks death warrant....",
        "16. Bxd7+": "Otherwise i lose a bishop for nothing, and i'm not about to start  giving up pieces unless i have no other option, i'm feeling real strong though i've got the momentum and i can't see him surviving this one...",
        "16... Nxd7 17. Qxc8": "I had no choice....at this point my opponent has asked that i point out the fact that his rook and bishop were both poisoned, however i catagorically deny such underhand accusations and put it down to superior chess prowess on my part...",
        "17... Nxb6": "huh?",
        "18. Bxb6": "Another freebee, i'm sure my opponent is falling apart at this point and i'm loving it.....",
        "18... Qxe4+": "That's not allowed...",
        "19. Ne2": "all i could do, but i see a g2 attack coming my way....",
        "19... Qxg2": "As expected, but i'm hoping i can still use momemtum as my main weapon at the mo...",
        "20. Rg1": "bye bye h2, ok maybe it's a last stand from my opponent and you gotta admire him for that but surely i have this one, don't i?",
        "20... Qxh2": "I'm phsychic....",
        "21. Nd2": "Not sure why i did this move i just felt i needed some extra weaponry in the mix also i made need to castle outta here and fast...",
        "21... O-O": "yeah, thats halted that momentum i was so into a couple of moves back....",
        "22. Qg4": "A threat i knew my opponent would see and deal with but i'de rather his attention be on my attack and not his....",
        "22... Ne6": "ok.....",
        "23. Nf3": "I want that queen gone and i want it gone now!! Plus i provide some much needed cover for the g1 castle sometimes 1 defender isn't enough, in this case it probably was but as i said, i wanted that queen gone....",
        "23... Qh6": "Bye, Bye.....",
        "24. Be3": "Continuation of threats to queen, i can think of nothing that constructive so it felt like the right thing to do..",
        "24... Nf4": "Now i don't mind trading off pieces i'm already 2 up so as far as i'm concerned \"bring it on\"...",
        "25. Nxf4": "I didn't want to trade my bishop though, i consider bishops to be more adventageous because of their long range capabilities so i read my knight his last rights and send him in......",
        "25... exf4": "I'm not gonna take that pawn just yet, i want my bishop better placed if the exchange is offered on e6 , so....",
        "26. Bd4": "If black does now play qe6  i feel im in a far better position for the sacrifice qxe6, f7xe6,bxg7 maybe or rxg7  but this may not occur..",
        "26... f6": "So, he didn't offer the exchange, i guess i wouldn't if i were in his position.....",
        "27. Qf5": "I did have options like maybe rxa5 which leads to qe6  then if he defends with rf7 then i play ra8  leading to mate but i wanted to keep the pathway open for my queen so i had to play this blocking manouver, if he plays g6 then i can always check my way out and i still have the rxa5 move if play permits....I'm still confident about the eventual win right now though.....",
        "27... g6": "Again, as predicted, check it is....",
        "28. Qe6+": "i think this was my best move for the plan i have, not sure if i would back onto a dark square if i were black because of the Bd4 diagonal, my next move is deffo Rxa5, i'm primed and ready for this plan of action, i'm kitted up, weapons at the ready, here we go!!",
        "28... Rf7": "Falling into place just fine.....",
        "29. Rxa5": "You can see what's coming, right?",
        "29... Kg7": "He pre-empted my next move but i'm mobile enough and well armed enough to direct a devastating assault which can only end in my favour, i hope...",
        "30. Ng5": "he has to sacrifice his queen to stay alive, a truly moral sapping blow!!",
        "30... Rf8": "Trying to dodge a bullet, but there's a heavy thump!, thump! in the air, Bishop's been K.Oed!",
        "31. Qxe7+": "If it were me i'de be wondering where it went wrong, but a great game, very enjoyable...",
        "31... Kg8": "About all he could do and i'm nursing a semi!",
        "32. Ne6": "Here comes the death squad!!",
        "32... Rc8": "A valiant attempt to prolong the agony..",
        "33. Ra7": "Bit of back up...",
        "33... f3": "Ahhh going for the Qc1 mate, he even has the curtesy to tell me about it, thanks Kirk......",
        "34. Qf7+": "The finishing blows....",
        "34... Kh8 35. Bxf6+": "Poetry!..",
        "35... Qg7": "At least he let me shout \"MATE\" good game.",
        "36. Bxg7#": ""
    },
    "url": "https://gameknot.com/annotation.pl/its-a-blood-bath?gm=15551",
    "gameName": "It's a blood bath!!",
    "players": "daveyr18 (1402) vs. kirklandlake (1402)",
    "opening": "KP (C20), Lopez opening"
}