{
    "moves": {
        "1. e4": "Another battle with Remoh. This time, it's rated, hence the title. Really, only my rating was on the line since he only stands to lose half a rating point with a loss, and I stand to lose 20.",
        "1... e5 2. Nf3 d6 3. d4": "Old Phil is back. I play the main line.",
        "3... exd4 4. Qxd4": "Black goes with the Exchange Variation. I recapture with the queen, something I've recently become fond of doing in the Philidor. Gets right to the point.",
        "4... Nc6 5. Bb5": "Predicable attack on the bold white queen, answered by the predictable pin.",
        "5... Bd7 6. Bxc6": "No choice but to exchange. Well, I could retreat the queen a bit, and if black chases her with the knight, or moves to threaten the fork on c2, white can always play Bxd7+ before dealing with the black knight. But, I brought out the queen because I wanted her in the center.",
        "6... Bxc6 7. Nc3 Nf6 8. Bg5": "If one pin is good, two might be better.",
        "8... Be7 9. O-O-O O-O 10. Rhe1": "Just getting everything developed.",
        "10... d5 11. exd5": "10. d5? was a minor mistake, and it will cost black a pawn. To many threats and counter threats for black to safely retake on d5. I considered 11. ... Nxd5 12. Bxe7 Nxe7 as a way for black to hold even, until I realized the only thing stopping 13. Rxe7? is the black queen, so 13. Qxd8! R(any)xd8 14. Bxe7 wins a piece for white, and maybe more with that menacing rook on the 7th.",
        "11... Bxd5 12. Nxd5": "Black blunders with 11. ... Bxd5?, thinking he can safely recapture. Time to prove him wrong.",
        "12... Nxd5 13. Bxe7": "White is a piece ahead and threatening to win the knight on d5. Moving the queen loses the exchange to Bxf8. The only move that saves the black queen and rook is 13. ... Nxe7 which as demonstrated before, still loses a piece for black.",
        "13... Qd7 14. Bxf8": "13. ... Qxd7?? gets a double ? because it allows white to win a rook. Black's choices now are very limited since white threatens 15. Qxg7#. ",
        "14... Rxf8 15. Qxd5 Qxd5 16. Rxd5": "White is up a rook and a knight. ",
        "16... c6 17. Rd7": "Rook on the 7th!",
        "17... f6 18. Ree7": "If one is good, two is better.",
        "18... b5 19. Rexg7+": "Black missed the threat, so white announces mate in 3 and enters the conditional moves. This checkmate is a recurring theme in chess, and any player who likes to castle, or who likes to attack his oponent's castle, should be aware of it.",
        "19... Kh8 20. Rgxh7+ Kg8 21. Rdg7#": "Final position. Not our best game by far, following our previous game that went down to a close endgame finish. but it was a quick one and hopefully at least the final three moves are instructional for the thematic checkmate."
    },
    "url": "https://gameknot.com/annotation.pl/its-on-the-line-now?gm=22503",
    "gameName": "It's on the line now",
    "players": "blake84120 (1728) vs. remohgramps (1137)",
    "opening": "Philidor (C41), Boden variation"
}