{
    "moves": {
        "1. e4 e5 2. Nf3 Nc6 3. Bb5 a6 4. Ba4 Nf6 5. O-O": "So far, very common moves from both sides.",
        "5... Nxe4": "Gameknot database calls this 'open (Tarrash) defense'.",
        "6. d4": "Most common reply, it seems\r\n",
        "6... exd4": "gives a pawn-advantage, but...",
        "7. Re1": "...now the knight is pinned",
        "7... d5": "of course, it needs to be protected. but this actually pins the other knight too ;-).",
        "8. Bg5": "!?... most common here seems to be Nxd4. This position was new to me though, so I consulted the gameknot DB and that move seemed to have a high success rate (yes, this was my main motivation to play this move, you can blame me on that :-P )",
        "8... f6": "The most played move, but gameknot analyzer considers this as 'inaccuracy' and suggests Qd6 instead.",
        "9. Nxd4": "putting pressure on his knight on c6. \r\nAfter a possible 9. ...fxg5, 10. Nxc6 would give me the knight and threaten the queen (10. ... bxc6? 11. Bxc6+ would let me take the rook and I would still be treatening f3)\r\n",
        "9... Bc5": "'semi-pins' my knight.",
        "10. Nxc6": "Still, I decided to keep on playing offensive... (chess should be fun, right? ;-) )",
        "10... Bxf2+": "That's why I said 'semi-pinned'. At this position I started to realize that I have underestimated the difficulty of this position. Both sides have possible attacks, but one single wrong move on each side might lead to a losing position.",
        "11. Kf1": "Not sure if Kh1 would have been the better choice",
        "11... Qd7": "I expected this move somehow. now my knight is pinned too, if I move it away, black can simply play Qxa4. This position made me think a very long time, I probably have spent 1 hour trying out a lot of different possible next moves...",
        "12. Nc3": "After thinking for this long, I finally decided to make this move. Since black's knight is still pinned, he can't just take my knight. Also, it treatened to win black's queen by doing Ne5 next move (since the Bishop on a4 was protected now). Because of that, black couldn't play fxg5 or Bxe1 in next move, as this would have let me capture the queen.",
        "12... b5": "?? Now, this move surprised me, I was simply expecting bxc6. It really seems to be a blunder, as the gameknot analyzer changes the rating from +0.55 to +5.69 for white. Amusingly, I wasn't aware of that at this point, I still thought the position is quite equal.",
        "13. Nxe4": "Now have a closer look at this position, I just find it too nice ;-). It seems that 4 of my pieces (both knights and both bishops) are 'en prise'. Furthermore, my rook still could be taken with black's Bishop, so black actually had 5 possible captures at this point ;-). Of course, at the current position I had captured 2 knights while black only had 2 pawns.\r\n\r\n",
        "13... O-O": "?!. And still, none of pieces were captured. I understand that black wanted to bring in more pieces and that he wanted to bring his king in safety. Of course I was threatening something like Nxf6+ for winning the queen, but I was actually expecting either Qxc6, dxe4 or probably Bxe1. \r\nAt this position I started to realize I really seem to have an advantage... but still I didn't see a clear path to a fast win... I just felt this position has a lot of potential, and I started to think very long about my next move again...",
        "14. Ne7+": "?!... After the long thought, I just couldn't resist this one. After 14. ... Qxe7, follows 15. Nxf6+ which would win the queen (... Qxf6, 16. Bxf6, or ...Kh8, 16. Rxe7).\r\n\r\n",
        "14... Kh8": "that avoids the queen being captured, still leaving 4 (or 5) of my pices 'en prise', but...",
        "15. Nxf2": "now I could simply capture the bishop, so instead of 5 pieces being attacked, there now only were the 2 bishops left (as the knight on e7 was protected by the rook now). So at this point my advantage was for sure now ;-). +4 in material after the capture of a bishop.",
        "15... fxg5 16. Bb3 Bb7": "was expecting c6 here, saving the pawn",
        "17. Bxd5 c6 18. Bf3 Rad8 19. Qxd7": "I simply accepted the exchange because I was +5 in material... each exchanged pieces makes the win easier in such a position, I think",
        "19... Rxd7 20. Bxc6": "gameknot analyzer doesn't like this move and suggests Rad1 instead. But didn't change much anyway.",
        "20... Rxe7 21. Rxe7 Bxc6 22. Rae1 h5 23. Re1e5": "And black resigned"
    },
    "url": "https://gameknot.com/annotation.pl/82nd-gk-tournament?gm=43808",
    "gameName": "82nd GK tournament",
    "players": "notfromearth (1894) vs. drengur1 (1716)",
    "opening": "Ruy Lopez (C80), open, Riga variation"
}