{
    "moves": {
        "1. d4": "QD4 as usual, I've got a real heavy workload at the moment so my game is suffering.",
        "1... d5 2. Bf4 Bf5 3. Nd2 e6 4. Ngf3 f6": "Black has created a weakness on the kingside, c4 is in order at some point",
        "5. e3 a6": "Again another pawn movec4 is far too tempting now",
        "6. c4 Bg4": "I just move the queen out of the way",
        "7. Qa4+ Nd7 8. Bd3": "I want control of the diadonal and will later put the q on c2",
        "8... Ne7 9. h3": "Chasing the bishop and providing an escape square",
        "9... Bh5 10. O-O": "Safety first",
        "10... Ng6 11. Bh2 c6": "A Poor move, white can win material",
        "12. g4 Bxg4 13. hxg4 Ne7 14. Qc2 h5": "I have no idea of black's plan with this, PxP RxP B-g6+ NxB QxN+ K-e7 QxR is only good for white",
        "15. gxh5 f5 16. c5 Rxh5 17. Bf4 Ng6 18. Bg3 Be7 19. Kg2 Bh4 20. Rfh1": "Black has some threats but white has everything under control",
        "20... Rh6 21. Rh3": "White intends to double the rooks and simplify as much as possible",
        "21... Bxg3 22. Rxh6 gxh6 23. fxg3 Qf6 24. Rh1 Qg7 25. Qb3 Rb8 26. Qc2 Nf6 27. a4 Ng4": "Black is threatening a fork",
        "28. Nf1 f4": "Silly move",
        "29. Bxg6+ Ke7 30. gxf4": "Although this opens up the g file I didn't want the queen on d4",
        "30... Rf8 31. Ne5": "Again simplifying the position",
        "31... Nxe5 32. dxe5 Rf5": "RxP is probably best here",
        "33. Kf3 Qxg6 34. Qg2 Qh7 35. Rg1 Rf7 36. Qg6 Qxg6": "I think this signs black's doom",
        "37. Rxg6 Rh7 38. Nd2": "White is going to use the knight via b3 then a5 or d4 to destroy white's pawns, it is a matter of time now. White will block the advancing pawn with the king",
        "38... h5 39. Nb3 h4 40. Kg2 Kf7 41. Rf6+ Ke7 42. Nd4 Rg7+ 43. Kh3 Rg3+ 44. Kxh4 Rxe3 45. Rxe6+ Kf7": "Time to simplify, the extra piece and the two passed pawns makes black's job impossible",
        "46. Re7+": "Black takes the exchange",
        "46... Kxe7 47. Nf5+ Ke6 48. Nxe3 d4 49. Nd1": "This seems an unatural move but it stops the pawn, black cannot push the king forward because of the passed pawns",
        "49... Kf5 50. Kg3 a5 51. Kf3": "Black resigns"
    },
    "url": "https://gameknot.com/annotation.pl/83rd-gk-tournament?gm=39692",
    "gameName": "83rd GK tournament",
    "players": "dwardman (1688) vs. trezeguet31 (1345)",
    "opening": "Queen's pawn, Mason variation (D00)"
}