{
    "moves": {
        "1. e4": "I was at a 975 rating when I beat this player.  My first few moves were from the game database, because I knew if I wanted to beat someone rated much higher than me, I needed as many resources as I could possibly get.  I typically start my moves when I'm white with my pawn moving up two spaces.",
        "1... Nf6": "Instead of my typical defense of the pawns, I decided to start out aggressive.",
        "2. e5 Nd5 3. c4": "While I'm being aggressive towards his knight, I'm looking at the game database as well as making sure there's nothing else he can do with his pawns or other knight.",
        "3... Nf4 4. d4": "I moved this piece out to start my defensive scheme I usually have.",
        "4... Ne6 5. d5 Nc5 6. b4 Nca6 7. b5 Nc5 8. Ba3": "I wanted to move my bishop to attack the knight on e3.  I had a mental lapse.  In the end, it still got the job done though.",
        "8... b6": "???",
        "9. Nf3": "I'm taking a HUGE risk with my knight because I have no idea if this will work.",
        "9... e6 10. Bc1": "I don't know why I did this.  It was a wasted move in my opinion.",
        "10... d6": "I felt like he would attack my pawn, so my knight/queen checkmate might actually work after all.",
        "11. Ng5 Be7": "He blocks my move as I thought he might, but I decide that I might be able to take a pawn or two out at this point.",
        "12. f4": "This way I can block the bishop attacking my knight...or at least take out his bishop in the process.",
        "12... dxe5 13. Qh5": "I knew I would be able to take a pawn out the next move...what I wasn't expecting...",
        "13... O-O": "Was for him to castle himself in to check mate.",
        "14. Qxh7#": "I think this was a mental lapse.  His score doesn't show making an amatuer mistake like I would do.  I think I won this game because I started it out aggressive.  I usually play very defensively, and lately my wins have been showing because of the offensive moves."
    },
    "url": "https://gameknot.com/annotation.pl/86th-gk-tournament?gm=42627",
    "gameName": "86th GK tournament",
    "players": "number1thespian (1009) vs. lixil (1177)",
    "opening": "Alekhine's defence (B02)"
}