{
    "moves": {
        "1. e4 c5 2. Nc3": "Closed Sicilian, I don't play it very frequent but find it a solid choice",
        "2... Nc6 3. Nf3 d6 4. Bb5 e5 5. O-O Nf6": "transposed to a 4 knights",
        "6. d3 Be7 7. Nd5 O-O 8. c3": "unambitious maybe better was Nxe7 ",
        "8... a6 9. Bc4": "again avoiding exchanges why?",
        "9... Na5 10. Nxf6+": "exchanging with tempo, the idea is to play Bd5 next avoiding the disturbance of my pawn structure",
        "10... Bxf6 11. Bd5 Nc6 12. Be3 Be6 13. Bxe6": "and now is black that will have his pawn structure disturbed - Although necessarily not a bad thing as we will see in the end of the game as he does has a central majority, that he will be able to exploit latter on",
        "13... fxe6 14. h3": "the idea is to get my knight to h2 then g4, but what was achieved by this? maybe here Qd2",
        "14... Qe7 15. a3": "again with nothing to do push the a and h pawns... no plan what so ever",
        "15... a5 16. Rc1": "to prepare the central pawn break ",
        "16... b6 17. d4": "and trying to do a central pawn break...",
        "17... exd4 18. cxd4 Rad8 19. Qb3": "? allowing black to keep an extra pawn",
        "19... Nxd4 20. Bxd4 cxd4 21. Rc6": "leaving black with one pawn up and central pawn majority I never knew what was coming... ",
        "21... Qf7 22. Re1": "trying to defend my last hope the e4 pawn",
        "22... h6": "some escape square for his king",
        "23. Rxb6 e5": "and now I started to think I can draw this game...",
        "24. Qb5 Rd7 25. Rc1": "to passive why not Qxa5 to get some counter-play",
        "25... d5": "black is closing in",
        "26. Rb8 Rdd8 27. Rb7 Qg6 28. exd5": "and a final mistake... the following moves are just played in disbelieve... how could this just had gone so wrong...",
        "28... e4 29. Nd2 e3 30. fxe3 Bg5 31. Nf1 dxe3 32. Rcc7 Bf6 33. d6 Bd4 34. Kh1": "a last try",
        "34... Kh8": ""
    },
    "url": "https://gameknot.com/annotation.pl/87th-gk-tournament?gm=44103",
    "gameName": "87th GK tournament",
    "players": "kaspanatola (2084) vs. gagarin (2218)",
    "opening": "Sicilian (B23), closed, 2...Nc6"
}