{
    "moves": {
        "1. e4 e5 2. Nf3 Nc6 3. d4 exd4 4. Nxd4 Nf6 5. Nc3 Bb4 6. Nxc6 bxc6 7. Bd3 O-O 8. O-O Bxc3 9. bxc3 d6 10. h3 Qe7 11. Qf3 Nd7 12. Bf4 Ne5 13. Qg3 Ng6 14. Be3 c5": "Preventing Bd4.\r\nBlack's play is horrible, leaving the initiative to white",
        "15. f4": "Here comes trouble",
        "15... Qh4": "Making room for manoeuvering.",
        "16. Qf3 Bb7 17. Qe2 Qf6": "Using the Queen to block f4-f5-f6.\r\nThe biggest threat to black is an advanceof the f-pawn to f6.",
        "18. Rab1 Rab8 19. Bd2 Bc6 20. Qg4 Ne7": "Still passive play, but blacks options are limited",
        "21. f5 h6": "Preventing Bg5",
        "22. h4 Kh8 23. h5": "This accomplishes nothing",
        "23... Bd7 24. Qg3 Nc6": "Onto e5, black gains a foothold on e5 now",
        "25. Bc4 Ne5 26. Be2 Ba4": "Suddenly black has couterplay",
        "27. Rxb8 Rxb8": "Now black has gained an open b-line",
        "28. Rc1 Rb2 29. Bd1 Rxa2": "I considered Bb5, to control c4, but freeing the a-pawn has a higher priority.",
        "30. Be1 Qg5": "Using the exposes rook, to force the exchnage of Queens.\r\nBlack realizes he has a superior endgame.\r\nBlack is in control of e5 and c4, and his Knight is stronger then whites Bissshop pair, which is obstructed by the  pwan structure. The free a pawn should win the game for black",
        "31. Qxg5 hxg5 32. Bd2 f6": "Whites Bisshops are immobilzed by the pawn structure, but black Bisshop and Knight are still very active",
        "33. g4 Bb5": "Controling c4",
        "34. Rb1 c6 35. Kf2 Ra4 36. Be2 a6 37. Bxb5": "Unexpected, and probably not a good idea",
        "37... cxb5 38. Kg3 Rxe4": "White surrendered.\r\n\r\nAfter Ra1, Ra4, RxR, bxa4 black has a wining position.\r\nThe Bisshop canot stop the free a pawn without sacrificing more material."
    },
    "url": "https://gameknot.com/annotation.pl/89th-gk-tournament?gm=43104",
    "gameName": "89th GK tournament",
    "players": "romrychkov (1620) vs. eduard352 (1738)",
    "opening": "Scotch (C45), Schmidt variation"
}