{
    "moves": {
        "1. e4": "Jouw tegenstander heeft wit en begint door zijn pion naar e4 te zetten. Op grootmeester niveau zijn e2-e4 en d2-d4 ongeveer even populair. Bij amateurs is de gespeelde zet echter veel populairder. Laten we dus kijken naar de motivatie achter de zet: wat maakt e2-e4 zo sterk?\nTen eerste opent het diagonalen voor de konings-loper en dame, zodat zij zich kunnen bewegen. Het is vooral van belang dat de loper zich verplaatst, omdat het noodzakelijk is voor de rochade. Rocheren is erg belangrijk en dit zal meestal jouw doel moeten zijn in de opening.\nHierbij komt dat na e2-e4 wit een pion in het centrum (de velden e4/e5/d4/d5 vormen samen het centrum van het schaakbord) heeft staan, die de veld d5 aanvalt. Centrum-controle krijgen is een ander doel in de schaakopening, hoewel het minder belangrijk is als koningsveiligheid of stuk-activiteit.",
        "1... e5": "Ik zal jou hier een lange uitleg besparen. e7-e5 Is hier de meest populaire zet samen met c7-c5. ",
        "2. Nf3": "Wit ontwikkeld een paard. De paard staat hier veel beter dan op g1 of a3. Wit is nu ook een stapje dichterbij een korte rochade en vergroot zijn controle over het centrum. De paard valt nu ook de zwarte pion op e5 aan. \nIn deze positie is Pg1-f3 verreweg de populairste zet, maar er zijn redelijke alternatieven (bijvoorbeeld Lf1-c4 of Pb1-c3).",
        "2... Nc6": "Zwart ontwikkelt een paard en verdedigt zijn pion op e5. Als wit op de volgende zet met de paard op e5 neemt, zal zwart de paard op e5 kunnen terugnemen. Een dergelijke afruil is ongunstig voor wit, omdat een paard meer waard is dan een pion.",
        "3. Nc3": "Wit ontwikkelt een tweede paard. c3 Is zonder twijfel de beste veld voor deze paard, want het geeft wit extra invloed in het centrum en verdedigt de pion op e4. Belangrijke alternatieven zijn Lf1-c4 of Lc1-b5.",
        "3... Nf6": "Met deze zet is zwart een stapje dichterbij korte rochade. De opening waarin we nu in zijn beland wordt het vierpaardenspel genoemd voor duidelijke redenen. Het was erg populair in de 19de eeuw en in het begin van de 20ste eeuw. ",
        "4. Bc4": "Wit speel Lf1-c4 en kan nu op de volgende zet rocheren. De loper is nu ook gericht op het veld f7. Velden f7 en f2 zijn beiden kwetsbaar, omdat zij enkel verdedigt worden door de belangrijke koning. ",
        "4... Bb4": "Na deze zet is zwart ook klaar voor rochade.",
        "5. Nd5": "!?  (Deze symbool wordt gebruikt om een interessante zet aan te geven in analyses)\nEen ongebruikelijke, maar erg interessante zet. In deze posite wordt normaal gerocheerd of d2-d3 gespeeld. Met Pc3-d5 maakt zwart zijn paard nog actiever en hij geeft zichzelf de optie om op b4 of f6 te nemen. Omdat de paard de pion op e4 niet meer dekt, kan de zwarte paard op f6 de pion op e4 nemen. De pion wordt echter op een indirecte manier verdedigd. Als zwart de pion op e4 neemt, speelt wit zijn dame naar e2. Vanuit e2 valt de dame de zwarte paard op e4 aan en als deze paard teruggaat kan wit nemen op e5. Na deze zetten zou materiaal gelijk zijn, maar wit heeft actievere stukken en dus een lichte voordeel.",
        "5... O-O": "Wit blijft van de pion af en besluit te rokeren. Een prima beslissing. Wit heeft na deze zet wel de optie om de loper op b4 te nemen met zijn paard (Pd5xb4). Nadat zwart terugneemt met zijn paard (Pc5xb4) kan wit de pion op e5 pakken. Deze variatie zal echter niet leiden tot een voordeel voor wit, omdat zwart hierna zijn toren op de e-lijn kan zetten (Tf8-e8). Wanneer de Paard weggaat (Pe4-f3) kan zwart de pion op e4 nemen en materiaal is weer gelijk. ",
        "6. a3": "Na deze zet valt de pion op a3 de loper op b4 aan. Aangezien het verlies van een loper erg zwaar is, zal de zwarte loper zich moeten terugtrekken naar bijvoorbeeld c5. ",
        "6... Nxe4": "? (deze symbool wordt gebruikt om een fout aan te geven bij analyses)\nZwart laat de loper echter staan en grijpt de onverdedigde pion op e4. Dit is de eerste grote fout in de partij, omdat een loper meer waard is dan een pion. Lb5-c4 Zou sterker zijn geweest. Hierna heeft wit een flinke voordeel.",
        "7. axb4 Nxf2": "?!\nZwart besluit zijn Paard af te ruilen voor de pion op f2. Hoewel de witte koning hierdoor kwetsbaarder wordt, is deze zet toch een fout. Om een koning aan te vallen en mat te zetten heb je meerdere stukken nodig. De dame alleen kan een koning niet matzetten en heeft ondersteuning nodig. Omdat je hierna twee stukken minder hebt als de tegenstander wordt het onmogelijk om een winnende aanval op te zetten tegen de witte koning. ",
        "8. Kxf2 e4": "! (deze symbool wordt gebruikt om aan te geven dat een zet mooi/goed/sterk is)\nNa e5-e4 valt de zwarte pion de paard aan en jaagt dus een verdediger van de koning weg. Omdat zwart zoveel materiaal achter staat, moet hij wel voor een aanval gaan. ",
        "9. Ne1 Qh4+": "De zwarte dame valt de koning aan. Dit wordt schaak genoemt en wit is nu gedwongen om de schaak/aanval op te heffen. Het zal rond dit punt zijn dat jij dacht goede kansen te hebben. De waarheid is echter dat jij hier verloren staat. De dame kan de koning aanvallen (schaak zetten), maar hij kan niet de koning schaakmat zetten. Hij heeft te weinig ondersteuning van zijn stukken en wit kan al vrij snel zijn koning in veiligheid brengen.\nSchaakmat (of simpel mat) is het einddoel van een partij schaken. Als de witte koning wordt matgezet is de partij over en heeft zwart gewonnen. Om de koning schaakmat te zetten moet jij hem aanvallen (schaak zetten) zonder dat de tegenstander het schaak op enig manier kan opheffen (weglopen met de koning, de aanvallende stuk nemen, iets tussen aanvaller en koning zetten). In dit geval is er geen sprake van schaakmat, omdat wit uit de aanval kan komen.",
        "10. Kg1 Nd4": "Jij haalt hier terecht er een extra stuk bij, maar de schade is al gedaan. De paard kan niet op tijd meedoen aan de jacht op de koning.",
        "11. g3": "?! (deze symbool wordt gebruikt om een dubieuze/lichte fout aan te geven)\nNiet echt een mooie zet in mijn mening. De witte koning wordt hierdoor nog meer open en wit moet vanaf nu een beetje oppasssen. Na deze zet valt de pion op g3 wel de zwarte dame aan en de dame zal dus een nieuwe veld op moeten zoeken.",
        "11... Nf5": "?\nZwart zet zijn dame niet weg wat een fout genoemd kan worden. Hierna kan wit de dame op h4 nemen met zijn pion op g3. ",
        "12. Nxc7": "?\nWit grijpt welliswaar een pion, maar hij had veel beter de dame op h4 kunnen nemen.",
        "12... Nxg3": "Objectief gezien is dit een fout, omdat wit de paard kan nemen zonder schaakmat te gaan. Zwart had echter al een moeilijke positie (veel minder materiaal) en dus is aanval zijn enige hoop. ",
        "13. Nxa8": "?\nWit kiest ervoor de toren op a8 te nemen. Hij kon ook de paard op g3 nemen (h2xg3) en dit zou veel beter zijn geweest. De positie wordt nu gecompliceerd en er zijn nu weer mogelijkheden voor zwart. ",
        "13... Nxh1": "?!\nHelaas een foutje, maar ik kan het jou niet kwalijk nemen. Een toren is normaal meer waard dan een paard en dus zou de afruil gunstig moeten zijn voor jou. In dit geval echter is de zwarte paard veel meer waard dan de witte toren, want zwart heeft hem nodig voor de aanval. De pad naar winst is echter moeilijk te zien. \nIk denk dat na d5 (in plaats van Pg3xh1) zwart goede kansen zou hebben gehad op een overwinning. Hier een voorbeeld variatie:\n- Zwart speelt d7-d5. Het opent de weg voor de loper om mee te doen aan de aanval en het valt de loper aan op c4.\n- Witte loper neemt d5 (Lc4xd5)\n- Zwarte loper gaat naar g4 en valt de witte dame op d1 aan. (Lc8-g4)\n- Wit neemt de paard op g3 (h2xg3)\n- Zwarte dame neemt terug op g3 en valt de koning aan. (Dh4xg3+)\n- Witte paard gaat naar g2 om de aanval op de koning te stoppen (Pe1-g2)\n- Zwarte loper neemt de witte dame (Lg4xd1). Hierna staat zwart veel beter.",
        "14. Kxh1 Qf2": "?\nOok hier is d7-d5 sterker. De zwarte dame heeft ondersteuning nodig om de witte koning mat te kunnen zetten. Hoewel Dh4-f2 er sterk uitziet is dit waarschijnlijk een behoorlijke fout. Hierna heeft zwart geen goede aanvalskansen meer.",
        "15. Ng2": "De witte paard biedt verdediging aan de koning en nu kan wit zijn dame activeren. Omdat wit meer materiaal heeft, is het gunstig voor hem om de dames af te ruilen. Zwart heeft immers zijn dame nodig voor de aanval op de witte koning.",
        "15... b6 16. Rxa7 d6 17. Qg1 Qxg1+": "?!\nMet de dames van het bord heeft zwart geen kans meer, maar na iets als Df2-f6 zou zwart waarschijnlijk ook weinig kans hebben. Ik zal voor de rest van de partij geen commentaar meer geven, want de partij is hierna min of meer over. \n\nEen samenvatting:\nBeide spelers begonnen de partij goed en de eerste fout werd gemaakt toen zwart besloot om twee stukken weg te geven voor twee pionnen. Hierna had zwart wel aanvalskansen tegen de witte koning, maar niet voldoende als wit correct zou spelen. Door een paar fouten van wit, krijgt zwart echter mogelijkheden. Vooral d7-d5 leek een sterke optie in deze fase. Nadat zwart deze kans mist, zorgt wit voor de afruil van de dames waarna zijn koning niet meer in gevaar is. De extra 3 stukken die hij heeft, wint hierna de partij. \n\nTips:\n- Let op materiaal. Als je een stuk laat nemen, wees zeker dat je er genoeg voor terug krijgt.\n- Voor een geslaagde koningsaanval heb je meerdere stukken nodig die samenwerken om de koning te bedreigen.",
        "18. Kxg1 Bg4 19. Nxb6 Be2 20. Bxe2 f5 21. Nf4 h6 22. Bc4+ Kh7 23. Ne6 Kg6 24. Nxf8+ Kg5 25. Rxg7+ Kf4 26. d3+ Kf3 27. Ne6 Ke2 28. d4+ Kf3 29. Rg3#": ""
    },
    "url": "https://gameknot.com/annotation.pl/1-de-gedoemde-aanval?gm=39997",
    "gameName": "1. De gedoemde aanval",
    "players": "francescor68 (1205) vs. sophia33 (1023)",
    "opening": "Four knights (C46), Italian variation"
}