{
    "moves": {
        "1. e4": "In this game we both make some errors in the opening, but the real lesson is to be learned in the quickness with which Black's attack on the kingside develops.",
        "1... e5 2. Bc4": "The Bishops Opening is coming back in popularity, in fact, a recent book by GM John Emms features this system tied in with a quick f4 push.",
        "2... Nf6": "Probably the most sound response, hitting the e4 pawn and intending to clear the kingside for quick castling.",
        "3. Nf3 Nxe4": "I played this move without really thinking, and since I dont have any books with this opening, I was really on my own here.  Now I see in the database that there are 1360 games with this move.  I didnt calculate any variations by White!",
        "4. Nc3": "White definitely has a lead in development here!  I was starting to remember why I don't play 1...e5.",
        "4... Nf6 5. d3": "5. Nxe5 and White is better.  This has to be a mistake as Black gets center control and catches up in development.  White will have no compensation for the pawn.  In fact, White never really recovers after this move.",
        "5... d5": "The counter-attack begins.",
        "6. Bb3 Nc6": "Developing normally, with a central space advantage.  White's compensation is already drying up.",
        "7. O-O Be7": "The most sensible square for the bishop, preventing any pins and keeping the center stabilized.  Also, preparing to castle.",
        "8. Bg5 d4": "8...Be6 is also possible, but it was here I began to plan on meeting a capture on f6 with gxf6, opening the g-file for a kingside attack.  This move provokes the capture.",
        "9. Bxf6 gxf6 10. Ne4 Rg8": "The plan is coming together.  The g8 rook, the light-squared bishop and the h-pawn are going to be major players in the attack.",
        "11. Re1": "Not sure what this accomplishes.  White's plans to attack the center with c3, followed by Rc1 and cd would place pressure on the Black king and not let me get away with the wholesale attack that occurs in the game",
        "11... Bg4 12. Ng3": "Wanting to play h3, but again, White might be advised to attempt to open the center or to swap the light-squared bishop with 12. Ba4.  White is left with no counterplay, just responding to my attack.  Black has the material and the initiative.",
        "12... h5 13. h3 h4": "This move keeps the attack fluid.  I had to have seen this continuation before playing 12...h5, as any bishop retreat leaves the h-pawn en prise and helps White put a knight on f5.  If 13...Bxf3 14. Qxf3, the White king will be secure enough.  In the meanwhile White will be able to drum up counter play in the center.",
        "14. hxg4 hxg3 15. fxg3 Qd7": "The kings position shattered, I prepare to castle queenside and bring my queen's rook and queen into the attack.",
        "16. g5": "A nice move by my opponent.",
        "16... Rg7": "16...fg?! closes the g-file and is counter positional.  Material isnt a consideration here, open lines for the attack takes priority.  Here I want to protect the f-pawn so I can castle.",
        "17. gxf6": "He might have been better to leave the pawn to try and get me to close the g-file on the next move.  17. Rf1 with the idea of Nh4 and Nf5 seems like a better try.",
        "17... Bxf6 18. Re4": "White activates his rook on a central square, but it seems that Nd2 followed by Ne4 might have offered better prospects for the defense.",
        "18... O-O-O": "My king is now safe and my other rook is ready to join the attack.",
        "19. Qf1": "It's really tough to find a good move here for White.",
        "19... Rxg3": "Clearing some wood from the g-file.",
        "20. Nxd4": "This is the deadly mistake which allows the attack to break through.  It appears that White wins a pawn, but the king falls.",
        "20... Nxd4 21. Qxf6 Qh3": "With the mate threat and the secure Black king, White wont be able to defend this.",
        "22. Qf2 Rdg8": "Especially when the other rook joins the attack!",
        "23. Kf1 Qh1+ 24. Qg1 Rf3+": "White resigns as the queen drops for nothing.  If 25. gxf3 Qxg1 is mate."
    },
    "url": "https://gameknot.com/annotation.pl/1-e4-e5-fetischists?gm=8417",
    "gameName": "1.e4 e5 - fetischists",
    "players": "buddie (1699) vs. mybookrunsdeep (2060)",
    "opening": "Bishop's opening (C24), Berlin defence"
}