{
    "moves": {
        "1. e4 g6 2. Nf3 c6 3. Bc4": "Another one where I develop as I want. Not sure about the opening but from looking at the other games in the section this fellow likes his early pawn charges.",
        "3... b5 4. Bb3 a5 5. a4 b4 6. Ne5 e6 7. Qf3 f6 8. Nd3 h5 9. c3 bxc3 10. dxc3 g5 11. e5 f5 12. Nd2 g4 13. Qe3 Bh6 14. Qc5 Na6 15. Qd4 d5": "And thats the move where it all goes wrong for my opponent. I'm not convinced with his pawn moves. His piece development seems very outward rather than focusing on the middle 16. And he's just offered an opportunity to tie him in knots.",
        "16. exd6 e.p.": "Who am I to refuse ;-) ",
        "16... Nf6": "Thats about as good as it gets. I might have considered the queen exchange, but the knight is an acceptable block for black.",
        "17. Ne5 Nd5": "But then this move.... offers me back the chance to force an advantage.",
        "18. Nxc6 Qxd6 19. Qxh8+ Qf8 20. Qxf8+": "I took the queen exchange as, with a rook and a pawn advantage together with better development, I fancied my chances.",
        "20... Bxf8 21. Bxd5": "Happy to swap bishop for knight and further damage his cohesion.",
        "21... exd5 22. Nxa5 Nc5 23. Ndb3 Nd3+ 24. Kd2 Ba6 25. Nc6 Rc8 26. Nbd4 Nxf2 27. Re1+ Ne4+ 28. Kc2 Bc5 29. b4": "That was a mistake. ",
        "29... Bxd4 30. Nxd4 Rxc3+": "And thats why. Didn't see that one coming.",
        "31. Kb2 Rc4 32. Nc2 Rc3": "But that enables me to forge further ahead by the rook sacrifice.",
        "33. Rxe4+ dxe4 34. Kxc3 h4 35. Bf4": "Just trying to make sure 4vs2 didn't become queen!",
        "35... Kd7 36. Ne3 Ke6 37. Rd1 Be2": "Optimistic and I wasn't planning on staying there.",
        "38. Rd6+ Kf7": "By forcing the king away with an unchallengable rook, the pawns are now isolated and hopefully can be killed.",
        "39. Nxf5 Bf1 40. Ne3": "I probably could have got away with kxp there, but chose to wuss on that one.",
        "40... h3 41. g3 Be2 42. b5 Ke7 43. b6 Ba6 44. Nxg4 Bb7 45. a5 Ba6 46. Kd4 Bb7 47. Nf6": "Looking at r-d7 if he stood still for it. Quite happy to sac the knight.",
        "47... Ba8 48. a6 e3": "Hmmm...",
        "49. Kxe3 Kf7": "Not sure why he did those last two moves rather than extricate the bishop. With the material advantage it should be whites game, but even so...",
        "50. b7 Kg6 51. bxa8=Q Kf5 52. Qd5+ Kg6 53. Qg5+ Kf7 54. Nd5 Ke8 55. Qe7#": "And a nice finish..."
    },
    "url": "https://gameknot.com/annotation.pl/106th-gk-tournament?gm=50585",
    "gameName": "106th GK tournament",
    "players": "grey_panda (1368) vs. buildinghead (1266)",
    "opening": "Robatsch (modern) defence (B06)"
}