{
    "moves": {
        "1. d4": "Thought it might be a useful exercise to annotate this in the interest of studying my game. Your comments are welcome if you think it will improve my play, and, by demonstrating the faults I've made, improve that of others.",
        "1... d5 2. c4 e6 3. Nf3 Nc6": "I think that at this point the opponent has left 'book'.",
        "4. e3 Bb4+ 5. Bd2": "I defended with the bishop rather than blocking with the pawn because I thought that in the case he was to exchange, it would only help me develop but in the case he withdrew he would be forced to move back to either the edge of the board (a5) or possibly d6 losing a tempo.",
        "5... Nf6 6. Ne5": "My thinking here was to destabilise his protection of the dark bishop.  Looking back now I guess I should have worked on development, possibly I could have moved a3.  \n\nComputer says taking the bishop was better.",
        "6... Bxd2+": "He surprised me here, perhaps wanting to avoid the complexity of the swap.\n\nComputer says he should have moved the bishop to e7.",
        "7. Qxd2": "I took with the queen, was Nxd2 better?\n\nComputer says Nxd2 was better.",
        "7... dxc4": "Taking the gambit at a late stage.  \n\nThis was a mistake according to stockfish.",
        "8. Bxc4": "Here I moved my bishop to a centre-controlling square but as it was unprotected here and the pawn was not a threat I could have taken with the knight instead (computer recommends) which would have led to tripled up pawns.",
        "8... Nxe5 9. dxe5 Qxd2+ 10. Nxd2": "Now we have a fairly simple game to play. Pieces are equal and bishops are both light-squared. \n\nComputer gives me +0.19 advantage which is probably due to advanced pawn and one move advantage.",
        "10... Nd7": "Knight moves to protect itself from e5 pawn and now threatens e5.",
        "11. f4": "protecting e5",
        "11... O-O": "Seems sound to me: we're at the 11th move. \n\nComputer says b6 was better, preparing for the bishop on b7 and recommends I move to Kf2 rather than castling... interesting.",
        "12. O-O b6 13. Rac1": "My intention was to put pressure on the c pawn.  \n",
        "13... Bb7": "Black has now got his rooks connected.",
        "14. Bb5": "Attacking the knight and the c pawn",
        "14... Nc5": "Black saves both with one move.",
        "15. g4": "The intention here was to shift pressure from the left to the right side. I thought my pawn position was superior from that perspective so thought I'd try and capitalise.\n\nStockfish sees this as a mistake, it removed my advantage bringing the game back to zero. In hindsight I can see that black now has free run at putting my pieces on the defense.",
        "15... f6": "Black doesn't capitalise on the loss of tempo and chooses to attack the advanced pawn.  \n\nComputer sees this as a mistake.",
        "16. b4": "Rather than taking the pawn immediately I thought I'd try and create multiple threats on black's pieces.",
        "16... Ba6": "Black counters by threatening my bishop, which has been sitting unprotected.",
        "17. Bc6": "I decide to threaten his rook rather than close the c file with my bishop.\n\nComputer doesn't like this, it removes my advantage completely to zero.  ",
        "17... Nd3": "Black encourages an exchange of rooks.  \n\nI didn't see this as being so bad but the computer thought it weak for black.  Black should have moved Rad8, which would have exchanged knights anyway. Perhaps the difference here is that I will subsequently take the c pawn with my rook.",
        "18. Bxa8 Nxc1 19. Rxc1 Rxa8": "exchange is done, material is equal (or slightly in blacks favour if you count the bishop higher) now but position is better for white:  blacks pawns are almost undeveloped.  ",
        "20. Rxc7": "I chose to take the c pawn before he moved it forward, leaving the e5 pawn for black.  ",
        "20... Bb5": "Strangely black left me that pawn too.  Win win for me.",
        "21. exf6 gxf6 22. f5": "In hindsight this was inefficient.  I was trying to force a passed pawn.\n\nComputer analysis shows Ne4 was best.  f5 lost 3 points advantage from +4.",
        "22... exf5 23. gxf5 a6": "Not sure why black did this. I was expecting him to attack the f5 pawn with Bd3.",
        "24. Ne4": "Moving to attack the f6 pawn.",
        "24... Rf8 25. Nd6": "Here I was thinking of either forcing an exchange, knight for bishop and then gobbling up the doubled up pawns with my rook, or.. letting black move Bd5 and then moving e4",
        "25... Bd3 26. Rc6": "Defending an eventual attack on the knight and also putting pressure on blacks pawns, forcing him to occupy his rook with defensive tasks.",
        "26... Rb8 27. a4": "Buying time, using my pawns to force something to happen.",
        "27... b5": "I think this was a mistake by black.  If he was to move either one of the pawns it ought to have been the defended one right?",
        "28. Rxa6": "I decided to take the free pawn. \n\nComputer says a5 led to a great advantage for me.  \n28. a5 Ra8 29. e4 Kg7 30. Kf2 h5 31. Ke3 Bc4 32. Nb7 Kf7 33. Nc5 Ke7 34. Rc7+               + (4.54++) \n\n",
        "28... bxa4 29. Rxa4 Rd8 30. Nb7 Re8 31. Kf2 Re5 32. Nd6 Bxf5 33. Ra5": "Black is forced to exchange rooks or he loses the Bishop.  \n\nComputer analysis prefers letting the b pawn advance protected\n\n33. b5 Rd5 34. Ra8+ Kg7 35. Rd8 Be4 36. b6 Rd2+ 37. Kg3 Rb2 38. Nxe4 Rxb6 \n    + (5.16--)  ",
        "33... Rxa5 34. bxa5": "Now my pawn is on the a-file which will queen on a white square, the same as the black bishop.  ",
        "34... Bd3": "Black moves to stop the a pawn advancing and stop the knight from moving to 50% of its possible moves.",
        "35. Kf3": "I moved the king to allow the pawn to advance with some protection. I was hoping that by overloading the bishop I would be able to move the a-pawn.  Unfortunately my knight is wasted here.\n\nThe computer would have preferred Ne8 forcing the king to protect the pawn Kf7, then I would do Nc7 which puts the knight in a position to protect the pawn as it moves through a6 and eventually a8, allowing for at least a sacrifice of bishop for pawn.\n\n",
        "35... Kf8": "Black decides to start getting king involved.",
        "36. e4": "This was a dubious move, not sure what I was thinking.\n\nComputer doesn't mind it much.  ",
        "36... Ke7 37. Nf5+ Ke6 38. Ng3": "I was planning on chasing the king around until I could get my knight in a better position.  Here I realised that if I didn't protect the pawn with something other than my king black might take it.  ",
        "38... Ke5 39. Ke3": "At this point I decide to put pressure on the bishop.  The d3 square gives him too much control of the board.",
        "39... Ba6": "This was the most logical move, computer agrees.",
        "40. h4": "Again thinking that I might do well to put pressure on black from both sides of the board.",
        "40... Bc8 41. h5 h6": "Black advanced the pawn to block the h-pawn.\n\nThis was a major error for black according to pc analysis.  Anyone want to elucidate why? Black had a reasonable chance by moving Bb7, which would have stopped me moving the knight away and advancing a6.  At best the e and f pawns would have been lost.  Instead now I can advance to f5 which lets me capture that h6 pawn or lets me exchange knight for bishop, which will lead to me queening - the a-pawn wouldn't outrun the king but would put the king on the a8 square and I'd eventually queen the h pawn.\n",
        "42. Nf5 Bb7": "Black decides to attack the white pawn, \n\nBa6 was also a possibility but a pawn will inevitably be queened now anyway.",
        "43. Nxh6 Bxe4 44. Nf7+ Kd5": "I use the check to free my h-pawn.",
        "45. Nd6": "I thought this was quite clever: if the king takes the knight, I take the bishop, alternately he can move the bishop but all squares available are disadvantageous.  \n\nComputer analysis doesn't like this a lot because it delays queening but deeper analysis shows it is actually ok.",
        "45... Bc2 46. a6 Ba4 47. a7 Bc6": "With promotion threats on both sides of the board blacks position is basically lost now.  ",
        "48. Nc8": "The idea here was to sufficiently defend the a pawn so that black would need both its pieces to stop promotion.  \n\nComputer: In no more than 6 moves I'll have promoted a pawn.",
        "48... Ba8": "Blunder: black lets me fork his bishop and king. \n\nComputer Mate in 12: 49. h6 f5 50. h7 f4+ 51. Kxf4 Kc4 52. h8=Q Kd3 53. Nb6 Bg2 54. Qd8+ Ke2 55. a8=Q Bxa8 56. Nxa8 Kf2 57. Qd2+ Kg1 58. Kf3 Kf1 59. Qf2#",
        "49. Nb6+": "I missed mate and went for the bishop (sorry I can't see 12 moves ahead just yet!)\n\n",
        "49... Kc6 50. Nxa8 Kb7": "Now just a matter of time.",
        "51. h6": "Black resigns."
    },
    "url": "https://gameknot.com/annotation.pl/117th-gk-tournament?gm=55124",
    "gameName": "117th GK tournament",
    "players": "youpawn (1597) vs. johnriola (1508)",
    "opening": "QGD Slav (D30)"
}