{
    "moves": {
        "1. d4 Nf6 2. c4 e6 3. Nc3 Bb4 4. Qc2 Nc6": "The Milner-Barry (Zurich) variation of the Nimzoindian Defence (E33).  Black's objectives are modest:  avoid the main lines of the Classical variation and set up a solid defence with e5, d6, 0-0 and Re8, often conceding the two bishops with Bxc3.",
        "5. Nf3 d6 6. e3 O-O 7. Bd3": "This has the drawback of setting up a potential fork after Black pushes his pawn to e5.  A better try is 7 Bd2, avoiding the doubled pawn and bringing the bishop to the a1-h8 diagonal should Black play Bxc3.  ",
        "7... Bxc3+ 8. bxc3": "8 Qxc3 e5 9 also leads to equality.",
        "8... e5 9. O-O Re8 10. Ng5": "White forces Black to disturb the pawns in front of his king.  A solid alternative is 10 Nd2, aiming for a setup featuring f3, Qf2, Ne4, Rb1 and Ba3 with a very slight edge for White.  Black is equal after White relieves the central tension with 10 dxe5 Nxe5 11 Nxe5 dx35 12 Rd1 Qe7. ",
        "10... h6 11. Ne4": "The fireworks after 11 Nh7!? peter out to equality:  11 ... Nd7 12 f4 exd4 13 exd4 Nb6 14 Ba3 Qd7 15 Rae1 f5 16 Bxf5 Qxf5 17 Rxe8 Kxh7 18 Qxf5 Bxf5 Rxa8 Nxa8 20 c5.",
        "11... Nxe4": "Black can't be in too big a hurry to go after the c4 pawn:  11 ... Na5 12 Nxf6  Qxf6 13 Qa4.",
        "12. Bxe4 Na5 13. Rb1": "White decides to rid himself of his doubled pawn by exchanging light-square bishops, but this strategy is hardly sound.  After 13 ... Nxc4 14 Bxb7 Bxb7 15 Rxb7 Nb6 White will have a rook on b7 that requires immediate protection, a dark-square bishop hemmed in by pawns and a weak light square complex (a4, c4, d3, e2, e4 and f3) ripe for exploitation by Black's queen and knight.  More solid is 13 Bh7  Kh8 14 Bd3 c5 15 f3 b6.",
        "13... Nxc4 14. Bxb7 Bxb7 15. Rxb7 Nb6 16. Qf5": "The queen can't defend the rook directly:  16 Qe4 Qd7 (threatening 17 ... f5 and 18 ... Qc6) 17dxe5 Rxe5 18 Qf3 Qc8 19 c4 d5 20 Bb2 Rg5 21 h4 Rg6 22 Rxb6 axb6 - .  So White's only alternative is to keep the Black queen from reaching c6 or c8. ",
        "16... Re7": "The logic behind this move should be clear:  to reach c6 the Black queen must first go to e8; so the rook clears that square and defends the c7 pawn.",
        "17. Bb2 e4": "Black could have played 17 ... Qe8 18 dxe5 Rxe5 19 Qf3 Rc5 20 c4 Nxc4 21 Bd4 Nd2 22 Qd1 Nxf1 23 Bxc5 dxc5, but it seemed better to maintain positional pressure rather than open the position with wholesale exchanges.  The next few moves decide the fate of the trapped White rook.",
        "18. Rb1 Qe8 19. Qa5 a6 20. Ba3 Nc4": "Once again, Black could have played the straightforward 20 ... Qc6 21 R7xb6 cxb6 22 Qxb6 (22 Rxb6? Rb7- ) Qxc3 23 Bxd6 Rc8 24 Bd5 Re6; but White would have had a protected passed pawn for the exchange and Black's advantage would have been small.  Once again it seemed better to maintain pressure rather than open the position.  20 ... Nc4 is the first in a series of knight forks that ends with the winning of the bishop on the 46th move.",
        "21. Qb4 Qc6 22. Rb8+ Rxb8 23. Qxb8+ Kh7": "The White rook has been \"saved\" and White controls the b file; but even though Black has won no material he has a winning advantage.  The file White controls leads to a dead end, his bishop is a target hemmed in by pawns, the Black king has found a safe haven on h7, the Black queen and knight have occupied footholds in the weak square complex (a4, c4, d3, e2, and f3), and the Black rook is ready to either join an attack on the White king from f6 or g6, or bring additional pressure to bear on the queenside by swinging to a5 or b5 via f5 or g5.  This adds up to a large advantage in mobility, one that will become obvious from the speed with which the Black pieces switch from queenside pressure to kingside attack.  White's pieces will remain bottled up, with the rook never escaping the 1st rank and the bishop escaping its box only to be lost on d6.",
        "24. Qb3": "Slightly better is 24 Qb4 a5 25 Qb3 Nd2 26 Qb5 Qxc3 27 Bb2 Qb4 28 Qxb4 axb4 29 Rc1 d5 30 Rc6 Nc4.",
        "24... Nd2": "A second knight fork.  Worth noticing is the next logical kngiht jump to f3, a move that will become a strong tactical threat later in the game.",
        "25. Qb7 Qa4 26. Qb4 Qc2 27. Ra1": "There are no appealing alternatives for White:  27 Rc1 Qxa2 28 Qb2 Qxb2 29 Bxb2 Nc4 30 Rb1 d5 31 Bc1 Re6 32 Kf1 Kg6- ; 27 Rd1 Qxa2 28 h4 Re6 29 Qb2 Qxb2 30 Bxb2 Nc4 31 Rb1 d5 32 Bc1 Kg6- .",
        "27... Re6": "In only five moves Black's king has found shelter, his queen and knight have wormed their way into the heart of the White position with a series of threats against the White rook and bishop, and his rook has emerged as a serious offensive threat.",
        "28. Qb2 Qd3 29. Re1": "But not 29 Rd1? Nf3  30 gxf3 Qxd1  31 Kg2 Rg6 32 Kh3 Qxf3  33 Kh4 Qg4#.  Now, however, the threat of Nf3  gains a tempo for Black's attack.",
        "29... Rg6 30. Kh1 Nc4": "A third knight fork.",
        "31. Qc1": "White's position is also hopeless after 31 Qb3 Rf6 32 Bc1 Rxf2 33 h3 f5 34 Kg1 Rc2- .",
        "31... Rg5 32. Bb4": "The threat was 32 ... Ra5.  Bb4 would be more effective if the Black rook were still on g6, since then the bishop could only be driven off by 32 ... a5, when 33 a4!? axb4 34 cxb4 would give White at least the hope of counter play in exchange for his piece.  Now, however, 32 ... c5 33 dxc5 dxc5 34 Ba3 drives the bishop back and opens the d file for Black's queen and rook while allowing Black to maintain his queenside bind.  White  prevents the rook from reaching a5 or b5, but that is more than offset by the increased mobility of the Black queen and Black's control of the d file.",
        "32... c5 33. dxc5": "White gains nothing by retreating the bishop:  33 Ba3 cxd4 34 exd4 Rf5 35 Bxd6 Nxd6 36 Kg1 Qc4 37 Qc2 Ra5 38 Qb3 Rxa2 39 Qxc4 Nxc4- .",
        "33... dxc5 34. Ba3 Qd7": "This \"retreat\" is typical of queen endgames in which the queen's great mobility allows it to create simultaneous threats in widely separated sections of the board.  Here, the queen exerts pressure along the d file and the a4-e8 and c8-h3 diagonals.  (See, e.g., eddieleggs v. welinarias (28-Nov-07) where the White queen creates very dangerous threats against the Black king while holding up Black's passed pawns.",
        "35. h3": "Black was threatening 35 ... Qa4, 35 ... Qg4 and 35 ... Rd5, and White's choice of defences is far from encouraging.  White can abandon his bishop with 35 Qc2 Nxa3 36 Qxe4  Qf5 37 Qxf5  Rxf5 38 Re2 c4- .  Or, he can contest control of the d file at the cost of allowing the Black queen to penetrate on the kingside:   35 Rd1 Qg4 36 Rg1 Qe2 37 Qd1 Qxd1 38 Rxd1 Nxa3 once again dropping the hapless bishop.  Instead, White pins his hopes on denying the Black queen g4 and bringing his own queen to g3 via b8.",
        "35... Qf5": "Probably even stronger was 35 ... Rd5 36 Qb1 Nxa3 37 Qxe4  g6 38 Kg1 Rd2 39 Rf1 Qe6 40 Qxe6 fxe6 41 f4 Rxa2- , but there seemed to be no point in allowing White even a meaningless check.",
        "36. Rf1 Ne5 37. Qb1": "After a series of best moves in a very difficult position, White finally slips.  Better was 37 Qd1 Rh5 38 f4 exf3 39 Rxf3 Nxf3 40 Qxf3 Qxf3 41 gxf3 c4 42Bf8 Rd5 43 Kg2 Rd3, although White will be the exchange and at least one pawn down in a hopeless ending.  Grabbing the c pawn with 37 Bxc5 fails after 37 ... Nf3 38 Rg1 (38 gxf3?Qxh3#) Rh5 39 Qf1 Nd2 40 Bd6 Nxf1 41 Rxf1 Qe6 42 Bg3 Qxa2.  In this line 38 Qb1 leads to mate after 38 Rh5 39 Qb8 Rxh3 40 gxh3 Qxh3 41 Qxe4 (41 Qb8 Rxh3  42 gxh3 Qxh3  43 Qh2 Qxh2#; 41 Bd6 Rxh3 and mates) Qxe4 42 Bd6 Qg4 43 Bh2 Rxh3 44 gxh3 Qxh3 and mates.  This mating attack demonstrates how rapidly the weakness on f3 becomes decisive once Black begins his kingside attack.",
        "37... Nf3 38. Qb8 Qg6 39. g4": "Capturing the knight gives White the choice between losing his queen or being mated:  39 gxf3 Qf5 40 Kh2 Qxf3 41 Qg3 Rxg3.",
        "39... f5 40. Qg3": "The White queen has arrived on g3, but that's not enough to stop the Black attack while the bishop remains out-of-play on a3.",
        "40... fxg4 41. h4 Rh5 42. Bxc5 Rxh4+ 43. Kg2 Rh3 44. Bd6 Nh4+": "White could have resigned several moves earlier, so why not have a little more fun with the knight instead of finishing with 44 ... Rxg3  45 Bxg3 Qf7 46 Ra1 h5 47 Rh1 g5 48 Kf1 h4 49 Bb8 h3 and mates.",
        "45. Kg1 Nf5": "Stick a fork in him.  He's done.",
        "46. Qf4 Nxd6 47. Kg2 Nf5 48. Rg1 Rf3 49. Kf1 Rxf4": ""
    },
    "url": "https://gameknot.com/annotation.pl/121w-07-nov-2007?gm=14657",
    "gameName": "121W-07/Nov/2007",
    "players": "hens42cis (1993) vs. eddieleggs (1808)",
    "opening": "Nimzo-Indian (E33), classical, Milner-Barry (Zurich) variation"
}