{
    "moves": {
        "1. e4 e6 2. d4 d5 3. e5 a6": "3...don't really see the point of this...wastes time...in this line, B wants to get pressure on d4 and e5 through c5;nc6;Qb6, sometimes Bb4...in some lines, though, if B wins a pawn on d4, he has to worry about a discovered attack on the capturing piece by a Bb5+, so maybe the idea is to avoid these tactical complications...still this is slow",
        "4. Nf3 c5": "4...OK, this makes sense",
        "5. c3 Nc6 6. Be2 Bd7 7. O-O Rc8 8. Bg5 f6": "8...the e6 weakness is not always so easy to exploit,  it looks worse than it probably is",
        "9. exf6 Nxf6 10. Ne5 Be7 11. Qd3 cxd4 12. Bh5+": "12. This is unjustified...W sacs a piece for what ?....he has no follow up...and his B on g5 and Kt on e5 can be traded off...the rest of his forces are still sitting on their home squares (the K rook after castling)...this should lose outright",
        "12... Nxh5 13. Bxe7 Nxe5": "13...a little more dramatic, but not any stronger, IMO than simply recapturing Q x e7",
        "14. Qxd4 Nc6 15. Bxd8 Nxd4 16. cxd4 Rxd8 17. Nc3 Ke7 18. Rfe1 Rhf8": "18...B is letting W back into the game. B c6 holds the d pawn, which is pinned",
        "19. Rac1": "19. W blunders in return...simply rip off the d pawn",
        "19... Rdc8 20. Nxd5+": "20.  Finally....",
        "20... Kd6 21. Nb6 Rxc1 22. Rxc1 Nf6 23. Nxd7": "23.  This is bad...W should NOT trade down...with the Kt. on the bd, he has a chance at maybe winning an exchange, and somehow drawing the game...the exchange just helps B to get to a winning endgame",
        "23... Kxd7 24. Kf1": "24.  With the extra piece, B should be able to win the d pawn, and then he simply will be up a piece",
        "24... Rc8 25. Rxc8": "25.  Again, the trade is bad for W...he should hold the piece, and trade pawns as fast as he can",
        "25... Kxc8 26. Ke2 Nd5 27. a3 a5 28. g3 b5 29. f4 Kd7": "29...the Black Kt. just dominates the bd.",
        "30. Kd3 Kc6 31. Ke4 Kd6 32. h3 a4 33. g4 b4 34. h4 bxa3 35. bxa3 Nc3+ 36. Kd3 Nb5 37. Kc4 Nxa3+ 38. Kb4 Nc2+ 39. Kxa4 Nxd4": ""
    },
    "url": "https://gameknot.com/annotation.pl/135th-gk-tournament?gm=60093",
    "gameName": "135th GK tournament",
    "players": "jazzbox61 (1465) vs. freddyossio (1523)",
    "opening": "French (C02), advance variation"
}