{
    "moves": {
        "1. e4": "ZIM 36. Tied at 4.5 in Round #1 closed dragon??  Funny it eventually opens up on the e-file.",
        "1... c5 2. Bc4 d6 3. h3 Nf6 4. Nc3 e6 5. Nf3 g6": "I didn't like the look of DSB just sitting there hemmed in on e7 so I decided to fianchetto.  Computer thinks it's a terrible idea and white should give serious thought to d4.  White eventually played a strong defense with 8.d3.",
        "6. O-O Bg7 7. Re1 O-O 8. d3 Bd7 9. e5 dxe5 10. Nxe5 Nc6 11. Nxd7": "Thanks to the computer I see that 11.Bf4 would have been an annoying preface.  At any rate, the stage is set.",
        "11... Qxd7 12. Re2 a6": "12.Re2 was weird and I knew it but couldn't figure out how to take advantage of it.  Computer says 12...Nd4 (clears the way for my Q to protect the b-pawn move to 5th rank without ...a6) 13.Re1 b5 advantage.  The text is still not too bad because I was seeing something similar, just a little slower.",
        "13. Be3 Nd4 14. Bxd4 cxd4 15. Nb1": "I would think Nd4 is obviously better but the computer doesn't agree.  Hmmm....?",
        "15... b5 16. Bb3 Rfd8 17. Qe1 Qc6 18. Nd2 Nd5 19. Nf3 a5 20. a3 Qc5 21. Ba2": "I never would have seen it but computer is looking hard at 21.Rxe6 fxe6 22.Qxe6+",
        "21... Rde8 22. Re4 Nb6": "Game note \"22...Nb6 wants to return to d5 though 24...e5? I blundered too focused on getting my N to a good position and thought I'd strengthen my central pawns in the meantime. I didn't realize ...exd4 pawn re-capturing his N leaves my rooks unprotected to a discovered attack from his R battery. So now I'm thinking to move my K out of the LSB way which I knew would be trouble. Then I can reinforce the e-pawn. But there's also his N hanging if I threaten his R with ...Nf6. Hmmmm which one? 23...Nf6 my e-pawn is still OK so I'll go with that one.\"",
        "23. Qd2 Nd7 24. Rae1 e5": "I wanted to line those pawns up better but I miscalculated as shown by his 25.Nxd4.  Good eye!",
        "25. Nxd4 Nf6 26. Nf3 Nxe4 27. Rxe4 Qc7 28. Qe2 Kf8 29. Ng5 h6": "Game note \"29...h6 hate to play this because my K is out of position now (want it beside my R) but I think I'm OK if he plays Nxf7 I reply ...Re7 and his N is trapped.\"  Indeed the computer shows the same, but funny it evaluates that as better than the retreat to f3.",
        "30. Nxf7 Re7 31. Nxe5": "Big turning point that I didn't realize at the time.  Better is 31.Qg4 +0.00 or 31.a4 Rxf7 32.Bxf7 Qxf7 33.axb5 +0.16.  Computer now shows -2.59.",
        "31... Bxe5 32. Rxe5": "Nope.  32.d4.  It's all over now.",
        "32... Rxe5 33. Qf3+": "33.Qf3+ didn't see that but I've got my R and Q lined up for mate.",
        "33... Ke7 34. Qf7+ Kd8 35. Qf8+ Kd7": "Game notes \"35...Kd7 please take my R lol. 37...Qd6 I guess the threat of mate will pass with 38.f4 39...Rf8 his Q is pinned.\"  Anyway it's all over baby blue.",
        "36. Qf7+ Kc6 37. Qxg6+ Qd6 38. Qg3 Re1+ 39. Kh2 Rf8 40. f3 Re2 41. Qxd6+ Kxd6 42. Bb1 Rg8 43. Ba2 Rexg2+ 44. Kh1 Rg2g1+ 45. Kh2 Rg8g2#": ""
    },
    "url": "https://gameknot.com/annotation.pl/157th-gk-tournament?gm=63982",
    "gameName": "157th GK tournament",
    "players": "mr_pertz (1607) vs. e4newman (1606)",
    "opening": "Sicilian defence (B20)"
}