{
    "moves": {
        "1. d4 f5": "Stonewall. I would like to try the seldom used variation. the reason why i choose this opening.\n",
        "2. c4 Nf6 3. Nc3 e6 4. a3 Be7 5. Nf3 d5 6. c5 c6 7. Bf4 Nbd7 8. h3 Nh5": "The classical line of 8......0-0 is deferred temporarily by a more dubious 8.....N-h5?!. Considering this move is based on the delayed advance of the white e-pawn.",
        "9. Bh2 O-O 10. e3 Nhf6": "See. The diagonal d1-h5 is now open. It is then about time for the Knight to return on f6.",
        "11. Bd3 Ne4": "It is noticeable that in only a couple of eleven moves, four were from king Knight.",
        "12. O-O b6 13. b4 a5 14. Qc2 Ba6 15. Nd2 Bxd3": "now that the position is about to loosen, trading-off my bad bishop is proper.",
        "16. Qxd3 bxc5 17. bxc5": "Now, K-h8, followed by the advance of the g-pawn is logical.But I will try first if i can snatch a pawn here.",
        "17... Bf6 18. f4": "First blunder, i supposed.",
        "18... Ndxc5 19. dxc5 Nxc3 20. Rac1 Ne4 21. Nxe4 dxe4 22. Qc4": "With a pawn ahead, end game is preferrable.",
        "22... Qd5 23. Qe2 Qb3 24. Rcd1": "He allowed intentionally the captured of the a-pawn. He can avoid if he chose exchange queens.",
        "24... Qxa3 25. g4 Qxc5 26. g5 Be7 27. Bg3 a4 28. Rda1 a3 29. Ra2 Rfb8": "The black, aside from the 3-pawns advantage, has a superior mobility of the heavy artilleries and is about to occupy open files and rank.\n",
        "30. Rfa1 Rb3 31. Bf2 Ra6": "A serious blunder. This rook is intended to occupy the a5 square. For unknown reason, maybe my mouse slip without knowing it. I submit 31.....Ra6, but in my mind, it was on a5! The fruit of my hardwork slip away.",
        "32. Qxa6": "What am I going to do now with a rook down.",
        "32... Rb2": "A very little chance to survive can be achieved by the initiative gained earlier",
        "33. Ra2xa3 Qc2": "At least I was able to harrased the white king",
        "34. Rf1 Bxa3 35. Qxa3": "White's advantage is slightly narrowed by invaded 7th rank.",
        "35... c5 36. h4 c4 37. h5 Qe2": "At least i can mange to draw the game here.",
        "38. Qa8+ Kf7 39. Qa7+ Ke8 40. Qa4+ Ke7 41. Qd1 Qd3 42. g6 hxg6 43. hxg6 Kd6 44. Qa1 c3 45. Rd1 Rd2 46. Rb1 Rb2 47. Qa3+ Kc6 48. Ra1": "Ooopps, the white gave me the opportunity to equalize!",
        "48... Rb1+ 49. Kg2": "No, I have the advantage here!",
        "49... Qf1+ 50. Kg3 Rxa1 51. Qxc3+ Kb5 52. Qe5+ Ka4 53. Qxg7 Ra2 54. Qd7+": "The attack on f2 can be realized only if the black king escaped from check from the white queen, where in this position, seems impossible because of the open battlefield. Series of manuevers, as seen here, black has achieved the objective.",
        "54... Ka3 55. Qa7+ Kb2 56. Qb6+ Kc1 57. Qc5+ Kb1 58. Qb4+ Rb2": "Now, the white is out of check.",
        "59. Qe1+": "Forced move.",
        "59... Qxe1 60. Bxe1 Kc2 61. Ba5 Kd3 62. g7": "With g-pawn is about to be promoted, the text move is done without thinking.",
        "62... Rb8": "Rook to b1 is slightly better because it will drive the white away from the defense of the g-pawn. With the text move, black is digging her tomb.",
        "63. Bb6 Kc4 64. Kh4 Kd5 65. Kh5 Rg8 66. Bd4 e5 67. fxe5 Ke6 68. Kh6 Kf7 69. Kh7 Ra8 70. Bc5 Rg8 71. Kh6": "With this inaccuracies, the black managed to won a lost game."
    },
    "url": "https://gameknot.com/annotation.pl/1600-1800-2?gm=23606",
    "gameName": "1600-1800 #2",
    "players": "abbusen (1624) vs. deobonggon (1768)",
    "opening": "Dutch with c4 & Nc3 (A85)"
}