{
    "moves": {
        "1. e4 e5 2. Nf3 Nc6 3. Bb5 d6 4. d4": "I’ve been using this more often in the last year.\n",
        "4... Bd7 5. c3": "This is the slow, preparatory move that I previously used before 4.d4.\n",
        "5... a6": "Not bad but Bc4 is still an option.  …Nf6 would force Nd2 or maybe Bg5.\n",
        "6. Ba4": "Post-analysis…. Computer much prefers Bc4 but I’m more familiar with the text move.\n",
        "6... Nf6 7. Bc2": "7.O-O Nxe4 8.Re1 is playable but again, not much experience with it.\n",
        "7... g6 8. Bg5": "In the recent Carlsen-Caruana match there were comments to the effect that this type of move is not best.  Not 100% sure why.  Be3 best??  Anyway, I have intentions to move the DSB around to g3.\n",
        "8... Bg7 9. O-O": "9.d5 would interfere with his DSB but I wasn’t in the mood for such a closed game after having just played a few.\n",
        "9... Qc8": "Didn’t see that coming.  …h6, …O-O, …Bg4 in my opinion.\n",
        "10. Qc1": "Post-analysis computer doesn’t like it.  Takes away from the central control.  Now I’m 5 vs his 6.\n",
        "10... Bg4 11. Nbd2": "Computer says this is best but I never even considered it’s second suggestion of 11.Qe3 which I probably would have preferred.\n",
        "11... h6 12. Bh4": "Computer considers this a mistake.  12.Be3 best.\n",
        "12... Bxf3": "Completes his plan but frees my position to my advantage.  I’m 5 vs 6 in the centre.\n",
        "13. Nxf3 g5": "He has no intention of opening the centre.\n",
        "14. Bg3 Nh5 15. Qd1": "My Q is no use on c1 anymore.  Wish I could tackle the hole on f5.\n",
        "15... Nxg3 16. hxg3": "Wow the computer prefers fxg3.  Gotta think about that for a while.  The only benefit I see is mobility for the R.  Over the course of the game it would not have mattered.\n",
        "16... g4 17. Nh4": "17.Nh4 is a plan to get to f5, block his Q from g4 and get my Q in his k-side.  Of course it’s a result of his text move which technically is a mistake. +1.09 (better is 16...exd4 or 16...d5) \n",
        "17... h5": "Could still try …exd4 maybe.\n",
        "18. Nf5 Bf6": "Computer suggests awkward moves like …Rh7 or …Kf8.\n",
        "19. Bb3": "I don’t have any notes on this but computer doesn’t list it as much of an option.  Seems obvious enough aiming at f7.\n",
        "19... exd4 20. cxd4 Qd7 21. f3": "21.f3 to open up the k-side but might fail to ...Bxd4+ we'll see if he takes the trap.  Nope so I focus on the weak c6 square with Rc1.  He needs to improve on his K-side attack.  At move 21 the computer had a complicated plan to fake a pin on the Q & K to bring the pawn out.  Too deep for me, didn’t see it.  Plus the computer must be thinking it’s a mistake to open the h-file for my opponent.  - / +\n",
        "21... O-O-O 22. fxg4 hxg4 23. Rc1": "Not 23.Qxg4 Bxd4+! \n",
        "23... Kb8 24. Ba4 b5 25. Bb3 Rh7 26. Qd2": "26.Qd2 I'm stuck. Might try d5.  His double R on the h-file would look gnarly.  Dunno why he plays his next move.\n",
        "26... Re8 27. Qc3": "27.Qc3 back to the c6 square.  And holy cow the computer analyses 27…Qxf5 as the best follow-up move.\n",
        "27... Na7 28. a4": "Attack the K!!\n",
        "28... Rxe4 29. Rf4": "Bd5 was needed.\n",
        "29... Rxf4 30. gxf4 c6 31. Qd3 Kb7 32. Nxd6+": "32.Nxd6+ screw it. Discovered attack on the R looks pretty so I jumped at it before analyzing.  With 31…Kb7 he must have wanted to relieve his N but missed that it put him into a fork.\n",
        "32... Qxd6 33. Qxh7 Bxd4+": "Darn check.\n",
        "34. Kh1 Qxf4 35. Qxf7+": "Bye bye Q’s.\n",
        "35... Qxf7 36. Bxf7 Bxb2 37. Rc2": "Keep the pressure.\n",
        "37... Bd4 38. axb5 axb5 39. Kh2": "Keep my K from being pinned down.\n",
        "39... Be5+ 40. Kg1 g3 41. Kf1 Kb6 42. Ke2 c5 43. Kf3 Nc6 44. Ke4 Bc7 45. Rc3": "45.Rc3 pretty stale \n",
        "45... Ne5 46. Be6 c4": "46...c4 takes that square from his N so 47.Rxg3 and I'm boss!\n",
        "47. Rxg3 Nd3 48. Rg6": "48.Rg6 (...Nc5 49.Kd4/Kd5 +/-) Nf4 49.Rh6 Nxe6 50.Rh6 and if Nxg2 then 51.Bh3+ attacking the N.\n",
        "48... Kc5 49. g4": "49.g4 Nf4 (fork)\n",
        "49... b4 50. Rg5+": "50.Rg5+ \n",
        "50... Kc6 51. Bxc4 Nf2+ 52. Kf3": "52.Kf3 (not Kf5 which is OK to keep opposition on his K) maintains the scope of my R (53.Rb5!) and pressures his N.\n",
        "52... Nd1 53. Rh5 Nb2 54. Bf7 Nd3": "54...Nd3 at this point acenlv took first place with a win over bcjuk but we could all tie at 4 points if I win this.\n",
        "55. Ke4 Nf2+ 56. Kf5": ""
    },
    "url": "https://gameknot.com/annotation.pl/170th-gk-tournament-http-gameknot-com?gm=65756",
    "gameName": "170th GK tournament, http://gameknot.com/",
    "players": "e4newman (1618) vs. achenlv (1663)",
    "opening": "Ruy Lopez (C62), old Steinitz defence, Nimzovich attack"
}