{
    "moves": {
        "1. e4 c5 2. Nf3 d6 3. d4 cxd4 4. Nxd4 Nf6 5. Nc3 a6 6. Bg5 e6 7. f4 Be7 8. Qf3 Qc7 9. O-O-O Nbd7 10. g4 b5": "Gligorich and I have a standing feud with this position, which we've reached no less than three times.",
        "11. Bxf6": "Interesting is 11 B-N2 B-N2 12 KR-K1 P-N4 13 N-Q5?! PxN 14 PxP K-B1 15 N-B5 R-B1, and Black won (Bernstein-Fischer, 1957-8 US Championship.)",
        "11... gxf6 12. f5": "Giving up the K5 square in order to exert pressure on K6.",
        "12... Ne5": "Vladimir Simagin gave this move a \"?\" and proceeded to analyze the alternative 12... P-N5 13 PxP PxN 14 PxN ch BxP 15 P-K5, etc. By this logic the whole variation is unsound for Black.",
        "13. Qh3 O-O": "Tigran Petrosian and Mikhail Tal happened to stroll by the board at this instant. Petrosian made a wry face which looked to me like \"Can Black do this and live?\" But if Black tries 13... B-Q2, on 14 P-N5! PxNP 15 PxP PxP 16 NxP Black's game collapses.",
        "14. Nce2": "Intending N-B4, pressuring the Black KP.",
        "14... Kh8 15. Nf4 Rg8 16. Rg1": "Gligorich gives 16 B-K2 as correct: after 16... Q-N2 17 PxP PxP it's anybody's game.",
        "16... d5": "More prudent is 16... Q-N2 (17 R-K1 Q-N3!)",
        "17. fxe6 dxe4 18. Nd5 Qc5": "Black's game hangs by a hair.",
        "19. Nxe7": "If White tries 19 N-B5! the key line is 19... QxR 20 N/B5xB BxP 21 NxR BxP 22 Q-R6 BxR 23 N/N8xP Q-KN3 24 QxQ PxQ 25 KxB with winning chances.",
        "19... Qxe7 20. Nf5 Qxe6 21. Qh6 Bd7": "Defending against the powerful threat of R-Q8.",
        "22. Rd6": "Black threatened ...R-N3 and ...QxRP.",
        "22... Nxg4 23. Rxg4": "Forced (23 RxQ? NxQ winning a piece.)",
        "23... Qxf5 24. Rxg8+": "Handing Black the game on a platter (24... KxR RxBP Q-K4, with Black a Pawn ahead with a dominating position.)",
        "24... Rxg8": "Black hands it right back, missing the win.",
        "25. Rxf6 Qd5 26. Rd6 Qf5 27. Rf6 Qg5+": "I should have contented myself with a draw by repetition (27... Q-Q4 28 R-Q6, etc.)",
        "28. Qxg5 Rxg5 29. Rxf7 Bg4 30. Kd2 Bf3 31. Ke3 Rg1 32. Bh3": "Avoiding 32 K-B2? R-KR8.",
        "32... Re1+ 33. Kf4 Bd1": "Nowadays I would know better than to try and squeeze a win out of such a simplified ending.",
        "34. Ke5": "Gligorich invites me to overextend myself.",
        "34... e3 35. Bf5 Rg1 36. Rxh7+ Kg8 37. Rc7 Bg4": "Black should simply force a draw with 37... P-K7 38 K-B6 K-R1 39 R-R7 ch K-N1 40 R-QB7 K-R1, etc.",
        "38. Bxg4 Rxg4 39. Rc3 e2 40. Re3 Rg2": "Black can still hold the draw.",
        "41. Kd4 e1=Q": "if 41... RxRP? 42 K-Q3, Black is lost.",
        "42. Rxe1 Rxc2 43. Rb1 Kf7": "Avoiding 43... RxRP? 44 K-B5 with a fatal penetration on the Q side.",
        "44. a3 Ke6 45. b3": "If 45 P-KR4, 45... K-Q3 holds.",
        "45... Rxh2 46. Kc5 Kd7 47. Kb6 Ra2 48. Kxa6 Rxa3+ 49. Kb7": "49 KxP K-B2 leads to a book draw.",
        "49... Kd6 50. Kb6 Kd7 51. b4 Rh3 52. Rc1 Rh8": "After the game, Fridrik Olafsson scolded me: \"How can you play an ending like this so fast?\" (I'd only been taking a few seconds per move for the last dozen moves or so.) \"Because there's no danger. It's a dead draw,\" I replied.  Had I known then what I know now, I would have selected 52... R-R4, and if 53 R-B5 RxR 54 KxR K-B2 55 KxP K-N2 holding the opposition with a book draw.",
        "53. Kxb5": "Now it's Gligorich's turn to err. As Olafsson showed me, White can win with 53 R-B7 ch! It's hard to believe. I stayed up all night analyzing, finally convincing myself and, incidentally, learning a lot about Rook and Pawn endings in the process. Black cannot get his King in front of the Pawn (53 R-B7 ch K-Q3 54 R-B6 ch K-Q2 55 KxP R-N1 ch 56 R-N6 R-KR8 57 R-N7 ch K-B1 58 K-R6 R-R3 ch 59 K-R7 with a book win.)",
        "53... Rb8+ 54. Ka4 Ra8+": "The game was adjourned again, but the crisis has passed.",
        "55. Kb3 Rc8 56. Rxc8 Kxc8 57. Kc4 Kb8": "Draw agreed. Black has the distant opposition."
    },
    "url": "https://gameknot.com/annotation.pl/1959-candidates-tournament?gm=53012",
    "gameName": "1959 Candidates' Tournament",
    "players": "Svetozar Gligorich (GM) vs. Bobby Fischer (GM)",
    "opening": "Sicilian (B99), Najdorf, 7...Be7 main line"
}