{
    "moves": {
        "1. c4": "In 1975 I was an advocate of the English Opening, in large part because I did not see it being used all that much when I first started playing.  I did own any written resources at the time and I wanted an opening that my opponents were as unfamiliar with as I.",
        "1... e5 2. Nc3": "I had read in a bookstore that the order of moves can be quite important in this opening.  ( Actually, I think that is true for all openings.)",
        "2... c6": "Probably played to take the game away from book.  What he did not know was I did not have any at the time ( I have some now.)  I did my reading at the bookstore.  And I had managed to join the USCF so I did get the monthly magazine for a while.",
        "3. Nf3 d6": "Black has taken a consevative approach this far - something I really did not like at the time.  I preferred a tactical game with a lot of hand to hand fighting.",
        "4. d4 Nd7 5. Bg5": "I made this Bishop thrust in part to provoke f6 which I believed weaken his Kingside.  True, it helps bolster his center and I lose a tempo but given the play thus far I felt I had a tempo to toss.",
        "5... Be7": "On 5. -----, Ne7 I intended 6. de, de; 7. Qc2 when Black must either give up some material or move a pawn.  (This also clears the way for a Queenside castle.)",
        "6. Ne4": "This provides a second layer of support for the g5 Bishop and threatens the d6 pawn as well.",
        "6... f6": "Finally.  Black could have also gone in for d5 to which case I intended to take away his castling priviledge and to try and win a pawn with play along this line: 7. -----,  d5; 8. cd, cd; 9. Nd6 ch (taking away the castling priviledge or picking up the Black Queen - his choice), Kf8; 10. Bxe7 ch, Qxe7; 11. Nxc8, Rxc8; 12. de, Nxe5; 13. Qxd5. ",
        "7. Bd2 exd4 8. Nxd4 c5": "Black overlooks his weak pawn at g7.",
        "9. Ne6 Qb6": "The only safe spot available to Queen.",
        "10. Nxg7+ Kf7 11. Nf5 Qxb2": "To even out the material balance.",
        "12. Bc3 Qb6 13. Nexd6+ Bxd6 14. Nxd6+ Ke7 15. Nf5+ Ke8 16. g3 Qe6": "A total blunder!!!!  How soon we forget!!!  The g7 square is still on the board and it is still unprotected!!",
        "17. Ng7+": "Black resigned."
    },
    "url": "https://gameknot.com/annotation.pl/1975-golden-knights-first-round?gm=10271",
    "gameName": "1975 Golden Knights (First Round)",
    "players": "P. L. Michael  vs. George L Stein ",
    "opening": "English opening (A21)"
}