{
    "moves": {
        "1. e4": "Here I present my very first tournament annotation. I hope you enjoy it.",
        "1... e6": "I have never played anyone who has a responce ...e6? But it seems quite normal, since lots of people play e5.",
        "2. d3": "This move blocks white's LSB but supports the e4 pawn. Normal.",
        "2... d5": "I usally play e5 after this move. Black is pushing some pressure onto white's e-pawn.",
        "3. Nc3 Nf6": "The e4 pawn is attacked twice, and defended twice, and after ...dxe4, dxe4 Nxe4, Nxe4 and white would win. So Nf6 might not have been the best move to play.",
        "4. Nf3 Nc6 5. d4": "!? I personally wouldn't play this move, I would play Bg5. But since black has just covered the e5 square, d4 stops Nxe5 after e5. So I agree with both sides, and think this is just a normal move. ",
        "5... Ng4": "White might play h3 (which is what I normally do) and chase the knight away.",
        "6. exd5": "!? I don't think this is the right time to play this move. If white is lucky, and if black plays Bd7, then that would be the right time to capture.",
        "6... exd5": "Now the e-file is clear.",
        "7. Qe2+": "? This move blocks his LSB and if black plays Qe7 (which is not very likely, after Qe7, Nxd5 wins a pawn), then both queens are pinned!",
        "7... Be7": "This is the correct way the answer the check. Next move might be O-O.",
        "8. Ne5": "? This is another knight fork. Black has to capture with one of his knights, and the queen puts threat on the g4-knight. But black can play Nxd4, and that threatens the white queen, and the fork on c2, and if Qd2/Qd3, black would win by playing Nxe5! ",
        "8... Nxd4": "!! Now black has multiple threats. Id Nxg4, tgeb Bxe2 and black wins. If Qxg4, Nxc2+, Kd1, Nxa1 wins. But if Qd3, Nxe5 wins a pawn (since after Qxd4, Nc6 and black ends up a pawn ahead.",
        "9. Qd3": "At the moment this is the best thing that white could do defending black's threat. White is only a pawn down, but this may cause problems in the endgame. ",
        "9... Nxe5 10. Qxd4": "The black knight does not need to move, as Bd6 is ok. ",
        "10... Bf6": "!! White's queen needs to move despratley. Bb5+ c6, Be2 Nf3+ check wins due to a discovered atack! If cxf3, Bxd4 wins!",
        "11. Qxd5": "! Black did not notice this move, and now the position is equal, nobody is winning at the moment. This move earns back a pawn, because Nxd4 fails to Nf3, cxf3, Bxd4 winning a queen for a knight.",
        "11... O-O": "!? Black could take with Qxd4 easily, but O-O shelters the king. As the queen is protected, I think this move is not a blunder.",
        "12. Be2": "!? Getting ready to castle, eh? Why not take with Qxd8? Should white play Qxd8 here or not?",
        "12... Be6": "? Carless, white can now play Qxb7, winning a pawn. Even though black's two bishops are standing guard, black will lose a pawn, but after Qxb8, Rb8, Qe4, black wins a tempo while white wins a pawn, and white clears the b-file.",
        "13. Qxb7 Qd4": "?! Why not play Rb8. What use is this move? Qxc3, bxc3 and white is seven points ahead. Or is black aiming at f2? White can now play Qxc7.",
        "14. O-O": "Well that's no good because white has castled.",
        "14... Rfd8": "?? You'll see why, a terrible mistake!",
        "15. Rd1": "A rook skewer! After Qh4, Rxd8+, Bxd8, Qxa8 and white ends up a rook ahead. Is there anyway to stop the skewer? ",
        "15... Qb6": "Black thinks there's no way to stop it!",
        "16. Rxd8+": "After the rook exchange, white swoops in a piece ahead (rook, and pawn, of course)>",
        "16... Bxd8": "A bishop on the rim is dim? No, no, no, well, this bishop on the rim might be dim, but if the c7 pawn was out of the way, the bishop on the rim will not be dim. This rim on the dim thing only works for knight's, not bishops. Anyway, Qxa8 and white wins.",
        "17. Qxa8": "Now the bishop is pinned! But the bishop is not lost. c6 solves the problem (or c5).",
        "17... Nc6": "?? He chose Nc6. This move blocks the white queen, but there is one move that saves the day!",
        "18. Bf3": "It is Bf3! Whatever black does, he will lose a piece. Bd7, Bxc6, Bxc6, Qxd8+ wins. Nc4, Qxd8+ wins, and Qb8 , either Bxc6 or Qxc6 will win. (Qxc6 is probarly better.), unless black plays...",
        "18... Nb8": "Nb8. Similarly like what I was talking to you about on move 16, this time, the knight on the rim is dim, because it can only move to four squares. Wait, let's get off the game a minute and exterminate the pieces. Look, whites DSB isn't even out yet, as his a1 rook is in bed, sleeping in the corner. What do you think about white's pawn structre, and what do you think about black's pawn structre? At the moment, which side has a more powerful attack? Answers, please view on comments. Thank you.  ",
        "19. Nd5": "!? What do you think about this move? \r\nAgain, answers on comments please. Is it intresting, duibious, blunder, good move? Whatever. ",
        "19... Bxd5": "Black is not defending very well, and white is not attacking very well either. Now black has only got a few pieces left, he needs to think about the way he plays. It is no good exchanging things. If you moved your queen, white's Queen and bishop are blocked. At the moment black is three points down...",
        "20. Qxd5": "And now he is 6 points down. Is black's structre better? Worse? \r\nIs white's structre better? Worse? ",
        "20... c6": "!! But why?",
        "21. Qd3 g6": "What do you think about this move? Blunder or intresting, Good or Bad, Duibious or brillaint?",
        "22. Be3": "! If black plays Qxb2, (which he probarly will do), white wins by playing Qxd8+, and gets to be 8 points up. Let's see if black falls into the trap.",
        "22... Qxb2": "Uh-oh, he does. Black is being very carless and now, the game is lost for black. Luckily, I've filmed it until white mated, so you'll see how white managed to mate.",
        "23. Qxd8+ Kg7": "Black is losing. This move is the only move, but is terrible.",
        "24. Bd4+": "A fork. Again, another rare bishop fork. If you've looked in the annotion \"The bishop pair\", you would've seen a bishop fork there to. This is what I call, a killer bishop fork!",
        "24... Qxd4 25. Qxd4+": "And the game is definetly lost for black. The firing squad could obviously finish of the game.",
        "25... f6": "But it's not so easy with so many pawns hanging around.",
        "26. Re1": "Getting the rook out.",
        "26... Na6": "On the rim again, eh?",
        "27. Re7+": "Game's nearly finished.",
        "27... Kh6 28. Qh4#": "Checkmate!\r\nI hope you enjoy this annotion.\r\nPlease add/view comments and rate this annotion.\r\nThank you.\r\n@oodle"
    },
    "url": "https://gameknot.com/annotation.pl/1st-tournament-annoation?gm=43790",
    "gameName": "1st Tournament annoation",
    "players": "Jack Oldeson  vs. Campbell Angel Imp ",
    "opening": "French (C00), Reversed Philidor formation"
}