{
    "moves": {
        "1. e4": "For an explanation of the first few moves, up to including White's sixth one, see Part I ( for comparison: http://gameknot.com/annotation.pl/tournament-experiences-with-the-reti-gambit-part-i?gm=40285) and Part II (http://gameknot.com/annotation.pl/tournament-experiences-with-the-reti-gambit-part-ii?gm=43780) of this annotation series. I consider the move 4... f5 to be unsound, which is pointed out in detail in Part II.",
        "1... e6 2. b3 d5 3. Bb2 dxe4 4. Nc3 f5 5. d3 exd3 6. Bxd3 Bd7": "The first deviation from Part II. It's an okay-looking development move, though it violates one of the basic opening principles \"Move your knights before your bishops, for the reason that in most cases, you don't know yet where the bishop has it's best place, while for the knight, it's often obvious.\" I would have prefered 6... Nf6.",
        "7. Qe2": "Of course, White wants to castle as soon as possible, so the queen wants to leave. e2 is the better target than d2, since the latter would block the rook on the d-file, where the opponents queen is sitting. And, as a nice side-effect, this also threatens already to win a pawn with Bxf5 in the next move.",
        "7... Be7": "Again prefering bishops moves over knight opening moves, but it unpins the pawn e6, thus not allowing Bxf5.",
        "8. O-O-O Bf6": "? This is bad due to several reasons: first, generally moving a piece twice in the opening loses time and is considered to be bad (though there are  exceptions, like in the Alekhine opening 1. e4 Nf6, to name the probably most popular counterexample to this rule). Second, it blocks the square which would fit perfect for the knight, which is still sleeping on g8. Third, and in this concrete case probably most critical, it enables the simple pawn-winning tactics again by enabling the pin on e6!",
        "9. Bxf5": "And material is even again, the opponent has to live with a lonely isolated pawn. Maybe it will be killed soon though...",
        "9... Qc8": "... but Black can avoid that with a queen move, again losing time for the opening. I guess there is no other effective way of preventing the loss, besides of an other queen move 9... Qe7.",
        "10. Nf3": "Completing development and connecting rooks -- Black is far away from that point and has not even castled yet. 10. Rxe7, following Bxe6 the next move, looks very strong and promising, though I was not sure if it's absolutely correct and decided to choose the solid variant.",
        "10... Ne7": "Finally, one of the knights is leaving the camp. Prepares to castle and unpins the pawn again, attacks White's bishop.",
        "11. Bg4": "Since blocking the d- or e-file was no good option, I had to step back at the other direction.",
        "11... O-O 12. Rhe1": "? I classify this move definitely as a mistake (though the advantage is still on White's side), since the material-winning 12. Rxd7! would really not have been too hard to see at that point. Black can't take back or his queen is history (12... Qxd7? 13. Bxe6+). Anyway, ignoring that this was possible, the rook of course belongs to this file and the e6 pawn is threatened. This piece setup of White, arising from the Reti gambit is beautiful isn't it? With the light-squared bishop on c4 instead of g4, it would look perfect, in my opinion.",
        "12... Nbc6": "Black has no effective way of preventing the loss of the pawn on e6, so moving the last minor piece out seems to be the best option.",
        "13. Bxe6+": "Ready to rumble!",
        "13... Bxe6 14. Qxe6+": "One might think that a queen exchange, which is implied if I want to win that pawn, decreases all of Whites advantage dramatically. However, due to the very active positions of the rooks and pieces, it's not a problem at all.",
        "14... Qxe6 15. Rxe6": "Yes, the ladies are gone, and the rooks rule the board now.",
        "15... Nf5": "? Black should have prevented the occupation of the seventh ranks by Rad8/Rfd8!",
        "16. Rd7": "Perfect, this rook is happy now.",
        "16... Rac8": "The c7 pawn was attacked, but Black could have got rid of that attack _and_ that powerful rook simply by Rf7.",
        "17. Nd5": "Centralises the knight and attacks c7 once more.",
        "17... Bxb2+": "Black decides to get rid of a very strong fianchetto bishop.",
        "18. Kxb2 Ncd4": "? Loses a piece.",
        "19. Nxd4": "Now, Black can't take back and complete the exchange due to a fork on e7. However, strictly in terms of material points speaking, losing the Exchange (-2) is still cheaper than losing a whole piece (-3)!",
        "19... Kh8": "Disabling that possible knight check.",
        "20. Nxf5": "After this move, which would be obvious in any case (always exchange pieces as much as possible if you are ahead in material)...",
        "20... Rxf5 21. Ree7": "... the mighty seventh rank can be fully possessed by two rooks. I claim that even without the won piece (and pawn), the game is dead lost for Black in such a position.",
        "21... c6": "Attacks my knight.",
        "22. Rexg7": "I ignore the threat and just eat through the yummy pawns in the seventh rank.",
        "22... Rxd5": "22... cxd5 would have been way better, opening the c-file, allowing some counter-play and threatening Rxf2 and attacking on c2.",
        "23. Rdxb7": "Another pawn in the seventh rank restaurant.",
        "23... Rdd8 24. Rbxa7": "Not really necessary anymore...",
        "24... Rca8 25. Rgxh7+": "And finally the dessert, garnished with a check.",
        "25... Kg8 26. Rag7+ Kf8 27. f4": "Now one of Whites pawns is needed to give the death blow.",
        "27... c5 28. f5": "Closer...",
        "28... Rab8 29. f6": "Alright, the seventh rank is supported now properly for also occupying the eighth.",
        "29... Ke8 30. Rh8#": "And that's it. I hope this game was in some way instructive for you -- I admit that it isn't too much strategic thinking behind this game and the win did not have to do that much with the opening, but still it shows the power of the seventh rank, and it points out which kind of positions arise from the Reti gambit and that it is just fun to play ;-) "
    },
    "url": "https://gameknot.com/annotation.pl/blitz-experiences-with-the-reti-gambit-part-iii?gm=43994",
    "gameName": "[Blitz] Experiences with the Reti Gambit, Part III",
    "players": "thestack (1677) vs. ejsensei9912 (1540)",
    "opening": "French (C00), Reti (Spielmann) variation"
}