{
    "moves": {
        "1. e4": "This is a fairly typical Sicilian match, sharp, intriguing, with mistakes on both sides. Yet is untypical in that the black king remains seated on his throne, while a king-side attack takes place!",
        "1... c5 2. c3": "I always suffer this White's reply when i play the Sicilian defense.",
        "2... Nf6": "Heidenfeld Variation",
        "3. e5 Nd5 4. d4 cxd4 5. Nf3 Nc6 6. cxd4 d6 7. Bc4 Nb6 8. Bb5 dxe5 9. Nxe5 Bd7 10. Nxd7 Qxd7 11. Nc3 e6 12. O-O Be7 13. Qg4 Bf6": "0-0 was a good alternative. This unduly attracts Nd4.",
        "14. Rd1": "The White is trying to push the pawn forward, and I still did not castle! I must do something about that!",
        "14... Nd5 15. Ne4 a6 16. Bxc6 Qxc6 17. Be3": "In White's shoes, I would have captured the bishop.",
        "17... h5": "I tried to complicate. My queen is exposed, I am about to swap bishop for knight, and not yet castled...",
        "18. Qe2": "I think 18. Nxf6 ; gxf6 19. Qf3 was better.",
        "18... Be7": "Acknowledging the inaccuracy on the 13th move.",
        "19. Rac1 Qb6 20. Nc3 Rd8 21. Na4 Qa5 22. b3 Nxe3 23. fxe3 h4": "Black's position has sensibly improved across the last 6 moves.",
        "24. Qg4": "Nc5 Qb6 25. Qf3 Rd5 26. Na4 Qd8 27. Rf1 would definitely have been more problematic for the Black. The white should play more on the c-file",
        "24... Qg5": "Actually at this point the Black could also castle, since the h4 pawn is defended by the bishop.",
        "25. Qf3": "Why? The white does not have a clear idea. 25. Qxg5 Bxg5 26. Kf2 entered a promising endgame. I believe that sometimes players refuse swaps after the thought \"that's exactly what my opponent wants!!\"",
        "25... h3 26. g3 Rh6 27. Rc5": "This must have been an unwanted blunder. I don't see other explanations.",
        "27... Bxc5 28. Nxc5 Rf6 29. Qe2 Qd5 30. e4 Qc6 31. Qg4": "The Queen is moving too much. Now she wants to capture the h3 pawn. But the White did not realize what the Black has in mind...",
        "31... Rxd4 32. Rxd4 Qxc5 33. e5 Qxe5": "After a show-off the Black does not find anything better than getting the pawn? Qc2 mated in 6.",
        "34. Qd1": "The white tries to checkmate, but incurs in the same threat. 34. Qe4 could go on for a while.\n34. ... Qe3+ 35. Kh1 Rf5 36. Rd8+ Ke7 37. Rd7+ Kf6 38. Rd3 Qe4+ 39. Rf3 Rxf3 40. Kg1 Rxg3+ 41. Kf1 Qg2+ 42. Ke1 Re3+ 43. Qe2 Qxe2#\n\nThis is a beautful sharp sicilian position: either side plays and wins!",
        "34... Qe3+ 35. Kh1 Qxd4": "I did not find the mate. I was content with my two pawns up and willing to undergo the forced swapping variation.\nI think the checkmate in 9 is not easy to find: Rf5, with the ideas Re5 or Rc5. The White resigned."
    },
    "url": "https://gameknot.com/annotation.pl/r-team-match?gm=37768",
    "gameName": "[R] Team match",
    "players": "drflounder (1861) vs. ciocionheart (1894)",
    "opening": "Sicilian (B22), 2.c3, Heidenfeld variation"
}