{
    "moves": {
        "1. e4 c5 2. d4 cxd4 3. c3": "morra gambit",
        "3... dxc3": "the black challange white thinking to block all attacks",
        "4. Nxc3 Nc6 5. Nf3 d6 6. Bc4 a6 7. O-O Nf6 8. Qe2 e6 9. Rd1": "the tipical develop. The white control the center and the principal column D, with a good bishop in C4; the white is more developped than the black; the black have won a pawn",
        "9... b5 10. Bb3 Bd7": "i think this is a strange place for the bishop after b5",
        "11. Bf4": "d6 is the principle point of white attacks",
        "11... b4 12. Nd5": "the white think to be sufficiently developped to start his attack; however Black could refuse the knife",
        "12... exd5": "accepting the knife, black accept a close position with little moving possibility",
        "13. exd5+ Ne7 14. Bxd6 Bb5 15. Qe5 Ng4 16. Qf4 Qb6 17. Ng5": "the attack is good, but the defender is good too",
        "17... f6 18. Ne6 g5": "necessary, i think",
        "19. Qxg4": "the white need to exchange his bishop with the knife so the attack decrease",
        "19... Qxd6 20. Nc7+ Qxc7 21. d6 Qd7 22. Qh5+": "the wrong! it was better Qf3+-",
        "22... Ng6 23. Rde1+ Kd8 24. Qf3 Bxd6 25. Qxa8+ Kc7": "it's not clear how mate the black king in the center of the board",
        "26. Qa7+ Kd8 27. Qb6+ Qc7 28. Qd4 Ne5 29. Rad1 Kd7": "the pressure continue but the black now can develop all his pieces",
        "30. h4 h6 31. Rd2 Rb8": "i don't understand this move: the rook doesn't defend or attack nothing, it's not developped",
        "32. Qd5 Qc6 33. Qe6+ Kc7 34. Rc2": "thinking to win early",
        "34... Qxc2 35. Bxc2 Re8 36. Rxe5": "closing the game....or not!?",
        "36... Bxe5 37. Qf7+ Kb6": "not!\r\nhow to win? black pieces are strong, pawns strong... is the white better than black?",
        "38. Be4 Rd8 39. g3 gxh4 40. gxh4 Rd2": "good position for black pieces, the queenside pawns are weak",
        "41. Qe7 Re2": "Qb4 is not possible for a5!",
        "42. Qb7+ Ka5 43. Qd5 Kb6 44. Qd8+ Kc5": "maybe the white hope a draw and any plus",
        "45. Bd3": "but he thinks to win yet",
        "45... Rxb2 46. Bxb5 Kxb5 47. Qd5+ Ka4 48. Qc6+ Ka5 49. f4": "trying to win something with some check",
        "49... Bxf4 50. Qxf6 Bh2+": "Be3=",
        "51. Kh1 Rxa2": "now, the white need to find something to don't lose",
        "52. h5": "perfect, the something that he are looking for",
        "52... b3": "maybe Black doesn't see the draw..it's too simple win with his B pawn and pulls it",
        "53. Qc3+ Ka4 54. Qxb3+": "force the draw, like Qa5 instead Qxb3",
        "54... Kxb3": "wow, what game, i like it!!!"
    },
    "url": "https://gameknot.com/annotation.pl/r-60th-gk-tournament?gm=26343",
    "gameName": "[R] 60th GK tournament",
    "players": "saccopterigio (1810) vs. doncan (1490)",
    "opening": "Sicilian (B21), Smith-Morra gambit, Chicago defence"
}