{
    "moves": {
        "1. e4 e5": "This is the second most popular response to 1. e4. 1...c5 is the most popular, and 1...e6 is the third most popular.",
        "2. Nf3": "Attacks the pawn while developing a piece",
        "2... Nc6": "Defends the pawn while developing a piece.",
        "3. Bc4 h6": "Passive move. Black should've continued more actively with Nf6 or Bc5. Piece development is especially important in double king-pawn positions and other open games. Don't expect to acheive equality if you are playing a move like h6.",
        "4. O-O Nf6 5. Re1": "I don't want to defend with d3 or Nc3 because I am planning to take over the centre with c3 and d4, and moves like d3 or Nc3 interfere with those plans.",
        "5... Bc5 6. c3": "I am carrying out my plan to take over the centre with d4. A common move in double-king-pawn positions.",
        "6... Ng4": "Not a good move. Black has moved his knight twice in the opening, which wastes a tempo, and he is ignoring my threat of d4, which will give me a tempo. Gaining tempi are very important in open games like this.",
        "7. d4": "I am adding another pawn to my centre, and Black will have to trade his strong e-pawn for my less valuable c-pawn, because moving the bishop immidiately will lose a pawn beceause h3 drives the knight away from the defense of the e-pawn.",
        "7... exd4 8. cxd4 Bb6": "Bb4 Nc3 Bxc3 bxc3 is good for me because I will have three strong pawns dominating the centre, which would soon advance and crush Black.",
        "9. b4": "I offer Black a pawn. This is somewhat risky because you should only complicate the game when you are losing, and I have a pretty decent position here. But I am good at complicated positions and was confident I could beat him in one.\r\nIf Black hadn't accepted the pawn, my plan would be to play a3 Bb2 Qb3 and then advance my central pawns.",
        "9... Nxb4": "A positional mistake, giving me a slight advantage.\r\nFor compensation for the pawn, I have a new open diagonal for my bishop, and an open b-file I can use later to help me with my attack after I play h3 and advance my central pawns.\r\n",
        "10. h3 Nf6 11. Ba3": "I activate my bishop with a gain of tempo.",
        "11... Nc6": "A losing blunder. The best move here is c5, which gives Black near equality.",
        "12. Ne5": "I am threatening f7, and the only way to defend it is to take the agressive knight.",
        "12... Nxe5 13. dxe5 Ng8": "Nh7 is better, but it is still completely losing. Perhaps it was better that my opponent lost quickly by playing Ng8 instead of suffering longer in a hopeless position with Nh7.",
        "14. Qd5 Qh4": "Black could've defended f7 with Ng5 if his knight had moved to h7 instead of g8, but then I would simply play h4, attacking the only defender of the f7 mating square. And Black could've also defended f7 with Nh6 if he hadn't made the terrible h6 move earlier. But other than the what-ifs, the only other way to stop mate in 1 is to sacrifice the queen.",
        "15. Qxf7+ Kd8 16. Qf8#": "My bishop on a3 is really what killed Black, because it stopped him from castling to defend mate on f7. But it was Black's one faulty 3.h6 move that led to these complications, because it gave me a lead in development, allowing me to get an initiative in the centre, driving Black's defensive pieces away. Just look at the knight on g8, which isn't even developed, yet it moved 4 times in the game."
    },
    "url": "https://gameknot.com/annotation.pl/r-quickplay-walhalla-61?gm=1592",
    "gameName": "[R] Quickplay walhalla 61",
    "players": "bakerbaker (1521) vs. busser (1448)",
    "opening": "King's pawn game (C50)"
}