{
    "moves": {
        "1. e4": "standard opening move",
        "1... e5 2. Nf3": "attack your pawn",
        "2... d6 3. h3": "defend against your light bishop pinning my knight to my queen",
        "3... Nf6 4. Bc4": "setting up a strong middle with an eye toward getting my f knight to f7 to fork your queen and rook, or put my bishop on f7 so you have to move your king and therefore cannot castle",
        "4... Nxe4 5. d3": "get that knight out of there!  And open a route for my dark bishop.",
        "5... Nc5 6. Ng5": "working toward my plan - fork queen and rook or check w/ bishop",
        "6... f6 7. Nf7": "plan complete, the pawn move to f6 causes me to move my knight first so as to prevent losing it.",
        "7... Qd7 8. Nxh8": "take",
        "8... Qf5 9. Bf7+": "now move your king, no castling for you.  both parts of plan complete",
        "9... Kd8 10. O-O": "castle to get my h rook available and with my king protected, my other pieces can now move out from behind a significant number of pawns remaining.  My pawn structure is stronger than yours as I have more choices what to do with the pawns than you do, ie, once a pawn moves forward, of course, it cannot move backward.  I'm not concerned about your dark bishop as you'll have to move a couple pieces to line it up with your queen or another piece to attack my king successfully",
        "10... e4 11. d4": "I choose to pass that pawn and in doing so, attack your knight with a lesser piece and occupy the center with protection for that pawn offered by my queen.  your e pawn can't attack my pawn, and neither can the c pawn... yet.",
        "11... Ne6": "yep, knight retreated, though now c pawn can attack my d pawn.",
        "12. Nc3": "Moving my knight out, attacking the middle.  if c pawn comes, might move my dark bishop to e3 to backup that pawn, and free my a rook",
        "12... b6 13. f3": "Because your dark bishop is at least 2 non dangerous moves away from lining up my king, i offer to swap pawns or let your pawn pass.  if you swap pawns, i attack your queen with my rook.  if you pass, then take the passed pawn with my bishop and develop it while freeing my a rook.",
        "13... exf3 14. Rxf3": "queen attack with rook",
        "14... Qa5 15. Re3": "lining up 2 attackers on your knight, its only defended by your bishop at the moment.",
        "15... Nc6 16. d5": "rather than sacrificing my bishop for a light bishop trade, i fork your knights.",
        "16... Ne5 17. dxe6": "a pawn past your pawns so near your king is dangerous... as you will see.",
        "17... Qc5": "i like this move, it pins the rook",
        "18. Qd5": "offer to trade queens.  if you take the trade, as a fringe benefit, I develop my knight",
        "18... g5 19. Qxa8": "take the rook",
        "19... g4 20. Qe4": "get the queen back to the middle, she's generally more effective there than at the periphery.",
        "20... Bh6": "i think if you had moved Bg7 there, my knight would be lost with the most expense to you would be a doubled pawn g file.",
        "21. e7+": "here's why letting my e pawn down there is dangerous.  If the bishop had stayed home, your king would be in better shape.  I have a couple conditional moves set here.",
        "21... Kxe7 22. Nd5+": "check your king, if you want to keep your queen, he must move.",
        "22... Kd8": "pretty sure I have you here.... I'm looking toward Qxh7 then to Qg8 to check.",
        "23. Qxh7": "working toward my plan.",
        "23... Bxe3+": "check, I guess you're sacrificing your bishop for a rook... though after Bxe3, you'll have to move your queen as my bishop there would be backed up by my d knight ",
        "24. Bxe3": "move your queen",
        "24... Qxc2": "Not sure I understand the motivation behind this move.  I could now take your queen with my queen...",
        "25. Qg8+": "yep, now its mate in 1",
        "25... Kd7 26. Qe8#": ""
    },
    "url": "https://gameknot.com/annotation.pl/r-challenge-from-kkurbel?gm=31384",
    "gameName": "[R] Challenge from kkurbel",
    "players": "mschaech (1497) vs. kkurbel (1069)",
    "opening": "Philidor's defence (C41)"
}