{
    "moves": {
        "1. e4": "Hi everyone, this match was against the highest rated player in my 1700-1800 mini-tournament, in fact just before the draw offer his rating was 1851.  This was a strange game of which again I was struck down by passivitis and I found myself exchanging my opponent's horsies which were threatening to run riot in my position for both my bishops.  I was very lucky to draw this game, how lucky only you the jury can tell me.  I kick off with e4 and my opponent gives me the Sicilian (c5).",
        "1... c5 2. Nf3 Nc6 3. Bb5": "3. Bb5 - I go for the Nimzovich-Rossolimo attack.",
        "3... g6 4. O-O Bg7 5. c3 Nf6 6. Re1 O-O 7. d4": "7. d4 - pawn break.",
        "7... cxd4 8. cxd4": "8. cxd4 - pawn trade.",
        "8... a6 9. Bd3 d6 10. h3 e5 11. dxe5 dxe5": "11. ...... dxe5 - another pawn trade.",
        "12. a3 Qd6 13. Nc3": "13. Nc3 - development.",
        "13... Rd8 14. Bc2 Be6 15. Qxd6 Rxd6": "15. ....... Rxd6 - now we have a queen trade.  I now complete my development with 16. Be3.",
        "16. Be3 Rdd8 17. Rad1 h6 18. Rxd8+ Rxd8": "18. ........ Rxd8 - now we have a rook trade.",
        "19. Rd1 Rxd1+ 20. Bxd1": "20. Bxd1 - and another!",
        "20... Nd7 21. Nd2": "21. Nd2 - you would not think I would be struck down by passivitis from here would you ........",
        "21... Nd4": "21. ......... Nd4 - think again!  Look how powerful that horsie on d4 looks.",
        "22. b4": "22. b4 - looked good at the time, trying to prevent Nc5 but my opponent has ways of working his knight into my position.",
        "22... f5 23. f3 Kf7 24. Ne2 Nb6 25. exf5 Bxf5": "25. ...... Bxf5 - pawn trade.",
        "26. Nc1 Nd5": "26. ...... Nd5 - don't those horsies look nasty!  I now decide to give up Fou Lenoir for one of them.",
        "27. Bxd4 exd4": "27. ....... exd4 - although black's d pawn is passed at least it is an isolani.",
        "28. Bb3 Be6 29. Bxd5 Bxd5": "29. .......... Bxd5 - this time Fou Leblanc departs for the remaining horsies.  2 knights against two bishops is a disadvantage I am told in an endgame.  How much of a disadvantage I am about to find out.",
        "30. Nd3 Ke7 31. Kf1": "31. Kf1 - Henry must centralise himself as much as he can.",
        "31... b6 32. Ke1 a5 33. bxa5 bxa5": "33....... bxa5 - pawn trade.",
        "34. Kd1 Kd6 35. Kc2": "35. Kc2 - to try and prevent the enemy king from snatching off my a pawn.",
        "35... g5 36. g4": "36. g4 - I try and close off one bishop's diagonals as much as possible.",
        "36... Ke7": "36. ...... Ke7 - a king retreat, mmm, this retreat gives me something to consider ........",
        "37. Kb2": "37. Kb2 - a DRAW OFFER! Surprisingly my opponent accepts it.  Was this good draw offer bad acceptance or the other way round.  You the jury decide."
    },
    "url": "https://gameknot.com/annotation.pl/2-knights-v-2-bishops-endgame?gm=22953",
    "gameName": "2 Knights v 2 Bishops Endgame",
    "players": "jstevens1 (1771) vs. grandad22000 (1849)",
    "opening": "Sicilian (B31), Nimzovich-Rossolimo attack, Gurgenidze variation"
}