{
    "moves": {
        "1. d4": "This was round 4, at which point I had 2 wins and a draw.  I felt pretty confident up to this point as I had outplayed my opponents in every game.  I was a little surprised to see 1. d4 as most everyone in the premier was playing 1. e4.",
        "1... Nf6 2. c4 e6 3. Nc3 Bb4": "The Nimzo-Indian, seeking to control e4 with pieces is my workhorse against 1. d4.",
        "4. Qc2": "The Classical variation.  White's other options are 4. a3, 4. f3, 4. Nf3, 4. e3, 4. Qb3 and 4. Bg5.",
        "4... Nc6": "The most common continuation is 4...d5.  This move immediately attacks the weakened d-pawn.  This variation is known as the Milner-Barry or the Zurich.",
        "5. Nf3": "The most flexible move.  5. e3 is too passive.",
        "5... d6": "Preparing to erect a dark-squared center after the exchange on c3.",
        "6. Bd2": "White wants to recapture with the Bishop as to increase pressure on e5.",
        "6... O-O 7. e3": "This move is a little suspect.  The standard continuation is 7. a3 Bxc3 8. Bxc3 Qe7, when White has his choice of 4 different continuations.  9. g3, 9. e3, 9. e4, or 9. b4.",
        "7... Qe7 8. Be2": "This is a little passive also.",
        "8... e5": "No reason to wait.  Black should be equal here.",
        "9. d5": "Gaining space, but closing the center and imprisoning his light-squared bishop.  9. de Nxe5 is followed by ...b6 and ...Bb7, with a good game for black.",
        "9... Nb8": "Preparing to reroute the knight via a6 to c5.  I am behind in development, but there is no way for white to open the position quick enough to exploit his lead.",
        "10. e4": "Looks imposing,, but this just gives me a hook on f5 and a target to take aim at.",
        "10... Na6": "Aiming for c5 and the new target on e4.",
        "11. a3": "Finally provoking the exchange and creating a weakness on b3.  With the closed nature of the position my knights should be better than White's bishops.",
        "11... Bxc3 12. Bxc3 Nc5 13. Nd2": "Now the knight takes up a passive defense.  After 13 moves, Black has not only equalized, but is better.",
        "13... a5": "Intending 14...a4, when c5 is under absolute control.",
        "14. O-O-O": "This hyper-aggressive continuation can't be good for White.  While it is true that Black's most natural plan is to play ...Ne8 or ...Nh5 followed by ...f5 and a kingside attack, White ignores the fact that his most dynamic play will be on the queenside.  Here is trying to drum up kingside play and allows me time to target the weakened queenside.  White's king is more vulnerable on the queenside and my solid defensive formation on the kingside wont be easy to crack.  Especially with the two bishops and the knight placed passively.",
        "14... Bd7": "Intending ...Ba4; b3 Bd7!; followed by ...a4.  If I am allowed to exchange the a-pawn for the b-pawn, the a-file will open up for my heavy pieces and the White king will be under rapid attack.",
        "15. Rdg1": "Preparing to launch the kingside pawns and moving the rook out of the aforementioned skewer.",
        "15... Ba4": "Attempting to induce more weaknesses in the queenside pawn structure.",
        "16. b3 Bd7 17. g4 a4 18. b4 Nb3+": "Inviting White to capture the knight and a-pawn, when the a- or e-pawn drops and the a-file is opened for my rooks.",
        "19. Kb1": "Keeping the queenside closed is White's best chance.",
        "19... Nd4": "Offering the centralized knight to open the e-file.  Dynamic play in the face of the oncoming attack was a must, but Fritz seems to think that it is a little too risky.  There probably is compensation for the weak pawn on d4 after the exchange, but how much is a matter of debate.",
        "20. Qd1 b5": "Again attempting to create a breach.",
        "21. g5 Ne8 22. h4": "Here 22. Bxd4 ed 23. cb f5 24. gf Nxf6 is questionable for Black.  White does have the extra pawn and seems he might be able to hold on to it.",
        "22... f5": "A final attempt to open some lines for my pieces.",
        "23. gxf6 e.p.": "Accepted at last!",
        "23... Nxf6 24. Rg5 Nxe2": "I dont want the light-squared bishop going to d3 and having White play f4.  That plan looked like it would be a little to dangerous for my tastes.",
        "25. Qxe2 Kh8": "...Rf7 is stronger.",
        "26. Rhg1 Rf7 27. h5 Rb8": "Planning to take on c4 and play Bb5 if the pawn was recaptured.",
        "28. Nf3 Rbf8": "Threatening ...Nxe4.",
        "29. Nh4": "Preventing the loss of the pawn by guarding f5, however, I came up with an interesting idea.  Better for White, and missed by both of us was 29. Nxe5! dxe5 30. h6! Rg8 31. Rxe5 Qf8 32. f4 and Black is in trouble!",
        "29... Ng4": "Forcing the trade of a rook and a pawn for two minors and getting freedom for my heavy pieces seems like good compensation.",
        "30. Rg5xg4 Rf7xf2": "An important intermezzo.",
        "31. Qd1": "Better is Qd3.",
        "31... Bxg4 32. Qxg4": "The first big blunder by White.  He missed 32. Rxg4 Rf1 can be met with 33. Be1, holding the game together.",
        "32... Rf2f4 33. Qg3 Rxh4 34. Bd2 Rxh5 35. Bg5 Rxg5 36. Qxg5": "Here I just had to play 36...Qxg5 37. Rxg5 bc and the win was in the bag.  However, I fell into my opponents rhythym of quick play and got a little too tricky for my own good.",
        "36... Rf1+": "?????",
        "37. Rxf1": "Resigns.  I didnt pay enough attention to my back rank."
    },
    "url": "https://gameknot.com/annotation.pl/2007-wa-open-premier-section?gm=8058",
    "gameName": "2007 Wa Open Premier Section",
    "players": "Kerry Xing (1704) vs. Brian Opalewski (1804)",
    "opening": "Nimzo-Indian (E33), classical, Milner-Barry (Zurich) variation"
}