{
    "moves": {
        "1. Nf3": "On to round two of the 2007 Alabama State Championship. Feeling a little lucky after escaping round one with the full point, I approach this game with a fresh attitude and my new pet 1. Nf3.",
        "1... d6": "?! We could debate the pros and cons of this move forever, but I question it on many levels. Suffice it to say that I felt this move a provacative insult, fully deserving to be punished as soon as possible.",
        "2. d4": "Logical development which also hits e5.",
        "2... e6": "?! Another move that just begs to be punished. Time for a big center and rapid development.",
        "3. e4": "Of course.",
        "3... h6": "?  I'm trying not to actually salivate on the board. I have no idea what my opponent is thinking, but I am hoping that he continues to think it. ",
        "4. c4": "Laying claim to a HUGE center.",
        "4... c6": "? Black has shown me nothing so far. I guess he decided to just hunker down to defend my first attack. I have determined that this game is gonna be 100% offense for me. With my huge space advantage and lead in development, I figure this to be a very entertaining attack.",
        "5. Nc3 Qc7": "I have no idea.............",
        "6. Bd3": "Prepping e5 which opens lines if he 0-0.",
        "6... g5": "? Ugly. Six moves in and black has yet to develop a knight or bishop, and 6...g5 just opens up real estate around his king. This is gonna be fun:)",
        "7. e5": "My LSB is now a righteous dude.",
        "7... Nd7": "Keep your eyes on this knight. He sits right here on d7 for the next 14 moves:)",
        "8. exd6": "?! Perhaps not my best, as this move allows black to develop. However, I'm thinking Ne4 holds promise.",
        "8... Bxd6 9. Ne4": "The primary goal of this move is to immediately threaten capture on f6 if he moves a knight there. The second goal of this move is to trade knight for bishop on d6, then play an eventual Ne5 blockading his e pawn (which by proxy blockades his LSB). If I can accomplish this, then I should have some really good attacking lines on the kingside.",
        "9... Bb4+": "It never even occured to me that black would be willing to trade dark squared bishops. His looks so much better than mine.",
        "10. Bd2 Bxd2+ 11. Qxd2 Qf4": "?? Now he wants to trade queens and double his f pawns? I'm drooling again.",
        "12. Qxf4": "Ok - you asked for it. I swear by all that is holy that Nd6  is coming next.",
        "12... gxf4 13. Nd6+": "I'm reminded of the Marcellus Wallace line from 'Pulp Fiction'. You know, the one about getting medeival:)",
        "13... Ke7": "?! Kf8 looks so much better here.",
        "14. c5": "Creating a nice post in a roundabout kind of way.",
        "14... Ngf6": "Finally entering the fray, and looking to post up on d5.",
        "15. Ne5": "This was just too pretty to pass up. Even if 15. NxN, after the exchange of minor pieces I'll still be able to castle, center my rooks, and exploit the fact that his king is in the center and he has vulnerable kingside pawns. If nothing else I'm now double tapping his weak f pawn.",
        "15... Ne8": "Attacking my strengths in order, black looks to expel my Nd6.",
        "16. Nexf7": "Winning a pawn while hitting his rook.",
        "16... Nxd6": "? Rf8 was better.",
        "17. Nxh8": "Winning the rook and threatening further carnage.",
        "17... Nf5": "?! Nf7 should have been considered further.",
        "18. Bxf5": "With a comfy lead in material, space, and time, I simplify and leave black yet another liabilty.",
        "18... exf5 19. Ng6+": "Getting out of the corner and threatening to win another pawn.",
        "19... Kf6 20. Nxf4 Kg5": "?? Just horrible. Look at black's undeveloped pieces.",
        "21. Nd3 Nf6": "Black gets a breath of fresh air, and finally has the chance to develop.",
        "22. h4+": "There is no way I am going to give black time to start coordinating anything, so I get his king moving again.",
        "22... Kg6 23. f3": "Defending e4 and g4.",
        "23... Nd5": "Black reaches the natural home for his knight, and for the first time I invest a little thinking time to ensure I nail this thing down the right way.",
        "24. O-O-O": "Ok, his knight has a little mobility, but I can counter it. With this move, I coordinate my pieces and prepare to launch.",
        "24... b5": "I long ago quit trying to understand some of my opponents moves. I'm guessing he hoped I would capture e.p. Who knows?",
        "25. Ne5+": "Time to win another pawn.",
        "25... Kf6 26. Nxc6 Ba6": "Black finally gets somewhat developed, but Bd7 was stronger.",
        "27. Rhe1": "Claiming the open central file and preparing to go on a king hunt.",
        "27... Nf4": "All threats this knight delivers are easily squashed by..........",
        "28. g3": "Not fearing Ng2 as Re2 wins a piece. ",
        "28... Nd5": "Maybe Ne6 here. I'm not sure.",
        "29. Re5": "Delivering a forced move.",
        "29... Nc7 30. Rde1": "Black is about to feel some serious pain.",
        "30... Rc8": "This rook is pretty woeful. Rg8 was the only other real choice.",
        "31. Nxa7": "Why not? Don't cost nuthin'............",
        "31... Rd8": "Eying the weak d4 pawn.",
        "32. Nc6": "Protecting the weak pawn and threatening more squares around the enemy king.",
        "32... Rd7": "It's tough to find a better move here. Bb7 may have accomplished more.",
        "33. Re5e7": "Looking to further simplify.",
        "33... Rxe7": "Black should keep pieces on the board. This move only aids white.",
        "34. Rxe7 Nd5": "Black is in bad shape. This natural looking move really doesn't accomplish as much as black wishes it would.",
        "35. Ra7": "?! Again, not my best. Yes, I'm attacking an unprotected piece, but I only force it to a better square.",
        "35... Bc8 36. Kd2": "Ok, this may take a wee bit longer than I expected. I make this move simply to keep him out of e3.",
        "36... h5": "Be6 is gonna have to be played, so why not now?",
        "37. f4": "Locking the kingside while further hindering his bishop.",
        "37... Be6 38. Nd8": "Looking for any chance to trade down.",
        "38... Ne7": "Here I see the win. Trade down all pieces and win a simple pawn majority endgame.",
        "39. Nxe6": "One defender gone..........",
        "39... Kxe6 40. Rxe7+": "Two defenders gone.........",
        "40... Kxe7 41. Kc3": ".....and black resigned. I felt pretty good about this game, and was very happy to be at 2/2 so far. Now it's off to lunch and a little break. Gotta refuel and get ready for round three!"
    },
    "url": "https://gameknot.com/annotation.pl/2007-alabama-state-championship-rd-2?gm=10114",
    "gameName": "2007 Alabama State Championship (rd #2)",
    "players": "Thomas G. (1419) vs. Richard E. (1400)",
    "opening": "Reti opening (A04)"
}