{
    "moves": {
        "1. d4": "Every one of these matches has been started 1. d4. Neither player willing to take the risk of the generally more tactical 1. e4\nI wont bother putting in all the complicated computer generated variations, if you wish to do this then by all means leave comments, otherwise just enjoy the game",
        "1... Nf6 2. c4 e6 3. Nc3 Bb4 4. Qc2": "Nimzo-Indian, classical variation",
        "4... d5 5. cxd5 Qxd5": "Taking with the pawn leads to sharper variations, although I initially was surprised by the move, it is played in about half the games in this position.",
        "6. Nf3 Qf5": "All very standard pre-prepared opening theory, black allows white to double the f-pawns, but gains pressure on the e4 pawn",
        "7. Qb3": "A more unusual move according to the database",
        "7... Nc6": "Rather than retreat the bishop Kramnik protects it, and exerts pressure on the d4 pawn",
        "8. Bd2": "Unpinning the knight",
        "8... O-O 9. h3": "Preparing g4",
        "9... b6": "Aiming to fianchetto the bishop and exploit weaknesses along the a8-h1 diagonal if Anand playes g4",
        "10. g4": "Played anyway",
        "10... Qa5 11. Rc1": "Giving the option of recapturing with the rook",
        "11... Bb7": "As planned, perhaps threatening Nxd4 since f3 knight will be pinned to the rook",
        "12. a3 Bxc3 13. Bxc3": "Protecting the pawn on d4 and attacking the queen",
        "13... Qd5": "No other safe squares, but this prompts a queen exchange which would normally lead to a fairly boring game.",
        "14. Qxd5 Nxd5 15. Bd2 Nf6": "Again threatening Nxd4. Though Anand would have the threat Rxc7 once the knight moves.",
        "16. Rg1": "Puts the rook on a good file, and removes the pin",
        "16... Rac8": "Kramnik removes the pin on his knight",
        "17. Bg2": "Another simple threat with Ne5",
        "17... Ne7 18. Bb4 c5": "Rather than passively defend the knight with Rfe8, Kramnik sac's a pawn in exchange for a good attack through the centre",
        "19. dxc5 Rfd8 20. Ne5 Bxg2 21. Rxg2 bxc5 22. Rxc5 Ne4 23. Rxc8 Rxc8": "After all those exchanges we will see Anand having to retreat all his pieces into defensive positions",
        "24. Nd3 Nd5 25. Bd2 Rc2": "This looks very dangerous to me. But according to expert analysis Anand should hold this position, and then be able to utilise the extra pawn",
        "26. Bc1 f5": "Kramnik continued to attack",
        "27. Kd1": "Driving the rook away, already Kramniks apparently strong attack has wilted, and white should now push his e and f-pawns to kick the knights away",
        "27... Rc8 28. f3 Nd6 29. Ke1 a5 30. e3 e5 31. gxf5 e4": "Sacrificing a second pawn in a bid to continue the attack",
        "32. fxe4 Nxe4 33. Bd2 a4 34. Nf2": "Drives away the e4 knight, as Kramnik wont want to exchange pieces at 2 pawns down",
        "34... Nd6 35. Rg4": "Attacking the weak a4 pawn, and driving the knights out of the centre. With 2 pawns in the centre, Anand will be looking to push one to promotion",
        "35... Nc4 36. e4": "Already it looks ominous for Kramnik",
        "36... Nf6 37. Rg3 Nxb2": "Picks up the free pawn, but leaves the knight a long way from preventing the e and f-pawns being pushed up the board",
        "38. e5 Nd5 39. f6": "The g7 pawn is pinned",
        "39... Kf7 40. Ne4": "Threatening Nd6 forking rook and king",
        "40... Nc4": "Defending the d6 square",
        "41. fxg7 Kg8": "Apparently Rg8 gives white an easy win",
        "42. Rd3": "I had thought that Nf6 would be strong followed by a knight exchange then Bh6. Anand saw a better continuation however, I'll trust his judgement",
        "42... Ndb6 43. Bh6 Nxe5 44. Nf6+ Kf7 45. Rc3": "A wonderful move to finish with, a classic deflection strategy to allow his g-pawn to promote.",
        "45... Rxc3 46. g8=Q+ Kxf6 47. Bg7+": "With a clear win."
    },
    "url": "https://gameknot.com/annotation.pl/2008-world-championship-match-bonn?gm=19364",
    "gameName": "2008 World Championship Match, Bonn",
    "players": "V Anand (2783) vs. V Kramnik (2772)",
    "opening": "Nimzo-Indian (E35), classical, Noa variation, 5.cd ed"
}