{
    "moves": {
        "1. d4": "I had played this opponent many times and know that he is a very tactical player, so I opened with d4.",
        "1... d5 2. c4 e5": "The previous day, out of pure curiosity, I had asked my opponent if he had ever played the Albin Counter-Gambit, knowing that he loves gambits, and he replied that he had. I had actually studied it recently, unfortunately, I didn't remember much beyond White's first five moves.",
        "3. dxe5 d4 4. Nf3 Nc6 5. g3": "This was as far as I was comfortable; after this, I started spending a lot of time on my moves.",
        "5... Bf5 6. a3": "Bg2 is more common here, and probably is a better move, but I did not feel comfortable with 6.Bg2 Nb4 7.Na3 d3!?, which IM Andrew Martin admits is unclear.",
        "6... Nge7 7. Bg5": "Bg2 may still have been more to the point. This moves seems to help Black develop more than White.",
        "7... h6": "Practically forcing me to give up the bishop pair.",
        "8. Bxe7 Bxe7 9. Bg2 d3": "As expected. If I take the pawn, castling will be very difficult to me, and my king will be stuck in the center against an attack specialist with the bishop pair. ",
        "10. e3": "I decided I would try to pressure Black's d-pawn and prove that it had overextended itself.",
        "10... O-O 11. O-O f6": "While this move is often thematic in the Albin, here the weakening of the a2-g8 diagonal seems to lose a lot of time and allow White to recapture the initiative. Black tends to play this before he has castled, the next few moves show why.",
        "12. Nh4 Bh7 13. Bd5+ Kh8": "At this point, I had 1 hour and 24 minutes remaining, and my opponent still had 1 hour and 50 minutes left.",
        "14. e6": "Now I also have a pawn on the 6th rank! Although I knew that this pawn would be weak, I felt more comfortable with this move given that I was already a pawn up, and I knew it would disrupt Black's development. Often, a pawn on the sixth rank can have an effect on the opponent's position similar to dividing his position in two, and that was one of my major goals here.",
        "14... Ne5 15. Nf3 c6": "Unfortunately, I cannot keep my strong bishop on d5, which had protected the e6 pawn and limited the scope of the Black queen on the d-file.",
        "16. Nxe5 fxe5 17. Bg2": "I realized that Black would then play e4 to make the d3 pawn a connected passed pawn, which forced me to change my plan - I would now attack the e4 pawn, hoping that once it left the board, the d3 pawn would be fatally weakened.",
        "17... e4 18. Nc3": "The pawn cannot be maintained.",
        "18... Bf6 19. Nxe4 Bxb2 20. Rb1 Bxa3 21. Rxb7 Re8": "So the smoke has cleared. I have a rook on the powerful 7th rank, I still have an extra pawn, but the pawn on e6 is going to fall at any moment, and Black has an outside passed pawn that could prove very difficult to stop, especially in an endgame where the rook on a8 protects it. I thought for awhile here, and decided that my top priority needed to be stopping the d3 pawn.",
        "22. Qa4": "Accordingly, I cleared the d1 square for the rook, hoping to do so with tempo in the event the attacked bishop move. This didn't end up happening because of Black's next move.",
        "22... Rxe6 23. Qxa3 Bxe4": "I was okay with this, because Black's bishop had been supporting the d3 pawn.\nAt this point, I had 59 minutes remaining, and Black still had 1 hour and 40 minutes.",
        "24. Bxe4 Rxe4 25. Qc3": "This mating threat forces Black to move either his rook or queen into a defensive position to defend g7. At this point, I could tell that my opponent was getting frustrated with his position.",
        "25... Re7 26. Rxe7 Qxe7 27. Qxd3": "One passed pawn down, another still to go.",
        "27... Rd8 28. Qb3 Qc5 29. Kg2 Rd2": "Grabbing the pawn gave Black a lot of counterplay. I was starting to get nervous here. Although I was up a pawn, Black had an outside passed pawn that I wasn't sure how to stop, and his pieces were very aggressively placed, aiming straight at my king.",
        "30. Qb8+": "I saw that I likely had a perpetual check with Qb8  Kh7 Qb1 , and I was seriously considering taking it here. I decided to make the first move of it so I could see what to do from there.",
        "30... Kh7": "The first day of the tournament had been rough for me, and I had lost about 20 rating points. I realized that I could get them all back if I won this game, and I could also tell that my opponent did not like his position. I decided to keep pressing.",
        "31. Qf4 Rd6": "I think it was here that my opponent offered me a draw. I had already made the decision to play for a win, and I was sticking with it. I knew that my opponent did not offer draws in positions he thought were unclear, so this must have meant that he was nervous. I realized I had the psychological edge here.",
        "32. Qe4+ Kg8 33. Rb1": "Qe7 followed by Rd1 would have won material here.",
        "33... Rd8 34. Rb7 Rf8 35. Qg6": "At this point, I had 38 minutes remaining. Although I had a lot of pressure on the critical g7 square, Black was starting to develop threats of his own against the f3 square.",
        "35... Qe5 36. Qxc6": "After the game, my opponent told me that taking this pawn gave him a lot of counterplay. However, I saw no better move. I didn't like 36.Qxa7 because of the reply ...Qb2.",
        "36... Kh8": "White now needs to be careful not to leave the rook undefended and lose it to ...Qe4 .",
        "37. Qd5 Qf6 38. f3": "I now had 32 minutes left.",
        "38... Qc3 39. Qd4": "I do not believe that I could have won this game without these mate threats. I was now trying to trade queens and make my pawn plus count, but with so many checks available to Black, this was not so easy of a task.",
        "39... Qc2+ 40. Kh3 Qf5+ 41. Qg4 Qe5 42. f4 Qa1 43. Qe2": "I thought that ...Qf1  Kh4 g5 was threatened here, not realizing that after Kh5, Black has no queen checks.",
        "43... Qa6 44. Qb2 Qe6+ 45. Kg2 Rg8": "Finally defending against the mate threat, but also taking away an escape square from the queen, which becomes important later.",
        "46. Qd4 Qc6+ 47. Qd5": "24 minutes remaining.",
        "47... Qa6 48. Rd7 Qa2+ 49. Kh3 Qe2 50. Re7 h5": "This move seems to fatally weaken Black.",
        "51. Qg5 a5 52. Ra7": "Black's queen cannot leave the h5 pawn undefended upon pain of mate, and Qf1  leads simply to Kh4. I was down to 20 minutes here (while my opponent had 57 minutes), but I felt like I was finally almost out of the woods.",
        "52... Qf3 53. Rxa5 Re8 54. Qxh5+": "Now that the queens are coming off, the rest should be simple for White. Black resigned here, and I breathed a sigh of relief."
    },
    "url": "https://gameknot.com/annotation.pl/2008-free-missouri-class-championships?gm=17154",
    "gameName": "2008 Free Missouri Class Championships",
    "players": "Holmes, Dan (1618) vs. Dutiel, Tony (1889)",
    "opening": "QGD (D09), Albin counter-gambit, 5.g3"
}