{
    "moves": {
        "1. e4 e5 2. Nf3 Nc6 3. Bc4 Bc5": "My opponents generally respond with 3...Nf6  And, I used to answer with 4.Nc3 to defend the pawn, but cplusplus11 accurately noted that 4.0-0 is the way to go, for after 4...Nxe4 white wins the pawn back starting with 5.Re1 which also centralizes the R.  This, as elyhim previously noted, is important for central control.  However, Shakhriyar played something else.",
        "4. c3": "Having said that, this is what I also would've done.  Even though I didn't like reversion, he accurately mentioned that the idea behind this move is that it prepares for d4 on the next move.  Of course, what he was alluding was in the Spanish Opening with 3...Bc5, but the same thing applies.",
        "4... Nf6": "Likewise, this is how Shakhriyar answered, and this move has been played against me.  ",
        "5. d3": "But, I'm surprised to see this move played since it limits the mobility of Maxime's Bc4.  I either would've castled, or threatened f2 with 5.Ng5 as I've also done before.  Nonetheless, this still protects and also prepares to pin his Nf6.",
        "5... d6": "Preparing to open up a line for his Bc8.  But, Maxime will waste no time in castling.",
        "6. O-O h6": "Preventing 7.Bg5 or 7.Ng5.  I don't see the point in preventing it because if Maxime brings his Nf3 up there, Shakhriyar has 7...d5.",
        "7. Re1": "Centralizing his R which is good, but Shakhriyar is about to castle, as well.",
        "7... O-O 8. h3": "Also black's Bc8 or Nf6 from landing on g4.",
        "8... a5": "At the time, I didn't see why a really strong player would play this or what it achieved.  But, deeper_insight said that this is generally played to open a file for the R.  So, it's now a semi open file for a R which is, indeed, a good strategy.  As now, it can come down and move about giving it more mobility which can become very important later on.",
        "9. Nbd2": "Continuing with his development.",
        "9... Be6": "As does Shakhriyar.",
        "10. Bb5": "I'm not sure why Maxime played this since he's not going to exchange N for B.  As that would be my only reason for playing a move like this.  So, I'd think if exchanging would work, and I refrain from it.  And, given that Maxime doesn't exchange, then one thing is for certain.  White LSB is more active then Shakhriyar's Nc6.\n",
        "10... Qb8": "I don't see the point behind this move because all I see is that it allows 11...Qa7 with which Maxime has an easy answer to.",
        "11. Nf1": "In fact, he starts right here, as now, he'll attempt an exchange which will work to stop the threat.",
        "11... Qa7 12. Be3 Bxe3 13. Nxe3 Ne7": "The idea is bringing the N to a stronger square.  But, I don't anything, except for ...Ng6, and I wouldn't want to play it because that would leave both N's cramped.",
        "14. a4": "As with black, Maxime opens a semi file for his R.",
        "14... Rad8": "As with white, Shakhriyar also centralizes one of his R's.",
        "15. Bc4": "I'm not sure why Maxime wanted an exchange, but I wouldn't have played.  As I wouldn't see a good reason for doing it.  As it looks like white exchanged just because it's possible to do so.  Yet, I know that this is not the reason since it's not correct to do so.  So, I'm not sure what it was about white's B and black's Be6 that the opposing side didn't like.",
        "15... Bxc4 16. Nxc4 Nd7": "I understand this move even less since Shakhriyar isn't going to place his N on b4, and I don't like where it is now.",
        "17. d4": "Going for a center break since Maxime threatened to exchange right in the center.  As I learned, this attempt often gives the person that advanced in the center first an advantage.",
        "17... Qa6": "Going after Maxime's Nc4.  So, there's got to be something about it that made it overwhelming for Shakhriyar since he didn't like the N where it was.",
        "18. Ne3 Rfe8": "Centralizing his other R.",
        "19. Qc2": "Getting his R's connected, once and for all.  But, I, however, would've continued with 19.dxe5 since Shakhriyar is going to exchange with the same pawn.",
        "19... exd4 20. Nxd4 c6": "Preparing to go after Maxime's Nd4.",
        "21. Ndf5": "But, he has none of that and threatens to exchange instead.  Not surprisingly, Shakhriyar refuses.",
        "21... Nf6 22. Rad1": "Likewise Maxime also centralizes his other R, whilst attacking d6 which Shakhriyar will protect on the next move..  So, that makes the center under complete control by both sides.",
        "22... Nc8 23. f3": "Getting a solid pawn chain.",
        "23... d5": "Shakhriyar ties to stop it by threatening an exchange of pawns, but Maxime refuses.",
        "24. Qf2 Re6": "Preparing to double up.  ",
        "25. Qg3": "But, Shakhriyar puts a stop to it.  And, when he does they exchange, and white winds up a pawn ahead.  That's why I'm a little less surprised to see the outcome of this game then the outcome of the previous game since neither player lost anything, including a pawn.",
        "25... Ne8 26. exd5 cxd5 27. Nxd5 Kf8": "Putting a stop to 28.Nfe7+ or 28.Nde7+ which would've causes serious problems for Shakhriyar.",
        "28. Qh4": "But, the pressure is still on for Shakhriyar since, for example, the R's attacked, anyway.",
        "28... Rd7 29. Nde3": "Keeping on the pressure by attacking again.",
        "29... Ncd6": "Trying to alleviate the pressure by interposing.",
        "30. Nd4": "But, Maxime sees right through it, as Ken did with me.",
        "30... Re5 31. Ng4 Rd5 32. Ne5": "And, Shakhriyar resigned here.  Although I don't see how Maxime can win yet, I learned just from the fact, that he'll, eventually do that since GM's see things that we don't.  With that being said, the pressure has become too much for white to handle."
    },
    "url": "https://gameknot.com/annotation.pl/2019-riga-grand-prix-2019-game-2?gm=66724",
    "gameName": "\"2019 Riga Grand Prix 2019 - Game 2\"",
    "players": "Vachier-Lagrave, Maxime   vs. Mamedyarov, Shakhriyar ",
    "opening": "Giuoco Piano (C53)"
}