{
    "moves": {
        "1. d4 Nf6 2. c4 g6 3. Nc3 Bg7 4. e4 d6 5. Nf3 O-O 6. Be2 e5 7. O-O Nc6 8. d5 Ne7 9. Ne1 Nd7 10. f3 f5 11. g4": "Benko Attack!",
        "11... Nf6": "And here My opponent took some thought what to play. \nIn postmortem he asked if played the right move. ",
        "12. Bg5": "And here I was out of book and loss for ideas...",
        "12... f4 13. Nd3 h5 14. h3 Nh7 15. Bh4 Bf6 16. Qe1 Ng5": "And here Black plays for fork x-ray tactic. \n",
        "17. Kg2 Kf7": "!?",
        "18. Rh1": "anticipating pawn exchanges and rook on the h-files. ",
        "18... Ng8 19. Bf2": "getting away from any tactics...",
        "19... Nh6 20. h4": "?\nerror on my play",
        "20... Nxf3 21. Bxf3 hxg4 22. Bd1 g3": "In postmortem, Black said he didn't seen anything in Pawn-f3 check and what to follow up.",
        "23. Bxg3 fxg3 24. Qxg3 Rh8 25. c5": "Queen-side expansion as Black current attack has stalled.",
        "25... Rh7": "!\nAnd this was smart.\nBlack is focused on Rg7 pinning Queening to King and winning.\n",
        "26. cxd6 cxd6": "It was here I thought of Nxe5 check...",
        "27. Rc1": "!\nRook on the open c-file will pay off!",
        "27... Ng8": "Black triple attacks on Pawn-h4",
        "28. h5 Rg7": "gxh5; Bxh4+...Any King move; and my position is holding.\nI was a bit shaky at this moment.\n",
        "29. h6": "forced..",
        "29... Rh7 30. Nb5": "And White's queen-side expansion is in play...\n25. c5; 27. Rc1; 30. Nb5\nThese ideas are very common in King's Indian",
        "30... Rxh6 31. Rc7+": "!\nWhite's attack commences.",
        "31... Be7": "In postmortem Black said this is better than any King move.",
        "32. Rxh6 Nxh6": "And here I assess that Black's Knight-h6 is out of play and not doing anything.\nWhite has to attack now or wind up losing his Rc7 with a6",
        "33. Nxe5+": "Knight sacrifice with check!\nMy opponent stated he didn't see this",
        "33... dxe5 34. d6": "My plan.\nMy bishop can move with check, his Bishop is pinned.\nIn postmortem he said maybe Qxe5 is more forcing.\nI liked my pawn attacking more than this....plus my knight is hanging and \nthe pawn push protects my Rook too!",
        "34... Bd7 35. Bb3+ Kf6": "??",
        "36. Qh4+": "!!\nWhite is winning.\n\nBlack's Queen-side Rook is undeveloped and Bd7 has only moved once and like I stated earlier Knight -h6 is out of play",
        "36... Kg7 37. dxe7": "Best!",
        "37... Qh8": "Black stated his only move?\nQe8 leads to Knight-d6 and queen-b8 leads to blocking in his own Rook.",
        "38. Rxd7 Re8 39. Nd6 b6 40. Nxe8+ Qxe8 41. Rd8 Qb5 42. e8=Q": "I wonder if e8=Knight+ leads to mate?",
        "42... Qe2+ 43. Kg1": "The King takes a walk",
        "43... Qe3+ 44. Kf1 Qf3+ 45. Ke1 Qe3+ 46. Kd1 Qf3+ 47. Kc2 Qe2+ 48. Rd2": "Black Resigns.."
    },
    "url": "https://gameknot.com/annotation.pl/2019-oregon-open-round-3?gm=67204",
    "gameName": "2019 Oregon Open Round 3",
    "players": "freeman (1593) vs. Bob L (1561)",
    "opening": "King's Indian (E99), orthodox, Aronin-Taimanov, Benko attack"
}