{
    "moves": {
        "1. d4": "1.d4. I´m more of an e4 player, and when playing black I always defend with the Sicilian defense. But anyways Any time I see d4 I immediately go with... ",
        "1... Nf6": "1...Nf6. ",
        "2. c4 e6 3. Qb3": "This was my first surprise, I though I would see the traditional 3.Nc3. I just followed the book here.",
        "3... d5 4. Nc3": "I think more common is 4.Nf3",
        "4... c6 5. Nf3 Bd6": "I liked this move, trying to get control of the h2-b8 diagonal, and also supporting the e5 advance, although I was expecting a move like 6.c4 to follow. ",
        "6. c5": "and here it is. ",
        "6... Bc7": "always controlling the same diagonal. ",
        "7. e3 Nbd7": "Another supporter for the e5 advance, and with the option to maybe play b3 later on the game. ",
        "8. Bd3 O-O 9. O-O Re8": "Another one, Its time to advance the pawn. ",
        "10. Bb1": "This bishop move looks kinda awkward, I think he was doing a good job on d3, I knew he wanted to form a battery along the b1-h7 diagonal as soon as he played this move. ",
        "10... e5": "here it comes. ",
        "11. Qc2": "And here is the battery, but its useless unless he find the way to get rid of my knight at f6. But a move like 12.Ng5 could be hard to deal with. when the only defense against it would be g6 if I don't wanna lose a pawn.  Maybe best here was 11.Re1 followed by his own advance of the e pawn. I was thinking now to play h6...",
        "11... e4": "but i instead decided to advance my pawn, preventing any kind of threats along the b1-h7 diagonal, and freeing the scope for my bishop at c2",
        "12. Ne1 Bxh2+": "And here comes the sacrifice, only because i was able to get rid of the white knight at f3 I was encouraged to go ahead and do it. ",
        "13. Kxh2": "The sacrifice is accepted. ",
        "13... Ng4+ 14. Kg3": "If the king goes back to the back rank Qh4 would be the end of the game. Or if instead 14.Kh4 I would have then played 14...Nd-f3 and now I have a discovered check with my bishop at c1.",
        "14... Qc7+": "Okay now, I thought a lot about this move, a second sacrifice with poison on it. ",
        "15. f4": "of course the knight cannot be taken, it would lead to mate. just an example. (15.Kxg4 Nf8+  16.Kh5 g6+  17.Kg5 h6+ 18.Kxh6 Qh2+ 19.Kg5 Nh7#) its mate in every variation, so this following move is the reason I thought a lot about Qc7",
        "15... Ndf6": "freeing my bishop at c8 and threatening Nh5+",
        "16. Rh1 g6": "with the same Nh5+ intention. ",
        "17. Qe2": "Look at white pieces they are all stuck on the queen side, and almost all of them are on the back rank not to mention his rook at a1 its useless, not a good position to be in.",
        "17... Nh5+": "here it comes",
        "18. Rxh5": "I´m not sure about this move, maybe just moving his king to h3 would have been better. ",
        "18... gxh5 19. Bd2": "finally his bishop moved. but its doing nothing. but what else? he needs to untangle his pieces i guess. ",
        "19... Qe7": "taking control of the h4-d8 diagonal, with the threat of h4+",
        "20. Nc2": "again what else? all white pieces are on the back pretty far away from the king, unable to defend, unable to attack. ",
        "20... h4+": "take this",
        "21. Kh3": "the only move",
        "21... Kh8": "Ok. Now I want to occupy the half open file with my rook.  ",
        "22. g3 Nxe3+": "I think i will use that discovered check now. Thanks. ",
        "23. Kh2 hxg3+": "Now if he takes the pawn Rg8+ will follow. For example 24.Kxg3 Rg8+ 25.Kf2 (if he doesn't want to get matted) Qh4+ 26.Kxe3 (the only move) and now the simple 26...Qg3+ with mate to follow. So in order to prolong the agony he would have been forced to play Qg4. (I created a mate in 6 puzzle of it, you can check it out if you want)",
        "24. Kg1 Nf5 25. Qh5 Qf6": "just protecting my f7 pawn",
        "26. Ne1": "And now this move was the final blunder allowing me to penetrate in white position even further",
        "26... Qxd4+ 27. Kh1 Qxd2": "Keeping the king on the back rank, this is a lost game for white. ",
        "28. Bc2": "Anyways, he finally frees his rook but its a little bit too late. ",
        "28... g2+ 29. Kg1": "if 29.Kh2 then Qxf4 wins anyways",
        "29... Qd4+": "forcing him to capture the pawn. ",
        "30. Kxg2 Rg8+ 31. Kf1 Ng3+": "Black resigns at this point everything went downhill for him after my 11th move.  By the way this was not the best move... the best move here was 32...Rg1+  33.Ke2 (and only then) Ng3#.  Anyways, not the best chess but thats how my brain works. I hope you can get something out of this game. "
    },
    "url": "https://gameknot.com/annotation.pl/21-moves-of-pure-black-pieces?gm=33976",
    "gameName": "21 moves of pure black pieces",
    "players": "csxu47 (1163) vs. chapinote (1193)",
    "opening": "Queen's pawn game (E00)"
}