{
    "moves": {
        "1. e4": "Starting with e4 gives black a lot of options, but almost all lead to dynamic, exciting games.",
        "1... e5 2. Nf3 Nc6 3. Bb5": "There is a lot of variety in the Ruy Lopez.  Peterliberty enjoys competing in the exciting world of the unknown.  ",
        "3... a6 4. Ba4 d6 5. d4 exd4": "Black chooses the unexpected exd4.  The pin is relieved with b5 and should precede the d-pawn capture.",
        "6. Nxd4": "White passes the chance to capture the knight and force black to double pawns on the c-file.",
        "6... Bd7 7. O-O Nf6 8. Re1 Nxd4": "A series of simplifying exchanges begins.",
        "9. Bxd7+ Qxd7 10. Qxd4 Be7 11. Nc3 O-O 12. Be3": "This game is showing no signs of lasting 102 moves.",
        "12... b6": "Is an advance on the Queen-side coming?",
        "13. Rad1 Ng4": "Or will it be an attack on the King-side?",
        "14. Bf4 Rae8 15. h3 Bf6": "Black is choosing to apply pressure on the King-side.  Black's counter attack will be unsuccessful because white holds an advantage in the center.  ",
        "16. e5": "This forces another exchange of pieces in which black will lose a piece.",
        "16... Nxe5 17. Bxe5 Bxe5 18. Rxe5 Rxe5 19. Qxe5 dxe5 20. Rxd7": "Black is now at a material disadvantage and is facing the problem of a rook on the 7th rank.",
        "20... Rc8 21. Ne4 f6 22. g3 h6 23. f4 exf4 24. gxf4 Re8 25. Ng3 Kf8 26. Kf2 g6 27. f5 g5 28. Nh5 Re5 29. Ng3 Rc5 30. c3 b5 31. Ne4": "White needs to move the King forward in its own defense.  The move allows the tide to turn in black's direction.  Black will soon be causing serious problems for white with his King-side pawn advantage.",
        "31... Rxf5+ 32. Ke3 c5 33. Rd6 Ke7 34. Rxa6 b4 35. Ra5 bxc3 36. bxc3": "White will win the game on the Queen-side, but first must stop the King-side threat.",
        "36... Rf1": "Black is now in White's rear.  Even though White has a preponderance of force, Black has the advantage of pressure from the front and the rear.",
        "37. Ke2 Rh1 38. Nf2": "The Knight will be working hard for the remainder of the game.  There's still no sign this game will last 102 moves.",
        "38... c4 39. Ra4 Ra1 40. Kf3 Ke6 41. Kg2": "The white King must remain on the King-side in defense of that flank, while the black-King takes over in the center.",
        "41... Kd5 42. Ra5+ Ke6 43. Ng4 h5 44. Ne3 Rc1": "This move puts black in a very good position and nearly takes the white rook out of the game. ",
        "45. Ra3 Ke5 46. Nxc4+": "White fears Rc2 .  But the black King is moving into the battle and the Knight will have to do most of the fighting.  White is very uncomfortable right now.",
        "46... Ke4 47. Nd6+": "This prepares for an advance of the c-Pawn, a move which will improve white's chances considerably.",
        "47... Kf4 48. c4 Rc2+ 49. Kf1": "White's problem here is stopping the black Pawns.  The King-side Pawn is lost leaving black with two connected King-side Pawns (or two isolated pawns) and King right in the middle of them.  It is not looking good for white.",
        "49... g4 50. hxg4 hxg4 51. Nb5": "White lures the black Rook into capturing the c-Pawn.  Once the black Rook leaves the 2nd rank the white Rook will be able to depart the a-file and become more involved in the action.",
        "51... Rxc4": "Black takes the bait.  Now, perhaps white will find a way to stop the King-side attack.",
        "52. Nc3": "White plans to move the Rook to b3 and advance the pawn to a4, then return to a3 where the Rook will guard the pawn's romp to a8.  ",
        "52... g3 53. Kg2 Rc8": "White should probably proceed with his plan here.",
        "54. Nd5+": "White decides to first encourage black's forces into a dispersed rather than a coordinated pattern.  ",
        "54... Ke5 55. Rc3": "After 55. . . , Rxc3 56.Nxc3 Kd4 57.a4 the black King cannot take the knight because the a-Pawn runs to the Queening square.  He cannot defend the pawns either, because the a-Pawn is free.",
        "55... Ra8": "Black wisely declines the exchange.  ",
        "56. Nb4 Kd4 57. Rxg3 Ra4 58. Nc2+ Kc5 59. a3": "The white Pawn begins its long march to the 8th rank.  Now the game is definitely showing signs of a long struggle.",
        "59... Rc4 60. Nb4 Kb5 61. Rf3 Ka4 62. Kg3": "White now stands better and the threat on the King-side has all but dissipated.",
        "62... f5 63. Kf2 f4 64. Rd3 Re4 65. Nc2 Rc4 66. Nd4 Ka5 67. Kf3 Kb6 68. Kxf4 Kc5 69. Ke3 Ra4 70. Ne6+ Kc6 71. Nd4+ Kc5 72. Nc2 Kc4 73. Nb4 Ra7 74. Kd2 Rh7 75. Kc2 Rh2+ 76. Rd2": "White believes he can win with the Knight, Pawn and King.  They can now be coordinated.  Eventually, the Knight will have to land on c7 providing either checkmate with the Pawn on a7 or preventing the King from going to a8 and either obtaining a stalemate with no place to move or blocking the a-Pawn from promotion.  The Pawn may never reach promotion, but will be the key to winning the game.",
        "76... Rh3": "Black declines the exchange and is now fighting for a draw in the most advantageous way possible, by eliminating white's forces with a timely exchange.",
        "77. Kb2 Rg3 78. Rc2+ Kb5 79. Na2 Rh3 80. Nc3+ Ka5 81. Kb3 Rh8 82. a4 Rh3 83. Rd2 Rg3 84. Rd5+ Ka6": "White continues the march of the foot soldier and black is forced to make generally meaningless moves in the hope that white will open the door for a draw.\n",
        "85. Rc5 Kb6 86. Kb4 Rg4+ 87. Rc4 Rg1 88. a5+ Ka6 89. Rc6+ Ka7 90. Kb5 Rg5+ 91. Rc5 Rg8 92. Nd5 Rb8+ 93. Nb6": "White was hoping to land the Knight on the crucial c7 square, but the black Rook keeps getting in the way.  Oh, well, if White takes care to avoid a draw, he should be able to win.",
        "93... Rb7 94. Rc6 Rf7 95. Nc8+ Kb8 96. a6 Rf5+ 97. Kb6": "White cannot advance the Pawn to a7 forcing the King to a8 yet, because a forced exchange of the Rooks would end in a draw.",
        "97... Ka8 98. Ne7 Rf8 99. Rc7 Rb8+ 100. Rb7": "Now we are there.  100. . . , Rxb7 101.axb7  Kb8 102.Nc6     ",
        "100... Rd8": "Black declines the exchange of Rooks, but it makes no difference.  ",
        "101. Nc6": "Whatever move black makes now with his Rook, the game will end with either Rb8   or Ra7  ",
        "101... Rb8 102. Rxb8#": ""
    },
    "url": "https://gameknot.com/annotation.pl/21st-abreasts-mini-tournament?gm=19069",
    "gameName": "21st abreast's mini-tournament",
    "players": "peterliberty (1281) vs. iljadu (1519)",
    "opening": "Ruy Lopez (C71), Noah's ark trap"
}