{
    "moves": {
        "1. d4": "fatcat2 vs slockster, I have never won against fatcat2 despite having played him 22 TIMES!!!!! Maybe from this annotation you may understand why, please help me, I can't bear to lose 23 times",
        "1... f5": "I open with dutch, this was the first time I had used this opening, so perhaps I wasn't as prepared as I thought I might be, still, here goes",
        "2. g3": "White opens g pawn to allow for bishop hole, this also creates a very strong defence for the king when castled",
        "2... d5 3. Bg2 Nf6 4. c4": "white seeks to destroy my centre pawns or get them away from the centre",
        "4... dxc4": "d5? error by me, I should have stayed and held out with perhaps 4.Nc6 5.cxd5 Nxd5 6.Bxd5 Qxd5",
        "5. Qa4+": "a clever attack, regains pawn and creates powerful centre",
        "5... Bd7 6. Qxc4 c6": "allows escape route for queen ",
        "7. Bf4 Qa5+ 8. Qc3": "If you play me at chess you will probably notice that I am unhappy to trade queens so early on, mainly because I'm lazy and no queens usually results in a longer game",
        "8... Qb5": "the real aim here was to disallow white from moving his queen, for threat of Qxb2",
        "9. Nd2": "this threat however is now gone",
        "9... Ne4": "error by me, loses pawn due to bishop",
        "10. Nxe4 fxe4 11. Bxe4": "white now has a sizeable area in the centre and has devloped a lot more that black",
        "11... Bg4": "I think it needs to be more subtle, Qxe2checkmate seems to cry out",
        "12. f3 Be6 13. Bd3": "threatens queen, black is now being pushed back a long way",
        "13... Qd5": "well pushed back, horizontally",
        "14. e4": "white has now captured the centre",
        "14... Qh5": "pointless due to protection by knight on f3, black just didn't want to retreat",
        "15. g4 Qh4+ 16. Bg3 Qf6 17. e5": "queen is being bullied around the board by mere pawns and is now back to here own pawn files",
        "17... Qh6 18. Qb4": "what did white mean to achieve by this move? I'm not sure ",
        "18... Qe3+": "mind you, what did I mean to achieve from this move!",
        "19. Be2 Bd5 20. Qxb7": "Oh dear, rook is gone,",
        "20... Bc4": "checkmate dawns on e2, but it will never have a chance to take place",
        "21. Bf2": "queen is yet again forced to retreat",
        "21... Qf4": "every single move from this point on was a conditional move",
        "22. Qc8+": "now the black king is on an enivitable course that will lead to its destruction",
        "22... Kf7 23. Bxc4+ Kg6": "black has no options and little time",
        "24. Qe8+ Kg5 25. Qh5#": "and that =s how I lost yet another horrific battle against  opimus felix duos (fat cat 2) but every cloud has a silver lining....right?"
    },
    "url": "https://gameknot.com/annotation.pl/22nd-time-lucky?gm=23179",
    "gameName": "22nd time lucky?",
    "players": "fatcat2 (1426) vs. slockster (11079)",
    "opening": "Dutch defence (A81)"
}