{
    "moves": {
        "1. e4 d5": "I choose the Scandanavian, which is a favorite of mine. I find that the resulting pawn chain and knight placement are positive for black, and I play it a lot vs. 1.e4 players.",
        "2. exd5": "White accepts, with the usual thought of trying to maintain initiative and tempo.",
        "2... Qxd5": "Maintaining material balance.",
        "3. Nc3": "Developing, while chasing the queen. All pretty standard so far, and I've seen it a million times.",
        "3... Qa5": "A very standard response. With the queen on a5, I plan on playing an eventual c6 to create an escape alley for her to retreat down, all the while bolstering the center. I envision playing Bg4 after white's Nf3, and I plan on knights posted on d7 and f6, and castling short.",
        "4. Nf3 Bg4 5. Be2": "Interposing the pin, and preparing to castle.",
        "5... Nf6 6. O-O e6 7. a3": "I was a little surprised here, as I would have expected d3 or even b3. My choices now are either developing my dark squared bishop, or ensuring my queen's long term safety.",
        "7... c6": "c6 is usually a mandatory play during this variation of the Scandi. Now my queen will be around for a while if needed.",
        "8. b4": "? A big mistake.  Black can now grab a pawn while freely developing to a pretty good square. Obviously, white cannot grab the bishop for fear of losing a rook.",
        "8... Bxb4 9. Bb2": "While now a pawn down, this is a good developing move as white is seeking control of this long diagonal and possibly even considering BxN which would damage a king's potentially castled position.",
        "9... Be7": "Safely retreating while protecting the potential bishop for knight exchange I just mentioned.",
        "10. h3": "Had this move been made earlier and I had not won a pawn already, I would have played BxN (a position I have been in numerous times). However, now up a pawn, I retreat and try to keep every advantage I have.",
        "10... Bh5 11. g4": "White starts seriously slugging. While this move weakens his castled position, it is very aggressive and shows me that this guy is not scared of me at all. My compliments.",
        "11... Bg6 12. d3 Nbd7 13. Nd4": "Seeking to expand further by an eventual f4.",
        "13... O-O": "Black has now achieved every goal of the opening strived for.",
        "14. Nb3": "As I was intending to play Qc7 or Qd8 anyway, this move didn't scare me. ",
        "14... Qc7 15. Rb1": "Getting a rook to a half open file, which is good.",
        "15... Nd5": "Seeking to trade material.",
        "16. Nxd5": "White obliges.",
        "16... exd5": "Black now has a slightly better position. The king is safe, a stable pawn chain is in the works, rooks are connected, and the minor pieces are viable.",
        "17. Re1": "Seeking control of the e file.",
        "17... Rfe8": "Black seeks the same.",
        "18. Qd2 Bd6 19. Kg2 Re7": "With the aim of bolstering by moving the other rook to e8.",
        "20. Bf3 Rae8 21. Rxe7": "A little surprising, as I expected my opponent to manuever for a f pawn push.",
        "21... Rxe7 22. Re1": "Now black is faced with a problem. Get all the rooks off the board? If so, the e file will be temporarily lost. Better instead is to punish white's problem piece, the Bf3.",
        "22... Ne5 23. Bxe5": "Bd1 was better.",
        "23... Rxe5": "Black now sees the bishop pair advantage on the horizon, and presses for it.",
        "24. Rxe5 Bxe5 25. c3 b6 26. d4 Bd6 27. a4": "With dreams of trading off this isolated pawn while punching a hole in black's chain.",
        "27... a5": "Black sees this, and stops it immediately.",
        "28. Qe3": "White now moves to control the e file. Obviously, this cannot be allowed. Black has a pawn advantge and the bishop pair, so exchanging queens usually is a good idea at this point.",
        "28... Qe7 29. Qd2": "My opponent is too crafty to oblige:)",
        "29... Be4": "! Strong move. I was hoping white would be willing to exchange bishops here, as 30. BxB QxB  31. f3 Qb1 was pretty strong. I had about a dozen conditional moves programmed in if he went for it. But an opponent of this strength surely saw this coming, and sidestepped it nicely.",
        "30. Qd1 Bf4": "The goal here was to get a threat on white's c pawn at some point.",
        "31. Bxe4": "? White chooses to trade down, which I questioned. Now black can get aggressive with a check tempo.",
        "31... Qxe4+ 32. Qf3 Qxf3+ 33. Kxf3 Bd6": "And the endgame arrives.I gotta say, I was liking my chances here. I felt that I had assured at least a draw, and victory was a distinct possibility. The error by my opponent on move 8 which lost a pawn now really comes into play. The only problem is, how to punish it?",
        "34. Nd2 c5": "A little aggressive, as black gains an isolated pawn. It is safely protected (for a time anyway) by the bishop behind it and a king that can get there quick.",
        "35. dxc5 Bxc5 36. Ke2": "Seeing the 3-2 pawn advantage black has, and trying to get over to the queenside to defend.",
        "36... f6": "Slowly pushing up, and wanting to get my king to e6 to re-evaluate his own intentions.",
        "37. f4 Kf7 38. Kd3 Ke6 39. c4": "White throws all of chips in the pot and attacks. I'm guessing he was counting on getting his king to b5 after exchanging the remaining minor pieces, and hopefully winning the race to promote his a pawn before I could get my king behind his remaining pawns.",
        "39... dxc4+ 40. Kxc4": "Correct. My opponent now aims to exchange his knight for my bishop by Ne4 or Nb3.",
        "40... f5": "! Strong. The intent here was to busy my opponent with his plans on the queenside while my king started gobbling up any further impediments on the kingside, so a pawn could be promoted.",
        "41. Nf3": "White realizes my plan.......",
        "41... fxg4 42. hxg4 h6": "I tell myself that this is gonna be slow, steady advancement.",
        "43. Nd4+": "? This move loses for white. After exchanging pieces, black wins the race to promotion.",
        "43... Bxd4 44. Kxd4 g6 45. Ke4 Kf6 46. Kd5 h5": "And white resigned. I had approximately 15 conditional responses locked in, and realized that white could not stop promotion. This game WORE ME OUT:), but was very enjoyable."
    },
    "url": "https://gameknot.com/annotation.pl/22nd-gk-tournament?gm=432",
    "gameName": "22nd GK tournament",
    "players": "omwatson (1567) vs. tag1153 (1366)",
    "opening": "Scandinavian defence, Lasker variation (B01)"
}