{
    "moves": {
        "1. e4 c5 2. Nf3 d6": "The main line of the Open Sicilian Defence.",
        "3. d4": "A thematic third move in the Open Sicilian: White makes his move in the centre.",
        "3... cxd4 4. Nxd4 Nf6 5. Nc3 a6": "This move initiates the Sicilian Najdorf Variation, a variation on the Sicilian with seemingly endless possibilities. Black's idea behind this innocuous-looking pawn move is to start off a queenside expansion to gain space.",
        "6. Bg5 e6 7. f4 Qb6": "And this move begins the ultra-sharp Poisoned Pawn variation of the Sicilian Najdorf. This is a bold sortie by the Black queen to grab a pawn deep in White's position; the pawn is \"poisoned\" because Black's queen may not get out alive. Fischer always believed that any tempi wasted by Black extricating his queen were outweighed by the pawn advantage.",
        "8. Qd2 Qxb2 9. Nb3": "The entrance is neatly closed over the Black queen. But she may still escape...",
        "9... Qa3 10. Bxf6 gxf6 11. Be2 h5 12. O-O Nc6": "I do not understand why Black has not yet played Qb4 to effectively escape.",
        "13. Kh1 Bd7 14. Nb1": "This move is and was completely unexpected, and stunned spectators and analysers and trainers on both sides. White's knight retreats to its original square!",
        "14... Qb4 15. Qe3": "After White's surprising knight move, Fischer became suspicious and played several inaccurate moves, which are fatal in such a sharp opening. I would love to identify these \"inaccurate moves\" for you, but I do not know which they are! Can anyone help?",
        "15... d5 16. exd5 Ne7 17. c4 Nf5 18. Qd3 h4 19. Bg4 Nd6 20. Nb1d2": "The knight comes out again.",
        "20... f5 21. a3 Qb6 22. c5 Qb5": "Why that queen doesn't just escape to d8 is beyond me. Of course White would take the knight on d6, but Black can capture the bishop on g4. I think 22...Qb5 would have saved the game, at least temporarily, for Black! Does anyone else think so?",
        "23. Qc3 fxg4 24. a4": "And Black's queen is trapped.",
        "24... h3 25. axb5 hxg2+ 26. Kxg2 Rh3": "Of course, Black can procrastinate, but the game is lost for him.",
        "27. Qf6 Nf5 28. c6 Bc8 29. dxe6 fxe6 30. Rfe1": "As if Black didn't have enough problems already.",
        "30... Be7 31. Rxe6": "By then, as Fischer was spending ages on his move, Spassky had gone and was pacing up and down the corridors. By the time he got back, Fischer had decided to resign, and had left the hall.\r\n\r\nIn case you would like to know, Fischer eventually won the match overall, becoming the new world champion for chess.\r\n\r\nExtra descriptions e.g. how the spectators were stunned after Spassky's 14th move, how Spassky was pacing the corridors etc. were all discovered from Daniel Johnson's book \"White King and Red Queen\" though most analysis of the moves themselves did not come from here."
    },
    "url": "https://gameknot.com/annotation.pl/28th-world-championship-1972-reykjavik-game-11?gm=19366",
    "gameName": "28th World Championship, 1972, Reykjavik, Game 11",
    "players": "Spassky, Boris (2660) vs. Fischer, Robert James (2785)",
    "opening": "Sicilian (B97), Najdorf, Poisoned pawn variation"
}