{
    "moves": {
        "1. e4": "Where did I play well and where was I blundering?  From what move was I better?  If at all.",
        "1... d5": "I was black and after whites move of e4 I went with d5, just to see what he would do I think.  I like to try things and its fun to make moves to get out of a situation but with 2 pawns not much damage here I think.",
        "2. e5 c5": "So white never protected his pawn but pushed it up to e5, a bit previous ?  I also didn't protect but there was nothing attacking so I moved to c5.",
        "3. d4 cxd4": "White moved pawn to d4 and I took with my c5 pawn.",
        "4. Qxd4 Bf5": "White queen captured my pawn and is protecting e5 pawn.  I moved LB out to f5 attacking c2 and I maybe thought I might come out with my queen to b6 maybe.",
        "5. Bb5+ Nc6": "White moved LB to b5 and I brought out my knight to protect my king from check.  It is also attacking white's queen.",
        "6. Na3 f6": "Next white moved his knight to a3 protecting the LB  at b5.  I am unable to take white's queen with the pin from white's LB.  I moved to attack the pawn at e5 with f6.",
        "7. exf6 gxf6": "White took my pawn at f6 and I retook with g7 pawn.",
        "8. Qc3 Qc7": "White moved his queen back to c3 and I moved my queen to c7 to avoid taking the LB with my pawns should white take the knight at c6.",
        "9. g3 O-O-O": "Now white moved his pawn on the g file to g3 while leaving his king sat in the middle of the board.  Better would have been to develop a piece to enable him to castle.  I castled on the queen side.",
        "10. Bf4 e5": "White developed his DB out to f4 so that was the plan with his previous move as he is now protected by the g3 pawn and is attacking my queen at c7.  I move my e pawn out to e5 to block the DB.",
        "11. Bd2 Nge7": "White retreats his DB back to d2 and I develop my knight to e7 and now the knights are working together.  The g file is now part open for my rook to move across to.",
        "12. O-O-O Nd4": "White now long castles and I move my c knight to d4 which leaves the queens facing each other on the c file and I am attacking the LB at b5.",
        "13. Bf4 Nec6": "White moves the DB to f4 allowing the rook to get active if required.  My knights still protect each other with the move of my e7 knight to c6.",
        "14. Bxc6 Qxc6": "Now white takes my c6 knight with the LB but I retake with my queen.",
        "15. Qxc6+ Nxc6": "White captures my queen with his queen and I recapture with my d4 knight rather than a pawn.",
        "16. Be3 Kb8": "White moves his DB to e3 attacking a7 square and I move my king over to b8 as my king would be in the open if the knight had to respond to the LB's attack.",
        "17. f4 d4": "White pushes pawn out to f4 attacking my pawn at e5.  I push my d5 pawn to d4 attacking the DB and stopping his progress on the diagonal to a7, this pawn is protected by my knight at c6.  The rooks are also on the d file at d8 and d1.",
        "18. Bf2 Bd6": "White retreats the DB to f2 and I develop my bishop to d6 bringing it out to support the centre pawns.  This also allows the rooks now to work together.",
        "19. fxe5 fxe5": "White captures my pawn at e5 with d4 pawn and I recapture with my f6 pawn.  The e5 pawn is well protected with the knight at c6 and DB at d6.  My LB is hanging I must do something about that.",
        "20. Nf3 Bg4": "White develops g knight to f3 and I immediately move my LB to g4 to attack it.  My LB still is hanging.",
        "21. Rde1 Bxf3": "White moves his d rook to e1 and I take the knight at f3.",
        "22. Rhf1 Rhf8": "White joins up his rooks with rook to f1 and I move my h rook across to f8 and my LB is not hanging any more.",
        "23. Rfg1 Bg4": "White's rook at f1 was probably not the best move as I was blocking the file at f3 and his DB was also on the file at f2.  So white moves the rook across to g1 and I immediately move across to block the file again at g4.",
        "24. Rg2 Rf3": "White moves g1 rook to g2 and I move my f8 rook to f3 attacking the DB at f2.  My LB is protecting my rook at f3.",
        "25. Nc4 Bh3": "White now moves his a knight to c4 attacking my DB but this is protected by the rook at d8 so I ignore and move my LB across to attack the rook at g2.",
        "26. Rgg1 Bb4": "So white retreats his rook back to g1 and I move my DB to b4 to attack the rook at e1.",
        "27. Re4 Rxf2": "White moves his rook to e4 and I capture the DB at f2.",
        "28. Nxe5 Bf5": "White knight captures my pawn at e5 and I move my LB to attack white's rook at e4 protected by the rook at f2.  White's knight can take my knight and check my king on his next move.",
        "29. Nxc6+ bxc6": "So I cannot take the rook at e4 as white captures my knight putting my king in check.  I captured the knight with my b7 pawn.",
        "30. Re5 Rxc2+": "White now attacks my LB with a move to e5 and I check white's king with my rook at c2 protected by the LB at f5.",
        "31. Kd1 d3": "White king moves across to d1 and out of check.  I push my d file pawn to d2 in readiness to queen and also to protect my rook which of course is also protected by the LB.",
        "32. Rxf5 Rxb2": "White takes my LB wit the rook and I move across to take a pawn and to give me easier access to the squares on the 2nd row.",
        "33. Rgf1 Rd2+": "White moves his g rook over to f1 and brings the rooks together on the f file.  I move my rook to d2 and check the king protected by the DB at b4.",
        "34. Kc1 Rc2+": "The king moves out of check to c1 and I move the rook over to c2 to allow my pawn to access the d2 square.  This checks the king again.",
        "35. Kb1 Ba3": "King moves over and out of check to b1 and I move my DB to a3 covering the c1 and b2 squares.  I also have my rook at d8 protecting my pawn at d3.",
        "36. Rf5f2 Rc3": "Whites rook is at f1 so it is not easy to move to c1 and check the king and move him off the 1st row as my rook will be captured.  So after white brings his 2nd rook to f2 I move my rook back to c3 expecting he will move along to try to stop my pawn before it queens.",
        "37. Rc2 dxc2+": "And white does move his rook to c2 and I capture with my pawn at d2 and check the king with protection from my rook at c3.  With my DB at a3 protecting the c1 square where my pawn would queen white knew he could not affect anything now and the game ended."
    },
    "url": "https://gameknot.com/annotation.pl/2nd-china-cup?gm=61440",
    "gameName": "2nd China Cup",
    "players": "orac (1239) vs. milly64 (1150)",
    "opening": "Scandinavian (centre counter) defence (B01)"
}