{
    "moves": {
        "1. e4": "?? The Losing move! would it not be simpler to play 1.Kxe8? ;)",
        "1... Nf6": "Interesting opening. Why would the Master Mater play an opening where,even himself admits,is hard to acheive an early mate? Simple. Most players don't know this opening in-depth. I feel that I am lucky that I played it a little before! I also did not use the GK Database for this game to see how much I knew about this opening",
        "2. e5": "questioning the Knight's intentions",
        "2... Nd5 3. d4 d6 4. Nf3": "all book",
        "4... Nc6": "a popular alternative is 4...Bg4 but this is completely fine.",
        "5. c4": "Giving this Knight some exercise",
        "5... Nb6 6. exd6 exd6": "opting for a more symmetrical approach.",
        "7. Be2 Be7 8. O-O O-O 9. Nc3 Bf6 10. Be3 Bf5": "After the opening skirmish. Both sides are completely fine. They have developed all of their pieces and castled.",
        "11. a3": "with the LSB on the b1-h7 diagonal. an eventual ...Nb4 can be troublesome",
        "11... d5": "getting the typical strike back in the center",
        "12. cxd5 Ne7": "a zwicshenzug (have no clue how to spell this) of sorts. No need to recapture just yet.",
        "13. d6": "knowing that the pawn is a goner,I decide to draw his Queen out",
        "13... Qxd6 14. Nb5 Qd8 15. Bf4": "loading all of the pressure on c7",
        "15... Ned5": "killing three birds with one stone. The Knight rests on its ideal place in front of the isolated pawn and covering c7. It also attacks the Bishop",
        "16. Bg3 Be7 17. Bd3 Bxd3 18. Qxd3 Qd7": "I was still satisfied with my position at this point.",
        "19. Nc3 Rad8 20. Ne5": "Taking the jump to a good outpost and still forcing the Queen to move",
        "20... Qe6 21. Rfe1": "At this point in the last game,I was mated by Freddy. I follow the advice of placing the Rook on the same file as the Queen for a possible discovery later on",
        "21... Rfe8 22. Nc4 Qd7 23. Nxb6": "Possibly a little mistake,relieving the tension",
        "23... Nxb6": "23...axb6 24. Nxd5 Qxd5 25.Bxc7",
        "24. Nb5": "?! a dubious move. The \"weakness\" that I thought was on c7 was just an illusion.\r\n\r\nComputer: 24. Rad1!? =",
        "24... c6 25. Bc7": "? It's better to go through with my original plan 25. Nc7,just losing a pawn.\r\n\r\nComputer:25. Nc7 Rf8 26. Rad1 -/+",
        "25... cxb5 26. Bxd8 Rxd8": "the weakness on d4 now shows. Perhaps I shouldn't have traded too much?",
        "27. b3": "to prevent the knight from going to c4.",
        "27... a5 28. Qe2 Nd5 29. Qd2 b4 30. a4 Bf6": "the pawn is a goner",
        "31. Rac1 Nc3": "the knight ends up gaining an outpost on the c-file and it cripples my position even more",
        "32. Qe3 Bxd4 33. Qf3 f5 34. h3": "supporting a thrust to g4",
        "34... Qf7 35. g4": "blindly missing the threat. After I get down against higher-rated players I lose it. This is probably bordering masochism.",
        "35... Qxb3 36. Qxf5": "?? the final error. 36.gxf5 is better",
        "36... Rf8": "pin!",
        "37. Qc2 Bxf2+ 38. Qxf2 Rxf2 39. Kxf2 Qxa4 40. Re7 Qa2+ 41. Kg1": "I just keep making blunders",
        "41... Ne2+ 42. Rxe2 Qxe2 43. Rc8+": "Making checks to make the game last longer",
        "43... Kf7 44. Rc7+ Kg6 45. Rxb7": "another horrible mistake",
        "45... Qe3+ 46. Kf1 Qf3+": "The rest needs no explanation",
        "47. Ke1 Qxb7 48. Kd1 Qg2 49. Kc1 b3 50. Kb1 Qc2+ 51. Ka1 Qc1#": "All in all, a better effort than my last game vs. Freddy. But it was not enough"
    },
    "url": "https://gameknot.com/annotation.pl/2nd-attempt-to-mate-the-master-mater?gm=32296",
    "gameName": "2nd  attempt to mate the Master Mater",
    "players": "rookie879 (1406) vs. easy19 (2190)",
    "opening": "Alekhine's defence (B04), modern variation"
}