{
    "moves": {
        "1. c3": "(Game info on previous page) Hmmm... Already a !? type move.  I'd like to hear your motivation for this as I notice you play it quite regularly in your other games as well.  Comes under the category of irregular openings.  I said at the time that I can't really criticize it, because if the Caro-Kann is a solid opening for Black, it must be even better with a move in hand.  \nHowever as the WT player in an unrated game, surely you must be going for the win and this doesn't hold many attacking chances for you. \nAlso you mustn't try and run before you can walk: It's recommended to learn  to attack before you may consider adopting a more defensive/positional approach.  Therefore I recommend sticking to e4 for now.  it will help with all the basic opening principles: development, control of the centre etc.. and also it gives you a chance to practice tactics.  It is recommended right up until expert level to devour as much tactics as you can (within a balanced approach of openings, endgames, and strategy) and the game won't be as tactically based using this type of opening.  ",
        "1... e5 2. e3": "Already out of as much 'book' as there is for this opening, only 2 moves in.  \nPerhaps over-preparing.  That DSB will be entombed throughout the majority of the game and d4 straight away would have been better IMO (sticking to Caro Kann mainline, but of course with a degree more initiative).  Your DSB will be locked in the pawn chain for some time, but after d4 you would have had the chance of soon Bf4 and then e3 can be played with the advantage of 2 'good' Bishops. ",
        "2... d5": "Sensible developing and space-gaining moves.  \nLet's pause and compare the 2 positions:  My Bishops are free to develop with lots of open lines and my pieces can come rushing out with ease.  While your position is comparatively cramped and as proved in the game, developing will not be easy.  On the upside, your pawn structure is solid and could be a potential endgame advantage.",
        "3. d4": "Good.  After the preparation, not playing it would be a mistake. ",
        "3... Nc6 4. Nf3 e4 5. Nfd2": "I would be getting a bit worried right now.  This is getting serious!",
        "5... Nf6": "Nice and simple, nothing fancy.  Developing my pieces to their best squares. \nYour advantage of moving 1st has just about evaporated now. ",
        "6. Be2 Bd6 7. b4": "Not bad at all, trying to gain some space on the Q-Side.  You should be thinking about ways of getting your DSB off the board, it's causing you nothing but trouble..  ",
        "7... O-O 8. Bb5": "?? Sorry, but that's definitely a double question mark move.  This makes 6. Be2 a  \nwaste of time and also What does it threaten?  To exchange your good Bishop for a Knight.\nInstead 8. b5! is noteworthy Na5 9. Ba3 and you have succeeded in getting that DSB traded for one of my 'good' Bishops. ",
        "8... Ne7": "I think reviewing this move I should have allowed the favorable exchange Bishop for Knight..  \nMy motivation for this was that my Knight has a lot of potential on the strong outpost of f5, after careful consideration I decided perhaps wrongly to play it.  ",
        "9. Ba4": "Anticipating a6 or c6?  However it's best to wait for this to happen before retreating.  More vital tempo is going down the drain.",
        "9... c6": "Preparing a b5 advance to try and limit any counter-play on the Q-Side, stopping any ideas of b5 from you as 10. b5 cxb5 and your c-pawn is backward on a half-open file.  And obviously releases my Queen.",
        "10. O-O": "?? Castling straight into the attack.  However there is not much you can do to save the game anyway.",
        "10... Nf5": "Preparing a classic Bishop sacrifice on h2: 11. Bxh2  12. Kxh2 Nxe3! 13. fxe3 Ng4  14. (a) Kg1 Qh4 15. Rf4 Qh2  16. Kf1 Nxe3 etc.. (b) Kh1 Qh4  15. Kg1 Qh2# (c) 14. Kg3 Qc7  15. Kh4 (15. Kh3 Qh2#) Qh2  16. Kg5 h6# (Qh6# works also) (d) Kh3 Nxe3 etc..  I had this all worked out, but actually I could have played it straight away!: 10. Bxh2  Kxh2 11. Ng4  etc.. and although I can't get the win with quite as much force, I can afford to take my time: that King's going nowhere and is just waiting to die.",
        "11. g3": "Well spotted!  That's vision from a player above your rating.  However it does nothing to change the course of the game.  This is an almost certain win from here and it weakens the light squares around your King, which probably can't be helped.  (11. Kh1 Bxh2 12. g3 seems to trap my Bishop, but Bxg3 12. fxg3 Nxg3etc..)",
        "11... b5": "My plan now is h7-h5-h4 and I can always maneuver my Rook to h8 if backup is needed.  I want to squeeze everything out of the position however, so I'm taking time to try and shut down any last embers of a Q-Side counter-attack that are still there and trap both Bishops in the corner of the board and virtually out of play.  Also note that it's move 11 and while my attack is building, your whole Q-Side still sits undeveloped!  Another thing to note is that where there would normally be a defensive Knight on f3 covering h2, there is a hole.  So it's desperation but maybe you would want to play Re1 and Nf1, although a downside is it cuts off your King's escape square and is giving in to passive defense.  Not a lot else you can do however, but sit, wait and hope I slip up somewhere down the line.  Another plan for me was Nh6 and my Bishop can come to g4 and then f4 or straight to h3 and completely undermine the K-Side light squares, also either Knight can take up a tasty and powerful square on g4: piling on the pressure.",
        "12. Bb3 Qc7": "No rush to play h5, you are going nowhere.  Qc7 makes its advance more powerful.",
        "13. a4": "Good move.  At least you are trying to create some sort of resistance.  It comes to nothing though, the a-file half-opening is of no consequence to me.  However there was nothing else in the position for you.  ",
        "13... Ba6": "Still stalling h5.  However I couldn't pass up the opportunity of likely putting my Bishop on the powerful f1-a6 diagonal cutting almost straight through the centre of the board and opening up a discovered attack on your Rook (although flawed as you will see in my comment on his next move).  Although I didn't play it for the cheap trick of 14. bxa4 15. Bxa4(say) bxf1 that I didn't expect you to fall for.  I also wanted to provoke you into the 'easy way out' of 14. a5 (I would have just moved my Bishop back to c8 and carried on my assault on your King's position) which I expected you to do and it was a good sign that you didn't: because when complications arise, most beginners resort to closing the position; probably because the calculation required in an open position they think is too hard for them and it seems to be easy on the brain to get into a 'safe' closed game (I'm not dissing a closed game, just many weak players like it for the wrong reasons).  \nHere you realized correctly that you must try and create complications on the Q-Side and open it up at all costs.  Unfortunately you blundered when you had a combination staring you in the face which does cause me a few complications..  Try to find it, you'll be kicking yourself!..  ",
        "14. Na3": "? Obviously basically loses the game on the spot.  \nThe correct combination to recover the situation somewhat was 14. axb5 Bxb5 15. c4- :) pretty obvious really I can't believe we both missed it dxc4 16. Bc2 Bxb4 17. Nxe4 Nxe4 18. Bxe4 and although I'm technically a pawn up, my Q-Side pawn structure has been significantly weakened and my c4-pawn will surely soon fall as well.",
        "14... bxa4": "Lucky me!",
        "15. Bxa4 Bxf1 16. Nxf1 a6": "A waiting move.  I don't want to give you anything to respond to and see if you have anything planned.  It also once again does restrict a b5 advance (at least that's what I thought lol..).  Rfb8 seems even better according to Fritz 9.  At this point the game is won anyway so it doesn't particularly matter.  Also what chess engines say is not necessarily gospel.  Don't for one second believe that they are always right.  (It's just simplification time at this point, no need to go ahead with my K-Side attack with me already material ahead).    ",
        "17. b5": "?? Terrible, comes to nothing.",
        "17... cxb5": "To compound your misery, the c-pawn is now also weak.",
        "18. Bxb5": "More free material for me.  You had to admit your mistake 17. b5?? and just retreat your Bishop.",
        "18... axb5": "munch.",
        "19. Nxb5 Qc6 20. Rxa8": "20. Nxd6 doesn't change the outcome of the game Nxd6 (Rxa1 Nxf5) 21. Rb1 keeps your Rook on the board at least.",
        "20... Rxa8 21. Nxd6": "c4 is slightly better, but doesn't change anything.",
        "21... Nxd6 22. Qe1": "The pawn is gone anyway.  22. Kg2 does not save the day, but tries to deal with \nany pins on the back rank Qxc3 23. Bd2 Qb2",
        "22... Nb5": "I was thinking about Ra1, but decided this way was simple enough.",
        "23. h3": "23. Bb2 doesn't hold the pawn Rc8etc..",
        "23... Qxc3": "Ra1 was again on, and there was no rush to take, but I was just Blitzing it at this stage.",
        "24. Qxc3": "Clearly you didn't listen to my advice in our 1st game: when behind in material, your opponent will want to simplify.  Doing it for him is playing into his hands.  Bd2 was a must.",
        "24... Nxc3 25. Bd2 Ne2+ 26. Kh2": "Waste of a move.  26. Kg2 Ra2",
        "26... Ra1": "And now you have to move to g2 anyway.",
        "27. Kg2 h5": "All of your pawns are tied up and your Bishop is the only piece you have which can move (Nh2 Rg1#).  So you may have tried to relocate your Bishop to the K-Side as a last ditch attempt via b4 and d6.",
        "28. f3": "Allows me more simplification.  Even if it is a very active Knight for an extremely passive one, I don't care: the plan is just liquidation of all your pieces, until it's a won endgame.",
        "28... exf3+ 29. Kxf3 Rxf1+ 30. Kxe2 Rh1": "Not only attacks your h-pawn, but prepares also to get rid of your last piece..",
        "31. h4": "31. Kf3 keeps your Bishop at the loss of a pawn.",
        "31... Rh2+": "Game over now, for definite. ",
        "32. Kd3 Rxd2+ 33. Kxd2 Ne4+ 34. Kd3": "34. Ke2 cannot change destiny Nxg3 35. Kf3 Nf5etc..",
        "34... Nxg3": "munch.",
        "35. Kc2 Nf5 36. Kd3 Nxh4": "munch.",
        "37. e4 dxe4+ 38. Kxe4 f5+ 39. Kf4 Kf7 40. Kg5 Nf3+ 41. Kxf5 Nxd4+ 42. Kg5 g6 43. Kh4 Kf6 44. Kg3 Kf5 45. Kh4 g5+ 46. Kxh5 Kf4 47. Kg6 g4 48. Kf6 g3 49. Ke7 g2 50. Kd6 g1=B": "Of course g1Q would have been easy, but I wanted to practice this for the 1st time against a human being instead of Crafty or some other engine.\nThis is the sort of endgame that you need to know, you can't just figure it out.  It may seem like a daunting task, but if you know how it's done and have practiced it, it's actually quite manageable; but remember, because of the 50 moves rule I have to get it done before or on White's 101st move.  There is almost a 'system' in doing it, which I'll take you through.  But before we start here's a few key points you need to know about this.  \nYou will ONLY be able to force mate in the same coloured corner squares as your Bishop, FACT.  In this case mine is Dark Squared, so I need to force him to either h8 or a1.  But how do I achieve this seeming impossible task? 1st things 1st, I'll need to force him to the edge of the board.  It doesn't even matter if at 1st I can only force him to a8 or h1, I will have achieved step 1 of the puzzle.  Step 1 is quite easy, you can just figure this bit out.  Just keep cutting off his King's escape squares, and soon he'll be forced onto the edge.  Oh.. and another thing, my Knight and Bishop will better co-ordinate when kept close and on the same colour squares: that way my knight can control the squares my Bishop is unable to and so they will together control more squares collectively.  \nSo anyway.. I'll get you on the edge, and we'll take it from there (no comments are needed until then, you can see basically what's happening). ",
        "51. Kd5 Nf5 52. Kc4 Ke4 53. Kc3 Nd6 54. Kd2 Nb5 55. Kc2 Kd4 56. Kb3 Nc3 57. Kc2 Kc4 58. Kd2 Bf2 59. Kc1 Kd3 60. Kb2 Nb5 61. Kb3 Bc5 62. Ka4": "After just 12 moves, step 1 has been achieved with ease.  Now step 2 is the hard bit.  Remember I want him on a1.",
        "62... Kc4 63. Ka5": "Only move.",
        "63... Nc7": "Cutting off his a6 escape square and also relocating to b4 via d5..",
        "64. Ka4": "forced.",
        "64... Nd5 65. Ka5": "forced again.",
        "65... Nb4 66. Ka4": "Another thing I should mention from here is that until he's cornered, you must keep the zig-zag Knight maneuver across the squares b4, d3 and b2 memorized.  Stick to these squares and you can't go wrong.  The same formula would apply if we had a symmetrical position, but two ranks down on the 6th rank or even 4 ranks down on the 8th.  \nI should run through an important line, which I don't need to worry about in this position, but try to if you can imagine this piece arrangement:  WK on a6, N on b6, BK on   \nc6, and B on c7(say).  So basically it's the same position, but 2 ranks down.  This position requires a little more knowledge than the current position.  Let's say BLK to move: 1. Bb8 2. Ka5 Nd5 sticking to those key squares! 3. Ka4 Kc5 4. Kb3 the most testing move Nb4 5. Kc3 looks like it escapes back into the centre, but.. Bf4! closes the door and observe the beautiful combination of Bishop and Knight 6. Kb3 Be5! and that troublesome King is back under wraps after a seemingly certain escape.     ",
        "66... Bb6 67. Ka3": "forced.",
        "67... Nd3": "sticking to those key squares.",
        "68. Ka2": "If 68. Ka4 it's more simple Nb2  69. Ka3 (forced) Kc3 70. Ka2 (forced, sounds familiar?) Kc2 71. Ka3 does not escape because of.. Bc5  72. Ka2 (forced) Bb4 it's good in this situation to give back the tempo 73. Ka1 etc.. and I'll show you how to finish him off soon..",
        "68... Kc3 69. Kb1 Nb2 70. Ka2": "Of course 70. Kc1 doesn't escape because of Bd3  (similar Bishop-Knight co-ordination as in my earlier line) 71. Kb1 Bf4 another important zugzwang common to endgames, he'd prefer not to move but must 72. Ka2etc..",
        "70... Kc2 71. Ka1": "(71. Ka3 Bc5  72. Ka2 Bb4 73. Ka1 comes to the same thing)",
        "71... Na4 72. Ka2 Bc5": "I have now limited him to just 2 corner squares, but step 3 is how to finish him off?  here's 1 way.",
        "73. Ka1 Ba3": "I want the check to come on b2..",
        "74. Ka2 Bc1": "74. Bb2 would be a disastrous stalemate, I must once again use up tempo. ",
        "75. Ka1 Bb2+ 76. Ka2 Nc3#": "wallah!  Check and mate.  You may be asking: \"But what's the point in learning this endgame, if it is likely I'll only come across it 2 or three times in my lifetime?\".\nWell, these are the kind of core endgames that just need to be learned.  Imagine you are at a tournament and you have completely outplayed your opponent, and you get into a specialist type endgame such as this and you don't know how to finish him off!  And learning it also teaches good Bishop and Knight co-ordination. \nAnyway thanks for faxander for the game and although it wasn't perfect, I do notice you are gradually improving.  Keep it up!  make a note of the good and  \nbad moves you made during the game and try to improve on them for future games.  For more help on this and other endgames, there are some great videos on youtube.com\ntake care!"
    },
    "url": "https://gameknot.com/annotation.pl/2nd-training-match-vs-fa_xander?gm=17256",
    "gameName": "2nd Training Match vs fa_xander",
    "players": "fa_xander (928) vs. toiletduck1 (1835)",
    "opening": "Saragossa opening (A00)"
}