{
    "moves": {
        "1. e4 d5 2. exd5 Nf6 3. Nf3 e6 4. dxe6 Bxe6 5. Be2": "This disables the otherwise good Qe7, since white has a tempo more to castle. ",
        "5... c5": "If white plays Nc3, a6 must be played to stop the Nb5 jump. ",
        "6. O-O Bd6": "Controlling e5, in time to play a6 if needed. ",
        "7. c4 O-O 8. Nc3 a6": "As a clockwork. ",
        "9. Ng5": "No problem... apparently. ",
        "9... Bf5 10. d3": "This makes d3 a target. ",
        "10... Qc7": "h2 is also a target. Unfortunately, I have castled, so h5 is not as good. ",
        "11. h3 h6 12. Nf3": "NO point in pushing the N on the proper square to guard h2, and no point in checking the king: Bh2+, Kh1, then something like Nd7, tempting white to go g3 (to trap the bishop), but Bxh3, etc. can be a classic winning sac. ",
        "12... Nbd7 13. b3": "White goes for mounting a dangerous carabine on g7. ",
        "13... Ne5": "This N is almost useless for me, so I better exchange it. Or sac it. ",
        "14. Bb2 Nxf3+": "I still didn't see a clear winning sac here. ",
        "15. Bxf3": "Now white has an edge, with those bishops pointing to weak points... I started to blunder. My revenge was d3, but for some reason I thought at once that white could defend it, so I went for another thing. ",
        "15... Rae8 16. Nd5 Nxd5 17. Bxd5 Be6 18. Qf3 Bh2+ 19. Kh1 Bf4": "The idea is to tempt white to play g3. ",
        "20. Bxb7": "And now the idea is to gain some time to build an attack while white goes pawn's grabbing. Of course, this implies I have to win. ",
        "20... Re7 21. Bxa6 Rd8": "? Don't ask. ",
        "22. Rad1 Bf5 23. d4 cxd4 24. Bxd4 Be4": "This was the idea. Now MY bishops seem powerful and looking to the WK. ",
        "25. Qg4 Bg6 26. Bb5": "White has to lose a couple of tempos to get his other bishop into the actor or to move the pawns (the best he could have done, anyway). ",
        "26... Re6 27. a4 f5": "Using his queen to push my pawns forward. ",
        "28. Qf3 Red6": "?? I just blundered the bishop. Mi opponent though about who ever knows what a hidden trap, and didn't take it!",
        "29. Bc3 Rd6xd1 30. Rxd1 Rxd1+ 31. Qxd1 Qe7": "Well, now I have a losing endgame, with an unusual four bishops + queens formation. ",
        "32. Qd4 Bg5 33. a5 Bf6 34. Qd2 Bg5 35. Qd3 Kh7 36. a6 f4 37. Qf1 Be4 38. Bd4 Qe6 39. a7 f3": "This was just not enough firepower, but at least I can inmobilize the WQ to the defence of h3. It costed me leave a pawn to run until the 7th. ",
        "40. g3": "Now what?",
        "40... h5": "The last, desperate chance. ",
        "41. Kh2 h4 42. Qa1": "I can play Ba1, then he Bxg7, etc... no way. ",
        "42... hxg3+ 43. fxg3 Qd6": "A pawn for a tempo. It seems very \"naive\", because of an obvious answer, but it can't be played. Can you see because white can't play the \"naural\" Be5?",
        "44. Be5 Qd2+": "Right, for this move. Scratch all little advantage (of plausible) from a desperate position, sac even more (leave white go after the promotion and almost get it... and look to the importance of my c6 pawn..."
    },
    "url": "https://gameknot.com/annotation.pl/2qs-4bs-and-pawns?gm=56552",
    "gameName": "2Qs, 4Bs and pawns",
    "players": "Buddy  vs. damalfi ",
    "opening": "Scandinavian defence (B01)"
}