{
    "moves": {
        "1. e4 c5 2. Nf3 Nc6 3. Bb5 a6 4. Bxc6 bxc6 5. c3 g6": "To this point the opening was the Sicilian Defense/Nc6 Variation/Rossolimo Variation.  Black departs with g6.  ",
        "6. O-O": "Time to give the king some protection.  With black having doubled pawns on the queen side and what looks to be a week pawn structure on the kings side I think I have time to solidify my position and develop more pieces. ",
        "6... Bg7": "Bishop takes some control of the a1 h8 diagonal but to what end?  No purpose in this move that I can see and the king tucked away on the king's side.",
        "7. d3": "Continue to build the pawn structure and open some more space for development.",
        "7... Nf6": "Looks like black is going to castle on the king's side.  I now have three pieces lined up to attack on that side and will move some more into position to attack on the right.",
        "8. Nbd2": "Development is all important in early part of the game.",
        "8... O-O 9. h3": "Blocks the knight except for the side of the board or a backward move.",
        "9... a5 10. a4 Ba6": "Attack my weak pawn center",
        "11. c4": "Protects the pawn, blocks the a6 bishop",
        "11... d5": "Not sure that this is a good move for Black.  I can attack the knight and if he takes c4 with d5 I get a pawn and also attack his black bishop.",
        "12. e5 Nd7": "Want's to keep knight",
        "13. Qe2": "The Queen adds protections to e5 and c4.  Any trade at this point will be a loss of material or space for black.",
        "13... e6 14. b3 dxc4": "Slightly better is f5.",
        "15. dxc4": "We are even with material but black still has a doubled pawn and less controlled space.  ",
        "15... Rb8 16. Ba3 f6 17. Ne4 fxe5": "Sacrifice a pawn for possible material gains in a few moves. Black now has two doubled pawns",
        "18. Qe3": "Protections for b3 and adds attack on c5",
        "18... Qe7": "Black adds protection to c5 and frees up the back rank for rook moves.",
        "19. Rad1 Nf6": "Hangs the pawn at e5. Leads to 20.Bxc5 Qc7 21.Bd6 Qb6 22.Nc5 e4 23.Nd4 e5 24.Nde6 Rfe8 25.Bxb8 Rxb8 26.Nxg7 Kxg7, which wins a bishop and a knight for a rook, a bishop, and a pawn. Better is Bc8, leading to 20.Rd3 Qf7 21.Rfd1 Qf4 22.Rxd7 Qxe3 23.fxe3 Bxd7 24.Rxd7 Rxb3 25.Bxc5 Rb1+ 26.Kf2, which wins a queen, a rook, and a pawn for a queen, a bishop, a knight, and a pawn.\n",
        "20. Nxc5": "Attacks Black's bishop at a6 and blocks Black's pawn at c6.  This shows why black's Nf6 move was bad.  Removed protection from the c5 pawn and puts the knight in a position where it can only move back or to the edge of the board.   Now I can take the bishop on a6 which leads to an attack on both the queen and the b8 rook.  I could get a bishop and rook for a bishop and knight.",
        "20... Qa7": "Again a bit of a blunder leading to a loss of material.  The knight at c5 is protected by the queen and bishop, the pawn at e5 is open to attack by the f3 knight which could lead to a fork at c6 on the queen and rook or a fork on both rooks from d7 leading to an exchange knights with a knight on back on d7 again forking the two rooks and being protected by the rook.  Only thing at this point would be to trade queens and black still loses a rook for a knight.",
        "21. Nxe5": "The attack rolls on.  Black is cramped and white has a number of possible good moves.",
        "21... Rfe8": "Blunder again.  Now the knight at e5 takes the c6 and forks the queen and rook.  The position for black is now getting even more cramped and it looks like a free bishop at a6 for white.",
        "22. Nxc6": "Leads to 22.Nxc6 Qb6 23.Nxb8 Rxb8 24.Nxe6 Qb7 25.Nxg7 Kxg7 26.Rfe1 Re8 27.Be7 Kg8, which wins two knights for a rook, a bishop, and two pawns. Better is Rbe8, leading to 22.Nxa6 Qxa6 23.Bxf8 Bxf8 24.Qf3 Kg7 25.g4 g5 26.Qxc6 Qc8 27.Qxc8 Rxc8 28.Rfe1, which wins a queen, a bishop, and a knight for a queen, a rook, a bishop, and a pawn.",
        "22... Qf7": "Hangs the bishop at a6. Leads to 23.Nxb8 Bxc4 24.bxc4 Rxb8 25.Nxe6 Re8 26.Rfe1 Qb7 27.Qe5 Qc6 28.Qb5 Rxe6 29.Rd8+ Bf8 30.Qxc6 Rxc6 31.Rxf8+ Kg7, which wins a queen, two knights, and a pawn for a queen, a rook, two bishops, and a pawn. Better is Qb6, leading to 23.Nxb8 Rxb8 24.Nxe6 Ne8 25.Qxb6 Rxb6 26.Nxg7 Nf6 27.Rfe1 Kxg7 28.Re7+ Kh6 29.Rd6 Rxd6 30.Bxd6, which wins a queen, a rook, and two knights for a queen, two rooks, a bishop, and a pawn.",
        "23. Nxb8": "Always look first for king safety and second for material gains.",
        "23... Rxb8": "Slightly better is Bc8. (Chessmaster 10).  Black has removed some of the protection from e6 and has given up the a6 Bishop for nothing.",
        "24. Nxa6": "A good series of attacks.  I got a rook, a bishop, and three pawns for a knight . My a3 bishop controls the a3-f8 diagonal, the d1 Rooks controls an open file, the queen is controlling the center and more of the board.  Black's rook is forced to move somewhere, black's queen is blocked, the king is hung on the back rank by his own pieces.  Could life be any better. ",
        "24... Re8 25. Qb6": "Can always pick off a pawn and then walk my pawns to the 8th rank with little or no opposition.",
        "25... e5 26. Qxa5": "Creates passed pawns on a4 and b3. White wins a pawn and I now control 3/4 of the board",
        "26... Ne4": "Slightly better is Bf8.",
        "27. Qb6": "I missed this one.  Rd8 would have been better.  27. Rd8 RxR 28. QxR+  Then bring out Rook on f1.",
        "27... Re6": "Leads to 28.Rd8+ Re8 29.Rxe8+ Qxe8 30.Rd1 Bf6 31.Qb7 Kh8 32.Nc7 Qg8 33.Qxe4 Qb8 34.Rd7 Qa7 35.Qc6, which wins a rook for a rook and a knight. Better is Nc3, leading to 28.Rd8 Ne2+ 29.Kh2 h6 30.Re1 Nf4 31.Nc5 Bf8 32.Rxe8 Qxe8 33.Ne4 Bg7 34.Qb7 Qd8, which wins a rook for a rook. (Chessmaster 10 analysis)",
        "28. Qd8+": "Leads to 28...Re8 29.Nc7 Rxd8 30.Rxd8+ Bf8 31.Rxf8+ Qxf8 32.Bxf8 Kxf8 33.a5 Nd6 34.Re1 Ke7 35.Rxe5+ Kd7 36.Ne6 Kc6 37.a6, which wins a queen, a rook, a bishop, and a pawn for a queen, a rook, and a bishop. Better is Rd8+, leading to 28...Re8 29.Rxe8+ Qxe8 30.Rd1 Bf6 31.Qb7 Kh8 32.Nc7 Qg8 33.Qxe4 Qb8 34.Rd7 Qa7 35.Qc6, which wins a rook and a knight for a rook. (Chessmaster 10 analysis)",
        "28... Bf8": "Leads to 29.Nc7 Re7 30.Bxe7 Qxe7 31.Qxe7 Bxe7 32.Rfe1 Nf6 33.Rxe5 Kf7 34.a5 Bb4 35.a6 Bc3 36.Re3, which wins a queen and a bishop for a queen, a rook, and a pawn. Better is Re8, leading to 29.Nc7 Rxd8 30.Rxd8+ Bf8 31.Rxf8+ Qxf8 32.Bxf8 Kxf8 33.a5 Nd6 34.Re1 Ke7 35.Rxe5+ Kd7 36.Ne6 Kc6 37.a6, which wins a queen, a rook, and a bishop for a queen, a rook, a bishop, and a pawn. (Chessmaster 10 analysis)",
        "29. Rd7": "Black resigns. Loss of material for black no matter what move he makes and white can trade even from this point on."
    },
    "url": "https://gameknot.com/annotation.pl/71st-gk-tournament-http-gameknot-com-chess-pl-bd-14665603?gm=34651",
    "gameName": "71st GK tournament, http://gameknot.com/chess.pl?bd=14665603",
    "players": "whitejd (1450) vs. northcoaster (1367)",
    "opening": "Sicilian (B30), Nimzovich-Rossolimo attack (without ...d6)"
}