{
    "moves": {
        "1. e4": "annotating this game for the fun... I had a lot of pleasure to have two games against bluemarble, an optimistic offensive player, in a tournament. Of course, he made clear mistakes, but he is a cool fighter: thanks to him.",
        "1... c5": "try to develop this sicilian i know so badly",
        "2. f4": "damn, what is that??? I have to study theory... i hate that. I hate openings :-)",
        "2... Nc6 3. Nf3 d6 4. h3": "I don't see the point of this move. It is barely a development. If Bg4, then it is justified. But if my bishop does that move, then take his knight, i lose a tempo in opening. Would not be a good idea.",
        "4... g6": "preparing my dearest fianchetto",
        "5. Nc3 Bg7": "here it is. If you want to disturb me with black you know what you have to do.",
        "6. a4": "well, heu... I am disturbed here....",
        "6... e6": "for my knight",
        "7. Bc4": "decisevely not a good move...",
        "7... Nge7 8. e5": "???",
        "8... d5 9. Ba2": "clear white bishop blocked for a good time",
        "9... a6 10. d4 cxd4 11. Nxd4 Nb4": "this was not necessary, but i had in mind the possibility to go on c6 with my other knight... and then, well,... i changed my mind after... ",
        "12. O-O Nxa2": "and to avoid having lost a tempo, i decided to annoy the rook there... not very clever from me.",
        "13. Rxa2 Bd7 14. b4": "considering the white pieces, you could hardly say there is a plan... ",
        "14... Nc6": "provoking",
        "15. b5": "fell into",
        "15... Nxd4": "first step of the trap",
        "16. Qxd4 axb5": "and this is the gained pawn",
        "17. a5 Rxa5 18. Rxa5 Qxa5": "now this won't be an easy pawn to keep as it is doubled.",
        "19. Bd2": "preparing the next discovery.",
        "19... O-O": "could look like a mistake, but, i have told to my self that, by now, my knig was in bad condition and a target to too many possible attack.",
        "20. Nxd5": "so i let him win this pawn back...",
        "20... Qd8": "am i that bad? considering now, you could say so. My only advantage here is the pair of bishop and the dark one is not very active...",
        "21. Ra1": "hopeflly he forgot something...",
        "21... exd5 22. Qxd5 Bc6": "no more surprise please",
        "23. Qxd8 Rxd8 24. Bb4 Bf8 25. Ba5 Bc5+": "making them all active in 3 moves. But i have to thank my opponent",
        "26. Kh2 b6": "i start seeing the mate here",
        "27. Be1 Rd4 28. Kg3 Ra4": "he cannot take my rook: it would mean the end of the game",
        "29. Rd1 Ra2": "this is where the pair of bishop forbid all defence for this pawn on c column",
        "30. Kg4 Rxc2 31. Rd8+": "not even afraid of the threats Bh4-f6x... seen why?",
        "31... Kg7 32. Rc8": "but i am not sure he has seen it",
        "32... Rxg2+": "now it is almost forced mate... there is a possible prolungation with the loss of the bishop on g3, but... ",
        "33. Kh4 Bd7 34. Rc7 Be7#": "pair of bishops..."
    },
    "url": "https://gameknot.com/annotation.pl/71st-gk-tournament?gm=32950",
    "gameName": "71st GK tournament",
    "players": "bluemarble (1370) vs. thitho (1732)",
    "opening": "Sicilian (B21), Grand Prix attack"
}