{
    "moves": {
        "1. e4 c5": "becomes a habit, now",
        "2. Nf3 d6 3. d4 cxd4 4. Nxd4 Nf6 5. Nc3 a6": "Najdorf... I'll have to renew it soon",
        "6. Be3": "i thought it was going to be a calm one",
        "6... Bd7 7. f3": "everything surprises me in this game",
        "7... e6 8. g4": "the white king has decided to expose himself",
        "8... h6 9. Qd2 Nc6 10. O-O-O": "Here is my first mistake: i thought white would not attack on the side where the king hid",
        "10... Qa5": "not a very clever move",
        "11. Nb3 Qc7 12. h4 O-O-O": "I thought that I could hide here",
        "13. Na4": "but then I saw my mistake!!!",
        "13... Qb8": "afraid of Bb6",
        "14. Nb6+": "and white found a better move",
        "14... Kc7 15. Nc4": "maybe Na5 was better?",
        "15... Kc8": "Already hoping for a draw... but of course I knew white had better options",
        "16. Bb6": "logical move... the first apparent answer would be to save the rook, but then comes the savage Nxd6... anyway, here white could have made many things I was afraid of.",
        "16... d5": "I decided to give me fresh air at the price of my rook",
        "17. Bxd8": "more than logical, apparently.",
        "17... dxc4": "eliminating some very dangerous attackers",
        "18. Bxf6 Qc7": "Of course not gxf, followed by mate on d7",
        "19. Bxc4 gxf6": "so now white has the quality AND a pawn. I may have resigned, but I wanted to play.",
        "20. Qe3": "preparing Nc5 or/and doubling the rooks.",
        "20... h5": "threatening Bh6, with the real prospect to \"give air\".",
        "21. g5 fxg5 22. hxg5": "feeling already better and viewing some kind of possibilities, now...Can you believe it? I was already hoping for...",
        "22... Bd6": "... planning to recuperate at least my pawn",
        "23. Kb1 Bf4": "job done",
        "24. Qc5 Ne5 25. Qxc7+ Kxc7": "and now threatening to take back another pawn...",
        "26. Nc5": "not anymore: if Nxf3, loses the Bd7",
        "26... Bxg5": "let's take our gold.",
        "27. Rhf1": "threatening f4",
        "27... Bf4": "blocking. I love Nimzovitch.",
        "28. Nd3 Nxd3 29. Rxd3": "white really seems better, still, and with a little bit of patience, would have won. But white disregards h5-4-3...",
        "29... h4 30. Rfd1": "still disregarding... ",
        "30... Bc6": "considering it well: white has no obvious attack here. But once again, with a little bit of patience, going back to Rh1, R3d1, Bf1... ",
        "31. Rh1": "at last.",
        "31... h3": "I can't let him breathe anymore.",
        "32. b4": "a little bit late for that",
        "32... b5": "and now, the clear white bishop is passive for a good while.",
        "33. Bb3 h2": "and the black threat is more and more real",
        "34. c3": "trying to get the bishop back in the game",
        "34... Rh3": "threatening Bxd4",
        "35. Bc2": "interesting defense, but...",
        "35... Rg3": "yep! this is the clear one! If Rxh2, then Rg1+ gains the rook",
        "36. Rdd1": "and this is necessary to avoid Rg1+ with the protection of the pawn...",
        "36... Rxf3": "one more pawn inside... and protecting the pawn h2 again",
        "37. Rde1": "I expected him to protec c3.",
        "37... Rxc3": "well, i see no reason not to take it.",
        "38. Re2 f5": "I didn't consider Rh3: the pawn h2 has played its role and cannot be dangerous anymore. The central pawn, on the other side...",
        "39. Rhxh2 Bxh2 40. Rxh2": "and now, the favor is reversed: i have one pawn",
        "40... Bxe4": "and I have two...",
        "41. Bxe4": "almost no choice...",
        "41... fxe4 42. Re2 Rc4 43. a3 Kd6": "\"and now, the tragic story\".",
        "44. Kb2 Ke5 45. Kb3 Kf4 46. a4": "hm... have i been so naive in the past?",
        "46... Kf3 47. Re1 Kf2 48. axb5 axb5 49. Rd1 e3": "white resigns. I have been lucky and/or white has been too optimistic around move 22. I liked the game, because it tought me a lot of things about the power of pawns and bishops."
    },
    "url": "https://gameknot.com/annotation.pl/73rd-gk-tournament?gm=34363",
    "gameName": "73rd GK tournament",
    "players": "gajef (1743) vs. thitho (1776)",
    "opening": "Sicilian (B90), Najdorf, Byrne (English) attack"
}