{
    "moves": {
        "1. e4": "an interesting game with fred. Almost gave me the first place in the round 1...",
        "1... c5 2. Nf3 d6 3. d4 cxd4 4. Nxd4 Nf6 5. Nc3 a6": "Najdorf again... is there a mode, or what?",
        "6. Be2": "i may be wrong but this seems to me a little bit shy",
        "6... e6": "with Najdorf, I try to find a way to protect my king first.",
        "7. O-O Be7 8. Bg5": "...hm... will he let me castle?",
        "8... h6 9. Bh4 Qb6 10. Rb1 O-O": "one of the very rare games with Najdorf where I felt comfortable to rook",
        "11. Kh1": "obviously, he didn't like the diagonal I took with my queen",
        "11... g5": "and more: i castled, and then saw an opening on our king side.",
        "12. Bg3 e5": "I am forcing him, so I recuperate time to develop (i am a little bit late)",
        "13. Nf3": "the dark bishop and the (now f3) knight have moved a lot...",
        "13... Nc6 14. Na4 Qb4": "so has my queen... And she will dance.",
        "15. c3": "I was planning Nc3, Nxe4, Nxe4, Qxe4...",
        "15... Qxe4": "but we saved time :-) one (fragile) pawn ahead.",
        "16. Bd3": "here starts my queen's dance.",
        "16... Qg4 17. Nb6 Rb8 18. h3 Qh5": "continuing.",
        "19. Nxc8 Rbxc8 20. Be2 Qg6": "and again... there are many threats here, but white castle is not as opened as it looks like with moves like g4.",
        "21. Nh2 Rfe8 22. Ng4 Rcd8": "planning to ocupate the center, now.",
        "23. Nxf6+": "this really helped me.",
        "23... Qxf6 24. Qd5 Qe6": "and this ends the queen's dance, reforcing the center. May seem silly, but this strong center will save the day",
        "25. Qxe6 fxe6": "here we are: the two white bishops are blocked by a strong center. ",
        "26. b3 d5 27. f3 Bf6 28. Bf2 e4": "let's go!",
        "29. fxe4 Bxc3": "and now, I have a passed pawn...",
        "30. Bh5": "interesting, i did not expect that. But i think fred was trying to push me to draw.",
        "30... Ref8 31. Bc5 Rf4 32. exd5 Rxd5": "here is my passed pawn. But the next moves will be very careful.",
        "33. Be3 Rff5": "much much better than exchange because of potential Bf7 arriving.",
        "34. Bf3 Rd3 35. Bb6": "of course not the tempting Be4, losing on Rxf1+",
        "35... Rf8 36. Kg1 Kg7": "preventing the very next move",
        "37. Bg4 e5 38. Be2": "a little bit confusing.",
        "38... Rd7 39. Bg4": "White does not know what to do... or does he?",
        "39... Rdf7 40. Bf3": "loses.",
        "40... Bd4+ 41. Bxd4 Nxd4 42. Bd5": "this definitely loses, but anyanyway the exchanges would have come and let me win this very interesting game.\nHere, the continuation is Ne2+ and white loses a rook. But on Bh5, which unauthorizes Ne2, there are good continuations following the exchange. I think"
    },
    "url": "https://gameknot.com/annotation.pl/73rd-gk-tournament?gm=34364",
    "gameName": "73rd GK tournament",
    "players": "fred_s (1657) vs. thitho (1776)",
    "opening": "Sicilian (B92), Najdorf, Opovcensky variation"
}