{
    "moves": {
        "1. Nc3 Nf6 2. Nf3 d5 3. d4 e6 4. g3 c5 5. e3 cxd4 6. exd4 h6 7. Bg2 Bb4 8. Bd2 Nc6 9. O-O b6 10. a3 Bd6 11. Nb5 Ne4 12. Ne5 Ba6 13. a4 Nxd4 14. Nxd4 Bxf1 15. Bxf1 Nxd2 16. Bb5+ Kf8 17. Ndc6 Qc7 18. Qxd2 a6 19. Bd3 Bxe5 20. Nxe5 Qxe5 21. Qb4+ Ke8 22. Bxa6 h5": "It was good to pass up RxBa6, because that would actually be a trade--Qb5+ followed by QxRa6.  Black can't castle because of white's queen and bishop.\n\nInstead of pushing the h pawn, what would be wrong with threatening white's c pawn with Qc7?  This protects Pb6, but is easily countered with Pc3.  Pushing the h pawn isn't that bad an idea.",
        "23. Qxb6 Ke7 24. Qb4+ Kf6 25. Re1 Rhb8 26. Qh4+ Qg5": "I thought blocking with the queen was a real good idea too.  Trade down, you're a pawn ahead!  You probably are already well aware of this, but...\n\n7/8 is close to 1.\n6/7 is not as close.\n5/6 is further yet\n...\n1/2 becomes an overwhelming 2 to 1 advantage.  :)",
        "27. Bb5 Qxh4": "Has the further advantage of doubling white's h rank pawns.",
        "28. gxh4 g5": "This I'm not as confident about.  White's h4 pawn is pretty easy pickings.  No need to break up your own pawns doing something Kf5 Kg4 KxPh4 could eventually accomplish.\n",
        "29. hxg5+ Kxg5 30. b3 Rbc8 31. Bd3 Rcg8": "One thing to watch out for (when lining up kings and rooks) is that rooks behind kings are actually exposed.  To make matters worse ALL your pieces (except the king) now occupy white squares where they are vulnerable to the white bishop.\n",
        "32. Kh1 Rac8": "If white moves his bishop (to sacrifice a pawn, for example) the g8 rook could be left defenseless.\n",
        "33. Ba6 Rxc2": ":(\n",
        "34. Rg1+ Kh4 35. Rxg8 Kh3 36. Rg3+ Kh4 37. Kg2 f5 38. Rg6 e5 39. Rd6 Rd2 40. Bb7 d4 41. Rd5 Re2 42. Kf1 Rb2 43. Rxe5 f4": "?  What was wrong with RxPb3?  That forces white to move or protect the bishop, after which Pf4 works.  It will take white two bishop moves to threaten Ph5.\n",
        "44. Bf3": "Or, nope.  Only one.  Rb1+ Rg1+ only tightens the noose.  Re2 offers the ever so slim hope of RxR, freeing the king.  But that is as faint as Ke2.\n\nI suspect this analysis revealed nothing useful to you.  I should look at some games you won and complement you on the good moves.\n",
        "44... Rb1+ 45. Kg2 Rg1+ 46. Kxg1 d3 47. Kg2": "?  The king doesn't need to be there for RxPh5#.\n",
        "47... d2 48. Rxh5#": ""
    },
    "url": "https://gameknot.com/annotation.pl/74th-gk-tournament?gm=35462",
    "gameName": "74th GK tournament",
    "players": "blackeagle (1275) vs. dougcosine (1362)",
    "opening": "Dunst (Sleipner, Heinrichsen) opening (A00)"
}