{
    "moves": {
        "1. e3": "Van't Kuijs opening (A00), is a opening that does not give out central control. (For anyone that does this opening: You can still play it, but you have to perform an entire opening sequence that helps you gain control of e4,d4, e5, d5.)",
        "1... c5": "best opening move performed by black",
        "2. Bc4": "I didn't like this move and the reason is that your opponent wouldn't magically play the f-pawn on their second move. It is suicidal.",
        "2... e6": "Tackles the bishop's line.",
        "3. Nf3": "The usual knight developement. A correct play.",
        "3... Nc6": "The play is even, with nothing to risk.",
        "4. h4": "White played a ridiculous move that wastes time. The correct move was 4.d4.",
        "4... Bd6": "I didn't like this move too much. 4...d5 was a better opportunity for advancement",
        "5. Ng5": "White decided to mess up my ability to castle on his next move or probably had his knight tempt my queen (which is not going to happen).",
        "5... Nh6": "I spotted 6.Nf7, but it isn't really necessary. Better was 5...Ne5!.",
        "6. Qf3": "Still trying to attain my Queen or Rook, White played this and forgot about 1. his position and 2. my knight.",
        "6... Ne5": "I forked his Bishop and his Queen, so he hurried to move his Queen and forgot about my knight completely.",
        "7. Qf4": "?. 7.Qe2 was correct.",
        "7... Nd3+": "! Knight and Bishop sacrificed to attain Black's Queen. ",
        "8. Bxd3 Bxf4 9. exf4 Nf5": "I tried to tempt White by this move.",
        "10. h5": "?! Does White understand what he is doing? Dubious pawn push.",
        "10... g6": "!? Risky, but well worth considering. I tried to stop White's h-pawn and with this move, there is only one way to kill his pawn. If 11. h6, It is a wasted move.",
        "11. h6": "The pawn is trapped and White is forced to find strong developement options or he will slowly crumble.",
        "11... O-O": "Castled to protect f7-pawn with the rook",
        "12. b3": "With this move, White decide to try to sacrifice a bishop to obtain my rook. The structure of the move is poor.",
        "12... Qf6": "I demolish White's plan with this attack to crush White's rook.",
        "13. c3": "?. Clearly, White now has several problem to control. Correct play is 13.Nc3.",
        "13... Nd4": "A crazy knight move.",
        "14. Bb2": "Good response, but the knight was underestimated again!",
        "14... Qxf4": "I begin my second assault with this take. Both sides have an attacked knight!",
        "15. Ne4": "White's knight is safe.",
        "15... Qc7": "?!. I completely forgot about 15...Nf3+!.",
        "16. Nf6+": "A premature attack that forces my King to h8.",
        "16... Kh8 17. cxd4": "An okay move; White has to be really careful about his next move",
        "17... cxd4 18. Bxd4": "Giving up the c1-a3 diagonal, White gave up c1, thus giving me a free rook.",
        "18... Qc1+ 19. Ke2 Qxh1 20. Ng4+": "White exposed my King to his Bishop and still hung on to his h6-pawn which is not a good option for him.",
        "20... Kg8 21. Ke3": "A clumsy King move. 21.Na3 is a smarter move.",
        "21... Qe1+": "Better is 21...Qxg2.",
        "22. Be2 f5 23. Nf6+": "White begins to annoy me with checks, but he lacks material to do so.",
        "23... Kf7 24. Nxh7": "A move that sends the Rook to g8",
        "24... Rg8 25. Ng5+ Ke7 26. h7": "White's h-pawn is prepared to promote",
        "26... Rf8": "White is only push my Rook to strategic locations ",
        "27. Bg7 Rg8": "?? Blunder. Better was 27...Re8",
        "28. a4": "Unbelievable!!! White ignored 28.h8=Q and decided to do this weak move. Realizing that he'll spot this, I hurried to move my Rook to e8.",
        "28... Re8 29. Kf3": "White did a weird move.",
        "29... b6": "I begin to develope the rest of my pieces. ",
        "30. Bc4": "Forget 30...Qe4+?, I was aiming for long distance check.",
        "30... Bb7+ 31. Kg3": "To the least interest for me, his pieces are still well guarded.",
        "31... f4+": " 31...Bd5 was better. At least this move helped me get something back.",
        "32. Kxf4 Qxf2+": "White is losing material because of his failed pawn pass.",
        "33. Nf3": "Another block. This time, the annoying and brutal knight is preventing me from doing something good.",
        "33... Bxf3": "I sacrifice my bishop...",
        "34. gxf3": "and recieved a way to destroy White's position.",
        "34... Qh4+": "I chose to gain the pawn instead of a Rook.",
        "35. Ke3": "The only move besides 35.Ke5?? d6#.",
        "35... Qxh7 36. Bd4": "White retreats and puts strong pressure on me on his next moves.",
        "36... Qh6+": "I just want him to feel the same way as me when his knight annoyed me.",
        "37. Kd3 d5 38. Bb5": "Because of 37...d5?!, he took the chance to try and regain what he lost.",
        "38... Qf4": "I ignored my attacked Rook,...",
        "39. Nc3": "and he did not take it.",
        "39... Qxf3+ 40. Kc2": "40.Be3! was better.",
        "40... Qf5+": "Black is making it almost impossible for White to block.",
        "41. Kd1": "I really didn't like this response. Better was 41.Bd3.",
        "41... Qf1+": "? There goes my Queen. The tables slightly turned away from me.",
        "42. Bxf1 Ref8": "Threatenes 43.Rxf1, but the only sucess with this move is the start of my rook ",
        "43. Bd3 Rf4": "Targeting the dark-square bishop.",
        "44. Be3": "I am creating unsucessful premature attacks.",
        "44... Rf6 45. Kc2": "Guarding the unguarded light-squared bishop.",
        "45... e5": "Preventing 46.Bd4.",
        "46. Bg5": "A critical pin!",
        "46... Rc8": "Preventing 47.Nxd5.",
        "47. Bxg6": "White sucessfully tormented my Rook.",
        "47... Ke6 48. Bh7": "White has still not taken my defenceless Rook for a bishop.",
        "48... Rf7 49. Bg6": "? Wrong move. Full retreat was better.",
        "49... Rg7": "!",
        "50. b4": "!? I have two options 1) 50...a5 or 2) 50...Rxg6.",
        "50... Rxg6": "I take option two for granted.",
        "51. Be3": "?? Why didn't White do 51.Rg2?",
        "51... d4": "White's Knight is completely gone!",
        "52. Bf2": "I did not like this move, though it was White's only available retreat.",
        "52... dxc3": "The tides turn away from White.",
        "53. dxc3 a5": "Not bad, but 53...Rg2! is better.",
        "54. b5": "Not White's best move. 54.b5!? Rg2!.",
        "54... Kd5": "! Found a way to include both rooks.",
        "55. Bxb6 Rxb6": "The endgame starts, but it is not a draw.",
        "56. Kd3": "White's failed opposition.",
        "56... e4+": "Okay for Black, but better was 56...Rc4!.",
        "57. Kc2": "White's best move at the time.",
        "57... Rc4": "Best at move 56, but it is still helpful.",
        "58. Kb3 e3 59. Rd1+ Kc5": "Abandoning the Rook would have killed my game.",
        "60. Re1 Rxb5+": "! A move that taunts White to get my rook.",
        "61. Kc2 Rxa4": "White has one pawn left; how is White going to use his pawn?",
        "62. Rxe3 Ra2+ 63. Kd3 Ra3 64. Re5+ Kc6 65. Re6+ Kb7": "White is trying to get revenge on me.",
        "66. Kc4 Rab3 67. Re7+ Kc6 68. Re6+ Kb7 69. Re7+ Kc6 70. Re6+ Kb7": "White, using impulsivenes, realizes that he is not suceeding and stops checking me for a while.",
        "71. Kd4 a4": "A queen completely turns the tides, however, there is no rush.",
        "72. c4": "White forgot about 72...Rb5b4.",
        "72... Rb5b4 73. Rd6 a3": "One step closer to promotion. I am afraid that I'm having to much priority on my Rooks and I am required to sacrified one of them.",
        "74. Rd7+ Kc6 75. Re7 Kd6": "Started to chase the Rook around while having fun doing it with my king!",
        "76. Re3": "My only chance to fulfill the needed sacrifice.",
        "76... Rxe3 77. Kxe3 Rxc4": "White is completely hopeless reguardless of what he does.",
        "78. Kd3 Ra4": "Better was 78...Kd5! ending the game faster.",
        "79. Kc3 Kc6 80. Kb3 Kb5": "This is basically the end of White.",
        "81. Kc3 a2 82. Kb2": "Run away White! Run away!!",
        "82... a1=Q+ 83. Kb3 Qa2+ 84. Kc3 Qc4+ 85. Kd2 Qb3 86. Ke2": "I would have ended the game faster if I did the Staircase.",
        "86... Qc3 87. Kf2 Ra2+ 88. Kf1 Qf3+ 89. Ke1 Qe2#": "This game lasted two months and changed the way I played chess."
    },
    "url": "https://gameknot.com/annotation.pl/78th-gk-tournament?gm=37941",
    "gameName": "78th GK tournament",
    "players": "0ne77 (978) vs. austinwkeller (688)",
    "opening": "Van't Kruijs opening (A00)"
}