{
    "moves": {
        "1. e4": "This game was from the 4th round of the 78th Gameknot tournament, and myself and my opponent were the favourites for  winning the round. Our other game was a draw and so this result in effect decided the round. This game started quietly but  quickly got very complicated. I more or less fall into the complications, which were hard to calculate and required accurate moves from both sides. And as always, some luck always helps :-) ",
        "1... e6 2. d4 d5 3. exd5 exd5 4. Nf3 Nf6 5. Bg5 Be7": "There's not much to say about the opening moves I played except they are not particularly ambitious..\n",
        "6. Nc3 c6 7. Ne5 Nbd7": "Threatening Nxe5 de Nd7 Bxe7 Qxe7 attacking the e pawn twice",
        "8. f4": "solidifying the knight in it's aggressive post. The drawback is that it weakens white's kingside",
        "8... O-O 9. Bd3 h6": "My opponent has delayed castling to attack me  so my plan is to attack while the king is still in the centre and I have the better development. If I wait his extra space advantage and attacking pieces could become a problem",
        "10. Bh4 c5": "a temporary pawn sacrifice to open the centre",
        "11. dxc5 d4": "playing the attacking move",
        "12. Bxf6 Nxf6": "Better was dxc3 Bxe7 Qxe7 and I'm pinning the knight threatening f6 so 0-0 Nxe5 fe Qxc5+ Kh1 cb winning a pawn.",
        "13. Ne2 Bxc5 14. Qd2 Qe7": "This is a bad move as Bb4 isn';t much of a threat.  Better was Nd5 aiming for the vulnerable e3 square.",
        "15. Bc4": "this turns out to be a good diagonal for the  bishop and white is immediately threatening Ng6 tactic",
        "15... Bb4 16. c3 dxc3 17. bxc3": "Here I thought I was in trouble because if I played Bc5 then I saw he had the tactic Ng6 which seems really strong. So I went for my own tactics. I didn't see how I could survive Ng6 but I could play Qe4! Nxf8 Qxc4 and white's knight cannotr escape. Not seeing Qe4, I played a very dubious tactical shot",
        "17... Ne4": "? This tactic doesn't work if he simply plays Qd4 then I am lost. He attacks my knight, protects his c4 bishop and still threatens Ng6+ winning the exchange. I can't defend against all of these threats. Funny how a slight innacuracy can be the turning point on the game.",
        "18. Qe3": "This seems strong, two of my pieces are attacked, he is protecting c3 and it looks like I must lose material but luckily for me there is an only move and I find it",
        "18... Bf5": "! This protects the knight and protects against the Ng6 move which was the move he keeps trying to get in. But why can't he take now on b4?",
        "19. g4": "I saw that If he plays cxb4 then I play  Qxb4+ Kf1  Nd2+ Kf2 Nxc4 getting the piece back with a strong attack. My opponent also saw this and played g4, which attacks my bishop but he gives me have a forcing move",
        "19... Qh4+": "the king is on the move and this gives me the tempo to save my bishop",
        "20. Kf1 Bc5": "the forcing move, white's position looks really uncomfortable now and this is another tempo to save my white square bishop this time",
        "21. Nd4": "a useful pin as it turns out",
        "21... Bh7": "I have saved my pieces and have the better position  but I am being driven back and white has some resources, mainly due to his aggressive knight and bishop",
        "22. f5": "attacking the knight. I had to choose between Nd6 and Nf6. I liked the fact that Nd6 attacked the Bishop which was causing me some problems. ",
        "22... Nd6 23. Bb3 Rae8": "moving the least active piece into play and creating a new pin",
        "24. h3": "I was threatening to take the g4 pawn taking advantage of the knight pin",
        "24... Re7": "preparing to double rooks, increasing pressure along the e file",
        "25. Qf4 Kh8": "Playing safe, but I could have played Nxf5! Nxf5 Bxf5 Qxf5 Rxe5! White's queen cannot move off the f file because I have a mate threat on f1. Qf4 Re6! is powerful because I am threatening Rf6 with a skewer and if Bxf6 fe Qxf8 Kxf8 I am material up and still threatening mate on f2. But this is a computer line that I didn't see in the game, but could have found if I looked for the forcing move Nxf5",
        "26. Kg2 Rfe8": "attacking e5",
        "27. Nd3": "? This was the final error",
        "27... Re7e4": "! Iit helps if you look first for the most forcing moves before anything else. This move forces the queen back and starts a combination based on the weakness of e2 and black's strength down the e file",
        "28. Qf1 Bxd4": "The combination involves getting rid of the protector of e2  after which it is all over",
        "29. cxd4 Re4e2+ 30. Kf3": "White had to play Qxe2 Rxe2 Kf3, the king is walking into a mating net",
        "30... Re8e3+ 31. Kf4 Qg5#": "or Qg3#. I think that I definitely had some luck in the middlegame when my opponent missed an accurate move which would give a strong advantage to white, but on the whole I think I came up with a good plan, taking advantage of white's attacking play and pawn moves to open the centre and play against the white king position. It was probably the most tactical game I had played on gameknot up to them and an enjoyable one, moving straight from a dull looking opening to a very exciting battle."
    },
    "url": "https://gameknot.com/annotation.pl/78th-gameknot-tournament-18-5-2012?gm=49524",
    "gameName": "78th Gameknot tournament 18/5/2012",
    "players": "mhadis (1619) vs. mantamatt (1755)",
    "opening": "French (C01), exchange, Svenonius variation"
}