{
    "moves": {
        "1. d4 Nf6": "To d4, this is one of the few response I use. I not like others as much as this.",
        "2. Nf3 d5 3. c4 c6 4. e3 Bf5 5. Nc3 e6": "Normally I like to play g6 here follow by Bg7 but I was try something new.",
        "6. Nh4 Bg6 7. Nxg6": "Not only does this move eliminate g6 from play, I lose bishop very early. (Strange fact: When I was child this called elephant but I learn in Arabic not English)",
        "7... hxg6 8. h3 Be7 9. Bd2 Nbd7": "Defend e5 and c5",
        "10. Rc1 O-O 11. c5": "Take away Bishop queenside and Qb6.",
        "11... e5": "Try and attack pawn structure.",
        "12. Bd3 Re8 13. O-O Qc7 14. b4 Nf8 15. Ne2 Ne6": "Attack d4 and c5",
        "16. dxe5 Qxe5 17. a3 Ne4 18. Be1 a5": "Try to find a way to break this pawn structure.",
        "19. f3 axb4 20. axb4 Ne4xc5": "Probably the move which lead to my draw result. Though there are not many other options I can to try.",
        "21. bxc5 Bxc5 22. Rb1 Bxe3+": "Compensation for my knight.",
        "23. Kh1 Ra3 24. Bb4": "Attack the castle and diagnol ",
        "24... Ra7 25. Re1 Rea8 26. Bc2 b5 27. Rf1 Re8 28. Bc3 d4 29. Bd2 Bxd2 30. Qxd2 c5 31. f4 Qb8": "I not like to full retreat but I not see any better move",
        "32. f5 gxf5 33. Bxf5 b4 34. Nc1 Qd6 35. Nd3 c4": "Seeing the path to endgame.",
        "36. Qxb4 Qxb4 37. Nxb4 g6 38. Bxe6 Rxe6": "This is first time I see this in 4 or 5 year. I recall this type of position draw but my opponent disagree.",
        "39. Rfd1 d3 40. Rbc1 Re4 41. Nd5 Kg7 42. Nc3 Re6 43. Nb1 Rc7 44. Kh2 Rec6": "Any hope of win occur if I can protect pawns.",
        "45. Kg3 f5 46. Kf2 Kf6 47. Ke3 Kg5": "I should go the other way but I see nothing decisive there so I try a new way. GK say this is mistake.",
        "48. Rc3 Kf6 49. Rdc1 Ke5": "With no real way to push into otherside without lose I go back to original plan.",
        "50. Ra3 Re7 51. Nc3 Kf6+ 52. Kd2 Kg5 53. g3 Re8 54. Raa1 Rb6 55. Rab1 Rxb1": "At this point I know the game will end in draw no matter how long it will take.",
        "56. Rxb1 Rh8 57. Rh1 Re8 58. Nd5 Re2+ 59. Kc3 Rg2 60. h4+ Kh6 61. Kxc4 Rxg3 62. Kc3 g5 63. hxg5+ Kxg5 64. Rf1 f4 65. Nxf4 d2+ 66. Kxd2 Ra3": "Most people would accept a draw here but not my opponent",
        "67. Nd3 Rb3 68. Ke3 Ra3 69. Kd4 Ra4+ 70. Ke5 Ra5+ 71. Ke6 Rb5 72. Rg1+ Kh4 73. Nf2 Kh5 74. Ne4 Ra5 75. Nf6+ Kh6 76. Nd7 Ra6+ 77. Kf5 Ra5+ 78. Ne5 Rb5 79. Rh1+": "White look for a way to checkmate, but I play this endgame quite a bit before so I know not to play the losing move.",
        "79... Kg7 80. Rc1 Ra5 81. Rc6 Kf8 82. Kf6 Kg8 83. Rc7 Ra1 84. Rg7+": "Kh8 loses immediately",
        "84... Kf8 85. Ng6+ Ke8 86. Ke6 Kd8 87. Ne5 Rd1 88. Nc6+": "Ke8 loses immediately",
        "88... Kc8 89. Nb4 Re1+ 90. Kd6 Rd1+ 91. Nd5 Rc1 92. Nb6+ Kb8 93. Na4 Rb1 94. Nc3 Rc1 95. Ne4 Kc8 96. Rg8+ Kb7 97. Nc5+ Ka7 98. Kc6 Rc2 99. Rg3 Kb8 100. Rg1 Rc4 101. Ra1 Rc2": "Any other move is lose for me I think",
        "102. Rf1 Rc4 103. Rf8+ Ka7 104. Rf7+ Kb8 105. Rf1 Rc2 106. Rh1 Rc4 107. Re1 Rc2 108. Kd5 Rd2+ 109. Kc6 Rc2 110. Ra1 Rc4 111. Rh1 Rc2 112. Re1 Rc4 113. Kd5 Rc2 114. Rb1+ Kc7 115. Ne4 Ra2 116. Nd2": "And finally a draw reach"
    },
    "url": "https://gameknot.com/annotation.pl/50-move-rule?gm=55582",
    "gameName": "50 move rule",
    "players": "geniusacamel (2045) vs. eaglei (1888)",
    "opening": "Queen's pawn game (A46)"
}