{
    "moves": {
        "1. d4": "This is a short game I played in a GK tournament recently. There were a range of tactics, nearly all of which were missed by at least one player.",
        "1... Nf6 2. d5": "This is unusual - in my experience, white normally follows up with 3.c4 and attempts to squash black's position. As a move I don't like it for white, and the only game in the database that started like this was won by black.",
        "2... c6": "I thought exchanging seems sensible - the line I have played most often is 3.c4 cxd5 4.cxd5 e6 5.d6 Qb6 6.Bf4, which leads to a complex position, as white must hang onto the pawn. In that line, I don't really like either player's position.",
        "3. dxc6 Nxc6": "3.dxc6? is certainly a mistake, handing black a central pawn majority and a development advantage.",
        "4. Nc3 d5": "I wanted to prevent the knight from having anywhere it could take up an outpost - not that I thought this likely, but it couldn't hurt, and in any case I needed to release my bishops. Finally, this unleashes the possibility of ...Qa5 and ...d4.",
        "5. Bf4 d4": "Driving back the knight, due to the threat of ...Qa5+. This is the first tactic my opponent missed.",
        "6. Nb5 e5": "No need to win the knight immediately.",
        "7. Bg3 Qa5+ 8. c3 Qxb5": "Now, if 9.cxd4??, ...Bb4. The only tactic we both saw.",
        "9. Rb1": "Providing backup for the b-pawn, but not oing much else. However, there is a devious trick that in turn, I missed...",
        "9... Bf5": "Aiming to dislodge the rook...",
        "10. e4": "Whoops! There goes my extra peice! I decided to try and make the most of a bad job. My next move was aiming to exchange on c3, then swap queens, in order to leave me with an extra pawn and far superior development.",
        "10... Qa5 11. Qb3": "I don't know why my opponent didn't take the bishop immediately - I calculated this to leave  me with not only extra material, but a far superior position.",
        "11... dxc3 12. exf5": "Blunder, again!",
        "12... c2+": "With a simple finish, e.g. 13.Ke2 Nd4+ 14.Ke3 Ng4+ 15.Kd3 cxb1=Q+ 16.Qc2 Qxc2#"
    },
    "url": "https://gameknot.com/annotation.pl/52nd-gk-tournament?gm=25378",
    "gameName": "52nd GK tournament",
    "players": "jimmygunawan (1582) vs. goingdown (1687)",
    "opening": "Queen's pawn game (A45)"
}