{
    "moves": {
        "1. e4 c5 2. Nf3 d6 3. d4 cxd4 4. Nxd4 Nf6 5. Nc3 g6": "Las negras deciden la defensa a jugar. Dragon !!!!,veremos como se defiende..",
        "6. Be3 Bg7 7. Bc4": "una jugada ofensiva controlando el centro del tablero e iniciando un ataque hipotetico",
        "7... Bg4": "jugada pasiva sin ningun objetivo y saliendose de la linea del dragon lo que provoca perdida de tiempo que se va a ver posteriormente . F3 es la posicion del peon en esta defensa y ahora el me obliga a seguir la teoria  y provocando mas perdida de tiempo en su contra y ganar mas iniciativa",
        "8. f3 Bd7": "en ajedrez se evita mover la misma pieza dos veces en la apertura.. pero es la consecuencia de un error teorico",
        "9. Qd2 O-O 10. O-O-O": "Me imagino que le tiemblan las piernas cuando me enroco largo.",
        "10... Qc7": "jugada discreta y muy pasiva. pienso que Cc6 es mejor",
        "11. Bb3": "mantengo el alfil en la diagonal apuntando para el flanco Rey",
        "11... a6": "la unica jugada ofensiva que tiene para contraatacar pero el error de manener el caballo en b8 no lo ayuda en nada",
        "12. h4": "comienza el ataque real",
        "12... h5": "Una jugada tipia de esta linea defensiva pero 3 perdidas de tiempo no avalan esta jugada (tipica de GM) como buena",
        "13. g4 hxg4 14. h5": "sacrifico el peon para abrir el las columnas para las torres y aprovechando la irregularidad del negro durante la apertura",
        "14... Nxh5": "No tomar el peon podria ser una opcion y preparar el escape del rey pienso que era lo mejor pero subestima o desconoce las proximas 5 jugadas",
        "15. Nd5": "controlando el centro y retirando la dama hacia posicion defensiva",
        "15... Qd8 16. fxg4 Ng3": "dentro de las pocas opciones que tenia.No estoy seguro que esta es la mejor. pero de todos modos tiene que sacrificar para frenar el ataque",
        "17. Qh2": "Esto promete ser una partida brillante en ataque. se salvara?",
        "17... Nxh1 18. Rxh1": "ahora tiene que sacar una varita magica para escaparse de alli. Es un pantano provocado por jugadas innecesarias durante una defensa tan delicada y agresiva como la siciliana Variante dragon !!",
        "18... f6": "?? Cronica de una muerte anunciada. es como un  tiro de gracia que evita al contrincante de una muerte lenta y pesarosa Cxe7    .\r\nsi 18.. T e8 19. Dh7 ,rf8 20.Ah6,Axh6 21. Dxh6,Rg8 22. Dh8    ",
        "19. Nxe7#": "mate !!"
    },
    "url": "https://gameknot.com/annotation.pl/53-th-fast-siciliana-dragons-variant?gm=21930",
    "gameName": "53 th Fast Siciliana Dragon's Variant",
    "players": "rromeroh (1596) vs. oneball (1405)",
    "opening": "Sicilian (B72), dragon, classical attack"
}