{
    "moves": {
        "1. e4 e6 2. Nf3 d5 3. Nc3 Nf6 4. e5 Nfd7 5. d4 c5 6. Bg5 f6": "A move that is more often played in the regular form of the Two Knights French when White's bishop is posted to f4.",
        "7. exf6 gxf6": "Black is well aware that there may be potential checks on the short h5 diagonal leading to his king. However, this is not fatal and, in return, it is likely that he will soon have a solid batch of pawns in the centre. ",
        "8. Bh4": "This is the best square: White will scrutinize the security of Black pawns from a safe distance. His share of control of the centre will soon be conducted entirely by pieces alone.",
        "8... Be7": "Prudent: Other moves would allow White the option of tactics based on Ne5 at some point.",
        "9. Qd2": "Works well. The move suggested in the e-book is different: It may be possible to play 9.Qe2 here; attacking the e-pawn while retaining the queen on the d1-h5 diagonal.\nWhite probably didn't like this idea because it blocks in the f1 bishop. Nevertheless, White is already ahead in development and would have time to deploy the bishop to either h3 or g2.",
        "9... Nc6 10. O-O-O O-O 11. Qh6": " ",
        "11... Rf7 12. dxc5 Nxc5 13. Be2 Bd7 14. Rhe1 Qa5": "So - the game is a ''draw'' in the centre: Black has his central pawns but they are opposed by considerable fire-power and their further advance is out of the question just now.",
        "15. Kb1 b5": "A good idea: White is hardly going to oblige by accepting the pawn as this would open the b-file against his own king. But if he doesn't take it then the pawn will advance further and give Black an initiative.",
        "16. Nd4": "The best reply and very necessary. White needs to give his opponent something to think about on the king-side. The text introduces threats stemming from Bh5 and possibilities of adding a rook to the attack via e3.",
        "16... Na4": "A mistake: I think the best move here was 16...Bf8. The game would then be approximately level after 17.Qf4 [or first the capture Nxc6] 17...b4 18.Bh5 Rg7 [18...bxc3 fails to 20.Bxf7 Kxf7 21.Nxc6 Bxc6 22.21.Bxf6 with considerable advantage.] 19.Nxc6 Bxc6 20.Ne2\n\nTwo other key variations also suggest that Black needed to defend:\n\n[A] 16...b4 17.Bh5 Rg7 18.Nxd5! exd5 19.Nxc6 Bxc6 20.Rxe7 Rxe7 21.Bxf6 with a won position.\n\n[B] 16...Nxd4 17.Rxd4 Na4 [18...b4 is again answered by 18.Bh5] 18.Bh5 Nxc3 19.bxc3  Rg7 when 20.Re3 will end Black's queen-side attack and give White the initiative and an advantage.",
        "17. Nxd5": "Thematic to the tactics in the position. However, better still  again was 17.Bh5. \nClearly White was worried about the disruption to his king's pawn cover. However his own threats are more powerful:\nAfter 17.Bh5 Nxc3 18.bxc3 Rg7 18.Nxe6! is the strongest of three possibilities. 18.Rxe6 is also good; as is 18.Nxc6",
        "17... exd5 18. Bh5": "Back on track.",
        "18... Rff8": "An unfortunate  blunder. Something like 18.Raf8 had to be tried but Black's centre has been destroyed and White would now hold a winning advantage. For example: 18...Raf8 19.Bxf7 Kxf7 20.Nxc6 Bxc6 21.Rxe7! Rxe7 22.Bxf6.\n\nBack at moves six and seven, Black made some important decisions. But in the end both the short h5 diagonal White's pressure against f6 turned out to be significant factors after all.",
        "19. Nxc6": "Black resigned. "
    },
    "url": "https://gameknot.com/annotation.pl/jackal-attack-with-6-f6-dresden-ger?gm=32402",
    "gameName": " Jackal Attack with 6...f6.  Dresden. GER",
    "players": "Arp A (2089) vs. Sorensen B (2240)",
    "opening": "French (C00), Wing gambit"
}