{
    "moves": {
        "1. d4 f5 2. g3 Nf6 3. Bg2 g6 4. Nh3": "Typical Dutch defence, Blackburne variation. I never play Dutch defence. But this is Dutch defence mini tournament. I joined only as all players were of rating around 1800, hence was OK. But with interesting positions I think this defence is very playable. This also turned out to be one of the good interesting games I played in recent times.",
        "4... c6 5. c3": "I played c6 to avoid Bishop diagonal when e4 was controlled, but c3 without protecting e5 may not be strong. Though he can always play e3 or f4 to make it strong. ",
        "5... Bg7 6. Qb3 d5 7. Nd2 O-O 8. Nf4 g5": "I wanted to get rid of N near center of the board. He was getting control of e6 which was scary. Thought for a long time for advancing my pawns near king. But saw no immediate danger. Would have been very interesting game if he would have played h4 instead of castling subsequently. ",
        "9. Nd3 Nbd7 10. Nf3 h6 11. O-O Ne4 12. Nd2 Kh7": "This turned out to be a master move. I always knew he will not allow my N at e4 and drive it away by f3. I had plans to play e5. King needed safe squire. His N was threatening to come to e5. If he succeeds he will not get direct access as King protects g6 squire. White diagonal from h7 to c2 is protected by my f pawn, which can be supported by N and B in matter of a move each. Grim battle for the center of the board was on cards. ",
        "13. f3 Nd6": "Somehow all four N on d row happens to come often in dutch defense. ",
        "14. e4 dxe4 15. fxe4 e5 16. exf5": "If game would have gone 16. d*e  N*e5 Then I have sufficient protection for f pawn. But now I had better idea. Instead of taking f pawn I take important d pawn with threat to kill c pawn. I had plan to block advancement of f pawn for control white squire diagonal, however this is not going to be easy. ",
        "16... exd4 17. Nc4": "Error. With this game leads to variation not comfortable for white. Proper would have  been Qc2 or Bh3 or g4. But with this he looses a pawn at c3.",
        "17... Nxc4 18. Qxc4 Nb6 19. Qb4 dxc3": "Now if N moves I kill b2 pawn and get a connected passer pawn, and favorable end game. ",
        "20. Be4": "Protecting N and pressurizing white squire diagonal I was worried about. ",
        "20... Bd4+ 21. Kg2": "Perhaps Kh1 would have been better. But white problems on Queen side are far from over.",
        "21... Qf6": "No way can I allow f pawn to march further. Some piece had to come at f6. Now my pawn at c3 is protected and I am pawn up. ",
        "22. g4 Nd5": "White Q has to support b2 pawn hence can move only at b3 of a3. Then I can attack with b5 and a5. N threat to e3 is strong central N is always menacing. ",
        "23. Bxd5": "Giving N for white B was very profitable. I would have considered giving R also to get his B at this position. I was more confident after this move. ",
        "23... cxd5 24. Re1 Rf7": "To stop Qe7 ch followed by exchange of Q. ",
        "25. Qb3 Bxf5": "I had to think for a long time for giving B for 2 pawns. He has open king position. His only defense is 2 connected pawns. He has to take the B, else I take N or g4. Also 26. Qd1 Be4+ 27. Kg3 Be5+ 28. Kh3 Qf3+ Loosing a piece and position.",
        "26. gxf5 Qxf5 27. Qd1": "Remember Qf3 is mate.",
        "27... c2 28. Qe2": "Game would have extended a bit by 28. Qh5 Ra8-f8  29. B*g5 Q*d3  30. Q*h6 Kg8  with no further check s 31. Qh5 Rf2+ 32.\tKh1 Rf1+ 33. Rxf1 Rxf1+ 34.  Kg2  Rf2+ 35. Kh1 Qe4+. But it was inevitable. ",
        "28... Re8 29. Qh5 Rxe1 30. Nxe1 Qf1+ 31. Kg3 Be5+": "White resigned as 32.\tKg4\tQe2+\n33.\tKh3\tQxh2+\n34.\tKg4\tQg3#"
    },
    "url": "https://gameknot.com/annotation.pl/jeroen63s-mini-tournament-d4-f5?gm=53574",
    "gameName": "jeroen63's mini-tournament d4 f5",
    "players": "haizea (1823) vs. abhijitd (1893)",
    "opening": "Dutch defence (A81)"
}