{
    "moves": {
        "1. e4 c5": "We open out with textbook Sicilian Najdorf.  See you in 9 moves.",
        "2. Nf3 d6 3. d4 cxd4 4. Nxd4 Nf6 5. Nc3 a6 6. Bg5 e6 7. f4 Be7 8. Qf3 Qc7 9. O-O-O Nbd7 10. g4 b5": "Frees my bishop and makes the knight a little nervous.  Plus it's about the only thing I can do without precipitating a firestorm around my king.",
        "11. Bxb5": "Huh?  I get that 10 ... axb5, 11 Nxb5 puts the knights strongly into play and makes c7 a hot spot, but I don't think the position is worth the material sacrifice, especially considering the firestorm that's about to land on the other side of the board.",
        "11... axb5": "I think this was a no-brainer.  Not only do I get a material gain, but I open up my rook's a file.",
        "12. Ndxb5": "The only logical response.  If the c knight had made the capture, Rxa2 would have been the response.",
        "12... Qc6": "There are only two options really worth considering.  Qc6 and Qb7.  Both serve to pin the pawn to the queen, but Qb7 gets in the way of the bishop.",
        "13. f5": "White tries to force the battle over my king to start, but it's easily avoided.",
        "13... O-O": "By castling, I make f5 a no-op.  White cannot take on e6 because the placement of my rook would make it to my advantage.  Castling did remove the only protection for my bishop, but I'll worry about that later.  For now it's safe behind my knight.",
        "14. Qg3": "Having f5 foiled, white atttempts to realign the attack on d6.",
        "14... Nxe4": "Qg3 gives me my opportunity take the pressure off my unprotected bishop.  The only reasonable response is Nxe4.  Anything else results in a material loss.",
        "15. Nxe4 Bxg5+": "Bxg5  forces Nxg5, which is good and bad.  On the bad side, the knight is now hovering over my king, which is something I'll have to watch through the rest of the game.  On the good side, the other knight is now unprotected, and the attack on my king is almost fully dissipated.",
        "16. Nxg5 Qxb5": "As an added bonus, I have now shifted the focus from my king to his.",
        "17. a3": "If white had not made this move, the follow-on sequence would have been Rxa2, Ra1 , kicking off a rousing game of chase the king.\n",
        "17... Ne5": "I have to give this move a !.  I wanted to strengthen my assualt on the white king without leaving my center to the dogs.  Ne5 succeed at both.  It puts the knight into position to join the assult, and it makes the d4 pawn poison.  Rxd6 is met by Nc4, forcing white to choose between losing the rook and checkmate.",
        "18. Qc3": "White recognises what I'm doing and moves to nip it in the bud.",
        "18... Nc4": "I now bring the knight into the king-side attack.  I give this move a !, too.  This move does four things, and it does them very well.  First, it pins the white queen to the c3-d4 diagonal.  If she ever leaves, the next move is checkmate.  Second, it defends the d pawn from the white rook.  Third, and perhaps most importantly, it pins the white f pawn to the white knight.  Otherwise, f6 could be a dangerous move.  Lastly, it prevents Kd2, keeping the king under pressure while I rally the troops.\nMy goal here is to get my bishop out of the way and play Rf-c8, Nxa3, Nc4, Ra1  .",
        "19. h4": "White doesn't have many other choices here.  b3 gets Rxa3, pinning the white b pawn to the white queen.  White's best hope is to break through my king-side pawns, because the battle for the white king is out of reach of the rest of white's pieces.  h4 is a solid move because it releases the pin on the white f pawn.  The combination I have to watch here is fxe6, Nxe6, Qg7  .",
        "19... Bd7": "Alternative: [19. ... Bb7 20. Rh-e1 Rf-c8 21. fxe6 f6 22. e7 Nxa3 23. e8=Q  Rxe8 24. Rxe8  Rxe8 25. bxa3 fxg5 26. hxg5]",
        "20. fxe6": "What I expected.  Again, white really has nothing he can do.  He's just killing time, hoping to figure out how to get out of the bind in which he finds himself",
        "20... Bxe6": "I like this move because it is strong and aggressive.  I defend the pawn and the knight while attacking the white g pawn.  The real point of this move, though, is to incite Nxe6, ending the threat against my king, and making my remaining knight even more important.  Basic rule of equal trades: no trade is equal.  Someone always loses some positional advantage.",
        "21. Qd3": "White tries to line up for the mate with Qxh7, but has forgotten that taking his queen off the c3-f6 diagonal leads to...",
        "21... Qxb2#": "Checkmate!"
    },
    "url": "https://gameknot.com/annotation.pl/jfp8-v-s-templeton?gm=196",
    "gameName": "JFP8 v/s Templeton",
    "players": "jfp8 (1593) vs. templedf (1486)",
    "opening": "Sicilian (B99), Najdorf, 7...Be7 main line"
}