{
    "moves": {
        "1. e4 c5": "I'm looking to play the Taimanov variation of the Sicilian depending on what White plays. I've been having some success with this and it seems to be White's lack of preparation more than anything else.",
        "2. Nc3 e6 3. f4": "Nc3 indicated a Closed varaition but after f4 I'm already looking to exploit the weakened King position.",
        "3... d5 4. Nf3 Nf6 5. Bb5+ Bd7 6. Bxd7+ Qxd7": "Seems to be a gradual erosion of White's opening advantage and his next move is worse.",
        "7. e5": "e5? ",
        "7... Ng4": "This move is effective because it can induce further king-side weakening. I can find a good home for this knight at either e5 or g5 via h6 and f7, if it has to move.",
        "8. O-O Nc6 9. d3 Be7 10. h3 Nh6 11. g4 f5 12. exf6 e.p. gxf6": "I'm starting to build a powerful center and causing White to overreact.",
        "13. f5 Nf7 14. fxe6 Qxe6 15. Qe2 Nfe5 16. Nxe5": "Nxe5?  Now I'll have a rock solid pawn center and a  soon to be very safe King on the other side.",
        "16... fxe5 17. Qf3 O-O-O 18. Qf7 Qg6": "I've been developing at his expense so far and there is no reason to stop trying now.",
        "19. Bd2 a6": "A necessary move to give the king breathing room and to keep moving forward.",
        "20. Rae1 Qd6 21. Qf5+ Kb8 22. Qh5 h6 23. Rf5 Bg5 24. Rf2": "He has avoided making  a big mistake over there, and material is equal, but he is just about positionally lost.",
        "24... Bxd2 25. Rxd2 Rhf8 26. Kg2 Qf6 27. Rde2 Qf3+ 28. Kh2 Qf4+ 29. Kh1": "Cornered and wide open and all because of his opening moves.",
        "29... c4 30. dxc4 Qxc4 31. a3 Ka8 32. Qh4 h5 33. Rg2 Ka7 34. Reg1 hxg4 35. Rg2xg4 d4": "d4!",
        "36. Qe1 Qc5 37. Ne4 Qxc2": "Finally winning a pawn but that was incidental; the real goal is squashing all counter play and continuing to overwhem the center.",
        "38. Rg1g2 Qd3 39. Kh2 Rf3": "And Black resigns here. Play could have gone R4g3...Rh8, Kg1...Re3...Rxe3...dxe3!",
        "40. Rg4g3 Rh8 41. Kg1 Re3 42. Rxe3 dxe3": ""
    },
    "url": "https://gameknot.com/annotation.pl/jhfits-mini-tournament-iii?gm=41342",
    "gameName": "jhfit's mini-tournament III",
    "players": "bikemoof (1941) vs. jhfit (2038)",
    "opening": "Sicilian (B23), closed, Korchnoi variation"
}