{
    "moves": {
        "1. d4 d5 2. Nc3 e6 3. e4": "How about a French defense? But I was ready with an old variation.",
        "3... Bb4 4. e5 c5 5. a3 cxd4": "cxd4!? Creating early complications. Bxc3 is usually played.",
        "6. Qxd4": "I was expecting axb4 when  ...dxc3 can lead to white sacrificing a pawn and having a bishop nicely placed on b2.",
        "6... Nc6 7. Bb5 Bd7 8. Bxc6 Bxc3+": "Taking with check here avoids losing a piece.",
        "9. Qxc3 Bxc6 10. Ne2 Qh4 11. Qg3": "Qg3!? I think white can be more ambitious here because after the recapture he has a pawn on e5 and nothing else.",
        "11... Qxg3 12. hxg3 Ne7 13. a4 f6 14. exf6 gxf6 15. g4 e5 16. Bd2": "Still nothing past the second rank for white----but that h file is some compensation.",
        "16... d4 17. f3 O-O-O 18. c3 Ng6 19. cxd4 exd4": "This isolated advanced pawn keeps the game about even--for now.",
        "20. b4 a6 21. Kf2 Ne5": "Now the position is changing . White is pressuring the queenside and the rook wants to get to h6",
        "22. Rh6 Nc4 23. Bf4 d3 24. Nc3 Be8 25. Rxf6 Bg6": "A necessary repositioning. The d pawn has to be pushed and white has to blockade it or try to win it outright. In either case, his winning chances are decreasing.",
        "26. Bg5 Rd4 27. b5 a5 28. Re6": "Nice try.",
        "28... Rf8 29. Bf6 Rd7 30. Ne4 d2 31. Rd1 Rxf6": "Rxf6! The resultant forced moves will tell the story.",
        "32. Rxf6 Bxe4 33. fxe4 Nb2 34. Ke2 Nxd1 35. Kxd1 Rd4": "Now it's just being careful to get the draw. His one pawn advantage all this time has not amounted to anything.",
        "36. Rf8+ Kc7 37. Rf7+ Kb6 38. e5 Rxa4 39. g5 Kxb5 40. Rxb7+ Kc6 41. Rxh7 Kd5 42. Ra7 Kxe5 43. g6 Rg4": "That extra g pawn has not helped in this game. It needs to be carefully considered how such an exchange can affect the endgame.",
        "44. Rxa5+": "White offered a draw here and I accepted."
    },
    "url": "https://gameknot.com/annotation.pl/jhfits-mini-tournament-vi?gm=49994",
    "gameName": "jhfit's mini-tournament VI",
    "players": "biggie (2155) vs. jhfit (2098)",
    "opening": "Queen's pawn (D00), Chigorin variation"
}