{
    "moves": {
        "1. d4": "Hello guys and girls, this is my first notation. \r\n\r\nWell, a classic move by white.",
        "1... e6": "I have a different opening compared to the chess engines, soon you will see what I mean. Even though, my first move is alike.",
        "2. c4": "Not what I expected, but it doesn't blows me off. Sending it unprotected?",
        "2... g6": "I won't go and try to attack it. Stick to the opening, plus he can easilly protect it.",
        "3. Nc3": "Having the knight at c3 is a great move since you have two pawns at line four.Plus nothing is attacking the pawns",
        "3... Bg7": "Having the bishop there is a good play, since, it can attack what is attacking it and no knight is able to attact it due to the pawns around it.",
        "4. Nf3": "Adding defence to the piece in the lead, helps you have control of your territory.",
        "4... Ne7": "Moving the knight away for castling is a great way to let them know your king is not easy to capture. Moving it at f6 is a bad ideal, because it blocks the bisops attack. At h6 is also good, but I don't like to extend my territory attacks.",
        "5. e4": "White is building a wall, which helps him control more of his territory. He now protected his c4 too.",
        "5... b6": "Aha you thought I was going to castle, but the king is not close to  danger or under attact, so there is no need to castle so soon.",
        "6. Be2": "He is getting ready to castle so it won't get in the way later.",
        "6... Bb7": "I have to have my second tower, but the real castles has four but when your facing one wall you see two towers.",
        "7. e5": "He is trying to block my bishop's attack.",
        "7... d6": "When you step in my four side of the lines you are now trasspassing and my dogs will attack.",
        "8. O-O": "Since I'm starting to attack. castling is a good move since all he has to do now is protect his pieces and attack.",
        "8... dxe5": "MY TERRITORY!   >:O",
        "9. Nxe5": "With this move, his bishop will be able to move to more places.",
        "9... O-O": "I can't use a pawn to move him away except for f7, but castling just seems better.Since I'm being attack.",
        "10. Bf3": "With this attack, he has force me to either block or attack.",
        "10... c6": "I like to defend. I got three pieces already blocking it, and he is attaking with two.",
        "11. Bf4": "He is adding defece to his lead piece so he can have more moves.",
        "11... Nf5": "I need to get my horses to attack not defend. Nb8 will not do me any good in a6 or d7(it would just give him the lead in it). So I went with Kf5 to be able to attack in his defend.",
        "12. d5": "A nice move other wise he would be a pawn short or the kings defend out of place if he defended the pawn with the bishop.",
        "12... exd5": "I can't let the pawn get too close to the other side or he will push harder to get it there.",
        "13. cxd5": "It's force attack to keep the score even.",
        "13... cxd5": "Destroy the pawn advancement.",
        "14. Bxd5": "He is forcing to destroy my tower.",
        "14... Bxd5": "I had no other choice.",
        "15. Qxd5": "He is still controlling my attacks my targeting my rook.",
        "15... Qxd5": "You can't spare a rook unless your going to win, and its far from over.",
        "16. Nxd5": "As you can see he has gain control of the territory, but atleast he has no pawns nearby.",
        "16... Na6": "I have to let my rook out and Na6 is my safest way. In c6 or d7, he would have gotten a free knight.",
        "17. Rab1": "He is getting his advancing his pawns without worring abou my bishop.",
        "17... Nc5": "I can't let it advance.",
        "18. b4": "Darn, they are able to move two spaces the first move ; ). ",
        "18... Ne6": "I need to move it and Ne6 is the best move for it. Ne4 would only get it trap . Plus I need the bishop to stop protecting Ne5.",
        "19. g3": "He calls for reinforcements.",
        "19... g5": "This will force it to move since my pawn is aslo protected.",
        "20. Nd7": "He goes for my rook, in order to save his knight and his bisop.",
        "20... Rfd8": "His Nd7 is attack in any direction.",
        "21. Nd7f6+": "Brilliant by getting me in check. Even if I attack him he will still get me in check.",
        "21... Kh8": "In this direction he will not be able to attack my h7 and get away from it.",
        "22. Bc1": "He had to retreat.",
        "22... Rac8": "My rook wouldn't do me any good stuck in the corner, so I need to let him out.",
        "23. f4": "He is aiming to defend his Knight with his rook and bisop.",
        "23... g4": "This is not checkers you don't have to eat if you don't want to.",
        "24. Bb2": "So he finds another way to do it.",
        "24... Ned4": "I had to block another defence of his, since with his knight he has my king corner, and at the same time getting to his king.",
        "25. Rbd1": "Without his bishop protecting it he is loosing communication, so he needs to solve it.",
        "25... Nf3+": "He will not risk his rook for my knight.",
        "26. Kh1": "He chose to get corner.",
        "26... Rxd5": "This is my first mistake. I should have move Rc2 and get it over with but instead I decided to play around. I wanted to take his rook with my knight. In which I would have succeded if I would have paid more attention.",
        "27. Rxd5": "I was hoping he move Kd5 instead but once again I didn't paid enough attention. So a word from advice, don't move under pressure just because you want to get it over with. Every move changes a strategy.",
        "27... Ne3": "My second mistake, I still had a chance to bring my rook to c2.",
        "28. Rh5": "A great move by him, making me decide to either take his rook and loose the game or let his rook go and keep playing. Also, with this my Rc2 is not effective anymore.",
        "28... Bxf6": "I hasitated and made my third mistake, I should have moved h1-h2.",
        "29. Bxf6+": "He made an obvious move and a nice one with the situation.",
        "29... Kg8": "My only move.",
        "30. Rb1": "This is his best move for his rook, away from danger and not cornered.",
        "30... Rc2": "It's kind of late now, but I can still checkmate him if I can get his rook away from line one.",
        "31. a3": "He is saving his pieces from my rook.",
        "31... Rf2": "I was looking to block his rook with my knight.",
        "32. Rc1": "A good move on his part by just having to move one more time and get it over with.",
        "32... Rc2": "My last mistake and my fatal one too. I should have though it thru and move Kc2. Then my other knight to e1 and finish him off with Rf1, but hesitation and not putting your head straight is one of your worste moves.",
        "33. Rxc2": "He has found another way to checkmate me.",
        "33... Nxc2": "A rook for a rook.",
        "34. Rd5": "He puts in plan of what the other rook supposed to have done.",
        "34... h6": "I can now move him to give me more time to end it in a draw, or stall him.",
        "35. Rd8+": "Two move checkmate, and there is nothing I can do.",
        "35... Kh7": "My only move, I am being force to move his way.",
        "36. f5": "One move checkmate, as you can see its unprotected and its a awsome play. Not all great plays mean that the piece is protected.",
        "36... Nxa3": "Why not try and make the score even, I'm going to loose anyway.",
        "37. Rh8#": "He moves h8 and takes the win. I started to annotate this game without knowing the outcome. Most people write about how great they play and won the game. You learn more about loosing and I wasn't going to delete this annotation just because I lost. Every move needs an explanation and you will have an answer if you know what you are doing. ADIOS! I hope you guys enjoy and learn like I did this game."
    },
    "url": "https://gameknot.com/annotation.pl/jibarra85s-mini-tournament?gm=2337",
    "gameName": "jibarra85's mini-tournament",
    "players": "jeb123 (1774) vs. jibarra85 (1594)",
    "opening": "Queen's pawn (A40), Keres defence"
}