{
    "moves": {
        "1. e4 c5": "Sicilian.",
        "2. Nc3 e5": "I saw that I should have played e6 then d5 after this move. ",
        "3. Nf3": "And he threatens my pawn.",
        "3... Nc6": "So I protect. ",
        "4. Be2": "White is getting ready to castle, and I suddenly realise that I need to develop also.",
        "4... Nd4 5. O-O": "As said before, white castles.",
        "5... d6": "I protect against Nxe5, but forget about Nd5.",
        "6. d3 Bg4 7. Be3": "He atempts to scare the knight away.",
        "7... Be7": "I see sense in castling.",
        "8. Nd5": "As expected, the knight jumps.",
        "8... Nf6": "The knight poses a threat. If Nxf6, then Bxf6.",
        "9. Bxd4": "White trades his bishop for a knight. Don't think it was his best move.",
        "9... exd4 10. c3 Nxd5": "I decide to take the knight.",
        "11. exd5": "If you see, there is now a pawn line on d coloum.",
        "11... Bxf3": "I take the knight.",
        "12. Bxf3 O-O": "12 moves in, I castle. Not the smartest. I know I should have castle early on.",
        "13. cxd4 cxd4": "And now you see the pawn line and open file.",
        "14. Be4": "I belive this to be a checkmate threat on Qh5 then Qxh7#...",
        "14... Rc8 15. Qh5": "And it is. (I have also taken the open file. This becomes important.)",
        "15... g6": "I block the bishop's diagnal and attack the queen. ",
        "16. Qd1": "The queen returns, practicly giving me a free move to c8.",
        "16... Qb6": "As the endgame draws close, I try to take some pawns.",
        "17. b3 Qc5": "I get the queen into the open file I claimed.",
        "18. Rc1 Qxc1": "This is one of the worse moves I make, as it gives away the open file.",
        "19. Qxc1 Rxc1 20. Rxc1": "As said before, the open file is now his.",
        "20... Bg5 21. Rc7": "He wants the pawns. ",
        "21... f5": "It took me a while to make this move, as the b2 pawn is under fire. I thought of perhaps Rb8 to support it, but in the end I decide to make a stalling move.",
        "22. Bf3 Re8": "Checkmate threat (Re1#).",
        "23. g3 Rb8": "I go back to protect the pawn.",
        "24. Rd7": "He decides to take apart the coloum, leting the d6 pawn to promote. This move wins a pawn.",
        "24... Rd8 25. Rxb7 a5": "I run with my pawn.",
        "26. Bg2": "Didn't understand this move. If one of you do please tell me.",
        "26... Rc8": "I take the open file back.",
        "27. Ra7": "He threatens my pawn.",
        "27... Rc3": "This was, I belive, a turning point in the game. Rxd3 lets my pawn free, and because I control the open file, White can't stop my pawn.",
        "28. Rxa5": "This, as said before, will let me promote my d4 pawn. A better move for white would have been Bf1 to protect the d3 pawn.",
        "28... Rxd3 29. f4": "Attacks my bishop.",
        "29... Bf6 30. Ra6": "Threatens the d6 pawn.",
        "30... Be7 31. Rc6": "Now he gets the open file. But it's too late.",
        "31... Kf7 32. Rc1 Rd2": "Now I start to move my pawn out.",
        "33. Ra1": "Why would he give up the file?",
        "33... Rc2": "I know begin a very strange combo that in the end will promote the pawn.",
        "34. a4 d3": "Here we go! once the pawn is on d2...",
        "35. Bf3 d2": "I can make a move that forces a rook swap.",
        "36. Bd1 Rc1": "If the rook takes my rook, I promote the pawn. If it stays there, I get a free rook, and then a free bishop. Now there is nothing white can do to save himself.",
        "37. Rxc1": "He takes the rook...",
        "37... dxc1=Q": "and I promote the pawn. Also I get a free bishop, as it is pinned to the king, therefore finaly sealing white's doom.",
        "38. a5 Qxd1+": "Check.",
        "39. Kf2 Qxb3": "At this point, White resigned, ending a game that was very fun, intresting, and tactical. If you like my anotation, please leave a comment below, and rate the anotation. Thanks, and God Bless!"
    },
    "url": "https://gameknot.com/annotation.pl/jimmydays-mini-tournament-xlii?gm=49508",
    "gameName": "jimmyday's mini-tournament XLII",
    "players": "bdsj (1196) vs. daviddude (1239)",
    "opening": "Sicilian (B23), closed"
}