{
    "moves": {
        "1. e4": "Hi everyone!\r\n\r\nMy matches in the Inter-team championship 1700-1800 are coming to a close.  I was certainly pleased with this result.  My opponent's rating at the start of the game was 1686 so I got 7.4 points out of this.  Normally it is me that has passivitis but somehow I inflicted the malady on my opponent.  I am black and I end up playing the closed Ruy Lopez.",
        "1... e5 2. Nf3 Nc6 3. Bb5": "3. Bb5 - this move is the Ruy Lopez or Spanish Opening or as Kasparov named it, the Spanish Torture.",
        "3... a6 4. Ba4 Nf6": "4. ........ Nf6 - development.",
        "5. O-O Be7 6. Re1 b5": "6. ........ b5 - driving back the white bishop to b3.",
        "7. Bb3 d6 8. c3 O-O 9. h3 Na5": "9. ...... Na5 - threatening to exchange N for B, although here the Wicked Witch of the West (pet name for enemy queen) can recapture.",
        "10. Bc2 c5": "10. ........ c5 - a queenside expansion and I have a lead in development.",
        "11. d4 Qc7 12. Nbd2 cxd4 13. cxd4": "13. cxd4 - pawn trade.",
        "13... Nc6 14. Nb3 a5": "14. ........ a5 - pawn roll.",
        "15. d5 Nb4 16. Re2": "16. Re2 - bad move, this is the first move out of the database but it is bad for white because he loses a piece for a pawn as you will see.",
        "16... a4 17. Be3": "17. Be3 - if Ne2 - the only square to avoid capture then the knight interferes between the rook on e2 and the lsb on c2, this means that white will lose the bishop on c2.  So he decided to let the knight on b3 go.",
        "17... axb3 18. Bxb3 Nxe4": "18. ...... Nxe4 - in fact I net a whole piece because I noticed that the e4 pawn was en prise as a result of that bishop move to e3.",
        "19. Rc1 Qd7 20. a3 Na6 21. Rec2 Bb7": "21. ....... Bb7 - In gaining a piece I lagged behind in development.  However this move corrects the matter and my rooks are finally connected.  Just as well, look at that pile up of white heavies on the c file!",
        "22. Qd3 Nf6 23. Nd2 Rfc8": "23. ....... Rfc8 - I now try to force exchanges of heavies, a good thing if you are a whole piece to the good!",
        "24. Rc2xc8+ Rxc8 25. Rxc8+ Bxc8": "25. ...... Bxc8 - the heavies are duly exchanged.",
        "26. Ne4 Nxe4 27. Qxe4": "27. Qxe4 - knight trade.",
        "27... Qf5 28. Bc2 Qxe4 29. Bxe4": "29. Bxe4 - Queen trade.",
        "29... Nc5": "29. ......... Nc5 - I move my knight off the rim.  True that knight can be exchanged but as per my previous note, I am a piece up and want to exchange my opponent down to nothing.  Fou Lenoir can always act as a giant pawn here and hold up that e5 passer. My opponent decided to move his lsb instead.",
        "30. Bc2 Bd7 31. b4 Na4 32. Bxa4 bxa4": "32. ...... bxa4 - I was very surprised and very pleased that my opponent swapped off his lsb for my knight on the rim.  Now for my opponent, things are gonna get very grim!  You will now no doubt be amazed at how quickly I will transform an apparently passive looking position into an active one.",
        "33. Kf1": "33. Kf1 - white moves his king towards the centre, very sensible idea in the endgame, but it will avail him nought.",
        "33... Bb5+": "33. ....... Bb5+ - step 1.  I make Fou Leblanc more active and put the enemy king in check, more significantly this bishop is eyeing up white's d isolani.  This isolani will drop off in two moves time.",
        "34. Ke1 Bc4 35. g4": "35. g4 - white sees that he cannot save his d pawn so moves his g pawn to stop it being attacked when Fou Leblanc snaffles up the d pawn.  He wants to centralise his king but I give him no chance.",
        "35... Bxd5 36. Ke2 Bc4+": "36. ...... Bc4+ - what a lovely diagonal for Fou Leblanc.  He also stops the b4 pawn it its tracks.",
        "37. Ke1 d5": "37. ....... d5 - time to push my own passer.  This one ably supports Fou Leblanc.  Now what about Fou Lenoir?",
        "38. f3 Bh4+": "38. ..... Bh4+ - yup, what about Fou Lenoir, well here is the answer, he forms a neat criss-cross with his twin brother, keeping the enemy king from the kingside.  His remaining bishop is going to be very passive very soon.",
        "39. Kd2": "39. Kd2?! - I think Kd1 was marginally better, this enables me to push my passer one square closer to Glendadom and neatly box in his dsb.",
        "39... d4 40. Bg1 Bg3": "40. ....... Bg3! - now white's dsb is well and truly boxed in.  Well, nearly all my pieces are active, but what about Henry?  Fast asleep on g8 he has been from move 8 - it is now move 40 - disgraceful - I'm not having this.   I set his alarm clock for next turn.  Time he woke up and got out of his pit!",
        "41. Kd1 Kf8": "41. ...... Kf8 - The alarm clock sounds and Henry now emerges from his pit.  He fancies his usual, prawns on toast and there are three juicy ones on the kingside to be picked off at leisure as the white king cannot get to the kingside and the white dsb cannot help either.  White sees what is coming and waves the white flag.  For me, a final position like this is a dream come true."
    },
    "url": "https://gameknot.com/annotation.pl/jo-puts-the-squeeze-on?gm=23314",
    "gameName": "Jo Puts the Squeeze On!",
    "players": "NN (1669) vs. jstevens1 (1783)",
    "opening": "Ruy Lopez (C88), closed, Leonhardt variation"
}