{
    "moves": {
        "1. e4": "Hi everyone!\r\n\r\nI have my own version of events as to what happened at the Battle of Naseby which occurred on the 14th of June 1645.  The Royalists were headed by King Charles 1 (my opponent's name is Charles btw) and his cousin Rupert of the Rhine - they were called the Cavaliers - on the opposite side were the Roundheads headed by Oliver Cromwell.  In my story I am going to use some artistic licence of the conversations on the battlefield.  King Charles takes the field with his troops - he and his men are armed in white - his missus, the staunch Roman Catholic, Henrietta Maria has been practising sorcery along with her faith.  Therefore she is known to the Roundheads as the Wicked Witch of the West.  Now Oliver Cromwell was far too busy with administrative paperwork in London and setting Government Targets so he enlisted others to do his dirty work.  Henry Thomas Fairfax and his wife Glenda (who has also dabbled in Sorcery) have drawn the short straw.  They have been provided with two castles, two horsies to ride on, two clergy, Frenchmen by the name of Fou Lenoir and Fou Leblanc and eight footmen - I am one of those footmen, I am the a pawn.  I end up 3 squares shy of promotion to a queen but that is as far as I get.   All of Cromwell's Army are armed in black. King Charles and Queen Henrietta have also been provided with two castles, two horses to ride on and two unnamed clergy and eight footmen. Henry and Glenda have now arrived at the south side of the battlefield at Naseby and will head due north to fight King' Charles Army.  The first white pikeman (a pawn) makes his move to Sector e4.  ",
        "1... e5": "1. ..... e5 - I take my place on Sector a7 and I say to my neighbour, Gareth on Sector b7, ah so we have arrived on the battlefield at last, I can't believe that I a woman should be roped into all this. Gareth turned round and said ..... Ah, stop moaning, at least Glenda thinks you have the know all to fight a battle after she saw you kill a roundhead the other day. I then said to Gareth that I Joanne had no choice as I was ensuring my chastity for my beloved husband, Ian.  Well good luck to you Joanne said Gareth!  Anyhow, the battle has started and our friend John has just moved to Sector e5.",
        "2. Nf3": "2. Nf3 - charge of the cavalry!  Look out my friend on Sector e5!",
        "2... Nc6": "2. ...... Nc6 - ah, Glenda's horsie comes out to defend it.  Can't believe animals are less expendable than us footmen.",
        "3. Bb5": "3. Bb5 - here comes Bishop William Laud ....... ssss!  Gareth nudges me and I now have to move up one square to Sector a6, point my staff at the cleric's belly and say \"Halt who goes there!\".",
        "3... a6 4. Ba4": "4. Ba4 - Bishop Laud mumbles a curse at me and retreats back to Sector a4.",
        "4... Nf6 5. O-O": "5. 0-0 - oh look, King Charles hides in his castle.  I wonder if Glenda will be able to prise him out?  I don't know says Gareth.  Ah look, Henry's horsie has just drawn first blood.  That footman on Sector e4 has just copped it.",
        "5... Nxe4 6. d4 b5": "6. ....... b5 - Gareth, what are we fighting for here?  Goodness me, Joanne you have led a very sheltered life in your mannor house with Glenda!  Don't you realise just how much Income Tax, VAT and Council Tax we have had to pay recently?  I will tell you, King Charles has doubled it - this has got to stop, Joanne, this has got to stop!  Now, I must advance to Sector b5.  ",
        "7. Bb3": "7. Bb3 - Bishop Laud again retreats to Sector b3.",
        "7... d5 8. dxe5": "8. dxe5 - that is the end of John! Sigh and double Sigh!",
        "8... Be6 9. Nbd2 Nc5": "9. ..... Nc5 - both horsies are coming over to our patch, I wonder what is going on?  We want to get rid of Bishop Laud, Joanne.",
        "10. c3 Be7 11. Bc2": "11. Bc2 - Blast!  How can we get him now?  Dunno said Gareth, but we may well get him someday!",
        "11... Bg4 12. Re1 O-O": "12. ......0-0 - Glenda whispered to Henry, time to tuck yourself away in our fourposter darling, the open battlefield is not for you, besides, you have a nasty cold, here is a potion to ease your comfort.  Don't worry, Gavin, Austin and Justin will shield you by standing on Sectors f7, g7 and h7.",
        "13. Nb3 Ne6 14. Qd3": "14. Qd3 - a dark shadow comes over us all and suddenly we are feeling very cold despite our armour.  Suddenly we hear a nasty laugh and see a terrifying apparition from the sky.  This apparition has the face of a skull, a cloak and a scythe.  Beware it said, I am the Chessic Grim Reaper, I am Old Matey!  Look to the White Witch on d3!",
        "14... g6": "14. ..... g6 - The White Witch, aaargh, Gareth does he mean Jadis from the Land of Narnia?  Will she turn us into stone?  Will Aslan save us?  No, he means Queen Henrietta - you live in a fantasy world you do but if something isn't done she will capture Henry and do something just as nasty.  Ah, thank goodness, Austin has just moved to Sector g6 saving Justin and Henry.  Henry does look very draughty in his castle now though.",
        "15. Nfd4 Ncxd4 16. Nxd4": "16. Nxd4. Now one of our horses has just been killed.  Thank God one of King Charles' horses has bit the dust!",
        "16... Qd7 17. Bh6 Rfe8 18. Qg3 Nxd4 19. cxd4": "16. cxd4 - now neither side has a horse.",
        "19... Rac8 20. Qf4 c5": "20. ..... c5 - Turstin comes to the other side of Gareth to keep him company.  Somehow though I do not think he will be long for this world.",
        "21. Rac1 cxd4 22. Bb3": "22. Bb3 - Bishop Laud now attacks Haldup on Sector d5, can he survive?",
        "22... Be6 23. Qxd4": "23. Qxd4 - sigh, I Joanne was right, Turstin does perish to the Wicked Witch.  Now Fou Leblanc must stay on Sector e6 to stop that footman on e5 opening up a nasty line for that evil Henrietta Maria.  No, Henry does not want any truck with Catholic queens.  Neither do I said Gareth, my great-grandfather was burned at Smithfield Market by that horrible old Catholic harridan Bloody Mary.  Sorry to hear that Gareth I said  I comforted him with the words - still, since Good Old Queen Bess drove back the Spanish Armada we have not had the Spanish Inquisition set foot in this country.  Now I will see if I can trap Archbishop Laud.....",
        "23... a5": "23. ..... a5 - so I move up one square to Sector a5.",
        "24. a3 Qb7 25. Red1 Rxc1 26. Bxc1": "26. Bxc1 - now one pair of castles from each side have also bitten the dust.",
        "26... Rd8 27. Bd2 b4 28. axb4 axb4": "28. ....... axb4 - my beloved companion Gareth has just been slain.  I am all on my own.  Glenda's gentle voice soothed and comforted me.  You are not alone, I am right behind you and so is Fou Lenoir.  We will not let you be taken by Queen Henrietta or Bishop Oates.  I feel a bit better but I long for my companion.  I see that Haldup is still on d5 but the c column separates us and it is very hard for me to strike up a conversation yet alone for us to defend each other.",
        "29. h3 Qb5 30. Rc1 Qb7 31. Kh2": "31. Kh2 - now what is King Charles up to?",
        "31... Kg7 32. Ba4 Rc8": "32. ..... Rc8 - hmm, now Bishop Laud moving to Sector a4 has allowed our remaining castle to challenge the enemy castle.  Both castles now explode before my eyes.",
        "33. Rxc8 Bxc8 34. b3": "34. b3 - I do have some pawn company now but it is the enemy.  I ask him why he wanted to fight us and he replied.  That awful Cromwell, do you know he has stopped us from all sorts of leisure activities.  He has banned acting, cock-fighting, bear baiting, tennis and he is even trying to ban Christmas.  Down with the old Scrooge!  So that is why I am here today.",
        "34... Be6": "34. ..... Be6 - Hmm, that sounds a bit like the Taliban I thought.  Sometimes I think that both King Charles and Oliver Cromwell are as bad as each other!  Frankly I would rather be at home in front of the fire darning my beloved Ian's stockings.",
        "35. f4 h5 36. Be1 Kg8": "36. ..... Kg8 - here Henry tries to hold out the Olive Branch but King Charles is having none of it.",
        "37. Bf2 Kg7 38. Qa7 Qxa7 39. Bxa7": "39. Bxa7 - Oh no, Glenda has been slain by that horrid Bishop Oates.  Fou Lenoir comforts me with the news that Queen Henrietta has also been slain.  I am still behind you Joanne, don't you worry.  I just hope you don't get yourself killed too Fou Lenoir.  I will try not to he replied.",
        "39... f6 40. Kg3 fxe5 41. fxe5": "41. fxe5 - so now there is a footman on Sector e5 all on his ownesome.  In fact there is very few of us left now.",
        "41... Bg5 42. Bd4 Bc1": "42. ..... Bc1 - Fou Lenoir wants to protect me from Sector a3.",
        "43. Be8 Bd2": "43. ..... Bd2 - he protects me from c2 instead.",
        "44. Kf3 Bc3": "44. ..... Bc3 - omigod, now Fou Lenoir may be killed by Bishop Oates.  I shall be all alone.  But if I perish says Fou Lenoir, you will be able to get to a paradise called Glendadom and therefore you will become Glenda and you will have the privilege of sharing Arnescote Manor House with Henry.  Hmm, somehow I do not think that Ian is gonna like this arrangement!",
        "45. Ke3": "45. Ke3 - now King Charles is closing in on you, Fou Lenoir, heeelp!",
        "45... h4 46. Bc6 g5": "46. ..... g5 - Justin and Austin have moved to Sectors g5 and h4 to evade Bishop Laud.",
        "47. Kd3 Bf5+": "47. ..... Bf5+ - aha, saved by my twin Fou Leblanc!",
        "48. Ke3 Be6": "48. ..... Be6 - After King Charles retreats so does Fou Leblanc.  It is now the 11th hour of the 14th day of June in the year of our lord 1944.  Now King Charles holds out the olive branch and Henry takes it.  I said to Fou Lenoir, why did not Fou Leblanc go to Sector e4?  Fou Lenoir said, aha, you are right, we are all fools.  Fou Leblanc could have taken the white footmen on Sectors g1 and b3.  Haldup comforts me with the words that King Charles would be taking us to a hostelry just up the road called The Royal Oak.  There would be plenty of opportunity for some illicit entertainment in there.  Some wonderful Strongbow ale, some mead, some nice wenches and best of all somebody giving a Karaoke style rendition of Paul McCartney's Play the Pipes of Peace and Boy George's War, War is stupid etc... I think the songs are perfectly appropriate and I am really terrified of facing Oliver Cromwell cos we have not won the battle but Haldup assures me that there is a giant oak tree in the back of the garden to hide in should he come calling.  Now Joanne, just have a little mead and chill out will you?  I accept the mead and in front of a nice warm fire I fall into a contented sleep with Haldup's arms wrapped right round me ....... in the meantime King Charles keeps his head ...... for now."
    },
    "url": "https://gameknot.com/annotation.pl/jos-rendition-of-the-battle-of-naseby-june-14-1645?gm=28246",
    "gameName": "Jo's Rendition of the Battle of Naseby - June 14, 1645 ",
    "players": "charleshiggie (2010) vs. jstevens1 (1791)",
    "opening": "Ruy Lopez (C80), open, Bernstein variation, Karpov gambit"
}