{
    "moves": {
        "1. e4": "Hi everyone!\n\nAfter the events of the last few days, boy I am sooo glad to get back to some normality.  Homework.  This HW is for my Mentor, Drhpatron who I have had some fairly good games with even though I lost the lot.  This game starts off OK and then goes south for me after an injudicious knight trade and that familiar dread disease, passivitis sets in.  David then injects a paralysis into my position so that I finally run out of moves that avoid further damage to my position.  Much to my horror, David then erects a mating net around Henry of which he cannot escape.  He is then hunted down and ruthlessly but elegantly executed as my buddy Gerhard (Chicoboy) stated!",
        "1... c5 2. f4": "2. f4 - David decided to give me the Sicilian so I start the Grand Prix Attack.  I wonder if it will lead into the Master Mater's (Easy19's) annotation project?  We shall see.",
        "2... e6 3. Nf3 Nc6 4. Nc3": "4. Nc3 - so far so seemingly good.  Both white knights are developed.",
        "4... d5 5. Bb5": "5. Bb5+ - nope, it ain't gonna be that annotations project and it will soon be like the Rossolimo Variation but with d4 not yet played.  I never get round to playing that move until it becomes detrimental to me, sigh and double sigh!",
        "5... d4 6. Bxc6+ bxc6": "6. ..... bxc6 - I can't resist it can I, Ion, I give up Fou Leblanc for a knight to split up my opponent's pawns and it will not be to my benefit.",
        "7. Ne2 d3": "7. ..... d3 - a crimp of which I try and break free from.",
        "8. cxd3 Qxd3": "8. ..... Qxd3 - the Wicked Witch of the West replaces that pawn on d3.  Ssss and double ssss!",
        "9. Nc3 Bd6 10. e5": "10. e5 - attempting to shut out David's dark square bishop.",
        "10... Bc7 11. Qe2 Qxe2+ 12. Nxe2": "12. Nxe2 - at least the queens are off the board and I remember telling David that I thought that Henry could sleep a little more peacefully in his 4 poster bed!  How wrong I was to be!",
        "12... Ne7 13. d3": "13. d3?! - maybe d4 was better at this point.  Incredibly I never get to develop Fou Lenoir and this ties up the whole of my queenside.",
        "13... Nd5 14. O-O Ba6 15. Rd1": "15. Rd1 - I defend the pawn on d3 for now but it is gonna be a target.  I am now rueing not offering it up for David's c pawn to exchange it on d4.",
        "15... Rd8 16. a3 Rb8 17. Nc3 Rb3": "17. ..... Rb3 - another invasion and I never get to drive it off.  I try and break free by trading knights but this makes things soooo much worse.",
        "18. Nxd5 cxd5 19. d4": "19. d4 - at last but too late.",
        "19... Be2 20. Re1 Bxf3 21. gxf3 cxd4 22. Kg2 Kd7 23. Ra2 Rc8 24. Rd1": "24. Rd1 - over the last few moves I have had to scratch around while David improves his position still further.  I get the feeling like I got when I lost to the Dentist many moons ago and Coach Ion and Dmaestro said that they both felt that I waited for the executioner.  My instinct was sadly right.  Like Henry the 8th in The Tudors, David has already ordered that executioner from France by DHL!",
        "24... Ba5 25. Kg3 Rc2": "25. ..... Rc2 - cutting off Henry's retreat to the 2nd rank.  Yup, I really am feeling like Anne Boleyn right now!",
        "26. Ra1": "26. Ra1 - scratch, itch, scratch!  While David closes the net in further ........",
        "26... Re2 27. Rxd4": "27. Rxd4 - I now get my pawn back but on the next turn, David warns me that Henry is not long for this world.  This only means one thing.  I am gonna cop, wait for it ........",
        "27... Be1+ 28. Kg4": "28. Kg4 - wait for it ......",
        "28... Rxh2": "28. ..... Rxh2 -  wait for it.",
        "29. Rd1 Rh4+ 30. Kg5 h6#": "30. ..... h6 MATE!! - ....... Old Matey!  Zut alors, le borreau est un petit pion - quell dommage! Et Fou Lenoir sur c1 est tres tres fou!  Ah well, that is the end of my A' Level French!  Time to say well played to David Patron!  Kind regards to you all - Joanne."
    },
    "url": "https://gameknot.com/annotation.pl/jos-welcome-mt-part-3-ruthless-but-elegantly-executed?gm=48863",
    "gameName": "Jo's Welcome MT Part 3 - Ruthless but elegantly executed",
    "players": "jstevens1 (1939) vs. drhpatron (2350)",
    "opening": "Sicilian (B21), Grand Prix attack"
}