{
    "moves": {
        "1. e4": "Hi everyone, I have decided to annotate a couple of very lucky wins.  After the disappointing result of the Beafyness tourney two players put a smile on my face by waving the white flag.  But, as you will see from these two games, the chessic illness I suffer from, passivitis, is still with me.  But I got away with it and as a result you could certainly call me a lucky so and so!  This game started out as a Guicco Piano.",
        "1... e5 2. Nf3 Nc6 3. Bc4 Bc5": "3. ........ Bc5 - these moves characterise the centre-contesting Guicco Piano.",
        "4. O-O Nf6 5. Nc3": "5. Nc3 - becomes more like a 4 kts game here.",
        "5... d6 6. d3 a6": "6. ....... a6 - preparing a b5 possibility.  I do get in this pawn break but it leaves my c6 pawn backward and weak.",
        "7. Ng5 O-O": "7. ......... 0-0 - dealing with the minor piece pile up on my weak f7 pawn.  Here we leave the database behind.",
        "8. Kh1 Na5 9. Bb3 Nxb3 10. cxb3": "10. cxb3 - this exchange of N for B breaks the pin on my f pawn and doubles up white's queenside pawns.",
        "10... c6 11. Bd2 Bd7 12. Qe2": "12. Qe2 - sensible development from my 1300  opponent.",
        "12... Re8 13. Be3 Bxe3 14. Qxe3 h6": "14. ......... h6 - after another exchange of minor pieces I have had enough of that enemy knight camped out on g5, back he jolly well goes!",
        "15. Nf3 Nh7 16. h3 b5 17. d4 Qc7": "17. ......... Qc7 - white has an excellent position and has made the thematic break d4.  Take note Joanne Stevens.  Glenda does her usual - adds defensive back up to d and e pawns x ray style along the diagonal.",
        "18. a3 f6 19. Ne2 Qb7 20. Ng3 Qa7 21. Rac1 Rec8 22. Rfd1": "22. Rfd1! - here it looks as though white can open some lines here to his advantage.  I did analyse that I would be a pawn down in a wretched position.  I was seriously considering waving the white flag.  Had it been an Expert or dmaestro I probably would have, but wait, my opponent has a 1300  rating.  I will see what he does on his next move before I make any decisions.  I play Be6 and say my prayers.",
        "22... Be6 23. b4": "23. b4 - and my prayers get answered.  This is the start of some irrelevant moves by my opponent which lets me off the hook!",
        "23... Ng5 24. Nxg5 hxg5": "24. ........... hxg5 - I end up with a doubleton on the kingside but I get rid of one of white's steeds and do not  have to worry about my own steed being dim on the rim!",
        "25. f3 g6": "25. ....... g6 - ah - I forgot to mention that with the exchange of knights the h file is open.  Henry is rather draughty here but behold - my second rank is empty but for one piece - Glenda!  If she senses danger to her other half she will be over there believe you me, but first I have the seed of an idea of attacking the enemy king down the h file and it germinates over the next few moves and it will be me with the extra booty!",
        "26. Ne2 Rc7 27. Rdg1 Kg7 28. f4 gxf4 29. Qf3": "29. Qf3 - first my opponent gives away a pawn.",
        "29... Qb7 30. Rcd1 Rh8": "30. ...... Rh8 - here I am planning to put Glenda on c8 piling up on the pinned h3 pawn.  White moves his rook to f1 on move 31 and his knight to g1 on move 32 to guard this beleagured h3 pawn.",
        "31. Rgf1 Qc8 32. Ng1": "32. Ng1 - however, because of the pin on the h file, the Wicked Witch of the West is skewered to her castle by Frere Leblanc on my next turn and, me, already a pawn up, will now be the exchange for a pawn up!",
        "32... Bg4 33. Qd3 Bxd1 34. Qxd1 Qd7 35. Nf3 Qe7": "35. ......... Qe7 - now it is my turn to b****r about.  I think I should have got in my g5 move here instead of next move.  To lose one tempo can be costly.  Thankfully not here.",
        "36. Qd3 g5 37. Nd2 g4": "37. .......... g4 - a pleasant surprise awaits me in that he waves the white flag.  In his resignation note he said that he felt that I was subjecting him to slow strangulation.  Me, jstevens1 doing that to an opponent?  Well, maybe I am starting to learn some lessons from my higher rated opponents and am finally putting them into practice!  Joanne"
    },
    "url": "https://gameknot.com/annotation.pl/jos-a-lucky-so-and-so-part-1?gm=20524",
    "gameName": "Jo's a Lucky So and So - Part 1",
    "players": "NN (1329) vs. jstevens1 (1734)",
    "opening": "Giuoco Piano (C50)"
}