{
    "moves": {
        "1. e4": "Hi everyone!\n\nAfter my loss against Etienne (A-Random-Guy), Coach Ion's kind remarks on Etienne's and my summing up about when to switch from attack to defense if an attack runs out of steam certainly rings true in this particular game.  One thing is for sure, when mounting a mating attack, Glenda cannot do this on her own despite the powers she has been given.  She needs assistance.  Another example of this is my Latvian game with Coach Ion many moons ago when, although Glenda on her own managed to net a rook in Ion's pos, that was all she got and because of the concentration of force that Ion's queen together with other pieces, Henry ended up getting chased around - Glenda, who remained on h1 for the rest of the game never even got the chance to hit back - and eventually I resigned on the grounds of unavoidable mate.  Later on, Glenda did eventually end that losing streak against Ion with a perpetual - but the emphasis is, GLENDA NEEDS ASSISTANCE!  In that game Glenda had assistance from Fou Lenoir and that made all the difference.\n\nNow, in this game, Glenda tries to attack on her own but to no effect.  She ends up being shut off from the action and Henry ends up castling into it.  Ken, my opponent then exploits that mistake by launching a powerful mating attack on Henry.  Fortunately for me, an untimely bishop check on Ken's part leads to Henry escaping to the kingside and Ken's attack runs out of steam and he eventually ends up losing both his rook and bishop and resigning on the grounds of Ruinous Loss of Material.  So, how does this happen?  Well, let's start at the beginning.  After a double king pawn opening I end up playing against the Philidor's Defense which is as .......",
        "1... e5 2. Nf3 d6": "2. ...... d6 - .... follows.  This opening was explored by Andre Dancan Philidor and it is a playable opening although black can get cramped up big time.",
        "3. Bc4": "3. Bc4 - sometimes d4 is played and I have played it but here I thought Bc4 would make a nice change.  It does strike at f7 and once black castles the f7 pawn will be pinned.  This can get exploited later on.",
        "3... Nf6 4. Nc3 Bg4": "4. ...... Bg4 - this move is good here.  If I had played d4 before this move then it would not have been good.  To see why you will need to google up the Opera Game between Paul Morphy against The Duke of Brunswick and Count Isouard in consultation - these noble dudes copped Old Matey on Move 17.  Hmm, maybe d4 might have still been playable here, although Glenda will be chased around a bit on the recapture by Nc6.",
        "5. h3": "5. h3 - stab.",
        "5... Bh5": "6. ...... Bh5 - retreat.",
        "6. d3 c6 7. g4": "7. g4 - this move tries to trap Ken's lsb.  I end up weakening the kingside however, and it is this that will dissuade me from moving Henry there later on.",
        "7... Bg6 8. Nh4 Be7 9. Nxg6 hxg6": "9. ..... hxg6 - this knight trade seemed a good idea at the time, but it does further weaken my kingside and opens up a line for a black rook.  This influences Ken's correct decision to leave his king in the centre rather than castle.",
        "10. Bd2 d5 11. exd5 cxd5": "11. ..... cxd5 - pawn trade, and now Fou Leblanc must take evasive action.  He moves to b3 but would b5 have been an improvement?  You, the Inquest Jury decide.",
        "12. Bb3 d4 13. Ne4 Nxe4 14. dxe4": "14. dxe4 - after this trade of knights, Ken has a very strong pawn centre.  That d4 pawn was to very nearly win the game for Ken later on.",
        "14... Nc6 15. Qf3 f6": "15. ..... f6 - this move is good here.  Ken supports his powerful pawn centre.  However, he plays g5 next move and it is this that entices Glenda up the board to attack as a lone wolf.  This attack will prove premature as black has locked up the position so it will be very difficult for Glenda to get assistance and she could also end up being cut off from Henry just when he needs her most.",
        "16. g5 Qd6 17. gxf6 gxf6": "17. .... gxf6 - after this pawn trade, Glenda is attracted upwards like ......",
        "18. Qg4 g5 19. Qf5": "19. Qf5 - ..... a moth to a flame .....",
        "19... b5 20. O-O-O": "20. 0-0-0 - equally so, in retrospect, Henry is also similarly attracted to the queenside.  With the possibility of a two number pawn storm and open lines I just wonder whether I castled into it!",
        "20... a5 21. Bd5 Rb8 22. Qg6+": "22. Qd6+ - further on and further up!",
        "22... Kd8": "22. .... Kd8 - with black's position locked and solid, Glenda is getting nowhere fast and although Ken cannot now castle, his king is perfectly safe ..... I'm not sure whether I can say the same for Henry.",
        "23. Bxc6 Qxc6 24. Bxa5+ Kd7": "24. ..... Kd7 - I win a pawn, but have I made Henry's position even more vulnerable?  Only time will tell.",
        "25. Be1": "25. Be1 - I do intend to move Fou Lenoir to f2 after f3 but Ken ensures that I have no time for this.",
        "25... Rbc8": "25. ...... Rbc8 - suddenly, a dark, dark shadow appears over Henry and he starts shivering despite his pawn cover.  He looks up to see the Chessic Grim Reaper, Old Matey weaving his scythe at him.  Not a pretty sight.  I end up letting my clock run down to less than 3 days per move before I finally defend with 26. c3.",
        "26. c3 Ke6 27. Qf5+": "27. Qf5+ - Glenda gets a check in.  She is heading for f3 to add to the defense of c3.  I move comparatively quickly to build up some time on my clock to think about just how I can get Henry out of this mess and boy I need all the time I can get because I am very short on ideas here.",
        "27... Kf7 28. Qf3 b4": "28. ..... b4 - nasty!",
        "29. Rd3": "29. Rd3 - this move creates a flight square for Henry and adds to the defense of c3.",
        "29... bxc3 30. bxc3": "30. bxc3 - this is real Hope Chess. I am praying that Ken cannot resist checking me.  If he plays Qa4 this will cut off Henry's escape to d1 and if I put Henry on d2 then PxP+ is really nasty!  I can just see my rating reading 1800 something a few days down the line!  Thankfully fate has decided that for now, I keep that precious 1900 rating in the form of my opponent putting that bishop on a3!",
        "30... Ba3+ 31. Kd1 Qa4+": "31. ..... Qa4+ - now the Wicked Witch of the West does move to a4 but e2 is at Henry's disposal for his deadly dash to the kingside!  Thankfully, despite having to look at Old Matey's fiz for a few days or so he has worked up just enough appetite to eat prawns and spinach for lunch, so he has enough power in his legs to do that runner!",
        "32. Ke2 Qc2+ 33. Rd2": "33. Rd2 - gotta preserve that passer on e2.",
        "33... Qxc3 34. Rd3": "34. Rd3 - and now the Witch is skewered against the bishop on a3!",
        "34... Qb2+ 35. Kf1": "35. Kf1 - Henry now makes safety and the pawn on a2 lives because Ken must do something about his bishop.  However, he still presses for attack with Rc1 but I worked out that I can safely remove the bishop on h3 and still have time to put Henry on g2.  It is still not entirely safe, but at least 2 out of the 3 of Ken's heavies are still on the other side of the board and I am now a piece up - this could prove decisive in the coming endgame.",
        "35... Rc1 36. Rxa3 Qb5+ 37. Kg2 Qb7 38. Qb3+": "38. Qb3+ - and I now remove one of these heavies with check.  Even though Glenda perishes, the Witch dies with her and I am a whole piece up with a potential comeback for Glenda on a8.",
        "38... Qxb3 39. Rxb3 Ra8 40. a3": "40. a3 - Ken attacks my passer but this is no problem.  I am planning Bb4 next move to back up that a pawn and either force an exchange of one pair of rooks or drive that black rook off my first rank and put my own rook on b1 if he chooses to retreat with the rook.  That will be a potential for a doubling up on the b column later on.  However, Ken makes the final, tragic blunder ...... Ke7?? ",
        "40... Ke7 41. Bb4+": "41. Bb4+ - this enables me to attack his rook on c1 with check and so I win it next move.  Afterwards Ken will be 8 points down in material and he decided that it would be far too much and resigned on the grounds of ruinous loss of material.  Ken told me afterwards that he enjoyed the game immensely and it was one of the best he had played.  I heartily agree that he certainly gave me a big run for my money here and he can hold his head up high!  Anyhow, as Yours Truly struggles to hold on to her 1900 rating, there are two further games to come where I do manage a successful co-ordinated mating attack.  These are against opponents Friar and Jkarp.  Watch this space ......"
    },
    "url": "https://gameknot.com/annotation.pl/jos-welcome-mt-part-3-hope-chess?gm=49908",
    "gameName": "Jo's Welcome MT Part 3 - Hope Chess!",
    "players": "jstevens1 (1947) vs. kneilca2 (1493)",
    "opening": "Philidor (C41), Steinitz variation"
}