{
    "moves": {
        "1. e4": "Hi everyone, this is the second of my great escapes involving pawn promotions from my opponent two moves before me.  This game was also drawn.  This game starts off as The Centre Counter or Scandinavian Defense.  An exchange of pawns now follow and black moves his queen to an unusual square after the standard 3. Nc3 - the normal move is 3.............. Qa5.",
        "1... d5 2. exd5 Qxd5 3. Nc3 Qd6 4. d4 Nf6 5. Nf3 a6 6. g3 b5 7. Bg2 Bb7 8. O-O": "8. 0-0  - here I have a slight lead in development but somehow things do go slightly awry in the middlegame for me.",
        "8... e6": "8. .......... e6 - opens a line for black's dsb to come out.  Black does not castle until move 17!",
        "9. Bf4": "9. Bf4 - develops with a threat to the Wicked Witch of the West.",
        "9... Qb6 10. a4 b4 11. a5 Qa7 12. Na4": "12. Na4 - I am just starting to come out of the database here.  Black's pieces are rather tied up on the queenside but somehow I just do not take full advantage of this.",
        "12... Nbd7 13. Bxc7": "13. Bxc7 - here I win a pawn, but I do not manage to hold on to it.",
        "13... Bc6 14. Bf4 Be7 15. Be3 Ng4 16. c3 Nxe3 17. fxe3": "17. fxe3 - this exchange of B for N does keep my pawns together.",
        "17... O-O 18. Rf2 Nf6 19. Ne5": "19. Ne5 - creates an outpost for my knight but allows the exchange of lsbs.",
        "19... Bxg2 20. Rxg2 Qb7 21. Nb6": "21. Nb6 - attacks rook on a1 and unmasks a defensive battery to my a5 pawn.  This is the pawn which will give me a draw later on.",
        "21... Ra7 22. Qb3 Nd5 23. Nxd5 exd5 24. Nd3 bxc3 25. Qxb7 Rxb7 26. bxc3": "26. bxc3 - normally a queen trade when you are up in material is a good thing.  Not so here.",
        "26... Rb5 27. Rga2 Rc8 28. Rc2 Bd8 29. Nc5": "29. Nc5 - screens out the c8 rook's attack on my c 3 pawn and also attacks black's a pawn, but black still piles on the pressure.",
        "29... Rc6 30. c4 dxc4 31. Rxc4": "31. Rxc4 - gets rid of one weak pawn, the c pawn, but the a pawn is still very vulnerable.  It is the d pawn that will fall, however.",
        "31... Be7 32. Ra2": "32.  Ra2 - this prophylactic move will prevent a black rook invading on b2 and if black checks on b1 then as soon as the white king moves away from the bottom two ranks, the rook will protect the h2 pawn.  This rook will become a statue until move 52.",
        "32... g6 33. Kf2 Bxc5 34. dxc5 Rbxc5 35. Rxc5 Rxc5 36. Ke2": "36. Ke2 - Henry centralises himself as far as possible - your king is a fighting piece in the endgame - use him!",
        "36... f5 37. Kd3 Kf7 38. e4": "38. e4! - it is a good idea to try and force a swap of weak pawns when you have the opportunity to do so.  My rook is already tied up so my king must make all the moves here.",
        "38... Kf6 39. exf5 Kxf5": "39. ............. Kxf5 - mission accomplished - no need to defend the e pawn now!",
        "40. Kd4 Rb5 41. Kc4": "41. Kc4 - I'm afraid this is the boring bit here.  Henry must shuttle betweel c4 and d4.  The reason - he must be as close to c5 as possible.  I can only now wait for black to commit himself.  This is not waiting for the executioner because when black does commit himself Henry is going to snaffle the black a6 pawn and try to crown the a pawn.",
        "41... h5 42. Kd4 Kg4 43. Kc4 Kh3 44. Kd4 g5 45. Kc4 h4 46. gxh4": "46. gxh4 - the monotony of the last few moves is temporarily broken by this pawn exchange.",
        "46... Kxh4 47. Kd4 Kh3 48. Kc4 g4 49. Kd4 Rb1": "49. ....................... Rb1 - here it comes!  Henry now goes to c5 next turn.  It is here that I set up some conditional moves ending in  my pawn arriving on a7.  The race is on.",
        "50. Kc5 Rh1 51. Kb6 Rxh2 52. Rxh2+ Kxh2 53. Kxa6 g3 54. Kb7 g2 55. a6 g1=Q 56. a7": "56. a7 - now the a pawn has safely arrived on a7 I feel that I should draw this game, especially as what happened in Jo's Great Escape Part 1 was still fresh in my mind.  I did feel extremely nervous though.  After all, I have only a little pawn to keep Henry company whereas my opponent has the mighty Wicked Witch of the West.  Now follows a series of checks.",
        "56... Qg7+ 57. Kb8 Qe5+ 58. Kb7 Qd5+ 59. Kb8 Qd6+ 60. Kb7 Qb4+ 61. Ka8": "61. Ka8 - a stalemate try here.  If the black king tries to come to the Witch's aid then I will have no legal moves and therefore Gameknot will declare the game drawn for me.  My opponent would have no say in the matter (he declined a draw offer on move 58).",
        "61... Qa5": "61. ............. Qa5 - he sees the stalemate - oh dear, I hope I don't have to play out the 50 move rule because if this goes on for very much longer then me pore ole 'enry is gonna have a CORONARY!",
        "62. Kb8": "62. Kb8 - I play that move before I went to beddy byes.  I managed to sleep fitfully that night.  It was work the next day - thankfully my first task was filing which kept me busy until my coffee break.  At 1030 BST I got some coffee and a digestive and turned on to gameknot.  I looked at my active games list and saw two words that were manna from heaven - draw offer.  I made sure that my mouse was hovering over the Yes button and prayed that I would not get distracted at the last minute and accidentally decline the draw.  This did not happen and I clicked on the correct button.  Seconds later the game was drawn, whew and double whew!",
        "62... Qb6+": ""
    },
    "url": "https://gameknot.com/annotation.pl/jos-great-escape-part-2?gm=17850",
    "gameName": "Jo's Great Escape, Part 2",
    "players": "jstevens1 (1679) vs. NN (1710)",
    "opening": "Scandinavian (B01), Pytel-Wade variation"
}