{
    "moves": {
        "1. e4": "Hi everyone!\n\nMy opponent asked me for a rated challenge.  I did oblige because I have been in a whirlwind of rated games, although I will still play most non-MT games unrated.  Thankfully I won this game but it was very slow and hard process, even when I was a pawn up in a K & P ending I found it hard to find the right winning plan.  Thankfully I did.  You can all follow this game by clicking on the Gameknot Analysis link here: http://gameknot.com/analyze-board.pl?bd=17177151&fb=1&rnd=0.6438160757498827.  I feel that this game would be a very useful endgame study even if I did have to work hard for this victory.",
        "1... e5 2. Nf3 Nc6 3. Bb5": "3. Bb5 - this double king pawn opening becomes the Ruy Lopez with this move and I play the most usual move which is a6.",
        "3... a6 4. Ba4 Nf6": "4. .... Nf6 - the most popular defense in the Lopez - the Morphy Defense.",
        "5. O-O Be7": "5. .... Be7 - the closed Ruy Lopez.  Nxe4 is the Open Lopez where white eventually will get his pawn back due to a rook pin on the e column.",
        "6. Re1 b5": "6. .... b5 - now the lsb is driven back.",
        "7. Bb3 d6 8. d3 O-O 9. d4": "9. d4 - after a bit of line opening and getting Henry to safety on the kingside white decides to open up the position with a d4 pawn break.",
        "9... exd4 10. Nxd4 Nxd4 11. Qxd4": "11. Qxd4 - of which a plethora of exchanges has occurred with the Wicked Witch of the West well centred mid-board.  I now put pressure on the e4 pawn by putting Fou Leblanc on the long a8-h1 diagonal with Bb7.",
        "11... Bb7 12. Bd5 Nxd5 13. exd5 Bf6": "13. ..... Bf6 - Fou Lenoir drives back the Witch.",
        "14. Qd3 Re8 15. Rxe8+ Qxe8": "15. .... Qxe8 - rook trade.",
        "16. Kf1 Qe5": "16. .... Qe5 - Glenda takes advantage of the fact that white's queenside is still undeveloped after 16 moves.  I have managed to free my position quite a lot and the d5 pawn is virtually isolated thanks to my b5 pawn.  I take advantage of this and get a decisive pawn plus over the next few moves.",
        "17. g3 Qxd5 18. Qxd5 Bxd5": "18. .... Bxd5 - now, here we go.  We are almost in an endgame.  White's queenside is still undeveloped and I have the bishop pair plus a 1 pawn advantage.  Now I must capitalise on this and convert this to victory.  Unfortunately the path to victory is not as easy as it looks and white has no intention of waving that white flag ..... yet ....",
        "19. c3 Re8": "19. .... Re8 - I start with centralising my QR.",
        "20. Be3": "20. Be3 - finally, on move 20, white starts to develop his queenside.",
        "20... c5": "20. ..... c5 - and I expand on my own queenside.",
        "21. Nd2 Be7 22. b3 Bc6": "22. ..... Bc6 - the retreats of the ecclesiastical twins over the last two moves may seem baffling to you but please note that I do have a pawn majority of 4:3 on the queenside.  These prelates are there to provide spiritual guidance to this particular flock of footmen.  I intend to create a passer out of one of them by eventually pushing up the d6 pawn at a convenient moment and if I do this then the c5 pawn is still defended by Fou Lenoir.",
        "23. h4 Bf6": "23. .... Bf6 - Fou Lenoir slips back to f6 however to use white's backward c3 pawn as a tie down for the white QR.  Even if this tie-down is only temporary this could gain me some very useful tempi later on.",
        "24. Rc1 a5 25. c4 b4": "25. .... b4 - hmmp, no immediate chance of getting a passer here, but I must persist.",
        "26. Bf4 Be5 27. Bxe5 Rxe5": "27. .....Rxe5 - I chose this capture to keep my rook active on the e column and to try and cut off the WK and keep him confined to the kingside as much as possible.  If white puts his own rook on the e column to neutralise its power I will be more than happy to trade it off which should accentuate my 1 pawn advantage.",
        "28. f4 Re7": "28. .... Re7 - keeping my rook on that e column after its enforced retreat.",
        "29. Re1 Rxe1+ 30. Kxe1": "30. Kxe1 - the rook trade has now taken place.  But where do I go from here?  Well, here is the maxim.  Activate your king in the endgame.  I know for sure that my king, Henry gets really ravenous in the endgame.  He just lurves those p(r)awns and he will feast on them if he gets the chance!",
        "30... Kf8 31. Kf2 Ke7": "31. ..... Ke7 - sure enough, out comes Henry!",
        "32. Ke3 f5": "32. ..... f5 - this keeps back the WK and now Henry can move to f6 without obstructing any pawns.",
        "33. Nf3": "33. Nf3 - if there is one sure way to lose when you are behind on material, it is this way.  Do not trade down to a pure K & P ending except in this circumstance.  Your opponent has a backward pawn and your own king is near it.  This game does illustrate that particular principle http://gameknot.com/annotation.pl/an-exception-to-the-rule?gm=24210 - but it does not hold up in this game!",
        "33... Bxf3 34. Kxf3 Ke6 35. h5 d5": "35. ..... d5 - Over the last two moves, Henry and my d pawn have formed a dynamic duo to correct the backward pawn scenario.  My pawn finally gets to d5 and if it is traded off then Henry is beautifully centralised for the endgame.",
        "36. Ke3 d4+": "36. ..... d4+ - I now get my passer on the queenside.  This passer is just three squares from Glendadom but he cannot get there yet.  I must do something else first.",
        "37. Kf3 Kf6": "37. ..... Kf6 - the start of a Cat Among The Pigeons (or Henry among the white kingside pawns) plan.  The white king dare not stray too far on the kingside for fear of Glenda appearing on d1.",
        "38. Kf2 g5": "38. .... g5 - carrying out that plan a little further.  If PxP then K x P and the pawn on h5 falls next move.",
        "39. Kf3 g4+": "39. ..... g4+ - this pawn advance cuts off any defense of the pawn on h5.  Henry is licking his lips!",
        "40. Kf2 Kg7": "40. .... Kg7.  Henry moves towards the pawn.  My opponent and I have a little chat about the game.  He asked me if I had a winning plan and if I did he would resign.  He did ask me if I allowed resignations and I said that it was up to him - if he wanted to play it out to mate - fine.  If he wanted to resign on the grounds of ruinous loss of material it was also fine by me.  I then spelled out my winning plan as follows:- You will not be able to prevent Henry from eating your h pawn. Here is the plan. 1. Eat the h pawn. 2. Push up my h pawn and temporarily sac it and decoy your g pawn onto the h column which will be a target for Henry. Your king may be able to defend it but I will then push my d pawn. Your king cannot be in two places at once. In order to stop the d pawn getting to Glendadom you will have to abandon your h pawn and then Henry will help the g pawn crown. I will now play the first move in my plan. The next move will be Kh6 followed by Kxh5. Joanne\n\nAfter that he waved the white flag.  I will be annotating more games soon as they have some interesting features in them.  Until then - bye for now - Joanne  "
    },
    "url": "https://gameknot.com/annotation.pl/jos-slow-go-victory?gm=43899",
    "gameName": "Jo's slow-go victory",
    "players": "ab15 (1641) vs. jstevens1 (1843)",
    "opening": "Ruy Lopez (C88), closed, Leonhardt variation"
}