{
    "moves": {
        "1. d4": "A beautiful London. I hardly believed it. Specially after losing a game with easy19 in the same tournament, in which I played very, very badly. With this game, I think I mantain the balance... blitzkov will have another chance to crush me, anyway :-)",
        "1... Nf6 2. Bf4 d5 3. Nf3 e6 4. e3": "When black plays e6, h3 is not really necessary anymore. I like h3 because it supports g4-g5, a standard attack. ",
        "4... Bd6 5. Ne5": "Once Nf6 is played, this knight cannot be kicked anymore - or not that easily. ",
        "5... O-O": "A common response is Nh5, to which I'll go Bg3, and if NxB, hxN, I get a free semiopen column. ",
        "6. Nd2": "Better than Nc3, because I want to restrict black's dsb movements. If ever Bb4, c3. ",
        "6... Nbd7": "Black can take the N, but only at the cost of his dsb. And now black cannot play Nh5 anymore. ",
        "7. Qf3": "!? An antinatural move. Another chance is g4 at once. No advantage, but white is where it is supposed to be: attacking. ",
        "7... Qe7": "It seems a normal move, but black \"had\" to play c5, in order to open his position and activate his pieces. ",
        "8. Bd3": "Another gun over the black kingside. ",
        "8... c6": "Dubious, I'd say. Black wants a solid position, but his lsb stays inactive. I'm already thinking on sacrifices (it doesn't work for a win... still:\n\n9.\tQg3 (threatening Bh6)\t\tNh5 (a standard defence)\n10.\tBxh7+\tKxh7\n11.\tQh3\t\tf6 (black cannot avoid white to recover the piece)\n12.\tQxh5+\th7-g8\n13.\tNg6, winning. \n\nOr: \n\n9.\tQg3\t\tNh5\n10.\tBxh7+\tKxh7\n11.\tQh3\t\tBxe5 (say)\n12.\tQxh5+\tKg8\n13.\tdxBe5\t\te7-b4\n14.\to-o-o\t\tNc5\n15.\tNb3\t\tNe4\n16.\tRd4\t\tQb5 and white's attack vanishes.\n\n",
        "9. Qg3 Bb8": "Black guards his bishop on a safe square, foreseeing danger for his dsb. \n\n\n10.\tf4-h6\tf6-h5\n11.\tg3-g4\td7-f6\n12.\th6-g5\tf6-g4\n13.\tg5-e7\tg4-e5\n14.\td4-e5\tf8-e8\n15.\tg2-g4\te8-e7\n16.\tg4-h5\tb8-e5\n17.\te1-c1\tc6-c5\n18.\tc2-c3\tb7-b6",
        "10. Bg5": "Much better than Bh6, IMO. Now black is cramped, since it cannot exchange without losing a piece. There are a lot of variations, but the main point is that Nf6 is pinned. ",
        "10... Kh8": "Probably seeking for h6. I think black should have tried Qb4 at once. If I go NxN, NxN; Qh3, f5 and my attack vanishes. (Not BxN because of Qh4, and black cannot defend the king's position). ",
        "11. O-O-O": "After some calculation, I decided that there was no reason for hurry, since if I don't exchange pieces, black is cramped. ",
        "11... a5": "I feared c5. This is only a lost tempo, since my pressure against the kingside becomes now stronger, now. ",
        "12. f4": "Again, I had to be patient. This makes my e5 knight free to move. The point of all my attack is to avoid a black knight to be on f6, so I can attack h7. If black exchanges now, in addition to the threat on the pinned knight, I can open the f semicolumn. Anyway, Nh5, trying a queen's exchange, fails because my bishop, after BxQe7, Nh5xQg3, hxNg3, threats the black Rook. ",
        "12... c5": "At last, but a move too late. ",
        "13. Qh4": "Of course, if h6 at some point, I would have played h4, since hxB, hxg5+ was deadly for black. ",
        "13... c4": "I expected this, but my attack is ready to spring. ",
        "14. Bxh7 c3": "The last try. ",
        "15. Nxd7": "The only correct move to win, IMO. I analyzed Nxf7+, too, but after RxN, Bg6+, Kg8, I have to save two pieces and I have no mate. ",
        "15... cxb2+": "Or cxNd2, it would have been the same. ",
        "16. Kb1": "Of course I don't fall for Kxb2.",
        "16... Bxd7 17. Bd3+": "Of course not BxN, QxB.",
        "17... Kg8 18. Bxf6": "An mate the next, whatever black does. I guess black has other defences, but how much should we go back to find it?",
        "18... Qxf6 19. Qh7#": ""
    },
    "url": "https://gameknot.com/annotation.pl/jos-welcome-mt-part-3?gm=47990",
    "gameName": "Jo's Welcome MT Part 3",
    "players": "damalfi (1759) vs. blitzkov (1874)",
    "opening": "Queen's pawn game (A45)"
}