{
    "moves": {
        "1. d4": "You would think that 1750  players would be above missing or walking into basic tactics wouldn't you?  But not jstevens1, oh no.  In this game I played to the level of my OTB rating - 1200!  In fact from some 1200 players I have seen better!  So, Jo, time to get back to basics!  The game starts off with Ion playing d4 and me trying to set up some flank action with the Modern Defence which is the response g6.",
        "1... g6 2. c4 Bg7 3. e4 d6": "3. ........ d6 - transposes into a Pirc/Robatsch Defence.",
        "4. Nc3 e5 5. Nf3 exd4 6. Nxd4": "6. Nxd4 - I break up Ion's impressive pawn wall and now I concentrate on simple development.",
        "6... Ne7 7. Be3 O-O 8. Qd2 Nbc6 9. Be2 f5": "9. ......... f5 - a recommended db move, but I think this is the start of a recipie for disaster!",
        "10. O-O Nxd4 11. Bxd4 Bxd4 12. Qxd4 Be6": "12. ......... Be6 - so far, db but now Ion takes me out of it with this move.  I now take back with the wrong unit I think.  Jury, would you agree that Nxf5 attacking the Wicked Witch of the West have been a better recapture?",
        "13. exf5 Bxf5 14. Bf3 c5": "14. ........ c5?  this move is intended to drive away the Wicked Witch but jury, do you agree that c6 would have been a better move here?  At least it would have blocked off that light squared bishop's diagonal.",
        "15. Bd5+ Nxd5 16. Qxd5+ Rf7": "16. .......... Rf7 - the only way to avoid losing material outright is to block the check on d5 with the rook - although the rook is pinned the Witch cannot take the b pawn as in moving the witch would release the rook from the pin and so the witch would be no more.  No such luck!",
        "17. Rad1": "17. Rad1 - the pressure mounts on my d6 pawn which becomes a new target.",
        "17... Qb6": "17. ........... Qb6 - counterattack on the b2 pawn but it simply doesn't wash!",
        "18. Nb5 Rd8 19. Nxd6 Rdd7": "19. .......... Rdd7 - an amazing array of pins here!  As an exercise, perhaps you the jury would like to tell me how many pins there are and what is pinned to what!",
        "20. Rfe1 Qd8": "20. ......... Qd8 - I sink further into deep ordure!",
        "21. Nxf7 Rxd5": "21. ......... Rxd5 - I play the move but then decided to throw in the sponge because Glenda will fall next move and my rook will have to take on d1.  The recapture will leave Ion an R & P up.  I would resign against someone 300 points lower than me never mind higher with this kind of deficit.  A sorry tale."
    },
    "url": "https://gameknot.com/annotation.pl/joanne-stevens-get-back-to-basics?gm=21384",
    "gameName": "Joanne Stevens - get back to basics!!",
    "players": "ionadowman (2043) vs. jstevens1 (1757)",
    "opening": "Beefeater defence (A40)"
}