{
    "moves": {
        "1. e4 e5 2. Nf3 Nc6 3. d4 exd4": "Scotch game. I'm fine with playing the main line, so I take the pawn.",
        "4. Nxd4 Nf6 5. Nxc6 bxc6 6. Bd3 d5": "White deviates from the main line. I'm not sure d3 best place for his bishop because now it has no moves unless it moves backwards to e2 or f1, but it does defend the e4 pawn. Black's move offers white's d3 bishop more scope but it gets black more presence in the center.",
        "7. exd5 cxd5": "Now black's pawns are undoubled and he seems to have gained a tempo, since both sides have one piece developed but black has the only pawn in the center.",
        "8. Bg5 Be7 9. O-O c6": "The d5 pawn was weak. Without the advance at c6, white could play 10. Bxf6 Bxf6, 11. Bb5  and now if black blocks with Bd7 the pawn at d5 would have no defender, so black would have to play Kf8 ruining his castling and imiting the scope of the rook at h8.",
        "10. Bxf6 Bxf6 11. Re1+ Be6 12. c3 O-O": "Apparently white didn't want me to kill his b2 pawn and a1 rook, hence his 12. c3 move. It buys me time to castle. And now black has more tempi with 3 developed pieces to white's two, and still the more dominant center.",
        "13. Nd2 Rb8": "Another way to hunt the b2 pawn.",
        "14. Qc2 g6": "Protecting the long diagonal from b1 to h7. White dominates this diagonal, but black's pawns now limit his use of it to just b1 to d3.",
        "15. Nf3 Qd6": "Looking to dominate my own long diagonal from b8 to h2.",
        "16. Rab1 Rb6": "Without a whole lot of interesting attacks presenting themselves, I decide to work on the half-open b-file, starting by doubling the rooks.",
        "17. b4 c5": "White's pawn advance to b4 takes a little pressure off of his b-pawn, but leaves his pawn at c3 backward and defended only by his queen. Black's move to c5 offers to open blacks's attack on the c-file where his queen and rook (f1) can join his bishop in the attack on the c3 pawn. Truth is, I didn't expect to win the c3 pawn, but was hoping to open up channels to the a2 pawn which seemed like a real possibility here given the combinations I was seeing at this time. White might have maintained the status quo with 18. a3. ",
        "18. bxc5 Qxc5": "Now it's 2 against 1 attacking the pawn at c3. Notice how black has converted his tempo advantage into an attack and white, despite going first, is on the defensive.",
        "19. Rxb6 axb6": "And now I have two half-open files to aim at whites a and c pawns as needed. Sure, he has two half-open files to aim at black's b and d pawns, but black is attacking and white is defending. Tempo.",
        "20. Ne5 d4": "White blocks black's f6 bishop. Black's pawn advance threatens the knight by opening my queen's attack on e5. It also threatens the pawn at c3. White can handle both of these threats quite easily. But black's pawn advance to d4 also exposed an attack on white's pawn at a2 by black's bishop at e6.",
        "21. cxd4 Qxd4": "Not 21. ... Qxc2?, 22. Bxc2 and white is ahead by a pawn. After black plays Bxa2 the game is even. As played, white's knight is still in danger.",
        "22. Nc6 Qd5": "Black's queen evades the knight's attack and puts pressure on a2. Also threatened is 23. ... Rc8 pinning white's knight, 24. Rc1 Bd2. But white can squirm out of it by playing Be4 to defend the knight. What I really expected by moving to d4 was what white actually played - the obvious move.",
        "23. Nb4 Qa5": "After white's obvious move, I now pin the knight to the undefended rook on e1. Clearly, white cannot move the knight or he will be checkmated. Black threatens Be7 to assault the knight. White cannot defend by 24. a3 because black will play Qxa3 and will finally have that material advantage he's been hunting for the last 7 moves. Still, this attack isn't quite enough, since white can defend the knight with rook and queen. I am expecting 24. Rb1 to both defend and unpin the knight, followed by 24. ... Be7. Now white must move the knight, removing a defender of the a2 pawn and allowing black to take the pawn, or defend the knight with his queen, forcing her to do double duty, whereupon black plans to play Bd5 or Bd1 to protect the pawn at b3 then exchange the knight and queen, leaving the pawn undefended at a2 so the black bishop at e6 can take the pawn. A lot of work for a pawn, and white can squirm out of it with careful play.",
        "24. Qd2 Bxa2": "24. Qd2? was a blunder for white. The queen is doing double duty and cannot protect both the knight at the pawn. And white cannot play 25. Nxa2?? because the knight is pinned to the undefended queen. The a2 pawn finally falls after black has been working on this pawn, jockeying for position, for 8 moves.",
        "25. Nc6 Qxd2": "Of course 25. Nc6?? was a huge blunder and it cost white the game. After black's move, white resigned. Now he cannot save the bishop at d3. After 26. Re3 Qd8 , 27. Bf1 Bc5 still wins the white bishop (as if being up by queen pawn wasn't enough). I confess to being dumbfounded by white's careless 25th move. Clearly, white realized that 25. Nxa2?? would cost him his queen (else why didn't he just take the bishop to win the piece?) but then he chose another knight move instead. This was a very surprise ending to an otherwise well-contested game."
    },
    "url": "https://gameknot.com/annotation.pl/jockeying-for-position?gm=20981",
    "gameName": "Jockeying for Position",
    "players": "parrisloree (1391) vs. blake84120 (1396)",
    "opening": "Scotch (C45), Mieses variation"
}