{
    "moves": {
        "1. e4 e5 2. f4": "My second game against Joanne, who is a very strong player. Our first ended in a draw with me as black. Now, I take quite some chances with the King's gambit, which often leads to wild but interesting games, and which is an opening I love",
        "2... exf4": "Joanne accepts the gambit (KGA). The key strategy for white now is to develop a fast and effective kingside attack without loss of tempo. White's disadvantage, apart from the sacrificed pawn, is a weak kingside position. The advantage is fast development of the kingside for the attack.",
        "3. Nf3": "The usual move, although 3. Bc4 has also lead to great games",
        "3... d6": "3...d6 is the KGA variant that has Bobby Fisher's name. When he introduced it, he claimed that it nullified the KGA. Yet, Fisher played the KGA as white later on - with quite some success. In my view 3...d6 is a very strong move - in all its simplicity. It opens the path for the LSB (light-squared bishop), protects e5, and does not destroy the kingside fortress",
        "4. Bc4": "4. Bc4 is important in most versions of KGA. It puts pressure on the weak square f7, the typical focus of attack in KGA. The f7 square will be important in this game, too",
        "4... h6": "4....h6 is another good move, preparing for a strong black bastion on the king side",
        "5. h4": "The GK computer claims 5. h4 to be a considerable inaccuracy (see computer analysis), on which I dare to disagree. The suggested alternative, 5. d4, would be followed by 5....g5, which I was aiming to prevent. I was also thinking about 5. b3 as an alternative interesting possibility, leading to the somewhat atypical fianchetto of white's DSB. I must try that next time.",
        "5... Nf6": "Probably the best move by black, straightforward development of the kingside, attacking e4, and eyeing g4 in a later attack",
        "6. Nc3": "6.Nc3 is best here, I think. A sound developing move with simultaneous support of e4",
        "6... Be7 7. d4": "7. 0-0 was also possible here",
        "7... Nh5": "Simultaneous support for the threatened f4 and eyeing g4 - strong play by Joanne! 7....Nxe4 was also possible, followed by 8. Nxe4, d5 9. Bxf4, dxc4 10. d5",
        "8. O-O": "8. Ne2 was also all right, putting more pressure on f4, since e4 was no longer attacked, and moving more arsenal to the kingside. The more support for an attack, the better the chances. The downside is, of course, that the attacker must not lose tempo!",
        "8... Bg4": "Black's strong play continues - attack is the best defense! g5 was also possible (but will come next)",
        "9. Qd3": "Removes the pin on the queen by the bishop, but nevertheless keeps the queen in play. Nd2 and Nd5 were other possibilities worth exploring separately",
        "9... g5": "This completes black's pawn organisation; very strong! However, note that behind that fence of pawns the black king is vulnerable. White's LSB has eyed f7 for some time now. In retrospect, 9.....0-0 might have been better.",
        "10. Nh2": "Nh2 is a strong move, chasing off the LSB, opening up the f column for the rook as well as a path for the white queen towards the side of attack. Moves with multiple good purposes of both attack and defense are always the best ones! It is therefore worth the while to take time to find them.",
        "10... Bd7": "10...Bd7 is not bad, but I think Be6 had been better with the aim to exchange away the dangerous white LSB at c4",
        "11. Qf3": "11. Qf3 is again multipurpose: it brings the Q into \"play\", attacks the knight at h5, which is also a good attacking square (later) for the white Q",
        "11... Ng3": "11.....Ng3 looks good at first glance. Yet, it loses the game for black. I think the GK computer's verdict of \"inaccuracy\" is a considerable underestimate. This is where the vulnerable f7 square takes effect. 12. Bxf7, Kxf7 forces the black king to the f column so that 13. Qxf3 cannot be countered by fxQ ",
        "12. Bxf7+ Kf8": "Black avoids taking the bishop with the king. As paradoxical as it may sound, I think 12......Kf8 is the second significant mistake by black, which ascertains defeat. Strangely enough, the GK computer has no objection against this move. After 12....Kf7 13. Qxg3; Qg8 14. Nd5 black's position is indeed bad, but in my opinion a lot better than after 12....Kf8.",
        "13. Bxf4": "White can now break the protective pawn structure even by a sacrifice. 13....gxf4 had resulted in 14. Bd5 or Qxf4 with a very strong attack by white",
        "13... Nf5": "This retreat does not make things better. The best was to take the rook at f1",
        "14. Be3 Kxf7 15. exf5 Bf6 16. Rae1": "16. Rae1 is possibly not the best move. The GK computer calls it a mistake. My intention was to maximise the artillery by taking the inactive rook into governing the e file. The more offensive 16. Ng4 was probably better",
        "16... Nc6": "16....Bc6 was probably better, as pointed out by the GK computer",
        "17. Ng4": "....better later than never",
        "17... Kg7 18. Nd5 Rf8": "The computer calls Rf8 a blunder and it is indeed difficult to see its purpose ",
        "19. Ndxf6": "This is called a mistake, too. The idea was of simplification. Perhaps hxg5 was better",
        "19... Rxf6 20. Qg3 Qh8": "Again a blunder (KG computer), but the game is lost for black",
        "21. Nxf6 Kxf6 22. hxg5+": "Now white's strong pawns make their presence known",
        "22... Kf7 23. g6+ Kf6 24. d5": "Qh4+ may have speeded up the end",
        "24... Ne5 25. Qh4+": "Black resigned in view of a checkmate sequence continued by Qe7+ followed by advancement of the pawns.\n\nA nice fighting game that emphasises the delicate balance of strengths between white and black in the KGA opening. Black played the opening extremely well but underestimated the threat at f7 in a bold try to counter-attack. The balance is such that even a single small error tips the advantage to one side or the other. In my view, this is the charm of the KGA - never dull!"
    },
    "url": "https://gameknot.com/annotation.pl/jstevens1s-mini-tournament-vii?gm=48121",
    "gameName": "jstevens1's mini-tournament VII",
    "players": "stalhandske (2077) vs. jstevens1 (1958)",
    "opening": "KGA (C34), Fischer defence"
}