{
    "moves": {
        "1. Nf3": "Tal kicks things off with the Reti opening\n",
        "1... Nf6 2. c4 e6 3. Nc3 d5 4. d4": "...with a transposition into a kind of Queen's gambit\n",
        "4... c6": "Keller over-protects the d5 pawn. Nc6 is also playable, and personally I would have chosen it\n",
        "5. Bg5": "A pin on the f6 knight...\n",
        "5... dxc4": "and now Keller accepts the gambit pawn - but it seems risky when played against Tal! :P Accepting the gambit pawn in the Queen's Gambit will most often lead to White getting a significant spatial advantage over Black, and White gets more opportunities for an attack. Add Tal's sacrificial nature to that and Black has reason to be afraid. Very, very afraid...\n",
        "6. e4": "The natural follow-up - Tal grabs the lion's share of the centre while discovering an attack on the c4 pawn.\n",
        "6... b5": "?! From what I've heard, trying to hold on to the gambitted pawn is generally considered inferior in Queen's Gambit Accepted lines, so it's interesting to see a strong player like Keller try it... but then again, those b and c pawns do have their say later on\n",
        "7. a4": "Pressurising the b5 pawn, but Keller need not worry about that due to his fourth move. Tal threatens to get back his pawn...\n",
        "7... Qb6": "?! but I don't believe that this is the best way to prevent that - instead, 7...Bb4 ought to have been looked at. With this move, the queen leaves the protection of the f6 knight...\n",
        "8. Bxf6": "allowing Tal to double up pawns kingside!\n",
        "8... gxf6": "Well, it doesn't look like Keller can castle kingside or queenside because of his pawn structure... which will, in turn, make his king more of a target. Given who he's playing against, Keller needs to tread very lightly at this point...\n",
        "9. Be2": "Tal doesn't see any attack at the moment, so he calmly develops and prepares castling\n",
        "9... a6": "?! Yet another strange move to me... why would b5 need any move protection than what it has?\n",
        "10. O-O Bb7": "Both Tal and Keller play natural developing moves\n",
        "11. d5": "!? Tal wants to open up the game, or at least the d-file, with this move. However...\n",
        "11... cxd5 12. exd5 b4": "...Keller has this resource. By driving the knight away from the protection of the d5 square, Keller can now win an additional pawn. In addition, he will be able to create a formidable queenside pawn structure after exd5 [though perhaps Bxd5 might be preferred to prevent the opening of the e-file... reader comments are welcome :)] \n",
        "13. a5": "zwischenzug first, however - Tal attacks Keller's queen\n",
        "13... Qc7": "and now Tal moves the knight away...\n",
        "14. dxe6": "Nope - you all knew this was coming! :) Tal is more interested in the initiative than he is material, so he hangs his own knight out to dry in order to gain a successful attack on Keller's king. \n",
        "14... bxc3": "Keller accepts the sacrifice - but how will Tal follow up? He has no pieces beyond the third rank, and Keller has plenty of pieces around his king for defence\n",
        "15. Nd4": "! The pawn on e6 is the focal point right now, and this move indirectly prevents the e6 pawn from being captured. If 15...fxe6? 16.Bh5+ Ke7 [else Nb5+ wins] 17.Nxe6! [...Kxe6 18.Re1+ Kf5 19.Qg4#, so Black will have to interpose with the queen] with 18.Re1 coming up, and there's crazy pressure on the Black position. There are other variants [17.Nf5+ or 17.Re1] but I can't see any success with these two lines \n",
        "15... Rg8": "Ignoring the e6 pawn, Keller creates a mating threat of his own - Qxg2#\n",
        "16. Qa4+": "! However, this allows this intermediate check from White, and the king is forced to move - interposing with a piece won't work; 16...Bc6?? 17.exf7+! Kxf7 18.Qxc4+ and Tal wins the rook on g8, as Kg7?? is met by the simple fork Ne6+! \n",
        "16... Kd8": "The reason for not taking the e6 pawn should be more obvious now at this point [Nxe6+]\n",
        "17. g3": "The only way that Tal can prevent checkmate, and Keller is allowed a tempo to so something about the pressure on his position\n",
        "17... Bd5": "! Both a defensive and offensive move; defensive in that the bishop blocks the open diagonal, which Tal's rooks will be itching to exploit, and offensive in that it attacks the e6 pawn\n",
        "18. Rfd1": "! A natural move in Tal's position, fortunately, preserves the e6 pawn once again - should the bishop ever capture it, then the double check that results from the knight recapture still loses the queen\n",
        "18... Kc8": "Keller is quick to get his king off the open file as soon as possible... but how about cxb2? The end result is similar to what transpires in the game - 18...cxb2 19.Rab1 Kc8 20.Rxb2 - but Keller keeps the extra pawn... but would the threat of doubling up on the b-file not be worth it? Perhaps Keller thought about that possibility, or perhaps he was much more concerned about his king... but this was what made Tal's play so formidable. Quite a few of his sacrifices were, in fact, unsound, but for his opponent, it would become extremely hard to find the correct refutation, especially under tournament conditions. \n",
        "19. bxc3": "As it was, Tal opens the b-file under his own terms by capturing the c3 pawn\n",
        "19... Bc5": "Was the e6 pawn still poison? Keller has big enough back rank concerns to make it so; 19...fxe6 20.Nxe6! Bxe6 21.Bf3!! and the huge threat of Qe8+ [with mate coming soon] means that Keller has to drop the rook. Material is equalised, but Tal's space advantage would be the deciding factor. As far as development is concerned however, Keller is catching up fast, and the e6 pawn is once again on death row!\n",
        "20. e7": "The fact that this pawn has survived for this long is remarkable, and the reason why it can't be taken now is... well, I don't know. I can't even find the move after the capturing of the pawn; the game continuation [Bg4+] doesn't work, because from what I can see, it can be safely taken. I can't see how Tal can get an advantage out of the pawn capture - and that's just for the bishop capture! It's all over my head!\n",
        "20... Nc6": "Either Keller missed the best move here [taking the pawn] or Tal had a threat that he was extremely concerned about [it must have something to do with the long light-squared diagonal, judging from this move, or he was simply looking to trade down]\n",
        "21. Bg4+": "! While this leaves the bishop en prise, it cannot be taken - take the bishop and put up with a promoted queen? No thanks!\n",
        "21... Kb7": "Although the king is forced to move right onto the open file, he has sufficient protection to be okay for the moment - he has the a7 square to hide, and there doesn't seem to be any breakthrough possible. Furthermore, the g4 bishop is still hanging, and these are two factors that can help Keller wrest the initiative from Tal, and if he can do that then his material advantage should be sufficient for the win. That is assuming that Tal played Rab1+...\n",
        "22. Nb5": "!!? But what about this move? It's incredible - Tal's bishop is already hanging, and now Tal nonchalantly throws in his knight as well, while at the same time opening up an attack on the queen and bishop. Taking the knight in this position gives back the pawn - 22...axb5 23.Qxb5+, and Tal captures a bishop next move - he has free choice between the bishop on c5 and d5.\n",
        "22... Qe5": "This is the only move that can preserve both pieces.\n",
        "23. Rde1": "Tal continues the queen chase...\n",
        "23... Be4": "! ...so Keller interposes with the bishop. This is a strong move that doesn't give Tal the chance to save both of his pieces, as the queen now protects the c5 bishop and of course the rook is still attacking the g4 bishop. When down in material, having to drop another piece isn't good...\n",
        "24. Rab1": "...if you don't have a quick attack on the enemy king - Tal is not willing to give up just yet! Once again the knight is immune, this time because the king gets mated very quickly [24...axb5?? 25.Qxb5+ Kc7 26.Qb7+ Kd6 27.Qd7#]\n",
        "24... Rxg4": "Naturally, Keller goes after the other unprotected piece instead\n",
        "25. Rxe4": "Huh?!?! Tal doesn't seem to know the meaning of 'material' in chess, does he? Actually, Tal has just destroyed the one defender of the c6 knight, and will have plans to be regaining the material that he has just sacrificed...\n",
        "25... Qxe4": "?? The wrong recapture for Keller! The alternate capture with the rook leads to this crazy line; 25...Rxe4! 26. Nd4+ Nb4 27. Qd7+! Qc7 28. Rxb4+! Bxb4 29. Qd5+! Kb8 30. Qxe4 Bxe7 31. Nc6+ Kb7 32. Nxe7+ Ka7 33. Nc6+ Kb7 34. Nb4+ Kb8 35. Qxh7 [this is not my analysis, by the way - another user on chessgames.com, where I found this game, had displayed this line.] From this line, I cannot tell who has chances of winning - perhaps it's a draw? With the move played in-game, Keller thinks that this move, which attacks b1 and defends c6, is strong... [the fen notation of the final position in the analysis above can be found in the comments]   \n",
        "26. Nd6+": "! This double-check is even stronger! Tal wins the queen on e4\n",
        "26... Kc7 27. Nxe4 Rxe4 28. Qd1": "The queen is no longer of any use queenside, so Tal brings her back to the centre of the board\n",
        "28... Re5": "?? Why not Rxe7? Tal can win the pawn back easily and as it turns out, even more; 29...Rxe7 30.Qd5 and the only two bishop moves also win the a6 pawn; a) 29...Ba3 30.Rb6! Re6 [30...Re6 is the only move to save material; this makes 29...Bd6 playable] 32.Qxc4, with Rxa6 next move. b) 29...Bb7 30.Qxc4, with a king move next move [to prevent Bxf2+] and Qxa6 next move - Bb8 is met once again with Rb6. The problem is, however, that the pawn is worth a lot more than one point, as Tal now demonstrates...\n",
        "29. Rb7+": "!! This final sac brings Tal into a totally winning position. The next couple of moves are forced for Keller\n",
        "29... Kxb7 30. Qd7+ Kb8 31. e8=Q+ Rxe8 32. Qxe8+ Kb7 33. Qd7+ Kb8 34. Qxc6": "Keller resigns; after the bishop moves, Tal can capture the pawn on c4, and will soon be able to capture another pawn queenside thanks to the mobility of his queen. It is these types of games that made Tal so famous; with a total disregard for material, he would constantly be on the attack, and his opponents found it extremely difficult to counter all of his threats - great stuff! Thanks for reading!\n"
    },
    "url": "https://gameknot.com/annotation.pl/juat-another-ordinary-tal-game?gm=33813",
    "gameName": "Juat another 'ordinary' Tal game...",
    "players": "Mikhail Tal (?) vs. Dieter Keller (?)",
    "opening": "Reti opening (A05)"
}