{
    "moves": {
        "1. e4": "Esta partida me llegó por mail. Es una experiencia interesante poder comentar partidas. En parte, la búsqueda de la verdad en el tablero, pero, por otro lado, la comprensión de las diversas jugadas efectuadas por los ajedrecistas. ",
        "1... e5 2. Nf3 d6": "La defensa Philidor, aparenta tranquilidad, pero su estructura de peones la transforma muchas veces en una dinámica India de rey, una de las más activas defensas.",
        "3. h3": "En general, una pérdida de tiempo. Más clásico parece 3 d4 y 3 Ac4.",
        "3... c5": "Esto no ayuda mucho. Las negras podían aprovechar el desliz de las blancas jugando 3.., Cf6 y enrocando con prontitud. Ahora, en cambio, se devuelve el favor, las casillas blancas quedarán tocadas, en especial \"d5\"",
        "4. Bc4 h6": "Otra vez...",
        "5. Nc3 Nf6 6. d3 a6 7. a3": "Dándole un aire al alfil en caso de ser expulsado de su bastión en \"c4\"",
        "7... Bd7 8. Be3 Bc6": "Las negras confían en que lo cerrada de la posición les brinda tranquilidad... ",
        "9. b4": "¡ajá! ahí está, ahora las blancas buscan juego en el flanco de dama",
        "9... b5 10. Ba2": "En b3 parece más preciso",
        "10... cxb4 11. axb4 Nbd7 12. Bb3 Be7": "Las aguas se han calmado un poco y las blancas siguen con su diagonal a2-g8, así como también el peón de \"a6\", la casilla \"a5\" y, en un tono un tanto menor, la \"d5\" las negras quisieran apostar por la columna C; mientras, las posibilidades de atacar por el flanco de rey parecen escasas",
        "13. O-O O-O 14. Nh4": "buscando las casillas blancas. El alfil a toda máquina!",
        "14... Nh7 15. Ng6": "Aquí se aprecia una de las consecuencias de \"h6\"",
        "15... Re8 16. Qf3": "Las blancas presionan sobre \"f7\" y le echan un ojo a d5, la retirada del caballo negro a \"h7\" solo empeora las cosas",
        "16... Ndf6 17. Nh4": "Reagrupando",
        "17... Nf8 18. Qg3 Nh5 19. Qf3 Nf4 20. Nf5 Nf8e6": "Las negras recuperan terreno",
        "21. Nd5 Bf6 22. Qg4 Kh7 23. Bb6 h5": "Grave error, aunque doliera se debia permitir doblar los peones en f6. ",
        "24. Qf3": "Axd8, es más simple. La doble amenaza de Axf6 o si Axd5, exd5 tocando al caballo de \"e6\" se lleva una pieza o calidad",
        "24... Qb8 25. Be3 Be7 26. Ndxe7": "apuros de tiempo en posición perdida",
        "26... g6 27. Nxc6 Qc7 28. Bd5 Nxd5 29. exd5 Nf4 30. Nh4 Nxd5 31. Na5 Nxb4 32. c3 Nxd3 33. Bg5 Nc5 34. Bf6 Qd7 35. Rad1 Qe6 36. Nb7 Nxb7 37. Bg5 Rab8 38. Be3 Rec8 39. Ba7": ""
    },
    "url": "https://gameknot.com/annotation.pl/jugada-en-internet-20-minutos?gm=29909",
    "gameName": "Jugada en Internet, 20 minutos",
    "players": "Ferreira, Patricio  vs. desconocido ",
    "opening": "Philidor's defence (C41)"
}