{
    "moves": {
        "1. e4 d5 2. exd5 Nf6 3. Nf3 e6 4. dxe6 Bxe6 5. d3": "I can't say this is a mistake, but certainly it opens a bunch of possibile continuations for black that otherwise are just impossible. The first one that comes to mind is c5. But one of the things white has to be aware is white's Bf4, which is annoying (since I normally plan to castle queenside). So...",
        "5... Bd6": "I'll be on time to play c5 later on. And I'm giving up the queenside castling plan if this is played. ",
        "6. Be2 c5": "No danger on the Qside whites squares for now, and I'm ready to castle kingside, so... let's go. ",
        "7. Nc3 Nc6": "Being the dsb my strongest piece, I don't want it to be exchanged or dislodged on e7 by Nb5. But if he plays it now, I plan Bb8. ",
        "8. O-O a6": "Stopping Nb5.",
        "9. Ng5": "You get something, you lose something. Now I'll dare him to play Nxf7.",
        "9... Bf5 10. Nge4": "...which he doesn't take. He is threatening again my dsb, but it can find a good square on d4, so...",
        "10... Be5": "Maybe Bb8 was better, with the idea of an inmediate Qc7. But it seemed to me too early.",
        "11. Nxc5": "So my c5 pawn is gone, but this gives me another useful tempo...",
        "11... Qc7": "...and now my carabine is armed, and I can castle either sides if I need to. Castling is good... unless there is something better to play. ",
        "12. g3 h5": "No kingside castling! Attack! :-) I expected Re1 at any moment, and THEN I'll castle. Queenside, of course... he doesn't seem ready for attack my Qside before I get to his Kside!",
        "13. h4": "Yummy move (for me!). I didn't even think: ",
        "13... Bxg3 14. Nc5e4": "! He was right in not taking it, but this allows me...",
        "14... Bxh4": "No mate, but his K is wide open. Of course, Bh2+, Kh1 was just a loss of time and the chance for him to play Rg1, somehow adding defenders to his Kside, threatening g7...",
        "15. Bf3 Ng4": "Going wild... and hoping for him to exchange (he kind has to, or Qh2#).",
        "16. Bxg4 hxg4": "Not Bxg4, f3, which was useless (well... if f3, Qb6+, but to open the h file for my rook seemed to me much more valuable...)",
        "17. Ne2": "Now, unfortunately, my dsb is on the way, and I have not Bg5: he will simply play Ng3, stopping my mate threat. Now I sense it was, nevertheless, my best move. If Ne4-g3, f6 and I avoid white's following move....",
        "17... O-O-O": "This can't be bad: I threat now Ne4, and I'm bringing the other R into the action. But it allows him (my fault, how didn't I see it?)",
        "18. Bf4 Qe7": "Controlling the N's jumps, and thinking about a possible Qh4 (was it sound at some point the sac Bxf2? Probably yes!)",
        "19. Ne4g3 Ne5": "Threatening Nf3+, and if he exchanges BxN, my Q would be again on the dangerous diagonal.  Of course, I am saccing my lsb, but you know... there is no win with no pain :-D",
        "20. Nxf5 Nf3+ 21. Kg2 Qf6": "...getting ready to play g5, and go on with my pressure.",
        "22. Nfg3 g5 23. Ne4 Qc6": "Now, my Q is on another nice diagonal: if he dares to take my g5 pawn, I'll discover a check AND the h column. ",
        "24. Bg3": "...and after this, it seemed just too nice to play...",
        "24... f5": "I'm sure I'll recover my piece. But I just loved those pawns... and forgot to look at the clock!",
        "25. Ne2c3": "Now, it was easy to play fxN,but after Nxe4 I have no inmediate way to remove this N from the white diagonal (Rhe8 was always a threat, but it seemed to me too weak), so...",
        "25... f4": "Come on! Pushing those pawns must be the way to go. I force the B's exchange....",
        "26. Bxh4": "...but now: how to retake? It took too much time, and I lost for time!!!!! Now I wonder: was I winning? How to retake the B? NxB+ was strong: If Kg1 (not wanting to get on the h column now open), Nf3+, Kg2 (now forced, or QxN and I'm up in material), Rh2#! Now I see it, it was SOOO simple!!! A pity. RxB allowed Rh1 (but Rd-h8, or even Qh6 would win), and gxB was alsowinning, threatening h3+, Kh1, and then I don't know, really, but it looks winning. I'll show the simple...",
        "26... Nxh4+": "If Kh2 or Kh1 is the same story: after Nf3+, Rh2# is coming.",
        "27. Kg1 Nf3+ 28. Qxf3": "Only move to prolongue the agony.",
        "28... gxf3": "...and nothing (I see) can stop Qh6 and mate. Thank you for reading.",
        "29. Rfd1 Qh6 30. Kf1 Qh1#": ""
    },
    "url": "https://gameknot.com/annotation.pl/just-too-many-wins-make-a-loss?gm=64277",
    "gameName": "Just too many wins make a loss!",
    "players": "Jason92689 (1568) vs. damafi (1566)",
    "opening": "Scandinavian defence (B01)"
}