{
    "moves": {
        "1. d4 c6 2. Bf4 b5": "Ok, this is already very strange. ",
        "3. e4": "Just waiting for Qa5+, c3, b4, Qc2, etc., being a \"naive\" attack I can handle. ",
        "3... e6": "No pieces out for black at this point, and leaving the black squares so unprotected, is weird, but I cannot say I see how to take advantage from the weakness so promptly.  ",
        "4. Nf3 h6": "Wonderful, black underestimates the dangers of retarded piece developement. ",
        "5. g4": "I still don't see the way to break in, so I played the nomal London attack (my way), assuring a square in g3 for the bishop, in case of g5, thinking in h4 etc., with nice tactics involved. ",
        "5... g5 6. Bg3 h5": "Black makes a threat of his position. I was careless, and it took me a little by surprise. ",
        "7. h4": "The knight has to wait for hxg4 before jumping at e5. And I was \"punctured in my pride\" (as we say in Italian ;-) and I had to demostrate that all was part of my plan. :-)",
        "7... hxg4 8. Ne5": "Black can save the pawn with f5, but I still think I'll have the better hand of it. but of course the h pawn \"question\" still needs an answer...",
        "8... Nf6": "Black considers gxh4 ineffective, probably due to Qxg4 (which I intended to play, indeed). And this threatens e4, while prevents the queen to take g4. Not bad at all. ",
        "9. Nd2": "I play this knight here, to avoid pins if Bb4. Black can even think in an attack based on Bb4, c3, Ba4, followed by b4. ",
        "9... d6": "Normal. The knight will fly to g4 anyway, but then black will have e5.",
        "10. Nxg4 e5 11. dxe5": "Being a bit more developed should count something, so I open the game. ",
        "11... Bxg4": "Now it had become very tactic all of a sudden. ",
        "12. f3": "Ok, now white should be able to take back the lost piece, but I had the poor guy making through a frightening variety of lines, very difficult to analyze on a blitz game. What would have been your choice? Black has to take material back (at least a pawn, but which and how?), he has to decide if he likes or not the queen's exchange...",
        "12... Be6": "...calculating that a queen in f6 couldn't be bad, pressing on the white's messy kingside pawns. ",
        "13. exf6": "No more play: I have to take back it, no trick on sight. ",
        "13... Qxf6": "b2 is threatened. But both black and I overlooked the stunning 14. hxg5!, but be aware: Qxg5, 15. RxR, Qxg3+, 16. Ke2... it seems safe for white.  ",
        "14. h5": "I didn't see it, but still I considered safe to avoid more complications, and solve once for all the h4 question. I decided I wouldn't care for qxb2. It just will distract the black queen from the action, and I would have started with Nb3, threatening Bxd6. ",
        "14... g4": "Logic. The natural answer was f4, but I dared...",
        "15. fxg4 Qg5 16. Bh3": "This was a mistake, but I thought that I would better have not trapped my queen. I didn't consider...",
        "16... Qe3+": "AAAAAggghhhhhh!!!!",
        "17. Kf1 Qxg3 18. Qe2": "Well, what can I do? A piece is a piece! Let's go on! I have a superior ELO, I should manage to survive. This is sometimes what I like of (unrated!) blitzs: you can have fun. ",
        "18... Qf4+ 19. Kg2": "Open as it is, my king is assuming a confortable position. Black should try to penetrate through the black squares, now undefended, but... will he be on time? Will he be able to handle this advantage?",
        "19... d5": "Be7, looking at Bh4, looks tempting, but this is strong, too: if exd, Bxd+. ",
        "20. Raf1": "Forces on the battlefield. Even the h1 rook should be there, just in case h5 becomes vulnerable and the bishop can move. ",
        "20... Qg5": "Black should have retired elsewhere, because this just gives me a tempo. ",
        "21. Nf3": "A very precious tempo for mobilizing my pieces. Note that black has still his partially undeveloped. ",
        "21... Qg7 22. exd5": "Now it is in my interest to open the game. I don't care about Qxb2, of course. If black takes cxd5, Qxb5+ starts a powerful attack. ",
        "22... Qf6": "Black is resigned, and plans to retake with the queen, covering and slowing down the game. This is what I thought. ",
        "23. dxe6 fxe6": "But no. Black still wants to play, an keeps the queen alive. After all, is his only developed piece. ",
        "24. g5": "In a kamikaze fashion, I decided to play with the pieces in front of the king. But this threatens e6...",
        "24... Rg8": "Black pins the pawn to avoid gxQ, but this is just a mistake. ",
        "25. Bxe6": "Black has a defence: Qe7. My bishop is pinned because my queen is unprotected. But after Re1, \"she\" is. And my pawns should do their job and win. ",
        "25... Rxg5+": "Black tries a last tactcial shot. Very fun a game!",
        "26. Nxg5 Qxg5+ 27. Bg4+": "It is fun and rare to find this kind of \"two checks in a row\" sequences. ",
        "27... Be7": "Symmetric... but for some little detail...",
        "28. Rfe1": "I have more forces to bring in. Probably Rf5 would have been better. ",
        "28... Qd5+ 29. Bf3": "I stil have to defend my king, but look, black can't do anything with the black squares, despite the bishop. Black is playing only with the queen!",
        "29... Qg5+ 30. Kf2": "I will shield my king, and then you'll see...",
        "30... Nd7": "If Qc5+,Kf1 and the checks are over. ",
        "31. Rhg1 Qh4+ 32. Kf1 Qh3+ 33. Qg2": "I decided to stop it. ",
        "33... Qf5": "Black doesn't want to, but I have another tactic.",
        "34. Qg8+ Nf8": "Well, and now, since my bishop is pinned and undefended...",
        "35. Rg3": "This leaves the black queen free way to Qxc2. ",
        "35... Kd7": "Black unpins the knight and defend the Nf8, that now becomes pinned... all this is rather funny! ",
        "36. Qg7": "I move the pin againt the bishop again...",
        "36... Re8": "I knew He could defend, but still I didn' find a better way to attack. In this game, who has the advantage seems not to be the one who wins. But look: unpinning the king, I am threatening very actively something... and I swear that there's a good chance that you don't see it at the first glance. ",
        "37. Kg2": "I unpin my king... don't tell me... my Re1 is undefended, and so is c2, already in sight from before.",
        "37... Qxc2+": "At last. No problem, since...",
        "38. Re2": "and now the queen must retire. But my opponent was worried about a lot of things with this position, and just decided to return the queen where it was before, exchanging a tempo for a pawn. ",
        "38... Qf5 39. Bg4": "Overlooking this, that was my original threat. ",
        "39... Qxg4": "Still, it goes on. ",
        "40. Rxg4": "Or Qxg4+. ",
        "40... Kc7 41. Rxe7+ Rxe7 42. Qxe7+ Kb6 43. b4": "Now, you can't be so vulgar as to go for QxNf8. I tried to be a little more elegant. ",
        "43... Nd7 44. Rg7": "Qb7 is mate. ",
        "44... c5": "Black finds the only one. ",
        "45. Rg6+": "So this must be the way. ",
        "45... Kc7 46. Qd6+": "Ok, now it's over. ",
        "46... Kd8 47. Rg8#": "Thak you for reading. I hope you had a fun time. "
    },
    "url": "https://gameknot.com/annotation.pl/just-for-fun?gm=49555",
    "gameName": "Just for fun",
    "players": "damalfi  vs. 1200 player ",
    "opening": "Queen's pawn (A40)"
}