{
    "moves": {
        "1. d4": "So he starts with what I usually play. ",
        "1... Nf6": "I reply with a Grunfeld Defence. I have already annotated a game with this line http://gameknot.com/annotation.pl/colwyn-bay-2-v-malpas-whitchurch?gm=54435",
        "2. c4 g6 3. Nc3 d5 4. cxd5 Nxd5 5. e4 Nxc3 6. bxc3 Bg7 7. Bc4 O-O 8. Ne2 c5 9. Be3 Nc6 10. O-O Bg4 11. f3 Na5 12. Bxf7+ Rxf7 13. fxg4 Rxf1+ 14. Kxf1": "All this has been seen many times before. It was the old \"main line\" of the Grünfeld Defence, Exchange Variation. Please see http://en.wikipedia.org/wiki/Gr%C3%BCnfeld_Defence#Exchange_Variation:_4.cxd5_Nxd5_5.e4 From about 1960 to about 1980 it wasn't played much, it being replaced by Smyslov's idea of 10....Qc7 followed by 11. Rc1 Rd8, but this was rather put out of business by 12. Bf4! so players went back to this older system. To quote from Wiki \"this was frequently played by Karpov, including four games of his 1987 world championship match against Kasparov in Seville, Spain, is the Seville Variation, after 6...Bg7 7.Bc4 c5 8.Ne2 Nc6 9.Be3 0-0 10.0-0 Bg4 11.f3 Na5 12.Bxf7+, long thought a poor move by theory, as the resultant light-square weakness had been believed to give Black more than enough compensation for the pawn.",
        "14... Qd7": "In the aforementioned game white took on f1 with the queen, rather than the king, but it doesn't make much difference. His c4 square is now very weak, but I can't play Nc4 immediately as he has Qb3 pinning my knight against my king.",
        "15. h3": "White protects the g4 pawn.",
        "15... Qe6": "Black hits the e pawn",
        "16. Qd3": "White protects.",
        "16... Qc4": "I offer the exchange of queens. It is unusual for the side a pawn down to offer a queen exchange. However the ending is not that bad for black. White's extra pawn is doubled and on the king-side, where the king's are, and it is very difficult for white to exploit this extra pawn.",
        "17. Qd1": "This looks like a mistake to me. In previous games, white had exchanged queens on c5. Black's knight has a tremendous square on c5, but white has the extra pawn. Chances are even. I considered retreating the queen to e6 now. I wondered if he would advance his queen again to d3 and we could just keep repeating the position and agree a draw. However I was very much aware that on board 3 and 4 we were heavily out-graded and stood very little chance. I would have to win if my team were to get anything out of this match, so I played....",
        "17... Rd8": "This, building up pressure on the d pawn and pinning the d pawn to the queen.",
        "18. Kg1": "He calmly moves his king to a safer square and unpinning his knight at the same time.",
        "18... e5": "I build up again against d4. Note how the d4 pawn is doubly pinned. It can't take on e5 or c5 as it is pinned by the rook against the white queen, and it can't advance without losing his e4 pawn. The d4 pawn is now attacked by five pieces (2 pawns, a bishop, rook and a queen) and protected four times - so I am threatening to take it.",
        "19. Rc1": "This move saves the d pawn, as if I take on d4, he takes back with the c pawn, discovering an attack on my queen with his rook. This is the key position. I looked at Qxa2 20. Ra1 Qb3 21. Qxb3+ Nxb3 22. Ra3 and at the time I thought I was losing the knight on b3. However I see now that in that position I can save it with c5-c4, or I can take on d4, which threatens his bishop on e3. This is clearly what I should have played, or maybe take on d4 first with my c pawn. Either way I think black would have had an advantage. However I tried another way, which just loses for me, although it looks very plausible! ",
        "19... exd4": "I take this way, to open up my diagonal for my bishop more.",
        "20. cxd4": "He takes back, uncovering at attack on my queen. I can still take on a7, but now he can take back on c5 with his rook, reducing the pressure on d4. I think the position is pretty even then, but, as I was saying, I was playing for a win, but this led to a loss.",
        "20... Qb4": "So I played this. I thought this position was good for me. I still have the two-way pin on the d pawn. Of course, I saw that his bishop can drop back and hit my queen, but what of it? I can take on d4 with my bishop. He can't then recapture with his knight, as then I take back with the queen, give check and follow up with QxBd2 and I am a piece up. Of course he doesn't have to capture on d4, he could simply move his king, but then I move my queen, and if he takes my knight, I recapture with my queen. No problem there? Or is there?",
        "21. Bd2": "So he hits my queen.",
        "21... Bxd4+": "I take the pawn.",
        "22. Kh1": "This king moves to safety.",
        "22... Qb5": "My queen retreats.",
        "23. Bxa5": "He takes.",
        "23... Qxa5": "I take back.",
        "24. Qb3+": "Ouch! That was the move I missed when I was considering my 19th move. How could I miss it, when I noticed it when considering my 14th move? I put it down to two things. One \"is playing for win\". The other is \"dizziness due to success\" 0- I was getting so carried away with how I had pressure on his position and was getting my pawn back, that I didn't notice this. I don't have much choice now, as advancing the king loses the b7 pawn with check, and moving to f8 allows his rook to come over to f1 with a killing check. I think black is lost now. ",
        "24... Kh8": "As I said, this is the only square left.",
        "25. Nxd4": "He takes here. I make another mistake here. Taking back with the rook is pretty dreadful. After Rxd4 26.\tQxb7\tQxa2 27. Rxc5 he is threatening  Rc8 he is threatening both 28. Rc8+ forcing Qg8 and black's queen goes, and if Qg8 28. Rc8 Rd8 29.\tRc7 with the dreadful threat of Qb2+, but black may be able to hold on for a bit longer. As played, the c file is opened for white rook to come into the position immediately and black is lost.",
        "25... cxd4": "So I took this way. While studying this position, I thought at first 26. Qxb7 could be met with Qb6, but then I saw that he just plays Qf7 followed by Rc7 and it is all over. Come to think of it, can't he play 26. Qf7 immediately? It looks all over for me. With some relief to me, he didn't play that and played.",
        "26. Qxb7": "This. I tried the one move I thought may hold on a while.",
        "26... Qxa2": "This briefly restores the material balance.",
        "27. Rc7": "With a threat to h7.",
        "27... Qg8": "Queen comes back to protect. I offer a draw. He rejects, not surprisingly.",
        "28. Qxa7": "He is not just a pawn up, his queen and rook have dominating positions.",
        "28... h6": "Played with my next move in mind.",
        "29. e5": "The pawn starts to roll. This move is not necessary. He could already play the winning manoeuvre of Rf7 followed by Qe7.",
        "29... Qf8": "Threatening some checks.",
        "30. Rf7": "Rook hits the queen.",
        "30... Qg8": "The queen is forced back.",
        "31. e6": "Again, not sure why he plays this. Qe7 simply wins.",
        "31... Rd5": "I am not sure why I played this! I think I was just basically running out of moves. My king can't move. My queen can't move without allowing a quick mate. My rook can't move along the back rank without allowing Qxd4+ mating. d4-d3 allows Qa1 mating. Rd6 loses to Qc5.",
        "32. Qe7": "He finally sees it, and I resign. Many thanks for reading this annotation. Please leave your comments and rate it on the star system. Until next time dear reader!"
    },
    "url": "https://gameknot.com/annotation.pl/just-one-slight-mistake?gm=57599",
    "gameName": "Just one slight mistake!",
    "players": "Piotr Swiech (ECF176) vs. Charles Higgie (ECF172)",
    "opening": "Gruenfeld (D87), exchange, Spassky variation"
}