{
    "moves": {
        "1. d4": "So it started pretty conventionally...",
        "1... d5 2. Bf4 Nf6 3. Nf3 Nbd7": "Unusual move. Anyway, I went with my usual...",
        "4. Nbd2 e6": "Here, I felt an itch...",
        "5. e4": "...and tried this one. ",
        "5... dxe4": "Better for black was to take with the N first, so if I wanted to recover the pawn in a Budapestian way (Ng5), he would have had f5. This allows Qh5+, so... you know. Looking for troubles, as always...",
        "6. Ng5": "...not allowing this,",
        "6... Be7 7. Ngxe4": "Maybe not the best, but I couldn't find anything better. I'm not threatening anything, though.",
        "7... O-O 8. g4": "Now I do. My opponent thought for a good while, and played...",
        "8... b6": "! Now it's up to me how to lead the attack without being too much bothered by his lsb. So...",
        "9. Rg1": "Thinking in supporting g5.",
        "9... Bb7 10. Bd3": "Eyeing h7, of course, more than defending the N. ",
        "10... c5": "Interesting. ",
        "11. g5": "I can't lose time!",
        "11... Nxe4 12. Nxe4": "!? Now, c4 seems to win a piece, but Nf6+, and maybe, just maybe, white has some compensation with tricks on the black's K. ",
        "12... cxd4": "My opponent preferred to walk the soft way. Good for me... maybe. ",
        "13. Qh5": "Let's make him move those pawns. I have both B, I will get return for any pawn move. ",
        "13... e5": "I thought that this was the classic \"tactic trainer\" position, and I thought that...",
        "14. Nf6+": "...would have given me the win. ",
        "14... Nxf6 15. gxf6": "...in fact, the only thing is that I recover the piece, but black's central pawns will be a headache. ",
        "15... g6": "Here I lost the chance to make this the game I wanted it to be. Bxg6 was a sure win!!!!!!!!",
        "16. fxe7": "Not now, after the BQ plays on the 7th rank. ",
        "16... Qxe7": "...and now, Qxe5 seems to win, but after the Q's exchange, Re8 would recover the piece. Bxe5, and black can't play f6 or white will sac on g6, probably winning. But it's hard to say without the analysis board! I think that a sac on g6 is still premature, here. But I think that Bxe5 is very dangerous. ",
        "17. Bg5": "I though it was a funny way to propose Q's exchange, and it was. But the outcome won't be good for me, and I just allow black to recover the initiative. ",
        "17... Qe6 18. Bd2": "Bh6 was less interesting, but this overlooks...",
        "18... e4": "...cutting by B's sac on g6 forever. Now, I was in a real problem. There was a way to save me? ",
        "19. Be2": "? Bf1, thinking in Ba3 just after was better. Now, I know that d3 and I lose the B, but to d3 I had in mind...",
        "19... d3 20. Bg4": "...this one, with the same idea for the second time!",
        "20... Qc4": "...but again, my early attack left me very undeveloped, and now I have to lose my Q or accept an ugly xc2 move... or not? I though I found something. ",
        "21. Bc3": "Now, if gxQ, Bxh5#. A real beauty, isn't it? Of course, it doesn't work, because black can play QxB+, and then gxQ. White would have recovered the B after Bc8+ (disc), BxB. A crazy position, isn't it? Now, White threats Qh6, forcing f6 and after it g6 or h7 would fall. Black threats... a lot, but not so quickly... does he? So HE RESIGNED. Now the question: was he lost? Any comment appreciated... :-)"
    },
    "url": "https://gameknot.com/annotation.pl/early-resignation?gm=61404",
    "gameName": "Early resignation?",
    "players": "damafi (1399) vs. Estenio (1412)",
    "opening": "Queen's pawn, Mason variation (D00)"
}