{
    "moves": {
        "1. e4 d6 2. Nf3 Nf6 3. Nc3 g6 4. Bc4 Bg7 5. d3 O-O": " A Pirc defence with d3 rather than d4. Black could have been more ambitious by playing c5 or e5.",
        "6. h3 c6 7. O-O a5": " Setting a cheap trap.",
        "8. a3": "White spots it.",
        "8... b5 9. Ba2 Nbd7 10. Ng5 e6": "Loses a pawn.",
        "11. Bxe6 fxe6 12. Nxe6 Qe7 13. Nxf8 Nxf8": "White has two pawns and a rook for the bishop and knight. Black retakes with the knight - it can now reach the inviting d4 square via e6.",
        "14. Bg5 Ne6 15. Qd2 Bd7": "Black chooses not to swap knight for bishop, and instead continues with development.",
        "16. Rfe1 Nd4": "Black is not worried about the pinned knight on f6.",
        "17. Ne2 Qe5 18. Nxd4 Qxd4": " White decides to swap knights on d4, and can now play c3.",
        "19. c3 Qa7": " The black queen is relegated to a less active square.",
        "20. Qf4 Rf8 21. Qe3": " White decides against snatching the pawn on d6 - black has a potentially nasty discovered attack on f2 when he moves the knight.",
        "21... Qb8": "Black is down material and doesn't want to swap queens.",
        "22. d4": " White's plan is to make the most of his rooks by opening a file.",
        "22... Be6 23. Bh6": " White wants to deprive Black of the bishop pair, so decides to swap dark-square bishops.",
        "23... Nh5 24. Bxg7 Kxg7 25. e5 d5": " Black keeps the centre closed at the cost of cutting off his bishop's queenside activity -  in any case the bishop will be stuck blockading the passed e-pawn.",
        "26. g4 Nf4": " Black's knight obtains an outpost on f4.",
        "27. Kh2 Qd8": " Black's queen is looking a little more lively.",
        "28. Reg1 Qg5": " Qh4 is another possibility.",
        "29. a4 b4 30. cxb4 axb4 31. a5": " White succeeds in creating a passed pawn on the queenside.",
        "31... h5": " Black must get on with his attack.",
        "32. f3 hxg4 33. fxg4 Rh8": " An advantage of the queen on g5 is that the rook is not tied to maintaining the knight outpost. Now the pawn on g4 looks wobbily.",
        "34. Rg3": " Defends the h-pawn.",
        "34... Bxg4": " Much thought was put into this move. Black decides that it is safe to capture on g4.",
        "35. Rag1": " White doubles up on the g-file, putting more pressure on the pinned bishop.",
        "35... Nxh3": " h3 falls, but at the cost of allowing white to exchange queens.",
        "36. Qxg5": " After the queens are off, white will hope to bring home one of the passed pawns.",
        "36... Nf4+": " Oh. White resigns.\n\n Thanks for reading, hope you enjoyed the game!"
    },
    "url": "https://gameknot.com/annotation.pl/edinburgh-league-over-the-board?gm=27806",
    "gameName": "Edinburgh League, Over the board",
    "players": "Ronnie Dunnet  vs. tonylemesmer ",
    "opening": "Pirc defence (B07)"
}