{
    "moves": {
        "1. g3": "Hi all! This was a casual game played here on GK recently. Mistakes are made on both sides, but I'm annotating it to showcase, more than anything else, the importance of playing calmly and accurately, developing pieces to good positions before attempting to orchestrate any sort of attack. Enjoy!",
        "1... b6": "White is playing Benko's opening, a reasonably popular, reserved opening that focuses on quick kingside development. It generally transposes into some form of King's Indian attack (with e4 and d3), Catalan opening (with d4 and c4), or English (with c4 and usually d3). In this case, however, Black chooses to immediately contest White's control of the h1-a8 diagonal. This is an uncommon line, but absolutely playable.",
        "2. Bg2 Nc6": "This is basically forced, though 2...d5 is also possible, if fairly awkward.",
        "3. Nf3": "At all times, but especially obvious in the opening, move efficiency is critical. Every move you make should have a clear purpose. Time wasted in the opening can lead quickly to disaster if your opponent is making purposeful, efficient moves--thus the oft-quoted saying, \"don't move a piece twice in the opening\".",
        "3... e6": "Delaying the development of the Bishop to b7, but this is fine. Black's KB will probably land at e7 to stay out of harm's way while he prepares to castle.",
        "4. O-O": "So far a very reserved game. White's King is safely tucked away already, and nothing has moved into the center ranks yet for either player.",
        "4... g6": "If Black intended to put his Bishop on g7, why play 3...e6? Most of his pieces are free to develop at this point; he should be doing so with 4...Bb7, or 4...Be7, or 4...Nf6, etc. This move is our first example of a simple waste of time--not to mention that it creates a big weakness at f6.",
        "5. d4": "White needs to develop his queenside now; this is the most direct way to do so.",
        "5... d5": "This blocks off the h1-a8 diagonal for White's Bishop; perhaps now Black intends to play his own Bishops to d7 and g7, Ne7 and push c7-c5? That's fine, but it's not as though White is putting on pressure that Black would need such a plan to free himself from. This move doesn't allow any new developmental opportunities for Black, and it doesn't have a clear purpose. Therefore, it is a waste of a move.",
        "6. Bg5": "With Black's kingside pawns all on light squares, White invites a trade of dark-square Bishops to badly weaken the Black defensive position.",
        "6... f6": "I think 6...Nf6 was perfectly playable here.",
        "7. Be3": "This particular retreat serves two purposes: first, it reinforces d4 to allow White to develop Nbd2 in preparation for c4. Second, it also leaves the opportunity open for Qd2, with an eye to penetrating on h6.",
        "7... h5": "Black leaves uncertainty behind and announces his plans to storm the White kingside. But how can he be successful with only one piece off its home square, and his King still sitting in the center of the board?",
        "8. Nbd2 g5": "Again, developing moves like ...Bd6 or ...Ne7 would be better preparation for an attack than just pushing up all the pawns. Even ...Ba6, putting pressure on e2, would be stronger. Now Black's moves have a purpose (attacking the White King), but we must ask--is it even possible for these moves to accomplish that purpose?",
        "9. h4": "This is why the army is not comprised just of pawns. This one move puts an immediate end to Black's kingside assault, as now 9...gxh4 is met by 10.Nxh4 and there's no way for Black to get the Knight out of the way to put either the g- or h-file to any use.",
        "9... g4": "Maintaining the tension would at least have made White have to think about defending his King as the game progressed. The text simply closes off all avenues of attack.",
        "10. Ne1": "Heading for d3, and eventually f4. Of course 10.Nh2 was an option, with intentions of playing 11.f3 and breaking up the Black pawn storm, but why go that route when the Black pawns are doing such an admirable job of shielding the White King from all harm?",
        "10... Nh6": "All right, the first ten moves are done and we're leaving the opening. Let's analyze the situation. White is mostly developed. His pieces are looking a bit awkwardly-placed (mostly that Ne1), but he can actually move around pretty much as he pleases and has lots of queenside potential as well as a good central presence. Black, on the other hand, has just now touched his second piece in ten moves! He has lots of kingside space, but his pieces pose no threats and his King is looking rather exposed behind his advanced wall of pawns. ",
        "11. Nd3 Nf5": "This is a good place for this Knight, though Black is still badly behind in development.",
        "12. Bf4": "??! This is a very speculative sacrifice. The alternative of 12.c3 Nxe3 13.fxe3 was perfectly fine, opening the f-file for White's Rook against the weak f6 pawn. With this move, White invites Black to take the d4 pawn in exchange for allowing White to open the center with initiative, likely continuing with 12...Ncxd4 13.c4 Bb7 14.e4, where Black will struggle to hold off White's attack but with careful play will probably be all right if he can get his King into the relative safety of the queenside fast enough. That all said... it would certainly liven up an otherwise quiet game.",
        "12... Bh6": "Black declines the proffered pawn, instead making a counter-offer of a Bishop trade.",
        "13. c3": "With trades on the table, White chooses to reinforce d4 and allow his Queen a diagonal to develop on rather than move his Bishop yet again.",
        "13... Bxf4 14. Nxf4": "This Knight has been looking at f4 as an outpost ever since Black played ...g4.",
        "14... e5": "Trying to drive the Knight away, but this just drops the d-pawn and weakens the Nf5. Black's advanced pawns have lost any appearance of being threatening; now they just look thin and exposed.",
        "15. Nxd5 Rb8": "Getting off the h1-a8 diagonal that is about to open up, though better would probably have been 15...Bb7 with an eye for ...Qd7 and ...O-O-O.",
        "16. Qc2 a6": "Black continues pushing pawns, even with nothing to gain! This is simply another wasted move.",
        "17. Rad1": "White is now completely prepared to tear open the center with devastating effect.",
        "17... b5": "Counterplay, generally defined, is making threats to offset a weakness elsewhere on the board. With Black's weak kingside, trying to make play on the queenside is reasonable--but we've already seen just how bad pawns are at carrying out an offensive all by themselves while there are still lots of pieces on the board.",
        "18. b4": "White shuts down the queenside push just as easily as he did the kingside. Black has made eleven pawn moves, despite having only one pawn past the center line. White has made five--each White pawn that has moved has only been touched once.",
        "18... Qd6": "Flip the board a couple times and view this position from both sides. Get a feeling for how stringy and precarious Black's position feels in comparison with White's.",
        "19. dxe5": "The center break begins. Still sitting on his home square, the Black King is in serious trouble now. If Black's position didn't feel dangerous before, the next several moves demonstrate exactly how loose it was, as White takes it apart in seconds. Also possible was the immediate 19.Ne4 Qf8 20.Nxf6.",
        "19... Qxe5 20. Ne4": "Every single White piece is participating in the attack. The center is about to break wide open; Black can maintain something close to material equality with 20...Rh6 or 20...Rf8, but White may simply choose not to crush down on f6 until his Rooks both occupy the d-file and his Queen is on b3. There is no adequate defense, and no time to rush to the queenside. Material is still nearly equal, but there is no hope left for Black, with three critical pieces sitting useless on his back rank.",
        "20... Rh7": "? This oversight allows White's victory to come more easily, but it is a technicality. As I said above, Black was already lost.",
        "21. Ndxf6+": "Taking with this Knight prevents the BK from running toward the queenside, thanks to the powerful Rook on d1.",
        "21... Ke7 22. Nxh7 Qg7": "Better was 22...Be6.",
        "23. Neg5 Ne5 24. Rd5": "Preparing to double Rooks on the d-file, as well as hoping to provoke Black into a weakening advance ...c7-c6, as that would make the Nf5 the only defender of the d6 square, where White really wants to plant a Rook or Knight.",
        "24... Be6": "Nothing else is much better. Maybe 24...Nd6.",
        "25. Nxe6 Kxe6 26. Ng5+ Kf6 27. Rfd1 Qe7 28. Be4 Rb6": "28...Nd6 was probably best.",
        "29. Bxf5 c6": "Black's final mistake is, fittingly, a pawn advance. This opens the door for one more tactic.",
        "30. Rd5d6+": "Black has only one move--right into a royal pin.",
        "30... Kg7 31. Rd6d7 Nxd7 32. Rxd7 Qxd7 33. Bxd7": "The rest is history.",
        "33... Rb7 34. Qf5 Rb8 35. Qf7+ Kh8 36. Qh7#": "Not a flawless game by any means, but an effective demonstration, I think, of how frivolous, inefficient moves can cripple a position beyond all hope of recovery, even without concrete individual blunders. Many thanks to q198895 for the game; I hope someone out there finds it interesting or instructive. Comments are much appreciated. Thanks for reading!"
    },
    "url": "https://gameknot.com/annotation.pl/efficiency-deficiency?gm=46858",
    "gameName": "Efficiency Deficiency ",
    "players": "bwaa (1704) vs. q198895 (1279)",
    "opening": "Benko's opening (A00)"
}