{
    "moves": {
        "1. d4 d5 2. c4 e6 3. Nf3 dxc4 4. e4 c5 5. Bxc4 cxd4 6. Nxd4 Nf6 7. Nc3 Bc5 8. Be3 Nbd7 9. Bxe6": "Firework start. Hard to see sacrifice, but if black goes Qe7, 11. Nc7+, Kf7, 12. NxR. True is that black would have an attacking position after Ne5 (trapping the white knight), but probably the master's analysis went much further than mine.",
        "9... fxe6 10. Nxe6 Qa5": "Leontxo says Qb6 could be \"the correct one\", but not why. The attack on b2 doesn't seem very promising. But white should lose a tempo in order to save the e6 knight, and it is  beyond my ability to say what would happen. \n",
        "11. O-O": "The good point of Qb6 is that doesn't give white a tempo to castle.",
        "11... Bxe3": "A questionable move, as it leaves the f column to white. True it allows black to play Nc5, freeing his lsb, but the black king it too exposed!",
        "12. fxe3 Kf7": "...since this king movement is almost forced. White threats Qd6 or Nxg7+, or maybe Nd5.",
        "13. Qb3": "...but it leaves white the canche to add pressure to the black king. ",
        "13... Kg6": "Sad position for a king. Black cannot play the knight to the 5º rank because it blocks the profilacting action of the black queen on this row, facilitating white's plans to trap black's king. ",
        "14. Rf5 Qb6 15. Nf4+ Kh6": "Leontxo says Capablanca could have won with 16. Qf7, never mind if black plays Qxe3+, 17. Kh1, after which indicates g6 as the correct defence for black (white threats g4 - g5# and if Nxg4, Rh5#). 18. Ne6 (threatening mate), Rg8, 19. Nd5, Qxe4, 20. RxNf6, to which black answers with Nf8 - losing. It seems a weird move, but... \n\nBlack cannot take NxRf6 because of 21. NxNf6, threatening the queen and mate in h8, AND the rook... \n...and if black plays QxNd5, white goes 21. QxRg8, NxRf6, 22. Qg7+, Kh5 (forced) and 23. Nf4+, winning the queen!\n... Ne5, and with 21. Qxg8 white wins, even if black goes: Bxe6, 22. Qxe6 (not QxRa8, BxN, with a strong attack).",
        "16. g4": "...threatening at once g5#, since black cannot take the pawn (Nxg4, Rh5#).\n",
        "16... g5": "...the best defence? After Qxe3+ white is in troubles! Black threats perpetual, and to avoid it white must either lose the knight or the pawn (helped by Nxe5 if white wants to shield his king with Nc-e2), and the pressure over the black's king, losing. \nAm I right?",
        "17. Qxb6": "It seems to me that 17. h4 whorths a look. Must black take gxh4, or he can go QxQ?\nIf gxh4, 18. g5+, Kg8, 19. (say) gxNf6+, Nxf6, 20. Rg5+, K(say) f8, 21. Nf-d5 (e3 must be protected, and with this knight white prevents Nxe4), NxN, 22. NxN (with the queen, it allows Qxe3+, but it is unclear if that would save black), QxQ, and white is just a pawn up, but with a winning position, despite the doubled pawns. I think.... White doesn't have a mate (as far as I can see) 23. Rf1+, Ke8, 24. Re5+, K goes to the queenside and there is no mate in sight. \n\nMany other lines are possible after 17. ..., QxQ, since hxg5+ is not mate anymore, so Kg7, and white must play carefully to avoid lines such as 19. gxNf6, Nxf6, threatening the rook and recovering material equality even if white central free pawns must win in the long term. ",
        "17... axb6": "Nxb6 is of course impossible because of RxNf6+. White's attack seems to have lost steam, since the knight must retire. Now, main white's advantage are the central free pawns, but he cannot save the g pawn.\nSo Capablanca tries to complicate threats. ",
        "18. Rd1": "Leontxo says black can win after gxNf4, 19. g5+, Kg7, 20. gxf6+, Nxf6, 21. Rg5+, Kf7 (or Kh6), 22. exf4, defending the rook, realigning the free pawns, with a winning position, even with a pawn less. \nKasparov said 18. ..., Ra5 is even better.",
        "18... Rg8": "Not clear why to me. The idea is, probably, being able to play Rg6 after 19. Rd6, gxNf4, but probably white would go for something like Nf-d5... or maybe, black dreams with an attack over the white king (But Nxg4 was necessary, first...)",
        "19. Nfd5 Nxg4": "Black thinks he reached a sort of shield so proceed to take away one of the strongest threats over his king. Now, it has two squares to go.\nLeontxo says NxN was better, but it is unclear to me how black position would hold after exd5, reassetting the central pawns. Nxd5 or Rxd5 seem good too!",
        "20. Ne7": "This is mainly to free the 6th row to white's rook, preventing Rg6 defence to black.",
        "20... Rg7": "It blocks one of king's save squares...",
        "21. Rd6+": "if 21. ..., Nf6, 22. RxNf6+, NxR, 23. RxNf6+, Kh5, I cannot see a clear victory for white, since 24. Nf5, BxN frees black. \nWhite has nice threats with 24. Ne2, RxNe7, 25. Ng3+, and if Kh4, 26. Rh6+, Kg4, 27. Kg2! and black cannot stop the mate (h3#). \nBut, if black goes 25. ..., Kg4, 26. Kg2. Now, if black goes h5, white can go 27. Rh5, and black cannot escape from mate (Rxh5 / h3, in either order). \nSo, it seems to be the hidden threat that prevents black to stop the check with the knight. ",
        "21... Kh5 22. Rf3 Ngf6": "Black must stop the mate in h3. Now, the previous sequence starting with RxN doesn't give check to black, so leaves him a tempo to defend. ",
        "23. Rh3+ Kg4 24. Rg3+ Kh5 25. Nf5 Rg6": "Leontxo says that now Rh3+, Kg4, Kg2 wins, threatening Kd1-f2# and Rxh7",
        "26. Ne7": "Probably, Capablanca was looking for a repetition in order to reach the time control, later... but his opponent went to another move.\n",
        "26... g4": "Black can give the quality in order to release the pressure (g4, 27. Nxg6, axg6 and black seems to hold, even if in a losing position: white can try 28. Ne2, Nxe5, 29. Nf4+, that eventually leads white to win the pawns with a better position).\nLeontxo says that if Nc5, instead, black could have drawn the game. ",
        "27. Nxg6": "Leontxo says that now, if hxg6, white goes 28. e5, since Nxe5 is not possible due to RxNf6. The same doesn't hold for the previous comment, in which I said that hxg was best. ",
        "27... Kxg6 28. Rxg4+ Kf7": "I cannot see why Kh5 is not preferable. ",
        "29. Rf4 Kg7 30. e5 Ne8 31. Re6 Nc7 32. Re7+": "And black resigned, because (Leontxo says) of the following moves, that were not played. ",
        "32... Kg6 33. e6 Nc5 34. Rxc7 Nxe6 35. Rg4+ Kf5 36. Rcc4": ""
    },
    "url": "https://gameknot.com/annotation.pl/el-jefe-est-cabreado?gm=33501",
    "gameName": "El jefe está cabreado",
    "players": "J. R. Capablanca  vs. Y. Bogoljúbov ",
    "opening": "QGD Slav (D30)"
}