{
    "moves": {
        "1. b4": "On a blitz basis, this opening has some very dangerous lines if black goes after the pawn. ",
        "1... Nf6": "I'm looking about how to shield the black diagonal instead. ",
        "2. Nf3 d5": "Just ignoring b4. It's the best strategy, believe me. ",
        "3. e3 Bf5": "Space for my B. I'm not the kind of player that plays e6, here, self-blocking his own B without a very good reason. ",
        "4. Be2 Nbd7": "I waited enough: now white \"must\" play Bb2, or I'll play e5, contesting his center space. ",
        "5. Nc3 e5": "Just thank you. See how white was not right in delaying his Bb2 move. It is not only logical, it's needed. ",
        "6. a3": "Saving the b4 pawn, but losing another developing tempo. This is the reason white coudn't allow e5 in the first place.",
        "6... c6": "Just weak? Maybe, but white still has b5 for his pieces. I can allow myself to play slower than average. a6-c5 was the natural and good plan, but it was too explored. I'll try something else. ",
        "7. h3": "Still losing time, without an attacking plan. Don't do this at home!",
        "7... Nb6": "I sac the central pawn! Crazy, but it will give me more tempo after Bd6, and since W's lsb is still a move away from b2, maybe I can play this crazy move.",
        "8. Nh4": "White refuses the sac - with a higher rated player offers you a sac... just in case, refuse it. If you can. White could, with this nice move, asking a question to my B. ",
        "8... Bg6": "Ok, let's take it and open my h column. I can cope with that, and even turn it in my favour. Be careful!",
        "9. Bg4": "White plays the tactic way. Now let's see: NxB opens an attack over the WN because of BQ, but any of the possible takes back are just good for white, defending it. I can hope in 9... NxB, 10. QxN, f5!?, 11. Qg3... and black just misses one tempo to make of Bd6 the weapon to recover the N... or not, because white can defend with f4 at some point... too dangerous! And if 10. hxN, I have just nothing. But I am not forced to take it! Its better to have there a B than a Q... I can use my center instead... can you see how?",
        "9... d4": "A center is valuable because an just when it can do things like this! White's N has few places to go to, since I didn't give up my Nf6 for the W's lsb. ",
        "10. Na2": "No, it was not a mistake! If Ne2, I would have played d3!, and after fxd3, Bxd3, with a pressing and dominant position over white. White could have exchanged and played for Qe2+, hoping to unravel himself with some exchanges. Now, how would you proceed?",
        "10... d3": "...of course. This pawn will become a formidable outpost and, if c3 is played, will block forever THREE white's pieces. White shouldn't have allowed this. Better for white is to take, and try Be2, etc, begging black doesn't find something along the way...",
        "11. c3": "The worst? White coudn't allow dxc2, and if 11. NxBg6 instead, ...dxc2 and white can't take it or 12. Qxc2, hxBg6 and NxB is now a threat for white. After white's B retreat, black has plenty of options.",
        "11... Nxg4": "? Nerves. No need to take, so don't take! This is very bad, because of QxN or hxN. ",
        "12. Nxg6": "White goes for the \"other\" way: he isn't afraid o complication, is he?",
        "12... Nxf2": "So let's complicate the game even more! I'll recover my piece back and I won't even scramble my pawns! - White has a tempting response here, very bad, a normal one and a risky one. Can you see them?",
        "13. Kxf2": "White went for the \"normal\" one. The risky was 13. Qh5. black will win the N with xNg6, but white would have had Qxe5+, usually very good. But not in this position! White made the best move, after all. ",
        "13... Qf6+ 14. Qf3": "A game without the Qeens promised very slow. I can choose, so...",
        "14... Qxg6": "I am threatening e4, solidifying forever my pawn chain, then... what? Maybe e4 was a better square for the N...",
        "15. Rf1": "Creating a threat on f7. ",
        "15... f6": "No way. No panic. No pass. ",
        "16. e4": "! White got me! I lost tempo bydefending, and now I get this in return. I still have my piece virtual advance, but... how to use it? While wondering that, I lost sight of a \"little\" problem!",
        "16... Be7": "?? (\"White can do nothing but Bb2, which helps me (Nc4 and white must retreat)...\") Overlooking...",
        "17. Qxd3": "Ok. Can I transform this into some advantage for me? Probably yes.",
        "17... Rd8": "Of course. ",
        "18. Qg3": "? Wanting to exchange Q? No, not now, and not like that!!!",
        "18... Qxe4": "Now, this was kind of desperate. Do you realize what I am leaving him? On the other side, his K is exposed, so what's the problem? ",
        "19. Qe3": "!? Maybe correctly, maybe not, white didn't allow himself for Qxg7. Can you tell if the pawn was posioned or not?",
        "19... Qh4+": "Let's see how far he goes. ",
        "20. Kg1": "Oh, there. Ok. Let me grab the least of an edge, if ever I have it. ",
        "20... Nc4 21. Qxa7": "Ok, his Q is diverted from the king, and d2 will fall. This is not a good strategy, since I free white's pieces, but see how I am unable to get some advantage. So I have to risk more! This is a blitz, not a championship. Will be my intuition good enough?",
        "21... O-O": "Adding another pawn to white's bargain. ",
        "22. Qxb7": "...which he grabs. My B is threatened... will I defend it (and lose a tempo)? Never!!! :-)",
        "22... Nxd2": "He can get the useless B! I'll have a R on the second rank...",
        "23. Bxd2 Rxd2 24. Qxc6": "!?!? White prefers to keep his Q active and guarding g2. Not completely unsound: my dsb is useless, so it is not a priority. ",
        "24... Rfd8": "Very happy to take the turn to develop my forces, and looking hard for a \"Tactic Trainer's like\" trick.",
        "25. Qe6+ Kf8": "...this leaves white with Qxe5, but what after Bd6?",
        "26. Qg4": "Forcing the Q's exhange? No, sir, not until I'm sure I'll win!",
        "26... Qh6": "Still building. Can White defend?",
        "27. Rfe1": "As good as any other?",
        "27... Rc2": "White can still stop me by exchanging R...",
        "28. c4": "...but he prefers to bet his life on his pawns! That means a lot of tempos for me!",
        "28... Rdd2": "Not even exchanging the two R for the White's Q gives me a win.",
        "29. c5 Rcxa2": "I have time to do this, I will... (gulp!)",
        "30. Rxa2 Rxa2 31. Qf3": "Protecting a3. ",
        "31... Qd2": "...pressing hard on g2, being d8 covered by my B. Now, white can draw the game (if I am correct) with a tactic. Can you see it?",
        "32. Rd1": "! If my Q retires, Qa8+, followed by Qd5+... but black has an even more interesting reply that overcomes all that. Can you see it?",
        "32... Ra1": "I'd say elegant, wouldn't you?",
        "33. Rxa1 Qd4+ 34. Kh2 Qxa1": "Now. Now! The game is not won. In order to win, I have to be sure to get rid of all white's pawn, and I have a B for doing it. How? White has to be sure about his pawn's march will keep black busy and, with luck, try to snatch some of the black's extra pawn in the process... very hard.",
        "35. c6": "...but this was not the right way to start. It just gives me a very nice idea: ",
        "35... Bd6": "e4+ is threatened...",
        "36. Qb3": "! White allows the check, but avoid my Q's subsequent's ones!",
        "36... e4+ 37. g3 e3": "...I sacrify the pawn in order to get my Q able to check. I sense it was the right thing to do...",
        "38. Qe6": "? White's final mistake was very forgivable. True is that Qxe3 was the right choice, where I lost the pawn for very few but a Q's exchange and Bxg3 in return. But this tried to be more aggressive. Can you see the flaw in this white's idea? Do your homework, please! :-)",
        "38... Qb2+ 39. Kg1 Qc1+": "My Q gets closer and white can't avoid it!",
        "40. Kg2 Qd2+ 41. Kf3": "A desperate try that fails to...",
        "41... Qf2+ 42. Kg4 Qxg3+ 43. Kf5 Qg6#": "Very elegantly, the B's bishop was \"en prise\" all the time, and participates in the mate... Thank you for reading! "
    },
    "url": "https://gameknot.com/annotation.pl/elementary-my-dear-watson?gm=60871",
    "gameName": "Elementary, my dear Watson...",
    "players": "gmillioni (1287) vs. damafi (1363)",
    "opening": "Polish (Sokolsky) opening (A00)"
}