{
    "moves": {
        "1. d4": "Another annotation from my QGD Slav exchange tournament.\r\n\r\nThis was an enjoyable game which was hard fought right to the end.\r\n\r\nPlease feel free to comment, I hope you enjoy this game as much as I did",
        "1... d5 2. c4 c6 3. cxd5 cxd5": "Starting position for the tournament",
        "4. Nf3 Nf6 5. e3 Bf5 6. Bd3 Bxd3 7. Qxd3 Nc6 8. O-O": "Black is still a few moves from castling, so I try to take advantage",
        "8... e6 9. Qb5 Qc7": "a nice move from black giving the queen a good line to h2",
        "10. Ne5": "Still trying to maintain pressure to prevent castling",
        "10... Bd6": "Black of course isn't falling for it and develops his dsb",
        "11. Nd2": "Black won't take the knight as then he will be forced to move his own knight, this gives me the opportunity to support my knight ",
        "11... O-O": "Removes the pin on the knight meaning it is now threatening the knight on e5",
        "12. Ndf3": "Maintaining pressure, the white knights are not easy to extricate from here and are useful as they close the diagonal for blacks dsb and queen",
        "12... a6 13. Qe2": "My queen was serving no useful purpose where it was so I relocate",
        "13... h6": "prevents Ng5 however this also weakens the pawns around the black king",
        "14. a3 Ne4": "preparing to shift the white knight on e5",
        "15. Bd2": "If black is going to move my knight I want to try to make sure that his dsb is no longer available",
        "15... a5 16. Rac1 f6 17. Ng6": "This knight is going to remain an annoyance to black, it is not easy to extricate from here, however I have other plans for it. It also forces the rook to move.",
        "17... Rfe8 18. Nf4 Qf7": "Prevents Nh5, however raises the tempting possibility of a fork by getting a knight to d6",
        "19. Nh4 Ne7 20. Be1": "preparing to shift the knight on e4",
        "20... e5 21. Nh5 Ng6 22. f3": "Trying to remove one of the defenders of d6",
        "22... Ng5 23. Nf5": "Threatening the fork on d6",
        "23... Bf8 24. b4": "Still trying to remove the black dsb from the f8-a3 diagonal - if axb4, then Bxb4 forces the bishop exchange",
        "24... Ne7": "The fork on d6 is less of a threat now as I would lose 2 knight for a rook",
        "25. Nhxg7": "I think this was a mistake on my part. I was trying to open up the position around the black king with a view to possibly bringing my dsb into the attack",
        "25... Bxg7": "I'm not sure if this is a mistake or not - and would certainly appreciate any comments, black accepts the fork with the compensation that his pawns around the king are strengthened",
        "26. Nd6": "finally",
        "26... Qg6": "Black now has the threat of Nh3+",
        "27. Nxe8 Rxe8 28. Kh1": "I'm quite sure at this point black was relieved to be rid of my knights",
        "28... Nf5": "Preparing more troops for an assault",
        "29. Bf2 Bf8 30. Rc7": "I decide to go for a counter attack on the queen's side. My rook is here partly to scare black but also to keep the black king restricted",
        "30... axb4 31. axb4 Bxb4 32. Qb5 Bd6 33. Qxd5+ Kf8 34. Rxb7 Rd8 35. Rfb1 Ne7 36. Qa2": "This was to try to keep the black king hemmed in but I am not sure if Qa5 might have been better",
        "36... exd4 37. e4": "Trying to avoid an isolated pawn and also slightly improving the position of my dsb",
        "37... Nc6": "Defending the pawn and b8",
        "38. Qa4": "Pressuring the knight and d6",
        "38... Ne5 39. Bxd4 Nexf3": "Black starts to fight back",
        "40. Bg1": "Trying to avoid opening the position around my king too much",
        "40... Nd2 41. Bb6": "Would Rd1 have been better here?",
        "41... Rc8 42. Qd7 Nxb1 43. Bc5": "This is surely a mistake, Qxc8+ would be better",
        "43... Re8 44. Qxd6+ Kg8 45. e5": "Clearly black can't take the pawn ",
        "45... Ne4": "Threatening my dsb, I need it on the g1a7 diagonal to resist some of blacks threats",
        "46. Qd5+ Kh8 47. Bd4 Nbc3 48. Qc6": "Intending Bxc3, Nxc3, Qxc3",
        "48... Qh5 49. h3": "White is in trouble now",
        "49... Ng3+ 50. Kg1 Nce2+": "At this point I thought black was going for a draw, he however has something else in mind",
        "51. Kh2 Rf8 52. Bc5 Nf1+ 53. Kh1 Qxe5": "Threatens Qh1#",
        "54. Bd6": "This is fatal for white",
        "54... Neg3+": "And white is lost after Kg1 qd4#\r\n\r\nThanks for reading"
    },
    "url": "https://gameknot.com/annotation.pl/elwooss-qgd-slav-exchange-opentournament?gm=26590",
    "gameName": "elwoos's QGD Slav exchange opentournament",
    "players": "elwoos (1504) vs. jameseh (1613)",
    "opening": "QGD Slav defence (D10), exchange variation"
}