{
    "moves": {
        "1. e4": "Another game from my French Defence mini tournament. I decided to annotate this one as I felt I played a lot better than I have in many games recently, I'd be interested to see if others agree or not with some of my move choices. \n\nAnalysis is available - http://gameknot.com/analyze-board.pl?bd=19076547&rnd=0.6846651595551521\n\nIn this game the white bishops proved to be a powerful force to be reckoned with.\n\nInterestingly, so far in the tournament I have won more games as white than black",
        "1... e6 2. d4 d5": "Starting position",
        "3. Nd2": "Tarrasch, this is a rare move for me as generally I would go for Nc3 but I thought I would give it a try",
        "3... Nf6 4. Bb5+ c6 5. Bd3 dxe4 6. Nxe4 Be7": "This takes us out of the Gameknot database where the moves were Nbd7 and Qxd4",
        "7. Nf3 Nbd7 8. Bf4": "Black looks a little cramped here to me",
        "8... O-O 9. O-O b5": "Computer thinks this is an innacuracy prefering … Nxe4 10. Bxe4 Qb6 11. Rb1 Nf6",
        "10. Nfg5": "Looking to provoke h3 to weaken the pawns around the black king",
        "10... g6": "I think this may be inaccurate as now black can only push my knight out by further weakening the pawns around the king",
        "11. Qf3": "threatening Qh3",
        "11... Nh5 12. Be3": "I have no intention of swapping out my bishop and this also gives my queen more access to squares around the black king",
        "12... f5": "I would say this is a blunder as it loses material as we will see. Computer calls it a mistake and prefers  Nb6 13. g4 f5 followed by a flurry of exchanges",
        "13. Nxe6 Qa5": "computer says this is a mistake preferring  Ne5 14. dxe5 Bxe6 15. Nc5 Bd5 16. Qh3 Qa5",
        "14. Nxf8 Nxf8": "I would prefer Bxf8 here as black as the text allows me to play Bh6 later hemming the king in. Computer calls this a mistake preferring  fxe4 15. Qxe4 Bxf8 16. Qxc6 Nb6",
        "15. Nc3": "threatens Bxb5 as the c6 pawn is pinned to the rook",
        "15... Bb7 16. Bh6": "My plan now was to try to get my lsb on the a2-g8 diagonal, with hindsight I should probably have played a4 but for some reason I can't recall I didn't.\n\nComputer says this is whites first mistake and it prefers  Bxb5 Qc7 17. Bc4+ Kh8 18. d5 Bf6",
        "16... b4": "I'm happy with this as it lets my plan easier to execute",
        "17. Nb5": "The pawn is still pinned but now to the black lsb. Computer calls this a mistake",
        "17... Qb6": "traps the knight",
        "18. Qe3": "My queen can now get to the a1 - h8 diagonal to complete my plan and if black takes my knight on b5 I can take his dsb which weakens black on the dark squares",
        "18... cxb5 19. Qxe7 Ne6 20. Rfe1 Bd5 21. Re5": "Planning to sacrifice the rook with something like Rxf5, gxf5 Bxf5 which exposes the black king even further and threatens Qxh7#",
        "21... Qd8": "I'm not certain this is a blunder but it does lose some material",
        "22. Rxe6 Bxe6 23. Qxe6+ Kh8 24. Qe5+ Qf6 25. Bxb5": "As I'm up in material I am happy to exchange queens, this move was to protect the queening square from the white rook after queens are exchanged",
        "25... Qxe5 26. dxe5 Ng7": "I can bring my rook in to support my passed pawn but first I need to neutralise the black knight, I didn't want to exchange as it allowed the black king to get out easier",
        "27. Bg5": "threatening to pin the knight\n\nComputer prefers . Rd1 Rg8 28. Rd7 Nh5 29. Rxa7 Rd8",
        "27... Rb8 28. Bc4": "better is surely Ba4",
        "28... a5 29. Bf6 a4": "Computer calls this a blunder preferring h5 and we will see why",
        "30. e6 a3": "This was completely unexpected as I was expecting b3",
        "31. b3 Rb6": "This proved to be a pretty fatal move for black as we will see not that he has a lot of options. Computer gives mate in 9 here Rb6 32. Rd1 h5 33. Rd7 Kh7 34. Bxg7 g5 35. Be5+ Kg6 36. e7 f4 37. e8=Q+ Kf5 38. f3 Rd6 39. Rxd6 g4 40. Qxh5# and prefers Rf8",
        "32. Rd1": "I dont need the rook on the e file as the bishops can protect the pawn, with the rook here I have the threat of Rd8+, when my pawn gets to e7 this will allow my rook to protect the pawn from blacks rook",
        "32... h5": "forced",
        "33. e7": "Obviously I hadn't seen the mate that the computer had and so this is described as a blunder ",
        "33... Rb8": "too late but black had little choice",
        "34. Rd8+": "Black is going to lose more material and if the king goes to h7 I have have Bg5\n\nComputer gives mate in 6 here",
        "34... Rxd8 35. exd8=Q+ Kh7": "I completely missed the mate in two here with Qg8 +, Kh6, Qh8#",
        "36. Bg5": "Threatens Qg8# which ironically is mate in 3",
        "36... Ne6": "nice fork but it fails however black was out of options",
        "37. Bxe6": "Thanks for reading I hope you enjoyed the game. Please comment"
    },
    "url": "https://gameknot.com/annotation.pl/elwooss-french-defence-mini-tournament-black-and-white?gm=48883",
    "gameName": "elwoos's French Defence mini-tournament Black and White",
    "players": "elwoos (1488) vs. ambrosio (1429)",
    "opening": "French (C05), Tarrasch, closed variation"
}