{
    "moves": {
        "1. c4": "This is probably the most aggressive and risky game I have played for a long time. It happened in my Halibut gambit tournament.",
        "1... b5": "Starting position",
        "2. cxb5 a6 3. Nc3 axb5 4. e4": "This is surely a mistake.",
        "4... b4 5. Nd5 c5": "I think I would have been tempted by e6.",
        "6. d4 e6": "It was around this point that I decided to go for it. I think having such an advanced position for my knight went to my head and I thought I could see all sorts of possibilities. ",
        "7. Bg5": "Obviously if the queen takes the bishop I can fork King and rook with my knight and may get to develop my remaining knight with tempo to f3",
        "7... f6 8. Nxf6+": "Against a player ranked so much higher than me this is a high risk gambit.",
        "8... Nxf6": "I was hoping for (though not expecting) gxf6 as I then have Qh5+ ",
        "9. e5": "Trying to maintain the pressure on black.",
        "9... h6 10. exf6": "I didn't want to retreat the bishop as g5 might follow if I did and that would give black advanced pawns on the kings side where I was looking to castle in future",
        "10... hxg5 11. f7+": "Black may have been expecting fxg7 but I have another plan which will regain my lost material and possibly more, the bonus with this was that black couldn't castle - not that he was likely to now",
        "11... Kxf7": "Black can't afford to leave one of my pawns so far advanced so has little choice",
        "12. Qf3+ Qf6 13. Qxa8": "Suddenly I am ahead on material with the chance of more. Black can no longer castle and  and I need to work out how to take advantage of the position",
        "13... Qxd4": "I was really expecting something like Bd6 here, though black was trying to keep his advanced pawns together, they could still yet prove a thorn in my side.",
        "14. Rd1": "I'm still not sure that the simple Qxb8 wouldn't have been better here, in the end I decided to keep trying to pressure black. I figured that he would be tempted with Qxb2 partly to equalise on material but also because it means that his c and b pawns look a lot more threatening then.",
        "14... Qxb2 15. Bb5": "Looking to develop here but again the simple Qxb8 or Nf3 may have been better. I wanted to preserve my a pawn as I may need it to keep the black pawns back a little. ",
        "15... Qe5+ 16. Kf1": "I didn't want to block as I wanted to develop my knight to f3 threatening check with Nxg5",
        "16... Qc7 17. Qf3+": "With blacks queen there my queen is better off somewhere else. I wanted to try to keep black under pressure",
        "17... Kg8": "This works well for me as I still have my lsb and am hoping to make good use of it",
        "18. Nh3": "Aiming at g5 with the simple threat of Qf7",
        "18... Bb7 19. Qb3": "This foils my immediate plan but now I am looking at another. If I can get my knight to g5 then a sacrifice on d7 could be nasty for black with Qxe6 threatened",
        "19... Bxg2+": "I'd completely missed this nice move which allows black to gain a pawn",
        "20. Kxg2 Qb7+ 21. f3 Qxb5 22. Nxg5": "I am very happy with my knight here",
        "22... c4 23. Qe3 Qa6": "Black now wants my a pawn so that he can escape but I think this is a blunder",
        "24. Qf4": "reverts to my earlier threat of Qf7#, as far as I can see the only way to slow this down is something like ... Qxa2+, Rd2, Qxd2, Qxd2 with more material loss to follow. ",
        "24... Qxa2+ 25. Kf1": "Now things are really looking up for me, black cannot check and I have mate in one",
        "25... Rh6": "I don't understand this move, I guess he was looking at Rf6 and had missed my threat.",
        "26. Qf7+": "Thanks for reading please comment."
    },
    "url": "https://gameknot.com/annotation.pl/elwooss-fishy-tournament?gm=37471",
    "gameName": "elwoos's fishy tournament",
    "players": "elwoos (1474) vs. graf76 (1622)",
    "opening": "English (A10), Jaenisch gambit"
}