{
    "moves": {
        "1. d4": "Another game from my Queen's pawn tournament against one of the stronger players in the tournament\n\nThe analysis of this game can be found at http://gameknot.com/analyze-board.pl?bd=13970651&rnd=0.5168563760817051",
        "1... Nf6 2. e3 g6 3. Nf3 c5": "Starting position",
        "4. c4 Bg7 5. Nc3": "Guarding the hole at e4",
        "5... cxd4": "This move seems a little unwise to me as it relinquishes some control over the centre",
        "6. exd4 O-O 7. Be2": "Perhaps this move is a little premature, I am not under any pressure. Is Be3 or g5 better?",
        "7... d6": "Opening a line for his lsb though this is described by the computer analysis as an innacuracy",
        "8. O-O": "I decide to play safe",
        "8... Nc6 9. a3": "preparing for a queen side pawn storm. Also preventing Nb4.",
        "9... Bg4": "Although this removes a defender from the d4 pawn it doesnt' seem that strong a move to me. I was expecting something like Bf5, followed later by Ne4",
        "10. Be3": "Protecting the pawn. At the moment I am quite happy with my dsb on the c1 h6 diagonal",
        "10... Rb8": "I guess here he is preparing to defend against a pawn storm",
        "11. b4": "As he is outnumbered in pawns I decide to go for it",
        "11... e6": "This was a bit of a suprise. I think black is playing a patient game, waiting for a mistake that he can pounce on",
        "12. b5": "Continuing my push, black has limited options for the knight and if I can get in a c5 it could be 3 of my pawns against 2 of his.\n\nThe analysis here suggests this is an inaccuracy and offers b3 as a better move. I had considered that but didn't want to disturb the pawns in front of my king needlessly",
        "12... Ne7 13. Rc1 Nf5": "threatening the d4 pawn",
        "14. Bf4 Nh5": "I need to be careful here as black is building a strong assault",
        "15. Bg5 f6": "I expected Bf6 ",
        "16. Bd2": "Blacks queen is pretty restricted. I had figured that he would want to bring it in to play yet his options are limited at the moment and the line of pawn he has from g6-d6 could become a nice target",
        "16... Bxf3": "This move is pretty much forced as I had the threat of h3, can I take advantage of the bishop pair?\n\nThe analysis however calls this a mistake and suggests Bh6",
        "17. Bxf3 Nxd4 18. Bxh5": "The analysis suggests that this is an inaccuracy and that g4 is better, however I again was reluctant to disturb the pawns in front of my king and felt that this would weaken the black pawns",
        "18... gxh5 19. Qxh5 Nb3 20. Rcd1": "lining my rook up against the black queen",
        "20... Nxd2 21. Rxd2 Rc8": "This move pretty much forces me to do what I want to anyway\n\nThe analysis suggests f5",
        "22. Qg4": "Blacks dsb is now pinned (not that he will want to move it)\n\nThe analysis calls this a mistake, recommending Ne4 in preference",
        "22... f5": "Prevents Qxe6+",
        "23. Qe2": "This blunders a piece",
        "23... Bxc3 24. Rd3": "The analysis suggests 24. Qxe6+ Kh8 25. Rxd6 Qe8  but I didn't see that at the time",
        "24... Be5 25. Rh3": "Looking to get my queen to h5 to threaten Qxh7",
        "25... Qg5": "I have serious doubts about this move if only because blacks rooks cannot get into the play just yet to assist an attack, perhaps more importantly I started to look at how I might be able to pin the queen to the king with my rook, however the computer analysis seems to not dislike this",
        "26. a4": "This was really a waiting move to see what black would try",
        "26... Rf7": "potentially removing the chance of a queen pin",
        "27. f4": "however had something quite agressive in mind. Note that the black dsb is no longer protecting against the pin",
        "27... Bd4+ 28. Kh1 Qg4": "This is a major blunder in my view, black is looking for the queen exchange, he has however forgotten about the pin\n\nThe analysis suggests Qf6",
        "29. Qxe6": "but first I wanted to make sure that the lack rook didn't get in the way. Looking at it now this seems uneccessary, however in the analysis the advantage swings significantly back in my favour",
        "29... Rcc7 30. Rg3": "and there it is",
        "30... Qxg3 31. hxg3": "Looking at the position now I felt I was in with a chance. Although the material imbalance isn't too great, black has three isolated pawns and his rooks are very limited in mobility, his best chance is to open the h file but he can't force that. I have doubled pawns though I don't feel they are a massive weakness and my queen is nicely placed",
        "31... Bc5": "Prevents me from pushing my pawns too much",
        "32. g4": "I decided to offer a sacrifice so that I would have a passed pawn. This is risky as it reconnects blacks pawns\n\n",
        "32... fxg4": "The analysis calls this a mistake and offers Rce7 which is one of the moves I had planned for",
        "33. f5 h5 34. Qg6+ Rfg7": "black's h pawn is now doing me a favour as without it he would be threatening mate with Rh7\n\nThe analysis suggested Kf8 here",
        "35. Qe8+": "pushing the king away from my f pawn",
        "35... Kh7 36. f6": "Opens the b1-h7 diagonal for my queen to use. This will also limit the mobility of the black king",
        "36... Rgf7 37. g3": "but before I do anything else I wanted to clear some space around my king to prevent black getting a rook to the h file",
        "37... Kg6 38. Qe4+": "I did consider Qg8 here but this move felt better to me as there was little black could do to retaliate immediately",
        "38... Kg5": "The analysis calls this a blunder and suggests mate in 14!! I will as they say leave that as an excercise for the reader",
        "39. Qf5+ Kh6": "Blacks king is now totally immobile and there is little defence that can be brought in to play",
        "40. Kg2": "Looking for Rh1, blacks best defence could be Rg7",
        "40... Bb4 41. Rh1": "Thanks to gm_paz for a very enjoyable game. Thanks for reading please feel free to comment"
    },
    "url": "https://gameknot.com/annotation.pl/elwooss-queens-pawn-tourney?gm=32383",
    "gameName": "elwoos's Queen's Pawn Tourney",
    "players": "elwoos (1524) vs. gm_paz (1610)",
    "opening": "Queen's pawn game (A45)"
}