{
    "moves": {
        "1. d4": "This is my first annotation from my QGD slav exchange tournament. I setup this tournament as this is a variation of the queens gambit opening that I had not explored.\r\n\r\nThis particular game is against a good friend",
        "1... d5 2. c4 c6 3. cxd5 cxd5": "Starting position",
        "4. Bf4 Nc6": "Attacking the centre, also reducing any white thoughts of Bb5 or Qd4. I know my opponent likes to get his queen out early though he rarely does it against me and I advise him against it",
        "5. Nc3 e6": "A little extra support for my d pawn, Also opening lines for my queen and dsb though of course it restricts my lsb",
        "6. e3 Bb4 7. Bb5 Qa5": "My opponent is a friend and I have often chastised him for getting his queen out too early. In this case I am threatening to gain material e.g. Bxc3+, bxc3, Qxb5\r\n\r\n\r\nI also did it to tease him a little and to try to show that there are times when getting your queen out early isn't bad. In this case my queen is well supported and could prove time consuming to remove",
        "8. Bxc6+": "Exchanges the bishop for my knight. I asked why he did this and he said that he sees knight as more of a threat. I think in a fairly open game like this one is so far that bishops are stronger.\n\nI am also still threatening to gain material with Bxc3+, bxc3, Qxc3+",
        "8... bxc6 9. Qd2": "White has other options here that may be better. I was expecting Nge2 to protect the knight and allow white to castle, I think Qc2 is also playable",
        "9... Nf6": "My development is now almost complete and I can castle if I choose, if white moves his G knight I am intending Ba6 to try to prevent him from castling",
        "10. f3": "This is a very strange move as it not only weakens whites pawn structure, it prevents the g knight from developing to f2. The only purpose I can see that it might serve is to restrict my knight a little.\r\n\r\nI'm now trying to work out how to exchange the white dsb and then how to attack the white e pawn",
        "10... O-O": "First lets get my king tucked away nice and safe",
        "11. Nge2": "White can now castle if he chooses to the safety of the kings side",
        "11... Ba6": "I am now back in a position where I can gain material Bxe2,Qxe2, Bxc3+, bxc3, Qxc3+ gains a pawn and a rook or prevent white from castling Bxe2, Kxe2",
        "12. Nc1": "I think a better option might have been to castle",
        "12... Rfe8": "Now that white can't castle my rook is nicely lined up against his king",
        "13. Nb3": "Pushes my queen away, Better may have been Nd3",
        "13... Qd8": "Leaves my bishops unprotected however I am now looking to move my attack to the kings side by chasing off whites dsb with Nh5 and making use of the d8-h4 line with my queen",
        "14. a3": "Pushes away my dsb ",
        "14... Bd6": "Allows me to advance my plans to remove whites dsb",
        "15. Ne2 Nh5 16. Ng3": "This isn't a good move from white as it removes one of the defenders of the dsb. It also means that once more white can no longer castle on the kings side",
        "16... Nxf4 17. exf4": "I now have the half open e file ",
        "17... Qh4": "threatens the f4 pawn, Note also that its tricky for white to remove my queen from here",
        "18. Qa5": "Threatens my lsb",
        "18... Bc4": "maintains pressure around the white king but also threatens the knight. This bishop is going to be almost impossible to move now",
        "19. Qc3": "Defending the knight though I still have the option of Rb8",
        "19... Bxf4": "Applies more pressure to the white king, also threatens Bxg3+, if hxg3 then Qxh1",
        "20. Kf2": "White did this to protect his rook though it weakens his position\r\n\r\nFor a fairly open position white is looking a little cramped",
        "20... e5": "looking to open the e file for my rook",
        "21. dxe5 Bxe5": "Threatening the queen but more importantly eyeing up D4",
        "22. Qb4": "First I need to work out how to shift the white knight on b3",
        "22... a5 23. Qb7": "Better for white is Qb6 or Qd2, whites king is still vulnerable and this move does nothing to prevent that",
        "23... a4": "Moving the knight is catastrophic for white. At this point I set up some conditional moves and advised my friend to be careful in his next move",
        "24. Rae1": "This doesn't help white, better would be Qb6",
        "24... Bd4+": "Now mate is unavoidable I think. white's best option is probably Re3 but the game will surely end soon",
        "25. Re3 Bxe3+ 26. Ke1 Bc1+ 27. Kd1 Bxb3+": "Whites best option here may be Qxb3",
        "28. Kxc1 Qf4+ 29. Kb1": "forced, now I just need a rook or a queen on the back row",
        "29... Qd2": "I am now looking at Re1, Rxe1, Qxe1",
        "30. Rc1 Rab8": "lining up on the king",
        "31. Qxc6": "White has few options he won't last much longer",
        "31... Ba2+": "At this point I setup some conditional moves, white only has two options both leading to mate",
        "32. Kxa2 Qxb2#": "Thanks for reading"
    },
    "url": "https://gameknot.com/annotation.pl/elwooss-qgd-slav-exchange-tournament?gm=24898",
    "gameName": "elwoos's QGD Slav exchange tournament",
    "players": "desypete (1433) vs. elwoos (1527)",
    "opening": "QGD Slav defence (D10), exchange variation"
}