{
    "moves": {
        "1. c4": "Another game from the Halibut tournament, I made a lot of mistakes, mostly early on but luckily managed to claw my way back all thanks to one pawn.",
        "1... b5": "starting position",
        "2. cxb5 e5 3. b3 Bb4": "Looking to hinder whites development",
        "4. Bb2 d6": "I really didn't like this move but could see no alternative",
        "5. e4": "weakens whites d pawn but can I take advantage",
        "5... Nf6 6. Bd3": "Whites pawn is going nowhere a the moment so having a bishop in its way isn't really a problem at the moment",
        "6... O-O 7. Nf3 Bg4": "I think at this point white is feeling a little constrained, that was certainly my intention.",
        "8. h3 Bh5": "Hoping for, but not expecting, g4",
        "9. Bc3 Bc5": "I dont want to exchange as I am happy with my dsb.",
        "10. b4 Bb6 11. a4 c5 12. a5 cxb4": "This is a miscalculation on my part",
        "13. axb6 a5": "This seems to make things worse for black however this pawn helps win the game.",
        "14. Bxb4 Qxb6": "With a material deficit against a much stronger player it was obvious I needed to start improving my play but what to do.",
        "15. O-O Nbd7 16. Ba3 Nc5": "As white has the shop pair I decided to pressure his bishops",
        "17. Bxc5 Qxc5 18. Nc3": "At this point I was thinking I wouldn't last much longer especially with whites passed pawn closer to the end of the board.",
        "18... Nd7 19. Nd5 Kh8 20. Ne3 Nb6": "Not only does this prevent the white pawns progress, it also strengthens the path forward for my a pawn",
        "21. g4": "At first I thought this was a mistake but I can't see any way for me to take advantage of it",
        "21... Bg6 22. Nh4 Bxe4": "Another mistake.",
        "23. Bxe4 d5 24. Bd3 e4": "I figured that white was trying to preserve his passed b pawn, this gave me a chance to regain some material",
        "25. Be2": "Possibly whites first mistake, this gave me the glimmer of hope",
        "25... d4": "If the knight moves away I have whites lsb trapped by pawns wth d3",
        "26. Rc1 Qg5 27. Nef5": "About the only way to keep the knights.",
        "27... d3": "but now its the bishops turn to fall",
        "28. Bf3": "This was a little unexpected, I was expecting Bxd3",
        "28... exf3 29. Nxf3 Qd8 30. Re1 a4": "Time to start pushing that pawn for promotion.",
        "31. Ne5 Qd5 32. Qf3 a3": "In theory I probably shouldn't exchange queens but this gave me an opportunity to push the pawn a little more",
        "33. Qxd3 a2 34. Qc3 f6 35. Ne7 Qxb5 36. Ne5c6": "Looking at Nb4",
        "36... Na4": "but I have plans of my own",
        "37. Qa3": "I think this is a mistake as white voluntarily leaves the queen open to a revealed attack",
        "37... Nb2": "Now I have the threat of forking the rooks which will bring the pawn another step nearer to promotion",
        "38. Qg3 Nd3": "And there we have it. Does white have the resources to prevent me getting 2 queens.",
        "39. Ng6+ hxg6 40. Ne7 g5": "Preventing Qg4#",
        "41. Ng6+ Kg8": "I chose this simply so that I could retake with the king if he takes the rook as that would leave my a pawn defended.",
        "42. Ne7+ Kh7 43. h4 Nxc1": "And now promotion is getting ever nearer but first I have a nice little plan if only I can pull it off",
        "44. hxg5 Ne2+ 45. Rxe2 a1=Q+": "And there it is, two queens against a much stronger opponent, surely I had to have a chance now.",
        "46. Kh2 Qxg5 47. Qd3+ Kh8 48. Ng6+ Kg8 49. Ne7+ Kh8 50. Ng6+": "Here I thought he may have been looking for a draw by repitition",
        "50... Kh7 51. Nxf8+ Kg8 52. Ng6": "This is a mistake but I am not sure what was better",
        "52... Qh6+": "White resigned, thanks for reading please comment."
    },
    "url": "https://gameknot.com/annotation.pl/elwooss-fishy-tournament?gm=37754",
    "gameName": "elwoos's fishy tournament",
    "players": "geppoz (1567) vs. elwoos (1496)",
    "opening": "English (A10), Jaenisch gambit"
}