{
    "moves": {
        "1. d4": "I was playing Black. One satisfying thing about this game is that I spent most of it focused on the d4 square, and that's where the decisive blow was struck (albeit not how I expected). Annotation was mainly done as the game progressed, but edited after the game.",
        "1... Nf6 2. c4 g6": "I've only used King's Indian systems a couple of times, but decided to try it here. ",
        "3. Nc3 Bg7 4. e4": "White has chosen a very aggressive opening. Black can now play d6, but I decided to delay showing my hand as long as possible.",
        "4... O-O": "If 5. e5, 5... Ne8, followed by some pawn advances, is fine.",
        "5. Nf3 c6": "Given this opening again I would probably play the more thematic 5... d6, followed at some point by e5. I like to provoke my opponents into kingside attacks, but as this game progressed, such an attack would probably have been justified.",
        "6. Be3": "Having made my annotations, I ran the game through Fritz, and this is where we leave Fritz's book. I will add the game score in brackets after my own comments, with improvements for large errors. Note that this score often disagrees with my own annotations, hardly surprisingly. (Fritz: +0.37) ",
        "6... d5": "Trying, perhaps foolishly, to provoke e5. With these moves, my future was bound to be on the queenside and my opponent's on the kingside. (Fritz: +0.36)",
        "7. cxd5 cxd5 8. e5": "From this point I decided that Black's target should be d4. My long term plan was something like Nc6, Ne8-c7-e6 (but Bg4 before Ne6 to remove a defender of d4), a6, b5-b4 to kick Nc3 from the attack on d5, and an eventual f6 to open the diagonal for the bishop. I did not expect to be able to win the pawn, just to exert pressure on White's position. I knew that White's play was likely to alter this course, but I always need a concrete plan. (Fritz: +0.20)",
        "8... Ne8": "Here, we leave the World database. 8... Ne4 was played in a couple of games. (Fritz: 8... Ne8 +1.00; 8... Ne4 +0.20)",
        "9. Be2": "Now White has a dramatic lead in development, but that's okay because the centre is closed. (Fritz: +0.78)",
        "9... Nc6 10. Qb3 Nc7": "A flaw in my plan was the placement of three minor pieces on the open c-file. This made it hard to generate quick counterplay if White tried an early kingside attack. Playing for an early Rc8 might have been wise. (Fritz: +0.63)",
        "11. h4": "! The White king is still in the centre, and the queen has just been moved away from the kingside. Nevertheless, I think this an excellent move. The centre is closed, White's pawns are pointing kingside, and opening the h-file carries serious threats.\n\nWhat should Black do? h6 or h5 are overly committal and would encourage White. \"The best response to an attack on the flank is a counter-attack in the centre\", but the only move available to prise open the centre (11...f6) would be premature. A simple queenside pawn march is too slow. I chose a move I had intended anyway, exploiting the negative aspect of 11. h4, which I hoped would put doubt in White's mind. (Fritz is not particularly keen on 11. h4: +0.16)\n\n",
        "11... Bg4": "Freeing c8, looking to remove the defender of d4 (and a key attacking piece), and White cannot rush this with h3 any more. Admittedly this move does also hang a pawn.... (I'm pleased; Fritz is okay with 11... Bg4: +0.34) \n",
        "12. Nd2": "I wonder if White gave much thought to the simple 12. Qxb7. After 12... Na5 13. Qb4 Na6, White has lost a lot of time and Black has two very tempting open files. Nevertheless, a pawn is a pawn, and White's kingside attack is still there. (Fritz: -0.02)",
        "12... Bxe2 13. Nxe2": "Now both white knights have moved to inferior positions. I still think White is slightly better though. (Fritz: +0.14)",
        "13... Na5": "Continuing to empty the c-file with forcing moves so that my queenside play could catch up with White's kingside play, and defending b7. (Fritz: +0.20)",
        "14. Qd1": "I can see some logic in this. Black can chase the queen around on the queenside, and perhaps White was hoping h5 might be met by gxh5. Still, it prevents White connecting rooks or doubling them on the h-file. Qd3 or Qa3 look stronger. (Fritz: -0.01)",
        "14... Nc4": "I was tempted by 14... f6, to activate the bishop but also with 15. h5 g5 in mind, but decided to maximise the activity of my pieces first. In fact, Black's at least level in development, which is remarkable considering the position after 8... Ne8. Prompted by 14. Qd1, I was no longer so desperate to make use of the c-file. (Fritz: +0.33)",
        "15. Nxc4": "So Black has a new way to pressurise d4, using the semi-open d-file. (Fritz: +0.32)",
        "15... dxc4": "Black's effectively distracted White from the kingside over the last five moves. Here, I think White should have ignored Black's queenside play with something like 16. h5. (Fritz: +0.39)",
        "16. Rc1 Qd5": "I have to admit to being lured by cheap threats on g2 and a2, which do not merit misplacing the queen. (Fritz: +0.62)",
        "17. Nf4": "(Fritz: 17. Nf4 +0.01; 17. O-O +0.62)",
        "17... Qa5+ 18. Bd2": "18. Qd2 is better. (Fritz: -0.55)",
        "18... Qxa2 19. Qc2": "Now if 19... b5?!, Black must tread a tightrope without any help from the queen. For example 19. h5 g5 20. Nh3 h6 (20... f6 is not clearly better) 21. Bxg5! hxg5 22. Nxg5 +- due to White's powerful threats such as. 23. Qxh7#. (But Fritz obviously found a good defence for Black: 19. c3 +0.12; 19. b5 -0.55)  ",
        "19... c3 20. Bxc3": "The key to the position now is, are White's central pawns a strength or a weakness? They dominate the central dark squares, but Black can hope to undermine them. One point is that Black does not want to play e6, because this would make f6 more difficult. (Fritz: -0.18)",
        "20... Nd5": "Obviously a great square for the knight but if White exchanges knights, the kingside attack which started with 11. h4 will be stillborn. (Fritz: +0.12)\n",
        "21. Qe4 Rad8": "I chose this over Rfd8 because I was still planning f6, and did not mind White attacking my a-pawn. It does show a lack of interest in the open c-file however. (Fritz: -0.02)",
        "22. Nxd5 Qxd5 23. Qxd5 Rxd5": "So, what are the endgame imbalances? Both players have two pawn islands. Black's queenside majority will be handy, unless White can trade with a minority attack and create an isolated Black pawn. Neither bishop is particularly active. Black's rooks are more active, but White's uncastled king could be a strength now the queens are gone. (Fritz: -0.02)",
        "24. Ra1": "What are the players' plans? Black's is pressure on d4 (Rfd8 and f6) as ever. I think White should centralise the king and then start a pawn advance on one side. (Fritz: -0.01)",
        "24... a6 25. b4": "?! Good idea in principle but premature. The Bc3 bishop is now at the base of a pawn chain on an open file, and vulnerable as a backward pawn is vulnerable, though more costly to lose. (Fritz: -0.37)",
        "25... Rc8": "White's in trouble, but 26. Ra3 seems okay. After 26... Rxd4 27. Bxd4 Rc1+ 28. Kd2 Rxh1, Black has won a pawn, but deactivated a rook. Alternatively, 26. Bb2 admits a rook to the 7th rank, but is still better than the game line. (Fritz: -0.36)",
        "26. Rc1": "?? Now Black's advantage should be decisive. (Fritz: 26. Rc1? -2.46; 26. Rh3 -0.36)",
        "26... Rxd4": "I never got round to applying that much pressure to d4, but it fell anyway! (Fritz: -2.45)",
        "27. Ke2 Rdc4 28. Rh3": "Defeating the object of 27. Ke2, which connected the rooks. (Fritz: 28. Rh3?? -5.05; 28. Bb2 -2.45)",
        "28... Bxe5 29. Kd2": "Fails to another tactic, but White's helpless now anyway (Fritz: -6.70)",
        "29... Bf4+ 30. Re3 Bxe3+ 31. fxe3": "Apart from the decisive material imbalance, White's pieces are fixed in place, with the only means of release (Bb2) making Black's job easier. Otherwise, Black can now very easily centralise the King, exchange and win pawns, and promote. (Fritz: -6.76)",
        "31... f6": "White resigned. I think that White was the better player for the first half of the game, but made one big mistake (besides the endgame blunder). That mistake was to be distracted by Black's counterplay and not persist with the kingside attack that was obviously intended. (Fritz: -6.75)"
    },
    "url": "https://gameknot.com/annotation.pl/endgame-tactics?gm=31453",
    "gameName": "Endgame tactics",
    "players": "solecism (1594) vs. kicorse (1842)",
    "opening": "King's Indian (E70), 4.e4"
}