{
    "moves": {
        "1. c4 e5 2. g3": "This is Grandmaster Tony Kosten's recipe:  Seize the diagonal and control d5.",
        "2... c6": "This is a strong move, but it's consequence is that white can often force an isolated queen pawn so long as he refrains from an early Nf3.",
        "3. Bg2 Nf6 4. d4": "Kosten himself actually recommends d4 a move earlier once black threatens d5.  He's the expert, and there probably are complications to playing this later, but it worked here.",
        "4... exd4 5. Qxd4": "Essential to restoring equality.  \r\n\r\nThe queen -for the moment-- is safe from harrassment from Nc6, but interesting is 5...c5 attempting to transpose to play resembling the symmetrical variations because it gains black time.  At first glance, the problem with 5...c5 seems to be that it loses time on an opening when very few pieces are already developed by black, but the fact is that black can play the move with relative impunity because white is forced to move the queen.  (Grandmasters today use tranpositions as much as weapons as other techniques.)    Kosten doesn't mention the possibility, but it looks like an enterprising way to attempt to get someone out of their theoretical knowledge-base.  I think it's interesting also because it's uncharted territory.  It's the bane of the chess player: interesting games are novel; novel games are filled with flaws and tactical surprises that may cause a loss.",
        "5... h6": "5...d5 is perfectly playable; it accepts the isolated pawn.  Kosten states that 5...d5 6.cxd5 Nxd5 attempting to avoid the isolated pawn is eronious because black will suffer serious problems in the endgame.  Black should not play c6 unless he is willing to accept the IQP play.  The question has been raised \"Why play 5...d5 when the IQP appears to only be a weakness?\"  The answer isn't simple.  Part of the answer is unless white errs, it's unavoidable.  Second, after Be6 reinforcing the pawn, black's center can suddenly become strong if white captures on e6.  White will then have to play carefully.  Kosten's book emphasizes undermining the isolani as white, but he provides about a full page of typed analysis on the issue.  Schiller's book on the Tarrasch makes clear that there are tactical advantages from accepting the IQP.",
        "6. Nf3 Bb4+ 7. Bd2": "White could play Nc3, but the bishop move is forcing.  Black faces several poor choices now.  He can move the same piece twice retreating, or he can move the piece twice tempting white to do so as well.  Playing c5 forces the white queen to move, but white can force black to cede the gained tempo.\r\nIf black captures and the queen retakes, it might seem like it goes against the opening principle of getting pieces to their positions as quickly as possible, but white was eventually going to have to move the queen once more anyway, and black violates the principle first.  If 7...c5, then 8.Qe5  seems reasonable.  Both continuations allow white to deprive black of castling rights.",
        "7... Bxd2+ 8. Qxd2 O-O 9. O-O Ne4": "This move prompts my belief that 9.Nc6 was more accurate.",
        "10. Qb4": "I think here white should be concerned with a5, c5.  10...b5 allows white's plan to proceed unhindered:  10...b5 11. cxb5 cxb5, and black suffers and must play with an IQP.",
        "10... d5": "11. cxd5 here cannot not force black to suffer an IQP.  In fact, I think from here on out, it was inaccurate play by black that allows white to force the IQP.",
        "11. Nc3 Bf5": "Reinforcing the knight?  Several problems exist with this.  First, the knight is not yet the target.  Second, the b pawn is vulnerable.  Expected 11...Nxc3.  It's usually considered good form to reinforce pieces with pawns. As such, if he's concerned about NxN, then f5 might have more merit than Bf5. Frankly Nxe4 allows black to escape the pawn island even if it will require f5 to defend it.",
        "12. cxd5": "12...Nxc3 is probably the best move.  Since DS bishops are gone, the queen capturing on c3 faces no immediate, meaningful challenge.  So 12...Nxc3 13.Qxc3 Qxd5 does seem to escape the IQP, but white's connected rooks can seize her file.  It seems to me that white is better developed and has a better plan to deal with the challenges of the position.",
        "12... cxd5 13. Nd4": "Blockading the pawn to eventually attack it.  The b pawn is still vulnerable, and the LS bishop is en prise.",
        "13... a5": "13...a5?? is no longer trouble because of the weak b pawn.  While it retreats, Bc8 was much better.  If 13...Nxc3, white can take the bishop (14.Nxf5) and allow the knight to escape or trade knights (either bxc or Qxc).",
        "14. Qxb7": "Black can only save either the rook or the bishop.  After 14...Nxc3 15.Qxa8, 15...Be4? 16. f3 proves to only favor white where only bishop or knight can be saved, not both.  15...Nxe2  is impossible because of 16.Nxe2.  the only logican continuation is the knight retreat.  15...Nb5 looses to 16. Nxb5, so black is left with 15...Ne4 which, while it seems defensible, is not particularly strong.",
        "14... Na6 15. Nxf5": "I'll take the free material.  15...Rb8 abandons the knight at a, and 15...Qb8 is an even exchange when white is up on material and heading faster toward an endgame favoring white.",
        "15... Qf6": "Examing 16.Ne7  led me to my next move.",
        "16. Nxd5": "Black cannot take the knight.",
        "16... Qxf5": "And he does!  A serious blunder.  After my response, he resigns.",
        "17. Ne7+": "5 points was a good deal to be down.  Perhaps he hoped I wouldn't see it, a bad thing to count on from your opponents.  My position was very strong already, but now he cannot hope for me to blunder completely out of advantage."
    },
    "url": "https://gameknot.com/annotation.pl/english-vs-keres-move?gm=18407",
    "gameName": "English vs Keres move",
    "players": "mokru (1485) vs. mavod (1410)",
    "opening": "English opening (A20)"
}