{
    "moves": {
        "1. c4": "A long and tight game. ",
        "1... Nf6": "That was a thematic game, we decided both to explore two openings during a couple of games but the games are rated.",
        "2. Nf3 c5": "English opening . I do not like very much this opening, for it can lead to closed and complex situations with concentration of pièces on the center which i do not like at all. So, I'll try to evitate them. I think that my oponent prefers open games as well but he is far better than me in closed situations, so that he could choose this tactic. On the other hand, we play those game to experiment, so that everything can happen...",
        "3. Nc3 e6 4. g3": "I opt for a fiancheto variation.",
        "4... b6 5. Bg2 Bb7 6. O-O Be7 7. d4": "After the fiancheto, the center... At this stage my plan is to open the game as much as possible, so that I opt for an aggressive move.",
        "7... d6": "Black doesn't take and black 3 pièces to protect c5. The queen is in front of mine on the open file, so that he can choose between two options after 8.dxc5 (8. ... dxc5 or 8. ... bxc5)  and they would quickly lead in very complex situations which my opponent likes. Although I like them as well, I do not want to let him choose the line... So that...",
        "8. d5": "I could not see anything else to do. It seemed me the safest move and I didn't find any efficient attacking plan but I didn't like this move very much for my opponent would be able to block the game in the center which was exactly the opposite of my plan.",
        "8... exd5": "But black takes. Thank you Bwaa for having choosen this line.",
        "9. cxd5": "The other candidate move was 9. Nxd5 wether fo 9. ... Bxd5 or 9. ... Nxd5 but black was not obliged to take, for the knight menaces nothing important. So that I prefered to build a strong center by 10. e4",
        "9... O-O": "King in safe. White still has the initiative but black's counterattack can come very quickly because black can easily remove the c knight if he can bring his b pawn on b4. At least it was the danger, I felt exposed.",
        "10. e4": "I didn't like this situation very much but now I felt I had to protect the d5 pawn and try, so doing, to conserve the center's control, or to improve it, for if having a pawn on the 5th line blocks the opponent, the pawn is hard to defend. Now white's weak pawn is the e one. The c knight protect the two pawns and, in this condition is not reliable (even lancelot the brave has his limit.)",
        "10... Nfd7": "I didn't expect this move, for I imagined wether 10. ... Ba6 or 10. ... Re8. and even now, I'm not sure about it, for it lead to a line which went very dangerous for white (at middle term) but also dangerous for black. Anyway, the game was very funny and interresting.  It's a drawback move, which at first sight doesn't seem important but which proved to have very big conséquences on the rest of the game at long term.",
        "11. Re1": "It seemed the obvious move to do : protecting white's e pawn, the weakest piece on the center and settling a rook on the semi open e file.",
        "11... f6": "Creating a weakness on the kingside.",
        "12. Bf4": "To attack Black's d pawn which is the weak one.",
        "12... Ne5": "Black counters.",
        "13. Bxe5": "Trading, for I was sure that black would play13.... dxe6 which would have given me a passed pawn on d.",
        "13... fxe5": "But my opponent takes whith the f pawn, surprising me like he often does. I thought the move weakened to much the king so that black wouldn't dare to play it. Of course it's a very offensive position and black will now easily gain the initiative.",
        "14. Rc1": "At this point white changed his plan once again. I have to fully open and take control of the b1g8 diagonal and attack the king this way (Bwaa did the same to me two games ago, so that it was ok to show him that I learned the lesson he gave me) I estimated that black's attack on the f file was not that dangerous (wrong estimation). The rook is aimed at c4 where I want to bring my LSB.",
        "14... Na6": "Attack on the queenside and freeing the rook.",
        "15. a3": "To prevent Nb4",
        "15... Nc7": "Strange knight move. I didn't doubt that my opponent had planned it at least when playing 14. ... Na6 and probably before but I couldn't find where it lead and I didn't feel at ease.",
        "16. Bf1": "Carrying on the plan : bringing the Bishop at c4 but weakening the kingside defense.",
        "16... Qe8": "Defending e5 and indirectly, menacing e4",
        "17. a4": "To prevent 17. ... Nb5",
        "17... Qf7": "To menace 18. ... Qxf3. 19. Qxf3 Rxf3. but white has many pieces available to defend f3",
        "18. Kg2": "The two other candidates moves where 18. Be2 or 18. Bg2 but both would mobilise the bishop and my plan was still the same. The fact that the black queen was on f7 was still a better reason to carry on the plan : taking control of the a2 g8 diagonal.",
        "18... Bc8": "Annoying for white for it  permitted black to attack f3 with one more piece (19. ... Bg4) and I would have to mobilise my LSB (19. Be2) which would, furthermore block my e rook. Now black had definitely the initiative. I judged that I had defensive and counteroffensive possibilities but as white I should have been on attack (I can't play Re3 to protect f3 for if 19.e3 Bg5 and one of my rooks gets it).",
        "19. Nb5": "I estimated that I could counter 19. ... Bg4 by 20. Be2 and prefered to counterattack. The knight menaces black's d pawn if 19. ... Bg5 and if 19. ... Nxb5 20. Bxb5 and the c4 square is locked. This move also permits 20. Rc3, thus protecting f3. I'm not a defender and if the risk is on both sides, it's okay for me. ",
        "19... Bg4": "The risk is okay as well for my opponent for black prefers to attack than to deal with my knight.",
        "20. Rc3": "So that it was the other reason to have plaid 19. b5. Now I do not frighten 21. ... Bg5 and I can even play 21. Re3  Bg5 22. Rd3 thus overprotecting f3 without using my LSB.",
        "20... Ne8": "Black carries on his plan, blocking the game on the right wing and attacking with all what he cans on the left wing but white has superiority on the center and the black king is weakened so that, if I manage to resist the attack, I could quickly be very dangerous. ",
        "21. Be2": "First step of a complicated plan to occupate the b1 g8 diagonal and menace the king. To achieve his plan, white has to get rid of d6 and the  only way I found was to sacrifice the f knight by 23. Nxe5 dxe5 24.d6 menacing the DSB if 25. ... Bxd6 26.  Bc4 and white wins the queen. Or else black has to move his queen which has little place available and white can play 27. dxe7.\nBut to achieve this plan, white needs to protect f2 from 24. Nxe5 Qxf3 + so that the f1 knight must let his place to the rook by 21. Be2 ... 22. Rf1\nI resume : 21. Be2 ... 22. Rf1 (to protect f2) 23. Ne5 dxe5 24. d6 ... 25. Bc4. Of course black will play so that I''d probably need a couple of moves more. It almost worked so with two moves late.",
        "21... a6": "It had to come. Black's attack on the king side is countered, he tries something else.",
        "22. Na3": "Only place.",
        "22... Bd7": "Now black has definitely changed his plan and mobilises for an attack on the queenside.",
        "23. Nc4": "Now it's even better for the attack of e5 and it menaces 24. Nxb6 which black will surely counter wether by 24. ... Bd8 or by 24. ... Rb8. giving me one tempo to carry on the plan",
        "23... Bd8": "Right.",
        "24. Rf1": "So that white carries on his plan.",
        "24... h6": "Black sees the danger of 26. Ng5, menacing the queen if 25. ... Bxb6. But it's not white's plan.",
        "25. Nfxe5": "\"So, My brave knight go and fight in the melee... and die bravely...\"",
        "25... dxe5": "Almost forced move. White has regained the initiative at the price of one knight.",
        "26. d6": "The aim is still the b1 g8 diagonal. 26. Ne5 was another candidate move and probably better but I was still aiming at my diagonal.",
        "26... Qe6": "Black should probably have moved the queen away from the diagonal.",
        "27. Nxb6": "So I've traded one knight against two pawns for if 27. ... Bxb6 28. Bxc4 and the black queen is captured.",
        "27... Qh3+": "Of course, black has this counterattack available.",
        "28. Kg1": "Only move but black cannot carry on attacking.",
        "28... Rb8": "Menacing the b knight. Black has saved his rook.",
        "29. Nc4": "Only move to protect the b pawn.",
        "29... Qe6": "Now, black is one point ahead but has 3 isolated pawns and white has a protected passed pawn. Queen and King are still on the same diagonal (on which white couldn't set his bishop despite his efforts).",
        "30. b3": "To prevent Rxb2 and Qa2",
        "30... Bc6": "Black is again on attack. After taking place on the kingside and on the opposite wing, the fight is now on the center.",
        "31. Na5": "Attacking c6 and permitting 32. Bc4 ",
        "31... Qd7": "Black prevents both menaces.",
        "32. Bg4": "White's plan is not the b1 g8 diagonal anylonger. It's to do as much damage as possible on the center as his pièces are well developped and black's one are now cramped. The d pawn is a catterpillar which surely will be eaten by a black bird before transforming in butterfly but he has caused troubled and won't die alone.",
        "32... Qxd6 33. Qxd6": "White is almost obliged to accept the trade in order to conserve the initiative. Trading normally advantages the one with the material advantage but in this case, with a far better pawn structure, I estimated that I had good chances in an endgame.",
        "33... Nxd6 34. Nxc6": "Now, white has material advantage.",
        "34... Nxe4": "Material equality but white has a better position due to the pawn structure and the rooks which can be easily doubled.",
        "35. Re3 Rb6": "To menace both the b pawn and the knight.",
        "36. Nxe5": "Black must abandon one more pawn. At this point, another developpement begins. The first melee is over and no pièces will be taken during the next 6 moves of positional chess. During the next 13 move there will be only two pawns taken.",
        "36... Nf6": "Black regroups his forces.",
        "37. Bd1": "To liberate the e rook from the \"ward of b3\" mission. White needs to reorganise his troops as well. ",
        "37... Rd6": "Taking control of one open file.",
        "38. Nc4": "Securing a knight on the center.",
        "38... Rd4": "Black wants to keep control of the d file.",
        "39. a5": "To prevent a5. i want to take pawn a6 and it's easier if it stays on a white square.  Of course, it implies to have a pawn on a black square undefendable by his knight. But white has the advantage now and an exchange wouldn't be so bad.",
        "39... Nd5": "Black takes control of the center and is on attack again.",
        "40. Re6": "To menace a6 and stay on the open file.",
        "40... Nb4": "A good place for the knight.",
        "41. f4": "Weakening the kingside but aiming at the center. I judged that if black set his bishop on d4, I could simply move my king on a light square.",
        "41... Rd3 42. Rfe1": "Doubling the rooks on the open file. White is getting slowly a good offensive position.",
        "42... Bf6": "To bring the bishop on d4.",
        "43. Bh5": "Now, the pièces seem to be ready and white has a plan to attack the king.",
        "43... Bd4+": "It had to come",
        "44. Kg2": "The king is not very safe but he can hide on h3 and it will be hard for black to attack him. I think that it's at this stage that black proposed a draw, which white refused.",
        "44... Rxb3": "Material equality. I suppose that black planned 45. Nd3 and the 3 black pièces grouped can be very dangerous when working together so that white had better to pay attention.",
        "45. Bg6": "White follows his plan : I saw 3 possible lines : one was to attack the king by bringing the knight on e7 (it would take at least 3 moves). The other one was to take black's a pawn and advance white's one, forcing an exchange against a rook. the third one was the mating menace by 46. Re8 Rxe8 47. Rxe8 but black was not obliged to trade the rooks so white has to force the exchange.",
        "45... Nd3": "Black attacks but his a pawn is now unprotected.",
        "46. Re1e2": "The 2 rooks have to stay on the e file and there are few places.",
        "46... Nb2": "to attack the knight.",
        "47. Nb6": "Menacing Nd7 to force the black rook to move.",
        "47... Nd1": "To block the e file by Ne3 ",
        "48. Nd7": "Menacing to take the rook.",
        "48... Ne3+": "Attacking the king but more important disjoining the rooks on the e file.",
        "49. Kh3": "Safe place.",
        "49... Rd8": "Chasing the knight",
        "50. Rxa6": "If 50. ... Rxd7 51. Ra8+ Rb8 52. Rxb8 Rd8 53. Rxd8 #",
        "50... Rb7": "Only move to chase the knight.",
        "51. Ne5": "If 51. ... Bxe5 52.Rxe3 menacing the knight. 53. Re6 menacing mate withe the 2 rooks joined on the e file.",
        "51... Rc7": "To protect the c pawn.",
        "52. Re6": "When playing this move, it seemed ok because it allowed a threat of mate by having both rooks on the a file and it permitted 53. a6 ... 54. Nc6. But it also enable a far better moves, which I think unavoidable for black but I didn't see it at first.",
        "52... Kf8": "My opponent said he had little time to think about this move and hoped he wouldn't regret it and there I finally saw the move to make.",
        "53. Nc4": "! If 53. ... Nxc4 54. Re8+ Rxe8 55. Rxe8#",
        "53... Re7": "Black had little else to do.",
        "54. Rxe7 Kxe7 55. Nxe3 Kf6": "To menace the LSB and quit the e file.",
        "56. Bc2": "To keep the control of the b1 h7 diagonal and not being harassed by the king.",
        "56... Ra8 57. Nd5+": "Now, white's plan is to send the black king back again in his corner and give the mate using he a pawn.",
        "57... Kf7": "Only move",
        "58. Re7+ Kf8": "Now, the black king is blocked again",
        "59. Bg6": "if 59. ... Rxa5 60. Re8+ mate Black must keep his rook onthe 8 line",
        "59... c4 60. Rf7+": "To force the black king to go to g8",
        "60... Kg8": "If 60. ... Ke8 61.Ra7+ ... 62. Rxa8",
        "61. Ne7+": "To oblige the black king to go on h8 (so that it cannot escape)",
        "61... Kh8": "No choice",
        "62. Nc6": "To attack d4 and, more important, to control a7 were the a pawn has to go.",
        "62... Bf6 63. a6": "Now, advance the a pawn",
        "63... c3 64. a7 Kg8": "Black hopes a blunder (which can happen). If 65. ... c2 66. Bxc2 KxR",
        "65. Rb7": "Now, thereis a forced mate in 3.",
        "65... c2 66. Rb8+": "Classical attack with Rook and pawn against rook.",
        "66... Bd8": "Black fights till the very end.",
        "67. Rxa8": "Mate in one",
        "67... c1=Q": "The queen is not dangerous on this square for it cannot attain the 8 line in one move.",
        "68. Rxd8#": ""
    },
    "url": "https://gameknot.com/annotation.pl/english-w?gm=50250",
    "gameName": "english (W)",
    "players": "ptitroque (1706) vs. bwaa (1760)",
    "opening": "English opening (A15)"
}