{
    "moves": {
        "1. e4": "Evan's gambit accepted. This game shows the danger of letting the center of the board be controlled by white. With accurate play, black can come out stronger, but not in this game. The more the end nears, the more complex the game becomes. Pay special attention to moves 17-21. I hope you enjoy.",
        "1... e5 2. Nf3 Nc6 3. Bc4": "Hoping for 3..Nf6, so white could play 4.Ng5 (Fried liver attack)",
        "3... Bc5": "Ah well, Evan's gambit it is, then",
        "4. b4 Bxb4": "Accepted",
        "5. c3": "Because of this sacrifice, white gains a tempo, and is aiming for control of the center.",
        "5... Ba5": "Also possible would be 5..Be7",
        "6. d4 exd4 7. Nxd4": "If black takes, the queen takes back, with two threats: 8.Qxg7 and 8.Qe5  followed by 9.Qxa5",
        "7... Nge7": "Not sure what this accomplishes, the pawn on e4 is stopping the knight from advancing to the centre, blacks Queen is boxed in, and a move to g6... well?",
        "8. O-O": "Freeing the King of the Bishop pin, and bringing the guy to safety",
        "8... O-O 9. f4": "Because of the knight on e7, white isn't too scared to develop his f-pawn and take control of the center even more.",
        "9... d6": "Making way for the Bishop.",
        "10. Qf3": "The idea is to launch an attack on the king-side, using both Rf1 and Qf3. Tempo is very important in this game, because white has to win back the lost pawn. When black is ready developing, whites advantage will be lost. Somehow I feel this move isn't accurate enough though... If anyone has ideas (Qh5?), please let me know.",
        "10... Bb6": "Pinning the knight and setting an exchange which gives black a pawn extra, with an extra attack on the a1 Rook to boot",
        "11. Be3": "Only way, other then retreating the Queen or f-Rook.",
        "11... Kh8": "Here blacks plan for taking back the centre is revealed: when the f-pawn can be advanced to the strong f5, Whites centre is quite weakened. There is one big flaw here, which will be exploited for the rest of the game: Black's Bishop on c8 is not yet developed, which keeps the Rook on a8 from entering the game.",
        "12. Nd2": "White thinks development is crucial to a win, so the knight enters the game, connecting the Rooks, freeing a1. Only one problem to deal with: the f-pawn",
        "12... f5": "There it is.",
        "13. Ne6": "There is one big weakness about pawns: They cannot take a step back. With this move, white forces black to take with the Bishop...",
        "13... Bxe6 14. Bxe6": "Giving Be6 a luxurious position. This strangles blacks movement quite a lot. not the least of all the Queen!",
        "14... fxe4": "I can hear black shouting: I NEED SPACE!",
        "15. Nxe4": "And yet another piece getting active in the attack. If I were black, I would exchange the Bishops now...",
        "15... Ne5": "Nice move, because white can't take back with the pawn (Rf8) and thus has to move the queen to a safe spot",
        "16. Qh3": "Now the attack is turned around: Black has to move the knight",
        "16... Nd3": "Attacking the f4 pawn, while Bb6 keeps the King blocked. It seems black has some nice options now...",
        "17. Bxb6": "Biggest problem first...",
        "17... Nxf4": "This is a big mistake from black: It seems he can take the bishop in the next move, winning a pawn at the end. However, a winning position is also defined by the number of ACTIVE pieces in the field. Ra8 and Qd8 are doing nothing... so, how to exploit this?",
        "18. Rxf4": "Remove the most active piece!",
        "18... Rxf4": "Taking the 'bait'. The rest of this game is forced (though quite complicated).",
        "19. Ng5": "Threat of Qh7#, and Nf7 Royal Fork.",
        "19... h6": "Forced, But black can't take the knight.",
        "20. Bd4": "This should teach black to take back when you can. Bd4 is the most threatening piece on the board now. Qxh6  is an option now. Take a look at blacks and Whites possibilities.... none good for black without loss of material. If you see any other option, let me know",
        "20... Rxd4": "Royal Fork, here we come!",
        "21. Nf7+": "And black resigns. I Hope you enjoyed."
    },
    "url": "https://gameknot.com/annotation.pl/evans-gambit-accepted?gm=4804",
    "gameName": "Evan's gambit accepted",
    "players": "exar (1487) vs. claudiocordeiro (1582)",
    "opening": "Evans gambit (C52), compromised defence"
}