{
    "moves": {
        "1. e4 e5 2. Nf3 Nc6 3. Bc4 Bc5": "All standard enough.",
        "4. b4": "!?   The Evans Gambit.   Probably objectively not sound, but at the board, what a computer thinks is often irrelevant.",
        "4... Bxb4": "I think black is usually best served accepting the gambit; if the bishop goes to b6, it can end up shut in completely after a c3 and d4 push.",
        "5. c3": "However, now white gets in c3 with tempo.",
        "5... Ba5 6. d4": "The point of the Evans Gambit.   White, for the sac of a pawn, stakes a large claim in the centre.   Black's DSB, meanwhile, isn't really in the game.",
        "6... exd4 7. Qb3": "I think this may be the main line.   f7 is under threat.   Black, however, could at some stage take on c3 with discovered check threats.",
        "7... d5": "?  7. … Qe7 or Qf6 is called for here, to defend f7.   d5 ideas aren’t uncommon in some gambit lines (like the Bertin Gambit in the King’s Gambit); the idea is to give back some of the material gained to develop quicker.   It doesn’t really work here though; it’s basically a free pawn, and with the knight on c6, it’s doubly dangerous for black.",
        "8. exd5": "!?   Probably better than BxP; the knight is going to get kicked to an awkward square, and the threats against f7 haven't gone away.",
        "8... Qe7+": "This looks natural – the king must move, forfeiting castling rights (9. Be2 is met with d3, winning the pinned piece).   In actual fact, it’s the start of quite a ride for black!",
        "9. Kd1": "There was a debate after the game as to the best square for the king here - safety on f1 followed by developing while hitting the queen with Ba3, Nd2 and Re1, or this move, allowing the immediate threat of Re1 in addition to the problem of the hanging knight.   After a minute’s thought, Fritz rates Kf1 0.17 better, but white has a clear advantage here either way (+3 or so).",
        "9... Ne5": "A blunder.   After 10. NxN, the white knight is immune from capture due to the Re1 pin.   Best here was 10. dxc, says Fritz.",
        "10. Nxe5 dxc3 11. Qb5+": "Looks like it wins a piece, but doesn't because...",
        "11... Kd8": "Now the queen can capture the knight, and Re1 doesn't work.   So instead...",
        "12. d6": "! Protects the knight, opens up a line for the bishop onto the weak f7 square, threatens to take the bishop on a5 AND hits the queen.   What more can you ask of one move?",
        "12... Bg4+": "A desperate spite check; anything to get some pieces developed.",
        "13. Kc2": "!   Again, the strongest.   Black’s checks are going nowhere, and the knight is in too fine an attacking position to consider wasting time capturing the worthless black bishop.   White is after black's king, and isn't about to be distracted.",
        "13... Bf5+ 14. Kb3": "The king is quite safe here.",
        "14... a6": "?? An unfortunate way to end a nice miniature, though black was lost anyway.",
        "15. dxe7+": "Black must get out of check, and white can save his own queen.   Black was lost anyway - if instead 14. ... Qe6 or Qh4, there follows 15. NxP+ Kc8   16. Qe8+ Qd8   17. QxQ#   If 14. ... QxP, Nxf7 is a nice family fork - queen, king and rook.   14. ... PxP is probably best, but white can play 15. Nxf7+, and both black bishops are going to fall, depending on where black moves his king."
    },
    "url": "https://gameknot.com/annotation.pl/evans-gambit?gm=45094",
    "gameName": "Evans Gambit",
    "players": "MM (Unr) vs. JC (1122)",
    "opening": "Evans gambit (C52), compromised defence"
}