{
    "moves": {
        "1. d4": "and today i hosted a game 3 day / move as black 1450-2000 rating and he joined for a 4th rematch. the pressure was on. one of my big rivals i have to even the score here!",
        "1... e6": "and so i go with what i find to be my strongest black start against d4 openers, e6.  this Game will demonstrate the importance of time in chess on a few occasions. and the importance of always looking at all moves possible.",
        "2. e3": "hmm last 5 times i played e6 vs d4 i was immediately faced with e4, this more passive approach really delights me",
        "2... d5": "and so i follow through with d5",
        "3. Nf3 Nc6": "i decide to play this to throw him off. im pretty sure he expected c5 but i have plans for my c pawn and this prevents his knight from going to rest on the e5 square.",
        "4. Nc3": "i expected his other knight over his LSB development. im pretty sure he wont be careless with his lsb.",
        "4... Bd6": "and so i place my DSB on my favorite diagonal instead of developing my other knight.",
        "5. Bd3 Nce7": "i personally thought that his e3 move and his bishop move to d3 allowed me to play this following sequence",
        "6. O-O c6": "strengthen my d pawn in anticipation of his e4 and create an opening for my bishop if he decides to push by instead of exchanging on the d file.",
        "7. e4": "anticipated. i now have another time gain. i decide to use it to reinforce my defensive position. to solidify a future mid and prevent the e5 push",
        "7... f6": "and so i play this. i thought it also greatly restrains his knights movement",
        "8. exd5": "decides to exchange instead of passing by. this delighted me it opens up the resting spot for my e knight again and strengthens mid.",
        "8... cxd5 9. Re1": "i thought he would eventually play this. im probably not the only player accustomed to facing this rook slide over.",
        "9... a6": "decide to further setup a defensive structure. i still havent decided if im king side castling. time seems not to afford it at the moment.",
        "10. a3": "starts his pawn push",
        "10... Bd7": "cover the b5 square",
        "11. Ne2": "hmm unanticipated retreat",
        "11... Nc6": "this finally allows knight to go back to c6",
        "12. b3": "alright hes changing back and forth which pawn he wants to push",
        "12... e5": "i can finally start attacking mid",
        "13. dxe5 Nxe5": "i was trying to force a knight exchange that knight on f3 is bothersome for DSB dives.  but i also have to be careful of the blind check from the rook",
        "14. Ned4": "damn he fully exploits that situation.",
        "14... Qb6": "huge mistake by me.  c7 was by far the better square of choice",
        "15. Be3": "it immediately invites be3 and i dont really have an attack with my queen from this square man this is a big concern.",
        "15... Nxf3+": "and so i take the oppurtunity to take off the bother some knight and thought he would take back with his queen and i would castle long and it would solve alot of problems.  but right away as i played this i saw that if he takes with his knight it can be an annoying situation and he would still have a knight posted on f3.",
        "16. Qxf3": "thankfully he played like i anticipated and it allowed for my long castling",
        "16... O-O-O": "alot of pressure gone",
        "17. Nf5": "forces my queen retreat i was dissapointed now with my losses of time before he can trade out my DSB if he wants",
        "17... Qc7": "so i still set up on the same diagonal",
        "18. g3": "hmm doesnt swap out my DSB so im pretty sure hes eyeing for my g7 pawn. and for some reason for the last 3 moves i missed and so did he miss my hanging pawn on d5",
        "18... Bc6": "and so i thought this was the appropriate reply.",
        "19. Nxg7": "my opponent blunders here i believe probably not anticipating my LSB move i think he played too quick. for me i took a second to look if that is what he wanted me to do. i couldnt see any threats come if i did.",
        "19... Qxg7": "and so i accept and now my queen is set up for a deadly attack on his king.  this entire game i kept thinking about a recent comment i read by Ion,  that often when kings castle on opposite sides of the board the one who often attacks first is often the victor.  and the tempo i lost with my qb6 move earlier.",
        "20. Ba7": "sorta anticipated as it creates alot of pressure around my king. but i do not plan on ever moving the b and a pawn unless forced to. so i dont know if this is a time gain",
        "20... Nh6": "i decide to develop my last minor piece and cover the dangerous attacks that can come from f5 and connect my rooks. i thought this to be a pretty good move here.",
        "21. Re6": "threatens the f pawn",
        "21... Rhf8": "thought this was the proper reply",
        "22. Qe2": "i can see a dangerous attack coming if he dives his bishop",
        "22... f5": "but i thought time was on my side so i procede with my attack which is also a time gain on his top right rook i thought",
        "23. Rb1": "he decides to stay within the ranks of my king i wonder if rc1 is better. yes it invites qb2 but i dont think it would be wise to send my queen up there at this stage",
        "23... Rfe8": "huge time loss by me. sigh i was supposed to just play f4 here. this might throw me on the defensive again. but atleast it creates pressure on his queen and i can choose to displace her if i want to.  trading here for him is a loss of tempo on his queen i believe.",
        "24. b4": "comes down. im happy he has to come down with 2 pawns this gives me alot of time to recooperate from my time losses",
        "24... f4": "and so i still decide to move forward with my pawn",
        "25. a4 d4": "i decide to protect my d pawn in anticipation to his b5 in case i decide to swap out rooks",
        "26. b5 axb5": "here i think im forced and i think he wouldve been wiser to take with either the bishop or the rook lol having quadruple coverage on the square. i was really hoping he would take with the pawn and this would buy me all the time i would need to attack",
        "27. axb5": "game costing mistake i believe here",
        "27... Bd7": "pressure on the rook have to keep covering the e square. he cant take my DSB unless he wants to lose his Queen",
        "28. Re4": "perfect. same scenario as below he cant take the d pawn and my plan was to take with my f pawn anyway to start my attack. this only invites fxg3",
        "28... fxg3 29. fxg3 Bxg3": "bang. i think his misstep with his knight earlier is also something that bought me a lot of time this game.",
        "30. b6": "hmmm un anticipated reply but this doesnt create more pressure around the king for a while",
        "30... Bh3": "so i can now send in my other bishop",
        "31. Ba6": "i can ignore that and let him take my pawn with his LSB, if he wants, and my king will be perfectly safe recapturing on b7 protecting himself.\n\nnow i still had a hard time seeing the proper play from here lol even with all the pressure.",
        "31... Bf2+": "i believe this is the right move. it causes a loss of queen or a checkmate.",
        "32. Kxf2": "decides for the queen loss",
        "32... Qg2+ 33. Ke1 Rxe4": "opponent resigns.  a free queen and his entire attack has also petered out. and the following rook would shortly drop also and then he would also have a hanging lsb.  i hope you all enjoyed the game.  tied with my highest rated beaten opponent ill take it! 2-2"
    },
    "url": "https://gameknot.com/annotation.pl/evening-the-score?gm=59218",
    "gameName": "Evening the score!",
    "players": "banditmysweetdog (1695) vs. trixstermtl (1535)",
    "opening": "Queen's pawn (A40)"
}