{
    "moves": {
        "1. e4": "So this is the third and last in my trilogy of losses in over the board games by my friend Knight_nite",
        "1... e5 2. Nf3 Nc6 3. Bb5": "So once again it starts as a Ruy Lopez.",
        "3... a6": "Once again, black plays the Morphy Defense",
        "4. Ba4": "Bishop drops back.",
        "4... b5": "4....Nf6 is normally played here, and this move is normally played later.",
        "5. Bb3": "The only square for the bishop, obviously...",
        "5... h6": "Played no doubt to stop Nf3-g5 with a double attack on f7, but black has no need to waste time like this -  Nf6 6. Ng5 d5 7. exd5 Nd4! is good for black, but not Nxd5?? 8. Nxf7 with advantage to white - compare with the Two Knights Defense, Fried Liver Attack https://en.wikipedia.org/wiki/Two_Knights_Defense,_Fried_Liver_Attack\n5....Bc5 is also better than 5....h6 - the Nf3 can't go to g5 as the black queen guards the square and if say 6. O-O Nf6 7. Ng5 O-O and black has nothing to fear.",
        "6. Bd5": "This move sets black interesting problems.",
        "6... Nge7": "I like this move.",
        "7. Nxe5": "Now black can't recapture on e5 without losing the Rh1, but black can capture first.",
        "7... Nxd5": "Like so, and now if exd5 black simply takes on e5.",
        "8. Nxc6": "So this is forced. The black queen is now attacked.",
        "8... dxc6": "So black recaptures.",
        "9. exd5": "And so does white.",
        "9... Qe7+": "Black throws in a check before recapturing the pawn.",
        "10. Qe2": "White blocks.",
        "10... Qxe2+": "Black takes.",
        "11. Kxe2": "White takes back.",
        "11... cxd5": "And black restores material equibrium. ",
        "12. Re1": "Sensibly developing the rook to the only open file. Fritz is giving black a small edge - presumably because of the two bishops in a fairly open position - but I think this is very even.",
        "12... Be6": "I don't really like this move as it blocks the e file.",
        "13. Kf1": "Moves the king to a safer square, and opens up the e file for the Re1 - but I would be tempted to develop in this position, say d4. If it looks like all the rooks are going to be exchanged on the e file, d3 or f3 may be better squares to put the king.",
        "13... Bc5": "Black develops.",
        "14. Nc3": "So does white.",
        "14... O-O": "This seems a natural move to me, but Fritz prefers 0-0-0 or Kd7.",
        "15. d3": "Excellent move, preparing to develop Bc1.",
        "15... Rfe8": "Black is playing well too, neutralising the influence of the Re1.",
        "16. Bf4": "Another good move, developing the Bc1 and also attacking c7.",
        "16... c6": "So black naturally moves the c pawn to safety.",
        "17. Ne2": "White moves the knight towards the king side. Fritz prefers the simple a3 or h3. I can't help thinking that all the rooks should be exchanged down the e file and draw agreed - but that is not what happens.",
        "17... g5": "Black attacks!",
        "18. Be5": "Bishop takes up central position - clearly the best square.",
        "18... f5": "Black continues with the pawn thrusts.",
        "19. Ng3": "White tries to get his knight in amongst the squares weakened by the pawn advances. Fritz prefers d4 or f4 or a4 or Nd4 with minimal advantage to black.",
        "19... f4": "Black continues pushing.",
        "20. Nh5": "And white correctly advances the knight rather than retreat. White is now threatening Nf6+ forking king and rook.",
        "20... Kf7": "So black stops that.",
        "21. Ng7": "So knight comes in here instead.",
        "21... Re7": "Black should keep the rook on the e file.",
        "22. Nh5": "Now white is just wasting time by retreating the knight. 22. Nxe6 or 22. d4 followed by 23. Nxe6 amd the position is level, and that is the best white can hope for. Retreating gives black the clear advantage.",
        "22... Kg6": "Black correctly attacks the knight and there is no good way saving it. Here Fritz recommends making the best of a bad job with 23. Nxf4 gxf4 and 24. Bxf4. White has only two pawns for the piece and black is clearly winning.",
        "23. g4": "White tries to defend the knight.",
        "23... Bxg4": "But black just takes it.",
        "24. Nf6": "White attacks the bishop.",
        "24... Be6": "Bishop retreats to a strange square, blocking the e file.",
        "25. d4": "White attacks the bishop.",
        "25... Bh3+": "Black throws in a check, but seems to have wasted a move in the process. Why didn't he play this last move?",
        "26. Ke2": "This is a massive blunder by white. Simply Kg1 was much better.",
        "26... Bb6": "Luckily for white, black doesn't notice that the Be5 is now pinned, so 26.....Bxd4 was possible.",
        "27. Kf3": "White breaks the pin.",
        "27... Kf5": "Now g4+ is a massive threat, pushing the white king back to e2 so that ....Bb6xd4 become an option again. 28. Rg1 was the best defence for white,  but it still would have been very difficult for white.",
        "28. Nh5": "This knight struggles to get back.",
        "28... Bg4+": "Black picks up the stray knight, but even better was 28.....g4+ 29. Ke2 Bxd4",
        "29. Kg2": "This move is forced.",
        "29... Bxh5": "Now white is a piece and a pawn down. White bravely fights on, but the game is lost.",
        "30. Bd6": "White attacks the rook, but by offering exchanges white rather makes it easier for black.",
        "30... Rxe1": "So one rook comes off.",
        "31. Rxe1": "And a black one too. ",
        "31... Re8": "Black correctly contests the open file.",
        "32. Rh1": "Just leaving the open file in black's control can't be right. 32. Rxe8 or 32. Re5+ was better.",
        "32... Bxd4": "Another pawn goes. It is hard to suggest moves for white. Fritz gives this as nearly plus 10 for black. I think the next few moves can be passed over without further comment.",
        "33. f3 Re2+ 34. Kf1 Rxc2 35. h4 Rc1+ 36. Kg2": "In this position black had the sacrifice 36.....Bxf3+! which mates in 7. ",
        "36... Rxh1": "But this is mate in 8...",
        "37. Kxh1": "White takes back.",
        "37... gxh4": "Another pawn goes.",
        "38. Be7": "Black attacks a pawn.",
        "38... Bxf3+": "Another pawn goes with check.",
        "39. Kh2": "Forced!",
        "39... Bxb2": "Another pawn goes and white decides to call it a day.\nSo the main reason why white lost - his knight went on a little trip up the board. White should have exchanged it for the bishop and reached a level ending, but instead he tried to pull it back, and had to start surrendering material to save it. To an extent white rode his luck and black missed opportunites to win quicker, but eventually his luck ran out.\nMany thanks for reading, please rate it on the star system and leave a comment or two to let me know how I am doing. Until next time dear reader!"
    },
    "url": "https://gameknot.com/annotation.pl/evening-league-chess-game?gm=63733",
    "gameName": "Evening League Chess Game",
    "players": "Knight_nite  vs. His opponent ",
    "opening": "Ruy Lopez (C70), Graz variation"
}