{
    "moves": {
        "1. d4 Nf6 2. Bf4 c5 3. e3": "Of course, d5 is also a good move.",
        "3... e6": "This is exactly the asset I would have chosed with black pieces... and so I did the next game. Now, my idea here was dxc5, Bxc5, Bd6. It goes for early exchanges and a step to a draw. Black has to exchange pieces to unravel his position and castle. I didn't play it because it was \"too obvious to be good\". ",
        "4. Nf3 b6": "...In this position, as black, I'd prefer to play Qb6. Not that the threat on b2 is a real one, but forces white to defend. As white, when black moves the c pawn, I move c3 at once, so to be able to answer with Qb3. But I didn't this time, and Qb6 would in fact have been annoying. But not this one! The text move tells my that I have to be very careful with the white diagonal, but this is just normal. ",
        "5. dxc5 Bxc5 6. Bd6": "I can't resist anymore. The counterthreat black has is that after BxB, QxB, he can play Ne4, kicking my Q away. But I can go Qb4 or Qh3 and it doesn't seem my Q is in inmediate danger. ",
        "6... Bxd6 7. Qxd6 Bb7": "Good! Not Ne4 is played. So I prevent it. ",
        "8. Nbd2 Qe7": "Of course, looking for a Q's exchange, even losing the castling rights. Of course, Qc7 is followed by BxNf3, and I don't win a piece. I have to retake the B (or Qc8+, Qd8, with not much of an advantage).",
        "9. Nc4": "...but now, I am sure the Q's will be exchanged, so I can press a little more. He can't take my Q (NxQ+ forks his B). So I expected him to play BxN, but not...",
        "9... Nc6": "I couldn't believe it, so I didn't see here Qc7 was best. If Rb8, Nd6+ and I win the B. ",
        "10. O-O-O": "...and now I build some pressure on d7. ",
        "10... O-O-O 11. Qxe7 Nxe7 12. Nd6+ Kb8 13. Nxf7": "I missed an even quicker win, but still I'll get the exchange, and a dream position to play on. He resigned. Somewhat too early. "
    },
    "url": "https://gameknot.com/annotation.pl/even-shorter?gm=64363",
    "gameName": "Even shorter!",
    "players": "damafi (1605) vs. titussonnet (1681)",
    "opening": "Queen's pawn game (A45)"
}