{
    "moves": {
        "1. e4": "I altered my annotation a little bit so that people won't try to make corrections (marinvukusic) he must've just thought that I was a weak 1200 and he could say whatever he wanted without much thought, but I'm confident I could beat him and his corrupted analysis if he really analyzes the way he did.  Well almost all of his corrections were wrong. Amazing how I can do this with a simple G/20 game. I had to alter my annotation because I haven't won 5 games yet so I can't comment yet. My ego was offended by misleading comments, please forgive that I had to correct them.",
        "1... c5": "sicilian defense, my favorite opening to play on either side.",
        "2. c3": "The alapin variation. In my preparation, this line is always a slight advantage for white, not sure if winning. If you're having trouble against the sicilian, then I recommend this opening as the easiest way of dealing with sicilian. If you like to attack and tactically overwhelm your opponent then play open sicilian. I used to play it and still occasionally do.",
        "2... Nf6": "Many consider this to be the sharpest response to the Alapin variation. Almost any 2700  fide GM plays only this line when faced with the Alapin.",
        "3. e5": "Any other move gives black, at the least, easy equality. ",
        "3... Nd5": "Only reasonable move, puts the knight in the center. If Ne4 then d3 traps the knight.",
        "4. Nf3": "Develops, but doesn't commit to immediate d4.",
        "4... Nc6": "Nice flexible move",
        "5. Bc4": "I don't play d4 early so that I can play this kind of variation, a favorite of GM Tiviakov (fide about 2700)",
        "5... Nc7": "Nc7? He may of just wanted to get me out of my repoirtoire but in any case this move is bad and I will take advantage of the terribly placed knight. There was no need to lose a tempo and put it there. Nb6 or e6 would have been better. ",
        "6. O-O": "Before castling I considered Bxf7  but then I realized that it doesn't work(Bxf7 Kx Ng5 Ke8 Qf3 Nxe5) was my analysis after about 10 seconds. So o-o seems best here. If d5 here then exd6 is slight advantage for white.",
        "6... e6": "If he wanted to play e6 then why put the knight on c7? At least he is doing something.",
        "7. d4": "Now I complete my center and make plans to complete my development.",
        "7... d5": "I suppose he wanted to complicate the game but this further downgrades his position, he's taking away the mobility of the knight on c7. Better was probably cxd4 cxd4 d6. exd6 gave a nice advantage to white also but Bd3 is more precise and actually exploits my advantage faster.",
        "8. Bd3": "I considered taking with exd6 but after about 30 seconds of analysis, Bd3 made sense, puts my bishop on a nice attacking diagonal and lets him self-destruct, since he occupies the d5 square with a pawn now. In general all of my pieces will become better than his. His Knight on c7 and Bishop on c8 and Q on d8 will take many moves to develop effectively if at all. His best piece is his knight on c6 which has a little pressure on d4 and e5.",
        "8... c4": "He's trying to make some progress on his queenside play, but he'll have to face it soon, just how bad the combined moves of Nc7 and d5 really were.",
        "9. Bc2": "Keeps my bishop on the strong diagonal.",
        "9... Be7 10. Ne1": "Preparing to play f4 and bring yet another piece into play, my rook. In fact the Ne1-f4 combo is what I need to bring all of my pieces into play.",
        "10... O-O 11. f4": "everything will fall into place now, like his checkmated king. Qh5 was also good. G/20 game made Good moves. Also if black plays f5 here then Rf3-h3 will lead to the crush. If you ever intend to challenge my analysis then please provide a well thought out variation by both sides. High rated player's comments often influence people's ratings of annotations.",
        "11... f5": "He attempts to stop my progress on my attack. A reasonable try, it blocks out my c2-bishop.",
        "12. exf6 e.p.": "I had to take, not only does this open up my bishop but it gives my knight a square, e5.",
        "12... Bxf6 13. Nf3": "I thought about some Bxh7 sacrifices for about 5 seconds, but there is no way anything like that can work right away. Basic attacking theory says that I need more pieces in the attack then he has defending, or other preexisting advantages.",
        "13... Bd7": "I thought he was trying to play Be8 maybe, but this position isn't holdable. If you say this is holdable please respond to what I did in the game also considering the additional threats of Qh5, or h4-h5. In general any tactical GM would agree that this is \"of course \" better for white. At least that's what my IM(international master) friend said. Also Rybka(world champion comp engine) agreed that this is really good for white when handled the way I thought and did.",
        "14. Nbd2": "I played this because I was thinking to play Ne5 Bxe5 fxe5 Rxf1 Nxf1 but this move is useful for some other things too.",
        "14... Ne8": "He wanted to bring his knight to g7, but again I just need to make progressive moves and all of his waste moves will come into light.",
        "15. Ne5 Nxe5": "I think Bx was better since he would be able to eliminate my attacking rook, but I'm not sure. In any case white is much superior.",
        "16. fxe5": "Opens the file.",
        "16... Be7 17. Nf3": "Look there, all of my ideas have been consistant and position continues to improve, bringing yet another piece to an active square. ",
        "17... Nc7": "I guess he changed his mind and decided that his bishop would be better on e8  than his knight, but whatever I don't care what he does, this position will collapse one way or another for him.",
        "18. Qe1": "Getting my queen into the attack.",
        "18... Ne8": "I guess he changed his mind again and wanted to bring his knight to g7 for sure this time. It was G/20 but he still had like 11 minutes when he played that.",
        "19. Qg3": "The point of Qe1. From here I have lots of options like Ng5, Bh6, Qh3, Be3, h4 anything is possible with this great of a position.",
        "19... g6": "g6?? maybe he could've done that earlier, but the win is clear to me now.",
        "20. Bxg6": "!!",
        "20... hxg6 21. Qxg6+ Ng7 22. Bh6 Rf7": "If Bf6 was played, then just Ng5 which would threaten Qh7.",
        "23. Ng5": "Ng5 anyways threatens both the Rook on f7, h7, followed by g7. Usually not a good thing to be missing all ur kingside pawns when your king needs them.",
        "23... Rxf1+": "I don't know what mavin meant by \"significant \" advantage.  But my advantage was surely exploitable and so it was. If you want to challenge my analysis, please learn how to attack or defend, or learn how to play chess at Fide Master level, thanks mavin. I think that will help you with your assessments of positions. Anyways message me any questions and I will be glad to help with whatever it is.",
        "24. Rxf1": "Here there is nothing he can do. I have mate in 1. ",
        "24... Bxg5 25. Qxg7#": "Mate this game just goes to show how every move counts. It just goes to show how 2 or 3 errors can get crushed with brilliant tactics. Sometimes chess is simple, just make moves that make good sense and have consistent ideas. A little opening knowledge and tactical ability can't hurt either though right? =)"
    },
    "url": "https://gameknot.com/annotation.pl/every-move-counts?gm=11828",
    "gameName": "Every Move Counts",
    "players": "Chess Tablebase (2228) vs. ICC player (2190)",
    "opening": "Sicilian (B22), 2.c3, Heidenfeld variation"
}