{
    "moves": {
        "1. d4 Nf6 2. c4 c5": "One of the most annoying replies for any Benko player is 3. Nf3 here. Probably the best reply would be to capture on d4 and transpose to an English or Sicilian, but if you make the mistake of playing 3...e6, White has conned you into playing the Benoni, which is far less fun for Black.",
        "3. d5 b5 4. cxb5 a6 5. bxa6": "Some players advocate 5. b6 here, giving back the pawn to reduce Black's activity. It kills the fun for the Benko player but it really doesn't promise much for White.",
        "5... g6": "Playing this before Bxa6 is rather important and if you ever give the Benko a try, or you play it as White and Black neglects to play the precise move order, you should know that after 5...Bxa6 White can play 6. b3! and solve a lot of problems early on.",
        "6. Nc3 Bxa6": "This is the main tabya of the gambit. Personally, I'm not a fan of gambits, but someone would make a list of the most respectable and sound gambits, the Benko would be pretty up on the list. Before I carry on with the rest of the game, let me summarize what has Black gained for his invested material. A lead in development and more than that, a better pawn structure, in fact Black's only weakness is e7, which is pretty hard for White to attack. The main benefits of a better pawn structure pretty evident here. White has no useful pawn breaks, pushing e4-e5 doesn't do much, while pushing the Q-side pawns only creates weaknesses. Black's pawn break/advance is c4, clearing c5 for a Knight which can come to d3 or even b3 in some cases. The open files on the Q-side give Black a lot of pressure and make it difficult for White to develop his pieces, his Bc1 is particularly hard to find a role in the game. There is another side benefit for Benko when it comes to blitz games. The play is very smooth, so you save time on moves, you don't have to memorize a lot of lines, in fact, I know almost no theory and in spite of that, have very good results with it.",
        "7. Nf3 Bg7 8. e3": "A waste of time. How many times have you read that in an opening book or a GM commentary? It's rather easy to write that and absolve yourself from explaining more about a certain move. The other plan for White here is to fianchetto the Bf1 and keep the pawn on e2 for a while. Granted, the Bishop isn't very active on g2 but unlike other gambits where the goal is to exchange pieces in order to make the extra pawn count, it's very hard next to impossible to do that in this gambit, simply because of Black's pressure on the Q-side. So why is this move a waste of time? The pawn belongs on either e2 or e4. On e3 it just hems the Bc1 and doesn't do much to defend the d5 pawn.",
        "8... Bxf1 9. Kxf1 d6 10. e4": "Otherwise how is White to develop?",
        "10... Nbd7 11. Kg1 O-O 12. Bf4 Qa5": "Playing the Benko has its drawbacks though. You tend to play moves without thinking or looking at what your opponent has done. Here 12...Qb6 was slightly better, highlighting the weakness on b2.",
        "13. Qc2": "White players that don't face the Benko very often can get easily confused and stumble in their own pieces. ",
        "13... Ng4": "Again, perhaps 13...Rfb8 was more accurate, but I usually play this to exchange a pair of Knights and force White to weaken his K-side. Just because you've gambited a pawn for play on the Q-side doesn't mean you shouldn't switch over to a K-side attack if the opportunity presents itself.",
        "14. a4": "A hasty move that is the mark of an inadequate plan. White thinks that by putting a Knight on b5, supported by a pawn on a4, he'll be able to neutralize the pressure. If only it were that easy...",
        "14... Rfb8 15. Bd2": "Showing that White's 12th was another waste of time. This Bishop is White's bad piece. This game will be a good argument for that.",
        "15... Qb4": "Better was 15...Nge5 and after 16. Nxe5 Nxe5, there is no obvious way to prevent the Knight from coming to c4 with devastating effects, since 17. b3 gives Black excellent play after 17...c4!, exposing all the weak points in White's camp.",
        "16. Ra2": "Another awkward move. The best reply was another awkward move, 16. Nd1, but Black still keeps the initiative after Qb7.",
        "16... Nge5": "Again a rather automatic move. 16...Qc4 was much stronger. But this has its points as well. The Knight is headed to c4, putting even more pressure on b2.",
        "17. Nxe5 Nxe5 18. Nb5": "A discovered attack but this only helps me. The Knight isn't very stable on b5 and now the Ra2 is undefended.",
        "18... Qc4": "The only place to put the Queen but it's rather strong. I thought about Rxb5 for a second but decided that this was stronger.",
        "19. b3": "Forced, exchanging the Queens leaves White with two pieces en-prise.",
        "19... Qe2": "A mistake on my part. Qxc2 was stronger and would have led to an almost won ending by force, after 19...Qxc2 20. Rxc2 c4! 21. Rc3 cxb3 22. Rxb3 Rxa4 23. g3 Nf3+ 24. Rxf3 Rxb5 25. Re3 Bd4 26. Rf3 Ra2 27. Rd3 Ra1+ 28. Kg2 Rxh1 29. Kxh1 Bxf2 30. Bh6 f6 31. Rd2 Rxd2 32. Bxd2, and Black has all the chances to make his extra pawn count.",
        "20. Bc3": "It's never good news for Black if White swaps off the dark-square Bishops. White is only slightly worse now.",
        "20... Qg4": "I was still going for tricks. They usually work fine in blitz and this games proves it.",
        "21. h3": "Making a luft for the King.",
        "21... Qg5 22. Kf1": "After this move I decided to sacrifice the exchange and try to take advantage of White's strangely placed pieces.",
        "22... Rxb5 23. axb5 Rxa2 24. Qxa2 Qc1+ 25. Be1": "So there will be no Bishop swap now, at least I achieved that. Now to try and make the White King as uncomfortable as possible.",
        "25... Nd3 26. Ke2": "White should have played Qa8+, not allowing me to get my Bishop into the game for a while.",
        "26... Nf4+": "Now to take the King for a walk.",
        "27. Kf3": "If Kf1 then Bc3 wins a piece and keeps the attack.",
        "27... Qd1+": "With this move I set a nasty trap.",
        "28. Kg3": "If 28. Kxf4 then 28...Be5+ 29. Ke3 Bd4+ 30. Kf4 Qd3! and White is in serious danger of getting mated.",
        "28... Be5": "A nice battery of Black pieces is aimed at the White King.",
        "29. Qa8+": "The temptation to give check in a difficult position should be curbed, since it might just worsen the position of your pieces. Such is the case here. The cool 29. Kh2 would have kept White in the game.",
        "29... Kg7 30. Kh2": "Now the White Queen is stranded on the Q-side and the White King is terrible danger.",
        "30... Qxb3": "Not the best, but in Blitz you tend to grab material if you can. The forceful 30...Nd3+ wins much faster since White is forced to either 31. f4, which after 31...Bxf4+ 32. Bg3 Bxg3+ 33. Kxg3 Qxh1, Blacks wins material and keeps the initiative, or 31. g3 Qe2 32. Kg2 Bd4 and again, Black wins material and keeps the attack.",
        "31. g3": "Getting rid of the discovered check.",
        "31... Ne2 32. f4": "And now trying to push the Black pieces back.",
        "32... Nxf4": "Not likely!",
        "33. gxf4 Bxf4+": "Again a hasty move. 33...Qc2+ was the best move. Now White could have saved himself.",
        "34. Kg2 Qxb5": "Taking one too many pawns. I just wanted to get rid of any queening ideas White might have had and reckoned that even with only three pawns for a Rook, I shouldn't be in any danger because White's King is horribly weak.",
        "35. Bc3+": "White takes his chance to activate his Bishop with check. Again another active looking move that is a mistake. 35. Qa2! was best, taking defensive measures and keeping an edge.",
        "35... f6": "At least my King is safe.",
        "36. Re1": "Defending the e4 pawn and against Qe2+. But this slow defensive moves loses now.",
        "36... Qd3": "Now the King is going to come under a strong attack on the dark squares. See why it's a good idea to keep this Bishop in the Benko?",
        "37. Ba5": "A rather clueless move but nothing else works.",
        "37... Qg3+ 38. Kf1 Qxh3+ 39. Ke2 Qe3+ 40. Kf1": "If 40. Kd1 then Qd3+ and mate on the next move.",
        "40... Qf3+ 41. Kg1 Be3+": "41...Bg3 would have lead to a forced mate but this is good enough.",
        "42. Kh2": "The only way to prolong things was 42. Rxe3 but White wasn't looking at such moves.",
        "42... Qf2+ 43. Kh3 Bf4 44. Re3": "Now White has to give up the Rook for nothing to stave off mate.",
        "44... Qxe3+": "44...h5 would have mated sooner, but again, in blitz you tend to make forceful moves, like grabbing material and giving check, to save time. I guess it was just my luck that I got to give more checks and capture more material than my opponent.",
        "45. Kg2 Qe2+ 46. Kg1 Be3+ 47. Kh1 Qf2": "47...Qf1+ would have been mate in two. But this looks more aesthetic. Plus it gives White a chance to go kamikaze with his Queen.",
        "48. Qh8+": "Which he does. Sometimes, you get so frustrated in blitz when you lose a game like this, that you just won't give up and play till the very last move.",
        "48... Kxh8 49. Bb6 Qg1#": "Hope you enjoyed the game and I hope you won't be playing the Benko against me in blitz, since I might play as bad as my opponent did here. It's very annoying playing against the Benko at blitz. In almost all the games I played with it, with either colour, Black scored heavily."
    },
    "url": "https://gameknot.com/annotation.pl/everything-for-the-dark-squares?gm=33149",
    "gameName": "Everything for the dark squares",
    "players": "NN  vs. nyctalop ",
    "opening": "Benko gambit accepted (A58)"
}