{
    "moves": {
        "1. e4": "Hi everyone, just found this game scrawled on a piece of A4 paper.  It was an old OTB game played nine years ago.  I played a young 18 year old upper 6th form student in a best of 3 friendlies at my local Cambridge City Chess Club that night called Patrick Scott who had a BCF rating of 184 - I have translated this into ELO as above.  I went down 2.5 - 0.5 overall, but here is how the half point transpired.  It was the last of the 3 games and in fact my last ever game with him as the following week he moved away from Cambridge to digs near his prospective university.  This is the only time in my whole chess career that I have managed to draw any match of any description against an Expert.",
        "1... e6 2. d4 d5 3. Nd2": "3. Nd2 - this is the Tarrasch Defense of the French Defense.  I used to play the French Defense as black a lot in tournaments and in some friendlies such as this one.  This knight move, although it blocks in the white dsb does support the pawn on e4.",
        "3... Nf6 4. e5 Ne4 5. Nxe4 dxe4": "5. ................... dxe4 - oh, oh, this knight exchange weakens my pawn structure.",
        "6. Ne2 c5 7. c3 Nc6": "7. .................Nc6 - on move 6 I decided to try and bust up white's formidable pawn centre with a pawn break on c5 - I now develop a piece and put more pressure on d4.",
        "8. Be3 b6": "8. ............. b6 - bolsters my c pawn and prepares Bb7.",
        "9. a3 Bb7 10. Ng3 cxd4 11. cxd4 Qd5": "11. .............. Qd5 - after an exchange of pawns on d4 I now try and develop my queen, Glenda the Defender on an active square to protect my hanging e pawn.",
        "12. b3 b5 13. Ne2 b4 14. a4 a5": "14. ................a5 - an expansion on the queenside but will it get me anywhere?",
        "15. Nf4 Qd8 16. Bb5 g5 17. Nh5 f5 18. Nf6+": "18. Nf6 ! - strong move by white.  Over the last few moves my pawn roll on the kingside (I was sure white was going to have to castle there) has one big drawback - it has weakened my king's position and I will now have to give up castling rights with the queens on the board.",
        "18... Kf7 19. Qh5+": "19. Qh5 ! - The Wicked Witch of the West now comes on the scene, straight on to h5.  It seems I will pay a very high price for opening up the Fool's Mate diagonal.",
        "19... Ke7 20. Bxc6 Bxc6 21. Qxg5": "21. Qxg5 - I now drop a pawn.",
        "21... Qb8 22. Nxe4+": "22. Nxd4  - nasty discovered check.  A second pawn now drops but I am too busy trying to keep Henry out of Old Matey's way to worry about the material count.",
        "22... Ke8 23. Qh5+ Kd8 24. Bg5+": "24. Bg5  - Henry is really under the cosh - he now tries to escape to the queenside where he hopes his wife, Glenda will be able to protect him.",
        "24... Kc8 25. Rc1": "25. Rc1 - pinning Frere Leblanc! - Nasty, Nasty.  Henry sidesteps the pin next turn and protects his beleagured priest.",
        "25... Kb7 26. Qf7+ Qc7 27. Qxc7+ Kxc7": "27. ....................Kxc7 - after a nasty looking queen check from the Wicked Witch on f7, Glenda shields her other half and gives up her life for that of the Wicked Witch's.  Only now do I look at the material count and note that I am 2 pawns to the bad against a player with an 800  rating differential.  I do look at the white backward b pawn, however, and the seed of a plan which will germinate over the next few moves is sown.",
        "28. Ng3": "28. Ng3 - knight sidesteps the f pawn's attack.  I must now release Frere Leblanc from that pin.",
        "28... Kb7 29. f3 Bg7": "29. .................... Bg7 - I finally complete my development - ON MOVE 29!!!!",
        "30. Kf2 Bd5": "30 ................... Bd5 - after white connects his rooks with Kf2 I now unleash my counter-attack - Frere Leblanc puts the b3 pawn under the hammer.  As white has a dsb one of his rooks or his king is going to be tied down to defending it!",
        "31. Nh5 Rhg8 32. Nxg7 Rxg7": "32. ............ Rxg7 - white decides to simplify further by eliminating the bishop pair.  Note that we are now left with opposite coloured bishops which, if the rooks were swapped off, might offer drawing chances to the defending side.",
        "33. Bf6 Rgg8 34. Rcb1 Rac8": "34. ................ Rac8 - my rooks take advantage of the open files available to them.  I think I have some play for my 2 pawn deficit.",
        "35. Rb2 Rc3": "35. ............. Rc3 - putting more pressure on that weak b pawn!",
        "36. Rhb1 Rgc8 37. Be7 Rd3": "37. ............... Rd3? - I think I actually missed a chance to win the game here, I think Rc2  would have probably prompted a white flag.  After the exchange of rooks on c2 how on earth is white going to adequately defend his b pawn.  The a pawn will most likely drop off giving me two fantastic passers on the a and b file.",
        "38. Bc5 Rc3 39. Kg3 Rg8+ 40. Kh4 Rg6 41. Kh5 Bc6 42. Kh4 Be8": "42. ................... Be6 - over the last few moves white has tried to force a win by marching his king up the h file.  I think his king wants my h pawn.  Over my dead body!",
        "43. Bd6 Bf7 44. Kh3 Rg8 45. Rd1 Rgc8 46. Bc5 Rg8 47. Rf1 Be8": "47. ............. Be6 - things are drifting along rather aimlessly now.  I think I may draw this but it is in the hands of my opponent.",
        "48. Rff2 Bc6 49. Rfc2 Rxc2 50. Rxc2": "50. Rxc2 - one pair of rooks have been exchanged.  I now tie his remaining rook down to defending that b pawn.",
        "50... Bd5 51. Rb2 Kc6 52. Rb1 Kb7 53. Bd6 Rc8 54. Bc5 Rg8 55. Rb2": "55. Rb2 - finally after more aimless play Patrick offers me a draw and I wasted no time in accepting it.  Boy, I was over the moon!"
    },
    "url": "https://gameknot.com/annotation.pl/expert-draw?gm=17632",
    "gameName": "Expert Draw!",
    "players": "Patrick Scott (2072) vs. Joanne Stevens (1240)",
    "opening": "French (C05), Tarrasch, Botvinnik variation"
}