{
    "moves": {
        "1. d4": "Queen pawn. Landon & I both tend to use this opening as White. I favor it due to the open position it can allow on the queen side for white. ",
        "1... e6": "I normally respond with d5. e6 seemed like a good idea at the time, it really did! \nI have never used it since.",
        "2. e4": "c4 is more common, but who am I to gripe? ",
        "2... c5": "A look at the gameknot database indicates I was doing all I could to give the advantage to white. The pawn is protected by the bishop and makes a play for the center. With no other pawn support. Genius!",
        "3. Nf3": "Solidifying his grip on the center. His teacher would be proud!",
        "3... cxd4": "My teacher just ripped a handful of hair out. WTF? That space is protected by not one but TWO white pieces. I wonder how I expected to hold it?",
        "4. Qxd4": "I guess I didn't. This is beautiful, isn't it? But I'm sure I have a plan, right?",
        "4... Nc6": "Heck yeah! Go after that nasty early developed Queen and get a piece in play (on move FOUR.. more genius!)  I have dieselengine right where I want him now.",
        "5. Qc4": "Had to move the Queen. This must have seemed like a good spot for her. Queen pawn could attack supported by the e pawn and queen. But maybe a little extra help would be better.",
        "5... Nf6": "So I develop the other knight. This is looking good now! His Queen is out and I can harass her while I develop. Perfect. I have him!",
        "6. e5": "Nuts! have to move a piece twice in the opening. I'm supposed to be chasing HIS Queen.\n\n[In hindsight (thanks to ethansiegel for the analysis) 6.......D5 would have been better. \nAttacking his queen and ignoring the attack on the Knight  might have given me the tempo\nI needed to make him pay for the early queen advancement.\nAs the game was played though, I focused on the immediate attack on my Knight and ignored \nmy real objective, chasing his Queen. Ahhh, hindsight!]",
        "6... Nd5": "Some attack?! Nearly forced, and for me, truly forced. I'd rather have a prostate exam than move a piece back to it's home square after I _just_ brought it out. Maybe the prostate exam would have been better.\n[Or moving my pawn to D6... But, the die is cast!]",
        "7. Bd3": "OK, now I'm not liking this, more White pieces on the prowl. And pointing at the side I intend on castling on. ",
        "7... d6": "That is brilliant!  Seal off my blacksquare bishop and give him something to attack. My genius astounds me at times.",
        "8. O-O": "He didn't take the bait, and castled like a good boy as soon as he was able. This would normally be when I would begin a withering attack with my bishops and knights on his kingside. Too bad they are all hemmed in and on the wrong side of the board. Plus, I sure would like to castle.",
        "8... dxe5": "I'll show HIM! I'm a pawn up now and feeling mighty smart.",
        "9. Bg5": "And then THIS. An open diagonal to my queen and yet another white piece is developed..... At my expense.",
        "9... Be7": "Now I'm cooking! I may get to castle yet!",
        "10. Nbd2": "All the white minor pieces have been developed. He could push his Queen's Rook off the board. He won't need it.",
        "10... O-O": "Wheeeee! I'm safe now. Now I can get the rest of my pieces out and make him pay for that early Queen development!  He messed with the wrong cat. I'm a pawn up and victory is certain. Way to go General Custer!",
        "11. Qh4": "Hey, wait a minute. I'm supposed to make you move her. This should not be of your own volition! ",
        "11... Nf6": "I have to get some pieces over there or it's going to be bad. Real bad.",
        "12. Ne4": "Apparently dieselengine has the same idea. I'm feeling icky, but I see no real imminent danger. I turn out to be as insightful as Stevie Wonder.",
        "12... Nd4": "So I do that? I had in mind going to f5 to attack the Queen. Sadly, I'll never move that piece again. \nThe rest of this is just brilliant. Landon saw the opening and took me out like it was my first game. ",
        "13. Nxf6+": "Boom!! I'm sure Landon said out loud, \"Take THAT, Asshat!\"  I know he did. I have three choices:\nBxf6    k-h8   gxf6  \nWhat I completely missed in my calculations and what makes this mate unavoidable( and beautiful) is the\nBishop sitting on d3. ",
        "13... Bxf6": "I HAD to give him the pleasure of hollering \"checkmate!\" \nHe deserved the win.",
        "14. Qxh7#": "A fantastic win. I didn't make any huge blunders as black, just a host of poor moves that amounted to a dead king in the end. \n14 moves. I'll never live it down, so I thought I just as well tell the whole story..\n"
    },
    "url": "https://gameknot.com/annotation.pl/exploratory-surgery-only-hurts-the-patient?gm=4997",
    "gameName": "Exploratory surgery only hurts the patient",
    "players": "dieselengine9 (1252) vs. graderguy (1530)",
    "opening": "Queen's pawn (A40)"
}