{
    "moves": {
        "1. e4": "I'm pretty familiar with this territory so far...",
        "1... e5 2. Nf3 Nc6 3. Bb5": "Aah, the Ruy Lopez.  I'm familiar with many of the lines, but in a game against someone this much better than me, I decide to go with what I know best...",
        "3... a6": "The Morphy defense.  I'm a practicioner of the Marshall Gambit when white plays into that, which would continue 4. Ba4 Nf6 5. 0-0 Be7 6. Re1 b5 7. Bb3 0-0 8. c3, and then instead of the usual 8. ...d6, black can play d5!, getting a good attack for the sacrificed pawn.",
        "4. Bxc6": "But white doesn't allow this.  The exchange variation is an interesting one, because it gives black doubled pawns but also gives him the bishop pair.  What this means to me is that I need to develop quickly and make the most of my pieces on an open board -- if white can close the game or get to an endgame, my doubled pawns will put me at a disadvantage (as I learned in a couple of my losses to alabamaboy)",
        "4... dxc6": "Otherwise, if 4. ...bxc6, 5. Nxe5 wins a pawn for white.  In this case, Nxe5 will be met by Qd4!, winning back the pawn with advantage.",
        "5. O-O": "Now, Nxe5 is a real threat, and black's king is a long way from castled.",
        "5... Bg4": "!?  This is a move that I like, although there are other, safer ones.  This, I feel, seeks to maximize the bishops.",
        "6. h3": "Trying to drive the bishop away, or force an exchange.",
        "6... h5": "!?  This is the best try.  The bishop shouldn't be taken, as a line like 7. hxg4 hxg4 8. Nxe5?? loses in gruesome fashion to Qh4!, where there is no good defense to Qh2# and Qh1#; after 9. f4, g3 leaves white without hope.  However, 7. hxg4 hxg4 could be okay, *if* white is willing to jettison the knight to defend.\n\nRobert has a better move, though.",
        "7. d3": "Opening up the diagonal for the bishop, which allows for both attack and defense.  I know my best shot for victory here is on the kingside, so I go for...",
        "7... Qf6": "Black's plan is obvious, but can I get enough going quickly enough to win here?\n\nAnd what is the best plan?  Pawn storm?  Can I get the knight into action quickly enough to be effective?  Qf6 is not without danger, to be sure, but if white tries to drive the queen off now, with something like Bg5?, Bxf3 wins for black (8. Bg5 Bxf3 9. Bxf6 Bxd1 and black is up a piece for a pawn.)",
        "8. Nbd2": "This move is necessary to allow the queen to move, but blocks in the dark-squared bishop.  At this point, I thought of lots of options, including Rh6 (with the idea of Rg6, Bxh3, etc.), g5 (an all-out kingside storm), and 0-0-0 (getting my king to safety and getting the queen's rook into action).\n\nIn hindsight, I'm not sure I made the right call.",
        "8... g5": "0-0-0 looks better here to me, as the pawn storm is premature with the entire black kingside still at home, and the queen blocking the f6 square and the f7 pawn.\n\nAt least I'm not on the defensive, for the time being.",
        "9. Rb1": "?  The only question mark I can give to Robert's play in this game, as I don't see what this accomplishes.  I can understand the desire to play b3 followed by Bb2, but this doesn't seem like it helps anything.",
        "9... Be6": "At this point, I decided that, while it was still a bad idea for white to play hxg3 (an open h-file could be murderous here), this was the only logical follow-up to g5.  In hindsight, it's a good try, but a move like 0-0-0 or a developing move from a kingside piece might still be better.",
        "10. Nc4": "...going after the e5 pawn.",
        "10... g4": "Go ahead and take it, I say.  After Nfxe5, gxh3 looks menacing for black.",
        "11. Ng5": "Trying to exchange off a key attacking piece.  I don't see anything particularly good here for black, even in hindsight.    Perhaps Bd7 would be better, keeping the bishop on and leaving white's knight awkwardly placed.  But I was in a rush here, trying to press the attack as hard as I could, and played...",
        "11... Bh6": "?!  Allowing the exchange.  The rationale I had was that after Nxe6, I can play fxe6, and then if Bxh6, I have my pick of Rxh6 or Nxh6, giving me good kingside attacking chances.",
        "12. Nxe6 fxe6 13. d4": "Oh!  Didn't see this pawn sacrifice coming; this gets white's queen into the game and makes me curse myself for not playing 0-0-0 earlier.  The major problem with attacking too early is that your opponent is forced to make good moves -- when you build up an attack, the moves that will defend against it are harder to find!",
        "13... exd4": "0-0-0 now is too slow, as the knight on c4 plus the pawn on d4 are too much. ",
        "14. e5": "!  The only move, but a good move, tempoing the queen and winning the d4 pawn.",
        "14... Qf5 15. Qxd4": "And obviously, now I'm kicking myself for not castling queenside when I had the chance.",
        "15... Rd8": "!?  Probably the best try at this point; I refuse to abate my attack and decide to go all-out here.  I realize that  white can sneak in to my queenside with Qa7, but I decide to allow this just to have the opportunity to go after white's king.  Even so, my king doesn't look any safer than white's at this point!",
        "16. Qa7": "This has the bonus of luring white's queen away from the kingside.  If white goes pawn-grabbing, he'll go down in flames.",
        "16... gxh3": "Trying to crack white's defenses open!",
        "17. Bxh6": "This is, perhaps, the crucial moment in the game.  How to best respond here?  I was torn between so many different moves, including Nxh6, Rxh6, hxg2, Qg4, Qg6, and Qe4.  Many of these looked bad to me because of white's ability to play Ne3, but again, I think I chose one of the worst possible moves...",
        "17... Rxh6": "It's just slow!  Also, I hadn't considered that white would go over to the attack, and that his pieces would actually get there first.  Oh, the humanity!\n\nEspecially considering that hxg2 forces white to address the threats of gxf1=Q , Qh3, threatening mate, and if Kxg2, the king is dangerously exposed!",
        "18. Rbd1": "And now I go calculating lines, and realize that I cannot allow him to play Rxd8 , as Rxd8  Kxd8 is met with either Qb8 , winning the Ng8, or Rd8, where black has a tough road ahead to defend against checkmate.  At this point, I went into a long think, and couldn't find anything good.  The best I had was an idea to exchange pieces and get my king over to sanctuary at h6.",
        "18... Rxd1 19. Rxd1 Rh7": "This is a rotten attempt, starting with Rxh6, on my part.  I really think I had a chance to take this ~2000 player down, and blew it!  This is where the tables turn...",
        "20. Qb8+": "Forcing me to run...",
        "20... Kf7 21. Rd8": "Now this, unfortunately, I hadn't seen!  I was expecting Qxc7 , where I can run towards h6.  But this threatens to win the queen, and will definitely win the g8 knight at least.  What can I do?  What can I hope for?\n",
        "21... h2+": "For better or worse, I decide my only option is to try to force a perpetual check.  If Kxh2, I can consider Qf4 , forking king and knight, or other check-oriented options.",
        "22. Kh1": "He knows better!",
        "22... Kg6": "I've got to save the queen if I want to have a chance at a draw.",
        "23. Rxg8+": "nighty-night, knight.",
        "23... Kh6": "Now, there's really little I can do to prevent white from going to a won endgame with Qf8 , but I can always hope...",
        "24. f3": "He does know that my only chance is a perpetual check, right?  I like Qf8  much better here.",
        "24... Rd7": "Of course, I do have one last chance if he grants me this much...",
        "25. Qc8": "My game is in shambles.  My rook is en prise.  And yet, there is a drawing line if white mis-steps!",
        "25... Rd1+": "Forcing Kxh2.",
        "26. Kxh2 Qf4+": "I could always hope he loses his head and plays Kh3???  But I expect either Rg3 or, more likely, g3.",
        "27. g3": "This is what I thought.  Now, Qxf3 would be great, if there weren't that pesky Qxe6  followed by Qg6# looming over the position.  There is one last desperate chance for a draw, though...",
        "27... Rh1+": "!?  If Kxh1, Qxf3 !, and the white king cannot escape the checks! ",
        "28. Kg2": "Argh!  After Rg2 , now white can play Kxg2, and black has nothing good, and will lose to Qf8  no matter what when the checks run out.  Qxc4 just loses to Qf8 , and I've really got no good moves at all now.\n\nBlack resigns, 1-0.  But this goes to show if I just improve a little and can control my hyper-aggressive impulses, maybe I can hang with these guys?!"
    },
    "url": "https://gameknot.com/annotation.pl/eyes-bigger-than-your-stomach?gm=11377",
    "gameName": "Eyes bigger than your stomach?",
    "players": "robertb3079 (1987) vs. ethansiegel (1745)",
    "opening": "Ruy Lopez (C69), exchange variation, Alapin gambit"
}