{
    "moves": {
        "1. Nf3 b6": "An unusual reply, but with the Knight of f3, White has less chance of shoring up the diagonal. Meanwhile the b7 bishop should help neutralize any White bishop that is installed on g2.",
        "2. e4 Bb7 3. Nc3": "Other moves are possible, but are not as logical:\r\n\r\n3. d3 shuts in the light squared bishop and is likely to transpose into King's Indian territory, when Black has more breathing room.\r\n\r\n3. Bd3 blocks the d-pawn and following it with c3, Bc2 and d4 seems wishful thinking to me.",
        "3... e6 4. d4 d6": "With the apparently passive ...d6 I am  thinking of adopting a hippopotamus formation with a double fianchetto and the knights on d7 and e7. Without his f or c-pawn as a lever on the centre, White's set up will pose me less problems.",
        "5. Bd3 Nd7": "Playing the Knight to e7 first will only encourage White to play 6.h4! when both ...g6 and ...h6 are met with h5! With the knight on g8 however, 6.h4 is pointless as I can always play ...Nf6.",
        "6. Qe2": "Angling for Ba6 exchanging off the potentially strong bishop, rather than an e5 advance.",
        "6... a6": "Of course if either of my bishops gets removed in such a fashion, my formation loses much of its potential. So...",
        "7. O-O g6 8. a4": "Preventing me from advancing with ...b5, but is it really relevant in the current position? I have already committed myself with ...b6 and ...b5 will only lose time. Perhaps simply developing with Be3 or retreating with Ne1 preparing f4 and f5 is correct. ",
        "8... Ne7 9. e5": "This is much too premature; White must display patience if he hopes to gain any real advantage, and this isn't it. Keeping the central tension is important; with the centre is closed, I can get on with queenside advances safer than I would have been than with an open centre.",
        "9... d5": "Of course I don't want the centre to open just yet, and now I am ready to push ...c5, when Black is OK",
        "10. b4": "Looking to put me off playing ...c5 opening up the queenside, but it doesn't quite work.",
        "10... c5 11. bxc5 bxc5 12. Rb1 Qc7 13. dxc5": "The real question for black is where should I stick my dark squared bishop (no comments please!). After playing ....g6, it seems sensible to follow it up with ....Bg7. The problem is that the bishop doesn't really do anything here as e5 is securely defended. Instead I would rather play it out to c5 where it is far more active, hence I don't play ...Nxc5 but ....Nf5. Notice that ...Nc6 is a mistake as he can play Nb5, followed by cementing the knight on d6. Capturing the knight is worse; axb5 follwed by c6, kills me off in short order.",
        "13... Nf5": "I don't know what anyone else thinks, but I couldn't see a decent move for White to play. He has developed his pieces into standard positions, castled, and has a rook on an open file. What next? Perhaps bringing the bishop to a3 is called for, but I on the other have plenty of scope for improvement; simply castling is top of the list. \r\nIn fact it is difficult for White to come up with any general plan either, as his pieces have no real coordination despite their central presence.\r\nMaybe my opponent felt the same, as he now lashes out.",
        "14. g4": "Kicking the knight away from its strong post on f5, but creating terrible weakness in his kings position",
        "14... Ne7 15. Re1 h5": "Looks aggresive but I really just wanted him to play g5, locking the kingside structure for my king to hide behind, and freeing up the f5 square again.",
        "16. g5": "White can hardly permit the opening of the h-file, so his hand is forced.",
        "16... Nxc5": "Conisidering White is likely to play his bishop to a3 or e3 now or next, I would rather not play ...Bxc5 now as that weakens all of my dark squares when it is exchanged off. The bishop will be deployed on e7 instead.\r\nMeanwhile I am waiting for the right time to kick my d-pawn fowards. This will open up the centre (where his pieces are rather poorly places) and my b7 bishop will suddenly come to life on the excellant diagonal which he conveniantly weakened. \r\nObviously White must look to stop my central advance but this is not easy; A bishop on e3 will only have to retreat if I play ...Nf5, and moving the knight to d4 will leave the e5 pawn a little shaky. ",
        "17. Bb5+": "White trys a cheap shot with lack of anything much better to do.",
        "17... Nc6": "Obviously ...axb5 Nxb5 followed by Nd6 is terrible, so I just clear e7 instead.",
        "18. Be3": "No worry of ...Nf5 any more, but now the battle revolves around the d4 square and who can occupy it first. Playing the bishop to d4 may well leave my dark squared bishop very powerful after its opposite is exchanged off...",
        "18... Be7 19. Bd3 O-O 20. Qd2 d4": "Everything is developed, it is time to start the action! Whites pieces are only in each others way now, I also open the diagonal of my light squred bishop; Whites g4 advance may come back to haunt him.",
        "21. Nxd4": "I think Bxd4 holding on to e5 is better, as now black is able to activate all of his pieces and White goes quickly downhill. Nonetheless, Whites pieces are still going to be jumbled up in the centre and White is lacking any kind of plan apart from to go with the flow. The initiative is firmly in Blacks hands.",
        "21... Nxe5 22. Be2": "The exchange of this bishop will leave Black controlling all of the important light squares, especially arouind the White King.",
        "22... Rad8": "...Rfd8 looks more natural, but I had already envisioned a simple but deadly combination.",
        "23. Qc1": "Getting off the danger file, but in actuality is a big error as this allows...",
        "23... Ba8": "POW! Suddenly White is in dire trouble; the threat is ...Rxd4 followed by ...Qc6, when Whites kingside weakness proves fatal. ...Ba8 stops White from meeting ...Rxd4 with Rxb7, when Black has nothing to show. Unfortunately, White fails to come up with any satisfactory reply.",
        "24. Rd1 Rxd4": "In hindsight, ...Ng4 may have been yet more effective, forcing White to exchange off his vital light squared bishop in the face of ...Qxh2. But I think ...Rxd4 has so much more impact don't you?",
        "25. Rxd4 Qc6 26. Nd5": "The only move.",
        "26... exd5": "Black has 2 knights for the rook, but the excellent posting of both is worth far more than the slight material advantage would suggest.",
        "27. Bf4 Nc4 28. Bf3 Ne6": "Forking d4 and f4, defending against the threat of Rxc4 and ready to meet Rxd5 with ...Nd4 attacking the bishop all at once. After Rxd5 Nd4, White cannot retreat the bishop as he loses either the rook or allows the knight to hop into e2, forking King and Queen. If White retreats his rook instead, Black can play ...Ba3 and the f4 bishop must fall. \r\nInstead White trys something else, but the refutaion of that is easy...",
        "29. Bxd5 Qc5": "White is busted.",
        "30. Bxe6": "Obviously Bxa8 Qxd4 leaves White with an extra pawn but also with both of his bishops under attack.",
        "30... Qxd4 31. Bxc4 Qe4": "And it is all over. Black is going to capture on c4 and, with an extra piece coupled with a weak White king, the result is not in doubt.\r\n\r\n0-1"
    },
    "url": "https://gameknot.com/annotation.pl?gm=9619",
    "gameName": "",
    "players": "Jaburr (21xx) vs. Owenss1 (20xx)",
    "opening": "Reti opening (A04)"
}