{
    "moves": {
        "1. e4": "I would like to give a little context to this game. My opponent is a strong tactical attacking type of player. I have played him many times during the course of the many competitions we have in Atlanta. Up until this game I have had very little success against him...my best result being a win in a G10 blitz tournament, but as they say anything can happen in blitz. He has won the rest of our encounters. As white he has opened every game with 1. e4",
        "1... c5": "I decided to play the most complicated opening I can come up with. Thinking back to my G10 win...I don't remember the opening but I had a situation where there was tactics for both sides and he made a mistake. With 1...c5 I am trying to get a similar situation.",
        "2. Nf3": "Looking like a sicilian.",
        "2... e6": "Maybe a sicilian taimanov?",
        "3. d4": "White seems to think so.",
        "3... d5": "Surprise! My opponent takes a few minutes to think.",
        "4. exd5": "And decides to play against blacks isolated pawn. alternatively After 4.e5 the game can transpose into the advance variation of the french defence.",
        "4... exd5 5. Bb5+": "Larry checks the black king intending rapid development and possibly attacking the black king in the center. Black needs to be careful.",
        "5... Nc6 6. O-O Bd6": "Boldly played not fearing Rel ",
        "7. Re1+ Nge7 8. dxc5 Bxc5 9. Nc3": "attacking the pawn making use of the pin on the e file. Alternatively white can play Nd4 occupying the square in fronto of the pawm since blacks knight is pinned.",
        "9... O-O": "I protect the pawn simply by castling. Now this is the type of position I was aiming for when I played d5. I have an isolated pawn but I have strong control over the square in front of it enabling the pawn to leap foward at the proper moment.",
        "10. Bd3": "Threatening 11. Bxp  KxB 12. Ng5  with a mating attack",
        "10... f6": "now the g5 square is protected.",
        "11. Nh4": "This move looks aggrssive and had me concerned, but looking back over the game it does not seem like the knight  really accomplished much sitting on h4. ",
        "11... Ne5": "preparing the development of the bishop to e6 or g4",
        "12. Be2": "Controlling the white squares. Black is okay after Qh5 g6 the white queen moves and now black has Bg4 achieving full equality.  ",
        "12... Be6 13. h3": "lends further support to g4 but the h3 pawn could be subject to a sacrifice later on. I would put a question mark by this move. There must be something more useful for white to do.",
        "13... Bf7": "Likewise I would put a question mark in blacks move here. Of course 13..Qd7 should be played putting pressure on whites castled position.",
        "14. Bf4": "white sacrifices a pawn to gain the bishop pair.",
        "14... Qb6": "I ask white to show me what he has for the pawn.",
        "15. Rf1": "Maybe 15. Bg3 was better keeping a rook on the open e file",
        "15... Qxb2 16. Na4 Qd4 17. Nxc5 Qxc5 18. Be3 Qc6": "Maybe I should have played Qc7 that way white does not get a tempo with Bb5. ",
        "19. Rb1": "slowing down blacks attack on the c pawn since the black queen is the only piece protecting the b pawn.",
        "19... b6": "protecting the b pawn before attacking whites c pawn. However, 19..Nc4 is probably a better move threatening to take the bishop on e3 and if white answers with 20. BxN the d file opens to blacks advantage.",
        "20. Bb5": "Of course!",
        "20... Qc7 21. Qe2 Rfd8": "More logical would be 21...Rac8 where 22. Ba6 might not work since after Qxc2 the best white will be able to do is win the exchange in a position where black has sufficient compensation with 23. Qe1 23...Qxa2 BxR where black has 3 pawns for the exchange. Additionally black has good comand of the center.",
        "22. Bd4": "Logically white blocks the isolated pawn.",
        "22... Ne7c6": "Black fights for the right to advance the pawn.",
        "23. Ba1": "Of course Nf3 will be answered by NxN ",
        "23... Rac8": "black misses a shot. I'm not sure what white can do to answer 23..d4 uncovering an attack on a2",
        "24. Nf5 Rde8": "Smelling a tactic based on a knight e7  after some exchanges. I overprotect the critical square.",
        "25. f4 Ng6": "One more piece protecting e7.",
        "26. Qg4": "At this point both players are getting low on time...white is on the attack.",
        "26... Be6": "intending to exchange pieces before whites attack gets too dangerous.",
        "27. Rbe1 Bxf5 28. Qxf5": "The pawn cannot be taken the queen or knight capture will be answered by RxR  after which white wins a piece.",
        "28... Rxe1 29. Rxe1 Nb4": "Trying to take advantage of the tactic on c5. At the time I thought a good way to do it would be by attacking the c pawn, but all that does is chase the bishop to a better square. A better try would be 29. Nce7 attacking whites queen.  maybe white plays 30. Qe6  kh8 31. Bd7 Rf8 g3.",
        "30. Qe6+ Kh8 31. Bd7 Rf8 32. f5": "Here I think I should have played 32. Nf4 where if 33. Qe7 black has a draw with Nxh3  resulting in a perpetual check.",
        "32... Qc5+ 33. Kh1 Ne5 34. Rxe5 fxe5 35. Bxe5 Qf2 36. Qe7 Rg8 37. f6 h5 38. fxg7+ Kh7 39. Be6": "this Threatens the rook and if the rook moves the pawn queens with a discovered check. Unfortunately, white overlooked a check. White should have played Kh2 where there is not an answer to the above mentioned threats.",
        "39... Qe1+ 40. Kh2 Qxe5+ 41. Kg1 Qe1+ 42. Kh2 Qe5+ 43. g3": "setting a trap. If Rxp theatening the black queen and a mating attack. White sacrifices the bishop with Bg8  picking up the black queen.",
        "43... Qe2+ 44. Kg1 Qe1+ 45. Kg2 Qe2+": ""
    },
    "url": "https://gameknot.com/annotation.pl?gm=17031",
    "gameName": "",
    "players": "Johnson, Larry (2046) vs. Stack, James (1540)",
    "opening": "Sicilian (B40), Marshall variation"
}