{
    "moves": {
        "1. e4 d5": "une Scandinave ! ça faisait longtemps avec toutes ces Hollandaises... ",
        "2. exd5 Qxd5 3. Nc3 Qa5 4. Bc4": "pas l'ordre de coups le plus courant et je dois passer du temps à déterminer si, de mon côté, je peux dérouler mon ordre de coups habituel.",
        "4... Nf6 5. d4 c6 6. Nf3 Bg4": "par exemple, habituellement, je préfère placer ce Fou en f5 ",
        "7. Qd3 Bf5": "et, effectivement, c'est plus fort que moi... ",
        "8. Qe2": "(1h20) [bien évidemment, je n'ai vérifié qu'après avoir joué mon 7ème coup que 8. Fxf7  dans l'idée d'échanger les Fous de cases blanches en gagnant le pion f7 ne marchait pas... 8...Rxf7 9. Ce5  Dxe5 !] ",
        "8... Ne4": "(1h14) ",
        "9. Bd2": "(1h17) ",
        "9... Nxd2": "(1h13) ",
        "10. Qxd2": "(1h16) ",
        "10... e6": "(1h10) ",
        "11. O-O": "(1h14) ",
        "11... Nd7": "(1h07) ",
        "12. Bb3": "(1h11) ",
        "12... Bb4": "(1h02) ",
        "13. Rfe1": " (1h10)[sur 13. Dg5 Fg6 14. Dxa5 Fxa5 je ne pensais pas être plus mal] 13... 0–0–0 (54m) roques opposées : ça va chauffer, reste à savoir pour qui... En attendant, la Tour en d8 empêche la venue du Cavalier en e5 à cause du pion d4 cloué sur sa Dame en fin de variante. ",
        "13... O-O-O": "(54m) roques opposées : ça va chauffer, reste à savoir pour qui... En attendant, la Tour en d8 empêche la venue du Cavalier en e5 à cause du pion d4 cloué sur sa Dame en fin de variante. ",
        "14. a3": "(1h05)",
        "14... Bxc3": "(50m) ",
        "15. bxc3": "(1h04) ",
        "15... h6": "(47m) maintenant le Cavalier f3 ne peut venir titiller le pion f7 ni depuis e5 ni depuis g5 et je prépare g5 justement. ",
        "16. Ne5": "Ce5 ?? (1h02) ni depuis e5 j'ai dit... Sait-on jamais, je vérifie à nouveau puis, mon adversaire déjà à moitié levé pour aller faire un tour, je le fais se rasseoir illico : c'est toujours désagréable de réaliser qu'on va perdre une pièce alors qu'on pensait pouvoir se permettre une petite récré ...",
        "16... Nxe5": "(47m) et j'arbore un air satisfait que je regrette aussitôt : si jamais il n'a pas encore compris son erreur, pas la peine de lui mettre la puce à l'oreille... une Tour nette de plus c'est encore plus confortable qu'un Cavalier de plus. ",
        "17. Rxe5": "(1h00) BANCO !! ",
        "17... Qxe5": "(47m) il comprend enfin et abandonne aussitôt. 0–1 "
    },
    "url": "https://gameknot.com/annotation.pl?gm=19273",
    "gameName": "",
    "players": "ROUSSEL (Labourdonnais), (1880)   vs. BACHES, (1836 ",
    "opening": "Scandinavian defence, Lasker variation (B01)"
}