{
    "moves": {
        "1. d4": "Another game from the stonewall project. The game begins at turn 9 ",
        "1... d5 2. e3 Nf6 3. Bd3 e6 4. Nd2 Be7 5. f4 c5 6. c3 O-O 7. Ngf3 c4 8. Bc2 Nc6 9. O-O": "White castles, tucking his king away and activating his rook. A common move in this tournament. ",
        "9... Ng4": "I plagerised this move from another game in this project. It threatens Nxe3, forking White's queen and  rook, but it also allows f5 to inhibit whites control of the b1 - h7 diagonal. ",
        "10. Qe1 f5": "White's light square bishop is less dangerous (for now)",
        "11. Ne5 Qc7": "Getting the queen off the back rank and protecting the c3 knight. Ngxe5 would have been better. ",
        "12. Nxg4 fxg4": "Black's rook now has some room to move, but that g pawn doesn't look destined to last long. ",
        "13. e4": "I think this move was made in order to free up White's bishops. ",
        "13... Rxf4": "I realised this was a risk opening up the kingside while White has more influence there. My judgement was that Black wasn't really all that committed to the kingside and there might be more counterplay on the queenside.",
        "14. Rxf4 Qxf4": "Rook exchange. ",
        "15. Nxc4": "White gains a tempo on Black's queen, allowing him to reposition his knight. (And recover his pawn)",
        "15... Qf7 16. Ne3 e5": "This move seemed to do a quite a few things. it opens up the queenside to Black's light square bishop, protects g4, and sets up loads of tension in the central sqaures. I wasn't sure that it was the best move, but it was too hard to resist - so many very different outcomes...",
        "17. exd5 exd4 18. dxc6 dxe3": "After the exchanges - White looks to have the upper hand, but black is not out of the game by a long shot. There is a lot of space available for both sides to try to take control of. ",
        "19. c7": "This pawn is out on its own, but any pawn in the 7th rank must surely be treated as dangerous. ",
        "19... Bd6": "Threatening to dispatch White's advanced pawn, also putting pressure on h2. ",
        "20. Qh4 e2": "Black decides to threaten to promote - if white's queen strays to far then it could become a very sad end to the game.  ",
        "21. Qd8+": "This was not the move that was anticipated - I was waiting for Qh7",
        "21... Bf8": "Not wanting to exchange queens. It does however mean that both of Black's bishops and his rook are effectively locked away. There are also two mate threats available for Black if white makes a poor move. ",
        "22. Bd2": "That takes care of both mate threats. ",
        "22... b6": "This move was made after careful consideration, and a lot of analysing. Shame White didn't follow the plan quite the same way! The plan was to 23 ... Ba6, 24. Qxa8 Qf1+, 25. Rxf1 exf1=Q# \r\n",
        "23. Be4": "Black's trap seems even more convincing now - the rook is lost anyway so moving the bishop would seem natural. ",
        "23... Ba6": "The next step in Black's foolproof plan. Surely one of the cleverest, most devious tricks ever to be played in the history of this game, watch out Freddy, I'm gunning for you next!",
        "24. Bd5": "Black comes crashing back to Earth. ",
        "24... Bb7": "Better than Qxd5. ",
        "25. Bxf7+ Kxf7": "Some compensation. ",
        "26. Qxa8": "White deals to black's rook and sets up his promotion ",
        "26... Bxa8 27. c8=Q": "Not looking good for black at this point!",
        "27... Bc5+": "Forcing White's king into the corner, could there still be a faint hope for counterplay for Black? ",
        "28. Kh1 Be4": "The only place for the bishop where there is no fork for White's queen. ",
        "29. Qxg4 Bc6": "There is no chance for black now, but if there were it would be on this diagonal.",
        "30. Qxe2 g6": "h3 seems white's only chance for a mate. It is too far away though",
        "31. Bh6 Kf6 32. Rf1+ Bf2 33. Rxf2+ Bf3 34. Rxf3#": "The final blow"
    },
    "url": "https://gameknot.com/annotation.pl/the-stone-wall-project?gm=32298",
    "gameName": "- - The Stone Wall Project - -",
    "players": "x-machine (1502) vs. pawnstar2010 (1426)",
    "opening": "Queen's pawn (D00), stonewall attack"
}