{
    "moves": {
        "1. e4": "Hi everyone!\r\n\r\nAlex gave me a much harder time this time round in the Traxler.  I somehow managed to get my pawn back and then he embarked on an attack with a rook sacrifice.  Sadly for him the sac proved to be unsound and I went on to win the game comfortably after that.  Anyhow - we start the action on move 6 where Alex chose 6. Bc4.",
        "1... e5 2. Nf3 Nc6 3. Bc4 Nf6 4. Ng5 Bc5 5. Bxf7+ Ke7 6. Bc4 Rf8": "6. ...... Rf8 - this seems to be a fairly standard move in the Traxler and so are my next two moves.",
        "7. O-O d6 8. c3 h6 9. Nf3 Bg4": "9. ...... Bg4 - pin.",
        "10. b4 Bb6 11. b5 Na5": "11. ...... Na5 - my knight takes evasive action and puts a question to Alex's lsb.",
        "12. d3 Nxc4 13. dxc4": "13. dxc4 - N for B trade.",
        "13... Kf7 14. Qb3 Nxe4": "14. ....... Nxe4 - I anticipated c5+ next move but I had that one covered with Be6 attacking the Wicked Witch of the West so the c5 pawn would not have time to take Fou Lenoir.",
        "15. c5+ Be6 16. Qb4 Nxc5": "16. ....... Nxc5 - Not only have I got my pawn back, I am a pawn up!",
        "17. a4 a6 18. Rd1 Qe7": "18. ...... Qe7 - Glenda sidestepps the pin on the d6 pawn.  I now use a pin on the a column to my advantage.",
        "19. a5 axb5": "19. ....... axb5 - I did consider Ba7 but then Fou Lenoir would be mightily tied up and would disconnect the rooks if forced to b8.  Fou Lenoir cannot be taken because of Rxa1.",
        "20. Qxb5 Ba7": "20. ..... Ba7 - now after that little pawn trade Fou Lenoir does go to a7.",
        "21. Be3 Rfb8": "21. ...... Rfb8 - defending the b7 pawn and lining my rook up against the Witch.",
        "22. Bxc5 Bxc5": "22. ....... Bxc5 - bishop trade.",
        "23. Nxe5+ dxe5": "23. ...... dxe5 - a piece sac!",
        "24. Ra2": "24. Ra2 - I just put Fou Leblanc on a2.  However, just before I hit the submit button I noticed Qd7+.  I therefore ensured that I would win the rook on my terms by screening out the Witch with c6.  The Witch is also attacked and must move less she get stabbed by a humble pawn.",
        "24... c6 25. Qe2 Bxa2 26. Qxa2+ Qe6": "26. ...... Qe6 - after all that, because Alex sacrificed a piece before the B for R transaction I am a whole rook up.  But now I must take care, there are still two major white pieces on the board.",
        "27. c4 Rbd8 28. Rf1 Rd4": "28. ....... Rd4 - I am planning some dirty work at the crossroads for Alex, preparing to double on the d column and put Alex's back rank under the hammer.",
        "29. Nd2 Rad8 30. Nb3 Qxc4": "30. ...... Qxc4 - I thought about Rxc4 but decided that Qxc4 was more aggressive.  Alex cannot take my rook with his knight because it is pinned to his undefended queen.",
        "31. Qb1 Rd4d3": "31. ..... Rd3 - piling up on the knight, so the knight takes Fou Lenoir.  As I am a rook up I am more than happy to simplify.",
        "32. Nxc5 Qxc5 33. Qxb7+": "33. Qxb7+ - I anticipated this check and played Kg8.  Oops if I had played Kf8 instead I could have had a go at Alex's back row.  However, if Rd1?? then Qb3+ puts a real spanner in the works, damt ver damt!",
        "33... Kg8 34. a6 Qb5": "24. ..... Qb5! - I see another way through though, this queen move renews the threat of Rd1 so Alex trades queens.  Nice.",
        "35. Qxb5 cxb5 36. a7": "36. a7 - this pawn is rounded up immediately with Ra3.",
        "36... Ra3 37. h3 Rxa7 38. Re1 Re8 39. f4": "39. f4 - trying to trick me into exf4?? dropping my rook - I am having none of it and play e4, now, not only am I a clear R and P up I have two lovely passers.",
        "39... e4 40. g4 b4 41. h4": "41. h4 - Alex pushes his pawns but it will be to no avail!",
        "41... b3 42. g5 hxg5 43. fxg5": "43. fxg5 - pawn trade.",
        "43... b2 44. h5": "44. h5?? - Alex is lost anyway but this makes things so much easier to wrap up the game more quickly.  Glenda's re-appearance on the board is imminent after Ra1 as the WR is pinned to his king.  If RxR then PxR = Q.  Alex waves the white flag.  Commiserations and Good Effort Alex - Joanne",
        "44... Ra1": ""
    },
    "url": "https://gameknot.com/annotation.pl/the-traxler-variation-an-unsound-sacrifice?gm=27289",
    "gameName": "- - The Traxler Variation - - An Unsound Sacrifice",
    "players": "x-machine (1210) vs. jstevens1 (1839)",
    "opening": "two knights defence (C57), Wilkes Barre (Traxler) variation"
}