{
    "moves": {
        "1. d4 d5 2. e3 Nf6 3. Bd3 e6 4. Nd2 Be7 5. f4 c5 6. c3 O-O 7. Ngf3 c4 8. Bc2 Nc6": "Once again we come to the starting position of the tournament's Stonewall games\n",
        "9. O-O": "White castles, not committing himself into anything too aggressive...\n",
        "9... Ng4": "Now Black, on the other hand... my knee-jerk response of h3 would have been catastrophic because of Nxe3!, forking White's Queen and Rook. Something needs to be done about that...\n",
        "10. Qe1": "Defending the e-pawn. I chose this over Qe2 because I envisioned the usage of the queen breaking out through the short diagonal\n",
        "10... f5": "This pawn move was the same move that lost for me when I played Black, but I can't take advantage of it like Freddy did... I wonder if he remembered that too when he played this move... :)\n",
        "11. h3": "White would prefer that knight to back off...\n",
        "11... Nf6": "...which he does.\n",
        "12. Ne5": "White heads for his usual knight outpost on e5, one you may see a lot in the Stonewall...\n",
        "12... Ne4": "...So why can't Black do the same? This was the point of Freddy's 10...f5, as the knight is well supported - White can't gain a pawn\n",
        "13. Nxe4": "Nevertheless, White decides to get rid of the knight straight away - my main reason being that it stopped my Queen going anywhere along the little diagonal that it occupies. Also, I know Freddy has a way of pulling off nasty surprises, and I didn't want that. I chose the knight capture over the bishop capture because if I captured with the bishop, the knight would have no good place to go!\n",
        "13... fxe4": "This move keeps the chain from e6 to c4 strong.\n",
        "14. Bd2": "I was planning g4 next move, to get a pawn storm rolling. Right now 14.g4 Bh4! doesn't look to appealing, so I prepare to do something about that; 14.Bd2 b5 [not the text move, however] 15.g5 Bh4 16.Qe2 a5 17.Be1... But it seems too slow, this plan...\n",
        "14... Nxe5 15. fxe5": "Freddy initiates a knight exchange, and both sides have the bishop pair in a not-so-open position (the strongest bishop on the board is the Black dark-square bishop) dxe5 seems to have its merits as well (White can still have a strong pawn storm kingside) but then Black can play d4!, netting him a passed pawn. Besides, this move looks right on account of the b2-e5 pawn chain.\n",
        "15... Rxf1+": "This move also opens up the f-file...\n",
        "16. Qxf1": "...and my focus, for just a little bit, was this f-file.\n",
        "16... Bd7": "By the look of it, Freddy seems to be planning the same thing (is that the case, though?)\n",
        "17. Qe2": "This move prepares Rf1 next move - maybe White can make use of the f-file?\n",
        "17... Qb6": "Freddy couldn't care less about that f-file! This move targets the b2 pawn, and White needs to do something about it (I've noticed that Black gets more space queenside than White does kingside... I'm undecided as to which side I would prefer with a Stonewall)\n",
        "18. b4": "The most natural way to defend the pawn, and if Black doesn't take en passant White need not worry about that b-pawn...\n",
        "18... a5": "! An unexpected move for me, which I had given no thought to whatsoever - though the plan is simple - Freddy wants his rook in the action, and there's no way for White to stop that. Also, it allows the c4 pawn to be passed (a3 wouldn't stop this because it would then get pinned to the a1 rook) I had a good long think about this move... and i could see nothing but passivity. Where can my bishops go, for one - they are a lot worse off than Freddy's! I had considered Bxe4 here, but I'll end up more than a pawn down; 19.Bxe4? dxe4 20.Qxe4 axb4 21.cxb4 Ra4!; and the b-pawn falls (if Rb1, Rxa2... and a3 doesn't work as the pawn is still pinned to the rook)\n",
        "19. Kh2": "Then again, allowing the exchange doesn't result in a game-ending combination, so I play a waiting move. Were there better, though? If I knew the problems I would face here, I would have played a3 here... it probably was the better move anyway [by the way, White is in no danger of losing material, despite Black having higher pressure on b4; 19...axb4 20.cxb4 Bxb4? 21.Rb1!, and the pin results in the loss of the bishop... okay, Freddy isn't likely to fall for that but you never know! :)]\n",
        "19... axb4 20. cxb4 Ra3": "Comment from easy19; 'Time to ramp up the pressure' That comment had me worried, as you could imagine. The rook can't do any damage on a3, and after White's next move Freddy has to retreat it...\n",
        "21. Bc1": "?! But I have the feeling that this was exactly what Freddy wanted. I commented that he must have some sort of trick up his sleeve, and Freddy replied 'the trick is you think I have a trick.' Not until I started annotating this game did I realise what this meant - White drives away the rook as he isn't comfortable with where it is, but this move (unless I've missed something) loses a pawn... a brilliant move psychologically! So - what could I have played instead? Perhaps Bb1...\n",
        "21... Ra6": "Freddy retreats the rook... though you may have noticed that it wasn't to its original square...\n",
        "22. Bd2": "This, and a queen move were the only ones that could have saved b4...\n",
        "22... Qa7": "! But a2 is doomed! There's no use trying to prevent the loss of a pawn, no matter how hard White tries; 23.Bb1 Ra4 24.Qe1 Qb6 25.a3 Qa6 26.Bc1 Bxb4 [oh, that cursed pin on the a-pawn!] So now it's a matter of how Black wants to lose his pawn...\n",
        "23. Bxe4": "!? Make that how to lose his point! That bishop really wasn't doing much for me anyway, so I decided to take the time to be rid of it, and Freddy's passed pawn. This move was also influenced by my thinking earlier, where I had considered this sac. After this move was played, Freddy suggested an alternative line starting with 23.a4 [though the line was lost in the comments... I remember it ended with White's rook on f1 and Black's rook on a1... but it does give up the a-pawn, which remains a target of Black's attack]\n",
        "23... dxe4 24. Qxc4 b5": "Freddy wastes no time in attacking the queen...\n",
        "25. Qb3 Ra3": "And once again...\n",
        "26. Qc2": "It was a choice between this and Qb2 to me. I chose this one for two reasons; a) It targets the e4 pawn and b) The white queen might have counter-attacking opportunities along teh c-file.\n",
        "26... Qa8": "Another option would have been Rd3, and that was the move that I was expecting... \n",
        "27. Bc3": "? Perhaps that was why I went with this move. I saw that Freddy may have the idea of Bc6-Bd5... \n",
        "27... Bc6 28. Bb2": "And it does prevent the loss of the a2 pawn - 28...Rxa2?? 29.Rxa2 Qxa2 30.Qxc6 Qxb2 31.Qxe6+ and suddenly White has counterplay... but what about the e3 pawn?\n",
        "28... Rxe3": "oops...\n",
        "29. a3": "at the very least, I can try to keep the rook contained so that it can't do any more damage...\n",
        "29... Bh4": "With so much action going on queenside, Freddy switches tricks and goes after the kingside, where my king is...\n",
        "30. Qc5": "White must have some sort of counterplay, surely! Actually, this turns out to be the last aggressive move that I make...\n",
        "30... Bg3+": "I saw this move...\n",
        "31. Kg1 Re2": "but I didn't see this move - I guessed Freddy would play Re1+, forcing off the rooks, but this turns out to be a lot more effective...\n",
        "32. Rb1": "Ra2 and Bc2 both lead to Re1 mate, and I preferred this move over Bc3, which blocks an escape route for my queen. Though I have saved my bishop...\n",
        "32... e3": "! I'm about to lose my king - mate is now unavoidable whatever White does. The main line would be 33.a4 Rxg2+ 34.Kh1 Rh2+ 35.Kg1 Rh1#. There is a puzzle on this position, but I removed my queen as there were too many variations and the mate in 5 turned into a mate in 4... My first quick look in the position showed 33...Rxg2+ 34.Kh1 Rxb2+ 35.Kg1 Rxb1#...\n",
        "33. Bc1": "so I played this to block the mating route after Rxb1, but it allows a quicker mate... not that it matters, the end result is still the same...\n",
        "33... Re1#": "Overall, an interesting game and I did hold out for quite a bit before I got Freddied :)\n"
    },
    "url": "https://gameknot.com/annotation.pl/the-stone-wall-project-stronger-fortress-but-no-such-luck?gm=32098",
    "gameName": "- - The Stone Wall Project - - Stronger Fortress, But No Such Luck",
    "players": "x-machine (1467) vs. easy19 (2202)",
    "opening": "Queen's pawn (D00), stonewall attack"
}