{
    "moves": {
        "1. d4": "This game was played as a part of a thematic mini-tournament that was dreamed up by easy19. The first 8 moves were completed and players took over from there...",
        "1... d5 2. e3 Nf6 3. Bd3 e6 4. Nd2 Be7 5. f4 c5 6. c3 O-O 7. Ngf3 c4 8. Bc2 Nc6": "The final pre-set move by black. Material is even and white has a slight positional advantage. White is geared up for a kingside assault, while black is looking to use the room he has created and start busting it up down the queenside. I'm sure the position goes a lot deeper than that...",
        "9. O-O": "As good a time as any to tuck the boss away. Also calls forth some more artillery for the forthcoming strike. ",
        "9... Bd6 10. Ne5": "Seems like a nice place to park a knight. Black won't squash it yet, and if he does soon then white can recover with fxe5 and bring the rook into the action or dxe5 to keep the kingside pawn heavy. ",
        "10... Qc7 11. Ndf3": "Another option to replace the Knight on e5, also ready to g5 or h4. ",
        "11... g6": "This move slows down white's attack for now. ",
        "12. g4": "White gains some more space and starts squeezing blacks kingside. Also looking to scare away the horsie. ",
        "12... h6 13. Nh4": "Looking to sacrifice a minor piece for 2 pawns and the chance to assault a far more accessible king. ",
        "13... Bxe5 14. dxe5": "fxe5 would have had merit too, keeping the rook a bit more interested. I decided that the f pawn would eventually advance and prove to be useful in other ways. ",
        "14... Ne4": "And that's the end of the sacrifice idea...",
        "15. Qf3": "White queen is putting some more weight on the f file and glaring at the horse that is parked on her side of the chalk. ",
        "15... g5 16. fxg5": "Now there is a big hole in front of all white's heavy stuff. Another option could have been 16. Bxe4 dxe4 17. Qxe4 reestablishing the b1-h7 diagonal, but it seemed that was going to open itsself up soon anyway and the lsb seemed far more valuable than a knight (even though it is nicely placed). ",
        "16... Nxg5": "There's that diagonal.",
        "17. Qf6": "White's queen marches up the f file to start pointing her finger at the man on g8. There's a pawn all alone on the h file who seems to be doomed too. ",
        "17... Qxe5": "Black's queen finds a hole to step through. ",
        "18. Qxh6": "Getting deeper into black territory. Black's queen is now able to enter the fight. Good longe range attacking lines for whites lsb and rook and a well placed knight (despite being on the edge of the board). The dsb is only a quick pawn move away from being in on the action too. ",
        "18... Qg7": "The Black King is now surrounded by bodyguards.",
        "19. Qh5": "Declining the queen exchange, but still maintaining pressure. Looking to advance the lonely e pawn to give the dsb a chance to scare away the knight. ",
        "19... Ne5": "Calling up more defenders to even up the piece majority. Not immediately threatening, but 2 knights right in the thick of it usually seems to open up opportunities. ",
        "20. e4": "Shooing the knight away. The knight doesn't have many options. I expected the black knight to take the pawn to look to exchange with white's lsb. Perhaps h7 on the way to f6.  ",
        "20... Nh3+": "A counter attack! ",
        "21. Kg2": "Unfortunately the lone soldier has nowhere to retreat to. ",
        "21... Nd3": "This move gives white a choice of outcomes. It seems that both knights are destined to be off the board for the cost of one bishop. ",
        "22. Kxh3": "This move gives black the option to back out of the exchange with Nc5 or (more likely) Ne5. Ne5 could provide some useful defence for black - even a checkmate if white absentmindedly moves his queen too far (entirely possible in the case of this player...)",
        "22... Nxc1": "Black decides that the bishop was too powerful to leave. This invites white's other rook to wake up and do some work. ",
        "23. Raxc1": "Sleeping Beauty stretches his legs and strolls out a couple of squares for brunch.  ",
        "23... e5": "Bringing blacks lsb into the game, and providing a nasty surprise in case the white queen strays too far. ",
        "24. Nf5": "Black must now exchange NxB. There is nowhere safe for his queen to retreat to, and Qh7 will result in material loss. ",
        "24... Bxf5 25. Rxf5": "White starts to close in. There are still some big guns to get through, but white has a good material advantage and there are still many options - doubling the rooks on the f file, moving the e pawn to reestablish the long diagonal for the lsb. There doesn't look to be much chance of a counter attack in the near future.",
        "25... dxe4": "This move only seems to help white.",
        "26. Bxe4": "Rg5 seems to look much nicer here (mate in 4 if I see it correctly), but I missed it. ",
        "26... Qh8 27. Qxh8+": "I missed Rg5 again (mate in 2 this time)... A queen exchange still benefitted white though. ",
        "27... Kxh8 28. Rcf1": "Doubling the rooks. ",
        "28... Kg7 29. Rg5+": "Forcing the king to the edge",
        "29... Kh6 30. Kh4": "Protecting the rook.",
        "30... Rfg8": "Last hope for black",
        "31. Rxf7 Raf8 32. Rh5#": "The final blow"
    },
    "url": "https://gameknot.com/annotation.pl/the-stone-wall-project?gm=32032",
    "gameName": "- - The Stone Wall Project - -",
    "players": "pawnstar2010 (1388) vs. soccer14 (1243)",
    "opening": "Queen's pawn (D00), stonewall attack"
}