{
    "moves": {
        "1. e4 Nf6": "White wanted blood to flow so went back to an old favourite hoping for a Sicilian.But the brawler found himself against a jujitsu master.Seriously my first mistake,playing an opening in which I am no longer current in the theory.I should have stuck to what I knew.I may still have lost but I would have been more comfortable in the middlegame position resulting",
        "2. e5 Nd5 3. d4 d6 4. Nf3 Nc6 5. c4 Nb6 6. exd6 exd6 7. h3": "To prevent 7....Bg4.But in hindset my second error.Adopting a negative strategy of prevention and beginning to cede the iniative.7Be2 or 7Nc3 look a better choice.",
        "7... Be7 8. Be2 Bf6 9. O-O h6 10. Re1 O-O 11. Nc3 Bf5": "Black has effortlessly developed his minor pieces to active squares pressuring whites centre.One can see that the masters minor pieces are attacking whites defending",
        "12. a3 Qd7": "Whites centre and now k-side is under pressure",
        "13. Bf1 Rae8 14. Be3 d5 15. c5": "15cxd may have been better.Though ceding an isolated D-pawn white would have got more activity than in the game.",
        "15... Nc4 16. b4": "Looking for Q-side counter-play to try and offset blacks central/k-side initiative",
        "16... a6 17. Qc1": "Just about here I felt like Nero.\"Fiddling whilst Rome burned\"Over the next few moves I lose tempo for no gain whilst black pushes ahead with his plan.Whites pieces are a little disjointed while the masters all have their eyes to the centre/k=side17.Qb3 Striving for Q-side play is better.",
        "17... Nxe3 18. fxe3": "forced",
        "18... Ne7 19. Qd2": "Too slow.19.a4 sticking to a plan of Q-side play was better.",
        "19... Be4 20. Nxe4": "Better 20.Be2. The move played just helps blacks plan.",
        "20... dxe4 21. Nh2 Bh4 22. Red1 Nd5 23. Bc4 c6 24. a4": "Too little to late.",
        "24... Re6 25. Rab1 f5 26. Bxd5": "Trying to reduce the attacking forces though to little effect.",
        "26... cxd5 27. b5 Rg6 28. Nf1 f4": "Tallyho",
        "29. exf4 Qxh3": "Ouch.White challenged the Master to Tango instead he chose the Flamingo and put the bull to the sword.Thanks for the lesson easy as painful as it was."
    },
    "url": "https://gameknot.com/annotation.pl/walking-the-walk?gm=40055",
    "gameName": "- - Walking the Walk - -",
    "players": "caveman1960 (1759) vs. easy19 (2276)",
    "opening": "Alekhine's defence (B04), modern variation"
}