{
    "moves": {
        "1. d4": "This game is annotated as part of the stonewall project.   All games begin eight moves in.   Computer analysis is available at: http://gameknot.com/analyze-board.pl?bd=14088169&rnd=0.8072838392629944",
        "1... d5 2. e3 Nf6 3. Bd3 e6 4. Nd2 Be7 5. f4 c5 6. c3 O-O 7. Ngf3 c4 8. Bc2 Nc6 9. Ne5": "My opponent seems to be found of 9...Ng4 in the tournament.  An immediate Ne5 prevents that.",
        "9... Qc7": "This move develops the queen and prepares to advance ...b5 by protecting the queen's knight.",
        "10. Qf3": "continuing in anticipation of g4, and a kingside attack.",
        "10... b5": "Black mounts a queenside pawn storm.",
        "11. e4": "I play this move to clear lines for my DSB.",
        "11... dxe4 12. Nxe4 Nd5": "After the exchanges, black's knight has a strong central post and is closer to the queenside action.",
        "13. O-O": "I want to open the f-file, where I have a battery of queen and rook.",
        "13... f5": "Easy doesn't give me a chance, closing the b1-h7 diagonal and forcing my knight out of the center.",
        "14. Nxc6": "I think this move was a mistake.  The e5 knight was strongly positioned and should have remained in place.  I should have immediately played my next move.",
        "14... Qxc6 15. Ng5": "The only safe square for the knight, and even then it can be exchanged away.",
        "15... h6 16. Nh3": "And black has managed to marginalize my steed.  White's problems abound now.  The DSB is still blocked in, there seems to be little going for my kingside attack, and I exchanged my best-positioned piece.",
        "16... b4": "Easy begins his attack queenside.",
        "17. Bd2": "I want to connect my rooks and don't want to have my rook trapped by pawns in the corner.  I also want to get it out before I have to play Bb1.",
        "17... a5 18. Rae1 a4": "And three black pawns menace my queenside.",
        "19. cxb4": "I doubt I should have made this capture.  I wanted to get more scope for my DSB, or perhaps trade it off for black's DSB or knight.  I probably should have played 19. a3.",
        "19... Nxb4": "The knight takes the pawn and protects the queen.  Exchanges would have been appropriate here.  After, say, 20. Bxb4 Qxf3 21. Rxf3 Bxb4 22. Rd1 white's game seems fine.",
        "20. Bb1 Nd5 21. Rf2 Bh4": "An attempted rook skewer.",
        "22. g3 Bf6 23. Bc3 a3 24. bxa3": "??  Up until now, the Gameknot analysis has no problem with my play.  But this just blows me out of the water.  From what I can see, practically any move not sacrificing my queen would be better than this.\n\nSuggested continuation: 24. Rc2  Bd7  25. Nf2 Rfb8  26. h3 axb2  27. Bxb2 c3  28. Rxc3 Nxc3  29. Qxc3 Ra4  30. Qd2",
        "24... Rxa3": "Pinning the bishop to the queen.",
        "25. Rc1 Bb7": "Relieving the pin on the knight.",
        "26. Rfc2": "?? I'm trying really hard to keep my DSB, but I believe it's a lost cause.  And I kick myself because I didn't consider 26...Bxd4",
        "26... Rb8": "Here I expected the winning move 26...Bxd4, piling up on the bishop with check.  Capturing blacks DSB would be out of the question, and white's bishop would be lost.",
        "27. Rd2": "Now I try to hold off Bxd4, but in the process I hang my bishop.",
        "27... Nxc3 28. Qxc6": "Practically forced.",
        "28... Bxc6 29. Bc2 Bxd4+": "Now, no matter what, white loses the exchange.  If I move my king, black's DSB skewers the rooks.",
        "30. Rxd4 Ne2+": "And if I take the bishop, forks happen.",
        "31. Kf1 Nxd4 32. Nf2 Rxa2 33. Bd1 Rbb2 34. Nh3": "Only safe square for the knight.",
        "34... Rbxh2 35. Ng1 Rag2": "At this point, I've really got nothing.",
        "36. Rxc4 Rh1 37. Rxc6": "As far as I could tell, nothing else would help.  Besides, one last feeble trap is better than nothing.",
        "37... Rhxg1#": "But Easy delivers the coup de grace."
    },
    "url": "https://gameknot.com/annotation.pl/the-stone-wall-project-chancellorsville?gm=32760",
    "gameName": "- - The Stone Wall Project - - Chancellorsville",
    "players": "sccadams (1690) vs. easy19 (2215)",
    "opening": "Queen's pawn (D00), stonewall attack"
}