{
    "moves": {
        "1. c4": "general notes:  having never played a player above 1650, the personality of this game was eye-opening.  black's foresight and expert positioning create pressure from very early on.  this leaves no margin for error and little chance that black will give white any opportunities.  my usual reactive game is not going to work.  a solid opening that leads to a good position at the beginning of the middlegame is much more critical than vs a 1600 player.  instead of being able to seek a stronger and stronger position, I spent a number of moves reacting to potential threats.  interesting initiative personality: black's moves were not so much aggressive as they were methodical.  it would have been interesting to see how black might have proceeded if I had not made a mistake at move 19.\n\nWent with English opening for reasons I have since decided were invalid.  ",
        "1... c5": "Black moves this into symmetrical which holds for quite a while.",
        "2. Nc3 Nc6 3. g3 g6 4. Bg2 Bg7 5. Nf3 d6 6. O-O Qd7": "Here, I don't like that I have so little influence on the c8-h3 diagonal.  ",
        "7. d3 b6 8. Bd2 Bb7 9. a3": "black's dark-square bishop has been calmly and ominously minding its own business, threatening my N since move 4.\n\nMy move here to enable Qc2.  but perhaps this is where I start to go wrong.",
        "9... Nh6": "Not expected and interesting. A move with a psychological motive?  What are the purposes of this move?  Quite a route to e5 (which as will be seen is a key square in the game).",
        "10. e3": "one one hand, white has quite a bit of influence on the center.  on the other, this move, 10. e3 removes protection from d3 and f3.  Better alternatives here?",
        "10... O-O 11. Qc2 Ng4": "malevolent wandering horse.  ",
        "12. Ne2": "if not for my poor decision at 19, I think this move, which leads to 16. Nf4, is ok.  comments?",
        "12... Nge5 13. Nxe5 Nxe5": "that e5 square takes on a key role a few moves further along.  I'm not unhappy here to have one of Freddy's knights off the board. I gain some mobility.  on the other hand...",
        "14. f3": "...I certainly do come to regret taking protection off my e-pawn here.  but at the moment, this doesn't seem to be an awful move.  apparently I didn't want to chance being w/o my light-square bishop.  Perhaps a mistake. with black's reload (with freeing up of light B), his side does appear stronger here.",
        "14... d5 15. cxd5 Qxd5 16. Nf4 Qd6": "THAT turns out to be a winning move, though I can't see it. ",
        "17. Rad1 Rfd8": "black attacks d3 w/3 pieces...",
        "18. Bc3": "white defends w/3.\n\nbut note the unprotected e-pawn, ...which I very unwisely do not pay proper attention to (and which is perhaps not very significant in the current position).  [note: might have played 18. Bc1].\n\nat any rate, I am quite focused on the d-file, and on d3 in particular.  I see that black could add a fourth attacker with Ba6, ...pinning the pawn if my R on f stays where it is.\n\nNow I have the ability to get rid of one of these attackers, the N on e5, with a piece that is not involved in defending d3.  \n\nI do not love the idea of this exchange but feel that removing that N may be worth the negatives that come with it.  \n\nHOWEVER, I am so focused on the pressure on d3 (thinking the black Queen will stay on the d-file) that I do not recognize the potential fork (of two pawns by Q).  I incorrectly assume he would recapture with bishop.\n\nSo, I should have tossed the idea of BxN and found something better. \n\nComments here please: too much focus on defending the square under pressure? better thought process would have been...?  other?\n\n\n\n",
        "18... Rac8 19. Bxe5": "I believe this is where I lose the game. One alt might have been Rf2.  And for reasons noted (and soon to be illustrated), that or another alternate would have been the way to go. [additional comments above]",
        "19... Qxe5": "Aack! If not for \"the Rulez,\" I'd have resigned here.  Well, I might have been curious enough to play a little longer. but this is not good. Q attacks e and b-pawns.",
        "20. e4 Qxb2": "thought about keeping Qs on the board here.  but a Q-exchange could be forced by 21. ...Qd4.  or perhaps black would have pulled back, happy with the pawn.  Either way, black is now very strong on the a, b and c files.",
        "21. Qxb2 Bxb2 22. h4 Bc6": "In my small experience, I have never seen the technique this move sets up.  Was a bit baffled by it.",
        "23. Kh2 b5": "I realize there is no way to keep my a-pawn.  and I note this very cool technique for supporting a pawn advance in which pawns and bishops (supported by Rs) intertwine and are very strong.  all the way back at move 15 or so, I had seen that blacks a-b-and-c-pawns were strong and that black may win with them.  even though I am choosing from among bad options, I believe it was correct to not waste moves trying to protect my a-pawn or trying to capture black's a, b or c pawns.  ",
        "24. Ne2 Bxa3 25. g4 b4 26. f4": "Choosing from among poor options.  This improves mobility and is a way to put a 2nd defender on d3.",
        "26... Bb5 27. Rf3 c4": "no good options for white here.",
        "28. d4": "two passed pawns for black, zero and not enough time or disposable material for white.",
        "28... c3 29. Nxc3 bxc3 30. f5 Be2 31. Rff1 Bxd1 32. Rxd1 c2 33. Rg1 Rxd4": "with 33. ...Rxd8, black announced mate in 10 (I thought 8).  I Thank easy19 Very Much for the game. Very interesting.  Looking forward to playing other +2000 players in the group."
    },
    "url": "https://gameknot.com/annotation.pl/walking-the-walk?gm=40464",
    "gameName": "- - Walking the Walk - -",
    "players": "hogfysshe (1582) vs. easy19 (2253)",
    "opening": "English (A37), symmetrical variation"
}