{
    "moves": {
        "1. d4 c5 2. d5 g6 3. e4 e5 4. c4 Bg7 5. Nc3": "All book so far.",
        "5... d6 6. Nf3 Nd7 7. Bd3 Ne7 8. Bg5 O-O 9. O-O h6 10. Be3": "Development is basically completed for both sides now. The game proper begins here.",
        "10... f5 11. Nd2": "I'm a 1300 rated player, so this is a blunder. If the same move is made by a grandmaster, it's called an \"oversight\". Either way, it gives away a piece unnecessarily.",
        "11... f4 12. Bxc5 Nxc5": "I at least get a Pawn in return. ",
        "13. Nf3 Bd7 14. b3 Qa5 15. Qc2 a6": "A few positional maneuvers.",
        "16. Rfb1 Nxd3": "Freddy swaps down. Each exchange of course accentuates his material edge.",
        "17. Qxd3 b5": "Continuing to apply pressure.",
        "18. a4 bxc4": "To attack successfully Freddy needs some open lines. Now he's opened one.",
        "19. bxc4 Rab8": "Trying to take control of the line. I naturally don't want to initiate the exchange, as then the recapture would give him the line and I'd have to exchange my other Rook to oppose him.",
        "20. Qc2 Rfc8": "Freddy brings his other Rook over to the Q-side to try and break down my position.",
        "21. Nd2": "I rush additional forces to the threatened sector.",
        "21... Qc5": "Switching the attack to the K-side on the black diagonal.",
        "22. Nd1": "Adding a guard to the KBP.",
        "22... Rxb1": "Freddy swaps off...",
        "23. Rxb1": "...one pair of Rooks.",
        "23... Nf5": "Looking to attack on both wings.",
        "24. exf5": "Here's where the game gets very interesting. I saw that he had 24... BxP with the X-ray attack on the R once the Q moves, but I also saw that I could defend with 25 N-K4. I know Master Freddy wouldn't just throw away the piece, so he must have sacrificed it for a reason, but I decided to take anyway and make him prove his attack would work. I assumed he had something in mind to N-k4, and he did.",
        "24... Bxf5": "Initiating the attack...",
        "25. Ne4": "...and the planned defense.",
        "25... Qd4": "Again attacking the pinned Knight...",
        "26. Ndc3": "...and again defending it.",
        "26... Rxc4": "Now he has two pieces attacking my *other* pinned Knight...",
        "27. Re1": "...so I add a defender to the pinned knight on K4.",
        "27... Bxe4": "Freddy releases some of the tension with this capture...",
        "28. Rxe4": "and my recapture is forced, but it counterattacks his Q. A lesser player than Freddy might easily have fallen into 28... QxR?, expecting 29 NxQ? RxQ with a Rook ahead. However, the refutation would be 28 QxR? 29 QxQ! RxQ 30 NxR leaving Black only a Pawn ahead with a very long, difficult endgame to win. Against another 1300 player I would almost expect Black to fall into this trap, but I figured Freddy being a master would avoid it. Still, one never knows...",
        "28... Rxc3": "The correct play.",
        "29. Rxd4": "Pretty much forced.",
        "29... Rxc2": "Freddy ends up a Bishop and Pawn ahead after the tactical fireworks show.",
        "30. Rd1": "Now I have to back up and with my limited remaining resources, try to hold out for as long as possible.",
        "30... e4": "Smartly advancing his Pawns to gain additional promotion threats.",
        "31. h3": "Making \"Luft\" to avoid a back-rank mate of the trivial variety.",
        "31... Bc3": "Guarding the promotion square at K8.",
        "32. Kh2": "I tuck my King in the most secure spot left.",
        "32... e3": "Forcing my hand.",
        "33. fxe3": "I have no choice...",
        "33... fxe3": "..but now the threat of ... P-K7 and ...P-K8 (Q) is renewed.",
        "34. Rd3": "It's a lost cause now, but this move inadvertently enables Master Freddy to construct a nice mate in 3. I was prepared to resign...",
        "34... Be5+": "...but when Freddy announced a mate in 3 I decided to let him have the glory of a checkmate. It would be unfair to deny him that. If he had simply had a long, drawn-out, won ending I would have resigned rather than make him play another 20 moves.",
        "35. Kh1": "Forced.",
        "35... Rc1+ 36. Rd1 Rxd1#": "A beautiful checkmate. And a fun game to play for me."
    },
    "url": "https://gameknot.com/annotation.pl/walking-the-walk?gm=40180",
    "gameName": "- - Walking the Walk - -",
    "players": "last_archimedean (1362) vs. easy19 (2277)",
    "opening": "Old Benoni (A43), Franco-Benoni defence"
}