{
    "moves": {
        "1. e4 g5": "Freddy has told me that he likes to take underrated opponents out of book early and he does so here with the Reversed Grob.  If you go to the games database, you'll notice that there are only 4 listed responses for this position.  As for the position itself, it doesn't do much for center control, but does allow the opportunity to play a hyper-modern game; controlling the center from the wings.",
        "2. d4": "So I look to take more real estate in the center of the board. ",
        "2... Bg7 3. e5": "Looking to claim as much room in the middle as possible ASAP.",
        "3... h6 4. Bc4": "Post Game Computer Analysis (PGA) gave me a slight advantage after this move, but in hindsight I see it as a mistake and a loss in tempo.  I should have used this opportunity to develop another piece.  Granted, I had my eye on the potential Ne2, so I wanted to develop the bishop to avoid barricading it, but Ne2 wasn't necessary and in the end I didn't play it anyway.  The Bishop could have been developed later (and to potentially a better square).  ",
        "4... c5 5. Be3": "Defending the d-pawn with a bishop is not my cup of tea, but judging by this developing trend it seems that this bishop might not be of any immediate use.  I can't remember the last time I played a game where I developed both Bishops before either Knight, Freddy forced this in my mind because I saw 5. Nf3 g4 6. Nd2 cxd4.  Either way, a Knight couldn't defend the challenged piece without losing the e5 pawn.  The only other option was 5. c3.",
        "5... cxd4 6. Bxd4": "The Bishop is looking a bit more lively.",
        "6... e6 7. Nf3": "Finally developing a Knight...",
        "7... Nc6 8. Qd3": "Too early for the Queen. 8. Nc3 would have been better and PGA liked h3.",
        "8... g4": "This... is a problem.",
        "9. Nfd2": "I shouldn't have allowed this to happen.",
        "9... Nxd4 10. Qxd4": "Now I'm defending a pawn with the Queen!  I even realized how absurd this was as I was playing the game.  I don't want to hand the pawn over, but I needed to do something quickly to find another defender, even if it was simply a rook sitting on that file.",
        "10... Qa5 11. Qxg4": "The pawn was making me nervous and threatening my castle.  It wasn't a terrible pawn to have threatening though, I am always happy to capture pawns f to g in order to open up the file for the Rook.  I guess I just lost my composure in this situation.",
        "11... Qxe5+ 12. Be2": "Doomed.",
        "12... Qxb2 13. O-O": "I considered Nb3 and that was the recommendation of the PGA, but I figured the Rook was lost either way so I decided to introduce the threat of the other Rook.  Had I decided Nb3, I was fairly certain the Rook would fall to the Bishop instead of the Queen.",
        "13... Qxa1 14. Qa4": "Attempting to configure a Queen trap.",
        "14... Qe5 15. Bd3 Nf6 16. Nf3": "You can't beat someone almost 700 rating points higher than you without using all your pieces.  The Knight on b1 should have been developed already.",
        "16... Qc7 17. Nbd2": "Finally...",
        "17... O-O 18. Qh4": "I see an opportunity, but the Knight sitting on f6 is a big problem.  In a few moves it will be a huge problem.",
        "18... d5": "I had planned to put my underutilized Knight on e4 to get the f6 knight out of the way, this move puts a severe damper on that plan.",
        "19. c4": "So I meekly challenge the offending pawn.",
        "19... Bd7 20. Ne5": "This was a blunder that was made because I was looking further into the position than my abilities allowed and caused me to miss the obvious threat.",
        "20... Qxe5": "Now the game was lost before this huge mistake, but normally I would resign here and that would be the end of the annotation.  However, resigning is against W the W rules and the annotation is for the benefit of other members to learn.  ",
        "21. Nf3 Qc3 22. Ne1 Rac8 23. Qg3": "I think I'm brilliant here.  Not to mention super sneaky.  And sly.  And kinda suave.  But none of those apply to me, what does apply is blind in one eye.",
        "23... dxc4 24. Bh7+": "Ha!  Kxh7 and Qxc3 and now the game is almost even!",
        "24... Nxh7": "Wait, what?  How did I forget about that knight?",
        "25. Qxc3": "Too late to turn back now, perhaps it will delay checkmate by 10 or 12 moves.",
        "25... Bxc3 26. Nc2 Bb2 27. Rd1 Ba4": "Well now I've lost all hope.  This is a seriously dour situation.",
        "28. Rd2 Rfd8 29. Rxd8+ Rxd8 30. h4": "An escape hatch.  ",
        "30... Rd1+ 31. Kh2 Bxc2": "Death to the Knight, last to go and last to fall.",
        "32. Kg3 Be5+ 33. Kf3": "Trying to sneak away...",
        "33... Re1": "Sometimes I wish I could invent more squares to retreat to.  Not in this game, Heavens no!  I was waiting for death at this point.",
        "34. Kg4 Nf6+ 35. Kh3 Rh1#": "Fin.  Thanks to Freddy for the opportunity.  I did learn a few things in this game.  From Freddy's advice \"A good way to improve is not trying to win but trying to last as long as possible. The goal is to make it to move 100+ in any game. A longer game can give you a opportunity,s to change from trying to last to trying to win.\"  I have noticed in the past that to be very true, by deferring exchanges and prolonging things, opportunities do present themselves.  I also learned that Freddy's Bishops are deadly.  Lastly I've learned (finally, I hope) that getting pieces developed against masters is of the utmost importance.  For some reason I tend to forget the basics when I match with players who are better than me, but I should always try to remember that they are still flesh and blood human beings and they can make mistakes too.  Computers take the personality right out of these matches."
    },
    "url": "https://gameknot.com/annotation.pl/walking-the-walk?gm=49114",
    "gameName": "- Walking the walk",
    "players": "king-nothing (1380) vs. easy19 (2068)",
    "opening": "Reversed Grob (Borg/Basman defence/macho Grob) (B00)"
}