{
    "moves": {
        "1. c4": "English Opening. This was my standard opening at the time. I recently changed it to King's Pawn though. ",
        "1... c5": "Black responds with English (A30), symmetrical variation. ",
        "2. Nc3": "White responds with the English (A34), symmetrical variation. ",
        "2... Nc6": "Black responds with the English (A35), symmetrical variation. I see why they call it the symmetrical variation lol. ",
        "3. e3": "This was, again, part of my original opening, which again, I have since changed. There's not anything wrong with this move though. ",
        "3... d6 4. Nf3": "If you've seen my recent past annotations, you can already tell how different my openings are, and I think they were changed for the better. ",
        "4... Nf6": "Not surprised to see all the knights out. ",
        "5. h3 Bf5": "At this point, the game is simply starting off as standard: Both sides are even, and both sides continue to develop. I'm glad I'm able to do that now. ",
        "6. Be2": "White prepares to castle. ",
        "6... g6": "Black is preparing to castle as well. ",
        "7. O-O": "As expected, white castles. ",
        "7... Bg7 8. b3": "White continues to develop. ",
        "8... O-O": "As expected, black castles. ",
        "9. d3": "This would actually be my first inaccuracy, or minor mistake. Some of you may not be able to see it now, so I will explain through the next couple of moves. ",
        "9... Ne4": "Take note that this is NOT a free knight. ",
        "10. dxe4": "I still take of course. ",
        "10... Bxc3": "Here's where that move I made on move 9 comes into play. See, when black moved his Knight to e4, his g7 Bishop was lined up for my c3 Knight. We see what happened next. Sounds like a simple exchange, but not exactly. I can't take black's LSB (Light Spaced Bishop) because his DSB (Dark Spaced Bishop) now targets my a1 rook. Of course I will move my rook. That move I made at move 9 did allow black to start to gain a bit of an advantage, but it could be worse. You will see the other reason why the move 9 move was an inaccuracy in a moment. ",
        "11. Rb1": "Of course, as I said, white will protect his rook. ",
        "11... Bxe4": "Here's the final result of white's inaccuracy earlier. Black gains a free pawn. It may only be a pawn and not matter that much, but since black is clearly getting a positional advantage, you can see now how 9. d3 was an inaccuracy. There is still plenty of game to go. ",
        "12. Bd3": "It's pretty obvious to me that black plans to exchange pieces. It's not always the case though, so I play this move to ensure the exchange. ",
        "12... Bxf3": "As I expected. I would of thought 12. Bxd3 would of been better actually, but then again, black is attacking king-side. ",
        "13. Qxf3": "I knew it was better to keep a good pawn structure for my king, thus, I took with the queen instead of the g2 pawn. ",
        "13... f5 14. g4": "This probably was not the best move. I didn't see much better at the time. ",
        "14... e5": "I can't help but notice that black is pushing me back some and pushing in closer. ",
        "15. gxf5": "I decide to take with the pawn. ",
        "15... gxf5": "Obviously black does take back. ",
        "16. Bxf5": "I lasted 15 moves without any big mistakes. Against a player rated around 2200, I think that is pretty good. This is where white's downfall begins though, with the blunder (a.k.a. big mistake) just made here. Just glancing over this position, you probably can't see why this is such a blunder. The reason is, that now, the LSB is lost. If you still don't see it, then simply look at the next move. ",
        "16... Qg5+": "Now that black can attack the king with a check, white must defend. The thing is, white can't defend by using their LSB, unless they want to lose their queen. Obviously that is not the case. There is no way to save the bishop, thus, the move made before is a blunder, not only because now black gains a big material advantage, but also a greater position against white. ",
        "17. Qg4": "I could of moved the queen to other positions, but I figured staying with the bishop like this was best. ",
        "17... Rxf5": "The bishop goes as expected. ",
        "18. e4": "I decide to attack black's rook and queen. I think we all know the only move black will make next. ",
        "18... Qxg4+": "A queens exchange of course. No other move would of been optional for black. ",
        "19. hxg4": "Well, we can see now that black is winning, but the game is only about half over. ",
        "19... Rf6 20. f3": "White builds up their defenses, with what they still have. ",
        "20... Nd4": "With black already in white's territory, white has limited options. ",
        "21. Kg2": "This is the stage where the king becomes a factor. It is needed to protect the f3 pawn. ",
        "21... Raf8": "Obviously the f3 pawn is now lost. ",
        "22. Bb2": "I decide to attack black's bishop, hoping to give me more room to maneuver. This is actually a mistake. Again, I will explain why through the next few moves. ",
        "22... Bxb2": "I at first found it interesting black did not play Rxf3 to give his Bishop protection. Of course, there is nothing wrong with a fair exchange instead. Now that I think about it though, giving up more of my pieces probably isn't the best idea, but I couldn't think of much else. Black must of taken opportunity of that, but of course, I don't know that exactly, but I'd say it's most likely. This is why the previous move by white as a mistake. You will see in a few moves the outcome of doing so. ",
        "23. Rxb2": "Of course I take with my own rook. ",
        "23... Rf6xf3": "Now the pawn is taken and lost. ",
        "24. Rbf2": "I decide to get my both of my rooks involved here, again, not thinking about keeping my pieces on the board. ",
        "24... Rf3xf2+": "No surprise there, an exchange. ",
        "25. Rxf2 Rxf2+": "I'm not surprised it was a double exchange. ",
        "26. Kxf2": "Well now, white has no strong pieces. Just a few pawns and their king. It is just a matter of time now. Now we see why 22. Bb2 was a mistake. White basically has nothing left, but black has plenty left, compared to white. ",
        "26... Kg7": "Black now gets their king involved as well. There is no stopping an eventual pawn promotion. White will play on still. I see how long I can last, and I always feel the other side could make a mistake, but I knew then as well as I know now that I'm against a grand-master, so the chances that they'll make a mistake is pretty much zero to none lol. ",
        "27. Ke3": "Not much white can do. ",
        "27... Kf6 28. Kd3 Kg5": "Of course the g4 pawn is lost. ",
        "29. Ke3 Kxg4 30. Kd3": "Whit is simply going back and forth now, but it is obvious which pawn will be promoted. It is over for white of course, but the inevitable could of still of been prolonged. This move is a blunder because now there is no way to stop the h7 pawn from promoting. Kf2 would of been a way better move. ",
        "30... h5": "Again, there is no hope in stopping that pawn now. ",
        "31. Ke3 Kg3": "Black obviously wants to make sure white does not try to stop the pawn from promoting. I would expect no less. ",
        "32. Kd3 h4 33. Kc3": "At this point, I felt I should get away from that area. There aren't really any good moves for white now. ",
        "33... h3 34. Kb2 h2 35. Ka3 h1=Q": "The promotion. It's almost over. ",
        "36. Ka4 Qc1": "Black prepares for the mate. ",
        "37. a3": "This was the the only reasonable move for white. ",
        "37... b6": "Well now white can only make one move. Thus it is over, but I let it play out until the end. Mate in 2. ",
        "38. b4": "Mate in 1. ",
        "38... Qc2#": "Checkmate. Well, I did my best. I think I did pretty good against someone who had about 1000 points more than me. Thank you for the game easy19, I had fun :). I hope you all enjoyed the game as well. Thank you all for your comments and ratings. I will have more annotations in the very near future for you all to enjoy. Until the next annotation ;). Joe"
    },
    "url": "https://gameknot.com/annotation.pl/walking-the-walk?gm=57628",
    "gameName": "- Walking the Walk -",
    "players": "joveyboy1 (1294) vs. easy19 (2188)",
    "opening": "English (A35), symmetrical variation"
}