{
    "moves": {
        "1. Nf3": "My first game with Freddy",
        "1... a5": "I reviewed black's past games and noticed a recent loss with this opening move when his opponent ignored the rook pawn all the way to axb2 followed by bishop capture. I didn't understand much of the game and not sure if the pawn loss was pivotal, but maybe I can do the same thing. I think he's trying to provoke me into something I'll regret. (post game note: plenty of that later)",
        "2. Nc3 a4": "Wait.... what if he doesn't capture b2 and just sits there? Hold on, that was a recent game, he probably won't do that again. Why didn't I move c4 again?",
        "3. a3": "so I push c3, no apparent resolve to stick to my plan. After I click move, this looks really ugly.",
        "3... Nc6 4. g3": "post game note: analysis shows this as an inaccuracy, but I intended on the fianchetto and wanted to castle as soon as possible. Not sure why its an inaccuracy.",
        "4... e5 5. e4 d6": "I don't really know the name of this board configuration, but have seen it a lot. Seems like the d6 blocks in his black bishop. So maybe he's going to fianchetto his bishop.",
        "6. Bb5": "Since his pawn is on c4, I can hold this pin for a while to make him uncomfortable.",
        "6... Be7": "Why not g6 and then Bg7? Seems like this blocks in the queen, but I think he's castling short.",
        "7. d4": "I thought about Nxa4, but thought he would advance on d file. I also didn't want to give up the pinned knight position yet.",
        "7... exd4 8. Nxd4 Bd7 9. Nxc6": "I see an opportunity to get his pawns doubled, seems like maybe that will be an advantage. I need every one I can get. Also, I read somewhere that a fianchetto is easy to defeat when the opponent has the queen and bishop with the same color as your fianchetto bishop. I think if I take his bishop with mine, I may be able to defend better. Maybe another advantage. ",
        "9... Bxc6 10. Bxc6+": "(post game note: I think giving up my white bishop was a big mistake)",
        "10... bxc6 11. O-O Bf6 12. Qf3": "Not quite sure what to do next. I decide to target the only unprotected piece, c6. I'll move e5 next and take his bishop. Unless I missed something, there's a fork at Qc6 there he'll have to defend.",
        "12... Ne7": "I guess he saw that as well.",
        "13. Ne2": "So, I decide to do something about a4. (post game note: I have a feeling this is where I made my big error, but analysis doesn't really say much. Would appreciate opinions here.)",
        "13... O-O 14. Rb1 Ng6 15. Kg2": "I remember he has no white bishop and wanted to move my king to that color thinking it will be safer. (post game note: waste of two moves)",
        "15... Qe7 16. b3": "back to dealing with a4 (post game note: totally unconcerned with the obviously threatening queen)",
        "16... Rfe8": "wait... that suddenly looks very unhealthy.",
        "17. Kg1": "I shouldn't have moved there in the first place.",
        "17... Qxe4": "clearly he wants me the exchange... how can I get out of this in the best shape? (post game note: it never really crossed my mind that he might be looking at my rook, bishop, and pawn just hanging around behind the lines. I wish I had developed these a bit, pesky a4 pawn!)",
        "18. Qe3": "now I think I can deal with an exchange here.",
        "18... Qxc2": "blood pumping now for sure.",
        "19. Rb2": "I'll threaten his queen and then get mine out of the way, rather lose a rook than my queen.",
        "19... Bxb2 20. Re1": "(post game note: distracted and forgot my save-the-queen plan)",
        "20... Rxe3 21. Bxe3": "mediocre defense, but absolutely no offense now. At this point, would have resigned, but I wanted to see if I can make it to 30 moves. ",
        "21... Ne5 22. Nd4 Bxd4 23. Rc1 Nf3+": "didn't see that, 30 moves seems like it might be unreachable",
        "24. Kg2 Qe4 25. Kf1": "of the three choices this seems best, but the end is near.",
        "25... Bxe3 26. Rc3 Nd4 27. Rxe3 Qh1#": "RIP, next time to 30 moves Freddy!"
    },
    "url": "https://gameknot.com/annotation.pl/walking-the-walk?gm=51415",
    "gameName": "- Walking the Walk -",
    "players": "russ20124 (1170) vs. easy19 (2123)",
    "opening": "Reti opening (A04)"
}