{
    "moves": {
        "1. e4": "B00 King's Pawn Opening. The King's Pawn opening move is both popular and logical. It controls the center, opens lines for both the Queen and the Bishop, and usually leads to an open game in which tactics, rather than slow maneuvering, predominates.",
        "1... Nf6": "B02 Alekhine Defense. Alekhine successfully introduced this defense in the 1920's and it is still valid today. It avoids major attacking lines by White, while inviting White to overextend in the center.",
        "2. e5": "B02 Alekhine Defense. This natural move declines to advance with 2.Nc3, which would transpose the game into a Vienna game.",
        "2... Nd5": "B02 Alekhine Defense / Normal Variation 2.e5 Nd5. This is a 'standard' position in the Alekhine Defense. Black's idea is to entice White to advance pawns, making them targets in need of defending later. After ten years or so, the Alekhine is making a new appearance on the tournament scene.  3.d4 d6 4.Nf3 is still considered the most solid for White.",
        "3. d4": "B02 Alekhine Defense / Normal Variation 2.e5 Nd5.",
        "3... d6": "B03 Alekhine Defense / Normal Variation 2.e5 Nd5 3.d4 d6.",
        "4. Nf3": "B04 Alekhine Defense / Modern Variation. The Modern Variation relies on development rather than a pawn assault.",
        "4... Nc6": "B04 Alekhine Defense / Modern Variation.",
        "5. c4": "B04 Alekhine Defense / Modern Variation.",
        "5... Nb6 6. Nc3": "Finally developing the queenside knight, but with the c-pawn not being blockaded in the process. White has a very strong center.",
        "6... g6": "Black's plan is to fianchetto the dark squared bishop to counterattack the central squares after the inevitable exchange at e5 or d6.",
        "7. exd6 cxd6": "7...exd6 8.Be2 Bg4 9.d5 Bxf3 10.Bxf3 Ne5 11.O-O Bg7 12.Bf4 Nbxc4 was another possibility",
        "8. d5": "White gains space and begins to harass the black knight, which buys an extra tempo",
        "8... Nb4 9. a3 Na6": "Now it is White's move again and the d4-square has been freed by the earlier pawn maneuvre which gives an excellent opportunity to centralize the white Queen, while also threatening one of Black's pieces at the same time.",
        "10. Qd4 f6": "Black's position becomes pretty cramped after the text move, so perhaps 10...Rg8 was worth considering.",
        "11. Be3": "White centralizes the dark squared bishop and enables the possibility of queenside castling in the future.",
        "11... Bg7": "Black is aiming to castle kingside.",
        "12. h4": "Creating lots of potential threats for Black down the line. The idea is to combine the pawn thrust h4-h5 with pressure on the g6 square (the FOCAL POINT) with a move like Bd3.",
        "12... Nc5": "Black finally finds a great square for the poor knight which started it's journey at g8, and has been forced to move four times due to being harrassed by white pawns. Here it is very strong, as the knight outpost at c5 blockades White's potentially powerful c4 pawn, as well as controlling the key squares b3, d3, e4 and e6!",
        "13. Rd1": "Avoiding the nasty threat of ...Nb3",
        "13... Bf5": "Black disengages the pin on f6 and reinforces the control of e4.",
        "14. Qf4": "White aims to prevent any nasty tactical surprises arising after ...g5 with the possibility of a discovery attack on the Queen. Black really wants to play ...g5 but White has that square covered four times at the moment.",
        "14... Qc8": "Very strong move, reinforcing the powerful bishop at f5 and making ...g5 a possibility since the pawn on g6 is no longer tied to the defense of f5.",
        "15. b4": "White begins it's own attack on the queenside, the question is whose attack will be faster.",
        "15... g5": "Both sides are fighting for initiative.",
        "16. Qg3": "The pawn cannot be captured: 16.hxg5? fxg5! 17.Nxg5 (or 17.Qxg5) 17...Bxc3+ with an advantage for Black. Now with the text move, the g5 pawn is pinned.",
        "16... Nb3": "The black knight and bishop are working in tandem, making the white Rook at d1 quite vulnerable (for instance, Black may play ...Bc2 and the Rook has no escape squares)",
        "17. c5": "Clearing the d-file for an assault directly on the uncastled black King. White is prepared to sacrifice a pawn for initiative and a central attack.",
        "17... dxc5": "Black takes the offered pawn, isolating the white d-pawn but also helping it advance further since the d6-square is now free. Now White continues to reinforce that square before actually pushing the pawn.",
        "18. Nb5": "The knight is ideally placed, with the dual function of threatening Nc7+ as well as reinforcing d6 and d4.",
        "18... O-O": "Black finally castles, but with the white Queen at g3 it is a question of just how safe the black King really is. For the moment, Black at least frees the g5-pawn from the pin, although it is only to White's benefit to have it gone from the g-file.",
        "19. d6": "Threatens both c7 and e7. White's initiative has grown substantially, with the multiple threats hanging over Black's head. dxe7, bxc5 and hxg5 are all being threatened on the very next move!",
        "19... cxb4": "Black chooses to deal with the threat of White's b4-becoming a much more powerful threat on c5, and in the process isolates White's pawn at a3.",
        "20. dxe7": "Attacks Black's rook at f8, adds a promote threat at e7, and creates a passed pawn on e7.",
        "20... Re8 21. hxg5": "The attack on the black King is in full swing. White consolidates by clearing the h-file for the Rook, isolates Black's pawn at h7 and Black's pawn at f6 and prepares a full-on assault on the g-file.",
        "21... fxg5 22. Bxg5": "Protects White's pawn at e7, creates a passed pawn on f2, and isolates Black's pawn at h7.",
        "22... Qc5": "22...Qe6+ 23.Be2 was another possibility.",
        "23. Be2": "Creates a very valuable square for the white King to run to (f1) in the event of ...Qc3+.",
        "23... bxa3": "Creates passed pawns on a7, b7, and a3. Black wins a pawn.",
        "24. Nd6": "Forks Black's rook at e8, Black's pawn at b7 and Black's bishop at f5.",
        "24... Qc3+": "Black seeks to buy a valuable tempo with the check to deal with the threats created by the White knight.",
        "25. Kf1 Bg6": "Moving the Rook instead of the bishop would not have been any better, i.e. 25...Rxe7 26.Bxe7 or 25...Reb8 26.Nxf5",
        "26. Qg4": "White is aiming at e6, since Qe6+ is lethal for Black.",
        "26... Nc5": "Defending against both Qe6+ and Nxb7.",
        "27. Rc1": "Skewering the Queen and the knight at c5. ",
        "27... Qb3": "Black is banking everything on the passed pawn at a3, ready to give up the knight if it will buy another tempo.",
        "28. Rxc5": "Now b7 is onyl again vulnerable, but White has to take extreme care due to the impending threats with ...a2 and ...a1=Q",
        "28... a2": "The threat is a1=Q+",
        "29. Rc1": "Probably the only move, White must be willing to give up the extra material in order the neutralize Black's attack. Now 29...a1=Q 30.Rxa1 Bxa1 31.Nd2 Qd5 32.N2c4 Nd7 33.Nxe8 Rxe8 34.Ne3 Qe5 35.Qc4+ looks good for White.",
        "29... Qd5": "Probably a mistake, since Black now loses more material. A better try might have been a1=Q, leading to 30.Rxa1 Bxa1 31.Nd2 Qd5 32.N2c4 Nd7 33.Nxe8 Rxe8 34.Ne3 Qe5 35.Qc4+ Kh8, which gains a rook and loses two pawns by comparison. White still has a better position but it is not as clear cut.",
        "30. Nxe8 Rxe8 31. Nh4": "Opening up a line of defense for the Queen to defend the important bishop at e2, which is under some pressure from Black.",
        "31... Bb1": "Black now has a very tangible threat: ...a1=Q",
        "32. Bf6": "White threatens mate and creates an absolute pin (the strongest kind of pin!) on g7.",
        "32... Qf7": "Black must consolidate and guard g7 which is currently the focal point of White's attack.",
        "33. Ba1": "Removing the promotion threat and banking on the power of the absolute pin - the white bishop is immune on a1 as long as the g7 bishop remains pinned to the king.",
        "33... Qxe7": "With the e7 finally undefended Black jumps on the opportunity to capture it, adding to the pressure on e2. Also worth considering was the prophylactic move ...Kh8",
        "34. Re1": "White consolidates king safety, adding another defender to e2 and creating discovery check threats.",
        "34... Bd3": "Black pins the bishop at e2 and adds even more pressure on it. 35.Bxd3?? Qxe1#",
        "35. Nf5": "White creates its own threats with which Black must deal immediately. Both the Queen and bishop at g7 are under attack, and the pressure on the h-file is also mounting. So in order to alleviate the pressure Black must give up some more material.",
        "35... Bxe2+ 36. Rxe2 Qxe2+ 37. Qxe2 Rxe2 38. Kxe2": "The dust has settled, and White find itself up a piece with the threat on a2 nearly neutralized. This endgame is easily won for White.",
        "38... Bf8 39. Kd3 Nd5 40. Kc4 Nf4 41. g3 Ne6 42. Nh6+": "Forcing the exchange of Black's dark squared bishop for the knight. Note that the black king has no escape squares from the check.",
        "42... Bxh6 43. Rxh6 Ng5 44. Kb3 Ne4 45. Rh5": "Setting up a neat tactical trap. The key here is enabling the white Rook access to g5 (with check), if the black knight decides to gobble up the pawn on f2.",
        "45... Nxf2": "Black falls for it, but the position was dead lost anyways. Now the knight on f2 is lost by force due to the impending Rook fork.",
        "46. Rg5+ Kf8 47. Rf5+ Kg8 48. Rxf2 h5 49. Rxa2 h4 50. gxh4 a5 51. Rxa5 b5 52. Rxb5 Kh7 53. Rb6 Kg8 54. Rb7 Kf8 55. h5 Ke8 56. h6 Kd8 57. h7 Kc8 58. Rg7 Kb8 59. h8=Q#": ""
    },
    "url": "https://gameknot.com/annotation.pl/walking-the-walk?gm=53045",
    "gameName": "- Walking the Walk -",
    "players": "alex_ratchkov (2015) vs. easy19 (2179)",
    "opening": "Alekhine's defence (B04), modern variation"
}