{
    "moves": {
        "1. e4": "I went with the French opening with the King's pawn to e5 and my opponent made the move h6. ",
        "1... h6": "Preparatory move I presume I know it is used to defend against the knight landing on g5. ",
        "2. Nf3": "And here it is Nf3.  This move protects h4 and could be a threat to the king if I were able to move onto g5 but this is not possible with pawn at h6.",
        "2... e6": "Black played the French opening, wing gambit and moved e6 getting ready for his next move d5.",
        "3. Bc4": "So I develop my LB to c4 it covers two diagonals.  I thought that this may stop d5 move but black was not going to let this bishop stop him taking the d5 square.",
        "3... d5": "Black now played d5 which I had not realised was now protected twice by the pawn and the queen.",
        "4. exd5": "I thought I should take d5 pawn and no doubt black would reciprocate.",
        "4... exd5": "This now left me with a pawn which I could not take since the queen was protecting it.  I should have seen that I would be left with a defended pawn which I would not be able to capture.",
        "5. Be2": "So I moved LB back to e2!  All my advantage given away.  I should have moved my LB back to b3 rather than e2 but I thought I was protecting my king.",
        "5... Nc6": "Black looks better just now.  I have only one piece developed and as white I had the advantage but I lost it.",
        "6. c3": "It seems like I am starting over again.  Now I play c3 ready to play d4.",
        "6... Nf6": "Black develops his knight to Nf6. ",
        "7. d3": "As black played Nf6 I thought I would play d3 to deter  him from moving onto the fourth row with his knights.",
        "7... Bd6": "Black developed his DB to d6 attacking my h2 pawn and has access to 2 diagonals to a3 and h2.  ",
        "8. h3": "I play h3 to again stop the f knight coming down to g4.  I can castle but have not done so as I feel I am behind and black may attack at any time. ",
        "8... O-O": "Black castles.",
        "9. Be3": "I have moved Db up to e3 to control 2 diagonals.  I do not have any control of the centre but black also only has one pawn on the 5th row.  But this pawn is in the 4 squares which make up the centre of the board.",
        "9... Re8": "Once black castled he moved his rook out to e8 to take control of e file which white currently has 2 bishops and the king is still on its square in the centre.",
        "10. c4": "I pushed pawn to c4 threatening d5.",
        "10... d4": "Black moves pawn to d4 threatening DB on e3.  DB is unable to take as d4 is protected by c6 knight.",
        "11. Nxd4": "I capture d4 pawn with F knight.",
        "11... Bb4+": "Black moves his DB to b4 and checks king.",
        "12. Nc3": "I move my B knight to c3 to block the check. ",
        "12... Nxd4": "Black responds by capturing my d4 knight with his C knight.  This has severely constricted my game as I am unable to move my pawns and get any space in the centre.",
        "13. O-O": "I decide to castle now.",
        "13... Bf5": "Black moves his LB to f5 attacking my pawn at d3.  And also attacking my h3 pawn.",
        "14. Ne4": "I move my C knight to e4 to give protection to my pawn although the knight is protected by the d3 pawn there are two threats from the bishop at f5 and knight at f6.",
        "14... Nxe4": "Black captures my e4 knight with his F knight.  I am just getting more and more constricted by black's pieces.  I need to make some room.",
        "15. Bg4": "I decide to move my LB to g4 to protect the advance of black I need to put up a bit of a fight.  And I also prevent the capture of my pawn at h3.",
        "15... Bxg4": "Black captures my LB and I resist capturing with my h pawn as I don't wish to have doubled pawns as it would give black a route in to my king.  ",
        "16. f3": "I decide not to take with my queen as I want to keep her for a little while longer and I push my f pawn forking the knight and LB and also providing protection to the pawn with my queen at d1.",
        "16... Ng3": "Black moves his knight to g3 threatening to capture my rook at f1.",
        "17. Rf2": "I move my f rook up to f2.",
        "17... Rxe3": "Black decides to bring the rook into the fray and moves rook to c3 threatening my pawns on the 3rd row.",
        "18. f4": "I make a step to freedom and push my f pawn to f4 believing it is protected by the rook so should be safe.",
        "18... Bxd1": "However black sees the chance and captures my queen at d1.  I must have been thinking about this result once I moved my pawn but I must have seen it as lesser of two evils as I could not just wait for the inevitable.",
        "19. Rxd1": "It also meant that I could capture a piece and reduce the onslaught!  I captured the LB with my a rook.",
        "19... Nge2+": "Now black moves his g knight to e2 and checks the king.",
        "20. Kh2": "King moves to h2 to avoid check.",
        "20... Qh4": "Now black queen joins the attack and moves to h4 threatening my f rook and inevitably check is on the cards.",
        "21. Kh1": "I move my king down to h1 and out of reach of the queen.",
        "21... Rxh3+": "Then black moves his e rook to h3 and checks the king.",
        "22. gxh3": "I take the rook with my g pawn.  I still have 2 rooks left on the 1st and 2nd row which I hope can help to protect my king from the black onslaught.",
        "22... Qxf2": "Black captures my f rook with the queen and it is not looking good for the king at h1 with the queen at f2 and a knight at e2.",
        "23. Rg1": "I bring my final rook to g1 to assist the king.",
        "23... Qxg1#": "However this was not enough to keep the queen away and she checkmated my king.\n\nI learned that I need to take more time before I move and feel I do take more time now.  I don't want to get myself constricted like that again so it will make me think about making sure my opening moves do not include such blunders.  But of course I knew I would not beat easy19 and really appreciate his time in playing this game.  "
    },
    "url": "https://gameknot.com/annotation.pl/walking-the-walk?gm=60463",
    "gameName": "- Walking the Walk -",
    "players": "milly64 (940) vs. easy19 (2255)",
    "opening": "Carr's defence (B00)"
}