{
    "moves": {
        "1. e4 e5 2. Nf3 d6": "Philidor's Defense - a little weak in my opinion.",
        "3. d4 Qe7": "This is atypical.  I don't believe it's the best response, but it did throw me a little, and that can be a useful tool in speed games.",
        "4. dxe5": "This is white's next move in most lines, but perhaps I should have played 4. Bc4 and kept the f8 - a3 diagonal closed.",
        "4... dxe5 5. Qd5": "(?!) I don't think I would play this in a rated game, but it certainly made for an interesting game.  I think black is best served with 5. ...Nf6, but there are a variety of options.  The key points are that the queen can't be kicked by a pawn immediately (because of Qxe5) and the queen is holding the white bishop to c8 with the threat of Qxb7.  This breaks plenty of accepted principles, but I haven't thought of a line yet in which white is clearly behind because of it.  If anyone sees one please let me know!",
        "5... Nd7 6. b3 h6 7. Bb2 c6": "Now the queen can be kicked, but she has lots of flight squares.  d1 is perhaps the most comfortable, but I thought a5 had promise.",
        "8. Qa5 g5 9. h3": "I wanted to hold the knight in case of 9. ...g4, but looking at it again, Nxe5 was a stronger move.",
        "9... Bg7 10. Nbd2 b6 11. Qc3 c5 12. Nc4": "e4 is simply overwhelmed.",
        "12... Ba6": "A little unusual, but probably stronger than the more standard Bb7, which allows white to play Bd4, and activate the bishop, maintain the pressure on e5, and keep his kingside castle.",
        "13. Ncxe5 Bxf1 14. Rxf1 O-O-O": "This was an interesting decision.  It's good that he castled, but it does nothing about the tension in the center.  Admittedly, there was little for him to do.",
        "15. O-O-O": "I decided that if he sidestepped the center for a turn, so would I.  Also, this evens the d-file, and gets my king to a fairly safe spot.",
        "15... Bxe5": "I think that he might have been better served by attempting a queenside pawn attack.",
        "16. Nxe5 Ngf6": "Finally, he is able to bring his other knight into the game.",
        "17. Nxd7 Rxd7 18. Rxd7 Kxd7 19. Rd1+": "Now his king is exposed and I am hoping to take advantage of that before more pieces are traded.",
        "19... Ke6 20. f3": "I wanted to solidify my pawns for the endgame, but there were obviously other options.  Qc4+ looks promising, as it pins the knight, defends the e4 pawn and forces the king to move. ",
        "20... h5 21. Qd2 Rg8 22. Bxf6": "This probably was not the best move.  Holding the bishop and going for a bishop vs knight endgame was possibly stronger.",
        "22... Kxf6 23. Qd6+ Qe6 24. Qxe6+ Kxe6": "So now it is rook vs rook, and I like my position.  Although his king is more active, my rook has the only open file, and I feel my pawns are working together better than his.  From here it is all calculative endgame: the weakest part of my game.  Also, both players were running short on time.",
        "25. c4 f5": "There will be considerably fewer annotations from here because, as I mentioned, my endgame is very weak.  If anyone has comments on the moves please make them in the next available comment box, they are always very helpful.",
        "26. exf5+ Kxf5 27. Rd7": "I thought about Rd5+ but didn't think it could win a pawn, so this way at least my rook takes lots of space.",
        "27... Ra8 28. Rh7 h4 29. f4": "A blunder.  In hindsight, I think that bringing the king over to the kingside would have been the best idea here.",
        "29... Kxf4 30. Rf7+ Kg3 31. Rf5 Kxg2 32. Rxg5+ Kxh3": "Now it is all over.  It was really over with my blunder on move 29, but this has become a truly hopeless position.  From here I believe both players had less than 20 seconds on the clock, and I know I had less than 5 when I was checkmated.  I will bow out of annotating from here.",
        "33. Rh5 Kg4 34. Rh6 h3 35. Kd1 Kg3 36. Ke1 Rf8 37. Rh7 h2 38. Rxa7 h1=Q+ 39. Kd2 Rf2+ 40. Kc3 Qf3#": "So there it is.  A fairly even game until an endgame blunder.  I appreciate all comments and advice, especially in the latter stages of the game!  "
    },
    "url": "https://gameknot.com/annotation.pl/3-min-fixed-blitz-philidors-defense?gm=49960",
    "gameName": "3 min fixed blitz - Philidor's Defense",
    "players": "worvis8 (1488) vs. kombi1 (1584)",
    "opening": "Philidor's defence (C41)"
}