{
    "moves": {
        "1. e4": "Hi everyone!\n\nHere is a game which ended in a Low Draw for Yours Truly.  I got greedy in the middlegame with some pawn grabbing that backfired on me.  Under normal circumstances, 3 pawns for the piece is enough compo. and indeed the material count is zero.  However, if the extra piece is a bishop and there is a pair of them, and you have a knight, then heaven help you!  I found myself in that very position and thankfully Heaven did save me 10 rating points but boy it was a struggle.  So how did all this happen? Well, read on .......",
        "1... c5": "1. ...... c5. Sicilian Defense.",
        "2. c3": "2. c3. Closed Sicilian.",
        "2... Nf6 3. e5": "3. e5 - starting to transpose into an Alekhine's Defense.",
        "3... Nd5 4. Nf3 e6 5. Bc4": "5. Bc4 - development.",
        "5... d6 6. d4 cxd4 7. cxd4": "7. dxe4 - pawn trade.",
        "7... Nb6 8. Bd3 Be7 9. Nc3": "9. Nc3 - more development.",
        "9... Nc6 10. O-O Bd7 11. a3": "11. a3 - to prevent a move such as Nb4.",
        "11... Qc7 12. Be3 dxe5 13. dxe5 Nxe5 14. Nxe5 Qxe5": "14. ...... Qxe5 - oops and double oops!  After this plethora of exchanges I am now a pawn down.  For the foreseeable future, however I am keeping Henry upright and praying that my opponent will slip up.",
        "15. Re1 Qc7 16. Qg4": "16. Qg4 - with my material deficit it is imperative I keep my pieces active.",
        "16... g6 17. Rac1 Qd6 18. Red1": "18. Red1 - threatening Bxg6 discovering an attack onto the Wicked Witch of the West.  Thierry, however, sees this attack and the Witch moves out of the way.",
        "18... Qb8 19. Bxb6 axb6": "19. ..... axb6 - trying to neutralise the deficit by doubling Thierry's pawns.",
        "20. Qd4 e5 21. Qxb6": "21. Qxb6 - Glenda snaps up the loose pawn on b6 but does this mean the end of my problems?  We shall see.",
        "21... O-O 22. Bxg6": "22. Bxg6? - in hindsight this was a big error but I simply thought that after PxB, RxB I would be two pawns up.  Yup I got greedy and I got my knuckles rapped big time!",
        "22... Ra6 23. Qe3 Bg4 24. Bxf7+": "24. Bxf7+ the only way to minimise the damage is to isolate all of Thierry's remaining pawns so that they become targets for my remaining pieces.",
        "24... Rxf7 25. Rde1 Rg6 26. Qxe5": "26. Qxe5 - so Thierry dangles another pawn in Glenda's fizz.  I think this pawn capture was safe enough.  This brings the material count back to zero but Thierry has the better of it I fear.",
        "26... Qa7": "26. ...... Qa7 - and look at the Witch and that rook on f7 all ganging up on my poor little f pawn!",
        "27. Ne4 Bf3 28. Rc8+": "28. Rc8+ - a counter-attack which alas does not cut the mustard.",
        "28... Bf8 29. Ng3": "29. Ng3 - this shields the g2 pawn from attack - at least for a while.",
        "29... Bg4 30. Rc2": "30. Rc2 - now I must retreat my rook to defend the f2 pawn.",
        "30... Rgf6 31. Qe3": "31. Qe3 - aaaah - poor Glenda.  Now she must come back to defend that vulnerable f2 pawn, sigh and double sigh!",
        "31... b6": "31. ...... b6 - Thierry declines the queen trade.",
        "32. Qd4 Rg6 33. Re8": "33. Re8 - I just hate being tied down, absolutely hate it!",
        "33... Qd7 34. Qxd7 Rxd7": "34. ..... Rxd7 - now there is a queen trade.",
        "35. Rc1 Kf7 36. Rb8 Bc5": "36....... Bc5 - the power of the bishop pair is enormous.  In the first three Annotation Project games (The Demolition Derby Queen Sac), Master Freddy absolutely stressed that white must retain the bishop pair for as long as possible to compensate for the lost queen and to tie black down as much as possible.  Now it is tying me down, big time!",
        "37. Kf1": "37. Kf1 - Henry is desperately trying to avoid copping Old Matey on the back row and to release one of my rooks from defending it.  However, Thierry forces an exchange of this defending piece on the next turn.",
        "37... Rd1+ 38. Rxd1 Bxd1 39. Rd8": "39. Rd8 - trying to harry the light square bishop.",
        "39... Ba4 40. Ne4": "40. Ne4 - trying to activate my knight.",
        "40... Be7 41. Rd2 Bb5+ 42. Kg1 Rc6": "42. ..... Rc6 - Henry is back in Old Matey's shadow so I have to defend the back row again.  Note that creating luft on h2 or g3 would not be much use because of those bally bishops!",
        "43. Nc3 Bc4 44. Rd4": "44. Rd4 - trying to remain as active as possible.",
        "44... Ba6 45. g3": "45. g3 - maybe there is a possibility of Kh2 because at least I can screen off the h2-b8 diagonal with this move to enable me to play h3 or h4.",
        "45... Bxa3 46. bxa3 Rxc3": "46. .... Rxc3 - Thierry takes advantage of the fact that my b2 pawn is overloaded by taking my knight on c3.  I now have a piece for 2 pawn deficit but at least I do not have to face the bishop pair!",
        "47. Ra4 Bb7": "47. .... Bb7 - Old Matey looms once again.  Now if I play h3 or h4 mate can still be delivered by moving the black rook to h1.  Henry now makes for the centre of the board.",
        "48. Kf1 Ke6 49. Rb4": "49. Rb4 - threatening a rook fork on b6.",
        "49... b5 50. a4": "50. a4 - not Rxb5?? because of Ba6 pinning it to Henry.  I now use a pin on the b file to force a pawn trade.",
        "50... Bf3": "50. ..... Bf3 - again Old Matey hovers over Henry like the bad smell he is!",
        "51. Ke1": "51. Ke1 - Henry now gives himself d2 as a flight square.",
        "51... Rc4 52. Rxb5 Rxa4": "52. ...... Rxa4 - with the queenside pawns now off the board all I have to do is defend my kingside.  Salvation may be at hand!",
        "53. h4 Re4+ 54. Kd2 Re2+ 55. Kd3 Rxf2 56. Ke3": "56. Ke3 - for one happy moment I though this was a great king fork. Unfortunately the rook has f1 to go to and still defend the lsb.",
        "56... Rf1 57. Rb6+ Kf5": "57. ...... Kf5? - this is the move which enables me to draw the game.  On the next turn he cannot avoid the loss of his last pawn.  I was then thinking about The Master Game 1981 in which 15 year old GM Nigel Short managed to hold GM Vlastimil Hort to a draw when he had K & R against K, B and R.  Maybe it will happen here.",
        "58. Rh6 Kg4 59. Rxh7 Kxg3 60. Rg7+": "60. Rg7+ - I will not be able to hold my remaining pawn and so it will go into an endgame as in my above note.  Thierry decided not to play out the 50 move rule and he mentioned the fact that he thought the game was drawn in the chat.  I therefore hit the Offer Draw button and thankfully he accepted.  Well, my next annotation is coming up soon and that will certainly be worth waiting for!"
    },
    "url": "https://gameknot.com/annotation.pl/3-pawns-one-knight-v-the-bishop-pair?gm=54398",
    "gameName": "3 Pawns + One Knight v The Bishop Pair",
    "players": "jstevens1 (1853) vs. thitho (1758)",
    "opening": "Sicilian (B22), 2.c3, Heidenfeld variation"
}