{
    "moves": {
        "1. e4 c5": "The Sicilian Defense.",
        "2. f4": "An alternative to the main variation of this opening. White wants to attack on the kingside. If Black is not prepared for this opening, he could end up having difficulties, but when properly dealt with, 2.f4 is rather harmless.",
        "2... Nc6 3. Nf3 g6": "I need to fianchetto this bishop to add to my control of the central dark squares.",
        "4. Nc3 Bg7 5. Bb5": "Is sort of a pointless move, because after Bxc6 bxc6, I have another centre pawn and my position becomes more solid.",
        "5... e6": "Normally I play d6 and develop Nf6, but playing e6 and developing Ne7 is better here because my plan is to play d5 and gain space in the centre.",
        "6. e5": "A premature pawn push. You shouldn't advance a pawn into your opponent's territory if he has pawns on the adjacent files which can undermine it. I can attack White's pawn with f6 or d6.",
        "6... Nge7": "I don't want to attack the pawn yet, because Bxc6 chops off one of my pieces attacking the pawn. Ne7 leaves me a spare knight to replace the c6 one if White decides to exchange.",
        "7. O-O f6": "Now I begin undermining White's easily attackable pawn.",
        "8. Re1": "I thought exf6 was better, even though it gives me more pawns in the centre, but now White is most likely going to lose the e5 pawn because it's much easier to attack a pawn in MY territory than it is for White to defend it.",
        "8... fxe5 9. fxe5 a6 10. Bc4": "A bad move.\r\nWhite's bishop has no active role in the game, so he should've either exchanged it for my knight, or retreated to f1 to get it out of the way.",
        "10... b5": "Now I gain a tempo because of White's wrongful Bc4.",
        "11. Bf1 Qc7": "White's pawn has run out of defenders, and he must lose it.",
        "12. d3 Nxe5 13. Bf4 Nxf3+ 14. Qxf3 Qa7 15. Be3 Nf5": "I am threatening to play Nxe3 Rxe3 Bd4, winning a piece.",
        "16. Bf2 O-O 17. Qg4": "White wants to get his queen off the dangerous f-file",
        "17... d6": "I want to secure an indestructable centre by defending my pawns with pawns.",
        "18. Rab1": "Too passive.",
        "18... e5 19. Ne4 Nd4 20. Qd1 Qc7": "I thought about playing d5, giving me four pawns on the 4th rank, but sometimes having a pawn centre is a weakness since some of the pawns cannot be defended by other pawns.",
        "21. c3 Nc6 22. Qb3+ Kh8 23. c4 Be6": "This stops the threat on my pawn while developing a piece.",
        "24. Qc2 Nb4 25. Qb3 bxc4 26. dxc4 Bf5": "My bishop was not active enough on e6.",
        "27. a3 Nc6 28. Qd1 Ne7": "I want to maneuver my knight to f6, where it is more active and can reach my strong light squares on the kingside.",
        "29. b3": "A passive move. White should've moved his rook off my bishop's line of fire. The least he can do in a cramped position.",
        "29... Rad8 30. Rb2 Ng8": "Getting my knight to f6 will take a few moves.",
        "31. Ng5 Nf6 32. h3 h6 33. Nf3 g5": "Now my kingside is overwhelming. White can't do much in this position, but instead of suffering a slow and painful loss, he makes a blunder and gives me a pretty win.",
        "34. g4": "White is forgetting that he is weakening his knight.",
        "34... Nxg4": "Now I have loads of tactical threats. on White's kingside pieces, not to mention his rook on b2 is in line with my g7-bishop",
        "35. hxg4 Bxg4": "White has no more pawns to cover his king, so all I need is more pieces in my attack and White is finished.",
        "36. Be2 Qf7": "Bringing my queen into play was all I needed to finish my attack.",
        "37. Kg2 e4": "White's b2-rook is hanging, and his f3-knight is hanging, but also blocking my path to the f2-bishop. No matter what White does, he's going to have to drop a grip of material.",
        "38. Ng1": "This move loses faster than many others.",
        "38... Qxf2+": "Boom!",
        "39. Kh1 Qh4+": "Boom!!",
        "40. Kg2": "The only other move Nh3 doesn't get mated immidiately, but after Qxh3  Kg1 Qg3  Kh1, Rf2 forces mate.",
        "40... Rf2#": "BOOM!!!!"
    },
    "url": "https://gameknot.com/annotation.pl/32nd-gk-tournament?gm=1572",
    "gameName": "32nd GK tournament",
    "players": "ccanalescobo (1510) vs. bakerbaker (1619)",
    "opening": "Sicilian (B21), Grand Prix attack"
}