{
    "moves": {
        "1. e4 e5 2. Nf3 Nc6 3. Bb5": "Starting into a Ruy Lopez",
        "3... Nf6 4. d3 h6 5. Be3 b6 6. Nc3 Bb4 7. Bxc6 dxc6": "White has spotted the lack of protection on the King's pawn but  Black is compensated by having Queen and Bishop free.",
        "8. Nxe5 Bb7": "Cramps the light square bishop but allows for a strong position if castling on the queen's side.",
        "9. Qf3": "Pins the knight in position and tempts Black to castle king side, away from the protection of the Bishops.   Although care must be taken by black in castling king side as the queen becomes tied to the knight to avoid losing the h7 pawn to the dark square bishop.",
        "9... Qd6 10. Nc4 Qe6 11. Qg3": "Forking blacks undefended pawns.  However the threat is not serious as \r\n\r\n... 0-0-0\r\nQxg7  RdG8 \r\n\r\nwins back the pawn",
        "11... O-O-O 12. O-O": "The white queen still cannot take the tempting g7 pawn as\r\nQd7   RhG8\r\n\r\nfollowed by ... Qh3 \r\n\r\ncan cause serious problems if black can unleash the caged white square bishop on the centre diagonal.",
        "12... g5 13. Ne2 g4": "A curious move.  Perhaps black is trying to restrain the white queen?",
        "14. Nf4 Qe7 15. Qh4 Bd6": "?\r\nThis gives white time to re-enforce the attack on the black knight.\r\n...Knd5 would have forced whites hand and prevented the loss of material.",
        "16. Bd4 Bxf4 17. Bxf6 Bg5 18. Bxe7 Bxh4 19. Bxd8 Bxd8 20. Ne5 f5": "?\r\nThis allows white to open a file and put his linked rooks on it.\r\nAlthough black can now gain access to the long diagonal pointing towards White's king.",
        "21. exf5 h5 22. Ng6 Rg8 23. Rfe1 Kb8": "Avoiding the fork and forced exchange",
        "24. Nf4 h4 25. Nh5": "Offering the knight to the rook in order to gain extra squares for the passed pawn.",
        "25... Rg5 26. f6 Rxh5 27. f7 Rf5 28. Re8 Rxf7 29. Rxd8+ Bc8 30. Re1 Kb7 31. Ree8 Bd7 32. Rdb8+ Ka6 33. Re4": "Threatening mate allong the A file",
        "33... b5 34. b4": "This was a strange move - it was made because I pressed Submit when I meant to press Reset.  The move I wanted to play was a4.",
        "34... Bf5 35. Rf4 Re7": "White should not have left that open file.",
        "36. Kf1 Re5 37. d4 Rd5 38. a4 bxa4 39. c4": "Threatening the rook and hoping it retreats to allow the bishop to be captured and mate to the brought about.  The alternative is to lose the rook.",
        "39... Bd3+": "!!\r\nAn excellent move.  Completely nullifies White's threats and allows a serious threat of the pawn queening.",
        "40. Ke1 Bxc4": "??\r\n\r\nThe passed pawn should have been moved forward.  It could not have been stopped.",
        "41. Re4 a3 42. Re3 Ra5": ""
    },
    "url": "https://gameknot.com/annotation.pl/32nd-gk-tournament?gm=1543",
    "gameName": "32nd GK tournament",
    "players": "stevetaylor (1586) vs. darius-a (1466)",
    "opening": "Ruy Lopez (C65), Berlin defence, Mortimer variation"
}