{
    "moves": {
        "1. d4": "London Opening",
        "1... Nf6 2. Nf3 e6 3. Bf4 Ne4": "Black not contesting center",
        "4. Nbd2": "Develop Knight and look for early trade",
        "4... d5 5. e3 a6": "Looking to block Bishop b5 - but pointless move as if bishop did dvance then c6 would have worked and given black a stronger pawn structure. if situation did arise black could also block check with knight d7 and develop knight",
        "6. Bd3": "bishop develops as normal and mounts pressure on knight",
        "6... Nd7": "black misses fact exchange would favour white",
        "7. Nxe4 dxe4": "fork...but no back up",
        "8. Bxe4": "white owns center",
        "8... c6 9. O-O": "white developed and castles safly",
        "9... h6": "looking to stop advancing bishops & knights",
        "10. c3": "pawn structure finished off",
        "10... Nb6": "Knight eyeing up good out post on c4, also if queens moves A4 with a view to attack b2",
        "11. Bd3": "Bishop retreats to cover, as light squares are looking crowded",
        "11... h5": "Black looking to force a hole in whites king side cover... mistake as reopens g5 as an out post for white",
        "12. Ne5": "although e5 works as well and reduces blacks options",
        "12... Nd7": "exchange offered (and considered as 2 points up)",
        "13. Nxf7": "Sac the knight and destroy blacks chances of castling, with a view to chase the king into submission",
        "13... Kxf7 14. Qf3": "Queen moving in for attack, black must tread carefully not to lose queen.  Kg E8, BG6,Kg E7, BG5  black loses queen, if king not moved releaved check and queen taken with bishop.",
        "14... Kg8": "Only place to go. Although this will limit blacks chances of getting h rook into action. Whites pieces are all developed whereas black is stuck on the back row.",
        "15. e4": "White pressing forward, no real rush ",
        "15... g6 16. e5": "Pawn structure pointing towards stranded king, ",
        "16... Rh7": "Another mistake by black missing undefended pawn  g6",
        "17. Bxg6": "King totally exposed, whites postion is much stronger although point wise it's level (3 pawns for a knight)",
        "17... Qh4": "desperatly looking to fudge attack on H2",
        "18. Bxh7+": "force king into open and get a nice bishop rook sac, not bad as light squares are tied up with blacks pawns",
        "18... Kxh7 19. Qe4+": "again black must tread carfully as chance oof discovered attack & losing queen ",
        "19... Kh8": "only option",
        "20. Qf3 Nb6 21. Bg3 Qg5": "again black misses undefended piece",
        "22. Qxf8+ Kh7 23. Qf7+ Kh8 24. Qf6+": "force black to exchange ladies",
        "24... Qxf6 25. exf6": "but win a passed pawn as a prize :)",
        "25... Bd7": "black never rreally got bishop into play",
        "26. Rfe1": "looking to bring the rook into action to force home pawn",
        "26... Nd5 27. Bh4 Rf8 28. Re5": "black could exchange, ",
        "28... Nf4": "black hope to catch out white with a fork on g6",
        "29. g3 Ng6": "but...",
        "30. Rxh5+ Kg8 31. Rh6 Kf7": "black penned back in",
        "32. Rh7+ Ke8 33. Rh6": "Black resigns although not a clear end insight the onward march of whites army would crush black... "
    },
    "url": "https://gameknot.com/annotation.pl/35th-gk-tournament?gm=16846",
    "gameName": "35th GK tournament",
    "players": "daddyk (1497) vs. wmaes (1522)",
    "opening": "Queen's pawn (A46), Torre attack"
}