{
    "moves": {
        "1. e4": "King Pawn's Opening",
        "1... e5 2. Nf3 Nc6 3. Bc4": "Italian Game.",
        "3... Nf6": "Two Knights defence",
        "4. Nc3": "I decide to play safe, since I am a little unfamiliar with this.\n\nFour knights, Italian variation.\n\n",
        "4... Bb4 5. d3": "Not worried about Bxc3, cause that will end up being an advantage to me.  The pin will not last long due to my plan to castle.",
        "5... d6 6. O-O": "Removing the pin",
        "6... Bxc3": "Personally, I don't like trading bishops for knights in the opening till I know how the game will proceed.  The double pawns in the center is actually an asset to me.",
        "7. bxc3 Na5": "Ok, I don't want to lose my bishop here needlessly.  Move to b3 and if he takes I can either open the a file or undouble my pawns.",
        "8. Bb3 c5": "This creates some weakness on light squares when I have a light bishop.",
        "9. Bg5": "Pin",
        "9... b5": "Ok, so he is planning on pushing c4, causing grief for my bishop.  Cannot allow that.",
        "10. a4 Bd7 11. axb5": "Perhaps there was a better move, but I didn't see it at the time.  Maybe Bd5",
        "11... Bxb5 12. Bxf6": "Bxf6!.  If Qxf6, Rxa5.  gxf6 is force to save the knight.",
        "12... gxf6 13. c4": "Turn about is fair play here.  Push the bishop back.",
        "13... Bd7": "Really the only logical place to go.",
        "14. Qd2": "Double attack on the knight.",
        "14... Nc6 15. Ba4": "Partial pin on the knight through the bishop.",
        "15... Nb8 16. Bxd7+ Nxd7 17. Qh6": "Threatening 18. Qg7 Rf8 19. Qxh8.",
        "17... Qe7": "This stops the threat.  If 18. Qg7 Qf8.  I don't want to trade queens yet cause of my mobility and his exposed king.",
        "18. Nh4": "Working the knight to f5.",
        "18... Qf8 19. Qd2": "Not sure, but  probably better would have been Qe3.",
        "19... h5": "This move confused me, other than he wants to create space to get his queen and rook on the g file.",
        "20. Nf5 Qg8 21. Nxd6+": "Free pawn.",
        "21... Ke7 22. Nf5+ Ke8 23. Qe3": "Threatening c5 pawn (guarded by knight at d7.)   Also help protect castled position.",
        "23... Qg6": "Ok, he's going to line up on the file.  Also the h4 pawn push starts to complicate the game for me by disallowing Ng3 as a defensive move.",
        "24. h4": "Possible Nh4 would have been better.",
        "24... Rg8 25. Qf3": "Protect.",
        "25... Nb6 26. Ng3": "And block, also threatening Nxh5",
        "26... Rh8 27. Ra5": "Threaten c5.",
        "27... Nd7": "So this is the 3rd? time the knight has been at this square.  Seems like a waste of a lot of moves.",
        "28. Rfa1": "Attack (and win) a7.",
        "28... f5": "this just offers up a free pawn.  Perhaps he wants to get his knight to f6",
        "29. Nxf5 Nf6 30. Ra5xa7 Rxa7 31. Rxa7": "Ok, threatening Ra8 , winning the rook",
        "31... Kf8": "His only defense.",
        "32. Ra8+ Ne8": "Forced",
        "33. c3": "Semi-quiet move, threatening d4 and opening up the center.",
        "33... f6": "Creating room for his king and protecting N@e8 with the queen.",
        "34. Nd6": "Attacking the pinned knight.  Potential of Rxe8  Qxe8, Nxe8 Kxe8 Qxf6 if his next move doesn't preclude it.",
        "34... Kg7 35. Nf5+": "Ok, I want his king on the back rank.",
        "35... Kf7": "And he is not going quietly.",
        "36. Ra7+": "Trying to push him back on the back rank",
        "36... Kf8 37. Qe3": "Threaten Qxc5.",
        "37... Qg4": "??\n\nAllows mate in 2.",
        "38. Qxc5+": "Mate in 2 declared.\n\nif 38. ... Nd6 39. Qxd6  Kg8 40. Qb8#\nif 38. ... Nd6 39. Qxd6  Ke8 40. Qb8#\nif 38. ... Kg8 39. Qd5  Kf8 40. Qf7#"
    },
    "url": "https://gameknot.com/annotation.pl/36th-gk-tournament?gm=7672",
    "gameName": "36th GK tournament",
    "players": "kwijybo (1566) vs. mcbeer (1339)",
    "opening": "Two knights defence (C55)"
}