{
    "moves": {
        "1. e4 e5 2. Nf3 Bd6 3. Bc4 Nf6 4. Nc3 Nc6 5. O-O O-O": "Les deux camps se développent chacun de leur côté.",
        "6. d3 Re8 7. Bg5 h6 8. Bh4 Be7 9. h3 d6": "La position semble nulle, sauf si les joueurs attaquent !",
        "10. Nh2 Nd4": "Les blancs ne peuvent pas infiltrer leur cavalier à cause du Cf6 qui s'échangerait !",
        "11. f4 exf4": "Un échange différé.",
        "12. Bxf6 Bxf6 13. Rxf4 Be6 14. Bxe6 Rxe6": "Les noirs commencent à sortir leurs pièces, et le luft (h6) les protège en cas d'attaque sur le roque.",
        "15. Nd5 Bg5 16. Rg4 c6 17. Nf4 Bxf4 18. Rxf4": "Les blancs et les noirs ont beaucoup de mobilité sur l'aile roi, mais ce sont les noirs qui vont attaquer les premiers !",
        "18... Qg5 19. Rg4 Qe3+ 20. Kh1 Ne2": "L'attaque des noirs est particulièrement menaçante. Mon adversaire prendra le meilleur chemin pour stopper les menaces.",
        "21. Nf3 h5 22. Rg5 g6 23. c3": "Un très bon coup qui retire les menaces sur l'aile roi puisque les blancs bloquent méthodiquement l'attaque des noirs. Des coups comme 23. Dd2 ??, amenaient un mat en 5, à vous de le trouver ! Les blancs prévoient le 26e coup des noirs tout en renforçant leur défense.",
        "23... Qf2 24. Kh2 Rf6 25. Kh1 Ng3+ 26. Kh2 Nf1+": "Les noirs pouvaient aussi mettre le cavalier ailleurs, en e2, car après 27. Dxe2, Txf3 en profitant du clouage donnait une nulle facile ==.",
        "27. Qxf1 Rxf3 28. Qxf2 Rxf2": "Cette finale de Tours, à moins d'une grossière erreur, ne peut être gagnée par un camp ou l'autre.",
        "29. b3 Rc2 30. c4 Rc3 31. d4 Rd3 32. d5 c5 33. e5": "Instaurant des menaces de gain de pion et de promotion.",
        "33... Rd8 34. e6 Kg7": "Les noirs veulent pousser la tour en g5, qui gêne les déplacements et échanger le pion passé e6.",
        "35. exf7 Kxf7 36. Re1 Rg8": "36... Td2 avec un pion chacun après 37. Te6 Txa2 38. Txg6 Th8.",
        "37. Re6 Rd2 38. Rxd6 Rxa2 39. Rd7+ Kf6": "Les noirs essaient de repousser la Tg5, avec succès et réalisent leurs deux plans de base :\n1. Echanger le pion e6\n2. Repousser la tour en g5\nTout est promis pour une nulle rapide, et pourtant ...",
        "40. Rg3 b6 41. Re3 Ra3 42. h4 Rg7": "A marquer de trois points d'interrogation. Les noirs ont complètement oublié la Tour e3, espérant que les blancs échangent les tours, mais c'est la leur qu'ils vont perdre après ...",
        "43. Re6+": "Ce coup expulse le roi noir en f5, où il offre sa Tg7 suivi d'un mat rapide. Les noirs abandonnent. Une très bonne partie pour les blancs, qui se sont bien développés, qui ont paré une intéressante attaque sur le roque, et qui n'ont pas craqué en finale ( Bravo, Roberto ! :-) ) et pour les noirs, qui, avec 500 points Elo de moins, ont réussi à bien se développer, à attaquer le roque de l'adversaire avant d'offrir leur tour en finale.\nMerci de m'avoir lu et au plaisir de (re)jouer contre vous, qui sait ? :) Annoté par Villiers"
    },
    "url": "https://gameknot.com/annotation.pl/37-years-and-11-years-who-wins-the-young-or-the-veteran?gm=17024",
    "gameName": "37 years and 11 years, who wins ? The young or the veteran ?",
    "players": "roberto1971 (1729) vs. villiers (1230)",
    "opening": "King's knight opening (C40)"
}