{
    "moves": {
        "1. e4 e5 2. Nf3 Nc6 3. Bb5": "Spanish. Personally I prefer playing against sicilian setups, especially in blitz games I'd rather play a level sicilian double-edged position than slightly advantageous Spanish position.",
        "3... a6 4. Ba4 Nf6 5. O-O b5": "Black differs from mainlines, but this is still a popular choice",
        "6. Bb3 Bc5": "6...Bb7 is the Archangelsk variation.",
        "7. c3": "7.a4 straight away is possible",
        "7... d6 8. d4 Bb6": "Black wisely avoids the exchange, as his dark-squared bishop is sitting in his favourite diagonal and it's generally better to keep the central tension unless there is some advantage in braking it.",
        "9. Bg5": "White's e-pawn is hanging, so he has no time to prevent black from pinning the f3-knight. White would like to play Nd2, but then the bishop would be sadly placed with no place to go.\n\nHowever, white could easily play 9.a4 which should be better than the text.",
        "9... h6 10. Bh4 Bg4": "10...g5 appears to be too committal as black doesn't really win a pawn - white can take the e5 pawn after 11.Bb3 Nxe4 12.dxe5",
        "11. d5": "After this move I had a feeling that things had gone wrong for white - I just don't know when. White's position is rather cramped, as his b2-knight is unable to move for a while and there is no activity in white's camp.  Altough it must be said that white is still solid - I just thought during the game that I had somewhat failed the opening. ",
        "11... Na5": "Most natural. The Knight is heading for c4 where it has great influence.",
        "12. Bc2": "? I really don't like this move. This bishop is merely sitting in a corner and doing nothing. 12.Nbd2 is more atractive, as it prevents the black knight landing into c4. 12...Nxb3 is nothing to be afraid of, because as I said, this bishop hasn't got great value any more. Now black sees that he is better co-ordinated and goes for an attack.",
        "12... g5 13. Bg3 Nh5 14. Kh1": "Black has given up castling and made f7-his weakest link - and this is what whites defensive idea is based. Desperately for some activity, he decides to recapture with the f-pawn to open the f-file, which should act as a barrier for black to manoeuvre his heavy pieces to the kingside. This is a risky decision, but not necessary a bad one",
        "14... Nxg3+ 15. fxg3 h5": "Black really should've played 15...Nc4, eying b2 and e3. This would've given black the advantage, as something like 16.Qc1 is forced. Now white is happy to prevent it.",
        "16. Nbd2": "Now black no longer has so obvious advantage.",
        "16... h4 17. Qe1": "! This short move activates the queen in suprisingly way. Now ...hxg3 is answered with Qxg3 activating queen and white has ideas with gxh4",
        "17... Qe7 18. a4": "Finally white can start his attack on the queenside.",
        "18... Bxf3 19. Rxf3": "19.Nxf3 Nc4 is not how I wanted to play",
        "19... g4 20. Rf5 Nc4": "This damages blacks pawn structure, so maybe it would have been better to think of some other plan. As a plus side for black, this prevents opening of the a-file, which is almost always advantageous for white in Spanish positions.",
        "21. Nxc4 bxc4 22. gxh4": "To activate or exchange the queen",
        "22... Qxh4": "I prefer 22...Rxh4, because white has some structural advantage in view of blacks weaknesses on a6, c7, c4, f7 and g4. White has helthier pawn structure and his main weakness is his king safety. All this in mind, I think queen exchange is for white's favour.",
        "23. Qxh4 Rxh4 24. Bd1": "Note that the opposite colour bishops is not really a drawing factor, as this is no pure opposite colour bishop ending. Moreover, most of blacks weaknesses are on light squares, so...",
        "24... Ke7": "Here I analyzed some very unrelevant, but interesting lines.\n\n24...Rb8!? 25.Be2? Be3 26. g3 Rxb2! 27. gxh4 Rxe2 28.h5 Bf4 29.Rxf4(what else?) exf4 30.Rb1 (threatens h5) Re3 (-Rh3 is deadly, stops the passer and threatens ...g3) - \n30.Rg1 f3 31.h6 (31.Rxg4 Re1  32.Rg1 f2- )Kf8 - \n\nIt took me a while, but sometimes simpler means are better. \n25.g3 and black rook on b8 is not playing.\n\nNote that 24...0-0-0 is bad since it drops the f-pawn and puts the king on the h3-c8 diagonal.",
        "25. g3": "Taking the pawn seems dangerous, but white has everything under control",
        "25... Rh6 26. Bxg4 Rg8": "This is the test.",
        "27. Rh5": "! This elastic band gives white a chance to save his bishop and his g-pawn.",
        "27... Rhg6 28. Be2 Rg6g5 29. Rxg5 Rxg5 30. Bxc4": "Simply picking some pawns. Passers on both sides of the board would decide the game",
        "30... f5 31. Bxa6": "There is no need for white to allow any counterplay. 31.exf4 would only create some very unnecessary fuss. White wants to keep it simple and clean.",
        "31... f4": "31...fxe4 and the e4-pawn would hardly survive, leaving white with two connected passed pawns on the kingside.",
        "32. Kg2 fxg3 33. hxg3": "And black resigned. He is three pawns down and has no counterplay"
    },
    "url": "https://gameknot.com/annotation.pl/38th-gk-tournament?gm=11014",
    "gameName": "38th GK tournament",
    "players": "moppa (1718) vs. halyn (1820)",
    "opening": "Ruy Lopez (C78), Wing attack"
}