{
    "moves": {
        "1. e4 e6 2. Nf3 d5 3. e5 c5 4. d4 Nc6 5. Bb5 Bd7 6. Nc3 Nge7 7. Ng5": "7. Ng5 ?, a free pawn here, and may be more as we shall see",
        "7... cxd4 8. Qf3": "8. Qf3?  I cant stop thinking that the white underestimated the black side here, trying to finish the game so quickly while he is not prepared to ...",
        "8... Nxe5": "8. Nxe5 !, Nice and smooth, removing the threat, forcing the white queen to withdraw, and wining a free piece !",
        "9. Qe2 dxc3 10. Bd3 Nxd3+ 11. Qxd3 Nc6 12. bxc3 Qf6 13. Bd2 Ne5 14. Qd4 b6 15. O-O Bc5 16. Qh4 h6": "16. ... - h6!, a good move, seems like the black can't take the Knight at g5 because the pin at h6, but that pin was (virtual) as the black can solve this problem with Ng6! ",
        "17. Rab1": "17. Ra-b1 ?, White still in shock from loosing a piece earlier, and putting himself in a bad position and facing the possibility of losing another piece !",
        "17... Ng6": "17. Ng6!, Brilliant ... another surprise for the white, now the black has to choose between his knight and his queen, moreover, the dangerous h file is now open for action !",
        "18. Qh3 hxg5 19. Qd3 Bd6 20. Rfe1": "20. Rf-e1, trying to prevent Qe5, but the black has another idea.",
        "20... Bxh2+ 21. Kf1": "From this point, i have put my eye on the position of the White's king and queen, a dangerous position and i tried to make the most of it.",
        "21... a6": "The main idea is to get the black bishop to b5.",
        "22. Rxb6 g4": "Ambitious, and distracting the black at the same time",
        "23. Rxa6 Rb8": "Black doesn't care much about material now, getting where i want is the main thing here.",
        "24. c4 g3 25. f3 dxc4 26. Qxc4 Bb5": "Mission accomplished !, after this move, my adversary sent me a message to admire it.",
        "27. Qxb5+ Rxb5 28. c3 Qf5 29. Re3": "Preventing the white form threatening the white king at d3, but every problem has a solution.",
        "29... Qb1+ 30. Ke2 Nf4#": ""
    },
    "url": "https://gameknot.com/annotation.pl/38th-gk-tournament?gm=10833",
    "gameName": "38th GK tournament",
    "players": "m0rbuz (1269) vs. fattouh (1018)",
    "opening": "French (C00), Wing gambit"
}