{
    "moves": {
        "1. e4": "I believe this game shows the importance of holding on to the initiative.\n\ne4 - my standard opening, usually leading to some variation of the scotch game, which I prefer as it leads to an open game ",
        "1... c5": "opens with the Sicilian, one of the most popular black responses",
        "2. Nf3 Nc6 3. Bb5": "At this point I normally play d4, leading to a position similar to Scotch opening so familiar to me, but I decided to do something more attacking and initiative grabbing, I opted for the more active Bb5, challenging the knight's desire to dominate d4.",
        "3... Qb6": "Black played Qb6, possibly to keep the pressure on d4, and also on the bishop which had no support.",
        "4. Bxc6": "I could have tried Nc3 supporting the bishop and developing another piece, but opted instead to exchange as I liked the idea of black having to tie up a major piece like a queen to bolster d4. Also, after the exchange, I would have had one knight out as opposed to his having an exposed queen out.",
        "4... Qxc6": "A bit surprised with the queens move, as this makes it blocked behind the c pawn, and losing control of the black diagonals. Also doubled c file pawns is not that bad, as they can exert influence on d5, and help with the eventual pawn break. Perhaps he was hoping to take out e4 for an easy kill.",
        "5. Nc3": "Out comes another knight. Now I have two minor pieces out, as opposed to zero for him. Plus, the option to castle quickly as needed, giving me a lead in development.",
        "5... Nf6": "Continues the attack on e4, and preparing to castle himself",
        "6. d3": "easy enough to defend with the d pawn, strengthening the center and also opening my DSbishop.",
        "6... d6": "Opening the LSB to possibly pin my knight on f3, and also bringing a minor piece to support c5.",
        "7. h3": "stopping the bishop pin, at the expense of weakening the castled king in the future. But I like my knight where it was, and did not like to exchange with bishop as this was going to be a closed game, and as they say, knights are better than bishops in closed games.",
        "7... e5": "Asserting himself on d4, BUT \n\n1. Created a backward pawn on d6, and more importantly\n2. Created a juicy hole on d5 for my knight. ",
        "8. Bg5": "Preparing to embed my c3 knight on d5 by taking out the knight on f6 with the bishop (closed game - knights better)",
        "8... Be7": "Does not want to exchange with g7, hence the bishop. But this move does not stop my obvious plan.",
        "9. Bxf6 Bxf6 10. Nd5": "The knight has found his golden throne.",
        "10... Bd8": "Black wants the dark squared diagonal, with a possible check on a5, which would make me weaken the pawn structure, or move one of my knights to the defence. ",
        "11. O-O": "Time to move to safety.",
        "11... Be6": "Black obviously does not like my knight so comfortable in the 5th rank.",
        "12. c4": "I want the knight there, and also further strengthen the center.",
        "12... O-O 13. Qd2": "connecting the rooks, I could have chosen e2 as I was preparing to play on the king side, but I thought the queen could have a more active role on the dark diagonals in the meantime until black commits his black bishop to the queen side. This way the queen could go easily to either queen or king side depending on how black moves.",
        "13... Qa6": "activates his queen.",
        "14. Rfb1": "I could see black was trying for play on the queen side, hence decided to move the rook to defend the b-file in preparation of a pawn push along the b file, to cramp the black pieces on the queen side. I should probably have moved b3, with the queen supporting a2, and then move Ra1 to b1. Rf1 to b1 locked in the rook on the a - file",
        "14... Ba5 15. Qe2": "move out of the way to e2 as originally planned. The 2 rooks should be able to fight well on the queen side, while I prepare the assault on the king side.",
        "15... Kh8": "the black bishop move to a5 weakened the e7 square, which would be quite helpful to me during my attack whenever it happened. Black moves his king away fearing my knight would check him, but I had no desire to do that without proper co-ordination from the other forces, which were still in the preparatory stages for the attack. So he wasted his move I think, losing more initiative.",
        "16. b4": "the b pawn move. I could have prepared better with a3 then the b pawn move, but \n1. the bishop would not dare take the b pawn as I could do the Nc7 forking attack (I was hoping he would).\n2. If he captures with c5, this would create a nice file for me to play the rooks on, with a b4 pawn that cannot be protected by another pawn soon enough. \n\nAt this point, it seems his pieces are kind of stuck along the edge.",
        "16... Bxd5": "The knight was getting too powerful, eyeing b4, c7, e7, hence black wanted the exchange.",
        "17. b5": "I had to pick one of his bishops- in my opinion the white one, as the black bishop was bad with his pawns on the dark squares, plus the white bishop was a potential defender on the king side. I overlooked BC3, a mistake. If I had seen that, I would have probably done bxa5, then played the rooks on the open file. At this point, it seemed limiting blacks queen further, and gaining space on the queen side, then taking the white bishop would be a good move.",
        "17... Qb6 18. exd5": "I took him with the e pawn to open up the king side a little more so I could attack with more ease.",
        "18... Bc3": "The unforeseen gets seen.",
        "19. Ng5": "Decision time - \n\na. Attack immediately and exploit any advantages I had built up for so long, \n\nor \n\nb. Be doomed to die a slow \"death by exchange\".",
        "19... Bxa1": "I knew black would give me one more move to launch the attack, and harass the king to at least go for a draw.",
        "20. Qh5": "threatening mate on h7, and eyeing f7. Now black has to weaken his defence.",
        "20... h6 21. Rxa1": "By exchanging his bishop, black is ahead in exchanges, but he has also lost any chances at a queen side attack, allowing me to concentrate on my attack. I am 2 points down, but in return, black has to dance to my tune.",
        "21... f6": "I am sure he had other defensive moves better than f6. Maybe Kg8, or qc7. He ends up giving up e6 for good.",
        "22. Ne6": "A knight in the 6th rank plus a queen can cause a lot of trouble as the following moves show.",
        "22... Rfe8 23. Qf7 Reg8 24. f4 exf4 25. Nxf4 a6": "opening the queen side for his attack too late, without considering defence options. I think he should have concentrated on defending the king side rather than launch a counter attack. So I just ignored it as I could now smell blood",
        "26. Ng6+ Kh7 27. Ne7 Rge8 28. Re1": "I was hoping for a draw, but by allowing me to bring in a third attacker into the picture, without any new defenders showing up, brightened my chances for a clean win with a few tactical maneuvers.",
        "28... axb5 29. Re4 bxc4 30. Rg4 Qb1+": "Black launches a weak attack a few moves too late, and a few pieces short.",
        "31. Kh2 Reg8 32. Nf5": "2 defenders vs. 3 attackers - win is a foregone conclusion",
        "32... Kh8 33. Rxg7 Qh1+ 34. Kxh1 cxd3 35. Rh7#": ""
    },
    "url": "https://gameknot.com/annotation.pl/39th-gk-tournament?gm=17639",
    "gameName": "39th GK tournament",
    "players": "123bid (1589) vs. wizard_putnam (1652)",
    "opening": "Sicilian (B30), Nimzovich-Rossolimo attack (without ...d6)"
}